{
  "name": "A. Antony Franklin",
  "homepage": "http://www.iith.ac.in/~antony/index.html",
  "status": "success",
  "content": "Antony Franklin, Associate Professor, IITH Antony Franklin About Me Publications Research Teaching Awards/News Contact Antony Franklin Associate Professor, Department of Computer Science and Engineering Indian Institute of Technology Hyderabad Office: 412, Academic Block C IITH, Kandi Village, Sangareddy - 502 285 Email: antony.franklin [at] iith [dot] ac [dot] in I am an Associate Professor with the Department of Computer Science and Engineering at Indian Institute of Technology Hyderabad. I received my PhD from Indian Institute of Technology Madras in 2010. I work in the broad area of Wireless Networks. I am currently working on the next generation mobile network protocols and systems. I am associated with the Networked Wireless Systems (NeWS Lab) at IITH. SELECTED PUBLICATIONS RAN-aware adaptive video caching in multi-access edge computing networks, ShashwatKumar, Sai VineethDoddala, Antony Franklin,and JiongJin, Journal of Network and Computer Applications, 2020. Apt-RAN: A Flexible Split Based 5G RAN to Minimize Energy Consumption and Handovers, Himank Gupta, Mehul Sharma, Antony Franklin A, and Bheemarjuna Reddy Tamma, IEEE Transactions on Network and Service Management, 2020 A Complete Solution to LTE-U and Wi-Fi Hidden Terminal Problem, Touheed Anwar Atif, Anand M. Baswade, Bheemarjuna Reddy Tamma, and Antony Franklin A, IEEE Transactions on Cognitive Communications and Networking, 2019 Impact of Virtualization Technologies on Virtualized RAN Midhaul Latency Budget: A Quantitative Experimental Evaluation, Francesco Giannone, Koteswararao Kondepu, Himank Gupta, F Civerchia, Piero Castoldi, A Antony Franklin, Luca Valcarenghi, IEEE Communications Letters, 2019 LAW: A Novel Mechanism for Addressing Hidden Terminal Problem in LTE-U and Wi-Fi Networks, Anand M Baswade, Touheed Anwar Atif, Bheemarjuna Reddy Tamma, Antony Franklin, IEEE Communications Letter, 2018 A novel coexistence scheme for IEEE 802.11 for user fairness and efficient spectrum utilization in the presence of LTE-U, Anand M Baswade, Touheed Anwar Atif, Bheemarjuna Reddy Tamma, Antony Franklin, Computer Networks, 2018 LTE WiFi Radio Level Integration at RLC layer: A Demo of LWIR, Thomas Valerrian Pasca Santhappan, Himank Gupta, Sumanta Patro, Bheemarjuna Reddy Tamma, and Antony Franklin, IEEE COMSNETS (Demos and Exhibits), Jan. 2018 (Best Academic Demo Award) A Real-Time Performance Evaluation of Tightly Coupled LTE Wi-Fi Radio Access Networks, Thomas Valerrian Pasca, Sumanta Patro, Bheemarjuna Reddy Tamma, Antony Franklin A, IEEE ANTS, Dec. 2017 (Second Best Paper Award) Network Coordination Function for Uplink Traffic Steering in Tightly Coupled LTE Wi-Fi Networks Thomas Valerrian Pasca, Sumanta Patro, Bheemarjuna Reddy Tamma, Antony Franklin A, Computer Networks, 2017 Channel Management in IEEE 802.22 WRAN Systems, Gwangzeen Ko, A. Antony Franklin, Sung-Jin You, Jin-Suk Pak, Myung-Sun Song, Chang-Joo Kim, IEEE Communications Magazine, 2010 [FULL LIST] TEACHING (Jan. 2021) CS5453 - Internet of Things CS6903 - Network Security (with Dr. Bheemarjun, Dr. Kotaro and Dr. Praveen) Ph.D STUDENTS Anand Baswade (Jointly with Dr. Bheemarjuna Reddy) (2014 - 2019) - Joined IIT Bhilai Shashwat Kumar (2015 - ~) - under Swinburne University Joint PhD Program Venkatrami Reddy (Jointly with Dr. Bheemarjuna Reddy) (2017 - ~) Nabhasmita Sen (2017 - ~) Supriya Dilip Tambe (2018 - ~) under Swinburne University Joint PhD Program Shwetha Vittal (2019 - ~) Neha Joshi (2019 - ~) Prabodh C P (2020 - ~) Prashanth P S (2020 - ~ M.TECH STUDENTS Himank Gupta (2016 - 2018) Joined Denso Japan Gaurav Garg (2016 - 2019) Joined Mathworks India Tulika Agrawal (2017 - 2020) Joined Microsoft Mehul Sharma (2017 - 2020) Joined Qualcomm Mohit Kumar Singh (2017 - 2020) Joined Microsoft Magdum Suhel Sajjan (2017 - 2020) Joined Qualcomm Yogesh Mandge (2018 - ~) Jyoti Tiwari (2018 - ~) Prashansa Agrawal (2018 - ~) Aditya Chilukuri (2019 - ~) Sourav Sarkar (2019 - ~) Akshitha Shinde (2019 - ~) Bhavishya Sharma (2020 - ~) Sayon Deep (2020 - ~) Antony Franklin, Assistant Professor, CSE, IITH",
  "content_length": 4089,
  "crawl_time": "2025-12-01 12:00:17"
}