{
  "name": "A. B. Siddique 0001",
  "homepage": "http://cs.uky.edu/~siddique",
  "status": "success",
  "content": "A.B. Siddique A.B. Siddique (Muhammad Abu Bakar Siddique) Assistant Professor NLP | LLMs | Gen. AI | ML Zero-shot Learning | LLMs Interpretability Safe, Personalizable Conversational AI Here is my CV ab.siddique uky.edu Department of Computer Science Davis Marksbury Building, Room # 321 University of Kentucky Lexington, KY 40506-0633 Research Interest My research interests include natural language processing, information retrieval, and scalable data science. In particular, I investigate large language models and safe conversational AI systems, with an emphasis on zero-shot generalization, personalization, and interpretability. My research program is highly collaborative. I work with domain experts across diverse areas, including cybersecurity, software engineering, cyber physical systems, edge intelligence, spatial databases, and under-resourced languages like medieval Latin. My research has appeared in top venues such as WWW, SIGIR, KDD, S&P, and VLDB. I am looking for motivated and hard-working PhD students who are interested in LLMs/NLP to join my research group. Research Grants NSF Collaborative Research: CPS: Medium: Calfhealth: An Explainable AI Framework for the Early Detection of Pneumonia in Dairy Calves through Precision Technologies; PI: Simone Silvestri, co-PI: A.B. Siddique, collaborators: Michelle Segovia (University of Delaware) and Melissa Cantor (Penn State). Total Funding Amount: $1,1000,000; University of Kentucky Share: $941,359; Start Date: 09/1/2025, End Date 8/31/2028. Details NSF Collaborative Research: SaTC: CORE: Small: Toward Personalized and Trustworthy Mobile App Recommendations via Grounding App Behaviors; PI: A.B. Siddique, collaborator: Umar Farooq (Louisiana State University). Total Funding Amount: $599,994; University of Kentucky Share: $300,000; Start Date: 10/1/2025, End Date 9/30/2028. Details NSF III: Small: Toward User-Centric Task-Oriented Dialog Systems via Zero-shot Adaptation and Personalization; PI: A.B. Siddique, co-PI: Brent Harrison. Funding Amount: $599,898; Start Date: 9/1/2024, End Date 8/31/2027. Details NSF Planning: DCL EPSCOR: CISE Large: Distributed Edge Intelligence in Support of Next-Generation Applications; PI: Simone Silvestri, co-PIs: A.B. Siddique, and collaborators from Penn State University. Funding Amount: $100,000; Start Date: 10/1/2024, End Date 9/30/2026. Details Internal Research Grants Mitigating Bias in Pre-trained Large Language Models; PI: A.B. Siddique; Funding Amount: $49,769. Details Improving Archival Discovery Using a Natural Language Query Interface for Finding Aids; PI: A.B. Siddique, co-PIs: Andrew McDonnell, Cindi Blyberg, Megan Mummey, Neal Powers; Funding Amount: $42,712. Details Large Language Models for Understanding Medieval Manuscripts; PI: Abigail Firey, co-PI: A.B. Siddique, Funding Amount: $50,000. Details Publications Muhammad Umair Haider, Hammad Rizwan, Hassan Sajjad, Peizhong Ju, and A.B. Siddique. Neurons Speak in Ranges: Breaking Free from Discrete Neuronal Attribution, arXiv preprint arXiv:2502.06809, 2025. Accepted for presentation at Mechanistic Interpretability Workshop at NeurIPS 2025. Muhammad Umair Haider, Umar Farooq, A.B. Siddique, and Mark Marron. Looking into black box code language models, arXiv preprint arXiv:2407.04868, 2024. Accepted for presentation at Mechanistic Interpretability Workshop at NeurIPS 2025. Moghis Fereidouni, Muhammad Umair Haider, Peizhong Ju, and A.B. Siddique. Evaluating Sparse Autoencoders for Monosemantic Representation, arXiv preprint arXiv:2508.15094, 2025. Krishna Upadhyay, Vinaik Chhetri, A.B. Siddique, and Umar Farooq. Analyzing the Evolution and Maintenance of Quantum Software Repositories, In Proceedings of the 2025 IEEE International Conference on Quantum Software, 2025. Best Paper Award Joseph Strauss, Krishna Upadhyay, A.B. Siddique, Ibrahim Baggili, and Umar Farooq. Assessing and Enhancing Quantum Readiness in Mobile Apps, In 46th IEEE Symposium on Security and Privacy, 2025 (S&P). Moghis Fereidouni, Md Sajid Ahmed, Adib Mosharrof, and A.B. Siddique. Improving Multi-turn Task Completion in Task-Oriented Dialog Systems via Prompt Chaining and Fine-Grained Feedback, arXiv preprint arXiv:2502.13298, 2025. Adib Mosharrof, Moghis Fereidouni, and A.B. Siddique. Evaluating and Enhancing Out-of-Domain Generalization of Task-Oriented Dialog Systems for Task Completion without Turn-level Dialog Annotations, arXiv preprint arXiv:2502.13310, 2025. Vinaik Chhetri, Krishna Upadhyay, A.B. Siddique, and Umar Farooq. What Users Value and Critique: Large-Scale Analysis of User Feedback on AI-Powered Mobile Apps, arXiv preprint arXiv:2506.10785, 2025. MH Maqbool, Moghis Fereidouni, Umar Farooq, A.B. Siddique, and Hassan Foroosh. INTERPOS: Interaction Rhythm Guided Positional Morphing for Mobile App Recommender Systems, IEEE 19th International Conference on Semantic Computing (ICSC), (IEEE), 2025. Vinaik Chhetri, Yousaf Reza, Moghis Fereidouni, Srijata Maji, Umar Farooq, and A.B. Siddique. A Framework for Generating Conversational Recommendation Datasets from Behavioral Interactions, arXiv preprint arXiv:2506.17285, 2025. Muhammad Hasan Maqbool, Moghis Fereidouni, A.B. Siddique, and Hassan Foroosh. Model-agnostic zero-shot intent detection via contrastive transfer learning, International Journal of Semantic Computing, (World Scientific Publishing Company), Volume 18, 2024. Halima Abukadah, Moghis Fereidouni, and A.B. Siddique. Mapping natural language intents to user interfaces through vision-language models, 2024 IEEE 18th International Conference on Semantic Computing (ICSC), (IEEE), 2024. Srijata Maji, Moghis Fereidouni, Vinaik Chhetri, Umar Farooq, and A.B. Siddique. MobileConvRec: A conversational dataset for mobile apps recommendations, arXiv preprint arXiv:2405.17740, 2024. Moghis Fereidouni, Adib Mosharrof, and A.B. Siddique. Grounded language agent for product search via intelligent web interactions, Proceedings of the 1st Workshop on Customizable NLP (EMNLP '24): Progress and Challenges in Customizing NLP for a Domain, Application, Group, or Individual (CustomNLP4U). Adib Mosharrof, and A.B. Siddique. Training Zero-Shot Generalizable End-to-End Task-Oriented Dialog System Without Turn-level Dialog Annotations, arXiv preprint arXiv:2407.15055, 2024. Ayesha S Dina, A.B. Siddique, and D Manivannan. A deep learning approach for intrusion detection in Internet of Things using focal loss function, Internet of Things, (Elsevier), Volume 22, 2023. Muhammad Hasan Maqbool, Umar Farooq, Adib Mosharrof, A.B. Siddique, and Hassan Foroosh. Mobilerec: A large scale dataset for mobile apps recommendation, Proceedings of the 46th international ACM SIGIR conference on research and development in information retrieval, 2023. Muhammad Hasan Maqbool, Fahad Ahmed Khan, A.B. Siddique, and Hassan Foroosh. Robust zero-shot intent detection via contrastive transfer learning, 2023 IEEE 17th International Conference on Semantic Computing (ICSC), (IEEE), 2023. Adib Mosharrof, Moghis Fereidouni, and A.B. Siddique. Toward Open-domain Slot Filling via Self-supervised Co-training, Proceedings of the ACM Web Conference 2023, 2023. Adib Mosharrof, Muhammad Hasan Maqbool, and A.B. Siddique. Zero-shot generalizable end-to-end task-oriented dialog system using context summarization and domain schema, arXiv preprint arXiv:2303.16252, 2023. Dina Ayesha S, and A.B. Siddique. FS3: Few-shot and self-supervised framework for efficient intrusion detection in Internet of Things networks, Proceedings of the 39th Annual Computer Security Applications Conference, 2023. Ayesha Siddiqua Dina, A.B. Siddique, and D Manivannan. Effect of balancing data using synthetic data on the performance of machine learning classifiers for intrusion detection in computer networks, Ieee Access, (IEEE), Volume 10, 2022. Muhammad Hasan Maqbool, Luxun Xu, A.B. Siddique, Niloofar Montazeri, Vagelis Hristidis, and Hassan Foroosh. Zero-label anaphora resolution for off-script user queries in goal-oriented dialog systems, 2022 IEEE 16th International Conference on Semantic Computing (ICSC), (IEEE), 2022. A.B. Siddique, Muhammad Hasan Maqbool, Kshitija Taywade, and Hassan Foroosh. Personalizing task-oriented dialog systems via zero-shot generalizable reward function, Proceedings of the 31st ACM International Conference on Information & Knowledge Management, 2022. Moghis Fereidouni, Adib Mosharrof, Umar Farooq, and A.B. Siddique. Proactive prioritization of app issues via contrastive learning, 2022 IEEE International Conference on Big Data (Big Data), (IEEE), 2022. A.B. Siddique, Fuad Jamour, and Vagelis Hristidis. Linguistically-enriched and context-awarezero-shot slot filling, Proceedings of the Web Conference 2021, 2021. Ahmed Eldawy, Vagelis Hristidis, Saheli Ghosh, Majid Saeedan, Akil Sevim, A.B. Siddique, Samriddhi Singla, Ganesh Sivaram, Tin Vu, and Yaming Zhang. Beast: Scalable exploratory analytics on spatio-temporal data, Proceedings of the 30th ACM International Conference on Information & Knowledge Management, 2021. Nhat Le, A.B. Siddique, Fuad Jamour, Samet Oymak, and Vagelis Hristidis. Predictable and adaptive goal-oriented dialog policy generation, 2021 IEEE 15th International Conference on Semantic Computing (ICSC), (IEEE), 2021. Best Paper Award Nhat Le, A.B. Siddique, Fuad Jamour, Samet Oymak, and Vagelis Hristidis. Generating predictable and adaptive dialog policies in single-and multi-domain goal-oriented dialog systems, International Journal of Semantic Computing, (World Scientific Publishing Company), Volume 15, 2021. A.B. Siddique, Fuad Jamour, Luxun Xu, and Vagelis Hristidis. Generalized zero-shot intent detection via commonsense knowledge, Proceedings of the 44th International ACM SIGIR Conference on Research and Development in Information Retrieval, 2021. A.B. Siddique, Samet Oymak, and Vagelis Hristidis. Unsupervised paraphrasing via deep reinforcement learning, Proceedings of the 26th ACM SIGKDD international conference on kn",
  "content_length": 13242,
  "method": "selenium",
  "crawl_time": "2025-12-01 12:14:37"
}