{
  "name": "Aaditeshwar Seth",
  "homepage": "http://www.cse.iitd.ernet.in/~aseth",
  "status": "success",
  "content": "Home page of Aaditeshwar Seth Aaditeshwar Seth Announcement: We are looking for students at all levels (PhD/Masters/Bachelors), research assistants, post-doc fellows, and software engineering professionals with 0-8 years of experience, to build the CoRE Stack, an extremely ambitious and impactful digital public infrastructure for climate change adaptation for rural communities. Please see this list of ongoing projects to get a sense of the work and corresponding skillsets. Some ideas for new PhD topics are here. Interested students can email me their CVs and also read this note on our research philosophy. Interested research assistants, please read this job description. Interested software engineers seeking full-time employment, please see this job description. This is the place to be if you are eager to make a meaningful change in the world with your work. Do note that we are not supporting short-term (< 6 months) or remote internships right not. I am a professor in the Department of Computer Science and Engineering at IIT Delhi and run the ACT4D (Appropriate Computing Technologies for Development) research group. My areas of interest: - Environment and natural resource management for community based development [video] - Analysis of factors impeding socio-economic development in rural areas - Participatory information sharing systems in low-literacy environments [video, video] - Ethics of information systems [video] Office Address: Room 103, Khosla School of Information Technology IIT Delhi New Delhi India - 110 016 I joined IIT Delhi in 2009, before which I did my PhD under Prof. S. Keshav and Prof. R. Cohen from the University of Waterloo. In 2009 I co-founded Gram Vaani, a social entrepreneurial venture to enable development through community media in rural areas of India. Eager to understand how uneven social development emerges, in 2019 my students and I released a website to monitor biases in policy making in India: the Giant Economy Monitor. Bringing together much of my learning gained over the last decade and a half on the relationship between technology, the political economy of technology, and social development, I wrote a book Technology and (Dis)Empowerment: A Call to Technologists which was published in 2022. Previews of the book are available at Google Books, and please feel free to ask me for my local electronic version - I will be more than happy to email it. The preface, introduction, and foreword (by Tim Unwin) are available here, and a brief summary is here. Most of my research has now moved to the use of ICTs for environment monitoring and improved natural resource management to assit rural communities to adapt to the changing climate. We are calling this the CoRE stack project. Email: aseth -at- cse -dot- iitd -dot- ac -dot- in Read our manifesto Read more about the book. Please write to me if you would like to read my local electronic version (pdf/epub). Explore our tools If you are interested to join our group then please do read this note which describes the passion and ideals that drive our work. We are looking for students at all levels (PhD/Masters/Bachelors), research assistants, post-doc fellows, and software engineering professionals with 0-8 years of experience, to build the CoRE Stack, an extremely ambitious and impactful digital public infrastructure for climate change adaptation for rural communities. Please see this list of ongoing projects to get a sense of the work and corresponding skillsets. Some ideas for new PhD topics are here. Interested students can email me their CVs and also read this note on our research philosophy. Interested research assistants, please read this job description. Interested software engineers seeking full-time employment, please see this job description. This is the place to be if you are eager to make a meaningful change in the world with your work. The rest of this page is not actively maintained Publications Book extract PhD thesis Current work Awards PhD students Teaching General stuff Current work I started work in the ICTs for development space with a strong belief that enabling people to create and share information on their own can set many things right in the world. My students at IIT, the amazing Gram Vaani team, and my colleagues from back in Waterloo have over the years built several technology platforms and enabling processes towards this goal. This includes some leading work on providing rural Internet connectivity, enabling less-literate people to create and share content using IVR (Interactive Voice Response) and community radio systems, and some amazing processes on content development and community mobilization for participatory media. All put together, we have worked with over 150 organizations in India, South Africa, Tanzania, Mali, Sri Lanka, and Afghanistan. We have influenced the adoption of ICTs in government bodies for greater accountability, including work with the Municipal Corporation of Delhi, the Ministry of Rural Development, and the Information and Broadcast Ministry. And we have attracted support directly and indirectly for the use of ICTs in development from funding agencies such as UNFPA, Ford Foundation, MacArthur Foundation, Knight Foundation, UNDP, Gates Foundation, Grand Challenges Canada, DEITy, DST, Google, and Intel India. Our additional work on measuring 2G/3G network performance has been tabled in front of TRAI towards strengthening policies for QoS regulation in the country. I however started to realize that policy support and capital requirements in the social development space often come in the way of taking successful programs to scale. Significant exploitation of the poor due to existing inequalities, and corruption and mis-allocation of resources by public and private bodies, makes the fight against poverty and inequality even harder to win. Lack of transparency in public budgeting, inadequate data collection and analysis for policy formulation, wage inequalities, political and corporate linkages, etc. are big problems that can systematically suppress and erode developmental efforts in progress. I therefore became very interested in educating myself on these topics to bring transparency in economic policies and outcomes through open data for equitable development. We have done some exciting projects on time series analysis of agricultural commodity prices to detect plausible cases of illegal hoarding, analysis of the interlock between government and corporate networks, detecting media bias, understanding socio-economic development at spatial scales as fine as at the village level, and relating macroeconomic trends with social and community media content expressed by the people. I hope some of this work combined with the media outreach by Gram Vaani and other social networking systems we are building, can lead to a citizenry more informed of economic policies and aware enough to then demand appropriate action from their political representatives, rather than be swayed by manipulative electoral politics which does not end up challenging economic policies. At the same time, while building ICT systems for some of the above ideas, and observing that many other similar efforts are also underway by commercial enterprises and government departments, I became concerned with vested interests of the designers and managers of these systems. ICT systems can lead to both desirable and undesirable outcomes, and I feel that only strong underlying ethical values can provide the necessary moral compass for these systems. I have therefore argued about how ethics should form a core part of the design and management of ICT projects, and what kind of ethical values should be considered more appropriate than others in the current context of the world. This has culminated in a book - Technology and (Dis)Empowerment: A Call to Technologists - published in 2022 by Emerald Publishing. Information about most of my work can be found on the ACT4D website. Some current projects are around the ethical design and deployment management of ICT projects, the design of IVR systems and mobile apps for community media in rural settings, theorizing the role of community media for development, and analysis and presentation of economic data to detect biases in policy making. In the past, I have also worked extensively on delay tolerant networks and recommendation systems using social networks. I am always looking for bright and dynamic students to work with me on these projects. Awards Personal awards 2022: ACM SIGCHI Social Impact Award for contributions to the profession of computer-human interaction. 2021: Award for teaching excellence at IIT Delhi. 2021: Varshney Award by the Systems Society of India for contributions to systems science, application, and technology. 2008: Winner in the international Knight News Challenge, for innovation in the delivery of news using digital media. 2002: Ratan Swaroop Memorial Award from IIT Kanpur, for the best all-rounder among the graduating batch. Prominent group awards 2022: Gram Vaani won the Agami Prize for innovations in improving social justice through technology. 2020: Gram Vaani won the World Banks Mission Billion Challenge for reducing exclusions in digital ID systems. 2018: Gram Vaani was a finalist in the UNESCO Equals-in-Tech awards for bridging the digital gender divide. 2016: Gram Vaani won the Nasscom Social Innovation Challenge for its scalable local media model. 2014: Gram Vaani was profiled by Economic Times among 14 startups to look forward to in 2014. 2010: Gram Vaani was one of the 34 startups selected for seed grants in the Economic Times Power of Ideas competition. Teaching (not exhaustive, these are links typically to the very first offering of the course) COL100 Introduction to Computer Science (2024-25 sem 2): [external link] SIL761 Introduction to ICTD, with a focus on environmental topics (2021-22 sem 2): [external link] COL100 Introduction to Computer Science (2020-2",
  "content_length": 14199,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:09"
}