{
  "name": "Aaron Leon Roth",
  "homepage": "http://www.cis.upenn.edu/~aaroth",
  "status": "success",
  "content": "Aaron Roth Aaron Roth About Me I am the Henry Salvatori Professor of Computer and Cognitive Science at the University of Pennsylvania computer science department. I also hold a secondary appointment at the Department of Statistics and Data Science at the Wharton School, and I am associated with the theory group, PRiML (Penn Research in Machine Learning) the Warren Center for Network and Data Sciences, and am co-director of our program in Networked and Social Systems Engineering. I am also affiliated with the AMCS program (Applied Mathematics and Computational Science). I spent a year as a postdoc at Microsoft Research New England. Before that, I received my PhD from Carnegie Mellon University, where I was fortunate to have been advised by Avrim Blum. My main interests are in algorithms and machine learning, and specifically in the areas of private data analysis, fairness in machine learning, game theory and mechanism design, and learning theory. I am the recipient of the Hans Sigrist Prize, a Presidential Early Career Award for Scientists and Engineers (PECASE), an Alfred P. Sloan Research Fellowship, an NSF CAREER award, a Google Faculty Research Award, an Amazon Research Award, and a Yahoo Academic Career Enhancement award. I am also an Amazon Scholar at Amazon Web Services (AWS). Previously, I was involved in advisory and consulting work related to differential privacy, algorithmic fairness, and machine learning, including with Apple and Facebook. I was also a scientific advisor for Leapyear and Spectrum Labs. For more information, see my CV, Research Statement, and those of my talks that appear on YouTube. Contact Information Office: 511 Amy Gutmann Hall Email: aaroth@cis.upenn.edu Teaching In Fall 2026 I am teaching CIS 6200 --- Learning in Games (and Games in Learning). Previous courses: Fall 2024: CIS 6200 -- Advanced Topics in Machine Learning: Learning with Conditional Guarantees Fall 2023: CIS 6200 --- Learning in Games (and Games in Learning). Fall 2022: CIS 7000 --- Uncertain: Modern Topics in Uncertainty Estimation. Fall 2021: CIS 320 -- Introduction to Algorithms Fall 2017: CIS 700 -- The Algorithmic Foundations of Adaptive Data Analysis. Spring 2025, Spring 2024, Spring 2023, Spring 2022, Spring 2021, Spring 2020, Fall 2018, Spring 2017, Spring 2015, Fall 2013, Spring 2012: NETS 4120 -- Algorithmic Game Theory. Spring 2019, Fall 2016, 2014, 2012: CIS 262 -- Automata, Computability, and Complexity. Spring 2014: CIS 700 -- a seminar on the applications of Differential Privacy to Game Theory and Mechanism Design Spring 2013: CIS 700 -- No Regrets in Game Theory and Learning Spring 2013: MKSE 150 -- Market and Social Systems on the Internet Fall 2011: CIS 800 -- The Algorithmic Foundations of Data Privacy I'm fortunate to be able to work with several excellent graduate students and postdocs. Current: Yahav Bechavod (Postdoc) Georgy Noarov (co-advised by Michael Kearns) Natalie Collina (co-advised by Michael Kearns) Ramya Ramalingam (co-advised by Osbert Bastani) Mirah Shi (co-advised by Michael Kearns) Sikata Sengupta (co-advised by Michael Kearns and Duncan Watts) Jiuyau Lu (co-Advised by Michael Kearns). Alumni: Emily Ryu (Visiting PhD Student). Varun Gupta (PhD Student). Postdoc at the Vector Institute Ira Globus-Harris (PhD Student). Postdoc at Cornell (Hosts: Nikhil Garg and danah boyd). Jessica Sorrel (Postdoc). Johns Hopkins Computer Science. Rabanus Derr. (Visiting PhD Student). PhD student at Tubingen Stephan Xie (BSE Student). PhD Student at CMU. Han Shao (Visiting PhD Student). University of Maryland Computer Science. Emily Diana (PhD Student). Carnegie Mellon Operations Research. Daniel Z. Lee (BA/MS student). MIT PhD. Saeed Sharifi-Malvajerdi (PhD student). Research Assistant Professor, TTIC Christopher Jung (PhD student). Postdoc at Stanford (Host: Omer Reingold). Travis Dick (Warren Center Postdoctoral Fellow). Research Scientist, Google AI. Juba Ziani (Warren Center Postdoctoral Fellow). Georgia Tech ISYE Zachary Schutzman (PhD student). Postdoc at MIT IDSS Matthew Joseph (PhD student). Research Scientist, Google AI. (Morris and Dorothy Rubinoff Award for Best Thesis) Seth Neel (PhD student co-advised by Michael Kearns). Harvard Business School. Jinshuo Dong (PhD student). Tsinghua Mathematics Department. Jieming Mao (Warren Center Postdoctoral Fellow). Research Scientist, Google AI. William Brown (BS/MS student). Columbia PhD. Bo Waggoner (Warren Center Postdoctoral Fellow). University of Colorado Boulder CS Jamie Morgenstern (Warren Center Postdoctoral Fellow). University of Washington CS Justin Hsu (PhD student co-advised with Benjamin Pierce). Cornell CS (John C. Reynolds Doctoral Dissertation Award) Steven Wu (PhD student co-advised with Michael Kearns). Carnegie Mellon University SCS (Morris and Dorothy Rubinoff Award for Best Thesis) Ryan Rogers (PhD student co-advised with Michael Kearns). Apple. Zhiyi Huang (PhD student co-advised with Sampath Kannan). University of Hong Kong. (Morris and Dorothy Rubinoff Award for Best Thesis) Kris Iyer (Postdoc, jointly hosted with Michael Kearns and Mallesh Pai). University of Minnesota ISE. Yang Jiao (BS/MS student). CMU PhD Rachel Cummings (Visiting PhD student) Columbia IEOR Books and Notes Learning in Games and Games in Learning. (DRAFT -- WORK IN PROGRESS). Uncertain: Modern Topics in Uncertainty Estimation. (DRAFT -- WORK IN PROGRESS). The Ethical Algorithm. Joint with Michael Kearns. Oxford University Press. November 2019. The Algorithmic Foundations of Differential Privacy. Joint with Cynthia Dwork. Foundations and Trends in Theoretical Computer Science, NOW Publishers. 2014. Recent and Selected Publications (See here for all publications, or my Google Scholar profile) Click for abstract/informal discussion of results Robust Decision Making with Partially Calibrated Forecasts. Joint work with Shayan Kiyani, George Pappas, and Hamed Hassani. Manuscript. Emergent Alignment via Competition. Joint work with Natalie Collina, Surbhi Goel, Emily Ryu, and Mirah Shi. Manuscript. Online Omniprediction with Long-Term Constraints. Joint work with Yahav Bechavod and Jiuyao Lu. Manuscript. The Value of Ambiguous Commitments in Multi-Follower Games. Joint work with Natalie Collina and Rabanus Derr. Manuscript. Networked Information Aggregation via Machine Learning. Joint work with Michael Kearns and Emily Ryu. In the Proceedings of SODA 2026. Collaborative Prediction: Tractable Information Aggregation via Agreement. Joint work with Natalie Collina, Ira Globus-Harris, Surbhi Goel, Varun Gupta, and Mirah Shi. In the Proceedings of SODA 2026. Sample Efficient Omniprediction and Downstream Swap Regret for Non-Linear Losses. Joint work with Jiuyao Lu and Mirah Shi. In the Proceedings of COLT 2025. Stronger Neyman Regret Guarantees for Adaptive Experimental Design. Joint work with Georgy Noarov, Riccardo Fogliato, and Martin Bertran. In the Proceedings of ICML 2025. The Relationship between No-Regret Learning and Online Conformal Prediction. Joint work with Ramya Ramalingam and Shayan Kiyani. In the Proceedings of ICML 2025. Intersectional Fairness in Reinforcement Learning with Large State and Constraint Spaces. Joint work with Eric Eaton, Marcel Hussing, Michael Kearns, Sikata Sengupta, and Jessica Sorrell. In the Proceedings of ICML 2025. Decision Theoretic Foundations for Conformal Prediction: Optimal Uncertainty Quantification for Risk-Averse Agents . Joint work with Shayan Kiyani, George Pappas, and Hamed Hassani. In the Proceedings of ICML 2025. High-Dimensional Prediction for Sequential Decision Making. Joint work with Georgy Noarov, Ramya Ramalingam, and Stephan Xie. In the Proceedings of ICML 2025. Resolving the Reference Class Problem at Scale. Joint work with Alexander Tolbert. Philosophy of Science, 2025. Tractable Agreement Protocols. Joint work with Natalie Collina, Surbhi Goel, and Varun Gupta. In the Proceedings of STOC 2025. Algorithmic Collusion Without Threats. Joint work with Eshwar Ram Arunachaleswaran, Natalie Collina, Sampath Kannan, and Juba Ziani. In the Proceedings of ITCS 2025. An Elementary Predictor Obtaining 2√T Distance to Calibration. Joint work with Eshwar Ram Arunachaleswaran, Natalie Collina, and Mirah Shi. In the Proceedings of SODA 2025. Oracle-Efficient Reinforcement Learning for Max Value Ensembles. Joint work with Marcel Hussing, Michael Kearns, Sikata Sengupta, and Jessica Sorrell. In the Proceedings of NeurIPS 2024. Repeated Contracting with Multiple Non-Myopic Agents: Policy Regret and Limited Liability. Joint work with Natalie Collina and Varun Gupta. In the Proceedings of EC 2024. Forecasting for Swap Regret for All Downstream Agents. Joint work with Mirah Shi. In the Proceedings of EC 2024. Efficient Prior-Free Mechanisms for No-Regret Agents. Joint work with Natalie Collina and Han Shao. In the Proceedings of EC 2024. Multicalibration for Confidence Scoring in LLMs. Joint work with Gianluca Detommaso, Martin Bertran, and Riccardo Fogliato. In the Proceedings of ICML 2024. Oracle Efficient Online Multicalibration and Omniprediction. Joint work with Sumegha Garg, Christopher Jung, and Omer Reingold. In the Proceedings of SODA 2024. Scalable Membership Inference Attacks via Quantile Regression. Joint work with Martin Bertran, Shuai Tang, Michael Kearns, Jamie Morgenstern, and Steven Wu. In the Proceedings of NeurIPS 2023. The Scope of Multicalibration: Characterizing Multicalibration via Property Elicitation. Joint work with Georgy Noarov. In the Proceedings of ICML 2023. Multicalibration as Boosting for Regression. Joint work with Ira Globus-Harris, Declan Harrison, Michael Kearns, and Jessica Sorrell. In the Proceedings of ICML 2023. (Also presented at FORC 2023). Selected as an oral presentation Reconciling Individual Probability Forecasts. Joint work with Alexander Tolbert and Scott Weinstein. In the Proceedings of FAccT 2023. Confidence-Ranked Reconstruction of Census Microdata from Published Statisti",
  "content_length": 40301,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:11"
}