{
  "name": "Aaron Clauset",
  "homepage": "https://www.colorado.edu/faculty/clauset",
  "status": "success",
  "content": "Home | Aaron Clauset | University of Colorado Boulder Skip to main content TranslateEnglishSpanishChineseFrenchGermanKoreanLaoNepaliJapaneseTibetanSearchEnter the terms you wish to search for.Other ways to search:Events CalendarCampus MapHomeNetworks, Dynamics, and Data in Complex Systems WelcomeI am a Professor of Computer Science at the University of Colorado Boulder and in the BioFrontiers Institute. I am also External Faculty at the Santa Fe Institute. The Clauset LabMy group's research activities are broad and multidisciplinary, and we are active participants in the network science, complex systems, computational biology, and computational social science communities. br Our work aims to understand the mechanisms by which large-scale patterns emerge from the collective actions of heterogeneous individuals within complex social and biological systems, and we develop novel techniques for inferring such patterns and mechanisms from rich data sources. Our work is supported by a specific interest in methodology, and we actively develop novel statistical and computational methods for automatically analyzing and modeling complex phenomena in biological, social and technological systems. These efforts draw heavily on data analysis, machine learning, statistics, probability, algorithms and graph theory. We are particularly interested in interactions between theory and data, and the development of rigorous methods for the study of complex systems.  Three areas of current work are (i) the large-scale organization of complex networks, with particular emphasis on their modular or hierarchical structure; (ii) the mechanisms that shape the scientific ecosystem, with particulat emphasis on scientific careers and the structuring role of prestige in driving who discovers what, when, and where; and (iii) the statistical patterns in oncology and genomics, with particular emphasis on ovarian cancer and structural variants. Selected PublicationsPower-law distributions in empirical data.  A. Clauset, C.R. Shalizi and M.E.J. Newman. SIAM Review 51(4), 661 - 703 (2009).Stacking models for nearly optimal link prediction in complex networks.  A. Ghasemian, H. Hosseinmardi, A. Galstyan, E.M. Airoldi, and A. Clauset. PNAS 117(38), 23393 - 23400 (2020).The ground truth about metadata and community detection in networks.   L. Peel, D. B. Larremore, and A. Clauset Science Advances 3(5), e1602548 (2017). The evolution and distribution of species body size.   A. Clauset and D.H. Erwin. Science 321, 399 - 401 (2008).On the frequency of severe terrorist attacks.  A. Clauset, M. Young and K.S. Gledistch. J. Conflict Resolution 51(1), 58 - 88 (2007). Systematic inequality and hierarchy in faculty hiring networks.   A. Clauset, S. Arbesman and D.B. Larremore. Science Advances 1(1), e1400005 (2015).Follow UsI discuss these and other interests on my blog Structure+Strangeness and on twitter @aaronclauset.",
  "content_length": 2921,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:07"
}