{
  "name": "Aaron Schulman",
  "homepage": "http://cseweb.ucsd.edu/~schulman",
  "status": "success",
  "content": "Aaron Schulman, Associate Professor Aaron Schulman schulman@cs.ucsd.edu @skateprofessor Curriculum Vitae Who is Aaron Shalev? Associate Professor - UC San Diego Computer Science and Engineering Paul Jacobs Chancellor's Endowed Facultly Fellowship for Next Generation Wireless ChangeLog Jul 2, 2025 - Our work on scanning GEO satellite links that revealed a significant amount of internal sensitive unencrypted traffic will appear at ACM CCS 2025. Congrats to our students Wenyi, Annie, and Keegan! This work took 2.5 years, involved ~10 disclosures. The team was lead jointly with Nadia Heninger at UC San Diego and Dave Levin at University of Maryland. Recent Publications (Show All) Publications (Show Recent) Different Policies for Different NodeBs: Comparing Downlink Schedulers in Cellular Base Stations Zesen Zhang, Jon Larrea, Jarrett Huddleston, Haoran Wan, Ricky K. P. Mok, Bradley Huffaker, and kc Claffy, Kyle Jamieson, Alexander Marder, and Aaron Schulman To appear at PAM 2026 (Passive and Active Measurement Conference) CRASHCART: Truckin' in a Backup System to Revive Hospitals During Computer Outages Almog Bar-Yossef, Kartikeyan Subramanyam, Jonathon Guthrie, Alex Gao, Christian Dameff, Jeff Tully, and Aaron Schulman To appear at HealthSec 2025 (Cybersecurity in Healthcare Workshop @ ACSAC) Paper Don't Look Up: There Are Sensitive Internal Links in the Clear on GEO Satellites Wenyi Zhang, Annie Dai, Keegan Ryan, Dave Levin, Nadia Heninger, and Aaron Schulman CCS 2025 (Conference on Computer and Communications Security) ★ Distinguished Paper Award Paper Practical Obfuscation of BLE Physical-Layer Fingerprints on Mobile Devices Hadi Givehchian, Nishant Bhaskar, Alexander Redding, Han Zhao, Aaron Schulman, and Dinesh Bharadia IEEE Security and Privacy 2024 (Oakland) Paper Crescendo: Towards Real-time, Wide-band, High-Fidelity Spectrum Sensing Systems Raghav Subbaraman, Kevin Mills, Aaron Schulman, and Dinesh Bharadia MobiCom 2023 Investigating the Sustainability of the 5G Base Station Overhaul in the United States Zesen Zhang, Leila Scola, and Aaron Schulman ICT4S 2023 Paper Rosebud: Making FPGA-accelerated Middlebox Development More Pleasant Moein Khazraee, Alex Forencich, George C. Papen, Alex C. Snoeren, and Aaron Schulman ASPLOS 2023 Paper The Challenges of Blockchain-Based Naming Systems for Malware Defenders Audrey Randall, Wes Hardaker, Stefan Savage, Geoffrey M. Volker, and Aaron Schulman eCrime 2023 ★ Best Student Paper Award Access Denied: Assessing Physical Risks to Internet Access Networks Alexander Marder, Zesen Zhang, Ricky Mok, Ramakrishna Padmanabhan, Bradley Huffaker, Matthew Luckie, Alberto Dainotti, kc claffy, Alex C. Snoeren and Aaron Schulman USENIX Security 2023 Paper Measuring UID Smuggling in the Wild Audrey Randall, Pete Snyder, Alisha Ukani, Alex C. Snoeren, Geoffrey M. Voelker, Stefan Savage and Aaron Schulman IMC 2022 (Internet Measurement Conference) Paper ZLeaks: Passive Inference Attacks on Zigbee based Smart Homes Narmeen Shafqat, Daniel J. Dubois, David Choffnes, Aaron Schulman, Dinesh Bharadia and Aanjhan Ranganathan ACNS 2022 (Applied Cryptography and Network Security) Paper ★ Best Student Paper Award Evaluating Physical-Layer BLE Location Tracking Attacks on Mobile Devices Hadi Givehchian, Nishant Bhaskar, Eliana Rodriguez Herrera, Hector Rodrigo Lopez Soto, Christian Dameff, Dinesh Bharadia, and Aaron Schulman IEEE Security and Privacy 2022 (Oakland) Paper Inferring Regional Access Network Topologies: Methods and Applications Zesen Zhang, Alexander Marder, Ricky Mok, Bradley Huffaker, Matthew Luckie, kc Claffy, and Aaron Schulman. IMC 2021 (Internet Measurement Conference) Paper Home is where the Hijacking is: Understanding DNS Interception by Residential Routers Audrey Randall, Enze Liu, Ramakrishna Padmanabhan, Gautam Akiwate, Geoffrey M. Voelker, Stefan Savage, and Aaron Schulman. IMC 2021 (Internet Measurement Conference) Paper Federated Infrastructure: Use, Patterns, and Insights from \"The People's Network\" Dhananjay Jagtap, Alexander Yen, Huanlei Wu, Aaron Schulman, and Pat Pannuto. IMC 2021 (Internet Measurement Conference) Paper Trufflehunter: Cache Sniffing Rare Domains at Large Public DNS Resolvers Audrey Randall, Enze Liu, Gautam Akiwate, Ramakrishna Padmanabhan Geoffrey M. Voelker, Stefan Savage, and Aaron Schulman IMC 2020 (Internet Measurment Conference) Paper | Source Code (GitHub) ★ IETF Applied Networking Research Prize Measuring Security Practices and How They Impact Security Louis F. DeKoven, Audrey Randall, Ariana Mirian, Gautam Akiwate, Ansel Blume, Lawrence K. Saul, Aaron Schulman, Geoffrey M. Voelker, and Stefan Savage IMC 2019 (Internet Measurment Conference) Triton: A Software-Reconfigurable Federated Avionics Testbed Sam Crow, Brown Farinholt, Brian Johannesmeyer, Karl Koscher, Stephen Checkoway, Stefan Savage, Aaron Schulman, Alex C. Snoeren, and Kirill Levchenko CSET 2019 (Workshop on Cyber Security Experimentation and Test) Paper Residential Links Under the Weather Ramakrishna Padmanabhan, Aaron Schulman, Dave Levin, and Neil Spring SIGCOMM 2019 Paper Please Pay Inside: Evaluating Bluetooth-based Detection of Gas Pump Skimmers Nishant Bhaskar, Maxwell Bland, Kirill Levchenko, and Aaron Schulman USENIX Security 2019 Paper SparSDR: Sparsity-proportional Backhaul and Compute for SDRs Moein Khazraee, Yeswanth Guddeti, Sam Crow, Alex C. Snoeren, Kirill Levchenko, Dinesh Bharadia, and Aaron Schulman MobiSys 2019 (Conference on Mobile Systems, Applications, and Services) Paper | Source Code (GitHub) How to Find Correlated Internet Failures Ramakrishna Padmanabhan, Aaron Schulman, Alberto Dainotti, Dave Levin, and Neil Spring PAM 2019 (Passive and Active Measurement Conference) Paper SweepSense: Sensing 5 GHz in 5 Milliseconds with Low-cost SDRs Yeswanth Guddeti, Raghav Subbaraman, Moein Khazraee, Aaron Schulman, and Dinesh Bharadia NSDI 2019 (Networked Systems Design and Implementation) Paper | Source Code (GitHub) Detecting if LTE is the Bottleneck with BurstTracker Arjun Balasingam, Manu Bansal, Rakesh Misra, Kanthi Nagaraj, Rahul Tandra, Sachin Katti, and Aaron Schulman MobiCom 2019 (Conference on Mobile Computing and Networking) Paper | Source Code (GitHub) Analysis of SSL Certificate Reissues and Revocations in the Wake of Heartbleed Liang Zhang, David Choffnes, Tudor Dumitras, Dave Levin, Alan Mislove, Aaron Schulman, Christo Wilson CACM Research Highlights - March 2018 WWW An End-to-End Measurement of Certificate Revocation in the Web's PKI Yabing Liu, Will Tome, Liang Zhang, David Choffnes, Dave Levin, Bruce Maggs, Alan Mislove, Aaron Schulman, Christo Wilson IMC 2015 (Internet Measurement Conference) - Long paper Paper Timeouts: Beware Surprisingly High Delay Ramakrishna Padmanabhan, Patrick Owen, Aaron Schulman, and Neil Spring IMC 2015 (Internet Measurement Conference) - Long paper Paper BattOr: Plug-and-debug energy debugging for applications on smartphones and laptops Aaron Schulman, Tanuj Thapliyal, Sachin Katti, Neil Spring, Dave Levin, and Prabal Dutta Stanford CS Tech Report Paper PowerSpy: Location Tracking using Mobile Device Power Analysis Yan Michalevsky, Gabi Nakibly, Aaron Schulman, and Dan Boneh USENIX Security 2015 Paper Atomix: A Framework for Deploying Signal Processing Applications on Wireless Infrastructure Manu Bansal, Aaron Schulman, and Sachin Katti NSDI 2015 (Networked Systems Design and Implementation) Paper RevCast: Fast, Private Certificate Revocation over FM Radio Aaron Schulman, Dave Levin, and Neil Spring CCS 2014 (Conference on Computer and Communications Security) Paper | Slides Analysis of SSL Certificate Reissues and Revocations in the Wake of Heartbleed Liang Zhang, Dave Choffnes, Tudor Dumitras, Dave Levin, Alan Mislove, Aaron Schulman, and Christo Wilson IMC 2014 (Internet Measurement Conference) - Long paper Paper [Dissertation] Observing and Improving the Reliability of Internet Last-mile Links University of Maryland Paper ★\tSIGCOMM Doctoral Dissertation Award ★\tLarry S. Davis Doctoral Dissertation Award Pingin' in the Rain Aaron Schulman and Neil Spring IMC 2011 (Internet Measurement Conference) - Short paper Paper | Slides | Slides with animations | Hurricane Irene animation Making Currency Inexpensive with iOwe Dave Levin, Aaron Schulman, Katrina LaCurts, Neil Spring and Bobby Bhattacharjee NetEcon 2011 (Workshop on the Economics of Networks, Systems and Computation) Paper Bartendr: A Practical Approach to Energy-aware Cellular Data Scheduling Aaron Schulman, Vishnu Navda, Ramachandran Ramjee, Neil Spring, Pralhad Deshpande, Calvin Grunewald, Kamal Jain, Venkata N. Padmanabhan MobiCom 2010 (Conference on Mobile Computing and Networking) Paper | Errata | Slides | Slides with animations Maranello: Practical Partial Packet Recovery for 802.11 Bo Han, Aaron Schulman, Francesco Gringoli, Neil Spring, Bobby Bhattacharjee, Lorenzo Nava, Lusheng Ji, Seungjoon Lee, Robert Miller NSDI 2010 (Networked Systems Design and Implementation) Paper | Slides | Video Visualizing Real-Time Network Resource Usage Ryan Blue, Cody Dunne, Adam Fuchs, Kyle King and Aaron Schulman VizSEC 2008 (Workshop on Visualization for Cyber Security) Paper On the Fidelity of 802.11 Packet Traces Aaron Schulman, Dave Levin, Neil Spring PAM 2008 (Passive and Active Measurement Conference) Paper | Slides Teaching - CSE 291: Internet Infrastructure - CSE 190D: Wireless Embedded Systems - CSE 291I: Topics in Embedded Systems and Communication - CSE 123: Computer Networks - CSE 190A: Wireless Embedded Systems - CSE 291D: Topics in Embedded Computing and Communication - CSE 291K: Topics in Mobile Computing and Communication Students Current: - Yibo Wei: UC San Diego Ph.D. - Wenyi \"Morty\" Zhang: UC San Diego Ph.D. Former: - Zesen \"Jason\" Zhang: UC San Diego Ph.D. → Amazon - Vibhuti Rajpurohit: UC San Diego B.S. → Zoox - Hadi Givehchian: UC San Diego Ph.D. → Apple - Nishant Bhaskar: UC San Diego Ph.D. → MQ Prime LLC - Audrey Randall: UC San Diego Ph.D.",
  "content_length": 11388,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:13"
}