{
  "name": "Aaron C. Courville",
  "homepage": "https://aaroncourville.wordpress.com",
  "status": "success",
  "content": "Aaron Courville Aaron Courville Skip to content Home CIFAR Deep Learning Summer School Posted on April 12, 2016 by aaroncourville The application process for the 2016 edition of the CIFAR Deep Learning Summer School is now closed. Posted in Uncategorized | Comments Off on CIFAR Deep Learning Summer School CIFAR Deep Learning Summer School Posted on March 11, 2016 by aaroncourville Announcing the 2016 edition of the CIFAR Deep Learning Summer School! We have a very exciting line-up of speakers. We are now accepting applications! Important dates: – Application process opening: March 22nd, 2016. – Deadline for receiving applications: April 11th, 2016. – Application acceptance/rejection decisions: May 7th, 2016. Posted in Uncategorized | Comments Off on CIFAR Deep Learning Summer School Want to do deep learning? — I am looking for graduate students! Posted on November 2, 2013 by aaroncourville The LISA lab (with 4 deep learning faculty: Yoshua Bengio, Pascal Vincent, myself and Roland Memisevic) is recruiting graduate students and post-docs for deep learning research. Salary is negotiable. The team is large (about 30 students and professionals), intellectually stimulating and very productive. Montreal is a 4-university city, among the most culturally interesting places to live. Our graduates are highly sought by big data and AI companies. If you are interested, please contact me! Posted in Uncategorized | Comments Off on Want to do deep learning? — I am looking for graduate students! Announcing the 2nd International Conference on Learning Representations (ICLR2014) Posted on November 2, 2013 by aaroncourville Website: https://sites.google.com/site/representationlearning2014/home Submission Deadline:   December 20th 2013 Overview It is well understood that the performance of machine learning methods is heavily dependent on the choice of data representation (or features) on which they are applied. The rapidly developing field of representation learning is concerned with questions surrounding how we can best learn meaningful and useful representations of data.  We take a broad view of the field, and include in it topics such as deep learning and feature learning, metric learning, kernel learning, compositional models,  non-linear structured prediction, and issues regarding non-convex optimization. Despite the importance of representation learning to machine learning and to application areas such as vision, speech, audio and NLP,  there is currently no common venue for researchers who share a common interest in this topic. The goal of ICLR is to help fill this void. ICLR 2014 will be a 3-day event from April 14th to April 16th 2014, in Banff, Canada. The conference will follow the recently introduced open reviewing and open publishing publication process, which is explained in further detail here: Publication Model. Posted in ICLR | Comments Off on Announcing the 2nd International Conference on Learning Representations (ICLR2014) ICLR2013 Program Posted on April 11, 2013 by aaroncourville The program for the International Conference on Representation Learning (ICLR2013) is now available here. Posted in ICLR | Comments Off on ICLR2013 Program Introducing the 1st International Conference on Learning Representations (ICLR2013) Posted on October 30, 2012 by aaroncourville Website: https://sites.google.com/site/representationlearning2013/ Held in conjunction with AISTATS2013, Scottsdale, Arizona, May 2nd-4th 2013 Submission deadline: January 15th 2013 Overview ————- It is well understood that the performance of machine learning methods is heavily dependent on the choice of data representation (or features) on which they are applied. The rapidly developing field of representation learning is concerned with questions surrounding how we can best learn meaningful and useful representations of data.  We take a broad view of the field, and include in it topics such as deep learning and feature learning, metric learning, kernel learning, compositional models, non-linear structured prediction, and issues regarding non-convex optimization. Despite the importance of representation learning to machine learning and to application areas such as vision, speech, audio and NLP, there is currently no common venue for researchers who share a common interest in this topic. The goal of ICLR is to help fill this void. A non-exhaustive list of relevant topics: – unsupervised representation learning – supervised representation learning – metric learning and kernel learning – dimensionality expansion, sparse modeling – hierarchical models – optimization for representation learning – implementation issues, parallelization, software platforms, hardware – applications in vision, audio, speech, and natural language processing. – other applications Posted in ICLR | Tagged conference, ICLR, representation learning | Leave a comment About Me I'm an Assistant Professor in the Department of Computer Science and Operations Research (DIRO) at the University of Montreal, and member of MILA (Montreal Institute for Learning Algorithms). Curriculum VitaeAaron_Courville_CV.pdf Recent Posts CIFAR Deep Learning Summer School CIFAR Deep Learning Summer School Want to do deep learning? — I am looking for graduate students! Announcing the 2nd International Conference on Learning Representations (ICLR2014) ICLR2013 Program Search for: Aaron Courville Blog at WordPress.com. Subscribe Subscribed Aaron Courville Sign me up Already have a WordPress.com account? Log in now. Aaron Courville Subscribe Subscribed Sign up Log in Report this content View site in Reader Manage subscriptions Collapse this bar",
  "content_length": 5645,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:07"
}