{
  "name": "Aaron F. Bobick",
  "homepage": "https://engineering.washu.edu/faculty/Aaron-Bobick.html",
  "status": "success",
  "content": "Aaron Bobick | WashU McKelvey School of Engineering Education PhD, Massachusetts Institute of Technology, 1987SB, Massachusetts Institute of Technology, 1981 Expertise Studies how robots can more efficiently interact with objects Biography Aaron Bobick joined Washington University in St. Louis as Dean of the School of Engineering & Applied Science and the James M. McKelvey Professor July 1, 2015. Prior to Washington University, he was a professor and founding chair of the School of Interactive Computing at the Georgia Institute of Technology, where he was a member of the faculty since 1999. Dean Bobick's research primarily focuses on action recognition by computer vision, a field in which he is a pioneer. Recently he has extended his research to robot perception for human-robot collaboration. While at Georgia Tech, he served as director of the Graphics, Visualization and Usability Center, an internationally known research center in computer vision, graphics, ubiquitous computing and human-computer interaction, and helped develop a computational media bachelor’s degree program and doctoral programs in robotics and human centered computing. Dean Bobick is a graduate of the Massachusetts Institute of Technology (MIT), where he earned his bachelor's degrees in mathematics and computer science and his doctorate in cognitive science. Prior to joining the Georgia Tech faculty, he served as a member of the MIT Media Laboratory faculty, where he led the Media Lab Defense Advanced Research Projects Agency (DARPA) Video Surveillance and Monitoring Project, as well as its Dynamic Scene Analysis research effort. He also has served as a senior area chair for numerous international computer vision conferences and as program chair for the Institute of Electrical and Electronics Engineers (IEEE) Conference on Computer Vision and Pattern Recognition. He has founded a variety of successful startup companies, is a distinguished scientist of the Association for Computing Machinery and was elected a Fellow of the IEEE in 2014. Affiliations Imaging Science PhD Program In the News St. Louis Comes Together to Announce the Taylor Geospatial Institute Institute Brings Together Eight Midwest Research Institutions, Implements Key Component of GeoFutures Strategic Roadmap. 04.21.2022 McKelvey Engineering hosts more than 300 K-12 students at STEAM Academy summer camp Campers toured labs, met faculty and learned about the importance of engineering and the arts. 08.17.2021 Saving front-line workers In the early days of the pandemic, personal protective equipment was in short supply in the U.S., and its availability continues to be a problem globally, leaving health-care workers and their communities exposed. Jennifer DeLaney, MD ’97, has been on a remarkable journey leading a local effort to help. 06.28.2021 Find more news about Aaron Bobick",
  "content_length": 2860,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:11"
}