{
  "name": "Aarushi Goel",
  "homepage": "https://aarushigoel.github.io",
  "status": "success",
  "content": "Aarushi Goel Aarushi Goel Office: Hill Center 418 Email: aarushi [DOT] goel [AT] rutgers [DOT] edu About I am an Assistant Professor in the Computer Science department at Rutgers University. I am a member of the theory group at Rutgers. Prior to joining Rutgers, I was an Assistant Professor at Purdue University. Even before that, I was a postdoc at NTT Research, where I worked under the wonderful mentorship of Sanjam Garg. I received my PhD from Johns Hopkins University, where I was extremely fortunate to be advised by Abhishek Jain. I have a broad interest in cryptography and related areas of security. I am looking for motivated students to join me! If you are interested, please feel free to email me or stop by my office. Teaching CS65500: Advanced Cryptography (Spring 2025, Purdue University) CS59200-STC: Special Topics in Cryptography (Fall 2024, Purdue University) Service Program Committee: TCC 2023, TCC 2024, CRYPTO 2025, ACM CCS 2025, TCC 2025, Asiacrypt 2025, CSCML 2025, IEEE S&P 2026 Organizing: Midwest Security Workshop, RISE: Research Insights and Stories for Enlightenment Publications (Authors arranged alphabetically) Manuscripts PICS: Private Intersection over Committed (and reusable) Sets [eprint] Aarushi Goel, Peihan Miao, Phuoc Van Long Pham, Satvinder Singh 2026 Jigsaw: Doubly Private Smart Contracts [eprint] Sanjam Garg, Aarushi Goel, Dimitris Kolonelos, Rohit Sinha IEEE S&P 2026SBC 2025 2025 Multiparty Distributed Point Functions [eprint][slides (pptx)] Aarushi Goel, Mingyuan Wang, Zhiheng WangCRYPTO 2025 Malicious Security in Collaborative zkSNARKs: More than Meets the Eye [eprint][slides (pdf)] Sanjam Garg, Aarushi Goel, Abhishek Jain, Bhaskar Roberts, Sruthi Sekar CRYPTO 2025 Split Prover Zero-Knowledge SNARKs [eprint] Sanjam Garg, Aarushi Goel, Dimitris Kolonelos, Sina Shiehan, Rohit Sinha PKC 2025 2024 Homomorphic Secret Sharing with Verifiable Evaluation [eprint][slides (pdf)] Arka Rai Choudhuri, Aarushi Goel, Aditya Hegde, Abhishek Jain TCC 2024 Dora: A Simple Approach to Zero-Knowledge for RAM Programs [eprint][slides (pdf)] Aarushi Goel, Mathias Hall-Andersen, Gabriel KaptchukACM CCS 2024 How to Prove Statements Obliviously? [eprint][slides (pdf)] Sanjam Garg, Aarushi Goel, Mingyuan Wang CRYPTO 2024 SublonK: Sublinear Prover PlonK [eprint] Arka Rai Choudhuri, Sanjam Garg, Aarushi Goel, Sruthi Sekar, Rohit Sinha PETS 2024 2023 Experimenting with Zero-Knowledge Proofs of Training [eprint][code][blog][slides (pptx)] Sanjam Garg, Aarushi Goel, Somesh Jha, Saeed Mahloujifar, Mohammad Mahmoody, Guru Vamsi Policharla, Mingyuan Wang RWC 2024ACM CCS 2023 Scalable Multiparty Garbling [eprint][code] Gabrielle Beck, Aarushi Goel, Aditya Hegde, Abhishek Jain, Zhengzhong Jin, Gabriel Kaptchuk ACM CCS 2023 zkSaaS: Zero-Knowledge SNARKs as a Service [eprint][code][slides (pptx)] Sanjam Garg, Aarushi Goel, Abhishek Jain, Guru Vamsi Policharla, Sruthi Sekar USENIX Security 2023 Perfect MPC over Layered Graphs (Merge of [DGL23] and [DIKKN23]) Bernardo David, Giovanni Deligios, Aarushi Goel, Yuval Ishai, Anders Konring, Eyal Kushilevitz, Chen-Da Liu-Zhang, Varun Narayanan CRYPTO 2023 Speed-Stacking: Fast Sublinear Zero-Knowledge Proofs for Disjunctions [eprint][slides (pptx)] Aarushi Goel, Mathias Hall-Andersen, Gabriel Kaptchuk, Nicholas Spooner EUROCRYPT 2023 2022 One-Time Programs from Commodity Hardware [eprint][blog] Harry Eldridge, Aarushi Goel, Matthew Green, Abhishek Jain, Maximilian Zinkus TCC 2022 Stacking Sigmas: A Framework to Compose Σ-protocols for Disjunctions [eprint][code][slides (pptx)] Aarushi Goel, Matthew Green, Mathias Hall-Andersen, Gabriel Kaptchuk EUROCRYPT 2022 Secure Multiparty Computation with Free Branching [eprint][code][slides (pdf)] Aarushi Goel, Mathias Hall-Andersen, Aditya Hegde, Abhishek Jain EUROCRYPT 2022 Efficient Set Membership Proofs using MPC-in-the-Head [eprint][code] Aarushi Goel, Matthew Green, Mathias Hall-Andersen, Gabriel Kaptchuk PETS 2022 2021 On Communication Models and Best-Achievable Security in Two-Round MPC [eprint][slides (pdf)] Aarushi Goel, Abhishek Jain, Manoj Prabhakaran, Rajeev Raghunath TCC 2021 On Actively-Secure Elementary MPC Reductions [eprint][slides (pdf)] Benny Applebaum, Aarushi Goel TCC 2021 Fluid MPC: Secure Multiparty Computation with Dynamic Participants [eprint][slides (pdf)] Arka Rai Choudhuri, Aarushi Goel, Matthew Green, Abhishek Jain, Gabriel Kaptchuk CRYPTO 2021 Breaking the \\(O(\\sqrt{n})\\)-Bits Barrier: Byzantine Agreement with Polylog Bits Per Party [eprint][arxiv][JoC][slides (pptx)] Elette Boyle, Ran Cohen, Aarushi Goel Journal of Cryptology 2024PODC 2021 Order-C Secure Multiparty Computation for Highly Repetitive Circuits [eprint][slides (pdf)] Gabrielle Beck, Aarushi Goel, Abhishek Jain, Gabriel KaptchukEUROCRYPT 2021 2020 Towards Efficiency-Preserving Round Compression in MPC [eprint] Prabhanjan Ananth, Arka Rai Choudhuri, Aarushi Goel, Abhishek JainASIACRYPT 2020 2019 The Broadcast Message Complexity of Secure Multiparty Computation [eprint][slides (pdf)] Sanjam Garg, Aarushi Goel, Abhishek JainASIACRYPT 2019 Two Round Information-Theoretic MPC with Malicious Security [eprint][slides (pdf)] Prabhanjan Ananth, Arka Rai Choudhuri, Aarushi Goel, Abhishek JainEUROCRYPT 2019 2018 Round-Optimal Secure Multiparty Computation with Honest Majority [eprint][slides (pdf)] Prabhanjan Ananth, Arka Rai Choudhuri, Aarushi Goel, Abhishek JainCRYPTO 2018 Generation of Secure and Reliable Honeywords, Preventing False Detection [pdf] Akshima, Donghoon Chang, Aarushi Goel, Sweta Mishra, Somitra Kumar SanadhyaIEEE Transactions on Dependable and Secure Computing 2018 2015 Single Key Recovery Attacks on 9-Round Kalyna-128/256 and Kalyna-256/512 [eprint] Akshima, Donghoon Chang, Mohona Ghosh, Aarushi Goel, Somitra Kumar SanadhyaICISC 2015 Improved Meet-in-the-Middle Attacks on 7 and 8-Round ARIA-192 and ARIA-256 [pdf] Akshima, Donghoon Chang, Mohona Ghosh, Aarushi Goel, Somitra Kumar SanadhyaINDOCRYPT 2015",
  "content_length": 5988,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:13"
}