{
  "name": "Aashish Yadavally",
  "homepage": "https://aashishyadavally.github.io",
  "status": "success",
  "content": "Aashish Yadavally Office: HEC 247C 4328 Scorpius St Orlando, FL 32828 Bio:   I am a tenure-track Assistant Professor in the CS Department at the University of Central Florida. I recently earned my Ph.D. in Computer Science from the University of Texas at Dallas, where I was advised by Prof. Tien N. Nguyen. My research broadly lies at the intersection of Artificial Intelligence (AI) and Software Engineering (SE). In particular, I explore if/how large language models understand and reason about program behaviors. More recently, I am interested in quantifying such understanding capabilities, and training the next generation of code reasoning models to optimize software development processes. My work has been recognized by the community with multiple accolades, including the ACM SIGSOFT Distinguished Paper Award and the IEEE TCSE Distinguished Paper Award. We are hiring!   I am actively looking for brilliant students with a strong foundation and interest in programming languages, software engineering, and/or AI to join our research group, SAIL@UCF (Software Engineering and Artificial Intelligence Lab). We are ranked #15 in Software Engineering in the United States on CSRankings (a metrics-based ranking of top CS institutions). Feel free to reach out with a copy of your CV and background: aashish [dot] yadavally [at] ucf [dot] edu Research Interests (TL;DR):   AI for Software Engineering, Software Security, Software Maintenance, Large Reasoning Models for Source Code You can find me at the following Conferences or Events 2024   OOPSLA (Pasadena, CA, USA), FSE (Porto de Galinhas, Brazil) 2023   ESEC/FSE (San Francisco, CA, USA), ICSE (Melbourne, Australia) 2022   ASE (Detroit, MI, USA), ICSE (Pittsburgh, PA, USA), SANER (Virtual) Favourite Quotes “The future depends on what we do in the present.” ~ Mohandas Karamchand Gandhi “If you work with determination and with perfection, success will follow.” ~ Dhirubhai Ambani Recent News Oct 15, 2025 Two papers accepted at ICSE 2026. Sep 15, 2025 Invited to serve as a PC member for ISSTA 2026 Sep 15, 2025 Invited to serve as a Reviewer for ICLR 2026. Sep 10, 2025 Invited to serve as a PC member for FORGE 2026 Sep 10, 2025 Invited to serve as a Reviewer for DL4C Workshop at NeurIPS 2025 Sep 3, 2025 Joined CS@UCF as a tenure-track Assistant Professor. Looking forward to this new chapter in life! Aug 4, 2025 After five years in TX, relocated to the beautiful Orlando, FL! Easiest to reach out to via email :)",
  "content_length": 2483,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:14"
}