{
  "name": "Abbe Mowshowitz",
  "homepage": "https://www.ccny.cuny.edu/profiles/abbe-mowshowitz",
  "status": "success",
  "content": "Abbe Mowshowitz | The City College of New York Skip to main content > Home / Faculty and Staff Profiles / Abbe Mowshowitz Abbe Mowshowitz Professor Emeritus Main Affiliation Computer Science Building North Academic Center Office 7/244 Phone 212-650-6161 Fax 212-650-6248 Email amowshowitz@ccny.cuny.edu Abbe Mowshowitz Profile Website Abbe Mowshowitz has been professor of computer science at the City College of New York and member of the doctoral faculty at the Graduate Center of the City University of New York since 1984. In this period he has also held academic appointments at the University of Amsterdam, Erasmus University Rotterdam, and the Rotterdam School of Management. Earlier he held academic appointments at Rensselaer Polytechnic Institute, the University of British Columbia, the University of Toronto, and the University of Michigan. Mowshowitz began his research career in information theory and discrete mathematics, but shifted to organizational and social implications of computers some decades ago. He was awarded the 1990 Tinbergen Professorship at Erasmus University-Rotterdam in partial recognition of his work on computers and society. He has authored several books and reports (including THE CONQUEST OF WILL: INFORMATION PROCESSING IN HUMAN AFFAIRS, 1976), and many articles on the social implications of computing. In recent years, his research has centered on virtual organization (an idea he conceived in the late 1970s). A book on this subject (VIRTUAL ORGANIZATION: TOWARD A THEORY OF SOCIETAL TRANSFORMATION STIMULATED BY INFORMATION TECHNOLOGY) was published in 2002. In addition to teaching and research, Mowshowitz has acted as consultant on the uses and impacts of information technology (especially computer networks) to a wide range of public and private organizations in North America and Europe. Education PhD, Computer Science, University of MichiganMS, Computer Science, University of MichiganMA, Mathematica, University of MichiganBS, Mathematics, University of Chicago Courses Taught MIS G 1010 Statistics and Decision MakingMIS G 5010 Seminar in Information Systems ManagementCSc 104 Discrete Mathematical StructuresCSc 598.66 Senior Project I (ethics and management component)CSc I0810 Topics in Software and Systems (Modern Information Retrieval: Search Technologies) Research Interests My current research interests lie in two areas: 1) organizational and managerial issues in computing, and 2) network science. A central focus in the first area is virtual organization, especially the “switching model” and its relationship to the problem of dynamic resource allocation. This research is an extension of work reported in my book Virtual Organization. In the second area I am studying network growth models, network vulnerability, embedding virtual networks in physical substrates, and the identification of ‘communities of interest’ in networks. Much of this research grew out of my participation in the International Technology Alliance funded by the U.S. Army Research Lab and the U.K. Ministry of Defense.My colleague Professor Kawaguchi and I (having worked together in the ITA project) are focusing on further exploitation of engineered networks. By guiding the growth of systems such as Dynamic Distributed Federated Databases (DDFD) into well-defined graph structures (e.g., hypercubes, toroidal graphs, Kautz graphs, etc.), it is possible to exploit properties of the known graphs to improve the efficiency and effectiveness of communication and message passing as well as to make distributed systems more robust and secure.We have demonstrated the utility of this approach in our earlier work in the International Technology Alliance (ITA) project by showing how an engineered hypercube structure can be used to improve the efficiency of the query optimization process in a distributed database environment. We have verified this in a special case of a DDFD, namely the Gaian Database developed by IBM-UK.Building on this ITA work, we propose to investigate further three related areas in the context of engineered networks: 1) alignment of logical networks with physical substrates, 2) network vulnerability, and 3) security. The alignment issue is quite challenging as a theoretical question, so we would concentrate on developing acceptable heuristic solutions such as we have proposed in the hypercube case. Network vulnerability would be approached from the perspective of potential attacks that threaten to break a network into several isolated components – we proposes to attack this problem by elaborating a sound and practical definition of vulnerability introduced in our ITA work. The security part of the research would focus on variations of network coding that can take advantage of known independent paths in an engineered network. In principle this offers an alternative to encryption that has the advantage of using far less bandwidth. Publications M. Dehmer, A. Mowshowitz, and F. Emmert-Streib., Advances inNetwork Complexity. Wiley-Blackwell, Weinheim,Germany, 2013.A. Mowshowitz, The end of the information frontier. AI &Society, 28 (1), 2013, pp. 7-14.M. Dehmer, M. Grabner, A. Mowshowitz, and F. Emmert-Streib, An efficient heuristic approach to detecting graph isomorphism based on combinations of highly discriminating invariants. Advances in Computational Mathematics, 39(2), 2013, pp.311-325.M. Dehmer and A. Mowshowitz, On measuring the complexity of sets of graphs using graph entropy, in Advanced Computational Technologies, B. Iantovics, ed. Romanian Academy Press, Bucharest, 2012, pp. 176-184.W. Skeith, A. Mowshowitz, and G. Bent, Relaxing security requirements for computing joins on encrypted data. Annual Conference of the International Technology Alliance, Southampton, UK, 2012.A. Mowshowitz, A. Kawaguchi, A. Nagel, A. Toce, G. Bent, P. Stone, and P. Dantressangle. A model of query performance in Dynamic Distributed Federated Databases takingaccount of network topology. Annual Conference of the International Technology Alliance, Southampton, UK, 2012.A. Toce, A. Mowshowitz, A. Kawaguchi, P. Stone, P. Dantressangle, and G. Bent. HyperD: Analysis and performance evaluation of a distributed hypercube database. Annual Conference of the International Technology Alliance, Southampton, UK, 2012.M. Walters, P. Stone, P. Dantressangle, and A. Mowshowitz. Evolution of the preferential attachment topology of the Gaian Database. Annual Conference of the International Technology Alliance, Southampton, UK, 2012.P. Stone, P. Dantressangle, G. Bent, A. Mowshowitz, A. Toce, and B. Szymanski, Query execution and maintenance costs in a Dynamic Distributed Federated Database. Annual Conference of the International Technology Alliance, Southampton, UK, 2012.P. Stone, P. Dantressangle, G. Bent, A. Mowshowitz, A. Toce, and B. Szymanski, Query propagation behaviour in Gaian Database networks. Annual Conference of the International Technology Alliance, Southampton, UK, 2012.P. Stone, P. Dantressangle, G. Bent, and A. Mowshowitz, Calculation of the center-of-data in a hypercube. Annual Conference of the International Technology Alliance, Southampton, UK, 2012.A. Mowshowitz and M. Dehmer, Entropy and complexity of graphs revisited. Entropy, 14, 2012, pp. 559-570. A. Mowshowitz, Entropy of digraphs and infinite graphs, in Towards an Information Theory of Complex Networks: Statistical Methods and Applications, M. Dehmer, F. Emmert-Streib, and A. Mehler, eds., Springer/Birkhäuser, 2011, pp. 1-16.M. Dehmer, A. Mowshowitz, and F. Emmert-Streib, Connections between Classical and Parametric Network Entropies. PLoS ONE, 2011. doi:10.1371/journal.pone.0015733.M. Dehmer and A. Mowshowitz, A history of graph entropy measures. Information Sciences 181, 2011, pp. 57–78.A. Mowshowitz and M. Dehmer, A symmetry index for graphs. Symmetry: Culture and Science 21 (4), 2011, pp. 321-327.M. Dehmer and A. Mowshowitz, Bounds on the moduli of polynomial zeros. Applied Mathematics and Computation, 218, 8, 2011, pp. 4128-4137.M. Dehmer and A. Mowshowitz, Generalized graph entropies. Complexity Journal, 17, 2, 2011, pp. 45-50.S. Geyik, B. Szymanski, P. Zerfos, and A. Mowshowitz, Sensor Service Selection through Switch Options. IEEE International Conference on Services Computing,2011.A. Mowshowitz, A. Kawaguchi, A. Toce, A. Nagel, P. Stone, P. Dantressangle, and G. Bent, Network topology as a cost factor in query optimization. Annual Conference of the International Technology Alliance, Adelphi, MD, 2011.2011 - Computing joins on encrypted data (with W.E. Skeith, and G. Bent). Annual Conference of the International Technology Alliance, Adelphi, MD, 2011.A. Toce, A. Mowshowitz, P. Stone, P. Dantressangle, and G. Bent, HyperD: a hypercube topology for dynamic distributed federated databases. Annual Conference of the International Technology Alliance, Adelphi, MD, 2011.A. Kawaguchi, A. Mowshowitz, A. Toce, A. Nagel, G. Bent, P. Stone, and P. Dantressangle, Query optimization in a distributed hypercube database. Annual Conference of the International Technology Alliance, Imperial College-London, 2010.P. Stone, P. Dantressangle, G. Bent, and A. Mowshowitz, Review of relational algebra for dynamic distributed federated databases. Annual Conference of the International Technology Alliance, Imperial College-London, 2010.P. Stone, P. Dantressangle, G. Bent, A. Mowshowitz, A. Toce, and B. Szymanski, Relational algebra coarse grained query cost models for DDFDs. Annual Conference of the International Technology Alliance, Imperial College-London, 2010.M. Dehmer and A. Mowshowitz, Inequalities for entropy-based measures of network information content. Applied Mathematics and Computation 21,2010, pp. 4263–4271.A. Mowshowitz, G. Bent, and P. Dantressangle, Aligning network structures: embedding a logical dynamic distributed database in a MANET. Annual Conference of the International Technology Alliance, University of Maryland, 2009.A. Mowshowitz and N. Kumar, Then there were three, IEE",
  "content_length": 11119,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:15"
}