{
  "name": "Abby Stylianou",
  "homepage": "https://cs.slu.edu/people/stylianou",
  "status": "success",
  "content": "Computer Science Faculty and Staff : SLU - Saint Louis University Skip to main content Back to Main School of Science and Engineering Saint Louis University _ School of Science and Engineering Toggle menu Toggle search Search Search Popular Searches SLU People Finder Academic Programs SLU Libraries mySLU Login SLU Bookstore Academic Calendar School of Science and Engineering Request Info Visit Apply Give School of Science and Engineering About Academics Student Resources Faculty Research Toggle menu Contact Logan Corry 220 N. Grand Blvd St. Louis, MO 63103 357 Ritter Hall 314-977-6667 logan.corry@slu.edu Faculty Guidelines Rank and Tenure Procedures and Criteria Faculty Workload Computer Science Faculty and Staff Saint Louis University Department of Computer Science faculty present work at national and international conferences and publish results in renowned journals. They are principal investigators, currently leading projects funded by more than $1.7 million in awards. They are also educators, involving undergraduate and graduate SLU students in these research efforts. Students in the Department of Computer Science enjoy close working relationships with the department's faculty. Leadership Min Hyung Choi, Ph.D.Department chair Jason Fritts, Ph.D.Associate chair Flavio Esposito, Ph.D.Graduate coordinator James McCollum, Ph.D.Undergraduate coordinator Faculty Ankit Agrawal, Ph.D.Assistant professor Tae-Hyuk (Ted) Ahn, Ph.D.Associate professor Hadi Akbarpour, Ph.D.Assistant professor Qinglei Cao, Ph.D.Assistant professor Nan Cen, Ph.D.Assistant professor Michael Goldwasser, Ph.D.Professor Jie Hou, Ph.D.Assistant professor David Letscher, Ph.D.Associate professor Michael LiljegrenAssistant professor Daniel ShownProgram director, Open Source Software Center Abby Stylianou, Ph.D.Associate professor Reza Tourani, Ph.D.Assistant professor Courtesy Appointments Orhun Aydin, Ph.D.Assistant professor Vasit Sagan, Ph.D.ProfessorAssociate vice president for geospatial science at Saint Louis University Deputy director of Taylor Geospatial Institute Adjunct Faculty Shayna CorbinAdjunct professor Michael HolmesAdjunct professor Alexis McKenzieAdjunct professor Allison RichardetAdjunct professor Advisory Board SLU's Computer Science Advisory Board is a group of professionals drawn from a wide variety of computing careers, whose goal is to offer insights into the fast-paced and rapidly changing field of computer science. The Advisory Board's duties include a review of the department's academic portfolio and advancing university/industry partnerships in areas of research, innovation, and student mentorship and development. Joseph Busateri Joseph BusateriDirector of Information TechnologyCentene CorporationAdvisory Board member since 2019 Joseph Busateri, has over 30 years of experience in the technology industry. He has held leadership positions at Fortune 100 companies in the U.S., including MasterCard and Centene Corporation. He is currently the director of information technology at Centene, leading provider data systems teams; DevOps, machine learning, AI, Agile transformation, architecture, and mergers and acquisition data migrations. He is an inventor holding two U.S. patents in the technology space. He is committed to innovation and was quoted in the New York Times and several technology trade magazines for innovative application of social platforms in the workplace. He is a husband and father of five children. Eric Druker Eric DrukerData Science DirectorFacebookAdvisory Board member since 2019 Eric Druker is the Data Science Director - Central Integrity at Facebook. Eric believes the democratization of data empowers anyone with curiosity and analytic training to discover insights that can profoundly change the world and can regularly be found championing this view in person at conferences and over the air on his frequent radio appearances. With three young children and a busy work schedule, Eric relaxes by staying up all night in his backyard applying his technical skillset to his passion for deep space astrophotography. Jeff Heaton Ph.D. Jeff Heaton Ph.D.Vice President, Data ScienceRGA Reinsurance CompanyAdvisory Board member since 2019 As vice president, data science in RGA Reinsurance Company’s Global Research and Data Analytics department, Jeff Heaton works primarily with modeling risk for underwriting systems using electronic health records. In this role, Jeff’s IT background allows him to bridge the gap between complex data science problems and proven software development. Jeff joined RGA in 2001 as a member of the Information Technology (IT) group to design and implement systems for retrocession administration and premium calculation and transitioned to a data science role in 2013. He is a frequent speaker and author for organizations such as the Society of Actuaries (SOA), the Institute of Electrical and Electronics Engineers (IEEE), and for academic journals. Jeff has authored several books on artificial intelligence and teaches a graduate course at Washington University in St. Louis on this subject. Jeff is a senior member of the IEEE and a Fellow of the Life Management Institute (FLMI). He holds a Master of Information Management (MIM) degree from Washington University in St. Louis and a Ph.D. in computer science from Nova Southeastern University. Kelly Hopson Kelly HopsonDirector, Modern Software Engineering1904labs As practice lead and director of modern software engineering at 1904labs, Kelly Hopson and her team develop and implement cloud-native software solutions, web and mobile applications, and modern DevOps for clients across a diverse array of industries, including leaders in the financial and healthcare sectors. A St. Louis native, Kelly relocated to Chicago where she graduated cum laude from DePaul University and later developed applications for the United States Airforce while working at Isobar, a digital experience agency. Other past clients include Centene, Bayer, Bloomberg and TransUnion. A leader with a passion for technology and people, Kelly’s work is inspired by a user-centered design approach and an ever-evolving tech stack. Ryan McGrail Ryan McGrailDirector of Technology Architecture & StrategyEdward Jones Ryan McGrail has nearly 25 years of experience in the technology industry. A St. Louis native and alumnus of Saint Louis University, he has spent his professional career at Edward Jones in various roles to enable delivery of solutions that enhance the digital experience for the firm's clients and branch teams. Ryan has held various leadership positions, from platform operations to application enablement to enterprise architecture. He is currently responsible for architecture and strategy, which includes enterprise data/information, application, and technology architecture, and oversees technology-driven digital strategy initiatives. Ryan has a passion for digital transformation and has led efforts to adopt open source, cloud computing, DevOps, agile/product management, engineering excellence, and application modernization and platform migration. He is a husband and a father of five children, is active in his parish, and enjoys traveling with family and all things tech. Nate McKie Nate McKieVP of Application ServicesWorld Wide TechnologyAdvisory Board member since 2019 After serving as CTO for nearly 20 years at the custom software development shop known as Asynchrony, Nate transitioned to vice president and general manager of Application Services (Asynchrony’s new name) within WWT in 2019. As VP and GM, he is responsible for the continued financial and operational success and growth of the division. With his extensive experience and passion for this field, this role has proven to be a natural progression for Nate. Throughout his career, he has worked on significant global integration projects and has direct experience in a broad range of financial services companies, including finance companies, insurance, and mortgage banking. In 2003, Nate became interested in Agile as a way of harnessing the amazing R&D work that Asynchrony was doing into a mature process that could create ready-to-ship applications for our customers. Since then, WWT Application Services has become a leading practitioner of Agile techniques and ideas and has spread the disciplines of quality code and rapid implementation throughout its commercial and government customer base. WWT has more recently been branching out to other software solutions to help customers as well, including DevOps consulting, real-time performance monitoring, and coaching in Agile transformation and adoption. David Schuehler, D.Sc. David Schuehler, D.Sc.Chief ArchitectExegy David Schuehler, D.Sc. has over 30 years of experience developing real-time systems for the financial, defense and healthcare industries, specializing in system architecture, software development, communication protocols, embedded systems and hardware accelerated solutions. He is an inventor with 18 patents and received the St. Louis Business Journal Technology Award and Forty Under 40 Award. David is the chief architect at Exegy, the global leader in low-latency market data, execution systems, predictive trading signals and hardware-accelerated financial data processing. Ebony Williams Ebony WilliamsAssociate Director - TechnologyAT&TAdvisory Board member since 2019 Ebony Williams leads management professionals in the St. Louis region on behalf of AT&T's Technology Development Program. The Technology Development Program is dedicated to securing talented, highly qualified and extremely motivated students and college graduates in science, technology, engineering and mathematics (STEM) fields. Ebony's responsibilities include talent recruitment, job placement, new employee training, career development, coaching, supervision and day-to-day operations of the program. Ebony is a St. Louis native and holds a Bachelor of Science degree from Southern Illinois University - Edwardsv",
  "content_length": 10512,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:17"
}