{
  "name": "Abdelhakim Hafid",
  "homepage": "http://www.iro.umontreal.ca/~ahafid",
  "status": "success",
  "content": "A. Hafid Homepage Abdelhakim Senhaji Hafid Full Professor Department of Computer Science and Operations ResearchUniversity of Montreal More ... Biography Dr. Hafid is Full Professor at the University of Montreal. He is the founding director of Network Research Lab and Montreal Blockchain Lab . He is research fellow at CIRRELT, Montreal, Canada. Dr. Hafid published over 240 journal and conference papers; he also holds three US patents. He supervised to graduation over 50 graduate and postgraduate students. Prior to joining U. of Montreal, he spent several years, as senior research scientist, at Bell Communications Research (Bellcore), NJ, US working in the context of major research projects on the management of next generation networks. Dr. Hafid was also Assistant Professor at Western University (WU), Canada, Research director of Advance Communication Engineering Center (venture established by WU, Bell Canada and Bay Networks), Canada, researcher at CRIM, Canada, visiting scientist at GMD-Fokus, Germany and visiting professor at University of Evry, France. Dr. Hafid consulted for a number of telecommunication companies and startups in North America; he also gave talks/keynotes in a number of international conferences. He co-founded Tipot Technologies Inc. (Research & Development Platform for IoT). Dr. Hafid has extensive academic and industrial research experience in the area of the management and design of next generation networks. His current research interests include IoT, Fog/edge computing, blockchain, and intelligent transport systems. Teaching Blockchain Technology (2019, 2020, 2021) Introduction to Networking Communication Protocols E-commerce Technologies Web design and Development CONTACT Info Postal Address Department of Computer Science and Operational Research Université de Montréal PO Box 6128 Succ. Downtown Montreal, Quebec H3C 3J7 Civic address Department of Computer Science and Operations Research André-Aisenstadt Pavilion 2920 chemin de la Tour Montreal, Quebec H3T 1J4 Phone (514) 343-2446 Email ahafid@iro.umontreal.ca",
  "content_length": 2075,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:20"
}