{
  "name": "Abdeltawab M. Hendawi",
  "homepage": "https://homepage.cs.uri.edu/~ahendawi",
  "status": "success",
  "content": "<b> Abdeltawab Hendawi </b> Home Team Research Honours Teaching Abdeltawab Hendawi Associate Professor in Computer Science and Data Science, Co-director of the AI-Lab. Ph.D. in Computer Science, University of Minnesota. My research interest is in Spatial Databases, Big Data, and Applied AI. Applications in various domains such as Smart City, Smart Health, ... hendawi@uri.edu Selected News Panelist at the AMPO conference. AI Agents in Action. Reshaping Transportation Planning with Digital Twins, Providence, RI, 2025. Best Demo Paper Award, at the 26th IEEE MDM, Irvine, CA 2025. Collaboration between my Lab and MindImmune Co., 2025. Interview with Chris Stokel-Walker about our study of \"The environmental impact of LLMs\" published at the Fast Company magazine, 2025. Speaker at the AI-Summit, Research Session, URI, 2025. Distinguished Program Committee Member, ACM Sigspatial 2024. Introducing my CSC 592 Generative AI course, Fall 2024. Great achievement. URI ranked No. 1 public university in New England, among best nationally by Wall Street Journal, 2024. Second Best Poster Award for my PhD student, Chamudi, at the URI AI Poster Competition 2024. Participating in the Rhode Island Transportation Research & Innovation Forum 2024. Bronze Medal (the third place) for my PhD student, Chan Young, at the ACM Student Research Competition (SRC) for the work presented at the ACM Sigspatial 2023. Guest speaker at IEEE CAISAIS conference 2023. My PhD student Chan Young recieved the RiseUp scholarship 2023-2024. Our work on AI for surface indentification was selected in the top three winners at the LaunchURI program. My graduate student Maryam defended her Masters degree. Panelistat at the 2023 Emerging Areas of Science IDeA Symposium at Brown University My Research is Funded by AMPO Conference 2025 Panel, \"AI Agents in Action. Reshaping Transportation Planning\", AMPO, 2025. AI-Summit at URI 2025 Presenting At the URI AI-Summit, 2025. AI-Lab My research group: Chamudi, Maryam then my guest Professor Janet Pirchard to my right, Robbie to my left, and Kyle and Chan at front, 2023. © A H. All Rights Reserved.",
  "content_length": 2126,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:21"
}