{
  "name": "Abdoulaye Baniré Diallo",
  "homepage": "https://professeurs.uqam.ca/professeur/diallo.abdoulaye",
  "status": "success",
  "content": "Abdoulaye Banire Diallo | Répertoire des professeures et professeurs - UQAM Abdoulaye Banire Diallo Professeur Abdoulaye Banire Diallo Professeur Unité : Département d'informatique Courriel : diallo.abdoulaye@uqam.ca Téléphone : (514) 987-3000 poste 3914 Langues : Français, Anglais Ce professeur désire s'entretenir avec les médias Domaines d'expertise Apprentissage machine Bioinformatique Biologie computationnelle Liens d'intérêt Page personnelle Informations générales Unités de recherche Centre d'excellence en recherche sur les maladies orphelines - Fondation Courtois (CERMO-FC) Institut des sciences de l'environnement de l'UQAM (ISE) Affiliations externes principales Réseau Québecois de reproduction Réseau Québecois de Recherche sur le Médicament Enseignement Séminaire interdisciplinaire de bio-informatique (2025, 2024, 2023) Initiation à la recherche en informatique (2025, 2024) Projet technique (2024, 2023) Rapport technique (2024, 2023) Méthodes d'intelligence artificielle en bioinformat. (2024, 2022, 2021) Projet de thèse (2024, 2023, 2021) Stage industriel (2023) Bioinformatique des structures (2023) Bioinformatique (2022) Atelier (2021) Réalisations Ancestors 1.0 - Pour la reconstruction des génomes ancestraux Armadillo 1.1 - Pour les flux de reconstruction phylogénétique Castor 1.0 - Platforme pour la classification de séquences virales WMP - Wheat microRNA portal PGR - Protein Graph Repository Mirdup - MicroRNA duplex prediction T-Growler - An ontology-based workflow pattern extractor ProtNN - protein 3D-structure classification approach Galaxy-X - An open set classifier Distinctions Prix d'innovation de l'Adriq Next Einstein Forum Fellow (Kigali, 2018) Prix Springer - Société Francophone de Classification (Naples, 2008) Chikiyo Ayashi Award - International Federation of Classification Societies (Ljubljana, 2006) Prix d'excellence en Enseignement (UQAM, Sciences, 2015 ) Prix meilleur article à Machine learning and Data Mining Conference (New York, 2016) Directions de thèses et mémoires Thèses de doctorat Remita, Amine. (2024). Approches variationnelles pour l'analyse des séquences génomiques évolutives. (Thèse de doctorat). Université du Québec à Montréal. Marcia Soares Almeida, Hayda. (2022). Learning to discover biosynthetic gene clusters in fungi. (Thèse de doctorat). Université du Québec à Montréal. Halioui, Ahmed. (2018). Extraction de flux de travaux abstraits à partir des textes : application à la bioinformatique. (Thèse de doctorat). Université du Québec à Montréal. Mémoires Coleman, Emilia Aïsha. (2025). Méthodes bio-informatiques pour les analyses de données SCRNA-SEQ pour étudier la maladie d'Hirschsprung. (Mémoire de maîtrise). Université du Québec à Montréal. De Montigny, Nicolas. (2024). Conception d'une méthode d'apprentissage machine pour la détection des microorganismes bactériens à partir de données de séquençages métagénomiques sans procédure d'alignement. (Mémoire de maîtrise). Université du Québec à Montréal. Balde, Abdourahmane. (2024). Méthode d'extraction de signatures de biomarqueurs métaboliques dans le cadre de prédiction des maladies chez les bovins laitiers. (Mémoire de maîtrise). Université du Québec à Montréal. Chatou, Mohammed Reda. (2024). Approche d'identification du nombre optimal de clusters dans les algorithmes de regroupement en combinant k-means et des métaheuristiques. (Mémoire de maîtrise). Université du Québec à Montréal. Lebatteux, Dylan. (2019). Méthodes efficaces pour l'extraction d'attributs et la classification de séquences génomiques virales basées sur une approche indépendante de l'alignement. (Mémoire de maîtrise). Université du Québec à Montréal. Belarbi, Faten. (2019). Optimisation des hyperparamètres pour la classification des virus. (Mémoire de maîtrise). Université du Québec à Montréal. Mbaye, Mouhamadou Moustapha. (2019). Algorithme pour la reconstruction de séquences ancestrales en incluant les événements de transferts horizontaux de gènes. (Mémoire de maîtrise). Université du Québec à Montréal. Diop, Ndiaye. (2019). Évaluation des méthodes d'analyses d'expression différentielle des petits ARNs. (Mémoire de maîtrise). Université du Québec à Montréal. Goimard, Jérémy. (2018). Méthodes bio-informatiques basées sur les flux de travaux pour le séquençage à haut débit. (Mémoire de maîtrise). Université du Québec à Montréal. Wu, Chao Jung. (2018). Une approche distribuée de prédiction et d'analyses de microARNs : cas d'application du blé. (Mémoire de maîtrise). Université du Québec à Montréal. Remita, Mohamed Amine. (2017). Méthodes et plateformes bioinformatiques basées sur l'apprentissage automatique pour la classification efficace de séquences biologiques. (Mémoire de maîtrise). Université du Québec à Montréal. Aouabed, Zahia. (2016). Méthodes bio-informatiques pour l'analyse des mécanismes moléculaires conduisant à la résistance aux médicaments dans le cancer du sein. (Mémoire de maîtrise). Université du Québec à Montréal. Kiani, Golrokh. (2015). Bioinformatics approach for the identification of fragile regions on the human genome. (Mémoire de maîtrise). Université du Québec à Montréal. Daigle, Bruno. (2013). Méthodes bioinformatiques pour l'évaluation de la classification du virus du papillome humain. (Mémoire de maîtrise). Université du Québec à Montréal. Leclercq, Mickaël. (2012). Identification et caractérisation de microARNs dans les ESTs du blé par des méthodes bioinformatiques. (Mémoire de maîtrise). Université du Québec à Montréal. Rapports d'activités et projets d'intervention Diallo, Abdoul Karim. (2025). Opt-lait : système d'aide à la décision pour les éleveurs de bovins laitiers et coopératives de femmes transformatrices de lait. (Rapport d'activités et projet d'intervention). Université du Québec à Montréal. Publications Articles scientifiques Diallo, A.B., Lord, E., Leclercq, M., Boc, A. et Makarenkov, V. (2012). Armadillo, an elegant workflow platform for bioinformatics education and task automation. PLOS One, 7(1). Obtenir \"Armadillo, an elegant workflow platform for bioinformatics education and task automation\" aux bibliothèques de l'UQAM Diallo, A.B., Horvath, J., Sheedy, C., et al. (2011). Comparative analysis of the primate X inactivation Center Region and Reconstruction of the Ancestral Primate XIST Locus. Genome Research, 21(6), 850–862. Obtenir \"Comparative analysis of the primate X inactivation Center Region and Reconstruction of the Ancestral Primate XIST Locus\" aux bibliothèques de l'UQAM Badescu, D., Boc, A., Diallo, A.B. et Makarenkov, V. (2011). Detecting genomic regions associated with a disease using variability functions and Adjusted Rand Index. BMC Bioinformatics, 12(9). http://dx.doi.org/10.1186/1471-2105-12-S9-S9. Badescu, D., Boc, A., Diallo, A.B. et Makarenkov, V. (2011). Predicting site-specific human selective pressure using evolutionary signatures. Bioinformatics, 27(10-13), i266–i274. Obtenir \"Predicting site-specific human selective pressure using evolutionary signatures\" aux bibliothèques de l'UQAM Diallo, A.B., Blanchette, M. et Makarenkov, V. (2010). Ancestors 1.0: A web server for ancestral Genome reconstruction. Bioinformatics, 26(1), 130–131. Obtenir \"Ancestors 1.0: A web server for ancestral Genome reconstruction\" aux bibliothèques de l'UQAM Diallo, A.B., Badescu, D., Blanchette, M. et Makarenkov, V. (2009). A whole genome study and identification of specific carcinogenic regions of the Human Papilloma Viruses. Journal of Computational Biology, 16(10), 1461–1473. Obtenir \"A whole genome study and identification of specific carcinogenic regions of the Human Papilloma Viruses\" aux bibliothèques de l'UQAM Diallo, A.B., Badescu, D., Blanchette, M. et Makarenkov, V. (2009). Classification of the Human Papilloma Viruses. proceedings of SFC-CLADAG 2008, 8. Obtenir \"Classification of the Human Papilloma Viruses\" aux bibliothèques de l'UQAM Diallo, A.B., Badescu, D., Makarenkov, V. et Blanchette, M. (2008). An Evolutionary study of the Human Papilloma Viruses. Research in Computational Biology-Comparative Genomics, 128–140. Obtenir \"An Evolutionary study of the Human Papilloma Viruses\" aux bibliothèques de l'UQAM Diallo, A.B., Makarenkov, V. et Blanchette, M. (2007). Exact and heuristic method to the indels maximum likelihood problem. Journal of Computational Biology, 14(4), 446–461. Obtenir \"Exact and heuristic method to the indels maximum likelihood problem\" aux bibliothèques de l'UQAM Diallo, A.B., Makarenkov, V. et Lapointe, F.-J. (2006). A new effective method for estimation of missing values in the sequence data prior to phylogenetic analysis. Evolutionary Bioinformatics Online, (2), 127–135. Obtenir \"A new effective method for estimation of missing values in the sequence data prior to phylogenetic analysis\" aux bibliothèques de l'UQAM Diallo, A.B., Makarenkov, V. et Blanchette, M. (2006). Finding Maximum Likelihood Indel Scenarios. Comparative Genomics, 171–185. Obtenir \"Finding Maximum Likelihood Indel Scenarios\" aux bibliothèques de l'UQAM Chapitres de livre Diallo, A.B., Makarenkov, V. et Boc, A. (2008). Algorithms for detecting complete and partial horizontal gene transfers: Theory and practice. Dans P.M. Pardalos et P. Hansen (dir.). Data Mining and Mathematical Programming (45) (p. 159–179). Diallo, A.B., Blanchette, M., Green, E.D., Miller, W. et Haussler, D. (2007). Computational reconstruction of ancestral DNA sequences. Dans M.J. Murphy (dir.). Methods in Molecular Biology: Phylogenomics (p. 171–184). Totowa, NJ : Humana Press Inc. Actes de colloque Badescu, D., Diallo, A.B., Makarenkov, V. et Blanchette, M. (2010). Identification of specific genomic regions responsible of the invasivity of Neisseria meningitidis. Dans Actes de l'International Federation of Classification Societies 2009, Dresden, Germany. Springer-verlag. Diallo, A.B., Valtchev, P. et Makarenkov, V. (2010). Une approche efficace d'identification et de catégorisation de nouveaux motifs d'évolution dans la famille de mammifè",
  "content_length": 12628,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:22"
}