{
  "name": "Abdullah Al Mueen",
  "homepage": "http://www.cs.unm.edu/~mueen",
  "status": "success",
  "content": "Abdullah Mueen @ UNM Interest Temporal Data Mining-Blockchain Data Mining-Social Media Mining-Focusing on trust, privacy, scalability and interactivity. Our 2012 SIGKDD paper has won the ACM SIGKDD Test-of-Time Award. News Post MASS is now a MATLAB tool in the Predictive Maintenance toolbox. Mueen has been awarded the Research Leader award by UNM Provost. Pages you may be interested in MASS (Mueen's Algorithm for Similarity Search) BitLink: a method to link address clusters on Bitcoin blockchain using temporal patterns. A promotional video describes the work at high level. Slides Mining and Learning from Seismic Data. Videos of tutorials in KDD 2016 and KDD 2017 are available. A promotional video describes aftershock detection as a few-shot time series classification problem. Slides Compressing and Fusing Static LiDAR Data Slides (Video1 Video2 comparison) DeBot: Twitter Bot Detection via Activity Correlation (Video of in-sync bots) (Quotes) AWarp: Dynamic Time Warping for Sparse Time Series My CV Publications DBLP Google Scholar ResearchGate Students My PhD students are Amanda Minnich (PhD 2017, Lawrence Livermore National Lab) Hossein Hamooni (PhD 2017, Visa) Nikan Chavoshi (PhD 2018, Oracle) Noor Abu-El-Rub (PhD 2019, University of Kansas) Mohammad Ashraf Siddiquee (PhD 2022, Microsoft) Farhan Asif Chowdhury (PhD 2023, Meta) Parvez Mollah (PhD 2023, Meta) Sheng Zhong (PhD 2024, Ultramain) Dheeman Saha Ala Jararweh Xuzhou Qin A glimpse of my diverse research students My students are positioned in prestigious organizations Teaching I teach the following classes. Click to see the most recent syllabus. Course content is in UNM Learn. CS 521: Data Mining Methods CS 464/564: Introduction to Database Management Systems CS 261: Mathematical Foundations of Computer Science CS 533: Experimental Methods in Computer Science CS 592: Colloquium in Computer Science CS 491/591: Social Media Computing CS 600: Research Practicum Biography Abdullah Mueen is a Professor in Computer Science at the University of New Mexico. He joined UNM as an Assistant Professor in 2013. Earlier he was a Scientist in the Cloud and Information Sciences Lab at Microsoft Corporation. His major interest is in temporal data mining with a focus on efficiency, interactivity, and interpretability. He has won the ACM SIGKDD Test-of-Time Award in 2022, Junior Faculty Research Excellence Award from the School of Engineering at UNM, runner-up award in the Doctoral Dissertation Contest in KDD 2012, and the best paper award in KDD 2012. His research has been funded by NSF, NIH, DARPA, AFRL, NEC, Exxon, Microsoft and LANL. Contact Me mueen_at_unm_dot_edu Albuquerque, NM, U.S.A. (505) 277 1914 Powered by w3.css",
  "content_length": 2709,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:26"
}