{
  "name": "Abdullah-Al-Zubaer Imran",
  "homepage": "https://aaz-imran.github.io",
  "status": "success",
  "content": "About - Abdullah-Al-Zubaer Imran Abdullah-Al-Zubaer ImranAssistant Professor of Computer Science, University of Kentucky Follow Email LinkedIn Github Google ScholarAbdullah-Al-Zubaer (Abdullah) Imran is an Assistant Professor of Computer Science and a Lighthouse Beacon Foundation Scholar of the Stanley and Karen Pigman College of Engineering at the University of Kentucky. He is also an affiliated faculty member at the UK Center for Clinical and Translational Science, Markey Cancer Center, and UNITE Research Priority Area. He is an investigator of the NSF and Kentucky Economic Development Cabinet-funded $24M CLIMBS project. Prior to joining UK, he worked as a Postdoctoral Scholar at Stanford University. He received his PhD in Computer Science from the University of California, Los Angeles (UCLA), advised by Distinguished Professor Demetri Terzopoulos. He also worked at VoxelCloud, Inc., Philips Corporate Research, and Tencent Medical AI. His research and teaching are primarily centered on artificial intelligence and computer vision with applications in medicine, climate change, and social sciences. Major highlights of his recent work have been in the realm of learning with limited labeled data employing generative AI, multimodal fusion, and self-supervised learning techniques. He has numerous publications in journals, book chapters, and refereed conferences as well as an omnibus patent. He is the winner of two Best Paper Awards for his work in machine learning and 3D medical image segmentation. He has served as Area Chair and Senior Program Committee for top medical imaging/AI conferences, including AAAI, MICCAI, and MIDL. He has also served as a Program Committee/Reviewer for several of the most prestigious international AI and medical imaging conferences/journals, including AAAI, ACM HEALTH, CVPR, ECCV, ICCV, ICLR, IEEE TAI, IEEE TMI, IEEE TPAMI, ISBI, Medical Physics, MICCAI, NeurIPS, and WACV. He is a member of AAPM, ACM, IEEE, IEEE EMBS, MICCAI, and SPIE.For prospective students interested in joining our group, you can check out the openings page.$~$News/UpdateI am teaching CS 460G: Machine Learning in Spring 2026!Honored to be selected as a 2026 Lighthouse Beacon Foundation Scholar!Manuscript accepted by Physics in Medicine & Biology!Congratulations Tyler on passing his PhD Qualifying Exam!Manuscript accepted for publication in MELBA (Machine Learning for Biomedical Imaging). Congratulations Tyler!Two papers accepted at SPIE Medical Imaging 2026. Congratulations Tyler and Ramisa!I am giving a talk on Image Quality at SPR 2025Paper accepted at GenAI4Health @NeurIPS 2025. Congratulations Afsaneh!I am serving as an Area Chair for MIDL 2026More news",
  "content_length": 2698,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:27"
}