{
  "name": "Abdullah Al-Mamun 0001",
  "homepage": "https://www.augusta.edu/faculty/directory/view.php?id=AALMAMUN",
  "status": "success",
  "content": "Abdullah Al-Mamun - Faculty Profile Home Faculty Directory Profile Update Your Profile Directory FAQs PACT Login Give Feedback Abdullah Al-Mamun Assistant Professor Abdullah Al-Mamun Assistant Professor Academic Appointment(s)AdministrationDepartment of Computer & Cyber SciencesSchool of Computer and Cyber SciencesDepartment of Computer & Cyber SciencesAdministrationDepartment of The Graduate School BioAbdullah Al-Mamun is an assistant professor at the Computer and Cyber Sciences Department at Augusta University. His research interests encompass resource-efficient data management, distributed systems, and high-performance computing.He collaborates with many industries and academic partners to solve big and significant problems, ranging from HPC infrastructures to large-scale data-intensive computing systems. His research outcomes have been published in premiere venues such as SC, ICDE, IPDPS, NDSS, and ICPP and turned into software prototypes. AALMAMUN@augusta.edu UH 131E Personal Website General Credentials Instruction Scholarship Service Education Ph.D., Computer Science University of Nevada - Reno, 2022 MS, Media Informatics University of Trento, 2013 MSCS, Computer Science RWTH Aachen University, 2013 BS, Computer Science American International Univers, 2009 Certifications Clinical and Translational Science (CCTS) Case Studies in Mentoring University of Alabama at Birmingham, 2024 Awards & Honors CRII: CSR: Enhancing Eventual Data Consistency in Multidimensional Scientific Computing through Lightweight In-Memory Distributed Ledger System\" (Role: PI, Awarded by NSF CRII, Award No. 2348330, awarded amount: $165, 000, period: April, 2024 - March, 2026) NSF, 2024 Google Cloud Computing Services Research Grant. Awarded amount: $10,000, period: April 2024 - March 2026, Awarded by NSF, Award No. 2348330 NSF, 2024 Outstanding Graduate Student Award University of Nevada, Reno, 2021 Outstanding Graduate Student Award University of Nevada, Reno, 2020 Premio De Merito University of Trento, 2013 Courses Taught Most Recent Academic Year CSCI 8940 Dissertation Research CSCI 7585 High Performance Computing CSCI 8510 Independent Study: Data Intensive Computing CSCI 5371 Low-Level Programming CSCI 3371 Low-Level Programming Language Teaching Interests Low-level Programming Language, Database, Distributed Computing, High-Performance Computing, Computer Architecture & Parallel Processing, and Operating Systems. Scholarship Selected Recent Publications DeQL: A High-Performance Decentralized Framework for Reliable CI/CD Workflow, 2025 Abstract Reinventing CI/CD for Collaborative Sciences: A Blockchain-Integrated Decentralized Middleware for Scalable and Fault-Tolerant Workflows., 2025 Conference Proceeding Adversary-Resilient Clustered Federated Learning for Secure AI-Driven Healthcare Data Analytics., 2025 Conference Proceeding Dynamic Blockchain Sharding for Efficient and Reliable Vector Data Management in Edge Computing, 2025 Abstract Toward Performant and Energy-Efficient Network Queries: A Parallel and Stateless Approach, 2023 Journal Article, Academic Journal Research Interests Resource-efficient distributed data management, High-performance blockchain, and dependable AI Department Service ACM Programming SIG Club 2023 - 2024 Role: Faculty Advisor University Service Advisory Committee member for AU HPC-core 2025 - Present Role: Committee Member ACM SIG Club 2023 - Present Role: Faculty Advisor Professional Service International Conference on Artificial Intelligence, Computer, Data Sciences and Applications (ACDSA 2026) 2025 - Present Role: Reviewer, Conference Paper Springer Nature 2025 - Present Role: Reviewer, Journal Article IEEE Transactions on Consumer Electronics 2023 - Present Role: Reviewer Modern Systems 2022 in conjunction with International Conference of Modern Systems Engineering Solutions 2022 - Present Role: Committee Member IEEE Internet of Things Journal 2022 - Present Role: Reviewer",
  "content_length": 3960,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:26"
}