{
  "name": "Abdullah Al Arafat",
  "homepage": "https://abdullahaarafat.github.io",
  "status": "success",
  "content": "Abdullah Al Arafat Abdullah Al ArafatAssistant Professor, FIU Follow Miami, FL, USA Florida International University aarafat@fiu.edu Google ScholarI am an Assistant Professor at the Knight Foundation School of Computing and Information Sciences (KFSCIS) at Florida International University (FIU), Miami. I received my Ph.D. in Computer Science from North Carolina State University in 2025. My research interests include Scheduling Theory, Algorithms, and Real-Time & Intelligent Systems.Fully Funded Ph.D. Positions Available: We are looking for 1–2 highly motivated Ph.D. students interested in systems or theory-inclined research to join our lab starting Fall 2026. If you are passionate about exploring cutting-edge research in real-time systems, cyber-physical systems, and secure and robust machine learning, we encourage you to contact me at aarafat@fiu.edu with a short note on your research interests, your CV, transcripts, and writing samples (published paper, if applicable).Contact Office/Lab: 11200 SW 8th St. CASE 261B Phone: 305-348-7984 Email: aarafat@fiu.eduNews[11/2025] [New Papers!] CertMask got accepted at AAAI 2026, Unified Allignment Protocol (UAP) got accepted at WACV 2026, and ViT Accelerator got accepted at DATE 2026[05/2025] Two papers on resilient scheduling and real-time heart monitoring got accepted at RTCSA 2025[05/2025] Received NC State College of Engineering Doctoral Scholar of the Year, RESEARCH! award for the academic year 2024-2025.[04/2025] Defended my Ph.D. dissertation![04/2025] Received NSF Student Travel Grant to attend CPS-IoT Week 2025 in Irvine, CA![02/2025] Our paper on ViT compression (DeepCompress-ViT) got accepted at CVPR 2025[01/2025] [New Papers!] SOTERIA got accepted at HSCC 2025 and Physics-Informed Mixed-Criticality Scheduling got accepted at RTAS 2025[07/2024] [New Papers!] NFT got accepted at ECCV 2024, FIP got accepted at CCS 2024, and Multi-threaded ROS 2 got accepted at EMSOFT 2024[04/2024] Received NSF Student Travel Grant to attend CPS-IoT Week 2024 in Hong Kong, China![03/2024] Received Graduate Merit Award from the College of Engineering, NCSU![01/2024] Received Mentored Teaching Fellowship and will be co-instructor for CSC 714: Real-Time Systems at NCSU![08/2023] One paper on Static Slack Stealing got accepted at RTSS 2023[07/2023] One paper (SSDA) got accepted at ICCV 2023[04/2023] Received COE Travel Grant from NCSU![03/2023] Received ACM SIGBED Student Travel Grant for CPS-IoT Week 2023![01/2023] One paper on Mixed-Criticality Scheduling got accepted at RTAS 2023[11/2022] Received IEEE RTSS Travel Grant![11/2022] One workshop paper on Resilient RT Scheduling got accepted at WMC 2022, co-located with RTSS 2022[06/2022] Received Presentation Fellowship from UCF![04/2022] DAC 2022 paper on ROS 2 selected as Publicity Paper! (News coverage)[03/2022] Our survey paper on ML for Real-Time CPS got accepted at IEEE IoT-J[02/2022] One paper (ROS2 Scheduling) got accepted at ACM/IEEE DAC 2022[04/2021] Received Doctoral Research Support Award (award amount: $3000.00) from the College of Graduate Studies, UCF![01/2021] One paper (VR-Spy) got accepted at IEEE VR 2021",
  "content_length": 3158,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:24"
}