{
  "name": "Abdullah Algarni",
  "homepage": "https://www.facebook.com/public/Abdullah-Algarni/school/King-Abdulaziz-University-103095679730320",
  "status": "success",
  "content": "Home I am Abdullah Muzahid. I am an associate professor at the Department of Computer Science and Engineering of Texas A&M University. I am here since Fall 2018. Before that, I worked as an assistant Professor at the Department of Computer Science of University of Texas at San Antonio. I received my Ph.D in Computer Science from University of Illinois, Urbana-Champaign in 2012. My research broadly focuses on various aspects of Computer Architecture and Systems. I am interested in multiprocessor architecture, parallel programming, programming models, debugging, program analysis and synthesis. Recently, I am applying Machine Learning to solve these issues. I have received NSF CAREER award in 2017 and Intel PhD Fellowship in 2010. Here is my CV. Recent News: - [Sep 2024]: Dr. Muzahid got promoted to Associate Professor!- [Jul 2024]: Our paper got accepted in MICRO 2024. Congratulations to Kevin and team!!!- [May 2024]: Vahid and Farabi are graduating this summer. Vahid will join Qualcomm and Farabi will join AMD. Congratulations!!!- [Oct 2023]: Our paper got accepted in HPCA 2024. Congratulations to Sabuj and team!!!- [Aug 2023]: Our paper got accepted in MICRO 2023 and ACSAC 2023. Congratulations to both Vahid, Farabi and team!!!- [Aug 2023]: We welcomed a new PhD student, Avery.- [May 2023]: Shantanu defended his PhD. Congratulations to Dr. Mandal!!! He will join Wells Fargo as a machine learning engineer.- [May 2023]: Our paper got accepted in ARCS 2023. Congratulations to Kevin and team!!!- [April 2023]: Our paper, SmartIndex, got accepted in CAL. Congratulations to Kevin and the team!!!- [Oct 2022]: Our paper, MERCURY, got accepted in HPCA 2023. Congratulations to Vahid and the team!!! - [July 2022]: Invited to serve in HPCA 2023 ERC.- [July 2022]: NSF award for stream processing system received.- [June 2022]: Our paper, Whistle, has been accepted in IEEE TC.- Kathy is joining Intel as a Software Enginner from Summer 2022.- Invited to serve in MICRO 2022 PC.- Invited to serve in an NSF panel.- Invited to be in ISCA 2022 PC and serve as a Publications Chair.- Kevin is going for summer internship in AMD. Congratulations!!!- Intel has selected us for a $75K grant for machine programming research. We are one of the only 6 groups to receive this grant this year. - Invited to serve in HPCA 2021 PC.- Paper got accepted in MLSys 2021. Congratulations to Shanto!!!",
  "content_length": 2399,
  "method": "selenium",
  "crawl_time": "2025-12-01 15:39:25"
}