{
  "name": "Abdullah Yasin Nur",
  "homepage": "https://ayasinnur.com",
  "status": "success",
  "content": "About Me - Abdullah Yasin Nur Skip to content Associate ProfessorDepartment of Computer ScienceOffice: Math 329-AUniversity of New OrleansNew Orleans, LA, 70148Email: ayn@cs.uno.eduPhone: +1 504 280 4389 I am an Associate Professor in the Department of Computer Science at the University of New Orleans. I received my Ph.D. degree in Computer Science from the University of Louisiana at Lafayette in 2018. My research interests are Network Security, AI-driven Cybersecurity, Network Measurement and Analysis, Network Topology Discovering and Modeling, and Graph Theory. Also, I am very interested in the macroeconomy, the stock market, and the foreign exchange market. Education Ph.D. in Computer Science2014 – 2018University of Louisiana at LafayetteLafayette, LA, USA M.Sc. in Computer Science2014 – 2017University of Louisiana at LafayetteLafayette, LA, USA B.Sc. in Computer Science2010 – 2014Isik UniversityIstanbul, Turkey B.Sc. in Electrical & Electronics Engineering2010 – 2014Isik UniversityIstanbul, Turkey Associate Professor2025 – PresentAssistant Professor2019 – 2025Department of Computer ScienceUniversity of New OrleansClasses:CSCI 3301 Computer Design & OrganizationCSCI 3090 Undergraduate SeminarCSCI 3097 Problems in Computer Science CSCI 4130/5130 Introduction to Cryptography CSCI 4311/5311 Computer Networks and Telecommunications CSCI 4460/5460 Network Operation & Defense CSCI 4621/5621 – Introduction to Cybersecurity CSCI 6090 Advanced Problems in Computer Science CSCI 6621 – Advanced Network Security Teaching AssistantThe Center for Advanced Computer StudiesUniversity of Louisiana at Lafayette2014 – 2018Classes:INFX320 Information Assurance/SecurityINFX412 Visual AnalyticsINFX443 Distributed Information SystemsINFX502 Systematic Methods in Informatics InternInformation Technology DepartmentTurkish AirlinesIstanbul, TurkeySummer 2014 Copyright © 2025 Abdullah Yasin Nur",
  "content_length": 1903,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:24"
}