{
  "name": "Abel Souza",
  "homepage": "https://asouza.io",
  "status": "success",
  "content": "Abel Souza Baskin School of Engineering 606 Engineering Loop, RM 237B (E2) Santa Cruz, CA 95064 Hello and welcome! I am Abel Souza, an Assistant Professor in the Computer Science and Engineering (CSE) Department at UC Santa Cruz. My research centers on expanding the understanding of computing systems, from small embedded devices to large scale data centers, encompassing resource planning and the deployment of optimal strategies for distributed and data-intensive systems that support AI, Machine Learning, and web workloads. Recently, my work has expanded into sustainable, carbon-aware approaches to designing and managing cloud data centers and cyber physical systems, with the goal of achieving zero-carbon operations. A key theme in my research explores the efficient application of predictive analytics methods to process and model vast amounts of data, tailoring resource management holistically to applications. This involves determining the optimal quantity and type of resources to allocate, as well as the most effective deployment times and locations. Prior to joining UCSC, I was a Postdoctoral Researcher at the University of Massachusetts Amherst, and a PhD student in the Department of Computing Science at Umeå University (Sweden). At UMass, I worked with Prof. Prashant Shenoy in the Laboratory for Advanced System Software. At UmU, I worked in the Autonomous Distributed Systems Lab. under the guidance of Dr. Johan Tordsson and Prof. Erik Elmroth. news Jul 8, 2025 Fourth Workshop on Sustainable Computer Systems - Call for Participation Jan 12, 2025 Paper On Leveraging mesoscale spatial carbon-intensity variations for low carbon edge computing accepted! Nov 12, 2024 Paper On Reducing Tail Response Time of Distributed Services Through System-Wide Scheduling accepted! Aug 8, 2024 ACM e-Energy 2025 Call for Papers Mar 21, 2024 Applications to the 2024 UMass Amherst Turing Summer Program open! selected publications EuroSys On the Limitations of Carbon-Aware Temporal and Spatial Workload Shifting in the Cloud Thanathorn Sukprasert, Abel Souza, Noman Bashir, David Irwin, and Prashant Shenoy In Proceedings of the 19th European Conference on Computer Systems (EuroSys), 2024 Abs arXiv Bib Cloud platforms have been focusing on reducing their carbon emissions by shifting workloads across time and locations to when and where low-carbon energy is available. Despite the prominence of this idea, prior work has only quantified the potential of spatiotemporal workload shifting in narrow settings, i.e., for specific workloads in select regions. In particular, there has been limited work on quantifying an upper bound on the ideal and practical benefits of carbon-aware spatiotemporal workload shifting for a wide range of cloud workloads. To address the problem, we conduct a detailed data-driven analysis to understand the benefits and limitations of carbon-aware spatiotemporal scheduling for cloud workloads. We utilize carbon intensity data from 123 regions, encompassing most major cloud sites, to analyze two broad classes of workloads – batch and interactive – and their various characteristics, e.g., job duration, deadlines, and SLOs. Our findings show that while spatiotemporal workload shifting can reduce workloads’ carbon emissions, the practical upper bounds of these carbon reductions are currently limited and far from ideal. We also show that simple scheduling policies often yield most of these reductions, with more sophisticated techniques yielding little additional benefit. Notably, we also find that the benefit of carbon-aware workload scheduling relative to carbon-agnostic scheduling will decrease as the energy supply becomes “greener”. @inproceedings{sukprasert2024limitations, title = {On the Limitations of Carbon-Aware Temporal and Spatial Workload Shifting in the Cloud}, author = {Sukprasert, Thanathorn and Souza, Abel and Bashir, Noman and Irwin, David and Shenoy, Prashant}, year = {2024}, booktitle = {Proceedings of the 19th European Conference on Computer Systems (EuroSys)}, } SoCC Enabling sustainable clouds: The case for virtualizing the energy system Noman Bashir, Tian Guo, Mohammad Hajiesmaili, David Irwin, Prashant Shenoy, Ramesh Sitaraman, Abel Souza, and Adam Wierman In Proceedings of the ACM Symposium on Cloud Computing, 2021 Bib HTML PDF Video @inproceedings{bashir2021enabling, presentation = {https://youtu.be/m0RLpmOCpv4?si=en2plapYoPNcP_-5}, title = {Enabling sustainable clouds: The case for virtualizing the energy system}, author = {Bashir, Noman and Guo, Tian and Hajiesmaili, Mohammad and Irwin, David and Shenoy, Prashant and Sitaraman, Ramesh and Souza, Abel and Wierman, Adam}, booktitle = {Proceedings of the ACM Symposium on Cloud Computing}, pages = {350--358}, year = {2021}, } ASPLOS Ecovisor: A virtual energy system for carbon-efficient applications Abel Souza, Noman Bashir, Jorge Murillo, Walid Hanafy, Qianlin Liang, David Irwin, and Prashant Shenoy In Proceedings of the 28th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, Volume 2, 2023 arXiv Bib HTML PDF Code Slides @inproceedings{ecovisor, title = {Ecovisor: A virtual energy system for carbon-efficient applications}, author = {Souza, Abel and Bashir, Noman and Murillo, Jorge and Hanafy, Walid and Liang, Qianlin and Irwin, David and Shenoy, Prashant}, booktitle = {Proceedings of the 28th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, Volume 2}, pages = {252--265}, year = {2023}, doi = {10.1145/3575693.3575709}, } The best way to reach me is through e-mail.",
  "content_length": 5664,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:30"
}