{
  "name": "Abhaya Kumar Sahoo",
  "homepage": "https://cse.kiit.ac.in/profiles/abhaya-kumar-sahoo",
  "status": "success",
  "content": "Abhaya Kumar Sahoo - KIIT School of Computer Engineering Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Abhaya Kumar Sahoo Abhaya Kumar Sahoo Abhaya Kumar Sahoo Associate ProfessorDr. Abhaya Kumar Sahoo is currently working as an Associate Professor in School of Computer Engineering, KIIT Deemed to be University, Odisha. He has completed his B. Tech, M. Tech and Ph.D. from KIIT Deemed to be University in 2010, 2012 and 2021 respectively. He has received Founder’s Gold Medal and Chancellor’s Gold Medal in M. Tech. He has 8 years teaching experience and 1 year industry experience. His favourite teaching subjects include big data, operating system, web technology, computer organization and database. His area of research includes data analytics, recommender system, data security and data mining. He has published more than 20 research papers in national and international conferences and journals. He guides undergraduate and post graduate students in different project. He has also published more than five book chapters in different reputed books. He is involved in different academic activities such as organizing committee member in international conferences, reviewers in international journals, keynote speaker in workshop and different accreditation activities. He has attended more than thirty different programs such as a faculty development program, seminar and workshop in national and international level. He was Odisha State Student Coordinator in Computer Society of India during 2019-20. He has achieved CSI Young IT Professional award in 2013 and Best Faculty award for good academic performance in 2013 and 2014. He is the life member of CSI, IAENG, CSTA and IET. Profile LinksEmail :[email protected]Website :sites.google.comScopus Id :56501598500Google Scholar :https://scholar.google.com/citations?user=xaOLqGMAAAAJ&hl=en&oi=ao Social LinksProfileRecent PublicationsProfileEducational QualificationM.Tech, Ph.DProjects\"AI Assistive Tooth Bracket Positioning System\", Dr. Bhagabati Dash and Dr. Abhaya Kumar Sahoo, Department of Science & technology-Nidhi Prayas Scheme (Approved). Administrative ResponsibilityTime Table Coordinator and subject Coordinator, FIC Time Table in SAP, Course Co-ordinator in Object Oriented Programming using JAVA Awards & Honours Best Faculty Award-2013 and Best Faculty Award -2014 for good academic performance in C.V. Raman College of Engineering. Keynote Speaker in National workshop on Parallel & Heterogeneous Computing-2014 in C.V. Raman College of Engineering. CSI Young IT Professional Award-2013 in Regional Round: Region-IV chapter. Founder's Gold Medal and Chancellor's Gold Medal-2012 in M.Tech from KIIT University. 21st position in 10th board examination in Orissa. Scholarship in 5th class and National Rural Talent Scholarship in 7th class.MembershipsIET, CSI and IAENGRecent PublicationsJournals/Conferences :1. Sahoo, A. K., Raj, S., Pradhan, C., Mishra, B.S.P., Barik, R.K. & Vidyarthi, A. (2021). Perturbation based Fuzzified k-Mode Clustering Method for Privacy Preserving Recommender System. International Journal of Information Security and Privacy, 16(1), 15 2. Raj, S., Sahoo, A. K., & Pradhan, C. (2020). Privacy Preserving in Collaborative Filtering Based Recommender System: A Systematic Literature Review. In Progress in Computing, Analytics and Networking (pp. 513-522). Springer, Singapore. 3. Mallik, S., & Sahoo, A. K. (2020). A Comparison Study of Different Privacy Preserving Techniques in Collaborative Filtering Based Recommender System. In Computational Intelligence in Data Mining (pp. 193- 203). Springer, Singapore. 4. Sarkar, A., Sahoo, A. K., Sah, S., & Pradhan, C. (2020, March). LSTMSA: A Novel Approach for Stock Market Prediction Using LSTM and Sentiment Analysis. In 2020 International Conference on Computer Science, Engineering and Applications (ICCSEA) (pp. 1-6). IEEE. 5. Panigrahi, K. P., Sahoo, A. K., & Das, H. (2020, June). A CNN Approach for Corn Leaves Disease Detection to support Digital Agricultural System. In 2020 4th International Conference on Trends in Electronics and Informatics (ICOEI) (48184) (pp. 678-683). IEEE. 6. Panigrahi, K. P., Das, H., Sahoo, A. K., & Moharana, S. C. (2020). Maize Leaf Disease Detection and Classification Using Machine Learning Algorithms. In Progress in Computing, Analytics and Networking (pp. 659-669). Springer, Singapore. 7. Sahoo, A. K., Pradhan, C., & Das, H. (2020). Performance evaluation of different machine learning methods and deep-learning based convolutional neural network for health decision making. In Nature Inspired Computing for Data Science (pp. 201-212). Springer, Cham. 8. Sahoo, A. K., Pradhan, C., Barik, R. K., & Dubey, H. (2019). DeepReco: Deep Learning Based Health Recommender System Using Collaborative Filtering. Computation, 7(2), 25. 9. Sahoo, A. K., Pradhan, C., & Bhattacharyya, S. (2019). Privacy towards GIS Based Intelligent Tourism Recommender System in Big Data Analytics. Hybrid Computational Intelligence: Research and Applications, 81. 10. Sahoo, A. K., Pradhan, C., & Mishra, B. S. P. (2019, April). SVD based privacy preserving recommendation model using optimized hybrid item-based collaborative filtering. In 2019 international conference on communication and signal processing (ICCSP) (pp. 0294-0298). IEEE. 11. Sahoo, A. K., Mallik, S., Pradhan, C., Mishra, B. S. P., Barik, R. K., & Das, H. (2019). Intelligence-based health recommendation system using big data analytics. In Big data analytics for intelligent healthcare management (pp. 227-246). Academic Press. 12. Mallik, R., & Sahoo, A. K. (2019). A Novel Approach to Spam Filtering Using Semantic Based Naive Bayesian Classifier in Text Analytics. In Emerging Technologies in Data Mining and Information Security (pp. 301-309). Springer, Singapore. 13. Mishra, B. K., Sahoo, A. K., & Pradhan, C. (2018). GPU based reduce approach for computing faculty performance evaluation process using classification technique in opinion mining. International Journal of Data Analysis Techniques and Strategies, 10(3), 208-222. 14. Mishra, B. K., Sahoo, A. K., & Misra, R. (2018). Recommendation for Selecting Smart Village in India Through Opinion Mining Using Big Data Analytics. In ICT Based Innovations (pp. 105-112). Springer, Singapore. 15. Behera, R. K., Sahoo, A. K., & Jena, A. (2017). A Resourceful Approach in Security Testing to Protect Electronic Payment System Against Unforeseen Attack. International Journal of Open Source Software and Processes (IJOSSP), 8(3), 24-48. 16. Behera, R. K., Sahoo, A. K., & Pradhan, C. (2017, December). Big Data Analytics in Real Time-Technical Challenges and its Solutions. In 2017 International Conference on Information Technology (ICIT) (pp. 30- 35). IEEE. 17. Sahoo, A. K., Kumar, G., Mishra, G., & Misra, R. (2015, November). A new approach for parallel region growing algorithm in image segmentation using MATLAB on GPU architecture. In Computer Graphics, Vision and Information Security (CGVIS), 2015 IEEE International Conference on (pp. 279-283). IEEE. 18. Sahoo, A. K., Sarangi, S. S., & Misra, R. (2015, December). A comparison study among GPU and map reduce approach for searching operation on index file in database query processing. In Man and Machine Interfacing (MAMI), 2015 International Conference on (pp. 1-5). IEEE. 19. Tiwary, M., Sahoo, A. K., & Misra, R. (2014, December). Efficient implementation of apriori algorithm on HDFS using GPU. In High Performance Computing and Applications (ICHPCA), 2014 International Conference on (pp. 1-7). IEEE. 20. Sahoo, A. K., Sahoo, K. S., & Tiwary, M. (2014, October). Signature based malware detection for unstructured data in Hadoop. In Advances in Electronics, Computers and Communications (ICAECC), 2014 International Conference on (pp. 1-6). IEEE. 21. Sahoo, K. S., Sahoo, A. K., & Tiwary, M. (2014, October). GPU based Parsing and Searching of XML Document for Multimedia data using Map Reduce Approach”,IEEE National Conference on Electrical, Electronics, and Computer Engineering, Conference Proceedings published with ISBN 978-93-833-0383- 0,CALCON-2014 22. Sahoo, A. K., Das, A., & Tiwary, M. (2014, May). Firewall engine based on graphics processing unit. In Advanced Communication Control and Computing Technologies (ICACCCT), 2014 International Conference on (pp. 758-763). IEEE. 23. Sahoo, A. K., Das, A., & Tiwary, M. (2013, October). “Parallel Optimized Algorithm for Apriori Association Rule Mining on Graphics Processing Unit with Compute Unified Device Architecture (CUDA)” in International Journal of Advanced Research in Computer Science and Software Engineering(IJARCSSE),ISSN: 2277 128X )Volume 3, Issue 10, pg 1214-1219,October 2013 24. Das, A., Sahoo, A. K., & Tiwary, M. (2013, September). “A proposed model for mapping infrastructure as a service in cloud computing with hardware firewall for distributed security environment” in International Journal of Computer Engineering and Technology (IJCET), (ISSN 0976-6367) vol-4, Issue-5, pg 49-54, September-October(2013) 25. Sahoo, A. K., (2013, July). “Advanced density based clustering algorithm for spatial database system\" in International Journal of Computer Science and Mobile Computing (IJCSMC), (ISSN2320-088x )vol-2, Issue- 7, pg 41-47, July 2013 patents:- \"•\t“INTELLIGENT ROBOTIC MECHANISM TO AUTOMATE SWAB TEST TO DETECT COVID-19 DISEASE”, Office of the Controller General of Patents, Design& Trade Marks, Government of India •\t“SENSOR BASED ARTIFICIAL NERVOUS SYSTEM TO ASSIST PARALYZED PEOPLE”, Office of the Controller General of Patents, Design& Trade Marks, Government of India \"\"CAC OPTIMIZER: DEEP OPTIMIZATION BASED MULTI CRITERIA RECOMMENDER SYSTEM\"\"- Office of the Controller General of Patents, Design& Trade Marks, Government of India \" Books : 1. C.R. Pradhan, A.K. Sahoo, “Essentials of Database System”, LAMBERT Academic Publishing, ISBN:978- 613-9-86183-5 , 2018 Book Chapter Publi",
  "content_length": 12404,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:35"
}