{
  "name": "Abhishek Gupta 0004",
  "homepage": "https://abhishekunique.github.io",
  "status": "success",
  "content": "Redirecting to https://homes.cs.washington.edu/~abhgupta/ Abhishek Gupta Abhishek Gupta I am an assistant professor in computer science and engineering at the Paul G. Allen School at the University of Washington. Previously, I was a post-doctoral scholar at MIT, collaborating with Russ Tedrake and Pulkit Agarwal. I spent 6 wonderful years completing my PhD in machine learning and robotics at BAIR at UC Berkeley, where I was advised by Professor Sergey Levine and Professor Pieter Abbeel. In a previous life, I completed my bachelors degree also at UC Berkeley. My main research goal is to develop algorithms which enable robotic systems to learn how to perform complex tasks in a variety of unstructured environments like offices and homes. To that end, I work towards building deep reinforcement learning algorithms that can learn in the real world. Recently, I have been specifically focusing on the problems of reward specification, continual real world data collection and learning, offline reinforcement learning for robotics, multi-task and meta-learning and dexterous manipulation with robotic hands Email  / CV  / GitHub / Google Scholar  / Ph.D. Thesis Workshop Papers and Pre-prints Ecological Reinforcement Learning John D Co-Reyes, Suvansh Sanjeev, Glen Berseth, Abhishek Gupta, Sergey Levine arXiv Preprint paper Unsupervised meta-learning for reinforcement learning Abhishek Gupta*, Benjamin Eysenbach*, Chelsea Finn, Sergey Levine arXiv preprint, best paper at LLARLA workshop at ICML 2018 paper / blog Accelerating online reinforcement learning with offline datasets Ashvin Nair*, Abhishek Gupta*, Murtaza Dalal, Sergey Levine arXiv preprint paper Learning latent state representation for speeding up exploration Giulia Vezzani, Abhishek Gupta, Lorenzo Natale, Pieter Abbeel arXiv preprint paper Publications Persistent Reinforcement Learning via Subgoal CurriculaArchit Sharma, Abhishek Gupta, Sergey Levine, Karol Hausman, Chelsea Finn NeurIPS 2021 paper Adaptive risk minimization: A meta-learning approach for tackling group shift Marvin Zhang, Henrik Marklund, Nikita Dhawan, Abhishek Gupta, Sergey Levine, Chelsea Finn NeurIPS 2021 paper / blog Which Mutual-Information Representation Learning Objectives are Sufficient for Control? Kate Rakelly, Abhishek Gupta, Carlos Florensa, Sergey Levine NeurIPS 2021 paper Fully Autonomous Real-World Reinforcement Learning for Mobile ManipulationCharles Sun, Jedrzej Orbik, Coline Devin, Brian Yang, Abhishek Gupta, Glen Berseth, Sergey Levine CoRL 2021 paper MURAL: Meta-Learning Uncertainty-Aware Rewards for Outcome-Driven Reinforcement LearningKevin Li*, Abhishek Gupta*, Ashwin D Reddy, Vitchyr Pong, Aurick Zhou, Justin Yu, Sergey Levine ICML 2021 paper / website Reset-Free Reinforcement Learning via Multi-Task Learning: Learning Dexterous Manipulation Behaviors without Human InterventionAbhishek Gupta*, Justin Yu*, Tony Z. Zhao*, Vikash Kumar*, Aaron Rovinsky, Kelvin Xu, Thomas Devlin, Sergey Levine ICRA 2021 paper / website ROBEL: RObotics BEnchmarks for Learning with low-cost robots Michael Ahn, Henry Zhu, Kristian Hartikainen, Hugo Ponte, Abhishek Gupta, Sergey Levine, Vikash Kumar CoRL 2019 paper / blog The ingredients of real-world robotic reinforcement learning Henry Zhu*, Justin Yu*, Abhishek Gupta*, Dhruv Shah, Kristian Hartikainen, Avi Singh, Vikash Kumar, Sergey Levine ICLR 2020 (spotlight) paper / blog Discor: Corrective feedback in reinforcement learning via distribution correction Aviral Kumar, Abhishek Gupta, Sergey Levine NeurIPS 2020 (spotlight) paper / blo Gradient surgery for multi-task learning Tianhe Yu, Saurabh Kumar, Abhishek Gupta, Sergey Levine, Karol Hausman, Chelsea Finn NeurIPS 2020 paper Learning to reach goals via iterated supervised learning Dibya Ghosh*, Abhishek Gupta*, Ashwin Reddy, Justin Fu, Coline Devin, Benjamin Eysenbach, Sergey Levine ICLR 2021 (Oral) paper / blog Unsupervised curricula for visual meta-reinforcement learning Allan Jabri, Kyle Hsu, Benjamin Eysenbach, Abhishek Gupta, Alexei Efros, Sergey Levine, Chelsea Finn NeurIPS 2019 (spotlight) paper Relay policy learning: Solving long-horizon tasks via imitation and reinforcement learning Abhishek Gupta, Vikash Kumar, Corey Lynch, Sergey Levine, Karol Hausman CORL 2019 paper / website Guided meta-policy search Russell Mendonca, Abhishek Gupta, Rosen Kralev, Pieter Abbeel, Sergey Levine, Chelsea Finn NeurIPS 2019 (spotlight) paper Dexterous Manipulation with Deep Reinforcement Learning: Efficient, General, and Low-Cost Henry Zhu*, Abhishek Gupta*, Aravind Rajeswaran, Sergey Levine, Vikash Kumar ICRA 2019 paper / blog Guiding policies with language via meta-learning John D Co-Reyes, Abhishek Gupta, Suvansh Sanjeev, Nick Altieri, John DeNero, Pieter Abbeel, Sergey Levine ICLR 2019 paper Learning actionable representations with goal-conditioned policies Dibya Ghosh, Abhishek Gupta, Sergey Levine ICLR 2019 paper Automatically composing representation transformations as a means for generalization Michael B. Chang, Abhishek Gupta, Sergey Levine, Thomas Griffith ICLR 2019 paper Self-consistent trajectory autoencoder: Hierarchical reinforcement learning with trajectory embeddings John D Co-Reyes*, YuXuan Liu*, Abhishek Gupta*, Benjamin Eysenbach, Pieter Abbeel, Sergey Levine ICML 2018 paper Imitation from observation: Learning to imitate behaviors from raw video via context translation YuXuan Liu*, Abhishek Gupta*, Pieter Abbeel, Sergey Levine ICRA 2018 paper / video Meta-reinforcement learning of structured exploration strategies Abhishek Gupta, Russell Mendonca, YuXuan Liu, Pieter Abbeel, Sergey Levine NeurIPS 2018 (spotlight) paper / code Diversity is all you need: Learning skills without a reward function Benjamin Eysenbach, Abhishek Gupta, Julian Ibarz, Sergey Levine ICLR 2019 paper / video Learning complex dexterous manipulation with deep reinforcement learning and demonstrations Aravind Rajeswaran*, Vikash Kumar*, Abhishek Gupta, Giulia Vezzanni, John Schulman, Emanuel Todorov, Sergey Levine RSS 2018 paper / video Learning modular neural network policies for multi-task and multi-robot transfer Abhishek Gupta*, Coline Devin*, Trevor Darrell, Pieter Abbeel, Sergey Levine ICRA 2017 paper / video Learning invariant feature spaces to transfer skills with reinforcement learning Abhishek Gupta*, Coline Devin*, Yuxuan Liu, Pieter Abbeel, Sergey Levine ICLR 2017 paper / video Learning dexterous manipulation for a soft robotic hand from human demonstrations Abhishek Gupta, Clemens Eppner, Sergey Levine, Pieter Abbeel IROS 2016 paper / video Guided search for task and motion plans using learned heuristics Rohan Chitnis, Dylan Hadfield-Menell, Abhishek Gupta, Siddhart Srivastava, Edward Groshev, Christopher Lin, Pieter Abbeel ICRA 2016 paper / video Learning from multiple demonstrations using trajectory-aware non-rigid registration with applications to deformable object manipulation Alex Lee, Abhishek Gupta, Henry Lu, Sergey Levine, Pieter Abbeel IROS 2015 paper Learning force-based manipulation of deformable objects from multiple demonstrations Alex X. Lee, Henry Lu, Abhishek Gupta, Sergey Levine, Pieter Abbeel ICRA 2015 paper Tractability of planning with loops Siddharth Srivastava, Shlomo Zilberstein, Abhishek Gupta, Pieter Abbeel, Stuart Russell AAAI 2015 paper / video Website template from Jon Barron. Last updated January 2021.",
  "content_length": 7377,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:37"
}