{
  "name": "Abhijnan Chakraborty",
  "homepage": "https://cse.iitkgp.ac.in/~abhijnan",
  "status": "success",
  "content": "Dr. Abhijnan Chakraborty | Assistant Professor at IIT Kharagpur About Me I am an Assistant Professor in the Department of Computer Science and Engineering at Indian Institute of Technology (IIT) Kharagpur. Earlier, I was an Assistant Professor at IIT Delhi in the Department of Computer Science and was also associated with the School of Artificial Intelligence. In 2022, I was inducted as a Young Associate of the Indian National Academy of Engineering (INAE). Before IIT Delhi, I have worked for 2.5 years at the Max Planck Institute for Software Systems (MPI-SWS) as a post-doctoral researcher. I obtained my PhD from IIT Kharagpur, where I was jointly advised by Prof. Niloy Ganguly from IIT Kharagpur and Prof. Krishna Gummadi from MPI-SWS. During PhD, I was awarded the prestigious Prime Minister's Fellowship for Doctoral Research and Google India PhD Fellowship. I have also worked at Microsoft Research for two years. Research Interests My research interests span the research areas of Responsible Artificial Intelligence, Fairness in Algorithmic Decision Making, Social Computing, and AI for Social Good. The problems I study usually have two distinct aspects: an algorithmic aspect and a societal aspect. A common thread in my research lies in collecting and analyzing large scale data from online systems to understand whether there is any cause for concern, and then develop mechanisms to eliminate or reduce the impact. My research agenda is inherently interdisciplinary, and therefore, the tools and theories that I often use in my works come from machine learning, network science, media studies, computational social choice, social welfare and behavioral economics. Students I am fortunate to advise the following amazing students. PhD: Garima Chhikara, Anju Bhuiya, Avishek Mukhopadhyay, Snehasish Samanta. MS: Pratik Gujral, Himali Bajaj. Past Students Daman Deep Singh | Hyperbots Inc., Bangalore. Mohit Sharma | Government of National Capital Territory of Delhi. Ramanuj Bhattacharjee | Techno India University, Kolkata. Media Coverage Fair Food Delivery: Times of India | Deccan Herald | Indian Express | Economic Times | Edex Live Bias in Predictive Tools: Times of India Clickbait: The Hindu Internship Opportunities Presently, there is no provision for any short-term summer or winter internships in my group. Please don't email me seeking internship or short-term research opportunities. I won't be able to respond to your emails. Employment IIT Kharagpur Assistant Professor, 2024 - Present IIT Delhi Assistant Professor, 2020 - 2024 Max Planck Institute for Software Systems Postdoctoral Researcher, 2018 - 2020 Microsoft Research Reasearch Fellow, 2012 - 2014 Awards IEI Young Engineer Award 2022-23 INAE Young Engineer Award 2022 Best Poster, ECIR 2019 Qualcomm Innovation Fellowship Finalist, 2018 Best Student Paper, ASONAM 2016 Prime Minister's Fellowship for Doctoral Research, 2015 - 2018 Google India PhD Fellowship for Social Computing, 2014 - 2018 Education Ph.D.   IIT Kharagpur 2014 - 2018 M.Tech.   IIT Kharagpur 2010 - 2012 B.E.   Jadavpur University 2005 - 2009",
  "content_length": 3104,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:34"
}