{
  "name": "Abhijit Das 0004",
  "homepage": "http://cse.iitkgp.ac.in/~abhij",
  "status": "success",
  "content": "Dr. Abhijit Das Dr. Abhijit Das Professor Computer Science & Engineering Indian Institute of Technology Kharagpur 721 302, India Office Room No 115, CSE building Phone: +91-3222-282350 Residence Quarter: B-217 (Kajubagan area) Phone: +91-3222-282351 Fax: +91-3222-278985 (CSE) Start  |  Background  |  Teaching  |  Research  |  Project  |  Personal  |  Miscellaneous  |  Short Bio Welcome to the home page of Dr. Abhijit Das. Click on the above links to know more. Book on Computational Number Theory Book on Public-key Cryptography Elementary crypto slides | Beamer version Slides on Algebraic Curves | Handout version Slides on Elliptic-Curve Cryptography Slides on Function Field Sieve (FFS) Slides on Identity-Based Cryptography | Handout version Slides on History of Computer Science and Engineering My Institute Profile Teaching Current Semester (Autumn 2025) Theory : CS31003 Compilers Lab : CS39003 Compilers Laboratory Previous Semester (Spring 2025) Theory 1 : CS10003 Programming and Data Structures Theory 2 : CS31202 Operating Systems Lab : CS39002 Operating Systems Laboratory All courses taught Research interests Cryptography Number-theoretic and Algebraic Computations Parallel and Efficient Implementation Computers and Indian Languages Publications Book on Computational Number Theory Book on Public-key Cryptography Research students Sponsored/Consultancy projects Investigation of Cryptanalytic Techniques (ICT), Headquarters, Integrated Defence Staff, Ministry of Defence, Government of India. Principal investigator. Design and Analysis of an Efficient Cryptosystem for Safety Messaging over Vehicular Networks (CRLP), General Motors (R&D), India. Co-principal investigator. Design and Efficient Implementation of Advanced Encryption and Decryption Techniques for Use in Spacecraft Communication (EEC), ISRO, IIT Kharagpur Cell, Space Technology Cell, India. Principal investigator. Cryptanalysis of Cryptographic Ciphers with Emphasis on AES and RSA (CER), Ministry of Electronics and Information Technology, Government of India. Co-principal investigator. Personal links Photos and movies IITKGP photographs (2003 – 2006) IITK photographs (2002) Photos from Germany (2000 – 2001) FujiFilm FinePix S9600 photographs 2007: Oct, Nov, Dec. 2008: Jan, Feb, Mar, Apr, Jun, Jul, Aug, Sep, Oct, Dec. Kodak C330 photographs 2006: Dec. 2007: Jan, Feb, Mar, Apr, May, Jun, Jul, Aug, Sep, Oct, Nov. Cellphone photos 2008: Jun, Jul. Travel photos Chandipur Galudih Paris Mukutmonipur Gopalpur Ajodhya Hills Bangkok and Cambodia Gopegarh Tikarpada Bhasraghat Kolaghat DM's marriage, Maithon and Garhpanchkot Manali and Ladakh Jaipur Daringibadi Kuldiha, Jorachua, Chandipur Simlipal Haldia and Digha (InfoSecHiComNet 2011) Japan (CHES 2011) Mandarmani Bhasraghat Tajpur Maldah: Album 1, Album 2 Spain (SCC 2012): Album 1, Album 2, Album 3, Album 4, Album 5, Album 6 Assam (ICISS 2012) and Meghalay: Guwahati1, Guwahati2, Shillong, DBCIC, Cherrapunji, Mawlynnong Hatibari Cochin and Munnar Bhasraghat Mukutmanipur: Album 1, Album 2, Album 3 Egypt: AfricaCrypt 2013, Cairo, Alexandria, Luxor, Karnak Geology Museum, ISI Calcutta Murshidabad: Album 1, Album 2 Durgapur, Joydev Kenduli Bangriposi Rajgir, Nalanda, Pawapuri, Gaya, Bodhgaya Pune (SPACE 2014, Lonavla, Khandala, Sinhgad, Khadakwasla) Goa ICMC 2015, Geonkhali, Mahishadal Manipur Dooars: Gorumara, Jaldapara Bhitarkanika Gangani (CSE Department Picnic) Baranti Reservoir Gujarat: Bhuj, Dholavira, Archeological Museum, Wild life Events Silver jubilee celebration Research Promotion Workshop 2008 IndoCrypt 2008, December 14–17, 2008 First Research Scholar Day, Feb 06, 2010 Peer Review Meeting, Nov 19, 2010 Third Research Scholar Day, Mar 17, 2012 Fourth Research Scholar Day, Mar 23,2013 IITKGP Hunger Strike, July 17, 2013 Lunch at Flame and Grill, Mani Square, Calcutta, December 04, 2013 Fifth Research Scholar Day, Mar 09, 2014 Sixth Research Scholar Day, Mar 15, 2015 Seventh Research Scholar Day, Mar 20, 2016 Videos: Youtube, Facebook Technical Software and documents Art Literary work (In Bengali) Music page Miscellaneous information Web-pages: cse | IITK | Geocities Other activities: Department webpage | Web-server login | Faculty advisor (MS/PhD) | Faculty advisor (03UG) | Research Scholars Day Check e-mail: IITKGP mail | Google | Yahoo Social networking sites: facebook | flickr | youtube LaTeX style files for IITKGP question-paper cover On COVID-19 Education PhD: Computer Science and Engineering, Indian Institute of Science, Bangalore, 2000. [Thesis] ME: Computer Science and Engineering, Indian Institute of Science, Bangalore, 1993. [Thesis] BE: Department of Electronics and Tele-Communication Engineering, Jadavpur University, Calcutta, 1991. Experience Professor, Departmet of Computer Science and Engineering, Indian Institute of Technology Kharagpur, 28-Feb-2018 to Present. Associate Professor, Departmet of Computer Science and Engineering, Indian Institute of Technology Kharagpur, 24-May-2011 to 28-Feb-2018. Assistant Professor, Departmet of Computer Science and Engineering, Indian Institute of Technology Kharagpur, 30-Dec-2002 to 24-May-2011. Visiting Faculty, Department of Mathematics and Statistics, Indian Institute of Techonolgy Kanpur, Dec 2001 to Dec 2002. Scientific Assistant (Wissenschaftliche Hilfskraft), Faculty of Mathematics, Ruhr-Universität Bochum, Germany, Oct 2000 to Oct 2001. Project Associate, Department of Computer Science and Automation, Indian Institute of Science, Bangalore, Jan 2000 to Sep 2000. Short Biography Abhijit Das got his BE degree in Electronics and Telecommunication Engineering from Jadavpur University, Calcutta, in 1991, ME and PhD degrees from the Indian Institute of Science Bangalore in Computer Science and Engineering in 1993 and 2000, respectively. Dr. Das has spent a year in the Department of Mathematics, Ruhr-Universität Bochum, Germany as a Scientific Assistant, and a year as a Visiting Faculty member in the Department of Mathematics, Indian Institute of Technology Kanpur. Since 2002, he has been a permanent faculty member in the Department of Computer Science and Engineering, Indian Institute of Technology Kharagpur. Currently, he is a Professor (since February 2018). During his stay in IIT Kharagpur, Dr. Das has taught several courses in undergraduate and graduate levels. His academic and teaching interests are in the areas of algorithms, discrete mathematics, computational number theory, cryptography, formal languages and automata theory, complexity theory, graph theory, and parallel algorithms. The main research interest of Dr. Das is computational number theory with applications to public-key cryptography and public-key cryptanalysis. He is also interested in efficient and parallel implementations of algorithms of interest in computational number theory and public-key cryptology. Some specific research areas of Dr. Das are algorithms for integer factorization and the discrete logarithm problem, elliptic-curve and pairing-based cryptography, cryptographic protocols in mobile and ad hoc networks, algebraic attacks, and massively parallel implementations of cryptographic and cryptanalytic algorithms. Dr. Das has more than 30 publications in refereed journals and conferences. He is the (co)author of two graduate-level textbooks on public-key cryptography and computational number theory. Page last updated on December 15, 2024",
  "content_length": 7417,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:35"
}