{
  "name": "Abhinav Kumar Singh",
  "homepage": "https://www.ecs.soton.ac.uk/people/aks1a19",
  "status": "success",
  "content": "Doctor Abhinav Kumar Singh | University of Southampton Skip to main content Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Subjects PhDs and research degrees Create your own research project Find a PhD project Funding your research degree How to apply for a PhD or research degree How to make a PhD enquiry Support while studying your PhD or research degree Exchanges and studying abroad Undergraduate study Undergraduate degree courses Foundation year programmes Undergraduate tuition fees Customise your degree Funding undergraduate studies How to apply Application advice and resources - Tuition fees, funding and scholarships - - Short courses - - Lunchtime evening and weekend courses - - Clearing - - Summer schools - - Get a prospectus Student life Accommodation Choose your halls of residence Your accommodation options Apply for accommodation Our accommodation guarantee Fees and contracts Our cities Southampton Winchester Malaysia Sports and gyms Sports facilities Sports clubs Watersports centres Our campuses Avenue Campus Boldrewood Innovation Campus City Centre Campus Highfield Campus University Hospital Southampton Waterfront Campus Winchester Campus Join our student community What's on Clubs and societies Sports teams SUSU places Representing you SUSU support and advice Support and money Living costs Academic and mental health support Inclusion and respectful behaviour policy Support for disabled students Part-time work Health services Research Our impact Research projects Research areas Research facilities Collaborate with us Institutes, centres and groups Support for researchers Faculties, schools and departments Interdisciplinary research Find people and expertise - Research jobs Business Develop your organisation Access start-up support Invest in our start-ups Become a research partner License our technology Knowledge Transfer Partnerships Hire our facilities Academic consultants Specialist consultancies Research studentships Develop your workforce Continuing professional development Set up a staff secondment Host a placement student Collaborate on a short term student project Advertise graduate jobs and internships Become a supplier - - Find people and expertise Global International students Visiting delegations University of Southampton Delhi International Office Visiting fellowships University of Southampton Malaysia - Partnerships and initiatives Online master's degrees View all staff Dr Abhinav Kumar Singh BTech, PhD, MIEEE, AFHEA Lecturer in Electrical/Electronic Pwr Sy Research interests Power system dynamics Power system estimation and control Large-scale integration of renewables More research Accepting applications from PhD students. Connect with Abhinav Kumar Email: A.K.Singh@soton.ac.uk Tel: +44 23 8059 2025 Google Scholar ORCID On this page About Research Publications Teaching External roles and responsibilities Biography About Research Publications Teaching External roles and responsibilities Biography About Dr. Abhinav Kumar Singh received his Bachelor’s degree in Aug 2010 from Indian Institute of Technology (IIT), New Delhi, India, and Ph.D. degree in Jan 2015 from Imperial College London, U.K., both in Electrical Engineering. He has been a Lecturer of Power Systems at the School of Electronics and Computer Science, University of Southampton, since April 2019. Prior to joining Southampton, he was a Lecturer at University of Lincoln from Aug 2017 to Mar 2019, and a Research Associate at Imperial College London from Jan 2015 to July 2017. He currently also serves as Editor of IEEE Transactions on Power Systems and Journal of Modern Power Systems and Clean Energy. His research interests lie in real-time estimation and control of future energy networks, a multi-disciplinary area involving the fields of power systems, sustainable energy, control systems, signal processing and communication. The motivation behind his research lies in the fact that traditional technologies for protection and control of energy systems need to be upgraded to manage newer complexities arising because of increased integration of renewable sources of energy - and the identification or estimation of current operating states of the system in real-time is a necessary requirement for that. His key research contribution towards this requirement is in proposing a new approach for achieving decentralization in estimation and control of power systems which bypasses the unrealistic assumption of having a rigorous communication network for data transmission in power systems and facilitates real-time estimation and control. His current research deals with dynamic estimation based nonlinear control of power system dynamics, and modelling and dynamic estimation and control of renewable generation. His research findings during PhD were selected for the EPSRC Doctoral Prize Fellowship. He has developed and validated a 68-bus power system model as part of IEEE PES Task Force on Benchmark systems for small signal stability analysis and control, which now serves as a standard for researchers to validate their innovations in stability analysis and control design. He was also a member of IEEE PES Task Force on Dynamic State and Parameter Estimation, which standardized definitions and methods of dynamic estimation and demonstrate its applicability. Within this taskforce, he led a subtask aimed at demonstrating the value of dynamic estimation in real-time power system monitoring and control. His contributions to these task-forces have been recognised through the IEEE PES Working Group Recognition Awards, awarded in 2016 and 2022, respectively. He is currently a member of IEEE PES Task Force on Standard Test Cases for Power Systems State Estimation, wherein he is leading the development of the DSE test case for 68-bus benchmark system. Research projects: PI on a National Grid project, ‘Economic Ageing of Transformers’, NIA_NGTO038: £480K, Oct 2019-Jun 2021. Co-I on a UK-China EPSRC-NSFC project, ‘Resilient Operation of Sustainable Energy Systems’, EP/T021713/1: £780K, Jul 2020-Jun 2023. Research Research groups Member of: Electrical Power Engineering Tony Davies High Voltage Laboratory Research interests Power system dynamics Power system estimation and control Large-scale integration of renewables Power system modelling Modelling of renewable generation Research projects Completed projects Resilient Operation of Sustainable Energy Systems (ROSES) Researchers: Doctor Abhinav Kumar Singh Sponsor: EPSRC Publications Review on distribution system state estimation considering renewable energy sources Hanshan Qing, Abhinav Kumar Singh & Efstratios Batzelis, 2025, Energies, 18(10) DOI: 10.3390/en18102524 Type: article Boundary analysis of damping methods for virtual synchronous generators Xi Luo, Yadala Pavan Kumar, Abhinav Kumar Singh, Efstratios I. Batzelis, Georgia Saridaki, Panos Kotsampopoulos & Nikos Hatziargyriou, 2025 Type: conference Seamless transition between grid forming and grid following inverters based on online grid impedance estimation Yadala Pavan Kumar, Xi Luo, Stratis Batzelis, Abhinav Kumar Singh, Georgia Saridaki, Panos Kotsampopoulos & Nikos Hatziargyriou, 2025 Type: conference Load profiling using grey relational analysis for power system state estimation Hanshan Qing, Abhinav Kumar Singh & Efstratios Batzelis, 2025 DOI: 10.1109/ISGTEUROPE62998.2024.10863421 Type: conference MIMO impedance modelling of grid following inverter with local voltage control Georgia Saridaki, Panos Kotsampopoulos, Nikos Hatziargyriou, Xi Luo, Efstratios Batzelis & Abhinav Singh, 2025 DOI: 10.1049/icp.2024.4643 Type: conference Stability boundary analysis of grid-forming and grid-following inverters Xi Luo, Efstratios Batzelis, Abhinav Singh, Georgia Saridaki & Panos Kotsampopoulos, 2024 DOI: 10.1049/icp.2024.4667 Type: conference Impact of backlash nonlinearity on the dynamics of type-3 turbine-based windfarms Abdul Saleem Mir, Abhinav Kumar Singh, Bikash C. Pal & Nilanjan Senroy, 2023, IEEE Transactions on Power Systems DOI: 10.1109/TPWRS.2023.3330604 Type: article Electrical vehicle load modelling for distribution system considering future scenarios Hanshan Qing, Abhinav Kumar Singh & Stratis Batzelis, 2023 DOI: 10.1109/PESGM52003.2023.10252652 Type: conference Modeling of DC-Side Dynamics in PV/Battery Grid-forming Inverter Systems Xi Luo, Stratis Batzelis & Abhinav Kumar Singh, 2023 DOI: 10.1109/PESGM52003.2023.10253207 Type: conference Decentralized dynamic state estimation of transmission lines using local measurements Ankur Srivastava, Abhinav Kumar Singh, Le Anh-Tuan, David Steen & Abdul Saleem Mir, 2023, IEEE Access, 11, 78237-78250 DOI: 10.1109/ACCESS.2023.3298206 Type: article Teaching Current modules: ELEC6261 - Power System Dynamics, Stability and Control ELEC3213 - Power Systems Engineering ELEC6222 - Power Distribution: Design, Operation and Protection ELEC6226 - Power Electronics for DC Transmission MATH2047 - Mathematics for Electronics & Electrical Engineering Part II Past modules (at University of Lincoln): Power Electronics Electrical Machine Design External roles and responsibilities Name: IEEE Transactions on Power Systems (Journal) Role: Reviewer Year: 2019 - Name: Journal of Modern Power Systems and Clean Energy (Journal) Role: Reviewer Year: 2020 - Biography Prizes EPSRC Doctoral Prize (2015) 2021 Best Paper Award (2022) IEEE PES Working Group Recognition Award (2016) IEEE PES Working Group Recognition Award (2022) The President’s Award for Outstanding Research Team (2016) EPSRC Doctoral Prize (2015) 2021 Best Paper Award (2022) IEEE PES Working Group Recognition Award (2016) IEEE PES Working Group Recognition Award (2022",
  "content_length": 31173,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:38"
}