{
  "name": "Abhinav Shrivastava",
  "homepage": "http://abhinavsh.info",
  "status": "success",
  "content": "Abhinav Shrivastava's Academic Website Abhinav Shrivastava abhinav@cs.umd.edu cv / publications / bibtex google scholar / semantic scholar education / experience / teaching Abhinav Shrivastava abhinav@cs.umd.edu cv / publications / bibtex google scholar / semantic scholar education / experience / teaching Menu Home Research Resume Miscellaneous News / About Me tl;dr Associate Professor, University of Maryland, College Park Note to prospective students: We hire PhD students in computer vision, machine learning, and related fields every year. Find more about the graduate program here. If you are interested in working with me, mention my name in your research statement. News 09/23: One paper accepted at NeurIPS 2023. 08/23: One paper accepted at BMVC 2023. (details) 07/23: Six papers accepted at ICCV 2023 (including two Orals). (details) 02/23: Seven papers accepted at CVPR 2023 (details). 01/23: LilNetX accepted at ICLR 2023 (details). 01/23: COVID-VTS accepted at EACL 2023 (details). 12/22: We are organizing the 3rd Workshop on Visual Perception via Learning in an Open World, at CVPR 2023. 08/22: We are organizing the 2nd Workshop on Dealing with Novelty in Open Worlds (DNOW), at WACV 2023. 07/22: Four papers accepted at ECCV 2022 (details). 05/22: We are organizing workshop on Visual Perception and Learning in an Open World (VPLOW), the second workshop on Open World Vision at CVPR 2022, including the challenge on ObjClsDisc: In-the-Wild Object Discovery. 03/22: Five papers accepted at CVPR 2022 (details). 03/22: We are organizing a AAAI Spring Symposium 2022 on Designing Artificial Intelligence for Open Worlds. 12/21: One paper accepted at AAAI 2022 (details). 10/21: One paper accepted at WACV 2022 (details). 10/21: Three papers accepted at BMVC 2021 (details). 09/21: Two papers accepted at NeurIPS 2021 (details). 08/21: We are organizing workshop on Dealing with Novelty in Open Worlds (DNOW) at WACV 2022. 07/21: Five papers accepted at ICCV 2021 (details). 05/21: We are organizing workshop on Open World Vision at CVPR 2021, including the challenge on Open World Image Classification. 02/21: Seven papers accepted at CVPR 2021 (details). 02/21: One paper accepted at ICRA 2021. 01/21: One paper accepted at ICLR 2021. 10/20: Two papers accepted at 3DV 2020. 08/20: Serving as an Area Chair (SPC) for AAAI 2021. 07/20: Three papers accepted at ECCV 2020. 07/20: One paper accepted at ICIP 2020. 05/20: Serving as an Area Chair for WACV 2021. 02/20: PatchVAE accepted at CVPR 2020. 02/20: Kyungjun's paper won Best Paper Award (Applications) at WACV 2020! 01/20: Serving as an Area Chair for CVPR 2021. 12/19: One paper accepted at ICLR 2020. 11/19: Two papers accepted at AAAI 2020. 10/19: Two papers accepted at WACV 2020. 07/19: EvalNorm accepted at ICCV 2019. 02/19: One paper accepted at CVPR 2019. 08/18: Started as Assitant Professor at University of Maryland, College Park. 07/18: Two papers accepted at ECCV 2018. 07/18: Google AI blog post on Self-Supervised Tracking via Video Colorization. 05/18: Serving as an Area Chair for CVPR 2019. 02/18: Serving as an Area Chair for ECCV 2018. 08/17: Started as Visiting Research Scientist at Google. 08/17: Successfully defended my thesis & Graduated! 07/17: Google Research blog post on Revisiting the Unreasonable Effectiveness of Data 06/17: Accepted an Assistant Professor position at UMD (starting in Fall 2018). 06/17: Paper accepted at ICCV 2017: Revisiting Unreasonable Effectiveness of Data in Deep Learning Era (spotlight). 04/17: Serving as an Area Chair for CVPR 2018. 03/17: Paper accepted at CVPR 2017: A-Fast-RCNN: Hard Positive Generation via Adversary for Object Detection. 12/16: Our work on Top-down Modulation achieves state-of-the-art single model performance on COCO detection! 10/16: Our team stood 4th in the 2016 COCO object detection challenge (leaderboard, see Challenge2016), using the Priming and Feedback model from our ECCV paper (with some bells and whistles). It is the best VGG16 single-model entry, above a couple of ResNet entries! 08/16: Code released for OHEM. 07/16: Paper accepted at ECCV 2016: Contextual Priming and Feedback for Faster R-CNN. 03/16: Two papers accepted at CVPR 2016: Training Region-based Object Detectors with Online Hard Example Mining (oral), and Cross-stitch Networks for Multi-task Learning (spotlight). 03/16: A hackathon project during my internship at Microsoft Research is the basis of the 'Seeing AI' product. During my Masters, I worked on a similar project on Assistive Technologies using a first person vision device (read more). 12/15: Our team stood 4th in the 2015 MS COCO object detection challenge (leaderboard, see Challenge2015). Our entry used hard example mining to train Fast R-CNN (and added some bells and whistles). view more .. About me I am an Associate Professor in the Department of Computer Science at University of Maryland, College Park, with a joint appointment in the Institute of Advanced Computer Studies (UMIACS). Before joining Maryland, I spent 1 year as a Visiting Research Scientist at Google Research. In August 2017, I received my PhD in Robotics and Artificial Intelligence from the Robotics Institute, Carnegie Mellon University, where I was advised by Abhinav Gupta. My PhD thesis, Discovering and Leveraging Visual Structure for Large-scale Recognition, was supported by Microsoft Research PhD Fellowship for 2014-16. Before joining PhD, I received my Masters from the Robotics Institute, under the supervision of Alyosha Efros and Martial Hebert. Prior to that, I received my BTech in Computer Science and Engineering from JIIT (Noida, India). I have also enjoyed working with awesome researchers and engineers in industry, including internships at Google Research and Microsoft Research (details). CV / Education / Research Experience / Teaching Experience / Dept. & Community Service Download CV (pdf) Research Experience July, 2024 - present Associate Professor University of Maryland, College Park Joint appointments in Department of Computer Science and Institute of Advanced Computer Studies (UMIACS). August, 2018 - June, 2024 Assistant Professor University of Maryland, College Park Joint appointments in Department of Computer Science and Institute of Advanced Computer Studies (UMIACS). September, 2017 - August, 2018 Visiting Research Scientist - Google Research August, 2016 - July, 2017 Research Assistant - Google Research Working with Abhinav Gupta, Rahul Sukthankar, and Jitendra Malik on incorporating feedback in object detection models. Summer, 2015 Research Intern - Microsoft Research Worked with Ross Girshick and Larry Zitnick on object detection and semi-supervised learning. Summer, 2013 Research Intern - Google Research Worked with Mark Segal, Rahul Sukthankar and Thomas Leung on incorporating image geometry in deep neural networks. Summer, 2012 Research Intern -Microsoft Research Worked on large-scale indexing and nearest-neighbor search for high-dimensional data with Sanjeev Mehrotra and Jin Li. Fall, 2010 Research Associate III -- Robotics Institute, Carnegie Mellon University Continued Masters research on image matching and retrieval, real-time assistive systems, and object detection; and worked on large-scale semi-supervised learning algorithm. Education August, 2012 - August, 2017 PhD, Artificial Intelligence Robotics Institute, Carnegie Mellon University Working on discovering the underlying regularities, or structure, in our visual world and leveraging it in large-scale recognition algorithms and systems. This work spans a wide range of recognition tasks, and includes frequent collaborations with researchers from both academia and industry. Find my dissertation here. August, 2010 - December, 2011 M.S., Aritificial Intelligence Robotics Institute, Carnegie Mellon University Worked on data-driven visual similarity for image matching and retrieval, real-time assistive systems, and object detection. July, 2006 - May, 2010 BTech., Computer Science and Engineering Jaypee Institute of Information Technology Thesis on 'A Hypermedia-development Tool for Movie-based Comic-strip Rendering'. Teaching Experience Introduction to Deep Learning: CMSC428L, Spring 2019 Advanced Techniques in Visual Recognition and Learning: CMSC828I, Fall 2018 Teaching Assistant Experience Teaching Assistant, Geometry-based Methods in Vision, CMU; Spring 2013 Teaching Assistant, Data Structures, JIIT; 2008-09 Teaching Assistant, Microprocessors and Controllers, JIIT; 2008-09 Area Chair Conferences: ICCV'23, CVPR'23, CVPR'18, ECCV'18, CVPR'19, CVPR'21, AAAI'21, WACV'21 Reviewer Conferences: CVPR'12-17/20, NIPS'12-15, ECCV'12/14/16/20, ICCV'11/13/15/17/19, ACCV'12-16, SIGGRAPH'14, AAAI'15, 3DV'14-15 Journals: IJCV, TPAMI, CVIU, TKDE Department Services (Carnegie Mellon University) Master's Admissions Committee, Robotics Institute; 2015-16 Master's Thesis Committee: Shreyansh Daftry, Krishna Kumar Singh; 2014-17 Ph.D. Qualifier Committee: Aayush Bansal, Ishan Misra, Xiaolong Wang; 2015-17 Publications / Invited Papers and TRs Publications Refer to Google Scholar for recent publications, while I try to find time to update the website! 2023 Chop & Learn: Recognizing and Generating Object-State Compositions Nirat Saini*, Hanyu Wang*, Archana Swaminathan, Vinoj Jayasundara, Bo He, Kamal Gupta, Abhinav Shrivastava IEEE/CVF International Conference on Computer Vision (ICCV), 2023 new pdf / webpage / data MOST: Multiple Object Localization with Self-Supervised Transformers for Object Discovery Saketh Rambhatla, Ishan Misra, Rama Chellappa, Abhinav Shrivastava IEEE/CVF International Conference on Computer Vision (ICCV), 2023 new Oral Presentation pdf / webpage / poster / code SparseDet: Improving Sparsely Annotated Object Detection with Pseudo-positive Mining Saksham Suri*, Saketh Rambhatla*, Rama Chellappa, Abhinav Shrivastava IEEE/CVF International Conference on Computer Vision (ICCV), 2023 new pdf / webpage / poster / code SHACIRA: Scalable HAsh-gri",
  "content_length": 34268,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:38"
}