{
  "name": "Abhishek Jain 0002",
  "homepage": "https://www.cs.jhu.edu/faculty/abhishek-jain",
  "status": "success",
  "content": "Abhishek Jain - Department of Computer Science Contact 410-516-4276 abhishekjain@jhu.edu Location 315 Malone Hall Connect Google Scholar Website Research Areas Cryptography Computer security Privacy Blockchains Abhishek Jain, an associate professor of computer science, focuses on all aspects of cryptography, with a special interest in secure computation, proof systems, and program obfuscation. His other research interests include security and privacy, as well as related areas of theoretical computer science. He is also a member of the Data Science and AI Institute. In addition to his role as co-director of the Advanced Research in Cryptography group, Jain is a member of the Johns Hopkins University Information Security Institute and the Johns Hopkins Algorithms and Complexity group. He is also a 2020 recipient of an NSF CAREER Award and has received Best Paper Awards at Eurocrypt, the International Conference on the Theory and Applications of Cryptographic Techniques. His work is supported by the NSF, DARPA, a Johns Hopkins Catalyst Award, and various other sources. He received his PhD in 2012 from the University of California Los Angeles, where he was also the recipient of the Symantec Outstanding Graduate Student Award. Before joining the Johns Hopkins University, Jain was a postdoctoral researcher at the Massachusetts Institute of Technology and Boston University and was a consulting researcher at Microsoft Research New England. Related News View All News 2023 department and school awardees announced Categories Awards and Honors Department News Student Experience Outstanding students were honored at the annual Computer Science Awards Ceremony, and the 2023 Pistritto Fellow is announced. CS students among 2020 PURA recipients Categories Undergraduate Stories Awards and Honors Five computer science students have been selected for Provost Undergraduate Research Awards to pursue research of their choosing, guided by a Hopkins mentor. Abhishek Jain receives NSF CAREER Award Categories Awards and Honors The award will support his research on new methods to enable secure multi-party computation. Site Menu Close ﻿",
  "content_length": 2146,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:39"
}