{
  "name": "Abhishek Chandra",
  "homepage": "http://www-users.cs.umn.edu/~chandra",
  "status": "success",
  "content": "Abhishek Chandra's Homepage I am a Professor in the Department of Computer Science and Engineering at the University of Minnesota, Twin Cities. My research interests are in the areas of Operating Systems and Distributed Systems. I co-lead the Distributed Computing Systems Group in the department. My research focuses on resource management and performance in distributed systems, such as Clouds, Data centers, Edge computing, and Mobile platforms, with the goal of achieving reliability, scalability, sustainability, and manageability. Much of my focus in recent years has been on designing and optimizing systems for data-driven computing in the cloud and at the edge, especially for data generated at the edge of the network (near the users). This focus has involved research in geo-distributed data analytics, social and health analytics, and mobile and IoT data analytics. Currently, I am working on a number of projects related to these areas, investigating issues in data-intensive computing, edge computing, mobile and IoT systems, and social computing. I am currently serving as the Program Co-chair for ACM/IFIP Middleware 2026. Please consider submitting a paper here. I am also serving on the Steering Committees for IEEE IC2E (as Co-chair) and ACM HPDC conferences. In the past, I have served as the General Co-chair for ACM HPDC 2022, and the Program Co-chair for IEEE ICDCS 2021, IEEE IC2E 2018 and ACM HPDC 2018 conferences. I was also the TPC Vice chair for the Edge Computing Track for IEEE ICDCS 2020 and IEEE ICDCS 2018. Contact Office: Rm 4-209, Keller Hall Ph: (612) 626-1283 Fax: (612) 625-0572 Email: chandra AT umn DOT edu Note: Email is the best way to contact me as I check it frequently. Mailing Address: Department of Computer Science and Engineering University of Minnesota 4-192 Keller Hall, 200 Union St. SE Minneapolis, MN 55455 News September 2025: Our ASTRA paper with PhD student Nikhil Sreekumar as the first author won the Best Research Paper Award at IEEE IC2E 2025. July 2025: Our paper on Storage Carbon emissions presented at HotCarbon 2025. June 2025: PhD Student Nikhil Sreekumar presents a student poster on wearable energy management at SIGMETRICS 2025. May 2025: MS student Owen Ratgen passes his MS Plan B Exam. Congrats, Owen!! May 2025: Undergraduate student Kanishk Kacholia passes his Honors Thesis Exam. Congrats, Kanishk!! January 2025: MS student Daniel Frink passes his MS Plan B Exam. Congrats, Daniel!! December 2024: PhD student Joel Wolfrath passes his PhD thesis defense. Congrats, Joel!! December 2024: MS student Dorota Kopczyk passes her MS Plan B Exam. Congrats, Dorota!! November 2024: Prof. Chandra received a new gift award from Seagate to study storage systems for ML. Thanks Seagate! July 2024: Prof. Chandra received a new STTR grant from DoD. Thanks DoD! May 2024: Two papers from our group appear at CCGrid 2024. April 2024: Prof. Chandra's interview on Edge computing is published. August 2023: Our paper on Geo-distributed Join Approximation accepted to ACM SOCC'23. July 2023: Our SQuBA paper with PhD student Yixuan Wang as the first author won the Best Student Paper Award at IEEE Edge 2023. Congrats Yixuan! May 2023: Our AggFirstJoin paper with PhD student Dhruv Kumar as the first author won the Best Paper Award at CCGrid 2023. September 2022: We received a new research grant from Cisco to investigate the scalability of edge computing systems. Thanks, Cisco! September 2022: Our paper on Efficient Edge Sampling presented at IC2E'22. July 2022: Our paper on Elasticity in Heterogeneous Edge-dense Environments presented at ICDCS'22. June 2022: Prof. Chandra serves as General Co-Chair for ACM HPDC 2022 conference held in Minneapolis. June 2022: Our Network Cost-aware GDA paper published in IEEE TPDS journal. June 2022: Our paper on Heterogeneity-Aware Federated Learning presented at IPDPS'22. April 2022: Our paper on Distributed Join Sampling presented at EdgeSys'22. March 2022: PhD student Dhruv Kumar passes his PhD thesis defense. Congrats, Dhruv!! December 2021: Our Aggnet paper presented at ACM/IEEE SEC'21. July 2021: Prof. Chandra serves as Program Co-Chair for IEEE ICDCS 2021 conference. June 2021: Our DLion paper presented at ACM HPDC'21. April 2021: Our paper on Accelerated Federated Learning appears at EdgeSys'21.",
  "content_length": 4319,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:29"
}