{
  "name": "Abhi Shelat",
  "homepage": "https://shelat.khoury.northeastern.edu",
  "status": "success",
  "content": "I am a Professor at the Khoury College of Computer Sciences at Northeastern. My research area is computer security and cryptography. My work currently focuses on secure computation protocols, zero-knowledge protocols and verifiable computation. My email is abhi at neu.edu. Students Current members in my group are: LaKyah Tyner (started 2021) My former PhD students include Mona Sergi (2013, now at Google), Chih-hao Shen (2014, now at Google), Ben Kreuter (2018, now at Google), Yash Kondi (2022, postdoc at Aarhus, researcher at Silence labs), Jack Doerner (2022, postdoc at Technion and Brown, assistant professor at U. of Virginia), and Eysa Lee (2023, assistant professor at Barnard). Former post-doc and then research scientist Ran Cohen is now an assistant professor at IDC Herzliya. Recent talks “The modern anonymous credential”, Simons Institute at Berkeley, August 2025. I had so much fun giving this talk! 15m talk on anonymous credentials at Real World Crypto (RWC2025) So rushed, and so much to say. Research My research is supported by the National Science Foundation and several generous grants from companies like Microsoft, Google, Brave, and Meta. Guaranteed Output Delivery in O(sqrt(n)) rounds for Round Robin Sampling Protocols Ran Cohen, Jack Doerner, Yash Kondi, abhi shelat J. of Cryptology, 2025 Anonymous Credentials from ECDSA Matteo Frigo, abhi shelat eprint/2024/2010 Secure Multiparty Computation with Identifiable Abort from Vindicating Release Ran Cohen, Jack Doerner, Yash Kondi, abhi shelat CRYPTO'2024 Threshold ECDSA in Three Rounds Jack Doerner, Yash Kondi, Eysa Lee, abhi shelat Oakland S&P'2024 Threshold BBS+ Signatures for Distributed Anonymous Credential Issuance Jack Doerner, Yash Kondi, Eysa Lee, abhi shelat, LakYah Tyner Oakland'23 Improved Straighline Extraction in the ROM with Applications to Signature Aggregation Yash Kondi, abhi shelat Asiacrypt'22 Guaranteed Output Delivery in O(sqrt(n)) rounds for Round Robin Sampling Protocols Ran Cohen, Jack Doerner, Yash Kondi, abhi shelat Eurocrypt'22 Diogenes: Lightweight Scalable RSA Modulus Generation with a Dishonest Majority Carmit Hazay, Megan Chen, Yuval Ishai, Yuriy Kashnikov, Daniele Micciancio, Tarik Riviere, abhi shelat, Ruihan Wang, Muthu Venkitasubramaniam Oakland'2021 and eprint 2020/374 Multiparty Generation of an RSA Modulus Megan Chen, Ran Cohen, Jack Doerner, Yashvanth Kondi, Eysa Lee, Schuyler Rosefield, abhi shelat CRYPTO'2020 and eprint 2020/370 Going Beyond Dual Execution: MPC for Functions with Efficient Verification Carmit Hazay and abhi shelat and Muthu Venkitasubramaniam PKC'2020 and eprint 2020/139 Securely Sampling Biased Coins with Applications to Differential Privacy Jeffrey Champion and abhi shelat and Jonathan Ullman CCS'2019 and eprint 2019/823 Adaptively Secure MPC with Sublinear Communication Complexity Ran Cohen and abhi shelat and Daniel Wichs CRYPTO'2019 and eprint 2018/1161 Minimizing Trust in Hardware Wallets with Two Factor Signatures Antonio Marcedone and Rafael Pass and abhi shelat Financial Crypto'2019 Threshold ECDSA from ECDSA Assumptions The Multiparty Case Jack Doerner and Yashvanth Kondi and Eysa Lee and abhi shelat Oakland S&P'2019 A better method to analyze blockchain consistency Lucianna Kiffer, Rajmohan Rajaraman, abhi shelat ACM CCS 2018 Blind Certificate Authorities Liang Wang, Gilad Asharov, Rafael Pass, Thomas Ristenpart, abhi shelat Oakland S&P'2019 Secure Multi-party Threshold ECDSA from ECDSA Assumptions Jack Doerner and Yashvanth Kondi and Eysa Lee and abhi shelat Oakland S&P'2018 Multi-Key Searchable Encryption, Revisited Ariel Hamlin and abhi shelat and Mor Weiss and Daniel Wichs PKC'2018 Doubly-efficient zkSNARKs without trusted setup Riad S. Wahby and Ioanna Tzialla and abhi shelat and Justin Thaler and Michael Walfish Oakland S&P'2018 and eprint/2017/1132 Socially Optimal Mining Pools Ben A. Fisch and Rafael Pass and abhi shelat WINE 2017 and arXiv Scaling ORAM for Secure Computation Jack Doerner and abhi shelat CCS'2017 *Best paper award*, eprint/2017/827 Full accounting for verifiable outsourcing Riad S. Wahby and Ye Ji and Andrew J. Blumberg and abhi shelat and Justin Thaler and Michael Walfish and Thomas Wies CCS'2017 and eprint 2017/242 Analysis of the Blockchain Protocol in Asynchronous Networks Rafael Pass and Lior Seeman and abhi shelat Eurocrypt 2017 and eprint.iacr.org/2016/454 Secure Stable Matching at Scale Jack Doerner and Dave Evans and abhi shelat CCS'16 Bounded KDM Security from iO and OWF Antonio Marcedone and Rafael Pass and abhi shelat SCN'16 The Cut-and-Choose Game and its Application to Cryptographic Protocols Ruiyu Zhu, Yan Huang, Jonathan Katz, abhi shelat USENIX Security 2016 Verifiable ASICs Riad S. Wahby and Max Howald and Siddharth Garg and abhi shelat and Michael Walfish Oakland S&P 2016 *Best student paper award* How to Use SNARKs in Universally Composable Protocols Ahmed Kosba, Zhichao Zhao,rew Miller, Hubert Chan, Charalampos Papamanthou, Rafael Pass, abhi shelat and Elaine Shi eprint/2015/1093 Lower Bounds on Assumptions behind Indistinguishability Obfuscation Mohammad Mahmoody, Ameer Mohammed, Soheil Nematihaji, Rafael Pass and abhi shelat TCC 2016 Impossibility of VBB Obfuscation with Ideal Constant-Degree Graded Encodings Rafael Pass and abhi shelat TCC 2016 Secure Computation from Millionaire abhi shelat and Muthu Venkitasubramaniam Asiacrypt 2015 Micropayments for Peer-to-peer currencies Rafael Pass and abhi shelat ACM Conf on Computer Security (CCS) 2015 An Overview of ANONIZE: A Large scale anonymous survey system S. Hohenberger, S. Myers, R. Pass, and a. shelat IEEE Security & Privacy Journal, Vol 13, No 2, Mar 2015. Oblivious RAM for Secure Computation Xiao Wang, Hubert Chen, Yan Huang, abhi shelat, Elaine Shi ACM Conf on Computer Security (CCS) 2014 ANONIZE: A Large-Scale Anonymous Survey System Susan Hohenberger, Steven Myers, Rafael Pass, abhi shelat IEEE Security & Privacy (Oakland) 2014 GPU and CPU Parallelization of Secure Two-Party Computation Nathaniel Husted, Steven Myers, and abhi shelat Annual Computer Security Applications Conf (ACSAC) 2013 Fast Two-Party Secure Computation with Minimal Assumptions Chih-hao Shen, abhi shelat ACM Conf on Computer Security (CCS) 2013 Lessons learned with PCF Scaling Secure Computation Ben Kreuter, abhi shelat Workshop on language support for Privacy Enhancing Technologies (PETSHOP) 2013 PCF: A Portable Circuit Format For Scalable Two-Party Secure Computation Benjamin Kreuter, a.shelat, Benjamin Mood, Kevin Butler USENIX Security, 2013 Algorithms for Compressed Inputs Nathan Brunelle, Gabe Robins, abhi shelat Data Compression Conference, 2013 (poster) Blackbox Construction of A More Than Non-Malleable CCA1 Encryption Scheme from Plaintext Steve Myers, Mona Sergi, abhi shelat J. of Computer Security, Vol 21, No 5, pp 721–748 Black-Box Proof of Knowledge of Plaintext and Multiparty Computation with Low Communication Overhead Steve Myers, Mona Sergi, abhi shelat Theory of Cryptography Conference (TCC) 2013 Billion-Gate Secure Computation with Malicious Adversaries Ben Kreuter, Chih-hao Shen, abhi shelat USENIX Security 2012 Matching by propensity score in cohort studies with three treatment groups J. A. Rassen, a. shelat, J. Myers, R.J. Glynn, and S. Schneeweiss Epidemiology, in press 2012 One-to-many propensity score matching in cohort studies, J. A. Rassen, a. shelat, J. Myers, R. Glynn, K. Rothman, S. Schneeweiss J. of Pharmacoepidemiology and Drug Safety, v21.S2, 12 pages, May 2012 Computing on Authenticated Data J.Ahn, D.Boneh, J.Camenisch, S.Hohenberger, a.shelat, and B.Waters Theory of Cryptography Conference 2012 Efficient Secure Computation with Garbled Circuits Y. Huang, C.~Shen, D.~Evans, J.~Katz, and a.~shelat Information systems security 2011 Blackbox Construction of A More Than Non-Malleable CCA1 Encryption Scheme from Plaintext Awareness Steve Myers, Mona Sergi, abhi shelat Secure Computer Networks (SCN) 2011 Two-output Secure Computation With Malicious Adversaries Chih-hao Shen and a. shelat Eurocrypt 2011 A Sub-0.5V Lattice-Based Public-Key Encryption Scheme for RFID Platforms in 130nm CMOS Yu Yao, Sudhanshu Khanna, Ben Calhoun, Dave Evans, John Lach, and a. shelat RFIDSEC’11 Asia Renegotiation-safe Protocols Rafael Pass and a. shelat Innovations in Computer Science ’11 (ICS’11) Optimistic Concurrent Zero Knowledge Alon Rosen and a. shelat Asiacrypt ’10 Additive Combinatorics and Discrete Logarithm Based Range Protocols R. Chaabouni, H. Lipmaa, a.shelat Australasian conf Inf Security & Privacy (ACISP’10) and Bit Encryption is Complete Steven Myers and abhi shelat. FOCS 2009. Proceedings version Collusion-Free Multiparty Computation in the Mediated Model J. Alwen, J. Katz, Y. Lindell, G. Persiano, a. shelat, and I. Visconti. CRYPTO 2009. Santa Barbara, CA. Purely Rational Secret Sharing Silvio Micalli and abhi shelat. Theory of Cryptography Conference (TCC) 2009. Efficient Protocols for Set Membership and Range Proofs Jan Camenisch, Raﬁk Chaabouni, and abhi shelat ASIACRYPT 2008 Collusion-Free Protocols in the Mediated Model Joel Alwen, abhi shelat, and Ivan Visconti CRYPTO 2008 Bounded CCA2-Secure Encryption Ronald Cramer, Goichiro Hanaoka, Dennis Hofheinz, Hideki Imai, Eike Kiltz, Rafael Pass, abhi shelat, and Vinod Vaikuntanathan. ASIACRYPT’07, December 2007, Kuching, Malaysia. Relations Among Notions of Non-Malleability for Encryption Rafael Pass, abhi shelat, and Vinod Vaikuntanathan. ASIACRYPT’07, December 2007, Kuching, Malaysia. Cryptography from Sunspots: How to use an Imperfect Reference String Ran Canetti, Rafael Pass, and abhi shelat Foundations of Computer Science (FOCS’07), Providence, Rhode Island, October 2007. Efficient Fork-Linearizable Access to Untrusted Shared Memory Christian Cachin, abhi shelat, and Alex Shraer Principles of Distributed Computing (PODC’07), Portland, Oregan, Aug 2007. Simulatable Adaptive Oblivious Transfer Jan Camenisch, Gregory Neven, and abhi sh",
  "content_length": 11956,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:32"
}