{
  "name": "Abhishek Ray",
  "homepage": "https://cse.kiit.ac.in/profiles/abhishek-ray",
  "status": "success",
  "content": "Abhishek Ray - KIIT School of Computer Engineering Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Abhishek Ray Abhishek Ray Abhishek Ray Professor and Dean (Industry Engagements)Prof. (Dr.) Abhishek Ray Professor & Dean (Industry Engagements) With the quality of Novelty and Transparency a teacher who is a self motivated and loves of life as a teacher is to engage deeply with students to enhance their professional career. Over 25 years of experience in teaching, research & academic administration, out of which a successful 16+ years devoted specifically in the career augmentation, training and placement activities of a massive academic institution. During his 19+ years of association with KIIT, he had held various administrative positions in School of Computer Engineering from 2005 to 2020 in KIIT. He is currently serving as Dean (Industry Engagements) since 2020 at KIIT deemed to be University. Aim to consistently strive to create a challenging and engaging learning environment in which students become life-long scholars and learners. Dr. Abhishek Ray completed his Ph.D. (Computer Science & Engineering) from KIIT Deemed to be University, Bhubaneswar, M.E. (Computer Science & Engineering) from REC, Rourkela (currently renamed as NIT, Rourkela), Odisha, B.E. (Computer Science & Engineering) from Utkal University, Bhubaneswar, Odisha, India. His teaching & research areas of interest are Compiler Design, Automata Theory, Software Engineering, SOA, Software Testing, AI, Data Analytics, Cloud Computing, Machine Learning, BlockChain, Image Processing, IoT, etc. He had guided 4 Ph.D scholars and 20+ Master’s Dissertation and had published / presented more than 30 research articles in the international & national journals, conferences and seminars. He has been a member of various professional bodies like IET, ISTE, ISC. He has been awarded as Dynamic Professor of the year 2021 by Global Teaching Excellence Awards 2021. Profile LinksEmail :[email protected]Scopus Id :55435190900 Social LinksProfileRecent PublicationsProfileEducational QualificationDean (Industry Engagements)Research InterestsCompiler Design, Automata Theory, Software Engineering, SOA, Software Testing, AI, Data Analytics, Cloud Computing, Machine Learning, Blockchain, Image Processing, IoT, etc.MembershipsIET, ISTEOutreach ActivityRTST-2018, 21 May 2018, KIIT UniversityRecent PublicationsJournals/Conferences :1.\t“Slicing based on web scrapped concurrent component”, Advances in Intelligent Systems and Computing, Volume 1171, Pages 275 – 289, (2021) [Indexed in Scopus, DOI: http://dx.doi.org/10.1007/978-981-15-5400-1_29, Authors: N. Pujari, A. Ray & J. Singh] 2.\t“Precision local positioning mechanism in underground mining using IoT-enabled WiFi platform”, International Journal of Computers and Applications, Volume 42, Issue 3, Pages 266 – 277 (2020) [Indexed in Scopus, DOI: http://dx.doi.org/10.1080/1206212X.2018.1551178, Authors: A.G. Mohapatra, B. Keswani, S. Nanda, A. Ray, A. Khanna, D. Gupta and P Keswani, No of Citations: 3] 3.\t“Dynamic slicing of aspect-oriented software: An UML-based approach”, International Journal of Productivity and Quality Management, Volume 30, Issue 3, Pages 371 – 393 (2020) [Indexed in Scopus, DOI: http://dx.doi.org/10.1504/IJPQM.2020.108353, Authors: M.Agarwal & S.Singh] 4.\t“Agricultural Marketing Transformation Through Crowdsourcing System for Product Price Analysis: Ethiopia: A Case Study”, Lecture Notes in Networks and Systems, Volume 120, Pages 207 – 218 (2020) [Indexed in Scopus, DOI: http://dx.doi.org/10.1007/978-981-15-3325-9_16, Authors: S.Y. Arega, A. Ray, & P. Bhuyan]. 5.\t“Cost Evaluation Framework for Fault Prediction Technique in Testing”, Lecture Notes on Data Engineering and Communications Technologies, Volume 37, Pages 21 – 31 (2020) [Indexed in Scopus, DOI: http://dx.doi.org/10.1007/978-981-15-0978-0_2, Authors: S. Behera, S. Das & A. Ray] 6.\t“Leveraging Blockchain as a Solution for Security Issues and Challenges of Paperless E-Governance Application”, Advances in Intelligent Systems and Computing, Volume 1119, Pages 651 – 658 (2020) [Indexed in Scopus, DOI: http://dx.doi.org/10.1007/978-981-15-2414-1_65, Authors: A. Sethy & A. Ray, No of Citations: 3] 7.\t“Smart tourism system architecture design using the internet of everything(IOE) over cloud platform”, International Journal of Innovative Technology and Exploring Engineering, Volume 8, Issue 6, Pages 421 – 426 (2019) [Indexed in Scopus, eISSN: 2278-3075, Authors: A. G. Bulti., A. Ray, & P.Bhuyan]. 8.\t“Survey on big data security in various applications”, International Journal of Engineering and Technology(UAE), Volume 7, Issue 4, Pages 3478 – 3484 (2018) [Indexed in Scopus, eISSN: 2227-524X, DOI: http://dx.doi.org/10.14419/ijet.v7i4.15882, Authors: A. Sethy & A. Ray]. 9.\t“A framework for optimization of regression testing of web services using slicing”, 2017 International Conference on Advances in Computing, Communications and Informatics, Volume 2017-January, Pages 1017 – 1022 (2017) [Indexed in Scopus, DOI: http://dx.doi.org/10.1109/ICACCI.2017.8125975, Authors: S. Sahoo & A. Ray, No of Citations: 4]. 10.\t“Test scenario prioritization using UML use case and activity diagram” Advances in Intelligent Systems and Computing, Volume 556, Pages 499 – 512 (2017) [Indexed in Scopus, DOI: https://doi.org/10.1007/978-981-10-3874-7_47, Authors: P. Bhuyan, A. Ray & M. Das] 11.\t“Conditioned slicing of aspect-oriented program”, Advances in Intelligent Systems and Computing, Volume 556, Pages 513 – 522 (2017) [Indexed in Scopus, DOI: https://doi.org/10.1007/978-981-10-3874-7_48, Authors: A. Ray & C. K. Niraj] 12.\t“A Service-Oriented Architecture (SOA) framework component for verification of choreography”, Smart Innovation, Systems and Technologies, Volume 33, Pages 25 – 35 (2015), [Indexed in Scopus, DOI: https://doi.org/10.1007/s12034-019-1894-1, Authors: P. Bhuyan, A. Ray & D. P. Mahapatra, No of Citations: 2]. 13.\t“An approach for computing dynamic slice of concurrent aspect-oriented programs”, International Journal of Software Engineering and its Applications, Volume 7, Issue 1, Pages 13 – 32 (2013), [Indexed in Scopus, ISSN: 1738 – 9984, Authors: A. Ray, S. Mishra & D. P. Mahapatra, No of Citations: 6]. 14.\t“Image segmentation based on learning cellular automata using soft computing approach”, AIP Conference Proceedings, Volume 1298, Pages 606 – 611 (2010) International Conference on Modeling, Optimization, and Computing, ICMOC-2010, [Indexed in Scopus, ISSN: 1757-8981, DOI: https://doi.org/10.1063/1.3516379, Authors: D. Das & A. Ray]. 15.\t“Encryption algorithm for block ciphers based on programmable cellular automata”, Communications in Computer and Information Science, Volume 70, Pages 269 – 275 (2010), [Indexed in Scopus, DOI: https://doi.org/10.1007/978-3-642-12214-9_44, Authors: D. Das & A. Ray, No of Citations: 8]. (b)\tResearch Articles in Published Journals (With ISSN / ISBN ONLY): 1.\t“Commodity Market Price Analysis and Prediction Using Machine Learning Framework”, International Journal of Innovative Technology and Exploring Engineering (IJITEE), 8(8), pp: 2822-2828, 2019 [ISSN: 2278-3075, Authors: A.G. Bulti & A. Ray]. 2.\t“Web Slicing Incorporating Component-Oriented Programming”, In Proceedings Second International Conference on Computing Methodologies and Communication (ICCMC), pp. 334 -339, (2018) IEEE Explore [DOI: 10.1109/ICCMC.2018.8487856, Authors: N. Pujari, A. Ray & J. Singh] 3.\tSlicing of Object-Oriented JDBC Application Program”, Khushboo Gupta, Abhishek Ray, Vol. 4, No. 4, pp. 1220-1225, April 2014 [ISBN: 0973-0281, Authors: K. Gupta, A. Ray]. 4.\tA Survey Report on Requirement Traceability of Service Oriented Architecture”, International Journal of Computer Science and Information Technologies, Vol. 5, No. 3, pp. 3031-3033, May 2014, [ISSN: 0975 – 9646, Author: S. Subhadarshini, A. Ray]. 5.\t“Dynamic Slicing of Distributed Aspect-Oriented Programs”, Pensee Journal, Vol 76, No. 5, pp. 69-87, May 2014 [Authors: A. Ray, C. K. Niraj, S. Mishra, D. P. Mohapatra] 6.\t“Review Report on Semantic web service composition using Petri nets”, International Journal of Computer Science & Engineering Technology, Vol. 5, No. 4, pp. 430-433, April 2014 [ISSN : 2229-3345, Author: P. Rout, A. Ray] 7.\t“A Novel Approach for Computing Dynamic Slices of Aspect-Oriented Programs”, International Journal of Computer Information Systems, Vol. 5, No. 3, pp. 6-12, September, 2012, [ISSN 2229 5208, Authors: A. Ray, S. Mishra, D. P. Mohapatra] 8.\t “Dynamic Slicing of Aspect Oriented Programs using AODG”, International Journal of Computer Science and Information Security, Vol. 9, No. 4, pp. 123-126, April, 2011, [ISSN 1947-5500, Authors: S. R. Raheman, A. Ray, S. Pradhan,] 9.\t“A Parallel Encryption Algorithm for Block Ciphers Based on Reversible Programmable Cellular Automata”, Journal of Computer Science and Engineering, Vol-1, Issue-1, May 2010, [Authors: D. Das & A. Ray] (c)\tResearch Articles Presented Orally in Seminars / Conference / Symposium: 1.\t“Architectural Aspect-Oriented Dynamic Slicing”, in Proceedings of Infosys Lab Briefings for Model-based Software Engineering: Some Perspectives, Vol. 11, No. 2, pp. 20-35, 2013 [Authors: A. Ray & S. Mishra]Books :1. “Cloud-Based Data Analytics: Applications, Security Issues, and Challenges” Book Published on The Role of IoT and Blockchain Techniques and Applications, Apple Academic Press, [To be Published in December 2021, eISBN: 9781003048367, Author: M. K. Senapaty, G. Mishra & A. Ray] 2. IoT Service Platform, Book Published on Interoperability in IoT for Smart Systems, 1st Edition, eISBN: 9781003055976, CRC Press, [Published on December 2020, https://doi.org/10.2478/9788366675124, Author: P. Bhuyan & A. Ray] Keynote / Expert Lectures Delivered: 1. 11 th National Workshop on Recent Trends in Software Testing (RTST-2018), 18 th – 22 nd May 2018, KIIT Deemed to be Uni",
  "content_length": 10372,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:41"
}