{
  "name": "Abhijeet Ghosh",
  "homepage": "http://www.doc.ic.ac.uk/~ghosh",
  "status": "success",
  "content": "Abhijeet Ghosh Abhijeet Ghosh Address Room 380, Huxley Bldg. Imperial College London South Kensington Campus London SW7 2AZ, UK Phone +44 (0) 20 7594 8351 (O) E-mail ghosh AT imperial.ac.uk I am Professor of Graphics & Imaging in the Department of Computing at Imperial College London (part-time since 2025). I lead the Realistic Graphics and Imaging group and my current research interests include appearance modeling, and computational illumination and photography for graphics and vision. I have previously held an EPSRC Early Career Fellowship, and a Royal Society Wolfson Research Merit Award in the area of realistic computer graphics. Here is a link to my recent inaugural lecture at Imperial. My group is hosting (jointly with UCL) the Eurographics Symposium on Rendering (EGSR) 2024 at Imperial! Previously, we also organized EGSR 2020 which was held remotely. I also served as Program co-Chair for EGSR 2022. Before joining Imperial, I was a senior researcher in the Graphics Lab of the USC Institute for Creative Technologies and a research assistant professor of Computer Science at USC’s Viterbi School of Engineering. I have significantly contributed to USC-ICT’s Lightstage facial capture system using polarized spherical gradient illumination, which has been recognized with a Technical Achievement Award in 2019 by the Academy of Motion Picture Arts and Sciences. We have built a multispectral light stage in my lab for appearance capture. I completed my PhD in Computer Science at the University of British Columbia, where I was affiliated to the Imager Computer Graphics Laboratory. My doctoral dissertation was in the area of realistic rendering, and is a recipient of the 2007 Alain Fournier PhD thesis award. For prospective students – I am always looking for good PhD and Masters students. Send me an email if you are interested in working with me. Here is a link to potential PhD scholarships that are available at Imperial. Research Projects | Funding Teaching COMP70001 Adv. Computer Graphics | COMP60005 Computer Graphics Publications Papers | Talks/Posters | PhD thesis Personal CV | Cool links! | News Advising Post-docs/Students",
  "content_length": 2158,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:34"
}