{
  "name": "Abhranil Chatterjee 0001",
  "homepage": "https://cabhranil.bitbucket.io",
  "status": "success",
  "content": "Abhranil Chatterjee à¦ à¦­à§à¦°à¦¨à§à¦² à¦à§à¦¯à¦¾à¦à¦¾à¦°à§à¦à§ Assistant Professor Department of Computer Science and Engineering Indian Institute of Technology, Kanpur E-mail: abhranil [at] cse [dot] iitk [dot] ac [dot] in               abhneil [at] gmail [dot] com I am interested in the theoretical aspects of computer science, specifically, in algebraic complexity, and designing algorithms using algebraic methods. Here is a link to my resume. Research Publications Teaching Odd Semester, 2025 *Design and Analysis of Algorithms(IIT-K) Even Semester, 2025 Computational Complexity(IIT-K) Odd Semester, 2024 Design and Analysis of Algorithms(ISI-K) Even Semester, 2024 Computational Complexity(ISI-K) Odd Semester, 2023    Algorithms for Big Data(ISI-K) Even Semester, 2023    Programming & Data Structures II(NISER) Past Employment 2023 -- 2024 INSPIRE Faculty in ACMU, CCSD at Indian Statistical Institute, Kolkata 2022 -- 2023 Visiting Faculty in the School of Computer Sciences at National Institute of Science Education and Research, Bhubaneswar 2021 -- 2022 Postdoctoral Researcher in the Department of Computer Science and Engineering at Indian Institute of Technology, Bombay Education 2016 -- 2022 Ph.D. in Theoretical Computer Science from The Institute of Mathematical Sciences (HBNI), Chennai Advisors: V. Arvind and Partha Mukhopadhyay 2014 -- 2016 M.E. in Computer Science and Engineering from Jadavpur University 2009 -- 2013 B.Tech in Computer Science and Engineering from Kalyani Government Engineering College Talks (Videos) Trading Determinism for Noncommutativity in Edmonds' Problem at FOCS, 2024 (pre-recorded conference talk). Black-box Identity Testing of Noncommutative Rational Formulas in Deterministic Quasipolynomial-time at STOC, 2024 (pre-recorded conference talk). Determinants vs. Algebraic Branching Programs at ITCS, 2024 (pre-recorded conference talk). Black-box Identity Testing of Noncommutative Rational Formulas in Deterministic Quasipolynomial-time at STCS Seminar, TIFR, India. Black-box Identity Testing of Noncommutative Rational Formulas of Inversion Height Two in Deterministic Quasipolynomial-time at WACT(2023), University of Warwick, UK. On Identity Testing and Noncommutative Rank Computation over the Free Skew Field at ITCS, 2023 (pre-recorded conference talk). Black-box Identity Testing of Noncommutative Rational Formulas of Inversion Height Two in Deterministic Quasipolynomial-time at RANDOM, 2022 (pre-recorded conference talk). A Special Case of Rational Identity Testing and the Bresar-Klep Theorem at MFCS, 2020 (pre-recorded conference talk). Arithmetic Complexity of Symmetrized Symmetric Polynomials and Multilinear Monomial Counting at WACT(2019), ICTS, India. Recent Update Our paper Black-box Identity Testing of Noncommutative Rational Formulas in Deterministic Quasipolynomial-time has been accepted in SIAM Journal on Computing (SICOMP). I am in the program committee of STACS(2026). Serving as an area chair in ACM India ARCS(2026). My paper Characterizing and Testing Principal Minor Equivalence of Matrices with Sumanta Ghosh, Rohit Gurjar, and Roshan Raj has been accepted at STOC, 2025 . Other News My paper Determinants vs. Algebraic Branching Programs with Mrinal Kumar and Ben Lee Volk has been accepted at Computational Complexity journal. I have been awarded a travel grant by Microsoft Research to attend FOCS, 2024. My paper Trading Determinism for Noncommutativity in Edmonds' Problem, with V. Arvind and Partha Mukhopadhyay has been accepted at FOCS, 2024. Our paper Black-box Identity Testing of Noncommutative Rational Formulas in Deterministic Quasipolynomial-time has been invited to STOC 2024 Special Issue, in SIAM Journal on Computing (SICOMP). I have been awarded a travel grant by Google Research to attend STOC, 2024. My paper Black-box Identity Testing of Noncommutative Rational Formulas in Deterministic Quasipolynomial-time with V. Arvind and Partha Mukhopadhyay has been accepted at STOC, 2024. My paper Determinants vs. Algebraic Branching Programs with Mrinal Kumar and Ben Lee Volk has been accepted at ITCS, 2024. In a joint work with V. Arvind and Partha Mukhopadhyay (Black-box Identity Testing of Noncommutative Rational Formulas in Deterministic Quasipolynomial-time), we solved the black-box RIT problem. I have joined the Department of Computer Science and Engineering of Indian Institute of Technology, Kanpur as an Assistant Professor on December 17, 2024. Served as one of the area chairs at ACM India ARCS 2025 Invited speaker for CALDAM 2025 Indo-Spain Pre-Conference School on Algorithms and Combinatorics during February 10-11, 2025. I was a co-organizer of the workshop Recent Trends in Algorithm, 2023 held at NISER, Bhubaneswar from July 26--28, 2023. Recipient of the INSPIRE Faculty Fellowship(2022) by the Department of Science and Technology, Government of India.",
  "content_length": 4900,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:40"
}