{
  "name": "Abir De",
  "homepage": "https://abir-de.github.io",
  "status": "success",
  "content": "Abir De: Webpage Research interests Publications Recognitions Workshop/tutorial Abir De Assistant Professor Department of Computer Science and Engineering, Indian Institute of Technology Bombay $MyFirstName@cse.iitb.ac.in Research Interests My current research focus is designing machine learning models and methods for structured objects, e.g., graphs and sets. The specific sub-areas that I am currently working in are as follows: Differentiable surrogates for combinatorial algorithms on graphs using neural networks. We are working on designing neural networks which approximate hard decision tasks on graphs. For e.g., we have developed neural tools for subgraph isomorphism and maximum common subgraph detection. For details, please look into ISONET, XMCS, GraphEdX, MxNet, and the reaction yield prediction model yieldNet, Data-efficient machine learning. Modern machine learning models are trained on datasets of ever increasing size. Such models are often compute-hungry and require expensive maintenance and have large energy footprint. To tackle this problem, we have proposed compute efficient methods to strategically select training instances, such that overall performance does not degrade. In our past projects, we have used both combinatorial and neurally guided subset selection methods. See Selcon, Gradmatch, Subselnet, Fhashnet. Neural models of set functions. We are working on designing neural models for submodular or approximate submodular functions. See Flexsubnet. Human in the loop machine learning. We are developing methods to distribute decision tasks across humans and machines. See for example AAAI 2020, AAAI 2021 and NeurIPS 2021 papers. We are also working on how to effectively query features to facilitate assistance. See Genex. Information diffusion. Despite this being quite a rich and classical topic, we have developed methods for novel information cascade problems, e.g., problems involving capacity constraints, and preference estimation. See publications for more details. Recognitions Our team (Pritish Chakraborty, Soumen Chakrabarti and I) won the Qualcomm Innovation Fellowship 2025. Bhide Family Chair (2025 - 2028). Our team (Indra Roy, Soumen Chakrabarti and I) is the winner (2022) and the superwinner (2023) of Qualcomm Innovation Fellowship. Indian National Academy of Engineering Young Engineer Award, 2021. Prof. Krithi Ramamritham Award for Creative Research at IIT Bombay 2020. Indian National Academy of Engineering innovative PhD project award, 2019. Google India PhD Fellowship for Social Computing 2013. Best Dual Degree Project award in the year 2011 in the Department of Electrical Engineering, IIT Kharagpur Workshop/Tutorial/Symposium Co-organizing workshop on Differentiable Learning of Combinatorial Algorithms at NeurIPS 2025 Tutorial on \"Retrieval of Graph Structured Objects\" (Proposal) at CIKM 2025 Program co-chair of IndoML 2023 Co-organizer of CSE research symposium (CRS) 2023 at IIT Bombay Tutorial on Human Assisted Learning @ AIML systems conference 2021 Co-organizer of SubSetML workshop at ICML 2021 Tutorial on Subset Selection in Machine Learning: Theory, Applications, and Hands On @ AAAI 2022 Workshop on Learning with Temporal Point Processes at NeurIPS 2021. Conference Committees Area Chair at ICLR 2026, NeurIPS 2025. Senior PC at AAAI 2022-2024, PC member at NeurIPS 2016-2023, ICML 2018-2023, ICLR 2018-2023, WSDM 2020--2022. Current PhD students Indradyumna Roy Pritish Chakraborty Ninad Gandhi",
  "content_length": 3487,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:41"
}