{
  "name": "Abir Das",
  "homepage": "http://cse.iitkgp.ac.in/~adas",
  "status": "success",
  "content": "Welcome to Abir Das's web page --> Abir Das Assistant Professor CSE Department IIT Kharagpur HOME Education & Industry Research Publications Research Group Teaching CV Links Abir Das Welcome to my webpage Hi, I'm Abir Das. I am an Assistant Professor in the Computer Science and Engineering Department at IIT Kharagpur. Before joining IIT Kharagpur I was briefly an Assistant professor at IIIT Delhi. I was a postdoctoral researcher at Boston University under Prof. Kate Saenko before that. I completed my PhD in Electrical Engineering from the  University of California at Riverside (UCR). My research advisor was Dr. Amit Kumar Roy-Chowdhury in the 'Video Computing Group' led by him. Before joinging UCR, I had done my Bachelor of Electrical Engineering from Jadavpur University, Calcutta, India in the year 2007. Please visit the 'Research' page of this website to go over the research problems that I have explored in the past and am exploring recently. PhD Positions I am looking for highly motivated and talented PhD students interested to do do research on computer vision and machine learning. My interests lie in reinforcement learning, explainable AI and bias in Deep Learning models for Computer Vision. Interested students may look at my publications page and the research group page to get a glimpse of the kind of problems I am interested in. Recent News: 2024: Paper - \"SITAR: Semi-supervised Image Transformer for Action Recognition\" accepted in ICPR 2024. Paper - \"XPL: A Cross-Model framework for Semi-Supervised Prompt Learning in Vision-Language Models\" accepted in TMLR 2024. Paper - \"Convolutional Prompting meets Language Models for Continual Learning\" accepted in CVPR 2024. Paper - \"DSDF: Coordinated Look-ahead Strategy in Multi-agent Reinforcement Learning with Noisy Agents\" received the Best Paper Honorable Mention Award at CODS COMAD 2024 - Research track. 2023: Congratulations Omprakash on getting the Google India PhD fellowship 2023 (One of only 8 in India this year). Paper \"Exemplar-Free Continual Transformer with Convolutions\" accepted in ICCV 2023. Paper \"Domain Adaptation of Reinforcement Learning Agents based on Network Service Proximity\" accepted in NetSoft 2023 (plenary session). Paper \"AnyDA: Anytime Domain Adaptation\" accepted in ICLR 2023. Select, Label, and Mix (SLM) received the Best Paper Honorable Mention Award at WACV 2023. 2022: Paper - \"Select, Label, and Mix: Learning Discriminative Invariant Feature Representations for Partial Domain Adaptation,\" accepted in WACV 2023. Served as the Doctoral Symposium Chair in ICVGIP 2022. Served as Senior Program Committee Member in AAAI 2023. Named as an outstanding reviewer of CVPR 2022. Received Google India Research Award, 2021. 2021: Paper - \"Reinforcement Explanation Learning\" accepted in NeurIPS 2021 workshop on Explainable AI Approaches for Debugging and Diagnosis. Named as an outstanding reviewer of NeurIPS 2021. Paper - \"Contrast and Mix: Temporal Contrastive Video Domain Adaptation with Background Mixing\" accepted in NeurIPS 2021. Named as an outstanding reviewer of ICCV 2021. Named as an outstanding reviewer of CVPR 2021. Serving as Area Chair in ICVGIP 2021. Paper - \"Semi-Supervised Action Recognition with Temporal Contrastive Learning\" accepted in CVPR 2021. Organizing CVPR 2021 Workshop on Dynamic Neural Networks Meets Computer Vision (DNetCV). 2020: Paper - \"Mitigating Dataset Imbalance via Joint Generation and Classification\" accepted in ECCV 2020 workshop on Imbalance Problems in Computer Vision (IPCV). Paper - \"Reinforcement Learning Based Load Balancing for Hybrid LiFi WiFi Networks\" accepted in IEEE Access. Paper - \"Revisiting Few-shot Activity Detection with Class Similarity Control\" accepted in IEEE CVPR 2020 workshop on Visual Learning with Limited Labels. CVPR 2017 Poster Session. UCR Video Computing Group. UCR The Bell Tower. PwC At the Office. Jadavpur University Convocation. ECCV 2014 Poster Session. Contact Details: Email: abir@cse.iitkgp.ac.in Office: Room 11 (second floor)Takshashila BuildingIIT KharagpurPaschim Medinipur, West BengalPIN - 721302, India. Reach me at: Appointment: Please have a look at my schedule in the calendar (link below) and drop me an email. Copyright (c) 2012 Abir Das. Template design adopted from Free CSS Templates, CSS Menu Maker and Nivo Slider, Dev7studios.",
  "content_length": 4349,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:41"
}