{
  "name": "Abolfazl Asudeh",
  "homepage": "https://asudeh.github.io",
  "status": "success",
  "content": "A. Asudeh - Home page Abolfazl Asudeh 🔊 Associate Professor Department of Computer Science University of Illinois Chicago Contact 850 W. Taylor Street, Computer Design Research and Learning Center (CDRLC), Room 5452, Chicago, IL 60607 ☏: (312) 413-8028 ✉: asudeh[AT]uic[DOT]edu A. Asudeh is an Associate Professor of Computer Science at the University of Illinois Chicago and the director of Innovative Data Exploration Laboratory (InDeX Lab). His research focus is on Algorithm Design for Data and AI problems. He designs efficient, accurate, and responsible solutions that leverage Approximation, Randomized, and Computational Geometry Algorithms. His research interests include the interplay of Data/Algorithms/AI, Responsible Data Science, and Ranking and Approximate Nearest Neighbor Problems, among others. Asudeh is a senior member of ACM and a senior member of IEEE. He serves as an Associate Editor for the IEEE Transactions on Knowledge and Data Engineering (TKDE), is a regular PC member of Data Management and AI flagship venues, and served as a VLDB Ambassador and the VLDB Endowment's Liaison to NSF. His research is supported by NSF and has received recognitions, including the Communications of the ACM's (CACM) Research Highlight, Google's Research Scholar Award, SIGMOD 2019 Research Highlight Award, “Best of VLDB” 2020 (the special issue of VLDBJ), and SIGMOD 2017 Reproducibility Award. Prospective Students Every year, I look for a small number of motivated, smart, and hard-working PhD students. In particular, I look for students with a strong background in Algorithms who are interested in finding algorithmic solutions for data problems and AI (recently LLMs and Foundation Models have enabled an exceptional phenomenon for such research). You also need to have outstanding programming skills. If you are interested, check our lab page and our recent publications. If interested and qualified, please apply here and mention my name in your application. Due to the large number of emails, I may not be able to respond to them all. If you email me, please use ``Prospective PhD Student'' as the subject and attach your CV and transcripts. Describe your skills, interests, research experience, and how those may fit InDeX Lab. Recent Publications (Since 2024) -- see publications for the complete list. A Survey on Reliability, Transparency, Accountability, and Fairness in LLM-based Multi-Agent Systems through the Responsibility Lens. LLM Agents Responsible AI Sana Ebrahimi and Abolfazl Asudeh. Preprint (2025) An Efficient Matrix Multiplication Algorithm for Accelerating Inference in Binary and Ternary Neural Networks. [Code] [Video] LLMAlgorithmsMachineLearning Mohsen Dehghankar, Mahdi Erfanian, Abolfazl Asudeh. In ICML 2025. Rank It, Then Ask It: Input Reranking for Maximizing the Performance of LLMs on Symmetric Tasks. [Slides][Code] LLMMachineLearning Mohsen Dehghankar, Abolfazl Asudeh. In KDD 2025. Mining the Minoria: Unknown, Under-represented, and Under-performing Minority Groups. [Slides][Code] Responsible DataData-centric AI Mohsen Dehghankar, Abolfazl Asudeh. In VLDB, 2025. An Adversary-Resistant Multi-Agent LLM System via Credibility Scoring. LLM Sana Ebrahimi, Mohsen Dehghankar, Abolfazl Asudeh. In AACL, 2025 Fair Set Cover. [Slides][Code] AlgorithmsFairness Mohsen Dehghankar, Rahul Raychaudhury, Stavros Sintos, Abolfazl Asudeh. In KDD, 2025. Evaluating the Feasibility of Sampling-Based Techniques for Training Multilayer Perceptrons. [Slides] [Code] Computation at ScaleMachine Learning Sana Ebrahimi, Rishi Advani, Abolfazl Asudeh. In EDBT, 2025 Dynamic Necklace Splitting. Algorithms Rishi Advani, A. Asudeh, Mohsen Dehghankar, Stavros Sintos. Preprint (2025) Efficient Direct-Access Ranked Retrieval. Ranking Mohsen Dehghankar, Raghav Mittal, Suraj Shetiya, A. Asudeh, Gautam Das. Preprint (2025) Unbiased Binning: Fairness-aware Attribute Representation. FairnessResponsible Data A. Asudeh, Mila Asoodeh, Bita Asoodeh, Omid Asudeh. Preprint (2025) On Fair Epsilon Nets and Geometric Hitting Sets. Data-structureAlgorithmsFairness Mohsen Dehghankar, Stavros Sintos, Abolfazl Asudeh. Preprint (2025) HENN: A Hierarchical Epsilon Net Navigation Graph for Approximate Nearest Neighbor Search. [Code]Data-structureAlgorithms Mohsen Dehghankar and Abolfazl Asudeh. Preprint (2025) Fair-Count-Min: Frequency Estimation under Equal Group-wise Approximation Factor. Data-structureFairness Nima Shahbazi, Stavros Sintos, Abolfazl Asudeh. Preprint (2025) Needle: A Generative-AI Powered Monte Carlo Method for Answering Complex Natural Language Queries on Multi-modal Data. [Code] Image DatabasesLLM4DataMachineLearning Mahdi Erfanian, Mohsen Dehghankar, Abolfazl Asudeh. Preprint (2024) Chameleon: Foundation Models for Fairness-aware Multi-modal Data Augmentation to Enhance Coverage of Minorities. [Slides] [Video] [Code] LLM4Data Mahdi Erfanian, H. V. Jagadish, Abolfazl Asudeh. In VLDB, 2024. FairHash: A Fair and Memory/Time-efficient Hashmap. [Slides] [Code] Data-structureFairness Nima Shahbazi, Stavros Sintos, Abolfazl Asudeh. In SIGMOD, 2024 Requal-LM: Reliability and Equity through Aggregation in Large Language Models. [Slides]LLMFairnessReliability Sana Ebrahimi, Nima Shahbazi, Abolfazl Asudeh. In NAACL (Findings), 2024 AXOLOTL: Fairness through Assisted Self-Debiasing of Large Language Model Outputs. [Slides]LLMFairness Sana Ebrahimi, Kaiwen Chen, Abolfazl Asudeh, Gautam Das, Nick Koudas. In ICKG, 2024 Reliability Evaluation of Individual Predictions: A Data-centric Approach. Data-centric AIReliability Nima Shahbazi, Abolfazl Asudeh. In VLDB Journal, 2024 Coverage-based Data-centric Approaches for Responsible and Trustworthy AI. (Invited paper) Data-centric AIResponsible Data Nima Shahbazi, Mahdi Erfanian, Abolfazl Asudeh. Data Engineering Bulletin 48(1), Special Issue on Data-centric Responsible AI, 2024 Data Coverage for Detecting Representation Bias in Image Data Sets: A Crowdsourcing Approach. [Code] Responsible Data Melika Mousavi, Nima Shahbazi, Abolfazl Asudeh. In EDBT, 2024 Shapley Values for Explanation in Two-sided Matching Applications. [Code] MatchingExplainability Suraj Shetiya, Ian Swift, Abolfazl Asudeh, Gautam Das. In EDBT, 2024 Data Distribution Tailoring Revisited: Cost-Efficient Integration of Representative Data. Responsible Data Jiwon Chang, Bohan Cui, Fatemeh Nargesian, Abolfazl Asudeh, H. V. Jagadish. In VLDB Journal, 2024 FairEM360: A Suite for Responsible Entity Matching. (Demo paper) [Demo Code] [EMFairness Code] [Video] ResponsibleDataEntity Matching Nima Shahbazi, Mahdi Erfanian, Abolfazl Asudeh, Fatemeh Nargesian, Divesh Srivastava. In VLDB, 2024 presentation video 📌 Pinned Systems and Repositories 📌 Needle🪡🔍 is a deployment-ready open-source image retrieval database with high accuracy that can handle complex queries in natural language. It is Fast, Efficient, and Precise, outperforming state-of-the-art methods. Born from high-end research, Needle is designed to be accessible to everyone while delivering top-notch performance. Whether you are a researcher, developer, or an enthusiast, Needle opens up innovative ways to explore your image datasets. ✨ 🌐 Visit Project 🛠️ View on GitHub 📄 Read Publication (Preprint) ▶️ Watch on YouTube 📖 Detailed installation instructions: Getting Started . RSR 🧮: Efficient Matrix Multiplication for Accelerating Inference in Binary and Ternary Neural Networks This project aims to provide a fast and efficient approach to low-bit matrix multiplication. The code repository implements Redundant Segment Reduction (RSR), a fast matrix multiplication algorithm designed for matrices in binary and ternary networks. The RSR method optimizes computation efficiency by a log(n) factor, making it particularly useful for applications in low-bit deep learning and efficient inference. The codebase provides ready-to-use C++ and NumPy-based implementations, as well as PyTorch implementations with both CPU and GPU support, enabling scalable and optimized matrix operations in deep learning environments. It includes sample experiments on various `1.58bit` models and LLMs.✨ 🛠️ View on GitHub 📄 Read Publication (Preprint) ▶️ Watch on YouTube Sponsors NSF IIS-2348919 (2024 - 2027): III: Small: Fairness-aware Data Structures for Approximate Query Processing. Abolfazl Asudeh and Stavros Sintos. NSF IIS-2107290 (2021 - 2024): III: Medium: Collaborative Research: Fairness in Web Database Applications. Abolfazl Asudeh (Lead PI - UIC), H. V. Jagadish (UofM), and Gautam Das and Shirin Nilizadeh (UTA). Google Research Scholar Award (2021 - 2022): An end-to-end system for detecting cherry-picked trendlines. Abolfazl Asudeh.",
  "content_length": 8682,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:41"
}