{
  "name": "Abolfazl Razi",
  "homepage": "https://arazi.people.clemson.edu",
  "status": "success",
  "content": "AI-SENDS Lab - Clemson University - AI-SENDS Lab - Clemson University Abolfazl RaziRoom #203, 821 McMillan Rd Follow Clemson, SC, 29631 Website Email LinkedIn Github Google Scholar In the AI-based Sensing, Networking, and Data Services (AI-SENDS) Research Group, we are working on developing sensing, networking, and data-driven actuation networks powered by computational intelligence. At the core of our research activities is developing predictive models for smart AI-native agents to learn the environment and take actions based on their anticipated consequences while accommodating networking constraints. Our vision is AI4Networking and Networking4AI for Next Gen Systems. We are particularly passionate about applied research, working with domain researchers from different expertise to leverage the developed method in different application areas. Some examples of our research include: Developing AI-enabled wireless networking protocols for unmanned aerial systems by predicting network topology, user behavior, spectrum mobility, and traffic distribution. Developing a safety analysis framework for regular and self-driving cars to extract the overall safety of traffic flow from augmented video and time-stamped crash data Developing image-based security solutions to leverage fabrication variability of nano-resolution optical identifiers for securing supply chains and the Internet of Things Developing autonomous aerial sensing platforms for forest fire modeling and control Developing networking and computational nodes for sparse networking.These projects involve concepts from information theory, signal processing, big data analysis, Bayesian inference, deep learning, graph theory, digital holography, and dimension reduction techniques.These projects are supported by NSF, US Airforce Research Laboratory, USDA, BMW Research Group, MIT Lincoln Lab, and Arizona Commerce Authority. For more information, check out my research project and feel free to send me an email at arazi@clemson.edu.Open Positions We occasionally have open positions (MS and PhD) in our research group. If you are interested, please email your CV to the email with \"Application for open positions\" in the subject line. We also have funding to support part-time undergraduate and graduate research. If you have good programming skills in MATLAB, Python, ROS, and C++, send us your CV. Links Check out my Grants, Academic Awards and Certificates here. Check out my Research Projects here. Check out my Google Scholar here. Check out my CV here. To know about my Ph.D. research project on Passive Sensors, check out my recent interview here.More Links Clemson School Computing Dr. Vinay's Website (Postdoc advisor) Prof Lawrence Carin's Research Group (Postdoc advisor) Sharif University of Technology Amir Kabir University of Technology University of Maine, ECE department University of Maryland, College Park, ECE department Wisenet Lab NCBI Website Tumor Portal (for Cancer Research) UCI Machine Learning Repository IEEE IEEE PACE Network (Professional Activities Committees for Engineers) IEEE Maine Section My Interview with EEWeb My Linkedin Education and Academic PositionsPostdoctoral Research Fellow, Case Western Reserve UniversityPostdoctoral Research Associate, ECE Department, Duke UniversityPh.D. in Electrical Engineering, University of Maine, Orono, MaineVisitor Graduate Student, University of Maryland, College Park, MDM.Sc., Electrical Engineering, Amir Kabir University of Technology, TehranB.Sc., Electrical Engineering, Sharif University of Technology, Tehran Current and Former Students",
  "content_length": 3599,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:45"
}