{
  "name": "Abraham Bernstein",
  "homepage": "http://www.ifi.uzh.ch/ddis/people/bernstein.html",
  "status": "success",
  "content": "Abraham Bernstein | Department of Informatics | UZH Skip navigation Abraham Bernstein, Prof., PhD Head Dynamic and Distributed Information Systems Group Director UZH Digital Society Initiative Phone +41 44 635 45 79 Address Department of Informatics, Binzmühlestrasse 14, CH-8050 Zürich Room number BIN 2.D.06 E-Mail Website Website2 Professor Abraham Bernstein, Ph.D. Head, Dynamic and Distributed Information Systems Group Director, UZH Digital Society Initiative Department of Informatics University of Zurich Binzmühlestrasse 14 CH-8050 Zürich, Switzerland Room: BIN 2.D.06 Phone: +41 44 635 45 79 Email:  Admin contact: Erica Maurer, Phone: + 41 44 635 43 11, Email Erica Maurer FOAF: FOAF-File (RDF, 1 KB) I am a Full Professor at the Department of Informatics (Institut für Informatik) of the University of Zurich. I mainly conduct research on the Semantic Web and Knowledge Discovery. My work draws from both social science (organizational psychology/sociology) and technical (computer science, artificial intelligence) foundations. Before coming to Zurich I was an Assistant Professor, at the Information Systems Department of New York University's Stern School of Business, and received a Ph.D. at MIT's Sloan School of Management, where I worked with Prof. Thomas W. Malone at the Center for Coordination Science. Research Interests Semantic Web Human Interaction with the Semantic Web Triple Stores / Graph Stores (incl. Query Processing) Semantic Web Services Non-standard Reasoning Large Graph Data Sets (e.g., Software, Transactions, Social Networks) Matchmaking Machine Learning / Data Mining Data Mining Process Graph Mining Time Series Mining Large Graph Data Sets (e.g., Software, Transactions, Social Networks) Publications My publications in Merlin My publications on Google Scholar http://scholar.google.com/citations?user=ZYNjTykAAAAJ ORCID id: http://orcid.org/0000-0002-0128-4602 Group publications on our web-page Group publications in Merlin Former Positions Former Chair, Department of Informatics (2016-2018) Former Member of the Faculty Board, Faculty of Economics, Business Administration and IT Quicklinks and available languages Subpages of Abraham Bernstein Professional Activities PhD Graduates Vita/Bio Professional Activities PhD Graduates Vita/Bio",
  "content_length": 2285,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:48"
}