{
  "name": "Abram Hindle",
  "homepage": "http://softwareprocess.es",
  "status": "success",
  "content": "Abram Hindle | Abram Hindle's Homepage Research Promotion Site of Abram Hindle Abram is a professor at the University of Alberta, in Edmonton, Alberta, Canada within the Department of Computing Sciences. He researches software engineering, mining software repositories, software process recovery, the intersection between software engineering and computer music, and Green Mining (the study of software change versus software energy consumption and software power consumption). A general overview of my publications: DBLP Google Scholar Current Version of my Curriculum Vitae Abram’s Blog Listing and Downloads of all of my publications Prospective Graduate Students please read this page before contacting me: Guide to Prospective Students What can Abram offer you? Methods, Technology and Tools for characterizing past developer behaviour in a software project, based on information stored in Source Control Repositories. Methodology and tools to relate software evolution and software power consumption / software energy use / software power use: Green Mining Methods and technologies for building and using computer music systems. The cross-over between software engineering and computer music: SoftwareEngineeringAndComputerMusic What questions does Abram seek to help answer? Green Mining energy aware mining of software. Software Energy Consumption studies across versions. Correlations with performance and other metrics. Distributing Web Music Interfaces Composing Distributed Web Instruments in the cloud Security Concerns of Computer Music Instruments Electronically Excited Didgeridoo An Empirical Study of End-user Programmers in the Computer Music Community Guitar Transcription Graduate Students: Current Graduate Students: Hareem Sahar (PhD) Amir Salimi (PhD) Weijie Sun (PhD) Kalvin Eng (PhD) Samuel Iwuchukwu (MSc) Anisha Islam (MSc) Past Students: Abdul Ali Bagnash (PhD) Amir Salimi Alexander Wong (MSc) Hazel Campbell (PhD) Yourui Guo (MSc) Rameel Sethi (MSc) Candy Pang (PhD) Shaiful Chowdhury (PhD) Stephen Romansky (MSc) Eddie Antonio Santos (MSc) Gregory Burlet (MSc Thesis) Karan Aggarwal (MSc Thesis) Chenlei Zhang (MSc Thesis) Anahita Alipour (MSc Thesis) Varun Sapra (MSc course based) Teaching: Courses: CMPUT 201 Programming IRL CMPT 301 Intro to SE CMPUT 410 Webservices Winter 2014, Winter 2015 CMPUT 404 Webservices CMPUT 664 Topics in Mining Software Repositories, Processes, and Artifacts Winter 2013, Winter 2014 CMPUT 663 Topics in Mining Software Repositories, Processes, and Artifacts Winter 2013, Winter 2014 Directed studies in Computer Music (Audio and deep learning), Green Mining, and Mining Software Repositories Awards: 2020 Telus World of Science Fellowship $2500 2017 CS-Can/Info-Can Outstanding Young Computer Science Researcher prize 2017 Mining Software Repositories Early Career Achievement Award: “To recognize the rigor, fearlessness, and breadth of his MSR-related research, and for establishing a new area of research related to green-mining.” 2017 – 2022 NSERC Discovery Grant $108000 2017 NSERC Engage with Black Duck Software $25000 2016 SIGSOFT ACM Distinguished Paper Award – ICSE 2016 2016 KIAS Team Grant with M. Friskopf et al. $7500 2016 Best MSR Mining Challenge Paper – MSR 2016 2015 MITACS Accelerate Cluster with Bioware $106666 2015 Best MSR Mining Challenge Paper – MSR 2015 2015 The Interdepartmental Science Students’ Society: Excellence in Undergraduate Teaching Award 2014 NSERC Engage with BioWare? $22000 2014 Faculty of Science: Student’s Honor Roll 2013 Microsoft Software Engineering Innovation Foundation Award $25000 http://research.microsoft.com/en-us/collaboration/focus/cs/seif-rfp.aspx 2012 – 2017 NSERC Discovery Grant $95000 2012 MSR Best Paper Award – MSR 2012 2012 Best MSR Mining Challenge Paper – MSR 2012 2010 Best Presentation Award - Mining Software Archives 2010 2015 ISSS Teaching Award NSERC Discovery Grant MSR 2012 Best Paper Award Potentially fun things: My Github Repos My Bitbucket Repos My musical endeavour: SkruntSkrunt My youtube channel Former Labs Contact email: web@softwareprocess.es Abram Hindle Department of Computing Science 447 Athabasca Hall University of Alberta Prospective Graduate Students Prospective Graduate Students please read this page before contacting me: Guide to Prospective Students Posts 2025/01/13 Under the Blueprints: Parsing Unreal Engine’s Visual Scripting at Scale 2025/01/12 TriGraph: A Probabilistic Subgraph-Based Model for Visual Code Completion in Pure Data 2025/01/01 Machine Learning for Detection of Wolff-Parkinson-White Syndrome Using ECG Data 2024/08/02 IRJIT: A simple, online, information retrieval approach for just-in-time software defect prediction 2024/07/05 Diagnostic and Prognostic Models Based on Electrocardiograms for Rapid Clinical Applications 2024/02/19 Patterns of multi-container composition for service orchestration with Docker Compose 2024/02/04 Federated Learning and Differential Privacy Techniques on Multi-hospital Population-scale Electrocardiogram Data 2024/01/12 Opening the Valve on Pure-Data: Usage Patterns and Programming Practices of a Data-Flow Based Visual Programming Language 2024/01/01 Development and validation of machine learning algorithms based on electrocardiograms for cardiovascular diagnoses at the population level 2023/11/01 Supervised Electrocardiogram (ECG) Features Outperform Knowledge-based And Unsupervised Features In Individualized Survival Prediction 2023/09/24 Generative Data by β-Variational Autoencoders Help Build Stronger Classifiers: ECG Use Case 2023/09/01 Dovecot and Thunderbird, bad certificate ssl alert number 42 errors 2023/08/23 Predicting Individual Survival Distributions Using ECG: A Deep Learning Approach Utilizing Features Extracted by a Learned Diagnostic Model 2023/08/10 Identifying Defect-Inducing Changes in Visual Code 2023/08/10 Predicting Defective Visual Code Changes in a Multi-Language AAA Video Game Project 2023/03/07 An Empirical Study to Investigate Collaboration Among Developers in Open Source Software (OSS) 2023/03/07 Energy Consumption Estimation of API-usage in Smartphone Apps via Static Analysis 2023/03/07 Evolution of the Practice of Software Testing in Java Projects 2023/01/03 CMPUT404: Webservices 2023/01/03 CMPUT301: INTRO TO SOFTWARE ENGINEERING 2023/01/01 Towards artificial intelligence-based learning health system for population-level mortality prediction using electrocardiograms 2022/11/02 Analyzing Techniques for Duplicate Question Detection on Q&A Websites for Game Developers 2022/07/18 CMPUT660: Machine Learning Applied: Software Engineering, Software Analtyics, and Software Energy Consumption (2022) 2022/01/01 Improving ECG-based COVID-19 diagnosis and mortality predictions using pre-pandemic medical records at population-scale 2021/12/30 A Black Box Technique to Reduce Energy Consumption of Android Apps 2021/11/30 Dorabella Cipher as Musical Inspiration 2021/10/26 ECG for high-throughput screening of multiple diseases: Proof-of-concept using multi-diagnosis deep learning from population-based datasets 2021/06/15 Energy Efficient Guidelines for iOS Core Location Framework 2021/04/23 Experimental Analysis of the Dorabella Cipher with Statistical Language Models 2021/04/05 What Causes Wrong Sentiment Classifications of Game Reviews? 2021/02/22 PySStuBs: Characterizing Single-Statement Bugs in Popular Open-Source Python Projects 2021/02/22 Revisiting Dockerfiles in Open Source Software Over Time 2021/01/29 Multilabel 12-Lead Electrocardiogram Classification Using Beat To Sequence Autoencoders 2020/10/29 How are issue reports discussed in Gitter chat rooms? 2020/10/15 Borderlands 3 and Confidence Intervals of Loot Drop Rates 2020/10/01 Multilabel 12-Lead Electrocardiogram Classification Using Gradient Boosting Tree Ensemble 2020/09/17 Make your own audience: virtual listeners can filter generated drum programs 2020/09/10 Essence of Chaos: Experiments and simulations with marbles and tubes 2020/08/07 On the Time-Based Conclusion Stability of Cross-Project Defect Prediction Models 2020/06/10 Statistics and probability for randomized games (loot shooters, roguelites, roguelikes, etc.) 2020/05/26 CMPUT201: Practical Programming Methodology / Programming IRL / The C Course / You didn’t teach that why are you testing us on it! 2020/01/15 Understanding DevOps Education with Grounded Theory 2019/07/13 Syntax and Stack Overflow: A Methodology for Extracting a Corpus of Syntax Errors and Fixes 2019/07/13 Syntax and Stack Overflow: {A} Methodology for Extracting a Corpus of Syntax Errors and Fixes 2019/03/01 What do developers know about machine learning: a study of ML discussions on StackOverflow 2019/02/27 Complexity: Let’s Not Make This Complicated 2018/12/01 GreenBundle: An Empirical Study on the Energy Impact of Bundled Processing 2018/08/15 Automatic topic classification of test cases using text mining at an Android smartphone vendor 2018/07/20 Preventing Duplicate Bug Reports by Continuously Querying Bug Reports 2018/07/13 How does Docker affect energy consumption? Evaluating workloads in and out of Docker containers 2018/07/07 If you bill it, they will pay: Energy consumption in the cloud will be irrelevant until directly billed for 2018/06/20 An exploratory study on assessing the energy impact of logging on Android applications 2018/06/20 GreenScaler: Training Software Energy Models With Automatic Test Generation 2018/05/17 An App Performance Optimization Advisor for Mobile Device App Marketplaces 2018/05/10 Training Deep Convolutional Networks with Unlimited Synthesis of Musical Examples for Multiple Instrument Recognition 2018/05/10 What can Android mobile app developers do about the energy consumption of machine learning? 2017/12/18 Syntax and Sensibility: Using language models to detect and correct syntax errors 2017/11/01 Analyzing the effects of test driven development in GitHub 2017/07/29 Continuous Maintenance 2017/06/12 Deep Green: An Ensemble of Machine Lea",
  "content_length": 16481,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:47"
}