{
  "name": "Abu Ahmed Ferdaus",
  "homepage": "https://du.ac.bd/body/faculty_details/CSE/1775",
  "status": "success",
  "content": "Faculty Members Details :: University of Dhaka Department of Computer Science and Engineering Faculty Members Details Home Faculty Members Details Abu Ahmed Ferdaus (Associate Professor) Department of Computer Science and Engineering Education Experience Research Activities Membership Publication Award Contact Degree Name Group/Major Subject Board/Institute Country Passing Year Masters Computer Science University of Dhaka Bangladesh 1997 Bachelor Applied Physics and Electronics University of Dhaka Bangladesh 1995 Title Organization Location From Date To Date No experience is found Research Interest Subject Description Research Interest (Goal, Target Indicator) Data Science Machine Learning Data Mining Project/Research Supervision Level of Study Title Supervisor Co-Supervisor(s) Name of Student(s) Area of Research Current Completion Masters Stock Price Prediction based on Candlestick Pattern Abu Ahmed Ferdaus Maria Hossain 2023 Masters Emotion Recognition based on 1D-CNN using Neural Activity Abu Ahmed Ferdaus Danastan Tasaouf Mridula 2023 Project/Research Work Subject Project Name Source of Fund From Date To Date Collaboration No project/research work is found Invited Talk SL Invited Talk No invited talk is found SL Collaboration & Membership Name Type Membership Year Expire Year No Collaboration & Membership is found Journal Article 1 Maliha Momtaz, Abu Ahmed Ferdaus, Chowdhury Farhan Ahmed and Mohammad Samiullah : Maximal and closed frequent itemsets mining from uncertain database and data stream, International Journal of Data Science , vol.4 , no.3 Inderscience Publishers (IEL) , pp.237--259 , 2019 . 2 Ashin Ara Bithi and Abu Ahmed Ferdaus : Mining Sequential Patterns from mFUSP-Tree, Int. J. Inf. Technol. Comput. Sci.(IJITCS) , vol.7 , no.7 , pp.77--89 , 2015 . 3 Salma-Tuz Jakirin, Abu Ahmed Ferdaus and Mehnaj Afrin Khan : A Genetic Algorithm Approach using Improved Fitness Function for Classification Rule Mining, International Journal of Computer Applications , vol.97 , no.23 Foundation of Computer Science , pp.12--18 , 2014 . 4 Ashin Ara Bithi, Tareq Shahriar and Abu Ahmed Ferdaus : Incremental Sequential Pattern Tree Mining, IOSR Journal of Computer Engineering (IOSR-JCE) , vol.16 , no.1 , pp.110--116 , 2014 . 5 Manira Akhter, Ashin Ara Bithi and Abu Ahmed Ferdaus : Mining Web Access Patterns using Root-set of Suffix Trees, International Journal of Computer Applications , vol.94 , no.9 Foundation of Computer Science , 2014 . 6 Ashin Ara Bithi and Abu Ahmed Ferdaus : Sequential Pattern Tree Mining, IOSR Journal of Computer Engineering (IOSR-JCE) , vol.15 , no.5 , pp.79--89 , 2013 . 7 Ashin Ara Bithi, Manira Akhter and Abu Ahmed Ferdaus : Tree Based Sequential Pattern Mining, IRACST-International Journal of Computer Science and Information Technology & Security (IJCSITS), ISSN , vol.2 , no.6 , pp.2249--9555 , 2012 . 8 Faisal Sikder and Abu Ahmed Ferdaus : Data Mining Based Motif Detection in Biological Sequences, Dhaka University Journal of Engineering & Technlogy , vol.1 , no.1 , pp.45-49 , 2010 . 9 Kamrul Abedin Tarafder, Shah Mostafa Khaled, Mohammad Ashraful Islam, Khandakar Rafiqual Islam, Hasnain Feroze, Mohammad Khalaquzzaman and Abu Ahmed Ferdaus : Reverse Apriori Algorithm for Frequent Pattern Mining, Asian Journal of Information Technology , vol.7 , no.12 , pp.524--530 , 2008 . Conference Proceedings 1 Md. Ashaduzzaman, Shanto Roy, Shihabuz Zaman and Abu Ahmed Ferdaus \"Anomaly Detection in Admission or Selection Examinations using Data Mining Techniques.\" 2020 2nd International Conference on Sustainable Technologies for Industry 4.0 (STI) , pp. 1-6. 2020 . 2 Mahbuba Maliha Mourin, Abu Ahmed Ferdaus and Md Jakir Hossain \"Landslide Susceptibility Mapping in Chittagong District of Bangladesh using Support Vector Machine integrated with GIS.\" 2018 International Conference on Innovation in Engineering and Technology (ICIET) , pp. 1--5. 2018 . 3 Mahbuba Maliha Mourin, Abu Ahmed Ferdaus and Md Jakir Hossain \"Landslide Susceptibility Assessment in Chittagong District of Bangladesh Using Adaptive Neuro Fuzzy Inference System (ANFIS) and GIS.\" Proceedings of the International Conference on Disaster Risk Mitigation, Dhaka, Bangladesh , pp. 23--24. 2017 . Award Type Title Year Country Description No award information is found Abu Ahmed Ferdaus Associate Professor Department of Computer Science and Engineering Faculty of Engineering and Technology Email: ferdaus@du.ac.bd Phone: +88029670734",
  "content_length": 4475,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:47"
}