{
  "name": "Abusayeed Saifullah",
  "homepage": "https://www.abusayeedsaifullah.com",
  "status": "success",
  "content": "Abusayeed SaifullahSearch this siteEmbedded FilesSkip to main contentSkip to navigationAbusayeed   Saifullah            Associate ProfessorDepartment of  Computer Science              University of Texas at Dallas                  Email: MyFirstName.MyLastName   @UTDallas.eduPhone: (972) 883-4171Fax: (972) 883-2349800 W Campbell RdSuite ECSS 4.204Richardson, TX 75080Curriculum VitaeResearch StatementGoogle ScholarAssociate Editor          ACM Transactions on Cyber-Physical Systems Area Editor                                 Elsevier Pervasive and Mobile ComputingGuest Editor                                 IEEE Internet of Things 2020-21   IEEE Transac. on Industrial Informatics, 2016-18Workshop & Tutorial  Chair   ACM EWSN 2025 ACM EWSN 2024Program (Co)Chair  IEEE RTCSA 2025                          IEEE ICESS 2020Track Chair                                 IEEE ICCCN 2019TPC Member   RTSS, RTAS, SenSys, IoTDI, ICCPS, INFOCOM, MobiHoc, SECON, RTCSA, EWSN, DCOSS, IWQoS, MASS, RTNS, BigDataEducation:PhD, Washington University in St Louis, 2014Abusayeed Saifullah is an associate professor in the Department of Computer Science at University of Texas at Dallas. He received PhD in Computer Science and Engineering with Turner Dissertation Award under the supervision of Chenyang Lu from Washington University in St Louis. His research concerns Internet-of-Things, real-time and embedded systems, cyber-physical systems, and wireless networks. He has authored around 100 papers published mostly in top-notch ACM/IEEE conferences including RTSS, RTAS, IoTDI, SenSys, ICCPS, MobiHoc, INFOCOM, ICNP, and ICDCS, in ECRTS, and in IEEE/ACM Transactions including TON, TOSN, TPDS, TC, TECS, TII, TMC, and in IEEE Internet of Things journal.  His h-index  is 36 and he has a total citations of over 7,000 according to Google Scholar. He received ten Best Paper Awards and nominations in highly competitive conferences including ACM SenSys (2016), IEEE RTSS (2019, 2014, 2011), IEEE ICII (2018), IEEE RTAS (2012), and ACM EWSN (2021). He also received NSF  CAREER award (2019) and Wayne State University's  College of Engineering Faculty Research Excellence Award (2020). He is serving as a program co-chair of IEEE RTCSA 2025, served as a program chair of IEEE ICESS 2020, as a track chair of IEEE ICCCN 2019, and as a TPC member of ACM SenSys, IEEE RTSS, ACM/IEEE IoTDI, IEEE RTAS, ACM/IEEE ICCPS, ACM MobiHoc, and IEEE INFOCOM. He is an associate editor  of ACM Transactions on Cyber-Physical Systems and an area editor of Elsevier Pervasive and Mobile Computing.  Research InterestAbusayeed Saifullah's areas of interest and expertise include Internet of Things,  Real-Time and Embedded Systems, Wireless Networks, and  Cyber-Physical Systems. His  research addresses the grand challenges pertaining to timeliness, energy-efficiency, reliability,  scalability, and performance optimization in these areas considering applications in autonomous and connected systems, industrial process control, smart city, smart farming, smart manufacturing, data center management, and wide-area monitoring through novel theory and system design. Recent News [04/2025] My lab has multiple openings for fully-funded PhD positions. Prospective students interested in joining my lab are encouraged to reach out to me via email for more information.[04/2025] PhD candidate Aakriti has been named a Runner-up for Michael Conrad Award of the Department of Computer Science.[01/2025] RTCSA 2025 Call for Paper posted.[12/2024] EWSN 2025 Call for Workshops and Tutorials posted. [02/2024] Wayne State University ranks 5th in the US and 10th in the world in the embedded and real-time systems area in CS Rankings.  [04/2023]  ESL graduate Dali will join State University of New York - Binghamton as a tenure-track assistant professor in August 2023. Congratulations to Dali![01/2023] Received a new three-year grant ($302,308) from Department of Defense (ONR).[10/2022] Elisabeth defended her Masters thesis successfully. Congratulations to Elisabeth![08/2022] Our CNS medium proposal with UNLV on cache-aware parallel scheduling has been funded (total $1.2M) for four years by NSF. [01/2022] Received a new ONR grant ($303,631). Thanks to US Navy! [07/2021] PPoSS planning proposal has been funded ($163,796) by NSF. [6/2021] Ashik has successfully defended his PhD dissertation. Congratulations to Dr. Ashik![6/2021] Dali has successfully defended his PhD dissertation. Congratulations to Dr. Dali![02/2021] Nominated for the Best Paper Award at ACM EWSN 2021. Congratulations to Dali![02/2021] IEEE Internet of Things journal, Special Issue on Emerging Safety, Efficiency, and Security of Embedded Software and Systems on IoT . [07/2020] Received a new NSF CNS grant of $500,000 as single PI.[07/2020] Prashant will join University of Nevada, Las Vegas as an assistant professor in Fall 2020. [07/2020] Mahbub will join City University of New York as an assistant professor in Fall 2020. [07/2020] Mahbub has successfully defended his PhD dissertation on 7/20/2020. Congratulations, Dr. Mahbub![07/2020] Prashant has successfully defended his PhD dissertation on 7/20/2020. Congratulations, Dr. Prashant![Award] Received Faculty Research Excellence Award 2020 of the College of Engineering, Wayne State University [News Link].PhD candidate Venkata wins Michael Conrad Award 2020 of the Department of Computer Science.[Award] BEST STUDENT PAPER AWARD at IEEE RTSS 2019.Due to COVID-19, ICESS 2020 is postponed to December. New submission deadline is Jul 26. [Call for Paper] ICESS 2020 (The 16th IEEE International Conference on Embedded Software and Systems).[Award] Outstanding Paper Award at IEEE RTSS 2019[Service] Will serve as the program co-chair of IEEE ICESS 2020.[Call for Paper] Organizing a Special Issue of Elsevier Pervasive and Mobile Computing on mobile and social sensing. Please submit your work! [Award] Thrilled to receive NSF CAREER Award (2019) with a grant of $550,531 [News link]. PhD candidate Mahbubur wins Michael Conrad Award 2019 of the Department of Computer Science.[Award] BEST PAPER AWARD at IEEE ICII 2018.[Service] Co-chair, Wireless LAN, Ad Hoc, and Mesh Networks (WAM) track, IEEE ICCCN 2019.AwardsBest paper award candidate at ACM EWSN ’21Faculty Research Excellence Award 2020 of the College of Engineering.Best Student Paper Award at IEEE RTSS 2019NSF CAREER Award 2019Outstanding Paper Award at RTSS '19Best paper award at IEEE ICII ’18Best paper award candidate (one of the three best papers) at ACM SenSys ’16NSF CRII Award 20162014 Turner PhD Dissertation Award of Washington University’s CSE departmentThe best paper award at RTSS ’14 (The 35th IEEE Real-Time Systems Symposium)Best paper award candidate  (one of the three best papers) at RTAS ‘12 (The 18th IEEE Real-Time and Embedded Technology and Applications Symposium) The best student paper award at RTSS ’11 (The 32nd IEEE Real-Time Systems Symposium)The best student paper award at ISPA ‘07 (The 5th International Symposium on Parallel and Distributed Processing and Applications)Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 7119,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:48"
}