{
  "name": "Achim Streit",
  "homepage": "http://www.scc.kit.edu/personen/achim.streit.php",
  "status": "success",
  "content": "KIT - SCC - Über uns - Organisation - Abteilungen & Forschungsgruppen - Research Group Distributed and Parallel High Performance Systems Scientific Computing Center (SCC) StartseiteÜber unsOrganisationAbteilungen & ForschungsgruppenResearch Group Distributed and Parallel High Performance Systems SCCÜber unsDiensteForschungForschungsgroßgeräteStudiumVeranstaltungenStellenangeboteKontaktÜber unsAktuellesOrganisationPersonenArbeiten am SCCWomen in Science & ITKooperationen und MitgliedschaftenPublikationenRundgang durch das SCCKunst am BauSCC-InternOrganisationDirektoriumAbteilungen & ForschungsgruppenAbteilungen & ForschungsgruppenAnwendungen, Middleware und IT-ArchitekturCampus and Cloud ApplicationsClient and Service ManagementData Analytics, Access and ApplicationsData Exploitation MethodsFinanzen und AdministrationInformationssysteme für Organisation und betriebliche RessourcenInfrastructure ServicesNetwork, Cloud Infrastructure and Core ServicesScientific Computing and MathematicsScientific Computing & SimulationScientific Data ManagementComputational and Data Science in Materials ResearchResearch Group Computational Science and Mathematical MethodsResearch Group Distributed and Parallel High Performance SystemsMethods for Big DataResearch Group Multiscale Biomolecular SimulationJunior Research Group Robust and Efficient AIResearch Group Uncertainty QuantificationResearch Group Distributed and Parallel High Performance Systems Prof. Dr. Achim Streit Direktor upon request +49 721 608-25602 achim streit ∂does-not-exist.kit edu MS Teams-Chat ORCID Scientific Computing CenterHermann-von-Helmholtz-Platz 176344 Eggenstein-Leopoldshafen CV Publications Teaching Alumni Positions Further Activities Projects CV Since July 2010 Director of Scientific Computing Center (SCC), Karlsruhe Institute of Technology (KIT), Germany and Professor for Distributed and Parallel High Performance Systems, Institute of Telematics, Department of Informatics, Karlsruhe Institute of Technology (KIT), Germany July 2005 – June 2010 Head of Distributed Systems and Grid Computing, Jülich Supercomputing Centre (JSC, formerly named ZAM), Forschungszentrum Jülich, Germany January 2005 – June 2005 Scientist, Central Institute for Applied Mathematics (ZAM), Forschungszentrum Jülich, Germany November 1999 – December 2004 Scientist, Paderborn Center for Parallel Computing (PC²), University of Paderborn, Germany November 1999 – December 2003 PhD in computer science, University of Paderborn, Germany Title of Thesis: Self-Tuning Job Scheduling Strategies for the Resource Management of HPC Systems and Computational Grids October 1994 – September 1999 Student of computer science (Diploma) in combination with electrical engineering, University of Dortmund, Germany My Google Scholar page and results from DBLP. Below are my publications in KITopen from the KIT Library. KITopen Publications 2025 FDO-Ops: A Model for Machine-Actionable FAIR Digital Objects to Enhance InteroperabilityBlumenröhr, N.; Ost, P.-J.; Aversa, R.; Inckmann, M.; Kraus, F.; Streit, A.2025. MIT Pr. doi:10.5445/IR/1000185135 VolltextVolltext der Publikation als PDF-Dokument Accelerating Weather Forecasting: A Neural Network-Based Emulation of ISORROPIAEvangelopoulos, G.; Hoshyaripour, G.; Meyer, J.; Kumar, P.; Bruckert, J.; Streit, A.2025. IEEE International Conference on eScience (eScience), Chicago, IL, USA, 15-18 September 2025, 67–75, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/eScience65000.2025.00017 VolltextVolltext der Publikation als PDF-Dokument QML-Essentials–A Framework for Working with Quantum Fourier ModelsStrobl, M.; Franz, M.; Kuehn, E.; Mauerer, W.; Streit, A.2025. 2025 IEEE International Conference on Quantum Software (QSW),, July 7-12, Helsinki, Finland, 238–243, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/QSW67625.2025.00035 Beyond Backpropagation: Optimization with Multi-Tangent Forward GradientsFlügel, K.; Coquelin, D.; Weiel, M.; Debus, C.; Streit, A.; Götz, M.2025. 2025 International Joint Conference on Neural Networks (IJCNN), 8 S., Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/IJCNN64981.2025.11227446 Large-Scale Modeling of the Extracellular Matrix on Hybrid Supercomputers Using Highly Parallel Stencil ComputationsHerold, J.; Brinkmeier, P.; Götz, M.; Schug, A.; Streit, A.2025. ISC High Performance 2025 Research Paper Proceedings (40th International Conference), 14 S Energy Efficiency Analysis of Federated Learning: Insights from UAV-Based Thermal Imaging ApplicationsDuda, L.; Alibabaei, K.; Kozlov, V.; Berberi, L.; Vollmer, E.; Klug, L.; Benz, M.; Volk, R.; Gutiérrez Hermosillo Muriedas, J. P.; Goetz, M.; Sáinz-Pardo Díaz, J.; Lopez Garcia, A.; Schultmann, F.; Streit, A.2025, Juni 4. EGI Conference (2025), Santander, Spanien, 2.–6. Juni 2025 VolltextVolltext der Publikation als PDF-Dokument A Gold Standard Benchmark Dataset for Digital HumanitiesKraus, F.; Blumenröhr, N.; Götzelmann, G.; Tonne, D.; Streit, A.2025. OM-2024: The 19th International Workshop on Ontology Matching collocated with the 23rd International Semantic Web Conference (ISWC 2024), November 11th, Baltimore, USA, 1–17, RWTH Aachen VolltextVolltext der Publikation als PDF-Dokument Scaling Laws of Distributed Random ForestsFlügel, K.; Debus, C.; Götz, M.; Streit, A.; Weiel, M.2025. Transactions on Machine Learning Research VolltextVolltext der Publikation als PDF-Dokument QML-Essentials–A Framework for Working with Quantum Fourier ModelsStrobl, M.; Franz, M.; Kuehn, E.; Mauerer, W.; Streit, A.2025. doi:10.48550/arXiv.2506.06695 VolltextVolltext der Publikation als PDF-Dokument First Deployment of XCache for Workflow and Efficiency Optimizations on Opportunistic HPC Resources in GermanyHofsaess, R.; Giffels, M.; Gottmann, A.; Quast, G.; Petzold, A.; Schnepf, M.; Streit, A.2025. EPJ Web of Conferences, 337, Articel no: 01084. doi:10.1051/epjconf/202533701084 VolltextVolltext der Publikation als PDF-Dokument Feed-Forward Optimization With Delayed Feedback for Neural Network TrainingFlügel, K.; Coquelin, D.; Weiel, M.; Debus, C.; Streit, A.; Götz, M.2025. Neural Information Processing – 31st International Conference, ICONIP 2024, Auckland, New Zealand, December 2–6, 2024, Proceedings, Part IV. Ed.: M. Mahmud, 74 – 88, Springer Nature Singapore. doi:10.1007/978-981-96-6585-3_6 Exploring Federated Learning for Thermal Urban Feature Segmentation - A Comparison of Centralized and Decentralized ApproachesDuda, L.; Alibabaei, K.; Vollmer, E.; Klug, L.; Kozlov, V.; Berberi, L.; Benz, M.; Volk, R.; Gutiérrez Hermosillo Muriedas, J. P.; Götz, M.; Sáinz-Pardo Díaz, J.; López García, Á.; Schultmann, F.; Streit, A.2025. Computational Science and Its Applications – ICCSA 2025 : 25th International Conference, Istanbul, Turkey, June 30 – July 3, 2025, Proceedings, Part I. Ed.: O. Gervasi, 285–302, Springer Nature Switzerland. doi:10.1007/978-3-031-97000-9_18 Ordinal METAR Cloud Cover Classification in Sentinel-2 Satellite DataGötz, M.; Wessel, E.; Çayoğlu, U.; Jahani, B.; Debus, C.; Cermak, J.; Streit, A.2025. IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 18, 10674–10683. doi:10.1109/JSTARS.2025.3557931 VolltextVolltext der Publikation als PDF-Dokument 2024 FAIR Digital Objects for the Realization of Globally Aligned Data SpacesBlumenröhr, N.; Ost, P.-J.; Kraus, F.; Streit, A.2024. 2024 IEEE International Conference on Big Data (BigData), 15th -18th December 2024, Washington DC, USA., 374–383, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/BigData62323.2024.10825796 Harnessing Orthogonality to Train Low-Rank Neural NetworksCoquelin, D.; Flügel, K.; Weiel, M.; Kiefer, N.; Debus, C.; Streit, A.; Götz, M.2024. ECAI 2024 : 27th European Conference on Artificial Intelligence 19–24 October 2024, Santiago de Compostela, Spain Including 13th Conference on Prestigious Applications of Intelligent Systems (PAIS 2024 ; Proceedings. Ed.: U. Endriss, 2106–2113, IOS Press. doi:10.3233/FAIA240729 VolltextVolltext der Publikation als PDF-Dokument Comparative Study of Federated Learning Frameworks NVFlare and Flower for Detecting Thermal Bridges in Urban EnvironmentsDuda, L. J.; Alibabaei, K. F.; Vollmer, E.; Klug, L.; Benz, M.; Kozlov, V.; Rebekka Volk; Götz, M.; Schultmann, F.; Streit, A.2024, September 3. EGI Conference (2024), Lecce, Italien, 30. September–4. Oktober 2024 VolltextVolltext der Publikation als PDF-Dokument ReCycle: Fast and Efficient Long Time Series Forecasting with Residual Cyclic TransformersWeyrauch, A.; Steens, T.; Taubert, O.; Hanke, B.; Eqbal, A.; Götz, E.; Streit, A.; Götz, M.; Debus, C.2024. 2024 IEEE Conference on Artificial Intelligence (CAI), Singapore, Singapore, 25-27 June 2024, 1187–1194, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/CAI59869.2024.00212 Investigating Data Distribution Variability Across Devices in Federated Learning: Comparative Analysis of Algorithm PerformanceDuda, L.; Alibabaei, K.; Berberi, L.; Kozlov, V.; Streit, A.2024, Juni 12. Helmholtz Artificial Intelligence Conference (Helmholtz AI 2024), Düsseldorf, Deutschland, 12.–14. Juni 2024 VolltextVolltext der Publikation als PDF-Dokument Federated Learning for Urban Energy Efficiency: Detecting Thermal with UAV-based Imaging and AIDuda, L. J.; Alibabaei, K.; Vollmer, E.; Klug, L.; Benz, M.; Kozlov, V.; Volk, R.; Goetz, M.; Schultmann, F.; Streit, A.2024, Juni 12. Helmholtz Artificial Intelligence Conference (Helmholtz AI 2024), Düsseldorf, Deutschland, 12.–14. Juni 2024 VolltextVolltext der Publikation als PDF-Dokument A Comparative Study of Pruning Methods in Transformer-based Time Series ForecastingKiefer, N.; Weyrauch, A.; Öz, M.; Streit, A.; Götz, M.; Debus, C.2024. arxiv. doi:10.48550/arXiv.2412.12883 VolltextVolltext der Publikation als PDF-Dokument AB-Training: A Communication-Efficient Approach for Distributed Low-Rank LearningCoquelin, D.; Flügel, K.; Weiel, M.; ",
  "content_length": 130363,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:53"
}