{
  "name": "Ada Gavrilovska",
  "homepage": "http://www.cc.gatech.edu/home/ada",
  "status": "success",
  "content": "Ada Gavrilovska Ada Gavrilovska Ada Gavrilovska is a Professor in the School of Computer Science at Georgia Tech. Her research is focused on designing systems for emerging technologies, and she develops new systems software solutions in response to new hardware, applications, and use cases. Her past research has considered the impact on systems software from programmable network processors, high-performance interconnects, multi/manycores, virtualization and cloud computing. Her recent research is driven by two major trends rooted in the exponential growth in demand for data and for ever-faster insights from such data – the proliferation of new memory system designs, and the shift to edge computing. She has served as program or general chair for OSDI’24, SOCC’22, HPDC’22, USENIX ATC’20, as an Associate Editor for the IEEE Transactions on Cloud Computing and the ACM Transactions of Computer Systems. Gavrilovska’s research has been supported by the NSF, the Department of Energy, the Semiconductor Research Corporation, and by multiple industry awards, including from Cisco, HPE, IBM, Intel, Intercontinental Exchange, LexisNexis, VMware, and others. She is currently a PI and Systems Software co-lead in the SRC/DARPA center for Processing with Intelligent Storage and Memories (PRISM). Attaining High Performance Communications: A Vertical Approach, editor, Ada Gavrilovska, Sep. 2009 Affiliations: School of Computer Science, College of Computing, Georgia Tech SRC JUMP Center for Processing with Intelligent Storage and Memory (PRISM), PI SRC JUMP Center on Applications Driving Architecturs (ADA Center), PI Center for Experimental Research in Computer Systems - CERCS Service: USENIX Symposium on Operating Systems Design and Implementation (OSDI), Santa Clara, CA, Jul. 2024, PC Co-Chair Research & Students: More information on ongoing research projects can be found on the webpages of the PhD students I currently work with: Current PhD students: Rajveer Bachkaniwala (advised by Kexin Rong) Vaibhav Bhosale (with Ketan Bhardwaj) Dhruv Garg (with Alexey Tumanov) Vima Gupta (with Anand Iyer) Jin Heo Suyeon Lee Tony Mason (at UBC, with Margo Seltzer, Sasha Fedorova) Rafael Oliveira Matteo Olivi Misun Park Vishal Rao Vijay Thurimella Ranjan Sarpangala Venkatesh (with Greg Eisenhauer) Research Scientist: Ketan Bhardwaj Graduated PhD Students: James (Jim) Choncholas, PhD Thesis: \"Systems Ascribing Privacy to Optimization Methods\", 2025, Google Ke-Jou (Carol) Hsu, PhD Thesis: \"Systems Support for Fine-grained Resource Management in Mobile Edge Computing\", 2024 Harshit Daga, PhD Thesis: \"System Support for Collaborative Learning in Distributed Edge Cloud Environments\", 2023, Nokia Bell Labs Thaleia-Dimitra Doudali, PhD Thesis: \"Adding Machine Intelligence to Hybrid Memory Management\", 2021, IMDEA, Spain Pradeep Fernando, PhD Thesis: \"Adding Persistence to Main Memory Programming\", 2020, Facebook Hobin Yoon, PhD Thesis: \"Cost-configurable Cloud Storage System Architecture Designs\", 2019, Google Alex Merritt, PhD Thesis: \"Efficient Programming of Massive-Memory Machines\", 2017, Intel Ketan Bhardwaj, PhD Thesis: \"Frame, Rods and Beads of the Edge Computing Abacus\", 2016, Georgia Tech Sudarsun Kannan, PhD Thesis: \"OS Support for Heterogeneous Memory Management\", 2016, Rutgers University Adit Ranadive, PhD Thesis: \"Virtualized Resource Management in High Performance Fabric Clusters\", 2015, VMware Mukil Kesavan, PhD Thesis: \"Scalable and Robust Compute Capacity Multiplexing in Virtualized Datacenters\", 2014, Google Priyanka Tembey, PhD Thesis: \"Virtual Platforms: Achieving Performance and Isolation Properties in Shared Multicore Servers\", 2013, VMware Current and Recent MS Students: Mayur Peshve Tejas Shimpi Richi Dubey Nikhil Ram Shashidhar Daniel Zahka, (MS'22, Google) Jimin Lee, (MS'22, SKHynix) Aastha Agrawal, (MS'21, Salesforce) Yiwen Chen, (MS'21, Amazon) Sreepraneeth Kotaguddam, (MS'21, VMware) Matt Saunders (MS'19, Uptake) Mangala Khandekar (MS'19, Amazon) Nikita Juneja (MS'18, Apple) Nitish Bhat (MS'16, VMware) Pankaj Mistry (MS'16, Intel) Teaching: Current (Fall'21): CS7210 Distributed Computing -- on campus and in the OMSCS program CS6200 Graduate Intro to Operating Systems -- in CS Online MS program Upcoming (Spring'22): CS4210/CS6210 Advanced Operating Systems CS7210 Distributed Computing -- in CS Online MS program only Past: CS7210 Distributed Computing: Spring'21, Spring'20, Fall'18 CS8803-ECI Edge Computing and IoT: Fall'20, Fall'17 CS6210/CS4210 Advanced Operating Systems: Fall'19, Spring'19, Spring'18, Spring'17, Fall'14, Spring 2011, Fall 2010 (@Korea University), Fall 2008, Fall 2007 CS6200 Graduate Introduction to Operating Systems: Spring'15 - present (in OMS program), Fall 2012, Fall 2011, Fall 2009, Spring 2009, Fall 2008 (used to be CS8803-GOS) CS4210 Advanced Operating Systems: Spring 2009, Fall 2008, Spring 2008, Fall 2006, Summer 2006, Spring 2006, Summer 2005, Summer 2004 CS4803/8803HPC High Performance Communication: Spring 2008, Fall 2006, Spring 2005 CS8803 High Performance Communication -- Korea Embedded Computing MS Program: Summer 2007 (@Korea University) CS3300 Introduction to Software Engineering: Fall 2005 CS4240 Compilers and Interpreters: Fall 2004 Select publications: Grudon: A System for Deploying Graph Analytics on Disaggregated Architectures with Near-Data Processing, Vishal Suresh Rao, Nikjil Ram Shashidhar, Suyeon Lee, Ada Gavrilovska, ACM Symposium on High Performance Parallel and Distributed Computing (HPDC’25), Notre Dame, IN, Jul. 2025. KriOS: Scheduling Abstractions and Mechanisms for Enabling a LEO Compute Platform, Vaibhav Bhosale, Ada Gavrilovska, Ketan Bhardwaj, ACM Symposium on Cloud Computing (SoCC’24), Redmond, WA, Nov. 2024. Colibri: Fine-grained, Lightweight, Resource Introspection in MEC, Ke-Jou Carol Hsu, Ketan Bhardwaj, Ada Gavrilovska, ACM/IEEE Symposium on Edge Computing (SEC’24), Rome, Italy, Dec. 2024. Toward Disaggregated NDP Architectures for Large-Scale Graph Analytics, Suyeon Lee, Vishal Suresh Rao, Ada Gavrilovska, RESDIS@SC'24, Atlanta, GA, Nov. 2024. LOTUS: Fine-grained Profiling for Machine Learning Data Preprocessing in PyTorch, Rajveer Bachkaniwala, Kexin Rong, Ada Gavrilovska, IEEE International Symposium on Workload Characterization (IISWC’24), Vancouver, CA, Sep. 2024. Optimizing Metadata Exchange: Leveraging DAOS for ADIOS Metadata I/O, Ranjan Sarpangala Venkatesh, Greg Eisenhauer, Norbert Podhorszki, Dmitry Ganyushin, Scott Klasky, Ada Gavrilovska, Proceedings of the International Supercomputing Conference (ISC’24), Hamburg, Germany, May 2024 Snail: Secure Single Iteration Localization, James Choncholas, Pujith Kachana, Andre Matheus, Greg Philipps, Ada Gavrilovska, Proceedings on Privacy Enhancing Technologies Symposium (PoPETS’24), Bristol, UK, Jul. 2024. Angler: Dark Pool Resource Allocation, James Choncholas, Ketan Bhardwaj, Vlad Kolesnikov, Ada Gavrilovska, ACM/IEEE Symposium on Edge Computing (SEC’23), Wilmington, DE, Dec. 2023. Flame: Simplifying Topology Extension in Federated Learning, Harshit Daga, Jaemin Shim, Dhruv Garg, Myungjin Lee, Ada Gavrilovska, Ramana Kompella, ACM Symposium on Cloud Computing (SoCC’23), Santa Cruz, CA, Oct. 2023 RETROSPECTIVE: HeteroOS: OS Design for Heterogeneous Memory Management in Datacenters, Sudarsun Kannan, Ada Gavrilovska, selected as part of ISCA-50 25 year retrospective, Jun. 2023 CLUE: Systems Support for Knowledge Transfer in Collaborative Learning with Neural Nets,\tHarshit Daga, Yiwen Chen, Aastha Agrawal, Ada Gavrilovska, IEEE Transactions on Cloud Computing, 2023 Beacons: An End-to-end Framework for Predicting and Utilizing Loop Characteristics, Girish Mururu, Chris Porter, Bhodistawa Chatterjee, Chao Chen, Sharjeel Khan, Ada Gavrilovska, Santosh Pande, ACM SIGPLAN Conference on Object-Oriented Programming Systems, Languages and Applications (OOPSLA’23), Cascais, Portugal, Oct. 2023 In-network Compression for Accelerating IoT Analytics at Scale, Rafael Oliveira, Ada Gavrilovska, IEEE Hot Interconnects (HotI'23), Aug. 2023 Don’t Let Your LEO Edge Fade at Night, Vaibhav Bhosale, Ketan Bhardwaj, Ada Gavrilovska, Workshop on Hot Topics in Systems Infrastructure (HotInfra’23), Orlando, FL, Jun. 2023 PinIt: Influencing OS Scheduling via Compiler-Induced Affinities, Girish Mururu, Kangqi Ni, Ada Gavrilovska, Santosh Pande, 24th ACM International Conference on Languages, Compilers and Tools for Embedded Systems (LCTES’23), Orlando, FL, Jun. 2023 FleXR: Flexible Edge-Assisted XR, Jin Heo, Ketan Bhardwaj, Ada Gavrilovska, ACM Multimedia Systems (MMSys’23), Vancouver, CA, Jun. 2023 Pocket: ML Serving from the Edge, Misun Park, Ketan Bhardwaj, Ada Gavrilovska, EuroSys'23, Rome, Italy, May 2023 A Characterization of Route Variabilty in LEO Satellite Networks, Vaibhav Bhosale, Ahmed Saeed, Ketan Bhardwaj, Ada Gavrilovska, Proceedings of the Passive and Active Measurement Conference (PAM'23), Mar. 2023. ShapeShifter: Resolving the Hidden Latency Contention Problem in MEC, Valentin Rakovic, Ke-Jou Hsu, Ketan Bhardwaj, Ada Gavrilovska, Liljana Gavrilovska, ACM/IEEE Symposium on Edge Computing (SEC'22), Seattle, WA, Dec. 2022 FLiCR: A fast and lightweight lidar point cloud compression based on lossy RI, Jin Heo, Christopher Phillips, Ada Gavrilovska, ACM/IEEE Symposium on Edge Computing (SEC'22), Seattle, WA, Dec. 2022 FAM-Graph: Graph Analytics on Disaggregated Memory, Daniel Zahka, Ada Gavrilovska, IEEE Int'l Parallel and Distributed Processing Symposium (IPDPS'22), Jun. 2022. Coeus: Clustering (A) like Patterns for Practical Machine Intelligent Hybrid Memory Management, Thaleia Doudali, Ada Gavrilovska, IEEE CCGrid'22, Taormina, Italy, May. 2022 Cronus: Computer Vision-based Machine Intelligent Hybrid Memory Management, Thaleia Doudali, Ada Gavrilovska, MEMSYS'21, Dec. 2021. Cori: Dancing to the Right Beat of Periodic Data Movements over Hybrid Memory Systems, Thaleia Dimitra Doudali, Daniel Zahka, Ada Gavrilovska, 35th ",
  "content_length": 32565,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:56"
}