{
  "name": "Adams Wai-Kin Kong",
  "homepage": "https://www3.ntu.edu.sg/home/adamskong",
  "status": "success",
  "content": "ï»¿ Adams Kong Nanyang Technological University Home Education Employment History Media Coverage & Showcases Awards and Honors Professional Activities Research Team Publications and Patents Acknowledgement Databases & Codes Videos On-line Courses Adams Wai Kin Kong Associate Professor College of Computing and Data Science Nanyang Technological University Nanyang Avenue, Singapore, 639798 Office: N4-02a-017 Tel: 65-6513-8041 Fax: 65-6792-6559 E-mails: adamskong AT ntu.edu.sg  / adamskong AT ieee.org Biography Dr. Adams Wai-Kin Kong received the Ph.D. degree from the University of Waterloo, Canada. Currently, he is an associate professor at the Nanyang Technological University, Singapore and the director of Master of Science in Artificial Intelligence programme. His research works have been published in major AI conferences and journals. One of his papers was selected as a spotlight paper by IEEE Transactions on Pattern Analysis and Machine Intelligence and another one was selected as Honorable Mention by Pattern Recognition. He is listed in Stanford University's Top 2% Scientistsâ Study. His PhD students received Best Student Paper Awards in The IEEE Fifth International Conference on Biometrics: Theory, Applications and Systems (BTAS), 2012 and IEEE International Conference on Bioinformatics and Bioengineering, 2013. In 2016, he received the best reviewer award from BTAS. In the summer of 2008, he served as an expert witness to the U.S. Department of Justice for the child sexual abuse case, United  States v, Michael Pepe. He also serves as a consultant for other legal cases in Singapore and as an associate editor for IEEE Transactions on Information Forensics and Security. In 2022, Dr. Kong was nominated for the MSc in Business Analytics Teacher of the Year Award and received faculty award from his school. His recent research interests include pattern recognition, deep learning and their applications on power systems, healthcare, and biometrics. What's New Want to study PhD at NTU Please click Research fellow and Research Associate Openings Hao Zhou, Xiaobao Guo, Yuzhe Zhu, and Adams Wai-Kin Kong, âMACS: Multi-source Audio-to-image Generation with Contextual Significance and Semantic Alignmentâ, AAAI, 2026 Zhiyuan Zhou, Yueming Yin, Yiming Yang, Yuguang Mu, Hoi-Yeung Li, and Adams Wai Kin Kong âEnhancing Bioactivity Prediction via Spatial Emptiness Representation of Protein-ligand Complex and Union of Multiple Pocketsâ, NeurIPS, 2025 Leyang Li, Shilin Lu, Yan Ren, Adams Wai-Kin Kong, âSet You Straight: Auto-Steering Denoising Trajectories to Sidestep Unwanted Conceptsâ, ACM MM 2025 Min Dang, Gang Liu, Jingqi Zhao, Adams Wai-Kin Kong, Nan Luo, Di Wang, â DDFD: Diffusion-Based Denoising Fusion for Object Detection in Infrared-Visible Imagesâ, ACM MM 2025 Jeremy Andrew Styborski, Mingzhi Lyu, Jiayou Lu, Nupur Kapur, and Adams Wai Kin Kong, âWhen and where do data poisons attack texture inversionâ ICCV, 2025 Wei Xian Lim, Jessica Sher En Loh, Lv Yu, Adams Wai Kin Kong, and Wai Lee Chan, âAccelerating Fluid Simulations with Graph Convolution Network Predicted Flow Fieldsâ, Aerospace Science and Technology, 2025 Ernest Chew, Adams Kong, and Joo Hwee Lim, âA Unified Model for Paragraph and Line-level Handwritten Text Recognitionâ, ICDAR. 2025 (oral) Yew Lee Tan, Ernest Yu Kai Chew, Jung-jae Kim and Adams Wai-Kin Kong, âDual Downsample Vision Transformer for Handwritten Text Recognitionâ, ICDAR. 2025 (Oral) Shifeng Xu, Yanzhu Liu and Adams Wai Kin Kong, âVariance-Reduction Guidance: Sampling Trajectory Optimization for Diffusion Modelsâ ICME, 2025 (oral) Mingzhi Lyu, Yi Huang, Jun Xie, Zhiao Zhao, Hong Xu and Adams Wai Kin Kong, âTransferable Attack against Face Swapping in an Extended Spaceâ, ICME, 2025 (oral) Shilin Lu, Zihan Zhou, Jiayou Lu, Yuanzhi Zhu and Adams Wai Kin Kong, âRobust Watermarking Using Generative Priors Against Image Editing: From Benchmarking to Advancesâ ICLR, 2025 Shifeng Xu, Yanzhu Liu and Adams Wai-Kin Kong, âEasing Training Process of Rectified Flow Models Via Lengthening Inter-Path Distanceâ, ICR, 2025 (spotlight) Ernest Yu Kai Chew, Adams Kong and Joo-Hwee Lim, âImproving Word Error Rates in Paragraph Handwritten Text Recognition with Synthetic Dataâ, ICASSP 2025 Zhiyuan Zhou, Yueming Yin, Hao Han, Yiping Jia, Jun Hong Koh, Adams, Wai-Kin Kong and Mu, Yuguang, \"ProAffinity-GNN: A Novel Approach to Structure-based Protein-Protein Binding Affinity Prediction via a Curated Dataset and Graph Neural Networks\" Journal of Chemical Information and Modeling, 2024. Yueming Yin, Hilbert Yuen In Lam, Yuguang Mu, Hoi Yeung Li, and Adams Wai Kin Kong, âAdvancing Bioactivity Prediction through Molecular Docking and Self-Attention, IEEE Journal of Biomedical and Health Informatics, 2024 Yi Huang, Mingzhi Lyu, Jeremy Andrew Styborski and Adams Kong, Leveraging Imperfect Restoration for Data Availability Attack, ECCV, 2024 Jeremy Andrew Styborski, Mingzhi Lyu, Yi Huang and Adams Kong, Exploiting Supervised Poison Vulnerability to Strengthen Self-Supervised Defense, ECCV, 2024 Yan Ren, Yanling Li and Adams Kong, Adaptive Multi-task Learning for Few-shot Object Detection, ECCV, 2024 Jessica Sher En Loh, Naheed Anjum Arafat, Wei Xian Lim, Wai Lee Chan and Adams Kong âFinite Volume Features, Global Geometry Representations, and Residual Training for Deep Learning-based CFD Simulationâ, ICML, 2024  (spotlight) Yueming Yin, Haifeng Hu, Jitao Yang, Chun Ye, Wilson Wen Bin Goh, Adams Wai-Kin Kong and Jiansheng Wu, âOLB-AC: Towards Optimizing Ligand Bioactivities Through Deep Graph Learning and Activity Cliffs, Bioinformatics, 2024 Wei Xian Lim, Naheed Anjum Arafat, Wai Lee Chan and Adams Kong, âMulti-Order Loss Functions for Accelerating Unsteady Flow Simulations with Physics-Based AIâ, IEEE CAI 2024 Shilin Lu, Zilan Wang, Leyang Li, Yanzhu Liu, and Adams Kong, âMACE: Mass Concept Erasure in Diffusion Modelsâ, CVPR 2024 Wenwei Song, Wenxiong Kang, Adams Wai Kin Kong, Yufeng Zhang, Yitao Qiao, âLinear Adaptive Additive Angular Margin Loss for Video-based Hand Gesture Authenticationâ, International Journal of Computer Vision, 2024 Yanling Li, Steven Thng, and Adams Wai Kin Kong, \"Bridging the Gap between Vitiligo Segmentation and Clinical Scores\", IEEE Journal of Biomedical and Health Informatics, 2024 Bingzhi Chen, Yishu Liu, Zheng Zhang, Guangming Lu and Adams Wai Kin Kong, â TransAttUnet: Multi-Level Attention-Guided U-Net With Transformer for Medical Image Segmentation \" IEEE Transactions on Emerging Topics in Computational Intelligence, 2024 Mingzhi Lyu, Huang Yi and Adams Kong, âAdversarial Attack for Robust Watermark Protection Against Inpainting-based and Blind Watermark Removersâ, ACM MM, 2023 Shilin Lu, Yanzhu Liu, and Adams Kong, âTF-ICON: Diffusion-Based Training-Free Cross-Domain Image Composition â, ICCV 2023 Xiaobao Guo, Nithish Muthuchamy Selvaraj, Zitong Yu, Adams Kong, Bingquan Shen and Alex Kot, ââAudio-Visual Deception Detection: DOLOS Dataset and Parameter-Efficient Crossmodal Learningâ, ICCV, 2023 Nithish Muthuchamy Selvaraj, Xiaobao Guo, Adams Kong, Bingquan Shen and Alex Kot, \"Adapter Incremental Continual Learning of Efficient Audio Spectrogram Transformers\" INTERSPEECH 2023 Fan Wang and Adams Kong, âA Practical Upper Bound for the Worst-Case Attribution Deviationsâ, CVPR, 2023 Xiaobao Guo, Alex Kot and Adams Kong, \"Pace-adaptive and Noise-resistant Contrastive Learning for Multimodal Feature Fusion\". IEEE Transactions on Multimedia, 2023 (accepted) Yan Ren received HSE Champion award from Rolls-Royce@NTU Corporate Fan Wang received NeurIPS 2022 Scholar Award. Adams received 2022 SCSE Faculty Award Fan Wang and Adams Kong, \"Exploiting the Relationship Between Kendall's Rank Correlation and Cosine Similarity for Attribution Protection\", NeurIPS 2022 Yew Lee Tan,  Adams Kong, and Jung-jae Kim, \"Pure Transformer with Integrated Experts for Scene Text Recognition\", ECCV 2022 Yi Huang and Adams Kong, âTransferable Adversarial Attack based on Integrated Gradientsâ ICLR, 2022 Xiaobao Guo, Adams Wai-Kin Kong, and Alex Kot Deep Multimodal Sequence Fusion by Regularized Expressive Representation Distillation, IEEE Transactions on Multimedia, 2022 Yan Ren, Adams Kong, and Yi Wang, \"Real-time Shipboard Power Management based on Monte-Carlo Tree Search\" IEEE Transactions on Power Systems, 2022 Yanzhu Liu, Shreya Datta, Adams Wai-Kin Kong and Chai Kiat Yeo, âAn Image Inpainting Approach to Short-term Load Forecastingâ, IEEE Transactions on Power Systems, 2022 Thant Zin Oo and Adams Wai-Kin Kong, \"Real-time Energy Management for Marine Applications using Markov Approximation\" IEEE Transactions on Power Systems, 2022 Thant Zin Oo, Yan Ren, Adams Wai-Kin Kong, Yi Wang, and Xiong Liu, âPower System Design Optimization for a Hybrid-Shaft Generator Ferryâ, IEEE Transactions on Power Systems, 2022 Xingpeng Xu, Shitala Prasad, Kuanhong Cheng and Adams Wai Kin Kong, âUsing Double Attention for Text Tattoo Localizationâ, IET Biometrics, 2022 Yew Lee Tan, Ernest Chew, Adams Kong, Jung-jae Kim, Joo-Hwee Lim, \"Portmanteauing Features for Scene Text Recognition\", ICPR, 2022. Zechen Wang, Liangzhen Zheng, Sheng Wang, Mingzhi Lin, Zhihao Wang, Adams Wai-Kin Kong, Yuguang Mu, Yanjie Wei, Weifeng Li, âA fully differentiable ligand pose optimization framework guided by deep learning and a traditional scoring function'', Briefings in Bioinformatics, 2022 Hai Tao Xue, Michael Stanley-Baker, Adams Wai Kin Kong, Hoi Leung Li, Wilson Wen Bin Goh, âData considerations for predictive modelling applied to the discovery of bioactive natural productsâ , Drug Discovery Today, 2022",
  "content_length": 9754,
  "method": "requests",
  "crawl_time": "2025-12-01 12:29:07"
}