{
  "name": "Adam Smith 0006",
  "homepage": "http://cs-people.bu.edu/ads22",
  "status": "success",
  "content": "Adam D. Smith's home page Adam D. Smith Professor Departments of Computer Science and Electrical and Computer Engineering Data Science Faculty Fellow Founding member, Faculty of Computing and Data Sciences Boston University Ph.D. (MIT), 2004 Contact: Email: ads22 concatenated with bu, dot, and edu Phone: +1 (617) 358-2596 (email works better; use Piazza for course questions) Office: CDS 1038, 665 Commonwealth Ave, Boston, MA 02215 Biographical: CV, short bio, photos (2006, 2009, 2014, 2016). My mostly defunct blog: Oddly Shaped Pegs Research Papers, talk slides and videos Teaching Courses, students, info for prospective students Big News May 2022: Avrim Blum, Irit Dinur, Cynthia Dwork, Frank McSherry, Kobbi Nissim and I received the 2021 ACM Paris Kanellakis Theory and Practice Award. May 2019: Yevgeniy Dodis, Leo Reyzin and I won the Eurocrypt 2019 Test of Time Award for our Eurocrypt 2004 paper that defined fuzzy extractors. Rafi Ostrovsky joined us on the journal version. We would have liked to share the award with him, but the committee limited the award to the authors of the original conference paper. Spring 2019: I co-organized a semester-long program on data privacy at the Simons Institute at UC Berkeley, which brought together 50 or so researchers at all levels of seniority, with expertise ranging across computer science, statistics, philosophy, and law. We ran five workshops, each of which has excellent videos of the talks (1, 2, 3, 4, 5). Aaron Roth and I parallel-taught a class on adaptive data analysis in Fall 2017; see adaptivedataanalysis.com for lecture notes and other course materials. August 2017: Sofya Raskhodnikova and I moved to Boston University! We are very excited to be back in the area, contributing to a dynamic and growing department. Join us! Our paper Calibrating Noise to Sensitivity in Private Data Analysis (with Cynthia Dwork, Frank McSherry and Kobbi Nissim), which introduced differential privacy, won the 2017 Gödel Prize for outstanding papers in the area of theoretical computer science. Other News In Spring 2021, Jon Ullman and I co-taught Foundations of Private Data Analysis jointly between Northeastern and BU. See the website for draft lecture notes and videos. I am organized (with Vitaly Feldman, Aaditya Ramdas, and Aaron Roth) a workshop on adaptive data analysis at NIPS 2016 in Barcelona (following up on the 2015 edition). July 1, 2016: I am a Professor, without qualification, of Computer Science and Engineering. January 2016: Our paper Calibrating Noise to Sensitivity in Private Data Analysis (from TCC 2006) received the 2016 TCC Test of Time Award at TCC 2016-A in Tel Aviv. Our project webpage for NSF award IIS-1447700 is now live. I am leading the Security and Privacy connector of the NSF's Northeast Big Data Hub. I co-chaired (with Martin Hirt) the program committee of the Theory of Cryptography Conference (TCC 2016-B), held in Beijing, China in November 2016. (The \"B\" in the name comes from the fact that TCC is shifting from January/February to November/December, and so the conference will occur twice in 2016.) I am organizing (with Vitaly Feldman, Moritz Hardt, and Aaron Roth) a workshop on adaptive data analysis at NIPS 2015 in Montreal, Canada. I was on sabbatical during 2013-2014 at Boston University (mostly) and Harvard. While at BU, we (Sofya Raskhodnikova, Kobbi Nissim, myself and several BU faculty) at RISCS hosted two workshops at the Hariri Institute for Computing, which supported both us and the workshops: Charles River Privacy Day, November 2013. Charles River Workshop on Private Analysis of Social Networks, May 2014. Aaron Roth and I organized the DIMACS Workshop on Recent Work on Differential Privacy across Computer Science, October 23-26, 2012. Check out the awesome video tutorials. I gave a tutorial on privacy in statistical databases at CRYPTO 2012 (slides (pdf, 15.7 MB)). Trent Jaeger, Jon Katz and I ran a summer school on cryptography, May 30-June 1, 2012 at Penn State. I was the program chair for ICITS 2012. Proceedings are now online (via Springer). July 1, 2010: Promoted to associate professor with tenure. One day, if I'm lucky, I'll be a completely unqualified professor. February 2010: I co-organized a workshop on Statistical and Learning-Theoretic Challenges in Data Privacy (February 22-26, 2010) at IPAM. More about the workshop here. January 2010: Presidential Early Career Award for Scientists and Engineers (PECASE), for my NSF CAREER proposal on Rigorous Foundations for Data Privacy. About me I joined BU Computer Science in Fall 2017. From 2007 to 2017, I was a (assistant, then associate, then full) professor of Computer Science and Engineering at the Pennslyvania State University, where I was part of the Theory of Computation and the Systems and Internet Infrastructure Security (SIIS) groups. During Fall 2006, before coming to Penn State, I was Securing Cyberspace at UCLA's IPAM. Previously, I was a post-doc at the Weizmann Institute in Rehovot, Israel, hosted by Moni Naor. Before that, I did a Ph.D. in the Computer Science and AI Lab at MIT, under the supervision of Madhu Sudan. Last modified: Fri Jan 20 12:56:46 EST 2023 Adam Smith",
  "content_length": 5198,
  "method": "requests",
  "crawl_time": "2025-12-01 12:29:07"
}