{
  "name": "Adam Belay",
  "homepage": "https://engineering.mit.edu/faculty-research/year-2017",
  "status": "success",
  "content": "MIT School of Engineering | » New Faculty (2017) Home>> Faculty & Research>> New Faculty (2017) New Faculty (2017) Adam Belay will join the Department of Electrical Engineering and Computer Science as an assistant professor in July 2017. He holds a PhD in computer science from Stanford University, where he was a member of the secure computer systems group and the multiscale architecture and systems team. Previously, he worked on storage virtualization at VMware Inc. and contributed substantial power-management code to the Linux Kernel project. Belay’s research area is operating systems and networking. Much of his work has focused on restructuring computer systems so that developers can more easily reach the full performance potential of hardware. He received a Stanford graduate fellowship, a VMware graduate fellowship, and an OSDI Jay Lepreau best paper award. https://engineering.mit.edu/wp-content/uploads/blank-profile-picture-330x330.png Website Adam Belay Electrical Engineering and Computer Science # Matteo Bucci will join the Department of Nuclear Science and Engineering (NSE) faculty as an assistant professor in the fall of 2016. He received his PhD in nuclear engineering from the University of Pisa in Italy in 2009. A research scientist in NSE since 2015, Bucci was previously at Commissariat à l’énergie atomique in France, where he led several research projects in experimental and computational thermal-hydraulics for light water reactors and sodium fast reactors. His research will focus in two main areas: heat transfer nanoengineering innovations to improve the safety and economic competitiveness of nuclear reactors, and advanced diagnostics and intelligent systems to improve situational awareness, fault detection and diagnostics, and anticipated failures in nuclear power plants. Bucci is an active member of the Consortium for Advanced Nuclear Energy Systems, one of the MIT’s eight Low-Carbon Energy Centers. https://engineering.mit.edu/wp-content/uploads/bucci.jpg Website Matteo Bucci Nuclear Science and Engineering # Luca Carlone joins the Department of Aeronautics and Astronautics as the Charles Stark Draper Assistant Professor this month. He will also be a principal investigator in the Laboratory for Information and Decision Systems (LIDS). Carlone received his PhD from the Polytechnic University of Turin in 2012, with a thesis entitled “Nonlinear Estimation Techniques for Autonomous Navigation in Single and Multi-robot Systems.” A research scientist at LIDS since 2016, Carlone first came to MIT as a postdoc in 2015, after two years as a postdoc at Georgia Tech. Carlone’s research interests include nonlinear estimation, numerical and distributed optimization, and probabilistic inference applied to sensing, perception, and decision making in single and multirobot systems. He is the recipient of several best-paper awards in his field. https://engineering.mit.edu/wp-content/uploads/Luca_Carlone_36-330x330.gif Website Luca Carlone Aeronautics and Astronautics https://engineering.mit.edu/faculty/luca-carlone/ Tal Cohen will join the Department of Civil and Environmental Engineering as an assistant professor in November 2016. After she received her PhD in aerospace engineering in 2013 from Technion University in Israel, she came to MIT for a two-year postdoctoral position in the Department of Mechanical Engineering. She is currently a postdoc at the School of Engineering and Applied Sciences at Harvard University. Cohen works in mechanics, especially the mechanics of structures subjected to extreme loading conditions and shock wave propagation. Her work on the mechanics of stretchable materials that can undergo extreme deformations up to loss of stability, and on the mechanics of growth in both biology and engineering, exploits analogies with related fields. By employing complex nonlinear material models, Cohen’s research group will focus on deriving theoretical models that can significantly affect our understanding of observed phenomena but are still simple enough to be applied in design or characterization of materials. https://engineering.mit.edu/wp-content/uploads/Tal_Cohen_3-330x330.jpg Website Tal Cohen Civil and Environmental Engineering # David Des Marais joined the Department of Civil and Environmental Engineering as an assistant professor in October. He received his BA in integrative biology from the University of California at Berkeley, in 2000, studying plant diversity and evolution, and a PhD in biology from Duke University. His dissertation addressed how multifunctional proteins evolve within and between species. Des Marais did postdoctoral research at the University of Texas at Austin, where he was awarded a fellowship from the U.S. Department of Agriculture’s National Institute of Food and Agriculture to investigate plant responses to multiple environmental stresses experienced concurrently. Most recently, he was a principal investigator in the Department of Organismic and Evolutionary Biology at Harvard, as well as a senior fellow at the Arnold Arboretum. Des Marais’ research interests are in plant ecophysiology, evolutionary biology, and functional genomics. He is particularly interested in plant interactions with the abiotic environment — water, temperature, nutrients, and light — and how plants respond when these factors impose stress. He studies natural diversity within and between plant species both in the field and in controlled environments, and he hopes to develop a mechanistic understanding or plant performance to conserve natural plant populations and to improve agricultural productivity and sustainability. https://engineering.mit.edu/wp-content/uploads/David_Des_Marais-330x330.gif Website David Des Marais Civil and Environmental Engineering https://engineering.mit.edu/faculty/david-des-marais/ Zachary Hartwig will join the Department of Nuclear Science and Engineering in January 2017 as an assistant professor. He will also receive a co-appointment at the MIT Plasma Science and Fusion Center (PSFC). He received his PhD from MIT in 2014 for the development of a novel accelerator-based technique that advanced the ability to study the dynamic interaction of confined plasmas and the surrounding solid materials — known as plasma-material interactions — in fusion devices. Since 2014, he has been a postdoc at the PSFC, continuing to develop diagnostic techniques for plasma-material interactions, leading the establishment of a new laboratory for accelerator-based nuclear science, and leading the design of high-magnetic field net energy gain fusion devices that leverage new superconducting magnet technology. Hartwig’s research will focus on the development and application of particle accelerators, radiation detectors, and computational radiation transport simulations to magnetic fusion energy, nuclear security, and radiation damage in nuclear materials. He presently holds a U.S. Department of Energy ORISE Fellowship in the fusion energy sciences and is the recipient of the Del Favero doctoral thesis prize. https://engineering.mit.edu/wp-content/uploads/hartwig.jpg Website Zachary Hartwig Nuclear Science and Engineering # Ali Jadbabaie joined the MIT faculty as a full professor with dual appointments in the Department of Civil and Environmental Engineering and the Institute for Data, Systems, and Society in July 2016. He is currently the JR East Professor of Engineering, the director of the Sociotechnical Systems Research Center, and the associate director of the Institute for Data, Systems, and Society at MIT. He is also a principal investigator in the Laboratory for Information and Decision Systems. Jadbabaie received his BS from Sharif University of Technology in Tehran, Iran, his MS in electrical and computer engineering from the University of New Mexico, and his PhD in control and dynamical systems from Caltech. After a year as a postdoc at Yale University, he joined the faculty at University of Pennsylvania in July 2002. At Penn he was named an associate professor with tenure in 2008, a full professor in 2011, and the Alfred Fitler Moore Professor of Network Science in 2013. He also held appointments in computer and information science and operations as well as information and decisions in the Wharton School of Business. Jadbabaie is the inaugural editor-in-chief of IEEE Transactions on Network Science and Engineering, an interdisciplinary journal sponsored by several IEEE societies. He is a recipient of a National Science Foundation Career Award, an Office of Naval Research Young Investigator Award. In 2015, he received the Vannevar Bush Fellowship (formerly known as National Security Science and an Engineering Faculty Fellowship) from the office of Secretary of Defense. Jadbabaie’s students have won and been finalists of numerous best paper awards at various ACC and CDC conferences. He is also an IEEE fellow. He has made foundational contributions to the field of collective autonomy and opinion dynamics, and his current research interests include the interplay of dynamic systems and networks with specific emphasis on multi-agent coordination and control, distributed optimization, network science, and network economics. https://engineering.mit.edu/wp-content/uploads/jadbabaie.jpg Website Ali Jadbabaie Civil and Environmental Engineering # Karthish Manthiram will join the faculty as an assistant professor in Chemical Engineering in 2017. Currently a postdoctoral researcher at Caltech, he received a bachelor’s degree in chemical engineering from Stanford University and his PhD in chemical engineering from the University of California, Berkeley. He received the Dan Cubicciotti Award of the Electrochemical Society, a Department of Energy Office of Science graduate fellowship, a Tau Beta Pi fellowship, the Mason and Marsden prize, a Dow Excellence in Teaching Award, and the UC Berkeley chemical engineering departmental teaching award. As a graduate student, Manthiram developed transition",
  "content_length": 24521,
  "method": "requests",
  "crawl_time": "2025-12-01 12:28:58"
}