{
  "name": "Adam W. Bargteil",
  "homepage": "http://www.csee.umbc.edu/~adamb",
  "status": "success",
  "content": "Adam W. Bargteil Adam W. Bargteil Associate Professor Computer Science and Electrical Engineering University of Maryland, Baltimore County Email: adamb-at-umbc.edu Office: ITE 341 Office Hours: M/W 2:30-3:30 Mail: Adam Bargteil 1000 Hilltop Circle ITE Bldg, Room 325 Baltimore, MD 21250 Curriculum Vitae Google Scholar Profile I am an associate professor in the Department of Computer Science and Electrical Engineering at the University of Maryland, Baltimore County. I completed my Ph.D. in computer science at the University of California at Berkeley, where I worked in the Berkeley Computer Animation & Modeling group. I then spent two years as a postdoctoral fellow in the City of Bridges working in the Graphics Lab at Carnegie Mellon University. Before returning home to Maryland, I was an assistant professor in the School of Computing at the University of Utah. My primary research interests are in computer graphics and animation, especially using physics-based animation. I am also interested in scientific computing, numerical methods, computational physics and computational geometry. Teaching Spring 2025: Computer Graphics Spring 2025: Computer Graphics Fall 2024: Computer Graphics Fall 2024: Design and Analysis of Algorithms (441) Spring 2024: Computer Graphics Fall 2023: Computer Graphics Fall 2023: Design and Analysis of Algorithms (441) Spring 2023: Design and Analysis of Algorithms (641) Fall 2022: Computer Graphics Fall 2022: Design and Analysis of Algorithms (641) Spring 2022: Design and Analysis of Algorithms (641) Fall 2021: Computer Graphics Fall 2021: Data Structures Spring 2021: Data Structures Fall 2020: Computer Graphics Fall 2020: Data Structures Spring 2020: Data Structures Fall 2019: Computer Graphics Fall 2019: Data Structures Spring 2019: Computer Graphics Fall 2018: Computer Graphics Fall 2018: Data Structures Fall 2017: Computer Animation Spring 2017: Computer Graphics Fall 2016: Computer Graphics Spring 2016: Computer Animation Fall 2015: Computer Graphics Fall 2014: Computer Science II (Utah) Fall 2014: Character Animation (Utah) Spring 2014: Computer Science II (Electronic Arts and Entertainment) (Utah) Fall 2013: Physics-based Animation (Utah) Spring 2013: Computer Science II (Electronic Arts and Entertainment) (Utah) Spring 2012: Computer Science II (Electronic Arts and Entertainment) (Utah) Fall 2011: Character Animation Spring 2011: Computer Science II (Electronic Arts and Entertainment) (Utah) Fall 2010: Physics-based Animation (Utah) Spring 2010: Computer Science II (Electronic Arts and Entertainment) (Utah) Fall 2009: Character Animation Spring 2009: Computer Science II (Electronic Arts and Entertainment) (Utah) Fall 2008: Physical Simulation for Computer Animation (Utah) Fall 2007: Physical Simulation for Computer Animation (CMU) Publications SIGGRAPH Courses Adam W. Bargteil and Tamar Shinar An Introduction to Physics-based Animation. SIGGRAPH '18: ACM SIGGRAPH 2018 Courses, August 2018. SIGGRAPH '19: ACM SIGGRAPH 2019 Courses, July 2019. SIGGRAPH Asia '20: ACM SIGGRAPH Asia 2020 Courses, December 2020. Conversation Articles Adam W. Bargteil ‘Jurassic Park’ made a dinosaur-sized leap forward in computer-generated animation on screen, 25 years ago. The Conversation, June 8, 2018. Adam W. Bargteil How ‘Bambi’ paved the way for both ‘Fallout 4’ and ‘Angry Birds’. The Conversation, August 7, 2017. Journal Articles X. Li, S. Andrews, B. Jones, and A. W. Bargteil Energized Rigid Body Fracture. Proceedings of the ACM on Computer Graphics and Interactive Techniques, July 2018, Vol. 1, No 1. B. Jones, N. Thuerey, T. Shinar, and A. W. Bargteil Example-based Plastic Deformation of Rigid Bodies. ACM Transactions on Graphics, July 2016, Vol. 35, No 4. H. Bhattacharya, Y. Gao, A. W. Bargteil A Level-set Method for Skinning Animated Particle Data. IEEE Transactions on Visualization and Computer Graphics, March 2015, Vol. 21, No. 3. B. Jones, J. Popovic, J. McCann, W. Li, A. W. Bargteil Dynamic Sprites: Artistic Authoring of Interactive Animations Computer Animation and Virtual Worlds, March/April 2015, Vol. 26, No. 2. D. Gerszewski, L. Kavan, P.-P. Sloan, A. W. Bargteil Basis Enrichment and Solid-fluid Coupling for Model-reduced Fluid Simulation Computer Animation and Virtual Worlds, March/April 2015, Vol. 26, No. 2. A. W. Bargteil, Elaine Cohen Animation of Deformable Bodies with Quadratic Bézier Finite Elements ACM Transactions on Graphics, May 2014, Vol. 33, No 3. B. Jones, S. Ward, A. Jallepalli, J. Perenia, A. W. Bargteil Deformation Embedding for Point-based Elastoplastic Simulation ACM Transactions on Graphics, March 2014, Vol. 33, No 2. M. K. Misztal, K. Erleben, A. W. Bargteil, J. Fursund, B. B. Christensen, J. A. Baerentzen, R. Bridson Multiphase Flow of Immiscible Fluids on Unstructured Moving Meshes. IEEE Transactions on Visualization and Computer Graphics, January 2014, Vol 20, No 1. D. Gerszewski, A. W. Bargteil Physics-based Animation of Large-scale Splashing Liquids. ACM Transactions on Graphics (SIGGRAPH ASIA 2013), November 2013, Vol 32, No 6. T. Liu, A. W. Bargteil, J. F. O'Brien, L. Kavan Fast Simulation of Mass-Spring Systems. ACM Transactions on Graphics (SIGGRAPH Asia 2013), November 2013, Vol 32, No 6. L. Kavan, D. Gerszewski, A. W. Bargteil, P.-P. Sloan Physics-Inspired Upsampling for Cloth Simulation in Games. ACM Transactions on Graphics (SIGGRAPH 2011), August 2011, Vol 30. No. 4. L. Kavan, A. W. Bargteil, P.-P. Sloan Least Squares Vertex Baking Computer Graphics Forum (EGSR 2011), June 2011, Vol 30. No. 4. A. W. Bargteil, C. Wojtan, J. K. Hodgins, G. Turk A Finite Element Method for Animating Large Viscoplastic Flow. ACM Transactions on Graphics (SIGGRAPH 2007), August 2007, Vol 26. No. 3. A. W. Bargteil, T. G. Goktekin, J. F. O'Brien, J. A. Strain, A Semi-Lagrangian Contouring Method for Fluid Simulation. ACM Transactions on Graphics, January 2006, Vol 25. No. 1. T. G. Goktekin, A. W. Bargteil, J. F. O'Brien, A Method for Animating Viscoelastic Fluids. ACM Transactions on Graphics (SIGGRAPH 2004), August 2004, Vol 23. No. 3. J. F. O'Brien, A. W. Bargteil, J. K. Hodgins, Graphical Modeling and Animation of Ductile Fracture. ACM Transactions on Graphics (SIGGRAPH 2002), July 2002, Vol 21. No. 3. Conference & Workshop Papers A. Kaliappan and A. W. Bargteil Multi-resolution Clustering for Enhanced Elastic Behavior in Clustered Shape Matching. Proceedings of ACM SIGGRAPH Motion, Interaction and Games. Virtual, October 2020. Q. Zheng, Z. Li, and A. W. Bargteil Learning to Shadow Hand-drawn Sketches. Proceedings of IEEE/CVF Conference on Computer Vision and Pattern Recognition. Virtual, June 2020. A. Dahl and A. W. Bargteil Global Momentum Preservation for Position-based Dynamics. Proceedings of ACM SIGGRAPH Motion in Games. Newcastle Upon Tune, England, October 2019. A. Dahl and A. W. Bargteil Early Termination of Conjugate Gradients for Corotated Finite Elements. Proceedings of ACM SIGGRAPH Motion in Games. Newcastle Upon Tune, England, October 2019. M. Falkenstein, B. Jones, J. A. Levine, T. Shinar, and A. W. Bargteil Reclustering for large plasticity in clustered shape matching. Proceedings of ACM SIGGRAPH Motion in Games. Barcelona, Spain, November 2017. B. Jones, J. A. Levine, T. Shinar, and A. W. Bargteil Efficient Collision Detection for Example-based Deformable Bodies. Proceedings of ACM SIGGRAPH Motion in Games. Barcelona, Spain, November 2017. B. Jones, A. Martin, J. A. Levine, T. Shinar, and A. W. Bargteil Ductile Fracture for Clustered Shape Matching Proceedings of ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games, Redmond, WA, February 2016. B. Jones, A. Martin, J. A. Levine, T. Shinar, and A. W. Bargteil Clustering and Collision Detection for Clustered Shape Matching Proceedings of ACM SIGGRAPH Motion in Games, Paris, France, November 2015. A. W. Bargteil, B. Jones Strain Limiting for Clustered Shape Matching Proceedings of ACM SIGGRAPH Motion in Games, Los Angeles, California, November 2014. Best Presentation Award J. A. Levine, A. W. Bargteil, C. Corsi, J. Tessendorf, R. Geist A Peridynamic Perspective on Spring-Mass Fracture. Proceedings of ACM SIGGRAPH/Eurographics Symposium on Computer Animation, Copenhagen, Denmark, July 2014. H. Bhattacharya, J. Levine, A. W. Bargteil Fluid Simulation on Arbitrary Quadrilateral Surface Meshes. Proceedings of Structured Meshing: Theory, Applications, and Evaluation, Houstin, Texas, May 2014. B. Jones, J. Popovic, J. McCann, W. Li, A. W. Bargteil Dynamic Sprites. Proceedings of ACM Motion in Games, Dublin, Ireland, November 2013. Best Student Paper Award A. Stuart, J. Levine, B. Jones, A. W. Bargteil Automatic Construction of Coarse, High-quality Tetrahedralizations that Enclose and Approximate Surfaces for Animation. Proceedings of ACM Motion in Games, Dublin, Ireland, November 2013. D. Gerszewski, L. Kavan, P.-P. Sloan, A. W. Bargteil Enhancements to Model-reduced Fluid Simulation. Proceedings of ACM Motion in Games, Dublin, Ireland, November 2013. M. K. Misztal, K. Erleben, A. W. Bargteil, J. Fursund, B. B. Christensen, J. A. Baerentzen, R. Bridson Multiphase Flow of Immiscible Fluids on Unstructured Moving Meshes. Proceedings of ACM SIGGRAPH/Eurographics Symposium on Computer Animation, Lausanne, Switzerland, July 2012. Best Paper Award H. Bhattacharya, Y. Gao, A. W. Bargteil A Level-set Method for Skinning Animated Particle Data. Proceedings of ACM SIGGRAPH/Eurographics Symposium on Computer Animation, Vancouver, British Columbia, Aug 2011. D. Gerszewski, H. Bhattacharya, A. W. Bargteil A Point-based Method for Animating Elastoplastic Solids.Proceedings of ACM SIGGRAPH/Eurographics Symposium on Computer Animation, New Orleans, Louisiana, Aug 2009. F. Sin, A. W. Bargteil, J. K. Hodgins A Point-based Method for Animating Incompressible Flow.Proceedings of ACM SIGGRAPH/Eurographics Symposium on Computer Animation, New Orleans, Louisiana, Aug 2009. A. M. Eden, A. W. Bargteil, T. G. Goktekin, S. B. Eisinger, ",
  "content_length": 11837,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:36"
}