{
  "name": "Adam J. Aviv",
  "homepage": "https://adamaviv.com",
  "status": "success",
  "content": "Adam J. Aviv Adam J. Aviv Associate Professor of Computer Science The George Washington University aaviv@gwu.edu SEH 5810 202-994-6569 adamaviv @adamaviv @adamaviv@infosec.exchange Ongoing Research Recruitment Notice We are currently conducting recruitment for a research study entitled \"Key Factors Influencing Developers' Decisions to Change App Labels.\" If you are an app developer whose app did not undergo changes in the last two years, you might have received an email from our lab using the email address gwusec@email.gwu.edu for you to answer a few questions. This notice is to ensure you that this is an approved research student (GWU IRB # NCR246154). You can view the informed consent if you need more details. We appreciate your support and feedback, and we guarantee your responses will remain confidential and anonymized. About Me I am an Associate Professor of Computer Science at the George Washington University. I have broad research interests, primarily in the area of computer security/cybersecurity, privacy, and usable security. I am the lead for the George Washington University/Usable Security and Privacy Lab (gwusec). If you are interested in joining the lab or collaborating on research, more information can be found there. Teaching Fall 2025 CSCI 4531/6531: Computer Security - Wednesday 3:30pm - 6:00pm CSCI 4553/6533: Introduction to Usable Security and Privacy - Monday 12:45pm - 3:10pm Office Hours Fall 2025 Office horus are available in my office for students where I am their listed advisor or for students enrolled in my classes. Mondays: 11:00am - 12:00pm (starting Aug 25, 2025) By appointment Am I listed as your MS Academic Advisor? I am happy to help, but before sending me an email or scheduling a meeting, please check the CS MS Advising FAQ Interested in having me as a mentor for your PhD? I do not intend to accept new students to my lab for Spring'26 or Fall'26 starts. You may still email me to learn more, but I cannot promise I will reply. I do read (nearly) all the email I receive. Undergrad or masters student at GW interested in research? Yes! I am always looking for motivated undergraduates and masters students at GW to do research. Shoot me an email, and I will do my best to follow up. However, I cannot always offer a assistanship or stipend. I am looking for more ways to advice MS thesis, but you will need to have a complete topic in mind and a committee. Please keep in mind I only have so much capacity and may still decline. News 2025 News Good News (Sep 2025) One new paper accepted at IMC Neal Keating, Wellington Esposito Barbosa, Leo Phan, Viraj Prakash, Gianluca Stringhini, Adam J. Aviv. Mirror Mirror on the Wall, which APK Mirror Site is the Largest of them All?. ACM Internet Measurement Conference (IMC'25). October 2025. Good News (Sep 2025) One new paper accepted at IEEE SP'26 Mindy Tran, Xinru Tang, Adryana Hutchinson, Adam J. Aviv, and Yixin Zou. Toward Inclusive Security and Privacy for Deaf and Hard-of-Hearing People: A Community-Based Interview Study. IEEE Symposium on Security and Privacy (SP'26). May 2026. Bad News (Sep 2025) One paper rejected from IEEE SP'25 Bad News (July 2025) One NSF grant rejected Good News (July 2025) One new NSF grant awarded Collaborative Research: Conference: 2025 Workshop for Aspiring PIs in Trusted Cyberspace. With PIs Michelle Mazurek and Dachmen-Soled. Good News (July 2025) One new NSF travel grant awarded NSF Student Travel Grant for the 2025 Privacy Enhancing Technology Symposium (PETS'25) Good News (July 2025) One new NSF grant awarded NSF-BSF: SaTC: CORE: Small: Security and Privacy in Enclave Communities. With collaborators Eran Toch at Tel Aviv University and Oshrat Ayalon at University of Haifa Bad News (June 2025) One NSF Grant Rejected Bad News (June 2025) One ONR Grant Rejected Good News (May 2025) One SOUPS paper accepted Jan Tolsdorf, Alan F. Luo, Monica Kodwani, Junho Eum, Mahmood Sharif, Michelle L. Mazurek, Adam J. Aviv. Safety Perceptions of Generative AI Conversational Agents: Uncovering Perceptual Differences in Trust, Risk, and Fairness. Twenty-First Symposium on Usable Privacy and Security (SOUPS'25). August 2025. Bad News (May 2025) One SOUPS paper rejected Good News (April 2025) I won the OVPR Research Mentorship Award The OVPR mentorship award is awarded to \"A George Washington University (GW) faculty member who has had a significant impact on the academic and professional development of students and postdocs in the areas of research and scholarship will be selected for the GW Research Mentorship Award. GW invites any current student, postdoc, or recent graduate to nominate members of the faculty who exemplify excellence as a mentor in the development of original research and/or scholarship. Nominees for this award will be considered based on their mentorship of students or postdocs and the stated impact of that mentorship on the nominator’s academic and professional growth.\" Details available here: OVPR Faculty Awards Bad News (April 2025) One USENIX Sec' paper rejected Good News (April 2025) One paper accepted at ConPro Jan Tolsdorf, Alan F. Luo, Monica Kodwani, Junho Eum, Mahmood Sharif, Michelle L. Mazurek, Adam J. Aviv. On a Scale of 1 to 5, How Reliable Are AI User Studies? A Call for Developing Validated, Meaningful Scales and Metrics about User Perceptions of AI Systems. 9th Workshop on Technology and Consumer Protection (ConPro ’25). May 2025. Bad News (Jan 2025) One NSF proposal rejected Good News (Jan 2025) We have a newly accepted paper at USENIX Security 2025 Wentao Guo, Paige Pepito, Adam J. Aviv, Michelle L. Mazurek. How Researchers De-identify Data in Practice. USENIX Security Symposium. August 2025. Good News (Jan 2025) We have a newly accepted paper at ACM CHI 2025 Kavous Salehzadeh Niksirat, Collins W. Munyendo, Onicio Batista Leal Neto, Ms Muswagha Katya, Cyrille Kouassi, Kevin Ochieng, Angoa Georgina, Bernard Olayo, Jean-Philippe Barra, Ciro Cattuto, Adam J. Aviv, Carmela Troncoso. Reimagining Wearable-Based Digital Contact Tracing: Insights from Kenya and Côte d’Ivoire. ACM Conference on Human Factors in Computing Systems. May 2025. 2024 News Bad News (Nov 2024) One paper rejected from PAM 2025 Bad News (Nov 2024) One paper rejected from CHI 2025 Good News (Oct 2024) We have two accepted papers at SP 2025 Collins W. Munyendo, Kentrell Owens, Faith Strong, Shaoqi Wang, Adam J. Aviv, Tadayoshi Kohno and Franziska Roesner. \"You Have to Ignore the Dangers\": User Perceptions of the Security and Privacy Benefits of WhatsApp Mods. IEEE Symposium on Security and Privacy (SP'25). May 2025. Elisa Shioji, Ani Meliksetyan, Lucy Simko, Ryan Watkins, Adam J. Aviv and Shaanan Cohney. It's been lovely watching you'': Institutional Decision-Making on Online Proctoring Software. IEEE Symposium on Security and Privacy (SP'25). May 2025. Good News (Aug 2024) We have an accepted papers at EuroUSEC 2045 Elena Korkes, Collins W. Munyendo, Alvin Isaac, Victoria Hennemann and Adam J. Aviv. \"I'm going to try her birthday\": Investigating How Friends Guess Each Other's Smartphone Unlock PINs in the Lab. 2024 European Symposium on Usable Security (EuroUSEC'24). October 2024. Good News (July 2024) We have two accepted papers at CCS 2024 Wentao Guo, Aditya Kishore, Adam J. Aviv, and Michelle L. Mazurek. A Qualitative Analysis of Practical De-identification Guides. The ACM Conference on Computer and Communication Security (CCS). 2024 Lucy Simko, Adryana Hutchinson, Alvin Isaac, Evan Fries, Micah Sher, and Adam J. Aviv \"Modern problems require modern solutions\": Community-Developed Techniques for Online Exam Proctoring Evasion. The ACM Conference on Computer and Communication Security (CCS). 2024 Good News (July 2024) We have an accepted paper at TOCHI Yixin Zou, Khue Le, Peter Mayer, Alessandro Acquisti, Adam J. Aviv, and Florain Schaub. Nudging Users to Change Breached Passwords Using the Protection Motivation Theory. To appear in Transactions on Computer Human Interaction. Bad News (July 2024) One paper early rejected from IMC 2024 Good News (May 2024) We have an accepted paper at SOUPS 2024 David G. Balash, Mir Masood Ali, Chris Kanich and Adam J. Aviv. \"I would not install an app with this label\": Privacy Label Impact on Risk Perception and Willingness to Install iOS Apps. Symposium on Usable Security and Privacy. 2024. Good News (May 2024) We have an accepted paper at the Workshop on Accessible Security & Privacy (WASP 2024) Mindy Tran, Xinru Tang, Adryana Hutchinson, Adam J. Aviv, and Yixin Zou. Position Paper: Exploring Security and Privacy Needs of d/Deaf Individuals. First Workshop on Accessible Security & Privacy (WASP). 2024. Bad News (May 2024) One paper rejected from SOUPS Bad News (May 2024) One paper rejected from USENIX Good News (May 2024) We have an accepted paper at PoPETS 2024 Mir Masood Ali, David G. Balash, Monica Kodwani, Chris Kanich, and Adam J. Aviv. Honesty is the Best Policy: On the Accuracy of Apple Privacy Labels Compared to Apps' Privacy Policies. To appear in the Proceedings of Privacy Enhancing Technologies. 2024. Good News (Mar 2024) We have an accepted paper at CHI's Late Breaking Work as an extended asbtract Adryana Hutchinson, Collins W. Munyendo, Peter Mayer, and Adam J. Aviv. An Analysis of Password Managers' Password Checkup Tools. ACM CHI Extend Abstracts '2024. Bad News (Mar 2024) One paper rejected from IEEE S&P Good News (Jan 2024) We have an accepted talk at PrivacyCon 2024 for our paper Peter Mayer, Yixin Zou, Bryon M. Lowens, Hunter A. Dyer, Khue Lee, Florian Schaub, and Adam J. Aviv. Awareness, Intention, (In)Action: Individuals' Reactions to Data Breaches. Bad News (Jan 2024) One paper rejected from USENIX Good News (Jan 2024) One paper accepted to USEC 2024 Adryana Hutchinson, Jinwei Tang, Adam J. Aviv, and Peter Story. Measuring the Prevalence of Password Manager Issues Using In-Situ Experiments. Symposium on Usable Security and Privacy (USEC) 2024. 2023 News(click to reveal) Good",
  "content_length": 22679,
  "method": "requests",
  "crawl_time": "2025-12-01 12:29:00"
}