{
  "name": "Adam Morrison 0001",
  "homepage": "http://www.cs.tau.ac.il/~mad",
  "status": "success",
  "content": "Adam Morrison Adam Morrison Associate ProfessorBlavatnik School of Computer ScienceTel Aviv University Office: Check Point 334 Email: mad@cs.tau.ac.il Research I'm interested in the performance and security of multi-core computing (software and hardware), from algorithms through operating systems to microarchitecture. Teaching Advanced Topics in Multi-Core Architecture and Software Systems (Fall 2025-26) Seminar in Algorithms for Storage Systems (Fall 2025-26) Operating Systems (Spring 2026) Publications µSTT: Microarchitecture Design for Speculative Taint Tracking. Boru Chen, Rutvik Choudhary, Kaustubh Khulbe, Archie Lee, Adam Morrison, and Christopher W. Fletcher. Proceedings of the 43rd IEEE International Conference on Computer Design (ICCD 2025), November 2025. Disentangling the Dual Role of NIC Receive Rings. Boris Pismenny, Adam Morrison, and Dan Tsafrir. Proceedings of the 19th USENIX Symposium on Operating Systems Design and Implementation (OSDI 2025), July 2025. Last-Level Cache Side-Channel Attacks Are Feasible in the Modern Public Cloud. Zirui Neil Zhao, Adam Morrison, Christopher W. Fletcher, and Josep Torrellas. Proceedings of the 29th Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2024), April 2024. Everywhere All at Once: Co-Location Attacks on Public Cloud FaaS. Zirui Neil Zhao, Adam Morrison, Christopher W. Fletcher, and Josep Torrellas. Proceedings of the 29th Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2024), April 2024. IEEE Micro's 2024 Top Picks. Declassiflow: A Static Analysis for Modeling Non-Speculative Knowledge to Relax Speculative Execution Security Measures. Rutvik Choudhary, Alan Wang, Zirui Neil Zhao, Adam Morrison, and Christopher W. Fletcher. Proceedings of the 30th ACM Conference on Computer and Communications Security (CCS 2023), November 2023. ShRing: Networking with Shared Receive Rings. Boris Pismenny, Adam Morrison, and Dan Tsafrir. Proceedings of the 17th USENIX Symposium on Operating Systems Design and Implementation (OSDI 2023), July 2023. Prefix Siphoning: Exploiting LSM-Tree Range Filters For Information Disclosure. Adi Kaufman, Moshik Hershcovitch, and Adam Morrison. Proceedings of the 2023 USENIX Annual Technical Conference (ATC 2023), July 2023. RLS Side Channels: Investigating Leakage of Row-Level Security Protected Data Through Query Execution Time. Chen Dar, Moshik Hershcovitch, and Adam Morrison. Proceedings of the 2023 International Conference on Management of Data (SIGMOD 2023), June 2023. Untangle: A Principled Framework to Design Low-Leakage, High-Performance Dynamic Partitioning Schemes. Zirui Neil Zhao, Adam Morrison, Christopher W. Fletcher, and Josep Torrellas. Proceedings of the 28th Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2023), March 2023. IEEE HSTTC's 2024 Top Picks in Hardware and Embedded Security. IEEE Micro's 2023 Top Picks Honorable Mention. WISE: Predicting the Performance of Sparse Matrix Vector Multiplication with Machine Learning. Serif Yesil, Azin Heidarshenas, Adam Morrison, and Josep Torrellas. Proceedings of the 28th ACM SIGPLAN Annual Symposium on Principles and Practice of Parallel Programming (PPoPP 2023), February 2023. Prefix Filter: Practically and Theoretically Better Than Bloom. Tomer Even, Guy Even, and Adam Morrison. Proceedings of the 48th International Conference on Very Large Data Bases (VLDB 2022), September 2022. Binoculars: Contention-Based Side-Channel Attacks Exploiting the Page Walker. Zirui Neil Zhao, Adam Morrison, Christopher W. Fletcher, and Josep Torrellas. Proceedings of the 31st USENIX Security Symposium (USENIX Security 2022), August 2022. Occualizer: Optimistic Concurrent Search Trees From Sequential Code. Tomer Shanny and Adam Morrison. Proceedings of the 16th USENIX Symposium on Operating Systems Design and Implementation (OSDI 2022), July 2022. Privbox: Faster System Calls Through Sandboxed Privileged Execution. Dmitry Kuznetsov and Adam Morrison. Proceedings of the 2022 USENIX Annual Technical Conference (ATC 2022), July 2022. Augury: Using Data Memory-Dependent Prefetchers to Leak Data at Rest. Jose Rodrigo Sanchez Vicarte, Michael Flanders, Riccardo Paccagnella, Grant Garrett-Grossman, Adam Morrison, Christopher W. Fletcher, and David Kohlbrenner. Proceedings of the 43rd IEEE Symposium on Security and Privacy (S&P 2022), May 2022. CSAW'22 Applied Research Competition Runner-Up. Elastic Indexes: Dynamic Space vs. Query Efficiency Tuning for In-Memory Database Indexing. Moshik Hershcovitch, Artem Khyzha, Daniel Waddington, and Adam Morrison. Proceedings of the 25th International Conference on Extending Database Technology (EDBT 2022), March 2022. The Benefits of General-Purpose On-NIC Memory. Boris Pismenny, Liran Liss, Adam Morrison, and Dan Tsafrir. Proceedings of the 27th International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2022), February 2022. Pinned Loads: Taming Speculative Loads in Secure Processors. Zirui Neil Zhao, Houxiang Ji, Adam Morrison, Darko Marinov, Josep Torrellas. Proceedings of the 27th International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2022), February 2022. Cuckoo Trie: Exploiting Memory-Level Parallelism for Efficient DRAM Indexing. Adar Zeitak and Adam Morrison. Proceedings of the 28th ACM Symposium on Operating Systems Principles (SOSP 2021), October 2021. Speculative Privacy Tracking (SPT): Leaking Information From Speculative Execution Without Compromising Privacy. Rutvik Choudhary, Jiyong Yu, Christopher W. Fletcher, and Adam Morrison. Proceedings of the 54th IEEE/ACM International Symposium on Microarchitecture (MICRO 2021), October 2021. An Analysis of Speculative Type Confusion Vulnerabilities in the Wild. Ofek Kirzner and Adam Morrison. Proceedings of the 30th USENIX Security Symposium (USENIX Security 2021), August 2021. Distinguished paper award. 2021 Internet Defense Prize (first place). CSAW'21 MENA Applied Research Competition Winner. 2021 Pwnie Nominee For Most Innovative Research. Opening Pandora's Box: A Systematic Study of New Ways Microarchitecture Can Leak Private Data. Jose Rodrigo Sanchez Vicarte, Pradyumna Shome, Nandeeka Nayak, Caroline Trippel, Adam Morrison, David Kohlbrenner, and Christopher W. Fletcher. Proceedings of the 48th International Symposium on Computer Architecture (ISCA 2021), June 2021. Honorable Mention, Intel Hardware Security Academic Award. Characterizing, Exploiting, and Detecting DMA Code Injection Vulnerabilities in the Presence of an IOMMU. Alex Markuze, Shay Vargaftik, Gil Kupfer, Boris Pismenny, Nadav Amit, Adam Morrison, and Dan Tsafrir. Proceedings of the 16th European Conference on Computer Systems (EuroSys 2021), April 2021. Autonomous NIC Offloads. Boris Pismenny, Haggai Eran, Aviad Yehezkel, Liran Liss, Adam Morrison, and Dan Tsafrir. Proceedings of the 26th International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2021), April 2021. Distinguished paper award. 2023 IRTF Applied Networking Research Prize. Speculative Interference Attacks: Breaking Invisible Speculation Schemes. Mohammad Behnia, Prateek Sahu, Riccardo Paccagnella, Jiyong Yu, Zirui Neil Zhao, Xiang Zou, Thomas Unterluggauer, Josep Torrellas, Carlos Rozas, Adam Morrison, Frank Mckeen, Fangfei Liu, Ron Gabor, Christopher W. Fletcher, Abhishek Basak, and Alaa Alameldeen. Proceedings of the 26th International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2021), April 2021. Efficiently Reclaiming Memory in Concurrent Search Data Structures While Bounding Wasted Memory. Daniel Solomon and Adam Morrison. Proceedings of the 26th ACM SIGPLAN Annual Symposium on Principles and Practice of Parallel Programming (PPoPP 2021), March 2021. Recoverable, Abortable, and Adaptive Mutual Exclusion with Sublogarithmic RMR Complexity. Daniel Katzan and Adam Morrison. Proceedings of the 24th International Conference on Principles of Distributed Systems (OPODIS 2020), December 2020. Proving Highly-Concurrent Traversals Correct. Yotam M. Y. Feldman, Artem Khyzha, Constantin Enea, Adam Morrison, Aleksandar Nanevski, Noam Rinetzky, and Sharon Shoham. Proceedings of the ACM Conference on Object Oriented Programming Systems Languages and Applications (OOPSLA 2020), November 2020. Speeding up SpMV for Power-Law Graph Analytics by Enhancing Locality & Vectorization. Serif Yesil, Azin Heidarshenas, Adam Morrison, and Josep Torrellas. Proceedings of the International Conference for High Performance Computing, Networking, Storage, and Analysis (SC 2020), November 2020. Speculation Invariance (InvarSpec): Faster Safe Execution Through Program Analysis. Zirui Neil Zhao, Houxiang Ji, Mengjia Yan, Jiyong Yu, Christopher W. Fletcher, Adam Morrison, Darko Marinov, and Josep Torrellas. Proceedings of the 53rd International Symposium on Microarchitecture (MICRO 2020), October, 2020. Snug: Architectural Support for Relaxed Concurrent Priority Queueing in Chip Multiprocessors. Azin Heidarshenas, Tanmay Gangwani, Serif Yesil, Adam Morrison, and Josep Torrellas. Proceedings of the International Conference on Supercomputing (ICS 2020), June 2020. V-Combiner: Speeding-up Iterative Graph Processing on a Shared-Memory Platform with Vertex Merging. Azin Heidarshenas, Serif Yesil, Dimitrios Skarlatos, Sasa Misailovic, Adam Morrison, and Josep Torrellas. Proceedings of the International Conference on Supercomputing (ICS 2020), June 2020. Speculative Data-Oblivious Execution: Mobilizing Safe Prediction For Safe and Efficient Speculative Execution. Jiyong Yu, Namrata Mantri, Josep Torrellas, Adam Morrison, and Christopher W. Fletcher. Proceedings of the 47th International Symposium on Computer Architecture (ISCA 2020), June 2020. Intel Hardware Security Academic Award. IOctop",
  "content_length": 17440,
  "method": "requests",
  "crawl_time": "2025-12-01 12:29:07"
}