{
  "name": "Adam S. Z. Belloum",
  "homepage": "https://www.uva.nl/profiel/b/e/a.s.z.belloum/a.s.z.belloum.html",
  "status": "success",
  "content": "Dr. A.S.Z. (Adam) Belloum - Universiteit van Amsterdam Dr. A.S.Z. (Adam) Belloum Faculteit der Natuurwetenschappen, Wiskunde en Informatica Informatics Institute Fotograaf: onbekend Bezoekadres Science Park 904 Kamernummer: L5.40 Postadres Postbus 94323 1090 GH Amsterdam Contactgegevens a.s.z.belloum@uva.nl +31638560995 Vision A self-organizing linked process ecosystem for scientific data. In this vision processes are used as a method to link scientific data at different stages. This goes beyond the idea of the Web Linked Data approach simply connecting pieces of data and information using Semantic Web techniques. This ecosystem can be thought of as a semantically annotated network where data and processes are interlinked to describe meaningful scientific data transformations. While this network expands as a result of adding new data and processes, multiple alternative paths for data exploration are created. The ecosystem will be able to assist scientists to identify the data transformation required for his/her application and map them to appropriate resources using information provided by programmable e-Infrastructures. personal web page Research Interests Research Interest Up to 2010, I have been focusing on scaling eScience applications in term of CPU resources; many research groups use the solutions developed in the context of this research. Currently I’m extending my research focus to data aspects of eScience applications. Following are the research objectives I have defined for the coming couple years: Investigating the challenging issues in creating an ecosystem which characterize the relationships exists between the processes and the data they act on Data integration mechanisms allowing aggregation of multi-format and multi-source data into a single coherent schema while preserving the autonomy of data sources. Domain-oriented semantic descriptions of basic application modules, workflow patterns and data sources to facilitate automatic construction of collaborative applications. Investigating the challenging issues in modeling and integrating workflow processes of data-centric scientific applications Modeling of complex workflows Methods for data intensive applications Methods for enacting workflow on e-infrastructures (security, privacy and integrity of both process and data are considered here) Bio Dr. Adam S.Z. Belloum is Assistant Professor at the computer science department of the University of Amsterdam. He received the MSc and PhD degrees from the Université  de Technologie de Compiègne, France. He started his research activities in 1992, he first worked in the area of designing parallel computers (VLSI design), where he participated in the design and the implementation of a prototype of a parallel computer dedicated to image processing based on DSP processors. In 1997, he moved to The Netherlands were he was leading the research activities in the area of Web caching until the year 2000. Since then he has be heading a small research group at the IvI, UvA, working on a various aspects of developing generic middleware for e-Infrastructures. Publicaties refereed (127) wetenschappelijk (22) vakpublicatie (1) populair wetenschappelijk (1) congresbijdragen (2) erkenning (16) 2025 Allaart, C., Amiri, S., Bal, H., Belloum, A., Gommans, L., Van Halteren, A., & Klous, S. (2025). Private and Secure Distributed Deep Learning: A Survey. ACM Computing Surveys, 57(4), Article 92. https://doi.org/10.1145/3703452 [details]Download Müller, T., Turner, R. J., Amiri, S., Allaart, C., van Binsbergen, L. T., Dijksman, L., van Engers, T., Belloum, A., Grosso, P., Grünwald, P., Hoogoort, K., Härmä, A., Hegeman, J. M., Kassem, J. A., Kebede, M., de Laat, C., van der Nat, P., Pals, A., Scheepers, F., & Klous, S. (2025). Optimizing Clinical Pathways with Federated Data. Jusletter IT, 2025, 147-158. https://doi.org/10.38023/eeb1b383-86b0-4b9e-89d5-57af4b58eeb3 [details] 2024 Kassem, J. A., Amiri, S., Müller, T., Belloum, A., Grunwald, P., Grosso, P., Klous, S., Allaart, C., Kebede, M., Turner, R., van Binsbergen, L. T., van Halteren, A., & de Laat, C. (2024). Building a Digital Health Twin for Personalized Intervention: The EPI Project. In B. R. Haverkort, A. de Jongste, P. van Kuilenburg, & R. D. Vromans (Eds.), Commit2Data Article 2 (OpenAccess Series in Informatics; Vol. 124). Schloss Dagstuhl - Leibniz-Zentrum für Informatik. https://doi.org/10.4230/OASIcs.Commit2Data.2024.2 Pan, R., Shi, Z., Belloum, A., & Zhao, Z. (2024). Operating ZKPs on Blockchain: A Performance Analysis Based on Hyperledger Fabric. In 2024 IEEE International Conference on Decentralized Applications and Infrastructures: DAPPS 2024 : proceedings : 15-18 July 2024, Shanghai, China (pp. 69-78). IEEE Computer Society. https://doi.org/10.1109/DAPPS61106.2024.00018 [details]Download Spanjer, R. F., & Belloum, A. S. Z. (2024). Protocol-Level Kafka Controls in a Customizable Proxy. In EScience '24 proceedings: 2024 IEEE 20th International Conference on e-Science (e-Science) : September 16-20, 2024, Osaka, Japan (pp. 313-314). IEEE. https://doi.org/10.1109/e-Science62913.2024.10678687 [details]Download Yang, Z., Papagianni, C., Belloum, A. S. Z., & Grosso, P. (2024). An Architectural Framework for 6G Network Digital Twins System. In ACM MobiCom '24: Proceedings of the 30th International Conference on Mobile Computing and Networking : November 18-November 22, 2024, Washington D.C., DC, USA (pp. 2436–2440). Association for Computing Machinery. https://doi.org/10.1145/3636534.3696730 [details]Download 2023 Cushing, R., Zhou, X., Belloum, A., Grosso, P., van Engers, T., & de Laat, C. (2023). Enabling Collaborative Multi-Domain Applications: A Blockchain-Based Solution with Petri Net Workflow Modeling and Incentivization. In 2023 5th IEEE International Conference on Trust, Privacy and Security in Intelligent Systems and Applications: TPS-ISA 2023 : Atlanta, GA, USA, 1-3 November 2023 : proceedings (pp. 222-229). IEEE. https://doi.org/10.1109/TPS-ISA58951.2023.00036 [details]Download Rafika, B., Fethallah, H., & Belloum, A. (2023). A Pareto-Optimal Privacy-Accuracy Settlement for Differentially Private Image Classification. In 5th International Conference on Pattern Analysis and Intelligent Systems: PAIS'23 : proceedings : 25-26 October 2023, Setif Algeria (pp. 109-115). Institute of Electrical and Electronics Engineers. https://doi.org/10.1109/PAIS60821.2023.10321972 [details] Zhou, X., Belloum, A., Lees, M. H., van Engers, T., & de Laat, C. (2023). The dynamics of corruption under an optional external supervision service. Applied Mathematics and Computation, 457, Article 128172. https://doi.org/10.1016/j.amc.2023.128172 [details]DownloadsThe dynamics of corruptionSupplementary filesSupplementary Materials-The dynamics of corruption 2022 Amiri, S., Belloum, A., Nalisnick, E., Klous, S., & Gommans, L. (2022). On the impact of non-IID data on the performance and fairness of differentially private federated learning. In Proceedings, 52nd Annual IEEE/IFIP International Conference on Dependable Systems and Networks Workshop volume: 27-30 June 2022, Baltimore, Maryland (pp. 52-58). (DSN-W; Vol. 2022). IEEE Computer Society. https://doi.org/10.1109/DSN-W54100.2022.00018 [details]Download Amiri, S., Nalisnick, E., Belloum, A., Klous, S., & Gommans, L. (2022). Generating Heavy-Tailed Synthetic Data with Normalizing Flows. In The 5th Workshop on Tractable Probabilistic Modeling https://openreview.net/forum?id=PbvyJ8XpNn Bentaleb, O., Belloum, A. S. Z., Sebaa, A., & El-Maouhab, A. (2022). Containerization technologies: taxonomies, applications and challenges. Journal of Supercomputing, 78(1), 1144–1181. https://doi.org/10.1007/s11227-021-03914-1 [details] Bentaleb, O., Sebaa, A., Kalli, S., & Belloum, A. S. Z. (2022). Deployment of a programming framework based on microservices and containers with application to the astrophysical domain. Astronomy and Computing, 41, Article 100655. https://doi.org/10.1016/j.ascom.2022.100655 [details] Esterhuyse, C. A., Müller, T., van Binsbergen, L. T., & Belloum, A. S. Z. (2022). Exploring the Enforcement of Private, Dynamic Policies on Medical Workflow Execution. In eScience '22 : Democratizing science : 2022 IEEE 18th International Conference on e-Science: proceedings : eScience 2022 : Salt Lake City, Utah, USA, 10-14 October 202 (pp. 481-486). Conference Publishing Services, IEEE Computer Society. https://doi.org/10.1109/eScience55777.2022.00086 [details] Kassem, J. A., Belloum, A., Müller, T., & Grosso, P. (2022). Utilisation Profiles of Bridging Function Chain for Healthcare Use Cases. In eScience '22 : Democratizing science : 2022 IEEE 18th International Conference on e-Science: proceedings : eScience 2022 : Salt Lake City, Utah, USA, 10-14 October 202 (pp. 475-480). Conference Publishing Services, IEEE Computer Society. https://doi.org/10.1109/eScience55777.2022.00085 [details]Download Zhou, X., Belloum, A., Lees, M. H., van Engers, T., & de Laat, C. (2022). Costly incentives design from an institutional perspective: cooperation, sustainability and affluence. Proceedings of the Royal Society A-Mathematical, Physical and Engineering Sciences, 478(2265), Article 20220393. https://doi.org/10.1098/rspa.2022.0393 [details]Downloadsrspa.2022.0393Supplementary filesrspa20220393 si 001 2021 Amiri, S., Belloum, A., Klous, S., & Gommans, L. (2021). Compressive differentiallyprivate federated learning through universal vector quantization. In AAAI Workshop on Privacy-Preserving Artificial Intelligence AAAI. Kassem, J. A., Valkering, O., Belloum, A., & Grosso, P. (2021). EPI framework: Approach for traffic redirection through containerised network functions. In Proceedings, IEEE 17th International Conference on eScience: e-Science 2021 : 20-23 September 2021, online event (pp. 80-89). IEEE Computer Society. https://doi.org/10.1109/eScience51609.2021.00018 [details]Download Osório, A. L., Camarinha-Matos, L. M., Belloum, A., & Afsarmanesh, ",
  "content_length": 57485,
  "method": "requests",
  "crawl_time": "2025-12-01 12:29:06"
}