{
  "name": "Adam Breuer",
  "homepage": "https://www.adambreuer.com",
  "status": "success",
  "content": "Adam Breuer Adam Breuer Adam Breuer About Adam Breuer Apply to the Dartmouth CS PhD (deadline: Dec 31) Adam Breuer is Harvard's first and only double PhD in Computer Science and Political Science. He currently holds dual named assistant professorships in the Departments of Computer Science and Government at Dartmouth, where he serves as Chair of the university’s AI Leadership and as Core Leadership of Dartmouth's Cybersecurity Research Cluster. His research is driven by two interconnected questions:- How can we design theoretically principled AI algorithms that provably resist becoming instruments of social or political harm? - How can we design theoretically principled AI algorithms that transform the raw historical record of politics into the evidence base for a more comprehensive and empirically rigorous political science?As 1 of only 5 academic labs worldwide supported by OpenAI Cybersecurity, his recent research challenges the prevailing view that data privacy leakage in AI systems is driven by the tendency of models to memorize their training data.  A second recent stream of research published the largest known dataset of political videos, as well as novel AI and Causal Inference algorithms to allow us to learn foundational political patterns from these exciting new data sources. More broadly, the various streams of his research all share the goal of designing more powerful, secure, and interpretable AI algorithms for machine learning in a complex, unfair, and adversarial world.His work has been published in top AI/ML venues such as ICML, NeurIPS, KDD, and Nature. Previously, he was an academic collaborator with Facebook and Meta Research, where he built machine learning algorithms to help detect billions of fake social media accounts. His work has also been funded by the US National Science Foundation (NSF), and he is an affiliate of Harvard's Weatherhead Center for International Affairs, Harvard's Institute for Quantitative Social Science (IQSS), and Dartmouth's Institute for Security Technology Studies (ISTS).*JOIN US — APPLY TO THE DARTMOUTH PhD* Contact:adam.breuer ‘at’ dartmouth.edubreuer ‘at’ g.harvard.edu",
  "content_length": 2156,
  "method": "requests",
  "crawl_time": "2025-12-01 15:40:13"
}