{
  "name": "Adam Lerner",
  "homepage": "https://www.khoury.northeastern.edu/people/ada-lerner",
  "status": "success",
  "content": "Ada Lerner - Khoury College of Computer Sciences All People Ada Lerner (she/her/hers or they/them/theirs) Assistant Professor, Director of BS in Cybersecurity Program Research interests Research interests Human–computer interaction Security and privacy Education Education PhD in Computer Science and Engineering, University of Washington MS in Computer Science and Engineering, University of Washington BA in Computer Science, Amherst College Biography Biography Ada Lerner is an assistant professor and the director of the BS in Cybersecurity program at the Khoury College of Computer Sciences at Northeastern University, based in Boston. Lerner researches human–computer interaction and security and privacy, and is a member of Northeastern's Cybersecurity and Privacy Institute. She has published at the Symposium on Usable Privacy, ACM CHI, ACM CCS, and IEEE Symposium on Security and Privacy. Prior to joining Northeastern, she worked as an assistant professor at Wellesley College. Outside of work, Lerner enjoys games of all kinds, including board games, card games, puzzles, crosswords. Recent publications Recent publications Published: May 2, 2025 “A Blocklist is a Boundary”: Tensions between Community Protection and Mutual Aid on Federated Social Networks Citation: Erika Melder, Ada Lerner, Michael A. DeVito. (2025). \"A Blocklist is a Boundary\": Tensions between Community Protection and Mutual Aid on Federated Social Networks Proc. ACM Hum. Comput. Interact., 9, 1-30. https://doi.org/10.1145/3710919 Published: August 1, 2024 Investigating Moderation Challenges to Combating Hate and Harassment: The Case of Mod-Admin Power Dynamics and Feature Misuse on Reddit Citation: Madiha Tabassum, Alana Mackey, Ashley Schuett, Ada Lerner. (2024). Investigating Moderation Challenges to Combating Hate and Harassment: The Case of Mod-Admin Power Dynamics and Feature Misuse on Reddit USENIX Security Symposium. https://www.usenix.org/conference/usenixsecurity24/presentation/tabassum Published: August 1, 2024 ‘Custodian of Online Communities’: How Moderator Mutual Support in Communities Help Fight Hate and Harassment Online Citation: Madiha Tabassum, Alana Mackey, Ada Lerner. (2024). 'Custodian of Online Communities': How Moderator Mutual Support in Communities Help Fight Hate and Harassment Online SOUPS @ USENIX Security Symposium, 297-314. https://www.usenix.org/conference/soups2024/presentation/tabassum-madiha Published: May 11, 2024 Counting Carrds: Investigating Personal Disclosure and Boundary Management in Transformative Fandom Citation: Kelly Wang, Dan Bially Levy, Kien T. Nguyen, Ada Lerner, Abigail Marsh. (2024). Counting Carrds: Investigating Personal Disclosure and Boundary Management in Transformative Fandom CHI, 575:1-575:13. https://doi.org/10.1145/3613904.3642664 Published: April 26, 2024 Privacy Norms of Transformative Fandom: A Case Study of an Activity-Defined Community Citation: Abby Marsh, Ada Lerner. (2024). Privacy Norms of Transformative Fandom: A Case Study of an Activity-Defined Community Proc. ACM Hum. Comput. Interact., 8, 1-29. Published: December 24, 2023 SoK: Technical Implementation and Human Impact of Internet Privacy Regulations Citation: Eleanor Birrell, Jay Rodolitz, Angel Ding, Jenna Lee, Emily McReynolds, Jevan Hutson, Ada Lerner. (2023). SoK: Technical Implementation and Human Impact of Internet Privacy Regulations CoRR, abs/2312.15383. https://doi.org/10.48550/arXiv.2312.15383 Published: September 20, 2023 “It’s a Fair Game”, or Is It? Examining How Users Navigate Disclosure Risks and Benefits When Using LLM-Based Conversational Agents Citation: Zhiping Zhang, Michelle Jia, Hao-Ping Hank Lee, Bingsheng Yao, Sauvik Das, Ada Lerner, Dakuo Wang, Tianshi Li. (2023). \"It's a Fair Game\", or Is It? Examining How Users Navigate Disclosure Risks and Benefits When Using LLM-Based Conversational Agents CoRR, abs/2309.11653. https://doi.org/10.48550/arXiv.2309.11653 Published: November 14, 2022 Buying Privacy: User Perceptions of Privacy Threats from Mobile Apps Citation: Jenny Tang, Hannah Shoemaker, Leah Teffera, Eleanor Birrell, Ada Lerner. (2022). Buying Privacy: User Perceptions of Privacy Threats from Mobile Apps CoRR, abs/2211.07235. https://doi.org/10.48550/arXiv.2211.07235 Published: August 7, 2022 How Well Do My Results Generalize Now? The External Validity of Online Privacy and Security Surveys Citation: Jenny Tang, Eleanor Birrell, and Ada Lerner. \"How Well Do My Results Generalize Now? The External Validity of Online Privacy and Security Surveys.\" In Symposium on Usable Privacy and Security (SOUPS), 2022. Published: July 11, 2022 The Buffet Overflow Café Citation: Tadayoshi Kohno, Camille Cobb, Ada Lerner, Michelle Lin, Adam Shostack. (2022). The Buffet Overflow Café IEEE Secur. Priv., 20, 4-7. https://doi.org/10.1109/MSEC.2022.3173122 Published: March 16, 2021 Defining Privacy: How Users Interpret Technical Terms in Privacy Policies Citation: Jenny Tang, Hannah Shoemaker, Ada Lerner, and Eleanor Birrell. \"Defining Privacy: How Users Interpret Technical Terms in Privacy Policies.\" In Proceedings on Privacy Enhancing Technologies, 2021(3):70-94., 2021. DOI: 10.2478/popets-2021-0038 Published: April 23, 2020 Privacy and Activism in the Transgender Community Citation: Ada Lerner, Helen Yuxun He, Anna Kawakami, Silvia Catherine Zeamer, and Roberto Hoyle. 2020. Privacy and Activism in the Transgender Community. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI '20). Association for Computing Machinery, New York, NY, USA, 1–13. DOI: 10.1145/3313831.3376339 Individual Details Tenured/Tenure-Track Faculty Campus Boston Website https://adalerner.com/ Areas of Interest Human-Centered Computing Cybersecurity and Privacy Contact a.lerner@northeastern.edu Related news Research that hits home: Leah Rosenbloom fights to balance privacy and activism online November 24, 2025 Explore all news Current PhD students Ashutosh Kshirsagar PhD Student Read bio Locations Close this dialog window Boston Norrec Nieh PhD Student Read bio Locations Close this dialog window Boston Christopher Pellegrini PhD Student Read bio Locations Close this dialog window Boston Jay Rodolitz PhD Student Read bio Locations Close this dialog window Boston Kelly Wang PhD Student Read bio Locations Close this dialog window Boston",
  "content_length": 6351,
  "method": "requests",
  "crawl_time": "2025-12-01 12:29:01"
}