{
  "name": "Adam White 0001",
  "homepage": "https://sites.ualberta.ca/~amw8",
  "status": "success",
  "content": "Adam White's Research Page Adam White Associate Professor Canada CIFAR AI Chair Director of the Alberta Machine Intelligence Institute (Amii) PI of the Reinforcement Learning and Artificial Intelligence Lab (RLAI) Department of Computing Science University of Alberta amw8@ualberta.ca (780) 908-5499 My Students If you are interested in joining my group as an MSc student, please message me with your transcripts (converted to a 4.0 GPA system) and CV. Admission is based on grades, previous research experience, your research statement, and the quality of your reference letters. All students accepted to our MSc program get guaranteed TA funding. If you would like to work with me, mention my favorite TV show Stargate. Jacob Adkins (PhD) Armin Ashrafi (MSc) Marie Del Valle (MSc) Oliver Diamond (MSc) Cameron Jen (MSc) Anffany Chen (Pdf) Ty Lazar (MSc) Baxter Madore (MSc) Parham Mohammad Panahi (PhD) Samuel Neumann (PhD) Sam Scholnick-Hughes (MSc) Steven Tang (MSc) Eric Xiong (MSc) Nathan Zeweniuk (MSc) Allumni Han Wang (PhD, 2025) Tom Ferguson (Pdf, 2025) Jacob Adkins (MSc, 2025) Golnaz Mesbahi (MSc, 2024) Parham Mohammad Panahi (MSc, 2024) Kevin Roice (MSc, 2024) Jordan Coblin (MSc, 2024) Banafshe Rafiee (PhD, 2024) Matthew Schlegel (PhD, 2023) Eugene Chen (MSc, 2023) Subhojeet Pramanik (MSc, 2023) Edan Meyer (MSc, 2023) David Tao (MSc, 2022) Samuel Neumann (MSc, 2022) Derek Li (MSc, 2022) Paul Liu (MSc, 2022) Sina Ghiassian (PhD, 2022) Raksha Kumaraswamy (PhD, 2021) Matt McLeod (MSc, 2021) Archit Sakhadeo (MSc, 2021) Xutong Zhao (MSc, 2021) Cam Linke (MSc, 2020) Han Wang (MSc, 2020) Niko Yasui (MSc, 2020) Andrew Jacobsen (MSc, 2019) Banafsheh Rafiee (MSc, 2018) Teaching Empirical Design in Reinforcement Learning Coursera Specialization on Reinforcement Learning INT-D 161: AI Everywhere - Fall 2025: Section A1 Syllabus (in person); Section 800 & 801 Syllabus (online) INT-D 161: AI Everywhere - Winter 2025 INT-D 161: AI Everywhere - Winter 2024 CMPUT 655: Reinforcement Learning I - Fall 2022 CMPUT 365: Introduction to Reinforcement Learning I - Fall 2021 CMPUT 607: Empirical Reinforcement Learning - Winter 2021 CMPUT 397: Reinforcement Learning I - Fall 2019 CMPUT 366: Intelligent Systems - Fall 2018 CMPUT 366: Intelligent Systems - Fall 2017 CMPUT 609: Reinforcement Learning - Fall 2017 CSCI-B 659: Reinforcement learning for Artificial Intelligence - Spring 2017 CSCI-B 659: Reinforcement learning for Artificial Intelligence - Spring 2016 Research Keywords: Continual Learning, Reinforcement Learning, Robotics, Knowledge Representation and Intrinsic Motivation Adam's research is focused on understanding the fundamental principles of learning in both simulated worlds and industrial control applications. His research program explores how the problem of intelligence can be modeled as a reinforcement-learning agent continually interacting with some unknown environment, learning from a scalar reward signal, rather than explicit feedback. Adam's group is deeply passionate about good empirical practices and new methodologies to help determine if our algorithms are ready for deployment in the real world. Adam has pioneered applications of reinforcement learning to real drinking and wastewater treatment plants and is the co-founder of RL Core Technologies, a startup applying AI and machine learning across industrial control. Curriculum vitae My current CV can be found here. Journal Papers Samuel Neumann, Jiamin He, Adam White, and Martha White (2025). Investigating the Utility of Mirror Descent in Off-policy Actor-Critic. The Reinforcement Learning Journal. Thomas Ferguson, Alona Fyshe, and Adam White (2025). Modelling human exploration with light-weight meta reinforcement learning algorithms. The Reinforcement Learning Journal. Esraa Elelimy, Brett Daley, Andrew Patterson, Marlos C. Machado, Adam White, and Martha White (2025). Deep Reinforcement Learning with Gradient Eligibility Traces. The Reinforcement Learning Journal. Ferguson, T., Fyshe, A., White, A. (2025). Electrophysiological signatures of the effect of context on exploration: Greater attentional and learning signals when exploration is costly. Brain Research. S. Pramanik, E. Elelimy,M. C. Machado, and A. White (2024). AGaLiTe: Approximate Gated Linear Transformers for Online Reinforcement Learning Transactions on Machine Learning Research (TMLR). Patterson, A., Neumann, S., White, M., White, A. (2024). Empirical Design in Reinforcement Learning. Journal of Machine Learning Research. Lo, C., Roice, K., Panahi, P. M., Jordan, S., White, A., Mihucz, G., Aminmansour, F., White, M. (2024). Goal-Space Planning with Subgoal Models. Journal of Machine Learning Research. Edan Jacob Meyer, Adam White, and Marlos C. Machado (2024). Harnessing Discrete Representations for Continual Reinforcement Learning. The Reinforcement Learning Journal. Scott M. Jordan, Samuel Neumann, James E. Kostas, Adam White, and Philip S. Thomas (2024). The Cliff of Overcommitment with Policy Gradient Step Sizes. The Reinforcement Learning Journal. Parham Mohammad Panahi, Andrew Patterson, Martha White, and Adam White (2024). Investigating the Interplay of Prioritized Replay and Generalization. The Reinforcement Learning Journal. Andrew Patterson, Samuel Neumann, Raksha Kumaraswamy, Martha White, and Adam White (2024). The Cross-environment Hyperparameter Setting Benchmark for Reinforcement Learning. The Reinforcement Learning Journal. Wang, H., Miahi, E., White, M., Machado, M. C., Abbas, Z., Kumaraswamy, R., Liu, V., & White, A. (2024). Investigating the Properties of Neural Network Representations in Reinforcement Learning. AI Journal. Sutton, R. S., Machado, M. C., Holland, G. Z., Timbers, D. S. F., Tanner, B., & White, A. (2023). Reward-respecting subtasks for model-based reinforcement learning. AI Journal Ferguson, T. D., Fyshe, A., White, A., Krigolson, O. E. (2023). Humans adopt different exploration strategies depending on the environment. Computational Brain & Behavior Janjua, M. K., Shah, H., White, M., Miahi, E., Machado, M. C., & White, A. (2023). GVFs in the Real World: Making Predictions Online for Water Treatment. Special issue on reinforcement learning for real life. Machine Learning Journal. Tao, R. Y., Machado, M. C., White, A. (2023). Agent-State Construction with Auxiliary Inputs. Transactions on Machine Learning Research Schlegel, M., Tkachuk, V., White, A. White, M. (2022). Investigating Action Encodings in Recurrent Neural Networks in Reinforcement Learning. Transactions on Machine Learning Research. Wang, A., Sakhadeo, A., White, A., Bell, J. M., Liu, V., Zhao, X., Kozuno, T., Fyshe, A., White, A. (2022). No More Pesky Hyperparameters: Offline Hyperparameter Tuning for RL. Transactions on Machine Learning Research. Patterson, A., White, A., White, M. (2022). A Generalized Projected Bellman Error for Off-policy Value Estimation in Reinforcement Learning. Journal of Machine Learning Research. Rafiee, B., Abbas, Z., Ghiassian, S., Kumaraswamy, R., Sutton, R. S., Ludvig, E. & White, A. (2022). From eye-blinks to state construction: diagnostic benchmarks for online representation learning. Adaptive Behavior. Schlegel, M., Jacobsen, A., Zaheer, M., Patterson, A., White, A., & White, M. (2021). General value function networks. Journal of Artificial Intelligence Research. Linke, C., Ady, N. M., White, M., Degris, T., & White, A. (2020). Adapting behaviour via intrinsic reward: A survey and empirical study. Journal of Artificial Intelligence Research. Modayil, J., White, A., Sutton, R. S. (2014). Multi-timescale Nexting in a Reinforcement Learning Robot. Adaptive Behavior, 22(2):146--160. Whiteson, S., Tanner, B., & White, A. (2010). The reinforcement learning competitions. AI Magazine, 31(2): 81--94. Tanner, B., & White, A. (2009). RL-Glue: Language-independent software for reinforcement-learning experiments. The Journal of Machine Learning Research, 10: 2133--2136. Conference Papers Mesbahi, G., Panahi, P. M., Mastikhina, O., Tang, S., White, M., & White, A. (2025). Position: Lifetime tuning is incompatible with continual reinforcement learning. International Conference on Machine Learning. Adkins, J, Bowling, M., White, A. (2024). Method for Evaluating Hyperparameter Sensitivity in Reinforcement Learning. Advances in Neural Information Processing Systems. Elelimy, E., White, A., Bowling, M., White, M. (2024). Real-Time Recurrent Learning using Trace Units in Reinforcement Learning. Advances in Neural Information Processing Systems. Jordan, S. M, White, A., Castro da Silva, B., White, M., Thomas, P. S. (2024). Position: Benchmarking is Limited in Reinforcement Learning Research. International Conference on Machine Learning. Rolnick, D., Aspuru-Guzik, A., Beery, S., Dilkina, B., Donti, P. L., Ghassemi, M., Kerner, H., Monteleoni, C., Rolf, E., Tambe, M., White. A. (2024) Position: Application-Driven Innovation in Machine Learning. International Conference on Machine Learning. Eugene Chen, Adam White, Nathan R. Sturtevant. (2023). Entropy as a measure of puzzle difficulty. Artificial Intelligence and Interactive Digital Entertainment. Zaheer Abbas, Rosie Zhao, Joseph Modayil, Adam White, Marlos C. Machado. (2023) Loss of Plasticity in Continual Deep Reinforcement Learning. International Conference on Lifelong Learning Agents. Vincent Liu, Han Wang, Ruo Yu Tao, Khurram Javed, Adam White, Martha White. (2023) Measuring and Mitigating Interference in Reinforcement Learning. International Conference on Lifelong Learning Agents. Banafsheh Rafiee, Sina Ghiassian, Jun Jin, Richard S. Sutton, Jun Luo, Adam White. (2023) Auxiliary task discovery through generate-and-test. International Conference on Lifelong Learning Agents. Chenjun Xiao, Han Wang, Yangchen Pan, Adam White, Martha White. (2023). The In-Sample Softmax for Offline Reinforcement Learning. International Conference on Learning Representations. Samuel Neumann, Sungsu Lim, Ajin George Joseph, Yangchen Pan, Adam White, Martha White. ",
  "content_length": 16477,
  "method": "requests",
  "crawl_time": "2025-12-01 12:29:07"
}