{
  "name": "Adam A. Porter",
  "homepage": "https://www.cs.umd.edu/users/aporter",
  "status": "success",
  "content": "Adam A. Porter Email: aporter@cs.umd.edu Phone: (301) 405-2702, Fax: (301) 405-6707 Office: 4125 A.V. Williams Positions: Professor: Dept. of Computer Science,University of Maryland and University of Maryland Institute for Advanced Computing Studies (UMIACS) Awards and Honors: Mobile Learning Fellow, 2010, UMD OIT/Center for Teaching Excellence. Senior Member IEEE, 2003, ACM 2006. NSF Faculty Early Career Development Award 1995--1998 Dean's Award for Teaching Excellence, CMPS 1995 Academic Degree: Ph.D. University of California at Irvine, 1991 Professional Service: Served on editorial boards of the IEEE Transactions on Software Engineering and the ACM Transactions on Software Engineering and Methodology Co-organizer: New Visions for Software Design & Productivity: Research & Applications Workshop of the Interagency Working Group for Information Technology Research and Development (ITRD) Software Design and Productivity (SDP) Coordinating Group. Click here for final report. News and Events: World's first MOOC on developing applications with Android. To learn about MOOCs (Massive Online Open Courseware) and to support my flipped classroom offering of CMSC436: Programming Handheld Systems, On September 2, 2013, I opened up my own MOOC, \"Programming Handheld Systems with Android\" at https://www.learn-android.appspot.com. Feel free to take a look and give me suggestions for improvement. I will be offering an improved version of this course on the Coursera platform. You sign up for that course at http://coursera.org/course/android I recently appeared on the Kojo Nnamdi Show where I discussed the booming job market in mobile application development. Tech Tuesday: Where the Jobs Are Android Teaching Materials: Programming the Android Platform: A Student-Driven Effort to Develop Open-Source Android Teaching Materials Link to Fall 2011 CMSC436: Programming Handheld Devices. My paper \"A.A. Porter and R.W. Selby, Empirically Guided Software Development Using Metric-Based Classification\" was listed as one of the 20 most-widely cited articles published in the 25 year history of IEEE Software. Atif Memon and I gave a lecture about our research at Google's 2nd Conference on Test Automation in New York, August 23-24, 2007. Click here to view the lecture, entitled \" Skoll: A System and Approach for Distributed Continuous Quality Assurance\" on YouTube. The accompanying presentation slides can be found here. Mobile App Development MobileTeacher -- YouTube demo My CV",
  "content_length": 2490,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:30"
}