{
  "name": "Adel Abusitta",
  "homepage": "https://www.polymtl.ca/expertises/en/abusitta-adel",
  "status": "success",
  "content": "Abusitta, Adel | Directory of Experts Skip to main content Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission Visit Us Make a donation © Polytechnique Montréal 2025. Poly Directory Courses Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission © Polytechnique Montréal 2025. Directory of Experts Abusitta, Adel Poly Directory Courses Français Directory of Experts Abusitta, Adel Directory of Experts Back to search results Edit my profileHelp Publications Adel Abusitta PhD (Polytechnique Montreal), Post-Doc. (University of Montreal), Post-Doc. (McGill University) Publications Assistant Professor Department of Computer Engineering and Software Engineering Phone: (514) 340-4711 Ext. 3331 Fax: (514) 340-5139 Room: M-3412 adel.abu-sitta@polymtl.ca Research interests and affiliations Research interests Cybersecurity Secure and resilient Artificial Intelligence Trustworthy and explainable Artificial Intelligence Artificial Intelligence for Cybersecurity AI-powered Malware Analysis IoT Security Intrusion Detection Systems Cloud Computing Security Expertise type(s) (NSERC subjects) 2507 Communications systems 2508 Communications networks 2521 Mobile and personal communication 2525 Wireless communication systems Publications Featured Journal article Abusitta, A., Li, M. Q., & Fung, B. C. M. (2024). Survey on explainable AI : techniques, challenges and open issues. Expert Systems With Applications, 255, 124710 (18 pages). Conference paper Abusitta, A., Halabi, T., Bataineh, A. S., & Zulkernine, M. (2024, June). Generative Adversarial Networks for Robust Anomaly Detection in Noisy IoT Environments [Paper]. IEEE International Conference on Communications (ICC 2024), Denver, CO, USA. See all publications (37) Biography Dr. Adel Abusitta is an Assistant Professor in the Department of Computer and Software Engineering at Polytechnique Montreal. His main expertise lies in AI-powered Cybersecurity, Secure AI, IoT Security, and Malware Analysis. Dr. Abusitta worked on designing and implementing AI-powered Data Analytics for Discerning Malware Intent in collaboration with Defence Research and Development Canada (DRDC). Additionally, he has been involved in designing and implementing novel methodologies, techniques, and models for the early detection, prevention, and mitigation of cyber-attacks. Before joining Polytechnique Montreal, Dr. Abusitta served as a data-driven cybersecurity researcher and consultant at the Institute for Data Valorization (IVADO). He has worked closely with industrial partners to identify best practices for synthesizing sensitive data while achieving privacy-preserving machine learning without compromising accuracy. Education Ph.D. in Computer Engineering (Polytechnique Montreal) Postdoctoral Fellow (University of Montreal) Postdoctoral Fellow (McGill University) Propective StudentStudent ZoneEmployee ZoneMediaFondation & AlumniEmergencyJobs Offers Studies Studies (Registrar)Programs of StudiesSchedule and Courses DirectoryLibraryDepartmentsFinancial Assistance & Bursaries*Technical Societies*Internships & JobsOffice of Student Affairs*Go-Poly Research General Informations*Directory of ExpertsChairs, Groups & LaboratoriesResearch Projects for Graduate Students Company Hiring an Intern or a GraduateAcquiring a TechnologyConducting Partnered Research*Accessing our Research Infrastructure#Develop your Employees About Us General InformationsOfficial DocumentsInternationalWomen & EngineeringSustainable Development*Propolys (Entrepreneuship Support)*GouvernanceDirectories & ServicesPrivacy Notice and Terms of useAccessibilityContact Information & Campus Maps 2500, chemin de Polytechnique Montréal (Québec) H3T 1J4 (514) 340-4711 Follow us! Make a donation",
  "content_length": 4110,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:38"
}