{
  "name": "Adel Elmaghraby",
  "homepage": "http://louisville.edu/speed/people/faculty/elmaghrabyAdel",
  "status": "success",
  "content": "Adel S Elmaghraby » logowhite logofullcolor googlescholar checkmark_red checkmark_checkmark envelope instagram phone pointer seemore menu chevron_black chevron_blue chevron_red chevron_white contactwatermark coopwatermark relatedwatermark chevron close facebook flickr home linkedin minus pinterest play plus quote search twitter youtube Adel Elmaghraby Director of Research and Innovation Adel S. Elmaghraby, an IEEE Life Senior Member, is the Speed School Director of Industrial Research and Innovation and Winnia Professor of CSE and former chairman of the Computer Engineering and Computer Science Department at the University of Louisville. He has also held appointments at Carnegie Mellon's Software Engineering Institute and the University of Wisconsin-Madison, and has advised over 60 master's graduates and 24 doctoral graduates. His research and publications span intelligent systems, neural networks, cyber-security, visualization and simulation. The IEEE-Computer Society has recognized his work with multiple awards including a Golden Core membership.EducationB.S. in Computer Science, Alexandria University, 1973M.S. in Electrical Engineering, University of Wisconsin-Madison, 1978Ph.D. in Electrical Engineering, University of Wisconsin-Madison, 1982PublicationsDetection of Volatile Compounds Emitted by Bacteria in Wounds Using Gas Sensors- 2019In this paper we analyze an experiment for the use of low-cost gas sensors intended to detect bacteria in wounds using a non-intrusive technique. Seven different genera/species of microbes tend to be present in most wound infections. Detection of these bacteria usually requires sample and laboratory testing which is costly, inconvenient and time-consuming. The validation processes for these sensors with nineteen types of microbes (1 , 2 , 6 , 1 , 1 , 2 and 6 ) are presented here, in which four sensors were evaluated: TGS-826 used for ammonia and amines, MQ-3 used for alcohol detection, MQ-135 for CO₂ and MQ-138 for acetone detection. Validation was undertaken by studying the behavior of the sensors at different distances and gas concentrations. Preliminary results with liquid cultures of 10⁸ CFU/mL and solid cultures of 10⁸ CFU/cm of the 6 strains revealed that the four gas sensors showed a response at a height of 5 mm. The ammonia detection response of the TGS-826 to showed the highest responses for the experimental samples over the background signals, with a difference between the values ​​of up to 60 units in the solid samples and the most consistent and constant values. This could suggest that this sensor is a good detector of , and the recording made of its values ​​could be indicative of the detection of this species. All the species revealed similar CO₂ emission and a high response rate with acetone for , and . Additional Publications Journal Articles Elmaghraby, A., S. (2021). Editorial: Enabling Wearable Brain Technologies - Methods and Applications. Frontiers in Human Neuroscience Dekhil, O., Ali, M., Elnakieb, Y., Shalaby, A., Soliman, A., Switala, A., Mahmoud, A., Ghazal, M., Hajjdiab, H., Casanova, M., F., Elmaghraby, A., S., Keynton, R., S., El-Baz, A., S. & Barnes, G., N. (2020). A Personalized Autism Diagnosis CAD System Using a Fusion of Structural MRI and Resting-State Functional MRI Data. Frontiers in Psychiatry, 10 Elmaghraby, A., S. (2021). Breast Lesions Detection and Classification via YOLO-Based Fusion Models. Computers, Materials & Continua Baccouche, A., Ahmed, S., Sierrasosa, D., E. & Elmaghraby, A., S. (2020). Malicious Text Identification: Deep Learning from Public Comments and Emails. Information Telahun, M., Sierrasosa, D., E. & Elmaghraby, A., S. (2020). Heuristic Analysis for In-Plane Non-Contact Calibration of Rulers Using Mask R-CNN. Information Baccouche, A., Garcia Zapirain Soto, M., B., Olea, C., C. & Elmaghraby, A., S. (2020). Ensemble Deep Learning Models for Heart Disease Classification: A Case Study from Mexico. Information Elmaghraby, A., S. (2021). IoT in Smart Cities: A Survey of Technologies, Practices and Challenges. Smart Cities Elmaghraby, A., S. (2021). A novel technology to integrate imaging and clinical markers for non-invasive diagnosis of lung cancer. Scientific Reports Elmaghraby, A., S. (2021). Diabetes Type 2: Poincare Data Preprocessing for Quantum Machine Learning. Computers, Materials & Continua Elmaghraby, A., S. (2021). Exploiting Deep Learning Techniques for Colon Polyp Segmentation. Computers, Materials & Continua Aliradi, R., Belkhir, A., Ouamane, A. & Elmaghraby, A., S. (2018). DIEDA: discriminative information based on exponential discriminant analysis combined with local features representation for face and kinship verification. Multimedia Tools and Applications, 1--18Reda, I., Khalil, A., Elmogy, M., Abou El-Fetouh, A., Shalaby, A., Abou El-Ghar, M., Elmaghraby, A., S., Ghazal, M. & El-Baz, A., S. (2018). Deep Learning Role in Early Diagnosis of Prostate Cancer. Technology in cancer research & treatment, 17, 1533034618775530Shaffie, A., Soliman, A., Fraiwan, L., Ghazal, M., Taher, F., Dunlap, N., Wang, B., van Berkel, V., Keynton, R., S., Elmaghraby, A., S. & El-Baz, A., S. (2018). A Generalized Deep Learning-Based Diagnostic System for Early Diagnosis of Various Types of Pulmonary Nodules. Technology in Cancer Research & Treatment, 17, 1533033818798800Sierra-Sosa, D., Tebaldi, M., Grumel, E., Rabal, H. & Elmaghraby, A., S. (2018). Localized analysis of paint-coat drying using dynamic speckle interferometry. Optics and Lasers in Engineering, 106, 61--67Garcia-Zapirain, B., Shalaby, A., El-Baz, A., S. & Elmaghraby, A., S. (2017). Automated framework for accurate segmentation of pressure ulcer images. Computers in biology and medicine, 90, 137--145Losavio, M., M. & Elmaghraby, A., S. (2017). Security and the Transnational Information Polity. Journal of Digital Forensics, Security and Law, 12(3), 67--76Zheng, Y., Blasch, E., P., Elmaghraby, A., S., Zheng, Y., F., Blasch, E. & Elmaghraby, A., S. (2016). Biologically Inspired Methods for Imaging, Cognition, Vision, and Intelligence. Computational Intelligence and Neuroscience, 2016, 2402067McClure, P., Khalifa, F., Soliman, A., Abou El-Ghar, M., Gimelfarb, G., Elmaghraby, A., S. & El-Baz, A., S. (2014). A Novel NMF Guided Level-Set for DWI Prostate Segmentation. Journal of Computer Science & System Biology, 7(6), 209–216Sliman, H., Elnakib, A., Beache, G., Elmaghraby, A., S. & El-Baz, A., S. (2014). Assessment of Myocardial Function from Cine Cardiac MRI using A Novel 4D Tracking Approach. Journal of Computer Science & System Biology, 7(5), 169-173Elmaghraby, A., S., El-Baz, A., S., Firjani, A., Elnakib, A., Khalifa, F., Gimel'farb, G., Abou El-Ghar, M. & Gimel’farb, G. (2013). A diffusion-weighted imaging based diagnostic system for early detection of prostate cancer. Journal of Biomedical Science and Engineering, 6, 346-356Sliman, H., Khalifa, F., Elnakib, A., Soliman, A., El-Baz, A., Beache, G., Elmaghraby, A. & Gimel'farb, G. (2013). Myocardial borders segmentation from cine MR images using bidirectional coupled parametric deformable models. MEDICAL PHYSICS, 40(9)Abbaschian, B., J., Sierra-Sosa, D. & Elmaghraby, A. (2021). Deep Learning Techniques for Speech Emotion Recognition, from Databases to Models. Sensors (Basel, Switzerland), 21(4)Ahmed, S., Gentili, M., Sierra-Sosa, D., Elmaghraby, . & S., A. (2022). Multi-layer data integration technique for combining heterogeneous crime data. Information Processing & Management, 59(3)Asghari, M., Nielsen, J., Gentili, M., Koizumi, N. & Elmaghraby, A. (2022). Classifying Comments on Social Media Related to Living Kidney Donation: Machine Learning Training and Validation Study. JMIR Medical Informatics, 10(11), e37884Asghari, M., Sierra-Sosa, D. & Elmaghraby, A., S. (2022). BINER: A low-cost biomedical named entity recognition. Information Sciences, 602, 184--200Baccouche, A., Garcia-Zapirain, B. & Elmaghraby, A. (2022). An integrated Framework for Breast Mass Classification and Diagnosis using Stacked Ensemble of Residual Neural Networks. Scientific Reports, 12, 1--17Baccouche, A., Garcia-Zapirain, B., Castillo Olea, C. & Elmaghraby, A., S. (2021). Connected-UNets: a deep learning architecture for breast mass segmentation. NPJ breast cancer, 7(1), 151Baccouche, A., Garcia-Zapirain, B., Zheng, Y. & Elmaghraby, A., S. (2022). Early detection and classification of abnormality in prior mammograms using image-to-image translation and YOLO techniques. Computer Methods and Programs in Biomedicine, 221, 106884Bouzid, A., Sierra-Sosa, D. & Elmaghraby, A. (2022). Directional Statistics-Based Deep Metric Learning for Pedestrian Tracking and Re-Identification. Drones, 6(11), 328Bouzid, A., Sierra-Sosa, D. & Elmaghraby, A. (2023). A Robust Pedestrian Re-Identification and Out-Of-Distribution Detection Framework. Drones, 7(6), 352Bouzid, A., Sierra-Sosa, D. & Elmaghraby, A. (2023). An Integrated vMF Embedding and VOS Framework for Robust Pedestrian Re-Identification and Out-of-Distribution Detection.Sleman, A., A., Soliman, A., Elsharkawy, M., Giridharan, G., Ghazal, M., Sandhu, H., Schaal, S., Keynton, R., Elmaghraby, A. & El-Baz, A. (2021). A novel 3D segmentation approach for extracting retinal layers from optical coherence tomography images. Medical physics, 48(4), 1584-1595Syed, A., S., Sierra-Sosa, D., Kumar, A. & Elmaghraby, A. (2021). A Hierarchical Approach to Activity Recognition and Fall Detection Using Wavelets and Adaptive Pooling. Sensors (Basel, Switzerland), 21(19)Syed, A., S., Sierra-Sosa, D., Kumar, A. & Elmaghraby, A. (2022). A deep convolutional neural network-xgb for direction and severity aware fall detection and activity recognition. Sensors, 22(7), 2547Syed, A., S., Sierra-Sosa, D., Kumar, A. & Elmaghraby, A. (2022). Making Cities Smarter—Optimization Problems for the IoT Enabled Smart City Development: A Mapping of Applications, Objectives, Constraints. Sensors, 22(12), 4380Youssef, B., Alksas, A., Shal",
  "content_length": 23110,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:40"
}