{
  "name": "Adi Akavia",
  "homepage": "https://sites.google.com/view/akavia",
  "status": "success",
  "content": "Adi Akavia (01/2025)Search this siteEmbedded FilesSkip to main contentSkip to navigationContact InformationE-mail:     akavia at cs.haifa.ac.ilOffice:    Amir Bld. Room 212, 16 HaNamal St., HaifaComputer Science Dept., University of Haifa, 199 Aba Khoushy Ave., Mt. Carmel, Haifa, IsraelAdi Akavia   עדי עקביהI am an Associate Professor at the University of Haifa, Department of Computer Science. My research interest lies in Theoretical & Applied Cryptography, Complexity Theory and Algorithms. I am the Director of the Biometric Research Subcenter of the Center for Cyber Law & Policy (CCLP) at the University of Haifa. Additionally, I am an affiliated researcher at the Foundation & Application of Cryptography Theory (FACT) research center at Reichman University since 2013. During 2019-2022 I was an affiliated researcher also with the Center for Research in Applied Cryptography and Cyber Security at Bar Ilan University.At 2017 I have founded and directed the Tel-Aviv Jaffa Cybersecurity Research Institute (JCRC) at the Academic College of Tel-Aviv Jaffa, where I served as a Senior Lecturer (tenured).My post-doctoral training is from the Institute for Advanced Studies (IAS) Princeton NJ, DIMACS Rutgers University NJ, and the Weizmann Institute of Science. My PhD studies were at MIT; MSc at Tel-Aviv University, and BSc at the Hebrew University.Publications *See also my Google-Scholar profileProfessional & Organizational ActivitiesStudents & Post-DocsTeachingFundingImplementation Projects & SoftwareFurther ResourcesThank You to the Israel Science Foundation, BIU Cyber Center, Haifa Center for Cyber Law and Policy, ICRC Blavatnik Interdisciplinary Cyber Research Center, FACT Center, and Israel National Cyber Directorate for their generous support. Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 1841,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:39"
}