{
  "name": "Adil Ahmad",
  "homepage": "https://adil-ahmad.net",
  "status": "success",
  "content": "Adil Ahmad I am an assistant professor in the School of Computing and Augmented Intelligence (SCAI) at Arizona State University (ASU). My research interests broadly lie within the domains of computer security, systems, and architecture. My research goal is to protect sensitive data from powerful adversaries. To this end, I routinely leverage hardware-assisted trusted execution environments while addressing their fundamental limitations in terms of protection and usability. I also design new principles to strengthen critical system software (like operating systems and hypervisors) on a computer. I am a receipient of a US DoD Defense Established Program to Stimulate Competitive Research (DEPSCoR) Award. Before joining ASU, I spent many enjoyable years obtaining a PhD from Purdue (go boilermakers!), where I was extremely fortunate to work with Pedro Fonseca and Byoungyoung Lee. During my PhD, I greatly enjoyed interning at Microsoft Research and NEC Labs, where I worked with Sangho Lee, Marcus Peinado, and Chung Hwan Kim. ❗ I am looking to hire PhD students for exciting systems and security research projects. If you are interested in working in this area, please reach out through email. ⚠️ I do not hire students as graders or TAs for a class, if they have not previously taken the class. Recent Updates Gave a talk at Seoul National University (SNU) on our recent research endeavours towards designing a secure logging infrastructure for mission-critical computers. Laputa was accepted to appear at ISOC NDSS 2025! Pooyan Fazli, Hasti Seifi, and I have received a 2024 Google ExploreCSR award to expand our outreach activities (including the Desert CodeSprouts Workshop). Thanks Google! Chairing SCAI's effort to hire faculty in the broad area of Operating Systems, Compilers, and Programming Languages. Please find the job posting here. HitchHiker was accepted to appear at ACM CCS 2024! Congratulations to Chuqi and all my collaborators. You can find the research artifact on GitHub. Intel has donated data center equipment to our research lab to help pursue secure enclave-related research. Thanks Intel! Invited to serve in the program committees of USENIX OSDI 2025 and USENIX Security 2025. Please submit your best systems and security work! Read all about the Desert CodeSprouts Workshop in this news article. Organized the 1st Desert CodeSprouts Workshop for Middle-School Students in the Greater Phoenix area. Thank you to all the participants, coordinators, volunteers, and especially the workshop co-founder (Prof. Hasti Seifi). Special thanks to the School of Computing and Augmented Intelligence (SCAI) and the American Cybersecurity Education (ACE) Institute for co-sponsoring this event. Please stay tuned for future workshop events at our website! Invited to serve in the program committees of IEEE S&P 2025, ACM EuroSys 2025, and IEEE HPCA 2025. Please submit your best (security, systems, and architecture) work! Presented Veil at ACM ASPLOS 2024 in San Diego. Thank you all for the amazing reception! Greatly honored to receive the 2024 US Department of Defense's Defense Established Program to Stimulate Competitive Research (DEPSCoR) Award! Our work will strive to overhaul the state of today's computer logging infrastructure for mission-critical computers. Thank you for the support! Teaching the Operating Systems course at SCAI in Fall 2024. Please refer to the link for details. Invited to serve in the program committees of USENIX Security 2024, ISOC NDSS 2024 Poster Session, and ISOC Workshop on Artificial Intelligence System with Confidential Computing (AISCC) 2024. Please submit your best work! Presented eOPF at USENIX OSDI 2023 in Boston. Thank you all for the amazing questions and discussion! Veil was accepted to appear at ACM ASPLOS 2024! Stay tuned for the paper PDF and artifact. OmniLog was accepted to appear at USENIX Security 2023! This work calls for a rethink of audit system designs in modern computers to address (a) the limited collection of system logs relevant to forensic analysis of kernel exploits and (b) the tampering of collected logs. Congratulations to Aniket and all my collaborators. eOPF was accepted to appear at USENIX OSDI 2023! In this work, we design a trustworthy and extensible software layer to complement the hardware capabilities of a widely-used confidential computing technology (Intel SGX) with strong cloud orchestration and side-channel defense features. Rebooting the Advanced Operating Systems course at SCAI in Spring 2023. Please refer to the link for details. Prof. Hasti Seifi and I are co-designing the first ASU SCAI Outreach Workshop in 2023/2024! Please stay tuned for further information and website details. Teaching a course titled \"Trusted Computing in Clouds: Past, Present, and Future\" in Fall 2022. Please refer to the link for details. Selected Publications (... All) The HitchHiker's Guide to High-Assurance System Observability Protection with Fast Permission Switches [paper | code] C. Zhang, J. Zeng, Y. Zhang, A. Ahmad, F. Zhang, H. Jin, and Z. Liang (ACM CCS 2024) Veil: A Protected Services Framework for Confidential Virtual Machines [paper | slides | code] A. Ahmad, B. Ou, C. Liu, X. Zhang, and P. Fonseca (ACM ASPLOS 2023 -- Presented at ASPLOS 2024) Rethinking System Audit Architectures for High Event Coverage and Synchronous Log Availability [paper] V. Gandhi, S. Bannerjee, A. Agarwal, A. Ahmad, S. Lee, and M. Peinado (USENIX Security 2023) An Extensible Orchestration and Protection Framework for Confidential Cloud Computing [paper] A. Ahmad, A. Shultz, B. Lee, and P. Fonseca (USENIX OSDI 2023) Selected Service Program commitee member for USENIX OSDI 2025, USENIX Security 2025, IEEE S&P 2025, ACM EuroSys 2025, IEEE HPCA 2025 Program commitee member for USENIX Security 2024, ISOC NDSS Poster Session 2024, IEEE AISOC 2024. NSF Panel on Hardware Security (2024). Reviewer for ACM Transactions on Privacy and Security (TOPS) 2023 Chaired the session \"Verification for Security\" at IEEE S&P 2022 Previewed the sessions on \"Operating system\" at USENIX ATC and USENIX OSDI 2021 External reviewer for IEEE S&P 2022, ACM SoCC 2022, and USENIX ATC 2022",
  "content_length": 6180,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:41"
}