{
  "name": "Aditya Bhaskara",
  "homepage": "http://www.cs.utah.edu/~bhaskara",
  "status": "success",
  "content": "Aditya Bhaskara Aditya Bhaskara Home Research Teaching I am an Associate Professor in the School of Computing at the University of Utah. I am part of the Theory Group and the Utah Center for Data Science. Contact: bhaskaraaditya AT gmail, or if you are looking for me in person, my office is WEB 2692 (Warnock Engineering Building, Second Floor) I am interested in theoretical computer science and machine learning. On the theory side, I am broadly interested in algorithm design, with a focus on approximation and online algorithms. On the ML side, I am interested in topics such as robustness of learning models and domain shifts, from a theoretical perspective. I also work on topics that blend theory and ML, e.g., leveraging ML-based predictions in classical algorithm design, and other beyond worst case models. For more information, please see my research page. For students. If you have a strong mathematical background and are interested in working with me, please send me email. Please include your Resume and information about your (relevant) past projects. I am co-organizing the Data Science Lecture Series this year. If you are interested in presenting your (or your students') work, please send me email. Recent program committees: SODA 2024, STOC 2023, ICALP 2023, ITCS 2022. Education and Background: -- Post doctoral researcher, Google NYC (2013-2015) -- Post doctoral researcher, EPFL (2012-2013) -- Ph.D. in Computer Science, Princeton University (2012) [thesis] -- B. Tech in Computer Science and Engineering, IIT Bombay, India. I thank the National Science Foundation (NSF) for supporting my research by an NSF CAREER award, an AF Small grant, and grants from the NRDZ and FMiTF programs. Thanks also to Google for a Faculty Research Award. (Click here for an artist's rendition) Design by Alpha Studio",
  "content_length": 1824,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:44"
}