{
  "name": "Adithya Murali",
  "homepage": "https://muraliadithya.github.io",
  "status": "success",
  "content": "Adithya Murali Welcome! I'm Adithya Murali, an Assistant Professor at the University of Wisconsin-Madison working on Formal Methods and Programming Languages. I did my Ph.D. at UIUC with Madhusudan Parthasarathy. Broadly speaking, I work on program verification and program synthesis. The overarching focus of my research is to democratize software verification, enabling programmers who are not verification experts to verify their code. I'm intrigued by the idea of making verification technology broadly accessible by lowering the cognitive burden involved in automated software verification. A primary focus of my work is to develop data-driven logic learning techniques (learning logical formulas from data) to replace the expert help currently required in automated software verification. More generally, I also work in the area of program synthesis, and have a big interest in exploring questions at the intersection of symbolic synthesis and machine learning (e.g., \"Neuro-Symbolic\" learning). adithyamurali@cs.wisc.edu # On My Team Here is a non-exhaustive list of many talented individuals I have had the pleasure of working with: Atharva Sehgal (Undergraduate @UIUC → PhD CS @UT Austin) Zhengyao Lin (Undergraduate @UIUC → PhD CS @CMU) Delu Zhao (Undergraduate @UIUC) Shreya Vinjamuri (Undergraduate @UIUC) Hrishikesh Balakrishnan (MSc Computer Science @Chennai Mathematical Institute, India → PhD CS @UIUC) Parth Thakkar (MS CS @UIUC) Shaurya Gomber (MS CS @UIUC → PhD CS @UIUC) Aman Singh (MS CS @UIUC) Eion Blanchard (PhD Mathematics @UIUC) Cody Rivera (PhD CS @UIUC) Aaron Councilman (PhD CS @UIUC) Zijie Zhao (PhD CS @UIUC) # Academic Service Subreviewer PLDI 2024 Subreviewer CONCUR 2023 Subreviewer ICALP 2023 Subreviewer LICS 2022 Artifact Evaluation Committee PLDI 2022 Artifact Evaluation Committee POPL 2022 Student Committee Chair, Department of Mathematics, BITS-Pilani, Hyderabad Academic Year 2015-16 # Teaching UIUC CS 521 Trustworthy AI Systems (Teaching Assistant) Fall 2023 CS 474 Logic in Computer Science (Teaching Assistant) Spring 2023 CS 421 Programming Languages and Compilers (Teaching Assistant) Fall 2020 CS 421 Programming Languages and Compilers (Teaching Assistant) Spring 2020 CS 421 Programming Languages and Compilers (Teaching Assistant) Fall 2019 BITS-Pilani, Hyderabad MATH F112 Linear Algebra and Complex Variables (Teaching Assistant) Spring 2013 MATH F112 Linear Algebra and Complex Variables (Teaching Assistant) Spring 2014 # Awards UIUC Graduate College Conference Travel Grant PLDI 2024 Travel Grant MWPLS 2023 SIGPLAN PAC Grant PLDI 2023 UIUC Graduate College Spring 2020 Conference Travel Grant ESOP 2020 (unclaimed) SIGPLAN PAC Grant POPL 2020 Ray Ozzie Fellowship, Department of Computer Science, UIUC 2018 Gold Medal, BITS-Pilani Hyderabad Graduating Batch of 2017 INSPIRE Scholarship, Government of India Academic Years 2012-2016 # Other Academic Activities Coordinator, Formal Methods Seminar, UIUC Fall 2023 Student volunteer PLDI 2023 Coordinator, Formal Methods Seminar, UIUC Spring 2023 Student volunteer IJCAI 2022 Student volunteer POPL 2022 Student volunteer POPL 2020 I was the scribe for Dagstuhl Seminar 19361 on 'Logic and Learning'. You can read the report here.",
  "content_length": 3236,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:41"
}