{
  "name": "Aditya Akella",
  "homepage": "http://pages.cs.wisc.edu/~akella",
  "status": "success",
  "content": "Aditya Akella In the UTNS (formerly WISR) research group we work on building software systems that improve the performance, efficiency, and correctness of modern cloud computing infrastructure and applications. Our current focus is on systems for big data processing, machine learning and inference, ultra-low latency networking, serverless computation, and network verification/repair/synthesis. Recent Highlights Aug 2021 Moved to UT Austin Aug 2021 Atoll accepted to SoCC'21 Aug 2021 D2R accepted to SOSR'21 Aug 2021 MTP, Vision for Runtime Programmable Networks accepted to HotNets'21 June 2021 Awarded Finalist of 2021 Blavatnik National Awards for Young Scientists May 2021 CliqueMap accepted to SIGCOMM'21 Recent papers (Complete list here) SoCC 21 Atoll: A Scalable Low-Latency Serverless Platform Arjun Singhvi, Arjun Balasubramanian, Kevin Houck, Mohammed Danish Shaikh, Shivaram Venkataraman, Aditya Akella. SOSR 21 D2R: Policy-Compliant Fast Reroute Kausik Subramanian, Anubhavnidhi Abhashkumar, Loris D'Antoni, Aditya Akella. HotNets 21 TCP is Harmful to In-Network Computing: Designing a Message-Oriented Transport Protocol (MTP) Darius Grassi, Hamidreza Almasi, Balajee Vamanan, Aditya Akella, Brent E. Stephens. HotNets 21 A Vision for Runtime Programmable Networks Jiarong Xing, Yiming Qiu, Kuo-Feng Hsu, Hongyi Liu, Matty Kadosh, Alan Lo, Aditya Akella, Thomas Anderson, Arvind Krishnamurthy, T. S. Eugene Ng, Ang Chen. SIGCOMM 21 CliqueMap: Productionizing an RMA-Based Distributed Caching System Arjun Singhvi, Aditya Akella, Maggie Anderson, Rob Cauble, Harshad Deshmukh, Milo M. K. Martin, Amanda Strominger, Thomas F. Wenisch, Amin Vahdat. NSDI 21 Whiz: Data-Driven Analytics Execution Arjun Singhvi, Robert Grandl, Raajay Viswanathan, Aditya Akella. NSDI 21 ATP: In-network Aggregation for Multi-tenant Learning ChonLam Lao, Yanfang Le, Kshiteej Mahajan, Yixi Chen, Wenfei Wu, Aditya Akella, Michael Swift. NSDI 21 Running BGP in Data Centers at Scale Anubhavnidhi Abhashkumar, Kausik Subramanian, Alexey Andreyev, Hyojeong Kim, Nanda Kishore, Jingyi Yang, Petr Lapukhov, Aditya Akella, James Hongyi Zeng. OSDI 20 PANIC: A High-Performance Programmable NIC for Multi-tenant Networks [pdf] Jiaxin Lin, Kiran Patel, Brent Stephens, Anirudh Sivaraman, Aditya Akella. CoNEXT 20 AED: Incrementally Synthesizing Policy-Compliant and Manageable Configurations Anubhavnidhi Abhashkumar, Aaron Gember-Jacobson, Aditya Akella. SoCC 20 SNF: Serverless Network Functions Arjun Singhvi, Junaid Khalid, Aditya Akella, Sujata Banerjee. SoCC 20 Network-accelerated Distributed Machine Learning for Multi-Tenant Settings Raajay Viswanathan, Arjun Balasubramanian, Aditya Akella. SIGCOMM 20 1RMA: Re-envisioning Remote Memory Access for Multi-tenant Datacenters [pdf] [video] Arjun Singhvi, Aditya Akella, Dan Gibson, Thomas F. Wenisch, Monica Wong-Chan, Sean Clark, Milo M. K. Martin, Moray McLaren, Prashant Chandra, Rob Cauble, Hassan M. G. Wassel, Behnam Montazeri, Simon L. Sabato, Joel Scherpelz, Amin Vahdat. PLDI 20 Detecting Network Load Violations for Distributed Control Planes [pdf] Kausik Subramanian, Anubhavnidhi Abhashkumar, Loris D'Antoni, Aditya Akella. NSDI 20 Themis: Fair and Efficient GPU Cluster Scheduling for Machine Learning Workloads [pdf] Kshiteej Mahajan, Arjun Balasubramanian, Arjun Singhvi, Shivaram Venkataraman, Aditya Akella, Amar Phanishayee, Shuchi Chawla. NSDI 20 Liveness Verification of Stateful Networks [pdf] Farnaz Yousefi, Anubhavnidhi Abhashkumar, Kausik Subramanian, Kartik Hans, Soudeh Ghorbani, Aditya Akella. NSDI 20 Tiramisu: Fast and General Network Verification [pdf] Anubhavnidhi Abhashkumar, Aaron Gember-Jacobson, Aditya Akella. NSDI 20 Automated Verification of Customizable Middlebox Properties with Gravel [pdf] Kaiyuan Zhang, Danyang Zhuo, Aditya Akella, Arvind Krishnamurthy, Xi Wang.",
  "content_length": 3850,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:44"
}