{
  "name": "Aditya Gilra",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/aditya-gilra",
  "status": "success",
  "content": "Dr Aditya Gilra | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Aditya Gilra PhD School of Computer Science Visiting academic Neuroscience Institute Liaison Member of the Machine Learning research group Open staff member portrait in a modal window Regent Court (DCS) Full contact details Dr Aditya Gilra School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0002-8628-1864 Google Scholar Personal website Profile Dr. Aditya Gilra was a Lecturer (=Assistant Professor) in the Machine Learning Group at the Department of Computer Science, University of Sheffield, UK, from January 2020 for two years. Earlier, he was a post-doctoral researcher in the groups of: Prof. Gašper Tkačik at the Institute of Science and Technology, Austria, in 2019; Prof Raoul-Martin Memmesheimer at the University of Bonn, Germany, in 2018; and Prof Wulfram Gerstner at the École Polytechnique Fédérale de Lausanne, Switzerland, in 2015-2017. He has a background in Computational Neuroscience (PhD - National Centre for Biological Sciences, Tata Institute of Fundamental Research, Bangalore, India with Prof Upinder S. Bhalla), Physics (Master's - Tata Institute of Fundamental Research, Mumbai, India) and Electrical & Electronics Engineering (Bachelor's - Indian Institute of Technology Madras, Chennai, India). Research interests Dr. Aditya Gilra is interested in how the brain learns motor and cognitive tasks. His research lies at the interface of computational neuroscience, control theory and machine learning. Check out key publications and related code. Publications Journal articles Klos C, Kalle Kossio YF, Goedeke S, Gilra A & Memmesheimer RM (2020) Dynamical Learning of Dynamics. Physical review letters, 125(8), 088103. Rikhye RV, Gilra A & Halassa MM (2018) Thalamic regulation of switching between cortical representations enables cognitive flexibility. Nature Neuroscience, 21(12), 1753-1763. Martinolli M, Gerstner W & Gilra A (2018) Multi-timescale memory dynamics extend task repertoire in a reinforcement learning network with attention-gated memory. Frontiers in Computational Neuroscience, 12. Gilra A & Gerstner W (2017) Predicting non-linear dynamics by stable local learning in a recurrent spiking neural network. eLife, 6. Gilra A & Bhalla US (2015) Bulbar microcircuit model predicts connectivity and roles of interneurons in odor coding. PLoS ONE, 10(5). Cole N, Harvey M, Myers-Joseph D, Gilra A & Khan AG () Prediction-error signals in anterior cingulate cortex drive task-switching. Nature Communications, 15(1). Conference proceedings Gilra A & Gerstner W (2018) Non-linear motor control by local learning in spiking neural networks. 35th International Conference on Machine Learning, ICML 2018, Vol. 4 (pp 2855-2864) Gilra A (2009) Quantum phases due to cosmic gravity and the spin-statistics connection. Journal of Physics: Conference Series, Vol. 174 (pp 012040-012040) Gilra A, Gokhroo V & Unnikrishnan CS (2007) New tests and clarification of some conceptual issues in the superposition of monochromatic light fields. The Nature of Light: What Are Photons? Preprints Han C, English G, Saal HP, Indiveri G, Gilra A, von der Behrens W & Vasilaki E () Modelling novelty detection in the thalamocortical loop. Grants CausalXRL: Causal eXplanations in Reinforcement Learning, EPSRC, 02/2021 - 01/2024, £309,915, as PI Links Machine Learning research group",
  "content_length": 3524,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:45"
}