{
  "name": "Aditi Raghunathan",
  "homepage": "https://www.cs.cmu.edu/~aditirag",
  "status": "success",
  "content": "Aditi Raghunathan - Homepage Aditi Raghunathan Assistant Professor Computer Science Department, CMU about publications honors group teaching contact I am an Assistant Professor in the Computer Science Department at Carnegie Mellon University. I am also affiliated with the Machine Learning Department. We just launched a dedicated group website! Explore ongoing projects, people, and updates here: AI Reliability @ CMU led by Aditi Raghunathan . Research focus: I aim to advance our scientific understanding of frontier models by uncovering why they fail and how to build systems that remain reliable under pressure. Recent projects in my group expose hidden bottlenecks in data curation and quantization pipelines, develop new evaluations for agent safety and distribution shift, and highlight failure modes in post-training defenses such as jailbreaks and context fidelity. I wrote a short post about our group’s recent work presented at ICML 2025 sharing what we explored, what we learned, and a bit of behind-the-scenes context. Read it here: Aditi Raghunathan's group at ICML 2025 . I received my PhD from Stanford University in 2021 where I was fortunate to be advised by Percy Liang. Previously, I obtained my BTech in Computer Science from IIT Madras in 2016. If you are a current CMU undergraduate or masters student interested in working with my group, please apply here. Selected honors NSF CAREER award Okawa Research Award Google Research Scholar Forbes 30 under 30 in Science Schmidt AI 2050 Early Career Fellow Arthur Samuel Best Thesis Award at Stanford Rising Stars in EECS Open Philanthropy Project AI Fellowship Google PhD Fellowship in Machine Learning Stanford School of Engineering Fellowship Google Anita Borg Memorial Scholarship Fall 2025: Trustworthy AI: Theory and Practice Spring 2025: Graduate Artificial Intelligence Fall 2024: Theoretical and Empirical Foundations of Modern Machine Learning Fall 2023: Artificial Intelligence: Representation and Problem Solving Spring 2023: Graduate Artificial Intelligence Fall 2022: Theoretical and Empirical Foundations of Modern Machine Learning Email: raditi at cmu dot edu Office: GHC 7005",
  "content_length": 2163,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:44"
}