{
  "name": "Aditya Nigam",
  "homepage": "http://faculty.iitmandi.ac.in/~aditya",
  "status": "success",
  "content": "Aditya Nigam, IIT Mandi Aditya Nigam PhD, Indian Institute of Technology, Kanpur, India, 2014 Associate Professor School of Computing and Electrical Engineering (SCEE) Indian Institute of Technology, Mandi Email: Lab: MANAS Lab, IIT Mandi Expertise: Applications of Deep Learning in Biometrics CV (PDF)» EXPAND ALL SECTIONS COLLAPSE ALL SECTIONS Introduction Dr. Aditya Nigam received his Masters (M.Tech) and Doctoral (Ph.D) degrees from Indian Institute of Technology, Kanpur in 2009 and 2014 respectively. Presentely, he is working as an Associate Professor at IIT Mandi, HP in the School of Computing and Electrical Engineering (SCEE). He joined this School during August 2014 as a Teaching Fellow. He is passionate about teaching and most of his last 6 years his teaching is related to Deep Learning and its applications, covering concepts starting from basic to advanced level. His research interests are Deep Learning, Biometrics, Medical Image Processing & its Analysis, Image Processing, Computer Vision & Machine Learning. News News Publications Selected Publications All Publications» ACCV'24 \"GaitW: Enhancing Gait Recognition in the Wild Using Dynamic Information\", Daksh Thapar, Jayesh Chaudhari, Sunny Manchanda, Aditya Nigam, Chetan Arora, Proceedings of the Asian Conference on Computer Vision (ACCV), 2024, pp. 268-285 WACV'24 \"Favoring One Among Equals - Not a Good Idea: Many-to-One Matching for Robust Transformer Based Pedestrian Detection\", K.N. Ajay Shastry, K. Ravi Sri Teja, Aditya Nigam, Chetan Arora, Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), 2024, pp. 759-768 CVPR'22 \"Merry Go Round: Rotate a Frame and Fool a DNN\", Daksh Thapar, Aditya Nigam, Chetan Arora, Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2022, pp. 15054-15063 ACM IC'20 \"Recognizing Camera Wearer from Hand Gestures in Egocentric Videos: \", Daksh Thapar, Aditya Nigam, Chetan Arora, Proceedings of the 28th ACM International Conference on Multimedia ICCV'21 \"Anonymizing egocentric videos\", Daksh Thapar, Aditya Nigam, Chetan Arora Proceedings of the IEEE/CVF International Conference on Computer Vision, pp. 2320-2329. ECCV'20 \"Is sharing of egocentric video giving away your biometric signature?\", Daksh Thapar, Chetan Arora, Aditya Nigam, Computer VisionâECCV 2020: 16th European Conference, Glasgow, UK, August 23â28, 2020, Proceedings, Part XVII 16 Pattern Recognition Letters'19 \"Gait metric learning siamese network exploiting dual of spatio-temporal 3D-CNN intra and LSTM based inter gait-cycle-segment features\", Daksh Thapar, Gaurav Jaswal, Aditya Nigam, Chetan Arora,Pattern Recognition Letters, vol. 125 pp. 646-653. ECCV'18 \"Cancelable knuckle template generation based on LBP-CNN\", Avantika Singh, Shreya Hasmukh Patel, Aditya Nigam, Proceedings of the European Conference on Computer Vision (ECCV) IJCB'20 \"IHashNet: Iris Hashing Network based on efficient multi-index hashing\", Avantika Singh, Pratyush Gaurav, Chirag Vashist, Aditya Nigam, Rameshwar Pratap Yadav, 2020 IEEE International Joint Conference on Biometrics (IJCB). Image and Vision Computing'20 \"Cancelable Iris template generation by aggregating patch level ordinal relations with its holistically extended performance and security analysis\", Avantika Singh, Ashish Arora, Aditya Nigam, Image and Vision Computing vol.104 pp. 104017 Magnetic Resonance Imaging Journal'22 \"Single-Shell to Multi-Shell dMRI Transformation using Spatial and Volumetric Multilevel Hierarchical Reconstruction Framework\", Ranjeet Ranjan Jha, Gaurav Jaswal, Arnav Bhavsar, Aditya Nigam. IEEE EMBC'20 \"Multi-Shell D-MRI Reconstruction via Residual Learning utilizing Encoder-Decoder Network with Attention (MSR-Net)\", Ranjeet Ranjan Jha, Aditya Nigam, Arnav Bhavsar, Sudhir Pathak, Walter Schneider, B. V. Rathish Kumar, 42nd Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC) in conjunction with the 43rd Annual Conference of the Canadian Medical and Biological Engineering Society. Magnetic Resonance Imaging Journal'22 \" VRfRNet: Volumetric ROI fODF Reconstruction Network for estimation of Multi-Tissue Constrained Spherical Deconvolution with only Single Shell dMRI \", Ranjeet Ranjan Jha, Sudhir Pathak, Vishwesh Nath, Walter Schneider, B. V. Rathish Kumar, Arnav Bhavsar, Aditya Nigam ISBI'21 \"Enhancing HARDI reconstruction from undersampled data via multi-context and feature inter-dependency GAN\", RANJEET RANJAN JHA, Hritik Gupta, Sudhir Pathak, Walter Schneider, B. V. Rathish Kumar, Arnav Bhavsar, Aditya Nigam. P2021 IEEE International Symposium on Biomedical Imaging (ISBI) IJCNN 2020 \"HLGSNet: Hierarchical and Lightweight Graph Siamese Network with Triplet Loss for fMRI-based Classification of ADHD\", Ranjeet Ranjan Jha, Gaurav Jaswal, Aditya Nigam, Arnav Bhavsar, Sudhir K Pathak, Rathish Kumar. Neural Computing and Applications Journal'20 \"NeuroGAN: Image reconstruction from EEG signals via an attention based GAN\", Rahul Mishra, Krishan Sharma, Ranjeet Ranjan Jha, Arnav Bhavsar, IEEE Internet Computing (IC'12). CAIP'19 \"FS2Net: Fiber Structural Similarity Network (FS2Net) for Rotation Invariant Brain Tractography Segmentation Using Stacked LSTM Based Siamese Network\", Ranjeet Ranjan Jha, Shreyas Patil, Aditya Nigam, Arnav Bhavsar. Computer Methods and Programs in Biomedicine Journal'23 \"Undersampled Single-shell to MSMT fODF Reconstruction using CNN-based ODE Solver\", Ranjeet Ranjan Jha, B. V. Rathish Kumar, Sudhir K Pathak, Walter Schneider, Arnav Bhavsar, Aditya Nigam. Medical Image Analysis'23 \"TrGANet: Transforming 3T to 7T dMRI using Trapezoidal Rule and Graph based Attention Modules\", Ranjeet Ranjan Jha, BV Rathish Kumar, Sudhir K Pathak, Arnav Bhavsar, Aditya Nigam, Elsevier Science Ltd., Vol. 87, pg:102806, Oxford UK, 2023. Google Scholar » Courses Courses More » CS672 Advanced Topics in Deep Learning [Feb'23 - June'23] IC272 Data Science - III [Aug'22 - Dec'22] CS671 Deep Learning and its Applications [Feb'19 - June'19] CS202 Data Structure and Algorithms CS307 System Practicum IC250 Programming and Data Structure Practicum YouTube Lectures Deep Learning and its Applications Loss Functions Transformer Series Generative Adversarial Networks Deep Reinforcement Learning Graph Neural Networks Service Externally funded projects and Workshops More » Projects Ongoing GAIT recognition system on Ego-centric cameras and Surveillance Cameras: PI: Dr. Chetan Arora, IIT Delhi [Funded by DRDO, DYSL-AI Lab, Bangalore] Ongoing Analyzing Diffusion Weighted Images for Indian Clinical Scenarios: Co-PI: Dr. Arnav Bhavsar, IIT Mandi [Funded by SERB-CRG] Completed LakshmanRekha: A Home Quarantine Management Mobile Application: Co-PI: Dr. Arnav Bhavsar, IIT Mandi [Accepted by IIT Jodhpur] Completed Design of Advanced Big-Data Analytics in the CygNet Network Management System for Large Telecom Networks: PI: Dr. Dileep A.D., IIT Mandi [Funded by DST] Completed Development and Neurosurgical Application of High Definition Fiber Tracking: PI: Dr. Ratish Kumar, IIT Kanpur [Accepted as SPARK Project. Funded by MHRD] Completed Developing a low cost low magnetic field MRI device and its Imaging Software: PI: Dr. Shubhajit, Co-PI: Dr. Anil K. Sao, Dr. Arnav Bhavsar (IIT Mandi) Workshops IWADL [Indian Workshop on Applied Deep Learning]: IIT Mandi, May 2024 BITS Pilani, Goa Campus, June 2023 IIT Mandi, July 2019 Advising Advising More » PG Students Avantika Singh: Ph.D. Thesis - âApplication of Deep Learning in Biometrics: Classification, Cancellation, and Indexingâ. [Graduated] Aman Kamboj: Ph.D. Thesis - âPersonal Authentication system using Unconstrained Ear Imagesâ. [Graduated] Preethi Srinivasan: : M.S Thesis - âMedical Imaging Techniques for transformation and Inferences Using Deep Learningâ. [Graduated] Ranjeet Ranjan Jha, Ph.D. Thesis - âDiffusion Magnetic Resonance Imaging Analysis and Enhancement using Deep Learning Techniquesâ. [Graduated] Daksh Thapar, Ph.D. Thesis - âHuman authentication via. Gait analysis from third and first person (Egocentric) videosâ. [Graduated] Junior Graduate Students Geetanjali Sharma, Soma Chakraborty, Anurag Panday, Munish Daroch Pushap Singh, Abhishek Tandon, Ayush Tiwari, Prashant Kulkarni Richa Thakur, Anoushkrit Goel, Ankita Joshi Links Social links LinkedIn Find me on LinkedIn. ResearchGate Find me on ResearchGate Contact Contact OFFICE ADDRESS Room No. 42, 2nd Floor A17 Academic Building SCEE, North Campus IIT Mandi, Himachal Pradesh, India 175005 Tel: +91-1905-267152 OFFICE DIRECTIONS https://goo.gl/maps/XYn5R7mb3wfwuD5YA",
  "content_length": 8645,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:46"
}