{
  "name": "Aditya Grover",
  "homepage": "https://aditya-grover.github.io",
  "status": "success",
  "content": "Aditya Grover I am an assistant professor of computer science at UCLA. I lead the Machine Intelligence (MINT) group, where we develop AI systems that can interact and reason with limited supervision. My current research is at the intersection of generative models, reinforcement learning, and applications to scientific discovery. Recently, I co-founded Inception to develop a new generation of parallelizable LLMs that redefine the Pareto frontier for quality, speed, and cost. Previously, I spent a gap year as a research scientist at the Fundamental AI Research (FAIR) Group at Meta. I completed my postdoctoral training at UC Berkeley, PhD at Stanford University, and bachelors at IIT Delhi, all in computer science. During my PhD, I have also spent time working at Google Deepmind, Microsoft Research, and OpenAI. recent news Honored to be included in the MIT Tech Review - Innovators Under 35 list this year. Our team at Inception launched Mercury, the world’s first commercial-scale diffusion large language models. Honored to receive the IJCAI Computers and Thought Award. VideoPhy-2 won the best paper award at the ICML Workshop on Building Physically Plausible World Models. Congrats Hritik! Honored to be included in the Forbes 30 Under 30 List. Honored to receive the GOLD Award for Distinguished Young Alumni from IIT Delhi. Honored to receive the NSF Career Award. We released Stormer, which beats Graphcast to set a new state-of-the-art for ML-driven weather forecasting. Stormer won the best paper award at the Climate Change in AI (CCAI) Workshop at ICLR 2024. Congrats Tung! VideoCon won the best paper award at Data Problems for Foundation Models workshop at ICLR 2024. Congrats Hritik! Honored to receive the Schmidt AI2050 Early Career Fellowship. Honored to be selected as a Kavli Fellow by the US National Academy of Sciences. Thank you Washington Post, MIT Tech Review for covering our research on ClimaX. My comments on the field more broadly in Nature and Science ClimaX wins the best paper award at ICML Workshop on ML and Scientific Modeling. Congrats Tung! CleanCLIP wins the best paper award at ICLR Workshop on Trustworthy and Reliable Large-Scale ML. Also to be presented as oral presentation (acceptance rate: 1.8%) at ICCV. Congrats Hritik! The best way to reach me is via email at adityag at cs dot ucla dot edu.",
  "content_length": 2347,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:43"
}