{
  "name": "Adithya Pediredla",
  "homepage": "https://sites.google.com/view/adithyapediredla",
  "status": "success",
  "content": "Adithya PediredlaSearch this siteEmbedded FilesSkip to main contentSkip to navigationPlease visit RISC Lab website for my lab informationI am an Assistant Professor in the Computer Science Department at Dartmouth College, where I founded the Rendering and Imaging Science (RISC) lab, focusing on the intersection of computer graphics, computational imaging, and computer vision. Before this role, I engaged in postdoctoral research at the Robotics Institute, Carnegie Mellon University. My educational background encompasses a Ph.D. from Rice University's Department of Electrical and Computer Engineering, distinguished by the Ralph Budd Best Engineering Thesis Award. I earned my Master's degree from the Indian Institute of Science, receiving the Prof. K. R. Kambati Memorial gold medal and an innovative student project award from the Indian National Academy of Engineering. My undergraduate studies were at the National Institute of Technology, Warangal, India, where I was honored with the Institute and N. Ramarao Memorial gold medals for academic excellence.email | google scholar | github| cvResearch interests: My research interests are mostly centered around computational imaging. Computational imaging systems co-design the imaging and image processing pipelines to either acquire novel features of the scene, decrease the cost of the imaging system, or increase the robustness of the imaging system. In particular, I am interested in adaptive sensing, depth imaging, computational microscopy, imaging non-line-of-sight scenes, imaging under the skin and other scattering media, building physically-based and unbiased rendering techniques, inverse rendering techniques for computational imaging systems.Our upcoming cvpr 2023 tutorial: Physics-based rendering and its applications in computational photography and imaging PublicationsMegahertz Light Steering without Moving PartsAdithya Pediredla, Maysam Chamanzar, Srinivasa Narasimhan, Ioannis GkioulekasCVPR, 2023paper | project page Neural Volumetric Reconstruction for Coherent Synthetic Aperture SonarAlbert Reed, Juhyeon Kim, Thomas Blanford, Adithya Pediredla, Daniel C Brown, Suren JayasuriyaSiggraph, 2023 (to appear)paper | project page Adaptive Gating for Single-Photon 3D ImagingRyan Po, Adithya Pediredla, Ioannis GkioulekasCVPR, 2022paper | project page | codeOptimized Virtual Optical Waveguides Enhance Light Throughput in Scattering MediaAdithya Pediredla, Matteo Giuseppe Scopelliti, Srinivasa Narasimhan, Maysam Chamanzar, Ioannis GkioulekasUnder review, 2021paper | codeOvercoming the Tradeoff Between Confinement and Focal Distance Using Virtual Ultrasonic Optical WaveguidesMatteo Giuseppe Scopelliti, Hengji Huang, Adithya Pediredla, Srinivasa Narasimhan, Ioannis Gkioulekas, Maysam ChamanzarOptics Express, 2020paperPath Tracing Estimators for Refractive Radiative TransferAdithya Pediredla, Yasin Karimi Chalmiani, Matteo Giuseppe Scopelliti, Maysam Chamanzar, Srinivasa Narasimhan, Ioannis GkioulekasACM Transactions on Graphics (SIGGRAPH Asia), 2020paper | project page | codeEllipsoidal Path Connections for Time-gated RenderingAdithya Pediredla, Ashok Veeraraghavan, Ioannis GkioulekasACM Transactions on Graphics (SIGGRAPH), 2019paper | project page | codeSNLOS: Non-line-of-sight scanning through temporal focusingAdithya Pediredla, Akshat Dave, Ashok VeeraraghavanInternational Conference on Computational Photography (ICCP), 2019paper STORM: Super-resolving Transients by OveRsampled MeasurementsAnkit Raghuram, Adithya Pediredla, Srinivasa Narasimhan, Ioannis Gkioulekas, Ashok VeeraraghavanInternational Conference on Computational Photography (ICCP), 2019paperCS-ToF: High-resolution compressive time-of-flight imagingFengqiang Li, Huaijin Chen, Adithya Pediredla, Chiakai Yeh, Kuan He, Ashok Veeraraghavan, Oliver CossairtOptics Express, 2017paperReconstructing Rooms Using Photon Echoes: A Plane based model and reconstruction algorithm for looking around the cornerAdithya Pediredla, Mauro Buttafava, Alberto Tosi, Oliver Cossairt, Ashok VeeraraghavanInternational Conference on Computational Photography (ICCP), 2017paperDeep imaging in scattering media with selective plane illumination microscopyAdithya Pediredla, Shizheng Zhang, Ben Avants, Fan Ye, Shin Nagayama, Ziying Chen, Caleb Kemere, Jacob T. Robinson, Ashok VeeraraghavanJournal of Biomedical Optics (JBO), 2016paperAbsorption-Induced Image Resolution Enhancement in Scattering MediaMehbuba Tanzid, Nathaniel J. Hogan, Ali Sobhani, Hossein Robatjazi, Adithya Pediredla, Adam Samaniego, Ashok Veeraraghavan,  Naomi J. HalasACM Photonics, 2016paperFocal-sweep for large aperture time-of-flight camerasSagar Honnungar, Jason Holloway, Adithya Pediredla, Ashok Veeraraghavan,  Kaushik MitraInternational Conference on Image Processing (ICIP), 2016paperSpatial phase-sweep: Increasing temporal resolution of transient imaging using a light source arrayRyuichi Tadano, Adithya Pediredla,  Kaushik Mitra, Ashok VeeraraghavanInternational Conference on Image Processing (ICIP), 2016paperDepth Fields: Extending Light Field Techniques to Time-of-Flight ImagingSuren Jayasuriya, Adithya Pediredla, Sriram Sivaramakrishnan, Alyosha Molnar, Ashok VeeraraghavanInternational Conference on 3D Vision (3DV), 2015paperDepth selective camera: A direct, on-chip, programmable technique for depth selectivity in photographyRyuichi Tadano, Adithya Pediredla, Ashok VeeraraghavanInternational Conference on Computer Vision (ICCV), 2015paperA unified approach for optimization of snakuscules and ovusculesAdithya Pediredla and Chandra  Sekhar SeelamantulaIEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), 2012paperPatentsR. Tadano, A. K. Pediredla, and A. Veeraraghavan, “Imaging device and Imaging control method,” U.S. Patent No. 10,230,874. 2019.A. K. Pediredla, A. P. Kumar, and B. P. Simon, “Compressed 3d graphics rendering exploiting psychovisual properties.” U.S. Patent No. 9,710,959. 18 Jul. 2017.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 6057,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:41"
}