{
  "name": "Adji B. Dieng",
  "homepage": "https://www.cs.princeton.edu/people/profile/ad6725",
  "status": "success",
  "content": "Adji Bousso Dieng CS Skip to main content Adji Bousso Dieng Assistant Professor Contact Building 406 Computer Science Envelope ad6725@cs.princeton.edu Phone (609) 258-5935 Diploma Ph.D., Columbia University, 2020 Research Areas Machine Learning Computational Biology Natural Language Processing Short Bio I am an Assistant Professor of Computer Science at Princeton University where I lead Vertaix on research at the intersection of artificial intelligence and the natural sciences. I am affiliated with the High Meadows Environmental Institute (HMEI). I am also a Research Scientist at Google AI and the founder and President of the nonprofit The Africa I Know. I have been named an AI2050 Early Career Fellow by Schmidt Futures and the Annie T. Randall Innovator of 2022 for my research and advocacy by the American Statistical Association. I received my PhD from Columbia University where I was advised by David Blei and John Paisley. My doctoral work received many recognitions, including a Google PhD Fellowship in Machine Learning, a rising star in Machine Learning nomination by the University of Maryland, and a Savage Award from the International Society for Bayesian Analysis, for my doctoral thesis. I hail from Kaolack, Senegal.A full list of publications is available here.Website: vertaix.princeton.edu Other Affiliations CBE HMEI PMI Related News October 21, 2025 Adji Bousso Dieng wins award from the Prix Galien Africa Adji Bousso Dieng, expert in artificial intelligence, has been awarded a Prix Galien Africa Special Prize. February 4, 2025 Adji Bousso Dieng honored by the Materials Research Society The Materials Research Society has named Adji Bousso Dieng an Early Career Distinguished Presenter. January 22, 2025 Adji Bousso Dieng recognized by The Africa Report Adji Bousso Dieng, expert in artificial intelligence, has been recognized by The Africa Report magazine as one of 10 African Scholars to Watch in 2025. January 29, 2024 Researchers harness large language models to accelerate materials discovery Princeton researchers have created an artificial intelligence tool to predict the behavior of crystalline materials, a key step in advancing technologies like batteries and semiconductors. January 4, 2023 Artificial intelligence enters a new era For artificial intelligence to realize its potential — to relieve humans from mundane tasks, make life easier, and eventually invent entirely new solutions to our problems — computers will need to surpass us at two things that we humans do pretty well: see the world around us and understand our language. November 8, 2022 Dieng awarded AI2050 Early Career Fellowship Schmidt Futures has awarded Adji Bousso Dieng an AI2050 Early Career Fellowship for her work at the intersection of artificial intelligence and the natural sciences.",
  "content_length": 2811,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:47"
}