{
  "name": "Adlen Ksentini",
  "homepage": "http://www.eurecom.fr/en/people/ksentini-adlen",
  "status": "success",
  "content": "KSENTINI Adlen | EURECOM Skip to main content SEARCH Ok Menu print KSENTINI Adlen Name : KSENTINI Adlen Service : EURECOM - Communication systems Function : Professor Email : Adlen.Ksentini@eurecom.fr Phone : 8205 Office : 309 Website : http://www.eurecom.fr/~ksentini/ Teaching NetSoft : This course will cover the principle of Network Softwerization by introducing and detailing the concepts of SDN, NFV and Cloud Computing (focusing on the IaaS model and Edge Computing). Besides covering the theoretical aspects, the course will provide an overview of the enabling technologies, and how combining these concepts will allow building flexible and dynamic virtual networks tailored to services, e.g. Anything as a Service (AaaS) and Network Slicing. APPIOT : This course covers the application-level protocols dedicated to IOT. Knowing the limited capacity, in terms of battery and CPU, of the things, the classical application protocols used in the Internet like HTTP are not adequate. This course presents the recent application protocols specially developed for IOT. These protocols are organized into two categories: (i) Client/server (like COAP) and (ii) Publish/Subscribe (like MQTT, XMPP). Current Research Topics Mobile and wireless Networks Software Defined Networking (SDN) Mobile Edge Computing (MEC) Network Function Virtualization (NFV) Content Delivery Networks (CDN) Performances evaluation Selected Publications 2018 - Improving traffic forecasting for 5G core network scalability: A machine learning approach 2018 - Cost and availability aware resource allocation and virtual function placement for CDNaaS provision 2017 - Toward enforcing network slicing on RAN: Flexibility and resources abstraction SEARCH Ok About me HomepageBiographyResearchTeachingPublications (223) Distinctions Distinctions In April 2018, Adlen Ksentini and his co-authors have received the Best Paper Award for their article \"Efficient virtual evolved packet core deployment across multiple cloud domains\" at IEEE WCNC 2018 (15-18 April 2018, Barcelona, Spain) Adlen Ksentini and his co-authors have received the Best Paper Award for their paper entitled \"How accurate is the RACH procedure model in LTE and LTE-A\" obtained during IWCMC 2016 (5-9 September 2016, Paphos, Cyprus). Profiles Profiles Google Scholar Citations LinkedIn ResearchGate Acm Digital Library DBLP Orcid Scopus IEEEXplore Research Legal Notice Accueil EURECOM Presentation Virtual campus tour Director's remark International dimension Ranking and recognition Presence in Sophia-Antipolis History Quality approach Gender equality Disabilities management SGVB Prevention Contacts Newsroom Réseaux sociaux Brochures Press releases News EURECOM Research Blog EURECOM on I'MTech Blog Job opportunities Job opportunities EURECOM Appels d'offres Teaching Why EURECOM? Academic Schedule Admission How to Apply Required documents Eligibility Requirements English Proficiency French Proficiency Application Deadlines Tuition Fees Payment Plans Scholarships International Academic partners Incoming mobility Outgoing mobility EURECOM engineering degree Students in Preparatory Classes University Students Cursus 6 - 12 month Tracks Free curriculum Spécial Concours Commun Tracks Data Science Embedded systems Digital Security Internet Of Things Intelligent communication systems Post Master's degree Security in Computer Systems and Communications Master in Computer Science Digital Security track Digital Security track _ DD 18 months Data Science track Data Science track _ DD 18 months Master in Networks and Telecommunication Intelligent Communication Systems track Intelligent communication systems track_ DD 18 months Internet of Things (IoT) track Internet of Things (IoT) track _ DD 18 months European Double Degree Masters Master in Autonomous Systems - EIT DIGITAL Master in Cyber Security - EIT Digital Master in Artificial Intelligence with Affective Computing - EIT DIGITAL Master in Security and Cloud Computing (SECCLO) - ERASMUS MUNDUS Doctoral Program First job & openings Courses Courses selector Technical courses Humanities and Social Sciences FAQ Research Results from Research ERC 3IA Sophia Antipolis Awards Publications Thesis Scientist Visitors Development Start-Ups Tech Forward incubator Data Science Department Directory Publications Seminars Communication System Department Directory Publications Seminars OpenAirInterface Alliance Digital Security Department Directory Publications Seminars Telecom Paris Labs System on chip Usages Research Team Young Researchers Partnerships EURECOM consortium members Academic members Industrial members Members’ news Collaboration types Apprenticeship tax In house training Internship Proposal Meet our students Companies’ Corner EURECOM industry forum Student life Student guide Registration and Health Insurance Visa / Resident permit (NON EU) Housing Library Associations Art activities Student association International Junior of EURECOM (IJE) Sport activities Classes godfathers Alumni Alumni Meeting Classes photos",
  "content_length": 5042,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:47"
}