{
  "name": "Adrian Johnstone",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/adrian-johnstone_7cc2e828-2b0f-4cb7-a169-337193b854b8.html",
  "status": "success",
  "content": "Adrian Johnstone - Royal Holloway Research Portal Adrian Johnstone Professor Professor of Computing, Department of Computer ScienceCentre for Software Language EngineeringCentre for Programming Languages and Systems https://orcid.org/0000-0002-9446-9701 Phone+44 1784 443425EmailA.Johnstonerhul.acuk TW20 0EX Personal profile Research interestsProgramming language theory and implementation Babbage History of Computing Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): KeywordsGeneralised parsing, context free grammars, customisable processors Research output 34 Article 10 Conference contribution 9 Paper 1 Book 2 More 1 Editorial 1 Software Research output per year Research output per year Earley Table Traversing ParsersScott, E. & Johnstone, A., Jan 2026, In: Science of Computer Programming. 247, p. 1-43 43 p., 103335.Research output: Contribution to journal › Article › peer-review Open Access 1 Downloads (Pure) Handling Grammar Cycles in the 1997 SML DefinitionScott, E. & Johnstone, A., 17 Jun 2025, Proceedings of the 18th ACM SIGPLAN International Conference on Software Language Engineering (SLE '25), June 12--13, 2025, Koblenz, Germany. ACM, p. 3-15 13 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 43 Downloads (Pure) Analysing the SML97 Definition: LexicalisationScott, E. & Johnstone, A., 21 Mar 2023, Eelco Visser Commemorative Symposium (EVCS 2023). Lammel, R., Mosses, P. D. & Steimann, F. (eds.). Schloss Dagstuhl – Leibniz-Zentrum für Informatik, Vol. 109. p. 23:1-23:12 12 p. 23. (Open Access Series in Informatics).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open Access A Reference GLL ImplementationJohnstone, A., 23 Oct 2023, Proceedings of the 16th ACM SIGPLAN International Conference on Software Language Engineering (SLE ’23), October 23–24, 2023, Cascais, Portugal. ACM, p. 43-55 13 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 306 Downloads (Pure) A Reference GLL Implementation - code repositoryJohnstone, A. (Developer) & Scott, E. (Other), 23 Oct 2023Research output: Non-textual form › Software View all 56 research outputs Projects 3 Finished Projects per year Developing Creative Methods of Sensing Air in Villa Inflamable, ArgentinaEngelmann, S. (PI), Kuenzel, S. (CoI), Tisan, A.-S. (CoI), Fisher, R. (CoI), Lowry, D. (CoI), Nisbet-Jones, P. (CoI), Adey, P. (CoI), Clemitshaw, K. (CoI), France, J. (CoI) & Johnstone, A. (CoI)1/04/20 → 31/07/21Project: Research Notions and notation: Babbage’s language of thoughtJohnstone, A. (PI)Leverhulme Trust1/03/14 → 28/02/17Project: Research PLanCompS: PLanCompS: Programming Language Components and SpecificationsJohnstone, A. (PI), Scott, E. (CoI), Reddington, J. (CoI) & Walsh, R. (CoI)Eng & Phys Sci Res Council EPSRC1/06/11 → 31/05/15Project: Research Datasets A reference GLL implementation - code baseJohnstone, A. (Creator), Royal Holloway, University of London, 20 Oct 2023https://github.com/AJohnstone2007/referenceImplementationDataset A Reference GLL Implementation - language corpora repositoryJohnstone, A. (Creator) & Scott, E. (Other), Royal Holloway, University of London, 23 Oct 2023https://github.com/AJohnstone2007/referenceLanguageCorporaDataset",
  "content_length": 3530,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:52"
}