{
  "name": "Adrián Carballal",
  "homepage": "https://pdi.udc.es/en/File/Pdi/XW7GH",
  "status": "success",
  "content": "Adrián Carballal Mato File. Department Computer Science and Information Technologies Knowledgment area Computational Science and Artificial Intelligence Research Research group Redes de Neuronas Artificiales y Sistemas Adaptativos - Imagen Médica y Diagnóstico Radiológico Research lines Inteligencia Artificial, Computación evolutiva, Estética, Diseño asistido por computador, Seguridad Informática Teaching merits evaluation 2 five years period(s) Research merits evaluation 2 six years period(s) Contacto UDC directory Orcid id0000-0002-2963-7318 ResearcherIDE-9317-2012 Scopus37123541900 Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Computer Security and Legislation Degree in Computer Engineering Compulsory 0 108 Ethical Hacking and Penetration Testing Master in Cibersecurity Compulsory 0 42 Final Year Dissertation Degree in Data Science and Engineering Compulsory 0 6 Final Year Dissertation. Mention in Computer Engineering Degree in Computer Engineering Compulsory 0 1.5 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 8 Final Year Dissertation. Mention in Information Systems Degree in Computer Engineering Compulsory 0 1 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 2 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 6.5 Master`s Dissertation Master in Cibersecurity Compulsory 0 20 Subject and involved studies Type Distance hours Total hours Computer Security and Legislation Degree in Computer Engineering Compulsory 0 144 Ethical Hacking and Penetration Testing Master in Cibersecurity Compulsory 0 42 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 2 Final Year Dissertation. Mention in Information Systems Degree in Computer Engineering Compulsory 0 2.5 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 8 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 4 Subject and involved studies Type Distance hours Total hours Computer Security and Legislation Degree in Computer Engineering Compulsory 0 162 Ethical Hacking and Penetration Testing Master in Cibersecurity Compulsory 0 12 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 1 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 1 Subject and involved studies Type Distance hours Total hours Computer Security and Legislation Degree in Computer Engineering Compulsory 0 144 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 4 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 12 Master's Dissertation Master in Cibersecurity Compulsory 0 5 Object-Oriented Programming Degree in Digital Creation, Animation and Video Games Compulsory 0 10 Penetration Testing Master in Cibersecurity Compulsory 0 35 Subject and involved studies Type Distance hours Total hours Computer Security and Legislation Degree in Computer Engineering Compulsory 0 72 Development Frameworks Degree in Computer Engineering Optional 0 28 Object-Oriented Programming Degree in Digital Creation, Animation and Video Games Compulsory 0 91 Penetration Testing Master in Cibersecurity Compulsory 0 35 Work Placement Master in Cibersecurity Compulsory 0 2.5 Subject and involved studies Type Distance hours Total hours Computer Security and Legislation Degree in Computer Engineering Compulsory 0 56 Development Frameworks Degree in Computer Engineering Optional 0 21 Development of Web and Video Content Degree in Audiovisual Communication Compulsory 0 90 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 4 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 4 Multimedia Creation Tools Degree in Audiovisual Communication Compulsory 0 50 Penetration Testing Master in Cibersecurity Compulsory 0 35 Tutoring 2025/2026 Defined tutoring by teacher for 2025/2026 academic course. Faculty of Computer Science Quarter Day Site 1st quarter Tuesday 10:30 a 12:30 Área Científica Desp 1.07 (Contactar por correo primero) 1st quarter Friday 10:30 a 12:30 Área Científica Desp 1.07 (Contactar por correo primero) EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2024/2025 2023/2024 2022/2023 2020/2021 2018/2019 2017/2018 NaviMente - Geolocation device for people with Alzheimer´s Art Recommendation System based on Convolutional Neural Networks for Personalized Art Suggestions. Comparison of collaborative recommendation systems using sports and outdoor reviews obtained from Amazon Web application to share notes between students. Analysis, design and implementation of a Django web application for the analysis and generation of passwords using the PCFG technique Web application to shorten URLs and view usage statistics Analysis, design and implementation of a Node.js Web Application for personal link management using a single link in social networks DHCP and DNS-based identification and intrusion prevention system Web Scraping system for real estate portals Workstation ergonomic evaluation module Operational intelligence: detection of injections in Apache servers with Zabbix and Elasticsearch WIFI-HASHING: Automatized recollection of hashes and password pattern analysis in wifi networks Wireless intrusion prevention system based on Wi-Fi technology Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Patents, records and utility models Papers in research journals Complete books Book chapters PhD theses directed Conference papers 2022 2021 2019 2017 2016 ... 2015 2014 2013 2012 2011 2010 2009 Funding entity Consellería de Educación Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 01/01/2022 to 20/11/2025 Funding entity Ministerio de Ciencia e Innovación Type Proyecto Programas Nacionales Dates From 01/09/2021 to 31/08/2024 Funding entity Axencia Galega de Innovación Main researches Juan Jesús Romero Cardalda Type Proyecto Programas Autonomicos Dates From 01/01/2019 to 31/12/2020 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 01/01/2019 to 20/11/2021 Funding entity Consellería de Educación e Ordenación Universitaria Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 25/10/2017 to 31/12/2019 Funding entity MINISTERIO DE DEFENSA Type Contrato Dates From 01/01/2017 to 31/12/2020 Funding entity Fundación Novoa Santos Main researches José Carlos Dafonte Vázquez / Francisco Javier Nóvoa de Manuel Type Contrato Dates From 04/07/2017 to 04/09/2017 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Manuel F. González Penedo Type Proyecto Programas Autonomicos Dates From 01/01/2016 to 30/11/2019 Funding entity CONSIGA PROJECTS S.L Main researches Alejandro Pazos Sierra Type Contrato Dates From 30/12/2015 to 30/06/2016 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 01/01/2014 to 31/12/2015 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 17/10/2014 to 17/10/2017 Funding entity Consellería de Sanidade Type Contrato Dates From 01/09/2014 to 30/11/2015 Funding entity Ministerio de Defensa Main researches Alejandro Pazos Sierra Type Contrato Dates From 03/01/2013 to 03/01/2015 Funding entity Xunta de Galicia Main researches Ricardo Cao Abad Type Proyecto Programas Autonomicos Dates From 01/01/2012 to 31/12/2013 Funding entity Consellería de Educación e Ordenación Universitaria Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 01/01/2012 to 31/12/2013 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 19/08/2011 to 18/08/2014 Funding entity Fundaçao para a Ciência e a Tecnologia, Ministério da Educaçao e Ciência Main researches Penousal Machado Type Proyecto Internacional Dates From 01/04/2011 to 31/03/2014 Funding entity CONSELLERÍA DE ECONOMÍA E INDUSTRIA Main researches Juan Romero Cardalda Type Proyecto Programas Autonomicos Dates From 14/12/2010 to 14/12/2013 Funding entity Ministerio de Economía y Competitividad Main researches Juan Romero Type Proyecto Programas Nacionales Dates From 01/01/2009 to 31/12/2011 2018 2017 2015 2011 Type Propiedad Intelectual Entity Consellería de Cultura, Educación e Ordenación Universitaria Authors Elena Botana de Castro, Adrian Carballal Mato, Carlos Fernández Lozano, Antonino Santos Del Riego Application date 16/08/2018 Approval date 16/08/2018 Type Software Registrado Entity Authors Alejandro Pazos Sierra, Francisco J. Nóvoa, Javier Pereira, Vázquez-Rodríguez JM, Nicolas Vazquez Gonzalez, Guillermo Aldama, Ramón A. Calviño Santos, Jorge Salgado Fernández, Piñón-Esteban P, Xacobe Flores Rios, Lola Traba, Adrian Carballal Mato Application date 02/06/2017 Type Software Registrado Entity Universidade da Coruña (UDC) Authors Adrian Carballal Mato, Rafael Iván Pazos Pérez, Juan Ramón Rabuñal Dopico, Luis Omar Álvarez Mures, Alejandro Pazos Sierra, M. Dolores García Vidaurrazaga Application date 12/08/2015 Approval date 16/11/2015 Type Software Registrado Entity Univ",
  "content_length": 22083,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:04"
}