{
  "name": "Adriana Kovashka",
  "homepage": "http://people.cs.pitt.edu/~kovashka",
  "status": "success",
  "content": "Adriana Kovashka Adriana Kovashka Associate Professor and Chair Department of Computer Science University of Pittsburgh home CV publications group teaching contact I am an Associate Professor in Computer Science at the University of Pittsburgh. I received my PhD from the Department of Computer Science at the University of Texas at Austin, in August 2014. My adviser was Kristen Grauman. My research interests lie in computer vision and machine learning. I got my undergraduate degree at Pomona College in California, with majors in Computer Science and Media Studies. News: Very excited about a new NSF grant on building AI models to support students interpret scientific diagrams, in collaboration with Indiana University Bloomington. (August 2025) News: In September 2023, I received an NSF grant to study geographic diversity in visual/context appearance, language supervision, and object vocabularies, for object detection. Thanks, NSF! News: In February 2021, I was awarded an NSF CAREER for developing methods to handle noise and ambiguity in weak language and multimodal supervision for object detection. Big thanks to NSF, my students, and my mentors! News: In September 2020, Erin Walker, Diane Litman, Timothy Nokes-Malach and I received a new NSF award for developing multimodal dialogue for human-robot collaborative learning of math. News: In August 2020, I received a new NSF award on generalization with shape and context. Thanks, NSF! News: Four top-tier publications in 2019: TPAMI (impact factor 17.7), CVPR oral (acceptance rate 5.6%), ICCV (acceptance rate 25%), NeurIPS (acceptance rate 21.1%). News: In July 2018, 1 ECCV and 4 BMVC papers were accepted (1 oral, 1 spotlight and 2 posters), and I received a Pitt CRDF award. News: In February 2018, I received a Google Faculty Research Award. News: I will organize the first CVPR workshop on understanding advertisements, and will co-organize the first workshop on understanding subjective attributes in vision. News: In July 2017, Rebecca Hwa and I received an NSF Small award for modeling vividness and symbolism to decode visual rhetoric. News: I'll be an Area Chair for CVPR 2018, and Tutorials Chair for WACV 2018. News: In April 2017, we released the data and annotations for our CVPR 2017 spotlight \"Automatic Understanding of Image and Video Advertisements\". News: In June 2016, I received a University of Pittsburgh Central Research Development Fund (CRDF) award. News: In May 2016, I received an NSF CRII CISE award to automatically understand visual rhetoric in the media. News: In February 2016, I received a Google Faculty Research Award. Note to prospective students: If you are at the University of Pittsburgh and interested in working with me, send me an email or come by my office. If you are applying to the University of Pittsburgh, and my research interests align with yours, please mention my name (or computer vision) in your application. If you are admitted, I will reach out to you. Unfortunately I cannot respond to email from applicants.",
  "content_length": 3036,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:58"
}