{
  "name": "Adrian Hilton 0001",
  "homepage": "https://www.surrey.ac.uk/people/adrian-hilton",
  "status": "success",
  "content": "Prof Adrian Hilton | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all LinkedIn Professor Adrian Hilton FREng FIAPR FIET Director Surrey Institute for People-Centred AI | Director of Centre for Vision, Speech and Signal Processing a.hilton@surrey.ac.uk24 BA 00Academic and research departments Centre for Vision, Speech and Signal Processing (CVSSP), Surrey Institute for People-Centred Artificial Intelligence (PAI), School of Computer Science and Electronic Engineering. AboutBiographyIn January 2012 I became Director of the Centre for Vision, Speech and Signal Processing (CVSSP) at the University of Surrey. CVSSP is one of the largest UK research groups in Audio-Visual Machine Perception with 170 researchers and a grant portfolio in excess of £31M.  CVSSP research spans audio and video processing, computer vision, machine learning, spatial audio, 3D/4D video, medical image analysis and multimedia communication systems with strong industry collaboration.  The centre has an outstanding track-record of pioneering research leading to successful technology transfer with UK industry.The goal of my research is to develop seeing machines with the visual sense to understand and model dynamic real-world scenes. For example, measuring from video the biomechanics of an Olympic athlete performing a world-record high-jump.My research is pioneering the next generation of 4D computer vision, capable of sensing both 3D shape and motion, to enable seeing machines that can understand and model dynamic scenes.  Recent research introduced 4D vision for analysis in sports, for instance, measurement of football players from live TV cameras. This technology has been used by the BBC in sports commentary to visualise the action from novel directions, such as the referee or goalkeepers view.I have successfully commercialised technologies for 3D and 4D shape capture exploited in entertainment, manufacture & health, receiving two EU IST Innovation Prizes, a Manufacturing Industry Achievement Award, and a Royal Society RS Industry Fellowship with Framestore on Digital Doubles for Film (2008-11). I am a Royal Society Wolfson Research Merit Award holder in 4D Vision (2013-18) and is currently PI on the S3A Programme Grant in Future Spatial Audio at Home combining audio and vision expertise and InnovateUK project ALIVE, led by The Foundry, developing tools for 360 video reconstruction and editing.I lead the Visual Media Research (V-Lab) in CVSSP, which is conducting research in video analysis, computer vision and graphics for next generation communication and entertainment applications.My research combines the fields of computer vision, machine learning, graphics and animation to investigate new methods for reconstruction, modelling and understanding of the real world from images and video.Applications include: sports analysis (soccer, rugby, athletics), 3D TV and film production, visual effects, character animation for games, digital doubles for film and facial animation for visual communication.Current research is focused on video-based measurement in sports, multiple camera systems in film and TV production, and 3D video for highly realistic animation of people and faces. Research is conducted in collaboration with UK companies in the creative industries.From 2008-12 I was supported by a Royal Society Industry Fellowship to conduct research with leading visual-effects company Framestore investigating 4D technologies for Digital Doubles in film production.Please contact me if you are interested in current PhD and post-doctoral research opportunities. Expand biography Areas of specialism Computer Vision; Machine Learning; 4D Vision; Computer Graphics; Virtual and Augmented Reality; Light Fields; Animation; Audio-Visual Signal Processing; 3D Computer Vision; Machine Perception ; AI; Digital Doubles University roles and responsibilities Director, Centre for Vision, Speech and Signal Processing (CVSSP) Distinguished Professor of Computer Vision Head of the Visual Media Research Lab. (V-Lab)Previous roles 2008 - 2011 Royal Society Industry Fellow with Framestore - Digital Doubles for Film Production https://www.framestore.com 2014 - 2016 Head of Department (Research), Department of Electrical and Electronic Engineering University of Surrey 1997 - 2002 EPSRC Advanced Research Fellow - Visual Reconstruction of Dynamic Scenes and People University of SurreyAffiliations and memberships Royal Academy of Engineering Fellow International Association for Pattern Recognition Fellow Royal Society Wolfson Research Merit Award Holder in 4D Computer VisionBusiness, industry and community links G3: Galvanizing Guildford Games G3 is a forum for the regional games and creative industry. Co-founded in 2015. CVMP: Conference on Visual Media Production Annual conference with the creative industry in film, TV, games and Virtual/Augmented Reality.Co-founded in 2003. BBC Data Science Research Partnership (2017-2022) Collaborative research partnership with BBC in Data Science and AI for Media.News 30 OCT 2025AI4ME driving the future of media streaming at NetworkX 2025 20 AUG 2025New AI system could change how autonomous vehicles navigate without GPS 28 JAN 2025Surrey welcomes Director General of Department for Education's Skills Group on campus visit 23 JAN 2025Novel motion forecasting framework can deliver safer and smarter self-driving cars 10 DEC 2024Surrey announces world's first AI model for near-instant image creation on consumer-grade hardware 07 MAY 2024Leading PAI academic awarded prestigious fellowship to work on responsible AI for media and journalism 08 DEC 2023Shadow AI Minister visits Institute of People-Centred AI 10 NOV 2023Ministerial visit marks launch of transformative AI training programme 31 OCT 2023UKRI Centre for Doctoral Training in AI for Digital Media Inclusion -  A transformative AI Training programme designed with inclusion for all at its heart 14 JUN 2023Royal Holloway, University of London, announced as preferred bidder for national CoSTAR lab of which the University of Surrey is a core partner 28 APR 2023Surrey hosts House of Commons Science, Innovation and Technology Committee visit 07 MAR 2023AI reveals scale of dementia in India, according to new research 20 JAN 2023Surrey AI experts scoop prestigious “Test of Time” award for pioneering work that shaped today's performance capture technology 21 DEC 2022Surrey Professor receives Distinguished Fellow award 20 OCT 2022Surrey Speaks season 2 episode 4 - People-Centred AI: How can everybody benefit from AI? 06 OCT 2022Why you should study electrical and electronic engineering at Surrey 06 JUL 2022State-of-the-art WEKA Data Platform to support AI research 02 FEB 2022Surrey named among the first-ever successful applicants to The Alan Turing Institute’s Network Development Awards 22 DEC 2021Firebreaks to involve human decision making are crucial to safe AI systems 15 DEC 2021Teamwork between people and machines crucial to future of AI 22 SEP 2021University of Surrey's response to the Government's AI strategy 15 SEP 2021CVSSP publishes five papers at global robotics conference 28 JUL 2021World's first patent awarded for an invention made by an AI could have seismic implications on IP law 19 JUN 2021CVSSP academics showcase 11 papers at leading computer vision conference 08 APR 2021Surrey to lead AI research Prosperity Partnership to enable future personalised media for all 14 DEC 2020Surrey announce international collaboration in Artificial Intelligence 24 NOV 2020Five reasons to study for a masters in AI at Surrey 18 NOV 2020CVSSP researchers win two awards at DCASE 2020 28 OCT 2020MSc in AI built on three decades at the forefront of audio-visual machine perception 23 SEP 2020CVSSP tops 2020 UK rankings in computer vision 05 JUN 2020Fellowship to advance sound to new frontiers using AI 07 NOV 2019AI could help diagnose dogs suffering from chronic pain and identify facial changes associated with Chiari-like malformation 21 OCT 2019Surrey AI research achieves world-leading technology for visual recognition of people 09 OCT 2019Surrey awarded prestigious Leverhulme Trust Early Career Fellowship 01 OCT 2019Prestigious Fellowship of the Royal Academy of Engineering awarded to Surrey professors 16 SEP 2019Surrey researcher wins coveted Sullivan Doctoral Thesis Prize 01 AUG 2019World first patent applications filed for inventions generated solely by artificial intelligence 29 MAY 2019ARCHANGEL: Securing our National Archives with AI and blockchain 17 JAN 2019New AI can detect urinary tract infections Show all articlesResearchResearch interestsI lead AI@Surrey a cross-University initiative bringing together an inter",
  "content_length": 329124,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:53"
}