{
  "name": "Adriana Emitzá Guzmán Ortega",
  "homepage": "https://research.vu.nl/en/persons/emitza-guzman-ortega",
  "status": "success",
  "content": "Emitza Guzman Ortega - Vrije Universiteit Amsterdam View Scopus Profile dr. Emitza Guzman Ortega Assistant Professor, Faculty of Science, Software and Sustainability (S2)Assistant Professor, Network InstituteAssistant Professor, Information Management & Software Engineering Emaile.guzmanortegavunl Personal profile Ancillary activitiesNo ancillary activities Ancillary activities are updated daily Fingerprint Dive into the research topics where Emitza Guzman Ortega is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Software Evolution Computer Science 100% Software Application Computer Science 54% Sentiment Analysis Computer Science 33% Software Development Computer Science 29% bug report Computer Science 28% Mobile Application Computer Science 27% Feature Request Computer Science 22% Exploratory Study Computer Science 21% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 33 Conference contribution 5 Article 1 Foreword/postscript 1 Editorial Research output per year Research output per year Whose voices are heard? Gender disparities in platform-facilitated discrimination and content moderationOlson, L., Fischer, R. A. L., Humbert, T. P., Kunneman, F. & Guzmán, E., Dec 2025, In: Information and Software Technology. 188, p. 1-15 15 p., 107899.Research output: Contribution to Journal › Article › Academic › peer-review Open Access Annotation 100% Online Communities 100% Classification (Machine Learning) 100% User Experience Design 100% Content Moderation 100% Irresponsibility Killed the Cat: Software Accountability ConcernsZegers, A., Preciado, N., Duchnowski, J., Madeiral, F. & Guzmán, E., 2025, 2025 IEEE/ACM 18th International Conference on Cooperative and Human Aspects of Software Engineering (CHASE): [Proceedings]. Institute of Electrical and Electronics Engineers Inc., p. 131-142 12 p.Research output: Chapter in Book / Report / Conference proceeding › Conference contribution › Academic › peer-review Software Company 100% Software Development 50% Development Team 50% Software Quality 50% User Experience 50% What is Unethical About Software? User Perceptions in the NetherlandsElias, Y., Humbert, T. P., Olson, L. & Guzman, E., 2025, 2025 IEEE/ACM 47th International Conference on Software Engineering: Software Engineering in Society (ICSE-SEIS): [Proceedings]. IEEE Computer Society, p. 118-129 12 p. (Proceedings - International Conference on Software Engineering; vol. 2025).Research output: Chapter in Book / Report / Conference proceeding › Conference contribution › Academic › peer-review User Perspective 100% User Experience 100% Software Solution 100% Semistructured Interview 100% Software Application 100% Where Do Users Draw the Line? Ethical Concerns about SoftwareKieft, D., Duits, L. & Guzman, E., 2025, 2025 IEEE 33rd International Requirements Engineering Conference (RE): [Proceedings]. IEEE Computer Society, p. 155-166 12 p. (Proceedings of the IEEE International Conference on Requirements Engineering).Research output: Chapter in Book / Report / Conference proceeding › Conference contribution › Academic › peer-review Sensitive Informations 100% Software Application 100% Who Speaks for Ethics? How Demographics Shape Ethical Advocacy in Software DevelopmentOlson, L., Anna-Lena Fischer, R., Kunneman, F. & Guzmán, E., 2025, FAccT '25: Proceedings of the 2025 ACM Conference on Fairness, Accountability, and Transparency. Association for Computing Machinery, Inc, p. 2847-2862 16 p.Research output: Chapter in Book / Report / Conference proceeding › Conference contribution › Academic › peer-review Open Access Advocacy 100% Software Development 100% Decision-Making 100% Face 100% Ethical Decision-Making 100% View all 40 research outputs Courses Ethics and PrivacyGuzman Ortega, E.1/09/25 → 31/08/26Course Requirements EngineeringGuzman Ortega, E.1/09/25 → 31/08/26Course",
  "content_length": 4256,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:55"
}