{
  "name": "Adrian Francalanza",
  "homepage": "http://staff.um.edu.mt/afra1",
  "status": "success",
  "content": "Adrian Francalanza Adrian Francalanza's Homepage contact | academic | personal | about Program committee member for SEFM 2025. Conference paper Monitorability for the Modal mu-Calculus over Systems with Data: From Practice to Theory has been accepted at CONCUR 2025. Conference paper If At First You Don't Succeed: Extended Monitorability through Multiple Executions has been accepted at LICS 2025. Invite panel speaker at the Gender Parity in Science workshop co-located with DisCoTec 2025. Program committee member for RADICAL 2025. Program Chair for GandALF 2025 with Giorgio Bacci Conference paper A theory of (linear-time) timed monitors has been accepted at ECOOP 2025. It also won the Distinguished Paper Award. Program committee member for FORTE 2025. Apr 25 Program committee member for FSEN 2025. Nov 24 Program committee member for SEFM 2024. Oct 24 Program committee member for RV 2024. Sep 24 Conference paper Runtime Instrumentation for Reactive Components has been accepted at ECOOP 2024. Sep 24 Program committee member for EXPRESS/SOS 2024. Sep 25 Conference paper Centralized vs Decentralized Monitors for Hyperproperties has been accepted at CONCUR 2024. Jun 24 Program Chair for GandALF 2024 with Antonis Achilleos Jun 24 Conference paper COTS: Connected OpenAPI Test Synthesis for RESTful Applications has been accepted at Coordination 2024. Jun 24 Conference paper Implementing a Message-Passing Interpretation of the Semi-Axiomatic Sequent Calculus (Sax) has been accepted at Coordination 2024. Jun 24 Program Chair for FORTE 2024 with Valentina Castiglioni Jan 24 Journal paper A monitoring tool for linear-time muHML has been accepted in Science of Computer Programming. Nov 23 Program committee member for SEFM 2023. Oct 23 Journal paper ElixirST: A session-based type system for Elixir modules has been accepted in Journal of Logical and Algebraic Methods in Programming. Oct 23 Program committee member for RV 2023. Aug 23 Journal paper On first-order runtime enforcement of branching-time properties has been accepted in Acta Informatica. Jun 23 Program committee member for Coordination 2023. Jun 23 Program committee member for MFPS 2023. Jun 23 Program committee member for FORTE 2023. May 23 Program committee member for FSEN 2023. Mar 23 Program committee member for FM 2023. Feb 23 Journal paper Bidirectional Runtime Enforcement of First-Order Branching-Time Properties has been accepted in Logical Methods in Computer Science. Dec 22 Program committee member for FTSCS 2022. Oct 22 Journal paper PSTMonitor: Monitor synthesis from probabilistic session types has been accepted in Science of Computer Programming. Sep 22 Program committee member for GANDALF 2022. Sep 22 Program committee member for RV 2022. Jul 22 Paper On Probabilistic Monitorability has been accepted at Principles of Systems Design. Jun 22 Conference paper Complexity through Translations for Modal Logic with Recursion has been accepted at GandALF 2022. Jun 22 Conference paper Session Fidelity for ElixirST has been accepted at ICE 2022 (co-located with DisCoTec 2022). Jun 22 Conference paper A Monitoring Tool for the Linear-Time muHML has been accepted at Coordination 2022. The paper also won best paper at DisCoTec 2022. The accompanying tool can be accessed from here. Jun 22 Conference paper A Synthesis Tool for Optimal Monitors in a Branching-Time Setting has been accepted at Coordination 2022. Jun 22 Conference paper Monitoring Hyper-properties with Circuits has been accepted at FORTE 2022. Jun 22 Program chair for the 5th International Workshop on Verification and mOnitoring at Runtime EXecution (VORTEX) colocated with ECOOP 2022. Jun 22 Program committee member for Coordination 2022. Jun 22 Program committee member for FORTE 2022. Oct 21 Conference paper Session types in Elixir has been accepted at Agere 2021 (co-located with SPLASH 2021). Oct 21 Program committee member for RV 2021. Sep 21 Program committee member for CONCUR 2021. Sep 21 Program committee member for ICTAC 2021. Aug 21 Conference paper Graft: General Purpose Raft Consensus in Elixir has been accepted at Erlang 2021 (co-located with ICFP 2021). Aug 21 Program committee member for EURO-PAR 2021. Jul 21 Conference paper On the Monitorability of Session Types, in Theory and Practice has been accepted at ECOOP 2021. Supporting artefact instructions and binaries available. Jul 21 Session Type Monitor tool website updated. Jul 21 Program chair for the 4th International Workshop on Verification and mOnitoring at Runtime EXecution (VORTEX) colocated with ECOOP 2021 and ISSTA 2021. Jul 21 Journal paper A Theory of Monitors has been accepted in the Journal on Information and Computation (I&C). Jun 21 Conference paper Towards Probabilistic Session-Type Monitoring has been accepted at Coordination 2021. Jun 21 Conference paper Better Late Than Never or: Verifying Asynchronous Components at Runtime has been accepted at FORTE 2021. Jun 21 Conference paper On Bidirectional Runtime Enforcement has been accepted at FORTE 2021. Jun 21 General Chair for the 16th International Federated Conference on Distributed Computing Techniques (DisCoTec 2021). May 21 DetectEr tool website updated. Apr 21 Conference paper On Benchmarking for Concurrent Runtime Verification has been accepted at FASE 2021. Feb 21 Journal paper An Operational Guide to Monitorability with Applications to Regular Properties has been accepted in the Journal on Software and Systems Modeling (SoSyM). Jan 21 Journal paper Computer Says No: Verdict Explainability for Runtime Monitors using a Local Proof System has been accepted in the Journal of Logical and Algebraic Methods in Programming (JLAMP). Jan 21 Conference paper The Best a Monitor Can Do has been accepted at CLS 2021. Dec 20 Conference paper Behavioural Types for Memory and Method Safety in a Core Object-Oriented Language has been accepted at APLAS 2020. Nov 20 Program committee member for FSEN 2021. Oct 20 Journal paper Comparing Controlled System Synthesis and Suppression Enforcement has been accepted in the Journal on Software Tools for Technology Transfer (STTT). Sep 20 Program committee member for Runtime Verification (RV) 2020. Jun 20 Conference paper On Implementing Symbolic Controllability has been accepted at Coordination 2020. Jun 20 Conference paper Towards a Hybrid Verification Methodology for Communication Protocols has been accepted at FORTE 2020. Jun 20 General Chair for the 15th International Federated Conference on Distributed Computing Techniques (DisCoTec 2020). May 20 Book Chapter Towards Choreographic-Based Monitoring has been accepted as part of Reversible Computation - Extending Horizons of Computing. Mar 20 Journal paper The Complexity of Identifying Characteristic Formulae has been accepted in the Journal of Logical and Algebraic Methods in Programming (JLAMP). Feb 20 Journal paper Determinizing monitors for HML with recursion has been accepted in the Journal of Logical and Algebraic Methods in Programming (JLAMP). Nov 19 Journal paper A Survey on Challenges for Runtime Verification from Advanced Application Domains (beyond software) has been published in the Journal of Formal Methods in System Design (FMSD) Nov 19 Program committee member for ICTAC 2019. Oct 19 Conference paper Comparing Controlled System Synthesis and Suppression Enforcement has been accepted at Runtime Verification (RV). Oct 19 Program committee member for Runtime Verification (RV) 2019. Sep 19 Conference paper An Operational Guide to Monitorability has been accepted at SEFM 2019. Sep 19 Program committee member for CONCUR 2019. Sep 19 Program committee member for EXPRESS/SOS @ CONCUR 2019. Sep 19 Program committee member for RADICAL @ CONCUR 2019. Aug 19 Program chair for Erlang Workshop (EW) @ ICFP 2019. Jul 19 Conference paper The Cost of Monitoring Alone has been accepted at From Reactive Systems to Cyber-Physical Systems. Jun 19 Program chair for the 3rd International Workshop on Verification of Objects at Runtime Execution (VORTEX) @ ECOOP 2019. Jun 19 Conference paper Testing Equivalence Vs. Runtime Monitoring has been accepted at Models, Languages, and Tools for Concurrent and Distributed Programming. Mar 19 Program committee member for PLACES 2019 @ ETAPS. Jan 19 Journal paper Adventures in Monitorability: From Branching to Linear Time and Back Again has been accepted at POPL 2019. Jan 19 Program committee member for BEAT 2019 @ POPL. Nov 18 Journal paper Full-abstraction for client testing preorders has been accepted to Science of Computer Programming. Oct 18 Program committee member for FSEN 2019. Sep 18 Conference paper On Runtime Enforcement via Suppressions has been accepted at CONCUR 2018. Jul 18 Conference paper Shooting from the Heap: Ultra-Scalable Static Analysis with Heap Snapshots has been accepted at ISSTA 2018. Jun 18 Conference paper Reversible Choreographies via Monitoring in Erlang has been accepted at DAIS 2018. Sep 18 Program committee member for RV 2018. Sep 18 Program committee member for YR-CONCUR 2018. Sep 18 Invited Speaker at the 25th Workshop in Expressivness in Concurrency/Structural Operational Semantics (EXPRESS/SOS) 2018, colocated with CONCUR 2018. Mar 18 Conference paper A Framework for Parametrized Monitorability has been accepted at FoSSaCS 2018. Jan 18 Two book chapters published in Lectures on Runtime Verification: Introduction to Runtime Verification and Runtime Verification for Decentralised and Distributed Systems. Nov 17 Program Chair for Erlang 2018 colocated with ICFP 2018 . Nov 17 Program committee member for ICTAC 2018. Dec 17 Conference paper Monitoring for Silent Actions has been accepted at FSTTCS 2017. Oct 17 Journal paper Heaps Don't Lie: Countering Unsoundness with Heap Snapshots has been accepted at OOPSLA 2017. Sep 17 Invited tutorial paper A Foundation for Runtime Monitoring has been presented at RV 2017. Sep 17 Conference paper Consistently-Detecting Monitors has been accepted at CONCUR 2017. Sep 17 Paper eAOP: an aspect ori",
  "content_length": 16230,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:51"
}