{
  "name": "Adrian Perrig",
  "homepage": "http://www.netsec.ethz.ch/people/aperrig",
  "status": "success",
  "content": "Network Security Group, ETH Zurich Prof. Dr. Adrian Perrig Prof. Dr. Adrian PerrigCAB F 85.1Universitätstrasse 68092 ZürichPhone: +41 44 632 99 69E-Mail: adrian.perrig@inf.ethz.ch Our main project is on the SCION secure Internet architecture. We have founded Anapaya Systems, a startup to commercialize SCION technology. Publications 306 results 2025 Fantastic Joules and Where to Find Them. Modeling and Optimizing Router Energy Demand. Romain Jacob, Lukas Roellin, Jackie Lim, Jonathan Chung, Maurice Behanzin, Weiran Wang, Andreas Hunziker, Theodor Moroianu, Seyedali Tabaeiaghdaei, Adrian Perrig, and Laurent Vanbever. In ACM Internet Measurement Conference (IMC) 2025. [bibtex] [pdf] Towards Stress Testing the Internet Inter-Domain Routing System ‘in Silico’ with Domino. Elham Ehsani Moghadam, Fabian E. Bustamante, Adrian Perrig, and Walter Willinger. In 44th International Symposium on Reliable Distributed Systems (SRDS) 2025. (Best Student Paper Award) [bibtex] [pdf] Hummingbird: Fast, Flexible, and Fair Inter-Domain Bandwidth Reservations. Karl Wüst, Giacomo Giuliari, Markus Legner, Jean-Pierre Smith, Marc Wyss, Jules Bachmann, Juan A. Garcia-Pardo, and Adrian Perrig. In Proceedings of ACM SIGCOMM 2025. Research Area: Distributed Denial of Service Defenses [bibtex] [pdf] Scaling SCIERA: A Journey Through the Deployment of a Next-Generation Network. François Wirz*, Marten Gartner*, Jelte van Bommel*, Elham Ehsani Moghadam, Grace H. Cimaszewski, Anxiao He, Yizhe Zhang, Henry Birge-Lee, Flix Kottmann, Cyrill Krähenbühl, Jonghoon Kwon, Kyveli Mavromati, Liang Wang, Daniel Bertolo, Marco Canini, Buseung Cho, Ronaldo A. Ferreira, Simon. P. Green, David Hausheer, Junbeom Hur, Xiaohua Jia, Heejo Lee, Prateek Mittal, Omo Oaiya, Chanjin Park, Adrian Perrig, Jerry Sobieski, Yixin Sun, Cong Wang, and Klaas Wierenga. (*joint first authors). In Proceedings of ACM SIGCOMM 2025. [bibtex] [pdf] Inter-domain Routing with Extensible Criteria. Seyedali Tabaeiaghdaei, Jelte van Bommel, Marc Wyss, João Luis Sobrinho, Giovanni Barbiero, Giacomo Giuliari, Ahad N. Zehmakan, and Adrian Perrig. In Proceedings of ACM SIGCOMM 2025. [bibtex] [pdf] BGP Vortex: Update Message Floods Can Create Internet Instabilities. Felix Stöger, Henry Birge-Lee, Giacomo Giuliari, Jordi Subirà-Nieto, and Adrian Perrig. In Proceedings of the USENIX Security Symposium 2025. [bibtex] [pdf] Polaris: End-to-End Path Optimization by End Hosts. Elham Ehsani Moghadam, Patrick Wicki, François Wirz, Jordi Subirà Nieto, Yih-Chun Hu, and Adrian Perrig. In Proceedings of the IEEE/ACM International Symposium on Quality of Service (IWQoS) 2025. [bibtex] [pdf] BFES: Towards Optimal Bayesian Frequency Estimation Sketches in Data-Streams. Francesco Da Dalt, and Adrian Perrig. In 2025 IEEE 41st International Conference on Data Engineering (ICDE) 2025. [bibtex] [pdf] [doi] [slides] Low-cost and Robust Global Time Synchronization. Marc Wyss, Marc Frei, Jonghoon Kwon, and Adrian Perrig. In Proceedings of the IEEE Symposium on Security and Privacy 2025. (+poster) Research Area: Distributed Denial of Service Defenses [bibtex] [pdf] [slides] Path-aware Access Control: Granting Access with Transit Network Attributes. Jonghoon Kwon, Julian Modanese, Jordi Subirà Nieto, and Adrian Perrig. In Proceedings of the IEEE International Conference on Communications (ICC) 2025. [bibtex] [pdf] Poster: Clockwire – Multi-path Time Synchronization Made Practical. Marc Frei, Jonghoon Kwon, Marc Wyss, and Adrian Perrig. In Proceedings of the IEEE Symposium on Security and Privacy (Poster Session) 2025. [bibtex] [pdf] Protocols to Code: Formal Verification of a Secure Next-Generation Internet Router. João Pereira, Tobias Klenze, Sofia Giampietro, Markus Limbeck, Dionysios Spiliopoulos, Felix Wolf, Marco Eilers, Christoph Sprenger, David Basin, Peter Müller, and Adrian Perrig. In Proceedings of the ACM Conference on Computer and Communications Security (CCS) 2025. [bibtex] [pdf] [doi] SCION and cross-border payments: Enhancing security and compliance in distributed ledger networks. Grace Cimaszewski, Francesco Da Dalt, Thomas Moser, and Adrian Perrig. In SNB Working Papers 2025. [bibtex] [pdf] 2024 Domino: Towards a Testbench for Stress Testing Internet Critical Infrastructure. Elham Ehsani Moghadam, Fabian E. Bustamante, Adrian Perrig, and Walter Willinger. In 2024 IEEE 32nd International Conference on Network Protocols (ICNP) Demo's and Posters 2024. [bibtex] [pdf] Zero-setup Intermediate-rate Communication Guarantees in a Global Internet. Marc Wyss, and Adrian Perrig. In Proceedings of the USENIX Security Symposium 2024. Research Area: Distributed Denial of Service Defenses [bibtex] [pdf] [video] On Building Secure Wide-Area Networks over Public Internet Service Providers. Marc Wyss, Roland Meier, Llorenç Romá, Cyrill Krähenbühl, Adrian Perrig, and Vincent Lenders. In International Conference on Cyber Conflict (NATO CCDCOE CyCon) 2024. [bibtex] [pdf] Debuglet: Programmable and Verifiable Inter-domain Network Telemetry. Seyedali Tabaeiaghdaei, Filippo Costa, Jonghoon Kwon, Patrick Bamert, Yih-Chun Hu, and Adrian Perrig. In Proceedings of the IEEE International Conference on Distributed Computing Systems (ICDCS) 2024. [bibtex] [pdf] SPArch: A hardware-oriented sketch-based architecture for high-speed network flow measurements. Arish Sateesan, Jo Vliegen, Simon Scherrer, Hsu-Chun Hsiao, Adrian Perrig, and Nele Mentens. In ACM Transactions on Privacy and Security 2024. [bibtex] [pdf] Charting Censorship Resilience & Global Internet Reachability: A Quantitative Approach. Marina Ivanović, François Wirz, Jordi Subirà Nieto, and Adrian Perrig. 2024. (arXiv version) [bibtex] [pdf] DNS Congestion Control in Adversarial Settings. Huayi Duan, Jihye Kim, Marc Wyss, and Adrian Perrig. In Proceedings of the ACM Symposium on Operating Systems Principles (SOSP) 2024. [bibtex] [pdf] [slides] CAMP: Compositional Amplification Attacks against DNS. Huayi Duan, Marco Bearzi, Jodok Vieli, David Basin, Adrian Perrig, Si Liu, and Bernhard Tellenbach. In Proceedings of the USENIX Security Symposium 2024. [bibtex] [pdf] [slides] Toward Global Latency Transparency. Cyrill Krähenbühl, Seyedali Tabaeiaghdaei, Simon Scherrer, Matthias Frei, Adrian Perrig. In IEEE/IFIP Networking, recent results track 2024. (arXiv version) [bibtex] [pdf] An Empirical Study of Consensus Protocols’ DoS Resilience. Giacomo Giuliari, Alberto Sonnino, Marc Frei, Fabio Streun, Lefteris Kokoris-Kogias, and Adrian Perrig. In In Proceedings of the ACM Asia Conference on Computer and Communications Security (ASIACCS) 2024 2024. [bibtex] [pdf] The SA4P Framework: Sensing and Actuation as a Privilege. Piet De Vaere, Felix Stöger, Gene Tsudik, and Adrian Perrig. In In Proceedings of the ACM Asia Conference on Computer and Communications Security (ASIACCS) 2024 2024. [bibtex] [pdf] 2023 ALBUS: a Probabilistic Monitoring Algorithm to Counter Burst-Flood Attacks. Simon Scherrer, Jo Vliegen, Arish Sateesan, Hsu-Chun Hsiao, Nele Mentens, and Adrian Perrig. In Proceedings of the Symposium on Reliable Distributed Systems (SRDS) 2023. [bibtex] [pdf] [slides] A Formal Framework for End-to-End DNS Resolution. Si Liu*, Huayi Duan*, Lukas Heimes, Marco Bearzi, Jodok Vieli, David Basin, and Adrian Perrig. (*co-first authors). In Proceedings of ACM SIGCOMM 2023. [bibtex] [pdf] [slides] SAGE: Software-based Attestation for GPU Execution. Andrei Ivanov, Benjamin Rothenberger, Arnaud Dethise, Marco Canini, Torsten Hoefler, and Adrian Perrig. In Proceedings of USENIX Annual Technical Conference (ATC) 2023. [bibtex] [pdf] DMTP: Deadline-aware Multipath Transport Protocol. Tony John, Adrian Perrig, and David Hausheer. In Proceedings of IFIP Networking 2023. [bibtex] [pdf] Carbon-Aware Global Routing in Path-Aware Networks. Seyedali Tabaeiaghdaei, Simon Scherrer, Jonghoon Kwon, and Adrian Perrig. In Proceedings of ACM International Conference on Future Energy Systems (e-Energy) 2023. (Among the 6 Best-Paper Candidates) [bibtex] [pdf] [slides] Hercules: High-Speed Bulk-Transfer over SCION. Marten Gartner, Jean-Pierre Smith, Matthias Frei, Francois Wirz, Cedric Neukom, David Hausheer, and Adrian Perrig. In Proceedings of IFIP Networking 2023. [bibtex] [pdf] Qualitative Intention-aware Attribute-based Access Control Policy Refinement. Shohei Mitani, Jonghoon Kwon, Nakul Ghate, Taniya Singh, Hirofumi Ueda, and Adrian Perrig. In Proceedings of ACM Symposium on Access Control Models and Technologies (SACMAT) 2023. [bibtex] [pdf] Demystifying Web3 Centralization: The Case of Off-Chain NFT Hijacking. Felix Stöger, Anxin Zhou, Huayi Duan, and Adrian Perrig. In Proceedings of International Conference on Financial Cryptography and Data Security (FC) 2023. [bibtex] [pdf] Trusted Introductions For Secure Messaging. Christelle Gloor, and Adrian Perrig. In Proceedings of International Workshop on Security Protocols 2023. [bibtex] [pdf] [slides] Determining an Economic Value of High Assurance for Commodity Software Security. Virgil Gligor, Adrian Perrig, and David Basin. In Proceedings of Twenty-eighth International Workshop on Security Protocols 2023. [bibtex] [pdf] Inter-Domain Routing with Extensible Criteria. Seyedali Tabaeiaghdaei, Marc Wyss, Giacomo Giuliari, Jelte van Bommel, Ahad N. Zehmakan, and Adrian Perrig. 2023. [bibtex] [pdf] Quality Competition Among Internet Service Providers. Simon Scherrer, Seyedali Tabaeiaghdaei, and Adrian Perrig. In Proceedings of the International Symposium on Computer Performance, Modeling, Measurements and Evaluation (PERFORMANCE) 2023. [bibtex] [pdf] [slides] Did the Shark Eat the Watchdog in the NTP Pool? Deceiving the NTP Pool’s Monitoring System. Jonghoon Kwon, Jeonggyu Song, Junbeom Hur, and Adrian Perrig. In Proceedings of the USENIX Security Symposium 2023. [bibtex] [pdf] FABRID: Flexible Attestation-Based Routing for Inter-Domain Networks. Cyrill Krähenbühl, Marc Wyss, David Basin, Vincent Lenders, Adrian Perrig, and Martin Strohmeier. In Proceedin",
  "content_length": 72218,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:55"
}