{
  "name": "Adriano Sarmento",
  "homepage": "https://www.cin.ufpe.br/~aams",
  "status": "success",
  "content": "Adriano Sarmento's Page Adriano Sarmento Sou atualmente Professor Adjunto I pertencente ao Departamento de Sistemas de Computação do Centro de Informática (CIn) da Universidade  Federal de Pernambuco. Faço parte do grupo de pesquisa GRECO, que pesquisa, entre outras coisas, os vários aspectos de projeto e concepção de sistemas embarcados. Formação Ensino Áreas de Interesse Publicações Currículo Lattes Outros Interesses Formação Bacharel em Ciências da Computação Universidade Federal de Pernambuco 1996 Mestre em Ciências da Computação Universidade Federal de Pernambuco 2000 Docteur en Nano et Microélectronique Université Joseph Fourier (Grenoble I) - Grenoble, França 2005 Áreas de Interesse Ambientes de Projeto de Sistemas Embarcados Modelagem e Síntese de Interfaces Hardware/Software Validação/Co-simulação de Sistemas Heterogêneos Ensino Introdução à Programação (graduação de Engenharia da Computação) Curso dado no primeiro semestre para ensinar conceitos básicos de programação, utilizando a linguagem C como apoio.  São ensinadas, também, as melhores práticas/técnicas de programação visando atingir os diversos fatores de qualidade do software. Infraestrutura de Hardware (graduação de Ciência da Computação) Curso dado no terceiro semestre que visa dar uma visão geral dos componentes de um computador: processador, sistema de memória (memória principal e memória cache), Entrada e Saída e Barramentos. Ensina-se o papel de cada componentes em um sistema computacional e o modo de funcionamento de cada um. Conceitos mais avançados de pipelining, arquiteturas superescalares, arquiteturas multi-cores e hierarquia de memórias também são tratados. Publicações SANTOS, RODOLFO P. ; CLEMENTE, GABRIELA S. ; SILVA-FILHO, ABEL ; ARAÚJO, CRISTIANO ; SARMENTO, ADRIANO ; LIMA, MANOEL ; BARROS, EDNA . An Optimization Mechanism Intended for Static Power Reduction Using Dual-VthTechnique. Journal of Electrical and Computer Engineering, v. 2012, p. 1-12, 2012. SILVA-FILHO, ABEL G. ; CORDEIRO, FILIPE R. ; ARAÚJO, CRISTIANO C. ; SARMENTO, A ; GOMES, MILLENA ; BARROS, EDNA ; LIMA, MANOEL E. . An ESL Approach for Energy Consumption Analysis of Cache Memories in SoC Platforms. International Journal of Reconfigurable Computing (Print), v. 2011, p. 1-12, 2011. GOMES, M ; ARAÚJO, C ; SARMENTO, A ; CEISSLER,C ; BEZERRA, J ; FARIAS, D . REDUCING SOC DESIGN EFFORT BY ABSTRACTING COMMUNICATION DETAILS USING A ESL CENTRIC SERVICE BASED UML PROFILE. In: 9th Microelectronics Students Forum, 2009, Natal. 9th Microelectronics Students Forum, 2009. KRIAA, L. ; SARMENTO, A ; YOUSSEF, W. ; BOUCHHIMA, A. ; PETROT, F. ; JERRAYA, A. A. ; FOUILLIART, A. . Flexible Hardware/Software Interface Modeling Using High Level service Based Component Model. In: 13th Workshop on Synthesis And System Integration of Mixed Information technologies - SASIMI, 2006, Nagoya. 13th Workshop on Synthesis And System Integration of Mixed Information technologies - SASIMI, 2006. SARMENTO, A . Génération Automatique de Modèles de Simulation pour la Validation de Systèmes Hétérogènes Embarqués. Grenoble: UJF, 2005 (Tese de Doutorado). SARMENTO, A ; KRIAA, L. ; GRASSET, A. ; YOUSSEF, W. ; BOUCHHIMA, A. ; ROUSSEAU, F. ; CESARIO, W. ; JERRAYA, A. A. . Service Dependency Graph, an Efficient Model for Hardware/Software Interfaces Modeling and Generation for SoC Design. In: International Conference on Hardware - Software Codesign and System Synthesis CODES-ISSS, 2005, Nova Iorque. International Conference on Hardware - Software Codesign and System Synthesis CODES-ISSS 2005, 2005. FOUILLIART, A. ; VAUMORIN, E. ; NOUACER, R. ; SARMENTO, A ; KRIAA, L. ; KAJFASZ, P. ; COUSSY, P. ; BLANC, F. . SystemC'Mantic: A high level Modeling and Co-design Framework For Reconfigurable Real Time Systems. In: Forum on Design Languages - FDL'05, 2005, Lausanne. Forum on Design Languages - FDL 05, 2005. SARMENTO, A ; CESARIO, W. ; JERRAYA, A. A. . Automatic Building of Executable Models from Abstract SoC Architectures. In: 15 th IEEE International Workshop on Rapid System Prototyping -RSP, 2004, Genebra. 15 th IEEE International Workshop on Rapid System Prototyping -RSP 2004, 2004. SARMENTO, A ; FERNANDES, J. H. C. ; BARROS, E. . HardWWWired: Using the Web as Repository of VHDL Components. In: Ralf Seepold; Natividad Martinez Madrid. (Org.). Virtual Components Design and Reuse. 1 ed. Boston: Kluwer Academic Publishers, 2000, v. , p. -. SARMENTO, A . HardWWWired: Uma Plataforma Para Projetos de Sistemas Digitais em VHDL na Web. Recife: UFPE, 2000 (Dissertação de Mestrado). SARMENTO, A ; FERNANDES, J. H. C. ; BARROS, E. . HardWWWired: Using the Web as Repository of VHDL Components. In: Forum on Design Languages, 1999, Lyon. Proceedings of the Forum on Design Languages 1999, 1999. p. 271-280. SARMENTO, A ; FERNANDES, J. H. C. ; BARROS, E. . HardWWWired: Designing VHDL Systems in the Web. In: 14th International Conference on Microelectronics and Packaging, 1999, Campinas. 14th International Conference on Microelectronics and Packaging, 1999. p. 139-144. SARMENTO, A ; FERNANDES, J. H. C. ; BARROS, E. . HardWWWired- Projetando Sistemas Digitais em VHDL na Web. In: XXVI Seminário Integrado de Software e Hardware (SEMISH) - Congresso da Sociedade Brasileira de Computação, 1999, Rio de Janeiro. Anais do XIX Congresso Nacional da Sociedade Brasileira de Computação, 1999. v. 1. p. 265-279.",
  "content_length": 5380,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:00"
}