{
  "name": "Adrian Friday",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/adrian-friday",
  "status": "success",
  "content": "Adrian Friday - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Professor Adrian Friday SFHEA Professor of Computing and Sustainability Research Overview Adrian Friday is Professor of Computing and Sustainability at Lancaster University. A Ubicomp pioneer, he has over 25 years’ experience developing, deploying and studying digital infrastructures embedded in everyday environments. His interdisciplinary projects focus on understanding how digital systems impact energy and carbon footprint, including: energy use in the home (EP/I00033X/1); thermal comfort using less energy; sustainable food choices (EP/K012738/1); sustainable transport infrastructure (EP/K012614/1), sustainable last-mile logistics (EP/N02222X/1; EP/S027726/1); and mining fine-grained industrial energy and contextual data using time-series statistical and ML techniques (EP/T025964/1). He is an advisor to the leading Ubicomp journal, IMWUT; and a member of the Royal Society ``Digital Technology and the Planet'' working group responsible for advising on policy for ICT toward sustainable digital society. If you're interested in the systems or human factors concerning ubicomp, energy demand or computational sustainability, please do make contact. We're always looking for talented potential PhD students and RAs to join our team. Show more… Career Details Academic Qualifications: Doctor of Philosophy (1996) 1st Class B.SC. Hons in Computer Science (University of London, 1991) Employment: Reader in Ubiquitous Computing and Sustainability (School of Computing and Communications), 2013-present. Professional Role Administrative Role: Part 2 Tutor, Computer Science and Communications Undergraduate Programmes. Professional Service: Ubicomp Joint Steering Committee 2006-2013 Programme co-chair Ubicomp 2006, Pervasive 2009, Ubicomp 2014. International expert panel member Ubiquitous Oulu UBI-Challenge Dec 2010-present EPSRC college of peers, proposal reviewer 2007, 2008, 2010, 2012 Invited programme committee member for numerous conferences and workshops, including ACM MobiHoc 2005, ACM MobiSys 2006; ACM Ubicomp 2007-8, 2010-11; Pervasive 2007; PerCom 2006, 2011 Expert reviewer: CHI 2007, 2009-13; ACM Transactions on Computer-Human Interaction (TOCHI); IEEE Pervasive Magazine; ACM International Conference on Ubiquitous Computing; IEEE Computer; International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI); ACM Transactions on Mobile Computing; Journal of Software and Systems Modeling (SOSYM); Journal of Concurrency and Computation; IEEE Intelligent Systems Magazine; Journal Networked Applications; IEEE Communications Letters PhD Supervision Interests Interests in applying ubicomp sensing to conduct real world empirical experiments to uncover how everyday practices contribute to carbon externality and global warming, and how we might transform these using technological ubicomp interventions. Show less Publications Projects Activities PhD Students Research Groups Selected Publications Show all 192 publications Accounting for Energy-Reliant Services within Everyday Life at HomeBates, O., Clear, A., Friday, A., Hazas, M., Morley, J. 18/06/2012Conference contribution/Paper Ubiquitous Computing SystemsBardram, J., Friday, A. 2009 In: Ubiquitous Computing Fundamentals. CRC Press p. 37-94. 58 p. ISBN: 978-1-4200-9360-5.Chapter Democratizing ubiquitous computing: a right for localityWeise, S., Hardy, J., Agarwal, P., Coulton, P., Friday, A., Chiasson, M. 2012Conference contribution/Paper Ubicomp systems at 20: progress, opportunities, and challengesCaceres, R., Friday, A. 01/2012 In: IEEE Pervasive Computing. 11, 1, p. 14-21. 8 p.Journal article All Publications Show only selected publications Reimagining digital research infrastructure in environmental science for a sustainable future 01/01/2025 → 31/12/2027 Research DSI: Reducing the Global ICT Footprint via Self-adaptive Large-scale (DCMS Supplement) 01/12/2022 → 31/05/2023 Research DSI: Learning from the Big Picture: Applying Responsible Innovation to the Net Zero Research Infrastructure transformation (ARINZRIT) 01/09/2022 → 19/05/2023 Research “What if you were controlled by all these apps?” - challenging indifference toward essential gig economy courier work. 01/05/2021 → 30/11/2022 Research Can we improve building management and reduce carbon footprint through a mesh network of indoor air quality sensors? 01/01/2021 → 01/01/2024 Research Reducing End Use Energy Demand in Commercial Settings Through Digital Innovation 01/01/2021 → 30/09/2025 Research Future Places: A Digital Economy Centre on Understanding Place Through Pervasive Computing 01/10/2020 → 28/02/2026 Research Digitally transforming deliveries and collections in the gig-economy: fairer and more sustainable last mile parcel logistics 01/09/2019 → 31/05/2022 Research DSI: Energy in Schools 01/03/2018 → 30/01/2020 Research Freight Traffic Control 2050: transforming the energy demands of last-mile urban freight through collaborative logistics 01/04/2016 → 30/08/2019 Research Cyber Security of the Internet of Things 29/02/2016 → … Research Cyber Security of the Internet of things 28/02/2016 → 31/08/2019 Research Behaviours that Stick: Exploring emotional design of sustainable behaviours that stick 01/04/2014 → 31/12/2014 Research RECALL: Enchanced Human Memory Recall 01/11/2013 → 31/10/2016 Research Encouraging low carbon food shopping with ubicomp interventions 29/06/2013 → 30/04/2015 Research Supporting Sustainable Transport Infrastructure Maintenance (Research in the Wild) 30/04/2013 → 31/01/2015 Research Informing Energy Choices Using Ubiquitous Sensing 18/01/2011 → 28/06/2013 Research FP7: PD-NET 01/05/2010 → 31/07/2013 Research Speaker at Energy Systems Catapult Seminar Invited talk TalkTalk's Making Sense of Sustainability for SMEs Invited talk IEEE Computer Society 2024 Best Paper Award Prize (including medals and awards) IEEE Computer Society 2021 Best Paper Award Prize (including medals and awards) Iman Hussain PhD student Lancaster Intelligent, Robotic and Autonomous Systems Centre, LIRA - Smart Cities and Mobility enable JavaScript to view email address Kathy New PhD student Energy Lancaster enable JavaScript to view email address Adam Tyler PhD student Sustainable Computing enable JavaScript to view email address Yiyin Zhang PhD student Changepoints and Time Series enable JavaScript to view email address DSI - Environment Energy Lancaster MSF Supervisors 2019/20 Network and Systems Pentland Centre SCC (Pervasive Systems) Sustainable Computing Back to listing Contact Details Department: Computing and Communications Office: C57, C - Floor, InfoLab21 TelTelephone: enable JavaScript to view email address Back to listing",
  "content_length": 7000,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:50"
}