{
  "name": "Adwait Nadkarni",
  "homepage": "https://www.adwaitnadkarni.com",
  "status": "success",
  "content": "Adwait Nadkarni Toggle navigation Adwait Nadkarni Short Bio Publications Grants Teaching Service Students CV Lab I am the Class of 1953 Associate Professor of Computer Science at William & Mary, where I lead the Secure Platforms Lab (SPL). I am also the Director of the W&M Cybersecurity Center. My research secures platforms such as smart phones and smart homes by evaluating and improving automated security analyses used for vulnerability/malware detection. In particular, I build frameworks for qualitative and quantitative evaluation of security analysis tools along three key directions: (1) empirically evaluating security and privacy techniques (NDSS’24, FSE’23 Demo-a, S&P’22, USENIX’18, ACM TOPS, ICSE’21 Tool Demo), (2) understanding and characterising developer and user expectations from tools (PETS’25, S&P’25-b, S&P’25-a, S&P’24-a Distinguished Paper Award, FSE’23 Demo-b, S&P’20), and (3) uncovering novel, practical, threats and building defenses for software/apps/frameworks (USENIX’24, S&P’24-b, WiSec’24, CCS’22, USENIX’22, ACM TCPS 2020, CODASPY’19 Best Paper, ACMiner). Contact Information Office: McGlothlin-Street Hall 104-C Phone: (757) 221 2953 Email: apnadkarni at wm.edu Quick Links Currently teaching: CSCI 780 IoTSpotter, for extracting and analyzing mobile-IoT apps MASC, for evaluating crypto-API misuse detectors Helion, for generating realistic home automation scenarios μSE, for evaluating Android data-leak detectors Current PhD Students Prianka Mandal Victor Olaiya Md. Akram Khan Recent Professional Service ACM SACMAT Program Chair: 2026 ACM TOPS Associate Editor: June 2024 - present IEEE S&P Associate Chair, Treasurer: 2026, 2025 IEEE S&P Program Committee: 2026, 2025, 2024, 2023 USENIX Security Symposium Program Committee: 2023, 2021, 2019, 2018 ISOC NDSS Program Committee: 2025, 2024, 2022, 2021, 2020 The WebConf Program Committee: 2024 PETS Program Committee: 2025, 2023 ACSAC Program Committee: 2023, 2022, 2021 ACM CCS Program Committee: 2018 IEEE/ACM ASE Program Committee: 2021 ACM WiSec Program Committee: 2023, 2022, 2020, 2019, 2018 News March 10, 2025 Our paper, \"We can’t allow IoT vendors to pass off all such liability to the consumer - Investigating the U.S. Legal Perspectives on Liability for IoT Product Security\" has been accepted to the IEEE Symposium on Security and Privacy 2025! [S&P'25] January 29, 2025 Our paper, \"Free WiFi is not ultimately free - Privacy Perceptions of Users in the US regarding City-wide WiFi Services\" has been accepted to the Privacy Enhancing Technologies Symposium (PETS/PoPETS 2025)! [PETS'25] December 18, 2024 Our paper, \"Testing Practices, Challenges, and Developer Perspectives in Open-Source IoT Platforms\" has been accepted to the IEEE International Conference on Software Testing, Verification and Validation (ICST 2025)! [ICST'25] September 9, 2024 Our paper, \"We can't change it overnight - Understanding Industry Perspectives on IoT Product Security Compliance and Certification\" has been accepted to the IEEE Symposium on Security and Privacy 2025! [S&P'25] August 19, 2024 Our paper, \"Enhancing Transparency and Accountability of TPLs with PBOM - A Privacy Bill of Materials\" has been accepted to the 2024 ACM Workshop on Software Supply Chain Offensive Research and Ecosystem Defenses (SCORED 2024), co-located with ACM CCS 2024! [SCORED'24] May 20, 2024 Our paper, \"False negative - that one is going to kill you - Understanding Industry Perspectives of Static Analysis based Security Testing\" has received the Distinguished Paper Award at the IEEE Symposium on Security and Privacy 2024! December 19, 2023 Our proposal (PI - Sidi Lu; Co-PI - Adwait Nadkarni) on \"Investigating Security and Privacy by Design for Teleoperated Autonomous Vehicles\" has been funded as a part of the CCI Fall 2023 call on \"Supply Chain Cybersecurity\"![CCI Announcement] ... see all news © 2022 Adwait Nadkarni. Site made with Jekyll, using a template made available by Allan Lab. Contact: Department of Computer Science William & Mary McGlothlin-Street Hall 104-C Williamsburg, VA - 23188, USA",
  "content_length": 4084,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:01"
}