{
  "name": "Adway Mitra",
  "homepage": "https://sites.google.com/site/adwayresearch",
  "status": "success",
  "content": "AdwayResearchSearch this siteEmbedded FilesSkip to main contentSkip to navigationHomeHello, this is Adway. I am a teacher and researcher, interested in Machine Learning and Data Mining, and especially in the application of these techniques to solve problems affecting the world. More specifically, I am interested in data-driven modeling and simulation of complex spatio-temporal processes. My background is in Computer Science and Engineering, and my PhD thesis was related to semantic Video Analytics, using Bayesian modeling techniques. I am currently an Assistant Professor in the Department of Artificial Intelligence, IIT Kharagpur. I am currently focusing on Climate Informatics  (application of Data Science/Machine Learning to solve problems in Climate Science), Deep Generative Models and Agent-based Models.Research Interests:   1) Climate Informatics                                              2)  Agent-based modeling of social processes (elections, urban mobility                                              3) Remote Sensing for Sustainable Development                                              4) Causal graphical models and networks                                              5) Approximate Bayesian Computation and Likelihood-free Inference                                              6) Deep generative models for spatio-temporal processesSome of my current projects are as follows:Developing deep neural models as surrogates for physics-based models for Earth SciencesIdentifying causal drivers of climatic processes (like Indian Monsoon)High-resolution projections of climatic variables based on forecasts and simulationsModeling various aspects of district-based political elections using Agent-based Simulation with Probabilistic InferencePlanning for sustainable development using Machine Learning on Remote Sensing (mapping of human settlements, agricultural lands,  industrial and traffic emissions)Agent-based modeling of physical and social processes (eg. epidemiology, population dynamics, urban dynamics) and calibration with reality using Approximate Bayesian ComputationPlanning for Road Safety through Traffic SimulationsCurrent position:   Assistant Professor, Department of Artificial Intelligence, Indian Institute of Technology, Kharagpur (2019-)Previous position:  1) Assistant Professor, School of Electrical Sciences, Indian Institute of Technology, Bhubaneswar (2018-19)                                          2) Postdoctoral Researcher, International Center for Theoretical Sciences, Bangalore (Recipient of Airbus Postdoctoral Fellowship) (2016-18)Educational background: 1) Ph.D. from Department of Computer Science and Automation, Indian Institute of Science, Bangalore (2010-2015)                                         2) M.E.  from Department of Computer Science and Automation, Indian Institute of Science, Bangalore (2008-2010)                                         3) B.E.  from Department of Computer Science and Engineering, Jadavpur University, Kolkata (2004-2008)Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 3105,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:01"
}