{
  "name": "Adyasha Dash",
  "homepage": "https://cse.kiit.ac.in/profiles/adyasha-dash",
  "status": "success",
  "content": "Adyasha Dash - KIIT School of Computer Engineering Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Adyasha Dash Adyasha Dash Adyasha Dash Assistant ProfessorMrs. Adyasha Dash is currently working as an Assistant professor in School Of Computer Engineering, KIIT Deemed to be University,India.She has 5 years of teaching experience.she holds a bachelor's degree in Computer Science and Engineering from Silicon Institute of Technology and master's degree in Computer Science and Engineering from Veer Surendra Sai University,Burla in 2016.she has taught Programming in C,Data Structure and Algorithm,Database management system,Operating system,DAA,Android programming.Her liking teaching subjects are DBMS,OS and Computational Intelligence.Her area of expertise are Data Mining, Big Data Analytics,NLP.Adyasha Dash has 2 years of teaching experience.she holds a bachelor's degree in Computer Science and Engineering from Silicon institute of technology and master's degree in Computer Science and Engineering from Veer surendra sai university in 2016.she has taught Programming in C,Data Structure and Algorithm,Database management system,Operating system,DAA,Android programming.Her area of expertise are Data Mining, Big Data Analytics,NLP.She guides undergraduate and post graduate students in different project and has helped graduate and post graduate students in publishing papers.She has attended 25 and above different programs such as a faculty development program, seminar and workshop in national and international level.She has already supervised three post graduate students Profile LinksEmail :[email protected] Social LinksProfileRecent PublicationsProfileResearch InterestsBig Data Analytics,NLP, Machine Learning,Data Mining,Text AnalyticsAdministrative Responsibility2 year experience as an FIC student affairs. Subject coordinator for RDBMS and DBMS Worked as an FIC Industrial training and grand viva.Recent PublicationsJournals/Conferences :1. Enhanced Entity Extraction Using Big Data Mechanism International Conference On Advanced Computing Networking and Informatics’18 (ICANI-2018), Indore, 2. A Proposal for Text Based Similarity measures and key phrase extraction Using Natural Language Processing in hadoop based environment(7 pages) ICCIDM sachi2019-01-03T09:30:27+05:30 Page load link Go to Top",
  "content_length": 2383,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:02"
}