{
  "name": "Afsaneh Razi",
  "homepage": "https://www.afsanehrazi.com",
  "status": "success",
  "content": "Afsaneh RaziSearch this siteEmbedded FilesSkip to main contentSkip to navigationI am an Assistant Professor at the College of Computing and Informatics at Drexel University, where I direct ETHOS (Ethical Technology Helping Our Society) Lab and co-direct the DONUTS (Data Ontology Networks Users Textuality Safety) Co-Lab. I am a Human-Computer Interaction (HCI) researcher who utilizes artificial intelligence to tackle sociotechnical issues using human-centered approaches. My research expertise is positioned at the intersection of HCI, Social Computing, AI/ML, Privacy, and Online Safety. I am passionate about investigating the sociotechnical complexities of online harms to design and develop technologies facilitating safer and supportive online interactions, especially for vulnerable populations such as youth.Email: afsaneh.razi@drexel.eduPublications: Google Scholar LinkedIn Recent NewsMay 2025: Our research was highlighted at CTV News: ‘It missed me after 6 messages:’ when AI companions cross the line, May 2025: I'll be attending the WebSci conference and excited that my PhD student Matt Namvarpour is presenting our paper \"The Evolving Landscape of Youth Online Safety: Insights from News Media Analysis\" on May 22nd.April 2025: We have two accepted paper at CSCW 2025: \"AI-induced sexual harassment: Investigating Contextual Characteristics and User Reactions of Sexual Harassment by a Companion Chatbot\"Unfiltered: How Teens Engage in Body Image and Shaming Discussions via Instagram Direct Messages (DMs)Jan 2025: I'll be a panelist at GROUP on \"New Opportunities, Risks, and Harm of Generative AI for Fostering Safe Online Communities\" on Monday, Jan 13th.July 2024: Michal Monselise will present our accepted poster on \"Investigating Preferences of Young People for Support Types Provided by AI around Sexual Risks and Abuse\" at IC2S2 2024July 2024: Excited to give a talk at the Summer Institute in Computational Social Science, University of Pennsylvania, on July 10th!June 2024: Our paper “Personally Targeted Risk vs. Humor: How Online Risk Perceptions of Youth vs. Third-Party Annotators Differ based on Privately Shared Media on Instagram.” was presented at the ACM Interaction Design and Children Conference (IDC '24) April 2024: Happy that two out of  four accepted papers received Honorable Mention Award at CHI'24! 🏆Nora McDonald, John S. Seberger, and Afsaneh Razi. “For Me or Not for Me? The Ease With Which Teens Navigate Accurate and Inaccurate Personalized Social Media Content.”A. Alsoubai, J. Park, A. Razi, S. Qadir, G. Stringhini, and P. J. Wisniewski. “Systemization of Knowledge (SoK): Creating a Research Agenda for Human-Centered Real-Time Risk Detection on Social Media Platforms.” April 2024: Excited to give a talk at \"AI for Social Good: Empowering Youth to Be Resilient Against Cybergrooming\" workshop hosted by Drs Jin-Hee Cho, Sang Won Lee, and Lifu Huang at Virginia Tech  March 2024: Our workshop paper with Matt Namvarpour titled \"Apprentices to Research Assistants: Advancing Research with Large Language Models\" is accepted at \"LLMs as Research Tools: Applications and Evaluations in HCI Data Work\" workshop at CHI 2024Feb 2024: Excited that we have four papers and one LBW accepted at CHI 2024. Jan 2024: I was interviewed by NBC-10 News on the congress hearing about social media and the risks to young people (beginning at 14:34): https://www.nbcphiladelphia.com/news/local/nbc10-issue/nbc10-issue-spending-plan-preview/3766249/ Jan 2024: Read my article at The Conversation: Teens on social media need both protection and privacy – AI could help get the balance right November 2023: We have two papers accepted at ACM CSCW 2024: A. Razi, J. Seberger, A. Alsoubai, N. Naher, S. M. De Choudhury, and P. Wisniewski, “Toward Trauma-Informed Research with Youth in HCI: Understanding Youth and Research Assistants’ Experiences When Engaged in Sensitive Research.” A. Alsoubai, A. Razi, Z. Agha, S. Ali, G. Stringhini, M. De Choudhury, and P. Wisniewski, “Profiling the Offline and Online Risk Experiences of Youth to Develop Targeted Interventions for Online Safety.”  Sept 2023: I am delighted that our work \"Sliding into My DMs: Detecting Uncomfortable or Unsafe Sexual Risk Experiences within Instagram Direct Messages Grounded in the Perspective of Youth\" received the Impact Recognition Award at CSCW 2023.Sept 2023: Presenting \"A Data Donation Approach for Youth Online Safety\" at Data Donation SymposiumAugust 2023: I am so happy that my mentee Jessica Medina was selected for the 2023 NSF Computer and Information Science and Engineering Graduate Fellowships (CSGrad4US) program to pursue her research interests.July 2023: Our team with Jordyn Young and Jessica Medina received the Science Center Health Equity Research Fellowship Award for the project \"Leveraging Social Media to Study Social Determinants of Health for People Living with Epilepsy\"July 2023: Our workshop is accepted at CSCW2023! From AI to Gen Z, let's co-create an AI research agenda together with youth! Inviting researchers and youth activists to participate! June 2023: I got the Faculty Summer Research Award at Drexel University for investigating AI's role in teens' online safety.April 2023: Our recent papers published at ACM CSCW'23 and CHI'23 have been featured at DrexelNEWS:Sliding Out of My DMs: Young Social Media Users Help Train Machine Learning Program to Flag Unsafe Sexual Conversations on InstagramWhat Happens When Teens Privately Ask for Help on Instagram?Machine Learning Can Help to Flag Risky Messages on Instagram While Preserving Users’ PrivacyNovember 2022: Talk at the University of Washington DUB Seminar on \"Leveraging a Human-Centered Approach to Machine Learning to Improve Youth Online Safety\".May 2022: I will join the College of Computing and Informatics at Drexel University as an Assistant Professor in Fall 2022.April 2022: Congratulations to my undergraduate mentee Carolina Santos on receiving the judges’ choice distinction award for presenting a poster in the Student Scholar Symposium at UCF, 2022 from among a strong group of Undergraduate presentations in the S.T.E.M category. April 2022: I defended my dissertation entitled, “A Human-centered Approach to Improving Adolescent Online Sexual Risk Detection Algorithms.”  Thanks to my advisor Dr. Pamela Wisniewski and committee members Dr. Charlie Hughes, Dr. Munmun De Choudhury, and Dr. Ulas Bagci.April 2022: We received Best Paper Honorable Mention for our CHI 2022 paper on understanding the digital lives of youth. You can read the full paper here.March 2022: We presented at MozFest 2022 where we launched our MozSafely community. Modus Operandi Safely (MOSafely.org) is an open-source community that leverages evidence-based research, data, and Artificial Intelligence to help youth engage more safely online. To learn detail about MoSafely you can check our presentation slide and also visit our MoSafely website.December 2021: Our case study paper was published at the ACM CHI 2022 titled \"Instagram Data Donation: A Case Study on Collecting Ecologically Valid Social Media Data for the Purpose of Adolescent Online Risk Detection\". October 2021: Accepted publications at the 24th ACM CSCW 2021: Full papers: \"A Human-Centered Systematic Literature Review of the Computational Approaches for Online Sexual Risk Detection\", \"Safe Sexting: The Support Adolescents Receive from Peers Concerning Their Online Sexual Experiences \", \"A Human-Centered Systematic Literature Review of Cyberbullying Detection Algorithms \". Workshop: \"MOSafely: Building an Open-Source HCAI Community to Make the Internet a Safer Place for Youth \" Poster: \"If You Care About Me, You’ll Send Me a Pic \"September 2021: Congratulations to the STIR Lab’s Teenovate team in obtaining grant funding for supporting the development of a Youth Advisory Board! The grant was created by the Social Media Adolescent Health Research Team (SMAHRT) within the Technology and Adolecent Mental Wellness program, at the University of Wisconsin-Madison.  September 2021: We are leading the MOSafely Workshop at CSCW, in collaboration with students from Georgia Tech and Boston University. The goal of this one-day workshop is to begin building an active community of researchers, practitioners, and policy-makers who are jointly committed to leveraging human-centered artificial intelligence (HCAI) to make the internet a safer place for youth. For more details about the workshop, please visit https://www.mosafely.org/workshops/cscw2021/August 2021: Congratulations to the MOSafely Senior Design Team for completing their Senior Design Project! Their work can be seen here: https://sd.mosafely.orgJune 2020: I start an internship as a User Experience Researcher with Mozilla. June 2020: I am selected as the Grace Hopper Student Scholars for 2020. I am excited to learn from the experiences and career trajectories of women across a diverse array of roles in technology.April 2020: I am presenting my work as part of a series of presentations, on April 30th. A (Virtual) Taste of CHI 2020 will feature a lineup of presentations on data, health, and learning. I will be presenting our work, entitled, “Let’s Talk about Sext: How Adolescents Seek Support and Advice About Their Online Sexual Experiences”. February 2020: I was featured in a UCF news article as part of a series on Stories of Impact+Innovation. The article highlights my work at the intersection of human-computer interaction and machine learning. To read the full article, please click here: Student Research: Working to Mitigate Sexual Dangers for Teens OnlineGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 9695,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:02"
}