{
  "name": "Afsaneh Doryab",
  "homepage": "https://www.afsanehdoryab.com",
  "status": "success",
  "content": "Afsaneh DoryabSearch this siteEmbedded FilesSkip to main contentSkip to navigationAfsaneh DoryabGoogle ScholarLinkedIn Ph.D. Computer Science, UVA School of Engineering and Applied Science Assistant Professor I work on computational modeling of human behavior from data streams collected through mobile, wearable, and embedded sensors. Examples of my work in the health domain include detection of behavior change in people with depression, predicting mania-depression episodes in bipolar disorder, estimation of symptom severity in cancer patients, and modeling of surgical activities inside the operating room. I also work on intelligent applications for social good. My recent work in Context-aware Peer-to-Peer economic exchange is focused on connecting communities of people through mobile technology to enable successful and meaningful service transactions, especially in low-income communities. In my research, I draw on methods from Machine Learning, Data Mining, Statistics, and Human-Computer Interaction.Selected PublicationsBeWell: Sensing Sleep, Physical Activities and Social Interactions to Promote Wellbeing [PDF]Nicholas D Lane, Mu Lin, Mashfiqui Mohammod, Xiaochao Yang, Hong Lu, Giuseppe Cardone, Shahid Ali, Afsaneh Doryab, Ethan Berke, Andrew T Campbell, Tanzeem ChoudhuryMobile Networks and Applications, June 2014Identifying Behavioral Phenotypes of Loneliness and Social Isolation with Passive Sensing: Statistical Analysis, Data Mining and Machine Learning of Smartphone and Fitbit Data [PDF]Afsaneh Doryab, Daniella K Villalba, Prerna Chikersal, Janine M Dutcher, Michael Tumminia, Xinwen Liu, Sheldon Cohen, Kasey Creswell, Jennifer Mankoff, John D Creswell, Anind K Dey JMIR mHealth and uHealth, July 2019If It’s Convenient: Leveraging Context in Peer-to-Peer Variable Service Transaction Recommendations [PDF]Afsaneh Doryab, Victoria Bellotti, Alaaeddine Yousfi, Shuobi Wu, John M Carroll, Anind K Dey Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, Sept 2017Estimation of Symptom Severity During Chemotherapy from Passively Sensed Data: Exploratory Study [PDF]Afsaneh Doryab, Victoria Bellotti, Alaaeddine Yousfi, Shuobi Wu, John M Carroll, Anind K DeyProceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, Sept 2017Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2386,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:02"
}