{
  "name": "Agata Ciabattoni",
  "homepage": "https://www.logic.at/staff/agata",
  "status": "success",
  "content": "Agata Ciabattoni Agata Ciabattoni Contact Technische Universität Wien Inst. of Logic & Computation Theory and Logic Group E192-05 Address: Favoritenstrasse 9, (Stiege 2/3.Stock) A-1040 Wien, Austria E-mail: agata@logic.at Phone: +43 1 58801-18545 Fax: +43 1 58801-18597 Profile Research Publications Team Student Projects Personal Distinguished paper award at IJCAI 2025 (with E. Neufeld and R. Tulcan) Blog article at Aihub.org Best paper award at TABLEAUX 2025 (with T. Land and R. Ramanayake) Best student paper award at JELIA 2025 (with D.Rozplokhas and M. Tesi) Running research projects: WWTF ( Digital Humanism call ICT 2023) AXAIS : Acquiring and explaining norms for AI systems (with Cristinel Mateis and John Horty) 2025-2028 Cluster of Excellence Bilateral Artificial Intelligence 2024-2029. (Call for positions here ) FWF project Logical methods for Deontic Explanations (LoDEx) (with Leon van der Torre and Christian Strasser ) (WEAVE schema with Luxemburg and Germany) 2024-2026 WWTF (call ICT 2022) project TAIGER : Training and Guiding AI Agents with Ethical Rules (with Ezio Bartocci and Thomas Eiter). 2023-2027. Scientist in charge for the Marie Curie Individual fellowship of Matteo Tesi 2024-2026 EC-RISE Project MOSAIC (Modalities in Substructural Logics: Theory, Methods and Applications). 2021-2026. MSCA COFUND Doctoral Programme LogiCS@TUWien. 20 PhD positions. 2022-2027. Current conference activities: PC co-chair of DEON 2025 (Vienna), AIML 2024 (Prague) PC member of AIML 2026, IJCAR 2026, LICS 2025, ICAIL 2025, KR 2024, NMR 2024, LPAR 2024, IJCAR 2024, TACL 2024 Opening of the Vienna Summer of Logic 2014 (Eiter, Veith, Ciabattoni, Scott, Papadimitriu, Vardi, Szeider, Gottlob) Logic -- the most important science on earth (Cover story of \"Profil \", June 2014) Austria's news weekly \"Profil \", December 2015",
  "content_length": 1840,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:03"
}