{
  "name": "Agnar Aamodt",
  "homepage": "https://www.ntnu.edu/employees/agnar",
  "status": "success",
  "content": "Agnar Aamodt - NTNU Agnar Aamodt Download press photo Download press photo Foto: Close Agnar Aamodt Professor Emeritus agnar@ntnu.no +4792611144 IT-bygget, VIP-rommet, Gløshaugen, Sem Sælands vei 9 About Professor (retired) in Computer Science and Artificial Intelligence. Affiliated with Norwegian Open AI Lab. Research Area Main research area is Artificial Intelligence, and in particular methods for data analysis and experience-based support of human problem solving and learning. In particular: Methods for experience capture and reuse of human experiences,and in particular case-based reasoning in combination with generalization-based methods Machine learning and data analysis Knowledge modelling and representation Cognitive Science Decision support systems Application areas in focus include medicine and health, fish farming, petroleum technology, search and rescue. Research Group: Data and Artificial Intelligence Additional information: www.idi.ntnu.no/~agnar Competencies Artificial intelligence Case-based reasoning Datamining Experience Transfer Knowledge acquisition Knowledge modelling Machine learning Publications Updated publications list in Google Scholar: https://scholar.google.com/citations?user=XfI8SR8AAAAJ&hl=en 2017 Houeland, Tor Gunnar Høst; Aamodt, Agnar. (2017) A learning system based on lazy metareasoning. Progress in Artificial Intelligence Academic article 2016 Mathisen, Bjørn Magnus; Aamodt, Agnar. (2016) Kunstig intelligens og maskinglæring. Overlegen Popular scientific article Bach, Kerstin; Szczepanski, Tomasz Szymon; Aamodt, Agnar; Gundersen, Odd Erik; Mork, Paul Jarle. (2016) Case representation and similarity assessment in the selfBACK decision support system. CEUR Workshop Proceedings Academic article Bach, Kerstin; Szczepanski, Tomasz Szymon; Aamodt, Agnar; Gundersen, Odd Erik; Mork, Paul Jarle. (2016) Case Representation and Similarity Assessment in the SELFBACK Decision Support System. Lecture Notes in Computer Science (LNCS) Academic article 2015 Tidemann, Axel; Aamodt, Agnar. (2015) Workshop: AI and creativity in entertainment. Lecture Notes in Computer Science (LNCS) Editorial Sizov, Gleb; Øzturk, Pinar; Aamodt, Agnar. (2015) Evidence-driven retrieval in textual CBR: Bridging the gap between retrieval and reuse. Lecture Notes in Computer Science (LNCS) Academic article 2014 Shokouhi, Samad Valipour; Skalle, Pål; Aamodt, Agnar. (2014) An overview of case-based reasoning applications in drilling engineering. Artificial Intelligence Review Academic article Kofod-Petersen, Anders; Andersen, Ole Johan; Aamodt, Agnar. (2014) Case-based reasoning for improving traffic flow in urban intersections. Lecture Notes in Computer Science (LNCS) Academic article 2013 Gundersen, Odd Erik; Sørmo, Frode; Aamodt, Agnar; Skalle, Pål. (2013) A real-time decision support system for high cost oil-well drilling operations. The AI Magazine Academic article Skalle, Pål; Aamodt, Agnar; Gundersen, Odd Erik. (2013) Experience Transfer for Process Improvement. Engineering Applications of Artificial Intelligence Academic article Skalle, Pål; Aamodt, Agnar; Gundersen, Odd Erik. (2013) Detection of Symptoms for Revealing Causes Leading to Drilling Failures. SPE Drilling & Completion Academic article Skalle, Pål; Aamodt, Agnar; Laumann, Karin. (2013) Integrating human related errors with technical errors to determine causes behind offshore accidents. Safety Science Academic article 2012 Tidemann, Axel; Bjørnson, Finn Olav; Aamodt, Agnar. (2012) Operational Support in Fish Farming through Case-based Reasoning. Lecture Notes in Computer Science (LNCS) Academic article 2011 Aamodt, Agnar; Gundersen, Odd Erik; Loge, Jon Håvard; Wasteson, Elisabeth; Szczepanski, Tomasz. (2011) Case-based reasoning for assessment and diagnosis of depression in palliative care. Computer-Based Medical Systems Academic article Tidemann, Axel; Bjørnson, Finn Olav; Aamodt, Agnar. (2011) Case-based reasoning in a system architecture for intelligent fish farming. Frontiers in Artificial Intelligence and Applications Academic article Houeland, Tor Gunnar Høst; Aamodt, Agnar. (2011) An Efficient Hybrid Classification Algorithm - An Example from Palliative Care. Lecture Notes in Computer Science (LNCS) Academic article Houeland, Tor Gunnar Høst; Bruland, Tore; Aamodt, Agnar; Langseth, Helge. (2011) Combining CBR and BN using metareasoning. Frontiers in Artificial Intelligence and Applications Academic article 2010 Houeland, Tor Gunnar Høst; Aamodt, Agnar. (2010) The utility problem for lazy learners - towards a non-eager approach. Lecture Notes in Computer Science (LNCS) Academic article Gundersen, Odd Erik; Loge, Jon Håvard; Aamodt, Agnar. (2010) Decision-support for Diagnosing Depression through Case-based Reasoning. Palliative Medicine Abstract Shi, Zhongzhi; Vadera, Sunil; Aamodt, Agnar; Leake, David. (2010) Intelligent Information Processing V. Springer Springer Academic anthology/Conference proceedings Bruland, Tore; Aamodt, Agnar; Langseth, Helge. (2010) Architectures Integrating Case-Based Reasoning and Bayesian Networks for Clinical Decision Support. IFIP Advances in Information and Communication Technology Academic article Shokouhi, Samad Valipour; Aamodt, Agnar; Skalle, Pål. (2010) Applications of CBR in Oil Well Drilling: A General Overview. IFIP Advances in Information and Communication Technology Academic article 2009 Shokouhi, Samad Valipour; Aamodt, Agnar; Skalle, Pål; Sørmo, Frode. (2009) Determining root causes of drilling problems by combining cases and general knowledge. Lecture Notes in Computer Science (LNCS) Academic article Kofod-Petersen, Anders; Aamodt, Agnar. (2009) Case-Based Reasoning for Situation-Aware Ambient Intelligence: A Hospital Ward Evaluation Study. Lecture Notes in Computer Science (LNCS) Academic article 2008 Aamodt, Agnar. (2008) Case-based reasoning for advice-giving in a data-intensive environment. Frontiers in Artificial Intelligence and Applications Academic article Kofod-Petersen, Anders; Cassens, Jörg; Aamodt, Agnar. (2008) Explanatory Capabilities in the CREEK Knowledge-Intensive Case-Based Reasoner. Frontiers in Artificial Intelligence and Applications Academic article 2006 Kofod-Petersen, Anders; Aamodt, Agnar. (2006) Contextualised Ambient Intelligence through Case-Based Reasoning. Lecture Notes in Computer Science (LNCS) Academic article Gu, Mingyang; Aamodt, Agnar. (2006) Evaluating CBR Systems Using Different Data Sources: A Case Study. Lecture Notes in Computer Science (LNCS) Academic article 2005 Marling, Cindy; Rissland, Edwina; Aamodt, Agnar. (2005) Integrations with case-based reasoning. Knowledge engineering review (Print) Academic literature review Sørmo, Frode; Cassens, Jörg; Aamodt, Agnar. (2005) Explanation in Case-Based Reasoning - Perspectives and Goals. Artificial Intelligence Review Academic article Richter, Michael; Aamodt, Agnar. (2005) Case-based reasoning foundations. Knowledge engineering review (Print) Academic literature review Mantaras, Ramon Lopez de; McSherry, David; Bridge, Derek; Leake, David; Smyth, Barry; Craw, Susan. (2005) Retrieval, reuse, revision, and retention in case-based reasoning. Knowledge engineering review (Print) Academic literature review Gu, Mingyang; Aamodt, Agnar. (2005) A Knowledge-Intensive Method for Conversational CBR. Lecture Notes in Computer Science (LNCS) Academic article 2004 Aamodt, Agnar. (2004) Knowledge-intensive case-based reasoning in CREEK. Lecture Notes in Computer Science (LNCS) Academic article 2002 Jære, Martha Dørum; Aamodt, Agnar. (2002) Representing temporal knowledge for case-based prediction. Lecture Notes in Computer Science (LNCS) Academic article 2000 Skalle, Pål; Sveen, Jostein; Aamodt, Agnar. (2000) Improved efficiency of oil well drilling through case-based reasoning. Lecture Notes in Computer Science (LNCS) Academic article 1999 Aamodt, Agnar; Bø, Ketil. (1999) A new approach to applicable memory-based reasoning. Journal of experimental and theoretical artificial intelligence (Print) Academic article 1998 Øzturk, Pinar; Aamodt, Agnar. (1998) A context model for knowledge-intensive case-based reasoning. International Journal of Human-Computer Studies Academic article 1996 Aamodt, Agnar; Althoff, Klaus-Dieter. (1996) Relating case-based problem solving and learning methods to task and domain characteristics; towards an analytic framework. AI Communications Academic article Aamodt, Agnar; Althoff, Klaus-Dieter. (1996) Zur Analyser fallbasierter Problemöse- und Lernmethode in Abhängigkeit von Charakteristika gegebener Aufgabenstellungen und Anwendungsdomänen. Künstliche Intelligenz Academic article 1995 Aamodt, Agnar; Nygård, Mads. (1995) Different Roles and Mutual Dependencies of Data, Information, and Knowledge - an AI perspective on their integration. Data & Knowledge Engineering Academic article Aamodt, Agnar; Veloso, Manuela. (1995) Case-Based Reasoning Research and Development, First International Conference on Case-Based Reasoning, ICCBR-95. Springer Springer Non-fiction book Aamodt, Agnar; Komorowski, Jan. (1995) SCAI'95: Fifth Scandinavian Conference on Artificial Intelligence. [Mangler utgivernavn] [Mangler utgivernavn] Non-fiction book 1994 Aamodt, Agnar; Plaza, Enric. (1994) Case-Based Reasoning: Foundational issues, current state, and future trends. AI Communications Academic article 1992 Aamodt, Agnar; Sølvberg, Ingeborg; Nordbø, Inge. (1992) Knowledge-Based Information Retrieval. Future Generation Computer Systems Academic article Journal publications Houeland, Tor Gunnar Høst; Aamodt, Agnar. (2017) A learning system based on lazy metareasoning. Progress in Artificial Intelligence Academic article Mathisen, Bjørn Magnus; Aamodt, Agnar. (2016) Kunstig intelligens og maskinglæring. Overlegen Popular scientific article Bach, Kerstin; Szczepanski, Tomasz Szymon; Aamodt, Agnar; Gundersen, Odd Erik; Mork, Paul Jarle. (2016) Case representation and similarity assessment in the selfBACK decision support system. C",
  "content_length": 17714,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:05"
}