{
  "name": "Agnes Koschmider",
  "homepage": "https://www.pa.informatik.uni-kiel.de/en/team/prof-dr-agnes-koschmider",
  "status": "success",
  "content": "Person Prof. Dr. Agnes KoschmiderInstitut für Informatikagnes.koschmider@uni-bayreuth.deProf. Dr. Agnes Koschmider Inhaberin des Lehrstuhls für Wirtschaftinformatik und Process Analytics an der Universität Bayreuth und Zweitmitglied an der Technischen Fakultät der Christian-Albrechts-Universität zu Kiel.Sie ist Sprecherin der DFG-Forschungsgruppe FOR 5495 \"SOURCED\" und Mitantragsstellerin (Co-Applicant) des Projekts NFDIxCS.Von 2019 bis 2022 war Agnes Koschmider Professorin für Wirtschaftsinformatik am Informatik-Institut der Universität Kiel . Davor war sie Professorin (Associate Professor) an der Poznań University of Economics and Business, Vertretungsprofessorin an der Universität Köln und PostDoc am Institut für Angewandte Informatik und Formale Beschreibungsverfahren am KIT . Sie hat ihre Promotion 2007 und ihre Habilitation im Fach Angewandte Informatik 2015 am KIT abgeschlossen. Zwischen der Promotion und der Habilitation folgten Stipendien mit zahlreichen Forschungsaufenthalte an der TU Eindhoven, Politechnischen Universität Valencia, Alpen-Adria-Universität Klagenfurt und IBM Research (Almaden).Sie hat über 100 Forschungsarbeiten und Artikel veröffentlicht, unter anderem in Data & Knowledge Engineering, Decision Support Systems, Information Systems, IEEE Transactions on Cloud Computing, ACM Transactions on Management Information Systems, Business & Information Systems Engineering und BPM Journal. Ihre Arbeit wurde mit dem Wolfgang-Heilmann-Preis, dem Junior-Fellowship der Gesellschaft für Informatik und einem Postdoktorandenstipendium der University of Pretoria ausgezeichnet. Team Universitätsübergreifende Teamliste Zu den Publikationen DBLPGoogle ScholarResearchGate Lehrveranstaltungen und Abschlussarbeiten Zu den Lehrveranstaltungen im UnivISOffene Themen für Abschlussarbeiten Zu Personen der Technischen Fakultät Bitte geben Sie einen Suchbegriff ein Suche: Gefunden auf Seite Pressemitteilungen & News Veranstaltungen Weitere Treffer ALLE ERGEBNISSE AUFRUFEN Keine Ergebnisse Nicht fündig geworden? Hier geht es zur Personen- und Einrichtungssuche über univIS Datenschutzerklärung Notwendige Cookies Statistiken Wir verwenden Cookies, um Funktionen unserer Webseiten zur Verfügung zu stellen und Zugriffsstatistiken zu erstellen. Mehr zu unserem Datenschutz Alle akzeptieren Nur essentielle Cookies akzeptieren Speichern und schließen Datenschutz",
  "content_length": 2390,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:08"
}