{
  "name": "Agoritsa Polyzou",
  "homepage": "https://apolyzou123.github.io/apolyzou",
  "status": "success",
  "content": "Agoritsa Polyzou's Homepage Agoritsa Polyzou Assistant Professor, FIU About Me Hello! I am an Assistant Professor of Computer Science at the Knight Foundation School of Computing and Information Sciences (KFCIS) at Florida International University (FIU). Before joining FIU, I was a postdoctoral Fritz family fellow in the Massive Data Institute (MDI) of McCourt School of Public Policy at Georgetown University. I received my Ph.D. in Computer Science and Engineering from the University of Minnesota in 2020 and my Bachelor's in Computer Engineering and Informatics from the University of Patras, Greece. My research interests include data mining, recommender systems, the application of machine learning techniques within educational contexts, and the fairness concerns that arise from their use. My goal is to support decision-making using data and machine learning models. At the same time, I am interested in ensuring that such models will be fair and responsible. Contact Email: apolyzou@fiu.edu Knight Foundation School of Computing and Information Sciences 11200 SW 8th Street Miami, FL 33199 Students Neila Bennaname, PhD student Fall 2024 - Fall 2025: Neila received the GAANN Fellowship from KFCIS, funded by the U.S. Department of Education! Ravi Ranjan Kumar, PhD student Zahid Imtiaz, PhD student (co-advised with Dr. Ali Ebrahimian) Darien Diaz Rivera, Master's student Nancy Lopez, Master's student Daniela Zaccardi Canela, Master's student Osmel Cereijo, Master's student Past PhD's Students Md Akib Zabed Khan, PhD Summer 2025: Akib successfully defended his PhD and graduated! He will be joining Christopher Newport University (Virginia, US) as an assistant professor! Spring 2025: Akib won 2nd place in the Physical Sciences & Engineering category for his poster at the 2025 GSAW Scholarly Forum, University Graduate School, FIU! Spring 2025: Akib received the prestigious Dissertation Fellowship (DF), funded by the University Graduate School, FIU! Past Master's Students Guy Pavilus - \"Forecasting house pricing in Florida's Market\" - Spring 2025 Gabriel Prieto Puche - \"Exploring Collaborative Success of Undergraduate Students within a Cyberlearning Environment Using Gamification\" - Fall 2024 Darwin Sadineni - \"Course Characteristics and Student Enrollment Analysis\" Maria Sanchez & Rafael Linarez - \"Integrated Health Monitoring Using Wearable Devices\" Steven Morales - \"Predicting Music Sequences with Machine Learning\" Nicholas Gonzalez - \"Course Characteristics and Student Enrollment Analysis\" Kerrie Hopper - \"An NLP analysis of AI Ethics Syllabi\" Anthony Athens - \"Predicting Baseball Game Winners Using Data from Baseball Savant\" Andrea Garcia - \"Predicting Future-Term Student Performance Based on Historical Enrollment Data\" Publications Google Scholar Profile Grants NOAA National Sea Grant, 09/2024-08/2027, $2,327,898, \"AI-powered characterization of solids and microplastics in stormwater runoff and their mitigation via green and gray infrastructure in urban coastal areas\" PIs: A. Ebrahimian, A. Braswell, L. Scinto, P. Gardinali, H. Vatankhah, A. Polyzou, D. Luo DUE 2130398, NSF, 07/2021-06/2026, $1,898,240, \"Florida Information Technology Graduation Attainment Pathways\" PIs: Mark Weiss, Stephen Secules, Tiana Solis, Agoritsa Polyzou, Leonardo Bobadilla (Former Co-PIs: Liting Hu, Selcuk Uluagac) IUSE:EDU 2315647, NSF, 08/2023-07/2026, $399K, \"Augmented Learning for Environmental Robotics Technologies: A Data-Driven Approach for Sustainable Built Environments\" PI: S. Vassigh, Co-PIs: B. Bogosian, E. Peterson, G. Reis, A. Polyzou IIS 2323492, NSF, 08/2023-11/2024, $25K, \"Travel: Student Support for the 2023 ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 2023)\" PI: A. Polyzou Teaching CAP 5771 - Principles of Data Mining (graduate level) - Fall 2021-2025, Spring 2022-2025 CAP 4770 - Introduction to Data Mining (undergraduate level) - Spring 2022 CIS 5931 - Special Topics: AI Ethics (graduate level) - Spring 2024, 2025",
  "content_length": 3995,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:06"
}