{
  "name": "Ahmad Hemmati",
  "homepage": "https://www.uib.no/en/persons/Ahmad.Hemmati",
  "status": "success",
  "content": "Ahmad Hemmati | UiB Skip to main content Edit Ahmad Hemmati Position Associate Professor Affiliation Department of Informatics E-mail ahmad.hemmati@uib.no Phone number +47 55584163 Visitor address HIB - Thormøhlens gate 555006 Bergen Postal address P.O. Box 7803 NO-5020 Bergen Norway Ahmad Hemmati Position Associate Professor Affiliation Department of Informatics Research groups Optimization | UiB Energy Informatics Center for Data Science Publications 2025 Shafaei, Abolfazl; Reza, Mohammad; Jokar, Akbari et al. (2025). Using the route planning for supplying spare parts to reduce distribution costs: a case study in a roadside assistance company. (external link) Torabi, Parisa; Hemmati, Ahmad; Oleynik, Anna et al. (2025). A deep reinforcement learning hyperheuristic for the covering tour problem with varying coverage. (external link) 2023 Torabi, Parisa; Oleynik, Anna; Hemmati, Ahmad et al. (2023). Covering tour problem with varying coverage: Application to marine environmental monitoring. (external link) Kallestad, Jakob Vigerust; Hasibi, Ramin; Hemmati, Ahmad et al. (2023). A general deep reinforcement learning hyperheuristic framework for solving combinatorial optimization problems. (external link) Bergmann, Morten; Msakni, Mohamed Kais; Hemmati, Ahmad et al. (2023). An adaptive heuristic for Feeder Network Design with optional transshipment. (external link) Moshref-Javadi, Mohammad; Cauwenberghe, Kristof P. Van; McCunney, Brent A. et al. (2023). Enabling same-day delivery using a drone resupply model with transshipment points. (external link) Heidari, Nooshin; Hemmati, Ahmad (2023). An ALNS-based matheuristic algorithm for a multi-product many-to-many maritime inventory routing problem. (external link) Karimpour, Asal; Setak, Mostafa; Hemmati, Ahmad (2023). Estimating energy consumption and charging duration of electric vehicle in multigraph. (external link) 2022 Johannessen, Preben Bucher; Hemmati, Ahmad; Moshref-Javadi, Mohammad (2022). Solving a pickup and delivery routing problem for fourth-party logistics providers. (external link) 2021 Moshref-Javadi, Mohammad; Hemmati, Ahmad; Winkenbach, Matthias (2021). A comparative analysis of synchronized truck-and-drone delivery models. (external link) Bergmann, Morten; Hemmati, Ahmad; Fagerholt, Kjetil et al. (2021). A liner shipping feeder network with optional daughter routes. (external link) 2019 Moshref-Javadi, Mohammad; Hemmati, Ahmad; Winkenbach, Matthias (2019). A truck and drones model for last-mile delivery: A mathematical model and heuristic approach. (external link) 2018 Moshref-Javadi, Mohammad; Hemmati, Ahmad; Winkenbach, Matthias (2018). A Multi-modal Drone Delivery System for Urban Logistics. (external link) Fotedar, Sunney; Haugland, Dag; Hemmati, Ahmad (2018). A savings procedure based construction heuristic for the offshore wind cable layout optimization problem. (external link) Moshref-Javadi, Mohammad; Hemmati, Ahmad; Winkenbach, Matthias (2018). A Heuristic Method for a Customer-centric Drone Delivery System. (external link) Hemmati, Ahmad; Moshref-Javadi, Mohammad; Winkenbach, Matthias (2018). A multi-modal truck and drone delivery system. (external link) 2017 Hemmati, Ahmad; Hvattum, Lars Magnus (2017). Evaluating the importance of randomization in adaptive large neighborhood search. (external link) 2016 Hvattum, Lars Magnus; Hemmati, Ahmad (2016). Statistical analysis of randomization in adaptive large neighborhood search. (external link) Hemmati, Ahmad; Hvattum, Lars Magnus; Christiansen, Marielle et al. (2016). An iterative two-phase hybrid matheuristic for a multi-product short sea inventory-routing problem. (external link) 2015 Hemmati, Ahmad; Stålhane, Magnus; Hvattum, Lars Magnus et al. (2015). An effective heuristic for solving a combined cargo and inventory routing problem in tramp shipping. (external link) Hemmati, Ahmad (2015). Optimization models and methods for maritime cargo and inventory routing problems. (external link) 2014 Hemmati, Ahmad; Hvattum, Lars Magnus; Fagerholt, Kjetil et al. (2014). Benchmark Suite for Industrial and Tramp Ship Routing and Scheduling Problems. (external link) Hemmati, Ahmad; Hvattum, Lars Magnus; Christiansen, Marielle et al. (2014). A General Short Sea Inventory Routing Problem. (external link) Hemmati, Ahmad; Hvattum, Lars Magnus; Christiansen, Marielle et al. (2014). A General Short Sea Inventory-Routing Problem. (external link) 2013 Zarandi, Mohammad Hossein Fazel; Hemmati, Ahmad; Davari, Soheil et al. (2013). A simulated annealing algorithm for routing problems with fuzzy constrains. (external link) Hemmati, Ahmad; Hvattum, Lars Magnus; Andersson, Henrik (2013). A heuristic for a routing and scheduling problem of a tramp shipping company offering VMI services. (external link) 2012 Zarandi, Mohammad Hossein Fazel; Hemmati, Ahmad; Davari, Soheil et al. (2012). Capacitated location-routing problem with time windows under uncertainty. (external link) See a complete overview of publications in Cristin. Google Scholar",
  "content_length": 5026,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:17"
}