{
  "name": "Ahmad-Reza Sadeghi",
  "homepage": "https://www.trust.informatik.tu-darmstadt.de/people/ahmad-reza-sadeghi",
  "status": "success",
  "content": "Prof. Dr.-Ing. Ahmad-Reza Sadeghi – System Security Lab – TU Darmstadt back to list Prof. Dr.-Ing. Ahmad-Reza Sadeghi Contact ahmad.sadeghi@trust.tu-... work +49 6151 16-25328 Work S2|20 305 Pankratiusstraße 2 64289 Darmstadt Links All Publications Biography Ahmad-Reza Sadeghi is a Full Professor of Computer Science at the Technical University of Darmstadt, Germany, where he heads the System Security Lab. Since 2012 Prof. Sadeghi has established a long-term cooperation with Intel. It has already emerged in several Collaborative Research Centers on various topics, such as Secure Computing in Mobile and Embedded Systems, Autonomous and Resilient Systems, and Private AI. Moreover, he also established the Open Lab for Sustainable Security and Safety (OpenS3 Lab) with Huawei in 2019.He received his Ph.D. in Computer Science with a focus on Cryptography from the University of Saarland, Germany. Before academia, he worked for several years in the Research and Development of the Telecommunications industry, amongst others, Ericsson. He has been leading and involved in many national and international research and development projects in the design and implementation of Trustworthy Computing Platforms, Hardware-assisted Security, IoT Security and Privacy, Applied Cryptography, and Trustworthy AI.Prof. Sadeghi has been serving as General or Program Chair and Program Committee member of major Information Security and Privacy and Design and Automation venues, such as ACM CCS, IEEE Security & Privacy, NDSS, USENIX Security, DAC, DATE, and ICCAD. He was Editor-In-Chief of IEEE Security and Privacy Magazine. Ahmad served on several editorial boards, such as ACM Transactions on Information & System Security (TISSEC), as Guest editor of the IEEE TCAD, ACM Books, and ACM DIOT. He is on the editorial board of ACM TODAES and ACM DTRAP.In 2008 Prof. Sadeghi was awarded the renowned German prize “Karl Heinz Beckurts” for his research on Trusted and Trustworthy Computing technology and its transfer to industrial practice. The award honors excellent scientific achievements with a high impact on industrial innovations in Germany.In 2010 his group received the German IT Security Competition Award.In 2018 he received the ACM SIGSAC Outstanding Contributions Award for dedicated research, education, and management leadership in the security community and pioneering contributions in content protection, mobile security, and hardware-assisted security. SIGSAC is ACM’s Special Interest Group on Security, Audit, and Control.In 2021 he was honored with the Intel Academic Leadership Award at USENIX Security for his influential research in information and computer security, particularly hardware-assisted security.In 2022 he received the prestigious European Research Council (ERC) Advanced Grant. Go to top We would like to customise the information and usability of this website to your preferences and needs. To this end, we use so-called cookies. Please choose which cookies you would like to enable when visiting our webpages. Some of these cookies are required to load and correctly display this website on your device. These are strictly necessary or essential cookies and cannot be deselected. The preferences cookie saves your language setting, while the statistics cookie regulates how the open-source statistical software “Matomo” analyses your visits to and activities on our website. For more information about cookies we use, please refer to our privacy policy. Strictly necessary only Preferences Statistics Accept all Save & close Legal note",
  "content_length": 3568,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:12"
}