{
  "name": "Ahmed Hussain Qureshi",
  "homepage": "https://www.cs.purdue.edu/people/faculty/qureshi7.html",
  "status": "success",
  "content": "Ahmed Qureshi - Department of Computer Science - Purdue University Skip to content Home People Faculty Ahmed Qureshi Faculty & Lecturers Staff Offices Ahmed Qureshi Assistant Professor of Computer Science Our team is dedicated to advancing the field of robot planning and control through a combination of fundamental and applied research. Our primary objective is to develop robots that can operate effectively and safely in natural and dynamic human environments. To achieve this, we focus on a range of challenges, such as scalable and fast motion planning, active perception, human-in-the-loop robot manipulation, mobile navigation, and dynamic control. The ultiâ¦ âMore Joined department: Fall 2021 Research Areas Robotics and Computer Vision Artificial Intelligence, Machine Learning, and Natural Language Processing Education Ph.D., University of California San Diego, Intelligent Systems, Robotics and Control (2021) M.S., Osaka University, Robotics (2017) B.S., National University of Science and Technology, Electrical Engineering (2014) Our team is dedicated to advancing the field of robot planning and control through a combination of fundamental and applied research. Our primary objective is to develop robots that can operate effectively and safely in natural and dynamic human environments. To achieve this, we focus on a range of challenges, such as scalable and fast motion planning, active perception, human-in-the-loop robot manipulation, mobile navigation, and dynamic control. The ultimate goal of our research is to enhance peopleâs lives and optimize workforce efficiency in various economic and healthcare sectors. Selected Publications Ruiqi Ni and Ahmed H. Qureshi,Â NTFields: Neural Time Fields for Physics-Informed Robot Motion Planning, International Conference on Representation Learning (ICLR), 2023. [SPOTLIGHT] Ruiqi Ni and Ahmed H. Qureshi,Â Progressive Learning for Physics-informed Neural Motion Planning,Â Robotics: Science and Systems (RSS), 2023. Manav Kulshrestha and Ahmed H. Qureshi, Structural Concept Learning via Graph Attention for Multi-Level Rearrangement Planning, Conference on Robot Learning (CoRL), 2023. Vivek Gupta, Praphpreet Dhir, Jeegn Dani, and Ahmed H. Qureshi, MANER: Multi-Agent Neural Rearrangement Planning of Objects in Cluttered Environments,Â IEEE Robotics and Automation Letters, 2023. Zixing Wang and Ahmed H. Qureshi,Â DeRi-Bot: Learning to Collaboratively Manipulate Rigid Objects via Deformable Objects, IEEE Robotics and Automation Letters, 2023.Â Contact Info qureshi7@purdue.edu DSAI 3039 Websites My Homepage Google Scholar",
  "content_length": 2604,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:18"
}