{
  "name": "Ahmed El-Roby",
  "homepage": "https://people.scs.carleton.ca/~ahmedelroby",
  "status": "success",
  "content": "Ahmed El-Roby | Associate Professor | Carleton University Ahmed El-Roby Associate Professor, School of Computer Science at Carleton University About Me I joined Carleton University in July, 2018. Currently, I'm part of the Institute for Data Science and the School of Computer Science. I got my PhD from the David R. Cheriton School of Computer Science at the University of Waterloo. I used to be part of the Data Systems Group, and I worked with this awesome supervisor. I got my master's degree from King Abdullah University of Science and Technology, where I worked with Panos Kalnis, who quit updating his web page because it's too mainstream apparently. I got my bachelor's degree from Alexandria University in Egypt. Research Interests I'm interested in all kinds of knowledge graphs and graph analytics topics. Especially, question answering over knowledge graphs and knowledge graph mining. I'm also interested in the problem of domain adaptation in machine learning. Finally, I'm also interested in supporting real-time analytics in sports. Note to Prospective Students If you're interested in joining my group, please take a couple of minutes reading this note, and Andy Pavlo's blog on how to write a bad statement before sending me an email. You know, just to avoid the disappointment. Publications Conference Papers Yingjun Dai, Vivek Thaker, Elmira Adib, Ahmed El-Roby. OmniMatch: Overcoming the Cold-Start Problem in Cross-Domain Recommendations using Auxiliary Reviews. International Conference on Extending Databases (EDBT), 2025. Yingjun Dai, Ahmed El-Roby. DaCon: Multi-Domain Text Classification Using Domain Adversarial Contrastive Learning. International Conference on Artificial Neural Networks. 2023. Yuan Wu, Diana Inkpen, Ahmed El-Roby. Maximum Batch Frobenius Norm for Multi-Ddomain Text Classification. International Conference on Acoustics, Speech and Signal Processing (ICASSP), 2022. Yuan Wu, Diana Inkpen, Ahmed El-Roby. Co-Regularized Adversarial Learning for Multi-Domain Text Classification. International Conference on Artificial Intelligence and Statistics (AISTATS), 2022. Yuan Wu, Diana Inkpen, Ahmed El-Roby. Towards Category and Domain Alignment: Category-Invariant Feature Enhancement for Adversarial Domain Adaptation. Proceedings of the International Conference on Computer Vision (ICCV), 2021 Yuan Wu, Diana Inkpen, Ahmed El-Roby. Mixup Regularized Adversarial Networks for Multi-Domain Text Classification. International Conference on Acoustics, Speech and Signal Processing (ICASSP), 2021. Yuan Wu, Diana Inkpen, Ahmed El-Roby. Conditional Adversarial Networks for Multi-Domain Text Classification. Proceedings of the Second Workshop on Domain Adaptation for NLP, 2021. Yuan Wu, Diana Inkpen, Ahmed El-Roby. Dual Mixup Regularized Learning for Adversarial Domain Adaptation. European Conference on Computer Vision (ECCV), 2020. Ahmed El-Roby, Ashraf Aboulnaga. UFeed: Refining Web Data Integration Based on User Feedback. Proceedings of International Conference on Information and Knowledge Management (CIKM), 2017. Ahmed El-Roby. Utilizing User Feedback to Improve Data Integration Systems. International Conference on Data Engineering Workshops (ICDEW), 2016. Ahmed El-Roby, Ashraf Aboulnaga. ALEX: Automatic Link Exploration in Linked Data. Proceedings of ACM SIGMOD International Conference on Management of Data, 2015. Journal Papers Shawn Graham, Donna Yates, Ahmed El-Roby. Investigating antiquities trafficking with gene rative pre- trained transformer (GPT)-3 enabled knowledge graphs: A case study. Open Research Europe, 3, 2023. Anthony N Tasca, Samantha Carlucci, James C Wiley, Matthew Holden, Ahmed El-Roby, Giorgio A Tasca. Detecting defense mechanisms from Adult Attachment Interview (AAI) transcripts using machine learning. Psychotherapy Research. 33(6), 2023. Shawn Graham, Donna Yates, Ahmed El-Roby. Relationship Prediction in a Knowledge Graph Embedding Model of the Illicit Antiquities Trade. Advances in Archaeological Practice, 3(2), 2023. Abdelghny Orogat, Ahmed El-Roby. Maestro: Automatic Generation of Comprehensive Benchmarks for Question Answering Over Knowledge Graphs. Proceedings of the ACM on Management of Data, 1(2), 2023. Abdelghny Orogat, Isabelle Liu, Ahmed El-Roby. CBench: Towards Better Evaluation of Question Answering Over Knowledge Graphs. Proceedings of the VLDB Endowment (PVLDB), 14(8), 2021. Essam Mansour, Ahmed El-Roby, Panos Kalnis, Aron Ahmadia, Ashraf Aboulnaga. RACE: A Scalable and Elastic Parallel System for Discovering Repeats in Very Long Sequences. Proceedings of the VLDB Endowment (PVLDB), 6(10), 2013. Demonstrations Abdelghny Orogat, Ahmed El-Roby. Smartbench: Demonstrating automatic generation of comprehensive benchmarks for question answering over knowledge graphs. Proceedings of the VLDB Endowment (PVLDB), 15(12), 2022. Abdelghny Orogat, Ahmed El-Roby. CBench: Demonstrating Comprehensive Evaluation of Question Answering Systems over Knowledge Graphs Through Deep Analysis of Benchmarks. Proceedings of the VLDB Endowment (PVLDB), 14(12), 2021. Ahmed El-Roby, Khaled Ammar, Ashraf Aboulnaga, Jimmy Lin. Sapphire: Querying RDF Data Made Simple. Proceedings of the VLDB Endowment (PVLDB), 9(10), 2016. Ahmed El-Roby, Ashraf Aboulnaga. ALEX: Automatic Link Exploration in Linked Data. Proceedings of International Conference on Data Engineering (ICDE), 2016. Ahmed El-Roby, Mohamed Fahmy, May Moussa, Moustafa Youssef. Nuzzer-D: Demonstrating Device-free Passive Localization for Wireless Environments. International Conference on Mobile Computing and Networking (MobiCom), 2008. Technical Reports Ahmed El-Roby, Khalid Ammar, Ashraf Aboulnaga, Jimmy Lin. Sapphire: Querying RDF Data Made Simple. The Computing Research Repository abs/1805.11728. 2018. Teaching Fall 2025: COMP 5118 - Trends in Big Data Management Fall 2025: DATA 5000 Winter 2024: COMP 3005 - Database Management Systems Fall 2023: COMP 5118 - Trends in Big Data Management Winter 2023: DATA 5000 Winter 2023: COMP 5118 - Trends in Big Data Management Fall 2022: COMP 3005 Winter 2022: DATA 5000 Winter 2022: COMP 5118 - Trends in Big Data Management Fall 2021: COMP 3005 - Database Management Systems Fall 2020: COMP 5118 - Trends in Big Data Management Winter 2020: COMP 5118 - Trends in Big Data Management Winter 2020: COMP 3005 - Database Management Systems Fall 2019: COMP 3005 - Database Management Systems Winter 2019: COMP 5900 - Recent Trends in Big Data Management Students PhD Yingjun Dai Abdelrahman Hefny Master's Kyle Kuehni Alumni Abdelghny Orogat (PhD - 2025) Alex Gagnon (MCS - 2024) Anthony Tasca (MCS - 2024)Co-supervised with Prof. Matthew Holden Yuan Wu (PhD - 2022)Co-supervised with Prof. Diana Inkpen Ritika Bhatia (MCS - 2022) Xinyang Liu (MCS - 2022) Fathima Nizwana Yusuff (MCS - 2022) Srikanth Bandapally (MCS - 2021)Co-supervised with Prof. Hussein Mouftah Pooja Shah (MCS - 2021)Co-supervised with Prof. Hussein Mouftah Tanya Tanya (MCS - 2021)Co-supervised with Prof. Hussein Mouftah Tom Nguyen (MCS - 2020)Co-supervised with Prof. Hussein Mouftah Mariama Drame (MCS - 2020) Jeffery Zhang (MCS - 2020) Get In Touch Email: ahmed.elroby@carleton.ca Office: Herzberg Laboratories 5433 1125 Colonel By Dr Ottawa, Ontario K1S 5B6",
  "content_length": 7242,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:17"
}