{
  "name": "Ahmed Rafea",
  "homepage": "https://www.aucegypt.edu/fac/ahmedrafea",
  "status": "success",
  "content": "Ahmed Rafea | The American University in Cairo Skip to main content Ahmed Rafea Position: Professor and Graduate Program Director Department: Department of Computer Science and Engineering Email: rafea@aucegypt.edu Brief Biography Ahmed Rafea is a computer science professor at The American University in Cairo (AUC). Rafea served as the chair of the Department of Computer Science and vice dean at the Faculty of Computers and Information, Cairo University. He also served as a visiting professor in San Diego State University, and National University in the United States. Rafea has led many projects aiming at using artificial intelligence and expert systems technologies for the development of the agriculture sector in Egypt. The first project started in 1989 and funded by United Nations Development Programme (UNDP). The project's main objective was to use expert system technology to transfer agricultural research results to the field through extension services in the Egyptian Ministry of Agriculture. One of the outputs of this project was the first real expert system in agriculture that has been deployed and used in the field, not only in Egypt but also in other developing countries. He was also the lead national consultant of Food and Agriculture Organization (FAO) in two projects funded by FAO and the Italian Debt Swap Fund to strengthen the linkage between research and extension and to build a rural and agricultural development communication network using information and communication technology. Rafea was the principal investigator of several projects for developing intelligent systems and machine translation in collaboration with European and American Universities. He is currently a member of the Center of Excellence on Data Mining and Computer Modeling, sponsored by the Ministry of Communication and Information Technology. Rafea holds a BSc in electronics and communication engineering from the Faculty of Engineering and a graduate diploma in computer science from the Institute of Statistical Studies and Research, Cairo University. He received another graduate diploma and PhD degree in computer science from Paul Sabatier University, Toulouse, France in 1980. Research Interest Data, Text and We MiningNatural Language Processing and Machine TranslationKnowledge Engineering and Knowledge Based System Development Publications Rafea was invited to author chapters in different books on the expert system in agriculture, environment conservation, and using information and communication technology for agriculture research, technology transfer, and development. He has authored over 150 scientific papers in international and national journals, conference proceedings and book chapters. His recent refereed journal publications are in the areas of information extraction, ontology learning, generating explanations in expert systems, and Arabic language generation in a machine translation system.",
  "content_length": 2934,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:23"
}