{
  "name": "Ahmed M. Abdelmoniem",
  "homepage": "https://eecs.qmul.ac.uk/~ahmed",
  "status": "success",
  "content": "Ahmed M. A. Sayed Menu Home Bio Research Publication Teaching Projects Talks Activities ReadFirst Useful Courses ECS640U/765P ECS637U/757P Ahmed M. A. Sayed Senior Lecturer (Associate Professor) & Director of MSc BDS Programme Lead of SAYED Systems Group Member of Networks Group and DT4SGD Lab & DERI Institute School of Electronic Engineering and Computer Science, Queen Mary University of London, UK Address: Office E153a, Engineering Building Queen Mary University of London, Mile End, London, UK Email: ahmed.sayed@qmul.ac.uk Links: CV   GoogleScholar   OrcID   LinkedIn   Github   Proposal Guide   Proposal Template About me I am Ahmed M. A. Sayed, a Senior Lecturer (Associate Professor) and the Director of the MSC Big Data Science Programme at School of EECS, Queen Mary University of London, UK. I lead SAYED Systems Group where we strive to design and build Scalable Adaptive Yet Efficient Distributed systems of the Future. I am the Principal Investigator of a grant funded by UKRI-EPSRC New Investigator Award for Project KUber in partnership with major industrial players (i.e., Nokia Bell Labs, Samsung AI, IBM Research). I have a PhD in Computer Science and Engineering from the Hong Kong University of Science and Technology (HKUST) advised by Brahim Bensaou. I held the positions of Senior Researcher at Future Networks Lab, Huawei Research, Hong Kong and Research Scientist at SANDS Lab, KAUST, Saudi Arabia working with Marco Canini. My early research involved optimizing networked systems to improve the performance of applications in both wireless and data-center networks and proposing efficient and practical systems for distributed machine learning. My current research focus involves designing and prototyping Networked and Distributed Systems of the Future. In particular, I am interested in developing methods and techniques to enhance the performance of networked and distributed systems. I am currently focusing on developing scalable and efficient systems supporting distributed machine Learning (esp., distributed privacy-preserving ML aka. Federated Learning). I also organise and teach ECS640U/765P Big Data Processing (UG/PG module) and teach ECS637U/757P Digital Media and Social Networks (UG/PG module). Prospective Students and PostDocs I’m always looking for bright and enthusiastic people to join my research group If you are looking to do a PhD with me, thank you for your interest, but please READ THIS FIRST and then reach out to me via Email along with your CV, transcripts, and research statement/proposal. For PostDocs , a list of all fellowships in the UK can be found HERE. Also, please observe the deadlines for MSCA Fellowship, EPSRC Future Leaders Fellowship, Royal Commission Fellowship, Leverhulme Early Career Fellows, Royal Academy of Engineering Research Fellowships, British Academy Postdoctoral Fellowship, Royal Society University Research Fellow, Royal Society Newton International Fellow, and Schlumberger Fellowship Vacancies and Opportunities RA or PDRA Opening - we seek exceptional candidates, with MSc or PhD (or nearing completion of PhD) on topics related to Simulation and Modeling of Resource Allocation in federated Cluster/HPC environments, to work part-time on UKRI NCSF NetworkPlus Project]. For details on the opening, please check HERE and reach out to me or Kostas E. Zachariadis for any inquiries or informal discussion. One fully-funded PhD project to study Resource-Efficient Distributed LLM Inference in Networked-AI Systems for Chinese Applicants applying to China Scholarship Council (CSC) Studentship, if interested please reach out to me and see EECS CSC Studentships for more details - Deadline 28-Jan-2026. Applications are open to S&E Underrepresented Group PhD studentship for Home UK applicants, if interested please reach out to me before the Deadline 28-Jan-2026. We also welcome Visiting-PhD applications as Research Associates. If you are enrolled in a PhD-Program overseas and have funding for visiting our research group for up to 12 months (e.g., funding via China Scholarship Council (CSC)] funding or any other funding source), please reach out to me to discuss your visiting application. If you are self-funded student, I am happy to consider your application. Otherwise, there are various scholarships available, check out the eligible scholarships for you by searching QMUL scholarship database and then get in touch with me. Grants and Funding 2025-2026 (Huawei UK Research), PI, Server Energy-Efficiency Testing and Benchmarking Project, 31K GBP. Check out our [Technical Report] 2025-2026 (UKRI NCFS NetworkPlus), Co-I, FAIR-Compute: A Roadmap for Fair and Efficient Allocation of Federated Digital Research Infrastructure, with Prof. Kostas E. Zachariadis, 120K GBP. 2024-2027 UKRI-EPSRC New Investigator Award (NIA), PI, Knowledge Delivery System for Machine Learning at Scale (KUber), 650K GBP. 2022-Now HKRGC (GRF), CoI, ML Congestion Control in SDN-based Data Center Networks, with Brahim Bensaou (HKUST), 600K HKD. 2021-Now KAUST (CRG), CoI, Machine Learning Architecture for Information Transfer, with Marco Canini (KAUST) and Marco Chiesa (KTH), 400K USD. 2022-2023 EPSRC (REPHRAIN Center), CoI, Moderation in Decentralised Social Networks (DSNmod), with Ignacio Castro and Gareth Tyson (QMUL), 81K GBP. Supervision (BSc,MSc,PhD,Postdoc) Postdocs: Songyuan Li (PhD of Comp Sci, Uni of Exeter, 2025-now), Qilei Li (PhD of Comp Sci, QMUL, 2024-2025) PhD Students: Bradely Aldous (MSc of AI, QMUL - start Sept 2023), Herman Tam (MSc of Comp Sci, CityU HK - start Sept 2024), Leon Tabaro (MSc of AI, Loughborough University - start Apr 2025), Xiaolong Jia (MSc of Control Sci & Eng, Chongqing University - start Sept 2025) Yemisi Oyelek (MSc of Comp Sci, U of Leicester UK - started 2021 with Retired Dr. John Schormans) PhD Students (Co-Supervisor): Waheed Hamed (HKUST, HK - start 2023), Titus Tunduny (Strathmore Uni, Kenya - start 2021), Geofrey Owino (Strathmore Uni, Kenya - start 2023) PhD Students (Visiting): Qianqian Zhang (University of Chinese Academy of Sciences (UCAS), China) MSc Students: 2024-2025 (Yahya Taher, Sachin Bhatiya, Sahil Mukadam, Anh Van Huynh); 2023-2024 (Addalin Rosa, Diba Kazemi, Mujtaba Malik, Rikuto Matsukura); 2022-2023 (Ho Kuen Lai, Mihir Singh, Shai Lynch, Vishal Khushlani) BSc Students: 2022-2023 (Atif Abdur-Rahman, Qasim Butt, Samira Rahman, Shorya Sinha) TPC/Reviewing, Editorial, and Organisation TPC: ICML, ICLR, USENIX ATC, ACM CoNEXT, WWW, ICNP, DistributedML, EuroMLSys, FedEdge - IEEE ICDCS, HPSR, VTC, PST Long-term Reviewer: IEEE ToN, TCC, TNSM, TNNLS, TMC, IoTJ, JSAC - ACM TOMPECS - Elsevier ComNets, ComCom, FGCS, JPDC, etc Co-organised 21st ACMSIGCOMM International Conference on emerging Networking EXperiments, [https:conferences.sigcomm.orgco-next2025 Co-organised 1st International Workshop on Federated Edge AI (FedEdgeAI), IEEE ICDCS 2025. Co-organised 3rd International Workshop on NETWORKED AI SYSTEMS (NetAISys), ACM MobiSys 2024. Co-edited for Frontiers in HPC on the research topic of HPC for AI in Big Model Era. Co-organising 5th International Workshop on Embedded and Mobile Deep learning (EMDL), ACM MobiSys 2021 - Deadline 07-May-2021. Open Access Publishing JISC OA agreements helps with publishing free open-access in wide range of publishers, see List of 58 Publishers. Please reach out to me for more details. Springer-Egypt OA agreement to help with publishing free open-access in all Open-Access and Hybrid journals in Springer and SpringerNature. Please reach out to me for more details. News Please check the publications webpage for full list of the publications along with its PDF. [22-May-2025] A joint paper with Prof. Chen Wang from Huazhong University of Science and Technology (HUST) titled “Prototype Surgery: Tailoring Neural Prototypes via Soft Labels for Efficient Machine Unlearning”, is accepted in International ACM SIGSAC Conference on Computer and Communication Security (CCS), 2025. [15-May-2025] A joint paper with Prof. Chen Wang from Huazhong University of Science and Technology (HUST) titled “From Expansion to Retraction: Long-tailed Machine Unlearning via Boundary Manipulation”, is accepted in International ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD), 2025. [1-Apr-2024] A paper titled “Hierarchical Knowledge Structuring for Effective Federated Learning in Heterogeneous Environments\", is accepted in IEEE International Joint Conference on Neural Networks (IEEE IJCNN), 2025. [1-Apr-2024] A paper titled “Split Fine-Tuning of BERT-based Audio Models in The Edge-Cloud Continuum: An Empirical Analysis\", is accepted in IEEE International Joint Conference on Neural Networks (IEEE IJCNN), 2025. [25-Jan-2025] A joint paper with Dr. Ali Anwar from University of Minnesota and Prof. Ali Butt from University of Virgina Tech titled “FLStore: Efficient Federated Learning Storage for non-training workloads”, is accepted in International Conference on Machine Learning Systems (MLSys), 2025. [14-Jan-2025] A joint paper with Prof. Marco Canini, from KAUST titled “Query-Based Knowledge Transfer for Heterogenous Learning Environments”, is accepted in International Conference on Learning Representation (ICLR), 2025. [1-Jun-2024] Invited as a Plenary Panel Member to the 24th IEEE International Conference on Software Quality, Reliability, and Security (IEEE QRS), Cambridge 1-5 Jul, 2024. [Conference Page] [Slides] [20-May-2024] A joint paper with Prof. Mingliang Gao, from Shandong University of Technology titled “Cross-Modality Interaction Network for Medical Image Fusion”, is accepted in IEEE Transactions on Consumer Electronics, 2024. [15-May-2024] A joint paper with Prof. Linlin You, from Sun Yat-Sen University, titled “Exploring Representational Similarity Analysis to Protect Federated Learning from Data Poisoning.”, is accepted the ACM Conference on Web Conference (ACM WWW), 2024. [1-May-2024] A joint paper with Prof. Yuchao Zhang, from Beijing Uni",
  "content_length": 12952,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:20"
}