{
  "name": "Ahmed Eldawy",
  "homepage": "https://www.cs.ucr.edu/~eldawy",
  "status": "success",
  "content": "Ahmed Eldawy Ahmed Eldawy is an Associate Professor in Computer Science at the University of California Riverside. His research interests lie in the broad area of databases with a focus on big data management and spatial data processing. Ahmed led the research and development in many open source projects for big spatial data exploration and visualization including UCR-Star, an interactive repository for geospatial data with nearly four terabytes of publicly available data. He is a recipient of the highly prestigious NSF CAREER award, the 10-year Influential Paper Award in ICDE 2025, and the Best Demo award in SIGSPATIAL 2020. His work is supported by the National Science Foundation (NSF) and the US Department of Agriculture (USDA). Member of the RAISE@UCR Center Member of the Data Science Center Member of the Center for Robotics and Intelligent Systems (CRIS) Affiliate member of the Center for Geospatial Sciences Affiliate member of the Winston Chung Global Energy Center Updates News 08-05-2025Two research papers accepted at SIGSPATIAL 2025 about SynopsisLake and spatial graph visualization 08-01-2025A demo about FutureFarmNow is accepted at SIGSPATIAL 2025 07-30-2025A two-hour tutorial accepted at SIGSPATIAL 2025 about Scalable raster processing 05-27-2025A demo accepted at VLDB 2025 about LLM-assisted visualization 05-19-2025Awarded 10-year Influential Paper Award in ICDE 2025 11-15-2024A full paper accepted at PVLDB 2025 about scalable raster processing 08-30-2024Presented a 90-minute tutorial on Spatial Query Optimization With Learning in VLDB 2024 in Guangzhuo, China 09-04-2024Spoke at a panel about Data & Infrastructure for Digital Twins at the Trillion Pixel AI Challenge by ORNL Grants NSF - IIS-2046236 - CAREER: Towards Exploratory Data Science on Spatio-temporal Big Data Total amount: $543,135 From 10/01/2021 to 09/30/2026 USDA NIFA - 2020-69012-31914 - Artificial Intelligence for Sustainable Water, Nutrient, Salinity, and Pest Management in the Western U.S. Total amount: $10,000,000 (PI share: $636,393) From 9/01/2020 - 8/31/2025 Key Personnel PI: Elia Scudiero - Environmental Sciences UCR - USDA Salinity Lab Ahmed Eldawy - UCR Vagelis Papalexakis - Computer Science and Engineering - UCR Milt McGiffen - Department of Botany and Plant Sciences - UCR Kurt Schwabe - School of Public Policy - UCR Hoori Ajami - Department of Environmental Sciences - UCR Khaled Bali - Kearney Agricultural Research & Extension Center - UC ANR Michael D. Cahn - Irrigation and Water Resources, University of California Cooperative Extension Alexander I Putman - Microbilogy & Plant Path - UCR Ray Anderson - USDA Salinity Lab Todd Skaggs - USDA Salinity Lab Andrew French - US Arid-Land Agricultural Research Center at Arizona Karletta Chief - Department of Soil, Water and Environmental Science, University of Arizona Charles A Sanchez - Department of Soil, Water and Environmental Science, University of Arizona Nathaniel Chaney - Civil and Environmental Engineering Department, Duke University Raj Khosla - Department of Soil & Crop Sciences, Colorado State University George Vellidis - Crop & Soil Sciences - University of Georgia Monique Joy Rivera - Department of Entomology - CMU University of California Office of the President - M21PL3368 - California Informatics for Equitable Disaster Response and Recovery Total amount: $262,428 (PI Share: $62,300) From 01/01/2021 to 12/31/2022 Key Personnel PI: Henry Burton - Civil and Environmental Engineering - UCLA Co-PI: Ahmed Eldawy - UCR Co-PI: Shawn Newsam - Electrical Engineering and Computer Science, UC Merced Co-PI: Maura Allaire - Urban Planning and Public Policy, UCI NSF - IIS-1954644 - III: Medium: Collaborative Research: Supporting High-Value Analytics on Big Low-Value Data Total amount: $1,200,000 (PI share: $304,766) From 10/01/2020 - 9/30/2023 Key Personnel PI: Michael J. Carey - UCI PI: Ahmed Eldawy - UCR Co-PI: Vassilis Tsotras - UCR NSF - CNS-1924694 - CCRI: ENS: Collaborative Research: Supporting and Sustaining Apache AsterixDB for the CISE Research Community Total amount: $2,000,000 (PI share: $302,950) From 9/01/2019 - 8/31/2022 Key Personnel PI: Vassilis Tsotras - UCR Co-PI: Ahmed Eldawy - UCR PI: Michael J. Carey - UCI Co-PI: Chen Li - UCI NSF - IIS-1838222 - BIGDATA: F: Collaborative Research: Optimizing LSM-Based Big Data Management Systems Total amount: $2,000,000 (PI share: $426,614) From 1/01/2019 - 12/31/2022 Key Personnel PI: Vagelis Hristidis - UCR Co-PI: Ahmed Eldawy - UCR Co-PI: Vassilis Tsotras - UCR PI: Michael J. Carey - UCI Co-PI: Chen Li - UCI USDA AFRI-AST - 2019-67022-29696 - Agricultural Salinity Management Via An Integration Of Proximal And Remote Sensing With Big Geodata Modeling Total amount: $487,943 (PI share: $128,572) From 7/01/2019 - 6/30/2022 Key Personnel PI: Elia Scudiero - USDA Salinity Lab Co-PI: Ahmed Eldawy - UCR Co-PI: Todd Skaggs - USDA Salinity Lab Projects Beast Beast is a system for Big Exploratory Analytics on Spatio-temporal data. It adds many Spark-based functions for loading, indexing, analyzing, visualizing, and summarizing big spatio-temporal data. UCR-Star is one example of a system that is built using Beast. Relevant Publications UCR-Star UCR STAR the spatio-temporal active repository that hosts terabytes of public geospatial data in an interactive repository. The main goal is to allow the researchers worldwide to unleash the true value of the datasets that are available all over the web. We encourage the community to submit their requests to add new datasets to UCR-Star and we will be process them. Relevant Publications Raptor Raptor is the Raster+Vector query processing engine built in Spark. Raptor is designed to efficiently combine raster data, e.g., satellite images, with vector data, e.g., roads and boundaries, in one efficient query processing core. Raptor has already been applied in many scientific applications including crop yield estimation and combating wild fires. Relevant Publications Spider (spider.cs.ucr.edu) Spider is a web-based spatial data generator that aims at making synthetic datasets easier to generate, visualize, and share. With Spider, you can generate billions of records of synthetic data and share them with your project members with a simple web link. Relevant Publications Teaching I am an accredited Scientific Teaching Fellow by Yale Center for Teaching and Learning sponsored by the National Science Foundation. CS 167 - Introduction to Big-data [Sptring 2020, Spring 2021]: CS 167 introduces students to the big-data ecosystem including storage, processing, and analysis. CS 226 - Big-data Management [Winter 2018, Fall 2018, Fall 2019, Fall 2020]: CS 226 covers the data management in big data platforms such as Hadoop, Spark, and AsterixDB. CS 133 - Computational Geometry [Spring 2018, Spring 2019]: CS 133 covers the fundamentals of computational geometry. CS 010c (Formerly CS014) - Introduction to Data Structures and Algorithms [Fall 2017]: CS 014 introduces the students to the fundamental data structures and algorithmic analysis techniques such as lists, stacks, queues, search trees, sorting algorithms, hash tables, and graphs. CS 267 - New Trends in Database Research [Fall 2016]: The goal of this course is to introduce the students to the latest research trends in database systems. The course is based on the recent research literature in major database conferences and journals. By the end of this course, students should be aware of the active research topics in database systems and possibly identify new research topics of their own. Students will also get a hands-on experience by working on a research problem of their choice individually or in groups. CS 141 - Intermediate Data Structures and Algorithms [Winter 2017, Winter 2019,Summer 2019,Winter 2020,Winter 2021]: CS 141 provides the basic background for a computer scientist in the area of data structures and algorithms. During this course, students will learn problem solving skills, how to compare them, and how to apply them in real problems. Students PhD Stduents Zhuocheng Shang Bo Huang Tarlan Bahadori Shahd Elmahallawy Xin Zhang, started a job at Amazon Redshift Majid Saeedan, started a job at Amazon Redshift Saheli Ghosh. Started a job at PayPal Tin Vu. Started a job at Microsoft, Redmond Samriddhi Singla. Started a job at Meta Akil Sevim. Started a job at Teradata Master Students Suryaa Charan Shivakumar Bhavya Sanjay Gada Naren Kulkarni Atishay Jain Tomal Majumder Nadia Saba, Winter 2023 Mohit Porwal, Winter 2023 Ruturaj Patil, Winter 2023 Nishith Patel, Winter 2023 Akhilesh Reddy Gali, Winter 2023 Avinash Bhim Sidhwani, Spring 2023 Ponmanikandan Velmurugan, Fall 2022 Bharath Mysore Nagendra Ankitha Sathyanarayana, Fall 2022 Abraham Palaniswamy Miller, Fall 2022 Ganesh Krishnan Sivaram, Winter 2021 Bhavana Vangala, Winter 2020 Zoama Hassan, Winter 2020 Mehrad Amin Eskandari, Spring 2020 Jonathan Peng, Spring 2020 Lek Tin Jiaqing Chen, Spring 2020 Husna Sayedi, Winter 2019 Shipra Jais, Winter 2018 Akarsha Byadarahalli-Mahadeva, Fall 2017 Lyuye Niu, Winter 2017 Undergraduate Students Adreyan Distor, UCR Mohammad Abdussalam, Alexandria University, Egypt Julia Bayless, UCR Nicholas Santini, UCR William Bryant, UCR Rayyaan Mustafa, UCR Andre Tran, UCR Vinayak Gajjewar, UCR Nikhil Kadekar, UCR Puloma Katiyar, UCR Hsiang-Yin Hsieh, UCR Yaming Zhang, UCR Steven Li, UCR Qiwen (Nelly) Lyu, UCR Zhiba (Ryan) Su, UCR Riyafa Abdul Hamid, University of Moratuwa, Sri Lanka Publications . , In , , , In , (), pages , . (Full text) DOI> © Ahmed Eldawy. All rights reserved. Design: HTML5 UP",
  "content_length": 9623,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:17"
}