{
  "name": "Ahmed Saeed 0001",
  "homepage": "https://www.cc.gatech.edu/~amsmti3",
  "status": "success",
  "content": "Ahmed Saeed - Homepage Ahmed Saeed Assistant Professor and BBISS Fellow [NRG] [SCS] [CoC] Georgia Institute of Technology asaeed [@] cc [.] gatech [.] edu News (scroll for more) Selected as a BBISS Faculty FellowNovember, 2025 Participated in DeKalb County's Data Center Town Hall. October, 2025 It was my pleasure to be part of a panel of experts aiming to educate the community on datacenters, including what they are, why their deployments are on the rise, and how they impact communities in which they are deployed. The town hall had hundreds of attendees from the community. Paper accepted at IMC 2025. August, 2025 Vaibhav's work, supported by Sammy, Robin, Muskaan, Miguel, and Katya, explores the viability of satellite networks as failover in scenarios of national emergency. It characterizes the different factors that determine the available capacity and produce policy recommendations to maximize it. Moreover, we will release a simulator and an interactive web app to enable others to perform similar studies. Paper accepted at MASCOTS 2025. August, 2025 Work by Jehad, Pratyush, and Eric analyzes the work case performance of systems where overload controller and core schedulers are deployed simultaneously. The analysis supports the need for coordination mechanisms like those developed by Bhaskar and Eric and has been recently accepted at ICNP. Paper accepted at ICNP 2025. July, 2025 Bhaskar and Eric’s work shows that fast CPU core allocators and overload controllers can interfere with each other, harming latency and lowering throughput of large-scale servers. They propose Partial Proportionality, a technique for ensuring that admission control and resource allocation are coordinated without imposing harmfully constraining limits on either. Paper accepted at ANRW 2025. May, 2025 Saubhik’s and Demi’s work identifies the bottlenecks in the multiple implementations of QUIC. They use their observations to propose an implementation-agnostic architecture for high-throughput QUIC. Paper accepted at TPRC 53. May, 2025 Vaibhav's work, supported by Sammy, Robin, Muskaan, Miguel, and Katya, provides policy recommendations for governments and network operators to maximize the utility of satellite networks in scenarios of national emergency. Gave a talk at Alexandria University December, 2024 Gave a talk at the Applied Innovation Center in Alexandria, Egypt December, 2024 Gave a talk at the American University in Cairo November, 2024 Paper accepted at HotNets 2024. September, 2024 Rahul’s work aims at reducing errors in developing new network architectures by developing a CAD tool for network architects. The tool leverages formal logic and LLMs to check the compatibility between network components and ensure that they meet the network's objectives. Paper accepted at LEO-NET 2024. September, 2024 Demi’s work aims at reducing the environmental impact of launching satellites in space as well as lowering the barrier to deploying new satellite-based applications through sharing satellites between multiple tenants, offering a Constellation-as-a-Service. Work has been accepted at LEO-NET 2024. Recevied an NSF award to understand the behavior of Low Earth Orbit (LEO) satellite networks. May, 2024 I am the PI on a $600k award from the NSF to develop a better understanding of performance variability in LEO satellite networks as well as developing mechanisms and policies to better handle that variability. Paper accepted at NSDI 2024 December, 2023 Inho's work on building a high-resolution latency debugger that can detect microsecond-level latency events was accepted to NSDI 2024. Demi will receive the PURA Salary Award in Spring 2024 December, 2023 Eric won 1st place at SIGCOMM 2023 SRC September, 2023 Eric presented his poster at SIGCOMM 2023, winning the 1st of the Student Research Competition (SRC) in the undergraduate category. Received funding from Spec Tech to explore routing problems for nanomodular electronics. September, 2023 I am the PI on a $40k award from Spec Tech to improve the scalability of routing and placement algorithms for synthesizing circuits using nanomodular electronics. Paper accepted at LEO-NET 2023 August, 2023 Vaibhav's work on estimating round trip times in LEO satellite networks was accepted at the workshop on LEO networking and communication that's held in conjunction with MobiCom 2023. Poster accepted at SIGCOMM 2023 July, 2023 Eric's work on the interaction between overload controllers and core allocators accepted as a poster at SIGCOMM 2023. Invited to IETF 116 March, 2023 Work on understanding variability in LEO satellite networks invited to IETF 116 by MAPRG. Paper accepted to PAM'23 December, 2022 The paper offers a thorough characterization of latency variability in LEO satellite networks, exploring its fundamental causes and structure and possible remedies. Selected among the top five DARPA Risers during the DARPA Forward Conference at Georgia Tech. October, 2022 Our poster on improving the performance and resilience of satellite networks was selected among the top five posters presented by DARPA Risers. DARPA Risers are up-and-coming standouts in their fields, whose research is related to national security and demonstrates the potential to lead to technological surprise — the heart of DARPA's mission. Recevied an NSF award to reimagine the network stack of edge servers. August, 2022 I am the PI on a $1.19M award from NSF to improve the scalability of edge servers from the hardware to the applications looking at problems in overload control, network stack architecture, and hardware offloads. Recevied an NSF award to formally verify the performance of resource allocation heuristics. July, 2022 I am the co-PI on a $1.19M award from NSF to develop new models and algorithms to efficiently apply formal methods to analytically identify bounds the performance of resource allocation heuristics used to manage network and CPU resources. Paper accepted to NSDI '23 July, 2022 Protego is an overload control system that allows applications to maintain their SLOs even in the presence of data-dependent lock contention. Received research award from Google July, 2022 I received $80,000 from Google to support my work on scalable systems at the edge. I am serving on the PC of HotNets 2022 June, 2022 I am serving on the PC of NSDI 2023 April, 2022 I am serving on the PC of ANRW 2022 April, 2022 I am serving on the PC of APNET 2022 March, 2022 I am serving on the PC of SIGCOMM 2022 January, 2022 I am serving on the PC of ANCS 2021 Sep., 2021 Started as an Assistant Professor at Georgia Tech! August, 2021 Paper accepted to SIGCOMM May, 2021 CCAC is a new approach to understanding the performance of congestion control algorithms through formal methods. Paper accepted to MobiSys March, 2021 Mobius allows operators of large fleets of vehicles to navigate the tradeoffs between task fulfillment throughput and fairness to their customers. Paper presented at PAM March, 2021 Paper accepted to PAM '21 December, 2020 In this paper, we provide a thorough analysis of the bottlenecks that arise in the Linux kernel running on a server as we increase the number of TCP connections handled by the server. Paper accepted to OSDI '20 August, 2020 Breakwater is an overload control system that allows microsecond-scale RPCs to maintain their Service Level Objectives (SLOs) even when their demand is much larger than available capacity. Paper accepted to SIGCOMM '20 August, 2020 We identify a new problem in WAN congestion control when WAN traffic competes for bandwidth with datacenter traffic inside the datacenter network. Annulus solves the problem by allowing WAN traffic to react to congestion as fast as datacenter traffic using explicit and direct congestion notification messages. Bio Ahmed Saeed is an Assistant Professor in the School of Computer Science at Georgia Tech. He was a Postdoctoral Associate at MIT working with Prof. Mohammad Alizadeh. He completed his PhD in August 2019 at Georgia Tech, where he was advised by Prof. Mostafa Ammar and Prof. Ellen Zegura. During his PhD, he interned several times at Google, where he collaborated with Nandita Dukkipati and Amin Vahdat. He received his bachelor's degree in Computer and Systems Engineering from Alexandria University in 2010. Research Interests Theory, design, and implementation of scalable computer networks and computer systems, including resource scheduling, congestion control, operating systems, and formal methods. I am looking for highly motivated PhD, master's, and undergraduate students. Selected Publications (full list) Assessing LEO Satellite Networks for National Emergency Failover Vaibhav Bhosale, Ying Zhang, Sameer Kapoor, Robin Kim, Miguel Schlicht, Muskaan Gupta, Ekaterina Tumanova, Zachary S. Bischof, Fabi'an E. Bustamante, Alberto Dainotti, Ahmed Saeed ACM IMC 2025 [PDF] [Code] [Web App] CoreSync: A Protocol for Joint Core Scheduling and Overload Control of μs-Scale Tasks Bhaskar Pardeshi, Eric Stuhr, Ahmed Saeed IEEE ICNP 2025 [PDF] [Code] LDB: An Efficient Latency Debugging Tool for Datacenter Applications Inho Cho, Seo Jin Park, Ahmed Saeed, Mohammad Alizadeh, Adam Belay USENIX NSDI 2024 [PDF] [Code] Protego: Overload Control for Applications with Unpredictable Lock Contention Inho Cho, Ahmed Saeed, Seo Jin Park, Mohammad Alizadeh, Adam Belay USENIX NSDI 2023 [PDF] [Code] [Video] A Characterization of Route Variability in LEO Satellite Networks Vaibhav Bhosale, Ahmed Saeed, Ketan Bhardwaj, Ada Gavrilovska PAM 2023 [PDF] [Video] Formally Verifying Congestion Control Performance Venkat Arun, Mina Tahmasbi Arashloo, Ahmed Saeed, Mohammad Alizadeh, Hari Balakrishnan ACM SIGCOMM 2021 [PDF] [Code] [Video] Annulus: A Dual Congestion Control Loop for Datacenter and WAN Traffic Aggregates Ahmed Saeed, Varun Gupta, Prateesh Goyal, Milad Sharif, Rong Pan, Mostafa Ammar, Ellen Zegura, Keon Jang, Mohammad Alizadeh, Abdul Kabbani, and Amin Vahdat ACM SIGCOMM 2020 [PDF] [Slides] [Vi",
  "content_length": 12283,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:22"
}