{
  "name": "Ahmed Sabbir Arif",
  "homepage": "http://www.asarif.com",
  "status": "success",
  "content": "ï»¿ Ahmed Sabbir Arif 5200 N. Lake Road, Merced, CA 95343 SE2 212 SE2 230T-R • COB 268 209-228-3639 A- A A+ I am an Associate Professor of Computer Science & Engineering at the University of California, Merced, where I direct the Inclusive Interaction Lab. My research program is interdisciplinary, spanning multiple areas, including computer science, cognitive science, human factors, virtual reality, accessibility, and applied artificial intelligence. My mission is to make computer systems more accessible by developing intuitive, effective, and enjoyable input and interaction techniques. I am the recipient of a Hellman Fellowship (2020) and an NSF CAREER (2023) award, as well as many best paper and honorable mention awards at premier venues in Human-Computer Interaction (HCI). Before joining UC Merced, I was a Postdoctoral Research Fellow at Toronto Metropolitan University (FKA Ryerson University) and an NSERC ENGAGE Postdoctoral Research Fellow at York University. I was also a Research Intern at Microsoft Research, Redmond. I received my PhD in Computer Science & Engineering from York University and MSc in Computer & Mathematical Sciences from Lakehead University. I hold a BSc from Trent University in Computer Science & Studies. Join the Inclusive Interaction Lab Must Read I am always looking for hard-working, self-motivated, and scientifically curious students to join my research group. Check out my publications, particularly the demo videos, to get a sense of the areas I primarily focus on. Since my interests shift often, your interests do not necessarily have to fully align with mine. Graduate Students Read the Information for Prospective Graduate Students. If you meet the criteria, submit a Graduate Admission Pre-Application by January of the respective academic year. A Google account is required for verification to access the form. Applications submitted after this deadline are unlikely to be considered. Priority will be given to those who applied via UC Merced Admissions before submitting this form. PhD positions are fully funded. Prospective master's students can apply directly through the UC Merced Admissions system and mention me as one of their preferred advisors. Master's positions are usually self-funded. Undergraduate Students Undergraduate students are encouraged to apply for on-campus volunteering opportunities. These positions are unpaid, but can award up to four units through CSE 195/199. Complete the Undergraduate Internship Application at least three weeks before the intended start date. These positions are reserved only for UC Merced students. High School Students High school students from the Central Valley and the Bay Area are encouraged to apply for 12-week virtual or in-person summer internship positions, which require a commitment of 20 hours per week. Interested students must complete the High School Summer Internship Application and submit it by the second week of April, with early May submissions preferred. These positions are unpaid. All participants who successfully complete the internship will receive a certificate of completion. About UC Merced The University of California, Merced, has rapidly become a key institution within the UC system since its establishment in 2005. It holds the prestigious R1 Carnegie Research Classification and ranks #58 in National Universities (2025). UC Merced fosters academic excellence through its three schools: Engineering, Natural Sciences, and Social Sciences, Humanities, and Arts, with plans to expand offerings through the Ernest & Julio Gallo Management Program. With over 9,100 students, the university thrives on a dynamic campus culture, where students engage in clubs, organizations, and cutting-edge research. Research is central to UC Merced's mission, with faculty and students advancing work in diabetes, cancer, antibiotic resistance, solar energy, computing, and climate change. Special research institutes, including the Health Sciences Research Institute and the Sierra Nevada Research Institute, support these efforts. Collaborations with institutions such as Lawrence Livermore National Laboratory and the National Park Service further enhance research capabilities. A leader in sustainability, UC Merced boasts environmentally certified buildings, many achieving LEED Platinum status. Green initiatives include a recyclable takeout dining system, a 1-megawatt solar array, and campus water stations, earning national recognition for sustainability. Beyond academics and research, the university drives regional economic growth by creating jobs, supporting new businesses, and injecting millions into the local economy. Its philanthropic efforts and community outreach further underscore its commitment to education and development in the San Joaquin Valley. Recent Demo Videos WristFlick: Design and Evaluation of a Smartwatch-Based System for Interacting with Smart Televisions TeleDriver: A Driving Simulator-Inspired Technique for Steering Telepresence Robots Evaluating User Preferences in Sharing Sensitive Information via Telepresence Robots Free-Hand Input and Interaction in Virtual Reality Using a Custom Force-Based Digital Thimble",
  "content_length": 5186,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:20"
}