{
  "name": "Ahmed Aleroud",
  "homepage": "https://www.augusta.edu/faculty/directory/view.php?id=AALEROUD",
  "status": "success",
  "content": "Ahmed Aleroud - Faculty Profile Home Faculty Directory Profile Update Your Profile Directory FAQs PACT Login Give Feedback Ahmed Aleroud Associate Professor Ahmed Aleroud Associate Professor Academic Appointment(s)AdministrationDepartment of Computer & Cyber SciencesSchool of Computer and Cyber SciencesDepartment of Computer & Cyber Sciences BioDr. Ahmed Aleroud is an Associate Professor of Cyber Security Analytics at Augusta University. Prior to joining Augusta University, he served as a Visiting Associate Research Scientist and Postdoctoral Fellow at the University of Maryland, Baltimore County, and as an Associate Professor of Information Systems at Yarmouk University in Jordan. He holds a Ph.D. and M.S. in Information Systems from the University of Maryland, Baltimore County, an M.S. in Computer Information Systems from Yarmouk University, and a B.S. in Software Engineering from the Hashemite University in Jordan.His research focuses on adversarial machine learning and AI, privacy-preserving machine learning, and mitigating social engineering and social media influence cyber attacks. He served as a certified cybersecurity trainer at the Cyber Shield Academy in Jordan.Dr. Aleroud has published in leading journals such as IEEE Transactions, ACM Digital Threats: Research & Practice, Computers & Security, Information Security and Applications, Information Systems Frontiers, Knowledge and Information Systems, and Social Media + Society. His work has also appeared in major conferences including NOMS, ARES, HICSS, AMCIS, and many others. His research has been supported by the Office of Naval Research (ONR), the Department of Energy (DOE), MITRE, the European IP Networks (RIPE), and the Maryland Innovation Initiative. He has also co-authored two educational and research-focused books on cybersecurity. AALEROUD@augusta.edu (706) 729-2773 UH 107 General Credentials Instruction Scholarship Service Education Ph.D., Information Science/Studies University of Maryland - Balti, 2014 BS, Computer Software Engineering The Hashemite University, 2006 Certifications Cyber Threat Hunting Active Counter Measures(ACM), 2022 CITI Human Subjects Research CITI and Augusta University, 2021 Awards & Honors RIPE Academic Cooperation Initiative (RACI) Middle east network operators group, 2018 European IP Networks, 2017 Courses Taught Most Recent Academic Year CSCI 8940 Dissertation Research CYBR 3100 Intro Defensive Cyber Operatio AIST 7100 Data Analytics in Security Teaching Interests Dr. Aleroud is particularly interested in teaching ethical hacking and penetration testing courses. With hi research and professional experience in cybersecurity analytics, adversarial machine learning, and detecting social engineering attacks, He views ethical hacking as a critical foundation for preparing the next generation of cyber defenders. HE incorporates hands-on, lab-driven learning to help students understand system vulnerabilities, exploitation techniques, and real-world adversarial behaviors. His teaching approach emphasizes responsible use of offensive security skills, encouraging students to think like attackers while upholding strong ethical and legal standards. He is committed to designing practical, scenario-based modules, including network reconnaissance, privilege escalation, adversarial AI testing, and social engineering simulations, that help students build both technical expertise and professional integrity in cybersecurity operations. Scholarship Selected Recent Publications Adversary-Resilient Clustered Federated Learning for Secure AI-Driven Healthcare Data Analytics, 2025 Conference Proceeding Augmented Tabular Adversarial Evasion Attacks with Constraint Satisfaction Guarantees, 2025 Conference Proceeding Emotional and Informational Dynamics in Question-Response Pairs in Online Health Communities: A Multimodal Deep Learning Approach, 2025 Journal Article, Academic Journal Generative AI vs. Human Deception: A Comparative Analysis of ChatGPT, Gemini, and Human-Generated Disinformation, 2025 Conference Proceeding Powerful \\& Generalizable, Why not both? VA: Various Attacks Framework for Robust Adversarial Training, 2025 Conference Proceeding Research Interests Privacy preserving data analyticsAdversarial AI/ML Social Engineering and Social Media influence attacks Department Service Faculty search 2022 - Present Role: Attendee, Meeting data science curriculum, program 2022 - Present Role: Committee Member College Service 2021 - 2021 Role: Attendee, Meeting University Service Graduate Research Day Judge 2022 - 2022 Role: Student Placement Professional Service ACM Transactions on Intelligent Systems and Technology (TIST) 2021 - Present Role: Reviewer Review committee 2021 - 2021 Role: Reviewer",
  "content_length": 4756,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:12"
}