{
  "name": "Ahmet Burak Can",
  "homepage": "https://web.cs.hacettepe.edu.tr/~abc",
  "status": "success",
  "content": "Home of Ahmet Burak Can Welcome to Ahmet Burak Can's home page Home Research Teaching Schedule Links Personal Contact Information: Dr. Ahmet Burak Can Hacettepe University Department of Computer Engineering Beytepe, 06532, Ankara/Turkey Office: Computer Engineering Building, Room:205 Phone: +90 (312) 2977500 Ext:131 Fax: +90 (312) 2977502 e-mail: I'm affiliated with Hacettepe University, Department of Computer Engineering since 1998. I received my Ph.D. degree from Department of Computer Science, Purdue University. I received my B.Sc. and M.Sc. degrees from Department of Computer Engineering, Hacettepe University. I am an alumni of Ankara Science High School. My primary research interests concentrate on two main fields: information security and computer vision. In the information security field, I'm especially interested in trust management in distributed systems and applications of cryptography. In the computer vision field, I'm interested in usage of depth information in various vision problems and medical image processing. Recent News Our paper is accepted to Computer Vision and Image Understanding (Jan 2022) Caglayan, A., Imamoglu, N., Can, A. B., & Nakamura, R. (2022). When CNNs meet random RNNs: Towards multi-level analysis for RGB-D object and scene recognition. Computer Vision and Image Understanding, Volume 217, March 2022, PDF My student, Halil İbrahim Öztürk, got her M.Sc. degree. Congratulations to him! (Sep 2021) My student, Işıl Karabey Aksakallı, got her Ph.D. degree. Congratulations to her! (Jun 2021) Our project \"Developing New Abnormal Event Detection Approaches for Smart Video Surveillance Systems\" is accepted by TUBİTAK 1001 grant program. ((Dec 2019)) Our paper is accepted to ICCV 2019, Cross-Modal Learning in Real World Workshop (Aug 2019): Nihat Tekeli, Ahmet Burak Can, Distance based Training for Cross-Modality Person Re-Identification , IEEE International Conference on Computer Vision (ICCV) Workshops: Cross-Modal Learning in Real World Workshop (CroMoL), 2019 My student, Sercan Türker, got his M.Sc. degree. Congratulations to him! (Jun 2019) Our paper is accepted to Computer Vision and Image Understanding (Apr 2019): Oguzhan Guclu, Ahmet Burak Can, k-SLAM: A fast RGB-D SLAM approach for large indoor environments, Computer Vision and Image Understanding, Volume 184, July 2019, Pages 31-44, 2019 PDF Our paper is accepted to CVPR 2019 workshop (April 2019): Oğuzhan Güçlü, Ali Çağlayan, Ahmet Burak Can, RGB-D Indoor Mapping Using Deep Features, Workshop on Autonomous Driving (WAD), Computer Vision and Pattern Recognition (CVPR), 2019 My student, Ali Çağlayan, got his Ph.D. degree. Congratulations to him! (Dec 2018) Our paper is accepted to ECCV 2018 workshop (Sep 2018): Ali Çağlayan, Ahmet Burak Can, A Unified Learning Approach Using CNN-RNN for RGB-D Object Recognition, Workshop on 3D Reconstruction Meets Semantics (3DRMS), Europian Conference On Computer Vision (ECCV), 2018 My student, Oğuzhan Güçlü, got his Ph.D. degree. Congratulations to him! (May 2018) My student, Orhun Dalabasmaz, got his M.Sc. degree. Congratulations to him! (Jan 2018) My student, Efsun Sefa Sezer, got her M.Sc. degree. Congratulations to her! (Jul 2017) My student, Aydın Kaya, got his Ph.D. degree. Congratulations to him! (Jun 2015) Our project, City Security Management System (Kent Güvenligi Yönetim Sistemi), is accepted for TUBITAK 1007 program. ((Mar 2016)) My student, Ali Seydi Keçeli, got his Ph.D. degree. Congratulations to him! (Dec 2014)",
  "content_length": 3506,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:23"
}