{
  "name": "Aidan Hogan",
  "homepage": "http://aidanhogan.com",
  "status": "success",
  "content": "Aidan Hogan's Homepage Aidan Hogan I'm Aidan. This is my academic homepage. I'm an Associate Professor in the Department of Computer Science (DCC) at the Universidad de Chile, and an Associate Researcher of the Millennium Institute for Foundational Research on Data (IMFD). I previously worked at the Digital Enterprise Research Institute (DERI) (now called INSIGHT) based in the National University of Ireland, Galway. I started there in April 2005, doing an internship and various other things, including a PhD which I defended in February 2011. Then I did a PostDoc for two years or so. I left DERI/INSIGHT for Chile in November 2013. My general research interest is in exploring whether or not the Semantic Web and Linked Data are good proposals for organising the content of the Web. My main research goal is to one day write a good paper. Research Interests Created using PubTag, by Paula Ríos; see paper. Publications Click to see my publications on: | | | | | | Skip to: book | journal | book-chapter | conference | workshop | poster&demo | miscellaneous Books Aidan Hogan, Eva Blomqvist, Michael Cochez, Claudia d'Amato, Gerard de Melo, Claudio Gutiérrez, Sabrina Kirrane, José Emilio Labra Gayo, Roberto Navigli, Sebastian Neumaier, Axel-Cyrille Ngonga Ngomo, Axel Polleres, Sabbir M. Rashid, Anisa Rula, Lukas Schmelzeisen, Juan F. Sequeda, Steffen Staab and Antoine Zimmermann. \"Knowledge Graphs \". Volume 22 of Synthesis Lectures on Data, Semantics, and Knowledge, 257 pages, ISBN:978-3-031-01918-0, Springer Nature, November 2021 (previously published by Morgan & Claypool; see OA/HTML version). Aidan Hogan. \"The Web of Data \". 680 pages, ISBN:9783030515805, Springer Nature, October 2020. Aidan Hogan. \"Reasoning Techniques for the Web of Data \". Volume 19 of Studies on the Semantic Web, 344 pages, ISBN:9781614993827, IOS Press, May 2014 (edited version of PhD thesis). Journal Articles Sebastián Ferrada, Benjamín Bustos, Aidan Hogan. \"Similarity Joins and Clustering for SPARQL\". In Semantic Web Journal 15(5): 1701–1732, 2024. Renzo Angles, Naim Bro, Ivania Donoso-Guzmán, Juan Pablo Luna, Aidan Hogan, Juan Reutter, Henry Rosales-Méndez, Sergio Toro. \"Telar and TelarKG: Data-Driven Insights into Chile's Constitutional Process\". In Communications of the ACM 67(8): 78–79, 2024. Diego Arroyuelo, Aidan Hogan, Gonzalo Navarro, Juan Reutter, and Domagoj Vrgoč. \"Tackling Challenges in Implementing Large-Scale Graph Databases\". In Communications of the ACM 67(8): 40–44, 2024. Stephen Gilbert, Jakob Nikolas Kather, Aidan Hogan. \"Augmented non-hallucinating large language models as medical information curators\". In npj Digital Medicine 7(1): 2024. Diego Arroyuelo, Adrián Gómez-Brandón, Aidan Hogan, Gonzalo Navarro, Juan Reutter, Javiel Rojas-Ledesma, Adrián Soto. \"The Ring: Worst-Case Optimal Joins in Graph Databases using (Almost) No Extra Space\". In ACM Transactions on Database Systems 49(2): 5:1--5:45, 2024 \". Diego Arroyuelo, Adrián Gómez-Brandón, Aidan Hogan, Gonzalo Navarro, Javiel Rojas-Ledesma. \"Optimizing RPQs over a Compact Graph Representation\". In VLDB Journal 33(2): 349--374, 2024. Claus Stadler, Muhammad Saleem, Qaiser Mehmood, Carlos Buil-Aranda, Michel Dumontier, Aidan Hogan and Axel-Cyrille Ngonga Ngomo. \"LSQ 2.0: A Linked Dataset of SPARQL Query Logs\". In Semantic Web Journal 15(1): 167--189, 2024. Domagoj Vrgoč, Carlos Rojas, Renzo Angles, Marcelo Arenas, Diego Arroyuelo, Carlos Buil-Aranda, Aidan Hogan, Gonzalo Navarro, Cristian Riveros and Juan Romero. \"MillenniumDB: An Open-Source Graph Database System\". In Data Intelligence 5(3): 636–662, 2023. Jhomara Luzuriaga, Emir Muñoz, Henry Rosales-Méndez and Aidan Hogan. \"Merging Web Tables for Relation Extraction with Knowledge Graphs\". In IEEE Transactions on Knowledge and Data Engineering 35(2): 1803–1816 , 2023. Jaime Salas and Aidan Hogan. \"Semantics and Canonicalisation of SPARQL 1.1\". In Semantic Web Journal 13(5): 829–893, 2022. Waqas Ali, Muhammad Saleem, Bin Yao, Aidan Hogan and Axel-Cyrille Ngonga Ngomo. \"A Survey of RDF Stores & SPARQL Engines for Querying Knowledge Graphs\". In VLDB Journal 31(3): 1–26, 2022. Aidan Hogan, Eva Blomqvist, Michael Cochez, Claudia d'Amato, Gerard de Melo, Claudio Gutiérrez, Sabrina Kirrane, José Emilio Labra Gayo, Roberto Navigli, Sebastian Neumaier, Axel-Cyrille Ngonga Ngomo, Axel Polleres, Sabbir M. Rashid, Anisa Rula, Lukas Schmelzeisen, Juan F. Sequeda, Steffen Staab and Antoine Zimmermann \"Knowledge Graphs\". In ACM Computing Surveys 54(4): 71:1–71:37, 2021. (See extended version) Henry Rosales-Méndez, Aidan Hogan and Barbara Poblete. \"Fine-Grained Entity Linking\". In the Journal of Web Semantics 65, 2020. Aidan Hogan. \"The Semantic Web: Two Decades On\". In the Semantic Web Journal 11(1): 169–185, 2020. Jose L. Martinez-Rodriguez, Aidan Hogan and Ivan Lopez-Arevalo. \"Information Extraction meets the Semantic Web: A Survey\". In the Semantic Web Journal 11(2): 255–335, 2020. Renzo Angles, Marcelo Arenas, Pablo Barceló, Aidan Hogan, Juan Reutter and Domagoj Vrgoč. \"Foundations of Modern Query Languages for Graph Databases\". In ACM Computing Surveys 50(5): 68:1-68:40 2017. Aidan Hogan. \"Canonical Forms for Isomorphic and Equivalent RDF Graphs: Algorithms for Leaning and Labelling Blank Nodes \". In ACM Transactions on the Web 11(4): 22:1-22:62, 2017. Pierre-Yves Vandenbussche, Jürgen Umbrich, Luca Matteis, Aidan Hogan and Carlos Buil-Aranda. \"SPARQLES: Monitoring Public SPARQL Endpoints\". In the Semantic Web Journal 8(6): 1049–1065, 2017. Yasar Khan, Muhammed Saleem, Muntazir Mehdi, Aidan Hogan, Qaiser Mehmood, Dietrich Rebholz-Schuhmann and Ratnesh Sahay. \"SAFE: SPARQL Federation over RDF Data Cubes with Access Control\". In the Journal of Biomedical Semantics 8(1): 5:1–5:22, 2017. Ali Hasnain, Qaiser Mehmood, Syeda Sana e Zainab and Aidan Hogan. \"SPORTAL: Profiling the Content of Public SPARQL Endpoints\". In the International Journal on Semantic Web and Information Systems 12(3): 134–163, 2016. Aidan Hogan, Pascal Hitzler and Krzysztof Janowicz. \"Linked Dataset Description Papers at the Semantic Web Journal: A Critical Assessment\". In the Semantic Web Journal 7(2): pp. 105–116, 2016 (editorial; online). Jürgen Umbrich, Aidan Hogan, Axel Polleres and Stefan Decker. \"Link Traversal Querying for a Diverse Web of Data \". In the Semantic Web Journal 6(6): pp. 585–624, 2015 (online). Aidan Hogan, Marcelo Arenas, Alejandro Mallea and Axel Polleres. \"Everything You Always Wanted to Know About Blank Nodes \". In the Journal of Web Semantics 27: pp. 42–69, 2014 (online). Aidan Hogan, Jürgen Umbrich, Andreas Harth, Richard Cyganiak, Axel Polleres and Stefan Decker. \"An empirical survey of Linked Data conformance \". In the Journal of Web Semantics 14: pp. 14–44, 2012 (online). Aidan Hogan, Antoine Zimmermann, Jürgen Umbrich, Axel Polleres and Stefan Decker. \"Scalable and Distributed Methods for Entity Matching, Consolidation and Disambiguation over Linked Data Corpora \". In the Journal of Web Semantics 10: pp. 76–110, 2012 (online). Aidan Hogan, Andreas Harth, Jürgen Umbrich, Sheila Kinsella, Axel Polleres and Stefan Decker. \"Searching and Browsing Linked Data with SWSE: the Semantic Web Search Engine \". In the Journal of Web Semantics 9(4): pp. 365–401, 2011 (online). Piero A. Bonatti, Aidan Hogan, Axel Polleres and Luigi Sauro. \"Robust and Scalable Linked Data Reasoning Incorporating Provenance and Trust Annotations \". In the Journal of Web Semantics 9(2): pp. 165–201, 2011 (online). Axel Polleres, Aidan Hogan, Andreas Harth and Stefan Decker. \"Can we ever catch up with the Web? \". In Semantic Web Journal 1(1–2): pp. 45–42, 2010 (online). Aidan Hogan, Andreas Harth and Axel Polleres. \"Scalable Authoritative OWL Reasoning for the Web \". In International Journal on Semantic Web and Information Systems, 5(2), pp. 49–90, 2009. Book Chapters Aidan Hogan. \"Knowledge Graphs: A Guided Tour\". Chapter in Research School in Artificial Intelligence in Bergen, June 2022. Aidan Hogan. \"Knowledge Graphs: Research Directions\". Chapter in Reasoning Web: Declarative Artificial Intelligence, (Springer), October 2020. Aidan Hogan. \"Linked Data and the Semantic Web Standards \". Chapter in Linked Data Management, (CRC Press), May 2014. Axel Polleres, Aidan Hogan, Renaud Delbru, Jürgen Umbrich. \"RDFS & OWL Reasoning for Linked Data\". Chapter in Lecture Notes for the Reasoning Web Summer School, Mannheim, (Springer), July 2013. Andreas Harth, Aidan Hogan, Jürgen Umbrich, Sheila Kinsella, Axel Polleres and Stefan Decker. \"Searching and Browsing Linked Data with SWSE \". Chapter in Semantic Search over the Web, (Springer), 2012 (abridged version of JWS paper above). Aidan Hogan, Jeff Z. Pan, Axel Polleres and Yuan Ren. \"Scalable OWL 2 Reasoning for Linked Data \". Chapter in the Lecture Notes for the Reasoning Web Summer School, Galway, Ireland, (Springer), August 2011. Aidan Hogan, Andreas Harth and Axel Polleres. \"Scalable Authoritative OWL Reasoning for the Web \". Chapter in Semantic Services, Interoperability and Web Applications: Emerging Concepts, (IGI Global), June 2011, (invited republication). Conference Papers José Fuentes-Sepúlveda, Adrián Gómez-Brandón, Aidan Hogan, Gonzalo Navarro, and Juan Reutter. \"Worst-Case-Optimal Joins on Graphs with Topological Relations\". In the Proceedings of the ACM World Wide Web Conference, Syndey, Australia, June 9–15, 2025. Diego Arroyuelo, Benjamin Bustos, Adrián Gómez-Brandón, Aidan Hogan, Ayleen Irribarra-Cortés, Gonzalo Navarro, and Juan Reutter. \"Worst-Case-Optimal Similarity Joins on Graph Databases\". In the Proceedings of the ACM SIGMOD International Conference on Management of Data, Santiago, Chile, April 28–May 2, 2024. Renzo Angles, Carlos Buil Aranda, Aidan Hogan, Carlos Rojas, and Domagoj Vrgoč. \"WDBench: A Wikidata Graph Query Benchmark\". In the Proceedings of the International Semantic Web Conference, Online, October 23–27, 2022. Oren Kalinsky, Aidan Hogan, Oren Mishali, Yoav Etsion and Benny Kimelfeld. \"Explor",
  "content_length": 58487,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:27"
}