{
  "name": "Aijun An",
  "homepage": "http://www.cse.yorku.ca/~aan",
  "status": "success",
  "content": "Aijun An's Home Page Aijun An Professor & Tier 1 York Research Chair Department of Electrical Engineering and Computer Science York University 4700 Keele Street Toronto, Ontario M3J 1P3 CANADA Phone: 416 736 2100 x44298 Fax: 416 736 5872 aan at yorku dot ca General Information I obtained my Ph.D. degree in Computer Science from the University of Regina. From 1997 to 2001, I worked at the Department of Computer Science of the University of Waterloo first as a post-doctoral fellow and later as a research assistant professor. I joined the Department of Computer Science (now named Department of Electrical Engineering and Computer Science) of York University in July 2001. Research Areas of interest: data mining, machine learning, natural language processing, and artificial intelligence. Current Research Projects Knowledge-based Neural Question Generation from Text, collaborated with iNAGO Corp. and supported by an NSERC Alliance grant and fund from iNAGO. Optimizing data migration and performance of target systems, collaborated with IBM Cloud and funded by IBM CAS. GPU Job Scheduling Using Deep Reinforcement Learning, collaborated with IBM Spectrum Computing and funded by IBM CAS. Improving Automatic Question Generation from Automotive Manuals for Building Conversational Systems, funded by an OCI TalentEdge grant and iNAGO Corp. Adaptive Online Mining of Big Data Streams, funded by NSERC Discovery Grant and NSERC Discovery Accelerator Supplement. Previous Research Projects Big Data Research, Analytics, and Information Network (BRAIN), funded by ORF-RE (Ontario Reseasrch Fund - Research Excellence Program). Online Mining of Big Data Streams (funded by NSERC Discovery Grant and NSERC Discovery Accelerator Supplement) Data and Visual Analytics for Decision Making in Next Generation News Media (funded by NSERC CRD, BRAIN, and The Globe and Mail) Using Machine Learning for Health Risk Assessment (funded by NSERC CRD, BRAIN, and Manifold Data Mining Inc.) Distributed Deep Learning and Graph Analytics (funded by NSERC CRD, BRAIN, IBM CAS and IBM Spectrum Computing) Developing Smart Conversational Systems (funded by BRAIN and iNAGO Corp.) Research Training Programs NSERC CREATE Program on Smart Autonomous Robotic Technology for Space Exploration (SMART-ART) NSERC CREATE Program on Data Analytics and Visualization (DAV) (Past) NSERC CREATE Program on ADERSIM (Past) Publications Edited Books Journal Papers Conference Papers Book Chapters Patents Recognition Google Scholar, DBLP Teaching I am teaching EECS4412 (Data Mining) and EECS6412 (Data Mining) Research Supervision Current Supervision Past Supervision Awards NSERC Discovery Accelerator Supplement (DAS) Award, 2014, 2019. Research Leaders Award, York University, 2015. The Mildred Baptist Teaching Excellence Award, Department of Computer Science and Engineering, York University, 2009. Merit Awards, York University. (2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012) Best Paper Award at the Thirteenth Canadian Conference on Artificial Intelligence (AI'00). Professional Service to Academia Journal Editorial Service Editorial Board Member, Journal of Intelligent Information Systems (JIIS) Area Editor for Computational Intelligence Editorial Board Member, International Journal of Social Network Mining (IJSNM) Guest Editor for a special issue on information retrieval and databases in Journal of Intelligent Information Systems (JIIS) (2008) Guest Editor for a special issue on intelligent systems in Knowledge and Information Systems (KAIS) (2008) Conference Organizations Program Co-chair for the 17th International Conference on Advances in Social Networks Analysis and Mining (ASONAM 2025) Co-organizer for Canada AI Day at KDD 2025 Proceedings Co-chair for the 43rd International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2020) Media & Publicity Co-chair for KDD 2017 Program Co-chair for the 2010 International Conference on Active Media Technology (AMT 2010) Organizing Co-chair for 2010 IEEE/WIC/ACM International Conferences on Web Intelligence and Intelligent Agent Technology (WI/IAT 2010) Proceedings Chair for the 19th ACM Conference on Information and Knowledge Management (CIKM'10) Program Co-chair for the Seventeenth International Symposium on Methodologies for Intelligent Systems (ISMIS08) Program Co-chair for the Joint Rough Set Conference (JRS'07) Service on Conference Program Committees SIGKDD'07, SIGKDD'08, SIGKDD'10, SIGKDD'11, SIGKDD'13, SIGKDD'14, SIGKDD'15, SIGKDD'16, SIGKDD'18 SIGKDD'19, SIGKDD'20, SIGKDD'21, SIGKDD'22, SIGKDD'23, SIGKDD'24, SIGKDD,25 VLDB'15, SIGMOD'16, VLDB'18, ICDE'19, ICDE'20 IJCAI'18, AAAI'19, AAAI'20, AAAI'21, AAAI,22, AAAI,23, AAAI'24, AAAI'25, AAAI'26 NeurIPS'21, NeurIPS'24, NeurIPS'25 ICDM'06, ICDM'07, ICDM'09, ICDM'10, ICDM'11, ICDM'12, ICDM'13, ICDM'15, ICDM'16, ICDM'17, ICDM'18, ICDM'19, ICDM'20, ICDM'21, ICDM'22, ICDM'23, ICDM'24, ICDM'25 SDM'11, SDM'12, SDM'16, SDM'19(SPC), SDM'20(SPC), SDM'21(SPC), SDM'22(SPC), SDM'23(SPC), SDM'24 (SPC) CIKM'08, CIKM'09, CIKM'10, CIKM'11, CIKM'16, CIKM'17, CIKM'22(SPC), CIKM'23(SPC), CIKM'24(SPC), CIKM'25(SPC) ECML/PKDD'06, ECML/PKDD'11, ECML/PKDD'14, ECML/PKDD'15, ECML/PKDD'16, ECML/PKDD'17, ECML/PKDD'18, ECML/PKDD'19. PAKDD'07, PAKDD'08, PAKDD'09, PAKDD'11, PAKDD'14, PAKDD'15, PAKDD'16, PAKDD'17, PAKDD'18 BIBM'07, BIBM'08, BIBM'09, BIBM'11, BIBM'12, BIBM'13 ISMIS'06, ISMIS'09, ISMIS'12, ISMIS'14 Canadian AI'10, AI'11, AI'13 ASONAM'09, ASONAM'10, ASONAM'13, ASONAM'14 IEEE GrC'06, GrC'07, GrC'08, GrC'09 ADMA'11, ADMA'12 ICTAI'11, ICTAI'12",
  "content_length": 5591,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:28"
}