{
  "name": "Aikaterini Bourazeri",
  "homepage": "https://www.essex.ac.uk/people/boura96709/katerina-bourazeri",
  "status": "success",
  "content": "Katerina Bourazeri | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Katerina Bourazeri People Dr Katerina Bourazeri Lecturer School of Computer Science and Electronic Engineering (CSEE) Email a.bourazeri@essex.ac.uk Location 1NW.3.19, Colchester Campus Academic support hours Academic Support Hours: Monday 1pm - 2pm Thursday 1pm - 2pm Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography I am a Lecturer at the School of Computer Science and Electronic Engineering (CSEE) at the University of Essex. I hold a PhD in Electrical and Electronic Engineering from Imperial College London, an MSc in Internet and Wireless Computing from the University of York, and a BSc in Computer Science from Piraeus University, Greece. My research interests include Human-Computer Interaction (HCI), Game Design & Development, Interface Design, Information Visualisation, Health Informatics, Smart Cities and Internet of Things (IoT). More generally, I am interested in designing, implementing and evaluating technologies that address everyday problems with a direct impact on people’s lives; examples include energy efficiency and sustainability, people’s empowerment and inclusivity in societies, and independent living at home for people with disabilities or chronic conditions. Qualifications PhD Imperial College London, (2015) MSc University of York, (2011) BSc University of Piraeus, (2009) Appointments University of Essex Lecturer, Computer Science and Electrical Engineering, University of Essex (1/5/2019 - present) Other academic Research Fellow, Computer Science, City, University of London (6/3/2017 - 30/4/2019) Research Associate, Coventry University (22/2/2016 - 3/3/2017) Research and professional activities Research interests Developing Serious Games for Promoting Sustainable Behaviour Open to supervise Enhancing Mental Health through Immersive Experiences Open to supervise Overcoming Body Dysmorphia with Immersive Virtual Reality Open to supervise Improving Quality of Life for Parkinson's Patients with Virtual Reality Open to supervise Teaching and supervision Current teaching responsibilities Computer Game Design (CE217) High-Level Games Development (CE318) Current supervision Ismael Hayden Thesis title: Creating an App Outline and Co-Design Guidelines for Artificially Intelligent Driven Software to Support Cbtp Practitioners Working with Clients Experiencing First Episode Psychosis. Degree subject: Clinical Psychology (D Clin Psych) Degree type: Professional Doctorate Saba Zahedieh Degree subject: Computer Science Degree type: Doctor of Philosophy Domiziana Falaschi Degree subject: Psychology Degree type: Doctor of Philosophy Sultan Nasser M Hezam Degree subject: Computer Science Degree type: Doctor of Philosophy Saba Zahedieh Degree subject: Computer Science Degree type: Doctor of Philosophy Benjamin Robert Murphy Degree subject: Computer Science Degree type: Doctor of Philosophy Benjamin Bempong Degree subject: Computer Science Degree type: Master of Philosophy Previous supervision Michiel Niklaas Smuts Thesis title: Towards a Design Framework for Adaptable Reconfigurable Virtual Learning Environments Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 19/1/2023 Publications Journal articles (12) Alkhalifah, E., Hammady, R., Abdelrahman, M., Darwish, A., Cranmer, E., Al-Shamaileh, O., Bourazeri, A. and Jung, T., (2025). Enhancing Tourist Attitudes and Behaviours in Islamic Religious Tourism through Virtual Reality: The Role of Emotional Attachment and VR Presence. Human Behavior and Emerging Technologies. 2025 (1) Claeys, R., Embrechts, E., Bourazeri, A., Debeuf, R., Firouzi, M., Eggermont, M., Lieten, S., Filtjens, B., Verstraten, T., Swinnen, E. and Beckwée, D., (2025). Understanding the perspectives of older adults and physiotherapists on home-based lower-limb exoskeletons. Wearable Technologies. 6, e31- Zahedieh, S., Rousis, AO. and Bourazeri, A., (2025). Towards a unified framework for electric vehicle infrastructure: Insights into charging management, communication and emerging technologies. Energy Reports. 14, 1834-854 Claeys, R., Embrechts, E., Debeuf, R., Firouzi, M., Bourazeri, A., De Raedt, S., Moeyersons, C., Filtjens, B., Verstraten, T., Beckwée, D. and Swinnen, E., (2025). Toward better assistive lower-limb exoskeletons: Insights from stroke survivors through co-design. Assistive Technology, 1-15 Bhattacharya, S., De Feo, V. and Bourazeri, A., (2024). GreenMate: A Serious Game Educating Children about Energy Efficiency. IEEE Transactions on Games. 17 (1), 196-209 Bhattacharya, S., Rousis, AO. and Bourazeri, A., (2024). Trust & Fair Resource Allocation in Community Energy Systems. IEEE Access. 12, 11157-11169 Dey, S., Alshehabi Al-Ani, J., Bourazeri, A., Saha, S., Purkait, R., Hill, S. and Thompson, J., (2024). Pixelator v2: A Novel Perceptual Image Comparison Method with LAB Colour Space and Sobel Edge Detection for Enhanced Security Analysis. Electronics. 13 (22), 4541-4541 Claeys, R., Embrechts, E., Bourazeri, A., Debeuf, R., Eggermont, M., Firouzi, M., Filtjens, B., Verstraten, T., Swinnen, E. and Beckwée, D., (2024). Guiding exoskeleton development for healthy ageing: Co-design insights from older adults. Gerontechnology. 23 (s), 1-1 Venugopal, R., Shafqat, N., Venugopal, I., Tillbury, BMJ., Stafford, HD. and Bourazeri, A., (2022). Privacy preserving Generative Adversarial Networks to model Electronic Health Records.. Neural Networks. 153, 339-348 Bourazeri, A. and Pitt, J., (2018). Collective attention and active consumer participation in community energy systems. International Journal of Human-Computer Studies. 119, 1-11 Bourazeri, A., Pitt, J. and Arnab, S., (2017). Enabling collective awareness of energy use via a social serious game. EAI Endorsed Transactions on Game-Based Learning. 4 (13), 153510-153510 Pitt, J., Bourazeri, A., Nowak, A., Roszczynska-Kurasinska, M., Rychwalska, A., Rodriguez Santiago, I., Lopez Sanchez, M., Florea, M. and Sanduleac, M., (2013). Transforming Big Data into Collective Awareness. Computer. 46 (6), 40-45 Show all Book chapters (2) Bourazeri, A., Almajano, P., Rodriguez, I. and Lopez-Sanchez, M., (2014). Assistive Awareness in Smart Grids. In: The Computer After Me. IMPERIAL COLLEGE PRESS. 117- 130. 9781783264179 Pitt, J., Busquets, D., Bourazeri, A. and Petruzzi, P., (2014). Collective Intelligence and Algorithmic Governance of Socio-Technical Systems. In: Social Collective Intelligence Combining the Powers of Humans and Machines to Build a Smarter Society. Springer. 31- 50. 3319086812. 9783319086811 Conferences (15) Saini, N., Sharma, D., Mehrotra, D. and Bourazeri, A., (2024). A Comprehensive Analysis of Various Federated Learning Techniques Shah, SB., Garg, S. and Bourazeri, A., (2023). Emotion Recognition in Speech by Multimodal Analysis of Audio and Text Khanam, Z. and Bourazeri, A., (2022). Design Challenges for an Energy Exchange Platform Enabling a Successful Energy Transition Neate, T., Bourazeri, A., Roper, A., Stumpf, S. and Wilson, S., (2019). Co-Created Personas Bourazeri, A. and Stumpf, S., (2018). Co-designing smart home technology with people with dementia or Parkinson's disease Bourazeri, A., Arnab, S., Heidmann, O., Coelho, A. and Morini, L., (2017). Taxonomy of a gamified lesson path for STEM education: The beaconing approach Pitt, J., Diaconescu, A. and Bourazeri, A., (2017). Democratisation of the SmartGrid and the active participation of prosumers Bourazeri, A., Bellamy-Wood, T. and Arnab, S., (2017). EnCity: A serious game for empowering young people with Down's syndrome Bourazeri, A., Pitt, J. and Arnab, S., (2017). Social Mpower: An Educational Game for Energy Efficiency Clarke, S., Arnab, S., Morini, L., Wood, O., Green, K., Masters, A. and Bourazeri, A., (2016). EscapED: A framework for creating live-action, interactive games for higher/further education learning and soft skills development Bourazeri, A. and Pitt, J., (2014). Collective Awareness for Collective Action in Socio-technical Systems Bourazeri, A. and Pitt, J., (2014). Social Mpower: A Serious Game for Self-Organisation in Socio-technical Systems Bourazeri, A. and Pitt, J., (2014). A Game-Based Approach for Collective Action in Self-Organising Socio-technical Systems Bourazeri, A. and Pitt, J., (2014). An Agent-Based Serious Game for Decentralised Community Energy Systems Bourazeri, A., Pitt, J., Almajano, P., Rodriguez, I. and Lopez-Sanchez, M., (2012). Meet the Meter: Visualising SmartGrids Using Self-Organising Electronic Institutions and Serious Games Show all Grants and funding 2022 Impact Global Work University of Essex (ESRC IAA) 2021 Business Collaboration Fund - Katerina Bourazeri University of Essex (ESRC IAA) 2020 Liverpool Multi-vector Energy Exchange Innovate UK (formerly Technology Strategy Board) 2019 Breaking Down Barriers for the Benefit of Population Health ",
  "content_length": 11332,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:28"
}