{
  "name": "Aikaterini A. Sotiraki",
  "homepage": "https://sotiraki.com",
  "status": "success",
  "content": "Katerina Sotirakiaikaterini.sotiraki@yale.edu Assistant ProfessorYale UniversityArchimedes AIBiographyI am an assistant professor in the Computer Science department at Yale University. Before Yale, I was a postdoc at UC Berkeley working with Raluca Ada Popa and Alessandro Chiesa. I completed my Ph.D. at MIT, where I was advised by Vinod Vaikuntanathan.InterestsTheoretical CryptographyPost-Quantum CryptographyComplexity TheorySecure ComputationEducationPhD in Computer Science, 2020Massachusetts Institute of TechnologyMSc in Computer Science, 2016Massachusetts Institute of TechnologyBSc in Applied Mathematics, 2013National Technical University of AthensPublicationsHOLMES: Efficient Distribution Testing for Secure Collaborative LearningIan Chang, Katerina Sotiraki, Weikeng Chen, Murat Kantarcioglu, Raluca Ada PopaUSENIX Security, 2023Cite Abstract eprint CodeLattice-Based Succinct Arguments for NP with Polylogarithmic-Time VerificationJonathan Bootle, Alessandro Chiesa, Katerina SotirakiCRYPTO, 2023Cite Abstract eprintSumcheck Arguments and Their ApplicationsJonathan Bootle, Alessandro Chiesa, Katerina SotirakiCRYPTO, 2021Cite Abstract eprintA Topological Characterization of Modulo-p Arguments and Implications for Necklace SplittingAris Filos-Ratsikas, Alexandros Hollender, Katerina Sotiraki, Manolis ZampetakisSODA, 2021Cite Abstract arXivConsensus-Halving: Does It Ever Get Easier?Aris Filos-Ratsikas, Alexandros Hollender, Katerina Sotiraki, Manolis ZampetakisEC, 2020 (Appeared in SIAM Journal on Computing)Cite Abstract arXivLimits on the Efficiency of (Ring) LWE Based Non-interactive Key ExchangeSiyao Guo, Pritish Kamath, Alon Rosen, Katerina SotirakiPKC, 2020 (Appeared in Journal of Cryptology)Cite Abstract eprintOn the Complexity of Modulo-q Arguments and the Chevalley - Warning TheoremMika Göös, Pritish Kamath, Katerina Sotiraki, Manolis ZampetakisCCC, 2020Cite Abstract arXivTowards Non-Interactive Zero-Knowledge for NP from LWERon D. Rothblum, Adam Sealfon, Katerina SotirakiPKC, 2019 (Appeared in Journal of Cryptology)Cite Abstract eprintPPP-Completeness with Connections to CryptographyKaterina Sotiraki, Manolis Zampetakis, Giorgos ZirdelisFOCS, 2018Cite Abstract arXivAgreement in Partitioned Dynamic NetworksAdam Sealfon, Katerina SotirakiDISC, 2014Cite Abstract arXivOccupational Fraud Detection Through VisualizationEvmorfia N. Argyriou, Katerina Sotiraki, Antonios SymvonisISI, 2013Cite Abstract arXiv × Copy Download",
  "content_length": 2462,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:27"
}