{
  "name": "Aisha I. Ali-Gombe",
  "homepage": "https://csc.lsu.edu/~aligombe",
  "status": "success",
  "content": "BioSkip to main contentSkip to navigationAisha Ali-GombeAssociate Professor Computer ScienceLouisiana State UniversityAisha Ali-Gombe is an associate professor at the Computer Science and Engineering (CSE) Division, Louisiana State University. She earned her Ph.D. in Engineering and Applied Science with a major in Computer Science and concentration in Information Assurance from the University of New Orleans (UNO) in 2017, following an M.S. degree in Computer Science in 2012. She also holds an MBA from Bayero University Kano and a B.Sc. from the University of Abuja, Nigeria, in 2005, and was a recipient of the TotalFinaElf undergraduate merit scholarship in 2002.Dr. Ali-Gombe is currently the director of the LSU Cybersecurity Clinic (LCC) and the founder of the System Security (SySec) Lab. She also holds a joint faculty position at LSU's Center for Computation and Technology. Her expertise and research interest are in cybersecurity and digital forensics, focusing on mobile and IoT platforms. Dr. Ali-Gombe's research involves solving applied cybersecurity problems such as malware and threat detection, cybercrime investigation, privacy policy enforcement, access control, and intrusion detection. She has authored and co-authored more than 30 publications, some of which have been featured in top-rated cybersecurity journals and conferences such as NDSS, RAID, DFRWS, ACM's ACSAC, WiSec, and CODASPY, the Journal of Computer and Security (COSE), Digital Investigations and the proceedings of the American Academy of Forensic Sciences (AAFS) amongst others. She won best paper awards at DRFWS (a top-tier digital forensics conference in the U.S.) in 2021 and 2022 and an outstanding poster award at CODASPY 2016. Since beginning her tenure-track journey, she has mentored six doctorate students, two of whom have graduated and are now assistant professors. She has also mentored three masters and more than 15 undergraduates, some of whom are currently working for Dell, Capital One, and MITRE.",
  "content_length": 2009,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:30"
}