{
  "name": "Aishwarya Thiruvengadam",
  "homepage": "https://sites.google.com/view/aishwaryat",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationAishwarya ThiruvengadamI am currently an Assistant Professor at the Department of Computer Science, IIT Madras. My research interests lie broadly within cryptography and theoretical computer science. My recent works have focused on provable security of symmetric-key cryptography.Previously, I was a postdoctoral scholar at the Department of Computer Science, TU Darmstadt working with Prof. Marc Fischlin as part of the Cryptoplexity group. Prior to that, I was a postdoctoral scholar at the Department of Computer Science, University of California Santa Barbara working with Prof. Stefano Tessaro. I obtained my PhD from the University of Maryland, College Park where I was advised by Prof. Jonathan Katz and Prof. Dana Dachman-Soled.Professional Service:Program Committee member for CRYPTO '18, CFAIL '20Publications:Provable Time-Memory Tradeoffs: Symmetric Cryptography against Memory-Bounded Adversaries.Stefano Tessaro and Aishwarya Thiruvengadam.TCC 2018. Invited to Journal of CryptologyThe Multi-user Security of GCM, Revisited: Tight Bounds for Nonce Randomization.Viet Tung Hoang, Stefano Tessaro and Aishwarya Thiruvengadam. CCS 2018Provable Security of (Tweakable) Block Ciphers Based on Substitution-Permutation Networks.Benoit Cogliati, Yevgeniy Dodis, Jonathan Katz, Jooyoung Lee, John Steinberger, Aishwarya Thiruvengadam and Zhe Zhang.CRYPTO 2018Indifferentiability of Iterated Even-Mansour Ciphers with Non-Idealized Key-Schedules: Five Rounds are Necessary and Sufficient.Yuanxi Dai, Yannick Seurin, John Steinberger and Aishwarya Thiruvengadam.CRYPTO 201710-round Feistel is Indifferentiable from an Ideal Cipher.Dana Dachman-Soled, Jonathan Katz and Aishwarya Thiruvengadam.EUROCRYPT 2016Hash Functions from Ideal Ciphers Vulnerable to Related-Key Attacks.Jonathan Katz, Stefan Lucks and Aishwarya Thiruvengadam.CT-RSA 2015Verifiable Oblivious Storage.Daniel Apon, Jonathan Katz, Elaine Shi and Aishwarya Thiruvengadam.PKC 2014(Im)possibility of Adaptively Secure Fully Homomorphic Encryption.Jonathan Katz, Aishwarya Thiruvengadam and Hong-Sheng Zhou.PKC 2013Byzantine Agreement with a Rational Adversary.Adam Groce, Jonathan Katz, Aishwarya Thiruvengadam and Vassilis Zikas.ICALP 2012Multi Party Distributed Private Matching, Set Disjointness and Cardinality of Set Intersection with Information Theoretic Security.G. Sathya Narayanan, T. Aishwarya, Anugrah Agrawal, Arpita Patra, Ashish Choudhary and C. Pandu Rangan.CANS 2009Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2572,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:29"
}