{
  "name": "Aisling Ann O'Kane",
  "homepage": "https://research-information.bris.ac.uk/en/persons/aisling-a-okane",
  "status": "success",
  "content": "Aisling A O'Kane - University of Bristol View Scopus Profile Dr Aisling A O'Kane BASc, MSc, PhD Associate Professor of Human-Computer Interaction for Health, School of Computer Science https://orcid.org/0000-0001-8219-8126 Emaila.okanebristol.acuk BS8 1UB Personal profile Research interestsMy research focuses on understanding how health and wellbeing technologies are used (and not used!) in the wild. I employ qualitative and participatory design approaches to studies of interactive technologies such as fitness apps, medical devices, and wearable technologies. Past and current studies include the examination of the use of Type 1 Diabetes devices, mobile phone apps for running, wearables in the gym, hearing aids, and high tech wearable baby monitors. I have also started to examine the practices and the trends of people designing, building and sharing do-it-yourself health and wellbeing technologies, particularly for Type 1 Diabetes. External positionsVisiting Research Fellow, University College London1 Aug 2017 → … Research Groups and ThemesBristol Interaction Group Fingerprint Dive into the research topics where Aisling A O'Kane is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Machine Learning Computer Science 100% Learning System Computer Science 96% Wearable Technology Computer Science 93% Mental Health Psychology 85% Self-Management Psychology 85% Self-Care Psychology 80% Artificial Intelligence Computer Science 78% Wellbeing Psychology 76% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 33 Conference Contribution (Conference Proceeding) 16 Article (Academic Journal) 2 Other Conference Contribution 1 Other chapter contribution 2 More 1 Conference Paper 1 Other contribution Research output per year Research output per year Bridging Context and Culture: Designing Cross-Cultural Solutions for Type 2 Diabetes Care in NigeriaArueyingho, T., O'Kane, A. A., Marshall, P., Aprioku, J. S., Webb, H. & Shivam, R., 7 Jul 2025, DIS 2025 - Proceedings of the 2025 ACM Designing Interactive Systems Conference. Association for Computing Machinery (ACM)Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Creatively Supporting Mental Wellbeing: A Tangible Toolkit to Scaffold Self-Tracking through Mindful ColouringYu, J., Ayobi, A., Marshall, P. & O'Kane, A. A., 4 Mar 2025, Proceedings of the Nineteenth International Conference on Tangible, Embedded, and Embodied Interaction. Association for Computing Machinery (ACM), 23Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Open Access Lived Experience 100% Diverse Background 100% Felt Experience 100% Mood 100% Mental Health 66% Designing Okuma: A Digital Health Tool for Type 2 Diabetes in NigeriaArueyingho, T., O'Kane, A. A., Marshall, P., Aprioku, J. S., Nkwo, M. S. & Shivam, R., 4 Nov 2025, AfriCHI '25: Proceedings of the 5th African Human Computer Interaction Conference. Association for Computing Machinery (ACM), p. 1-22 22 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Open Access Maturity Onset Diabetes of the Young 100% Digital Health 100% Western Context 100% Design Solution 100% Non Insulin Dependent Diabetes Mellitus 100% View all 54 research outputs Projects 2 Active 4 Finished Projects per year Transforming the Objective Real-world measUrement of Symptoms (TORUS)Craddock, I. J. (Principal Investigator), O'Kane, A. A. (Co-Investigator), Whone, A. L. (Co-Investigator), Masullo, A. (Co-Investigator), Morgan, C. A. M. (Co-Investigator), Oikonomou, G. (Co-Investigator), Mirmehdi, M. (Co-Investigator), Santos-Rodriguez, R. (Co-Investigator), McConville, R. (Co-Investigator) & Dong, S. (Researcher)1/10/23 → 30/09/28Project: Research, Parent Annotation 100% Artificial Intelligence 100% Activity Recognition 33% Ergonomics 33% CenSoF: ESRC Centre for Sociodigital FuturesHalford, S. (Principal Investigator), Southerton, D. (Co-Investigator), Manchester, H. (Co-Investigator), Evans, D. M. (Co-Investigator), Watson, D. L. (Co-Investigator), Anderson, B. (Co-Investigator), Cater, K. F. (Co-Investigator), Carver, N. (Co-Investigator), Clarke, P. H. (Co-Investigator), Dermott, E. (Co-Investigator), Facer, K. (Co-Investigator), Hauert, S. (Co-Investigator), Liu, W. (Co-Investigator), Liveley, G. (Co-Investigator), McQuillan, D. (Co-Investigator), O'Kane, A. A. (Co-Investigator), Owen, R. (Co-Investigator), Parker, M. (Co-Investigator), Preist, C. W. (Co-Investigator), Schien, D. (Co-Investigator), Sriprakash, A. (Co-Investigator), Milivojevic, S. (Co-Investigator), Hussain, R. (Co-Investigator), Gutierrez Lopez, M. (Researcher), Cheilan, L. (Researcher), Thomas, L. M. (Researcher), Van Isacker, T. (Researcher), Valladares Celis, C. (Researcher), Atkins, E. (Student), Knight, E. W. (Student), Pykett, J. (Co-Investigator), Pitts, H. (Co-Investigator), Williamson, B. (Co-Investigator), Lagedamont, M. (Co-Investigator), Dowse, M. (Researcher), Brand, J. F. (Student), James, R. (Student), Okafo, D. (Student), Horsley, N. (Researcher), Jansen, A. H. (Administrator), Stevenson, T. P. (Other ), Hill, J. M. (Manager), Abu-Aisheh, R. (Researcher), Bo, H. (Researcher), Hemming, R. (Researcher), Huang, L. (Researcher) & Ward, K. J. (Other )1/05/22 → 30/04/27Project: Research, Parent Sociology 100% Justice 100% Social Practice 100% Temporal 100% Climate Change 83% The opportunities for using physiological data in AI-based closed-loop systems for young adults with T1D in the UK Armstrong, M. E. G. (Principal Investigator), Abdallah, Z. S. (Co-Investigator) & O'Kane, A. A. (Co-Investigator)1/12/23 → 1/06/24Project: Research Physiological Data 100% Artificial Intelligence 100% Feedback Control 100% Closed Loop Systems 100% Blood Glucose Level 25% View all 6 projects Datasets BrisT1D-Restricted DatasetJames, S. G. (Creator), Armstrong, M. (Creator), O'Kane, A. (Creator), Emerson, H. (Creator) & Abdallah, Z. (Creator), University of Bristol, 10 Apr 2025DOI: 10.5523/bris.yonrplcb4bvi2vhhn2ehtmpey, http://data.bris.ac.uk/data/dataset/yonrplcb4bvi2vhhn2ehtmpeyDataset Prizes Collaborate to Innovate 2020, Healthcare & Medical WinnerO'Kane, A. A. (Recipient), Marshall, P. (Recipient), Ayobi, A. (Recipient), Stawarz, K. (Recipient), Flach, P. A. (Recipient), Santos-Rodriguez, R. (Recipient) & Yamagata, T. (Recipient), 4 Feb 2021Prize: Prizes, Medals, Awards and Grants Diabetes 100% CSCW 2021 Honorary MentionAyobi, A. (Recipient), Stawarz, K. (Recipient), Katz, D. (Recipient), Marshall, P. (Recipient), Yamagata, T. (Recipient), Santos-Rodriguez, R. (Recipient), Flach, P. A. (Recipient) & O'Kane, A. A. (Recipient), 14 Oct 2021Prize: Prizes, Medals, Awards and Grants File Diabetes 100% Activities 1 Participation in workshop, seminar, course Activities per year Workshop on Transparency and Explanations in Smart Systems (TEXSS)Eardley, R. (Participant), Soubutts, E. (Participant), Ayobi, A. (Participant), Gooberman-Hill, R. J. S. (Participant) & O'Kane, A. A. (Participant)13 Apr 2021Activity: Participating in or organising an event types › Participation in workshop, seminar, course",
  "content_length": 7625,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:31"
}