{
  "name": "Aixin Sun",
  "homepage": "https://www3.ntu.edu.sg/home/axsun",
  "status": "success",
  "content": "Aixin Sun homepage Top Dr. Sun Aixin is an Associate Professor and Associate Dean (Undergraduate Education) at the College of Computing and Data Science (CCDS), Nanyang Technological University (NTU), Singapore, where he has been a faculty member since 2005. He received his B.A.Sc. (First Class Honours) in Computer Engineering and his Ph.D. from NTU in 2001 and 2004, respectively. His research interests include information retrieval, recommender systems, and natural language processing (NLP). He has published around 300 papers, which have garnered over 24,000 citations and an h-index of 70, according to Google Scholar. His work has earned several accolades, including the SIGIR 2025 Test of Time Honorable Mention Award, the Best Student Paper Award at the IEEE International Conference on Services Computing in 2020, and a Best Student Paper Honorable Mention at SIGIR 2016. Dr. Sun is an associate editor for ACM Transactions on Information Systems (TOIS), ACM Transactions on Recommender Systems (TORS), ACM Transactions on Intelligent Systems and Technology (TIST), and an editorial board member of the Journal of the Association for Information Science and Technology (JASIST). He has held significant conference roles, including Doctoral Consortium co-chair for WSDM2023, demonstration track co-chair for SIGIR2020, ICDM2018, and CIKM2017, PC co-chair for AIRS2019, and general chair for ADMA2017. Email: axsun AT ntu DOT edu DOT sg Phone: (+65) 6790 5139 Office: N4-2C-102 Professional services Associate Editor and Editorial Board Member: ACM Transactions on Recommender Systems (TORS), Feb 2025 -- Present ACM Transactions on Information Systems (TOIS), Aug 2022 -- Present ACM Transactions on Intelligent Systems and Technology (TIST), June 2024 -- Present Journal of the Association for Information Science and Technology (JASIST), Jan 2018 -- Present ACM Transactions on Asian and Low-Resource Language Information Processing (TALLIP), Aug 2023 -- Dec 2024 Information Retrieval Journal, Springer, Oct 2017 -- Dec 2023 Neurocomputing, Aug 2018 -- May 2025 Conference organization and PC members: 2025: Action Editor for ARR (ACL, EACL, NAACL), SIGIR (AC, and PC for Perspectives Paper Track), RecSys (SPC), NeurIPS (AC for Datasets and Benchmarks Track) 2024: WWW (Search Track Co-Chair). Action Editor for ARR (ACL, EACL, NAACL), SIGIR (SPC, and PC for Perspectives Paper Track), RecSys (SPC), NeurIPS (AC for Datasets and Benchmarks Track) 2023: EMNLP (Publication Chair), SIGIR (SPC, and PC for Perspectives Paper Track), WWW (SPC), IJCAI (AC), WSDM (DC Co-Chair), NeurIPS (AC for Datasets and Benchmarks Track), SIGIR-AP (SPC) 2022: WWW (SPC), IJCAI (SPC), ECIR, SIGIR(SPC, and PC for Perspectives Paper Track), KDD (PC for Applied Data Science Track) Recent papers A Flexible and Scalable Framework for Video Moment Search Chongzhi Zhang, Xizhou Zhu, Aixin Sun. SIGIR-AP 2025 IR TVR-Ranking: A Dataset for Ranked Video Moment Retrieval with Imprecise Queries Renjie Liang, Chongzhi Zhang, Li Li, Jing Wang, Xizhou Zhu, Aixin Sun. SIGIR-AP 2025 IR A Survey of Real-World Recommender Systems: Challenges, Constraints, and Industrial Perspectives Kuan Zou, Aixin Sun. Working paper RecSys Towards Storage-Efficient Visual Document Retrieval: An Empirical Study on Reducing Patch-Level Embeddings Yubo Ma, Jinsong Li, Yuhang Zang, Xiaobao Wu, Xiaoyi Dong, Pan Zhang, Yuhang Cao, Haodong Duan, Jiaqi Wang, Yixin Cao, Aixin Sun. ACL 2025 Findings IR NLP Punctuation Restoration: A Case Study of BERT-Based Models' Task-Specific Excellence Qishuai Zhong and Aixin Sun. IEEE ICASSP 2025. NLP MMLONGBENCH-DOC: Benchmarking Long-context Document Understanding with Visualizations Yubo Ma, Yuhang Zang, Liangyu Chen, Meiqi Chen, Yizhu Jiao, Xinze Li, Xinyuan Lu, Ziyu Liu, Yan Ma, Xiaoyi Dong, Pan Zhang, Liangming Pan, Yu-Gang Jiang, Jiaqi Wang, Yixin Cao, and Aixin Sun. NeurIPS2024 D&B NLP IR SciAgent: Tool-augmented Language Models for Scientific Reasoning Yubo Ma, Zhibin Gou, Junheng Hao, Ruochen Xu, Shuohang Wang, Liangming Pan, Yujiu Yang, Yixin Cao, Aixin Sun. EMNLP 2024. Accepted NLP Right Tool, Right Job: Recommendation for Repeat and Exploration Consumption in Food Delivery Jiayu Li, Aixin Sun, Weizhi Ma, Peijie Sun and Min Zhang. RecSys 2024 Accepted RecSys Not All Videos Become Outdated: Short-Video Recommendation by Learning to Deconfound Release Interval Bias Lulu Dong, Guoxiu He and Aixin Sun. RecSys 2024 Accepted. RecSys Knowledge-Enhanced Conversational Recommendation via Transformer-based Sequential Modelling Jie Zou, Aixin Sun, Cheng Long, Evangelos Kanoulas. TOIS 2024. RecSys On Context Utilization in Summarization with Large Language Models Mathieu Ravaut, Aixin Sun, Nancy F. Chen, Shafiq Joty. ACL 2024. NLP IR Towards Verifiable Generation: A Benchmark for Knowledge-aware Language Model Attribution. Xinze Li, Yixin Cao, Liangming Pan, Yubo Ma, Aixin Sun. ACL 2024 Findings. NLP Parameter-Efficient Conversational Recommender System as a Language Processing Task Mathieu Ravaut, Hao Zhang, Lu Xu, Aixin Sun, Yong Liu. EACL 2024. NLP RecSys DiffuRec: A Diffusion Model for Sequential Recommendation Zhihao Li, Aixin Sun, Chenliang Li. ACM TOIS: 42(3), Article 66. May 2024. RecSys DP-GCN: Node Classification by Connectivity and Local Topology Structure on Real-World Network Zhe Chen, Aixin Sun. ACM TKDD. Accepted 2004. DM IR Large Language Model Is Not a Good Few-shot Information Extractor, but a Good Reranker for Hard Samples! Yubo Ma, Yixin Cao, Yong Ching Hong, Aixin Sun. EMNLP 2023 Findings. NLP IR Selected publications » News Sept 2025. Aixin gave a keynote on Multimodality Recommender Systems at the DaQuaMRec workshop, RecSys2025, Prague Sept 2025. Our team has two papers accepted at SIGIR-AP 2025, both addressing ranked video moment retrieval: one on the TVR-Ranking dataset, and the other on the Flexible and Scalable Framework July 2025. Our paper \"Time-Aware Point-of-Interest Recommendation\" received the Test of Time Honorable Mention Award at SIGIR 2025. July 2025. Aixin gave a keynote on Visual Document Understanding at the NIP@IR Workshop, SIGIR2025, Padava, Italy May 2025. Thrilled to learn that our DecayPop algorithm is the top performer on Yambda-5B — a massive dataset of ~5 billion user-item interactions from Yandex! Read more Publications Most of recent papers are here Research Team My research team and projects Datasets Datasets used in our research Teaching An instructor and tutor Revisit Recommender Systems A Survey of Real-World Recommender Systems: Challenges, Constraints, and Industrial Perspectives Working paper A Task-Centric Perspective on Recommendation Tasks Working paper Our Model Achieves Excellent Performance on MovieLens: What Does it Mean? TOIS 2024. Take a Fresh Look at Recommender Systems from an Evaluation Standpoint. SIGIR 2023 A Critical Study on Data Leakage in Recommender System Offline Evaluation. TOIS 2023 A Re-visit of the Popularity Baseline in Recommender Systems. SIGIR 2020 (Short paper) Ranked Video Moment Retrieval (RVMR) A Flexible and Scalable Framework for Video Moment Search SIGIR-AP 2025 TVR-Ranking: A Dataset for Ranked Video Moment Retrieval with Imprecise Queries SIGIR-AP 2025 Temporal Sentence Grounding in Videos: A Survey and Future Directions. TPAMI 2023 Span-based Localizing Network for Natural Language Video Localization ACL 2020",
  "content_length": 7387,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:30"
}