{
  "name": "Ajay Jena",
  "homepage": "https://cse.kiit.ac.in/profiles/ajay-kumar-jena",
  "status": "success",
  "content": "Ajay Kumar jena - KIIT School of Computer Engineering Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Ajay Kumar jena Ajay Kumar jena Ajay Kumar jena Assistant ProfessorDr. Ajay Kumar Jena is working as Assistant Professor in the School of Computer Engineering, KIIT Deemed to be University. He has obtained his Master degree in Computer Science and Engineering from BPUT, Rourkela and received his Ph. D. degree from KIIT Deemed to be University in 2015. He has contributed more than 30 papers in various journals and conferences of international repute. He has also contributed three book chapters in international published edited volumes. Dr. Jena has 14 years of experience in teaching to under graduate and post-graduate students of Computer Science and Engineering in different engineering colleges and 9 years of research experience. He has worked as Sr. Lecturer in College of Engineering, Bhubaneswar and Central Institute of Plastics Engineering and Technology (CIPET), Bhubaneswar from 2010 to 2013. He has edited two books for Springer international publication. He has served as Organizing Chair and Committee member of different International Conferences, Workshops, Symposium etc. He is associated with different international bodies as Editorial/Reviewer board member for various journals and conferences. He has already supervised seven master students and guiding three Ph. D. scholars. He is also associated with various educational and research societies like ISCA, CSI, IAENG etc. His research interest includes Software Testing, Machine Learning, Soft Computing, Data Mining, Bio-informatics etc. Profile LinksEmail :[email protected]Scopus Id :36620382800 Social LinksProfileRecent PublicationsProfileResearch Interests Software Testing Machine Learning Soft Computing Data Mining Bio-informatics Administrative ResponsibilityFIC Time TableAwards & Honours Machine Learning, Bhadrak Autonomous College, Government of Odisha, March 1stMembershipsISCA, IAENGRecent PublicationsJournals/Conferences :Jena, A. K., Swain, S. K., & Mohapatra, D. P. (2014, February). A novel approach for test case generation from UML activity diagram. In Issues and challenges in intelligent computing techniques (ICICT), 2014 international conference on (pp. 621-629). IEEE. Das, H., Jena, A. K., Nayak, J., Naik, B., & Behera, H. S. (2015). A novel PSO based back propagation learning-MLP (PSO-BP-MLP) for classification. In Computational Intelligence in Data Mining-Volume 2 (pp. 461-471). Springer, New Delhi. Behera, R. K., Sahoo, A. K., & Jena, A. (2017). A Resourceful Approach in Security Testing to Protect Electronic Payment System Against Unforeseen Attack. International Journal of Open Source Software and Processes (IJOSSP), 8(3), 24-48. Das, H., Jena, A. K., Rath, P. K., Muduli, B., & Das, S. R. (2015). Grid computing-based performance analysis of power system: a graph theoretic approach. In Intelligent Computing, Communication and Devices (pp. 259-266). Springer, New Delhi. Jena, A. K., Swain, S. K., & Mohapatra, D. P. (2015). Model Based Test Case Generation from UML Sequence and Interaction Overview Diagrams. In Computational Intelligence in Data Mining-Volume 2 (pp. 247-257). Springer, New Delhi. Jena, A. K., Swain, S. K., & Mohapatra, D. P. (2015). Model-based test-suite minimization using modified condition/decision coverage (mc/dc). International Journal of Software Engineering and its Applications, 9(5), 61-74. Jena, A. K., Swain, S. K., & Mohapatra, D. P. (2015). Test case creation from UML sequence diagram: a soft computing approach. In Intelligent Computing, Communication and Devices (pp. 117-126). Springer, New Delhi. Jena, A. K., Swain, S. K., & Mohapatra, D. P. (2015). TEST CASE GENERATION AND PRIORITIZATION BASED ON UML BEHAVIORAL MODELS. Journal of Theoretical and Applied Information Technology, 78(3), 336. Nayak, J., Naik, B., Jena, A. K., Barik, R. K., & Das, H. (2018). Nature Inspired Optimizations in Cloud Computing: Applications and Challenges. In Cloud Computing for Optimization: Foundations, Applications, and Challenges (pp. 1-26). Springer, Cham. Sahani, R., Rout, C., Badajena, J. C., Jena, A. K., & Das, H. (2018). Classification of Intrusion Detection Using Data Mining Techniques. In Progress in Computing, Analytics and Networking (pp. 753-764). Springer, Singapore. Das, H., Jena, A. K., Badajena, J. C., Pradhan, C., & Barik, R. K. (2018). Resource Allocation in Cooperative Cloud Environments. In Progress in Computing, Analytics and Networking (pp. 825-841). Springer, Singapore. sachi2020-05-31T16:49:14+05:30 Page load link Go to Top",
  "content_length": 4671,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:32"
}