{
  "name": "Ajay K. Gupta 0001",
  "homepage": "https://www.cs.wmich.edu/~gupta",
  "status": "success",
  "content": "Dr. Ajay Gupta's Home Page Home About Me Research Publications Teaching WiSe Lab Gallery Conferences Ajay Gupta Professor IEEE-CS TAC Vice-Chair (2022-24) IEEE-CS TMRC Member (2013 - ) IEEE-CS TAC Vice-Chair (2015-16) IEEE-CS TCPP Chair (2011-2015) Director, WiSe Lab Graduate Program Director Western Michigan University Dept. of Computer Science Mail Stop 5466 4601 Campus Drive Kalamazoo, MI, 49008-5466 Phone: 269-276-3101 / 3104 Fax: 269-276-3122 E-Mail: ajay dot gupta at wmich dot edu https://orcid.org/0000-0001-7881-4010 Follow @AGuptaKalamazoo Ajay Gupta Ph.D. Purdue University, 1989 Ajay Gupta is a Professor of Computer Science at Western Michigan University. From 1998 to 2002, he was the Chairman of the Computer Science Department at Western Michigan University. Dr. Gupta received his Ph.D. in Computer Science from Purdue University in 1989, his M.S. in Mathematics and Statistics from the University of Cincinnati in 1984, and his B.E. (Honors) in Electrical and Electronics Engineering from Birla Institute of Technology and Sciences, Pilani, India in 1982. Dr. Gupta's research interests include high performance computing, proteogenomics, data analytics, machine learning, sensor systems, cloud computing, mobile computing, web technologies, computer networks, evolutionary computation, scientific computing, and design and analysis of parallel and distributed algorithms. He has published numerous technical papers and book chapters in refereed conferences and journals in these areas. A paper he co-authored, “A Parallel Peptide Indexer and Decoy Generator for Crux Tide using OpenMP” received Best Paper nomination at the 14th International Conference on High Performance Computing and Simulation in 2016. Co-authored paper, \"Adaptive Integration Using Evolutionary Strategies,\" won the Best Paper award in the International Conference on High Performance Computing in 1996. Another paper he co-authored, \"Lightweight Intrusion Detection for Sensor Networks,\" received Honorable mention at the CERIAS Information Security Symposium in 2006. He also holds joint copyright for the parallel and distributed automatic numerical integration software package, ParInt 1.1. Dr. Gupta is a senior member of the IEEE and member of the IEEE Computer Society, the IEEE Communications Society, the ASEE and the ACM. He actively helps organize various ACM and IEEE conferences. He is also involved in the global efforts to revise undergraduate and graduate computer science and computer engineering curriculums to keep pace with the technological advances. Computer Science   | Wireless Sensor Networks Laboratory  |  College of Engineering & Applied Sciences Copyright @Western Michigan University | This site is best viewed with Firefox",
  "content_length": 2749,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:33"
}