{
  "name": "Ajitha Rajan",
  "homepage": "http://homepages.inf.ed.ac.uk/arajan",
  "status": "success",
  "content": "Ajitha Rajan - Home Ajitha Rajan Personal Chair of Software Testing & Verification School of Informatics University of Edinburgh Email: arajan@ed.ac.uk Research I am a Professor (Personal Chair of Software Testing and Verification) at the School of Informatics, University of Edinburgh. My background includes postdoctoral positions at Oxford University and Laboratoire d'Informatique de Grenoble. I completed my PhD in Computer Science at the University of Minnesota (Aug 2009) under Prof. Mats Heimdahl. My research focuses on two main directions: Automated Software Testing — Test input generation, test oracles, and coverage Biomedical AI — Cancer survival models, interpretability for biological sequences & medical images I'm actively recruiting PhD students with strong programming and research skills in either software testing/program analysis/compilers (C++/Python) or explainability for NLP/CV with familiarity in bioinformatics. Teaching Software Testing (ST) — 3rd year UG (JUnit, practical testing concepts) Introduction to Software Engineering (Inf2C-SE) — 2nd year UG Open Positions Fully funded PhD positions (UK/EU); exceptional overseas students may be considered. I also supervise CDT-funded students — see below for links. EPSRC CDT in Machine Learning Systems UKRI AI CDT for Biomedical Innovation UKRI AI CDT for Responsible NLP UKRI CDT in Dependable & Deployable AI for Robotics Current Funded Projects MANIFEST (2024–2028) — Cancer Immunotherapy Response Research Platform led by Francis Crick Institute (MRC funded) Huawei Joint Lab project (2024–2026) — RobustCheck: Testing Robustness of Compiler Optimisations and Deep Learning Frameworks Royal Society Industry Fellowship (2022–2025) — AutoTest: Testing AV perception on hardware accelerators (industry collaboration: Codeplay Ltd.) KATY (2021–2025) — Edinburgh Lead PI — Clinical knowledge for personalised medicine for renal cancer (Horizon 2020 funded) Research Group Current PhD students & Postdocs Amy Rafferty — Explainable AI for medical image analysis Yulin Jin — Scenario-based testing for autonomous driving Piyush Borole — Explainable AI for Biomedical Applications Hans-Cristof Gasser — Tunable Immune Visibility in Protein Design Nardiena Pratima — Explainable AI for Brian MRI diagnosis Past Students & Alumni Panos Stratis — Software test suite compilation & execution optimisations Vanya Yaneva — Accelerating test executions on GPUs Chao Peng — Test generation & coverage for GPU programs Sefa Akca — Automated testing of smart contracts on blockchains Foivos Tsimpourlas — Machine learning for compiler optimisations Tongjie Wang — Multimodal Survival Analysis for Glioma Nick Louloudakis — Automated testing of Deep Learning Frameworks Xiaoliang Wu — Robustness and Explainability in Automatic Speech Recognition and Speaker Verification Selected Projects AutoTest (Royal Society Industry Fellowship) — Testing autonomous vehicle perception safety on hardware accelerators (Codeplay collaboration). Fully funded PhD studentship available. KATY (H2020) — AI for Genomics and Personalised Medicine; Edinburgh Lead PI; focus on clinical knowledge & NLP for renal cancer. EPSRC Trustworthy Autonomous Systems Node — Governance and regulation; UAVs and medical diagnostics focus. Recent News 2025 Highlights June 2025 — ACM SIGSOFT Distinguished Reviewer Award, ISSTA 2025 July 2025 — Paper accepted at Machine Learning for Healthcare: \"Can interpretability and accuracy coexist in cancer survival analysis?\" (Piyush Borole et al.) June 2025 — \"Go-Oracle\" accepted at ESEM 2025 (Foivos Tsimpourlas et al.) June 2025 — Best Paper Award at ICHI 2025 May 2025 — Multiple acceptances: IJCAI, XAI, EASE, ICHI and other venues (see publication page for details) 2024 Promoted to Professor (Chair in Software Testing & Verification). SICSA Best Supervisor Award. Publications in ICSE, ICASSP, Communications Biology, and others.",
  "content_length": 3916,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:36"
}