{
  "name": "Ajit A. Diwan",
  "homepage": "https://www.cse.iitb.ac.in/~aad",
  "status": "success",
  "content": "Home page of Ajit A Diwan Ajit A Diwan Professor Department of Computer Science and Engineering Indian Institute of Technology Powai, Mumbai 400076, India Phone No: 5767720 E-mail: aad@cse.iitb.ac.in Education and Career Research Interests Recent Publications Courses I offer Recent M. Tech Projects Ph.d Students Education and Career B.Tech - IIT Bombay, 1983 Ph.D - TIFR Bombay, 1989 Faculty in IIT Bombay since 1988 Research Interests Graph theory, Combinatorics, Algorithms Recent Publications Decomposing graphs with girth at least 5 under degree constraints, J. Graph Theory, Vol. 33(4), April 2000. Disconnected 2-factors in planar cubic bridgeless graphs, J. Combinatorial Theory, Ser B, Vol. 84(2), March 2002. Plane triangulations are 6-partitionable (with Manish P. Kurhekar), Discrete Mathematics, Vol. 256(1), September 2002. Degree condition for vertex-disjoint paths On 2-factors in powers of connected graphs (with Narendra Agarwal) Triangle-factors in powers of graphs (with Narendra Agarwal), presented at R. C. Bose Centenary Symposium, I.S.I, Dec 2002, Electronic Notes in Discrete Mathematics, Vol. 15 Partitioning 2-connected graphs into connected subgraphs Coloured matchings in edge-coloured graphs (with Ch. Sobhan Babu) Red-Blue cliques in edge-coloured graphs A generalization of Mader's theorem Edge-disjoint paths with three terminals (with Namrata Tholiya) Non-separating trees in connected graphs(with Namrata Tholiya, revised version appears in Discrete Mathematics) Cycles of even lengths modulo k (revised version appears in Journal of Graph Theory) Balanced group-labeled graphs (with Manas Joglekar, Nisarg Shah)(revised version appears in Discrete Math.) Preliminary version presented at ICRTGC, Cochin 2010. Slides P_3-decomposition of Directed Graphs Decomposing semi-complete multigraphs and directed graphs into paths of length two Subdivisions of maximal 3-degenerate graphs of order d+1 in graphs of minimum degree d (revised version appears in Journal of Graph Theory). Explicit Δ-edge-coloring of consecutive levels in a divisor lattice(revised version appears in Discrete Mathematics). Another simple reformulation of the four color theorem (a presentation based on this) Chords of 2-factors in planar cubic bridgeless graphs (revised version appears in Graphs and Combinatorics). Clique factors in powers of graphs (with Aniruddha Joshi). Colouring planar graphs with a precoloured induced cycle. Cycles of weight divisible by $k$ Courses that I Generally offer Design and Analysis of Algorithms Algorithms and Complexity Discrete Structures Combinatorics Applied Algorithms Data Structures and Algorithms Operations Research Recent M.Tech projects Subdivisions of Graphs (Namrata Tholiya) 2-factors in powers of connected graphs (Narendra Agarwal) Partitioning a Graph into connected parts (Manish Kurhekar) Separating Matchings (Trivikram Nayak and Sobhan Babu) Minimum Level Graph Drawings (C.J.Cibu) Ph.D students Upward Planar Drawings of Graphs (M. Chandramouli) Locally connected Planar Graphs (N. Usharani) Degree Conditions for Subgraphs (Ch. Sobhan Babu) CS301",
  "content_length": 3117,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:34"
}