{
  "name": "Ajit V. Rajwade 0001",
  "homepage": "https://www.cse.iitb.ac.in/~ajitvr",
  "status": "success",
  "content": "Ajit Rajwade Ajit Rajwade Office Address: KR-118, KReSIT Building, IIT Powai, Mumbai 400076 Email: Phone(O): +91-22-2576-7981 Teaching Research Publications News/Awards/Talks Students/Postdocs Misc. Who am I? I am a Professor in the Department of Computer Science and Engineering, IIT Bombay. I am also part of Centre for Machine Intelligence and Data Science and the Koita Centre for Digital Health at IIT Bombay. I started working as a faculty member at IITB since July 2013. I defended my PhD thesis in 2010 in the Department of Computer and Information Science and Engineering at the University of Florida, Gainesville. I have a bachelor's degree in computer engineering from the University of Pune, India, and a master's degree in computer science from McGill University, Montreal, Canada. I worked as a postdoctoral researcher in the Electrical and Computer Engineering Department at Duke University, Durham, North Carolina between Jan 2011 and July 2012. Curriculum Vitae Click here for my CV. Notes for (Potential) Students I am currently looking out for motivated and enthusiastic PhD/MS students, interested broadly in my areas of research in AI/ML, which involve the following: theoretical analysis of neural networks for inverse problems such as image reconstruction (from corrupted or undersampled measurements) image reconstruction algorithms: tomography, cryo-electron microscopy, MRI, diffusion MRI compressed sensing: theory, algorithms, applications image/video compression and restoration (removal of noise, blur, camera shake, occlusions, blocking artifacts, reflections, etc.) group testing: theory, algorithms, applications in data science graph learning and graph signal processing disease modelling and model fitting in epidemiology. I am interested in different areas of applied mathematics. Please go through a detailed listing of my research areas and publications. If interested, please email/meet me for any questions. You will be required to apply to the PhD programme of the CSE department at IITB and go through the procedure (including entrance test and interview if shortlisted) outlined. Note to students seeking internships: I do not have any open positions for summer/winter research internships at this point of time. I receive an overwhelming number of requests for internships or summer projects, and I am simply unable to answer them. News/Awards/Talks News 2025 October 2025:Paper accepted in the journal Inverse Problems (IOP). Congratulations to Azhar Tantry, Agnipratim Nag and Vineet Ghule! July 2025: Delivered invited tutorial on Graph Signal Processing and Graph Learning at JTG/IEEE, ITSoc Summer School at IIT Bombay. June/July 2025: Teaching a short summer course on group testing. The course webpage is here. March 2025: Paper on unlabeled sensing accepted to the Transactions of Machine Learning Research (TMLR). Congratulations to Garweet! February 2025: Promoted to rank of Professor in the Department of Computer Science and Engineering at IIT Bombay. February 2025: New pre-print for a fast technique of LASSO debiasing and debiased confidence intervals. 2024 December 2024: Two papers accepted to ICASSP 2025. Congratulations to Kaishva Shah, and Shuvayan Banerjee and Sudhansh Peddabomma! December 2024: Journal paper on theoretical analysis of 2D Unknown-view tomography accepted to Signal Processing (Elsevier). Congratulations to Sheel Shah and Kaishva Shah! September 2024: New pre-print on group testing with errors in group-membership specifications \"Robust Non-adaptive Group Testing under Errors in Group Membership Specifications\", co-authored with Shuvayan Banerjee, Radhendushka Srivastava and James Saunderson August 2024: Received the Prof. S. P. Sukhatme Award for Excellence in Teaching at IIT Bombay (institute-wide award based on cumulative teaching scores over past 10 years). July 2024: Paper accepted to ECCV 2024. Congratulations to Harsh Shah and Kashish Mittal! May 2024: Sabyasachi Ghosh has successfully defended his PhD thesis. Congratulations to Dr. Sabyasachi Ghosh! 2023 December 2023: Paper accepted to IEEE ICASSP. Congratulations to Garweet! December 2023: Paper accepted to the journal Signal Processing (Elsevier). Congratulations to Shuvayan and Sudhansh! November 2023: Appointed as Associate Editor of the journal IEEE Open Journal on Signal Processing. November 2023: Paper accepted to IEEE WACV. Congratulations to Anuj! August 2023: Paper accepted to the journal Signal Processing (Elsevier). Congratulations to Richeek Das! July 2023: Paper accepted to IEEE MLSP 2023. Congratulations to Ashutosh Vaish! May 2023: Paper accepted to EUSIPCO 2023. Congratulations to Pranava Singhal and Waqar Mirza! January 2023: Jerin Geo James has defended his PhD thesis. Congrats Dr. Jerin! 2022 September 2022: Paper accepted to the journal Computers in Biology and Medicine. Congratulations to Ashutosh Vaish! August 2022: Paper accepted to IEEE/CVF WACV 2023. Congratulations to Jerin Geo James! May 2022: Paper accepted to the European Signal Processing Conference (EUSIPCO). Congratulations to Shaan ul Haque! April 2022: Paper accepted to the journal IEEE Transactions on Computational Imaging. Congratulations to Preeti Gopal! January 2022: Paper accepted to the journal Computers in Biology and Medicine (Elsevier). Congratulations to Ashutosh Vaish! 2021 August 2021: Appointed as Handling Editor (Associate Editor) for the journal Signal Processing (Elsevier). June 2021: Our work on Tapestry pooling is in the news again: DCGI approval for the algorithms developed by Manoj's company. June 2021: Delivered tutorial titled \"Signal Processing for Mass Testing in Fighting a Pandemic: A Sampling Theory Perspective\" at ICASSP 2021 held in Toronto, jointly with Prof. Weiyu Xu from University of Iowa, Prof. Chandra Murthy from IISc, Prof. Jonathan Scarlett from NUS. May 2021: A journal paper on penalized estimators for Poisson compressed sensing with variance stabilization transforms has been accepted to Signal Processing (Elsevier). The paper is authored by me and my collaborator Karthik S. Gurumoorthy. May 2021: Paper accepted to IEEE Statistical Signal Processing Workshop 2021. Congratulations to Jian Vora! May 2021: Invited talk on \"Compressed Sensing for Quantitative Pooled COVID-19 Testing\" at the EECS Divisional Symposium, IISc. May 2021: Two papers accepted to European Signal Processing Conference (EUSPICO) 2021. Congratulations to Shuvayan Banerjee, and to Shubhang Bhatnagar and Chinmay Gurjarpadhye. April 2021: Our paper \"A Compressed Sensing Approach to Pooled RT-PCR Testing of COVID-19 Samples\" is now accepted for publication in the IEEE Open Journal on Signal Processing. Congratulations to Sabyasachi Ghosh, to my collaborator Prof. Manoj Gopalkrishnan, and to a large team of undergraduate students who contributed to this work: Rishi Agarwal, Ali Rehan, Shreya Pathak, Pratyush Agarwal, Yash Gupta, Sarthak Consul, Nimay Gupta, Ritika Goyal, and Ritesh Goenka. March 2021: A US Patent on \"Method and electronic device for providing image-based CAPTCHA challenge\" has been granted ! This is joint work with Venkatakrishnan Ramaswamy (now faculty at BITS Hyderabad), my former BTech student Vishal Agarwal and my former MTech student Hc Lalduhbera. January 2021: Two papers accepted to ICASSP 2021 - congratulations to Jian Vora and Ritesh Goenka! January 2021: A detailed article on Tapestry pooling published in Firstpost. 2020 December 2020: Paper accepted to European Conference on Antennas and Propagation (EuCAP 2021). Congratulations to Pranay and Pranshu! December 2020: Journal paper \"Analyzing Cross-validation in Compressed Sensing with Poisson Noise\" accepted to Elsevier Signal Processing. Congratulations to R. Sudarsanan! December 2020: A tutorial titled \"Signal Processing for Mass Testing in Fighting a Pandemic: A Sampling Theory Perspective\" has been selected for ICASSP 2021 to be held in Toronto. This will be delivered by me jointly with Prof. Weiyu Xu from University of Iowa, Prof. Chandra Murthy from IISc, Prof. Jonathan Scarlett from NUS. November 2020: Pre-print on the use of contact tracing for pooling in COVID-19 testing is now available here, as well as on arxiv! This is also supplemental material for an ICASSP 2021 submission. October 2020: Tapestry Pooling is cited in an article published in the bulletin of the American Mathematical Society. July 2020: Our work on pooled testing of COVID-19 samples using compressed sensing has been quoted in the following articles: \"The Mathematics of Mass Testing for COVID-19\", published in the SIAM Newsletter, written by Prof. David Donoho. Prof. David Donoho also quotes our work extensively and prominently in his talk. \"The mathematical strategy that could transform coronavirus testing\", published in the Nature Magazine (Method 4) \"A Compressed Sensing Approach to Group-Testing for COVID-19 Detection\", published in the IEEE Signal Processing Society Newsletter. May 2020: We have two manuscripts on application of compressed sensing to pooling/group of samples for Covid-19 RTPCR testing, submitted to medarxiv and arxiv. This work is in collaboration with Prof. Manoj Gopalkrishnan from EE, IITB and has led to a system called Tapestry. Click here to access the Tapestry website. Tapestry has featured in various news articles: [news article 1], [news article 2], [news article 3]. May 2020: Ashutosh Vaish has a paper accepted at ICIP 2020. Congratulations Ashutosh! March 2020: Paper on low dose tomography with and without use of prior templates, accepted to Elsevier Journal of Signal Processing. Congrats to Dr. Preeti Gopal! Feb 2020: Elevated to position of Senior Member of the IEEE. I am also an affiliate member of the Computational Imaging (CI) Technical Committee; the Image, Video and Multidimensional Signal Processing (IVMSP) Technical Committe; and the Signal Processing Theory and Methods (SPTM) Technical Committee. Feb 2020: Interview published in the \"Inside Signal Pr",
  "content_length": 15140,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:35"
}