{
  "name": "Akash Kumar 0001",
  "homepage": "https://etit.ruhr-uni-bochum.de/fakultaet/professorinnen/prof-dr-akash-kumar",
  "status": "success",
  "content": "Fakultät für Elektrotechnik und Informationstechnik: RUB: Personenmuserseite DE/EN Fakultät ETITFakultätProfessor*innenProf. Dr. Akash Kumar Dekanat Professor*innen Zentrale Einrichtungen Veranstaltungen Chancengleichheit Alumni Marketing Gremien AusbildungProfessorEingebettete SystemeAdresse: Ruhr-Universität Bochum Fakultät für Elektrotechnik und Informationstechnik Eingebettete Systeme Postfach ID 29 Universitätsstraße 150 D-44801 BochumRaum: ID 2/609E-Mail:akash.kumar(at)​​rub.​de (© RUB/Marquard) Lebenslauf seit 2024Inhaber des Lehrstuhls für Eingebettete Systeme, Ruhr-Universität Bochum, Deutschland2015 – 2024Inhaber des Lehrstuhls für Processor Design, TU Dresden, Deutschland2011 – 2015Assistenzprofessor, National University of Singapore (NUS), Singapur2009 – 2011Gastwissenschaftler, National University of Singapore (NUS), Singapur2005 – 2009Eindhoven University of Technology (TUe) and National University of Singapore, \t\t\tDissertationstitel: Analysis, Management and Design of Multimedia Multiprocessor Systems2003 – 2004National University of Singapore and Eindhoven University of Technology (TUe), \t\t\tMaster of Technological Design (Embedded Systems1999 – 2002National University of Singapore (NUS), \t\t\tbeschleunigtes B. Eng. (Computer Engineering) Program, First Class HonoursNach oben Forschung Entwurfsautomatisierung eingebetteter Systeme, Zuverlässigkeitsoptimierung, fehlertolerantes und vorhersagbares Architekturdesign, Näherungsrechnung, elektronische Designautomatisierung für FPGAs und neue Technologie, teilweise rekonfigurierbare Architekturen.Nach oben Projekte Laufende Forschungsprojekte:Lean-MICS: Learning-Based Cross-Layer Reliability Management in Embedded Mixed-Criticality Systems, DFG \tPrincipal Investigator, 04/2024-03/2027SecuREFET-II: Secure circuits through inherent reconfigurable FET-II, DFG Special Priority Program. \tPrincipal Investigator, 04/2024-03/2027Hardware Architecture and Platform for Cognitive Science, Sino German Center \tPrincipal Investigator, 11/2022-10/2025.DART: Design Automation for Reconfigurable Transistors, DFG \tPrincipal Investigator, 9/2022-8/2025X-DNet: Energy-Efficient Distributed and In-Network Computing via Cross-Layer ApproXimation of Applications and Accelerators Software Campus (BMBF) \tPrincipal Investigator, 04/2023-12/2025X-ReAp: Cross(X)-Layer Runtime Reconfigurable Approximate Architecture, DFG \tPrincipal Investigator, 1/2022-12/2024.Nach oben Publikationen Nach oben Lehrveranstaltungen Nach obenRuhr-Universität Bochum Fakultät für Elektrotechnik und Informationstechnik Eingebettete Systeme Postfach ID 29 Universitätsstraße 150 D-44801 BochumSekretariat Raum: ID 2/607 Telefon: (+49) (0) 234 32 - 17542 E-Mail: sekretariat-es@rub.de RUB Lageplan & Anreise Prof. Dr. Akash Kumar Raum: ID 2/609 Telefon: (+49) (0) 234 32 - 15677 E-Mail: akash.kumar(at)rub.de",
  "content_length": 2857,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:38"
}