{
  "name": "Aki Vehtari",
  "homepage": "https://users.aalto.fi/~ave",
  "status": "success",
  "content": "Aki Vehtari Aki Vehtari About Bayesian Workflow Group Publications Case studies Videos Teaching CV-FAQ Aki Vehtari Professor in computational Bayesian modeling at Aalto University Aalto University Department of Computer Science ELLIS Institute Finland FCAI - Finnish Center for Artificial Intelligence Bayesian Workflow Group Contact Office: Konemiehentie 2, 3rd floor, A336 Postal address: P.O. Box 15400, FI-00076 AALTO, FINLAND Email: Aki.Vehtari(at)aalto.fi ORCID ID: 0000-0003-2164-9469 BlueSky: ‪@avehtari.bsky.social‬ Mastodon: bayes.club/@avehtari Research and publications My research interests are Bayesian probability theory and methodology, Bayesian workflow, probabilistic programming, inference methods such as Laplace, EP, VB, MC, inference and model diagnostics, model assessment and selection, Gaussian processes, and hierarchical models. My 15min introduction to my research on computational probabilistic modeling Publications Videos of talks and tutorials Blog postings CV Books Andrew Gelman, and Aki Vehtari (2024). Active Statistics. Cambridge University Press. Publisher’s webpage for the book. Stories, Games, Problems, and Hands-on Demonstrations for Applied Regression and Causal Inference to help build courses based on Regression and Other Stories. Winner of the 2025 PROSE award in Mathematics and Statistics from The Association of American Publishers (AAP). Gelman, Jennifer Hill, and Aki Vehtari (2020). Regression and other stories. Cambridge University Press. Publisher’s webpage for the book. Home page for the book. Back cover text: Many textbooks on regression focus on theory and the simplest of examples. Real statistical problems, however, are complex and subtle. This is not a book about the theory of regression. It is a book about how to use regression to solve real problems of comparison, estimation, prediction, and causal inference. It focuses on practical issues such as sample size and missing data and a wide range of goals and techniques. It jumps right in to methods and computer code you can use fresh out of the box. Andrew Gelman, John B. Carlin, Hal S. Stern, David B. Dunson, Aki Vehtari and Donald B. Rubin (2013). Bayesian Data Analysis, Third Edition. Chapman and Hall/CRC. Winner of the 2016 De Groot Prize from the International Society for Bayesian Analysis (awarded to the author or authors of an outstanding published book in Statistical Science). Publisher’s webpage for the book. Home page for the book. Errata for 3rd edition. Electronic edition for non-commercial purposes only. Online course material, including video lectures, slides, code, and notes for most of the chapters. Software A member of the Stan development team and Stan governing body. Stan is a probabilistic programming language and framework implementing full Bayesian statistical inference. Co-author of R packages loo for efficient approximate leave-one-out cross-validation and stacking projpred for projection predictive variable selection posterior for posterior workflow posteriordb reference posterior database priorsense for prior sensitivity analysis A member of development team of ArviZ - Exploratory analysis of Bayesian models Git repos Teaching Bayesian data analysis (5 cr). All course material online. Case studies",
  "content_length": 3278,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:43"
}