{
  "name": "Akihiko Takano",
  "homepage": "http://www.nii.ac.jp/en/faculty/digital_content/takano_akihiko",
  "status": "success",
  "content": "Akihiko Takano - My portal - researchmap × {{flash.message}} Profile Information AffiliationDirector and Professor, Research Center for Informatics of Association, National Institute of InformaticsProfessor at Dept of CSUniv of TokyoPublisher of Association Press. Degree 博士（理学） J-GLOBAL ID200901017977667460researchmap Member ID1000370105 External linkhttp://rensou-center.cs.nii.ac.jp/ 新潟生まれ、神奈川育ち。東大数学科卒。博士（理学）。電機メーカーに20年間勤務の後、2001年より現職。2002年より東大大学院コンピュータ科学専攻教授併任。NPO連想出版理事長。 専門は関数プログラミング、プログラム変換、連想情報学。研究成果を活用して、WebcatPlus、新書マップ、想・IMAGINE Book Search、Book Town じんぼう、文化遺産オンライン、闘病記ライブラリなどの公開サービスを展開している。 Research Interests 8 Informatics of Association Algebra of Programming Program Transformation Functional Programming 連想情報学 プログラミングの代数 プログラム変換 関数プログラミング Awards 9 Oct, 2013 第二回 岩瀬弥助記念書物文化賞, 「連想情報学・デジタル技術による書物文化の開発」, 西尾市岩瀬文庫 高野明彦 Dec, 2011 第5回 JEPA電子出版アワード ベンチャー・マインド賞, 「e読書ラボ」, 日本電子出版協会 国立情報学研究所 Apr, 2011 文部科学大臣表彰科学技術賞（理解増進部門）, 「連想情報技術による自発的学びのための情報理解増進」, 文部科学省 高野明彦, 丸川雄三 Oct, 2009 ２００９年度グッドデザイン賞, 絵引-絵で引く錦絵アーカイブシステム, 財団法人日本産業デザイン振興会 財団法人渋沢栄一記念財団, 国立情報学研究所連想情報学研究開発センター, PO連想出版 Oct, 2008 ２００８年度グッドデザイン賞（１）, リーフレット型電子企画展表示システム 「国立美術館遊歩館」, 財団法人日本産業デザイン振興会 国立情報学研究所連想情報学研究開発センター, 特定非営利活動法人連想出版 Oct, 2008 ２００８年度グッドデザイン賞（２）, 地域情報発信サイト 「神保町へ行こう」, 財団法人日本産業デザイン振興会 国立情報学研究所連想情報学研究開発センター, 特定非営利活動法人連想出版 Oct, 2008 ２００８年度グッドデザイン賞（３）, 情報検索ポータル 「想-IMAGINE Book Search」, 財団法人日本産業デザイン振興会 国立情報学研究所連想情報学研究開発センター, 特定非営利活動法人連想出版 May, 2008 第6 回東京インタラクティブ・アド・アワード入賞／Powers of Information, インターネット広告推進協議会 国立情報学研究所連想情報学研究開発センター, 特定非営利活動法人連想出版 May, 2008 第6 回東京インタラクティブ・アド・アワード入賞／情報検索ポータル 「想-IMAGINE Book Search」, インターネット広告推進協議会 国立情報学研究所連想情報学研究開発センター, 特定非営利活動法人連想出版 Misc. 16 情報の信頼性を支えるもの 高野明彦 ことばパティオ, 第45回, Apr, 2011 グーグル的なものとどうつき合うか (特集 Googleの思想) 高野 明彦 現代思想, 39(1) 72-85, Jan, 2011 議論のための窓の大きさ 高野 明彦 コンピュータソフトウェア, 27(1) 74-74, Jan, 2010 PORTAと想・IMAGINEの連携について [コメント] 高野明彦 国立国会図書館月報, (574) 31-31, Jan 20, 2009 「ウェブはインデックス空間、メタ情報空間としての役割をになうだろう」（コミュニケーション・デザインのための40 人のキーワード） 高野明彦 IC (Inter Communication), Oct 1, 2008 Google との闘い?文化の多様性を守るために（資料紹介） 高野明彦 専門図書館, (232) 60-61, May, 2008 インタビュー 高野明彦(国立情報学研究所教授) 人と「知の公共財」を「連想」で結ぶ 高野 明彦, 沢辺 均 ず・ぼん, (13) 54-69, Nov, 2007 Association Engine extracts inspiration from contents TAKANO Akihiko Journal of Information Processing and Management, 49(11) 656-658, 2007 古書街でウェブの未来を想う 高野 明彦 図書, (693) 18-21, Jan, 2007 Internet and the reliability of information TAKANO Akihiko Journal of Information Processing and Management, 49(3) 142-144, 2006 Imagine the future Web services strolling around the book town TAKANO Akihiko Journal of Information Processing and Management, 49(7) 392-394, 2006 Y. Futamura : Partial Evaluation of Computation Process : An Approach to a Compiler-Compiler, Systems, Computers, Controls, Vol.2, No.5 (1971), pp.45-50(20世紀の名著名論) 高野 明彦 情報処理, 43(12), Dec 15, 2002 関数型プログラミング特集の編集にあたって (<特集>関数型プログラミング) 井田 哲雄, 高野 明彦, 田中 二郎 コンピュータソフトウェア, 4(4) 299-300, Oct 15, 1987 第40回関数的プログラミング研究会の報告 高野 明彦 コンピュータソフトウェア, 4(2) 168-170, Apr 15, 1987 関数プログラミング・シンポジウム 高野 明彦 コンピュータソフトウェア, 3(3) 291-294, Jul 17, 1986 キーマンインタビュー 国立情報学研究所 高野明彦教授 OnDeck, (2011年5月12日号) Books and Other Publications 7 311情報学――メディアは何をどう伝えたか (叢書 震災と社会) 高野 明彦, 吉見 俊哉, 三浦 伸也 (Role: Joint author) 岩波書店, Aug 30, 2012 (ISBN: 4000285289) NHK ITホワイトボックス 世界一やさしいネット力養成講座 「ネットに弱い」が治る本 (講談社MOOK NHK・ITホワイトボックス) NHK「ITホワイトボックス」プロジェクト 講談社, Sep, 2009 (ISBN: 9784063793819) デジタルコンテンツをめぐる現状報告―出版コンテンツ研究会報告2009 出版コンテンツ研究会, 岩本 敏, 小林 弘人, 佐々木 隆一, 加茂 竜一, 境 真良, 柳 与志夫 ポット出版, Jul 14, 2009 (ISBN: 4780801281) 爆笑問題のニッポンの教養 検索エンジンは脳の夢を見る 連想情報学 (爆笑問題のニッポンの教養 29) 太田 光, 高野 明彦, 田中 裕二 講談社, Nov, 2008 (ISBN: 4062826240) ヒューマン・インフォマティクス―触れる・伝える・究めるデジタル生活情報術 工作舎, Jun, 2005 (ISBN: 4875023863) バイオ・情報の最前線 (丸善ライブラリー) 藤山 秋佐夫, 高野 明彦, 根岸 正光, 安達 淳 丸善, Jun, 2005 (ISBN: 462105371X) 電子ジャーナルで図書館が変わる (情報学シリーズ) 土屋 俊, 高野 明彦, 増田 豊, 安達 淳, 坂上 光明 丸善, Mar, 2003 (ISBN: 4621071807) Presentations 27 \"From Search to Association, bridging the isolated silos of knowledge\" Akihiko Takano The 10th IEEE RIVF International Conference on Computing and Communication Technologies, Nov 12, 2013  Invited \"From search to association: how to bridge the isolated silos of knowledge\" Akihiko Takano 2012 International Council on Archives Congress, Aug 21, 2012  Invited 新しい電子出版はこうなる！～書籍・雑誌をどう変える？～（コーディネーター） 高野明彦 東京国際ブックフェア専門セミナー「電子出版の未来」, Jul 5, 2012 博物館資料の情報化と発信―連想の情報学を中心に 高野明彦 みなとの博物館ネットワークフォーラム通常総会, Jun 15, 2012  Invited 専門図書館は知の蔵をどう繋ぐかー検索から連想へ 高野明彦 専門図書館協議会関東地区協議会定期総会記念講演会, May 25, 2012  Invited 文化遺産オンラインとデジタル・アーカイブについて 高野明彦 「文化遺産オンライン構想」成果報告フォーラム, Dec 2, 2011, 文化庁  Invited 文化情報の整備と活用 高野明彦 シンポジウム「文化情報の整備と活用～デジタル文化財が果たす役割と未来像」, Jul 22, 2011, デジタル文化財創出機構  Invited いま改めて書店について考える－本屋の機能を問い直す 高野明彦 東京国際ブックフェア2011, Jul 9, 2011  Invited 読書環境の未来について 高野明彦 平成23年度通常総会セミナー, Feb 24, 2011, 日本電子出版協会  Invited From Search to Association – How to extract inspiration from data Akihiko Takano Japan-Vietnam Workshop on Software Engineering 2010, Dec, 2010, Vietnum National Univ  Invited From Search to Association – Web service to bridge the isolated silos of knowledge Akihiko Takano International Symposium on the Cooperation among Libraries for East Asian Resources and Chinese Newspaper Digitization, Oct, 2010  Invited 『連想×書棚』で知識の扉を開く 高野明彦 第9回情報科学技術フォーラム, Sep 8, 2010, 電子情報通信学会＋情報処理学会 連想検索：知の蔵を繋ぐための情報サービス 高野明彦 第30回ソフトウェア・シンポジウム, Jun 9, 2010, ソフトウェア技術者協会主催  Invited 知の蔵を繋ぐための情報サービス 高野明彦 「本の未来・未来の本を考える」講演会シリーズ第１回 蔵書全文デジタル化の先に見える図書館の未来, Mar 14, 2010, 国立情報学研究所 百科事典・専門辞典を基点とする情報アクセス 高野明彦 統合学術辞典フォーラム, May 9, 2009, 日本認知科学会 検索から連想へ ?文化的な情報の蓄積を発想力に換える 高野明彦 立命館大学グローバルCOE「日本文化デジタル・ヒューマニティーズ」最終報告会, Mar 1, 2009, 立命館大学  Invited 情報収集の落とし穴 情報の信頼性と情報への適切な視野の確保 高野明彦 日本医師会・情報システム連絡協議会, Feb 14, 2009, 日本医師会 IMAGINE -- Federated Associative Search for Spontaneous Learning [Demonstaration] Akihiko Takano Pacific-Rim Symposium on Image and Video Technology 2009, Jan, 2009 多様な情報源による知の創発を促す「想・IMAGINE」 高野明彦 2008年日本認知科学会・冬のシンポジウム, Dec 20, 2008, 日本認知科学会 検索から連想へ ?文化的な情報の蓄積を発想力に換える 高野明彦 第１回総研大合同フォーラム「未来ある人類社会の構築」, Dec 2, 2008, 総合研究大学院大学 More Teaching Experience 1 プログラミング代数特論  (東大大学院コンピュータ科学専攻) Papers 11 文化的情報の蓄積を発想力に換える「想・IMAGINE」 高野明彦 ACCUニュース, (367) 2-4, May, 2008 文化財情報の発信(アーカイビング利用システム,<特集>デジタルアーカイブ) 丸川 雄三, 高野 明彦 映像情報メディア学会誌 : 映像情報メディア, 61(11) 1573-1577, Nov 1, 2007 連想の情報学--思考と響きあう情報空間 (特集 インターネットと言語研究--情報を選り分け、活用するために) 高野 明彦 言語, 36(7) 70-73, Jul, 2007 検索から連想へ--情報を発想力に変換する連想エンジン (特集 〈検索〉の未来) 高野 明彦 科学, 77(4) 356-361, Apr, 2007 Information access based on association(<Special feature>Trends in technology of information retrieval) TAKANO Akihiko The Journal of Information Science and Technology Association, 54(12) 634-639, Dec 1, 2004 連想に基づく情報空間との対話技術--連想の情報学をめざして (特集 曖昧な世界) 高野 明彦 心理学ワールド, (27) 13-16, Oct, 2004 E-002 XML electronic pocket-size paperback system Yajima Tadahito, Koike Yuji, Takano Akihiko, Kinukawa Hiroyuki 3(2) 115-116, Aug 20, 2004 E-003 The comprehensive electronic document search engine using Web service Koike Yuji, Yajima Tadahito, Takano Akihiko, Kinukawa Hiroshi 3(2) 117-118, Aug 20, 2004 あいまい検索の技術と応用 (特集 インターネット検索技術と日本語研究) 丹羽 芳樹, 高野 明彦 日本語学, 23(2) 44-59, Feb, 2004 Program transformation in calculational form Akihiko Takano, Zhenjiang Hu, Masato Takeichi ACM Computing Surveys, 30(3es), 1998 Shortcut deforestation in calculational form Akihiko Takano, Erik Meijer FPCA 1995, 306-313, 1995 Works 9 国宝や重要文化財を網羅、文化遺産を多様な切り口で検索できる 「文化遺産データベース」 文化庁, 国立情報学研究所 Dec, 2010 Web Service タッチパネルと高精細画像で国宝を鑑賞できる 「Powers of Information 徳川美術館」 徳川美術館, 国立情報学研究所 Nov, 2010 Artistic work タッチパネルと高精細画像で書誌学の世界にふれる 「Powers of Information 斯道文庫」 慶応大学斯道文庫, 国立情報学研究所 Nov, 2010 Artistic work 黒田清輝関係写真アーカイブ 「写真で見る黒田清輝の日常」を一般公開 東京文化財研究所, 国立情報学研究所 Nov, 2010 Artistic work 新Webcat Plus：確かな知識の基点サービス 国立情報学研究所 Jun, 2010 Web Service 実業史錦絵絵引システム 渋沢栄一記念財団, NII連想情報学研究開発センター Jul, 2009 Web Service 連想検索エンジン「GETAssoc」 国立情報学研究所連想情報学研究開発センター Jul, 2009 Software 国立美術館版 想・IMAGINE 国立美術館, NII連想情報学研究開発センター May, 2009 Web Service 早稲田演博版 想・IMAGINE 早稲田大学演劇博物館, NII連想情報学研究開発センター Mar, 2009 Web Service Menu Following You are not following anyone. {{follow.Related.user_name_en}} {{follow.Related.modified}} Updated More",
  "content_length": 8035,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:41"
}