{
  "name": "Akira Kawaguchi",
  "homepage": "https://www.ccny.cuny.edu/profiles/akira-kawaguchi",
  "status": "success",
  "content": "Akira Kawaguchi | The City College of New York Skip to main content > Home / Faculty and Staff Profiles / Akira Kawaguchi Akira Kawaguchi (Professor) Department Chair Program Co-Chair Main Affiliation Computer Science Additional Departments/Affiliated Programs Computer Engineering Graduate Center Areas of Expertise/Research Data Management Database Modeling Metadata Data Science Data Analytics Data Visualization Augmented Reality Building North Academic Center Office 8/206 Phone (212) 650-6631 (212) 650-6015 Fax (212) 650-6248 Email akawaguchi@ccny.cuny.edu Website https://www-cs.ccny.cuny.edu/~akira Akira Kawaguchi Profile Akira Kawaguchi (川口明 in Japanese notation) is a full professor, currently serving as Chair of Computer Science and Co-Chair of Computer Engineering Programs. He received his B.E. and M.E. degrees in Administration Engineering from Keio University in the city of Yokohama, Japan, and M.S., M.Phil, and Ph.D. degrees in Computer Science from Columbia University in the city of New York. He worked for seven years at Mitsubishi Heavy Industries, Ltd as an assistant manager in its Tokyo Head Office, acquired Mitsubishi's two-year fellowship for his graduate studies in the U.S., and left Japan with a one-way ticket to New York. He devoted himself to the forefront of database research, which resulted in his lifelong collaborations with researchers in Columbia, Bell Labs, AT&T Labs, IBM Research, and various Japanese industries. After finishing his dissertation in 1997, he joined the Department of Computer Science at the City College of New York and the CUNY Graduate Center, where he became one of a small and invaluable class of scholars with the ability to build an intellectual bridge between the U.S. and Far East countries. Professor Kawaguchi's primary research interests center around areas of database and transaction processing systems. He will take students with outstanding math backgrounds -- wishing to develop next-generation software systems together. Education Ph.D. in Computer Science, February 1998, Columbia University, New York, NY. M.S. in Computer Science, May 1990, Columbia University. M.E. in Administration Engineering, March 1981, Keio University, Yokohama, Japan. B.E. in Administration Engineering, March 1979, Keio University. Courses Taught Information Architectures: Data Engineering Principles (graduate), System Analysis & Design (graduate), Object-Oriented Design & Software Engineering (graduate), Introduction to Software Engineering (undergraduate). Database and Transaction Processing systems: Advanced Database Systems (graduate), Database Systems graduate), Database Management (graduate), Introduction to Database Systems (undergraduate), Senior Design I (undergraduate), Senior Design II (undergraduate). Programming Principles: Advanced C++ Programming (undergraduate), Internet Programming (undergraduate), Software Design Laboratories (undergraduate), Data Structures (undergraduate), Introduction to Computing (undergraduate), Introduction to Programming and Computer Science (undergraduate). Basic Theories: Discrete Math (undergraduate), Algorithms (undergraduate), Research Interests Publications listed at Google Scholar Entry Conducting research in the area of software systems, with focus on database and transaction processing. Recent achievements are roughly grouped into the categories below, all of which involve demonstrative implementations: Highly Distributed Data Processing on Programmable Overlay Networks: distributed data processing requires a combination of computing platforms providing effective data networking as well as architectural extension of cloud computing with more flexibility than that found in conventional networks by allowing the integration of a massive number of components and services. This effort focuses on the analysis of performance gain in dynamic systems, i.e., highly distributed data and service environments built and deployed on programmable overlay networks. Such a distributed and dynamic modeling is an enabler of more advanced solutions that need lightning-fast responses from data processing engines, e.g., machine learning gives us the ability to extend the reach of analytics to encompass not just data but also images, video, facial expressions, human speech and other sources of insight. Engineered Network Paradigm: investigating areas in the context of engineered networks: 1) alignment of logical networks with physical substrates, 2) network vulnerability, and 3) security. The alignment issue is quite challenging as a theoretical question, so we would concentrate on developing acceptable heuristic solutions such as we have proposed in the hypercube case. Network vulnerability would be approached from the perspective of potential attacks that threaten to break a network into several isolated components – we proposes to attack this problem by elaborating a sound and practical definition of vulnerability introduced in our previous work. The security part of the research would focus on variations of network coding that can take advantage of known independent paths in an engineered network. In principle this offers an alternative to encryption that has the advantage of using far less bandwidth. Distributed Query Optimization: examines the problem of join query optimization in a Dynamic Distributed Federated Database and the role that network topology, specifically an engineered hypercube, could play in the cost estimation. Considering that many nodes in this environment may rely on batteries and wireless radios, we would like to minimize network information transfer to maximize network availability and lifetime. While in any topology it may be assumed a querying node can estimate distance to data sources, in an unknown topology, the querying node has no knowledge of intersite distances. In a hypercube, these distances can be easily calculated at the querying node based on the sites' labels. What is more, query optimization in the past has not fully taken account of the topology of networks as a cost factor in executing joins. We are conducting a quantitative evaluation of distributed query performance that takes account of network topology. Data-warehouse and Decision Support: emphases on data quality investigation and enhancement of decision support. Involved in interdisciplinary research work with civil engineering, biomedical engineering, and biology for the development of specialized data-warehouses such as deterioration rate analysis for NYS bridge data elements, asset inventory and internal inspection ratings for NYC water pipe maintenance, wireless biometric data collection capabilities for diabetes care, and easy retrieval of genes whose expression is altered by parasitoid infections. The most recent work spans into mathematical characterizations of database errors and the effect of error propagation in decision support as well as integration of operations research tools into decision making. A new subject in more traditional side, entitled distributed query processing on hypercube network, is also in progress. Recent Press Coverage [Click image for full article] Shaping the Digital Tomorrow: CCNY's Computer Science Department, February 21, 2024 The digital horizon is a vast one, with new branches of study frequently emerging for professionals to gain entry to. Computer science attracts new students each year as more and more employers seek out the latest digital assets.” Keeping the Department of Computer Science's research activities in step with these advances has been a top priority for Dr. Akira Kawaguchi, the department chair.... CCNY partners with top Japanese institutions and Columbia, October 27, 2023 The City College of New York's Grove School of Engineering is partnering with three leading Japanese institutes and Columbia University on a mission to innovate 5G/6G communications by developing a Floating Cyber Physical System (F-CPS). Kyushu Institute of Technology (Kyutech), KDDI Research, Inc., and the National Institute of Information and Communications Technology (NICT) are The City College's Japanese collaborators... Announcing New NSF Award for CCNY Program, October 18, 2023 Preparing for a future in which artificial intelligence (AI), networked systems, autonomous vehicles (AVs) and connected AVs (CAVs) are integral to society, The City College of New York is launching an international program to train select students in mastering Avs. The three-year project in partnership with Turkey's Istanbul Technical University (ITU) and California-based autonomous bus company ADASTEC Corp... Announcing the 2019 NYC Tech Innovators, February 21, 2020 The City College of New York's Akira Kawaguchi, chair of the Department of Computer Science at The Grove School of Engineering, is named the 2019 NYC Tech Innovator from the NYC Tech Talent Pipeline. Kawaguchi and his team are recognized for their efforts in doubling the number of students graduating annually with tech-related bachelor's degrees through the CUNY 2X Tech initiative... Launching Innovative Data Science Track, January 17, 2020 Connecting the Dots (CTD) is a highly collaborative project between the flagship schools in the City University of New York (CUNY) system and the State University of New York (SUNY). The three-year $400,000 grant from NSF supports the creation of the signature academic data science track-the New York Data Science Scholars Program. It will be capable of being readily integrated with any engineering major and effectively complement existing computer science majors at both the undergraduate and graduate levels... Google grant helps Grove School create pipeline for women in STEM, September 16, 2019 The Grove School of Engineering's Department of Computer Science at The City College of New York is creating a pipeline to college for female New York City high school students interested in computer science. The initiative is made possible by an $18,000 gift from G",
  "content_length": 12672,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:40"
}