{
  "name": "Akshay Narayan 0001",
  "homepage": "https://akshayn.xyz",
  "status": "success",
  "content": "Akshay Narayan Akshay Narayan I am an assistant professor at Brown University. My research is in computer systems and networking, and focuses on ways to make specialization for network environments accessible. Toward this goal, I develop new abstractions to help applications cope with both unpredictable bandwidth allocations in the modern Internet, as well as with modern dynamic network environments as software and hardware trends drive increased network variability and complexity. Before this, I was a postdoctoral researcher at UC Berkeley/ICSI in the NetSys lab, and before that I was a graduate student at MIT working with Hari Balakrishnan and Mohammad Alizadeh. My thesis described new abstractions to help applications cope with modern dynamic network environments as software and hardware trends drive increased network variability and complexity. During graduate school, I was supported by an NSF Graduate Research Fellowship. I previously received a Irwin Mark Jacobs and Joan Klein Jacobs Presidential Fellowship. Prior to graduate school, I was a research assistant at NetSys working with Sylvia Ratnasamy and Scott Shenker. Before that, I was an undergrad at UC Berkeley, from which I graduated with High Honors in 2015. These are links to my CV, GitHub page, and SSH Public Key. If you want to contact me, you can do so via Keybase, Mastodon, or Email ([email protected]). ★ I maintain a list of some good coffee places. Working With Me I am currently recruiting PhD students, though I am usually interested in working with students at all levels and postdocs. If you are already at Brown, please email me. Otherwise, I unfortunately cannot respond to most emails. For prospective Brown students, I recommend simply submitting an application and mentioning me in it. For prospective postdocs, please email me, though I tend to have narrow research area requirements for postdoc positions. Note that using the email address listed above is more likely to elicit a response. Teaching CSCI 1675: Designing High-Performance Network Systems Fall 2025, Spring 2025 CSCI 2680: Computer Networks and the Internet Spring 2026, Fall 2024 Publications \"Kernel Extension DSLs Should Be Verifier-Safe!\" Franco Solleza, Justus Adam, Akshay Narayan, Malte Schwarzkopf, Andrew Crotty, Nesime Tatbul eBPF 2025 [Paper][Program] [BibTex ✎] @inproceedings{bql, title = {{ Kernel Extension DSLs Should Be Verifier-Safe! }}, author = { Franco Solleza and Justus Adam and Akshay Narayan and Malte Schwarzkopf and Andrew Crotty and Nesime Tatbul }, year = { 2025 }, booktitle = { eBPF }, doi = { 10.1145/3748355.3748368 }, }\"Lightweight Automated Reasoning for Network Architectures\" Rahul Bothra, Venkat Arun, Brighten Godfrey, Akshay Narayan, Ahmed Saeed HotNets 2024 [Paper][Conference Program] [BibTex ✎] @inproceedings{bothra-2024, title = {{ Lightweight Automated Reasoning for Network Architectures }}, author = { Rahul Bothra and Venkat Arun and Brighten Godfrey and Akshay Narayan and Ahmed Saeed }, year = { 2024 }, booktitle = { HotNets }, doi = { 10.1145/3696348.3696865 }, }\"Reverse-Engineering Congestion Control Algorithm Behavior\" Margarida Ferreira, Ranysha Ware, Yash Kothari, Inês Lynce, Ruben Martins, Akshay Narayan, Justine Sherry IMC 2024 [Paper][Conference Program] [BibTex ✎] @inproceedings{abagnale, title = {{ Reverse-Engineering Congestion Control Algorithm Behavior }}, author = { Margarida Ferreira and Ranysha Ware and Yash Kothari and Inês Lynce and Ruben Martins and Akshay Narayan and Justine Sherry }, year = { 2024 }, booktitle = { IMC }, doi = { 10.1145/3646547.3688443 }, }\"Principles for Internet Congestion Management\" Lloyd Brown, Albert Gran Alcoz, Frank Cangialosi, Akshay Narayan, Mohammad Alizadeh, Hari Balakrishnan, Eric Friedman, Ethan Katz-Bassett, Arvind Krishnamurthy, Michael Schapira, Scott Shenker SIGCOMM 2024 [Paper][Slides][Conference Program][IETF 121 ICCRG] [BibTex ✎] @inproceedings{rcs, title = {{ Principles for Internet Congestion Management }}, author = { Lloyd Brown and Albert Gran Alcoz and Frank Cangialosi and Akshay Narayan and Mohammad Alizadeh and Hari Balakrishnan and Eric Friedman and Ethan Katz-Bassett and Arvind Krishnamurthy and Michael Schapira and Scott Shenker }, year = { 2024 }, booktitle = { SIGCOMM }, doi = { 10.1145/3651890.3672247 }, }\"How I Learned to Stop Worrying About CCA Contention\" Lloyd Brown, Yash Kothari, Akshay Narayan, Arvind Krishnamurthy, Aurojit Panda, Justine Sherry, Scott Shenker Hotnets 2023 [Paper][Slides][Conference Program] [BibTex ✎] @inproceedings{cca-contention, title = {{ How I Learned to Stop Worrying About CCA Contention }}, author = { Lloyd Brown and Yash Kothari and Akshay Narayan and Arvind Krishnamurthy and Aurojit Panda and Justine Sherry and Scott Shenker }, year = { 2023 }, booktitle = { Hotnets }, doi = { 10.1145/3626111.3628204 }, }\"The Case for an Internet Primitive for Fault Localization\" William Sussman, Emily Marx, Venkat Arun, Akshay Narayan, Mohammad Alizadeh, Hari Balakrishnan, Aurojit Panda, Scott Shenker Hotnets 2022 [Paper][Conference Program] [BibTex ✎] @inproceedings{wtf, title = {{ The Case for an Internet Primitive for Fault Localization }}, author = { William Sussman and Emily Marx and Venkat Arun and Akshay Narayan and Mohammad Alizadeh and Hari Balakrishnan and Aurojit Panda and Scott Shenker }, year = { 2022 }, booktitle = { Hotnets }, doi = { 10.1145/3563766.3564105 }, }\"Elasticity Detection: A Building Block for Internet Congestion Control\" Prateesh Goyal, Akshay Narayan, Frank Cangialosi, Srinivas Narayana, Mohammad Alizadeh, Hari Balakrishnan SIGCOMM 2022 [Paper][ACM DL][Conference Program] [BibTex ✎] @inproceedings{nimbus, title = {{ Elasticity Detection: A Building Block for Internet Congestion Control }}, author = { Prateesh Goyal and Akshay Narayan and Frank Cangialosi and Srinivas Narayana and Mohammad Alizadeh and Hari Balakrishnan }, year = { 2022 }, booktitle = { SIGCOMM }, doi = { 10.1145/3544216.3544221 }, }\"Counterfeiting Congestion Control Algorithms\" Margarida Ferreira, Akshay Narayan, Inês Lynce, Ruben Martins, Justine Sherry Hotnets 2021 [Paper][Talk][Conference Program] [BibTex ✎] @inproceedings{mr880, title = {{ Counterfeiting Congestion Control Algorithms }}, author = { Margarida Ferreira and Akshay Narayan and Inês Lynce and Ruben Martins and Justine Sherry }, year = { 2021 }, booktitle = { Hotnets }, doi = { 10.1145/3484266.3487381 }, }\"Site-to-Site Internet Traffic Control\" Frank Cangialosi, Akshay Narayan, Prateesh Goyal, Radhika Mittal, Mohammad Alizadeh, Hari Balakrishnan EuroSys 2021 Awarded Best Artifact! [Paper][Long Talk][Short Talk][Conference Program][SIGOPS Blog Post][P-RECS 2022] [BibTex ✎] @inproceedings{bundler, title = {{ Site-to-Site Internet Traffic Control }}, author = { Frank Cangialosi and Akshay Narayan and Prateesh Goyal and Radhika Mittal and Mohammad Alizadeh and Hari Balakrishnan }, year = { 2021 }, booktitle = { EuroSys }, doi = { 10.1145/3447786.3456260 }, }\"Bertha: Tunneling through the Network API\" Akshay Narayan, Aurojit Panda, Mohammad Alizadeh, Hari Balakrishnan, Arvind Krishnamurthy, Scott Shenker Hotnets 2020 [Paper][Slides][Talk Video][Conference Program] [BibTex ✎] @inproceedings{bertha-hotnets, title = {{ Bertha: Tunneling through the Network API }}, author = { Akshay Narayan and Aurojit Panda and Mohammad Alizadeh and Hari Balakrishnan and Arvind Krishnamurthy and Scott Shenker }, year = { 2020 }, booktitle = { Hotnets }, doi = { 10.1145/3422604.3425927 }, }\"Park: An Open Platform for Learning-Augmented Computer Systems\" Hongzi Mao, Parimarjan Negi, Akshay Narayan, Hanrui Wang, Jiacheng Yang, Haonan Wang, Ryan Marcus, Ravichandra Addanki, Mehrdad Khani Shirkoohi, Songtao He, Vikram Nathan, Frank Cangialosi, Shaileshh Venkatakrishnan, Wei-Hung Weng, Song Han, Tim Kraska, Mohammad Alizadeh NeurIPS 2019 [Paper][ICML 2019 RL4RL Workshop][Conference Program] [BibTex ✎] @inproceedings{park, title = {{ Park: An Open Platform for Learning-Augmented Computer Systems }}, author = { Hongzi Mao and Parimarjan Negi and Akshay Narayan and Hanrui Wang and Jiacheng Yang and Haonan Wang and Ryan Marcus and Ravichandra Addanki and Mehrdad Khani Shirkoohi and Songtao He and Vikram Nathan and Frank Cangialosi and Shaileshh Venkatakrishnan and Wei-Hung Weng and Song Han and Tim Kraska and Mohammad Alizadeh }, year = { 2019 }, booktitle = { NeurIPS }, doi = { 10.5555/3454287.3454511 }, }\"Restructuring Endpoint Congestion Control\" Akshay Narayan, Frank Cangialosi, Deepti Raghavan, Prateesh Goyal, Srinivas Narayana, Radhika Mittal, Mohammad Alizadeh, Hari Balakrishnan SIGCOMM 2018 [Cited as motivation for congestion control support in eBPF!] [Paper][Slides PDF][Session Video][Conference Program][Linux NetDev 0x12][ANRW 2018 Poster][Poster Listing] [BibTex ✎] @inproceedings{ccp, title = {{ Restructuring Endpoint Congestion Control }}, author = { Akshay Narayan and Frank Cangialosi and Deepti Raghavan and Prateesh Goyal and Srinivas Narayana and Radhika Mittal and Mohammad Alizadeh and Hari Balakrishnan }, year = { 2018 }, booktitle = { SIGCOMM }, doi = { 10.1145/3230543.3230553 }, }\"Sincronia: Near-Optimal Network Design for Coflows\" Saksham Agarwal, Shijin Rajakrishnan, Akshay Narayan, Rachit Agarwal, David Shmoys, Amin Vahdat SIGCOMM 2018 Awarded Best Student Paper! [Paper][Conference Program] [BibTex ✎] @inproceedings{sincronia, title = {{ Sincronia: Near-Optimal Network Design for Coflows }}, author = { Saksham Agarwal and Shijin Rajakrishnan and Akshay Narayan and Rachit Agarwal and David Shmoys and Amin Vahdat }, year = { 2018 }, booktitle = { SIGCOMM }, doi = { 10.1145/3230543.3230569 }, }\"The Case for Moving Congestion Control Out of the Datapath\" Akshay Narayan, Frank Cangialosi, Prateesh Goyal, Srinivas Narayana, Mohammad Alizadeh, Hari Balakrishnan HotNets 2017 [Paper][Slides PDF][Conference Program] [BibTex ✎] @inproceedings{ccp-hotnets, title = {{ The Case for Moving Congestion Control Out of the Datapat",
  "content_length": 11731,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:41"
}