{
  "name": "Akshayaram Srinivasan",
  "homepage": "https://www.cs.toronto.edu/~akshayaram",
  "status": "success",
  "content": "Akshayaram Srinivasan - University of Toronto About Me I am a faculty member in the Department of Computer Science at the University of Toronto, and the Department of Mathematical and Computational Sciences at the University of Toronto, Mississauga. I am a member of the Theory Group. Before joining U of T, I was at the Tata Institute of Fundamental Research, Mumbai. Previously, I obtained my Ph.D. in Computer Science from University of California, Berkeley, where I was fortunate to be advised by Prof. Sanjam Garg. Before that, I completed my undergraduate studies in Computer Science and Engineering at the Indian Institute of Technology, Madras. Research My research focuses on the foundational aspects of cryptography, with a particular focus on the following topics. Secure Multiparty Computation (MPC) Exploring protocols that allow multiple parties to jointly compute a function over their private inputs without revealing anything except the output. Zero-Knowledge Proofs Investigating methods where one party can prove to another that a statement is true, without revealing any information beyond the veracity of the statement itself. Post-Quantum Cryptography Developing cryptographic systems that are resistant to attacks by quantum computers. Publications 2025 Obfuscating Pseudorandom Functions is Post-Quantum Complete Pedro Branco, Abhishek Jain, and Akshayaram Srinivasan. TCC 2025. [PDF] Pseudorandom Correlation Generators for Multiparty Beaver Triples over F_2 Peihan Miao, Alice Murphy, Akshayaram Srinivasan, and Max Tromanhauser. ASIACRYPT 2025. [PDF] Rate-1 Statistical Non-Interactive Zero-Knowledge Pedro Branco, Nico Döttling, and Akshayaram Srinivasan. CRYPTO 2025. [PDF] Simultaneous-Message and Succinct Secure Computation Elette Boyle, Abhishek Jain, Sacha Servan-Schreiber, and Akshayaram Srinivasan. EUROCRYPT 2025. [PDF] Black-Box Non-Interactive Zero-Knowledge from Vector Trapdoor Hash Pedro Branco, Arka Rai Choudhuri, Nico Döttling, Abhishek Jain, Giulio Malavolta, and Akshayaram Srinivasan. EUROCRYPT 2025. [PDF] 2024 Secure Computation with Parallel Calls to 2-ary Functions Varun Narayanan, Shubham Vivek Pawar, and Akshayaram Srinivasan. TCC 2024. [PDF] Two-Round Maliciously-Secure Oblivious Transfer with Optimal Rate Pedro Branco, Nico Döttling, and Akshayaram Srinivasan. EUROCRYPT 2024. [PDF] Rate-1 Fully Local Somewhere Extractable Hashing from DDH Pedro Branco, Nico Döttling, Akshayaram Srinivasan, and Riccardo Zanotto. PKC 2024. [PDF] 2023 Round-Optimal Black-Box MPC in the Plain Model Yuval Ishai, Dakshita Khurana, Amit Sahai, and Akshayaram Srinivasan. CRYPTO 2023. [PDF] Secure Computation with Shared EPR Pairs (Or: How to Teleport in Zero-Knowledge) James Bartusek, Dakshita Khurana, and Akshayaram Srinivasan. CRYPTO 2023. [PDF] Reusable Secure Computation in the Plain Model Vipul Goyal, Akshayaram Srinivasan, and Mingyuan Wang. CRYPTO 2023. [PDF] A Framework for Statistically Sender Private OT with Optimal Rate Pedro Branco, Nico Döttling, and Akshayaram Srinivasan. CRYPTO 2023. [PDF] Black-Box Reusable NISC with Random Oracles Yuval Ishai, Dakshita Khurana, Amit Sahai, and Akshayaram Srinivasan. EUROCRYPT 2023. [PDF] 2022 Round-Optimal Black-Box Secure Computation from Two-Round Malicious OT Yuval Ishai, Dakshita Khurana, Amit Sahai, and Akshayaram Srinivasan. TCC 2022. [PDF] Fully-Secure MPC with Minimal Trust Yuval Ishai, Arpita Patra, Sikhar Patranabis, Divya Ravi, and Akshayaram Srinivasan. TCC 2022. [PDF] SNARGs for P from Sub-exponential DDH and QR James Hulett, Ruta Jawale, Dakshita Khurana, and Akshayaram Srinivasan. EUROCRYPT 2022. [PDF] Round-Optimal Black-Box Protocol Compilers Yuval Ishai, Dakshita Khurana, Amit Sahai, and Akshayaram Srinivasan. EUROCRYPT 2022. [PDF] [video] Reusable Two-Round MPC from LPN James Bartusek, Sanjam Garg, Akshayaram Srinivasan, and Yinuo Zhang. PKC 2022. [PDF] Bounded Indistinguishability for Simple Sources Andrej Bogdanov, Krishnamoorthy Dinesh, Yuval Filmus, Yuval Ishai, Avi Kaplan, and Akshayaram Srinivasan. ITCS 2022. [PDF] 2021 On the Round Complexity of Black-Box Secure MPC Yuval Ishai, Dakshita Khurana, Amit Sahai, and Akshayaram Srinivasan. CRYPTO 2021. [PDF] [video] Three-Round Secure Multiparty Computation from Black-Box Two-Round Oblivious Transfer Arpita Patra and Akshayaram Srinivasan. CRYPTO 2021. [PDF] Improved Computational Extractors and Their Applications Dakshita Khurana, and Akshayaram Srinivasan. CRYPTO 2021. [PDF] Traceable Secret Sharing and Applications Vipul Goyal, Yifan Song, and Akshayaram Srinivasan. CRYPTO 2021. [PDF] [video] Muse: Secure Inference Resilient to Malicious Clients Ryan Lehmkuhl, Pratyush Mishra, Akshayaram Srinivasan, and Raluca Ada Popa. USENIX Security Symposium 2021. [PDF] Multi-Source Non-Malleable Extractors and Applications Vipul Goyal, Akshayaram Srinivasan, and Chenzhi Zhu. EUROCRYPT 2021. [PDF] 2020 Nearly Optimal Robust Secret Sharing against Rushing Adversaries Pasin Manurangsi, Akshayaram Srinivasan, and Prashant Nalini Vasudevan. CRYPTO 2020. [PDF] [video] Separating Two-Round Secure Computation from Oblivious Transfer Benny Applebaum, Zvika Brakerski, Sanjam Garg, Yuval Ishai, and Akshayaram Srinivasan. ITCS 2020. [PDF] Delphi: A Cryptographic Inference Service for Neural Networks Pratyush Mishra, Ryan Lehmkuhl, Akshayaram Srinivasan, and Raluca Ada Popa. USENIX Security Symposium 2020. [PDF] 2019 Unconditionally Secure Computation Against Low-Complexity Leakage Andrej Bogdanov, Yuval Ishai, and Akshayaram Srinivasan. CRYPTO 2019. (Invited to Journal of Cryptology) [PDF] [video] Leakage Resilient Secret Sharing and Applications Akshayaram Srinivasan and Prashant Nalini Vasudevan. CRYPTO 2019. [PDF] [video] Revisiting Non-Malleable Secret Sharing Saikrishna Badrinarayanan and Akshayaram Srinivasan. EUROCRYPT 2019. [PDF] [video] 2018 Two-Round MPC: Information-Theoretic and Black-Box Sanjam Garg, Yuval Ishai, and Akshayaram Srinivasan. TCC 2018. [PDF] A Simple Construction of iO for Turing Machines Sanjam Garg and Akshayaram Srinivasan. TCC 2018. [PDF] Round Optimal Black-Box \"Commit-and-Prove\" Dakshita Khurana, Rafail Ostrovsky, and Akshayaram Srinivasan. TCC 2018. [PDF] Two-Round Multiparty Secure Computation Minimizing Public Key Operations Sanjam Garg, Peihan Miao, and Akshayaram Srinivasan. CRYPTO 2018. [PDF] Adaptive Garbled RAM from Laconic Oblivious Transfer Sanjam Garg, Rafail Ostrovsky, and Akshayaram Srinivasan. CRYPTO 2018. [PDF] [video] Two-Round Multiparty Secure Computation from Minimal Assumptions Sanjam Garg and Akshayaram Srinivasan. EUROCRYPT 2018. (Best paper award) [PDF] [video] Adaptively Secure Garbling with Near Optimal Online Complexity Sanjam Garg and Akshayaram Srinivasan. EUROCRYPT 2018. [PDF] [video] 2017 Garbled Protocols and Two-Round MPC from Bilinear Maps Sanjam Garg and Akshayaram Srinivasan. FOCS 2017. [PDF] [video] Efficiently Obfuscating Re-Encryption Program under DDH Assumption Akshayaram Srinivasan and C. Pandu Rangan. ACNS 2017. [PDF] Breaking the Sub-exponential Barrier in Obfustopia Sanjam Garg, Omkant Pandey, Akshayaram Srinivasan, and Mark Zhandry. EUROCRYPT 2017. [PDF] [video] New Constructions of Non-Malleable Commitments and Applications Vipul Goyal, Ashutosh Kumar, Sunoo Park, Silas Richelson, and Akshayaram Srinivasan. Manuscript. [PDF] 2016 Single-Key to Multi-Key Functional Encryption with Polynomial Loss Sanjam Garg and Akshayaram Srinivasan. TCC 2016-B. [PDF] [video] Secure Obfuscation in a Weak Multilinear Map Model Sanjam Garg, Eric Miles, Pratyay Mukherjee, Amit Sahai, Akshayaram Srinivasan, and Mark Zhandry. TCC 2016-B. [PDF] Revisiting the Cryptographic Hardness of Finding a Nash Equilibrium Sanjam Garg, Omkant Pandey, and Akshayaram Srinivasan. CRYPTO 2016. [PDF] [video] 2015 Stronger Public-Key Encryption Withstanding RAM Scraper like Attacks S. Sree Vivek, S. Sharmila Deva Selvi, Akshayaram Srinivasan, C. Pandu Rangan. Special issue on Provable Security, Journal of Security and Communication Networks. [PDF] Certificateless Proxy Re-Encryption Without Pairing: Revisited Akshayaram Srinivasan, C. Pandu Rangan. SCC@ASIACCS 2015. [PDF] Awards Google India Research Award - 2022. Crypto 2019: Paper invited to the Journal of Cryptology. Eurocrypt 2018: Best paper award. Teaching I am passionate about teaching the fundamental concepts of computer science and cryptography. Here are some of the courses I have taught or am currently teaching: Data Structures and Analysis Winter 2025 at U of T Winter 2024 at U of T Fundamentals of Cryptography Fall 2023 at U of T Fall 2021 at TIFR Fall 2020 at TIFR Cryptography from Lattices Fall 2025 at U of T Fall 2022 at TIFR Students I am fortunate to work with talented and dedicated students. Current Students Ziyang Jin Siddharth Agarwal Ratnakar Medepalli (co-advised at TIFR) Alumni Naty Peter - Postdoctoral Fellow Yug Shah - MScAC I am always looking for motivated students interested in cryptography and theoretical computer science. If you are interested in working with me, please review my research interests and feel free to reach out. Service Program Committee Memberships 2025: Crypto, TCC 2024: Eurocrypt, ITC, Asiacrypt 2023: TCC 2022: PKC, Crypto, Asiacrypt 2021: PKC 2020: Indocrypt Editorial Board Memberships Communications in Cryptology Contact Feel free to reach out with any inquiries. Email: akshayaram [at] cs [dot] toronto [dot] edu Office: SF 3322 (View on Map) Google Scholar LinkedIn DBLP",
  "content_length": 9487,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:42"
}