{
  "name": "Alain Darte",
  "homepage": "http://perso.ens-lyon.fr/alain.darte",
  "status": "success",
  "content": "Alain Darte home page Alain Darte Directeur de recherche au CNRS. Laboratoire de l'Informatique du Parallélisme. Équipe Compsys: Compilation et systèmes enfouis. Click here for an english version. La page de Compsys Activités de recherche Publications dans des journaux Publications dans des conférences Thèse(s) Rapports de recherche Cours de Master 2012 Adresses La page de CPC2000 Petite liste de liens plaisants Erratum au livre Scheduling and Automatic Parallelization ou, tout ce que vous avez toujours voulu savoir sur la détection des boucles parallèles (sans oser le demander)! Erratum au recueil Algorithmique et optimisation, exercices corrigés ou, tout ce que vous avez toujours voulu savoir pour rentrer aux ENS par la filière informatique! Activités de recherche Mes activités de recherche concernent les problèmes d'optimisation liés à l'analyse, à la parallélisation et aux transformations automatiques de programmes, plus précisément des portions de code ayant une structure répétitive, comme par exemple ceux formés de boucles. Pour donner une vue rapide de mes centres d'intérêt passés, voici une liste des thèmes principaux que j'ai abordés: Parallélisation automatique et transformations de code de haut niveau, notamment détection de parallélisme au niveau des boucles et compilation de (et vers) High Performance Fortran; Optimisations de code au niveau assembleur (pipeline logiciel, allocation de registres, forme SSA); Conception automatique de réseaux systoliques et d'accélérateurs matériels. Dans l'étude de ces trois thèmes qui se recoupent, par les modèles, les outils mathématiques ou les optimisations qu'ils mettent en oeuvre, je me suis intéressé plus spécifiquement: aux systèmes d'équations récurrentes uniformes ; aux algorithmes d'ordonnancement, principalement de graphes cycliques; à la recherche de boucles parallèles, de boucles permutables et au \"tiling\"; à la fusion de boucles et au décalage d'instructions; aux optimisations liées à l'allocation de tableaux multi-dimensionnels et au repliement mémoire; aux techniques de partitionnement régulier; aux différentes phases de l'allocation de registres, vidage en mémoire, élimination de copies (instruction \"move\"), coloration; à la forme SSA (static single assignment), construction, destruction, propriétés. Au travers de ces thèmes spécifiques, le dessein de mon travail est double: a) mener un effort théorique de formalisation dans le domaine de la compilation et plus particulièrement des optimisations de code, b) développer des techniques de compilation et les pousser dans le domaine de la génération automatique d'accélérateurs matériels, domaine qui n'est pas encore à un stade de maturité permettant l'automatisation, mais qui est un candidat potentiel pour cette automatisation. Thèse et habilitation \"Techniques de parallélisation automatique de nids de boucles\". PhD93-07 \"De l'organisation des calculs dans les codes répétitifs\". HDR1999-03 Adresse de travail Alain Darte, CNRS Laboratoire de l'Informatique du Parallélisme École normale supérieure de Lyon 46, Allée d'Italie 69007 Lyon, France FAX: (+33) (0)4 72 72 80 80 Tél: (+33) (0)4 72 72 89 01 Email: Alain.Darte@ens-lyon.fr Adresse personnelle 42, rue Saint Jean 69005 Lyon, France Retour à la page principale de l'ENS-Lyon. Retour au début de cette page. Dernière modification: juin 2010",
  "content_length": 3357,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:45"
}