{
  "name": "Alain Desire Bigirimana",
  "homepage": "https://pure.qub.ac.uk/en/persons/alain-desire-bigirimana",
  "status": "success",
  "content": "Alain Desire Bigirimana - Queen's University Belfast View Scopus Profile Alain Desire Bigirimana Dr Lecturer, School of Electronics, Electrical Engineering and Computer Science https://orcid.org/0000-0001-5017-4971 EmailA.Bigirimanaqub.acuk Accepting PhD Students 20172022 Research activity per year Personal profile Fingerprint Dive into the research topics where Alain Desire Bigirimana is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 1 Similar Profiles Brain-Computer Interface Neuroscience 100% Posttraumatic Stress Disorder Neuroscience 78% Electroencephalography Neuroscience 78% Neurotechnology Neuroscience 50% Neurofeedback Neuroscience 47% Sensorimotor Rhythm Medicine and Dentistry 39% Assessment Medicine and Dentistry 39% Disorders of Consciousness Medicine and Dentistry 39% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2017 2017 2019 2020 2021 2022 2022 3 Article 1 Chapter 1 Conference contribution Research output per year Research output per year Electroencephalography and psychological assessment datasets to determine the efficacy of a low-cost, wearable neurotechnology intervention for reducing Post-Traumatic Stress Disorder symptom severitydu Bois, N., Bigirimana, A. D., Korik, A., Kéthina, L. G., Rutembesa, E., Mutabaruka, J., Mutesa, L., Prasad, G., Jansen, S. & Coyle, D., 26 Mar 2022, In: Data in Brief. 42, 15 p., 108066.Research output: Contribution to journal › Article › peer-review Open AccessFile Assessment 100% Therapeutic Procedure 100% Symptom 100% Health Care Cost 100% Psychometry 100% 8 Citations (Scopus) 136 Downloads (Pure) Neurofeedback with low-cost, wearable electroencephalography (EEG) reduces symptoms in chronic Post-Traumatic Stress Disorderdu Bois, N., Bigirimana, A. D., Korik, A., Kéthina, L. G., Rutembesa, E., Mutabaruka, J., Mutesa, L., Prasad, G., Jansen, S. & Coyle, D. H., 01 Dec 2021, In: Journal of Affective Disorders. 295, p. 1319-1334 16 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Electroencephalography 100% Posttraumatic Stress Disorder 100% Neurofeedback 100% Treatment 71% Imagery 57% 35 Citations (Scopus) 170 Downloads (Pure) Emotion-Inducing Imagery Versus Motor Imagery for a Brain-Computer InterfaceBigirimana, A. D., Siddique, N. & Coyle, D., 06 Mar 2020, In: IEEE Transactions on Neural Systems and Rehabilitation Engineering. 28, 4, p. 850-859 10 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Computer Interface 100% Emotion 100% Brain-Computer Interface 100% Control 40% Application 20% 28 Citations (Scopus) 48 Downloads (Pure) Towards answering questions in disorders of consciousness and locked-in syndrome with a SMR-BCIDayan, N., Bigirimana, A., McCann, A., Stow, J., McElligott, J., Carroll, A. & Coyle, D., 20 Sept 2019, Proceedings of the 8th Graz Brain Computer Interface Conference 2019: bridging science and application. Müller-Putz, G., Ditz, J. C. & Wriessnegger, S. (eds.). Technische Universität Graz, (Proceedings of the Graz Brain-Computer Interface Conference).Research output: Chapter in Book/Report/Conference proceeding › Chapter Open AccessFile Brain-Computer Interface 100% Sensorimotor Rhythm 100% Locked-in Syndrome 100% Disorders of Consciousness 100% Patient 57% 19 Downloads (Pure) A hybrid ICA-wavelet transform for automated artefact removal in EEG-based emotion recognitionBigirimana, A. D., Siddique, N. & Coyle, D., 09 Feb 2017, 2016 IEEE International Conference on Systems, Man, and Cybernetics, SMC 2016 - Conference Proceedings. Institute of Electrical and Electronics Engineers Inc., p. 4429-4434 6 p. (IEEE International Conference on Systems, Man, and Cybernetics, SMC ).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Wavelet Transforms 100% Artifacts 100% Independent Component Analysis 100% Application 22% Accuracy 22% 18 Citations (Scopus)",
  "content_length": 4324,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:44"
}