{
  "name": "Alan Serrano",
  "homepage": "https://www.brunel.ac.uk/people/alan-serrano",
  "status": "success",
  "content": "Dr Alan Serrano-Rico | Introduction | Brunel University London Skip to Content Home People Dr Alan Serrano-Rico Dr Alan Serrano-RicoReader Wilfred Brown Building 211 Email: alan.edwin.serrano-rico@brunel.ac.uk Tel: +44 (0)1895 266048 Computer Science College of Engineering, Design and Physical Sciences Summary Dr. Alan Serrano is a Reader in the Department of Computer Science at Brunel University London, UK, where he also received his PhD in Information Systems and an MSc in Data Communication Systems. He is now the Chair of the Industry advisory board, Department Industry Lead & Brunel Talent Marketplace Director. Previous to his appointment at Brunel he has worked in industry and public sectors in Mexico for a number of years, in the areas of computer networks and information systems development. His research interest lies in the area of information systems and organisational strategy. More specifically, Dr Serrano focuses on undertaking research that aims to solve the real-life challenges organisations face when adopting information and communication technologies (ICT) in complex environments. Some examples of collaboration with industry includes BMW group in UK, AXA Insurance UK, PepsiCo Latin America, the National Health Service (NHS) in UK, Centrica Energy UK, Jaguar & Land Rover UK, and Standard Chartered UK. Dr Serrano has exposed his work in more than 26 publications in recognised journals and international conferences such as the European Journal of Information Systems, Electronic Markets, the International Journal of Information Management, and the International Journal of Enterprise Information Systems. Qualifications SAP Certified Associate Responsibility It is one of my priorities to make scientific research more accessible and useful for industry and society. To this end I am actively participating with industry and related player. I am the Industry Lead for the department, Chair of the advisry board & founder and director of the Bruenel Talent Marketplace (BTM) (www.bruneltalentmarketplace.com) . BTM an IT organisation inside Brunel University that aims to foster symbiotic relations between industry and academia. Newest selected publications Malizia, A., Valtolina, S., Serrano, A. and Maceli, M. (2021) 'End-user development for smart environments (EUD4SE)'. Behaviour and Information Technology, 40 (10). pp. 973 - 973. ISSN: 0144-929X Open Access Link Journal article Al-Eisawi, D., Serrano, A. and Koulouri, T. (2020) 'The effect of organisational absorptive capacity on business intelligence systems efficiency and organisational efficiency'. Industrial Management and Data Systems, 121 (2). pp. 519 - 544. ISSN: 0263-5577 Open Access Link Journal article Mahmood, I., Arabnejad, H., Suleimenova, D., Sassoon, I., Marshan, A., Serrano, A., Louvieris, P., Anagnostou, A., Taylor, S., Bell, D. and Groen, D. et al. (2020) 'FACS: A geospatial agent-based simulator for analyzing COVID-19 spread and public health measures on local regions'. Journal of Simulation, 16 (4). pp. 355 - 373. ISSN: 1747-7778 Open Access Link Journal article Ikhalia, E., Serrano, A., Bell, D. and Louvieris, P. (2019) 'Online Social Network Security Awareness: Mass Interpersonal Persuasion using a Facebook App'. Information Technology and People, 32 (5). pp. 1276 - 1300. ISSN: 0959-3845 Open Access Link Journal article Serrano, A., Garcia-Guzman, J., Xydopoulos, G. and Tarhini, A. (2018) 'Analysis of Barriers to the Deployment of Health Information Systems: a Stakeholder Perspective'. Information Systems Frontiers, 22 (2). pp. 455 - 474. ISSN: 1387-3326 Open Access Link Journal article More publications(39)",
  "content_length": 3650,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:00"
}