{
  "name": "Alan F. Blackwell",
  "homepage": "http://www.cl.cam.ac.uk/~afb21",
  "status": "success",
  "content": "Alan Blackwell - personal home page Who am I ? Professor of Interdisciplinary Design at the University of Cambridge I study how to make meaningful technology through creative practice, critical engagement, and new kinds of representation. I am co-Director of Cambridge Global Challenges, and a Fellow of Darwin College. Enquiries Applying to work with me I welcome enquiries. Please start by reading my advice on how to explain your specific research interests Publications For an overview of recent research browse my publications Contact Location : Computer Laboratory Email : afb21@cam.ac.uk Phone : +44 1223 334418 Address : William Gates Building, Cambridge CB3 0FD. Old homes : 2022 | 2011 My Research New Computational arts Critical design Radical representation REPRESENTATION The Multiverse Explorer domain-specific probabilistic programming language Read more REPRESENTATION Justas's rendering of atmospheric sensing in a virtual Digital Twin Read more REPRESENTATION Torino: A tangible programming language inclusive of children with visual disabilities Read more DESIGN Critical writing on technology and design Read more ARTS MIT Press book Live Coding: a user's manual Read more ARTS Development of a Choreographic Language Agent for sketching with Random Dance Company Read more DESIGN Proposal for HCI as an Interdiscipline drawing on analysis of Crucible projects Read more REPRESENTATION The AutoHAN Media Cubes tangible IoT programming language Read more REPRESENTATION The Webkit interface for rhetorical structure Read more REPRESENTATION Prototyping tangible user interfaces as solid diagrams Read more REPRESENTATION Darren Edge's research on peripheral tangible interaction Read more REPRESENTATION Ana Semrov's interactive visualisation of latent semantic spaces Read more DESIGN The Crucible network for research in interdisciplinary design Read more DESIGN What would AI would look like if it was invented in Africa? Read more ARTS The Palimpsest system for live algorithmic image manipulation Read more ARTS Alan and Sam live-coding Minecraft as The Humming Wires at an algorave in Leeds Watch video REPRESENTATION Zhen Bai's FingAR system for pretend play in augmented reality Read more ARTS Exhibition and book by Bruce Gernand - the Coded Chimera. Read more DESIGN Comparative investigation of practices Across Design Read more REPRESENTATION Mariana Marasoiu's Cuscus end user programming tool for data visualisation Read more REPRESENTATION The ICUMAP visualisation of 10,000 patient records ARTS Sam Aaron's Sonic Pi music programming system Read more Moral Codes MIT Press 2024 open access original manuscript publication My Teaching Human-Centred AI Practical Methods P342 - course page (part II) Practical Research in Human-centred AI is co-taught with Advait Sarkar (Microsoft Research Cambridge). Students design an original experiment, leading to a report suitable for publication. Sociotechnical Theory R225 - previous course page Theories of Socio-digital Design for Human Centred AI was developed with Tomasz Hollanek (Leverhulme Centre for the Future of Intelligence), including MPhil students in Ethics of AI, Data and Algorithms, and in Digital Humanities. Not offered in 2025/26 Human-Computer Interaction Further HCI Part 1B - course page Co-taught with Luke Church. This course provides an introduction to the principles of designing alternatives to AI, including modes of representation, intelligent interfaces, user experience and critical perspectives. Computer Music Part 2/3 - previous course page Originally developed with Mark Gotham. Currently paused following his appointment at Kings College London. Group Design Project For students Part 1B - course page This design course, at the centre of the computer science degree, involves working for a term to create an advanced prototype, working with an external client. Co-taught with Rob Harle and Tobias Grosser. For clients Development - Wiki Please contact me if you'd like to work with a student team as client/mentor for their design project. My Studio Sofija Stefanovic PhD student Sofija is a student with the AI for Environmental Risk CDT, investigating sensing infrastructure and citizen action. Read more Justas Brazauskas PhD student Justas is investigating critical design of digital twin infrastructure, co-supervised by Ian Lewis and Per Ola Kristensson, and funded by the Sensors Centre for Doctoral Training. Read more Studio X 2022/23 research team Research team meeting in November 2022: David, Bianca, Anna, Alexander, Sofija, Pamela, Alan, Malak, Oumaima, Joycelyn, Diana, Emma. Described by David as \"Studio X\", although he might want to reconsider that proposal following Musk's rebranding of Twitter the following year. Bianca Schor PhD student Coming from a background in art history, Bianca is investigating the fundamentals of meaningful transparency, co-supervised by Jat Singh. Read more Joycelyn Longdon PhD student Funded by the Centre for Doctoral Training in AI for Environmental Risk, Joycelyn is working with a community in Ghana on conservation eco-acoustics. Co-supervised by Jennifer Gabrys (Sociology), Adham Ashton-Butt (Britist Trust for Ornithology) and Emmanuel Acheampong (Kwame Nkrumah University of Science and Technology). Read more Diana Robinson PhD student Diana is exploring end-user domain specific probabilistic programming languages for clinical decision support, funded by Microsoft Research Cambridge. This work is co-supervised by Alain Vuylsteke, Kenton O'Hara, Neil Lawrence and Luke Church. Read more Mariana Marasoiu Affiliated Lecturer Mariana has completed an investigation of end-user tools for data visualisation, and works on data science applications and the design of novel programming tools. Her PhD was funded by BT, and co-supervised by Martin Spott and Detlef Nauck Read more Luke Church Affiliated Lecturer Luke's designs systems of computers and people for integrating intelligence. He is the founder of Lark Systems, lead technologist at Africa’s Voices Foundation, and assists a number of other organisations with socio-technical design needs. Read more",
  "content_length": 6134,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:53"
}