{
  "name": "Alan Hanjalic",
  "homepage": "https://www.tudelft.nl/ewi/over-de-faculteit/afdelingen/intelligent-systems/multimedia-computing/people/alan-hanjalic",
  "status": "success",
  "content": "Alan Hanjalic Zoeken Sluit zoek Alan Hanjalic Professor, IEEE Fellow, AAIA Fellow Antoni van Leeuwenhoek Chair Head of the Multimedia Computing Group Head of the Intelligent Systems Department Alan Hanjalic completed his studies in electrical engineering at Friedrich-Alexander University Erlangen-Nuremberg in Germany in 1995, specializing in motion estimation for video compression. In 1999, he obtained his PhD from the TU Delft, now the Faculty of EEMCS, specializing in video indexing and search. He remained affiliated with TU Delft as an assistant, associate and, since 2012, full professor of computer science. Continuing his academic career upon completing his PhD, he furthered his research in the field of multimedia information retrieval (MIR) and established the Delft Multimedia Information Retrieval (DMIR) lab. The Lab’s research focused on developing effective, intuitive and socially responsible methods for accessing and interacting with vast multimedia data collections. The research has encompassed both the search and recommender systems. This lab evolved into the Multimedia Computing section in 2014. Under his leadership, the DMIR Lab and the MMC section have been at the forefront of numerous national and international research initiatives in the MIR field, including the projects in the national FES and BSIK programs and the EU-funded projects, of which one Network of Excellence. Prof. Hanjalic’s early work on content-based video segmentation and representation resulted in foundational techniques and publications that have served as standard references in the field for many years. Later on, recognizing the limitations of the traditional semantic-based video retrieval, he pioneered the concept of affective content analysis in 2001. Aiming to understand and respond to viewers' emotional reactions to videos, he was the first to propose an integral framework for affective video content representation and modelling. By modelling videos as curves in the arousal-valence space, he revealed the expected affective reactions of a user to a video over time. With this, he enabled automated video indexing using emotional cues and facilitated access to video segments based on the emotions they evoke. This enabled more nuanced video browsing and retrieval, surpassing traditional classification-based methods. Over the years, affective content analysis, indexing and retrieval have become a major subfield of MIR. In recognition of his pioneering work in MIR, Prof. Hanjalic was named an IEEE Fellow in 2016. Prof. Hanjalic has been active in academic education for over 25 years, as (responsible) lecturer, mentor and course coordinator. He chaired the Computer Science Board of Studies and has been promotor of over 30 PhD students. He served on the EEMCS Career Development Committee and, in 2018, he took on the role of head of the Intelligent Systems department. As department head, he has been cultivating a culture of diversity, inclusion, openness, transparency, and empowerment. At the university level, he was a member of the Council of Professors and chaired the central TU Delft appointment advisory committee for full professors. Through his position on the management team of 4TU.NIRICT (Netherlands Institute for Research on ICT), and as a TU Delft representative at the ICT Research Platform Netherlands (IPN), he has been actively involved in the national discussions on computer science and ICT. 2025 A Reproducibility Study of Product-side Fairness in Bundle Recommendation Huy Son Nguyen / M. Mansoury / A. Hanjalic 2025 Estimating nodal spreading influence using partial temporal networks Tianrui Mao / Shilun Zhang / Alan Hanjalic / Huijuan Wang 2025 Still Making Noise Improving Deep-Learning-Based Side-Channel Analysis Jaehun Kim / Stjepan Picek / Annelie Heuser / Shivam Bhasin / Alan Hanjalic 2024 Predicting nodal influence via local iterative metrics Shilun Zhang / Alan Hanjalic / Huijuan Wang 2024 Preface Stevan Rudinac / Alan Hanjalic / Cynthia Liem / Marcel Worring / Björn Þór Jónsson / Bei Liu / Yoko Yamakata Meer publicaties Deel deze pagina: Facebook Linkedin Twitter Email WhatsApp Deel deze pagina +31 15 27 83084 A.Hanjalic@tudelft.nl Faculty of Electrical Engineering, Mathematics and Computer Science Department of Intelligent Systems Van Mourik Broekmanweg 6 2628 XE Delft The Netherlands",
  "content_length": 4364,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:53"
}