{
  "name": "Alan Mislove",
  "homepage": "http://www.ccs.neu.edu/home/amislove",
  "status": "success",
  "content": "Alan Mislove I'm a Professor of Computer Science at Northeastern University. I'm also the Senior Associate Dean for Academic Affairs and Interim Executive Director of EAI. I'm a Professor of Computer Science at Northeastern University. I'm also the Senior Associate Dean for Academic Affairs and Interim Executive Director of EAI. I'm a Professor of Computer Science at Northeastern University. I'm also the Senior Associate Dean for Academic Affairs and Interim Executive Director of EAI. I'm a Professor of Computer Science at Northeastern University. I'm also the Senior Associate Dean for Academic Affairs and Interim Executive Director of EAI. Research My group's research interests revolve around algorithmic auditing. We develop methodologies and study the real-world systems that millions of users interact with every day, focusing on issues of algorithmic discrimination, fairness, and privacy. We aim to enable regulators, policymakers, and everyday people to better understand how these systems work, how they are used and abused, and what impacts they are having on users and society at large. I have testified before Congress and briefed members of the U.S. House Financial Services Committee and the Federal Reserve Board of Governors on algorithmic fairness. I was a plaintiff in an ACLU lawsuit that successfully challenged the constitutionality of the CFAA for online anti-discrimination research. My work has received over 25,000 citations, identified behaviors that were addressed in the FTC's $5B settlement with Facebook as well as the DOJ's Fair Housing Act (FHA) lawsuit against Meta (the first time DOJ has charged an algorithm with FHA violations). Our research is generously funded by the National Science Foundation, the Army Reseach Office, Narus, Google, the Data Transparency Lab, and Amazon Web Services. Teaching I've taught a number of courses, including CS 2500 Fundamentals of Computer Science 1, CS3700 Networks and Distributed Systems (and its precursor CS3600 Systems and Networks), CS4700/CS5700 Fundamentals of Computer Networks, CS5600 Computer Systems, and CS5750/IS4700 Social Computing. Service I have served on the program committees of many conferences, including (most recently) IMC'25 and PETS'26. I will be serving as the Program Committee Co-Chair for IMC'26. Outside of academia, I served as Deputy United States Chief Technology Officer for Privacy in the White House Office of Science and Technology Policy during most of 2023 and 2024, where I worked on AI, privacy, and government use of technology. I was also a Senior Privacy Expert at the Federal Trade Commission. Within Northeastern, I have served in numerous administrative roles in the Khoury College of Computer Sciences, including most recently as Senior Associate Dean for Academic Affairs. I am also serving as Interim Executive Director for the Institute of Experiential Artificial Intelligence. Advising I'm thrilled to have the opportunity to work with a number of talented students, postdocs, and research scientists. These include my current research scientist Piotr Sapieżyński, as well as Ph.D. students Levi Kaplan and Nicole Gerzon. I also had the pleasure of advising Taejoong Chung (now at Virginia Tech), Bimal Viswanath (co-advised with Krishna P. Gummadi; now at Virgina Tech), Ancsa Hannák (co-advised with David Lazer; now at University of Zurich), Yabing Liu (now at Twitter), Liang Zhang (now at Google), Arash Molavi Kakhki (co-advised with Dave Choffnes; now at ThousandEyes), Muhammad Ali (now at Amazon), Lulu Kiffer (co-advised with Rajmohan Rajaraman; now at IMDEA), and Giridhari Venkatadri (now at Meta). Contact amislove@ccs.neu.edu 177 Huntington Ave Office 409 Khoury College of Computer Sciences Northeastern University Boston, MA 02115 Map Directions Core Faculty, Cybersecurity and Privacy Institute Core Faculty, Institute for Experiential Artificial Intelligence GPG public key Bio CV Google Scholar ×Alan Mislove Bio Alan Mislove is a Professor and Senior Associate Dean for Academic Affairs at the Khoury College of Computer Sciences at Northeastern University. His research is on algorithmic auditing. He develops methodologies and study the real-world systems that millions of users interact with every day, focusing on issues of algorithmic discrimination, fairness, and privacy. His aim is to enable regulators, policymakers, and everyday people to better understand how these systems work, how they are used and abused, and what impacts they are having on users and society at large. Prof. Mislove’s research comprises over 80 peer-reviewed papers, has received over 20,000 citations, and has been supported by over $5M in grants from government agencies and industrial partners. He is a recipient of an NSF CAREER Award (2011), a Google Faculty Award (2012), a Facebook Secure the Internet grant (2018), the ACM SIGCOMM Test of Time Award (2017), the IETF Applied Networking Research Prize (2018, 2019), the USENIX Security Distinguished Paper Award (2017), the NDSS Distinguished Paper Award (2018), the IEEE Cybersecurity Award for Innovation (2017), the IMC Distinguished Paper Award (2022), and a Facebook Secure the Internet Grant. He has testified before Congress and briefed members of Congress and the Federal Reserve Board of Governors on issues of algorithmic fairness. He was a plaintiff in an ACLU lawsuit that successfully challenged the constitutionality of the CFAA for online anti-discrimination research. His work has been covered by the Wall Street Journal, the New York Times, and the CBS Evening News. Between January 2023 and August 2024, he served in the White House Office of Science and Technology Policy, most recently as Deputy U.S. Chief Technology Officer for Privacy. Diversions I'm a sucker for nice data visualizations. I've worked on a few using Twitter data, including a visualization of the U.S. mood, and a a map of over 250 million geo-tags. Active projects Algorithmic Auditing Our lives are increasingly influenced by algorithms, from online recommendations to banking decisions and even to predictive policing. While these systems are useful, most of them are \"black boxes\" with little visibility into how decisions are made, raising concerns of inadvertent discrimination, censorship, and disparate impact. We are developing techniques to externally audit such systems, allowing policy makers and end users to better understand how input data is used and how it influences the output of these systems. We have successfully applied our techniques to study personalization in Google Search and E-commerce web sites, the surge pricing algorithm of Uber, and algorithmic pricing on the Amazon Marketplace. Our work has received significant press coverage and is funded by the NSF and the Knight Foundation. SSL Ecosystem SSL and the PKI secure Internet transactions such as banking, e-mail, and e-commerce by providing trusted identities and private communication. Unfortunately, the PKI that is in-use today is surprisingly brittle, and there have been numerous incidents where SSL certificates have been compromised or the PKI has been mis-managed. We are trying to better understand the weaknesses of the current PKI, with the goal of developing tools and techniques to improve security for internet users. We have explored how sites (often failed to) respond to the Heartbleed bug and how browsers rarely bother to check the revocation status of certificates. Our work is in collaboration with researchers from Duke, UMD, and Stanford. Traffic Differentiation Middleboxes are commonly deployed by ISPs to implement traffic policies such as shaping, proxying, and transcoding. While middleboxes may be used for network management purposes, they may also be applied opaquely to limit access to (or degrade) services which compete with those offered by the network provider. We are developing tools and techniques to better understand when such middleboxes are deployed, what traffic they are affecting, and what the ISP policies are. We have successfully presented an approach to detect traffic differentiation by mobile networks, and have released the Differentation Detector app to allow users to test their own ISPs. Previous projects Cloud Computing Cloud computing has evolved to meet user demands, from arbitrary VMs offered by IaaS to the narrow application interfaces of PaaS. Unfortunately, there exists an intermediate point that not well met by today's offerings: users who wish to run arbitrary, already available binaries yet expect their applications to be long-lived but mostly idle. We are exploring an alternative approach for cloud computation based on a process-like abstraction rather than a virtual machine abstraction, thereby gaining the scalability and efficiency of PaaS along with the generality of IaaS. We get the best of both worlds by enabling fast swapping of applications to and from cloud storage (since, by definition, applications are largely idle, we expect them to spend the majority of their time swapped out). Our work is in collaboration with Duke and UMD, and is generously funded by the NSF. Peer-to-Peer Systems Peer-to-peer systems offer the potential of failure resilience and organic scalability. However, most peer-to-peer systems have been designed as best-effort services without any strong guarantees of reliability. We developed a number of approaches to increase the reliability of peer-to-peer systems, including increase autonomy, data resilience, and greater consistency. We demonstrated the appliciability of our techniques by developing and deploying the ePOST email system and reported our experience in using it as our primary email system for six months. Social Networks Every second, the thoughts and feelings of millions of people around the world are recorded on Twitter. Since Twitter's inception in 2006, we have been collecting a large sample of tweets; this data set is now over 65 billion tweets and counting. We have used our large-sca",
  "content_length": 12100,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:58"
}