{
  "name": "Alan Dorin",
  "homepage": "https://research.monash.edu/en/persons/alan-dorin.html",
  "status": "success",
  "content": "Alan Dorin - Monash University Alan Dorin public CV View Scopus Profile Alan Dorin Professor Professor, Department of Data Science & AI https://orcid.org/0000-0002-5456-4835 EmailAlan.Dorinmonashedu Accepting PhD StudentsPhD projects<a href=\"https://supervisorconnect.it.monash.edu/\" onclick=\"target='_blank';\">https://supervisorconnect.it.monash.edu/</a> 1998 …2025 Research activity per year Personal profile Research interestsArtificial Life, Ecological Modelling, Insect-plant interaction and simulation, Biologically-inspired electronic media art, Generative art, History of technologySupervision interestsArtificial Life, Ecological modelling, Biologically-inspired electronic media art, Generative artMonash teaching commitmentAlan Dorin has experience as the Chief Examiner and Lecturer for the following units in the Faculty of IT: FIT2083 Research and Innovation in Computer ScienceFIT2105 Creative computing: understanding art, science and technologyFIT3036 Computer science projectFIT3094 AI for gamingFIT3161-64 Computer Science and Data Science Final Year ProjectsBiographyAlan Dorin is a Professor in the Faculty of Information Technology, Monash University. He researches the ways in which technology assists discovery in the ecological sciences and in human creativity. Through his work in Artificial Life and ecological simulation, Alan explores the key attributes of organisms that enable them to live in complex environments. This knowledge is used to improve agriculture and horticulture, and to assist us in maintaining natural ecosystems. Alan promotes an understanding of the relationships between technology and human endeavour by nurturing curiosity and encouraging students to form their own bridges between disciplines. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Doctor of Philosophy, Monash UniversityAward Date: 1 Jul 1999Animation and Interactive Media, Postgraduate Diploma of animation and Interactive Multimedia, RMIT UniversityAward Date: 1 Oct 1995Computer Science, Bachelor of Computer Science, Monash UniversityAward Date: 1 Oct 1992Applied Mathematics, Bachelor of Science, Monash UniversityAward Date: 1 Oct 1991 Research area keywordsArtificial LifeEcosystem SimulationAgent Based ModellingInsect-plant interactionPollinationBiodiversityElectronic ArtGenerative ArtComputer ArtsComputer Music Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2003 2003 2007 2010 2013 2016 2019 2020 2021 2023 2024 2029 3 Active 9 Finished Projects per year Nat Pollination Strat: Develop an Australian National Pollination Strategy and implement the first four-year Stratergy Roadmap.Chambers, F. (Primary Chief Investigator (PCI)), Dorin, A. (Chief Investigator (CI)) & Howard, S. (Chief Investigator (CI))Ian Potter Foundation, Monash University – Internal Department Contribution12/09/24 → 11/09/29Project: Research BUGCAM: A novel camera trap for insect pollinator biodiversity field monitoring and biometric analysisRatnayake Mudiyanselage, M. N. (Primary Chief Investigator (PCI)) & Dorin, A. (Chief Investigator (CI))National Geographic Society1/07/24 → 30/06/26Project: Research PrecPol: Precision Pollination: Data-driven enhancements to boost crop yieldDorin, A. (Primary Chief Investigator (PCI)), Nadjaran Toosi, A. (Chief Investigator (CI)), Cook, J. (Chief Investigator (CI)), Rader, R. (Chief Investigator (CI)) & Parry, H. (Partner Investigator (PI))ARC - Australian Research Council13/06/23 → 12/06/26Project: Research CCIRI: Consumer and Community Involvement; Implementation Research for Impact (CCIRI)Teede, H. (Primary Chief Investigator (PCI)), Jones, A. (Chief Investigator (CI)), Reeder, S. (Chief Investigator (CI)), Dorin, A. (Chief Investigator (CI)), Parsons, M. (Chief Investigator (CI)), Hodgson, C. (Chief Investigator (CI)), Cahill, A. (Chief Investigator (CI)), Egerton-Warburton, D. (Chief Investigator (CI)), Langridge, D. (Chief Investigator (CI)), Doyle, K. E. (Chief Investigator (CI)) & Heiss, L. (Chief Investigator (CI))Medical Research Future Fund (MRFF), Monash Partners, Consumers Health Forum Inc, Maridulu Budyari Gumal Sydney Partnership for Health, Education, Research & Enterprise (SPHERE) (trading as Sydney Partnership for Health, Education, Research and Enterprise), Western Australian Health Translation Network1/04/23 → 30/04/25Project: Research Virtual Patient Advocate to improve reproductive and preconception healthXie, J. (Primary Chief Investigator (PCI)), Boyle, J. (Chief Investigator (CI)), Walker, R. (Chief Investigator (CI)), Wu, L. (Chief Investigator (CI)), Olivier, P. (Chief Investigator (CI)), Skouteris, H. (Chief Investigator (CI)) & Dorin, A. (Chief Investigator (CI))1/07/21 → 31/12/22Project: Research View all 12 projects Research output Research output per year 1998 2001 2005 2009 2012 2013 2018 2020 2021 2022 2023 2025 41 Conference Paper 40 Article 10 Chapter (Book) 6 Review Article 13 More 3 Editorial 2 Edited Book 2 Letter 1 Book 1 Other 1 Comment / Debate 1 Creative Work 1 Curation 1 Software Research output per year Research output per year Consumer and community involvement: implementation research for impact (CCIRI) - implementing evidence-based patient and public involvement across health and medical research in Australia - a mixed methods protocolNg, A. H., Reeder, S., Jones, A., Cahill, A., Langridge, D., Baker, S., Heiss, L., Dorin, A. & Teede, H., 24 Feb 2025, In: Health Research Policy and Systems. 23, 1, 10 p., 25.Research output: Contribution to journal › Article › Other › peer-review Open Access 3 Citations (Scopus) A predator–prey population dynamics simulation for biological control of Frankliniella occidentalis (Western Flower Thrips) by Orius laevigatus in strawberry plantsAmarathunga, D. C., Parry, H., Grundy, J. & Dorin, A., Jan 2024, In: Biological Control. 188, 19 p., 105409.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 5 Citations (Scopus) A framework for better sensor-based beehive health monitoringZaman, A. & Dorin, A., Jul 2023, In: Computers and Electronics in Agriculture. 210, 14 p., 107906.Research output: Contribution to journal › Review Article › Research › peer-review Open AccessFile 33 Citations (Scopus) Ancient insect vision tuned for flight among rocks and plants underpins natural flower colour diversityDorin, A., Shrestha, M., Garcia, J. E., Burd, M. & Dyer, A. G., 20 Dec 2023, In: Proceedings of the Royal Society B: Biological Sciences. 290, 2013, p. 20232018 7 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 4 Citations (Scopus) A world without bees: new insights from Australia for managing sustainability in a changing climateDyer, A. G., Shrestha, M., Garcia, J. E., Howard, S. R., Ratnayake, M. N. & Dorin, A., 2023, In: Proceedings of the Royal Society of Victoria. 135, 2, p. 20-29 10 p.Research output: Contribution to journal › Review Article › Research › peer-review Open AccessFile 1 Citation (Scopus) View all 110 research outputs Activities Activities per year 2011 2011 2016 2016 7 Committees and working groups 1 Editorial responsibility Activities per year Member - Faculty Research Committee - Faculty of Information Technology, Monash UniversityDorin, A. (Member)1 Jan 2016 → …Activity: External Academic Engagement › Committees and working groups Member - Faculty Education Committee - Faculty of Information Technology, Monash UniversityDorin, A. (Member)1 Jan 2016 → …Activity: External Academic Engagement › Committees and working groups Head of School Clayton - Faculty of Information Technology, Monash UniversityDorin, A. (Chair/ Co-Chair)1 Jan 2016 → …Activity: External Academic Engagement › Committees and working groups Chair - Undergraduate Programs Committee - Faculty of Information Technology, Monash UniversityDorin, A. (Chair/ Co-Chair)1 Jan 2016 → …Activity: External Academic Engagement › Committees and working groups Artificial Life (Journal)Dorin, A. (Editor in chief)2015Activity: Publication peer-review and editorial work types › Editorial responsibility View all 8 activities Press/Media How AI can be used to track pollinators in strawberry crops.Ratnayake Mudiyanselage, M. R. & Dorin, A.10/04/231 Media contributionPress/Media: Article/Feature",
  "content_length": 8870,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:52"
}