{
  "name": "Alan Ritter",
  "homepage": "http://aritter.github.io",
  "status": "success",
  "content": "Alan Ritter Alan Ritter Home Publications Advice C.V. Alan Ritter Associate Professor School of Interactive Computing College of Computing Georgia Institute of Technology Office: Coda 1157B Email: alan.ritter@cc.gatech.edu Google Scholar: https://scholar.google.com/citations?hl=en&user=unXtH3IAAAAJ Semantic Scholar: https://www.semanticscholar.org/author/Alan-Ritter/4655992 Follow @alan_ritter I am an Associate Professor in the School of Interactive Computing at Georgia Tech (also affiliated with the Machine Learning Center). I do research on natural language processing. My research group investigates questions regarding robust models that work across many domains and languages, while requiring fewer labels, and making efficient use of computational resources. I am also interested in data-driven dialogue agents that safely and naturally converse on any topic. I am always looking for strong students to work with. I advise students in both our ML and CS Ph.D. programs. For current Georgia Tech students interested in research: please email me a copy of your resume, transcript, and a description on what you would like to work on together. Recent Activities: Speaking at the University of Tokyo, October 2024 Shonan Seminar on Empowering Local Open Source LLMs Congrats to Yang Chen on successfully defending his Ph.D. thesis! Yang will join NVIDIA as a Research Scientist. 5/2024 Talk at University of California San Diego 3/2024 Talk at University of California Irvine 12/2023 Speaking at BrainLink 11/2023 Talk at the University of Chicago / TTIC 10/2023 Talk at AI2 10/2023 Talk at the University of Washington 7/2023 Speaking at the Matching Workshop @ ACL 2023 2/2023 Talk at the University of Pennsylvania 10/2022 Talk at Princeton University 10/2022 Talk at Columbia University 10/2022 Talk at New York University 10/2022 Talk at Google New York 5/2022 Talk at Johns Hopkins University 1/2022 Talk at Megagon Labs 9/2021 Talk at the University of Notre Dame NLP Seminar 12/2019, Speaking at the NeurIPS workshop on Conversational AI [video] NSF CAREER Award 5th Workshop on NLP in noisy user-generated text (W-NUT) at EMNLP 2019. Consider submitting an abstract or paper! 6/2019 Talk at Twitter 5/2019 Visiting Faculty, Language Technologies Institute, Carnegie Mellon University 1/2019 Amazon Research Award 5/2018 Speaking at the Stanford NLP Seminar 12/2017, Talk at the NeurIPS workshop on Learning with Limited Labeled Data 7/2017 Interview on Data-Driven Conversational Agents 7/2017 Talk at the Microsoft Research Faculty Summit 6/2017 Speaking at the Midwest Machine Learning Symposium Visiting researcher, Microsoft Research NLP Group August 2015. Talk at Carnegie Mellon University. Media Coverage: Our work measuring cultural biases in LLMs was covered by Venture Beat. Quoted on the costs of large language models by Bloomberg. Our EMNLP paper investigating neural chatbots' stance towards toxic comments was covered by TNW. WIRED article covering our NAACL paper on analyzing percieved servierity of software vulerabilities reported on social media. Recent Service: Area Chair, COLM 2025 Program Chair, NAACL 2025 Best Paper Awards Committee, EACL 2024 Area Chair, EMNLP 2023, Information Extraction Demo Chair, ACL 2023 Area Chair, ACL 2023, Information Extraction Senior Area Chair, EMNLP 2022, Information Extraction Senior Program Committee, AAAI 2022 Senior Area Chair, ACL 2022, Information Extraction Senior Area Chair, EMNLP 2021, Computational Social Science Area chair, ACL 2021, Information Extraction Senior Area Chair, NAACL 2021, Machine Learning for NLP: Classification and Structured Prediction Models Senior Area Chair, EMNLP 2020, Information Extraction Area chair, ACL 2020, Information Extraction Area chair, EMNLP 2019, Social Media and Computational Social Science Area chair, ACL 2019, Information Extraction and Text Mining Postdoctoral Researcher: Zhenduo Wang Ph.D. Students: Ruohao Guo Junmo Kang Duong Minh Le Jungsoo Park Ethan Mendes Geyang Guo Nghia (Max) Le Jonathan Zheng Undergraduate and M.S. Researchers: Ruixin Yang Mohit Raghavendra Alumni: Fan Bai (Ph.D. 2023, Georgia Institute of Technology, M.S. 2020, Ohio State University) Yang Chen (Ph.D. 2024, Georgia Institute of Technology) Sandesh Swamy (M.S. - 2017, Ohio State University) Jeniya Tabassum (Ph.D. - 2020, Ohio State University) Shi Zong (Ph.D. - 2020, Ohio State University) Vedaant Shah (M.S. - 2024, Georgia Institute of Technology) Andrew Li (M.S. - 2024, Georgia Institute of Technology)",
  "content_length": 4525,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:59"
}