{
  "name": "Alan Hayes",
  "homepage": "http://www.bath.ac.uk/comp-sci/contacts/academics/alan_hayes",
  "status": "success",
  "content": "Alan Hayes - the University of Bath's research portal View Scopus Profile Alan Hayes Prof Professor, Department of Computer ScienceInstitute of Coding https://orcid.org/0000-0002-2192-9113 Phone+44 (0) 1225 384489EmailA.Hayesbath.acuk 10 WEST 1.14 Personal profile Research interestsAlan has 30 years’ experience in Higher Education. He is currently a professor of computer science education at the University of Bath. He has worked in both the teaching-led and research-led sectors. He has held positions of Director of Teaching, Head of Department, Associate Dean (L&T) and Dean. He is a Fellow of the British Computer Society and regularly participates in professional accreditation events through his membership of its Academic Accreditation Committee. He is a National Teaching Fellow and Principal Fellow of the Higher Education Academy. He represented computing on the national pilot subject review for the Teaching Excellence Framework(TEF) in both 2017 and 2018. He was the Chair of the National Advisory Group for the review of the QAA Subject Benchmark Statement in Computing (2022). He regularly reviews applications for the AdvanceHE National Teaching Fellowship scheme. He also reviews papers submitted to the ACM’s Computing Education Research and Computing Education Practice annual conferences. He currently supports the Office for Students in the assessment of quality and standards within higher education providers and is a lead reviewer for Computing provision within the Higher Education Sector. Fingerprint Dive into the research topics where Alan Hayes is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles UK Social Sciences 100% Computer Science Social Sciences 77% Occupational Career Social Sciences 57% Communities-Of-Practice Social Sciences 35% Accreditation Social Sciences 32% Academic Career Social Sciences 32% Apprenticeship Social Sciences 32% Computer Science Education Social Sciences 30% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 12 Chapter in a published conference proceeding 9 Paper 2 Book chapter 2 Poster 1 More 1 Article Research output per year Research output per year Beyond the unit: A course-wide, iterative formative assessment and feedback framework for enhancing learning and employability skills in computer science educationBenardis, I., Hayes, A. & Davenport, J. H., 26 Mar 2025, Formative Assessment and Feedback in Post-Digital Learning Environments: Disciplinary Case Studies in Higher Education. 1st ed. London : Taylor and Francis/ Balkema, p. 186-194 9 p.Research output: Chapter or section in a book/report/conference proceeding › Book chapter Formative Assessment 100% Computer Science Education 100% Employability Skill 100% Case Study 100% Problem-Solving Skill 50% Towards a Framework for Mapping Authentic Assessment to Competency in University Computing Education in the UkPrickett, T., McChesney, I., Norling, E., Hayes, A., Chrysikos, A., Riddle, S., Davenport, J. H., Irons, A. & Crick, T., 3 Jun 2025, EDUCON 2025 - IEEE Global Engineering Education Conference, Proceedings. U. S. A.: IEEE, (IEEE Global Engineering Education Conference, EDUCON).Research output: Chapter or section in a book/report/conference proceeding › Chapter in a published conference proceeding Engineering Discipline 100% Working Definition 100% Evolutionary Prototyping 100% Individual Attribute 100% Proof 100% Embedding Technical, Personal and Professional Competencies in Computing Degree ProgrammesPrickett, T., Crick, T., Davenport, J. H., Bowers, D. S., Hayes, A. & Irons, A., 3 Jul 2024, ITiCSE 2024 - Proceedings of the 2024 Conference Innovation and Technology in Computer Science Education. U. S. A.: Association for Computing Machinery, p. 346-352 7 p. (Annual Conference on Innovation and Technology in Computer Science Education, ITiCSE; vol. 1).Research output: Chapter or section in a book/report/conference proceeding › Chapter in a published conference proceeding UK 100% Human Resources 100% Occupational Career 100% Labor Market 100% Apprenticeship 100% 1 Citation (SciVal) Challenges and opportunities of teaching cybersecurity in UK university computing programmesPrickett, T., Yang, L., Irons, A., Miller, K., Brooke, P., Crick, T., Hayes, A., Davenport, J., English, R., Maguire, J., Bechkoum, K. & Jones, A., 16 May 2023, Cybersecurity teaching in higher education. Sikos, L. F. & Haskell-Dowland, P. (eds.). 1 ed. Cham, Switzerland: Springer, Cham, p. 1-36 36 p.Research output: Chapter or section in a book/report/conference proceeding › Book chapter UK 100% Cybersecurity 100% Case Study 100% Education Program 50% Degree Program 50% 6 Citations (SciVal) Teaching Programming Competencies: A Role for Craft Computing?Crick, T., Davenport, J., Hayes, A. & Prickett, T., 25 Sept 2023, UKICER 2023 - Proceedings of the 2023 Conference on United Kingdom and Ireland Computing Education Research: Proceedings of the 2023 Conference on United Kingdom & Ireland Computing Education Research. Astarte, T., Moller, F., Quille, K. & Russell, S. (eds.). New York: Association for Computing Machinery, 27. (ACM International Conference Proceeding Series).Research output: Chapter or section in a book/report/conference proceeding › Chapter in a published conference proceeding Open AccessFile Academic Discipline 100% Computer Science 100% Competency Based Teaching 100% Craft 100% Competency 100% 3 Citations (SciVal) 248 Downloads (Pure) View all 26 research outputs Datasets Dataset for GW4 \"First Programming Courses\" projectDavenport, J. (Creator), Murphy, E. (Creator), Crick, T. (Creator) & Hayes, A. (Project Member), University of Bath, 2016DOI: 10.15125/BATH-00246Dataset",
  "content_length": 6077,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:55"
}