{
  "name": "Alan Marshall 0001",
  "homepage": "https://liverpool.ac.uk/electrical-engineering-and-electronics/staff/alan-marshall",
  "status": "success",
  "content": "Professor Alan Marshall | Our people | University of Liverpool Skip to main content Close Search Find courses, people, research, information and more. Please ignore What types of page to search? All Courses Academic staff News Events Search Popular pages: Undergraduate Postgraduate PhD Accommodation Research International students Alternatively use our A-Z index. About Professor Alan Marshall holds the chair in Communications Networks at the University of Liverpool where he is director of the Advanced Networks Group. He is currently Associate Pro-Vice Chancellor for Global Engagements and Partnerships; he was previously Head of Department of Electrical Engineering and Electronics (2015-2024). He is a senior member of IEEE and a Fellow of the IET. He has spent over 30 years working in the Telecommunications and Defense Industries, and in Academia. He was involved in the development and standardization of 2G and 3G cellular systems throughout Europe and holds a number of joint patents in the areas of communications and network security. He is widely recognized for his work in network performance analysis, wireless security and threat modelling and in machine trust, particularly for IoT and multi-sensory environments. He has been visiting professor in network security at the University of Nice/CNRS, France, and Adjunct Professor for Research at Sunway University Malaysia. He has published over 280 scientific papers and holds a number of joint patents in the areas of communications and network security. In 2003 he recorded the world’s first long distance collaborative haptic communication over the Internet. In 2013 he discovered and reported the world’s first airborne virus for wifi networks, termed ‘Chameleon’. He has formed a successful spin-out company Traffic Observation & Management (TOM) Ltd specialising in intrusion detection & prevention for wireless networks. His research interests include Network architectures and protocols; Mobile and Wireless networks; Network Security; high-speed packet switching, Quality of Service & Experience (QoS/QoE) architectures; Distributed Haptics and multi-sensory communications.",
  "content_length": 2152,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:04"
}