{
  "name": "Alan Kaminsky",
  "homepage": "https://www.cs.rit.edu/~ark",
  "status": "success",
  "content": "Alan Kaminsky—Department of Computer Science, Rochester Institute of Technology Alan Kaminsky • Department of Computer Science • Rochester Institute of Technology • 4572 + 2433 = 7005 Home Page Alan Kaminsky Professor (Retired) Department of Computer Science Rochester Institute of Technology 102 Lomb Memorial Drive Rochester, NY 14623-5608 USA Email: ark­@­cs.rit.edu Web: https://www.cs.rit.edu/~ark/ I retired on June 30, 2019. I am no longer teaching courses, advising master's capstones, or advising independent studies. Have a nice day! FALL 2018 COURSES Concepts of Parallel & Distributed Systems CSCI 251-02 MWF, 2:00pm-2:50pm, GOL-2400 Foundations of Parallel Computing CSCI 654-01 MW, 3:00pm-4:15pm, GOL-3455 Office Schedule (Spring 2018, Fall 2018) Simulation Simplified textbook Course Web Sites Most Recent Term: CSCI 251, 351, 462, 654, 662 Prior Terms RESEARCH Research Interests & Projects Publications — Presentations Images — Lecture Notes Parallel Computing PJ2 — Parallel Java 2 Library PJ2 on the RIT CS Parallel Computers Big CPU, Big Data textbook PJ — Building Parallel Programs textbook Cryptography Parallel Crypto Computational Science MRI Spin Relaxometry — Phylogeny Distributed Systems Tuple Board — M2MI — Jini Harry Potter Book Sizes INFORMATION Contacting Me SPAM! Biography — Resume — Patents Grade Distribution Department of Computer Science College of Computing Rochester Institute of Technology Handbook of Applied Cryptography A New Kind of Science NIST Digital Library of Mathematical Functions Numerical Recipes and more NIST SHA-3 Competition — SHA-3 Zoo NIST Post-Quantum Crypto Project CAESAR Competition — AE Zoo AntiqueComputingDevices Alan Kaminsky • Department of Computer Science • Rochester Institute of Technology • 4572 + 2433 = 7005 Home Page Copyright © 2019 Alan Kaminsky. All rights reserved. Last updated 08-Aug-2019. Please send comments to ark­@­cs.rit.edu.",
  "content_length": 1916,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:56"
}