{
  "name": "Alan Wassyng",
  "homepage": "http://www.cas.mcmaster.ca/~wassyng",
  "status": "success",
  "content": "Alan Wassyng's Home Page Alan Wassyng Professor, Department of Computing and Software McMaster University, Faculty of Engineering Office: Room 166, Information Technology Building (maps) Phone: +1 (905) 525-9140 ext. 26072 E-mail: wassyng@mcmaster.ca Past Director, McMaster Centre for Software Certification 10/2009-1/2017 (McSCert) Updated July 2020. OVERVIEW My research has focused on development and certification of software intensive safety-critical systems for the past 30 years. It is a much more fascinating research area than many people realize! It is also growing in importance. Our group (McSCert) at McMaster University is a world leader in this field. I constantly recruit graduate students, post-doctoral fellows and research associates who are technically excellent and passionate about this subject. EDUCATION Ph.D., 1979, \"The Solution of Large Systems of Linear Algebraic Equations with Applications in Boundary Element Methods\" M.Sc., 1974, \"The Motion of Record Styli & Distortion in Hi-Fi Turntable Systems\" B.Sc. (Hons), 1971, Applied Mathematics B.Sc., 1970, Applied Mathematics, Mathematics These degrees were obtained at the University of the Witwatersrand, Johannesburg, South Africa. RESEARCH TOPICS Software certification - see McSCert above. Also, I am a founding member of the Software Certification Consortium (SCC) Safety Assurance Cases Hazard Analysis Safety critical systems Timing issues in requirements and software design Tabular expressions - and their use in industry Methods & Software tools for rigorous software development Software engineering education PRACTICAL EXPERIENCE Founded Alan Wassyng Consulting, Ltd in 1986 Consulted for Ontario Hydro/Ontario Power Generation, 1989-2002 Helped verify initial version of Shutdown System for Darlington NGS Helped develop new methodology for safety-critical software Helped develop new versions of Shutdown Systems for Darlington NGS Consulted for US Nuclear Regulatory Commission, 2009 & 2013-2014 Developed automated remote backup system for PCs, for DS Data Storage Inc, 1987-1989 At McMaster, conducted research with industry partners: CANDU Energy, FCA, GM, IBM, OPG, SWI, Toyota ITC, US FDA TEACHING Graduate Courses CAS 703, Software Design (2004) CAS 753, Specifying, Implementing and Verifying Timing Behaviours for Hard Real-Time Systems (2007, 2008, 2011) CAS 781, Development & Certification of Software Intensive Safety-Critical Systems (2014) Undergraduate Courses ENG 1D04, Engineering Computation (2006-2008) SFWR ENG 2AA4, Software Design I (2004-2006, 2010, 2013-2015) SFWR ENG 3E03, Design & Selection of Sequential Programming Languages (2000-2001) SFWR ENG 3F03, Machine Level Programming (2003-2006) SFWR ENG 3K04, Software Development for Electrical & Mechatronics Engineers (2008, 2010-2011, 2016-2019) SFWR ENG 3X03, Scientific Computation (2005) SFWR ENG 4G06/TRON 4TB6, Senior Design Project (Capstone) for Mechatronics & Software Engineers (2010-2015, 2016-2019) SELECTED INVITED TALKS SELECTED PUBLICATIONS",
  "content_length": 3027,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:02"
}