{
  "name": "Alan L. Yuille",
  "homepage": "http://www.cs.jhu.edu/~ayuille",
  "status": "success",
  "content": "Alan L. Yuille's Homepage Alan L. Yuille Home CCVL website Publications Teaching Alan L. Yuille, Professor Mailing Address: 324b Clark Hall Johns Hopkins University Baltimore, MD Email: ayuille1 AT  jhu DOT edu GroupWebpage:  http://ccvl.jhu.edu Professor Alan L. Yuille is a Bloomberg Distinguished Professor of Cognitive Science and Computer Science at Johns Hopkins University. He directs the research group on Compositional Cognition, Vision, and Learning. He is affiliated with  the Center for Brains, Minds and Machines, and the NSF Expedition in Computing, Visual Cortex On Silicon. Position Openings A Postdoctoral Position is currently available in medical image analysis of CT images Skills required include mathematical modeling and programming ability (C++, Cuda). Knowledge of  deep networks, graphical models, and geometry is strongly preferred.  Some publications in major conferences and journals a pre-requisite. Contact Prof. Yuille with CV, research statement, and references (e.g., faculty adviser) for more details. New&Events Brief Biography Alan Yuille received the BA degree in mathematics from the University of Cambridge in 1976. His PhD on theoretical physics, supervised by Prof. S.W. Hawking, was approved in 1981. He was a research scientist in the Artificial Intelligence Laboratory at MIT and the Division of Applied Sciences at Harvard University from 1982 to 1988. He served as an assistant and associate professor at Harvard until 1996. He was a senior research scientist at the Smith-Kettlewell Eye Research Institute from 1996 to 2002. He was a full professor of Statistics at the University of California, Los Angeles, as a full professor with joint appointments in computer science, psychiatry, and psychology. He moved to Johns Hopkins University in January 2016. His research interests include computational models of vision, mathematical models of cognition, medical image analysis, and artificial intelligence and neural networks. Personal Photos Last updated: September 2016",
  "content_length": 2018,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:58"
}