{
  "name": "Alban Grastien",
  "homepage": "https://cs.anu.edu.au/people/alban-grastien",
  "status": "success",
  "content": "Alban Grastien | ANU School of Computing School Sharepoint College Sharepoint ANU College of Systems & Society Search this site Search this site (powered by Google) Powered by Google Close search Interests Research My main research topic is the diagnosis of discrete-event systems. The basic idea is the following. Consider a system (for instance a machine, such as a computer, a car, a space robot, or machine in a factory, etc.) that performs some actions. The system is subject to faults (such as short-circuit, leaking, break of a component, etc.) which leads to an incorrect behaviour of the system. The goal is to use the observations (alarms generated by the system, informations provided by sensors, etc.) on the system to find out what happened on the system. More precisely, I am interested in discrete-event systems. Such systems are so that their behaviour is not continuous but can be modeled as a discrete evolution (by events). A set of behaviours on such a system can be represented by an automaton. For instance, the model is often an automaton (or an equivalent representation). I often define the diagnosis as the computation of all the possible behaviours on the system consistent with the observations. This can also be represented by an automaton. The problem is quite well defined, and the main issue is the complexity which is exponential in the number components in the system. Biography I am a researcher in (Symbolic) Artificial Intelligence, primarily Model Based Diagnosis (MBD) and AI Planning. MBD is the problem of detecting and identifying defects in a physical system (such as a vehicle, a power network, or a web-service) by reasoning about the possible behaviours of the system as described by a model. In this domain, I proposed a general framework to solve diagnosis problems. I proposed a number of algorithms. I also looked at problems linked to modelling and diagnosability. In planning, I considered the problem of conformant planning (planning despite uncertainties on actions effects and initial conditions). I also worked on path-finding, and am a co-author of Jump Point Search, Anya, and Polyanya. I studied problems connected to power flow equations. Through this work, I have become knowledgeable in areas such as Propositional logic (e.g., SAT, BDDs) and SMT. I am also interested in complexity and model-checking. Personal Website http://grastien.net/ban/ bars search times",
  "content_length": 2424,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:06"
}