{
  "name": "Albert Ali Salah",
  "homepage": "http://www.staff.science.uu.nl/~salah006",
  "status": "success",
  "content": "Albert Ali Salah's Web Page News I gave a talk on \"Big data for social good\" at IEEE Madras Section, on 25 November 2025. I gave two talks on \"Designing Computational Tools for Behavioral and Clinical Science;\" the first at the Glasgow Workshop on Social AI, 26 September 2025, and the second at MRAC: Multimodal, Generative and Responsible Affective Computing Workshop at ACM Multimedia, 27 October 2025. I have joined the ACM Distinguished Speaker program. If you would like to book a lecture through the program, ACM can cover part of the travel costs. The application process takes 1-2 months, so make sure you apply in time. Available lectures and the request form are here. Our new NWA-ORC Project DECIDE: Democratizing AI – Empowering Citizens through Transparent Decision-making is granted. With about 7 million euros budget, this consortium will design new AI-systems as intelligence-enhancing-technologies for use by citizens. Together with Dr. Leimin Tian, we gave a half-day tutorial at ACII 2025 (8-11 October 2025, Canberra) on Multimodal Behaviour Analysis for Interactive AI. Our group's third PhD graduate was Hui Lu, who defended his thesis Efficiently moving forward in video-based human action recognition\" on July 7. His last paper on improving the popular VideoMamba will be presented at ICCV this year (and an author proof is available on my pubs. page). I gave a talk on computer vision based assessment of animal pain at IC-3Rs Symposium in Brussels, 15 September 2025. Gizem Soğancıoğlu was the second PhD graduate of our group, with a thesis entitled \" Towards Fair and Explainable Machine Learning Modeling in Mental Health\". I gave a talk on ethical and legal aspects in computer analysis of human behavior at Kadir Has University, on 17 December 2024. Check out the two day workshop program of the Neurotechnologies from a Multidisciplinary Perspective. We are starting two new projects. The HAICu project is about multimodal analysis of archival media data. The second project is funded by NWO, and is on Responsible Scaling of Data-driven Approaches for Enhancing Mental Healthcare’. Our work on contact detection for parent-infant interactions was nominated for the best paper award at ICMI'24. Metehan Doyran also developed a touch annotation tool for interactions. Metehan defended his PhD thesis on February 3, 2025. Our research on the use of mobile phone screening of asylum applicants in the Netherlands and in Germany is covered in de Volkskrant (in Dutch) and in EenVandaag on NPO Radio 1. To read more, check out our paper in Forced Migration Review. The 11th edition of ISBCS was organized by Bahcesehir University. The keynotes were George Northoff, Sami Gulgoz, Duncan Brumby, and Alexander T. Sack. The Turkey Computational Social Science Conference was organized at Koç University for the second time in 2024, between 2-3 May. I gave a talk on data collaboratives and big data for social good. We have organized the 18th IEEE Int. Conference on Automatic Face and Gesture Recognition in Istanbul, May 27-31, 2024. FG'25 was held in Clearwater, FG'26 will be in Kyoto. The Asia–Pacific Migration Data Report 2022 of IOM is now (freely) available. I contributed a small piece on the usage of mobile phone data. Yapay zekâ politik görüşümüzü yüzümüzden anlayabilir mi? Sarkaç platformuna yazdım. We are establishing the Dutch chapter of the IEEE Biometrics Council. If you are interested in biometrics, forensics, identity science, and human behavior analysis, send me an e-mail to be included in the correspondence. IEEE membership is a plus, but not required. The video of my talk at II. Bilkent Computational Social Science Summit on data collaboratives and big data for social good is available on YouTube. I chair the Technical Committee 12 (Multimedia and Visual Information Systems) of IAPR. Please don't hesitate to send me an email if there is something the TC12 can do for you, or vice versa. IMISCOE's Standing Committee on Methods in Migration Research (Meth@Mig) publishes a series of video interviews on \"Digitization of Migration Research Methods: Promises and Pitfalls\". You can watch the first one with Marzia Rango here, and in the second one, I discuss mobile phone data for migration and mobility. Türkiye'de veya yurtdışında hesaplamalı sosyal bilimler, insan hareketliliği, sosyal ağ analizi, sosyal sorunlar için yapay zeka konularında çalışan araştırmacıları biraraya getirmek için yeni bir liste kurduk: soc-comp-tr@googlegroups.com. Bu konularda çalışan herkesi katılmaya ve listeyi duyurmaya davet ediyoruz. The closing workshop of the Data for Refugees (D4R) Challenge was held on 21 January 2019, at Bogazici University, Albert Long Hall. All project reports are available online. (If the link doesn't work, please try this one.) The Turkish computer vision and pattern recognition community started an e-mail communication list, and the number of its members reached two hundred and fifty. The communication language is mainly Turkish. Look for \"cvpr-news-tr@googlegroups.com\". Please join in and spread the word. You can download the slides for the Workshop on Teaching Style and Content for the training of teaching assistants. These are partly based (with much compression and simplification) on the material from the BKO certification program (webpage in Dutch), offered by the University of Amsterdam. If you are interested in hearing about cognitive science related events in Turkey, please subscribe to our mailing list (moderated) cogsci-news-tr@googlegroups.com. The UvA-NEMO Smile database went public! See the website for details on how to obtain it, and check here the coverage in the media. Learn more about our experiment on the effect of dynamic information for facial age and expression estimation here (in Dutch) and here (in English). The public report (in Dutch) can be downloaded here.",
  "content_length": 5879,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:18"
}