{
  "name": "Alberto Pan",
  "homepage": "https://pdi.udc.es/es/File/Pdi/VZ59E",
  "status": "success",
  "content": "Ficha de Carlos Alberto Pan Bermúdez Departamento Ciencias de la Computación y Tecnologías de la Información Área Ingeniería telemática Contacto Directorio de la UDC Orcid id0000-0003-3720-9791 Scopus8236673600 Docencia impartida En este apartado se muestra la docencia impartida en grados, másteres y resto de estudios oficiales en los últimos 6 años. 2018/2019 2017/2018 2016/2017 2015/2016 2014/2015 2013/2014 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Trabajo Fin de Máster Máster Universitario en Ingeniería Informática Obligatorio 0 5 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Internet y Sistemas Distribuidos Grado en Ingeniería Informática Obligatorio 0 96 Proyecto Fin de Carrera Ingeniero en Informática Obligatorio 0 6 Trabajo Fin de Grado. Mención en Ingeniería del Software Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 8 Trabajo Fin de Máster Máster Universitario en Ingeniería Informática Obligatorio 0 10 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Inteligencia de Negocio Máster Universitario en Ingeniería Informática Obligatorio 0 12 Internet y Sistemas Distribuidos Grado en Ingeniería Informática Obligatorio 0 60 Proyecto Fin de Carrera Ingeniero en Informática Obligatorio 0 13 Redes Grado en Ingeniería Informática Obligatorio 0 60 Trabajo Fin de Grado. Mención en Ingeniería del Software Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 8 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Inteligencia de Negocio Máster Universitario en Ingeniería Informática Obligatorio 0 12 Internet y Sistemas Distribuidos Grado en Ingeniería Informática Obligatorio 0 60 Redes Grado en Ingeniería Informática Obligatorio 0 60 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Inteligencia de Negocio Máster Universitario en Ingeniería Informática Obligatorio 0 12 Internet y Sistemas Distribuidos Grado en Ingeniería Informática Obligatorio 0 70 Trabajo Fin de Grado. Mención en Ingeniería del Software Grado en Ingeniería Informática Obligatorio 0 19 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Inteligencia de Negocio Máster Universitario en Ingeniería Informática Obligatorio 0 6 Internet y Sistemas Distribuidos Grado en Ingeniería Informática Obligatorio 0 50 Redes Grado en Ingeniería Informática Obligatorio 0 30 Trabajo Fin de Grado. Mención en Ingeniería del Software Grado en Ingeniería Informática Obligatorio 0 16 Trabajo fin de máster Máster Universitario en Ciencias Documentales en el entorno digital Obligatorio 0 3,3 Vigilancia e inteligencia competitiva: diseño de servicios de información estratégica Máster Universitario en Ciencias Documentales en el entorno digital Optativo 0 30 Trabajos de fin de grado y máster Dirigidos o codirigidos por el/la docente desde el año 2013. 2016/2017 2015/2016 2014/2015 Renovación tecnológica de aplicación de Inventario de entidade bancaria. Fase I Integración de herramientas de virtualización de datos con Apache Spark Integración de Herramientas de Virtualización de Datos con las Nuevas Bases de Datos en Hadoop: Presto DB, Apache Ignite y Apache Spark Diseño e implementación de una aplicación web JAVA para una protectora de animales Puede consultar los méritos de investigación seleccionando un tipo de mérito y el año. Proyectos, contratos y convenios de I+D+I Patentes, registros y modelos de utilidad Artículos en revistas de investigación Capítulos de libros Tésis doctorales dirigidas Comunicaciones en congresos 2024 2018 2017 2016 2015 ... 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 2003 2002 2001 1997 Entidad financiadora Consellería de Educación, Ciencia, Universidades e Formación Profesional Investigadores principales Fidel Cacheda Seijo Tipo Proyecto Programas Autonomicos Fechas Desde 01/01/2024 a 20/11/2026 Entidad financiadora DENODO TECHNOLOGIES S.L. Investigadores principales Paula Montoto Castelao Tipo Contrato Fechas Desde 01/05/2018 a 30/09/2018 Entidad financiadora Denodo S.L. Investigadores principales Manuel Álvarez Díaz Tipo Contrato Fechas Desde 27/03/2017 a 26/08/2017 Entidad financiadora DENODO TECHNOLOGIES S.L. Investigadores principales Paula Montoto Castelao Tipo Contrato Fechas Desde 16/10/2017 a 15/09/2018 Entidad financiadora Ministerio de Economía y Competitividad (MINECO) Investigadores principales Victor Carneiro Diaz y Fidel Cacheda Seijo Tipo Proyecto Programas Nacionales Fechas Desde 01/01/2016 a 30/09/2019 Entidad financiadora Consellería de Cultura, Educación e Ordenación Universitaria Investigadores principales Manuel F. González Penedo Tipo Proyecto Programas Autonomicos Fechas Desde 01/01/2016 a 30/11/2019 Entidad financiadora Denodo S.L.U. Investigadores principales Paula Montoto Castelao Tipo Contrato Fechas Desde 12/04/2016 a 11/09/2016 Entidad financiadora Denodo S.L.U. Investigadores principales Carlos Alberto Pan Bermúdez Tipo Contrato Fechas Desde 17/10/2016 a 16/10/2017 Entidad financiadora Denodo S.L. Investigadores principales Juan Raposo Santiago Tipo Contrato Fechas Desde 20/04/2015 a 19/09/2015 Entidad financiadora Denodo S.L. Investigadores principales Carlos Alberto Pan Bermúdez Tipo Contrato Fechas Desde 05/10/2015 a 04/10/2016 Entidad financiadora Consellería de Cultura, Educación e Ordenación Universitaria Investigadores principales Manuel Vilares Ferro Tipo Proyecto Programas Autonomicos Fechas Desde 01/01/2014 a 31/12/2015 Entidad financiadora DENODO TECHNOLOGIES S.L. Investigadores principales Manuel Álvarez Díaz Tipo Contrato Fechas Desde 19/05/2014 a 18/09/2014 Entidad financiadora DENODO TECHNOLOGIES S.L. Investigadores principales Carlos Alberto Pan Bermúdez Tipo Contrato Fechas Desde 10/10/2014 a 09/10/2015 Entidad financiadora Xunta de Galicia Investigadores principales Emilio Gutierrez García Tipo Proyecto Programas Autonomicos Fechas Desde 01/01/2014 a 31/12/2015 Entidad financiadora DENODO TECHNOLOGIES S.L. Investigadores principales Carlos Alberto Pan Bermúdez Tipo Contrato Fechas Desde 02/10/2013 a 01/10/2014 Entidad financiadora DENODO TECHNOLOGIES S.L. Investigadores principales Carlos Alberto Pan Bermúdez Tipo Contrato Fechas Desde 02/11/2012 a 01/11/2013 Entidad financiadora Xunta de Galicia Investigadores principales Ricardo Cao Abad Tipo Proyecto Programas Autonomicos Fechas Desde 01/01/2012 a 31/12/2013 Entidad financiadora DENODO TECHNOLOGIES S.L. Investigadores principales Alberto Pan Bermúdez Tipo Contrato Fechas Desde 02/11/2011 a 01/11/2012 Entidad financiadora Ministerio de Economía y Competitividad Investigadores principales Victor Manuel Carneiro Diaz Tipo Proyecto Programas Nacionales Fechas Desde 01/01/2010 a 31/12/2013 Tipo Proyecto Otros Programas Fechas Desde 01/01/2010 a 31/12/2010 Entidad financiadora Ministerio de Economía y Competitividad Investigadores principales Alberto Pan Bermúdez Tipo Proyecto Otros Programas Fechas Desde 16/12/2010 a 30/04/2012 Entidad financiadora DENODO TECHNOLOGIES S.L. Investigadores principales Alberto Pan Bermúdez Tipo Contrato Fechas Desde 02/11/2010 a 01/11/2011 Entidad financiadora CONSELLERÍA DE ECONOMÍA, EMPREGO E INDUSTRIA Investigadores principales Victor Manuel Carneiro Diaz Tipo Proyecto Programas Autonomicos Fechas Desde 01/01/2010 a 31/12/2010 Entidad financiadora Union Europea Investigadores principales Alberto Pan Bermudez Tipo Proyecto UE Fechas Desde 01/11/2009 a 31/10/2012 Entidad financiadora Dirección General de I+D de la Xunta de Galicia Investigadores principales Javier López Mato Tipo Proyecto Programas Autonomicos Fechas Desde 01/08/2009 a 30/04/2010 Entidad financiadora Consellería de Educación Investigadores principales Víctor Manuel Carneiro Díaz Tipo Proyecto Programas Autonomicos Fechas Desde 01/01/2009 a 16/12/2009 Entidad financiadora Dirección General de I+D de la Xunta de Galicia Investigadores principales Pablo Fernández Freire Tipo Proyecto Programas Autonomicos Fechas Desde 25/02/2008 a 26/12/2008 Entidad financiadora Consellería de Cultura, Educación e Ordenación Universitaria Investigadores principales Victor Manuel Gulías Fernández Tipo Proyecto Otros Programas Fechas Desde 01/01/2008 a 31/12/2010 Entidad financiadora DENODO TECHNOLOGIES S.L. Investigadores principales Victor Manuel Carneiro Díaz Tipo Contrato Fechas Desde 05/10/2007 a 05/10/2008 Entidad financiadora Consellería de Educación Investigadores principales Eduardo Pásaro Méndez Tipo Proyecto Programas Autonomicos Fechas Desde 01/01/2007 a 16/12/2007 Entidad financiadora Secretaría de Estado de Telecomunicación y para la Sociedad de la Información de la Dirección General para el desarrollo de la Sociedad de la Información Investigadores principales Justo Hidalgo Sanz y Alberto Pan Bermúdez Tipo Proyecto Programas Nacionales Fechas Desde 19/02/2007 a 23/11/2007 Entidad financiadora DENODO TECHNOLOGIES S.L. Investigadores principales Victor Manuel Carneiro Díaz Tipo Contrato Fechas Desde 27/10/2006 a 27/10/2007 Entidad financiadora Ministerio de Industria, Turismo y Comercio Investigadores principales Carlos Alberto Pan Bermudez Tipo Proyecto Otros Programas Fechas Desde 01/01/2006 a 31/12/2006 Entidad financiadora DENODO TECHNOLOGIES S.L. Investigadores principales Victor Manuel Carneiro Díaz Tipo Contrato Fechas Desde 05/10/2005 a 05/10/2006 Entidad financiadora Ministerio de Ciencia y Tecnología Investigadores principales Ángel Viña Castiñeriras Tipo Proyecto Programas Nacionales Fechas Desde 31/12/2005 a 31/12/2008 Entidad financiadora Ministerio de Ciencia y Tecnología Investigadores principales Carlos Alberto Pan Bermúdez Tipo Proyecto Programas Nacionales Fechas Desde 01/01/2003 a 31/10/2003 Entidad financiadora Secretaría General de I+D de la Xunta de Galicia Investigadores principales Carlos Alberto Pan Bermúdez Tipo Proyecto Programas Autonomi",
  "content_length": 24289,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:26"
}