{
  "name": "Albert C. S. Chung",
  "homepage": "https://www.cse.ust.hk/~achung",
  "status": "success",
  "content": "Albert C. S. Chung's homepage Albert C. S. Chung (D. Phil., Oriel College, University of Oxford, U.K.) Prof. Chung received his B.Engg. degree (First-Class Honours) in Computer Engineering from the University of Hong Kong in 1995. He was an exchange student at the University of British Columbia, Canada, from 1992-93 with the Cathay Pacific Visiting Student Award. He joined The Hong Kong University of Science and Technology (HKUST) in 1996 and received his M.Phil. degree in Computer Science in 1998. He then joined the Medical Vision Laboratory, Robotics Research Group at the University of Oxford, U.K. as a doctoral research student in 1998 and graduated in 2001 with D.Phil. degree in Engineering Science. Prof. Chung was a Croucher scholar (1998  2001) with the Croucher Foundation Scholarship. He was a visiting scientist at the Artificial Intelligence Laboratory, Massachusetts Institute of Technology, U.S.A. (Sept 2001  Feb 2002). Prof. Chung was honored to receive the British Machine Vision Association Sullivan Thesis Award for the best doctoral thesis submitted to a United Kingdom university in the field of computer vision or natural vision in 2002; the Best Ten Lecturers Award at HKUST in 2010; Best Teaching Award for MSc Program in Information Technology in 2018; and Best Teaching Award for MSc Program in Big Data Technology in 2018. Prof. Chung founded the Lo Kwee-Seong Medical Image Analysis Laboratory in 2005 (2005  2021) with a generous donation from the K.S. Lo Foundation, Hong Kong. The laboratory focused on interdisciplinary research aiming at creating and applying engineering techniques in the area of medical image analysis, with the ultimate goal of improving the quality of healthcare in Hong Kong, China, and other regions. He is now the Director of The HKUST Research Center for Medical Imaging and Analysis. Prof. Chung was the director of the Computer Engineering Undergraduate Programme, HKUST 2010-2012 (Associate director, 2008-2010). He was the UG Coordinator (2015  2016) and Associate Head (2016  2019) at the Department of Computer Science and Engineering, HKUST. Prof. Chung served as the Associate Dean of Engineering (Undergraduate Studies), School of Engineering, HKUST, between Jan 2020 and Dec 2021. In Jan 2022, Prof. Chung joined the Department of Computer Science, University of Exeter, as Chair in Artificial Intelligence (Jan 2022  Aug 2023). From Aug 2023, Prof. Chung is a Full Professor at the Department of Computer Science and Engineering, HKUST. Current Appointments The Hong Kong University of Science and Technology, Clear Water Bay, Hong Kong Professor, Department of Computer Science and Engineering (Aug 2023  present) Director, The HKUST Research Center for Medical Imaging and Analysis (Nov 2023  present) Previous Major Appointments Held University of Exeter, Streatham Campus, Exeter, Devon, United Kingdom, Chair in Artificial Intelligence, Department of Computer Science (Jan 2022  Aug 2023) The Hong Kong University of Science and Technology, Clear Water Bay, Hong Kong Professor, Department of Computer Science and Engineering (2014  2021) Professor (joint),  Department of Chemical and Biological Engineering (2014  2021) Professor (joint),  Department of Electronic and Computer Engineering (2015  2018) Director,  Lo Kwee-Seong Medical Image Analysis Laboratory (2005  2021) Residence Master, Undergraduate Hall VI (2013  2019) and Undergraduate Hall III (2005  2011) Recent Professional Services Meeting Chairs l  Chair, 2019, The 26th international conference on Information Processing in Medical Imaging (IPMI); Paper Selection Committee, IPMI 2021 and 2023 l  Tutorial Chair, 2019, IEEE International Symposium on Biomedical Imaging (ISBI) l  Chair, 2019  2021, IPMI Conference Board Journal Editorships l  Editorial Board Member (Jan 2015  present), Medical Image Analysis l  Editorial Board Member (Jan 2017  present), Computerized Medical Imaging and Graphics l  Guest Editor (2016), Special Issue on Probabilistic Models for Biomedical Image Analysis, Computer Vision and Image Understanding l  Area Editor (Feb 2010  2018), Computer Vision and Image Understanding Invited Talks and Paper l  Invited Talk,  SIAM Conference on Imaging Science (SIAM-IS14), Hong Kong, May 12-14, 2014. l  Invited Lecturer and Session Chair, Biomedical Imaging Summer School, Paris, France, July 9-13, 2012. l  Invited Talk,  SIAM Conference on Imaging Science (SIAM-IS10), Chicago, Illinois, U.S.A., April 12-14, 2010. l  Invited Talk, The first conference on Medical Image Analysis and Clinical Applications (MIACA10), Guangzhou, China, June 10-13, 2010. l  Image Segmentation Methods for Detecting Blood Vessels in Angiography, The 9th International Conference on Control, Automation, Robotics and Vision, ICARCV, Singapore, December 5  8, 2006, pp. 1424  1429. An invited paper to a special session on medical image analysis. Program Committee Members, Area Chairs, and Meeting Organizers in numerous conferences and workshops. Research Interests Medical image analysis, image processing, and computer vision. Current Research Group Members at HKUST Ph.D. (Doctor of Philosophy) Students: 1.     Ms. Ziyi HE 2.     Ms. Wen JI Prizes and Awards ·       First Place (with Mr. Tony Chi Wing MOK) for the results in brain tumor sequence registration challenge (BraTS-Reg) organized by the Medical Image Computing and Computer Assisted Intervention (MICCAI) Society in 2022. ·       First Place (with Mr. Tony Chi Wing MOK) for the results in medial image registration challenge (Learn2Reg) organized by the Medical Image Computing and Computer Assisted Intervention (MICCAI) Society in 2021. ·       First Place (with Mr. Tony Chi Wing MOK) for the results in medial image registration challenge (Learn2Reg) organized by the Medical Image Computing and Computer Assisted Intervention (MICCAI) Society in 2020. ·       Best Teaching Award, MSc Programme in Information Technology, HKUST in 2018. ·       Best Teaching Award, MSc Programme in Big Data Technology, HKUST in 2018. ·       Best Paper Award (with Ms. Qing Zhang), The 7th International Conference on Medical Imaging and Augmented Reality, 2016. ·       Best Paper Award (with Ms. Siqi Bao), The First Workshop on Deep Learning in Medical Image Analysis, 2015. ·       ECCV 2012 Outstanding Reviewer Award. ·       Second Runner-Up (with Dr. Lisa Luo) at the 2012 Student Paper Competition held by IEEE EMBS Hong Kong Chapter, 2012. ·       Best Ten Lecturers Award, HKUST, 2010. ·       First Prize (with Dr. Wilbur Wong) for the results in the Carotid Bifurcation Lumen Segmentation and Stenosis Grading in 3D Segmentation in the Clinic: A Grand Challenge, in conjunction with the 12th International Conference on Medical Image Computing and Computer Assisted Intervention, MICCAI, (MICCAI09), London, UK, September 20  24, 2009. ·       British Machine Vision Association (BMVA) Sullivan Best Thesis Award 2002 in the UK. ·       Croucher Foundation Fellowship (2001  2003, declined). ·       Croucher Foundation Scholarship (1998  2001, doctoral studies at the University of Oxford, UK). ·       Cathay Pacific Visiting Student Award (1993, exchange program at the University of British Columbia, Canada). Publications: DBLP Computer Science Bibliography, Google Scholar, HKUST Institutional Repository · Wen Ji and Albert C. S. Chung, Unsupervised Domain Adaptation for Medical Image Segmentation Using Transformer with Meta Attention, IEEE Transactions on Medical Imaging, accepted for publication, Oct 2023. DOI website. · Alessa Hering, Lasse Hansen, Tony C. W. Mok, Albert C. S. Chung, Hanna Siebert, Stephanie Häger, Annkristin Lange, Sven Kuckertz, Stefan Heldmann, Wei Shao, Sulaiman Vesal, Mirabela Rusu, Geoffrey Sonn, Théo Estienne, Maria Vakalopoulou, Luyi Han, Yunzhi Huang, Pew-Thian Yap, Mikael Brudfors, Yaël Balbastre, Samuel Joutard, Marc Modat, Gal Lifshitz, Dan Raviv, Jinxin Lv, Qiang Li, Vincent Jaouen, Dimitris Visvikis, Constance Fourcade, Mathieu Rubeaux, Wentao Pan, Zhe Xu, Bailiang Jian, Francesca De Benetti, Marek Wodzinski, Niklas Gunnarsson, Jens Sjölund, Daniel Grzech, Huaqi Qiu, Zeju Li, Alexander Thorley, Jinming Duan, Christoph Großbröhmer, Andrew Hoopes, Ingerid Reinertsen, Yiming Xiao, Bennett Landman, Yuankai Huo, Keelin Murphy, Nikolas Lessmann, Bram Van Ginneken, Adrian V Dalca, Mattias P Heinrich, Learn2Reg: comprehensive multi-task medical image registration challenge, dataset and evaluation in the era of deep learning, IEEE Transactions on Medical Imaging, Vol. 42, No. 3, pages 697  712, March 2023. DOI website. · Tony Chi Wing Mok and Albert C. S. Chung, Affine Medical Image Registration with Coarse-to-Fine Vision Transformer, The International Conference on Computer Vision and Pattern Recognition, (CVPR22), New Orleans, Louisiana, USA, June 18  24, 2020, pp. 20803  20812. DOI website. · Tony C. W. Mok and Albert C. S. Chung, Unsupervised Deformable Image Registration with Absent Correspondences in Pre-operative and Post-recurrence Brain Tumor MRI Scans, The 25th International Conference on Medical Image Computing and Computer Assisted Intervention, (MICCAI22), Singapore, September 18  22, 2022, pp. 25  35. DOI website. GitHub. · Yongxiang Huang and Albert C. S. Chung, Population-based Prediction with Edge-Variational Graph Convolutional Network, Medical Image Analysis, (MedIA, 2022). DOI website. · Pei Wang and Albert C. S. Chung, Relax and Focus on Brain Tumor Segmentation, Medical Image Analysis, (MedIA, 2022). DOI website. · Colin S. C. Tsang, Tony C. W. Mok and Albert C. S. Chung, Joint Denoising and Super-Resolution for Fluorescence Microscopy Using Weakly-Supervised Deep Learning, The 1st International Workshop on Medical Optical Imaging and Virtual Microscopy Image Analysis, (MOVI22) in conjunction with the 25th International Conference on Medical Image Computing and Computer Assisted Intervention, (MICCAI22), Singapore, Se",
  "content_length": 63798,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:07"
}