{
  "name": "Alberto Marchetti-Spaccamela",
  "homepage": "http://www.diag.uniroma1.it/users/alberto%20marchetti-spaccamela",
  "status": "success",
  "content": "Alberto Marchetti-Spaccamela | Dipartimento di Ingegneria informatica, automatica e gestionale Salta al contenuto principale Home » Users » Alberto Marchetti Spaccamela Alberto Marchetti-Spaccamela esternostanza: B204telefono: +39 0677274021email uniroma1: alberto.marchetti-spaccamela@uniroma1.it Biografia Alberto Marchetti-Spaccamela  was born in 1954 and graduated in Electronic Engineering at the University of Rome \"La Sapienza\"  in 1977. From 1980 to 1987 he was Researcher  at. the University of Rome \"La Sapienza\",  in 1982-1983 he was  Visiting Scholar at University of California at Berkeley. In 1987 he has been appointed full professor at  the University of Aquila. Since 1991 he is full Professor at the University of Rome \"La Sapienza\", where he currently teaches courses in computer models, encryption and network security, bioinformatics, privacy in the digital society. Since 2021 he is Deputy Rector (Prorettore) for  \"Digital Technologies\" at  the University of Rome \"La Sapienza\". In 2013 - 2018  he was  Director of the Department of \"Computer, Control and Management  Engineering Antonio Ruberti\".  In 2017 the Department has been selected among the 180 University Departments of excellence in Italy. The Department is actively involved in European projects: in 2013-2018 the Department participated  in more than twenty grants funded by EU for a total funding of more than 9 M€. In 2015-2019 he was Director of the Master in \"Sicurezza delle informazioni e Informazione strategica\". In 2017-2021 he was Director of the  Research Center of \"Cyber Intelligence and Information Security (CIS)\". His main research interests concern algorithm analysis and design, and their applications to computational biology, networks,  real time systems and cybersecurity.He has co-authored more than 180 publications in journals, conferences papers and book chapters; according to Google Scholar his publications have received  more than 9000 citations and his H-index is 46. He has co-authored the book “Complexity and approximation: Combinatorial optimization problems and their approximability properties” (Springer Verlag, three editions) that received more than 2500 citations; he has edited eight proceedings of international peer reviewed conferences and has written five textbooks  in Italian. He has been member of the EATCS Council  (European Association of Theoretical Computer Science) and  of ESA Steering committee (European Symposium on Algorithms) and of WG (Graph Theoretic concepts in Computer science). Recently he co-authored the  Italian National Framework for Cybersecurity and Data Protection,  with the support of the  Authority for the Protection of Personal Data (Garante per la Privacy) and the Information Security Department of the Presidency of the Council of Ministers. He has participated in many European projects and he has been PI at Sapienza  of the following European projects:  MAP (network of excellence HCM) AMORE (RTN), APPOL, GRAAL (COST project, national delegate), COSIN, AEOLUS, PANORAMA, FRONTS, EUSACOU - ISMES.  He is member of  ERABLE, an  international research team of INRIA on Bioinformatics. He has given invited lectures at Sirocco '98 (Amalfi), SOFSEM '98 (Jasna, Slovakia), XXIV Dutch Conference on Mathematics of Operations Research, 1999 (Lunteren, Netherlands), School of Randomized Algorithms (Santorini, Greece 1997), MFCS 1998 (Brno, Czech Rep.), WSDAAL 99 (L'Aquila), School of optimization algorithms for the improvements of the rail system (Costanza, 2000), AEOLUS workshop (Nice, France 2007) DFG workshop networks (Freiburg, Germany 2007), Workshop on approximate algorithms (Kalkata, India 2006), WG 2011 Workshop on Graphtheoretic concepts in computer science (Tepla, Czech Rep.), 2013 ECCO (European Conference in Combinatorial Optimization, Paris, France). He has also given several invited lectures at the  Dagstuhl Center (Germany), Aussois (France)  and Bertinoro that organize invitations in computer science workshops. He has co-founded  two Sapienza spin-off companies  (WLAB, WSENSE); in 2019 he sold his participations; since then he has no role in the companies. keywords AlgorithmsBioengineering for Molecular Biology and BioinformaticsSecurity for cyber-physical systems Membro di Algorithm Design and Engineering Computer Networks and Pervasive Systems Cybersecurity Algorithms and Data Science Ultime pubblicazioni SoK: Cybersecurity Regulations, Standards and Guidelines for the Healthcare Sector in 2023 IEEE International Conference on Intelligence and Security Informatics (ISI) 2023 The Computational Complexity of Feasibility Analysis for Conditional DAG Tasks in ACM TRANSACTIONS ON PARALLEL COMPUTING 2023 The Safe and Effective Use of Low-Assurance Predictions in Safety-Critical Systems in 35th Euromicro Conference on Real-Time Systems (ECRTS 2023) 2023 Total Completion Time Scheduling Under Scenarios in Approximation and Online Algorithms - 21st International Workshop, WAOA 2023 A universal error measure for input predictions applied to online graph problems in Advances in Neural Information Processing Systems 2022 Approximation Algorithms for Replenishment Problems with Fixed Turnover Times in ALGORITHMICA 2022 Algorithms for hierarchical and semi-partitioned parallel scheduling in JOURNAL OF COMPUTER AND SYSTEM SCIENCES 2021 Last 50 publications © Università degli Studi di Roma \"La Sapienza\" - Piazzale Aldo Moro 5, 00185 Roma",
  "content_length": 5443,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:21"
}