{
  "name": "Alberto H. F. Laender",
  "homepage": "http://homepages.dcc.ufmg.br/~laender",
  "status": "success",
  "content": "Alberto H. F. Laender Alberto H. F. Laender Professor Department of Computer Science Universidade Federal de Minas Gerais Contact: DCC/ICEx, Room 4037 Tel: +55 (31) 3409-5868 Fax: +55 (31) 3409-5858 Email: laender AT dcc DOT ufmg DOT br SHORT BIO Alberto H. F. Laender holds a BS degree in Electrical Engineering and an MSc degree in Computer Science, both from the Federal University of Minas Gerais, Brazil, and a PhD degree in Computing from the University of East Anglia, UK. He joined the Computer Science Department of the Federal University of Minas Gerais in 1975, where he is currently a Full Professor and the head of the Database Research Group. In 1997, he was a Visiting Scholar at HP Labs in Palo Alto, California, working in the Picture Project team led by Dr. Moshé Zloof. He has served on the advisory committee of several Brazilian research funding agencies, having chaired the CNPq Computer Science Advisory Committee from 2010 to 2012. He was also a member of ACM SIGMOD's Advisory Board (2006-2010) and SIGMOD's Jim Gray PhD Dissertation Award Committee (2008-2011). Prof. Laender has also served as a program committee member for several national and international conferences and workshops on databases and Web-related topics, such as VLDB, ER, CIKM, WWW, WIDM, WebDB, JCDL, TPDL, DocEng, EC-Web, SPIRE, ICDE, SIGIR, AMW, SBBD, WebMedia and HT. He was also program committee chair of SPIRE 2002 and SBBD 2003, and program committee co-chair of WIDM 2003, WIDM 2004, CIKM 2007, AMW 2010 and WWW 2013 Workshops. He also served as the first Chief-Editor of the Journal of Information and Data Management (JIDM), the official publication of the Special Interest Group on Databases of the Brazilian Computer Society, and as a Steering Committee member of CIKM (2007-2013). Currently, he is a member of the Steering Committee of ER and AMW, and serves on the Editorial Boards of JIDM, IP&M and JCSE, as well as General Co-Chair for VLDB 2018. He is a founder-member of the Brazilian Computer Society and one of the co-founders of Akwan Information Technologies, a Brazilian search technology company that was acquired by Google Inc. in 2005 to become its Research and Development Center for Latin America. Prof. Laender is a member of the Brazilian Academy of Science and of the Brazilian National Academy of Engineering, and in 2010 he was awarded the National Order of the Scientific Merit by the Brazilian President. He is the author of more than 180 refereed journal and conference papers, and his current research interests include Databases, Web Data Management, Digital Libraries and Bibliometrics. EDUCATION 1997 - 1997: Post-Doc HP Labs, Palo Alto, USA 1980 - 1984: PhD in Computing University of East Anglia, Norwich, UK 1975 - 1979: MSc in Computer Science Universidade Federal de Minas Gerais, Belo Horizonte, Brazil 1970 - 1974: BS in Electrical Engineering Universidade Federal de Minas Gerais, Belo Horizonte, Brazil PUBLICATIONS DBLP Lattes PhD STUDENTS Thiago Magela Rodrigues Dias. A Study on the Brazilian Scientific Production Based on Data fron the Lattes Platform (in Portuguese), 2016. Evandrino Gomes Barros. Keyword-based Query Processing over XML Streams. 2012. Anderson de Almeida Ferreira. Contributions for Solving the Author Name Ambiguity Problem in Bibliographic Citations. 2012. Moisés Gomes de Carvalho, Evolutionary Approaches to Data Integration Related Problems, 2009. Guilherme Tavares de Assis, A Genre-Aware Approach to Focused Crawling of Web Pages, 2008. Karla Albuquerque Vasconcelos Borges, Using an Ontology of Urban Places for Discovering and Extracting Geospatial Evidence on the Web (in Portuguese), 2006. Altigran Soares da Silva, Example-Based Strategies for Extracting Semistructured Web Data, 2002. Clodoveu Augusto Davis Jr., Multiple Representations in Geographic Information Systems (in Portuguese), 2000. Luciano Romero Soares de Lima, Automatic Categorization of Medical Documents (in Portuguese), 2000. MSc STUDENTS (From 2009 onwards) Tiago Henrique Costa Alves. Dynamic Prediction of ICU Mortality Risk Using Domain Adaptation (co-supervision with Adriano Veloso), 2018. Jeancarlo Campos Leão. An Approach to Detecting Communities from Social Interaction Sequences (in Portuguese), 2018. Wellington José das Dôres. A Study on the Brazilian Academic Genealogy (in Portuguese), 2017. Hugo Silva Santos. A Study on the Brazilian Stock Exchange Marke Based on Data from Twitter (in Portuguese), 2016. Isac Sandin Ribeiro. Tag Recomendation for Sumarizing Academic Profiles (in Portuguese), 2015. Juán Felipe Delgado Garcia. An Analysis of the Computer Science Scientific Production in Latin America (in Portuguese). 2015 Bruno Leite Alves. A Temporal Analysis of Scientific Communitiesdades (in Portuguese), 2013. Lucas Cunha de Oliveira Miranda. Caracterization of Access Patterns in Specialized Media Portals (in Portuguese), 2013 Diego Marinho de Oliveira. A Filter Flow-Based Approach for Entity Recognition in Twitter Messages. (in Portuguese), 2012. Cristiano Nascimento. A Framework for Seaching and Recommending Scientific Articles (in Portuguese), 2011. Gabriel Silva Gonçalves. Automatic Selection of Training Data for a Genetic Programming-Based Record Deduplication (in Portuguese), 2010 Luiz Guilherme Pais dos Santos. Exploring Popularity for Seaching Information in Blogs (in Portuguese), 2009. Waister Silva Martins. Automaticaly Assessing Scientific Conferences: A Case Study in Computer Science (in Portuguese), 2009. Links",
  "content_length": 5514,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:19"
}