{
  "name": "Alberto Abad",
  "homepage": "https://www.l2f.inesc-id.pt/wiki/index.php/Alberto_Abad_Gareta",
  "status": "success",
  "content": "Alberto Abad Gareta - HLT@INESC-ID Alberto Abad Gareta From HLT@INESC-ID Alberto AbadProfessor Associado | SA-HLT 341F-5DB8-AF2D 0000-0003-2122-5148 M5hzAIwAAAAJ J-3281-2013 +351213100300     231 alberto.abad@inesc-id.pt www.hlt.inesc-id.pt/w/Alberto_Abad_Gareta Alberto Abad obtained the Telecommunication Engineering degree and the PhD degree on 2002 and 2007 respectively, both from the Technical University of Catalonia (UPC). Currently, he is an Associate Professor at the Department of Computer Science and Engineering (DEI) of Instituto Superior Técnico (IST) and researcher at INESC-ID. He is the coordinator of the Human LanguageTechnologies laboratory (HLT) at INESC-ID and the deputy coordinator of the Master in Computer Science and Engineering of IST. He is also an IEEE Senior member, an ACM member, and an ISCA member. Alberto Abad has developed his research career in the area of human language technologies for more than 15 years. His research interests include robust speech recognition, speaker and language characterization, applied machine learning, health-care applications, and privacy-preserving speech processing. During these years, Alberto Abad has co-authored over 100 peer-reviewed publications in top-tier conferences and scientific journals of the field. He has been Principal Investigator of FCT funded project VITHEA and INESC-ID representative in the DIRHA European project, Biovisualspeech CMU-Portugal project, and TAPAS ITN. He is currently INESC-ID/IST PI at Accelerat.ai project. He has also been team member in various Spanish and Portuguese national and international projects, and team leader in international technological evaluation challenges achieving excellent results. He has supervised and co-supervised more than 25 M.Sc. thesis and 1 Ph.D. thesis (+5 on-going) and lectured in courses at both UPC and IST on a variety of topics, including signal processing, machine learning, programming principles, object oriented programming and compilers. Alberto Abad has been actively involved in research community activities, including conference organization, and closely collaborated with local industry and start-up companies. Research Interests Multi-microphone processing Robust Speech Recognition Speaker and language characterization Speech and language technology for health-care applications Privacy-preserving speech processing Resume PDF Version [1] Total Publications: 149Article (Author)Exploring features for membership inference in ASR model auditingFrancisco Teixeira, Karla Pizzi, Raphael Olivier, Alberto Abad, Bhiksha Raj, Isabel Trancoso, Computer Speech & Language, vol. 95, DOI https://doi.org/10.1016/j.csl.2025.101812, January 2026CAMÕES: A Comprehensive Automatic Speech Recognition Benchmark for European PortugueseCarlos Manuel Ferreira Carvalho, Francisco Teixeira, Catarina Botelho, Anna Maria Pompili, Rubén Solera Ureña, Sérgio Paulo, Mariana Julião, Thomas Rolland, John Mendonça, Diogo Pereira, Isabel Trancoso, Alberto Abad, ASRU, December 2025Unveiling Interpretability in Self-Supervised Speech Representations for Parkinson's DiagnosisDavid Gimeno-Gómez, Catarina Botelho, Anna Maria Pompili, Alberto Abad, Carlos-D. Martínez-Hinarejos, IEEE Journal of Selected Topics in Signal Processing, pages 1-14, DOI 10.1109/JSTSP.2025.3539845, February 2025Speech as a Biomarker for Disease DetectionCatarina Botelho, Alberto Abad, Tanja Schultz, Isabel Trancoso, IEEE Access, vol. 12, pages 184487 - 184508, DOI 10.1109/ACCESS.2024.3506433, November 2024Privacy-oriented manipulation of speaker representationsFrancisco Teixeira, Alberto Abad, Bhiksha Raj, Isabel Trancoso, IEEE Access, vol. 12, pages 82949-82971, DOI 10.1109/ACCESS.2024.3409067, June 2024The BioVisualSpeech Corpus of Words with Sibilants for Speech Therapy Games DevelopmentSofia Cavaco, Isabel Guimarães, Mariana Ascensão, Alberto Abad, Ivo Anjos, Francisco Luís Campos Pais de Oliveira, Sofia Martins, Nuno Marques, Maxine Eskenazi, João Magalhães, Margarida Grilo, Information, vol. 11, pages 470, DOI https://doi.org/10.3390/info11100470, October 2020Pragmatic Aspects of Discourse Production for the Automatic Identification of Alzheimer's DiseaseAnna Maria Pompili, Alberto Abad, David Martins de Matos, Isabel P. Martins, IEEE Journal of Selected Topics in Signal Processing, pages 1-11, DOI 10.1109/JSTSP.2020.2967879, January 2020Preserving Privacy in Speaker and Speech CharacterisationAndreas Nautsch, Abelino Jiménez, Amos Treiber, Jascha Kolberg, Catherine Jasserand, Els Kindt, Héctor Delgado, Massimiliano Todisco, Mohamed Amine Hmani, Aymen Mtibaa, Mohammed Ahmed Abdelraheem, Alberto Abad, Francisco Teixeira, Driss Matrouf, Marta Gomez-Barrero, Dijana Petrovska-Delacretaz, Gerard Chollet, Nicholas Evans, Thomas Schneider, Jean-François Bonastre, Bhiksha Raj, Isabel Trancoso, Christoph Busch, Computer Speech & Language, vol. 58, pages 441--480, DOI https://doi.org/10.1016/j.csl.2019.06.001, November 2019ALBAYZIN Query-by-example Spoken Term Detection 2016 evaluationJavier Tejedor, Doroteo T. Toledano, Paula Lopez-Otero, Laura Docio-Fernandez, Jorge Proença, Fernando Perdigão, Fernando García-Granada, Emilio Sanchis, Anna Maria Pompili, Alberto Abad, EURASIP Journal on Audio, Speech, and Music Processing, vol. 2, DOI https://doi.org/10.1186/s13636-018-0125-9, April 2018Automatic word naming recognition for an on-line aphasia treatment systemAlberto Abad, Anna Maria Pompili, Angela Costa, Isabel Trancoso, José Fonseca, Gabriela Leal, Luisa Farrajota, Isabel P. Martins, Computer Speech and Language, vol. 27, n. 6, pages 1235-1248, DOI http://dx.doi.org/10.1016/j.csl.2012.10.003, September 2013Integration of beamforming and uncertainty-of-observation techniques for robust ASR in multi-source environmentsRamon Fernandez Astudillo, Dorothea Kolossa, Alberto Abad, Steffen Zeiler, Rahim Saeidi, Pejman Mowlaee, João Paulo da Silva Neto, Rainer Martin, Computer Speech and Language, vol. 27, n. 3, pages 837-850, May 2013In Proceedings (Author)CAMÕES: A Comprehensive Automatic Speech Recognition Benchmark for European PortugueseCarlos Manuel Ferreira Carvalho, Francisco Teixeira, Catarina Botelho, Anna Maria Pompili, Rubén Solera Ureña, Sérgio Paulo, Mariana Julião, Thomas Rolland, John Mendonça, Diogo Pereira, Isabel Trancoso, Alberto Abad, ASRU, December 2025On the Relevance of Clinical Assessment Tasks for the Automatic Detection of Parkinson’s Disease Medication State from SpeechDavid Gimeno-Gómez, Rubén Solera Ureña, Anna Maria Pompili, Carlos-D. Martínez-Hinarejos, Rita Cardoso, Isabel Guimarães, Joaquim J Ferreira, Alberto Abad, Proceedings of Interspeech 2025, International Speech Communication Association (ISCA), doi: 10.21437/Interspeech.2025-793, pages 5273-5277, International Speech Communication Association (ISCA), August 2025Exploring Linear Variant Transformers and k-NN Memory Inference for Long-Form ASRCarlos Manuel Ferreira Carvalho, Alberto Abad, Proc. Interspeech, August 2025Speech reference intervals: an assessment of feasibility in depression symptom severity predictionLauren White, Ewan Carr, Judith Dineley, Catarina Botelho, Pauline Conde, Faith Matcham, Carolin Oetzmann, Amos Folarin, George Fairs, Agnes Norbury, Stefano Goria, Srinivasan Vairavan, Til Wykes, Richard Dobson, Vaibhav Narayan, Matthew Hotopf, Alberto Abad, Isabel Trancoso, Nicholas Cummins, Interspeech 2025, August 2025Acoustic and Linguistic Biomarkers for Cognitive Impairment Detection from SpeechCatarina Botelho, David Gimeno-Gómez, Francisco Teixeira, John Mendonça, Patrícia Pereira, Diogo A.P. Nunes, Thomas Rolland, Anna Maria Pompili, Rubén Solera Ureña, Maria da Ponte, David Martins de Matos, Carlos-D. Martínez-Hinarejos, Isabel Trancoso, Alberto Abad, Proceedings of Interspeech 2025, International Speech Communication Association (ISCA), doi: 10.21437/Interspeech.2025-91, pages 1418-1422, International Speech Communication Association (ISCA), August 2025AC-Mix: Self-Supervised Adaptation for Low-Resource Automatic Speech Recognition using Agnostic Contrastive MixupCarlos Manuel Ferreira Carvalho, Alberto Abad, ICASSP, ICASSP 2025 - 2025 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), pages 1-5, March 2025Accelerat.AI: INESC-ID/IST-Universidade de Lisboa contributions towards improved conversational agents in European PortugueseAlberto Abad, Sérgio Paulo, Rubén Solera Ureña, Anna Maria Pompili, Proceedings of IberSPEECH 2024, International Speech Communication Association (ISCA), doi: 10.21437/IberSPEECH.2024-61, pages 293-296, International Speech Communication Association (ISCA), November 2024Privacy-preserving Machine Learning for Remote Speech ProcessingFrancisco Teixeira, Alberto Abad, Bhiksha Raj, Isabel Trancoso, Proceedings IberSpeech 2024, pages 246-250, International Speech Communication Association (ISCA), November 2024Introduction To Partial Fine-tuning: A Comprehensive Evaluation Of End-to-end Children’s Automatic Speech Recognition AdaptationThomas Rolland, Alberto Abad, Interspeech 2024, September 2024Macro-descriptors for Alzheimer’s disease detection using large language modelsCatarina Botelho, John Mendonça, Anna Maria Pompili, Tanja Schultz, Alberto Abad, Isabel Trancoso, Interspeech, September 2024Shared-Adapters: A Novel Transformer-based Parameter Efficient Transfer Learning Approach For Children’s Automatic Speech RecognitionThomas Rolland, Alberto Abad, Interspeech 2024, pages 2370-2374, September 2024Improving Membership Inference in ASR Model Auditing with Perturbed Loss FeaturesFrancisco Teixeira, Karla Pizzi, Raphael Olivier, Alberto Abad, Bhiksha Raj, Isabel Trancoso, Trustworthy Speech Processing (TSP) Workshop, Satellite Workshop, International Conference on Acoustics, Speech and Signal Processing (ICASSP), April 2024Improved Children’s Automatic Speech Recognition Combining Adapters and Synthetic Data AugmentationThomas Rolland, Alberto Abad, ICASSP 2024 - 2024 IEEE International Conferenc",
  "content_length": 53780,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:15"
}