{
  "name": "Alberto Quattrini Li",
  "homepage": "https://web.cs.dartmouth.edu/people/alberto-quattrini-li",
  "status": "success",
  "content": "Alberto Quattrini Li | Department of Computer Science Skip to main content Alberto Quattrini Li Associate Professor Appointments Associate Professor of Computer Science Area of Expertise Robotics Biography My research activity covers the fields of autonomous mobile robotics and multiagent systems. In particular, one of the main research thrusts involves the study, development, and assessment of techniques for autonomous decision-making in the exploration problem, where one or more robots are employed to discover features of environments—e.g., obstacles, water quality. The testing of our algorithms focus directly upon real robots, such as ground robots and/or marine robots. The long-term goal is to design ubiquitous collaborative multirobot systems operating in real world environments to enable applications, such as environmental monitoring and mapping. View More Education B.Sc. Computer Science and Engineering, Universita di Pisa, 2009 M.Sc. Computer Science and Engineering, Politecnico di Milano, 2011 Ph. D. Computer Science and Engineering, Politecnico di Milano, 2015 View More Taught Courses COSC 10 Problem Solving via Object-Oriented Programming COSC 81 Principles of Robot Design and Programming COSC 76 Artificial Intelligence View More Publications S. Lensgraf, D. Balkcom, and A. Quattrini Li, \"Buoyancy enabled autonomous underwater construction with cement blocks,\" in IEEE International Conference on Robotics and Automation (ICRA), 2023 S. Rahman, A. Quattrini Li, and I. Rekleitis, \"SVIn2: A multi-sensor fusion-based underwater SLAM system,\" The International Journal of Robotics Research, vol. 41, no. 11-12, pp. 1022–1042, 2022. M. Roznere and A. Quattrini Li, \"Underwater monocular depth estimation using single-beam echo sounder,\" in Proceedings of the IEEE International Conference on Intelligent Robots and Systems (IROS), 2020. M. Jeong and A. Quattrini Li, \"Risk Vector-based Near miss and Real-time Obstacle Avoidance for Autonomous Surface Vehicles,\" in Proceedings of the IEEE International Conference on Intelligent Robots and Systems (IROS), 2020. A. Quattrini Li, P. K. Penumarthi, J. Banfi, N. Basilico, J. O'Kane, I. Rekleitis, S. Nelakuditi, and F. Amigoni, \"Multi-robot Online Sensing Strategies for the Construction of Communication Maps,\" Autonomous Robots,1–21. 2019. J. Banfi, A. Quattrini Li, I. Rekleitis, F. Amigoni, and N. Basilico, \"Strategies for coordinated multirobot exploration with recurrent connectivity constraints,\" Autonomous Robots, vol. 42, pp. 875–894, 2018. S. Manjanna, A. Quattrini Li, R. N. Smith, I. Rekleitis, and G. Dudek, \"Heterogeneous multirobot system for exploration and strategic water sampling,\" in Proceedings of the IEEE International Conference on Robotics and Automation (ICRA), 2018. A. Quattrini Li, R. Fioratto, F. Amigoni, and V. Isler, \"A search-based approach to solve pursuit-evasion games with limited visibility in polygonal environments,\" in Proceedings of the International Conference on Autonomous & Multiagent Systems (AAMAS), 2018. A. Quattrini Li, R. Cipolleschi, M. Giusto, and F. Amigoni, \"A semantically-informed multirobot system for exploration of relevant areas in search and rescue settings,\" Autonomous Robots, vol. 40, no. 4, pp. 581–597, 2016. A. Quattrini Li, M. Xanthidis, J. M. O'Kane, and I. Rekleitis, \"Active localization with dynamic obstacles,\" in Proceedings of the IEEE/RSJ International Conference on Intelligent Robotics Systems (IROS), 2016, pp. 1902–1909. View More Contact Alberto.Quattrini.Li@dartmouth.edu Engineer and Comp Science Ctr, Room 108 HB 6211 Departments Computer Science Related Links Personal Website Reality and Robotics Lab website Reality and Robotics Lab YouTube Connect Connect Contact Us Contact Us inclusivity at dartmouth Dartmouth is committed to academic excellence and encourages the open exchange of ideas within a culture of mutual respect. People with different backgrounds, life experiences, and perspectives make the Dartmouth community diverse, which enhances academic excellence.",
  "content_length": 4042,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:24"
}