{
  "name": "Alberto Bartesaghi",
  "homepage": "http://cryoem.cs.duke.edu",
  "status": "success",
  "content": "Bartesaghi Lab – Duke University Skip to content In situ structure determination using nextPYPIn-situ structure determination protocols in nextPYPMiLoPYP: self-supervised molecular pattern miningMiLoPYP: self-supervised molecular pattern miningnextPYP: a scalable platform for single-particle cryo-ETA scalable platform for single-particle cryo-ETSmartScope: Automated cryo-EM specimen evaluationSmartScope: Automated cryo-EM specimen evaluationBISECT: High-throughput, high-resolution tomographyBISECT: High throughput, high-resolution tomographyStructure, 2018. Atomic resolution structure of β-galactosidase - copy - copyHigh resolution cryo-electron microscopyCryo-EM Structures Reveal Mechanism and Inhibition of DNA Targeting by a CRISPR-Cas Surveillance ComplexDNA targeting by a CRISPR-Cas complexImage credit: V. Falconieri, NCI / Source: S. Subramaniam, NCI Breaking Cryo-EM Resolution Barriers to Facilitate Drug DiscoveryTargets bound to small-molecule inhibitorsImage credit: V. Falconieri, NCI / Source: S. Subramaniam, NCI 2.3 Å Resolution Cryo-EM Structure of Human p97 and Mechanism of Allosteric InhibitionAllosteric inhibition of a cancer targetImage credit: V. Falconieri, NCI / Source: S. Subramaniam, NCI 2.2 Å Resolution Cryo-EM Structure of β-galactosidase in Complex with a Cell-permeant InhibitorMetabolic enzyme bound to PETG inhibitorImage credit: V. Falconieri, NCI / Source: S. Subramaniam, NCI Structure of β-galactosidase at 3.2-Å Resolution Obtained by Cryo-Electron MicroscopyRadiation damage upon electron irradiationImage credit: V. Falconieri, NCI / Source: S. Subramaniam, NCI Protein Secondary Structure Determination by Constrained Single-Particle Cryo-Electron TomographyConstrained single-particle tomographyImage credit: D. Bliss, NLM / Source: S. Subramaniam, NCI Molecular Architectures of Trimeric SIV and HIV-1 Envelope Glycoproteins on Intact Viruses: Strain-Dependent Variation in Quaternary StructureArchitecture of SIV and HIV-1 env glycoproteinsImage credit: D. Bliss, NLM / Source: S. Subramaniam, NCI research cover art news resources team join",
  "content_length": 2098,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:16"
}