{
  "name": "Aldeida Aleti",
  "homepage": "https://research.monash.edu/en/persons/aldeida-aleti",
  "status": "success",
  "content": "Aldeida Aleti - Monash University Aldeida Aleti public CV View Scopus Profile Aldeida Aleti Professor Professor, Department of Software Systems & Cybersecurity https://orcid.org/0000-0002-1716-690X EmailAldeida.Aletimonashedu Accepting PhD StudentsPhD projects<a href=\"https://supervisorconnect.it.monash.edu/\" onclick=\"target='_blank';\">https://supervisorconnect.it.monash.edu/</a> 20092025 Research activity per year Personal profile BiographyAldeida's research interests are in the area of Automated Software Engineering, which aims at creating machines that write software, from requirements elicitation, to design, code generation, testing, and finally code repair. This involves the application and advancement of novel Artificial Intelligence and optimisation techniques. Aldeida Aleti's webpage Honors and awards FIT Dean's Award for Excellence in Research by an early career researcher, Monash University. 2016.Best Paper Award, International Conference on Engineering of Complex Computer Systems (CoRE ranked A), for the paper \"Fitness Landscape Characterisation for Constrained Software Architecture Optimisation Problems\". This is the seminal paper in characterising problem difficulty in Software Engineering. 2015.Outstanding Contribution in Reviewing, in recognition of the contributions made to the quality of the Journal of Systems and Software (CoRE A), Elsevier. 2015.Invitation to the prestigious Heidelberg Laureate Forum. Only 200 of the best early career researchers in the world (working in Computer Science and Mathematics) are selected to participate in this event, and meet winners of the Turing award and Nevanlinna Prize (the two most prestigious prizes in computer science), and Fields Medal and Abel Prize (in mathematics) for an inspiring week in Heidelberg. 2014.Discovery Early Career Researcher Award, 2013Dean’s Commendation for Best PhD Thesis. Faculty of Information and Communication Technologies, Swinburne University of Technology. 2012.Best paper award nomination, World Congress on Computational Intelligence (CoRE ranked A), for the paper Adaptive Range Parameter Control. 2012.ACM SIGBED/SIGSOFT Frank Anger Memorial Award, Awarded by the Executive Committees of SIGBED and SIGSOFT, with support from the US National Science Foundation for significant contributions to the area of Software Engineering. 2011.ACM Sigsoft Distinguished Paper Award for the paper Architecture-based reliability evaluation under uncertainty, presented at the International Conference on Quality of Software Architectures. 2011.Excellence Fund Grant for Postgraduate Studies’ ($36,000), awarded by the Albanian Ministry of Education for exceptional achievements. 2010.SIGSOF CAPS Award, Automated Software Engineering Conference (CoRE A). 2009.My work in software architecture optimisation was funded by the Commonwealth of Australia, Swinburne University Postgraduate Research Award, and AutoCRC ($147,000). 2009. Monash teaching commitmentAldeida has experience as the Chief Examiner for the following units in the Faculty of IT: FIT4002 Software Engineering Industry Experience Studio ProjectFIT4012 Advanced topics in computational scienceFIT5136 Software Engineering Aldeida has experience as the Lecturer for the following units in the Faculty of IT: FIT3077 Software Engineering Architecture and DesignFIT5136 Software EngineeringFIT1008 Introduction to computer scienceFIT4012 Advanced topics in computational scienceCommunity serviceService to profession Co-organiser of the tutorial on \"Fitness Landscape Characterisation of Optimisation Problems\", Genetic and Evolutionary Computation Conference (CoRE A). 2017.Mentor at the VIC ICT for women mentoring program. 2016.Special sessions chair at the Australasian Conference on Artificial Life and Computational Intelligence. 2017.Workshops chair at the Australasian Software Engineering Conference. 2015. Co-founded the Doctoral Symposium at the Australasian Software Engineering Conference. 2013.Editor of the special issue on Quality optimisation of software architectures and design specifications published at the Journal of Systems and Software (CoRE A). 2013.Assessor of grants at Australian Research Council, since 2015. Reviewer in the following journals/ conferences: IEEE Transaction on Evolutionary Computation (CoRE A*)IEEE Transaction on Software Engineering (CoRE A*)Automated Software Engineering (CoRE A)European Journal of Operational Research (CoRE A)Computer Journal (CoRE A)Journal Information and Software TechnologySwarm and Evolutionary ComputationInternational Joint Conference on Artificial Intelligence (CoRE A*)  International Conference on the Quality of Software Architectures (CoRE A)Australasian Software Engineering Conference International Conference on Computational Science (CoRE A)International Conference on Engineering of Complex Computer Systems (CoRE A)Asia Pacific Symposium of Intelligent and Evolutionary Systems International Conference on Engineering of Complex Computer Systems (CoRE A)Symposium on Search-Based Software Engineering (CoRE A)International Conference on Software Architecture, Tool Demos (CoRE A)Transactions on Internet Technology. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationSoftware Engineering, Doctor of Philosophy (PhD), Swinburne University of TechnologyAward Date: 17 Oct 2012Computer Engineering, Master of Computer Engineering, Universiteti Politeknik i Tiranës (Polytechnic University of Tirana)Award Date: 1 Dec 2008Computer Engineering, Bachelor Honours Degree, Yildiz Technical UniversityAward Date: 15 Jun 2005 Research area keywordsAutomated software engineeringFitness landscape characterisationOptimisationSearch based software engineering Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2014 2016 2019 2021 2022 2023 2028 6 Active 11 Finished Projects per year Software Engineering for Social Good PhD ScholarshipAleti, A. (Primary Chief Investigator (PCI)) & Tack, G. (Chief Investigator (CI))A&A Family Gift9/02/25 → 31/03/28Project: Research Intelligent Robotics for Pharmaceutical Formulation DevelopmentKulic, D. (Primary Chief Investigator (PCI)), Burke, M. (Chief Investigator (CI)), Pham, H. (Partner Investigator (PI)), Vong, C. (Associate Investigator (AI)), Aleti, A. (Chief Investigator (CI)) & Say, B. (Chief Investigator (CI))15/09/24 → 14/09/27Project: Research RAISE: RAISE: Creating Responsible AI Software Engineering CapabilityTantithamthavorn, K. (Primary Chief Investigator (PCI)), Grundy, J. (Chief Investigator (CI)), Abdelrazek, M. A. (Chief Investigator (CI)), Thongtanunam, P. (Chief Investigator (CI)), Aleti, A. (Chief Investigator (CI)), Nakisa, B. (Chief Investigator (CI)), Treude, C. (Associate Investigator (AI)), Zahedi, M. (Associate Investigator (AI)), Arora, C. (Associate Investigator (AI)), Hoda, R. (Associate Investigator (AI)), Chen, C. (Associate Investigator (AI)), Chen , J. (Associate Investigator (AI)), Cooray, M. (Associate Investigator (AI)), Bigdeli, A. (Associate Investigator (AI)), Uzunov, A. (Associate Investigator (AI)), Hurse, M. (Associate Investigator (AI)) & Saunders, S. (Associate Investigator (AI))Episoft Pty Ltd, Swordfish Computing Pty Ltd1/01/23 → 31/12/27Project: Research Quantum Information Technology: Quantum Information Technology: Industry Readiness & ApplicationsSteinfeld, R. (Primary Chief Investigator (PCI)), simmons, M. (Chief Investigator (CI)), Usman, M. (Chief Investigator (CI)), Phung, D. (Chief Investigator (CI)), Tack, G. (Chief Investigator (CI)), Pas, E. (Chief Investigator (CI)), Sakzad, A. (Associate Investigator (AI)), Cui, S. (Associate Investigator (AI)), Aleti, A. (Associate Investigator (AI)), Garcia De La Banda Garcia, M. (Associate Investigator (AI)), Nakashima, P. (Associate Investigator (AI)), Schmidt, D. (Associate Investigator (AI)), Esgin, M. (Associate Investigator (AI)) & Fay, J. (Associate Investigator (AI))1/01/23 → 31/12/27Project: Research Predicting Hospital Acquired Complications (HACs) using Electronic Medical Records (EMR)Wijerathna, L. (Primary Chief Investigator (PCI)), Bain, C. (Chief Investigator (CI)), Aleti, A. (Chief Investigator (CI)) & Franco, M. (Chief Investigator (CI))Amazon AWS AI9/09/22 → 9/09/28Project: Research View all 17 projects Research output Research output per year 2009 2013 2016 2017 2018 2020 2021 2022 2023 2024 2025 2025 55 Conference Paper 40 Article 3 Foreword / Postscript 2 Chapter (Book) 3 More 1 Abstract 1 Letter 1 Review Article Research output per year Research output per year A Bayesian Optimisation with segmentation approach to optimising liquid handling parametersYap, E., Huynh, V., Vong, C., Vogel, P., Louzado, V., Barnes, T., Say, B., Burke, M., Kulic, D. & Aleti, A., Dec 2025, In: Journal of Process Control. 156, 10 p., 103571.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile Artificial Intelligence for Software Engineering: The Journey So Far and the Road AheadAhmed, I., Aleti, A., Cai, H., Chatzigeorgiou, A., He, P., Hu, X., Pezzè, M., Poshyvanyk, D. & Xia, X., 28 May 2025, In: ACM Transactions on Software Engineering and Methodology. 34, 5, 27 p., 119.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) Enhancing large language models for text-to-testcase generationAlagarsamy, S., Tantithamthavorn, C., Takerngsaksiri, W., Arora, C. & Aleti, A., Dec 20",
  "content_length": 11607,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:31"
}