{
  "name": "Alejandro P. Buchmann",
  "homepage": "http://www.dvs.tu-darmstadt.de/staff/buchmann",
  "status": "success",
  "content": "DVS - Alejandro Buchmann Login TU | Informatik | DVS People Alumni Floor Plan Location Contact | Teaching Introduction to Computer Science II Introduction to Data and Knowledge Engineering Business Intelligence and Data Warehousing Database Systems II Event Processing Innovative Operating System Elements Middleware Performance and Scaling in E-Commerce Systems Persistent Storage Peer-to-Peer Middleware (Lab) Wireless Sensor Networks (Lab) Database Engine Development (Lab) Wireless Sensor Networks (Seminar) | Research Databases on Modern Hardware Event-Driven Computing Peer-to-Peer and Online Gaming Performance Engineering Pervasive Computing and Wireless Sensor Networks Industry Partners | Publications Completed Theses Posters | Jobs and Theses Jobs Open Theses DVS People DVS People Alumni Floor Plan Location Contact Alejandro Buchmann Alejandro Buchmann is Professor in the Department of Computer Science of Technische Universität Darmstadt since 1991 and is responsible for the area of Databases and Distributed Systems. Alejandro studied chemical engineering at the Universidad Nacional Autónoma de Mexico and received his PhD from the University of Texas, Austin, in 1980. He was an Assistant/Associate Professor from 1980 to 1986 at IIMAS/UNAM and held positions as a senior researcher at Computer Corporation of America, Cambridge Mass. (86-89) and GTE Laboratories, Waltham Mass. (89-91) before joining TU Darmstadt. He was responsible for the graduate research program in enabling technologies for e-commerce at TUD (1998-2007) and initiated a research program in Cooperative, Adaptive and Responsive Monitoring in Mixed Mode Environments (2006-). Alejandro's current research interests are in the areas of event-based and reactive systems, heterogeneous distributed systems, middleware, performance evaluation, peer-to-peer systems and new paradigms for data management and information processing in Cyberphysical systems. Alejandro was general chair of Ambient Intelligence 2007, the International Conference on Data Engineering 2008, and SPEC International Performance Evaluation Workshop 2008, as well as program cochair for some of the top conferences in the area, such as VLDB 96, SIGMOD 98 (industry track), ICDE 01 and DEBS 08. He is an associate editor of IEEE DS-Online, Electronic Commerce Research Journal and Distributed and Parallel Databases. Alejandro has held visiting positions at UT Austin, ICSI Berkeley, HP Labs Palo Alto, University of Virginia, Ecole Politechnique Federal de Lausanne (EPFL), IIT Bombay, and Caltech. Office Hours Monday 16:30-18:00 (please register in advance with Maria Tiedemann tiedem@dvs.tu-...) Databases and Distributed Systems Contact S2 02 | D106 +49 6151 16-25600 (Office) +49 6151 16-25601 +49 6151 16-25602 buchmann@dvs.tu-... Technische Universität Darmstadt Department of Computer Science Databases and Distributed Systems Hochschulstraße 10 64289 Darmstadt A A A | Print | Contact | Legal note | Search",
  "content_length": 2977,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:40"
}