{
  "name": "Alejandro Hevia",
  "homepage": "https://www.dcc.uchile.cl/~ahevia",
  "status": "success",
  "content": "Alejandro Hevia Alejandro Hevia I am associate professor at the Dept. of Computer Science at the Facultad de Ciencias Fisicas y Matematicas of the Universidad de Chile. I received my Ph.D. from the Dept. of Computer Science of the U. of California, San Diego (UCSD), my Engineering in Computer Science degree and a B.Sc. from the Dept. of Computer Science at the Universidad de Chile. My main interests are in the following areas: Applied cryptography: in particular, cryptographic protocols for distributed systems, such as evoting, anonymity systems, blockchain technologies, privacy-preserving protocols, and secure multiparty protocols in general. In general, I am interested in notions, tools, systems that preserve privacy in the digital world. Computer and Network Security (a.k.a. cybersecurity), vulnerability and threat detection via darknets and active network scanning, and malware analysis and prevention. Public policies on privacy and computer security. I currently serve as vice-director of the Department of Computer Science (DCC), Director of the Applied Cryptography and Cybersecurity Laboratory (CLCERT). I am also the head of the Random UChile and of the Participa UChile project. I also collaborate with NIC Chile Research Labs, and participate in the Instituto Chileno de Derecho y Tecnologías, as well as the Alianza Chilena en Ciberseguridad. Contact Information: Departamento de Ciencias de la Computación Fac. de Ciencias Físicas y Matemáticas Universidad de Chile Beauchef 851, Edificio Norte, Tercer Piso Santiago - Chile, 837-0459 Tel: (56) (2) 2978-4365. Fax: (56) (2) 2689-5531 bsky, mastodon. Research My publications. Grants: Part of my work is supported by two grants from NIST/ITL 2016-NIST-MSE-01 Measurement Science and Engineering (MSE) Research Grant Programs, NIST Information Technology Laboratory, Dept. of Commerce, USA, 2016-2018 and 2018-2020. The Random UChile project (formely known as CLCERT Random beacon) is possible because of that funding. Part of my work is supported by the project \"Enabling Resilient urban Transportation Systems in Smart Cites (RETRACT)\" headed by Sandra Céspedes and where Cesar Azurdia, Claudio Estévez (from DIE), and me will participate, via an ERANET-LAC grant (Nov. 2016). Previously, by a grant from Conicyt via REDES 140219, \"CEV: Challenges in Practical Electronic Voting\" (via INRIA Chile) 2015-2016. Previously, I was supported in part by Conicyt via Fondecyt No. 107033, and INRIA Chile. Steering Committees: Latincrypt: International Conference on Cryptology and Information Security in Latin America. Proyecto Amparo. Some conferences and events I am or have been involved with: Spring School on Networks (SSN 2016), ACM CCS 2016, 8.8 Computer Security Conference (2016), Asiacrypt 2016, PETS 2016.2, IFIP SEC 2016, Latincrypt 2015, ISPEC 2015, PKC 2014, CANS 2013, Latincrypt 2012 (co-chair with Gregory Neven), The Sao Paulo Advanced School of Cryptography (SP-ASCrypto) 2011 (Campinas, Brazil), JCC 2011, IFIP SEC 2011. Inscrypt 2010, Latincrypt 2010, Amparo Taller 2010 (Santiago, Chile), IDMAN 2010, FIRST TC 2009 (local organizer), Inscrypt 2009, LADC 2009, Secrypt 2009, CIBSI 2009, Secrypt 2008, LATIN 2008, ISC 2007, ACNS'07, LATIN 2006 (co-chair with Marcos Kiwi and José Correa). Public Policy, Privacy and Computer Security \"El Camino a la Votación Electrónica Segura en Chile\", en Conversatorio \"Ciberseguridad, Estamos Preparados?\" (video [0:24min], PDF), Senado de Chile, 6 de Julio 2018. Criptomonedas y Tecnología, Jornada Temática \"Criptomonedas: Oportunidades y Desafíos desde tres perspectivas\", at the Comisión de Hacienda, Cámara de Diputados. May 15, 2018. La Ingeniería Inversa y su Rol en la Seguridad Informática (in Spanish), March 2008. Why reverse engineering is good for security. On the News \"Gran promo: Todas tus compras gratis (las endosas a otro cliente con sólo usar su RUT)\", OWASP LATAM Tour 2018, (Vulnerability in mobile payment system of chilean bank) Joint work with Eduardo Riveros. Apr 25, 2018. Appeared in El Dinamo, Cooperativa, CNN Chile (at 1:50). Students Current Students: M.Sc. students: Bryan Ortiz (2022-, accountable intersection management) Undergraduate students: Natalia Quinteros (2024, iot detection) Former Students: Ph.D.: Alonso Gonzalez (2017, Succint NIZK). Now at Crypto Group within the AriC team, LIP laboratory, at ENS de Lyon. Philippe Camacho (2013, accumulators and secure distributed data structures) Now at Dreamlabs Chile. M.Sc, Ilana Mergudich (2021, secure reporting of sexual assault) Eduardo Riveros (2020, active network scanning) Juan Rojas (2017-, votación electrónica) Constanza Csori (2016-, public verifiable randomness applications) Camilo Gómez (2018, anonymous channels) Francisco Montoto (2018, oracles in bitcoin) Eduardo Acha (2017, active remote detection of vulnerabilities) Cristian Rojas (2017, banking apps security) Francisco Cifuentes (2016, Threshold Cryptography HSM) Boris Romero (2016, transportation system security) Mario Cornejo (2015, evoting), Now ph.d. student at ENS. Giselle Font (2014, location privacy) Now Site Reliability Engineer at Google. Renata Faccilongo (2012, darknet visualization) Adolfo Barra (2012, PKI) M.T.I. students: Jasmin Zurita (2018, security credential management) CS Undergrad, Valentina Ramos, Fernanda Macías Jorge Pinto, Clemente Paredes Alonso Reyes (2022) Franco Pino (2020, votación electrónica) Sergio Leiva (2020, honeynet framework) Felipe Troncoso (2015, malware analysis) Camilo Gomez (2015, evoting) Eduardo Frias (2013, cryptanalysis) Jorge Bahamondes (2013, mixnets) Mario Jara (2013, cryptographic obfuscation) Nicolás Malbran (2012, mobile malware) Rodrigo Porras (2011, practical evoting) Alonso Gonzalez (2011, multiparty computation) Francisca Moreno (2010, secure mobile p2p devices) Patricio Seguel, (2010, librería de canales anónimos) Fernando Krell (2009, distributed backup) Now at Dreamlabs Chile. Sergio Miranda, (2008,evoting) Pamela Cordero, (2008,evoting) Francisco Echeverría (2008, flow-based distributed monitor). Projects: Software Projects (Fondecyt 1070332): Verifiable Prescint-based Electronic Voting (in Spanish) Robust and Verifiable Mix-nets (in Spanish) Distributed Backup System (in Spanish) Teaching CC5301: Introducción a la Criptografía Moderna (upper-level undergraduate, in Spanish). 2019, 2016, 2014, 2012, 2010, 2009, 2007. CC5324: Bitcoin y Criptomonedas (undergraduate, in Spanish). 2018. CC5312: Seguridad Computacional (undergraduate, in Spanish) 2016, 2011, 2010, 2009, 2007, 2006. CC3101: Matemáticas Discretas para la Computación (undergraduate, in Spanish) 2018, CC3102: Teoría de la Computación (undergraduate, in Spanish) 2017, 2015, 2013, 2012, 2011, 2010, 2009, 2008, 2007. CC1002: Introducción a la Programación (undergraduate, in Spanish) 2018, 2017, 2016, 2015, 2014. CC5315: Seguridad de Software (undergraduate, in Spanish, jointly with Cristián Rojas). 2015, 2014 2012 CC5310: Fundamentos de la Criptografía (graduate and upper-level undergraduate, in Spanish) 2011, 2008. CC6301: Tópicos de la Criptografía Moderna (graduate and upper-level undergraduate, in Spanish) 2012 (Anonimato y Votación Electrónica), 2011 (Encriptación Funcional), 2008 (Computación Multipartita Segura y Aplicaciones). CC5317: Seminario de Votación Electrónica (undergraduate, in Spanish) 2013, 2017. CC5319: Informática Forense y Respuesta a Incidentes, (undergraduate, in English), local host, taught by Greg Gogolin (Ferris State U.) 2013. Current Assignments Director of the Chilean Computer Emergency Response Team (CLCERT), and founding member of the Applied Cryptography and Security Laboratory (CASLAB) of the University of Chile. Some Past Assignments Administration: Member of the CS Dept.'s advisory board. Administration: Outreach/Communications coordinator for the CS Dept. (2007-2009). Served as Chilean representative for the IFIP TC11 Group (2007-2009). CLEI representative to the IFIP TC11 Group. Personal Tips for traveling around Chile: A short document grew out of questions from friends visiting Chile and around. PGP/GnuPG key | CLCERT PGP/GnuPG key | Short Bio (EN, ES)| Another picture",
  "content_length": 8177,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:40"
}