{
  "name": "Alejandro Paz-Lopez",
  "homepage": "https://pdi.udc.es/en/File/Pdi/QP8LF",
  "status": "success",
  "content": "Alejandro Paz López File. Department Computer Science and Information Technologies Knowledgment area Computational Science and Artificial Intelligence Research Research group Grupo Integrado de Ingeniería Research lines Robótica Educativa, Robótica Cognitiva, Computación Ubicua Teaching merits evaluation 1 five years period(s) Research merits evaluation 1 six years period(s) Contacto UDC directory Orcid id0000-0003-4952-7308 ResearcherIDR-5471-2018 Scopus24473195100 I am a Part-time Professor at the University of A Coruña, Spain. I received the M.S. degree in Computer Engineering from the University of A Coruña in 2002, and a PhD in Computer Science from the University of A Coruña in 2015. I am a member of the CITIC (Centre for Information and Communications Technology Research), www.citic-research.org﻿﻿. My main research activities are focused to ubiquitous computing and cognitive robotics. Since 2019 I am the software development team leader at MINT company, which commercializes the Robobo educational robot (theroboboproject.com﻿﻿﻿﻿). Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Artificial Vision: Advanced Master's Degree in Industrial Computing and Robotics Optional 0 4.5 Final Year Dissertation Automation and Industrial Electronics Engineering Compulsory 0 0.5 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 2 Machine Vision for Industrial Applications Master in Industrial Engineering Master in Industrial Engineering Optional 0 8 Master Thesis Master's Degree in Industrial Computing and Robotics Compulsory 0 4 Master's Dissertation Master in Industrial Engineering Compulsory 0 15 Programming II Degree in Artificial Intelligence Core 0 20 Robotics Degree in Computer Engineering Optional 0 28 Software Design Degree in Computer Engineering Compulsory 0 103 Subject and involved studies Type Distance hours Total hours Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 10 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 2.5 Machine Vision for Industrial Applications Master in Industrial Engineering Master in Industrial Engineering Optional 0 2 Master's Dissertation Master's Degree in Industrial Computing and Robotics Compulsory 0 4 Programming II Degree in Artificial Intelligence Core 0 0 Robotics Degree in Computer Engineering Optional 0 28 Smart Industry. IIoT Degree in Industrial Technology Engineering Optional 0 10.5 Software Design Degree in Computer Engineering Compulsory 0 103 Subject and involved studies Type Distance hours Total hours Final Year Dissertation Degree in Industrial Technology Engineering Compulsory 0 8.5 Machine Vision for Industrial Applications Master in Industrial Engineering Master in Industrial Engineering Optional 0 2 Machine Vision I Master's Degree in Industrial Computing and Robotics Optional 0 2 Machine Vision II Master's Degree in Industrial Computing and Robotics Optional 0 2 Programming II Degree in Artificial Intelligence Core 0 10.5 Robotics Degree in Computer Engineering Optional 0 28 Smart Industry. IIoT Degree in Industrial Technology Engineering Optional 0 6 Software Design Degree in Computer Engineering Compulsory 0 103 Work Placement Degree in Data Science and Engineering Compulsory 0 3 Subject and involved studies Type Distance hours Total hours Final Year Dissertation Degree in Industrial Technology Engineering Compulsory 0 8 Final Year Dissertation Automation and Industrial Electronics Engineering Compulsory 0 4 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 4 Machine Vision for Industrial Applications Master in Industrial Engineering Master in Industrial Engineering Optional 0 7 Machine Vision I Master's Degree in Industrial Computing and Robotics Optional 0 9 Machine Vision II Master's Degree in Industrial Computing and Robotics Optional 0 7 Master's Dissertation Master in Industrial Engineering Compulsory 0 5 Programming II Degree in Artificial Intelligence Core 0 20 Robotics Degree in Computer Engineering Optional 0 28 Smart Industry. IIoT Degree in Industrial Technology Engineering Optional 0 6 Software Design Degree in Computer Engineering Compulsory 0 108 Subject and involved studies Type Distance hours Total hours Final Year Dissertation Degree in Industrial Technology Engineering Compulsory 0 4 Machine Vision for Industrial Applications Master in Industrial Engineering Master in Industrial Engineering Optional 0 5 Machine Vision I Master's Degree in Industrial Computing and Robotics Optional 0 4 Machine Vision II Master's Degree in Industrial Computing and Robotics Optional 0 4 Programming II Degree in Computer Engineering Core 0 95 Robotics Degree in Computer Engineering Optional 0 28 Smart Industry. IIoT Degree in Industrial Technology Engineering Optional 0 5 Subject and involved studies Type Distance hours Total hours Computting Degree in Industrial Technology Engineering Degree in Mechanical Engineering Core 0 60 Machine Vision for Industrial Applications Master in Industrial Engineering Optional 0 10 Machine Vision I Master's Degree in Industrial Computing and Robotics Optional 0 7 Machine Vision II Master's Degree in Industrial Computing and Robotics Optional 0 7 Programming II Degree in Computer Engineering Core 0 69 Robotics Degree in Computer Engineering Optional 0 28 Smart Industry. IIoT Degree in Industrial Technology Engineering Optional 0 10 Tutoring 2025/2026 Defined tutoring by teacher for 2025/2026 academic course. Faculty of Computer Science Quarter Day Site 1st quarter Monday 09:30 a 12:00 Despacho 3.06 Área Científica / Teams 1st quarter Wednesday 12:30 a 14:00 Despacho 3.06 Área Científica / Teams 2nd quarter Thursday 13:00 a 14:00 Despacho 3.06 Área Científica / Teams 2nd quarter Friday 13:00 a 14:30 Despacho 3.06 Área Científica / Teams 2nd quarter Friday 09:00 a 10:30 Despacho 3.06 Área Científica / Teams 2nd chance Thursday 13:00 a 14:00 Despacho 3.06 Área Científica / Teams 2nd chance Friday 09:00 a 10:30 Despacho 3.06 Área Científica / Teams 2nd chance Friday 13:00 a 14:30 Despacho 3.06 Área Científica / Teams Ferrol Engineering Polytechnic University College Quarter Day Site 2nd quarter Thursday 13:00 a 14:00 Laboratorio GII / Teams 2nd quarter Friday 09:00 a 10:30 Online (Microsoft Teams) 2nd quarter Friday 13:00 a 14:30 Online (Microsoft Teams) 2nd chance Thursday 13:00 a 14:00 Laboratorio GII / Teams 2nd chance Friday 09:00 a 10:30 Online (Microsoft Teams) 2nd chance Friday 13:00 a 14:30 Online (Microsoft Teams) EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2023/2024 2022/2023 2021/2022 2020/2021 2016/2017 Control of a robotic arm using ROS and a voice assistant Development of a software prototype to assist in the creation of object detection solutions based on computer vision Development of an experimental application in ROS for a collaborative task involving robotic arms and mobile robots Development of real and simulated sensorization modules for the robotics platform Robobo IoT soil monitoring system using a low power and wide area network Design and implementation of a reporting system for the Ontimize framework Development of computer vision modules in Python for object detection in an autonomous driving testing environment Experimental evaluation of a mobile robot's simulation model to improve the behavior's fidelity between the simulated and the real model Experimental intrusion detection based on IIoT technologies Laser and image distance measurement system Wireless underwater communication system based on LiFi Development of modules for educational robotics in AppInventor Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Patents, records and utility models Papers in research journals Book chapters Conference papers 2022 2021 2015 2013 2012 ... 2008 2007 2006 Funding entity Ministerio de Ciencia e Innovación Main researches Jose Antonio Becerra Permuy (IP1) / Richard Duro Fernández (IP2) Type Proyecto Programas Nacionales Dates From 01/09/2022 to 31/08/2025 Funding entity Ministerio de Ciencia e Innovación Main researches Francisco Javier Bellas Bouza (IP1) / Óscar Fontenla Romero (IP2) Type Proyecto Programas Nacionales Dates From 01/12/2022 to 30/11/2024 Funding entity European Commission Main researches Richard J. Duro Fdez. Type Proyecto UE Dates From 01/10/2022 to 30/09/2026 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Richard Duro Fernández Type Proyecto Programas Autonomicos Dates From 01/01/2021 to 20/11/2024 Funding entity Xunta de Galicia Main researches Alejandro Paz López, Richard J. Duro Fernández Type Proyecto Programas Autonomicos Dates From 11/01/2021 to 30/11/2021 Funding entity Union Europea Main researches Richard José Duro Fernández Type Proyecto UE Dates From 01/01/2015 to 31/12/2018 Funding entity Ministerio de Economía y Competitividad (MINECO) Main researches Richard Duro Type Proyecto Programas Nacionales Dates From 30/12/2013 to 31/12/2015 Funding entity Xunta de Galicia Main researches Richard J. Duro Fernández Type Proyecto Programas Autonomicos Dates From 01/01/2013 to 31/12/2016 Funding entity Ministerio de Economía y Competitividad Main researches Richard José Duro Fernández Type Proyecto Programas Nacionales Dates From 01/01/2012 to 31/12/2014 Funding entity DISEÑO NAVAL E INDUSTRIAL, S. L. Main researches Fernando López Peña Type Contrato Dates From 22/10/2008 to 21/10/2011 Funding entity Xunta de Galicia Main researches Richard J. Duro Fernández Type Proyecto Programas Autonomicos Dates From 31/08/2007 to 31/08/2009 Funding entity Xunta de Galicia",
  "content_length": 14905,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:41"
}