{
  "name": "Aleksy Schubert",
  "homepage": "http://www.mimuw.edu.pl/~alx",
  "status": "success",
  "content": "Aleksy Schubert Aleksy Schubert How to submit classes proposals (in Polish)? Here is the Polish version of the page (mostly obsolete) I'm a (university) professor in the Institute of Informatics at the Faculty of Mathematics, Informatics and Mechanics of the Warsaw University. Journals I am on the editorial board of Mathematical Structures in Computer Science. Please submit! Events Local seminar LSFA'2021 (PC member) RDP'2015 (organising chair) MKM'2015 (PC member) FOPARA'2015 (PC member) Vienna Summer of Logic (RTA-TLCA workshop chair, RTA-TLCA PC member) TYPES'2014 (presentation committee program member) TYPES'2013 (post-proceedings co-editor) DICE'2013 (PC member) RTA'2011 (PC member) FoVeOOS'2011 (PC member) FoVeOOS'2010 (PC member) Research interests My research interests include: program specification and verification, foundations and software engineering for object-oriented languages, security, theorem proving, lambda calculus and type systems. Research projects I am involved in the following research projects: NCN grant \"Automatisation of constructive logic\" MOBIUS - Mobility, Ubiquity and Security, EU funded Integrated Project TYPES - Types for Proofs and Programs, EU funded Coordination Action GAMES - EU funded Research Training Network Reasoning about programs with the help of tools based on the type theory - the grant funded by the Polish Ministry of Science and Informatisation Tools I took part in development of the following tools and formalisations: CoJaq: a formalisation of Java Virtual Machine HAHA: Hoare-logic Teaching Assistant Umbra byte code and BML editor JML2BML compiler Intuition - intuitionistic first-order prover and typechecker Production My research papers Translations into Polish (in Polish) Teaching Deciding logical properties of statements and its complexity Contact information phone +48 (0)22 - 55 44 570 fax +48 (0)22 - 55 44 400 e-mail alx@mimuw.NO_SPAMedu.NO_SPAMpl address Room 5750 Faculty of Mathematics, Informatics and Mechanics Warsaw University ul. Banacha 2 02-097 Warsaw Poland My scientific genealogy My family My public PGP key",
  "content_length": 2104,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:43"
}