{
  "name": "Aleksandar Nikolov",
  "homepage": "http://www.cs.toronto.edu/~anikolov",
  "status": "success",
  "content": "Aleksandar Nikolov Main Research Courses Aleksandar Nikolov Associate Professor, Department of Computer Science, University of Toronto Canada Research Chair in Algorithms and Private Data Analysis About me I am broadly interested in theoretical computer science, and algorithm design, and I am a member of the Theory Group. I am also an affiliate at the Vector Institute, and a faculty fellow at the Schwartz Reisman Institute. My current research interests are in the connections between high dimensional geometry and computer science. In my work, I have applied geometric tools to the theory of private data analysis (differential privacy), discrepancy theory, and experimental design. I have also worked on computational questions in high dimensions, such as nearest neighbour search, and various geometric optimization problems. I also think about approximation algorithms, and sublinear and parallel algorithms for analyzing massive data. For more information, look in Research. If any of the above sounds intriguing, and you are a talented and motivated student interested in the theory of computing and the design of algorithms, I encourage you to apply to the University of Toronto. Before coming to Toronto, between October 2014 and July 2015, I was a postdoc researcher in the Theory Group at Microsoft Research in Redmond. Before that, I completed my PhD in Rutgers University's Computer Science department, where I was advised by Muthu. During 2012-2014 I was supported by a Simons Graduate Fellowship. On the more personal side: I was born in Varna, Bulgaria, right on the Black Sea coast. On my mother's side I come from a family of Banat Bulgarians. I first moved to North America to study in St. Peter's College (now University): a small Jesuit college in Jersey City. If you want to be especially friendly, and follow Slavic people's proud tradition of having arbitrary nicknames, you can call me Sasho. Supervision I have supervised the following students: Sky Li, MSc (current, co-supervised with Azadeh Farzan) Haohua Tang, PhD (current) Lily Li, PhD Alexander Edmonds, PhD (co-supervised with Toni Pitassi) Sepehr Abbasi Zadeh, MSc Assimakis Kattis, MSc I also regularly supervise research projects and independent studies for University of Toronto undergraduate students. Teaching In the Winter 2025 term I am teaching the graduate course CSC2420 Algorithm Design, Analysis and Theory. In Fall 2015 I tought a course on discrepancy theory and applications to computer science. You can find the lecture notes here. A more recent but abbreviated set of lecture notes is here. For more information on courses I have taught, see Courses. Contact information Office: Sandford Fleming 3316 Email: anikolov@cs.toronto.edu Curriculum Vitae",
  "content_length": 2753,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:40"
}