{
  "name": "Aleks Kissinger",
  "homepage": "https://www.cs.ox.ac.uk/people/aleks.kissinger",
  "status": "success",
  "content": "Aleks Kissinger | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyAleks KissingerAleks Kissinger Professor Aleks Kissinger Professor of Computer Science (Quantum Computing)E: aleks.kissinger@cs.ox.ac.ukThemes:QuantumCompleted Projects:more…Biography I am a Professor of Quantum Computing and joint head of the Quantum Group in Oxford's Department of Computer Science. My research focuses on quantum software, namely quantum compilation, fault-tolerant quantum computing, and classical simulation and verification of quantum computations. Much of my work draws on diagrammatic and graph-theoretic approaches to reasoning about quantum systems. I am the co-author of two textbooks: Picturing Quantum Processes, a.k.a. \"The Dodo Book\", which teaches quantum theory from first principles using string diagrams; and Picturing Quantum Software, a freely-available book that introduces the basics of quantum compiling and fault-tolerant quantum computing using the ZX calculus. Theses I maintain a list of theses by members of the Quantum Group, including my former students. Theses by Quantum Group members Papers and Talks Selected publications can be found at the bottom of this page. Click here to see all of my papers ...including preprints. I have also put slides/videos for some of my talks online here. Courses This coming spring I'm teaching a course based on Picturing Quantum Processes and the sequel Picturing Quantum Software. Course materials aren't online yet, but you can see last year's materials here: Quantum processes and computation - Autumn 2024 Teachers: If you'd like to teach a similar course, run a reading group, or incorporate some of the materials into your own courses, get in touch! Research & Updates Fault-tolerance by construction is a new paradigm for designing fault-tolerant quantum computations using the ZX calculus. By restricting just to rules that preserve the behaviour under noise, we can transform idealised \"specification\" circuits into provably fault-tolerant implementations. It was also featured in an article in the Quantum Zeitgeist! They made me Full Professor! It's out! Picturing Quantum Software is a brand new book covering state of the art methods in quantum compiling, circuit optimisation, classical simulation, and fault-tolerant quantum computing using the language of the ZX-calculus. Get the preprint for free: here! Picturing Quantum Software: An Introduction to the ZX-calculus and Quantum Compilation. Aleks Kissinger and John van de Wetering Cambridge University Press has graciously allowed us to release the preprint free of charge under their Green Open Access policy. Before we send it off to the publisher, we would love to hear what you think. If you find bugs, omissions, inaccuracies, etc. please let us know and/or post an Issue on GitHub. Chyp is an interactive theorem prover for string diagrams. You type terms and it draws pictures. It handles all the category theory bureaucracy automatically, thanks to the magic of hypergraph rewriting (CHYP = Cospans of HYPergraphs). Check it out on GitHub. Like other, more traditional ITPs, it supports definitions, lemmas, modules, \"holes\", and some basic tactics....and is super addictive. The theory behind it comes from our \"String Diagram Rewrite Theory\" series, especially SDRT2. We held Quantum Physics and Logic (QPL) 2022 in Oxford, jointly hosted by the University of Oxford and Quantinuum. If you missed it, fear not! All the videos of talks are available for free right here: QPL 2022 Talks on YouTube We're doing strong classical simulation of some pretty chunky quantum circuits (e.g. 50 qubits and 1400 T gates in < 5mins) using two kinds of magic: magic state decomposition and ZX-calculus magic. :) Simulating quantum circuits with ZX-calculus reduced stabiliser decompositions Read a book, read a book... Picturing Quantum Processes: A First Course in Quantum Theory and Diagrammatic Reasoning. Bob Coecke and Aleks Kissinger, Cambridge University Press PQP, or \"The Dodo Book\", teaches quantum theory from the ground up, taking diagrams as the most fundamental tool. It recently got mentioned in Computer Weekly and Forbes, which is pretty awesome. It turns out to be a really useful way to think about quantum natural language processing, which is what lots of the folks at Quantinuum are doing these days. QuiZX is a new, super quick library for ZX-calculus rewriting. It is written in Rust, a systems programming language designed for writing fast, reliable software. Of course, that doesn't automatically mean its fast, but some experiments are looking pretty good! Here we build a diagram with 100,000 spiders and fuse them: PyZX: Building a Z-spider chain of size: 100000 Done in 219.52ms Fusing all spiders Done in 98.55s QuiZX: Building Z-spider chain of size: 100000... Done in 12.99ms Fusing all spiders... Done in 17.47ms ...that's about 5000X faster. :) My student John van de Wetering got himself a PhD! Check out his thesis, which is actually two theses in one: Quantum Theory from Principles, Quantum Software from Diagrams Abstract. This thesis consists of two parts. The first part is about how quantum theory can be recovered from first principles, while the second part is about the application of diagrammatic reasoning, specifically the ZX-calculus, to practical problems in quantum computing. The main results of the first part include a reconstruction of quantum theory from principles related to properties of sequential measurement and a reconstruction based on properties of pure maps and the mathematics of effectus theory. It also includes a detailed study of JBW-algebras, a type of infinite-dimensional Jordan algebra motivated by von Neumann algebras. In the second part we find a new model for measurement-based quantum computing, study how measurement patterns in the one-way model can be simplified and find a new algorithm for extracting a unitary circuit from such patterns. We use these results to develop a circuit optimisation strategy that leads to a new normal form for Clifford circuits and reductions in the T-count of Clifford+T circuits. Congratulations Dr van de Wetering! Coen Borghans wrote a masters thesis giving efficient 2-way translations between stabilizer ZX-diagrams and stabilizer subgroups. Here it is: ZX-Calculus and Quantum Stabilizer Theory PyZX, our library for manipulating quantum circuits with the ZX-calculus, is now installable via pip. As a consequence, it is now easy to \"run\" ZX-diagrams on a real quantum computer using the IBM Quantum Experience. Check it out: Also, here are some download stats for PyZX. Join the party! --> I'm now on Twitter, but not much of a Tweeter (yet). Follow me if you like: @AleksKissinger Louis Lemonnier completed a summer project with me last year, connecting the powerful path-sum technique for circuit verification to the ZH-calculus. Louis showed that the HH rule from path-sum is equivalent to a new rule called the Fourier hyperpivot, which has the twin benefits of being very useful for circuit simplification and sounding like a move from DragonBallZ. UPDATE: There's now a paper about hyper-pivoting. Check out the preprint: Hypergraph simplification: Linking the path-sum approach to the ZH-calculus. Louis Lemonnier, John van de Wetering, and AK. (Louis' original report is still available here.) My student Sander Uijlen has passed his Phd defense! You can read his thesis here: Categorical approaches to computations in contextuality and causality ...or check out related journal papers on contextuality and causality. PyZX is an open-source Python library for compilation, optimisation, and simulation of quantum circuits using the ZX calculus. To get some idea of what it's about, check out this Youtube video: PyZX is... Read a book! Picturing Quantum Processes: A First Course in Quantum Theory and Diagrammatic Reasoning. Bob Coecke and Aleks Kissinger, Cambridge University Press ...which teaches quantum theory from the ground up, taking diagrams as the most fundamental tool. Order now from CUP, Amazon, or many other purveyors of fine printed goods. It has been the basis of a masters-level Quantum Computing course running in Oxford for about 5 years and another course running in Nijmegen in 2018 and 2019. If you are interested in running a similar course, get in touch with me. To get some flavour of the book, you can check out Categorical Quantum Mechanics, part 1 and part 2, which give approximately the first 8 chapters in a somewhat condensed package. I moved to Oxford! I'm happy to (re-)join the Quantum Group in Oxford's Department of Computer Science in 2019. TikZiT 2 is now available for Windows, Linux, and macOS. TikZiT is a super simple GUI editor for graphs and string diagrams. Its native file format is a subset of PGF/TikZ, which means TikZiT files can be included directly in papers typeset using LaTeX. Our causality paper is the topic of a recent blog post on the n-category cafe. It also formed the basis of one of the four research threads at the 2018 Adjoint School of Applied Category Theory in Leiden. I wrote an ERCIM news article about some of the exciting new developments in graphical calculus for quantum computation, notably the new completeness results for Clifford+T and universal quantum computation. I co-organised a workshop with Pawel Sobocinski on string diagrams called STRING on Sept 8-9, satellite to FSCD in Oxford. We organised the 14th International Conference in Quantum Physics and Logic (QPL) at Radboud in 2017, co-located with a satellite workshop on quantum structures run by IQSA. With 109 registered attendees, 5 invited talks, 4 tutorials, and a total of 67 contributed talks across QPL and IQSA, it was a huge success! I was a keynote speaker at IQSA 2016, July 10-16 in Leicester, UK. I gave a tutorial on process theories and graphical languages at QPL 2016, June 6-10 in Glasgow, UK. My student Davi",
  "content_length": 12024,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:39"
}