{
  "name": "Aleksandar Kuzmanovic",
  "homepage": "https://networks.cs.northwestern.edu/website/index-b.html",
  "status": "success",
  "content": "Aleksandar Kuzmanovic Northwestern Networks Group About Selected Publications Selected Talks Press Professional Activities Industrial Impact Teaching Curriculum Vitae Contact About Aleksandar Kuzmanovic is a Professor in the Department of Computer Science at Northwestern University, where he leads the Northwestern Networks Group. His research interests are in the area of computer networking with emphasis on design, measurements, analysis, denial-of-service resiliency, content distribution, and prototype implementation of protocols and algorithms for the Internet. ➥Expand Selected Publications Monetizing Spare Bandwidth: the Case of Distributed VPNs Y. Xiao, M. Varvello, and A. Kuzmanovic In ACM SIGMETRICS '22, Mumbai, India 2022. De-Kodi: Understanding the Kodi Ecosystem M. Warrior, Y. Xiao, M. Varvello, and A. Kuzmanovic In the Web Conference (WWW '20), Taipei, Taiwan, April 2020. Mining the Web with Webcoin U. Klarman, M. Flores, and A. Kuzmanovic In ACM CoNEXT '18, Heraklion/Crete, Greece, December 2018. Drongo: Speeding Up CDNs with Subnet Assimilation from the Client M. Warrior, U. Klarman, M. Flores, and A. Kuzmanovic In ACM CoNEXT '17, Seoul, South Korea, December 2017. Wi-FM: Resolving Neighborhood Wireless Network Affairs by Listening to Music M. Flores, U. Klarman, and A. Kuzmanovic In IEEE ICNP '15, San Francisco, California, November 2015. How to Improve Your Search Engine Ranking: Myths and Reality A.-J. Su, Y. C. Hu, A. Kuzmanovic, and C.-K. Koh In ACM Transactions on the Web, March 2014. Mosaic: Quantifying Privacy Leakage in Mobile Networks N. Xia, H. Song, Y. Liao, M. Iliofotou, A. Nucci, Z. Zhang, and A. Kuzmanovic In Proceedings of ACM SIGCOMM 2013, Hong Kong, China, August 2013. Towards Street-Level Client-Independent IP Geolocation Y. Wang, D. Burgener, M. Flores, A. Kuzmanovic, and C. Huang In Proceedings of USENIX NSDI 2011, Boston, MA, March 2011. ➥Expand A full list of publications is here. Selected Talks Usenix NSDI Northwestern Seminar ➥Expand Press BBC News RCR Wireless News ➥Expand Professional Activities Chair Posters Chair ACM Sigcomm 2018 PC Chair PAM 2014 PC Chair, Web-based Systems and Applications ICDCS 2013 Posters co-chair ICNP 2012 Workshop chair CoNEXT 2010 Local arrangements co-chair IMC 2009 Steering Committee Member Measurement Lab Passive and Active Measurement Conference Editorial Board Member IEEE/ACM Transactions on Networking ➥Expand Industrial Impact Wi-FM (ICNP '15): The Wi-FM system is currently licenced for experimental evaluation. GeoEcho (WI '14, best paper award): The GeoEcho system has been deployed by Narus Inc. (now Symantec). MOSAIC (Sigcomm '13): The Mosaic system has been deployed by Narus Inc. (now Symantec). Street-Level IP Geolocation (NSDI '11): This work led to Nanjee, Inc., co-founded in 2011 by (then PhD student) Yong Wang and prof. Aleksandar Kuzmanovic. ➥Expand Teaching EECS 110: Introduction to Computer Programming EECS 397/497: IoT Networks Seminar CV CV Link Contact Office: 3519 Seeley Mudd Phone: (847) 467-5519 (no voicemail messages, please) Fax: (847) 491-4455 Mailing Address: Computer Science & Engineering 2233 Tech Drive Seeley Mudd -- 3rd floor Evanston, IL 60208 Email: akuzma @ northwestern . edu Top",
  "content_length": 3236,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:40"
}