{
  "name": "Aleksandar D. Rakic",
  "homepage": "http://researchers.uq.edu.au/researcher/473",
  "status": "success",
  "content": "Professor Aleksandar Rakic | UQ Experts Skip to menu Skip to content Skip to footer Professor Aleksandar Rakic Email: adee@eait.uq.edu.au Phone: +61 7 336 53569 Positions Professor and Associate Dean (External Engagement) Faculty of Engineering, Architecture and Information Technology Professor School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Overview Background Aleksandar D. Rakić leads the Photonics and Microwave Engineering group at The University of Queensland focusing on the development of technologies for sensing and imaging across the electromagnetic spectrum including microwave, terahertz wave and optical systems. Professor Rakić’s research focuses on the principles of laser feedback interferometry with semiconductor lasers, and on the application of these principles to imaging and sensing. Rakić group pioneered the development of several world’s first laser-feedback interferometric sensors including systems based on monolithic Vertical-Cavity Surface-Emitting Laser arrays (VCSELs), blue-green lasers, terahertz quantum cascade lasers and mid-infrared interband cascade lasers. His current focus is on the development of sensing and imaging systems exploiting the THz spectrum for applications from security and defence to in vivo biomedical imaging. His other principal contributions relate to the design and characterization of surface-emitting optoelectronic devices (VCSELs and light emitting diodes) and modelling of optical materials. Read more Read less Availability Professor Aleksandar Rakic is: Available for supervision Fields of research Biomedical engineering Engineering Nanophotonics Qualifications Bachelor (Honours) of Engineering, University of Belgrade Masters (Coursework) of Engineering, University of Belgrade Doctor of Philosophy, The University of Queensland Research interests Development of laser technologies for early detection of skin cancers Two in three Australians will be diagnosed with skin cancer by the time they are 70. Despite advances in treatment regimes, the most significant predictor of survivability remains early detection. My group works on developing a disruptive technology based on the terahertz quantum cascade lasers (QCLs) for the next generation of terahertz imaging systems suitable for early skin cancer detection. Read more Read less Interaction of light and tissue: Integrated electromagnetic models for laser systems and skin My group is developing physical and numerical models (phantoms) of human skin, and integrating them with models of laser based optical systems for accurate description of system performance including physical phenomena of light-tissue interactions. Concurrent modeling of laser systems and skin provides unprecedented insight into the performance of terahertz and infrared biomedical imaging systems. Read more Read less Works Search Professor Aleksandar Rakic’s works on UQ eSpace All (306) Journal Article (148) Other Outputs (7) Edited Outputs (1) Conference Publication (148) Book Chapter (2) 2025 Journal Article Wood/PHAs biocomposites with mechanical properties comparable to conventional plastics: model-based prediction and experimental validation Mathel, Vincent, Aziz, Shazed, Guo, Xiao, Bertling, Karl, Rakić, Aleksandar D., Heitzmann, Michael T. and Vandi, Luigi-Jules (2025). Wood/PHAs biocomposites with mechanical properties comparable to conventional plastics: model-based prediction and experimental validation. Composites Part A: Applied Science and Manufacturing, 194 108916, 108916. doi: 10.1016/j.compositesa.2025.108916 Wood/PHAs biocomposites with mechanical properties comparable to conventional plastics: model-based prediction and experimental validation 2025 Journal Article 2025 Photonics for Agrifood roadmap: towards a sustainable and healthier planet Smeesters, Lien, Venturini, Francesca, Paulus, Stefan, Mahlein, Anne-Katrin, Perpetuini, David, Cardone, Daniela, Merla, Arcangelo, Gac, Benjamin, Perrin, Stephane, Trégoat, Denis, Poffo, Luiz, Fournier, Antoine, Bonifazi, Giuseppe, Serranti, Silvia, Liao, Wenzhi, Osseiran, Noureddin, Vanwolleghem, Mathias, Peretti, Romain, Bandyopadhyay, Aparajita, Bertling, Karl, Parameswaran, Krishnan, Rakić, Aleksandar D., Sengupta, Amartya, Svanberg, Sune, Kujawinska, Małgorzata, Cozzolino, Daniel, Perez-Marin, Dolores, Entrenas de León, José A., Torres Rodríguez, Irina ... Mignani, Anna Grazia (2025). 2025 Photonics for Agrifood roadmap: towards a sustainable and healthier planet. Journal of Physics: Photonics, 7 (3) 032501, 032501-3. doi: 10.1088/2515-7647/adbea9 2025 Photonics for Agrifood roadmap: towards a sustainable and healthier planet 2025 Journal Article Subwavelength 3D terahertz imaging with a single-pixel laser transceiver Silva, Jorge, Plöschner, Martin, Bertling, Karl, Ghantala, Mukund, Gillespie, Tim, Torniainen, Jari, Herbert, Jeremy, Lim, Yah Leng, Taimre, Thomas, Qi, Xiaoqiong, Donose, Bogdan C., Zhou, Tao, Lui, Hoi-Shun, Indjin, Dragan, Han, Yingjun, Li, Lianhe, Valavanis, Alexander, Linfield, Edmund H., Davies, A. Giles, Dean, Paul and Rakić, Aleksandar D. (2025). Subwavelength 3D terahertz imaging with a single-pixel laser transceiver. Optics Express, 33 (10), 21938-21950. doi: 10.1364/oe.561713 Subwavelength 3D terahertz imaging with a single-pixel laser transceiver 2025 Journal Article Shaping terahertz harmonic frequency combs with frequency-dependent external reflectors Silvestri, Carlo, Qi, Xiaoqiong, Taimre, Thomas and Rakić, Aleksandar D. (2025). Shaping terahertz harmonic frequency combs with frequency-dependent external reflectors. Physical Review A, 111 (4) 043522, 4. doi: 10.1103/physreva.111.043522 Shaping terahertz harmonic frequency combs with frequency-dependent external reflectors 2025 Conference Publication Optimizing resistor selection and matching for desired resistance Rakić, Aleksandar, Pavlović, Dragan and Ponjavić, Milan (2025). Optimizing resistor selection and matching for desired resistance. 24th International Symposium INFOTEH-JAHORINA (INFOTEH), East Sarajevo, Bosnia and Herzegovina, 19-21 March 2025. Piscataway, NJ, United States: IEEE. doi: 10.1109/infoteh64129.2025.10959283 Optimizing resistor selection and matching for desired resistance 2025 Conference Publication Comparison of IMC and cross-coupling decoupling current regulation structures in PMSM drives Mrđen, Emilija, Matić, Petar and Rakić, Aleksandar (2025). Comparison of IMC and cross-coupling decoupling current regulation structures in PMSM drives. 24th International Symposium INFOTEH-JAHORINA (INFOTEH), East Sarajevo, Bosnia and Herzegovina, 19-21 March 2025. Piscataway, NJ, United States: IEEE. doi: 10.1109/infoteh64129.2025.10959266 Comparison of IMC and cross-coupling decoupling current regulation structures in PMSM drives 2024 Conference Publication Terahertz Laser Feedback Imaging of Marble Cultural Heritage Structures Bertling, Karl, Torniainen, Jari, Guo, Xiao, Bandyopadhyay, Aparajita, Chanda, Puspita, Sengupta, Amartya, Dean, Paul, Li, Lianhe, Indjin, Dragan, Davies, A. Giles, Linfield, Edmund H. and Rakić, Aleksandar D. (2024). Terahertz Laser Feedback Imaging of Marble Cultural Heritage Structures. 2024 Conference on Optoelectronic and Microelectronic Materials and Devices, Melbourne, VIC Australia, 2-5 December 2024. Terahertz Laser Feedback Imaging of Marble Cultural Heritage Structures 2024 Conference Publication Terahertz scattering-type scanning near-field optical microscopy of collective excitations for quantum technologies Guo, Xiao, He, Xin, Degnan, Zachary, Chiu, Chun-Ching, Bertling, Karl, Donose, Bogdan, Steele, Julian A,, Solano, Eduardo, Brünig, Michael, Fedorov, Arkady, Jacobson, Peter and Rakić, Aleksandar D. (2024). Terahertz scattering-type scanning near-field optical microscopy of collective excitations for quantum technologies. 17th International Conference on Near-field Optics, Nanophotonics, and Related Techniques, Melbourne, VIC Australia, 2-6 December 2024. Terahertz scattering-type scanning near-field optical microscopy of collective excitations for quantum technologies 2024 Conference Publication Attocube Near-field Optical Nanoscopy Workshop --- Terahertz nanoscopy: advances, challenges, and the road ahead Guo, Xiao, Bertling, Karl, Donose, Bogdan C., Brünig, Michael, Cernescu, Adrian, Govyadinov, Alexander A. and Rakić, Aleksandar D. (2024). Attocube Near-field Optical Nanoscopy Workshop --- Terahertz nanoscopy: advances, challenges, and the road ahead. 17th International Conference on Near-field Optics, Nanophotonics, and Related Techniques, Melbourne, VIC Australia, 2-6 December 2024. Attocube Near-field Optical Nanoscopy Workshop --- Terahertz nanoscopy: advances, challenges, and the road ahead 2024 Journal Article A novel tape-free sample preparation method for human osteochondral cryosections for high throughput hyperspectral imaging Fan, Xiwei, Donose, Bogdan, Jones, Michael W M, Howard, Daryl, Torniainen, Jari, Bertling, Karl, Guo, Xiao, Kewish, Cameron M, Lee, Kah Meng, Sun, Antonia Rujia, Rakic, Aleksandar, Crawford, Ross, Afara, Isaac O. and Prasadam, Indira (2024). A novel tape-free sample preparation method for human osteochondral cryosections for high throughput hyperspectral imaging. Histochemistry and Cell Biology, 163 (1) 16, 16. doi: 10.1007/s00418-024-02338-1 A novel tape-free sample preparation method for human osteochondral cryosections for high throughput hyperspectral imaging 2024 Journal Article Unravelling the physicochemical and antimicrobial mechanisms of human serum albumin/tannic acid coatings for medical-grade polycaprolactone scaffolds Cometta, Silvia, Donose, Bogdan C., Juárez-Saldivar, Alfredo, Ravichandran, Akhilandeshwari, Xu, Yanan, Bock, Nathalie, Dargaville, Tim R., Rakić, Aleksandar D. and Hutmacher, Dietmar W. (2024). Unravelling the physicochemical and antimicrobial mechanisms of human serum albumin/tannic acid coatings for medical-grade polycaprola",
  "content_length": 24073,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:43"
}