{
  "name": "Aleksandar Ilic",
  "homepage": "http://sips.inesc-id.pt/~ilic",
  "status": "success",
  "content": "Aleksandar Ilic Aleksandar Ilic Assistant Professor, IST, Universidade de Lisboa Senior Researcher, INESC-ID Lisbon, Portugal HOME RESEARCH PROJECTS SERVICES TEACHING CV INFO CACHE-AWARE ROOFLINE (CARM) Home Aleksandar Ilic is an Assistant Professor with the Department of Electrical and Computer Engineering (DEEC) of Instituto Superior Técnico (IST), Universidade de Lisboa and a Senior Researcher at the SIPS Group, INESC-ID, Lisbon, Portugal. My current reserach interests include: High-performance and Energy-efficient Computing Computer Architectures general-purpose, parallel and heterogeneous multicores Heterogenous Systems and Applications load balancing, performance modeling, video coding I received my Ph.D. in Electrical and Computer Engineering from the Instituto Superior Técnico (IST), Universidade de Lisboa, Portugal, in February 2014, under the supervision of Prof. Leonel Sousa. Other education and employment details can be found in CV page. Latest Events 02.03. | Our Cache-aware Roofline in Intel® Advisor 23.02. | EuroPar'21: We're in charge! PhD Symposium soon to be announced! 14.02. | IEEE TPDS: Ricardo's journal accepted 09.02. | IST Excellence in Teaching for 2019/2020 13.11. | Intel oneAPI Dev Summit: Rooflining bio talk 09.11. | SC'20: Join our tutorial with Intel, NVIDIA, Argonne and LBNL 02.11. | Intel Innovator Award to our boosting epistasis team! 13.10. | SparCity: We're in! EU project got funded! 01.09. | EuroPar'20: when Rafael and Diogo join forces! 15.08. | IEEE Cluster'21: TPC member for Area 1 10.06. | FGCS: Diogo's Q1 journal is out! 19.05. | IPDPS'20: Ricardo's work as best paper nominee! 20.02. | JOCS: Francisco's journal printed! all events Aleksandar Ilic Assistant Professor / Senior Researcher Instituto Superior Técnico, Universidade de Lisboa SiPS, INESC-ID Rua Alves Redol 9, 1000-029 Lisbon, Portugal office: (+351)213100300 | fax: (+351)213145843 e-mail: aleksandar.ilic[at]inesc-id.pt Copyright © 2008–2014, Aleksandar Ilic [sips.inesc-id.pt/~ilic]",
  "content_length": 2015,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:42"
}