{
  "name": "Alessandro Sanzeni",
  "homepage": "https://cs.unibocconi.eu/people/alessandro-sanzeni",
  "status": "success",
  "content": "Alessandro Sanzeni | Department of Computing Sciences Skip to main content Open shareCloseShareClose Alessandro Sanzeni Since September 2022, I have been an Assistant Professor in the Department of Computing Sciences at Bocconi University. Before joining Bocconi, I was a researcher at Columbia University, Duke University, and the National Institutes of Health. I was also a visiting researcher at the University of Chicago, the University of California San Diego, and the Pasteur Institute in Paris.  Before doing research abroad, I studied theoretical physics at the University of Milan in Italy.Assistant Professoralessandro.sanzeni@unibocconi.itDownload the cv (240.26 KB)Research interestsResearch in my group tackles fundamental questions in neuroscience by integrating theoretical approaches—mathematical modeling, statistical physics, and machine learning—with experimental data. Currently, we focus on understanding how the visual system supports complex functions, such as object recognition and tracking. We approach this from multiple perspectives:Functional models:  Neuroanatomical evidence shows that the visual system in the brain consists of multiple interconnected areas arranged in a shallow hierarchy. How is visual information transformed along this hierarchy? Do different areas gradually transform raw sensory input into higher-level abstract representations, similar to modern deep learning models? Or do individual areas specialize in specific computations? To address these questions, we are developing and probing data-driven models of the visual hierarchy.Mechanistic models: How do neural responses to visual stimuli emerge from the collective dynamics of neurons? We investigate this process at multiple scales—from dendritic computations at the single-cell level to neural interactions within local circuits and multi-area interactions at the macro scale. Using a physics-inspired approach, we employ simple models constrained by experimental data to identify the key mechanisms driving visual processing.Normative models: Why are neural circuits structured as they are? Are features of brain networks different from artificial ones merely biological quirks, or do these features provide specific computational benefits? We aim to answer these questions using simplified models to explore the impact of particular features on computations, guided by a statistical physics approach.If you are interested in joining/collaborating with us—or simply curious about this work—please reach out. Selected Publications A. Sanzeni; A. Palmigiano; T. Nguyen; J.Luo; J. Nassi; J. Reynolds; M.H. Histed; K.Miller; N. Brunel Mechanisms underlying reshuffling of visual responses by optogenetic stimulation in mice and monkeys Neuron (2023) A. Sanzeni; M.H. Histed; N. Brunel Emergence of Irregular Activity in Networks of Strongly Coupled Conductance-Based Neurons Physical Review X (2022) A. Sanzeni; B. Akitake; H.C. Goldbach; C.E. Leedy; N. Brunel; M. H. Histed Inhibition stabilization is a widespread property of cortical networks Elife (2020) A. Sanzeni; S. Katta; B. Petzold; B.L. Pruitt; M.B. Goodman; M. Vergassola Somatosensory neurons integrate the geometry of skin deformation and mechanotransduction channels to shape touch sensing eLife (2019) A. L. Eastwood; A. Sanzeni; B.C. Petzold; S.J. Park; M. Vergassola; B.L. Pruitt; M.B. Goodman Tissue mechanics govern the rapidly adapting and symmetrical response to touch Proceedings of the National Academy of Sciences (2015) Teaching20656METHODS AND DATA ANALYTICS FOR RISK ASSESSMENT 30563MATHEMATICAL MODELLING FOR NEUROSCIENCE MenuResearch interestsSelected PublicationsTeaching",
  "content_length": 3660,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:00"
}