{
  "name": "Alessandro Abate",
  "homepage": "https://www.cs.ox.ac.uk/people/alessandro.abate",
  "status": "success",
  "content": "Alessandro Abate | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyAlessandro AbateAlessandro Abate Professor Alessandro Abate Professor of Computer Science (Verification and Control)E: alessandro.abate@cs.ox.ac.ukT: +44 (0) 18656 10767 Room 340, Wolfson Building, Parks Road, Oxford OX1 3QD United Kingdom Themes:Automated VerificationArtificial Intelligence and Machine LearningSee Also:Personal webpageOXCAV group webpageInterestsMy research interests lie on the analysis, verification, and optimal control of heterogeneous and complex dynamical models -- in particular of stochastic hybrid systems -- and in their applications in cyber-physical systems (smart energy and safety-critical autonomy), and modelling for the life sciences (systems biology). I am interested in a principled integration of model-based mathematical techniques with data-driven learning algorithms.  BiographyI am Professor of Verification and Control in the Department of Computer Science at the University of Oxford. Earlier, I did research at Stanford University and at SRI International, and was an Assistant Professor at the Delft Center for Systems and Control, TU Delft. I received a Laurea degree from the University of Padova and MS/PhD at UC Berkeley.  Selected PublicationsView AllManage publications Automated formal synthesis of provably safe digital controllers for continuous plants Alessandro Abate‚ Iury Bessa‚ Lucas Cordeiro‚ Cristina David‚ Pascal Kesseli‚ Daniel Kroening and Elizabeth Polgreen In Acta Informatica. December, 2019. Details about Automated formal synthesis of provably safe digital controllers for continuous plants | BibTeX data for Automated formal synthesis of provably safe digital controllers for continuous plants | DOI (10.1007/s00236-019-00359-1) Data−efficient Verification of Parametric Markov Chains A. Abate E. Polgreen V. Wijesuriya S. Haesaert In Quantitative Evaluation of SysTems (QEST). 2016. Details about Data−efficient Verification of Parametric Markov Chains | BibTeX data for Data−efficient Verification of Parametric Markov Chains | DOI (10.1007/978-3-319-43425-4_3) A Mathematical Model to Study the Dynamics of Epithelial Cellular Networks A. Abate‚ S. Vincent‚ R. Dobbe‚ A. Silletti‚ N. Master‚ J. Axelrod and C. Tomlin In IEEE/ACM Transactions on Computational Biology and Bioinformatics (TCBB). Vol. 9. Pages 1607−1620. 2012. Details about A Mathematical Model to Study the Dynamics of Epithelial Cellular Networks | BibTeX data for A Mathematical Model to Study the Dynamics of Epithelial Cellular Networks | DOI (10.1109/TCBB.2012.126) | Link to A Mathematical Model to Study the Dynamics of Epithelial Cellular Networks ActivitiesCyber Physical SystemsVerificationSoftware Model CheckingProbabilistic Verification for Systems BiologyMachine Learning SystemsQuantitative Analysis and VerificationProbabilistic Model CheckingProjectsAI Hub Current Students Patrick  BenjaminMatthew Farrugia-RobertsCharlie GriffinLewis HammondJonathan HauMathias JackermeierWei-Chen LeeKaran MukhiDiptarko RoyYannik SchnitzerChristoph Weinhuber Research Thom BadingsResearch AssociateVirginie DebaucheResearch AssociateFrancesco FabianoResearch AssociateAgustín Martínez SuñéResearch AssociateNikolaus VertovecJunior Research Fellow Past Students Joe BrownDario CattaruzzaNathalie CauchiFrancesco Cosentino (The Alan Turing Institute) James FoxGareth MolyneuxMuhammad Syifa'ul MufidAndrea PeruffoElizabeth PolgreenTimothy SeabrookJoar Skalse Past Researchers Alec EdwardsMirco GiacobbeResearch AssociateHosein HasanbeigYongchao HuangKendra LesserLicio RomaoStella  SimicSadegh SoudjaniResearch AssistantAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 3929,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:44"
}