{
  "name": "Alessandro F. Garcia 0001",
  "homepage": "http://www.inf.puc-rio.br/~afgarcia",
  "status": "success",
  "content": "Alessandro F. Garcia - Principal Home Publications Projects Related Links Miscellaneous Alessandro Garcia Associate Professor Informatics Department, PUC-Rio Head of the Opus Research Group D.Sc. Computer Science, DI - PUC-Rio, Brazil (2004) In cooperation with: - IBM Almaden Research Center, USA - University of Waterloo, Canada Distinguished Scientist (\"Cientista do Nosso Estado\", FAPERJ, 2016-2022) CNPq Scientist 1C (2016-2020) Electronic Mail Address afgarcia (at) inf.puc-rio.br ESEC FSE 2020 MSR 2020 Research Interests Modularity, Exception Handling, Software Architecture, Software Refactoring, Product Lines, Metrics, Software Dependability Distinctions and Awards * Distinguished Scientist, Rio de Janeiro State (Faperj) - 2019-2022 * Distinguished Reviewer Award, MSR 2019 * Distinguished Contribution in Software Engineering, Brazilian Computer Society * ACM Distinguished Paper Award, ICSE 2018 * Research Productivity Grant, CNPq/1C - 2016-2019 * Distinguished Scientist, Rio de Janeiro State (Faperj) - 2016-2019 * Research Productivity Grant, CNPq/1D - 2013-2016 * ACM Distinguished Paper Award, ICSE 2014 * Distinguished Young Scholar, Faperj - 2013-2016 * Distinguished Young Scholar, PUC-Rio Grant - 2012 * TWAS-ROLAC Prize for Young Scientists, August 2010 * Affiliate Member of the Brazilian Academy of Sciences, 2009-2014 * Distinguished Young Scholar, Faperj - 2009-2012 * Research Productivity Grant, CNPq/2 - 2009-2012 * Distinguished Young Scholar, PUC-Rio Grant - 2009 * Research Award - Career Achievements, Lancaster University - 2006 Ongoing and Previous Projects ComDADO - Combating Architecture Degradation via Anomaly Pattern Detection AMAComP - Identifying Architecturally-Relevant Code Anomalies (with USC and Drexel) GComp - Managing Cross-Organizational Reusable Assets (with PETROBRAS) DAnSis - Detecting Anomalies in Evolving Systems (with UFF and LNCC) MDCC - Software Engineering for Ubiquitous Systems (with UFC) TACOR - Software Composition Techniques for Recovery-Oriented Software CASA - Evaluation of Software Composition Techniques (with Lancaster Univ.) SciPRO - Improving Quality of Scientific Software (with LNCC) MDEvol - Enhancing Model-Driven Evolution and Reuse (with Brazilian Navy) AvaTar - Evolution of Modular Programming Techniques (with Darmstatd Univ.) CODES - Systems and Software Engineering for Digital TV (Procad) MecCoM - Contemporary Modularization Mechanisms: Empirical Studies REACT - Error Recovery in Context-Aware Asynchronous Systems (with INPE) Evaluation and Adaptation of Contemporary Modularity Techniques History-Sensitive Assessment of Product Lines Metrics for Product-Line Software Architectures Composing Software Models: Metrics and Experimental Studies Procad - Aspect-Oriented Techniques for Product Lines A Testbed for AOSD RODEP: An Aspect-Oriented Business Process Infrastructure Current Postdocs and Students Juliana Alves Pereira (Postdoc, 2020) Silvia Regina Vergilio (Postdoc, 2020) Thelma Elita Colanzi (Postdoc, 2019) Wesley Assunção (Postdoc, 2019) Roberto Oliveira (Postdoc, 2017) Eduardo Fernandes (PhD, 2017) William Oizumi (PhD, 2017) Ana Carla Bibiano (PhD, 2019) Anderson G. Uchôa (PhD, 2019) Anderson J. S. Oliveira (PhD, 2019) João Dutra (PhD, 2019) Daniel Tenório (MSc, 2018) Luiz Matheus Carvalho (MSc, 2018) Caio Barbosa (MSc, 2019.1) Daniel Coutinho (MSc, 2019.2) Vinícius Soares (MSc, 2019.2) Former Students and RAs Leonardo Sousa (Postdoc, 2018-2019), Rafael Maiani (Postdoc, 2016-2019), Leonardo Sousa (PhD, 2014-2018), Diego Cedrim (PhD, 2014-2018) Roberto Oliveira (PhD, 2013-2013-2017), Bruno Cafeo (Postdoc, 2015), Eiji Barbosa (PhD, 2012-2015), Bruno Cafeo (PhD, 2011-2015), Éverton Tavares (Postdoc, 2015), Éverton Tavares (PhD, 2010-2014), Francisco Dantas (PhD, 2009-2013), Isela Macia (PhD, 2009-2013), Kleinner Farias (PhD, 2008-2012), Camila Nunes (PhD, 2009-2012), Rachel Burrows (PhD, 2007-2011), Eduardo Figueiredo (PhD, 2006-2009), Nelio Cacho (PhD, 2006-2009), Claudio Sant'Anna (PhD, 2005-2009), Neil Loughran (R.A., 2006-2008), Phil Greenwood (R.A, 2006), Safoora Khan (PhD, 2006-2009), Omar Alhadythi (PhD, 2005-2008), Daniel Tenório (MSc, 2020), Luiz Matheus Carvalho (MSc, 2020), Anderson G. Uchôa (MSc, 2017-2019), Anderson J. S. Oliveira (MSc, 2017-2018), Ana Carla Bibiano (MSc, 2017-2018), Isabella Vieira (MSc, 2016-2018), Anne Benedicte Agbachi (MSc, 2016-2018), Alexander Lopez (MSc, 2016-2017), Marcelo Garnier (MSc, 2013-2016), William Oizumi (MSc, 2013-2015), Luciano Sampaio ( MSc, 2013-2015), Diego Albuquerque (MSc, 2012-2014), Manuele Ferreira (MSc, 2012- 2014), Alexandre Silva (MSc, 2011-2013), Omar El Khaldi (MSc-Visitor, 2013), Bruno Fábri (MSc, 2011-2013), Roberta Arcoverde (MSc, 2010-2012), Alessandro Gurgel (MSc, 2010-2012), Eiji Barbosa (MSc, 2010-2012), Leandra Dias (MSc, 2009-2010), Marcelo Moura (MSc, 2008-2009), Thomas Addison (MSc, 2007- 2008), Karla Damasceno (MSc, 2005-2006), Cidiane Lobato (MSc, 2004-2005) ICSE'21 - Program Commitee, New Ideas and Emerging Results track ICSE'21 - Student Research Competition Co-Chair, 43st International Conference on Software Engineering MSR'20 - Program Committee, 17th International Conference on Mining Software Repositories Empirical Software Engineering - Editorial Board Member ESEC/FSE'20 - PC Member, 28th Joint European SE Conference and Symposium on the Foundations of SE ICSA'20 - Program Co-Chair, International Conference on Software Architecture ICSA - Steering Committee Member ICSE'20 - PC Member, 41st International Conference on Software Engineering ICSE'19 - Student Research Competition Co-Chair, 41st International Conference on Software Engineering ICSE'19 - Program Board, 41st International Conference on Software Engineering ESEC/FSE - Steering Committee Member ICSA Steering Committee ESEC/FSE'19 - PC Member, 27th Joint European SE Conference and Symposium on the Foundations of SE MSR'19 - Program Committee, 16th International Conference on Mining Software Repositories ESEM'19 - PC Member, 17th ACM Intl. Conference on Empirical SE and Measurement ESEC/FSE'18 - PC Co-Chair, 26th Joint European SE Conference and Symposium on the Foundations of SE ICSE'18 - PC Member, New Ideas Track - 40th International Conference on Software Engineering ICPC'18 - PC Member, 26th Intl Conference on Program Comprehension IEEE Transactions on Software Engineering - Editorial Board Member Journal of Systems and Software - Editorial Board Member JSERD - Editor-in-Chief, Journal of Software Engineering Research and Development ICSE'17 - Program Board Member, 39th International Conference on Software Engineering ESEC/FSE'17 - PC Member, 25th Intl Symposium on Foundations of Software Engineering ICSME'17 - PC Member, 32th Intl Conference on Software Maintenance and Evolution FSE'16 - PC Member, 24th Intl Symposium on Foundations of Software Engineering ICSE'16 - PC Member, 38th International Conference on Software Engineering ICSME'16 - PC Member, 32th Intl Conference on Software Maintenance and Evolution ICPC'16 - PC Member, 24th Intl Conference on Program Comprehension MODELS'16 - PC Member, ACM/IEEE 19th Intl. Conf. on Model-Driven Engineering WICSA and CompArch 2016 - PC Member, 13th Conference on Software Architecture SANER'16 - 23rd IEEE Intl. Conference on Software Analysis, Evolution and Reengineering ICSE'15 - Doctoral Symposium Co-Chair @ 37th Intl. Conf. on Software Engineering ICPC'15 - PC Member, 23th Intl Conference on Program Comprehension MODELS'15 - PC Member, ACM/IEEE 18th Intl. Conf. on Model-Driven Engineering ICSE'17 Warm-up Symposium, ACM SIGSoft Symposium for Latin-American PhD Students CTD'15 - Chair, Brazilian Contest of MSc and PhD Theses on Computer Science ICSME'15 - PC Member, 31st Intl Conference on Software Maintenance and Evolution ESEM'15 - PC Member, 13th ACM Intl. Conference on Empirical SE and Measurement CBSE'15 - PC Member, 7th Intl Symposium on Component-Based Software Engineering ICSE'14 - SEET Track Co-Chair @ 36th Intl. Conf. on Software Engineering FSE'14 - PC Member, 22th Intl Symposium on Foundations of Software Engineering MODELS'14 - Publicity Co-Chair, ACM/IEEE 17th Intl. Conf. on Model-Driven Engineering MODELS'14 - PC Member, ACM/IEEE 17th Intl. Conf. on Model-Driven Engineering ICPC'14 - PC Member, 22th Intl Conference on Program Comprehension ESEM'14 - PC Member, 12th ACM Intl. Conference on Empirical SE and Measurement GPCE'14 - PC Member, 13th International Conference on Generative Programming MODULARITY'14 - PC Member, 13th ACM Intl. Conference on Modularity CSBE'14 - PC Member, 7th Intl Symposium on Component-Based Software Engineering SBES'14 - PC Member, 28th Brazilian Symposium on Software Engineering CTD'14 - PC Member, Brazilian Contest of MSc and PhD Theses on Computer Science Informatics Department - PUC-Rio OPUS Research Group,  Software Engineering Lab URL: http://www.les.inf.puc-rio.br/opus/ Rua Marquês de São Vicente, 225 - Gávea  22451-900, Rio de Janeiro, RJ  Brazil Phone: +55 21 3527-1500 ext. 4336, FAX: +55 21 3527-1530",
  "content_length": 9063,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:58"
}