{
  "name": "Alessandro Pandini",
  "homepage": "https://www.brunel.ac.uk/people/alessandro-pandini",
  "status": "success",
  "content": "Dr Alessandro Pandini | Introduction | Brunel University London Skip to Content Home People Dr Alessandro Pandini Dr Alessandro PandiniSenior Lecturer in Computer Science Email: alessandro.pandini@brunel.ac.uk Tel: +44 (0)1895 268045 Computer Science College of Engineering, Design and Physical Sciences Summary My research activity focuses on the development and application of computational methods to study protein dynamics and its role in protein-ligand binding, protein-protein interactions, and protein design. I obtained my PhD in Computational Chemistry at the University of Milan-Bicocca under the supervision of Prof. Laura Bonati. As part of her research group I contributed to the unveil the molecular mechanism of toxic response mediated by binding of dioxins to the Aryl hydrocarbon Receptor. In 2008 I was awarded a Marie Curie Inter European Fellowship to work at the MRC National Institute for Medical Research (NIMR) under the supervision of Dr. Willie R. Taylor and Dr. Jens Kleinjung. From 2011 to 2014 he was a BBSRC-funded postdoctoral research assistant in the group of Prof. Franca Fraternali at King’s College London working on methods to investigate allosteric regulation, and to analyse protein-protein interaction interfaces and networks. During my career I developed and applied novel approaches combining structural bioinformatics and molecular simulation to address challenging biological questions, especially in relation to protein function, allosteric regulation and drug design. I introduced novel points of view in the definition of the limits and potential of molecular docking on theoretical models and in the use of molecular dynamics for drug design and medicinal chemistry. In particular, I developed an innovative computational method to detect local functional motions and to describe allosteric transmission in protein structures. Most recently, in collaboration with Dr. Arianna Fornili (QMUL), I contributed to the development of a novel strategy for biasing the sampling of local states to drive the global conformational transitions in proteins. In collaboration with Dr. Shahid Khan (LBNL – Berkeley Lab) and Dr. Willie Taylor, I have contributed to explain the relationships between residue coevolution and molecular dynamics in two bacterial ring assemblies. Responsibility Director of Postgraduate Studies in the Department of Computer Science Newest selected publications Hossein Nezhad, F., Oues, N., Massimiliano, M. and Pandini, A. (2025) 'MDGraphEmb: A Toolkit for Graph Embedding and Classification of Protein Conformational Ensembles'. Bioinformatics, 0 (ahead of print). pp. 1 - 10. ISSN: 1367-4803 Open Access Link Journal article Motta, S., Callea, L., Ismail Mulla, S., Davoudkhani, H., Bonati, L. and Pandini, A. (2025) 'SOMMD: An R Package for the Analysis of Molecular Dynamics Simulations using Self-Organising Map'. Bioinformatics, 41 (6). pp. 1 - 5. ISSN: 1367-4803 Open Access Link Journal article Xu, M., Dantu, SC., Garnett, J., Bonomo, R., Pandini, A. and Haider, S. (2025) 'Functionally important residues from graph analysis of coevolved dynamic couplings'. eLife, 14. pp. 1 - 26. ISSN: 2050-084X Open Access Link Journal article Gomaz, B., Pandini, A., Maršavelski, A. and Štefanić, Z. (2024) 'MDavocado: Analysis and Visualization of Protein Motion by Time-Dependent Angular Diagrams'. Journal of Chemical Information and Modeling, 64 (15). pp. 5742 - 5748. ISSN: 1549-9596 Journal article Kliza, KW., Song, W., Pinzuti, I., Schaubeck, S., Kunzelmann, S., Kuntin, D., Fornili, A., Pandini, A., Hofmann, K., Garnett, JA., Stieglitz, B. and Husnjak, K. et al. (2024) 'N4BP1 functions as a dimerization-dependent linear ubiquitin reader which regulates TNF signalling'. Cell Death Discovery, 10 (1). pp. 1 - 15. ISSN: 2058-7716 Open Access Link Journal article More publications(46)",
  "content_length": 3856,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:53"
}