{
  "name": "Ales Leonardis",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/leonardis-ales.aspx",
  "status": "success",
  "content": "Professor Ales Leonardis - School of Computer Science - University of Birmingham Professor Ales Leonardis PhD School of Computer ScienceChair of Robotics at the School of Computer Science Contact details Telephone+44(0)121 414 8556 Emaila.leonardis@cs.bham.ac.uk AddressCentre for Computational Neuroscience and Cognitive RoboticsSchool of Computer ScienceUniversity of BirminghamEdgbastonBirminghamB15 2TT Ales Leonardis is Chair of Robotics at the School of Computer Science, University of Birmingham and Co-Director of the Computational Neuroscience and Cognitive Robotics Centre at the University of Birmingham. He is also Professor of Computer and Information Science at the University of Ljubljana and an Adjunct Professor at the Faculty of Computer Science, Graz University of Technology. He was a visiting researcher at the GRASP Laboratory at the University of Pennsylvania, post-doctoral fellow at PRIP Laboratory, Vienna University of Technology, and visiting professor at ETH Zurich and University of Erlangen. Ales’ research interests include robust and adaptive methods for computer/cognitive vision, object and scene recognition and categorization, statistical visual learning, object tracking, and biologically motivated vision - all in a broader context of artificial cognitive systems and robotics. He has extensive experience in participating and managing multi-site international projects including eight European Commission (FP5, FP6, FP7 and H2020) projects, one DARPA project (Neovision2) and one ONR MURI project. He is actively involved in applied robotics and computer vision projects with nuclear (National Nuclear Laboratory) and industrial robotics industry (KUKA Robotics UK).He was a Program Co-chair of the European Conference on Computer Vision 2006 and he has been an Associate Editor of the IEEE PAMI and IEEE Robotics and Automation Letters, an editorial board member of Pattern Recognition and Image and Vision Computing, and an editor of the Springer book series Computational Imaging and Vision. In 2002, he coauthored a paper, Multiple Eigenspaces, which won the 29th Annual Pattern Recognition Society award. He is a fellow of the IAPR and in 2004 he was awarded one of the two most prestigious national (SI) awards for his research achievements. His google scholar profile. M. Kristan, J. Matas, A. Leonardis, T. Vojir, R. Pflugfelder, G. Fernandez, G. Nebehay, F. Porikli, L. Cehovin, “A novel performance evaluation methodology for single-target trackers”. IEEE trans. pattern anal. mach. intell., 2016, pp. 1-20. L. Cehovin, A. Leonardis, M. Kristan, “Visual object tracking performance measures revisited”. IEEE trans. image process, 2016, vol. 25, no. 3, pp. 1261-1274. M. Kopicki, R. Detry, M. Adjigble, R. Stolkin, A. Leonardis, J. L. Wyatt, “One shot learning and generation of dexterous grasps for novel objects”. The International Journal of Robotics Research, 2015. M. Kristan, A. Leonardis, “Online discriminative kernel density estimator with Gaussian kernels”. IEEE transactions on cybernetics, 2014, vol. 44, no. 3, pp. 355-365. N. Krueger, P. Janssen, S. Kalkan, M. Lappe, A. Leonardis, J. Piater, A. J. Rodrıguez-Sanchez, L. Wiskott, “Deep Hierarchies in the Primate Visual Cortex: What Can We Learn For Computer Vision?”, IEEE trans. pattern anal. mach. intell., vol. 35, no. 8, pp. 1847-1871, 2013. L. Cehovin, M. Kristan, A. Leonardis, “Robust visual tracking using an adaptive coupled-layer visual model”, IEEE trans. pattern anal. mach. intell., April 2013, pp. 1-14. B. Leibe, A. Leonardis, B. Schiele, \"Robust object detection with interleaved categorization and segmentation\", Int. j. comput. vis., vol. 77, no. 1/3, pp. 259-289, 2008. S. Fidler, D. Skocaj, A. Leonardis, \"Combining reconstructive and discriminative subspace methods for robust classification and regression by subsampling\", IEEE trans. pattern anal. mach. intell., vol. 28, no. 3, pp. 337-350, Mar. 2006. M. Jogan, A. Leonardis, \"Robust localization using an omnidirectional appearance-based subspace model of environment\", Robot. auton. syst., vol. 45, pp. 51-72, 2003 M. Jogan, E. Zagar, A. Leonardis, \"Karhunen-Loeve expansion of a set of rotated templates\", IEEE trans. image process., vol. 12, no. 7, pp. 817-825, July 2003. A. Leonardis, H. Bischof, J. Maver, \"Multiple eigenspaces\", Pattern recogn., vol. 35, issue 11, pp. 2613-2627, Nov. 2002. A. Leonardis, H. Bischof, \"Robust recognition using eigenimages\", Comput. vis. image underst., vol. 78, no. 1, pp. 99-118, 2000. A. Leonardis, A. Jaklic, F. Solina, \"Superquadrics for segmenting and modeling range data\", IEEE trans. pattern anal. mach. intell., vol. 19, no. 11, pp. 1269-1295, November 1997. A. Leonardis, A. Gupta, R. Bajcsy, \"Segmentation of range images as the search for geometric parametric models\", Int. j. comput. vis., vol. 14, pp. 253-277, 1995. Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 4979,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:44"
}