{
  "name": "Alessio Guglielmi",
  "homepage": "http://alessio.guglielmi.name",
  "status": "success",
  "content": "Alessio Guglielmi's Research and Teaching Alessio Guglielmi's Research and Teaching Electric lamps were not invented by improving candles Perhaps you were looking for the Deep Inference pages? Contents Overview of Research Normalisation and Proof Complexity Identity of Proofs and Deductive Nets Summary Politics Recent Papers Notes Recent Talks Research Students Recent Grants Mailing Lists Teaching   Address Department of Computer Science University of Bath Bath BA2 7AY United Kingdom fax: +44 (1225) 383 493 A.GuglielmiATBath.Ac.UK 1 Overview of Research I do proof theory from a theoretical computer science perspective. I am mainly interested in deep inference, a new methodology in proof theory that my collaborators and I have introduced. Theoretical computer science mainly helps proof theory by bringing to it quantitative and semantic ideas, and proof theory mainly helps computer science by supporting the design of programming languages and the verification of software correctness. The heart of what I do in proof theory is normalisation. This is still a mysterious combinatorial phenomenon, that is intimately connected to fundamental questions about how much we can compress information. Proof-theoretic research takes place in the purest setting where these problems can be defined, and, as such, it is a fundamental study that has and will continue to have far-reaching applications in computer science. Two problems motivated the development of this research: understanding normalisation and the identity of proofs. 1.1 Normalisation and Proof Complexity One research objective is to understand normalisation in propositional logics (first order and, at a later time, second order). Deep inference reveals finer and finer structure in the inference rules. With the methods developed for deep inference, we can see that cut elimination is only a special instance of a much broader normalisation phenomenon. Our techniques unveil new properties of derivations, impossible to be observed in the sequent calculus. One of the most interesting discoveries is that deep-inference rules show an unprecedented regularity in the shape of inference rules of very different logics. In what I call 'subatomic proof theory', it seems possible to describe most of the known logics by just one, simple inference rule. I'm also interested in proof complexity: since deep inference generalises the sequent calculus, proofs in deep inference can only be shorter than in the sequent calculus. Indeed, on some classes of tautologies, like Statman's ones, there is an exponential speed-up of an analytic deep-inference system over all analytic sequent-calculus ones. We started only recently to study the proof complexity of deep inference. Deep inference is a powerful methodology in this respect, on par with Frege-Hilbert systems (but with better properties). We wonder whether deep inference could give good insights into the many open questions in proof complexity. We are obtaining a broad theory of normalisation and, more in general, of the design of deductive systems, which are based on more basic and simple principles than traditional proof theory offers. 1.2 Identity of Proofs and Deductive Nets Another research objective is to come up with useful, interesting notions of identity of proofs. It is embarrassing for proof theory that the natural question of 'when are two proofs to be considered identical?' lacks good answers. (This question is tightly connected to the equally non-well-understood problem of deciding when two algorithms are the same.) One reason for our embarrassment is that the notion of normalisation available, viz. cut elimination, is inadequate to decide the question; I believe that the problem is that this is the only (reasonable) normalisation notion available in the sequent calculus and natural deduction. Thanks to its finer granularity, deep inference offers several natural new notions of normalisation, this way improving our ability to study new concepts of identity. The calculus of structures is now a fully developed deep inference formalism, but I don't believe that it is the natural setting where to study the proof identity problem: there still is too much bureaucracy in it. I believe that deductive nets will be the right place where to work. Proof nets eliminate, in fact, much of the bureaucracy of calculi like the sequent calculus or the calculus of structures. But which proof nets? Linear logic proof nets are certainly inadequate, because of the poor way they deal with 'sharing', and then because they are not deductive, in the sense that they are not a proof system. We need a much more refined notion, suitable also to classical logic. We observed that deep inference yields some interesting notions towards deductive nets. In fact, deep inference allows us to design deductive systems whose rules are all local, i.e., their computational complexity is constant (this is provably impossible in traditional proof theory). This property lends itself naturally to a geometric understanding of proofs. In other words, we can now see a geometric structure lurking behind the syntax, and we can control this structure thanks to our local inference rules. We are already able to use part of this geometric structure to control normalisation, by what we call atomic flows. I think that in a few years we will be able to exploit the full potential of the geometry behind proofs in order to have a satisfactory, topological answer to the problem of the identity of proofs. 1.3 Summary Deep inference reveals regularities that traditional formalisms cannot detect, and it offers new proof theoretical properties, of special interest for normalisation. My colleagues and I are exploiting these regularities and properties in a unified theory of several logics. This will yield deductive nets, for which the problem of identity of proofs will be solved in a satisfactory way. I have three main reasons to work in this area: 1) It is beautiful; this research involves working with beautiful, elegant mathematical objects. 2) It is interesting; it addresses important, challenging problems in proof theory, and they are difficult. 3) It is useful for designing computer science languages; in fact, my research started from questions raised by computer languages for concurrency. I believe that mathematics is mostly about finding the right definitions, those that affect the way we see things. The following web page contains more details about my current research: Deep Inference (FAQ, papers, notes, etc.). 2 Politics This is something I feel strongly about: Knowledge cannot be measured. As soon as measuring knowledge is attempted, researchers, who are not self-confident enough to resist, try to improve their score (number of papers, h-index, grant money, etc.), and the result is uninspired, incremental research of little value. Unfortunately, most politicians and all managers come from a business culture where everything is thought to be measurable, including knowledge. Academic freedom is declining. As a result of its success in generating technology and economic power, science is now considered a commodity by governments. They are now predominantly financing research with demonstrable short-term impact on the economy. Therefore, research is now dominated by a class of technology-oriented researchers whose main drive is not curiosity but career progress and commercial exploitation of research. These people are subservient to governments and do not understand and support research with revolutionary potential. Academics have historically been a strong force of change, but they are now sadly becoming another branch of the establishment. What is even sadder is that most younger researchers do not even realise this. Researchers should resist the business culture because, when applied to science, it is morally wrong and it stifles progress. This paper by Smaldino and McElreath (published by the Royal Society) shows how a culture of poor research methods is created by current incentives, and illustrates all of the above points: The Natural Selection of Bad Science. I boycott Elsevier. I signed the San Francisco Declaration on Research Assessment. I wrote a letter to The Guardian. I pledged No free view? No review! I signed the Pledge for Sustainable Research in Theoretical Computer Science I have some more specific opinions on refereeing and conferences here. 3 Recent Papers A Subatomic Proof System for Decision Trees Chris Barrett and Alessio Guglielmi We design a proof system for propositional classical logic that integrates two languages for Boolean functions: standard conjunction-disjunction-negation and binary decision trees. We give two reasons to do so. The first is proof-theoretical naturalness: The system consists of all and only the inference rules generated by the single, simple, linear scheme of the recently introduced subatomic logic. Thanks to this regularity, cuts are eliminated via a natural construction. The second reason is that the system generates efficient proofs. Indeed, we show that a certain class of tautologies due to Statman, which cannot have better than exponential cut-free proofs in the sequent calculus, have polynomial cut-free proofs in our system. We achieve this by using the same construction that we use for cut elimination. In summary, by expanding the language of propositional logic, we make its proof theory more regular and generate more proofs, some of which are very efficient. That design is made possible by considering atoms as superpositions of their truth values, which are connected by self-dual, non-commutative connectives. A proof can then be projected via each atom into two proofs, one for each truth value, without a need for cuts. Those projections are semantically natural and are at the heart of the constructions in this article. To accommodate self-dual non-commutativity, we compose proofs in deep inference. Pdf 30 June 20",
  "content_length": 44705,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:04"
}