{
  "name": "Alessandro Bruni",
  "homepage": "https://pure.itu.dk/portal/en/persons/alessandro-bruni(5c50bbc9-ed3d-417f-ba4d-e484eaf536b3).html",
  "status": "success",
  "content": "Alessandro Bruni - IT-University of Copenhagen Alessandro Bruni Associate Professor, Theoretical Computer ScienceProgramming Logic and SemanticsCenter for Information Security and Trust https://orcid.org/0000-0003-2946-9462 EmailbrunitudkWebsitehttp://alessandrobruni.name 20162025 Research activity per year Personal profile KeywordsSecurityProtocolsProtocol analysisFormal verificationEthical hackingElectronic votingIoT Fingerprint Dive into the research topics where Alessandro Bruni is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Formal Analysis Keyphrases 100% EDHOC Keyphrases 93% Key Establishment Computer Science 93% Formalization Computer Science 93% Internet-Of-Things Computer Science 83% Constrained IoT Devices Keyphrases 68% ProVerif Keyphrases 55% Tamarin Keyphrases 51% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2016 2016 2017 2020 2021 2024 2025 2025 13 Article in proceedings 1 Report 1 Paper 1 Conference article 1 More 1 Other contribution Research output per year Research output per year Formalizing Concentration Inequalities in Rocq: Infrastructure and AutomationAffeldt, R., Bruni, A., Cohen, C., Saikawa, T. & Roux, P., Sept 2025, Leibniz International Proceedings in Informatics, LIPIcs. Vol. 16. p. 1-20 20 p. (Leibniz International Proceedings in Informatics (LIPIcs)).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Formalization 100% Concentration Inequalities 100% Decision Procedure 50% Random Variable 50% Proof 50% Quantifiers for Differentiable Logics in Rocq (Extended Abstract)Bruni, A., 2025, 8th International Symposium on AI Verification (SAIV 2025), Zagreb, Croatia, July 21--22, 2025. p. 1-12 12 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Logical Expression 100% Formal Logic 100% Library Component 100% Logic Learning 66% Logical Connectives 66% Skolemisation for Intuitionistic Linear LogicBruni, A., Ritter, E. & Schürmann, C., 2024, International Joint Conference on Automated Reasoning. SpringerResearch output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Intuitionistic Linear Logic 100% Skolemization 100% Backtracking 100% Proof Search 20% First-order 20% Taming Differentiable Logics with Coq FormalisationAffeldt, R., Bruni, A., Komendantskaya, E., Ślusarz, N. & Stark, K., 21 Mar 2024.Research output: Contribution to conference - NOT published in proceeding or journal › Paper › Research Open Access Formalization 100% Learning System 100% Machine Learning 80% Programming Language 40% Soundness 40% Extended Formal Analysis of the EDHOC Protocol in TamarinBruni, A., Normann, K. & Sundararajan, V., 2023, Extended Formal Analysis of the EDHOC Protocol in Tamarin.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review File Formal Analysis 100% Tamarin 100% EDHOC 100% Key Establishment 100% Internet-Of-Things 66% View all 17 research outputs Projects Projects per year 2016 2020 2023 2024 2027 3 Active 7 Finished Projects per year Robust AI Algorithms for Network Traffic AnalysisBruni, A. (PI)Nationalt Forsvarsteknologisk Center01/11/2024 → 31/10/2026Project: Research Learning System 100% Artificial Intelligence 100% Network Security 100% Machine Learning 100% Network Traffic Analysis 100% GAINER: GrAdual sessIoN typEs for pRivacyCarbone, M. (PI), Bruni, A. (CoI) & Ørup Kristensen, E. (CoI)Meta02/01/2023 → 31/05/2024Project: Other Software Developers 100% Multiple Nodes 100% Information Flow 100% Gradual Types 100% Code Level 100% Cyberskills: Youth Community in CybersecurityBruni, A. (PI), Barkhuus, L. (CoI), Schürmann, C. (CoI) & Balle, M. L. (CoI)Industriens Fond01/08/2020 → 31/12/2023Project: Research Target Groups 100% Cybersecurity 100% Industrial Foundations 50% De Danske Cybermesterskaber 2021Bruni, A. (PI)Industriens Fond01/12/2020 → 01/06/2022Project: Research Meta-CLF2: Automated verification of properties of concurrent, distributed and parallel specifications with applications to computer securitySchürmann, C. (PI), Bruni, A. (CoI) & Marin, S. (CoI)Qatar National Research Fond01/03/2016 → 01/03/2019Project: Research View all 10 projects Press/Media Dusørjægeren Albert hackede sig til drømmejob - og vil have beredskabsministeren til at vågne opBruni, A.25/10/20251 Media contributionPress/Media: Press / Media Debat: Danmark skal have et akademi for cybersikkerhedBruni, A.30/09/20251 Media contributionPress/Media: Press / Media Nyt EU-direktiv er godt nyt for vores cyberforsvar og for etiske hackereSchürmann, C. & Bruni, A.05/05/20251 Media contributionPress/Media: Press / Media Børnehave-hackeren endte i retten: Nu kræver eksperter klare rammer for ''venlige hackere”Bruni, A.12/11/20241 Media contributionPress/Media: Press / Media ITU-forskere vil højne sikkerheden i WhatsappCarbone, M. & Bruni, A.02/12/20221 Media contributionPress/Media: Press / Media View all 15 press/media",
  "content_length": 5570,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:48"
}