{
  "name": "Alessandro Moschitti",
  "homepage": "http://disi.unitn.it/moschitti",
  "status": "success",
  "content": "Alessandro Moschitti's Home Page Alessandro Moschitti Information Engineering and Computer Science Department University of Trento moschitti [at] disi.unitn.it My iKernels Group Publications Curriculum SVM-Light-TK Corpora Teaching Contacts Main Links - iKernels - Research Program: Deep and Structured Machine Learning - DISI Bios Alessandro Moschitti is a professor of the CS Department of the University of Trento, Italy. He is currently a Principal Research Scientist of the Qatar Computing Research Institute (QCRI), within the Hamad Bin Khalifa University. He obtained his PhD in CS from the University of Rome in 2003. He has worked as (i) an research fellow for the University of Texas at Dallas, (ii) as a visiting professor for the University of Columbia (NY), Colorado and John Hopkins and (iii) as visiting researcher at the IBM Watson Research center (participating at the Jeopardy! Challenge) and at MIT-CSAIL. His expertise concerns theoretical and applied machine learning (ML) in the areas of Natural Language Processing (NLP), Information Retrieval (IR) and Data Mining. He has devised innovative structural kernels and neural networks for advanced syntactic/semantic processing, documented by more than 260 scientific articles published in NLP, IR and ML communities. He has been the General Chair of EMNLP 2014, a PC co-chair of CoNLL 2015, an action editor of TACL, and on the editorial board of MLJ, JAIR and JNLE. He has received four IBM Faculty awards, one Google Faculty award, five best paper awards and the best researcher award from Trento University. He has lead many projects, currently is the PI (QCRI side) of a large collaboration project between MIT CSAIL and QCRI. Research Machine Learning for Natural Language Processing, Information Retrieval and Data Mining The iKernels group led by Prof. Moschitti carries out advanced research on machine learning methods for syntactic and semantic processing of natural language. The group aims at improving the state of the art in Information Search and Retrieval by enriching language models (typically based on bag-of-words) with structural representations and semantics. In the context of natural language, the group owns internationally recognized expertise in the following applications: Question Answering, FrameNet and PropBank Predicate Argument Extraction (Semantic Role Labeling), Relation Extraction, Syntactic and Semantic Parsing, Co-reference resolution, Text Categorization, Textual Entailment Recognition, Word Sense Disambiguation, Entity Recognition and Normalization, Opinion Mining, Speech and Noisy Text Processing, Text Similarity, Summarization and Link Open Data. Regarding Machine Learning, the group has developed new theory and methods for Kernel Machines: Kernel Methods, Structural Kernels, Support Vector Machines, On-line Learning, Structured Output Spaces, Multi-label and Hierarchical Classification and Re-Ranking, and reverse kernel engineering for efficient processing and automatic feature engineering. In the last two years, they have developed breakthrough models for Neural Networks in opinion mining, question answering and named entity recognition. Theory and methods are also applied to broader ICT areas than natural language processing and Information Retrieval, such as Automatic Telecommunication Network Management, Electronic Failure detection, Anomaly Detection, Bioinformatics, Automatic Software Analysis (e.g., code classification). Awards Best Paper Award at CIKM 2015 Best Paper Award at CLIC 2015 IBM Faculty Award 2015 Particularly Deserving Researcher Award 2014, University of Trento IBM Shared University Research (SUR) Award 2013 Google Faculty Award 2011 IBM Faculty Award 2011 Best Machine Learning Student Paper Award of ECML-PKDD 2011 IBM Faculty Award 2010 (Jeopardy! project) Best Paper Award at CICLing 2009 Best Student Paper Award at the AND 2009 Group Awards (selected) Best Systems of the SemEval-2017 Task 3: Community Question Answering (Rank: 1st for English Task A and Rank: 1st for English Task B -- contrastive) Third place  IBM Watson Services Challenge at CLIC-it 2016: Gianni Barlacchi, Alessandro Moschitti, Andrea Mariani, Emanuele Rossinelli: Best systems of the NetCla challenge at ECML 2016: Iryna Haponchyk Best Systems of the SemEval-2016 Task 3: Community Question Answering (Rank: 1st for English Task A and  Rank: 2st for English Task B and Arabic Task D) Europe Google PhD Student Fellowship 2015: Massimo Nicosia in Statistical Natural Language Processing Best system (out of 40) of the SemEval-2015 Task 10: Sentiment Analysis in Twitter Best system of the SemEval-2015 Task 3: Answer Selection in Community Question Answering Rank (Arabic language subtask) Distinguished Young Papers Award 2014 at the Italian Conference on Computational Linguistics Best system of the Partly Sunny with a Chance of Hashtags at Kaggle 2013 Problem: multi-output classification for Twitter Sentiment Analysis. Results: rank 1st out of 259 teams Europe Google PhD Student Fellowship 2013: Aliaksei Severyn (only one in Europe for Machine Learning) IBM PhD Student Fellowship 2013: Apoorv Agarwal Best system of the Senseval-3 2004 task: Automatic labeling of semantic roles Other Awards Selected Past Funded Projects GogNet (RIA) 2015 Hybrid Knowledge Retrieval for Dialog & Question Answering (IBM Faculty Award project 2015) SenTube, Google EMEA, Switzerland, (PI for UNITN) LiMoSINe, European Project, (Partner Coordinator) Deep NLP for Italian, (Project Coordinator) together with FBK and IBM CAS Trento Relational Kernels for deepQA, IBM Watson, NY, US (PI for UNITN) The Jeopardy! Challenge, IBM Watson, NY, US (Co-PI for UNITN) EternalS, European Project (Consortium Coordinator, porject PI) PARLI, Italian PRIN 2008 (PI, Partner Coordinator) LivingKnowledge, European Project (WP leader), UNITN, Italy Mean Time Between Failure, Columbia University, NY, US (Team Leader) Past Academic Support to the Research Community (selected) Meta Area-co-chair of ACL 2017 Area chair of CLIC 2017 Area chair of ICTIR 2017 Organizer of SemEval-2017 Task 3: Community Question Answering Area chair of NAACL 2016 Area chair of CLIC 2016 Senior Committee of IJCAI 2016 Organizer of SemEval-2016 Task 3: Community Question Answering PC co-Chair of CoNLL 2015 Area co-Chair (semantics) for *SEM 2015 Organizer of SemEval-2015 Task 3: Answer Selection in Community Question Answering General Chair of EMNLP 2014 Area co-Chair for Semantics and Knowledge Acquisition of CLIC 2014 Sponsorship co-Chair for (E)ACL 2014 Conferences co-Chair for the workshop Semantic Matching in IR at SIGIR 2014 Area co-Chair (semantics) of ACL 2013 Area Chair (Semantic Processing) of IJCNLP 2013 Senior PC member IJCAI 2013 Area Chair for ECML-PKDD 2012 Co-chair of the CoNLL-shared task 2012 Tutorial Co-chair for ECML PKDD 2012 Workshop Co-chair for EACL 2012 Special Issue for JNLE 2012: Statistical Learning of Natural Language Structured I/O Co-Chair for Machine Learning Area of ACL 2011 Invited Talk at the workshop on DDR-2011: Diversity in Document Retrieval PC committees: too many to be listed (see my Curriculum) News/Current Activities Senior PC member WWW 2018 Senior PC member AAAI 2018 Editorial Boards Journal of Natural Language Engineering (since 2013) Journal of Artificial Intelligence Research (since 2012) Journal of Data Semantics (since 2011) SIGIR 2013 Kernel-based Learning to Rank with Syntactic and Semantic Structures Slides ACL 2012: State-of-the-Art Kernels for Natural Language Processing Slides Coling 2010 Kernel Engineering for Fast and Easy Design of Natural Language Applications Slides Interspeech 2010: Kernel Engineering for Fast and Easy Design of Natural Language Applications Slides ACL Workshops Co-Chair of TextGraphs-6: Graph-based Methods for NLP (ACL-NAACL 2011) Co-Chair of TextGraphs-5: Graph-based Methods for NLP (ACL 2010) Co-Chair of Learning Structured Information in Natural Language Applications (EACL 2006) workshops Web Question Answering, Beyond Factoids 2016 Semantic Matching in IR 2014 EternalS Workshops Co-Chair of 3rd International Workshop on Eternal Systems 2013 (EternalS'13) Co-Chiar of 2nd International Workshop on Eternal Systems: JIMSE'12 (EternalS'12) Co-Chair of 1st International Workshop on Eternal Systems (EternalS'11) Chair of EternalS Track at ISoLA (International Symposium on Leveraging Applications of Formal Methods 2010) John Hopkins Summer Workshop (JHU 2007) Automatic Text Categorization: from Information Retrieval to Support Vector Learning A didactic book introducing Support Vector Machines and Text Categorization",
  "content_length": 8634,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:53"
}