{
  "name": "Alessio Malizia",
  "homepage": "https://alessiomalizia.wordpress.com",
  "status": "success",
  "content": "Alessio Malizia I am full Professor at the Computer Science Department, University of Pisa, Italy. I lived in London but I am a “global soul” and have been living in Italy, Spain and US. I am the son of a blacksmith, but thereafter all pretensions of manual skills end. I began my career as a bearded computer scientist at Sapienza – University of Rome and then, after an industrial experience in IBM and Silicon Graphics, moved on with my career in research. I was visiting researcher at the Xerox PARC where I was appreciated for my skills in neural networks (Multilayer Perceptrons) and as peanut butter and chocolate biscuits eater. I worked as associate professor (and Spanish tapas aficionado) at the University Carlos III of Madrid. I was senior lecturer at Brunel University London for five years where I was teaching and playing videogames. From 2017 I joined the University of Hertfordshire.as Professor of User Experience Design  and distinguished speaker of the ACM (the international Association for Computer Machinery); My research and teaching interests focus on Human-Centred Systems. I am interested in Human-Centred AI and Design Fictions. In my role at University of Pisa, I am keen to develop novel approaches and attract funding for improve scientific methods to study Human-Artificial Intelligence Interaction. Search for: About Me Alessio Malizia is Professor of User Experience Design at University of Hertfordshire. UK. He is interested in Human-Computer Interaction, Ubiquitous Computing, and Social Networks – in short: Human-Centered Systems Archives November 2016 April 2016 March 2016 February 2016 January 2016 December 2015 November 2015 October 2015 September 2015 August 2015 July 2015 June 2015 May 2015 April 2015 March 2015 January 2015 December 2014 November 2014 October 2014 September 2014 July 2014 June 2014 May 2014 April 2014 March 2014 November 2013 October 2013 September 2013 August 2013 July 2013 June 2013 May 2013 April 2013 March 2013 February 2013 January 2013 December 2012 November 2012 October 2012 September 2012 August 2012 July 2012 Categories creativity design education engineering Gadgets games games theory Google human-computer interaction internet jobs marketing Science social social networks software Uncategorized University Unix Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy Subscribe Subscribed Alessio Malizia Join 110 other subscribers Sign me up Already have a WordPress.com account? Log in now. Alessio Malizia Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Design a site like this with WordPress.comGet started",
  "content_length": 2799,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:03"
}