{
  "name": "Alessandro Orso",
  "homepage": "https://engineering.uga.edu/team_member/alex-orso",
  "status": "success",
  "content": "Alessandro (Alex) Orso, Ph.D. - College of Engineering SearchSubmitVisit UsDirectory Menu DirectoryHome>About>Directory>Alessandro (Alex) Orso, Ph.D.Alessandro (Alex) Orso, Ph.D. Dean and Professor [email protected] 0130B Paul D. Coverdell Center 500 D.W. Brooks Drive Athens, GA 30602 United StatesAlessandro (Alex) Orso was appointed dean of the University of Georgia College of Engineering in 2025. Prior to UGA, Orso served as a professor in the College of Computing at the Georgia Institute of Technology and as director of Georgia Tech’s Scientific Software Engineering Center. He previously served as associate dean for off-campus and special initiatives in the College of Computing at Georgia Tech from 2020 to 2025 and was interim dean of the college during the 2023­-2024 academic year.An expert in software engineering, Orso’s research focuses on software testing, program analysis, and debugging. His work includes the development of techniques for improving software reliability, security and trustworthiness and the validation of those techniques on real-world systems. His research has attracted funding from a variety of government agencies and industry partners, including Google, IBM and Microsoft. In 2021, Orso was instrumental in securing $11 million in philanthropic funding from Schmidt Futures to establish the Scientific Software Engineering Center at Georgia Tech. He serves as the inaugural director of the center, which is developing new methodologies to improve scientific software and train a new generation of software engineers.Orso is a distinguished member of the Association for Computing Machinery and a fellow of the Institute of Electrical and Electronics Engineers. Beyond his research, Orso has demonstrated a commitment to exceptional instruction and innovation in the classroom. He was an early advocate of Georgia Tech’s Online Master of Science in Computer Science program, and he continues to teach a virtual software engineering course he created in 2014, when the program launched.Orso earned his doctorate in computer science and his master’s and bachelor’s degrees in electrical engineering from Politecnico di Milano in Italy.EducationPh.D. Computer Science | Politecnico di Milano, Italy | 1999M.S. and B.S. Electrical Engineering (I.T.) | Politecnico di Milano, Italy | 1995Areas of ExpertiseArea of research is software engineering, with emphasis on software testing and program analysis. Interests include the development of techniques for improving software reliability, security, and trustworthiness, and the validation of such techniques on real-world systems.PublicationsGoogle Scholar [email protected] 0130B Paul D. Coverdell Center 500 D.W. Brooks Drive Athens, GA 30602 United StatesJoin a cutting-edge engineering program at a time-honored universityApply Today Make A Gift Driftmier Engineering Center 597 DW Brooks Drive Athens, GA 30602 [email protected] 706‑542‑3000Column AAboutAlumni & GivingContactCorporate EngagementDegrees & ProgramsOur PeopleColumn BProspective StudentsResearchSchoolsStudentsSubmit a Student Complaint",
  "content_length": 3093,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:52"
}