{
  "name": "Alessandra Cavarra",
  "homepage": "http://www.cs.ox.ac.uk/people/alessandra.cavarra",
  "status": "success",
  "content": "Alessandra Cavarra | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleAlessandra CavarraAlessandra CavarraProfessor Alessandra Cavarra Director of Graduates Studies for Professional ProgrammesAssociate Professor of Computer ScienceSupernumerary Fellow, Kellogg CollegeThemes:Computational Biology and Health InformaticsInterestsHer main research interests reflect her teaching activity. In the past, she has produced a formal semantics to most of UML behavioral diagrams, built a tool to symbolically execute UML models, and forward engineer UML models into formal specifications. She is also involved in model-based testing, i.e. the definition of methods and tools to derive automatically test cases from models depicting important aspects of the system under test. In general, Alessandra is interested in formal methods and the integration of formal and semi-formal languages. She is a member of the Abstract State Machines (ASM) community.BiographyAlessandra Cavarra is a University Lecturer in Software Engineering. She obtained a MSc and PhD in Computer Science at the University of Catania (Italy) spending periods as a visiting researcher in the United States and Germany. She then moved to Oxford as a research fellow working in the EU funded project AGEDIS. Currently, Alessandra teaches two post-graduate courses: Object Oriented Design and Software Testing.Selected PublicationsView AllManage publications A data−flow approach to test multi−agent ASMs Alessandra Cavarra In Formal Asp. Comput.. Vol. 23. No. 1. Pages 21−41. 2011. Details about A data−flow approach to test multi−agent ASMs | BibTeX data for A data−flow approach to test multi−agent ASMs | DOI (10.1007/s00165-009-0134-7) Formal and Model−Based Testing of Concurrent Workflows Chen−Wei Wang‚ Alessandra Cavarra and Jim Davies In Manuel Núñez‚ Robert M. Hierons and Mercedes G. Merayo, editors, Proceedings of the 11th International Conference on Quality Software‚ QSIC 2011‚ Madrid‚ Spain‚ July 13−14‚ 2011. Pages 252−259. IEEE Computer Society. 2011. Details about Formal and Model−Based Testing of Concurrent Workflows | BibTeX data for Formal and Model−Based Testing of Concurrent Workflows Proceedings of the 11th International Conference on Quality Software‚ QSIC 2011‚ Madrid‚ Spain‚ July 13−14‚ 2011 Manuel Núñez‚ Robert M. Hierons and Mercedes G. Merayo, editors Details about Proceedings of the 11th International Conference on Quality Software‚ QSIC 2011‚ Madrid‚ Spain‚ July 13−14‚ 2011 | BibTeX data for Proceedings of the 11th International Conference on Quality Software‚ QSIC 2011‚ Madrid‚ Spain‚ July 13−14‚ 2011 ActivitiesSoftware Engineering Past Student Aadya ShuklaAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 2954,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:43"
}