{
  "name": "Alessandro Gianola",
  "homepage": "https://arsr.inesc-id.pt/~agianola",
  "status": "success",
  "content": "Alessandro Gianola Alessandro Gianola Alessandro Gianola is a Tenure-Track Auxiliary Professor (Professor Auxiliar) at the Departamento de Engenharia Informática at Instituto Superior Técnico, Universidade de Lisboa (Lisbon, Portugal), and Senior Researcher at INESC-ID. He holds a PhD in Computer Science, earned cum laude at the Free University of Bozen-Bolzano. He works on Business Process Management (BPM), formal methods and AI: specifically, his research focuses on AI techniques and formal methods for the verification and analysis of complex processes with data, and on multi-perspective process mining. He has co-authored more than 50 refereed publications, including articles in top-rated journals like Information Systems, the Journal of Automated Reasoning and Engineering Applications of Artificial Intelligence, and papers at premier conferences such as AAAI, IJCAI, BPM, IJCAR, ECAI, CAiSE and CADE. He published a Springer Nature monograph titled ‘Verification of Data-Aware Processes via Satisfiability Modulo Theories’. His PhD dissertation won three prestigious awards: the 2022 Best Italian PhD Thesis in Theoretical Computer Science Award, the 2022 Best BPM Dissertation Award, and the 2023 CADE Bill McCune PhD Award in Automated Reasoning. Two papers that he co-authored won the Best Paper Award (PRIMA 2020 and BPM 2021) He was/is member of the Program Committee of BPM 2023, ECAI 2023, KR 2023, IJCAI 2023, AAAI 2024, ECAI 2024, IJCAI 2024, ICPM 2024, BPM 2024, AAAI 2025, CAiSE 2025, BPM 2025, and IJCAI 2025. He was/is PC co-chair of EDOC 2025, workshops co-chair of FLoC 2026, Proceedings co-chair of ECAI 2025, co-chair of the CBI/EDOC Forum 2024, and co-chair of the FM-BPM 2023, FM-BPM 2024 and FM-BPM 2025 workshops (co-located with the International BPM conference). He has been Principal Investigator (PI) of two projects: the FCT project OptiGov (125k euros) and the INESC-ID eProcess (bilateral project with Link Consulting, 80k euros). Main Research Areas Formal Verification, BPM, Automated Reasoning, Process Mining, Computational Logic, Model Checking, Artificial Intelligence, Mathematical Logic, Theoretical Computer Science Contact Information Emails: alessandro.gianola at tecnico.ulisboa.pt - alessandro.gianola at inesc-id.pt https://dblp.org/pers/hd/g/Gianola:Alessandro Curriculum Vitae (06/07/2025): CV Alessandro Gianola Tenure-Track Auxiliary Professor Instituto Superior Técnico Universidade de Lisboa Lisbon, Portugal alessandro.gianola at tecnico.ulisboa.pt Senior Researcher ARSR Research Group INESC-ID Lisbon, Portugal alessandro.gianola at inesc-id.pt Google Scholar dblp Twitter LinkedIn Research My scientific interests mainly involve formal methods and Business Process Management (BPM): specifically, my research activity focuses on process mining and on theoretical and methodological aspects of logic and formal methods for the verification of complex (business) processes with data. Awards ECAI 2024 Outstanding PC Award: I was awarded the ECAI 2024 Outstanding PC Member Award, which honors 2-3% of the PC members for their important and outstanding service to the community (https://www.ecai2024.eu/awards/outstanding-pc-member-awards). 2024 INESC-ID Best Young Researcher: I was the winner of the 2024 INESC-ID Best Young Researcher, given by INESC-ID to the best researcher of the institution among the researchers who completed their PhD within the past six years (https://www.inesc-id.pt/inesc-lisboa-second-meeting-a-day-of-reflection-recognition-and-future-directions-in-research/). 2023 CADE Bill McCune PhD Award in Automated Reasoning: I was the winner of the 2023 CADE Bill McCune PhD Award in Automated Reasoning, given by CADE Inc. for substantive contributions to the field of Automated Reasoning (https://cadeinc.org/McCune-Award). 2022 Best BPM Dissertation award: I was the winner of the 2022 Best BPM Dissertation award, given by the BPM Association at the 20th International Conference on Business Process Management (BPM 2022). 2022 Best Italian PhD Thesis in Theoretical Computer Science award: I was recipient of the 2022 Best Italian PhD Thesis in Theoretical Computer Science award, given by the Italian Chapter of the European Association for Theoretical Computer Science (EATCS), presented at ICTCS 2022. Best Paper Award at the 19th International Conference on Business Process Management (BPM 2021), for the paper titled ‘CoCoMoT: Conformance Checking of Multi-perspective Processes via SMT’, co-authored with Paolo Felli, Marco Montali, Andrey Rivkin and Sarah Winkler. (link to the paper). Best Paper Award at the 23nd International Conference on Principles and Practice of Multi-Agent Systems (PRIMA 2020), for the paper titled ‘A SMT-based Implementation for Safety Checking of Parameterized Multi-Agent Systems’, co-authored with Paolo Felli and Marco Montali. (link to the paper). 2019 Woody Bledsoe Award: I was one of the recipients of the 2019 Woody Bledsoe Award given at the 27th International Conference on Automated Deduction (CADE-27), which is a travel grant that supports students who obtained outstanding achievements in automated reasoning. Research Groups Since July 2024, I have been a member of ELLIS (the European Laboratory for Learning and Intelligent Systems), a pan-European AI network of excellence which focuses on fundamental science, technical innovation and societal impact, builds upon machine learning as the driver for modern AI and aims to secure Europe’s sovereignty in this competitive field by creating a multi-centric AI research laboratory. I am also a member of LUMLIS, the ELLIS Lisbon Unit. Since September 2023, I have been a member of the Automated Reasoning and Software Reliability (ARSR)  research group at INESC-ID (Lisbon, Portugal), which mission is to enable and support the construction of reliable and dependable software systems with a focus on producing machine-assisted methods to improve the quality and dependability of computer systems. Since 2022, I have been a member of the OVERLAY research group on Formal Methods for AI, which fosters collaboration among a diverse team of Formal Methods and AI researchers, aiming at pursuing multidisciplinary research at the border of the two fields. From November 2017 to September 2023, I was a member of the KRDB Research Centre for Knowledge and Data at the Faculty of Computer Science of the Free University of Bozen-Bolzano, Italy. Talks Invited Talks Invited Talk at iPRA 2022, a FLoC 2022 workshop, Haifa, Israel. August 2022. Presentations of Accepted Papers at International Conferences and Workshops 32nd International Joint Conference on Artificial Intelligence (IJCAI 2023), Macao, SAR. August 2023. 4th Workshop on Artificial Intelligence and Formal Verification, Logic, Automata, and Synthesis (OVERLAY 2022), Udine, Italy. November 2021. 10th International Conference on Topology, Algebra and Categories in Logic (TACL 2022), Coimbra, Portugal. June 2022. 3rd Workshop on Artificial Intelligence and Formal Verification, Logic, Automata, and Synthesis (OVERLAY 2021), Padova, Italy. September 2021. 24th International Conference on Foundations of Software Science and Computation Structures (FoSSaCS 2021), Online. March 2021. 10th International Joint Conference on Automated Reasoning (IJCAR 2020), Online. July 2020. 35th Italian Conference on Computational Logic (CILC 2020), Rende, Italy. October 2020. 27th International Conference on Automated Deduction (CADE 27), Natal, Brazil. August 2019. 2nd International ARCADE (Automated Reasoning: Challenges, Applications, Directions, Exemplary Achievements) Workshop, Natal, Brazil. August 2019. 34th Italian Conference on Computational Logic (CILC 2019), Trieste, Italy. June 2019. 33rd Italian Conference on Computational Logic (CILC 2018), Bolzano, Italy. September 2018. Chair of International Conferences and Workshops PC Co-chair of EDOC 2025, located in Lisbon, Portugal. Workshops Co-chair of the 9th Federated Logic Conference (FLoC 2026), located in Lisbon, Portugal. Proceedings Co-chair of the 28th European Conference on Artificial Intelligence (ECAI 2025), located in Bologna, Italy. Co-chair of the CBI/EDOC 2024 Forum Track, co-located with the BI Week 2024 in Vienna. Publicity Co-Chair of the 23rd International Conference of the Italian Association for Artificial Intelligence (AIxIA 2024), located in Bolzano, Italy. Co-chair of the 2nd International Workshop on Formal Methods for Business Process Management (FM-BPM 2024), co-located with BPM 2024. Co-chair of the 1st International Workshop on Formal Methods for Business Process Management (FM-BPM 2023), co-located with BPM 2023. Co-chair of the 5th Workshop on Artificial Intelligence and fOrmal VERification, Logic, Automata, and sYnthesis OVERLAY (part of AIxIA 2023). Program Committees Member of the Program Committee of the 19th European Conference on Logics in Artificial Intelligence (JELIA 2025). Member of the Program Committee of the 22nd International Conference on Principles of Knowledge Representation and Reasoning (KR 2025). Member of the Program Committee of the 30th International Conference on Automated Deducation (CADE 2025). Member of the Program Committee of the 28th European Conference on Artificial Intelligence (ECAI 2025). Member of the Program Committee of the 7th International Joint Conference on Process Mining (ICPM 2025). Member of the Program Committee of the 34th International Joint Conference on Artificial Intelligence (IJCAI 2025). Member of the Program Committee of the 23rd International Conference on Business Process Management (BPM 2025). Member of the Program Committee of the 37th International Conference on Advanced Information Systems Engineering (CAiSE 2025). Member of the Program Committee of the 39th Annual AAAI Conference on Artificial Intelligence (AAAI 2025). Member of the Program Committee of the 22nd International Conference on Business Process Management (BPM 2024). Member of the Program Committee ",
  "content_length": 22763,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:50"
}