{
  "name": "Alexandre Cabral Mota",
  "homepage": "http://www.cin.ufpe.br/~acm",
  "status": "success",
  "content": "Alexandre Mota - Professor e Pesquisador Integrando Pesquisa Avançada e Inovação Industrial Combinando excelência técnica e liderança em projetos multidisciplinares de impacto Sobre Mim Alexandre Mota é bolsista de produtividade em Pesquisa (PQ-2/C) do CNPq desde 2018, e foi bolsista de produtividade em Desenvolvimento Tecnológico (DT-2) do CNPq entre 2011 e 2018. Com expertise em Métodos Formais (Matemática aplicada ao desenvolvimento de Sistemas), possui Pós-Doutorado Empresarial pela Lindy Labs, onde atuou em verificação formal de contratos inteligentes em Solidity. Sua trajetória é marcada pela integração de PD&I (Pesquisa, Desenvolvimento e Inovação), conectando pesquisa avançada com demandas do setor produtivo através de parcerias estratégicas entre universidade e indústria. Destaques Acadêmicos Bolsista CNPq PQ-2/C (Produtividade em Pesquisa) Ex-bolsista CNPq DT-2 (Produtividade em Desenvolvimento Tecnológico) Pós-Doutorado Empresarial - Lindy Labs Especialista em Verificação Formal de Contratos Inteligentes (Solidity) Áreas de Expertise Métodos Formais Aplicação de técnicas matemáticas rigorosas para especificação, desenvolvimento e verificação de sistemas computacionais. Matemática Aplicada Desenvolvimento de sistemas com fundamentação matemática rigorosa, garantindo confiabilidade e correção. Contratos Inteligentes Verificação formal de contratos inteligentes em Solidity, garantindo segurança e funcionalidade em blockchain. IA Responsável Desenvolvimento de Inteligência Artificial e Robótica com princípios éticos e responsabilidade social. PD&I Integração de Pesquisa, Desenvolvimento e Inovação, conectando academia e indústria. Liderança Coordenação de projetos multidisciplinares e parcerias estratégicas universidade-indústria. Projetos e Parcerias Estratégicas M Motorola 2004-2008 e 2015-presente Parceria em projetos de software services e product test, com coordenação de inovação e pesquisa. C COMPASS 2011 e 2014 Comprehensive Modelling for Advanced Systems of Systems, com foco em modelagem avançada de sistemas. E Embraer 2006-2016 Colaboração em projetos de grande relevância na área de desenvolvimento de sistemas. Liderança e Coordenação Posições de Liderança Coordenador do CRIAR Centro de Inovação em Robótica e Inteligência Artificial Responsável Vice-coordenador Convênio CIn-Motorola (Software Services) Coordenador de Inovação e Pesquisa Convênios CIn-Motorola (Software Services e Product Test) CRIAR Centro de Inovação em Robótica e Inteligência Artificial Responsável O CRIAR é um centro dedicado ao desenvolvimento de tecnologias avançadas em robótica e inteligência artificial, com foco na responsabilidade ética e social dessas inovações. Como coordenador, Alexandre Mota lidera iniciativas que integram pesquisa acadêmica de ponta com aplicações industriais relevantes, promovendo a inovação responsável e o desenvolvimento tecnológico sustentável. Publicações e Pesquisa Minhas publicações e detalhes de pesquisa podem ser encontrados no meu perfil Lattes. Acessar Lattes Contato Informações de Contato acm@cin.ufpe.br",
  "content_length": 3196,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:52"
}