{
  "name": "Alexander L. Wijesinha",
  "homepage": "https://www.towson.edu/fcsm/departments/computerinfosci/facultystaff/awijesinha.html",
  "status": "success",
  "content": "Alexander Wijesinha | Towson University Skip to Main Content Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Give to TU Calendars & Events Directories SearchSearch Towson University Visit TU Apply Now Request Information Facts & Figures Mission & Strategic Plan Rankings & Achievements Administration Commitment to Diversity & Inclusion Accessibility Sustainability Consumer Information & Accreditation Visit TU Apply Now Request Information Undergraduate Studies Graduate Studies Accelerated Programs Research International Initiatives Colleges & Departments Off-Campus Locations Extended & Professional Education Summer Session Academic Services & Resources Commencement Visit TU Apply Now Request Information Undergraduate Admissions Graduate Admissions Tuition & Expenses Financial Aid Counselor & Advisor Resources Visit Campus Apply Now Request Information Visit TU Apply Now Request Information Student Involvement Housing & Dining Student Services & Resources Health & Well-being Safety & Security New Student & Family Programs Visit TU Apply Now Request Information Anchor Mission BTU-Partnerships for Greater Baltimore Business & Public Engagement Community Programs & Resources Arts & Culture Campus Landmarks & Features Planning Events & Conferences at TU Towson University SearchSearch Menu SearchSearch Go Back About TU Academics Admissions & Aid Student Life Campus & Community Information For Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Visit TUApply NowRequest Information Give to TU Calendars & Events Directories Alexander Wijesinha Professor Contact Info Phone: 410-704-4660 Office: YR-436 Email: awijesinha@towson.edu Education Ph.D., Computer Science, University of Maryland Baltimore County \t\t\tM.S., Computer Science, University of Florida Areas of Expertise Computer Networks including Wireless Networks, Network Security and Network Performance, and Network Aspects of Bare Machine Computing Professional Service: TPC member for several conferences; editorial board for IARIA journal Selected Publications and Presentations: Journals B. Rawal, R. Karne, A. Wijesinha, P. Appiah-Kubi, and S. Liang, Applications of the Split Protocol Paradigm, International Journal of Computers and Their Applications, vol. 21, No. 2, June 2014, pp. 83-94. A. Tsetse, A. Wijesinha, R. Karne, A. Loukili, and P. Appiah-Kubi, An Experimental Evaluation of IPv4-IPv6 IVI Translation, Applied Computing Review, March 2013, Vol. 13, No. 1, pp. 19-27. R. Yasinovskyy, A. Alexander, A. Wijesinha, and R. Karne, Bare PC SIP User Agent Implementation and Performance for Secure VoIP, International Journal on Advances in Telecommunications, vol. 5, No. 3 & 4, 2012, pp. 111-119. R. Yasinovskyy, A. L. Wijesinha, and R. Karne, VoIP Performance with IPsec in IPv4-IPv6 Transition Networks, Infocommunications Journal, Special Issue on Novel Solutions for Next Generation Services, vol. LXV, no. III, 2010. A. L. Wijesinha, S. Kumar, and D. Sidhu, Handover and New Call Blocking Performance with Dynamic Single Channel Assignment in a Linear Cellular Array, Wireless Networks Journal, vol. 6, no. 2, 2000. Conferences W. Agosto-Padilla, R. Karne, A. Wijesinha, Insights into Transforming a Linux Wireless Device Driver to Run on a Bare Machine, 10th International Conference on Evaluation of Novel Software Approaches to Software Engineering (ENASE) 2015. A. Peter, R. K. Karne, A. L. Wijesinha, and P. Appiah-Kubi, Transforming a Bare PC Application to Run on an ARM Device, IEEE Southeastcon Conference, 2013. A. K. Tsetse, A. L. Wijesinha, R. K. Karne, and A. Loukili, Measuring the IPv4-IPv6 IVI Translation Overhead, ACM Research in Applied Computation Symposium (RACS) 2012. A. Loukili, A. L. Wijesinha, R. K. Karne, and A. K. Tsetse, TCP's Retransmission Timer and the Minimum RTO, 21st International Conference on Computer Communications and Networks (ICCCN), 2012. U. Okafor, R. K. Karne, A. L. Wijesinha, and B. Rawal, Transforming SQLITE to Run on a Bare PC, 7th International Conference on Software Paradigm Trends (ICSOFT), 2012. B. Rawal, R. K. Karne, and A. L. Wijesinha. Mini Web Server Clusters for HTTP Request Splitting, IEEE International Conference on High Performance Computing and Communications (HPCC), 2011. B. Rawal, R. Karne, and A. L. Wijesinha, Splitting HTTP Requests on Two Servers, 3rd International Conference on Communication Systems and Networks (COMSNETS), 2011. P. Appiah-Kubi, R. K. Karne, and A. L. Wijesinha, The Design and Performance of a Bare PC Webmail Server, 12th IEEE International Conference on High Performance Computing and Communications (HPCC), 2010. N. Kazemi, A. L. Wijesinha, and R. Karne, Design and Implementation of IPsec on a Bare PC, 2nd International Conference on Computer Science & its Applications (CSA), 2009. A. Alexander, A. L. Wijesinha, and R. Karne, An Evaluation of Secure Real-Time Protocol (SRTP) Performance for VoIP, 3rd International Conference on Network and System Security (NSS), 2009. G. Ford, R. Karne, A. L. Wijesinha, and P. Appiah-Kubi, The Design and Implementation of a Bare PC Email Server, 33rd Annual IEEE International Computer Software and Applications Conference (COMPSAC), 2009. R. Yasinovskyy, A. L. Wijesinha, R. Karne, and G. Khaksari, Comparison of VoIP Performance on IPv6 and IPv4 Networks, The 7th ACS/IEEE International Conference on Computer Systems and Applications (AICCSA), 2009. L. He, R. Karne, A. L. Wijesinha, and A. Emdadi, A Study of Bare PC Web Server Performance for Workloads with Dynamic and Static Content, 11th IEEE International Conference on High Performance Computing and Communications (HPCC), 2009. G. H. Khaksari, A. L.Wijesinha, R. K. Karne, L. He, and S. Girumala, A Peer-to-Peer Bare PC VoIP Application, 4th IEEE Consumer Communications and Networking Conference (CCNC), 2007. A. L. Wijesinha, Y. Song, M. Krishnan, V. Mathur, J. Ahn, and V. Shyamasundar Throughput Measurement for UDP Traffic in an IEEE 802.11g WLAN, 6th ACIS International Conference on Software Engineering, Artificial Intelligence, Networking and Parallel/Distributed Computing (SNPD), 2005. Memberships / Affiliations: ACM, IEEE Service: Doctoral Program Committee, FCSM DAC Direct Edit JS for Moving Direct Edit Button into place.",
  "content_length": 7856,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:28"
}