{
  "name": "Alexis Palmer",
  "homepage": "https://www.colorado.edu/cs/alexis-palmer",
  "status": "success",
  "content": "Alexis Palmer | Computer Science | University of Colorado Boulder Skip to main content Computer ScienceHomeAcademicsResearchPeopleNews & EventsAdmissionsInclusionTranslateEnglishSpanishChineseFrenchGermanKoreanLaoNepaliJapaneseTibetanSearchEnter the terms you wish to search for.This siteAll of Colorado.eduOther ways to search:Events CalendarCampus MapStudentsEngage with UsFaculty/Staff ResourcesAboutAdmissionsContact UsJobsFunding OpportunitiesMS-CS + MS-AI Required Notification and SARAAccreditationStrategic VisionAlexis PalmerAssistant ProfessorLINGUISTICS alexis.palmer@colorado.edu 303-735-0418AddressOffice: LBB 128Dr. Palmer is an expert in computational discourse and semantics; computational linguistics for low-resource languages and language documentation; discourse structure and coherence, and modes of discourse and social analytics, including automated detection of offensive language in social media. She received her PhD from UT Austin in 2009, has held a number of prestigious post docs and research positions in Germany (including positions at the Institute for Computational Linguistics in Heidelberg and the Institut für Deutsche Sprache in Mannheim). Until her move to CU in 2021, she was an assistant professor at the University of North Texas, Denton. Dr. Palmer brings a prestigious National Science Foundation CAREER grant with her to CU. In this project, she is working on cross-linguistic methods for better development of language processing tools for low-resource languages. The project is called FOLTA (From One Language to Another). She has also recently become interested in the question of how we can make the outcomes of linguistic documentation more useable and accessible, particularly to support development of pedagogical materials for a language.",
  "content_length": 1791,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:07"
}