{
  "name": "Alexander Tong 0001",
  "homepage": "https://www.alextong.net",
  "status": "success",
  "content": "Alex TongSearchAlex TongPrincipal InvestigatorAithyraAbout MeI am a principal investigator at Aithyra in Vienna, Austria. Aithyra is a new research institute at the intersection of machine learning and life sciences led by Michael Bronstein and funded by the Boehringer Ingelheim Foundation. If you’re interested in Phd, Postdoc, or Visiting researcher positions please feel free to reach out via email! For Phd applications please apply here before Sept 10.Previously, I was briefly an assistant professor at Duke University. Before that I did my postdoc with Yoshua Bengio working on efficient machine learning algorithms with applications to cell and molecular biology at Mila in Montreal. I completed my PhD in the computer science department at Yale University in 2021 where I was advised by Smita Krishnaswamy. My dissertation can be found here. My research interests are in generative modeling, deep learning, and optimal transport. I’m working on applying ideas from generative modeling, causal discovery, optimal transport, and graph signal processing to understand how cells develop and respond to changing conditions. I’m also interested in generative models for protein design and cofounded Dreamfold to work on these problems.I grew up in Seattle and graduated from Tufts University in 2017 with a BS and MS in computer science. Outside of work, I love sailing and running. I am the 2019 junior North American champion in the 505 class, and I recently ran my first 50 mile race the Vermont 50!Recent NewsExcited to join Aithyra as a principal investigator in September 2025. If you’re interested in Phd, Postdoc, or Visiting positions please feel free to reach out via email!Congrats to Danyal Rehman and collaborators for winning the Best Paper Award at the Gen Bio workshop at ICML 2025 for our work on forward only regression training of normalizing flows FORT.Join us at the second edition of the Frontiers in Probabilistic Inference: Sampling meets Learning workshop at NeurIPS 2025 in San Diego.Started as an assistant professor at Duke University.Two papers accepted to ICML 2025. Checkout our work on Feynmann-Kac steering of diffusion models (spotlight) and Scaling Boltzmann Generators as well as newer workshop papers such as FORT, PITA and other works coming soon.Congrats to Fred Zhangzhi Peng and collaborators for winning an outstanding paper award at the DELTA workshop at ICLR 2025 for our work on improved sampling from masked diffusion models in P2.Four papers accepted to ICLR 2025. Checkout our work on steering masked and continuous diffusion and our work on flow matching in cells with greater realism in CFGen and transferrability in Meta FM.Join us at our workshop Frontiers in Probabilistic Inference: Sampling meets Learning at ICLR 2025 in Singapore.Presenting a tutorial on Geometric Generative Models with Heli Ben-Hamu and Joey Bose at the LoG Conference 2024.Visiting the group of Michael Bronstein at Oxford this winter.Three papers accepted to NeurIPS 2024! Awesome work led by Xi (Nicole) Zhang, Yuan Pu, Guillaume Huguet, James Vuckovic, and Kacper Kapuśniak.Interests Generative Modeling Flow Models Optimal Transport Protein Design Single Cell DynamicsEducationPostdocMila & University of MontrealPhD in Computer Science, 2021Yale UniversityMPhil in Computer Science, 2020Yale UniversityMS in Computer Science, 2017Tufts UniversityBS in Computer Science, 2017Tufts UniversityFeatured PublicationsAvishek Joey Bose*, Tara Akhound-Sadegh*, Kilian Fatras, Guillaume Huguet, Jarrid Rector-Brooks, Cheng-Hao Liu, Andrei Cristian Nica, Maksym Korablyov, Michael Bronstein, Alex TongJanuary, 2024 In ICLR (Spotlight) ArchivalSE(3)-Stochastic Flow Matching for Protein Backbone GenerationWe present FoldFlow a novel flow matching model for protein design. We present theory and practical tricks for flow models over SE(3)^N. Empirically, we validate these models on protein backbone generation of up to 300 amino acids leading to high-quality designable, diverse, and novel samples.PDF Cite Code MoML Video Logg Video VantAI VideoMaría Ramos Zapatero*, Alex Tong*, Jahangir Sufi, Petra Vlckova, Ferran Cardoso Rodriguez, Callum Nattress, Xiao Qin, Daniel Hochhauser, Smita Krishnaswamy, Christopher J. TapeDecember, 2023 Cell ArchivalTrellis tree-based analysis reveals stromal regulation of patient-derived organoid drug responsesTrellis is a tree-based earth mover’s distance method for understanding estimating treatment effects from single cell data. In this work we apply it to colorectal cancer PDOS and investigate the chemoprotection induced by cancer-associated fibroblasts.PDF Cite DOI code reproducible code Tutorial Cancer Research Spotlight Yale News News-MedicalAlex Tong, Nikolay Malkin, Guillaume Huguet, Yanlei Zhang, Jarrid Rector-Brooks, Kilian Fatras, Guy Wolf, Yoshua BengioFebruary, 2023 In TMLRAlso presented at Frontiers4LCD Workshop @ ICML 2023 ArchivalImproving and Generalizing Flow-Based Generative Models with Minibatch Optimal TransportWe present methods for learning simple flows over R^d with optimal transport conditional flow matching (OT-CFM). Training with this objective leads to imprved results on a variety of conditional and unconditional generation tasks, such as inferring single cell dynamics, unsupervised image translation, and Schrodinger bridge inference.PDF Cite Code VideoPreprints Tara Akhound-Sadegh*, Jungyoon Lee*, Avishek Joey Bose, Valentin De Bortoli, Arnaud Doucet, Michael M. Bronstein, Dominique Beaini, Siamak Ravanbakhsh, Kirill Neklyudov*, Alexander Tong* (2025). Progressive Inference-Time Annealing of Diffusion Models for Sampling from Boltzmann Densities.Cite arXiv URL Jalil Nourisa, Antoine Passemiers, Marco Stock, Berit Zeller-Plumhoff, Robrecht Cannoodt, Christian Arnold, Alex Tong, Jason Hartford, Antonio Scialdone, Yves Moreau, Yang Li, Malte D. Luecken (2025). geneRNIB: a living benchmark for gene regulatory network inference. bioRxiv.PDF Cite DOI Fred Zhangzhi Peng*, Zachary Bezemek*, Sawan Patel, Jarrid Rector-Brooks, Sherwood Yao, Alex Tong*, Pranam Chatterjee* (2025). Path Planning for Masked Diffusion Model Sampling.PDF Cite Code arXiv Trang Nguyen, Alex Tong, Kanika Madan, Yoshua Bengio, Dianbo Liu (2023). Causal Inference in Gene Regulatory Networks with GFlowNet: Towards Scalability in Large Systems. arXiv.PDF Cite Alex Tong*, Manik Kuchroo*, Shabarni Gupta, Aarthi Venkat, Beatriz P. San Juan, Laura Rangel, Brandon Zhu, John G. Lock, Christine L. Chaffer, Smita Krishnaswamy (2023). Learning Transcriptional and Regulatory Dynamics Driving Cancer Cell Plasticity Using Neural ODE-Based Optimal Transport. BioRxiv.PDF Cite DOIPublications Marta Skreta*, Tara Akhound-Sadegh*, Viktor Ohanesian*, Roberto Bondesan, Alán Aspuru-Guzik, Arnaud Doucet, Rob Brekelmans, Alex Tong*, Kirill Neklyudov* (2025). Feynman-Kac Correctors in Diffusion: Annealing, Guidance, and Product of Experts. In ICML (spotlight).PDF Cite Code arXiv Charlie B. Tan*, Avishek Joey Bose*, Chen Lin, Leon Klein, Michael M. Bronstein, Alex Tong (2025). Scalable Equilibrium Sampling with Sequential Boltzmann Generators. In ICML.PDF Cite arXiv Malte Luecken*, Scott Gigante*, Daniel Burkhardt*, Robrecht Cannoodt, Daniel Strobl, Nikolay Markov, Luke Zappia, Giovanni Palla, Wesley Lewis, Daniel Dimitrov, Michael Vinyard, Daniel Magruder, Alma Andersson, Emma Dann, Qian Qin, Dominik Otto, Michal Klein, Olga Botvinnik, Louise Deconinck, Kai Waldrant, Bastian Rieck, Constantin Ahlmann-Eltze, Eduardo Da Veiga Beltrame, Andrew Benz, Carmen Bravo González-Blas, Ann Chen, Benjamin DeMeo, Can Ergen, Swann Floc'hlay, Adam Gayoso, Stephanie Hicks, Yuge Ji, Vitalii Kleshchevnikov, Gioele La Manno, Maximilian Lombardo, Romain Lopez, Dario Righelli, Hirak Sarkar, Valentine Svensson, Alex Tong, Galen Xing, Chenling Xu, Jonathan Bloom, Angela Pisco, Julio Saez-Rodriguez, Drausin Wulsin, Luca Pinello, Yvan Saeys, Fabian Theis, Smita Krishnaswamy (2025). Defining and Benchmarking Open Problems in Single-Cell Analysis. Nature Biotechnology.Cite DOI URL Jarrid Rector-Brooks, Mohsin Hasan, Zhangzhi Peng, Zachary Quinn, Chenghao Liu, Sarthak Mittal, Nouha Dziri, Michael Bronstein, Yoshua Bengio, Pranam Chatterjee, Alex Tong*, Avishek Joey Bose* (2025). Steering Masked Discrete Diffusion Models via Discrete Denoising Posterior Prediction. In ICLR.Cite arXiv Alessandro Palma, Till Richter, Hanyi Zhang, Manuel Lubetzki, Alex Tong, Andrea Dittadi, Fabian Theis (2025). Generating Multi-Modal and Multi-Attribute Single-Cell Counts with CFGen. In ICLR.Cite arXiv Lazar Atanackovic*, Xi Zhang*, Brandon Amos, Mathieu Blanchette, Leo J. Lee, Yoshua Bengio, Alex Tong, Kirill Neklyudov (2025). Meta Flow Matching: Integrating Vector Fields on the Wasserstein Manifold. In ICLR.Cite arXiv Marta Skreta, Lazar Atanackovic, Avishek Joey Bose, Alex Tong, Kirill Neklyudov (2025). The Superposition of Diffusion Models Using the Itô Density Estimator. In ICLR (spotlight).PDF Cite arXiv Xi Zhang*, Yuan Pu*, Yuki Kawamura, Andrew Loza, Yoshua Bengio, Dennis L. Shung*, Alex Tong* (2024). Trajectory Flow Matching with Applications to Clinical Time Series Modeling. In NeurIPS (Spotlight).PDF Cite Code Guillaume Huguet*, James Vuckovic*, Kilian Fatras, Eric Thibodeau-Laufer, Pablo Lemos, Riashat Islam, Cheng-Hao Liu, Jarrid Rector-Brooks, Tara Akhound-Sadegh, Michael Bronstein, Alex Tong*, Avishek Joey Bose* (2024). Sequence-Augmented SE(3)-Flow Matching For Conditional Protein Backbone Generation. In NeurIPS.PDF Cite Kacper Kapusniak, Peter Potaptchik, Teodora Reu, Leo Zhang, Alex Tong, Michael Bronstein, Avishek Joey Bose, Francesco Di Giovanni (2024). Metric Flow Matching for Smooth Interpolations on the Data Manifold. In NeurIPS.PDF Cite Code Logg Video Tara Akhound-Sadegh*, Jarrid Rector-Brooks*, Avishek Joey Bose*, Sarthak Mittal, Pablo Lemos, Cheng-Hao Liu, Marcin Sendera, Siamak Ravanbakhsh, Gauthier Gidel, Yoshua Bengio, Nikolay Malkin, Alex Tong (2024). Iterated Denoising Energy ",
  "content_length": 19760,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:41"
}