{
  "name": "Alexander Stewart Weddell",
  "homepage": "https://www.ecs.soton.ac.uk/people/asw1v08",
  "status": "success",
  "content": "Doctor Alex Weddell | University of Southampton Skip to main content Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Subjects PhDs and research degrees Create your own research project Find a PhD project Funding your research degree How to apply for a PhD or research degree How to make a PhD enquiry Support while studying your PhD or research degree Exchanges and studying abroad Undergraduate study Undergraduate degree courses Foundation year programmes Undergraduate tuition fees Customise your degree Funding undergraduate studies How to apply Application advice and resources - Tuition fees, funding and scholarships - - Short courses - - Lunchtime evening and weekend courses - - Clearing - - Summer schools - - Get a prospectus Student life Accommodation Choose your halls of residence Your accommodation options Apply for accommodation Our accommodation guarantee Fees and contracts Our cities Southampton Winchester Malaysia Sports and gyms Sports facilities Sports clubs Watersports centres Our campuses Avenue Campus Boldrewood Innovation Campus City Centre Campus Highfield Campus University Hospital Southampton Waterfront Campus Winchester Campus Join our student community What's on Clubs and societies Sports teams SUSU places Representing you SUSU support and advice Support and money Living costs Academic and mental health support Inclusion and respectful behaviour policy Support for disabled students Part-time work Health services Research Our impact Research projects Research areas Research facilities Collaborate with us Institutes, centres and groups Support for researchers Faculties, schools and departments Interdisciplinary research Find people and expertise - Research jobs Business Develop your organisation Access start-up support Invest in our start-ups Become a research partner License our technology Knowledge Transfer Partnerships Hire our facilities Academic consultants Specialist consultancies Research studentships Develop your workforce Continuing professional development Set up a staff secondment Host a placement student Collaborate on a short term student project Advertise graduate jobs and internships Become a supplier - - Find people and expertise Global International students Visiting delegations University of Southampton Delhi International Office Visiting fellowships University of Southampton Malaysia - Partnerships and initiatives Online master's degrees View all staff Dr Alex Weddell MEng, PhD, FHEA, MIEEE Associate Professor Research interests Energy Harvesting Internet of Things Energy Management/Storage More research Accepting applications from PhD students. Connect with Alex Email: asw@ecs.soton.ac.uk Tel: +44 23 8059 9047 Google Scholar ORCID LinkedIn Twitter On this page About Research Publications Biography About Research Publications Biography About Alex Weddell is an Associate Professor in the Smart Electronic Materials and Systems Research Group, in the School of Electronics and Computer Science at the University of Southampton, UK. He is also a member of the management group for the Centre for IoT and Pervasive Systems. His main research interests are in wireless sensing, energy harvesting systems, and intelligent sensing for monitoring the health of machines. He is also Faculty Director of the Graduate School for the Faculty of Engineering and Physical Sciences. Research Research groups Member of: Smart Electronic Materials and Systems Centre for Internet of Things and Pervasive Systems Research interests Energy Harvesting Internet of Things Energy Management/Storage Condition Monitoring System Lifetime Modelling and Extension Research projects Active projects Perfect Recollection for Clearer Insight Researchers: Doctor Alex Weddell Sponsor: EPSRC Completed projects SAFEGUARD –IoT Power Management and Optimisation Researchers: Doctor Alex Weddell Sponsor: Research England Wearable and Autonomous Computing for Future Smart Cities - Platform Grant Researchers: Professor Stephen Beeby Professor Sir Bashir Al-Hashimi , Professor Gopal Ramchurn , Professor Geoff Merrett , Professor Sebastian Stein , Doctor Alex Weddell Sponsor: EPSRC H2020 - EnABLES - European Infrastructure Powering the Internet of Things Researchers: Professor Stephen Beeby Doctor Alex Weddell Sponsor: European Union Publications Impact of dust and tilt angle on the photovoltaic performance in a desert environment Mansour Alzahrani, Tasmiat Rahman, Muhyaddin Rawa & Alex Weddell, 2025, Solar Energy, 288 DOI: 10.1016/j.solener.2025.113239 Type: article Understanding energy consumption in real-world E-IoT systems with CoAP, RPL, and 6LoWPAN Jiawei Lu, Kirk Martinez & Alex Weddell, 2024 DOI: 10.1007/978-981-97-4780-1_14 Type: conference Evaluating routing protocols for intermittent energy harvesting IoT networks Sara A. Alsodairi, Alex S. Weddell, Nawfal F. Al Hashimy & Geoff V. Merrett, 2024 DOI: 10.1109/COINS61597.2024.10622119 Type: conference Routing in intermittently powered IoT networks Sara Alsodairi, Geoff V. Merrett, Alex S. Weddell & Nawfal Al Hashimy, 2023 Type: conference A TEG-excited switched reluctance generator for self-powered sensing in next generation aircraft Bahareh Zaghari, Aleksas Stuikys, Alexander Weddell, Neil Grabham, Neil White, Terence Harvey & Ling Wang, 2022 Type: conference Pragmatic memory-system support for intermittent computing using emerging non-volatile memory Sivert T. Sliper, William Wang, Nikos Nikoleris, Alexander Weddell, Anand Savanth, Pranay Prabhat & Geoff Merrett, 2022, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems DOI: 10.1109/TCAD.2022.3168263 Type: article Broadband compact substrate-independent textile wearable antenna for simultaneous near- and far-field wireless power transmission Mahmoud Wagih, Abiodun Komolafe, Alex S. Weddell & Steve Beeby, 2022, IEEE Open Journal of Antennas and Propagation, 3, 398 - 411 DOI: 10.1109/OJAP.2022.3167089 Type: article 1 μW-3.75 W dual-mode near/far-field wearable wireless power transfer using a hybrid rectenna Mahmoud Wagih, Abiodun Komolafe, Alex S. Weddell & Steve Beeby, 2022 Type: conference Body-proximity effects on the input impedance of a complex-conjugate SWIPT textile rectenna Mahmoud Wagih, Alex S. Weddell & Steve Beeby, 2022 Type: conference Watt-level low-SAR near-field wearable wireless power transfer using an all-textile receiver Mahmoud Wagih, Abiodun Komolafe, Alex S. Weddell & Steve Beeby, 2022 DOI: 10.1109/MAP.2021.3121522 Type: conference Biography Alex Weddell is an Associate Professor in the Smart Electronic Materials and Systems Research Group, in the School of Electronics and Computer Science at the University of Southampton, UK. The school is the best in the UK for the quality and volume of research in Electrical and Electronic Engineering (REF 2014). He is a member of the management group for the Centre for IoT and Pervasive Systems. His main research interests are in wireless sensing, energy harvesting systems, intelligent sensing for monitoring the health of machines, and system liftetime monitoring and extension. He is most interested in research that's aimed at solving real problems, and demonstrated using physical prototypes. He has graduated three PhD students (as main supervisor, plus seven as co-supervisor) and is currently supervising (or co-supervising) a further six. Alex teaches a third-year undergraduate module on Embedded Networked Systems and an MSc module on IoT Networks. He supervises many practical third-year individual projects, fourth-year industrial Group Design projects, and MSc summer projects. He was awarded the MEng Electronic Engineering (first-class honours) at the University of Southampton in 2005, followed by a PhD, thesis entitled \"A comprehensive scheme for reconfigurable energy-aware wireless sensor nodes\", in 2010. During his PhD, he contributed to the Data Information Fusion Defence Technology Centre (DIF DTC) 'Adaptive Energy-Aware Sensor Networks' project and the EPSRC platform grant 'New Directions for Intelligent Sensors'. He has experience with a range of energy harvesting devices and has developed a platform which supports a mix of energy sources to power an energy-aware wireless sensor node. He worked as a Research Fellow on the 'Next Generation Energy-Harvesting Electronics: Holistic Approach' project, looking at energy device modelling and system-level design approaches before being appointed as a Lecturer in February 2013. He was promoted to Associate Professor in August 2023. He has acted as co-investigator on an EU Clean Sky 2 project \"Intelligent Integrated Bearing System\", developing self-powered smart bearings for jet engines. He was also a co-investigator on the EU Horizon 2020 project \"EnABLES: European Infrastructure Powering the Internet of Things\" and the EPSRC Platform project \"Wearable and Autonomous Computing for Future Smart Cities\". Alex is also passionate about outreach. He ran electronics activities for the annual Electronics & Computer Science Taster Course from 2015 to 2023, and has led workshops for A-level Physics and Computer Science teachers, and other teachers' CPD activities aiming to get hands-on electronics into the classroom. This work was recognised when the team was nominated for the 2017 Vice-Chancellor's Award for Collegiality. He contributed to development of Southampton's A-level Physics: Music Mixer and A-level Computing: Logic & Arithmetic kits, which won the 2019 Vice-Chancellor's Award in Public Engagement and Outreach. He was the lead Academic Integrity Officer in the School of Electronics and Computer Science from 2017 to 2024, and also served as the Faculty Academic Integrity Officer for the Facu",
  "content_length": 31397,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:41"
}