{
  "name": "Alex Wong 0001",
  "homepage": "https://seas.yale.edu/faculty-research/faculty-directory/alex-wong",
  "status": "success",
  "content": "Alex Wong | Professor | Yale Engineering Skip to Content Alex Wong Assistant Professor of Computer Science Email Room / Office:Room 325 Office Address:17 Hillhouse Avenue New Haven, CT 06511 Mailing Address:P.O. Box 208285 New Haven, CT 06520 About Alex Wong Degrees Ph.D., University of California, Los Angeles M.S., University of California, Los Angeles B.S., University of California, Los Angeles Perspectives Sensor fusion; unsupervised learning; 3D vision; robust vision under adverse conditions; medical image analysis. Selected Awards & Honors Neural Information Processing Systems (NeurIPS) Outstanding Student Paper Award (2011) International Conference on Robotics and Automation (ICRA) Best Paper Award in Robot Vision (2019) Selected Publications Zachary Berger, Parth Agrawal, Tian Yu Liu, Stefano Soatto, and Alex Wong. Stereoscopic Universal Perturbations across Different Architectures and Datasets. In the Proceedings of Computer Vision and Pattern Recognition (CVPR) 2022. Alex Wong, and Stefano Soatto. Unsupervised Depth Completion with Calibrated Backprojection Layers. In the Proceedings of International Conference on Computer Vision (ICCV) 2021. Oral. Alex Wong, Allison Chen, Yangchao Wu, Safa Cicek, Alexandre Tiard, Byung-Woo Hong, and Stefano Soatto. Small Lesion Segmentation in Brain MRIs with Subpixel Embedding. In the Proceedings of International Conference on Medical Image Computing and Computer Assisted Intervention (MICCAI) Brain Lesion Workshop 2021. Oral. Alex Wong, Safa Cicek, and Stefano Soatto. Learning Topology from Synthetic Data for Unsupervised Depth Completion. In the Robotics and Automation Letters (RA-L) 2021 and Proceedings of International Conference on Robotics and Autonomation (ICRA) 2021. Alex Wong, Mukund Mundhra, and Stefano Soatto. Stereopagnosia: Fooling Stereo Networks with Adversarial Perturbations. In the Proceedings of AAAI Conference on Artificial Intelligence (AAAI) 2021. Alex Wong, Xiaohan Fei, Stephanie Tsuei and Stefano Soatto. Unsupervised Depth Completion from Visual Inertial Odometry. In the Robotics and Automation Letters (RA-L) 2020 and Proceedings of International Conference on Robotics and Autonomation (ICRA) 2020. Xiaohan Fei, Alex Wong, and Stefano Soatto. Geo-Supervised Visual Depth Prediction. In the Robotics and Automation Letters (RA-L) 2019 and Proceedings of International Conference on Robotics and Autonomation (ICRA) 2019. Oral. Best Paper Award in Robot Vision (ICRA). Michael Shindler, Alex Wong, and Adam Meyerson. Fast and Accurate k-Means for Large Datasets. In the Proceedings of Neural Information Processing Systems (NeurIPS) 2011. Oral. Outstanding Student Paper Award. Related Content A hub for international and industry partnerships, KCITY takes on global challenges Yale Engineering advances AI innovation with seed funding for high-impact research and workshops",
  "content_length": 2877,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:18"
}