{
  "name": "Alexandra Ion",
  "homepage": "http://www.alexandraion.com",
  "status": "success",
  "content": "Alexandra Ion | CMU I am the Sara Kiesler Assistant Professor at the Human-Computer Interaction Institute at Carnegie Mellon University's School of Computer Science. I lead the Interactive Structures Lab, where we investigate and develop interactive design tools that enable digital fabrication of complex structures for novice users. You are most likely looking for my LAB WEBSITE HCI + computational geometry + engineering + design Interactive structures embed functionality within their geometry such that they can react to simple input with complex behavior. Such structures enable materials that can, e.g., embed robotic movement, can perform computations, or communicate with users. We focus on material discovery by broadening participation. We develop optimization-based interactive design tools that enable novices to contribute their creativity and experts to apply their intuition in order to foster the advancement of high-tech materials. We investigate the entire pipeline, i.e., their mechanical structure, the algorithms for efficient design, the unforeseen application areas and fabrication methods. We are always open for ambitious and interested students join the team! Contact Address: 407 S Craig St, Room 202 Pittsburgh, PA 15213, USA email: alexandraion(a)cmu.edu twitter Google Scholar Curriculum Vitae Selected Publications All publications are updated on our lab website or on Google Scholar. Please find them there! One nugget -- find my PhD thesis here: Metamaterial Devices Developable Metamaterials In Proceedings of CHI ’21. Understanding Metamaterial Mechanisms In Proceedings of CHI’19. Digital Mechanical Metamaterials In Proceedings of CHI’17. Metamaterial Mechanisms In Proceedings of UIST'16. Academic Service Program committee chairing: ACM UIST 2024 program co-chair ACM CHI 2024 subcommittee co-chair “Building Devices” ACM SIGGRAPH 2024 Poster chair ACM CHI 2023 subcommittee co-chair “Building Devices” Program committee member: ACM UIST 2021, 2020 ACM CHI 2021, 2020, 2019 ACM SIGGRAPH 2021 – Posters committee ACM SIGGRAPH Asia 2019 – Technical briefs and posters Graphics Interface 2020 Organizing committee: ACM SIGGRAPH 2023 – Student Research Competition chair ACM UIST 2022, 2023 – Doctoral Symposium co-chair ACM UIST 2020, 2021 – demonstrations co-chair ACM UIST 2019 – sustainability co-chair ACM UIST 2018 – local arrangements co-chair, accessibility chair ACM UIST 2017 – student volunteer co-chair ACM UIST 2016 – documentation chair Invited talks University of Konstanz, hosted by Tiare Feuchtner & Harald Reiterer. July 6, 2023. Austrian CS Day, hosted by IST Austria. June 21, 2022. University of Washington, Computational Fabrication, hosted by Adriana Schulz, Jeff Lipton. April 13, 2022. Stony Brook University, Civil Engineering Seminar, hosted by Paolo Celli. November 15, 2021. Tsinghua University, Access Computing Summer Program, hosted by Yukang Yan. August 10, 2021. MIT Summer Geometry Institute, hosted by Justin Solomon. August 3, 2021. Stanford HCI Seminar. May 28, 2021. Toronto Geometry Colloquium. March 31, 20201. CMU Mechanics Seminar, hosted by Kaushik Dayal. October 2, 2020. University of Toronto, hosted by Tovi Grossman. March 26, 2020. Carnegie Mellon University, hosted by Scott Hudson. March 23, 2020. Boston University MechE, hosted by Alice White. March 17, 2020. Boston University CS, hosted by Emily Whiting. March 16, 2020. University of Chicago, hosted by Blase Ur. March 12, 2020. Aalto University, hosted by Elisa Mekler, Antti Oulasvirta. March 5, 2020. IST Austria, hosted by Bernd Bickel. March 2, 2020. Cornell University, hosted by Cheng Zhang, François Guimbretière. February 26, 2020. TU Delft CS, hosted by Elmar Eisemann. Februray 7, 2020. TU Delft PME, hosted by Just Herder. Februray 4, 2020. Aalto University, hosted by Antti Oulasvirta. December 17, 2019. University of Copenhagen. December 16, 2019. TU Delft, hosted by Just Herder. November 14, 2019. University of Chicago, hosted by Pedro Lopes. October 29, 2019. University of Stuttgart, hosted by Achim Menges. September 16, 2019. Google (Mountain View), hosted by Alex Olwal. August 9, 2019. UC Berkeley, hosted by Björn Hartmann. August 8, 2019. Stanford, hosted by Sean Follmer. August 7, 2019. UCLA, hosted by Ankur Mehta. August 2, 2019. MIT Media Lab, hosted by Hiroshi Ishii. June 19, 2019. MIT CSAIL, hosted by Stefanie Mueller. June 19, 2019. ETH Zurich, PhD Seminar. October 26, 2018. University of Sussex, hosted by Diego Martínez & Sriram Subramanian. May 21, 2018. Université de Montréal, hosted by Bernhard Thomaszewski. April 27, 2018. IST Austria, hosted by Bernd Bickel. March 2, 2018. ETH Zürich, hosted by Olga Sorkine-Hornung. December 14, 2017. SAP Walldorf, hosted by Andreas Polze & Bernd Welz. December 11, 2017. TU Delft, hosted by Jouke Verlinden. December 4, 2017. Aarhus University, hosted by Roman Rädle. October 5, 2017. Technomania, hosted by The Danish Society of Engineers IDA. October 4, 2017. Driving 3D, hosted by The Danish Society of Engineers, IDA. September 29, 2017. TEDx Poznan. April 8, 2017. Singularity University Copenhagen, hosted by Märtha Rehnberg. December 14, 2016. TU Berlin, hosted by Marc Alexa. 2016. TU Berlin, hosted by Marc Alexa. 2015. Awards & Honors Academic Best paper award. ACM PACM (ISS’23). Best demo award. ACM UIST 2023. Received the Sara Kiesler Junior Development Chair at CMU HCII for 2023-2024 Selected for Rising Stars in EECS 2019. Best visual communication award for TrussFormer. ACM CHI 2019 Video Showcase. Scholarship for academic exchange (2018 DAAD FIT program, ~9 000 EUR). My CHI 2015 talk is the example for a good presentation on the CHI conference website, 2016 – present. Best paper honorable mention award. ACM UIST 2016. Best paper honorable mention award. ACM CHI 2013. Nominated for national best master’s thesis award. 2012. INDUSTRY/ART/DESIGN Fast Company’s Innovation by Design Award (Honorable Mention) 2018, for Adding Force Feedback to MR. VIDA. Incentive Award 2016, for Ad Infinitum. Bronze Cyber Lion, Cannes Lions 2010, for “Last call” (interactive movie). Bronze Media Lion, Cannes Lions 2010, for “Last call” (interactive movie). Bronze \"Digital Media Craft\", ADC Germany 2010, Art directors club, for “Last call” (interactive movie). Invited Exhibitions METAMATERIAL DEVICES Ars Electronica Center, Linz, Austria. 2019 – 2021. BMBF (german federal ministry for education and research) InnoTruck (travelling exhibition). 2017 – 2020. UNIVERSUM Mexico City, “3D, printing the world”. September 2019 – February 2020. Espacio Fundación Telefónica Chile, Santiago, “3D, printing the world”. March 2019 – July 2019. Espacio Fundación Telefónica Argentina, Buenos Aires, “3D, printing the world”. July 2018 – October 2018. Espacio Fundación Telefónica Peru, Lima, “3D, printing the world”. December 2017 – April 2018. Espacio Fundación Telefónica Spain, Madrid, “3D, printing the world”. June – September 2017. CeBit 2017. Futurium booth (Berlin-based museum for ideas of the future). March 20 – 24, 2017. AD INFINITUM Przemiany Festival, Copernicus Science Center Warsaw. September 13-16, 2018. World Economic Forum, San Francisco. December 2017 – May 2018. Ars Electronica Festival, Linz, Austria. 7-11 September 2017. Science Gallery Dublin, Ireland, “Humans need not apply”. February – May 2017. Natural History Museum Bern, Switzerland. September 9, 2016.",
  "content_length": 7417,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:47"
}