{
  "name": "Alexandru G. Bardas",
  "homepage": "https://www.ittc.ku.edu/~alexbardas",
  "status": "success",
  "content": "alex bardas Toggle navigation Alexandru G. Bardas home research teaching service Alexandru G. Bardas The University of Kansas Associate Professor Gary Minden Scholar EECS Department (SoE) and I2S 2040 Eaton Hall 205 Nichols Hall Lawrence, KS 66045 +1 785 864 4421 alexbardas ku edu About I am an associate professor in the Department of Electrical Engineering & Computer Science (EECS) and the Institute for Information Sciences (I2S, former ITTC) at the University of Kansas. I received my PhD from Kansas State University and was priviledged to be advised by Xinming (Simon) Ou and by Scott A. DeLoach. My research interests are focused on cybersecurity, mainly from a systems perspective. I believe that viable cybersecurity solutions must leverage collective knowledge, be reliable, and consider practical aspects in an environment surrounded by uncertainty. For more information, please see my research page. Vita My CV should you be interested. Announcements Looking for motivated PhD students who are interested in cybersecurity research. If you are interested, please drop me a note! Publication: Our two papers were accepted in ACSAC 2024 Publication: Our paper was accepted in USENIX Security 2024 Service: Program committee member for SOUPS 2024 Service: Co-Chair for Lightning Talks and Demos at SOUPS 2024 Service: General Chair for CANSec 2023 Interview: Discussion with Inside Higher Ed Publication: Our paper was accepted in USENIX Security 2023 Podcast: Interview for Cybersecurity Guide Award: Honorable Mention in NSA SoS Cybersecurity Paper Competition Service: Program committee member for SOUPS 2023 News releases: Forbes, Bioengineering.org, KU Today Grant/Award: NSF CAREER Award: Automation and Metrics in SOCs Service: Program committee member for SOUPS 2022 Service: Technical program committee member for MILCOM 2021 Grant: NSA 2021 GenCyber Grant Program (Teacher Summer Camp 2022) Service: Program committee member for ACM CCS 2021 Publications: Our papers were accepted in premier venues (see latest pubs) Service: Treasurer and Virtual Conference Task Force member for ACM CCS 2020 Blog post: F5 blog post about our metrics for SOCs Award: I was named a Bellows Scholar in the School of Engineering at KU Grant: NSF EAGER award: Metrics for SOCs, collaborative project with Brad Fidler Fellowship: Dalton receives the Self Graduate Fellowship Grant: NSF CRII award: Structuraly-morphing IT systems — Moving Targets Fellowship: Kailani receives the Chancellor's Doctoral Fellowship Personal I am originally from Sibiu, Romania. Sibiu is a medieval town located in the southern part of Transylvania. In 2007 Sibiu was designated European Capital of Culture. Last update: September 2025 Theme based on: the-development, ianunruh, orderedlist.",
  "content_length": 2771,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:01"
}