{
  "name": "Alexandros A. Voudouris",
  "homepage": "https://www.essex.ac.uk/people/voudo18000/alexandros-voudouris",
  "status": "success",
  "content": "Alexandros Voudouris | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Alexandros Voudouris People Dr Alexandros Voudouris Senior Lecturer School of Computer Science and Electronic Engineering (CSEE) Email alexandros.voudouris@essex.ac.uk Location 1NW.3.9, Colchester Campus Academic support hours Autumn Term: Tuesday 11-1; Please email me first to arrange a meeting. Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography I am a Senior Lecturer (Associate Professor) at the School of Computer Science and Electronic Engineering (CSEE), University of Essex, UK. Prior to this, I was a Lecturer (Assistant Professor) at the same institution (April 2020 - September 2023) and a postdoctoral researcher at the Department of Computer Science, University of Oxford (October 2018 - March 2020). I obtained my PhD in computer science in September 2018 from the University of Patras, Greece. My research interests lie at the intersection of theoretical computer science, artificial intelligence, and microeconomic theory. I am highly interested in the design and analysis of simple algorithms for fundamental problems in algorithmic game theory and computational social choice. For more information about me, please visit my personal page here. Qualifications Fellowship Higher Education Academy, PhD University of Patras, MSc University of Patras, Diploma (5-year degree) University of Patras, Appointments University of Essex Director, Centre for Computational Finance and Economic Agents (CCFEA), University of Essex (1/8/2024 - present) Senior Lecturer, Computer Science and Electronic Engineering, University of Essex, University of Essex (1/10/2023 - present) Lecturer, Computer Science and Electronic Engineering, University of Essex (1/4/2020 - 30/9/2023) UG Theme Lead (Computer Science), School of Computer Science and Electronic Engineering, University of Essex (1/9/2023 - present) PGT Theme Lead (Computational Finance), School of Computer Science and Electronic Engineering, University of Essex (1/9/2023 - present) PGT Selector (CCFEA), School of Computer Science and Electronic Engineering, University of Essex (1/9/2021 - present) Other academic Postdoctoral researcher, Computer Science, University of Oxford (1/10/2018 - 31/3/2020) Research and professional activities Research interests Algorithmic Game Theory Open to supervise Computational Social Choice Open to supervise Design and Analysis of Algorithms Open to supervise Algorithmic Mechanism Design Open to supervise Teaching and supervision Current teaching responsibilities Data Structures and Algorithms I (CE104) Introduction to Programming with C (CE150) Object-Oriented Programming (CE152) Previous supervision Rongsen Zhang Thesis title: Mechanism Design Without Money for Heterogeneous and Distributed Facility Location Problems Degree subject: Computational Finance Degree type: Doctor of Philosophy Awarded date: 23/5/2024 Publications Publications (4) Amanatidis, G., Anshelevich, E., Jerrett, C. and Voudouris, AA., (2024). Metric Distortion under Group-Fair Objectives Voudouris, AA., (2023). Tight Distortion Bounds for Distributed Single-Winner Metric Voting on a Line Deligkas, A., Filos-Ratsikas, A. and Voudouris, AA., (2023). Truthful Interval Covering Lotfi, M. and Voudouris, AA., (2023). On Truthful Constrained Heterogeneous Facility Location with Max-Variant Cost Journal articles (47) Kanellopoulos, P. and Voudouris, AA., (2026). Constrained Truthful Obnoxious Two-Facility Location with Optional Preferences. Lecture Notes in Computer Science. 15953 LNCS, 137-155 Kanellopoulos, P., Voudouris, A. and Zhang, R., (2025). Truthful two-facility location with candidate locations. Theoretical Computer Science. 1024, 114913-114913 Voudouris, AA., (2025). Metric Distortion of Obnoxious Distributed Voting. Information Processing Letters. 189, 106559-106559 Deligkas, A., Filos-Ratsikas, A. and Voudouris, AA., (2025). Special issue on Economics and Computation. Information Processing Letters. 190, 106578-106578 Anshelevich, E., Filos-Ratsikas, A., Jerrett, C. and Voudouris, A., (2025). Improved metric distortion via threshold approvals. Artificial Intelligence. 341, 104295-104295 Fang, J., Fang, Q., Liu, W., Nong, Q. and Voudouris, AA., (2025). Mechanism Design with Predictions for Facility Location Games with Candidate Locations. Journal of Combinatorial Optimization. 49 (5) Narayanan, L., Sabbagh, Y. and Voudouris, AA., (2025). Diversity-seeking jump games in networks. Autonomous Agents and Multi-Agent Systems. 39 (2) Kyropoulou, M. and Voudouris, A., (2025). The Price of EF1 for Few Agents with Additive Ternary Valuations. Operations Research Letters. 63, 107351-107351 Deligkas, A., Lotfi, M. and Voudouris, A., (2025). Agent-constrained truthful facility location games. Journal of Combinatorial Optimization. 49 (2), 24- Latifian, M. and Voudouris, A., (2025). The distortion of threshold approval matching. Autonomous Agents and Multi-Agent Systems. 39 (2), 42- Caragiannis, I., Filos-Ratsikas, A., Nath, S. and Voudouris, A., (2024). Truthful ownership transfer with expect advice. Mathematical Programming. 203 (1-2), 871-900 Lotfi, M. and Voudouris, AA., (2024). On Truthful Constrained Heterogeneous Facility Location with Max-Variant Cost. Operations Research Letters. 52, 107060-107060 Filos-Ratsikas, A., Kanellopoulos, P., Voudouris, AA. and Zhang, R., (2024). The Distortion of Distributed Facility Location. Artificial Intelligence. 328, 104066-104066 Filos-Ratsikas, A. and Voudouris, A., (2024). Revisiting the distortion of distributed voting. Theory of Computing Systems. 68 (5), 1138-1159 Amanatidis, G., Birmpas, G., Filos-Ratsikas, A. and Voudouris, A., (2024). Don't Roll the Dice, Ask Twice: The Two-Query Distortion of Matching Problems and Beyond. SIAM Journal on Discrete Mathematics. 38 (1), 1007-1029 Deligkas, A., Filos-Ratsikas, A. and Voudouris, A., (2024). Truthful interval covering. Autonomous Agents and Multi-Agent Systems. 38 (2), 41- Kanellopoulos, P., Voudouris, A. and Zhang, R., (2023). On Discrete Truthful Heterogeneous Two-Facility Location. SIAM Journal on Discrete Mathematics. 37 (2), 779-799 Deligkas, A., Filos-Ratsikas, A. and Voudouris, A., (2023). Heterogeneous facility location with limited resources. Games and Economic Behavior. 139, 200-215 Voudouris, A., (2023). Tight distortion bounds for distributed metric voting on a line. Operations Research Letters. 51 (3), 266-269 Amanatidis, G., Aziz, H., Birmpas, G., Filos-Ratsikas, A., Li, B., Moulin, H., Voudouris, AA. and Wu, X., (2023). Fair division of indivisible goods: Recent progress and open questions. Artificial Intelligence. 322, 103965-103965 Kanellopoulos, P., Kyropoulou, M. and Voudouris, A., (2023). Not all Strangers are the Same: The Impact of Tolerance in Schelling Games. Theoretical Computer Science. 971, 114065-114065 Caragiannis, I., Kanellopoulos, P. and Voudouris, AA., (2022). Bounding the Inefficiency of Compromise in Opinion Formation. Algorithmica. 84 (1), 234-271 Amanatidis, G., Birmpas, G., Filos-Ratsikas, A. and Voudouris, A., (2022). A Few Queries Go a Long Way: Information-Distortion Tradeoffs in Matching. Journal of Artificial Intelligence Research. 74, 227-261 Anshelevich, E., Filos-Ratsikas, A. and Voudouris, A., (2022). The distortion of distributed metric social choice. Artificial Intelligence. 308, 103713-103713 Kampouridis, M., Kanellopoulos, P., Kyropoulou, M., Melissourgos, T. and Voudouris, A., (2022). Multi-Agent Systems for Computational Economics and Finance. AI Communications: the European journal on artificial intelligence. 35 (4), 369-380 Caragiannis, I., Shah, N. and Voudouris, AA., (2022). The metric distortion of multiwinner voting. Artificial Intelligence. 313, 103802-103802 Elkind, E., Gan, J., Obraztsova, S., Rabinovich, Z. and Voudouris, AA., (2021). Protecting elections by recounting ballots. Artificial Intelligence. 290, 103401-103401 Birmpas, G., Gan, J., Hollender, A., Marmolejo-Cossío, FJ., Rajgopal, N. and Voudouris, AA., (2021). Optimally Deceiving a Learning Leader in Stackelberg Games. Journal of Artificial Intelligence Research. 72, 507-531 Amanatidis, G., Birmpas, G., Filos-Ratsikas, A., Hollender, A. and Voudouris, AA., (2021). Maximum Nash welfare and other stories about EFX. Theoretical Computer Science. 863, 69-85 Amanatidis, G., Birmpas, G., Filos-Ratsikas, A. and Voudouris, AA., (2021). Peeking Behind the Ordinal Curtain: Improving Distortion via Cardinal Queries. Artificial Intelligence. 296, 103488-103488 Bullinger, M., Suksompong, W. and Voudouris, AA., (2021). Welfare Guarantees in Schelling Segregation. Journal of Artificial Intelligence Research. 71, 143-174 Agarwal, A., Elkind, E., Gan, J., Igarashi, A., Suksompong, W. and Voudouris, AA., (2021). Schelling games on graphs. Artificial Intelligence. 301, 103576-103576 Caragiannis, I. and Voudouris, A., (2021). ",
  "content_length": 21263,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:58"
}