{
  "name": "Alexandra Fedorova",
  "homepage": "https://www.ece.ubc.ca/faculty/alexandra-sasha-fedorova",
  "status": "success",
  "content": "Alexandra (Sasha) Fedorova - Department of Electrical and Computer Engineering Search Faculty of Applied ScienceDepartment of Electrical and Computer Engineering Home Undergraduate Admissions Programs Awards and Funding Undergraduate Teaching Assistantships Undergraduate Student Advising Peer Advisors Undergraduate Course List Capstone Opportunities Vancouver Summer Program Graduate Programs Awards and Funding Graduate Teaching Assistantships TA Access to Canvas Graduate Student Advising Graduate Course List Policies and Procedures Research Biomedical Technologies Communication Systems Computer and Software Systems Emerging Micro/Nano Technologies Energy Systems Optimization, Learning, Control People Faculty Directory Staff Directory Student Life Societies and Clubs Student Design Teams Health & Wellness Mentorship Academic Resources for Students News & Events ECE Calendar ECE News Archive Graduate Student Newsletter Archive Past Events ECE Graduate and Postdoctoral Studies Student Perspective Stories Engage with ECE Industry Partnerships Alumni Communicate with ECE EDII Suggestion Box About Head’s Message Careers Faculty Positions Staff Positions Safety in ECE Room Bookings Contact Us ECE Logos, Backgrounds, and Templates Powerpoint Templates ECE Zoom Backgrounds » Home » Alexandra (Sasha) Fedorova Alexandra (Sasha) Fedorova ProfessorBA (Massachusetts, USA), PhD (Boston, USA) Office: KAIS 4113Phone: (604) 822-0615Fax: (604) 822-5949Email: sasha@ece.ubc.ca Website Publications LinkedIn Alexandra Fedorova is a Professor in the Electrical and Computer Engineering Department at UBC. She received her PhD at Harvard in 2006 with a thesis on Operating System Scheduling for Multicore Processors. While at Harvard, Dr. Fedorova interned at Sun Microsystems Labs and contributed to the development of the Niagara processor simulator and experimented with adopting transactional memory in real applications. Between 2006 and 2015 Dr. Fedorova was an Assistant and then Associate professor at the School of Computing Science at SFU, where she also launched the Big Data professional Master’s program in 2014. Dr. Fedorova was awarded the Alfred P. Sloan Research Fellowship in 2012 and the ACM CRA-W Anita Borg Early Career Award in 2011. Her research centers around performance, usability and energy-efficiency of computer systems; the current focus is on effective management of memory and CPU resources. She also measures and hacks operating systems, runtime libraries and other system software and teaches courses on all kinds of systems: operating, distributed, Big Data. In her spare time, she consults for MongoDB; working on enhancing the performance of their back-end key-value store WiredTiger. Research Interests Performance, usability and energy-efficiency of computer system and effective management of memory and CPU resources Research Group Computer and Software Systems Teaching CPEN 331 – Operating Systems EECE 571B – Electrical Engineering Seminar and Special Problems – Big Data Systems << Back to Faculty Department of Electrical and Computer Engineering 5500-2332 Main Mall Vancouver, BC Canada V6T 1Z4 Tel 604 822 0895 Fax 604 822 5949 Email help@ece.ubc.ca Find us on We acknowledge that the UBC Point Grey campus is situated on the traditional, ancestral, and unceded territory of the xʷməθkʷəy̓əm (Musqueam).",
  "content_length": 3352,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:48"
}