{
  "name": "Alex Lascarides",
  "homepage": "http://homepages.inf.ed.ac.uk/alex",
  "status": "success",
  "content": "Alex Lascarides Homepage Research Publications People Contact Alex Lascarides Chair in Semantics, School of Informatics , University of Edinburgh. I have retired, and so I will not be taking on any new PhD students as a primary supervisor. I am a professor emerita in the School of Informatics , University of Edinburgh. I am affiliated with the Institute for Language, Cognition and Computation. Check out our new CDT in Designing Responsible NLP, which has lots of PhD studentships available. Research Interests Prof. Alex Lascarides' research is in theoretical and computational linguistics and AI. Her research aims to model the semantics and pragmatics of communicative actions in conversation, mainly focussing on text and speech but also analysing non-verbal actions such as hand gestures. She has developed logical and computational models of how humans communicate with each other, and machine learning frameworks that enable software agents and robots to engage in, and learn from, verbal and non-verbal interactions with humans. She has also developed models of conversation where the participants' goals diverge (e.g., courtroom cross examination, negotiations over restricted resources and political debate), as well as cases where they align (e.g., tourist information, scheduling). A common underlying theme to all this work is to exploit models of discourse coherence to constrain the inferential processes that underly generating and interpreting language and gesture. Prof. Lascarides also has an ongoing interest in developing machine learning methods for learning optimal strategies, particularly for complex games such as Settlers of Catan, or for decision problems where the agent starts out unaware of possible states and/or actions that are critical to task success. Biography Prof. Alex Lascarides studied Mathematics at Durham, graduating in 1984. While doing her maths degree, she also took options in philosophy and logic, and found that she enjoyed engaging in work that combines insights from the sciences and humanties. This developed into an interest in Cognitive Science, and she came to Edinburgh to do her Masters and PhD because of its reputation in inter-disciplinary research. She found the research environment in Edinburgh so stimulating and the city itself so attractive that she has stayed in Edinburgh ever since---other than one year spent at Stanford as a visiting assistant professor---first as a postdoctoral fellow and then as a lecturer, reader and professor. Prof. Lascarides' research interests are in modelling discourse and dialogue, including face to face dialogues where people gesture as well as speak, and non-cooperative dialogues where people may be deceptive and unhelpful in other ways. © Alex Lascarides, University of Edinburgh Design by TEMPLATED.",
  "content_length": 2811,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:11"
}