{
  "name": "Alex Gittens",
  "homepage": "http://www.cs.rpi.edu/~gittea",
  "status": "success",
  "content": "Alex Gittens Lally Management Building, Office 316 110 8th St Troy, NY 12180 I am an associate professor of computer science at Rensselaer Polytechnic Institute. My research focuses on designing algorithms with provable performance guarantees, with an emphasis on tensor factorization, trustworthy machine learning, and randomized numerical linear algebra for large-scale machine learning applications. I have advanced scalable methods for tensor decomposition, developed robust techniques for scalable and fair machine learning, and explored randomized algorithms to optimize computational and communication efficiency in data-intensive and distributed problems. My work has been published in top-tier venues and applied across domains, from scientific computing to real-world machine learning systems. Before joining RPI, I earned my PhD in applied and computational mathematics from CalTech and held research positions at eBay, the International Computer Science Institute, and UC Berkeley’s AMPLab. selected publications Simple Disentanglement of Style and Content in Visual Representations Lilian Ngweta, Subha Maity, Alex Gittens, and 2 more authors In International Conference on Machine Learning, ICML 2023, 2023 Deception by Omission: Using Adversarial Missingness to Poison Causal Structure Learning Deniz Koyuncu, Alex Gittens, Bülent Yener, and 1 more author In Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining, KDD 2023, 2023 An Adversarial Perspective on Accuracy, Robustness, Fairness, and Privacy: Multilateral-Tradeoffs in Trustworthy ML Alex Gittens, Bülent Yener, and Moti Yung IEEE Access, 2022 Adaptive Sketching for Fast and Convergent Canonical Polyadic Decomposition Alex Gittens, Kareem S. Aggour, and Bülent Yener In Proceedings of the 37th International Conference on Machine Learning, ICML 2020, 2020 NoisyCUR: An Algorithm for Two-Cost Budgeted Matrix Completion Dong Hu, Alex Gittens, and Malik Magdon-Ismail In Machine Learning and Knowledge Discovery in Databases - European Conference, ECML PKDD 2020, 2020 Email is best to contact me.",
  "content_length": 2104,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:09"
}