{
  "name": "Alexander Mariakakis",
  "homepage": "https://mariakakis.github.io",
  "status": "success",
  "content": "Alex Mariakakis Alex Mariakakis I primarily use this website to provide my bio and CV, as well as some archival information about my PhD research. For the most up-to-date information about my ongoing work and potential opportunities at the University of Toronto, please go to my research group's webpage. Contact Info Email: mariakakis at cs dot toronto dot edu News Oct 16, 2025: Delivered a talk for Georgia Tech's IPaT GVU Lunch Lecture Series Oct 1, 2025: Delivered a talk for the University of California San Diego's Design Lab Research Meeting Sep 26, 2025: Delivered a talk for the University of Michigan's Human Computer Interaction Seminar Sep 23, 2025: Delivered a guest lecture for Dr. Rajalakshmi Nandkumar's course at Cornell Tech Sep 22, 2025: Delivered a talk for Columbia University's Department of Biomedical Informatics (More news...) Current Roles I am an Assistant Professor in the Department of Computer Science at the University of Toronto. I run the Computational Health and Interaction (CHAI) lab, which leverages ubiquitous technologies like smartphones and wearables to address problems related to people’s health. Using sensor data collected from momentary assessments or passive recordings, I employ signal processing and machine learning to generate digital biomarkers related to a person's physiology, context, and behavior. My work also spans other topics at the intersection of ubiquitous computing and human-computer interaction such as mobile interaction, user-centered design, and novel sensing techniques. Beyond my primary academic role, I am also an Affiliate Scientist at KITE@UHN and an Education Faculty Affiliate for T-CAIREM, which has enabled my passion for digital health research to influence the clinical landscape in the Greater Toronto Area. I am also a Faculty Fellow at AXL, which is a Toronto-based venture studio seeking to accelerate Canadian innovation in human-centric AI. Career Path Before joining the University of Toronto, I completed a joint postdoctoral role under Larsson Omberg and Anind Dey, where I split my time between the Sage Bionetworks and the School of Computer Science and Engineering at the University of Washington. I completed my PhD at the University of Washington under the supervision of Shwetak Patel and Jacob O. Wobbrock. I completed my undergraduate studies at Duke University with a double major in Electrical and Computer Engineering and Computer Science. During that time, I conducted research under Romit Roy Choudhury.",
  "content_length": 2507,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:30"
}