{
  "name": "Alexander Nolte",
  "homepage": "https://research.tue.nl/nl/persons/alexander-nolte",
  "status": "success",
  "content": "Alexander Nolte - Onderzoeksportaal Eindhoven University of Technology Bekijk Scopus-profiel Alexander Nolte Dr. Universitair Docent, Mathematics and Computer Science, Social Software Engineering https://orcid.org/0000-0003-1255-824X E-maila.u.noltetuenl 871 Citaties 20072025 Onderzoeksresultaten per jaar Persoonlijk profiel Expertise gerelateerd aan duurzame ontwikkelingsdoelstellingen van de VN In 2015 stemden de VN-lidstaten in met 17 wereldwijde duurzame ontwikkelingsdoelstellingen (Sustainable Development Goals, SDG's) om armoede te beëindigen, de planeet te beschermen en voor iedereen welvaart te garanderen. Het werk van deze persoon draagt bij aan de volgende duurzame ontwikkelingsdoelstelling(en): Externe positiesAdjunct Associate Professor, Carnegie Mellon University1 jun. 2020 → … Vingerafdruk Verdiep u in de onderzoeksgebieden waarop Alexander Nolte actief is. Deze onderwerplabels komen uit het werk van deze persoon. Samen vormen ze een unieke vingerafdruk. 6 Soortgelijke profielen Process Monitoring Computer Science 100% Business Process Computer Science 46% Large Language Model Computer Science 42% Work-Group Computer Science 38% Open Source Computer Science 37% Analyst Process Computer Science 34% Analytics Platform Computer Science 28% Room Acoustics Computer Science 28% Volledige vingerafdruk bekijken Samenwerkingen en hoofdonderzoeksgebieden uit de afgelopen vijf jaar Recente externe samenwerking op landen-/regioniveau. Duik in de details door op de stippen te klikken of Selecteer een land/regio uit de lijst Duik in details Selecteer een land/regio om gedeelde publicaties en projecten te bekijken Sluiten Selecteer een land/regio uit de lijst Netwerk verder verkennen Onderzoeksoutput Onderzoeksoutput per jaar 2007 2016 2019 2020 2021 2022 2023 2024 2025 2025 84 Conferentiebijdrage 34 Tijdschriftartikel 6 Hoofdstuk 3 Overige bijdrage 2 Meer 1 Boek 1 Preprint Onderzoeksoutput per jaar Onderzoeksoutput per jaar A C-Level Perspective on the Role of Developers in the Creative Process of Software Startups: Fostering Developer Creativity and Participation in InnovationGama, K., de Souza, C. R. B., Nolte, A. & Valenca, G., mei 2025, In: IEEE Software. 42, 3, blz. 98-106 9 blz., 10887288.Onderzoeksoutput: Bijdrage aan tijdschrift › Tijdschriftartikel › Academic › peer review Open AccessBestand Software Developer 100% Creative Activity 100% Creative Process 100% 1 Citaat (Scopus) A survey instrument for hackathon organizers and researchersNolte, A., Filippova, A. & Herbsleb, J. D., 2025Onderzoeksoutput: Andere bijdrage › Overige bijdrage › Andere onderzoeksoutput Open Access Explanatory Capabilities of Large Language Models in Prescriptive Process Monitoring (Extended Abstract)Kubrak, K., Botchorishvili, L., Milani, F., Nolte, A. & Dumas, M., 2025, Proceedings of the Thirty-Fourth International Joint Conference on Artificial Intelligence Sister Conferences Best Papers. Kwok, J. (uitgave). International Joint Conferences on Artificial Intelligence (IJCAI), blz. 10901-10905 5 blz.Onderzoeksoutput: Hoofdstuk in Boek/Rapport/Congresprocedure › Conferentiebijdrage › Academic › peer review Process Monitoring 100% Large Language Model 100% Monitoring Process 100% Monitoring System 66% Business Process 16% Exploring the Potential of Hackathons as a Means to Promote Understanding of AI Literacy: A Case StudySchulten, C. (Corresponderende auteur), Yuan, L., Gama, K., Nolte, A. & Chounta, I.-A., 3 nov. 2025, Collaboration Technologies and Social Computing: 31st International Conference, CollabTech 2025, Jakarta, Indonesia, November 4–7, 2025, Proceedings. Chounta, I.-A., Egi, H., Nugraha, A., Budi Santoso, H., Inoue, T. & Salim, T. A. (uitgave). Cham: Springer, blz. 244-251 8 blz. (Lecture Notes in Computer Science (LNCS); vol. 16204).Onderzoeksoutput: Hoofdstuk in Boek/Rapport/Congresprocedure › Conferentiebijdrage › Academic › peer review Case Study 100% Artificial Intelligence 100% Digital education 37% Learning Materials 37% Diverse Background 12% How Do Hackathons Foster Creativity? Towards Automated Evaluation of Creativity at ScaleOlesen, J. F., Chen, Y., Rafner, J., Zhang, M., Bjerva, J. & Nolte, A., 25 apr. 2025, CHI '25: Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems. Yamashita, N., Evers, V., Yatani, K., Ding, X., Lee, B., Chetty, M. & Toups-Dugas, P. (uitgave). New York: Association for Computing Machinery, Inc., 23 blz. 198Onderzoeksoutput: Hoofdstuk in Boek/Rapport/Congresprocedure › Conferentiebijdrage › Academic › peer review Open AccessBestand Collaboration Pattern 100% Case Study 100% Large Language Model 100% Creativity Research 100% Creativity 100% 14 Downloads (Pure) Alle bekijken 129 onderzoeksoutput Datasets Building-acoustics-TU-Eindhoven/OSS_RoomAcoustics: v1.0.0Hornikx, M. C. J. (Bijdrager), Paganini, L. (Bijdrager), Serebrenik, A. (Bijdrager), Nolte, A. (Bijdrager), Wang, H. (Bijdrager) & Fichera, I. (Bijdrager), Zenodo, 4 jul. 2024DOI: 10.5281/zenodo.12655865, https://zenodo.org/records/12655865Dataset Dataset for An Empirical Study of Hackathon Code Creation and ReuseMahmoud, A. S. I. (Ontwerper), Dey, T. (Ontwerper), Nolte, A. (Ontwerper), Mockus, A. (Ontwerper) & Herbsleb, J. D. (Ontwerper), Zenodo, 24 mei 2022DOI: 10.5281/zenodo.6578707Dataset Prijzen Best conference paper awardHerrmann, T. (Ontvanger) & Nolte, A. (Ontvanger), okt. 2023Prijs: Anders › Werk, activiteit of publicatie gerelateerde prijzen (lifetime, best paper, poster etc.) › Wetenschappelijk Organizational Practice 100% Information System 100% Conference Paper 100% Best demo awardKubrak, K. (Ontvanger), Botchorishvili, L. (Ontvanger), Milani, F. (Ontvanger), Dumas, M. (Ontvanger), Nolte, A. (Ontvanger), Shoush, M. (Ontvanger) & Qu, Z. (Ontvanger), okt. 2023Prijs: Anders › Werk, activiteit of publicatie gerelateerde prijzen (lifetime, best paper, poster etc.) › Wetenschappelijk Kairos 100% Best event report awardHolmen, J. K. (Ontvanger), Nolte, A. (Ontvanger), Elijah, M. (Ontvanger), Dey, C. (Ontvanger), Vergara Larrea, V. G. (Ontvanger), Parete-Koon, S. (Ontvanger) & Hayden, L. B. (Ontvanger), 2024Prijs: Anders › Werk, activiteit of publicatie gerelateerde prijzen (lifetime, best paper, poster etc.) › Wetenschappelijk Conferences 100% Curriculum Development 100% International Conference 100% Best paper awardKubrak, K. (Ontvanger), Botchorishvili, L. (Ontvanger), Milani, F. (Ontvanger), Nolte, A. (Ontvanger) & Dumas, M. (Ontvanger), sep. 2024Prijs: Anders › Werk, activiteit of publicatie gerelateerde prijzen (lifetime, best paper, poster etc.) › Wetenschappelijk Conferences 100% Process Management 100% Large Language Model 100% Business Process Management 100% Process Monitoring 100% Best paper awardOidekivi, M. (Ontvanger), Nolte, A. (Ontvanger), Aabloo, A. (Ontvanger) & Kruusamäe, K. (Ontvanger), jul. 2021Prijs: Anders › Werk, activiteit of publicatie gerelateerde prijzen (lifetime, best paper, poster etc.) › Wetenschappelijk Human System 100% International Conference 100% Alle bekijken 14 prijzen Activiteiten Activiteiten per jaar 2015 2019 2024 2024 9 Genodigd spreker 2 Keynote spreker Activiteiten per jaar Fostering diversity in hackathons - Do’s and don’tsOlesen, J. F. (Spreker) & Nolte, A. (Spreker)16 okt. 2024Activiteit: Types gesprekken of presentaties › Keynote spreker › Wetenschappelijk Advancing scientific softwareone hackathon at a timeNolte, A. (Spreker)10 jul. 2024Activiteit: Types gesprekken of presentaties › Genodigd spreker › Wetenschappelijk You hacked and now what? - Fostering the impact of hackathonsNolte, A. (Spreker)26 apr. 2024Activiteit: Types gesprekken of presentaties › Keynote spreker › Wetenschappelijk On time-bounded participant-driven events as a means of community buildingNolte, A. (Spreker)24 apr. 2024Activiteit: Types gesprekken of presentaties › Genodigd spreker › Wetenschappelijk One-off events? Exploring the impact of hackathons in open source and beyondNolte, A. (Spreker)7 feb. 2023Activiteit: Types gesprekken of presentaties › Genodigd spreker › Wetenschappelijk Alle bekijken 11 activiteiten Cursussen Capstone Software Development1/09/23 → …Cursus Human-Computer Interaction1/09/24 → …Cursus",
  "content_length": 8205,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:35"
}