{
  "name": "Alexandre M. L. de Vasconcelos",
  "homepage": "https://www.cin.ufpe.br/~amlv",
  "status": "success",
  "content": "Alexandre Marcos Lins de Vasconcelos - Home page Alexandre Marcos Lins de Vasconcelos D.Phil, University of York, GB, 1993 Bacharel em Ciência da Computação, Universidade Federal de Pernambuco (UFPE), 1987; Mestre em Informática, UFPE, 1989; Doutor em Ciência da Computação, University of York (GB), 1993; Pós-doutorado em Engenharia de Software, Universidad Politécnica de Valencia, Espanha, 2011; Professor do Centro de Informática da UFPE (CIn-UFPE) desde 1995, atualmente como Professor Titular; Consultor em implantação de processos de software pela Qualiti Software Processes entre 1999 e 2010; Instrutor e implementador do Modelo de Qualidade de Software MPS.BR pela sociedade SOFTEX desde 2004; Avaliador líder do Modelo de Qualidade de Software MPS.BR desde abril de 2009; Coordenador do projeto de parceria entre a EPSON e o CIn-UFPE para testes de software embarcado em impressoras fiscais entre Dezembro de 2006 a Abril de 2010; Diretor do Núcleo de Tecnologia da Informação da UFPE entre março de 2013 e outubro de 2015. Tem experiência em Engenharia de Software, atuando nos seguintes tópicos de pesquisa: qualidade de software, metodologias e processos de software, ambientes e ferramentas CASE, testes de software e engenharia de requisitos. Orientador do Doutorado Professor John A. McDermid. Posição Atual Professor Titular do Centro de Informática da Universidade Federal de Pernambuco (CIn-UFPE). Áreas de Interesse Engenharia de Software Qualidade de Software Metodologias e Processos de Software Testes de Software Ambientes e Ferramentas CASE Disciplinas Ministradas ·   Pós-Graduação em Ciência da Computação (CIn-UFPE) Ø  Qualidade, Processos e Gestão de Software ·   Graduações em Ciência da Computação e Sistemas de Informação (CIn-UFPE) Ø Engenharia de Software Ø Qualidade de Software Ø Planejamento e Gerenciamento de Projetos Produção Científica Artigos, Cursos, Seminários e Orientações Livro \"Qualidade, Gestão e Processo de Software\" Livro \"Abordagens para Apoio à Implementação da Melhoria do Processo de Software\" Endereço Universidade Federal de Pernambuco Centro de Informática Av. Jornalista Aníbal Fernandes, s/n Cidade Universitária CEP. 50.740-560 Recife - PE - Brazil Telefone +55 81 2126 8430, Ramal (ext.) 4313 Fax +55 81 2126 8438 E-mail amlv@cin.ufpe.br Alexandre Marcos Lins de Vasconcelos",
  "content_length": 2337,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:53"
}