{
  "name": "Alexander H. Nelson 0001",
  "homepage": "https://computer-science-and-computer-engineering.uark.edu/directory/index/uid/ahnelson/name/Alexander+H.+Nelson",
  "status": "success",
  "content": "Electrical Engineering & Computer Science | University of Arkansas Electrical Engineering & Computer Science In the department of Electrical Engineering and Computer Science, faculty and students are working to improve existing technology and create the next generation of electronics and computing hardware and software. ApplyRequest InfoVisitGiveUndergraduate Student HubGraduate Student Hub Degrees Offered Electrical Engineering Degrees Computer Science Degrees Computer Engineering Degrees Certificates and Online Degrees Electrical Engineering Bachelor of Science in Electrical Engineering, B.S.E.E. 4+1: Combines BS/MS in Electrical Engineering Master of Science in Electrical Engineering, M.S.E.E. (On-campus or Online) Doctor of Philosophy in Electrical Engineering, Ph.D. Computer Science Bachelor of Science in Computer Science, B.S.C.S. Bachelor of Arts in Computer Science, B.A.C.S. Master of Science in Computer Science, M.S.C.S. Doctor of Philosophy in Computer Science, Ph.D. Computer Engineering Bachelor of Science in Computer Engineering, B.S.C.E. Master of Science in Computer Engineering, M.S.C.E. Doctor of Philosophy in Computer Engineering, Ph.D. Certificates and Online Degrees Cybersecurity Graduate Certificate (CSCE) Graduate Certificate of Entrepreneurship (EE) Graduate Certificate in Sustainability (EE) Master of Science Engineering, M.S.E (100% Online) Master of Science in Electrical Engineering, M.S.E.E. (On-campus or Online) Career Outlook Our personalized approach not only enhances your skills and knowledge but also ensures that your education is relevant and fulfilling, positioning you for success in your engineering career. What You Can Do Electrical Engineering Embedded System Engineer Power Electronics Designer Semiconductor Engineer Wireless Communication Engineer Computer Science Artificial Intelligence Engineer Cyber Security Specialist Data Scientist Data Engineer Data Analyst Software Engineer Computer Engineering Computer Hardware Engineer Robotics Engineer Computer Systems Engineer/Architect Satellite Communications Specialist Industries You Can Work In Electrical Engineering Renewable and clean energy Electric vehicles (land, ocean, space) Robotics and automation Smart phones and communication networks Smart Grid Nanotechnology & optoelectronics Computer Science Healthcare E-Commerce Energy Cybersecurity Information Technology Financial Services Computer Engineering Hardware Design Communications Defense Research Areas Cybersecurity Expand/Collapse Section Jia Di Kevin Jin Qinghua Li Alex Nelson Brajendra Panda Dale Thompson Xintao Wu Big Data, Data Analytics, and Blockchain Expand/Collapse Section Susan Gauch Brajendra Panda Xintao Wu Lu Zhang Machine Learning and Quantum Machine Learning Expand/Collapse Section Khoa Luu Alex Nelson Thi Hoang Ngan Le Computer Vision and Image Processing Expand/Collapse Section John Gauch Khoa Luu Thi Hoang Ngan Le Trustworthy and Responsible Artificial Intelligence Expand/Collapse Section Khoa Luu Thi Hoang Ngan Le Xintao Wu Lu Zhang Computer System Design and High Performance Computing Expand/Collapse Section David Andrews Jia Di Miaoqing Huang Kevin Jin Alex Nelson Deep Learning and Natural Language Processing Expand/Collapse Section Susan Gauch Khoa Luu Thi Hoang Ngan Le Algorithmic Self-Assembly and Biomolecular Computing Expand/Collapse Section Matthew Patitz Communications, Digital Signal Processing, and Sensor Networks Expand/Collapse Section Jingxian Wu Junliang Dong Electronics and Electronic Packaging, Analog and Mixed Signal, and Integrated Circuits Expand/Collapse Section Zhong Chen Alan Mantooth Hameed Naseem Fisher Yu Jeff Dix Xiaoqing Song Power Systems, Power Electronics, Renewable Energy, and Control Expand/Collapse Section Zhong Chen Omar Manasreh Alan Mantooth Roy McCann Hameed Naseem Fisher Yu Yue Zhao Morgan Ware Xiaoqing Song RF and Microwave, Electromagnetics, Antennas, and Terahertz Expand/Collapse Section Samir El-Ghazaly Magda El-Shenawee Junliang Dong Semiconductors, Nanotechnology, Optoelectronics, Photovoltaic, and Photonics Expand/Collapse Section Zhong Chen Samir El-Ghazaly Omar Manasreh Alan Mantooth Roy McCann Hameed Naseem Fisher Yu Morgan Ware Junliang Dong Research Centers & Labs View All College Research Centers & Labs UA Power Group Grid-Connected Advanced Power Electronics Systems High Density Electronics Center National Center for Reliable Electric Power Transmission Center for Infrastructure Trustworthiness in Energy Systems Center for Power Optimization of Electro-Thermal Systems Arkansas Security Research and Education Institute Multi-User Silicon Carbide National Semiconductor Research and Fabrication Facility (MUSiC) Institute for Nanoscience and Engineering Electrical Engineering Research Labs Innovative Nano/Biosensor Lab (INB Lab) Mixed-Signal CAD Lab Nanomaterials and Nanotube Research Laboratory (NNRL) Optoelectronics Research Lab Organic Devices and Electronics Lab (ODEL) Sustainable Smart Electrical Energy Systems Terahertz Imaging and Spectroscopy Computational Electromagnetics Group Power Electronic Systems Laboratory at Arkansas (PESLA) Power Switch Lab Power Systems Control Laboratory Intelligent Information Sensing, Processing, and Transmission Laboratory ISLAND (Integrated Systems Lab for ANalog Design) Photonic Integrated Circuits Lab Yu’s Group Intelligent Information Processing Lab Intelligent Terahertz Laboratory (iTHz-Lab) Computer Science & Computer Engineering Research Labs Applied Embedded Systems and IoT Research Lab (AESIR) Artificial Intelligence & Computer Vision (AICV) Lab Center for Information Security and Reliability Causal AI Lab Computer System Design Lab Cybersecurity and Privacy Lab JinLab Resilient Information and Operational Technology (RIOT) Lab Social Awareness and Intelligent Learning Lab Social Media Research Group Trustable Logic Circuit Design Laboratory Resources About Us UAACSCE AAEE Industry Advisory Board EECS Handbooks Our Faculty & Staff Electrical Engineering and Computer Science Faculty Electrical Engineering and Computer Science Staff Department News Student Organizations and Clubs Join to gain experience, enhance your degree, connect with peers, and make a collective impact. Association for Computing Machinery Institute of Electrical and Electronics Engineers CyberHogs Girls in Tech Trustworthy Machine Learning Reading Group Contact Us E-mail: eecs@uark.eduPhone: 479-575–4278Addresses: 504 J.B. Hunt Center for Academic Excellence, 227 N Harmon Ave, Fayetteville AR 72701 | 3217 Bell Engineering Center, 800 W Dickson St, Fayetteville AR 72701 Follow Us Facebook Instagram Twitter/X LinkedIn YouTube LinkinBio ApplyRequest InfoVisitGive Back to Top",
  "content_length": 6724,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:25"
}