{
  "name": "Alexey A. Neznanov",
  "homepage": "https://www.hse.ru/en/staff/aneznanov",
  "status": "success",
  "content": "Staff - Alexey Neznanov – HSE University В старых версиях браузеров сайт может отображаться некорректно. Для оптимальной работы с сайтом рекомендуем воспользоваться современным браузером.AAAABCABCABCАААААRegular version of the siteCampus in MoscowNizhny NovgorodSaint PetersburgPermRUENFor visually-impairedFor visually-impairedUser profile (HSE staff only)SearchSearchAdvanced searchMenuHSE UniversityHSE UniversityAbout HSEFaculty and StaffAlexey NeznanovRUENUser profile (HSE staff only)SearchAdvanced search  HomeTeachingResearch and PublicationsEmployment historyFor studentsIn HSE news Language ProficiencyRussianEnglishContactsPhone:+7 (495) 772-95-90 22672 +7 (985) 761-35-16Address: 11 Pokrovsky Bulvar, Pokrovka Complex, room S905TimetableSPIN-RSCI: 3446-1703ORCID: 0000-0001-9106-2298ResearcherID: D-9584-2014Scopus AuthorID: 55329014600Google ScholarOffice hoursMonday: 15:00 - 19:00, Thursday: 12:00 - 18:00 (can vary)SupervisorS. KuznetsovPrintable versionwith publicationswith newsPrintHave you spotted a typo?Highlight it, click Ctrl+Enter and send us a message. Thank you for your help!To be used only for spelling or punctuation mistakes.Alexey NeznanovAssociate Professor: Faculty of Computer Science / School of Data Analysis and Artificial IntelligenceAssociate Professor: Faculty of Computer Science / School of Software EngineeringAlexey Neznanov has been at HSE University since 2008.  HomeTeachingResearch and PublicationsEmployment historyFor studentsIn HSE newsEducation, Degrees and Academic Titles2011 Associate Professor2005Candidate of Sciences* (PhD) in Mathematical Support and Software in Computers, Complexes and Computer NetworksMoscow Power Engineering Institute2002Master'sMoscow Power Engineering Institute2000Bachelor'sMoscow Power Engineering Institute* Candidate of SciencesAccording to the International Standard Classification of Education (ISCED) 2011, Candidate of Sciences belongs to ISCED level 8 - \"doctoral or equivalent\", together with PhD, DPhil, D.Lit, D.Sc, LL.D, Doctorate or similar. Candidate of Sciences allows its holders to reach the level of the Associate Professor.Academic and Professional Interests Structural analysis of systems: algebraic and algorithmic aspects. Applied graph theory with an emphasis on symmetry, complexity and similarity of graph models of systems. Effective algorithms for solving problems of structural analysis. Data analysis: Big Data problems, graph mining, text mining, Formal Concept Analysis, formats and protocols of data processing. Medical informatics: clinical informatics, mathematical support of randomized controlled trials, medical information systems. Software engineering: software life cycle and ALM-technologies. Human-machine interaction: design of user interfaces, implementation of graphical user interfaces. Professional InterestsMedical InformaticsApplied Graph Theoryintelligent data analysissoftware engineeringusabilityAwards and Accomplishments Best Teacher — 2020, 2016, 2011Young Faculty Support Programme (Group of Young Academic Professionals)Category \"Future Professoriate\" (2011–2012)Category \"New Lecturers\" (2009–2010)Courses (2025/2026)Database Design (Master’s programme; Faculty of Computer Science field of study Sociology; 2 year, 2 module)RusDatabase Design (Mago-Lego; Faculty of Computer Science; 2 module)RusOnthologies and Semantic Technologies (Mago-Lego; Faculty of Humanities; 1, 2 module)RusOnthologies and Semantic Technologies (Master’s programme; Faculty of Humanities field of study Fundamental and Applied Linguistics; 2 year, 1, 2 module)RusOnthologies and Semantic Technologies (Master’s programme; Faculty of Humanities field of study Fundamental and Applied Linguistics; 2 year, 1, 2 module)RusResearch Seminar \"Process Analysis for Software Engineering\" (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 4 year, 1-3 module)RusResearch Seminar \"The Rust Language Ecosystem\" (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 4 year, 1-3 module)RusPast CoursesCourses (2024/2025)Database Design (Master’s programme; Faculty of Social Sciences field of study Sociology; 2 year, 2 module)RusDatabase Design (Mago-Lego; 2 module)RusDigital Interactive Products Development (Master’s programme; Faculty of Computer Science field of study Software Engineering; 1 year, 3, 4 module)RusDigital Interactive Products Development (Mago-Lego; 3, 4 module)RusOnthologies and Semantic Technologies (Master’s programme; Faculty of Humanities field of study Fundamental and Applied Linguistics; 2 year, 1, 3 module)RusOnthologies and Semantic Technologies (Mago-Lego; 1, 3 module)RusCourses (2023/2024)Database Design (Master’s programme; Faculty of Social Sciences field of study Sociology; 2 year, 2 module)RusDatabase Design (Mago-Lego; 2 module)RusCourses (2022/2023)Data management in intelligent systems (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)EngCourses (2021/2022)Data and Service Engineering for Automating Business Processes (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 2 year, 1, 2 module)EngDatabase Theory (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)RusKnowledge Management and Adaptive Learning Systems (Master’s programme; Institute of Education field of study Public Administration; 2 year, 1, 2 module)RusResearch Seminar \"Sociology of Business Sphere\" (Master’s programme; Faculty of Social Sciences field of study Sociology; 1 year, 1-4 module)RusCourses (2020/2021)Analysis and Visualization of Networks (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 4 year, 3 module)EngData Base Foundations (Optional course (faculty); Faculty of Creative Industries; 2 module)RusData and Service Engineering for Automating Business Processes (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 2 year, 1, 2 module)EngDatabase Theory (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)RusEducational Data Mining and Learning Analitics (Master’s programme; Institute of Education field of study Public Administration; 1 year, 2, 3 module)RusKnowledge Management and Adaptive Learning Systems (Master’s programme; Institute of Education field of study Public Administration; 2 year, 1, 2 module)RusSupervisor of the following Doctoral thesesfor a Candidate of Sciences degree1E. Tyuryumina A personalised mathematical growth model of primary tumor and secondary distant metastases with different growth rates in patients with breast cancer, 19002N. I. Veselko Models and Software Tools of Virtual Avatar-Environment Interaction History Processing for Intelligent Agents TrainingTimetable for todayFull timetableEmployment history 09.2013 – н.в. International Laboratory for Intelligent Systems and Structural Analysis. Senior Researcher. 09.2014 – now School of Data Analysis and Artificial Intelligence, Faculty of Computer Science at National Research University Higher School of Economics. Associate Professor. 10.2012 – 03.2015 Federal State Budget Institute \"Federal Scientific and Clinical Centre of Pediatric Hematology, Oncology and Immunology named after Dmitry Rogachev\" Ministry of Health of the Russian Federation. Head of Information Analytical department. 09.2008 – 08.2014 Department of applied mathematics and informatics at National Research University  Higher School of Economics. Deputy head of school of applied mathematics and computer science. Assistant Professor. Courses taught: “Workshop on computers”, “Database theory”, “Object-oriented CASE-technologies”, “Distributed systems”, “System and application software”, “Applied graph theory”, etc. 09.2005 – 06.2009 Institute of automatics and computer engineering at MPEI (TU). Lecturer. Courses taught: “Distributed systems and databases”, “Graph theory and combinatorics”, “Design and analysis of effective algorithms”. 09.2006 –06.2012 Department of innovations and high technology at Moscow Institute of Physics and Technology (MIPT). Assistant Professor. Courses taught: “Design of machine-user interaction”, “Distributed systems (client/server applications)”. 02.2006 –06.2008 Institute of Technology, Economics and Entrepreneurship at MPEI (TU). Senior Lecturer. Courses taught: “Organizational change management”. 09.2003 – 08.2005 Institute of automatics and computer engineering at MPEI (TU). Research assistant. 05.2000 – 08.2005 “Firma Perspectiva” Ltd. Software developer. Files Main topics of course works and diplomas № Actual research fields 1 Mathematical Foundations and Algorithms in Applied Graph Theory. 2 Data Analysis in Medical Informatics 3 Educational Data Mining. 4 Problems in Human-Computer Interaction. № Course works 1 Algorithms and Software Tools for Ontology-controlled Analysis of Unstructured Data Collections. 2 Unstructured Data Storages and Applications: Data Formats, Queries, Optimization. 3 Cloud Technologies and their Application for Intelligent Data Analysis Algorithms Scaling. 4 External Data Sources Browser for Intermediate Storage of Analytical Software. 5 Software Tools for Manipulating Open Data and Their Metadata . 6 Adaptive Algorithms of Randomizing Participants and Monitoring Reviews in Peer Assessment Systems. 7 Development of Interactive Algorithms of Computationally Hard Problems of Structural Analysis. 8 Graph Models Similarity Analysis Based on Mathematical Models of Structural Complexity. 9 Development of Combinatorial Configuration Construction Algorithms Implementations Libraries in Applied Graph Theory. 10 Development of Specialized Version of Structural Analysis Algorithms for Social Network Analysis. 11 Implement",
  "content_length": 15723,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:05"
}