{
  "name": "Alexandra To",
  "homepage": "https://www.khoury.northeastern.edu/people/alexandra-to",
  "status": "success",
  "content": "Alexandra To - Khoury College of Computer Sciences All People Alexandra To Assistant Professor, Jointly Appointed with College of Arts, Media and Design Biography Biography Alexandra To is an assistant professor in the Khoury College of Computer Sciences and the College of Arts, Media and Design at Northeastern University, based in Boston. To focuses on human–computer interaction, particularly on centering and uplifting marginalized people through computing and tech. She is interested not just in inclusion, but in how marginalized people can flourish and use tech to access joy, play, and justice. This research requires plenty of collaboration and ongoing learning, which keeps To engaged and on her toes. To has received a host of awards and recognitions for this work, including the Best Paper Award at ACM’s CHI, UIST, DIS, and CSCW conferences, plus a CSCW Recognition for Contribution to Diversity and Inclusion. At Khoury College, where she has researched and taught since 2020, To teaches foundational courses in human–computer interaction. Students often take her courses after a long series of deeply technical classes, and she enjoys guiding them in their reflections about who their technology is for and why. To particularly loves to pursue a disparate collection of research projects, both those born of her own passions and those put forth by her student collaborators. In her free time, To enjoys tabletop roleplaying games, fantasy video games, cooking, and tarot. Recent publications Recent publications Published: October 5, 2025 Constructing a Community of Play: Black Sims Players and Game Modding Citation: Angela D. R. Smith, Gianna Williams, Gabriella Thompson, Alexandra To. (2025). Constructing a Community of Play: Black Sims Players and Game Modding Proc. ACM Hum. Comput. Interact., 9, 385-414. https://doi.org/10.1145/3748609 Published: May 9, 2025 “I want to let them in”: Exploring Critical Consciousness Development through Roleplay and Reflection in “Papers, Please” Citation: Bethany Miatta Turay, Alesandra Baca-Vázquez, Alexandra To, Angela D. R. Smith. (2025). \"I want to let them in\": Exploring Critical Consciousness Development through Roleplay and Reflection in \"Papers, Please\" FDG, 41:1-41:13. https://doi.org/10.1145/3723498.3723797 Published: May 2, 2025 Cultivating Community and Creating Safe Spaces: Exploring A Design Toolkit for the Learned Values of Students of Color Citation: Dilruba Showkat, Laveda Chan, Christopher Brooks, Devina Raithatha, Alexandra To. (2025). Cultivating Community and Creating Safe Spaces: Exploring A Design Toolkit for the Learned Values of Students of Color Proc. ACM Hum. Comput. Interact., 9, 1-28. https://doi.org/10.1145/3710905 Published: April 25, 2025 Why Can’t Black Women Just Be?: Black Femme Content Creators Navigating Algorithmic Monoliths Citation: Gianna Williams, Natalie Chen, Michael Ann DeVito, Alexandra To. (2025). Why Can't Black Women Just Be?: Black Femme Content Creators Navigating Algorithmic Monoliths CHI, 108:1-108:14. https://doi.org/10.1145/3706598.3713842 Published: January 13, 2025 Data Enrichment Work and AI Labor in Latin America and the Caribbean Citation: Gianna Williams, Maya De Los Santos, Alexandra To, Saiph Savage. (2025). Data Enrichment Work and AI Labor in Latin America and the Caribbean CoRR, abs/2501.06981. https://doi.org/10.48550/arXiv.2501.06981 Published: July 24, 2024 Envisioning New Futures of Positive Social Technology: Beyond Paradigms of Fixing, Protecting, and Preventing Citation: JaeWon Kim, Lindsay Popowski, Anna Fang, Cassidy Pyle, Guo Freeman, Ryan M. Kelly, Angela Y. Lee, Fannie Liu, Angela D. R. Smith, Alexandra To, Amy X. Zhang. (2024). Envisioning New Futures of Positive Social Technology: Beyond Paradigms of Fixing, Protecting, and Preventing CoRR, abs/2407.17579. https://doi.org/10.48550/arXiv.2407.17579 Published: July 5, 2024 Queer TTRPGs’ Visibility, Safety, and Allegory as Resistance Citation: Jailyn Zabala, Josie Zvelebilova, Alexandra To. (2024). Queer TTRPGs' Visibility, Safety, and Allegory as Resistance FDG, 30. https://doi.org/10.1145/3649921.3650022 Published: May 11, 2024 An Exploration of Learned Values Through Lived Experiences to Design for BIPOC Students’ Flourishing Citation: Laveda Chan, Dilruba Showkat, Alexandra To. (2024). An Exploration of Learned Values Through Lived Experiences to Design for BIPOC Students' Flourishing CHI Extended Abstracts, 43:1-43:7. https://doi.org/10.1145/3613905.3650899 Published: October 31, 2022 Alienated Serendipity and Reflective Failure: Exploring Queer Game Mechanics and Queerness in Games via Queer Temporality Citation: Matthew Hantsbarger, Giovanni Maria Troiano, Alexandra To, Casper Harteveld. (2022). Alienated Serendipity and Reflective Failure: Exploring Queer Game Mechanics and Queerness in Games via Queer Temporality Proc. ACM Hum. Comput. Interact., 6, 1-27. https://doi.org/10.1145/3549484 Published: April 29, 2022 Interactive Fiction Provotypes for Coping with Interpersonal Racism Citation: Alexandra To, Hillary Carey, Riya Shrivastava, Jessica Hammer, Geoff Kaufman. (2022). Interactive Fiction Provotypes for Coping with Interpersonal Racism CHI, 453:1-453:14. https://doi.org/10.1145/3491102.3502044 Published: April 28, 2022 Collecting and Reporting Race and Ethnicity Data in HCI Citation: Yiqun T. Chen, Angela D. R. Smith, Katharina Reinecke, Alexandra To. (2022). Collecting and Reporting Race and Ethnicity Data in HCI CHI Extended Abstracts, 327:1-327:8. https://doi.org/10.1145/3491101.3519685 Published: June 30, 2021 Discovering intersectionality: part 2: reclaiming our time Citation: Jakita Owensby Thomas, Neha Kumar, Alexandra To, Quincy Brown, Yolanda A. Rankin. (2021). Discovering intersectionality: part 2: reclaiming our time Interactions, 28, 72-75. https://doi.org/10.1145/3468783 Published: April 27, 2021 Discovering intersectionality part I: researcher interrupted Citation: Quincy Brown, Neha Kumar, Jakita Owensby Thomas, Alexandra To, Yolanda A. Rankin. (2021). Discovering intersectionality part I: researcher interrupted Interactions, 28, 73-77. https://doi.org/10.1145/3457869 Published: March 1, 2021 “It’s Complicated”: Negotiating Accessibility and (Mis)Representation in Image Descriptions of Race, Gender, and Disability Citation: Bennett, C. L., Gleason, C., Scheurman, M. K., Bigham, J. P., Guo, A., & To, A. (2021). “It’s Complicated”: Negotiating Accessibility and (Mis) Representation in Image Descriptions of Race, Gender, and Disability. Published: May 1, 2020 “They Just Don’t Get It”: Towards Social Technologies for Coping with Interpersonal Racism Citation: To, A., Sweeney, W., Hammer, J., & Kaufman, G. (2020). \" They Just Don't Get It\": Towards Social Technologies for Coping with Interpersonal Racism. Proceedings of the ACM on Human-Computer Interaction, 4(CSCW1), 1-29. Published: April 1, 2020 Critical Race Theory for HCI Citation: Ogbonnaya-Ogburu, I. F., Smith, A. D., To, A., & Toyama, K. (2020, April). Critical race theory for HCI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (pp. 1-16). Individual Details Tenured/Tenure-Track Faculty Campus Boston Website https://www.alexandrato.com/ Google Scholar See Citations Areas of Interest Games Human-Centered Computing Contact a.to@northeastern.edu Related news Research that hits home: Alexandra To on how diversity fuels creativity in video game design November 17, 2025 CHI 2025: Khoury researchers publish record-high papers for second straight year April 22, 2025 NGN: Why are axolotls suddenly so popular — and going extinct at the same time? December 13, 2024 Explore all news Current PhD students Dilruba Showkat PhD Student Read bio Locations Close this dialog window Boston Jessica Teurn PhD Student Read bio Locations Close this dialog window Boston Bethany Turay PhD Student Read bio Locations Close this dialog window Boston Gianna Williams PhD Student Read bio Locations Close this dialog window Boston",
  "content_length": 8014,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:49"
}