{
  "name": "Alexandra Dmitrienko",
  "homepage": "https://se.informatik.uni-wuerzburg.de/secure-software-systems-group/staff0/alexandra-dmitrienko",
  "status": "success",
  "content": "Alexandra Dmitrienko - Secure Software Systems Group Intern Animation stoppen Secure Software Systems Group Software Engineering GroupSecure Software Systems GroupMediaNewsPeopleAlexandra DmitrienkoChristoph SendnerTorsten KraußMelanie GötzVarun GadeyHamid DashtbaniTymoteusz BurakFabian SchmittAlumniResearchProjectsPublicationsTeachingTheses/PracticumTeachingPublicationsProjectsPeopleEventsContactJobs Head of Secure Software Systems Research Group Chair of Software Engineering (Informatik II) Department of Computer Science University of Würzburg Am Hubland, 97074, Würzburg, Germany  Informatikgebäude, 1.OG, Room A115 Phone: +49 (931) 31 81667 Fax.: +49 (931) 31 86603  Email: alexandra.dmitrienko@uni-wuerzburg.de Software security Mobile security and privacy IoT Security Trustworthy Machine Learning for Privacy & Security In today's world of ubiquitous digitization, many physical objects, such as our homes, production facilities and even critical infrastructure get connected to networks, and become smarter through data collection and application of artificial intelligence (AI) and machine learning (ML) methods. This unavoidably poses new challenges to security and privacy. In my research, I aim to address new challenges and relevant research questions, such as: How to secure new systems, while facing ever growing complexity of software and protocols, large-scale deployments, cost requirements and absence of common standards? How to improve security of systems and networks using employment of AI and ML methods, while preserving privacy-friendly collection of training data? How to develop sustainable security methods that would be capable of adjusting to new security risks in the future, even in 20 years (typical life span of a car)? 2026[ to top ] Automated Code Annotation with LLMs for Establishing TEE Boundaries. Gadey, Varun; Götz, Melanie; Sendner, Christoph; Sovio, Sampo; Dmitrienko, Alexandra; in to appear in the Network and Distributed System Security Symposium (NDSS) (2026). [ BibTeX ] [ BibSonomy-Post ] @article{gadey2026automated, author = {Gadey, Varun and Götz, Melanie and Sendner, Christoph and Sovio, Sampo and Dmitrienko, Alexandra}, journal = {to appear in the Network and Distributed System Security Symposium (NDSS)}, keywords = {sssgroup}, title = {Automated Code Annotation with LLMs for Establishing TEE Boundaries}, year = 2026 } 2025[ to top ] TwinBreak: Jailbreaking LLM Security Alignments based on Twin Prompts. Krauß, Torsten; Dashtbani, Hamid; Dmitrienko, Alexandra; in ArXiv | arXiv:2506.07596 (2025). [ BibTeX ] [ URL ] [ Download ] [ BibSonomy-Post ] @article{krauss2025twinbreak, author = {Krauß, Torsten and Dashtbani, Hamid and Dmitrienko, Alexandra}, journal = {ArXiv | arXiv:2506.07596}, keywords = {hamiddashtbani}, title = {TwinBreak: Jailbreaking LLM Security Alignments based on Twin Prompts}, year = 2025 } RLFuzz: Accelerating Hardware Fuzzing with Deep Reinforcement Learning. Götz, Raphael; Sendner, Christoph; Ruck, Nico; Rostami, Mohamadreza; Dmitrienko, Alexandra; Sadeghi, Ahmad-Reza; in IEEE HOST (2025 IEEE International Symposium on Hardware Oriented Security and Trust (HOST)) (2025). [ Abstract ] [ BibTeX ] [ Download ] [ BibSonomy-Post ] Once hardware is manufactured, it becomes immutable, and any design flaws or vulnerabilities are permanent. Therefore, comprehensive testing of hardware designs is essential before production. However, the increasing complexity of modern processors makes static analysis and formal verification increasingly challenging. Fuzzing is a highly effective technique for detecting software vulnerabilities but adapting it to hardware presents unique challenges due to the fundamental differences between software and hardware. However, the current state-of-the-art in hardware fuzzing still has significant limitations, particularly in terms of performance, practicality, and the need for human intervention. To address these issues, we introduce RLFuzz, a novel hardware fuzzer that employs reinforcement learning to explore processors autonomously, achieving faster and more comprehensive coverage. Reinforcement learning enables the fuzzer to learn from its interactions with the processor without requiring labeled data, allowing it to more effectively select modifications for test cases and target previously unexplored areas. RLFuzz uses an asynchronous training mechanism that permits concurrent fuzzing and neural network training. To optimize RLFuzz, we performed an extensive evaluation of various deep Q-learning optimization techniques and hyper-parameters. We then tested the optimized fuzzer on three complex RISC-V cores-the Rocket core, CVA6, and BOOM-and compared its performance to a current hardware fuzzer, TheHuzz [20]. Our results show that RLFuzz achieved up to 1.77% higher coverage, and on average 2.35 times faster, and demonstrated a maximum speedup of up to 6.93 times. For branch coverage, the average speedup was 7.85 times, with a peak speedup of 92.98 times. Additionally, RLFuzz needed less time to complete 100,000 test cases and did not require any human intervention. @article{noauthororeditorrlfuzz, abstract = {Once hardware is manufactured, it becomes immutable, and any design flaws or vulnerabilities are permanent. Therefore, comprehensive testing of hardware designs is essential before production. However, the increasing complexity of modern processors makes static analysis and formal verification increasingly challenging. Fuzzing is a highly effective technique for detecting software vulnerabilities but adapting it to hardware presents unique challenges due to the fundamental differences between software and hardware. However, the current state-of-the-art in hardware fuzzing still has significant limitations, particularly in terms of performance, practicality, and the need for human intervention. To address these issues, we introduce RLFuzz, a novel hardware fuzzer that employs reinforcement learning to explore processors autonomously, achieving faster and more comprehensive coverage. Reinforcement learning enables the fuzzer to learn from its interactions with the processor without requiring labeled data, allowing it to more effectively select modifications for test cases and target previously unexplored areas. RLFuzz uses an asynchronous training mechanism that permits concurrent fuzzing and neural network training. To optimize RLFuzz, we performed an extensive evaluation of various deep Q-learning optimization techniques and hyper-parameters. We then tested the optimized fuzzer on three complex RISC-V cores-the Rocket core, CVA6, and BOOM-and compared its performance to a current hardware fuzzer, TheHuzz [20]. Our results show that RLFuzz achieved up to 1.77% higher coverage, and on average 2.35 times faster, and demonstrated a maximum speedup of up to 6.93 times. For branch coverage, the average speedup was 7.85 times, with a peak speedup of 92.98 times. Additionally, RLFuzz needed less time to complete 100,000 test cases and did not require any human intervention.}, author = {Götz, Raphael and Sendner, Christoph and Ruck, Nico and Rostami, Mohamadreza and Dmitrienko, Alexandra and Sadeghi, Ahmad-Reza}, journal = {IEEE HOST (2025 IEEE International Symposium on Hardware Oriented Security and Trust (HOST))}, keywords = {sssgroup}, title = {RLFuzz: Accelerating Hardware Fuzzing with Deep Reinforcement Learning}, year = 2025 } Security and Privacy of Current and Emerging IoT Devices and Systems (Dagstuhl Seminar 2431). Crispo, Bruno; Dmitrienko, Alexandra; Tsudik, Gene; Xu, Wenyuan; Sendner, Christoph; in Seminar Report (2025). [ BibTeX ] [ Download ] [ BibSonomy-Post ] @article{crispo2025security, author = {Crispo, Bruno and Dmitrienko, Alexandra and Tsudik, Gene and Xu, Wenyuan and Sendner, Christoph}, journal = {Seminar Report}, keywords = {sssgroup}, title = {Security and Privacy of Current and Emerging IoT Devices and Systems (Dagstuhl Seminar 2431)}, year = 2025 } Sibai: A Few-Shot Meta-Classifier for Poisoning Detection in Federated Learning. Götz, Melanie; Krauß, Torsten; Dmitrienko, Alexandra; in to appear in International Conference on Computer Vision, ICCV 2025 (2025). [ BibTeX ] [ Download ] [ BibSonomy-Post ] @article{gotz2025sibai, author = {Götz, Melanie and Krauß, Torsten and Dmitrienko, Alexandra}, journal = {to appear in International Conference on Computer Vision, ICCV 2025}, keywords = {sssgroup}, title = {Sibai: A Few-Shot Meta-Classifier for Poisoning Detection in Federated Learning}, year = 2025 } Impact Analysis of Sybil Attacks in the Tor Network. Sendner, Christoph; Schreider, Dominik; Dmitrienko, Alexandra; in International Workshop on Network and Distributed Systems Security (WNDSS) (2025). [ BibTeX ] [ Download ] [ BibSonomy-Post ] @article{sendner2025impact, author = {Sendner, Christoph and Schreider, Dominik and Dmitrienko, Alexandra}, journal = {International Workshop on Network and Distributed Systems Security (WNDSS)}, keywords = {sssgroup}, title = {Impact Analysis of Sybil Attacks in the Tor Network}, year = 2025 } AuthentiSafe: Lightweight and Future-Proof Device-to-Device Authentication for IoT. Petzi, Lukas; Krauß, Torsten; Dmitrienko, Alexandra; Tsudik, Gene; in the 20th ACM ASIA Conference on Computer and Communications Security (ACM ASIACCS 2025) (2025). [ Abstract ] [ BibTeX ] [ Download ] [ BibSonomy-Post ] The Internet of Things (IoT) is permeating many aspects of every- day life, including homes, public spaces, and industrial settings. The growing popularity of IoT devices prompts an important challenge of ensuring secure and reliable communication. To support direct device-to-device communication among resource-constrained IoT devices, lightweight authentication techniques are needed that do not rely on trusted servers. One promising primitive for this pur- pose are Physical Unclonable Functions (PUFs), which utilize unique characteristics of hardware components (e.g., memory) inherent in the m",
  "content_length": 246716,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:47"
}