{
  "name": "Alexander Schill",
  "homepage": "http://www.rn.inf.tu-dresden.de",
  "status": "success",
  "content": "Professur für Rechnernetze — Professur für Rechnernetze — TU Dresden Zur Hauptnavigation springen Zur Hauptnavigation springen Zur Suche springen Zum Inhalt springen © Philipp Grubitzsch Professur für Rechnernetze mehr erfahren Professur für Rechnernetze News Weitere News © Matthias Wählisch 04.05.2023 Prof. Rechnernetze wird Prof. Distributed and Networked Systems Weiterlesen Prof. Rechnernetze wird Prof. Distributed and Networked Systems © Michael Kretzschmar 04.05.2023 Prof. Wählisch übernimmt Lehre von Prof. Schill Weiterlesen Prof. Wählisch übernimmt Lehre von Prof. Schill Weitere News Wichtige Themen im Überblick © Tenshi Hara Forschungs­schwerpunk­te An der Professur für Rechnernetze wurde intensiv im Bereich der angewandten Rechnernetztechnologien und verteilter Systeme geforscht. Des Weiteren wurde weitreichende Forschung im Bereich des Delay-tolerant Networking und des technologie-unterstützten Lernens betrieben. Weiterlesen Forschungsschwerpunkte © Tenshi Hara Willkommen in der Professur für Rechnernetze Die Professur Rechnernetze forschte und lehrte 30 Jahre unter der Leitung von Prof. Alexander Schill. Im Mai 2023 trat Herr Prof. Dr. Matthias Wählisch seine Nachfolge an und leitet seit dem die neue Professur \"Verteilte und Vernetzte Systeme\". Wir vereinen dabei exzellentes Know-How von den Grundlagen der Rechnernetze und Verteilten Systeme bis hin zu hoch aktuellen Anwendungen wie mobile Applikationen als auch Service and Cloud Computing. Weitere Informationen © Lehrstuhl Rechnernetze Inhaber der Professur Prof. Dr. rer. nat. habil. Dr. h. c. Alexander Schill war von 1993 bis 2023 Inhaber des Lehrstuhls für Rechnernetze. Weiterlesen Inhaber der Professur © Philipp Grubitzsch Team Die Professur Rechnernetze beschäftigt derzeit über 20 wissenschaftliche, technische und administrative Mitarbeiterinnen und Mitarbeiter. Weiterlesen Team",
  "content_length": 1876,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:42"
}