{
  "name": "Alexander Wiethoff",
  "homepage": "http://www.mmi.ifi.lmu.de/team/alexander.wiethoff",
  "status": "success",
  "content": "Prof. Dr. Alexander Wiethoff - Medieninformatik Institut für Informatik | Sitemap | LMU-Portal English StartseiteStudieninteressierteStudierendeLehrveranstaltungenForschungPersonenKontaktBesucherJobsFAQIntern Prof. Dr. Alexander Wiethoff Mail alexander.wiethoff@ifi.lmu.de Addresse Alexander Wiethoff Ludwig-Maximilians-Universität München Media Informatics Group Frauenlobstr. 7a Room 456 (4th floor) 80337 Munich Sprechstunde Im Wintersemester 25: Mittwochs 09:00-10:00 Uhr in Raum 456 About mePublicationsPatentsTeaching ExperienceProfessional activitiesAbschlussarbeitenOffene AbschlussarbeitenIn BearbeitungAbgeschlossene Themen About me [More information on my professional profile] [More information on my personal website] Publications 2025 Download Philipp Thalhammer, Alexander Wiethoff MediMomo: Designing a Physical AI Platform for Content Accessibility in Healthcare Workshop Generative AI and Accessibility: CHI Conference on Human Factors in Computing Systems, Yokohama, Japan, 26 April 2025- 1 May 2025 (bib) 2024 Download Steeven Villa, Yannick Weiss, Niklas Hirsch, Alexander Wiethoff An Examination of Ultrasound Mid-air Haptics for Enhanced Material and Temperature Perception in Virtual Environments In Proceedings of the ACM International Conference on Mobile Human-Computer Interaction, MobileHCI 2024, Melbourne, Australia, Sept. 30 - Oct. 3, 2024. ACM, New York, NY, USA. 2023 Download Marius Hoggenmueller, Alexander Wiethoff Autonomous Agents Chapter contribution in the book \"Media Architecture Compendium Vol. 2 Concepts, Methods, Practice \" avedition, Frankfurt, Germany 2023. ISBN: 978-3-89986-393-2 Download Beat Rossmy, Nađa Terzimehić, Tanja Doering, Daniel Buschek, Alexander Wiethoff Point of no Undo: Irreversible Interactions as a Design Strategy In Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems (CHI '23), April 23-28, 2023, Hamburg, Germany. ACM, New York, NY, USA, 18 pages. https://doi.org/10.1145/3544548.3581433. (bib) 2022 Download Marius Hoggenmueller, Martin Tomitsch, Jessica Cauchard, Luke Hespanhol, Maria Lupetti, Ronald Schroeter, Sharon Yavo-Ayalon, Alexander Wiethoff, Stewart Worrall Interaction Design and the Automated City - Emerging Urban Interfaces, Prototyping Approaches and Design Methods Special Issue in the Open Access Journal on Multimodal Technologies and Interaction (MDPI), Basel, Switzerland Download Beat Rossmy, Maximilian Rauh, Alexander Wiethoff Towards User Interface Guidelines for Musical Grid Interfaces In Proceedings of the 22st International ACM Conference on New Interfaces for Musical Expression (NIME). Auckland, New Zealand, June 28th - July 1st, 2022. ACM, New York, NY, USA. 2021 Download Alexander Wiethoff, Martin Tomitsch, Marius Hoggenmueller, Luke Hespanhol, Linda Hirsch, Beat Rossmy, Stewart Worrall New Approaches for Prototyping Interactive Applications in Urban Environments In Proceedings of the 6th ACM Conference Media Architecture Biennale (MAB '2020). Amsterdam, Utrecht, The Netherlands, June 28 - July 02, 2021. ACM, New York, NY, USA. Download Beat Rossmy, Sebastian Unger, Alexander Wiethoff TouchGrid - Combining Touch Interaction with Musical Grid Interfaces In Proceedings of the 21st International ACM Conference on New Interfaces for Musical Expression (NIME). Shanghai, China, June 15-18, 2021. ACM, New York, NY, USA. (bib) Download Beat Rossmy, Alexander Wiethoff Musical Grid Interfaces: Past, Present, and Future Directions In Proceedings of the 21st International ACM Conference on New Interfaces for Musical Expression (NIME). Shanghai, China, June 15-18, 2021. ACM, New York, NY, USA. (bib) Download Alexander Wiethoff, Marius Hoggenmueller, Beat Rossmy, Linda Hirsch, Luke Hespanhol, Martin Tomitsch A Media Architecture Approach for Designing the Next Generation of Urban Interfaces Journal Article in Interaction Design and Architecture(s) - Special Issue on Immersive Technologies in Future Cities, 2021, ISSN 1826-9745, eISSN 2283-2998, Scuola IaD, Rome, Italy Download Beat Rossmy, Sonja Rümelin, Alexander Wiethoff StringTouch - From String Instruments towards new Interface Morphologies In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '21). Association for Computing Machinery, New York, NY, USA, Article 9, 1-10. DOI:https://doi.org/10.1145/3430524.3440628 | Honorable Mention Award (bib) 2020 Download Marius Hoggenmueller, Alexander Wiethoff The Light-Shifting Display - Blurring the Boundaries Between Display and Luminaire Design Article in the Professional Lighting Design Magazine (PLDM, Chinese Edition), VIA Publishers 2020, Beijing, China. Download Marius Hoggenmueller, Luke Hespanhol, Alexander Wiethoff, Martin Tomitsch Self-Moving Robots and Pulverised Urban Displays: Status Quo, Taxonomy & Challenges Journal Article in Personal and Ubiquitous Computing - Special Issue on Pervasive Displays, 2020, ISSN 1617-4917, Springer, London, UK. Download Beat Rossmy, Sarah Theres Völkel, Elias Naphausen, Patricia Kimm, Alexander Wiethoff, Andreas Muxel Punishable AI: Examining Users' Attitude Towards Robot Punishment In Proceedings of the 2020 ACM Designing Interactive Systems Conference (DIS '20). Association for Computing Machinery, New York, NY, USA, 179-191. DOI:https://doi.org/10.1145/3357236.3395542 (bib) 2019 Download Alexander Wiethoff, Marius Hoggenmueller The Ambient Display - Integrating Media Architecture Into Existing Surrounding and Structures Article in the Professional Lighting Design Magazine (PLDM, Chinese Edition), VIA Publishers 2019, Beijing, China. Download Svenja Dittrich, Ferdinand Hof, Alexander Wiethoff InteracDiff - Visualizing and Interacting with UX-Data In Proceedings of the annual conference organised by the German Informatics Society (Gesellschaft fuer Informatik e.V.) and the German Usability Professionals Association (Mensch und Computer), Hamburg, Germany, September 8-11, 2019. Springer, Berlin, Germany. Download Marius Hoggenmueller, Luke Hespanhol, Alexander Wiethoff, Martin Tomitsch Self-Moving Robots and Pulverized Urban Displays: Newcomers in the Pervasive Display Taxonomy In Proceedings of the Eighth ACM International Symposium on Pervasive Displays (PerDis), Palermo, Italy, June 12-14, 2019. ACM, New York, NY, USA. Best Conference-Paper Award. Download Beat Rossmy, Alexander Wiethoff The Modular Backward Evolution - Why to Use Outdated Technologies In Proceedings of the International Conference on New Interfaces for Musical Expression (pp. 343-348). Porto Alegre, Brazil: Zenodo. http://doi.org/10.5281/zenodo.3672988 (bib) Download Beat Rossmy, Alexander Wiethoff StringTouch - A Scalable Low-Cost Concept for Deformable Interfaces In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). Association for Computing Machinery, New York, NY, USA, Paper INT004, 1-4. DOI:https://doi.org/10.1145/3290607.3313245 (bib) Download Beat Rossmy, Alexander Wiethoff COMB - Shape as a Meaningful Element of Interaction In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '19). Association for Computing Machinery, New York, NY, USA, 287-295. DOI:https://doi.org/10.1145/3294109.3295646 (bib) 2018 Download Marius Hoggenmueller, Alexander Wiethoff, Andrew Vande Moere, Martin Tomitsch A Media Architecture Approach to Designing Shared Displays for Residential Internet-of-Things Devices In Proceedings of the 5th ACM Conference Media Architecture Biennale (MAB '18). Beijing, China, November 13 - 16, 2018. ACM, New York, NY, USA. Download Alexander Wiethoff, Marius Hoggenmueller Designing Mobile Low-Resolution Media Architecture: Challenges, Opportunities and Goals In Proceedings of the 5th ACM Conference Media Architecture Biennale (MAB '18). Beijing, China, November 13 - 16, 2018. ACM, New York, NY, USA. Download Beat Rossmy, Alexander Wiethoff COMB - Form als bedeutungsvolle Eingabemethode in der Gestaltung Be-greifbarer Schnittstellen für Kinder In: Dachselt, R. & Weber, G. (Hrsg.), Mensch und Computer 2018 - Workshopband. Bonn: Gesellschaft für Informatik e.V.. DOI: 10.18420/muc2018-ws05-0498 (bib) Download Alexander Wiethoff Giving Users What They Want - State of FL-UX Article in \"Maize Magazine\" Issue 08/2018. H-FARM S.p.A. Italy Download Sarah Jenney, Michael Muehlhaus, Nils Seifert , Frank Petzold, Alexander Wiethoff Escaping Flatlands - Interdisciplinary Collaborative Prototyping Solutions to Current Architectural Topics In Proceedings of the 36th ACM International Conference on Education and research in Computer Aided Architectural Design in Europe (eCAADe 2018), Lodz, Poland, September 19-21, 2018. Download Marius Hoggenmueller, Alexander Wiethoff, Martin Tomitsch Designing Low-Res Lighting Displays as Ambient Gateways to Smart Devices In Proceedings of the The Seventh ACM International Symposium on Pervasive Displays (PerDis), Munich, Germany, June 6-8, 2018. ACM, New York, NY, USA. Download Beat Rossmy, Alexander Wiethoff COMB - A Modular Low-Resolution Display to Support Electronic Musical Pre-Education In Proceedings of the 7th ACM International Symposium on Pervasive Displays (PerDis '18). Association for Computing Machinery, New York, NY, USA, Article 24, 1-2. DOI:https://doi.org/10.1145/3205873.3210700 | Best Conference-Demo Award (bib) Download Marius Hoggenmueller, Martin Tomitsch, Alexander Wiethoff Understanding Artefact and Process Challenges for Designing Low-Res Lighting Displays In Proceedings of the 36th SIGCHI Conference on Human Factors in Computing Systems (CHI '18). Montreal, Canada, April 21 - 26, 2018. ACM, New York, NY, USA. 2017 Download Alexander Wiethoff, Marius Hoggenmueller Experiences Deploying Hybrid Media Architecture in Public Environments Chapter article in the Book Media Architecture: Using Information and Media as Construction Material - de Gruyter Mouton, March 2017, Berlin, Germany. Download Alexander Wiethoff, He",
  "content_length": 31621,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:48"
}