{
  "name": "Alex Rogers",
  "homepage": "https://www.cs.ox.ac.uk/people/alex.rogers",
  "status": "success",
  "content": "Prof. Alex Rogers · Prof Alex Rogers I am a Professor of Computer Science at the University of Oxford and a Tutorial Fellow at St. Anne’s College. I am currently the Co-Director of the Autonomous Intelligent Machines and Systems Centre for Doctoral Training (AIMS CDT) and a member of the Cyber Physical Systems research group. Research My research applies artificial intelligence and machine learning within physical sensor systems to address real-world problems focusing on sustainability. My recent work has addressed future energy systems, such as the smart grid, citizen science platforms, and environmental monitoring, and typically involves the real-world deployment of novel approaches in devices, smartphones or the cloud. My current work addresses smart building energy management and the development of low-cost conservation technology. I have previously supervised 27 PhD students to completion, and am currently supervising Stephen Ellis. Biography I originally studied Physics at Durham University before joining Schlumberger as a wireline logging engineer. After five years working in various oilfields around the world I took suspended employment to study for a PhD in Computer Science applying statistical physics to models of evolving populations. Upon completing my PhD I worked for BiosGroup, a spin-out from the Santa Fe Institute applying complexity science to business problem, before returning to academia, initially at the University of Southampton, and now at the University of Oxford. Teaching I currently teach Computer Architecture. I am happy to supervise UG and MSc projects in the areas of sensor systems, computer architecture and physical computing (particularly those that also involve some aspect of artificial intelligence or machine learning). Consultancy I am always interested in assisting organisations, and particularly start-ups, in deploying artificial intelligence, machine learning and sensor systems to address real-world problems.",
  "content_length": 1978,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:13"
}