{
  "name": "Alexandros Potamianos",
  "homepage": "http://cvsp.cs.ntua.gr/potam",
  "status": "success",
  "content": "Computer Vision, Speech Communication & Signal Processing Group skip to: page content | links on this page | site navigation | footer (site information) Computer Vision, Speech Communication & Signal Processing Group NTUA | ECE Home About Us People Research Publications Courses Software News search Faculty | PhD Students | Collaborators Journal | Book Chapters | Conference Undergraduate | Graduate | Diploma Theses Home / People / Alexandros Potamianos Alexandros Potamianos Alexandros Potamianos Assoc. Professor Office: 2.1.4 Phone: (+30) 210772-4709 Fax: (+30) 210772-3397 E-mail: potam@central addresses are formatted username@central.ntua.gr URL: http://www.potam.com Biosketch Alexandros Potamianos received the Diploma in Electrical and Computer Engineering from the National Technical University of Athens, Greece in 1990. He received the M.S and Ph.D. degrees in Engineering Sciences from Harvard University, Cambridge, MA, USA in 1991 and 1995, respectively. He received the M.B.A. degree from Stern School of Business, NYU in 2002. From 1991 to June 1993 he was a research assistant at the Robotics Lab, Harvard University. From 1993 to 1995 he was a research assistant at the Digital Signal Processing Lab at Georgia Tech. From 1995 to 1999 he was a Senior Technical Staff Member at the Speech and Image Processing Lab, AT&T Shannon Labs, Florham Park, NJ. From 1999 to 2002 he was a Technical Staff Member and Technical Supervisor at the Multimedia Communications Lab at Bell Labs, Lucent Technologies, Murray Hill, NJ. From 1999 to 2001 he was an adjunct Assistant Professor at the Department of Electrical Engineering of Columbia University, New York, NY. From 2003 to 2013 he was an adjunct Associate Professor at the Department of Electronic and Computer Engineering of Technical University of Crete, Chania, Greece. In the summer of 2013, he joined the School of Electronical and Computer Engineering at the National Technical University of Athens, Athens, Greece as an associate professor. His current research interests include speech processing, analysis, synthesis and recognition, dialog and multi-modal systems, lexical semantics, nonlinear signal processing, natural language understanding, artificial intelligence and multimodal child-computer interaction. Prof. Potamianos has authored or co-authored over 110 papers in professional journals and conferences (citations: 2700, h-index: 25, in google scholar as of Sept 2013). He is the co-author of the paper \"Creating conversational interfaces for children\" that received a 2005 IEEE Signal Processing Society Best Paper Award. He is the co-editor of the book \"Multimodal Processing and Interaction: Audio, Video, Text\", Springer, 2008. He holds four patents. He has been a member of the IEEE Signal Processing Society since 1992 and a senior member since 2010. He is currently serving his third term at the IEEE Speech and Language Technical Committee and his first term at the IEEE Multimedia Signal Processing Committee. Last modified: Wednesday, 16 October 2013 | Created by Nassos Katsamanis and George Papandreou",
  "content_length": 3098,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:02"
}