{
  "name": "Alexandros Stamatakis",
  "homepage": "http://www.exelixis-lab.org",
  "status": "success",
  "content": "The Exelixis Lab The Exelixis Lab Research Publications Software Teaching Talks Outreach People Jobs Contact Us The Exelixis Lab Enabling Research in Evolutionary Biology Our Mission - Enable Research in Evolutionary Biology Our focus is on the evolution of hardware and parallel computer architectures as well as on the evolution of molecular sequences. We understand Bioinformatics as a discipline that develops algorithms, models, and tools that help Biologists to generate new biological insights and knowledge. We try to bridge the gap between the world of systematics and the world of high performance computing. Due to the increasing descrepancy between the pace of molecular data accumulation and increase in CPU speeds (which is much slower), which we call the \"Bio-Gap\" we feel that the time has come to establish parallel computing as standard technique in Bioinformatics. 2025 Computational Molecular Evolution Summer School in Crete Applications for the 2025 summer school on computational molecular evolution in Heraklion, Crete are now open. Application deadline: November 1st, 2024 New Software Pandora Uncertainty estimation toolkit for dimensionality reduction on population genetics data. It is available for download here. Pythia A tool to predict the difficulty of phylogenetic analysis of Multiple Sequence Alignments (MSA). It is available for download here. Lagrange-NG Attention Biogeographers! We just released Lagrange-NG, a re-design of the popular Lagrange tool: it's faster, runs in parallel, and has better code quality: SoftWipe A tool and benchmark for assessing adherence of scientific software to coding quality standards. It is available for download here. NetRAX A tool for accurate and fast maximum likelihood based inference of phylogenetic networks. It is available for download here. SpeciesRax A tool for maximum likelihood species tree inference from gene family trees under duplication, transfer, and loss. It is available for download here. SCRAPP Species Counting on Reference trees viA Phylogenetic Placements - bridging the gap between phylogenetic placement results and alpha diversity metrics, with the possibility of further in-depth analysis. It is available for download here RootDigger RootDigger uses a non-reversible Markov model to compute the most likely root location on a given tree. It is available for download here GeneRax: Species tree-aware maximum likelihood based gene tree inference under gene duplication, transfer, and loss Our first tool for gene tree species tree reconciliation. Open-source code is available here, a respective preprint can be found here. ParGenes: massively parallel inference of gene trees A tool for massively parallel model selection and phylogenetic tree inference on thousands of genes using thousands of cores, based on ModelTest-NG and RAxML-NG. Now published in Bionformatics and available for download here. RAxML-NG Web-Server The brand new web-server for the completely re-designed version of RAxML, called RAxML-NG is available here. RAxML-NG The latest version of RAxML-NG, the complete re-design of RAxML can be found at Alexey's github repository. RAxML questions, help & bug reports: please use the RAxML google group The respective paper can be found here Students from KIT We are always looking for student programmers (HiWis) and students interested in doing bachelor/master theses projects with us. If you are interested please send an email to Alexis at Alexandros dot Stamatakis at h hyphen its dot org New Papers Our 5 Most Recent Papers/Preprints Oleksiy Kozlov, Alexandros Stamatakis. \"EcoFreq: Compute with Cheaper, Cleaner Energy via Carbon-Aware Power Scaling\", In Proceedings of the 39th ISC High Performance conference, Hamburg, Germany, May 12-16, 2024. open access Josefin Stiller, Shaohong Feng, Al-Aabid Chowdhury, Iker Rivas-González, David A. Duchêne, Qi Fang, Yuan Deng, Alexey Kozlov, Alexandros Stamatakis, Santiago Claramunt, Jacqueline M. T. Nguyen, Simon Y. W. Ho, Brant C. Faircloth, Julia Haag, Peter Houde, Joel Cracraft, Metin Balaban, Uyen Mai, Guangji Chen, Rongsheng Gao, Chengran Zhou, Yulong Xie, Zijian Huang, Zhen Cao, Zhi Yan, Huw A. Ogilvie, Luay Nakhleh, Bent Lindow, Benoit Morel, Jon Fjeldså, Peter A. Hosner, Rute R. da Fonseca, Bent Petersen, Joseph A. Tobias, Tamás Székely, Jonathan David Kennedy, Andrew Hart Reeve, Andras Liker, Martin Stervander, Agostinho Antunes, Dieter Thomas Tietze, Mads Bertelsen, Fumin Lei, Carsten Rahbek, Gary R. Graves, Mikkel H. Schierup, Tandy Warnow, Edward L. Braun, M. Thomas P. Gilbert, Erich D. Jarvis, Siavash Mirarab & Guojie Zhang . \"Complexity of avian evolution revealed by family-level genomes\", online version Julia Haag, Alexander I. Jordan, Alexandros Stamatakis, \"Pandora: A Tool to Estimate Dimensionality Reduction Stability of Genotype Data\", preprint at bioRxiv Julius Wiegert, Dimitri Höhler, Julia Haag, Alexandros Stamatakis, \"Predicting Phylogenetic Bootstrap Values via Machine Learning\", preprint at bioRxiv Johanna Trost, Julia Haag, Dimitri Höhler, Laurent Jacob, Alexandros Stamatakis, Bastien Boussau. \"Simulations of Sequence Evolution: How (Un)realistic They Are and Why\", Molecular Biology and Evolution, 2024, open access All publications >> Collaborative Project with Cyprus Eco-evolutionary dynamics on Cyprus: a multitaxon approach to population differentiation within an isolated island We are participating at this joint research project with colleagues from Cyprus and Greece. For further information please visit the project website.",
  "content_length": 5565,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:01"
}