{
  "name": "Alexander Gumennik",
  "homepage": "https://fames.indiana.edu",
  "status": "success",
  "content": "FAMES Lab: Indiana University Bloomington Latest NewsFAMES Lab takes FOX59/CBS4 on an exclusive tour of their facilitiesMore news Virtual Tour of the FAMES Lab FacilityOverview of the FacilityRead more about the building, the work spaces, and the equipment of the FAMES Lab facility.Virtual TourEmbark on a 360° virtual field trip of the facility and its equipment from the comfort of your desk.Welcome to the FAMES Lab!About UsThe Fibers and Additive Manufacturing Enabled Systems Laboratory (FAMES Lab) established by Prof. Alexander Gumennik in 2016, is part of the Department of Intelligent Systems Engineering (ISE) at Indiana University Bloomington. Our laboratory, located at the Multidisciplinary Engineering and Science Hall (MESH), consists of approximately 3000 square feet of clean rooms, optical laboratories, and manufacturing facilities with innovative highly customized equipment. It includes a high-bay area, which houses one of the most elaborate specialty-fiber drawing towers worldwide. The cleanroom facility of was commissioned on November 14, 2019. Video: Time lapse of the FAMES Lab Construction.The vision of the ISE FAMES Lab is to provide an efficient interface, linking the cyberspace with the physical world. This is done by an engineering of fibers and fabrics, embedding ensembles of nanotransducers and sensors, that would listen, watch, smell, and palp their surroundings and communicate their sensations to a computer.Our team develops a novel hybrid manufacturing technique to attain this vision. We begin with the three-dimensional printing of fiber preforms – the scaled-up replicas of the desired fiber devices. In a preform, the materials, such as metals, insulators, semiconductors, piezoelectrics, and non-linear optical media, are architecturally arranged to meet the desired functionality. Next, we thermally draw fibers from these preforms. Finally, we axially structure the fiber cores by means of controlled capillary instability into discrete integrated devices densely packed into the hosting fiber. Our online visitors are invited to read more on our publications webpage.Our fibers warped into fabric will provide a basis for a new type of apparel that would monitor and regulate the comfort and health of its consumer. Moreover, our fibers will provide technological and scientific advances in multiple areas, such as green energy, environmental monitoring, biosynthetic electronics, tissue engineering, additive manufacturing, and fluid dynamics research.To students, we provide a variety of training in modern technological tools combining additive manufacturing, material sciences, optics, nanoengineering, and bio-engineering, including courses in ENGR-E 537: Rapid Prototyping for Engineers and ENGR-E 505: Intro to Nano-Engineering.The laboratory combines basic research with R&D of products, applying industry work culture and project management practices to academic environment. The laboratory is open for close work with industrial customers to turn their ides into viable products for mass production.If you have any questions, do not hesitate to  contact us.NewsFAMES Lab takes FOX59/CBS4 on an exclusive tour of their facilitiesNew Contribution to Cutting-Edge Fiber Technology: FAMES Lab Chapter on VLSI-FiPatent US12102734B2, Methods for Creating Three-Dimensional Biosynthetic Tissue GrantedAlexander Gumennik and Camila Faccini de Lima publish in Advanced Engineering MaterialsNew Publication Highlights Multimodal Fiber Antenna for Stress and Proximity SensingMore news FAMES Lab 2151 Multidisciplinary Engr. & Sci. Hall2425 North Milo B. Sampson LaneBloomington, IN 47408, United States FAMES Lab social media channels Quick Links Affoa",
  "content_length": 3706,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:23"
}