{
  "name": "Alexander Pretschner",
  "homepage": "https://www22.in.tum.de/en/mitarbeiter/pretschner",
  "status": "success",
  "content": "Startseite - Lehrstuhl für Software und Systems Engineering Carousel pausieren Carousel starten Vorheriger Slide Nächster Slide Slide 1 von 7 Willkommen am Lehrstuhl für Software & Systems Engineering Unsere Mission Die Schwerpunkte unserer Forschung und Lehre liegen im Software-Engineering mit dem Fokus Qualität, derzeit an der Schnittstelle von Informations- und Funktionssicherheit: Ansätze, Technik, Methoden und Werkzeuge. Zu unseren zentralen Arbeitsgebieten gehören derzeit insbesondere das Testen, verschiedene Aspekte der Informationssicherheit, Softwarewartung und Kausalitätsanalyse / Accountability. Lehre Lehre Offene Stellen / Promotion / Abschlussarbeiten PostDoc-Forscher*in Bitte senden Sie uns Ihre Bewerbung als PDF-Datei (einschließlich Lebenslauf, Publikationsliste und Zeugnisse) über unser Formular; Doktorand*in (Ph. D.) Sie sind daran interessiert, am Lehrstuhl für Software & Systems Engineering zu promovieren? Prima! Bitte füllen Sie das folgende Formular aus, um uns die notwendigen Informationen zukommen zu lassen. Wir werden Sie bald kontaktieren! Promotion (Ph. D.) an unserem Lehrstuhl Es gibt außerdem offene Stellen bei fortiss und am CDTM Tutor und HiWi Wir suchen mehrere Hilfswissenschaftler (HiWis) für interessante Forschungsprojekte im Bereich Software Engineering, sowie Tutoren zur Unterstützung in der Lehre! Mehr Informationen gibt es hier. Bachelor's / Master's Thesis Wir haben aktuell mehrere offene Themen für mögliche Abschlussarbeiten. Wir bieten KEINE Praktika an! Research and Projects Accountability and Causality Scenario-based Testing of Autonomous CPS Integration Testing and Regression Test Optimization Software Maintainability Hardening and Security-Configuration Management and more.... Publications and Publishing We regularly publish at top-ranked conferences and journals - see the list of our publications Ready for publishing yourself? Consider these journals:  The Journal of Software Testing, Verification and Reliability , The Journal of Software and Systems Modeling Unsere Partner Neben verschiedenen Industriekooperationen sind wir außerdem Teil von: bidt fortiss CDTM Elitestudienprogramm \"Software Engineering\" Summer School Marktoberdorf To top Informatik 4 - Lehrstuhl für Software und Systems Engineering Prof. Dr. Alexander Pretschner Prof. Dr. Dr. h.c. Manfred Broy Prof. Dr. Dr.-Ing. E.h. Ernst Denert Prof. Dr. Karl-Rudolf Moll Prof. Dr. Dr. h. c. mult. Heinz Schwärtzel Aktuelles 27.11.2025 Refining Code Coverage to Better Reflect Fuzzing Performance 17.03.2025 OneTutor in bayernweiter Erprobung 17.03.2025 Checkable Safety Arguments – A Modeling Framework Supporting the Maintenance of Safety Arguments Consistent with System Development Artifacts 20.09.2024 A Holistic Methodology for Quality Assessment of Intrusion Detection Systems 13.09.2024 Designing People Analytics for Data Sovereigns",
  "content_length": 2881,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:38"
}