{
  "name": "Alexandra Jimborean",
  "homepage": "http://webs.um.es/alexandra.jimborean",
  "status": "success",
  "content": "inicio [ALEXANDRA JIMBOREAN] Menú principal Menú principal Página de Inicio Docencia Investigación Contacto Hello! I am Associate Professor (Titular de Universidad) working in the area of compilers and software-hardware co-designs. Previously I held a Ramon y Cajal researcher position at the University of Murcia (2020-2025) and affiliated Associate Professor at Uppsala University, Sweden. I received my PhD from the University of Strasbourg, France in 2012 researching on automatic parallelization of loops enabled by the compiler. I continued with a post-doc in Sweden, Uppsala, where I became Assistant Professor in 2015 and got tenured as Associate Professor in 2018. In 2019, I was awarded the Ramón y Cajal grant and started as researcher at University of Murcia, Spain in May 2020. My main research interests are compile-time code analysis and optimization and software-hardware co-designs for performance, energy-efficiency, and security. In particular, my research focuses on compiler techniques to analyze memory access patterns which we then leverage for optimizing software for the emerging architectures. I am actively involved in conference organization – most notably I acted as Program Chair of the International Conference on Code Generation and Optimization in 2019 and of the International Conference on Compiler Construction in 2020 – I was part of the organization committee of numerous conferences and workshops, and reviewed for over 30 journals, conferences, and workshops in compilers and computer architecture. To transfer our research results to industry, we have opened source our DAEDAL and Clairvoyance compiler technology for energy saving through an agreement with the EtaScale start-up company in Sweden. I am member of the HiPEAC network of excellence and of the ACM network. inicio.txt Última modificación: 2025/08/01 09:41por alexandra.jimborean@um.es",
  "content_length": 1889,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:50"
}