{
  "name": "Alexey A. Koloydenko",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/alexey-koloydenko",
  "status": "success",
  "content": "Alexey Koloydenko - Royal Holloway Research Portal Alexey Koloydenko, A Dr Senior Lecturer in Statistics / Probability Theory, Department of MathematicsStatistics and Probability Phone+44 1784 276421EmailAlexey.Koloydenkorhul.acuk TW20 0EX Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 23 Article 8 Conference contribution 1 Chapter 1 Doctoral Thesis Research output per year Research output per year Diagnostic accuracy of autofluorescence-Raman spectroscopy for surgical margin assessment during Mohs micrographic surgery of basal cell carcinomaBoitor, R. A., Varma, S., Sharma, A., Odedra, S., Elsheikh, S., Eldib, K., Patel, A., Koloydenko, A., Gran, S., De Winne, K., Koljenovic, S., Williams, H. C. & Notingher, I., 13 May 2024, (E-pub ahead of print) In: British Journal of Dermatology. 18 p.Research output: Contribution to journal › Article › peer-review Open AccessFile 40 Downloads (Pure) Ex-vivo assessment of basal cell carcinoma surgical margins in Mohs surgery by autofluorescence-Raman spectroscopy: a pilot studyBoitor, R., Varma, S., Sharma, A., Elsheikh, S., Kulkarni, K., Eldib, K., Jerrom, R., Odedra, S., Patel, A., Koloydenko, A., Williams, H. & Notingher, I., 4 Jun 2024, In: Journal of the European Academy of Dermatology and Venerology. 3, 2, p. 498-507 10 p.Research output: Contribution to journal › Article › peer-review Open Access Intraoperative spectroscopic evaluation of sentinel lymph nodes in breast cancer surgeryBarkur, S., Boitor, R. A., Mihai, R., Raja Gopal, N. S., Leeney, S., Koloydenko, A. A., Khout, H., Rakha, E. & Notingher, I., Aug 2024, In: Breast Cancer Research. 207, p. 223-232 10 p.Research output: Contribution to journal › Article › peer-review Open AccessFile 23 Downloads (Pure) Shape analysis of AF segments for rapid assessment of Mohs layers for BCC presence by AF-Raman microscopyKoloydenko, A., Notingher, I., Boitor, R. & Lember, J., 12 Jul 2024, Developments in Statistical Modelling (IWSM 2024). Springer, [Cham], p. 211-217 7 p. (Contributions to Statistics).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 15 Downloads (Pure) Clinical Integration of Fast Raman spectroscopy for Mohs micrographic surgery of basal cell carcinomaBoitor, R., de Wolf, C., Weesie, F., Shipp, D., Varma, S., Veitch, D., Wernham, A., Koloydenko, A., Puppels, G., Nijsten, T., Williams, H. C., Caspers, P. & Notingher, I., 11 Mar 2021, In: Biomedical Optics Express. 12, 4, p. 2015-2026 12 p.Research output: Contribution to journal › Article › peer-review Open Access View all 33 research outputs Projects 4 Finished Projects per year Statistical analysis and modelling of bi-modal autofluorescence-Raman imaging for efficient diagnosis and treatment of biological tissuesKoloydenko, A. (PI) & Notingher, I. (CoI)Eng & Phys Sci Res Council EPSRC23/11/22 → 23/07/24Project: Research Support for collaborative research Dr J LemberKoloydenko, A. (PI)London Mathematical Society18/10/16 → 30/10/16Project: Research Fast diagnosis of basal cell carcinoma during Mohs micrographic surgeryKoloydenko, A. (PI)University of Nottingham1/07/14 → 30/06/16Project: Research Raman spectral imaging for automated Mohs micrographic surgery of high-risk basal cell carcinomaKoloydenko, A. (PI)National Institute for Health Research1/06/10 → 30/06/14Project: Research",
  "content_length": 3964,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:05"
}