{
  "name": "Alexander Mehler",
  "homepage": "https://www.texttechnologylab.org/team/alexander-mehler",
  "status": "success",
  "content": "Prof. Dr. Alexander Mehler – Text Technology Lab Skip to content No results Prof. Dr. Alexander Mehler Fachbereich für Informatik und MathematikGoethe-Universität Frankfurt am MainRobert-Mayer-Straße 10Raum 403D-60325 Frankfurt am MainD-60054 Frankfurt am Main (use for package delivery) Postfach / P.O. Box: 154Tel: *protected email*Fax: *protected email*Mail: *protected email* Office Hour Thursday, 10 – 12 AM (make an appointment) Follow me on ResearchGate. Alexander Mehler is professor of Computational Humanities / Text Technology at Goethe University Frankfurt where he heads the Text Technology Lab (TTLab). He belonged to the executive committee of the German Society for Computational Linguistics & Language Technology where he headed the research group on Quantitative Corpus Linguistics. Alexander Mehler was head of the research group Computational Semiotics of the German Society of Semiotics and belonged to the executive committee of the LOEWE Priority Program Digital Humanities. He was member of the executive committee of the Center for Digital Research in the Humanities, Social Sciences and Education Sciences (CEDIFOR). Alexander Mehler is a founding member of the German Society for Network Research (DGNet). His research interests include the quantitative analysis, simulative synthesis and formal modeling of textual units in spoken and written communication. To this end, he investigates linguistic networks based on contemporary and historical languages (using models of language evolution). A current research interest of Alexander Mehler concerns 4D text technologies based on Virtual Reality (VR), Augmented Reality (AR) and Augmented Virtuality (AV). Projects Semiautomated Thematic Text Classification as a Basis for Corpus Linguistic Value-Added Services. 2024 – . Funded by DFG (531750631). Description The goal of the DFG-funded project “Semiautomated Thematic Text Classification as a Basis for Corpus Linguistic Value-Added Services” aims to develop a deep-learning-based system for topic classification using the Wikipedia category system and data from the Wikidata project in order to develop and test topic models for the automatic classification of texts, including those from the Leibniz Institute for the German Language (IDS) in Mannheim, on the basis of this classification system. The project is being carried out in collaboration with the IDS and the Saxon Academy of Sciences in Leipzig. The research focus is on state-of-the-art AI methods, in particular generative AI methods. BibTeX @project{pr-semi-automated_thematic_text_classification, name = {Semiautomated Thematic Text Classification as a Basis for Corpus Linguistic Value-Added Services}, abstract = {The goal of the DFG-funded project “Semiautomated Thematic Text Classification as a Basis for Corpus Linguistic Value-Added Services” aims to develop a deep-learning-based system for topic classification using the Wikipedia category system and data from the Wikidata project in order to develop and test topic models for the automatic classification of texts, including those from the Leibniz Institute for the German Language (IDS) in Mannheim, on the basis of this classification system. The project is being carried out in collaboration with the IDS and the Saxon Academy of Sciences in Leipzig. The research focus is on state-of-the-art AI methods, in particular generative AI methods.}, year = {2024}, keywords = {current_project}, funded_by = {DFG (531750631)}, funded_by_url = {https://gepris.dfg.de/gepris/projekt/531750631} } ENTAILab - Research Infrastructure and Innovation Lab. 2024 – . Funded by DFG (539634240). Description The DFG Infrastructure Priority Program New Data Spaces for the Social Sciences (InfPP) was established in order to meet the challenges of traditional survey research and to make use of newly available data sources. The ENTAILab as the central feature of the InfPP offers infrastructure services, excellent research opportunities and will promote the dissemination of results into existing and emerging research and data provision programs. There are clear upscaling and synergy effects of ENTAILab for the projects within the InfPP, leading to opportunities and successful realizations that - partly due to high costs for individual projects and a lack of infrastructural equipment - would otherwise not exist. By providing the infrastructure for a range of projects at the same time, e.g. the connection to existing data, samples and panels, server capacities, code and tools, expert counseling, and research overviews, we make use of synergies and create added value, while at the same time conducting cross-cutting research on these infrastructures. The measures combined in ENTAILab represent the central and unifying element for the research and development and transfer activities of the priority program. ENTAILab will unlock and sustainably use emerging opportunities of the new data spaces and to meet the requirements of the InfPP in general. BibTeX @project{spp-2431-entailab, name = {ENTAILab - Research Infrastructure and Innovation Lab}, abstract = {The DFG Infrastructure Priority Program New Data Spaces for the Social Sciences (InfPP) was established in order to meet the challenges of traditional survey research and to make use of newly available data sources. The ENTAILab as the central feature of the InfPP offers infrastructure services, excellent research opportunities and will promote the dissemination of results into existing and emerging research and data provision programs. There are clear upscaling and synergy effects of ENTAILab for the projects within the InfPP, leading to opportunities and successful realizations that - partly due to high costs for individual projects and a lack of infrastructural equipment - would otherwise not exist. By providing the infrastructure for a range of projects at the same time, e.g. the connection to existing data, samples and panels, server capacities, code and tools, expert counseling, and research overviews, we make use of synergies and create added value, while at the same time conducting cross-cutting research on these infrastructures. The measures combined in ENTAILab represent the central and unifying element for the research and development and transfer activities of the priority program. ENTAILab will unlock and sustainably use emerging opportunities of the new data spaces and to meet the requirements of the InfPP in general.}, year = {2024}, keywords = {current_project}, funded_by = {DFG (539634240)}, funded_by_url = {https://gepris.dfg.de/gepris/projekt/539634240}, url = {https://www.new-data-spaces.de/de-de/Start/Infrastructure-Priority-Programme/ENTAILab}, logo = {/wp-content/uploads/2024/01/logo-NewDataSpaces-long.png} } Durchführbarkeit, Akzeptanz und Datenqualität neuer multimodaler Erhebungen (FACES). 2024 – . Funded by DFG (539621548). Description Das Projekt eröffnet einen neuen multimodalen Datenraum für die Umfrageforschung aus einer survey-analytischen und einer informatischen Perspektive. Dieser Datenraum wird jüngste Innovationen im Bereich der VR und der KI nutzen und weiterentwickeln, um Face-to-Face-Interviews zu ersetzen und so das Problem der steigenden Kosten und sinkenden Rücklaufquoten interviewerbasierter Erhebungen zu lösen. Zu diesem Zweck wird ein Multi-Interface-System für Online-Befragungen auf der Grundlage von VR und Mixed Reality entwickelt und durch eine Reihe von Experimenten und eingehenden Vergleichen mit videobasierten Methoden getestet und bewertet. Das System wird ein breites Spektrum an Variabilität in Bezug auf Avatare und situative Parameter von Interviews, Schnittstellen und KI-Technologien zur automatischen Verarbeitung von Sprach- und Verhaltensdaten aufweisen. Dabei werden systematisch avatar-basierte, menschengesteuerte Lebensumfragen mit videobasierten Lebensumfragen verglichen. Bei ersteren werden die Verhaltensfreiheitsgrade der Interaktanten durch die Wahl der Avatare deutlich erweitert. Aufgrund der großen Anzahl möglicher Merkmalskombinationen wird auf zwei Arten vorgegangen: (1) die Auswirkungen von Avatar- und Situationsmerkmalen werden in Experimenten untersucht, um eine Vorauswahl zu treffen; (2) es werden vielversprechende Merkmalskombinationen identifiziert und unter realen Bedingungen (reale Interviews) getestet. Wir werden drei Forschungsfragen behandeln: RQ1: Was sind die Vorteile von avatar-basierten Interviews im Vergleich zu videobasierten Interviews in Bezug auf Akzeptanz, Machbarkeit und Datenqualität? RQ2: Welche Interviewereffekte werden durch welche Kombinationen von Merkmalen reduziert und wie interagieren sie? RQ3: Wie können die Ergebnisse in eine Theorie integriert werden, die das Training von automatisierten, vollständig immersiven virtuellen Interviewern darstellt? Zur Beantwortung der Fragen geht das Projekt über bestehende Studien hinaus und betrachtet vier Szenarien. In den Szenarien 2 und 3 ist das multimodale Verhalten der befragten Person noch aktiv, kann aber nicht wie in Szenario 1 aufgezeichnet werden. Die Szenarien 1-3 werden mit Szenario 4 verglichen, um die Auswirkungen von Avataren zu untersuchen. Sie unterscheiden sich durch den Grad der Immersion des Befragten und ermöglichen Betrachtungen zum Einfluss von Avataren in (teil-)virtualisierten Interviews, während Szenario 1 die zusätzliche Untersuchung des Proteus-Effekts ermöglicht. Die Szenarien 1-2 werden experimentell untersucht, die Szenarien 3-4 zusätzlich auch unter realen Interviewbedingungen mit ehemaligen NEPS SC3 Teilnehmern. Auf diese Weise wird das Projekt das erste sein, das Selbst- und Fremd-Avatar-Effekte, sowohl in Bezug auf Avatar-Eigenschaften als auch im Vergleich zu klassischen Interviews untersucht. Da im Rahmen des Projekts ein Open-Source-System entwickelt wird, wird es den Weg für künftige Avatar-basierte Lebensumfragen ebnen. BibTeX @project{spp-2431-faces, name = {Durchführbarkeit, Akzeptanz und Datenqualität neuer multimodale",
  "content_length": 429738,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:32"
}