{
  "name": "Alexey Gotsman",
  "homepage": "http://software.imdea.org/~gotsman",
  "status": "success",
  "content": "Alexey Gotsman's Home Page Alexey Gotsman Research Professor IMDEA Software Institute Campus Montegancedo s/n 28223-Pozuelo de Alarcón, Madrid, Spain Tel.: +34-91-101-2202 ext 4136 @ Email: Alexey.Gotsman imdea.org I am a tenured Research Professor at the IMDEA Software Institute. I also work part-time as a visiting academic at Amazon Web Services. Before joining IMDEA I was a postdoctoral fellow at the University of Cambridge, where I also got my Ph.D. My research interests are at the intersection of software verification and distributed computing. Recent publications Fedor Ryabinin, Alexey Gotsman, and Pierre Sutra Making democracy work: Fixing and simplifying Egalitarian Paxos [PDF] OPODIS'25: International Conference on Principles of Distributed Systems Extended version available on arXiv [PDF] Sadegh Keshavarzi, Gregory Chockler, and Alexey Gotsman TEE is not a healer: Rollback-resistant reliable storage [PDF] DISC'25: International Symposium on Distributed Computing Extended version available on arXiv [PDF] Alejandro Naser-Pastoriza, Gregory Chockler, Alexey Gotsman, and Fedor Ryabinin Tight bounds on channel reliability via generalized quorum systems [PDF] PODC'25: Symposium on Principles of Distributed Computing Extended version available on arXiv [PDF] Fedor Ryabinin, Alexey Gotsman, and Pierre Sutra Brief announcement: Revisiting lower bounds for two-step consensus [PDF] PODC'25: Symposium on Principles of Distributed Computing Extended version available on arXiv [PDF] Manuel Bravo, Gregory Chockler, Alexey Gotsman, Alejandro Naser-Pastoriza, and Christian Roldán Vertical atomic broadcast and passive replication [PDF] DISC'24: International Symposium on Distributed Computing Extended version available on arXiv [PDF] Manuel Bravo, Gregory Chockler, and Alexey Gotsman Liveness and latency of Byzantine state-machine replication [PDF] Distributed Computing, 37(2). Springer, 2024. Journal version of our DISC'22 paper. Fedor Ryabinin, Alexey Gotsman, and Pierre Sutra SwiftPaxos: Fast geo-replicated state machines [PDF] [Code] NSDI'24: Symposium on Networked Systems Design and Implementation Alejandro Naser-Pastoriza, Gregory Chockler, and Alexey Gotsman Fault-tolerant computing with unreliable channels [PDF] OPODIS'23: International Conference on Principles of Distributed Systems Extended version available on arXiv [PDF] Best paper award Manuel Bravo, Gregory Chockler, and Alexey Gotsman Liveness and latency of Byzantine state-machine replication [PDF] DISC'22: International Symposium on Distributed Computing Extended version available on arXiv [PDF] Manuel Bravo, Gregory Chockler, and Alexey Gotsman Making Byzantine consensus live [PDF] Distributed Computing, 35(6). Springer, 2022. Journal version of our DISC'20 paper. Joseph Izraelevitz, Gaukas Wang, Rhett Hanscom, Kayli Silvers, Tamara Silbergleit Lehman, Gregory Chockler and Alexey Gotsman Acuerdo: Fast atomic broadcast over RDMA [PDF] ICPP'22: International Conference on Parallel Processing Manuel Bravo, Alexey Gotsman, Borja de Régil, and Hengfeng Wei UniStore: A fault-tolerant marriage of causal and strong consistency [PDF] USENIX ATC'21: USENIX Annual Technical Conference Extended version available on arXiv [PDF] Vitor Enes, Carlos Baquero, Alexey Gotsman, and Pierre Sutra Efficient replication via timestamp stability [PDF] [Code] EuroSys'21: European Conference on Computer Systems Extended version available on arXiv [PDF] Gregory Chockler and Alexey Gotsman Multi-shot distributed transaction commit [PDF] Distributed Computing, 34(4). Springer, 2021. Journal version of our DISC'18 paper. Hagit Attiya, Sebastian Burckhardt, Alexey Gotsman, Adam Morrison, Hongseok Yang, and Marek Zawirski Specification and space complexity of collaborative text editing [PDF] Theoretical Computer Science, 855. Elsevier, 2021. Journal version of our PODC'16 paper. Manuel Bravo, Gregory Chockler, and Alexey Gotsman Making Byzantine consensus live [PDF] DISC'20: International Symposium on Distributed Computing Extended version available on arXiv [PDF] Vitor Enes, Carlos Baquero, Tuanir França Rezende, Alexey Gotsman, Matthieu Perrin, and Pierre Sutra State-machine replication for planet-scale systems [PDF] EuroSys'20: European Conference on Computer Systems Extended version available on arXiv [PDF] All publications Research group Fedor Ryabinin, Postdoc Alejandro Naser Pastoriza, PhD student Antonio José Fernández Pinto, PhD student I have postdoc, PhD student and intern positions available. Apply here under \"Open Call\" and mention my name in the application documents. Alumni: Fedor Ryabinin (PhD student [Thesis]) Artem Khyzha (PhD student [Thesis]), now a verification engineer at ARM, UK Vitor Enes (PhD student [Thesis]), now in industry Giovanni Bernardi (postdoc), now a faculty member at the University of Paris 7, France Manuel Bravo (postdoc), now a researcher at Informal Systems, Spain Andrea Cerone (postdoc), now in industry Álvaro García Pérez (postdoc), now a researcher at CEA, France Joe Izraelevitz (postdoc), now a faculty member at University of Colorado Boulder, USA Matthieu Perrin (postdoc), now a faculty member at the University of Nantes, France Yuri Meshman (postdoc), now in industry Christian Roldán (postdoc), now in industry Activities Recent programme committees: SIROCCO'26, DISC'25, OPODIS'25, DISC'24, OSDI'24, POPL'24, ESOP'24, PODC'23, OPODIS'22, SSS'22, Middleware'22, PaPoC'22, PODC'21, CONCUR'21, OPODIS'21, PODC'20, POPL'20 Co-organizer: International Symposium on Distributed Computing (DISC), 2024 Co-chair: International Conference on Formal Techniques for Distributed Objects, Components, and Systems (FORTE), 2020 Co-organizer: Dagstuhl seminar \"Data Consistency in Distributed Systems: Algorithms, Programs, and Databases\", 2018 Co-chair: Workshop on Principles and Practice of Consistency for Distributed Data (PaPoC) 2017, affiliated with EuroSys Funding ERC Starting Grant \"RACCOON: A Rigorous Approach to Consistency in Cloud Databases\", 2017-2022 Ramón y Cajal Fellowship, 2017-2022 I was the coordinator of an EU project ADVENT (2013-2016), funded through the FP7 FET Young Explorers scheme Teaching Summer School on Distributed and Replicated Environments, 2025 Summer School on Practice and Theory of Distributed Computing, 2020 and 2023 Summer School on Verification Technology, Systems & Applications, University of Luxembourg, 2019 Winter School on Separation Logics and Applications, ENS Lyon, 2011",
  "content_length": 6482,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:06"
}