{
  "name": "Alexandros Eleftheriadis",
  "homepage": "http://itmb.di.uoa.gr/education/didaskontesEng/edu_didakt7.html",
  "status": "success",
  "content": "Instructors- Information Technologies in Medicine and Biology,Graduate Program,Bioinformatics,Medical Informatics Home Organization Studies Research Announcements Contact Ελληνικά Studies For Graduate Students Courses Instructors Courses Schedule Exams Schedule Alumni club Instructors Eleftheriadis Alexandros Associate Professor Instit.: NKUA Tel: (+30) 210-7275210 e-mail: eleft [at] di.uoa.gr Personal Web Page: http://www.di.uoa.gr/gr/dep_detail.php?GetWhat=46 Short Bio: Alexandros Eleftheriadis was born in Athens in 1967. He received the Diploma in Electrical Engineering from the National Technical University of Athens in 1990, and M.S., M.Phil., and Ph.D. degrees in Electrical Engineering from Columbia University in 1992, 1994, 1995, respectively. From 1995 to 2007 he has been in the faculty of the Department of Electrical Engineering at Columbia University, where he was tenured as Associate Professor in 2005. Since 2007 he has been a Marie Curie Chair with the Department of Informatics and Telecommunications of the University of Athens, where from 2008 he has also been an Associate Professor. In the summers of 1993 and 1994 he was Temporary Member of the Technical Staff with the Signal Processing Research Department of AT&T Bell Labs. His research interests are in digital video compression and communication, and more recently music technology. He has 96 publications in peer-reviewed international journals and conferences (h-index 23), has contributed 9 chapters in edited books, and has co-edited one book on Video on Demand systems. He holds 16 patents in the US with 19 more pending. His patents are used in the Blu-ray DVD and ATSC digital terrestrial television standards. He has been a co-founder and advisor to several advanced techology companies. He is co-founder and Chief Scientist of Vidyo, Inc., which develops integrated Internet-based videoconferencing systems. Vidyo has been recognized with a number of innovation awards (Wall Street Journal 2010 Innovation Award in the Network/Internet Technologies/Broadban category, Frost & Sullivan 2009 Product of the Year for Conferencing and Collaboration, Best Startup - Interop 2008), and its technology has been adopted by companies such as Cisco, Hitachi, and Hewlett Packard. Prof. Eleftheriadis has been the Editor of the MPEG-4 Systems standard (ISO/IEC 14496-1), Co-Editor of the H.264 SVC Conformance specification (ITU-T H.264.1), and Co-Editor of IETF’s RTP Payload Format for SVC. His awards include a Marie Curie Chair from the European Commission, the ACM 2004 Multimedia Open Source Software Awards, and the NSF CAREER Award. He is a Senior Member of the IEEE and a Member of the AES. [Previous page] Sitemap | Contact | Credits | Rss Copyright © 2010 Department of Informatics and Telecommunications",
  "content_length": 2800,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:59"
}