{
  "name": "Alexander Conway 0001 [Tech]",
  "homepage": "https://ajhconway.com",
  "status": "success",
  "content": "Alex ConwaySearchAlex ConwayAssistant Professor, Computer ScienceCornell TechBiographyMy research is primarily focused on randomized data structures and their applications to memory and storage systems. My research projects often start with a new theoretical idea which can be leveraged build into a surprising new system, which in turn can be hardened for real-world use.SplinterDB exemplifies this theory-systems-practice pipeline. It leverages a new theoretically optimal data structure, the Mapped $B^\\varepsilon$-tree to build a general-purpose key-value store that has world-beating performance on modern systems. Research papers have appeared on the data structure (ICALP 2018), the core system (ATC 2020), and a data structural extension (SIGMOD 2023). SplinterDB is available as open-source on GitHub, and is deployed in VMware products, such as vSAN 8.0.Mosaic Pages and Iceberg Hash Tables are related research projects which also build systems using new ideas in theory. Iceberg Hash Tables (SIGMOD 2023) use new ideas from the theory of load-balancing to construct the fastest space-efficient hash tables to date. Mosaic Pages (ASPLOS 2023, distinguished paper) is a system that uses Tiny Pointers (SODA 2023, invited to special issue) based on Iceberg Hash Tables to redesign virtual memory to achieve the benefits of huge pages without the drawbacks. Iceberg Hash Tables are available as open-source on GitHub.I have published work on the list-labeling problem (FOCS 2022, invited to special issue and HALG), file-system aging (FAST 2017), filters (SIGMOD 2021), and more.Highlighted PublicationsAdaptive Quotient FiltersSIGMOD 2025Richard Wen, Hunter McCoy, David Tench, Guido Tagliavini, Michael A. Bender, Alex Conway, Martin Farach-Colton, Rob Johnson, Prashant PandeyPDF Cite ACMIONIA: High-Performance Replication for Modern Disk-based KV StoresFAST 2024Yi Xu, Henry Zhu, Prashant Pandey, Alex Conway, Rob Johnson, Aishwarya Ganesan, Ramnatthan AlagappanPDF Cite USENIXLayered List LabelingPODS 2024Michael A. Bender, Alex Conway, Martin Farach-Colton, Hanna Komlós, William KuszmaulPDF Cite ACMNearly Optimal List LabelingFOCS 2024Michael A. Bender, Alex Conway, Martı́n Farach-Colton, Hanna Komlós, Michal Koucký, William Kuszmaul, Michael E. SaksPDF Cite arxivSharding the State Machine: Automated Modular Reasoning for Complex Concurrent SystemsOSDI 2023Travis Hance, Yi Zhou, Andrea Lattuada, Reto Achermann, Alex Conway, Ryan Stutsman, Gerd Zellweger, Chris Hawblitzel, Jon Howell, Bryan ParnoPDF Cite USENIXIceberg Hashing: Optimizing Many Hash-Table Criteria at OnceJACM 2023Michael A. Bender, Alex Conway, Martin Farach-Colton, William Kuszmaul, Guido TagliaviniPDF Cite ACMIcebergHT: High Performance Hash Tables Through Stability and Low AssociativitySIGMOD 2023Prashant Pandey, Michael A Bender, Alex Conway, Martin Farach-Colton, William Kuszmaul, Guido Tagliavini, Rob JohnsonPDF Cite ACM GitHubSplinterDB and Maplets: Improving the Tradeoffs in Key-Value Store Compaction PolicySIGMOD 2023Alex Conway, Martı́n Farach-Colton, Rob JohnsonPDF Cite GitHubMosaic Pages: Big TLB Reach with Small PagesASPLOS 2023Krishnan Gosakan, Jaehyun Han, William Kuszmaul, Ibrahim N Mubarek, Nirjhar Mukherjee, Karthik Sriram, Guido Tagliavini, Evan West, Michael A Bender, Abhishek Bhattacharjee, Alex Conway, Martin Farach-Colton, Jayneel Gandhi, Rob Johnson, Sudarsun Kannan, Donald E PorterPDF Cite ACMTiny PointersSODA 2023Michael A Bender, Alex Conway, Martín Farach-Colton, William Kuszmaul, Guido TagliaviniPDF Cite DOIOnline List Labeling: Breaking the $\\log^2 n$ BarrierFOCS 2022Michael A Bender, Alex Conway, Martı́n Farach-Colton, Hanna Komlós, William Kuszmaul, Nicole WeinPDF Cite arxivBetrFS: a Compleat File System for Commodity SSDsEuroSys 2022Yizheng Jiao, Simon Bertron, Sagar Patel, Luke Zeller, Rory Bennett, Nirjhar Mukherjee, Michael A Bender, Michael Condict, Alex Conway, Martı́n Farach-Colton, Xiongzi Ge, William Jannen, Rob Johnson, Donald E Porter, Jun Yuan Cite ACMPaging and the Address-Translation ProblemSPAA 2021Michael A Bender, Abhishek Bhattacharjee, Alex Conway, Martı́n Farach-Colton, Rob Johnson, Sudarsun Kannan, William Kuszmaul, Nirjhar Mukherjee, Don Porter, Guido Tagliavini, Janet Vorobyeva, Evan WestPDF Cite ACMVector Quotient Filters: Overcoming the Time/Space Trade-Off in Filter DesignSIGMOD 2021Prashant Pandey, Alex Conway, Joe Durie, Michael A Bender, Martin Farach-Colton, Rob JohnsonPDF Cite ACMSplinterDB: Closing the Bandwidth Gap for NVMe Key-Value StoresATC 2020Alex Conway, Abhishek Gupta, Vijay Chidambaram, Martin Farach-Colton, Richard Spillane, Amy Tai, Rob JohnsonPDF Cite Slides USENIX (includes presentation video)How to Copy FilesFAST 2020Yang Zhan, Alex Conway, Yizheng Jiao, Nirjhar Mukherjee, Ian Groombridge, Michael A Bender, Martin Farach-Colton, William Jannen, Rob Johnson, Donald E Porter, Jun YuanPDF Cite FAST Presentation Slides USENIXOptimal ball recyclingSODA 2019Michael A Bender, Jake Christensen, Alex Conway, Martin Farach-Colton, Rob Johnson, Meng-Tsung TsaiPDF Cite ACM arxivOptimal hashing in external memoryICALP 2018Alex Conway, Martin Farach-Colton, Philip ShilanePDF Cite DROPS arxivFile Systems Fated for Senescence? Nonsense, Says Science!FAST 2017Alex Conway, Ainesh Bakshi, Yizheng Jiao, William Jannen, Yang Zhan, Jun Yuan, Michael A Bender, Rob Johnson, Bradley C Kuszmaul, Donald E Porter, Martin Farach-ColtonPDF Cite Slides USENIX (includes presentation audio)See all publications Contactme@ajhconway.comCite ×Copy Download",
  "content_length": 5544,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:19"
}