{
  "name": "Alexandros Daglis",
  "homepage": "https://www.cc.gatech.edu/~adaglis3",
  "status": "success",
  "content": "Alexandros Daglis About News Publications Students Teaching Contact Alexandros Daglis Associate Professor Georgia Tech ABOUT I am an Associate Professor of Computer Science at Georgia Tech with an adjunct appointment at the School of Electrical and Computer Engineering. My research focuses on rack-scale computing and network-compute integration, targeting the most challenging communication-intensive services with tight latency targets in datacenter environments. Blurring the boundaries between network and compute, and pushing functionality with richer semantics to the network endpoints paves the way for high-performance, efficient and scalable microsecond-scale services. I am also broadly interested in the ongoing transition from CPU-centric to network- and memory-centric computing and the impact of this paradigm shift in the evolution of system architectures, algorithms, and software. I am a recipient of the NSF CAREER award, a Google Faculty Research award, and several teaching distinctions at Georgia Tech. My research is supported by the NSF, IARPA, Intel, and Samsung. I received my PhD from EPFL, where my thesis was awarded an EPFL thesis distinction and the ACM SIGARCH/IEEE CS TCCA Outstanding Dissertation Honorable Mention. DOWNLOAD CV NEWS 11/25: Divya succesfully defended his PhD. Congratulations Dr Kadiyala! 11/25: Sassy, a first-of-its kind SmartNIC-based mechanism tailored for services handling thousands of RDMA connections per server, accepted at HPCA. Congratulations Hamed! 11/25: I'll be serving as an ISCA'26 PC member. 08/25: Hamed succesfully defended his PhD. Congratulations Dr Seyedroudbari! 08/25: I'll be serving as an HPCA'26 PC member. 07/25: Citadel, an OS-based safeguard against inter-domain Rowhammer exploits, accepted at MICRO. Congratulations Anish and Walter! 03/25: I am honored to be tenured and promoted to the rank of Associate Professor, effective August 2025! 03/25: I'll be serving as the Workshops and Turorials co-chair for MICRO 2025. news log RECENT PUBLICATIONS (complete list) Sassy: SmartNIC-Assisted Notification Delivery for μs-scale RDMA Workloads. H. Seyedroudbari, A. Daglis In Proceedings of the 32nd IEEE International Symposium on High-Performance Computer Architecture HPCA 2026 Citadel: Rethinking Memory Allocation to Safeguard Against Inter-Domain Rowhammer Exploits A. Saxena, W. Wang, A. Daglis In Proceedings of the 58th IEEE/ACM International Symposium on Microarchitecture MICRO 2025 StarNUMA: Mitigating NUMA Challenges with Memory Pooling A. Cho, A. Daglis In Proceedings of the 57th IEEE/ACM International Symposium on Microarchitecture MICRO 2024 CoaXiaL: A CXL-Centric Memory System for Scalable Servers A. Cho, A. Saxena, M. Qureshi, A. Daglis In Proceedings of the International Conference for High Performance Computing, Networking, Storage, and Analysis SC 2024 Turbo: SmartNIC-enabled Dynamic Load Balancing of μs-scale RPCs H. Seyedroudbari, S. Vanavasam, A. Daglis In Proceedings of the 29th IEEE International Symposium on High-Performance Computer Architecture HPCA 2023 Safety Hints for HTM Capacity Abort Mitigation A. Jain, D. Kadiyala, A. Daglis In Proceedings of the 29th IEEE International Symposium on High-Performance Computer Architecture HPCA 2023 Cooperative Concurrency Control for Write-Intensive Key-Value Workloads M. Sutherland, B. Falsafi, A. Daglis In Proceedings of the 28th International Conference on Architectural Support for Programming Languages and Operating Systems ASPLOS 2023 Patching up Network Data Leaks with Sweeper M. Vemmou, A. Cho, A. Daglis In Proceedings of the 55th IEEE/ACM International Symposium on Microarchitecture MICRO 2022 NFSlicer: Data Movement Optimization for Shallow Network Functions A. Sarma, H. Seyedroudbari, H. Gupta, U. Ramachandran, A. Daglis ArXiv, March 2022 ArXiv 2022 COSPlay: Leveraging Task-Level Parallelism for High-Throughput Synchronous Persistence M. Vemmou and A. Daglis In Proceedings of the 54th IEEE/ACM International Symposium on Microarchitecture MICRO 2021 Cerebros: Evading the RPC Tax in Datacenters A. Pourhabibi, M. Sutherland, A. Daglis, B. Falsafi In Proceedings of the 54th IEEE/ACM International Symposium on Microarchitecture MICRO 2021 OneEdge: An Efficient Control Plane for Geo-Distributed Infrastructures E. Saurez, H. Gupta, A. Daglis, U. Ramachandran In Proceedings of the ACM Symposium on Cloud Computing SoCC 2021 The NeBuLa RPC-Optimized Architecture M. Sutherland, S. Gupta, B. Falsafi, V. Marathe, D. Pnevmatikatos, A. Daglis In Proceedings of the 47th IEEE/ACM International Symposium on Computer Architecture ISCA 2020 PHD STUDENTS Marina Vemmou - network-compute co-design, advanced software-hardware interactions Divya Kiran Kadiyala - distributed ML architectures, CXL-based memory systems Albert Cho - memory system design, CXL-based memory pooling Prachatos Mitra - large-scale graph analytics Peidi Song - microsecond-scale scheduling in datacenters (co-advised w/ Prof. Ahmed Saeed) ALUMNI Hamed Seyedroudbari - PhD 2025 Shreyan Jabade - MS 2024 Srikar Vanavasam - BS 2023 TEACHING Introduction to Graduate Studies - Computing (cs7001) Fall '24 Systems and Networks (cs2200) Spring '25/'24/'23/'22 Topics on Datacenter Design (cs8803) Spring '21/'20, Fall '19 High Performance Computer Architecture (cs4290/cs6290/ece4100/ece6100) Fall '23/'22/'21/'20 CONTACT Email alexandros.<lastname>@cc.gatech.edu Address School of Computer Science, College of Computing Georgia Institute of Technology KACB 2322 266 Ferst Dr Atlanta, GA 30332-0280 Phone 404-385-2938 SOCIAL LINKS Shared by BootstrapThemes",
  "content_length": 5601,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:00"
}