{
  "name": "Alex Psomas 0001",
  "homepage": "https://www.alexpsomas.com",
  "status": "success",
  "content": "Alex PsomasSearch this siteEmbedded FilesSkip to main contentSkip to navigationAlex PsomasAssistant ProfessorDepartment of Computer SciencePurdue UniversityHall of Data Science and AI (DSAI) 2144email: ''apsomas'' at ''purdue'' dot ''edu''DBLP | Google ScholarAboutMy name is Alexandros Psomas (I mostly go by Alex). I am an Assistant Professor in the Department of Computer Science at Purdue University. I am also affiliated with the Center for Education and Research in Information Assurance and Security (CERIAS).My research focuses on the intersection of Computer Science and Economics. I apply tools and insights from computer science to study problems in a variety of economic environments. I am broadly interested in algorithmic economics, artificial intelligence, machine learning, computational social choice and mechanism design, as well as algorithmic game theory and theoretical computer science in general. I am very interested in projects that involve both theory and real-world applications. Examples include collaborations with non-profit organizations such as 412 Food Rescue, the Indy Hunger Network, and the Food Finders Food Bank.I completed my PhD in May 2017 in the Theory of Computation group at UC Berkeley, where I was extremely fortunate to be advised by Christos Papadimitriou. I have worked as a Visiting Researcher in the market algorithms group in Google Research (Mountain View) during the Spring and Summer of 2020. I spent Fall 2019 as a Research Fellow at the Simons Institute for the Theory of Computing. Prior to that I spent two wonderful years (2017-2019) as a postdoctoral researcher in the Computer Science Department at Carnegie Mellon University, hosted by Ariel Procaccia.My research is funded by an award from the Herbert Simon Family Foundation, a Google Research Scholar Award, a Google AI for Social Good award, a MEGA-ACE grant from the Algorand Foundation, and the NSF CAREER Award.NEWSJune 2025: Yair and I are organizing a tutorial on applied fair division in EC 2025!April 2025: I was a guest on an episode of ``This is Purdue,'' Purdue's official podcast. Many thanks to Kate Young for the invitation!Nov 2024: Our work with IHN was featured in Purdue University's News!Oct 2024: Our paper, \"Automating Food Drop: The Power of Two Choices for Dynamic and Fair Food Allocation,\" with Marios and Paritosh won the best student paper award in EAAMO 2024!April 2024: Talking about dynamic fair division and our work with the Indy Hunger Network at Brown's CS Theory Seminar (video) and MIT's Algorithms & Complexity Seminar.April 2024: We have launched our automated version of FoodDrop!March 2024: Talking about dynamic fair division and our work with the Indy Hunger Network in the Mathematics for Humanity Learning Seminar.Sept 2023: Our work on combating food insecurity using artificial intelligence was covered by IOWA PBS and Purdue University News!Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2977,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:12"
}