{
  "name": "Alexey Naumov",
  "homepage": "https://www.hse.ru/staff/anaumov",
  "status": "success",
  "content": "Сотрудники - Наумов Алексей Александрович – Национальный исследовательский университет «Высшая школа экономики» В старых версиях браузеров сайт может отображаться некорректно. Для оптимальной работы с сайтом рекомендуем воспользоваться современным браузером.AAAАБBАБBАБBАААААОбычная версия сайтаКампус в МосквеСанкт-ПетербургНижний НовгородПермьВышка ОнлайнRUENВерсия для слабовидящихВерсия для слабовидящихЛичный кабинет сотрудника ВШЭПоискПоискРасширенный поискМенюВысшая школа экономикиНациональный исследовательский университет «Высшая школа экономики»О ВышкеПреподаватели и сотрудникиНаумов Алексей АлександровичRUENЛичный кабинет сотрудника ВШЭНайтиРасширенный поиск по сайту  Домашняя страницаПреподаваниеПубликации и исследованияВ новостях Владение языкамианглийскийКонтактыТелефон:+7 (495) 772-95-90 27358Адрес: АУК \"Покровский бульвар\", Покровский б-р, д. 11, каб. T924Время консультаций: -ТГ канал \"Наука изнутри\"РасписаниеORCID: 0000-0002-7536-4576ResearcherID: G-6280-2015Scopus AuthorID: 55178400400Google ScholarРуководительАржанцев И. В.ЗаместительДаркшевич А. Н. (взаимодействие с индустрией)ПомощникиБадьина Д. А. (Организация документооборота, СЭД, работа с поручениями)Шмидт В. А. (советник )Версия для печатис публикациямис новостямиРаспечататьНашли опечатку?Выделите её, нажмите Ctrl+Enter и отправьте нам уведомление. Спасибо за участие!Сервис предназначен только для отправки сообщений об орфографических и пунктуационных ошибках.Наумов Алексей АлександровичДиректор: Факультет компьютерных наук / Институт искусственного интеллекта и цифровых наукЗаведующий кафедрой, Профессор: Факультет компьютерных наук / Департамент больших данных и информационного поиска / Базовая кафедра Института проблем передачи информации им. А.А. Харкевича РАННаучный руководитель: Факультет компьютерных наук / Институт искусственного интеллекта и цифровых наук / Международная лаборатория стохастических алгоритмов и анализа многомерных данныхАкадемический руководитель образовательной программы: Математика машинного обученияЧлен Ученого совета НИУ ВШЭ Начал работать в НИУ ВШЭ в 2016 году.Научно-педагогический стаж: 12 лет.  Домашняя страницаПреподаваниеПубликации и исследованияВ новостяхПолномочия / обязанностиОсуществляет руководство: институтом ИИиЦН ФКН НИУ ВШЭ исследовательским центром по ИИ НИУ ВШЭ Oбразование и учёные степени2022Доктор наук: Национальный исследовательский университет \"Высшая школа экономики\"2013Кандидат физико-математических наук: Московский государственный университет им. М.В. Ломоносова2013PhD: Билефельдский университет2010Специалитет: Московский государственный университет им. М.В. Ломоносова, специальность «Прикладная математика и информатика», квалификация «Математик. Системный программист»Дополнительное образование / Повышение квалификации / Стажировки Стажировка в Китайском университете Гонконга, департамент статистики, сентябрь 2015 -- декабрь 2015. Постдок в Билефельдском Университете, факультет математики, январь 2013 -- ноябрь 2013. Профессиональные интересыслучайные матрицытеория вероятностей и математическая статистикаобучение с подкреплениемстохастическая аппроксимация27.43.00 Теория вероятностей и математическая статистикаДостижения и поощрения Благодарность проректора НИУ ВШЭ (ноябрь 2025)Благодарность проректора НИУ ВШЭ (ноябрь 2024)Благодарственное письмо ректора НИУ ВШЭ (декабрь 2023)Благодарность проректора НИУ ВШЭ (ноябрь 2023)Благодарственное письмо первого проректора НИУ ВШЭ (февраль 2023)Почетная грамота НИУ ВШЭ (октябрь 2022)Благодарность Высшей школы экономики (сентябрь 2021)Благодарность Факультета компьютерных наук НИУ ВШЭ (август 2018)Надбавка за защиту докторской диссертации (2022–2025)Лучший преподаватель — 2022, 2018–2019Лучший академический руководитель в номинации «Удовлетворенность студентов качеством образовательной программы» — 2025Лучший академический руководитель в номинации «Сбалансированность образования» — 2025Лучший академический руководитель в номинации «Лояльность студентов к продолжению образования в НИУ ВШЭ» — 2023–2024Достижения и поощренияНаучная премия Яндекса имени Ильи Сегаловича (2022) Первая премия 39 конкурса молодых ученых МГУ (2015)Участие в редколлегиях научных журналовС 2025 г.: член редколлегии журнала «Statistics and Computing».Научный руководитель диссертационных исследованийна соискание учёной степени кандидата наук1Самсонов С. В. Неравенства концентрации для функционалов от цепей Маркова и их приложения к снижению дисперсии MCMC алгоритмов, 20242Тяпкин Д. Н. Рандомизированное исследование для обучения с подкреплением (aспирантура: 3-й год обучения)3Лагутин Е. М. Усиление генеративных моделей с помощью локально-глобальных методов Марковских цепей Монте-Карло (aспирантура: 3-й год обучения)Учебные курсы (2025/2026 уч. год)Mathematical Foundations of Reinforcement learning (Маго-лего; где читается: Факультет компьютерных наук; 2 модуль)АнгMathematical Foundations of Reinforcement learning (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02 Прикладная математика и информатика; 2-й курс, 2 модуль)АнгMentor's Seminar \"Math of Machine Learning \" (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02 Прикладная математика и информатика; 2-й курс, 1-3 модуль)АнгАрхив учебных курсовУчебные курсы (2024/2025 уч. год)Математика обучения с подкреплением (Маго-лего; 2 модуль)русMathematical Foundations of Reinforcement learning (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02 Прикладная математика и информатика; 2-й курс, 2 модуль)АнгMentor's Seminar \"Math of Machine Learning \" (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02 Прикладная математика и информатика; 2-й курс, 1-3 модуль)АнгMentor's Seminar \"Math of Machine Learning \" (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02 Прикладная математика и информатика; 1-й курс, 1-4 модуль)АнгУчебные курсы (2023/2024 уч. год)High Dimensional Probability and Statistics (Маго-лего; 3, 4 модуль)АнгHigh Dimensional Probability and Statistics (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика; 1-й курс, 3, 4 модуль)АнгMathematical Foundations of Reinforcement learning (Маго-лего; 2 модуль)АнгMathematical Foundations of Reinforcement learning (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика; 2-й курс, 2 модуль)АнгMentor's Seminar \"Math of Machine Learning \" (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика; 1-й курс, 1-4 модуль)АнгMentor's Seminar \"Math of Machine Learning \" (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика; 2-й курс, 1-3 модуль)АнгУчебные курсы (2022/2023 уч. год)High Dimensional Probability and Statistics (Маго-лего; 3, 4 модуль)АнгHigh Dimensional Probability and Statistics (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика; 1-й курс, 3, 4 модуль)АнгMarkov Chains (Маго-лего; 2, 3 модуль)АнгMarkov Chains (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика; 1-й курс, 2, 3 модуль)АнгMathematical Foundations of Reinforcement learning (Маго-лего; 2 модуль)АнгMathematical Foundations of Reinforcement learning (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика; 2-й курс, 2 модуль)АнгМатематическая статистика (углубленный курс) (Бакалавриат; где читается: Факультет компьютерных наук направление: 01.03.02. Прикладная математика и информатика; 2-й курс, 3, 4 модуль)русResearch Seminar (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика; 2-й курс, 2 модуль)АнгMentor's Seminar \"Math of Machine Learning \" (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика; 1-й курс, 1, 2 модуль)АнгRandom Matrix Theory (Маго-лего; 1 модуль)АнгRandom Matrix Theory (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика; 2-й курс, 1 модуль)АнгУчебные курсы (2021/2022 уч. год)Mathematical Foundations of Reinforcement learning (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика; 2-й курс, 2 модуль)АнгResearch Seminar (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика; 2-й курс, 1, 2 модуль)АнгModern Methods of Data Analysis: Stochastic Calculus (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика; 1-й курс, 1, 2 модуль)АнгRandom Matrix Theory (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика; 2-й курс, 1 модуль)АнгУчебные курсы (2020/2021 уч. год)Research Seminar (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика; 2-й курс, 1, 2 модуль)АнгModern Methods of Data Analysis: Stochastic Calculus (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика; 1-й курс, 1, 2 модуль)АнгRandom Matrix Theory (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика; 2-й курс, 1 модуль)АнгРасписание занятий на сегодняРасписание занятий по физической культуре в спортивных секцияхПолное расписаниеГрантыГрант РНФ № 19-71-30020 \"Использование вероятностных нейроморфных генеративных моделей для развития технологии цифровых двойников нелинейных стохастических систем\", 2019 - 2022 (НИУ ВШЭ) Грант РНФ № 18-11-00132 \"Анализ случайных объектов высокой размерности ",
  "content_length": 44536,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:06"
}