{
  "name": "Alexander Phillip Turner",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/alexander.turner",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Alexander TurnerAssistant Professor, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsAdministrative rolesResearch Contact workRoom B31 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKwork0115 748 7562Alexander.Turner@nottingham.ac.uk BiographyAlex is an Assistant Professor in the School of Computer Science at the University of Nottingham. Prior to this, he was a lecturer in Computer Science at the University of Hull and a Post Doctoral Researcher in the Department of Electronic Engineering at the University of York, where he obtained his PhD. His MSc was awarded in the Department of Computer Science at the University of York. Alex has previously taught modules in procedural programing, object-oriented programming and artificial intelligence.Teaching SummaryAlex is currently teaching on two modules. COMP 2007 Operating Systems and Concurrency and COMP3018 Mobile Device Development.Research SummaryAlex's main research interests are focused on the development of new technologies to improve the diagnosis and treatments of movement disorders, with a particular focus on gait and ambulation.… read more Alex is currently the PGT exams officer for the school of Computer Science Current ResearchAlex's main research interests are focused on the development of new technologies to improve the diagnosis and treatments of movement disorders, with a particular focus on gait and ambulation. Sufferers of movement disorders find a distinct amount of heterogeneity in their symptoms day by day, and typical treatment updates are sparse due to both the complicated nature of the diseases and the limited face to face time available with specialists. To try and solve this, novel sensors in combination with machine learning can be used to provide day to day updates of a patient's movement, which can use used to develop autonomous physiotherapy updates and well as guide changes in treatment. In addition he also works in the development of transparent machine learning models which can provide a rationale for their decision making process. He is also interested in the application of machine learning in the biological sciences both to improve disease diagnosis and on understanding biological evolution and climate change.Past ResearchPreviously Alex has worked on the development and understanding of novel bio-inspired computational techniques and the use of machine learning to improve the understanding of cell behaviour. In addition he has also worked on the development of underwater swarm robots, as well as a host of other small engineering projects. Browser does not support script. Browser does not support script. School of Computer Science University of NottinghamJubilee CampusWollaton Road Nottingham, NG8 1BB For all enquires please visit: www.nottingham.ac.uk/enquire Legal information Copyright Terms and conditions Privacy Posting rules Accessibility Freedom of information Charity gateway Cookie policy Cookie Settings Get social Connect with the University of Nottingham through social media and our blogs. Campus maps | More contact information | Jobs",
  "content_length": 3525,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:35"
}