{
  "name": "Alexander Serebrenik",
  "homepage": "http://www.win.tue.nl/~aserebre",
  "status": "success",
  "content": "Home Page of Alexander Serebrenik Alexander Serebrenik Full Professor (HGL-2), SET Post addressVisiting address MF 6.095MF 6.095 P.O. Box 513Groene Loper 5 5600 MB Eindhoven 5612 AE Eindhoven The NetherlandsThe Netherlands Twitter: @aserebrenik e-mail: a.serebrenik at tue.nl phone: +31 40 247 3595 (office) Since February 6, 2023 I am leading the Software Engineering and Technology (SET) cluster. As of July 2020 I am also leading one of the groups within the cluster, namely the Social Software Engineering group. Before this I used to be Associate Professor (2013-2020) and Assistant Professor (2008-2013) in SET, Assistant professor at LaQuSo (2004-2008) and a postdoctoral researcher in the Sémantique, preuve et interprétation abstraite (Semantics, Proof and Abstract Interpretation) group led by late Radhia Cousot (January-June 2004). Till December 2003 I've used to work at the Declarative Languages and' Artificial Intelligence group at Katholieke Universiteit Leuven. In July 2003 I have defended a Ph.D. thesis entitled Termination Analysis of Logic Programs (PDF). My Ph.D. advisor was Prof. Danny De Schreye. In 1999 I've obtained my masters degree from the Hebrew University, Jerusalem Israel. My supervisors were Dr. Naomi Lindenstrauss and Prof. Yehoshua Sagiv. From July till October 2018 I was on sabbatical visiting Nicole Novielli and Collaborative Development Group in Università degli studi di Bari \"Aldo Moro\". From January 2013 till August 2017 I was also a part-time visiting researcher at the Software Analysis and Transformation group of CWI, led by Jurgen J. Vinju. In October-November 2013 I've visited Vladimir Filkov and Prem Devanbu in UC Davis. From September till December 2012 I was on sabbatical at the Software Engineering lab of University of Mons, headed by Tom Mens. My research domain is empirical software engineering including both its social and technical aspects. I am particularly interested in understanding and supporting diversity of software development teams, their communication and collaboration. I like mining software repositories, conducting surveys and interviews and measuring software artefacts and processes. In a distant past I also used to work on static analysis, process modeling and verification, termination analysis, logic programming, Petri nets, abstract interpretation, and database query languages. Creating an inclusive environment where different software developers can feel welcome and leverage their talents is an ethical imperative no company can ignore. Indeed, software organizations have in the last decade been trying to make changes for a more diverse and inclusive software development environment. Despite the many efforts, diversity remains low. This book provides an overview of research into the different aspects of diversity and inclusion in software engineering, as well as the tools, methods, and practices proposed to foster diversity and to build inclusive software teams and development environments. For Researchers, the book presents a state-of-the-art collection of existing studies into many aspects of diversity, methods, and tools proposed and tried out in practice, challenges in research, and contributing to a research agenda on this topic for future studies. For Industry practitioners, the book describes efforts to investigate diversity in software teams, whether in corporate or open source environments. It also describes empirical evidence about effectiveness of certain methods and approaches to foster diversity and inclusion in software development. For Educators,the book describes practices and effective changes in Computer Science/Software Engineering curricula that were found as effective in engaging learners from minoritized groups, creating inclusive software teams that are diverse, and which relate to educational material useful for training for diversity, equity, and inclusion. Open Access at Springer Link \"This book is an excellent overview of the latest research in software evolution as it covers a wide range of systems and artifacts as well as analysis techniques. The book is for everyone interested in evolving software systems. For students, it reveals the complexity and challenges after the initial release of a software system. For researchers, it's the perfect starting point to identify new, important research challenges. For practitioners, it's a fantastic introduction to the latest techniques and tools used in software engineering research such as search-based techniques and mining unstructured data. Thanks so much the editors and authors for putting together such a fabulous and inspiring book. I love it!\" Thomas Zimmermann, Microsoft Research, Redmond, WA, USA \"Modern society depends on software flexibility. Yet at the same time, software loses a bit of its flexibility with every change made to it. The field of software evolution research aims at understanding the processes of software evolution, and at proposing methods and techniques to manage evolution. This book provides a wonderful overview of the state of the art in software evolution. The editors did a great job in identifying challenging areas of research, and found the right experts to present the state of the art. Important areas such as evolving product lines and web applications are covered, as are underlying evolution techniques such as repository mining and search-based analysis. The book is a great resource, and I have immediately shared it with my co-workers. Highly recommended!\" Arie van Deursen, Delft University of Technology, The Netherlands Amazon Springer I have acted as member of hiring and promotion committees for academic staff at Radboud University and Utrecht University. In Eindhoven I am a member of the Interdepartmental Committee \"Humans, Technology, Management & Design\". I have also been part of hiring and evaluation committees abroad. My current Ph.D. students: Gloria Isedu (joint with Katja Tuma), Annie Zhou (joint with Alexander Nolte), Ismay Wolff (joint with Jacob Krüger), Lavinia Paganini (joint with Alexander Nolte), Hamid Mohayeji Nasrabadi (joint with Eleni Constantinou), Miguel Botto Tobar (joint with Mark van den Brand). My former Ph.D. students: Jeroen Arnoldus (currently Software Engineer at Repleo, The Netherlands), Marcel van Amstel (currently Project Cluster Manager at ASML, The Netherlands), John Businge (currently Assistant Professor at University of Nevada, Las Vegas, USA), Bogdan Vasilescu (cum laude; currently Associate Professor at Carnegie Mellon University, USA), Arjan van der Meer (currently Software Engineer at Altran, The Netherlands), Yanja Dajsuren (currently EngD Software Technology Program Director and part-time Assistant Professor at Eindhoven University of Technology, The Netherlands), Yaping (Luna) Luo (currently IT Area Lead at the ING bank), Josh Mengerink (currently co-founder and lead architect at TIBO Energy, The Netherlands), Felipe Ebert (currently Lecturer at Fontys University of Applied Sciences, The Netherlands), Monika Gupta (currently Lead Technology Consultant at Celonis and Guest Faculty at IIT Jodhpur, India), Tukaram Muske (currently Software Engineer at Black Duck Software, India), Weslley Torres (currently Senior Software Engineer at Vanderlande, The Netherlands), Nan Yang (currently researcher at TNO-ESI) and Nathan Cassee (cum laude; joint with Nicole Novielli; currently postdoctoral researcher at University of Victoria, Canada). Gema Rodríguez-Pérez was a researcher in our group, co-supervised by Andy Zaidman (Delft University of Technology). Felipe Ebert was a postdoctoral researcher in our group. I've also been Rüdiger Lincke's opponent at Växjö University in Sweden, as well as a committee member of Paolo Pilozzi (Katholieke Universiteit Leuven, Belgium), Mathieu Goeminne (University of Mons, Belgium), Waqar (Eindhoven University of Technology, The Netherlands), Michaël Marcozzi (University of Namur, Belgium), Andre Hora (University Lille 1, France), Daniele Romano (Delft University of Technology, The Netherlands), Yongming Luo (Eindhoven University of Technology, The Netherlands), Jean Melo (IT University, Denmark), Nesrine Noughi (University of Namur, Belgium), Önder Babur (Eindhoven University of Technology, The Netherlands), Cong Liu (Eindhoven University of Technology, The Netherlands), Ahmed Zerouali (University of Mons, Belgium), Alaaeddin Swidan (Delft University of Technology, The Netherlands), Sergio Angelastro, Giuseppe Iaffaldano, Angelo Impedovo and Paolo Mignone (all - Università degli Studi di Bari Aldo Moro, Italy), Adam Alami (IT University, Denmark), Jiayuan Zhou (Queen's University, Canada), Areti Ampatzoglou (Rijksuniversiteit Groningen, The Netherlands), Vladimir Kovalenko (Delft University of Technology, The Netherlands), Alex Cummaudo (Deakin University, Australia), Huatian Wang (Eindhoven University of Technology, The Netherlands), Carianne Pretorius (Eindhoven University of Technology, The Netherlands), Gouliang Zhao (Queen's University, Canada), Camila Costa Silva (University of Canterbury, New Zealand), Lina Ochoa (Eindhoven University of Technology, The Netherlands), Johannes Härtel (University of Koblenz, Germany), Gunnar Kudrjavets (University of Groningen, The Netherlands), Ting Zhang (Singapore Management University, Singapore), Zishuo Ding (Concordia University, Canada), Pavlo Burda (Eindhoven University of Technology, The Netherlands), Azadeh Mozafari Mehr (Eindhoven University of Technology, The Netherlands), Jyoti Prakash Meher (IIT Kharagpur, India), Isabella Graßl (University of Passau, Germany), Thomas Mulder (Eindhoven University of Technology, The Netherlands), Aastha Pant (Monash University, Australia), Natarajan Chidambaram (University of Mons, Belgium), Eduard C. Groen (Utrecht University, The Netherlands), and Sebastian Nielebock (University of Magdeburg, Germany). In the coming months I will be on the PhD committees of Zara Hassan (The Australian National Universi",
  "content_length": 119730,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:44"
}