{
  "name": "Alexei A. Efros",
  "homepage": "http://www.eecs.berkeley.edu/~efros",
  "status": "success",
  "content": "Alexei A. Efros homepage Alexei (Alyosha) Efros Howard Friesen Professor EECS Department UC Berkeley Mailing Address: 395 Soda Hall #1776, Berkeley CA 94720 Office: 8016 Berkeley Way West (BWW) Email: efros -at- eecs.berkeley.edu My Official Berkeley Page Research Group | Alumni | Teaching | Publications | CV I am a professor at EECS Department at UC Berkeley, where I am part of the Berkeley Artificial Intelligence Research Lab (BAIR). Before that, I spent a decade on the faculty of the Robotics Institute at CMU. I am also still remembered in lovely Oxford, where I did a post-doc with Andrew Zisserman. During 2007-2015, I have also been closely collaborating with Team WILLOW at École Normale Supérieure / INRIA in beautiful Paris. Over the years, I was lucky to have some amazing officemates. Research The central goal of my research is to use vast amounts of unlabelled visual data to understand, model, and recreate the visual world around us. My research has been mainly in data-driven computer vision, as well as its projection onto computer graphics and computational photography. I have been working on self-supervised learning since 2015, on continual learning since 2020, and on what is now called \"world models\" since 2017. Other interests include human vision, visual data mining, robotics, and the applications of computer vision to the visual arts and the humanities. I also enjoy making scientific bets. For a high-level overview of my research, here are some of my recent talks. Or, for something completely different, check out a (somewhat dated) New Yorker article about some of our work. Also, I was doing vision-based robotics before it was cool (see picture on page 23 :). I (try to) practice Slow Science. I support Ukraine in its fight against tyranny. Postdocs Yutong Bai (with Jitendra Malik and Trevor Darrell) Tyler Bonnen (with Angjoo Kanazawa and Jitendra Malik) Sophia Koepke (visiting scholar) Graduate Students Amil Dravid Alonso Martinez Konpat Preechakul Renhao Wang Alumni My branch of the Academic Family Tree Former PhD Students Dr. Yossi Gandelsman (PhD 2025), now assistant professor at TTIC PhD Thesis: Interpreting the Inner-Workings of Vision Models Berkeley Fellowship Google Fellowship Dr. Dave Epstein (PhD 2024), now reserach scientist at Anthropic PhD Thesis: Disentangled Visual Generative Models Soros Fellowship Dr. Allan Jabri (PhD 2023), now research scientist at OpenAI PhD Thesis: Scalable Binding Soros Fellowship Dr. Yu Sun (PhD 2023, co-advised with Moritz Hardt), now postdoc at Stanford PhD Thesis: Test-Time Training Dr. Bill Peebles (PhD 2023), now research scientist at OpenAI PhD Thesis: Generative Models of Images and Neural Networks NSF Fellowship Dr. Tim Brooks (PhD 2023), now research scientist at Google DeepMind PhD Thesis: Generative Models for Image and Long Video Synthesis NSF Fellowship Dr. Taesung Park (PhD 2021), now co-founder of startup Reve PhD Thesis: Machine Learning for Deep Image Synthesis Samsung Fellowship Adobe Fellowship Dr. Shiry Ginosar (PhD 2020), now assistant professor at TTIC PhD Thesis: Modeling Visual Minutiae: Gestures, Styles, and Temporal Patterns NSF Fellowship Samuel Silver Memorial Scholarship Award NSF Computing Innotation Fellow Dr. Deepak Pathak (PhD 2019, co-advised with Trevor Darrell), now assistant professor at CMU PhD Thesis: Learning to Generalize via Self-Supervised Prediction Facebook Fellowship NVIDIA Fellowship Dr. Tinghui Zhou (PhD 2018), now Engineering Manager at Roblox PhD Thesis: Visual Learning beyond Direct Supervision Dr. Richard Zhang (PhD 2018), now senior research scientist at Adobe PhD Thesis: Image Synthesis for Self-Supervised Visual Representation Learning Adobe Fellowship Dr. Jun-Yan Zhu (PhD 2017), now assistant professor at CMU PhD Thesis: Learning to Synthesize and Manipulate Natural Images Facebook Fellowship Recipient of SIGGRAPH Outstanding Doctoral Dissertation Award Dr. Ting-Chun Wang (PhD 2017, co-advised with Ravi Ramamoorthi), now principal research scientist at NVIDIA PhD Thesis: Beyond Photo-Consistency: Shape, Reflectance, and Material Estimation Using Light-Field Cameras Berkeley Fellowship Dr. Carl Doersch (MLD, PhD 2016, co-advised with Abhinav Gupta), now senior research scientist at Google DeepMind PhD Thesis: Supervision Beyond Manual Annotations for Learning Visual Representations Google Graduate Fellow NDSEG Graduate Fellow Dr. Santosh Kumar Divvala (Robotics, PhD 2012, co-advised with Martial Hebert), now research scientisit at Allen Institute for Artificial Intelligence (AI2) PhD Thesis: Context and Subcategories for Sliding Window Object Recognition Dr. Tomasz Malisiewicz (Robotics, PhD 2011), now Research Scientist Manager at Meta Reality Labs PhD Thesis: Exemplar-based Representations for Object Detection, Association and Beyond NSF Graduate Fellow Dr. Jean-François Lalonde (Robotics, PhD 2011, co-advised with Srinivas Narasimhan), now professor at Université Laval PhD Thesis: Understanding and Recreating Visual Appearance Under Natural Illumination Microsoft Graduate Fellow Recipient of CMU School of Computer Science Distinguished Dissertation Award Dr. James Hays (CSD, PhD 2009), now associate professor at Georgia Tech PhD Thesis: Large Scale Scene Matching for Graphics and Vision NSF Graduate Fellow Dr. Derek Hoiem (Robotics, PhD 2007, co-advised with Martial Hebert), now professor at University of Illinois PhD Thesis: Seeing the World Behind the Image: Spatial Layout for 3D Scene Understanding Microsoft Graduate Fellow Recipient of CMU School of Computer Science Distinguished Dissertation Award Recipient of ACM Doctoral Dissertation Honorable Mention Former Postdocs Qianqian Wang (2023-2025, co-advised with Angjoo Kanazawa), now assistant professor at Harvard Aleksander Holynski (2022-2025, co-advised with Angjoo Kanazawa), now assistant professor at Columbia University Assaf Shocher (2021-2023), now assistant professor at Technion Xiaolong Wang (2019-2020, co-advised with Trevor Darrell), now associate professor at UC San Diego Lerrel Pinto (2019-2020, co-advised with Pieter Abbeel), now assistant professor at NYU Andrew Owens (2016-2019, co-advised with Jitendra Malik), now associate professor at Cornell Tech Angjoo Kanazawa (2017-2019, co-advised with Jitendra Malik and Trevor Darrell), now assistant professor at UC Berkeley Dinesh Jayaraman (2017-2019, co-advised with Sergey Levine), now assistant professor at UPenn David Fouhey (2016-2018, co-advised with Jitendra Malik), now assistant professor at NYU Judy Hoffman (2017-2018, co-advised with Trevor Darrell), now associate professor at Georgia Tech Phillip Isola (2015-2017), now associate professor at MIT Philipp Krähenbühl (2014-2016, co-advised with Jitendra Malik), now associate professor at UT Austin Mathieu Aubry (2015), now faculty at École des Ponts ParisTech Yong Jae Lee (2012-2014), now professor at University of Wisconsin, Madison Olivier Duchenne (fall 2012), now resercher at Mistral AI and serial startup founder Ali Farhadi (2011-2012, co-advised with Martial Hebert), now professor at University of Washington and CEO of AI2 Abhinav Gupta (2009-2011, co-advised with Martial Hebert), now professor at CMU Former MS/BS Students and Visitors Ryan Tabrizi (BS 2025); Sheng-Yu Wang (BS 2019); Caroline Chan (BS 2018); Andrew Liu (MS 2018); Tongzhou Wang (BS 2017); Jacob Huh (BS 2016); Krishna Kumar Singh (MS 2015); Kate Rakelly (BS 2015); Achal Dave (BS 2015); Tinghui Zhou (MS 2012); Abhinav Shrivastava (MS 2011); Saurabh Singh (MS 2011); Danielle Millett (BS 2009); Suporn Pongnumkul (BS 2005) Lab Visitors: Anand Bhattad (summer 2024), Sophia Koepke (spring 2024), Yannis Siglidis (summer 2023, Summer 2024), Jan Koenderink (fall 2018), Petr Gronat (spring 2016), Mohammad Rastegari (summer 2015), Qixing Huang (summer 2015), Stefan Lee (summer 2014), Dinesh Jayaraman (summer 2014), Sarah Sachs (summer 2014), Ekaterina Zaytseva (fall 2013), Vincent Delaitre (fall 2012), Jose Ribelles (fall 2007) Teaching CS 180/280A: Intro to Computer Vision and Computational Photography [Fall'25, Fall'24, Fall'23, Fall'22, Fall'21, Fall'20, Sp'20, Fall'18, Fall'17, Fall'16, Fall'15, Fall'12, Fall'11, Fall'10, Sp'10, Fall'08, Fall'07, Fall'06, Fall'05, Fall'04] CS 280: Graduate Computer Vision [Sp'24,Sp'23,Sp'21,Sp'19,Sp'18, Sp'17, Sp'16, Fall'13] CS 294-192: Visual Scene Understanding (Spring 2022) CS 189: Intro to Machine Learning [ Fall'15, Sp'15, Sp'14] CS 294-43: Visual Object and Activity Recognition [Fall'14--Fall'18] 16-899A: Pixels to Percepts: Human Visual Perception for Vision and Graphics [Spring'11] 16-824: Learning-based Methods in Vision [ Sp'12, Sp'09, Sp'07, Sp'06] Publications See also my Google Scholar profile for the most recent publications as well as the most-cited papers (which are quite different from my self-selected key publications). Visual Jenga: Discovering Object Dependencies via Counterfactual Inpainting Anand Bhattad, Konpat Preechakul, Alexei A. Efros in Neurips 2025 Vision Transformers Don't Need Trained Registers Nick Jiang, Amil Dravid, Alexei A. Efros, Yossi Gandelsman in Neurips 2025 Fast Data Attribution for Text-to-Image Models Sheng-Yu Wang, Aaron Hertzmann Alexei A. Efros, Jun-Yan Zhu, Richard Zhang in Neurips 2025 Continuous 3D Perception Model with Persistent State Qianqian Wang, Yifei Zhang, Aleksander Holynski, Alexei A. Efros, Angjoo Kanazawa in CVPR 2025 Code and weights available on GitHub GPS as a Control Signal for Image Generation Chao Feng, Ziyang Chen, Aleksander Holynski, Alexei A. Efros, Andrew Owens in CVPR 2025 Prioritized Generative Replay Renhao Wang, Kevin Frans, Pieter Abbeel, Sergey Levine, Alexei A. Efros in ICLR 2025 Interpreting the Second-Order Effects of Neurons in CLIP Yossi Gandelsman, Alexei A. Efros, Jacob Steinhardt in ICLR 2025 Code available on GitHub Test-Time Training on Video Streams Renhao Wang, Yu Sun, Yossi Gandelsman, Xinlei Chen, Alexei A. Efros, Xiaolong Wang in JMLR Inter",
  "content_length": 35328,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:05"
}