{
  "name": "Alexandre M. Bayen",
  "homepage": "http://www.ce.berkeley.edu/people/faculty/bayen",
  "status": "success",
  "content": "Alexandre M. Bayen | Civil and Environmental Engineering Skip to main content Please enable javascript in your browser for full site features Log In Faculty Profile Alexandre M. Bayen Liao-Cho Innovation Endowed Chair Professor Research Interests Control and Optimization Modeling and control of distributed parameters systems, Large-scale infrastructure systems, Automation of transportation (ground and air) Contact bayen@berkeley.edu Office 642 Sutardja Dai Hall Office Hours Personal website Mobile Sensing Laboratory CIRCLES FLOW ResearchGate Google Scholar Summary Research In The News Alexandre Bayen is the Associate Provost for Moffett Field Program Development, Liao-Cho Innovation Endowed Chair and a Professor of Civil of Environmental Engineering and Electrical Engineering and Computer Science at UC Berkeley. Bayen’s research focuses on modeling and control of distributed parameter systems, with applications to transportation systems (air traffic control, highway systems) and distribution systems (water distribution networks). His research involves the control of systems modeled by partial differential equations, combinatorial optimization, viability theory, and optimal control. He is also a member of several professional organizations, including the Institute of Electrical and Electronic Engineers (IEEE) and the Institute of Aeronautics and Astronautics (AIAA). Bayen has authored two books and over 200 articles in peer-reviewed journals and conferences. He is the recipient of the Ballhaus Award from Stanford University in 2004, the CAREER award from the National Science Foundation in 2009, and he was awarded the NASA Top 10 Innovators on Water Sustainability award in 2010. Education Ph.D., Aeronautics and Astronautics, Stanford University, 2003M.Sc., Aeronautics and Astronautics, Stanford University, 1999Eng.Deg., Applied Mathematics, Ecole Polytechnique, 1998 Curriculum Vitae (CV) Bayen’s research focuses on the intersection of control, optimization, and machine learning. His current research applications include mobile robotics, transportation, and engineering. Bayen’s past applications include connected health and the sensing of water systems. The problems he is generally interested in focus on the integration of novel data sources into mathematical learning models. They also involve the application of machine learning algorithms to large-scale mobility problems. The techniques Bayen’s research lab uses include game theory, convex optimization, network optimization, deep reinforcement learning, partial differential equations, and numerical analysis. Here are a few of the research projects Bayen is currently working on below: Network Optimization and Analysis of the Impact of Information on Traffic Flow - This project focuses on the analysis of the impact of routing apps, such as Google, Waze, Apple traffic, INRIX, etc. Our approach develops new network traffic flow models that incorporate the impact of routing information on traffic flow and routing. We provide a theoretical analysis of the resulting mathematical framework, as well as numerical simulations for practical cases of the impact of such apps on congestion.Trucking automation - Modern ground freight systems support complex supply chains and logistics, helping cities and economies thrive and grow. A huge portion of those goods is transported by trucks on existing highly connected shared road infrastructure. Those trucks represent a significant fraction of road and mile users and energy consumers in many countries. Among those countries are the United States at its continental scale and Saudi Arabia, where the railroad network is sparse, putting high pressure on the road network to connect its distant ports and cities. This project focuses on the design, prototyping, deployment, and testing of novel algorithms for truck platooning. Bayern’s research lab is also simultaneously using classical control techniques for the coordination of multiple trucks and novel applications of deep learning and deep reinforcement learning for the same coordination problems. Connected Corridors - California is a dynamic state that continues to be a leader in many important areas, including agricultural production, innovative technology, miles of highways—and traffic congestion. According to the California Department of Transportation's Mobility Report for 2013, Californians lost over 100 million hours because of congestion. Los Angeles County has six of the top ten most congested highways in the state, with Interstate 210 ranking ninth overall. The state exemplifies many of the problems of transportation systems around the world. The Connected Corridors is a collaborative program to research, develop, and test an Integrative Corridor Management (ICM) approach to managing transportation corridors in California. ICM views the corridor as a total system to be managed as an integrative and cohesive whole. It seeks to address the corridor’s overall transportation needs rather than the needs of particular elements of agencies alone. This project relies on large-scale microsimulation and optimization of the I-210 freeway in Los Angeles. News Title Publication Date CEE Students, Postdocs, and Faculty Members Receive 2024 Institutional Lead Award 10/09/2024 Spotlights No mentions in Spotlights Student Updates Title Publication Date Congratulations to the 2025 Eno Leadership Development Conference Fellows! 06/17/2025 CEE Ph.D. Candidate Zhe Fu Wins Winner Award at INFORMS 02/20/2024",
  "content_length": 5521,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:54"
}