{
  "name": "Alexis Hiniker",
  "homepage": "http://alexishiniker.com",
  "status": "success",
  "content": "Home | Alexis Hiniker top of pageI am an Associate Professor in the Information School at the University of Washington, director of the User Empowerment Lab, and chair of the UW Information Science PhD Program. In my work in human-computer interaction (HCI), I study how the attention economy incentivizes designs that exploit users of all ages, and children in particular, and I build systems that illustrate how technology can instead help them thrive. I am fortunate to work with a lab of fantastic PhD students and collaborators with whom I design, build, and test novel technologies. I am a Jacobs Foundation Early Career Fellow, a Google Research Scholar, and an advisor to numerous regulatory bodies investigating the harms caused by manipulative design.The Information School University of Washington Box 352840 Seattle, WA 98195 ​ alexisr@uw.edu *Last name rhymes with \"vinegar\"Online ConversationWhy are disagreements so much more likely to escalate online than in person? How might social media and messaging apps encourage more constructive interactions? Do we pick up new conversational habits from Siri and Alexa? The way we communicate with one another has important consequences for our relationships, and designers play a role in shaping these interactions. My lab investigates the design of systems that encourage constructive conversation.Dark PatternsWhat common design approaches undermine users' intentions or make their lives worse? My lab investigates how interfaces manipulate users' decisions and attention. We also design alternative patterns to support users in engaging with technology in ways that are consistent with their values and goals.Compulsive Technology UseHave you ever looked up from your phone only to wonder where the last thirty minutes went? My past work documents the \"30-minute ick factor\" that many people feel after spending time online. My lab studies this experience, builds interfaces that encourage more intentional usage habits, and invents design methods to help practitioners create experiences that are more supportive of users' needs and autonomy.Children's TechnologyEthical design is particularly important in interfaces for children, who are often uniquely vulnerable to exploitation by interfaces. My lab designs experiences that are sensitive to children's developmental needs and platforms that prioritize high-quality content.Personified InterfacesHow \"conversational\" should a conversational agent be? Should personified interfaces have designed personalities? When do these human-like systems become creepy? My lab investigates the ways in which personified interfaces support their users, particularly children and families, and common pitfalls in creating these systems.bottom of page",
  "content_length": 2753,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:09"
}