{
  "name": "Alexander Hinneburg",
  "homepage": "https://www.informatik.uni-halle.de/arbeitsgruppen/dbs/mitarbeiter/hinneburg",
  "status": "success",
  "content": "Alexander Hinneburg Aktuelle Sprache: Deutsch switch to english version Springen Sie direkt: Zum Textanfang (Navigation überspringen) , Zur Hauptnavigation , Zur Themennavigation , Zu weiteren Einstellungen Themennavigation Studium Forschung Weiterbildung Karriere Presse International Hauptnavigation Die Universität Fakultäten Naturwissenschaftliche Fakultät III - Agrar- und Ernährungswissenschaften, Geowissenschaften und Informatik Institut für Informatik Arbeitsgruppen am Institut Datenbanken und Informationssysteme Mitarbeiter Alexander Hinneburg International Office Zentrale Einrichtungen Graduierten-Akademie Wissenschaftliche Zentren An-Institute Universitätsklinikum Kontakt Alexander Hinneburg Telefon: ++49 345 55 24732 hinneburg@informatik.uni-ha... Raum 314 Von-Seckendorff-Platz 1 06120 Halle Weiteres Sprache: English Schrift: größer , kleiner Login für Redakteure Alexander Hinneburg Privatdozent Dr. habil. rer. nat. Alexander Hinneburg Meine Forschung konzentiert sich auf explorative Datenanalyse. Konkret arbeite ich an Methoden zur Cluster- und Themenanalyse und deren Anwendung auf große Datenbanken mit Dokumenten, organischen Molekülen und anderen komplex zusammengesetzten Datenobjekten. Zur Auswertung der Ergebnisse verknüpfe ich Visualisierungstechniken mit maschinellem Lernen. Seit 2011 bin ich Privatdozent in der Arbeitsgruppe für Datenbanken und Informationssysteme an der Martin-Luther-Universität Halle-Wittenberg. Ich leite die Entwicklung des TopicExplorers, einer Web-Anwendung zur visuellen Datenexploration von großen Dokumentsammlungen mit Themenmodellen. Ich halte regelmäßig Vorlesungen und Übungen zu Datenbanken, Web-Technologien (Bachelor), Data Mining, Maschinellem Lernen, Information Retrieval und Visualisierung (Master). Vor meiner Habilitation war ich von 2004-2005 Post-Doktorand an der Universität Helsinki. Meine Promotion erhielt ich 2003 an der Martin-Luther-Universität Halle-Wittenberg. Forschungsprojekte TopicExplorer TopicExplorer is a web-based visual analytics system to explore data with topic models. Main current application is the analysis of Japanese blogs. [ mehr ... ] BigFlow BigFlow is a data-driven workflow approach to mediate between data preparation, machine learning and interactive, visual data exploration in big data applications. [ mehr ... ] Long Range Correlations Records, each consisting of a set of simple objects from a data space, exhibit correlations that are non- local in the dataspace. A new class of mixture models is developed that capture such long range corrations. [ mehr ... ] Publikationen Anne Purschwitz, Alexander Hinneburg: Funktionsmechanismen  gesellschaftlicher Wissenskonstruktion in der Aufklärung – Chancen und  Grenzen des Topic-Modeling in den Geisteswissenschaften, Die halleschen  Zeitungen und Zeitschriften 1688-1815, in medien & zeit   , akzeptiert zur Publikation, 2019. Christian Papilloud, Alexander Hinneburg: Qualitative Textanalyse mit Topic-Modellen. Eine Einführung für Sozialwissenschaftler, Textbook, Part of the Studienskripten zur Soziologie book series (SSZS), Springer, 2018. DOI: 10.1007/978-3-658-21980-2   . Alexander Hinneburg, Christian Oberländer: Getting  the Story from Big Data: Interaktive visuelle Inhaltsanalyse für die  Sozialwissenschaften mit dem TopicExplorer am Beispiel Fukushima   ,  in Visualisierung sprachlicher Daten, Visual Linguistics – Praxis –  Tools, Noah Bubenhofer, Marc Kupietz (Hrsg.), Heidelberg: Heidelberg  University Publishing, 2018, DOI: 10.17885/heiup.345.474   . Frank Rosner, Alexander Hinneburg: Translating Bayesian Networks into Entity Relationship Models   , in Proceedings ER 2016, Conceptual Modeling – 35th International Conference, 2016, pp. 65-72 (extended version   ). Michael Röder, Andreas Both, Alexander Hinneburg: Exploring the Space of Topic Coherence Measures   , in  Proceeding WSDM '15, Proceedings of the Eighth ACM International Conference on Web Search and Data Mining, 2015, pp. 399-408. Alexander Hinneburg, Frank Rosner, Stefan Pessler, Christian Oberländer: Exploring Document Collections with Topic Frames   , Proceeding CIKM '14 Proceedings of the 23rd ACM International Conference on Conference on Information and Knowledge Management, 2014, pp. 2084-2086. Frank Rosner, Alexander Hinneburg, Michael Röder, Martin Nettling, Andreas Both: Evaluating topic coherence measures   . presented at Topic Models: Computation, Application, and Evaluation, NIPS Workshop 2013. Alexander Hinneburg: Concepts of Visual and Interactive Clustering. Data Clustering   : Algorithms and Applications, in Charu C. Aggarwal, Chandan K. Reddy (Eds.): Data Clustering: Algorithms and Applications. CRC Press 2014: 483-504. André Gohr, Myra Spiliopoulou, Alexander Hinneburg: Visually Summarizing Semantic Evolution in Document Streams with Topic Table   , in Knowledge Discovery, Knowledge Engineering and Knowledge Management (Communications in Computer and Information Science), Springer, 2013:136-150. Alexander Hinneburg, Rico Preiss, René Schröder: TopicExplorer: Exploring Document Collections with Topic Models   . in Peter A. Flach, Tijl De Bie, Nello Cristianini (Eds.): Machine  Learning and Knowledge Discovery in Databases - European Conference,  ECML PKDD 2012, Bristol, UK, September 24-28, 2012. Proceedings, Part  II. Springer 2012 Lecture Notes in Computer Science 7524, 2012: 838-841. Frank Rosner, Alexander Hinneburg, Martin Gleditzsch, Matthias Priebe, Andreas Both: Fast sampling word correlations of high dimensional text data (abstract only).SIGMOD Conference 2012: 866 Andre Gohr, Alexander Hinneburg, Myra Spiliopoulou, Ricardo Usbeck: On the distinctiveness of tags in collaborative tagging systems   , in Rajendra Akerkar (Ed.): Proceedings  of the International Conference on Web Intelligence, Mining and  Semantics, WIMS 2011, Sogndal, Norway, May 25 - 27, 2011. ACM 2011: 62. Andre Gohr, Myra Spiliopoulou, Alexander Hinneburg: Visually Summarizing the Evolution of Documents under a Social Tag   ,  in Proceedings of International Conference on Knowledge Discovery and  Information Retrieval, KDIR, 2010, SciTePress, ISBN 978-989-8425-28-7,  pp. 85-94. Kristin Mittag, Alexander Hinneburg: Ranked Set Search in Medline Documents,  2. Workshop über Daten in den Lebenswissenschaften.  Informatik-Technologien und Support, GI-Jahrestagung, 2010, Leipzig, LNI  P-176, pp.758-764. Alexander Hinneburg: Visualizing Clustering Results   . Encyclopedia of Database Systems 2009: 3417-3425. Christine Staiger, Alexander Hinneburg, Ralf Bernd Klosgen: Diversity in degrees of freedom of mitochondrial transit peptides   , International Oxford Journal on Molecular Biology and Evolution, 26 (8): 1773-1780, 2009. Andre Gohr, Alexander Hinneburg, Rene Schult, Myra Spiliopoulou: Topic Evolution in a Stream of Documents, 2009 SIAM International Conference on Data Mining (SDM 2009), pp. 859-870. Sebastian Klie, Lennart Martens, Juan Antonio Vizcano, Richard Cote,  Phil Jones,  Rolf Apweiler,  Alexander Hinneburg, Henning Hermjakob: Analyzing Large-Scale Proteomics Projects with Latent Semantic Indexing   , J. Proteome Res., 7 (01), 182191  10.1021/pr070461k, research profile:Turning data graveyards into gold mines Alexander Hinneburg, Hans-Henning Gabriel, Andre Gohr: Bayesian Folding-In with Dirichlet Kernels for PLSI, IEEE International Conference on Data Mining, ICDM 2007, Omaha, USA, pp. 499-504. Alexander Hinneburg, Andrea Porzel, Karina Wolfram: An Evaluation of Text Retrieval Methods for Similarity Search of multi-dimensional NMR-Spectra, in Proc. of International Conference on Bioinformatics Research and Development, BIRD 2007, LNBI Springer ,Berlin, Germany. Björn Egert, Steffen Neumann, Alexander Hinneburg: Fast approximate Duplicate Detection of 2D-NMR Spectra, in Proc. of International Workshop on Data Integration in the Life Sciences 2007 (DILS'07), LNBI Springer, Philadelphia, USA. Alexander Hinneburg, Hans-Henning Gabriel: DENCLUE 2.0: Fast Clustering based on Kernel Density Estimation, in Proc. of International Symposium on Intelligent Data Analysis 2007 (IDA'07), LNAI Springer, Ljubljana, Slowenien. Sebastian Klie, Lennart Martens, Juan Antonio Vizcaino, Richard  Cote, Phil Jones, Rolf Apweiler, Alexander Hinneburg, Henning Hermjakob:  An application of latent topic document analysis to large-scale proteomics databases, in Proc. of German Bioinformatics Conference 2007 (GCB'07), LNBI Springer, Potsdam, Germany. Alexander Hinneburg, Heikki Mannila, Samuli Kaislaniemi, Terttu Nevalainen, Helena Raumolin-Brunberg: How to Handle Small Samples: Bootstrap and Bayesian Methods in the Analysis of Linguistic Change   , International Oxford Journal on Literary and Linguistic Computing, 2007, doi: 10.1093/llc/fqm006 . Alexander Hinneburg, Björn Egert, Andrea Porzel: Duplicate detection of 2D-NMR Spectra    in Journal of Integrative Bioinformatics, 4(1):53, 2007. Karina Wolfram, Andrea Porzel, Alexander Hinneburg: Similarity Search for multi-dimensional NMR-Spectra of Natural Products,  in Proc. of 10th European Conference on Principles and Practice of  Knowledge Discovery in Databases, PKDD 2006, LNCS Springer ,Berlin,  Germany, pp. 650-658. Alexander Hinneburg, Dirk Habich, Marcel Karnstedt: Analyzing Data Streams by Online DFT,  in Proc. of the International ECML/PKDD Workshop on Knowledge Discovery  from Data Streams, KDDS 2006, Berlin, Germany, pp. 67-76. Stefan Brass, Alexander Hinneburg: Tagungsband: Grundlagen von Datenbanken, GvD 2006, Wittenberg, Juni 2006. Alexander Hinneburg, Andreas Hotho, Ralf Klinkenberg: Tagungsband: Knowledge Discovery, Data Mining und Maschinelles Lernen, KDML 2006   ,  Hildesheim, 2006. A. Gionis, A. Hinneburg, S. Papadimitriou, P. Tsaparas: Dimension induced clustering, KDD 2005: 51-60, ACM. (Talk) D. Habich, W. Lehner, A. Hinneburg: Optimizing Multiple Top-K Queries over Joins. SSDBM 2005: 195-204, IEEE. D. Habich, W. Lehner, A. Hinneburg, P. Kitzmantel, M. Kimpl: Eyes4Ears - More than a Cla",
  "content_length": 14169,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:25"
}