{
  "name": "Alexander Rabinovich",
  "homepage": "http://www.cs.tau.ac.il/~rabinoa",
  "status": "success",
  "content": "Alexander Rabinovich Alexander Rabinovich Tel Aviv University School of Computer Science Ramat Aviv, Tel Aviv 69978, Israel 972-3-6405388 (voice) 972-3-6409357 (fax) rabinoa at tauex.tau.ac.il Fields of interest SEMANTICS FOUNDATION OF CONCURRENCY PROGRAM VERIFICATION LOGICS IN COMPUTER SCIENCE Activities Editor of Fundamenta Informaticae Program Committees The Fourteenth International Symposium on Games, Automata, Logics, and Formal Verification (GandALF 23) September 18-20, 2023, Udine Italy. Trakhtenbrot 100 Event OCTOBER 24-25 2021, Tel Aviv 13th International Conference on Reachability Problems SEPTEMBER 11-13 2019, BRUSSELS, BELGIUM CSR 2019 Jul 1, 2019 - Jul 5, 2019,\tNovosibirsk, Russian Federation FSTTCS 2018 December 1014, 2018 Conference on Reachability Problems. 24 - 26 SEPTEMBER 2018, MARSEILLE, FRANCE LICS 2017 June 2023, 2017  Reykjavik CONCUR 2017 Berlin, Sept. 4-9 Workshop on Reachability Problems. September 2016, 19 - 21 September 2016, Aalborg, Denmark Workshop on Reachability Problems. September 2015, Warsaw, Poland 40th International Symposium on Mathematical Foundations of Computer Science August 24-28, 2015 Milano (Italy) Workshop on Reachability Problems. September 2014, Oxford, UK MFCS 2014, 25-29 August 2014, Budapest, Hungary Symposium on Temporal Representation and Reasoning 2014, September 2014, Verona, Italy FoSSaCS 2014, 5-13 April 2014, Grenoble, France STACS 2014, Lyon, at ENS Lyon, Mar 5  Mar 8, France MFCS 2013, August 26 - 30, 2013, IST, Austria. Symposium on Games, Automata, Logic, and Formal Languages (GandALF) 2013, Borca di Cadore, Dolomites, Italy - August 29th-31th, 2013 Highlights of logic, games and automata. PARIS, 1821 SEPTEMBER 2013 Publications DBLP On-line available papers Logic and Formal Methods Seminar Time: 12-14 Wednesdays. Place: Kaplun 325. List of the talks Spring Semester (Fall Semester) Laboratory for Logic Logic and Computer Science Semester at Tel Aviv Workshop on Verification of Infinite-State Systems (May 12-14, 2009) Courses Selected Topics in Programming Logic for Computer Science, Spring semester, 2006 Verification of Hardware and Software Winter semester, 2002 SEMINAR Automata, Logic and Games , 2017 Verification of Hardware and Software Exam 2011 Verification of Hardware and Software 2011 Exam Useful links Virtual Library: Concurrent Systems Logic in Israel The Electronic Colloquium on Computational Complexity DBLP School of Mathematical Sciences",
  "content_length": 2460,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:39"
}