{
  "name": "Alexander Gamero-Garrido",
  "homepage": "https://www.gamero-garrido.com",
  "status": "success",
  "content": "Home | Dr. Gamero-Garrido top of pageResearch Interests Computer Networks Public Policy Online Privacy Internet Measurement Education PhD in Computer Science, University of California San Diego MS in Technology and Policy, MIT BE in Electronics Engineering, U. Simón Bolívar — Venezuela Lund University — Sweden (thesis) ​ Biography I am an Assistant Professor of Computer Science at the University of California Davis. My research is at the intersection of computer networks and public policy with an emphasis on online privacy. My work yields methodologies and analyses that provide empirical evidence on contentious questions in technology policy. I use conventional methods from both computer networking (large-scale Internet measurements) and the social sciences (surveys). My research focuses on three areas: (i) inferring capabilities for government surveillance created by the macroscopic structure of the Internet; (ii) revealing commercial surveillance enabled by consumer devices; (iii) Internet policy issues in the United States. My research in these areas is published in major Association for Computing Machinery (ACM) conferences on both cybersecurity (CCS) and networking (SIGCOMM, IMC). My studies have won several awards at computer networking conferences, including SIGCOMM Best Paper. ​ Prior to joining UC Davis, I was a Ford Foundation Post-Doc Fellow at Northeastern, working with David Choffnes. I received my Ph.D. in Computer Science from UC San Diego in 2021, with Alex Snoeren and Alberto Dainotti as advisors. My doctoral dissertation studied the exposure to observation and selective tampering of traffic flowing toward countries, as well as their organizations and critical sectors. During my doctoral studies, I received Microsoft Research’s Dissertation Grant and served on the board of UCSD’s Graduate Women in Computing to advance inclusive excellence in the field. ​ At Northeastern, I was also awarded the Future Faculty Fellowship and served as the Cultural and Spiritual Life Staff Affiliate, LGBTQA Resource Center. In broader academia, I have worked as an external reviewer for refereed publications ACM SIGCOMM CCR and Performance Evaluation, and served on the Technical Program Committee for IMC, PETS, PAM, TMA and ANRW. Before joining Northeastern, I worked for the United Nations, major tech company Akamai, and Schlumberger, a Fortune 500 company, where I served as a positioning engineer on a vessel that sailed around Europe, the Middle East, and North America. ​ Misc In my spare time, I enjoy photography, cooking, running, biking, and contemporary dance. I have also volunteered for political campaigns in the US and Venezuela, and visited 30 countries and over half of US states. The header image was taken at Parque 3 de Febrero in Buenos Aires, Argentina. My all-time favorite quote is from a poem by Antonio Machado: \"Caminante, no hay camino, se hace camino al andar\" (Traveler, there is no road; you make your own path as you walk). I am a Queer Venezuelan-Californian. I live in the San Francisco Bay Area with my husband and our Yorkie-Dachsund. My pronouns are he/they/él. ​ Current Ph.D. Students ​ Nishant Acharya Humaira Fasih Ahmed Hashmi Shivani Kalamadi Muhammad Jazlan (main advisor: Zubair Shafiq) Sachin Kumar Singh (main advisor: Rob Ricci) Ashutosh Kshirsagar (main advisors: Michael Ann DeVito & Ada Lerner) Karthik Nishanth (via ISOC PULSE; main advisor: Nguyen Phong Hoang) Riya Ponraj (via ISOC PULSE; main advisor: Ram Durairajan) ​ Updates​ Sep. '25. I was a podcast guest in Episode 4 of Internet Changemakers by the Internet Society, discussing how Internet measurement reveals outages, latency, and surveillance across global networks. Apr. '25. Our article \"Empirically Measuring Data Localization in the EU\" was accepted to appear in PETS 2025! ​Mar. '25.  I’ve been named one of five ISOC PULSE global Mentors. Announcement from UC Davis College of Engineering. A student from my lab, Nishant Acharya, also received the PULSE fellowship (even more competitive). We are the only lab to have both a mentor and a fellow awarded this year. Jul. '24. We received the Caspar Bowden PET Award Runner-Up! Jun. '24. Our proposal to study the availability, reliability and performance of public networks, including public libraries, was funded by the NSF! Apr. '24. I gave a talk hosted by UC Davis CAMPOS. More details about our data localization method in this 2023 pre-print. Apr. '24. I will serve on the Program Committee of PETS '25. Apr. '24. Our PNAS Nexus paper was featured on the frontpage of UC Davis News. Jan. '24. Our paper was accepted to appear in PNAS Nexus! The study, \"Network Topology Facilitates Internet Traffic Control in Autocracies\", is a trans-Atlantic and cross-disciplinary collaboration between a team of political scientists (led by Eda Keremoglu, the study's first author) and a group of computer scientists led by me. Oct. '23. We received the Best Paper Award at IMC! Aug. '23. I have been awarded the CAMPOS Faculty Scholar Award jointly by UC Davis and the California State Assembly (Legislature). Jul. '23. I have joined UC Davis as an Assistant Professor of Computer Science, the greatest professional honor of my lifetime. Jul. '23. David Choffnes and I have been awarded a grant by the Comcast Innovation Fund! Mar. '23. I have been invited to my first NSF panel! Jan. '23. I will serve on the technical program committee of IMC 2023. Dec. '22. I am a Co-PI on our NSF NeTS Medium proposal: Measurement, Modeling and Analysis to Assess Network Connectivity and Performance at Anchor Institutions. Oct '22. We answer frequently asked questions about the pre-print Your Echos are Heard: Tracking, Profiling, and Ad Targeting in the Amazon Smart Speaker Ecosystem on the project website. Oct. '22. We presented a poster at IMC in Nice, France, on our Reverse IP Geolocation technique. Jul. '22. I was awarded the Ford Foundation Postdoctoral Fellowship by the National Academy of Sciences. Northeastern Khoury News interviewed me on this award and the underlying research we proposed that is focused on the digital divide. Jun. '22. Honored to be featured in the IEEE Computer Society's Pride in STEM interview series. Mar. '22. My co-authors and I were honored to receive the Best Dataset Award at the Passive and Active Measurement Conference (PAM). Jan. '22. Thrilled by David Choffnes' and Theo Benson's invitation to serve to serve on the Technical Program Committee of the Internet Measurement Conference (ACM SIGCOMM IMC). Dec. '21.  A paper largely based on my doctoral thesis was accepted to appear at the Passive and Active Measurement Conference (PAM '22). Nov. '21. I am honored to serve on the PAM Program Committee. Nov. '21. We hosted an IMC \"Pod\" at Northeastern. Aug. '21. Our submission \"Identifying ASes of State-Owned Internet Operators\" was accepted to IMC 2021. Aug. '21. I defended my doctoral dissertation. Grateful to the committee members (Stefan Savage, Aaron Schulman and Margaret Roberts, along with my advisors) for their time and valuable feedback. April '21. Honored to have been awarded Northeastern University's Future Faculty Fellowship (Postdoctoral). In 2019, Microsoft Research named me a recipient of their Dissertation Grant. Very honored that our proposal was among 11 selected from over 200. In 2018, my co-authors and I were honored to be awarded the SIGCOMM Best Paper Award. ​Selected Publications ​Empirically Measuring Data Localization in the EU Alexander Gamero-Garrido, Kicho Yu, Sumukh Vasisht Shankar, Sachin Kumar Singh, Sindhya Balasubramanian, Alexander Wilcox, David Choffnes. To appear in the 25th Privacy Enhancing Technologies Symposium (PETS '25). Washington, DC, 2025. ​ Network Topology Facilitates Internet Traffic Control in Autocracies [Internet Society PULSE Blog Post] [UC Davis News Article] [Related presentation slides] Eda Keremo ̆glu, Nils B. Weidmann, Alexander Gamero-Garrido, Esteban Carisimo, Alberto Dainotti, Alex C. Snoeren. Proceedings of the National Academy of Sciences Nexus (PNAS Nexus). Oxford University Press, 2024. ​ Tracking, Profiling, and Ad Targeting in the Alexa Echo Smart Speaker Ecosystem - Best Paper at IMC 2023 [Conference Talk] [UCD College of Engineering Article] [News Coverage on The Verge] Umar Iqbal, Pouneh Nikkhah Bahrami, Rahmadi Trimananda, Hao Cui, Alexander Gamero-Garrido, Daniel J. Dubois, David Choffnes, Athina Markopoulou, Franziska Roesner, Zubair Shafiq. Proceedings of the ACM SIGCOMM IMC Conference (IMC '23). Montreal, 2023. ​ Quantifying Nations’ Exposure to Traffic Observation and Selective Tampering - Best Dataset at PAM 2022 [Slides] [Conference Talk] [Dataset] [Blog Post at EurekAlert! AAAS] Alexander Gamero-Garrido, Esteban Carisimo, Shuai Hao, Bradley Huffaker, Alex C. Snoeren, Alberto Dainotti. Passive and Active Measurement Conference (PAM '22). Springer. Virtual, March 2022. ​ Identifying ASes of State-Owned Internet Operators [Blog Post at APNIC][Dataset] Esteban Carisimo, Alexander Gamero-Garrido, Alex C. Snoeren, Alberto Dainotti. Proceedings of the ACM SIGCOMM IMC Conference. Virtual, November 2021.​ ​ Transit Influence of Autonomous Systems: Country-Specific Exposure of Internet Traffic Alexander Gamero-Garrido. Ph.D. Dissertation. UC San Diego. 2021. ​ Inferring Internet Interdomain Congestion - Best Paper at SIGCOMM 2018 Amogh Dhamdhere, David D. Clark, Alexander Gamero-Garrido, Matthew Luckie, Ricky K. P. Mok, Gautam Akiwate, Kabir Gogia, Vaibhav Bajpai, Alex C. Snoeren, and kc claffy. Proceedings of the ACM SIGCOMM Conference. Budapest, Hungary, August 2018. ​ Quantifying the Pressure of Legal Risks on Third-party Vulnerability Research [Slides] [Blog Post] Alexander Gamero-Garrido, Stefan Savage, Kirill Levchenko, and Alex C. Snoeren. In Proceedings of the 2017 ACM SIGSAC Conference on Computer and Communications Security (CCS '17). ACM, New York, NY, USA, 1501-1513. ​​bottom of page",
  "content_length": 9963,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:21"
}