{
  "name": "Alex Gammerman",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/alex-gammerman_66fed543-6231-42fe-920c-92ba917c2ce1.html",
  "status": "success",
  "content": "Alex Gammerman - Royal Holloway Research Portal View Scopus Profile Alex Gammerman Professor Professor of Computer Science, Department of Computer ScienceCentre for Machine LearningCentre for Reliable Machine Learning Phone+44 1784 443434EmailA.Gammermanrhul.acukWebsitehttps://cml.rhul.ac.uk/people.html TW20 0EX Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 34 Conference contribution 31 Article 21 Chapter (peer-reviewed) 8 Working paper 24 More 6 Chapter 6 Editorial 3 Abstract 3 Other contribution 2 Book 1 Other 1 Paper 1 Conference article 1 Patent Research output per year Research output per year Conformal e-testingVovk, V., Nouretdinov, I. & Gammerman, A., Dec 2025, In: Pattern Recognition. 168, p. 1-9 111841.Research output: Contribution to journal › Article › peer-review Open Access Validity and efficiency of the conformal CUSUM procedureVovk, V., Nouretdinov, I. & Gammerman, A., 15 Aug 2025, Proceedings of Machine Learning Research (COPA 2025). An Nguyen, K., Luo, Z., Papadopoulos, H., Lofstrom, T., Carlsson, L. & Bostrom, H. (eds.). Vol. 266. p. 576-594 Research output: Chapter in Book/Report/Conference proceeding › Chapter (peer-reviewed) › peer-review Open Access Calibrated Large Language Models for Binary Question AnsweringGiovannotti, P. & Gammerman, A., Oct 2024, In: Proceedings of Machine Learning Research. 230, p. 218-235 18 p.Research output: Contribution to journal › Conference article › peer-review Open Access The Venn-ABERS Testing for Change-Point DetectionNouretdinov, I. & Gammerman, A., Aug 2023, 2 p. Proceedings of Machine Learning Research: COPA 2023 12th Symposium on Conformal and Probabilistic Prediction with Applications.Research output: Other contribution Algorithmic Learning in a Random WorldVovk, V., Gammerman, A. & Shafer, G., Dec 2022, Second ed. Cham. 502 p.Research output: Book/Report › Book View all 118 research outputs Projects 16 Finished Projects per year Conformal Martingales for Change-Point DetectionGammerman, A. (PI) & Vovk, V. (CoI)Amazon1/06/20 → 31/05/21Project: Research Models of Predictive MaintenanceGammerman, A. (PI)Centrica1/10/18 → 30/09/19Project: Research Machine Learning for Chemical SynthesisGammerman, A. (PI), Toccaceli, P. (Researcher), Vovk, V. (CoI) & Luo, Z. (CoI)AstraZeneca1/05/17 → 30/06/18Project: Research Exascale Compound Activity Prediction EngineGammerman, A. (PI), Vovk, V. (CoI) & Luo, Z. (CoI)European Union1/09/15 → 31/08/18Project: Research Mining the Network Behaviour of BotsCavallaro, L. (PI), Gammerman, A. (CoI), Vovk, V. (CoI), Shanahan, H. (CoI) & Luo, Z. (CoI)Eng & Phys Sci Res Council EPSRC16/06/13 → 17/04/17Project: Research View all 16 projects",
  "content_length": 3283,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:08"
}