{
  "name": "Alexios Voulimeneas",
  "homepage": "https://alexios-voulimeneas.github.io",
  "status": "success",
  "content": "Alexios Voulimeneas News September 2025: Our paper “Clair Obscur: The Light and Shadow of System Call Interposition – From Pitfalls to Solutions with K23” got accepted at Middleware 2025. Congrats Jesús, Vissarion, Antreas, Fernando, George, and Bart. For those who come after! July 2025: Article at the Security Management Magazine about our recent ACSAC 2024 [paper] is [out]. Thanks Sarala for the great interview and article!!! June 2025: Another proposal was not funded (0/3)! June 2025: Another proposal was not funded (0/2)! May 2025: Vissarion Moutafis successfully defended his MSc thesis and will be joining our group as a PhD student. Congratulations, Vissarion! April 2025: Our European project proposal was not funded this round (0/1)! March 2025: Our paper “Divide and Conquer: Introducing Partial Multi-Variant Execution” got accepted at Euro S&P 2025. Congrats Jonas, Adriaan, and Stijn. February 2025: Tenure, finally—through blisters and bedrock! This would never have been possible without the unwavering support of so many people, both professionally and personally. Grateful beyond words for the mentors, colleagues, friends, and family who guided, encouraged, and believed in me through every challenge and milestone! December 2024: We won one of the two awarded Best Paper Awards at ACSAC 2024 (out of a total of 83 accepted papers / 424 total papers submitted to the conference / 381 strictly reviewed papers after desk rejects). Congratulations and thanks to my co-authors André, Stijn, and Michael! Bio I am a tenured Assistant Professor in the Cybersecurity research group at TU Delft. I lead the Secure Systems Lab (SSL), and I am also an occasional visitor researcher at the European Space Agency. From September 2020 until August 2023, I was a Postdoctoral Scholar in the DistriNet research group at KU Leuven’s Technology Campus in Ghent, Belgium. I obtained my PhD degree from UC Irvine in 2020 under the supervision of Professor Michael Franz. In my PhD dissertation, I proposed new techniques to improve the security and performance of N-Variant eXecution (NVX) systems. Before that, I completed my undergraduate studies at Athens University of Economics and Business/Department of Informatics, Greece. I have also done internships at Oracle Labs and Apple. You can contact me at A.Voulimeneas AT tudelft DOT nl or Twitter. (link to full CV) Research My research interests include: Systems Security Operating Systems Computer Networks and Distributed Systems Publications Clair Obscur: The Light and Shadow of System Call Interposition – From Pitfalls to Solutions with K23 Jesús María Gómez, Vissarion Moutafis, Antreas Dionysiou, Fernando Kuipers, Georgios Smaragdakis, Bart Coppens, and Alexios Voulimeneas. (To Appear) In ACM/IFIP International Middleware Conference (Middleware 2025). Divide and Conquer: Introducing Partial Multi-Variant Execution [PDF][code] Jonas Vinck, Adriaan Jacobs, Alexios Voulimeneas, and Stijn Volckaert. In IEEE European Symposium on Security and Privacy (Euro S&P 2025). Moneta: Ex-Vivo GPU Driver Fuzzing by Recalling In-Vivo Execution States [PDF][code] Joonkyo Jung, Jisoo Jang, Yongwan Jo, Jonas Vinck, Alexios Voulimeneas, Stijn Volckaert, and Dokyung Song. In Network and Distributed System Security Symposium (NDSS 2025). [Acceptance Rate: 211/1311=16.1%] I’ll Be There for You! Perpetual Availability in the A8 MVX System [PDF][code] André Rösti, Stijn Volckaert, Michael Franz, and Alexios Voulimeneas. In Annual Computer Security Applications Conference (ACSAC 2024). Distinguished Paper with Artifact Award [Acceptance Rate: 83/381=21.8%] (83 papers accepted out of 424 total papers submitted to the conference / 381 strictly reviewed papers after what the program committee called “aggressive desk rejects” = 21.8% of the actually reviewed papers) Artifact Evaluation Badges: The Astonishing Evolution of Probabilistic Memory Safety: From Basic Heap-Data Attack Detection towards Fully Survivable Multi-Variant Execution [PDF] André Rösti, Alexios Voulimeneas, and Michael Franz. In IEEE Security & Privacy 2024. Orbital Shield: Rethinking Satellite Security in the Commercial Off-the-Shelf Era [PDF] Nikita Yadav, Franziska Vollmer, Ahmad-Reza Sadeghi, Georgios Smaragdakis, and Alexios Voulimeneas. In IEEE Conference on Security for Space Systems (3S) 2024. System Call Interposition Without Compromise [PDF][code] Adriaan Jacobs, Merve Gülmez, Alicia Andries, Stijn Volckaert, and Alexios Voulimeneas. In IEEE/IFIP International Conference on Dependable Systems and Networks (DSN 2024). [Acceptance Rate: 42/203=20%] Artifact Evaluation Badges: A run a day won’t keep the hacker away: Inference attacks on endpoint privacy zones in fitness tracking social networks Karel Dhondt, Victor Le Pochat, Alexios Voulimeneas, Wouter Joosen, and Stijn Volckaert. In BlackHat Asia 2023. A run a day won’t keep the hacker away: Inference attacks on endpoint privacy zones in fitness tracking social networks [PDF] Karel Dhondt, Victor Le Pochat, Alexios Voulimeneas, Wouter Joosen, and Stijn Volckaert. In ACM Conference on Computer and Communications Security (CCS 2022). [Acceptance Rate: 218/971=22.5%] You Shall Not (by)Pass! Practical, Secure, and Fast PKU-based Sandboxing [PDF][code][slides] Alexios Voulimeneas, Jonas Vinck, Ruben Mechelinck, and Stijn Volckaert. In European Conference on Computer Systems (EuroSys 2022). [Acceptance Rate: 42/162=25.9%] Sharing is Caring: Secure and Efficient Shared Memory Support for MVEEs [PDF][code][slides] Jonas Vinck, Bert Abrath, Bart Coppens, Alexios Voulimeneas, Bjorn De Sutter, and Stijn Volckaert. In European Conference on Computer Systems (EuroSys 2022). [Acceptance Rate: 42/162=25.9%] dMVX: Secure and Efficient Multi-Variant Execution in a Distributed Setting [PDF][video][slides] Alexios Voulimeneas, Dokyung Song, Per Larsen, Michael Franz, and Stijn Volckaert. In European Workshop on Systems Security (EuroSec 2021). Building the Next Generation of Security Focused NVX Systems:Overcoming Limitations of N-Variant Execution [PDF][slides] Alexios Voulimeneas. PhD dissertation, UC Irvine, 2020. Distributed Heterogeneous N-Variant Execution [PDF][video][slides] Alexios Voulimeneas, Dokyung Song, Fabian Parzefall, Yeoul Na, Per Larsen, Michael Franz, and Stijn Volckaert. In International Conference on Detection of Intrusions and Malware & Vulnerability Assessment (DIMVA 2020). [Acceptance Rate: 13/45=28.9%] Secure and Efficient Application Monitoring and Replication [PDF][code] Stijn Volckaert, Bart Coppens, Alexios Voulimeneas, Andrei Homescu, Per Larsen, Bjorn De Sutter, and Michael Franz. In USENIX Annual Technical Conference (ATC 2016). [Acceptance Rate: 47/266=17.6%] A Reliable Multicast Transport Protocol for Information-Centric Networks [PDF] Charilaos Stais, George Xylomenos, and Alexios Voulimeneas. In Journal of Network and Computer Applications (JNCA 2014). Towards an Error Control Scheme for a Publish/Subscribe Network [PDF] Charilaos Stais, Alexios Voulimeneas, and George Xylomenos. In International Conference on Communications (ICC 2013). Towards an Error Control Scheme for a Publish/Subscribe Network [PDF] Alexios Voulimeneas. B.Sc. Thesis Project report, Athens University of Economics and Business/Department of Informatics, 2012. Professional Service (EuroSys) European Conference on Computer Systems, Program Committee [2023, 2027] (ACM REP) General Chair, [2026] (ISSN 2078-2489) Information, Reviewer, [2025] (CCS) ACM Conference on Computer and Communications Security, Treasurer, [2026] (HotOS) ACM SIGOPS Workshop on Hot Topics in Operating Systems, Proceedings Chair [2027] (SOSP) ACM Symposium on Operating Systems Principles, Artifact Evaluation Committee Chair [2026] (ACSAC) Annual Computer Security Applications Conference, Program Committee [2025] (SYSTOR) ACM International Systems and Storage Conference, Program Committee [2025] (EuroSys) European Conference on Computer Systems, Proceedings Chair [2025] (ACNS) International Conference on Applied Cryptography and Network Security, Program Committee [2025] (S&P) IEEE Symposium on Security and Privacy, Program Committee [2025, 2026] (USENIX Security) USENIX Security Symposium, Program Committee [2024, 2025, 2026] (Middleware) ACM/USENIX/IFIP International Middleware Conference, Program Committee [2023, 2025] (ISC) Information Security Conference, Program Committee [2024, 2025] (EuroSec) European Workshop on System Security, Program Committee [2024, 2025] (DIMVA) Conference on Detection of Intrusions and Malware & Vulnerability Assessment, Program Committee [2024] (CCS) ACM Conference on Computer and Communications Security, Program Committee [2023, 2024, 2026] [Top Reviewer Award, 2023] (USENIX Security) USENIX Security Symposium, Artifact Evaluation Publication Chair [2023] (ASIACCS) ACM ASIA Conference on Computer and Communications Security, Program Committee [2023, 2024] [Best Reviewer Award, 2023] (ESORICS) European Symposium on Research in Computer Security, Program Committee [2022, 2023] (PLDI) ACM SIGPLAN Conference on Programming Language Design and Implementation, Artifact Evaluation Committee [2022] (EuroSys) European Conference on Computer Systems, Artifact Evaluation Committee [2022] [Distinguished Reviewer Artifact Award, 2022] (USENIX Security) USENIX Security Symposium, Artifact Evaluation Committee [2022] (EuroSys) European Conference on Computer Systems, External Reviewer [2021, 2022] (ROOTS) Reversing and Offensive-oriented Trends Symposium, Program Committee [2020, 2021, 2022] (OSDI) USENIX Symposium on Operating Systems Design and Implementation, Artifact Evaluation Committee [2020] (S&P) IEEE Symposium on Security and Privacy, Student Program Committee Member [2018] Teaching [Since 2024] Computer Security [Since 2024] Systems Security Current Postdocs Antreas Dionysiou (2025-Present, TU Delft, Marie Skłodowska-Curie Postdoctoral Fellow Co-Hosting with Georgios Smaragdakis) Current PhD Students Vissari",
  "content_length": 10331,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:07"
}