{
  "name": "Alexander Krull",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/krull-alexander.aspx",
  "status": "success",
  "content": "Dr Alexander Krull - School of Computer Science - University of Birmingham Dr Alexander Krull School of Computer ScienceAssistant Professor of Data Science and Artificial Intelligence Contact details Emaila.f.f.krull@bham.ac.uk View my research portal AddressUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Dr. Alexander Krull is Assistant Professor in Data Science and Artificial Intelligence at the University of Birmingham's School of Computer Science. He is a member of COMPARE. His research focuses on developing advanced methods for image analysis and denoising, particularly for microscopy applications. Dr. Krull is a pioneer in establishing self-supervised and unsupervised denoising methods that do not require clean reference images for training.  Notably, he introduced Noise2Void, a self-supervised approach that enables denoising from unpaired noisy images without the need for clean targets. In more recent research, Dr. Krull works on utilising generative image models for unsupervised denoising, leading to approaches such as  GAP (Generative Accumulation of Photons) and COSDD (COrrelated and Signal-Dependent Denoising), which are capable of accounting the inherent uncertainty of the denoising problem. Dr. Krull’s contributions have been widely utilised in the life science community. His work has significantly advanced the application of deep learning techniques in biomedical imaging. Personel Website Recent publications Article Iwamoto, Y, Salmon, B, Yoshioka, Y, Kojima, R, Krull, A & Ota, S 2025, 'High throughput analysis of rare nanoparticles with deep-enhanced sensitivity via unsupervised denoising', Nature Communications, vol. 16, no. 1, 1728. https://doi.org/10.1038/s41467-025-56812-y von Chamier, L, Laine, RF, Jukkala, J, Spahn, C, Krentzel, D, Nehme, E, Lerche, M, Hernández-Pérez, S, Mattila, PK, Karinou, E, Holden, S, Solak, AC, Krull, A, Buchholz, T-O, Jones, ML, Royer, LA, Leterrier, C, Shechtman, Y, Jug, F, Heilemann, M, Jacquemet, G & Henriques, R 2021, 'Democratising deep learning for microscopy with ZeroCostDL4Mic', Nature Communications, vol. 12, no. 1, 2276. https://doi.org/10.1038/s41467-021-22518-0 Laine, RF, Jacquemet, G & Krull, A 2021, 'Imaging in focus: an introduction to denoising bioimages in the era of deep learning', The International Journal of Biochemistry & Cell Biology, vol. 140, 106077. https://doi.org/10.1016/j.biocel.2021.106077 Krull, A, Hirsch, P, Rother, C, Schiffrin, A & Krull, C 2020, 'Artificial-intelligence-driven scanning probe microscopy', Communications Physics, vol. 3, no. 1, pp. 1-8. Chapter Buchholz, T-O, Prakash, M, Schmidt, D, Krull, A & Jug, F 2020, DenoiSeg: Joint Denoising and Segmentation. in DenoiSeg: Joint Denoising and Segmentation. https://doi.org/10.1007/978-3-030-66415-2_21 Goncharova, AS, Honigmann, A, Jug, F & Krull, A 2020, Improving Blind Spot Denoising for Microscopy. in Improving Blind Spot Denoising for Microscopy. https://doi.org/10.1007/978-3-030-66415-2_25 Conference contribution Salmon, B & Krull, A 2025, Unsupervised Denoising for Signal-Dependent and Row-Correlated Imaging Noise. in 2025 IEEE/CVF Winter Conference on Applications of Computer Vision (WACV). IEEE Workshop on Applications of Computer Vision (WACV), IEEE, pp. 2379-2389, 2025 IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), Tuscon, Arizona, United States, 28/02/25. https://doi.org/10.1109/WACV61041.2025.00237 Liu, Y, Krull, A, Basevi, H, Leonardis, A & Jenkins, M 2024, bit2bit: 1-bit quanta video reconstruction via self-supervised photon prediction. in Advances in Neural Information Processing Systems 37 (NeurIPS 2024). Advances in neural information processing systems, vol. 37, NeurIPS, Thirty-Eighth Annual Conference on Neural Information Processing Systems, Vancouver, British Columbia, Canada, 10/12/24. <https://openreview.net/forum?id=HtlfNbyfOn> Krull, A, Basevi, H, Salmon, B, Zeug, A, Müller, F, Tonks, S, Muppala, L & Leonardis, A 2024, Image Denoising and the Generative Accumulation of Photons. in 2024 IEEE/CVF Winter Conference on Applications of Computer Vision (WACV). IEEE Workshop on Applications of Computer Vision (WACV), IEEE, pp. 1528-1537, 2024 IEEE/CVF Winter Conference on Applications of Computer Vision, Waikoloa, Hawaii, United States, 4/01/24. https://doi.org/10.1109/WACV57701.2024.00155 Cheng, X, Jia, X, Lu, W, Li, Q, Shen, L, Krull, A & Duan, J 2024, WiNet: Wavelet-Based Incremental Learning for Efficient Medical Image Registration. in Medical Image Computing and Computer Assisted Intervention – MICCAI 2024: 27th International Conference, Marrakesh, Morocco, October 6–10, 2024. Lecture Notes in Computer Science, vol. 15002, Springer, 27th International Conference on Medical Image Computing and Computer Assisted Intervention, Marrakesh, Morocco, 6/10/24. https://doi.org/10.1007/978-3-031-72069-7_71 Salmon, B & Krull, A 2023, Direct Unsupervised Denoising. in 2023 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW). Proceedings of the IEEE/CVF International Conference on Computer Vision (ICCV) Workshops, IEEE, pp. 3840-3847, 2023 International Conference on Computer Vision, Paris, France, 2/10/23. Tonks, S, Hsu, C, Hood, S, Musso, R, Hopely, C, Doan, M, Edwards, E, Krull, A & Styles, I 2023, Evaluating virtual staining for high-throughput screening. in 2023 IEEE 20th International Symposium on Biomedical Imaging (ISBI)., 10230501, ISBI, IEEE, 20th IEEE International Symposium on Biomedical Imaging, Cartagena , Colombia, 18/04/23. https://doi.org/10.1109/ISBI53787.2023.10230501 Salmon, B & Krull, A 2023, Towards structured noise models for unsupervised denoising. in L Karlinsky, T Michaeli & K Nishino (eds), Computer Vision – ECCV 2022 Workshops: Tel Aviv, Israel, October 23–27, 2022, Proceedings, Part IV. 1 edn, Lecture Notes in Computer Science, vol. 13804, Springer, Cham, pp. 379–394. https://doi.org/10.1007/978-3-031-25069-9_25 Prakash, M, Lalit, M, Tomancak, P, Krull, A & Jug, F 2020, Fully unsupervised probabilistic noise2void. in 2020 IEEE 17th International Symposium on Biomedical Imaging (ISBI). pp. 154-158. Preprint Salmon, B & Krull, A 2023 'Unsupervised Denoising for Signal-Dependent and Row-Correlated Imaging Noise' arXiv, pp. 1-32. https://doi.org/10.48550/arXiv.2310.07887 View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 6466,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:29"
}