{
  "name": "Alexander Meschtscherjakov",
  "homepage": "https://hci.sbg.ac.at/person/meschtscherjakov",
  "status": "success",
  "content": "Alexander Meschtscherjakov - hci.plus Alexander Meschtscherjakov Alexander is Professor for Human-Centered Design at Salzburg University. He is deputy director of the division Human Computer Interaction (HCI) at the department Artificial Intelligence and Human Interfaces (AIHI). His background is in Computer Sciences. Currently, he is focusing on persuasive interaction technologies, augmented reality interfaces, HCI and sports, HCI and education, automotive user interfaces, contextual user experience and challenges of AI for HCI. In particular, Alexander is interested in how different kinds of modalities can be blended to help people to change their attitudes and behavior to achieve their goals. His focus within automotive interaction lies in driver persuasion by means of ambient light, driver distraction research, and UX in autonomous vehicles. With the increasing of automation in different contexts (e.g. industry 4.0 or automated driving) Alexander is researching how user experience is affected by automation and how to design interaction for an automated world. Alexander is a distinguished author, has presented his work at various conferences, and given keynotes on automation and driving experience. He is an active member of the HCI comunity, has organised several workshops, and was activly involved in the organisation of differnet conferences (e.g., AmI 2009, AutomotiveUI 2011, PERSUASIVE 2016). Research Foci Persuasive Technology Automotive User Interfaces User Experience Research UX & IxD in and with Automous Vehicles Effects of Automation on UX and interaction design Teaching Overview slides teaching HCI winter semster 2018/19 can be found here. University of Salzburg: Basics in Human-Computer Interaction („Grundlagen der Human Computer Interaction“) – 2007 Introduction to HCI („Einführung HCI“) – 2011 The Future of Interaction: An Introduction – 2014, 2015 User Interface Design – 2007, 2010, 2011, 2013 Usability und User Experience Engineering – 2010, 2015, 2016, 2017 Bachelor Project – 2012, 2013, 2014, 2017 User Interface Engineering – 2011, 2012, 2013, 2014, 2016, 2017 Applied HCI (“HCI Anwendungen”) – 2010, 2011, 2012, 2013, 2014, 2015 HCI Studio – 2010, 2013, 2014, 2015, 2016, 2017 HCI Innovation – 2010, 2011, 2012, 2013 Advanced HCI Systems and Methods – 2012, 2013, 2014, 2015, 2016, 2017 Future HCI Approaches – 2013, 2014, 2015, 2016, 2017 Contextual Interfaces – 2015, 2017 Digital Interaction and Communication: Human-Machine-Interaction – 2017 Modern Technologies in an Information Society (Ringvorlesung) – 2015 Digital Communication Theories (Guest Lecture) – 2016, 2017 University of Applied Sciences Salzburg: Basics in Human-Computer Interaction (“Grundlagen Human-Computer Interaction”) – 2013, 2014 Interface Cultures – 2010, 2011, 2012 Interface Technologies – 2013 Next Generation User Interfaces – 2015 University of Applied Sciences Hagenberg: User Experience & Interaction Design – 2015 Supervision PLUS Doctoral Theses (Co-Supervisor): Ilhan Aslan (2014): Interfacing Through Movement – An Integration of Context and Movement Towards Embodied Interaction Design Mark Kramer (ongoing): The Technology Experience of Education: Examining the Adoption and Acceptance of ICTs for use within Austrian Higher Education Sandra Trösterer (ongoing): Gaze Collaboration Doctoral Theses (Advisor): Alexander Mirnig (ongoing): Patterns in Research and Practice: Systems, Use, and Generation Thomas Grah (ongoing): Augmented Human Master Theses (Supervisor): Michael Auracher (ongoing): Motivating People Driving an Self Driving Car Manually Stefan Vikoler (ongoing): Systems to Increase Situation Awareness in Han-Over situations in Automated Vehicles Daniel Brand (ongoing): Influence of Adaptive Digital Mirrors on User Experience Christine Döttlinger (ongoing): Prototypen im Einsatz: Design-Rationale und Prototypingprozesse Philipp Neulinger (ongoing): Interaction Potentials with Digital side Mirrors in Cars Master Theses (Co-Supervisor/Advisor): Oliver Jung (ongoing): Anthropomorphisms in the Automotive Context: Categorization and Impact on Persuasion Magdalena Gärtner (ongoing): How Children adopt and integrate a new Media Technology into their Home Christine Gschwendtner (2015): NFC design space for money and mobile payment Axel Baumgartner (2015): CES: A Contextual Experience Sampling System for Human Computer Interaction Studies In The Wild Rene Leikermoser (2011): Entwicklung eines Editors zum Erstellen von ESM-XML-Dateien in einem benutzerzentrierten Entwicklungsprozess Bachelor Theses (Supervisor): Benedikt Streitwieser (2017): Gaze Assist Victoria Ablinger (2016): Effect of monochromatic short-wavelength light on attention while driving a car Szabolcs Grünwald (2015): UX design for persons with cognitive disabilities (CapKom Project) Bianca Zindt (2014): tApps: Entwicklung angreifbarer Applikationen mittels RFID-Technologie Dominik Fakner (2014): Interaktion mit Bezahlautomaten im öffentlichen Raum Stefan Hasenauer (2014) Interaktion in der Fabrik der Zukunft: Herausforderungen und Möglichkeiten (supervision together with Verena Fuchsberger) Fabian Winkler (2013) Ambient Persuasion in the Car: Comparison of different existing in-car-interfaces and implementation of four prototypes to reduce fuel consumption and foster saver driving Johannes Pogiba (2013) User-Studie: drei Texteingabesysteme im Auto Oliver Janner (2013): Persuasive In-Car Interfaces „Eco Pulse“ Supervision FH Salzburg Bachelor Theses 1 (Supervisor): Reinhard Ecker (2014) Gameful Design in the Automotive Domain Franziska Oberhauser (2014) Die benutzbare und risikoarme Verwendung von Internet im Auto Julian Schwarz (2014) Persuasives Web Design im E-Commerce Bereich Mike Schäkermann (2013) Inspirational Beats: Exploring Potentials of Physiological Data as Input for Interactive Systems Applying the Inspirational Bits Method Bachelor Theses 2 (Supervisor): Julian Schwarz (2015) Aufmerksamkeitserregende Webinterfaces mittels WebGL Michael Rainer (2014) Interaktionsdesign für automobile Anwendungen Matthias Felix Prieth (2014) Persuasive Technology im Web External Advisor, Examiner & Opponent Sven Krome (2017): AutoPlay – Driving Pleasure in a Future of Autonomous Driving,  RMIT University Melbourne, Examiner Mathias Wunsch (2017): Technology Supporting Sustainable Everyday Activities – The Case of Urban Cycling, TU Wien, External examiner for proliferation Arief Ernst Huhn (2016): Location Based Advertising in Context Effects of location, task congruence, and medium type within Location Based Advertising, TU Eindhoven, Reviewer and adviseur Swethan Anand (2014): Personalizing Steering Experiences Using Steer-by-wire Systems, PhD, TU Eindhoven, Opponent Links orcid.org/0000-0001-8116-4522 Personal website Facebook Contact Assoc. Prof. Dr. Alexander Meschtscherjakov Paris Lodron University of Salzburg Department of Artificial Intelligence and Human Interfaces Human Computer Interaction Division Jakob-Haringer-Straße 8 / Techno 5 5020 Salzburg Austria Phone: +43 662 8044 4844 E-Mail: *protected email* News We are proud that we received tha Automotive UI Lasting Impact Award at AUI 2204 for our paper Towards Autonomous Cars: The Effect of Autonomy Levels on Acceptance and User Experience more show more news Research Activities Driver Deskilling Contextual Persuasion Understanding In-car Technology for Traffic Congestion Computer Supported Cooperation Dorsal Haptic Display: Sensory Augmentation of Rear Obstacles Contextual Persuasion The Materiality of Interactions Material & Experiential Foundations Car UX Patterns Contextual Persuasion Gaze Assist Contextual Persuasion Chase Light Contextual Persuasion Proximity-Sensitive Interaction Embodied Interaction Back-of-the-Steering-Wheel (BotSW) Design Space Contextual Persuasion In-car Collaboration Computer Supported Cooperation Driver Distraction Contextual Persuasion Designing Mid-air Authentication Gestures Embodied Interaction Publications 2025Demir, C., Mehran, N., & Meschtscherjakov, A. (2025). Twin the Drive: An HGBR-based Machine Learning Model as a Vehicular Digital Twin for Risk Detection. https://doi.org/10.1145/3744335.3762326Demir, C., Leschke, N., Hannibal, G., Akil, M., & Meschtscherjakov, A. (2025). Understanding Driver Expectations and Preferences Around Data Transparency in Vehicular Digital Twins. In Adjunct Proceedings of the 17th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI Adjunct ’25) (pp. 227-232). ACM. https://doi.org/10.1145/3744335.3758509Höppchen, I., Kulnik, S. T., Meschtscherjakov, A., Niebauer, J., Reich, B., Smeddinck, J. D., & Wurhofer, D. (2025). mHealth Support in Cardiac Care Pathways for Patient Self-Management During Transitions From Hospital to Rehabilitation: Exploratory Field Study. JMIR Cardio, 9, e76089. Article e76089. https://doi.org/10.2196/76089Montoya, M. F., van Rheden, V., Andres, J., Smith, I., Elvitigala, D. S., Matviienko, A., Turmo Vidal, L., Meschtscherjakov, A., & Zambetta, F. (2025). Surfing the Opportunities for Water Sustainability when Designing Outdoor Water Sports Experiences. In DIS 2025 - Companion Proceedings of the 2025 ACM Designing Interactive Systems Conference: Designing for a Sustainable Ocean (pp. 68–71). (DIS 2025 - Companion Proceedings of the 2025 ACM Designing Interactive Systems Conference: Designing for a Sustainable Ocean). Association for Computing Machinery. https://doi.org/10.1145/3715668.3734165(Accepted/In press)Paraschivoiu, I., Steiner, R., Wieser, J., & Meschtscherjakov, A. (2025). Crafting Cities Together: Co-located Collaboration with Augmented Reality for Urban Design. Computer Supported Cooperative Work, 34(1), 249-291. https://doi.org/10.1007/s10606-025-09510-8Santiago, J. M., Sendner, M., Ralser, D., & Meschtscherjakov, A. (2025). The AI of Oz: A Conceptual Framework for Democratizing Generative AI in Live-Prototyping User Studies. Applied Sciences, 15",
  "content_length": 77175,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:34"
}