{
  "name": "Alexandru Paler",
  "homepage": "https://research.aalto.fi/en/persons/alexandru-paler",
  "status": "success",
  "content": "Alexandru Paler - Aalto University's research portal Alexandru Paler Professor (Associate Professor), Department of Computer ScienceProfessor (Associate Professor), Computer Science - Quantum Operating Systems (QUANTUM) - Research area https://orcid.org/0000-0002-1536-8858 Phone+358 50 4758064 20202025 Research activity per year Personal profile Artistic and research interestsResearching the design and implementation of quantum software for compiling and optimising quantum circuits, for actively applying quantum error correction methods, and for quantum circuit simulation. Keywordsquantum computingquantum software Fingerprint Dive into the research topics where Alexandru Paler is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Quantum Circuit Computer Science 100% Qubit Engineering 81% Error Rate Engineering 50% Quantum Computation Engineering 48% Fault Tolerant Computer Science 43% Logical Error Engineering 41% Toffoli Gate Computer Science 37% Adders Engineering 33% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2020 2022 2023 2024 2025 12 Article 5 Conference article in proceedings 1 Chapter Research output per year Research output per year Efficient Quantum Circuit Design with a Standard Cell Approach, with an Application to Neutral Atom Quantum ComputersDobbs, E., Friedman, J. & Paler, A., 14 Jan 2025, In: ACM Transactions on Quantum Computing. 6, 1, p. 1-18 3.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Circuit Design 100% Quantum Circuit 100% Quantum Computer 100% Electronic Circuit 100% Qubit 50% 2 Citations (Scopus) 59 Downloads (Pure) Machine learning message-passing for the scalable decoding of QLDPC codesMaan, A. S. & Paler, A., May 2025, In: npj Quantum Information. 11, 1, 78.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Parity Check Code 100% Belief Propagation 100% Learning System 100% Error Rate 100% Logical Error 100% 2 Citations (Scopus) 29 Downloads (Pure) A High Performance Compiler for Very Large Scale Surface Code ComputationsWatkins, G., Nguyen, H. M., Watkins, K., Pearce, S., Lau, H. K. & Paler, A., 15 May 2024, (E-pub ahead of print) In: Quantum. 8, p. 1-16 16 p.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Quantum Fourier Transform 100% 9 Citations (Scopus) 67 Downloads (Pure) A T-depth two Toffoli gate for 2D square lattice architecturesPaler, A., Dobbs, E. & Friedman, J. S., 25 Jan 2024, Proceedings of the 18th ACM International Symposium on Nanoscale Architectures, NANOARCH 2023. ACM, 32Research output: Chapter in Book/Report/Conference proceeding › Conference article in proceedings › Scientific › peer-review Open Access Toffoli Gate 100% Qubit 100% Square Lattice 100% Electronic Circuit 100% Fault Tolerant 50% Compilation of algorithm-specific graph states for quantum circuitsKrishnan Vijayan, M., Paler, A., Gavriel, J., Myers, C. R., Rohde, P. P. & Devitt, S. J., Apr 2024, In: Quantum Science and Technology. 9, 2, p. 1-22 22 p., 025005.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Quantum Circuit 100% Fault Tolerant 25% And-States 25% High-Level Language 25% Quantum Computing 25% 10 Citations (Scopus) 79 Downloads (Pure) View all 18 research outputs Projects Projects per year 2021 2021 2022 2025 2029 3 Active Projects per year HarmoniaQ/Paler: Distributing Quantum Computations using Defect-Free Graph StatesPaler, A. (Principal investigator) & Kim-Poikkimäki, J. (Project Member)01/09/2025 → 31/08/2029Project: RCF Academy Project EQUIP/Paler: Error correction for QUantum Information ProcessingPaler, A. (Principal investigator) & Maan, A. (Project Member)01/05/2022 → 30/12/2025Project: EU Other competitive funding Quantum Computation 100% Belief Propagation 100% Logical Error 75% Error Correction 75% Learning System 75% -: 2021 SA Profi 6Hämäläinen, J. (Principal investigator), Markkula, T. (Project Member), Lähteenoja, S. (Project Member), Bingham, E. (Project Member), Khan, I. (Project Member), Hollmen, S. (Project Member), Haltia, A. (Project Member), Klenner, N. (Project Member), Karhu, K. (Project Member), Khan, M. (Project Member), Nurmi, N. (Project Member), Shin, J. (Project Member), Haukkala, T. (Project Member), Stead, D. (Project Member), Salminen, E. (Project Member), Ovaska, J.-P. (Project Member), Dagnaud, K. (Project Member), Diehl, M.-R. (Project Member), Baldasso, V. (Project Member), Jokelainen, A. (Project Member), Hämäläinen, M. (Project Member), Dzhengiz, T. (Project Member), Sawhney, N. (Project Member), Turunen, L. L. M. (Project Member), Keskinen, M. (Project Member), Moliner Juanpere, E. (Project Member), Ruotoistenmäki, A. (Project Member), Itani, S. (Project Member), Peña Torres, D. (Project Member), van der Marel, F. (Project Member), Wikström, J. (Project Member), Villo, S. (Project Member), Hetemäki, M. (Project Member), Ibrahim, N. (Project Member), Chandramouli, S. (Project Member), Markkanen, J. (Project Member), Kääriäinen, P. (Project Member), Keipi, T. (Project Member), Van Leemput, K. (Project Member), Oinas, P. (Project Member), Laurila, T. (Project Member), Tehrani, A. (Project Member), Eriksson, V. (Project Member), Pudas, A. (Project Member), Paler, A. (Project Member), Härkönen, E. (Project Member), Nielsen, S. K. (Project Member) & Lafaire, A. P. (Project Member)01/01/2021 → 31/10/2027Project: RCF Profiling",
  "content_length": 5923,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:05"
}