{
  "name": "Alexey Ignatiev",
  "homepage": "https://research.monash.edu/en/persons/aleksei-ignatiev",
  "status": "success",
  "content": "Alexey Ignatiev - Monash University View Scopus Profile Alexey Ignatiev Assoc Professor Associate Professor, Department of Data Science & AI https://orcid.org/0000-0002-4535-2902 EmailAlexey.Ignatievmonashedu 20112025 Research activity per year Personal profile BiographyI am a Senior Lecturer at the Optimisation research group of the Faculty of Information Technology of Monash University. Currently, my research is mainly focused on the development and improvement of highly efficient SAT- and SMT-based (satisfiability modulo theories) decision and optimization procedures targeting a variety of important practical applications in AI: from software package upgradability and Boolean formula minimization to model-based diagnosis (MBD), software fault localization and eXplainable AI (XAI). Education/Academic qualificationComputer Science, Doctor of Philosophy, Irkutsk State University (ISU)Award Date: 19 Nov 2010Applied Mathematics, Diploma (Honours Degree), Irkutsk State University (ISU)Award Date: 15 Jun 2006 Research area keywordsSatisfiabilityComputational LogicKnowledge Representation and ReasoningAutomated ReasoningArtificial IntelligenceCombinatorial Optimisation Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2023 2023 2025 2028 3 Active Projects per year NLCG: Huub: Next-Gen Lazy Clause GenerationStuckey, P. (Primary Chief Investigator (PCI)), Ignatiev , A. (Chief Investigator (CI)), Dekker, J. (Associate Investigator (AI)) & Zhong, A. (Associate Investigator (AI))14/04/25 → 13/04/26Project: Research Formal Explainability: Formal Explainability for Neuro-Symbolic Artificial IntelligenceStuckey, P. (Primary Chief Investigator (PCI)) & Ignatiev , A. (Chief Investigator (CI))ARC - Australian Research Council12/02/25 → 11/02/28Project: Research HARNESS: Hierarchical Abstractions and Reasoning for Neuro-Symbolic SystemsRezatofighi, H. (Primary Chief Investigator (PCI)), Garcia De La Banda Garcia, M. (Chief Investigator (CI)), Li, Y.-F. (Chief Investigator (CI)), Stuckey, P. (Chief Investigator (CI)), Gasevic, D. (Chief Investigator (CI)), Gutierrez, J. (Chief Investigator (CI)), Qu, L. (Chief Investigator (CI)), Ignatiev , A. (Chief Investigator (CI)), Swiecki, Z. (Chief Investigator (CI)), Vered, M. (Chief Investigator (CI)), Chen, G. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)) & Say, B. (Chief Investigator (CI))20/06/23 → 20/02/27Project: Research Research output Research output per year 2011 2016 2017 2019 2021 2024 2025 62 Conference Paper 11 Article Research output per year Research output per year NEUSIS: A Compositional Neuro-Symbolic Framework for Autonomous Perception, Reasoning, and Planning in Complex UAV Search MissionsCai, Z., Cardenas, C. R., Leo, K., Zhang, C., Backman, K., Li, H., Li, B., Ghorbanali, M., Datta, S., Qu, L., Gutierrez, J., Ignatiev, A., Li, Y.-F., Vered, M., Stuckey, P. J., De La Banda, M. G. & Rezatofighi, H., Sept 2025, In: IEEE Robotics and Automation Letters. 10, 9, p. 9502-9509 8 p.Research output: Contribution to journal › Article › Research › peer-review Towards Modern and Modular SAT for LCGDekker, J. J., Ignatiev, A., Stuckey, P. J. & Zhong, A. Z., 2025, 31st International Conference on Principles and Practice of Constraint Programming. de la Banda, M. G. (ed.). Saarbrücken/Wadern, Germany: Schloss Dagstuhl, 12 p. 42. (Leibniz International Proceedings in Informatics, LIPIcs; vol. 340).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile A Formal Explainer for Just-In-Time Defect PredictionsYu, J., Fu, M., Ignatiev, A., Tantithamthavorn, C. & Stuckey, P., 26 Aug 2024, In: ACM Transactions on Software Engineering and Methodology. 33, 7, 31 p., 187.Research output: Contribution to journal › Article › Research › peer-review Open Access 3 Citations (Scopus) Anytime Approximate Formal Feature AttributionYu, J., Farr, G., Ignatiev, A. & Stuckey, P. J., 2024, 27th International Conference on Theory and Applications of Satisfiability Testing. Chakraborty, S. & Jiang, J.-H. R. (eds.). Saarbrücken/Wadern Germany: Schloss Dagstuhl, 23 p. 30. (Leibniz International Proceedings in Informatics, LIPIcs; vol. 305).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile Delivering inflated explanationsIzza, Y., Ignatiev, A., Stuckey, P. J. & Marques-Silva, J., 2024, Thirty-Eighth AAAI Conference on Artificial Intelligence. Wooldridge, M., Dy, J. & Natarajan, S. (eds.). Washington DC USA: Association for the Advancement of Artificial Intelligence (AAAI), p. 12744-12753 10 p. (Proceedings of the AAAI Conference on Artificial Intelligence; vol. 38, no. 11).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 5 Citations (Scopus) View all 73 research outputs",
  "content_length": 5230,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:06"
}