{
  "name": "Alexander L. Wolf",
  "homepage": "https://users.soe.ucsc.edu/~alw",
  "status": "success",
  "content": "Alexander L. Wolf: Home Page Alexander L. Wolf Dean of the Baskin School of Engineering Distinguished Professor of Computer Science and Engineering University of California, Santa Cruz Brief Professional Biography Alexander L. Wolf serves as Dean of the Baskin School of Engineering and is a Distinguished Professor in the department of Computer Science and Engineering at the University of California, Santa Cruz (US). Prof. Wolf received the B.A. degree from Queens College of the City University of New York, majoring in both Geology and Computer Science. He received the M.S. and Ph.D. degrees from the Department of Computer Science at the University of Massachusetts at Amherst. Prof. Wolf was a Member of the Technical Staff at AT&T Bell Laboratories (now AT&T Labs Research and Bell Laboratories) in Murray Hill, New Jersey, before joining the University of Colorado faculty. During his years at the University of Colorado, Prof. Wolf held the ranks of assistant, associate, and full professor. He also held the Charles Victor Schelke Chair in the College of Engineering. At the University of Lugano he helped found the Faculty of Informatics, the first computer science faculty in the Italian-speaking region of Switzerland. Before moving to his present position, Prof. Wolf held a chaired professorship in the Department of Computing at Imperial College London. Prof. Wolf's research interests span the areas of distributed systems, networking, and software engineering. His achievements include seminal work in software architecture, business analytics, and information-centric networks. His more recent projects concern cloud computing, data-center networking, and service-based systems hosted on MANETs. Prof. Wolf served as President of the Association for Computing Machinery (ACM) and chaired the Executive Committee (EC) of the ACM Council, the governing authority of the association. He was also a founding member of the ACM Europe Council and was a long-time participant in the ACM Distinguished Speakers Program (DSP). He previously served as Secretary-Treasurer and then Vice President of the ACM, Chair of the ACM Special Interest Group (SIG) Governing Board (SGB), Vice Chair and then Chair of the ACM Special Interest Group in Software Engineering (SIGSOFT), and Chair of the ACM Software System Award committee. He served on the editorial boards of the Research Highlights section of ACM's flagship publication Communications of the ACM (CACM), the ACM journal Transactions on Software Engineering and Methodology (TOSEM), the IEEE Computer Society journal Transactions on Software Engineering (TSE), and the Wiley journal Software Process - Improvement and Practice (SPIP), and has chaired a number of international program committees. Prof. Wolf is a Fellow of the ACM, a Fellow of the IEEE, a Fellow of the AAAS, a Chartered Fellow of the British Computer Society (BCS), holder of a Royal Society-Wolfson Research Merit Award, two-time recipient of an ACM SIGSOFT Research Impact Award ([1],[2]), recipient of both the ACM SIGSOFT Outstanding Research Award and Distinguished Service Award, and recipient of an Alumni Award for Outstanding Achievement in Research from the Department of Computer Science at the University of Massachusetts at Amherst. Links Publications Articles ( Google Scholar, ACM author, DBLP, ORCID researcher) Distributed Systems Networking Computer Systems Software Architecture Configuration Management Software Process Tools and Environments Security and Survivability Object Databases Feature Engineering Miscellany Student theses and dissertations Selected Research Projects SERECA European Commission H2020 project (\"Secure Enclaves for Reactive Cloud Applications\") HARNESS European Commission FP7 project (\"Hardware- and Network-Enhanced Software Systems for Cloud Computing\") NaaS EPSRC project (\"Network-as-a-Service in the Cloud\") ITA joint US/UK project (\"International Technology Alliance in Network and Information Science\") Siena publish/subscribe communication system Content-based networking, an advanced form of information-centric network Weevil automation framework for distributed experimentation PLASTIC European Commission IST project (\"Providing Lightweight and Adaptable Service Technology for pervasive Information and Communication\") Selected Volumes, Lectures, and Keynotes Leon J. Osterweil Festschrift volume (copies available for purchase) Edited volume on the Future of Software Engineering Featured lectures in the ACM Distinguished Speakers Program ISR Distinguished Speaker Series lecture Distinguished lecture, Bren School of Information and Computer Sciences, University of California, Irvine Distinguished lecture, Department of Computer Science, University of Massachusetts at Amherst Distinguished lecture, Physics and Technology Institute (PTI), Kiev Polytechnical Institute ACM SIGSOFT Outstanding Research Award address at the ACM SIGSOFT Symposium on Foundations of Software Engineering Keynote address at the IEEE International Conference on Software Analysis, Evolution, and Reengineering Keynote address at the China International Software Cooperation Conference Keynote address at the Brazilian Conference on Software: Theory and Practice Keynote address at the Central and Eastern European Software Engineering Conference in Russia Keynote address at the Working IEEE/IFIP Conferance on Software Architecture Keynote address at the International Conference on Distributed Event-Based Systems Keynote address at the IFIP Distributed Computing Techniques Federated Conferences Keynote address at the ACM SIGSOFT Symposium on Foundations of Software Engineering Other Useful Links SEWORLD email list Impact Project (a study of the impact of software engineering research on software engineering practice) Mathematics Genealogy Project entry Software Engineering Genealogy Project Contact be-dean@ucsc.edu GPG public key (compatible with PGP) +1 831 459 4877 (voice) LinkedIn Baskin School of Engineering 1156 High Street Santa Cruz, California 95064 USA Executive Assistant to the Dean: Sarah Shirley Alexander L. Wolf | Baskin School of Engineering | University of California, Santa Cruz",
  "content_length": 6185,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:29"
}