{
  "name": "Alfie Abdul-Rahman",
  "homepage": "https://www.kcl.ac.uk/people/alfie-abdul-rahman",
  "status": "success",
  "content": "Alfie Abdul-Rahman | King's College London Skip to main contentDr Alfie Abdul-Rahman Senior Lecturer in Computer ScienceResearch interestsComputer scienceContact details+44 020 7848 4673alfie.abdulrahman@kcl.ac.ukBiographyDr Alfie Abdul-Rahman is a Senior Lecturer in Computer Science at King’s College London. She received her PhD from Swansea University in Computer Science. Before joining King’s, she was a Research Associate at the University of Oxford e-Research Centre. She worked as a Research Engineer in HP Labs Bristol on document engineering, and then as a Software Developer in London, working on multi-format publishing. Her research interests include information visualisation, computer graphics, human-computer interaction, and digital humanities. Alfie has worked on several projects including Poem Viewer and ViTA: Visualization for Text Alignment. She is actively involved with the Quill Project at the University of Oxford, a platform for the study of negotiated texts.Research interests Information Visualisation Human-Computer Interaction User-centered Design of Visualisation Applications Visualisation in Digital Humanities User Studies and Evaluation More information Research Profile PublicationsResearchResearchSecurity HubThe Security Hub consolidates the research related to securityHealth HubThe Health Hub centres on computational characterisation of medically relevant study cases and data. Centre for Attention StudiesForging new responses to the foundational digital age crisis: distractionCentre for Technology and the BodyStories of embodied technology: from the plough to the touchscreenHuman Centred Computing ResearchThe group is concerned with the design, development and evaluation of human computer systems.Urban Data ScienceSupporting interdisciplinary research and innovation in and for LondonKing's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.NewsNews01 October 2022PhD students from Informatics attend WomENcourage conferenceThe conference aims to connect women from diverse STEM backgrounds and encourage them to pursue a career in computing.Technology & Science19 April 2022International Women's Day at King's Department of InformaticsInternational Women’s Day (IWD) is aimed at breaking down social barriers and creating a gender equal world. On IWD on March 8 the world comes together to...Technology & ScienceEventsEvents13OctDealing with bias and diversity in Artificial Intelligence13 October 2021 14:00 to 15:30How AI can overcome biasPlease note: this event has passed.FeaturesFeatures25 May 2022He Said, She Said!Visualising how complex negotiations and social media conversations evolve over time.Technology & SciencePublicationsResearchNewsEventsFeaturesResearchSecurity HubThe Security Hub consolidates the research related to securityHealth HubThe Health Hub centres on computational characterisation of medically relevant study cases and data. Centre for Attention StudiesForging new responses to the foundational digital age crisis: distractionCentre for Technology and the BodyStories of embodied technology: from the plough to the touchscreenHuman Centred Computing ResearchThe group is concerned with the design, development and evaluation of human computer systems.Urban Data ScienceSupporting interdisciplinary research and innovation in and for LondonKing's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.News01 October 2022PhD students from Informatics attend WomENcourage conferenceThe conference aims to connect women from diverse STEM backgrounds and encourage them to pursue a career in computing.Technology & Science19 April 2022International Women's Day at King's Department of InformaticsInternational Women’s Day (IWD) is aimed at breaking down social barriers and creating a gender equal world. On IWD on March 8 the world comes together to...Technology & ScienceEvents13OctDealing with bias and diversity in Artificial Intelligence13 October 2021 14:00 to 15:30How AI can overcome biasPlease note: this event has passed.Features25 May 2022He Said, She Said!Visualising how complex negotiations and social media conversations evolve over time.Technology & Science(S)5.05Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering Sciences",
  "content_length": 4719,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:10"
}