{
  "name": "Alfons W. Laarman",
  "homepage": "https://alfons.laarman.com",
  "status": "success",
  "content": "Alfons Laarman Alfons Laarman I lead the System Verification Lab (SVL) at the Leiden Institute for Advanced Computer Science (LIACS). I am co-founder of the applied quantum algorithms (aQa) initiative, an inter-disciplinary team researching quantum algorithms and their applications. The aQa team consists of faculty, postdoctoral researchers, and students across the Leiden Institute of Physics (LION) the Leiden Institute for Advanced Computer Science (LIACS), the Leiden Institute for Chemistry (LIC), and the Leiden Mathematical Institute (MI). I am founder of LUdev, the software development company ran by students who follow the courses Software Engineering, Managing Software Evolution and System Development. My main research interests are formal verification, automated reasoning, quantum computing and parallel computing. alfons.laarman.com Gorlaeus Building, room BE2.03 Einsteinweg 55 2333 CC, Leiden The Netherlands Marten Folkertsma won a QSC grant on ``catalytic quantum computing'' Marten Folkertsma won a QSC grant with his project proposal on \"catalytic quantum computing.\" Marten is currently finishing his PhD under the supervision of Harry Buhrman and Florian Speelman (CWI). He will implement the project at both CWI and Leiden, so he will join SVL next year. posted on 01-09-2025Alexis de Colnet will join SVL Alexis de Colnet will join SVL as postdoc from mid-October. We will work on knowledge compilation for quantum systems. Alexis is an expert in knowledge compilation, proof systems and model counting. Her previously worked in the groups of Pierre Marquis (CRIL, France), Stefan Szeider (TU Vienna, Austria) and Kuldeep Meel (GeorgiaTech, USA). posted on 31-08-2025Open PhD position The System Verification Lab has one open PhD position on exploring the intersection between symbolic reasoning and quantum computing. The research will apply constraint programming techniques to tackle 'quantum'-hard problems. We are interested in new approximation algorithms and improving our general understanding of the boundary between classical and quantum computation. Email me if interested. posted on 31-08-2025Awarded a Quantum Limits grant (NWO SUMMIT) The Dutch funding agency NWO has recently awarded a large 'SUMMIT' grant to the leading researchers in quantum computing in the Netherlands. These researchers redistributed some of the funding though the Quantum Limits call. I am honored that they selected my research proposal for inclusion in the SUMMIT project. Quantum complexity theory faces key challenges, including simulating quantum systems, understanding entanglement, and solving many-body problems – many of which are too complex for unaided human reasoning. This project tackles these issues by combining human insight with automated reasoning (AR), a method that has already solved difficult problems in mathematics. Building on recent work that connects quantum problems to AR techniques, Sebastian Feld (QuTech) and myself will apply this approach and advance fundamental questions in quantum computing. posted on 31-03-2025Open PhD and Postdoc positions The System Verification Lab has multiple open positions. A four-year PhD position on formal methods for quantum computing A four-year PostDoc position on automated reasoning for quantum computing (see the BoostQA project) Email me if interested. posted on 31-03-2024Awarded an NWO NGF grant on Quantum Technology Together with Vedran Dunjko, I was awarded an NWO national growth fund grant on quantum technology for the BoostQA project. The abstract of the project is as follows. Compared to classical algorithms, which have enjoyed decades of development, many quantum algorithms are still in their infancy. The key technologies contained in classical algorithms often offer exponential advantages. This project will add these key technologies to quantum algorithms so that they enjoy the same advantage on top of the quantum acceleration. The resulting new line of quantum algorithms is therefore more able to compete with their classical counterparts. This closes an important gap on the road to a ‘quantum advantage’, a first experiment showing that quantum algorithms can be faster than classical algorithms for a useful task. posted on 09-01-2024Postdoc Tim Coopmans was Awarded an NWO NGF grant on Quantum Technology Postdoc Tim Coopmans was awarded a 400k euro grant for the development of noise mitigation techniques for early quantum computers. He will work on state-of-the-art methods for noise mitigation based on the LIMDD data structure. The project is called \"Using regular computers for predicting and reducing the influence of noise in quantum computers.\" posted on 31-12-2022Organizing Parallel and Distributed Automated Reasoning 2022 The PDAR 2022 workshop is co-located at the Federated Logic Conference (a once in four year event) and features an exciting line up of speakers on parallel reasoning, as well as discussion sessions on this promising field. posted on 31-05-2022Awarded NWO NWA grant Divide & Quantum As PI of this 2m euro project, I will lead a consortium to implement various case studies in quantum computing. My own team will contribute new divide & quantum algorithms and the simulation of quantum computing based on LIMDDs. Looking forward to work with the diverse Divide & Quantum consortium. posted on 30-04-2022Three open PhD positions The System Verification Lab has three open PhD positions: A six-year PhD position on software engineering with teaching duties concerning LUdev A four-year PhD position on parallel computing A four-year PhD position on quantum computing Email me if interested. posted on 23-04-2022Invited to the model checking 2022 to give a talk on decision diagrams posted on 31-01-2022Awarded EU Horizon grant Efficient QUantum ALgorithms for IndusTrY (EQUALITY) The 6m euro project will be executed by a large consortium led by Altran. I will lead a work package on optimization techniques for quantum circuits based on the LIMDD technology developed by my team. This will crucially enable other consortium partners to implement their quantum computing use cases. posted on 31-12-2021Lecturer at the Quantum Information Science & Technology (QIST) master Mirjam Blaauwboer asked me to join the development of the QIST master program, which will be jointly taught by TU Delft and Leiden University. I will design a course for the first year of the master. posted on 14-05-2021Invited to PDAR 2021 to give a talk on parallel probabilistic inference The event was originally planned to take place at CMU, Pittsburgh, but will take place online. posted on 30-04-2021Organizing the SPIN 2021 symposium Together with Ana Sokolova, I organize the SPIN 2021 symposium. The workshop features invited speakers Vincenzo Ciancia (CNR-ISTI), Mariëlle Stoelinga (Twente / Radboud University) and Moshe Vardi (Rice). posted on 31-01-2021PhD student Lieuwe Vinkhuijzen won the SETTA 2020 best presentation award posted on 24-11-2020Awarded EU H2020 grant NExt ApplicationS of Quantum Computing (NEASQC) The 5m euro project will be executed by a large consortium led by Atos. My team will collaborate with EDF, the French energy company, to realize a case study in quantum probabilistic risk analysis. posted on 31-05-2020Invited to the Lorentz workshop on tool competitions posted on 31-01-2019Invited to talk at the IPA research school posted on 30-04-2018Invited to talk at the NIRICT GPU workshop I will speak about optimal compression methods for handling combinatorial state spaces. posted on 30-04-2018Invited to the CERN workshop on scientific computing Roel Aaij (NikHef) invited me to explore ways to use my tree-based data compression methods on the massive data produced by CERN. I will present the data structure to a mostly physics audience in Sardinia, Italy. posted on 31-12-2017Invited to the Lorentz workshop on formal methods posted on 30-11-2017Invited to present at This-Week's-Discovery in Leiden I will talk about my Veni project Paralellism in Depth. posted on 31-05-2017Organizing the famous 'fall days' of the IPA research school posted on 30-04-2017Invited to PCR’17 to give a talk on parallel model checking In Gothenburg, Sweden, I will talk about concurrent data structures for program verification. posted on 30-04-2017Invited to give a talk at the Alpine Verification Meeting 2017 in Hungary In Visegrád, Hungary, I will talk about the LTSmin model checker. posted on 31-01-2017Invited to the model checking 2016 to give a talk on parallel model checking posted on 31-01-2016Invited to talk at a workshop in honor of Marieke Huisman I will talk about parallel depth-first search algorithms. posted on 31-01-2016",
  "content_length": 8693,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:09"
}