{
  "name": "Alfonso Bueno-Orovio",
  "homepage": "https://www.cs.ox.ac.uk/people/alfonso.bueno-orovio",
  "status": "success",
  "content": "Alfonso Bueno-Orovio | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyAlfonso Bueno-OrovioAlfonso Bueno-Orovio Professor Alfonso Bueno-Orovio Professor of Computer ScienceE: alfonso.bueno@cs.ox.ac.ukT: +44 1865 610737Wolfson Building, Parks Road, Oxford OX1 3QD Themes:Computational Biology and Health InformaticsCompleted Projects:more…InterestsI use an integrative approach to cardiac electrophysiology research, combining clinical and experimental data, modelling and simulation, to investigate cardiac arrhythmias and possible therapeutic targets. Due to the multiscale nature of cardiac electrophysiology, computational models represent the perfect framework to augment and fully analyse experimental and clinical findings. They allow for the integration of existing and new knowledge, enabling investigations of cellular processes and cardiac arrhythmias with high spatio-temporal resolution. Such an approach involves a deep understanding of multiple data sources, from cellular ionic mechanisms and signaling pathways to electrical conduction at the tissue and whole organ levels. In order to further advance our current understanding of heart function, our methodology is based on a synergistic clinical, experimental and computational approach, aiming to develop novel hypotheses, therapeutic targets, and technologies to improve risk identification under different disease conditions. Translation of results from basic science to clinical and industrial applications is central to my work via collaboration with clinicians and industrial partners. Academic Links: Google Scholar | Research Gate | OrCiDResearch areas and Collaborators:I'm a Basic Science Research Fellow of the British Heart Foundation (BHF), Principal Investigator of the Oxford BHF Centre of Research Excellence, and member of the Computational Cardiovascular Science team. My research focuses on the interplay between cardiac function and structure in modulating deadly arrhythmias in the human heart, computer modelling and simulation towards a reduction and replacement of animals in research and safer drugs in human, and advanced mathematical modelling for cardiac tissue and magnetic resonance imaging. For further details on our research and collaborators, please visit our team's website. Postdoctoral Research Assistants: Francesca Margara (Jul 2021 – present) Rubén Doste (Jan 2020 – present) Zhinuo Jenny Wang (Apr 2018 – Sep 2019) → Senior Research Associate, University of Oxford. Aurore Lyon (Oct 2017 – Mar 2018) → Postdoctoral researcher, University of Maastricht. Current DPhil students: James Coleman (2020-23): Mechanistic investigations of structure-function interplay as causal mechanisms of arrhythmic risk in hypertrophic cardiomyopathy. Albert Dasí (2020-23): In-silico populations of models to predict drug effects on atrial fibrillation. Zhaozheng Meng (2020-23): Role of lysosomal calcium release and IP3 receptors in human atrial fibrillation. Graduated DPhil students: Jorge Corral Acero (2018-21): Cardiovascular disease under the lens of automated 3D analysis of the heart. Francesca Vergara (2018-21): Human-based computational investigations into cardiac electromechanical alterations caused by drugs and hypertrophic cardiomyopathy. Polina Mamoshina (2016-20): In silico methods for the prediction of drug-induced cardiotoxicity. Héctor Martínez-Navarro (2015-19): Multiscale human-based computer modelling and simulation for investigations of arrhythmic risk in acute ischemia. Anna Muszkiewicz (2013-16): Multiscale modelling and simulations into the mechanisms linking neuronal nitric oxide synthase and atrial fibrillation. Louie Cardone-Noott (2012-16): Computational investigation of the human electrocardiogram under healthy and diseased conditions. Xin Zhou (2012-15): In silico investigations into human ventricular pro-arrhythmic mechanisms combined with in vivo and in vitro experiments. Oliver Britton (2011-14): Combined experimental and computational investigation into inter-subject variability in cardiac electrophysiology. Trainees’ Awards: Francesca Margara: Junior Investigator Award, 2021 Safety Pharmacology Society, 2021. Francesca Margara: Rosanna Degani Young Investigator Award, 2021 Computing in Cardiology, 2021. James Coleman: Semi-Finalist, Rosanna Degani Young Investigator Award, 2021 Computing in Cardiology, 2021. Francesca Margara: Best Abstract Award. 45th ESC Working Group Cardiac Cellular Electrophysiology, 2021. Rubén Doste: EHRA 2021 Congress Educational grant, 2021. Francesca Margara: Semi-Finalist, Rosanna Degani Young Investigator Award, 2020 Computing in Cardiology, 2020. Jorge Corral Acero: Best Work in Imaging Award, 2019 Functional Imaging and Modeling of the Heart Conference, 2019. Zhinuo Jenny Wang: Post-doctoral runner-up Best Poster Award, 2019 Gordon Research Conference on Cardiac Arrhythmia Mechanisms, 2019. Zhinuo Jenny Wang: Travel Award, BHF Centre of Research Excellence, Oxford, UK, 2019. Héctor Martínez-Navarro: Travel Award, BHF Centre of Research Excellence, Oxford, UK, 2019. Elisa Passini: International 3Rs Prize, NC3Rs, UK, 2018. Héctor Martínez-Navarro: Finalist, VPHi Best Student Award, 2018 VPHi Conference, 2018. Anna Bialas: Microsoft Prize for best Computer Science project, University of Oxford, 2018. Anna Muszkiewicz: EPSRC Plus Prize, UK, 2016. Anna Muszkiewicz: Research Spotlight Award, BCS Academy of Computing, 2016. Oliver Britton: International 3Rs Prize, NC3Rs, UK, 2015. Elisa Passini: Best Poster Award, 2015 Meeting of the European Working Group in Cardiac Cellular Electrophysiology, 2015. Oliver Britton: EPSRC Plus Prize, UK, 2014. Oliver Britton: Finalist, UK ICT Pioneers Awards, 2014. Anna Muszkiewicz: Rosanna Degani Young Investigator Award Honourable Mention, 2014 Computing in Cardiology Conference, 2014. Xin Zhou: Microsoft Research Award, Doctoral Training Centre on Systems Biology, Oxford, 2012. Oliver Britton: Microsoft Research Award, Doctoral Training Centre on Systems Biology, Oxford, 2011. Other Personal Awards: BHF Intermediate Basic Science Research Fellowship (British Heart Foundation, UK, 2017). Technological Innovation Award (Safety Pharmacology Society, 2017). NC3Rs Infrastructure for Impact Award (NC3Rs, UK, 2016-2021). Archer Leadership project (EPSRC, UK, 2016-2017). Recurrent Award for Excellence (University of Oxford, UK, 2016). International 3Rs Prize (NC3Rs, UK, 2015). Impact Acceleration Award (EPSRC, UK, 2015-2016). Impact Acceleration Award (EPSRC, UK, 2013-2014). Torres Quevedo Award (Ministry of Science and Innovation, Spain, 2008). Computational Science and Engineering Student Prize (BGCE, Germany, 2007). SIAM Student Prize (Society for Industrial and Applied Mathematics, USA, 2004). BiographyDr Alfonso Bueno-Orovio obtained his PhD from the University of Castilla-La Mancha (Spain, 2007) in modelling and simulation of human ventricular electrophysiology, followed by industrial experience and a post-doctoral position at the Technical University of Madrid. He then joined the Computational Cardiovascular Science group at the University of Oxford in 2010, in the development of synergistic data-driven approaches for cardiovascular research. In 2017 he became one of the few computational Intermediate Basic Science Research Fellows of the British Heart Foundation. His work covers the many facets of structural-function interplay and population variability in the human heart, where modelling and simulation are used to augment experimental and clinical findings to investigate cardiac arrhythmias and mechanisms of drug action under different pathological conditions.Selected PublicationsView AllManage publications SMOD − Data Augmentation Based on Statistical Models of Deformation to Enhance Segmentation in 2D Cine Cardiac MRI Corral Acero J‚ Zacur E‚ Xu H‚ Ariga R‚ Bueno−Orovio A‚ Lamata P and Grau V 2019. Details about SMOD − Data Augmentation Based on Statistical Models of Deformation to Enhance Segmentation in 2D Cine Cardiac MRI | BibTeX data for SMOD − Data Augmentation Based on Statistical Models of Deformation to Enhance Segmentation in 2D Cine Cardiac MRI | DOI (10.1007/978-3-030-21949-9\\_39) | Link to SMOD − Data Augmentation Based on Statistical Models of Deformation to Enhance Segmentation in 2D Cine Cardiac MRI General principles for the validation of proarrhythmia risk prediction models: An extension of the CiPA in silico strategy Zhihua Li‚ Gary R Mirams‚ Takashi Yoshinaga‚ Bradley J Ridder‚ Xiaomei Han‚ Janell E Chen‚ Norman L Stockbridge‚ Todd A Wisialowski‚ Bruce Damiano‚ Stefano Severi‚ Pierre Morissette‚ Peter R Kowey‚ Mark Holbrook‚ Godfrey Smith‚ Randall L Rasmusson‚ Michael Liu‚ Zhen Song‚ Zhilin Qu‚ Derek J Leishman‚ Jill Steidl‐Nichols‚ Blanca Rodriguez‚ Alfonso Bueno‐Orovio‚ Xin Zhou‚ Elisa Passini‚ Andrew G Edwards‚ Stefano Morotti‚ Haibo Ni‚ Eleonora Grandi‚ Colleen E Clancy‚ Jamie Vandenberg‚ Adam Hill‚ Mikiko Nakamura‚ Thomas Singer‚ Liudmila Polonchuk‚ Andrea Greiter‐Wilke‚ Ken Wang‚ Stephane Nave‚ Aaron Fullerton‚ Eric A Sobie‚ Michelangelo Paci‚ Flora Musuamba Tshinanu and David G Strauss In Clinical Pharmacology & Therapeutics. 2019. Details about General principles for the validation of proarrhythmia risk prediction models: An extension of the CiPA in silico strategy | BibTeX data for General principles for the validation of proarrhythmia risk prediction models: An extension of the CiPA in silico strategy | DOI (10.1002/cpt.1647) High arrhythmic risk in antero−septal acute myocardial ischemia is explained by increased transmural reentry occurrence H Martinez−Navarro‚ A Mincholé‚ A Bueno−Orovio and B Rodriguez In Scientific Reports. 2019. Details about High arrhythmic risk in antero−septal acute myocardial ischemia is explained by increased transmural reentry occurrence | BibTeX data for High arrhythmic risk in antero−septal acute myocardial ischemia is explained by inc",
  "content_length": 10691,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:11"
}