{
  "name": "Alfred V. Aho",
  "homepage": "http://www.cs.columbia.edu/~aho",
  "status": "success",
  "content": "Alfred V. Aho's webpage ALFRED V. AHO Alfred V. Aho is Lawrence Gussman Professor Emeritus of Computer Science at Columbia University. Room 513 Computer Science Building, Courses CS 3261: Computer Science Theory - Section 001, Fall 2017 CS 6998: Advanced Topics in Programming Languages and Compilers, Fall 2014 CS 4115: Programming Languages and Translators, Spring 2015 Books Bio Recent PhD Students Gaurav Kc: Defending Software Against Process-Subversion Attacks Krysta Svore: Achieving Reliable, Scalable, Fault-tolerant Quantum Computing Marc Eaddy: An Empirical Assessment of the Crosscutting Concern Problem Stuart Hadfield: Quantum Algorithms for Scientific Computing and Approximate Optimization Research Interests Programming languages, compilers, algorithms, software engineering, quantum computing Publications and Citations on Google Scholar Recent Invited Talks Teaching Compilers, SIGCSE 2010 The Quintessential Questions of Computer Science, Bell Labs, Murray Hill, NJ, June 22, 2011 C, the Enduring Legacy of Dennis Ritchie, Dennis Ritchie Tribute at Bell Labs, September 7, 2012, Text of talk. Computational Thinking, NEC, 2013 Programming Languages and Compilers for Quantum Computers, June 16, 2014 Bell Labs Role in Programming Languages and Algorithms, Simons Foundation, June 5, 2015 Software, Computation and Models of Computation, IIT Madras, January 8, 2016 Regular Expressions, JerseySTEM Math Club, March 5, 2017 From Algorithms to Software, NEC Foundation, November 30, 2017 Recent Patents Gaurav S. Kc and Alfred V. Aho, Detecting and Preventing Malcode Execution, #7,971,255, June 28, 2011 Languages and Compilers Research Group Columbia University Department of Computer Science Department of Computer Science Columbia University 513 Computer Science Building Mail Code 0401 1214 Amsterdam Avenue New York, NY 10027 212 939-7067 Fax: 212 666-0140 aho@@cs.columbia.edu",
  "content_length": 1900,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:16"
}