{
  "name": "Alfred Ultsch",
  "homepage": "https://www.uni-marburg.de/fb12/arbeitsgruppen/datenbionik/mitarbeiter",
  "status": "success",
  "content": "Mathematik und Informatik - Philipps-Universität Marburg Hauptinhalt Philipps-Universität Marburg - Mathematik und Informatik Foto: Thorsten Richter Willkommen am Fachbereich Mathematik und Informatik Studieren bei uns... Themen Fachbereich Organisation, Personen, Verwaltung, Selbstverwaltung, Infrastruktur, Geschichte... Studium Alles rings ums Studium - Informationen für Studierende und für Studieninteressierte... Forschung Anwendungsbezogene & theoretische Forschung, fachspezifische & interdisziplinäre Projekte, uni-weite & -übergreifende Kooperationen... Arbeitsgruppen Die Professorinnen und Professoren, ihre Arbeitsgruppen, Kooperationen und Arbeitsgebiete... Zurückblättern Vorblättern Fachbereich Organisation, Personen, Verwaltung, Selbstverwaltung, Infrastruktur, Geschichte... Studium Alles rings ums Studium - Informationen für Studierende und für Studieninteressierte... Forschung Anwendungsbezogene & theoretische Forschung, fachspezifische & interdisziplinäre Projekte, uni-weite & -übergreifende Kooperationen... Arbeitsgruppen Die Professorinnen und Professoren, ihre Arbeitsgruppen, Kooperationen und Arbeitsgebiete... Zielgruppeninformationen Ich suche Informationen für für Studierende für Studieninteressierte für Erstsemester Studierende mit Sehbeeinträchtigung Zielgruppenspezifische Informationen schließen Aktuelles Nachrichten 26.11.2025 SportVid: KI-basierte Analyse von Sportvideos 05.11.2025 Marburger Studierende setzen Impulse für gute Lehre 04.11.2025 Dritte Förderrunde \"nachhaltig chancengleich!\" gestartet – Vier Fachbereiche erhalten Zuschlag für Gleichstellungsprojekte 04.09.2025 Francqui Chair für die Vrije Universiteit Brussel (VUB) an Professor István Heckenberger verliehen 10.06.2025 KI zur molekularen Vermessung der Alzheimer-Krankheit: Internationales JPND Projekt bewilligt für Prof. Dr. Martin Becker Alle Nachrichten Zurückblättern Vorblättern Entdecken Angebote für Schüler:innen Profil des Fachbereichs Lage- und Gebäudeplan Fachbereichs-Logo Deutsche Mathematiker-Vereinigung Termine Prüfungen usw. Gesellschaft für Informatik Mensa-Speiseplan Zurückblättern Vorblättern",
  "content_length": 2130,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:16"
}