{
  "name": "Alfredo Weitzenfeld",
  "homepage": "http://robolat.org",
  "status": "success",
  "content": "BIOROBOTICS LAB – University of South Florida Prof. Alfredo Weitzenfeld Director BioRobotics Laboratory Bellini College of Artificial Intelligence, Cybersecurity and Computing University of South Florida Tampa, FL, USA weitzenfeld.robolat.org Email: aweitzenfeld@usf.edu Dr. Alfredo Weitzenfeld is a Professor at the Bellini College of Artificial Intelligence, Cybersecurity and Computing, at the University of South Florida. Dr. Weitzenfeld is the director of the BioRobotics Laboratory and the USF RoboBulls RoboCup team. Dr. Weitzenfeld is one of the main developers of the Neural Simulation Language (NSL) and the Abstract Schema Language (ASL), described both in The Neural Simulation Language NSL: A System for Brain Modeling (coauthors M. Arbib and A. Alexander) published in 2002 by MIT Press. Dr. Weitzenfeld is a charter member of the Latin American Robotics Council and the founder of the Latin American Robotics Symposium (LARS). He was the co-chair of RoboCup 2012 in Mexico City and the General Chair of the International Conference on Advanced Robotics (ICAR 2013) in Montevideo, Uruguay. Dr. Weitzenfeld was an IEEE-RAS Distinguished Lecturer. He is an ACM member, an IEEE Senior Member. His main research areas are biorobotics, multi-robot systems and robot cognition. We have immediate fully funded PhD research opportunities in the BioRobotics Lab at USF in the area of Spatial Cognition in NeuroRobotics: Fully Funded PhD Research Opportunities at USF (English Link) (PDF) Oportunidades de Investigación Todo Pago en USF (Link Español) Information about the PhD program at the Computer Science and Engineering (CSE) Dept at USF: PhD graduate program at USF To apply to the PhD program at the Computer Science and Engineering at USF please go to the following link: Apply to the PhD graduate program at USF Additional information about the USF CSE Dept can be found at: USF CSE Dept For additional information please contact Prof. Alfredo Weitzenfeld, email: aweitzenfeld@usf.edu",
  "content_length": 1998,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:18"
}