{
  "name": "Ali Kafash Hoshiar",
  "homepage": "https://www.essex.ac.uk/people/kafas38100/ali-kafash-hoshiar",
  "status": "success",
  "content": "Ali Kafash Hoshiar | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Ali Kafash Hoshiar People Dr Ali Kafash Hoshiar Senior Lecturer School of Computer Science and Electronic Engineering (CSEE) Email a.kafashhoshiar@essex.ac.uk Location 1NW.3.15, Colchester Campus Academic support hours Tuesdays 15:00 to 16:00 Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Dr. Ali Hoshiar is a Senior Lecturer (Associate Professor) in Robotics at the University of Essex where he leads the Robotics for Under Millimeter Interventions (RUMI) lab. He was awarded the EPSRC-funded 'In-Target' project as the Principal Investigator (PI) and is the recipient of the 'Best Interdisciplinary Research Award' at the University of Essex. Since joining the University of Essex in 2019, Dr Hoshiar has been advancing the field of small-scale robotics and soft robotics, focusing on actuation, sensing, and control, particularly in medical and agri-tech applications. His interest extends to the modelling, simulation, and development of mechatronic systems. Prior to his current role, Dr. Hoshiar was engaged in research on the development of soft continuum magnetic robots for surgical interventions. He was involved in the development of soft continuum microrobots for angioplasty applications at the DGIST-ETH Joint Microrobotics Research Centre, a collaboration between Switzerland and South Korea. In South Korea, he also collaborated with the GIST Intelligence Medical Robotics Laboratory to advance magnetic-based robotics systems. His research interests include micro/nanotechnology, robotics, data-driven predictive modelling for healthcare, and agricultural robotics and he published over 30 journal papers in this area. At Essex, Dr. Hoshiar supervises the Robotics for Under Millimetre Intervention Lab where the EPSRC for the 'In-Target' project is hosted. His work is focused on contributing to the fields of healthcare and agriculture, emphasizing the practical application of advanced soft robotics. Appointments University of Essex Senior lecturer, University of Essex (1/10/2023 - present) Lecturer, University of Essex (11/9/2019 - 1/9/2023) Other academic Research Fellow, University of Leeds (STORM Lab) (1/2/2019 - 1/9/2019) Research Fellow, DGIST-ETH Microrobotics Research Center (DEMRC) (1/9/2017 - 31/1/2019) Research Fellow, Gyeongsang National University (GNU) (1/12/2015 - 31/8/2017) Research and professional activities Research interests Soft Robotics https://sites.google.com/view/alihoshiar/research-interests/soft-robotics Open to supervise Swarm micro/nanorobotics https://sites.google.com/view/alihoshiar/research-interests/swarm-robotics Open to supervise Mechatronics Systems for Small Scale Robotics https://sites.google.com/view/alihoshiar/research-interests/mechatronics-systems-for-small-scale-robotics Open to supervise Teaching and supervision Current teaching responsibilities Mechatronic Design (CE325) Intelligent Systems and Robotics (CE801) Current supervision Kiana Abolfathi Thesis title: Advancements in Magnetic Steering of Soft Magnetic Continuum Robots for Medical Applications Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Muhammad Fuad Farooqi Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Previous supervision Benjamin William Jarvis Thesis title: A Data-Driven Approach for Magnetic Microswarm Steering Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 30/6/2025 Publications Journal articles (36) Hayat, I., Elebessov, T., Kafash Hoshiar, A., Duc do, T. and Thanh Pham, T., (2025). A Review of Magnetic Particle Imaging: Comparative Analysis of Field Free Point and Field Free Line Methodologies. IEEE Access. 13, 169678-169697 Mousavi, A., Ahmed, A., Khaksar, H., Choi, H. and Hoshiar, AK., (2024). An Input Saturation-Tolerant Position Control Method for Magnetic Microrobots Using Adaptive Fuzzy Sliding-Mode Method. IEEE Transactions on Automation Science and Engineering. 22, 3852-3865 Jarvis, BW., Abolfathi, K., Poli, R. and Kafash Hoshiar, A., (2024). Haptic-Based Real-Time Platform for Microswarm Steering in a Multi-Bifurcation Vascular Network.. Nanomaterials. 14 (23), 1917-1917 Moghanizadeh, A., Khaksar, H. and Kafash Hoshiar, A., (2023). A novel non-invasive intervention for removing occlusions from shunts using an abrading magnetic microswarm.. IEEE Transactions on Biomedical Engineering. 70 (2), 413-422 Gundersen, RA., Chu, T., Abolfathi, K., Gokcen Dogan, S., Blair, PE., Nago, N., Hamblin, M., Brooke, GN., Zwacka, RM., Kafash Hoshiar, A. and Mohr, A., (2023). Generation of magnetic biohybrid microrobots based on MSC.sTRAIL for targeted stem cell delivery and treatment of cancer. Cancer Nanotechnology. 14 (1), 54- Abolfathi, K., Rosales-Medina, JA., Khaksar, H., Chandler, JH., McDonald-Maier, KD., Ashkan, K., Valdastri, P. and Hoshiar, AK., (2023). Independent and Hybrid Magnetic Manipulation for Full Body Controlled Soft Continuum Robots. IEEE Robotics and Automation Letters. 8 (7), 4235-4242 Kafash Hoshiar, A., Dadras Javan, S., Le, T-A., Hairi Yazdi, MR. and Yoon, J., (2021). Studies on Aggregated Nanoparticles Steering during Deep Brain Membrane Crossing. Nanomaterials. 11 (10), 2754-2754 Kafash Hoshiar, A., Le, T-A., Valdastri, P. and Yoon, J., (2020). Swarm of magnetic nanoparticles steering in multi-bifurcation vessels under fluid flow. Journal of Micro-bio Robotics. 16 (2), 137-145 Lee, S., Kim, J-Y., Kim, J., Kafash Hoshiar, A., Park, J., Lee, S., Kim, J., Pané, S., Nelson, BJ. and Choi, H., (2020). A Needle-Type Microrobot for Targeted Drug Delivery by Affixing to a Microtissue.. Advanced Healthcare Materials. 9 (7), e1901697- Lloyd, P., Hoshiar, AK., da Veiga, T., Attanasio, A., Marahrens, N., Chandler, JH. and Valdastri, P., (2020). A Learnt Approach for the Design of Magnetically Actuated Shape Forming Soft Tentacle Robots. IEEE Robotics and Automation Letters. 5 (3), 3937-3944 Abolfathi, K., Yazdi, MRH. and Hoshiar, AK., (2020). Studies of Different Swarm Modes for the MNPs Under the Rotating Magnetic Field. IEEE Transactions on Nanotechnology. 19, 849-855 da Veiga, T., Chandler, JH., Lloyd, P., Pittiglio, G., Wilkinson, NJ., Hoshiar, AK., Harris, RA. and Valdastri, P., (2020). Challenges of continuum robots in clinical context: a review. Progress in Biomedical Engineering. 2 (3), 032003-032003 Jeon, S., Kafash Hoshiar, A., Kim, K., Lee, S., Kim, E., Lee, S., Kim, J-Y., Nelson, BJ., Cha, H-J., Yi, B-J. and Choi, H., (2019). A Magnetically Controlled Soft Microrobot Steering a Guidewire in a Three-Dimensional Phantom Vascular Network. Soft Robotics. 6 (1), 54-68 Kafash Hoshiar, A., Jeon, S., Kim, K., Lee, S., Kim, J-Y. and Choi, H., (2018). Steering Algorithm for a Flexible Microrobot to Enhance Guidewire Control in a Coronary Angioplasty Application. Micromachines. 9 (12), 617-617 Kafash Hoshiar, A., Le, T-A., Ul Amin, F., Kim, M. and Yoon, J., (2018). A Novel Magnetic Actuation Scheme to Disaggregate Nanoparticles and Enhance Passage across the Blood–Brain Barrier. Nanomaterials. 8 (1), 3-3 Zhang, X., Le, T-A., Kafash Hoshiar, A. and Yoon, J., (2018). A Soft Magnetic Core can Enhance Navigation Performance of Magnetic Nanoparticles in Targeted Drug Delivery. IEEE/ASME Transactions on Mechatronics. 23 (4), 1573-1584 Jeon, S., Hoshiar, AK., Kim, S., Lee, S., Kim, E., Lee, S., Kim, K., Lee, J., Kim, J-Y. and Choi, H., (2018). Improving guidewire-mediated steerability of a magnetically actuated flexible microrobot. Micro and Nano Systems Letters. 6 (1) Doostie, S., Hoshiar, AK., Nazarahari, M., Lee, S. and Choi, H., (2018). Optimal path planning of multiple nanoparticles in continuous environment using a novel Adaptive Genetic Algorithm. Precision Engineering. 53, 65-78 Korayem, MH., Nosoudi, S., Khazaei Far, S. and Hoshiar, AK., (2018). Hybrid IPSO-automata algorithm for path planning of micro-nanoparticles through random environmental obstacles, based on AFM. Journal of Mechanical Science and Technology. 32 (2), 805-810 Amin, FU., Kafash Hoshiar, A., Do, TD., Noh, Y., Shah, SA., Khan, MS., Yoon, J. and Kim, MO., (2017). Osmotin-loaded magnetic nanoparticles with electromagnetic guidance for the treatment of Alzheimer's disease. Nanoscale. 9 (30), 10619-10632 Kafash Hoshiar, A., Le, T-A., Amin, FU., Kim, MO. and Yoon, J., (2017). Studies of aggregated nanoparticles steering during magnetic-guided drug delivery in the blood vessels. Journal of Magnetism and Magnetic Materials. 427, 181-187 Hoshiar, AK., Le, T-A., Amin, FU., Kim, MO. and Yoon, J., (2017). Functionalized electromagnetic actuation method for aggregated nanoparticles steering. 2017 39th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC). 2017, 885-888 Le, TA., Zhang, X., Hoshiar, AK. and Yoon, J., (2017). Real-time two-dime",
  "content_length": 16473,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:30"
}