{
  "name": "Ali C. Begen",
  "homepage": "https://ali.begen.net",
  "status": "success",
  "content": "Ali C. Begen's Personal Website Ali C. Begen (aka ACBEGEN) Welcome to my personal Website. I live in Konya, Turkiye with my wife Melda and two baby girls Meryem and Zeynep. My Background Upcoming/Recent Talks Recent News My Background Short Biography Long Biography Work Experience Ali C. Begen is a computer science professor at Ozyegin University in Istanbul and the founder of Networked Media, an innovation and engineering studio focused on IP video technologies. Through this venture, he collaborates with media-tech companies and law firms, delivering expert insights and cutting-edge solutions. Previously, he was a technical lead at Cisco in San Jose, California. Begen earned his PhD in Electrical and Computer Engineering from Georgia Tech in 2006. His work has earned him numerous academic and industry honors, including an Emmy® Award for Technology and Engineering. He is a Streaming Video Technology Alliance (SVTA) Fellow, holds over 40 US patents, and is recognized as a Distinguished Member of the ACM and a Senior Member of the IEEE. More details are at https://ali.begen.net. Ali C. Begen is a computer science professor at Ozyegin University in Istanbul and the founder of Networked Media, an innovation and engineering studio focused on IP video technologies. Through this venture, he collaborates with media-tech companies and law firms, delivering expert insights and cutting-edge solutions. Previously, he was a technical lead at Cisco in San Jose, California, where he designed and developed advanced algorithms, protocols and products for service provider and enterprise video domains. Dr. Begen earned his PhD in Electrical and Computer Engineering from Georgia Tech in 2006. His work has earned him numerous academic and industry honors, including an Emmy® Award for Technology and Engineering. He is a Streaming Video Technology Alliance (SVTA) Fellow, holds over 40 US patents, and is recognized as a Distinguished Member of the ACM and a Senior Member of the IEEE. In 2016, Dr. Begen was selected as a Distinguished Lecturer by the IEEE Communications Society, a position he was re-elected to for a second two-year term in 2018. Since 2017, he has led the Turkish National Body for ISO/IEC JTC1/SC29 (JPEG and MPEG) as Head of Delegation. He was also named one of the world’s most influential scientists in networking and telecommunications in both 2020 and 2021. To learn more about his work and professional activities, visit https://ali.begen.net. After finishing my undergraduate degree in electrical engineering from Bilkent University in 2001, I attended Georgia Tech to get my PhD in electrical and computer engineering. Since then, I have been working on problems associated with multimedia applications that generate many (often high-bandwidth and time-critical) flows of information with complex inter-flow semantic relationships. After graduating in 2006, I started at Cisco's Video and Content Platforms Research and Advanced Development Group. I architected, designed and developed algorithms, protocols, products and solutions in the service provider and enterprise video domains. Papers, talks and presentations from my Cisco projects are available here. I left Cisco in late 2015 and launched my own company - Networked Media, an innovation and engineering studio that collaborates with media-tech companies and law firms on IP video technologies. In June 2016, I also joined the Ozyegin University Computer Science Department, where I currently teach networking and multimedia courses to undergraduate and graduate students. Alongside teaching and research, I actively contribute to academic service and community initiatives. Upcoming/Recent Talks MOQtail: a Little Bit Live, a Little Bit On Demand, a Whole Lotta QUIC IEEE Communications Society Distinguished Speaker Program Nov. 5th, 2025: Concordia University (link) Oct. 28th, 2025: Carleton University MOQtail: a Little Bit Live, a Little Bit On Demand, a Whole Lotta QUIC (link) SVTA Segments - Oct. 2025 Streaming Bad: Breaking Latency with MOQ (link, slides, video) RTC.ON - Sept. 2025 Live and Real-Time Video Delivery (link/slides, video) IETF 123 (ICCRG) - July 2025 MOQtail: Stream Responsibly (link) SVTA Segments - July 2025 MOQtail - Made with 100% QUIC. Zero latency. Zero hangover. (link, slides) 12th Media Web Symp. - June 2025 MOQ Me, Don't WebRTC Me (link, video) WebRTC Live Webinar (Episode 102) - May 2025 Media over QUIC: Delivering Media, Fast and Furious Style (link, slides) Media Production Show - May 2025 Media over QUIC: Delivering Media, Fast and Furious Style IEEE Communications Society Distinguished Speaker Program May 13th, 2025: University of Essex Catching the Moment: Low-Latency Live Streaming at Scale (slides) NUS ARTIC Technical Seminar - Nov. 2024 Multi-CDN Delivery (video) SVTA Webinar - Oct. 2024 DASH and Media-over-QUIC Transport Face-Off: Performance Showdown at Low Latency (link) SMPTE MTS - Oct. 2024 Impact of Prioritized HTTP/3 Transport on Low-Latency Live Streaming (slides) HLS Interest Workshop - Oct. 2024 Unifying Real-Time Communications and Content Delivery with Media-over-QUIC Transport IEEE Communications Society Distinguished Speaker Program Oct. 4th, 2024: UMass Amherst (link) Sept. 20th, 2024: Ghent University DASH and Media-over-QUIC Transport Face-Off: Performance Showdown at Low Latency (video) RTC.ON - Sept. 2024 The Age of TCP is Over, The Time of MOQ has Come (link) IEEE ICME ULLRMD'24 Keynote - July 2024 DASH and Media-over-QUIC Transport Face-Off: Performance Showdown at Low Latency (link) IEEE ICME LIVES'24 Keynote - July 2024 MOQing the World at Low Latencies 11th Media Web Symp. - June 2024 MOQing the World at Low Latencies (video) CommCon - June 2024 Unifying Real-Time Communications and Content Delivery with Media-over-QUIC Transport IEEE Communications Society Distinguished Speaker Program May 23rd, 2024: The Chinese University of Hong Kong (Shenzhen) (link) May 23rd, 2024: The Hong Kong University of Science and Technology (Guangzhou) (link) The Road to Low Latency with Media-over-QUIC Transport: Unified Real-Time Communications and Content Delivery Huawei Strategy and Technology Workshop (STW) - May 2024 The Age of TCP is Over, The Time of MOQ has Come (video) Georgia Tech CS 8803MN Guest Lecture - Apr. 2024 Unifying Real-Time Communications and Content Delivery with Media-over-QUIC Transport Orange Innovation - Apr. 2024 Unifying Real-Time Communications and Content Delivery with Media-over-QUIC Transport SVTA Segments - Feb. 2024 Unifying Real-Time Communications and Content Delivery with Media-over-QUIC Transport IEEE Communications Society Distinguished Speaker Program Feb. 5th, 2024: Georgia Tech (link) Feb. 19th, 2024: UT Dallas (link) Recent News IEEE MMSP 2026 in Istanbul (link) MOQtail (link) ACM Distinguished Member (link) MPEG 148 in Antalya (link) SVTA Industry Fellow (link) MPEG 142 in Antalya (link) ACM SIGMM Test of Time Paper Award in the category of multimedia systems-networking (link) Emmy® Award for Technology and Engineering for standardization of HTTP encapsulated protocols (NATAS press release, ISO press release, MPEG press release, my posts (EN/TR), OzU news (EN/TR), Bilkent news (EN/TR))",
  "content_length": 7238,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:21"
}