{
  "name": "Ali Siahkoohi",
  "homepage": "https://alisiahkoohi.github.io",
  "status": "success",
  "content": "Ali Siahkoohi Background Assistant Professor, University of Central Florida (2025–present) Simons Postdoctoral Fellow, Rice University (2022–2025) Ph.D., Georgia Institute of Technology, Computational Science and Engineering (2022) M.Sc., University of Tehran, Geophysics (2016) B.Sc., Sharif University of Technology, Electrical Engineering (2013) Research My research focuses on uncertainty quantification in complex systems that arise in computational science and engineering, with an emphasis on deep generative modeling. By integrating deep learning and scientific computing, my group develops scalable sampling techniques for high-dimensional distributions. This work enables Bayesian inference in large-scale PDE-based inverse problems (e.g., seismic and medical imaging) and provides a principled framework for building reliable, uncertainty-aware AI models for real-world applications. Teaching Sampling Methods for Uncertainty Quantification (Spring 2026) Algorithms for Machine Learning (Fall 2025) Publications Preprints Improving fairness and mitigating MADness in generative models P. M. Mayer, L. Luzi, A. Siahkoohi, D. H. Johnson, and R. G. Baraniuk 2024. [pdf] [code] [slides] [bib] Journal papers Multi-scale clustering and source separation of InSight mission seismic data A. Siahkoohi, R. Morel, R. Balestriero, E. Allys, G. Sainton, T. Kawamura, and M. V. de Hoop IEEE Transactions on Geoscience and Remote Sensing, 2025, In print. [pdf] [code] [slides] [bib] ASPIRE: Iterative amortized posterior inference for Bayesian inverse problems R. Orozco, A. Siahkoohi, M. Louboutin, and F. J. Herrmann Inverse Problems, 41(4):045001, 2025. [pdf] [code] [link] [bib] InvertibleNetworks.jl: A Julia package for scalable normalizing flows R. Orozco, P. Witte, M. Louboutin, A. Siahkoohi, G. Rizzuti, B. Peters, and F. J. Herrmann Journal of Open Source Software, 9(99):6554, 2024. [pdf] [code] [link] [bib] Boomerang: Local sampling on image manifolds using diffusion models L. Luzi, P. M. Mayer, J. Casco-Rodriguez, A. Siahkoohi, and R. G. Baraniuk Transactions on Machine Learning Research, 2024. [pdf] [code] [link] [bib] Learned multiphysics inversion with differentiable programming and machine learning M. Louboutin, Z. Yin, R. Orozco, T. J. Grady II, A. Siahkoohi, G. Rizzuti, P. A. Witte, O. Møyner, G. J. Gorman, and F. J. Herrmann The Leading Edge, 42(7):474–486, 2023. [pdf] [link] [bib] [featured in Seismic Soundoff] Optimized time-lapse acquisition design via spectral gap ratio minimization Y. Zhang, Z. Yin, O. López, A. Siahkoohi, M. Louboutin, R. Kumar, and F. J. Herrmann Geophysics, 88(4):A19–A23, 2023. [pdf] [link] [bib] Reliable amortized variational inference with physics-based latent distribution correction A. Siahkoohi, G. Rizzuti, R. Orozco, and F. J. Herrmann Geophysics, 88(3):R297–R322, 2023. [pdf] [slides] [code] [link] [bib] [featured in Geophysics Bright Spots] Deep Bayesian inference for seismic imaging with tasks A. Siahkoohi, G. Rizzuti, and F. J. Herrmann Geophysics, 87(5):S281–S302, 2022. [pdf] [code] [link] [bib] The importance of transfer learning in seismic modeling and imaging A. Siahkoohi, M. Louboutin, and F. J. Herrmann Geophysics, 84(6):A47–A52, 2019. [pdf] [code] [link] [bib] Conference proceedings and presentations Self-consuming generative models go MAD S. Alemohammad, J. Casco-Rodriguez, L. Luzi, A. I. Humayun, H. Babaei, D. LeJeune, A. Siahkoohi, and R. G. Baraniuk The Twelfth International Conference on Learning Representations, 2024. [pdf] [extended pdf] [poster] [link] [bib] [featured in the news 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13] [self-consuming AI resources] Titan: Bringing the deep image prior to implicit representations L. Luzi, D. LeJeune, A. Siahkoohi, S. Alemohammad, V. Saragadam, H. Babaei, N. Liu, Z. Wang, and R. G. Baraniuk IEEE International Conference on Acoustics, Speech and Signal Processing, pages 6165–6169, 2024. [pdf] [code] [link] [bib] Conditional score-based diffusion models for Bayesian inference in infinite dimensions L. Baldassari, A. Siahkoohi, J. Garnier, K. Sølna, and M. V. de Hoop Advances in Neural Information Processing Systems, volume 36, pages 24262–24290, 2023. [pdf] [slides] [poster] [code] [link] [bib] [featured as a Spotlight presentation] Unearthing InSights into Mars: Unsupervised source separation with limited data A. Siahkoohi, R. Morel, M. V. de Hoop, E. Allys, G. Sainton, and T. Kawamura Proceedings of the 40th International Conference on Machine Learning, volume 202, pages 31754–31772, 2023. [pdf] [slides] [poster] [code] [link] [bib] Amortized normalizing flows for transcranial ultrasound with uncertainty quantification R. Orozco, M. Louboutin, A. Siahkoohi, G. Rizzuti, T. van Leeuwen, and F. J. Herrmann Medical Imaging with Deep Learning, volume 227, pages 332–349, 2023. [pdf] [link] [bib] Refining amortized posterior approximations using gradient-based summary statistics R. Orozco, A. Siahkoohi, M. Louboutin, and F. J. Herrmann 5th Symposium on Advances in Approximate Bayesian Inference, 2023. [pdf] [link] [bib] Adjoint operators enable fast and amortized machine learning based Bayesian uncertainty quantification R. Orozco, A. Siahkoohi, G. Rizzuti, T. van Leeuwen, and F. J. Herrmann Medical Imaging 2023: Image Processing, volume 12464, page 124641L, 2023. [pdf] [link] [bib] Learned one-shot imaging M. Louboutin, R. Orozco, A. Siahkoohi, and F. J. Herrmann Third International Meeting for Applied Geoscience & Energy, 2023. [html] [poster] [code] [bib] 3D seismic survey design by maximizing the spectral gap Y. Zhang, Z. Yin, O. Lopez, A. Siahkoohi, M. Louboutin, and F. J. Herrmann Third International Meeting for Applied Geoscience & Energy, 2023. [pdf] [poster] [bib] Ultra-low-bitrate speech coding with pretrained Transformers A. Siahkoohi, M. Chinen, T. Denton, W. B. Kleijn, and J. Skoglund Proceedings of Interspeech, pages 4421–4425, 2022. [pdf] [link] [bib] Velocity continuation with Fourier neural operators for accelerated uncertainty quantification A. Siahkoohi, M. Louboutin, and F. J. Herrmann Society of Exploration Geophysicists Technical Program Expanded Abstracts, pages 1765–1769, 2022. [pdf] [slides] [code] [link] [bib] Accelerating innovation with software abstractions for scalable computational geophysics M. Louboutin, P. Witte, A. Siahkoohi, G. Rizzuti, Z. Yin, R. Orozco, and F. J. Herrmann Society of Exploration Geophysicists Technical Program Expanded Abstracts, pages 1482–1486, 2022. [pdf] [slides] [link] [bib] Learned coupled inversion for carbon sequestration monitoring and forecasting with Fourier neural operators Z. Yin, A. Siahkoohi, M. Louboutin, and F. J. Herrmann Society of Exploration Geophysicists Technical Program Expanded Abstracts, pages 467–472, 2022. [pdf] [slides] [code] [link] [bib] A simulation-free seismic survey design by maximizing the spectral gap Y. Zhang, M. Louboutin, A. Siahkoohi, Z. Yin, R. Kumar, and F. J. Herrmann Society of Exploration Geophysicists Technical Program Expanded Abstracts, pages 15–20, 2022. [pdf] [slides] [code] [link] [bib] Wave-equation based inversion with amortized variational bayesian inference A. Siahkoohi, R. Orozco, G. Rizzuti, and F. J. Herrmann EAGE Workshop on Deep Learning for Seismic Processing: Investigating the Foundations, 2022. [pdf] [slides] [code] [link] [bib] Photoacoustic imaging with conditional priors from normalizing flows R. Orozco, A. Siahkoohi, G. Rizzuti, T. van Leeuwen, and F. J. Herrmann Neural Information Processing Systems Workshop on Deep Learning and Inverse Problems, 2021. [pdf] [poster] [link] [bib] Preconditioned training of normalizing flows for variational inference in inverse problems A. Siahkoohi, G. Rizzuti, M. Louboutin, P. Witte, and F. J. Herrmann 3rd Symposium on Advances in Approximate Bayesian Inference, 2021. [pdf] [slides] [code] [link] [bib] Learning by example: Fast reliability-aware seismic imaging with normalizing flows A. Siahkoohi and F. J. Herrmann Society of Exploration Geophysicists Technical Program Expanded Abstracts, pages 1580–1585, 2021. [pdf] [slides] [code] [link] [bib] Enabling uncertainty quantification for seismic data preprocessing using normalizing flows (NF)—An interpolation example R. Kumar, M. Kotsi, A. Siahkoohi, and A. Malcolm Society of Exploration Geophysicists Technical Program Expanded Abstracts, pages 1515–1519, 2021. [pdf] [code] [link] [bib] Parameterizing uncertainty by deep invertible networks, an application to reservoir characterization G. Rizzuti, A. Siahkoohi, P. A. Witte, and F. J. Herrmann Society of Exploration Geophysicists Technical Program Expanded Abstracts, pages 1541–1545, 2020. [pdf] [slides] [code] [link] [bib] Transfer learning in large-scale ocean bottom seismic wavefield reconstruction M. Zhang, A. Siahkoohi, and F. J. Herrmann Society of Exploration Geophysicists Technical Program Expanded Abstracts, pages 1666–1670, 2020. [pdf] [slides] [code] [link] [bib] Weak deep priors for seismic imaging A. Siahkoohi, G. Rizzuti, and F. J. Herrmann Society of Exploration Geophysicists Technical Program Expanded Abstracts, pages 2998–3002, 2020. [pdf] [slides] [code] [link] [bib] Uncertainty quantification in imaging and automatic horizon tracking—a Bayesian deep-prior based approach A. Siahkoohi, G. Rizzuti, and F. J. Herrmann Society of Exploration Geophysicists Technical Program Expanded Abstracts, pages 1636–1640, 2020. [pdf] [slides] [code] [link] [bib] A deep-learning based Bayesian approach to seismic imaging and uncertainty quantification A. Siahkoohi, G. Rizzuti, and F. J. Herrmann European Association of Geoscientists & Engineers Conference and Exhibition Extended Abstracts, 2020. [pdf] [slides] [code] [link] [bib] Learned imaging with constraints and uncertainty quantification F. J. Herrmann, A. Siahkoohi, and G. Rizzuti Neural Information Processing Systems Deep Inverse Workshop, 2019. [pdf] [slides] [poster] [link] [bib] Deep-learning based ocean bottom seismic wavefield recovery",
  "content_length": 13312,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:35"
}