{
  "name": "Ali Ghanbari 0001",
  "homepage": "https://ali-ghanbari.github.io",
  "status": "success",
  "content": "Ali Ghanbari Auburn University Department of Computer Science & Software Engineering Samuel Ginn College of Engineering 1301 Shelby Center Auburn, Alabama 36849, USA Email: ghanbari[at]auburn[dot]edu Phone: +1 (334) 84[four]-63[two]6 Research Interests My research spans the intersection of artificial intelligence, software engineering, and programming languages. I employ programming languages and AI techniques to address core challenges in software engineering, such as testing, verification, and automated repair. And I also leverage programming languages and software engineering methods to simplify the construction, reliability, and quality assurance of AI systems. Education & Training History On December 2021, I received my Ph.D. in Software Engineering from The University of Texas at Dallas, where I was working under the supervision of Prof. Andrian (Andi) Marcus. Previously, I received my Master's and Bachelor's degrees from Amirkabir University of Technology (Tehran Polytechnic) both in Software Engineering. From 2022 to 2023, I worked as a CIFellows Postdoctoral Research Associate at Iowa State University, under the mentorship of Prof. Hridesh Rajan. Publications (Google Scholar page) 2025 A. Ghanbari, S. Tavakkol: \"Using Fourier Analysis and Mutant Clustering to Accelerate DNN Mutation Testing\", Proceedings of the 40th IEEE/ACM International Conference on Automated Software Engineering (ASE 2025), Seoul, South Korea, November 2025, 13 pages to appear. [DOI] A. Ghanbari: \"Automatic Goal Clone Detection in Rocq\", 39th European Conference on Object-Oriented Programming (ECOOP 2025). LIPIcs, Volume 333, pp. 12:1-12:19. [DOI] L. Lyons, A. Ghanbari: \"On Accelerating Deep Neural Network Mutation Analysis by Neuron and Mutant Clustering\", Proceedings of the 18th IEEE International Conference on Software Testing, Verification and Validation (ICST 2025), Naples, Italy, March 2025, pp. 267--278. [DOI] 2024 A. Ghanbari: \"Decomposition of Deep Neural Networks into Modules via Mutation Analysis\", Proceedings of the 33rd ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2024), Vienna, Austria, September 2024, pp. 1669-–1681. [DOI] 2023 A. Ghanbari, D-G. Thomas, M. A. Arshad, and H. Rajan: \"Mutation-based Fault Localization of Deep Neural Networks\", Proceedings of the 38th IEEE/ACM International Conference on Automated Software Engineering (ASE 2023), Kirchberg, Luxembourg, September 2023, pp. 1301--1313. [DOI]Distinguished Paper Award 2022 A. Ghanbari, A. Marcus: \"Shibboleth: Hybrid Patch Correctness Assessment in Automated Program Repair\", Proceedings of the 37th IEEE/ACM International Conference on Automated Software Engineering (ASE 2022), Rochester, MI, USA, October 2022, pp. 1--4. [DOI] A. Ghanbari, A. Marcus: \"Faster Mutation Analysis with MeMu\", Proceedings of the 31st ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2022), Virtual Event, July 2022, pp. 781--784. [DOI] A. Ghanbari, A. Marcus: \"Patch Correctness Assessment in Automated Program Repair Based on the Impact of Patches on Production and Test Code\", Proceedings of the 31st ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2022), Virtual Event, July 2022, pp. 654--665. [DOI] A. Ghanbari: \"Revisiting Object Similarity-based Patch Ranking in Automated Program Repair: An Extensive Study\", IEEE/ACM International Workshop on Automated Program Repair (APR 2022), Virtual Event, May 2022, pp. 16--23. [DOI] 2021 A. Ghanbari, A. Marcus: \"Toward Speeding up Mutation Analysis by Memoizing Expensive Methods\", Proceedings of the 43rd ACM/IEEE International Conference on Software Engineering: New Ideas and Emerging Results (ICSE-NIER 2022), Virtual Event, May 2021, pp. 71--75. [DOI] 2020 A. Ghanbari, A. Marcus: \"PRF: A Framework for Building Automatic Program Repair Prototypes for JVM-Based Languages\", Proceedings of the 28th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2020), Virtual Event, November 2020, pp. 1570--1573. [DOI] A. Ghanbari: \"ObjSim: Lightweight Automatic Patch Prioritization via Object Similarity\", Proceedings of the 29th ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2020), Virtual Event, July 2020, pp. 541--544. [DOI] Y, Lou, A. Ghanbari, X. Li, L. Zhang, Z. Haotian, D. Hao, and L. Zhang: \"Can Automated Program Repair Refine Fault Localization? A Unified Debugging Approach\", Proceedings of the 29th ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2020), Virtual Event, July 2020, pp. 75--87. [DOI] 2019 A. Ghanbari, L. Zhang: \"PraPR: Practical Program Repair via Bytecode Mutation\", Proceedings of the 34th IEEE/ACM International Conference on Automated Software Engineering (ASE 2019), San Diego, CA, USA, November 2020, pp. 1118--1121. [DOI] A. Ghanbari: \"Toward Practical Automatic Program Repair\", Proceedings of the 34th IEEE/ACM International Conference on Automated Software Engineering: Student Reseatch Competition (ASE-SRC 2019), San Diego, CA, USA, November 2020, pp. 1118--1121. [DOI] A. Ghanbari, S. Benton, and L. Zhang: \"Practical Program Repair via Bytecode Mutation\", Proceedings of the 28th ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2019), Beijing, China, July 2019, pp. 19--30. [DOI] S. Benton, A. Ghanbari, and L. Zhang: \"Defexts: A Curated Dataset of Reproducible Real-world Bugs for Modern JVM Languages\", Proceedings of the 41st ACM/IEEE International Conference on Software Engineering (ICSE 2019), Montreal, QC, Canada, May 2019, pp. 47--50. [DOI] Current Students Sarthak Bharadwaj, Ph.D. Student Yidi Kao, Ph.D. Student Alumni Auburn University Lauren Lyons, Master's Student Jared Wang, DREU Intern from Texas A&M University, Research Title: \"Mutation-Based Patch Correctness Assessment for Automated Program Repair\" Thomas Reynolds, DREU Intern from Auburn University, Research Title: \"Decomposition of Deep Neural Networks\" Iowa State University Pratyush Badri, co-advised with Hridesh Rajan, Undergraduate Thesis: \"Decomposition of Deep Learning Models,\" BITS Pilani and Iowa State University Teaching Unergraduate Level Spring 2024, 2025: COMP3700-001 Software Modeling and Design Fall 2024: COMP3700-001 Software Modeling and Design Software Incite (ISSTA 2024) deepmufl (ASE 2023) Shibboleth (ISSTA 2022, ASE 2022) MeMu (ICSE-NIER 2021, ISSTA 2022) PRF (ESEC/FSE 2020) ObjSim (ISSTA 2020) ProFL (ISSTA 2020) PraPR (ISSTA 2019) object-utils Fix Pattern Miner ASM-Ext Camelspider (Master's Thesis, Amirkabir University of Technology) Services Program Committee member for FSE 2025 Program Committee member for ISSTA 2025 Program Committee member for ISSTA 2024 Referee for IEEE Transactions on Software Engineering (IEEE TSE 2024) Program Committee member for APR 2024 Referee for IEEE Transactions on Software Engineering (IEEE TSE 2023) Program Committee member for ISSTA 2023 Demo Track Program Committee member for APR 2023 Extended Review Committee member for OOPSLA 2023 Program Committee member for Artifact Evaluation at OOPSLA 2023 Program Committee member for APR 2022 Referee for ACM Transactions on Software Engineering and Methodology (TOSEM 2021) Awards & Grants SHF: Small: Practical Mutation Analysis for Quality Assurance of Deep Learning Systems, National Science Foundation, 2025--2028 (Sole PI) REU Supplement for \"SHF: Small: Practical Mutation Analysis for Quality Assurance of Deep Learning Systems,\" National Science Foundation, Summer 2026 (Sole PI) CRA Distributed Research Experience for Undergraduates (DREU 2024) Auburn University Startup Grant ASE 2023 ACM SIGSOFT Distinguished Paper Award CIFellows 2021 by National Science Foundation Betty & Gifford Johnson Travel Award 2021 ASE 2019 Student Research Competition (ASE 2019 SRC) 3rd place",
  "content_length": 7887,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:25"
}