{
  "name": "Ali Eslami",
  "homepage": "https://www.wichita.edu/profiles/academics/engineering/EECS/Eslami-Ali.php",
  "status": "success",
  "content": "Ali Eslami Ali Eslami, Ph.D. Associate Professor College of Engineering Electrical and Computer Engineering Campus Box 103 (316) 978-3925 ali.eslami@wichita.edu 329, Wallace Hall Main Campus Personal Website Overview I received my Ph.D. in Electrical and Computer Engineering from University of Massachusetts Amherst, USA, in May 2013, my M.Sc in Communications Systems and Signal Processing from Sharif University of Technology, Iran, in 2006, and my B.Sc. in Electrical Engineering from Sharif University of Technology, Iran, in 2004. Over the course of my Ph.D. and post-doc, I had the privilege to collaborate with Professor Calderbank in Duke University, Professor Cui in Texas A&M University, Professor Zhang in Arizona State University, Professor Pishro-Nik in University of Massachusetts Amherst, and Professor Fekri in Georgia Tech. Information Academic Interests and Expertise Education: B.S. in Electrical Engineering, Sharif University of Technology, Iran (2004) M.S. in Electrical Engineering, Sharif University of Technology, Iran (2006) Ph.D. in Electrical and Computer Engineering, University of Massachusetts Amherst, USA (2013) Areas of Research Interest Application of probabilistic methods and machine learning to study complex networks such as gene regulatory networks and networked cyber-physical systems. Evolutionary artificial general intelligence. Error control coding in communications, data storage, and biological systems. Learning from big data for resilience in multi-layer interconnected networks. Internet of things; design and analysis of wireless networks. Areas of Teaching Interest Courses taught: Spring 2018: Error Control Coding, Signals and Systems Fall 2017: Signals and Systems, Probabilistic Methods in Systems Spring 2017: Nano Communications Fall 2016: Probabilistic Methods in Systems Spring 2016: Signals and Systems Fall 2015: Error Control Coding Publications Preprints: 1. M. Okwori and A. Eslami, “Investigating the Impact of Gene Interactions in Predicting Gene                           Mutations of E. coli in Different Exposure-Conditions,” submitted to Bioinformatics, Dec. 2019. Journals: S. Kotiang and A. Eslami, “A Probabilistic Graphical Model for System-Wide Analysis of Gene Regulatory Networks,” to appear in Bioinformatics (pdf). A. Behfarnia and A. Eslami, \"Misbehavior Detection in Ephemeral Networks: Local Voting Games in Presence of Uncertainty,\" IEEE Access, Vol. 7, pp. 184629-184642, Dec. 2019 (pdf). M. Nadji-Tehrani and A. Eslami, “A Brain-Inspired Framework for Evolutionary Artificial General Intelligence,” to appear in IEEE Trans. on Neural Networks and Learning Systems (pdf). A. Behfarnia and A. Eslami, “Error Correction Coding Meets Cyber-Physical Systems: Message-Passing Analysis of Self-Healing Interdependent Networks,” IEEE Transactions on Communications, Vol. 65, No. 7, pp. 2753-2768, Jul. 2017 (pdf). D. Lv, A. Eslami, and S. Cui, “Load-Dependent Cascading Failures in Finite-Size Erdös-Rényi Random Networks,” IEEE Transactions on Network Science and Engineering, Vol. 4, No. 2, Apr.-Jun. 2017 (pdf). A. Eslami, C. Huang, J. Zhang, and S. Cui, “Cascading Failures in Load-Dependent Finite-Size Random Geometric Networks,” IEEE Transactions on Network Science and Engineering, Vol. 3, No. 4, Oct.-Dec. 2016. (pdf). A. Eslami, M. Nekoui, H. Pishro-Nik, and F. Fekri, “Results on Finite Wireless Sensor Networks: Connectivity and Coverage,” ACM Transactions on Sensor Networks, Vol. 9, No. 4, June 2013 (pdf). A. Eslami and H. Pishro-Nik, “On Finite-Length Performance of Polar Codes: Stopping Sets, Error Floor, and Concatenated Design,” IEEE Transactions on Communications, Vol. 61, No. 3, Mar. 2013 (pdf). A. Eslami, M. Nekoui, and H. Pishro-Nik, “Results on Finite Wireless Networks on A Line,” IEEE Transactions on Communications, Vol. 58, No. 8, Aug. 2010 (pdf). A. Eslami, S. Vangala, and H. Pihsro-Nik, “Hybrid Channel Codes for Efficient FSO/RF Communication Systems,” IEEE Transactions on Communications, Vol. 58, No. 10, Oct. 2010 (pdf). Conferences: A. Behfarnia, and A. Eslami, “Local Voting Games for Misbehavior Detection in VANETs in Presence of Uncertainty,” in Proc. 57th Annual Allerton Conference on Communication, Control, and Computing, Monticello, IL, USA, Sept. 2019 (pdf). A. Behfarnia, and A. Eslami, \"Risk Assessment of Autonomous Vehicles Using Bayesian Defense Graphs,\" in Proc. IEEE Vehicular Technology Conference, Chicago, IL, USA, Aug. 2018 (pdf). P. Vuka, A. Behfarnia, and A. Eslami, “A Mobile-Enabled Micro Communication Device for Biosensing,” in Proc. IEEE Nano '17, Pittsburg, PA, USA, Jul. 2017 (pdf). A. Behfarnia and A. Eslami, “Dynamics and Steady-State Behavior of Self-Healing Cyber-Physical Networks in Light of Cyber-Node Delays,” in Proc. IEEE Global Communications Conference (GLOBECOM), Washington, D.C., USA, Dec. 2016 (pdf). A. Behfarnia and A. Eslami, “Message Passing for Analysis and Resilient Design of Self-Healing Interdependent Cyber-Physical Networks,” in Proc. 25th IEEE International Conference on Computer Communications and Networks (ICCCN), Waikoloa, Hawaii, USA, Aug. 2016 (pdf). A. Eslami, A. Velasco, A. Vahid, G. Mappouras, R. Calderbank, and D. Sorin, “Writing without Disturb on Phase Change Memories by Integrating Coding and Layout Design,” in Proc. International Symposium on Memory Systems (MEMSYS), Washington, DC, USA, Oct. 2015 (pdf). D. Lv, A. Eslami, and S. Cui, “Load-based Cascading Failure Analysis in Finite Erdos-Rényi Random Networks,” in Proc. IEEE Global Conference on Signal and Information Processing (GlobalSIP), Atlanta, GA, USA, Dec. 2014 (pdf). A. Eslami, C. Huang, J. Zhang, and S. Cui, “An Analytical Approach to Study Cascading Failures in Finite-Size Random Geometric Networks,” in Proc. IEEE 52nd Annual Allerton Conference on Communication, Control, and Computing, Monticello, IL, USA, Oct. 2014 (pdf). A. Banaei, A. Eslami, C. Georghiades, and S. Cui, “Joint Random Spectrum Sensing and Access Scheme for Decentralized Cognitive Radio Networks,” in Proc. IEEE International Conference on Communications (ICC), Sydney, Australia, May 2014 (pdf). H. Mamani, A. Eslami, H. Saeedi, and H. Pishro-Nik, “On Generalized EXIT Charts of LDPC Code Ensembles over Binary-Input Output-Symmetric Memoryless Channels,” in Proc. IEEE International Symposium on Information Theory (ISIT), Boston, MA, USA, July 2012 (pdf). A. Eslami and H. Pishro-Nik, “A Practical Approach to Polar Codes,” in Proc. IEEE International Symposium on Information Theory (ISIT), Saint Petersburg, Russia, Aug 2011 (pdf). A. Eslami and H. Pishro-Nik, “On Bit Error Rate Performance of Polar Codes in Finite Regime,” in Proc. 48th Annual Allerton Conference on Communication, Control, and Computing, Monticello, IL, USA, Sept. 2010 (pdf). A. Eslami, M. Nekoui, and H. Pishro-Nik, “Results on Finite Wireless Networks on A Line,” in Proc. IEEE Information Theory Workshop (ITW), Cairo, Egypt, Jan. 2010 (pdf). M. Nekoui, A. Eslami, and H. Pishro-Nik, “The capacity of Vehicular Ad Hoc Networks with infrastructure,” in Proc. 6th International Symposium on Modeling and Optimization in Mobile, Ad Hoc, and Wireless Networks and Workshops (WiOPT), Berlin , Germany, Apr. 2008 (pdf). M. Nekoui, A. Eslami, and H. Pishro-Nik, “Scaling Laws for Distance Limited Communications in Vehicular Ad Hoc Networks,” in Proc. IEEE International Conference on Communications (ICC), Beijing, China, May 2008 (pdf). A. Eslami and B. H. Khalaj, “Capacity of network coding for wireless multicasting,” in Proc. 8th Annual IEEE Wireless and Microwave (WAMI) Technology Conference, Clearwater Beach, Florida, USA, Dec. 2006 (pdf). A. Eslami and B. H. Khalaj, “Wireless multicasting using network coding,” in Proc. 1st IEEE International Workshop on Operator-Assisted (Wireless Mesh) Community Networks (OpComm), Berlin, Germany, Sept. 2006 (pdf). Patents and other Intellectual Property A. Eslami, A. Asaduzzaman, and M. H. Erjaei, \"Internet-Based Remote Control and Monitoring System for Commercial Doors Using Mobile Devices.\" U.S. Patent 16/013,114, Pending. Other Interests Photos & Fun ©",
  "content_length": 8123,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:25"
}