{
  "name": "Ali Mili 0001",
  "homepage": "https://web.njit.edu/~mili",
  "status": "success",
  "content": "Ali Mili | People Skip to main content Home Profile Ali Mili Professor, Computer Science Associate Dean for Academic Affairs ali.mili@njit.edu 973-596-5215 5700 Guttenberg Information Technologies Center (GITC) About Me PhD from the University of Illinois, Doctorat es Sciences d'Etat from the University of Grenoble. Currently on the CS Faculty at NJIT. Taught/ worked at several universities around the world, including Algeria (Oran, Algiers), Austria (Klagenfurt), Australia (Adelaide, Brisbane), Canada (Ottawa, Montreal, Quebec), China (ShangHai, Harbin), France (Grenoble), Sudan (Khartoum), Tunisia (Tunis), USA (SEI/CMU, Texas A&M, UT Arlington, WVU). Interested in software engineering, notably program correctness, program repair, software testing. Education doctorat es sciences d'Etat ; Universite Joseph Fourier de Grenoble ; Computer Engineering ; 1985 Ph.D. ; University of Illinois ; Computer Science ; 1981 Doctorat de Troisieme Cycle ; Universite Joseph Fourier de Grenoble ; Octorat De Troisieme Cycle Computer Engineering ; 1978 Website http://web.njit.edu/~mili/ 2025 Fall Courses CS 725 - INDEPENDENT STUDY I CS 489 - COMPUTER SCIENCE RESEARCH PROJ CS 610 - DATA STRUCTURE & ALG CS 684 - SOFTWARE TEST & QUAL ASSURANCE CS 700B - MASTER'S PROJECT CS 790A - DOCT DISSERTATION & RES CS 488 - INDEPENDENT STUDY IN CS CS 701B - MASTER'S THESIS CS 792 - PRE-DOCTORAL RESEARCH DS 700B - MASTER'S PROJECT CS 726 - INDEPENDENT STUDY II Teaching Interests software engineeringalgorithms and data structuressoftware testingprogram correctness Past Courses CS 435: ADV DATA STRUCT-ALG DES CS 435: ADVANCED DATA STRUCTURES AND ALGORITHM DESIGN CS 610: DATA STRUCTURE & ALG CS 610: DATA STRUCTURES AND ALGORITHMS CS 673: SOFTWARE DES & PROD METH CS 684: SOFTWARE TEST & QUAL ASSURANCE CS 684: SOFTWARE TESTING AND QUALITY ASSURANCE CS 698: ST: CS 698: ST:SOFTWARE PROJECT MANAGEMENT CS 698: ST:SOFTWARE QUALITY & TESTING CS 698: ST:SOFTWARE QUALITY AND TESTING CS 791: DOCTORAL SEMINAR FRSH SEM: FIRST-YEAR SEMINAR Research Interests software engineeringsoftware testingprogram verificationprogram repair In Progress A Theory of Program Repair Using relative correctness as a foundation for program repair Computing Loop Functions Outgrowth of consultancy to SEI, dealing with the automation of extracting loop functions. Computing Program Functions Combining the mathematics of computing Loop Functions with rules for composing programs. Building an interface to query programs through Assume(), Verify(), Capture(), Establish(). Journal Article Samia AlBlwi, Imen Marsit, Besma Khaireddine, Amani Ayad, Ji Meng Loh, Ali Mili. 2025. \"Subsumption, Correctness and Relative Correctness: Implications for SoftwareTesting.\" Science of Computer Programming , vol. 239 , pp. 54. Wided Ghardallou, Hessam Mohammadi, Richard C Linger, Mark Pleszkoch, Ji Meng Loh, Ali Mili. 2024. \"Invariant Relations for Affine Loops.\" Springer Verlag , vol. 61 , no. 3 , pp. 261-314. Hessamaldin Mohammadi, Wided Ghardallou, Elijah Brick, Ali Mili. 2023. \"On the Persistent Rumors of the Programmer's Imminent Demise.\" Software and Systems Modeling, Springer , vol. 22 , no. 6 , pp. 1969-1976. Ali Mili, Aleksndr Zakharchenko, Besma Khaireddine, Matias Martinez. 2023. \"Toward a Theory of Program Repair.\" Acta Informatica, Springer Verlag , vol. 66 , no. 3 , pp. 47. Ali Mili. 2021. \"Differentiators and Detectors.\" Elsevier , vol. 169 , pp. 6. SHOW MORE Ji M Loh, Monsour Latif, David Kim, Imen Marsit, Amani Ayad, Mohamed N Omri, Ali Mili. 2021. \"The Ratio of Equivalent Mutants: A Key to Analyzing Mutation Equivalence.\" Elsevier , vol. 181 , pp. 20. Besma Khaireddine, Marwa Ben Abdelali, Lamia Labed Jilani, Aleksandr Zakharchenko, Ali Mili. 2020. \"Correctness Enhancement: A Pervasive Software Engineering Paradigm.\" Inderscience , vol. 10 , no. 1 , pp. 37-73. Nafi Diallo, Wided Ghardallou, Jules Desharnais, Marcelo F Frias, Ali Jaoua, Ali Mili. 2017. \"What is a Fault? and Why Does It Matter?.\" Innovations in Systems and Software Engineering: A NASA Journal , vol. 13 , no. 2-3 , pp. 219-239. Ali Mili, Nafi Diallo, Wided Ghardallou, Marcelo Frias. 2017. \"Projecting Programs on Specifications: Implications and Applications.\" Science of Computer Programming , vol. 138 , pp. 26-48. Latifa Ben Arfa Rabai, Barry Cohen, Ali Mili. 2015. \"Programming Language Use in Academia and Industry.\" Informatics in Education , vol. 14 , no. 2 . Fairouz Tchier, Latifa Ben Arfa, Ali Mili. 2015. \"Putting Engineering into Software Engineering.\" Computers in Human Behavior , vol. 48 , pp. 245-254. Ali Mili, Marcelo F Frias, Ali Jaoua, Rasha Gaffar Helali. 2014. \"Semantic Metrics for Software Products.\" Springer Verlag , vol. 10 , no. 3 , pp. 203-217. Ali Mili, Asma Louhichi, Wided Ghardallou, Khaled Bsaies, Lamia Labed Jilani, Olfa Mraihi. 2013. \"Verifying While Loops with Invariant Relations.\" International Journal of Critical Computer Based Systems , vol. 4 , no. 3 , pp. 23. Ali Mili, Olfa Mraihi, Asma Louhichi, Lamia labed Jilani, Jules Desharnais. 2013. \"Invariant Assertions, Invariant Functions, and Invariant Relations.\" Elsevier / North Holland , vol. 78 , no. 9 , pp. 1212-1239. Neila Rjaibi, Anis Ben Aissa, Latifa Ben Arfa, Ali Mili. 2013. \"Mean Failure Cost as a Measurable Value and Evidence of Cybersecurity: E-Learning Case Study.\" IGI Global , vol. 4 , no. 1 , pp. 64-81. Ali Mili, Anis Ben Aissa, Robert Abercrombie, Frederick Sheldon. 2012. \"Defining and Computing a Value Based Cybersecurity Measure.\" Springer , vol. 10 , no. 4 , pp. 443-453. Ali Mili. 2012. \"Invariant Relations, Invariant Functions and Loop Functions.\" Springer , vol. 8 , no. 3 , pp. 195-212. Ali Mili, Wided Ghardallou, Olfa Mraihi, Asma Louhichi, Lamia Labed Jilani, Khaled Bsaies. 2012. \"A Versatile Concept for the Analysis of Loops.\" Journal of Algebraic and Logic Progranmming , vol. 81 , no. 5 , pp. 606-622. Ali Mili, Latifa Ben Arfa Rabai, Yan Zhi Bai. 2011. \"A Quantitative Model for Software Engineering Trends.\" Elsevier , vol. 181 , no. 22 , pp. 4993-5009. Lamia Labed Jilani, Hamdi Nasreddine, Khaled Bsaies, Ali Mili. 2011. \"Reasoning About Quantitative Architectural Attributes.\" Academy Publishers , vol. 6 , no. 4 , pp. 574-583. Ali Mili, Frederick T Sheldon, Robert Abercrombie, Anis Ben Aissa. 2010. \"Quantifying Security Threats and their Impact.\" Innovations in Systems and Software Engineering: A NASA Journal , vol. 6 , no. 4 , pp. 269-281. Ali Mili. 2010. \"Reflexive Transitive Invariant Relations.\" Elsevier , vol. 45 , no. 11 , pp. 1114-1143. Ali Mili. 2009. \"Mathematics for Reasoning About Loops.\" Science of Computer Programming , vol. 74 , no. 11-12 , pp. 989-1020. Ali Mili. 2009. \"Reflexive Transitive Loop Invariants.\" Journal of Symbolic Computation . COLLAPSE Working Paper \"Function Extraction: A New Paradigm for Producing Secure Code\" New Security Paradigms Workshop, IEEE Computer Society and ACM, September, 2024. Conference Paper \"Detecting Faults vs Revealing Failures: Exploring the Missing Gap\" QRS 2024: Software Quality, Reliability, and Security, July (3rd Quarter/Summer), 2024. \"Mutation Coverage is Not Strongly Correlated with Mutation Coverage\" IEEE Computer Society/ ACM, April (2nd Quarter/Spring), 2024. \"Semantic Coverage: Measuring Test Suite Effectiveness\" INSTICC, July (3rd Quarter/Summer), 2023. Chapter Ali Mili, Samia Alblwi, Imen Marsit, Besma Khaireddine, Amani Ayad, Ji Loh. \"Three Forms of Subsumption: Basic, Strict and Broad.\" \"Communications in Computer and Information Science,\" Springer Verlag, Amani Ayad, Imen Marsit, Mohamed Nazih Omri, Ji Meng Loh, Ali Mili. \"Quantitative Analysis of Mutant Equivalence.\" In Martin van Sinderen and L.A. Maciaszek, eds., \"Software Technologies,\" pp. 58-80. Springer Verlag, 2020. Conference Proceeding \"Computing Program Functions\" ACM, May, 2022. \"Assume(), Capture(), Verify(), Establish(): Ingredients for Scalable Program Verification\" QRS Workshops, December, 2021. \"Mutation Subsumption as Relative Incorrectness\" Springer Verlag, September, 2021. \"The Bane of Generate-and-Validate Program Repair: Too Much Generation, too Little Validation\" IOS Press, September, 2021. \"A Massively Parallel Approach to Automated Software Correctness Enhancement in Java\" IOS Press, September, 2021. SHOW MORE \"Automated Estimation of the Rate of Equivalent Mutants\" IEEE CS, May, 2021. \"Quantifying Faultiness: What does it Mean to Have N Faults?\" IEEE-CS, May, 2021. \"A Semantic Definition of Faults and Its Impact\" IEEE CS, December, 2020. \"Fault Density, Fault Depth and Fault Multiplicity: The Reward of Discernment\" December, 2019. \"Stryker: Scaling Specifications-Based Program Repair by Pruning Infeasible Mutants with SAT\" CoRR abs/ 1910.14011, August, 2019. \"Quantitative Metrics for Mutation Testing\" International Conference on Software Technologies (ICSOFT), July (3rd Quarter/Summer), 2019. \"Program Repair at Arbitrary Fault Depth\" April (2nd Quarter/Spring), 2019. \" Impact of Mutation Operators on the Ratio of Equivalent Mutants\" International Conference on Intelligent Software Methodologies, Tools and Techniques (SOMET 2018), September, 2018. \" Impact of Mutation Operators on Mutant Equivalence\" International Conference on Software Technologies (ICSOFT), June, 2018. \"Proceedings, VeCoS 2017\" Springer Verlag, August, 2017. \"Estimating the Survival Rate of Mutants\" INSTIC, July (3rd Quarter/Summer), 2017. \"A Generic Algorithm for Program Repair\" FormaliSE 2017, May, 2017. \"Relative Correctness: A Bridge Between Proving and Testing\" VECoS 2016, October (4th Quarter/Autumn), 2016. \"Software Evolution by Correctness Enhancement\" SEKE, July (3rd Quarter/Summer), 2016. \"Program Repair by Stepwise Correctness Enhancement\" PrePost 2016, June, 2016. \"Debugging Without Testing\" IEEE, April (2nd Quarter/Spring), 2016. \"Relational Mathematics for Relative Correctness\" Springer Verlag, September, 2015. \"Program Derivation by Correctness Enhancements\" Springer Verlag, June, 2015. \"Correctness",
  "content_length": 12750,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:34"
}