{
  "name": "Ali Raza Butt",
  "homepage": "http://people.cs.vt.edu/butta",
  "status": "success",
  "content": "Ali R. Butt@Virginia Tech Bio Ali is a Professor of Computer Science (and ECE by courtesy) and Associate Department Head for Faculty Development in CS@VT. He is an ACM Distinguished Member. He received his Ph.D. degree in Electrical and Computer Engineering from Purdue University in 2006. He is a recipient of an NSF CAREER Award (2008), IBM Faculty Awards (2008, 2015), a VT College of Engineering (COE) Dean's award for \"Outstanding New Assistant Professor\" (2009), an IBM Shared University Research Award (2009), and NetApp Faculty Fellowships (2011, 2015). He was named a VT COE Faculty Fellow in 2013. Ali was an Academic Visitor at IBM Almaden Research Center (Summer 2012) and a Visiting Research Fellow at Queen's University of Belfast (Summer 2013). He has served as the Associate Editor for IEEE Transactions on Cloud Computing (2018-present), ACM Transactions on Storage (2016-present), IEEE Transactions on Parallel and Distributed Systems (2013-2016), Cluster Computing: The Journal of Networks, Software Tools and Applications (2013-present), and Sustainable Computing: Informatics and Systems (2010-2015). He is an alumni of the National Academy of Engineering's US Frontiers of Engineering (FOE) Symposium (2009), US-Japan FOE (2012), and National Academy of Science's AA Symposium on Sensor Science (2015). He was also an organizer for the US FOE in 2010. Ali's research interests are in: cloud and high-performance computing systems; systems support for machine and deep learning applications; file, I/O, and storage systems; distributed systems; and large-scale experimental computer systems. At Virginia Tech he leads the Distributed Systems & Storage Laboratory (DSSL) and directs the stack@cs Center for Computer Systems. . Teaching CS3214: Intro. to Computer Systems Spring 2010, Spring 2011, Spring 2012, Fall 2012, Spring 2014, Spring 2015, Spring 2017, Spring 2019, Spring 2021, Fall 2021, Fall 2023, Spring 2025 CS4284: Systems & Networking Capstone Spring 2011, Fall 2011, Fall 2012, Fall 2014, Spring 2016, Fall 2017, Fall 2019, Fall 2022, CS5204: Operating Systems Fall 2006, Fall 2008, Fall 2009, Fall 2011, Fall 2014, Fall 2016, Fall 2017, Fall 2018, Fall 2019, Fall 2020, Fall 2021 CS6204: Special Topics File and Storage Systems(Fall 2007) Cloud Computing (Fall 2010) A Walk on the Cloud Side (Spring 2016) The Secret Life of Storage Systems (Fall 2019) Large Scale Distributed Systems (Fall 2025) CS3204: Operating Systems Spring 2007, Spring 2008, Spring 2009, Fall 2009 Selected recent publications [Full publication list] Misc Docker Registry Trace Player Download MRPerf simulator AccuSim Buffer Cache Simulator Note to applicants Recent professional activities General Co-Chair, IEEE International Conference on Cluster Computing (Cluster), 2026 TPC Area Co-Chair for Data Analytics, Visualization, & Storage, The International Conference for High Performance Computing, Networking, Storage, and Analysis (SC'26), 2026 Work-in-Progress/Posters Co-Chair, 22nd USENIX Conference on File and Storage Technologies (FAST), 2024 General Chair, 32nd International ACM Symposium on High-Performance Parallel and Distributed Computing (HPDC), 2023 Treasurer, 14th ACM International Conference on Future Energy Systems (e-Energy), 2023 Finance Chair, International Conference on Supercomputing (ICS), 2022 TPC Co-Chair, IEEE International Conference on Networking, Architecture, and Storage (NAS), 2022 Tutorial Co-Chair, IEEE International Conference on Big Data (IEEE BigData), 2021 TPC Area Co-Chair for Clouds and System Software, The International Conference for High Performance Computing, Networking, Storage, and Analysis (SC'20), 2020 TPC Area Chair for Cloud Computing and Data Centers, 40th IEEE International Conference on Distributed Computing Systems (ICDCS), 2020 Steering Committee, HPDC, 2019--present TPC Co-Chair, 28th ACM International Symposium on High-Performance Parallel and Distributed Computing (HPDC), 2019 Organizer, NSF Visioning Workshop on Data Storage Research 2025, 2018 Associate Editor, ACM Transactions on Storage (TOS), 2016-present Steering Committee, Joint International Workshop on Parallel Data Storage & Data Intensive Scalable Computing Systems (PDSW-DISCS), 2016--present TPC member, USENIX FAST'26, HPDC'26, SoCC'25, IEEE BigData'25, … Panelist: NSF, DOE, NSERC, QNRF, LXR, … Contact information 220 Gilbert Place, Suite 4108 Blacksburg, VA 24060 butta AATT cs.vt.edu $Id: index.html,v butta Exp $",
  "content_length": 4473,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:35"
}