{
  "name": "Ali Zulfiqar",
  "homepage": "https://www.essex.ac.uk/people/alizu48900/zulfiqar-ali",
  "status": "success",
  "content": "Zulfiqar Ali | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Zulfiqar Ali People Dr Zulfiqar Ali Lecturer School of Computer Science and Electronic Engineering (CSEE) Email z.ali@essex.ac.uk Location 4B.526, Colchester Campus Academic support hours During the Autumn Term, my Academic Support Hours are 14:00 - 16:00 on Tuesday. I can meet on Zoom by request at these times. (I will check my email during these support hours and respond with a link.) Profile Research Teaching and supervision Publications Contact Profile Research Teaching and supervision Publications Contact Profile Biography Dr. Zulfiqar Joined School of Computer science and Electronic Engineering at the University of Essex in 2020 as a Lecturer(R). He undertook his Ph.D. study to develop intelligent systems for screening of disorders at the Centre of Intelligent Signal and Imaging Research, Universiti Teknologi PETRONAS, Malaysia. His Ph.D.’s proposed work was approved for funding of 0.5 million US dollars after the external review of the American Association for the Advancement of Science (AAAS). Zulfiqar obtained a Master's degree in Computational Mathematics from the University of the Punjab and a Master's degree in System Engineering from the University of Engineering and Technology, Lahore. He served in the School of Computing at Ulster University from 2018 to 2020 as a Research Fellow in BTIIC (British Telecom Ireland Innovation Centre), where he worked on various funded projects including Smarter Customer Analytics, Intelligent Process Analytics, Adaptive and Autonomic Systems. He also served King Saud University, Riyadh from 2010 to 2018 as a Senior Researcher where he submitted and completed three funded projects, reviewed and approved by AAAS and King Abdulaziz City for Science and Technology. Continued with Ph.D. research interest, Zulfiqar has developed various intelligent systems using machine learning approaches for the screening of disorders. Secure transmission of medical data (speech/image) collected through the Internet of Things using encryption and zero-watermarking is also included in his area of expertise. Recently, a project \" Cloud-Based Privacy Protected Computer-Aided Diagnosis System for Routine Breast Cancer Screening\" has been accepted for funding. He has also provided consultancy in various funded projects. He has published extensively in the domain of speech/speaker recognition, biomedical engineering, security and privacy in healthcare applications, and multimedia forensics. Qualifications PhD Electrical and Electronic Engineering Universiti Teknologi Petronas, Master System Engineering University of Engineering and Technology, Master Computational Mathematics University of the Punjab, Appointments University of Essex Lecturer (R), School of Computer Science and Electronic Engineering, University of Essex (31/3/2020 - present) Other academic Research Fellow, School of Computing, University of Ulster (17/7/2018 - 29/3/2020) Senior Researcher/Assistant professor, Department of Computer Engineering, King Saud University (14/10/2010 - 19/7/2018) Research and professional activities Research interests Adaptive and Autonomic Systems Open to supervise Digital Speech Processing Key words: Speech Recognition Open to supervise Machine Learning Applied to Biomedical Signals Open to supervise Privacy Protection Key words: Watermarking Open to supervise Real-time Predictive Analytics Open to supervise Audio Forensics/Authentication Key words: Audio Splicing Open to supervise Data Analytics Open to supervise Teaching and supervision Current teaching responsibilities Team Project Challenge (CE201) Databases and Information Retrieval (CE205) Current supervision Mohsin Riaz Chaudhry Degree subject: Computer Science Degree type: Doctor of Philosophy Publications Journal articles (53) Sri Pothu Raju, C., Laskar, RH., Ali, Z. and Muhammad, G., (2025). Attention-based Fusion for Stroke Lesion Segmentation on Computed Tomography Perfusion Data. ACM Transactions on Multimedia Computing, Communications, and Applications. 21 (4), 1-23 Sahoo, SK., Samantra, A., Mohapatra, CK., Swain, BP., Ali, Z. and Muhammad, G., (2025). LABDT (Lexi AdaBoost Decision Tree): An Approach for Legal Outcome Prediction Fusing Lexical, Semantic, and Similarity-based features. International Journal of Computational Intelligence Systems. 18 (1) Singamaneni, KK., Muhammad, G. and Ali, Z., (2024). A Novel Multi-Qubit Quantum Key Distribution Ciphertext-Policy Attribute-Based Encryption Model to Improve Cloud Security for Consumers. IEEE Transactions on Consumer Electronics. 70 (1), 1092-1101 Farhat, T., Akram, S., AlSagri, HS., Ali, Z., Ahmad, A. and Jaffar, A., (2024). Facial Image-Based Autism Detection: A Comparative Study of Deep Neural Network Classifiers. Computers, Materials & Continua. 78 (1), 105-126 Rahman, A., Wadud, MAH., Islam, MJ., Kundu, D., Bhuiyan, TMA-U-H., Muhammad, G. and Ali, Z., (2024). Internet of medical things and blockchain-enabled patient-centric agent through SDN for remote patient monitoring in 5G network. Scientific Reports. 14 (1), 5297- Kundu, D., Rahman, MM., Rahman, A., Das, D., Siddiqi, UR., Alam, MGR., Dey, SK., Muhammad, G. and Ali, Z., (2024). Federated Deep Learning for Monkeypox Disease Detection on GAN-Augmented Dataset. IEEE Access. 12, 32819-32829 Muhammad, G., Sattar, F. and Ali, Z., (2024). Guest Editorial Insights of Machine Learning into Medical Decision Making Systems: From Research to Practice. IEEE Journal of Biomedical and Health Informatics. 28 (4), 1801-1802 Ahmad, J., Akram, S., Jaffar, A., Ali, Z., Bhatti, SM., Ahmad, A. and Rehman, SU., (2024). Deep learning empowered breast cancer diagnosis: Advancements in detection and classification. PLOS ONE. 19 (7), e0304757-e0304757 Singamaneni, KK., Muhammad, G. and Ali, Z., (2024). A novel quantum hash-based attribute-based encryption approach for secure data integrity and access control in mobile edge computing-enabled customer behavior analysis. IEEE Access. 12, 37378-37397 Naseer, I., Masood, T., Akram, S., Ali, Z., Ahmad, A., Rehman, SU. and Jaffar, A., (2024). Empowering Diagnosis: Cutting-Edge Segmentation and Classification in Lung Cancer Analysis. Computers, Materials and Continua. 79 (3), 4963-4977 Udoy, AI., Rahaman, MA., Islam, MJ., Rahman, A., Ali, Z. and Muhammad, G., (2024). 4SQR-Code: A 4-state QR code generation model for increasing data storing capacity in the Digital Twin framework.. Journal of Advanced Research. 66, 15-30 Magsi, AH., Yovita, LV., Ghulam, A., Muhammad, G. and Ali, Z., (2023). A Content Poisoning Attack Detection and Prevention System in Vehicular Named Data Networking. Sustainability. 15 (14), 10931-10931 Butt, NA., Gull, H., Ali, Z., Muhammad, G. and AlQahtani, SA., (2023). A multi-prefecture study applying multivariate approaches for predicting and demystifying weather data variations affect COVID-19 spread. Information Systems and e-Business Management Almogahed, A., Mahdin, H., Omar, M., Zakaria, NH., Muhammad, G. and Ali, Z., (2023). Optimized Refactoring Mechanisms to Improve Quality Characteristics in Object-Oriented Systems. IEEE Access. 11, 99143-99158 Hussain Magsi, A., Muhammad, G., Karim, S., Memon, S. and Ali, Z., (2023). Push-Based Content Dissemination and Machine Learning-Oriented Illusion Attack Detection in Vehicular Named Data Networking. Computers, Materials & Continua. 76 (3), 3131-3150 Ahmad, N., Muhammad, G., Yadav, KS., Laskar, RH., Hossain, A. and Ali, Z., (2023). A cascaded deep learning framework for iris centre localization in facial image. Expert Systems. 41 (2) Ali, Z., Imran, M. and Shoaib, M., (2022). An IoT-based smart healthcare system to detect dysphonia. Neural Computing and Applications. 34 (14), 11255-11265 Ali, Z., Amin, F-E. and Hussain, M., (2022). A Novel Fragile Zero-Watermarking Algorithm for Digital Medical Images. Electronics. 11 (5), 710-710 Hussain, I., Ullah, I., Ali, W., Muhammad, G. and Ali, Z., (2022). Exploiting lion optimization algorithm for sustainable energy management system in industrial applications. Sustainable Energy Technologies and Assessments. 52C, 102237-102237 Benarous, L., Benarous, K., Muhammad, G. and Ali, Z., (2022). Deep learning application detecting SARS-CoV-2 key enzymes inhibitors.. Cluster Computing. 26 (2), 1169-1180 Andreu-Perez, J., Perez-Espinosa, H., Timonet, E., Kiani, M., Giron-Perez, MI., Benitez-Trinidad, AB., Jarchi, D., Rosales, A., Gkatzoulis, N., Reyes-Galaviz, OF., Torres, A., Alberto Reyes-Garcia, C., Ali, Z. and Rivas, F., (2022). A Generic Deep Learning Based Cough Analysis System from Clinically Validated Samples for Point-of-Need Covid-19 Test and Severity Levels. IEEE Transactions on Services Computing. 15 (3), 1220-1232 Mubeen, Z., Afzal, M., Ali, Z., Khan, S. and Imran, M., (2021). Detection of impostor and tampered segments in audio by using an intelligent system. Computers and Electrical Engineering. 91, 107122-107122 Awais, M., Raza, M., Ali, K., Ali, Z., Irfan, M., Chugh",
  "content_length": 22690,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:37"
}