{
  "name": "Ali Babar 0001",
  "homepage": "http://www.adelaide.edu.au/directory/ali.babar",
  "status": "success",
  "content": "Staff Directory | Professor Ali Babar × Search University staff directory Login Professor Ali Babar Position Professor Org Unit Computer Science Email ali.babar@adelaide.edu.au Telephone 831 34478 Location Floor/Room 4 , Ingkarni Wardli , North Terrace View My Researcher Profile Qualifications 2007 - Ph.D. in Computer Science and Engineering, University of New South Wales, Australia. 1999 - Master of Science in Computing, University of Technology Sydney, Australia. 1994 - Master of Science in Psychology, Government College Lahore, Pakistan. Publications Books Ali Babar, M., Brown, A.W., Mistrik, I. (Ed.), Agile Software Architecture: Aligning Agile Processes with Software Architecture, Morgen Kaufmann Publishers, December 2013. Ali Babar, M., Dingsoyr, T., Lago, P., Vliet, H. (Ed.), , Springer, 2009. Book chapters Ali Babar, M., Making Software Architecture and Agile Approaches Work Together, in Ali Babar, M., Brown, A.W., Mistrik, I., (Ed.), Agile Software Architecture: Aligning Agile Processes with Software Architecture, Morgen Kaufmann Publishers, December 2013. Ali Babar., M., A Web-based System for Managing Software Architectural Knowledge, in Web-based Support Systems, Yao, J. (Ed.), Springer, pp. 305 – 332, 2010. Ali Babar, M., Supporting the Software Architecture Process with Knowledge Management, in Ali Babar, M., Dingsoyr, T., Lago, P., van Vliet, H. (Ed.), Software Architecture Knowledge Management: Theory and Practice, Springer, pp. 69 – 83, 2009. Ahmed, F., Capretz, L., Ali Babar, M., Software Product Line Engineering: The Future Research Directions, in Software Engineering and Development, Belini, E., Editor, NOVA Publishers, pp. 69 – 92, 2009. Ali Babar, M., Gorton, I., and Kitchenham, B., A Framework for Supporting Architecture Knowledge and Rationale Management, in Rationale Management in Software Engineering, A.H. Dutoit, et al., Editors., Springer, pp. 237-254, 2006. Journal papers Mougouei, D., Shen, H., Ali Babar, M., Partial Selection of Agile Software Requirements, International Journal of Software Engineering and Its Applications, 9(1): pp. 113-126, 2015. Shahin, M., Liang, P., Ali Babar, M., A Systematic Review of Software Architecture Visualization Techniques, Journal of Systems and Software, 94: pp.161-185, 2014. Peng, X., Ali Babar, M., Ebert, C., Collaborative Software Development Platforms for Crowdsourcing, IEEE Software, 31(2): 30-36, 2014. Verner, M. J., Ali Babar, M., Cepra, N., Beecham, S., Hall, T., Factors that Motivate Software Engineering Teams: A Four Country Empirical Study, accepted in Journal of Systems and Software, 92: pp. 115-127, 2014. Stol, K., Avgeriou, P., Ali Babar, M., Fitzgerald, B., A Framework for Assessing Organizations’ Fit with Inner Source, accepted in ACM Transactions on Software Engineering and Methods (TOSEM), 23(2): 18, 2014. Chen, L., Ali Babar, M., Nuseibeh, B., Characterizing Architecturally Significant Requirements, IEEE Software, 30(2), pp. 38-45, 2013. Zhang, H., Ali Babar, M., Systematic Reviews in Software Engineering: An Empirical Investigation, Information & Software Technology, 55(7): pp. 1341-1354, 2013. Zhang, P., Han, Y., Ali Babar, M., A Dataflow Optimization Mechanism for Service-Oriented Cloud Workflow, accepted for publication in the International Journal of Comoputational Science and Engineering, November, 2012. Ali Babar, M., A Framework for Groupware-Supported Software Architecture Evaluation Process in Global Software Development, Journal of Software Evolution and Process, 24(2), pp. 207-229, 2012. Stol, K., Ali Babar, M., Avgeriou, P., Fitzgerald, B., A Comparative Study of Challenges in Integrating Open Source Software and Inner Source Software, Information and Software Technology, 53(12), pp. 1319-1336, 2011. Lago, P., Muccini, H., Ali Babar, M., An Empirical Study of Learning by Osmosis in Global Software Engineering, Journal of Software Evolution and Process, 24(6), pp.693-703, 2012. Zhang, H., Ali Babar, M., Tell, P., A Systematic Approach to Searching Relevant Studies in Software Engineering, Information and Software Technology, 53(6), pp. 625-637, 2011. Chen, L., Ali Babar, M., A Systematic Review of Evaluation of Variability Management Approaches in Software Product Lines, Information and Software Technology, 53(4), pp. 344-362, 2011. Rosik, J., Le Gear, A., Buckley, J., Ali Babar, M., Connolly, D., Assessing Architectural Drift in Commercial Software Development: A Case Study, accepted for publication in Software: Practice and Experience, 41(1), pp. 63-86, 2011. Ali, S.M., Ali Babar, M., Chen, L., Stol, K., A Systematic Review of Comparative Evidence of Aspect-Oriented Programming, Information and Software Technology, 52(9), pp. 871-887, 2010. Niazi, M., Ali Babar, M., Verner, J., Software Process Improvement Barriers: A Cross-Cultural Comparison, Information and Software Technology, 52(11), pp. 1204-1216, 2010. Ali Babar, M., Chen, L., Shull, F., Managing Variability in Software Product Lines, IEEE Software, 27(3), pp. 89-91, 94, 2010. Falessi, D., Ali Babar, M., Cantone, G., Kruchten, P., Empirically Assessing Software Architecture Research: Challenges and Lessons Learned, Empirical Software Engineering Journal, 15(3): pp. 250-276, 2010. Tang, A., Avgeriou, P., Jensen A., Capilla, R., Ali Babar, M., A Comparative Study of Architecture Knowledge Management Tools, Journal of Systems and Software, (83)3: pp. 352-370, 2010. Ali Babar, M., Gorton, I., Software Architecture Reviews: The State of the Practice, IEEE Computer, 42(7): pp. 26-32, 2009. Niazi, M., Ali Babar, M., Identifying High Perceived Value Practices of CMMI Level 2: An Empirical Study, Information and Software Technology, 51(8): pp.1231–1243, 2009. Thiel, S., Ali Babar, M., Botterweck, G., O’Brien, L., Software Product Lines in Automotive Systems Engineering, SAE International Journal of Passenger Cars- Electronic and Electrical   Systems, 1(1): pp. 531-543, 2009. Ali Babar, M., Kitchenham, B., Jeffery, R., Comparing Distributed and Face-to-Face meetings for Software Architecture Evaluation: A Controlled Experiment, Empirical Software Engineering Journal, 13(1): pp. 39-62, 2008. Kitchenham, B., Al-Khilidar, H., Ali Babar, M., Berry, M., Cox, K., Keung, J., Kurniawati, F., Staples, M., Zhang, H., Zhu, L., A Theoretical Evaluation of Guidelines for Reporting Software Engineering Experiments, Empirical Software Engineering Journal, 13(1): pp. 97-121, 2008. Niazi, M., Ali Babar, M., Katugampola, N M., De-motivators of Software Process Improvement: An Empirical Investigation, Software Process Improvement and Practice, 13(3): pp. 249-264, 2008. Ali Babar, M., Nguyen, P.T., Verner, J.M., Establishing and Maintaining Trust in Off-Shore Software Outsourcing Relationships: Practitioners’ Views, Journal of Systems and Software, 80(9), pp. 1438-1449, 2007. Tang, A., Ali Babar, M., Gorton, I., and Han, J., An Empirical Study of the Use and Documentation of Architecture Design Rationale, Journal of Systems and Software, 79(12), pp. 1792-1804, 2006. Ali Babar, M., Kitchenham, B., Zhu, L., Gorton, I., Jeffery, R., An Empirical Study of Groupware Support for Distributed Software Architecture Evaluation Process, Journal of Systems and Software, 79(7): pp. 912-925, 2006. Conference papers Anvari, F., Richards, D., Hitchens, M., Ali Babar, M., Effectiveness of Persona with Personality Traits on Conceptual Design, accepted in the 37th International Conference of Software Engineering (the Education Track), Florence, Italy, 2015. Zhou, Y., Zhang, H., Huang, X., Yang, S., Ali Babar, M., Tang, H., Quality Assessment of Systematic Reviews in Software Engineering: A Tertiary Study, accepted in the 19th International Conference on Evaluation and Assessment in Software Engineering, Nanjing, China, 2015. Cleland-Huang, J., Ali Babar, M., Mirakhorli, M., An Inverted Classroom Experience: Engaging Students in Architectural Thinking for Agile Projects, the proceedings of the 36th International Conference of Software Engineering (the Education Track), Hyderabad, India, 2014. Chen, L., Ali Babar, M., Towards an Evidence-Based Understanding of Emergence of Architecture Through Continuous Refactoring in Agile Software Development, the proceedings of the 11th Working IEEE/IFIP Conference on Software Architecture (WICSA), Sydney, Australia, 2014. Zahedi, M., Ali Babar, M., Knowledge Sharing for Common Understanding of Technical Specifications Through Artifactual Culture, the proceedings of the 18th International Conference on Evaluation and Assessment in Software Engineering, London, UK, 2014. Zahedi, M., Ali Babar, M., Towards an Understanding of Enabling Process Knowing in Global Software Development: A Case Study, the proceedings of the International Conference on Software and Systems Process (ICSSP), Nanjing, China, 2014. Chauhan, M. A., Ali Babar, M., Towards a Reference Architecture of Cloud-enabled Infrastructure for Providing Tools as a Service, the proceedings of the 11th Working IEEE/IFIP Conference on Software Architecture (WICSA), Sydney, Australia, 2014 (short paper). Galster, M., Ali Babar, M., An Empirical Stud of Industrial Practices of Architectural Knowledge Management, the proceedings of the 11th Working IEEE/IFIP Conference on Software Architecture (WICSA), Sydney, Australia, 2014 (short paper). Ali Babar, M., Zahedi, M., Understanding Structures and Affordances of Extended Teams in Global Software Development, the proceedings of the 8th International Conference on Global Software Engineering (ICGSE), Bari, Italy, 2013. Tell, P., Ali Babar, M., Grundy, J., A Preliminary Evaluation of a Support Infrastructure for Applying Activity Based Computing in Global Software Development, the proceedings of the 8th International Conference on Global Software Engineering (ICGSE), Bari, Italy, 2013. Chauhan, M. A., Ali Babar, M., Towards Process Support for Migrating Applications to Cloud Computing, Proceedings of the International Conference on Cloud and Service Computing (CSC 2012), S",
  "content_length": 37305,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:24"
}