{
  "name": "Ali A. Ghorbani 0001",
  "homepage": "http://www.cs.unb.ca/~ghorbani",
  "status": "success",
  "content": "Ali A. Ghorbani | Faculty of Computer Science Ali A. Ghorbani, PhD Faculty of Computer Science Canadian Institute for Cybersecurity (CIC) Founding Director of Research Interests: Cybersecurity & Machine Learning Intelligent and Adaptive Systems Biography: Dr. Ghorbani has dedicated the past 42 years to serving in various academic roles. He is a Professor of Computer Science, a Tier 1 Canada Research Chair in Cybersecurity, a Co-founder and former scientific director of the National Cybersecurity Consortium, and the founding director of the Canadian Institute for Cybersecurity which he established in 2016. Between 2008 and 2017, he served as the Dean of the Faculty of Computer Science at the University of New Brunswick. Throughout his 42-year academic career, he has spent over 25 years conducting fundamental and applied research in machine learning, cybersecurity, and Critical Infrastructure Protection. Dr. Ghorbani has co-invented four awarded patents and filed one more. Moreover, he has published over 300 peer-reviewed articles during his career. In addition to this, he has supervised more than 250 research associates, postdoctoral fellows, and students. His book titled \"Intrusion Detection and Prevention Systems: Concepts and Techniques\" was published by Springer in October 2010. Dr. Ghorbani has developed several technologies that have been adopted by high-tech companies. He has also co-founded three startups, Sentrant Security, EyesOver Technologies, and Cydarien Security, in 2013, 2015, and 2019. His contributions to the success of Q1 Labs Inc. and its QRadar technology have been featured in the book \"Unicorn in the Woods\" by Cordon Pitts (2020). Dr. Ghorbani is a co-inventor of four awarded patents. Throughout his career, he has published over 300 peer-reviewed articles and has supervised more than 250 research associates, postdoctoral fellows, and students. Dr. Ghorbani has developed several technologies that have been adopted by high-tech companies. Additionally, he co-founded three startups: Sentrant Security in 2013, EyesOver Technologies in 2015, and Cydarien Security in 2019. His contributions to the success of Q1 Labs Inc. and its QRadar technology are highlighted in the book \"Unicorn in the Woods\" by Cordon Pitts (2020). Dr. Ghorbani is a co-founder of the UNB-NRC Cybersecurity Collaboration Consortium, established in 2019, and the National Cybersecurity Consortium (NCC), founded in 2020. He also co-founded the Privacy, Security, and Trust (PST) Network in Canada, which includes an annual international conference. From 2007 to 2017, Dr. Ghorbani served as the co-editor-in-chief of \"Computational Intelligence: An International Journal.\" Previously, he held the position of vice president of the Canadian Association of Computer Science (CACS/AIC) and was a member of the CIPS Professional Standards Advisory Council (PSAC) as well as the NSERC Committee on Safety and Security. Currently, Dr. Ghorbani is a member of Statistics Canada's Advisory Council on Ethics and Modernization of Microdata Access and an advisory board member of the Canadian Police College. In 2017, Dr. Ghorbani received the Startup Canada Senior Entrepreneur Award. Two years later, in 2019, he was recognized by Canadian Immigrant Magazine as one of the RBC Top 25 Canadian Immigrants. In 2022, he was featured in Mark Bulgutch's book, \"Forty Brilliant Canadians and Their Vision for the Nation,\" which highlights inspiring Canadians. Dr. Ghorbani was also included in \"Pioneers on the Information Highway: A History of Information Technology at UNB 1958-2008,\" authored by Greg Sprague and Janice El-Bayouni, published in 2023. Furthermore, in 2024, he was honoured with the Lifetime Achievement Award from CAIAC, the Canadian Artificial Intelligence Association.",
  "content_length": 3800,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:19"
}