{
  "name": "Ali Abedi 0002",
  "homepage": "https://pages.cs.wisc.edu/~abedi",
  "status": "success",
  "content": "Ali Abedi | UW-Madison I am an Assistant Professor in the Department of Computer Sciences at the University of Wisconsin-Madison. Prior to joining UW-Madison, I was a postdoc at UC Berkeley and Stanford University, advised by Professors Anant Sahai and Sachin Katti. I received my PhD from the University of Waterloo, advised by Professor Tim Brecht. My research area is computer systems and networking with a special focus on wireless networking/sensing, and low-power and low-cost networking for Internet of Things (IoT) devices. My Curriculum Vitae (Updated October 2024). Email: abedi{at}cs.wisc.edu Twitter GitHub LinkedIn Address: Morgridge Hall room 7671 1205 University Ave University of Wisconsin-Madison Madison, Wisconsin 53706 Research Projects \"Polite\" wireless protocols: privacy/security consequences I found a loophole in the Wi-Fi standard that allows forcing a Wi-Fi device to continuously transmit packets. The discovery of this loophole has led to several interesting studies that look at the privacy and security consequences: HotNets 2020, MobiCom 2022, IEEE IoT Journal 2023, IEEE Sensors Journal 2023 Learn more Automatic evaluation of RF sensors without supervision RF sensors are a key building block of a variety of wireless systems from spectrum monitoring to environmental sensing. We design systems that automatically evaluate these sensors using \"signals of opportunity\" without any human supervision: HotNets 2023 Learn more Low-power and battery-free networking for IoT Billions of new IoT devices will be shipped in the near future. To make them zero maintenance and to lower their environmental pollution impact, it is desirable to eliminate the battery or make their batteries last for tens of years. We have designed low-power and battery-free networking solutions for the 2.4 GHz WiFi and 24 GHz mmWave bands: SIGCOMM 2019, HotNets 2019, SIGCOMM 2020, MobiCom 2021 Learn more Publications A complete list of my publications can be found on Google Scholar. Here is a list of selected publications HotNets 2023 A. Abedi, J. Sanz, and A. Sahai, Automatic Calibration in Crowd-sourced Network of Spectrum Sensors FNWF 2023 S. Arslan, A. Abedi, S. Katti, d-Cellular: Trust-Free Connectivity in Decentralized Cellular Networks Best paper award MobiCom 2022 A. Abedi, D. Vasisht, Non-Cooperative WiFi Localization and its Privacy Implications MobiCom 2021 F. Dehbashi, A. Abedi, T. Brecht, and O. Abari, Can WiFi Backscatter Replace RFID? HotNets 2021 A. Abedi and O. Abari, Can WiFi Backscatter Achieve the Range of RFID? Nulling to the Rescue SIGCOMM 2020 A. Abedi, F. Dehbashi, M. Mazaheri, O. Abari, and T. Brecht, WiTAG: Seamless WiFi Backscatter Communication HotNets 2020 A. Abedi and O. Abari, WiFi Says “Hi!” Back to Strangers! SIGCOMM 2019 M. Mazaheri, S. Ameli, A.Abedi, O. Abari, A Millimeter Wave Network for Billions of Things HotNets 2019 A. Abedi, O. Abari, T. Brecht, Wi-LE: Can WiFi Replace Bluetooth? HotNets 2018 A. Abedi, M. H. Mazaheri, O. Abari, T. Brecht, WiTAG: Rethinking Backscatter Communication for WiFi Networks MobiCom 2018 M. H. Mazaheri, A. Abedi, O. Abari, Poster: Bringing mmWave Communications to Raspberry Pi Awarded the gold medal in the ACM Student Research Competition (SRC) MASCOTS 2014 A.Abedi, and T. Brecht, T-SIMn: T-RATE: A Framework for the Trace-Driven Evaluation of 802.11 Rate Adaptation Algorithms Best paper nominee Teaching I have taught the following graduate and undergraduate courses in the School of Computer Science at the University of Waterloo: CS 451/651: Data-Intensive Distributed Computing Instructor Level: grad and undergrad Terms: Fall 19, Winter 20, Fall 20, Winter 21, Fall 21, Winter 2022 CS 431/631: Data-Intensive Distributed Analytics Instructor Level: grad and undergrad Terms: Fall 19, Winter 20, Fall 20, Winter 21, Fall 21, Winter 2022 CS 136: Elementary Algorithm Design and Data Abstraction Instructor Level: undergrad Terms: Fall 18 CS 350:Operating Systems Instructional Apprentice Level: undergrad Terms: Winter 16, Fall 16, Winter 17",
  "content_length": 4051,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:20"
}