{
  "name": "Ali Aydin Selçuk",
  "homepage": "http://aselcuk.etu.edu.tr",
  "status": "success",
  "content": "Ali Aydin Selcuk's Home Page Prof. Dr. Ali Aydýn Selçuk Professor Department of Computer Engineering TOBB University of Economics and Technology Söðütözü, Ankara 06560 Turkey Email: aselcuk (at) etu.edu.tr Phone: +90 (312) 292-4382 Fax: +90 (312) 292-4180 Brief Biography Ali Aydýn Selçuk received his B.S. degree from Middle East Technical University in 1993, and M.S. from Bilkent University in 1995, in Industrial Engineering, and his Ph.D. degree in Computer Science from University of Maryland, Baltimore County, in 2001. His previous work experience includes RSA Data Security, Novell, the Network Systems Laboratory of Purdue University, and Bilkent University. Currently, he is a professor of Computer Engineering at TOBB-ETÜ. Research Interests Secure communication protocols Trust establishment in networks Blockchain and cryptocurrency protocols Cryptanalysis of block and stream ciphers Group key management Publications Curriculum Vitae Teaching Bil 133: Combinatorics Bil 334: Formal Languages and Automata Bil 452: Data Communication and Computer Networks Bil 448/548: Internet Security Protocols Bil 489/589: Graph Theory Recent Professional Activities Program committee member, CNS 2023: 11th IEEE Conference on Communications and Network Security. Program committee member, Africacrypt 2023. Program committee member, ICISSP 2023: 9th International Conference on Information Systems Security and Privacy. Program committee member, International Symposium on Digital Forensics and Security (ISDFS), 2018-2023. Program committee member, ISC-Turkey, 2007-2023. Program co-chair, ISC Turkey 2022. Program committee member, CNS 2022: 10th IEEE Conference on Communications and Network Security. Program committee member, Africacrypt 2022. Program committee member, LightSec 2018. Program committee member, RSA Conference 2016--Cryptographers' Track (CT-RSA 2016). Program committee member, BalkanCryptSec 2014. Program committee member, International Conference on Applied and Computational Mathematics (ICACM) 2012. Program co-chair, LightSec 2011.",
  "content_length": 2062,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:22"
}