{
  "name": "Ali Shokoufandeh",
  "homepage": "http://drexel.edu/cci/contact/Faculty/Shokoufandeh-Ali",
  "status": "success",
  "content": "Ali Shokoufandeh | Drexel CCI Skip to main content Ali ShokoufandehInterim Dean and Distinguished University Professor Pronouns: he/him/his/himselfComputer Science Phone215.895.2671Emailashokouf@drexel.eduCurriculum VitaeDownload PDF Ali ShokoufandehInterim Dean and Distinguished University Professor Pronouns: he/him/his/himselfComputer ScienceBiographyDr. Shokoufandeh was appointed Interim Dean of the College of Computing & Informatics (CCI) on January 1, 2025, and leads the College’s collaboration with Drexel’s current academic transformation activities with respect to technology studies. Prior to this appointment, he served CCI as Associate Department Head for Graduate Studies, Associate Dean of Research, Senior Associate Dean for Research and Operations, and most recently as Senior Associate Dean for Academic Affairs and Operations. His academic appointments include Visiting Research Assistant Professor at The Wistar Institute and Visiting Assistant Professor, Department of Computer and Information Science, University of Pennsylvania. At CCI, Dr. Shokoufandeh was appointed Assistant Professor, Associate Professor, and Professor in Computer Science. He became a Distinguished University Professor in 2025. He is currently a Fellow at the European Centre for Living Technology, University of Venice. Throughout his career, Dr. Shokoufandeh has had numerous juried journal publications as well as archival conference papers and book chapters. He is research active and has been awarded grants by the U.S. Army, National Science Foundation, National Institutes of Health, DARPA, Environmental Protection Agency, Open Space Institute Land Trust, and the U.S. Air Force Research Laboratory among many other agencies and organizations. His editorial appointments include Reviewing Editor at the Journal of Pattern Recognition, Member of the Editorial Board at Pattern Recognition Letters, Member of the Editorial Board at IET Computer Vision, and Editor at Journal of Pattern Recognition. Dr. Shokoufandeh earned a B.Sc. in Computer Science from the University of Tehran and an M.S. and Ph.D. in Computer Science, as well as a Diploma Certificate in Cognitive Science, from Rutgers University.Research AreasAI, Machine Learning, and RoboticsSTEAM EducationTheoretical Foundations of Computer ScienceResearch InterestsTheory of algorithms, graph theory, combinatorial optimization, computer visionAcademic Distinctions PhD, Computer Science, Rutgers University Diploma Certiﬁcate in Cognitive Science, Rutgers University MS, Computer Science, Rutgers University BS, Computer Science, University of Tehran",
  "content_length": 2618,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:37"
}