{
  "name": "Ali Reza Sadeghian",
  "homepage": "https://www.scs.torontomu.ca/~asadeghi",
  "status": "success",
  "content": "Sadeghian Group Sadeghian Group Dr. Alireza Sadeghian × Dr. Alireza Sadeghian has been with the Department of Computer Science at Toronto Metropolitan University since 1999, where he holds the position of the Professor. He is also an Affiliate Scientist at the Li Ka Shing Knowledge Institute, St. Michael's Hospital, and served as the research Theme Lead on Healthcare AI and Analytics at the Institute for Biomedical Engineering, Science, and Technology (iBEST). Dr. Sadeghian was the Chair of the Department of Computer Science from 2005 to 2015. He is the founding Director of the Advanced Artificial Intelligence Initiative (AI2) Laboratory, Computational Intelligence Initiative (CI2) and Ubiquitous and Pervasive Computing Laboratories (UPCL), and has extensive expertise in the areas of AI, machine learning, Deep Learning, and modeling of complex dynamical systems particularly related to industrial and medical applications. He has supervised and trained 9 postdoctoral fellows, 8 PhD, and 24 Master’s students, as well as 60 research assistants. He has published over 150 journal manuscripts, refereed conference papers, and book chapters, as well as two edited books. He has also filed 2 invention disclosures and 2 patents. Dr. Sadeghian has been actively involved with a number of international professional and academic boards, including IEEE Education Activity Board and NAFIPS board (North American Fuzzy Information Processing Society). Presently, he is the Chair of IEEE Computational Intelligence Technical Society Chapter, Toronto Section. Dr. Sadeghian is also on the Editorial Board of Applied Soft Computing Journal and serves as an Associate Editor of IEEE Access, Information Sciences, and Expert Systems Journal. He has served on over 80 conferences as Honorary Chair/General Chair/Organizer/Technical/Track Program Committee member, and has been a reviewer of many granting bodies including NSERC, MITACS, OCE, CFI, PRECARN, and PREA. Close Dr. Alireza Sadeghian Bio Contact Information George Vari Engineering and Computing Centre 245 Church St, Toronto, ON M5B 1Z4 ENG-280 asadeghi@torontomu.ca (416) 979-5000 ext. 6961 Academic Appointments Professor, Department of Computer Science, Toronto Metropolitan University Affiliate Scientist, Li Ka Shing Knowledge Institute, Keenan Research Centre for Biomedical Science, St. Michael’s Hospital Research Focus Artificial Intelligence Machine Learning Deep Learning Honors & Awards Top 25 Canadian Scientists, Royal Canadian Institute for the Advancement of Science YSGS Outstanding Contribution to Graduate Education Award, Toronto Metropolitan University Teaching Excellence Award, Faculty of Engineering & Applied Science, Toronto Metropolitan University Distinguished Award, Faculty of Engineering, Architecture & Science, Toronto Metropolitan University Dean’s Research Award, Faculty of Science, Toronto Metropolitan University Outstanding Leadership Award, IEEE Toronto People’s Choice Award, Angels Den Competition, St. Michael’s Hospital Foundation Boards & Professional Organizations Standards Development for the Computational Intelligence Society Standards Committee, XAI - eXplainable AI Working Group, IEEE P2976 Working Group, 2021 Member, IEEE Standard Associations Editorial Board, Applied Soft Computing, Elsevier Associate Editor, Information Sciences, Elsevier Associate Editor, IEEE Access, IEEE Associate Editor, Expert Systems, Wiley Chair, IEEE Toronto, Technical Society Chapter, Computational Intelligence Career Highlights 150+ Publications & Patents 55+ HQPs",
  "content_length": 3561,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:34"
}