{
  "name": "Ali Seydi Keçeli",
  "homepage": "https://sites.google.com/view/aliseydikeceli",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationAli Seydi KeçeliHacettepe UniversityComputer Engineering Department06800 Beytepe, Ankara, Turkey Office: Z17-BPhone: +90 321 29775 00 Fax: +90 312 297 7502Personal Information I am currently working as a Assoc. Prof.  at the Computer Engineering Department in Hacettepe University in Ankara. I received the BSc degree from Hacettepe University, Department of Computer Engineering. I also received my MSc (2007) and PhD (2015) degree from the same department. Before starting my master and Phd studies in the same department i worked as software engineer in military projects. My main research areas are image processing, computer vision, data mining, and software engineering. E-mail    : aliseydi [at] cs.hacettepe.edu.trResearch InterestsComputer Vision and Image Processing, Data mining, GPU programming with CUDA, Software Engineering , Game Technologies Journal Publications •Keceli, A. S., & Kaya, A. (2023). Violent activity classification with transferred deep features and 3d-Cnn. Signal, Image and Video Processing, 1-8 (SCI-E).•Keçeli, A. S., Kaya, A., & Can, A. B. (2022). 3D Skeletal Volume Templates for Deep Learning-Based Activity Recognition. Electronics, 11(21), 3567 (SCI-E).•Keceli, A. S., Kaya, A., Catal, C., & Tekinerdogan, B. (2022). Deep learning-based multi-task prediction system for plant disease and species detection. Ecological Informatics, 101679 (SCI-E).• Keceli, A. S., Catal, C., Kaya, A., & Tekinerdogan, B. (2020). Development of a recurrent neural networks-based calving prediction model using activity and behavioral data. Computers and Electronics in Agriculture, 170, 105285 (SCI). •Kaya, A., Keçeli, A. S., Catal, C., & Tekinerdogan, B. (2020). Sensor failure tolerable machine learning-based food quality prediction model. Sensors, 20(11), 3173 (SCI). •Kaya, A.,  Keçeli, A. S., Catal, C.,  Yalıc H. Y., Temuçin, H., Tekinerdogan, B., (2019).  Analysis of Transfer Learning for Deep Neural Network based Plant Classification Models,   Computers and Electronics in Agriculture   (SCI-E)•Kaya, A.,  Keçeli, A. S., Catal, C.,  Tekinerdogan, B., (2018).  The Effect of Data Balancing Techniques on Software Vulnerability Prediction Models  Journal of Software: Evolution and Process.  (SCI-E)•Kaya, A., Keçeli, A. S., Can, A. B., (2018).  Examination of Various Classification Strategies in Classification of  Lung Nodule Characteristics, Journal of the Faculty of Engineering and Architecture of Gazi University .  (SCI-E)•Keçeli, A. S., (2018). Viewpoint Projection Based Deep Feature Learning for Single and Dyadic Action Recognition. ,  Expert Systems with Applications (SCI-E) •Keçeli, A. S., Kaya, A., Can A. B. (2018). Combining 2D and 3D Deep Models for Action Recognition with Depth Information , Signal Image and  Video Processing (SCI-E) •Keçeli, A. S., Kaya, A., Can A. B. (2017).  Depth features to recognize dyadic interactions, IET Computer Vision (SCI)•Keçeli, A. S., Kaya, A., Keçeli S. U. (2017).  Classification of radiolarian images with hand-crafted and deep features, Computers and Geosciences  (SCI)•Keçeli, A. S., Kaya, A.,  (2017). Violent Activity Detection with Transfer Learning Method, Electronic Letters  (SCI)•Kaya, A., Keçeli, A. S., Can, A. B., & Çakmak, H. B. (2017). Cyclotorsion measurement using scleral blood vessels. Computers in Biology and Medicine.  (SCI-E)•Keceli A.S., Kaya A., Can A. B., (2017).  A Gpu-Based Approach For Automatıc Segmentatıon Of White Matter Lesıons In The Human Brain. IETE Journal of Research (SCI-E)•Keçeli A. S., Can A. B.,  (2014).  Recognition of Basic Human Action Using Depth Information. International Journal of Pattern Recognition and Artificial Intelligence, 28.02. (SCI-E)•Yesiloglu-Gultekin N., Keceli A.S., Sezer E.A., Can A.B., Gokceoglu C., Bayhan H., (2012).  A computer program (TSecSoft) to determine mineral percentages using photographs obtained from thin sections.  Computers & Geosciences, 46, 310-316. (SCI)• Yalıç H. Y., Keçeli A. S., Kaya A. (2013).  On-Board Driver Assistance System for Lane Departure Warning and Vehicle Detection.  International Journal of Electrical Energy, 1(3), 132-136• Altinuc S. O., Keceli A. S., Sezer  E. A. (2014).  Semi-Automated Shoreline Extraction in Satellite Imagery and Usage of Fractals as Performance Evaluator.  International Journal of Computer Theory and Engineering, 6(2), 102-106• Keçeli A. S.,  Erzurumlu K., (2010).  Characteristic Usage of Turkish Internet Users in office Environment.  Procedia Computer Science, 3, 809-812.Book Chapters•Kaya, A., Keceli, A. S., Catal, C., & Tekinerdogan, B. (2020). Model analytics for defect prediction based on design-level metrics and sampling techniques. In Model Management and Analytics for Large Scale Systems (pp. 125-139). Academic Press. •Temuçin, H., Keçeli, A. S., Kaya, A., Yalıç, H. Y., Tekinerdoğan, B. “A Cloud-Based Big Data System To Support Visually Impaired People”, Computational Intelligence for Multimedia Big Data on the Cloud with Engineering Applications, Elsevier (2018). Conference Publications•Keçeli, A. S., Kaya, A.., Catal, C.,  Tekinerdogan, B., (2019, September).  Softare Vulnerability Prediction using Extreme Learning Machines Algorithm , UYMS 2019 • Keçeli, A. S., Keceli, S. U. &   Kaya, A., (2018, May). Classification of Radiolarian Fossil Images with Deep Learning Methods. In Signal Processing and Communications Applications Conference (SIU), 2018 26th (pp. 1-4). IEEE. • Kaya, A., Keçeli, A. S., & Can, A. B. (2017, May). Investigation of transfer learning on pulmonary nodule characteristics. In Signal Processing and Communications Applications Conference (SIU), 2017 25th (pp. 1-4). IEEE. • Keçeli, A. S., Kaya, A., & Can, A. B. (2017, May). Action recognition with skeletal volume and deep learning. In Signal Processing and Communications Applications Conference (SIU), 2017 25th (pp. 1-4). IEEE. • Keçeli A.S., Can A. B., (2016) Low Latency Action Recognition With Depth Information, The 11th International Joint Conference on Computer Vision, Imaging and Computer Graphics Theory and Applications, Rome Italy • Keçeli A. S., Nefeslioğlu H. A., Sezer E. A., Gokceoglu C., (2015). A comprehensive approach for medium scale landslide risk assessment, IAMG 2015 Freiberg Germany • Keçeli A. S., Can A. B., (2014).  Multimodal Approach for Recognizing Human Actions Using Depth Information,22nd International Conference on Pattern Recognition (ICPR), Sweden• Keçeli A. S., Can A. B., (2014). Action Recognition Based on Feature Extraction From Time Series, IEEE 22nd Signal Processing and Communications Applications Conference (SIU)• Keceli A. S., Can A. B., (2013).  Recognition of human actions by using depth information.  2013 IEEE 21st Signal Processing and Communications Applications Conference (SIU)• Gokceoglu, C., Yesiloglu-Gultekin, N., Keceli, A. S., Sezer  E.A., Can  A.B., Bayhan, H., (2012). An Experimental Study on the Min-Image Production for Determination of Mineral Percentages. EGU General Assembly 2012, Wien, Austria, EGU2012-3346 • Coşgun E., Kaya A., Keçeli A. S., Karaağaoğlu E., (2012).  GeneLearneR: Genetic Data Mining Analysis Tool.  14. National Biostatistics Congress, Erciyes• Keceli A. S., Kaya A., Çoşkun E., (2011).  Clustering Based Classification on Remote Sensing Images, SDPS 2011, South Korea• Keceli A. S., Can A. B., (2011). GPU Based Brain Segmentation Method, IEEE 19th Conference on Signal Processing and Communications Applications (SIU)• Coşgun E., Kaya A., Keçeli A. S., (2011). Gene 3E: Genetic Veri Madenciliği için Yeni Analiz Aracı, Tıp Bilişimi kongresi• Keceli A. S., Can A. B.,  (2009).  Automatic Segmentation of White Matter Lesions.  2009 IEEE 17th Signal Processing and Communications Applications Conference, 443-446• Levent A., Keçeli  A. S., Aydın G., Güngör G.  Yapıcı B., Özyar E., (2011). Human Motion Sensitive Patient and Personel Security System in Radiation Therapy, Medical Physics Conference, İzmirREVIEWER  FOR JOURNALS·       IEEE Transactions On Image Processing- SCI ·        Computers & Geosciences  - SCI ·        IEEE Transactions On Cybernetics - SCI ·        IEEE Transactions on Man Systems and Cybernetics - SCIE·        IEEE Signal Processing Letters - SCIE·        IET Electronic Letters - SCI ·        IET Generation, Transmission and Distribution - SCIE·        Turkish Journal of Electrical Engineering and Computer Sciences - SCIE·        Informatics in Medicine Unlocked·        KSII Transactions on Internet and Information Systems -SCIE·        ETRI Journal-SCIE·        PeerJ·        Signal Image& Video Processing·        Computer & Electronics in Agriculture·        Ecological Informatics·        IEEE Access·        IET Computer Vision· Journal of Ambient Intelligence and Humanized Computing· Computational Intelligence and Neuroscience· The Computer Journal· Virtual Reality & Intelligent HardwarePROJECTSAISym4MED  06/2023 -Support: EurostarPosition:  ConsultantInfo: AISym4MED is a European Union Project aiming to overcome the challenges faced when using data from multiple data sources and to develop and perfect consumer-ready AI solutions. The project aims to mitigate the problems of using AI by using new solutions to reduce the impact of overfitting effects, as well as to advance secure data processing tools for widespread availability, data quality control and GDPR compliance.EDIT: EYE TRACKING BASED DYSLEXIA DIAGNOSTIC SYSTEM  12/2023- Support: TÜBİTAK TeydebPosition:  ConsultantInfo:  In this project, various deeplearning models is being developed to  predict dyslexia using eye movement features.Sisowiser  06/2022- 06/2023Support: TÜBİTAK TeydebPosition:  ConsultantInfo:Social Support Assistant for Blind and Visually Impaired People 06/2015 -08/2016 Support: Science, Industry and Technology MinistryPosition:  ConsultantInfo: In this project, a device for blind and visually impaired people is being developed. Device will consist of reading sup",
  "content_length": 11211,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:34"
}