{
  "name": "Ali Ayub",
  "homepage": "https://sites.google.com/view/aliayub",
  "status": "success",
  "content": "Ali AyubSearch this siteEmbedded FilesSkip to main contentSkip to navigationAli Ayub email: ali.ayub@concordia.caCV | Google Scholar | GithubI am an Assistant Professor in CIISE and co-affiliated with CSSE in the Gina Cody School of Engineering and Computer Science at Concordia University, where I direct the PaInt Lab. I am also an Affiliate Member at Mila, and an Adjunct Professor in SYDE at the University of Waterloo. My research interests lie at the intersection of Machine Learning (ML) and human-robot Interaction (HRI) and focus on interactive/human-in-the-loop learning. My research goal is to enable long-term personalization for autonomous robots in real-world environments. I develop continual/lifelong learning techniques that can allow robots to interact with and learn from their users and then use the learned knowledge to assist users over the long term. These techniques are backed by rigorous testing in simulation and physical testing on robotic platforms with human users.I graduated with a PhD degree in Electrical Engineering from Penn State with Alan Wagner. Afterwards, I was a Post-Doctoral fellow at the University of Waterloo with Kerstin Dautenhahn and Chrystopher Nehaniv and also worked at Thales, Canada. Before my graduate studies, I obtained my BS in Electrical Engineering at the University of Engineering and Technology, Lahore.I am recruiting MS and PhD students! Please check this page for more information.Note: if you want me to review for your venue, please see this page. NewsOctober 2025: I have been appointed as an Affiliate Member at Mila!August 2025: I gave a talk at the Honda Research Institute Europe, titled \"Long-Term Real-World Personalization for Autonomous Robots\".May 2025: I gave a talk at Mila, titled \"Interactive Continual Learning for Long-term Autonomy\". Check it out here.May 2025: Honored to receive the Petro-Canada Young Innovator Award at Concordia!March 2025: Our preliminary work on task-relevant active learning was presented at the LEAP-HRI workshop (5th edition)!March 2025: I co-organized the LEAP-HRI workshop (5th edition) at HRI 2025 with Bahar Irfan, Nikhil Churamani, Michelle Zhao, and Siliva Rossi.Feb 2025: Our paper on human perceptions of continual learning robots is published in the International Journal of Social Robotics!Jan 2025: Our paper on few-shot segmentation with bounding box annotations has been accepted at ICRA 2025!Older NewsGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2500,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:21"
}