{
  "name": "Alia Madain",
  "homepage": "http://www.just.edu.jo/eportfolio/Pages/Default.aspx?email=asmadain",
  "status": "success",
  "content": "Alia Sayel Madain × Sign In × JUST A-Z Sign In Faculty Member E-Portfolio Page Image Page Content alia sayel madain • Department of Computer Science - Faculty Member --- --- Department of Computer Science asmadain@just.edu.jo Website Research Gate Google Scholar Education Publications Experience Courses Activities Ph.D. of Computer Science from University of Jordan, 2018 Msc. of Computer Science from University of Jordan, 2012 Bsc. of Computer Science from University of Jordan, 2009 \"An interactive attribute-preserving fashion recommendation with 3D image-based virtual try-on\", International Journal of Multimedia Information Retrieval Ahmad Gazi Suleiman Alzubi, Lojin Hazim Mahmoud Bani Younis, Alia Sayel Jiries Madain 09/08/2023 \"Clustering paper shreds of different sizes\", Multimedia Tools and Applications Alia Sayel Jiries Madain 28/11/2022 Assistant Dean, Dean assistant, Sep 2022 - Sep 2023 Faculty Member, Department of Computer Science, Mar 2020 - Present ADVANCED ALGORITHMS ADVANCED ALGORITHMS ANALYSIS AND DESIGN OF ALGORITHMS DATA STRUCTURES HUMAN-COMPUTER INTERACTION INTRODUCTION TO OBJECT- ORIENTED PROGRAMMING INTRODUCTION TO PROGRAMMING Linear algebra SEMINAR IN ADVANCED COMPUTER SCIENCE SEMINAR IN COMPUTER ENGINEERING SEMINAR IN NETWORK ENGINEERING AND SECURITY Academics Academic Calendar Course Schedule Graduate Studies Resources IT Helpdesk Services Library Maharat Open Online Courses News Center Information Classification Policy Information Request Form Information & Feedback Alumni EU Projects Job Opportunities Complaints & Suggestions Newsletter Enter your email address to get the latest University news, special events and student activities delivered right to your inbox. Subscribe to JUST Newsletter ©2022, Information Technology and Communication Center. Jordan University of Science and Technology. All Rights Reserved. Contact JUST Jordan University of Science and Technology P.O.Box 3030, Irbid 22110, Jordan Tel: +962 2 7201000 Fax: +962 2 7095123 Email: public@just.edu.jo Close QS Ranking 2026 Close",
  "content_length": 2052,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:41"
}