{
  "name": "Alice Miller 0001",
  "homepage": "http://www.dcs.gla.ac.uk/~alice",
  "status": "success",
  "content": "Alice Miller's Personal WWW Page Professor Alice Miller BSc(Hons) CEng MIEE Department of Computing Science University of Glasgow tel: +44 (0)141 330 4454 GLASGOW G12 8QQ Scotland email: alice.miller (you input AT symbol) glasgow.ac.uk I am a Professor in the School of Computing Science at the University of Glasgow. I belong to the Formal Analysis, Theory and Algorithms Section ( FATA) and lead the Understandable Autonomous Systems research theme. My research involves using mathematical techniques to analyse complex software systems. These systems include autonomous vehicles such as UAVs, robots, and telecommunications systems. We develop models which we can analyse using logical properties to define the sort of behaviour we expect the system to have. This allows us to expose hidden errors that could affect the performance, efficiency and sometimes safety of a system. The particular technique I use is a type of formal verification called model checking . More specifically my research focuses state-space reduction, in particular, the use of symmetry during search. I also have a keen interest in Combinatorial Design Theory. Recent research (in the Symmetry Journal) has focussed on the use of mathematical designs for Breakout Room Allocation Schedules. You can download Allocation Schedules from our associated website: BoRAT I am keen to apply our theoretical techniques to real world problems. Please contact me if you are a researcher in an applied field (e.g. chemistry, biology, ...), have a search problem, and are interested in collaborating. I also welcome applications from high quality potential research students who wish to undertake research in formal methods, specifically in model checking and related areas, or in symmetry-reduced graph search or combinatorial designs (email me if you are interested in submitting a proposal). For information about previously funded projects, teaching, research students and publications, please see my University Web Page. Prof. Alice Miller, alice.miller@glasgow.ac.uk School of Computing Science, Room S133, University of Glasgow, Glasgow, Scotland, G12 8QQ. Telephone +44 41 330 4256 (ext. 4454), Fax +44 41 330 4454.",
  "content_length": 2189,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:40"
}