{
  "name": "Aline Villavicencio",
  "homepage": "https://www.exeter.ac.uk/research/institutes/idsai/about",
  "status": "success",
  "content": "About | Institute for Data Science and Artificial Intelligence | University of Exeter Skip to main content Search all Institute for Data Science and Artificial Intelligence HomeOur institutesInstitute for Data Science and Artificial IntelligenceAbout Website links Institute for Data Science and Artificial IntelligenceAboutIDSAI teamIDSAI strategic pillarsResearch themesEducationFind a Data ScientistNewsEventsThe Turing InstitutePartnershipsVisitors About us The Institute for Data Science and Artificial Intelligence (IDSAI) was founded in 2018 to develop innovative approaches to the use of data science and artificial intelligence in modern society and to create transformative impact. Across departments and disciplinary boundaries, we provide interdisciplinary thought leadership, facilitate cross-cutting initiatives and enable opportunities and convening for academics at the forefront of data science and AI at the University of Exeter and beyond. To achieve these goals, we enable staff across the University to take advantage of, excel in and lead research and commercial data science and AI opportunities towards a greener, healthier and fairer world. Get involved Leadership Structure: Check out our IDSAI leadership structure. Join our community: Contact us to get involved with IDSAI. Watch this space for opportunities to express your interest and become a vital part of our growing community! Socials - To keep up to date with all of our activities and opportunities, please Follow us on X: @UniExeterIDSAI and on LinkedIn. Host a seminar through IDSAI - We’d love to support you in sharing your research and insights with the wider community! If you're interested in hosting a seminar, simply complete this Microsoft Form, and our team will help promote your event across the IDSAI network. Are you an Early Career Researcher (ECR) Nework - The IDSAI Early Career Research Network (ECRN) is here to help you stay informed about the latest data science and AI developments, including new tools, processes, training programmes, and services. It’s also a fantastic platform for peer-to-peer advice, shared learning, and support. We have a dedicated ECRN Teams channel where we regularly share opportunities, resources, and news that may be of interest to our early career researchers. The ECRN also hosts lightning talk events, providing a space to showcase your work and engage with your peers. If you’d like to join our vibrant community, please contact our ECRN lead, Cedric Mesnage , and start connecting with fellow ECRs today! Interested in setting up a special interest group? If you’re passionate about a specific area of data science or AI and would like to set up a special interest group, we’d love to hear from you! Or, if you're aware of existing data science-related groups that could benefit from connecting with IDSAI, let us know. Please email us to share your ideas and explore opportunities to grow our community. Welcome from the IDSAI Director Professor Aline VillavicencioDirector, Institute for Data Science and Artificial Intelligence Welcome to the Institute for Data Science and Artificial Intelligence (IDSAI) in Exeter. The IDSAI brings together leading interdisciplinary researchers from across all of Exeter’s Departments, Colleges and Institutes, to drive exciting new research and education. We undertake fundamental research in data science and AI and facilitate interactions between data science researchers and problem owners to develop innovative approaches to the use of data in modern society, considering the social implications of data science and AI as well as the technical aspects. To achieve this we work closely with other researchers, industry and government, for instance with key partners such as the Alan Turing Institute. We aim to enhance local and national skills by providing research inspired learning through our masters and undergraduate degree programmes, whilst also promoting the employability of our graduates. We welcome new partners to help us deliver this vision and encourage you to get in touch. Welcome to the Institute for Data Science and Artificial Intelligence (IDSAI) in Exeter. The IDSAI brings together leading interdisciplinary researchers from across all of Exeter’s Departments, Colleges and Institutes, to drive exciting new research and education. Professor Aline Villavicencio Director, Institute for Data Science and Artificial Intelligence IDSAI Senior Management Team Aline Villavicencio IDSAI Director View full profile Emma Roberts IDSAI Manager (on Maternity Leave) View full profile Mark Kelson IDSAI Associate Director View full profile Oliver Hauser Assistant Director View full profile Hywel Williams Interim Strategic Lead: AI for Sustainability and Resilience) View full profile Karen Knapp Interim Strategic Lead: AI for Health and Wellbeing View full profile Ana Beduschi Interim Strategic Lead: AI for a Fair and Inclusive Society View full profile Lu Liu Interim Strategic Lead: AI and Data Science Innovations Foundations View full profile Connect with us 中文网 Information for: Current students New students Staff Alumni and supporters Quick links Contact us Email MyExeter Job vacancies Library PS Connect Portal SID Campuses Streatham Campus Find us Contact St Luke's Campus Find us Contact Penryn Campus Find us Contact Truro Campus Find us Contact Footer links Using our site Accessibility Freedom of Information Modern Slavery Act Statement Data Protection Copyright & disclaimer Privacy Site map Cookie settings",
  "content_length": 5529,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:45"
}