{
  "name": "Alin Deutsch",
  "homepage": "https://jacobsschool.ucsd.edu/faculty/profile?id=179",
  "status": "success",
  "content": "Faculty Profiles | Jacobs School of Engineering Skip to main content Faculty Profiles Back to Faculty Profiles Alin Deutsch Professor, CSE Semistructured and XML data, data security, adaptive distributed query design, and the design and optimization of query languages. Professor Deutsch's research centers around the XML (Extended Markup Language) and the efficient and effective integration of heterogeneous data from multiple sources. XML is widely accepted as the standard for data exchange between businesses on the Internet. However, most corporations publish only selected portions of their proprietary business data as XML documents, and even then only virtually, by exposing an interface against which XML queries can be formulated. This interface allows the user to query the data without having to know where exactly it is physically stored, or under what form. In order to be answered, user queries must be \"reformulated\" as queries on the actual proprietary data. The MARS (Mixed and Redundat Storage) System solves the reformulation problem in a very general setting that allows mixed (XML and relational) storage for the proprietary data and takes advantage of redundancies in the storage (materialized views, indexes and caches) that can enhance performance. The underlying reformulation algorithm is guaranteed to find a reformulation if one exists. Moreover, this algorithm achieves optimal complexity bounds under reasonable restrictions on the expressive power of user queries Capsule Bio: Alin Deutsch is interested in XML databases and XML query languages. He received his Ph.D. in computer science from the University of Pennsylvania in 2002. He received his M.S. in computer science from the Technical University of Darmstadt (Germany) in 1995 and his B.S. in computer engineering from the Bucharest Polytechnic University (Romania) in 1993 - graduating with honors from each institution. During his doctoral studies at the University of Pennsylvania, Deutsch worked as an intern at the AT&T Research Labs and Texas Instruments. As a teaching assistant at the University of Pennsylvania, he taught Java programming techniques and a tutorial on XML technologies. Due to his extensive experience, he is able to provide an effective mix of high-level technical detail and real-world interpretations - enabling him to interact with a wide variety of audiences. Deutsch's entrepreneurial skills have led to a patent in 2000 based on query optimization. Update your profile Email:abdeutsch@ucsd.edu Office Phone:858-822-2276",
  "content_length": 2542,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:43"
}