{
  "name": "Alina Sîrbu",
  "homepage": "http://kdd.isti.cnr.it/people/s%C3%AErbu-alina",
  "status": "success",
  "content": "Sîrbu Alina | Knowledge Discovery and Data Mining Laboratory Skip to main content HomeHighlights Events Hosted Events Job & Study Opportunities Press Contacts ResearchPublications Projects People ResourcesDataset Software Blog Search form Search Sîrbu Alina You are hereHome » People Alina is Associate Professor of Computer Science at University of Pisa, and member of the Knowledge Discovery and Data Mining laboratory. Her research interests are Complex Systems Modelling, Data Science and Machine Learning, applied to a variety of systems ranging from technical (HPC systems, data centres), social (opinion dynamics, social choice theory, behaviour change) to biological (gene regulatory networks). Her work has appeared in BMC Bioinformatics, PLOS One, Journal of Statistical Physics, Nature Methods, Cluster Computing, Quality and Quantity, Advances in Complex Systems and other international journals and conferences. She was previously Research Assistant at Bologna University, Italy, and Postdoctoral Researcher at the Institute for Scientific Interchange in Turin. In 2014 se was Visiting Assistant Professor at New York University, Shanghai. She holds a PhD in Computational Biology from Dublin City University, Ireland and a BSc in Computer Science from AI Cuza. University in Iasi, Romania. She was recipient of the Irish Research Council for Science Engineering and Technology EMBARK scholarship award in 2008. Topics: Machine learning applicationsData-driven management of large computational systemsOpinion dynamicsSocial choice theoryParticipation and behaviour changeGene regulatory network inference Awards Experience Teaching Activities Education 2008 Irish Research Council EMBARK postgraduate scholarship award 2014-2016 Research assistant at the Department of Computer Science and Engineering, University of Bologna, Italy2014 Visiting Assistant Professor, New York University Shanghai, China 2011-2016 Postdoctoral Researcher at the Institute for Scientific Interchange, Turin, Italy 2016/2017 University of Pisa, Computer Networks Laboratory (Network and concurrent programming with Java)2016/2017 University of Pisa, Programming I Laboratory (Introduction to C programming)2015/2016 University of Pisa, Computer Networks Laboratory (Network and concurrent programming with Java)2014/2015 NYU Shanghai, Introduction to Computer Science (Computer Science topics and Python programming)2014 Big Dive third edition, Machine Learning course2013 Big Dive second edition, Machine Learning course2012 Big Dive first edition, Machine Learning course2010/2011 Dublin City University, Object oriented programming with Java2010/2011 Dublin City University, Introduction to Databases 2014 Program committee member, CompleNet, Bologna, Italy2014 Program committee member, Computational Modelling and Bioinformatics in Epigenetics, BIBM, Belfast, UK 2011 PhD in Computer Science (Computational Biology), Dublin City University, Dublin, Ireland.2008 BsC in Computer Science at A.I.Cuza University, Iasi, Romania. Position Associate Professor Affiliation Department of Computer Science, University of Pisa (DI-UNIPI) Room 331 DO Floor 1 Phone +39 0502212745 Email alina.sirbu@unipi.it Homepage http://pages.di.unipi.it/sirbu/ Google Scholar Alina Sîrbu\t\t\t\t\t\t\t\ton Google Scholar Scopus Alina Sîrbu\t\t\t\t\t\t\t\ton Scopus Projects SoBigData++ - European Integrated Infrastructure for Social Mining and Big Data Analytics HumMingBird - Enhanced migration measures from a multidimensional perspective HumanE-AI-Net - HumanE AI Network Publications 2020 J. Kim, Sirbu, A., Giannotti, F., and Gabrielli, L., “Digital Footprints of International Migration on Twitter”, in International Symposium on Intelligent Data Analysis, 2020.DOI Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS A. Sirbu, Andrienko, G., Andrienko, N., Boldrini, C., Conti, M., Giannotti, F., Guidotti, R., Bertoli, S., Kim, J., Muntean, C. Ioana, Pappalardo, L., Passarella, A., Pedreschi, D., Pollacci, L., Pratesi, F., and Sharma, R., “Human migration: the big data perspective”, International Journal of Data Science and Analytics, pp. 1–20, 2020.DOI Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS 2019 A. Sirbu, Giannotti, F., Pedreschi, D., and Kertész, J., “Public opinion and Algorithmic bias”, ERCIM News, 2019.Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS A. Sirbu, Pedreschi, D., Giannotti, F., and Kertész, J., “Algorithmic bias amplifies opinion fragmentation and polarization: A bounded confidence model”, PloS one, vol. 14, p. e0213246, 2019.DOI Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS 2018 G. Rossetti, Milli, L., Rinzivillo, S., Sirbu, A., Pedreschi, D., and Giannotti, F., “NDlib: a python library to model and analyze diffusion processes over complex networks”, International Journal of Data Science and Analytics, vol. 5, pp. 61–79, 2018.DOI Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS 2017 P. Gravino, Sirbu, A., Becker, M., Servedio, V. D. P., and Loreto, V., “Experimental Assessment of the Emergence of Awareness and Its Influence on Behavioral Changes: The Everyaware Lesson”, in Participatory Sensing, Opinions and Collective Awareness, Springer, 2017, pp. 337–362.DOI Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS V. D. P. Servedio, Caminiti, S., Gravino, P., Loreto, V., Sirbu, A., and Tria, F., “Large Scale Engagement Through Web-Gaming and Social Computations”, in Participatory Sensing, Opinions and Collective Awareness, Springer, 2017, pp. 237–254.DOI Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS A. Sirbu, Loreto, V., Servedio, V. D. P., and Tria, F., “Opinion dynamics: models, extensions and external effects”, in Participatory Sensing, Opinions and Collective Awareness, Springer, 2017, pp. 363–401.DOI Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS M. Atzmueller, Becker, M., Molino, A., Mueller, J., Peters, J., and Sirbu, A., “Applications for Environmental Sensing in EveryAware”, in Participatory Sensing, Opinions and Collective Awareness, Springer, 2017, pp. 135–155.DOI Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS G. Rossetti, Milli, L., Rinzivillo, S., Sirbu, A., Pedreschi, D., and Giannotti, F., “NDlib: Studying Network Diffusion Dynamics”, in IEEE International Conference on Data Science and Advanced Analytics, DSA, Tokyo, 2017.DOI Google Scholar BibTeX RTF Tagged MARC EndNote XML RIS Pages1 2 3 4 next › last » Blog Exploring human mobility and migration with BigData: research at SoBigData.eu​ @ NTTS2017 13 Mar 17 Dino Pedreschi 0 Comments 2017-03-13 16.14.17.jpg 2017-03-13 16.16.24.jpg 2017-03-13 16.17.20.jpg 2017-03-13 16.19.48.jpg 2017-03-13 16.28.46.jpg 2017-03-13 16.32.59.jpg 2017-03-13 16.38.15.jpg 2017-03-13 16.13.04.jpg 2017-03-13 16.13.08.jpg At the \"Measuring Migrations\" workshop, a side event of the NTTS2017 conference, Fosca Giannotti, Dino Pedreschi and Alina Sirbu have contributed with a talk titled \"Exploring human mobility and migration Copyright © 2014 - KDD Lab Home Contacts Credits Privacy Reserved Area",
  "content_length": 7033,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:47"
}