{
  "name": "Alin Achim",
  "homepage": "https://www.bristol.ac.uk/people/person/Alin-Achim-a515a426-727d-480b-8d4e-a4a756d6d8f9",
  "status": "success",
  "content": "Professor Alin Achim - Our PeopleBackProfessor Alin AchimB.Sc.(Bucharest), M.Sc.(Bucharest), Ph.D.(PATRAS)ExpertiseStatistical Signal ProcessingInverse ProblemsEarth ObservationSynthetic Aperture RadarBiomedical Image ProcessingCurrent positionsProfessor of Computational ImagingSchool of Computer ScienceContactAlin.Achim@bristol.ac.ukMerchant Venturers BuildingWoodland RoadCliftonBristol, BS8 1UB +44 117 456 1359Press and mediaMany of our academics speak to the media as experts in their field of research. If you are a journalist, please contact the University’s Media and PR Team:+44 117 428 2489press-office@bristol.ac.ukEdit profileResearch interestsSparse representations have been the key underpinning ingredients of statistical learning in signal and image processing. They enable the design of very powerful non-linear algorithms based on statistical assumptions that depart significantly from those of Gaussianity and stationarity. Over time, my group has contributed numerous such algorithms, which offer state-of-the-art performance in the analysis of digital images, multiresolution algorithms, image denoising and fusion, segmentation and classification, and image super-resolution. We have unique expertise in image processing algorithms using sparse distributions in sparse domains and their application to various imaging modalities. In the current era of ML and AI, I did not give up on my life-long quest for designing better solutions to inverse problems by exploiting the statistical characteristics of the data, but chose instead to adapt my interests to the new trends. Specifically, I have been investigating methods that combine classical model-based approaches with data-driven techniques, while at the same time investing a considerable amount of effort in characterizing theoretically novel penalty functions. These can be used as building blocks for various deep learning architectures, either as loss functions, or directly for the design of new representation learning architectures that exploit the statistical sparsity of the input data while enforcing classical sparsity on the learnt representations. From an applications perspective, my research focusses primarily on two apparently very different domains but with a surprisingly high number of synergies and linked together via core fundamental research on computational imaging and statistical machine learning. These are Earth Observation, mainly via Synthetic Aperture Radar, and medical and biological imaging.Projects and supervisionsResearch projectsComputational Synthetic Aperture Radar Imaging With Model-Based Machine LearningAlin AchimPrincipal InvestigatorAlin AchimManaging organisational unitSchool of Computer ScienceDates06/12/2023 to 31/12/2025RUNNINGUniversity Of Bristol And Toshiba Europe Limited KTP 22_23 R2Alin AchimPrincipal InvestigatorAlin AchimManaging organisational unitDates01/05/2023 to 30/04/2026RUNNINGNext Generation Quantitative Acoustic Microscopy For Biomedical Applications (NIH-NIGMS)Alin AchimPrincipal InvestigatorAlin AchimManaging organisational unitDates20/09/2022 to 30/06/2026RUNNINGNext Generation Quantitative Acoustic Microscopy for Biomedical ApplicationsAlin AchimPrincipal InvestigatorAlin AchimManaging organisational unitDates01/04/2022 to 31/03/2026RUNNINGInformation Fusion for Heterogeneous Retinal ImagingAlin AchimPrincipal InvestigatorAlin AchimManaging organisational unitDates01/09/2019 to 31/10/2020FINISHEDView all projectsThesis supervisionsNovel Machine Learning Methods for Lung Ultrasound Image AnalysisTianqi YangSupervisorsAlin Achim, Pui Anantrasirichai, Oktay KarakusCauchy Convolutional Sparse Coding And The Detection of Alzheimer's Disease in MRIPerla Jazmin Mayo Diaz de LeonSupervisorsAlin M Achim, Robin B HolmesMachine Learning Models for Multimodal Retinal ImagingXin TianSupervisorsAlin Achim, Lindsay B Nicholson, Pui AnantrasirichaiNovel Computational Methods for State Space FilteringPengcheng HaoSupervisorsAlin AchimDeep Learning Methods for Biological Image Translation and RegistrationRuixiong WangSupervisorsAlin Achim, Stephen Cross, Mark JepsonContributions to solving inverse problems in synthetic aperture radar imagingZiyao ZhangSupervisorsAlin Achim, Odysseas PappasPublicationsSelected publications01/01/2023Current Advances in Computational Lung Ultrasound Imaging: A ReviewTianqi Yang, et al.IEEE Transactions on Ultrasonics, Ferroelectrics, and Frequency ControlArticlePublished01/05/2022Modeling and SAR Imaging of the Sea SurfaceIgor G Rizaev, et al.ISPRS Journal of Photogrammetry and Remote SensingArticlePublished21/10/2020Convergence Guarantees for Non-Convex Optimisation with Cauchy-Based PenaltiesOktay Karakus, et al.IEEE Transactions on Signal ProcessingArticlePublishedRecent publications29/05/2025Automatic Object Detection in Atmospheric Turbulence-Affected EnvironmentsPaul Hill, et al.Automatic Target Recognition XXXVConference contributionPublished07/03/2025Deep Unfolded Approximate Message Passing for Quantitative Acoustic Microscopy Image ReconstructionOdysseas Pappas, et al.ICASSP 2025 - 2025 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP)Conference contributionPublished28/05/2025Diffusion probabilistic models for compressive SAR imagingOdysseas Pappas, et al.Proceedings of SPIEConference contributionPublished25/01/2025Deep learning techniques for atmospheric turbulence removal:Paul Hill, et al.Artificial Intelligence ReviewArticlePublished01/02/2025Measuring topographic change after volcanic eruptions using multistatic SAR satellitesOdysseas Pappas, et al.Remote Sensing of EnvironmentArticlePublishedView all publicationsRelated peopleProfessor David BullProfessor of Signal ProcessingSchool of Computer ScienceDr Lindsay NicholsonReader in ResearchSchool of Cellular and Molecular MedicineDr Pui AnantrasirichaiAssociate Professor in Visual ComputingSchool of Computer ScienceDr Odysseas PappasSenior Research AssociateSchool of Computer ScienceFeedback",
  "content_length": 6012,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:42"
}