{
  "name": "Alin Dobra",
  "homepage": "http://www.cise.ufl.edu/~adobra",
  "status": "success",
  "content": "Alin Dobra, Professional Homepage Alin Dobra Associate Professor, Department of Computer & Information Science & Engineering University of Florida adobra at cise dot ufl dot edu Phone: 352 392-2722; Fax: 352 392-1220 Office: E434 CSE Building Office Hours: Wednesday 1pm-3pm or by appointment Woodworking/Hobby Web page Database Group Prospective Students   Short Biography  Old Webpage My main research interests are approximate processing of database queries and foundations of data-mining/machine learning.  In terms of approximate query processing, I have wide interests into most approximation techniques: histograms, sampling and sketches with an emphasis of developing a general theory of approximation for database queries. The interest in foundational data-mining is mostly focused on bridging the gap between Statistics and data-mining by developing semi-analytical models to explain the behavior of learning methods. I am a member of the Database Group Recent Publications Florin Rusu, Alin Dobra. Statistical Analysis of Sketch Estimators. To appear in SIGMOD 2007. (pdf) Christopher Jermaine, Subramanian Arumugam, Abhijit Pol, Alin Dobra. Scalable Approximate Query Processing with the DBO Engine. To appear in SIGMOD 2007. (pdf) Best Paper Award Florin Rusu, Alin Dobra. Pseudo-random Number Generation for Sketch-Based Estimations.  ACM TODS (pdf) Ye Xia, Alin Dobra, Seung Chul Han. Multiple-Choice Random Network for Server Load Balancing. To appear in INFOCOM 2007(pdf) Florin Rusu, Alin Dobra. Fast range-summable random variables for efficient aggregate estimation. SIGMOD 2006(pdf) Chris Jermaine, Alin Dobra, Subramanian Arumugam, Shantanu Joshi, Abhijit Pol: The Sort-Merge-Shrink join. ACM TODS(pdf) Full Publication List (with abstracts)  DBLP Funding My work on approximate query processing is funded by an NSF CAREER award. Selected Professional Activities Program Committee member of: KDD 2007, VLDB 2007 (and numerous other conferences in the past) Organizer of First Bertinoro Workshop on Data-mining (October 2005) PhD Students Florin Rusu Amit Dhurandhar Laukik Chitnis Lixia Chen Teaching (recent) COP 5725, Database Management Systems, Spring 2008 CIS 4301, Information and Database Systems I, Fall 2007 COT 5405, Analysis of Algorithms, Spring 2007 COP 5725, Database Management Systems, Fall 2006 COP 6930, Approximate Query Processing, Spring 2006 COP 5725, Database Management Systems, Fall 2005",
  "content_length": 2434,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:44"
}