{
  "name": "Alireza Tamaddoni-Nezhad",
  "homepage": "https://www.surrey.ac.uk/people/alireza-tamaddoni-nezhad",
  "status": "success",
  "content": "Dr Alireza Tamaddoni-Nezhad | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all Google Scholar ResearchGate Mastodon Dr Alireza Tamaddoni-Nezhad Reader (Associate Professor) in Machine Learning and Computational Intelligence BSc, MSc, DIC, PhD (Imperial College London), FHEA a.tamaddoni-nezhad@surrey.ac.uk hmlr-lab.github.ioAppointments via emailAcademic and research departments Surrey Institute for People-Centred Artificial Intelligence (PAI), Nature Inspired Computing and Engineering Research Group, Computer Science Research Centre, School of Computer Science and Electronic Engineering. AboutBiographyAlireza is a Reader (Associate Professor) in Machine Learning and Computational Intelligence at the School of Computer Science and Electronic Engineering. He joined the University of Surrey in 2017 as Lecturer and prior to this appointment, he was a Research Fellow at the Department of Computing, Imperial College London. He completed his PhD in Computer Science (Machine Learning) at Imperial College where he also worked as a Research Associate on several research projects applying Machine Learning to real-world problems from Biology, Medicine and Ecology. Alireza's principal research interests are in the areas of Explainable AI and Machine Learning, in particular Symbolic AI (e.g. Logic-based Machine Learning, Inductive Logic Programming (ILP), Meta-Interpretive Learning) and Hybrid-Symbolic AI (e.g. Probabilistic/Stochastic ILP, Genetic/Evolutionary and Neuro-ILP) and applications for Automated Scientific Discovery (e.g. machine learning of metabolic/trophic/microbial interaction networks) and Logic-based Vision and Robotics (e.g. one-shot logical vision, trustworthy autonomous systems). His current research also includes Sustainable AI, Few-Shot Learning, Neuro-Symbolic Vision, Adversarial Machine Learning, Two-Way Human-Machine Learning (aka Ultra-Strong Machine Learning), Human-Like Computing (HLC) and Cognitive AI. Alireza is Principal Investigator of multi-disciplinary EPSRC project on 'Human-machine learning of ambiguities to support safe, effective, and legal decision making'. He was Co-Investigator and Technical Director of the EPSRC NetworkPlus Grant on Human-Like Computing (HLC) to support the development of a UK-wide multi-disciplinary community of researchers within the EPSRC priority area of Human-Like Computing. He was also Co-Director of the Surrey Institute for People-Centred AI and currently leading the 'Trustworthy AI' and 'Sustainable AI' research themes at the AI Institute. He is also Deputy Chair of University Ethics Committee (UEC).Alireza's research group is specialised in the development and deployment of next-generation AI algorithms through the integration of learning, reasoning and human knowledge. Alireza has been collaborating with researchers within academia and industry and played a central role in developing several Machine Learning approaches for a range of applications in Data Science and Systems Biology (from genetic & metabolic networks to ecosystems). For example, his machine learning and text-mining approach for automated discovery & validation of probabilistic interaction networks from ecological data is regarded as the first successful application of machine learning from large-scale agricultural data. The results include novel food-web hypotheses, some confirmed by subsequent experimental studies (e.g. DNA analysis). Similarly, his work on machine learning of metabolic networks was regarded as the first successful application of machine learning for modeling inhibition in metabolic networks and the method developed in this project was used in studies by other researchers. The results of his research and the above mentioned collaborations have been published in Computer Science journals and proceedings (e.g. Machine Learning Journal) as well as high impact Biological and Ecological Journals (e.g. Advances in Ecological Research, IF=6.3; Trends in Ecology and Evolution, IF=16.7; and Nature Ecology & Evolution). He is currently Lead Guest Editor for Machine Learning Journal, Special Issue on Learning and Reasoning Expand biography We are looking for new PhD students and postdocs with interest and background in AI and Machine Learning. Please contact me for details.NEW Fully funded PhD studentship on \"Machine learning for establishing ecological networks in agricultural landscapes\" Expand about tab additional information ResearchResearch interestsMy main research contributions are in the area of Machine Learning, in particular the theory, implementations and real-world applications of Relational and Logic-based Machine Learning aka Inductive Logic Programming (ILP), and combinations of ILP with neural (inc. deep learning), probabilistic and stochastic approaches. My 4 most important research achievements to date are:A1. Developing a symbolic-probabilistic machine learning approach for automated discovery and validation of ecological / microbial interaction networks (selected output [13], selected recent output [1])   We have developed [13] a novel approach for automated discovery and validation of ecological interaction networks (e.g. food-webs) from ecological abundance data (e.g. census or DNA sequence data) using a combination of logic-based machine learning (which included human-encoded ecological/biological background knowledge) and text-mining from scientific publications (to corroborate and identify novel hypotheses). In an award-winning paper [49], we introduced a new probabilistic Abductive ILP method for approximating the probabilities of hypothetical trophic links. We evaluated this machine learning approach on large scale agricultural census data andmany of the machine-learned trophic links were corroborated by the literature [16]. In some cases, previously unobserved but high probability links were suggested by machine learning and subsequently confirmed by experimental studies (e.g. DNA analysis). These novel machine-learned food-webs have been the basis of several studies published in high impact scientific journals, including a joint study published [4] in Nature.  This machine learning approach was also the basis of several follow-up research grants including Next-Generation Biomonitoring (NGB) [3, 7, 8] where I was a CoI & UK Consortium Lead. As part of this project, we extended our learning approach for the discovery of microbial interaction networks [42, 38, 1]. Papers [13], [3], [16], [8] and [7] currently have 62, 82, 92, 121 and 200 citations respectively (as of 2024). Papers [38] also received Best Application Paper Award. Papers [4], [7] and [8] also achieved 4*/3*, 4*, 4* scores respectively in Annual Output Review (AOR). Paper [4] was submitted to REF 2021.A2. Contributing to development of Meta-Interpretive Learning (MIL) (selected output [11], selected recent output [31])  I  had the opportunity to contribute to the theory, implementation, and real-world applications of Meta-Interpretive Learning (MIL) and was co-author on the first publications introducing MIL [11, 12]. MIL has been applied in challenging problems, including grammatical inference, learning string transformations, learning robot strategies and Logical Vision (LV).  Due to its symbolic paradigm and background knowledge-guided mid-level features extraction, learning high-level visual concepts can be simply implemented by logic programming. Initial experiments conducted on learning simple shapes (e.g. regular polygons) suggested that this technique outperforms existing state-of-the-art object recognition methods. We also investigated [5] methods for extending these initial experiments to real-world images and videos, where our implementation of noise-tolerant MIL (i.e. MetagolNT) was used for one-shot learning from (noisy) images. The Stochastic Refinement approach [51] introduced in my PhD, was adapted for a Bayesian framework for MIL (i.e. MetaBayes) [48] which is shown to be useful in challenging problems such as learning from large scale textual data. MIL has also been used in experiments on human comprehensibility and ultra-strong machine learning [6]. It was also shown [12] that MIL can learn context-free grammars efficiently and accurately from a small number of examples (one-shot and few-shot learning). The original MIL framework introduced in [11, 12] has been adapted by other research groups, including researchers from Google DeepMind (Evans & Grefenstette, JAIR, 61:1-64, 2018). The number of citations for [11], [12], [6] and [5] are 279, 163, 129 and 39 respectively (as of 2024). Papers [11], [12], [5] and [6] also achieved 4 x 4*/3* in Annual Output Review (AOR). Paper [12] was submit",
  "content_length": 31430,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:47"
}