{
  "name": "Alireza Jolfaei",
  "homepage": "https://researchers.mq.edu.au/en/persons/alireza-jolfaei",
  "status": "success",
  "content": "Alireza Jolfaei - Macquarie University View Scopus Profile Alireza Jolfaei Dr Honorary Associate Professor, School of Computing https://orcid.org/0000-0001-7818-459X Phone+61 2 9850 9541Emailalireza.jolfaeimq.eduau 20102024 Research activity per year Personal profile BiographyAlireza Jolfaei received the Ph.D. degree in Applied Cryptography from Griffith University, Gold Coast, Australia. He is the Program Leader of Master of IT in Cyber Security in the School of Computing at Macquarie University, Sydney, Australia. Alireza has previously worked as an Assistant Professor at Federation University Australia and also at Temple University in Philadelphia, USA. His current research areas include Cyber and Cyber-Physical Systems Security. He has authored over 100 peer-reviewed articles on topics related to cybersecurity. He has received multiple awards for Academic Excellence, University Contribution, and Inclusion and Diversity Support. He received the prestigious IEEE Australian council award for his research paper published in the IEEE Transactions on Information Forensics and Security. He received a recognition diploma with a cash award from the IEEE Industrial Electronics Society for his publication at the 2019 IEEE IES International Conference on Industrial Technology. He is a founding member of the Federation University IEEE Student Branch. He served as the Chairman of the Computational Intelligence Society in the IEEE Victoria Section and also as the Chairman of Professional and Career Activities for the IEEE Queensland Section. He has served as the guest associate editor of IEEE journals and transactions, including the IEEE IoT Journal, IEEE Sensors Journal, IEEE Transactions on Industrial Applications, IEEE Transactions on Intelligent Transportation Systems, and IEEE Transactions on Emerging Topics in Computational Intelligence. He has served over 10 conferences in leadership capacities including program co-Chair, track Chair, session Chair, and Technical Program Committee member, including IEEE TrustCom and IEEE INFOCOM. He is a Senior Member of the IEEE and a Distinguished Speaker of the ACM on the topic of Cyber Security. Collaborators Alireza has research collaborations with peers from academia and industry on the topics of Smart Grid Security, Intelligent Transportation Systems Security, Privacy-Preserving Edge Computing, Trustworthy Machine Learning, and the Usable Security for Mixed Realities. Education/Academic qualificationApplied Cryptography, PhD, Robust encryption schemes for 3D content protection, Griffith UniversityJun 2012 → Jun 2016Award Date: 1 Jun 2016 Fingerprint Dive into the research topics where Alireza Jolfaei is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 8 Similar Profiles Internet-Of-Things Computer Science 100% Deep Learning Method Computer Science 52% image encryption Computer Science 49% Experimental Result Computer Science 45% Edge Computing Computer Science 39% Encryption Scheme Computer Science 35% Intelligent Transportation System Computer Science 33% Learning System Computer Science 28% View full fingerprint Projects Projects per year 2020 2020 2021 2025 2 Finished Projects per year MQ Industry LP: Intelligent Risk Assessment for Financial ServicesBeheshti, A. (Primary Chief Investigator), Wu, J. (Chief Investigator), Alinejad Rokny, H. (Chief Investigator), Zhang, X. (Chief Investigator), Jolfaei, A. (Chief Investigator), Wood, S. (Partner Investigator), Zhou, C. (Chief Investigator), Bu, D. (Chief Investigator) & Liao, Y. (Chief Investigator)25/06/21 → 1/07/25Project: Research AI-enabled Identity VerificationBeheshti, A. (Primary Chief Investigator), Hamey, L. (Chief Investigator), Jolfaei, A. (Chief Investigator) & Asadnia, M. (Chief Investigator)4/06/20 → 3/06/22Project: Research Research Outputs Research output per year 2010 2020 2021 2022 2024 126 Article 38 Conference proceeding contribution 5 Editorial 4 Chapter 3 More 1 Conference abstract 1 Review article 1 Other contribution Research output per year Research output per year On the silent perturbation of state estimation in smart gridJolfaei, A. & Kant, K., Jul 2020, In: IEEE Transactions on Industry Applications. 56, 4, p. 4405-4414 10 p.Research output: Contribution to journal › Article › peer-review Open AccessFile State Estimation 100% Smart Grid 100% Data Detection 40% Cyber Physical Systems 20% Linear Combination 20% 12 Citations (Scopus) 49 Downloads (Pure) A 3D object encryption scheme which maintains dimensional and spatial stabilityJolfaei, A., Wu, X.-W. & Muthukkumarasamy, V., Feb 2015, In: IEEE Transactions on Information Forensics and Security. 10, 2, p. 409-422 14 p.Research output: Contribution to journal › Article › peer-review Decryption 100% Statistical Analysis 100% Permutation 100% Widespread Application 100% Random Permutation 100% 26 Citations (Scopus) On the security of permutation-only image encryption schemesJolfaei, A., Wu, X. & Muthukkumarasamy, V., Feb 2016, In: IEEE Transactions on Information Forensics and Security. 11, 2, p. 235-246 12 p.Research output: Contribution to journal › Article › peer-review Encryption Scheme 100% Plaintext Attack 100% image encryption 100% Permutation 100% Cryptanalysis 60% 210 Citations (Scopus) A machine-learning-based approach to build zero-false-positive IPSs for industrial IoT and CPS with a case study on power grids securityHaghighi, M. S., Farivar, F. & Jolfaei, A., 2024, In: IEEE Transactions on Industry Applications. 60, 1, p. 920-928 9 p.Research output: Contribution to journal › Article › peer-review False Positive 100% Case Study 100% Firewall 100% Grid Security 100% Machine Learning-Based Approach 100% 18 Citations (Scopus) Attention-based graph summarization for large-scale information retrievalShabani, N., Beheshti, A., Jolfaei, A., Wu, J., Haghighi, V., Khanian Najafabadi, M. & Foo, J., Aug 2024, In: IEEE Transactions on Consumer Electronics. 70, 3, p. 6224-6235 12 p.Research output: Contribution to journal › Article › peer-review Information Retrieval 100% User Experience 50% Feature Extraction 25% Computational Efficiency 25% Information Retrieval Systems 25% 3 Citations (Scopus) View all 176 research outputs Prizes ACM MoMM 2020, Best Paper AwardGhafari, S. (Recipient), Beheshti, A. (Recipient), Joshi, A. (Recipient), Paris, C. (Recipient), Yakhchi, S. (Recipient), Jolfaei, A. (Recipient) & Orgun, M. (Recipient), 2020Prize Certificate of appreciation from the president of IEEE for my services and contributions to IEEEJolfaei, A. (Recipient), 2019Prize File Occupational Career 100% Territory 100% Artificial Intelligence 100% Northern Territory 100% Distinguished Speaker of the ACM on the topic of Cyber SecurityJolfaei, A. (Recipient), 2019Prize: Other distinction First runner-up paper award, International Workshop on AI-enabled Policing and Law Enforcement (AI-PLE) Workshop, IEEE EDOC Conference, 2021.Shojae Chaeikar, S. (Recipient), Jolfaei, A. (Recipient), Mohammad, N. (Recipient) & Ostovari, P. (Recipient), 25 Oct 2021Prize File People's choice award from the Sydney Water Innovation Festival, the Smart City Shark Tank, for an AI-enabled cyber protection for water quality monitoring systems. Jolfaei, A. (Recipient), 27 Oct 2021Prize File View all 7 prizes",
  "content_length": 7327,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:46"
}