{
  "name": "Alireza Tavakkoli",
  "homepage": "https://www.cse.unr.edu/~alit",
  "status": "success",
  "content": "﻿ Dr. Alireza Tavakkoli Dr. Alireza Tavakkoli © Dr. Alireza Tavakkoli All Rights Reserved. Go to the top Download My CV Alireza Tavakkoli Computer Science and Engineering Associate Professor of Computer Science Ph.D., University of Nevada, Reno (2009) M.Sc., University of Nevada, Reno (2006) M.Sc., Sharif University of Technology, Iran (2004) B.Sc., Sharif University of Technology, Iran (2001) My Affiliations: Computer Vision Intelligent Systems Integrative Neuroscience Research Overview My primary research interest is in Artificial Intelligence with an emphasis on Computer and Robot Vision, Visual Computing and Graphics, Modeling, and Animation. The main applications for my research activities focus on enhancing traditional fields of telerobotics, assistive technology, and intelligent environments by leveraging visual computing. I am generally interested in investigating the applications of basic imagery in conjunction with artificial intelligence tools to implement efficient communication frameworks for human-computer-robot interaction, interactive gaming, and virtual reality. Interested Students I am currently looking for motivated graduate students (both Masters and Doctoral levels) who are interested in the areas of my research. Please browse my research activities, projects, and publications, and contact me if you are interested in joining my research team. Projects Project 1 Details Project 2 Details Project 3 Details Project 4 Details Research Team PHD STUDENTS Sharif Kamran Ph.D. Candidate (August. 2019 - Present) Project Volumetric Analysis of Calcium Imaging Data Collaborator Dr. Sal Baker from the UNR School of Medicine Nasif Zaman Ph.D. Candidate (August. 2019 - Present) Project Perceptual Deficit Modeling and Compensation Collaborator Chenxing Wang Ph.D. Candidate (Aug. 2020 - Present) Project Multi-domain Anomaly Detection Collaborator Prithul Sarker A Ph.D. Student (August. 2020 - Present) Project Relative Afferent Pupilary Defect Collaborator Fariha Hossain Ph.D. Student (August. 2021 - Present) Project Concussion Detection Collaborator Chase Carten Ph.D. Student (Jan. 2022 - Present) Project Collaborator Dr. Frederick C. Harris, Jr. Gunner Stone Ph.D. Student (Jan. 2022 - Present) Project Collaborator Dr. Jonathan Greenber's GEARS Lab. Ryan Gorman Ph.D. Student (Jan. 2022 - Present) Project Collaborator MSc STUDENTS Current Sushmita Sarker M.Sc. Student (Aug. 2021 - Present) Project Visual Computing for Remote Sensing and Mining Collaborator Graduated Nasif Zaman M.Sc. Student (May 2021) Project Compensation for Neuronal Visual Loss using Extended Reality Collaborator Sharif Kamran M.Sc. Student (Dec. 2020) Project Deep Learning for Medical Image Computation Collaborator Dr. Sal Baker at the UNR School of Medicine. Lee Eason M.Sc. Student (May 2020) Project Visual Computing for Remote Sensing Collaborator Dr. Jonathan Greenber's GEARS Lab. Hafsah Humma Billah M.Sc. Student (May 2020) Project Concrete Damage Detection Collaborator UNDERGRADUATE STUDENTS Garu Situ Enzo Arata Sohail Ahmed Zachary McIlwain Publications 2022 2021 2020 2019 2018 Older Conference Paper Journal Article Book Chapter Book 2022 2021 2020 2019 2018 Older Books Journals Proceedings Chapters Teaching Current Older Overview My teaching is mainly focused on visual computing, interactive gaming, machine learning, and robotics. In the past, I have taught classes in parallel computing, computer architecture, and microprocessors. Current Courses CS 687/487 - Fundamentals of Deep Learning (Spring Semesters) Principles, design and implementation of deep learning systems. Topics include statistical machine learning, multi-layer perceptron (MLP) and neural networks, deep neural networks, optimization and learning, convolutional neural networks (CNN), CNN architectures, CNN applications in classification, detection, segmentation, and advanced topics in recurrent networks and generative adversarial networks (GAN). This course requires some basic programming skills and a very strong background in basic math and linear algebra. Enough background on the required mathematical theories and applications will be provided. CS 328 - Fundamentals of Game Design (Fall Semesters) Fundamental topics related to game design. Topics include: game design requirements, game design principles, evaluation, peer review, prototyping. This course requires some basic programming skills and a reasonable background in basic math and linear algebra. Enough background on the required mathematical theories and applications will be provided. Therefore, students should not have major problems understanding the content of the course as long as they follow the book, nd online reading materials. CS 685/485: Computer Vision (Spring 2019) Principles, design and implementation of vision systems. Camera models and image formation, feature detection, segmentation. Camera calibration, 3-D reconstruction, stereo vision. Computer Vision focuses on the development of a theoretic and algorithmic foundation by which useful information about the 3-D world can be automatically extracted and analyzed from a single image or a video sequence of images. Computer Vision systems have many potential applications. Robots who can understand what they see are more likely to interact with the real world in a satisfactory manner Vision methods can be used to track the trajectory of people and vehicles for traffic monitoring; they can help in the identification of faces for security applications; they can be used for obtaining 3-D models from images, with applications in architecture, medicine, virtual reality, or computer-aided design. Older Courses 2018 Advanced Level Design 2017 Automata and Formal Languages Parallel Programming Senior Projects in Gaming 2016 AI and Behavioral Modeling Advanced Level Design Gaming Networks Architecture Other Game Engines Architecture Multimedia Programming 3D Modeling Advanced Animation Internet Programming Fundamentals of Programmin I, II Calendar Show Calendar News Current News January 2020: I am currently looking for doctoral or masters students. August, 27, 2018: UNR Fall Semester Start. July 2018: I just joined the Computer Science and Engineering Department at the University of Nevada, Reno. Contact Have questions about my research or how to get involved? I am looking for motivated and intelligent graduate students. If you have any questions about my research or wish to join my team, please contact me. Dr. Alireza Tavakkoli 1664 North Virginia Street (M.S. 171) Reno, NV 89557 Office William Pennington Engineering Building 417 Phone 775-682-8426 Email tavakkol [at] unr [dot] edu",
  "content_length": 6665,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:47"
}