{
  "name": "Alireza Mousavi",
  "homepage": "https://www.brunel.ac.uk/people/ali-mousavi",
  "status": "success",
  "content": "Dr Alireza Mousavi | Introduction | Brunel University London Skip to Content Home People Dr Alireza Mousavi Dr Alireza MousaviProfessor Howell Building 231 Email: alireza.mousavi@brunel.ac.uk Tel: +44 (0)1895 265788 Personal Website Mechanical and Aerospace Engineering Mechanical and Aerospace Engineering College of Engineering, Design and Physical Sciences Summary Graduated as BEng with equivalent of first class from Tehran Azad University in Industrial Engineering, Planning and Analysis of Systems in 1994. I worked first as placement and then full time in Automotive Industry Management Consultancy from 1992-1996. In 1996 I joined the Postgraduate Research programme (PhD) of the well-known Department of Manufacturing and Engineering Systems of Brunel University with a scholarship from the University. I obtained my PhD in May 2000. In year October 1999, I was appointed as an RA on an EPSRC/MAFF project MEATRAC – where I developed a fully novel monitoring and control system using Sensors & Actuation, SCADA, PLC, RFID Technology, and Enterprise Data Management System for 100% Tracking and Traceability of Meat products. It was successfully delivered in mid-2002. From May 2002, I was appointed as a lecturer in the same department and to date have covered a wide range of teaching and supervising UG and PG projects in subject areas ranging from mathematics, software engineering, software development, systems modelling & probability theory, control, and embedded systems. The modules covered all undergraduate and postgraduate years, and taught in a highly international and diverse cohort of students. I contribute to a wide range of classical (e.g. mathematics, probability theory, queuing theory, discrete systems, software development) and modern subjects (e.g. Machine Learning, AI, Applied Control, and Cyberphyisical systems) at the Departments of Computer Science, Electronic and Electrical Engineering as well as Department of Mechanical & Aerospace Engineering with the College of Engineering, Design and Physical Sciences. My current research activities are concentrated on digital transformation and smartification of Industrial Systems, especially within the Industry 4.0 context covering sensors-actuation, signal processing and feature extraction, machine learning, modelling, control and optimisation. Systems Engineering in a wide range of applications and industrial challenges. Since 2013, my research activities has resulted in large number of large scale research and development funding from UK, EU and USA funding bodies and industry. They are in the areas of Intelligent Manufacturing Systems, Water and Wastewater Treatment Systems, BioFuel Technologies, Aeropsace, Automotive, Electronics and Micro-electronics Security and Manufacture, Photonics, Laser-Based Manufacturing, Process Engineering, Tracking & Traceability, Sustanable Supply Chains, as well as Airport Security and Management Systems.  Some sample list of projects can be viewed in my personal site http://www.brunel.ac.uk/~emstaam/. I am the Founder and Co-Director of Brunel Centre for Digital Manufacturing. For details activities and projects of the centre please visit: https://www.brunel.ac.uk/research/Centres/Digital-Manufacturing For complete list of publications and other information please visit my website: http://www.brunel.ac.uk/~emstaam/ Special Announcement: We are Constantly looking to recruite Research Assistants, Fellows and PhD students in the areas of Automation, Control, Sensors and Actuation, Mathematical Modelling and Optimisation, Machine Learning & AI, and Software Engineering (contact me for details) Newest selected publications Mirzarazi, F., Danishvar, S. and Mousavi, A. (2024) 'The Safety Risks of AI-Driven Solutions in Autonomous Road Vehicles'. World Electric Vehicle Journal, 15 (10). pp. 1 - 19.Open Access Link Journal article Markatos, NG., Mousavi, A., Katsou, E., Pippione, G. and Paoletti, R. (2024) 'Feature Selection to address High-Dimensionality in Industry 4.0 Multi-emitter Laser Modules Assembly Lines'. IEEE Intelligent Systems, 0 (early access). pp. 1 - 12. ISSN: 1541-1672 Open Access Link Journal article Starodubov, D., Danishvar, S., Abu Ebayyeh, AARM. and Mousavi, A. (2024) 'Advancements in PCB Components Recognition Using WaferCaps: A Data Fusion and Deep Learning Approach'. Electronics, 13 (10). pp. 1 - 18. ISSN: 1450-5843 Open Access Link Journal article Geng, H., Mousavi, A., Markatos, N., Chen, K. and Gou, X. (2024) 'Reliable Cost Prediction and Control for Intelligent Manufacture: A Key Performance Indicator Perspective'. International Journal of Network Dynamics and Intelligence, 3 (1). pp. 1 - 12.Open Access Link Journal article Milosavljevic, M., Mousavi, A., Moraca, S., Fajsi, A. and Rostohar, D. (2024) 'Revealing the Supply Chain 4.0 Potential within the European Automotive Industry'. Sustainability, 16 (4). pp. 1 - 17.Open Access Link Journal article More publications(72)",
  "content_length": 4967,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:46"
}