{
  "name": "Alistair Sinclair",
  "homepage": "http://www.cs.berkeley.edu/~sinclair",
  "status": "success",
  "content": "Alistair Sinclair's Home Page Alistair Sinclair, Professor Contents: Research interests / Publications / Current and former graduate students / Contact information About me I am Kikuo Ogawa and Kaoru Ogawa Professor of Computer Science in the Department of EECS at UC Berkeley. From 2012 to 2017 I was Founding Associate Director of the Simons Institute for the Theory of Computing. Research interests Design and analysis of algorithms, especially randomized ones Monte Carlo methods and phase transitions in statistical physics Analysis and algorithmic applications of stochastic processes Nonlinear dynamical systems Combinatorial optimization Some recent (and not so recent) papers Diversity in evolutionary dynamics Yuval Rabani, Leonard Schulman and Alistair Sinclair. Extended Abstract in Innovations in Theoretical Computer Science (ITCS) 2025. Full version available on [arXiv] Nonlinear dynamics for the Ising model Pietro Caputo and Alistair Sinclair. Communications in Mathematical Physics 405, Article 260 (2024). Preliminary version appeared in Proceedings of ACM STOC, 2024, pp. 515-526. [arXiv] Spatial mixing and the random-cluster dynamics on lattices Reza Gheissari and Alistair Sinclair. Random Structures & Algorithms 64 (2024), pp. 490-534. Preliminary version appeared in Proceedings of ACM-SIAM SODA, 2023, pp. 4606-4621. [arXiv] Low-temperature Ising dynamics with random initializations Reza Gheissari and Alistair Sinclair. Annals of Applied Probability 33 (2023), pp. 3916-3957. Preliminary version appeared in Proceedings of ACM STOC, 2022, pp. 1445-1458. [arXiv] The critical mean-field Chayes-Machta dynamics Antonio Blanca, Alistair Sinclair and Xusheng Zhang. Combinatorics, Probability and Computing, published online, May 2022. Preliminary version appeared in Proceedings of RANDOM 2021. [arXiv] Entropy decay in the Swendsen-Wang dynamics on Z^d Antonio Blanca, Pietro Caputo, Daniel Parisi, Alistair Sinclair and Eric Vigoda. Annals of Applied Probability 32 (2022), pp. 1018-1057. Preliminary version in Proceedings of ACM STOC 2021, pp. 1551-1564. [arXiv] Correlation decay and partition function zeros: Algorithms and phase transitions Jingcheng Liu, Alistair Sinclair and Piyush Srivastava. SIAM Journal on Computing, Invited Special Issue for IEEE FOCS 2019. [Substantially modified and expanded version of the FOCS version below.] [arXiv] A deterministic algorithm for counting colorings with 2Δ colors Jingcheng Liu, Alistair Sinclair and Piyush Srivastava. Proceedings of IEEE FOCS 2019, pp. 1380-1404>. [arXiv] Efficiently list-edge coloring multigraphs asymptotically optimally Fotis Iliopoulos and Alistair Sinclair. Random Structures & Algorithms 61 (2022), pp. 724-753. Preliminary version appeared in Proceedings of ACM/SIAM SODA 2020, pp. 2319-2336. [arXiv] Beyond the Lovasz Local Lemma: Point to set correlations and their algorithmic applications Dimitris Achlioptas, Fotis Iliopoulos and Alistair Sinclair. Proceedings of IEEE FOCS 2019, pp. 725-744. [arXiv] Fisher zeros and correlation decay in the Ising model Jingcheng Liu, Alistair Sinclair and Piyush Srivastava. Journal of Mathematical Physics 60 (2019). Extended abstract appeared in Proceedings of ITCS 2019. [arXiv] The Ising partition function: zeros and deterministic approximation Jingcheng Liu, Alistair Sinclair and Piyush Srivastava. Journal of Statistical Physics 174 (2019), pp. 287-315. Preliminary version appeared in Proceedings of IEEE FOCS 2017. [arXiv] Spatial mixing and non-local Markov chains Antonio Blanca, Pietro Caputo, Alistair Sinclair and Eric Vigoda. Random Structures and Algorithms 55 (2019), pp. 584-614. Preliminary version appeared in Proceedings of ACM-SIAM SODA 2018. [arXiv] Entropy production in nonlinear recombination models Pietro Caputo and Alistair Sinclair. Bernoulli 24 (2018), pp. 3246-3282. [arXiv] Analysis of a classical matrix preconditioning algorithm Leonard Schulman and Alistair Sinclair. Journal of the ACM 64 (2017), article #9. Preliminary version appeared in Proceedings of ACM STOC 2015, pp. 831-840. [arXiv] Dynamics of lattice triangulations on thin rectangles Pietro Caputo, Fabio Martinelli, Alistair Sinclair and Alexandre Stauffer. Electronic Journal of Probability 21 #29 (2016). Random-cluster dynamics in Z^2 Antonio Blanca and Alistair Sinclair. Probability Theory and Related Fields 168 (2017), pp. 821-847. Preliminary version appeared in Proceedings of ACM-SIAM SODA 2016, pp. 498-513. [arXiv] Spatial mixing and the connective constant: Optimal bounds Alistair Sinclair, Piyush Srivastava, Daniel Stefankovic and Yitong Yin. Probability Theory and Related Fields 168 (2017), pp. 153-197. Preliminary version appeared in Proceedings of ACM-SIAM SODA 2015, pp. 1549-1563. [arXiv] Symbolic integration and the complexity of computing averages Leonard Schulman, Alistair Sinclair and Piyush Srivastava. Proceedings of IEEE FOCS 2015, pp. 1231-1245. Dynamics for the mean-field random-cluster model Antonio Blanca and Alistair Sinclair. Proceedings of RANDOM 2015, pp. 528-543. [arXiv] Spatial mixing and approximation algorithms for graphs with bounded connective constant Alistair Sinclair, Piyush Srivastava and Yitong Yin. Proceedings of IEEE FOCS 2013, pp. 300-309. [arXiv] Lee-Yang theorems and the complexity of computing averages Alistair Sinclair and Piyush Srivastava. Communications in Mathematical Physics 329 (2014), pp. 827-858. Preliminary version appeared in Proceedings of ACM STOC 2013, pp. 625-634. [arXiv] Random lattice triangulations: Structure and algorithms Pietro Caputo, Fabio Martinelli, Alistair Sinclair and Alexandre Stauffer. Annals of Applied Probability 25 (2015), pp. 1650-1685. Preliminary version appeared in Proceedings of ACM STOC 2013, pp. 615-624. [arXiv] Approximation algorithms for two-state antiferromagnetic spin systems on bounded degree graphs Alistair Sinclair, Piyush Srivastava and Marc Thurley. Journal of Statistical Physics 155 (2014), pp. 666-686. Preliminary version appeared in Proceedings of ACM-SIAM SODA 2012, pp. 941-953. [arXiv] Almost settling the hardness of noncommutative determinant Steve Chien, Prahladh Harsha, Alistair Sinclair and Srikanth Srinivasan. Proceedings of ACM STOC 2011, pp. 499-508. [arXiv] Mobile geometric graphs: Detection, coverage and percolation Yuval Peres, Alistair Sinclair, Perla Sousi and Alexandre Stauffer. Probability Theory and Related Fields 156 (2013), pp. 273-305. Preliminary version appeared in Proceedings of ACM-SIAM SODA 2011, pp. 412-428. [arXiv] Liftings of tree-structured Markov chains Tom Hayes and Alistair Sinclair. Proceedings of APPROX/RANDOM 2010, pp. 602-616. Delaying satisfiability for random 2SAT Alistair Sinclair and Dan Vilenchik. Random Structures & Algorithms 43 (2013), pp. 251-263. Preliminary version appeared in Proceedings of APPROX/RANDOM 2010, pp. 710-723. Mixing time for the Solid-on-Solid model Fabio Martinelli and Alistair Sinclair. Annals of Applied Probability 22 (2012), pp. 1136-1166. Preliminary version appeared in Proceedings of ACM STOC 2009, pp. 571-580. [arXiv] Sherali-Adams relaxations of the matching polytope Claire Mathieu and Alistair Sinclair. Proceedings of ACM STOC 2009, pp. 293-302. Strong and Pareto price of anarchy in congestion games Steve Chien and Alistair Sinclair. Proceedings of ICALP 2009, pp. 279-291. The extended k-tree algorithm Lorenz Minder and Alistair Sinclair. Journal of Cryptology 25 (2012), pp. 349-382. Preliminary version appeared in Proceedings of ACM-SIAM SODA 2009, pp. 586-595. Convergence to approximate Nash equilibria in congestion games Steve Chien and Alistair Sinclair. Games & Economic Behavior 71 (2011), pp. 315-327. Preliminary version appeared in Proceedings of ACM-SIAM SODA 2007, pp. 169-178. Low distortion maps between point sets Claire Kenyon, Yuval Rabani and Alistair Sinclair. SIAM Journal on Computing 39 (2009), pp.1617-1636. Preliminary version in Proceedings of ACM STOC 2004, pp. 272-280. On the satisfiability threshold and clustering of solutions of random 3-SAT formulas Elitza Maneva and Alistair Sinclair. Theoretical Computer Science 407 (2008), pp. 259-369. Algebras with polynomial identities and computing the determinant Steve Chien and Alistair Sinclair. Full version appeared in SIAM Journal on Computing 37 (2007), pp. 252-266. Preliminary version appeared in Proceedings of IEEE FOCS 2004, pp. 352-361. A general lower bound for mixing of single site dynamics on graphs Tom Hayes and Alistair Sinclair. Annals of Applied Probability 17 (2007), pp. 931-952. Preliminary version appeared in Proceedings of IEEE FOCS 2005, pp. 511-520. Fast mixing for independent sets, colorings and other models on trees Fabio Martinelli, Alistair Sinclair and Dror Weitz. Slightly revised version appeared in Random Structures & Algorithms 31 (2007), pp. 134-172. Extended abstract appeared in Proceedings of ACM-SIAM SODA 2004, pp. 449-458. Negative examples for sequential importance sampling of binary contingency tables Ivona Bezáková, Alistair Sinclair, Daniel Štefankovič and Eric Vigoda. Algorithmica 64 (2012), pp. 606-620. Preliminary version in Proceedings of European Symposium on Algorithms (ESA), 2006, pp. 136-147. Quasisymmetric embeddings, the observable diameter, and expansion properties of graphs Assaf Naor, Yuval Rabani and Alistair Sinclair. Journal of Functional Analysis 227 (2005), pp. 273-303. Shuffling by semi-random transpositions Elchanan Mossel, Yuval Peres and Alistair Sinclair. Mathematics arXiv math.PR/0404438 (April 2004). Conference version appeared in IEEE FOCS 2004, pp. 572-581. The Ising model on trees: Boundary conditions and mixing time Fabio Martinelli, Alistair Sinclair and Dror Weitz. Technical Report UCB//CSD-03-1256, UC Berkeley, July 2003. (Extended abstract appeared in Proceedings of FOCS 2003. Slightly modified version appeared in Communications in Mathematical Physics 250 (2004), pp. 301-334.) Embedding k-Outerplanar Graphs into l_1 Chandra Chekuri, Anupa",
  "content_length": 14792,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:52"
}