{
  "name": "Alistair Baron",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/alistair-baron",
  "status": "success",
  "content": "Alistair Baron - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Dr Alistair Baron FHEA Senior Lecturer Research Overview My primary research areas are Natural Language Processing (NLP) and Cyber Security, with a particular focus on developing solutions to the problems associated with the vast amounts of textual data in online settings; for example, deception and multiple personae detection techniques to assist in countering the use of fake profiles for nefarious purposes. The noisy characteristics of online texts, e.g. the abundance of irregular language and its multi-lingual nature, pose significant barriers to many NLP methods. A primary aim of my research is to build robust NLP tools which are able to cope with, and take advantage of, these features. Relatedly, I am interested in developing machine learning techniques and other technologies which assist users in making informed decisions, such as for forensic investigations, or for crisis management. Show more… Career Details Academic Qualifications: Ph.D. Computer Science (Lancaster University, UK) B.Sc. (Hons) Computer Science (Lancaster University, UK) Employment: Lecturer, Lancaster University, 2016 - present Faculty Research Fellow, Lancaster University, 2012 - 2016 Research Assistant, Lancaster University, 2009 - 2012 Profile Dr. Alistair Baron is a lecturer in the School of Computing and Communications. His research and teaching are in the area of Data Science and Cyber Security. He has previously held several research posts on a variety of projects in the areas of natural language processing (dealing with noisy unstructured text, content analysis, text classification and machine learning) and security (online child protection and the language of extremism). He was a Security Lancaster Research Fellow, in which he conducted research involving using NLP techniques in a cyber-security setting, bringing cutting-edge NLP research into real-word security applications. His lectureship continues this research, primarily focused on developing solutions for problems associated with online communities (bulletin boards, forums), social networks (Facebook, Twitter) and instant messaging services (Skype, MSN), and developing techniques which assist users in making informed decisions, such as for forensic investigations, or for crisis management. Current Teaching Applied Data Mining (SCC.413) My Role Director of Studies (PGR), School of Computing and Communications PhD Supervision Interests Natural Language Processing, Authorship analysis, Spelling Variation Show less Publications Projects Activities Research Groups Selected Publications Show all 47 publications Who am I? Analysing Digital Personas in Cybercrime InvestigationsRashid, A., Baron, A., Rayson, P., May-Chahal, C., Greenwood, P., Walkerdine, J. 04/2013 In: Computer. 46, 4, p. 54-61. 8 p.Journal article Children Online: A survey of child language and CMC corporaBaron, A., Rayson, P., Greenwood, P., Walkerdine, J., Rashid, A. 2012 In: International Journal of Corpus Linguistics. 17, 4, p. 443-481. 39 p.Journal article \"i didn't spel that wrong did i. Oops\": Analysis and normalisation of SMS spelling variationTagg, C., Baron, A., Rayson, P. 2012 In: Lingvisticæ Investigationes. 35, 2, p. 367-388. 22 p.Journal article Word frequency and key word statistics in corpus linguisticsBaron, A., Rayson, P., Archer, D. 2009 In: Anglistik. 20, 1, p. 41-67. 27 p.Journal article Technological solutions to offendingRashid, A., Greenwood, P., Walkerdine, J., Baron, A., Rayson, P. 03/2012 In: Understanding and preventing online sexual exploitation of children. London : Willan p. 228-243. ISBN: 978-0415689410.Chapter (peer-reviewed) Fool’s Errand: Looking at April Fools Hoaxes as Disinformation through the Lens of Deception and HumourDearden, E., Baron, A. 7/04/2019Conference paper A time-sensitive historical thesaurus-based semantic tagger for deep semantic annotationPiao, S.S., Dallachy, F., Baron, A., Demmen, J.E., Wattam, S., Durkin, P., McCracken, J., Rayson, P.E., Alexander, M. 11/2017 In: Computer Speech and Language. 46, p. 113-135. 23 p.Journal article Panning for gold: automatically analysing online social engineering attack surfacesEdwards, M., Larson, R., Green, B., Rashid, A., Baron, A. 08/2017 In: Computers and Security. 69, p. 18-34. 17 p.Journal article The simulated security assessment ecosystem: Does penetration testing need standardisation?Knowles, W., Baron, A., McGarr, T. 09/2016 In: Computers and Security. 62, p. 296-316. 21 p.Journal article All Publications Show only selected publications Native Language Influence Detection 6 Project 23/11/2015 → 31/10/2018 Research Early Detection of Insider Threats by Autonomous Analysis of User Behaviour Evolution 21/07/2015 → 20/01/2019 Research Early Detection of Insider Threats by Autonomous Analysis of User Behaviour Evolution 01/10/2014 → 31/03/2018 Other Semantic Annotation and Mark Up for Enhancing Lexical Searches (SAMUELS) 01/01/2014 → 31/03/2015 Research Corpus Research in Early Modern English 01/10/2011 → … Research School of Computing and Communications Postgraduate Research Conference 2019 Types of Public engagement and outreach - Festival/Exhibition IEEE Transactions on Information Forensics and Security (Journal) Publication peer-review Spelling variation: problems analysis solutions Invited talk Using linguistic features to predict age and gender with fake online personas Invited talk Corpus Linguistics 2015 Participation in conference -Mixed Audience The Web of Lies: deception and fake identities on- and offline Public Lecture/ Debate/Seminar Using language analysis to predict age and gender with fake online personas Invited talk Using language cues to see through (fake) online personas Invited talk Using language cues to see through online personas Invited talk Journal of Internet Services and Applications (Journal) Publication peer-review Using language cues to see through online personas Invited talk Journal of Information Security and Applications (Journal) Publication peer-review Multimedia Systems (Journal) Publication peer-review CRESTx Lancaster Participation in conference -Mixed Audience Language Resources and Evaluation (Journal) Publication peer-review Corpus Linguistics 2013 Participation in conference -Mixed Audience Corpora (Journal) Publication peer-review VARD 2, DICER, historical spelling variation and modern ‘noisy’ data Invited talk UCREL Corpus Research Seminar Participation in workshop, seminar, course Research visit Invited talk Word frequency and key word statistics in historical corpus linguistics Invited talk Faculty of Science and Technology Research Fellowship (Security Lancaster) Fellowship awarded competitively Cyber Security Research Centre (Data) DSI - Foundations SCC (Data Science) Security Lancaster Security Lancaster (Academic Centre of Excellence) Security Lancaster (Secure Machine Learning and Intelligence) Security Lancaster (Systems Security) UCREL - University Centre for Computer Corpus Research on Language Back to listing Contact Details Department: Computing and Communications Office: C34, C - Floor, InfoLab21 TelTelephone: +44 (0)1524 510037 enable JavaScript to view email address Back to listing",
  "content_length": 7492,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:48"
}