{
  "name": "Alisha Pradhan",
  "homepage": "https://www.alishapradhan.net",
  "status": "success",
  "content": "Alisha PradhanSearch this siteEmbedded FilesSkip to main contentSkip to navigationEmail: alisha.pradhan[at] njit [dot]eduLinkedin | Twitter | Google ScholarI am an Assistant Professor in the Department of Informatics in the Ying Wu College of Computing at the New Jersey Institute of Technology. My research in Human-Computer Interaction (HCI) examines inclusive and responsible design of technology for and with underrepresented populations. Adopting human-centered approaches, we explore how technologies can better support and represent people of diverse ages and abilities. My research has been published at top-tier HCI venues including ACM CHI, CSCW, DIS, and TOCHI and recognized with best paper and honorable mention awards. It is supported by the National Science Foundation and VentureWell. I received my Ph.D. from University of Maryland, College Park.  Before joining NJIT, I was a user experience researcher in the Central Social Impact team at Meta Platforms, Inc. I have a Masters in HCI from University of Maryland, College Park and Bachelors in Industrial Design from National Institute of Technology, Rourkela, (India).NewsOctober 2025- Our work on Age-Bias and Stereotypes of Aging in LLMs, led by undergraduate student Sherwin Dewan, was accepted to ACM ASSETS 2025.October 2025-  Our latest CSCW work explores ethical considerations on design of anthropomorphic conversational UIs—from co-designing voice assistants with older adults to analyzing how LLM anthropomorphic traits intersect with fairness (led by my student Neel Iyer).October 2025 - Led by my student, Neel Iyer, our work on Examining and Mitigating Ability-bias in LLMs via Self-Reflection, presented at ACM Web for All (W4A'25) is now online! June 2025 - Congratulations to my student Ramprabu Thangaraj on his accepted paper at ACM DIS 2025 on understanding older adults' end-of-life data planning preferences. February 2025 - Accepted paper at ACM CHI 2025 on understanding older adults' (dis)engagement with design materials.January 2025 - Received NSF support to investigate design of future proofing technologies that can adapt to changing abilities of people with dementia over time.November 2024 - I gave a talk on how emerging AI technologies exclude older adults at the AAAI AI for Aging in Place Symposium.August 2024 -  Associate chair for CHI 2025- Accessibility and Aging.May 2024 - Technical program committee member for ASSETS 2024April 2024 -  Our work on sustaining an older adult-led makerspace was accepted at CSCW 2024.Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2574,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:48"
}