{
  "name": "Alison M. Hill",
  "homepage": "http://www.ohsu.edu/xd/education/schools/school-of-medicine/departments/basic-science-departments/csee/csee-people/hill.cfm",
  "status": "success",
  "content": "DMICE Research | OHSU Division of Informatics, Clinical Epidemiology and Translational Data Science Division of Informatics, Clinical Epidemiology and Translational Data Science As Oregon’s only academic medical school, OHSU has breakthrough research that leads to new cures, new standards of care, and a better understanding of health and the biomedical sciences. Students have the opportunity to collaborate with faculty researchers who are exploring basic, clinical and applied research frontiers throughout the biomedical, clinical epidemiology and information sciences fields. Our primary research areas focus on Clinical Informatics, Bioinformatics & Computational Biology, and Clinical Epidemiology. Health & Clinical Informatics Health and clinical informatics transforms medicine and health care by analyzing, designing, implementing, and evaluating systems and interventions to improve patient care, enhance access to care, advance individual and population health outcomes, and strengthen the clinician-patient relationship. Professionals in health and clinical informatics occupy a wide variety of positions in health care, research, government, and other institutions, where they use data and information to improve individual health, health care delivery, public health, and biomedical research. More about Health and Clinical Informatics Research Bioinformatics & Computational Biomedicine Bioinformatics is the application of informatics in cellular and molecular biology, often with a focus on genomics. The sub-term translational bioinformatics is used to describe bioinformatics applied to human health. More about Bioinformatics and Computational Biomedicine Research Clinical Epidemiology Clinical epidemiology is the study of the patterns, causes, and effects of health and disease in patient populations and the relationships between exposures or treatments and health outcomes.  Areas of research include disease screening and prevention, systematic review methodology, comparative effectiveness research, developing evidence-based practice and policy guidelines, implementation of practices and guidelines in health systems, development of patient-centered registries and data marts within health information systems, creating and testing patient decision aids, and using patient data for quality improvement and research projects. More about Clinical Epidemiology Research Cross-Area Research Activities DMICE has many ongoing research projects and activities. Those focused in the three main areas of the departments are described on their respective pages. Some projects, however, span across multiple areas of the department: Oregon Clinical & Translational Research Institute Cynthia Morris, Shannon McWeeney, Aaron Cohen DMICE faculty play a variety of roles in OCTRI, which was established in 2006 as now one of 58 academic health centers awarded a Clinical and Translational Science Award (CTSA) from the National Institutes of Health. OHSU was one of the first 12 CTSA awards in 2006. OCTRI focuses its energy and resources on building clinical and translational research at Oregon Health &Science University and regional communities, government, and industry. Funder: National Center for Advancing Translational, National Institutes of Health",
  "content_length": 3277,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:49"
}