{
  "name": "Alkida Balliu",
  "homepage": "https://alkida.net",
  "status": "success",
  "content": "Alkida Balliu Skip to content Associate Professor at Gran Sasso Science Institute (GSSI), L’Aquila, Italy. In 2020–2021 I was a Postdoctoral Researcher in the Algorithms and Complexity group headed by Prof. Fabian Kuhn, at the University of Freiburg, Germany. In 2018–2019 I was a Postdoctoral Researcher in the Distributed Algorithms group headed by Prof. Jukka Suomela, at  Aalto University, Finland. I obtained my PhD in 2017 at Gran Sasso Science Institute (GSSI) under the supervision of Prof. Pierre Fraigniaud. I am interested in several aspects of theoretical computer science, and in particular in the theory of distributed computing. E-mail: Awards FOCS 2019 Best Paper Award Lower bounds for maximal matchings and maximal independent sets, with Sebastian Brandt, Juho Hirvonen, Dennis Olivetti, Mikaël Rabie, and Jukka Suomela DISC 2023 Best Paper Award On the Node-Averaged Complexity of Locally Checkable Problems on Trees, with Sebastian Brandt, Fabian Kuhn, Dennis Olivetti, and Gustav Schmid News New manuscript: New Hardness Results for the LOCAL Model via a Simple Self-Reduction, A. Balliu, F. Casagrande, F. d’Amore, and D. Olivetti I will serve as a PC member of ICALP 2026 Our paper New Limits on Distributed Quantum Advantage: Dequantizing Linear Programs, with C. Coupette, A. Cruciani, F. d’Amore, M. Equi, H. Lievonen, A. Modanese, D. Olivetti, and J. Suomela, will appear in DISC 2025 Our paper Local Advice and Local Decompression, with S. Brandt, F. Kuhn, K. Nowicki, D. Olivetti, E. Rotenberg, and J. Suomela, will appear in DISC 2025 Our paper Towards Fully Automatic Distributed Lower Bounds, with S. Brandt, F. Kuhn, D. Olivetti, and J. Saarhelo, will appear in DISC 2025 Our paper Distributed Quantum Advantage in Locally Checkable Labeling Problems, with F. Casagrande, F. d’Amore, M. Equi, B. Keller, H. Lievonen, D. Olivetti, G. Schmid, and J. Suomela, will appear in SODA 2026 Our paper On the Universality of Round Elimination Fixed Points, with S. Brandt, O. Gabsdil, D. Olivetti, and J. Suomela, will appear in SODA 2026",
  "content_length": 2061,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:51"
}