{
  "name": "Allison Lahnala",
  "homepage": "https://allielahnala.com",
  "status": "success",
  "content": "McMaster University Hamilton, ON I’m an interdisciplinary researcher working at the intersection of natural language processing (NLP), computational social science, and psychology. My research focuses on modeling social, goal-oriented conversations, with a particular emphasis on empathetic interaction, persuasion, and the dynamics of conversational support. I’m especially interested in developing efficient methods to integrate insights from the social sciences into robust, personalized machine learning applications. I work with various domains and contexts, such as online forums for supportive and opinionated interactions, and clinical conversations, in which I investigate stance dynamics and empathetic interactions, and transfer learning to better model social NLP tasks. I am also interested in developing theory-driven empathy research approaches for NLP that consider the complex affective and cognitive processes and social factors that influence empathetic expression and perception. My academic path has taken me from studying computer science at the University of Michigan to completing a PhD in Informatik at the University of Bonn, with research experiences in both Germany and the U.S. Before joining McMaster in July 2025, I was a postdoctoral fellow in Baltimore, MD at the National Institute on Drug Abuse (National Institutes of Health), where I studied digital phenotyping and substance use. At McMaster, I plan to build a research program that brings together language technology, health communication, and digital mental health. Alongside research, I’ve been involved in mentorship and interdisciplinary collaboration across computing, psychology, and public health. My teaching experience includes courses and workshops on AI ethics and social NLP, as well as outreach programs aimed at broadening participation in computing. news Aug 20, 2025 Our paper “The Practical Impacts of Theoretical Constructs on Empathy Modeling” was accepted to the EMNLP 2025 main conference! Jul 1, 2025 I have started as an Assistant Professor in the department of Computer and Software at McMaster University, Hamilton, ON. I will be accepting graduate students! Jun 23, 2025 Our paper “Unifying the Extremes: Developing a Unified Model for Detecting and Predicting Extremist Traits and Radicalization” is at ICWSM 2025. Many thanks to our friend Julia Mendelssohn for presenting it on our behalf! May 3, 2025 Our paper “Linking Language-based Distortion Detection to Mental Health Outcomes” led by Vasudha Varadarajan is at CLPsych 2025! Feb 25, 2025 Our paper “The Illusion of Empathy: How AI Chatbots Shape Conversation Perception” led by Tingting Liu is at AAAI 2025!",
  "content_length": 2682,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:59"
}