{
  "name": "Allison K. Sullivan",
  "homepage": "https://allisonius.github.io",
  "status": "success",
  "content": "Allison K. Sullivan, PhD Allison K. Sullivan, PhD | Allison Sullivan assistant professor at UT Arlington website Allison Sullivan, PhDAssistant Professor of Computer Science Follow ERB 529 UT Arlington Email Google Scholar dblp About meI am an Assistant Professor of Computer Science and the Undergraduate Software Engineering Program Director at The University of Texas at Arlington (UTA), a member of the Software Engineering Research Center (SERC) at UTA and the faculty advisor for UTA’s SWE club. I am a recipient of the NSF CAREER Award (2024), the UTA CSE department Rising Star Research Award (2024) and UTA College of Engineering Outstanding Early Career Faculty Award (2025). Here is my current CV.I obtained my PhD in the Software Verification, Validation and Testing (SVVAT) group at the University of Texas at Austin (hook’em) in 2017. My adviser is Sarfraz Khurshid. I obtained my M.S. degree in software engineering at UT Austin in 2014 and my B.S. degree in software engineering from The University of Texas at Dallas in 2012 (whoosh). My PhD dissertation can be found here.Currently, I am lead professor of SCOPE lab which focuses on improving techniques to show the correctness of all program executions. You can explore our projects and see the types of things SCOPE lab gets up too.I was a speaker at NSF’s CISE Career Workshop 2024 along with 3 other past CAREER NSF recipients - our talks, slides and an overleaf template are posted online. Best of luck to all future PIs applying for the CAREER NSF - I hope our experiences are helpful!! Please reach out if you have any questions with “NSF CAREER Inquiry” in the title. Research InterestMy main goal is to improve software reliability by focusing on:Automated Software Engineering: Test/Oracle Generation, Automated Bug Localization and Repair, Mutation Testing, and Regression TestingFormal Methods and Programming Languages: Abstractions, Finite Model Finders, Program Synthesis, and SAT/SMT SolversUpcoming Service: FormaliSE 2026 (PC Member), ISSTA 2026 (PC Member), ISSRE 2026 (Organizing Committee). News.November 2025: Initiated into Upsilon Pi Epsilon.November 2025: Panelist at Dallas College SWE’s Women Engineers Panel.October 2025: Our CRA REUs received additional supplements from UTA’s College of Engineering. Congrats Talia and Marcee!September 2025: Two REUs supported by CRA’s UR2PhD program. Congrats Talia and Marcee!September 2025: Honored to be recongized in Arlington’s 40 under 40 class of 2025!September 2025: Attended our Dagstuhl Seminar “Specification Engineering: Foundations for the Future of Software Development”.August 2025: I am the Undergraduate Software Engineering Program Director for the Software Engineering major at UTA.August 2025: I have received a NSF grant to work on building an interactive tool that aims to ease the burden of learning software modeling. Total: 400kApril 2025: Welcomed baby#2 to the world!!April 2025: Recipient of the UTA College of Engineering “Outstanding Early Career Faculty” AwardMarch 2025: My second PhD student defended her dissertation. Congratulations to Dr. Anahita Samadi! She will start a Post-Doc at UT Southwestern in May with Dr. Florence Chiang.February 2025: One REU project “Automated Verification of Historical Map Translations into Vector-Based GIS Data” got selected for departmental support. Thank you CSE@UTA! And congrats Talia!Janurary 2025: One paper accepted in FormaliSE 2025. Congratulations Ana and Mohammad!December 2024: One paper accepted in LLM4Code 2025. Congratulations Sanyogita and Anahita!November 2024: My first PhD student defended her dissertation! Congratulations Dr. Ana Jovanovic on successfully defending her dissertation titled “Improving the Accuracy of Software Models Using Refinement and Mutation Testing”November 2024: Recipient of the UTA CSE department “Rising Star” Research AwardOctober 2024: Our invited paper “Mutation testing for temporal alloy models (extended version)” has been published in SySoM.October 2024: Judge for HackUTA.September 2024: Presented our paper at MODELS 2024.More: (Older News). Hobbies I love puzzles just as much as my cat likes laying out over all the puzzle pieces. In my downtime, I play video games: I have a weekly discord get together with all my close friends in Texas. I equally enjoy getting out of the house. Since I stopped running marathons, I’ve taken to hiking – I have a goal to visit every national park in the United States. I am also eager to get out and explore the world – I enjoy backpacking with my husband internationally.",
  "content_length": 4570,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:59"
}