{
  "name": "Alok N. Choudhary",
  "homepage": "http://www.eecs.northwestern.edu/~choudhar",
  "status": "success",
  "content": "Prof. Alok Choudhary Dever Chair Professor, Electrical and Computer Engineering Professor, Computer Science Professor, Kellogg School of Management Director, Center for Ultra-Scale Computing and Information Security (CUCIS) Biography: Dr. Alok Choudhary is a professor, researcher and an entrepreneur. He is the Henry and Isabel Dever chaired Professor of Electrical and Computer Engineering, professor of Computer Science and also teaches at Kellogg School of Management at Northwestern University. Dr. Alok Choudhary is also the founder, chairman and chief scientist of 4C insights, a data science software company. 4C was acquired by MediaOcean in 2020. Dr. Choudhary serves on the Secretary of Energy’s Advisory Board on Artificial Intelligence. Dr. Choudhary served as the chair of Electrical Engineering and Computer Science department from 2007 to 2011 at Northwestern University. He is a fellow of the joint Argonne-Northwestern Institute NAISE. From 1989 to 1996, Dr. Choudhary was on the faculty of the Electrical and Computer Engineering Department at Syracuse University. Dr. Choudhary graduated with a PhD from University of Illinois, Coordinated Science Lab, Urbana-Champaign in the field of Supercomputing and Big Data Science. He received an M.S. degree from the University of Massachusetts, Amherst, his B.E. (Hons.) degree from the Birla Institute of Technology and Science, Pilani, India. Awards and Recognitions: Dr. Choudhary has received numerous prestigious awards including National Science Foundation's Presidential Young Investigator Award, IEEE Engineering Foundation award, an IBM Faculty award, and an Intel Research Council award. Professor Choudhary is a fellow of the IEEE (Institute of Electrical and Electronics Engineers), fellow of the ACM (Association of Computing Machinery) and a fellow of the AAAS (American Academy of Advancement of Science) - one of a select researcher, who is a fellow of top engineering, computer science and science societies. He received the distinguished Alumni award from Birla Institute of Technology and Science and Technology, Pilani, India in 2016. In 2017, Dr. Choudhary was listed by AdWeek as a “trailblazer and pioneer” in marketing technology. Prof Choudhary was also awarded with the “Technology Manager of The Year in Chicago”, at the TIMMY awards in 2018. In 2006 he received the first award for \"Excellence in Research, Teaching and Service\" from the McCormick School of Engineering. Research and Innovation: Dr. Alok Choudhary has published more than 450 papers in various journals and international conferences and has graduated 40+ PhD students, including 10+ women PhDs, which is one of the highest. He holds several patents. His papers have received the best paper awards in many conferences. He has given keynotes in almost all major international conferences in his fields, and given more than 100 invited talks at conferences, businesses and universities. Dr. Choudhary’s work has also appeared in main stream media in print, digital, TV and Radio. His research over the last two decades focused on big data science, supercomputing, scalable data mining, Machine Learning/AI algorithms, software and their applications in sciences (e.g. climate understanding, astrophysics, cosmology, designing materials etc.), medicine (e.g, understanding diseases causes, outcome predictions, drug design, surgeries etc.) and business applications (e.g, business intelligence, marketing, advertising). Software and algorithms developed by his group over the years is deployed and used in most supercomputers in the world. Consulting, Advising and Leadership: Dr. Choudhary has consulted for many companies including Intel, SPSS, Teradata, Microsoft, Sun Microsystems, Newsbank, Southwest Airlines, Sony, Publicis Group, Portland Group, Lucent, Oliver Weinmen, AT&T, Netezza and many others. His research has been sponsored and supported by DARPA, Department of Defense, NASA, Air Force, National Science Foundation, National Institute of Health (NIH), NIST, and the Department of Energy. He served on a National Academy of Science, Engineering and Medicine roundtable to develop and recommend post-secondary data science education strategies. Prof. Choudhary served as a Member of the National Academy of Science's committee on \"Impact of High-End Computing on Sciences\", which was formed on behalf of the Office of Science of the U. S. government and various federal agencies. He has served and currently serves as board of director for multiple companies. He was also the co-founder of Accelchip, a company that created software and tools to synthesize FPGA logic configurations and circuits from high-level languages such as MATLAB for DSP applications. Accelchip was acquired by Xilinx in early 2006. A full list of my research projects can be found in CUCIS center. My research group currently consists of 2 research professors, Wei-keng Liao and Ankit Agrawal, and many doctoral students. Their research projects and publications can be found in CUCIS center website. Also, visit the CUCIS website to use various AI models and data mining and supercomputing software developed by our group over the years. Office: Technological Institute Northwestern University 2145 Sheridan Rd. #L469 Evanston, IL 60208 Phone: (847) 467-4129 E-mail: a-choudhary AT northwestern.edu",
  "content_length": 5344,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:02"
}