{
  "name": "Alona Fyshe",
  "homepage": "http://webdocs.cs.ualberta.ca/~alona",
  "status": "success",
  "content": "Dr. Alona Fyshe, UAlberta I am an Assistant Professor with a joint appointment in the departments of Computing Science and Psychology at the University of Alberta. I am a fellow of the Alberta Machine Intelligence Institute and I hold a CIFAR Canadian AI Chair (2018-2023). Prior to this, I was faculty at the University of Victoria. My interests are Computational Linguistics, Machine Learning and Neuroscience. My work combines all three of these areas to study the way the human brain processes language. Computer models of language are typically built using large bodies of text (corpora) collected from the Internet. These models have become very large and very accurate, but they still fall short in a few ways. First, they need a huge amount of data to train. Secondly, they misjudge meaning when inference or common sense is required. My research takes inspiration from what we know about the brain to improve language models, making them more efficient and more effective. I also study language in the brain more directly using brain imaging technologies like EEG and fMRI. We record brain activity while people read and compare that to the inner workings of computer language models. This helps us to explore how the brain processes language, but also gives us additional insight into how we might improve these language models. Here's my CV. Interested in working with me? Here is what to include when contacting me. Before joining the University of Alberta, I received a BSc and MSc in Computing Science from the University of Alberta, and worked at Google as a Software Engineer. I completed my PhD at Carnegie Mellon University, where I was advised by Dr. Tom Mitchell. My PhD Thesis is available here. My name is sometimes a source of confusion. My first name (Alona) rhymes with sauna and iguana. My last name (Fyshe) looks complicated, but is just pronounced fish. Here's a graphic to help: Cognitive Neuroscience Society Annual Meeting. Invited Plenary Session: Data Driven Everything. March 2018 Video (talk) Video (debate) Cognitive Computational Neuroscience. Invited Tutorial: Artificial IntelligenceSeptember 2017    Slides (pdf)    Video The Machine Learning in Brain Imaging Series at the National Institute of Mental Health. Invited (virtual) talk: Using EEG to Decode Semantics During an Artificial Language Learning TaskMay 2020   Video AI4Society PodcastOctober 2020   Episode webpage TWIML (This week in machine Learning)August 2021   Episode webpage NLP Highlights (Allen Institute for Artificial Intelligence)October 2020   Episode webpage Fall 2015 CSC 106: The Practice of Computer Science Spring 2016 SENG 474/CSC 578: Data Mining Check out the projects from that class! Fall 2016 SENG 474/CSC 578: Data Mining Spring 2017 CSC 106: The Practice of Computer Science Summer 2017 CSC 485E/SENG 480C/CSC 581A: Topics in Artificial Intelligence: \"Natural Language Processing\" Spring 2018 SENG 474/CSC 578: Data Mining Fall 2018 CSC 652: Machine Learning and the Brain Fall 2019 CSC 652: Machine Learning and the Brain Winter 2020 PSYCO 354: Foundations of Cognitive Science Fall 2020 PSYCO 576: Machine Learning in Psychology and Neuroscience Winter 2021 CMPUT 466/566: Introduction to Machine Learning Fall 2021 CSC 652: Machine Learning and the Brain Winter 2022 PSYCO 354: Foundations of Cognitive Science I'm not maintaining this list anymore, except for papers behind a paywall. Please see my Google Scholar page. Callie Federer, Haoyan Xu, Alona Fyshe & Joel Zylberberg. (2020). Improved object recognition using neural networks trained to mimic the brain’s statistical properties. Neural Networks, 131, 103-114. Link -- Arxiv version Qingfeng Lan, Yangchen Pan, Alona Fyshe, Martha White. Maxmin Q-learning: Controlling the Estimation Bias of Q-learning. International Conference on Learning Representations (ICLR) Addis Ababa, Ethiopia. April 30, 2020 Link Alona Fyshe. Studying language in context using the temporal generalization method Phil. Trans. R. Soc. 2020 Link Alona Fyshe, Gustavo Sudre, Leila Wehbe, Nicole Rafidi and Tom M Mitchell. The Lexical Semantics of Adjective Noun Phrases in the Human Brain. Hum Brain Mapp. 2019; 40: 4457– 4469. Link Dhanush Dharmaretnam, Alona Fyshe. The Emergence of Semantics in Neural Network Representations of Visual Information. The North American Chapter of the Association for Computational Linguistics - Human Language Technologies (NAACL HLT 2018) - New Orleans, Louisiana, 2018 pdf , Supplementary material Sophia Chan, Alona Fyshe. Social and Emotional Correlates of Capitalization on Twitter. PEOPLES Workshop at the Conference of the North American Chapter of the Association for Computational Linguistics - Human Language Technologies (NAACL HLT 2018) - New Orleans, Louisiana, 2018 pdf Brian Murphy, Leila Wehbe, Alona Fyshe. Decoding Language from the Brain. Language, Cognition, and Computational Models, Cambridge University Press. 2018 link Sophia Chan, Maryam Honari Jahromi, Benjamin Benetti, Aazim Lakhani, Alona Fyshe. Ensemble Methods for Native Language Identification. Workshop on Innovative Use of NLP for Building Educational Applications, NLI Shared Task (Tied for 2nd place), Empirical Methods for Natural Language Processing (EMNLP), 2017 pdf Cole Peterson, Alona Fyshe. Poet Admits // Mute Cypher: Beam Search to find Mutually Enciphering Poetic Texts. Empirical Methods for Natural Language Processing, Austin, TX. 2016 pdf Website Haoyan Xu, Brian Murphy, Alona Fyshe. BrainBench: A Brain-Image Test Suite for Distributional Semantic Models. Empirical Methods for Natural Language Processing, Austin, TX. 2016 pdf Leila Wehbe, Alona Fyshe, Tom Mitchell. Language processing in the brain: Mapping neural activity to language meaning. Human Language: from Genes and Brains to Behavior, MIT Press (to appear) Alona Fyshe, Leila Wehbe, Partha Talukdar, Brian Murphy, and Tom Mitchell. A Compositional and Interpretable Semantic Space. The 2015 Conference of the North American Chapter of the Association for Computational Linguistics - Human Language Technologies (NAACL HLT 2015), Denver, CO. 2015. pdf Supplementary Material Leila Wehbe , Brian Murphy, Partha Talukdar, Alona Fyshe, Aaditya Ramdas, Tom Mitchell. Simultaneously uncovering the patterns of brain regions involved in different story reading subprocesses PLoS ONE, 9(11): e112575 Journal Website Supplementary Material Evangelos E. Papalexakis, Alona Fyshe, Nicholas Sidiropoulos, Partha Pratim Talukdar, Tom Mitchell, Christos Faloutsos. Good-Enough Brain Model: Challenges, Algorithms and Discoveries in Multi-Subject Experiments. ACM SIGKDD, New York City, USA. 2014 pdf Alona Fyshe, Partha Pratim Talukdar, Brian Murphy and Tom M Mitchell. Interpretable Semantic Vectors from a Joint Model of Brain- and Text- Based Meaning. The 52nd Annual Meeting of the Association for Computational Linguistics, Baltimore, Maryland. 2014. pdf Supplementary Material Michelle Shu and Alona Fyshe. Sparse Autoencoders for Word Decoding from Magnetoencephalography. 3rd NIPS Workshop on Machine Learning and Interpretation in NeuroImaging (MLINI), 2013. pdf John J Grefenstette, Shawn T Brown, Roni Rosenfeld, Jay DePasse, Nathan TB Stone, Phillip C Cooley, William D Wheaton, Alona Fyshe, David D Galloway, Anuroop Sriram, Hasan Guclu, Thomas Abraham and Donald S Burke. FRED (a Framework for Reconstructing Epidemic Dynamics): an open-source software system for modeling infectious diseases and control strategies using census-based populations. BMC public health. 2013;13(1):940 pdf Alona Fyshe, Partha Talukdar, Brian Murphy and Tom Mitchell. Documents and Dependencies: an Exploration of Vector Space Models for Semantic Composition. International Conference on Computational Natural Language Learning (CoNLL 2013), Sofia, Bulgaria., 2013. pdf Supplementary Material (25% acceptance rate) Alona Fyshe, Gustavo Sudre, Leila Wehbe, Brian Murphy and Tom Mitchell. Decoding Word Semantics from Magnetoencephalography Time Series Transformations. 2nd NIPS Workshop on Machine Learning and Interpretation in NeuroImaging (MLINI), 2012. pdf Gustavo Sudre, Dean Pomerleau, Mark Palatucci, Leila Wehbe, Alona Fyshe, Riitta Salmelin, Tom Mitchell. Tracking Neural Coding Of Perceptual And Semantic Features Of Concrete Nouns. Neuroimage 62(1) 451-463, 2012. Link Alona Fyshe, Emily Fox, David Dunson and Tom Mitchell. Hierarchical Latent Dictionaries for Models of Brain Activation. Fifteenth International Conference on Artificial Intelligence and Statistics, 2012 pdf Supplementary Material (6% acceptance rate for oral presentation) Alona Fyshe, Yifeng Liu, Duane Szafron, Russ Greiner, and Paul Lu. Improving Subcellular Localization Prediction using Text Classification and the Gene Ontology. Bioinformatics, 24(21):2512-2517 2008 pdf Alona Fyshe and Duane Szafron. Term Generalization and Synonym Resolution for Biological Abstracts: Using the Gene Ontology for Subcellular Localization Prediction. BioNLP Workshop (HLT-NAACL), 2006 pdf (38% acceptance rate) Brett Poulin, Roman Eisner, Duane Szafron, Paul Lu, Russ Greiner, D.S. Wishart, Alona Fyshe, Brandon Pearcy, Cam MacDonell and John Anvik. Visual Explanation of Evidence in Additive Classifiers. Eighteenth Conference on Innovative Applications of Artificial Intelligence (IAAI), July 2006 pdf Paul Lu, Duane Szafron, Russell Greiner, David S. Wishart, Alona Fyshe, Brandon Pearcy, Brett Poulin, Roman Eisner, Danny Ngo and Nicholas Lamb. PA-GOSUB: a searchable database of model organism protein sequences with their predicted Gene Ontology molecular function and subcellular localization. Nucleic Acids Research, 33:D147-D153, 2005 pdf Duane Szafron, Paul Lu, Russell Greiner, David S. Wishart, Brett Poulin, Roman Eisner, Zhiyong Lu, John Anvik, Cam Macdonell, Alona Fyshe, and David Meeuwis. Proteome Analyst: Custom Predictions with Explanations in a Web-based Tool for High-throughput Proteome Annotations. Nucleic Acids Research, 32:W365-W371 2005 pdf Nicholas Lamb, Paul",
  "content_length": 10224,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:04"
}