{
  "name": "Alon Peled-Cohen",
  "homepage": "https://english.tau.ac.il/profile/alonco",
  "status": "success",
  "content": "Dr. Alon[Alon Cohen] Peled-Cohen | Tel Aviv University Top menuMain menuMain Content Strategy Libraries Staff List עבריתعربي 中文网 Русский Inquiry PortalStudent PortalRegistration Search This site Global search AboutOur StoryStrategy Newsroom International Ranking History TAU Review Magazine Prizes and Honors Message from the President Sustainability OrganizationDepartments and Administrative Offices Office of the President Office of the Rector TAU Leadership Academic Secretariat Board of Governors Constitution Administrative Offices Our CampusCampus Map Academic Calendar Transport & Parking Libraries Emergency Contacts Guest Accommodation Discover TAU Shop Academic UnitsInternational SchoolTAU International Undergraduate Programs Graduate Programs Short Term Programs Study Abroad Faculties and ProgramsArts Engineering Exact Sciences Humanities Law Life Sciences Management Medical & Health Sciences Social Sciences Neuroscience New Environmental School The Steinhardt Museum of Natural History Interdisciplinary UnitsBioMed Neuroscience Quantum Science and Technology Nanotechnology Cyber Renewable Energy AI & Data Science Planet zero - Climate Crisis Initiative Bioinformatics Regenerative Medicine The Division of Languages ResearchR & DHead of Research & Development Research Authority Research Centers & Institutes All our researchers on CRIS Research Opportunities Ramot Nature on CampusThe Steinhardt Museum of Natural History The I. Meier Segals Garden for Zoological Research Tel Aviv University Botanical Garden Prospective StudentsStudy in EnglishUndergraduate Programs Graduate Programs Study Abroad Short Term Programs ELI Gap Year Program Exchange Programs Chat with a Student Study in HebrewUndergraduate Programs Graduate Programs Tuition Fee Regulations How to Apply Life on CampusCampus Life at TAU Student Life Team Living in Tel Aviv Housing Diversity on Campus Community Involvement Social Activism Dean of Students Career Development Center New OlimAssistance for New Olim Supporting TAUConnect with TAU2025 Annual Report Board of Governors News and Events Friends Associations Development & Public Affairs Division Galleries Print Publications Global CampaignAbout the Campaign Message from Campaign Chair Top Five Projects: The National Center for Traumatic Stress and Resilience Top Five Projects: Biomedical Sciences Building Top Five Projects: Faculty Recruitment Fund Top Five Projects: Student Success Center Connections: International Reach Convergence: New Paths to Discovery Clout: Real-World Impact Community: Stronger Society 'Bricks and Mortar': Physical Needs Attractive School Naming Opportunities Give Online NowAll Giving Options Give through American Friends Give through Australian Friends Give through Canadian Friends Give through Israeli Friends Give through UK Friends TAU Comprehensive Campaign: Are You Optimistic? Alumni PartnershipsAboutPartnerships at TAU Existing Partnerships Visiting Delegations Partner With UsResearch Partners Joint Teaching & Degrees Mobility Programs Customized & Faculty-Led Programs Current Joint Funding Opportunities You are here Homepage of Tel Aviv University > Dr. Alon[Alon Cohen] Peled-Cohen Dr. Alon[Alon Cohen] Peled-Cohen School of Electrical Engineering ביה\"ס להנדסת חשמל סגל אקדמי בכיר Quick navigation: Hebrew Email: alonco@tauex.tau.ac.ilMy CRIS profileWebsiteOffice: Electrical Engineering, 119 About TAUAcademic Units Campus Map Transport & Parking Emergency Contacts Phone Directory Dean of Students Sexual Harassment Prevention Student Union Computer Services Academic Calendar Libraries Accessibility Statement Terms of Use Privacy and Data Protection TAU InternationalTAU International website About Graduate Programs Undergrad Programs Language Programs Summer Programs Study Abroad SupportersGlobal TAU Magazine Friends Associations Board of Governors TAU Alumni Development & Public Affairs Print Publications Accessibility Facebook Instagram Linkedin Youtube Coursera Spotify Tel Aviv University makes every effort to respect copyright. If you own copyright to the content contained here and / or the use of such content is in your opinion infringing Contact us as soon as possible >> Tel Aviv University, P.O. Box 39040, Tel Aviv 6997801, Israel",
  "content_length": 4257,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:03"
}