{
  "name": "Alon Eden",
  "homepage": "https://www.cs.huji.ac.il/~aloneden",
  "status": "success",
  "content": "Alon Eden Alon Eden School of Computer Science and Engineering Hebrew University of Jerusalem alon.eden@mail.huji.ac.il About I am a Harry & Abe Sherman Senior Lecturer (≅Assistant Professor) in the School of Computer Science and Engineering of the Hebrew University of Jerusalem and the head of the MATAR program. I'm also a proud member of the Center for the Study of Rationality My main research interests lie in the interface of computer science and economics. I am interested in applying computational tools in the design and analysis of economic mechanisms, and in considering computational problems from a game theoretic perspective. I received my PhD from Tel Aviv University where I was advised by Michal Feldman and Amos Fiat, and was a Postdoctoral Fellow in Harvard's EconCS group, hosted by Yiling Chen and David Parkes. My Curriculum Vitae can be found here. Check out my wife's page, Talya Eden. She does awesome things in the field of sublinear algorithms. Anouncements Moshe Babaioff and I are organizing an EconCS seminar at the Hebrew University this year! Please contact me if you're interested in giving a talk. Journals Combinatorial Auctions with Interdependent Valuations: SOS to the Rescue with Michal Feldman, Amos Fiat, Kira Goldner and Anna Karlin. Mathematics of Operations Research (MOR). Max-Min Greedy Matching with Uriel Feige and Michal Feldman. Special issue of selected APPROX 2019 papers in Theory of Computing (ToC), 18(6):1-33, 2022. A Simple and Approximately Optimal Mechanism for a Buyer with Complements [arxiv] with Michal Feldman, Ophir Friedler, Inbal Talgam-Cohen and S. Matthew Weinberg. Operations Research (OR), 69(1):188â206,2020 Online Random Sampling for Budgeted Settings with Michal Feldman and Adi Vardi. Special issue of selected SAGT 2017 papers in Theory of Computing Systems (TOCS), 63(7):1470-1498, 2019. Conferences Bilateral Trade with Interdependent Values: Information vs. Approximation with Shahar Dobzinski, Kira Goldner, Ariel Shaulker and Thodoris Tsilivis, in EC 2025. Plant-and-Steal: Truthful Fair Allocations via Predictions with Ilan Reuven Cohen, Talya Eden and Arsen Vasilyan, in NeurIPS 2024. Private Interdependent Valuations: New Bounds for Single-Item Auctions and Matroids with Michal Feldman, Simon Mauras and Divyarthi Mohan, in EC 2024. Platform Equilibrium: Analyzing Social Welfare in Online Market Places with Gary Qiurui Ma and David C. Parkes, in EC 2024. Constant Approximation for Private Interdependent Valuations with Michal Feldman, Kira Goldner, Simon Mauras and Divyarthi Mohan, in FOCS 2023. Presented in Highlights Beyond EC 2024. Platform Behavior under Market Shocks: A Simulation Framework and Reinforcement-Learning Based Study with Xintong Wang, Gary Qiurui Ma, Clara Li, Alexander Trott, Stephan Zheng nd David C. Parkes, in TheWebConf (formerly WWW) 2023. Cursed yet Satisfied Agents with Yiling Chen and Juntao Wang, in ITCS 2022. Private Interdependent Valuations with Kira Goldner and Shuran Zheng, in SODA 2022. Reinforcement Learning of Simple Indirect Mechanisms with Gianluca Brero, Matthias Gerstgrasser, David C. Parkes and Duncan Rheingans-Yoo, in AAAI 2021. Also appeared in ML For Economic Policy Workshop@NeurIPS 2020. Price of Anarchy of Simple Auctions with Interdependent Values with Michal Feldman, Inbal Talgam-Cohen and Ori Zviran, in AAAI 2021. An Economics-Based Analysis of RANKING for Online Bipartite Matching with Michal Feldman, Amos Fiat and Kineret Segal, in SOSA 2021. On the Power and Limits of Dynamic Pricing in Combinatorial Markets with Ben Berger and Michal Feldman, in WINE 2020. Combinatorial Auctions with Interdependent Valuations: SOS to the Rescue with Michal Feldman, Amos Fiat, Kira Goldner and Anna Karlin, in EC 2019. Best Paper with Student Lead Authors. Best Presentation by a Student or Postdoctoral Researcher - Honorable Mention. [video] Max-Min Greedy Matching with Uriel Feige and Michal Feldman, in APPROX 2019. Dynamic Pricing of Servers on Trees with Ilan Reuven Cohen, Amos Fiat and Lukasz Jez, in APPROX 2019. Interdependent Values without Single-Crossing with Michal Feldman, Amos Fiat and Kira Goldner, in EC 2018. Truthful Prompt Scheduling for Minimizing Sum of Completion Times with Michal Feldman, Amos Fiat and Tzahi Taub, in ESA 2018. The Competition Complexity of Auctions: A Bulow-Klemperer Result for Multi-Dimensional Bidders with Michal Feldman, Ophir Friedler, Inbal Talgam-Cohen and S. Matthew Weinberg, in EC 2017. A Simple and Approximately Optimal Mechanism for a Buyer with Complements with Michal Feldman, Ophir Friedler, Inbal Talgam-Cohen and S. Matthew Weinberg, in EC 2017. Online Random Sampling for Budgeted Settings with Michal Feldman and Adi Vardi, in SAGT 2017. Best Paper. Pricing Social Goods with Tomer Ezra and Michal Feldman, in ESA 2017. The Invisible Hand of Dynamic Market Pricing with Vincent Cohen-Addad, Michal Feldman and Amos Fiat, in EC 2016. Lottery Pricing Equilibria with Shaddin Dughmi, Michal Feldman, Amos Fiat and Stefano Lenoardi, in EC 2016. (Corrected a minor inaccuracy in the conference version regarding the separation oracle.) Pricing Online Decisions: Beyond Auctions with Ilan Reuven Cohen, Amos Fiat and Lukasz Jez, in SODA 2015. Preprints Stable Matching under Matroid Rank Valuations with Vignesh Viswanathan and Yair Zick, in COMSOC 2025.. Fair Division via Resource Augmentation with Hannaneh Akrami, Michal Feldman, Amos Fiat and Yoav Gal-Tzur. Stable Marriage: Loyalty vs. Competition with Amit Ronen, Jonah Evan Hess, Yael Belfer and Simon Mauras. Learning Stackelberg Equilibria in Sequential Price Mechanisms with Gianluca Brero, Darshan Chakrabarti, Matthias Gerstgrasser, Vincent Li and David C. Parkes, in Workshop for Reinforcement Learning Theory@ICML 2021. Students Amit Ronen (MSc) 2023-2025. Thesis: Stable Marriage: Loyalty vs. Competition. Asnat Berlin (MSc) 2023-2025. Thesis: Knapsack Contracts and the Importance of Return-on-Investment. Eldar Kerner (MSc) 2023-. Yaara Feldman (Amirim BSc) 2024-2025. Vitae Full CV in PDF. Teaching Algorithms, 2023-2024 Networks, Crowds and Markets, 2023-24 Topics on the Border of Economics and Computation, 2023. Economics and Computation, 2022. Created by Kira Goldner",
  "content_length": 6253,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:02"
}