{
  "name": "Aluízio Fausto Ribeiro Araújo",
  "homepage": "https://www.cin.ufpe.br/~aluizioa/aluizio-homepage.htm",
  "status": "success",
  "content": "Aluizio-CV Dados Pessoais Nome:                                            Aluizio Fausto Ribeiro Araújo. Endereço:                                       Universidade Federal de Pernambuco Centro de Informática - CIn Departamento de Sistemas da Computação Av. Professor Luís Freire, s/n Cidade Universitária 50740-540, Recife, PE, Brazil Telefone:                                        +55 81 32718430  R. 4321. Fax:                                                +55 81 32718438. Endereço eletrônico:                        aluizioa@cin.ufpe.br Títulos Acadêmicos DPhil em Inteligência Artificial e Ciência da Computação Área de Concentração: Inteligência Artificial School of Cognitive and Computing Sciences University of Sussex, Brighton, Inglaterra Mestrado em Engenharia Elétrica Área de Concentração: Automação Departamento de Sistemas de Controle e Energia - Faculdade de Engenharia Elétrica Universidade Estadual de Campinas, Campinas, Brasil Graduação em Engenharia Elétrica Área de Concentração: Sistemas de Potência Departamento de Engenharia Elétrica - Centro de Tecnologia e Geociências Universidade Federal de Pernambuco, Recife, Brasil Áreas de Pesquisa Aprendizagem de Máquinas Descrição: Proposição de novos algoritmos e/ou adaptações de algoritmos propostos envolvendo aprendizagem por reforço, vida artificial e algoritmos genéticos para processos dinâmicos complexos. Tais processos são caracterizados por serem não-lineares, dependentes de contexto e por ocorrerem em ambientes altamente dinâmicos. No momento está se dando ênfase a problemas de otimização combinatorial com objetivos e restrições múltiplos. Estudo da Dinâmica de Redes Neurais Descrição: Estudo do comportamento dinâmico dos modelos de redes neurais. Este estudo compreende a análise de deferentes comportamentos dinâmicos decorrentes de variações paramétricas. Este repertorio de comportamentos pode ser utilizado em capacitações diferenciadas para modelos de memórias por rede neurais. Modelagem de Operações de Memória por Redes Neurais Artificiais Descrição: Proposição e implementação de algoritmos de redes neurais artificiais para modelar mecanismos responsáveis por operações de armazenamento e recuperação de informação de informações em memória. Tais operações são sujeitas a interferências que resultam em variações paramétricas. Modelagem de Processos Dinâmicos por Redes Neurais Artificiais Descrição: Proposição de novos algoritmos e/ou adaptações em algoritmos existentes para modelagem de processos estáticos e dinâmicos. Os processos dinâmicos são caracterizados por possuírem memória e dependerem de contexto, também podendo serem não-lineares, sujeitos à ruído e por ocorrerem em ambientes dinâmicos. Processamento de Seqüências Temporais Descrição: Proposição e implementação de algoritmos de redes neurais e aprendizagem de máquinas para reconhecimento, reprodução, associação e geração de seqüências temporais. Estas são muito comuns em áreas como robótica, processamento de linguagem natural e sistemas de controle, entre outros. Reconhecimento de Padrões por Sistemas Inteligentes Descrição: Emprego de redes neurais e aprendizagem de máquinas para reconhecimento de padrões estáticos e dinâmicos. Robótica Inteligente Descrição: Proposição e implementação de modelos de redes neurais e aprendizagem de máquinas para planejamento e controle de sistemas robóticos. Tais sistemas compreendem manipuladores mecânicos, garras e robôs móveis. Artigos em Periódicos Padoan Junior, A. C., Barreto, G. de A., & Araújo, A. F. R. (2003). Modelling and production of robot trajectories using the temporal parametrized Self-organizing Maps. International Journal of Neural Systems, vol. 13, n02, pp. 121-130. Barreto, G. de A., Araújo, A. F. R., & Kremer, S. C. (2003). A taxonomy for spatiotemporal connectionist networks revisited:  The unsupervised case. Neural Computation, vol. 15, n06, pp. 1255-1320, June, 2003. Barreto, G. de A., Araújo, A. F. R., & Ritter, H. (2003). Self-organizing features maps for modelling and control of robotic manipulators. Journal of Intelligent and Robotic Systems, vol. 36, n04, pp. 407-450, April. 2003. Araújo, A. F. R. & Vittori, K. (2002). Algoritmo de roteamento adaptativo para balanceamento de cargas em redes de telecomunicações. Revista Controle & Automação, vol. 13, n03, pp. 248-265. Araújo, A. F. R. & Henriques, A. S. (2002). A stochastic neural model for fast identification of spatiotemporal sequences. Neural Processing Letters, vol. 16, n03, pp. 277-292. Barreto, G. de A., Araújo, A. F. R., Dücker, C. H. G., & Ritter, H. (2002). A distributed robotic control system based on a temporal self-organizing neural network. IEEE Transactions on Systems, Man, and Cybernetics Part C: Applications and Reviews, vol. 32, n04, pp. 347-357. Barreto, G. de A. & Araújo, A. F. R. (2002). Nonlinear modelling of dynamic systems with the self-organizing map. Lectures Notes in Computer Science , vol. 2415, pp. 975-980. Barreto, G. de A., Araújo, A. F. R., Dücker, C, & Ritter, H. (2002). Implementação de um sistema de controle para o robô PUMA 560 baseado em uma rede neural auto-organizável. Revista Controle & Automação, vol.13, n02, pp. 141-155. Araújo, A. F. R. & Barreto, G. de A. (2002). A self-organizing context-based approach to the tracking of multiple robot trajectories. Applied Intelligence, vol. 17, n01, pp. 101-119. Editors: Bullock, D. and van der Smagt, P. Araújo, A. F. R. & Barreto, G. de A. (2002). Context in temporal sequence processing: A self-organizing approach and its application to robotics. IEEE Transactions on Neural Networks, vol. 13, n01, pp. 45-57. Vittori, K. & Araújo, A. F. R. (2001). Agent-oriented routing in telecommunications. IEICE Transactions on Communications, vol. E84-B, n11, pp. 3006-3013. Barreto, G. de A., Araújo, A. F. R. (2001). Unsupervised learning and temporal context used to recall complex robot trajectories. International Journal of Neural Systems, vol. 11, n01, pp. 11-22. Valente, C. M. O., Schammass, A., Araújo, A. F. R. &. Caurin, G. A. P. (2001). The influence of the RBF training strategy on the performance of a neural gripper. Advanced Robotics, vol. 14, n08, pp. 669-682. Barreto, G. de A. & Araújo, A. F. R. (2001). Time in self-organizing maps: An overview of models. International Journal of Computer Research, vol. 10, n02, pp. 139-179. Valente, C. M. O., Araújo, A. F. R, Caurin, G. A., & P. Schammass, A. (1999). A neural gripper for arbitrary object grasping. Connection Science, vol. 11, n3/4, pp. 289-314. Barreto, G. de A. & Araújo, A. F. R. (1999). Unsupervised learning and recall of temporal sequences: An application to robotics. International Journal of Neural Systems, vol. 9, n3, pp. 235-242. Oliveira, V. A., Costa, E. F., Araújo, A. F. R. & Tinós, R. (1998). Reinforcement learning control schemes. Revista Controle & Automação, vol. 09, n1, pp. 31-38. Araújo, A. F. R. & Braga, A. P. S. (1998). Goal-directed reinforcement learning using variable learning rate. Lectures Notes in Artificial Intelligence (LNAI - SBIA98), vol. 1515, pp. 131-140. Araújo, A. F. R. & DArbo Jr., H. (1997). The role played by intralayer and interlayer feedback connections in recurrent neural networks used for planning. Journal of the Brazilian Computer Society (JBCS), vol. 04, n1, pp. 38-49. Araújo, A. F. R. & Vieira, M. (1997). Employing a multiple associative memory model for temporal sequence reproduction. Journal of the Brazilian Computer Society (JBCS), vol. 04, n1, pp. 28-37. Artigos Integralmente Publicados em Congressos Lima, M. A. C., Araújo, A. F. R., & Cesar, A. C.,  (2003). Roteamento e alocação de comprimentos de onda em redes ópticas usando algoritmo genético. Anais do 20º Simpósio Brasileiro de Telecomunicações (SBRT), Setembro de 2003, Rio de Janeiro, RJ, Brasil. de Amorim, B. P., Zanchettin, C., Vasconcelos, D. M. R. H., Vasconcelos G. C., Ludermir, T. B. & Araújo, A. F. R. (2002). Avaliação de um Modelo Neuro-difusos para Classificação de Padrões, Seleção de Atributos e Extração de Regras. Anais do ENIA, Agosto de 2003, Campinas, SP, Brasil. Braga, A. P. S. & Araújo, A. F. R. (2002). Aplicando mapas topológicos para acelerar aprendizagem por reforço na tarefa de navegação de robôs móveis. Anais do XIV Congresso Brasileiro de Automática (CBA), 02-05 de Setembro de 2002, Natal, RN, Brasil. Barreto, G. de A. & Araújo, A. F. R. (2002). Identificação e controle de sistemas dinâmicos usando a rede auto-organizável de Kohonen. Anais do XIV Congresso Brasileiro de Automática (CBA), 02-05 de Setembro de 2002, Natal, RN, Brasil. Araújo, A. F. R., Fernandes, R. S. M. & Vittori, K.(2002). Aprendizagem por reforço em roteamento dinâmico para redes de telecomunicações totalmente conectadas. Anais do XIV Congresso Brasileiro de Automática (CBA), 02-05 de Setembro de 2002, Natal, RN, Brasil. Padoan Junior, A. C., Barreto, G. de A., & Araújo, A. F. R. (2002). Modelagem dinâmica de trajetórias robóticas usando a rede de Kohonen paramétrica. Anais do IV Simpósio Brasileiro de Redes Neurais (SBRN), Novembro de 2002, Recife, PE, Brasil. Braga, A. P. S. & Araújo, A. F. R. (2002). Applying topological maps to accelerate reinforcement learning of mobile robot navigation. IEEE International Conference on Systems, Man, and Cybernetics (SMC02), October 06-09, 2002, Hammamet, Tunisia. IEEE Catalog number: 02CH37349C. Lima, M. A. C., Araújo, A. F. R., & Cesar, A. C. (2002). Dynamic channel assignment in mobile communications based on genetic algorithms. IEEE International Symposium on Personal Indoor and Mobile Radio Communications, September, 15-18, 2002, Lisboa, Portugal. Barreto, G. de A. & Araújo, A. F. R. (2002). Temporal associative memory and function approximation with the self-organizing map. IEEE Workshop on Neural Network for Signal Processing (NNSP), September, 4-6, 2002, Martigny, Valais, Switzerland. Barreto, G. de A., Araújo, A. F. R., Dücker, C. & Ritter, H. (2001). Controle distribuído do robô PUMA 560 usando uma rede ne",
  "content_length": 31111,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:07"
}