{
  "name": "Alvaro A. Cárdenas",
  "homepage": "https://users.soe.ucsc.edu/~alacarde",
  "status": "success",
  "content": "Alvaro A. Cardenas â UC Santa Cruz Alvaro A. Cardenas Professor of Computer Science and Engineering, University of California, Santa Cruz I am a Professor in the Computer Science and Engineering Department at UC Santa Cruz. Before joining UCSC, I was the Eugene McDermott Associate Professor of Computer Science at the University of Texas at Dallas, a postdoctoral scholar at the University of California, Berkeley, and a research staff member at Fujitsu Laboratories. I hold M.S. and Ph.D. degrees from the University of Maryland, College Park, and a B.S. from Universidad de Los Andes in Colombia. My research focuses on the security of cyber-physical systems, including embodied AI, autonomous vehicles, drones, and SCADA systems controlling the power grid and other critical infrastructures. I am also interested in the use of Machine Learning and AI agents for security operations. My work has been recognized with an NSF CAREER award, the 2018 faculty excellence in research award from the Erik Johnson School of Engineering and Computer Science, the Eugene McDermott Fellow Endowed Chair, and the Distinguished Service Award from the IEEE Computer Society Technical Committee on Security and Privacy. My research has been funded by NSF, ARO, AFOSR, NSA, NIST, MITRE, DHS, DoT, Google, Phoenix Technologies, Intel, and OpenAI. Research Overview My group studies the security and privacy of cyber-physical systems and emerging technologies, with applications to autonomous vehicles, drones, industrial control systems, and critical infrastructure. I am also particularly interested in the security of embodied AI systems, and in using machine learning and AI agents to automate cybersecurity tasks such as anomaly detection, attack recovery, and incident response. For more details, see the research page, research group, and Google Scholar profile Selected publications A Tale of Two Industroyers: It was the Season of Darkness IEEE Symposium on Security and Privacy (IEEE S&P), 2024. SoK: Security of Programmable Logic Controllers USENIX Security, 2024. SCADA World: An Exploration of the Diversity in Power Grid Networks ACM SIGMETRICS, 2024. Fast Attack Recovery for Stochastic Cyber-Physical Systems IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS), 2024. Provable Adversarial Safety in Cyber-Physical Systems IEEE European Symposium on Security and Privacy (EuroS&P), 2023. MaDIoT 2.0: Modern High-Wattage IoT Botnet Attacks and Defenses USENIX Security, 2022. You Make Me Tremble: A First Look at Attacks Against Structural Control Systems ACM Conference on Computer and Communications Security (CCS), 2021. MaMIoT: Manipulation of Energy Markets with High-Wattage IoT Botnets ACM CCS, 2021. DARIA: Designing Actuators to Resist Arbitrary Attacks Against Cyber-Physical Systems IEEE EuroS&P, 2020. Adversarial Classification Under Differential Privacy NDSS, 2020. Real-Time Recovery for Cyber-Physical Systems Using Linear Approximations IEEE Real-Time Systems Symposium (RTSS), 2020. Uncharted Networks: A First Measurement Study of the Bulk Power Grid ACM Internet Measurement Conference (IMC), 2020. SAVIOR: Securing Autonomous Vehicles with Robust Physical Invariants USENIX Security, 2020. Not Everything is Dark and Gloomy: Power Grid Protections Against IoT Demand Attacks USENIX Security, 2019. Limiting the Impact of Stealthy Attacks on Industrial Control Systems ACM CCS, 2016. Using Visual Challenges to Verify the Integrity of Security Cameras ACSAC, 2015. Market Analysis of Attacks Against Demand Response in the Smart Grid ACSAC, 2014. Attacks Against Process Control Systems: Risk Assessment, Detection, and Response ACM ASIACCS, 2011. Evaluation of Detection Algorithms for MAC Layer Misbehavior: Theory and Experiments IEEE/ACM Transactions on Networking, 2009. Optimal ROC Curve for a Combination of Classifiers Neural Information Processing Systems (NIPS), 2007. A Framework for the Evaluation of Intrusion Detection Systems IEEE Symposium on Security and Privacy (S&P), 2006. News UCSC won the 2025 Hunter Group Category in Cyber RECon (US Cybercommand) program. Congratulations to Sebastian Castro, Iakov Taranenko, Nany Lau, and Astra Tsai. Congratulations to Luis Salazar, Keerthi Koneru, and Juan Lozano for successfully defending their Ph.D. dissertations. ICSNet won the best paper award at the ACM CPS&IoT Security Workshop 2024 (at CCS). Congrats Luis Salazar, Juan Lozano, Efren Lopez and Carlos Rubio. New work on Industroyer and PLC security at IEEE S&P 2024 and USENIX Security 2024. SCADA World presented at ACM SIGMETRICS 2024. Fast Attack Recovery for Stochastic Cyber-Physical Systems appeared at IEEE RTAS 2024. Contact Computer Science and Engineering University of California, Santa Cruz 1156 High Street, Mail Stop SOE2 Santa Cruz, CA 95064, USA Tel: +1 (831) 459-4879 Email: alvaro.cardenas [at] ucsc [dot] edu",
  "content_length": 4891,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:09"
}