{
  "name": "Alvaro A. A. Fernandes",
  "homepage": "http://www.cs.man.ac.uk/~alvaro",
  "status": "success",
  "content": "Alvaro A. A. Fernandes Dr Alvaro A. A. Fernandes Senior Lecturer Information Management Group Department of Computer Science The University of Manchester Oxford Road Manchester M13 9PL, UK my webpage at the University's research pages I have retired as of 18 November 2018. Brief Details  | Research Interests |  Research Projects  |  Publications |  Research Students  | Teaching  | Admin  | More Information Research Interests My research was centred on advanced information management. My main contributions have fallen in the area of advanced databases and advanced query processing. Value-Added Data Systems, i.e., data management principles, techniques, methodologies and tools to support, in the context of big data, the complete cycle (from extraction, through semantic integration, to querying) of data provision that is sensitive to the user context and aims to find best-fit solutions in the light of the data context (e.g., quality, provenance, etc.). Databases and Dataspaces, especially query processing and optimization, and query-based techniques for data integration. In the dataspaces area, I was an active member of a 36-month EPSRC-funded research project on this topic that ran from Jul 2008 to Jun 2011. The particular approach to dataspaces that this project followed is the intensive use of metadata and of user feedback for continuous improvement of semantic judgements thereby maximizing their utility for the purposes of querying dataspaces. The project built a dataspace management system called DSToolkit that, internally, uses model-management operators to bootstrap a dataspace and view-based rewriting to query component resources. Data Management of Streams and Sensor Networks, especially query processing and optimization that reconcile different objective functions, and query-based techniques for data integration. Between Oct 2005 and Sep 2008, in an EPSRC-funded research project, called DIAS-MC, I was active in developing a sensor network query processing infrastructure, called SNEE, that is distinctive in construing a sensor network as, strictly, a distributed computing platform. Thus, SNEE query plans are fragmented and executed in specific nodes in a truly distribued manner. Routing and scheduling take place at the level of query fragments. SNEE generates code for a target sensor network software layer (currently, nesC/TinyOS). A follow-on, 36-month EU-funded research project, called SemsorGrid4Env, ran from Sep 2008 to Aug 2011. The main focus was on enabling the construal of sensor networks in environmental monitoring as fully-fledged data resources amenable to high-level, view-based, semantic integration, thereby allowing rapid developement techniques (e.g., mash-ups) to draw data from sensor networks inn emergency response scenarios. Adaptive/Autonomic Systems, especially in query processing and in workflow management. I have been an active team member in two EPSRC-funded projects whose goal has been to investigate principled ways of developing generic adaptive systems technology in the areas of query processing and workflow execution. Research Projects VADA: Principles and Architecture for Value-Added Data Systems (2015-2020, UK EPSRC Programme Grant). SemsorGrid4Env: applying semantic-grid ideas to allow mash-ups over diverse environmental sensor networks (2008-2011, European Union). Dataspaces: relying on user feedback to refine and improve the outcome of automated schema matching and schema mapping algorithms (2008-2011, UK EPSRC). An Infrastructure for Adaptive System Development (EPSRC EP/C537157/1) DIAS-MC: Design, Implementation and Adaptation of Sensor Networks Through Multi-Dimensional Co-Design (EPSRC EP/C014847/1) OGSA-DAI Two OGSA-DAI High-Performance Query Processing for The Grid MyGrid: Directly Supporting the e-Scientist Tripod: A Spatio-Temporal Object Database System ODESSA: An Object-Deductive Spatial System Architecture ROCK & ROLL: A Deductive and Object-Oriented Database Management System Research Students I have supervised to completion (mostly jointly) the following PhD students (as well as close to 30 MSc students in the course of my career): (2019) Lara Mazilu on mapping generation at scale (with Norman Paton). (2019) Alex Bogatu on dataset discovery in data lakes (with Norman Paton). (2018) Fernando Rene Sanchez Serrano on pay-as-you-go integration of linked data (with Norman Paton). (2018) Julio Cesar Cortes Rios on active learning approaches to feedback-drive improvement of dataspaces(with Norman Paton). (2017) Duhai Alshukaili on integration of linked data search results (with Norman Paton). (2016) Fernando Osorno Gutierrez on static generation of effective feedback collection plans for dataspaces (with Norman Paton). (2015) Klitos Christodoulou on pay-as-you-go data integration over linked open data (with Norman Paton). (2014) Alan Stokes on autonomic approaches to quality-of-service compliance in wireless sensor network query processing (with Norman Paton). (2013) Lu Mao on schema mapping for dataspaces (with Norman Paton). (2011) Chenjuan Guo on schema matching for dataspaces (with Norman Paton). (2010) Farhana Jabeen on distributed algorithms for spatial operations over sensor networks. (2010) Ixent Galpin on QoS-aware sensor-network query optimization (with Norman Paton). (2009) Christian Brenninkmeijer on a formally-defined sensor-network query language with empirically-validated analytical cost models (with Norman Paton). (2009) Kwanchai Eurviriyanukul on adaptive query processing (with Norman Paton). (2005) Veruska Aragão on service-oriented mediators. (2005) Ane Tröger on an in-silico experiment language over heterogeneous, autonomous, distributed scientific resources. (2004) Marcelo Aragão on combining induction and deduction for knowledge management in a logic programming setting. (2004) Seung-Hyun Jeong on efficient algorithms for spatio-temporal query processing (with Norman Paton). (2003) M. Akhtar Ali on a comprehensive solution to incrementally maintaining materialized OQL views (with Norman Paton). (2000) James Ohene-Dhan on personalizable hyperlink-based systems Teaching The courses I used to teach more often were: (Year 1) Fundamentals of Distributed Systems (Year 2) Fundamentals of Databases (Masters) Querying Data on the Web Admin The admin responsibilities I used to have were: Being PhD Tutor within the Research School. Helping to run the Mentoring Scheme for the department's research students. Running the annual Research Student's Symposium< Interviewing PhD students from progression. More Information This is my DBLP entry (with the best cross-links). Bearing in mind inflation due to false positives and duplicates, this is my Google Scholar Profile data. My Erdös number is 5. You can see the pages known to Google to have backlinks to this page. Some old photos, the 1998 photo, a 1993 portrait and its painter @ illugraphics :: http://www.illugraphics.co.uk/. If you like football, then let it be known that five stars stand above my heart, and every four years I hunger for one more. The University of Manchester is not responsible for the content of this page or those it links to.",
  "content_length": 7178,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:08"
}