{
  "name": "Alvin S. Lim",
  "homepage": "http://www.eng.auburn.edu/~lim",
  "status": "success",
  "content": "Alvin Lim Alvin S. Lim Associate Professor Department of Computer Sciences and Software Engineering 3101 Shelby Center Auburn University Auburn, AL 36849 Phone: (334) 844-6326 Fax: (334) 844-6329 E-mail: lim@eng.auburn.edu Ph.D. Computer Sciences, University of Wisconsin-Madison, 1993 Research Interests I am currently involved in the following research areas: self-organizing networks, cyber-physical systems, high-performance computing, wireless mobile networks, high performance networks, mobile computing and databases, reliable and dynamically reconfigurable distributed systems, complex software development, parallel processing, and performance measurements and analysis. In self-organizing networks, I am developing new techniques and protocols that allow network nodes to form spontaneous networks, assemble the network themselves, dynamically adapt to device failure and degradation, manage movement of network nodes, and react to changes in task and network requirements. In wireless mobile networks, I am investigating adaptive communication protocols for large-scale mobile information systems and  the performance implications of these protocols.  In mobile databases and computing systems, new mobile transactions and client-server caching techniques are being developed and studied.  For  reliable and dynamically reconfigurable distributed systems , we utilized efficient system facilities and tools for  detecting dependencies and  maintaining global state consistency.   We developed a complex software development environment  that allows designers to develop large applications with complex interaction. It contain tools for  analysis of liveness,  dependencies,  reliability and runtime adaptation. These development environment and operating mechanisms  form the common framework for evolutionary distributed and parallel applications. Publications Book Chapters \"Distributed Services for Wireless Sensor Networks,\" by Alvin Lim, Chapter in Handbook on Distributed Sensor Networks: Volume 2 Networking and Applications (Second Edition), edited by Richard R. Brooks and S. Iyengar, CRC Press, 2013. \"Wireless Sensor Network Testbed for Target Tracking,\" by Alvin Lim, Chapter in Handbook on Distributed Sensor Networks: Volume 2 Networking and Applications (Second Edition), edited by Richard R. Brooks and S. Iyengar, CRC Press, 2013. \"Smart Sensor Networks,\" by Alvin Lim, Chapter in Perception-Reason-Action Cycle: Models, Algorithms and Systems, edited by Vassilis Cutsuridis, John G. Taylor, Daniel Polani, Amir Hussain, and Naftali Tishby, Springer, 2010. \"Reliability Support in Sensor Networks,\" by Alvin Lim, Chapter in Handbook on Sensor Networks: Compact Wireless and Wired Sensing Systems, edited by Mohammad Ilyas and Imad Mahgoub, CRC Press, 2005. \"Distributed Services,\" by Alvin Lim, Chapter in Handbook on Frontiers in Distributed Distributed Sensor Networks, Richard R. Brooks and S. Iyengar (Editors), CRC Press, 2005. \"Voice over ATM,\" by Alvin Lim, Chapter 4.2 of the ATM Handbook, edited by F. Golshani and F. Groom, International Engineering Consortium, 2000, pp. 229-241. Journal Articles \"Efficient Authentication Approach for Highly Dynamic Vehicular Ad Hoc Networks,\" by Kanika Grover, Seungbae Lee, Alvin Lim, accepted to International Journal of Ad Hoc and Ubiquitous Computing, Inderscience Publishers. \"An Empirical Study on Ad hoc Performance of DSRC and WiFi Vehicular Communications ,\" by Seungbae Lee and Alvin Lim, accepted to International Journal of Distributed Sensor Networks, Hindawi Publishing Corporation. \"Enabling Actionable Analytics for Mobile Devices: Performance of Distributed Analytics on Hadoop Mobile Cluster ,\" by Seungbae Lee, K. Grover and Alvin Lim, Journal of Cloud Computing: Advances, Systems and Applications, Vol. 2, Oct. 2013, 2:15, Springer Publishers . \"A Survey of Broadcast Authentication Schemes for Wireless Networks,\" by Kanika Grover and Alvin Lim, accepted to Ad Hoc Networks (Journal), Elsevier Publisher . \"A Distributed Middleware for Self-configurable Wireless Sensor Networks,\" by Lei Zhang, Alvin Lim, Yi Pan, and Bin Wu, accepted to International Journal of Sensor Networks (IJSNET), Inderscience Publishers. \"Location-Preserved Contention Based Routing in VANETs ,\" by Qing Yang and Alvin Lim, accepted to Security and Communication Networks (Journal), John Wiley and Son, Ltd. \"Interconnection between IP Networks and Wireless Sensor Networks,\" by Alvin S. Lim, Brandon Keith Maharrey and Song Gao, accepted to International Journal of Distributed Sensor Networks, Hindawi Publishing Corporation. \"Jamming and Anti-jamming Techniques in Wireless Networks: A Survey,\" by Kanika Grover, Alvin Lim, and Qing Yang, accepted to Int. Journal of Ad Hoc and Ubiquitous Computing, Inderscience Publishers. \"An Empirical Study of Reliable Networking for Vehicular Networks Using IEEE 802.11n,\" by Seungbae Lee and Alvin Lim, accepted to International Journal of Vehicle Autonomous Systems, Inderscience Publishers. \"An Energy-Efficient Data Aggregation Algorithm for Wireless Sensor Networks,\" by Xundan Shi and Alvin Lim, Transactions on Computer and Communication Networks, Vol. 1, No. 1, 2011, Science Academy Publishers, UK. \"Motion-Based Region of Interest (ROI) Transmission with Variable Frame Rate over Wireless Multimedia Sensor Networks,\" by Jian Fang, Alvin Lim, and Qing Yang, IEEE Multimedia Technical Committee E-Letter, Vol. 6, No. 9, IEEE Communication Society, pages 43-47, September 2011. \"ACAR: Adaptive Connectivity Aware Routing for Vehicular Ad Hoc Networks in City Scenarios,\" by Qing Yang, Alvin Lim, Shuang Li, Jian Fang and Prathima Agrawal, ACM Mobile Networks and Applications (MONET), Vol. 15, No. 1, pp. 36-60, 2010. \"Improving QoS-based Routing by Limiting Interference in Lossy Wireless Sensor Networks,\" by Shuang Li, Alvin Lim, Cong Liu, International Journal of Wireless & Mobile Networks (IJWMN), Vol. 2, No. 4, pp. 44-58, Nov. 2010. \"Energy-Efficient Traffic-Aware Detour Trees for Geographical Routing,\" by Lei Zhang, Deying Li and Alvin Lim, International Journal of Computer Networks & Communications, Vol. 2, No. 1, pp. 154-168, Jan. 2010. \"Efficient Multi-Path Protocol for Wireless Sensor Networks,\" by Shuang Li, Raghu Neelisetti, Cong Liu and Alvin Lim, International Journal of Wireless & Mobile Networks (IJWMN), Vol. 2, No. 1, pp. 110-130, Feb. 2010. \"An Interference-Aware Routing Algorithm for Multimedia Streaming over Wireless Sensor Networks ,\" by Shuang Li, Raghu Kisore Neelisetti, Cong Liu, Santosh Kulkarni, and Alvin Lim, International Journal of Multimedia \\& Its Applications (IJMA), Vol. 2, No. 1, pp. 10-30, Feb. 2010. \"A High TCP Performance Rate Adaptation Algorithm for IEEE 802.11 Networks,\" by Kehao Zhang, Alvin Lim, Shaoen Wu, and Qing Yang, International Journal of Computer Networks & Communications, Vol. 2, No. 6, pp. 21-45, 2010. \"A Distributed System for Mad-cow Disease Monitoring and Tracking,\" by Lei Zhang, Alvin Lim, Hui Song, and Xinliang Zheng, International Journal of UbiComp (IJU), Vol. 1, No. 2, pp. 1-18, April 2010. \"End-to-End Connectivity Analysis in Vehicular Network Model for Improving Routing Performance,\" by Qing Yang, Alvin Lim, and Prathima Agrawal, Ad Hoc & Sensor Wireless Networks: An International Journal, \"GPSFR: GPS-Free Routing Protocol for Vehicular Networks with Directional Antennas,\" by Qing Yang, Alvin Lim, and Prathima Agrawal, International Journal of Wireless & Mobile Networks, Vol. 1, No. 2, pages 67-81, Nov. 2009. \"An Enhanced CPA Algorithm for Real-Time Target Tracking in Wireless Sensor Networks,\" by Qing Yang, Alvin Lim, Kenan Casey and Raghu-kisore Neelisetti, Int. Journal on Distributed Sensor Networks (IJDSN), Vol. 5, No. 5, pages 619-643, Taylor and Francis, 2009. \"An Empirical Study on Real-Time Target Tracking with Enhanced CPA Algorithm in Wireless Sensor Networks,\" by Qing Yang, Alvin Lim, Kenan Casey, Raghu Kisore Neelisetti, Ad Hoc & Sensor Wireless Networks: An International Journal  (AHSWN), Vol. 7, No. 3-4, pages 225-249, 2009. \"A Sensor Network Architecture for Tsunami Detection and Response,\" by Kenan Casey, Alvin Lim, Gerry Dozier, International Journal on Distributed Sensor Networks, Taylor and Francis, Vol 4, No. 1, January 2008, pages 28-43. \"Performance Evaluation of Adaptive Media Access Control Protocols for Pervasive Wireless Networks, Alvin Lim and Kui Mok, Journal of Interconnection Networks, Vol.3 No. 3, 2003. \"Distributed Services for Information Dissemination in Self-Organizing Sensor Networks \" by Alvin Lim, Special Issue on Distributed Sensor Networks for Real-Time Systems with Adaptive Reconfiguration, Journal of Franklin Institute, Elsevier Sciences Publisher, vol. 338, 2001, pp. 707-727. \"Parallel Program Excution Analysis for Performance Tuning\"by Alvin Lim, Nazir Warsi, Yufeng Chen, Journal on Neural,  Parallel and Scientific Computations, Vol. 6, No. 2, pp. 189-198, June 1998. \"Wireless Media Access Control for Highly Mobile Information Servers: Simulation and Performance Evaluation\" by Alvin Lim, Kui Mok, ACM Mobile Computing and Communication Review, Vol 1, No. 2, 1997. \"IPS-2: The Second Generation of a Parallel Program Measurement System\" by B. Miller, M. Clark, S. Kierstead, J. Hollingsworth, Alvin Lim, T. Torzewski, IEEE Transaction on Parallel and Distributed Systems, Vol.1, No.2, April 1990. Conference Papers \"Self-organizing TCP with Multiple Wireless LAN,\" by Song Gao and Alvin S. Lim, Workshop on Self-Organizing Wireless Access Networks for Smart City in IEEE Int. Conf. on Sensing, Communication, and Networking (SECON), June 30 - July 3, 2014, Singapore. \"MobSched: Customizable Scheduler for Mobile Cloud Computing,\" by Suraj Sindia*, Song Gao, Bobby Black, Alvin Lim, Vishwani Agrawal, Prathima Agrawal, Southeastern Symposium on System Theory, March 11, 2013, Waco, Texas. \"Driver Layer Approach to Time-of-Arrival Ranging in IEEE 802.11g Networks,\" by Ting Yang, Qing Yang, and Alvin Lim, IEEE",
  "content_length": 19883,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:11"
}