{
  "name": "Alysson Neves Bessani",
  "homepage": "https://ciencias.ulisboa.pt/perfil/anbessani",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo Contactos Departamento de Informática Sala/Gabinete 6.3.11 Ext. Principal 526311 Telefone Direto 217500394 Email anbessani@ciencias.ulisboa.pt Página Pessoal Carreira Docente Universitário Categoria Professor Catedrático Indicadores Orcid Google Scholar CiênciaVitae Currículo Resumido Alysson Bessani received his Ph.D. in Electrical Engineering from UFSC (Brazil) in 2006, was a visiting professor at Carnegie Mellon University (2010) and a visiting researcher at Microsoft Research Cambridge (2014). He coordinated/collaborated in eleven international projects and co-authored more than 100 peer-reviewed publications on dependability, security, Byzantine fault tolerance, and cloud storage. He is also the principal researcher behind the BFT-SMaRt consensus library and a co-founder of the Vawlt dependable & secure cloud storage startup (https://vawlt.io). Download currículo completo Interesses Científicos Computação Distribuída; Tolerância a Faltas; Segurança de Sistemas Scientific Interests Distributed Computing; Fault Tolerance; Systems Dependability and Security Publicações selecionadas Christian Berger, Hans P. Reiser, João Sousa, Alysson Bessani. AWARE: Adaptive Wide-Area Replication for Fast and Resilient Byzantine Consensus. IEEE Transactions on Dependable and Secure Systems. Accepted in October 2020. Miguel Garcia, Alysson Bessani, Nuno Neves. Lazarus: Automatic Management of Diversity in BFT Systems. Middleware’19: The ACM/IFIP International Middleware Conference. Davis, USA. December 2019. João Sousa, Alysson Bessani, Marko Vukolic. A Byzantine Fault-Tolerant Ordering Service for the Hyperledger Fabric Blockchain Platform. DSN'18: The IEEE/IFIP International Conference on Dependable Systems and Networks. June 2018. Alysson Bessani, João Sousa, Eduardo Alchieri. State Machine Replication for the Masses with BFT-SMaRt. DSN'14: The IEEE/IFIP International Conference on Dependable Systems and Networks. Atlanta, USA. June 2014. Alysson Bessani, Miguel Correia, Bruno Quaresma, Fernando André, Paulo Sousa. DepSky: Dependable and Secure Storage in a Cloud-of-Clouds. ACM Transactions on Storage. Vol. 9, Num. 4. ACM. November 2013. Ver todas as Publicações Prizes and Awards 2023-11-01 - Prémios Científicos Universidade de Lisboa/Caixa Geral de Depósitos (Caixa Geral de Depósitos)",
  "content_length": 2474,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:14"
}