{
  "name": "Amal Ahmed 0001",
  "homepage": "http://www.ccs.neu.edu/home/amal",
  "status": "success",
  "content": "Amal Ahmed Amal Ahmed Professor & Associate Dean for Graduate Programs Khoury College of Computer Sciences Northeastern University Ph.D. Computer Science Princeton University phone: 617.373.2076 email: amal at ccs.neu.edu office: 328 West Village H address: Northeastern University Khoury College of Computer Sciences 328 West Village H 440 Huntington Avenue Boston, MA 02115 Overview My research interests lie in correct and secure compilation across the software-hardware stack and safe language interoperability, including design of sound foreign-function interfaces (FFIs) and richly typed compiler intermediate languages to support safe mixing of code from different languages. My work makes use of semantics and type systems for reasoning about imperative and probabilistic programming languages, multi-language systems, security, concurrency, compiler correctness, gradual typing, and provenance. CV (Oct 2025) Group website: SILC (Secure Interoperability, Languages, and Compilers) Northeastern PRL (Programming Research Lab) Research Group I am very fortunate to work with an amazing group! Olek Gierczak (PhD) Andrew Wagner (PhD) John Li (PhD, co-advised with Steven Holtzen) Michelle Thalakottur (PhD, co-advised with Frank Tip) Brianna Marshall (PhD) Conrad Zimmerman (PhD) Elan Semenova (PhD) Zack Eisbach (undergrad) Owen Duckham (undergrad) Ari Prakash (undergrad) Alumni Ryan Doenges (Postdoc, Sep 2023-Aug 2025)) Zoe Paraskevopoulou (Postdoc, CI Fellow 2020, Oct 2020-Dec 2022) Daniel Patterson (PhD, Aug 2022, Interoperability Through Realizability: Expressing High-level Abstractions using Low-level Code, now Assistant Teaching Prof. at Northeastern Univ.) Max New (PhD, Oct 2020, A Semantic Foundation for Sound Gradual Typing, now Assistant Prof. at U.Michigan, Ann Arbor) William Bowman (PhD, Nov 2018, Compiling with Dependent Types, now Assistant Prof. at UBC) Gabriel Scherer (Postdoc, Jan 2017-Jul 2018, now Permanent Researcher at Inria) Aaron Weiss (MS, Apr 2022) Hyeyoung Shin (MS, Apr 2019) Phillip Mates (MS, Dec 2014) Jamie Perconti (MS, Apr 2014) Jose Sulaiman Manzur (undergrad, 2022-2024) Noble Mushtak (undergrad, 2021-2024) Michael Fitzgibbons (undergrad, 2019-2022) Dustin Jamner (undergrad, 2015-2020, 2020 NSF GRFP recipient, now PhD student at MIT) Jay Kruer (Reed College undergrad, Jan-Jun 2019) Nick Rioux (undergrad, 2013-2018, 2018 NSF GRF recipient, now PhD student at U.Penn) Matthew Kolosick (undergrad, 2013-2018, now PhD student at UCSD) Durward Benham (undergrad, 2013-2014) Outreach and Education Speaker, ECOOP and ISSTA Summer School 2018: Compiler Verification for a Multi-Language World Speaker, ECOOP Summer School 2017: Compiler Verification for a Multi-Language World Career Awardee talk, NSF CISE CAREER Workshop 2016 Panelist, MIT Path of Professorship Workshop 2016 Lecturer, Oregon Programming Languages Summer School OPLSS 2024: Semantic Type Soundness and Language Interoperability (5 lectures) OPLSS 2023: Logical Relations (4 lectures) OPLSS 2019: Secure Compilation (4 lectures) OPLSS 2017: Correct and Secure Compilation for Multi-Language Software (4 lectures) OPLSS 2016: Logical Relations and Compiler Verification (4 lectures) OPLSS 2015: Logical Relations (5 lectures) OPLSS 2013: Logical Relations (6 lectures) OPLSS 2012: Logical Relations (5 lectures) OPLSS 2011: Logical Relations (5 lectures) Co-organizer, Oregon Programming Languages Summer School OPLSS 2017: A Spectrum of Types OPLSS 2014: Types, Logic, Semantics, and Verification OPLSS 2013: Types, Logic, and Verification Speaker, Programming Languages Mentoring Workshop PLMW @ ICFP 2020: Managing your Research, your Advisor, your PhD PLMW @ PLDI 2020: Compositional Compiler Correctness PLMW @ ICFP 2019: Managing your Research, your Advisor, your PhD PLMW @ ICFP 2017: Compositional Compiler Correctness PLMW @ POPL 2013: Logical Relations: A Powerful Hammer for Your Research Toolbox PLMW @ POPL 2012: Work-Life Balance for Computer Scientists Co-organizer, Programming Languages Mentoring Workshop PLMW @ ICFP 2016 PLMW @ POPL 2014 Lecturer, PhD School at CIRM 2014: Syntax and Semantics of Low-Level Programs (6 lectures) Professional Activities Keynote, ESOP 2025,May 2025 Invited Speaker, WiL 2024, co-located with LICS, Jul 2024 Keynote, OOPSLA 2023, Oct 2023 Keynote, PriSC 2023, Jan 2023 Keynote, LICS 2022, Aug 2022 Keynote, CSF 2020: Secure Compilation: Challenges for the Next Decade, Jun 2020 Keynote, PPDP 2019: Semantic Foundations for Gradual Typing, Oct 2019 Invited Speaker, PurPL Fest 2019: Compiler Verification: The Next Generation, Sep 2019 Invited Speaker, MFPS 2019: The Next 700 Compiler Correctness Theorems, Jun 2019 Keynote, APLAS 2018: Compositional Compiler Verification for a Multi-Language World, Dec 2018 Keynote, Strange Loop 2018: All the Languages Together, Sep 2018 Co-organizer, Dagstuhl Seminar: Secure Compilation, May 2018 Editorial Board: Journal of Functional Programming (JFP), Jan 2017–present Editorial Board: Mathematical Structures in Computer Science (MSCS), Jan 2016–present Member: IFIP Working Group 2.8 (Functional Programming), 2014–present Keynote, FSCD 2016: Compositional Compiler Verification for a Multi-Language World Plenary address, MFPS 2010: Stepping into the Future: Logical Relations Beyond Toy Languages Co-organizer, Dagstuhl Seminar: Modeling, Controlling, and Reasoning About State, Sep 2010 Co-organizer, Dagstuhl Seminar: Types, Logics and Semantics for State, Feb 2008 Program committees LICS 2025 MFPS 2024 POPL 2023 (PC chair) OOPSLA 2022 (PC co-chair), POPL 2022, FSCD 2022 PriSC 2021 WGT 2020, PLDI 2020 (EPC), OOPSLA 2020, PLAS 2020 PLDI 2019, LOLA 2019, ICW 2019 ESOP 2018 (PC chair), PriSC 2018, TYPES 2018, WoSSCA 2018, ICFP 2018 (ERC) LICS 2016, ICFP 2016 (ERC), TFP 2016 POPL 2015, ICFP 2015, STOP 2015 LOLA 2014, DTP 2014 LICS 2013, TaPP 2013, PLDI 2013 (ERC) APLAS 2012, Haskell 2012, HOPE 2012 (co-chair), LOLA 2012 (co-chair), PLPV 2012 ML 2011, MFPS 2011, PLDI 2011 (ERC), FOSSACS 2011, STOP 2011 VS-Theory 2010, LOLA 2010, ESOP 2010 ICFP 2009, TLDI 2009 (chair) POPL 2008 PLAS 2006, SPACE 2006 Steering committees PriSC (Jun 2023–present) POPL (Jan 2022–present) SPLASH (Oct 2022–present) ETAPS (Oct 2016–2018) ESOP (Sep 2016–2022) PLMW (Jan 2014–2022), Steering Committee Chair (Jan 2019–Jan 2020) ICFP (Sep 2008–Sep 2012) TLDI (Jan 2009–Oct 2012) Teaching CS 2500  Fundamentals of CS: Intro to Programming and Computing (F21-Accelerated, F20-Accelerated, F20, F19-Accelerated, F18-Accelerated, F16, S14, F14, F13, F12, F11) CS 7400  Intensive Principles of Programming Languages (S20, S17, S16, S15) CS7470  Seminar in PL: Logical Relations (S25) CS 7480  Special Topics in PL: Gradual Typing and Principled Language Interoperability (S19) CS 7480  Special Topics in PL: Types, Contracts, Gradual Typing, and Compiler Correctness (F15) CS 4410/6410  Compilers (S13) CS 7480  Special Topics in PL: Type Systems (S12) B629 Integrating Static and Dynamic Typing (F10, Indiana University) B629 Language-Based Approaches to Security (S10, Indiana University) B522 Programming Language Foundations (F09, Indiana University) CMSC 336 Type Systems for Programming Languages (Winter08, U Chicago) Publications From Linearity to Borrowing. Andrew Wagner, Olek Gierczak, Brianna Marshall, John M. Li, and Amal Ahmed. Proc. ACM Program. Lang. 9, OOPSLA2, Article 415, 27 pages, Oct 2025. Realistic Realizability: Specifying ABIs You Can Count On. Andrew Wagner, Zachary Eisbach, and Amal Ahmed. Proc. ACM Program. Lang. 8, OOPSLA2, Article 315, 30 pages, Oct 2024. A Nominal Approach to Probabilistic Separation Logic. John M. Li, Jon Aytac, Philip Johnson-Freyd, Amal Ahmed, Steven Holtzen. Proc. ACM/IEEE Symposium on Logic in Computer Science (LICS'24), Tallinn, Estonia, July 2024. RichWasm: Bringing Safe, Fine-Grained, Shared-Memory Interoperability Down to WebAssembly. Michael Fitzgibbons, Zoe Paraskevopoulou, Noble Mushtak, Michelle Thalakottur, Jose Sulaiman Manzur, Amal Ahmed. Proc. ACM Program. Lang. 8, PLDI, Article 214, Pages 1656-1679, 2024. Gradually Typed Languages Should be Vigilant!. Olek Gierczak, Lucy Menon, Christos Dimoulas, and Amal Ahmed. Proc. ACM Program. Lang. 8, OOPSLA1, Article 125, 29 pages, Apr 2024. Semantic Encapsulation Using Linking Types. Daniel Patterson, Andrew Wagner, and Amal Ahmed. In ACM SIGPLAN International Workshop on Type-Driven Development (TyDe '23), Seattle, Washington, September 2023. Lilac: A Modal Separation Logic for Conditional Probability. John M. Li, Amal Ahmed, and Steven Holtzen. Proc. ACM Program. Lang. 7(PLDI):148-171 (2023). ANF Preserves Dependent Types up to Extensional Equality. Paulette Koronkevich, Ramon Rakow, Amal Ahmed, and William J. Bowman. Journal of Functional Programming, 32, E22, 2022. Semantic Soundness for Language Interoperability. Daniel Patterson, Noble Mushtak, Andrew Wagner, Amal Ahmed. In ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI'22), San Diego, California, June 2022. Gradual Type Theory. Max S. New, Daniel R. Licata, Amal Ahmed. Journal of Functional Programming, 31, E21, 2021. Graduality and Parametricity: Together Again for the First Time. Max S. New, Dustin Jamner, and Amal Ahmed. In ACM SIGPLAN Symposium on Principles of Programming Languages (POPL '20), New Orleans, Louisiana, January 2020. Technical appendix, November 2019. Under Control: Compositionally Correct Closure Conversion with Mutable State. Phillip Mates, Jamie Perconti, and Amal Ahmed. In 21st International Symposium on Principles and Practice of Declarative Programming (PPDP '19), Porto, Portugal, October 2019. The Next 700 Compiler Correctness Theorems (Functional Pearl). Daniel Patterson and Amal Ahmed. In 24th ACM SIGPLAN International Conference on Functional Programming (ICFP '19), Berlin, Germany, August 2019. Formal Approaches to Secure Compilation: A Survey of Fully Abstract Compilation and Related Work. Marco Patrignani, Amal Ahmed, and Dave C",
  "content_length": 20050,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:12"
}