{
  "name": "Amanda Randles",
  "homepage": "http://randleslab.pratt.duke.edu",
  "status": "success",
  "content": "Randles Lab Skip to main content Welcome to the Randles Lab The Randles Lab develops high performance computational platforms and algorithms to advance biomedical research, uncover new insights into complex biological systems, and improve human health. Our work centers on multiscale, image-based digital twins of the human vasculature that combine physics-based modeling, AI, and clinical data to deliver accurate, personalized predictions of disease progression and treatment outcomes.We are extending both the spatial and temporal reach of high-fidelity fluid–structure–interaction simulations through innovations such as the Adaptive Physics Refinement (APR) algorithm, which couples subcellular-scale modeling to organ-level blood flow, and the Longitudinal Hemodynamic Mapping (LHM) algorithm, which enables simulations spanning millions of heartbeats. These methods are powered by HARVEY, our massively parallel blood flow solver, and run efficiently on some of the world’s largest supercomputers and scalable cloud infrastructure.Applications range from guiding coronary interventions, monitoring carotid plaque, and predicting heart failure risk to modeling rare cancer cell transport in realistic blood environments. We work closely with physicians and experimental collaborators in a continuous feedback loop—using clinical and in vitro measurements to refine models, and using simulations to generate actionable insights for care and discovery.We are committed to fostering a collaborative, inclusive environment where researchers from diverse backgrounds can tackle challenging problems at the interface of computation and medicine. Through innovative algorithms, scalable platforms, and close clinical integration, our goal is to educate the next generation of biomedical engineers and make a lasting impact on patient care. Image Lab photo: William Ladd, Emily Rakestraw, Amanda Randles, Samreen Mahmud, Cyrus Tanade, Junyu Nan, Daniel Puleri, David Urick, Aristotle Martin, Sayan Roychowdhury, Christopher Jensen, Ayman Yousef, Simba Chidyagwai, Saquan Anthony*Hero image created by Joseph Insley, Argonne National Laboratory. In the News November 13, 2025 | Communications of the ACM Let a Digital Twin Predict Your Heart’s Health What we do:From cell to system: Simulations span subcellular rare-cell transport to full-vessel hemodynamicsPowered by HARVEY: Massively parallel solver running on top supercomputers and the cloudAlgorithms: Adaptive Physics Refinement (APR) for spatial detail, Longitudinal Hemodynamic Mapping (LHM) for millions of heartbeatsAI-enabled: Accelerated prediction, biomarker discovery, and real-time decision toolsImpact: Personalized monitoring, surgical planning, and population-scale health insights High Performance ComputingAn underlying drive for all research in the lab is to leverage large-scale supercomputers to enable studies of an unprecedented scale. Vascular Digital TwinsWe create AI-driven cardiovascular digital twins that non-invasively model each patient’s heart and vessels. These predictive tools enable proactive, personalized care by simulating interventions, tracking health over time, and guiding treatment decisions. Cellular Mechanics and TransportWe develop and use adaptive, multiscale digital twin models to track cancer cells as they travel through the body’s blood vessels. Our AI-enabled APR framework pinpoints and simulates the critical moments that drive metastasis, guiding detection, diagnosis, and targeted therapies. Research Overview Cellular Mechanics and Transport Vascular Digital Twins High Performance Computing People Current Members Alumni Publications Patents Funding Education News Photos Jobs Contact",
  "content_length": 3697,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:17"
}