{
  "name": "Amanda Prorok",
  "homepage": "https://www.proroklab.org",
  "status": "success",
  "content": "proroklab Home Team Join Us News Publications Videos The Prorok Lab at the University of Cambridge develops solutions for collective intelligence in multi-robot and multi-agent systems. Our aim is to extend single robot capabilities through collaborative strategies. We develop data-driven and hybrid approaches to hard coordination problems, and are interested in enabling fast on-line decision-making, as typically required in robotics applications. Research All intelligence is collective intelligence… Our research builds on this premise, and focuses on synthesizing decentralized agent controllers and interaction policies that lead to cooperative and collaborative systems. Many of our methods build on Graph Neural Network (GNN) architectures, which provide a well-suited inductive bias for networked multi-agent teams and swarms. We are also interested in developing data-driven or hybrid approaches that find near-optimal solutions to hard coordination problems involving resource allocation, path finding, or graph optimization. Our solutions enable fast on-line decision-making, as typically required in robotics applications. As part of our work, we develop sim-to-real methods that facilitate the transfer of policies learned in simulation to real world systems. Paper Highlights A. Prorok, Extending robot minds through collective learning, Science Robotics M. Bettini, R. Kortvelesy, A. Prorok, Controlling Behavioral Diversity in Multi-Agent Reinforcement Learning, ICML 2024 J. Blumenkamp, S. Morad, J. Gielis, A. Prorok, CoViS-Net: A Cooperative Visual Spatial Foundation Model for Multi-Robot Applications, CoRL 2024 M. Bettini, A. Shankar,  A. Prorok, Heterogeneous Multi-Robot Reinforcement Learning, AAMAS 2023 Z. Gao, A. Prorok, Environment Optimization for Multi-Agent Navigation, IEEE ICRA 2023 News Highlights Prorok Lab on BBC Click! Watch here TEDxOxford talk by Amanda Prorok January 2024 Watch here Best Paper Award at ICRA 2023 workshop for Jan Blumenkamp Read More Follow us on YouTube Sign Up Follow us on Twitter Sign Up Find us on Github Here University of Cambridge William Gates Building 15 JJ Thompson Avenue Cambridge, CB3 0FD UK asp45@cam.ac.uk © 2022 Prorok Lab.",
  "content_length": 2203,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:17"
}