{
  "name": "Amanda Smith",
  "homepage": "https://www.kcl.ac.uk/people/amanda-coles",
  "status": "success",
  "content": "Amanda Coles | King's College London Skip to main contentDr Amanda Coles Senior Lecturer in Computer ScienceResearch interestsComputer scienceContact details+44 020 7848 7155amanda.coles@kcl.ac.ukBiographyAbout EPSRC Post-Doctoral Research Fellowship holder 2010-2013 Research Interests Artificial Intelligence Planning with preferences; Planning with continuous numeric change; Planning under uncertainty; AI Planning Applications. More Information Research Profile Research Funding Personal Website PublicationsResearchResearchReasoning and PlanningThe group focuses on the fundamental AI challenge of creating, representing and reasoning. Trusted Autonomous Systems HubThe Trusted Autonomous Systems Hub develops the trustable autonomous systems of tomorrow. NewsNews19 March 2019Royal Party opens Bush HouseHer Majesty The Queen, accompanied by Her Royal Highness The Duchess of Cambridge, met robotics and artificial intelligence researchers from the Department of...Technology & Science16 May 2016Dr Coles invited to give Early Career Spotlight talk at IJCAI 2016Dr Amanda Coles, lecturer in the Planning Group of the Department of Informatics, has been invited to speak at the special track of \"Early Career Spotlight\"...Technology & SciencePublicationsResearchNewsResearchReasoning and PlanningThe group focuses on the fundamental AI challenge of creating, representing and reasoning. Trusted Autonomous Systems HubThe Trusted Autonomous Systems Hub develops the trustable autonomous systems of tomorrow. News19 March 2019Royal Party opens Bush HouseHer Majesty The Queen, accompanied by Her Royal Highness The Duchess of Cambridge, met robotics and artificial intelligence researchers from the Department of...Technology & Science16 May 2016Dr Coles invited to give Early Career Spotlight talk at IJCAI 2016Dr Amanda Coles, lecturer in the Planning Group of the Department of Informatics, has been invited to speak at the special track of \"Early Career Spotlight\"...Technology & Science(N)7.03Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering Sciences",
  "content_length": 2143,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:18"
}