{
  "name": "Amanda Clare",
  "homepage": "https://www.aber.ac.uk/en/cs/staff-profiles/listing/profile/afc",
  "status": "success",
  "content": "Staff profiles  :\t\tDepartment of Computer Science ,\t\tAberystwyth UniversityDr Amanda Clare BA (Oxon), MSc( Edinburgh), PhD (Aberytwyth) Senior Lecturer Department of Computer Science Contact Details Email: afc@aber.ac.uk ORCID: 0000-0001-8315-3659 Office: E33, Llandinam Building Phone: +44 (0) 1970 622429 Personal Website: http://users.aber.ac.uk/afc Twitter: @afcaber Google Scholar: https://scholar.google.co.uk/citations?user=dsmbrisAAAAJ Research Portal Profile Personal Pronouns: she, her Profile My research is in data analysis and data science, and in particular in bioinformatics and natural language processing/text analysis, but also the analysis of sequences in general, including time series and in the detection of anomalies. I am interested in all genomics questions and in particular, in what we can do with computers (algorithms, data structures and artificial intelligence) to help answer these questions. DNA/RNA sequencing allows us to inspect the genetic composition of microbes, animals, plants and viruses, but after we have obtained the sequences, what can we learn? How are communities changing over time? How are enzymes within a community specialised for different roles? How can we detect genes in communities of organisms that have never been cultured? I am interested in data and in comparing sets of data, whether genomic or text or sequences or counting categories, in understanding distributions, outliers and errors, and summarising the contents. Teaching Module Coordinator CS24520 - Scientific Python Lecturer MAM9060 - Dissertation CS39440 - Major Project CS31920 - Advanced Algorithms CS24520 - Scientific Python CS18120 - Study Skills for Computer Science Coordinator CS24520 - Scientific Python Research My research is in data analysis and data science, and in particular in bioinformatics and natural language processing/text analysis, but also the analysis of sequences in general, including time series and in the detection of anomalies. I am interested in all genomics questions and in particular, in what we can do with computers (algorithms, data structures and artificial intelligence) to help answer these questions. DNA/RNA sequencing allows us to inspect the genetic composition of microbes, animals, plants and viruses, but after we have obtained the sequences, what can we learn? How are communities changing over time? How are enzymes within a community specialised for different roles? How can we detect genes in communities of organisms that have never been cultured? I am interested in data and in comparing sets of data, whether genomic or text or sequences or counting categories, in understanding distributions, outliers and errors, and summarising the contents. Publications Oladele, DB, Swain, M, Robinson, G, Clare, A & Chalmers, RM 2025, 'A review of recent Cryptosporidium hominis and Cryptosporidium parvum gp60 subtypes', Current Research in Parasitology and Vector-Borne Diseases, vol. 8, 100292. 10.1016/j.crpvbd.2025.100292Major, L, Clare, A, Daykin, J, Mora, B & Zarges, C 2025, 'Heuristics for the run-length encoded Burrows–Wheeler transform alphabet ordering problem', Journal of Heuristics, vol. 31, no. 1, 11. 10.48550/arXiv.2401.16435, 10.1007/s10732-025-09548-3Dimonaco, NJ, Clare, A, Kenobi, K, Aubrey, W & Creevey, CJ 2023, 'StORF-Reporter: Finding genes between genes', Nucleic Acids Research, vol. 51, no. 21, pp. 11504-11517. 10.1093/nar/gkad814, 10.6084/m9.figshare.23257871Dimonaco, N, Aubrey, W, Clare, A, Kenobi, K & Creevey, C, StORF-Reporter, 2023, Software, Zenodo. 10.5281/zenodo.8335335Dimonaco, NJ, Aubrey, W, Kenobi, K, Clare, A & Creevey, CJ 2022, 'No one tool to rule them all: Prokaryotic gene prediction tool annotations are highly dependent on the organism of study', Bioinformatics, vol. 38, no. 5, btab827, pp. 1198-1207. 10.1093/bioinformatics/btab827More publications on the Research Portal",
  "content_length": 3893,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:14"
}