{
  "name": "Aman Arora 0001",
  "homepage": "https://search.asu.edu/profile/4860216",
  "status": "success",
  "content": "Aman Arora | ASU Search Aman Arora Assistant Professor, School of Computing and Augmented Intelligence [email protected] Phone: 480-727-5324 ‌ 660 S. Mill Avenue Suite 203-09 Tempe, AZ 85281 Mail code: 8809 Campus: Tempe ‌ Long Bio Aman Arora is an assistant professor in the School of Computing and Augmented Intelligence in the Ira A. Fulton Schools of Engineering. His research interests are in the areas of reconfigurable computing, domain-specific acceleration and machine learning. He has more than 10 years of experience in the semiconductor industry. Education PhD The University of Texas at Austin Research Website URL https://labs.engineering.asu.edu/advent/ Research Interests Reconfigurable Computing, Hardware Acceleration of Machine Learning, Non-traditional Computing (e.g. Processing In Memory), Using Machine Learning for CAD/EDA Courses 2026 Spring Course Number Course Title CSE 493 Honors Thesis EEE 599 Thesis CEN 595 Continuing Registration CEN 792 Research CEN 795 Continuing Registration CEN 690 Reading and Conference CEN 571 Reconfigurable Computing CSE 598 Special Topics CSE 494 Special Topics 2025 Fall Course Number Course Title CSE 320 Design/Syn Digital Hardware EEE 599 Thesis CSE 492 Honors Directed Study EEE 592 Research CSE 580 Practicum CEN 792 Research CEN 599 Thesis CEN 580 Practicum CEN 790 Reading and Conference CEN 799 Dissertation CSE 320 Design/Syn Digital Hardware CSE 320 Design/Syn Digital Hardware CEN 690 Reading and Conference 2025 Summer Course Number Course Title CEN 595 Continuing Registration CEN 584 Internship CSE 584 Internship CEN 598 Special Topics CSE 598 Special Topics CEN 590 Reading and Conference 2025 Spring Course Number Course Title CEN 595 Continuing Registration CEN 790 Reading and Conference CEN 599 Thesis CEN 584 Internship CEN 792 Research CEN 799 Dissertation CEN 792 Research CSE 494 Special Topics CSE 524 Machine Learning Acceleration CEN 524 Machine Learning Acceleration 2024 Fall Course Number Course Title CSE 320 Design/Syn Digital Hardware CSE 493 Honors Thesis CSE 792 Research CEN 792 Research CEN 599 Thesis CEN 590 Reading and Conference CSE 320 Design/Syn Digital Hardware CSE 320 Design/Syn Digital Hardware CSE 792 Research CEN 690 Reading and Conference CEN 792 Research 2024 Summer Course Number Course Title CEN 792 Research 2024 Spring Course Number Course Title CSE 492 Honors Directed Study CEN 595 Continuing Registration CEN 790 Reading and Conference CEN 599 Thesis CEN 580 Practicum CEN 584 Internship CEN 792 Research CEN 799 Dissertation CEN 590 Reading and Conference CEN 795 Continuing Registration CEN 690 Reading and Conference CEN 792 Research CEN 790 Reading and Conference CEN 580 Practicum CSE 598 Special Topics CEN 598 Special Topics CSE 494 Special Topics 2023 Fall Course Number Course Title CSE 320 Design/Syn Digital Hardware CSE 792 Research CEN 792 Research CEN 599 Thesis CSE 320 Design/Syn Digital Hardware CSE 320 Design/Syn Digital Hardware CSE 792 Research CEN 792 Research Expertise Areas Computer Engineering",
  "content_length": 3039,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:13"
}