{
  "name": "Amarda Shehu",
  "homepage": "https://cs.gmu.edu/~ashehu",
  "status": "success",
  "content": "Welcome to the Shehu Laboratory | Welcome to the Shehu Laboratory Welcome to the Shehu Laboratory Home Publications Research Tools Funding Teaching Service Members Meetings Welcome to the Shehu Laboratory Amarda Shehu Vice President & Chief AI Officer, George Mason University Associate Dean for Research, College of Engineering & Computing Professor, Computer Science, School of Computing AI & Interdisciplinary Scientist and Technologist Entrepreneur & Startup Advisor — Founder/Co-founder of AI-first ventures; advisor to startups and companies on AI strategy and AI×sector advancement in biotechnology, genomics, and drug discovery At a Glance I lead enterprise AI strategy and an award-winning lab, converting foundational AI into scalable capability across research, education, workforce, and operations. 200+ peer-reviewed publications; Fellow (AIMBE); Member (VASEM); Senior Member (IEEE). Founder, AI² Nexus — a university-wide ecosystem for AI innovation and integration. Founder, AI-in-Government Council — national coalition of government & industry CXOs advancing responsible AI. Centers founded/co-founded — CAIEC; ISEAI; CoE in Gov Cyber Resilience; Center for Human–Machine Partnerships. Creator, PatriotAI — secure campus access to 1,800+ generative-AI models. Academic innovation — Virginia’s first M.S. in AI; UNIV 182 “AI for All”; Ethics & AI minor. What We Do We build knowledge-grounded AI: methods that connect AI theory and algorithms to enable foundational technology and advancement across sectors. Current thrusts include deep generative models for proteins and small molecules, optimization for complex loss landscapes, and large language and multimodal foundation models for natural-language understanding, bio/health informatics, materials discovery, and more. Earlier work advanced search and optimization for exploring protein structure spaces under rugged energy landscapes—insights that now inform modern scientific ML. Papers are the best entry point; audios below provide a lighter intro. Audio Overviews (short intros) Biology & Molecular Modeling Protein foundation models (3–4 min) Small-molecule generation with property control (3–4 min) GenAI for protein structural plasticity (3–4 min) Methods & Applications Beyond Biology Optimization on rugged energy landscapes Loss landscapes in deep learning AI for civil engineering AI policy & governance (principles to practice) Lab Photos and Fun Activities Anowarul becomes Dr. Kabir Manpriya becomes Dr. Dua Toki becomes Dr. Inan Fardina becomes Dr. Alam Parastoo becomes Dr. Kamranfar Taseef becomes Dr. Rahman All Masked-Up Lab Meeting Irina Defends Ph.D. Kevin becomes Dr. Molloy COS and VSE 2014 Undergraduate Events Mason 2014 Emerging Awardees Event BCB 2014 Brian becomes Dr. Olson BICoB 2013 BCB 2013 Uday becomes Dr. Kamath BIBM and CSBW 2012 BIBM and CSBW 2011 Chantilly Visit Irina becomes Dr. Hashmi Students Current Students Past Students Copyright (c) 2009 Amarda Shehu. All rights reserved. Designed by Brian Olson",
  "content_length": 3018,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:18"
}