{
  "name": "Ambuj Tewari",
  "homepage": "https://ambujtewari.github.io",
  "status": "success",
  "content": "Home Page of Ambuj Tewari Ambuj Tewari | अम्बुज तिवारी Professor Department of Statistics Department of Electrical Engineering and Computer Science (by courtesy) University of Michigan, Ann Arbor tewaria@umich.edu My primary area of research is artificial intelligence (AI) with a focus on machine learning (ML). My research group focuses on rigorous theoretical analysis of AI and ML models and algorithms. We also work on challenging real-world applications especially in chemistry and psychiatry. My work has been supported by an NSF CAREER grant (2015), a Sloan Research Fellowship (2017), an Adobe Data Science Research Award (2020), and a Facebook Research Award (2021). In 2022, I was named as a Fellow of the Institute of Mathematical Statistics. In 2023, I was awarded an Early Career Award in Statistics and Data Sciences by the International Indian Statistical Association. I serve on the editorial boards of Journal of Machine Learning Research and Statistical Science. I was born in Agra, India, home of the Taj Mahal. My family traces its roots to the old city of Kannauj, the perfume capital of India. My alma maters are IIT Kanpur (B.Tech., 2002) and UC Berkeley (M.A., 2005 and Ph.D., 2007. Advisor: Peter Bartlett). I was a research assistant professor at TTIC from 2008 to 2010. From 2010 to 2012, I was a post-doctoral fellow at UT Austin where I worked with Inderjit Dhillon and Pradeep Ravikumar. My younger brother Anuj Tewari is Head of Research, Google AI Overviews and Search Result Page. Activities at U-M I'm involved with: Eric and Wendy Schmidt AI in Science Postdoctoral Fellowship Program MaCSS Scholars Program Measuring, Modeling, and Mapping Microplastics in the Atmosphere of Michigan (M4AM): LSA News, The University Record, The Michigan Daily Michigan AI Lab Michigan Center for Applied and Interdisciplinary Mathematics (MCAIM) Michigan Institute for Data & AI in Society (MIDAS) Mobile Health for Mental Health: Intern Health Study (IHS) Mobile Health for Mental Health: COMPASS/PROMPT Study Teaching and Researching Machine Olfaction (1st place in DREAM Olfactory Mixtures Prediction Challenge) Some non-technical articles I've written for The Conversation: When fake data is a good thing – how synthetic data trains AI to solve real problems What is reinforcement learning? An AI researcher explains a key method of teaching machines – and how it relates to training your dog What’s that microplastic? Advances in machine learning are making identifying plastics in the environment more reliable Why building big AIs costs billions – and how Chinese startup DeepSeek dramatically changed the calculus (related interview with Michigan Public Radio) Nobel Prize in physics spotlights key breakthroughs in AI revolution − making machines that learn AI is cracking a hard problem – giving computers a sense of smell (related interview with KCBS radio) Students and Postdocs In 2025, I received an LSA Outstanding Contributions to Undergraduate Education Award. Here are my current and past courses. A BLOG@CACM article on how we scaled deep learning education in the College of LSA is here. Publications ( Google Scholar, Semantic Scholar, arXiv, DBLP ) Talks Code Office Address 270 West Hall 1085 South University Ann Arbor, MI 48109-1107 USA Mailing Address Statistics Dept/Ambuj Tewari Randall Lab 450 Church St Ann Arbor, MI 48109-1040 USA Phone: +1-734-615-0928 Fax: +1-734-763-4676",
  "content_length": 3426,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:19"
}