{
  "name": "Ameet Talwalkar",
  "homepage": "https://www.cs.cmu.edu/~atalwalk",
  "status": "success",
  "content": "Ameet Talwalkar Ameet Talwalkar Home Research Group Teaching Contact I am an associate professor in the Machine Learning Department at CMU and Chief Scientist at Datadog. My current research interests include AI for science, human-AI interaction, and developing specialized models and agents. Here is my Google scholar page and formal bio. Selected Recent Work This Time is Different: An Observability Perspective on Time Series Foundation Models (pdf, blog) B. Cohen, E. Khwaja, Y. Doubli, S. Lemaachi, C. Lettieri, C. Masson, H. Miccinilli, E. Ramé, Q. Ren, A. Rostamizadeh, J. Ogier du Terrail, A.-M. Toon, K. Wang, S. Xie, Z. Xu, V. Zhukova, D. Asker, A. Talwalkar, O. Abou-Amal Copilot Arena: A Platform for Code LLM Evaluation in the Wild (pdf, blog) W. Chi, V. Chen, A. Angelopoulos, W. Chiang, A. Mittal, N. Jain, T. Zhang, I. Stoica, C. Donahue, A. Talwalkar International Conference on Machine Learning (ICML), 2025 Specialized Foundation Models Struggle to Beat Supervised Baselines (pdf) Z. Xu, R. Gupta, W. Cheng, A. Shen, J. Shen, A. Talwalkar, M. Khodak International Conference on Learning Representations (ICLR), 2025 ScribeAgent: Towards Specialized Web Agents Using Production-Scale Workflow Data (pdf, blog) J. Shen, A. Jain, Z. Xiao, I. Amlekar, M. Hadji, A. Podolny, A. Talwalkar UPS: Towards Foundation Models for PDE Solving via Cross-Modal Adaptation (pdf) J. Shen, T. Marwah, A. Talwalkar Transactions on Machine Learning Research (TMLR), 2024 Cross-Modal Fine-Tuning: Align then Refine (pdf) J. Shen, L. Li, L. Dery, C. Staten, M. Khodak, G. Neubig, A. Talwalkar International Conference on Machine Learning (ICML), 2023 Zeno: An Interactive Framework for Behavioral Evaluation of Machine Learning (pdf, website, blog) A. Cabrera, E. Fu, D. Bertucci, K. Hostein, A. Talwalkar, J. Hong, A. Perer Conference on Human Factors in Computing Systems (CHI), 2023 Efficient Architecture Search for Diverse Tasks (pdf, blog) J. Shen, M. Khodak, A. Talwalkar Neural Information Processing Systems (NeurIPS), 2022 Gradient Descent on Neural Networks Typically Occurs at the Edge of Stability (pdf) J. Cohen, S. Kaur, Y. Li, Z. Kolter, A. Talwalkar International Conference on Learning Representations (ICLR), 2021",
  "content_length": 2230,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:20"
}