{
  "name": "Ameeta Agrawal",
  "homepage": "https://web.cecs.pdx.edu/~ameeta",
  "status": "success",
  "content": "Ameeta Agrawal || PortNLP About My primary research interests are in the areas of Natural Language Processing, Machine Learning, and Computational Social Sciences. Before moving to the gorgeous Pacific Northwest, I was a Postdoctoral Researcher in the Data Mining lab at the Department of Electrical Engineering and Computer Science, York University, Canada, where I also obtained my Ph.D. and MS. in Computer Science under the supervision of Prof. Aijun An. My work contributes to two exciting labs: PortNLP Research Lab Our NLP lab's current research focuses on efficient, diverse, and multilingual summarization and conversation modeling. Compassionate Computing (CoCo) Lab A multidisciplinary lab (computer science + technology management + anthropology) studying computational technology through the lens of diverse communities. Recent Updates [Jul 2023] Thrilled to be attending SciFoo Camp in just a few days ... ! [Jun 2023] Serving as a faculty mentor of Georgetown U's REU 2023. [Jun 2023] Honored to receive the David E. Wedge Award 2023 for excellence in graduate advising and mentoring, thank you students! [May 2023] Four papers accepted at ACL 2023 workshops (*SEM, WASSA, SustaiNLP, and WOAH)! [May 2023] Panelist on an interdisciplinary ChatGPT discussion. [May 2023] Our CoCo lab is organizing an interdisciplinary Ideathon on AI for Creative Storytelling. More details in these two PSU Vanguard articles. [May 2023] Invited talk on \"Generative AI research in the context of multilingualism\" at Professional Engineers of Oregon's meeting. [Apr 2023] Shared my perspectives on Generative AI and Communities in the TAG, We're It event: Voices on Craft, Chemistry, & Computing. [Feb 2023] Delighted to receive NSF CRII grant for studying socially-diverse multi-document summarization. [Jan 2023] Co-organizing SustaiNLP 2023 workshop co-located with ACL 2023. [Aug 2022] Grateful to be part of the NSF award \"SAI-P: Overcoming Barriers to User-Centered Infrastructure Planning with System Modeling and Natural Language Processing\". [Jul 2022] Co-organizing a special session on Human Centric Data Analysis at WI-IAT 2022. [Jun 2022] Honored to receive the 2022 David E. Wedge Excellence in Faculty Diversity Award, thank you students! older updates here. PortNLP Research Group Current Students Olubusayo Olabisi (Ph.D. student, Summer 2021 - ) Rhitabrat Pokharel (Ph.D. student, Fall 2021 - ) Yufei Tao (Ph.D. student, Spring 2022 - ) Russell Scheinberg (Ph.D. student, Summer 2022 - ) Aravind Inbasekaran (Ph.D. student, Fall 2022 - ) Sina Bagheri-Nezhad (Ph.D. student, Fall 2022 - ) Erik Conser (Ph.D. student, Fall 2022 - ) Amila Ferron (M.S. student, Fall 2022 - ) Ekata Mitra (Ph.D. student, Winter 2023 - ) Teaching 2023 (Winter) CS 410/510 Adventures in Natural Language Processing (Fall) CS 410/510 Natural Language Processing (Fall) CS 410/510 Ethics in Artificial Intelligence 2022 (Winter) CS 410/510 Adventures in Natural Language Processing (Fall) CS 410/510 Natural Language Processing (Fall) CS 410/510 Ethics in Artificial Intelligence 2021 (Winter) CS 410/510 Natural Language Processing (Spring) CS 410/510 Adventures in Natural Language Processing (Fall) CS 410/510 Natural Language Processing Publications [ Google Scholar ] 2023 Corpus Complexity Matters in Pretraining Language Models. Ameeta Agrawal, Suresh Singh. Fourth Workshop on Simple and Efficient Natural Language Processing. SustaiNLP at ACL 2023 Conversation Derailment Forecasting with Graph Convolutional Networks. Enas Altarawneh, Ameeta Agrawal, Michael Jenkin, Manos Papagelis. Workshop on Online Abuse and Harms. WOAH at ACL 2023. Analysis of YouTube Comments to Inform the Design of Virtual Reality Training Simulations to Target Emotional Arousal. Karan R Patil, S Bhandari, A Agrawal, SK Ayer, LA Perry, MR Hallowell. Journal of Construction Engineering and Management 149 (9), 04023077. 2023 Emotion and Sentiment Guided Paraphrasing. Justin Xie, Ameeta Agrawal. 13th Workshop on Computational Approaches to Subjectivity, Sentiment & Social Media Analysis. WASSA at ACL 2023 Estimating Semantic Similarity between In-Domain and Out-of-Domain Samples. Rhitabrat Pokharel, Ameeta Agrawal. *SEM at ACL 2023 The Role of Preprocessing for Word Representation Learning in Affective Tasks. N Babanejad, H Davoudi, A Agrawal, A An, M Papagelis IEEE Transactions on Affective Computing. 2023 Machine Learning Predictions of Electricity Capacity. Marcus Harris, Elizabeth Kirby, Ameeta Agrawal, Rhitabrat Pokharel, Francis Puyleart, Martin Zwick. Energies 2023 2022 Assessing Inter-metric Correlation for Multi-document Summarization Evaluation. Michael Ridenour, Ameeta Agrawal, Olubusayo Olabisi. Proceedings of the 2nd Workshop on Generation, Evaluation and Metrics at EMNLP. GEM 2022 Analyzing the Dialect Diversity in Multi-document Summaries. Olubusayo Olabisi, Aaron Hudson, Antonie Jetter, Ameeta Agrawal. Proceedings of the 29th International Conference on Computational Linguistics. COLING 2022 Unsupervised Knowledge Graph Generation Using Semantic Similarity Matching. Lixian Liu, Amin Omidvar, Zhongyang Ma, Ameeta Agrawal, Aijun An. Proceedings of the Third Workshop on Deep Learning for Low-Resource NLP at NAACL. DeepLo 2022 2021 On the Role of Corpus Ordering in Language Modeling. Ameeta Agrawal, Suresh Singh, Lauren Schneider, Michael Samuels. Proceedings of the Second Workshop on Simple and Efficient Natural Language Processing at EMNLP. SustaiNLP 2021 [honorable mention for best paper award] Extracting Physical Events from Digital Chatter for COVID-19.. Vikram Nagapudi, Ameeta Agrawal, Nirupama Bulusu. Proceedings of IEEE International Conference on Smart Computing. SmartComp 2021. 2020 A Comprehensive Analysis of Preprocessing for Word Representation Learning in Affective Tasks. Nastaran Babanejad, Ameeta Agrawal, Aijun An, Manos Papagelis. Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics. ACL 2020 Leveraging Transitions of Emotions for Sarcasm Detection. Ameeta Agrawal, Aijun An, Manos Papagelis. Proceedings of the 43rd International ACM SIGIR Conference on Research and Development in Information Retrieval. SIGIR 2020 2019 Leveraging Emotion Features in News Recommendations. Nastaran Babanejad, Ameeta Agrawal, Heidar Davoudi, Aijun An, Manos Papagelis. Proceedings of the 8th International Workshop on News Recommendation and Analytics at RecSys. INRA 2019 2018 Affective Representations for Sarcasm Detection. Ameeta Agrawal, Aijun An. Proceedings of the 41st International ACM SIGIR Conference on Research & Development in Information Retrieval. SIGIR 2018 Enriching Affect Analysis Through Emotion and Sarcasm Detection. Ameeta Agrawal. Ph.D. Dissertation Learning Emotion-enriched Word Representations. Ameeta Agrawal, Aijun An, Manos Papagelis. Proceedings of the 27th International Conference on Computational Linguistics. COLING 2018 2016 Detecting the Magnitude of Events from News Articles. Ameeta Agrawal, Raghavender Sahdev, Heidar Davoudi, Forouq Khonsari, Aijun An, Susan McGrath. Proceedings of the IEEE/WIC/ACM International Conference on Web Intelligence. WI 2016 Selective Co-occurrences for Word-emotion Association. Ameeta Agrawal, Aijun An. Proceedings of the 26th International Conference on Computational Linguistics. COLING 2016 2014 Kea: Sentiment Analysis of Phrases Within Short Texts. Ameeta Agrawal, Aijun An. Proceedings of the 8th International Workshop on Semantic Evaluation. SemEval 2014 2013 Kea: Expression-level Sentiment Analysis from Twitter Data. Ameeta Agrawal, Aijun An. Second Joint Conference on Lexical and Computational Semantics, Volume 2: Proceedings of the Seventh International Workshop on Semantic Evaluation. SemEval 2013 SimpLe: Lexical Simplification using Word Sense Disambiguation. Nikolay Yakovets, Ameeta Agrawal. Computational Approaches to Assistive Technologies for People with Disabilities. Book Chapter 2012 Unsupervised Emotion Detection from Text using Semantic and Syntactic Relations. Ameeta Agrawal, Aijun An. Proceedings of the IEEE/WIC/ACM International Conferences on Web Intelligence and Intelligent Agent Technology. WI 2012 Powered by w3.css",
  "content_length": 8195,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:20"
}