{
  "name": "Amelie Chi Zhou",
  "homepage": "https://www.comp.hkbu.edu.hk/~amelieczhou",
  "status": "success",
  "content": "Amelie's Home Page Amelie Chi Zhou £¨ÖÜ ³Ø£© Assistant Professor, Department of Computer Science Hong Kong Baptist University Kowloon Tong, Hong Kong, China Office: DLB 641, Shaw Campus Email: amelieczhou AT comp.hkbu.edu.hk Site Navigator: [CV]  [Publications]  [Team] Dr. Zhou is currently an Assistant Professor at Department of Computer Science, Hong Kong Baptist University. She received her Ph.D. degree in Computer Science from Nanyang Technological University (NTU) in 2016, under the supervision of Prof. Bingsheng He. She was a postdoc researcher in INRIA Rennes (2016-2017), working closely with Dr. Shadi Ibrahim. She was a faculty member with NHPCC, Shenzhen University (2017-2023). Her research interests include parallel and distributed systems, cloud computing and high-performance computing. She has published more than 30 technical articles in refereed journals and conferences including SC, HPDC, ICS, ICDE, ICDCS, ICPP and TPDS. She has been actively serving the community by participating in the organizing/program committees for conferences including SC, HPDC, ICPP, Cluster and CIKM. She is also serving as an Associate Editor for IEEE Transactions on Parallel and Distributed Systems (TPDS) and an Editor for Future Generation Computer Systems (FGCS). She is the recipient of the IEEE-CS TCHPC Early Career Researchers Award and the ACM SIGHPC China Rising Star Award in 2021. She received the Shenzhen Young Scientist Award in 2023. I am looking for PhD/Intern/Visiting students with an interest in high-performance computing and distributed data systems. Please contact me with your CV. [More Info] Research Interests Exploiting the rich parallel and distributed architectures to accelerate Big Data/ML/AI applications is the main theme of my research. More specifically, we have been actively working on the following directions: Efficient and privacy-preserving graph computing in large-scale distributed data centers [details] Cost-efficient application serving in the Cloud, especially using serverless computing platforms [details] Interference-aware I/O scheduling and processing-in-memory optimizations for AI applications [details] Some of our algorithms have been implemented in the following system prototypes: PGPregel: A differentially private graph engine. SciDB+RDMA: A network-optimized distributed array database. FStartBench: A benchmark for evaluating the startup latency of serverless platforms. Recent Highlights [10/2023]:  Invited to serve as paper track chair for Cluster 2024. Welcome to submit! [08/2023]:  Joining Department of Computer Science, HKBU. We are hiring! [08/2023]:  Invited to serve as paper track chair for IPDPS 2024. Welcome to submit! [06/2023]:  Invited to deliver a talk \"Unveiling the Power of Sampling in AI and More\" at Meta, Menlo Park, CA, USA. [03/2023]:  Invited to serve as Birds of a Feather (BoF) chair for SC 2024. Welcome to submit! Recent Services IEEE/ACM SC 2024 (BoF Chair) Cluster 2024 (Track Co-Chair) IPDPS 2024 (Track Co-Chair) TPDS 2023 Best Paper Award Committee PDSW@SC 2023 (General Chair) P2S2@ICPP 2023 (Program Chair) IEEE/ACM CCGrid 2023 (SCALE Challenge Co-Chair) IEEE CLOUD 2023 (Publicity Chair) Associate Editor, IEEE Transactions on Parallel and Distributed Systems (TPDS) Editor, Future Generation Computer Systems (FGCS) Guest Editor, Concurrency Computation Practice and Experience (CCPE) Teaching COMP 7095: Big Data Management (2024 Spring) COMP 7640: Database Systems and Administration (2024 Spring) Latest update in Jan 2024.",
  "content_length": 3537,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:19"
}