{
  "name": "Amey Karkare",
  "homepage": "http://www.cse.iitk.ac.in/users/karkare",
  "status": "success",
  "content": "Amey Karkare Amey Karkare Professor Work: Applications of Program Analysis, Compiler Optimizations, Software Engineering, and Machine Learning. Special Focus on Computer Aided Education. Contact: Room No. 401, Rajeev Motwani Building, Department of Computer Science and Engineering Indian Institute of Technology Kanpur Kanpur, UP - 208016, India. Phone: +91 512 259 7520 (Office) Email: karkare at cse dot iitk dot ac dot in Research and Teaching Publications (DBLP) Maintain Prutor: A Tutoring System for Introductory Programming Students Supervised: Ph.D., M.Tech., B.Tech. Recent Courses at IITK: Year Semester 1 Semester 2 2024-25 Functional Programming 2023-24 Principles of Programming Languages Advanced Compiler Optimizations 2022-23 Full list of courses taught. Education Ph.D. CSE, IIT Bombay (2003 - 2008) B.Tech. CSE, IIT Kanpur (1994 - 1998) Work Experience IIT Kanpur Professor, July 2021 - Present Associate Professor, November 2016 - June 2021 Assistant Professor, June 2010 - November 2016 Synopsys (India) Pvt. Ltd. June 2008 - May 2010 June 1999 - March 2003 Visiting and Short Term Positions Visiting Researcher at IIT Bombay, Jan 2016 - Nov 2016 Visiting Researcher at Microsoft Research, Redmond, June 2013 - Sept 2013 Intern at Nusym Technology India Pvt Ltd, September 2007 - November 2007 Epic Systems Corporation, November 1998 - April 1999 SAP (India) Labs (Formerly Keifer & Veittenger (India) Ltd.), July 1998 - October 1998 Awards and Recognitions [2022] Poonam and Prabhu Goel Chair Fellowship at IIT Kanpur for the duration July 2022 - June 2025. [2019] 1989 Batch Faculty Award of IIT Kanpur in recognition of excellence to use innovative and technology enhanced content to improve the quality of undergraduate instruction while reducing the faculty effort. [2018] Best Faculty of the Year Award in the category \"Innovative Application of Technology Tools in Teaching/Learning\" by the Computer Society of India's Mumbai Chapter. [2013] P. K. Kelkar Young Faculty Research Fellowship at IIT Kanpur for the duration June 2013 - May 2016. Professional Activities Program Committee: 2024: Compute (Program Co-chair) 2023: Compute (Publications Chair) 2022: Compute (Program Co-chair), SERI Talk Series 2021: Compute (Program Co-chair), SERI 2020: ISEC (Tutorials Chair), SERI, SIGCSE (International Committee) 2019: ISEC (Ph.D. Symposium), SERI 2018: ACM Compute (Program Co-chair) 2017: CHESE, WSSE 2015: PLOOC 2014: Compute, ISEC, PLOOC 2013: PLOOC 2012: ISEC 2011: IBM I-CARE, IEEE ICPADS, WCAE Coordinator for Embedded System Design for Internet of Things in May-June 2018 at IIT Kanpur. Coordinator for Embedded System Design for Internet of Things in June 2017 at IIT Kanpur. Local Organization Chair for Security and Privacy Symposium, 2014. Local Organization Chair for India Software Engineering Conference, 2012. Organized Software Architect Program (SWAP 2011) for Samsung in July 2011 at IIT Kanpur. Talks and Short Courses. Advisory and Administrative Roles Head of Computer Science and Engineering Department, IIT Kanpur (May 2023 - Present) Professor In-charge, Office of Digital Learning, IIT Kanpur , (June 2021 - March 2023) Professor In-charge, Campus School, IIT Kanpur , (March 2019 - July 2021) Vice Chairman, GATE 2020, GATE 2021, JAM 2020 (Organizing), JAM 2021 (June 2019 - May 2021) Treasurer, Alumni Association of IIT Kanpur (Oct 2018 - June 2021) Associate Dean for Digital Infrastructure & Head of Computer Center, IIT Kanpur (Dec 2017 - April 2019)",
  "content_length": 3509,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:22"
}