{
  "name": "Ami Wiesel",
  "homepage": "http://www.cs.huji.ac.il/~amiw",
  "status": "success",
  "content": "Ami Wiesel Ami Wiesel The Rachel and Selim Benin School of Computer Science and Engineering. The Hebrew University of Jerusalem, Israel. Postdoc in University of Michigan, Ann Arbor with Prof. Alfred Hero's group. PhD in Electrical Engineering in Technion with Prof. Yonina Eldar and Prof. Shlomo Shamai (Shitz). MSc in Electrical Engineering in Tel Aviv University, with Prof. Hagit Messer. BSc in Electrical Engineering in Tel Aviv University. Contact information B427 Rothberg Building School of Computer Science and Engineering The Hebrew University of Jerusalem Jerusalem 91904, Israel email: ami dot wiesel at huji dot ac dot il phone/fax: 972-2-5494539 Monograph Ami Wiesel and Teng Zhang (2015), \"Structured Robust Covariance Estimation\", Foundations and Trends(r) in Signal Processing: Vol. 8: No. 3, pp 127-216. Journal publications T. Diskin, Y. Beer, U. Okun and A. Wiesel. CFARnet: deep learning for target detection with constant false alarm rate . Signal Processing, 2024. I. Alon, D. Arnon and A. Wiesel. Learning minimal volume uncertainty ellipsoids , IEEE Signal Processing Letters, 2024. N. Granot, T. Diskin, N. Dobigeon and A. Wiesel. Probabilistic Simplex Component Analysis by Importance Sampling. IEEE Signal Processing Letters, 2023. T. Diskin, Y. C. Eldar and A. Wiesel. Learning to estimate without bias. IEEE Trans. on Signal Processing, 2023. Y. Woodbridge, G. Elidan and A. Wiesel. Convex Nonparanormal Regression. IEEE Signal Processing Letters, 2021. G. Zalcberg and A. Wiesel. Fair Principal Component Analysis and Filter Design. IEEE Trans. on Signal Processing, 2021. Y. Woodbridge, U. Okun, G. Elidan, and A. Wiesel. Unmixing K-Gaussians With Application to Hyperspectral Imaging. IEEE Trans. on Geoscience and Remote Sensing, 57(9), Sept. 2019. N. Samuel, T. Diskin, A. Wiesel. Learning to Detect. IEEE Trans. on Signal Processing, 67(10), 2554-2564, 2019. Received the \"Young Author Best Paper Award\". Y. Woodbridge, G. Elidan and A. Wiesel, Signal Detection in Complex Structured Para Normal Noise, IEEE Trans. on Signal Processing, Vol. 65, No. 9, May 2017. I. Soloveychik and A. Wiesel, Joint Estimation of Inverse Covariance Matrices Lying in an Unknown Subspace, IEEE Trans. on Signal Processing, Vol. 65, No. 9, May 2017. E. Peker and A. Wiesel, Fitting Generalized Multivariate Huber Loss Functions, IEEE Signal Processing Letters, Vol. 23, No. 11, Nov. 2016. E. Simony, C. H. Honey, J. Chen, O. Lositsky, Y. Yeshurun, A. Wiesel and U. Hasson, Dynamic reconfiguration of the default mode network during narrative comprehension, Nature Communications, 7, July 2016. A. De Maio, D. Orlando, I. Soloveychik and A. Wiesel, Invariance theory for adaptive radar detection in interference with group symmetric covariance matrix, to be published in IEEE Trans. on Signal Processing, 2016. I. Soloveychik and A. Wiesel, Joint covariance estimation with mutual linear structure, IEEE Trans. on Signal Processing, Vol. 64, No. 6, March 2016. I. Soloveychik, D. Trushin and A. Wiesel, Group Symmetric Robust Covariance Estimation, IEEE Trans. on Signal Processing, Vol. 64, No. 1, Jan. 2016. I. Soloveychik and A. Wiesel, Performance analysis of Tyler's covariance estimator, IEEE Trans. on Signal Processing, Vol. 63, No. 2, pages 418-426, Jan. 2015. P. Yang, Z. Tan, A. Wiesel and A. Nehorai, Placement of PMUs considering measurement phase angle mismatch, IEEE Trans. on Power Delivery, Vol. 30, No. 2, April 2015. I. Soloveychik and A. Wiesel, Tyler's covariance matrix estimator in Elliptical models with convex structure, IEEE Trans. on Signal Processing, Vol. 62, No. 20, Oct. 2014. A. Sloin, and A. Wiesel, Proper quaternion Gaussian graphical models, IEEE Trans. on Signal Processing, Vol. 62, No. 20, Oct. 2014. Z. Meng, D. Wei, A. Wiesel and A. O. Hero III, Marginal likelihoods for distributed parameter estimation of Gaussian graphical models, IEEE Trans. on Signal Processing, Vol. 62, No. 20, Oct 2014. T. Zhang, A. Wiesel and M. Greco, Multivariate Generalized Gaussian Distribution: Convexity and Graphical Models, IEEE Trans. on Signal Processing, Vol. 61, No. 16, pages 4141-4148, Aug. 2013. P. Yang, Z. Tan, A. Wiesel and A. Nehorai, Power system state estimation using PMUs with imperfect synchronization, IEEE Trans. on Power Systems, Vol. 28, No. 4, pages 4162-4172, Nov. 2013. A. Wiesel, O. Bibi and A. Globerson, Time varying autoregressive moving average models for covariance estimation, IEEE Trans. on Signal Processing, Vol. 61, No. 11, pages 2791-2801, June 2013. A. Wiesel, Geodesic convexity and covariance estimation, IEEE Trans. on Signal Processing, Vol. 60, No. 12, pages 6182-6189, Dec. 2012. A. Wiesel, Unified framework to regularized covariance estimation in scaled Gaussian models, IEEE Trans. on Signal Processing, Vol. 60, No. 1, pages 29-38, Jan. 2012. K. H. Liu, A. Wiesel and D. C. Munson Jr., Synthetic aperture radar autofocus based on a bilinear model, IEEE Trans. on Image Processing, Vol. 21, No. 5, May 2011. A. Wiesel and A. O. Hero III, Distributed covariance estimation in Gaussian graphical models, IEEE Trans. on Signal Processing, Vol. 60, No. 1, pages 211-219, Jan. 2012. A. T. Puig, A. Wiesel, G. Fleury and A. O. Hero III, Multidimensional shrinkage-thresholding operator and Group LASSO penalties, IEEE Signal Processing Letters, Vol. 18, No. 6, pages 363-366, 2011. K. H. Liu, A. Wiesel, and D. C. Munson Jr., Synthetic aperture radar autofocus via semidefinite relaxation, IEEE Trans. on Image Processing, Vol. 22, No. 6, pages 2317-2326, June 2013. Y. Chen, A. Wiesel, and A. O. Hero III, Robust shrinkage estimation of high-dimensional covariance matrices, IEEE Trans. on Signal Processing, Vol. 59, No. 9, pages 4097-4107, 2011. A. T. Puig, A. Wiesel, A. Zass, G. Ginsburg, G. Fleury, and A. O. Hero III, Order-Preserving Factor Analysis - Application to Longitudinal Gene Expression, IEEE Trans. on Signal Processing, Vol. 59, No. 9, pages 4447-4458, 2011. Y. Chen, A. Wiesel, Y. C. Eldar and A. O. Hero III, Shrinkage Algorithms for MMSE Covariance Estimation, IEEE Trans. on Signal Processing, Vol. 58, No. 10, pages 5016-5029, October 2010. A. Wiesel, Y. C. Eldar and A. O. Hero III, Covariance estimation in decomposable Gaussian graphical models, IEEE Trans. on Signal Processing, Vol. 58, No. 3, pages 1482-1492, March 2010. A. Wiesel and A. O. Hero III, Decomposable Principal Component Analysis, IEEE Transactions on Signal Processing, Vol. 57, No. 11, pages 4369-4377, Nov. 2009. A. Wiesel, Y. C. Eldar and A. Yeredor, Linear regression with Gaussian model uncertainty: algorithms and bounds, IEEE Trans. on Signal Processing, Vol. 56, No. 6, pages 2194-2205, June 2008. A. Wiesel, Y. C. Eldar and S. Shamai, Zero forcing precoding and generalized inverses, IEEE Trans. on Signal Processing, Vol. 56, No. 9, pages 4409-4418, Sept. 2008. A. Wiesel, Y. C. Eldar and S. Shamai, Optimization of the MIMO compound capacity, IEEE Trans. on Wireless Communications, Vol. 6, No. 3, pages 1094-1101, March 2007. A. Wiesel, Y. C. Eldar and A. Beck, Maximum likelihood estimation in linear models with a Gaussian model matrix, IEEE Signal Processing Letters, Vol. 13, No. 5, pages 292-295, May 2006. A. Wiesel, Y. C. Eldar and S. Shamai, Linear precoding via conic optimization for fixed MIMO receivers, IEEE Trans. on Signal Proceesing, Vol. 54, No. 1, pages 161-176, Jan. 2006. Received the \"Young Author Best Paper Award\". A. Wiesel, Y. C. Eldar and S. Shamai, Semidefinite relaxation for detection of 16-QAM signaling in MIMO channels, IEEE Signal Processing Letters, Vol. 12, Issue 9, pages 653-656, Sept. 2005. A. Wiesel, J. Goldberg and H. Messer, SNR Estimation in time-varying Fading Channels, IEEE Trans. on Communications, Vol. 54, Issue 5, pages 841-848, May 2006. Other publications T. Diskin, U. Okun and A. Wiesel, Learning to Detect with Constant False Alarm Rate, Proc. of IEEE SPAWC-2022. T. Diskin, Y. C. Eldar and A. Wiesel, Learning Minimum Variance Unbiased Estimators, Proc. of IEEE SAM-2022. Y. Gigi, S. Nevo, G. Elidan, A. Hassidim, Y. Matias and A. Wiesel. Spectral Algorithm for Shared Low-rank Matrix Regressions. Proc. of SAM 2020. Y. Wald, N. Noy, G. Elidan, A. Wiesel, Globally Optimal Learning for Structured Elliptical Losses, Proc. of NeurIPS-2019. N. Noy, Y. Wald, G. Elidan, A. Wiesel, Robust Multitask Elliptical Regression (ROMER), Proc. of CAMSAP-2019. T. Diskin, G. Draskovic, F. Pascal and A. Wiesel, Deep Robust Regression , Proc. of CAMSAP-2017. N. Samuel, T. Diskin and A. Wiesel, Deep MIMO detection , Proc. of IEEE SPAWC-2017. (Student Paper Award). E. Peker and A. Wiesel, Fitting generalized multivariate Huber losses , CMStatistics2016. T. Zhang and A. Wiesel, Automatic diagonal loading for Tyler's robust covariance estimator , CMStatistics 2016. E. Ollila, D. Tyler, I. Soloveychik and A. Wiesel, Simultaneous penalized M-estimation of covariance matrices using geodesically convex optimization , CMStatistics 2016. Y. Woodbridge, G. Elidan and A. Wiesel, Quaternion structured Non-Paranormal Distributions, Proc. of Asilomar 2016. T. Zhang and A. Wiesel, Automatic diagonal loading for Tyler's robust covariance estimator Proc. of SSP 2016. J. Zhang, A. Wiesel and M.Haardt, A channel matching based hybrid analog-digital strategy for massive MIMO downlink systems, Proc. of SAM 2016. Y. Tenzer, I. Soloveychik, A. Wiesel and G. Elidan, Generalized Ideal Parent (GIP): Discovering non-Gaussian Hidden Variables, Proc. of AISTATS 2016 (acceptance rate 165/537). J. Zhang, A. Wiesel and M. Haardt, Low rank approximation based hybrid precoding schemes for multi-carrier single-user massive MIMO systems, Proc. of ICASSP 2016. A. Koretz, A. Wiesel and Y. Eldar, Detection with phaseless measurements, Proc. of ICASSP 2016. Y. Woodbridge, G. Elidan and A. Wiesel, Signal detection in para complex normal noise, Proc. of ICASSP 2016. I. Soloveychik and A. Wiesel, Joint covariance estimation with mutual linear structure, Proc. of ICASSP-2015. I. Solov",
  "content_length": 16891,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:25"
}