{
  "name": "Amiangshu Bosu",
  "homepage": "https://amiangshu.com",
  "status": "success",
  "content": "[ Amiangshu Bosu @ Wayne State ] Amiangshu Bosu, Ph.D. Associate Professor Department of Computer Science Wayne State University 5057 Woodward Ave., Suite# 14200.1 Detroit, MI 48202 Tel: (313) 577-0731 Email: EXPAND ALL SECTIONS COLLAPSE ALL SECTIONS Introduction I am a tenured Associate Professor in the Department of Computer Science at Wayne State University. Prior to joining WSU, I was a tenure-track Assistant professor at SIU Carbondale (2016-2018). I completed my Ph.D. dissertation work at University of Alabama in 2015 under the supervision of Professor Jeffrey Carver and conducted postdoctoral research under the guidance of Dr. Danfeng Yao at Virginia Tech. My general research interests lie in the area of software engineering. My research spans peer code review, software security, android security, blockchain software development, malware detection, cybersecurity, mining software repositories, empirical software engineering, and social network analysis. Short Biography » CV (PDF)» Grants Grants National Science Foundation CAREER: Transforming Peer Code Review Environments for Code Learning and High-Quality Feedback, PI: Amiangshu Bosu, Amount: $596,759, Duration: 2024-2029. National Science Foundation Collaborative Research: PPoSS: Planning: Scaling Autonomous Vehicle Systems at the Edge: from On-Board Processing to Cloud Infrastructure, PI: Daniel Grosu, Amount: $163,796, My role: Sr. Personnel, Duration: 2021-2023. National Science Foundation CRII: SHF: Improving the Retention of Newcomers in FLOSS Projects With Useful and Timely Code Reviews, PI: Amiangshu Bosu, Amount: $174,967, Duration: 2019-2021. DARPA Detection of Malware Collusion (Subcontract from Virginia Tech.), PI: Amiangshu Bosu, Amount: $25,000, Duration: 2016. Publications Selected Recent Publications All Publications» TSE'2025 Asif Kamal Turzo, Sayma Sultana, and Amiangshu Bosu., \"From First Patch to Long-Term Contributor: Evaluating Onboarding Recommendations for OSS Newcomers\" IEEE Transactions on Software Engineering Vol. 51, 2025. TSE'25. FSE'2025 Jaydeb Sarker and Asif Kamal Turzo and Amiangshu Bosu., \"The Landscape of Toxicity: An Empirical Investigation of Toxicity on GitHub Proceedings of ACM Software Engineering 2, FSE, Article FSE029 (July 2025). EMSE'2024 Asif Kamal Turzo and Amiangshu Bosu., \"What Makes a Code Review Useful to OpenDev Developers? An Empirical Investigation Empirical Software Engineering (EMSE), Vol. 29, Article. 6, 2024. ESEM'2023 Asif Kamal Turzo, Faysal Fahim, Ovi Poddar, Jaydeb Sarker, Anindya Iqbal, and Amiangshu Bosu., Towards Automated Classification of Code Review Feedback to Support Analytics 2023 ACM/IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM) New Orleans, LA, USA pp. 1-12, 2023. ESEM'2023 Jaydeb Sarker, Sayma Sultana, Steve Wilson, and Amiangshu Bosu., ToxiSpanSE: An Explainable Toxicity Detection in Code Review Comments2023 ACM/IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM) New Orleans, LA, USA pp. 1-12, 2023. TOSEM'2023 Jaydeb Sarker, Asif Kamal Turzo, Ming Dong, and Amiangshu Bosu., Automated Identification of Toxic Code Reviews Using ToxiCR ACM Transactions on Software Engineering and Methodology (TOSEM), Vol. 32, Issue 5, Article. 115, pp 1-32, 2023. EMSE'2023 Sayma Sultana, Asif Kamal Turzo, and Amiangshu Bosu., \"Code Reviews in Open Source Projects : How Do Gender Biases Affect Participation and Outcomes? Empirical Software Engineering (EMSE),Vol. 28, Iss. 4, 2023. ICSE'2021 Rajshakhar Paul, Asif Kamal Turzo, and Amiangshu Bosu., Why Security Defects Go Unnoticed during Code Reviews? A Case-Control Study of the Chromium OS Project , Proceedings of the 43th International Conference on Software Engineering (ICSE '21), Madrid, Spain pp. 1373-1385, 2021. ESEM'2019 Amiangshu Bosu, Kazi Zakia Sultana., Diversity and Inclusion in Open Source Software (OSS) Projects: Where Do We Stand? In Proceedings of the 13th ACM/IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM '19), Porto de Galinhas, Brazil, 2019. EMSE'2019 Amiangshu Bosu, Anindya Iqbal, Rifat Shahriyar, and Partha Chakroborty., Understanding the Motivations, Challenges and Needs of Blockchain Software Developers: A Survey. Empirical Software Engineering (EMSE), Springer, Vol. 24, Iss. 4, pp. 2636--2673, 2019. All Publications » Awards Awards 2025 Research Excellence Award College of Engineering, Wayne State University 2024 CAREER award National Science Foundation. 2019 CRII award National Science Foundation. 2015 Outstanding Graduate Researcher Department of Computer Science, University of Alabama. 2014 Outstanding Graduate Researcher Department of Computer Science, University of Alabama. 1st Place Doctoral division ACM Mid-Southeast Conference, November 2011. Finalist ACM Student Research Competition, ICSE 2014. ACM SIGSOFT CAPS Travel GrantTo attend ICSE 2014. NSF Student Travel GrantTo attend ESEM 2013. Software Software ToxiCR An automated tool to identify toxic code review comments DIALDroid A highly scalable tool to identify inter-app collusions and privilege escalations among Android apps. IC3-DIALDroidAn updated intent resolution tool for Android apps. SentiCR An automated sentiment analysis tool for code review comments. SentiSE Sentiment Analysis for Software Engineering Interactions. Courses Courses CSC 4110 Software Engineering: Fall /Winter 2018 -2025 CSC 6110 Software Engineering (Graduate): Winter 2020, Fall 2021-2025 CS 435 (SIUC) Software Engineering: Spring 2016, Spring 2017, Spring 2018. CS 305 (SIUC) Software Development Practices: Fall 2016, Fall 2017. CS 304 (SIUC) Advanced Object-Oriented Programming: Fall 2017. Media Coverage Selected Media Coverage More » Wayne State Engineering WSU researcher developing system to bolster FLOSS project coder communities, February 22, 2019. Wayne State Engineering How peer code reviews affect gender diversity in software engineering, January 18, 2019. The Sun Your smartphone apps are 'secretly colluding' to spy on you in terrifying detail, researchers warn, April 3, 2017. Phys.org Android apps can conspire to mine information from your smartphone, April 3, 2017 New Scientist Android apps share data between them without your permission, April 3, 2017 ACM Technews Virginia Tech Researchers: Android Apps Can Conspire to Mine Information From Your Smartphone, April 3, 2017 Business Insider Android apps can breach and share your personal data, April 3, 2017 The Hill Thousands of Android apps can 'collude' to leak information, research shows, April 3, 2017 Service Professional Service Journal Editorial Board Journal of System and Software (JSS): 2018-current Software Quality Journal (SOQJ): 2021-current Array: 2019-current Journal and Magazine Referee ACM Transactions in Software Engineering (TOSEM): 2018-2025 IEEE Transcations in Software Engineering (TSE): 2015-2025; Empirical Software Engineering (EMSE) 2015-2025; Journal of System and Software (JSS): 2018-2023; Automated Software Engineering (AUSE): 2020 Information and Management (INFOMAN): 2020 PeerJ Computer Science: 2019 Artificial Intelligence Review (AIRE): 2020 IEEE Transactions on Emerging Topics in Computing (TETC): 2020 IEEE Transactions on Dependable and Secure Computing (TDSC) :2016; IEEE Transportation Systems Magazine (ITSM): 2018-2019 Information and Software Technology (IST): 2014, 2017, 2019-2020; IET Software: 2014-2017; Information, Communication and Society (ICS): 2015. Conference Committees International Conference of Software Engineering (ICSE) : 2025 (Research track), 2024 (Research track), 2023 (Poster track), 2021 (Tool demo track) Foundations of Software Engineering (FSE) : 2026 (Research track), 2025 (Research track), 2024 (Research track), 2024 (SRC track) Automated Software Engineering (ASE): 2025 (Research track), 2022 (Organizing committee, Program chair -Late breaking Results), 2021 (Research track), 2018 (Tool demo track) International Symposium on Empirical Software Engineering and Measurement (ESEM): 2025 (Research track), 2024 (Research track), 2023 (Research track), 2022 (Research track), 2021 (Research track), 2020 (Research track), 2019 (Research track), 2017 (Short papers), 2016 (Short papers) International Conference on Program Comprehension (ICPC): 2021 (Research track) Mining Software Repositories (MSR): 2022 (Data Showcase) The Evaluation and Assessment in Software Engineering (EASE): 2019 (Research track ), 2016- 2018 (Short papers) Technical program committee: The 25th Asia-Pacific Software Engineering Conference (APSEC 2018) International Workshop on Software Vulnerability Management (SVM) 2023 Technical program committee: International Conference on Networking, Systems and Security (NSyS): 2019, 2020, 2021 Technical program committee: The 23rd International Computer Science and Engineering Conference (ICSEC 2019) Thailand Workshop on Software Engineering - (THAISE -2015) Technical program committee: ACM Southeast Conference - 2012, 2017 Advising Advising Current students Ph.D. (2020~) Sayma Sultana Ph.D. (2024~) Arif Shariar Rahman Ph.D. (2024~) Sumaita Binte Shorif Past students Ph.D. (2019-2024) Saleh Amareen, Dissertation: Towards Improving The Adoption of GraphQL Among Software Practitioners. Ph.D. (2019-2024) Asif Kamal Turzo , Dissertation: Broadening Participation in Open Source Software Communities With Newcomersâ Onboarding and Retention. Ph.D. (2019-2024) Jaydeb Sarker, Dissertation: Identification and Mitigation of Toxic Communication Among Open Source Software Developers. Ph.D. (2017-2023) Rajshakhar Paul, Dissertation: Improving the Effectiveness of Peer Code Review in Identifying Security Defects. MS. Tanzeer Hossain, 2019. Undergrad Hemangi Murdande Undergrad London Cavaletto MS. Toufique Ahmed (BUET, co-advised) Undergrad Ayush Kohli (SIUC) Undergrad Jacob Reed (SIUC) Undergrad Alec Waichunas (SIUC) Awards by Mentored Students Awards by Mentored Students Ayus",
  "content_length": 10677,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:23"
}