{
  "name": "Amin Kharraz",
  "homepage": "https://kharraz.org",
  "status": "success",
  "content": "Amin Kharraz - Research in Systems Security AMIN KHARRAZ Assistant Professor amin[at]iseclab[dot]org Google Scholar CONTACT School of Computing and Information Sciences Florida International University Miami, FL United States ABOUT ME I describe my research as empirical system security and privacy. An overarching theme of my research has been to enable evaluating implications of emerging technologies and their associated threats. I apply data-driven techniques to rigorously analyze online threats and build research tools to discover them in a scalable and reliable manner. My research requires knowledge of fundamental areas in computer science such as software engineering, machine learning, computer networks, and operating systems. This has allowed me to work on multiple topics such as Web and browser security, code analysis, and malware detection. I am always looking for new talented members to join SecLab. If you are a graduate student with strong computer science background or undergrad who wants to learn more about systems security, I would like to chat with you! NEWS 01/03/2023 Our Proposal on Web Application Security got funded from The Center for Infrastructure Trustworthiness in Energy Systems (CITES). 01/03/2023 Our Paper on Covid-Themed Scams got Accepted in AsiaCCS 2023. 03/15/2022 Our Proposal on APT attacks on Energy Systems got funded from The Center for Infrastructure Trustworthiness in Energy Systems (CITES). 05/15/2021 Two papers got accepted in DIMVA 2021. Congrats to Omid and Tommaso! 01/15/2021 Our paper on WebSocket and real-time web got accepted in the Web Conference 2021. 11/03/2020 Our paper on server-side request forgery attack got accepted in ACM SAC 2021. 07/39/2020 Our proposal on targeted attacks got funded by Microsoft AI Security. Thanks Microsoft! 06/14/2020 Multiple Ph.D. positions are available in my group. Feel free to send an email for further details. 06/10/2020 Accepted a tenure-track faculty position at the department of Computer Science at FIU. 05/29/2019 Our paper on detecting malicious transient devices got accepted at RAID'19 05/17/2019 Outguard won the best paper award at WWW'19 04/17/2019 Some of our team members attended the Midwest Security Workshop (MSW'19) 02/20/2019 Our paper got accepted at WWW'19 PUBLICATION Mohammad Ali Tofighi, Behzad Ousat, Javad Zandi, Esteban Schafir, Amin Kharraz,Constructs of Deceit: Exploring Nuances in Modern Social Engineering Attacks, The 21st Conference on Detection of Intrusions and Malware and Vulnerability Assessment (DIMVA '24),Lausanne, Switzerland, July 2024 PDF BibTex Behzad Ousat, Donsheng Luo, Amin Kharraz, Breaking the Bot Barrier: Evaluating Adversarial AI Techniques Against Multi-Modal Defense Models, The Proceedings of the 2024 World Wide Web Conference, Singapore, May 2024 PDF BibTex Harun Oz, Abbas Acar, Ahmet Aris, Guliz Seray Tuncay, Amin Kharraz, Selcuk Uluagac, The Matter of Captchas: An Analysis of a Brittle Security Feature on the Modern Web, The Proceedings of the 2024 World Wide Web Conference, Singapore, May 2024 PDF BibTex Behzad Ousat, Esteban Schafir, Duc C. Hoang, Mohammad Ali Tofighi, Cuong V. Nguyen, Sajjad Arshad, Selcuk Uluagac, Amin Kharraz, The Matter of Captchas: An Analysis of a Brittle Security Feature on the Modern Web, The Proceedings of the 2024 World Wide Web Conference, Singapore, May 2024 PDF BibTex DC Hoang, CV Nguyen, Amin Kharraz, EnSolver: Uncertainty-aware Captcha solver using deep ensemble, UAI Epistemic Uncertainty in Artificial Intelligence 2023, Pittsburg, PA, July 2023 PDF BibTex Behzad Ousat, Mohammad Ali Tofighi, Amin Kharraz, An End-to-End Analysis of Covid-Themed Scams in the Wild, The 18th ACM ASIA Conference on Computer and Communications Security (ACM ASIACCS 2023), Melbourne, Australia, July 2023 PDF BibTex Omid Mirzai, Roman Vasilenko, Engin Kirda, Long lu, Amin Kharraz, Scrutinizer:Detecting Code Reuse in Malware via Decompilation and Machine Learning, The Proceedings of the 2021 Detection of Intrusion and Malware and Vulrnerability Assessment (DIMVA), Lisboa, Portugal, July 2021 Abstract PDF BibTex Growing numbers of advanced malware-based attacks against governments and corporations, for political, financial and scientific gains, have taken security breaches to the next level. In response to such attacks, both academia and industry have investigated techniques to model and reconstruct these attacks and to defend against them. While such efforts have been all useful in mitigating the effects of modern attacks, automated malware code reuse inspection and campaign attribution have received less attention. In this paper, we present an automated system, called SCRUTINIZER, to identify code reuse in malware via a novel machine learning-based encoding mechanism at the function-level. By creating a large knowledge base of previously observed and tagged malware campaigns, we can compare unknown samples against this knowledge base and determine how much overlap exists. SCRUTINIZER leverages an unsupervised learning approach to filter out irrelevant functions before code reuse detection. It provides two valuable capabilities. First, it identifies ties between an unknown sample and those malware specimens that are known to be used by a specific campaign. Second, it inspects if specific tools or functionalities are used by a campaign. Using SCRUTINIZER, we were able to identify 12 samples that were previously unknown to us and that we were able to correctly assign to well-known APT campaigns. Tommaso Innocenti, Seyed Ali Mirheidari, Amin Kharraz,Bruno Crispo, and Engin Kirda, You’ve Got (a Reset) Mail: A Security Analysis of Email-Based Password Reset Procedures, The Proceedings of the 2021 Detection of Intrusion and Malware and Vulrnerability Assessment (DIMVA), Lisboa, Portugal, July 2021 Abstract PDF BibTex The password recovery process is a critical part of a website’s functionality. Many websites that provide online services to their users also need to solve the problem of allowing their users to reset their passwords (e.g., if they have forgotten it). A popular, established technique for allowing a user to recover a lost account is to allow her to send a reset link to her own account via email. Although it might seem easy at a first glance, the security requirements of the password recovery process require web sites to carefully design each step of the process to be resilient even in the presence of an attack. In this paper, we present an in-depth security analysis of the email-based recovery mechanisms of a wide range of web applications. By manually registering accounts and triggering the password recovery process for each website, we were able to study the password reset mechanisms of web sites from three different groups in the Alexa Top 5K (i.e., popular sites, medium popular sites, low popular sites). In this work, we show that the lack of standards in the password recovery process plagues many websites with security weaknesses, and negatively influences the security of the reset process itself. We also show that concrete password-recovery reset attacks can be launched against a high percentage of websites that might even lead to account takeover. Paul Murley, Zane Ma, Joshua Mason, Michael Bailey, Amin Kharraz, WebSocket Adoption and the Landscape of the Real-Time Web, The Proceedings of the 2021 World Wide Web Conference (WWW '21), Ljubljana, Slovenia, April 2021 Abstract PDF BibTex Developers are increasingly deploying web applications which require real-time bidirectional updates, a use case which does not naturally align with the traditional client-server architecture of the web. Many solutions have arisen to address this need over the preceding decades, including HTTP polling, Server-Sent Events, and WebSockets. This paper investigates this ecosystem and reports on the prevalence, benefits, and drawbacks of these technologies, with a particular focus on the adoption of WebSockets. We crawl the Tranco Top 1 Million websites to build a dataset for studying real-time updates in the wild. We find that HTTP Polling remains significantly more common than WebSockets, and WebSocket adoption appears to have stagnated in the past two to three years. We investigate some of the possible reasons for this decrease in the rate of adoption, and we contrast the adoption process to that of other web technologies. Our findings further suggest that even when WebSockets are employed, the prescribed best practices for securing them are often disregarded. The dataset is made available in the hopes that it may help inform the development of future real-time solutions for the web. Bahruz Jabiyev, Omid Mirzaei, Amin Kharraz, Engin Kirda, Preventing Server-Side Request Forgery Attacks, In 36th ACM Symposium on Applied Computing (SAC 2021), Gwangju, Korea, May 2021 Abstract PDF BibTex In today’s web, it is not uncommon for web applications to take acomplete URL as input from users. Usually, once the web applicationreceives a URL, the server opens a connection to it. However, ifthe URL points to an internal service and the server still makes theconnection, the server becomes vulnerable to Server-Side Request Forgery (SSRF) attacks. These attacks can be highly destructivewhen they exploit internal services. They are equally destructiveand need much less effort to succeed if the server is hosted in a cloudenvironment. Therefore, with the growing use of cloud computing,the threat of SSRF attacks is becoming more serious.In this paper, we present a novel defense approach to protectinternal services from SSRF attacks. Our analysis of more than 60SSRF vulnerability reports shows that developers’ awareness aboutthis vulnerability is generally limited. Therefore, coders usuallyhave flaws in their defenses. Even when these defenses have noflaws, they are usually still affected by important security andfunctionality limitations. In this work, we develop a prototypebased on the proposed approa",
  "content_length": 27819,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:25"
}