{
  "name": "Amine Trabelsi",
  "homepage": "https://www.usherbrooke.ca/informatique/nous-joindre/personnel/corps-professoral/professeurs/amine-trabelsi",
  "status": "success",
  "content": "Amine Trabelsi - Département d'informatique - Université de Sherbrooke Aller au contenuAmine TrabelsiProfesseur adjointPage personnelleTwitterLinkedInCoordonnéesCourriel : Amine.Trabelsi@USherbrooke.ca Téléphone : 819 821-8000, poste 62031 Local : D4-1022-1FormationM. Sc. Informatique, Université de MontréalPh. D. Computing Science, University of AlbertaThèmes de rechercheTraitement automatique du langage (NLP)Fouille des données et du texteIntelligence artificielle pour le bien socialApprentissage machine appliquéRecherches actuellesAnalyse et synthèse de texte non structuré de façon non superviséDétection de position et de contenu douteux à partir des médias sociauxGénération d'explications pour signalisation de contenu douteuxDétection des comportements antisociaux à partir des textes de médias sociauxReconnaissance et expression des émotions dans un texte conversationnelCapture des données sur les tumeurs cérébrales pour le registre du cancerDécryptage des attitudes de soutien social et l'alignement des entreprises vers une transition énergétique propre à travers différents types de documents et rapportsFouilles du web et création de réseaux communautaires d’acteurs pour l'autonomisation climatique au CanadaPublicationsPublications de Pr Amine Trabelsi Ce site Web utilise des fichiers témoins (cookies) essentiels à son bon fonctionnement. Vous pouvez paramétrer l'utilisation de témoins facultatifs nous permettant d'optimiser votre expérience à travers le site. Voir la Politique de confidentialité Gérer les paramètres Autoriser les témoins Paramètres des témoins Pour obtenir plus d’information sur la nature et l’utilisation des témoins, voir la Politique de confidentialité. Témoins essentiels Ces témoins sont nécessaires au bon fonctionnement du site Web. Ils permettent de maintenir l’accès à certaines sections sécurisées et de conserver des critères de recherche, par exemple. Ces témoins ne peuvent être désactivés. Toujours autorisés Témoins analytiques Ces témoins nous aident à comprendre votre utilisation de notre site Web et nous permettent d'améliorer l’expérience qu'il propose. Autoriser Témoins publicitaires Ces témoins sont utilisés pour vous proposer des publicités pertinentes en fonction de votre navigation sur notre site. Ces publicités peuvent être émises par l'Université de Sherbrooke ou d'autres entités. Autoriser Annuler Enregistrer",
  "content_length": 2392,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:29"
}