{
  "name": "Amin Sakzad",
  "homepage": "https://research.monash.edu/en/persons/amin-sakzad",
  "status": "success",
  "content": "Amin Sakzad - Monash University Amin Sakzad public CV View Scopus Profile Amin Sakzad Assoc Professor Associate Professor, Department of Software Systems & Cybersecurity https://orcid.org/0000-0003-4569-3384 EmailAmin.Sakzadmonashedu Accepting PhD StudentsPhD projects1) Euclidean lattices and their application in Post Quantum Cryptography and Wireless Communication, 2) Tight security proofs in Quantum Random Oracle Model (QROM), 3) Underlying Cryptographic Primitives for IoT Networks, and 4) Secure and efficient implementation of lattice-based cryptographic primitives with real-world applications ad adaptations. 20102026 Research activity per year Personal profile BiographyDr. Amin Sakzad is an Associate Professor and Director of Research in the Department of Software Systems and Cybersecurity at Monash University. With a career spanning cutting-edge post-quantum cryptography, lattice coding, and secure wireless communications, Amin has become a global leader in shaping the cryptographic foundations that will safeguard the digital world against quantum threats. His research on Euclidean lattices and post-quantum cryptography (PQC) has not only advanced theory but also translated into real-world adoption. Notably, his work on the FACCT sampler was adopted in Falcon, a NIST PQC standard. Beyond academia, his open-source cryptographic implementations have reached extraordinary global impact, with over 30 million downloads via the Legion of the Bouncy Castle platform. Amin has attracted over $8M in competitive industry and government funding, including a landmark USD $1M project with the U.S. Department of State to advance PQC adoption across 11 Indo-Pacific nations. As a mentor, Amin has guided PhD students who have gone on to careers at CSIRO, Amazon, ANU, and ONI, ensuring his impact extends across academia, government, and industry Amin is also a decorated educator, having received multiple awards including the Monash Vice-Chancellor’s Teaching Excellence Award and recognition as a Senior Fellow of the Higher Education Academy (SFHEA). Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationApplied Mathematics, Doctor of Philosophy, Amirkabir University of TechnologyAward Date: 19 Jul 2011Pure Mathematics, Master of Science, Amirkabir University of TechnologyAward Date: 10 Jun 2007Pure Mathematics, Bachelor of Science, Amirkabir University of TechnologyAward Date: 10 Jun 2005 Research area keywordsLattice Coding TheoryLattice-Based CryptographyWireless CommunicationsFinite FieldsSearchable Encryption Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2017 2022 2023 2025 2028 1 Not started 6 Active 11 Finished Projects per year The CollinStar Lab to research and develop blockchain and crypto-currency technologiesLiu, J. (Primary Chief Investigator (PCI)), Steinfeld, R. (Chief Investigator (CI)), Sakzad, A. (Chief Investigator (CI)) & Yuan, X. (Chief Investigator (CI))1/09/17 → 1/09/20Project: Research Secure Relational Database Management System (SRDBMS)Liu, J. (Primary Chief Investigator (PCI)), Steinfeld, R. (Chief Investigator (CI)), Sakzad, A. (Chief Investigator (CI)), Yuan, X. (Chief Investigator (CI)) & Xiang, Y. (Chief Investigator (CI))1/05/18 → 28/02/19Project: Research Securing Privacy-Preserving: Securing Privacy-Preserving Cloud Computation Against Active AttacksSteinfeld, R. (Primary Chief Investigator (PCI)), Sakzad, A. (Chief Investigator (CI)), Esgin, M. (Chief Investigator (CI)) & Stehle, D. (Partner Investigator (PI))ARC - Australian Research Council, Monash University – Internal Faculty Contribution9/04/25 → 8/04/28Project: Research NGGP: Quantum-Resistant Digital ProvenanceSteinfeld, R. (Primary Chief Investigator (PCI)), Sakzad, A. (Chief Investigator (CI)), Kim, M. (Chief Investigator (CI)), Nguyen, L. (Supervisor) & Chan, N. (Chief Investigator (CI))3/03/25 → 2/03/26Project: Research ICT: Integrating Equity, Diversity, and Inclusion (EDI) into ICT Education: A GenAI-Powered Approach to Curriculum DevelopmentCheema, A. (Primary Chief Investigator (PCI)), Cosmos, A. (Chief Investigator (CI)), Arora, C. (Chief Investigator (CI)), Du, G. (Chief Investigator (CI)), Nawaz, S. (Chief Investigator (CI)), Rahayu, D. (Chief Investigator (CI)), Sakzad, A. (Chief Investigator (CI)), Siddiqui, I. F. (Chief Investigator (CI)), Janjua, N. K. (Chief Investigator (CI)), Raza Khan, U. (Chief Investigator (CI)), Shibani, A. (Chief Investigator (CI)), Shah, S. A. A. (Chief Investigator (CI)) & Ulhaq, A. (Chief Investigator (CI))Australian Council of Deans of Information and Communications Technology (ACDICT)15/02/25 → 31/12/25Project: Research View all 18 projects Research output Research output per year 2010 2018 2019 2020 2021 2022 2023 2024 2025 2025 67 Conference Paper 31 Article 2 Chapter (Book) 2 Review Article 1 More 1 Editorial Research output per year Research output per year Improved security proofs in lattice-based cryptography: Using the Renyi divergence rather than the statistical distanceBai, S., Lepoint, T., Roux-Langlois, A., Sakzad, A., Stehle, D. & Steinfeld, R., Apr 2018, In: Journal of Cryptology. 31, 2, p. 610-640 31 p.Research output: Contribution to journal › Article › Research › peer-review 57 Citations (Scopus) Practical backward-Secure Searchable Encryption from symmetric puncturable encryptionSun, S.-F., Yuan, X., Liu, J. K., Steinfeld, R., Sakzad, A., Vo, V. & Nepal, S., 2018, CCS’18 - Proceedings of the 2018 ACM SIGSAC Conference on Computer and Communications Security: October 15-19, 2018 Toronto, ON, Canada . Backes, M. & Wang, X. (eds.). New York NY USA: Association for Computing Machinery (ACM), p. 763-780 18 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 209 Citations (Scopus) Result pattern hiding searchable encryption for conjunctive queriesLai, S., Patranabis, S., Sakzad, A., Liu, J. K., Mukhopadhyay, D., Steinfeld, R., Sun, S.-F., Liu, D. & Zuo, C., 2018, CCS’18 - Proceedings of the 2018 ACM SIGSAC Conference on Computer and Communications Security: October 15-19, 2018 Toronto, ON, Canada. Backes, M. & Wang, X. (eds.). New York NY USA: Association for Computing Machinery (ACM), p. 745-762 18 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 203 Citations (Scopus) Middle-product learning with errorsRoşca, M., Sakzad, A., Stehle, D. N. & Steinfeld, R., 2017, Advances in Cryptology – CRYPTO 2017 - 37th Annual International Cryptology Conference, Proceedings. Katz, J. & Shacham, H. (eds.). Cham Switzerland: Springer, Vol. 10403. p. 283-297 15 p. (Lecture Notes in Computer Science ; vol. 10403 ).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 33 Citations (Scopus) Integer-forcing MIMO linear receivers based on lattice reductionSakzad, A., Jagadeesh, H. & Viterbo, E., 2013, In: IEEE Transactions on Wireless Communications. 12, 10, p. 4905 - 4915 11 p.Research output: Contribution to journal › Article › Research › peer-review 55 Citations (Scopus) View all 103 research outputs Prizes FIT Dean's Award for Teaching ExcellenceSakzad, A. (Recipient), 2021Prize: Prize (including medals and awards) FIT Dean’s Award for Equity Diversity and Inclusion (Environment & Culture)Sakzad, A. (Recipient), 2021Prize: Prize (including medals and awards) International Mathematics Competition for University StudentsSakzad, A. (Recipient), 28 Jul 2005Prize: Prize (including medals and awards) File Iranian mathematics CompetitionSakzad, A. (Recipient), 2005Prize: Prize (including medals and awards) File Iranian Mathematics CompetitionSakzad, A. (Recipient), 2004Prize: Prize (including medals and awards) File View all 6 prizes",
  "content_length": 8338,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:26"
}