{
  "name": "Amin Coja-Oghlan",
  "homepage": "https://www.cs.tu-dortmund.de/nps/en/Home/Personen/C/Coja-Oghlan__Amin.html",
  "status": "success",
  "content": "Welcome to the Department of Computer Science at TU DO - Computer Science - TU Dortmund To navigation To quick access To footer with other services To content We introduce ourselves! Pioneering spirit meets practical application: Experience the fascination of computer science at our department. Image video of our department The Department of Computer Science  in Dortmund was one of the first university computer science institutions in Germany. Today, it is one of the largest computer science departments nationwide and thus offers a specialized spectrum of computer science that only a few locations in Germany can boast. In all computer science degree programs, the department educates students on the current state of the art in theory and practice, preparing them for an exciting professional life in a rapidly evolving discipline. In addition to practical training through internships, specialized projects and project groups, the department places great emphasis on intensive personal support in theoretical courses through tutorials, help desks and small practice groups. The proximity to the Technology Center also offers opportunities for research collaborations, internships or career entry. 11/28/2025 The department congratulates the first doctoral candidate from the Research Center Trust Carina Newen successfully completes her doctorate on the trustworthiness of AI - a milestone for the interdisciplinary RC Trust. 11/28/2025 How much trust does artificial intelligence deserve? New study provides answers A Bochum-Dortmund research team defines six criteria for trustworthy AI - a milestone for the Research Center Trust. 11/27/2025 Lecture series: Sustainable development at a Dortmund company Next lecture series \"Computer Science & Sustainability\": Wed, 3.12.2025, 16:15, Room E23, Otto-Hahn-Str. 14. 11/27/2025 Sustainability Award of the Department of Computer Science The Sustainability Award initiated by the department was presented at the Computer Science Alumni Day on November 21, 2025. 11/14/2025 From Dortmund to Singapore: research for secure AI systems worldwide How can artificial intelligence be safely integrated into autonomous vehicles? Postdoc seeks answers in Singapore. 11/11/2025 DFG Funds Dortmund Project on Verification of Digital Quantum Simulations Interdisciplinary Team from Physics and Computer Science Lays Foundations for Reliable Quantum Simulations 11/07/2025 RC Trust bundles cutting-edge research on trustworthy AI The University Alliance Ruhr presented its interdisciplinary research center to around 120 guests at the Dortmunder U. 11/06/2025 Computer science gives memory a voice: AI brings Holocaust testimonies to life interactively Prof. Mario Botsch's team uses AI expertise to support the HOLO-VOICES project - holograms preserve the voices of Holocaust survivors. To the archive To top of page",
  "content_length": 2861,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:27"
}