{
  "name": "Amin M. Abbosh",
  "homepage": "http://researchers.uq.edu.au/researcher/1576",
  "status": "success",
  "content": "Professor Amin Abbosh | UQ Experts Skip to menu Skip to content Skip to footer Professor Amin Abbosh Email: a.abbosh@uq.edu.au Phone: +61 7 334 67936 Positions Professor School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Overview Background Prof. Amin Abbosh specializes in Medical Microwave Imaging and Microwave and Millimeter-wave Engineering. His work focuses on designing and developing advanced imaging and sensing systems using electromagnetic techniques at radio-wave frequencies. Prof. Abbosh’s significant contributions include the creation of innovative imaging systems that leverage his expertise in applied electromagnetics and microwave engineering. He has developed comprehensive analytical and computational frameworks, incorporating signal-processing techniques for detection and AI for classification. This approach has led to a new modality for detection and imaging, combining physics-guided and data-driven methods. His work is protected by over 16 patents. In Communication Technologies, Prof. Abbosh's work focuses on designing flat-panel, low-cost reconfigurable antennas. These antennas form ground satellite terminals that communicate with low-earth-orbit (LEO) satellites, providing reliable broadband access to remote and regional communities. This technology supports e-health services, distance education, and business productivity, and can be used in various on-the-move environments. Read more Read less Availability Professor Amin Abbosh is: Available for supervision Media expert Fields of research Biomedical engineering Engineering Qualifications Bachelor of Science, University of Mosul Masters (Coursework) of Science, University of Mosul Doctor of Philosophy, University of Mosul Postgraduate Diploma in Higher Education, The University of Queensland Doctor of Philosophy, The University of Queensland Research interests Electromagnetic Medical Imaging Electromagnetic Medical Imaging Systems including hardware (microwave devices and antennas), applied electromagnetic, computational electromagnetic, signal processing, and artificial intelligence Read more Read less Microwave Engineering Antennas, microwave devices Read more Read less Engineering Electromagnetics Applied Electromagnetics in Electrical and Biomedical Engineering Read more Read less Artificial Intelligence AI in Electromagnetics and Microwave Engineering Read more Read less Works Search Professor Amin Abbosh’s works on UQ eSpace All (647) Journal Article (360) Other Outputs (13) Conference Publication (271) Book Chapter (3) Featured 2022 Journal Article Broadband magnetic absorber based on double-layer frequency selective surface Hossain, M. I., Nguyen-Trong, Nghia and Abbosh, Amin M. (2022). Broadband magnetic absorber based on double-layer frequency selective surface. IEEE Transactions on Antennas and Propagation, 70 (1), 410-419. doi: 10.1109/TAP.2021.3096199 Broadband magnetic absorber based on double-layer frequency selective surface Featured 2021 Journal Article Case Report: preliminary images from an electromagnetic portable brain scanner for diagnosis and monitoring of acute stroke Cook, David, Brown, Helen, Widanapathirana, Isuravi, Shah, Darshan, Walsham, James, Trakic, Adnan, Zhu, Guohun, Zamani, Ali, Guo, Lei, Brankovic, Aida, Al-Saffar, Ahmed, Stancombe, Anthony, Bialkowski, Alina, Nguyen, Phong, Bialkowski, Konstanty, Crozier, Stuart and Abbosh, Amin (2021). Case Report: preliminary images from an electromagnetic portable brain scanner for diagnosis and monitoring of acute stroke. Frontiers in Neurology, 12 765412, 765412. doi: 10.3389/fneur.2021.765412 Case Report: preliminary images from an electromagnetic portable brain scanner for diagnosis and monitoring of acute stroke Featured 2021 Journal Article Portable electromagnetic knee imaging system Sultan, Kamel S., Mohamed, Beadaa, Manoufali, Mohamed and Abbosh, Amin (2021). Portable electromagnetic knee imaging system. IEEE Transactions on Antennas and Propagation, 69 (10), 6825-6837. doi: 10.1109/tap.2021.3070015 Portable electromagnetic knee imaging system Featured 2021 Journal Article Hepatic steatosis detection using differential effective permittivity Janani, Azin S., Rezaeieh, Sasan Ahdi, Darvazehban, Amin, Zamani, Ali, Brankovic, Aida, Mohammed, Beadaa, Macdonald, Graeme and Abbosh, Amin M. (2021). Hepatic steatosis detection using differential effective permittivity. IEEE Transactions on Antennas and Propagation, 69 (12), 1-1. doi: 10.1109/tap.2021.3090508 Hepatic steatosis detection using differential effective permittivity Featured 2021 Journal Article Flexible electromagnetic cap for three-dimensional electromagnetic head imaging Alqadami, Abdulrahman S. M., Zamani, Ali, Trakic, Adnan and Abbosh, Amin (2021). Flexible electromagnetic cap for three-dimensional electromagnetic head imaging. IEEE Transactions on Biomedical Engineering, PP (9) 9442942, 1-1. doi: 10.1109/tbme.2021.3084313 Flexible electromagnetic cap for three-dimensional electromagnetic head imaging Featured 2021 Journal Article Stroke classification in simulated electromagnetic imaging using graph approaches Zhu, Guohun, Bialkowski, Alina, Guo, Lei, Mohammed, Beada'a and Abbosh, Amin (2021). Stroke classification in simulated electromagnetic imaging using graph approaches. IEEE Journal of Electromagnetics, RF and Microwaves in Medicine and Biology, 5 (1) 9095216, 46-53. doi: 10.1109/JERM.2020.2995329 Stroke classification in simulated electromagnetic imaging using graph approaches Featured 2021 Journal Article Textile Electromagnetic Brace for Knee Imaging Sultan, Kamel, Mahmoud, Ahmed and Abbosh, Amin M. (2021). Textile Electromagnetic Brace for Knee Imaging. IEEE Transactions on Biomedical Circuits and Systems, 15 (3) 9445664, 1-1. doi: 10.1109/TBCAS.2021.3085351 Textile Electromagnetic Brace for Knee Imaging Featured 2021 Journal Article Operational learning-based boundary estimation in electromagnetic medical medical imaging Al-Saffar, A., Zamani, A., Stancombe, A. and Abbosh, A. (2021). Operational learning-based boundary estimation in electromagnetic medical medical imaging. IEEE Transactions on Antennas and Propagation, 70 (3), 2234-2245. doi: 10.1109/tap.2021.3111516 Operational learning-based boundary estimation in electromagnetic medical medical imaging Featured 2020 Journal Article Unsupervised algorithm for brain anomalies localization in electromagnetic imaging Brankovic, Aida, Zamani, Ali, Trakic, Adnan, Bialkowski, Konstanty, Mohammed, Beadaa, Cook, David, Walsham, James and Abbosh, Amin M. (2020). Unsupervised algorithm for brain anomalies localization in electromagnetic imaging. IEEE Transactions on Computational Imaging, 6 9281116, 1595-1606. doi: 10.1109/tci.2020.3041922 Unsupervised algorithm for brain anomalies localization in electromagnetic imaging Featured 2020 Journal Article Compact flexible wideband antenna for on-body electromagnetic medical diagnostic systems Alqadami, Abdulrahman S. M., Nguyen-Trong, Nghia, Stancombe, Anthony E., Bialkowski, Konstanty and Abbosh, Amin (2020). Compact flexible wideband antenna for on-body electromagnetic medical diagnostic systems. IEEE Transactions on Antennas and Propagation, 68 (12) 9103939, 8180-8185. doi: 10.1109/tap.2020.2996815 Compact flexible wideband antenna for on-body electromagnetic medical diagnostic systems Featured 2020 Journal Article Expedited stroke imaging with electromagnetic polar sensitivity encoding Trakic, A., Brankovic, A., Zamani, A., Nguyen-Trong, N., Mohammed, B., Stancombe, A., Guo, L., Bialkowski, K. and Abbosh, A. (2020). Expedited stroke imaging with electromagnetic polar sensitivity encoding. IEEE Transactions on Antennas and Propagation, 68 (12) 9103981, 8072-8081. doi: 10.1109/tap.2020.2996810 Expedited stroke imaging with electromagnetic polar sensitivity encoding Featured 2020 Journal Article Closing the gap of simulation to reality in electromagnetic imaging of brain strokes via deep neural networks Al-Saffar, Ahmed, Bialkowski, Alina, Baktashmotlagh, Mahsa, Trakic, Adnan, Guo, Lei and Abbosh, Amin (2020). Closing the gap of simulation to reality in electromagnetic imaging of brain strokes via deep neural networks. IEEE Transactions on Computational Imaging, 7 9274540, 13-21. doi: 10.1109/tci.2020.3041092 Closing the gap of simulation to reality in electromagnetic imaging of brain strokes via deep neural networks Featured 2020 Journal Article Wearable electromagnetic belt for steatotic liver detection using multivariate energy statistics Rezaeieh, Sasan Ahdi, Brankovic, Aida, Janani, Azin, Mohammed, Beadaa, Darvazehban, Amin, Zamani, Ali, Macdonald, Graeme A. and Abbosh, Amin (2020). Wearable electromagnetic belt for steatotic liver detection using multivariate energy statistics. IEEE Access, 8, 1-1. doi: 10.1109/access.2020.3035657 Wearable electromagnetic belt for steatotic liver detection using multivariate energy statistics Featured 2020 Journal Article Programmable metasurface antenna for electromagnetic torso scanning Darvazehban, Amin, Rezaeieh, Sasan Ahdi and Abbosh, Amin (2020). Programmable metasurface antenna for electromagnetic torso scanning. IEEE Access, 8, 1-1. doi: 10.1109/access.2020.3022870 Programmable metasurface antenna for electromagnetic torso scanning Featured 2020 Journal Article In situ near-field path loss and data communication link for brain implantable medical devices using software-defined radio Manoufali, Mohamed, Bialkowski, Konstanty, Mobashsher, Ahmed Toaha, Mohammed, Beadaa and Abbosh, Amin (2020). In situ near-field path loss and data communication link for brain implantable medical devices using software-defined radio. IEEE Transactions on Antennas and Propagation, 68 (9) 9108598, 6787-6799. doi: 10.1109/tap.2020.2993106 In situ near-field path loss and data communication link for brain implantable medical devices using software-defined radio Featured 2020 Journal Article Calibrated broadband mea",
  "content_length": 33773,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:30"
}