{
  "name": "Amir Hossein Payberah",
  "homepage": "https://www.kth.se/profile/payberah",
  "status": "success",
  "content": "KTH | Amir Hossein Payberah Skip to main content Amir Hossein PayberahAssociate professorKungliga Tekniska Högskolanhttps://www.kth.se/profile/payberahDetailsWorks for Division of Software and Computer SystemsTelephone +46 72 554 40 11Unit address Lindstedtsvägen 30E-mail payberah@kth.seResearcherResearcher IDORCID IDGoogle Scholar IDAbout me I'm an Associate Professor of Computer Science at the Division of Software and Computer Systems (SCS) at KTH Royal Institute of Technology in Sweden. I earned my PhD from KTH in 2013, specializing in distributed systems. Following my doctoral studies, I worked as a postdoctoral researcher at the Research Institute of Sweden (RISE), focusing on data-intensive computing platforms. As a postdoc at RISE, I also had the privilege of working as a guest lecturer at Amirkabir University of Tehran (AUT) from 2013 until 2015. In 2017, I embarked on a role as a machine learning scientist at Oxford University, where I remained until 2018, and subsequently, I returned to KTH as an Assistant Professor of Computer Science. I am currently the program director of the Information and Communication Technology (ICT) doctoral program at EECS, and I also serve as the specialization representative for SCS in ICT. Additionally, I have recently taken on the role of leading the WASP Legal, Ethical, and Societal Aspects cluster. My current research centers around the intersection of equity and justice in AI, particularly in the context of large language models. To explore these ideas further, I initiated the co-liberative computing research group. Our aim at the co-liberative computing research group is to promote critical consciousness within the realms of computer science education and research. Acknowledging the inherent lack of neutrality in computing and its entanglement with societal oppression, our group places a significant emphasis on developing a keen critical awareness to identify and analyze these pervasive inequalities. Our mission revolves around integrating justice and equity as foundational values in computer science research and education. The overarching goal is to ensure that our endeavors not only advance technological knowledge but also serve the greater good for all individuals, contributing to a more inclusive and just society. At the core of our approach is the practice of co-liberation, grounded in the unwavering belief in a collective 'us.' This perspective recognizes the inseparable connection between our individual liberation and the imperative to collaborate for mutual freedom and the equitable redistribution of power. In the context of co-liberation, we advocate for a profound commitment to mutual benefit, underscoring the collective responsibility shared by both dominant and minoritized groups. Through these principles, we aspire to contribute to a transformative and inclusive computing landscape, addressing systemic injustices and fostering a society where technology serves as a force for positive change. This perspective challenges the conventional view of computing services as mere charity, reframing them as powerful tools for building meaningful relationships and addressing demographic disparities. CoursesAdvanced Course in Large Scale Machine Learning and Deep Learning (FID3020), teacher, examinerAdvanced course in Data-Intensive Computing (FID3019), teacher, examinerData Feminism (FID3216), examinerData-Intensive Computing (ID2221), examiner, course responsibleDegree Project in Computer Science and Engineering, specialising in Communication Systems, Second Cycle (DA246X), examinerDegree Project in Computer Science and Engineering, specialising in ICT Innovation, Second Cycle (DA258X), examinerDegree Project in Computer Science and Engineering, specialising in ICT Innovation, Second Cycle (DA256X), examinerDegree Project in Computer Science and Engineering, specializing in Machine Learning, Second Cycle (DA233X), examinerDegree Project in Computer Science and Engineering, specializing in Software Engineering for Distributed Systems, Second Cycle (DA240X), examinerDegree Project in Information and Communication Technology, First Cycle (IA150X), examinerDegree Project in Information and Communication Technology, First Cycle (II143X), examinerDegree Project in Information and Communication Technology, Second Cycle (IA250X), examinerScalable Machine Learning and Deep Learning (ID2223), examiner, course responsibleSystems for Scalable Machine Learning (FID3024), examinerLinksMy homepage",
  "content_length": 4512,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:33"
}