{
  "name": "Amir Houman Sadr",
  "homepage": "https://people.cs.umass.edu/~amir",
  "status": "success",
  "content": "Amir Houmansadr | UMass Amherst Skip to content Amir Houmansadr Professor Manning College of Information and Computer Sciences University of Massachusetts Amherst Email: amir (at) cs.umass.edu [ Public Key ]; Office: 206 Online: Twitter · LinkedIn Bio: I am a Full Professor of Computer Science at the University of Massachusetts Amherst, where I have been a faculty member since Fall 2014 (tenured in Fall 2019). I received my Ph.D. from the University of Illinois at Urbana‑Champaign in 2012 and subsequently spent two years as a postdoctoral scholar at the University of Texas at Austin. Prior to that, I earned my M.Sc. and B.Sc. degrees from Sharif University of Technology. Research Area: My research focuses on network and AI security and privacy , with particular emphasis on privacy‑enhancing technologies and trustworthy AI . I design and deploy censorship circumvention systems, analyze network protocols and services (e.g., messaging platforms and machine‑learning APIs) for privacy leakage, use theoretical tools such as game theory and information theory to derive privacy bounds, and evaluate the security and privacy of emerging AI technologies. Research Team: I lead the Secure, Private Internet (SPIN) Research Group and co‑lead the UMass AI Security Lab . Selected Awards USENIX Security Honorable Mention, 2025 The Caspar Bowden PET Award Runner Up, 2025 FOCI Best Practical Paper Award, 2025 DARPA Director's Award, 2024 COLM Spotlight Paper, 2024 Applied Networking Research Prize (ANRP), 2024 ACM CCS Distinguished Paper Award, 2023 First place at CSAW Applied Research Competition, 2023 Best Practical Paper Award of the FOCI Community, 2023 DARPA Young Faculty Award (YFA), 2022 ACM IMC Best Paper Award Runner‑Up, 2020 CSAW Applied Research Competition Finalist, 2019 NSF CAREER Award, 2016 Google Faculty Research Award, 2015 IEEE S&P Best Practical Paper Award, 2013 News 2025-11-03: Gave a Keynote at Brazil's National backbone Internet measurement (RNP) ! 2025-09-01: Promoted to Full Professor! 2025-08-12: Our paper received an Honorable Mention Award from USENIX Security'25 (top 6% of accepted papers)! 2025-07-17: Our paper on the blocking of fully encrypted protocols recognized as The 2025 Caspar Bowden PET Award Runner Up! 2025-07-14: Spoke on a panel on Internet freedom at PETS ! 2025-07-14: Wallbleed receives the Best Practical Paper Award of 2025 from the FOCI Community! 2025-05-24: The Guardian writes about our Oakland'25 paper ! 2025-05-22: Served on the Privacy Panel at Brazil's SBRC ! 2025-02-28: I gave a keynote at IMPACT ! 2025-01-27: Interview with MassLive on Internet freedom! 2025-01-22: I was on The Fabulous 413 ! 2025-01-06: Article covering our DARPA Director's Award ! 2024-12-01: CensorLab , our censorship emulation testbed, is online! 2024-10-05: Interviewed by WBZ NewsRadio 1030 on online safety. 2024-10-01: Our COLM paper on LLM prompt reproduction is selected as a Spotlight! 2024-02-21: Interviewed by MassLive on Russian Wi‑Fi malware . 2024-01-12: Our USENIX Security paper won a 2024 Applied Networking Research Prize (ANRP) . 2023-11-29: Our CCS'23 paper received a Distinguished Paper Award! 2023-11-11: Our USENIX Security paper won first place at CSAW 2023 Applied Research Competition . 2023-07-10: Our upcoming USENIX Security paper received the 2023 Best Practical Paper Award from the FOCI Community. 2023-05-05: Gave the keynote talk at ICLR BANDS 2023 Workshop . 2023-04-01: Served on a panel at Shasha Seminar for Human Concerns . 2022-10-05: TechCrunch covers GFW Report's findings about TLS censorship. 2022-08-11: Received a DARPA Young Faculty Award (YFA). 2021-07-29: Two finalist proposals for Facebook Privacy‑Enhancing Technologies . 2020-12-10: Invited blog post on the use of ML for censorship circumvention. 2020-10-27: Best Paper Award Runner‑up at ACM IMC'20. 2020-09-01: Interview with The Wire China on recent developments in censorship techniques. 2020-08-08: ZDNet article on our collaborative study of ESNI censorship. 2020-01-23: Three papers accepted at NDSS'20! 2019-11-01: DeepCorr is a finalist at the CSAW’19 Applied Research Competition! 2019-09-01: Promoted to associate professor with tenure! 2018-07-24: Two papers accepted at ACM CCS'18! 2018-05-30: TV interview on Net Neutrality . [+] Older News… 2017-08-22: Received a collaborative NSF Award to investigate IoT Privacy! 2017-08-02: 2/2 papers accepted at ACM CCS'17! Congrats to my students Hadi and Milad! 2017-05-15: Received a collaborative NSF/Intel Award to investigate future network architectures! 2017-04-07: Spoke at a panel at the Obfuscation Workshop at NYU. 2016-12-09: Moderated a panel on Internet censorship at ACSAC 2016 . 2016-11-09: Keynote on Internet censorship at SBSeg 2016 in Niteroi, Brazil. 2016-07-25: Received a collaborative Medium NSF Award to investigate Covert Communications! 2016-07-23: 2/2 papers accepted at CCS'16! Congrats to my students, Hadi and Milad! 2016-02-25: Book on Information Hiding is published! 2016-01-27: Received an NSF CAREER Award ! 2015-12-16: Co‑chaired the 2016 USENIX Workshop on FOCI! 2015-11-20: MIT Technology Review article on CacheBrowser. 2015-07-24: Received an NSF Award to investigate statistical traffic analysis. 2015-02-12: Awarded a Google Faculty Research Award . 2014-05-16: Joining Computer Science at UMass Amherst as an Assistant Professor in the Fall. 2013-11-25: Paper accepted at NDSS 2014: \"No Direction Home: The True Cost of Routing Around Decoys.\" 2013-05-21: Paper won the Best Practical Paper award at IEEE S&P 2013. 2013-01-28: Paper accepted at IEEE S&P 2013: \"The Parrot is Dead: Observing Unobservable Network Communications.\" 2012-10-20: Paper accepted at NDSS 2013: \"I want my voice to be heard: IP over VoIP for unobservable censorship circumvention.\" 2012-07-09: Joined the University of Texas at Austin as a postdoc. 2011-09-01: Featured on UIUC ECE and CSL websites. 2011-07-21: Interviewed by New Scientist about Stegobot . 2011-07-15: Paper Cirripede accepted to ACM CCS 2011. Service Leadership Roles Associate Chair: NDSS 2026 Associate Chair: IEEE S&P 2025, 2026 Associate Editor: IEEE TDSC (2021–2025) Advisory Council: Open Technology Fund Advisory Board: FOCI (2022–now) Steering Committee: NESD (2016–now) Co‑Chair: NESD 2016, 2019; NDSS Posters 2017; USENIX FOCI 2016; IWCC 2014 Technical Program Committees IEEE S&P 2016, 2017, 2018, 2020, 2021, 2025, 2026 ACM IMC 2024 ACM CCS 2015, 2016, 2017, 2019, 2020, 2022, 2023, 2024 USENIX FOCI 2015, 2016 (co‑chair), 2017, 2020, 2024, 2025, 2026 PETS 2014, 2015, 2016, 2018, 2019, 2020, 2023 NDSS 2017, 2018, 2019, 2020, 2021, 2026 USENIX Security 2021 ACSAC 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2022 [+] Past service… Technical Program Committees IEEE CNS 2019, 2020 WTMC 2016, 2017, 2018, 2019 IEEE Symposium on Privacy‑Aware Computing (PAC) 2017 World Conference on Information Security Applications (WISA) 2017 ACM ASIACCS 2016 IEEE GLOBECOM 2016 ICCCN 2016 WPES 2015 Mobidata 2015 IWCC 2015 BCSN 2015 HotPETs 2014 SIMPLEX 2014, 2013 CSNT 2014 IEEE ICNP PhD Forum 2013 ACM STC 2012 FTRA ACSA 2012 Other Service Posters Committee: CODASPY 2015 Guest editor: EURASIP Journal on Information Security (Special Issue on Advances in Digital Forensics) Reviewer: ACM TISSEC; IEEE/ACM Transactions on Networking; IEEE TMC; ACM TAAS; Elsevier Computers & Security; Elsevier Journal of Systems and Software; International Journal of Communication Systems; International Journal of Advanced Robotic Systems; Journal of Computer Networks and Communications External reviewer: CCS'08, ICDCS'09, CCS'09, IEEE S&P'10, WPES'11, CCS'11, NDSS'12, USENIX Security'12, NDSS'13, PETS'13, HotPETs'13 Graduate Representative: ECE Student Advisory Committee (ECESAC), UIUC, 2011–2012 Courses Fall 2025: Advanced Information Assurance (COMPSCI 660) Fall 2025: Seminar: AI Safety, Privacy, and Security (COMPSCI 692PA) [+] Previous courses… Fall 2024: Advanced Information Assurance (CMPSCI 660) Fall 2023: Advanced Information Assurance (CMPSCI 660) Fall 2022: Advanced Information Assurance (CMPSCI 660) Fall 2020: Advanced Information Assurance (CMPSCI 660) Fall 2020: Seminar - CyberSecurity Lecture Series (CMPSCI 591CF) Fall 2019: Introduction to Computer and Network Security (CMPSCI 460) Fall 2019: Seminar - CyberSecurity Lecture Series (CMPSCI 591CF) Spring 2019: Advanced Information Assurance (CMPSCI 660) Fall 2018: Introduction to Computer and Network Security (CMPSCI 460) Fall 2018: Seminar - CyberSecurity Lecture Series (CMPSCI 591CF) Spring 2018: Advanced Information Assurance (CMPSCI 660) Fall 2017: Introduction to Computer and Network Security (CMPSCI 460) Spring 2017: Advanced Information Assurance (CMPSCI 660) Fall 2016: Introduction to Computer and Network Security (CMPSCI 460/597N) Fall 2016: Seminar - CyberSecurity Lecture Series (CMPSCI 591CF) Fall 2015: Introduction to Computer and Network Security (CMPSCI 460) Fall 2015: Special Topics - Introduction to Computer and Network Security (CMPSCI 597N) Fall 2015: Seminar - Cyber Security Faculty Lecture Series (CMPSCI 591CF) Spring 2015: Advanced Information Assurance (CMPSCI 660) Fall 2014: Hot Topics in Privacy Enhancing Technologies (CMPSCI 691PT)",
  "content_length": 9250,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:32"
}