{
  "name": "Amir Sabbagh Molahosseini",
  "homepage": "https://pure.qub.ac.uk/en/persons/amir-sabbagh-molahosseini",
  "status": "success",
  "content": "Amir Sabbagh Molahosseini - Queen's University Belfast View Scopus Profile Amir Sabbagh Molahosseini Dr Lecturer, School of Electronics, Electrical Engineering and Computer Science https://orcid.org/0000-0003-3603-9401 EmailA.SabbaghMolahosseiniqub.acuk Room 03.032 - Computer Science BuildingUnited Kingdom Accepting PhD Students 20082025 Research activity per year Personal profile Fingerprint Dive into the research topics where Amir Sabbagh Molahosseini is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 5 Similar Profiles Number System Computer Science 100% Adders Engineering 25% Floating Point Computer Science 24% Datapath Computer Science 22% Design Computer Science 16% Energy Efficient Computer Science 15% Computation Computer Science 13% Prefix Adder Computer Science 11% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2008 2015 2017 2019 2022 2023 2024 2025 14 Article 6 Conference contribution 1 Chapter 1 Chapter (peer-reviewed) 1 More 1 Poster Research output per year Research output per year Software-defined number formats for high-speed belief propagationSabbagh Molahosseini, A., Lee, J. & Vandierendonck, H., 20 Jan 2025, (Early online date) In: IEEE Transactions on Emerging Topics in Computing. 14 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Point Format 100% Number Format 100% Floating Point 100% Belief Propagation 100% Double Precision 40% 21 Downloads (Pure) Exploiting data redundancy in CKKS encoding for high-speed homomorphic encryptionSabbagh Molahosseini, A. & Vandierendonck, H., 01 Jul 2024, ASIA CCS '24: proceedings of the 2024 ACM Asia Conference on Computer and Communications Security. Association for Computing Machinery, p. 990 - 1002 (Proceedings of the ACM Asia Conference on Computer and Communications Security).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Homomorphic Encryption 100% Data Redundancy 100% Real Number 66% Hardware Implementation 33% Software Library 33% 102 Downloads (Pure) Software-defined number formats: bridging the gap between accuracy, performance and securitySabbagh Molahosseini, A. & Vandierendonck, H., 09 Sept 2024.Research output: Contribution to conference › Poster › peer-review File Floating Point 100% Single Application 100% Moore's Law 100% Computing Device 100% Memory Bandwidth 100% 14 Downloads (Pure) Resource-efficient convolutional networks: a survey on model, arithmetic, and implementation-level techniquesLee, J., Mukhanov, L., Sabbagh Molahosseini, A., Minhas, U., Hua, Y., Martinez-del-Rincon, J., Dichev, K., Hong, C.-H. & Vandierendonck, H., 14 Mar 2023, (Early online date) In: ACM Computing Surveys.Research output: Contribution to journal › Article › peer-review Open AccessFile Survey 100% Level Technique 100% Convolutional Network 100% Convolutional Neural Network 100% Arithmetic Model 100% 26 Citations (Scopus) 235 Downloads (Pure) uLog: a software-based approximate logarithmic number system for computations on SIMD processorsJahanshahi, S., Sabbagh Molahosseini, A. & Emrani Zarandi, A. A., Feb 2023, In: The Journal of Supercomputing. 79, 2, p. 1750–1783 34 p.Research output: Contribution to journal › Article › peer-review Open AccessFile SIMD 100% Number System 100% Software Implementation 66% Floating-Point Number 66% Double Precision 33% 3 Citations (Scopus) 92 Downloads (Pure) View all 23 research outputs",
  "content_length": 3860,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:36"
}