{
  "name": "Amir Shaikhha",
  "homepage": "https://amirsh.github.io",
  "status": "success",
  "content": "Amir Shaikhha Amir ShaikhhaAssociate Professor Follow Edinburgh, United Kingdom Twitter LinkedIn Github Google ScholarAmir Shaikhha is an Associate Professor (Reader) in the School of Informatics at the University of Edinburgh. His research focuses on the design and implementation of data-analytics systems by using techniques from the databases, programming languages, compilers, and machine learning communities. He was a Departmental Lecturer at the University of Oxford (2019-2020) before starting as an Assistant Professor (Lecturer) at the University of Edinburgh (2020-2024). He earned his Ph.D. from EPFL in 2018, for which he was awarded a Google Ph.D. Fellowship in structured data analysis, as well as a Ph.D. thesis distinction award. He has won the Best Paper Award at GPCE 2017, the Most Reproducible Paper Award at SIGMOD 2017, the Most Influential Paper Award at GPCE 2024, Google Research Scholar Award 2025, and Dahl-Nygaard Junior Prize 2025. He (co-)chaired the program committees of GPCE, DBPL, Scala, Sparse, and DRAGSTERS.July 2025. I gave a keynote at ECOOP’25.June 2025. I am honoured to receive a Google Research Scholar Award.May 2025. I am honoured to receive this year’s Dahl-Nygaard Junior Prize.April 2025. I will co-organize (together with Saman, Fred, and Gilbert) and give a talk in Sparse@PLDI’25.March 2025. Our paper on Slotted E-Graphs together with Michel’s group, Thomas, and Andres has been accepted to PLDI’25.February 2025. Our work on DASTAC has been accepted to OOPSLA’25.January 2025. Torsten Grust and I are organizing DBPL 2025. Consider submitting a paper.January 2025. I have been invited as a keynote speaker in ARRAY@PLDI’25.Novemeber 2024. Our paper on program synthesis for quantum simulation accepted to CGO 2025.September 2024. We have received the Most Influential Paper Award in GPCE 2024.August 2024. I have been promoted to Associate Professor (Reader).August 2024. My work on restaging DSLs has been accepted to GPCE 2024.July 2024. We have open sourced StructTensor.June 2024. We have open sourced VecHT.May 2024. Hesam Shahrokhi has successfully completed his PhD. He is joining Huawei Research.May 2024. I was selected for an Outstanding Reviewer Award in ICDE 2024.April 2024. PyTond for compiling Python Data Science code to database queries accepted to ICDE 2024.March 2024. Jingwen and Callum were awarded the 1st place in CGO student research competition.December 2023. Youning awarded the Computer Science MSc Dissertation Prize.November 2023. Our paper on optimizing nested recursive queries accepted to SIGMOD 2024.October 2023. We will present our work on probabilistic programming in LAFI 2024.August 2023. Our paper on automatic differentiation for sparse tensors accepted to appear at CGO 2024.July 2023. Our paper on structured tensor algebra accepted to OOPSLA 2023.June 2023. The demonstration for OpenDBML accepted to appear at VLDB 2023.May 2023. I was selected for a Best Reviewer Award in SIGMOD 2023.April 2023. The demonstration for SDQL.py accepted to appear at SIGMOD 2023.March 2023. I will serve as the PC Chair of GPCE 2023; consider submitting a paper.February 2023. Our work on combining prefetching with vectorization for hash tables accepted to appear at ECOOP 2023.January 2023. I will be co-chairing DRAGSTERS’23. Consider submitting a paper.December 2022. Two papers accepted in CC 2023: BayesTensor and SDQL.py.November 2022. Our work on using machine learning for data structure selection accepted to appear at CGO 2023.October 2022. Our work on Deep Loop Fusion accepted to appear at GPCE 2022.August 2022. STOREL for tensor processing on flexible storage accepted to SIGMOD 2023.You can find my articles on my Google Scholar profile.2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2014 Dahl-Nygaard Junior Prize, 2025.Google Research Scholar Award, 2025.Program Committee Honorable Mention, EDBT 2025.Most Influential Paper Award, GPCE 2024.Outstanding Reviewer Award, ICDE 2024.[Student Award] 1st place in both undergraduate and graduate categories in student research competition, CGO 2024.[Student Award] Computer Science MSc Dissertation Prize, Edinburgh, 2023.Best Reviewer Award, SIGMOD 2023.Nominated for Best Supervisor of the Year, University of Edinburgh, 2022.Ph.D. Thesis Distinction Award, EPFL, 2018.Service Award, IC EPFL, 2018.Best Paper Award, GPCE 2017.Most Reproducible Paper Award, SIGMOD 2017.Google Ph.D. Fellowship, 2017.Teaching Assistant Award, IC EPFL, 2016.Chairing: Sparse’25,’24 (Co-Chair), GPCE’25 (General Co-Chair), DBPL’25,’21 (Co-Chair), GPCE’23 (PC Chair), DRAGSTERS’23 (Co-Chair), Scala’22 (PC Chair).Organization: SSIGMOD’26 (AE), OOPSLA’26, VLDB’26,’25,’23 (PC), ECOOP’26, SIGMOD’25,’23 (PC), EDBT’25 (PC), VLDB’25 (Publicity Co-Chair), CGO’24 (Finance Chair), GPCE’24,’22 (PC), ICDE’24 (PC), APLAS’24 (PC), TFP’22 (PC), DBAI’21 (PC), BICOD’21 (PC), ASPLOS’20 (ERC), DBPL’19 (PC).Reviewer: TOPLAS 2025, TACO 2024, VLDBJ 2024, TOMS 2024, TKDE 2023, TODS 2023, TODS 2021, VLDBJ 2020, TODS 2018.PhD Students’ Representative: IC EPFL, 2017-2018.Member of EPIC PhD Student Association: IC EPFL, 2017.Ziawasch Abedjan (TU Berlin), Anastasia Ailamaki (EPFL), Matthias Boehm (TU Berlin), Andrés Goens (University of Amsterdam), Tobias Grosser (University of Cambridge), Mathieu Huot (MIT), Thomas Koehler (CNRS), Hung Ngo (RelationalAI), Martin Odersky (EPFL), Dan Olteanu (UZH), Babak Salimi (UCSD), Michel Steuwer (TU Berlin), Dan Suciu (University of Washington).I do not have any open positions right now.",
  "content_length": 5544,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:35"
}