{
  "name": "Amitabha Bagchi",
  "homepage": "http://www.cse.iitd.ernet.in/~bagchi",
  "status": "success",
  "content": "Amitabha Bagchi's Homepage Amitabha Bagchi Professor Department of Computer Science and Engineering IIT Delhi Email: bagchi at cse dot iitd dot ac dot in Phone: (91 11) 2659 6397 Research Interests: Data Algorithmics and Analytics, Probability and Networks. Currently Teaching: COL863. Special topics in Theoretical Computer Science: Concentration inequalities and their Applications in Computer Science. I Sem 2025-26. (Also listed as COL7188 for 2025 Entry students.) COQ302. Seminar. I Sem 2025-26. Previously taught courses. Reference letter policy: I only give reference letters to students who have worked on a project under my supervision or who have performed extremely well in an advanced (700+ level) course. I will not be able to write letters for any purpose for students who have taken a 100 level course with me. Note that I will not be verifying course assignments/projects as resume items. Also: If you just need someone to certify that you are/were a student here then please contact the UG/PG Section, I am not the right person for this. Research Publications 2025 Amitabha Bagchi, Ankan Pal, Suyash Kumar. Quantifying Skill on Opinion Trading Platforms. Technical report, IIT Delhi, March 2025. Download here. 2024 Raj Kamal, Amitabha Bagchi. A Lovasz-Simonovits Theorem for Hypergraphs with Application to Local Clustering. Accepted to ACM SIGMOD/PODS International Conference on Management of Data (SIGMOD 2025), June 2025. Published as Proc. ACM. Managment of Data, 2(4):1-27, Article No. 190, 30 September 2024. doi:10.1145/3677126. Download here. Sumaiya Dabeer, Amitabha Bagchi, Rahul Narain. GP-LSolve: An Efficient GPU-based Laplacian Solver for Million-scale Graphs. In Proceedings of IPDPS Workshops: 14th IEEE Workshop on Parallel/Distributed Combinatorics and Optimization (PDCO 2024), pp 890-899, May 2024. doi:10.1109/IPDPSW63119.2024.00158. Harsh Pandey, Amitabha Bagchi, Srikanta J. Bedathur, Arindam Bhattacharya. Data-Dependent Generalization Bounds for Neural Networks with ReLU. In T. Mach. Learn. Res, February 2024. Openreview link. 2023 Mahdihusain Momin, Raj Kamal, Shantwana Dixit, Sayan Ranu, Amitabha Bagchi. KWIQ: Answering k-core Window Queries in Temporal Networks. In 26th International Conference on Extending Database Technology (EDBT '23), pp 208-220, March 2023. doi:10.48786/EDBT.2023.17 2022 Ashish R Nair, Rahul Yadav, Anjali Gupta, Abhijnan Chakraborty, Sayan Ranu, Amitabha Bagchi. Gigs with guarantees: Achieving Fair Wage for Food Delivery Workers In Proceedings of the 31st Intl Joint Conference on AI (IJCAI 2022). pp 5122-5128, July 2022. doi:10.24963/ijcai.2022/711. Arindam Bhattacharya, Chathur Gudesa, Amitabha Bagchi, Srikanta Bedathur. New wine in an old bottle: Data-aware Hash Functions for Bloom Filters. Proc. VLDB Endowment 15(9):1924-1936, May 2022. doi:10.14778/3538598.3538613. Manas Joshi, Arshdeep Singh, Sayan Ranu, Amitabha Bagchi, Priyank Karia and Puneet Kala. Foodmatch: Batching and Matching for Food Delivery in Dynamic Road Networks. ACM Trans. Spat. Algorithms Syst. 8(1), Article no. 6, pp 1-25, March 2022. doi:10.1145/3494530 Iqra Altaf Gillani, Amitabha Bagchi, Pooja Vyavahare. A Stochastic Process on a Network with Connections to Laplacian Systems of Equations. Adv. Appl. Probab. 54(1):254-278, March 2022. doi:10.1017/apr.2021.27 View video presentation. Download here. Anjali, Rahul Yadav, Ashish Nair, Abhijnan Chakrabarty, Sayan Ranu, Amitabha Bagchi. FairFoody: Bringing in Fairness in Food Delivery. In Proceesings of the 36th AAAI Conference on Artificial Intelligence (AAAI 2022), pp 11900-11907, February 2022. doi10.1609/aaai.v36i11.21447. Nithin Naga Manne, Shilvi Satpati, Tanu Malik, Amitabha Bagchi, Ashish Gehani, Amitabh Chaudhary. CHEX: Multiversion Replay with Ordered Checkpoints. In Proc. VLDB Endowment 15(6):1297-1310, February 2022. doi:10.14778/3514061.3514075 Previous publications by year.",
  "content_length": 3912,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:46"
}