{
  "name": "Amit Kumar Singh 0002",
  "homepage": "https://www.essex.ac.uk/people/singh42308/amit-singh",
  "status": "success",
  "content": "Amit Singh | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Amit Singh People Dr Amit Singh Reader School of Computer Science and Electronic Engineering (CSEE) Email a.k.singh@essex.ac.uk Location 5A.529, Colchester Campus Academic support hours During Autumn term, my Academic Support Hours will be 14:00-16:00 on Tuesday. If you want to join over Zoom, look for the zoom link on my CE151-NWU course MOODLE page and wait in the zoom waiting room until I can admit you. To meet outside these hours, please email me. Note: My office is 5A.529 **NOT** 1NW.3.19 Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Currently, a Reader at University of Essex, UK. He also serves as deputy academic lead for a joint program between University of Essex and Norwest University (NWU), China, and earlier served as Years 1 engineering lab manager. He has a post-doctoral research experience for over five years at several reputed universities. He received the B.Tech. degree in Electronics Engineering from Indian Institute of Technology (Indian School of Mines), Dhanbad, India, in 2006, and the Ph.D. degree from the School of Computer Engineering, Nanyang Technological University (NTU), Singapore, in 2013. He also worked in industry with HCL Technologies, India for a year and half until 2008. His current research interests are design and optimisation of intelligent computing systems for various application domains like multimedia, transportation, automotive, healthcare, cloud, etc. The design and optimisation principles can have inspirations from AI, Biology, Market, Heuristics, etc. to fulfil the application domain needs of security, reliability, energy-efficiency and/or performance. He has published over 140 papers in reputed journals/conferences, and received several notable recognitions, like most viewed (#1) article of future internet 2021, the most popular article of IEEE Access 2019, IEEE TC February 2018 Featured Paper, best paper awards at ICAC 2025, ICCES 2017, ISORC 2016, PDP 2015 and HiPEAC 2013, and GLSVLSI 2014 runner up. He has served on organising committees of IEEE COINS 2025 (General Co-Chair), IEEE COINS 2024 (General Chair), ESWeek 2020-22 (Publication Chair), ICCAD 2022 (Track Chair), CF 2021 (Publicity Co-Chair), AHS 2019 (Local Co-Chair), and created special sessions at CODES+ISSS ‘21 and MCSoC ‘21. He serves on editorial boards of IEEE TCAD, IEEE ESL, Springer DAES and JLPEA, and on TPCs of prestigious conference like DAC, DATE, ICCAD, CASES and CODES+ISSS. He also served as external examiner for research students’ thesis of various countries like Norway, Brazil, Sweden and India. He is Associate College Member of Engineering and Physical Sciences Research Council (EPSRC), a Fellow of the Higher Education Academy and members of IEEE and ACM. Prospective students and post-doctorate researchers interested in pursuing research in the direction of computer architecture and intelligent system design for various application domains are encouraged to contact him by e-mail along with their CV. Qualifications PhD Nanyang Technological University, (2013) B. Tech. Indian Institute of Technology (Indian School of Mines), Appointments University of Essex Reader, Computer Science and Electronic Engineering, University of Essex (1/10/2023 - present) Senior Lecturer, Computer Science and Electronic Engineering, University of Essex (1/10/2020 - 30/9/2023) Lecturer, Computer Science and Electronic Engineering, University of Essex (14/9/2017 - 30/9/2020) Other academic Senior Research Fellow, School of Electronics and Computer Science, University of Southampton (1/9/2016 - 31/8/2017) Research Associate, Department of Computer Science, University of York (1/9/2014 - 31/8/2016) Research Fellow, Department of Electrical and Computer Engineering, National  University of Singapore (14/2/2012 - 27/8/2014) Research and professional activities Research interests Secure, Reliable, Low Power and High Performance Intelligent Computing Systems Key words: Design Open to supervise Multi-/Many-core systems Key words: Many-core computing Open to supervise Design Space Exploration Key words: Design space pruning Open to supervise Resource Management Key words: AI based resource management Open to supervise HPC Data centers and Cloud Computing Key words: Cloud computing Open to supervise Embedded and Distributed AI Using AI for small scale embedded systems. AI for connected embedded systems. Key words: Edge AI Open to supervise Current research Understanding Commercialisation Potential of Embedded Machine Learning Technology to Help in Achieving Net Zero Emissions Bringing a promising Machine learning based technology in smartphones and laptops that has potential to reduce energy consumption and improve reliability closer to market More information about this project Conferences and presentations EdgeCoolingMode: An Agent Based Thermal Management Mechanism for DVFS Enabled Heterogeneous MPSoCs IEEE International Conference on VLSI Design and Embedded Systems, New Delhi, India, 7/1/2019 Spectrum of Run-time Management for Modern and Next Generation Multi/Many-core Systems IEEE/ACM Embedded Systems Week, Torino, Italy, 7/10/2018 Online Concurrent Workload Classification for Multi-core Energy Management IEEE Design, Automation & Test in Europe (DATE), Dresden, Germany, 21/3/2018 Reliable Mapping and Partitioning of Performance-constrained OpenCL Applications on CPU-GPU MPSoCs Invited presentation, ACM/IEEE International Conference on Hardware/Software Codesign and System Synthesis (CODES+ISSS),, Seoul, South Korea, 20/10/2017 ITMD: Run-time Management of Concurrent Multi-Threaded Applications on Heterogeneous Multi-cores IEEE Design, Automation & Test in Europe (DATE), Lausanne, Switzerland, 22/3/2017 Energy-aware Resource Allocation in Multi-mode Automotive Applications with Hard Real-Time Constraints IEEE International Symposium on Real-Time Computing (ISORC), York, United Kingdom, 18/5/2016 Value and Energy Aware Adaptive Resource Allocation of Soft Real-time Jobs on Many-core HPC Data Centers IEEE International Symposium on Real-Time Computing (ISORC), York, United Kingdom, 17/5/2016 Feedback-Based Admission Control for Hard Real-Time Task Allocation under Dynamic Workload on Many-core Systems International Conference on Architecture of Computing Systems (ARCS), Nuremberg, Germany, 13/4/2016 Benchmarking, System Design and Case-studies for Multi-core based Embedded Automotive Systems International Workshop on Dynamic Resource Allocation and Management in Embedded, High Performance and Cloud Computing (DreamCloud), co-located with the HiPEAC, Prague, Czech Republic, 12/1/2016 Value and Energy Optimizing Dynamic Resource Allocation in Many-core HPC Systems IEEE International Conference on Cloud Computing Technology and Science (CloudCom), Vancouver, Canada, 15/12/2015 Market-inspired Dynamic Resource Allocation in Many-core High Performance Computing Systems IEEE International Conference on High Performance Computing & Simulation (HPCS), Amsterdam, Netherlands, 21/7/2015 Exploiting Loop-Array Dependencies to Accelerate the Design Space Exploration in High Level Synthesis IEEE Design, Automation & Test in Europe (DATE), Grenoble, France, 18/3/2015 Thermal-Aware Mapping of Streaming Applications on 3D Multi-Processor Systems IEEE Symposium on Embedded Systems for Real-Time Multimedia (ESTIMedia), Montreal, Canada, 9/10/2013 Energy Optimization by Exploiting Execution Slacks in Streaming Applications on Multiprocessor Systems ACM/EDA/IEEE Design Automation Conference (DAC), Austin, United States, 27/6/2013 Mapping on Multi/Many-Core Systems: Survey of Current and Emerging Trends ACM/EDA/IEEE Design Automation Conference (DAC), Austin, United States, 25/6/2013 A Hybrid Strategy for Mapping Multiple Throughput-constrained Applications on MPSoCs IEEE/ACM International Conference on Compilers, Architectures and Synthesis of Embedded Systems (CASES), Taipei, Taiwan, Province of China, 10/10/2011 A Design Space Exploration Methodology for Application Specific MPSoC Design IEEE Annual Symposium on VLSI (ISVLSI), Chennai, India, 12/7/2011 Preprocessing-based Run-time Mapping of Applications on NoC-based MPSoCs IEEE Annual Symposium on VLSI (ISVLSI), Chennai, India, 12/7/2011 Mapping Real-life Applications on Run-time Reconfigurable NoC-based MPSoC on FPGA IEEE International Conference on Field Programmable Technology (FPT), Beijing, China, 10/12/2010 Efficient Task Mapping in Multi-tasking Heterogeneous MPSoC Platforms IEE Asia-Pacific Embedded Systems Education and Research Conference (APESER), Singapore, Singapore, 10/12/2009 Mapping Algorithms for NoC-based Heterogeneous MPSoC Platforms IEEE Euromicro Conference on Digital System Design (DSD), Patras, Greece, 18/8/2009 Teaching and supervision Current teaching responsibilities Team Project Challenge (CE101) Introduct",
  "content_length": 43465,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:42"
}