{
  "name": "Amitangshu Pal",
  "homepage": "https://www.cse.iitk.ac.in/users/amitangshu",
  "status": "success",
  "content": "﻿ Home Page: Amitangshu Pal Home Research Publications Teaching Resume Contact Amitangshu Pal Assistant Professor Computer Science and Engineering Indian Institute of Technology Kanpur Welcome to my webpage I am an Assistant Professor in Department of Computer Science and Engineering at Indian Institute of Technology (IIT), Kanpur. Previously, I was an Assistant Professor of Instruction in Department of Computer and Information Sciences at Temple University. I was also a postdoctoral scholar at Temple University under the supervision of Professor Krishna Kant . I have completed my PhD from the Department of Electrical and Computer Engineering, The University of North Carolina at Charlotte. I had the pleasure to be advised by Professor Asis Nasipuri during the course of my PhD. PhD Opening: I have PhD openings specifically in the following areas/projects: 1. Smart sensing/communication for IoT devices (2 positions available, fully funded): Good knowledge of embedded systems, working experiance with different microcontrollers, sensors are preferred. 2. Challenging areas in Computer Networks: Good knowledge of Computer Networks and Systems is required. If you think yourself for any of these areas, please drop me an email (amitangshu@cse.iitk.ac.in) with your CV. I am also actively looking for self-motivated and hard-working masters, PhD students, and postdocs with diverse and inter-disciplinary backgrounds, especially those who are interested in Smart sensing and computing, Internet of Things (IoTs), Machine learning/Deep learning assisted sensing/communication/networking and/or Computer Networks. If you are willing to work with me, please drop me an email with your CV. Please notice that I do not have any short term project/internship positions. If you are interested to do a UGP, kindly make sure that you are ready to work on a problem for atleast a year, as anything lesser than that does not lead to any meaningful outcome. Research Interests Internet of Things: Smart sensing, computing and communication, access control in multi-party IoT environments, building IoT solutions for smart cities, buildings, smart wearable solutions. Satellite Internet: Low-Earth orbit (LEO) satellite networks, satellite trajectory and topology design, routing and handoff management, transport protocols and congestion control. Energy Harvesting Wireless Sensor Networks: Energy-aware routing, power control, dynamic channel selection, dynamic sampling rate adaptation, localization, experimental testbed development and validation. (Tinyos codes are available in https://github.com/Amitangshu/) Perishable Food Quality Sensing and Communication: Building cyber-physical systems for perishable food logistics, sensing and communication through food medium, policy management and information sharing, agility and reconfigurability. Disaster Management Networks: Reliable sensing and communications, smartphone based ad-hoc networks, energy-aware forwarding, data gathering and analytics. Wireless-Optical Access Networks: Network architecture planning and setup, joint routing and channel selection schemes, quality of service, power efficiency. Multihop Wireless Networks: Routing, medium access control, cross-layer optimizations, mod- eling and performance evaluation. Others: Content centric networks, Data Center Networks, Enterprise Networks. About me: I spent the first eighteen years of my life in a small quiet town named Midnapore in the southern part of the state of West Bengal in India. My family consists of my parents and my two elder brothers, both married. I have also spent four years at the \"City of Joy\" Kolkata where I have completed my undergraduate study at the Department of Computer Science and Engineering, Jadavpur University in 2008.",
  "content_length": 3779,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:46"
}