{
  "name": "Amitabh Basu",
  "homepage": "https://www.ams.jhu.edu/~abasu9",
  "status": "success",
  "content": "Homepage of Amitabh Basu Contact information Mailing Address: Amitabh Basu Department of Applied Mathematics and Statistics Johns Hopkins University Wyman Park Building, Room S438 3400 North Charles Street Baltimore, MD 21218 Department office: Wyman S438 Phone: 410-516-7582 Email: basu.amitabh[AT]jhu[DOT]edu I'm a Professor in the Applied Mathematics and Statistics department, with a secondary appointment in the Computer Science department, at Johns Hopkins University. I obtained my PhD in the ACO program at Carnegie Mellon University, advised by Gerard Cornuejols. My research interests lie in Optimization (with current emphasis on Integer Programming), Discrete and combinatorial geometry, and Convex analysis, and the applications of these tools in Operations Research, Astronomy and Data Science. Heard while eavesdropping on a mathematician: \"These schemes are pointless\" Resume pdf Professional Service Area Editor, Mathematics of Operations Research, 2023 -- present. Associate Editor, SIAM Journal on Optimization, 2023 -- present. Organizing committee member, SIAM conference on optimization, 2023. Associate Editor, Mathematical Programming, 2022 -- present. Editorial board member, MOS-SIAM Series on Optimization, 2021 -- present. Associate Editor, Discrete Optimization, 2017 -- 2022. Associate Editor, Mathematics of Operations Research, 2013 -- 2022. Chair, Local organization committee, Integer Programming and Combinatorial Optimization (IPCO) conference, 2025. Program Committee, Integer Programming and Combinatorial Optimization (IPCO) conference, 2019, 2020, 2025. Program Committee, International Symposium on Combinatorial Optimization (ISCO) conference, 2018, 2020, 2022, conference co-chair in 2024. Vice Chair (Integer and Discrete Optimization), INFORMS Optimization Society, 2015-17. Chair, Program Committee, Mixed Integer Programming workshop (MIP), 2014. Program Committee, Mixed Integer Programming workshop (MIP), 2013. Program Committee, Bay Area Discrete Math Day (BADMath), 2012-2013. Chair, Local organization committee, Mixed Integer Programming workshop (MIP), 2012. Teaching Current Courses AMS 553.665: Introduction to Convexity AMS 553.766: Combinatorial Optimization Past Courses Johns Hopkins U. AMS 553.465/665: Introduction to Convexity (Fall 2016, 2017, 2018, 2022, 2023, 2024, Spring 2024) AMS 553.766: Combinatorial Optimization (Fall 2013, 2014, 2015, Spring 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024) AMS 553.761: Nonlinear Optimization I (Fall 2018, 2019, 2020, 2022) AMS 553.472/672: Graph Theory (Spring 2014, 2015, 2016) UC Davis MAT 25 (Spring 2013) MAT 17B (Fall 2011, Spring 2012, Fall 2012) MAT 165 (Fall 2012) MAT 16A (Spring 2012) MAT 16B (Spring 2011) MAT 16C (Spring 2011) In the 2010-2011 session, I led an RFG on Applications of Convex Geometry, as part of the NSF funded VIGRE program of the Department of Mathematics. Some lecture notes from the Fall session. The Winter quarter activities are recorded here. The Spring activities will be updated on this page. Carnegie Mellon Advanced Integer Programming (Spring 2010) Book Convexity and its Applications in Discrete and Continuous Optimization Errata Research Papers Preprints/Papers Under Review Generalization Guarantees for Learning Branch-and-Cut Policies in Integer Programming, submitted (with H. Cheng) On the power of graph neural networks and the role of the activation function, submitted (with S. Khalife) Journal Articles and Refereed Conference Proceedings Fast Catalog Matching for Improved Posteriors via Constrained Clustering, (with J. Feitelberg and T. Budavari), The Astronomical Journal, vol. 169 (4), 2025. Learning cut generating functions for integer programming, (with H. Cheng), Neural Information Processing Systems (NeurIPS), 2024. Sample complexity of algorithm selection using neural networks and its applications to branch-and-cut, (with H. Cheng, S. Khalife and B. Fiedorowicz), Neural Information Processing Systems (NeurIPS), 2024. A universal transfer theorem for convex optimization algorithms using inexact first-order oracles, (with P. Kerger, M. Molinaro, H. Jiang), Proceedings of the International Conference on Machine Learning (ICML), 2024. Information complexity of mixed-integer convex optimization, (with H. Jiang, P. Kerger, M. Molinaro), Mathematical Programming, vol. 210(1), pp. 3--45. A preliminary version appeared in Proceedings of IPCO 2023, Lecture Notes in Computer Science, vol. 12904, pp. 1--13. Neural networks with linear threshold activations: structure and algorithms, (with S. Khalife and H. Cheng), Mathematical Programming, vol. 206, 2024, pp. 333--356. A preliminary version appeared in Proceedings of IPCO 2022, Lecture Notes in Computer Science, vol. 13265, pp. 347--360. Fast Globally Optimal Catalog Matching using MIQCP, (with J. Feitelberg and T. Budavari), The Astronomical Journal, vol. 166(4), October 2023. Complexity of optimizing over the integers, Mathematical Programming, vol. 200, 2023, pp. 739--780. Complexity of branch-and-bound and cutting planes in mixed-integer optimization, (with M. Conforti, M. Di Summa and H. Jiang), Mathematical Programming, vol. 198 (1), 2023, pp. 787--810. Complexity of branch-and-bound and cutting planes in mixed-integer optimization -- II, (with M. Conforti, M. Di Summa and H. Jiang), Combinatorica, vol. 42, 2022, pp. 971--996. A preliminary version appears in Proceedings of IPCO 2021, Lecture Notes in Computer Science, vol. 12707, pp. 383--398. Two-halfspace closure, (with H. Jiang), Mathematical Programming, vol. 197, 2023, pp. 411--426 (short communication). Distance-based Positive and Unlabeled Learning for Ranking, (with H. S. Helm, A. Athreya, Y. Park, J. T. Vogelstein, M. Winding, M. Zlatic, A. Cardona, P. Bourke, J. Larson, C. White, C. E. Priebe), Pattern Recognition, vol. 134, Feb 2023, article id 109085. DOI link. Globally optimal and scalable N-way matching of astronomy catalogs, (with T. Nguyen, T. Budavari), The Astronomical Journal, vol. 163(6), article id. 296, May 2022. Enumerating integer points in polytopes with bounded subdeterminants, (with H. Jiang), SIAM J. on Discrete Mathematics, vol. 36(1), 2022, pp. 449--460. Towards Lower Bounds on the Depth of ReLU Neural Networks, (with C. Hertrich, M. Di Summa, M. Skutella), Proceedings of Advances in Neural Information Processing Systems (NeurIPS) 2021. Split cuts in the plane, (with M. Conforti, M. Di Summa and H. Jiang), SIAM Journal on Optimization, vol. 31(1), 2021, pp. 331--347. Admissibility of solution estimators for stochastic optimization, (with T. Nguyen and A. Sun), SIAM Journal on Mathematics of Data Science, vol. 3(1), 2021, pp. 31--51. Mixed-integer bilevel representability, (with C. Ryan and S. Sriram), Mathematical Programming, vol. 185, 2021, pp. 163--197. Optimal Probabilistic Catalogue Matching for Radio Sources, (with D. Fan, T. Budavari, R. Norris), Monthly Notices of the Royal Astronomical Society, vol. 498(1), October 2020, pp. 565--573. An extreme function which is nonnegative and discontinuous everywhere, (with M. Conforti and M. Di Summa), Mathematical Programming, vol. 179, 2020, pp. 447--453 (short communication). The structure of the infinite models in integer programming, (with M. Conforti, M. Di Summa, and J. Paat), Mathematics of Operations Research, vol. 44(4), 2019, pp. 1412--1430. A preliminary version appears in Proceedings of IPCO 2017, Lectures Notes in Computer Science, vol. 10328, pp. 63--74. Mixed-integer linear representability, disjunctions, and variable elimination -- modeling implications, (with K. Martin, C. Ryan, and G. Wang), Mathematics of Operations Research, vol. 44(4), 2019, pp. 1264--1285. A preliminary version appears in Proceedings of IPCO 2017, Lectures Notes in Computer Science, vol. 10328, pp. 75--85. Optimal cutting planes from the group relaxations, (with M. Conforti, M. Di Summa and G. Zambelli), Mathematics of Operations Research, vol. 44(4), 2019, pp. 1208--1220. Robust registration of astronomy catalogs with applications to the Hubble Space Telescope, (with F. Tian, T. Budavari, S. Lubow, and R. White), The Astronomical Journal, vol. 158(5), article id. 191, Oct. 2019. Non-unique lifting of integer variables in minimal inequalities, (with S. Dey and J. Paat), SIAM Journal on Discrete Mathematics, vol. 33(2), 2019, pp. 755--783. Can cut generating functions be good and efficient?, (with S. Sriram), SIAM Journal on Optimization, vol. 29(2), 2019, pp. 1190 -- 1210. Random Dense Instances. Probabilistic cross-identification of multiple catalogs in crowded fields, (with X. Shi and T. Budavari), The Astrophysical Journal, vol. 870(1), article id 51, Jan. 2019. Approximation of minimal functions by extreme functions, (with T. Lebair), SIAM Journal on Optimization, vol. 28(3), 2018, pp. 2518 -- 2540. Sparse coding and autoencoders, (with A. Rangamani, A. Mukherjee, T. Ganapathy, A. Arora, S. Chin, and T. D. Tran), Proceedings of the IEEE International Symposium on Information Theory (ISIT) 2018. Understanding Deep Neural Networks with ReLUs, (with R. Arora, P. Mianjy, and A. Mukherjee), Proceedings of the International Conference on Learning Representations (ICLR) 2018. Extreme Functions with an Arbitrary Number of Slopes, (with M. Conforti, M. Di Summa and J. Paat), Mathematical Programming, vol. 172(1), 2018, pp. 303 -- 327. A subset of these results appeared in Proceedings of IPCO 2016, Lecture Notes in Computer Science, vol. 9682, pp. 190--201. Minimal cut-generating functions are nearly extreme, (with M. Molinaro and R. Hildebrand), Mathematical Programming, vol. 172(1--2), 2018, pp. 329 -- 349. A subset of these results appeared in Proceedings of IPCO 2016, Lecture Notes in Computer Science, vol. 9682, pp. 202--213. Approximation of corner polyhedra with families of intersection cuts, (with G. Averkov, J. Paat), SIAM Journal on Optimization, vol. 28(1), 2018, pp. 904--929. A subset of these results appeared in Proceedings of IPCO 2017",
  "content_length": 17295,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:45"
}