{
  "name": "Amit K. Chopra",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/amit-chopra",
  "status": "success",
  "content": "Amit Chopra - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Dr Amit Chopra Senior Lecturer Research Overview I am interested in developing software abstractions, tools, and infrastructures to support the governance of sociotechnical systems of autonomous parties. To this end, I am developing abstractions for norms, accountability, and protocols, and applying them toward the design of sociotechnical systems. My philosophical stance is summed up as interaction-oriented software engineering or IOSE and has applications in areas as broad and diverse as ethical AI, Internet of Things, security, and blockchains. Show more… Professional Role I am an Associate Editor for ACM Transactions on Internet Technology (TOIT). I am a Sponsorship Chair for the 12th International Conference on Autonomous Agents and Multiagent Systems (AAMAS 2013). I served on the Senior Program Committee for AAMAS 2011. I have organized workshops on agent communication, social computing, and norms in multiagent systems. I edited a special issue of the ACM Transactions on Intelligent Systems and Technology. I will host a Dagstuhl seminar on Normative Multiagent Systems. Career Details Academic Ph.D. Computer Science, North Carolina State University, 2008M.S. Computer Science, North Carolina State University, 2003B.E. Computer Engineering, University of Pune, India, 1999 Professional Lecturer in Software Engineering (Oct 2012 onwards) Lancaster University, UK Postdoctoral Fellow (Jan 2009-Sep 2012) University of Trento Graduate Research Assistant (Jan 2003-Dec 2005 and January 2007-May 2008) Department of Computer Science, North Carolina State UniversitySoftware Intern (Jan 2006-Dec 2006) WebSphere Technology Institute, IBM, Research Triangle Park, NCMember of Technical Sta (Jul 1999-Jun 2001) Persistent Systems, Pune, India Profile I am interested in understanding and modeling interaction among autonomous social actors, such as organizations and people. I have developed significant insights and results, which I am currently applying to the software engineering of sociotechnical systems. My work has been funded by European grants and is well-recognized by my peers. My current focus is on further developing the concepts, principles, methodologies, specifications, and platforms for sociotechnical systems for broader impact. Research Grants PI, Five-year EPSRC grant for £677k, ongoing since September 2017, part of £1.6m grant with Imperial College LondonPI, Marie Curie Intra-European Fellowship, Euros 200,371, July 2012-June 2014. Requirements Engineering for Business Protocols.PI, Marie Curie Fellowship, Trentino Cofund, Euros 98,990, May 2010-Apr 2012. Business-level modeling and middleware for services: Reasoning about goals, compliance, interoperability, and adaptability. Show less Publications Research Groups Lancaster Intelligent, Robotic and Autonomous Systems Centre LIRA - Fundamentals SCC (Software Engineering) Security Lancaster (Distributed Systems) Back to listing Contact Details Department: Computing and Communications TelTelephone: enable JavaScript to view email address Back to listing",
  "content_length": 3371,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:40"
}