{
  "name": "Amit Kumar Dhar",
  "homepage": "https://www.iitbhilai.ac.in/index.php?pid=amitkdhar",
  "status": "success",
  "content": "Dr. Amit Kumar Dhar IIT Bhilai administration@iitbhilai.ac.in हिन्दी English A- A A+ Home Academic DepartmentsCSE Faculty Dr. Amit Kumar Dhar Amit Kumar Dhar Assistant Professor Department of EECS Indian Institute of Technology Bhilai Phone : (+91) 771-2551-300 Extn: 6144 Email : amitkdhar [at] iitbhilai·ac·in Events CALDAM 2024 Projects Framework for Secure Software Development and Capacity Building for SSDLC for Master Trainers July 2023 - July 2025 Funded by: Ministry of Electronics and IT (MeITy), GoI Verified Communication Protocol Implementation for Internet of Things June 2023 - June 2026 Funded by: C3iHub, IIT Kanpur Seamless integration of payment and activities in an educational campus through smart card and behavioral analysis of collected data March 2023 - March 2025 Funded by: IIT Bhilai Innovation and Technology Foundation Identifying optimal immunization strategies in Indian context against COVID-19 June 2020 - June 2021 Funded by: Science and Engineering Research Board, GoI Testing and Certifying Smartcard Operating Systems June 2018 - July 2019 Funded by: Bharat Electronics Limited Research Interests Automated Computer Aided Verification · Model-Checking · Formal Methods · Temporal Logics · SMT Solvers Teaching IC100 - Introduction to Programming2018-19-M Semester Program for: B.Tech. 1st Semester (all branches) Course Website : Moodle (accessible within IITBhilai LAN) Past Experiences Assistant Professor, Indian Institute of Information Technology Allahabad, IndiaDecember 2015 - June 2018 Department: Department of Information Technology Post-Doctoral Researcher, Université Libre de Bruxelles, BelgiumOctober 2014 - November 2015 Laboratory: Formal Methods and Verification Project: Cassting Supervisors: Gilles Geeraerts, Thomas Brihaye Selected Publications DBLP Google Scholar Education PhD, LIAFA, Université Paris Diderot - Paris 7, FranceOctober 2011 - December 2014 Field: Computer Science (Informatique) Topic: Algorithms for Model-Checking Flat Counter Systems Supervisors: Stéphane Demri, Arnaud Sangnier M2 of MPRI, LSV, Ecole Normale Superieure de Cachan, FranceSeptember 2010 - September 2011 Field: Computer Science (Informatique) Thesis: Counter Systems with Presburger-definable Reachability Sets : Decidability and Complexity Supervisors: Stéphane Demri, Arnaud Sangnier Masters, Chennai Mathematical Institute, IndiaAugust 2008 - August 2010 Field: Computer Science Thesis: Automata Over Infinite Words. Supervisors: K Narayan Kumar Related Links About Us Our Campus Contact Us Navigation Academics Administration Admissions Departments Institute Facilities Research and Development Faculty and Staff Prospective Faculty Prospective Staff Student Prospective Students Campus Media NIRF Report Contact Us Message From Director I am pleased to extend my greetings to students and their parents as well as colleagues near and far. IIT Bhilai was established on 7 August 2016. We are located in Chhattisgarh, the rice bowl of India, in a state rich in natural resources as well as cultural memory and heritage.\t\t\t\t\t\t\t\t\t Read More Institute All Stories Profile of IIT Bhilai Intranet OBC Cell Anti-Ragging Student Grievance Redressal AIMS Portal RTI Information Gallery Sitemap Polaris Directory Scholarships and Awards Newsletter Subscribe to our Newsletter and stay tuned. Subscribe Now! Copyright © 2017 - All Rights Reserved - IIT Bhilai",
  "content_length": 3398,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:41"
}