{
  "name": "Amit Roychowdhury 0001",
  "homepage": "https://vcg.ece.ucr.edu/amit",
  "status": "success",
  "content": "Amit K. Roy-Chowdhury | Vision and Learning Group Amit K. Roy-Chowdhury Professor and UC Presidential Chair Electrical and Computer Engineering Computer Science and Engineering (Cooperating) Co-Director, UC Riverside AI Research and Education (RAISE) Institute Chair, Robotics Program Co-Director, DoD Center of Excellence: Adaptive, Autonomous and Secure Heterogeneous Integrated Systems Contact MRB 3128, UC Riverside (951) 827-7886 firstnamelastnameinitials@ece.ucr.edu Research Interests Computer Vision and Image Processing Machine Learning Robot Autonomy Statistical Signal Processing AI for Science Teaching EE114 - Probability, Random Variables and Processes CS224/EE242A - Foundations of Machine Learning EE215 - Stochastic Processes EE236 - State and Parameter Estimation EE241 - Advanced Digital Image Processing EE243 - Advanced Computer Vision EE247 - Current Topics in Computer Vision Amit Roy-Chowdhury leads the Vision and Learning Group (formerly Video Computing Group) at UCR, working on foundational principles of computer vision, image processing, and machine learning, with applications in cyber-physical, autonomous and intelligent systems. His research group has published over 250 papers in peer-reviewed journals and top conferences. He is the Co-Director of the UC Riverside AI Research and Education Institute. Prof. Roy-Chowdhury's research has been supported by various US government agencies and private industries, and he leads one of the few DoD Centers of Excellence in the US. He is active in the IEEE Computer and Signal Processing societies, is an Associate Editor of IEEE Trans. on Pattern Analysis and Machine Intelligence, was, until recently, a Senior Area Editor for IEEE Trans. on Image Processing, and regularly serves as an Area Chair/Senior Area Chair for major computer vision and machine learning conferences. He has served as the Chair of the ECE Department at UCR from 2018-2021, and is currently the Chair of the newly created Robotics program. He is a Fellow of the IEEE and IAPR, received the Doctoral Dissertation Mentoring/Advising Award from UCR in 2019, and the Distinguished Alumni Award from the University of Maryland, College Park in 2020. His work on face recognition in art was featured widely in the news media, including a PBS/National Geographic documentary. Amit received his PhD in Electrical and Computer Engineering from the University of Maryland College Park, his Masters in Systems Science and Automation from the Indian Institute of Science Bangalore, India, and his Bachelors in Electrical Engineering from Jadavpur University, Kolkata, India. × Let us help you with your search Enter your Search Criteria. Search All UCR Search This Site Cancel",
  "content_length": 2719,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:42"
}