{
  "name": "Amit Levy",
  "homepage": "https://www.amitlevy.com",
  "status": "success",
  "content": "amit levy | About Hi. My name is Amit, and I build systems. I’m an Assistant Professor in the Computer Science department at Princeton University, where I lead the Praxis lab and co-lead the SNS group. My research centers around the idea that well designed secure systems empower developers and their applications, rather than restrict them. This usually manifests in building practical and secure operating systems, embedded systems, distributed systems, and often leverages tools from programming languages. PhD Students Until September 2025, I was a professor at Princeton University and have stayed on as a visiting research scholar so I can continue to advise my wonderful PhD students: Natalie Popescu Anja Kalaba1 Shai Caspin Christopher Branner-Augmon1 Jingyuan (Leo) Chen Gongqi Huang Leon Schuermann Recent Selected Publications Tock: From Research To Securing 10 Million Computers SOSP ‘25 [PDF] Running Consistent Applications Closer to Users with Radical for Lower Latency SOSP ‘25 [PDF] End-to-End Encrypted Applications with Strong Consistency Under Byzantine Actors (ACSAC ‘25) To Appear Building Bridges: Safe Interactions with Foreign Languages through Omniglot OSDI 2025 Best Paper Award [PDF] Only Pay for What You Leak: Leveraging Sandboxes for a Minimally Invasive Browser Fingerprinting Defense. IEEE S&P 2023 [PDF] Doing More with Less: Orchestrating Serverless Applications without an Orchestrator. NSDI ‘23. [PDF] Speculative Recovery: Cheap, Highly Available Fault Tolerance with Disaggregated Storage. ATC ‘22. [PDF] Regular Sequential Serializability and Regular Sequential Consistency. SOSP ‘21. : [PDF] Safer at Any Speed: Automatic Context-Aware Safety Enhancement for Rust. OOPSLA ‘21. [PDF] Alumni David Liu (PhD, 2022) Ryan Torok (Masters, 2022) Yue Tan (PhD, 2024) Co-advised with Wyatt Lloyd ↩ ↩2 Mastodon",
  "content_length": 1842,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:41"
}