{
  "name": "Amiya Ranjan Panda",
  "homepage": "https://cse.kiit.ac.in/profiles/amiya-ranjan-panda",
  "status": "success",
  "content": "Amiya Ranjan Panda - KIIT School of Computer Engineering Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Amiya Ranjan Panda Amiya Ranjan Panda Amiya Ranjan Panda Assistant ProfessorDr. Amiya Ranjan Panda has seven years of research experience in DRDO and one year of teaching experience. He received the B.Tech. degree in information technology from Biju Patnaik University of Technology, Rourkela, India, in 2009, and the M.Tech. degree in computer science and engineering from the Kalinga Institute of Industrial Technology (KIIT), Bhubaneshwar, India, in 2012. He received Ph.D. degree from Siksha “O” Anusandhan University, Bhubaneshwar in the year 2017 working in a real-time project “Design, development and implementation of Software Defined Radio based Flight Termination System” of DRDO, ITR, chandipur. He has worked as JRF, SRF and RA in DRDO, ITR, Chandipur for more than 7 years. Then he has worked as Assistant Professor in Siksha ‘O’ Anusandhan University for 4 months and currently he is working as Assistant Professor in KIIT Deemed to be University, Bhubaneswar. His research interest is Machine learning, IOT, data acquisition system and Software Defined Radio. He has published 15 international journals. Two of the journals are published in IEEE Transaction of Industrial Informatics. One edited book has been accepted for publication in 2019. He is expert in teaching Data Structure and algorithm, Database Management System (DBMS), Artificial Intelligence, Operating System, Compiler Design, Computer Network, Machine Learning etc. Profile LinksEmail :[email protected]Website :sites.google.com Social LinksProfileRecent PublicationsProfileEducational QualificationPh.D. in Computer Science and EngineeringResearch Interests Machine Learning Data mining IOT Software Defined Radio Administrative ResponsibilityFaculty In-change UG SeminarAwards & Honours 1. Junior Research Fellow 2. Senior Research Fellow 3. Research AssociateMembershipsIEEE Member: #92833312 Instrument Society Of India (Life Member): #LM2251 Computer Society of India (CSI) Member: #654381 Computer Science Teachers Association (CSTA) Member: #6625092Recent PublicationsJournals/Conferences :1.\tAmiya Ranjan Panda; Debahuti Mishra; Hare Krishna Ratha, “FPGA Implementation of Tone based Flight Termination System in Software Defined Radio Platform”, IEEE Transaction on Industrial Informatics, Vol. 13, No. 05, Oct. 2017, PP. 2360-2368. (Impact Factor: 6.764/ SCI Indexed) 2.\tAmiya Ranjan Panda; Debahuti Mishra; Hare Krishna Ratha, “FPGA implementation of Software Defined Radio based Flight Termination System”, IEEE Transaction on Industrial Informatics, Vol. 11. No.1, Feb 2015, PP74-93. (Impact Factor: 6.764 / SCI indexed) 3.\tAmiya Ranjan Panda; Debahuti Mishra; Hare Krishna Ratha, “A Software Defined Radio based UHF Digital Ground Receiver System for Flying Object using LabVIEW”, Defence Science Journal, , Vol. 67. No.3, May 2017, PP.291-297. (Impact Factor: 0.5/ SCI Indexed) 4.\tAmiya Ranjan Panda; Debahuti Mishra; Hare Krishna Ratha, “Implementation of SCADA/HMI system for real-time controlling and performance monitoring of SDR based flight termination system”, Elsevier-Journal of Industrial Information Integration, Vol. 3. No.1, Feb 2016, PP.20-30.(SCIE Indexed) 5.\tAmiya Ranjan Panda; Debahuti Mishra; Hare Krishna Ratha, “Design and Implementation of a Software Defined Radio based UHF Digital Ground Transmitter System for Flying Object using LabVIEW”, International Journal of Pure and Applied Mathematics, Vol.118, No.16, 889-905, 2018. (SCOPUS Indexed) 6.\tSushruta Mishra, Hrudaya Kumar Tripathy, Amiya Ranjan Panda, “An Improved and Adaptive Attribute Selection Technique to Optimize Dengue Fever Prediction”, International Journal of Engineering & Technology, Vol. 7, No. 3.34, pp.480-486, Sept.2018. (Scopus Indexed) 7.\tSushruta Mishra, Amiya Ranjan Panda, Hrudaya Kumar Tripathy, “Implementation of Re-sampling technique to handle Skewed Data in Tumor Prediction”, Journal of Advanced Research in Dynamical and Control Systems (Accepted) 8.\tAmiya Ranjan Panda, Sushruta Mishra, “Smart Phone purchase Prediction with 3-NN Classifier”, Journal of Advanced Research in Dynamical and Control Systems (Accepted) 9.\tSushruta Mishra, Amiya Ranjan Panda, “Predictive Evaluation of Student’s Performance using decision Tree approach”, Journal of Advanced Research in Dynamical and Control Systems (Accepted) 10.\tRajesh Kumar Nayak, B.S.P. Mishra, J. R. Mohanty, Amiya Ranjan Panda, Manoj Ku. Mishra, “ A Multi-objective Vehicle Routing Problem using parallel genetic algorithm”, Journal of Advanced Research in Dynamical and Control Systems (Accepted) sachi2019-01-03T11:53:36+05:30 Page load link Go to Top",
  "content_length": 4781,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:47"
}