{
  "name": "Amjed Tahir",
  "homepage": "http://www.massey.ac.nz/massey/expertise/profile.cfm?stref=481450",
  "status": "success",
  "content": "Dr Amjed Tahir - Senior Lecturer - Massey University Skip to Content BackMassey expertise searchMassey expertise searchMassey expertise searchDoctoral student profilesSearch for output by keyword/authorExpertise search Show search form Expertise search People search (Filtering) Expertise search College All Colleges College of Creative Arts College of Health College of Humanities and Social Sciences College of Sciences DVC Maori Governance and Assurance Massey Business School Massey University Foundation Office of the Provost Strategy Planning and Analytics Students and Global Engagement University Services Department All Departments Academic Business Development Ag and Hort Enterprises Ako Aotearoa Centre for Public Health Research CoCA - Partnerships and Projects CoCA - Professional Administration CoCA - Technical Services CoCA -Teaching and Learning CoCA Maori and Pacific Arts - Te Ranga Tai Kura CoH - Professional Administration CoHSS - Academic Programme CoHSS - Business Manager CoHSS - Professional Administration CoHSS - Teaching and Learning CoS - Professional Administration College Office - Albany College Office - Wellington College of Creative Arts College of Health College of Humanities and Social Sciences College of Sciences DVC Maori DVC Maori - Business Services DVC Maori - Oteha Enterprise Estates Management Finance FoodPilot Funding and Forecast Global Engagement Global Partnership Graduate Research School and Ethics Health Safety and Wellbeing IT Group Information Technology Services Institute of Education Institutional Research Library MBS - Professional Administration MBS - Research MU Foundation Manawatu Microscopy and Imaging Centre Maori Student Success Marketing Student Recruitment and Alumni Massey Business School Massey Business School - Deputy PVC's Office Massey Genome Service Massey University Press Mediation Service NZ Food Safety Science Research Centre New Zealand Institute for Advanced Study Nutrition Lab Office of the DVC Students and Global Engagement Pacific Student Success People and Culture Planning and Performance Provost - Business Services Provost Advisory Research Centre for Maori Health and Development Research Operations Riddet Institute SFAT - Technical Services Manager (MAN) SHORE Centre School of Accountancy Economics and Finance School of Agriculture and Environment School of Art School of Aviation School of Built Environment School of Design School of Food Technology and Natural Sciences School of Health Sciences School of Humanities Media and Creative Comm School of Management and Marketing School of Mathematical and Computational Sciences School of Music and Screen Arts School of Nursing School of People Environment and Planning School of Psychology School of Social Work School of Sport Exercise and Nutrition School of Veterinary Science Student Experience Student Registry Students and Global Engagement - Business Services Te Mata o Te Tau Te Putahi-a-Toi Te Tumu Whakatipu The Centre for Education Transformation University Services - Business Services Whariki Research Centre Keywords Name Search Add criteria Position / Job Title College Department Reset Expertise search - Show advanced search Thematic All 21st Century Citizenship Design – for Commerce, Community and Culture Future Food Systems Health and Well-being Resource Development and Management Keywords Name Academic expert All staff General staff Reset Contact details +6469519358 Dr Amjed Tahir PhD, SI^NZ Senior Lecturer Doctoral Supervisor School of Mathematical and Computational Sciences Most of my research is empirical in nature, and I am a big supporter of the open science initiative. Most of my research uses open data, contributes publicly accessible data, and ensures that our research software is accessible as open source. Read more here. I undertake research in empirical software engineering, with a special interest in software (source code) quality and maintenance and in software testing. I am also interested in open-source software and how to improve the quality of such systems. Please visit our Software Engineering and Analytics Group page for more information about our research activities. More about me...View less... Professional Contact details Location: 3.29, Science Tower BCampus: Manawatu Qualifications Doctor of Philosophy - University of Otago (2016) Fellowships and Memberships Member, Software Innovation New Zealand (Member) (2017) Prizes and Awards College of Science Research Award (Early Career) - Massey University (2023) Distinguished Reviewer Award - IEEE/ACM International Conference on Software Engineering (ICSE 2023) (2023) Distinguished Paper Award - IEEE TCSE - International Conference on Program Comprehension (ICPC 2021) (2021) Distinguished Reviewer Award - IEEE International Conference on Mining Software Repositories (MSR 2021) (2021) Best Paper Award - The 22nd International Conference on Evaluation and Assessment in Software Engineering (EASE 2018) (2018) view more... The Distinguished Artifact award at ECOOP 2017 - European Conference on Object Oriented Programming (ECOOP) (2017) view less... Research Expertise Research Interests I am interested in several areas of Empirical Software Engineering including (but not limited to): software testing, software maintenance, reengineering and evolution, data analytics (through mining software repertories), and other software quality topics. My current research focuses on understanding software systems, and more precisely, understanding the quality of tests written by developers. I'm also studying fault and change prediction models. For prospective postgraduate students: If you are interested in postgraduate studies (Master, PhD) in software engineering and would like to join us at Massey, please send me an email with details of your proposed research idea and your previous qualifications/experience. Please visit my private page for information about my current postgraduate students I am currently working on the following active projects (with students and collaborators): 1) understanding sources of non-deterministic behaviour of software tests (i.e., test flakiness) 2) assessing the reliability of existing bug prediction models and their applicability in real life projects. 3) studying the real impact of code smells and anti-patterns in real software development. 4) quantifying the sources of unsoundness in static program analysis. 5) implementing custom static analysis to detect DoS vulnerabilities in composite data structures. Area of Expertise Field of research codes Computer Software (080300): Information And Computing Sciences (080000): Programming Languages (080308): Software Engineering (080309) Research ProjectsCompleted Projects Project Title: NSC - Proofing Code Reuse: Detecting Errors in Publicly Available Software Date Range: 2021 - 2022 Funding Body: University of Otago Project Team: Dr Amjed Tahir - Project Leader Project Title: NSC - Novel approach to detect and predict tests with non-deterministic behaviour This project aims to understand the causes of test flakiness, provide empirical evidence of new patterns of flaky tests and their classifications, and develop a novel technique that is able to identify and predict flaky tests with a high-level of accuracy and scalable to large programs Read Project Description Hide Project Description Date Range: 2021 - 2023 Funding Body: Callaghan Innovation Project Team: Dr Amjed Tahir - Project Leader Project Title: Towards better and more reliable software bugs prediction Date Range: 2018 - 2018 Funding Body: Massey University Project Team: Dr Amjed Tahir - Project Leader Project Title: NSC - Closing the gaps in Static Program Analysis There is a recent increase in awareness that more research on soundness of static code analysis is needed. Real-world programming languages are full of features that have been designed to boost programmer productivity, but are notoriously difficult to capture by existing static analyses (due to their dynamic nature). As a result, most static code analyses are unsound. This project aims at addressing the following questions: (1) Can we quantify the unsoundness of existing static analyses? (2) Which features in modern programs cause unsoundness, and to what extent? (3) Which methods exist or can be invented to precisely model features causing unsoundness? Read Project Description Hide Project Description Date Range: 2017 - 2019 Funding Body: Callaghan Innovation Project Team: A/Pro Jens Dietrich - Team Member Dr Amjed Tahir - Project Leader Research Outputs Journal Request Academic Output Fu, Y., Liang, P., Tahir, A., Li, Z., Shahin, M., Yu, J., . . . Chen, J. (2025). Security Weaknesses of Copilot-Generated Code in GitHub Projects: An Empirical Study. ACM Transactions on Software Engineering and Methodology. 34(8)[Journal article]Authored by: Tahir, A.Read Online: Read Abstract: 3 Tsunoda, M., Kudo, T., Monden, A., Tahir, A., Bennin, KE., Toda, K., . . . Matsumoto, K. (2025). On the Application of Bandit Algorithm for Selecting Clone Detection Methods. IEICE Transactions on Information and Systems. E108D(7), 718-722[Journal article]Authored by: Tahir, A.Read Online: Read Abstract: Tsunoda, M., Shima, R., Tahir, A., Bennin, KE., Monden, A., Toda, K., . . . Nakasai, K. (2025). Selecting Source Code Generation Tools Based on Bandit Algorithms. IEICE Transactions on Information and Systems. E108.D(7), 723-726[Journal article]Authored by: Tahir, A.Read Online: Read Abstract: Fedorov, N., Yamasaki, Y., Tsunoda, M., Monden, A., Tahir, A., Bennin, KE., . . . Nakasai, K. (2025). Building Defect Prediction Models by Online Learning Considering Defect Overlooking. IEICE Transactions on Information and Systems. E108.D(3), 170-174[Journal article]Authored by: Tahir, A.Read Online: Read Abstract: Murakami, Y., Yamasaki, Y., Tsunoda, M., Monden, A., Tahir, A., Bennin, KE., . . . Nakasai, K. (2025). The Impact of Defect (Re) Prediction on Software Testing. IEIC",
  "content_length": 31467,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:49"
}