{
  "name": "Amol Deshpande",
  "homepage": "https://www.cs.umd.edu/~amol",
  "status": "success",
  "content": "Amol Deshpande's Home Page Contact Research Teaching Students Publications Talks Service Amol Deshpande Professor Associate Chair for Graduate Education Department of Computer Science / UMIACS Database Group University of Maryland News January 2025: Best Paper Award at CIDR 2025, for \"Beyond Relations: A Case for Elevating to the Entity-Relationship Abstraction\". January 2025: Test-of-Time Award at CIDR 2025, for \"TelegraphCQ: Continuous Dataflow Processing for an Uncertain World\", originally published in CIDR 2003. August 2024: Survey paper on \"Modern Techniques For Querying Graph-structured Databases\" published in Foundations and Trends in Databases, 2024. May 2024: To Store or Not to Store: a graph theoretical approach for Dataset Versioning, published in IPDPS 2024. May 2023: Epsilon-differential privacy, and a twostep test for quantifying reidentification risk, published in Jurimetrics, 2023. October 2020: Vision paper on building a Privacy-first Database System through Pseudonymization accepted at CIDR 2021. October 2018: Blog post on Privacy Challenges in the Post-GDPR World: A Data Management Perspective at the ACM SIGMOD Blog (with Ashwin Machanavajjhala). January 2017: Paper and Demonstration Proposal on ModelHub, our system to support deep learning, both accepted at ICDE 2017. November 2016: Paper on Extracting and Analyzing Hidden Graphs from Relational Databases (GraphGen Project) accepted at SIGMOD 2017. I am serving as the Academic Director of our new Graduate Certificate Program in Data Science. September 21, 2015: Our NScale paper has been accepted to appear at VLDB Journal. June 26, 2015: Put up a new blog post summarizing our recent VLDB'15 paper on why Git and SVN fail at managing large number of dataset versions. December 15, 2014: Blog post on Graph Data Management at the ACM SIGMOD Blog. Research Interests My research spans a spectrum of topics in \"big data\", including database query optimization, privacy adaptive query processing, cloud computing, sensor network data management, uncertain data management, and graph databases. Some of the current and past research projects include: Privacy-first Data Management Systems: In this recently started project, we are exploring how to redesign data management systems and data processing frameworks to support privacy-aware data management. DataHub: Collaborative Data Science and Version Management at Scale: In this project (joint with Sam Madden@MIT and Aditya Parameswaran@Berkeley), we have been developing a platform to enable collaborative data analytics over big data. Declarative Graph Querying and Analytics: In this project, we are building a graph data management system and a suite of tools aimed at supporting real-time and historical querying and analytics over very large, dynamic, heterogeneous, and noisy graphs. I recently wrote a blog post for ACM SIGMOD Blog on Graph Data Management. Probabilistic Databases: In this project, we are investigating techniques for managing, querying, and performing inference over, very large probabilistic databases, and for Robust Uncertain Data Management. Energy Efficiency in Databases and Data Centers: In this project, we are investigating the issues of energy efficient computing in databases and in data centers. Sensor Networks: We are investigating data management and energy efficiency issues in wireless sensor networks. Query optimization; Adaptive query processing; Data Streams Teaching Fall 2024: CMSC724: Database Management Systems (also: Fall 2023) Spring 2024: CMSC424: Database Design Spring 2023: CMSC848E: Machine Learning for Data Management Systems Spring 2021: CMSC828E: Advanced Topics in Information Processing: Privacy and Ethics in Data Management Systems Fall 2014: CMSC498: Introduction to Data Science I: Preparing, Storing, and Manipulating Data Fall 2010: CMSC828E: Probabilistic and Graph Data Management; Large-scale Analytics Fall 2007: CMSC828K: Sensor Data Management; Data Streams Fall 2005: CMSC828D: Data Management in New Emerging Environments Students Keonwoo Oh Hasara Kalumin Graduated: Bhargav Kanagal (Google) Udayan Khurana (IBM Watson) K. Ashwin Kumar (Symantec Labs) Jian Li (IIIS, Tsinghua University) Jayanta Mondal (Microsoft CISL) Walaa Moustafa (NEC Labs Cupertino) Abdul Quamar (IBM Almaden Research Center) Prithviraj Sen (IBM Almaden Research Center) Theodoros Rekatsinas (Postdoc, Stanford) Souvik Bhattacherjee Amit Chavan (AWS) Hui Miao (Google) Konstantinos Xirogiannopoulos (Meta) Recent Publications (Full publications list, DBLP, Google citations) Beyond Relations: A Case for Elevating to the Entity-Relationship Abstraction; Amol Deshpande; Conference on Innovative Data Systems Research (CIDR), 2025 (Best Paper Award). Optimizing Queries with Many-to-Many Joins; Hasara Kalumin, Amol Deshpande; arXiv preprint arXiv:2412.16323, 2024 Modern Techniques For Querying Graph-structured Databases; Amine Mhedhbi, Amol Deshpande, Semih Salihoğlu; Foundations and Trends® in Databases 14 (2), 72-185, 2024. To Store or Not to Store: a graph theoretical approach for Dataset Versioning; A. Guo, J. Li, P. Sukprasert, Samir Khuller, Amol Deshpande, Koyel Mukherjee; IPDPS 2024 (also CoRR Technical Report arXiv:2402.11741). Epsilon-differential privacy, and a twostep test for quantifying reidentification risk; Nathaniel Reitinger, Amol Deshpande; Jurimetrics: The Journal of Law, Science and Technology, 63 (3), 263-317, 2023 Flock: A Low-Cost Streaming Query Engine on FaaS Platforms; Gang Liao, Amol Deshpande, Dan Abadi; arXiv preprint arXiv:2312.16735, 2023 Sypse: Privacy-first Data Management through Pseudonymization and Partitioning; Amol Deshpande; Conference on Innovative Data Systems Research (CIDR), 2021. Membership inference attacks on lottery ticket networks; A Bagmar, SR Maiya, S Bidwalka, Amol Deshpande; ICML 2021 workshop on A Blessing in Disguise: The Prospects and Perils of Adversarial Machine Learning (also CoRR Technical Report arXiv:2108.03506). CRUX: Adaptive Querying for Efficient Crowdsourced Data Extraction; Theodoros Rekatsinas, Amol Deshpande, Aditya Parameswaran; Proceedings of the 28th ACM International Conference on Information and Knowledge Management, 2019. Understanding data science lifecycle provenance via graph segmentation and summarization; Hui Miao, Amol Deshpande; 2019 IEEE 35th International Conference on Data Engineering (ICDE), 1710-1713, 2019. Memory-efficient group-by aggregates over multi-way joins; Konstantinos Xirogiannopoulos, Amol Deshpande; arXiv preprint arXiv:1906.05745, 2019. Maximizing expected utility for stochastic combinatorial optimization problems; Jian Li, Amol Deshpande; Mathematics of Operations Research 44 (1), 354-375. RStore: A distributed multi-version document store; Souvik Bhattacherjee, Amol Deshpande; IEEE 34th International Conference on Data Engineering (ICDE), 389-400, 2018. ProvDB: A System for Lifecycle Management of Collaborative Analysis Workflows; Hui Miao, Amit Chavan, Amol Deshpande; HILDA SIGMOD Workshop 2017 (also CoRR Technical Report arXiv:1610.04963). GraphGen: Adaptive Graph Extraction and Analytics over Relational Databases; Konstantinos Xirogiannopoulos, Virinchi Srinivas, and Amol Deshpande; GRADES SIGMOD Workshop 2017. [pdf] DEX: Query Execution in a Delta-based Storage System; Amit Chavan, Amol Deshpande; SIGMOD 2017. Extracting and Analyzing Hidden Graphs from Relational Databases; Konstantinos Xirogiannopoulos, and Amol Deshpande; SIGMOD 2017. [abstract] Analyzing interconnection structures among underlying entities or objects in a dataset through the use of graph analytics has been shown to provide tremendous value in many application domains. However, graphs are not the primary representation choice for storing most data today, and in order to have access to these analyses, users are forced to manually extract data from their data stores, construct the requisite graphs, and then load them into some graph engine in order to execute their graph analysis task. Moreover, in many cases (i.e. when the graphs are dense) these graphs can turn out to be significantly larger than the initial input stored in the database, making it infeasible to construct or analyze such graphs in-memory. In this paper we address both of these challenges by building a system that enables users to \"declaratively\" specify graph extraction tasks over a relational database schema and then execute graph algorithms on the extracted graphs. We propose a declarative domain specific language for this purpose, and pair it up with a novel \"condensed\", in-memory representation that significantly reduces the memory footprint of these graphs, permitting analysis of larger-than-memory graphs. We present a general algorithm for creating such a condensed representation for a large class of graph extraction queries against arbitrary schemas. We observe that the condensed representation suffers from a \"duplication\" issue, that results in inaccuracies for most graph algorithms. We then present a suite of in-memory representations that handle this duplication in different ways and allow \"trading off\" the memory required and the computational cost for executing different graph algorithms. We also introduce several novel \"deduplication\" algorithms for removing this duplication in the graph, which are of independent interest for graph compression, and provide a comprehensive experimental evaluation over several real-world and synthetic datasets illustrating these trade-offs. ModelHub: Deep Learning Lifecycle Management; Hui Miao, Ang Li, Larry Davis and Amol Deshpande; ICDE 2017 (Demonstrations Track). Towards Unified Data and Lifecycle Management for Deep Learning; Hui Miao, Ang Li, Larry Davis and Amol Deshpande; ICDE 2017. [abstract] Deep learning has improved state-of-the-art results in many important fields, and has been the subject of much research in recent years, leading to the development of several systems for facilitating deep learning. C",
  "content_length": 73071,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:50"
}