{
  "name": "Amparo Alonso-Betanzos",
  "homepage": "https://pdi.udc.es/es/File/Pdi/AF2AF",
  "status": "success",
  "content": "Ficha de María Amparo Alonso Betanzos Departamento Ciencias de la Computación y Tecnologías de la Información Área Ciencia de la computación e inteligencia artificial Investigación Grupo de investigación Laboratorio de Investigación y Desarrollo en Inteligencia Artificial Líneas de investigación Aprendizaje automático escalable, Aprendizaje automático explicable, Inteligencia Artificial sostenible, Modelado basado en agentes Contacto Directorio de la UDC Orcid id0000-0003-0950-0012 ResearcherIDK-5057-2014 Scopus7004102381 Docencia impartida En este apartado se muestra la docencia impartida en grados, másteres y resto de estudios oficiales en los últimos 6 años. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Aprendizaje Profundo Grado en Inteligencia Artificial Optativo 0 11 Desarrollo de Sistemas Inteligentes Grado en Ingeniería Informática Optativo 0 21 Sistemas basados en Conocimiento Grado en Inteligencia Artificial Optativo 0 21 Sistemas Inteligentes Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Máster Universitario en Ingeniería Informática Obligatorio 0 63 Trabajo Fin de Grado. Mención en Computación Grado en Ingeniería Informática Obligatorio 0 4 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Aprendizaje Profundo Grado en Inteligencia Artificial Optativo 0 11 Desarrollo de Sistemas Inteligentes Grado en Ingeniería Informática Optativo 0 21 Modelos Avanzados de Aprendizaje Automático II Grado en Inteligencia Artificial Optativo 0 1 Sistemas basados en Conocimiento Grado en Inteligencia Artificial Optativo 0 21 Sistemas Inteligentes Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Máster Universitario en Ingeniería Informática Obligatorio 0 60 Trabajo Fin de Grado. Mención en Computación Grado en Ingeniería Informática Obligatorio 0 10,66 Trabajo Fin de Máster Máster Universitario en Bioinformática para Ciencias de la Salud Obligatorio 0 2,66 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Algoritmos Básicos de la Inteligencia Artificial Grado en Inteligencia Artificial Obligatorio 0 5 Desarrollo de Sistemas Inteligentes Grado en Ingeniería Informática Optativo 0 21 Sistemas Inteligentes Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Máster Universitario en Ingeniería Informática Obligatorio 0 30 Trabajo Fin de Grado. Mención en Computación Grado en Ingeniería Informática Obligatorio 0 2,66666666666667 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Desarrollo de Sistemas Inteligentes Grado en Ingeniería Informática Optativo 0 21 Sistemas Inteligentes Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Máster Universitario en Ingeniería Informática Obligatorio 0 26,5 Trabajo Fin de Grado. Mención en Computación Grado en Ingeniería Informática Obligatorio 0 9,33333333333333 Trabajo Fin de Máster Máster Universitario en Ingeniería Informática Obligatorio 0 3,33333333333333 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Desarrollo de Sistemas Inteligentes Grado en Ingeniería Informática Optativo 0 21 Sistemas Inteligentes Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Máster Universitario en Ingeniería Informática Máster Universitario en Ingeniería Informática Obligatorio 0 45 Trabajo Fin de Grado. Mención en Computación Grado en Ingeniería Informática Obligatorio 0 2,66 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Desarrollo de Sistemas Inteligentes Grado en Ingeniería Informática Optativo 0 21 Privacidad y Datos Personales Máster Universitario en Derecho Digital y de la Inteligencia Artificial Obligatorio 0 4 Proceso y TIC Máster Universitario en Derecho Digital y de la Inteligencia Artificial Obligatorio 0 1 Sistemas Inteligentes Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Máster Universitario en Ingeniería Informática Obligatorio 0 40 Trabajo Fin de Grado. Mención en Computación Grado en Ingeniería Informática Obligatorio 0 4 Tutorías 2025/2026 Tutorías definidas por el/la docente para el curso académico 2025/2026. Facultad de Informática Cuatrimestre Día Lugar Primer cuatrimestre lunes 10:00 a 12:00 despacho 320 Primer cuatrimestre martes 10:30 a 12:00 despacho 320 Primer cuatrimestre miércoles 10:30 a 12:00 despacho 320 Segundo cuatrimestre martes 10:30 a 11:30 despacho 320 Segundo cuatrimestre jueves 09:30 a 11:30 despacho 320 Trabajos de fin de grado y máster Dirigidos o codirigidos por el/la docente desde el año 2013. 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 2019/2020 2018/2019 2016/2017 2014/2015 2013/2014 Análisis de la robustez de un modelo de selección de características dinámico ante ataques adversarios Arquitecturas eficientes para LLMs: estudio e implementación de Mixture of Experts en modelos Transformer Selección de características para priorización genética mediante aprendizaje automático en entornos de alta dimensionalidad Simulación de la propagación de un virus y aceptación de medidas socio-sanitarias mediante un modelo inteligente. Sistema basado en conocimiento para la asignación automática de juicios a letrados Algoritmo basado en inteligencia artificial para la detección de intrusos sobre un conjunto de datos reales Algoritmo de explicación de anomalías en espacios mixtos categórico-conti- nuos mediante técnicas de explicabilidad local Aprendizaje positivo sin etiquetas (PU Learning) para la mejora de la explicabilidad Combatiendo la toxicidad en discusiones en línea sobre salud mediante modelos de Aprendizaje Automático Automatización de la extracción de datos relevantes en informes médicos mediante Minería de Textos Detección de anomalías en textos Personalización en Sistemas de Recomendación mediante Aprendizaje Máquina Explicable TBP-TR2 (Text Based and Personalized TripAdvisor Restaurant Recommendation),aproximación de aprendizaje profundo para predicción de los gustos de los usuarios basada en valoraciones textuales Un entorno de agentes para simular la expansión de un virus basado en el comportamiento social y las medidas de contención Sistema de Recomendación basado en comentarios textuales Algoritmo de explicación de anomalías en espacios mixtos categórico-continuos Aprendizaje computacional para al detección de genes influyentes en patoloxgas. Aplicación al cáncer de mama Optimización de métodos de selección de características para tratar conjuntos de alta dimensión Sistema de apoyo a la predicción del hongo mildiu en la vid Métodos para selección de características en conjuntos de alta dimensión Puede consultar los méritos de investigación seleccionando un tipo de mérito y el año. Proyectos, contratos y convenios de I+D+I Patentes, registros y modelos de utilidad Artículos en revistas de investigación Libros completos Capítulos de libros Tésis doctorales dirigidas Comunicaciones en congresos 2024 2023 2022 2020 2019 ... 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 2004 2003 2001 1999 1997 1996 1995 1994 1991 1988 1987 1986 Sin fecha Entidad financiadora Fondo Europeo de Desarrollo Regional (FEDER) Tipo Proyecto UE Fechas Desde 01/01/2024 a 31/12/2026 Entidad financiadora Ministerio de Ciencia, Innovación y Universidades Investigadores principales Berta Guijarro Berdiñas (IP1) / Amparo Alonso Betanzos (IP2) Tipo Proyecto Programas Nacionales Fechas Desde 01/09/2024 a 31/08/2027 Entidad financiadora INSTITUTO NACIONAL DE ESTADÍSTICA Investigadores principales Ricardo Cao Abad, Manuel Francisco González Penedo Tipo Proyecto Programas Nacionales Fechas Desde 13/05/2023 a 12/05/2026 Entidad financiadora Union Europea Investigadores principales Francisco Javier González Varela, Manuel F. González Penedo Tipo Proyecto UE Fechas Desde 01/09/2023 a 31/12/2025 Entidad financiadora Consellería de Educación Investigadores principales Amparo Alonso Betanzos Tipo Proyecto Programas Autonomicos Fechas Desde 01/01/2022 a 20/11/2025 Entidad financiadora Red.es Investigadores principales José Luis Calvo Rolle ; Óscar Fontenla Romero Tipo Proyecto Programas Nacionales Fechas Desde 01/09/2022 a 30/04/2024 Entidad financiadora Axencia Galega de Innovación (GAIN) Investigadores principales Pablo Fariñas Alvariño Tipo Proyecto Programas Autonomicos Fechas Desde 20/07/2022 a 19/07/2025 Entidad financiadora Ministerio de Ciencia, Innovación y Universidades Tipo Proyecto Programas Nacionales Fechas Desde 01/06/2020 a 31/05/2024 Entidad financiadora FUNDACIÓN BBVA Investigadores principales Óscar Fontenla Romero Tipo Proyecto Programas Nacionales Fechas Desde 30/04/2020 a 30/10/2022 Entidad financiadora Agencia Gallega de Innovación (GAIN) Investigadores principales Ricardo Cao Abad Tipo Proyecto Programas Autonomicos Fechas Desde 01/11/2020 a 31/12/2022 Entidad financiadora Consellería de Cultura, Educación e Ordenación Universitaria Investigadores principales Amparo Alonso Betanzos Tipo Proyecto Programas Autonomicos Fechas Desde 01/01/2019 a 20/11/2021 Entidad financiadora Union Europea Investigadores principales Christian A. Klöckner Tipo Proyecto UE Fechas Desde 01/05/2018 a 31/10/2021 Entidad financiadora Union Europea Investigadores principales Adina Claudia Dumitru Tipo Proyecto UE Fechas Desde 01/05/2018 a 30/04/2021 Entidad financiadora Consellería de Educación e Ordenación Universitaria Tipo Proyecto Programas Autonomicos Fechas Desde 01/01/2017 a 30/11/2018 Entidad financiadora Ministerio de Economía y Competitividad (MINECO) Investigadores principales AMPARO ALONSO BETANZOS/OSCAR FONTENLA ROMERO Tipo Proyecto Programas Nacionales Fechas Desde 01/01/2016 a 31/12/2019 Entidad financiadora Ministerio de Economía y Competitividad Investigadores principales Francisco Herrera Triguero Tipo Proyecto Pr",
  "content_length": 76591,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:59"
}