{
  "name": "Amr Magdy Ahmed",
  "homepage": "https://www.cs.ucr.edu/~amr",
  "status": "success",
  "content": "Amr Magdy Amr Magdy is an Associate Professor, Step 3 of Computer Science and Engineering and a co-founding faculty member of the Center for Geospatial Sciences at UC Riverside. His research interests include big data management, spatial data management, large-scale data analytics, indexing, and main-memory management. His research has been published in prestigious research venues, including ACM SIGSPATIAL, VLDB, VLDB Journal, ACM SIGMOD, ACM TSAS, IEEE ICDE, and IEEE TKDE. Amr's research is recognized as the best paper runner-ups in ACM SIGSPATIAL 2023 and IEEE MDM 2023, selected among the best papers in SSTD 2023, ACM SIGSPATIAL 2019, and IEEE ICDE 2014, and has been incubated by several industrial collaborators. Amr has received several research awards, including the Google-CAHSI, Microsoft, and NSF CAREER awards in 2023. CV Research Highlights Academic Profile Prospective students can contact me through filling this form <my home page>/contact.html Overview: Amr's recent research focuses on scalability and expressiveness for spatial data science. He particularly emphasizes enabling social scientists to analyze large-scale spatial data using advanced spatial statistical analysis techniques. Traditional computational systems for spatial data have primarily addressed basic queries like spatial kNN, spatial range, and spatial join queries, including variations such as kNN-join queries. However, these queries fall short of addressing the comprehensive needs of spatial statistical analysis. Statistical methods are extensively utilized by social scientists, including geographers, environmental scientists, and ecologists. Consequently, over the past two decades, there has been a parallel development of computing tools, resulting in Python and R libraries like PySAL, GeoDa, GeoPy, and GeoPandas, catering to this broad user base. These users are well-positioned to conduct meaningful analyses on the plethora of available datasets. Notably, ~14 million datasets indexed by Google Dataset Search, predominantly originating from geosciences and social sciences, constitute 45.2% of all datasets, accessed by a third of all users and primarily dominated by spatial data. However, current tools encounter scalability issues with substantial spatial data, such as the vast amounts of social media data rich in insights for social scientists. Amr’s work seeks to fill this void by empowering social scientists with scalable computing systems for spatial statistical analysis on large datasets. Additionally, it enhances the expressiveness of queries, enabling previously unfeasible queries due to scalability constraints. Amr's recent work spans various aspects of scalable and expressive spatial data science. He has significantly enhanced the scalability and expressiveness of spatial grouping queries, which are foundational for spatial statistical analyses. His improvements cover the grouping of spatial points, lines, and polygons across diverse settings and applications. Notably, he has developed advanced spatial regionalization queries, essentially sophisticated polygon grouping queries, that surpass existing methods with up to a 200x increase in runtime speed and the capacity to handle datasets up to 10 times larger. Additionally, he has facilitated the generation of random distributions, empowering the statistical assessment of spatial regionalization solution quality. Side by side, Amr's work integrates machine learning to augment both the scalability and accuracy of spatial queries. This integration encompasses a variety of learning techniques to refine spatio-textual selectivity estimation in dynamic streaming data, identify spatial hotspots along networks with statistical rigor, and enhance the efficiency of spatial joins in distributed settings. Interdisciplinary collaborations: Interdisciplinary projects, developed in partnership with social scientists, are at the heart of Amr's research, and pivotal to the mission of the UCR Center for Geospatial Sciences, which thrives as an interdisciplinary cluster of faculty members. His interdisciplinary projects include collaborators from University of California, Riverside (UCR), as well as the American Association of Geographers, Texas State University, San Diego State University, San Diego Mesa College, the California Geographic Alliance, and Sweetwater Union High School District. Notable achievements: Amr's research is published and recognized in top research venues for big data management and spatial data analysis, including ACM SIGSPATIAL, IEEE ICDE, VLDB, SSTD, IEEE MDM, VLDB Journal, ACM TSAS, IEEE TKDE, Springer GeoInformatica, in addition to interdisciplinary venues. His papers are shortlisted for best paper awards at five major conferences for spatial and spatio-temporal data analysis, IEEE ICDE'14, twice at ACM SIGSPATIAL'19 and '23, IEEE MDM'23 and SSTD'23. He is also awarded the best paper at the 6th International Conference on Information and Communication Technologies for Disaster Management (ICT-DM'19). His research is being supported by eight research funding grants from the USA National Science Foundation (NSF), Google, and Microsoft, four as a Principal Investigator (PI), two as a co-PI and two as a collaborator. This includes the NSF CAREER Award 2023, a distinction that ranks among the most prestigious recognitions for assistant professors from NSF. So far, we raised total of 4.67M USD along with collaborators, including 1.24M USD dedicated to supporting his research group. Officially approved as a Tenured Associate Professor Step 3 at UC Riverside CSE Department, which is equivalent to four years of experience at the Associate Professor rank according to University of California step system. Our demonstration have won the Best Demo Award in ACM SIGSPATIAL 2024 My student Yongyi Liu's PhD work won the ACM SIGSPATIAL 2024 Student Research Competition (SRC). Elevated to IEEE Senior Member grade. Our paper have been shortlisted for ACM SIGSPATIAL 2024 10-Year Impact Award (equivalent to Test-of-time Award). Received the ACM SIGMOD Distinguished PC Member Award 2024. Received the Microsoft MSI research award 2023 to support edge-based geospatial data analysis. Our paper have been selected among the best papers of ACM SIGSPATIAL 2023. Our paper have been selected among top-5 best papers of SSTD 2023. Our paper have been selected as the best paper runner-up in IEEE MDM 2023. Received the Google-CAHSI research award 2023 to support regionalization queries at a system level. Received the NSF CAREER award 2023 to support scalable spatial data science. Serving as a vice PC chair (senior PC member) for ACM SIGSPATIAL 2023. Serving as a PC member for ACM SIGMOD 2023, ICDE 2023, VLDB 2024. Serving as a reviewer for ACM TODS, ACM TSAS, IEEE TKDE, and VLDB Journal. Serving as a co-organizer in different roles for ACM SIGSPATIAL 2023, ICDE 2023, MDM 2023, and SSTD 2023. Our papers have been accepted in ACM SIGSPATIAL 2022. Our paper on p-regions spatial regionalization has been accepted in VLDB 2022. Our paper on expressive max-p spatial regionalization has been accepted in IEEE ICDE 2022. Our paper on social spatio-keyword search on streams has been accepted in ACM TSAS. Our papers have been accepted in ACM SIGSPATIAL 2021. Our paper on learning-based estimation on spatio-textual streams has been accepted in IEEE ICDE 2021. Our paper on spatial group-by queries has been accepted in ACM SIGSPATIAL 2020. Our demo paper on spatial queries on user-generated has been accepted in IEEE ICDE 2020. Our survey paper on microblogs data management has been accepted in VLDB Journal. Received the NSF CRII award 2019 to support scalable queries on user-generated data. Our papers have been accepted in ACM SIGSPATIAL 2019, and one of them has been selected among the best papers. Received NSF RIDIR award to support scalable spatial analysis for social sciences. Our paper on sptial-keyword search on streaming data has been accepted in ACM SIGSPATIAL 2018. Shortlist of ACM SIGSPATIAL 2024 10-Year Impact Award (equivalent to Test-of-time Award). ACM SIGMOD Distinguished PC Member Award 2024. Best research paper runner-up in ACM SIGSPATIAL 2023. NSF CAREER Award 2023. Microsoft Research Award 2023. Google-CAHSI Research Award 2023. Best research paper runner-up in IEEE MDM 2023. Top-5 best papers of SSTD 2023, invited to Springer GeoInformatica special issue. NSF CRII Award 2019. Best research paper candidate in ACM SIGSPATIAL 2019, invited to IEEE TSAS. Best research paper candidate in IEEE ICDE 2014, invited to IEEE TKDE special issue. Finalist in Microsoft Research Ph.D. Fellowship 2014, Data Management and Data Mining. Doctoral Dissertation Fellowship 2015, University of Minnesota. Best demonstration award in UMN U-Spatial Symposium 2012 and 3rd in U-Spatial Symposium 2014. Ten travel grants to major conferences in databases and spatial databases. Prof. Naaem Aboutaleb award for academic excellence - Alexandria University - 2008. (awarded to top two students among all the department's 67 students) Bronze medals in 3rd and 4th Egyptian Olympiad in Informatics (EOI 2005 and 2006). National Scholarship for Academic Excellence, Egyptian Ministry of Higher Education - 2003 (among top 0.1% students nation-wide) Geospatial Data Science Series, University of Wisconsin, Madison - 2024. Google, Madison, Wisconsin - 2024. King Abdullah University of Science and Technology (KAUST), Saudi Arabia - 2023. Qatar Computing Research Institute (QCRI), Qatar - 2023. Doha Data Forum for Inclusive Data Ecosystems and Effective Decision Making, Qatar - 2023. Nanyang Technological University (NTU), Singapore - 2023. Alexandria University, Egypt - 2023. Department of Earth and Planetary Sciences, University of California, Riverside - 2023. University of Maryland - College Park - 2023. Iowa State University - 2023. Lighting Talk, University of California GIS Week - 2021. Department of Statistics, University of California, ",
  "content_length": 24752,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:55"
}