{
  "name": "Amr El-Kadi",
  "homepage": "https://www.aucegypt.edu/fac/amrel-kadi",
  "status": "success",
  "content": "Amr El-Kadi | The American University in Cairo Skip to main content Amr El-Kadi Position: Professor and Chair Department: Department of Computer Science and Engineering Email: elkadi@aucegypt.edu Brief Biography Amr El-Kadi is a professor of computer systems engineering and chair of the Department of Computer Science and Engineering at The American University in Cairo (AUC). He is a consultant to the World Bank Group (WBG).El-Kadi was a member of the IEEE Computer Society and Association for Computing Machinery (ACM) joint task force on Software Engineering Ethics and Professional Practices (SEEPP) that developed the software engineering code of ethics and professional practices adopted by both ACM and IEEE-Computer Society. Currently, he is a member of the Software Engineering Professional Ethics Project (SEPEP) sponsored by the Software Engineering Coordinating Committee (SWECC), which is carrying on the work to professionalize software engineering. El-Kadi served as a consultant research scientist at EMC2 for the Middle East, Gulf and Africa Region. He was also a visiting research professor at The Institute for Massively Parallel Architecture and Computing Technology, The George Washington University, Washington DC, USA in 2013.Before joining AUC, he served as a consultant and systems engineer for the Department of Engineering of the Government of the District of Columbia, USA.  Consulting engineer with the Information, Technology and Facilities Department at the World Bank, Washington DC. He also taught undergraduate and graduate-level courses in EECS at the George Washington University, Washington DC.El-Kadi is a senior member of both the IEEE and the IEEE Computer Society. He served as the Middle East representative of the IEEE Technical Committee on Operating Systems and Applications Environments.  Member of the advisory board of the IEEE Computer Society Special Technical Community on Operating Systems (STCOS). In 1994, he received the IEEE-CS Award of Appreciation.  He is also a member of Eta Kappa Nu; the US National Electrical and Computer Engineering Honor Society, and the Association for Computing Machinery, where he served as past chair of the ACM Egypt chapter. Research Interest Operating SystemsDistributed SystemsCloud ComputingHigh Performance ComputingSoftware EngineeringComputer Architecture Selected Publications Donald Gotterbarn, Keith Miller, Simon Rogerson, Steve Barber, Peter Barnes, Ilene Burnstein, Michael Davis, Amr El-Kadi, N. Ben Fairweather, Milton Fulghum, N. Jayaram, Tom Jewett, Mark Kanko, Ernie Kallman, Duncan Langford, Joyce Currie Little, Ed Mechler, Manuel J. Norman, Douglas Phillips, Peter Ron Prinzivalli, Patrick Sullivan, John Weckert, Vivian Weil, S. Weisband and Laurie Honour Werth. Software Engineering Code of Ethics and Professional Practices,1999. Baher Esmat, Mikhail N. Mikhail, and Amr El-Kadi. Enhanced Mobile IP Protocol.  C. G. Omidyar (Ed.): MWCN 2000, LNCS 1818, Springer-Verlag, 2000.  pp. 158-173. Ghada Bahig, and Amr El-Kadi.  Formal Verification of Automotive Design in compliance with ISO 26262 Design Verification guidelines. IEEE Access, Volume 5, March 2017.  pp. 4505 – 4516. Karim Sobh, and Amr El-Kadi. A Unified Cloud Metering Framework. ISCA International Journal of Computers and Their Applications (IJCA). September, 2016 Journal Special Issue. G. Bahig and A. El-Kadi. Formal Verification Framework for Automotive UML Designs. ACM 2nd Africa and Middle East Conference on Software Engineering (AMECSE), Egypt, 2016, pp. 21-27. G. Bahig, A. El-Kadi, A. El-Hamedy and A. Salem. Safety Analysis of AUTOSAR WatchDog Manager: A Case Study. 1stIEEE Automotive Reliability and Test Workshop (ART), United States, 2016. Karim Sobh, Amr El-Kadi. A Unified Framework for Cloud Metering. ISCA 31st International Conference on Computers and Their Applications. Flamingo Hotel, Las Vegas, Nevada, USA, 4-6 April, 2016. Karim Sobh, Khaled El-Ayat, Fady Morcos, Amr El-Kadi. Scalable Cloud-Based LEO Satellite Constellation Simulator. World Academy of Science, Engineering and Technology, International Science Index, Electronics and Communication Engineering (WASET 2014), 2(6), 1182. Education D.Sc. and M.Sc. degrees in electrical engineering computer science from The George Washington University. Courses Taught CSCE 106 - Fundamental of Computer Science CSCE 110 - Programming Fundamentals CSCE 325 - Concepts of Programming Languages CSCE 345 - Operating Systems CSCE 411 - Software Engineering CSCE 425 - Analysis and Design of Algorithms CSCE 445 - Advanced Operating Systems CSCE 445 - Fundamentals of Distributed Systems CSCE 485 - Parallel and Distributed Systems CSCE 441 - Object Oriented Design and Analysis CSCE 485 - Concurrent Programming CSCE 446 - Computer Security CSCE 511 - Advanced Software Engineering CSCE 545 - Distributed Systems",
  "content_length": 4862,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:54"
}