{
  "name": "Amy Ousterhout",
  "homepage": "https://amyousterhout.com",
  "status": "success",
  "content": "Amy Ousterhout Amy Ousterhout Assistant Professor Computer Science and Engineering UC San Diego Office: EBU3B 3130 aousterhout@ucsd.edu Google Scholar About I am an Assistant Professor in Computer Science and Engineering at the University of California, San Diego. My research interests are in operating systems and networks. Prior to UCSD, I was a postdoctoral researcher in the NetSys Lab at UC Berkeley, where I worked with Scott Shenker and Sylvia Ratnasamy. I received my Ph.D. in 2019 from MIT CSAIL, advised by Hari Balakrishnan and Adam Belay, and I received a B.S.E. in Computer Science from Princeton University. Research My current research projects focus on designing efficient and high-performance systems for datacenter applications. Support for microsecond-scale tasks: Efficient CPU scheduling (Shenango, Caladan, and Scheduling Policies) Memory management and zero-copy serialization (Cornflakes) Leveraging new hardware features (xUI, Aspen) Resource disaggregation: Efficient and flexible far memory (Fastswap, Eden) Students Ryan Kosta Liam Arzola Ani Canumalla Linsong Guo Teaching CSE 120 - Operating Systems Principles, Spring 2023, Spring 2025 CSE 190 - Data Center Systems, Winter 2025, Winter 2026 CSE 221 - Graduate Operating Systems, Winter 2024, Fall 2024, Fall 2025 CSE 291 - Operating Systems in Datacenters, Fall 2022, Fall 2023 Publications The Benefits and Limitations of User Interrupts for Preemptive Userspace Scheduling Linsong Guo, Danial Zuberi, Tal Garfinkel, Amy Ousterhout NSDI 2025 Eden: Developer-Friendly Application-Integrated Far Memory Anil Yelam, Stewart Grant, Saarth Deshpande, Nadav Amit, Radhika Niranjan Mysore, Amy Ousterhout, Marcos K. Aguilera, Alex C. Snoeren NSDI 2025 Extended User Interrupts (xUI): Fast and Flexible Notification without Polling Berk Aydogmus, Linsong Guo, Danial Zuberi, Tal Garfinkel, Dean Tullsen, Amy Ousterhout, Kazem Taram ASPLOS 2025 Best Paper Award Efficient Microsecond-scale Blind Scheduling with Tiny Quanta Zhihong Luo, Sam Son, Dev Bali, Emmanuel Amaro, Amy Ousterhout, Sylvia Ratnasamy, Scott Shenker ASPLOS 2024 Cornflakes: Zero-Copy Serialization for Microsecond-Scale Networking Deepti Raghavan, Shreya Ravi, Gina Yuan, Pratiksha Thaker, Sanjari Srivastava, Micah Murray, Pedro Henrique Penna, Amy Ousterhout, Philip Levis, Matei Zaharia, Irene Zhang SOSP 2023 Limited Access: The Truth Behind Far Memory Anil Yelam, Stewart Grant, Enze Liu, Radhika Niranjan Mysore, Marcos K Aguilera, Amy Ousterhout, Alex C Snoeren WORDS 2023 Out of Hand for Hardware? Within Reach for Software! Zhihong Luo, Silvery Fu, Emmanuel Amaro, Amy Ousterhout, Sylvia Ratnasamy, Scott Shenker HotOS 2023 Zed: Leveraging Data Types to Process Eclectic Data Amy Ousterhout, Steve McCanne, Henri Dubois-Ferriere, Silvery Fu, Sylvia Ratnasamy, Noah Treuhaft CIDR 2023 Efficient Scheduling Policies for Microsecond-Scale Tasks Sarah McClure, Amy Ousterhout, Scott Shenker, Sylvia Ratnasamy NSDI 2022 Caladan: Mitigating Interference at Microsecond Timescales Joshua Fried, Zhenyuan Ruan, Amy Ousterhout, Adam Belay OSDI 2020 Remote Memory Calls Emmanuel Amaro, Zhihong Luo, Amy Ousterhout, Arvind Krishnamurthy, Aurojit Panda, Sylvia Ratnasamy, Scott Shenker HotNets 2020 Can Far Memory Improve Job Throughput? Emmanuel Amaro, Christopher Branner-Augmon, Zhihong Luo, Amy Ousterhout, Marcos K. Aguilera, Aurojit Panda, Sylvia Ratnasamy, Scott Shenker EuroSys 2020 Just In Time Delivery: Leveraging Operating Systems Knowledge for Better Datacenter Congestion Control Amy Ousterhout, Adam Belay, Irene Zhang HotCloud 2019 Shenango: Achieving High CPU Efficiency for Latency-sensitive Datacenter Workloads Amy Ousterhout, Joshua Fried, Jonathan Behrens, Adam Belay, Hari Balakrishnan NSDI 2019 slides code Flexplane: An Experimentation Platform for Resource Management in Datacenters Amy Ousterhout, Jonathan Perry, Hari Balakrishnan, Petr Lapukhov NSDI 2017 slides code Fastpass: A Centralized \"Zero-Queue\" Datacenter Network Jonathan Perry, Amy Ousterhout, Hari Balakrishnan, Devavrat Shah, Hans Fugal SIGCOMM 2014 Service OSDI Program Committee - 2025 SOSP Program Committee - 2024 OSDI Program Committee - 2024 NSDI Program Committee - 2023, 2024 HotOS Program Committee - 2023 ATC Program Committee - 2021, 2023",
  "content_length": 4283,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:59"
}