{
  "name": "Amy Pavel",
  "homepage": "https://amypavel.com",
  "status": "success",
  "content": "Amy PavelAssistant ProfessorUC BerkeleyElectrical Engineering and Computer SciencesEmail amypavel@berkeley.eduOffice SDH 415Twitter @amypavelPublications Google ScholarCurriculum Vitae PDFResearch GroupPh.D. Students: Mina Huh, Karim Benharrak, Ananya Gubbi Mohanbabu, Meng Chen, Yi-Hao Peng (co-advised with Jeffrey P. Bigham)Masters and Undergraduates: Aadit Barua, Akhil Iyer, Katie Clark, Sumaya Al-Bedaiwi, Ujjaini Das, Jerry He, Sarah ZhengRecent Alumni: Doeun Lee, Pranav Venkatesh, Tess Van Daele, Yuning Zhang, Daniel Killough, Jalyn Derry, Aochen Jiao, Soumili Kole, Chitrank GuptaI am an Assistant Professor in the Department of Electrical Engineering and Computer Sciences at the University of California, Berkeley and a Visiting Faculty Resesarcher at Google Research. Before joining UC Berkeley, I spent three wonderful years (Spring 2022-Spring 2025) as an Assistant Professor in the Department of Computer Science at the University of Texas at Austin. I was previously a postdoc at Carnegie Mellon University, a Research Scientist at Apple, and I received my PhD from UC Berkeley EECS. I regularly teach a Computer Science class that covers the design and development of user interfaces (Introduction to Human-Computer Interaction). Prior versions include CS160 at UC Berkeley in 2018 and CS378 at UT Austin in 2022.Current UC Berkeley Students: I am actively recruiting UC Berkeley students for research positions in my lab! Check out this document (CalNet ) to learn more and apply.Prospective Students, Visitors, Interns, and Postdocs: I recruit PhD students every year. Please apply directly to the UC Berkeley EECS PhD program and list me as a potential advisor. For other questions or positions, please read these FAQs before reaching out.Research HighlightsGenAssistUIST 2023 – Best Paper AwardPDF | Project PageCrossA11yUIST 2022 – Best Paper AwardPDF | Project Page | VideoRescribeUIST 2020PDF | Video | TalkLong-Form VQACOLM 2024 – Oral SpotlightProject PageResearch SummaryAs a systems researcher in Human-Computer Interaction and Accessibility, I embed machine learning technologies (e.g., Natural Language Processing) into new human interactions that I then deploy to test. Using my systems, remote content creators more effectively collaborate, video authors efficiently create accessible descriptions for blind users, and instructors help students to learn and retain key points. To inform future systems that capture what is important to domain experts and people with disabilities, I also conduct and collaborate on in-depth qualitative (e.g., AAC communication, memes) and quantitative studies (e.g., 360° Video, VR Saliency). My research goal is to make communication effective and accessible.PreprintsVid2Coach: Transforming How-To Videos into Task AssistantsMina Huh, Zihui Xue, Ujjaini Das, Kumar Ashutosh, Kristen Grauman, Amy PavelTo Appear at UIST 2025Project Page | arXivMorae: Proactively Pausing UI Agents for User ChoicesYi-Hao Peng, Dingzeyu Li, Jeffrey P. Bigham, Amy PavelTo Appear at UIST 2025TalkLess: Blending Extractive and Abstractive Speech Summarization for Editing Speech to Preserve Content and StyleKarim Benharrak, Puyuan Peng, Amy PavelTo Appear at UIST 2025arXivCoSight: Exploring Viewer Contributions to Online Video Accessibility Through Descriptive CommentingRuolin Wang, Xingyu Liu, Biao Wang, Wayne Zhang, Ziqian Liao, Ziwen Li, Amy Pavel, Xiang \"Anthony\" ChenTo Appear at UIST 2025arXivVeasyGuide: Personalized Visual Guidance for Low-vision Learners on Instructor Actions in Presentation VideosYotam Sechayk, Ariel Shamir, Amy Pavel, Takeo IgarashiTo Appear at ASSETS 2025Project Page | arXivTask Mode: Dynamic Filtering for Task-Specific Web Navigation using LLMsAnanya Gubbi Mohanbabu, Yotam Sechayk, Amy PavelTo Appear at ASSETS 2025arXivSurfacing Variations to Calibrate Perceived Reliability of MLLM-generated Image DescriptionsMeng Chen, Akhil Iyer, Amy PavelTo Appear at ASSETS 2025arXivResearch PapersVideoDiff: Human-AI Video Co-Creation with AlternativesMina Huh, Dingzeyu Li, Kim Pimmel, Valentina Hijung, Amy Pavel, Mira DontchevaCHI 2025arXivLotus: Creating Short Videos From Long Videos With Abstractive and Extractive SummarizationAadit Barua, Karim Benharrak, Meng Chen, Mina Huh, Amy PavelIUI 2025arXivLong-Form Answers to Visual Questions from Blind and Low Vision PeopleMina Huh, Fangyuan Xu, Yi-Hao Peng, Chongyan Chen, Hansika Murugu, Danna Gurari, Eunsol Choi, Amy PavelCOLM 2024Oral SpotlightProject PageDesign Considerations for Photosensitivity Warnings in Visual MediaLaura South, Caglar Yildirim, Amy Pavel, Michelle A. BorkinASSETS 2024Context-Aware Image Descriptions for Web AccessibilityAnanya Gubbi Mohanbabu, Amy PavelASSETS 2024Project PageDreamStruct: Understanding Slides and User Interfaces via Synthetic Data GenerationYi-Hao Peng, Faria Huq, Yue Jiang, Jason Wu, Amanda Xin Yue Li, Jeffrey P. Bigham, Amy PavelECCV 2024DesignChecker: Visual Design Support for Blind and Low Vision Web DevelopersMina Huh, Amy PavelUIST 2024Project PageBarriers to Photosensitive Accessibility in Virtual RealityLaura South, Caglar Yildirim, Amy Pavel, Michelle A. BorkinCHI 2024Honorable Mention AwardPDFShortScribe: Making Short-Form Videos Accessible with Hierarchical Video SummariesTess Van Daele, Akhil Iyer, Yuning Zhang, Jalyn Derry, Mina Huh, Amy PavelCHI 2024Project PageCOMPA: Using Conversation Context to Achieve Common Ground in AACStephanie Valencia, Jessica Huynh, Emma Y Jiang, Yufei Wu, Teresa Wan, Zixuan Zheng, Henny Admoni, Jeffrey P. Bigham, Amy PavelCHI 2024PDFGeoLatent: A Geometric Approach to Latent Space Design for Deformable Shape GeneratorsHaitao Yang, Bo Sun, Liyan Chen, Amy Pavel, Qixing HuangSIGGRAPH ASIA 2023GenAssist: Making Image Generation AccessibleMina Huh, Yi-Hao Peng, Amy PavelUIST 2023Best Paper AwardPDF | Project PageExploring Community-Driven Descriptions for Making Livestreams AccessibleDaniel Killough, Amy PavelASSETS 2023PDFAVscript: Accessible Video Editing with Audio-Visual ScriptsMina Huh, Saelyne Yang, Yi-Hao Peng, Xiang \"Anthony\" Chen, Young-Ho Kim, Amy PavelCHI 2023PDF | Project PageSlideSpecs: Automatic and Interactive Presentation Feedback CollationJeremy Warner, Amy Pavel, Tonya Nguyen, Maneesh Agrawala, Björn HartmannIUI 2023PDF | Project Page | Demo | CodeCrossA11y: Identifying Video Accessibility Issues via Cross-modal GroundingXingyu Liu, Ruolin Wang, Dingzeyu Li, Xiang \"Anthony\" Chen, Amy PavelUIST 2022Best Paper AwardPDF | Project Page | VideoDiffscriber: Describing Visual Design Changes to Support Mixed-Ability Collaborative Presentation AuthoringYi-Hao Peng, Jason Wu, Jeffrey P. Bigham, Amy PavelUIST 2022PDF | Video PreviewTech Help Desk: Support for Local Entrepreneurs Addressing the Long Tail of Computing ChallengesYasmine Kotturi, Herman T Johnson, Michael Skirpan, Sarah E Fox, Jeffrey P. Bigham, Amy PavelCHI 2022PDFToward supporting quality alt text in computing publicationsCandace Williams, Lilian de Greef, Ed Harris III, Amy Pavel, Cynthia L. BennettW4A 2022PDFTutorialLens: authoring Interactive augmented reality tutorials through narration and demonstrationJunhan Kong, Dena Sabha, Jeffrey P. Bigham, Amy Pavel, Anhong GuoSUI 2021PDFSlidecho: Flexible Non-Visual Exploration of Presentation VideosYi-Hao Peng, Jeffrey P. Bigham, Amy PavelASSETS 2021PDFControlling Dialogue Generation with Semantic Exemplars.Prakhar Gupta, Jeffrey P. Bigham, Yulia Tsvetkov, Amy PavelNAACL 2021PDFSay It All: Feedback for Improving Non-Visual Presentation AccessibilityYi-Hao Peng, JiWoong Jang, Jeffrey P. Bigham, Amy PavelCHI 2021PDF | 30s Video | Presentation (5 min) | Presentation TranscriptWhat Makes a Video Non-Visually Accessible?Xingyu Liu, Patrick Carrington, Xiang \"Anthony\" Chen, Amy PavelCHI 2021PDF | 30s Video | Presentation (5 min)Co-designing Socially Assistive Sidekicks for Motion-based AACStephanie Valencia, Michal Luria, Amy Pavel, Jeffrey P. Bigham, Henny AdmoniHRI 2021PDFRescribe: Authoring and Automatically Editing Audio Descriptions.Amy Pavel, Gabriel Reyes, Jeffrey P. BighamUIST 2020PDF | Video | TalkMaking Mobile Augmented Reality Applications Accessible.Jaylin Herskovitz, Jason Wu, Samuel White, Amy Pavel, Gabriel Reyes, Anhong Guo, Jeffrey P. BighamASSETS 2020PDF | VideoMaking GIFs Accessible.Cole Gleason, Amy Pavel, Himalini Gururaj, Kris M. Kitani, Jeffrey P. BighamASSETS 2020Paper | Link to Thumbnail GIFDisability and the COVID-19 Pandemic: Using Twitter to Understand Accessibility during Rapid Societal Transition.Cole Gleason, Stephanie Valencia, Lynn Kirabo, Jason Wu, Anhong Guo, Elizabeth J. Carter, Jeffrey P. Bigham, Cynthia L. Bennett, Amy PavelASSETS 2020PDFTwitter A11y: A Browser Extension to Make Twitter Images Accessible.Cole Gleason, Amy Pavel, Emma McCamey, Christina Low, Patrick Carrington, Kris M. Kitani, Jeffrey P. BighamCHI 2020Honorable Mention AwardPDFConversational Agency in Augmentative and Alternative Communication.Stephanie Valencia, Amy Pavel, Jared Santa Maria, Seunga (Gloria) Yu, Jeffrey P. Bigham, Henny AdmoniCHI 2020Honorable Mention AwardPDFMaking Memes Accessible.Cole Gleason, Amy Pavel, Xingyu Liu, Patrick Carrington, Lydia Chilton, Jeffrey P. BighamASSETS 2019PDF | Time articleInvestigating Evaluation of Open-Domain Dialogue Systems With Human Generated Multiple References.Prakhar Gupta, Shikib Mehri, Tiancheng Zhao, Amy Pavel, Maxine Eskenazi, Jeffrey P. BighamSIGDIAL 2019PDF | CodeSaliency in VR: How do people explore virtual environments?Vincent Sitzmann, Ana Serrano, Amy Pavel, Maneesh Agrawala, Diego Gutierrez, Belen Masia, Gordon WetzsteinIEEE VR 2018Project Page | Code | VideoShot Orientation Controls for Interactive Cinematography with 360 video.Amy Pavel, Björn Hartmann, Maneesh AgrawalaUIST 2017PDF | Code | VideoVidcrit: Video-based Asynchronous Video Review.Amy Pavel, Dan B Goldman, Björn Hartmann, Maneesh AgrawalaUIST 2016PDF | VideoSceneSkim: Searching and Browsing Movies Using Synchronized Captions, Sc",
  "content_length": 14526,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:01"
}