{
  "name": "Amy Voida",
  "homepage": "http://amy.voida.com",
  "status": "success",
  "content": "Amy Voida Skip to content Dr. Amy Voida is an associate professor and founding faculty in the Department of Information Science at the University of Colorado Boulder. She also holds a courtesy appointment with the CU Department of Computer Science and is a faculty fellow with CU’s ATLAS Institute. Dr. Voida conducts empirical and design research in human–computer interaction and computer supported cooperative work, with a focus on philanthropic informatics—an interdisciplinary domain she pioneered exploring the role of information and communication technologies in supporting nonprofit and other work for the public good.  Her research has been funded by the National Science Foundation. Dr. Voida earned her Ph.D. in Human–Centered Computing from the Georgia Institute of Technology. She also holds an M.S. in Human–Computer Interaction from Georgia Tech and a B.A.E. in Elementary Education from Arizona State University. She has held academic appointments at Indiana University, IUPUI; Cornell University; the University of California, Irvine; and the University of Calgary. She has also worked at the Palo Alto Research Center, IBM Research, and as an artist-in-residence for opera education. For more details, please consult my cv. amy.voida@colorado.eduINFO 298 / 315 UCBDept. of Information ScienceUniversity of Colorado BoulderBoulder, CO 80309 An Overview of Philanthropic Informatics I have pioneered the domain of philanthropic informatics, an interdisciplinary research area exploring the role of information and communication technologies in supporting nonprofit and other work for the public good.  This research takes philanthropic work as its unit of analysis, and traces its influences and impacts across myriad technologies, across individual and collective action, across sectors, and across hybrid and dynamic organizational and institutional forms. It draws from research conducted across academic disciplines with a goal of supporting philanthropic work wherever it can be nurtured and provoked. Bopp C. & Voida, A. (2020). Voices of the Social Sector: A Systematic Review of Stakeholder Voice in HCI Research with Nonprofit Organizations. ACM Transactions on Computer-Human Interaction 27(2), Article 9, 26 pages. Harmon, E., Bopp, C., & Voida, A. (2017). The Design Fictions of Philanthropic IT: Stuck Between an Imperfect Present and an Impossible Future. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI). Denver, CO, May 6–11. New York: ACM Press, pp. 7015–7028. Selected Research Themes & Sample Publications The Data-Driven Nonprofit We have partnered with a wide variety of nonprofit organizations to better understand their information management strategies and struggles. Our findings suggest that the knowledge workers (both employees and volunteers) at these organizations are being immensely creative, constructing novel assemblages of very diverse information management systems, which we call “homebrew databases.” The downside here is that few if any of these systems have been designed to work well with each other, so organizations are constantly swapping one system for another, trying to streamline their homebrew databases and migrate as much of their data to as few systems as possible—ultimately leading to an incredibly frustrating and unproductive state of infrastructural churn and data creep. All of this makes aggregating and analyzing data at scale or longitudinally nearly impossible, which leaves nonprofit organizations in a bind given the incredible pressure to become more data-driven—a pressure that contributes to a self-reinforcing cycle of disempowerment for those organizations. Benjamin, L.M., Voida, A. & Bopp, C. (2018). Policy Fields, Data Systems and the Performance of Nonprofit Human Service Organizations. Human Service Organizations: Management, Leadership, & Governance. Special Issue on Human Service Agencies and the Question of Impact: Lessons for Theory, Policy, and Practice 42(2) 185—204. Bopp, C., Harmon, E., & Voida, A. (2017). Disempowered by Data: Nonprofits, Social Enterprises, and the Consequences of Data-Driven Work.  In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI). Denver, CO, May 6–11. New York: ACM Press, pp. 3608–3619. Voida, A., Harmon, E. & Al-Ani, B. (2011). Homebrew databases: Complexities of everyday information management in nonprofit organizations. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI 2011). Vancouver, BC, May 7-12. New York: ACM Press, pp. 915–924. [CHI Best Paper Award Nominee] Advocacy Data Work & Data Rhetoric Nonprofit advocacy organizations have some of the most powerful voices in contemporary politics. The ways in which they use data can be highly influential. Our research combines qualitative studies of the various genres of data work in advocacy organizations, finding powerful exemplars of data feminist principles in action, with content analyses of the rhetorical data work of political action committees on social media. This latter research explores ideological differences in data rhetoric, audience engagement with data rhetoric, patterns of data rhetorics’ propagation across social networks, as well as multimodal differences in data rhetoric. Darian, S., Dym, B. & Voida, A. (2023). Competing imaginaries and partisan divides in the data-rhetoric of advocacy organizations. Proceedings of the ACM on Human-Computer Interaction–CSCW 7(2), Article 259, 29 pages. Darian, S., Chauhan, A., Marton, R., Ruppert, J., Anderson, K., Clune, R., Cupchak, M., Gannett, M., Holton, J., Kamas, L., Kibozi-Yocka, J., Mauro-Gallegos, D., Naylor, S., O’Malley, M., Patel, M., Sandberg J., Siegler, T., Tate, R., Temtim, A., Whaley, S. & Voida, A. (2024). Enacting data feminism in advocacy data work. Proceedings of the ACM on Human-Computer Interaction–CSCW 7(2), Article 259, 29 pages. Promoting Equity in Philanthropic Recommendations We have partnered with Kiva Microfunds to explore the design of recommender systems that prioritize fairness and equity in how they promote loans in their online marketplace — a design goal that is directly in line with Kiva’s mission of providing capital to individuals who are financially underserved. We take a multi-stakeholder perspective in this research, balancing the needs of borrowers, lenders, and the organization. Smith, J.J., Buhayh, A., Kathait, A., Ragothaman, P., Mattei, N., Burke, R. & Voida, A. (2023). The many faces of fairness: Exploring the institutional logics of multistakeholder microlending recommendation. ACM Conference on Fairness, Accountability and Transparency. Chicago, IL, June 12—15. New York: ACM Press, 1652—1663. Aird, A., Farastu, P., Sun, J., Voida, A. Mattei, N. & Burke, R. (2024) Dynamic fairness-aware recommendation through multi-agent social choice. ACM Transactions on Recommender Systems 3(2), Article 21 (June 2025), 35 pages. Experiential Education in Information & Computer Science Experiential education includes multiple types of high impact pedagogies such as service learning and study abroad. These pedagogies have often been found to improve the retention of historically underrepresented populations in computer and information science and yet are used only to a limited extent in these disciplines. Service LearningOur NSF-funded research about service learning takes a multi-stakeholder perspective, exploring benefits and challenges for students, faculty and community partners (often nonprofits). A summary of the full arc of research is also available here. Education AbroadOur research about study abroad is currently centered around a summer study abroad course that I co-designed and started teaching in 2024: Defamiliarizing Data: The Ethnography and Design of Making Data Strange. Robledo Yamamoto, F., Barker, L. & Voida, A. (2024). Faculty, Student, and Community Partner Experiences in Computer and Information Science Service Learning. ACM Transactions on Computing Education 24(3), Article 31, 26 pages. Robledo Yamamoto, F., Barker, L. & Voida, A. (2023). CISing Up Service Learning: A Systematic Review of Service Learning Experiences in Computer and Information Science. ACM Transactions on Computing Education 23(3), Article 37, 56 pages. Voida, A. (2024). Bite-Sized Experiential Education for Computer and Information Science. Proceedings of the SIGCSE Technical Symposium. Portland, OR, March 20-23. New York: ACM Press, 269–275. Harrell, A., Lentz, S., Robledo Yamamoto, F., Voida, A and Barker, L. (2024). Putting the service into service learning: A report on a survey of CIS faculty. Proceedings of the SIGCSE Technical Symposium. Portland, OR, March 20-23. New York: ACM Press, 470–476. Voida, A. Voida, S., Dean, J., Pradhan, I., & Schermer, W. (2026). Defamiliarizing Data: An Education Abroad Course in Human-Centered Computing and Information Science. To appear in Proceedings of the SIGCSE Technical Symposium. [Email for a preprint, if you are interested!] Voida, A., Voida, S. Schermer, W., Pradhan, I. & Dean, J. (2026). The Development of Intercultural Competence through Information Science Education Abroad. To appear in Proceedings of the SIGCSE Technical Symposium. [Email for a preprint, if you are interested!]",
  "content_length": 9283,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:03"
}