{
  "name": "Amy P. Felty",
  "homepage": "http://www.site.uottawa.ca/~afelty",
  "status": "success",
  "content": "Amy Felty Amy Felty Professor Emeritus Research Interests: Formal methods, particularly interactive theorem proving and automated deduction; Logical frameworks and their application in domains such as programming languages, systems biology, privacy and security, and proof theory Teaching CSI 5137 Software Foundations, Fall 2021 CSI 5110 Principles of Formal Software Development, Fall 2016 CSI 4900 Projets de recherche/Honours Project, Fall 2021 and Winter 2022 CSI 4125 Theory of Programming Languages, Winter 2008 CSI 3104 Introduction to Formal Languages, Winter 2020 CSI 3120 Programming Language Concepts, Fall 2020 CSI 3520 Concepts des langages de programmation, Automne 2019 CSI 3504 Introduction aux langages formels, Hiver 2017 SEG 2105 Introduction to Software Engineering, Winter 2010 CSI 2120 Programming Paradigms, Winter 2011 CSI 2520 Paradigmes de programmation, Hiver 2012 ITI 1120 Introduction to Computing I, Winter 2008 Research Software Correctness and Safety Research Laboratory The Logic and Foundations of Computing Group Two-Level Hybrid in Coq Publication List Professional Journal of Automated Reasoning: Member of Editorial Board, Springer. Journal of Applied Logics: IfCoLog Journal: Member of Editorial Board, College Publications. Conferences International Conference on Formal Structures for Computation and Deduction (FSCD), Steering Committee Member. Women in Logic (WiL), Steering Committee Member. International Workshop on Logical Frameworks and Meta-Languages: Theory and Practice (LFMTP), Steering Committee Member. Miscellaneous CV in pdf format Special Issue for the Logical and Semantic Frameworks with Applications Workshops 2019 and 2020, Mathematical Structures in Computer Science, 32(9), October 2022. Proceedings of the Seventh International Conference on Formal Structures for Computation and Deduction (FSCD 2022), LIPICS Vol. 228, August 2022. Proceedings of the Fourteenth International Workshop on Logical and Semantic Frameworks, with Applications (LSFA 2019). Electronic Notes in Theoretical Computer Science, Volume 348, March 2020. Special Issue on Structural Proof Theory, Automated Reasoning and Computation in Celebration of Dale Miller's 60th Birthday, Mathematical Structures in Computer Science, 29(8), September 2019. Proceedings of the Seventh ACM SIGPLAN International Conference on Certified Programs and Proofs, January 2018. Special Issue of Selected Extended Papers of CADE 2015, Journal of Automated Reasoning, 58(3), March 2017. Proceedings of the 25th International Conference on Automated Deduction (CADE-25), Springer Lecture Notes in Computer Science, Volume 9195, 2015. Proceedings of the Ninth International Workshop on Logical Frameworks and Meta-Languages: Theory and Practice (LFMTP'14). Proceedings of the Third International Conference on Interactive Theorem Proving (ITP'12), Springer Lecture Notes in Computer Science, Volume 7406. Proceedings of the Fourth International Workshop on Logical Frameworks and Meta-Languages: Theory and Practice (LFMTP'09). Proceedings of the Seventh ACM SIGPLAN international conference on Principles and Practice of Declarative Programming (PPDP'05). Special Issue on Proof-Carrying Code, Journal of Automated Reasoning, 31(3-4), November 2003. Notes (lecture 1 and lecture 2) on proof-carrying code for the June 2002 Summer School on the Proofs-as-Programs. Special Issue on Current Trends in Logical Frameworks and Metalanguages (LFM'99 workshop), Journal of Automated Reasoning, 27(1), 2001. Proceedings of the 1999 Workshop on Logical Frameworks and Meta-languages (LFM'99). Proceedings of the Tenth International Conference on Theorem Proving in Higher-Order Logic (TPHOLs'97), Springer Lecture Notes in Computer Science, Volume 1275. Some of my Lambda Prolog code specifying and implementing theorem provers. A tutorial on Lambda Prolog and its Application to Theorem Proving. Amy Felty School of Electrical Engineering and Computer Science (EECS) University of Ottawa 800 King Edward Ave. Ottawa, Ontario, Canada, K1N 6N5 Tel: (613) 562-5800 x6694, Fax: (613) 562-5664 Office: 4009A SITE Email: afelty@uottawa.ca",
  "content_length": 4140,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:01"
}