{
  "name": "Amy E. Ogan",
  "homepage": "https://www.hcii.cmu.edu/people/amy-ogan",
  "status": "success",
  "content": "Amy Ogan | Human-Computer Interaction Institute Skip to main content Search Expand Menu Close Menu Amy Ogan Associate Professor of Learning Sciences Faculty PhD Alumni BHCI Alumni Class of 2003 Email aeo@cs.cmu.edu Campus Address Newell-Simon Hall 3527 Links Website Google Scholar Program Website: Learning Sciences for Innovators Research Areas Learning Sciences and Educational Technologies Human-Centered AI Games and Play Interaction and Experience Design Advisees Christine Kwon Phenyo Moletsane Administrative Staff Reenie Kirby I am an educational technologist focusing on ways to make learning experiences more engaging, effective, and enjoyable. My training spans many disciplines, with undergraduate degrees in Computer Science and Spanish, and a Ph.D. in Human-Computer Interaction supported by a fellowship from the Institute of Education Sciences (IES). I have been named a Rising Star in EECS by MIT, a World Economic Forum Young Scientist, received the McCandless Chair and the Thomas and Lydia Moran Professorship in Learning Science, and been awarded the Jacobs Early Career Fellowship to study the use of educational technologies in emerging economies. I have been a visiting researcher at USC’s Institute for Creative Technologies and the Pontificia Universidad Católica de Chile, and have conducted field research on the deployment of educational technology across many international sites. My research (CV) is supported by the National Science Foundation, Google, the McDonnell Foundation, and the Jacobs Foundation. In the News What’s Next for AI and Education The Human-Computer Interaction Institute (HCII) had a large presence at three educational technology-focused conferences last month in Pal... View Details HCII Highlights in Spring Issue of The Link The Spring 2025 issue of The Link magazine from the School of Computer Science at Carnegie Mellon University is now available. \"Optimizing... View Details CMU at CHI 2025 Our halls are abuzz with talk of “CHI” (pronounced “kai”), the nickname for the upcoming conference on computer human interaction (CHI). ... View Details SCS Research Highlights Kids' Role in AI Seated at a laptop and surrounded by other students, a young girl asked an image generator powered by artificial intelligence to create a ... View Details Related Projects Project ClassInSight While much of education research is focused on student performance, this research turns the focus to the development of the teacher. While much of education research is focused on student performance, this research turns the focus to the development of the teacher. Almost all K-12 instructors receive in-depth training on how to te ... View Details Project Personal Informatics for Intercultural Competence Working and living internationally can be a rewarding but difficult experience. This project investigates how people gain intercultural competence while d Working and living internationally can be a rewarding but difficult experience. This project investigates how people gain intercultural competence while developing technology to support the learning e ... View Details Project Lowering Barriers to Access and Enhancing Play in MOOCs If Massive Online Open Courses (MOOCs) are the democratizing educational innovation that many claim them to be, then why do the largest proportion of MOOC If Massive Online Open Courses (MOOCs) are the democratizing educational innovation that many claim them to be, then why do the largest proportion of MOOC learners hold a college degree or higher and ... View Details Project ETAC: Educational Technology Across Cultures Educational technology has the potential to transform teaching and learning across the world. However, the design of globalized technologies frequently do Educational technology has the potential to transform teaching and learning across the world. However, the design of globalized technologies frequently does not account for local practices and values ... View Details Back to Top",
  "content_length": 3995,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:58"
}