{
  "name": "Amy Ulinski Banic",
  "homepage": "http://www.uwyo.edu/cosc/cosc-directory/abanic/index.html",
  "status": "success",
  "content": "Department of Electrical Engineering and Computer Science Department of Electrical Engineering and Computer Science College of Engineering and Physical Sciences Electrical Engineering Electrical engineers design control and communication systems, sensors, displays, machine learning , robots, instruments, speech recognition, computer vision, electronics, motors, power systems, the internet of things—the list goes on and on. Computer Engineering Computer engineering is a blend of computer science and electrical engineering. A computer engineering degree consists of both hardware and software courses. Computer Science Traditional areas of computer science, such as graphics, software engineering, networks, databases, multimedia, and artificial intelligence, remain strong, with job growth being driven by the fundamental impact of computer science in nearly every industry. About Our Department The Electrical Engineering and Computer Science (EECS) Department is committed to excellence in teaching, research, and service. Distinguished faculty conduct world-class research and their instruction is recognized via numerous teaching awards. Rigorous instruction, small class sizes, and extremely competitive tuition guarantee an accessible, challenging, and rewarding experience in EECS. EECS offers undergraduate degrees in Electrical Engineering, Computer Engineering, and Computer Science.  These programs include concentrations in big data, business applications, bio-engineering, and a K-12 endorsement and cybersecurity certificate. QuickStart programs allow top students to earn a MS and BS in a total of five years. EECS offers MS and PhD programs in Electrical Engineering and in Computer Science. Areas of expertise in EE include: Bio-engineering, Controls, Electrical Energy Systems, Internet of Things, Robotics, Signal Processing and Computer Networks.  Areas of expertise in CS include artificial intelligence, computational complexity, cybersecurity, formal methods and theorem proving, Human-centered computing and interactions, 3D User interfaces and graphics. At the Department of Electrical Engineering and Computer Science, we are proud to be a part of this college and University while helping mold the next generation of computer and electrical engineers and scientists. Learn More Navigation Main Page About LEARN MOREAbout the DepartmentLab FacilitiesCEPS AdvisingUndergraduate StudentsLEARN MOREEECS Undergraduate DegreesEECS Minors & CertificatesPaying for CollegeResources for Current StudentsCourse CatalogGraduate StudentsLEARN MOREGraduate Degrees in Electrical Engineering and Computer ScienceBS/MS QuickStart ProgramPh.D. ProgramsGraduate Admissions InformationCourse CatalogFaculty and StaffLEARN MOREFaculty & StaffGraduate StudentsEmeritus & Adjunct FacultyDepartment ResearchLEARN MOREDepartment ResearchEECS Faculty DirectoryEECS Advisory BoardEECS Announcements & EventsABET AccreditationLEARN MOREQ&ADegrees AwardedEnrollment StatisticsCEPS HomeLEARN MOREAcademic ProgramsVirtual OpportunitiesResearchAlumni and FriendsDean's OfficeFaculty and Staff DirectoryUW Engineering ShopMarketing and Communication ServicesStudent ResourcesInnovationEvents CalendarNews & PublicationsEngineering ScienceRequest More InformationUndergraduate AdvisingLEARN MOREAdvising ServicesCurriculum InformationPolicies and Procedures Resources for SuccessStudent ExpectationsAdvising Center Staff Search ProgramsDirectory Filtersearch Electrical Engineering and Computer Science Degree Programs Select a Program B.S. in Computer Engineering B.S. in Computer Science B.S. in Electrical Engineering Electrical Engineering F.M. Long Memorial Bioengineering Option M.S. in Computer Science M.S. in Electrical Engineering Ph.D. in Computer Science Ph.D. in Electrical Engineering Cybersecurity Certificate B.S./M.S. Quickstart in Electrical and Computer Engineering B.S./M.S. Quickstart in Computer Science B.S. in Computer Engineering Interested in the tech that powers everything from smartphones to self-driving cars? Our computer engineering degree blends hardware and software to prepare you for a wide range of careers, and there’s a minor if you want to add it to another major! Learn more Learn to code, problem-solve and design intelligent systems with a degree in computer science. Whether you want to build apps or explore AI, we’ve got you covered. We also offer a computer science minor! Learn more From renewable energy to robotics, electrical engineering is at the heart of innovation. Explore the principles of circuits, electronics and systems, and consider the minor if you’re majoring in a related field. Learn More Looking to combine engineering with biology or healthcare? This unique option within electrical engineering prepares you to apply engineering solutions in medical and biological contexts. Learn more Dive deeper into the world of algorithms, software systems and advanced computing with our graduate programs in computer science. Just looking to complement your studies? We also offer a minor at the graduate level. Learn More Advance your expertise in areas like power systems, communications and control theory with a master’s in electrical engineering. This graduate degree is ideal for engineers ready to move forward in their careers or research. Learn more Dive deeper into the world of algorithms, software systems and advanced computing with our graduate programs in computer science. Just looking to complement your studies? Learn More Tackle complex challenges and contribute to cutting-edge discoveries through doctoral research in electrical engineering. This program is designed for students pursuing careers in academia, industry or high-level R&D. Learn more Protect data, defend systems and join the growing field of cybersecurity. This certificate equips students with practical skills in digital security and risk assessment. Learn more Earn both your bachelor’s and master’s degrees in less time through our Quickstart program, designed for motivated students looking to fast-track their careers in electrical or computer engineering. Learn more Earn both your bachelor’s and master’s degrees in less time through our Quickstart program, designed for motivated students looking to fast-track their careers in  computer science. Learn More B.S. in Computer Engineering Select a Program B.S. in Computer Engineering B.S. in Computer Science B.S. in Electrical Engineering Electrical Engineering F.M. Long Memorial Bioengineering Option M.S. in Computer Science M.S. in Electrical Engineering Ph.D. in Computer Science Ph.D. in Electrical Engineering Cybersecurity Certificate B.S./M.S. Quickstart in Electrical and Computer Engineering B.S./M.S. Quickstart in Computer Science Department of Electrical Engineering and Computer Science Resources Undergraduate Learn more about what it take to become an undergraduate student in the Department of Electrical Engineering and Computer Science and what resources are available to you! Undergrad Information Graduate Interested in a higher degree in computer science or electrical engineering? View your options and see if grad school is the right choice for you. Grad Information Research In our department, we pride ourselves in our research in modern power grid date analysis and modeling, AI/ML and HPC, visual and interactive computer and cybersecurity. Research Topics Alumni Are you an alumni of the Department of Electrical Engineering and Compute Science? Get connected with other alumni, view alumni resources and see alumni news! Learn More EECS Colloquia Interested in electrical and computer engineering or want to dive deeper into computer science? Take a look at the EECS Colloquium Series and attend an event! EECS Colloquium Series Careers in EECS EECS faculty train the next generation of engineers, researchers, and scientists. Their blend of funded research and industry experience bridges the gap between theory and practice, preparing students with essential skills for top employers. Learn More Faculty and Staff Home to top professors, scholars and researchers in the electrical engineering and computer science field, the people in the Department of Electrical Engineering and Computer Science provide an exceptional education to everyone that walks through their doors. From robotics to lasers and databases to cybersecurity, our department dives deep into their research topics and hones in on their craft to give you the most up-to-date education in the ever-evolving technological world. Our People ABET Accredited The College of Engineering and Physical Sciences is accredited by the Engineering Accreditation Commission of ABET. Since the Department of Electrical Engineering and Computer Science falls under that umbrella, you know you're getting a top-tier education in our department! Learn More Read more about the Department's Student Learning Outcomes and Program Educational Objectives. Click Here! Department of Electrical Engineering and Computer Science News Walker Named Head of UW Department of Electrical Engineering and Computer Science September 9, 2024 After a competitive search, the University of Wyoming College of Engineering and Physical Sciences has selected Ian Walker to... Read the Story Average Entry Level Salaries $73000 average entry level salary for electrical engineers $77000 average entry level salary for computer engineers $78000 average entry level salary for computer scientists Apply Now If you're interested in applying to the University of Wyoming and beginning your journey with the Department of Electrical Engineering and Computer Science, you can apply today! Visit Us Come visit our beautiful campus and check out our state-of-the-art engineering and computing facilities! Contact Us Contact us with any questions! We're happy to talk to you. College Home The College of Engineering and Physical Sciences is home to many amazing departments, people, experiential learning opportunities and more. Check it out! ",
  "content_length": 10698,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:03"
}