{
  "name": "An-I Andy Wang",
  "homepage": "http://www.cs.fsu.edu/~awang",
  "status": "success",
  "content": "Andy Wang Andy Wang 269 Love Building Department of Computer Science Florida State University Tallahassee, FL 32306-4530 Email: Tel: Linkedin: aawang at fsu dot edu (850) 645-1562 http://www.linkedin.com/in/aniandywang [Biographical Sketch] [CV] [Research] [Publications] [Teaching] [SFS] [Co-pilot's story about me] Biographical Sketch (Gemini's version) Andy Wang received his Ph.D. and M.S. in computer science from UCLA in 2003 and 1998, respectively, and his B.S. from UC Berkeley in 1995. He joined the Department of Computer Science at Florida State University in 2003. He received the National Science Foundation's Faculty Early Career Development Award in 2009, the Excellence in Teaching Award by the Alpha of Florida Chapter of Phi Beta Kappa in 2019, and the Mainline Information Systems Endowed Professorship in 2024. His research interests include file systems, storage systems, optimistic peer replication, performance evaluation, ad hoc network routing, operating systems, and distributed systems. Research Andy Wang's research theme revolves around the management of data flows. Silhouette maps low-level persistent memory stores to high-level invariants used by consistency mechanisms to significantly reduce the exploration space to find crash consistency bugs. The Composite-File File System (CFFS) decouples logical and physical metadata and file representations to reduce the number of round trips for data flows. The Cashtags data-interception framework provides a way to compute in public using sensitive data items without displaying them on the screen of mobile computing devices. TrueErase involves tracking and propagating information, so that traces of a file can be securely deleted throughout the legacy storage data path. His work in real-time storage domain involves throttling the data flow to meet timing constraints. Power-Aware RAID (PARAID) redirects requests to data replicated at unused portions of disks, thereby creating opportunities to power down disks and save energy. Permuted states offer a compact representation of distributed states and thus can be applied to analyze optimistic replication systems with an exponential number of ways to propagate data updates. Electric-field-based routing allows mobile computers to form disjointed communication paths without explicit coordination and global knowledge. Conquest, a disk-persistent-RAM file system, uses specialized data paths to memory and disk storage to achieve drastic performance improvements. Selected Publications (full list by date, by topic) Jiao25 Bing Jiao, Ashvin Goel, and An-I Andy Wang. Silhouette: Leveraging Consistency Mechanisms to Detect Bugs in Persistent Memory-Based File Systems. Proceedings of the 23rd USENIX Conference on File and Storage Technologies (FAST), 2025. Liu23 Wenqing Liu and An-I Andy Wang. LFuzz: Exploiting Locality-enabled Techniques for File-system Fuzzing. Proceedings of the 28th European Symposium on Research in Computer Security (ESORICS), 2023. Supersedes Technical Report TR-220922, Department of Computer Science, Florida State University, 2022. Zhang20 Shuanglong Zhang, Robert Roy, Leah Rumancik, and An-I Andy Wang. The Composite-file File System: Decoupling One-to-one Mapping of Files and Metadata for Better Performance. ACM Transactions on Storage (TOS), 16(1), Article No. 5, 2020. [20% acceptance rate for the original USENIX FAST paper] Diesburg16 Sarah Diesburg, Christopher Meyers, Mark Stanovich, An-I Andy Wang, and Geoff Kuenning. TrueErase: Leveraging an Auxiliary Data Path for Per-file Secure Deletion, ACM Transactions on Storage (TOS), 12(4), Article No 18. 2016. [19% acceptance rate for the original ACM ACSAC paper] Mitchell15b Michael Mitchell, An-I Andy Wang, and Peter Reiher. Cashtags: Protecting Input and Displays of Sensitive Data, Proceedings of the 24th USENIX Security Symposium, August 2015. [16% acceptance rate] Supersedes Technical Report TR-141209, Department of Computer Science, Florida State University, December 2014. Diesburg10 Sarah Diesburg and An-I Andy Wang. A Survey of Confidential Data Storage and Deletion Methods. ACM Computing Surveys (CSUR), 43(1), 2010. Supersedes Technical Report TR-080508, Department of Computer Science, Florida State University, May 2008. Qian08 Jin Qian, Christopher Meyers, and An-I Andy Wang. A Linux Implementation Validation of Track-Aligned Extents and Track-aligned RAIDs. Proceedings of the 2008 USENIX Annual Technical Conference (ATC), June 2008. [15% acceptance rate] Weddle07b Charles Weddle, Mathew Oldham, Jin Qian, An-I Andy Wang, Peter Reiher, Geoff Kuenning. PARAID: A Gear-shifting Power-Aware RAID. ACM Transactions on Storage (TOS), 3(3), Article No. 13, October 2007 [invited, top 7% from the USENIX FAST conference] Wang06 An-I Andy Wang, Geoff Kuenning, Peter Reiher, and Gerald Popek. The Conquest File System: Better Performance Through a Disk/Persistent-RAM Hybrid Design. ACM Transactions on Storage (TOS), 2(3), pp. 309-348, August 2006. [24% acceptance rate for the original USENIX ATC conference paper] Wang05a An-I Andy Wang, Geoff H. Kuenning, Peter Reiher. Introducing Permuted States for Analyzing Conflict Rates in Optimistic Replication, ACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), June 2005.[20% acceptance rate] Teaching FSU COP 4610 / CGS 5765 (operating systems) S24, S25, F25 COP 5611 (advanced operating systems) S23, S24, S26 CIS 5105 (computer systems performance analysis) Su16, Su19, S21 COP 3330 / CGS 5409 (object-oriented programming in C++) F16, F17 COP 5641 / CIS 4930 (kernel and device driver programming) Su07, Su08, Su10 CIS 6935 (energy-aware storage systems) S07, S12 CIS 6935 (LENS seminar series) S05 CIS 6935 (operating systems reading group) S04 COP 4530 / CGS 5425 (data structures, algorithms, and generic programming) F03 Links My collection of fun links Random art gallery A Message from Gerald Popek My previous life awang@cs.fsu.edu",
  "content_length": 5976,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:05"
}