{
  "name": "Ana Paiva 0001",
  "homepage": "https://ana-paiva.com",
  "status": "success",
  "content": "Ana Paiva – Full Professor at Instituto Superior Técnico and group leader at INESC-ID Skip to content I’m a Full Professor in the Department of Computer Science and Engineering, IST (“Instituto Superior Técnico”) from the University of Lisbon and coordinator of GAIPS – “Intelligent and Social Agents Group” at INESC-ID, now named “Research Group on AI for  People and the Society”. I’m also the Katherine Hampson Bessell Fellow at the Radcliffe Institute for Advanced Study, Harvard University. I investigate the creation of AI and complex systems using an agent-based approach, with a special focus on social agents. My main research interests are in the fields of Autonomous Agents and Multi-Agent Systems, Affective Computing, Virtual Agents and Human-Robot Interaction. The world is changing! Intelligent and autonomous machines are entering not only our workplace but also our homes. And as such, machines must be social. I believe that one of the challenges that the areas of Artificial Intelligence (AI) and Robotics face nowadays is how to make machines “social”, that is, how to endow agents and robots with  social interaction capabilities enabling them to interact with humans and with other agents in a natural, flexible and transparent way. My main research focuses on the problems and techniques for creating social agents that can simulate human-like behaviours, be transparent, natural and eventually, give the illusion of life. Over the years I’ve dealt with this problem by engineering agents that exhibit specific social capabilities, including aspects such as emotions, personality, culture, non-verbal behaviour, empathy, collaboration, and others.  My main contributions to the area of social agents have been in the field of virtual agents, multi-agent systems, affective computing and social robotics. Most of my publications on these topics can be found in the GAIPS web site, or through my google scholar. Studying social interactions “for” and “with” machines is a challenge that I believe will allow us to engineer engaging, natural, and, most importantly, “humane” AI. That is my journey… Most of the research I’ve developed over the years has focused on the affective and social aspects of agents and how they contribute to achieving social intelligent machines.  I believe that to achieve intelligent machines we need to build mechanisms and develop techniques that endow machines of “social competencies”. That has been my vision over the years, and my research was conducted through collaborative work with many partners all over the world, and through the participation in several national and international projects in the areas of social robotics, virtual agents, affective computing and serious games.  Some of these international projects  (eg. the LIREC, ECUTE, HUMAINE, EMOTE, AMIGOS projects) have influenced me deeply and shaped what I believe the area of Social Artificial Intelligence should be. Further, I’ve been very lucky to be among the few set of academics that were at the forefront of innovative areas such as Intelligent Intelligent Virtual Agents and Affective Computing, having witnessed their birth, and how they are nowadays changing what we believe AI and computing is. Above all, I’m interested in “Social Artificial Intelligence”. So, the areas that I’ve been working over the years are: Social Robotics Affective Computing Social Simulation Virtual Agents and Serious Games At the moment I am involved in one EU funded network (the ANIMATAS ITN network) and one Portuguese Science Foundation project (the AMIGOS and the AGENTS project). My CV can be found in here. Pro-social computing is one if my current challenges! I’m working towards a future where autonomous agents are used to foster and support pro-social behaviour in a hybrid society of humans and machines. Pro-social behaviour occurs when people and agents perform costly actions that benefit others. Acts such as helping others voluntarily, donating to charity, providing information or sharing resources, are all forms of pro-social behaviour. Two main questions guide this research which challenges the purely utilitarian view of human decision making and its role in hybrid societies: What are the conditions and mechanisms that lead societies of agents and humans to be more pro-social? How can we engineer autonomous entities (agents and robots) that lead to more altruistic and cooperative behaviours in a hybrid society? These are some of the questions that I’ve been trying to address in my research in the area of social agents. See more in the AAAI’18 paper. This paper won a Blue Sky ideas paper award at AAAI’18 (see more about this award). 2020 In September 2020 I’ve started my fellowship program at the Radcliffe Institute for Advanced Study, Harvard University. I participated in the festival Cogito (see https://www.cm-oeiras.pt/pt/agenda/Paginas/cogito_18.aspx) in Oeiras, where I spoke about emotions in robots. I gave a keynote talk at the IEEE RO-MAN’2020 conference on the topic “Prosocial Robotics”. I was awarded a fellowship at Radcliffe Institute for Advanced Study, Harvard University. 2019 I was elected a EurAI fellow by EurAI Fellows committee. I participated and gave a short presentation on the 5th of June in the event organised by Culturgest in Lisbon, speculating about the future and the role of AI. More information about this event can be found in here. Fernando P. Santos, whose dissertation was titled “Dynamics of Reputations and the Self-organization of Cooperation” and was supervised by Prof. Francisco C. Santos, Prof. Jorge M. Pacheco, and myself was awarded the Victor Lesser Distinguished Dissertation Award, in Montreal, May, 2019. I gave a keynote talk at the Vodafone Business Conference in Porto on “Social Artificial Intelligence”. I gave an invited talk at Portuguese Academy of Sciences, with the title “Artificial Intelligence: from the real to the artificial”, March, 2019. I gave an invited talk at the XXIX Annual Meeting of the Portuguese Society of Psychoanalysis, with the title “Real and artificial emotions: the role of artificial intelligence in the future of the relationship between humans and machines”, March, Lisbon Portugal. I gave a keynote talk at the Workshop on “Expressivity for Sustained HRI” in the HRI’19 Conference, with title” Emotions in Groups of Humans and Robots”, March, Daegu, Korea, 2019. I gave a keynote talk at the Workshop on Robots for Social Good at the HRI’19 Conference, with title “Prosocial Robots: a vision”, March, Daegu, Korea, 2019. I gave an invited talk at the Intelligent and Socially Interactive Ecosystem Symposium, with title “Modelling Sociality in Machines”, Honda Research Institute, March, Japan, 2019. I gave a keynote talk at the Workshop on Robotics for education, with the title “Robots for Education: Challenging the role of robotics in Educational Settings”, Utrecht, Netherlands in February, 2019. I gave a keynote talk entitled “Robots that Listen to People’s Hearts: The Role of Emotions in the Communication between Humans and Social Robots” in the workshop “Explainable Artificial Intelligence and Conversational Agents”,  in Delft, Netherlands, January, 2019. I gave an interview in Antena 2 radio about AI and the Illusion of Life. You can hear it if you speak Portuguese (see https://www.rtp.pt/play/p783/e382749/antena2-ciencia) 2018 I gave an invited talk at the Vodafone Data-Science event in Lisbon with the title “Social Agents… a path towards Social Artificial Intelligence”, in December 2018. Our team got two papers accepted for HRI’19 in South Korea. The papers are entitled: “Exploring Prosociality in Human-Robot Teams” and “The Stereotype Content Model Applied to Human-Robot Interactions in Groups”. We are so happy! South Korea here we go! I gave a keynote talk at the  AIIDE 2018  conference (AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment ) at the University of Alberta in Canada, on November the 16th, with a title “When your gaming teammate is a social robot!”. Our paper entitled “Evolution of collective fairness in hybrid populations of humans and agents” was accepted for AAAI’19. Yay! I gave a keynote talk entitled “Multi-party interaction between groups of humans and robots: building teammates for a multi-cultural and ageing population” in the Shonan Seminar (Japan)  on “Multimodal Agents for Ageing and Multicultural Societies”. The page of the FAtiMA-toolkit: The Emotion Engine for your AI Characters  is now online. This toolkit  is a result of years of research and development work aimed at creating tools  to help building emotional AI characters (both virtual and robotic). This toolkit was developed by a fantastic team at GAIPS. I participated in the NSF-sponsored workshop on human-robot interaction and embodied conversational agents in Boulder Colorado, October, 2018. We had deep and interesting discussions and I feel that the two fields will gain enormously by this collaboration. Our paper entitled “The Power of a Hand-shake in Human-Robot Interactions” was accepted for the IROS conference in Madrid this Fall. This work was a collaboration with the Robotics Institute (ISR) in particular the Vislab. The paper was a result of the work of students in the Social Robotics Course at IST and we are really happy with the work, specially because it is related with our “Pro-social Computing” vision. I gave a keynote talk at the AAMAS’18 conference (Autonomous Agents and Multi-agent Conference) in Sweden, this July, with a title “Ready Team Player One: Social Robots in Teams”. I gave a keynote talk at the next UMAP’18 conference (User Modeling Adaptation and Personalisation) in Singapore, this July, with a title “Robots that listen to people’s hearts: the role of emotions in the communication between humans and social robots”. Our paper entitled “What My Eyes Can’t See, A Robot Can Show Me: Exploring the Collaboration Between Blind People and Robots” was accepte",
  "content_length": 12224,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:12"
}