{
  "name": "Ana Paula Cláudio",
  "homepage": "https://ciencias.ulisboa.pt/perfil/apclaudio",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo ANA PAULA CLÁUDIO Contactos Sala/Gabinete 6.4.53 Ext. Principal 26453 Telefone Direto 217500523 Email apclaudio@ciencias.ulisboa.pt Página Pessoal Indicadores Orcid Google Scholar Palavras Chave Computação GráficaJogos SériosModelação 3DRealidade Virtual e AumentadaHerança Digital Keywords Computer GraphicsSerious Games3D ModelingVirtual and Augmented RealityDigital Heritage Currículo Resumido Ana Paula Cláudio é professora auxiliar no Departamento de Informática da Faculdade de Ciências da Universidade de Lisboa ( FCUL ) e investigadora do LASIGE. É licenciada em Matemática (ramo de Estatística, Investigação Operacional e Computação) pela FCUL e doutorada em Informática pela mesma Universidade. Os seus interesses principais de investigação são: Computação Gráfica em geral, modelação 3D, Realidade Virtual e Aumentada , Herança Cultural Digital. Na sua actividade de ensino é responsável por disciplinas (graduação e pós-graduação) que cobrem estes assuntos.Ana Paula Cláudio is an assistant professor at the Informatics Department of the Faculty of Sciences of the University of Lisbon (FCUL), and a researcher in LASIGE. She holds a Mathematics degree from FCUL and a PhD in Informatics from the same University. Her main research interests are on Computer Graphics in general, 3D modeling, Virtual and Augmented Reality, Digital Heritage, and she teaches undergraduate and graduate courses covering these topics. Interesses Científicos Computação Gráfica em geral, Jogos Sérios, Modelação 3D, Realidade Virtual e Aumentada, Herança Cultural Digital Scientific Interests Main research interests: Computer Graphics in general, Serious Games, 3D modeling, Virtual and Augmented Reality, Digital Heritage. Publicações selecionadas Meireles, C., Carmo, M. B., Cláudio, A. P., Ferreira, A., Afonso, A. P., Redweik, P., ... & Soares, D. (2023). Mobile Augmented Reality for Analysis of Solar Radiation on Facades. In VISIGRAPP (1: GRAPP) (pp. 131-142) Štiglic, G., Braam, K., Carmo, M. B., Correia, L., Gosak, L., Lorber, M., ... & Cláudio, A. P. (2023). Supplementary Online Resources for the Development of Behaviour Change Support Competencies. In: Guerreiro, M.P., Brito Félix, I., Moreira Marques, M. (eds) A Practical Guide on Behaviour Change Support for Self-Managing Chronic Disease (pp. 113-119). Springer, Cham. Guerreiro, M. P., Balsa, J., Carmo, M. B., Cláudio, A. P., & Félix, I. B. (2023). Usability Evaluation by Primary Care Providers of a Novel Digital Intervention for Type 2 Diabetes Self-Management in Older Adults. CIN: Computers, Informatics, Nursing, 41(4), 185-191. Bastos, M. I., Cláudio, A. P., Félix, I. B., Guerreiro, M. P., Carmo, M. B., & Balsa, J. (2022). Operationalizing Behavior Change Techniques in Conversational Agents. In ICAART (1) (pp. 216-224) Cláudio, A. P., Carmo, M. B., De Carvalho, A. A., Xavier, W., & Antunes, R. F. (2017). Recreating a medieval urban scene with virtual intelligent characters: steps to create the complete scenario. Virtual Archaeology Review, 8(17), 31-41 Ver todas as Publicações",
  "content_length": 3215,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:15"
}