{
  "name": "Ana Guerberof Arenas",
  "homepage": "https://research.rug.nl/en/persons/ana-guerberof-arenas",
  "status": "success",
  "content": "Ana Guerberof Arenas - the University of Groningen research portal View Scopus Profile Ana Guerberof Arenas Prof. Faculty of Arts, Computational Linguistics (CL) https://orcid.org/0000-0001-9820-7074 Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Fingerprint Dive into the research topics where Ana Guerberof Arenas is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 4 Similar Profiles Automatic Translation Arts and Humanities 100% Literary text Arts and Humanities 35% Engagement Arts and Humanities 32% Machine Translation Keyphrases 29% Translation memory Arts and Humanities 27% Enjoyment Arts and Humanities 24% Translator Keyphrases 24% Dutch Keyphrases 23% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 15 Article 10 Chapter 10 Conference contribution 3 Preprint 8 More 2 Paper 1 Book 1 Foreword/postscript 1 Other 1 Book/Film/Article review 1 Review article 1 Thesis fully external Research output per year Research output per year Creativity and technology in translationGuerberof-Arenas, A., 8-Oct-2025, The Routledge Handbook of Translation Technology and Society. Baumgarten, S. & Tieber, M. (eds.). Taylor and Francis Ltd, p. 368-380 13 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter › Academic › peer-review Creativity 100% Machine-generated Content 100% Translation (Applied Linguistics) 10% Social Science 10% \"Google Translate is our best friend here\": A vignette-based interview study on machine translation use for health communicationValdez, S. & Guerberof-Arenas, A., 4-Apr-2025, (E-pub ahead of print) In: Translation Spaces (The Netherlands).Research output: Contribution to journal › Article › Academic › peer-review Open AccessFile Health Communication 100% Automatic Translation 100% Vignette 100% Direct Communication 100% Mediation Strategies 66% 5 Citations (Scopus) 38 Downloads (Pure) Optimising ChatGPT for creativity in literary translation: A case study from English into Dutch, Chinese, Catalan and SpanishDu, S., Guerberof, A., Toral, A., Gerrits, K. & Marco Borillo, J., Jun-2025, Proceedings of Machine Translation Summit XX. Bouillon, P., Gerlach, J., Girletti, S., Volkart, L., Rubino, R., Sennrich, R., Farinha, A. C., Gaido, M., Daems, J., Kenny, D., Moinz, H. & Szoc, S. (eds.). Geneva, Switzerland: European Association for Machine Translation, Vol. 1. p. 578-591 14 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Academic › peer-review Open AccessFile Dutch 100% Catalan 100% Chat Generative Pre-trained Transformer (ChatGPT) 100% Literary Translation 100% Creativity 100% 13 Downloads (Pure) Perspectives on Machine Translation, Post-Editing, and AutomationGuerberof-Arenas, A., 31-Jul-2025, The Routledge Handbook of the Translation Industry. Walker, C. & Lambert, J. (eds.). London: Routledge, p. 186-204 19 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter › Academic › peer-review Open AccessFile Post-automation 100% Translating (Language) 100% Artificial Intelligence 100% Industry Report 50% Translator's Role 50% 33 Downloads (Pure) Proceedings of the Second Workshop on Creative-text Translation and Technology (CTT)Vanroy, B. (Editor), Lefer, M.-A. (Editor), Macken, L. (Editor), Ruffo, P. (Editor), Guerberof-Arenas, A. (Editor) & Hansen, D. (Editor), Jun-2025, Association for Computational Linguistics (ACL).Research output: Book/Report › Book › Academic › peer-review Open Access View all 46 research outputs Datasets DivEMT: Neural Machine Translation Post-Editing Effort Across Typologically Diverse LanguagesSarti, G. (Owner), Bisazza, A. (Owner), Guerberof Arenas, A. (Owner) & Toral Ruiz, A. (Owner), University of Groningen, May-2022https://github.com/gsarti/divemt and one more link, https://huggingface.co/datasets/GroNLP/divemt (show fewer)Dataset CREAMTTRAININGGuerberof Arenas, A. (Creator), GitHub, 20-Jun-2023https://github.com/AnaGuerberof/CREAMTTRAINING/Dataset CREAMTGuerberof Arenas, A. (Creator) & Toral Ruiz, A. (Supervisor), GitHub, 5-Jul-2021https://github.com/AnaGuerberof/CREAMTDataset CREAMTAVTGuerberof Arenas, A. (Creator), Moorkens, J. (Owner) & Orrego, D. (Owner), GitHub, 31-May-2023https://github.com/AnaGuerberof/CREAMTAVTDataset Press/Media Serve ancora imparare le lingue straniere?Toral Ruiz, A. & Guerberof Arenas, A.09/08/20241 item of Media coveragePress/Media: Expert Comment › Popular Podcast: The Visible Art of TranslationGerrits, K., Shaboltas, N., Wang, X., Guerberof Arenas, A. & Rouweler, L.29/07/20241 Media contributionPress/Media: Public Engagement Activities › Academic The Last Frontier of Machine TranslationGuerberof Arenas, A.07/01/2024 → 08/01/20242 items of Media coveragePress/Media: Expert Comment › Popular Die letzte Grenze der maschinellen ÜbersetzungGuerberof Arenas, A.08/01/20241 item of Media coveragePress/Media: Expert Comment › Popular The Last Frontier of Machine TranslationToral Ruiz, A. & Guerberof Arenas, A.08/01/20241 item of Media coveragePress/Media: Expert Comment › Popular View all 12 press/media",
  "content_length": 5678,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:09"
}