{
  "name": "Ana T. Freitas",
  "homepage": "http://web.tecnico.ulisboa.pt/ana.freitas",
  "status": "success",
  "content": "Ana Teresa Freitas Home page Welcome to Ana Teresa Freitas's Home Page Portuguese Version I'm an Associate Professor (with Habilitation) with the Technical University of Lisbon,(IST), Dept. of Computer Science and Engineering. I got my B.S. and Ms.C. degree in Electrical and Computer Engineering in 1990 and 1994, respectively, from the Technical University of Lisbon. I got my Ph.D. in the area of Computer Aided Design for Microelectronics in 2002, from the Technical University of Lisbon. I'm also a senior researcher at the Instituto de Engenharia de Sistemas e Computadores (INESC-ID) in the Knowledge Discovery and Bioinformatics group (KDBIO). Teaching (2008/09): Sabatical leave - BAOBAB Team/Inria Rhône-Alpes UMR 5558 Biométrie et Biologie Évolutive, Université Claude Bernard, Lyon I, France Main Research Interests: Computational Biology and Bioinformatics Algorithms and Complexity Data Mining Projects (past and present): Research Projects. Papers: Papers, Publications, etc. Papers Supplementary Material. Diverse Items: My curriculum Master these abstract (Portuguese) PHD abstract Links: HEARTGENETICS, GENETICS and BIOTECHNOLOGY , HEARTGENETICS is a SPIN OFF from IST. HEARTGENETICS mission is to pioneer cardiovascular genetic testing. YEASTRACT Database , a repository of regulatory associations for Saccharomyces cerevisiae RECOMB 2010 , the 14th Annual International Conference on Research in Computational Molecular Biology, will be held in Lisbon, April 2010. INESC-ID - Instituto de Engenharia de Sistemas e Computadores R. Alves Redol, 9       Apartado 13069              Phone : +351.1.3100394       1000 Lisbon                 Fax   : +351.1.3145843       Portugal                    Email : atf@inesc-id.pt e-mail atf@inesc-id.pt I am Portuguese . Come to visit us ... . last change 2008/10/27",
  "content_length": 1823,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:17"
}