{
  "name": "Ana Salagean",
  "homepage": "https://www.lboro.ac.uk/departments/compsci/staff/academic-teaching/ana-salagean",
  "status": "success",
  "content": "Ana Sﾄネﾄトean | Computer Science | Loughborough University Professor Ana Salagean Professor of Cryptography Deputy Director Doctoral Programmes (Computer Science) Research groups and centres Theoretical Computer Science Publications +44 (0) 1509 228 237 Send email Office: N.3.11 (Haslegrave Building) Biography Research External activities Responsibilities PhD Students Ana Sﾄネﾄトean graduated from University of Bucharest, Romania and obtained her PhD from the Research Institute for Symbolic Computation, J. Kepler University Linz, Austria, advisor Prof. Bruno Buchberger. She held positions at the University of Bucharest and Nottingham Trent University before joining Loughborough University in 2001. Her research interests have always combined algebra and computer science. She started work in computer algebra (Groebner bases), then moved to algebraic coding theory (especially cyclic codes over finite rings) and is currently working in symmetric cryptography. Research areas Symmetric Cryptography: Boolean functions, functions over finite fields, sequences, feedback shift registers Finite fields Error-correcting codes: cyclic codes, codes over rings Programme committee member of the IMA International Conference on Cryptography and Coding (most editions since 2007), Indocrypt (2024), Boolean Functions and Applications (2025) External examiner for Royal Holloway University of London, Department of Mathematics, BSc and MSc degrees (2007-2011) Reviewer for EPSRC grants; Reviewer for Mathematical Reviews Reviewer for several journals: IEEE Transaction on Information Theory, Designs, Codes and Cryptography, Cryptography and Communications, Finite Fields and Their Applications, Discrete Mathematics, Journal of Algebra and its Applications, as well as many conferences. Deputy Director of Doctoral Programmes Member of the Theoretical Computer Science (TCS) research theme Previous PhD students and year of graduation: Connor O'Reilly (2025, MPhil) Dr Percy Reyes-Paredes (2023) Dr Eqbal Darraji (2021) Dr Qamar Al-Natsheh (2019) Dr Dave Gardner (2016) Dr Alex Burrage (2013) Dr Amna Saad (2013) Dr Alexandra Alecu (2009) Dr John Whitley (2008) Dr Xuan Liu (2008) Dr Hongmei He (2006) Dr Nasser Al-Ismaily (2005)",
  "content_length": 2226,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:13"
}