{
  "name": "Ananth Kalyanaraman",
  "homepage": "http://www.eecs.wsu.edu/~ananth",
  "status": "success",
  "content": "Ananth Kalyanaraman @ WSU About Research Publications People Software Teaching Prospective Students Contact Ananth Kalyanaraman Professor and Director Boeing Centennial Chair in Computer Science School of Electrical Engineering and Computer Science Pullman, WA 99164 (509) 335-6760 Email: a_n_a_n_t_h@w_s_u.e_d_u   // remove '_' before use Brief biography: Ananth Kalyanaraman is a Professor and Boeing Centennial Chair, and the Director of the School of Electrical Engineering and Computer Science, Washington State University in Pullman. He is the lead PI and the Director of the NSF-USDA NIFA AgAID AI Institute for Transforming Workforce and Decision Support in agriculture. He holds a joint appointment at Pacific Northwest National Laboratory (PNNL), and affiliate faculty positions at the Molecular Plant Sciences Graduate Program and the Paul G. Allen School for Global Health.  Ananth received his bachelors from Visvesvaraya National Institute of Technology in Nagpur, India (B.E. in Computer Science and Engineering, 1998); and subsequently M.S. (Computer Science, 2002) and Ph.D. (Computer Engineering, 2006) from Iowa State University. Ananth works at the intersections of parallel computing, graph analytics, and bioinformatics/computational biology, and at the intersections of data science and AI/machine learning for real-world applications. His focus is on developing algorithms and software for scalable analysis of large-scale data from various scientific domains and particularly agriculture, plant and life sciences. Research in his lab has been supported by various funding sources including the National Science Foundation (NSF), U.S. Department of Energy (DOE), U.S. Department of Agriculture (USDA), and the Center for Disease Control and Prevention (CDC). Ananth is a recipient of U.S. Department of Energy Early Career Research Award, and his student-led research works have received multiple conference best paper awards and a prestigious graph challenge award. Ananth serves/has served on the editorial boards of several reputed journals (including TPDS, TCBB, JPDC, ParCo). Ananth also regularly serves in various conference and workshop leadership in the areas of parallel processing and bioinformatics. Ananth currently serves as the Editor-in-Chief for the Journal of Parallel and Distributed Computing (JPDC), and he is also a Vice-Chair for the IEEE Technical Committee on Parallel Programming (TCPP), and for the ACM SIGBIO.   Ananth is a senior member of IEEE, and a member of ACM and SIAM. Additional details: You can download my comprehensive CV here. You can follow me on my linkedin profile page. I am always looking for highly motivated graduate students to join my group. If you are a prospective graduate student, please visit the Prospective Students page.",
  "content_length": 2802,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:22"
}