{
  "name": "Anand Mishra 0001",
  "homepage": "https://anandmishra22.github.io",
  "status": "success",
  "content": "Anand Mishra Anand Mishra, PhD CSE-210, Department of Computer Science and Engineering Indian Institute of Technology Jodhpur Jodhpur - 342030 (RJ), India Currently, I serve as an Assistant Professor at the Department of Computer Science and Engineering at the Indian Institute of Technology Jodhpur. Prior to this role, I had the opportunity to work as a Postdoctoral Researcher under the mentorship of Dr. Partha Pratim Talukdar at the Indian Institute of Science, focusing on Knowledge-aware Computer Vision for nearly two years. For my doctoral studies, I conducted research on the interpretation of text within scene images at IIIT Hyderabad, where I had the privilege of being supervised by Prof. C. V. Jawahar and Dr. Karteek Alahari. My current research interest lies in the intersection of vision and language. Specifically, I am deeply engaged in exploring the field of developing AI Agents that can understand human language and perceive and comprehend the visual world. The overarching goal of my research group at IIT Jodhpur, known as Vision, Language, and Learning Group or VL2G in short, is to advance the development of these intelligent agents towards bridging the gap between human and machine interaction. To know more about the recent research focus and activities of VL2G, please visit the group's website. Email | CV | Google Scholar | DBLP | Selected Publications | Teaching | VL2G Recent/upcoming professional activities: Area Chair: CVPR'26. Program Co-Chair: ICVGIP'25. Reviewer and/or PC member for: CVPR'20/22/23/24/25, ECCV'20/22/24, ICCV'19/21/23, ACL Rolling Review, ICLR'23, WACV'23, AAAI'20/21/22, IJCAI'19/20, ICDAR'19, IEEE TPAMI, IJCV, IEEE TKDD, CVIU, IJDAR, Pattern Recognition. Co-organizer: ScalDoc 2023, NCVPRIPG'23, WDAR 2021/WDAR 2023, KBMM 2019/KBMM 2020. Workshop Co-Chair: ICFHR'22. News/Activities [November 2025] Our debut work on healthcare AI -- PatientVLM meets DocVLM and a work on Few-shot Video Object Detection are accepted at AAAI 2026 Main Track. [November 2025] Our works MATR (ICCV 2025) and MPA (EMNLP 2025) are selected for showcase at Vision India Session. [August 2025] Our work Model Parity Alignment towards empowering small VLMs is accepted in EMNLP 2025 (Main Track). [July 2025] Our work on Moment Alignment Transformer (MATR) is accepted in ICCV 2025. [July 2025] Speaking at CVIT Summer School at IIIT Hyderabad. [April 2025] Received Google's Gemma Academic Program Award to support our research with cloud resources. [March 2025] I am a program co-chair for ICVGIP 2025. [December 2024] Our work PatentLMM is accepted at AAAI 2025. [December 2024] My upcoming course, CSL2050: Pattern Recognition and Machine Learning, is supported by Google Cloud Teaching Credits. [October 2024] Shreya and Nakul from VL2G received (in absentia) the Director's Prize for graduating student with Best Academic Innovation Work among students of all B. Tech. Programs of the class of 2024 at IITJ convocation. See the announcement. View Institute Social Media Post. [September 2024] Our latest work on scene text-to-scene text translation is now available on our project website. We have also made the code and data publicly available for those interested in exploring or building upon this work. [September 2024] Large Multimodal Model-Extension to our work Text-KVQA (Singh et al., ICCV 2019) is accepted at Main Track of EMNLP 2024. [July 2024] Speaking at ACM-India ROCS 2024. [April 2024] Work on sketch-guided image inpainting by undergrad student Nakul Sharma is accepted at CVPR 2024 Workshop. [December 2023] Our works - QDETRv (query-guided DETR for Video) and CSTBIR (composite sketch+text-based image retrieval) are accepted at AAAI 2024. [October 2023] Two of our works, one in the domain of AI for Education and one in query-guided attention in vision transformers, are accepted at WACV'24. [October 2023] Speaking at Distinguished Researcher Speaker Series (DRSS), Accenture Labs (Virtually) on our video works. [September 2023] Speaking at NISER, Bhubaneswar (virtually) on our sketch-guided visual understanding works. [July 2023] Received the Microsoft Academic Partnership Grant (MAPG) 2023 (see the announcement). [May 2023] Recognized as one of the Outstanding Reviewers at CVPR 2023. The complete list is here. [April 2023] Our work on retVQA and Floco-T5 are accepted in IJCAI 2023 (Main Track) and ICDAR 2023, respectively. [March 2023] Our work on Few-shot Referring Relationships in Videos is accepted in CVPR 2023. [January 2023] I am in the organizing team of NCVPRIPG'23. Please consider participating. [January 2023] Speaking at ACM-India ARCS'23. [October 2022] Thanks to Accenture Labs for a Gift Grant. [October 2022] Our works COFAR, VisTOT and Scene Graph Grounding are accpeted at AACL-IJCNLP 2022, EMNLP 2022 and WACV 2023, respectively. [March 2022] Speaking at Search Technology Centre India (STCI), Microsoft. [March 2022] Received IIT J-Research Initiation Seed Grant. [March 2022] Speaking at my undergraduate alma mater on Fundamentals of Neural Networks, Guru Ghasidas Central University Bilaspur. [February 2022] Speaking at ICMI Pre-Conference Workshop 2022, IIIT Bangalore (Virtual). [February 2022] Speaking at WADLA 2022, IIIT Sri City (Virtual). [January 2022] Received the SERB-Startup Research Grant. [December 2021] Two of the graduating members of my research group, Vaibhav Mishra and Mayank Maheshwari got the Director's Prize for the best academic innovation work among all the graduating students of 2021 batch at IIT Jodhpur convocation. (See the award receiving moment). [November 2021] My PhD Student Abhirama P. got selected as Prime Minister's Research Fellow. [September 2021] Speaking in a panel at DocVQA workshop under ICDAR 2021. [September 2021] Recognized as one of the outstanding reviewers at ICCV 2021. See the list. [July 2021] Our work on Few-shot Visual Relationship Co-Localisation with Revant Teotia, Vaibhav Mishra and Mayank Maheshwari got accepted in ICCV 2021. The paper and code are available now. [June 2021] Got selected for Microsoft Academic Partnership Grant (MAPG) 2021. [April 2021] A paper on TextVQG got accepted in ICDAR 2021. Paper is available here. [February 2021] Presenting a poster on 'Multimodal Machine Learning for Enhanced Image Understanding' under the 'Machine Learning and Big Data Analytics Track', at the 11th Indo German Frontier of Engineering Conference (INDOGFE 2021). [February 2021] Speaking at WADLA 2021 (Virtual event hosted by IIIT Sri City) [Slides]. [December 2020] Our ICCV 2019 paper on textKVQA is accepted for a presentation at Vision India. [August 2020] Received IIT-Jodhpur Teaching Excellence Award 2020 (see announcement). [July 2020] One paper got accepted at ECCV 2020 as spotlight (top-5% paper). This was joint work with Aditay, Rajath and Anirban. [June 2020] Speaking as an invited speaker at Deep Learning for Computer Vision Session at SPCOM 2020 going to be organized virtually at IISc Bangalore. [June 2020] Got a research grant from the Accenture labs. [April 2020] Co-organizing 2nd workshop on KBMM co-located with AKBC 2020. [December 2019] Gave a talk on our recent works on knowledge-aware Computer Vision to a small group of developers/researchers from Siemens at IISc Bangalore. [July 2019] Our paper on the \"Knowledge-enabled\" VQA model that can read got accepted in ICCV 2019 for an oral presentation. [July 2019] Joined IIT-J. [June 2019] Gave a talk on \"Reading Text in Scene Images, Bridging it to World Knowledge, and Beyond\" at Department of CSE, IIT Guwahati. [May 2019] Our OCR-VQA paper got accepted in ICDAR 2019. [April 2019] Gave a talk on \"Knowledge-aware Visual Question Answering\" at IIIT Bangalore. [April 2019]: We (with Sameer Singh and Pouya Pezeshkpour from University of California, Irvin and Partha Talukdar from IISc) are organizing a workshop: \"Knowledge Bases and Multiple Modalities (KBMM)\" at Automated Knowledge Base Construction (AKBC) 2019. Please consider submitting an extended abstract related to Knowledge Bases and Multiple Modalities work. [March 2019]: I will be serving as a program committee member for ICDAR 2019. [February 2019]: I will be serving as a reviewer for ICCV 2019. [February 2019]: Offered a lecture on Graph Representation Learning in Deep Learning for Computer Vision course at IISc Bangalore. [January 2019]: Obtained research grant from Siemens. Will be working as co-PI with Dr. Anirban and Dr. Partha on this project. [January 2019]: I will be serving as a program committee member for IJCAI 2019. [December 2018]: I am attending AAAI 2019. My travel is supported by a gift of USD 3000 by Google to the Indian Institute of Science. Thank you Google. [November 2018]: I am serving as a program committee member for Workshop on Document Analysis and Recognition (DAR) 2018. (to be held as part of ICVGIP 2018) [November 2018]: Our work on \"Knowledge-Aware Visual Question Answering\" got accepted in AAAI 2019 (acceptance rate = 16 %) [October 2018]: My solo author paper on deep heterogeneous metric learning got accepted for publication at International Journal of Multimedia Information Retrieval (IJMIR). This paper addresses the problem of matching cartoon and real faces. [September 2018]: Our paper on deep metric learning got accepted at ACCV 2018. Pre-print will be available soon! [September 2018]: I will be attending Amazon Research Day on September 28. [July 2018]: I will be co-teaching an undergraduate introductory course on Algorithms and Programming at IISc Bangalore. [Link] [August 2017]: Joined IISc Bangalore as a PostDoc. Selected Publications Journals Bridging language to visuals: towards natural language query-to-chart image retrieval, Neelu Verma, Anik De, Anand Mishra Volume: 13 (3), 32 , International Journal of Multimedia Information Retrieval, 2024. [ Link ] Multimodal Query-guided Object Localization, Aditay Tripathi, Rajath R. Dani, Anand Mishra, Anirban Chakraborty Volume: 83 (5), Pages: 14857-14881, ",
  "content_length": 18967,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:18"
}