{
  "name": "Anand Bhojan",
  "homepage": "http://www.comp.nus.edu.sg/~bhojan",
  "status": "success",
  "content": "School of Computing - National University of Singapore Dr. Anand Bhojan Publications Keynote/Invited Talks/Media Conference Committees Research Areas Teaching Education Awards and Scholarships Projects, Research & Grants Professional/Consulting Administrative Leadership Other Links MY CALANDER GAME ALALYTICS Event Management System IRC NUS e-Gaming Society Thirumandiram: \" With breath controlled and mind subdued, The nectar of truth will descend like rain.\" â The secret recipe for a research breakthrough. \"Truth is one, the wise call it by many names.\" - If we realise this, we can esily respect and accept all other religions; not just tolereate. \"Seek what you know as the highest. It does not matter whether it is going to happen or not - living with a vision itself is a very elevating process\"... \"Self-Discipline: The ability to do what you know you should do, whether you feel like it or not\". \"Character training through intelligent self-discipline makes human energy socially oriented\". (If the human energy is socially oriented, most of the problems in the world will be automatically solved!) \"If you are poor, work. If you are rich, work. If you are burdened with un-seemingly unfair responsibilities, work. If disappointments come, work. If sorrow overwhelms you and loved ones seem not true, work. If health is threatened, work. When dreams are shattered and hope seems dead, work. Work as if your life is in peril. Its really is. No matter what ails you,work. Work faithfully. Work in faith. Work is the great remedy available for both mental and physical afflictions. All,without exception, perform work. There is no way of renouncing work altogether (always there is another work!)\".  The Inspired Talks of Swami Vivekananda \"Finish the few duties (few!) you have at hand, and then you will have peace\"  The Gospel of Sri Ramakrishna Site Access Statistics   from 21-Jan-2015 CONTACT: Senior Faculty School of Computing , National University of Singapore Computing 1, 13 Computing Drive, Singapore 117417 e-mail: web: http://www.comp.nus.edu.sg/~bhojan Tel: (65) 6516-7351 Office: COM2-04-26 Vice President , International Researchers Club Director , Anuflora DeepMind Solutions Anuflora International (AFI),  288E, #12-410, Jurong East Street 21, Singapore 605288. web: http://www.anuflora.com/ RESEARCH INTERESTS: Wireless Networks (IoT & Security) Artificial Intelligence (Robotics) Entertainment Computing (Games/VR/AR) Teaching Pedagogy CURRENT PROJECTS Dynamic Hybrid Real-time Rendering with Hardware Accelerated Ray-tracing and Rasterization for Interactive Applications. 2019-2022. Supported by Ministry of Education (Singapore) AcRF Tier 1 grant. Development and evaluation of a mobile app to improve the oral health and dental experience of children with Autism Spectrum Disorder (ASD), A multi-dimensional cooperative approach. 2018-2019. Supported by SUNSTAR donation grant. Energy efficient cloud streaming for Virtual and Augmented Reality, Supported by Oculus/Facebook grant. 2018-2022 Teaching Tools & Pedagogical Research: ShowNtell - Plug-in free whiteboard with real-time collaborative editing. Teaching Tools & Pedagogical Research: QAM  Multimodal QA System for Events/Conferences/Lectures Teaching Tools & Pedagogical Research: STePS  Event/Conference/Project Showcase Management System (Workflow Management, Project Publishing and Sharing, Registration, Check-in, Voting/Feedback) Teaching Tools & Pedagogical Research: VARLAB  Virtual and Augmented Reality Labs for Science and Engineering experiments ---> PAST PROJECTS TEACHING TOOLs & PEDAGOGICAL RESEARCH ShowNtell :- Browser Based Colloborative Whiteboard. Draw, Annotate PDFs, Record and Publish using Android tablet, Laptops, etc. Plug-in free browser based tool. Recommended browsers: Chrome and Firefox. QAM:- Multimodal QA System for Events UPCOMING PRESENTATIONS Kaynote Talk: \"Mobile Computing - Future Trends.\", IEEE International Conference On Data Mining and Advanced Computing (SAPIENCE-16), Kerala, India [16-18, Mar][2016]. Slides: AWESOME GAMES DEVELOPED BY CS3247 Game Development Students ... \"Game is an emotional artifact with a quest for solving problems\" .... Dr. Anand Full list of games and links to video demo, blog, downloadable versions (For Various Platforms: Win, Mac, iPad/iPhone, Android) are available at : http://arivu.d2.comp.nus.edu.sg/game PUBLICATIONS 2015 Nidhi Sharma, Muhammad Fazli Bin Rosli, Wang Yichao, Oh Shunhao, Bhojan Anand , \" [ePOSTER] ShowNtell - Collaborative Web Whiteboard for Educators,\" Proceedings of Singapore Technology-enabled Learning Experience Conference, Nov 2015. TEL 2015 Ankit Chaudhary, Francisco Escolano, Bhojan Anand , \"Introduction to the Special issue on Future trends in robotics and autonomous techniques,\" Journal Computers and Electrical Engineering, Volume 43 Issue C, April 2015. [bib], [End Note], [txt ref]. Ankit Chaudhary, Francisco Escolano, Bhojan Anand (Eds.), \" [BOOK] Future trends in robotics and autonomous techniques,\" Journal Computers and Electrical Engineering, Volume 43 Issue C, April 2015. [bib], [End Note], [txt ref]. Bhojan Anand , Tan Guo Wei, \"mumble: Framework for Seamless Message Transfer on Smartphones,\" Proceedings of ACM Mobicom 2015 SmartObjects. [bib], [End Note], [txt ref]. Presentation Slides: [ppt SLIDES] mumble: Framework for Seamless Message Transfer on Smartphones Bhojan Anand , Kwan Yong Kang Nicholas, Nidhi Sharma \"ShowNTell: An easy-to-use tool for answering students questions with voice-over recording,\" Proceedings of IEEE and ASEE 45th Annual Frontiers in Education (FIE) Conference [bib] . Presentation Slides: [ppt SLIDES] ShowNTell: An easy-to-use tool for answering students questions with voice-over recording 2014 Bhojan Anand, Hong Wei Wong , \"ARENA- Dynamic Run-time Map Generation for Multiplayer Shooters ,\" Springer LNCS 8770, Proceedings of the IFIP-International Conference on Entertainment Computing (ICEC)- 2014. [bib], [End Note], [txt ref]. Rajsingh Elijah Blessing, Bhojan Anand, Peter, J. Dinesh (Eds.) \" [BOOK] Informatics and Communication Technologies for Societal Development (proceedings of ICICTS 2014) ,\" Springer - Signals & Communication Bhojan Anand, Aw Jia Hao Edwin , \"Gamelets - Multiplayer Mobile Games with Distributed Micro-Clouds,\" IPS/IEEE Proceedings of the 7th International Conference on Mobile Computing and Ubiquitous Networking - ICMU 2014. [bib], [End Note], [txt ref]. Bhojan Anand, Li Kecen, Akkihebbal L. Anand , \" PARVAI - HVS Aware Adaptive Display Power Management for Mobile Games,\" IPS/IEEE Proceedings of the 7th International Conference on Mobile Computing and Ubiquitous Networking - ICMU 2014. [bib], [End Note], [txt ref]. 2013 Bhojan Anand, \"Energy Efficient Multi-player Smartphone Gaming using 3D Spatial Subdivisioning and PVS Techniques,\" Proceedings of the 21th ACM International Conference on Multimedia - IMMPD 2013, Barcelona, Spain. 2012 Bhojan Anand \"Energy efficient algorithms and techniques for wireless mobile clients ,\" Scholar Bank, National University of Singapore, 2012. Bhojan Anand , Lee Kee Chong, Ee-Chien Chang, Mun Choon Chan, Akhihebbal L. Ananda and Wei Tsang Ooi, \"El-pincel: a painter cloud service for greener Web Pages,\" Proceedings of the 20th ACM international conference on Multimedia 2012, Nara, Nov Japan 2012. K Thirugnanam, Bhojan Anand, J Sebastian, PG Kannan, AL Ananda, RK Balan, and MC Chan, “Dynamic Lookahead Mechanism for Conserving Power in Multi-Player Mobile Games,” (Mini-Conf) IEEE INFOCOM 2012, Orlando, Florida, Mar 2012. Bhojan Anand, Akhihebbal L. Ananda, Mun Choon Chan and Rajesh Krishna Balan, \" ARIVU: Making Networked Mobile Games Green - A Scalable Power-Aware Middleware \", MOBILE NETWORKS AND APPLICATIONS, Springer Netherlands,(DOI: 10.1007/s11036-011-0312-8, URL:http://dx.doi.org/10.1007/s11036-011-0312-8), Feb 2012. [Features: Evaluation of techniques discussed in Netgames' 2010 paper (ARIVU) in commercial/opensource games Quake and Ryzom with improved algorithms that gaurentees scalability of the Game Servers)]. 2011 Bhojan Anand, \"BLENDED LEARNING – An Experimental Study in Undergraduate Education\", Procedings of 4th International Conference of Education, Research and Innovation (ICERI 2011), Madrid, Spain, Nov 2011. Bhojan Anand, Pravein Govindan Kannan, Akhihebbal L. Ananda, Mun Choon Chan, \" El-pincel - A Painter Cloud Service for Greener Web Pages \", Abstract Paper (Poster Presentation & Android Demonstration), Proceeedings of ACM MobiSys 2011, Washington DC, June 2011. Bhojan Anand, Karthik Thirugnanam, Jeena Sebastien, Pravein Govindan Kannan, Akhihebbal L. Ananda, Mun Choon Chan and Rajesh Krishna Balan, \"Adaptive Display Power Management for Mobile Games\", Proceeedings of ACM MobiSys 2011, Washington DC, June 2011. Bhojan Anand, Karthik Thirugnanam, Jeena Sebastien, Pravein Govindan Kannan, Akhihebbal L. Ananda, Mun Choon Chan and Rajesh Krishna Balan, \"Adaptive Display Power Management for Mobile Games\", Abstract Paper (Poster Presentation & iOS/Android Demonstration), Proceeedings of ACM MobiSys 2011, Washington DC, June 2011. 2010 Bhojan Anand, Soh Yu Ming, Akhihebbal L. Ananda, Mun Choon Chan, and Rajesh Krishna Balan, \"PGTP: Power Aware Game Transport Protocol for Multi-Player Mobile Games\", IEEE International Conference on Communications and Signal Processing (ICCSP), National Institute of Technology, Calicut, India, Feb 2011. Bhojan Anand, Karthik Thirugnanam, Le Thanh Long, Duc-Dung Pham, Akhihebbal L. Ananda, Rajesh Krishna Balan, and Mun Choon Chan, \"ARIVU: Power-Aware Middleware for Multiplayer Mobile Games\", IEEE/ACM Netgames, Teipei, Taiwan, Nov 2010. [A new & extended version of this paper is published in MONET - 2012] Bo Han, Ahmad Rahmati, Bhojan Anand, \"Report of HotMobile 2010,\" IEEE Pervasive Computing Journel, pp. 93-96, July-September, 2010 Bhojan Anand, \"Konva: Power and Network Aware Framework and Protocols for Multiplayer Mobile Games,\" (Doctoral Consortium)",
  "content_length": 30892,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:18"
}