{
  "name": "Anantaa Kotal",
  "homepage": "https://hb2504.utep.edu/Home/Profile?username=akotal",
  "status": "success",
  "content": "UTEP Faculty Profiles MinerAlert Skip to main content Search pages and people FACULTY PROFILES X Quick Links Library Parking & Maps UTEP News Events Student Affairs Business Affairs Employment Opportunities University Bookstore Technology Support Main Content UTEP Faculty Profiles UTEP Faculty Profiles Anantaa Kotal Assistant Professor Computer Science Office Building: Office Room: Phone: Email: akotal@utep.edu Bio Education Scholarly and Creative Activity Grants Courses Course Evaluations Bio < No info available. > Education < Ph D in Computer Sciences, University of Maryland, Baltimore County (2024) B.Eng. in Computer Science, Jadavpur University (2017) > Publications < Differentially Private Synthetic Data Generation Using Context-Aware GANs IEEE Big Data (2024), Anantaa Kotal, Anupam J. . Privacy-Preserving Data Sharing Using Generative Models Proquest (2024), Anantaa Kotal. Synthetic Data for Privacy Preservation in Distributed Data Analysis Systems Springer 1 (2024), Anantaa Kotal, Sai Sree Laya Chukkapalli, Anupam Joshi. KiNETGAN: Enabling Distributed Network Intrusion Detection through Knowledge-Infused Synthetic Data Generation IEEE ICDCSW (2024), Anantaa Kotal, Brandon Luton, Anupam Joshi. Opioid and Antimicrobial Prescription Patterns During Emergency Medicine Encounters Among Uninsured Patients AMIA Summits on Translational Science Proceedings (2024), Michael Grasso, Anantaa Kotal, Anupam Joshi. Privacy-Preserving Data Sharing in Agriculture: Enforcing Policy Rules for Secure and Confidential Data Synthesis IEEE Big Data (2023), Anantaa Kotal, Lavanya Elluri, Deepti Gupta, Varun Mandulupu, Anupam Joshi. Change management using generative modeling on digital twins IEEE ISI (2023), Nilanjana Das, Anantaa Kotal, Daniel Roseberry, Anupam Joshi. Knowledge-Enhanced Neurosymbolic Artificial Intelligence for Cybersecurity and Privacy IEEE Internet Computing (2023), Aritran Piplai, Anantaa Kotal, Syedreza Mohseni, Manas Gaur, Sudip Mittal, Anupam Joshi. PriveTAB: Secure and Privacy-Preserving sharing of Tabular Data ACM IWSPA (2022), Anantaa Kotal, Aritran Piplai, Sai Sree Laya Chukkapalli, Anupam Joshi. The Effect of Text Ambiguity on creating Policy Knowledge Graphs IEEE BDCloud (2021), Anantaa Kotal, Karuna Pande Joshi, Anupam Joshi. A policy-driven approach to secure extraction of covid-19 data from research papers Frontiers in Big Data (2021), Lavanya Elluri, Aritran Piplai, Anantaa Kotal, Anupam Joshi. A comparative study of deep learning based named entity recognition algorithms for cybersecurity Authors IEEE Big Data (2020), Soham Dasgupta, Aritran Piplai, Anantaa Kotal, Anupam Joshi. Measuring Semantic Similarity across EU GDPR Regulation and Cloud Privacy Policies IEEE Big Data (2020), Lavanya Elluri, Karuna Pande Joshi, Anantaa Kotal. Using Knowledge Graphs and Reinforcement Learning for Malware Analysis IEEE Big Data (2020), Aritran Piplai, Priyanka Ranade, Anantaa Kotal, Sudip Mittal, Sandeep Nair Narayanan, Anupam Joshi. ViCLOUD: Measuring Vagueness in Cloud Service Privacy Policies and Terms of Services IEEE Cloud (2020), Anantaa Kotal, Karuna Pande Joshi, Anupam Joshi. Presentations Differentially Private Synthetic Data Generation Using Context-Aware GANs (2024), Anantaa Kotal. > Grants < Bridging Data Gaps with Modeled Data from Generative AI: Advancing Health Equity in Transportation Research (03/01/2025 - 03/31/2026) - USDOT > Current/Future Courses < Term Course Section Syllabus Fall 2025 CS 4371 - Computer Science Problems 18554 Fall 2025 AI 4362 - Data Mining 17008 Fall 2025 CS 4362 - Data Mining 16885 Fall 2025 ESE 6296 - Doctoral Research 18307 Fall 2025 ESE 6396 - Doctoral Research 10064 Fall 2025 CS 5398 - Master's Thesis 16737 Fall 2025 CS 5399 - Master's Thesis 16693 Past Courses Select Term: All Spring 2025 Fall 2024 Apply Term Course Section Syllabus Spring 2025 CS 4371 - Computer Science Problems 28415 Spring 2025 CS 4342 - Database Systems 23429 Syllabus Spring 2025 CS 5399 - Master's Thesis 28272 Fall 2024 CS 5362 - Data Mining 13669 Syllabus Fall 2024 CS 6362 - Data Mining 14555 Syllabus Fall 2024 CS 5398 - Master's Thesis 18252 > Course Evaluations < Term Course Section Evaluation Spring 2025 CS 4342 - Database Systems 23429 Evaluation Fall 2024 CS 5362 - Data Mining 13669 Evaluation Fall 2024 CS 6362 - Data Mining 14555 Evaluation > Bio Bio No info available. Education Ph D in Computer Sciences, University of Maryland, Baltimore County (2024) B.Eng. in Computer Science, Jadavpur University (2017) Scholarly and Creative Activity Publications Differentially Private Synthetic Data Generation Using Context-Aware GANs IEEE Big Data (2024), Anantaa Kotal, Anupam J. . Privacy-Preserving Data Sharing Using Generative Models Proquest (2024), Anantaa Kotal. Synthetic Data for Privacy Preservation in Distributed Data Analysis Systems Springer 1 (2024), Anantaa Kotal, Sai Sree Laya Chukkapalli, Anupam Joshi. KiNETGAN: Enabling Distributed Network Intrusion Detection through Knowledge-Infused Synthetic Data Generation IEEE ICDCSW (2024), Anantaa Kotal, Brandon Luton, Anupam Joshi. Opioid and Antimicrobial Prescription Patterns During Emergency Medicine Encounters Among Uninsured Patients AMIA Summits on Translational Science Proceedings (2024), Michael Grasso, Anantaa Kotal, Anupam Joshi. Presentations Differentially Private Synthetic Data Generation Using Context-Aware GANs (2024), Anantaa Kotal. Grants Bridging Data Gaps with Modeled Data from Generative AI: Advancing Health Equity in Transportation Research (03/01/2025 - 03/31/2026) USDOT Courses Current/Future Courses Term Fall 2025 Course CS 4371 - Computer Science Problems Section 18554 Syllabus Term Fall 2025 Course AI 4362 - Data Mining Section 17008 Syllabus Term Fall 2025 Course CS 4362 - Data Mining Section 16885 Syllabus Term Fall 2025 Course ESE 6296 - Doctoral Research Section 18307 Syllabus Term Fall 2025 Course ESE 6396 - Doctoral Research Section 10064 Syllabus Term Fall 2025 Course CS 5398 - Master's Thesis Section 16737 Syllabus Term Fall 2025 Course CS 5399 - Master's Thesis Section 16693 Syllabus Past Courses Select Term: All Spring 2025 Fall 2024 Apply Term Spring 2025 Course CS 4371 - Computer Science Problems Section 28415 Syllabus Term Spring 2025 Course CS 4342 - Database Systems Section 23429 Syllabus Syllabus Term Spring 2025 Course CS 5399 - Master's Thesis Section 28272 Syllabus Term Fall 2024 Course CS 5362 - Data Mining Section 13669 Syllabus Syllabus Term Fall 2024 Course CS 6362 - Data Mining Section 14555 Syllabus Syllabus Term Fall 2024 Course CS 5398 - Master's Thesis Section 18252 Syllabus Course Evaluations Term Spring 2025 Course CS 4342 - Database Systems Section 23429 Evaluation Evaluation Term Fall 2024 Course CS 5362 - Data Mining Section 13669 Evaluation Evaluation Term Fall 2024 Course CS 6362 - Data Mining Section 14555 Evaluation Evaluation",
  "content_length": 6893,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:20"
}