{
  "name": "Ananth Grama",
  "homepage": "https://www.cs.purdue.edu/homes/ayg",
  "status": "success",
  "content": "Ananth Grama Ananth Grama Samuel D. Conte Distinguished Professor of Computer Science Associate Director, Center for Science of Information Purdue University Ananth Grama's research focuses on parallel and distributed computing with applications in modeling, design, advanced manufacturing, machine learning, and artificial intelligence for complex physical systems. His work on computer systems focuses on load balancing, resource management, data management, and security. His recent work on algorithms and analysis focuses on establishing fundamental bounds on hallucinations, online learning, learning in faulty and private environments, and quantum machine learning. He applies these systems concepts and algorithms to a range of applications, including materials modeling, systems biology, transcriptomics, clinical analytics, and structural design. Selected Recent Papers No Free Lunch: Fundamental Limits of Learning Non-Hallucinating Generative Models, C Wu, A Grama, W Szpankowski, International Conference on Learning Representations, 2025. A theory of fault-tolerant learning, C Wu, Y Wang, A Grama, International Conference on Machine Learning, 2024 (spotlight). Expected Worst Case Regret via Stochastic Sequential Covering, C Wu, M Heidari, A Grama, W Szpankowski, Transactions on Machine Learning Research, 2024. Information-theoretic Limits of Online Classification with Noisy Labels, C Wu, A Grama, W Szpankowski, Conference on Neural Information Processing Systems, 2024. Identification of predictive patient characteristics for assessing the probability of COVID-19 in-hospital mortality, B Rajwa, MMA Naved, M Adibuzzaman, AY Grama, BA Khan, MM Dundar, JC Rochet, PLOS Digital Health 2024. Prognostic significance of acute kidney injury stage 1B in hospitalized patients with cirrhosis: A US nationwide study, KR Patidar, G Cullaro, MA Naved, S Kabir, A Grama, ES Orman, S Piano, AS Alegretti, Liver Transplantation 30 (3), 244-253, 2024. May I see what you see? Predicting visual features from neuronal activity, V Ravindra, CH Fang, A Grama, Cell Iscience 27 (2) 2024 Online learning in dynamically changing environments, C Wu, A Grama, W Szpankowski, Conference on Learning Theory, 2023. Learning functional distributions with private labels, C Wu, Y Wang, A Grama, W Szpankowski, International Conference on Machine Learning, 37728-37744, 2023. Regret Bounds for Log-Loss via Bayesian Algorithms, C Wu, M Heidari, A Grama, W Szpankowski, IEEE Transactions on Information Theory, 69 (9), 5971-5989, 2023. Machine Learning Techniques in Reactive Atomistic Simulations, H Aktulga, V Ravindra, A Grama, S Pandit, Machine Learning and Its Application to Reacting Flows: ML and Combustion, 15-52, 2023. Recent Classes Spring 2025 CS525, Parallel Computing Fall 2024 CS314 - Numerical Analysis Current Projects Ananth Grama. Rare Earth and Critical Elements Recovery via Selective Membranes, Department of Energy, (SBIR Phase 1 with Triton Systems Inc.), 2/24 - 1/25. Michael Heinz, Ananth Grama, Joshua Alexander, Open Source Hearing Assessment Platform for Open Science, National Institutes of Health, (SBIR Phase 2 with Creare Inc.), 1/2024 - 12/2028. Michael Heinz, Ananth Grama, and Hari Bharadwaj, Effects of Sensorineural Hearing Loss on Robust Speech Coding, National Institutes of Health, 9/23 - 8/28. Wojciech Szpankowski, Ananth Grama, and Mohsen Heidari, Learning From Classical and Quantum Data: a Fourier, NSF/CIF, 10/22 - 9/26. Dongyan Xu, Ananth Grama, Nathan Hartman, and John Sutherland, CYMANII: Institute for Secure Advanced Manufacturing, DoE, (UTSA Lead), 9/20 - 9/25. Suresh Jagannathan and Ananth Grama, VAYU: Verifying Infrastructure for Safe and Performant Tunable Consistency, NSF, 10/20 - 9/25. Current Postdocs Changlong Wu (With Prof. Wojciech Szpankowski) Luopin Wang (With Prof. Nadia Atallah) Current Students Yifan Wang Mobasshir Naved Shourya Verma Wenbo Xie Jayanta Mukherjee David Cho Mengbo Wang Miscellaneous CV Publications (Google Scholar)",
  "content_length": 3998,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:20"
}