{
  "name": "Anand Konjengbam",
  "homepage": "https://sites.google.com/view/drkonjengbamanand",
  "status": "success",
  "content": "Dr. Konjengbam AnandSearch this siteEmbedded FilesSkip to main contentSkip to navigationKonjengbam Anand\"The mind is everything. What you think you become.\"Add Headings and they will appear in your table of contents.Open Positions for PhD/MS candidates in the field of Machine Translation, Speaker Diarization, Natural Language Processing, AR/VR/MX and Language Technology Development for Indic Languages such as machine translation, morphology analysis, and sentiment analysis. I am seeking self-motivated BTech/MTech students with strong analytical abilities, and a passion for research.Dr. Konjengbam AnandAssistant ProfessorDepartment of Computer Science & EngineeringIndian Institute of Technology DharwadDharwad - 580007, Karnataka, IndiaEmail: konjengbam dot anand at iitdh dot ac dot inInstitute website: https://www.iitdh.ac.in/konjengbamORCID ID: 0000-0003-1287-6715SCOPUS ID: 56038583400 Dr. Konjengbam Anand is an Assistant Professor at Indian Institute of Technology Dharwad, India.  With a rich history of academic and research positions, he has formerly been an Assistant Professor at both Manipur Technical University and IIIT Kottayam and also worked as a researcher at Nagayoshi Laboratory, Shizuoka University, Japan. He completed his Ph.D. in Computer Science & Engineering at IIT Hyderabad, with a dissertation on \"Exploration of Product Reviews\". Dr. Anand also has research experience in Text-to-Speech synthesis systems of Indic Languages while working as an assistant project engineer at the Indian Institute of Technology Guwahati, India. His research interests encompass various topics such as natural language processing, sentiment analysis, machine translation, AI chatbots, generative AI, and information management.Honours and Achievements :Suzuki Foundation Research Grant, Suzuki Corp., Japan, 2019IIT Hyderabad Research Appreciation Award, 2018IIT Hyderabad Research Excellence Award, 2017Education :Ph.D., Department of Computer Science & Engineering, Thesis titled: \"Exploration of Product Reviews\", Indian Institute of Technology Hyderabad, 2019.M.Tech., Computer Science & Engineering, Indian Institute of Technology Hyderabad, 2019B.Tech., Information Technology, National Institute of Technology Durgapur, 2012Invited Talk/Sessions :\"The AI Generalist Roadmap\", Directorate of Higher Education, Govt of Goa, 3-7 Nov, 2025\"Evolution of Language Models: From Simple Rules to Advanced AI\", Directorate of Higher Education, Govt of Goa, 3-7 Nov 2025\"The AI Linguist: Breaking Language Barriers with Advanced NLP Technologies\", NIT Hamirpur, 11th April 2024“Introduction to Artificial Intelligence & Machine Learning in Health research”, Workshop on Understanding Systematic Review: Integrating Data Mining and Machine Learning Methods in Health Research, MDNIY, India, 27-28 Feb 2025 “Application of Artificial Intelligence & Machine Learning”, Workshop on Understanding Systematic Review: Integrating Data Mining and Machine Learning Methods in Health Research, MDNIY, India, 27-28 Feb 2025“Use of Big Data Analysis in Agriculture”, University of Agricultural Science, Dharwad 18th Jan – 5th Feb 2024“Next Gen Computing for Big Data”, FDP cum Workshop on NextGen Computing for Big Data Applications, IIIT Kottayam, India, 2023 \"Text Classification and sentiment analysis\", NFAB: NLP Foundations and Beyond, IIIT Kottayam, India, 7-12 August 2023“How to Read a Research Article”, SERB – Accelerate Vigyan, IIIT Kottayam, India, July 22, 2022 \"Opinion Exploration of User-Generated Contents\", Indian Institute of Technology Dharwad, June 12, 2021\"Exploration of Product Reviews\", Hokkaido University, Japan, September 17, 2020Professional ActivitiesOrganizing Committee, SPECOM, 2023: The 25th International Conference on Speech & ComputerTechnical Program Committee Chair, ICTDsC 2023: International Conference On Data Science and Communication  Publicity Co-Chairs, ICITIIT'23: The 4th International Conference on Innovative Trends in Information Technology Session Chair, ICITIIT'23: The 4th International Conference on Innovative Trends in Information Technology Reviewer:Pattern Recognition, ElsevierInternational Journal of Data Science and Analytics, SpringerInternational Conference on Industrial Engineering and Engineering Management, IEEEInternational Conference on Data Management, Analytics & Innovation, SpringerResearch Interests :Natural Langauge ProcessingSentiment AnalysisMachine TranslationAI chatbotsInformation ManagementGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 4551,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:17"
}