{
  "name": "Anastasia Anagnostou",
  "homepage": "https://www.brunel.ac.uk/people/anastasia-anagnostou",
  "status": "success",
  "content": "Dr Anastasia Anagnostou | Introduction | Brunel University London Skip to Content Home People Dr Anastasia Anagnostou Dr Anastasia AnagnostouSenior Lecturer in Computer Science Wilfred Brown Building 318 Email: anastasia.anagnostou@brunel.ac.uk Tel: +44 (0)1895 266227 Computer Science College of Engineering, Design and Physical Sciences Summary Dr Anastasia Anagnostou is a Senior Lecturer in the Department of Computer Science at Brunel University London and the co-lead of the Modelling & Simulation Group (MSG). She is also member of the Intelligent Data Analytics (IDA) Group. She holds a PhD in Distributed Modelling & Simulation, an MSc in Telemedicine and e-Health Systems and a BSc(Hons) in Electronic Engineering. Her research interests lie in the areas of Advanced Computing Infrastructures for Modelling and Simulation, Open Science for Simulation, Hybrid Distributed Simulation and Modelling and Simulation for Healthcare and Industrial Applications. Since 2011, she has been involved in several interdisciplinary research projects with stakeholders from industry and academia across manufacturing, healthcare, defence and food supply chains. She has also worked in Africa helping to develop digital infrastructures and collaborative services enabling open science. She is co-chair for the OR Society’s Simulation Workshop (SW21) and member of organising committees for international conferences sponsored by the IEEE and ACM/SIGSIM. She has been awarded Horizon 2020 funding for a 9.5 million Euro project (Brunel contribution €370K) entitled “Demonstration of intelligent decision support for pandemic crisis prediction and management within and across European borders” (STAMINA). Responsibility REF 2021 team member Exchange/study abroad co-ordinator Newest selected publications Anagnostou, A., Mintram, K. and Taylor, SJE. (2024) 'Supply Chain Resilience Optimization with Agent-Based Modeling (SCROAM): A Novel Hybrid Framework'.2024 Winter Simulation Conference (WSC). Orlando, FL, USA. 15 - 18 December. IEEE. pp. 1209 - 1220. ISSN: 0891-7736 Open Access Link Conference paper Anagnostou, A., Brailsford, S., Eldabi, T., Mustafee, N. and Tako, A. (2024) 'Ten Years of the Hybrid Simulation Track: Reflections and Vision for the Future'.2024 Winter Simulation Conference (WSC). Orlando, FL, USA. 15 - 18 December. IEEE. pp. 1245 - 1259. ISSN: 0891-7736 Open Access Link Conference paper Mintram, K., Gottimukkala, B. and Anagnostou, A. (2024) 'Modeling the Lifelong Impact of Changes in Physical Activity Behavior on Non-Communicable Disease Events as a Result of The UK Covid-19 Lockdown'.2024 Winter Simulation Conference (WSC). Orlando, FL, USA. 15 - 18 December. IEEE. pp. 976 - 986. ISSN: 0891-7736 Open Access Link Conference paper Ghorbani, M., Anagnostou, A., Abubakar, N., Aatreya, H., Curry, D. and Taylor, SJE. (2024) 'Simulation Exploration Experience (SEE) Introductory Tutorial'.2024 Winter Simulation Conference (WSC). Orlando, FL, USA. 15 - 18 December. IEEE. pp. 1368 - 1382. ISSN: 0891-7736 Open Access Link Conference paper Xue, Y., Li, M., Arabnejad, H., Suleimenova, D., Jahani, A., Geiger, BC., Boesjes, F., Anagnostou, A., Taylor, SJE., Liu, X. and Groen, D. et al. (2024) 'Many-Objective Simulation Optimization for Camp Location Problems in Humanitarian Logistics'. International Journal of Network Dynamics and Intelligence, 13 (3). pp. 1 - 14.Open Access Link Journal article More publications(85)",
  "content_length": 3446,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:22"
}