{
  "name": "Anastasios Kyrillidis",
  "homepage": "http://akyrillidis.github.io",
  "status": "success",
  "content": "Anastasios Kyrillidis Major update May 2024 Several updates happened in the past months: 1 paper was accepted at ICLR 2024 on adaptive step size for federated learning; 1 paper was accepted at ICML 2024 on the first work on how error propagates in deflation PCA; 1 paper was accepted at ISIT 2024 on a fast algorithm for FixMatch; and 1 paper was accepted at ICRA 2024. This constitutes the update of OptimaLab for the past 5 months. More details are in the Publications webpage or Google Scholar. Major update Jan 2024 Several updates happened in the past months: 1 paper was accepted at ICRC with the best poster award (Congrats, David Quiroga); 1 paper was accepted at ALT 2024; 1 paper was accepted at CPAL 2024; 1 paper accepted at NeurIPS 2023; 1 paper accepted at ICCV 2023; 1 paper accepted at ACML 2023; 1 journal accepted at the International Union of Crystallography Journal; and 1 journal paper accepted at the Machine Learning Journal (Springer). This constitutes the update of OptimaLab for the past 5 months. More details are in the Publications webpage or Google Scholar. Major update Apr 2023 OptimaLab has received an Amazon Research Award (ARA) and a Microsoft Research Award! Thank you sponsors! Major update Apr 2023 3 papers accepted at AISTATS 2023; 1 paper accepted at ICASSP; 1 paper accepted at ICRA; 2 journal publications on GIST and fast quantum tomography: This constitutes the update of OptimaLab the past 5 months. More details in the Publications webpage or Google Scholar. Journal on neural network training accepted at Transactions on Machine Learning Research (TMLR) Aug 2022 Fangshuo (Jasper) Liao has led the effort to prove why and when one can achieve this by iteratively creating, training, and combining randomly selected subnetworks in deep learning. The journal is accepted at the Transactions on Machine Learning Research (TMLR) - details below. Two papers accepted at UAI 2022 Distributed factored gradient descent for QST is accepted at L-CSS/CDC Rice joins forces on deep learning + biosciences (Nature Communications) Jun 2022 Through a collaborative effort among several departments within Rice, there is now available an overview paper on current progress and open challenges for applying deep learning across the biosciences. More details in the article that follows: IST paper is accepted at VLDB 2022 Two papers accepted at L4DC 2022 Two papers accepted at ICASSP 2022 REX - Revisiting Budgeted Training with an Improved Schedule is accepted at MLSys 2022 PipeGCN - Efficient Full-Graph Training of Graph Convolutional Networks with Pipelined Feature Communication is accepted at ICLR 2022 Feb 2022 Our paper on PipeGCN: Efficient Full-Graph Training of Graph Convolutional Networks with Pipelined Feature Communication is accepted at the Tenth International Conference on Learning Representations (ICLR 2022). Mitigating deep double descent by concatenating inputs is accepted at CIKM 2021 Solving hybrid Boolean constraints in continuous space via multilinear Fourier expansions accepted at Artificial Intelligence Journal (Elsevier) Oct 2021 Our paper on Solving hybrid Boolean constraints in continuous space via multilinear Fourier expansions is accepted at the Artificial Intelligence Journal (Elsevier). Robust optimization-based motion planning for high-DOF robots under sensing uncertainty at ICRA 2021 May 2021 Our paper on Robust optimization-based motion planning for high-DOF robots under sensing uncertainty is accepted at 2021 IEEE International Conference on Robotics and Automation (ICRA) (virtual). Bayesian Coresets - Revisiting the Nonconvex Optimization Perspective at AISTATS 2021. Feb 2021 Our paper on Bayesian Coresets: Revisiting the Nonconvex Optimization Perspective is accepted at the AISTATS conference this year (virtual). On Continuous Local BDD-Based Search for Hybrid SAT Solving at AAAI 2021. Feb 2021 Our paper on On Continuous Local BDD-Based Search for Hybrid SAT Solving is accepted at the AAAI conference this year (virtual). Negative sampling in semi-supervised learning at ICML 2020. Workshop on optimization methods got accepted at ICML 2020! Semi-supervised learning (SSL) - A systematic survey Mar 2020 Co-writers: Vatsal Shah, John Chen Solution uniqueness on overparameterized matrix sensing at AISTATS 2020. An updated overview of recent gradient descent algorithms Mar 2020 Re-posted from my student’s, John Chen, website FourierSAT at AAAI 2020. Learning Sparse Distributions using Iterative Hard Thresholding at NeurIPS 2019. More...",
  "content_length": 4538,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:22"
}