{
  "name": "Anca L. Ralescu",
  "homepage": "http://uc.academia.edu/AncaRalescu",
  "status": "success",
  "content": "Anca Ralescu - University of Cincinnati Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Anca RalescuUniversity of Cincinnati, Computer Science, Faculty MemberaddFollowdoneFollowingFollowers45Following15Co-authors15Public ViewsRelated Authors Paolo BellavistaAICCON - Associazione Italiana per la Promozione della Cultura della Cooperazione e del Non Profit patrick rathje Elton Domnori Francisco FalconePublic University of Navarra Elmer R MagsinoDe La Salle University Konstantinos Katsaros Md. Abubakar SiddikHajee Mohammad Danesh Science & Technolgy University, Bangladesh Razvan StanicaInstitut National Polytechnique de Toulouse Barbara Masini Jianhe DuInterestsView All (6) UploadsPapers by Anca RalescuAn Innovative Framework for Dynamic Traffic Lights Management Based on the Combined Use of Fuzzy Logic and Several Network ArchitecturesJournal of Advanced Transportation, Feb 23, 2022e development of Information and Communication Technologies (ICT) has now reached some entirely u... more e development of Information and Communication Technologies (ICT) has now reached some entirely unexpected domains. Many applications in modern cities lead to novelties, resulting in new habits of the citizens of tomorrow's smart cities. ese innovations include Intelligent Transportation Systems (ITS). An important application domain of ITS is undoubtedly represented by the dynamic and optimized management of traffic-lighted road intersections. Although several works have already been presented in the literature over the years, many have not considered the new perspectives regarding the source of data to manage traffic lights, i.e., not only Wireless Sensor Networks (WSNs), but, mainly, the vehicular communications. is paper introduces an innovative approach to dynamically regulating traffic light cycles and phases in an isolated intersection. e suggested method can fit data management from WSNs and vehicular communications through IEEE 802.11p and LTE-V2V, employing various Fuzzy Logic Controllers (FLCs) that manage vehicles turning movements for dynamic controls of both the phase and the green time of traffic lights. e results obtained will allow us to observe that the proposed application is better than the others. Each of the implemented configurations will bring advantages and disadvantages that allow choosing one configuration or another based on specific project requirements.arrow_back_iosarrow_forward_iosDownload Why Cauchy Membership Functions: ReliabilityAdvances in Artificial Intelligence and Machine Learning, 2022An important step in designing a fuzzy system is the elicitation of the membership functions for ... more An important step in designing a fuzzy system is the elicitation of the membership functions for the fuzzy sets used. Often the membership functions are obtained from data in a traininglike manner. They are expected to match or be at least compatible with those obtained from experts knowledgeable of the domain and the problem being addressed. In cases when neither are possible, e.g., insufficient data or unavailability of experts, we are faced with the question of hypothesizing the membership function. We have previously argued in favor of Cauchy membership functions (thus named because their expression is similar to that of the Cauchy distributions) and supported this choice from the point of view of efficiency of training. This paper looks at the same family of membership functions from the point of view of reliability.Download Are boxes better for classification?Abstract--The design of a classifier usually has the important step of attribute or feature selec... more Abstract--The design of a classifier usually has the important step of attribute or feature selection. A computationally tractable scheme almost always relies on a subset of attributes that optimize a certain criterion is chosen, resulting in a good sub-optimal solution. We show ... Taking a Close Look at Twitter Communities and ClustersCommunications in computer and information science, 2021 Fuzzy dynamic timetable scheduling for public transitFuzzy Sets and Systems, Sep 1, 2020Timetable scheduling for public transit seeks to optimize service quality and utilization of limi... more Timetable scheduling for public transit seeks to optimize service quality and utilization of limited resources. A new method is proposed to find a sequence of time intervals adjusted to the dynamic passenger flow in a fuzzy environment with improved reverse-flow. The decision making is based on two fuzzy variables-passenger satisfaction and vehicle capacity usage. Compared with the original timetable, the optimized timetable can adjust to the varying passenger flow, while balancing passenger satisfaction and vehicle load, and it is optimized for any service time span. A practical implementation is provided on a case study of three bus lines for which timetables are designed and discussed in varying situations.Download Applied Research in Fuzzy Technology Three years of research at the Laboratory for International Fuzzy Engineering (LIFE), Yokohama, JapanKluwer Academic eBooks, 1994Preface. 1: Future Vision of Fuzzy Engineering T. Terano. 2: Decision Support System S. Fukami, M... more Preface. 1: Future Vision of Fuzzy Engineering T. Terano. 2: Decision Support System S. Fukami, M. Yoneda. 3: Intelligent Plant Operation Support M. Yoneda, H. Tsunekawa. 4: Fuzzy Modeling and Process Control System Design K. Suzuki. 5: Inference Function for Understanding Linguistic Instructions T. Yokogawa. 6: Fuzzy Theory in an Image Understanding Retrieval System T. Norita. 7: Research into Intelligent Behavior Decision Making of Robots Y. Maeda. 8: Fuzzy Neural Net System T. Yamaguchi, K. Goto, T. Takagi. 9: Fuzzy Expert System Shell -- LIFE FEShell S. Tano. 10: The Fuzzy Computer H. Tokunaga, S. Yasunobu. Subject Index. Context-based Correlation for Supervised LearningMAICS, 2003 Initialization and Plasticity of CEFYDRA: Cluster-first Explainable FuzzY-based Deep self-Reorganizing AlgorithmSpringer eBooks, Sep 30, 2022 Schedule optimization under fuzzy constraints of vehicle capacityFuzzy Optimization and Decision Making, Sep 19, 2018The objective of designing timetables for public transportation is twofold: to ensure an efficien... more The objective of designing timetables for public transportation is twofold: to ensure an efficient use of limited resources and to provide a comfortable ride for passengers. Two models for timetable optimization are investigated in this study. Model 1 uses a crisp constraint on the rate of vehicle capacity usage. Model 2 improves on model 1 by translating the crisp constraint into a fuzzy goal representing passenger satisfaction, and a fuzzy constraint, representing the extent of vehicle usage. Both, the fuzzy goal and the fuzzy constraint, are fuzzy sets on the number of on-board passengers. Heuristic methods together with linear programming are proposed for finding the optimal headway. Model 1 selects the largest time interval under the bound on vehicle size. The set of optimal time intervals in model 2 is decided by the simultaneous level cuts of the fuzzy goal and constraint. Experimental results show that fuzzy-set based model 2 is the most flexible and effective way to generate an optimal timetable.Download Preliminary Study Towards a Fuzzy Model for Visual AttentionHAL (Le Centre pour la Communication Scientifique Directe), 2015Attention, in particular visual attention, has been a subject of studies in various disciplines, ... more Attention, in particular visual attention, has been a subject of studies in various disciplines, including cognitive science, experimental psychology, and computer vision. In cognitive science and experimental psychology the objective is to develop theories that can explain the attention phenomenon of cognition. In computer vision, the objective is to inform image understanding systems by hypotheses on the human visual attention. There is, however, very little influence of studies across these two disciplines. In a departure from this state of affairs, this study seeks to develop an algorithmic approach to visual attention as part of an image understanding system, by starting with a theory of visual attention put forward in experimental psychology. In the process, it will become useful to revise some of the concepts of this theory, in particular by adopting fuzzy set based representations and the necessary calculus for them.Download Fuzzy Logic in Artificial Intelligence: Proceedings of the IJCAI '93 Workshop, Chambery, France, August 28, 1993Springer eBooks, Sep 1, 1994 <title>Inferred-boundary-based approach to object recognition</title>Proceedings of SPIE, Mar 28, 1995ABSTRACT Explainable fuzzy cluster-based regression algorithm with gradient descent learningComplex engineering systems, 2022We propose an algorithm for n-dimensional regression problems with continuous variables. Its main... more We propose an algorithm for n-dimensional regression problems with continuous variables. Its main property is explainability, which we identify as the ability to understand the algorithm’s decisions from a human perspective. This has been achieved thanks to the simplicity of the architecture, the lack of hidden layers (as opposed to deep neural networks used for this same task) and the linguistic nature of its fuzzy inference system. First, the algorithm divides the joint input-output space into clusters that are subsequently approximated using linear functions. Then, we fit a Cauchy membership function to each cluster, therefore identifying them as fuzzy sets. The prediction of each linear regression is merged using a Takagi-Sugeno-Kang approach to generate the prediction o",
  "content_length": 15171,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:26"
}