{
  "name": "Anders Andersen",
  "homepage": "https://uit.no/ansatte/anders.andersen",
  "status": "success",
  "content": "Andersen, Anders | UiT Anders.andersen – Institutt for informatikk | UiT Gå til hovedinnhold Enheten Ansatte Anders Andersen Instituttleder Institutt for informatikk anders.andersen@uit.no +4777644703 95180675 Tromsø Her finner du meg Anders Andersen Om Forskning og undervisning Her finner du meg Arbeider i Cristin Vitenskapelige artikler og bokkapitler Bøker og antologier Andre Ingar M Arntzen, Njål Trygve Borch, Anders Andersen : Control-Driven Media: A Unifying Model for Consistent, Cross-platform Multimedia Experiences International Journal of Advanced Computer Science and Applications (IJACSA) 2024 DOI / ARKIV Ingar Mæhlum Arntzen, Njål Trygve Borch, Anders Andersen : State Trajectory. A Unifying Approach to Interactivity with Real-Time Sharing and Playback Support 2023 DOI Seshathiri Dhanasekaran, Anders Andersen, Randi Karlsen, Anne Håkansson, André Henriksen : Data Collection and Analysis Methods for Smart Nudging to Promote Physical Activity: Protocol for a Mixed Methods Study Studies in Health Technology and Informatics 2023 DOI / ARKIV Seshathiri Dhanasekaran, Anders Andersen, Randi Karlsen, Anne Håkansson, André Henriksen : Data collection and smart nudging to promote physical activity and a healthy lifestyle using wearable devices 2022 DOI / ARKIV Randi Karlsen, Anders Andersen : The Impossible, the Unlikely, and the Probable Nudges: A Classification for the Design of Your Next Nudge Technologies 2022 DOI / ARKIV Salman Khaleghian, Habib Ullah, Einar Broch Johnsen, Anders Andersen, Andrea Marinoni : AFSD: Adaptive Feature Space Distillation for Distributed Deep Learning IEEE Access 2022 DOI / ARKIV Randi Karlsen, Anders Andersen : Recommendations with a Nudge Technologies 13. juni 2019 DOI / ARKIV / FULLTEKST Randi Karlsen, Najeeb Elahi, Anders Andersen : Personalized Recommendation of Socially Relevant Images 2018 DOI / FULLTEKST Anders Andersen, Randi Karlsen, Weihai Yu : Green transportation choices with IoT and smart nudging 2018 DOI / FULLTEKST Anders Andersen, Merete Saus : Privacy preserving distributed computation of community health research data Procedia Computer Science 2017 DOI / ARKIV Anders Andersen, Randi Karlsen : Privacy preserving personalization in complex ecosystems 2017 DOI Anders Andersen, Randi Karlsen : User Profiling through NFC interactions: Mining NFC-based User Information from Mobile Devices and Back-end Systems 2016 DOI Arne Munch-Ellingsen, Anders Andersen, Sigmund Akselsen, Randi Karlsen : Customer managed security domain on mobile network operators’ SIM cards: Opportunities to enable new business models 2015 DOI Arne Munch-Ellingsen, Richard Karlsen, Anders Andersen, Sigmund Akselsen : Two-factor Authentication for Android Host Card Emulated Contactless Cards 2015 DOI Arne Munch-Ellingsen, Anders Andersen, Sigmund Akselsen : Manage your own security domain on your smartphone 2015 DOI Bente Evjemo, Sigmund Akselsen, Dag Slettemeås, Arne Munch-Ellingsen, Anders Andersen, Randi Karlsen : “I Expect Smart Services!” User Feedback on NFC Based Services Addressing Everyday Routines 2015 DOI Anders Andersen, Trygve Hardersen, Norbert Schirmer : Privacy for cloud storage 2014 Anders Andersen : SNOOP: Privacy preserving middleware for secure multi-party computations 2014 Anders Andersen, Kassaye Yitbarek Yigzaw, Randi Karlsen : Privacy preserving health data processing 2014 DOI Fábio M. Costa, Anders Andersen : ARM 2014: Proceedings of the 13th Workshop on Adaptive and Reflective Middleware Association for Computing Machinery (ACM) 2014 Randi Karlsen, Anders Andersen : How to Trigger Personalized and Context-Aware Nudges 2024 Randi Karlsen, Anders Andersen : A Model for Designing Personalized and Context-Aware Nudges 2024 Ingar M Arntzen, Njål Trygve Borch, Anders Andersen : Unify Media and UX with timed variables 2021 SAMMENDRAG / OMTALE Seshathiri Dhanasekaran, Anders Andersen, Randi Karlsen, Anne Håkansson : Data Analysis Techniques for Smart Nudging 2021 ARKIV Anders Andersen, Stian Normann Anfinsen, Luca Frediani : Fremragende læring med beregningsorientert programmering Nordic Journal of STEM Education 2019 FULLTEKST Anders Andersen, Tor Berre, Pål Ellingsen, Laurence Marie Anna Habib, Moutaz Haddara, Erik Hjelmås m.fl.: Informasjonssikkerhet i høyere utdanning Nordic Journal of STEM Education 2019 FULLTEKST Anders Andersen, Tor Berre, Pål Ellingsen, Laurence Marie Anna Habib, Moutaz Haddara, Erik Hjelmås m.fl.: Informasjonssikkerhet i høyere utdanning 2019 Anders Andersen, Stian Normann Anfinsen, Luca Frediani : Fremragende læring med beregningsorientert programmering 2019 Randi Karlsen, Najeeb Elahi, Anders Andersen : Personalized Recommendation of Socially Relevant Images 2018 Kari Byklum, Anders Andersen, Kolbjørn Engeseth, Anne Husebekk : Etterlyser flere helseteknologer 24. mai 2018 FULLTEKST Abul Ahsan Md Mahmudul Haque, Weihai Yu, Anders Andersen, Randi Karlsen : Decentralized Orchestration of Open Services- Achieving High Scalability and Reliability with Continuation-Passing Messaging UiT Norges arktiske universitet 14. desember 2017 Kassaye Yitbarek Yigzaw, Johan Gustav Bellika, Gunnar Hartvigsen, Anders Andersen, Fred Godtlibsen, Stein Olav Skrøvseth m.fl.: Towards Practical Privacy-Preserving Distributed Statistical Computation of Health Data UiT Norges arktiske universitet 2017 Anders Andersen, Merete Saus : Privacy preserving distributed computation of community health research data 2017 Anders Andersen, Randi Karlsen : User Profiling through NFC interactions: Mining NFC-based User Information from Mobile Devices and Back-end Systems 2016 Anders Andersen, Per Haakon Lomsdalen : NFC City i Tromsø testet ut tallrike bruksområder for nærkommunikasjon: Stort potensial 29. januar 2015 Arne Munch-Ellingsen, Anders Andersen, Sigmund Akselsen, Kristian Elsebø, Robert Molund Pettersen, Erlend Helland Graff m.fl.: Manage your own security domain on your smartphone 2015 Arne Munch-Ellingsen, Richard Karlsen, Anders Andersen, Sigmund Akselsen : Two-factor Authentication for Android Host Card Emulated Contactless Cards 2015 Kim Daniel Arthur, Anders Andersen, Stian Hansen, Ida Ramberg : Kan ta studiepoeng i spill 18. januar 2015 Anders Andersen, Linn Bertheussen : Her bør du ikke klikke når du er på jobb 13. april 2015 FULLTEKST Bente Evjemo, Sigmund Akselsen, Dag Slettemeås, Arne Munch-Ellingsen, Anders Andersen, Randi Karlsen : “I expect smart services!” User feedback on NFC based services addressing everyday routines 2014 Anders Andersen : Smarttelefoner, NFC og sikkerhet 2014 Anders Andersen : Sikkerhet og mobil infrastruktur, med eller uten NFC 2014 Thor Harald Henriksen, Terje Mortensen, Simen Lomås Johannessen, Sigmund Akselsen, Bente Evjemo, Anders Andersen : Din nye mobil-hverdag 06. januar 2014 Sigmund Akselsen, Dag Slettemeås, Anders Andersen, Kristin Straumsheim Grønli : Snart fart på mobilsveip 03. november 2014 Anders Andersen, Ragnhild Gustad : - Joda, dette er trygt 21. september 2014 Sigmund Akselsen, Dag Slettemeås, Anders Andersen, Kristin Straumsheim Grønli : Derfor kan du betale med mobilen først nå 04. november 2014 Anders Andersen, Trygve Hardersen, Norbert Schirmer : Privacy for cloud storage 2014 Anders Andersen, Norgesglasset NRK : Når smarttelefonen erstatter alt (Innslag 2, fra 20:00 - 31:00) 19. september 2014 Randi Karlsen, Anders Andersen : Tools for image annotation: Using context-awareness, NFC and image clustering 2014 Anders Andersen, Arne Munch-Ellingsen : Mobile device security: The role of NFC, UICC and secure elements 2014 De 50 siste resultatene fra Cristin vises på siden. Se alle arbeider i Cristin her → Forskningsinteresser Min forskning omfatter fem hovedtemaer. Det første temaet er tilpasningsdyktig systemarkitekturer (adaptive system architectures). Mine hovedbidrag innenfor området er utvikling av programmeringsabstraksjoner for adapsjonskontroll og teknikker for å observere og analysere systemoppførsel. Mitt andre tema er støtte for multimedia-applikasjoner, inklusiv kontinuerlige media. Mine hovedbidrag innenfor for dette temaet er å anvende formelle spesifikasjoner av tjenestekvalitetsforvaltning (QoS) til konfigurasjon av kjøreomgivelsen for multimediaapplikasjoner og utviklingen av eksplisitte bindingsarkitekturer for multimedia kommunikasjon. Det tredje temaet er støtte for mobilitet og kontekstsensitive systemer. Dette inkluderer observasjon av endringer i omgivelsene og tilby best mulig tjeneste basert på disse observasjonene (for eksempel i personalisering av tjenester). Mine hovedbidrag er kontekstavhengig konfigurering og rekonfigurering basert på nåværende kontekst og støtte for integrasjon av et vidt spekter av tjenester og informasjonsressurser. Mitt fjerde tema er sikkerhet. Mine hovedbidrag her er forskning rundt tilpasningsdyktige sikkerhetsmekanismer, utvikling av sikker og brukervennlig lagring og deling av informasjon, kombinasjon av sikker flerpartsberegninger (Secure Multiparty Computation, SMC) og offentlig nøkkelteknologi for å løse problemer rundt personvern og analyse av data (inklusiv helsedata), og sikkerhet i kontekst av mobile enheter, NFC og sikre elementer (SIM- kort). Det femte hovedtema er innen AI og maskinlæring (ML). Mine hovedbidrag her er innen system- og programmeringsstøtte ved realisering av løsninger som anvender ML. Forskningssiden til Anders Andersen Undervisning Jeg har omfattende undervisnings- og veiledningserfaring fra UiT og Høgskolen i Hedmark. Jeg har utarbeidet flere nye kurs både ved UiT og ved Høgskolen i Hedmark. Jeg har undervist på alle nivå i instituttets kursportefølje, og jeg har undervist innen mange ulike temaer. Jeg har veiledet et stort antall sivilingeniørstudenter, cand. scient. studenter, masterstudenter (tilsammen 50) og PhD-studenter (tilsammen 8). Jeg har også vært sensor ved kurs og mastergrader ved mange ulike universitet og høyskoler (blant annet Universitet i Oslo, NTNU, Høgskolen i Bodø/Nord universitet, Høgskolen i Hedmark og Høgskolen i Østfold)",
  "content_length": 10518,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:31"
}