{
  "name": "Anders Sundnes Løvlie",
  "homepage": "https://pure.itu.dk/portal/en/persons/anders-sundnes-loevlie(22ec9269-2fff-4dbf-a9c7-5037559a15ee).html",
  "status": "success",
  "content": "Anders Sundnes Løvlie - IT-University of Copenhagen Anders Sundnes Løvlie Associate Professor, Play, Culture, and AIHead of Research Group, Media, Art & DesignMedia, Art & DesignAudio-Visual Computing https://orcid.org/0000-0003-0484-4668 Emailasunitudk 20152025 Research activity per year Personal profile Research areasMain research interests: Experience design, locative media and media studies. Coordinator for the Horizon 2020 project GIFT: Meaningful Personalization of Hybrid Virtual Museum Experiences Through Gifting and Appropriation. KeywordsAI: Artificial IntelligenceComputer GamesDesignExperience designHCI: human-computer interactionJournalismLocative mediaMediamuseumsPlayful DesignPrototypingScience communicationUX designGames Fingerprint Dive into the research topics where Anders Sundnes Løvlie is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Museum Keyphrases 100% Museum Experience Keyphrases 49% Digital Arts and Humanities 45% Design Process Keyphrases 26% Museum Visitors Keyphrases 24% Research through Design Keyphrases 21% Art Mediation Keyphrases 16% Designer Arts and Humanities 16% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2015 2016 2018 2020 2022 2025 17 Article in proceedings 15 Report 15 Journal article 8 Book chapter 14 More 5 Paper 4 Conference abstract for conference 2 Conference article 1 Book 1 Conference abstract in proceedings 1 Preprint Research output per year Research output per year Enabling Embodied Music-Making for Non-MusiciansMontesínos, L., Jensen, H. H. & Løvlie, A., 19 Jun 2025, Proceedings of the International Conference on New Interfaces for Musical Expression. p. 1-7 7 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Non-musicians 100% Non-Musicians 100% Music-making 100% Design Exploration 33% Embodied Interaction 33% Algorithmic Ways of Seeing: Using Object Detection to Facilitate Art ExplorationMeyer, L. S., Engel Aaen, J., Tranberg, A. R., Kun, P., Freiberger, M., Risi, S. & Løvlie, A. S., 11 May 2024, Algorithmic Ways of Seeing: Using Object Detection to Facilitate Art Exploration. p. 1-18 18 p. (ACM Annual Conference on Human Factors in Computing Systems (CHI)).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Museum Collections 100% Art Museums 100% Art Exploration 100% Digital 50% Painting 50% Exploring Aesthetic Qualities of Deep Generative Models through Technological (Art) MediationSivertsen, C. & Løvlie, A. S., 1 Jun 2024, Proceedings of the 2024 ACM Designing Interactive Systems Conference. New York, NY, USA: Association for Computing Machinery, p. 2738-2752 15 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Deep Generative Models 100% Aesthetic Quality 100% Art Mediation 100% Technological Art 100% Esthetics 100% Machine Learning Processes as Sources of Ambiguity: Insights from AI ArtSivertsen, C., Salimbeni, G., Løvlie, A. S., Benford, S. & Zhu, J., 11 May 2024, Proceedings of the 2024 CHI Conference on Human Factors in Computing Systems. New York, NY, USA: Association for Computing Machinery, p. 1-14 14 p. 165Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Machine Learning 100% AI Art 100% Machine Learning Workflow 100% Learning Process 100% Artificial Intelligence 100% Using Tangible Interaction to Design Musicking Artifacts for Non-musiciansMontesinos Garcia, L., Løvlie, A. S. & Jensen, H. H., 15 Apr 2024.Research output: Working paper › Preprint Open Access Tangible Interaction 100% Musicking 100% Non-musicians 100% Non-Musicians 100% Design Exploration 25% View all 69 research outputs Projects Projects per year 2017 2017 2018 2019 2020 2021 2022 2024 2026 1 Active 7 Finished Projects per year GIFT: Meaningful Personalization of Hybrid Virtual Museum Experiences Through Gifting and AppropriationLøvlie, A. S. (PI), Sicart, M. A. (CoI), Ryding, K. (CoI), Olesen, A. R. (CoI), Wray, T. (CoI), Ojala, M. (CoI), Mortensen, C. H. (CoI), Waagstein, A. (CoI), Jensen, C. M. M. (CoI), Holdgaard, N. (CoI), Ioannidis, P. (CoI), Brin, S. (CoI) & Pichlmair, M. (CoI)European Commission01/01/2017 → 31/12/2019Project: Research Museum 100% Digital 100% Museum Experience 85% Personalization 71% Framework 65% ArtNet: Algorithmic Ways of Seeing: Improving Image Recognition by Training on Art ImagesRisi, S. (PI), Løvlie, A. S. (CoI), Freiberger, M. (CoI), Kun, P. (CoI), Engel Aaen, J. (CoI) & Meyer, L. S. (CoI)Villum Foundation01/05/2022 → 31/12/2024Project: Research Art Image 100% Image Recognition 100% Photographic Images 100% Photographic Image 100% Computer Vision 66% Exhibition DesignerLøvlie, A. S. (PI), Ibsen, P. (Admin), Oppermann, N. (Admin), Jensen, J. M. (CoI) & Vanggaard, F. B. (CoI)Innovation Fund Denmark01/03/2024 → 28/02/2025Project: Research Interne 100% Ressources 100% Mange 100% exhibition designer 100% Digital 50% DDA: Unique solutions for the digital dissemination of architecture through mixed reality experiencesLøvlie, A. S. (PI) & Ioannidis, P. (PI)Innovation Fund Denmark01/04/2019 → 31/12/2023Project: Research Mixed Reality 100% Unique Solution 100% Digital Dissemination 100% Dissemination 100% Architecture 100% Sense of place: Authenticity, atmosphere and presence across the digital realm and unique heritage locations.Løvlie, A. S. (PI) & Falch Yates, M. (CoI)New Carlsberg Foundation01/01/2021 → 31/12/2023Project: Research View all 8 projects Press/Media Guide til videnskaben på Folkemødet: Se fremtidens hjerneforskning, fermentering og forskerspirerWirman, H. E., Backe, H.-J., Løvlie, A. S. & Nielsen, R. K. L.12/06/20251 Media contributionPress/Media: Press / Media Nu kommer Videnskab.dk's Evidensbarometer 2.0Løvlie, A. S.25/04/20221 Media contributionPress/Media: Press / Media Fond giver 45 mio. kr. til datadrevet tværfaglig forskningRisi, S. & Løvlie, A. S.11/11/20211 Media contributionPress/Media: Press / Media Villum Synergy: Datadrevet tværfaglig forskning accelerererRisi, S. & Løvlie, A. S.29/09/20211 Media contributionPress/Media: Press / Media Teknologi dumper utroværdige artikler om sundhedsforskningLøvlie, A. S.25/09/20181 Media contributionPress/Media: Press / Media View all 17 press/media Activities Activities per year 2014 2014 2015 2019 9 Organisation and participation in conference 7 Organisation and participation in workshop, seminar, course 3 Lecture and oral contribution 1 Editor of Research journal 1 More 1 Membership in committee, council, board Activities per year Coordinator's day 2016Løvlie, A. S. (Participant)23 Sept 2016Activity: Participating in or organising an event types › Organisation and participation in workshop, seminar, course DEMOCRACY & CITIZENSHIP IN DIGITAL SOCIETYLøvlie, A. S. (Participant)19 Jun 2015Activity: Participating in or organising an event types › Organisation and participation in conference Design for Engagement: Civic, Social and PersonalLøvlie, A. S. (Speaker)12 Oct 2015 → 16 Oct 2015Activity: Participating in or organising an event types › Organisation and participation in workshop, seminar, course Designing Digital Culture SeminarLøvlie, A. S. (Speaker)15 Dec 2014Activity: Participating in or organising an event types › Organisation and participation in workshop, seminar, course Digital Creativity (Journal)Løvlie, A. S. (Reviewer)27 Apr 2015 → …Activity: Publication peer-review and editorial work types › Editor of Research journal › Research View all 21 activities",
  "content_length": 8124,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:35"
}