{
  "name": "Anders Drachen",
  "homepage": "https://www.cs.york.ac.uk/people/?group=Academic%20and%20Teaching%20Staff&username=adrachen",
  "status": "success",
  "content": "Prof Anders Drachen - Computer Science, University of York Skip to Content Accessibility statement Search Computer Science University Department of Computer Science University | A to Z | Departments Computer SciencePeopleOur staffProf Anders Drachen Computer ScienceStudyInternational studentsPeopleResearchProfessional Development and TrainingAbout usContact usCurrent staff and students Academic and Teaching Staff Prof Anders Drachen Honorary Visiting Professor Interests Anders Drachen, PhD, (born 1976) is Professor at the Department of Computer Science, University of York. He is the former co-director of the Digital Creativity Labs (digitalcreativity.ac.uk/), a UK Digital Economy Hub and World Centre for Excellence, which connects 100+ partners in delivering impact-driven research in games, interactive media and the rich space in which they converge. He also Lead Industry Liaison of the Intelligent Games and Game Intelligence Centre for Doctoral Training (iggi.org.uk/). He is the Head of Analytics of the UKRI Audience of the Future Demonstrator Weavr (http://weavr.tv/). which is building new data-driven audience experiences across esports and sports. He is also the co-director and co-founder of the Arena Research Cluster (arc.york.ac.uk/), an international research network focused on innovation in esports and sports. He is a multiple entrepreneur. He is recognized as one of the world’s most influential people in business intelligence in the Creative industries, and a core innovator in the domain with 140+ publications across game analytics and games user research. His work has assisted major international game publishers, as well as SMEs, make better decisions based on their data. As an interdisciplinary, veteran data scientist, his work has reached across user behaviour, user experience, business intelligence, big data, machine learning, information systems, human-computer interaction, digital business transformation, data visualisation, audience interaction, design, experimental psychology and mental health. He is editor/author of two field-defining books in the Creative Industries domain that specifically combine expertise from research and practice, with >150 collaborators across academia and industry: Game Analytics – Maximizing the Value of Player Data, which has seen over 178,000 downloads [This is an astonishingly good book. (J. M. Artz, Computing Reviews, July, 2013)], Games User Research (gurbook.com) a standard work of reference in the games industry [I’ll certainly be adding this to my course’s reading list. (C. McKee, The Computer Games Journal, July, 2020)]. The upcoming Game Data Science will be the first handbook on data science in the Creative Industries, aimed at students and professionals alike. His research has been covered by international print and online media worldwide. Major national print and online news outlets such as Wired, New York Post and Forbes have covered his research which has attained global attention on multiple occasions. His research work has received five best paper awards and two honourable mentions at major conferences including the Eleventh Annual AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment (AIIDE) in 2015 and the ACM CHI Conference on Human Factors in Computing Systems in 2019. He was part of the team behind the International Game Development Association’s Special Interest Group on Games Research and User Experience, which today counts over 2100 members worldwide. He is a member of the International Game Development Association’s Special Interest Group on Game Analytics. He is a member of Turing Institute Special Interest Group on Data Visualisation and the Council of Professors and Heads of Computing in the United Kingdom. He is a member of multiple other international special interest groups and committees. He has organized several international conferences and workshops and served on dozens of conference committees. He collaborates with international networks of colleagues in academia and industry and works with students worldwide on research projects. He is a strong proponent for work-integrated learning and an active partner for the Creative Industries in matchmaking students for internships and careers. Having lived and worked on four different continents, Anders Drachen has had the mixed pleasure of fending off three shark attacks in Africa and Australia. He is also the youngest Dane in history to publish a cooking book – dedicated to ice cream. In his free time, he writes children’s books about economics and technology. You can read more about Anders Drachen on www.andersdrachen.com Contact details Department of Computer Science University of York Deramore Lane York YO10 5GH UK Phone: +44 (0)1904 325354 Office: Off-campusE-mail: Send e-mail using web form Department of Computer Science Deramore Lane, University of York, Heslington, York, YO10 5GH, UK Tel: work 01904 325501 Legal statements | Privacy | Cookies | Accessibility © University of York | Modify | Direct Edit",
  "content_length": 5050,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:28"
}