{
  "name": "Andreas G. Veneris",
  "homepage": "http://www.eecg.utoronto.ca/~veneris/AndreasVeneris.htm",
  "status": "success",
  "content": "Andreas Veneris > This is my homepage! Home Publications Projects Students Sponsors University of Toronto ò Computer Engineering Research Group (EECG) Personal I am a Connaught Scholar and a Professor at the Department of Electrical and Computer Engineering (Computer Engineering and Electronics groups) cross-appointed with the Department of Computer Science and the Munk School of Global Affairs & Public Policy at the University of Toronto. My research interests include game-theoretical incentives for crypto-economics, mechanism/system design of distributed ledger (blockchain or Web 3.0) systems, formal methods, Central Bank Digital Currencies, decentralized finance (DeFi), techno-legal questions for distributed ledger technology, and data analytics for fintech. Prior to it, for almost two decades, I worked extensively in the area of CAD for VLSI verification, debug, synthesis and test. My CV is found here. I obtained my PhD from the University of Illinois at Urbana-Champaign, Department of Computer Science, my MSc from the University of Southern California, Los Angeles , Department of Computer Science and my Diploma from the University of Patras, Department of Computer Engineering and Informatics. I stayed as a visiting faculty at the University of Illinois in 1998-99 before I joined UofT in August 1999. In the past, I also held faculty positions at the Athens University of Economics and Business and at the University of Tokyo . In 2020-21 I was commissioned by the Bank of Canada to co-author a technical, legal and economic report on Canada's candidate digital currency. This report for a Central Bank Digital Loonie can be found here . I was honored to be acknowledged for my contribution to a classified report by the Hoover Institution, edited by Darrell Duffie & Elizabeth Economy, prefaced by former US Secretary of the State Condoleezza Rice, and co-authored by an extensive list of world-thinkers. This report, released March 1, 2022 and titled ``Digital Currencies: The US, China, And The World At A Crossroads'' can be found here . A week later, President Biden signed Executive Order 14607 following recommendations of this report. As I worked in the entertainment industry for many years, I was part of a small team that conducted the first webcast (video and audio) ever over the internet (37th Annual Grammy Awards, March 1, 1995), an event that was later acknowledged by the American Congress. In 2013 I was nominated for the Bower Award and Price in Science by Turing Award recipient Prof. Stephen Cook for contributions in the area of verification. My group has received many best paper awards, more notably, at ASP-DAC 2014 with a \"Ten Year Retrospective Most Influential Paper\" award, and at ICSE 2024 with the flagship ACM SIGSOFT Distinguished Paper Award. I have also contributed to writings by the International Monetary Fund, the Bank of International Settlements and the Centre for International Governance Innovation. Our research has been privileged to have received gifts by Ripple (UBRI), Huawei, and IBM, among others. I am currently an Associate Editor of the IEEE Trans. on Network and Service Management, and a member of the Steering Committee for the IEEE Int'l Conference on Blockchain and Cryptocurrency, and IEEE Conference on Blockchain Research & Applications for Innovative Networks and Services. I hold memberships in AAAS, ACM, AMS, IEEE, the Technical Chamber of Greece, TTTC, Professional Engineers of Ontario, and the Planetary Society. I am an alumnus of the Japanese Society for the Promotion of Science and serve on the Advisory Board of the Canadian Forum for Financial Markets (CFFiM). I am also a member of the Bretton Woods Committee. Links Conference, Journal and Book Publications Current and Former Research Projects Current and Former Students Research Sponsors and Partners Courses ECE 345: Algorithms and Data Structures (undergraduate) ECE358: Foundations of Computing (undergraduate) APS 105: Computer Fundamentals CSC 467: Compilers and Interpreters ECE 242: Algorithms and Data Structures (undergraduate, not offered, replaced by ECE-345) ECE 1767: Design for Test and Testability ECE 1762: Algorithms and Data Structures (graduate) Contact Information Address: Edward S. Rogers Sr. Department of Electrical and Computer Engineering, University of Toronto, Sandford Fleming Bldg , Room 2001 10 King's College Road Toronto, Ontario M5S 3G4 Phone: (416) 946-3062 Fax: (416) 971-2326 Email: veneris Administrator: Mrs. Shania Dela Paz, shania.delapazutoronto.ca (416-946-8094) University of Toronto ò Computer Engineering Research Group (EECG)",
  "content_length": 4627,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:59"
}