{
  "name": "Andrew C. Doxey",
  "homepage": "http://doxey.uwaterloo.ca",
  "status": "success",
  "content": "Andrew Doxey | Biology | University of Waterloo Skip to main content Andrew Doxey Associate Professor, University Research Chair, Biology Core Facility Director Email: acdoxey@uwaterloo.ca Location: B1 166A Phone: 519-888-4567 x33889 Doxey Lab Biography Due to continual advances in sequencing and other “omics” technologies, biology is experiencing a big data revolution. Computational methods are required not only to interpret newly sequenced genomes, but search through a vast quantity of existing biological information to reveal previously uncharacterized functionality. The Doxey lab is interested in both the development and application of computational methods to predict novel molecular functions (protein-coding and non-coding) from genomic, structural, and other high-throughput datasets. We explore three separate but overlapping areas: *Predicting novel protein families and functions: We develop methods that combine sequence analysis with structural bioinformatics to predict and experimentally validate protein functions of interest. Currently, we are focusing efforts on predicting new families and functions of bacterial flagellins, clostridial toxins, and proteolytic enzymes. *Predicting evolutionary adaptations in genes and genomes: We combine sequence analysis, phylogenetics and structural modeling to pinpoint adaptive events in genes and genomes. We are interested in inferring mechanisms of neofunctionalization and functional divergence in protein families as well as non-coding regulatory elements. *Comparative functional metagenomics: The Doxey Lab is also developing computational approaches to functionally annotate metagenomes and detect biologically relevant differences between them. Recent work includes the development of the MetAnnotate framework for combined taxonomic and functional profiling of metagenomic datasets. Professor Doxey actively seeks eager and talented graduate or undergraduate students interested in bioinformatics, genomics, or molecular biology. Research Interests Bioinformatics Computational Biology Contamination & Remediation: Water, Soil, Air Bioinformatics, Systematics and Evolution Molecular Genetics Microbiology Education 2010 Ph.D. Bioinformatics, University of Waterloo, Canada 2005 B.Sc. Biology, University of Waterloo, Canada Awards 2017 Outstanding Performance Award 2010-2012 NSERC Postdoctoral Fellowship (PDF) 2010 Governor General’s Gold Medal for top Ph.D., University of Waterloo 2010 W.B. Pearson Medal for Creative Doctoral Research, University of Waterloo Professional Associations International Society for Computational Biology American Association for the Advancement of Science Affiliations and Volunteer Work Centre for Bioengineering and Biotechnology Waterloo Centre for Microbial Research (member) Teaching* BIOL 266 - Introduction to Computational Biology Taught in 2020, 2021, 2022, 2024, 2025 BIOL 469 - Genomics Taught in 2020, 2021, 2022, 2024, 2025 BIOL 614 - Applied Bioinformatics and Genomics Taught in 2020, 2022, 2023, 2025 * Only courses taught in the past 5 years are displayed. Selected/Recent Publications Please see the Doxey Lab website for a current list of his peer-reviewed articles: https://doxeylab.org/research/ Graduate studies",
  "content_length": 3245,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:27"
}