{
  "name": "Andrew C. Freeman",
  "homepage": "https://acfreeman.dev",
  "status": "success",
  "content": "About me | acfreeman dev Andrew C. Freeman, computer science researcher and educatorI’m an Assistant Professor of Computer Science at Baylor University. I got my PhD at the University of North Carolina at Chapel Hill, under the advisement of Ketan Mayer-Patel and Montek Singh. Before that, I got a B.S. in Computer Science and Mathematics from Samford University in Birmingham, Alabama. And before that, I grew up near Dallas, Texas.My research focuses on multimedia systems. I’m exploring asynchronous event representations for video, event compression, and event applications.This site was built on Jekyll with the Ultra theme, hosted on GitHub Pages. I don’t update this site very often.ContactMy probably-outdated CV is available here.E-mail me for research reasons (see notes on the lab page if you’re a graduate applicant): andrew_freeman@baylor.eduE-mail me for work reasons (e.g., consulting): acfreeman.work@gmail.comE-mail me for personal reasons: acfreemantx@gmail.comFollow my development work on GitHubAdd me on LinkedInI don’t use Twitter/X, Bluesky, or Mastadon.Mentoring & CollaborationUndergraduate/Graduate StudentsMy current and former Baylor research lab members are listed on the lab page.During my time at UNC, I had the pleasure of working with and mentoring many other students/academics in research. Some of those students include:Eric Schneider (MS student)Noah Green (BS student)Finn Stewart James (BS student)Chris Burgess (MS student)Felipe Chiavegatto (BS student)Rahul Patel (PhD student, Zylka Lab)In addition, I led four teams of undergraduate learning assistants during my first two years of graduate school.Polygence (High School Students)I mentor high school research projects through the Polygence platform.Students mentored for full research projects:Jyotsna Raghavan, Cornell University Class of 2027Rishit ShiramshettiSam NewmarkRaghav SareenAustin HanThrough the Polygence Pathfinders program, I have also met individually with 30+ high school students to discuss the world of computer science studies, job opportunities, research, and college applications.",
  "content_length": 2099,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:25"
}