{
  "name": "Andrea Schalk",
  "homepage": "https://www.research.manchester.ac.uk/portal/andrea.schalk.html",
  "status": "success",
  "content": "Andrea Schalk - Research Explorer The University of Manchester Andrea Schalk Dr Lecturer, Formal Methods https://orcid.org/0000-0003-2300-0962 Personal profile OpportunitiesPostgraduate OpportunitiesI have supervised three PhD  and three MSc students who all successfully completed their degrees. The last of the former has now successfully defended his thesis. I always welcome enquiries by potential PhD students. However, since my research is mathematical in nature I am looking for students who have a background in mathematics rather than computer science. While modelling programs and proofs may sound like applied mathematics (and it  is) the methods used are typically more familiar from pure mathematics.  I am not too concerned about  any particular knowledge since it  usually takes part of the first year of a PhD to acquire the background required to begin carrying out research. A good start would be the MSc in Mathematical Logic and the Theory of Computation on which I teach. A general introduction into pursuing a PhD at the School of Computer Science is available here.  Specific enquiries may also be directed to me personally.My groupResearch Group(s)Formal MethodsMathematical FoundationsBiographyI am a senior lecturer in the Department of Computer Science, working mostly on abstract models of logics and computuation. I hold a PhD equivalent Doktor rer. nat. from the Technical University Darmstadt, where I also received my first degree of Diplom-Mathematikering at the Department of Mathematics. Before coming here I briefly was a lecturer at the School of Computer Science at the University of Birmingham, and before that a research associate at the Department of Pure Mathematics and Mathematical Statistics (known in short as DPMMS) at the University of Cambridge where I worked with Martin Hyland on an EPSRC project entitled \"Uniform Game Semantics for Computational Reasoning\". Before that I had a Marie Curie grant  held at the Computer Laboratory at  the University of Cambridge. I have served as a referee for most of the journals and conferences in my area, and for the EPSRC; I was also a member of their Peer Review College for three years. I am a member of the steering committee and programme committee for the Workshop on Games for Logic and Programming Languages. I have received invitation to speak nationally and internationally in locations such as Bath, Oxford, Liverpool, Ottawa, Montreal, Calgary, Paris and Amsterdam.Research interests My research is concerned with the mathematical foundations of computer science, or, if you will, it is the area between mathematics and computer science. I am interested in modelling logics and (programming) languages, and mathematical structures that arise as such models. I am a member of the School of Computer Science, and I also have connections with the School of Mathematics. I work most closely with other members of the Mathematical Foundations Group. My recent publications are concerned with various categorical models of linear logic, and with games. The former makes connections between mathematical entities called morphisms and proofs, and these in turn can sometimes be connected with programs, or algorithms. Ultimately we would like to have a mathematical understanding of computer programs in the way that we have a mathematical understanding of the various phenomena that physics talks about. On a more concrete level I have given specific models of progams and proofs using certain kinds of games which are known as graph games. All my work is theoretical, and so typical results consist of proofs that there is a correspondence between certain entities that exist in the mathematical model and proofs or programs. Areas of expertiseQA75 Electronic computers. Computer sciencecategory theoryLogicmodels of computation Fingerprint Dive into the research topics where Andrea Schalk is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 5 Similar Profiles Linear Logic Mathematics 100% Multiplicative Mathematics 28% Biproduct Mathematics 17% Functor Mathematics 14% Tensor Mathematics 14% Poset Mathematics 14% Valued Set Mathematics 14% Calculus Mathematics 14% View full fingerprint Research output 6 Article 5 Conference contribution 1 Other 1 Web publication/site Research output per year Research output per year Mid-Semester Surveys Case StudiesLe Normand, A., Simmons, M., Schalk, A., Weise, N., Walker, L. & Weightman, A., 5 Oct 2023Research output: Non-textual form › Web publication/site A Category Theoretic Interpretation of Gandy’s Principles for MechanismsRazavi, J. & Schalk, A., 1 Feb 2019, (Accepted/In press) Electronic Proceedings in Theoretical Computer Science.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Functor 100% Model of Computation 33% Constructing Fully Complete Models of Multiplicative Linear LogicSchalk, A. & Steele, H. P., 3 Sept 2015, In: Logical Methods in Computer Science. 11, 3, p. 1-72 71 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Multiplicative 100% Linear Logic 100% Calculus 50% Tensor 50% Biproduct 50% 106 Downloads (Pure) Constructing fully complete models for multiplicative linear logicSchalk, A. & Steele, H., 2012, Proceedings of the 2012 27th Annual ACM/IEEE Symposium on Logic in Computer Science, LICS 2012|Proc. Annu. ACM/IEEE Symp. Logic Comput. Sci., LICS. http://www.computer.org/portal/site/store/index.jsp: IEEE, p. 571-580 9 p.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review File Multiplicative 100% Linear Logic 100% Calculus 50% Tensor 50% Biproduct 50% 433 Downloads (Pure) Introduction to Game SemanticsSchalk, A., Jun 2012.Research output: Contribution to conference › Other Unsolved Problem 100% View all 13 research outputs",
  "content_length": 5887,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:53"
}