{
  "name": "Andrew D. Ker",
  "homepage": "http://www.cs.ox.ac.uk/andrew.ker/home.html",
  "status": "success",
  "content": "Department of Computer Science, University of Oxford: Andrew D. Ker Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyAndrew D. Ker Andrew D. Ker Position University Lecturer in Computer Security, Oxford University Department of Computer Science, 2009- Tutorial Fellow in Computer Science, University College, Oxford, 2009- Background BA in Mathematics & Computer Science, University College, Oxford, 1994-1997 DPhil in Computer Science, University College and Merton College, Oxford, 1997-2000 Junior Research Fellow, University College, Oxford, 2000-2003 Special Supernumerary Fellow, University College, Oxford, 2003-2009 Royal Society University Research Fellow, 2003-2011 Research I work in information hiding, particularly steganography (hiding secret messages in digital media) and steganalysis (detecting that data has been hidden). You can hear a recording of me talking about my research, in terms suitable for the general public, at the Royal Society in one of their Café Scientifique evenings. My most recent work has been on the mathematical foundations of these disciplines and the \"square root law of capacity\". I am also interested in digital media forensics. My first research, and doctoral thesis, was on the semantics of programming languages. Follow this link for my publications. Graduate Supervision and Internships I am willing to take on selected students for DPhil (PhD) study: please read this page before approaching me. I also supervise a few internal MSc and undergraduate projects in the department of Computer Science, advertised internally in the usual way. I am not accepting interns at this time. Teaching I am on sabbatical in Michaelmas Term (autumn) 2016 and Hilary Term (spring) 2017. In the past I have lectured on steganography and steganalysis in a course called Advanced Security, as well as Computer Security, Discrete Mathematics, and Lambda Calculus and Types. As the tutorial fellow at University College, I am responsible for all undergraduates in Computer Science, Maths & Computer Science, and Computer Science & Philosophy; University College is particularly well-appointed with tutors in these subjects. I teach many of the first and second year Computer Science courses myself, and somtimes probability, statistics, or pure maths. If you are thinking of applying, I recommend reading the Computer Science Department and University College admissions pages. Selected Professional Activities Associate Editor, IEEE Transactions on Information Forensics and Security, 2016-. Area Editor, IET Information Security, 2008-2011. Publications chair, 8th IEEE International Workshop on Information Forensics and Security WIFS 2016. Programme committee member, IS&T Electronic Imaging: Media Watermarking, Security, and Forensics 2017. Past programme committees: IS&T Electronic Imaging: Media Watermarking, Security, and Forensics 2016; 4th ACM Workshop on Information Hiding & Multimedia Security IH&MMSec16; SPIE/IS&T Electronic Imaging: Media Watermarking, Security, and Forensics 2015; 3rd ACM Workshop on Information Hiding & Multimedia Security IH&MMSec15; 19th International Conference on Financial Cryptography and Data Security FC2015; 39th IEEE International Conference on Acoustics, Speech, and Signal Processing ICASSP 2014; SPIE/IS&T Electronic Imaging: Media Watermarking, Security, and Forensics 2014; 2nd ACM Workshop on Information Hiding & Multimedia Security IH&MMSec14; SPIE/IS&T Electronic Imaging: Media Watermarking, Security, and Forensics 2013; 1st ACM Workshop on Information Hiding & Multimedia Security IH&MMSec13; SPIE/IS&T Electronic Imaging: Media Watermarking, Security, and Forensics XIV 2012; 4th IEEE International Workshop on Information Forensics and Security WIFS 2012; 14th ACM Workshop on Multimedia & Security MM&Sec12; 14th Information Hiding Conference IH 2012; IEEE International Conference on Multimedia and Expo ICME 2011; 13th ACM Workshop on Multimedia & Security MM&Sec11; SPIE/IS&T Electronic Imaging: Media Watermarking, Security, and Forensics XIII 2011; 2nd IEEE International Workshop on Information Forensics and Security WIFS 2010; 9th International Workshop on Digital Watermarking IWDW 2010; 12th ACM Workshop on Multimedia & Security MM&Sec10; SPIE/IS&T Electronic Imaging: Media Forensics and Security XII 2010; 3rd International Conference on Imaging for Crime Detection and Preventation ICDP-09; 11th ACM Workshop on Multimedia & Security MM&Sec09; SPIE/IS&T Electronic Imaging: Media Forensics and Security XI 2009; 8th International Workshop on Digital Watermarking IWDW 2009; 7th International Workshop on Digital Watermarking IWDW 2008; International Conference on Forensics Applications and Techniques eForensics 2008; Data Hiding for Information and Multimedia Security, attached to IAS 2007; General chair & local arrangements, 10th ACM Workshop on Multimedia & Security MM&Sec08. Programme co-chair, 13th Information Hiding Conference IH 2011. Invited keynote speaker, ISIS Special Meeting on Steganography & Steganalysis, 2010. Slides of presentation. Internal seminar, Presentation Skills for undergraduate and graduate students, 2010-2016. Slides of presentation. Lecturer, International School on Foundations of Security Analysis and Design FOSAD 2008. Slides of seminars part 1 part 2. Other Interests I am a musician, specifically a conductor, percussionist, and baritone. I direct a choir that rehearses and performs in University vacations called Intermezzo. I occasionally play percussion in the University Orchestras in Oxford and am somewhat involved in the administration of the Oxford University orchestras. Depending on how industrious they have been recently, you might find up-to-date information on the Oxford University Music Society web site. Trivia My surname is properly pronounced \"car\". About UsPeopleFaculty Andrew D. Ker Publications Students' Dissertations Graduate Study ResearchStudentsAdmin & SupportVacanciesHistoryContact Us Back to Top",
  "content_length": 6028,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:29"
}