{
  "name": "Andrew Quinn 0001",
  "homepage": "https://arquinn.github.io",
  "status": "success",
  "content": "Andi Quinn Hi, I'm Andi! 👋 Welcome to my little corner of the Internet. About I am a transwoman 🏳️‍⚧️ from Santa Cruz, California 🏄‍♀️. This website is about the professional work that I do as an assistant professor of Computer Science and Engineering at the University of California, Santa Cruz. I went by another name for the first 33 years of my life, Andrew Quinn, so you might see something about me with that name instead. I lead a research lab at UCSC, internally called SLUGLab 🐌, which works on projects to make software systems more reliable. I also help lead the Center for Research in Systems and Storage (CRSS), which works on improving storage for new workloads (e.g., machine learning) and new technologies (e.g., far memory). Overall, my students and I like to build software systems that help other developers build better software systems. Right now, we're building systems to help with debugging, securing system storage, extending applications, exploiting far-memory technology, using shared libraries, and improving Kubernetes reliability. News 05/2025 Congrats to my first PhD graduate, Farid Zakaria! 🎓 Farid’s dissertation exploits modern software engineering best practices to redesign and improve the efficiency and reliability of low-level system software like shared libraries and dynamic loaders. He writes passionately about his work in his blog; check it out! 04/2025 My NSF Career award was accepted for funding! 💰 We plan to improve software debugging by making it easier for developers to interact with their “execution artifacts”—the process states that a developer captures during execution. 03/2025 My Student, Yiwei Yang, presented two (!) work in progress projects at the HCDS workshop collocated with ASPLOS and Eurosys 2025. The projects work on tracing and observability for CXL pooling systems and GPUs. Particularly impressive, Yiwei and her other coauthors did most of the work themselves 💁‍♀️! Congrats! 03/2025 Our paper on bpftime got into OSDI! The work proposes a new interface and system implementation to enable safer and more efficient extensions to userspace applications. Congrats to Yusheng Zheng, who led the work! 🥳 02/2025 Pathfinder was accepted at OOPSLA ‘25! 🙌 The work prestents representative testing, a new technique that scales crash-consistency testing by identifying and testing crash states that are representative rather than testing all possible crash states. This work was a long time in the making and represents many hours of blood, sweat, and tears. Congrats to all my coauthors! Team Active Yusheng Zheng Leo Conrad-Shah Yiwei Yang Tim Goodwin Eugene Chou Pooneh Safayenikoo Alumni Mitchel Elliot (masters, 2025) Farid Zakaria (PhD, 2025) Brian Zhao (masters, 2025) Charitha Bandi (masters, 2022) Ananya Das (masters, 2022) Teaching I've taught three classes while at UC Santa Cruz: CSE 231: Advanced Operating systems (Graduate OS), CSE 130: Principles of Computer System Design, and CSE 134: Embedded Operating Systems. The CSE department maintains an up-to-date course schedulex that identifies the quarters in which I will be teaching each course. CSE 231: Advanced Operating Systems We discuss the issues facing operating systems with a focus on historical context. I structure this course as a seminar: we read papers, discuss papers, and students complete a final course project. I taught 231 in the Fall 2021, Fall 2022, Winter 2024, and Spring 2025. CSE 130: Principles of Computer System Design We discuss the challenges of building large and complex computer systems; overall, the goal of the course is help students go from working with self-contained algorithms and ADTs to designing/implementing large software systems. The course describes modularity, client-server design, virtualization, concurrency/synchronization, and performance analysis. I taught CSE 130 in Spring 2022, Winter 2023, Fall 2023, and Fall 2024. I also serve as the academic coordinator for the course when I am not teaching it. CSE 134: Embedded Operating Systems. We discuss the challenges of building operating systems (the class originally discussed these challenges in the context of embedded systems, but I prefer to provide a more general treatment). The course covers the system call interface, virtual memory, and file systems. It includes a term-long project in which students work in pairs to add core functionality to an operating system (PintOS). I taught CSE 134 in Spring 2024. Publications Conferences OOPSLA Scalable and Accurate Application-Level Crash-Consistency Testing via Representative Testing. Yile Gu, Ian Neal, Jiexiao Xu, Shaun Christopher Lee, Ayman Said, Musa Haydar, Jacob Van Geffen, Rohan Kadekodi, Andi Quinn, Kasikci, Baris. In Proceedings of the ACM on Programming Languages, Volumn 9, Issue OOPSLA.. April 2025 Abs Crash consistency is essential for applications that must persist data. Crash-consistency testing has been commonly applied to find crash-consistency bugs in applications. The crash-state space grows exponentially as the number of operations in the program increases, necessitating techniques for pruning the search space. However, state-of-the-art crash-state space pruning is far from ideal. Some techniques look for known buggy patterns or bound the exploration for efficiency, but they sacrifice coverage and may miss bugs lodged deep within applications. Other techniques eliminate redundancy in the search space by skipping identical crash states, but they still fail to scale to larger applications. In this work, we propose representative testing: a new crash-state space reduction strategy that achieves high scalability and high coverage. Our key observation is that the consistency of crash states is often correlated, even if those crash states are not identical. We build Pathfinder, a crash-consistency testing tool that implements an update behaviors-based heuristic to approximate a small set of representative crash states. We evaluate Pathfinder on POSIX-based and MMIO-based applications, where it finds 18 (7 new) bugs across 8 production-ready systems. Pathfinder scales more effectively to large applications than prior works and finds 4x more bugs in POSIX-based applications and 8x more bugs in MMIO-based applications compared to state-of-the-art systems. OSDI Extending Applications Safely and Efficiently. Yusheng Zheng, Tong Yu, Yiwei Yang, Yanpeng Hu, Xiaozheng Lai, Dan Williams, Andi Quinn. In Proceedings of the 19th USENIX Symposium on Operating Systems Design and Implementation. July 2025 ISSTA Distinguished Artifact GPUHarbor: Testing GPU Memory Consistency At Large (Experience Paper). Reese Levine, Mingun Cho, Devon McKee, Andi Quinn, Tyler Sorensen. In Proceedings of the 32nd ACM SIGSOFT International Symposium on Software Testing and Analysis and Implementation. July 2023 Abs Memory consistency specifications (MCSs) are a difficult, yet critical, part of a concurrent programming framework. Existing MCS testing tools are not immediately accessible, and thus, they have only been applied to a limited number of platforms. However, in the post-Dennard scaling landscape, there has been an explosion of new architectures and frameworks, especially for GPUs. Studying the shared memory behaviors of different devices (across vendors and architecture generations) is important to ensure conformance and to understand the extent that devices show different behaviors. In this paper, we present GPUHarbor, a widescale GPU MCS testing tool. GPUHarbor has two interfaces: a web interface and an Android app. Using GPUHarbor, we deployed a testing campaign that checks conformance and characterizes weak behaviors. We advertised GPUHarbor on forums and social media, allowing us to collect testing data from 106 devices, spanning seven vendors. In terms of devices tested, this constitutes the largest study on weak memory behaviors by at least 10×, and our conformance tests identified two new bugs on embedded Arm and NVIDIA devices. Analyzing our characterization data yields many insights, including quantifying and comparing weak behavior occurrence rates (e.g., AMD GPUs show 25.3× more weak behaviors on average than Intel). We conclude with a discussion of the impact our results have on software development for these performance-critical devices. ASPLOS Vidi: Record Replay for Reconfigurable Hardware. Gefei Zuo, Jiacheng Ma, Andi Quinn, Baris Kasikci. In Proceedings of the 28th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, Volume 3. March 2023 Abs ASPLOS Distinguished Paper Distinguished Artifact MC Mutants: Evaluating and Improving Testing for Memory Consistency Specifications. Reese Levine, Tianhao Guo, Mingun Cho, Allen Baker, Raph Levien, David Neto, Andi Quinn, Tyler Sorensen. In Proceedings of the 28th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, Volume 2. March 2023 Abs Shared memory platforms provide a memory consistency specification (MCS) so that developers can reason about the behaviors of their parallel programs. Unfortunately, ensuring that a platform conforms to its MCS is difficult, as is exemplified by numerous bugs in well-used platforms. While existing MCS testing approaches find bugs, their efficacy depends on the testing environment (e.g. if synthetic memory pressure is applied). MCS testing environments are difficult to evaluate since legitimate MCS violations are too rare to use as an efficacy metric. As a result, prior approaches have missed critical MCS bugs. This work proposes a mutation testing approach for evaluating MCS testing environments: MC Mutants. This approach mutates MCS tests such that the mutants simulate bugs that might occur. A testing environment can then be evaluated using a mutation score. We utilize MC Mutants in two novel contributions: (1) a parallel testing environment, and (2) An MCS testing confidence strategy that is parameterized over a time b",
  "content_length": 29314,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:43"
}