{
  "name": "Andrés Goens",
  "homepage": "https://www.uva.nl/en/profile/g/o/a.w.goens-jokisch/a.w.goens-jokisch.html",
  "status": "success",
  "content": "Prof. dr. A.W. (Andres) Goens Jokisch - University of Amsterdam Prof. dr. A.W. (Andres) Goens Jokisch Faculty of Science Informatics Institute Visiting address Science Park 900 Postal address Postbus 94323 1090 GH Amsterdam Contact details a.goens@uva.nl Social media Linkedin Homepage Personal Homepage of Andrés Goens Publications refereed (37) 2025 Castrillon, J., Desnos, K., Goens, A., & Menard, C. (2025). Dataflow models of computation for programming heterogeneous multicores. In A. Chattopadhyay (Ed.), Handbook of Computer Architecture (pp. 1107-1146). Springer. https://doi.org/10.1007/978-981-97-9314-3_45 [details] Schneider, R., Rossel, M., Shaikhha, A., Goens, A., Kœhler, T., & Steuwer, M. (2025). Slotted E-Graphs First-Class Support for (Bound) Variables in E-Graphs. Proceedings of the ACM on Programming Languages, 9(PLDI), 1888-1910. Article 223. https://doi.org/10.1145/3729326 [details]Download 2024 Bhat, S., Keizer, A., Hughes, C., Goens, A., & Grosser, T. (2024). Verifying Peephole Rewriting in SSA Compiler IRs. In Y. Bertot, T. Kutsia, & M. Norrish (Eds.), 15th International Conference on Interactive Theorem Proving, ITP 2024 Article 9 (Leibniz International Proceedings in Informatics, LIPIcs; Vol. 309). Schloss Dagstuhl - Leibniz-Zentrum für Informatik. https://doi.org/10.4230/LIPIcs.ITP.2024.9 Fernández Mir, R., Jackson, P. B., Bhat, S., Goens, A., & Grosser, T. (2024). Transforming Optimization Problems into Disciplined Convex Programming Form. In A. Kohlhase, & L. Kovács (Eds.), Intelligent Computer Mathematics: 17th International Conference, CICM 2024, Montréal, QC, Canada, August 5–9, 2024 : proceedings (pp. 183-202). (Lecture Notes in Computer Science; Vol. 14960), (Lecture Notes in Artificial Intelligence). Springer. https://doi.org/10.1007/978-3-031-66997-2_11 [details]Download Kœhler, T., Goens, A., Bhat, S., Grosser, T., Trinder, P., & Steuwer, M. (2024). Guided Equality Saturation. Proceedings of the ACM on Programming Languages, 8(POPL), Article 58. https://doi.org/10.1145/3632900 [details]Downloadspopl24-camera-readyGuided Equality Saturation Li, W., Goens, A., Oswald, N., Nagarajan, V., & Sorin, D. J. (2024). Determining the Minimum Number of Virtual Networks for Different Coherence Protocols. In Proceeding - 2024 ACM/IEEE 51st Annual International Symposium on Computer Architecture, ISCA 2024 (pp. 182-197). Institute of Electrical and Electronics Engineers Inc.. https://doi.org/10.1109/ISCA59077.2024.00023 Rossel, M., Lin, S. J., Lohstroh, M., Castrillon, J., & Goens, A. (2024). Provable Determinism for Software in Cyber-Physical Systems. In A. Reynolds, & S. Tasiran (Eds.), Verified Software : Theories, Tools and Experiments: 15th International Conference, VSTTE 2023, Ames, IA, USA, October 23–24, 2023 : revised selected papers (pp. 85–107). (Lecture Notes in Computer Science; Vol. 14095). Springer. https://doi.org/10.1007/978-3-031-66064-1_6 [details]Download Zhang, A. Q., Goens, A., Oswald, N., Grosser, T., Sorin, D., & Nagarajan, V. (2024). PipeGen: Automated Transformation of a Single-Core Pipeline into a Multicore Pipeline for a Given Memory Consistency Model. In PACT 2024 - Proceedings of the 2024 International Conference on Parallel Architectures and Compilation Techniques Institute of Electrical and Electronics Engineers Inc.. https://doi.org/10.1145/3656019.3676889 2023 Goens, A., Chakraborty, S., Sarkar, S., Agarwal, S., Oswald, N., & Nagarajan, V. (2023). Compound Memory Models. Proceedings of the ACM on Programming Languages, 7(PLDI), Article 153. https://doi.org/10.1145/3591267 2022 Goens, A., & Castrillon, J. (2022). Embeddings of Task Mappings to Multicore Systems. In A. Orailoglu, M. Jung, & M. Reichenbach (Eds.), Embedded Computer Systems: Architectures, Modeling, and Simulation - 21st International Conference, SAMOS 2021, Proceedings (pp. 161-176). (Lecture Notes in Computer Science; Vol. 13227). Springer. https://doi.org/10.1007/978-3-031-04580-6_11 Goens, A., Nicolai, T., & Castrillon, J. (2022). mpsym: Improving Design-Space Exploration of Clustered Manycores With Arbitrary Topologies. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, 41(6), 1592-1605. https://doi.org/10.1109/TCAD.2021.3102512 2021 Brauckmann, A., Goens, A., & Castrillon, J. (2021). PolyGym: Polyhedral Optimizations as an Environment for Reinforcement Learning. In J. Lee, & A. Cohen (Eds.), Proceedings - 30th International Conference on Parallel Architectures and Compilation Techniques, PACT 2021 (pp. 17-29). Institute of Electrical and Electronics Engineers Inc.. https://doi.org/10.1109/PACT52795.2021.00009 Khasanov, R., Robledo, J., Menard, C., Goens, A., & Castrillon, J. (2021). Domain-specific Hybrid Mapping for Energy-efficient Baseband Processing in Wireless Networks. ACM Transactions on Embedded Computing Systems, 20(5s), Article 60. https://doi.org/10.1145/3476991 Menard, C., Goens, A., Hempel, G., Khasanov, R., Robledo, J., Teweleitt, F., & Castrillon, J. (2021). Mocasin-Rapid prototyping of rapid prototyping tools: A framework for exploring new approaches in mapping software to heterogeneous multi-cores. In Proceedings of the 2021 Drone Systems Engineering and Rapid Simulation and Performance Evaluation: Methods and Tools, DroneSE and RAPIDO 2021 (pp. 66-73). Association for Computing Machinery. https://doi.org/10.1145/3444950.3447285 2020 Brauckmann, A., Goens, A., & Castrillon, J. (2020). ComPy-Learn: A toolbox for exploring machine learning representations for compilers. In Proceedings of the 2020 Forum on Specification and Design Languages, FDL 2020 Article 9232946 IEEE Computer Society Press. https://doi.org/10.1109/FDL50818.2020.9232946 Brauckmann, A., Goens, A., Ertel, S., & Castrillon, J. (2020). Compiler-based graph representations for deep learning models of code. In L.-N. Pouchet, & A. Jimborean (Eds.), CC 2020 - Proceedings of the 29th International Conference on Compiler Construction (pp. 201-211). Association for Computing Machinery. https://doi.org/10.1145/3377555.3377894 Khan, A. A., Goens, A., Hameed, F., & Castrillon, J. (2020). Generalized Data Placement Strategies for Racetrack Memories. In G. Di Natale, C. Bolchini, & E.-I. Vatajelu (Eds.), Proceedings of the 2020 Design, Automation and Test in Europe Conference and Exhibition, DATE 2020 (pp. 1502-1507). Article 9116245 Institute of Electrical and Electronics Engineers Inc.. https://doi.org/10.23919/DATE48585.2020.9116245 Lohstroh, M., Romeo, Í. Í., Goens, A., Derler, P., Castrillon, J., Lee, E. A., & Sangiovanni-Vincentelli, A. (2020). Reactors: A Deterministic Model for Composable Reactive Systems. In R. Chamberlain, M. Edin Grimheden, & W. Taha (Eds.), Cyber Physical Systems. Model-Based Design - 9th International Workshop, CyPhy 2019, and 15th International Workshop, WESE 2019, Revised Selected Papers (pp. 59-85). (Lecture Notes in Computer Science; Vol. 11971). Springer. https://doi.org/10.1007/978-3-030-41131-2_4 Menard, C., Goens, A., Lohstroh, M., & Castrillon, J. (2020). Achieving Determinism in Adaptive AUTOSAR. In G. Di Natale, C. Bolchini, & E.-I. Vatajelu (Eds.), Proceedings of the 2020 Design, Automation and Test in Europe Conference and Exhibition, DATE 2020 (pp. 822-827). Article 9116430 Institute of Electrical and Electronics Engineers Inc.. https://doi.org/10.23919/DATE48585.2020.9116430 Wittig, R., Goens, A., Menard, C., Matus, E., Fettweis, G. P., & Castrülon, J. (2020). Modem design in the era of 5G and beyond: The need for a formal approach. In Proceedings of the 2020 27th International Conference on Telecommunications, ICT 2020 Article 09239538 Institute of Electrical and Electronics Engineers Inc.. https://doi.org/10.1109/ICT49546.2020.9239539 2019 Ertel, S., Adam, J., Rink, N. A., Goens, A., & Castrillon, J. (2019). Stclang: State thread composition as a foundation for monadic dataflow parallelism. In R. A. Eisenberg (Ed.), Haskell 2019 - Proceedings of the 12th ACM SIGPLAN International Symposium on Haskell, co-located with ICFP 2019 (pp. 146-161). Association for Computing Machinery. https://doi.org/10.1145/3331545.3342600 Goens, A., Cummins, C., Brauckmann, A., Leather, H., Ertel, S., & Castrillon, J. (2019). A case study on machine learning for synthesizing benchmarks. In T. Mattson, A. Muzahid, & A. Solar-Lezama (Eds.), MAPL 2019 - Proceedings of the 3rd ACM SIGPLAN International Workshop on Machine Learning and Programming Languages, co-located with PLDI 2019 (pp. 38-46). Association for Computing Machinery. https://doi.org/10.1145/3315508.3329976 Goens, A., Menard, C., & Castrillon, J. (2019). On compact mappings for multicore systems. In D. N. Pnevmatikatos, M. Pelcat, & M. Jung (Eds.), Embedded Computer Systems: Architectures, Modeling, and Simulation - 19th International Conference, SAMOS 2019, Proceedings (pp. 325-335). (Lecture Notes in Computer Science; Vol. 11733). Springer. https://doi.org/10.1007/978-3-030-27562-4_23 Lohstroh, M., Schoeberl, M., Goens, A., Wasicek, A., Gill, C., Sirjani, M., & Lee, E. A. (2019). Invited: Actors revisited for time-critical systems. In Proceedings of the 56th Annual Design Automation Conference 2019, DAC 2019 Article a152 Institute of Electrical and Electronics Engineers Inc.. https://doi.org/10.1145/3316781.3323469 2018 Castrillon, J., Lieber, M., Kluppelholz, S., Volp, M., Asmussen, N., Asmann, U., Baader, F., Baier, C., Fettweis, G., Frohlich, J., Goens, A., Haas, S., Habich, D., Hartig, H., Hasler, M., Huismann, I., Karnagel, T., Karol, S., Kumar, A., ... Wunderlich, S. (2018). A hardware/software stack for heterogeneous systems. IEEE Transactions on Multi-Scale Computing Systems, 4(3), 243-259. Article 8103042. https://doi.org/10.1109/TMSCS.2017.2771750 Ertel, S., Adam, J., Goens, A., & Castrillon, J. (2018). Compiling for concise code and ecient I/O. In J. Xue, & C. Dubach (Eds.), CC 2018 - Proceedings of the 27th International Conference on Compiler Construction, Co-located with CGO 2018 (pp. 104-115). (",
  "content_length": 15837,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:20"
}