{
  "name": "Andrew Hamilton-Wright",
  "homepage": "https://www.uoguelph.ca/computing/people/andrew-hamilton-wright",
  "status": "success",
  "content": "Andrew Hamilton-Wright | School of Computer Science Andrew Hamilton-Wright Associate ProfessorEmail: andrew.hamilton-wright@uoguelph.caPhone number: x53290Office: Reynolds 2223Website links: Google Scholar Research StatementResearch KeywordsSelected Publications I use machine learning techniques in decision exploration systems. I am particularly interested in using rule-based association mining techniques to allow visual exploration of risk and certainty in decision making systems. Application areas are varied, but much of my work has been biophysical: electromyographic (EMG) based muscular disease characterization, EMG and postural fatigue and pain prediction, and EMG and force based characterization of sleep apnea. By combining rule based systems with statistical certainty, models of decision confidence can be created to allow contingent decision planning and exploration. I am primarily interested in exploring and visualizing these sorts of data domains. In addition, I have an interest in physiological models, such as my EMG simulator, for use in providing gold standard data for validation of EMG based techniques. decision support association mining machine learning disease characterization decision confidence visualization high-risk decision making decision exploration C. Young, A. Hamilton-Wright, M. L. Oliver, K. D. Gordon (2023), “Predicting Wrist Posture During Occupational Tasks Using Inertial Sensors and Convolutional Neural Networks,” Sensors, Manuscript ID: sensors-2119142 DOI: 10.3390/s23020942 K. Raymond, A. Hamilton-Wright (2022), “Unsupervised Electrodermal Data Analysis Comparison between Biopac and Empatica E4 Data Collection Platforms,” in 11th International Conference on Data Science, Technology and Applications (DATA 2022), Lisbon, Portugal, (poster). Winner of best poster award. K. Raymond, A. Hamilton-Wright, K. Thomassin (2022), “Time Series Heatmaps as a Visualization Approach to Clustering Biological Time Series Data,” in XXIVth Congress of the International Society of Electrophysiology and Kinesiology (ISEK’22), Que ́bec, Quebec, (oral). M. Govers, A. Hamilton-Wright, M. Hassan and M. L. Oliver (2022), “Real-time hazard detection in highly variable agricultural environments,” in Canadian Society for Bioengineering 2022 Annual General Meeting, (CSBE/SCGAB 2022), Charlottetown (oral). S. Habib, H. Khan, U. Hengartner, A. Hamilton-Wright, (2022), “Revisiting the Security of Bio- metric Authentication Systems Against Statistical Attacks,” in The Network and Distributed System Security Symposium 2022 (NDSS/22), San Diego (online oral) S. Habib, H. Khan, A. Hamilton-Wright, U. Hengartner (2022), “Revisiting the Security of Bio- metric Authentication Systems Against Statistical Attacks,” ACM Transactions on Privacy and Security, Manuscript ID: TOPS-2022-03-0043 DOI: 10.1145/3571743 S. J. Hawley, A. Hamilton-Wright, S. Fischer (2022), “Detecting subject-specific fatigue related changes in lifting kinematics using a machine learning approach,” Ergonomics, Taylor and Francis Manuscript ID: TERG-2021-0410 DOI: 10.1080/00140139.2022.2061052 M. Gharagozloo, A. Amrani, K. Whittingstall, A. Hamilton-Wright D. Gris, (2022), “Machine Learning in Modelling of Mouse Behavior,” Frontiers in Neuroscience: Sleep and Circadian Rhythms, Frontiers Neuroscience, Manuscript ID: 700253 DOI: 10.3389/fnins.2021.700253 C. Young, M. L. Oliver, A. Hamilton-Wright, K. D. Gordon (2021), “Predicting Knee Joint Angle During Gait Using Inertial Measurement Units And Deep Convolutional Neural Networks,” in 21stBiennialMeetingoftheCanadianSocietyforBiomechanics (CSB-SCB2020/21), Montréal, (online oral). J. Manokaray, F. Zabihollahy, A. Hamilton-Wright and E. Ukwatta (2021), “Detection of COVID- 19 from Chest X-ray Images using Transfer Learning,” 19th Annual IMNO Symposium, Imaging Network Ontario virtual symposium, (online oral). S. Hawley, A. Hamilton-Wright, S. Fischer (2021), “Detecting subject-specific fatigue related changes in lifting kinematics using a machine learning approach,” in 21th Triennial Congress of the International Ergonomics Association (IEA-2021), Vancouver, (online oral). J. Manokaray, F. Zabihollahy, A. Hamilton-Wright and E. Ukwatta (2021), “Detection of COVID- 19 from Chest X-ray Images using Transfer Learning,” Journal of Medical Imaging (in press). A. Hamilton-Wright, (2020), “Machine Learning + Data Science in Ergonomics,” in ACE 2020 Virtual Summit #industry4.0 (ACE’2020), (online oral). K. Raymond, A. Hamilton-Wright, N. L. Black, (2020), “Machine-Learning Insights for Postural Pattern Analysis,” in XXIIIth Congress of the International Society of Electrophysiology and Kinesiology (ISEK’20), Nagoya, Japan (online oral). K. Raymond, A. Hamilton-Wright, (2020), “Curtain Graphs: Using a Floating Baseline for Com- parison in a Two-Dimensional Graphical Space,” in Proceedings of the 15th Annual Joint Confer- ence Computer Vision, Imaging and Computer Graphics Theory and Applications (IVAPP’20), Valletta, Malta (oral). J. Beninger, A. Hamilton-Wright, H. E. K. Walker and L. Trick (2020), “Machine learning tech- niques to identify mind-wandering and predict hazard response time in fully immersive driving simulation” Soft Computing DOI: https://doi.org/10.1007/s00500-020-05217-8 K. Raymond, A. Hamilton-Wright, N. L. Black (2019), “Postural State Sequence Duration and Musculoskeletal Disorder Marker Perception at Sit-Stand Workstations,” in 50th Annual Conference of the Association of Canadian Ergonomists (ACE’19), St. John’s, (poster). J.Beninger,A.Hamilton-Wright,(2019),“Using Data Science to Reduce Battery Costs and Waste in Industrial Electric Vehicles,” In Beyond Business as Usual (Net Impact) Kingston, (oral) C. Young, M. L. Oliver, A. Hamilton-Wright, K. D. Gordon (2019), “Biomechanical Features To Characterize Individual Performance of Locomotor Activities of Daily Living,” in XXVII Congress of the International Society of Biomechanics (ISB2019), Calgary, (oral) Share this page Share on Facebook Share on Twitter Share on LinkedIn Print this page",
  "content_length": 6075,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:32"
}