{
  "name": "Andreas Koch 0001",
  "homepage": "https://www.esa.informatik.tu-darmstadt.de/team/ahk",
  "status": "success",
  "content": "Prof. Dr-Ing. Andreas Koch Technische Universität Darmstadt Computer Science Department (FB20) Embedded Systems & Applications Group (ESA) Hochschulstr. 10 D-64289 Darmstadt Phone: +49 6151 / 16-22420 Fax: +49 6151 / 16-22422 E-Mail: koch@esa.tu-darmstadt.de S2|02 Raum E101 Forschungsgebiete Andreas Koch befasst sich schwerpunktmäßig mit adaptiven Rechensystemen. Es handelt sich dabei um Computer, bei denen auch die Hardware in Teilaspekten dynamisch an die Erfordernisse der gerade ablaufenden Software angepasst werden kann. Die Palette der einzelnen Arbeitsgebiete reicht dabei von der Entwicklung geeigneter CAD-Werkzeuge (spezialisierte Compiler und Chip-Layoutwerkzeuge) über die Konzeption von Rechnerarchitekturen bis hin zum praktischen Aufbau und der Erprobung von Prototypensystemen. Daneben ist Herr Koch auch an objektorientierten Programmiersprachen und Software-Engineering interessiert. Lebenslauf 2005 Habilitation und Ruf an die TU Darmstadt 1999 Post-Doktorand (TU Braunschweig, EIS) 1997-1999 Post-Doktorand (UC Berkeley, Arbeitsgruppe BRASS) 1997 Promotion zum Dr.-Ing. (TU Braunschweig, EIS) 1992 Diplom in Informatik (TU Braunschweig) Publications Bernhardt, A., Tamimi, S., Stock, F., Koch, A., and Petrov, I. (2025). Update NDP: On Offloading Modifications to Smart Storage with Transactional Guarantees in Near-Data Processing DBMS. In ACM Transactions on Database Systems (TODS). Association for Computing Machinery. doi: 10.1145/3774753 Preprint DOI URL Bibtex @inproceedings{bernhardtTODS2025, author = {Bernhardt, Arthur and Tamimi, Sajjad and Stock, Florian and Koch, Andreas and Petrov, Ilia}, title = {Update NDP: On Offloading Modifications to Smart Storage with Transactional Guarantees in Near-Data Processing DBMS}, booktitle = {ACM Transactions on Database Systems (TODS)}, year = {2025}, preprint = {https://dblab.reutlingen-university.de/paper/2025_ACM_TODS_UpdateNDP.pdf}, doi = {10.1145/3774753}, publisher = {Association for Computing Machinery}, url = {https://doi.org/10.1145/3774753}, month = nov, keywords = {Database Systems on Smart Storage, Near-Data Processing} } Solis-Vasquez, L., Tillack, A. F., Santos-Martins, D., Forli, S., and Koch, A. (2025). Architecting Tensor Core-Based Reductions for Irregular Molecular Docking Kernels. In Proceedings of the Workshops of the International Conference for High Performance Computing, Networking, Storage and Analysis (SC Workshops ’25). Association for Computing Machinery. doi: 10.1145/3731599.3767437 Preprint DOI Slides Bibtex @inproceedings{solis2025ia3, author = {Solis-Vasquez, Leonardo and Tillack, Andreas F. and Santos-Martins, Diogo and Forli, Stefano and Koch, Andreas}, title = {Architecting Tensor Core-Based Reductions for Irregular Molecular Docking Kernels}, booktitle = {Proceedings of the Workshops of the International Conference for High Performance Computing, Networking, Storage and Analysis (SC Workshops '25)}, year = {2025}, publisher = {Association for Computing Machinery}, doi = {10.1145/3731599.3767437} } Strobl, J., Solis-Vasquez, L., Lavan, Y., and Koch, A. (2025). A Compute Graph Simulation and Implementation Framework Targeting AMD Versal AI Engines. In Proceedings of the Workshops of the International Conference for High Performance Computing, Networking, Storage and Analysis (SC Workshops ’25). Association for Computing Machinery. doi: 10.1145/3731599.3767411 Preprint DOI Bibtex @inproceedings{strobl2025h2rc, author = {Strobl, Jonathan and Solis-Vasquez, Leonardo and Lavan, Yannick and Koch, Andreas}, title = {A Compute Graph Simulation and Implementation Framework Targeting AMD Versal AI Engines}, booktitle = {Proceedings of the Workshops of the International Conference for High Performance Computing, Networking, Storage and Analysis (SC Workshops '25)}, year = {2025}, publisher = {Association for Computing Machinery}, doi = {10.1145/3731599.3767411} } Volz, D., Kalkof, T., and Koch, A. (2025). SNAcc: An Open-Source Framework for Streaming-based Network-to-Storage Accelerators. In Workshops of the International Conference for High Performance Computing, Networking, Storage and Analysis (SC Workshops ’25). doi: 10.1145/3731599.3767412 Preprint DOI Bibtex @inproceedings{dv2025h2rc, author = {Volz, David and Kalkof, Torben and Koch, Andreas}, booktitle = {Workshops of the International Conference for High Performance Computing, Networking, Storage and Analysis (SC Workshops '25)}, title = {SNAcc: An Open-Source Framework for Streaming-based Network-to-Storage Accelerators}, year = {2025}, volume = {}, number = {}, pages = {}, keywords = {FPGA;NVMe;Network;Streaming-based acceleration;Heterogeneous computing}, doi = {10.1145/3731599.3767412} } Damian-Kosterhon, B. M., Meisel, F., and Koch, A. (2025). SCAL: An Open-Source Scalable Core Adaptation Layer for Interfacing RISC-V ISA Extensions. In 2025 IEEE 36th International Conference on Application-specific Systems, Architectures and Processors (ASAP) (pp. 73–80). doi: 10.1109/ASAP65064.2025.00020 Preprint DOI Bibtex @inproceedings{md2025asap, author = {Damian-Kosterhon, Brindusa Mihaela and Meisel, Florian and Koch, Andreas}, booktitle = {2025 IEEE 36th International Conference on Application-specific Systems, Architectures and Processors (ASAP)}, title = {SCAL: An Open-Source Scalable Core Adaptation Layer for Interfacing RISC-V ISA Extensions}, year = {2025}, volume = {}, number = {}, pages = {73-80}, keywords = {Microarchitecture;Instruction sets;Semantics;Pipelines;Ecosystems;Systems architecture;Hazards;Resource management;SCAIE-V;ISAX;Portability;RISC-V}, doi = {10.1109/ASAP65064.2025.00020} } Damian-Kosterhon, B. M., Koch, A., Kosterhon, F., and Petrica, L. (2025). Improving mapping of convolutional neural networks on FPGAs through tailored macro sizes. In 2025 IEEE International Parallel and Distributed Processing Symposium Workshops (IPDPSW) (pp. 1208–1215). doi: 10.1109/IPDPSW66978.2025.00193 Preprint DOI Bibtex @inproceedings{md2025raw, author = {Damian-Kosterhon, Brindusa Mihaela and Koch, Andreas and Kosterhon, Felix and Petrica, Lucian}, booktitle = {2025 IEEE International Parallel and Distributed Processing Symposium Workshops (IPDPSW)}, title = {Improving mapping of convolutional neural networks on FPGAs through tailored macro sizes}, year = {2025}, volume = {}, number = {}, pages = {1208-1215}, keywords = {Distributed processing;Linear regression;Rapid prototyping;Table lookup;Convolutional neural networks;Decision trees;High level languages;Field programmable gate arrays;Random forests;Binary sequences;FPGA;Floorplanning;PBlock;RapidWright;Neural Networks}, doi = {10.1109/IPDPSW66978.2025.00193} } Bernhardt, A., Tamimi, S., Stock, F., Koch, A., and Petrov, I. (2025). PUL: Pre-load in Software for Caches Wouldn’t Play Along. The 29th European Conference on Advances in Databases and Information Systems (ADBIS). Preprint Bibtex @article{bernhardtADBIS2025, author = {Bernhardt, Arthur and Tamimi, Sajjad and Stock, Florian and Koch, Andreas and Petrov, Ilia}, title = {PUL: Pre-load in Software for Caches Wouldn’t Play Along}, booktitle = {The 29th European Conference on Advances in Databases and Information Systems (ADBIS)}, year = {2025}, preprint = {https://arxiv.org/pdf/2506.16976} } Ewert, C., Neskovic, A., Heinz, C., Muuss, F., Treff, A., Gourjon, M., Buchty, R., et al. (2025). Lightweight Authenticated Integration and In-Field Secure Operation of System-in-Package. ACM Trans. Des. Autom. Electron. Syst. New York, NY, USA: Association for Computing Machinery. doi: 10.1145/3745780 DOI Bibtex @article{ewert2025, author = {Ewert, Christian and Neskovic, Andrija and Heinz, Carsten and Muuss, Felix and Treff, Alexander and Gourjon, Marc and Buchty, Rainer and Eisenbarth, Thomas and Koch, Andreas and Berekovic, Mladen and Mulhem, Saleh}, title = {Lightweight Authenticated Integration and In-Field Secure Operation of System-in-Package}, year = {2025}, publisher = {Association for Computing Machinery}, address = {New York, NY, USA}, issn = {1084-4309}, doi = {10.1145/3745780}, journal = {ACM Trans. Des. Autom. Electron. Syst.} } Noack, T., Krüger, L., and Koch, A. (2025). Accelerating Sparse Linear Solvers on Intelligence Processing Units. In Proceedings of the 2025 IEEE International Parallel and Distributed Processing Symposium (IPDPS). doi: 10.1109/IPDPS64566.2025.00095 Preprint DOI Bibtex @inproceedings{noack2025ipdps, author = {Noack, Tim and Krüger, Louis and Koch, Andreas}, title = {Accelerating Sparse Linear Solvers on Intelligence Processing Units}, year = {2025}, isbn = {9798331532376}, booktitle = {Proceedings of the 2025 IEEE International Parallel and Distributed Processing Symposium (IPDPS)}, doi = {10.1109/IPDPS64566.2025.00095} } Tamimi, S., Bernhardt, A., Stock, F., Petrov, I., and Koch, A. (2025). CINDA: Using Cache-Coherent Interconnects for Accelerating Databases by Enabling Near-Data Processing of Update Transactions. IEEE Transactions on Computers, 1–14. doi: 10.1109/TC.2025.3558028 Preprint DOI Bibtex @article{tamimiTC2025CINDA, author = {Tamimi, Sajjad and Bernhardt, Arthur and Stock, Florian and Petrov, Ilia and Koch, Andreas}, journal = {IEEE Transactions on Computers}, title = {CINDA: Using Cache-Coherent Interconnects for Accelerating Databases by Enabling Near-Data Processing of Update Transactions}, year = {2025}, volume = {}, number = {}, pages = {1-14}, keywords = {Low latency communication;Translation;Synchronization;Engines;Computer architecture;Standards;Field programmable gate arrays;Benchmark testing;Throughput;Memory management;Near-Data Processing;Computational Storage;CCIX;CXL;FPGA;Database Management Systems}, doi = {10.1109/TC.2025.3558028} } Scheck, M., Lavan, Y., Spang, C., and Koch, A. (2025). SCOoOTER: A RISC-V Processor Framework and Tool Flow for an Architecture-to-Layout Design Course. In Proc. Workshop on Computer Architecture Education (WCAE). Preprint Bibtex @inproceedings{scheck2025scoooter, autho",
  "content_length": 144533,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:07"
}