{
  "name": "Andreas Bollin",
  "homepage": "https://www.aau.at/en/informatics-didactics/team/bollin-andreas",
  "status": "success",
  "content": "Univ.-Prof. Dipl.-Ing. Dr. Andreas Bollin – Informatics Didactics, AAU Student CockpitePaymentAppointment & course managementCampus SystemResearch Information SystemCampus searchStaff PortalOrganisation handbookOperational messages, internal & personal messages LinksWebmail Library Vacancies University bulletin Bulletin Board Staff Search Campus Map IT Services (ZID) eLearning Service USI OEH Klagenfurt Information forPupils Alumni & Career Prospective Students Continuing Education Researchers Students Staff Teaching Staff Partners & Sponsors International DEPARTMENT OF INFORMATICS DIDACTICS AAU1/...Department of Informatics Didactics2/Team3/Univ.-Prof. Dipl.-Ing. Dr. Andreas BollinUniv.-Prof. Dipl.-Ing. Dr. Andreas Bollin Univ.-Prof. Dipl.-Ing. Dr. Andreas BollinHead of Department+43 463 2700 3516andreas [dot] bollin [at] aau [dot] atB01a.0.210Di., 10:00 - 11:00, Lakeside Park, B01, vorab Vereinbarung mit Sekretariat PublicationsCampus-Portal profile | Courses | Research Google Scholar Profil ResearchGate Research areas / ÖSTAT - Subject areasCompetency Models in Computer Science EducationDidacticsE-learningFormal languagesGame researchGender Issues in Computer Science EducationInformatik-DidakikPersonality-optimized EducationSerious GamesSoftware developmentSubject didactics of technical sciences Curriculum Vitae Curriculum Vitae Selected Projects 10/2015 - 11/2015 COOL-VS 10/2015 - 11/2015 CT-VS 01/2017 - 12/2018 Innovativer Unterricht und Serious Games 01/2017 - 11/2021 Laufender Arbeitsschwerpunkt: Gender- und Persönlichkeits-optimierter Unterricht 2002 - (running): AMEISE - A Media Education Initiative for Software Engineering. http://ameise.aau.at Awards Preis für „Innovative Lehre“ Excellence in eLearning and blended learning award (Software Engineering II, Summer 2010). QuicklinksWebmail University bulletin Library Bulletin Board Staff Search Campus Map IT Services (ZID) USI OEH Klagenfurt Index A-Z Portals Campus System Student Cockpit Staff Portal Moodle Facebook Bluesky LinkedIn Youtube Instagram TikTok Information forPupils Alumni & Career Prospective Students Continuing Education Researchers Students Staff Teaching Staff Partners & Sponsors International Address University of Klagenfurt Universitätsstraße 65-67 9020 Klagenfurt am Wörthersee Austria +43 463 2700 uni [at] aau [dot] at www.aau.at Campus Plan Your privacy is important to us! This website uses cookies to ensure the basic functionality of our website. We also use Cookies cookies to optimally redesign our website and to improve it continuously for you. For this purpose, it is necessary to pass on information to the respective service providers. By clicking on the \"Accept all cookies\" button, you agree to the use of cookies. You can subsequently modify your preferred settings at any time under \"Manage settings\". For further information on the cookies used, please refer to our privacy policy.Manage settingsAccept all cookies Cookie and Privacy Settings How we use cookiesWe use cookies to optimally redesign our website and to improve it continuously for you. Click on the different category headings to view further information and to change the default settings. Please note that refusing some cookies may affect the way our website works. Web pages may not be displayed correctly and may not function properly. Notice regarding the processing of your data collected on this website in countries without adequate data protection standards: By clicking on ‘Accept all cookies’, you consent to the transfer of your personal data to providers in third countries (e.g. the USA) in accordance with Art. 49 (1) lit. a GDPR. These providers (e.g. Google, Facebook, LinkedIn, Twitter, YouTube) may not be subject to a level of data protection equivalent to that of the EU. The data will only be transferred with your express consent. Essential Cookies & Cookie NoticeEssential cookies These cookies are strictly necessary for the functioning of the website. Essential cookies enable basic functions and are necessary for the proper functioning of the website. You can set your browser to block these cookies or to notify you about these cookies. However, some parts of the website may not work as expected. These cookies do not store any personal data. Enable / disable essential cookies. If the toggle is on the left and appears green, essential cookies are enabled. If the toggle is on the right and appears grey, essential cookies are disabled. Hiding the cookie notice Move the toggle to the left to permanently hide the cookie notice and reject all cookies that have not been accepted. Two cookies are required for this setting to be saved. Otherwise this hint will be displayed again every time the page is loaded. Google Tag ManagerWe use tracking and analysis tools to ensure continuous optimisation and needs-based design of our website. Tracking measures also enable us to record statistics regarding the use of our website by visitors and to develop our website further on the basis of these findings. If you do not want Google and Facebook to track your use of our website and transmit your visits, you can disable tracking in your browser here: If the toggle is switched to the left and appears green, the service is enabled. If the toggle is on the right and appears grey, the service is disabled. Other external services We also use other external services including Google Webfonts, Google Maps, and external video providers. Since these providers may collect personal data such as your IP address we allow you to block them here. Please be aware that this might significantly limit the functionality and appearance of our site. Changes will take effect once you reload the page. Google Webfont Settings: If the toggle is switched to the left and appears green, the service is enabled. If the toggle is on the right and appears grey, the service is disabled. Google Maps Settings: If the toggle is switched to the left and appears green, the service is enabled. If the toggle is on the right and appears grey, the service is disabled. Google reCaptcha Settings: If the toggle is switched to the left and appears green, the service is enabled. If the toggle is on the right and appears grey, the service is disabled. Vimeo and Youtube video embeds: If the toggle is switched to the left and appears green, the service is enabled. If the toggle is on the right and appears grey, the service is disabled. Privacy policyFor further information on the cookies used, please refer to ourPrivacy Policy of the University of Klagenfurt Save and accept selectionCancel Open Message Bar Open Message Bar Open Message Bar Scroll to top",
  "content_length": 6658,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:54"
}