{
  "name": "André J. A. Unger",
  "homepage": "https://uwaterloo.ca/earth-environmental-sciences/people-profiles/andre-unger",
  "status": "success",
  "content": "Andre Unger, PEng | Earth and Environmental Sciences | University of Waterloo Skip to main content Andre Unger, PEng Associate Professor Email: aunger@uwaterloo.ca Google Scholar Status: Active Biography André Unger develops and applies numerical methods and algorithms to solve a wide variety of problems involving Earth Sciences and Geological Engineering Professor Unger studies how municipalities can sustainably manage their water resources and infrastructure using a variety of tools, including groundwater and surface water modeling, and water infrastructure asset management tools. Professor Unger also studies the financial and health risks associated with re-developing hazardous waste sites known as \"brownfields\" using alternative clean-up techniques. Professor Unger also studies aspects of signal analysis and spectrogram inversion with specific application to speech recognition and synthesis. Research Interests Computational hydrogeology Water resource supply and infrastructure management, including financial sustainability Signal analysis including speech recognition and synthesis Scholarly Research Financially sustainable water resource supply and infrastructure: Professor Unger's research on this topic focuses on assessing the risk associated with securing the future water supply using groundwater/surface water hydrologic models at the watershed scale. The Province of Ontario has recently issued legislation mandating that all municipalities with a permit to issue water to residents must ensure that their water system is self-financing in order to have their permit renewed. In other words, the fee consumers pay per cubic meter of water consumed must be sufficient to cover all expenses needed to operate and maintain the system in a safe and reliable manner. While this seems like an obvious requirement, it is a fundamental paradigm shift in how municipalities operate. Professor Unger is also investigating project finance strategies to rehabilitate and expand the infrastructure needed to deliver and collect water to and from households given the uncertainty in population growth and the residential/commercial demand for water; the uncertainty in commodity prices consumed during all capital works and O&M activities used to maintain the infrastructure; and the uncertainty in the degradation rate and operable lifespan of the infrastructure. Signal Analysis: Professor Unger's research on this topic focuses on developing numerical algorithms for speech synthesis with human-like emotion, intonation and phrasing. These algorithms represent a mechanistic speech synthesis technology that minimizes the need for machine learning to simply collecting/analyzing/generating context specific information. Key features of this technology involve spectrogram construction and inversion approaches. Education 1995, Doctorate Earth Sciences, University of Waterloo, Canada 1991, Master of Science Earth Sciences, University of Waterloo, Canada 1990, Bachelor of Applied Science (BASc) Geological Engineering, University of Waterloo, Canada Professional Associations Professional Engineer, Province of Ontario, Canada Affiliations and Volunteer Work Waterloo Artificial Intelligence Institute Water Institute Teaching* CIVE 153 - Earth Engineering Taught in 2020, 2021, 2022, 2023, 2024 EARTH 456 - Numerical Methods in Hydrogeology Taught in 2020, 2021, 2022, 2023, 2024 EARTH 656 - Groundwater Modelling Taught in 2020, 2021, 2022, 2023, 2024 ENVE 153 - Earth Engineering Taught in 2020, 2021, 2022, 2023, 2024 GEOE 153 - Earth Engineering Taught in 2020, 2021, 2022, 2023, 2024 * Only courses taught in the past 5 years are displayed. Selected/Recent Publications Wu, Q., S. Lin, A. Unger (2023) Modelling multi-material structural patterns in tectonic flow with a discontinuous Galerkin level set method, Journal of Geophysical Research: Solid Earth; 10.1029/2023JB026806 Enouy, R.W., K.W. Walton, I.I Malton, K.S. Sra, N.N. Sihota, E.J. Daniels, and A.J.A. Unger (2022) A mechanistic derivation of the Monod bioreaction equation for a limiting nutrient, Journal of Mathematical Biology 84 (62). Mohammadifardi, H., M. Knight and A. Unger (2022) Sustainability assessment of strategic asset management decisions on municipal water infrastructure systems: Framework and application. AWWA Water Science, 4(4), e1297. Ganjidoost, A., MA Knight, AJA Unger and CT Haas (2021) Performance modeling and simulation for water distribution networks, Frontiers in Water 3, 718215. Enouy, R., A.J.A. Unger, and R. Rehan (2019) Advective-dispersive transport of residential water consumption. Journal of Hydroinformatics. doi: 10.2166/hydro.201930 Patents Unger, A.J.A., K.M. Walton and R.W. Enouy (2025), Signal analysis and synthesis using spectrogram construction and inversion. United States Patent Publication No. US 2025/0184016 A1(pending). Enouy, R.W. and A.J. Unger (2021), System and method of digital sound synthesis, signal transmission, and subsequent analysis using spectrogram inversion. United States Patent Publication No. US 2021/0356502 A1. Enouy, R.W. and A.J. Unger (2019), System and method of pre-processing discrete datasets for use in machine learning. United States Patent Publication No. US 2019/0377771 A1. Graduate studies",
  "content_length": 5271,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:13"
}