{
  "name": "Andrew P. McPherson",
  "homepage": "http://www.eecs.qmul.ac.uk/~andrewm",
  "status": "success",
  "content": "Augmented Instruments Laboratory The Augmented Instruments Laboratory Who We Are Our Papers The Augmented Instruments Laboratory is a music technology research team based in the Centre for Digital Music (C4DM) at Queen Mary University of London and the Dyson School of Design Engineering at Imperial College London. The lab is led by Prof. Andrew McPherson, and its members hail from a wide range of backgrounds spanning music, engineering, human-computer interaction, design and the social sciences. The lab was founded in 2011 as part of QMUL's Centre for Digital Music. From 2023 onward, the lab will have a dual institutional affiliation, with future members joining from Imperial College London. The lab hosts several large grant-funded projects including an ERC Consolidator Grant (2023-27) and a Royal Academy of Engineering Senior Research Fellowship (2021-26). PhD students in the lab are supported by the Media and Arts Technology and Artificial Intelligence and Music doctoral training programmes at QMUL. Lab members work frequently with companies, charities and artists. A spinout of the lab is Bela, an open-source embedded hardware platform for creating instruments and interactive audio systems with a high degree of nuance and extremely low latency. Following a successful Kickstarter campaign, the company Augmented Instruments Ltd was founded in 2016, and it supports a growing maker community and provides consultancy services to industry. Latest Lab News May 14, 2025 AIL Open Seminars #009 Critical Sound Synthesis - MORE ROAR!, by John Richards (Dirty Electronics) and Agnes Cameron Read more ... April 27, 2025 Music from the Augmented Instruments Laboratory The Augmented Instruments Lab presents Shifted: Music from the Augmented Instruments Lab. Read more ... June 17, 2024 AIL Open Seminars #005 Sustainable Speech: Experimental Music and Sensory Technologies for Post-Stroke Aphasia, by Zeynep Bulut Read more ... See all news posts Explore Home News Research People Publications Contact Latest lab news AIL Open Seminars #009 Music from the Augmented Instruments Laboratory AIL Open Seminars #005 Music from the Augmented Instruments Laboratory AIL Open Seminars #003 Contact us andrew.mcpherson@imperial.ac.uk Dyson School of Design Engineering, Imperial College London Centre for Digital Music, QMUL",
  "content_length": 2331,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:42"
}