{
  "name": "Andrea Soltoggio",
  "homepage": "https://www.lboro.ac.uk/departments/compsci/staff/academic-teaching/andrea-soltoggio",
  "status": "success",
  "content": "Andrea Soltoggio | Computer Science | Loughborough University Dr Andrea Soltoggio Reader in Artificial Intelligence (Associate Professor) Research Coordinator Publications +44 (0) 1509 635 748 Send email Office: N.2.03, (Haslegrave Building) Personal website Biography Research Projects/activities Press & outreach Teaching Andrea Soltoggio received a combined BSc and MSc degree in Computer Science in 2004 from the Norwegian University of Science and Technology, Norway, and from Politecnico di Milano, Italy.  He was awarded a Ph.D. in Computer Science in 2009 from the University of Birmingham, UK. He was with the Laboratory of Intelligent Systems at EPFL, Lausanne, CH, in 2006 and 2008-2009.  He was a visiting researcher at the University of Central Florida, US, in 2009.  From 2010 to 2014 he was Technical Coordinator of the FP7 European large-scale integration project AMARSi with the Research Institute for Cognition and Robotics, Bielefeld University, Germany. From 2014 he is a lecturer in computer science and artificial intelligence at Loughborough University. He is a Fellow of the Higher Education Academy (FHEA). See our University press release on the Nature Machine Intelligence paper : “A collective AI via lifelong learning and sharing at the edge”, March 2024. See our DARPA L2M project press release at HRL (2018) Research areas My research interests focus on lifelong machine learning, in particular, lifelong reinforcement learning, with also a general focus on related areas such as neural plasticity, models of learning and memory, neuro-robotics, evolutionary computation, artificial life, adaptive behaviour, human-robot interaction, control systems, cognition and intelligence. For a list of publications, check the institutional repository or my personal web page. Selected publications: Soltoggio, A, et al. (2024) A collective AI via lifelong learning and sharing at the edge, Nature Machine Intelligence, 6(3), pp.251-264, DOI: 10.1038/s42256-024-00800-2. Nath, S, Peridis, C, Ben-Iwhiwhu, E, Liu, X, Dora, S, Liu, C, Kolouri, S, Soltoggio, A(2023) Sharing lifelong reinforcement learning knowledge via modulating masks. In Chandar, S, Pascanu, R, Sedghi, H, Precup, D (ed) Second Conference on Lifelong Learning Agents (CoLLAs 2023); Proceedings of the 2nd Conference on Lifelong Learning Agents (CoLLAs 2023), Montreal, Canada, pp.936-960. Ben-Iwhiwhu, E, Nath, S, Pilly, P, Kolouri, S, Soltoggio, A (2023) Lifelong reinforcement learning with modulating masks, Transactions on Machine Learning Research, pp.1-23. Hu, Y, Soltoggio, A, Lock, R, Carter, S (2018)  A Fully Convolutional Two-Stream Fusion Network for Interactive Image Segmentation. Download code from GitHub: https://github.com/cyh4/FCTSFN Skarysz, A., Alkhalifah, Y, Darnley, K, Eddleston, M, Hu, Y, McLaren, DB, Nailon, WH, Salman, D, Sykora, M, Thomas, CLP, Soltoggio, A (2018) Convolutional neural networks for automated targeted analysis of gas-chromatography mass-spectrometry data. In International Joint Conference on Neural Networks, Rio de Janeiro, Brazil. Download PDF. Soltoggio, A, Stanley, K. O., Risi, S. (2018) Born to Learn: the Inspiration, Progress, and Future of Evolved Plastic Neural Networks. Neural Networks Journal (2018) arXiv: https://arxiv.org/abs/1703.10371 Andrea Soltoggio (2014) Short-term plasticity as cause-effect hypothesis testing in distal reward learning, Biological Cybernetics, Feb 2015, Vol 109, p75-94, DOI: 10.1007/s00422-014-0628-0 Soltoggio, A., Bullinaria, A. J., Mattiussi, C., Dürr, P. and Floreano, D. (2008) Evolutionary Advantages of Neuromodulated Plasticity in Dynamic, Reward-based Scenarios. Artificial Life XI: Proceedings of the Eleventh International Conference on the Simulation and Synthesis of Living Systems. Download PDF Funded projects: Dynamic Resilience (Wellcome Leap) 2024-2027 Innovate UK 2023-2025, Knowledge Transfer Partnership. Automated technology for digital record processing, archiving, curation and retrieval for government departments and public sectors. Defense Advanced Research Project Agency (DARPA) 2021, Shared Experience Lifelong Learning Defense Advanced Research Project Agency (DARPA) and US Air Force Research Laboratory, 2018. Lifelong Learning Machines (L2M) Innovate UK. 2017-2018. Knowledge Transfer Partnership. Deep learning and augmented reality deployment on mobile devices EPSRC 2017-2018, Digitisation of Collaborative Human-Robot Work Spaces EPSRC 2016-2017, Robotics and autonomous systems for manufacturing and infrastructure management (EPSRC Institutional Sponsorship) (co-investigator) (EP/N508706/1) Past projects: Technical co-ordinator of the EU FP7 #248311 AMARSi project (2010-2014), approx. 12 PIs, 30+ full-time researchers. Reviewer for: Adaptive Behavior AIMS Neuroscience Archives of Pathology and Laboratory Medicine Essays in Biochemistry Frontiers in Computational Neuroscience Frontiers in Psychology IEEE Systems, Man, and Cybernetics, Part A and B IEEE Transaction of Cognitive and Developmental Systems Information Sciences MIT Evolutionary Computation Journal MIT Neural Networks Journal Nature Nature Communication Nature Machone Intelligence Neural Networks Journal Neurocomputing Journal Robotics and Autonomous Systems Science Magazine Soft Computing Programme Committee (reviewer) of: International Conference on Learning Representations (ICLR) Genetic and Evolutionary Computation Conference (GECCO) IEEE International Conference on Intelligent Computing International Symposium on Bio-Medical Information and Cybernetics Hybrid Intelligent Systems Conference Congress on Evolutionary Computation (CEC) IEEE Symposium Series on Computational Intelligence for Human-Like Intelligence (CIHLI) Australasian Conference on Artificial Life and Computational Intelligence International Conference on Neural Networks (ICONIP 2011) NeurIPS CVPR Conference on Lifelong Learning Agents (CoLLAs) AAAI Conference on Artificial Intelligence In June 2018, our work Convolutional neural networks for automated targeted analysis of gas-chromatography mass-spectrometry data was reported by the following: Press coverage Our Nature Machine Intelligence paper was featured in: The Independent, The Standard, Sci News, TechXplore, MSN.com and 157 other news articles (Altmetric) (March 2024). LBC Radio: A Collective AI, with Nick Quraishi (23 March 2024). Shared Experience Lifelong Learning DARPA project featured in: Azorobotics, Europawire, ENS-Newswire, Eurekalert (October 2021). BBC Radio Leicester: Lifelong Learning Machines: a DARPA project at Loughborough University, with Jimmy Carpenter (11 April 2019). Loughborough University press release: New grant to develop self-learning machines (1 August 2018). World Economic Forum: Open wide: this AI could soon analyse your breath for disease (12 June 2018). BBC Radio Leicester: AI can smell illnesses in human breath, with Ady Dayman (19 June 2018). NVIDIA Developer, News Center: AI Can Smell Illness in Human Breath (27 June 2018). The Conversation: AI is acquiring a sense of smell that can detect illness (8 June 2018). News on AI for breathomics by Soltoggio also appeared in: The Independent, Focus.it, Golem.de, Fox News, Reddit, TechExplore, Newsweek, The wire, Business Insider, In-quisitr, Marie Claire, TicBeat, Up Magazine, Business Cloud, Smithsonian Magazine, Johns hopkins School of Public Health, Global Health Now, TechCircle. Outreach activities BBC Radio Leicester: Starmer frames AI as positive for growth, with Ben Jackson 13/1/2025 BBC Radio Leicester: AI translator to understand our pets, with Summaya Mughal 10/1/2025 France 24 Live TV: Digital waste polluting the planet, Morning news, 18/11/2024 LBC Radio: How to avoid being scammed by AI, with Vanessa Feltz, 13/10/2024 BBC Radio Leicester, Recent AI developments in language and art. With Ady Dayman (3/3/2023) BBC Radio Leicester, AI to make cars and roads safer. With Jimmy Carpenter (27/9/2021) BBC Radio Leicester. AI becomes a job recruiter. With Jimmy Carpenter (26/9/2019) BBC Radio Leicester. How AI will change our jobs and lifestyle. With Naomi Kent (12/8/2019) BBC Radio Leicester. AI spring. With Jimmy Carpenter (11/4/2019) BBC Radio Leicester. AI developments in 2019. With Jimmy Carpenter (16/1/2019) BBC Radio Leicester. AI in medicine and surgery. With Ed Stagg (12/9/2018) BBC Radio Leicester. Robotics and automation: risks and opportunities in the job market. With Ady Dayman (5/2/2018) BBC One (East Midlands Today). The potential impact to East Midlands region of AI innovation. With Amy Harris (27/11/2017) BBC Radio Leicester. Chatbots and emotional intelligence. With Ady Dayman (24/11/2017) BBC Radio Leicester. AI and chatbots. With Jonathan Lampon (9/8/2017) Debating Society Paderborn, \"Bedroht künstliche Intelligenz die Grundlagen unserer Existenz?\" (10 July 2016) NAO robots at the British Science Week, STEM day (March 2016, March 2017, March 2018) BBC Radio Leicester. Interview on robotics with NAO robots (14/9/2015) STEM Science Taster Day (22/9/2015) Administrative roles: Computer Science Research Coordinator (2024-present) Programme Leader (Computer Science, Computer Science and AI, Computer Science and Mathematics) 2018-2023 2016-2018 Post Graduate Taught Tutor (MSc thesis coordination) Teaching Advanced Artificial Intelligence Systems (Final year UG) since 2014 Artificial Intelligence (PGT) since 2014 Past Managing a team project (Part D) 2015-2018 Team projects (Part B) 2015-2018 Former institutions (University of Birmingham) Research skills (2008) Evolutionary Computation Neural Computation Design and media team Artificial Intelligence and Cognitive Science Project/thesis supervision (Part C, Part D, MSc): approximately 100 since 2014. 2018/19 (selected project titles) Trading application with data analysis AI controlled autonomous car network Machine learning for comparing like-parts of song(s) and creating branches between them Deep learning for cryptocurrency market predictions Mach",
  "content_length": 10653,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:49"
}