{
  "name": "Andrea Vitaletti",
  "homepage": "https://andreavitaletti.github.io",
  "status": "success",
  "content": "Andrea Vitaletti - Andrea Vitaletti Skip to content Andrea Vitaletti Andrea Vitaletti, Ph.D., Associate Professor of Computer Science at Sapienza University of Rome. My research focuses on designing systems for collecting, analyzing, and managing data in distributed networks, with a strong emphasis on decentralized governance. Over the years, I have worked on the Internet of Things (IoT), Distributed Ledger Technologies (DLT), and Federated Machine Learning, topics I also teach at Sapienza. More recently, I’ve started exploring Verifiable Computation and Computational Gastronomy I am particularly interested in the trade-offs between data utility and privacy, as well as the balance between individual and collective interests in digital ecosystems. I have co-authored over 90 scientific papers and contributed to several European research projects, including serving as principal investigator and coordinator of the FET Open project PLEASED. A maker at heart, I have hands-on experience in technology transfer. I co-founded the spin-offs WLAB (exit in 2016) and WSENSE (which I left in 2019). Since 2020, I have been teaching Digital Entrepreneurship, and I’m proud to see some of my students launch their own startups, such as iotilize.me and yeastime. Hobbies: Traveling, sailing, cycling, and paragliding. I also play the piano and guitar for fun... you’ve been warned! Education From To Nov. 1998 Jan. 2002 PhD in Engineering in Computer Science (Dottorato di Ricerca in Ingegneria Informatica), University of Rome “La Sapienza” Oct. 1992 Feb. 1998 MSc in Engineering in Computer Science (Laurea in Ingegneria Informatica), University of Rome “La Sapienza” Work Experience From To Dec. 2019 Present Associate Professor at University of Rome “La Sapienza” Nov. 2007 Nov. 2019 Assistant Professor (Ricercatore) University of Rome “La Sapienza” Jul. 2007 Jun. 2019 Co-founder and CTO of WSENSE Jul. 2002 Jun. 2016 Co-founder and CTO of WLAB (exit: sold to Alten) Mar. 2002 Oct. 2007 Post-doc and research grant at University of Rome “La Sapienza” Mar. 1998 Oct. 2007 Senior researcher at ETNOTEAM Research Labs (now NTT DATA) Mar. 2006 May. 2006 Visiting researcher at Swiss Federal Institute of Technology in Zurich (ETHZ), Zurich (Switzerland) Apr. 2001 Ago. 2001 Consultant at AT&T Labs Research, Florham Park, NJ (USA) Teaching He teaches networking topics at Sapienza since 2008 in the Master and Bachelor in Computer Engineering (LM-32 and L-8). He is currently teaching Internet of Things Application and Services (LM-32) and Advanced Information Security Systems and Blockchain for the Master in Cybersecurity (LM-66). Since 2000 he has been teaching a course on Digital Entrepreneurship; this is one among the very few joint courses organized between roman universities (Roma Tre and Sapienza, in particular). This course enjoys a strict collaboration with DOCK and some of the students attending the course have been awarded on the final DOCK context over the years (e.g. YEASTIME and IOTILZE.ME) and are now startup. From 2018 to 2023 he gave a course on the Internet of Thing to the Master in Product Design at Sapienza (LM-12). Andrea Vitaletti is instructor in the MOOC of Sapienza on Coursera entitled “Recovering the Humankind’s Past and Saving the Universal Heritage” (16545 enrolled, 4.4 star evaluation). 25-29 September 2023. Data Science PhD course: Crypto and Incentive-based Mechanisms for Blockchain Technology. Togheter with Vangelis Markakis (University of Athens), Ivan Visconti (University of Salerno) and Philip Lazos (Input Output IOG, United Kingdom). A Short Course on IoT taught at the University of Stellenbosch (South Africa) the 19th and 21st July 2023 during an Erasmus+ staff mobility for teaching visit. About 40 participants selected among more the 100 candidates. The second edition of the course was given in November 2024 at the Business and Technology University in Georgia. In 2023 and 2024 Instructor, togheter with prof. Paolo Merialdo of “L’imprenditoria digitale per la scuola” (Digital Entrepreneurship for the school) by Fondazione i Lincei per la Scuola. In 2025 Instructor for the 38 Escuela de Ciencias Informáticas ECI 2025 in Buenos Aires Argentina of the course on The Evolution of Blockchain Technologies Transfer of Technology From To 2002 2016 In 2002 I founded WLAB, a dynamic SME created to support applied research and prototyping in the area of wireless technologies and pervasive and mobile computing. WLAB has been characterized by the synergy with the universities of Rome (Sapienza and Tor Vergata) promoting a continuous and effective technological transfer of innovative solutions from academia to the industry. I was Chief Technology Officer (CTO) of WLAB until its sale in 2016 2012 2019 In 2012 I founded WSENSE a spin-off of Sapienza University of Rome, with a strong and experienced R&D team specialized in monitoring and communication systems with pioneering patented solutions in the Internet of Underwater Things (IoUT). I was the CTO of WSENSE and I lead the activities for the development of the WGATE, the cloud platform for the collection, analysis, visualisation and integration of IoT data. WSENSE is an international company, with WSENSE Ltd hosted in the Marine Robotics Innovation Centre of Southampton U.K. 2014 2020 Among the organizers of the Google Technologies Workshop for Cloud and Web Development now in its fifth edition. The workshop is aimed at students to develop the skills leading them to the realization of a start-up. The success of the workshop is also measured by the fact that some participants are now hosted in business accelerators in 2014 Successful experience in a crowd-funding campaign with the project COVA that has been also bradcasted in the Italian main TV channel RAI in 2014 The WSN group @ DIAG I lead designed and developed the MagoNode: a new wireless device for WSN networks operating in the 2.4Ghz ISM band deployed in many field trials. in 2001 During my stay at AT&T Research Labs of Florham Park, NJ - USA, my research activity led to the application of four provisional patent applications. in 2014 I gave a talk on my research activity at TEDXROMA 2019 today Member of the ADI committee in the reserch for business category Patents Patent 102003901105392 (RM2003A000177): Procedure for the recognition of authenticity of documents and debt securities, in particular banknotes, and related system. Patent 102001900950099 (RM2001A000492): Method for the secure transmission of data through short message service messages (SMS) with related methods for generating and recognizing secure SMS Projects I have acquired a significant experience on research projects, gained in more than 15 years of participation to academic and industrial projects characterized in many cases by a marked multidisciplinarity approach. Over the time I assumed various roles, with different responsibilities, as researcher, principal investigator (PI) and finally coordinator. On going projects Made in Italy Circolare e Sostenibile (MICS) National Plan for Recovery and Resilience NextGenerationEU (PNRR) program, SPOKE 8 Digitally-oriented factory design and management through AI and data driven approaches, Project 8.06 Blockchain-based solutions for trusted and quality-aware data sharing SEcurity and RIghts in the CyberSpace SERICS National Plan for Recovery and Resilience NextGenerationEU (PNRR), SPOKE 9: Securing Digital Transformation ERASMUS-EDU-2022-CBHE project titled “Smart City ASEAN Learning Network (SCALe)” with project number: 101083278 Past Projects MISE (Ministry of Economic Development) Project. Copyright management on 5G network over Blockchain. The project is managed by SIAE, the Italian Collective Management Organization. I lead the activity of WP2 focused on the open research issues to implement a copyright management on blockchain Decentralised RObinson List. The project is managed by Fondazione Ugo Bordoni. This project won the Algorand Grand Prize at Future of Blockchain Competition. MISE (Ministry of Economic Development) Project. Smart Factory, Agrifood and Life Science. MaaS (Maintenance as a Service) platform based on the integrated use of IoT-Blockchain, for the inter-operational and transparent sharing of authenticated and protected information, regarding the enhancement and operational management in REAL time of technical ASSETS and economic transactions related to the interactions between the various parties involved in the entire Facility Management chain Sapienza Project on Blockchain and Public Administration. Erasmus+ Capacity Building in Higher Education: Master Degree in Industry 4.0 Project No. 610455-EPP-1-2019-1-MY-EPPKA2-CBHE-JP FP7-PEOPLE-ITN-2008 FRONTS (PI), Overall Budget: EUR 3.1 Mln. From 01-02-2008 to 30-04-2011. The aim of this project is to establish the foundations of adaptive networked societies of tiny heterogeneous artifacts. I participated to all the review meetings where I presented the activities of WP2. FP7-ICT-2009-5 VITRO (PI), Overall Budget: EUR 3.4 Mln. From 01-09-2010 to 28-02-2013. This project is focused on developing architectures, algorithms and engineering methods, to enable the realization of scalable, flexible, adaptive, energy-efficient and trust-aware Virtual Sensor Network platforms. I participated to all the review meetings where I presented the activities of WP3. ARTEMISI-JU call 2009, CHIRON (PI), Overall Budget: EUR 17.8 Mln. From 01-03-2010 to 01-02-2013. CHIRON combines state-of-the-art technologies and innovative solutions into an integrated framework for effective and person-centric health management throughout the complete (health)care cycle. EU EUROSTARS-EUREKA, PharmAID (PI), Overall Budget: EUR 2 Mln. From 01-06-2010 to 31-12-2012. The mainpurpos of the project is the development of an solution for the pharmaceutical market based on passive RFID tags capabe to: a) prevent drugs’ counterfeiting; b) certify drugs’ integrity; and c) track drugs alon",
  "content_length": 17894,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:51"
}