{
  "name": "Andreas K. Maier",
  "homepage": "https://lme.tf.fau.de/person/maier",
  "status": "success",
  "content": "Andreas Maier - Pattern Recognition Lab Simulate organization breadcrumb open Simulate organization breadcrumb close Friedrich-Alexander-Universität Pattern Recognition Lab PRL Andreas Maier Andreas Maier Prof. Dr.-Ing. habil. Andreas MaierHeadDepartment of Computer ScienceChair of Computer Science 5 (Pattern Recognition)Room: Room 09.138Martensstraße 391058 ErlangenGermanyPhone number: +49 9131 85-27883Fax number: +49 9131 85-27270Email: andreas.maier@fau.deWebsite: https://lme.tf.fau.de/person/maier/Appointmentsnach Vereinbarung/by agreement https://medium.com/@akmaier https://orcid.org/0000-0002-9550-5284 Academic CV Prof. Dr. Andreas Maier was born on 26th of November 1980 in Erlangen. He studied Computer Science, graduated in 2005, and received his PhD in 2009. From 2005 to 2009 he was working at the Pattern Recognition Lab at the Computer Science Department of the University of Erlangen-Nuremberg. His major research subject was medical signal processing in speech data. In this period, he developed the first online speech intelligibility assessment tool – PEAKS – that has been used to analyze over 4.000 patient and control subjects so far. From 2009 to 2010, he started working on flat-panel C-arm CT as post-doctoral fellow at the Radiological Sciences Laboratory in the Department of Radiology at the Stanford University. From 2011 to 2012 he joined Siemens Healthcare as innovation project manager and was responsible for reconstruction topics in the Angiography and X-ray business unit. In 2012, he returned the University of Erlangen-Nuremberg as head of the Medical Reconstruction Group at the Pattern Recognition lab. In 2015 he became professor and head of the Pattern Recognition Lab. Since 2016, he is member of the steering committee of the European Time Machine Consortium. In 2018, he was awarded an ERC Synergy Grant “4D nanoscope”.  Current research interests focuses on medical imaging, image and audio processing, digital humanities, and interpretable machine learning and the use of known operators. Projects 2023 Artificial Intelligent as a Market Participant – Implications for Antitrust Law (FAU Funds) Term: January 15, 2023 - January 14, 2024 Abstract Introduction: Antitrust laws (also known ascompetition laws) are designed to encourage strong competition and are designedto protect consumers from predatory commercial practices. The primary goals ofantitrust law are to ensure the functioning of the markets and to ensure faircompetition. A prominent example of an antitrust violation is illegal pricefixing. By definition, it is an agreement between competitors that fixes pricesor other competitive conditions, and thus violates the principle of the pricingmechanism through free market forces. A typical feature of illegal price fixingis verifiable communication (written or verbal) between human marketparticipants. However, in the age of artificial intelligence and e-commerce,the definition and the detection of this illegal practice faces new challengesas collusive behaviors that violate antitrust laws, such as the pricingmechanism, can be partially or fully automated [1]. Furthermore, thecommunications between market participants can be both overt and covert. Finally,market participants can be artificial agents which might affected by perverseinstantiation [2]. In other words, new technological possibilities areavailable to disguise illegal pricing policies and business practices. Recent research, mainly from theeconomic and jurisprudence point of view, concludes the intensive applicationof AI algorithms in E-commerce will increase the extend of known forms ofanticompetitive behaviors [3][4]. However, the questions regarding whether andto which extent collusive behaviors will emerge by AI itself (which is anunknown form of anticompetitive behaviors) are rarely understood. Feasibilitystudies and comprehensive analysis comprising the implementation of AI methods andvalidation of the derived hypothesis has not been conducted so far. Therefore,the main goals of this project are to investigate the possibilities of collusivebehaviors stimulated and/or emerged by AI algorithms on digital marketplace andderive consequences on the antitrust law as well as competition policies. Tothe best of our knowledge, this is the first time that a research project inthe field of Antitrust and AI (AAI) is focusing on the mathematical andalgorithmic perspective of the question to which extend the utilization of AImethods is facilitating the collusive behaviors in the era of digital economy. Objectives: In order to validate the hypothesesthat AI algorithms is able to develop and communicate collusive behaviors ondigital marketplaces both in overt and covert fashion, comprehensive emulatorsof online marketplaces in different setups will be implemented.  Furthermore, different communication channels(both overt and covert) of digital marketplaces will be discovered and understood,as it is highly relevant to the detection of collusive practices. Finally, differentonline trading scenarios utilizing AI algorithms will be established and theimpact on antitrust law and competition polices will be derived. In total, the mainaspects in the intended DFG-application can be summarized as follows: 1.      Asthe research topic belongs to a highly interdisciplinary field, a comprehensiveliterature review is necessary to define the problem space of the research andis of great importance to conduct the subsequent experiments successfully.Therefore, a comprehensive literature review on the aspects of antitrust law, gametheory, artificial intelligence and cyber security will be conducted. 2.      Firststep of the implementation is the holistic emulation of the digitalmarketplace. The market emulator should have the capability to emulate the digitalmarket following various rules (e.g., Cournot vs. collusive competition) indifferent size (i.e., with different amount of market participants). Moreover,state-of-the-art algorithms for dynamic pricing should be replicated andintegrated into the market emulator as well. 3.      Afurther aspect of this project is the communication mechanism in the era of E-commerceand AI. The know form of collusions mostly utilize overt communications.However, covert communication channels (i.e., communication channels that are notoriginally designed for the communication purpose, therefore hardly to bedetected [5][6]) poses further vulnerabilities of online marketplaces. The mechanismsand capacities of covert channels facilitating the collusive behaviors (e.g.,illegal price fixing) as should be investigated with the implemented marketemulator. 4.      Finally,artificial agents for price definition of different products should be proposedand implemented following different competition models as well as marketcomplexities, aiming at understanding the central research questions of thisresearch project, i.e., capabilities and conditions of emerging collusivebehaviors of artificial agents by themselves. This particular step can beachieved by using reinforcement learning techniques. Technical opportunitiesand challenges for the discrimination of collusive and non-collusive behaviorsthat are potentially emerged by the artificial agents should be explored aswell. The entire project will besupervised by experts from three disciplines. Prof. Jochen Hoffmann (chair of Private Business Law) will support this research project with his knowledges and expertiseon antitrust law, Prof. Felix Feilling (chair of Cyber Security) will advise onthe aspects that are related to covert communication and cyber security, andProf. Andreas Maier (pattern recognition lab) will mentor this project from theAI point of view. [1] KünstlicheIntelligenz als Marktteilnehmer – Technische Möglichkeiten, Maier A., Bayer S.,Mohr Verlag. Submitted, unpublished. [2] BostromN. Superintelligence: Paths, Dangers, Strategies. Minds & Machines 25, Seite 285–289 (2015). [3] Petit, N. Antitrust andartificial intelligence: A research agenda. In: Journal of European CompetitionLaw and Practice. Vol. 8, Issue 6, pp. 361–362. Oxford University Press.(2017) [4] Beneke, F., Mackenrodt, M.,Remedies for algorithmic tacit collusion, Journal of Antitrust Enforcement,Volume 9, Issue 1, Pages 152–176 (2021). [5]Hans-Georg Eßer, Felix C. Freiling. Kapazitätsmessung eines verdecktenZeitkanals über HTTP, Univ. Mannheim,Technischer Bericht TR-2005-10, November 2005. (2005) [6] Freiling F.C., Schinzel S.Detecting Hidden Storage Side Channel Vulnerabilities in NetworkedApplications. In: Camenisch J., Fischer-Hübner S., Murayama Y., Portmann A.,Rieder C. (eds) Future Challenges in Security and Privacy for Academia andIndustry. SEC 2011. IFIP Advances in Information and Communication Technology,vol 354. Springer, Berlin, Heidelberg. (2011) →More information An AI-based framework for visualizing and analyzing massive amounts of 4D tomography data for beamline end users (Third Party Funds Group – Overall project) Term: March 1, 2023 - February 28, 2026Funding source: Bundesministerium für Forschung, Technologie und Raumfahrt (BMFTR)URL: https://www.iis.fraunhofer.de/de/ff/zfp/projekte/KI4D4E.html Abstract Synchrotron tomography is characterized by extremely brilliant X-rays, which enables almost artifact-free imaging. Furthermore, very high resolution can be achieved by using special X-ray optics, and the special design of synchrotron facilities also allows fast in-situ experiments, i.e. 4D tomography.  The combination of these features enables high-resolution computed tomography on objects where conventional laboratory CT fails. At the same time, however, this also produces enormous amounts of data that are generally unprocessable by end users, pushing even the operators of synchrotrons to their limits. The goal of the KI4D4E project is to develop AI-based methods that can be used by end users to process the enormous amounts of data in such 4D CT measurements. This includes improving image qual",
  "content_length": 606952,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:04"
}