{
  "name": "Andrew Carl Dwyer",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/andrew-dwyer",
  "status": "success",
  "content": "Andrew Dwyer - Royal Holloway Research Portal X Andrew Dwyer Dr Lecturer in Information Security, Department of Information Security https://orcid.org/0000-0003-2207-6834 Phone+44 1784 917113EmailAndrew.Dwyerrhul.acuk TW20 0EX Personal profile Personal profileAndrew is an experienced researcher at the intersection of socio-technical and geopolitical interests in (cyber) security. His research ranges from work within cyber policy and geopolitics, an in-depth knowledge of malware detection, the role of machine learning in international security, to participatory and creative practice. He has given evidence to the UK Parliament on offensive cyber and speaks to numerous media outlets including The Times, The Record, The Telegraph, VOA Chinese, and BBC News as well as BBC Radio 4, BBC World Service, and LBC. Outside of Royal Holloway, he is the Lead of the UK Offensive Cyber Working Group, drawing together academia on questions of UK and international cyber policy. He is also on the editorial board of Big Data and Society and Digital Geography and Society. Previously, Andrew has been a Research Affiliate at the (former) Centre for Technology and Global Affairs at the University of Oxford and an Assistant Editor at the journal Big Data & Society. He was Addison Wheeler Research Fellow at Durham University (2020 - 2022), a Research Associate at the University of Bristol's Cyber Security Group (2019 - 2020) and a Visiting Fellow at the SFB-TRR 138 'Dynamics of Security' collaborative research centre in central Germany in 2019. Research Degree (PhD) Students I am not accepting new applications for PhD supervision. Current Research Degree Students Nicola Bates (Co-Supervisors Prof. Kostas Markantonakis, Information Security & Dr. Darren Hurley-Smith, University of Kent)Natasha Buckley (Co-Supervisor - Prof. Klaus Dodds, external)Stephen Cook (Advisor - Dr Maryam Mehrnezhad and Dr Waleed Shahid, Information Security)Rebecca Hartley (Co-Supervisor - Prof. Lizzie Coles-Kemp, Information Security)Richard Mawdsley (Co-Supervisor - Prof. Tom Dyson, Politics, International Relations, and Philosophy)Ömer Öztürk (Co-Supervisor - Dr. Rachael Squire, Geography)Oisín Phillips (Co-Supervisor - Prof. Keith Martin, Information Security)Faria Pitafi (Co-Supervisor - Dr. José-Rodrigo Córdoba-Pachón, Information and Operations Management) Departmental Responsibilities People and Society research theme lead South East Doctoral Training Arc (SEDArc) Departmental leadCommunications lead Teaching Responsibilities (2025 - 2026) MSc Information Security IY5501: Security Management and Methods (Module Co-Lead)IY5500: MSc Project (Project Supervisor) MSci Computer Science (Cyber Security) IY4501: Security Management (Module Lead) Research Themes 1. Digital Decisions This explores how different groups of people – ranging from practitioners, researchers, and policy-makers – understand the role of decision with regards to the use of machine learning techniques (often summarised as ‘artificial intelligence’) within cyber security. This takes the role of 'terrain' to examine how decisions become hybrid along with computational forms of recursivity. This draws on research continuing from Andrew's PhD on 'Malware Ecologies.' 2. Contested (Geo)Political Economies of Cyber Policy This examines how cyber policy and regulation are transforming over time as cyber security becomes embedded within everyday life. This is especially so as it expands and incorporates private and public actors, as well as facing internationally through both offensive and defensive state cyber operations. 3. ‘Critical’ Approaches to Cyber Security This research strand challenges dominant and normative assumptions of what it means to be secure. That is, what may we be missing, and crucially, how may we develop new ways of thinking and doing that addresses those who are marginalised, including those from the global majority, and who may be embedded with, and exposed to, greater forms of differentiated forms of power and vulnerability. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationCyber Security, DPhil, Malware Ecologies: A Politics of Cybersecurity, School of Geography and Environment, University of OxfordAward Date: 15 Nov 2019 Research output 13 Article 6 Chapter 4 Other contribution 2 Commissioned report 6 More 2 Other report 2 Paper 1 Chapter (peer-reviewed) 1 Internet publication Research output per year Research output per year Cybersecurity’s grammars: A more-than-human geopolitics of computationDwyer, A. C., Mar 2023, In: Area. 55, 1, p. 10-17 8 p.Research output: Contribution to journal › Article › peer-review Open Access From Cyber Security to Cyber Power: Appraising the Emergence of ‘Responsible, Democratic Cyber Power’ in UK StrategyDevanny, J. & Dwyer, A., Jun 2023, 15th International Conference on Cyber Conflict Meeting Reality. Jančárková, T., Giovannelli, D., Podiņš, K. & Winther, I. (eds.). NATO Cooperative Cyber Defence Centre of Excellence (CCDCoE), p. 381-397 17 p. (International Conference on Cyber Conflict (CyCon)).Research output: Chapter in Book/Report/Conference proceeding › Chapter (peer-reviewed) › peer-review Open AccessFile 148 Downloads (Pure) The unknowable conflict: Tracing AI, recognition, and the death of the (human) loopDwyer, A., Apr 2023, Artificial Intelligence and International Conflict in Cyberspace. Cristiano, F., Broeders, D., Delerue, F., Douzet, F. & Géry, A. (eds.). 1 ed. Routledge, p. 19 46 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter Open Access Topologies of security: inquiring in/security across postcolonial and postsocialist scenesDwyer, A., Langenohl, A. & Lottholz, P., 9 May 2023, (E-pub ahead of print) In: Critical Studies on Security. 11, 1, p. 1-13 13 p.Research output: Contribution to journal › Article › peer-review Open AccessFile 19 Downloads (Pure) Zoom Obscura: Counterfunctional Design for Video-ConferencingElsden, C., Chatting, D., Duggan, M., Dwyer, A. C. & Thornton, P., 2022, p. 1-17.Research output: Contribution to conference › Paper › peer-review Open Access View all 31 research outputs Projects 1 Finished 3 Active Projects per year Whole of Society for Cyber Power? A comparative analysis of privacy, identity, and trust in Australia and the UKDwyer, A. (PI) & Bruce, M. (PI)Eng & Phys Sci Res Council EPSRC1/09/25 → 31/03/26Project: Research Fake in the CommunityDwyer, A. (PI), Coles-Kemp, L. (CoI), Quaglia, E. (CoI) & Francati, D. (CoI)Arts & Humanities Research Council AHRC1/07/25 → 1/03/26Project: Research Equitable PrivacyColes-Kemp, L. (PI) & Dwyer, A. (CoI)1/09/22 → 28/02/26Project: Research Securing Converged TechnologiesDwyer, A. (PI)Department for Science, Innovation & Technology4/11/24 → 28/02/25Project: Research Activities 1 Consultancy Activities per year Commercial Offensive Cyber SectorDwyer, A. (Consultant)Jan 2024 → Mar 2024Activity: Consultancy and specialist advice › Consultancy",
  "content_length": 7195,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:28"
}