{
  "name": "Andrea Massa",
  "homepage": "http://www.soi.unitn.it/staff/andrea-massa",
  "status": "success",
  "content": "Andrea Massa - School of Innovation - Università di Trento Andrea MassaAndrea Massa (IEEE Fellow, IET Fellow, Electromagnetic Academy Fellow) is Full Professor of Electromagnetic Fields at the University of Trento, where he currently teaches electromagnetic fields, inverse scattering techniques, antennas and wireless communications, wireless services and devices, and optimization techniques. At present, Prof. Massa is the director of the network of federated laboratories “ELEDIA Research Center” [ELEDIA@UTB in Bandar Seri Begawan (Brunei), ELEDIA@UESTC in Chengdu (China), ELEDIA@USIL in Lima (Perù), ELEDIA@UniNAGA in Nagasaki (Japan), ELEDIA@L2S in Paris (France), ELEDIA@CTU in Prague (Czech), ELEDIA@UniTN in Trento (Italy), ELEDIA@TSINGHUA in Beijing (China), ELEDIA@Innov’COM in Tunis (Tunisia)]. Moreover, he is Adjunct Professor at Penn State University (USA), Professor @ CentraleSupélec (France), and UC3M-Santander Chair of Excellence at the Universidad Carlos III de Madrid (Spain). He has been holder of a Senior DIGITEO Chair at L2S-CentraleSupélec and CEA LIST in Saclay (France), Visiting Professor at the Missouri University of Science and Technology (USA), the Nagasaki University (Japan), the University of Paris Sud (France), the Kumamoto University (Japan), and the National University of Singapore (Singapore). It has been appointed IEEE AP-S Distinguished Lecturer (2016-2018). Prof. Massa serves as Associate Editor of the “IEEE Transaction on Antennas and Propagation” and Associate Editor of the “International Journal of Microwave and Wireless Technologies” and he is member of the Editorial Board of the “Journal of Electromagnetic Waves and Applications”, a permanent member of the “PIERS Technical Committee” and of the “EuMW Technical Committee”, and a ESoA member. He has been appointed in the Scientific Board of the “Società Italiana di Elettromagnetismo (SIEm)” and elected in the Scientific Board of the Interuniversity National Center for Telecommunications (CNIT). He has been appointed in 2011 by the National Agency for the Evaluation of the University System and National Research (ANVUR) as a member of the Recognized Expert Evaluation Group (Area 09, ‘Industrial and Information Engineering’) for the evaluation of the researches at the Italian University and Research Center for the period 2004-2010. Furthermore, he has been elected as the Italian Member of the Management Committee of the COST Action TU1208 “Civil Engineering Applications of Ground Penetrating Radar”. His research activities are mainly concerned with inverse problems, analysis/synthesis of antenna systems and large arrays, radar systems synthesis and signal processing, cross‐layer optimization and planning of wireless/RF systems, semantic wireless technologies, system-by-design and material‐by‐design (metamaterials and reconfigurable‐materials), and theory/applications of optimization techniques to engineering problems (tele-communications, medicine, and biology). Prof. Massa published more than 700 scientific publications (partial list available at: http://eledia.science.unitn.it/index.php/ricerca/pubblicazioni) among which about 300 on international journals and more than 450 in international conferences where he presented more than 150 invited contributions. He has organized more than 70 scientific sessions in international conferences and has participated to several technological projects in the European framework (20 EU Projects) as well as at the national and local level with national agencies (more than 150 Projects/Grants).Read moreCoursesWireless Technology for the Metaverse: Challenges, Trends, and InnovationsView all the Instructors Menu We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it.OkNoPrivacy policy",
  "content_length": 3863,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:52"
}