{
  "name": "Andreas Timm-Giel",
  "homepage": "https://www.tuhh.de/et6/homepage.html",
  "status": "success",
  "content": "ET6: Home Institute of Communication Networks (E-4) Institute of Communication Networks (E-4) EN DE EN DE Institute of Communication Networks Prof. Dr.-Ing. Andreas Timm-GielThe Institute of Communication Networks is part of the school of Electrical Engineering, Computer Science and Mathematics of Hamburg University of Technology (TUHH).Our research work is currently focused on the area of heterogeneous communication networks focusing on sensor networks, opportunistic networks, mobile and vehicular networks and future internet architectures. Our expertises are on modelling of different communication protocols, optimizing the network performance and evaluating communication protocols using simulators and testbed environments.We have 3 main research areas:Mobile and Vehicular communication (focus on shipping and aviation applications, modelling of delay, reliability and availability)Future Internet and Network Planning (virtualization, optimization of SDNs, performance optimization with Machine Learning)Sensor Networks, IoT and opportunistic networks (realization and modeling of reliable communication networks for safety critical applications, performance optimization)More details on our current ongoing BMBF/DFG/EU funded research projects can be found at Research.We involve in Teaching in both Bachelor and Master degrees of Computer Science, Computer Engineering, Electrical Engineering and Information Communication Systems at TUHH.If you are interested in our work, do not hesitate to contact us. Either select the person you want to contact or use the contact details below.(Note: please refer Student Theses if you are interested in student project requests) TU Hamburg Institute of Communication Networks (E-4) Prof. Dr.-Ing. Andreas Timm-Giel Am Schwarzenberg-Campus 3, Room E1.058 21073 Hamburg E-mail : comnets@tuhh.de Phone : +49 40 42878-3049/3249 Links Imprint Data Privacy Sitemap",
  "content_length": 1913,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:18"
}