{
  "name": "Andrew J. Stewart",
  "homepage": "https://research.manchester.ac.uk/en/persons/andrew.j.stewart",
  "status": "success",
  "content": "Andrew Stewart - Research Explorer The University of Manchester Andrew Stewart Professor Professor of Cognitive Science, Department of Computer ScienceHead of Department (Computer Science), Computer Science - Administration https://orcid.org/0000-0002-9795-4104 Personal profile Research interestsI am a Cognitive Scientist at The University of Manchester interested in data visualisation, language, open science, and reproducible research. Here is my Google Scholar profile. Email: [email protected] Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research Beacons, Institutes and PlatformsDigital FuturesManchester Institute for Collaborative Research on Ageing Fingerprint Dive into the research topics where Andrew Stewart is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Reading Time Psychology 100% Eye Movement Psychology 75% Priming Psychology 51% Syntactic Priming Psychology 45% Reproducibility Computer Science 45% Pronoun Psychology 30% Semantic Processing Psychology 30% Self-Report Psychology 30% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 52 Article 6 Conference contribution 4 Poster 2 Other 4 More 2 Paper 1 Chapter 1 Other contribution Research output per year Research output per year Developing a Data Note reporting guideline for qualitative health and social care research datasets (the DeNOTE study): A study protocolLong, H., Toomey, E., Stevenson, F., Brooks, J., Stewart, A. & French, D., 3 Jul 2025, (Accepted/In press) In: Health Psychology and Behavioral Medicine.Research output: Contribution to journal › Article › peer-review File Data Reuse 100% Research Network 50% Qualitative Researcher 50% Existing Guideline 50% Expert Knowledge 50% 32 Downloads (Pure) Effects of Alternative Scatterplot Designs on BeliefStrain, G., Stewart, A., Jay, C., Rutherford, C. & Warren, P. A., 28 Apr 2025, p. 1-13. 13 p.Research output: Contribution to conference › Paper › peer-review Open AccessFile Behavior (Neuroscience) 100% 37 Downloads (Pure) Effects of Point Size and Opacity Adjustments in ScatterplotsStrain, G., Stewart, A., Warren, P. A. & Jay, C., 11 May 2024.Research output: Contribution to conference › Paper › peer-review Open AccessFile Data Visualization 100% Visual Feature 100% Scatterplot 100% Great Deal 33% 67 Downloads (Pure) Magnitude Judgements Are Influenced by the Relative Positions of Data Points Within Axis LimitsBradley, D., Strain, G., Jay, C. & Stewart, A. J., 8 Feb 2024, In: IEEE Transactions on Visualization and Computer Graphics. p. 1-8 8 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Relative Position 100% Data Point 100% Axis Limit 100% Axis 100% Limits 100% 75 Downloads (Pure) UK Reproducibility Network: Open and Transparent Research Practices SurveyHughes-Noehrer, L., Aubert Bonn, N., De Maria, M., Evans, T. R., Farran, E. K., Fortunato, L., Henderson, E. L., Jacobs, N., Munafò, M. R., Stewart, S. L. K. & Stewart, A. J., 22 Mar 2024, Research Square.Research output: Other contribution Reproducibility 100% Active Research 100% Research Output 50% Open Research 50% Research Process 50% View all 68 research outputs Projects 2 Finished Projects per year Which fathers are involved in looking after their children? Identifying the conditions associated with paternal involvementNorman, H. (PI), Elliot, M. (CoI), Fagan, C. (CoI), Watt, L. (Researcher), Swan, J. (Support team), Himmelweit, S. (Support team) & Stewart, A. (Support team)1/02/16 → 31/07/17Project: Research UK 100% Domestic Work 50% Parenthood 50% Fathering 50% Fatherhood 50% CSEF: Centre for Sustainable Energy Use in Food ChainsAzapagic, A. (PI), Stewart, A. (CoI), Theodoropoulos, C. (CoI) & Wossink, A. (CoI)1/05/13 → 30/04/18Project: Research Environmental Impact Assessment 100% Lifecycle 83% Environmental Impact 50% Sustainability Assessment 49% Environmental Sustainability 49% Datasets Supporting Research and Researchers through the deployment of Digital Notebooks: A framework for implementation and impactBird, J. (Creator), Porter, A. (Creator), Aubert Bonn, N. (Creator) & Stewart, A. (Creator), University of Manchester Figshare, 17 Jun 2025DOI: 10.48420/29266853.v1, https://figshare.manchester.ac.uk/articles/poster/Supporting_Research_and_Researchers_through_the_deployment_of_Digital_Notebooks_A_framework_for_implementation_and_impact/29266853/1 and one more link, https://figshare.manchester.ac.uk/articles/poster/Supporting_Research_and_Researchers_through_the_deployment_of_Digital_Notebooks_A_framework_for_implementation_and_impact/29266853 (show fewer)Dataset",
  "content_length": 5209,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:35"
}