{
  "name": "Andreas Miroslaus Wichert",
  "homepage": "http://web.tecnico.ulisboa.pt/~andreas.wichert",
  "status": "success",
  "content": "Dr. Andreas Wichert Andreas (Andrzej) Wichert Associated Professor with Habilitation ORCID , AMS profile , Google Scholar , ResearchGate , dblp , amazon Univesidade de Lisboa / INESC-ID Campus IST-Taguspark / Avenida Professor Cavaco Silva 2744-016 Porto Salvo, Portugal Email: andreas.wichert at tecnico.ulisboa.pt Telephone: +351 214233231, Office: 2N-5.7 Born in Poland, Wroclaw. His grandfather Wladyslaw Wichert was a Polish officer. He studied computer science at the University of Saarland, where he graduated in 1993. Afterwards, he became a PhD student at the Department of Neural Information Processing, University of Ulm. During this period he worked at the DaimlerChrysler Research and Technology Speech Recognition Group. He received a PhD in computer science in 2000 with his work on associative computation. He has since worked in the field of fMRI as a researcher with an interdisciplinary group, Department of Psychiatry III Ulm, changing to F&K Delvotec bonding machines where he led the development of a diagnostic expert system. From 2004 to 2005 he was the scientific director of MITI research group Klinikum rechts der Isar of the Technical University Munich. Since 2006, he is a researcher of INESC-ID. Since 2009 he is a member of the Group of AI for People and Society (gaips). His research focuses on Artificial Intelligencei, Machine Learning, Neural Networks, Quantum Cognition, Quantum Artificial Intelligence. My Computer The Best Computer Ever :-) Supported: Text Processing, Basic, Pascal, Prolog, C, Forth, Z80 Assember Motivated the Book Quantum Artificial Intelligence with Qiskit Recent Books Quantum Artificial Intelligence with Qiskit Introducing symbolical quantum algorithms, sub symbolical quantum algorithms and quantum Machine Learning (ML) algorithms, this book explains each process step-by-step with associated QISKIT listings. All examples are additionally available for download at GitHub (supports qiskit 0.x, 1.x and 2.x) Please email me corrections, suggestions or comments! Mind, Brain, Quantum AI, and the Multiverse Indicates how we can provide an answer to the problem of the mind and consciousness by describing the nature of the physical world, proposed explanation includes the Everett Many-Worlds theory. Essential compilation of knowledge in philosophy, computer science, biology, and quantum physics. It is written for readers without any requirements in mathematics, physics, or computer science. Please email me corrections, suggestions or comments! Recent Publications Jose Miguel Ramos and Luis Sa-Couto and Andreas Wichert, Multilevel Data Representation for Training Deep Helmholtz Machines, Neural Computation, : 1-24, 2025 doi:10.1162/neco_a_i01748 Publications Projects HEIDI (HEIGH Dimensional Indexing) or how to index one billion of vectors Lectures (.. in the majority of cases you can download the slides at the menue point Teoricas) [L1] Artificial Intelligence 96/97, 97/98, 15/16, 18/19 [L2] Telemedicine 03/04, 04/05 [L3] Decision Support Systems A-05/06, T-05/06, 06/07, 07/08, 08/09, 09/10, 10/11, 11/12, 13/14, 14/15, 15/16, 16/17, 17/18 [L4] Intelligent Multimedia Databases: 06/07, 07/08, 08/09, 09/10 10/11, 11/12, 13/14, 14/15 [L5] Algorithms: 06/07, 07/08, 08/09 [L6] Information and Computation for AI: 07/08, 09/10, 10/11, 11/12, 13/14, 14/15 [L7] Symbolical and Subsymbolical learning 08/09, 09/10, 11/12, 13/14, 14/15, 15/16, 16/17 18/19 19/20 20/21 21/22 22/23 23/24 24/25 [L8] Logic for Programming 17/18 24/25 25/26 [L9] Machine Learning 18/19 19/20 20/21 21/22 22/23 23/24 24/25 25/26 [L10] Deep Learning 21/22 22/23 23/24 [L11] Quantum Artificial Intelligence 25/26 Excellence result in teaching for Logic for Programming 24/25, Machine Learning 21/22, 23/24, 24/25 Decision Support Systems 14/15 and Intelligent Multimedia Databases and 14/15 Manual R for Data Science Machine Learning Slides PhD Student Maria Osorio Jose Miguel Penedo Ramos Joaquim Domingos Mussandi PhD Students (past) Dr. Luis Tarrataca Dr. Angelo Cardoso Dr. Joao Sacramento Dr. Catarina Pinto Moreira Dr. Luis Sa-Couto Personal, Instagram, Facebook Catalogue: Holy Pictures of Another Time Painting, o obrazach, Portugal :-) O mojym ojcu i dziadku",
  "content_length": 4217,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:09"
}