{
  "name": "André Carlos Ponce de Leon Ferreira de Carvalho",
  "homepage": "http://www.cemeai.icmc.usp.br/andre",
  "status": "success",
  "content": "André Fujita - CeMEAI André Fujita Pesquisador Associado +55 11 3091 5177 Currículo Lattes Homepage Linhas de pesquisa Formação acadêmica/titulação Informações Linhas de pesquisa Conectividade e métodos estatísticos em grafos Formação acadêmica/titulação 2007 – Doutorado em Ciências (Bioinformática)Universidade de São Paulo, USP, Brasil, com período sanduíche em Universidade de TóquioTítulo: Análise de dados de expressão gênica: normalização de microarrays e modelagem de redes regulatórias2003 – Graduação em Ciência da ComputaçãoUniversidade de São Paulo, USP, BrasilTítulo: Anotação de genes associados com o controle da proliferação celular e origem de tumores. Informações Possui graduação em Ciência da Computação (2003), doutorado em Bioinformática (2007) e livre-docência (2016), todos pela Universidade de São Paulo. Realizou pós-doutorado na Universidade de Tóquio e é recipiente do Special Postdoctoral Researcher Program do RIKEN. Foi pesquisador visitante do Cancer Research Institute da Universidade de Kanazawa (Japão) em 2014 e 2015. Ganhou prêmios de melhor tese em ciência da computação pela Sociedade Brasileira de Computação, Menção Honrosa no prêmio CAPES de teses na área de Ciências Biológicas I, e é Fellow do Alexander von Humboldt Foundation (Alemanha). Trabalha com temas relacionados à conectividade e métodos estatísticos em grafos, ambos com aplicações na análise de dados biológicos em larga escala (“omics”, EEG, fMRI). Atualmente é Professor Associado do Instituto de Matemática e Estatística da Universidade de São Paulo. Linhas de pesquisa Formação acadêmica/titulação Informações Linhas de pesquisa Conectividade e métodos estatísticos em grafos Formação acadêmica/titulação 2007 – Doutorado em Ciências (Bioinformática)Universidade de São Paulo, USP, Brasil, com período sanduíche em Universidade de TóquioTítulo: Análise de dados de expressão gênica: normalização de microarrays e modelagem de redes regulatórias2003 – Graduação em Ciência da ComputaçãoUniversidade de São Paulo, USP, BrasilTítulo: Anotação de genes associados com o controle da proliferação celular e origem de tumores. Informações Possui graduação em Ciência da Computação (2003), doutorado em Bioinformática (2007) e livre-docência (2016), todos pela Universidade de São Paulo. Realizou pós-doutorado na Universidade de Tóquio e é recipiente do Special Postdoctoral Researcher Program do RIKEN. Foi pesquisador visitante do Cancer Research Institute da Universidade de Kanazawa (Japão) em 2014 e 2015. Ganhou prêmios de melhor tese em ciência da computação pela Sociedade Brasileira de Computação, Menção Honrosa no prêmio CAPES de teses na área de Ciências Biológicas I, e é Fellow do Alexander von Humboldt Foundation (Alemanha). Trabalha com temas relacionados à conectividade e métodos estatísticos em grafos, ambos com aplicações na análise de dados biológicos em larga escala (“omics”, EEG, fMRI). Atualmente é Professor Associado do Instituto de Matemática e Estatística da Universidade de São Paulo.",
  "content_length": 3019,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:02"
}