{
  "name": "Andreas Rauh",
  "homepage": "https://uol.de/informatik/dcis/team/prof-dr-ing-habil-andreas-rauh",
  "status": "success",
  "content": "Prof. Dr.-Ing. habil. Andreas Rauh // Universität Oldenburg Fk. II Department für Informatik Verteilte Regelung in Vernetzten Systemen Prof. Dr.-Ing. habil. Andreas Rauh Prof. Dr.-Ing. habil. Andreas Rauh Department für Informatik  (» Postanschrift) Carl von Ossietzky Universität Oldenburg Ammerländer Heerstraße 114-118 26129 Oldenburg I11-0-010a (» Adresse und Lageplan)Jederzeit, eine Anmeldung per e-Mail wird erbeten+49 441 798-4195  (F&P) vCard QR-Code Ingrid Ahlhorn ingrid.ahlhorn@uol.de +49 (0) 441 - 798 2426 I11 0-014 Industriestrasse 11, 26121 Oldenburg Prof. Dr.-Ing. habil. Andreas Rauh Prof. Dr.-Ing. habil. Andreas Rauh schloss sein Studium der Elektro- und Informationstechnik an der TU München im Jahr 2001 ab. Er promovierte im Jahr 2008 am Institut für Mess-, Regel- und Mikrotechnik der Universität Ulm und habilitierte sich auf dem Fachgebiet der Mess- und Regelungstechnik im Jahr 2017 an der Fakultät für Maschinenbau und Schiffstechnik der Universität Rostock. Nachdem er einen einjährigen Forschungsaufenthalt an der École nationale supérieure de techniques avancées (ENSTA) Bretagne in Brest absolvierte, leitet Andreas Rauh seit Oktober 2021 die Abteilung Verteilte Regelung in Vernetzten Systemen am Department für Informatik der Carl von Ossietzky Universität Oldenburg. Seine Forschungsschwerpunkte sind die Zustands- und Parameterschätzung für dynamische Systeme mit stochastischen und mengenbasierten Unsicherheiten, deren verlässliche Simulation sowie deren robuste und optimale Regelung. Darüber hinaus war er von 2008 bis 2015 Mitglied einer IEEE-Arbeitsgruppe, welche Methoden der Intervallarithmetik als mathematische Methode zur automatischen Fehlerabschätzung standardisierte. Wintersemester 2025 / 2026 2.01.340 Uncertainty Modelling for Control in Digitalised Energy Systems 2.01.341 Robust Control and State Estimation in Digitalised Energy Systems 2.01.5110 Practical Course (Energy Informatics) 2.01.5124 Research Project Digitalised Energy Systems 2.01.585 Project “Research-oriented learning” – Hardware-in-the-Loop Simulation in Energy Informatics 2.01.800-G Proseminar: Modellbildung und Regelungstechnik in der Technischen Informatik 2.01.801-T Forschungsseminar Verteilte Regelung in vernetzten Systemen 2.01.804 Projekt \"Forschendes Lernen\" - Mobiles Multiagenten-Robotersystem 2.01.808-B Forschungsseminar ENSTA (für Studierende der ENSTA Bretagne) 2.01.AM-20 Oberseminar Verteilte Regelung in vernetzten Systemen 2.01.900-A Projektgruppe der Abteilung VRiVS (findet nicht statt) 2.01.900-B Projektgruppe: RescueRobots Für einen Überblick über meine wissenschaftlichen Publikationen sei auf meine folgenden Profile verwiesen:ORCiD: https://orcid.org/0000-0002-1548-6547Researchgate: https://www.researchgate.net/profile/Andreas-Rauh-4Google Scholar: https://scholar.google.com/citations?user=Z6wxka8AAAAJ&hl=deScopus: https://www.scopus.com/authid/detail.uri?authorId=6603062784 Webmaster (Stand: 30.10.2024) |  Kurz-URL:Shortlink: https://uol.de/p91483 Zum Seitananfang scrollen Scroll to the top of the page",
  "content_length": 3063,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:14"
}