{
  "name": "Andrea Calvagna",
  "homepage": "https://web.dmi.unict.it/docenti/andrea.calvagna",
  "status": "success",
  "content": "Andrea CALVAGNA | Dipartimento di Matematica e Informatica Vai al contenuto principaleVai al menu di navigazione Vai ai contenuti correlati Andrea CALVAGNA Ricercatore t.d. (art. 24 c.3-a L. 240/10) di Informatica [INFO-01/A] Contatti Ufficio: Stanza 51 (3° Blocco)Email: andreamario.calvagna@unict.it Orario di ricevimento Martedì e giovedì dalle 11:00 alle 12:00 (si prega di contattare per concordare via email o teams) Sede del ricevimento: in ufficio o su teams ENGLISH VERSIONSTUDIUMAREA RISERVATA BIOGRAFIACURRICULUMPUBBLICAZIONIINSEGNAMENTIAVVISI Laureato in Ingegneria Informatica (v.o.) con 110/110 e lode presso l'Università degli studi di Catania, ha conseguito il Dottorato di Ricerca in Ingegneria Informatica (Ph.D.) all'università degli studi di Palermo nel 2002. Dal 1999 ad oggi ha svolto attività scientifica su diversi temi inerenti il campo dell’informatica ed in particolare dell'ingegneria del software, come dottorando e come assegnista di numerosi temi di ricerca presso i dipartimenti di Ingegneria Informatica e Telecomunicazioni (ora DIEE) e di Matematica e Informatica (DMI) dell’Università degli Studi di Catania. Inoltre ha svolto ampissima attivita' di docenza, continuativamente per circa venticinque anni, come cultore della materia, docente a contratto e docente incaricato, in numerossimi corsi accademici sia curricolari che di master universitari. Recentemente, si è occupato di applicazioni distribuite in ambito blockchain applicate a tematiche green e ha trascorso come visiting professor un periodo di collaborazione alla ricerca con l'HYCODEV research group dell'università di Newcastle (UK) in cui si è occupato della sintesi automatica di controllori sicuri e robusti per sistemi di agenti autonomi. Laureato in Ingegneria Informatica (v.o.) con 110/110 e lode presso l'Università degli studi di Catania, ha conseguito il Dottorato di Ricerca in Ingegneria Informatica (Ph.D.) all'università degli studi di Palermo nel 2002. Dal 1999 ad oggi ha svolto attività scientifica su diversi temi inerenti il campo dell’informatica ed in particolare dell'ingegneria del software, come dottorando e come assegnista di numerosi temi di ricerca presso i dipartimenti di Ingegneria Informatica e Telecomunicazioni (ora DIEE) e di Matematica e Informatica (DMI) dell’Università degli Studi di Catania. Inoltre ha svolto ampissima attivita' di docenza, continuativamente per circa venticinque anni, come cultore della materia, docente a contratto e docente incaricato, in numerossimi corsi accademici sia curricolari che di master universitari. Recentemente, si è occupato di applicazioni distribuite in ambito blockchain applicate a tematiche green e ha trascorso come visiting professor un periodo di collaborazione alla ricerca con l'HYCODEV research group dell'università di Newcastle (UK) in cui si è occupato della sintesi automatica di controllori sicuri e robusti per sistemi di agenti autonomi. VISUALIZZA LE PUBBLICAZIONI N.B. l'elevato numero di pubblicazioni può incidere sul tempo di caricamento della pagina VISUALIZZA GLI INSEGNAMENTI DALL'A.A. 2022/2023 AD OGGI Anno accademico 2021/2022 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 2° annoINGEGNERIA DEL SOFTWARE A - L DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 2° annoINGEGNERIA DEL SOFTWARE M - Z VISUALIZZA GLI INSEGNAMENTI PRECEDENTI ARCHIVIO Condividi Facebook Twitter Whatsapp Telegram Email Storia del DMI Regolamenti Organi e Commissioni Personale del DMI Docenti Personale Tecnico/Amministrativo Assegnisti di ricerca Dottorandi Coordinamento dipartimentale Amministrazione, Uffici e Servizi Guide Procedure e moduli Assicurazione della Qualità DMI sui social Aule Link utili Cerca nel sito Termini da ricercare",
  "content_length": 3776,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:41"
}