{
  "name": "Andreas Birk 0002",
  "homepage": "http://robotics.jacobs-university.de/people/birk",
  "status": "success",
  "content": "Andreas Birk – Robotics at Constructor University Skip to content No results Mailing Address: Prof. Dr. Andreas BirkConstructor UniversityCampus Ring 1, 28759 Bremen, GermanyPhone: +49-421-200-3113Email: abirk AT constructor.universityOffice Location: Building Research 1, Room 39, Campus Ring 12directions for visitors Research Interests With respect to my research interests I am a split-personality . On the one hand, I am interested in a scientific question which is purely basic research, namely the constructive understanding of intelligence. On the other hand, I have got a strong interest in engineering, especially in robotics linked to AI, and I am interested in research that leads to concrete applications. I do not think that these two things contradict each other. In contrary, generating in the long term a machine with human-like intelligence is imho to a large extent an engineering challenge. Activities & Projects An overview of my activities is given at the research part of the Constructor University Robotics group website. I started the group in September 2001 with the very beginning of research and teaching activities at Constructor University. Its main focus of research is on Autonomous Systems. The expertise ranges from the development of embedded hardware over mechatronics and sensors to high-level software. On the basic research side of autonomous systems, machine perception is a core theme. The systems developed at Constructor University are used in various domains including marine robotics, autonomous driving, response operations (e.g., search and rescue), planetary exploration and logistics. I am also interested in robotics education, i.e., the education in the field of robotics as well as using robotics within science, technology, engineering, and math (STEM) education in general. Selected Previous Projects (before Constructor University) RoboGuard Robot Ecosystem Educational Robots in High-Schools (RIDS) Small Size (F180) Robot Soccer CubeSystem based on the RoboCube Learning of Hand Eye Coordination Publications & Bibliometrics ResearchGate (https://www.researchgate.net/profile/Andreas-Birk) Google Scholar (https://scholar.google.com/citations?user=CR5fEFYAAAAJ) ORCID (https://orcid.org/0000-0003-4577-2525) Scopus (https://www.scopus.com/authid/detail.uri?authorId=7005194050) My Erdös-number is 3, namely via my PhD-advisor Wolfgang J. Paul who has 2 as he published with several Erdos-number 1 people (Fan Ron King (Graham) Chung, Maria Margaret Klawe, Endre Szemeredi, and William Thomas Trotter Jr.). A selection of my “recent” publications, i.e., from Fall 2001 on, can be found on the Constructor University Robotics publications page. My older publications from before Fall 2001, i.e., my time before Constructor University, can be found on a separate page.",
  "content_length": 2822,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:54"
}