{
  "name": "Andrei Popescu 0001",
  "homepage": "https://www.sheffield.ac.uk/cs/people/academic/andrei-popescu",
  "status": "success",
  "content": "Dr Andrei Popescu | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Andrei Popescu PhD School of Computer Science Senior Lecturer in Computing Foundations School Programmes Lead (PGT) Member of the Security of Advanced Systems research group Member of the Foundations of Computation research group Open staff member portrait in a modal window a.popescu@sheffield.ac.uk Regent Court (DCS) Full contact details Dr Andrei Popescu School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0001-8747-0619 Google Scholar Profile Andrei has been a Senior Lecturer in the Security of Advanced Systems group since May 2020. Previously, he worked as a Lecturer at Middlesex University and as a postdoctoral researcher at TU Munich. He has a Ph.D. in computer science from the University of Illinois at Urbana-Champaign and a Ph.D. in mathematics from the University of Bucharest. Research interests Proof assistantsInformation flow securityInductive and coinductive datatypesAutomated deductionSyntax with bindings Publications Journal articles Cohen L, Jabarin A, Popescu A & Rowe RNS (2024) The complex(ity) landscape of checking infinite descent. Proceedings of the ACM on Programming Languages, 8(POPL), 1352-1384. View this article in WRRO Popescu A (2024) Nominal recursors as epi-recursors. Proceedings of the ACM on Programming Languages, 8(POPL). View this article in WRRO Popescu A (2023) Rensets and renaming-based recursion for syntax with bindings extended version. Journal of Automated Reasoning, 67(3). View this article in WRRO Popescu A & Traytel D (2023) Admissible types-to-PERs relativization in higher-order logic. Proceedings of the ACM on Programming Languages, 7(POPL), 1214-1245. View this article in WRRO Popescu A & Traytel D (2021) Distilling the requirements of Gödel’s incompleteness theorems with a proof assistant. Journal of Automated Reasoning, 65(7), 1027-1070. Popescu A, Lammich P & Hou P (2021) CoCon: a conference management system with formally verified document confidentiality. Journal of Automated Reasoning, 65(2), 321-356. View this article in WRRO (2020) Preface. IOP Conference Series: Materials Science and Engineering, 997(1), 011001-011001. Gheri L & Popescu A (2020) A formalized general theory of syntax with bindings: extended version. Journal of Automated Reasoning, 64(4), 641-675. Blanchette JC, Gheri L, Popescu A & Traytel D (2019) Bindings as bounded natural functors. Proceedings of the ACM on Programming Languages, 3(POPL), ---. Cerrito S & Popescu A (2019) Preface. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 11714 LNAI, V-vi. Herzig A & Popescu A (2019) Preface. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 11715 LNAI, v-vi. Kunčar O & Popescu A (2019) From types to sets by local type definition in higher-order logic. Journal of Automated Reasoning, 62(2), 237-260. Kunčar O & Popescu A (2019) A consistent foundation for Isabelle/HOL. Journal of Automated Reasoning, 62(4), 531-555. Avigad J, Blanchette JC, Klein G, Paulson L, Popescu A & Snelting G (2018) Introduction to milestones in interactive theorem proving. Journal of Automated Reasoning, 61(1-4), 1-8. View this article in WRRO Kunčar O & Popescu A (2018) Safety and conservativity of definitions in HOL and Isabelle/HOL. Proceedings of the ACM on Programming Languages, 2(POPL), ---. Bauereiß T, Pesenti Gritti A, Popescu A & Raimondi F (2018) CoSMed: a confidentiality-verified social media platform. Journal of Automated Reasoning, 61(1-4), 113-139. Blanchette J, Böhme S, Popescu A & Smallbone N (2017) Encoding monomorphic and polymorphic types. Logical Methods in Computer Science, 12(4), 1-52. Blanchette JC, Popescu A & Traytel D (2017) Soundness and completeness proofs by coinductive methods. Journal of Automated Reasoning, 58(1), 149-179. (2016) 7th International Conference on Advanced Concepts in Mechanical Engineering. IOP Conference Series: Materials Science and Engineering, 147, 011001-011001. Blanchette JC, Popescu A & Traytel D (2015) Foundational extensible corecursion: a proof assistant perspective. ACM SIGPLAN Notices, 50(9), 192-204. View this article in WRRO Blanchette JC, Popescu A & Traytel D (2015) Witnessing (Co)datatypes. Programming Languages and Systems: 24th European Symposium on Programming, ESOP 2015, Held as Part of the European Joint Conferences on Theory and Practice of Software, ETAPS 2015, London, UK, April 11-18, 2015, Proceedings, 9032, 359-382. View this article in WRRO Popescu A & Roşu G (2015) Term-generic logic. Theoretical Computer Science, 577, 1-24. View this article in WRRO Nipkow T & Popescu A (2014) Making security type systems less ad hoc. IT - Information Technology, 56(6), 267-272. View this article in WRRO Doroftei I, Oprisan C & Popescu A (2014) Preface. Applied Mechanics and Materials, 659. Doroftei I, Oprisan C & Popescu A (2014) Preface. Applied Mechanics and Materials, 658. Popescu A, Hölzl J & Nipkow T (2013) Formal verification of language-based concurrent noninterference. Journal of Formalized Reasoning, 6(1), 1-30. Popescu A & Gunter EL (2011) Recursion principles for syntax with bindings and substitution. ACM SIGPLAN Notices, 46(9), 346-358. Popescu A, Şerbănuţă TF & Roşu G (2009) A semantic approach to interpolation. Theoretical Computer Science, 410(12-13), 1109-1128. Popescu A (2007) Some algebraic theory for many-valued relation algebras. Algebra universalis, 56(2), 211-235. Gâinâ D & Popescu A (2007) An Institution-Independent Proof of the Robinson Consistency Theorem. Studia Logica, 85(1), 41-73. Georgescu G & Popescu A (2006) A new class of probabilities on Łukasiewicz-Moisil algebras. Journal of Multiple Valued Logic and Soft Computing, 12(3-4 SPEC. ISS.), 337-354. Georgescu G & Popescu A (2006) A common generalization for MV-algebras and Łukasiewicz–Moisil algebras. Archive for Mathematical Logic, 45(8), 947-981. Georgescu G, Leuştean I & Popescu A (2006) Order convergence and distance on Łukasiewicz-Moisil algebras. Journal of Multiple Valued Logic and Soft Computing, 12(1-2), 33-69. Popescu A (2005) Łukasiewicz-Moisil Relation Algebras. Studia Logica, 81(2), 167-189. Popescu A (2005) Many-valued relation algebras. Algebra universalis, 53(1), 73-108. Georgescu G & Popescu A (2004) Non-dual fuzzy connections. Archive for Mathematical Logic, 43(8), 1009-1039. Popescu A (2004) A general approach to fuzzy concepts. Mathematical Logic Quarterly, 50(3), 265-280. Georgescu G & Popescu A (2004) Non-commutative fuzzy structures and pairs of weak negations. Fuzzy Sets and Systems, 143(1), 129-155. Georgescu G & Popescu A (2003) Non-commutative fuzzy Galois connections. Soft Computing, 7(7), 458-467. Georgescu G & Popescu A (2002) Concept lattices and similarity in non-commutative fuzzy logic. Fundamenta Informaticae, 53(1), 23-54. Popescu A () Supernominal Datatypes and Codatatypes. Electronic Proceedings in Theoretical Computer Science, 332. () The 8th International Conference on Advanced Concepts in Mechanical Engineering. IOP Conference Series: Materials Science and Engineering, 444, 011001-011001. () An Institution-independent Generalization of Tarski's Elementary Chain Theorem. Journal of Logic and Computation, 17(3), 605-605. Gaina D & Popescu A () An Institution-independent Generalization of Tarski's Elementary Chain Theorem. Journal of Logic and Computation, 16(6), 713-735. Book chapters Graczyk A, Hadjikosti M & Popescu A (2024) A Framework for Verifying the Collision Freeness of Collaborative Robots (Work in Progress), Lecture Notes in Computer Science (pp. 391-397). Springer Nature Switzerland Popescu A & Roşu G (2009) Term-Generic Logic, Lecture Notes in Computer Science (pp. 290-307). Springer Berlin Heidelberg Popescu A, Şerbănuţă TF & Roşu G (2006) A Semantic Approach to Interpolation, Lecture Notes in Computer Science (pp. 307-321). Springer Berlin Heidelberg Popescu A & Roşu G (2005) Behavioral Extensions of Institutions, Lecture Notes in Computer Science (pp. 331-347). Springer Berlin Heidelberg Conference proceedings van Brügge J, Popescu A & Traytel D (2025) Animating MRBNFs: Truly Modular Binding-Aware Datatypes in Isabelle/HOL. Leibniz International Proceedings in Informatics Lipics, Vol. 352 Popescu A (2025) Completing Gordon’s Higher-Order Logic. 2025 40th Annual ACM/IEEE Symposium on Logic in Computer Science (LICS), Vol. 00 (pp 1-15) van Brügge J, McKinna J, Popescu A & Traytel D (2025) Barendregt Convenes with Knaster and Tarski: Strong Rule Induction for Syntax with Bindings. Proceedings of the ACM on Programming Languages, Vol. 9(POPL) (pp 1687-1718) Dongol B, Griffin M, Popescu A & Wright J (2024) Relative security: formally modeling and (dis)proving resilience against semantic optimization vulnerabilities. 2024 IEEE 37th Computer Security Foundations Symposium (CSF) (pp 403-418). Enschede, Netherlands, 8 July 2024 - 8 July 2024. View this article in WRRO Buday G & Popescu A (2024) Isomorphic Transfer Infrastructure for Nested Types in Isabelle/HOL (Work in Progress). Ceur Workshop Proceedings, Vol. 3860 (pp 38-48) Popescu A (2022) Rensets and renaming-based recursion for syntax with bindings. Automated Reasoning: 11th International Joint Conference, IJCAR 2022, Haifa, Israel, August 8–10, 2022, Proceedings (pp 618-639). Haifa, Israel, 8 August 2022 - 10 August 2022. Popescu A, Bauereiss T & Lammich P (2021) Bounded-deducibility security. 12th International Conference on Interactive Theorem Proving (ITP 2021), Vol. 193 (pp 3:1-3:20). Online, 29 June 2021 - 1 July 2021. (2020) FroCoS/TABLEAUX 2019 COSPONSORED BY THE ASSOCIATION FOR SYMBOLIC LOGIC London, UK September 2–6, 2019. The Bulletin of Symbolic Logic, Vol. 26(3-4) (pp 312-312) Popescu A &",
  "content_length": 16820,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:23"
}