{
  "name": "Andrew Roth",
  "homepage": "https://aroth85.github.io",
  "status": "success",
  "content": "About - Andrew Roth Andrew RothBioinformatics PhD Follow Vancouver, Canada University of British Columbia Email Bitbucket Github Google ScholarI am an assistant professor at the University of British Colubmia in the Departments of Computer Science and Pathology and a scientist in the Department of Molecular Oncology at the British Columbia Cancer Agency.ResearchMy research is primarily focused on the development and application of statistical and machine learning methods for analysing cancer omics data. The methods I develop leverage probabilistic graphical models and non-parametric Bayesian methods to extract biologically interpretable quantities from complex datasets. I am also interested in developing computationally efficient inference algorithms to fit these models. I am particularly interested in variational and sequential Monte Carlo methods. These two themes support the ultimate goal of my research which is to understand evolutionary cancer biology.Selected papersPyClone: Statistical Inference of Clonal Population Structure in Cancer, Nature Methods 2014Particle Gibbs Split-Merge Sampling for Bayesian Inference in Mixture Models, Journal of Machine Learning Research 2017Clonal Genotype and Population Structure Inference From Single-Cell Tumor Sequencing, Nature Methods 2016Divergent Modes of Clonal Spread and Intraperitoneal Mixing in High-Grade Serous Ovarian Cancer, Nature Genetics 2016The Clonal and Mutational Evolution Spectrum of Primary Triple-Negative Breast Cancers, Nature 2012SoftwarePyClone - Software for inferring clonal population structure from bulk genomics sequencing.SCG - Software for inferring clonal population structure from noisy single cell sequencing.PGSM - Implementation of the efficient particle Gibbs split merge algorithm for inference in Dirichlet process mixture models.",
  "content_length": 1834,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:43"
}