{
  "name": "Andreas Nürnberger",
  "homepage": "http://www.findke.ovgu.de",
  "status": "success",
  "content": "Data and Knowledge Engineering Group - Data and Knowledge Engineering Group Data & Knowledge Engineering Group Im Zentrum der Forschungsarbeiten der Arbeitsgruppe Data & Knowledge Engineering steht die Entwicklung von Methoden zur interaktiven Informationssuche und -exploration. Neben dem Design adaptiver Nutzungsschnittstellen liegt ein Forschungsschwerpunkt in der Entwicklung von Verfahren, mit denen sich ein Retrieval-System dynamisch an die Anforderungen und Interessen des Benutzers anpassen kann. Dies umfasst die Entwicklung von Methoden, die das Verhalten individueller Nutzer sowie Nutzergruppen aufzeichnen und analysieren, um Informationen über ihre Anforderungen und Interessen zu erhalten. Diese Informationen werden dann zum Reorganisieren der Struktur und Darstellung der betrachteten Dokumentensammlung und der Suchergebnisse verwendet, um eine individuelle Nutzerunterstützung bei der Informationssuche zu ermöglichen. In der Lehre vermitteln wir Studierenden eine grundlegende Einführung in die genutzten Technologien und bieten vielfältige Möglichkeiten zur Mitarbeit in aktuellen Forschungsprojekten. Integrating AI and Medical Imaging: Foundations to Frontiers in Deep Learning 06.12.2024 - Die Blockveranstaltung Integrating AI and Medical Imaging: Foundations to Frontiers in Deep Learning soll eine umfassende, interdisziplinäre Grundlage bieten, die die Studierenden darauf vorbereitet, die Herausforderungen an der Schnittstelle zwischen medizinischer Bildgebung und maschinellem Lernen zu bewältigen. Am Ende des Kurses werden die Studierenden nicht nur technische Kenntnisse in der Handhabung und Verarbeitung medizinischer Bildgebungsdaten erworben haben, sondern auch die Fähigkeit, fortgeschrittene Techniken des maschinellen Lernens in diesem wichtigen Bereich zu entwickeln und anzuwenden. Das Ziel dieses Kurses ist es, eine einzigartige Mischung von Fähigkeiten zu vermitteln, die die Studierenden auf die Bearbeitung von Forschungsprojekten, Masterarbeiten oder eine zukünftige Karriere im interdisziplinären Bereich des maschinellen Lernens und der medizinischen Bildgebung vorbereiten. Die Veranstaltung findet vom 03.03.2025 bis zum 07.03.2025 in der Zeit von 9 bis 18 Uhr statt. Verantwortlicher: Dr. Soumick Chatterjee mehr ... International School on Artificial Intelligence for Cognitive Technologies 2024 24.10.2024 - Die diesjährige International School on Artificial Intelligence for Cognitive Technologies (ISACT 2024) findet vom 10. bis 13. Dezember in Neapel, im Süden Italiens, statt. Die von der Universität Neapel Federico II. ausgerichtete Veranstaltung bietet ein Programm, das sich an MasterstudentInnen und DoktorandInnen, NachwuchsforscherInnen und Fachleute aus der KI-Branche richtet. Die ISACT 2024 deckt die Themen Künstliche Intelligenz, erklärbare KI, Gehirn-Computer-Interaktion und Mensch-Computer-Interaktion ab. Die TeilnehmerInnen erleben Workshops, Vorträge und gemeinsame Projekte, die von weltweit anerkannten ExpertInnen gehalten und durchgeführt werden. mehr ... Digitalisierungsprojekt zur KI-basierten Angebotskalkulation 27.09.2024 - Am 09.09.2024 trafen sich die KI-Trainer des Mittelstand-Digital Zentrums Magdeburg, Sergii Kolomichuuk und Juliane Höbel-Müller, mit Herrn Claudius Borgmann, dem Geschäftsführer der FREROtec KG in Gernrode. Ziel des Besuchs des Zerspanungsbetriebs war es, die Einsatzmöglichkeiten von KI im Unternehmen zu diskutieren. Ein vielversprechender Aufgabenbereich scheint die zeitaufwändige Angebotskalkulation zu sein. mehr ... Digitale Degustation 20.08.2024 - Am 20.08.2024 fand in der Handwerkskammer Magdeburg die sog. Digitale Degustationdes Mittelstand-Digital Zentrums Magdeburg statt. Bei kühlem Cascara und süßen Speisen von regionalen Anbietern wurden KI-Tools vorgestellt und diskutiert sowie Erfahrungen von Magdeburger Unternehmen mit KI ausgetauscht. mehr ... Mitarbeitende der FIN beim KI Insights-Podcast 07.08.2024 - In den neuesten Folgen des Podcasts KI Insights, einer Initiative des ZAKKI-Projekts der Hochschule Magdeburg-Stendal, stehen Johannes Schleiß und Juliane Höbel-Müller der Fakultät für Informatik (FIN) der Otto-von-Guericke-Universität Magdeburg (OVGU) im Mittelpunkt. Sie veranschaulichen die transformative Bedeutung von KI in Bildung und Wirtschaft. mehr ... 1 2 RSS Veranstaltungen Derzeit keine Veranstaltungen weitere... Informationen zum Masterstudiengang Data and Knowledge Engineering finden Sie hier. Aktuelle Themen für Projekte und Abschlussarbeiten finden Sie hier Letzte Änderung: 27.08.2024 - Ansprechpartner:",
  "content_length": 4568,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:14"
}