{
  "name": "André Vasconcelos",
  "homepage": "https://fenix.tecnico.ulisboa.pt/homepage/ist10876/doutoramentos",
  "status": "success",
  "content": "Doutoramentos · José Manuel Nunes Salvador Tribolet José Manuel Nunes Salvador Tribolet pt en Teses de Doutoramento ( Concluídas)PhD Theses ( 2000-2012 - Concluded) Nuno Filipe Alves Gaiola Castela,  As-Is Represetnation in Enterprise Engineering: Processes and Tools for its Dynamic Updating, PhD Thesis, Instituto Superior Técnico, Universidade Técnica de Lisboa, Jul 2011 (before belonha).  [bibTeX] David Sardinha Andrade de Aveiro,  G.O.D. (Generation, Operationalization & Discontinuation) and Control (sub)organizations: a DEMO-based approach for continuous real-time management of organizational change caused by exceptions, PhD Thesis, Instituto Superior Técnico,Universidade Técnica de Lisboa, Jun 2010 (before belonha).  [bibTeX] Marielba Silva Zacarias,  A CONCEPTUAL FRAMEWORK BASED ON AGENTS AND CONTEXTS FOR THE ALIGNMENT BETWEEN INDIVIDUALS AND ORGANIZATIONS., PhD Thesis, Instituto Superior Técnico, Universidade Técnica de Lisboa, Jul 2008 (before belonha).  [bibTeX] Artur Caetano,  Business Process Modelling with Objects and Roles, PhD Thesis, Instituto Superior Técnico, Universidade Técnica de Lisboa, May 2008 (before belonha).  [bibTeX] André Ferreira Ferrão Couto e Vasconcelos,  ARQUITECTURAS DOS SISTEMAS DE INFORMAÇÃO: REPRESENTAÇÃO E AVALIAÇÃO, PhD Thesis, Instituto Superior Técnico, Universidade Técnica de Lisboa, Oct 2007 (before belonha).  [bibTeX] Carlos Alberto Lourenço dos Santos,  Modelo Conceptual para Auditoria Organizacional Contínua com Análise em Tempo Real, PhD Thesis, Instituto Superior Técnico, Feb 2007 (before belonha).  [bibTeX] Fernando Manuel Pereira da Costa Brito e Abreu,  Engenharia de Software Orientado a Objectos: Uma Aproximação Quantitativa, PhD Thesis, Instituto Superior Técnico, Universidade Técnica de Lisboa, Jun 2001 (before belonha).  [bibTeX]Teses de Doutoramento ( em Progresso)PhD Theses in Progress  João Pedro Marques Pombinho,  Towards Formalizing Purpose in Systems Design and Engineering - Value-orientation and Innovation, PhD Thesis, , Work in progress (before belonha).  [bibTeX] Carlos Jorge Ramos Páscoa,  Design and Organizational Engineering of the Operational and Support Dimensions of an Organization: The Portuguese Air Force case study, PhD Thesis, Instituto Superior Técnico, Universidade Técnica de Lisboa, Work in progress .  [bibTeX] Sérgio Luis Proença Duarte Guerreiro,  Enforcement of fine-grained Governance Rules in the Enterprise Ontology using DEMO, PhD Thesis, Instituto Superior Técnico, Universidade Técnica de Lisboa, Work in progress .  [bibTeX] Paulo Renato Esteves Gomes do Paço,  Entrerprise Engineering, PhD Thesis, , Work in progress (before belonha).  [bibTeX]",
  "content_length": 2672,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:16"
}