{
  "name": "Andrea Marrella",
  "homepage": "http://www.diag.uniroma1.it/marrella",
  "status": "success",
  "content": "Andrea Marrella - Home Page Home Research Stays Awards Project Grants Keynote and Panel Speaker Invited Talks Tutorials Institutional Responsabilities Professional Service Contact Information Teaching Publications Research Interests Projects Personal Details WELCOME ON MY WEB PAGE I am an Associate Professor in Computer Science and Engineering at Dipartimento di Ingegneria Informatica, Automatica e Gestionale \"A. Ruberti\" , Sapienza - Università di Roma. In March 2025, I got the National Scientific Habilitation (Abilitazione Scientifica Nazionale) as Full Professor for sector 01/B1 (Informatica). In June 2023, I got the National Scientific Habilitation (Abilitazione Scientifica Nazionale) as Full Professor for sector 09/H1 (Sistemi di Elaborazione delle Informazioni). My short cv can be found here. RESEARCH STAYS From January to June 2012, I have been a visiting researcher at York University in Toronto (Canada), Department of Computer Science and Engineering. From June to August 2013, I have been a visiting researcher at Ryerson University (now Toronto Metropolitan University) in Toronto (Canada), Department of Computer Science. From October to November 2016, I have been a visiting researcher at University of Tartu in Estonia, Institute of Computer Science. AWARDS My former PhD Student Simone Agostinelli won the Best Dissertation Award at 21st International Conference on Business Process Management (BPM 2023), for his PhD thesis on Synthesizing Software Robots from UI Logs in Robotic Process Automation. Best Forum Paper Award at the 31th International Conference on Advanced Information Systems Engineering (CAiSE 2019), 3-7 June 2019, Rome, Italy, for the paper: Achieving GDPR Compliance of BPMN Process Models. Best Paper Award at the 29th International Conference on Advanced Information Systems Engineering (CAiSE 2017), 12-16 June 2017, Essen, Germany, for the paper: Multi-party Business Process Resilience By-Design: A Data-centric Perspective. PROJECT GRANTS (SELECTED) For a full and up-to-date list, see here. Co-Principal Investigator of the research project MOTOWN: \"Smart Production Planning and Control for Manufacturing of Electric Vehicle Powertrain in Industry 4.0\" (PRIN 2022), funded by Ministero dell'Università e della Ricerca in 2023. Unit Leader and Principal Investigator for Sapienza of the research project DataCloud: \"Enabling the big data pipeline lifecycle on the computing continuum\", funded by Horizon 2020 European Union Programme in 2021. Project Coordinator of the research project Cicero-Net: \"La rete turistica dei luoghi di Cicerone\", funded by Regione Lazio (DTC) in 2021. KEYNOTE AND PANEL SPEAKER Keynote Speaker at 3rd Int. Workshop on Process Management in the AI Era (PMAI 2024), 19 Oct. 2024, Santiago de Compostela, Spain. Balancing Autonomy and Trust to Enable Intelligent Robotic Process Automation. Panel Speaker at AI Forum 2023, 5 April 2023, Milan, Italy, on the topic of \"AI Augmented Business Process Management\". Keynote Speaker at Int. Workshop on BP Innovation with AI (BPAI'17), 11 Sept. 2018, Barcelona, Spain. What Automated Planning can do for Business Process Management. INVITED TALKS Invited talk on \"Automated Planning in AI for BPMers\" at ERCIS Winter School on Advanced BPM Topics, 23 January 2025, University of Seville, Seville, Spain. Invited talk on \"Balancing Autonomy and Trust to Enable Intelligent Robotic Process Automation\" at University of Oxford, 15 November 2024, Oxford, United Kingdom. Invited talk on \"Foundations of Automated Planning in AI as-a-Service\" at Twelfth European Big Data Management & Analytics Summer School (eBISS 2024), 5 July 2024, Università degli Studi di Padova, Padova, Italy. Invited talk on \"Automated Planning-as-a-Service: Theory and Practice\" at 18th Symposium and Summer School On Service-Oriented Computing (SummerSOC 2024), 28 June 2024, Crete, Greece. Invited talk on \"Framed Autonomy in AI-Augmented Business Process Management: Vision, Opportunities and Challenges\" in the context of Colloquia Seminars CNR/IASI, 13 June 2024, Consiglio Nazionale delle Ricerche (CNR), Rome, Italy. Invited talk on \"The use of AI Planning for BPM\" at University of Tartu (Estonia) in 2016. Invited talks on \"Adaptive Process Management in Cyber-Physical Domains\" at Vienna University of Economics and Business (Austria) and ULM University (Germany) in 2014. Invited talk on \"Synthesis of Process Models through AI Planning\" at Ryerson University (now Toronto Metropolitan University, Toronto, Canada) in 2013. Invited talks on \"Adaptive Process Management through Situation Calculus, Indigolog and Automated Planning\" at University of Toronto (Canada) and York University (Toronto, Canada) in 2012. TUTORIALS Speaker: Mastering Robotic Process Automation with Process Mining at 20th Int. Conf. on Business Process Management (BPM 2022), 14 Sept. 2022, Münster, Germany. Speaker: Applications of Automated Planning for Business Process Management at 19th Int. Conf. on Business Process Management (BPM 2021), 7 Sept. 2021, Rome, Italy. Speaker: IoT for BPMers. Challenges, Case Studies and Successful Applications at 17th Int. Conf. on Business Process Management (BPM 2019), 3 Sept. 2019, Vienna, Austria. Speaker: Process Mining: from Zero to Hero at 18th Int. Conf. on Product-Focused Software Process Improvement (PROFES 2017), 29 November 2018, Innsbruck, Austria. INSTITUTIONAL RESPONSABILITIES (in Sapienza Università di Roma) [2023 - present] Member of the University PhD Programme Commission, Sapienza Università di Roma. [2019 - present] Member of the Board of Lecturers of the PhD Program in Computer Science and Engineering, Sapienza Università di Roma. [2020 - 2023] Secretary of the Board of Lecturers of the PhD Program in Computer Science and Engineering, Sapienza Università di Roma. [2019 - 2022] Member of the Faculty Directorate (Giunta di Facoltà), Faculty of Information Engineering, Informatics, and Statistics, Sapienza Università di Roma. [2019 - 2022] Member of the Department Directorate (Giunta di Dipartimento), Dipartimento di Ingegneria Informatica, Automatica e Gestionale, Sapienza Università di Roma. [2019 - 2020] Member of the Admission Committee for the Bachelor Degree in Computer Science and Engineering, Sapienza Università di Roma. PROFESSIONAL SERVICE Information Director (2017-2022) ACM International Journal on Data and Information Quality (ACM JDIQ) Associate Editor (Editorial Board Member) ACM Computing Surveys (ACM CSUR) ACM Int. Journal on Data and Information Quality (ACM JDIQ) Int. Journal of Information Systems for Crisis Response and Management (IJISCRAM) Guest Associate Editor Data & Knowledge Engineering (DKE), Special Issue on Augmented Business Process Management, in progress, Elsevier, 2023-2024 Progress in Artificial Intelligence (PRAI), Special Issue on Artificial Intelligence for Business Process Management, in press, Springer, 2022 Journal on Data Semantics (JODS), Special Issue on Artificial Intelligence for Business Process Management, Volume 10, Springer, 2020 General Chair 5th International Conference on Process Mining (ICPM 2023) Program Co-Chair 22nd Int. Conference on Business Process Management (BPM 2024) 7th Int. Workshop on AI for Business Process Management (AI4BPM 2023) AAAI 2023 Bridge Program on AI and Business Process Management (AI4BPM Bridge 2023) Robotic Process Automation (RPA) track at the 20th Int. Conference on Business Process Management (BPM 2022) IEEE Int. Workshop on Big Data Processing on the Computing Continuum (BDPROC2022) 6th Int. Workshop on AI for Business Process Management (AI4BPM 2022) 1st ITalian forum on Business Process Management (ITBPM 2021) 4th Int. Workshop on AI for Business Process Management (AI4BPM 2020) 3rd Int. Workshop on AI for Business Process Management (AI4BPM 2019) Int. Workshop on Human-centered cybersecurity (HUCECY 2019) 2nd Int. Workshop on Knowledge-intensive Business Processes (KiBP 2013) Workshop Chair 19th Int. Conference on Business Process Management (BPM 2021) Associate Chair 19th IFIP TC13 Int. Conference on Human-Computer Interaction (INTERACT 2023) 16th Int. Conference on Advanced Visual Interfaces (AVI 2022) 18th IFIP TC13 Int. Conference on Human-Computer Interaction (INTERACT 2021) 15th Int. Conference on Advanced Visual Interfaces (AVI 2020) Organization Chair 31st Int. Conference on Advanced Information Systems Engineering (CAiSE 2019) 8th IEEE Int. Conference on Service Oriented Computing & Applications (SOCA 2015) Poster & Demo Chair 14th Int. Conference on Advanced Visual Interfaces (AVI 2018) Proceedings Chair 23rd Italian Symposium on Advanced Database Systems (SEBD 2015) 1st Int. Workshop on Knowledge-intensive Business Processes (KiBP 2012) Publicity Chair 12th Int. Conf. on Mobile Web and Intelligent Information Systems (MobiWis 2015) 23rd Italian Symposium on Advanced Database Systems (SEBD 2015) Expert Reviewer Natural Sciences and Engineering Research Council of Canada - Discovery Grants Program (NSERC) NWO Dutch Research Council (NWO) Senior Program Committee Member 21th Int. Conference on Business Process Management (BPM 2023) 20th Int. Conference on Business Process Management (BPM 2022) Program Committee Member 35th Int. Conference on Advanced Information Systems Engineering (CAiSE 2023) RPA forum at 21th Int. Conference on Business Process Management (BPM 2023) 32nd Int. Joint Conference on Artificial Intelligence (IJCAI 2023) 17th Int. Conference on Research Challenges in Information Science (RCIS 2023) 12th Int. Conf. on Data Science, Technology and Applications (DATA 2023) 25th Int. Conf. on Enterprise Information Systems (ICEIS 2023) 3rd Int. Workshop on From Cloud to Things (Cloud2Things 2023) 31st Int. Joint Conference on Artificial Intelligence (IJCAI 2022) 34th Int. Conf. on Advanced Information Systems Eng. - Forum track (CAiSE 2022) 4th Int. Conference on Process Mining (ICPM 2022) 26th Int. Conference on Enterprise Computing Conference (EDOC 2022)",
  "content_length": 16450,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:49"
}