{
  "name": "Andrew S. Tanenbaum",
  "homepage": "http://www.cs.vu.nl/~ast",
  "status": "success",
  "content": "Andrew S Tanenbaum, Professor at the Vrije Universiteit Department of Computer Science Vrije Universiteit Andrew S. Tanenbaum's Home Page Professor of Computer Science Address: Dept. of Computer Science Faculty of Sciences Vrije Universiteit De Boelelaan 1111 1081 HV Amsterdam , The Netherlands In principle, I retired on 23 Oct. 2014, but in reality it was a slow departure. But we did have a nice party. Some people in the Dept. asked a number of my current and former students, postdocs, and colleagues near and far to describe me in one word and also to give an extended description in 30 seconds. These video clips were assembled and put on YouTube: One-word descriptions: http://youtu.be/Dfa0srNLD0M 30-sec descriptions: http://youtu.be/tkJ4YNOrNpI I have written an informal history of the Computer Science Dept. at the VU. It is available here. MINIX 3, a highly-reliable operating system based on a tiny (13,000-line) kernel, is now available. It runs on x86 and ARM CPUs so it is good for desktop as well as embedded systems. To download it for free, go to www.minix3.org. PERSONAL INFORMATION Personal FAQ Curriculum vitae BOOKS Photos of the covers of my books Translations of my books Structured Computer Organization, 6th ed. Computer Networks, 6th ed. Operating Systems Design and Implementation, 3rd ed. Modern Operating Systems, 5th ed. Distributed Systems, 3rd ed. How to Prepare Your Input PAPERS Refereed papers Other publications SOFTWARE Amsterdam Compiler Kit (download link) Amoeba Globe Loris (download link) MINIX 3 Orca parallel programming language (download link) TEACHING Video lectures on Computer Networks by David Wetherall HONORS Somebody went to the trouble of making me a page on Wikipedia Fellow of the IEEE Fellow of the ACM Member of the Royal Netherlands Academy of Arts and Sciences ACM Software System Award Eurosys Lifetime Achievement Award, 2015 Honorary Doctorate from Petru Maior University, 2011 Winner of the TAA McGuffey Award, 2010 European Research Council Advanced Grant winner, 2008 (for about $3.5 million) Winner of the USENIX Lifetime Achievement Award, 2008 Winner of the NLUUG Lifetime Achievement Award, 2008 Honorary Doctorate from Polytechnic University of Bucharest, 2008 Winner of the IEEE James H. Mulligan, Jr. Education Medal, 2007 KNAW Academy Professor Winner of the 2003 TAA Texty Textbook Excellence Award Winner of the 1997 ACM CSE Outstanding Contributions to Computer Science Education Award ACM Karl V. Karlstrom Outstanding Educator Award Distinguished Paper Award, 10th ACM Symposium on Operating System Principles PH.D. THESES SUPERVISED: Dirk Vogt: Efficient High-Frequency Checkpointing for Recovery and Debugging, 2019 (cosupervised with Herbert Bos) Erik van der Kouwe: Improving Software Fault Injection, 2016 David van Moolenbroek: Building a Reliable Storage Stack, 2016 Tomas Hruby: On the Design of Reliable and Scalable Networked Systems, 2016 (cosupervised with Herbert Bos) Guido van 't Noordende: The Design and Implementaion of the Mansion Mobile Agent System, 2015 (cosupervised with Frances Brazier) Raja Appuswamy: Building a File-Based Storage Stack: Modularity and Flexibility in Loris, 2014 Cristiano Giuffrida: Safe and Automatic Live Update, 2014 Stefano Ortolani: Keylogger Detection and Containment, 2013 (cosupervised with Bruno Crispo) Jorrit Herder: Building a Dependable Operating System, 2010 (cosupervised with Herbert Bos) Srijith Nair: Remote Policy Enforcement Using Java Virtual Machine, 2010 (cosupervised with Bruno Crispo) Melanie Rieback: Security and Privacy of Radio Frequency Identification, 2008 (cosupervised with Bruno Crispo) Bogdan Popescu: Design and Implementation of a Secure Wide-Area Object Middleware, 2007 (cosupervised with Bruno Crispo) Michel Oey: The Design of a High-Integrity Disk Management Subsystem, 2005. (cosupervised with Wiebren de Jonge) Werner Vogels: Scalable Cluster Technologies for Mission-Critical Enterprise Computing, 2003 (cosupervised by Henri Bal) Gerco Ballintijn: Locating Objects in a Wide Area System , 2003 (cosupervised with Maarten van Steen) Arno Bakker: An Object-Based Software Distribution Network , 2002 (cosupervised with Maarten van Steen) Philip Homburg: The Architecture of a Worldwide Distributed Systems, 2001 (cosupervised with Maarten van Steen) Leendert van Doorn: The Design and Application of an Extensible Operating System , 2001 Raoul Bhoedjang: Communication Architectures for Parallel-Programming Systems , 2000 (cosupervised with Henri Bal) Frans Kaashoek: Group Communication in Distributed Computer Systems, 1992 Baalbergen, E.H.: The Declarative Operating System Model, 1992 (cosupervised with Dick Grune) Henri Bal: The Shared Data Object Model as a Paradigm for Progr. Distr. Sys., 1989. Robbert van Renesse: Functional Processing as a Paradigm for Distr. Computing, 1989. Sape Mullender: Principles of Distributed Operating System Design, 1985. COLLEAGUES Henri E. Bal Herbert Bos KEN BROWN INCIDENT Ken Brown visited me and informed me that Linus Torvalds stole Linux from me. I begged to disagree with him. RFID VIRUS STORY On 15 March 2006, my Ph.D. student, Melanie Rieback, presented a paper at a conference in Italy about how to put a virus on an RFID chip. The paper was entitled: \"Is Your Cat Infected with a Computer Virus?\" I had given an advance copy to the science editor of the New York Times and he wrote a story about the paper on the front page of the Times. This became biggest tech and business news story in the world for over a week, There were hundreds of articles all over the media. Here is a list of some of them. You can also download all the articles themselves. PHOTOS Some countries I have visited STEGANOGRAPHY DEMO Steganography means tightly sealed writing MESSAGE TO DUTCH HIGH SCHOOL (VWO) STUDENTS Als je wilt studeren in mijn afdeling, kom een keer langs en bekijk ons nieuwe programma.",
  "content_length": 5912,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:47"
}