{
  "name": "Andreas Winter 0001",
  "homepage": "https://uol.de//en/computingscience/se/group/andreas-winter",
  "status": "success",
  "content": "Andreas Winter // University of Oldenburg School II Department of Computing Science Software Engineering Andreas Winter Prof. Dr. Andreas Winter Andreas Winter Prof. Dr. Andreas Winter Address Carl von Ossietzky University Oldenburg Faculty IIDepartment of Computer ScienceSoftware Engineering 26111 Oldenburg Building / Room Uhlhornsweg 84 — Room A2 2-225 Telephone +49 441 798-2992 Fax +49 441/798-2196 E-Mail winter@se.uni-oldenburg.de Since September 2009 Andreas Winter chairs the Software Engineering Group at Carl von Ossietzky University Oldenburg . Currently, he teaches lectures and seminars on software engineering foundations, requirements engineering and management, software architecture, and software analysis and transformation. Prior to his appointment in Oldenburg, Andreas Winter was affiliated with University of Koblenz, Germany , where he received his PhD, with Johannes-Gutenberg-University, Mainz, Germany, where he acted as a substitute for the chair of Software Engineering , and with University of Waterloo, Canada, where he joined the Software Architecture Group. Among others, Andreas Winter was involved in the development of GUPRO, a generic, meta-model based framework for program comprehension and in the design of GXL , a graph-based interchange language to provide interoperability of graph-based (reengineering) tools. Current research topics include software-engineering, meta-modeling and transformation, service-oriented tool interoperability, software migration and software-(re-)engineering processes. The SOAMIG-project, funded by BMBF, which is accomplished in strong cooperation withAmadeus Germany, Bad Homburg, Pro et con, Chemnitz, and Institute for Software Technology at University of Koblenz, deals with the model-driven identification and migration of legacy assets into service oriented architectures. At OFFIS Institute for Information Technology he serves as chairperson of the Technology Cluster \"Software Engineering and Enterprise Architecture\". Andreas Winter served in programm and organization committees of various national and international software engineering and reengineering conferences and workshops. He is chairperson of the software-reengineering interest group of the German computer society (GI-SRE), where he co-organizes the german Workshop series on Software-Reengineering (WSR). Andreas is member in the Steering Committees of the International Conference on Software Language Engineering and the European Conference on Software Maintenance and Reengineering . Supervised theses at the University of Koblenz can be found here . Webmaster (Changed: 21 May 2025) |  Kurz-URL:Shortlink: https://uol.de/p38075en Zum Seitananfang scrollen Scroll to the top of the page",
  "content_length": 2739,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:20"
}