{
  "name": "Andrew P. French",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/andrew.p.french",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Andrew FrenchProfessor, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsLocationTeaching and LearningResearchPublications Contact workRoom B70 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKandrew.p.french@nottingham.ac.ukhttps://www.nottingham.ac.uk/research/groups/cvl/people/andrew.p.french BiographyI am interested in Artifical Intelligence (AI) research, particularly related to understanding images. Building an understanding of AI within other disciplines, especially within the biological sciences, has been a focus in recent years, and is increasingly important as AI tools become more powerful. Research interests include: · Image analysis of plants and other complex structures · Developing novel AI software tools to aid biologists · Deep machine learning approaches · Artificial intelligence for computer vision · Automating image capture approaches (e.g. with robotics) Expertise SummaryImage analysis and computer vision Biological image analysis Artificial intelligence methods for computer vision Deep machine learning High-throughput plant phenotyping Experience with a variety of dataset modalities (colour, 3D volumetric, x-ray. MRI, confocal, LSFM etc.) Data science training provision (via free courses and consultancy)Teaching SummaryI mainly teach Computer Vision and Schools Experience in Computer Science, and Computer Modelling in Science (Introduction and Applications) in Biosciences. I do supervise final year projects: if you… read moreResearch SummaryMy research involves developing novel computer science approaches to solve imaging challenges, particularly in bioscience applications. This includes machine learning (AI) approaches as well as image… read moreSelected Publications MICHAEL POUND, JONATHAN ATKINSON, ALEXANDRA TOWNSEND, MICHAEL WILSON, MARCUS GRIFFITHS, AARON JACKSON, ADRIAN BULAT, GEORGIOS TZIMIROPOULOS, DARREN WELLS, ERIK MURCHIE, TONY PRIDMORE and ANDREW FRENCH, 2017. Deep Machine Learning provides state-of-the-art performance in image-based plant phenotyping Gigascience. gix083FRENCH, A.P., MILLS, S., SWARUP, R., BENNETT, M.J. and PRIDMORE, T.P., 2008. Colocalization of fluorescent markers in confocal microscope images of plant cells Nature Protocols. 3(4), 619-628IMANOL LUENGO, MARK BASHAM and ANDREW P. FRENCH, 2016. SMURFS: Superpixels from Multi-scale Refinement of Super-regions In: Proceedings of the British Machine Vision Conference 2016. FRENCH, A., UBEDA-TOMÁS, S., HOLMAN, T.J., BENNETT, M.J. and PRIDMORE, T., 2009. High throughput quantification of root growth using a novel image analysis tool Plant Physiology. 150(4), 1784-1795 View all publications I have offices on Sutton Bonington and Jubilee campuses. On SB, you can find me in Plant Sciences, C08a. My office in Computer Science is B80. You are welcome to try dropping by, but it is best to email me first for an appointment. I mainly teach Computer Vision and Schools Experience in Computer Science, and Computer Modelling in Science (Introduction and Applications) in Biosciences. I do supervise final year projects: if you are interested in image analysis, do email me with project ideas. Current ResearchMy research involves developing novel computer science approaches to solve imaging challenges, particularly in bioscience applications. This includes machine learning (AI) approaches as well as image analysis development. Research interests include: · Image analysis of plants and other complex structures · Developing novel software tools to aid biologists and mathematical modellers · Deep machine learning approaches · Automating image capture approaches (e.g. with robotics)Past ResearchTracking algorithm development: how to track objects in video sequences.Future ResearchDeveloping deep learning approaches to image analysis. Phenotyping - automating the characterization of plants using imaging, robotics and automation software to speed up the number of plants we can measure in an experiment. Segmentation methods, including superpixel approaches. Hyperspectral imaging Generating 3D models MRI segmentation and interpretation. GIBBS, JONATHON A., POUND, MICHAEL, FRENCH, ANDREW P., WELLS, DARREN M., MURCHIE, ERIK and PRIDMORE, TONY, 2017. Approaches to three-dimensional reconstruction of plant shoot topology and geometry FUNCTIONAL PLANT BIOLOGY. 44(1), 62-75POUND, MICHAEL P., FOZARD, SUSAN, TORRES, MERCEDES TORRES, FORDE, BRIAN G. and FRENCH, ANDREW P., 2017. AutoRoot: open-source software employing a novel image analysis approach to support fully-automated plant phenotyping PLANT METHODS. 13(12), BURRELL T, FOZARD S, HOLROYD GH, FRENCH AP, POUND MP, BIGLEY CJ, JAMES TAYLOR C and FORDE BG, 2017. The Microphenotron: a robotic miniaturized plant phenotyping platform with diverse applications in chemical biology. Plant methods. 13, 10LUENGO, IMANOL, DARROW, MICHELE C., SPINK, MATTHEW C., SUN, YING, DAI, WEI, HE, CYNTHIA Y., CHIU, WAH, PRIDMORE, TONY, ASHTON, ALUN W., DUKE, ELIZABETH M. H., BASHAM, MARK and FRENCH, ANDREW P., 2017. SuRVoS: Super-Region Volume Segmentation workbench JOURNAL OF STRUCTURAL BIOLOGY. 198(1), 43-53MICHAEL POUND, JONATHAN ATKINSON, ALEXANDRA TOWNSEND, MICHAEL WILSON, MARCUS GRIFFITHS, AARON JACKSON, ADRIAN BULAT, GEORGIOS TZIMIROPOULOS, DARREN WELLS, ERIK MURCHIE, TONY PRIDMORE and ANDREW FRENCH, 2017. Deep Machine Learning provides state-of-the-art performance in image-based plant phenotyping Gigascience. gix083POUND, MICHAEL P., ATKINSON, JONATHAN A., WELLS, DARREN M., PRIDMORE, TONY P. and FRENCH, ANDREW P., 2017. Deep Learning for Multi-task Plant Phenotyping 2017 IEEE INTERNATIONAL CONFERENCE ON COMPUTER VISION WORKSHOPS (ICCVW 2017). 2055-2063POUND, MICHAEL P.AND FRENCH, ANDREW P.AND FOZARD, JOHN A.AND MURCHIE, ERIK H.AND PRIDMORE, TONY P., 2016. A patch-based approach to 3D plant shoot phenotyping Machine Vision and Applications. 1-13MICHAEL POUND, ALEXANDRA J BURGESS, MICHAEL H WILSON, JONATHAN A ATKINSON, MARCUS GRIFFITHS, AARON S JACKSON, ADRIAN BULAT, GEORGIOS TZIMIROPOULOS, DARREN M WELLS, ERIK H MURCHIE, TONY P PRIDMORE and ANDREW P FRENCH, 2016. Deep Machine Learning provides state-of-the-art performance in image-based plant phenotyping Biorxiv. Available at: <http://biorxiv.org/content/early/2016/05/12/053033> HANNO SCHARR, MASSIMO MINERVINI, ANDREW P. FRENCH, CHRISTIAN KLUKAS, DAVID M. KRAMER, XIAOMING LIU, IMANOL LUENGO, JEAN-MICHEL PAPE, GERRIT POLDER, DANIJELA VUKADINOVIC, XI YIN and SOTIRIOS A. TSAFTARIS, 2016. Leaf segmentation in plant phenotyping: a collation study Machine Vision and Applications. 27(4), 585-606IMANOL LUENGO, MARK BASHAM and ANDREW P FRENCH, 2016. Fast global interactive volume segmentation with regional supervoxel descriptors In: Proc. SPIE 9784, Medical Imaging 2016: Image Processing, 97842D (March 21, 2016). 9784. LUENGO, IMANOL, BASHAM, MARK and FRENCH, ANDREW P, 2016. Hierarchical Piecewise-Constant Super-regions arXiv preprint arXiv:1605.05937. IMANOL LUENGO, MARK BASHAM and ANDREW P. FRENCH, 2016. SMURFS: Superpixels from Multi-scale Refinement of Super-regions In: Proceedings of the British Machine Vision Conference 2016. POUND, MICHAEL, FRENCH, ANDREW and FORDE, BRIAN, 2016. AutoRoot: fully-automated plant root phenotyping Zenodo. LUENGO, IMANOL, BASHAM, MARK and FRENCH, ANDREW P., 2016. Selective Labeling: Identifying Representative Sub-volumes for Interactive Segmentation PATCH-BASED TECHNIQUES IN MEDICAL IMAGING, PATCH-MI 2016. 9993, 17-24SCHARR, HANNO, DEE, HANNAH, FRENCH, ANDREW P. and TSAFTARIS, SOTIRIOS A., 2016. Special issue on computer vision and image analysis in plant phenotyping MACHINE VISION AND APPLICATIONS. 27(5), 607-609POUND, MICHAEL, FRENCH, ANDREW P. and WELLS, DARREN M., 2015. Quantification of Fluorescent Reporters in Plant Cells PLANT CELL EXPANSION: METHODS AND PROTOCOLS. 1242, 123-131DEE, HANNAH and FRENCH, ANDREW, 2015. From image processing to computer vision: plant imaging grows up Foreword FUNCTIONAL PLANT BIOLOGY. 42(5), III-VLARRIEU AP, FRENCH AP, PRIDMORE TP, BENNETT MJ and WELLS DM, 2014. Time-profiling fluorescent reporters in the Arabidopsis root. Methods in molecular biology (Clifton, N.J.). 1056, 11-17BAND L, WELLS DM, FOZARD JA, GHETIU T, FRENCH AP, POUND MP, WILSON MH, YU L, LI W, HIJAZI H, OH J, PEARCE S, PEREZ-AMADOR MA, YUN J, KRAMER E, ALONSO JM, GODIN G, VERNOUX T, HODGMAN TC, PRIDMORE TP, SWARUP R, KING JR and BENNETT MJ, 2014. Systems Analysis of auxin transport in the Arabidopsis root apex Plant Cell. MIGUEL-PACHECO, GIULIANA G., KALER, JASMEET, REMNANT, JOHN, CHEYNE, LYDIA, ABBOTT, CAROLINE, FRENCH, ANDREW P., PRIDMORE, TONY P. and HUXLEY, JONATHAN N., 2014. Behavioural changes in dairy cows with lameness in an automatic milking system Applied Animal Behaviour Science. 150(0), 1-8LARRIEU, ANTOINE P., FRENCH, ANDREW P., PRIDMORE, TONY P., BENNETT, MALCOLM J. and WELLS, DARREN M., 2014. Time-Profiling Fluorescent Reporters in the Arabidopsis Root PLANT CHEMICAL GENOMICS: METHODS AND PROTOCOLS. 1056, 11-17POUND, MICHAEL P., FRENCH, ANDREW P., MURCHIE, ERIK H. and PRIDMORE, TONY P., 2014. Automated Recovery of Three-Dimensional Models of Plant Shoots from Multiple Color Images PLANT PHYSIOLOGY. 166(4), 1688-U801BAND, LEAH R., WELLS, DARREN M., FOZARD, JOHN A., GHETIU, TEODOR, FRENCH, ANDREW P., POUND, MICHAEL P., WILSON, MICHAEL H., YU, LEI, LI, WENDA, HIJAZI, HUSSEIN I., OH, JAESUNG, PEARCE, SIMON P., PEREZ-AMADOR, MIGUEL A., YUN, JEONGA, KRAMER, ERIC, ALONSO, JOSE M., GODIN, CHRISTOPHE, VERNOUX, TEVA, HODGMAN, T. CHARLIE, PRIDMORE, TONY P., SWARUP, RANJAN, KING, JOHN R. and BE",
  "content_length": 18498,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:40"
}