{
  "name": "Andrew Lo",
  "homepage": "http://alo.mit.edu",
  "status": "success",
  "content": "Andrew W. Lo – The Charles E. and Susan T. Harris Professor at the MIT Sloan School of Management and director of the MIT Laboratory for Financial Engineering Charles E. and Susan T. Harris Professor, MIT Sloan School of Management; Director, MIT Laboratory for Financial Engineering READ MORE > Reconciling the Efficient Markets Hypothesis and Behavioral Finance In their new book, Andrew W. Lo and Ruixun Zhang provide the mathematical and statistical foundations of the Adaptive Markets Hypothesis, a theoretical framework for reconciling the efficient markets hypothesis and behavioral finance. READ MORE > Learning from Biotech’s History to Accelerate Progress in Fusion Energy MIT professors Andrew W. Lo and Dennis G. Whyte propose five initiatives for accelerating progress in fusion based on lessons learned from the last 50 years of biotechnology industry history. READ MORE > Teaching: No Longer Just For The Classroom In addition to lecturing for the students at MIT, technology is taking Andrew’s classes off-campus and across the globe. READ MORE > Advising the Next Generation See Andrew’s students, current and former, who have and will go on to be leaders in their respective industries. READ MORE > Follow Me Twitter Recent Publications Fintech and AI LLM economicus? Mapping the Behavioral Biases of LLMs via Utility Theory 2024 Ross, Jillian, Yoon Kim, and Andrew W. Lo (2024), LLM economicus? Mapping the Behavioral Biases of LLMs via Utility Theory, COLM 2024, Philadelphia, Pennsylvania, October 2024. https://doi.org/10.48550/arXiv.2408.02784. Available Here Humans are not homo economicus (i.e., rational economic beings). As humans, we exhibit systematic behavioral biases such as loss aversion, anchoring, framing, etc., which lead us to make suboptimal economic decisions. Insofar as such biases may be embedded in text data on which large language models (LLMs) are trained, to what extent are LLMs prone to the same behavioral biases? Understanding these biases in LLMs is crucial for deploying LLMs to support human decision-making. We propose utility theory-a paradigm at the core of modern economic theory-as an approach to evaluate the economic biases of LLMs. Utility theory enables the quantification and comparison of economic behavior against benchmarks such as perfect rationality or human behavior. To demonstrate our approach, we quantify and compare the economic behavior of a variety of open- and closed-source LLMs. We find that the economic behavior of current LLMs is neither entirely human-like nor entirely economicus-like. We also find that most current LLMs struggle to maintain consistent economic behavior across settings. Finally, we illustrate how our approach can measure the effect of interventions such as prompting on economic biases. Can ChatGPT Plan Your Retirement?: Generative AI and Financial Advice 2024 Lo, Andrew W., and Jillian Ross (2024), Can ChatGPT Plan Your Retirement?: Generative AI and Financial Advice, Harvard Data Science Review (Special Issue 5), https://doi.org/10.1162/99608f92.ec74a002. Available Here We identify some of the most pressing issues facing the adoption of large language models (LLMs) in practical settings, and propose a research agenda to reach the next technological inflection point in generative AI. We focus on three challenges facing most LLM applications: domain-specific expertise and the ability to tailor that expertise to a user’s unique situation, trustworthiness and adherence to the user’s moral and ethical standards, and conformity to regulatory guidelines and oversight. These challenges apply to virtually all industries and endeavors in which LLMs can be applied, such as medicine, law, accounting, education, psychotherapy, marketing, and corporate strategy. For concreteness, we focus on the narrow context of financial advice, which serves as an ideal test bed both for determining the possible shortcomings of current LLMs and for exploring ways to overcome them. Our goal is not to provide solutions to these challenges—which will likely take years to develop—but to propose a framework and road map for solving them as part of a larger research agenda for improving generative AI in any application. Foundations of Financial Behavior and Adaptive Markets The Evolution of Discrimination Under Finite Memory Constraints 2025 Lo, Andrew W., Ruixun Zhang, and Chaoyi Zhao (2025), The Evolution of Discrimination Under Finite Memory Constraints, Scientific Reports 15, 31774. https://doi.org/10.1038/s41598-025-17089-9. Available Here We develop an evolutionary model for individual discriminatory behavior that emerges naturally in a mixed population as an adaptive strategy. Our findings show that, when individuals have finite memory and face uncertain environments, they may rely on prior biases and observable group traits to make decisions, changing their discriminatory practices. We also demonstrate that a finite memory is a consequence of natural selection because it leads to higher fitness in dynamic environments with mutations. This adaptability allows individuals with finite memory to better respond to environmental variability, offering a potential evolutionary advantage. Our study suggests that memory constraints and environmental changes are critical factors in sustaining biased behavior, suggesting insights into the persistence of discrimination in real-world settings and possible mitigation strategies across fields, including education, policymaking, and artificial intelligence. The Wisdom of Crowds Versus the Madness of Mobs: An Evolutionary Model of Bias, Polarization, and Other Challenges to Collective Intelligence 2022 Lo, Andrew W., and Ruixun Zhang (2022), The Wisdom of Crowds Versus the Madness of Mobs: An Evolutionary Model of Bias, Polarization, and Other Challenges to Collective Intelligence, Collective Intelligence 1(1). https://doi.org/10.1177/26339137221104785. Available Here Despite its success in financial markets and other domains, collective intelligence seems to fall short in many critical contexts, including infrequent but repeated financial crises, political polarization and deadlock, and various forms of bias and discrimination. We propose an evolutionary framework that provides fundamental insights into the role of heterogeneity and feedback loops in contributing to failures of collective intelligence. The framework is based on a binary choice model of behavior that affects fitness; hence, behavior is shaped by evolutionary dynamics and stochastic changes in environmental conditions. We derive collective intelligence as an emergent property of evolution in this framework, and also specify conditions under which it fails. We find that political polarization emerges in stochastic environments with reproductive risks that are correlated across individuals. Bias and discrimination emerge when individuals incorrectly attribute random adverse events to observable features that may have nothing to do with those events. In addition, path dependence and negative feedback in evolution may lead to even stronger biases and levels of discrimination, which are locally evolutionarily stable strategies. These results suggest potential policy interventions to prevent such failures by nudging the “madness of mobs” towards the “wisdom of crowds” through targeted shifts in the environment Healthcare Finance Estimating Correlations Between Clinical Trial Outcomes Using Generalized Estimating Equations 2025 Dai, Yuehao, Andrew W. Lo, Manish Singh, Qingyang Xu, and Ruixun Zhang (2025), Estimating Correlations Between Clinical Trial Outcomes Using Generalised Estimating Equations, Oxford Bulletin of Economics and Statistics, Early View. https://doi.org/10.1111/obes.70025. Available Here GEE Implementation in Python Accurately estimating the correlations among clinical trial outcomes is crucial for managing the risk of biopharmaceutical investment portfolios. We propose a novel algorithm for estimating correlations in large clinical trial datasets using a generalised estimating equations (GEE) framework. Our algorithm outperforms existing methods in both convergence speed and computational efficiency. Empirical analysis of over 25,000 clinical trials reveals a correlation of approximately 10% for trials within therapeutic areas and up to 40% for trials sharing the same phase or mechanism hierarchy. Trials targeting the same disease show slightly negative correlations, suggesting a first-mover advantage. Our approach offers a scalable method to estimate correlations within large clinical trial datasets. A father’s crusade in rare disease drug development: a case study of Elpida therapeutics and Melpida 2025 Portero, Deanna, Qingyang Xu, Aaliya Hussain, and Andrew W. Lo (2025), A Father’s Crusade in Rare Disease Drug Development: A Case Study of Elpida Therapeutics and Melpida, Orphanet Journal of Rare Diseases 20, https://doi.org/10.1186/s13023-025-03892-0. Available Here Therapeutic development for rare diseases is difficult for pharmaceutical companies due to significant scientific challenges, extensive costs, and low financial returns. It is increasingly common for caregivers and patient advocacy groups to partner with biomedical professionals to finance and develop treatments for rare diseases. This case study illustrates the story of Terry Pirovolakis, a father who partnered with biomedical professionals to develop the novel gene therapy, Melpida, within 36 months of the diagnosis of his infant son. We identify the factors that led to the success of Melpida and analyze the business model of Elpida Therapeutics, a social purpose corporation founded by Pirovolakis to reproduce the success of Melpida for other rare diseases. We conclude with four lessons from Melpida to inform caregivers like Pirovolakis on developing novel gene therapies to save their loved ones. Financing Drug Development via Adaptive Platform Trials 2025 Cho, Joonhyuk, Eugene Sorets, Shomesh Chaudh",
  "content_length": 17167,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:36"
}