{
  "name": "Andrew Edward Johnson",
  "homepage": "https://www.evl.uic.edu/aej",
  "status": "success",
  "content": "Andy's Home Page If it ain't real fun, it ain't real science andy's page introduction teaching students current projects past projects publications grants experience fun stuff evl CS Engineering UIC Dr. Andrew Johnson is Professor Emeritus of Computer Science and was formerly the Director of Research at the Electronic Visualization Laboratory at the University of Illinois Chicago. His research and teaching focused on interaction and collaboration using advanced visualization displays and the application of those displays to enhance discovery and learning. News summer '24 After 30 fun and exciting years working with EVL, starting as a visiting PhD student traveling with the lab to SIGGRAPH 1994 to show off my scientific visualization CAVE application, and working my way up to Professor and EVL's Director of Research, I retired on June 30th and continue as Professor Emeritus of Computer Science. spring '24 This term I am teaching CS 528 Virtual Reality Sai successfully defended her PhD dissertation - Supporting Metaphor Elicitation in Asymmetric Virtual Environments Ashwini successfully defended her PhD dissertation - Multimodal Situated Analytics (MuSA) for Analyzing Conversations in Extended Reality fall '23 This term I am co-teaching CS 427 Creative Coding with Daria Tsoupikova from the College of Architecture, Design, and the Arts. NSF has funded the 'Research Infrastructure: MRI: Track 2 Acquisition of Data Observation and Computation Collaboratory (DOCC)' grant that I am PI on for $1,500,000 for three years to help us build an interactive data visualization and collaboration space in the new CS building. September 2023 marks the 50th anniversary of the founding of the Electronic Visualization Laboratory at UIC, which was known as the Circle Graphics Habitat in 1973 when UIC was known as the University of Illinois Chicago Circle. A retrospective article on those 50 years is coming soon in Presence. summer '23 2023 is the 40th Anniversary of the creation of Castle Smurfenstein! head on back to the 1980s here spring '23 Hummingbird is being shown March 24-26 at the Chicago Children's Theatre Arthur successfully defended his PhD dissertation - Collaborative Augmented Reality for Virtual Reality Display Wall Environments. This term I am on sabbatical. fall '22 This term I am teaching CS 428 Virtual, Augmented and Mixed Reality Our CS+DES undergraduate program, combining Computer Science and Design, has its first cohort of students this fall. The US Department of Energy has funded our C^2-THE-P^2 = Chicagoland Computational Traineeship in High Energy Particle Physics grant to help train computer scientists and physicists to work together at national labs like Fermi. summer '22 Hummingbird was shown at SIGGRAPH 2022 in Vancouver in August. spring '22 This term I am teaching CS 424 Visualization and Visual Analytics, and co-teaching CS 427 Creative Coding with Daria Tsoupikova from the College of Architecture, Design, and the Arts. fall '21 This term I am back in the evl classroom teaching CS 428 Virtual, Augmented and Mixed Reality. We hosted limited performances of Hummingbird in evl December 3-6 in collaboration with the Goodman Theater New Stages Festival. summer '21 The Illinois Board of Higher Education has approved the new Computer Science + Design Undergraduate Major at UIC which is 1/3 Computer Science, 1/3 Design, and 1/3 general education, starting in Fall 2022. Due to COVID-19, we are having limited performances of Hummingbird in evl in June. Krishna successfully defended his PhD dissertation - Hybrid Collaborative Virtual Environments. Jillian successfully defended her PhD dissertation - Interaction with Multiple Data Visualizations Through Natural Language Commands. Abeer successfully defended her PhD dissertation - Supporting Collaborative Exploratory Visual Data Analysis in Multi-device Environments. spring '21 This term I am teaching CS 424 Visualization and Visual Analytics I asynchronously. fall '20 This term I am teaching CS 428 Virtual, Augmented and Mixed Reality asynchronously. NSF has funded the 'CHS: Small: Collaborative Research: Articulate+ - A Conversational Interface for Democratizing Visual Analysis' grant that I am PI on for $333,000 for two years. With Maxine Brown retiring, I am now the Interim Director of EVL in addition to my position as EVL Director of Research. summer '20 This summer I've been spending a lot of time on the front porch creating course videos with my new setup, and like everyone else, attending a lot of video conferences spring '20 Achievement unlocked: May 1st marks 25 years since I moved to Chicago to start working at UIC. This term I am teaching CS 528 Virtual Reality and CS 424 Visualization and Visual Analytics I. NSF has funded the Collaborative Research: CSSI Frameworks: SAGE3: Smart Amplified Group Environment for Harnessing the Data Revolution grant that I am Co-PI on for $2,250,000 for five years. Julieta and I added a Powerwall battery onto our home solar panel system. fall '19 This term I am teaching CS 428 Virtual, Augmented and Mixed Reality. Julieta and I installed 6 kW of solar panels on the roof of our bungalow to offset our electricity usage. I was promoted to full professor starting this term. summer '19 On May 29th I was invited to give a talk at NASA's Goddard Space Flight Center as part of their Information Sciences and Technology Colloquium Series spring '19 This term I am teaching CS 424 Visualization and Visual Analytics I. Congrats to Ph.D. graduate Victor Mateevitsi whose Spider Sense work is being showcased at the Museum of Science and Industry as part of their Wired to Wear exhibit for the next year. fall '18 This term I am teaching Virtual and Augmented Reality in our new Continuum space, and this special topics course has now been approved as a regular course - CS 428. NSF has funded the 'MRI - Acquisition of a Composable Platform as a Service Instrument for Deep Learning and Visualization (COMPaaS DLV)' grant that I am Co-PI on for $997,363 for three years. Mike successfully defended his PhD dissertation - A Distributed Graph Approach For Retrieving Linked RDF Data Using Supercomputer Systems, and will be continuing on as an Assistant Professor at Lewis University. Julieta and I welcomed a second electric car into our garage with a Tesla Model 3 joining our Nissan Leaf. summer '18 evl staff and students (including 5 CS undergrads) are spending the summer installing and testing the core of the Continuum display and sensor systems. spring '18 This term I am teaching CS 424 Visualization and Visual Analytics I Remodeling has finished on our new Continuum space so now we get to start adding in the fun stuff I (along with Bob and Max) got to meet Ivan Sutherland fall '17 This term I am teaching a new 400 level course on Virtual and Augmented Reality that will act as a more practical introduction to the field compared to the graduate level Virtual Reality course that I have taught for the last 20 years. Victor successfully defended his PhD dissertation - Supporting Navigation with a Torso Wearable Tactile Display. Our CAVE2 US patent was granted #9,800,862 - System and methods for visualizing information summer '17 Viewing the total eclipse in Missouri. This will be the 10th year of UIC's Image of Research contest, and my 10th year as a judge for the contest. Congratulations to Arthur Nishimoto, Honorable Mention, in the 2017 UIC Image of Research Contest. spring '17 This term I am teaching CS 422 User Interface Design and Programming Alessando successfully defended his PhD dissertation - Multiview Immersion in Hybrid Reality Environments - on March 3rd and will be continuing his work at Citadel. Marching for science in Chicago. Julieta and I brought our Nissan Leaf we bought in Hawai'i back to Chicago. fall '16 This fall I am on sabbatical at the University of Hawai'i at Hilo, helping out former evl Director Jason Leigh on his Cyber-CANOE project, using evl's SAGE2 and Omegalib software to link scientists and educators across Hawai'i. NSF has funded the MRI - Development of Continuum: A Virtualized Attentive Environment for Amplified Collaboration grant that I am PI on for $550,001 for three years. summer '16 Congratulations to Victor Mateevitsi, 1st Place Winner, and to Jillian Aurisano and James Hwang, Honorable Mention, in the 2016 UIC Image of Research Contest. spring '16 This term I am teaching CS 422 User Interface Design and Programming Congratulations to Victor Mateevitsi, 2015 UIC Dean's Scholar Award winner, and to Jillian Aurisano, 2015 UIC Chancellor's Award winner, and to Arthur Nishimoto, 2016 Chancellor's Student Service Award winner. fall '15 This term I am teaching CS 424 Visualization and Visual Analytics I IEEE Viz is in town this month so many former evlers are getting a chance to meet the current crew On November 18th I was invited to be part of the Cognitive and Immersive Systems panel at the IBM Cognitive Computing Colloquium at Rensselaer Polytechnic's EMPAC Center in Troy NY. summer '15 Julieta and I visited Montreal for a few days in the late spring, and then LA and Buenos Aires in the late summer. Huy successfully defended his PhD dissertation - OPTIQ: A Data Movement Optimization Framework for Data-centric Applications on Supercomputers - on July 14th and will be heading off to work at Microsoft. Tommy successfully defended his PhD dissertation - Intensive Remote Collaboration using Scalable Visualizations in Heterogeneous Display Spaces - on August 21st and will be heading off to work at Argonne. spring '15 This term I am teaching CS 528 Virtual Reality, and the UIC node of the Blue Waters course on High Performance Visualization for Large-Scale Scientific Data Analytics. EVL participated in 'Circle Back UIC Forward', the 50th anniversary of the ribbon cutting for the University of Illinois Circle Center campus, by giving tours and demonstrations to U of I President Killeen, U of I Board of Trustees Chairma",
  "content_length": 19096,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:31"
}