{
  "name": "Andreas Diavastos",
  "homepage": "https://carl.cut.ac.cy/index.html",
  "status": "success",
  "content": "CARL@CUT - Home CARL@CUT Computer Architecture Research Lab Home People Projects Publications Teaching Repositories Contact Us Computer Architecture Research Lab @ CUT Founded in 2024 by Andreas Diavastos as part of the Department of Electrical Engineering, Computer Engineering and Informatics at the Cyprus University of Technology (CUT). The lab focuses in the areas of Computer Architecture and High-Performance Computing (HPC). Research Summary The Computer Architecture Research Laboratory (CARL@CUT) aims to pioneer innovative solutions at the intersection of hardware design and systems optimization. Our multifaceted research agenda spans high-performance computing architectures that maximize computational throughput while maintaining strict power-performance constraints, alongside novel techniques for energy efficiency that enable sustainable computing at scale. We develop advanced systems for parallel processing and programming paradigms that harness multi-core and many-core capabilities, with a particular focus on open-source RISC-V processor designs and custom extensions. Our lab is at the forefront of specialized AI/ML accelerator design, creating hardware solutions that dramatically improve inference and training performance for deep learning workloads. Additionally, we're exploring the frontier of quantum computing architectures, in particular the compiler and programming toolchains that bridge theoretical quantum algorithms with practical implementation. Through our interdisciplinary approach, we strive to address the fundamental challenges facing next-generation computing systems. Research Areas Computer Architecture High-Performance Computing Power-Performance Energy Efficiency Systems for Parallel Processing & Programming RISC-V Processors AI/ML Accelerators Quantum Computing People Lab researchers and alumni Projects Lab current and past projects Publications Lab selected publications to conferences and journals Teaching Courses taught at CUT by Lab researchers and academics",
  "content_length": 2022,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:57"
}