{
  "name": "Andrea Grimes Parker",
  "homepage": "https://www.cc.gatech.edu/~andrea",
  "status": "success",
  "content": "Andrea Grimes Parker Andrea Grimes Parker, Ph.D. Researcher of human-computer interaction and consumer/personal health informatics. Home Research Publications CV News Contact Recent News NIH R34 Award Fall 2021 Together with Drs. Chandler and Hernandez, I was awarded an R34 grant from the NIH to refine and test Savvy HER (Sexual/HIV Empowerment Resource), an evidence-based and theory-driven mobile application (app), specifically designed for PrEP-eligible Black women. This study aims to determine the feasibility, acceptability, and usability of the app. This study will inform a subsequent RCT (R01) to determine the effectiveness and efficacy of the mobile app on uptake of HIV prevention behaviors. IUI Keynote Spring 2021 I gave an invited keynote talk at the 2021 ACM IUI Conference, entitled “Achieving Health Equity: The Power & Pitfalls of Intelligent Interfaces”. NIH R01 Award Spring 2021 Together with Drs. Bickmore and Paasche-Orlow, I received an 4-year NIH R01 award to engage in the community-based design and evaluation of a conversational agent to promote COVID-19 vaccination in historically Black churches. Frank Prize Finalist Spring 2021 Our CSCW paper, \"Reclaiming Stigmatized Narratives: The Networked Disclosure Landscape of #MeToo\" was selected as one of 3 finalists for the Research in Public Interest Communications prize (frank prize). CHI 2021 Honorable Mention Award Spring 2021 Our CHI 2021 paper received a Best Paper Honorable Mention Award: Saksono, H., Castaneda-Sceppa, C., Hoffman, J., Seif El-Nasr, M., and Parker, A.G. StoryMap: Using Social Modeling and Self-Modeling for Supporting Physical Activity Among Low-SES Families. 3 Papers Accepted to CHI 2021 Spring 2021 The Wellness Technology Lab has had 3 papers accepted to the ACM CHI 2021 Conference: (1) StoryMap: Using Social Modeling and Self-Modeling for Supporting Physical Activity Among Low-SES Families; (2) Examining the Intersections of Race, Religion & Community Technologies: A Photovoice Study; (3) Mapping the Landscape of COVID-19 Crisis Visualizations. For more news, visit the Wellness Technology Lab's News page. About Me I am an Associate Professor in the School of Interactive Computing at Georgia Tech, and an Adjunct Associate Professor in the Department of Behavioral Sciences and Health Education, within the Rollins School of Public Health at Emory University. I am also an Adjunct Associate Professor at Morehouse School of Medicine, and an affiliate faculty member in the Cardiovascular Research Institute. I am the founder and director of the Wellness Technology Research Lab. Previously, I was an Assistant Professor in the Khoury College of Computer Sciences and the Bouve College of Health Sciences at Northeastern University. I completed a postdoctoral fellowship in the Everyday Computing Lab at the Georgia Institute of Technology, where I worked with Dr. Elizabeth Mynatt and collaborated with Dr. Veda Johnson at Emory University School of Medicine. I hold a Ph.D. in Human-Centered Computing from the Georgia Institute of Technology and a B.S. in Computer Science from Northeastern University. My digital health equity research lies at the intersection of human-computer interaction (HCI), social computing, and public health. I design, build and evaluate the impact of software tools that help people manage their health and wellness. My research specifically focuses on health equity. I study racial, ethnic and economic health disparities and the social context of health management. I take an ecological approach to technology design, whereby I conduct in-depth fieldwork to examine the intrapersonal, social, cultural, and environmental factors that influence a person's ability to achieve wellbeing--and how technology can help communities to overcome and directly address health barriers. My current work includes equity-focused research in the areas of Black women's maternal and mental health, youth civic engagement, COVID health information practices and visualization, and faith-based health interventions. Student Research Opportunities I am currently seeking highly-motivated students at all levels to work on some exciting projects at the intersection of health & technology. Click here for more information. Tweets by @andreagparker Copyright © Andrea G. Parker. All Rights Reserved. | XHTML | CSS | design by dcarter",
  "content_length": 4367,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:44"
}