{
  "name": "Andrew Markham",
  "homepage": "https://www.cs.ox.ac.uk/people/andrew.markham",
  "status": "success",
  "content": "Andrew Markham | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyAndrew MarkhamAndrew Markham Professor Andrew Markham Professor of Computer ScienceGoverning Body Fellow, Kellogg CollegeE: andrew.markham@cs.ox.ac.ukT: +44 1865 (6) 10729Wolfson Building, Parks Road, Oxford OX1 3QD Themes:SystemsArtificial Intelligence and Machine LearningCompleted Projects:Mobile and Sensor Nodes for Wildlife MonitoringAutonomous Ubiquitous Sensingmore…InterestsMy Google Scholar Citations can be found here. Visit my personal website for more info about my research. Research I am a Professor of Computer Science and I work on sensors, signal processing/machine learning, and systems. My research revolves around making machines better understand the physical world. I work within the Cyber Physical Systems (CPS) theme, and lead a large group of researchers and students. I investigate how to track and localize people, animals and objects, particularly in environments where technologies like GPS fail, such as underground or indoors. Key to this is the use of magneto-inductive tracking and communication. My work is typically cross-disciplinary and I colloborate with colleagues from a wide range of disciplines. Increasingly, my research has turned to data-driven methods, and physics-informed approaches to learning from noisy sensor data. I have particularly strong interests in AI for the environment, e.g. being part of the management committee of the Intelligent Earth CDT and designing technology for conservation. I obtained my PhD from the University of Cape Town, South Africa in 2008 researching the design and implementation of a wildlife tracking system, using heterogeneous wireless sensor networks. Within the department, I was a Postdoctoral Fellow from 2008 to 2012, I was appointed as an Associate Professor in 2013, and awarded the title of full Professor in 2021. Some of my work has neatly been summarized in the following OxfordSparks animation. BiographyPhD in Electrical Engineering, University of Cape Town, South Africa (2008): \"On a wildlife tracking and telemetry system: a wireless network approach\" BSc in Electrical Engineering, First Class Honours, University of Cape Town, South Africa (2004)Selected PublicationsView AllManage publications mmPoint: Dense Human Point Cloud Generation from mmWave Qian Xie‚ Qianyi Deng‚ Ta−Ying Cheng‚ Peijun Zhao‚ Amir Patel‚ Niki Trigoni and Andrew Markham In British Machine Vision Conference (BMVC). 2023. Details about mmPoint: Dense Human Point Cloud Generation from mmWave | BibTeX data for mmPoint: Dense Human Point Cloud Generation from mmWave | Download (pdf) of mmPoint: Dense Human Point Cloud Generation from mmWave Beyond Fusion: Modality Hallucination−based Multispectral Fusion for Pedestrian Detection Qian Xie‚ Ta−Ying Cheng‚ Jia−Xing Zhong‚ Kaichen Zhou‚ Andrew Markham and Niki Trigoni In IEEE/CVF Winter Conference on Applications of Computer Vision (WACV). 2023. Details about Beyond Fusion: Modality Hallucination−based Multispectral Fusion for Pedestrian Detection | BibTeX data for Beyond Fusion: Modality Hallucination−based Multispectral Fusion for Pedestrian Detection | Download (pdf) of Beyond Fusion: Modality Hallucination−based Multispectral Fusion for Pedestrian Detection Illumination−Aware Hallucination−Based Domain Adaptation for Thermal Pedestrian Detection Qian Xie‚ Ta−Ying Cheng‚ Zhuangzhuang Dai‚ Vu Tran‚ Niki Trigoni and Andrew Markham In IEEE Transactions on Intelligent Transportation. 2023. Details about Illumination−Aware Hallucination−Based Domain Adaptation for Thermal Pedestrian Detection | BibTeX data for Illumination−Aware Hallucination−Based Domain Adaptation for Thermal Pedestrian Detection | Download (pdf) of Illumination−Aware Hallucination−Based Domain Adaptation for Thermal Pedestrian Detection ActivitiesCyber Physical SystemsWorkplace AutonomyDeep Learning Based Inertial TrackingIntuitive PhysicsMobile and People-centric Systems and SensingIntelligent Resource Constrained SystemsMachine Learning SystemsDistributed Sensing and CoordinationPositioning in GPS-denied EnvironmentsSoftware EngineeringProjectsACE-OPSCompleted ProjectsMobile and Sensor Nodes for Wildlife MonitoringAutonomous Ubiquitous SensingUnderTrackerHARPSTrackSafe Current Students Qianyi DengSamuel HodgsonHe LiangChenyang MaShitong XuYiyuan YangJiaojiao YeJiaxing ZhongYuzhou  Zhou Research Xinyu HouResearch AssociateSangyun  ShinResearch Associate Past Students Prince AbuduYasin AlmaliogluTa-Ying ChengYuhang HeQingyong HuKai LuBen MoseleySavvas PapaioannouVít RůžičkaMarion SbaiMadhu Vankadari Bing WANGJialu WangWei WangZhihua WangLinhai XieBo YangPeijun ZhaoKaichen Zhou Past Researchers Changhao ChenStuart GolodetzPedro Porto Buarque de GusmãoNhat PhamMuhamad Risqi U. SaputraVu TranJohan WahlstromQian  XieYang XingAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 5122,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:38"
}