{
  "name": "Andrew J. McAllister",
  "homepage": "http://www.cs.unb.ca/~andrewm",
  "status": "success",
  "content": "Andrew McAllister Andrew J. McAllisterB.Sc Psy. (UNB) M.Sc.(C.S.) (UNB) Ph.D. (Univ.of Saskatchewan) Professor Address: Andrew J. McAllisterFaculty of Computer ScienceUniversity of New BrunswickP.O. Box 4400, Fredericton, NBCANADA E3B 5A3 Tel: (506) 453-5084Fax: (506) 453-3566Office: ITD420, Information Technology Centreemail:andrewm@unb.ca Research Activities Andrew McAllister’s primary research area is legacy information system modernization. His current activities include: Collaboration with Eagle Legacy Modernization, LLC in the development of enhanced capabilities for large-scale Post-Production Software Management (PPSM). This includes the development of a revolutionary new approach called Programmars (program + grammar) for parsing and processing source code for existing information systems. This approach is designed to enable source code processing efforts to scale up to industrial-sized teams; and Development of automated capabilities for identifying and tracing data flows within complex information systems involving multiple programming languages. Professional Activities For several years Dr. McAllister has been part of the management team for UNB's Faculty of Computer Science. He recently served three years as Assistant Dean (Undergraduate Programs and Co-op) and one year as Acting Dean. In addition to nearly three decades as a UNB faculty member, Dr. McAllister brings significant industrial experience to his role: In 2006-2008 he served as Vice President for an industry-leading legacy modernization firm in San Antonio, Texas; and In 1986-1990 he served as Information Systems Consultant for an international consulting firm headquartered in Montreal, Quebec. UNB Homepage          UNB Faculty of Computer Science Homepage Document: http://www.cs.unb.ca/~andrewm/ Last Revision : 2016-03-10 By Andrew McAllister",
  "content_length": 1848,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:34"
}