{
  "name": "Andrew Campbell 0001",
  "homepage": "https://www.cs.dartmouth.edu/~campbell",
  "status": "success",
  "content": "Home | Andrew T. Campbell Andrew T. Campbell A world where mobile AI helps keep people healthy About meI am the Albert Bradley 1915 Third Century professor of computer science at Dartmouth College—and, some time ago, a low-income first-generation college student. At Dartmouth, I explore the growing challenges of student mental health on college campuses and how AI and behavioral sensing from mobile phones and wearables can effectively assess mental illness and support personalized interventions to help students stay healthy and thrive. My current research is focused on the Evergreen Project, officially launched in 2025, marking the culmination of a long journey. I first pitched the original idea—then called Thrive AI—of a student-facing generative AI that integrates behavioral sensing from wearables and phones to support mental health and flourishing during Fellows Family Weekend in February 2023. I later presented it to President Beilock in September 2023, followed by her Leadership Group in November 2023, and ultimately to the Dartmouth College Trustees in March 2024. Lisa Marsch codified the concept and led the fundraising efforts, while Nick Jacobson serves as the project’s technical lead. The initiative builds on our StudentLife research at Dartmouth and extends the Mindscape project—the first generative AI application to embed smartphone behavioral sensing. Another key technical foundation is Nick’s Therabot project, the first randomized controlled trial using AI for depression intervention. For Dartmouth student adoption, Evergreen AI focuses on flourishing while supporting mental well-being, as I presented at the Dartmouth Health Summit in October 2024. With growing interest in Evergreen, I wanted to share its historical background and evolution.Recently, we received the ACM UbiComp 2024 10-Year Impact Award for the StudentLife study, which \"pioneered the integration of mental health research with mobile data mining.\" and the ACM SIGMOBILE 2019 Test of Time Paper Award for research that \"pioneered the application of machine learning across local devices and servers.\"At Dartmouth, I co-direct the HealthX Lab, co-lead the Emerging Technologies and Data Analytics at the Center for Technology and Behavioral Health, and am part of a new $20M NSF AI institute (ARIA) that is developing the next generation of AI for mental and behavioral health.Before joining Dartmouth, I spent a decade as a tenured associate professor of electrical engineering at Columbia University, where I worked on mobile computing and wireless networks.In 2009, my brother, Ed Campbell, died by suicide. At the age of 18, Ed went to Durham University, had his first depressive episode, was diagnosed with bipolar disorder, and dropped out of college. Ed had moments of pure joy in his life, but his mental illness slowly eroded his life. After his death, I switched my research area to studying the mental health of college students and started the StudentLife study at Dartmouth College.My acceptance speech in Melbourne, where I dedicated the 2024 ACM UbiComp 10-year Impact Award for the StudentLife study to my brother Ed Campbell, who died by suicide in 2009; \"His death is something I can now discuss openly, but honestly, I've never fully come to terms with it – I just don’t think you ever do. However, his life–his lovely, messy, complicated life–continues to inspire me and my work every day. For this reason, I dedicate this award to my brother Ed Campbell, the missing author and inspiration behind the StudentLife study\".The StudentLife study was timely because it began in the early years of the emerging mental health crisis among young adults, particularly on college campuses. It is during these college years that young adults are most likely to experience their first mental health episode. As a teacher, I often wondered what was happening behind my students' stressed faces and how we could help. My research focuses on the development of mobile sensing (phones, wearables), intervention, and AI technology capable of accurately assessing and managing mental illness (e.g., anxiety, depression, schizophrenia) at a population scale. Before Columbia, I spent ten years in the software industry, leading the development of wireless packet networks and operating systems. I have been a visiting professor at CMU Rwanda, the University of Salamanca, University College London, and the University of Cambridge. Between 2016 and 2018, I joined Google in Mountain View to work on cardiovascular health as a member of the Android Wearables group and Verily (formerly Google Life Sciences) as a research scientist, focusing on mental health and AI technology. My research has been covered widely by the popular press (New York Times, Wall Street Journal, Washington Post, Financial Times), TV (BBC, CBS), and radio (NPR, CBC). My research has also received several prestigious awards, including the ACM SenSys 2018 Test of Time Award for \".. pioneering applying machine learning across mobile phones and servers\", the ACM SIGMOBILE 2019 Test of Time Paper Award 2019 for “.. inspiring a huge body of research and commercial endeavors that has continued to increase the breadth and depth of mobile sensing”, the ACM 2022 UbiComp 10-year Impact Award for \" .. showing how smartphone microphones could be used to recognize stress from the user’s voice unobtrusively\" and the 2024 ACM UbiComp 10-year Impact Award for “pioneering the integration of mental health research with mobile data mining”. At Dartmouth College, I am currently teaching CS 1 Introduction to Programming and Computation, Applications of Data Science, and our first-generation student orientation in computer science.I am very fortunate to work with a fantastic group of students and faculty on developing technology to address some of the most pressing problems in healthcare today. I have published over 450 research papers on mental health, ubiquitous computing, wireless networks, sensor networks, and mobile computing and have been awarded research grants totaling $42M from a wide range of agencies (e.g., NSF, NIH, IAPRA) and companies (e.g., Google, Intel, NTT DoCoMo). At Dartmouth, I lead the StudentLife project, which involves following 200 students across their four years at Dartmouth using mobile behavioral sensing and brain imaging to better understand depression and anxiety during college.During my career I have had the great fortune to closely collaborate with an amazing set of researchers who have inspired me -- starting with Aurel Lazar (Columbia) during my Columbia years when I worked on computer networks, Tannzeem Choudhury (Cornell) in the area of human dynamics and sensing, Dror Ben-Zeev (University of Washington) in the area of mental health, and Xia Zhou (Columbia) in Mobile X. See Google Scholar for my most recent list of publications, citations, h-index, and research ranking at Dartmouth College.I live in Vermont with my wife Susan Zak and have two sons Miles and Will.Contact informationOffice: is located Engineer and Computer Science Center Room 011. Email: andrewtpcampbell@gmail.com Sponsors What's new Our paper, “Capturing the College Experience: A Four-Year Mobile Sensing Study of Mental Health, Resilience, and Behavior of College Students During the Pandemic,” received the Distinguished Paper Award at ACM UbiComp 2025. We’re especially proud that the dataset from this four-year study was released alongside the publication—making this recognition even more meaningful. Out of 208 published papers, the awards committee selected just eight that represent outstanding and exemplary contributions to the research community, October 2025.Thrilled to be part of the new $20M NSF AI Research Institute on Interaction for AI Assistants (ARIA), led by the brilliant Ellie Pavlick at Brown. Our mission: to develop the next generation of AI assistants for mental and behavioral health, August 2025 The 2025 Dean of the Faculty Award for Outstanding Mentoring and Advising is awarded to a faculty member in recognition of outstanding contributions to Dartmouth and career distinction. I’m thrilled to receive this recognition. It means a great deal to me, August 2025In the Face of Depression, Dartmouth Alumni Magazine, May 2025Evergreen AI Project for Wellbeing and Flourishing on College Campuses, April 2025Excited about the new NIH R33 grant to improve social functioning for people with serious mental illness, with the brilliant Eric Granholm and Colin Depp at UCSD, April 2025We have three postdoc openings for an exciting new project on student flourishing using behavioral sensing and LLMs. This opportunity is with Lisa Marsch and Nick Jacobson at Dartmouth’s CTBH April 2025.Assessing AI-Driven Approaches to Student Mental Health, Dartmouth News, March 2025AI & Student Mental Health Symposium @ Dartmouth: I'm co-chairing the AI & Student Mental Health Symposium @ Dartmouth on March 17, 2025. My acceptance speech for the 2024 ACM UbiComp 10-year Impact Award. Emotional moment for me, October 2024.The StudentLife mental health study won the 2024 ACM UbiComp 10-year Impact Award with the following citation: “This groundbreaking paper has had an exceptional influence and significant impact on the field. It pioneered the integration of mental health research with mobile data mining, addressing real-world challenges in innovative ways. The availability of the dataset to the community also exemplifies exemplary research practices\". October 2024.Media: Professor Andrew Campbell pioneered the use of a smartphone app to track Dartmouth students’ mental health. Dartmouth News, October 2024.Media: They Entered College in Isolation and Leave in Protest: The Class That Missed Out on Fun, Wall Street Journal April 2024. Media: AI-powered apps working to detect mental health problems. CBS News April 2024. Media: Interview about MoodCapture. The Tech Show April 2024. Late-breaking CHI paper on integrating behavioral sensing into GenAI. Th",
  "content_length": 17382,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:27"
}