{
  "name": "Andrzej S. Murawski",
  "homepage": "http://www.cs.ox.ac.uk/people/andrzej.murawski",
  "status": "success",
  "content": "Andrzej Murawski | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyAndrzej MurawskiAndrzej Murawski Professor Andrzej Murawski Professor of Computer ScienceTutorial Fellow, Worcester CollegeE: Andrzej.Murawski at cs.ox.ac.uk Room 467, Wolfson Building, Parks Road, Oxford OX1 3QD United Kingdom Themes:Programming LanguagesAutomated VerificationCompleted Projects:more…See Also:PublicationsInterests I welcome enquiries from prospective doctoral students with interests in the semantics of programming languages, automata theory, and software verification. Please feel free to contact me before the application deadline to discuss potential research topics. My research concerns the semantics of programing languages and its applications in software verification. I am interested in a broad spectrum of programming paradigms. Some recent examples include higher-order recursion, probabilistic computation, first- and higher-order state, concurrency, exceptions and objects. Much of my work draws on game semantics, a modelling framework that uses games to represent computational processes. (You can find a brief introduction to the area here.) I enjoy combining semantic research with automata theory. Recent examples of this include work on collapsible pushdown automata, automata over infinite alphabets, and tree-stack automata. I’m also exploring probabilistic systems, particularly in the context of differential privacy and machine learning. For more on this, please see my publications page. I’m actively involved in the SIGLOG community and currently serve as its Vice-Chair. From 2014 to 2022, I was Editor-in-Chief of SIGLOG News, which publishes accessible surveys of research relevant to SIGLOG. I also serve on the Steering Committee of FoSSaCS, the Editorial Board of Information and Computation, and the Advisory Boards of LMCS and TheoretiCS. Recent events: GALOP 2025, LICS 2025 (paper), Dagstuhl 25141 (talk), POPL 2025 (paper), GALOP 2024, LICS 2024 (paper, pc), ICALP 2024 (pc), NeurIPS 2023 (paper), LICS 2023 (paper), MFPS XXXIX (talk), NCIPLS (oc), POPL 2023 (pc), PERR 2022 (talk), LICS 2022 (talk), APLAS 2022(pc), LICS 2021 (paper), FSTTCS 2021 (pc), FCT 2021 (pc), ESOP 2021 (paper), FOSSACS 2021 (paper), CSL 2021 (pc), Highlights 2020 (talk), FSTTCS 2020 (pc), HOPE 2020 (paper), PERR 2020 (oc), GaLoP 2020 (pc), LSCSB (talk), FoSSaCS 2020 (pc), POPL 2020 (pc), ATVA 2019 (paper), Highlights 2019 (talk), FoPPS 2019 (course), CONCUR 2019 (paper), MFCS 2019 (paper, pc), ESSLLI 2019 (course), PERR 2019 (pc), POPL 2018 (paper), ATVA 2018 (paper), MFCS 2018 (paper), Dagstuhl 18151 (oc), FoSSaCS 2018 (pc), FLoC 2018 (oc), CONCUR 2017 (paper), ESOP 2017 (paper), FOSSACS 2017 (co-chair), POPL 2017 (erc), ···.ActivitiesNominal TechniquesGame SemanticsFoundations of Programming LanguagesSoftware Model CheckingCompleted ProjectsHigher-order Constrained Horn ClausesHigher-order Constrained Horn Clauses Current Students Benedict  BuntingHaoxuan  Yin Past Students Conrad Cotton-BarrattDavid HopkinsGuanyan LiDominik WagnerFabian ZaiserAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 3362,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:55"
}