{
  "name": "Andrew Rau-Chaplin",
  "homepage": "https://www.cs.dal.ca/~arc",
  "status": "success",
  "content": "Andrew Rau-Chaplin's Home Page Contact Info Email: arc Public Free/Busy Calendar Andrew Rau-Chaplin Research • Publications • Research Interests • Program Committees • Service • Bio and CV Students • Prospective • Current • Past Software • LaHave • Clustal XP • Digital Coliseum Teaching • Software Engineering • Parallel Computing • Data Structures • HPC • Risk Analytics Resources • ACEnet • CiteSeer • DBLP Bibliography • Google Scholar • Parallel Resources Welcome. I'm a professor and dean of the Faculty of Computer Science at Dalhousie University. My graduate students, collaborators, and I, pursue research projects that explore the application of parallel computing to data and computationally intensive problems. Our work is grounded in an algorithmic perspective, but we are committed to addressing the systems issues inherent in building working parallel applications, and performing systematic experimental evaluations. Lab Page: www.Risk-Analytics-Lab.ca Institute for Big Data Analytics: bigdata.cs.dal.ca Journal Editing: JPDC, DMTCS Program Committees: CLOSER2013, HPGC2013, WADS 2013 Funding Opportunities: Postdocs and Graduate, Undergraduate Risk Analytics. The Risk Analytics Lab explores research questions at the intersection of analytics, risk management, and high performance computing. Our research projects address challenges in catastrophe modeling, portfolio risk management, and dynamic financial analysis, by drawing on a diverse set of technologies including stochastic simulation, high performance computing, optimization, spatial OLAP, and data warehousing. Parallel Data Warehousing and OLAP. As the information age explodes with data, corporate and scientific data bases swell to previously unimagined sizes. This project investigates parallel methods to aid in data analysis and exploration. Computational Bioinformatics. DNA and Protein sequence analysis problems are often both computationally and data intensive.  This project focuses on working with Biologists and Biochemists on the design and implementation of parallel tools for fundamental problems in DNA and Protein sequence analysis and phylogeny. Home * Publications * Research * Projects Teaching * Contact me",
  "content_length": 2209,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:45"
}