{
  "name": "Andri Ioannou-Nicolaou",
  "homepage": "http://www.cut.ac.cy/faculties/aac/mga/staff/elected-staff/andri.i.ioannou",
  "status": "success",
  "content": "ΤΕΧΝΟΛΟΓΙΚΟ ΠΑΝΕΠΙΣΤΗΜΙΟ ΚΥΠΡΟΥ ΕΛ EN 20 Χρόνια ΤΕΠΑΚ myUni Βιβλιοθήκη Σχολές Σχολή Καλών και Εφαρμοσμένων Τεχνών Τμήμα Πολυμέσων και Γραφικών Τεχνών Προσωπικό Διδακτικό Ερευνητικό Προσωπικό Άντρη Ιωάννου Σχολές Σχολή Καλών και Εφαρμοσμένων Τεχνών Τμήμα Πολυμέσων και Γραφικών Τεχνών Προσωπικό Διδακτικό Ερευνητικό Προσωπικό Άντρη Ιωάννου Άντρη Ιωάννου Καθηγήτρια Τμημα Πολυμεσων και Γραφικων Τεχνων andri.i.ioannou@cut.ac.cy 25002276 https://ktisis.cut.ac.cy/cris/rp/rp00069 Η Δρ Άντρη Ιωάννου είναι Καθηγήτρια στο Τμήμα Πολυμέσων και Γραφικών Τεχνών του Τεχνολογικού Πανεπιστημίου Κύπρου. Η Άντρη έχει διδακτορικό τίτλο στην Εκπαιδευτική Τεχνολογία από το Πανεπιστήμιο του Κονέκτικατ (ΗΠΑ) και πτυχίο Πληροφορικής από το Πανεπιστήμιο Κύπρου. Το ερευνητικό της έργο, μέσω του Cyprus Interaction Lab (https://www.cyprusinteractionlab.com/) συμβάλλει σε βασικούς τομείς της εκπαιδευτικής τεχνολογίας, συμπεριλαμβανομένου του σχεδιασμού και αξιολόγηση περιβαλλόντων μάθησης ενισχυμένης με τεχνολογία, χρήση της τεχνολογίας για την υποστήριξη δεξιοτήτων στο πλαίσιο του 21ου αιώνα με έμφαση στις ψηφιακές δεξιότητες, ενσωμάτωση τεχνολογίας σε όλα τα επίπεδα εκπαίδευσης, υποστήριξη του ψηφιακού μετασχηματισμού και της ψηφιακής ικανότητας, αξιολόγηση. Links: [...] Personal website: http://andriioannou.weebly.com/ Research Lab: http://cyprusinteractionlab.com/, http://edmedia.cyens.org.cy/ Άντρη Ιωάννου Τεχνολογικό Πανεπιστήμιο Κύπρου Καθηγήτρια Η Δρ Άντρη Ιωάννου είναι Καθηγήτρια στο Τμήμα Πολυμέσων και Γραφικών Τεχνών του Τεχνολογικού Πανεπιστημίου Κύπρου. Η Άντρη έχει διδακτορικό τίτλο στην Εκπαιδευτική Τεχνολογία από το Πανεπιστήμιο του Κονέκτικατ (ΗΠΑ) και πτυχίο Πληροφορικής από το Πανεπιστήμιο Κύπρου. Το ερευνητικό της έργο, μέσω του Cyprus Interaction Lab (https://www.cyprusinteractionlab.com/) συμβάλλει σε βασικούς τομείς της εκπαιδευτικής τεχνολογίας, συμπεριλαμβανομένου του σχεδιασμού και αξιολόγηση περιβαλλόντων μάθησης ενισχυμένης με τεχνολογία, χρήση της τεχνολογίας για την υποστήριξη δεξιοτήτων στο πλαίσιο του 21ου αιώνα με έμφαση στις ψηφιακές δεξιότητες, ενσωμάτωση τεχνολογίας σε όλα τα επίπεδα εκπαίδευσης, υποστήριξη του ψηφιακού μετασχηματισμού και της ψηφιακής ικανότητας, αξιολόγηση. Links: Personal website: http://andriioannou.weebly.com/ Research Lab: http://cyprusinteractionlab.com/, http://edmedia.cyens.org.cy/ Κύπρος andri.i.ioannou@cut.ac.cy 25002276 ΑΝΑΖΗΤΗΣΗ ΠΡΟΣΩΠΙΚΟΥ Ακαδημαϊκό Προσωπικό Διοικητικό Προσωπικό ΧΑΡΤΕΣ Χάρτης Πανεπιστημίου Χάρτης Πλοήγησης Virtual Tour ΧΡΗΣΙΜΟΙ ΣΥΝΔΕΣΜΟΙ Φοιτητικό Portal (SIS) eLearning (Moodle) CUT Mail (students and staff on Office365) Επανέκδοση Κωδικού (Password Reset) Multi Factor Authentication (MFA) Απομακρυσμένη Πρόσβαση (VPN) cut-radio Intent Europe Direct green@cut Δίκτυο Ενίσχυσης και Ανάπτυξης της Μάθησης Πολιτική Προστασίας Δεδομένων Προσωπικού Χαρακτήρα Ενδοδικτυακή Ηλεκτρονική Σελίδα ΤΕΠΑΚ - Intranet Χρήσιμα videos ΣΤΟΙΧΕΙΑ ΕΠΙΚΟΙΝΩΝΙΑΣ ΤΕΧΝΟΛΟΓΙΚΟ ΠΑΝΕΠΙΣΤΗΜΙΟ ΚΥΠΡΟΥ Αρχ. Κυπριανού 30 3036 Λεμεσός 2500 2500 2500 2750 administration@cut.ac.cy Copyright © 2025 ΤΕΧΝΟΛΟΓΙΚΟ ΠΑΝΕΠΙΣΤΗΜΙΟ ΚΥΠΡΟΥ Επικοινωνία Σχετικά με τον ιστότοπο Cookie Policy Ψηφιακά αρχεία λογότυπου Επικοινωνία Σχετικά με τον ιστότοπο Cookie Policy Ψηφιακά αρχεία λογότυπου Copyright © 2025 ΤΕΧΝΟΛΟΓΙΚΟ ΠΑΝΕΠΙΣΤΗΜΙΟ ΚΥΠΡΟΥ × Βοηθήστε μας να γίνουμε καλύτεροι! Ποιος ο σκοπός της επίσκεψης σας στο διαδικτυακό μας χώρο;  Ενδιαφέρον για προγράμματα σπουδών Ενδιαφέρον για ερευνητικά προγράμματα Ενδιαφέρον για εκδηλώσεις/ανακοινώσεις Ενδιαφέρον για θέσεις εργασίας Γενικό ενδιαφέρον για το Πανεπιστήμιο Ποια η ιδιότητα σας;  Υποψήφιος φοιτητής Υφιστάμενος φοιτητής Πανεπιστημιακό μέλος ΤΠΚ Πιθανός εξωτερικός συνεργάτης Επισκέπτης γενικού ενδιαφέροντος Ποιο το επίπεδο μόρφωσης σας;  Απόφοιτος Λυκείου Απόφοιτος Πανεπιστημίου/Κολλεγίου Μεταπτυχιακό Διδακτορικό Ποια η εργασιακή σας κατάσταση;  Μαθητής Φοιτητής Άνεργος Δημόσιος Υπάλληλος Ιδιωτικός Υπάλληλος Ποια η ηλικία σας;  15-18 19-25 26-30 30- Ευχαριστούμε για τα σχόλια σας! Αρ.Αναφ. 1764565073944 ΥΠΟΒΟΛΗ Η ιστοσελίδα μας χρησιμοποιεί cookies Η ιστοσελίδα μας χρησιμοποιεί cookies για να εξασφαλίσει τη σωστή λειτουργία της, όπως καθορίζεται εδώ. Συμφωνώ Απαραίτητα cookies Analytics cookies Διαφωνώ Απαραίτητα cookies Analytics cookies Boηθήστε μας να γίνουμε καλύτεροι!",
  "content_length": 4305,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:54"
}