{
  "name": "Andrew Crabtree",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/andy.crabtree",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Andrew CrabtreeProfessor of Computer Science, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsPublications Contact workRoom C.12 Computer Science & ITJubilee CampusWollaton RoadNottinghamNG8 1BBUKworkn/aandy.crabtree@nottingham.ac.ukhttps://scholar.google.co.uk/citations?hl=en&user=LX_P5GYAAAAJ&view_op=list_works&sortby=pubdate Selected Publications ANDY CRABTREE, TOM LODGE, JAMES COLLEY, CHRIS GREENHALGH, KEVIN GLOVER, HAMED HADDADI, YOUSEF AMAR, RICHARD MORTIER, QI LI, JOHN MOORE, LIANG WANG, POONAM YADAV, JIANXIN ZHAO, ANTHONY BROWN, LACHLAN URQHART and DEREK MCAULEY, 2018. Building accountability into the Internet of Things: the IoT Databox model Journal of Reliable Intelligent Environments. PETER TOLMIE and ANDY CRABTREE, 2017. The practical politics of sharing personal data Personal and Ubiquitous Computing. Online First, ANDY CRABTREE, PETER TOLMIE and WILL KNIGHT, 2017. Repacking privacy for a networked world Computer Supported Cooperative Work: The Journal of Collaborative Computing and Work Practices. 26(4-6), 453-488CHARITH PERARA, SUSAN WAKENSHAW, TIM BAARSLAG, HAMED HADDADI, AROSHA BANDARA, RICHARD MORTIER, ANDY CRABTREE, IRENE NG, DEREK MCAULEY and JON CROWCROFT, 2017. Valorising the IoT Databox: Creating value for everyone Transactions on Emerging Telecommunications Technologies. 28(1), 38 View all publications ANDY CRABTREE and ET AL., 2108. Building accountability into the internet of things: the IoT Databox model Journal of Reliable Intelligent Environments. ANDY CRABTREE, TOM LODGE, JAMES COLLEY, CHRIS GREENHALGH, KEVIN GLOVER, HAMED HADDADI, YOUSEF AMAR, RICHARD MORTIER, QI LI, JOHN MOORE, LIANG WANG, POONAM YADAV, JIANXIN ZHAO, ANTHONY BROWN, LACHLAN URQHART and DEREK MCAULEY, 2018. Building accountability into the Internet of Things: the IoT Databox model Journal of Reliable Intelligent Environments. JOEL FISCHER, ANDY CRABTREE, JAMES COLLEY, TOM RODDEN and ENRICO COSTANZA, 2017. Data Work: How Energy Advisors and Clients Make IoT Data Accountable Computer Supported Cooperative Work: The Journal of Collaborative Computing and Work Practices. 26(4-6), 597-626NEELIMA SAILAJA, ANDY CRABTREE and PHIL STENTON, 2017. Challenges of using personal data to drive personalised electronic programme guides In: Proceedings of the SIGCHI Conference on Human Factors in Computing. 5226-5231ANDY CRABTREE, TOM LODGE, JAMES COLLEY, CHRIS GREENHALGH and RICHARD MORTIER, 2017. Accountable IoT?: Outline of the Databox model In: International Symposium on a World of Wireless, Mobile, and Multimedia Networks. 1-6CHARITH PERARA, SUSAN WAKENSHAW, TIM BAARSLAG, HAMED HADDADI, AROSHA BANDARA, RICHARD MORTIER, ANDY CRABTREE, IRENE NG, DEREK MCAULEY and JON CROWCROFT, 2017. Valorising the IoT Databox: Creating value for everyone Transactions on Emerging Telecommunications Technologies. 28(1), 38ANDY CRABTREE, PETER TOLMIE and WILL KNIGHT, 2017. Repacking privacy for a networked world Computer Supported Cooperative Work: The Journal of Collaborative Computing and Work Practices. 26(4-6), 453-488PETER TOLMIE and ANDY CRABTREE, 2017. The practical politics of sharing personal data Personal and Ubiquitous Computing. Online First, JOEL FISCHER, ANDY CRABTREE, TOM RODDEN, JAMES COLLEY, ENRICO CONSTANZA, MIKE JEWELL and SARVAPALI RAMCHURN, 2016. “‘Just whack it on until it gets hot’ - working with IoT data in the home” In: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 5933-5944ANDY CRABTREE, 2016. Enabling the new economic actor: Personal data regulation and the digital economy In: Proceedings of the 2016 IEEE International Conference on Cloud Engineering Workshop. 124-129ALAN CHAMBERLAIN and ANDY CRABTREE, 2016. Searching for music: Understanding the discovery, acquisition, processing and organisation of music in a domestic setting for design Personal and Ubiquitous Computing. 20(4), 559-571ANDY CRABTREE and PETER TOLMIE, 2016. “A day in the life of things in the home” In: Proceedings of the 19th Conference on Computer Supported Cooperative Work. 1738-1750PETER TOLMIE, ANDY CRABTREE, TOM RODDEN, JAMES COLLEY and LUGER, E., 2016. “‘This has to be the cats’ - personal data legibility in networked sensing systems” In: Proceedings of the 19th Conference on Computer Supported Cooperative Work. 491-502RICHARD MORTIER, JIANXIN ZHAO, JON CROWCROFT, QI LI, LIANG WANG, HAMED HADDADI, YOUSEF AMAR, ANDY CRABTREE, JAMES COLLEY, TOM LODGE, ANTHONY BROWN, DEREK MCAULEY and CHRIS GREENHALGH, 2016. Personal data management with the Databox: What’s inside the box? In: Proceedings of the ACM Workshop on Cloud-Assisted Networking. 49-54ANDY CRABTREE, TOM LODGE, JAMES COLLEY, CHRIS GREENHALGH, RICHARD MORTIER and HAMED HADDADI, 2016. Enabling the new economic actor: Data protection, the digital economy, and the Databox Personal and Ubiquitous Computing. 20(6), 947-957ANDY CRABTREE, PAUL TENNENT, PAT BRUNDELL and DAWN KNIGHT, 2015. Digital Records and the Digital Replay System. In: PETER HALFPENNY and ROB PROCTOR, eds., Innovations in Digital Research Methods Sage. 193-220ANDY CRABTREE, TOM RODDEN, PETER TOLMIE, RICHARD MORTIER, TOM LODGE, PAT BRUNDELL and NADIA PANTIDI, 2015. House Rules: The Collaborative Nature of Policy in Domestic Networks Personal and Ubiquitous Computing. 19(1), 203-215ANDY CRABTREE, ALAN CHAMBERLAIN, STELA VALCHOVSKA, MARK DAVIES, KEVIN GLOVER and CHRIS GREENHALGH, 2015. I've Got a Sheep with Three Legs if Anybody Wants It?: Re-visioning the Rural Economy Personal Ubiquitous Computing. 19(8), 1247-1258SHE YIN KWOK, ANYA SKATOVA, VICTORIA SHIPP and ANDY CRABTREE, 2015. The ethical challenges of experience sampling using wearable cameras In: Proceedings of the 17th International Conference on Human Computer Interaction with Mobile Devices and Services (Adjunct). 1054-1057ANDY CRABTREE and RICHARD MORTIER, 2015. Human data interaction: historical lessons from social studies and CSCW In: Proceedings of the 14th European Conference on Computer Supported Cooperative Work. 1-20GRAHAM BUTTON, ANDY CRABTREE, MARK ROUNCEFIELD and TOLMIE, P., 2015. Deconstructing Ethnography: Towards a Social Methodology for Ubiquitous Computing and Interactive Systems Design Springer. ANDY CRABTREE and ALAN CHAMBERLAIN, 2014. Making IT 'Pay a Bit Better': Design Challenges for Micro Rural Enterprise In: Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing. 687-696, *Honourable Mention AwardCHRIS GREENHALGH, ALAN CHAMBERLAIN, MARK DAVIES, KEVIN GLOVER, STELA VALCHOVSKA and ANDY CRABTREE, 2014. Displaying locality: connecting with customers and visitors in situ via their mobile devices In: Proceedings of the 3rd International Symposium on Pervasive Displays. 62-67NEHA GUPTA, ANDY CRABTREE, TOM RODDEN, DAVE MARTIN and JACKI O'NEILL, 2014. Understanding Indian crowdworkers In: Proceedings of the 17th Conference on Computer Supported Cooperative Work. Browser does not support script. Browser does not support script. School of Computer Science University of NottinghamJubilee CampusWollaton Road Nottingham, NG8 1BB For all enquires please visit: www.nottingham.ac.uk/enquire Legal information Copyright Terms and conditions Privacy Posting rules Accessibility Freedom of information Charity gateway Cookie policy Cookie Settings Get social Connect with the University of Nottingham through social media and our blogs. Campus maps | More contact information | Jobs",
  "content_length": 7857,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:29"
}