{
  "name": "Andrian Marcus",
  "homepage": "https://www.andrianmarcus.net",
  "status": "success",
  "content": "Andrian (Andi) Marcus, Ph.D.Search this siteEmbedded FilesSkip to main contentSkip to navigationSEERS Group Department of Computer ScienceSchool of ComputingGeorge Mason UniversityAs of 2024 I am serving as Program Director at the National Science Foundation, in the CCF Division of the CISE Directorate. If you need to contact me for NSF-related issues, please use amarcus@nsf.gov. Otherwise, use amarcus7@gmu.edu.Latest newsSpeaker at the ICSE 2025 New Faculty Symposium - April 29, 2025Started as Program Director at NSF - January 2024Keynote at ICSME 2023, October 1-6, 2023 - Bogota, Colombia Speaker at SIESTA 2023, Sep. 11-13, 2023 - Lugano, Switzerland more news ... Conferences 2026SANER 2026 - March 17-20ICPC 2026 - April 12-13MSR 2026 - April 13-14ICSE 2026 - April 15-18ICST 2026 - May 18-22FSE 2026 - July 5-9 RE 2026 - Aug. 17-21ICSME 2026 - Sep. 14-18ISSTA 2026 - Oct. 3-9ASE 2026 - Oct. 14-16Professional BioA former Fulbright Scholar, born and raised in Romania, Andrian Marcus is now a Professor in the Department of Computer Science at George Mason University. He was previously faculty in computer science at Wayne State University and The University of Texas at Dallas. He obtained his Ph.D. in Computer Science from Kent State University (US), with Jonathan Maletic as his advisor. He has prior degrees in Computer Science and European Studies from The University of Memphis (US) and Babeş-Bolyai University (Cluj-Napoca, Romania). In 2021 he was named Distinguished Alumnus of the Department of Mathematics and Computer Science at Babeş-Bolyai University.His research interests are in software engineering, with focus on program understanding and software evolution. He is best known for his work on using text retrieval and analysis techniques on software corpora for supporting comprehension during software evolution, and he is the recipient of the NSF CAREER awardProfessionally, he is proudest of his outstanding current and past doctoral students and finds mentoring to be the most rewarding part of the academic career. Over time, their joint research earned six Best/Distinguished Paper Awards and seven Most Influential Paper Awards at software engineering conferences.His professional service includes serving on the Steering Committees of the IEEE International Conference on Software Maintenance and Evolution (ICSME) and of the IEEE Working Conference on Software Visualization (VISSOFT). He was the General Chair and the Program Co-chair of ICSME in 2011 and 2010, respectively, and Program Co-Chair for other conferences (ICPC'09, VISSOFT'13, SANER'17).He served on the editorial boards of the of the IEEE Transactions on Software Engineering (2014-2018), the Empirical Software Engineering Journal (2010-2021), and the Journal of Software: Evolution and Process (2010-2024). 4400 University Dr., Fairfax, VA 22030Nguyen Engineering Building 4452Phone: 703-993-9237E-mail: amarcus7@gmu.edu Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2977,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:52"
}