{
  "name": "André Fujita",
  "homepage": "http://www.ime.usp.br/~fujita",
  "status": "success",
  "content": "Group of Systems Neuroscience and Systems Biology Group of Systems Biology and Systems Neuroscience Institute of Mathematics and Statistics University of São Paulo Skip to content Welcome Members Publication list Software Access map Contact Welcome Our research is focused on the interface of computer science, statistics, and biological sciences, more specifically (but not limited to) the identification and analysis of connectivity; the development of formal statistical methods in graphs, and the application of them in molecular (omics) and brain imaging (fMRI/sMRI) data to better understand several human diseases/disorders. Connectivity To determine the behavior of a biological system, it is important to understand the way each component of the system interacts with the others (connectivity). The increasing amounts of data generated by high-throughput quantification methods aid the determination of those interactions. One of our research topics consists in the identification of connectivity based on concepts of statistical dependence and Granger causality (information flow). By using these approaches, we model gene regulatory and functional brain networks. The study of the structure of those networks provides important information about how biological systems evolve in time and the potential causes of malfunctioning (the abnormal regulations observed in unhealthy networks when compared to controls). Statistics on Graphs The analysis of graphs/networks (interactions) is essential to better comprehend the behavior of the entire biological system. Standard Computer Science approaches are based on analyses of centrality measures (how important is a vertex and/or edge in the network) or isomorphism between graphs. However, real world networks are heterogeneous and present intrinsic fluctuations. For most classes of complex systems, interactions are neither invariant in time nor across systems from the same class. For example, functional brain networks of the same individual can change in time, and synaptic organization is different among individuals. Therefore, it is fundamental that rigorous statistical results be obtained in the field of Graph Theory. In this context, we are interested in the development of formal statistical theory and methods in graphs (e.g. graph model selection, parameter estimation for graphs, correlation between graphs, etc) with applications, in particular, in functional brain (based on functional magnetic resonance imaging and electroencephalography data) and molecular (genomic, transcriptomic, and proteomic data) networks. If you are highly motivated and interested in multidisciplinary and challenging projects, do not hesitate in contacting me (fujita AT ime DOT usp DOT br).",
  "content_length": 2746,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:03"
}