{
  "name": "Andreas Zell",
  "homepage": "https://uni-tuebingen.de/fakultaeten/mathematisch-naturwissenschaftliche-fakultaet/fachbereiche/informatik/lehrstuehle/kognitive-systeme/the-chair/staff/prof-dr-andreas-zell",
  "status": "success",
  "content": "Prof. Dr. Andreas Zell | Universität Tübingen Machine learning algorithms and their applications Autonomous mobile robots, sensor integration, robot vision 1972-1980 F.-M.-Schwerd-Gymnasium (high school), Speyer/Rhine, Germany 1980-1982 Undergraduate studies at Univ. Kaiserslautern 1982 B.S. in mathematics, B.S. in computer science 1982-1986 Graduate studies of computer science with minor in mathematics, Univ. Kaiserslautern 1986 Diploma in computer science; thesis: Concepts of parallel logic programs and a compiler for their realization 1986-1987 DAAD scholarship at Stanford University, USA 1987 M.S. in Computer Science: Symbolic and Heuristic Computation, Stanford Univ., USA 1986-1989 Research assistant, Univ. Stuttgart, Computer science (IfI), at the chair for programming languages (Prof. Dr. G. Barth) 1989 Ph.D. in computer science, thesis: Metalevel architectures of logic programs 1990-1994 Assistant professor, Univ. Stuttgart, IPVR, at the chair of applied computer science - image understanding (Prof. Dr. P. Levi) 1991 German University Software Prize for the Stuttgart Neural Network Simulator (SNNS) 1992 Int. MasPar Challenge Prize 1994 Habilitation (venia legendi) in computer science, Univ. Stuttgart, Postdoc thesis: Simulation of Neural Networks (in German, available from Addison-Wesley, Germany) since 10.1995 full professor, chair of computer architecture, University of Tuebingen, Wilhelm-Schickard-Institute for Computer Science. 10.2000 - 9.2002 Dean of the computer science dept., member of the Senate of the University of Tuebingen 2001 founding director of the Centre for Bioinformatics Tübingen (ZBIT) 2003 1st place in the Scientific Challenge, RoboCup Middle Size League 2003 2nd prize at doIT Software Award of the State of Baden-Württemberg, for the optimization system JavaEvA 2004 3rd prize at doIT Software Award of the State of Baden-Württemberg, for the software JCell to model gene regulatory biological networks 2006 5th place at the RoboCup 2006 in Bremen, Middle Size League, \t1st place (shared) Scientific Challenge, RoboCup Middle Size League 2008 Leading founding member of the new BSc degree course Cognitive Science at the Univ. Tübingen 9.2008 - 12.2008 sabbatical, first half, with Prof. P. Wills, Univ. of Auckland, New Zealand 1.2009 - 3.2009 sabbatical, second half, with Prof. R. Siegwart, ETH Zurich, Switzerland 2010 - now: University professor (C4) of the University of Tübingen, faculty of science, computer science department, chair of cognitive systems (renaming of the chair) 2010 - now: member of the Research Committee of the Faculty of Science of the University of Tübingen 2010 1st place, SICK Robot Day 2010 (15 internat. teams) 2012 2nd place, SICK Robot Day 2012 (14 internat. teams) 4.2013 - 7.2013 sabbatical with Prof. W. Burgard, Univ. Freiburg 2014 2nd place, SICK Robot Day 2014 (14 internat. teams) see the list of publications Prof. Andreas Zell Eberhard-Karls-Universität Tübingen Wilhelm-Schickard-Institut für Informatik Lehrstuhl Kognitive Systeme Sand 1 D - 72076 Tübingen Germany Tel: (+49/0) 7071 / 29 76455 Fax: (+49/0) 7071 / 29 5091 Email: andreas.zell@uni-tuebingen.de",
  "content_length": 3164,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:20"
}