{
  "name": "Andrew Webb",
  "homepage": "https://csc.lsu.edu/~webb",
  "status": "success",
  "content": "Andrew M. Webb: About Me I am a human-computer interaction researcher and Assistant Professor at Louisiana State University. A central theme of my work is how new technologies and software can support human creativity. My research interests are in human-centered computing, specifically in bimanual interaction, tabletop role-playing games, information visualization, interface design, computer vision for tracking movement, and art (and the beautiful interchange science and art can have). I am actively involved in the HCI research community. I co-chaired posters and demonstrations for ACM Creativity and Cognition 2019. I served on the program committee for Creativity and Cognition, CHI Works-in-Progress, and CHI Workshops. I co-chaired two workshops on Evaluation Methods for Creativity Support Environments at CHI 2013 and Design Computing and Cognition 2012. I received my Ph.D. in Computer Science from Texas A&M University. During my Ph.D. I was awarded a dissertation fellowship from Texas A&M University. My dissertation developed a creativity support tool for landscape architects using bimanual interactions with pen and multi-touch surfaces (e.g., Apple iPad Pro and Microsoft Surface products). I designed interactive software using gesture recognition and human bimanual specialization theory. I studied use of the tool over several landscape architecture courses, observing effects of my interaction design on user behavior between surface inputs, as they positioned and oriented their hands for interaction. My work has allowed me to live a number of interesting places, including Amsterdam, Paris, and Barcelona. These are multicultural cities with strong connections to creative industries. Arts and technology thrive in these locales. Living and working in these cities has impacted my growth as a researcher, provoking me to engage in interdisciplinary work involving collaborations with artists, designers, and scientists. In Barcelona, I lived near Gaudi’s La Sagrada Familia. I walked past it everyday on my way to and from work. It served as a regular reminder to think unconventionally and from multiple perspectives in my research approach; to continuously reflect upon and challenge ideas, including my own. I identify as a designer, artist, and gamer. I seek to mix artistic avocations with systematic science, to design interfaces for the playful and the efficient, to explore ideas of embodied interactions that promote social invitation, and to bridge disciplinary domains improving research and understanding. In doing so, I’ve collected not only a better awareness of my own research but also an inflection to my creative process - a bend in my design methodology. A bend away from creating just the beautiful and practical towards designing for the experiential, the expressive, the embodied.",
  "content_length": 2834,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:49"
}