{
  "name": "Andreas Kolb 0001",
  "homepage": "https://www.cg.informatik.uni-siegen.de/de/kolb-andreas",
  "status": "success",
  "content": "Prof. Dr. Andreas Kolb | CG Universität Siegen Direkt zum Inhalt Für eine korrekte Darstellung dieser Seite benötigen Sie einen XHTML-standardkonformen Browser, der die Darstellung von CSS-Dateien zulässt. Startseite Mitarbeiter Lehre Forschung Publikationen Kontakt Webmail UNISONO mehr... Fakultät I Fakultät II Fakultät III Fakultät IV Kontakt Wegweiser Suche Erweiterte Suche Personensuche Name Vorname Veranstaltungssuche Nummer Titel Lehrender Katalog der UB Siegen News weitere News Youtube Kanal CG CompGraphicsSiegen NT ETI IVG Computergraphik Medieninformatik Computer Vision Ubiquitous Computing Sie sind hierStartseite » Kolb, Andreas Prof. Dr. Andreas Kolb Raum: H-A-7108Telefon: +49 271 / 740 - 2404E-Mail: andreas.kolb@uni-siegen.de Anschrift: Universität Siegen Lehrstuhl für Computergrafik 57076 Siegen Zur Person Andreas Kolb ist seit 2003 Inhaber des Lehrstuhls für Computergraphik und Multimediasysteme an der Universität Siegen. Sein akademischer Hintergrund ist Computergraphik und Visualisierung. Seine Promotion erlangte er 1995 an der Universität Erlangen bei Prof. Hans-Peter Seidel. Vor seiner Position an der Universität Siegen war Prof. Kolb an der Fachhochschule Wedel (bei Hamburg). Er ist Mitglied des Zentrums für Sensorsysteme (ZESS) der Universität Siegen (seit 2005), der ACM/SIGGRAPH (seit 2002), der Eurographics Association (seit 2001) und der Gesellschaft für Informatik (seit 1998). Von Oktober 2009 bis September 2018 war Prof. Kolb Sprecher es DFG Graduiertenkollegs 1564 \"Imaging New Modilities\". Von Anfang 2011 bis Ende Januar 2015 war er Prodekan für Forschung und wissenschaftlichen Nachwuchs der Naturwissenschaftlich-Technischen Fakultät der Universität Siegen. Andreas Kolb war von November 2019 bis Dezember 2024 Vertrauensdozent der Deutschen Forschungsgemeinschaft (DFG) für die Universität Siegen. Seit Mai 2022 ist Andreas Kolb im Leitungsteam des Zentrums für Sensorsysteme (ZESS) und seit März 2024 ist Prorektor für Forschung, Infrastruktur und Vernetzung der Universität Siegen. Eine Übersicht meiner Publikationen findet sich unter anderem auf Google Scholar, Scopus und ResearchID. Weitere Details finden sich in seinem Curriculum Vitae. Forschungsthemen Computergraphik, Computer Vision mit ToF Sensoren, Visualisierung auf Graphikhardware Forschungsprojekte Aktuelle Forschungsprojekte unter der Leitung von Andreas Kolb: Progressive, Spatio-Temporal Consistent Inline Activity Reconstruction and Recognition: Dieses DFG Projekt befasst sich mit der Erfassung räumlich Szeneninformation zusammen mit Aktivitätsinformation. Das Projekt wird gemeinsam mit Prof. Kristof Van Laerhoven durchgeführt.. Polymorphic scene representation for enhanced instant scene reconstruction: Dieses DFG Projekt befasst sich mit der Untersuchung räumlich variabler und adaptiver Repräsentation von Szeneninformation für Echtzeitanwendungen, z.B. in der Szenenrekonstruktion. Forward and differentiable simulation of L2S sensor data: Im Rahmen dieses Teilprojekts der DFG Forschungsgruppe 5336 Learning to Sense (L2S) werden effiziente und differenzierbare Verfahren zur Simulation von Bildgebungsprozesse unter Einbeziehung von Hardware-Parametern entwickelt. Abgelaufene Projekte: Comprehensive adaptive simulation of SPH-based fluids:  In diesem von der DFG geförderten Projekt werden adaptive Fluidsimulationen untersucht, die unter anderem Aspekte der Zweiwege-Kopplung mit starren Körpern und GPU-optimierten Datenstrukturen beinhalten. Das Teilprojekt \"Visuell integrierte klinische Kooperation\" im DFG Sonderforschungsbereich 1187 \"Medien der Kooperation\" befasst sich mit der Erforschung neuer, sensorbasierter Visualisierungsmethoden in der klinischen Kooperation. Dynamic light fields: In diesem DFG-Projekt wurden Verfahren zur Erfassung und Verarbeitung von Multi-View RGB-D Daten mit dem Ziel der Erstellung von Modellen für dynamische Lichtfelder untersucht. PMD-modeling, -simulation, -evaluation & algorithms: Dieses DFG-Projekt befasste sich mit der Entwcklung anwendungsnaher Algorithmen zur Optimierung von 3D Tiefendaten aus PMD-Kameras. DFG Graduiertenkolleg 1564\"Imaging New Modalities: Im Rahmen des DFG Graduiertenkollegs wurden neue Methoden zur bildbasierten Erfassung und Verarbeitung neuer Modalitäten, insbesondere THz-Strahlung, Multispektraldaten und kombinierte 2D/3D Datenerfassungssysteme, im Bereich der Zivilen Sicherheit untersucht. Andreas Kolb ist der Sprecher des DFG Graduiertenkollegs 1564. NRW Forschungsschule \"MOSES\": Die Forschungsschule Multi-Modal Sensor Systems for Environmental Exploration befasste sich mit Methoden des Remote und der In-situ Sensorik. Interactive Multifunctional Confocal Image Analysis: Dieses DFG-Projekt befasste sich mit einem neuartigen Aufbau eines multimodalen Konfokal-Mikroskops. Dieses Microskop liefert eine sehr große, multimodale Datenmenge, die durch Techniken der visuellen Analyse aufbereitet werden. Weiterentwicklung und Anwendung eines 2D-energiedispersiven Detektors für Experimente mit Synchrontronstrahlung und FEL: In diesem vom BMB+F geförderten Forschungsvorhaben werden Algorithmen zur schnellen visuellen Analyse von großen, online akquirierten Datenmengen von energiedispersiven Detektoren entwickelt. LiveDetect3D: In diesem BMB+F-geförderte Forschungsprojekt werden neue Technologien zur Online-Akquisition von 3D THz-Daten und zur Online-Auswertung und Visualisierung dieser Daten entwickelt. EvaFaP:Dieses Projekt, gefördert vom BMB+F, untersucht einen neuen Ansatz zur Tiefenerfassung auf einem Facettenaugen-Prinzip. Entwicklung einer berührungslosen Erfassung von Fahrzeugkonturen zur Steuerung von Kfz-Waschanlagen auf Basis von PMD-Sensoren: Dieses BMWi-geförderte Projekt entwickelt einen Prototypen für eine Autowaschanlage, die von einem Multi-PMD-Sensor Setup gesteuert wird. Siegener Graduiertenschule: In dieser von der Universität Siegen geförderten GraduiertenschuleEntwicklung integraler Heterosensor-Architekturen für die n-dimensionale (bio)chemische Analytik, werden vielschichtige Aspekte heterogener Sensorarrays für die (bio)chemische Analytik erforscht. Der Forschungsschwerpunkt der Computergraphik Gruppe ist die interaktive, explorative Visualisierung und Simulation von Sensoren auf der Mikroskala. Bistatic Exploration: Innerhalb diese DFG-geförderten Forschungspakets untersucht er mit seiner Arbeistgruppe schnelle und akkurate Algorithmen zur Visualisierung von Synthetic Aperture Radar (SAR) Bildern. Dynamic 3D Vision: Innerhalb dieses DFG-geförderten Forschungspakets werden von ihm und seiner Arbeitsgruppe Techniken zu Kalibrierung, Fusion und zum bildbasierten Rendering auf Basis der PMD Technologie erforscht. Andreas Kolb war Sprecher des DFG Graduiertenkollegs 1564. Lynkeus: Innerhalb dieses BMB+F-geförderten Verbundprojekts entwickelt er mit seiner Arbeitsgruppe schnelle PMD Simulatoren und echtzeitfähige Algorithmen zum Umgebungsmodellierung. © Universität Siegen",
  "content_length": 6954,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:05"
}