{
  "name": "André Freitas",
  "homepage": "http://andrefreitas.org",
  "status": "success",
  "content": "Andre Freitas (AI Researcher) | Natural Language Inference top of pageAndré Freitas Artificial Intelligence | Natural Language Processing | Reasoning | Scientific Inference | Cancer Research André Freitas Neuro-symbolic AI LabSenior Lecturer (Associate Professor) Department of Computer Science University of ManchesterResearch Group Leader IDIAP Research InstituteAI Group Leader National Biomarker Centre CRUK Manchester InstituteBIO & RESEARCH AREASBIOBio: André Freitas is a Senior Lecturer at the Department of Computer Science at the University of Manchester, an AI Group leader at the National Biomarker Centre (CRUK Manchester Institute), and a Research Group Leader at the Idiap Research Institute (Switzerland). He leads the Neuro-symbolic AI Lab. His main research interests are on enabling the development of AI methods to support abstract, flexible and controlled reasoning in order to support AI-augmented scientific discovery. In particular, he investigates how the combination of neural and symbolic data representation paradigms can deliver better models of inference. He is an active contributor to the main conferences and journals in the AI/Natural Language Processing (NLP) interface (AAAI, NeurIPs, ACL, EMNLP, EACL, COLING, TACL, Computational Linguistics), with over 100 peer-reviewed publications. The Neuro-Symbolic AI Lab has the mission of building the foundations to deliver complex and controlled AI reasoning. We believe that AI methods are an integral part of new epistemological foundations for rationality and science. Research Areas:​ Natural Language Inference Explanation Generation Neuro-symbolic NLP: NLP & Formal Inference Language Models, Sentence Representation & Inference Ethical Reasoning over LLMs Controlling Large Language Models (LLMs) Expert-systems based on LLMs LLMs to support scientific discovery Mathematical Language Processing Natural Language Processing in Oncology Multi-omics Transformer-based models Biomarker Discovery in Oncology ​RECENT NEWSPUBLICATIONSMarch 2024 3 papers accepted at NAACL (2x)/NAACL Findings (1x) 2024 Talk at University of Lincoln, UK: Scientific reasoning at the age of Large Language Models (LLMs). February 2024 3 papers accepted at LREC-COLING 2024 Talk at ESMO TAT (Targeted Anti-cancer Therapies) 2024 (Paris): AI in early phase clinical trials: new analytical frontiers. ​ January 2024 4 papers accepted at EACL (3x)/EACL Findings (1x) 2024 Talk at SciLifeLab@Karolinska Institutet, Scientific reasoning in oncology supported by generative AI. PUBLICATIONSNEWS2024: Jordan Meadows, Marco Valentino, Damien Teney, André Freitas, A Symbolic Framework for Evaluating Mathematical Reasoning and Generalisation with Transformers, The 2024 Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL), 2024. ​ Marco Valentino, Jordan Meadows, Lan Zhang, André Freitas, Multi-Operational Mathematical Derivations in Latent Spaces, The 2024 Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL), 2024. ​ Yingji Zhang, Marco Valentino, Danilo S. Carvalho, Ian Pratt-Hartmann, André Freitas, Graph-Induced Syntactic-Semantic Spaces in Transformer-Based Variational AutoEncoders, Findings of the NAACL, 2024. Marco Valentino, Danilo S. Carvalho, André Freitas, Multi-Relational Hyperbolic Word Embeddings from Natural Language Definitions, The 18th Conference of the European Chapter of the Association for Computational Linguistics (EACL), 2024. Xin Quan, Marco Valentino, Louise A. Dennis, André Freitas, Enhancing Ethical Explanations of Large Language Models through Iterative Symbolic Refinement, Findings of the EACL, 2024. Yingji Zhang, Danilo S. Carvalho, Marco Valentino, Ian Pratt-Hartmann, André Freitas, Improving Semantic Control in Discrete Latent Spaces with Transformer Quantized Variational Autoencoders , Findings of the EACL, 2024. Leonardo Ranaldi, André Freitas, Aligning Small and Large Large Language Models via Chain-of-Thought Reasoning, Findings of the EACL, 2024. Hafiz Rauf, André Freitas, Norman Paton, Deep Clustering for Data Cleaning and Integration, In 27th International Conference on Extending Database Technology (EDBT), 2024. Julia Rozanova, Marco Valentino, André Freitas, Estimating the Causal Effects of Natural Logic Features in Neural NLI Models, LREC-COLING, 2024. Mokanarangan Thayaparan, Marco Valentino, André Freitas, A Differentiable Integer Linear Programming Solver for Explanation-Based Natural Language Inference, LREC-COLING, 2024. Leonardo Ranaldi, Giulia Pucci, André Freitas, Does language matter? Curriculum Learning over Neo-latin Languages, LREC-COLING, 2024. 2023: Mael Jullien, Marco Valentino, Hannah Frost, Paul O’Regan, Donal Landers, André Freitas, NLI4CT: Multi-Evidence Natural Language Inference for Clinical Trial Reports, The Conference on Empirical Methods in Natural Language Processing (EMNLP), 2023. Julia Rozanova, Marco Valentino, Lucas Cordeiro, André Freitas, On Interventional Probing in High Dimensions: An NLI Case Study, In Findings of the European chapter of Association for Computational Linguistics (Findings of EACL), 2023. Danilo S. Carvalho, Giangiacomo Mercatali, Yingji Zhang, André Freitas, Learning Disentangled Representations for Natural Language Definitions, In Findings of the European chapter of Association for Computational Linguistics (Findings of EACL), 2023. Christina Niklaus, Matthias Cetto, André Freitas, Siegfried Handschuh, A Canonical Context-preserving Representation for Open IE: Extracting Semantically Typed Relational Tuples from Complex Sentences, Knowledge-Based Systems, 2023. Jordan Meadows, André Freitas, Introduction to Mathematical Language Processing: Informal Proofs, Word Problems, and Supporting Tasks, Transactions of the Association for Computational Linguistics (TACL), 2023. Oskar Wysocki, Jessica K. Davies, Markel Vigo, Anne C. Armstrong, Donal Landers, Rebecca Lee, André Freitas, Assessing the communication gap between AI models and healthcare professionals: Explainability, utility and trust in AI-driven clinical decision-making, Artificial Intelligence, 2023. Alex Bogatu, Magdalena Wysocka, Oskar Wysocki, …, Meta-analysis informed machine learning: Supporting cytokine storm detection during CAR-T cell Therapy, Journal of Biomedical Informatics, 2023. Magdalena Wysocka, Oskar Wysocki, Marie Zufferey, Donal Landers,  André Freitas, A systematic review of biologically-informed deep learning models for cancer: fundamental trends for encoding and interpreting oncology data, BMC bioinformatics 24 (1), 1-31, 2023. Robbe Saese et al., Defining the role of real-world data in cancer clinical research: the position of the European Organisation for Research and Treatment of Cancer, European Journal of Cancer (EJC), 2023 . Luis Castelo-Branco et al, Learning Lessons from the COVID-19 pandemic for Real World Evidence research in Oncology–shared perspectives from an international consortia,  ESMO Open, 2023. John J. Taylor, Ahalya Subramanian, André Freitas, Deborah Ferreira, Chris Dickinson, What do individuals with visual impairment need and want from a dialogue-based digital assistant?, Clinical and Experimental Optometry, 2023. Mario Ramirez, Alex Bogatu, Norman W. Paton,  André Freitas, Transformers, Tables and Frame Semantics, 17th International Conference on Semantic Computing (ICSC), 2023. Mael Jullien, Marco Valentino, Hannah Frost, Paul O'Regan, Donal Landers,  André Freitas, SemEval-2023 Task 7: Multi-Evidence Natural Language Inference for Clinical Trial Data, 17th International Workshop on Semantic Evaluation (Semeval 2023), 2023. ​ 2022: Mokanarangan Thayaparan, Marco Valentino, Deborah Ferreira, Julia Rozanova, André Freitas, Diff-Explainer: Differentiable Convex Optimization for Explainable Multi-hop Inference, Transactions of the Association for Computational Linguistics  (TACL), 2022. Marco Valentino, Mokanarangan Thayaparan, Deborah Ferreira, André Freitas, Hybrid Autoregressive Solver for Scalable Abductive Natural Language Inference, In Proceedings of 36th AAAI Conference on Artificial Intelligence (AAAI), 2022. Giangiacomo Mercatali, André Freitas, Vikas Garg, Symmetry-induced Disentanglement on Graphs, Advances in Neural Information Processing Systems 35 (NeurIPS), 2022. Deborah Ferreira, Mokanarangan Thayaparan, Marco Valentino, Julia Rozanova, André Freitas, To be or not to be an Integer? Encoding Variables for Mathematical Text, Findings of the ACL, 2022. ​ Edoardo Manino, Julia Rozanova, Danilo Carvalho, André Freitas, Lucas Cordeiro, Systematicity, Compositionality and Transitivity of Deep NLP Models: a Metamorphic Testing Perspective, Findings of the ACL, 2022. ​ Marco Valentino, Mokanarangan Thayaparan, André Freitas, Case-based Abductive Natural Language Inference, The 29th International Conference on Computational Linguistics (COLING), 2022. Oskar Wysocki, Zili Zhou, Paul O'Regan, Deborah Ferreira, Magdalena Wysocka, Dónal Landers, André Freitas, Transformers and the representation of biomedical background knowledge, Computational Linguistics, 2022. Oskar Wysocki, Jessica Katharine Davies, Markel Vigo, Anne Caroline Armstrong, Dónal Landers, Rebecca Lee, André Freitas, Assessing the communication gap between AI models and healthcare professionals: explainability, utility and trust in AI-driven clinical decision-making, Artificial Intelligence, 2022 . Alex Bogatu, Norman W. Paton, Mark Douthwaite, Stuart Davie, André Freitas, Data Discovery and Integration for Onboarding in Data Science, 37th IEEE International Conference on Data Engineering (ICDE), 2022. Philip Osborne, Heido Nomm, André Freitas, A Survey of Text Games for Reinforcement Learning Informed by Natural Language, Transactions of the Association for Computational Linguistics  (TACL), 2022. Hannah Frost, Donna Graham, Louise Carter, Paul O'Regan, Donal Landers, André Freitas, Patient Attrition in Molecular Tumour Boards: A Systematic R",
  "content_length": 24542,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:04"
}