{
  "name": "Andriana Prentza",
  "homepage": "https://www.ds.unipi.gr/en/faculty/aprentza-en",
  "status": "success",
  "content": "Andriana Prentza - Department of Digital Systems Skip to content Andriana Prentza Phone +30 210-4142768 Email aprentza@unipi.gr Title Professor Office Hours Tuesday, 14:00 - 15:30 Office 204 (150, Androutsou Str, Piraeus, 18532) Courses Object-Oriented Programming — 2nd semester Systems Interoperability — 7th semester Structured Representation of Information — 6th semester Software Engineering — 3rd semester Brief CV Andriana Prentza is a Professor at the Department of Digital Systems of the University of Piraeus, Greece. She received her Diploma in Computer Engineering and Information Sciences and her M.Sc. in Biomedical Engineering from the University of Patras, Greece, and her Ph.D. degree in Biomedical Engineering from the Eindhoven University of Technology, Eindhoven, the Netherlands. She has been a teaching/research assistant at the Department of Electrical Engineering of Eindhoven University of Technology and a senior Research Scientist at the Biomedical Engineering Laboratory of the Institute of Communication and Computer Systems of National Technical University of Athens (ICCS-NTUA), Athens, Greece. She is very actively involved in a number of European and National R&D programs focusing on Information Communication Technologies (ICT) projects and she serves as expert evaluator and reviewer for the European Commission and national research and development programmes. Her current research interests include Software Engineering techniques and methodologies for the development and evaluation of interoperable software systems, specifications and services in the areas of eGovernment, eHealth and biomedicine. She is a Senior Member of the Institute of Electrical and Electronics Engineers (IEEE) and a member of the Technical Chamber of Greece. Since 2017, she is member of the Change Management Board (CMB) of OpenPEPPOL for the pre-award specifications in eProcurement. Publications Publications Publications 2014 – 2019 I) JOURNALS K. Koumaditis, M. Themistocleous, A. Prentza, D. Kyriazis, G. Vassilacopoulos, F. Malamateniou, N. Maglaveras, I. Chouvarda, A. Mourouzis, “Patient-Centered e-Health Record over the Cloud”, Integrating Information Technology and Management for Quality of Care, J. Mantas, M.S. Househ, A. Hasman, (Eds.), Studies in Health Technology and Informatics, IOS Press, Vol. 202, pp. 193-196, 2014. V. Koufi, F. Malamateniou, A. Prentza, G. Vassilacopoulos, “A Framework for Privacy-preserving Classification of Next-generation PHR data”, Integrating Information Technology and Management for Quality of Care, J. Mantas, M.S. Househ, A. Hasman, (Eds.), Studies in Health Technology and Informatics, IOS Press, Vol. 202, pp. 119-122, 2014. D. Katehakis, G. Pangalos, A. Prentza, “Research Note: A European eHealth Space for Moving Cross-border ePrescription and Patient Summary Services Forward”, Transforming Government: People, Process and Policy, Vol. 10 Issue: 3, pp. 478 – 504, 2016. V. Koufi, F. Malamateniou, A. Prentza, G. Vassilacopoulos, “Real-time Process Analytics in Emergency Healthcare”, Informatics empowers Healthcare Transformation, J. Mantas, A. Hasman, G. Gallos, M.S. Househ (Eds.), Studies in Health Technology and Informatics, IOS Press, Vol. 238, pp. 147-150, 2017. D. Katehakis, G. Pangalos, A. Prentza, “Security Improvements for Better and Safer Cross-border ePrescription and Patient Summary Services”, International Journal of Reliable and Quality E-Healthcare (IJRQEH), Vol. 6, Issue 1, pp. 18-28, January-March 2017. A. Mondorf, M. Wimmer, A. Prentza, et al. “Business Interoperability Specification BIS 56 – Virtual Company Dossier (VCD)”, PEPPOL BIS, March 2017. S. Meckelborg, J. Maroe, A. Prentza, et al. “e-SENS eTendering Business Interoperability Specification BIS 54 – Submit Tender”, PEPPOL BIS, March 2017. S. Meckelborg, J. Maroe, A. Prentza, et al. “e-SENS eTendering Business Interoperability Specification BIS 47x – Call for Tender with ESPD”, PEPPOL BIS, March 2017. C. Khoenkhoen, K. Drijfhout, A. Prentza, et al. “e-SENS eTendering Business Interoperability Specification BIS 46 – Subscribe to Procedure”, PEPPOL BIS, March 2017. A. Mondorf, M. Wimmer, A. Prentza, et al. “Business Interoperability Specification BIS 41 – European Single Procurement Document (ESPD)”, PEPPOL BIS, March 2017. C. Khoenkhoen, K. Drijfhout, A. Prentza, et al. “e-SENS eTendering Business Interoperability Specification BIS 36 – Message Level Response”, PEPPOL BIS, March 2017. II) CONFERENCES K. Koumaditis, M. Themistocleous, G. Vassilacopoulos, A. Prentza, F. Malamateniou, D. Kyriazis, G. Pittas “Introducing a Patient-Centered e-Health Record Over the Cloud”. In Proceedings of the Third International Conference on Global Health Challenges (GLOBAL HEALTH 2014), Rome, Italy, August 24-28, 2014. M. Poulymenopoulou, F. Malamateniou, A. Prentza, G. Vassilacopoulos, “Challenges of evolving Pincloud PHR into a PHR-based health analytics system”. In Proceedings of the European, Mediterranean & Middle Eastern Conference on Information Systems (EMCIS2015), Athens, Greece, June 1-2, 2015. D. Katehakis, G. Pangalos, A. Prentza, “Creating a European eHealth space for cross-border ePrescription and Patient Summary Services”. In Proceedings of the European, Mediterranean & Middle Eastern Conference on Information Systems (EMCIS2015), Athens, Greece, June 1-2, 2015. F. Malamateniou, M. Themistocleous, A. Prentza, D. Papakonstantinou, G. Vassilacopoulos, “A Context-aware, Capability-based, Role-centric Access Control Mechanism for IoMT”. In Proceedings of the 6th EAI International Conference on Wireless Mobile Communication and Healthcare – “Transforming healthcare through innovations in mobile and wireless technologies” (MOBIHEALTH2016), Milan, Italy, November 14-16, 2016. F. Malamateniou, M. Themistocleous, A. Prentza, G. Vassilacopoulos, “A Capability-based, Role-centric Access Control Mechanism for IoMT-enhanced, Cloud-based PHRs”. In Proceedings of the European, Mediterranean & Middle Eastern Conference on Information Systems (EMCIS2016), Krakow, Poland, June 23-24, 2016. V. Koufi, A. Prentza, F. Malamateniou, G. Vassilacopoulos, “Health Tourism: Enabling Globalization of Healthcare through a Lifelong Cloud-Based Personal Health Record”. In Proceedings of the International Meeting on Health Tourism and Thermal Care (IMHTTC), Descenzano del Garda, Italy, July 13-15, 2017. III) BOOK CHAPTERS K. Koumaditis, G. Pittas, M. Themistocleous, G. Vassilacopulos, A. Prentza, D. Kyriazis, F. Malamateniou, “Cloud Services for Healthcare: Insights from a Multidisciplinary Integration Project”, in Delivery and Adoption of Cloud Computing Services in Contemporary Organizations, Advances in Systems Analysis, Software Engineering and High Performance Computing, V. Chang (Ed.), IGI Global, ISBN 1466682116, 9781466682115, Ch. 12, pp. 292-317, 2015. Also included in E-Health and Telemedicine: Concepts, Methodologies, Tools, and Applications, V. Chang, R. Walters, G. Wills (Eds.), IGI Global 701 E. Chocolate Av. Hershey PA 17033-1240, USA, ISBN 978-1-4666-8756-1, Vol. 2, Ch. 36, pp. 709-734, 2016. F. Malamateniou, M. Themistocleous, A. Prentza, D. Papakonstantinou, G. Vassilacopoulos, “A Context-Aware, Capability-Based, Role-Centric Access Control Model for IoMT”, in Wireless Mobile Communication and Healthcare, P. Perego, G. Andreoni, G. Rizzo (Eds.), Lecture Notes of the Institute for Computer Sciences, Social Informatics and Telecommunications Engineering, DOI 10.1007/978-3-319-58877-3, pp. 125-131, 2017. D. Katehakis, G. Pangalos, A. Prentza, “Security Improvements for Safer Cross-border eHealth Services in Europe”, in Quality Assurance in the Era of Individualized Medicine, IGI Global, to appear, 2019. IV) BOOKS A. Prentza and K. Saidis (editors for the Greek translation), “Software Engineering, a Practitioner’s Approach”, R. Pressman and B. Maxim, ISBN 978-960-418-720-1, Tziolas Publications, 8th Edition, 2018. Recent announcements 2nd Application Submission period for the M.Sc. Program “E-Learning” until Monday 16 June 2025 May 30, 2025 Call for Applications for the M.Sc. Program “Information Systems & Services” (Extended until 21/07/2025) May 30, 2025 Announcement of Extension for the Distribution of Textbooks May 30, 2025 Extension of the deadline for applications for free student meals for the Academic Year 2024-2025 until Wednesday 4 June 2025 May 28, 2025 Announcement of the MSc in “Health Services Organisation and Management – Health Informatics” for the Academic Year 2025 – 2026 May 27, 2025 Start of course/teaching evaluations for the spring semester 2024-2025 May 20, 2025 Searching for students for Internship May 12, 2025 Update on the Entrepreneurship & Career Panorama 2025 May 12, 2025 Useful LinksInstitute of Electrical and Electronics Engineers (IEEE) The British Computer Society (BCS) Workflow Management Coalition (WfMC) International Medical Informatics Association (IMIA) The American Medical Informatics Association (AMIA) European Federation For Medical Informatics (EFMI) Hellenic Society of Computer and Information Scientists and Professionals Evdoxos Alumni Site We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it.Ok",
  "content_length": 9284,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:56"
}