{
  "name": "Andrew Luxton-Reilly",
  "homepage": "https://www.cs.auckland.ac.nz/~andrew-l",
  "status": "success",
  "content": "Andrew Luxton-Reilly personal teaching research professional about me I am a Professor in the School of Computer Science at the University of Auckland. I initially completed an BA in Philosophy/Psychology, followed by an MA(Hons) in Philosophy, focused on metaphysics, logic, theory of mind and theory of language, before joining the Computer Science department in a teaching role in 1995. I subsequently completed a BSc, Postgraduate Certificate of Academic Practice, and a PhD in Computer Science Education. I am currently (2020-2026) the Associate Dean Teaching and Learning for the Faculty of Science. I was very fortunate to have spent my childhood on Waiheke Island in the Hauraki Gulf in Auckland. I live in Auckland with my wife, three children and one cat. brief biography Prof. Andrew Luxton-Reilly began teaching in the School of Computer Science at the University of Auckland in 1995. He is actively involved in the development of curriculum, and an advocate for scholarship of teaching and learning within the School of Computer Science, and more widely for the Faculty of Science as the Associate Dean Teaching and Learning (2020-2026). He has received several teaching awards, including recognition of his contribution to teaching at the national (Ako Aoteoroa National Tertiary Teaching Excellence Award) and international level (Computing Research and Education Association of Australasia (CORE) Teaching Award). Andrew has contributed significantly to the international Computing Education Research community with several senior roles, including program chair of ACE, ITiCSE and CompEd, and roles in ACM SIGCSE Executive and CORE Executive. He is a Distinguished Member of ACM. more information For more information on teaching, research and service, please see the following pages: Teaching Research Service contact Professor Andrew Luxton-Reilly, PhD, MA (Hons), BSc, BA, PGCertAcadPrac, Dist Mem ACM Computer Science Department, University of Auckland, Auckland, New Zealand +64 9 923 5654 andrew@cs.auckland.ac.nz",
  "content_length": 2035,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:36"
}