{
  "name": "Andreas Krall",
  "homepage": "http://www.complang.tuwien.ac.at/andi",
  "status": "success",
  "content": "Andreas Krall - TU Wien, Complang-Gruppe Andreas Krall Technische Universität Wien Compilers and Languages Argentinierstraße 8 / 4. Stock A-1040 Wien, Austria T: +43 (1) 58801-18511 F: +43 (1) 58801-18598 E: andi@complang.tuwien.ac.at Ausgewählte Lehrveranstaltungen Programmierparadigmen, 194.023 VU 6.0 ECTS Übersetzerbau, 185.A48 VU 6.0 ECTS Abstrakte Maschinen, 194.160 VU 6.0 ECTS Dynamic Compilation, 185.A50 VU 3.0 ECTS Codegeneratoren, 185.416 VO 3.0 ECTS Projekt, Bachelorarbeit, Diplomarbeit Themen PR 10.0 ECTS Detailiertere Informationen finden sich unter Lehre. Research My research interests are in the area of compilers, virtual machines, logic programming, programming languages and computer architecture. I am leading the research projects Vienna Architecture Description Language, Adaptive Optimizations in the CACAO Java Virtual Machine, Optimal Code Generation for Explicitely Parallel Processors and Correct Compilers for Correct Aplication Specific Processors. I was managing the Christian Doppler Laboratory Compilation Techniques for Embedded Processors For more information take a look into my research, see my list of selected publications, take a look at Google Citations, read my short biography and see how I serve the scientific community. Private My son Julian was born on 11th November 2000. Are you interested in Rock'n Roll Acrobatic? Complang Complang Krall Lehre Research Publications Professional Activities Short Bio Sitemap Schnellzugriff: MitarbeiterInnen Bibliothek LVAs: Programmierparadigmen Programmierparadigmen Forum Übersetzerbau Abstrakte Maschinen Dynamic Compilation Codegeneratoren Orientierung Seminar Übersetzerbau Seminar Research: OpenVADL VADL Cacao CD EPICOpt C3Pro Anfang | HTML 4.01 | Datenschutzerklärung | letzte Änderung: 2025-04-11 (Krall)",
  "content_length": 1802,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:06"
}