{
  "name": "Andre Souto",
  "homepage": "https://ciencias.ulisboa.pt/en/perfil/ansouto",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Skip to main content Ciências ULisboa Pesquisa Português English Login You are here / / Back to Top André Souto Contactos Departamento de Informática Sala/Gabinete 6.3.21 Ext. Principal 526321 Telefone Direto 217500573 Extensão pessoal 526321 Email ansouto@ciencias.ulisboa.pt Carreira Docente Universitário Categoria Professor Auxiliar Indicadores ResearcherID Orcid Scopus Google Scholar CiênciaVitae Palavras Chave Quantum criptography primitives Kolmogorov complelity Computational complexity Keywords Quantum computation Kolmogorov complexity Cryptography Currículo Resumido I made my PhD in FCUP in 2011 on computational and Kolmogorov complexity. In 2012 I got a Pos-Doc scholarship to work on quantum computation, in which I majorly develop my work with special interest into cryptographic applications. Interesses Científicos Kolmogorov Complexity; Computacional Complexity; Quantum Computation; Quantum and Classical Criptography; Scientific Interests Quantum computation; Kolmogorov complexity; Cryptography Publicações selecionadas P. Branco, P. Mateus, C. Salema, A. Souto, Using Low-Density Parity-Check codes to improve the McEliece cryptosystem, Information Sciences 510, 243-255, 2020 Elsevier LWSEE: Lightweight Secured Software-Based Execution Environment M Lemus, R Faleiro, P Mateus, N PaunkoviÄ, A Souto, Quantum Kolmogorov complexity and quantum correlations in deterministic-control quantum Turing machines, Quantum 8, 1230 The smelly eight: An empirical study on the prevalence of code smells in quantum computing Q Chen, R Câmara, J Campos, A Souto, I Ahmed, The smelly eight: An empirical study on the prevalence of code smells in quantum computing, 2023 IEEE/ACM 45th International Conference on Software Engineering (ICSE 2023) Ver todas as Publicações Prizes and Awards 2024-06-01 - Productivity Research Award in Computer Science and Engineering (LASIGE)2024-06-01 - Productivity Research Award in Computer Science and Engineering (LASIGE)2024-06-01 - Productivity Research Award in Computer Science and Engineering (LASIGE)2024-06-01 - Productivity Research Award in Computer Science and Engineering (LASIGE)2024-06-01 - Productivity Research Award in Computer Science and Engineering (LASIGE) - () - ()",
  "content_length": 2284,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:40"
}