{
  "name": "André Brinkmann",
  "homepage": "https://research.zdv.uni-mainz.de/people/andre-brinkmann",
  "status": "success",
  "content": "André Brinkmann, Prof. Dr.-Ing. | Efficient Computing and Storage Skip to contentecsAndré Brinkmann, Prof. Dr.-Ing. Head of the Efficient Computing and Storage Group Johannes Gutenberg - Universität Mainz Office 02-233 Staudingerweg 9 55128 Mainz, Germany Email: brinkman@uni-mainz.de About Prof. Dr.-Ing. André Brinkmann is a full professor at the computer science department of Johannes Gutenberg University (JGU) since 2011. He has been the head of the data center at JGU from 2011 until 2021. He received his Ph.D. in electrical engineering in 2004 from Paderborn University and has been an assistant professor in the computer science department of Paderborn University from 2008 to 2011. Furthermore, he has been the managing director of the Paderborn Centre for Parallel Computing PC2 during this time frame. His research interests focus on the application of algorithm engineering techniques in the area of data center management, cloud computing, and storage systems. He has published more than 150 papers in renowned conferences and journals and is a senior associated editor of the ACM Transactions on Storage and a member of the \"Digitalrat Rheinland-Pfalz\". Publications 2025 Andre Brinkmann, Reza Salkhordeh, Florian Wiegert, Peng Wang, Yao Xin, Renhai Chen, Huang Keji, and Gong Zhang. 2025. HLN-Tree: A Memory-efficient B plus -Tree with Huge Leaf Nodes and Locality Predictors. ACM TRANSACTIONS ON STORAGE 21, 2. DOI Author/Publisher URLFrederic Schimmelpfennig, André Brinkmann, Hossein Asadi, and Reza Salkhordeh. 2025. Enhancing mmap scalability by saving TLB shootdowns during page recycling. In 33rd Euromicro International Conference on Parallel, Distributed, and Network-Based Processing (PDP), Best Paper Award, 112–120. DOIJan Saß, André Brinkmann, Xubin He, Matias Bjørling, and Reza Salkhordehhaghighi. 2025. ZTL: Enabling Zoned Namespace Support for File Systems. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). Author/Publisher URLMaicon Hieronymus, Annika Oertel, Annette K Miltenberger, and André Brinkmann. 2025. Spatio-temporal consistency of cloud-microphysical parameter sensitivity in a warm-conveyor belt. Journal of Computational Science 89: 102614–102614. DOI Author/Publisher URLMostafa Kishani, Sina Ahmadi, Saba Ahmadian, Reza Salkhordeh, Zdenek Becvar, Onur Mutlu, André Brinkmann, and Hossein Asadi. 2025. ELICA: Efficient and Load Balanced I/O Cache Architecture for Hyperconverged Infrastructures. IEEE Transactions on Parallel and Distributed Systems 36, 10: 2152–2168. DOINjoud O Al-Maaitah, Javier Garcia-Blas, Genaro Sanchez-Gallegos, Jesus Carretero, Marc-André Vef, and André Brinkmann. 2025. A Comparative Study of Ad-hoc File Systems for Extreme Scale Computing. Future Generation Computer Systems 170: 1–18. DOI Author/Publisher URLReza Salkhordeh, Felix Martin Schuhknecht, Hossein Asadi, Steffen Eiden, and André Brinkmann. 2025. No Time to Halt: In-Situ Analysis for Large-Scale Data Processing via Virtual Snapshotting. In EDBT, 438–450. Author/Publisher URLWen Cheng, Qianya Cheng, Yi Liu, Lingfang Zeng, Andre Brinkmann, and Yang Wang. 2025. 9Ring: A 3D-Stacked Memory-Based Accelerator for Flexible and Efficient Deep CNN Applications. ACM TRANSACTIONS ON ARCHITECTURE AND CODE OPTIMIZATION 22, 2. DOI Author/Publisher URLWen Cheng, Shengxia Tu, Yi Liu, Lingfang Zeng, Yang Wang, and Andre Brinkmann. 2025. FlashFox: a secret-sharing approach to securing data deletion for Flash-based SSD. COMPUTER JOURNAL 68, 7: 734–748. DOI Author/Publisher URLYu Zhang, Renhai Chen, Gong Zhang, Peng Wang, Yao Xin, Huang Keji, and André Brinkmann. 2025. HyTorC: Hybrid Address Translation for SSDs supporting Compression. ACM Transactions on Storage. DOI 2024 Ahmad Tarraf, Martin Schreiber, Alberto Cascajo, Jean-Baptiste Besnard, Marc-Andre Vef, Dominik Huber, Sonja Happ, Andre Brinkmann, David E Singh, Hans-Christian Hoppe, Alberto Miranda, Antonio J Pena, Rui Machado, Marta Garcia-Gasulla, Martin Schulz, Paul Carpenter, Simon Pickartz, Tiberiu Rotaru, Sergio Iserte, Victor Lopez, Jorge Ejarque, Heena Sirwani, Jesus Carretero, and Felix Wolf. 2024. Malleability in Modern HPC Systems: Current Experiences, Challenges, and Future Opportunities. IEEE TRANSACTIONS ON PARALLEL AND DISTRIBUTED SYSTEMS 35, 9: 1551–1564. DOI Author/Publisher URLDaniel Medeiros, Eric B Gregory, Philippe Couvee, James Hawkes, Sebastien Gougeaud, Maike Gilliot, Olivier Bressand, Yoann Valeri, Julien Jaeger, Damien Chapon, Frederic Bournaud, Loic Strafella, Daniel Caviedes-Voullieme, Ghazal Tashakor, Jolanta Zjupa, Max Holicki, Tom Ridley, Yanik Mueller, Filipe Souza Mendes Guimaraes, Wolfgang Frings, Jan-Oliver Mirus, Ilya Zhukov, Eric Rodrigues Borba, Nafiseh Moti, Reza Salkhordeh, Nadia Derbey, Salim Mimouni, Simon Derr, Buket Benek Gursoy, James Grogan, Radek Furmanek, Martin Golasowski, Katerina Slaninova, Jan Martinovic, Jan Faltynek, Jenny Wong, Metin Cakircali, Tiago Quintino, Simon Smart, Olivier Iffrig, Sai Narasimhamurthy, Sonja Happ, Michael Rauh, Stephan Krempel, Mark Wiggins, Jiri Novacek, Andre Brinkmann, Stefano Markidis, and Philippe Deniel. 2024. IO-SEA: Storage I/O and Data Management for Exascale Architectures Invited Paper. In PROCEEDINGS OF THE 21ST ACM INTERNATIONAL CONFERENCE ON COMPUTING FRONTIERS 2024-WORKSHOPS AND SPECIAL SESSIONS, CF 2024 COMPANION, 94–100. DOI Author/Publisher URLEric Borba, Reza Salkhordeh, Salim Mimouni, Eduardo Tavares, Paulo Maciel, Hossein Asadi, and André Brinkmann. 2024. A Hierarchical Modeling Approach for Assessing the Reliability and Performability of Burst Buffers. In Proceedings of the 37th GI/IT International Conference on Architecture of Computing Systems (ARCS), Potsdam, Germany, May 14th - 16th.Fabian Kreppel, Christian Melzer, Janis Wagner, Janine Hilder, Ulrich Poschinger, Ferdinand Schmidt-Kaler, and André Brinkmann. Shuttling Compiler for a Trapped-Ion Quantum Computer Architecture with Junctions. In 2024 IEEE International Conference on Quantum Computing and Engineering (QCE), Volume 1, Montréal, Canada, September 15-20, 1065–1076. DOIFrederic Schimmelpfennig, André Brinkmann, Hossein Asadi, and Reza Salkhordeh. 2024. Skip TLB flushes for reused pages within mmap’s. CoRR abs/2409.10946.Hongming Huang, Peng Wang, Qiang Su, Hong Xu, Chun Jason Xue, and André Brinkmann. 2024. Palantir: Hierarchical Similarity Detection for Post-Deduplication Delta Compression. In Proceedings of the ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), Volume 2, La Jolla, CA, USA, 27 April 2024- 1 May, 830–845. DOIMaryam Karimi, Reza Salkhordeh, Andre Brinkmann, and Hossein Asadi. 2024. HybRAID: A High-Performance Hybrid RAID Storage Architecture for Write-Intensive Applications in All-Flash Storage Systems. IEEE TRANSACTIONS ON PARALLEL AND DISTRIBUTED SYSTEMS 35, 12: 2608–2623. DOI Author/Publisher URLPatrick Raaf, Andre Brinkmann, Eric Borba, Hossein Asadi, Sai Narasimhamurthy, John Bent, Mohamad El-batal, and Reza Salkhordeh. 2024. From SSDs Back to HDDs: Optimizing VDO to Support Inline Deduplication and Compression for HDDs as Primary Storage Media. ACM TRANSACTIONS ON STORAGE 20, 4. DOI Author/Publisher URLShunkang Zhang, Ji Qi, Xin Yao, and André Brinkmann. 2024. Hyper: A High-Performance and Memory-Efficient Learned Index via Hybrid Construction. In Proceedings of the ACM on Management of Data, 1–26. DOIYingjin Qian, Marc-André Vef, Patrick Farrell, Andreas Dilger, Xi Li, Shuichi Ihara, Yinjin Fu, Wei Xue, and André Brinkmann. 2024. Combining Buffered I/O and Direct I/O in Distributed File Systems. In Proceedings of the 22nd USENIX Conference on File and Storage Technologies (FAST), Santa Clara, CA, USA, February 27-29, 17–33. Author/Publisher URL 2023 Fabian Kreppel, Christian Melzer, Diego Alberto Olvera Millán, Janis Wagner, Janine Hilder, Ulrich Poschinger, Ferdinand Schmidt-Kaler, and André Brinkmann. 2023. Quantum Circuit Compiler for a Shuttling-Based Trapped-Ion Quantum Computer. Quantum 7: 1176–1176. DOIHao Dai, Jiashu Wu, André Brinkmann, and Yang Wang. 2023. Neighborhood-Oriented Decentralized Learning Communication in Multi-Agent System. In Lecture Notes in Computer Science. Springer Nature Switzerland, 490–502. DOIJames Vance, Zhen-Hao Xu, Nikita Tretyakov, Torsten Stuehn, Markus Rampp, Sebastian Eibl, Christoph Junghans, and André Brinkmann. 2023. Code modernization strategies for short-range non-bonded molecular dynamics simulations. Computer Physics Communications 290: 108760–108760. DOIJesus Carretero, Javier Garcia-Blas, Marco Aldinucci, Jean Baptiste Besnard, Jean-Thomas Acquaviva, Andre Brinkmann, Marc-Andre Vef, Emmanuel Jeannot, Alberto Miranda, Ramon Nou, Morris Riedel, Massimo Torquati, and Felix Wolf. 2023. Adaptive multi-tier intelligent data manager for Exascale. In Proceedings of the 20th ACM International Conference on Computing Frontiers {CF}, Bologna, Italy, May 9-11, 285–290. DOIMarc-André Vef, Alberto Miranda, Ramon Nou, and André Brinkmann. 2023. From Static to Malleable: Improving Flexibility and Compatibility in Burst Buffer File Systems. In 2nd International Workshop on Malleability Techniques Applications in High-Performance Computing (HPCMall). Author/Publisher URLNafiseh Moti, André Brinkmann, Marc-André Vef, Philippe Deniel, Jesus Carretero, Philip Carns, Jean-Thomas Acquaviva, and Reza Salkhordeh. 2023. The I/O Trace Initiative: Building a Collaborative I/O Archive to Advance HPC. In Proceedings of the SC ’23 Workshops of The International Conference on High Performance Computing, Network, Storage, and Analysis. DOI Author/Publisher URLWen Cheng, Dazou Sang, Lingfang Zeng, Yang Wang, and André Brinkmann. 2023. Tianji: Securing a Practical Asynchronous Multi-User ORAM. IEEE Transactions on Dependable and Secure Computing 20, 6: 5143–5155. DOIYingjin Qian, Wen Cheng, Lingfang Zeng, Xi Li, Marc-André Vef, Andreas Dilger",
  "content_length": 47177,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:58"
}