{
  "name": "André Bauer 0001",
  "homepage": "https://www.iit.edu/directory/people/andre-bauer",
  "status": "success",
  "content": "André Bauer | Illinois Institute of Technology Skip to main site navigation Skip to main content André Bauer Assistant Professor of Computer Science Tags: Faculty Computer Science Home Office and Department Directory Directory André Bauer EducationDr. rer. nat. Computer Science, University of WürzburgM.S. Computer Science, University of WürzburgB.S. Computer Science, University of WürzburgResearch InterestsPerformance/systems engineering for data science applicationsApplied data science as use caseAwards2023 SPECtacular Award, Standard Performance Evaluation Corporation (SPEC) Gainesville, United States The SPECtacular Award is given to individuals who have significantly exceeded expectations in their contributions to SPEC.February 2023 Leadership Academy Fellowship, German Scholars Organization Berlin, GermanyThe Leadership Academy Fellowship is awarded to 25 outstanding researchers from all disciplines.SPEC Kaivalya Dixit Distinguished Dissertation Award, SPEC Gainesville, United StatesThe SPEC Kaivalya Dixit Distinguished Dissertation Award is an annual award recognizing oneoutstanding doctoral dissertation within the scope of the SPEC Research Group in terms ofscientific originality, scientific significance, practical relevance, impact, and presentation. April 2022Distinguished Dissertation Award, Faculty of Mathematics and Computer Science Würzburg, GermanyThe Distinguished Dissertation Award is an annual award for outstanding dissertations from theFaculty of Mathematics and Computer Science. July 2021Dissertation Award, Unterfränkische Gedenkjahrstiftung für Wissenschaft Würzburg, GermanyThe Dissertation Award is an annual award for outstanding dissertations from all disciplines.Publications“An Empirical Investigation of Container Building Strategies and Warm Times to Reduce Cold Starts in Scientific Computing Serverless Functions,” André Bauer, Maxime Gonthier, Ryan Chard, Haochen Pan, Daniel Grzenda, Martin Straesser, J. Gregory Pauloski, Alok Kamatar, Matthew E. Baughman, Nathaniel Hudson, Ian Foster, and Kyle Chard. In Proceedings of the 20th IEEE International Conference on e-Science (eScience), September 2024“Thinking in Categories: A Survey on Assessing the Quality for Time Series Synthesis;” Michael Stenger, André Bauer, Thomas Prantl, Robert Leppich, Nathaniel Hudson, Kyle Chard, Ian Foster, and Samuel Kounev; Journal of Data and Information Quality, June 2024“Unveiling Temporal Performance Deviation: Leveraging Clustering in Microservices Performance Analysis,” André Bauer, Timo Dittus, Martin Straesser, Alok Kamatar, Matt Baughman, Lukas Beierlieb, Marius Hadry, Daniel Grillmeyer, Yannik Lubas, Samuel Kounev, Ian Foster, and Kyle Chard. In Companion of the 15th ACM/SPEC International Conference on Performance Engineering (ICPE), May 2024“Benchmarking of Secure Group Communication Schemes with Focus on IoT;” Thomas Prantl, André Bauer, Simon Engel, Lukas Horn, Christian Krupitzer, Lukas Iffländer, and Samuel Kounev; Discover Data, May 2024“Evaluation is Key: A Survey on Evaluation Measures for Synthetic Time Series;\" Michael Stenger, Robert Leppich, Ian Foster, Samuel Kounev, and André Bauer; Journal of Big Data, May 2024“The Globus Compute Dataset: An Open Function-as-a-Service Dataset From the Edge to the Cloud;\" André Bauer, Haochen Pan, Ryan Chard, Yadu Babuji, Josh Bryan, Devesh Tiwari, Ian Foster, and Kyle Chard; Future Generation Computer Systems, April 2023“Memory Injections: Correcting Multi-Hop Reasoning Failures during Inference in Transformer-Based Language Models,” Mansi Sakarvadia, Aswathy Ajith, Arham Khan, Daniel Grzenda, Nathaniel Hudson, André Bauer, Kyle Chard, and Ian Foster. In Proceedings of the 6th ACL BlackboxNLP Workshop on Analyzing and Interpreting Neural Networks for NLP (BlackboxNLP), December 2023“Attention Lens: A Tool for Mechanistically Interpreting the Attention Head Information Retrieval Mechanism,” Mansi Sakarvadia, Arham Khan, Aswathy Ajith, Daniel Grzenda, Nathaniel Hudson, André Bauer, Kyle Chard, and Ian Foster. In Proceedings of the 6th ACL BlackboxNLP Workshop on Analyzing and Interpreting Neural Networks for NLP (BlackboxNLP), December 2023“Trillion Parameter AI Serving Infrastructure for Scientific Discovery: A Survey and Vision,” Nathaniel C Hudson, J. Gregory Pauloski, Matt Baughman, Alok Kamatar, Mansi Sakarvadia, Logan Ward, Ryan Chard, André Bauer, Maksim Levental, Wenyi Wang, Will Engler, Owen Price Skelly, Ben Blaiszik, Rick Stevens, Kyle Chard, and Ian Foster. In Proceedings of 10th IEEE/ACM International Conference on Big Data Computing, Applications and Technologies (BDCAT), December 2023“Towards a Cryptography Encyclopedia: A Survey on Attribute-based Encryption;” Thomas Prantl, Timo Zeck, Lukas Horn, Lukas Iffländer, André Bauer, Alexandra Dmitrienko, Christian Krupitzer, and Samuel Kounev; Journal of Surveillance, Security and Safety, December 2023“Tournament-Based Pretraining to Accelerate Federated Learning,” Matt Baughman, Nathaniel Hudson, Ryan Chard, André Bauer, Ian Foster, and Kyle Chard. In Proceedings of the 4th ACM International Workshops on Artificial Intelligence and Machine Learning for Scientific Applications (AI4S), November 2023“De Bello Homomorphico: Investigation of the Extensibility of the OpenFHE Library With Basic Mathematical Functions by Means of Common Approaches Using the Example of the Ckks Cryptosystem;” Thomas Prantl, Lukas Horn, Simon Engel, Lukas Iffländer, Lukas Beierlieb, Christian Krupitzer, André Bauer, Mansi Sakarvadia, Ian Foster, and Samuel Kounev; International Journal of Information Security, November 2023“Performance Impact Analysis of Homomorphic Encryption: A Case Study Using Linear Regression as an Example,” Thomas Prantl, Simon Engel, Lukas Horn, Dennis Kaiser, Lukas Iffländer, André Bauer, Christian Krupitzer, and Samuel Kounev. In Companion of the 18th International Conference on Information Security Practice and Experience (ISPEC), August 2023“A Literature Review of IoT and CPS—What They Are, and What They Are Not;” Veronika Lesch, Marwin Züfle, André Bauer, Lukas Iffländer, Christian Krupitzer, and Samuel Kounev; Journal of Systems and Software, June 2023“An Empirical Study of Container Image Configurations and Their Impact on Start Times,” Martin Straesser, André Bauer, Robert Leppich, Nikolas Herbst, Kyle Chard, Ian Foster, and Samuel Kounev. In Proceedings of the 23rd IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing (CCGRID), May 2023“Recommendation of Secure Group Communication Schemes Using Multi-objective Optimization;” Thomas Prantl, André Bauer, Lukas Iffländer, Christian Krupitzer, and Samuel Kounev; International Journal of Information Security, May 2023“A Systematic Approach for Benchmarking of Container Orchestration Frameworks,” Martin Straesser, Jonas Mathiasch, André Bauer, and Samuel Kounev. In Proceedings of the 14th ACM/SPEC International Conference on Performance Engineering (ICPE), April 2023“Autoscaler Evaluation and Configuration: A Practitioner’s Guideline,” Martin Straesser, Simon Eismann, Jóakim Kistowski, André Bauer, and Samuel Kounev. In Proceedings of the 14th ACM/SPEC International Conference on Performance Engineering (ICPE), April 2023“Searching for the Ground Truth: Assessing the Similarity of Benchmarking Runs,” André Bauer, Martin Straesser, Mark Leznik, Lukas Beierlieb, Marius Hadry, Nathaniel Hudson, Kyle Chard, Samuel Kounev, and Ian Foster. In Companion of the 14th ACM/SPEC International Conference on Performance Engineering (ICPE), April 2023“Efficient Data Processing: Assessing the Performance of Different Programming Languages;” Lukas Beierlieb, André Bauer, Robert Leppich, Lukas Iffländer, and Samuel Kounev. In Companion of the 14th ACM/SPEC International Conference on Performance Engineering (ICPE), April 2023. Runner-up for Best Data Challenge Paper“Impact of Prophylactic Preoperative Intra-Aortic Balloon Pump on Early Outcome in Patients with Severe Left Ventricular Dysfunction Undergoing Elective On-Pump Coronary Artery Bypass Grafting;” Andrej Kralev, Jurij M. Kalisnik, André Bauer, Joachim Sirch, Matthias Fittkau, and Theodor Fischlein; The Thoracic and Cardiovascular Surgeon, February 2023“Association between Postoperative Atrial Fibrillation Recurrences and Interatrial Block by the Time of Open-Heart Surgery;” Spela Leiler, Jurij M. Kalisnik, Rok Bernik, André Bauer, Valentin Günzler, Patrick Sluet, Samuel Kounev, and Theodor Fischlein; The Thoracic and Cardiovascular Surgeon, February 2023“Impact of Prophylactic Intra-Aortic Balloon Pump on Early Outcomes in Patients With Severe Left Ventricular Dysfunction Undergoing Elective Coronary Artery Bypass Grafting With Cardiopulmonary Bypass;” Andrej Kralev, Jurij M. Kalisnik, André Bauer, Joachim Sirch, Matthias Fittkau, and Theodor Fischlein; International Journal of Cardiology, February 2023“Towards Forecasting Future Snow Cover Dynamics in the European Alps - The Potential of Long Optical Remote-Sensing Time Series;” Jonas Koehler, André Bauer, Andreas J. Dietz, and Claudia Kuenzer; Remote Sensing, September 2022“A Survey on Secure Group Communication Schemes with Focus on IoT Communication;” Thomas Prantl, Timo Zeck, André Bauer, Peter Ten, Dominik Prantl, Ala E. Ben Yahya, Lukas Iffländer, Alexandra Dmitrienko, Christian Krupitzer, and Samuel Kounev; IEEE Access, September 2022“An Experience Report on the Suitability of a Distributed Group Encryption Scheme for an IoT Use Case,” Thomas Prantl, Simon Engel, André Bauer, Ala E. Ben Yahya, Stefan Herrnleben, Lukas Iffländer, Alexandra Dmitrienko, and Samuel Kounev. In Proceedings of the 95th IEEE Vehicular Technology Conference (VTC), June 2022“Artificial Intelligence-Based Early Detection Of Acute Kidney Injury After Cardiac Surgery;” Jurij M. Kalisnik, André Bauer, Ferdinand A. Vogt, Franziska J. Stickl, Janez Zibert, Matthias Fittkau, Thomas Bertsch, Samuel Kounev, and Theodor Fischlein; European Journal of Cardio-",
  "content_length": 11793,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:57"
}