{
  "name": "Andrew W. Eckford",
  "homepage": "http://www.andreweckford.com",
  "status": "success",
  "content": "EckfordLab Main Page From EckfordLab Jump to:\t\t\t\t\tnavigation, \t\t\t\t\tsearch EckfordLab Molecular Communication and Information Theory Laboratory EckfordLab, the Molecular Communication and Information Theory Laboratory under the supervision of Professor Andrew Eckford, is located in the Lassonde School of Engineering at York University, Toronto, Canada. The lab is concerned with problems involving molecular communication, computational biology, and information theory. Principal Investigator | Members | Publications | Available Positions | News and Events | EckfordLab in the Media | Contact Info Latest Published Papers T. Sajjad and A. W. Eckford, \"Communication system design using synthetic photoisomerizable azobenzene-regulated K+ (SPARK) channel,\" IEEE Transactions on Molecular, Biological, and Multi-Scale Communications, vol. 11, no. 3, pp. 451-461, Sep. 2025.arXiv* IEEEXplore A. S. Moffett and A. W. Eckford, \"Kelly bets and single-letter codes: Optimal information processing in natural systems,\" IEEE Transactions on Molecular, Biological, and Multi-Scale Communications, vol. 11, no. 3, pp. 418-434, Sep. 2025.arXiv* IEEEXplore S. Bartlett, A. W. Eckford, M. Egbert, M. Lingam, A. Kolchinsky, A. Frank, and G. Ghoshal, \"The physics of life: Exploring information as a distinctive feature of living systems,\" PRX Life, vol. 3, no. 3, 037003, 2025.arXiv* Physical Review Journals open access Full List of Publications ... Lab News We are helping to organize the 3rd Workshop on Molecular, Biological, and Multi-Scale Communications, to be held in Glasgow, Scotland, UK in May 2026. More News ... EckfordLab is affiliated with the Centre for Innovation in Computing @ Lassonde. Retrieved from \"http://eckfordlab.org/index.php?title=Main_Page&oldid=616\" Navigation menu Personal tools Log in Namespaces Main page Discussion Variants Views Read View source View history More Search Navigation Main pageRecent changesRandom pageHelp Tools What links hereRelated changesSpecial pagesPrintable versionPermanent linkPage information This page was last modified on 14 October 2025, at 15:57. Privacy policy About EckfordLab Disclaimers",
  "content_length": 2143,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:49"
}