{
  "name": "Andrea Volkamer",
  "homepage": "https://volkamerlab.org/team",
  "status": "success",
  "content": "The Team - Volkamer Lab These are the Volkamer Lab members. Prof. Dr. Andrea Volkamer Group leader volkamer@cs.uni-saarland.de LinkedIn GitHub ORCiD Stefanie Wessinger Administrative assistance stefanie.wessinger@uni-saarland.de +49 681 302 50800 Dr. Michael Backenköhler PostDoc (UdS)Neuro-explicit models for drug discovery michael.backenkoehler@uni-saarland.de GitHub Google Scholar ORCiD Dr. Raquel López-Ríos de Castro Einstein BIH PostDoc (Charité)Machine learning for kinase drug discovery raquel.lopez-rios-de-castro@charite.de Linkedin GitHub Google Scholar ORCiD Twitter Dr. Guillermo Pérez Hernández PostDoc (UdS)Molecular Dynamics, Kinase Drug Discovery and Software Development guillermo.perez@uni-saarland.de GitHub Google Scholar Linkedin Twitter Antoine Lacour PostDocDockM8 Development, Virtual Screening for NEDD, and Machine Learning for Drug Discovery anla00008@uni-saarland.de GitHub Google Scholar Linkedin Yonghui Chen PhD candidate (FU Berlin)Virtual screening and deep learning for drug discovery yonghuic92@zedat.fu-berlin.de GitHub ORCiD Paula Linh Kramer PhD candidate (UdS)Deep learning for novel kinase inhibitors paula.kramer@cs.uni-saarland.de GitHub Linkedin ORCiD Floriane Odje PhD candidate (UdS)Development of DL models based on morphological and molecular data. BMBF-funded MORPHEUS project floriane.odje@gmail.com GitHub Linkedin Twitter Afnan Sultan PhD candidate (UdS/BASF)Generative AI for molecules with non-toxic properties s8afsult@uni-saarland.de GitHub Linkedin Yanyuan Zhang PhD candidate (UdS)Read-Across the Targetome yanyuan.zhang@uni-saarland.de GitHub Linkedin Hamza Ibrahim PhD candidate (UdS)Structure-based Machine Learning haib00001@stud.uni-saarland.de GitHub Linkedin Google Scholar Lisa-Marie Rolli PhD candidate (UdS)trustworthy ML methods, EU-funded RADAR project lisa-marie.rolli@uni-saarland.de GitHub ORCiD Linkedin Google Scholar Joschka Groß Associated PhD candidate (MoSi chair @ UdS, supervised by Prof. Verena Wolf)Deep learning for kinase drug discovery jgross@cs.uni-saarland.de GitHub ORCiD MoSi chair Mohammad Walid Shahrour Associated PhD candidate (Department of Drug Design and Optimization @ HIPS )Computer-aided drug design of novel Elastase B (LasB) inhibitors in Pseudomonas aeruginosa mohammadwalid.shahrour@helmholtz-hips.de GitHub Linkedin Katharina Buchthal Master student, Bioinformatics (UdS)Novel kinase ligand generation using subpocket-based docking kabu00002@stud.uni-saarland.de GitHub Fatemeh Moghaddam Master student, Bioinformatics (UdS)Interpretable E3-GNN affinity models famo00001@stud.uni-saarland.de GitHub Linkedin ORCiD Premnath Madanagopal Master student, Bioinformatics (UdS)Knowledge-guided metabolic pathway reconstruction (co-supervised by Prof. Wittmann, Systems Biotechnology) prma00002@stud.uni-saarland.de Linkedin Google Scholar GitHub Maximilian Bähr Bachelor student, Bioinformatics (UdS)Active Learning maba00001@stud.uni-saarland.de GitHub Anjali Choudhary Master student, Bioinformatics (UdS)Pattern identification for chemical structure and morphological fingerprint anch00004@uni-saarland.de GitHub Linkedin Sakhawat Hosain Sumit Master student, Visual computing (UdS)TeachOpenCADD for Jupyter notebook and interpretable machine learning. hosain.sakhawat@uni-saarland.de GitHub Linkedin Lutz Herrmann Master student, Bioinformatics (UdS & co-supervised by Prof. Dr. Kerstin Lenhof @ UMG)Benchmarking of various neural network approaches for drug sensitivity prediction luhe00002@stud.uni-saarland.de GitHub Ritika Bansal Master student, Bioinformatics (UdS & Microbial Natural Products @ HIPS)Mechanistic insights into the interaction of a novel natural product with transmembrane proteins riba00001@stud.uni-saarland.de GitHub Pousali Das Master student, Bioinformatics (UdS)Cell painting Image Processing and Pattern Recognition (MORPHEUS) poda00001@stud.uni-saarland.de Linkedin Zyad Barghouth Master student, Bioinformatics (UdS & co-supervised by Prof. Dr. Kerstin Lenhof @ UMG)Finding Optimal drug representations for Drug Sensitivity and ADMET prediction zyba00001@stud.uni-saarland.de Linkedin Gilbert El Khoury Master student, Bioinformatics (UdS)DataM8 development - Python library for registry integration to accelerate ensemble docking workflows giel00001@uni-saarland.de Linkedin GitHub Google Scholar Loulwah Arnaout Master student, Bioinformatics (UdS)Few-shot learning for toxic endpoint prediction loar00001@stud.uni-saarland.de Linkedin Aditi Lalla Master student, Bioinformatics (UdS)Improving molecular transformer models through data quality and chemistry awareness aditi.lalla@uni-saarland.de Linkedin GitHub Florian Sollinger Bachelor student, Bioinformatics (UdS & supervised by Dr. Rebekka Burkholz @ CISPA)GNNs for toxicity prediction flso00002@stud.uni-saarland.de Zenab Khan Master student, Bioinformatics (UdS & AI Safety Saarland Research Incubator)Interpretable ML for Toxicity Prediction Using Random Forest Graphs zekh00001@stud.uni-saarland.de Linkedin Mine Caner Master student, Bioinformatics (UdS & AI Safety Saarland Research Incubator)Interpretable Machine Learning for Toxicity Prediction mica00002@stud.uni-saarland.de Linkedin GitHub 2025 Armin Ariamajd (Master student, Chemistry (FU Berlin)) Modeling of target-focused dynamic pharmacophores, using molecular dynamics simulations. Heshine Gnanasekar (Master student, Bioinformatics (UdS)) Constant pH Molecular Dynamics Simulations of Abl Kinase and its inhibitors Julien Berthet (Master student, Chemoinformatics (UniStra)) Optimizing consensus structure-based virtual screening through protein structure similarity analysis Erika Primavera (Visiting PhD candidate (UniPg)) Molecular Dynamics and Virtual Screening for novel AKT1 inhibitors/non-conventional degraders. Co-financed by NRRP (EU) and Sibylla Biotech S.p.A. 2024 Alexander Gujarnov (PhD candidate (Bayer)) Biostatistics and in silico toxicology for development of virtual control groups at Bayer AG 2023 Talia B. Kimber (PhD candidate) Website Machine learning for kinase drug discovery Dominique Sydow (PhD candidate) LinkedIn Binding site comparison for off-target and polypharmacology prediction 2022 Dr. David Schaller (Postdoc) Free energy calculations and machine learning for kinase drug discovery with focus on mutations Dr. Corey Taylor (Postdoc) Machine learning and method development for kinase drug discovery Jacqueline Krohn (Master student) Data splitting schemes to evaluate the performance of ML-based molecular activity prediction Mareike Leja (Master student) Virtual Screening Pipeline for Drug-Like PPIP5K2 Inhibitors Sonja Rothkugel (Master student) Custom-KinFragLib - Exploring filter strategies to reduce the library size Julian Pipart (Bachelor student) Structural Alignment tool for Python Dr. Jaime Rodríguez-Guerra (Postdoc [NOW - Software Engineer at Quansite]) Scalable alchemical free energy calculations and machine learning for kinase drug discovery Andrea Morger (PhD candidate) In silico toxicity prediction and application to external data Lisa Chiara Gosch (Dr. med. candidate) Computational and experimental testing of novel EGFR and HDAC inhibitors (co-supervised with Prof. Höpfner) Franziska Fritz (Master student project work) PLIPify: Protein-Ligand Interaction Frequencies across Multiple Structures. Michele Wichmann (Master student) Dynamic pharmacophore modeling from apo structures Allen Dumler (Bachelor student) Standardization pipelines in computer-aided drug design Sakshi Misra (Intern) Advancing TeachOpenCADD with machine learning notebooks Paula Schmiel (Master student and short term scientist) Subpocket-based fragmentation and recombination of kinase inhibitors Robert Strothmann (Bachelor student) Automatic generation of T²F-Flex pharmacophores based on MD simulations Henry Webel (Scientist) Predicting cytotoxicity using deep neural networks Boran Adas (Master thesis and GoogleSummerOfCode) Robust machine learning pipeline for classification problems in cheminformatics Dr. Jérémie Mortier (Scientist) Truly target-focused pharmacophore modeling (T²F-Pharm) Shalini Muralikumar (Intern) In silico investigation of protein-protein interactions during sumoylation of Smyd1 Pratik Dhakal (Student assistant and Master thesis) Truly target-focused (dynamic) pharmacophore modeling (T²F-Pharm and T²F-Flex) Eva Aßmann (Bachelor thesis) Predicting kinase similarity using a novel fingerprint-based binding site comparison method Jacob Gora (Student assistant and Master thesis with Novartis) Machine learning for kinase activity prediction & Active learning for compound optimization Maximilian Driller (Master student project work) Computer-aided drug design - an interactive Python pipeline (TeachOpenCADD) Angelika Szengel (Master student project work) Structure-based computational target prediction (review) volkamer@cs.uni-saarland.de +49 681 302 50801 Prof. Dr. Andrea Volkamer Data Driven Drug Design Building E2.1, Room 401 Saarland University Saarbrücken Affiliated to Helmholtz Institute for Pharmaceutical Research Saarland (HIPS) Germany Map",
  "content_length": 9090,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:52"
}