{
  "name": "Andrew Martin 0002",
  "homepage": "http://www.cs.ox.ac.uk/people/andrew.martin",
  "status": "success",
  "content": "Andrew Martin | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleAndrew MartinAndrew Martin Professor Andrew Martin Director of Professional ProgrammesProfessor of Systems SecurityGoverning Body Fellow, Kellogg CollegeT: 01865 2-83605Themes:SecurityCompleted Projects:Trustworthy Logging for Distributed Virtual OrganisationsSecure Web Servicesmore…InterestsI have been interested in security in distributed systems for some time.  Mostly of late that's been explored through looking at applications of Trusted Computing technologies, particularly in cloud, mobile, and embedded applications - embodied now in the concept of the Internet of Things.  With my students, I have been looking for the architectural elements and design patterns necessary to make trusted clouds and secure IoT a reality. These ideas have the potential to transform how we think about distributed systems and the security of information.  I also have diversified interests around the security of systems and devices in distributed systems, cloud and IoT. DPhil Applications If you contact me about a DPhil place, please have something to say about what kind of research you would like to do - and why.  Show me that you have a fair idea what doing research in these areas would entail.  I'm looking for a couple of pages of technical dicussion - not a narrative form of your CV.  Make sure you show you have read and understood a few relevant published research papers.  If you use 'AI' tools to write this, please make sure that the result really reflects what you want to say, and make sure that I will not be able to detect that you have used such a tool.  BiographyI am on my third 'life' in Oxford: I studied for my first degree here, before working as an industrial Software Engineer at Praxis in Bath. After a DPhil back in Oxford, I escaped to the other side of the world to be a Research Fellow at the Software Verification Research Centre in the University of Queensland. Eventually the excellent weather and relaxed way of life got the better of me, and so I returned to the UK, briefly as a lecturer in the University of Southampton, before entering my current post in 1999. New Book Securing the Digital Frontier, OUP, 2025. This book describes the combination of complex systems which make up cyberspace, and explains how that complexity gives rise to security challenges. Daily headlines show us more and more things going wrong with cyber security. Just as cyberspace embraces hardware, software, people, and things, so also its security goes far beyond the narrow confines of computer security and cryptography. The challenge of privacy illustrates this well. Improving security often helps to protect privacy. but deploying simple and effective security controls sometimes introduces transparency which breaks that privacy. In order to explain how cyber security works, the book details some of the key features of software security failures, improvements to hardware security, and network capabilities which help to build a robust cyberspace. These are allied with an account of human failures, adversary behaviours, and some of the legal and ethical frameworks in which these things operate. The topics of identity, pervasive vulnerability, and irreducible complexity place these concerns in and endless tension. The book ends with a consideration of the internet of things, which is quietly transforming our world. Security failures in that domain have the scope to be catastrophic, and it is too soon to say whether society is capable of avoiding the worst outcomes. See alsoPublication list on Google ScholarSelected PublicationsView AllManage publications Securing the Digital Frontier: Cyber Security for Responsible Citizens and Strategic Thinkers Andrew Martin Pages 288. Oxford University Press. 2025. Details about Securing the Digital Frontier: Cyber Security for Responsible Citizens and Strategic Thinkers | BibTeX data for Securing the Digital Frontier: Cyber Security for Responsible Citizens and Strategic Thinkers | DOI (https://doi.org/10.1093/9780198920168.001.0001) ActivitiesSoftware EngineeringSoftware and Systems SecurityCyber Security OxfordTrusted ComputingSystems SecurityProjectsCRANECompleted ProjectsTrustworthy Logging for Distributed Virtual OrganisationsSecure Web ServicesArchitectures for Trusted Utility Computingwebinos ProjectTCLOUDSTrust DomainsmyTrustedCloudSecure Networking by DesignSNbD Current Students Matthew CombAlastair McCulloughKeyu Zhang Past Students Olusola AkinrolabuEman AlashwaliRanjbar BalisaneAlex DarerMartin Dehnel-WildTulio de SouzaJustin King-LacroixDr. Kubilay Ahmet Küçük (www.kuc.uk) (Consultant/Contractor at kucuk@acm.org) Joe LoughryCornelius NamilukoYudhistira NugrahaAndikan OtungAndrew PaverdAnbang RuanAnjuli R. K. Shere (Research Fellow, Shorenstein Center on Media, Politics and Public Policy at Harvard's Kennedy School) Thomas SpoorOlivia SturrockWattana ViriyasitavatTina Wu Past Researchers Nalin AsankaDr. Kubilay Ahmet Küçük (www.kuc.uk) (Consultant/Contractor at kucuk@acm.org) John LyleAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 5354,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:37"
}