{
  "name": "Andrew J. Davison",
  "homepage": "https://www.doc.ic.ac.uk/~ajd",
  "status": "success",
  "content": "Andrew Davison: Research Research Publications Background Teaching Software Contact Andrew Davison: Research I hold the position of Professor of Robot Vision at the Department of Computing, Imperial College London, and lead the Dyson Robotics Laboratory at Imperial College where we are working on vision and AI technology for next generation home robotics. I also lead the Robot Vision Research Group though most of my activity is now within the Dyson Lab. I am working in computer vision and robotics: specifically my main research has concerned SLAM (Simultaneous Localisation and Mapping) using vision, with a particular emphasis on methods that work in real-time with commodity cameras. I pioneered SLAM with vision from the mid 1990s onwards, and brought the SLAM acronym and methods from robotics to single camera computer vision with the breakthrough MonoSLAM algorithm in 2003 which enabled long-term, drift-free, real-time SLAM from a single camera for the first time, inspiring many researchers and industry developments in robotics and inside-out tracking for VR and AR. Currently my main research interests are in improving the performance in terms of dynamics, scale, detail level, efficiency and semantic understanding of real-time 3D vision. I believe that SLAM is evolving into something even more important that I am calling \"Spatial AI\". Please read my 2018 discussion paper FutureMapping: The Computational Structure of Spatial AI Systems and the 2019 follow-up FutureMapping 2: Gaussian Belief Propagation for Spatial AI for an up-to-date insight into my current thinking. Imperial College Robotics; Imperial College Computer Vision: please contact me if you have an outstanding background and motivation to undertake PhD studies or post-doctoral research as I am always looking for excellent new team members. I apologise that I am not always able to reply to all messages but you can be sure that your message will catch my eye if you have top level mathematics and programming skills and experience which is relevant to our research. Official PhD applications must be made through our department's system. Unfortunately we do not normally have positions for interns or short-term visitors. Research and News Please see the Dyson Robotics Lab Webpage for news, videos and publications about my group's work. And follow me on Twitter at @AjdDavison for up-to-date research news, thoughts and discussions about vision, robotics, SLAM, Spatial AI and the wider world of technology! I am co-founder of SLAMcore, the London-based start-up company and Imperial College spin-out specialised in applied Spatial AI solutions. Please visit our website for business enquiries or job opportunities in our elite SLAM team. Completed PhD Students The thing I'm proudest of in my career is the work I've done with the PhD students who've come through my lab, and I want to make sure it's easy to find their PhD theses which otherwise sometimes get lost to history! I would always recommend reading a PhD thesis as a great way to get a full insight into a specialised research area, with the details in papers rewritten hopefully with the benefit of extra insight and context! So here are the final theses of all of the students who completed their PhDs under my primary supervision at Imperial College (the dates are the official completion years assigned by college though sometimes the actual work was finished a little earlier!) See this growing Twitter thread with many videos and papers from all of these projects. 2010 Dr. Margarita Chli, now at the University of Cyprus. Applying Information Theory to Efficient SLAM 2012 Dr. Steven Lovegrove, now at Meta Reality Labs, USA. Parametric Dense Visual SLAM 2012 Dr. Gerardo Carrera, now at Grupo Financiero Banorte, Mexico. Robot SLAM and Navigation with Multi-Camera Computer Vision 2012 Dr. Hauke Strasdat, now at Meta Reality Labs, USA. Local Accuracy and Global Consistency for Efficient Visual SLAM 2013 Dr. Ankur Handa, now at NVidia Research, USA. Analysing High Frame-Rate Camera Tracking 2014 Dr. Richard Newcombe, now at Meta Reality Labs, USA. Dense Visual SLAM 2014 Dr. Renato Salas-Moreno, now at Forma Vision, USA. Dense Semantic SLAM 2017 Dr. Jan Jachnik, now at Dyson, UK. Towards Real-Time Lighting-Aware Scene Capture from a Moving Camera 2017 Dr. Robert Lukierski, now at SLAMcore, UK. Rapid Room Understanding from Wide-Angle Vision 2018 Dr. Jacek Zienkiewicz, now at SLAMcore, UK. Dense Monocular Perception for Mobile Robotics 2018 Dr. Hanme Kim, now at Apple, USA. Real-Time Visual SLAM with an Event Camera 2019 Dr. John McCormac, now founding a start-up in Northern Ireland, UK. SLAM and Deep Learning for 3D Indoor Scene Understanding 2019 Dr. Patrick Bardow, now at Google, Switzerland. Estimating General Motion and Intensity from Event Cameras 2020 Dr. Jan Czarnowski, now at Boston Dynamics, USA. Learned Representations for Real-Time Monocular SLAM 2021 Dr. Stephen James, now at Dyson Robot Learning Lab, UK. Tightly-coupled Manipulation Pipelines: Combining Traditional Pipelines and End-to-End Learning 2021 Dr. Shuaifeng Zhi, now at the National University of Defense Technology (NUDT), China. Semantic Neural Representation for SLAM and Scene Understanding 2022 Dr. Kentaro Wada, now at Mujin, Japan. Robotic Manipulation in Clutter with Object-Level Semantic Mapping 2022 Dr. Zoe Landgraf, now at Meta, London. Scene Understanding for 3D Multi-Object Scenes: Labelling, Reasoning and Decomposing Several of these theses were thanks to close co-supervision with Stefan Leutenegger. Andrew Davison",
  "content_length": 5594,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:33"
}