{
  "name": "Andreas Schrader",
  "homepage": "https://www.itm.uni-luebeck.de/mitarbeitende/andreas-schrader.html",
  "status": "success",
  "content": "Andreas Schrader: ITM | Institut für Telematik Zur Navigation springenZum Content springenMoodle | Univis | Imprint | Datenschutzerkärung | English HomeÜber unsVision / MissionMitarbeitendeEhemaligeKontaktForschungGruppenProjektePublikationenStudiumStudieren am ITMLehrveranstaltungenAbschlussarbeitenKarriere ITM | Institut für Telematik Universität zu Lübeck - Institut für Telematik - Über uns - Mitarbeitende - Andreas Schrader Prof. Dr.-Ing. Andreas Schrader Professor for Ambient Computing University of Lübeck Institute of Telematics Ratzeburger Allee 160 23562 Lübeck Gebäude 64, 3rd Floor, Raum 42 Email: andreas.schrader(at)uni-luebeck.de Phone: +49 451 3101 6420 Head of the Ambient Computing Working group CV Born August 28th, 1964 in Hamburg, Germany 1984 : Abitur (high-school diploma) at the Otto-Hahn-Gymnasium in Geesthacht 1991 : Diplom (equiv. to M.Sc.) in Electronical Engineering 1991 at the University of Siegen 1992 - 1998 : Scientific Employee at the Institute of Programming Languages, University of Siegen 1998 : PhD in Computer Science with Prof. Dr. Wolfgang Merzenich, University of Siegen 1989 - 1999 : Research Staff Member at NEC Europe Ltd., Heidelberg 1999 - 2003 : Senior Research Staff Member and head of Internet Service Gruppe at NEC Europe Ltd., Heidelberg 2003 - 2009 : Professor for Media Technology and Communication Networks, ISNM - International School of New Media, Affiliated Institute of the University of Luebeck June 2007 - Dec. 2011 : Academic Director of the ISNM - International School of New Media Dec. 2010 - Dec 2011 : Manager of the ISNM - International School of New Media July 2017 - Feb. 2024 : Board Speaker of COPICOH - Center for Open Innovation in Connected Health  Since January 2010 : Head of the working group Ambient Computing at the Institute of Telematics at the University of Luebeck Since October 2010 : Professor for Ambient Computing Field of Work Ambient Computing realizes interactive and context-sensitive multimedia applications in ubiquitous and pervasive computing systems. Our many projects focus on different application domains in healthcare and edutainment, e.g. ambient hospital, ambient care, ambient skills labs, ambient gaming, etc. The group develops frameworks for context-aware smart environments supporting dynamic (semi-)automatic composition of interactive hardware and software ensembles. Topic Type Status 2025 Börge Kordts, Lea C. Brandl, and Andreas Schrader, Orchestrating and Choreographing Distributed Self-Explaining Ambient Applications, Network , vol. 5, pp. 40, Sep. 2025. MDPI. DOI:10.3390/network5030040 Datei: Dateilink Bibtex: @Article{network5030040, AUTHOR = {Kordts, Börge and Brandl, Lea C. and Schrader, Andreas}, TITLE = {Orchestrating and Choreographing Distributed Self-Explaining Ambient Applications}, JOURNAL = {Network}, VOLUME = {5}, YEAR = {2025}, NUMBER = {3}, ARTICLE-NUMBER = {40}, URL = {https://www.mdpi.com/2673-8732/5/3/40}, ISSN = {2673-8732}, ABSTRACT = {The Internet of Things allows us to implement concepts such as Education 4.0 by connecting sensors, actuators, and applications. In the case of direct and explicit connections, we refer to ensembles that can consist of devices and applications. When realizing spatially distributed applications, there are scenarios in which these ensembles must coordinate with each other. In software development, this process is referred to as orchestration or choreography. This paper describes a software framework that provides orchestration or choreography for self-explaining ensembles using predefined rules based on a self-description of all involved components. The framework is capable of generating user instructions or explanations for smart environments that cover interaction details. The approach also forms a basis to provide information about event-based coordination. In a case study, we investigated the technical perception of a coordinated spatial learning game application (an ambient serious game). Most participants perceived the application as cohesive and found it responsive. These results suggest that our framework provides a solid foundation for implementing coordinated applications within smart environments that appear as unified applications.}, DOI = {10.3390/network5030040} } Lea C. Brandl, and Andreas Schrader, Realizing Ambient Serious Games in Higher Education—Concept and Heuristic Evaluation, Trends in Higher Education , vol. 4, Sep. 2025. MDPI, DOI:10.3390/higheredu4030052 Weblink: https://www.mdpi.com/2813-4346/4/3/52 Datei: 395560020_Realizing_Ambient_Serious_Games_in_Higher_Education-Concept_and_Heuristic_Evaluation Bibtex: @article{brandl2025b, title = {Realizing {{Ambient Serious Games}} in {{Higher Education}}---{{Concept}} and {{Heuristic Evaluation}}}, author = {Brandl, Lea C. and Schrader, Andreas}, year = {2025}, month = sep, journal = {Trends in Higher Education}, volume = {4}, number = {3}, pages = {52}, publisher = {Multidisciplinary Digital Publishing Institute}, issn = {2813-4346}, copyright = {http://creativecommons.org/licenses/by/3.0/}, langid = {english}, keywords = {ambient computing,ambient serious games,higher education}, } Barbara von Glasenapp, Elena Boshuizen, Lea Brandl, Susan Brauer, Tino Hentschel, and Andreas Schrader, Arctic Jump: Exergaming mit sensorischem Feedback zur fortlaufenden Rehabilitationsevaluation nach Kreuzbandriss, 70. Jahrestagung der Deutschen Gesellschaft für Medizinische Informatik, Biometrie und Epidemiologie e. V. (GMDS), Jena, 09.09.25 - 11.09.25, German Medical Science GMS Publishing House, Sep.2025. Ruby Emmert, Ensa-Leoni Möller, Lena Pfannschmidt, Lea C. Brandl, Susan Brauer, Tino Hentschel, and Andreas Schrader, Intelligente Raumverwaltung zur Verbesserung der medizinisch-orientierten beruflichen Rehabilitation, 70. Jahrestagung der Deutschen Gesellschaft für Medizinische Informatik, Biometrie und Epidemiologie e. V. (GMDS), Jena, 09.09. - 11.09.205, German Medical Science GMS Publishing House, Sep.2025. Börge Kordts, Lea C. Brandl, and Andreas Schrader, Managing Self-Explaining Ambient Applications, Frontiers in the Internet of Things , vol. 4, Aug. 2025. DOI:10.3389/friot.2025.1623733 Datei: Dateilink Lea C. Brandl, and Andreas Schrader, Towards Ambient Serious Games in Higher Education – Vision, Requirements and Technical Solutions, in Proceedings of the 27th Human Computer Interaction International , Human Computer Interaction International, Göteborg, 22.06.25 - 27.06.2025, Springer Nature Switzerland, Jun.2025. Louisa Spahl, and Andreas Schrader, Virtual Dynamic Keyboard for Communication in Intensive Care, in Proceedings of the 18th International Joint Conference on Biomedical Engineering Systems and Technologies - Volume 2: HEALTHINF , SciTePress, 2025. pp. 41-52. DOI:10.5220/0013099500003911 ISBN:978-989-758-731-3 Bibtex: @conference{healthinf25, author={Louisa Spahl and Andreas Schrader}, title={Virtual Dynamic Keyboard for Communication in Intensive Care}, booktitle={Proceedings of the 18th International Joint Conference on Biomedical Engineering Systems and Technologies - Volume 2: HEALTHINF}, year={2025}, pages={41-52}, publisher={SciTePress}, organization={INSTICC}, doi={10.5220/0013099500003911}, isbn={978-989-758-731-3}, }2024 Susan Brauer, Lea C. Brandl, Merle Marie Borrello, Maria Lindner, Christoph Klann, Katrin Balzer, and Andreas Schrader, Analyse und Evaluation von digitalen Notiz-Applikationen zur Erstellung und Bearbeitung individueller Handlungsleitfäden während einer Skills-Lab Übung, 69. Jahrestagung der Deutschen Gesellschaft für Medizinische Informatik, Biometrie und Epidemiologie e. V. (GMDS), Dresden, 08.09. - 13.09.2024, German Medical Science GMS Publishing House, Sep.2024. DOI:10.3205/24gmds216 Datei: Dateilink Bibtex: @inproceedings{brauerbrandl2024, title = {Analyse und {Evaluation} von digitalen {Notiz}-{Applikationen} zur {Erstellung} und {Bearbeitung} individueller {Handlungsleitfäden} während einer {Skills} {Lab} Übung}, copyright = {Creative Commons Attribution 4.0 International}, doi = {10.3205/24GMDS216}, language = {de}, journal = {Gesundheit – gemeinsam. Kooperationstagung der Deutschen Gesellschaft für Medizinische Informatik, Biometrie und Epidemiologie (GMDS), Deutschen Gesellschaft für Sozialmedizin und Prävention (DGSMP), Deutschen Gesellschaft für Epidemiologie (DGEpi), Deutschen Gesellschaft für Medizinische Soziologie (DGMS) und der Deutschen Gesellschaft für Public Health (DGPH)}, author = {Brauer, Susan and Brandl, Lea C. and Borrello, Merle M. and Lindner, Maria and Klann, Christoph and Balzer, Katrin and Schrader, Andreas}, year = {2024}, publisher= {German Medical Science GMS Publishing House}, keywords = {digitale Anwendungen, Lehrforschung, Medicine and health, Skills Labs}, } Lea C. Brandl, Susan Brauer, Merle Marie Borrello, Maria Lindner, Christoph Klann, Katrin Balzer, and Andreas Schrader, Prototyp einer ambienten Zeitanzeige zur Unterstützung des Zeitmanagements Studierender der Pflege und Hebammenwissenschaften während einer Skills Lab Übung, 69. Jahrestagung der Deutschen Gesellschaft für Medizinische Informatik, Biometrie und Epidemiologie e. V. (GMDS), Dresden, 8.09.-13.09.2024, German Medical Science GMS Publishing House, Sep.2024. DOI:10.3205/24gmds215 Datei: Dateilink Bibtex: @inproceedings{brandlbrauer2024, title = {Prototyp einer ambienten {Zeitanzeige} zur {Unterstützung} des {Zeitmanagements} {Studierender} der {Pflege} und {Hebammenwissenschaften} während einer {Skills} {Lab} Übung}, copyright = {Creative Commons Attribution 4.0 International}, doi = {10.3205/24GMDS215}, language = {de}, journal = {Gesundheit – gemeinsam. Kooperationstagung der Deutschen Gesellschaft für Medizinische Informatik, Biometrie und Epidemiologie (GMDS), Deutschen Gesellschaft für Sozialmedizin und Prävention (DGSMP), Deutschen Gesellschaft für Epidemiologie (DGEpi), Deutschen Gesellschaft für Medizinische Soziologie (DGMS) und der Deutschen Gesellschaft für Public Hea",
  "content_length": 65884,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:17"
}