{
  "name": "Andrew Marx",
  "homepage": "https://www.cgu.edu/news/2015/09/andrew-marx",
  "status": "success",
  "content": "NEW FACULTY: Andrew Marx - the Flame September 21, 2015 Meet the Faculty: Andrew Marx Andrew J. Marx, a new member of the Center for Information Systems and Technology faculty, seeks to discover better ways to employ spatial data, specifically from satellites, to reduce human suffering in conflict areas. “The international community is increasingly turning to satellite imagery to get information in war-torn regions,” he says. “I’m working to develop the science behind this, to help aid organizations to better assist affected people and to help provide evidence to international courts prosecuting war criminals.” (Photo by William Vasta) CGU is always pleased to welcome new faculty members. Here is Andrew Marx, assistant professor at the Center for Information Systems & Technology (CISAT). He received his PhD from the University of Maryland. WHY DID YOU CHOOSE TO COME TO CGU? My passion and focus are on the development of geospatial sciences in emerging research areas such as humanitarian/human rights. With this in mind, I was drawn to CGU’s commitment to supporting GIS and Big Data in a transdisciplinary environment. I feel CGU has positioned itself to emerge as a leading research center in geospatial sciences and applications, and I look forward to working with the students to be a part of that. WHAT ARE YOUR RESEARCH INTERESTS? The goal of my research is to better employ spatial data, specifically from satellites, to reduce human suffering in conflict areas. The international community is increasingly turning to satellite imagery to get information in war-torn regions. I’m working to develop the science behind this, to help aid organizations to better assist affected people and to help provide evidence to international courts prosecuting war criminals. WHAT IS THE BEST BOOK YOU COULD GIVE SOMEONE TO GET THEM INTERESTED IN YOUR FIELD? I recommend Physical Principles of Remote Sensing by W.G. Rees. Data from satellite imagery is just like data from medical x-rays or the Hubble telescope, and this book helps readers understand the underlying principles. WHAT TEACHER/MENTOR MADE THE MOST IMPACT ON YOU AND WHY? Elizabeth White, the research director at the U.S. Holocaust Memorial Museum’s Simon-Skjodt Center for the Prevention of Genocide, works at the nexus of academic research, DC policymakers, and human rights advocacy groups. Her support and shared vision of genocide prevention has helped push me to develop research that is actionable in the field. WHAT IS YOUR MOST COMMON FORM OF PROCRASTINATION WHEN TRYING TO GET WORK DONE? I usually go for a walk to think and get a little sun—Claremont is good for that! IF YOU COULD CHOOSE ANY CAREER OUTSIDE ACADEME, WHAT WOULD IT BE? I’d like to be an astronomer studying the universe—now that’s “Big Data!” WHAT ADVICE WOULD YOU GIVE GRAD STUDENTS THAT YOU YOURSELF DIDN’T LEARN UNTIL AFTER YOU RECEIVED YOUR PhD? I’ve learned that the most important key to success in graduate school is knowing yourself, especially your strengths and weaknesses. Do your work during the time when you know you do it best and learn what classes will help you boost up your weaknesses (and take them!). Schools Center for Information Systems & Technology Categories Faculty The Flame Share Facebook Twitter LinkedIn Google Plus",
  "content_length": 3297,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:44"
}