{
  "name": "Andrea Coladangelo",
  "homepage": "https://www.andreacoladangelo.com",
  "status": "success",
  "content": "Andrea Coladangelo's HomepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationAndrea ColadangeloI am an assistant professor at the University of Washington, Seattle since January 2023, where I co-lead the Quantum group at the Allen School of Computer Science & Engineering. I am also part of the Theory and Crypto groups. I coordinate the NSF-funded Quantum@UW REU program. I am broadly interested in quantum computation. Recently, I have been most excited about understanding the interplay between quantum computation and cryptography. Previously, I have studied foundational questions about entanglement and quantum correlations, inspired by the question of certifying quantum devices. Short Bio: Before UW, I was a postdoctoral researcher at UC Berkeley and the Simons Institute, working with Umesh Vazirani. I obtained my PhD at Caltech, where I was fortunate to be advised by Thomas Vidick. In a previous life, I received a B.A. in Mathematics from the University of Oxford and a Master in Mathematics from the University of Cambridge. I co-founded qBraid, a cloud-based platform for learning quantum computing and developing quantum algorithms.Assistant ProfessorComputer ScienceUniversity of WashingtonGates Center 212coladan (at) cs washington eduNews:Congratulations to Er-Cheng on the Machtey Award for best student paper at FOCS 2025, for this work with Miryam Huang!Welcome to new postdoc Joe Slote, and PhD students Nikos, Yiming, and Daniel!I'm thankful to Google for a 2025 Research Scholar award in quantum computing.Applications are open for the first cohort of our NSF-funded Quantum@UW REU summer program!  Consider applying if you are an undergrad interested in experiencing research in quantum information (projects ranging from theory to experiments). Deadline is March 13.I'm spending Fall quarter 2024 in Oxford, at the department of Computer Science.I'm giving a lecture series at the 22nd Bellairs Crypto Workshop in Barbados (Mar 3-7 2024) titled \"Random and pseudorandom quantum states: how to use them\".Er-Cheng Tang is the first PhD student to join my group. Welcome!I received the CSE undergraduate teaching award for my Spring 2023 course!Selected and Recent Publications (view all)The power of a single Haar random state: constructing and separating quantum pseudorandomness [arXiv]B. Chen, A. Coladangelo, O. Sattath.Eurocrypt 2025, QIP 2025, QCrypt 2024 (merged with arXiv:2407.07908).A computational test of quantum contextuality, and even simpler proofs of quantumness [arXiv]A. S. Arora, K. Bharti, A. Cojocaru, A. Coladangelo.FOCS 2024, QIP 2025.How to Use Quantum Indistinguishability Obfuscation [arxiv]A.Coladangelo, S. Gunn.STOC 2024.Deniable Encryption in a Quantum World [arXiv]A. Coladangelo, S. Goldwasser, U. Vazirani.STOC 2022.One-way Functions Imply Secure Computation in a Quantum World [arXiv]J. Bartusek, A. Coladangelo, D. Khurana, F. Ma.CRYPTO 2021, QIP 2022 (Long plenary talk), QCrypt 2021 (invited talk merged with arXiv:2011.14980).Unconditional separation of finite and infinite-dimensional quantum correlations [arXiv]A. Coladangelo, J. Stark.Nature Communications, QIP 2019 (Long plenary talk and best student paper award)ServiceEditor: Quantum (2020-2024)Program Committees: QIP 2020, QCrypt 2021, QIP 2022, Quantum Crypto Workshop @ Asiacrypt 2023, QIP 2023, ITCS 2024, QCrypt 2024, TQC 2025, Eurocrypt 2026Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 3463,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:41"
}