{
  "name": "Andreas Bulling",
  "homepage": "https://www.vis.uni-stuttgart.de/institut/team/Bulling",
  "status": "success",
  "content": "Herr Prof. Dr. Andreas Bulling | Institut für Visualisierung und Interaktive Systeme | Universität Stuttgart zum Inhalt springen zum Footer springen zurück Navigation schließen Für die volle Funktionalität dieser Site ist JavaScript notwendig. Hier finden Sie eine Anleitung zum Aktivieren von JavaScript in Ihrem Browser. Andreas Bulling Herr Prof. Dr. Professor für Mensch-Computer-Interaktion und Kognitive SystemeInstitut für Visualisierung und Interaktive Systeme (VIS)Abteilung Collaborative Artificial Intelligence (CAI) Kontakt +49 711 685 60048 +49 711 685 51082 E-Mail Website Visitenkarte (VCF) Pfaffenwaldring 5a 70569 Stuttgart Deutschland Raum: 01.023 Sprechstunde Nach Vereinbarung Fachgebiet Mensch-Computer-Interaktion Computer Vision Ubiquitous Computing Wearable Computing Eyetracking Lebenslauf Prof. Bulling received his MSc. (Dipl.-Inform.) in Computer Science from the Karlsruhe Institute of Technology (KIT), Germany, focusing on embedded systems, robotics, and biomedical engineering. He holds a PhD in Information Technology and Electrical Engineering from the Swiss Federal Institute of Technology (ETH) Zurich, Switzerland. Andreas Bulling was previously a Feodor Lynen Research Fellow and a Marie Curie Research Fellow in the Computer Laboratory at the University of Cambridge, UK, a postdoctoral research associate in the School of Computing and Communications at Lancaster University, UK, as well as a Junior Research Fellow at Wolfson College, Cambridge. From 2013 – 2018 he was an Independent Research Group Leader (W2) at the Cluster of Excellence on Multimodal Computing and Interaction (MMCI) at Saarland University as well as Senior Researcher at the Max Planck Institute for Informatics, Germany. Andreas Bulling is UbiComp steering committee member and serves on the editorial boards of the Proceedings of the ACM on Interactive, Mobile, Wearable, and Ubiquitous Technologies, ACM Transactions on Interactive Intelligent Systems, and the Journal of Eye Movement Research. He also served as co-chair, TPC member and reviewer for major conferences, most recently as TPC co-chair for ACM UbiComp 2016 and IEEE PerCom 2015 as well as associate chair for ACM ETRA 2016 and 2018, as well as ACM CHI 2013, 2014, 2018, and 2019. He received an ERC Starting Grant in 2018. Publikationen A full list of publications can be found on Google Scholar or DBLP. Grants, Auszeichnungen und Fellowships ERC Starting Grant (2018) Distinguished paper award, Proceedings of the ACM on Interactive, Mobile, Wearable, and Ubiquitous Technologies (PACM IMWUT 2018) Best paper award, ACM International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI 2018) Best paper honourable mention award, ACM International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI 2018) Best paper award, ACM Symposium on Eye Tracking Research and Applications (ETRA 2018) Best presentation award, ACM Symposium on Eye Tracking Research and Applications (ETRA 2018) Best paper honourable mention award, Eurographics (EG 2018) Best paper honourable mention award, ACM SIGCHI Conference on Human Factors in Computing Systems (CHI 2018) Best paper honourable mention award, ACM Symposium on User Interface Software and Technology (UIST 2017) Spotlight presentation, IEEE Conference on Computer Vision and Pattern Recognition (CVPR 2017) Best paper honourable mention award, International Conference on Mobile and Ubiquitous Multimedia (MUM 2017) Best paper honourable mention award, ACM Symposium on User Interface Software and Technology (UIST 2016) Emerging investigator award, ACM Symposium on Eye Tracking Research and Applications (ETRA 2016) Best paper honourable mention award, ACM SIGCHI Conference on Human Factors in Computing Systems (CHI 2016) Intel Visual Computing Institute (IVCI) Research Grant (2016-2017) Best paper award, ACM Symposium on User Interface Software and Technology (UIST 2015) JST CREST International Research Grant (2014-2019) Google Glass Research Award (2013) Marie Curie Intra-European Research Fellowship (2012-2014) Google Faculty Research Award (2011) Junior Research Fellowship, Wolfson College, Cambridge (2011-2014) Feodor Lynen Research Fellowship (2010-2012) DFG Research Fellowship (2010-2012) SNSF Fellowship for Prospective Researchers (2010-2011 Wissenschaftliche Beteiligung Proceedings of the ACM on Interactive, Mobile, Wearable, and Ubiquitous Technologies (PACM IMWUT), associate editor ACM Transactions on Interactive Intelligent Systems (TiiS), associate editor Journal of Eye Movement Research (JEMR), associate editor ACM UbiComp steering committee member ACM ETRA general chair (2020) ACM CHI associate chair (2019) ACM ETRA associate chair (2018) ACM CHI associate chair (2018) ACM ETRA workshop “Pervasive Eye Tracking and Mobile Eye-based Interaction” (2018) ACM UbiComp technical program co-chair (2016) ACM ETRA associate chair (2016) Elsevier Pervasive and Mobile Computing, guest editor (2016) Dagstuhl Seminar “Eyewear Computing – Augmenting the Human with Head-mounted Wearable Assistants”, organiser (2016) IEEE PerCom technical program co-chair (2015) Mensch und Computer associate chair (2015) ACM Transactions on Interactive Intelligent Systems, guest editor (2015) ACM UbiComp workshop “Pervasive Eye Tracking and Mobile Eye-based Interaction” (2015) ACM CHI associate chair (2014) Journal of Eye Movement Research, guest editor (2014) ACM UbiComp workshop “Pervasive Eye Tracking and Mobile Eye-based Interaction” (2014) IEEE BSN workshop “Glass & Eyewear Computers” (2014) Augmented Numan technical program co-chair (2013) ACM CHI associate chair (2013) ECEM workshop “Pervasive Eye Tracking and Mobile Eye-based Interaction” (2013) ACM CHI workshop “Gaze Interaction in the Post-WIMP World” (2013) ACM UbiComp workshop co-chair (2012) Pervasive demonstrations co-chair (2012) ACM CHI special interest group “Gaze Interaction in the Post-WIMP World” (2012) ACM UbiComp workshop “Pervasive Eye Tracking and Mobile Eye-based Interaction” (2012) ACM UbiComp workshop “Pervasive Eye Tracking and Mobile Eye-based Interaction” (2011) Pervasive workshop “Frontiers in Activity Recognition Using Pervasive Sensing” (2011 Daniela Milanese Administrative Assistenz Profil-Seite +49 711 685 60049 E-Mail schreiben Zum Seitenanfang",
  "content_length": 6357,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:56"
}