{
  "name": "Andrés Faiña",
  "homepage": "https://pure.itu.dk/portal/en/persons/andres-faina(7dd48cfe-3069-4563-bef4-ef661c18387a).html",
  "status": "success",
  "content": "Andres Faina - IT-University of Copenhagen Andres Faina Associate Professor, Data, Systems, and RoboticsRobotics, Evolution, and Art LabThe Maritime HubAcademic Responsible, REAL Lab https://orcid.org/0000-0001-7288-6988 Emailanfvitudk 20142025 Research activity per year Personal profile KeywordsRoboticsEvolutionary roboticsElectronic and mechanical designHardware and prototypes Fingerprint Dive into the research topics where Andres Faina is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Robot Computer Science 100% Morphological Development Keyphrases 40% Modular Robots Keyphrases 40% EvoBot Keyphrases 18% Open Source Computer Science 17% Controller Keyphrases 16% Reconfiguration Keyphrases 14% Bipedal Walking Keyphrases 13% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2014 2015 2016 2017 2020 2021 2022 2025 25 Article in proceedings 10 Journal article 9 Conference abstract for conference 2 Conference article 3 More 1 Book chapter 1 Paper 1 Patent Research output per year Research output per year Neural Cellular Automata for Decentralized Sensing Using a Soft Inductive Sensor Array for Distributed Manipulator SystemsDacre, B., Bessone, N. H., Preti , M. L., Cafiso, D., Garcia, R. M. & Faina, A., 18 Apr 2025, In: International Conference on Control, Automation and Robotics. p. 314-321 8 p., 10.1109/ICCAR64901.2025.11073064.Research output: Journal Article or Conference Article in Journal › Conference article › Research › peer-review Open Access Sensor Array 100% Inductive Sensor 100% Manipulator System 100% Sensor Noise 20% Single Camera 20% Engineering Morphological Development in a Robotic Bipedal Walking Problem: An Empirical StudyNaya, M., Faina, A. & Duro, R. J., 2023, In: Neurocomputing. p. 83-99Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open AccessFile Robotics 100% Morphological Development 100% Bipedal Walking 100% Robot 100% Learning Algorithm 100% Guiding the Exploration of the Solution Space in Walking Robots Through Growth-Based Morphological DevelopmentNaya, M., Faina, A. & Duro, R., 2023, GECCO '23: Proceedings of the Genetic and Evolutionary Computation Conference. Association for Computing Machinery, p. 1230–1238 Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Solution Space 100% Morphological Development 100% Walking Robot 100% walking robot 100% Solution and Solubility 100% A Study of Growth Based Morphological Development in Neural Network Controlled WalkersNaya, M., Faina, A., Mallo, A. & Duro, R., 2022, In: Neurocomputing. 500, p. 279-294Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open AccessFile Neural Network 100% Morphological Development 100% Walker 100% Development Process 100% Strategy Development 50% Growth-based morphological development: a natural approach to fitness landscape shapingNaya, M., Faina, A. & Duro, R., 2022, Proceedings of the Genetic and Evolutionary Computation Conference Companion. Association for Computing Machinery, p. 140–143 Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Fitness Landscape 100% Morphological Development 100% Landscape Shaping 100% Natural Approach 100% Cognitive Development 100% View all 49 research outputs Projects Projects per year 2014 2014 2020 2022 2024 2028 2 Finished 3 Active Projects per year MUHMI-MOZART: Multimodal Human-Machine Interfaces for Morphing Computerized Mats with Embodied Sensing and Artificial IntelligenceStøy, K. (PI), Faina, A. (CoI), Garcia, R. M. (Collaborator), Zahadat, P. (CoI), Bessone, N. H. (Collaborator), Dacre, B. (Collaborator) & Ingle, P. S. (Collaborator)European Commission01/03/2024 → 30/09/2026Project: Research Human-robot Interaction 100% Human Robot Interaction 100% Wolfgang Amadeus Mozart 50% Distributed Manipulation 50% Multimodal Interfaces 50% BIG-MAP: Battery Interface Genome - Material Acceleration PlatformStøy, K. (PI), Faina, A. (CoI), Jensen, J. H. (CoI) & Garcia, R. M. (CoI)European Commission01/09/2020 → 29/02/2024Project: Research Battery Chemistry 100% Battery Interface 50% Materials Acceleration Platforms 50% EVOBLISS: Technological Evolution of Synergy Between Physicochemical and Living SystemsStøy, K. (PI), Faina, A. (CoI), Nejatimoharrami, F. (CoI), Lambertsen, J. (CoI) & Schmidt, M. (CoI)European Commission01/02/2014 → 31/01/2018Project: Research Robot 100% Technological Evolution 66% Living Technology 66% Living Systems 66% Microbial Fuel Cell 66% MOZART: Morphing Computerized mats with Embodied Sensing and Artificial IntelligenceStøy, K. (PI), Zahadat, P. (CoI), Faina, A. (CoI), Garcia, R. M. (CoI), Dacre, B. (CoI), Bessone, N. H. (CoI), Ingle, P. S. (CoI) & Walker, K. E. (CoI)European Commission01/10/2022 → 30/09/2026Project: Research Chicken 100% Artificial Intelligence 100% Point Tunneling 100% Reconfigurable 100% Tunneling Protocol 100% Teaming up a quadruped robot with a drone for active inspections in large industrial settingsFaina, A. (PI) & Mora, A. L. (Collaborator)Novo Nordisk01/06/2024 → 31/05/2028Project: Research End-effector 100% Quadruped Robot 100% Manipulator 100% End Effector 100% Rough Terrain 33% Press/Media Fremtiden stadig uvis for konkursramt robotvirksomhedStøy, K. & Faina, A.05/03/20251 Media contributionPress/Media: Press / Media Robotvirksomhed går konkurs: Har tabt mere end 100 millionerStøy, K. & Faina, A.28/02/20251 Media contributionPress/Media: Press / Media Sådan hjælper universiteterne med at forløse de studerendes iværksætterdrømme: ITU og CBSStøy, K. & Faina, A.11/10/20221 Media contributionPress/Media: Press / Media Medstifter af dansk robotikon med i ny kapitalrejsningStøy, K. & Faina, A.03/05/20221 Media contributionPress/Media: Press / Media Ny CEO for Flow RoboticsStøy, K. & Faina, A.21/01/20201 Media contributionPress/Media: Press / Media View all 14 press/media Prizes Best Paper Award at RIE 2017 Faina, A. (Recipient), 28 Apr 2017Prize: Prizes, scholarships, distinctions Best Paper Award 100% Robotics in Education 50% Honorable Mention for Technical Achievement of Virtual Creatures Competition at GECCO 2017Moreno Garcia, R. (Recipient), Liu, C. (Recipient), Hernandez, H. (Recipient), Gomez, J. (Recipient) & Faina, A. (Recipient), 19 Jul 2017Prize: Prizes, scholarships, distinctions Winner of the 2017 Virtual Creatures Competition at GECCO 2017Veenstra, F. (Recipient), Faina, A. (Recipient), Støy, K. (Recipient) & Risi, S. (Recipient), 19 Jul 2017Prize: Prizes, scholarships, distinctions Winner of Virtual Creature Competition at GECCO 2017Veenstra, F. (Recipient), Faina, A. (Recipient), Støy, K. (Recipient) & Risi, S. (Recipient), 15 Jul 2017Prize: Prizes, scholarships, distinctions GECCO 100% Modular Robots 100% Activities Activities per year 2024 2024 2024 1 Membership in review committee Activities per year Assessment committee for recruitment of assistant professor in therapeutic and affective robotics (Event)Faina, A. (Chair), Dautenhahn, K. (Member) & Dosen, S. (Member)22 Mar 2024 → 1 May 2024Activity: Membership types › Membership in review committee",
  "content_length": 7726,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:22"
}