{
  "name": "Andrés Monroy-Hernández",
  "homepage": "https://www.cs.princeton.edu/people/profile/andresmh",
  "status": "success",
  "content": "Andrés Monroy-Hernández CS Skip to main content Andrés Monroy-Hernández Associate Professor Contact Building 405 Computer Science Envelope andresmh@cs.princeton.edu Phone (609) 258-5966 Diploma Ph.D., Massachusetts Institute of Technology, 2012 Research Areas Human-Computer Interaction Short Bio Andrés Monroy-Hernández co-leads the Princeton HCI Lab, where he focuses on human-computer interaction and social computing. He is also an associated faculty at Princeton's Center for Information Technology and Policy, the Keller Center for Innovation, the DeCenter, the Program in Cognitive Science, and the Program in Latin American Studies. He also serves on the board of the non-profit Crisis Text Line. Before Princeton, he spent a decade in industry research labs, first in the leadership team of Microsoft Research's FUSE Labs and then at Snap Research, where he founded and managed the HCI Research team.He has created technologies that help millions of people connect and collaborate in new ways, including MIT's Scratch, an online community for children to learn programming; Microsoft's Meeting Scheduler (Calendar.help), a scheduling agent that uses hybrid AI; Significant Otter, a smartwatch app for couples to connect using biosignals; and Snapchat's Project IRL, a suite of playful and co-located augmented reality experiences.His research has received best paper awards at CHI, CSCW, HCOMP, and ICWSM, and has been featured in The New York Times, CNN, Wired, BBC, and The Economist. Andrés was named one of the 35 Innovators under 35 by the MIT Technology Review magazine and one of the most influential Latinos in Tech by CNET. Andrés was the technical program co-chair for CSCW 2018 and Collective Intelligence 2019. He was an editor for CSCW from 2019 to 2022 and was a member of the CSCW steering committee until 2022.His recent research focuses on public-interest technology platforms and social augmented reality experiences. Some of the projects his team is working on at Princeton include The Workers' Algorithm Observatory, a suite of tools for worker-led audits in the platform economy, OpenCourier, an open-source federated protocol that enables locally owned alternatives to mainstream food delivery platforms, and Capybara, a social AR app that aims to democratize AR by empowering children to express themselves through creating virtual characters. Related News April 15, 2025 Learning to use computing skills, ethically Over the last four years, Steven Kelts has designed ethics content for about a dozen computer science courses. His work is part of a broader push within the computer science department to teach students computing ethics alongside technical computing skills. May 22, 2024 Andrés Monroy-Hernández honored for work with graduate students Andrés Monroy-Hernández has been named one of four recipients of the Graduate Mentoring Awards by the McGraw Center for Teaching and Learning and the Graduate School. May 1, 2023 Disrupting the disruptors, with or without blockchain Andrés Monroy-Hernández sees an opportunity to build something better this time.",
  "content_length": 3096,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:20"
}