{
  "name": "André Nies",
  "homepage": "https://www.cs.auckland.ac.nz/~nies",
  "status": "success",
  "content": "Andre Nies' home page Andre Nies Publications Talks Students Home Prof. André Nies School of Computer Science University of Auckland Private Bag 92019 Auckland 1142 New Zealand andre_at_cs_dot_auckland_dot_ac_dot_nz Research interests 1. I apply logical methods to algebraic structures, especially to groups. See for instance the works Finite axiomatizability for profinite groups, with Dan Segal and Katrin Tent, Proc. London Math. Soc.,, Volume 123, Issue 6, Dec 2021, Pages 597-635, and Describing finite groups by short first-order sentences. With Katrin Tent. Israel J. Mathematics 221 (2017), 85-115. The last two sections of my survey paper contain results up to 2007: Bull. Symb. Logic. 13 no 3 (2007), 305-339 2. I study the interplay of computability and randomness. For an overview of work up to 2010 see Interactions of Computability and Randomness, Proc. International Congress of Mathematicians, 2010. Later work includes \t Coherent randomness tests and computing the K-trivial sets,  with L. Bienvenu, N. Greenberg, A. Kucera, and D. Turetsky, J. European Math. Society 18 (2016), 773-812, and Martin-Loef reducibility and cost functions, with Noam Greenberg, Joseph S. Miller, and Daniel Turetsky, Israel Journal of Mathematics 260.1 (2024): 261-301. 3. I have studied quantum information theory, in particular randomness for infinite sequences of qubits. See Martin-Loef random quantum states, with Volkher Scholz. Journal of Mathematical Physics 60, 092201 (2019); Published version on journal site. There is recent work related to this by my former postdoc Tejas Bhojraj. 4. I have worked on the connection of randomness to analysis, ergodic theory, set theory (cardinal characteristics), and reverse mathematics. For analysis, see Randomness and Differentiability. With V. Brattka and J. Miller. TAMS 368 (2016):581-605. 5. I work in descriptive set theory. The last years I have focussed on non-Archimedean groups. Formerly I have studied Polish metric spaces, and their connections with continuous logic. Metric Scott analysis. With \t Ben Yaacov, Doucha and Tsankov. Advances in Mathematics 318 (2017) 46–87. 6. \t I study groups that can be described by automata. A recent paper on this is Word automatic groups of nilpotency class 2. With Frank Stephan. Information Processing Letters 183 (2024): 106426. 7. In earlier papers (mostly 1994-2003, but a few up to 2012) I have investigated degree structures using first-order definability. See e.g. my habilitation thesis Coding Methods in computability theory and complexity theory for a summary. For more detail see my publications. I am an editor for the Annals of Pure and Applied Logic. For submissions in computability and related areas, please go to the journal homepage. They should be at a level comparable to the level of the J. Symb. Logic. Career highlights 2010 ICM sectional speaker 2013 Fellow of the Royal Society of New Zealand 2020 Humboldt Research Award (German host: Prof. Katrin Tent). 2003, 2008, 2013, 2019 prinpical investigator in Marsden grants Logic Blog I have been editing the Logic Blog since 2010. Please email me if you want to participate through a shared folder in the dropbox containing the latex source. Current Logic Blog. 2023-2024 Logic Blog 2022 Logic Blog 2021 Logic Blog 2020 Logic Blog 2019 Logic Blog 2018 Logic Blog 2017 Logic Blog 2016 Logic Blog 2015 Logic Blog 2014 Logic Blog 2013 Logic Blog 2012 Logic Blog 2011 Logic Blog 2010 Logic Blog Book My book ''Computability and Randomness'' was published by Oxford University Press on Jan 29, 2009. The revised paperback version was published in March 2012. I hold a contract with OUP for a new, extended version, to be delivered end of 2029. Order at Amazon. List of errata for the book (Jan 2013). Status of open problems from the book (Oct 2017). Programmes, workshops and retreats I have (co)-organised 2018 Trimester Programme Logic and algorithms in group theory, Sept - Dec 2018 at the Hausdorff Institute for Mathematics in Bonn, Germany. With Katrin Tent and Eamonn O'Brien. Follow up workshop with same title, August 2025 2017 QIT (Quantum Information Theory) Auckland Overseas speakers: Marco Tomamichel (UTS, minicourse), Willem Fouche (Unisa), Anuradha Mahasinghe (University of Colombo). Marco's script and Marco's slides 2016 Algorithmic Randomness Interacts with Analysis and Ergodic Theory at the Casa Matematica Oaxaca. Organised with Jeremy Avigad and Joseph S. Miller. Retreat with 8 participants at Calpulalpan de Mendez during Nov 30-Dec 4. Program. Workshop on the occasion of Jouko Vaananen's visit to New Zealand , April at the Research Centre Coromandel. Organised by Sebastian Link and André Nies. Pictures. Last modified: June 2024",
  "content_length": 4724,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:15"
}