{
  "name": "Andrea Tangherloni",
  "homepage": "https://cs.unibocconi.eu/people/andrea-tangherloni",
  "status": "success",
  "content": "Andrea Tangherloni | Department of Computing Sciences Skip to main content Open shareCloseShareClose Andrea Tangherloni I am an Assistant Professor in the new Department of Computing Sciences at Bocconi University. I received my Bachelor’s, Master’s, and PhD Degrees in Computer Science from the University of Milano-Bicocca in 2013, 2015, and 2019, respectively. I spent different months abroad as a PhD visiting student at the Department of Cancer Biology (Vanderbilt University, Nashville, TN, USA) and the Computer Laboratory (University of Cambridge). From November 2018 to November 2020, I was a Research Associate at the Department of Haematology of the University of Cambridge and Wellcome Trust – Medical Research Council Cambridge Stem Cell Institute. In addition, I was a visiting worker at the Wellcome Trust Sanger Institute, Wellcome Trust Genome Campus. From December 2020 to November 2022, I was a Postdoctoral Research Fellow at the Department of Human and Social Sciences of the University of Bergamo. From December 2022 to August 2023, I was a Postdoctoral Research Fellow at the Bocconi Institute for Data Science and Analytics (BIDSA) and the Department of Computing Sciences of Bocconi UniversityAssistant Professorandrea.tangherloni@unibocconi.it Google Scholar, Website, LinkedInDownload the cv (934.18 KB)Research interestsMy research bridges the areas of Computational Biology, Bioinformatics, and Artificial Intelligence (AI) to tackle complex and computationally intensive problems in biology and medicine. The overarching goal of my research is to propose AI-based approaches and tools that can help increase our knowledge about the processes that drive both cell development and the progression of different pathologies, to move another step toward personalized and regenerative medicine.Thus, my main scientific interests include Machine Learning, Computational Intelligence, High-Performance Computing, Computational Biology, and Bioinformatics. Selected Publications Tangherloni, Andrea; Riva, Simone G.; Myers, Brynelle; Buffa, Francesca M.; Cazzaniga, Paolo MAGNETO: cell type marker panel generator from single-cell transcriptomic data JOURNAL OF BIOMEDICAL INFORMATICS, 2023 Riva, Simone G.; Myers, Brynelle; Cazzaniga, Paolo; Buffa, Francesca M.; Tangherloni, Andrea Consensus clustering strategy for cell type assignments of scRNA-seq data 2023 IEEE Conference on Computational Intelligence in Bioinformatics and Computational Biology (CIBCB), 2023 Tangherloni, Andrea; Riva, Simone G.; Myers, Brynelle; Cazzaniga, Paolo Multi-objective optimization for marker panel Identification in single-cell data 2022 IEEE Conference on Computational Intelligence in Bioinformatics and Computational Biology (CIBCB), 2022 Riva, Simone G; Myers, Brynelle; Cazzaniga, Paolo; Tangherloni, Andrea A deep learning pipeline for the automatic cell type assignment of scRNA-seq data 2022 IEEE Conference on Computational Intelligence in Bioinformatics and Computational Biology (CIBCB), 2022 Riva, Simone G.; Cazzaniga, Paolo; Tangherloni, Andrea Integration of multiple scRNA-Seq datasets on the autoencoder latent space 2021 IEEE International Conference on Bioinformatics and Biomedicine (BIBM), 2021 Tangherloni, Andrea; Ricciuti, Federico; Besozzi, Daniela; Liò, Pietro; Cvejic, Ana Analysis of single-cell RNA sequencing data based on autoencoders BMC BIOINFORMATICS, 2021 Ranzoni, Anna Maria; Tangherloni, Andrea; Berest, Ivan; Riva, Simone Giovanni; Myers, Brynelle; Strzelecka, Paulina M.; Xu, Jiarui; Panada, Elisa; Mohorianu, Irina; Zaugg, Judith B.; Cvejic, Ana Integrative single-cell RNA-seq and ATAC-seq analysis of human developmental hematopoiesis CELL STEM CELL, 2021 Tangherloni, Andrea; Nobile, Marco S.; Cazzaniga, Paolo; Capitoli, Giulia; Spolaor, Simone; Rundo, Leonardo; Mauri, Giancarlo; Besozzi, Daniela FiCoS: a fine-grained and coarse-grained GPU-powered deterministic simulator for biochemical networks PLOS COMPUTATIONAL BIOLOGY, 2021 Rundo, Leonardo; Tangherloni, Andrea; Nobile, Marco S.; Militello, Carmelo; Besozzi, Daniela; Mauri, Giancarlo; Cazzaniga, Paolo MedGA: a novel evolutionary method for image enhancement in medical imaging systems EXPERT SYSTEMS WITH APPLICATIONS, 2019 Tangherloni, Andrea; Spolaor, Simone; Rundo, Leonardo; Nobile, Marco S.; Cazzaniga, Paolo; Mauri, Giancarlo; Liò, Pietro; Merelli, Ivan; Besozzi, Daniela GenHap: a novel computational method based on genetic algorithms for haplotype assembly BMC BIOINFORMATICS, 2019Show more Tangherloni, Andrea; Spolaor, Simone; Cazzaniga, Paolo; Besozzi, Daniela; Rundo, Leonardo; Mauri, Giancarlo; Nobile, Marco S. Biochemical parameter estimation vs. benchmark functions: a comparative study of optimization performance and representation design APPLIED SOFT COMPUTING, 2019 Tangherloni, Andrea; Nobile, Marco S.; Besozzi, Daniela; Mauri, Giancarlo; Cazzaniga, Paolo LASSIE: simulating large-scale models of biochemical systems on GPUs BMC BIOINFORMATICS, 2017Teaching20876DEEP LEARNING AND REINFORCEMENT LEARNING 20884BIO-INFORMATICS 21014ARTIFICIAL INTELLIGENCE - MODULE 2 21013ARTIFICIAL INTELLIGENCE - MODULE 1 MenuResearch interestsSelected PublicationsTeaching",
  "content_length": 5191,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:51"
}