{
  "name": "Andrey Esakia",
  "homepage": "http://people.cs.vt.edu/~esakia",
  "status": "success",
  "content": "Andrey Esakia - Virginia Tech Andrey Esakia,PhD Blacksburg, VA contact Virginia Tech PhD Computer Science 2018 Virginia Tech Master of Science Computer Science 2014 AUBG/Virginia Tech Undergraduate Computer Science | Mathematics 2011 FitAware FitAware is a triple component system allowing users compete and cooperate in the context of a group dynamics-based physical activity competition. The system is novel in its use of smartwatches for glanceable feedback that includes both group and individual information. FitAware's smartphone app offers more detailed feedback. The cloud competent serves as connectivity hub and a host for a web interface. You can learn more details about FitAware in the proceedings of CHI 2017 , GROUP 2018 and in Volume 142 (October 2020) of International Journal of Human-Computer Studies. It is also mentioned in a VT News article. Previous Next Pebble smartwatch I explored smartwatches in an upper-level undergraduate mobile application development class during two academic terms. Lectures, in-class activities, homeworks, and projects were tailored toward providing rich design and implementation experiences for the students that engaged them in developing for the smartwatch and a paired mobile device. Among other results the teaching experience revealed four key challenges and opportunities associated with smartwatches.The details of this work can be read in the proceedings of SIGCSE 2015. Previous Next Android development model As mobile software development becomes more mainstream, universities recognize a need to integrate mobile platform programming into the curriculum. This integration requires an understanding of mobile software development that defines it not just as a collection of topics but that acknowledges cross-topic areas that serve as the basis for specific interests. This work presents a platform-agnostic model for teaching mobile software development that identifies established foundational topics, offering an adaptable teaching model aimed at providing enhanced understating of the topics and their integration. The details of this work can be read in the proceedings of FIE 2016. Previous Next Multi acceleration curve trackpad Large high-resolution displays (LHRD) combine high pixel density with ample physical dimensions. The combination of these factors creates a multiscale workspace where interactive targeting of on-screen objects requires both high speed for distant targets and high accuracy for small targets. As part of my Masters Thesis work I built and evaluated a system that augments standard touchpad accelerated pointer manipulation with multitouch capability, where the choice of acceleration curve dynamically changes depending on the number of fingers in contact with the touchpad. Specifically, with this system users can dynamically switch among three different acceleration curves by using one, two, or three fingers on the touchpad. The details about the system and evaluation can be found in a research article published in \"Advaces in Human-Computer Interaction\". Previous Next Courses taught Cloud Software Development Angular 9 | NodeJS | ExpressJS | MongoDB | TypeScript | ES6 JavaScript | HTML | CSS | UML Mobile Software Development Android Studio | JetPack Components | Kotlin | XML | SQL Problem Solving in Computer Science Python | Bash | SQLite | scikit-learn | NumPy | RegEx Software Design and Data Structures Java | UML Introduction to Programming in Java Java Selected Publications Esakia, A., McCrickard, S., Harden, S., Horning, M., & Ramalingam, N. (2020). Using smartwatches to facilitate a group dynamics-based statewide physical activity intervention. International Journal of Human-Computer Studies, 142, 102501. DOI: https://doi.org/10.1016/j.ijhcs.2020.102501 Chung, H., Esakia, A., & Ragan, E. (2020). The Impact of Utilizing a Large High-Resolution Display on the Analytical Process for Visual Histories. International Journal of Data Analytics (IJDA), 1(2), 67-88. DOI: 10.4018/IJDA.2020070106 Esakia, A. (2020, February). Transitioning to Teaching Android With Kotlin and Jetpack Components. In Proceedings of the 51st ACM Technical Symposium on Computer Science Education (pp. 1302-1302). DOI: https://doi.org/10.1145/3328778.3372603 Esakia, A. , & Kotut, L. (2020, October). Smartwatch-Centered Design and Development in Mobile Computing Classes. In 2020 Institute of Electrical and Electronics Engineers Frontiers in Education Conference (FIE) (pp. 1-7). IEEE. DOI: https://doi.org/10.1109/FIE44824.2020.9274280 Esakia, A., McCrickard, D. S., Harden, S., & Horning, M. (2018, May). FitAware: Mediating Group Fitness Strategies with Smartwatch Glanceable Feedback. In Proceedings of the 12th EAI International Conference on Pervasive Computing Technologies for Healthcare (pp. 98-107). DOI: https://doi.org/10.1145/3240925.3240926 Esakia, A., McCrickard. D.S.,Harden, S.M. and Horning, M 2018. FitAware: Promoting Group Fitness Awareness Through Glanceable Smartwatches. In Proceedings of the 2018 ACM Conference on Supporting Groupwork (GROUP '18). ACM, New York, NY, USA, 178-183. DOI: https://doi.org/10.1145/3148330.3148343 Esakia, A., Harden, S.M., McCrickard, D.S. and Horning, M., 2017, May. FitAware: Channeling Group Dynamics Strategies with Smartwatches in a Physical Activity Intervention. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (pp. 2551-2559). ACM. DOI: https://doi.org/10.1145/3027063.3053249 Esakia, A. and McCrickard, D.S., 2016, October. An adaptable model for teaching mobile app development. In Frontiers in Education Conference (FIE), 2016 Institute of Electrical and Electronics Engineers (pp. 1-9). IEEE DOI: https://doi.org/10.1109/FIE.2016.7757478 Esakia, A., Niu, S. and McCrickard, D.S., 2015, February. Augmenting Undergraduate Computer Science Education With Programmable Smartwatches. In Proceedings of the 46th ACM Technical Symposium on Computer Science Education (pp. 66-71). ACM.DOI: https://doi.org/10.1145/2676723.2677285 Esakia, A., Endert, A. and North, C., 2014. Large display interaction via multiple acceleration curves and multifinger pointer control. Advances in Human-Computer Interaction, 2014, p.12. DOI: https://doi.org/10.1155/2014/691507",
  "content_length": 6272,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:52"
}