{
  "name": "Andrzej Janusz",
  "homepage": "https://ml.linkedin.com/in/andrzej-janusz-bb693a33",
  "status": "success",
  "content": "Andrzej Janusz - QUT (Queensland University of Technology) | LinkedIn Skip to main content Sign in to view Andrzej’s full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. Andrzej Janusz Sign in to view Andrzej’s full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. Brisbane City, Queensland, Australia Contact Info Sign in to view Andrzej’s full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. 327 followers 315 connections See your mutual connections View mutual connections with Andrzej Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. Join to view profile Message Sign in to view Andrzej’s full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. QUT (Queensland University of Technology) Systems Research Institute, Polish Academy of Sciences Report this profile About I am an active and experienced researcher in fields related to data exploration, machine… see more Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now Experience & Education QUT (Queensland University of Technology) ******** ** *********** ******* ********** ** ****** ********* ********* *** ******** ***** **** ********* ******* ******** ********** ****** ******* ** ******** ************ ****** *********** ********** undefined ********** ** ****** ****** ** ********** ***** ******** ******* View Andrzej’s full experience See their title, tenure and more. Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. Licenses & Certifications ORCID ID ORCID See credential Languages Polish Native or bilingual proficiency English Professional working proficiency View Andrzej’s full profile See who you know in common Get introduced Contact Andrzej directly Join to view full profile Other similar profiles Barbara Rubikowska Barbara Rubikowska Warsaw Connect Mariusz Kozakiewicz Mariusz Kozakiewicz Poland Connect Paweł Teisseyre, PhD Paweł Teisseyre, PhD Warsaw Metropolitan Area Connect Marek Adamczyk Marek Adamczyk Warsaw Connect Karolina Kuligowska, Ph.D. Karolina Kuligowska, Ph.D. Warsaw Connect Szymon Bobek Szymon Bobek Cracow Metropolitan Area Connect Adam Woznica Adam Woznica Warsaw Connect Jan Kaczmarczyk Jan Kaczmarczyk Cracow Metropolitan Area Connect Dominik Sepioło Dominik Sepioło Cracow Metropolitan Area Connect Marta Kłosok Marta Kłosok Warsaw Connect Piotr Bródka Piotr Bródka Wrocław Connect Dorota Szepietowska Dorota Szepietowska Warsaw Connect Kinga Prusinkiewicz Kinga Prusinkiewicz Wroclaw Metropolitan Area Connect Agnieszka Sołtys, PhD Agnieszka Sołtys, PhD Warsaw Connect Sławomir Pioroński Sławomir Pioroński Poznań Connect Ewa Gajda-Zagórska Ewa Gajda-Zagórska Cracow Metropolitan Area Connect Robert Bembenik Robert Bembenik Warsaw Connect Jakub Smajek Jakub Smajek Wroclaw Metropolitan Area Connect Michal Wrobel Michal Wrobel Gdynia Connect Jędrzej Świeżewski, PhD Jędrzej Świeżewski, PhD Warsaw Connect Show more profiles Show fewer profiles Explore collaborative articles We’re unlocking community knowledge in a new way. Experts add insights directly into each article, started with the help of AI. Explore More Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. View Andrzej’s full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy.",
  "content_length": 5610,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:55"
}