{
  "name": "Andrew A. Chien",
  "homepage": "http://people.cs.uchicago.edu/~aachien",
  "status": "success",
  "content": "Andrew A. Chien Homepage LSSG (June 2025)~~~~~~~~~~~~~~~~~~~~~~~~~~~~~(Dec 2024) ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ ~~~~~~~~~ LSSG (Nov 2022) The Large-scale Sustainable Systems Group (LSSG) explores critical systems research questions underlying sustainable, scalable large-scale systems, including cloud, high performance, edge, and mobile/IoT computing. These systems have billions of elements, exabytes of data, and endemic impact on social, consumer, government, and scientific applications of unprecedented scale. Specific interests include renewable energy, carbon emissions, power grids, sustainability, cloud software, resource management, graph computing, hardware and system architecture, and applications. LSSG is led by Professor Andrew A. Chien and has over 100 alumni !!! Join us! If you'd like to join us, apply to the PhD Program (deadline December 2025). Current Research ( Recent Publications ) Zero-carbon Cloud Â - sustainable cloud computing based on stranded power, renewable-based grids, and dynamic cloud software Real-time Serverless: Function-as-a-service with Quality of Services (QoS) (IARPA funded project) The AGILE program inspired the UpDown System for breakthrough graph computing at scale! Builds on Unstructured Data Processor (UDP) and 10x10: Ensemble Accelerators for Data Transformation . Prior Research Projects: Global View Resilience (GVR)Â - flexible resilience at scale , Polyceph: (Distributed Perceptual (3D) Computing), Blockus (Scalable Graph data analytics), OptIPuter (Cloud and Grid Systems, Data-center storage and Dark-fiber WAN's), Fast Messages (cluster/data-center networking), Concert (Efficient Object-oriented programming), and parallel interconnection networks (computer architecture). Funding: The Large-Scale Systems Group gratefully acknowledges support from the NSF, DOE, DARPA , IARPA , VMWare , Huawei, Citadel, NetApp, Hewlett-Packard, Qualcomm, Nvidia, Agilent, Samsung, Intel, Google, and Keysight. A Part of: TheÂ LSSG Â is part ofÂ theÂ Systems Group and the CERES Center for Unstoppable Computing, both inÂ theÂ University of Chicago's Â Department ofÂ Computer Science . LSSG is also affiliated with Argonne National Laboratory's Â Mathematics and Computer Science Division. Old Pages: For more background, you can also see Andrew's old CSAG Site Here's a link to LSSG's Wiki (internal users only)",
  "content_length": 2381,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:24"
}