{
  "name": "Andrew S. Lan",
  "homepage": "https://people.umass.edu/~andrewlan",
  "status": "success",
  "content": "Andrew S. Lan, University of Massachusetts Amherst, Machine Learning for Education Toggle navigation Home Research Lab Publications Teaching CV Machine Learning for Education Andrew (Shiting) Lan, Associate Professor College of Information and Computer Sciences University of Massachusetts Amherst Address: 140 Governors Dr., Amherst, MA 01003 E-mail: andrewlan at cs dot umass dot edu I am an associate professor in the Manning College of Information and Computer Sciences, University of Massachusetts Amherst. Previously, I was a postdoctoral research associate in the EDGE Lab at the Department of Electrical Engineering, Princeton University, advised by Prof. Mung Chiang. I received my M.S. and Ph.D. degrees in Electrical and Computer Engineering from the Digital Signal Processing (DSP) group at Rice University, advised by Prof. Richard Baraniuk. I also worked for OpenStax. Prior to that, I received my BS degree in Physics and Mathematics from the Hong Kong University of Science and Technology. During that, I also studied at the Georgia Institute of Technology for a semester. My research focuses on the development of artificial intelligence (AI) and especially natural language processing (NLP) methods to enable scalable and effective personalized learning in education. My research spans areas such as learner modeling, personalization, content generation, and human-in-the-loop AI. My vision is to build an machine learning system that enables a world in which every learner has access to highquality, affordable, and personalized learning. I have co-organized a series of workshops on machine learning for education; see ml4ed for details. At the same time, I am generally interested in machine learning topics, including convex and nonconvex optimization, Bayesian inference, deep learning, and the future of work. News: July/Aug. 2024: We are starting new projects sponsored by the NSF: see here and here. July 2024: We're among the winners of 2024 Learning Engineering Tools Competition! See here. July 2024: Congrats to Alex for winning the best student paper award at AIED 2024! Apr. 2024: HUGE news - we are awarded a $90M NSF Mid-scale Research Infrastructure-2 award for SafeInsights, a secure cyberinfrastructure for educational research. It is the first MSRI-2 project for the EDU Directorate! See the NSF news release here and an official press release here. So glad that a journey we started planning 3+ years ago will finally begin! Postdoc position available in my group; contact me if interested! Nov. 2023: Excited to be part of the Learning Engineering Virtual Institute (LEVI) Program as the LLM Methodology hub! Thanks to Schmidt Futures for supporting our work. Sept. 2023: We participated in the NAEP Math Automated Scoring Challenge and was a grand prize winner. Check it out here!",
  "content_length": 2821,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:45"
}