{
  "name": "Andrew Miller 0001",
  "homepage": "http://soc1024.ece.illinois.edu",
  "status": "success",
  "content": "Andrew Miller @ UIUC Andrew Miller @ UIUC Andrew Miller I'm an Associate Professor at the University of Illinois, Urbana-Champaign, in Electrical and Computer Engineering and affiliate in Computer Science. I'm also an Associate Director of the Initiative for Cryptocurrencies and Contracts (IC3) and a board member of the Zcash Foundation. I received my Ph.D. from the University of Maryland Cybersecurity Center. Director of the Decentralized Systems Lab at UIUC! My research interests are broadly in computer security, and focused on the design of secure decentralized systems and cryptocurrencies. I combine techniques from programming languages, cryptography, and distributed computing. Click here for my calendar: Teaching Fall 2022: ECE 374 Spring 2022: ECE/CS 598 AM: Ideal Functionalities in Cryptography Fall 2021: ECE/CS 407 Cryptography Spring 2021: ECE 524 / CS 563 Advanced Computer Security Spring 2020 / Fall 2020: ECE/CS 374 Algorithms and Models of Computation (sp20) (fa20) Fall 2019: ECE498AC: Applied Cryptography at UIUC Spring 2019: ECE391: Computer Systems Engineering at UIUC Fall 2018: ECE498AC: Applied Cryptography at UIUC Spring 2018 (2nd half): ECE398SC: Smart Contracts and Blockchain Security at UIUC Fall 2017: ECE498AM/CS498AM: Applied Cryptography at UIUC Spring 2017: ECE422/CS461: Introduction to Computer Security at UIUC Fall 2016: ECE/CS 598AM: Cryptocurrency Security (catalog) at UIUC 2014-2015: Bitcoin and Cryptocurrency Technologies - Coursera MOOC., with Arvind Narayanan, Joseph Bonneau, and Ed Felten. Spring 2015: CMSC 818I: Science of Crypto-Currency. with Elaine Shi. [Course materials] on Smart Contract Programming Computer Security and Cryptocurrency Research Selected publications (peer-reviewed): SGXonerated: Finding (and Partially Fixing) Privacy Flaws in TEE-based Smart Contract Platforms Without Breaking the TEE Nerla Jean-Louis, Yunqi Li, Yan Ji, Harjasleen Malvai, Thomas Yurek, Sylvain Bellemare, Andrew Miller. PoPETS 2024 (to appear). SoK: SGX.Fail: How Stuff Gets eXposed van Schaik, Stephan and Seto, Alex and Yurek, Thomas and Batori, Adam and AlBassam, Bader and Garman, Christina and Genkin, Daniel and Miller, Andrew and Ronen, Eyal and Yarom, Yuval. IEEE Security and Privacy 2024 (to appear). SoK: Data Sovereignty Jens Ernstberger, Jan Lauinger, Fatima Elsheimy, Liyi Zhou, Sebastian Steinhorst, Ran Canetti, Andrew Miller, Arthur Gervais, Dawn Song. 8th IEEE European Symposium on Security and Privacy, 2023. A Mixed-Methods Study of Security Practices of Smart Contract Developers. Tanusree Sharma, Zhixuan Zhou, Andrew Miller, Yang Wang. To appear, Usenix 2023. Long Live The Honey Badger: Robust Asynchronous DPSS and its Applications Thomas Yurek, Zhuolun Xiang, Yu Xia, and Andrew Miller. Usenix 2023 (to appear.) Practical Asynchronous Distributed Key Generation. Sourav Das, Tom Yurek, Zhuolun Xiang, Andrew Miller, Lefteris Kokoris-Kogias, Ling Ren. IEEE Symposium on Security and Privacy 2022. hbACSS: How to Robustly Share Many Secrets Thomas Yurek, Licheng Luo, Jaiden Fairoze, Aniket Kate, and Andrew Miller. NDSS 2022. Publicly Auditable MPC-as-a-Service with succinct verification and universal setup Sanket Kanjalkar, Ye Zhang, Shreyas Gandlur, Andrew Miller. IEEE Workshop on Security and Privacy on the Blockchain, 2021. An Empirical Analysis of Privacy in the Lightning Network George Kappos, Haaroon Yousaf, Ania Piotrowska, Sanket Kanjalkar, Sergi Delgado-Segura, Andrew Miller, Sarah Meiklejohn. Financial Crypto 2021. Safer Illinois and RokWall: Privacy Preserving University Health Apps for COVID-19. Vikram Sharma Mailthody, James Wei, Nicholas Chen, Mohammad Behnia, Ruihao Yao, Qihao Wang, Vedant Agrawal, Churan He, Lijian Wang, Leihao Chen, Amit Agarwal, Edward Richter, Wen-Mei Hwu, Christopher W. Fletcher, Jinjun Xiong, Andrew Miller, Sanjay Patel. Workshop on Secure IT Technologies against COVID-19 (CoronaDef) 2021. CanDID: Can-Do Decentralized Identity with Legacy Compatibility, Sybil-Resistance, and Accountability Deepak Maram and Harjasleen Malvai and Fan Zhang and Nerla Jean-Louis and Alexander Frolov and Tyler Kell and Tyrone Lobban and Christine Moy and Ari Juels and Andrew Miller. (IEEE S&P 2021) You sank my battleship! A case study to evaluate state channels as a scaling solution for cryptocurrencies Patrick McCorry, Chris Buckland, Surya Bakshi, Karl Wuest, and Andrew Miller. 4th Workshop on Trusted Smart Contracts. 2020 Non-interactive Proofs of Proof-of-Work. Aggelos Kiayias, Andrew Miller, Dionysis Zindros. Financial Cryptography 2020 (website) Custos: Practical Tamper-Evident Auditing of Operating Systems Using Trusted Execution. Riccardo Paccagnella, Pubali Datta, Wajih Ul Hassan, Adam Bates, Christopher W. Fletcher, Andrew Miller, Dave Tian. NDSS 2020 Pisa: Arbitration Outsourcing for State Channels.. Patrick McCorry, Surya Bakshi, Iddo Bentov, Sarah Meiklejohn, Andrew Miller. ACM Advances in Financial Technology, 2019. HoneyBadgerMPC and AsynchroMix: Practical AsynchronousMPC and its Application to Anonymous Communication. Donghang Lu, Thomas Yurek, Samarth Kulshreshtha, Rahul Govind, Rahul Mahadev, Aniket Kate, Andrew Miller. CCS 2019. (github) ILC: a calculus for composable, computational cryptography. Kevin Liao, Matthew Hammer, and Andrew Miller. (PLDI 2019) Outguard: Detecting In-Browser Covert Cryptocurrency Mining in the Wild. Amin Kharraz, Zane Ma, Paul Murley, Charles Lever, Joshua Mason, Andrew Miller, Nikita Borisov, Manos Antonakakis, Michael Bailey. (WWW 2019) Ekiden: A Platform for Confidentiality-Preserving, Trustworthy, and Performant Smart Contract Execution Raymond Cheng, Fan Zhang, Jernej Kos, Warren He, Nicholas Hynes, Noah Johnson, Ari Juels, Andrew Miller, Dawn Song. (Euro S&P 2019) TxProbe: Discovering Bitcoin's Network Topology Using Orphan Transactions. Sergi Delgado-Segura, Surya Bakshi, Cristina Pérez-Solà, James Litton, Andrew Pachulski, Andrew Miller, and Bobby Bhattacharjee (FC 2019) Sprites and State Channels: Payment Networks that Go Faster than Lightning. Andrew Miller, Iddo Bentov, Surya Bakshi, Ranjit Kumaresan, and Patrick McCorry (FC 2019) Short Paper: I Can’t Believe It’s Not Stake! Resource Exhaustion Attacks on PoS. Sanket Kanjalkar, Joseph Kuo, Yunqi Li, and Andrew Miller. (FC 2019) DelegaTEE: Brokered Delegation Using Trusted Execution Environments Sinisa Matetic and Moritz Schneider and Andrew Miller and Ari Juels and Srdjan Capkun. USENIX Security 2018. Erays: Reverse Engineering Ethereum's Opaque Smart Contracts. Yi Zhou, Deepak Kumar, Surya Bakshi, Joshua Mason, Andrew Miller, and Michael Bailey, University of Illinois, Urbana-Champaign. USENIX Security 2018. Dandelion++: Lightweight Cryptocurrency Networking with Formal Anonymity Guarantees. Giulia Fanti, Surya Bakshi, Shaileshh Bojja Venkatakrishnan, Andrew Miller, Bradley Denby, Shruti Bhargava, Pramod Viswanath. ACM SIGMETRICS 2018. Authenticated Data Structures for Privacy-Preserving Monero Light Clients. Kevin Lee and Andrew Miller. IEEE Security & Privacy on the Blockchain (IEEE S&B 2018). Measuring Ethereum Network Peers. Seoung Kyun Kim and Zane Ma and Siddharth Murali and Joshua Mason and Andrew Miller and Michael Bailey. IMC '18 An Empirical Analysis of Traceability in the Monero Blockchain. Malte Möser, Kyle Soska, Ethan Heilman, Kevin Lee, Henry Heffan, Shashvat Srivastava, Kyle Hogan, Jason Hennessey, Andrew Miller, Arvind Narayanan, and Nicolas Christin. PETS 2018 (website) Instantaneous Decentralized Poker. Iddo Bentov, Ranjit Kumaresan, and Andrew Miller. AsiaCrypt 2017. Atomically Trading with Roger: Gambling on the success of a hardfork. Patrick McCorry, Ethan Heilman, Andrew Miller. Data Privacy Management, International Workshop on Cryptocurrencies and Blockchain Technology - CBT'17. Towards an Accountable Software-Defined Networking Architecture. Benjamin Ujcich, Adam Bates, Andrew Miller, William H. Sanders. NETSOFT 2017. SmartCast: An Incentive Compatible Consensus Protocol Using Smart Contracts. Abhiram Kothapalli, Andrew Miller, and Nikita Borisov. 1st Workshop on Trusted Smart Contracts, April 2017. Zero-Collateral Lotteries in Bitcoin and Ethereum. Iddo Bentov and Andrew Miller. Security and Privacy on the Blockchain, April 2017. The Honey Badger of BFT Protocols. Andrew Miller, Yu Xia, Kyle Croman, Elaine Shi, and Dawn Song. CCS 2016 Hawk: The Blockchain Model of Cryptography and Privacy-Preserving Smart Contracts. Ahmed Kosba, Andrew Miller, Elaine Shi, Zikai Wen, Charalampos Papamanthou. IEEE Security & Privacy (Oakland), May 2016. (Video!) [Top 2 cited Security paper in 2016!] Stubborn Mining: Generalizing Selfish Mining and Combining with an Eclipse Attack. Kartik Nayak, Srijan Kumar, Andrew Miller, Elaine Shi. IEEE Euro S&P. 2016. On Scaling Decentralized Blockchains (A Position Paper). Kyle Croman, Christian Decker, Ittay Eyal, Adem Efe Gencer, Ari Juels, Ahmed Kosba, Andrew Miller, Prateek Saxena, Elaine Shi, Emin Gun Sirer, Dawn Song, Roger Wattenhofer. 3rd Workshop on Bitcoin and Blockchain Research. 3rd Workshop on Bitcoin and Blockchain Research. March 2016. Step by Step Towards Creating a Safe Smart Contract: Lessons and Insights from a Cryptocurrency Lab. Kevin Delmolino, Mitchell Arnett, Ahmed Kosba, Andrew Miller, and Elaine Shi. 3rd Workshop on Bitcoin and Blockchain Research. March 2016 (website) Non-outsourceable Scratch-Off Puzzles to Discourage Bitcoin Mining Coalitions. Andrew Miller, Elaine Shi, Ahmed Kosba, and Jonathan Katz. ACM Computer and Communications Security (CCS), October 2015. Shadow-Bitcoin: Scalable Simulation via Direct Execution of Multi-threaded Applications.. Andrew Miller, Rob Jansen. USENIX CSET Workshop, 2015. (code) SoK: Research Perspectives and Challenges for Bitcoin and Cryptocurrencies. Joseph Bonneau, Andrew Miller, Jeremy Clark, Arvind Narayanan, Joshua A. Kroll, Edward W. Felten. IEEE Security & Privacy (Oakland), May 2015. [Top cited Security paper in 2015!] From Onions to Sh",
  "content_length": 20168,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:48"
}