{
  "name": "André Rodrigues 0002",
  "homepage": "https://ciencias.ulisboa.pt/en/perfil/afrodrigues",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Skip to main content Ciências ULisboa Pesquisa Português English Login You are here / / Back to Top Contactos Departamento de Informática Email afrodrigues@ciencias.ulisboa.pt Carreira Docente Universitário Categoria Professor Auxiliar Indicadores ResearcherID Orcid Google Scholar Interesses Científicos Human-Computer Interaction; Accessible Computing; Digital Healthcare; Inclusive Gaming; Scientific Interests Human-Computer Interaction; Accessible Computing; Digital Healthcare; Inclusive Gaming; Publicações selecionadas André Rodrigues, Kyle Montague, Hugo Nicolau, and Tiago Guerreiro. 2015. Getting Smartphones to Talkback: Understanding the Smartphone Adoption Process of Blind Users. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15). Association for Computing Machinery, New York, NY, USA, 23–32. DOI:https://doi.org/10.1145/2700648.2809842 David Gonçalves, André Rodrigues, Mike L. Richardson, Alexandra A. de Sousa, Michael J. Proulx, and Tiago Guerreiro. 2021. Exploring Asymmetric Roles in Mixed-Ability Gaming. Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 114, 1–14. DOI:https://doi.org/10.1145/3411764.3445494 André Rodrigues, André R.B. Santos, Kyle Montague, and Tiago Guerreiro. 2021. Promoting Self-Efficacy Through an Effective Human-Powered Nonvisual Smartphone Task Assistant. Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 114 (April 2021), 19 pages. DOI:https://doi.org/10.1145/3449188 Hugo Nicolau, André Rodrigues, André Santos, Tiago Guerreiro, Kyle Montague, and João Guerreiro. 2019. The Design Space of Nonvisual Word Completion. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '19). Association for Computing Machinery, New York, NY, USA, 249–261. DOI:https://doi.org/10.1145/3308561.3353786 Daniel Trindade, André Rodrigues, Tiago Guerreiro, and Hugo Nicolau. 2018. Hybrid-Brailler: Combining Physical and Gestural Interaction for Mobile Braille Input and Editing. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Paper 27, 1–12. DOI:https://doi.org/10.1145/3173574.3173601 Ver todas as Publicações",
  "content_length": 2367,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:18"
}