{
  "name": "Andreas Züfle",
  "homepage": "https://www.zuefle.org",
  "status": "success",
  "content": "Andreas ZüfleSearch this siteEmbedded FilesSkip to main contentSkip to navigationAndreas Züfle Associate Professor, Emory Universityazufle*at*emory*dot*eduResearchMy research has been focused on mining spatio-temporal data with applications in transportation, epidemiology, social science, and urban computing. I'm a computer scientist who is passionate to work interdisciplinary.I have a special interest in Geosimulation as a new paradigm to combine large-scale data generation with data mining to improve decision-making.My full CV can be found here. I'm looking for highly motivated students and postdocs in data management, data mining, and machine learning.  I'm particularly looking for students for the following projects. Following the links below for a quick overview of the projects and availability of student/postdoc funding:Trajectory Simulation and GenerationUncertain Spatial Data MiningPhylogenetic Data MiningReverse Nearest Neighbor Query ProcessingSpatial ClusteringRecent News:10/2024: Our paper titled \"Transferable Unsupervised Outlier Detection Framework for Human Semantic Trajectories\" was selected as one of four candidates for the best paper award at ACM SIGSPATIAL'24.  Big congrats to Zheng Zhang & Hossein Amiri! (Update: We did not receive the best paper award but we're one of the runner-ups! \\o/ )09/2024: Two more workshop papers accepted at ACM SIGSPATIAL'24! One paper called GeoLife+ on simulating realistic human trajectories published at the ACM SIGSPATIAL'24 Workshop on GeoSimulation (congratulations Hossein!) and one paper on predicting human trajectories published at the ACM SIGSPATIAL'24 Human Mobility Prediction Challenge Workshop (congratulations PhD Students Ruochen, Hossein, Alex, Lance, and undergraduate student Misha Gupta).09/2024: Four (!) papers accepted the 1st ACM SIGSPATIAL International Workshop on Geospatial Anomaly Detection (GeoAnomalies’24) showcasing our work in IARPA's HAYSTAC Program. The first paper presents a massive-scale agent-based simulated trajectory dataset called \"Urban Anomalies\" that includes anomalous trajectories as a benchmark for trajectory anomaly detection research (congrats Ruochen and Hossein!). Second, an approach towards detecting anomalies trajectories by interpreting the staypoints of a trajectory like words in a sentence to leverage large-language models to mine anomalies . Third, an approach using matrix factorization and collaborative filtering to detect anomalies in trajectories.  Lastly but not leastly, an approach using kinematic profiles (speed, acceleration, turning behavior) of moving objects to detect anomalous trajectories.   08/2024: Two demonstrations papers accepted at ACM SIGSPATIAL'24! Including a demonstration of our Patterns of Life Human Mobility Simulation (Congratulations PhD Student Hossein Amiri and undergraduate student Will Kohn!) and a demonstration of our Infectious Disease Spread Simulation to Control Data Bias (congratulations PhD student Ruochen Kong!)08/2024: Our paper titled \"Transferable Unsupervised Outlier Detection Framework for Human Semantic Trajectories\" was accepted as a full paper at ACM SIGSPATIAL'24.  Congratulations to PhD Students Zheng Zhang & Hossein Amiri!07/2024: Our community vision paper titled \"Mobility Data Science: Perspectives and Challenges\" which charts future directions, challenges, and opportunities for the field of mobility data science has been accepted to appear in ACM Transactions on Spatial Algorithms and Systems (TSAS). Congratulations to all our 48 authors on this herculean effort!06/2024: Our paper titled  \"Leveraging Simulation Data to Understand Bias in Predictive Models of Infectious Disease Spread\" was accepted to appear in ACM Transactions on Spatial Algorithms and Systems (TSAS). Congratulations to Ruochen Kong on her first journal paper as a PhD Student in my lab!05/2024: Our paper titled \"Spatial Transfer Learning for Estimating PM 2.5 in Data-poor Regions\" has been accepted at ECML PKDD'24. 05/2024: Honored to having received an ACM SIGMOD Distinguished Program Committee Member Award.05/2024: Our paper titled \"Source Localization for Cross Network Information Diffusion\" was accepted at KDD'24. Congratulations to graduate students Chen Ling and Tanmoy Chowdhury!04/2024: Our paper titled \"Leveraging Simulation Data to Understand Bias in Predictive Models of Infectious Disease Spread\" was accepted at ACM Transactions on Spatial Algorithms and Systems (TSAS)01/2024: Honored to join the IJGIS, the top Journal on Geo-Information Science, as an Associate Editor.12/2023: Published a Book Chapter on GeoAI for Public Health!11/2023: Honored to serve the ACM SIGSPATIAL as General Chair of the ACM SIGSPATIAL Conference 2024 in Atlanta, Georgia, USA!11/2023: Honored to having received a Outstanding Vice PC Chairs at ACM SIGSPATIAL 2023!11/2023: We received the Best Resource & Data Paper Award at ACM SIGSPATIAL 2023. Congratulations Hossein Amiri!09/2023: Congratulations to Undergraduate Student Will Kohn for our paper accepted at the ACM SIGSPATIAL GeoSim'24 Workshop! 09/2023: Congratulations to High School Student Ketevan Gallagher for our paper accepted at the ACM SIGSPATIAL LocalRec'24 Workshop! 06/2023: Congratulations Hossein Amiri for our Data and Resource Track Paper accepted at ACM SIGSPATIAL! 05/2023: Joining IARPA's HAYSTAC Program to find outliers in human trajectory data to disrupt the boundaries of trajectory simulation and trajectory data mining.04/2023: Exciting new research project funded by the NSF on Understanding Bias in Infectious Disease Models. This is a collaboration with The University of New South Wales (UNSW) Sydney. 08/2022: I'm starting at Emory University as an Acting Associate Professor in the Department of Computer Science in Fall. Moving to Atlanta!06/2022: Paper accepted at AnnSim'22 on synthetic population generation for geosimulations. Congratulations to Srihan Kotnana, a high school student who led this work.  04/2022: Paper accepted at MDM'22 on visualizing phylogenetic data. Congratulations to the first author Tri Le. 04/2022: Joining the Preparedness Summit in Atlanta to discuss lessons learned from the COVID-19 pandemic with health departments and researchers.03/2022:  Received NSF funding to support an undergraduate student in the Research Experiences for Undergraduates (REU) program to find spatio-temporal patterns in phylogenetic data.01/2022: Organized a Dagstuhl seminar on Mobility Data Science  with 47 participants. Feels good to brainstorm in-person once again! 11/2021: Excited to join the Organizing Committee of PREPARE (Pandemic Research for Preparedness and Resilience),  an NSF-sponsored virtual organization tasked with fostering research collaborations and synthesizing critical pandemic-related research into a roadmap to help guide our nation’s response to the next pandemic (https://prepare-vo.org/). We're organizing a workshop on December 8th and 9th for NSF COVID-19 RAPIDs to present their results and collaborate across disciplines. Let me know if you would like to join the workshop!11/2021: We received the Best Poster Award Runner-Up at ACM SIGSPATIAL 2021 for our Paper titled \"Semantically Diverse Paths with Range and Origin Constraints\". It is a collaborative work with Xu Teng and Goce Trajcevski from Iowa State University. 11/2021: Paper accepted at the Journal of Computational and Mathematical Organization Theory (CMOT, Springer Nature) on our DARPA work on simulating urban life.11/2021: Paper accepted at PLoS One. Congratulations Justin Elarde for your work as an undergraduate student!10/2021: I'm co-organizing the 2nd ACM SIGSPATIAL International Workshop on Spatial Computing for Epidemiology (SpatialEpi 2021) to be held virtually on November 2nd, 2021. The workshop features an outstanding keynote by epidemiologist Dr. Amira Roess and three paper presentations. You can join for the ACM SIGSPATIAL Conference and the workshop for free.10/2021: I'm co-organizing the 1st ACM SIGSPATIAL International Workshop on Searching and Mining Large Collections of Geospatial Data (GeoSearch 2021) to be held virtually on November 2nd, 2021. We have an outstanding keynote by Manil Maskey (NASA) and four paper presentations.10/2021: I'm co-organizing the 3rd ACM SIGSPATIAL International Workshop on Spatial Gems (SpatialGems 2021).09/2021: Paper accepted at the 5th ACM SIGSPATIAL Workshop on Location-based Recommendations. Congratulations Samiul Islam for publishing your work!08/2021 (Promotion & Tenure): I am now an Associate Professor with Tenure! 07/2021: Full paper accepted at SISAP 2021. Again, Congratulations @Ahmed Askar.06/2021: Two papers accepted at SSTD 2021. Congratulations to my student Ahmed Askar for his first (full) paper! 05/2021: I am grateful for receiving a research grant ($2293K) from NSF on the project \"Data-Driven Modeling to Improve Understanding of Human Behavior, Mobility, and Disease Spread\". We're looking for a motivated postdoc to work with us! (apply here)04/2021:  I'm co-organizing the 2nd ACM SIGSPATIAL International Workshop on Spatial Computing for Epidemiology (SpatialEpi’21) to be held on November 2nd in Beijing, China.02/2021: I'm excited to be a mentor in GMUs Aspiring Scientists Summer Internship Program (ASSIP) through which I will mentor seven aspiring high school students in Summer 2021.01/2021:  I'm a guest editor for ACM Transactions on Spatial Algorithms and Systems Special Issue on Special Issue on Understanding the Spread of COVID-19.12/2020: Our Dagstuhl Seminar Proposal on \"Mobility Data Science\" together with Dr. Mahmoud Sakr, Dr. Mohamed Mokbel, and Dr. Li Xiong has been accepted! Dates for the seminar will be announced soon.12/2020:  I'm grateful for having received a GMU Summer Team Impact Grant ($35K) to provide two graduate students and six undergraduate students with exciting summer research projects related to Data-Driven Analysis of Human Behavior in COVID-19 Simulation Models in Summer 20",
  "content_length": 12130,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:19"
}