{
  "name": "Andrea Cavallaro",
  "homepage": "http://www.eecs.qmul.ac.uk/~andrea",
  "status": "success",
  "content": "Andrea Cavallaro Professor Andrea Cavallaro Turing Fellow, The Alan Turing Institute Director, Centre for Intelligent Sensing Director of Research, School of Electronic Eng. and Computer Science a.cavallaro@qmul.ac.uk I work on machine learning for multi-modal perception, computer vision, audio processing, and information privacy. My research goal is to create the next-generation machine perception models for the effective use of sensory data, and the safe operation of autonomous systems that gain information about their environment and make decisions in partnership with humans or without human control. My ambition is to transform the ability of autonomous systems to see, hear and confidently act in previously unseen scenarios. I am also interested in bringing together people with expertise from various disciplines including social science and law to address broader societal challenges such as privacy. I am the coordinator of two CHIST-ERA Future and Emerging Technology projects: Collaborative Object Recognition, Shared Manipulation and Learning (CORSMAL), with partners École polytechnique fédérale de Lausanne (EPFL) and Sorbonne University; and Graph Neural Networks for Explainable Artificial Intelligence (GraphNEx), with partners École normale supérieure de Lyon and EPFL. I serve as Editor-in-Chief of Signal Processing: Image Communication and as Senior Area Editor for the IEEE Transactions on Image Processing. I am the Past Chair of the IEEE Image, Video, and Multidimensional Signal Processing Technical Committee; a member of the IEEE Video Signal Processing and Communication Technical Committe; and a member of the Technical Directions Board of the IEEE Signal Processing Society. Jump to: Recent talks | Selected publications | Survey articles | Awards | Bio | Contact info | Visiting Recent talks Images, Videos & Personal Information Springer-Nature Image and Video Processing Webinar (12 December 2021) Collaborative object recognition, shared manipulation and learning IPALM Workshop (29 November 2021, PM) 2nd NAVER LABS Europe International Workshop on AI for Robotics (29 November 2021, AM) ICVS Workshop on Object Recognition and Manipulation (24 September 2021) CHIST-ERA Conference (25 September 2020) CHIST-ERA Workshop on Open Science in Transnational Research, Bern (6 March 2020) Robust and privacy preserving multi-modal learning IEEE SPS-EURASIP Summer School on Signal Processing (8 September 2021) Multi-modal learning for robot perception RSS Workshop on Behavioural Inference of Remotely Sensed Multi-Agent Systems (15 July 2021) IET Workshop on The Use of Machine Learning in Unmanned Aerial Vehicles Data (20 April 2021) Zebra Technologies (17 February 2021) Naver Labs Europe (9 February 2021) Adversarial perturbations and image quality International Workshop on Human Factors for Visual Experiences (13 July 2021) Protecting personal information in image, audio & motion data Hewlett-Packard Company (13 May 2021) The Alan Turing Projects Seminar series (26 April 2021) Adversarial attacks on image classifiers Cardiff University (24 March 2021) Boston University (24 February 2021) Singapore University of Technology and Design (15 December 2020) AI2S Deep Learning Day, Trieste (14 December 2020) Nagoya University (12 December 2020) Georgia Tech (19 November 2020) (keynote) International Conference on Image Processing Theory, Tools and Applications (10 November 2020) Twin-Cities Minnesota (29 October 2020) Computer Vision, Pattern recognition and machine Learning (CVPL) seminar (10 June 2020) Images, AI and privacy Institute of Applied Data Science Webinar series (11 February 2021) Deep Learning for Privacy in Multimedia (tutorial) ACM International Conference on Multimedia (12 October 2020) Robust and privacy-preserving multi-modal learning with body cameras Summer School on Artificial Intelligence: from Deep Learning to Data Analytics (29 June 2020) Privacy-preserving machine learning for multimedia data (keynote) International Conference on Pattern Recognition Applications and Methods, Malta (23 February 2020) full list here Selected publications Cast shadow segmentation using invariant color features Efficient multitarget visual tracking using random finite sets Tracking video objects in cluttered background Adaptive multifeature tracking in a particle filtering framework Semantic video analysis for adaptive content delivery and automatic description 3-D face detection, landmark localization, and registration using a point distribution model Multifeature object trajectory clustering for video analysis Target detection and tracking with heterogeneous sensors Learning scene context for multiple object tracking Privacy in video surveillance full list here Survey articles Cooperative robots to observe moving targets: a survey Automatic analysis of facial affect: a survey of registration, representation and recognition Video-based human behavior understanding: a survey Adaptive appearance modeling for video tracking: survey and evaluation Person re-identification in crowd Distributed and decentralized multi-camera tracking full list here Awards, prizes and other honours Distinguished Lecturer, IEEE Signal Processing Society (2020) Fellow, International Association for Pattern Recognition (2018) Turing Fellow, The Alan Turing Institute (2018) Fellow, Higher Education Academy (2016) Faculty Research Performance Award (2014) Selected member, QM High Potential Leaders Programme (2011) Best paper award, IEEE AVSS 2009 (with N. Anjum) Recognition of service award, Association for Computing Machinery (2009) Student paper award, IEEE ICASSP 2009 (with T. Popkin) Royal Academy of Engineering ‘Engineering Teaching Prize’ (2007) Student paper award, IEEE ICASSP 2007 (with E. Maggio) Selected member, QM Future Generation Leaders group (2006) QM e-Learning Fellowship (2006) Student paper award, IEEE ICASSP 2005 (with E. Maggio) QM Drapers' Prize for the development of Learning and Teaching (2004) BT Research Fellow (2004) Bio Andrea Cavallaro is Turing Fellow at The Alan Turing Institute, the UK National Institute for Data Science and Artificial Intelligence, and Full Professor at Queen Mary University of London, a Russell Group university. He is the founding Director of the Centre for Intelligent Sensing and the Director of Research of the School of Electronic Engineering and Computer Science. He is a Fellow of the International Association for Pattern Recognition (IAPR) for “contributions to image processing and multi-sensor scene understanding,” and a Fellow of the Higher Education Academy. He serves as Editor-in-Chief of Signal Processing: Image Communication, as Senior Area Editor for the IEEE Transactions on Image Processing, as member of the IEEE Video Signal Processing and Communication Technical Committee and as member of the Technical Directions Board of the IEEE Signal Processing Society. Professor Cavallaro received his Ph.D. in Electrical Engineering from the École polytechnique fédérale de Lausanne (EPFL) in 2002. He was a Research Fellow with British Telecommunications (BT) in 2004 and was awarded the Royal Academy of Engineering Teaching Prize in 2007; three student paper awards on target tracking and perceptually sensitive coding at IEEE ICASSP in 2005, 2007 and 2009; and the best paper award at IEEE AVSS 2009. He was selected as IEEE Signal Processing Society Distinguished Lecturer (2020-2021) and is the past Chair of the IEEE Image, Video, and Multidimensional Signal Processing Technical Committee (2020-2021). He also served as elected member of the IEEE Multimedia Signal Processing Technical Committee and chair of the Awards committee of the IEEE Signal Processing Society, Image, Video, and Multidimensional Signal Processing Technical Committee. He served as Area Editor for the IEEE Signal Processing Magazine (2012-2014); and as Associate Editor for the IEEE Transactions on Image Processing (2011-2015), IEEE Transactions on Signal Processing (2009-2011), IEEE Transactions on Multimedia (2009-2010), IEEE Signal Processing Magazine (2008-2011) and IEEE Multimedia (2016-2018). He also served as Guest Editor the IEEE Transactions on Multimedia (2019), IEEE Transactions on Circuits and Systems for Video Technology (2017, 2011), Pattern Recognition Letters (2016), IEEE Transactions on Information Forensics and Security (2013), International Journal of Computer Vision (2011), IEEE Signal Processing Magazine (2010), Computer Vision and Image Understanding (2010), Annals of the British Machine Vision Association (2010), Journal of Image and Video Processing (2010, 2008), and Journal on Signal, Image and Video Processing (2007). He has published over 270 journal and conference papers, one monograph on Video tracking (2011, Wiley) and three edited books: Multi-camera networks (2009, Elsevier); Analysis, retrieval and delivery of multimedia content (2012, Springer); and Intelligent multimedia surveillance (2013, Springer). Contact information Professor Andrea Cavallaro Centre for Intelligent Sensing School of Electronic Engineering and Computer Science Queen Mary University of London Mile End Road, London E1 4NS, UK Room: CS436 Tel: +44 20 7882 5165 a.cavallaro@qmul.ac.uk Visiting In the Transport for London Journey planner input as destination Stepney Green or Mile End tube station. From Stepney Green tube station: when you exit the station turn left, after 0.2 mi turn left into Bancroft Rd, after 200 ft turn left through the gate From Mile End tube station: when you exit the station turn left, after 0.6 mi turn right into Bancroft Rd, after 200 ft turn left through the gate After crossing the square, enter the building on your right (building number 6 in this map). The reception is on the third floor. Map: View Larger Map",
  "content_length": 9805,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:43"
}