{
  "name": "Anduo Wang",
  "homepage": "http://anduowang.github.io",
  "status": "success",
  "content": "adw homepage anduo wang cv random research short-bio teaching and services anduo wang Associate Professor Computer and Information Science, Temple University anduo.wang@gmail.com SERC 342, N 12th St, Philadelphia, PA 19122 My research improves networked-systems with rigorous methods. My efforts have been an integral part of the broader initiative aimed at transitioning networks from guess-work protocols to disciplined software. What distinguishes my research is that it focuses on problems — especially networking pain points under intense debate — that do not easily fit into classic software engineering and formal methods that often presuppose a stand-alone and monolithic software architecture. If the emerging software infrastructure that constitutes modern networks — such as the global Internet, hyper-scale datacenters, and Internet of Things in enterprises and homes — is to truly thrive as before, it must surpass any software we already know. Motivated by the pervasive issues that these networks are never short of (to discerning eyes), my goal is to re-frame them using logic and adopting solutions developed for similar problems in automated reasoning, knowledge bases, programming languages, and more. In this sense, my overarching objective is to shape the future of networking by playing a unique role in collaborative efforts with passionate networking talents, while also revitalizing the elegant logic solutions accumulated over decades. My current and past projects (more at the Ravel project site) have been supported by several NSF awards (Award CNS-1909450, CNS 1657285, and NSF CAREER 2145242). selected publications Declarative Debugging for Modern Networks, PADL 2026 Faure: A Partial Approach to Network Analysis, HotNets 2021 [paper] [slides] Internet Routing and Non-monotonic Reasoning LPNMR 2019 [paper] [slides] Ravel: A Database-Defined Network, SOSR’16 [paper] [slides] [demo] A Reduction-based Approach Towards Scaling Up Formal Analysis of Internet Configurations, INFOCOM’14, [paper] Formally Verifiable Networking, HotNets’09 [paper]",
  "content_length": 2076,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:20"
}