{
  "name": "Andy Meneely",
  "homepage": "http://www.se.rit.edu/~andy",
  "status": "success",
  "content": "Andy Meneely, PhD Toggle navigation Andy Meneely, PhD Home Research Publications Words CV More Department of Software Engineering Rochester Institute of Technology 134 Lomb Memorial Drive Rochester, NY 14623-5608 Golisano 70-1547 (585)475-7829 andy (AT) se.rit.edu Interests Empirical software engineering, software security, collaborative software development, open source development, socio-technical factors, metrics and measurement, applied machine learning and data mining Bio Andy has been an assistant professor of Software Engineering at RIT since 2011. Prior to then, Andy received his PhD in Computer Science at North Carolina State University in Raleigh, North Carolina under Laurie Williams. His doctoral dissertation, titled Investigating the Relationship between Developer Collaboration and Software Security involved formulating metrics to examine the socio-technical structure of software development teams using social network analysis. His research has resulted in many top-tier academic publications. He also earned his Masters at NCSU in 2008. Andy received his Bachelors of Arts at Calvin College, Grand Rapids, MI where he was a double-major in Computer Science and Mathematics. Recent Publications Analyzing Security Data Andrew Meneely The Art and Science of Analyzing Software Data pp. 213–227 [Abstract] [BibTeX] [Word Cloud] [DOI] Security is a challenging and strange property of software. Security is not about understanding how a customer might use the system; security is about ensuring that an attacker cannot abuse the system. Instead of defining what the system should do, security is about ensuring that system does not do something malicious. As a result, applying traditional software analytics to security leads to some unique challenges and caveats. In this chapter, we will discuss four \"gotchas\" of analyzing security data, along with vulnerabilities and severity scoring. We will describe a method commonly-used for collecting security data in open source projects. We will describe some of the state-of-the-art in analyzing security data today. @article{MeneelyASD2015, author = {Meneely, Andrew}, title = {Analyzing Security Data}, journal = {The Art and Science of Analyzing Software Data}, publisher = {Elsevier}, pages = {213--227}, doi = {}, abstract = {Security is a challenging and strange property of software. Security is not about understanding how a customer might use the system; security is about ensuring that an attacker cannot abuse the system. Instead of defining what the system should do, security is about ensuring that system does not do something malicious. As a result, applying traditional software analytics to security leads to some unique challenges and caveats. In this chapter, we will discuss four \"gotchas\" of analyzing security data, along with vulnerabilities and severity scoring. We will describe a method commonly-used for collecting security data in open source projects. We will describe some of the state-of-the-art in analyzing security data today.} } An Insider Threat Activity in a Software Security Course Daniel E. Krutz, Andrew Meneely, & Samuel A. Malachowsky 2015 IEEE Frontiers in Education Conference (FIE) pp. to appear [Abstract] [BibTeX] [Word Cloud] [DOI] Software development teams face a critical threat to the security of their systems: insiders. A malicious insider is a person who violates an authorized level of access in a software system. Unfortunately, when creating software, developers do not typically account for insider threat. Students learning software development are unaware of the impacts of malicious actors and are far too often untrained in prevention methods against them. A few of the defensive mechanisms to protect against insider threats include eliminating system access once an employee leaves an organization, enforcing principle of least privilege, code reviews, and constant monitoring for suspicious activity. At the Department of Software Engineering at the Rochester Institute of Technology, we require a course titled Engineering of Secure Software and have created an activity designed to prepare students for the problem of insider threats. At the beginning of this activity, student teams are given the task of designing a moderately sized secure software system. The goal of this insider is to manipulate the team into creating a flawed system design that would allow attackers to perform malicious activities once the system has been created. When the insider is revealed at the conclusion of the project, students discuss countermeasures regarding the malicious actions the insiders were able to plan or complete, along with methods of prevention that may have been employed by the team to detect the malicious developer. In this paper, we describe the activity along with the results of a survey. We discuss the benefits and challenges of the activity with the goal of giving other instructors the tools they need to conduct this activity at their institution. While many institutions do not offer courses in computer security, this self-contained activity may be used in any computing course to enforce the importance of protecting against insider threats. @article{KrutzFIE2015, author = {Krutz, Daniel E. and Meneely, Andrew and Malachowsky, Samuel A.}, title = {An Insider Threat Activity in a Software Security Course}, journal = {2015 IEEE Frontiers in Education Conference (FIE)}, pages = {to appear}, doi = {}, abstract = {Software development teams face a critical threat to the security of their systems: insiders. A malicious insider is a person who violates an authorized level of access in a software system. Unfortunately, when creating software, developers do not typically account for insider threat. Students learning software development are unaware of the impacts of malicious actors and are far too often untrained in prevention methods against them. A few of the defensive mechanisms to protect against insider threats include eliminating system access once an employee leaves an organization, enforcing principle of least privilege, code reviews, and constant monitoring for suspicious activity. At the Department of Software Engineering at the Rochester Institute of Technology, we require a course titled Engineering of Secure Software and have created an activity designed to prepare students for the problem of insider threats. At the beginning of this activity, student teams are given the task of designing a moderately sized secure software system. The goal of this insider is to manipulate the team into creating a flawed system design that would allow attackers to perform malicious activities once the system has been created. When the insider is revealed at the conclusion of the project, students discuss countermeasures regarding the malicious actions the insiders were able to plan or complete, along with methods of prevention that may have been employed by the team to detect the malicious developer. In this paper, we describe the activity along with the results of a survey. We discuss the benefits and challenges of the activity with the goal of giving other instructors the tools they need to conduct this activity at their institution. While many institutions do not offer courses in computer security, this self-contained activity may be used in any computing course to enforce the importance of protecting against insider threats.} } Do Bugs Foreshadow Vulnerabilities? A Study of the Chromium Project Felivel Camilo, Andrew Meneely, & Meiyappan Nagappan 2015 International Working Conference on Mining Software Repositories pp. to appear ACM Distinguished Paper Best Paper MSR 2015 [Abstract] [BibTeX] [Word Cloud] [DOI] As developers face ever-increasing pressure to engineer secure software, researchers are building an understanding of security-sensitive bugs (i.e. vulnerabilities). Research into min- ing software repositories has greatly increased our understanding of software quality via empirical study of bugs. However, con- ceptually vulnerabilities are different from bugs: they represent abusive functionality as opposed to wrong or insufficient function- ality commonly associated with traditional, non-security bugs. In this study, we performed an in-depth analysis of the Chromium project to empirically examine the relationship between bugs and vulnerabilities. We mined 374,686 bugs and 703 post-release vulnerabilities over five Chromium releases that span six years of development. Using logistic regression analysis, we examined how various categories of pre-release bugs (e.g. stability, compatibility, etc.) are associated with post-release vulnerabilities. While we found statistically significant correlations between pre-release bugs and post-release vulnerabilities, we also found the asso- ciation to be weak. Number of features, SLOC, and number of pre-release security bugs are, in general, more closely associated with post-release vulnerabilities than any of our non-security bug categories. In a separate analysis, we found that the files with highest defect density did not intersect with the files of highest vulnerability density. These results indicate that bugs and vulnerabilities are empirically dissimilar groups, warranting the need for more research targeting vulnerabilities specifically. @article{CamiloMSR2015, author = {Camilo, Felivel and Meneely, Andrew and Nagappan, Meiyappan}, title = {Do Bugs Foreshadow Vulnerabilities? A Study of the Chromium Project}, journal = {2015 International Working Conference on Mining Software Repositories}, pages = {to appear}, award = { ACM Distinguished Paper Award, MSR 2015 Best Paper}, doi = {}, abstract = {As developers face ever-increasing pressure to engineer secure software, researchers are building an understanding of security-sensitive bugs (i.e. vulnerabilities). Research into min- ing software repositories has greatly increased our understanding of software quality via empirical study of bugs. However, con- ce",
  "content_length": 19275,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:27"
}