{
  "name": "Andy D. Pimentel",
  "homepage": "https://staff.fnwi.uva.nl/a.d.pimentel",
  "status": "success",
  "content": "Andy Pimentel Search Andy D. Pimentel Full Professor University of Amsterdam Biography Andy Pimentel chairs the Parallel Computing Systems (PCS) group within the Systems and Networking Lab at the Informatics Institute of the University of Amsterdam. The PCS group performs research on the design, programming and run-time management of multi-core and multi-processor computer systems. The modeling, analysis and optimization of the extra-functional aspects of these systems, such as performance, power/energy consumption and system dependability but also the degree of productivity to design and program these systems, play a pivotal role in our work. Interests Multi-core embedded systems System-level design, modeling and simulation Design space exploration Performance and power analysis System dependability Hardware/software co-design Run-time resource management Edge AI Education PhD in Computer Science, 1998 University of Amsterdam MSc in Computer Science, 1993 University of Amsterdam News The paper ‘MaCP: Minimal yet Mighty Adaptation via Hierarchical Cosine Projection’ was accepted at ACL 2025. The paper ‘Early-Exit DNN Inference on HMPSoCs’ was accepted at IEEE EDGE ‘25. The paper ‘CompDSE: A Methodology for Design Space Exploration of Computing Subsystems within Complex Cyber-Physical Systems’ was accepted for publication in IET Cyber-Physical Systems: Theory & Applications. The paper ‘Rethinking Computing Systems in the Era of Climate Crisis: A Call for a Sustainable Computing Continuum’ was accepted for publication in IEEE Internet Computing. I received IEEE CEDA Outstanding Service Recognition Award and DATE Fellow Award at DATE 2025. The paper ‘Empowering Sustainability: Energy Labeling of Digital Services Using Simulation’ was accepted as a short paper at CCGrid 2025. NWO Knowledge and Innovation Covenant (KIC) project on ‘Improved Secure Semiconductor Evaluation (ISSE): From Lab Techniques to Legal Frameworks’ granted. The paper ‘Energy-Efficient QoS-Aware Scheduling for S-NUCA Many-Cores’ was accepted at ISQED 2025. The paper ‘SSH: Sparse Spectrum Adaptation via Discrete Hartley Transformation’ was accepted at NAACL 2025. The paper ‘PEIR: Modeling Performance in Neural Information Retrieval’ was accepted at ECIR 2025. Two journal articles about robust, distributed deep learning were published: “EASTER: Learning to Split Transformers at the Edge Robustly”, in IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems and “Model and System Robustness in Distributed CNN Inference at the Edge”, in Integration, the VLSI Journal. Selected Publications Click here for a full list of publications X. Guo, Q. Jiang, Y. Shen, A. D. Pimentel, T. Stefanov (2024). EASTER: Learning to Split Transformers at the Edge Robustly. In IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (IEEE TCAD), Vol. 43 (Nr. 11), 2024. PDF E. Aghapour, D. Sapra, A. D. Pimentel, A. Pathania (2024). ARM-CO-UP: ARM COoperative Utilization of Processors. In ACM Transactions on Design Automation of Electronic Systems (ACM TODAES), Vol. 29 (Nr. 5), 2024. PDF T. Meuser, L. Loven, M. Bhuyan, S. G. Patil, S. Dustdar, A. Aral, S. Bayhan, C. Becker, E. Lara, A. Ding, J. Edinger, J. Gross, N. Mohan, A. D. Pimentel, E. Riviere, H. Schulzrinne, P. Simoens, G. Solmaz, M. Welz (2024). Revisiting Edge AI: Opportunities and Challenges. In IEEE Internet Computing, Vol. 24 (Nr. 4), 2024. PDF Y. Shen, L. Schreuders, A. Pathania, A. D. Pimentel (2023). Thermal Management for 3D-Stacked Systems via Unified Core-Memory Power Regulation. In ACM Transactions on Embedded Computing Systems (ACM TECS), Vol. 22 (Nr. 5s), 2023. PDF X. Guo, A. D. Pimentel, T. Stefanov (2023). Automated Exploration and Implementation of Distributed CNN Inference at the Edge. In IEEE Internet of Things Journal, Vol. 10 (Nr. 7), 2023. PDF S. Minakova, D. Sapra, T. Stefanov, A. D. Pimentel (2022). Scenario Based Run-time Switching for Adaptive CNN-based Applications at the Edge. In ACM Transactions on Embedded Computing Systems (ACM TECS), Vol. 21 (nr. 2). PDF D. Sapra, A.D. Pimentel (2021). Designing Convolutional Neural Networks with Constrained Evolutionary Piecemeal Training. In Applied Intelligence, 2021. PDF J. Xiao, S. Altmeyer, A.D. Pimentel (2020). Schedulability Analysis of Global Scheduling for Multicore Systems with Shared Caches. In IEEE Transactions on Computers, pp. 1487-1499, Vol. 69 (No. 10). PDF A.D. Pimentel (2017). Exploring Exploration: A Tutorial Introduction to Embedded Systems Design Space Exploration. In IEEE Design & Test, Vol. 34 (Nr. 1). PDF W. Quan, A.D. Pimentel (2015). A Hybrid Task Mapping Algorithm for Heterogeneous MPSoCs. In ACM Transactions on Embedded Computing Systems (ACM TECS), Vol. 14 (nr. 1). PDF Z.J. Jia, T. Bautista, A. Nunez, M. Thompson, A.D. Pimentel (2013). A System-level Infrastructure for Multi-dimensional MP-SoC Design Space Co-exploration. In ACM Transactions on Embedded Computing Systems (ACM TECS), Vol. 13 (Nr. 1s). PDF P. van Stralen, A.D. Pimentel (2013). Fitness Prediction Techniques for Scenario-based Design Space Exploration. In IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (IEEE TCAD), pp. 1240-1253, Vol. 32 (Nr. 8). PDF A. Gerstlauer, C. Haubelt, A.D. Pimentel, T. Stefanov, D.D. Gajski, J. Teich (2009). Electronic System-Level Synthesis Methodologies. In IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (IEEE TCAD), pp. 1517-1530, Vol. 28 (No. 10). PDF C. Erbas, S. Cerav-Erbas, A.D. Pimentel (2006). Multiobjective Optimization and Evolutionary Algorithms for the Application Mapping Problem in Multiprocessor System-on-Chip Design. In IEEE Transactions on Evolutionary Computation, pp. 358-374, Vol. 10 (No. 3). PDF A.D. Pimentel, C. Erbas, S. Polstra (2006). A Systematic Approach to Exploring Embedded System Architectures at Multiple Abstraction Levels. In IEEE Transactions on Computers, pp. 99-112, Vol. 55 (No. 2). PDF A. D. Pimentel, P. Lieverse, P. van der Wolf, L.O. Hertzberger, E.F. Deprettere (2001). Exploring Embedded-Systems Architectures with Artemis. In IEEE Computer, pp. 57-63, Vol. 34 (No. 11). PDF Activities (selected) Chair of the Board, Advanced School for Computing and Imaging (ASCI), 2021-present Board member, ICT Research Platform Nederland (IPN), 2020-present Vice General Chair, IEEE/ACM Embedded Systems Week, 2025 General Chair, IEEE/ACM Embedded Systems Week, 2026 General Chair, Design Automation and Test in Europe (DATE), 2024 Vice General Chair, Design Automation and Test in Europe (DATE), 2023 Co-founder and Steering Committee member, Int. Conference on Embedded Computer Systems: Architectures, MOdeling, and Simulation (SAMOS), 2001–present Finance Chair, IEEE/ACM Embedded Systems Week, 2019 and 2020 Program Chair, IEEE/ACM International Conference on Hardware/Software Codesign and System Synthesis (CODES+ISSS), 2016 and 2017 Local Arrangements Chair, Embedded Systems Week (ESWeek), 2015 General Chair, 10th Int. Conference on High-Performance and Embedded Architectures and Compilers (HiPEAC), 2015 Topic Chair, Design Automation and Test in Europe (DATE), 2011-2016 General Chair, 11th Int. Conference on Systems, Architectures, Modeling, and Simulation (SAMOS), 2011 General Chair, IEEE Workshop on Embedded Systems for Real-Time Multimedia (ESTIMedia), 2010 Program Chair, IEEE Workshop on Embedded Systems for Real-Time Multimedia (ESTIMedia), 2008 and 2009 TPC member of DAC, DATE, CODES+ISSS, ICCAD, ICCD, SAMOS, FPL, ESTIMedia, SCOPES, SAC, and more Teaching * All BSc level MSc level Graduation projects Architecture and Computer Organization BSc level course Embedded Software and Systems MSc level course Multi-core Processor Systems MSc level course Graduation Projects BSc and MSc level Personal I am a serious amateur photographer. If you're interested, please have a look at a small portfolio of my work. I like to combine my above hobby (photography) with traveling all around the world. Contact a.d.pimentel@uva.nl P.O. Box 94323, 1098 XH, Amsterdam, The Netherlands Visiting address: LAB42, Room L5.41, Science Park 900, 1098 XH, Amsterdam adpimentel Cite × Copy Download",
  "content_length": 8223,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:25"
}