{
  "name": "Ang Chen 0001",
  "homepage": "https://web.eecs.umich.edu/~chenang",
  "status": "success",
  "content": "Ang Chen Ang Chen Associate Professor Computer Science and Engineering University of Michigan Office: 4753 Beyster building E-mail: chenang (at) umich (dot) edu Research | Teaching | Group | Publications | Service | Grants Research My work focuses on systems, networking, and security. I'm particularly drawn to problems that require a cross-disciplinary approach and produce a practical impact. Our current projects include the following: Digital transformation: A new project where we are building a computing stack to manage large infrastructures (e.g., datacenters, power grids, and water systems) and their \"nexuses\" for resilience. See our vision statement to appear at CACM as an Op-Ed article. Cloud management: We believe cloud management is an increasingly important research challenge, especially in a declarative (i.e., Infrastructure-as-Code/IaC) manner; our vison paper argues for an AIOps-based approach to management. We've curated an IaC dataset and benchmark, and developed systems for generating IaC checks, cloud program lifting, and debugging IaC updates. Runtime programmable networks: The goal is to make end-to-end network infrastructure, vertically from the host kernels to the NICs, and horizontally extending across switches to the other end of the network, runtime reprogrammable on-the-fly without packet loss, and with strong consistency guarantees. See our vision paper, joint talk, the runtime programmable switch project which implements runtime reconfiguration for silicon switch ASICs, performance optimization of SmartNICs, a program synthesis tool that generates runtime update plans, our $3M NSF Large project. Also see NVIDIA's hightlight on these projects in a HotChips'23 talk. Programmable in-network security: Our vision is to transform a programmable network into a \"programmable defense infrastructure,\" which supports security as naturally as it does routing. In this design, a switch not only forwards traffic, but also applies to it a wide range of defenses. The network not only routes traffic end-to-end, but also swaps defenses along the paths in and out as needed to mitigate attacks. Recent projects include: Poise, NetWarden, Ripple, P4wn, Bedrock, RDMI, NetShuffle, SpotProxy, Older projects: ML for systems software: Systems software (e.g., OS kernels) needs to support different applications and multiplex different types of hardware platforms; no one-size-fits-all optimizations exist. Neural networks are effective at generalizing to unseen scenarios, but their blackbox nature is a poor fit for low-level systems software, which must make safety-critical decisions. In this project, we are pursuing two approaches: a) creating systems-level mechanisms that are constrained by symbolic logic while making them reconfigurable with learning-derived policies, and b) applying learning to analyze systems-level code to identify optimization opportunities. See examples at this paper and the Clara project. Causality in distributed systems: Diagnosing problems in large systems has always been a challenging problem due to their complexity. Our project uses data provenance to track causal relationships between system states and their changes. It further uses them to enable automated reasoning for fault diagnosis, repair, and prevention, e.g., using a Datalog-like logical model. See the individual projects: Spidermon, CloudCanary, Zeno, DiffProv, SPP, MetaProv. Infrastructure optimizations for data-intensive systems: This project aims at a tighter vertical integration between data-intensive systems and the cloud infrastructure to improve their performance, by whole-stack optimizations from the network layer to the OS, and to distributed frameworks and the applications themselves. One overarching theme for these optimizations is to reconfigure or rearchitect various parts of the infrastructure for data-intensive workloads, as further informed by modern hardware technologies available in the cloud. Projects include: DDCs, GraphRex, Contra, Lightning, TELEPORT, RDC. Group Current PhD students: Patrick Kon (2021-) Archit Bhatnagar (2024-) Runyu Lu (2024-) w/ Mosharaf Chowdhury Mushtari Sadia (2024-) w/ Amrita Roy Chowdhury Zhenning Yang (2024-) Current postdoc: Yibo Huang Postdoc+ PhD Alumni: Yiming Qiu (PhD 2020-2024, Postdoc 2025 Spring w/ Sylvia Ratnasamy), Assistant Professor at the University of Hong Kong Yunming Xiao (Postdoc 2024-2025), Assistant Professor at Chinese University of Hong Kong, Shenzhen Jiarong Xing (PhD 2018-2023), Assistant Professor at Rice University Kuo-Feng Hsu (PhD 2017-2022), Research Scientist at Meta/Facebook Diogo Barradas (Postdoc 2021 Fall), Assistant Professor at University of Waterloo Service Program Committee: Oakland 2026, ASPLOS 2026 (ERC), OSDI 2025, NSDI 2025, CCS 2025, Oakland 2025, HotNets 2024, Oakland 2024, EuroSys 2024, PoPETS 2024, APNet 2024, CCS 2023, NSDI 2023, Oakland 2023, SIGCOMM 2022, CCS 2022, APSys 2022, NSDI 2021, CoNEXT 2021, SOSR 2021, ICNP 2021, ICDCS 2018, NDSS 2018, CIKM 2017 Program Co-chair: NeTS Early Investigator Workshop 2021, SIGCOMM SPIN'20 Teaching I teach the following courses on a regular basis: Introduction to Computer Security: 2024 Fall Computer and Network Security: 2024 Winter Advanced Distributed Systems: 2023 Fall Introduction to Computer Systems: 2022 Fall Secure and Cloud Computing: 2018-2021 Fall, 2023 Spring Advanced Topics in Distributed Systems: 2018-2022 Spring",
  "content_length": 5440,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:29"
}