{
  "name": "Angelos Dennis Keromytis",
  "homepage": "https://angelosk.github.io",
  "status": "success",
  "content": "Angelos Keromytis' Home Page Since August 2018, I have been the John H. Weitnauer Technology Transfer Endowed Chair Professor and Georgia Research Alliance Eminent Scholar with the School of Electrical and Computer Engineering at the Georgia Institute of Technology, in Atlanta, GA. My research interests include systems and network security and applied cryptography. I am also an ACM Fellow, with the citation \"for contributions to the theory and practice of systems and network security\", and an IEEE Fellow in the Class of 2018, with the citation \"for contributions to network security systems\". In 2012, I was elected ACM Distinguished Scientist. I received my Ph.D. in Computer Science from the University of Pennsylvania in 2001. From July 2014 to December 2018, I served as Program Manager with the Information Innovation Office (I2O) at the Defense Advanced Research Projects Agency (DARPA), part of the Department of Defense. For conceiving, launching, and managing several new programs I received the DARPA Superior Public Service Medal. The Transparent Computing (TC) program aims to make currently opaque computing systems transparent by providing high-fidelity visibility into component interactions during system operation across all layers of software abstraction, while imposing minimal performance overhead. The Leveraging the Analog Domain for Security (LADS) program will develop new cybersecurity capabilities by exploring the intersection of the analog and digital domains, motivated by advances in side channel analysis techniques. The initial focus of the program will be on embedded and low-resource devices such as Internet of Things (IoT) sensors. The Enhanced Attribution (EA) program seeks to provide high-fidelity visibility into all aspects of malicious cyber operator actions and to increase the government's ability to publicly reveal the actions of such individuals without damaging sources and methods. The program will develop techniques and tools for generating operationally and tactically relevant information about multiple concurrent independent malicious cyber campaigns, each involving several operators, and the means to share such information with any of a number of interested parties. The Warfighter Analytics using Smartphones for Health (WASH) program will enable novel algorithms for conducting passive, continuous, real-time health and mission-readiness assessment of warfighters using data collected from cellphone sensors. The goals of the program are to identify known indicators of health disorders, detect deviations from the warfighter's micro-behaviors that would indicate undetected issues, and identify new digital biomarkers for physiological problems. The Harnessing Autonomy for Countering Cyberadversary Systems (HACCS) program will investigate the feasibility of creating safe and reliable autonomous software agents that can effectively and at scale counter the various types of malicious botnet implants and similar large-scale malware in compromised devices and networks. While at DARPA, I also managed the Active Authentication (AA), Active Cyber Defense (ACD), Anomaly Detection at Multiple Scales (ADAMS), and Computer Science Study Group (CSSG) programs. From July 2013 to July 2014, I served as Program Director with the National Science Foundation (NSF), in the Computer and Network Systems (CNS) Division, Directorate for Computer & information Science & Engineering (CISE). My primary responsibility was with the Secure and Trustworthy Cyberspace (SaTC) program, which is the primary NSF source of funding for academic research in cybersecurity across the nation. With colleagues from the SBE and ENG Directorates, I helped create the Resilient Interdependent Infrastructure Processes and Systems (RIPS) program, which seeks to enhance the understanding and design of interdependent critical infrastructure systems (ICIs) and processes that provide essential goods and services despite disruptions and failures from any cause, natural, technological, or malicious. I also led the creation of the NSF/Intel Partnership on Cyber-Physical Systems Security and Privacy (CPS-Security) program, which seeks to foster a research community committed to advancing research and education at the confluence of cybersecurity, privacy, and cyber-physical systems, and to transitioning its findings into engineering practice. I was also involved in the Secure, Trustworthy, Assured and Resilient Semiconductors and Systems (SaTC: STARSS) track, which represented a joint partnership between NSF and the Semiconductor Research Corporation (SRC) that supports research on new strategies for architecture, specification and verification, especially at the stages of design in which formal methods are currently weak or absent, with the aim of decreasing the likelihood of unintended behavior or access, increasing resistance and resilience to tampering, and improving the ability to provide authentication throughout the supply chain and in the field. From 2001 to 2017, I was Associate Professor and Director of the Network Security Lab in the Computer Science department at Columbia University. During my time at Columbia, I led a number of projects. Some of these were: GRIDLOCK, which proposed the notion of Virtual Private Services as an abstraction for managing the access control policies for distributed, composable networked resources; SOS, its web-oriented variant WebSOS, and MOVE, an overlay-based system for mitigating network denial of service attacks; Autonomic Software Patching, a system for automatically generating software patches based on observed attacks; Instruction Set Randomization, a general mechanism for denying execution of unauthorized (e.g., injected) code in a program or system (our CCS 2003 paper was awarded the Test of Time Award in 2013); ASSURE, a system that introduces rescue points to recover software from unknown faults, while maintaining both system integrity and availability, by mimicking system behavior under known error conditions; Elastic Block Ciphers, a black-box block cipher design methodology that offers increased use flexibility while providing the same security guarantees as the underlying cipher; BARTER, a behavior-based network access control system; FlowOS, a new operating system architecture that removes the memory and CPU from the data path, enabling the OS kernel to perform data-flow management while applications operate purely at the signaling level; and D-NAD and P2P-IDS, which represent different explorations of the space of distributed anomaly and intrusion detection. During my 2009 sabbatical leave, I educated myself on Voice over IP security (eventually producing a comprehensive survey), and helped analyze rogue anti-virus software campaigns. In the distant past, I worked on Active Networks, the predecessor to what is now called Software Defined Networks (SDN). Active Networks explored the idea of allowing routing elements to be extensively and securely programmed, thus enabling optimizations and extensions of current protocols as well as the development of fundamentally new protocols. At the same time, I co-developed the KeyNote trust-management system, which is a widely used and cited decentralized access control mechanism used in a variety of tasks, including network-layer access control, distributed file systems, offline micro-payments, MANET security, network QoS, distributed firewalls, and the STRONGMAN access control management system. I also designed and implemented a large part of a high-performance and full-functionality open-source IPsec stack (which is still in use as part of the OpenBSD project). This included a new kernel architecture for hardware-accelerated cryptography and firewall functionality. I had a part in developing a secure bootstrap architecture. I was also an active participant in the IETF (Internet Engineering Task Force), and in particular the IPsec and IPSP Working Groups. My recent and current research projects include software hardening, system self-healing, high-performance dynamic information flow tracking, clean-slate system design, cloud security, information/network/system deception, virtual private social networks, auditable cloud services, and private information retrieval. An up to date CV, including a complete list of publications, can be found here. Useful/Interesting Links \"Networking on the network\"a must-read for all Ph.D. students \"Why You Should ChooseMath in High School\" \"Social Processes and Proofsof Theorems and Programs\" Copyright © 2001-2024 Angelos D. Keromytis",
  "content_length": 8589,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:35"
}