{
  "name": "Angelique Taylor [Tech]",
  "homepage": "https://www.angeliquemtaylor.com",
  "status": "success",
  "content": "Home | Angelique top of pageI amAngeliqueTayloR,Ph.d.ABOUT ME!Angelique Taylor, Ph.D. Andrew H. and Ann R. Tisch Assistant Professor, Cornell Tech Information Science Department, Field membership in Computer Science Department of Emergency Medicine, Weill Cornell Medicine Health Tech Hub, Cornell Tech ​​​ I direct the Artificial Intelligence & Robotics Lab (AIRLab), which focuses on research in the field of human-robot interaction (HRI). My research is at the intersection of robotics, computer vision, and artificial intelligence. AIRLab research lab designs intelligent systems that work alongside groups of people in real-world, safety-critical environments. These systems are realized through community engagement with stakeholders to develop robot vision and planning algorithms, and augmented reality systems that support multi-user interactions. I received my PhD from UC San Diego, advised by Laurel Riek. I have received funding from the NSF Foundation Robotics Research program, Google Award for Inclusion Research, NSF GRFP, Microsoft Dissertation Award, the Google Anita Borg Memorial Fellowship, the Arthur J. Schmitt Presidential Fellowship, a GEM Fellowship, and an award from the National Center for Women in Information Technology (NCWIT). Awards include Cornell Community-Engaged Practice & Innovation Award, Best Paper Honorable Mention at CSCW 2019, and Best Paper Award at HRI 2022. ​​ Visiting Research Scientist, Meta Reality Labs Research, (2021-22) Ph.D. Computer Science and Engineering, UC San Diego (2021) B.S. in Electrical Engineering, University of Missouri-Columbia (2015) B.S. in Computer Engineering, University of Missouri-Columbia (2015) A.S. in Engineering Science, Saint Louis Community College (2012) Teaching ​​ [Spring 2025] Practical Applications in Machine Learning, Cornell Tech [Fall 2024] Introduction to Human-Robot Interaction, Cornell Tech [Spring 2024] Practical Applications in Machine Learning, Cornell Tech [Spring 2023] Practical Applications in Machine Learning, Cornell Tech [Fall 2022] Introduction to Human-Robot Interaction, Cornell TechAIRLab AIRLab Recruitment: I am always looking for bright and motivated students and scholars with design, health sciences, robotics, engineering, machine learning, and/or computer and information science backgrounds to join the lab. ​ If you are an interested prospective PhD student, include my name on your Cornell PhD application. ​ Master's are encouraged to contact PhD students in the lab to seek collaborative research opportunities.​ ​ I may not reply to direct email requests. Apply online for inquiries on open positions.Apply Online AboutRECENT NEWS[Nov 2023]: featured in the press titled, ‘Angelique Taylor Receives the Google Inclusion Research Award’[March 2024]: Won Best paper award at HRI 2024! [July 2022]: Review published in Issues in science and Technology[July 2024]: featured in the press titled, ‘Expanding Pathways into Tech: Angelique Taylor’s Journey’RECENT NEWS202420242022 202320232023 2023[May 2023]: speaker at Data-Driven Urban Tech: How Machine Learning and Optimization Addresses Today’s Urban Challenges[Nov 2023]: Won Google award for inclusion research 2023[May 2023]: Speaker at The Center for Health Design Journal Club [april 2023]: Guest Lecturer, Introduction to HRI Course,  University of VirginiaPUBLICATIONSTaylor, A., Tanjim, T., Sack, M., Hirsch, M., Cheng, K., Ching, K., St. George, J., Roumen, T., Jung, M., Lee, H. (2025) Rapidly Built Medical Crash Cart! Lessons Learned and Impacts on High-Stakes Team Collaboration in the Emergency Room. In Proc. of the 20th Annual ACM/IEEE Conference on Human Robot Interaction (HRI) [Acceptance rate: <25%] [PDF][GitHub][Tutorial Video][Supplemental Material]Tran, N., Yang, E., Taylor, A., Davis, A. (2024) Personal Time-Lapse. UIST 2024: ACM Conference on User Interface Software and Technology [PDF][Project Page]Suresh, A., Taylor, A., Riek, L.D., Martínez S. (2023) Robot Navigation in Risky, Crowded Environments: Understanding Human Preferences IEEE Robotics and Automation Letters, pp. 1-8, 10.1109/LRA.2023.3290533Taylor, A., Murakami, M., Kim, S., Chu, R., and Riek, L.D. (2022) Hospitals of the Future: Designing Interactive Robotic Systems for Resilient Emergency Departments. In Proc. of the ACM Conference on Computer Supported Collaborative Work (CSCW) [Acceptance rate: <30%] [PDF][Design Catalog]Taylor, A. (2021) Human-Robot Teaming in Safety-Critical Environments: Perception of and Interaction with Groups. University of California, San Diego [PDF]Taylor, A., Tanjim, T., Cao, H., Nicoly, J., Segal, J. George, J., Kim, S., Ching, K., Ortega, F., Lee, H.R. (2025) Co-Designing Augmented Reality Tools for High-Stakes Clinical Teamwork. arXiv.2502.17295[PDF]Carlsen, P.A., Taylor, A. Chan, D.M., Uddin, M.Z., Riek, L.D., Torresen, J. (2024) Real-Time Person Re-Identification to Improve Human-Robot Interaction. In Proc. of the IEEE International Conference on Real-time Computing and Robotics [PDF]Taylor, A., Tanjim, T., Cau, H, Lee, H. (2024) Towards Collaborative Crash Cart Robots that Support Clinical Teamwork. *Best Paper Nominee* In Proc. of the 19th Annual ACM/IEEE Conference on Human Robot Interaction (HRI). [Acceptance rate: 24.9%][PDF][Catalog]Taylor, A. (2022) AI Designed With Humans in Mind. Issues in Science and Technology. 38, no. 4, 93–95.Taylor, A. and Riek, L.D. (2022) REGROUP: A Robot-Centric Group Detection and Tracking System. *Best Paper Award* In Proc. of the 17th Annual ACM/IEEE Conference on Human Robot Interaction (HRI). [Acceptance rate: 24.8%] [PDF][GitHub][Video]Taylor, A., Matsumoto, S., Xiao, W., and Riek, L.D. (2021) Social Navigation for Mobile Robots in the Emergency Department. In Proc. of the IEEE International Conference on Robotics and Automation (ICRA), 2021. [Acceptance Rate: 48%] [PDF][Video][GitHub][Dataset]Taylor, A., matsumoto, s., and Riek, L.D. (2020) Situating Robots in the Emergency Department. AAAI Spring Symposium on Applied AI in Healthcare: Safety, Community, and the Environment,  2020. Taylor, A., Chan, D., and Riek, L.D. (2020) Robot-Centric Perception of Human Groups. ACM Transactions on Human-Robot Interaction (THRI), 2020. Taylor, A., Lee, H., Kubota, A., and Riek, L.D. (2019) Coordinating Clinical Teams: Using Robots to empower nurses to Stop the Line. *Best Paper Award Honorable mention (top 5% of submissions)* Computer Supported Cooperative Work (CSCW), 2019. [Acceptance Rate: 30%][Video]Taylor, A. and Riek, L.D. (2019) Group Perception Methods to Support Human-Robot Teaming Southern California Robotics Symposium (SCR).Taylor, A. and Riek, L.D. (2018). Robot-Centric Human Group Detection. In Proc. of Social Robots in the Wild, Workshop at the 13th Annual ACM/IEEE International Conference on Human-Robot Interaction (HRI), 2018.Chan, D., Taylor, A., and Riek, L.D. (2017) Faster Robot Perception Using Salient Depth Partitioning In Proc. of IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS).Taylor, A. and Riek, L.D. (2017) Robot Perception of Social Engagement Using Group Joint Action. In Proc. of the 7th Annual Joint Action Meeting (JAM).Taylor, A. and Riek, L.D. (2017) Robot Affiliation Perception for Social Interaction In Proc. of Robots in Groups and Teams Workshop at CSCW 2017. pp. 1-4. Taylor, A. and Riek, L.D. (2016) Robot Perception of Human Groups in the Real World: State of the Art In Proceedings of the AAAI Fall Symposium on Artificial Intelligence in Human-Robot Interaction (AI-HRI).Taylor, A., Du, X., Chen, C., Zare, A. (2014) Context Dependent Target Detection Computational Intelligence Society Poster Competition, University of Missouri, Columbia.Lobzhanidze, A., Gentry, P., Taylor, A., Zeng, W., (2013) Mainstream Media vs. Social Media for Trending Topic Prediction-An Experimental Study IEEE Consumer Communications and Networking Conference (CCNC).PUBLICATINSPROJECTSPROJECTS Hospitals of the Future: Designing Interactive Robotic Systems for Resilient Emergency DepartmentsThe Emergency Department (ED) is a stressful, safety-critical environment, which is overcrowded, noisy, chaotic, and understaffed. The built environment plays a key role in patient outcomes, experiences, and the mental health of healthcare workers (HCWs). However, once a space is built it is difficult to change it; so the modularity and adaptability of new technologies such as robots could potentially help stakeholders mitigate some of these challenges; yet, there is a lack of research in this area, particularly in the ED. In this paper, we address this gap by engaging HCWs in a research-through-design process, utilizing design fiction, to envision a future resilient ED.  Here, robots scurry along the ceiling, provide help at the bedside, and smart furniture and walls provide spaces for privacy and calm. We co-created design prototypes of future intelligent systems that can modify the built environment to support resilience, which we then used to co-create a Design Catalog with HCWs, which contains a collection of future technology prototypes contextualized within the ED. We found that HCWs envisioned many ways for intelligent systems to help them reimagine the built environment, including ways to enhance HCW-patient communication, improve patient experience, support both HCW and patient safety, and use reconfigurable spaces to support privacy. We hope our work inspires further exploration into using new technologies to reimagine and reconfigure the built environment to support resilient hospitals. [PDF][Design Catalog]UC San Diego takes part in RoboCup competition for the first timePlay VideoAngelique Taylor - Improving Human-Robot InteractionPlay VideoAll VideosWatch NowShareWhole ChannelThis VideoFacebookTwitterPinterestTumblrCopy LinkLink CopiedPRESS ​ RoboCup@Home2017 PRESSAngelique Taylor - Improving Human-Robot Interaction Expanding Pathways Into Tech: Angelique Taylor’s Journey 2024Angelique Taylor Receives the Google Inclus",
  "content_length": 10610,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:33"
}