{
  "name": "Angela Zavaleta Bernuy",
  "homepage": "https://angelazb.github.io",
  "status": "success",
  "content": "Angela's Page > About I am an Assistant Professor in the Department of Computing and Software at McMaster University. I recently completed my Ph.D. in Computer Science at the University of Toronto, supervised by ACM's Distinguished Professor Andrew Petersen. My research revolves around Computing Education and Human-Computer Interaction, with a primary focus on real-world experimentation and interdisciplinary collaboration. With the use of innovative methodologies such as A/B testing and adaptive interventions, I aim to learn more about students' experiences and behaviours within the computing education setting. Through responsible experimentation and data-driven analysis, my research ultimately strives to create more effective and engaging learning experiences for computing students. When I am not writing papers, conducting studies, or teaching, you can probably find me playing tennis, on twitter or building lego flowers. Education Doctor of Philosophy of Computer Science University of Toronto - June 2025 Master of Computer Science University of Toronto - January 2022 Honours Bachelor of Science Co-op Software Engineering and Mathematics University of Toronto - April 2020 Awards Best Paper Award ACM's SIGITE - September 2022 Undergraduate Research Award University of Toronto - April 2020 Publications and Talks You can find my most up-to-date list of publications in my Google Scholar page. This list has been last updated on: March 2024 Papers Angela Zavaleta Bernuy, Runlong Ye, Naaz Sibia, Rohita Nalluri, Joseph Jay Williams, Andrew Petersen, Eric Smith, Bogdan Simion, and Michael Liut. Student Interaction with Instructor Emails in Introductory and Upper-Year Computing Courses. In Proceedings of the 55th ACM Technical Symposium on Computer Science Education V. 1, 1477-1483 Naaz Sibia, Giang Bui, Bingcheng Wang, Yinyue Tan, Angela Zavaleta Bernuy, Christina Bauer, Joseph Jay Williams, Michael Liut, and Andrew Petersen. Examining Intention to Major in Computer Science: Perceived Potential and Challenges. In Proceedings of the 55th ACM Technical Symposium on Computer Science Education V. 1, 1237-1243 Angela Zavaleta Bernuy, Runlong Ye, Elexandra Tran, Naaz Sibia, Abhijoy Mandal, Hammad Shaikh, Bogdan Simion, Michael Liut, Andrew Petersen, and Joseph Jay Williams. Do Students Read Instructor Emails? A Case Study of Intervention Email Open Rates. In Proceedings of the 23rd Koli Calling International Conference on Computing Education Research. Angela Zavaleta Bernuy, Anna Ly, Brian Harrington, Michael Liut, Sadia Sharmin, Lisa Zhang, and Andrew Petersen. 2023. “I Am Not Enough”: Impostor Phenomenon Experiences of University Students. In Proceedings of the 2023 Conference on Innovation and Technology in Computer Science Education V. 1, 313–319. Naaz Sibia, Angela Zavaleta Bernuy, Joseph Jay Williams, Michael Liut, and Andrew Petersen. 2023. Student Usage of Q&A Forums: Signs of Discomfort? In Proceedings of the 2023 Conference on Innovation and Technology in Computer Science Education V. 1, 33–39. Barbara J Ericson, Janice L Pearce, Susan H Rodger, Andrew Csizmadia, Rita Garcia, Francisco J Gutierrez, Konstantinos Liaskos, Aadarsh Padiyath, Michael James Scott, David H Smith, Jayakrishnan Warriem, and Angela Zavaleta Bernuy. 2023. Conducting multi-institutional studies of Parsons problems. In Proceedings of the 2023 Conference on Innovation and Technology in Computer Science Education V. 2, 571–572. Mustafa Hafeez, Anand Karki, Yara Radwan, Anis Saha, and Angela Zavaleta Bernuy. 2023. Evaluating the Efficacy and Impacts of Remote Pair Programming for Introductory Computer Science Students. In Proceedings of the 25th Western Canadian Conference on Computing Education, 1–7. Mohi Reza, Angela Zavaleta Bernuy, Emmy Liu, Tong Li, Zhongyuan Liang, Calista K Barber, and Joseph Jay Williams. 2023. Exam Eustress: Designing Brief Online Interventions for Helping Students Identify Positive Aspects of Stress. In Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems, 1–13. Giang Bui, Naaz Sibia, Angela Zavaleta Bernuy, Michael Liut, and Andrew Petersen. 2023. Prior Programming Experience: A Persistent Performance Gap in CS1 and CS2. In Proceedings of the 54th ACM Technical Symposium on Computer Science Education V. 1, 889–895. Fernando J. Yanez, Angela Zavaleta Bernuy, Ziwen Han, Michael Liut, Anna Rafferty, and Joseph Jay Williams. 2022. Increasing Students’ Engagement to Reminder Emails Through Multi-Armed Bandits. In CSEDM `22: Proceedings of the 6th Educational Data Mining in Computer Science Education Workshop, Durham, UK, July 27, 2022 Runlong Ye, Pan Chen, Yini Mao, Angela Wang-Lin, Hammad Shaikh, Angela Zavaleta Bernuy, and Joseph Jay Williams. 2022. Behavioral Consequences of Reminder Emails on Students’ Academic Performance: a Real-world Deployment. In Proceedings of the 23rd Annual Conference on Information Technology Education, 16–22. Best Paper Award Angela Zavaleta Bernuy, Ziwen Han, Hammad Shaikh, Qi Yin Zheng, Lisa-Angelique Lim, Anna Rafferty, Andrew Petersen, and Joseph Jay Williams. 2022. How can Email Interventions Increase Students’ Completion of Online Homework? A Case Study Using A/B Comparisons. In LAK22: 12th International Learning Analytics and Knowledge Conference, 107–118. Angela Zavaleta Bernuy, Anna Ly, Brian Harrington, Michael Liut, Andrew Petersen, Sadia Sharmin, and Lisa Zhang. 2022. Additional Evidence for the Prevalence of the Impostor Phenomenon in Computing. In Proceedings of the 53rd ACM Technical Symposium on Computer Science Education-Volume 1, 654–660. Angela Zavaleta Bernuy, Qi Yin Zheng, Hammad Shaikh, Andrew Petersen, and Joseph Jay Williams. 2021. Investigating the Impact of Online Homework Reminders Using Randomized A/B Comparisons. In Proceedings of the 52nd ACM Technical Symposium on Computer Science Education, 921–927. Angela Zavaleta-Bernuy, Qi Yin Zheng, Hammad Shaikh, Jacob Nogas, Anna Rafferty, Andrew Petersen, and Joseph Jay Williams. 2021. Using Adaptive Experiments to Rapidly Help Students. In International Conference on Artificial Intelligence in Education, Springer International Publishing Cham, 422–426. Angela Zavaleta Bernuy and Brian Harrington. 2020. What are we asking our students? A literature map of student surveys in computer science education. In Proceedings of the 2020 ACM Conference on Innovation and Technology in Computer Science Education, 418–424. Angela M Zavaleta Bernuy and Brian Harrington. 2020. Developing Testing-First Labs For a Less Intimidating Introductory CS Experience. In Psychology of Programming Interest Group (PPIG), 66–74. Posters Angela Zavaleta Bernuy, Jessica Jia-Ni Xu, Naaz Sibia, Joseph Jay Williams, Andrew Petersen, and Michael Liut. 2023. Self-Explanation Modality: Effects on Student Performance? In Proceedings of the 2023 Conference on Innovation and Technology in Computer Science Education V. 2, 641–641. Angela Zavaleta Bernuy, Naaz Sibia, Pan Chen, Chloe Huang, Andrew Petersen, Joseph Jay Williams, and Michael Liut. 2023. VoiceEx: Voice Submission System for Interventions in Education. In Proceedings of the 2023 Conference on Innovation and Technology in Computer Science Education V. 2, 585–586. Giang Bui, Bingcheng Wang, Naaz Sibia, Angela Zavaleta Bernuy, and Andrew Petersen. 2023. Differences in Intention to Major in Computing Across CS1. In Proceedings of the 54th ACM Technical Symposium on Computer Science Education V. 2, 1326–1326. hafeez2023evaluating Ilya Musabirov, Angela Zavaleta Bernuy, Michael Liut, and Joseph Jay Williams. 2023. A Case Study in Opportunities for Adaptive Experiments to Enable Rapid Continuous Improvement. In Proceedings of the 54th ACM Technical Symposium on Computer Science Education V. 2, 1279–1279. Elexandra Tran, Angela Zavaleta Bernuy, Bogdan Simion, Michael Liut, Andrew Petersen, and Joseph Jay Williams. 2023. Investigating Subject Lines Length on Students’ Email Open Rates. In Proceedings of the 54th ACM Technical Symposium on Computer Science Education V. 2, 1363–1363. Pan Chen, Naaz Sibia, Angela Zavaleta Bernuy, Michael Liut, and Joseph Jay Williams. 2022. Investigating the Impact of Voice Response Options in Surveys. In Proceedings of the 53rd ACM Technical Symposium on Computer Science Education V. 2, 1124–1124. Rachel D’souza, Angela Zavaleta Bernuy, and Brian Harrington. 2021. PyBuggy: Testing the Effects of Enhanced Error Messages on Novice Programmers. In Proceedings of the 52nd ACM Technical Symposium on Computer Science Education, 1346–1346. Angela M Zavaleta Bernuy. 2020. What are We Asking our Students? In Proceedings of the 51st ACM Technical Symposium on Computer Science Education, 1424–1424. Workshops & Talks Joseph Jay Williams, Nathan Laundry, Ilya Musabirov, Angela Zavaleta Bernuy, and Michael Liut. 2023. Designing, Deploying, and Analyzing Adaptive Educational Field Experiments. In Proceedings of the 54th ACM Technical Symposium on Computer Science Education V. 2, 1179–1179. Angela Zavaleta Bernuy, Qi Yin Zheng, Hammad Shaikh, Qi Yin Zheng, and Joseph Jay Williams. 2020. Messaging interventions to mitigate procrastination in online courses. In Computing Research Association Virtual Conference. Angela Zavaleta Bernuy. 2019. What are We Asking our Students?. In Proceedings of the 11th ACM International Conference on International Computing Education Research. TA Tutorial Notes Here are some helpful notes from the courses I am or have been a TA at UofT. Enjoy! Updated June 2025. Copyright © 2019. Made with Bootstrap's Freelancer template. Introduction to Computer Science II Abstract data types and data structures for implementing them. Linked data structures. Object Oriented Programming. Encapsulation and information-hiding. Testing. Specifications. Analyzing the efficiency of programs. Recursion. Tutorial Notes Fall 2020 (Updated weekly) Tutorial Notes Summer 2020 Tutorial Notes Winter 2020 Tutorial Code Winter 2020 Close Window Computer Organization Princi",
  "content_length": 12997,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:32"
}