{
  "name": "Angeliki Katsenou",
  "homepage": "https://angkats.github.io",
  "status": "success",
  "content": "Angeliki's Profile Dr Angeliki Katsenou Senior Lecturer in Networked Media Bristol Digital Futures Institute MyWorld University of Bristol, UK angeliki.katsenou at bristol.ac.uk About I am currently a Senior Lecturer in Networked Media at University of Bristol, UK. I am affiliated with Bristol Digital Futures Institute - BDFI led by Prof Dimitra Simeonidou and MyWorld Programme led by Prof David R. Bull. I am currently teaching Advanced Visual AI in Computer Science. My first teaching position was at Trinity College Dublin, IE, as an Assistant Professor and I was affiliated with the Sigmedia group led by Prof Anil Kokaram. I was teaching Motion Pictures Engineering and Computational Methods to MSc and 5th year students. My post-doctoral research was conducted in University of Bristol. I started my post-doc years at Visual Information Laboratory, led by Prof David R. Bull, within the Department of Electrical and Electronic Engineering, University of Bristol, UK. as an Experienced Marie-Sklodowska Curie Fellow in 2015. In 2018, I was awarded an Early-Career Leverhulme Fellowship and was promoted to Senior Research Fellow. I received my Ph.D. in July 2014 from the Department of Computer Science and Engineering, University of Ioannina, Greece, under the guidance of Prof Lisimachos P. Kondi. I have been involved in the organisation of international events and conferences. Most recent activities include leading the bid to host PCS 2021 in Bristol and serving as Technical Programme Chair for it, organising a Grand Challenge in IEEE ICME 2020 and IEEE ICIP 2017, Publicity Chair for PCS 2018, and more. My main research interests include topics around the media communications pipeline: acquisition, analysis, compression, and communication. Other side research activities include biomedical engineering applications such as personalised patient treatment, prognosis models for cancer using clinical, proteomics and other types of biomedical data. Research Areas Video Coding & Streaming Standard and Immersive (HDR/HFR/360°/Volumetric) video coding Optimisation of Video Encoding for Adaptive Streaming Creating Databases: BVI-CC, 4K-100, BVI-HomTex Content Understanding for Video Compression Sustainable Creative Technologies Energy Profiling of Video Production Workflows Design of Energy Efficient Video Technologies and Communication Reduced Complexity in Creative Technologies Visual Quality Assessment & Experience Subjective Assessment of Modern Video Codecs Content-specific design of metrics (pristine/UGC/transcoded/low-light content) Novel subjective quality assessment and experience tools and methods Perceptual Video Coding Content-aware compression Perceptually aligned parameter selection Rate quality optimisation News & Activities Sep 2024: Start serving as a Co-Director for the Bristol Vision Institute Jan 2024: Start serving as Associate Editor in IEEE TCSVT March 2023: Amazon Research Award for \"Generic Deep Video Quality Assessment in the Extended Parameter Space\" with Dr F. Zhang and Prof D. Bull Jan 2023: Start serving as Associate Editor in IEEE Transactions on Image Processing Nov 2022: Starting as Senior Lecturer in Networked Media at the University of Bristol, UK. Sep 2022: 5G Edge XR wins IBC 2022 Innovation Award. Projects 2023-2024 Connect the Unconnected in Nepal, Royal Academy of Engineeering, Frontiers Seedfund 2023-2024 Profiling the Energy Consumption for Video Streaming over 5G Networks, Bristol Digital Futures Institute, Seedcorn 2021-2023 Sustainable Video Communications, Bristol+Bath Creative Cluster, UKRI 2021-2022 5G Edge XR: Coding for Volumetric Content Delivery 2018-2021 Leverhulme Early-Career Fellowship: Deep Video Analysis and Compression 2017-2018 EPSRC Platform Grant: Video Texture Analysis 2015-2017 FP7 MSCA ITN: ProVision - Perceptual Video Compression Selected Research Outputs Decoding Complexity-Rate-Quality Pareto-Front for Adaptive VVC Streaming[paper] A. Katsenou, V. Menon, A. Wieckowski, B. Bross, and D. Marpe, IEEE International Conference on Visual Communications and Image Processing (VCIP), 2024. Rate-Quality or Energy-Quality Pareto Fronts for Adaptive Video Streaming?[paper] A. Katsenou, X. Wang, D. Schien, and D. Bull, IEEE International Conference on Image Processing (ICIP), 2024. Comparative Study of Hardware and Software Power Measurements in Video Compression[paper] A. Katsenou, X. Wang, D. Schien, and D. Bull, Picture Coding Symposium (PCS), 2024. Assessing the Carbon Reduction Potential for Video Streaming from Short-Term Coding Changes[paper] D. Schien, P. Shabajee, H. B. Akyol, L. Benson, and A. Katsenou, International Conference on Quality of Multimedia Experience (QoMEX), 2024. Subjective Assessment of the Impact of a Content Adaptive Optimiser for Compressing 4K HDR Content With AV1[paper] Vibhoothi, A. Katsenou, F. Pitié, K. Domijan and A. Kokaram, IEEE International Conference on Image Processing (ICIP), 2023. BVI-CC: A Dataset for Research on Video Compression and Quality Assessment [paper] [dataset] A. Katsenou, F.Zhang, M. Afonso, G. Dimitrov, and D. R. Bull, Frontiers Signal Processing, April, 2022. Energy-Rate-Quality Tradeoffs of State-of-the-Art Video Codecs [paper] A. Katsenou, J. Mao, and I. Mavromatis, Picture Coding Symposium, 2022. A CNN-based Post-Processor for Perceptually-Optimized Immersive Media Compression [paper] A. Katsenou, F. Zhang, and D. R. Bull, IEEE International Conference on Image Processing, 2022. Efficient Bitrate Ladder Construction for Content-Optimised Adaptive Video Streaming [paper] A. Katsenou, J. Sole, and D. R. Bull, IEEE Open Journal of Signal Processing, vol. 2, 2021. VMAF-based Bitrate Ladder Estimation for Adaptive Streaming [paper] A. Katsenou, F. Zhang, K. Swanson, M. Afonso, J. Sole and D. R. Bull, Picture Coding Symposium, 2021. Enhancing VMAF through New Feature Integration and Model Combination [paper] F. Zhang, A. Katsenou, C. Bampis, L. Krasula, Z. Li, and D. R. Bull, Picture Coding Symposium, 2021. For all papers and datasets see the links below: Google Scholar",
  "content_length": 6071,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:33"
}