{
  "name": "Angelos N. Rouskas",
  "homepage": "https://www.ds.unipi.gr/en/faculty/arouskas-en",
  "status": "success",
  "content": "Angelos Rouskas - Department of Digital Systems Skip to content Angelos Rouskas Phone +30 210-4142721 Email arouskas@unipi.gr Title Professor Office Hours Fall: Tuesday 15:00-17:00, Spring: Wednesday 12:00-14:00 Office 104 (150, Androutsou Str, Piraeus, 18532) wp_statistics_words_count 931 Courses Mobile and Personal Communication Networks — 8th semester Systems Simulation — 7th semester Internet Protocols — 6th semester Design and Optimization of Networks — 7th semester Brief CV Angelos Rouskas received the five-year Diploma in electrical engineering from the National Technical University of Athens (NTUA), the MS degree in communications and signal processing from Imperial College, London, and the PhD degree in electrical and computer engineering from NTUA. He is currently a Professor in the Department of Digital Systems, University of Piraeus, Greece, and has been a Lecturer, Assistant Professor and Director of the Computer and Communication Systems Laboratory in the Department Information and Communication Systems Engineering, University of the Aegean, Greece (2000-2009). During the last decade Dr Rouskas has been teaching many undergraduate and postgraduate courses on wireless networks, mobile communications and computer networking and has been involved in several Greek and European funded research projects, while in the past has been a member of the Network Design Department of the Greek Cellular Operator CosmOTE. Dr Rouskas was the TPC co-chair of the European Wireless 2006 Conference and has served as a TPC member in several international conferences. His main research interests are in the areas of next generation mobile and wireless communication networks. Publications Publications Publications 2015 – I) JOURNALS Efthymios Oikonomou and Angelos Rouskas, “Efficient Schemes for Optimizing Load Balancing and Communication Cost in Edge Computing Networks”, Special Issue Internet of Things and Cloud-Fog-Edge ComputingInformation 2024, MDPI, 15(11), 670; https://doi.org/10.3390/info15110670 Stefanos Plastras, Dimitrios Tsoumatidis, Dimitrios N. Skoutas, Angelos Rouskas, Georgios Kormentzas and Charalabos Skianis, “Non-Terrestrial Networks for Energy-Efficient Connectivity of Remote IoT Devices in the 6G Era: A Survey”, Special Issue Advances in Intelligent Sensors and IoT Solutions, MDPI Sensors 2024, 24(4), 1227; https://doi.org/10.3390/s24041227. George Kyriazis and Angelos Rouskas, “Joint Access and Backhaul Power Consumption Optimization in Heterogeneous Mobile Broadband Networks”, Journal of Green Engineering, River Publishers, doi: 10.13052/jge1904-4720.641, April 2017, https://riverpublishers.com/journal_read_html_article.php?j=JGE/6/4/1. Angelos Rouskas, George Kyriazis, and Dimitris Komnakos, “Green optimization schemes for mobile network design and operation”, Wireless Personal Communications, Springer, doi: 10.1007/s11277-017-4350-9, May 2017, http://link.springer.com/article/10.1007/s11277-017-4350-9. George Kyriazis and Angelos Rouskas, “Design and Operation of Energy Efficient Heterogeneous Mobile Networks”, Springer Wireless Networks, doi: 10.1007/s11276-015-1083-0, 2015. Pavlos Kosmides, Evgenia Adamopoulou, Konstantinos Demestichas, Michael Theologou, Miltiades Anagnostou, and Angelos Rouskas, “Socially Aware Heterogeneous Wireless Networks”, MDPI – Open Access Publishing, Sensors 2015, 15, pp 13705-13724, doi:10.3390/s150613705. II) CONFERENCES Efthymios Oikonomou, Angelos Rouskas, and Dimitrios N. Skoutas. “Adaptive Node Management in Edge Networks Under Time-Varying Workloads”, IEEE Virtual Conference on Communications (VCC) – Main Track, ΙΕΕΕ VCC 2024 Efthymios Oikonomou, Stefanos Plastras, Dimitrios Tsoumatidis, Dimitrios N. Skoutas, and Angelos Rouskas “Workload Prediction for Efficient Node Management in Mobile Edge Computing”, 2024 IFIP Networking Conference (IFIP Networking), Thessaloniki, Greece, June 2024. Efthymios Oikonomou and Angelos Rouskas, “Optimizing Load Balancing and Minimizing Communication Latency in Edge Networks”, 2024 IEEE 22nd Mediterranean Electrotechnical Conference (MELECON), Porto, Portugal, June 2024. Efthymios Oikonomou and Angelos Rouskas, “Selection of Service Nodes in Edge Computing Environments”,in the Proceedings of the 6th IEEE International Workshop on Mobile Cloud Computing systems, Management, and Security (MCSMS-2020) in conjunction with the 7th International Conference on Internet of Things: Systems, Management and Security (IOTSMS), Paris, France, Dec. 2020.  Best paper award among all workshops of the conference. Efthymios Oikonomou and Angelos Rouskas, “Optimized Cloudlet management in Edge Computing environment”, in the Proceedings of IEEE 23rd International Workshop on Computer Aided Modeling and Design of Communication Links and Networks (CAMAD), Barcelona, Spain, Sep. 2018. Georgios Kyriazis and Angelos Rouskas, “Energy Efficient Wireless In-Band Backhaul in Heterogeneous Networking Environments”, 7th Symposium on Green Networking and Computing (SGNC 2016) in conjunction with the 24th International Conference on Software, Telecommunications and Computer Networks (SoftCom 2016), Split, Croatia, Sep. 2016. Dimitris Kelaidonis, Vera Stavroulaki, Vassilis Foteinos, George Poulios, Kostas Petsas, Angelos Rouskas, Panagiotis Demestichas, Panagiotis Vlacheas, and Antonis Moustakos, “Self-Organizing Virtual Devices in the Internet of Things Networks”, 1st International Workshop on Self Organized Adaptive Communications (SOAComm2016) in conjunction with the 7th International Conference on Information, Intelligence, Systems and Applications, 13-15 July, 2016, Chalkidiki, Greece. Dimitris Kelaidonis, Angelos Rouskas, Panagiotis Vlacheas, Vera Stavroulaki, Panagiotis Demestichas, “A Federated Edge Cloud-IoT Architecture”, in Proc of European Conference on Networks and Communications 2016: Convergence with Emerging Concepts, Athens, June 2016. George T. Karetsos, Angelos Rouskas, and Fotis Foukalas, “Spectrum Efficient Network Selection in Heterogeneous Wireless Networking Environments”, International Conference ‘Science in Technology’ SCinTE 2015, Athens, November 5-7, 2015. George T. Karetsos, Angelos Rouskas, and Fotis Foukalas, “’Energy-efficient Traffic Bypassing in LTE HetNets with Mobile Relays”, in the Proceedings of the 11th IEEE International Conference on Wireless and Mobile Computing, Networking and Communications (IEEE WiMob 2015), 3rd International Workshop on the GReen Optimized Wireless Networks (GROWN 2015), 19 – 21 October 2015, Abu Dhabi. Dimitra Panagiotou, Efthymios Oikonomou, and Angelos Rouskas, “Energy-efficient Virtual Machine Provisioning Mechanism in Cloud Computing Environments”, in the Proceedings of the 19th Panhellenic Conference on Informatics, Athens, Greece, 1-3 October 2015, proceedings published in ACM International Conference Proceedings Series. Efthymios Oikonomou, Dimitra Panagiotou, and Angelos Rouskas, “Energy-aware Management of Virtual Machines in Cloud Data Centers”, in the Proceedings of the 2nd Workshop on Innovative European Policies and Applied Measures for Developing Smart Cities (IPMSC2015), in conjunction with the 16th EANN Engineering Applications of Neural Networks Conference, proceedings published in ACM International Conference Proceedings Series., Rhodes, Greece, Sep 2015. Pavlos Kosmides, Evgenia Adamopoulou, Konstantinos Demestichas, Miltiades Anagnostou, and Angelos Rouskas, “On Intelligent Base Station Activation for Next Generation Wireless Networks”, The 6th International Conference on Emerging Ubiquitous Systems and Pervasive Networks (EUSPN 2015), Elsevier Procedia Computer Science 63 (2015) pp. 82 – 88, Sep. 2015, Berlin. Georgios Kyriazis, Angelos Rouskas, and George Karetsos, “Energy-efficient Base Station Management in Heterogeneous Networking Environments”, in the Proceedings of the 20th IEEE Symposium on Computers and Communication (ISCC 2015), Larnaca, Cyprus, July 2015. Recent announcements 2nd Application Submission period for the M.Sc. Program “E-Learning” until Monday 16 June 2025 May 30, 2025 Call for Applications for the M.Sc. Program “Information Systems & Services” (Extended until 21/07/2025) May 30, 2025 Announcement of Extension for the Distribution of Textbooks May 30, 2025 Extension of the deadline for applications for free student meals for the Academic Year 2024-2025 until Wednesday 4 June 2025 May 28, 2025 Announcement of the MSc in “Health Services Organisation and Management – Health Informatics” for the Academic Year 2025 – 2026 May 27, 2025 Start of course/teaching evaluations for the spring semester 2024-2025 May 20, 2025 Searching for students for Internship May 12, 2025 Update on the Entrepreneurship & Career Panorama 2025 May 12, 2025 Useful LinksInstitute of Electrical and Electronics Engineers (IEEE) The British Computer Society (BCS) Workflow Management Coalition (WfMC) International Medical Informatics Association (IMIA) The American Medical Informatics Association (AMIA) European Federation For Medical Informatics (EFMI) Hellenic Society of Computer and Information Scientists and Professionals Evdoxos Alumni Site We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it.Ok",
  "content_length": 9296,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:38"
}