{
  "name": "Angela Finlayson",
  "homepage": "https://www.engineering.unsw.edu.au/computer-science-engineering/staff/angela-finlayson",
  "status": "success",
  "content": "Engineering | UNSW Sydney Skip to Main Content Type in a search term Search Follow Follow LinkedIn Facebook Instagram TikTok YouTube Engineering UNSW Engineering Fearless thinking. World changing action. Explore our stories Personalise Show filters Hide filters 1st in Australia QS World University Rankings 1st in Australia ARWU Shanghai Subject Rankings 1st in Australia Times Higher Education World University Rankings Enquire now Apply now Find a degree Technology for Humanity. Hear from our people about the impact of our Faculty and why we consistently remain the number one destination for study and collaboration. Latest news Trending topics Latest UNSW projects secure $3.3 million in ARC grants for infrastructure, equipment and facilities Nov 28, 2025 Engineering Science Arts, Design & Architecture (ADA) Division of Equity Diversity & Inclusion SDG SDG7 SDG9 SDG11 General Research Sustainability Prosperity How ‘digital twins’ could help prevent cyber-attacks on the food industry Nov 28, 2025 Engineering Division of Equity Diversity & Inclusion Science & Tech General Opinion Environments and systems Resilient society SDG SDG2 SDG3 SDG8 SDG9 SDG11 SDG12 $6 million boost for UNSW’s emerging researchers Nov 27, 2025 Engineering Science Medicine & Health Division of Equity Diversity & Inclusion General Science & Tech SDG SDG3 SDG7 SDG8 SDG9 SDG11 SDG13 Health Research Education Research Sustainability Prosperity Healthy lives Resilient society Aircraft noise from new runways will hit thousands more homes. Australia needs fairer solutions Nov 25, 2025 Engineering Division of Equity Diversity & Inclusion Science & Tech General Opinion Research Networks and partnerships Healthy lives Prosperity SDG SDG3 SDG9 SDG11 All news Our degrees Undergraduate Choose from a variety of undergraduate specialisations. Your career opportunities will be enhanced through our strong industry partnerships, industrial training program, real-world knowledge. Postgraduate Continue your study with our range of postgraduate specialisations, suitable for building a career in both Australia and overseas. Postgraduate research Take advantage of our top-level facilities to contribute new and significant knowledge within your chosen discipline. We offer the the Doctor of Philosophy (PhD) and the Master of Philosophy (MPhil). Research & impact Our research At UNSW Engineering, we hold the quality of our research to the highest academic standards addressing the global challenges facing society and delivering positive, real-world impact. Our researchers are part of strong, interdisciplinary teams driving creativity, innovation and industry transformation. Research centres & institutes Our world class research centres and institutes are developing strategies and technologies to help us overcome some of the key challenges facing society today. Explore our diverse research themes and see how our research is transforming the future, locally and internationally. Research grants & funding We are proud of our reputation as a leading research faculty. Our outstanding track-record of Australian Research Council (ARC) grants, as well as our funding from state and federal government bodies ensures our research makes an impact. We continue to grow and strengthen our reputation throughout Australia and the world. Meet our people Rita Henderson Associate Dean opens in a new window Laura Poole-Warren Professor opens in a new window Georgios Konstantinou Senior Lecturer opens in a new window Chris Menictas Associate Professor opens in a new window Gelareh Mohammadi Senior Lecturer opens in a new window Maurice Pagnucco Deputy Dean (Education) opens in a new window See all Ways to connect Sign up to our newsletter for our latest news, featured stories, profiles and alumni Q&A. Sign up now Have you seen the headlines? Progress needs engineers. Learn more Close",
  "content_length": 3875,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:32"
}