{
  "name": "Angelo Cangelosi",
  "homepage": "https://www.research.manchester.ac.uk/portal/angelo.cangelosi.html",
  "status": "success",
  "content": "Angelo Cangelosi - Research Explorer The University of Manchester Angelo Cangelosi Professor Professor of Machine Learning & Robotics, Machine Learning and Robotics https://orcid.org/0000-0002-4709-2243 Accepting PhD Students Personal profile BiographyAngelo Cangelosi is Professor of Machine Learning and Robotics at the University of Manchester (UK) and co-director and founder of the Manchester Centre for Robotics and AI. He was awarded a European Research Council (ERC Advanced) project in 2023. Cangelosi also is Turing Fellow at the Alan Turing Institute London, and Visiting Professor at Universita' Cattolica Milano and Hohai University. His research interests are in cognitive and developmental robotics, neural networks, language grounding, human robot-interaction and trust, and robot companions for health and social care. Overall, he has secured over £38m of research grants as coordinator/PI, with currently many UKRI/Horizon/US grants active (e.g. ERC Advanced, UKRI TAS Trust Node and CRADLE Prosperity, Horizon RIA PRIMI, MUSAE and TRAINCREASE, the Horizon MSCA TRAIL, PERSEO, eLADDA, and the US AFRL THRIVE++). Cangelosi has produced more than 300 scientific publications. He also has projects funding collaboration with industries such as Honda, BAE Systems and Jacobs. Cangelosi is Editor-in-Chief of the journals Interaction Studies and IET Cognitive Computation and Systems, and in 2015 was Editor-in-Chief of IEEE Transactions on Autonomous Development. He has chaired numerous international conferences, including ICANN2022 Bristol, and ICDL2021 Beijing. His book “Developmental Robotics: From Babies to Robots” (MIT Press) was published in January 2015, and translated in Chinese and Japanese. His latest book “Cognitive Robotics” (MIT Press), coedited with Minoru Asada, was recently published in 2022.My groupCognitive Robotics Lab, School of Computer Science, University of Manchester https://corolab.github.io Job Opportunities: We currentkly have 7 Postdoc positions open on Horizon and UK projects. Contact [email protected] if interested. Memberships of committees and professional bodiesFellow, British Computer Society Senior Member, IEEE Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationHabilitation, UK Accreditation for Teaching in Higher Education (TLHE-SEDA Certificate)Award Date: 1 Aug 1998Doctor of Philosophy, PhD in Psychology and Artificial Intelligence, Università di GenovaAward Date: 10 Jun 1997Master in Science, Laurea in Psychology (General and Experimental Psychology), Università degli Studi di Roma La SapienzaAward Date: 11 Dec 1991 External positionsVisiting Professor (Laurea Magistrale in Media Education, Facolta' Scienze della Formazione), Universita Cattolica Del Sacro Cuore2019 → …Fellow, Alan Turing Institute1 Oct 2018 → 31 Dec 2024Visiting Professor, University of Plymouth1 Aug 2018 → 31 Jul 2020Visiting Distinguished Research Fellow, AIRC, National Institute of Advanced Industrial Science and Technology AIST2018 → 2022 Areas of expertiseQA75 Electronic computers. Computer scienceCognitive RoboticsArtificial IntelligenceCognitive ScienceResearch Beacons, Institutes and PlatformsInstitute for Data Science and AIDigital FuturesAutism@ManchesterCreative ManchesterKeywordsArtificial IntelligenceRoboticsCognitive ScienceMachine learningLanguage learning Fingerprint Dive into the research topics where Angelo Cangelosi is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Robot Computer Science 100% Neural Network Psychology 41% Human Robot Interaction Computer Science 27% Humanoid Robots Computer Science 22% Cognitive Robotics Computer Science 20% Cognitive Architecture Computer Science 15% Theory of Mind Psychology 14% Artificial Intelligence Psychology 13% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 151 Article 69 Paper 60 Conference contribution 25 Chapter 25 More 7 Book 6 Editorial 4 Review article 2 Other contribution 2 Preprint 1 Other 1 Meeting Abstract 1 Commentary/debate 1 Conference article Research output per year Research output per year A Review of Theory of Mind and Robotics: Mind Reading in Human-Robot Interaction for Proactive Social RobotsHellou, M., Vinanzi, S. & Cangelosi, A., 26 Feb 2025, Human-Friendly Robotics 2024. Paolillo, A., Giusti, A. & Abbate, G. (eds.). Cham: Springer Nature, p. 197-211 15 p.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open Access Mind-Reading 100% Mental State 100% Theory of Mind 100% Theory-Of-Mind 100% Social Robot 100% A Theory of Mind Motivational Framework for Social Interaction with Autonomous Cognitive RobotsBerto, L., Hellou, M., Sciutti, A., Gudwin, R., Colombini, E. & Cangelosi, A., 3 Nov 2025, 2025 IEEE International Conference on Robot and Human Interactive Communication (RO-MAN).Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open AccessFile Social Interaction 100% Theory of Mind 100% Cognitive Robot 100% Behavior (Neuroscience) 50% Bridging the Communication Gap: Artificial Agents Learning Sign Language through ImitationTavella, F., Galata, A. & Cangelosi, A., 25 Mar 2025, 16th International Conference on Social Robotics + AI (ICSR 2024). Vol. 15561. p. 460–474 ( Lecture Notes in Computer Science).Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open AccessFile Nonverbal Communication 100% 13 Downloads (Pure) CAW: A realistic benchmark for semi-supervised semantic segmentation in maritime computer visionKrywonos, W. & Cangelosi, A., Mar 2025, Symposium on Computational Intelligence in Image, Signal Processing and Synthetic Media (CISM). IEEEResearch output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open Access Image Segmentation 100% Computer Vision 100% Annotation 33% Scene Understanding 33% Large Data Set 33% Continual Facial Features Transfer for Facial Expression RecognitionMaharjan, R. S., Bonicelli, L., Romeo, M., Calderara, S., Cangelosi, A. & Cucchiara, R., Jul 2025, In: IEEE Transactions on Affective Computing. p. 2352 - 2364Research output: Contribution to journal › Article › peer-review Open AccessFile Facial Feature 100% Expression Recognition 100% Facial Expression 100% Deep Learning Method 100% Recognition Model 40% 7 Downloads (Pure) View all 330 research outputs Projects 1 Not started 7 Active 13 Finished Projects per year MSCA DN - SCALACangelosi, A. (PI)1/12/24 → 30/11/28Project: Research CASPER++ US Air ForceCangelosi, A. (PI)15/09/24 → 14/09/29Project: Research eTALK: [eTALK] embodied Thought for Abstract Language KnowledgeCangelosi, A. (PI)26/06/24 → 25/06/29Project: Research Pheromone 100% Knowledge 100% Grant 100% Congruence 50% Gender Difference 50% PRIMICangelosi, A. (PI)1/11/23 → 31/12/27Project: Research UK 100% CRADLE: CRADLE - Centre for Robotic Autonomy in Demanding and Long-lasting EnvironmentsFisher, M. (PI), Adorno, B. (CoI), Cangelosi, A. (CoI), Dennis, L. (CoI), Dixon, C. (CoI), Groves, K. (CoI), Lennox, B. (CoI) & Watson, S. (CoI)1/09/23 → 31/08/28Project: Research Autonomous System 100% Robot 57% Dynamic Environment 42% Unexpected Event 42% Agent-Oriented 42% View all 21 projects Prizes 2019 IEEE ICDL-EPIROB Modelbot AwardSerhan, B. (Recipient) & Cangelosi, A. (Recipient), 21 Aug 2019Prize: Prize (including medals and awards) File Joints (Structural Components) 100% Reviewer 100% Pointing Gesture 100% European Research Council (ERC) Advanced grantCangelosi, A. (Recipient), Mar 2023Prize: Fellowship awarded competitively Research Councils 100% IROS Best Entertainment and Amusement Paper Award FinalistsShangguan, Z. (Recipient), Hei, X. (Recipient), Li, F. (Recipient), Yu, C. (Recipient), Song, S. (Recipient), Cangelosi, A. (Recipient), Zhao, J. (Recipient) & Tapus, A. (Recipient), Oct 2025Prize: Prize (including medals and awards) File Activities 4 Organising a conference, workshop, exhibition, performance, inquiry, course etc 3 Editorial work Activities per year TAROS 2026: Conference, Towards Autonomous Robotics SystemsCangelosi, A. (Chair), Lennox, B. (Co-Chair) & Weightman, A. (Co-Chair)7 Sept 2026 → 9 Sept 2026Activity: Participating in or organising event(s) › Organising a conference, workshop, exhibition, performance, inquiry, course etc › Research IEEE SSCI 2018 - Symposium on Computational Intelligence, Cognitive Algorithms, Mind, and Brain (CCMB2018)Cangelosi, A. (Chair)18 Nov 2018Activity: Participating in or organising event(s) › Organising a conference, workshop, exhibition, performance, inquiry, course etc › Research ICDL-EPiRob 2018: The 8th International Conference on Development and Learning and on Epigenetic RoboticsCangelosi, A. (Chair)16 Sept 2018 → 20 Sept 2018Activity: Participating in or organising event(s) › Organising a conference, workshop, exhibition, performance, inquiry, course etc › Research Robotics@Manchester WorkshopCangelosi, A. (Chair)6 Sept 2018Activity: Participating in or organising event(s) › Organising a conference, workshop, exhibition, performance, inquiry, course etc › Research Cognitive Computation and Systems (Journal)Cangelosi, A. (Editor in chief)2018 → …Activity: Publication peer-review and editorial work › Editorial work › Research View all 7 activities Impacts Centre for Robotic Autonomy in Demanding and Long Las",
  "content_length": 11402,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:36"
}