{
  "name": "Angela P. Schoellig",
  "homepage": "https://www.ce.cit.tum.de/lsy/prof-angela-schoellig",
  "status": "success",
  "content": "Prof. Angela Schoellig - Lehrstuhl für Sicherheit, Performanz und Zuverlässigkeit für lernende Systeme Prof. Dr. Angela P. Schoellig Angela Schoellig is an Alexander von Humboldt Professor for Robotics and Artificial Intelligence at the Technical University of Munich. She is also an Associate Professor at the University of Toronto Institute for Aerospace Studies and a Faculty Member of the Vector Institute in Toronto. Angela conducts research at the intersection of robotics, controls, and machine learning. Her goal is to enhance the performance, safety, and autonomy of robots by enabling them to learn from past experiments and from each other. In Canada, she has held a Canada Research Chair (Tier 2) in Machine Learning for Robotics and Control and a Canada CIFAR Chair in Artificial Intelligence, and has been a principal investigator of the NSERC Canadian Robotics Network. She is a recipient of the Robotics: Science and Systems Early Career Spotlight Award (2019), a Sloan Research Fellowship (2017), and an Ontario Early Researcher Award (2017). She is one of MIT Technology Review’s Innovators Under 35 (2017), a Canada Science Leadership Program Fellow (2014), and one of Robohub’s “25 women in robotics you need to know about (2013)”. Her team is the four-time winner of the North-American SAE AutoDrive Challenge (2018-21). Her PhD at ETH Zurich (2013) was awarded the ETH Medal and the Dimitris N. Chorafas Foundation Award. She holds both an M.Sc. in Engineering Cybernetics from the University of Stuttgart (2008) and an M.Sc. in Engineering Science and Mechanics from the Georgia Institute of Technology (2007). Download my full CV and head-shot image. Publications My list of publications is available here and on Google Scholar. Selected Awards and Honors Infineon Stiftungslehrstuhl “Safety, Performance and Reliability of Learning Systems” (Infineon press article), 2022. Alexander von Humboldt Professorship (Alexander von Humboldt Foundation news, TUM campus news), 2021. Robotics: Science and Systems Early Career Spotlight Award, 2019. MIT Technology Review’s 35 Innovators Under 35 (Technology Review article, University of Toronto news, CBC interview), 2017. Sloan Research Fellowship, 2017. Ministry of Research, Innovation & Science Early Researcher Award, 2017. Nominated for a Canada Research Chair Tier 2, 2017. Connaught New Researcher Award, 2015. MIT Enabling Society Tech Competition First Prize, 2015. $1M Drones For Good Competition Finalist, 2015. IEEE Control Systems Society (CSS) Video Clip Contest Finalist (with this video), 2014. Best Robotics Paper Award at the Conference on Computer and Robot Vision (CRV) (with this paper), 2014. Science Leadership Program Fellow, 2014. Dimitris N. Chorafas Foundation Prize (as one of 35 worldwide, for my PhD thesis), 2013. ETH Medal (awarded to the top 8% of Ph.D. dissertations at ETH Zurich, for my PhD thesis), 2013. Named one of “25 women in robotics you need to know about” by Robohub.org, 2013. Professor-Peter-Sagirow Award (for outstanding performance in the undergraduate program Engineering Cybernetics, awarded to the top two students out of 70), 2005. Ongoing Activities Affiliations: Associate Director of the Centre for Aerial Robotics Research and Education (CARRE), since 2015. Principal Faculty Advisor for the University of Toronto’s SAE/GM AutoDrive Challenge team competing in a 3-year self-driving competition, 2017-2020. Faculty Advisor of the University of Toronto Aerospace Team (UTAT), since 2015. Affiliated with the University of Toronto’s Institute for Robotics and Mechatronics and the Lassonde Institute for Mining, since 2014. Organizer of the following events: Safe Robot Learning Competition at the IEEE/RSJ International Conference on Intelligent Robots and Systems, Jul. 31-Oct. 25, 2022. Invited Sessions on Learning-based Control at the IEEE Conference on Decision and Control, since 2016. Aerial Robotics Seminar Series at the University of Toronto (see Events here), since 2016. Editor positions: Associate Editor of the International Journal of Robotics Research (IJRR), since 2017. Chair of Jury of the IEEE Control Systems Society Video Clip Contest, 2017. Area Chair for the Robotics: Science and Systems Conference (RSS), 2017. To top Chair of Safety, Performance and Reliability for Learning Systems Prof. Angela Schoellig Technical University of Munich Department of Computer Engineering Theresienstraße 90, Building N4 (0104) 80333 Munich, Germany Follow us Twitter Facebook Linkedin Youtube Instagram",
  "content_length": 4539,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:33"
}