{
  "name": "Angeliki Koutsoukou-Argyraki",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/angeliki-koutsoukou-argyraki",
  "status": "success",
  "content": "Angeliki Koutsoukou Argyraki - Royal Holloway Research Portal Angeliki Koutsoukou Argyraki Dr Lecturer in Computer Science, Department of Computer ScienceCentre for Programming Languages and Systems https://orcid.org/0000-0002-8886-5281 EmailAngeliki.KoutsoukouArgyrakirhul.acuk TW20 0EX Personal profile External positionsVisiting Researcher, The Department of Computer Science and Technology, University of CambridgeSept 2023 → …College Research Associate, University of Cambridge, Clare CollegeOct 2020 → Sept 2025 Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 25 Article 8 Abstract 4 Conference contribution Research output per year Research output per year A Formalisation of Aristotle’s Assertoric Syllogistic in Isabelle/HOLKoutsoukou-Argyraki, A. & Wapniarski, K., 18 Apr 2025, In: Topoi: An International Review of Philosophy.Research output: Contribution to journal › Article › peer-review Open Access Transitive Union-Closed Families (Formal proof development)Koutsoukou-Argyraki, A. & Paulson, L. C., Jan 2025, In: Archive of Formal Proofs.Research output: Contribution to journal › Article › peer-review Open Access Formalising Mathematics with Proof Assistants (Invited tutorial)Koutsoukou-Argyraki, A., 2024.Research output: Contribution to conference › Abstract › peer-review Wooley's Discrete Inequality (Formal proof development)Koutsoukou-Argyraki, A., Oct 2024, In: Archive of Formal Proofs.Research output: Contribution to journal › Article › peer-review Open Access A Formalisation of the Balog-Szemerédi-Gowers Theorem in Isabelle/HOLKoutsoukou-Argyraki, A., Bakšys, M. & Edmonds, C., 11 Jan 2023, CPP 2023 - Proceedings of the 12th ACM SIGPLAN International Conference on Certified Programs and Proofs, co-located with POPL 2023. Krebbers, R., Traytel, D., Pientka, B. & Zdancewic, S. (eds.). Association for Computing Machinery, Inc, p. 225-238 14 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open Access View all 37 research outputs",
  "content_length": 2337,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:34"
}