{
  "name": "Angeliki Alexiou",
  "homepage": "https://www.ds.unipi.gr/en/faculty/alexiou-en",
  "status": "success",
  "content": "Angeliki Alexiou - Department of Digital Systems Skip to content Angeliki Alexiou Phone +30 210-4142761 Email alexiou@unipi.gr Title Professor Office Hours Mon 13.00-14.00, Wed 16.00-17.00 Office 303 (150, Androutsou Str, Piraeus, 18532) Courses Short Range Wireless Networks — 7th semester Broadband Networks — 5th semester Advanced Topics in Wireless Communications — 8th semester Stochastic Processes — 2nd semester Brief CV Angeliki Alexiou is a professor at the department of Digital Systems, ICT School, University of Piraeus. She received the Diploma in Electrical and Computer Engineering from the National Technical University of Athens in 1994 and the PhD in Electrical Engineering from Imperial College of Science, Technology and Medicine, University of London in 2000. Since May 2009 she is faculty member at the Department of Digital Systems, where she conducts research and teaches undergraduate and postgraduate courses in the area of Broadband Communications and Advanced Wireless Technologies. Prior to this appointment she was with Bell Laboratories, Wireless Research, Lucent Technologies, (later Alcatel-Lucent, now NOKIA), in Swindon, UK, first as a member of technical staff (January 1999-February 2006) and later as a Technical Manager (March 2006-April 2009). Professor Alexiou is a co-recipient of Bell Labs President’s Gold Award in 2002 for contributions to Bell Labs Layered Space-Time (BLAST) project and the Central Bell Labs Teamwork Award in 2004 for role model teamwork and technical achievements in the IST FITNESS project. Professor Alexiou is the Chair of the Working Group on Radio Communication Technologies and of the Working Group on High Frequencies Radio Technologies of the Wireless World Research Forum. She is a member of the IEEE and the Technical Chamber of Greece. Her current research interests include radio interface for 5G systems and beyond, MIMO and high frequencies (mmWave and THz wireless) technologies, cooperation, coordination and efficient resource management for Ultra Dense wireless networks and machine-to-machine communications, ‘cell-less’ architectures based on virtualization and extreme resources sharing and machine learning for wireless systems. She is the project coordinator of the H2020 TERRANOVA project (ict-terranova.eu) and the technical manager of H2020 ARIADNE project (ict-ariadne.eu). Publications Publications Publications 2009 – 2019 I) JOURNALS Α.-Α. Α. Boulogeorgos, E. Papasotiriou, and A. Alexiou, “Analytical Performance Assessment of THz Wireless Systems”, IEEE Access, Volume: 7, January 2019. A.-A. A. Boulogeorgos, A. Alexiou, T. Merkle, C. Schubert, R. Elschner, A. Katsiotis, P. Stavrianos,D. Kritharidis, P.-K. Charsias, J. Kokkoniemi, M. Juntii, J. Lehtomaki, A. Teixeira, and F. Rodrigues, “Terahertz Technologies to Deliver Optical Network Quality of Experience in Wireless System Beyond 5G”, IEEE Commun. Mag., vol. 56, no. 6, pp. 144–151, June 2018. S. Stefanatos, A. G. Gotsis, and A. Alexiou, “Cross-Mode Interference Characterization in Cellular Networks with Voronoi Guard Regions”, IEEE Trans. on Wireless Communications, Volume: 17 , Issue: 11 , pp. 7576 – 7589, Nov. 2018 . A. A. Boulogeorgos, A. Alexiou, T. Merkle, C. Schubert, R. Elschner, A. Katsiotis, P. Stavrianos, D. Kritharidis, P.-K. Chartsias, J. Kokkoniemi, M. Juntti, J. Lehtomäki, A. Teixeira, and F. Rodrigues, “Terahertz Technologies to Deliver Optical Network Quality of Experience in Wireless Systems Beyond 5G”, IEEE Communications Magazine, Vol. 56, No. 6, pp. 144 – 151, June 2018. I. Poulakis, A. G. Gotsis, A. Alexiou, “Multicell Device-to-Device Communication: A Spectrum-Sharing and Densification Study”, IEEE Vehicular Technology Magazine, Vol. 13, No. 1, pp. 85-96, March 2018. S. Stefanatos, and A. Alexiou, “On the Competition Among Small Cell Wireless Operators with Large Scale Deployments”, IEEE Trans. on Mobile Computing, Vol.16, No. 7, pp.1981-1993, July 2017. A.G. Gotsis, S. Stefanatos, and A. Alexiou, “Ultra Dense Networks: The New Wireless Frontier for Enabling 5G Access”, IEEE Vehicular Technology Magazine, Vol. 11, No. 2, pp.71-78, June 2016. S. Stefanatos, A. G. Gotsis, and A. Alexiou, “Operational Region of D2D Communications for Enhancing Cellular Network Performance”, IEEE Trans. on Wireless Communications, Vol. 14, No. 11, pp.5984-5997, November 2015. S. Stefanatos, and A. Alexiou, “Access Point Density and Bandwidth Partitioning in Ultra Dense Wireless Networks”, IEEE Trans. on Communications, Vol. 62, No. 9, pp. 3376-3384, September 2014. A. Alexiou, “Wireless World 2020: Radio Interface Challenges and Technology Enablers”, IEEE Vehicular Technology Magazine, Vol. 9, No. 1, pp. 46-53, March 2014. P. S. Bithas, A. S. Lioumpas and A. Alexiou, “Exploiting Spatial Correlation in Distributed MIMO Networks,” International Journal of Electronics and Communications (AEU), Vol. 68, No. 3, pp. 270-276, March 2014. A. Lioumpas, P. S. Bithas and A. Alexiou, “Partitioning of Distributed MIMO Systems based on Overhead Considerations,” IEEE Wireless Communications Letters, Vol.2, No.6, pp. 579-582, December 2013. A. G. Gotsis, A. S. Lioumpas and A. Alexiou, “Analytical Modeling and Performance Evaluation of Realistic Time-Controlled M2M Scheduling over LTE Cellular Networks,” Transactions on Emerging Telecommunications Technologies (ETT), special issue on Machine-to-Machine: An Emerging Communication Paradigm, vol. 24, no. 4, pp. 378-388, June 2013. P. S. Bithas, A. S. Lioumpas and A. Alexiou, “Mitigating Shadowing Effects Through Cluster-Head Cooperation Techniques,” IET Networks, vol. 2, no. 2, p. 71-80, June 2013. A. G. Gotsis, A. S. Lioumpas and A. Alexiou, “M2M Scheduling over LTE: Challenges and new Perspectives”, IEEE Vehicular Technology Magazine, vol. 7, no. 3, pp. 34-39, Sep. 2012). A. Alexiou et al, “MIMO and Multihop Cross-Layer Design for Wireless Backhaul –A Testbed Implementation”, IEEE Communications Magazine, Vol. 48, No. 3, pp. 172-179, March 2010. F. Boccardi, K. Yu and A. Alexiou, “High Data Rate Relay Transmissions with Multiple Antennas”, IEEE Transactions on Communications, Vol. 57, No. 12, December 2009. F. Boccardi, K. Yu and A. Alexiou, “Relay-Aided Multiple Antenna Transmissions for Wireless Backhaul Applications”, Bell Labs Technical Journal, vol. 13, No. 4, Spring 2009. II) CONFERENCES E. Papasotiriou, J. Kokkoniemi, A.-A. A. Boulogeorgos, J. Lehtomaki, A.Alexiou, and M. Juntti, “A new look to 275 to 400 GHz band:Channel model and performance evaluation”, accepted for presentation at the 29th Annual IEEE International Symposium on Personal, Indoor and Mobile Radio Communications (IEEE PIMRC 2018), Bologna, Italy, September 2018. A. A. Boulogeorgos, E. N. Papasotiriou, and A. Alexiou, “A distance and bandwidth dependent adaptive modulation scheme for THz communications”, 19thIEEE International Workshop on Signal Processing Advances in Wireless Communications (SPAWC 2018), Kalamata, Greece, 25-28 June 2018. A. A. Boulogeorgos, S. K. Goudos, and A. Alexiou, “Users Association in Ultra Dense THz Networks”, 19thIEEE International Workshop on Signal Processing Advances in Wireless Communications(SPAWC 2018), Kalamata, Greece, 25-28 June 2018. A. Alexiou, “TERRANOVA System Architecture Reliable and Scalable Tbit/s Connectivity to Extend the Fibre Optic Systems QoE into the Wireless Domain”, EUCNC 2018, Ljubljana, Slovenia, June 2018. A.-A. Boulogeorgos, E. N. Papasotiriou, J. Kokkoniemi, J. Lehtomaki, A.Alexiou, and M. Juntti, “Performance Evaluation of THz Wireless Systems Operating in 275−400 GHz Band”, IEEE 87th Vehicular Technology Conference: VTC2018-Spring, Porto, Portugal, June 2018. I. Poulakis, A.G. Gotsis, and A. Alexiou, “Multi-cell Device-to-Device communication benefits in the presence of densification”, IEEE International Conference on Communications 2017 (ICC 2017), Workshop on 5G Ultra Dense Networks, Paris, France, May 2017. S. Stefanatos, and A. Alexiou, “Duopoly competition between small cell operators with large scale deployments”, IEEE 17th International Workshop on Signal Processing Advances in Wireless Communications (SPAWC) 2016, Edinburgh, UK, July 2016. S. Stefanatos, A. G. Gotsis, and A. Alexiou, “Operational Region of Overlay D2D Communications”, IEEE International Conference on Communications 2015 (ICC 2015), London, UK, June 2015. A.G. Gotsis, S. Stefanatos, and A. Alexiou, “Optimal user association for Massive MIMO empowered ultra-dense wireless networks”, IEEE International Conference on Communications 2015 (ICC 2015), Workshop on “Advanced PHY and MAC Techniques for Super Dense Wireless Networks”, London, UK, June 2015. A.G. Gotsis, S. Stefanatos, and A. Alexiou, “Spatial coordination strategies in future ultra-dense wireless networks”, 11th International Symposium on Wireless Communications Systems (ISWCS) 2014, Barcelona, Spain, August 2014. S. Stefanatos, A. G. Gotsis, and A. Alexiou, “Analytical assessment of coordinated overlay D2D communications”, 20th European Wireless Conference 2014, Barcelona, Spain, May 2014. S. Stefanatos, and A. Alexiou, “Exploiting Frequency and Spatial Dimensions in Small Cell Wireless Networks”, IEEE Wireless Communications and Networking Conference (WCNC) 2014, Istanbul, Turkey, April 2014. A.G. Gotsis, and A. Alexiou, “Spatial Resources Optimization in Distributed MIMO Networks with Limited Data Sharing”, 1st International Workshop on Cloud-Processing in Heterogeneous Mobile Communication Networks (IWCPM 2013), part of IEEE Globecom 2013, Atlanta, U.S.A., December 2013. A.G. Gotsis, and A. Alexiou, “Global Network Coordination in Densified Wireless Access Networks through Integer Linear Programming”, IEEE PIMRC 2013, London, UK, September 2013. P. S. Bithas, A. S. Lioumpas and A. Alexiou, “A Hybrid Contention/Reservation Medium Access Protocol for Wireless Sensor Networks”, proceedings of the IEEE Globecom 2012, Workshop on Machine-to-Machine Communications, California, U.S.A., December 2012 . A.G. Gots",
  "content_length": 13803,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:35"
}