{
  "name": "Angshuman Karmakar",
  "homepage": "https://www.cse.iitk.ac.in/users/angshuman",
  "status": "success",
  "content": "Angshuman Karmakar 406, Rajeev Motwani Building, Department of CSE, IIT Kanpur, Kalyanpur Uttar Pradesh, India, 208016 Hello, I am Angshuman. I am an Assistant Professor in the Department of Computer science and engineering at the Indian Institute of Technology Kanpur, India. My research interest lies mostly on Post-Quantum Cryptography(PQC) and Computation On Encrypted Data (COED) which are currently shaping the landscape of cryptography and computer security. My work spans a wide spectrum of these fields such as developing theoretical instruments for efficient scheme design, designing algorithms for efficient implementation, discovering side-channel, fault, and microarchitectural attacks, and proposing countermeasures. I have a vast collaboration network and I work with researchers and engineers from all over the world looking for answers to these extremely interesting and hard questions. I received the Erasmus Mundus fellowship for my doctoral studies at Katholieke Universiteit Leuven(KU Leuven), Belgium. I got my Ph.D. working under Prof. Ingrid Verbauwhede on the design and implementation aspects of post-quantum cryptography in the COSIC research group. I then received the prestigious FWO(Fonds voor Wetenschappelijk Onderzoek – Vlaanderen) fellowship for my post-doctoral study at KU Leuven. I am currently looking for motivated graduate students and postdocs to work with me on the problems mentioned above. Contact me if you are interested in exploring this exciting world of cryptography and computer security with me. Website work in progress. news Jan 14, 2025 Our paper Rudraksh: A compact and lightweight post-quantum key-encapsulation mechanism got accepted in the Cryptographic Hardware and Embedded Systems 2025 Jan 10, 2025 Received Google India Research Award for my work on solving practical problems for seamless transition to post-quantum cryptography Jan 7, 2025 Our paper Masking Gaussian Elimination at Arbitrary Order with Application to Multivariate- and Code-Based PQC got accepted in the Cryptographers’ Track at RSA Conference (CT-RSA 2025) Dec 21, 2024 Our paper SCRUBD: Smart Contracts Reentrancy and Unhandled Exceptions Vulnerability Dataset got accepted in the International Conference on Mining Software Repositories Dec 16, 2024 Our paper Full Key Extraction of SNOW-V Using ML-assisted Power SCA got accepted in the IEEE Design & Test selected publications TCHES’25 Rudraksh: A compact and lightweight post-quantum key-encapsulation mechanism Suparna Kundu, Archisman Ghosh, Angshuman Karmakar, Shreyas Sen, and Ingrid Verbauwhede 2025 Bib HTML PDF @misc{cryptoeprint:2024/1170, author = {Kundu, Suparna and Ghosh, Archisman and Karmakar, Angshuman and Sen, Shreyas and Verbauwhede, Ingrid}, title = {Rudraksh: A compact and lightweight post-quantum key-encapsulation mechanism}, howpublished = {Cryptology {ePrint} Archive, Paper 2024/1170}, year = {2025}, url = {https://eprint.iacr.org/2024/1170}, } ASIACRYPT’24 ZKFault: Fault attack analysis on zero-knowledge based post-quantum digital signature schemes Puja Mondal, Supriya Adhikary, Suparna Kundu, and Angshuman Karmakar Advances in Cryptology – ASIACRYPT, 2024 Bib HTML PDF @article{DBLP:journals/iacr/MondalAKK24, author = {Mondal, Puja and Adhikary, Supriya and Kundu, Suparna and Karmakar, Angshuman}, title = {ZKFault: Fault attack analysis on zero-knowledge based post-quantum digital signature schemes}, journal = {Advances in Cryptology – ASIACRYPT}, pages = {1422}, year = {2024}, } TECS Scabbard: An Exploratory Study on Hardware Aware Design Choices of Learning with Rounding-based Key Encapsulation Mechanisms Suparna Kundu, Quinten Norga, Angshuman Karmakar, Shreya Gangopadhyay, Jose Maria Bermudo Mera, and 1 more author ACM Transactions on Embedded Computing Systems, Nov 2024 Bib HTML PDF @article{10.1145/3696208, author = {Kundu, Suparna and Norga, Quinten and Karmakar, Angshuman and Gangopadhyay, Shreya and Bermudo Mera, Jose Maria and Verbauwhede, Ingrid}, title = {Scabbard: An Exploratory Study on Hardware Aware Design Choices of Learning with Rounding-based Key Encapsulation Mechanisms}, year = {2024}, issue_date = {January 2025}, publisher = {Association for Computing Machinery}, address = {New York, NY, USA}, volume = {24}, number = {1}, issn = {1539-9087}, doi = {10.1145/3696208}, journal = {ACM Transactions on Embedded Computing Systems}, month = nov, articleno = {10}, numpages = {40}, keywords = {Post-quantum cryptography, lattice-based cryptography, learning with rounding, key-encapsulation mechanism, software implementations, AVX2, Cortex-M4, hardware implementations, FPGA}, } TCHES’24 Carry Your Fault: A Fault Propagation Attack on Side-Channel Protected LWE-based KEM Suparna Kundu, Siddhartha Chowdhury, Sayandeep Saha, Angshuman Karmakar, Debdeep Mukhopadhyay, and 1 more author IACR Cryptol. ePrint Arch., Nov 2024 Bib HTML PDF @article{DBLP:journals/iacr/KunduCSKMV23, author = {Kundu, Suparna and Chowdhury, Siddhartha and Saha, Sayandeep and Karmakar, Angshuman and Mukhopadhyay, Debdeep and Verbauwhede, Ingrid}, title = {Carry Your Fault: {A} Fault Propagation Attack on Side-Channel Protected LWE-based {KEM}}, journal = {{IACR} Cryptol. ePrint Arch.}, pages = {1674}, year = {2024}, timestamp = {Thu, 09 Nov 2023 00:00:00 +0100}, biburl = {https://dblp.org/rec/journals/iacr/KunduCSKMV23.bib}, bibsource = {dblp computer science bibliography, https://dblp.org}, } ACNS’24 A practical key-recovery attack on LWE-based key- encapsulation mechanism schemes using Rowhammer Puja Mondal, Suparna Kundu, Sarani Bhattacharya, Angshuman Karmakar, and Ingrid Verbauwhede Nov 2024 Bib HTML PDF @misc{cryptoeprint:2023/1731, author = {Mondal, Puja and Kundu, Suparna and Bhattacharya, Sarani and Karmakar, Angshuman and Verbauwhede, Ingrid}, title = {{A practical key-recovery attack on LWE-based key- encapsulation mechanism schemes using Rowhammer}}, howpublished = {22nd International Conference on Applied Cryptography and Network Security (ACNS), Abu Dhabi, UAE, 5-8 March, 2024}, year = {2024}, } JSSC A 334 \\(μ\\)W 0.158 mm\\(^\\mbox2\\) ASIC for Post-Quantum Key-Encapsulation Mechanism Saber With Low-Latency Striding Toom-Cook Multiplication Archisman Ghosh, Jose Maria Bermudo Mera, Angshuman Karmakar, Debayan Das, Santosh Ghosh, and 2 more authors IEEE Journal of Solid State Circuits, Nov 2023 Bib HTML PDF @article{DBLP:journals/jssc/GhoshMKDGVS23, author = {Ghosh, Archisman and Mera, Jose Maria Bermudo and Karmakar, Angshuman and Das, Debayan and Ghosh, Santosh and Verbauwhede, Ingrid and Sen, Shreyas}, title = {A 334 {\\(\\mu\\)}W 0.158 mm\\({}^{\\mbox{2}}\\) {ASIC} for Post-Quantum Key-Encapsulation Mechanism Saber With Low-Latency Striding Toom-Cook Multiplication}, journal = {{IEEE} Journal of Solid State Circuits}, volume = {58}, number = {8}, pages = {2383--2398}, year = {2023}, doi = {10.1109/JSSC.2023.3253425}, timestamp = {Sat, 05 Aug 2023 01:00:00 +0200}, biburl = {https://dblp.org/rec/journals/jssc/GhoshMKDGVS23.bib}, bibsource = {dblp computer science bibliography, https://dblp.org}, } Just drop me an email or ping on Linkedin 🙂.",
  "content_length": 7168,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:37"
}