{
  "name": "Anh-Tuan Hoang",
  "homepage": "https://pure.qub.ac.uk/en/persons/anh-tuan-hoang",
  "status": "success",
  "content": "Anh-Tuan Hoang - Queen's University Belfast Anh-Tuan Hoang public CV View Scopus Profile Anh-Tuan Hoang Dr Lecturer, School of Electronics, Electrical Engineering and Computer Science Emailt.hoangqub.acuk 20142025 Research activity per year Personal profile Fingerprint Dive into the research topics where Anh-Tuan Hoang is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles side-channel Computer Science 100% Power Analysis Computer Science 39% Deep Learning Computer Science 34% Computation Computer Science 34% Detection Computer Science 34% Side Channel Computer Science 34% Channel Analysis Computer Science 34% Machine Learning Computer Science 34% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2014 2025 2025 6 Conference contribution 2 Article Research output per year Research output per year An enhanced two-step CPA Side-channel analysis attack on ML-KEMKennaway, M., Hoang, A.-T., Khalid, A., Rafferty, C. & O'Neill, M., 13 Jun 2025, Proceedings of the 22nd International Conference on Security and Cryptography. De Capitani Di Vimercati , S. & Samarati, P. (eds.). SciTePress, p. 263 - 274 12 p. (Proceedings of the 22nd International Conference on Security and Cryptography).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Side Channel Attack 100% One Step 100% Initial Stage 100% Secret Key 100% Sample Point 100% 26 Downloads (Pure) DeepPUFSCA: deep learning for physical unclonable function attack based on side channel analysis supportDoan, N. P., Pham, T. D., Zhang, Z., Tran, H. V., Miskelly, J., Vandierendonck, H., Hoang, A.-T., O'Neill, M. & Mai, T. S., 15 Sept 2025, 2025 62nd ACM/IEEE Design Automation Conference (DAC): Proceedings. IEEE, (Design Automation Conference (DAC): Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Side Channel 100% Channel Analysis 100% Learning System 100% Machine Learning 100% Deep Learning Method 100% 29 Downloads (Pure) InteDisUX: intepretation-guided discriminative user-centric explanation for time seriesTran, V.-H., Zhang, Z., Pham, T. D., Doan, N. P., Hoang, A.-T., Li, P., Vandierendonck, H., Assent, I. & Mai, S. T., 11 Apr 2025, 39th AAAI Conference on Artificial Intelligence (AAAI-25): Proceedings. Walsh, T., Shah, J. & Kolter, Z. (eds.). AAAI Press, p. 20921-20928 8 p. (Proceedings of the AAAI Conference on Artificial Intelligence).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Human Perception 100% 37 Downloads (Pure) Deep learning enhanced side channel analysis on CRYSTALS-KyberHoang, A.-T., Kennaway, M., Pham, T. D., Mai, T. S., Khalid, A., Rafferty, C. & O'Neill, M., 16 May 2024, The 25th International Symposium on Quality Electronic Design (ISQED'24): Proceedings. Institute of Electrical and Electronics Engineers Inc., (International Symposium on Quality Electronic Design (ISQED): Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Side Channel 100% Channel Analysis 100% Deep Learning 100% Attackers 33% Ciphertext 33% 4 Citations (Scopus) 681 Downloads (Pure) Stacked ensemble models evaluation on DL based SCAHoang, A. T., Hanley, N., Khalid, A., Kundi, D.-E.-S. & O’Neill, M., 30 Sept 2023, E-business and telecommunications: 19th International Conference, ICSBT 2022, and 19th International Conference, SECRYPT 2022, revised selected papers. Van Sinderen, M., Wijnhoven, F., Hammoudi, S., Samarati, P. & Vimercati, S. D. C. D. (eds.). Springer Cham, p. 43-68 26 p. (Communications in Computer and Information Science; vol. 1849).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Evaluation Models 100% side-channel 100% Advanced Encryption Standard 23% Output Probability 23% Machine Learning 15% 2 Citations (Scopus) 17 Downloads (Pure) View all 8 research outputs Activities Activities per year 2022 2023 2024 2024 7 Other 2 Participation in Festival/Exhibition 2 Other examination 1 Hosting a school group or open day Activities per year Open dayHoang, A.-T. (Contributor)07 Sept 2024Activity: Other activity types › Other Introducing about QUB, EEECS and the research topics at QTQHoang, A.-T. (Presenter)Sept 2024 → Jan 2025Activity: Other activity types › Other Recruiting PhD studentsHoang, A.-T. (Presenter)Sept 2024 → Feb 2025Activity: Other activity types › Other DifferentiationHoang, A.-T. (Examiner)06 Jun 2024Activity: Examination types › Other examination DifferentiationHoang, A.-T. (Examiner)04 Jun 2024Activity: Examination types › Other examination View all 12 activities",
  "content_length": 5138,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:41"
}