{
  "name": "Anh Tuan Luu",
  "homepage": "https://tuanluu.github.io",
  "status": "success",
  "content": "Anh Tuan's home page Luu Anh Tuan Associate Professor at NTU © Copyright © All rights reserved About me Hi! I am Luu Anh Tuan, an Associate Professor at the College of Computing and Data Science, Nanyang Technological University, Singapore. Before that, I was a postdoctoral fellow at MIT CSAIL and a member of the Natural Language Processing group under the supervision of Prof. Regina Barzilay from 2018 to 2020. I obtained Ph.D. degree in computer science from Nanyang Technological University in 2017. My research interests lie in the intersection of Artificial Intelligence and Natural Language Processing with the focus on applications of Large Language Models, Robustness & Trustworthy AI, Question Answering, Information Extraction, and Graph Neural Networks. Email: anhtuan.luu@ntu.edu.sg Office: N4-02c-86, College of Computing and Data Science, NTU Note: I am currently interested in taking new PhD students. Please feel free to contact me if you are very interested in deep learning and NLP. If you are one of the top students from a good university, there are many excellent PhD scholarships such as the AISG PhD Fellowship, Nanyang President's Graduate Scholarship, and IPP Scholarship. Note: I also have some positions for research fellows, research associates, and research assistants. If you have a strong publication record in NLP and AI and would like to do cutting-edge research in NLP, please feel free to contact me with your CV. Latest News Sep 2025: 3 papers accepted to NeurIPS 2025 Sep 2025: I have been promoted to Associate Professor with Tenure Aug 2025: 4 papers accepted to EMNLP 2025 Aug 2025: Invited to serve as Area Chair for ICLR 2025 Jun 2025: 1 paper accepted to Computational Linguistics May 2025: 10 papers accepted to ACL 2025 May 2025: 1 paper accepted to ICML 2025 Jan 2025: 4 papers accepted to NAACL 2025 Jan 2025: 1 paper accepted to ICLR 2025 Jan 2025: 1 paper accepted to Transactions on Machine Learning Research Dec 2024: Invited to serve as Area Chair for ICML 2025 Dec 2024: 2 papers accepted to AAAI 2025 Dec 2024: 1 paper accepted to COLING 2025 Nov 2024: 1 paper accepted to Expert Systems With Applications Nov 2024: 1 paper accepted to SAC 2024 Sep 2024: 4 papers accepted to NeurIPS 2024 Sep 2024: 9 papers accepted to EMNLP 2024 Publications For the full publication list, please refer to my Google Scholar page. Selected publications: Journal articles: Yue Zhang, Yafu Li2, Leyang Cui, Deng Cai, Lemao Liu, Tingchen Fu, Xinting Huang, Enbo Zhao, Yu Zhang, Yulong Chen, Longyue Wang, Luu Anh Tuan, Wei Bi, Freda Shi7, Shuming Shi. Siren’s Song in the AI Ocean: A Survey on Hallucination in Large Language Models. Computational Linguistics, 2025 Shuai Zhao, Meihuizi Jia, Zhongliang Guo, Leilei Gan, XIAOYU XU, Xiaobao Wu, Jie Fu, Feng Yichao, Fengjun Pan, Luu Anh Tuan. A Survey of Recent Backdoor Attacks and Defenses in Large Language Models. Transactions on Machine Learning Research, 2025 Shuai Zhao, Xiaoyu Xu, Luwei Xiao, Jinming Wen, Luu Anh Tuan. Clean-label Backdoor Attack and Defense: An Examination of Language Model Vulnerability. Expert Systems with Applications, 2024 Anran Li, Guangjing Wang, Ming Hu, Jianfei Sun, Lan Zhang, Luu Anh Tuan, Han Yu. Joint Client-and-Sample Selection for Federated Learning via Bi-level Optimization. IEEE Transactions on Mobile Computing, 2024 Yandan Zheng, Luu Anh Tuan. Incorporating Template-based Contrastive Learning into Cognitively Inspired, Low Resource Relation Extraction. Cognitive Computation, 2024 Shuai Zhao, Luu Anh Tuan, Jie Fu, Jinming Wen, Weiqi Luo. Exploring Clean Label Backdoor Attacks and Defense in Language Models. IEEE Transactions on Audio, Speech and Language Processing, 2024 Xiaobao Wu, Thong Nguyen, Luu Anh Tuan. A Survey on Neural Topic Models: Methods, Applications, and Challenges. Artificial Intelligence Review, 2024 Jia Meihuizi, Luu Anh Tuan. MuJo-SF: Multimodal Joint Slot Filling for Attribute Value Prediction of E-commerce Commodities. IEEE Transactions on Multimedia, 2024 Vijay Prakash Dwivedi, Chaitanya K Joshi, Luu Anh Tuan, Thomas Laurent, Yoshua Bengio, Xavier Bresson. Benchmarking Graph Neural Networks. Journal of Machine Learning Research, 2023 Anran Li, Jiahui Huang, Ju Jia, Hongyi Peng, Lan Zhang, Luu Anh Tuan, Han Yu, Xiang-Yang Li. Efficient and Privacy-Preserving Feature Importance-based Vertical Federated Learning. IEEE Transactions on Mobile Computing, 2023 Jie Wei, Guanyu Hu, Xinyu Yang, Luu Anh Tuan, Yizhuo Dong. Learning facial expression and body gesture visual information for video emotion recognition. Expert Systems with Applications, 2023 Ruicheng Liu, Rui Mao, Luu Anh Tuan, Erik Cambria. A brief survey on recent advances in coreference resolution. Artificial Intelligence Review, 2023 Anran Hao, Luu Anh Tuan, Siu Cheung Hui, Jian Su. A Contrastive Learning Framework for Event Detection via Semantic Type Prototype Representation Modeling. Neurocomputing, 2023 Yandan Zheng, Luu Anh Tuan. A Novel, Cognitively Inspired, Unified Graph-based Multi-Task Framework for Information Extraction. Cognitive Computation, 2023 Kathryn Arbour*, Luu Anh Tuan*, Jia Luo*, Hira Rizvi, Andrew J. Plodkowski, Mustafa Sakhi, Kevin B. Huang, Subba R. Digumarthy, Michelle S. Ginsberg, Jeffrey Girshman, Mark G. Kris, Gregory J. Riely, Adam Yala, Justin F. Gainor, Regina Barzilay, and Matthew D. Hellmann. Deep learning to estimate RECIST in patients with NSCLC treated with PD-1 blockade . Cancer Discovery, 2020 (Impact factor: 39.4) Anran Wang, Luu Anh Tuan, Chuan-Sheng Foo, Hongyuan Zhu, Yi Tay, Vijay Chandrasekhar. Holistic Multi-modal Memory Network for Movie Question Answering. IEEE Transactions on Image Processing, 2019 Luu Anh Tuan, Siu Cheung Hui, See Kiong Ng. Utilizing Temporal Information for Taxonomy Construction. Transactions of the Association for Computational Linguistics (TACL), 2016 Yuqing Mao, Kimberly Van Auken, Donghui Li, Luu Anh Tuan, Jung-jae Kim, Jung-Hsien Chiang, Yu-De Chen, Jian-Ming Chen, Hong-Jie Dai, Zhiyong Lu. Overview of the Gene Ontology Task at BioCreative IV. Database Oxford, 2014 Luu Anh Tuan, Jung-jae Kim. Automatic Suggestion for PUBMED Query Reformulation. Journal of Computing Science and Engineering, 2012 Conference papers: 2025 Haoran Luo, Haihong E, Guanting Chen, Yandan Zheng, Xiaobao Wu, Yikai Guo, Qika Lin, Yu Feng, Zemin Kuang, Meina Song, Yifan Zhu, Luu Anh Tuan. HyperGraphRAG: Retrieval-Augmented Generation via Hypergraph-Structured Knowledge Representation. The Conference on Neural Information Processing Systems (NeurIPS), 2025 Mingzhe Du, Luu Anh Tuan, Yue Liu, Yuhao QING, Dong HUANG, Xinyi He, Qian Liu, Zejun MA, See-Kiong Ng. Afterburner: Reinforcement Learning Facilitates Self-Improving Code Efficiency Optimization. The Conference on Neural Information Processing Systems (NeurIPS), 2025 Yuhao QING, Boyu Zhu, Mingzhe Du, Zhijiang Guo, Terry Yue Zhuo, Qianru Zhang, Jie M. Zhang, Heming Cui, Siu Ming Yiu, Dong HUANG, See-Kiong Ng, Luu Anh Tuan. EffiBench-X: A Multi-Language Benchmark for Measuring Efficiency of LLM-Generated Code. The Conference on Neural Information Processing Systems (NeurIPS), 2025 Ponhvoan Srey, Xiaobao Wu, Luu Anh Tuan. Unsupervised Hallucination Detection by Inspecting Reasoning Processes. Conference on Empirical Methods in Natural Language Processing (EMNLP), 2025 Siyue Zhang, Yilun Zhao, Liyuan Geng, Arman Cohan, Luu Anh Tuan, Chen Zhao. Diffusion vs. Autoregressive Language Models: A Text Embedding Perspective. Conference on Empirical Methods in Natural Language Processing (EMNLP), 2025 Siyue Zhang, Yuxiang Xue, Yiming Zhang, Xiaobao Wu, Luu Anh Tuan, Chen Zhao. MRAG: A Modular Retrieval Framework for Time-Sensitive Question Answering. Conference on Empirical Methods in Natural Language Processing (EMNLP), 2025 Guizhen Chen, Weiwen Xu, Hao Zhang, Hou Pong Chan, Deli Zhao, Luu Anh Tuan, Yu Rong. Let's See Clearly: Enhancing Multimodal LLM Reasoning with Better Visual Perception. Conference on Empirical Methods in Natural Language Processing (EMNLP), 2025 Guizhen Chen, Weiwen Xu, Hao Zhang, Hou Pong Chan, Chaoqun Liu, Lidong Bing, Deli Zhao, Luu Anh Tuan, Yu Rong. FineReason: Evaluating and Improving LLMs' Deliberate Reasoning through Reflective Puzzle Solving. Annual Meeting of the Association for Computational Linguistics (ACL), 2025 Do Xuan Long, Duong Ngoc Yen, Do Xuan Trong, Luu Anh Tuan, Kenji Kawaguchi, Shafiq Joty, Min-Yen Kan, Nancy F. Chen. Beyond In-Context Learning: Aligning Long-form Generation of Large Language Models via Task-Inherent Attribute Guidelines. Annual Meeting of the Association for Computational Linguistics (ACL), 2025 Thang Le, Huy Huu Nguyen, Luu Anh Tuan, Thien Huu Nguyen. Massively Multilingual Instruction-Following Information Extraction. Annual Meeting of the Association for Computational Linguistics (ACL), 2025 Zhiyuan Hu, Yuliang Liu, Jinman Zhao, Suyuchen Wang, WangYan, Wei Shen, Qing Gu, Luu Anh Tuan, See-Kiong Ng, Zhiwei Jiang, Bryan Hooi. LongRecipe: Recipe for Efficient Long Context Generalization in Large Language Models. Annual Meeting of the Association for Computational Linguistics (ACL), 2025 Xiaobao Wu, Liangming Pan, Yuxi Xie, Ruiwen Zhou, Shuai Zhao, Yubo Ma, Mingzhe Du, Rui Mao, Luu Anh Tuan, William Yang Wang. AntiLeakBench: Preventing Data Contamination by Automatically Constructing Benchmarks with Updated Real-World Knowledge. Annual Meeting of the Association for Computational Linguistics (ACL), 2025 Quang Hieu Pham, Thuy Duong Nguyen, Tung Pham, Luu Anh Tuan, Dat Quoc Nguyen. ClozeMath: Improving Mathematical Reasoning in Language Models by Learning to Fill Equations. Annual Meeting of the Association for Computational Linguistics (ACL), 2025 Huimin Xu, Xin Mao, Feng-Lin Li, Xiaobao Wu, Wang Chen, Wei Zhang, Luu Anh Tuan. Full-Step-DPO: Self-Supervised Preference Optimization with Step-wise Rewards for Mathematical Reasoning. Annual Meeting of the Association for Computational Linguistics (ACL), 2025 Huimin Xu, Xin",
  "content_length": 38808,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:38"
}