{
  "name": "Anhong Guo",
  "homepage": "https://guoanhong.com",
  "status": "success",
  "content": "Anhong Guo Anhong Guo é­å®é¸¿ My research develops Personal Assistive Technology â a new class of assistive systems that deeply adapts to usersâ individual abilities, physical contexts, and intents, to deliver just the right information, in the right modality, at the right time. Anhong Guo is a Morris Wellman Assistant Professor in Computer Science & Engineering at the University of Michigan, also affiliated with the School of Information. His research is at the intersection of HCI and AI, which leverages the synergy between human and machine intelligence to create interactive systems for accessibility, collaboration, and beyond. His research has received best paper, honorable mention, and artifact awards at CHI, UIST, ASSETS, and MobileHCI, and the 10-year impact award at ISWC on wearable technologies for warehouse order picking. He is a recipient of the NSF CAREER award, a Forbes' 30 Under 30 Scientist, a Google Research Scholar, an inaugural Snap Inc. Research Fellow, and a Swartz Innovation Fellow for Entrepreneurship. Anhong holds a Ph.D. in Human-Computer Interaction from Carnegie Mellon University, a Masterâs in HCI from Georgia Tech, and a Bachelor's in Electronic Information Engineering from BUPT. He has also worked in the Ability and Intelligent User Experiences groups in Microsoft Research, the HCI group of Snap Research, and the Accessibility Engineering team at Google. News Sep 19, 2025 ð Honored to be named the Morris Wellman Endowed Assistant Professor Aug 5, 2025 ð° Excited to receive an NSF award with Danna Gurari on Collaborative Research: HCC: Small: Accounting for Focus Ambiguity in Visual Questions Jun 6, 2025 ð Excited to receive the NSF CAREER award on DIY personal assistive technology! May 23, 2025 ð° Excited to receive Samsung START program funding with Ke Sun and Kang G. Shin to develop efficient wearable memory augmentation systems May 6, 2025 ð Congratulations to Jaylin Herskovitz, who will join Tufts CS as an Assistant Professor in Jan 2026 Apr 18, 2025 â We will welcome three PhD students to join us this Fall: Yuxuan Liu, Ellie Seehorn, and Muzhe Wu Mar 26, 2025 ð Congratulations to Ruei-Che Chang on receiving the Apple Scholars in AI/ML PhD fellowship Mar 3, 2025 â New talk: Personal Assistive Technology at the Stanford HCI Seminar Feb 12, 2025 ð° Excited to be part of the ARPA-H Michigan team led by Jason Corso to advance AI intelligent task guidance to upskill medical professionals for rural healthcare Feb 10, 2025 ð Congratulations to Jaylin Herskovitz on Susan Lipschutz Award for Rackham graduate students Oct 23, 2024 ð Ellie and Jaylin wrote a nice article about our lab, published in the ACM Crossroads magazine Oct 12, 2024 ð Our ISWC 2014 paper on evaluating order picking methods was awarded 10-year impact award Oct 8, 2024 ð Excited to receive a Google Academic Research Award on project WorldScribe Oct 1, 2024 ð WorldScribe, led by Ruei-Che Chang, awarded Best Paper Award at UIST 2024 Jul 14, 2024 ð° Excited to receive an NSF award SCH: Multimodal Techniques to Enhance Intra- and Post-operative Learning and Coordination between Attending and Resident Surgeons with PIs Xu Wang and Vitaliy Popov Jun 21, 2024 ð Congratulations to ð Dr. Lei Zhang on his wonderful Ph.D. defense! Lei will join NJIT Informatics as an Assistant Professor after a one-term postdoc at Princeton Jun 5, 2024 â The Human-AI Lab (HAIL) was at VISIONS 2024 hosted by the Ann Arbor District Library Publications Not There Yet: Evaluating Vision Language Models in Simulating the Visual Perception of People with Low VisionRosiana Natalie, Wenqian Xu, Ruei-Che Chang, Rada Mihalcea, Anhong GuoPreprintpdf · arXiv HandProxy: Expanding the Affordances of Speech Interfaces in Immersive Environments with a Virtual Proxy HandChen Liang, Yuxuan Liu, Martez Mott, Anhong GuoIMWUT/Ubicomp 2025pdf · ACM DL · arXiv · video · press release Probing the Gaps in ChatGPT Live Video Chat for Real-World Assistance for People who are Blind or Visually ImpairedRuei-Che Chang, Rosiana Natalie, Wenqian Xu, Jovan Zheng Feng Yap, Anhong GuoASSETS 2025pdf · ACM DL · arXiv A11yShape: AI-Assisted 3-D Modeling for Blind and Low-Vision ProgrammersZhuohao (Jerry) Zhang, Haichang Li, Chun Meng Yu, Faraz Faruqi, Junan Xie, Gene S-H Kim, Mingming Fan, Angus G. Forbes, Jacob O. Wobbrock, Anhong Guo, Liang HeASSETS 2025pdf · ACM DL · arXiv · video · press release DeckFlow: Iterative Specification on a Multimodal Generative CanvasGregory Croisdale, Emily Huang, John Joon Young Chung, Anhong Guo, Xu Wang, Austin Z. Henley, Cyrus OmarVL/HCC 2025pdf · arXiv Rubikon: Intelligent Tutoring for Rubik's Cube Learning Through AR-enabled Physical Task ReconfigurationHaocheng Ren*, Muzhe Wu*, Gregory Croisdale, Anhong Guo, Xu WangDIS 2025pdf · ACM DL · arXiv · video · 30s preview VISIONS of Accessibility: Human-AI Lab (HAIL), University of MichiganEllie Seehorn, Jaylin HerskovitzXRDS: Crossroads, The ACM Magazine for Students (Fall 2024)pdf · ACM DL · VISIONS 2024 event ProgramAlly: Creating Custom Visual Access Programs via Multi-Modal End-User ProgrammingJaylin Herskovitz, Andi Xu, Rahaf Alharbi, Anhong GuoUIST 2024pdf · ACM DL · arXiv · video · 30s preview · talk · website WorldScribe: Towards Context-Aware Live Visual DescriptionsRuei-Che Chang, Yuxuan Liu, Anhong GuoBest Paper AwardUIST 2024pdf · ACM DL · arXiv · video · 30s preview · talk · press release · worldscribe.org VRCopilot: Authoring 3D Layouts with Generative AI Models in VRLei Zhang, Jin Pan, Jacob Gettig, Steve Oney, Anhong GuoUIST 2024pdf · ACM DL · arXiv · video · 30s preview · talk EditScribe: Non-Visual Image Editing with Natural Language Verification LoopsRuei-Che Chang, Yuxuan Liu, Lotus Zhang, Anhong GuoASSETS 2024pdf · ACM DL · arXiv · video Audio Description CustomizationRosiana Natalie, Ruei-Che Chang, Smitha Sheshadri, Anhong Guo, Kotaro HaraASSETS 2024pdf · ACM DL · arXiv · video SoundShift: Exploring Sound Manipulations for Accessible Mixed-Reality AwarenessRuei-Che Chang, Chia-Sheng Hung, Bing-Yu Chen, Dhruv Jain, Anhong GuoDIS 2024pdf · ACM DL · arXiv · video ImageExplorer Deployment: Understanding Text-Based and Touch-Based Image Exploration in the WildAndi Xu, Minyu Cai, Dier Hou, Ruei-Che Chang, Anhong GuoW4A 2024pdf · ACM DL · talk · ImageExplorer app InteractOut: Leveraging Interaction Proxies as Input Manipulation Strategies for Reducing Smartphone OveruseTao Lu, Hongxiao Zheng, Tianying Zhang, Xuhai \"Orson\" Xu, Anhong GuoCHI 2024pdf · ACM DL · arXiv · video · 30s preview · press release BrushLens: Hardware Interaction Proxies for Accessible Touchscreen Interface ActuationChen Liang, Yasha Iravantchi, Thomas Krolikowski, Ruijie Geng, Alanson Sample, Anhong GuoUIST 2023pdf · ACM DL · video · 30s preview · press release Hacking, Switching, Combining: Understanding and Supporting DIY Assistive Technology Design by Blind PeopleJaylin Herskovitz, Andi Xu, Rahaf Alharbi, Anhong GuoCHI 2023pdf · ACM DL · full video · 30s preview · talk · dataset VRGit: A Version Control System for Collaborative Content Creation in Virtual RealityLei Zhang, Ashutosh Agrawal, Steve Oney, Anhong GuoCHI 2023pdf · ACM DL · full video · 30s preview · talk Human-Centered Deferred Inference: Measuring User Interactions and Setting Deferral Criteria for Human-AI TeamsStephan J. Lemmer, Anhong Guo, Jason J. CorsoIUI 2023pdf · ACM DL · code XSpace: An Augmented Reality Toolkit for Enabling Spatially-Aware Distributed CollaborationJaylin Herskovitz, Yi Fei Cheng, Anhong Guo, Alanson Sample, Michael NebelingISS 2022pdf · ACM DL · video · talk · code OmniScribe: Authoring Immersive Audio Descriptions for 360Â° VideosRuei-Che Chang, Chao-Hsien Ting, Chia-Sheng Hung, Wan-Chen Lee, Liang-Jin Chen, Yu-Tzu Chao, Bing-Yu Chen, Anhong GuoUIST 2022pdf · ACM DL · video · 30s preview · omniscribe.org CustomizAR: Facilitating Interactive Exploration and Measurement of Adaptive 3D DesignsChen Liang, Anhong Guo, Jeeeun KimDIS 2022pdf · ACM DL · 30s preview · talk CollabAlly: Accessible Collaboration Awareness in Document EditingCheuk Yin Phipson Lee*, Zhuohao Zhang*, Jaylin Herskovitz, JooYoung Seo, Anhong GuoHonorable MentionCHI 2022pdf · ACM DL · full video · 30s preview · talk · code ImageExplorer: Multi-Layered Touch Exploration to Encourage Skepticism Towards Imperfect AI-Generated Image CaptionsJaewook Lee, Jaylin Herskovitz, Yi-Hao Peng, Anhong GuoCHI 2022pdf · ACM DL · full video · 30s preview · talk TutorialLens: Authoring Interactive Augmented Reality Tutorials Through Narration and DemonstrationJunhan Kong, Dena Sabha, Jeffrey P. Bigham, Amy Pavel, Anhong GuoSUI 2021pdf · ACM DL · supplemental · video Designing Disaggregated Evaluations of AI Systems: Choices, Considerations, and TradeoffsSolon Barocas, Anhong Guo, Ece Kamar, Jacquelyn Krones, Meredith Ringel Morris, Jennifer Wortman Vaughan, W. Duncan Wadsworth, Hanna WallachAIES 2021pdf · ACM DL · arXiv · poster · slides · talk \"It's Complicated\": Negotiating Accessibility and (Mis)Representation in Image Descriptions of Race, Gender, and DisabilityCynthia L. Bennett, Cole Gleason, Morgan Klaus Scheuerman, Jeffrey P. Bigham, Anhong Guo, Alexandra ToHonorable MentionCHI 2021pdf · ACM DL · slides · talkImage: \"Walking in neighborhood with face mask\", by Disabled And Here, licensed under CC BY 4.0 Making Mobile Augmented Reality Applications AccessibleJaylin Herskovitz, Jason Wu, Samuel White, Amy Pavel, Gabriel Reyes, Anhong Guo, Jeffrey P. BighamASSETS 2020pdf · ACM DL · video · slides · talk Sense and Accessibility: Understanding People with Physical Disabilitiesâ Experiences with Sensing SystemsShaun K. Kane, Anhong Guo, Meredith Ringel MorrisBest Paper NomineeASSETS 2020pdf · ACM DL · slides · talkImage: \"Swing Gate - SL 931 - Belgium\", by Automatic Systems, licensed under CC BY 2.0 Disability and the COVID-19 Pandemic: Using Twitter to Understand Accessibility during Rapid Societal TransitionCole G",
  "content_length": 15905,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:39"
}