{
  "name": "Aniket Mahanti",
  "homepage": "https://www.cs.auckland.ac.nz/~amahanti",
  "status": "success",
  "content": "Aniket Mahanti's Homepage Aniket Mahanti Senior Lecturer (North America: Associate Professor) Department of Computer Science Room 303S-591 University of Auckland Auckland, NEW ZEALAND Bio Aniket Mahanti is a Senior Lecturer (North America: Associate Professor) of computer science at University of Auckland, New Zealand. He received his B.Sc. (Honours) in computer science from University of New Brunswick, Saint John in 2004. Later he moved to Calgary to pursue graduate studies and completed his Master's in 2006. He worked as a research associate for 2 years, and enrolled in the doctoral program in University of Calgary in 2008. He graduated with a Ph.D. in computer science in 2012. Since then, he has been working in the Department of Computer Science at the University of Auckland. Aniket's post-secondary education was fully funded by competitive national scholarships like NSERC CGS and AITF graduate student scholarship. Aniket brings in over 10 years of technical experience in Information technology and distributed systems. He regularly consults for top technology firms from around the world to help them better manage their Information Technology resources. Aniket has extensive teaching experience in several disciplines, including, computer science, mathematics, and business. His research interests are in the general area of computer networking with an emphasis on Internet measurements and performance evaluation. Aniket's research has appeared in top peer-reviewed conferences and journals. His publications can be found through well-known indexing services such as DBLP, Google Scholar, and SCOPUS. His work has been extensively cited in the research literature. He is actively involved with the research community through participation in prestigious conference TPCs, workshop organization, journal/conference reviewing, invited seminars, journal editing, international grant reviewing, and external M.Sc./Ph.D. examination, among other things. CV Please email me to request an updated academic CV (including references), research statement, teaching statement, and sample teaching evaluations. An industry CV is also available. Students Aniket is actively supervising several senior undergraduate and graduate students on multiple practical projects aimed at improving Internet performance. There are several fascinating research projects available for summer scholars, BTECH projects, COMPSCI 380/780 projects, Honours projects, Software Engineering Part 4 projects, and M.Sc./Ph.D. dissertations. Please contact me directly to discuss possibilities for these projects. Potential projects include (to name a few): Big data analytics, Business decision analysis, Performance evaluation, Internet measurements, Content delivery, Streaming, Smart grids, Fog computing, Cloud services, Cyber security and privacy, and Software Defined Networking (SDN). This homepage is perpetually under repair and intentionally lacking hyperlinks.",
  "content_length": 2954,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:40"
}