{
  "name": "Anil Somayaji",
  "homepage": "http://www.scs.carleton.ca/~soma",
  "status": "success",
  "content": "Anil's Home Page Anil Somayaji's Home Page Hello! I am an Associate Professor in the School of Computer Science at Carleton University, in Ottawa, Canada. I am also Associate Director of the Carleton Internet Security Lab. Teaching I am on a leave of absence for the 2025/2026 academic year. I will resume teaching in Fall 2026. In the past I have taught Operating Systems (COMP 3000), Distributed Operating Systems (COMP 4000/5102), Computer Systems Security (COMP 4108), Fundamentals of Web Applications (COMP 2406), and Introduction to Computer Game Design (COMP 1501). I have also taught graduate courses in Operating System and Web Security, Biological Approaches to Computer Security, and Intrusion Detection. Information on many of the past runs of these courses are available through my wiki. Research I am broadly interested in the areas of computer security, operating systems, artificial life, and complex adaptive systems. For more information on my research, please refer to these pages: My publications The Carleton Internet Security Lab ebpH, a successor to pH (old code here) I have been part of many program committees in the computer security space and have been particularly involved with the New Security Paradigms Workshop. Students I am currently formally advising the following graduate students: Lavesh Kamalesh (MHCI) Savannah Sidle (MHCI) John Shortt (PhD), co-supervised with Amy Felty I also work with students associated with the CISL and the CCSL. Prospective Students:I am not looking to take on new graduate students at this time. However, if you are very interested in working with me and you do not require funding, drop me a line. Contacting Me My email address is at the bottom of this page - this is the best way to contact me.  My mailing address, phone number, and my GPG/PGP public key (to verify my emails or send me confidential information) are on this page. Thanks for stopping by! --Anil soma at scs.carleton.ca. Last modified: November 27, 2025",
  "content_length": 1990,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:46"
}