{
  "name": "Anil Maheshwari",
  "homepage": "http://www.scs.carleton.ca/~maheshwa",
  "status": "success",
  "content": "Home Page of Anil Maheshwari अनिल माहेश्वरी Anil Maheshwari Professor Algorithms, Graphs & Geometry Lab School of Computer Science Carleton University 1125 Colonel By Drive, Ottawa, ON, K1S 5B6,  Canada E-mail: anil@scs.carleton.ca Office: 5125b HP Useful Pointers: Algorithms Seminar Research Interests My Schedule Publications CV General Teaching: Fall 2025 COMP 3801 COMP 5112 COMP 4900 Algorithms for Modern Data Sets Algorithms for Data Science Publications: Course Notes:  Notes on Algorithm Design Free Text Book:  Introduction to Theory of Computation Research Papers: See DBLP, Scholar, Scopus Upcoming Events: CALDAM 2026 (IIT Dharwad) Research Interests: Design, analysis, and implementation of  algorithms: I am interested in sequential, parallel, distributed, multi-core, external memory, big and small data algorithms for problems that fit within the framework of the design and analysis of algorithms.  I mainly work in Geometric and Graph Algorithms. Discrete Mathematics: All sorts of discrete math problems - problems in graph theory, combinatorics, building discrete structures, finding applications in other fields. Check this web-page for the seminars in our group and I am interested in most of these topics. Have a look into my publications and this will give some ideas on my research interests. Students looking for a supervisor: I am looking for Ph.D., Masters and Honors Students. Honors Thesis/Project will typically be implementation oriented, unless the student comes up with an interesting topic along my research interests. Masters thesis will have a mix of theory and implementation in the broad area of the design and analysis of algorithms. I do not supervise Masters Projects. Ph.D. Thesis will have foundational theoretical work possibly supported by experimental studies. The research topics include computational geometry, graph algorithms, discrete mathematics, and problems that in general obey the framework of the design and analysis of discrete algorithms. (See the recent journals and conference proceedings, e.g., Jl. ACM, SIAM Jl. Computing, Algorithmica, Discrete and Computational Geometry,  CGTA, Proceedings of the  ACM-SIAM Symposium on Discrete Algorithms, Proceedings of Computational Geometry Conference, CCCGs). For list of my graduate students refer to my CV. The following requirements are essential if you want me to supervise: Honors Thesis LaTeX COMP 2804, 3801, 3804, 4804 What is a Proof? What is O-notation? Masters Good Knowledge of Design and Analysis of Algorithms (Example: What is Big-Oh Notation, How to analyze quicksort, What is a Binary Search Tree, What is Binomial Theorem, When to use BST v/s Heap?, ...) Problem Solving Skills. Ph.D. Strong Mathematical Background including courses in Linear Algebra, Graph Theory, Combinatorics, and Probability. Advanced courses in Design and Analysis of Algorithms, Data Structures, and preferably in Operating Systems, Graph Algorithms and Computational Geometry. Eagerness to learn. Problem Solving Skills. Education: 1982-1987: B.Eng. (Electrical and Electronics) and M.Sc. (Mathematics) from the  Birla Institute of Technology and Sciences, Pilani, India. 1987-1993: Ph.D. (Computer Science) from the Tata Institute of Fundamental Research, Mumbai (Bombay), India. 1993-1994: Postdoctoral fellow at the Max-Planck Institute f\\\"ur Informatik, Saarbr\\\"ucken, Germany. 1994-1995: Postdoctoral fellow/Research Associate at the Carleton University, Ottawa, Canada General: My old blog on Math Problems for Kids Stuck Between Two Places - Composed by my kid! http://www.freewebs.com/madagascar-wildlife/ Dr. A.P.J. Abdul Kalam's Lecture at Carleton University on October 3, 2012. Free Online TextBooks ‎Books to consider: Banker to the Poor by Muhammad Yunus Three Cups of Tea  by Greg Mortenson Stones into Schools by Greg Mortenson Into Thin Air by Jon Krakauer The Last Lecture by Randy Pausch The Number Devil by Hans Enzensberger Ottawa Vegetarian Restaurants: Govindas: 212 Somerset E (near uOttawa) The Green Door: 198 Main St. (you pay by weight!) Pizza Nerds",
  "content_length": 4079,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:45"
}