{
  "name": "Anil Madhavapeddy",
  "homepage": "https://anil.recoil.org",
  "status": "success",
  "content": "About I am the Professor of Planetary Computing at the University of Cambridge Computer Science department, where I co-lead the the Energy & Environment Group and am a member of the Systems Research Group. I obtained my PhD from the University of Cambridge in 2003 and my BEng in Information Systems Engineering from Imperial College in 1999. I research topics related to computer #systems and #programming languages, with a focus on applying the insights to global #conservation and #biodiversity. I am on the management committee of the Cambridge Conservation Initiative where I co-direct 4C and the Centre for Earth Observation, and collaborate with wonderful colleagues from Plant Sciences, Zoology, and Economics and NGOs such as UNEP-WCMC and the IUCN. I have held a JM Keynes Fellowship since 2022, towards my work on combining computer science with #economics. I teach computer science and am a Fellow at Pembroke College where I am the Director of Studies in Computer Science. I primarily lecture undergraduate courses such as the 1A Foundations of Computer Science, 1B Software & Security Engineering and II Cloud Computing. I work with a merry band of MPhil and PhD students and always enjoy discussing new ideas that may change the world for the better, or just be fun! The 2nd Edition of my book Real World OCaml was published in 2022 by Cambridge University Press and is available freely online and in print. I #hack on open-source software and am a long-time contributor to projects ranging from #OCaml (↗), #OpenBSD (↗), #Docker (↗) and #Xen (↗) and I co-founded the #MirageOS (↗) unikernel framework. I've been fortunate to have some of these projects rank among some of the most widely deployed pieces of free software in the world, and others that have had tremendous positive impact on the quality of computer systems. I #startup companies to make sure my work sees impact in the real world. I've co-founded Unikernel Systems, High Energy Magic, Segfault, Tarides, Parsimoni and worked for Docker, Citrix, XenSource, Intel Research, Fraser Research, Imperial College, and NASA MVACS. I occasionally sit on boards, such as Tarides (2019-) the Tezos Foundation (2021-2024) and Segfault Systems (2020-), but my current focus is on conservation via charities such as Canopy PACT. Interested students are welcome to get in touch informally, but all applications must go through the department process. You may find my research, papers, talks and ideas helpful background material before getting in touch. I'm extremely unlikely to respond to LLM-generated requests for internships, of which I now get dozens per week. I am signed up to the Keshav declaration on the necessity of computer scientists responding to the urgent #planetary crisis. I would really love to see a pika in real life. ×AllNonePapersNotesVideosProjectsIdeasLoading recent items...Ready↑ ↓ navigate↵ selectESC close",
  "content_length": 2901,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:42"
}