{
  "name": "Anil Kumar Sao",
  "homepage": "http://faculty.iitmandi.ac.in/~anil",
  "status": "success",
  "content": "Dr. Anil K. Sao << IIT Mandi Dr. A. K. Sao Phone : 01905-237918 EMail : anil[at]iitmandi[dot]ac[dot]in Address : School of Computing and Electrical Engineering IIT Mandi, PWD Rest House 2nd floor, near Bus Stand, Mandi - 175001 India Research interests Medical Image Processing Speech processing Microscopy Image processing Sparse representation Education B.E (Electronics) from GEC, Raipur, Pt. Ravishankar Shukla Univ.-Raipur, Chattisgarah M.S in Computer Science and Engineering from Indian Institute of Technology Madras-Chennai, TN Ph.D. in Computer Science and Engineering from Indian Institute of Technology Madras-Chennai, TN Thesis title: Representation of edge-like information in images with application for face recognition Professional Experience Indian Institute of Technology Mandi HP, Assoc Prof.: July 2016 - till date Indian Institute of Technology Mandi HP, Assistant Prof.: July 2010 - July 2016 International Institute of Information Technology-Hyderabad, AP Senior Research Assistant: Aug. 2009 - Jun 2010 Indian Institute of Technology Madras-Chennai, TN Project Associate: Oct. 2003 - July 2004 Publication in Journals P. Sharma, V. Abrol, Nivedita and A. K. Sao, \"Reducing footprint of unit selection based text-to-speech system using compressed sensing and sparse representation \", accepted in Computer Speech and Language, Elsevier, June 2018 P. Sharma, V. Abrol, and A. K. Sao, \"Sparse coding based features for speech units classification\", accepted in Computer Speech and Language, Elsevier,vol 47, pp 333-350, 2018 P. Sharma, V. Abrol, and A. K. Sao, \"Deep sparse representation based features for speech recognition \", IEEE Transactions Audio Speech and Language Processing, vol. 25, no. 11, pp. 2162--2175, 2017 S. Mandal, A. Bhavsar, and A. K. Sao, \"Depth Map Restoration from Under-sampled Data\", IEEE Transactions on Image Processing, vol. 26, no. 1., pp. 119-134, 2017 S. Mandal, A. Bhavsar, and A. K. Sao, \"Noise Adaptive Super-Resolution from Single Image via Non-Local Means and Sparse Representation \", Signal Processing, vol 132, pp. 134-149, 2017. S. Mandal and A. K. Sao, \" Employing Structural \\& Statistical Information to Learn Dictionary(s) for Single Image Super-Resolution in Sparse Domain\", Signal Processing: Image Communication,vol 48, pp. 63-80, 2016. V. Abrol, P. Sharma and A. K. Sao, \"Greedy double sparse dictionary for sparse representation of speech signals \", Speech Communications, vol. 85, pp. 71-82, 2016. V. Abrol, P. Sharma and A. K. Sao, \"Greedy dictionary learning for kernel sparse representation based classifier\", Pattern Recognition Letters, vo. 78, pp. 64-69, 2016. V. Abrol, P. Sharma and A. K. Sao,\"Voiced/Nonvoiced Detection in Compressively Sensed Speech Signals\", Speech Communication, vol. 72, pp. 194 - 207, 2015. S. Mandal, S. Thavalengal, and A. K. Sao, \"Explicit and Implicit Employment of Edge-related Information in Super-resolving Distant Faces for Recognition\", Pattern Analysis and Applications, vol. 19, no. 3, pp. 867-884, 2016. Anil Kumar Sao and B. Yegnanarayana, \"Edge extraction using zero-frequency resonator\". Signal, Image and Video Processing, Springer London, 1863-1703, WWW [note: 10.1007/s11760-011-0233-9]. A. K. Sao and B. Yegnanarayana, \"On the use of Phase of the Fourier transform for face recognition under variations in illumination \", to be published Signal, Image and Video Processing. A. K. Sao, B. Yegnanarayana and B. V. K. Vijay Kumar , \"Significance of image representation for face recognition\", Signal, Image and Video Processing , vol. 1, pp. 225-237, 2007. A. K. Sao and B. Yegnanarayana, \"Face verification using template matching\", IEEE Trans. Information Forensics and Security, vol. 2, No. 3, pp. 636-641, 2007. Publications in conferences Krati Gupta, Arnav Bhavsar, Anil Kumar Sao, \" CNN based Mitotic HEp-2 Cell Image Detection\",BIOIMAGING 2018: 167-174 Krati Gupta, Arnav Bhavsar, Anil Kumar Sao, \" Mitotic v/s non-mitotic HEp-2 cells classification for CAD based auto-immune disorder detection: a study using CNN\", COMAD/CODS 2018: 344-347 Debadatta Dash, Vinayak Abrol, Anil Kumar Sao, Bharat Biswal, \"The model order limit: Deep sparse factorization for resting brain\", ISBI 2018:1244-1247 Debadatta Dash, Vinayak Abrol, Anil Kumar Sao, Bharat Biswal, \"Spatial sparsification and low rank projection for fast analysis of multi-subject resting state fMRI data\", ISBI 2018: 1280-1283 Srishti Gautam, Arnav Bhavsar, Anil Kumar Sao, Harinarayan K. K., \"CNN based segmentation of nuclei in PAP-smear images with selective pre-processing\" Medical Imaging 2018: Digital Pathology, Houston, Texas, United States, 10-15 February 2018 Krati Gupta, Arnav Bhavsar, Anil Kumar Sao, \"Mitotic cells detection for HEp-2 specimen images using threshold-based evaluation scheme\" Medical Imaging 2018: Digital Pathology, Houston, Texas, United States, 10-15 February 2018 Srishti Gautam, Harinarayan K. K., Nirmal Jith, Anil Kumar Sao, Arnav Bhavsar, Adarsh Natarajan, \" Considerations for a PAP Smear Image Analysis System with CNN Features\", rXiv:1806.09025 [cs.CV], 2018. V. Abrol, P. Sharma, A. Thakur, P. Rajan, A. D. Dileep, Anil K. Sao, \"Archetypal Analysis Based Sparse Convex Sequence Kernel for Bird Activity Detection \" accepted for Proc. EUSIPCO 2017. V. Abrol, P. Sharma and A. K. Sao, \"Identifying Archetypes by exploiting Sparsity of Convex Representa- tions\", in Proc. SPARS, Lisbon, Portugal, 2017. V. Abrol, P. Sharma and A. K. Sao, \"Fast exemplar selection algorithm for matrix approximation and representation: A variant oASIS algorithm\", in Proc. IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), New Orleans, USA, 2017. V. Abrol, P. Sharma and A. K. Sao, \"Randomness is sufficient ! Approximate recovery from CS samples\", in Proc. International Traveling Workshop on Interaction between Sparse models and Technology (ITWIST), Aalborg, Denmark, 2016. V. Abrol, P. Sharma and A. K. Sao, \"Making Sense of Randomness: Fast Signal Recovery from Compressive Samples\", in Proc. 24th European Signal Processing Conference (EUSIPCO), Budapest, Hungary, 2016. S. Mandal, S. Kumari, A. Bhavsar, and A. K. Sao , \"Multi-Scale Image Denoising While Preserving Edges in Sparse Domain\", in Proc. 6th European Workshop on Visual Information Processing, EUVIP, Marseille, France, 2016. K. Gupta, S. Gautam, A. K. Sao, A. Bhavsar, \"Nucleus-based cervical cell classification in PAP smear images using decision-tree based approach\", in Proc. 6th European Workshop on Visual Information Processing, EUVIP, Marseille, France, 2016. V. Abrol, P. Sharma and A. K. Sao, S. F Roohi, A. A. Kassim, \"Fast and robust FMRI unmixing using hierarchical dictionary learning\", in Proc. IEEE International Conference on Image Processing (ICIP),Phoenix, AZ, US, 2016. M. Yadav, A. K. Sao, A. D. Dileep, Padmanabhan. R , \"Group delay functions for speaker diarization\", in Proc. IEEE 22nd National Conference on Communication (NCC), Guwahati, India, 2015. M. Yadav, A. K. Sao, A. D. Dileep, Padmanabhan. R , \"Group delay functions for speaker diarization\", in Proc. IEEE 22nd National Conference on Communication (NCC), Guwahati, India, 2015. P. Sharma, V. Abrol and A. K. Sao, \"Learned dictionaries for sparse representation based unit selection speech synthesis\", in Proc. IEEE 22nd National Conference on Communication (NCC), Guwahati, India, 2015. P. Sharma, V. Abrol, A. D. Dileep and A. K. Sao, \"Sparse Coding based features for speech units classification\", in Proc. 16th Annual Conference (INTERSPEECH), Dresden, Germany, 2015. P. Sharma, V. Abrol and A. K. Sao, \"Compressed Sensing for unit selection based Speech Synthesis\", in Proc. 23rd European Signal Processing Conference (EUSIPCO), Nice France, 2015. A. Babu, and A. K. Sao, \"Unit Selection Using Acoustic Suprasegmental Cues to Improve Prosody\", in Proc. International Conference on Non Linear Speech Processing (NOLISP), Salerno, Italy, 2015. P. Sharma, V. Abrol and A. K. Sao, \"Supervised Speech Enhancement Using Compressed Sensing\", in Proc. IEEE 21st National Conference on Communication (NCC), Mumbai, India, 2015. K. Gupta, V. Gupta, A. Bhavsar, and A. K. Sao , \"Class-specific hierarchical classification for HEp-2 specimen images\", in Proc. IEEE International Conference on Image Processing, Qubecity, Canada, 2015. P. Agarwal, A. K. Sao, and A. Bhavsar, \"Mean-shift based segmentation of cell nuclei in cervical PAP-smear images\", in Proc. National Conference on Computer Vision, Pattern Recognition, Image Processing and Graphics (NCVPRIPG 2015), Patna, India, 2015. R. Prajapati, A. Bhavsar, and A. K. Sao, \"`A hierarchical class-grouping approach, and a study of classification strategies for leaf classification\", in Proc. National Conference on Computer Vision, Pattern Recognition, Image Processing and Graphics (NCVPRIPG 2015), Patna, India, 2015. K. Gupta, V. Gupta, A. K. Sao, A. Bhavsar, and A. D. Dileep, \"Class-specific hierarchical classification of HEp-2 cell images: The case of two classes\", in Proc. Workshop on Pattern Recognition Techniques for Indirect Immunofluorescence Images (with ICPR 2014), Stockholm, Sweden, 2014. S. Mandal, A. Bhavsar, and A. K. Sao, \"Super-resolving a Single Intensity/Range Image via Non-local Means and Sparse Representation\", in Proc. Indian Conference on Computer Vision, Graphics and Image Processing (ICVGIP), Bangalore, India Dec 2014. S. Shete, A. Bhavsar, and A. K. Sao, \"Enhancing shape from focus-measure-fusion and sparse representation\", in Proc. Indian Conference on Computer Vision, Graphics and Image Processing (ICVGIP), Bangalore, India Dec 2014. S. Mandal, A. Bhavsar, and A. K. Sao, \"Hierarchical Example-Based Range-Image Super-resolution with Edge-Preservation\", in Proc. IEEE International Conference on Image Processing (ICIP), pp. 3867-3871, Oct. 2014. A. Babu, R. Krishnan, A. K. Sao and H. A. Murthy , \"A Probabilistic Approach to Selecting Units for Speech Synthesis Based on Acoustic Similarity\", in Proc. National Con",
  "content_length": 14331,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:43"
}