{
  "name": "Animesh Trivedi",
  "homepage": "https://animeshtrivedi.github.io",
  "status": "success",
  "content": "Animesh Trivedi Animesh Trivedi Team Teaching Service Publications Blog Since July 2024, I am a Senior Research Scientist at IBM Research Lab, Zurich in the Hybrid Cloud Research Group. Prior to joining the research lab, I was a tenured Assistant Professor (tenure-tracked) in the Computer Systems (CompSys) Section in the Department of Computer Science, VU, Amsterdam. I led the StoNet (Storage-Networking) research group, which was a part of the Massiving Computer Systems group lead by Prof. Alexandru Iosup. I am a systems researcher. I like to design, implement, evaluate systems. My main research areas are in storage, networking, operating systems, and distributed systems. Broadly speaking, I am interested in the performance aspect of systems, spanning from multi-core CPUs to distributed systems. Currently, I am investigating how to leverage fast NVMe storage in data-heavy workloads like AI/ML and analytics Sticky Modern Storage System (StoSys) course lectures are publicly available on my teaching page. If you are interested in setting up such a course, drop me an email to share project material. (July 2024) We have shared the experience of setting up this course in a paper at CCGrid’24: . Dutch CompSys Research Manifesto, Future Computer Systems and Networking Research in the Netherlands: A Manifesto, https://arxiv.org/abs/2206.03259, 2022, . 2-page executive summary (PDF), Flyer (PDF) What is new December 27, 2024 » An eventful 2024! March 27, 2024 » New paper on analysis of the Linux I/O schedulers in ACM/SPEC ICPE'24 September 5, 2023 » New tech reports and thesis works now available May 30, 2023 » New HotOS'23 paper on CPU-free computing May 10, 2023 » Peter-Jan's first paper at Systor'23 on FS virtualization using DPUs May 8, 2023 » Zebin's first paper at CHEOPS'23 on benchmarking Linux storage stack April 3, 2023 » Nick Tehrany graduates from TU Delft and joins our group March 31, 2023 » Peter-Jan's talk on DPU-powered file systems accepted at the OFA workshop March 12, 2023 » Talk about the VU-UvA joint Computer Science Masters program March 6, 2023 » Gave a lecture on the I/O subsystem to Bsc students more posts… Bio: Animesh Trivedi is a Senior Research Scientist at the IBM Research Lab in Zurich, Switzerland. His current research interests lie in the area of cloud infrastructure, specifically around challenges surrounding data storage and processing with modern storage technologies (hardware, devices, platforms). Prior to joining the Zurich research lab, he was a tenured Assistant Professor at VU Amsterdam (2019-2024), where he led research and educational efforts in modern storage systems. He has authored more than 50 research manuscripts, holds several international patents, and has acquired support and funding from the Dutch Research Council (NWO), the EU (Cloudstars MSCA Staff Exchanges), and various industrial partners (Western Digital, Xilinx, AWS, Mellanox). For his research and educational work he has won multiple awards with his team of students at VU (Best Paper Awards at ICPE’24 and Systor’17, Best Paper Nomination at CCGrid’24, Best Presentation CompSys’19, Best Bsc and MSc Amsterdam Thesis Awards 2020 2022, Best FAIR Artifact Award IEEE ACSOS 2021). In 2023, he was inducted to the Amsterdam Young Academy. He has served on the program committee of multiple flagship systems conferences, and was the Storage Track co-chair for the 24th IEEE/ACM CCGRID conference 2024. He holds MSc. (2009) and PhD. (2016) degrees from ETH Zurich. More about his work can be found at https://animeshtrivedi.github.io. Contact Email: FIRSTNAME DOT LASTNAME AT IBM DOT COM Phone: +41 44 724 85 27 Office: K238, IBM Research GmbH, Säumerstrasse 4, CH–8803 Rüschlikon, Switzerland I am also on Github and LinkedIn. Last updated: 15-Sep-2025 Jekyll theme inspired by researcher",
  "content_length": 3836,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:44"
}