{
  "name": "Animesh Mukherjee 0001",
  "homepage": "https://cse.iitkgp.ac.in/~animeshm",
  "status": "success",
  "content": "Animesh Mukherjee Animesh Mukherjee Home CV Publications Courses Collaborators Special Moments Present Affiliation: Professor Department of Computer Science and Engineering, Indian Institute of Technology, Kharagpur, Poschimbongo, India -- 721302, FNAE Distinguished Member, ACM A K Singh Chair -- (2018 - 2022) Humboldt Fellow (Experienced Researchers) -- (2018 - 2022) Simons Associate, ICTP, Trieste, Italy -- (2014 - 2017) Phone: +91-3222283472 (Office)    +91-3222283473 (Residence) Email: animeshm-at-cse-dot-iitkgp-dot-ac-dot-in Brief Bio: Presently I am a Full Professor in the Department of Computer Science and Engineering, Indian Institute of Technology, Kharagpur. Prior to this, I was working as a post doctoral researcher in the Complex Systems Lagrange Lab, ISI Foundation, Italy. I received my PhD from the Department of Computer Science and Engineering, Indian Institute of Technology, Kharagpur with a thesis on self-organization of human speech sound inventories. My main research interests center around content governance which includes (i) content moderation (harmful content analysis, detection, and mitigation), (ii) content dissemination (fairness issues in e-commerce platforms and interfaced systems like facial recognition, automatic speech recognition etc.), and (iii) content maintenance (quality analysis and improvement of encyclopaedia like Wikipedia and large software systems like Ubuntu releases). In all these applications, I extensively use concepts from NLP, IR, and network science. Note to aspiring applicants: For Post-Doc: The Institute now has a regularized procedure to appoint post-docs. Interested candidates may directly write to me with a copy of their recent resume and one letter of recommendation. The formal process for application is outlined here. For PhD: The Institute has a centralized policy for PhD entrance. You can apply here. The syllabus for the entrance test is here. News/Upcoming Events: Year 2026 New paper accepted in AAAI 2026: AURA: Affordance-Understanding and Risk-aware Alignment Technique for Large Language Models. New paper accepted in TMLR 2026: MemeSense: An Adaptive In-Context Framework for Social Commonsense Driven Meme Moderation. New paper accepted in IEEE S&P 2026: Setting the Course, but Forgetting to Steer: Analyzing Compliance with GDPR's Right of Access to Data by Instagram, TikTok, and YouTube. Year 2025 Elected fellow of the Indian National Academy of Engineering (FNAE). New paper accepted in Drug and Alcohol Review: Language Models for standardising clinical notes and information extraction in addiction psychiatry – an empirical study. New paper accepted in ACM Multimedia 2025: Toxicity Begets Toxicity: Unraveling Conversational Chains in Political Podcasts. New paper accepted in AAAI 2025 (Alignment Track): SafeInfer: Context Adaptive Decoding Time Safety Alignment for Large Language Models. New paper accepted in EMNLP 2025 (Findings): Soteria: Language-Specific Functional Parameter Steering for Multilingual Safety Alignment. New paper accepted in ACL 2025 (Findings): HatePRISM: Policies, Platforms, and Research Integration. Advancing NLP for Hate Speech Proactive Mitigation. New paper accepted in ACL 2025 (Findings): MutantPrompt: Prompt Optimization via Mutation Under a Budget on Modest-sized LMs. New paper accepted in NAACL 2025: Navigating the Cultural Kaleidoscope: A Hitchhiker’s Guide to Sensitivity in Large Language Models. New paper accepted in ICWSM 2025: Exploring the Limits of Zero Shot Vision Language Models for Hate Meme Detection: The Vulnerabilities and their Interpretations. New paper accepted in ICWSM 2025: Exploring Disparity-Accuracy Trade-offs in Face Recognition Systems: The Role of Datasets, Architectures, and Loss Functions. New paper accepted in NAACL 2025 (Industry Track): Breaking Boundaries: Investigating the Effects of Model Editing on Cross-linguistic Performance. New paper accepted in NAACL 2025 (Industry Track): Efficient Continual Pre-training of LLMs for Low-resource Languages. New paper accepted in WebSci 2025: Social Biases in Knowledge Representations of Wikidata separates Global North from Global South. New paper accepted in COLING 2025: RA-MTR: A Retrieval Augmented Multi-Task Reader based approach for Inspirational Quote extraction from long documents. New paper accepted in COLING 2025: Multilingual and Explainable Text Detoxification with Parallel Corpora. New paper accepted in ICWSM 2025: How (un)ethical are instruction-centric responses of LLMs? Unveiling the vulnerabilities of safety guardrails to harmful queries. New paper accepted in COLING 2025 (Industry Track): On the effective transfer of knowledge from English to Hindi Wikipedia. New paper accepted in COLING 2025 (Industry Track): REVerSum: A Multi-staged Retrieval-Augmented Generation Method to Enhance Wikipedia Tail Biographies through Personal Narratives. Year 2024 Siddharth receives Outstanding Poster Award certificate from the ICPR 2024 Doctoral Consortium. New paper accepted in EMNLP 2024 (Industry Track): Context Matters: Pushing the Boundaries of Open-Ended Answer Generation with Graph-Structured Knowledge Context. New paper accepted in CoNLL 2024: CrowdCounter: A benchmark type-specific multi-target counterspeech dataset. New paper accepted in CoNLL 2024: Text2Afford: Probing Object Affordance Prediction abilities of Language Models solely from Text. New paper accepted in EMNLP 2024 (Findings): Cost-Performance Optimization for Processing Low-Resource Language Tasks Using Commercial LLMs. New paper accepted in IEEE ICKG 2024: DENOASR: Debiasing ASRs through Selective Denoising. New paper accepted in AIES 2024: Sponsored is the New Organic: Implications of Sponsored Results on Quality of Search Results in the Amazon Marketplace. New paper accepted in AIES 2024: Breaking the Global North Stereotype: A Global South-centric Benchmark Dataset for Auditing and Mitigating Biases in Facial Recognition Systems. Received the Microsoft Academic Partnership Grant 2024. New paper accepted in ECML-PKDD 2024: DistALANER: Distantly Supervised Active Learning Augmented Named Entity Recognition in the Open Source Software Ecosystem. New paper accepted in CSCW 2024: Investigating Nudges toward Related Sellers on E-commerce Marketplaces: A Case Study on Amazon. New paper accepted in Wiki Workshop 2024: WikiTransfer: Knowledge transfer from High-Resource to Low-Resource Language in Multilingual Wikipedia. New paper accepted in LREC-COLING 2024: On Zero-Shot Counterspeech Generation by LLMs. New paper accepted in LREC-COLING 2024: InfFeed: Influence Functions as a Feedback to Improve the Performance of Subjective Tasks. New paper accepted in LREC-COLING 2024: Evaluating ChatGPT Against Functionality Tests for Hate Speech Detection. New paper accepted in ICWSM 2024: A Deep Dive into the Disparity of Word Error Rates Across Thousands of NPTEL MOOC Videos. New paper accepted in EACL 2024 (Findings): Low-Resource Counterspeech Generation for Indic Languages: The Case of Bengali and Hindi. Year 2023 New paper accepted in EMNLP 2023: BanglaAbuseMeme: A Dataset for Bengali Abusive Meme Classification. New paper accepted in EMNLP 2023 (Findings): Probing LLMs for hate speech detection: strengths and vulnerabilities. New paper accepted in Journal of Physics: Complexity: Modeling interdisciplinary interactions among physics, mathematics and computer science. My new book AI and Ethics: A Computational Perspective is available online now. Sagnik receives the competitive DAAD KOSPIE 2023-2024 Fellowship. New paper accepted in ECAI 2023: Rationale-Guided Few-Shot Classification to Detect Abusive Language. New paper accepted in ASONAM 2023: Auditing Gender Analyzers on Text Data. New paper accepted in ASONAM 2023: Duplicate Question Retrieval and Confirmation Time Prediction in Software Communities. New paper accepted in ACM TKDD: Improving Node Classification Accuracy of GNN through Input and Output Intervention. Our PNAS paper recently got covered in NYTimes. Read Few Are Addressing One of Social Media’s Greatest Perils I shall serve as a Senior Area Chair of EMNLP 2023 (Track: Computational Social Science and Cultural Analytics). New paper accepted in PNAS: On the rise of fear speech in online social media. New short paper accepted in ACL 2023 (Findings): Entropy-guided Vocabulary Augmentation of Multilingual Language Models for Low-resource Tasks. New paper accepted in The WebConf 2023: HateProof: Are Hateful Meme Detection Systems really Robust? New paper accepted in The WebConf 2023 (The History of the Web Track): A History of Diversity in the Web (Conference). New paper accepted in ICWSM 2023 (dataset track): HateMM: A Multi-modal Dataset for Hate Video Classification. New short paper accepted in WebSci 2023: Transfer Learning for Multilingual Abusive Meme Detection. New paper accepted in The WebSci 2023: Diversity matters: Robustness of bias measurements in Wikidata. Team Hate-Alert shall be delivering a tutorial titled Hate speech: Detection, Mitigation and Beyond at WSDM 2023. New paper accepted in ICWSM 2023: \"Dummy Grandpa, do you know anything?”: Identifying and Characterizing Ad hominem Fallacy Usage in the Wild. I shall serve as an Area Chair of AAAI 2023. I shall serve as an Associate Chair of CSCW 2023.",
  "content_length": 9323,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:44"
}