{
  "name": "Animesh Garg",
  "homepage": "http://animesh.garg.tech",
  "status": "success",
  "content": "Animesh GargAnimesh GargAI ResearcherGeorgia TechBlogCVanimesh.garg@gatech.eduGoogle ScholarPAIR Lab@animesh_garglinkedin.com/in/animeshgarggithub.com/animesh-gargCODA S1145, Atlanta, GA I am a Stephen Fleming Early Career Professor in Computer Science at Georgia Tech. I am in the School of Interactive Computing affiliated with Robotics and Machine Learning programs. I also hold courtesy appointments at University of Toronto and Vector Institute. I have previously held research leadership positions at Nvidia and Apptronik. My research vision is to build the Algorithmic Foundations for Generalizable Autonomy, that enables robots to acquire skills, at both cognitive & dexterous levels, and to seamlessly interact & collaborate with humans in novel environments. My group focuses on understanding structured inductive biases and causality for decision making. In particular we are looking at multi-modal object-centric and spatiotemporal event representations, self-supervised pre-training for reinforcement learning & control, principle of efficient dexterous skill learning. Research Interests: Foundation Models, Reinforcement Learning, Robotics, 3D Vision. Current Applications: Self-Driving Labs, Surgical Robotics, Manufacturing. Check out PAIR Group for info on our research and how to join us. NewsMay 2025Speaker at ICRA 2025 KeynoteMay 2025Invited Speaker at ICRA 2025 Workshops Speaking at Surgical Robotics and LLMs for TAMP workshops. May 20253 Paper accepted at ICRA 2025 Our work Sufia-BC, RoCODA, CLIMB on will be at ICRA 2025. April 2025Program Chair at ICLR 2025April 2025Speaker at ICLR 2025 Robot Learning WorkshopShow MoreRecent TalksData will Solve Robotics?May 2025, ICRA Keynote DebateSlidesRepresentations for Embodied FMsApr 2025, ICLR Robot Learning WorkshopSlidesPriors as Abstractions for AutonomyJune 2024, CVPR CORR WorkshopShow MoreExperience2024-Georgia Institute of TechnologyAssistant Professor2024-2025ApptronikChief Scientific Officer2018-2024Nvidia ResearchSenior Staff Research Scientist2019-2023University of Toronto / Vector InstituteAssistant Professor2016-2018Stanford UniversityPostdoc in Computer ScienceEducation2011—2016UC BerkeleyPh.D. in Operations ResearchMS in Computer Science2010—2011Georgia TechMS in Industrial Engineering2006—2010University of DelhiB.E. in Manufacturing Processes & AutomationTeachingCS 3600Introduction to AI (UG)Sp25CS 8803Deep Reinforcement Learning (Grad)F24, F25CSC 375Algorithmic Intelligence in Robotics (UG)F20, Sp22CSC 2547Deep Learning: 3D & Geometric Structure (Grad) Sp21CSC 475Introduction to Reinforcement Learning (UG) Sp21, F21CSC 2621Reinforcement Learning (Grad)Sp20",
  "content_length": 2663,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:44"
}