{
  "name": "Anindya Maiti",
  "homepage": "https://maiti.info/anindya",
  "status": "success",
  "content": "Anindya Maiti | About Me ABOUT ME RESEARCH SERVICES CV Anindya Maiti Security researcher by profession, technology enthusiast by hobby. Strong advocate of a secure, open, and free (as in freedom) Internet. Founder of GeoSNO, a distributed cloud storage service provider. Co-inventor of CryptoMiner, a blockchain-inspired educational board game. When away from computers, I would brew coffee, eat ramen, fix my beater car, and catch Pokémon in national parks. I am an Assistant Professor of Computer Science and Data Science and Analytics at the University of Oklahoma (OU), where I direct the SecretLab. SecretLab's research focus secretly lies in the areas of privacy and security, information assurance and network security, and applied AI/ML. I also serve as the Outreach Coordinator and Backend Systems Lead for ScooterLab, an NSF-funded micromobility test-bed in San Antonio, TX. Cool News: Join fellow hackers at Hacklahoma 2024 on February 10-11, 2024. Honored with Outstanding Faculty Award at OU. Serving on the IEEE S&P 2024 program committee. Email am@ou.edu University of Oklahoma anindya.maiti@utsa.edu UT San Antonio root@geosno.com GeoSNO Phone +1 (405) 325-4951 Office (OU) +1 (405) 723-8814 Mobile (USA) +61 458 502 928 Mobile (Australia) Crypto PGP Public Key BTC Address ETH Address Office Devon Energy Hall 210G 110 W Boyd St, Norman, Oklahoma 73019, USA. Office Hours Devon Energy Hall 245 Wednesdays 14:00-17:00 CST/CDT File Drop Securely send me any supercalifragilistic files here. Collaboration anindya @cloud.secretlab.page anindya @nextcloud.sprite.utsa.edu anindya Gitea | SecretLab anindyamaiti GitHub am@ou.edu Office 365 | OU Social anindyamaiti Cryptocat anindyamaiti#0793 Discord anindya Facebook anmaiti Flickr anindyamaiti Gab +anindyamaiti Google+ anmaiti Hangouts anmaiti Instagram anindyamaiti Kik anindyamaiti Line anindyamaiti LinkedIn anindya PeerTube | Maiti.info @anmaiti Pocket anindya-maiti Quora 1503977954 QQ u/anindyamaiti Reddit anindyamaiti Skype anindyamaiti Snapchat 4jyqup1o0ep... Spotify anindyamaiti Steam anindyamaiti Telegram anindyamaiti Tumblr @anindyamaiti Twitter anindyamaiti Vimeo anindyamaiti VKontakte anindyamaiti WeChat anindyamaiti Wire anindya maiti Xbox anindyamaiti YouTube 942 642 2043 Zoom (Personal) 807 614 5598 Zoom (OU) Last Update 15th April 2023 Copyrights © 2008-2025 Anindya Maiti",
  "content_length": 2361,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:45"
}