{
  "name": "Anind K. Dey",
  "homepage": "https://ischool.uw.edu/people/faculty/profile/anind",
  "status": "success",
  "content": "iSchool Directory | Information School | University of Washington Anind K. Dey CV Dean and Professor anind@uw.edu Mary Gates Hall 370 Affiliate Positions Adjunct Professor, University of Washington, Department of Human-Centered Design and Engineering Adjunct Professor, University of Washington, Paul G. Allen School of Computer Science & Engineering Specializations Human-computer interaction Machine learning and artificial intelligence Ubiquitous and mobile computing Research Areas Human-Computer Interaction Health and Well-Being Biography Anind K. Dey is a Professor and Dean of the Information School and Adjunct Professor in both the Allen School of Computer Science and Engineering and the Department of Human-Centered Design and Engineering. Anind is renowned for his early work in context-aware computing, an important theme in modern computing, where computational processes are aware of the context in which they operate and can adapt appropriately to that context. His research is at the intersection of human-computer interaction, machine learning, and ubiquitous computing. For the past few years, Anind has focused on passively collecting large amounts of data about how people interact with their phones and the objects around them, to use for producing detection and classification models for human behaviors of interest. He applies a human-centered and problem-based approach through a collaboration with an amazing collection of domain experts in areas of substance abuse (alcohol, marijuana, opioids), mental health, driving and transportation needs, smart spaces, sustainability, and education. These are all ongoing areas of research for Anind. Anind was inducted into the ACM SIGCHI Academy for his significant contributions to the field of human-computer interaction in 2015 and named an ACM Fellow in 2021. Anind is actively recruiting new students for Autumn 2025. Education Ph D, Computer Science, College of Computing, Georgia Tech, 2000 MS, Computer Science, College of Computing, Georgia Tech, 2000 MS, Aerospace Engineering, School of Aerospace Engineering, Georgia Tech, 1995 BASc, Computer Engineering, Simon Fraser University, 1993 Awards AAAI Classic Paper Award, 2024 Distinguished Paper Award - IMWUT/UbiComp 2023, 2023 Impact Award - UbiComp/ISWC 2021, 2021-2021 Best Paper - MobiCASE, 2016 Inducted into CHI Academy, 2015 Best Paper - CHI, 2014 Best Paper - Mobile HCI, 2014 Best Paper - DIS, 2012 Best Paper - ICOST, 2012 EvAAL Activity Recognition Contest, 2nd place, 2012 Georgia Tech Graphics, Visualization and Usability (GVU) Alumni Research Impact Award - Georgia Tech, 2007 Publications and Contributions Conference Proceeding A Framework for Designing Fair Ubiquitous Computing Systems (2023) Adjunct Proceedings of the 2023 ACM International Joint Conference on Pervasive and Ubiquitous Computing \\& the 2023 ACM International Symposium on Wearable Computing, pp. 366--373 Authors: Han Zhang, Leijie Wang, Yilun Sheng, Xuhai Xu, Jennifer Mankoff, Anind K Dey Journal Article, Academic Journal Distress among undergraduates: Marginality, stressors and resilience resources (2023) Journal of American college health, 71(5), pp. 1445--1453 Authors: Paula S Nurius, Yasaman S Sefidgar, Kevin S Kuehn, Jake Jung, Han Zhang, Olivia Figueira, Eve A Riskin, Anind K Dey, Jennifer Mankoff Journal Article, Academic Journal GLOBEM: Cross-Dataset Generalization of Longitudinal Human Behavior Modeling (2023) Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, 6(4), pp. 1--34 Authors: Xuhai Xu, Xin Liu, Han Zhang, Weichen Wang, Subigya Nepal, Yasaman Sefidgar, Woosuk Seo, Kevin S Kuehn, Jeremy F Huckins, Margie Morris, Paula S Nurius, Eve A Riskin, Shwetak Patel, Tim Althoff, Andrew Campbell, Anind K Dey, Jennifer Mankoff Journal Article, Academic Journal Leveraging Mobile Phone Sensors, Machine Learning, and Explainable Artificial Intelligence to Predict Imminent Same-Day Binge-drinking Events to Support Just-in-time Adaptive Interventions: Algorithm Development and Validation Study (2023) JMIR Formative Research, 7, pp. e39862 Authors: Sang Won Bae, Brian Suffoletto, Tongze Zhang, Tammy Chung, Melik Ozolcer, Mohammad Rahul Islam, Anind K Dey Journal Article, Academic Journal Leveraging large language models for mental health prediction via online text data (2023) arXiv preprint arXiv:2307.14385 Authors: Xuhai Xu, Bingshen Yao, Yuanzhe Dong, Hong Yu, James Hendler, Anind K Dey, Dakuo Wang Journal Article, Academic Journal Nightly sleep duration predicts grade point average in the first year of college (2023) Proceedings of the National Academy of Sciences, 120(8), pp. e2209123120 Authors: J David Creswell, Michael J Tumminia, Stephen Price, Yasaman Sefidgar, Sheldon Cohen, Yiyi Ren, Jennifer Brown, Anind K Dey, Janine M Dutcher, Daniella Villalba, others Journal Article, Academic Journal A Survey of Passive Sensing in the Workplace (2022) arXiv preprint arXiv:2201.03074 Authors: Subigya Nepal, Gonzalo J Martinez, Shayan Mirjafari, Koustuv Saha, Vedant Das Swain, Xuhai Xu, Pino G Audia, Munmun De Choudhury, Anind K Dey, Aaron Striegel, others Journal Article, Academic Journal A chronology of SIGCHI conferences: 1983 to 2022 (2022) Interactions, 29(6), pp. 34--41 Authors: Neha Kumar, Julie A Adams, Bill Buxton, Linda Candy, Pablo Cesar, Leigh Clark, Benjamin R Cowan, Anind K Dey, Dugas, Phoebe O Toups, Ernest Edmonds, others Journal Article, Academic Journal A computational framework for modeling biobehavioral rhythms from mobile and wearable data streams (2022) ACM Transactions on Intelligent Systems and Technology (TIST), 13(3), pp. 1--27 Authors: Runze Yan, Xinwen Liu, Janine Dutcher, Michael Tumminia, Daniella Villalba, Sheldon Cohen, David Creswell, Kasey Creswell, Jennifer Mankoff, Anind K Dey, others Conference Proceeding BoldMove: Enabling IoT Device Control on Ubiquitous Touch Interfaces by Semantic Mapping and Sequential Selection (2022) CHI Conference on Human Factors in Computing Systems Extended Abstracts, pp. 1--7 Authors: Tengxiang Zhang, Xin Zeng, Yinshuai Zhang, Xin Jiang, Xuhai Xu, Anind K Dey, Yiqiang Chen Journal Article, Academic Journal Collaborative eye tracking based code review through real-time shared gaze visualization (2022) Frontiers of Computer Science, 16(3), pp. 163704 Authors: Shiwei Cheng, Jialing Wang, Xiaoquan Shen, Yijian Chen, Anind K Dey Journal Article, Academic Journal Exploratory machine learning modeling of adaptive and maladaptive personality traits from passively sensed behavior (2022) Future Generation Computer Systems, 132, pp. 266--281 Authors: Runze Yan, Whitney R Ringwald, Julio Vega, Madeline Kehl, Sang Won Bae, Anind K Dey, Carissa A Low, Aidan GC Wright, Afsaneh Doryab Journal Article, Academic Journal Flexibility versus routineness in multimodal health indicators: A sensor-based longitudinal in situ study of information workers (2022) ACM Transactions on Computing for Healthcare (HEALTH), 3(3), pp. 1--27 Authors: Mary Jean Amon, Stephen Mattingly, Aaron Necaise, Gloria Mark, Nitesh Chawla, Anind K Dey, Sidney D'mello Journal Article, Academic Journal From 1983 to 2022: A Chronology of SIGCHI Conferences (2022) Authors: Neha Kumar, Julie Adams, Bill Buxton, Linda Candy, Pablo Cesar, Leigh Clark, Benjamin Cowan, Anind K Dey, Phoebe Toups Dugas, Ernest Edmonds, others Conference Proceeding Identifying links between drinking behavior and travel pattern to inform personalized digital alcohol intervention (2022) ALCOHOLISM-CLINICAL AND EXPERIMENTAL RESEARCH, 46, pp. 51A--51A Authors: SW Bae, B Suffoletto, E-Y Mun, Anind K Dey, Yiyi Ren, T Chung Journal Article, Academic Journal Impact of Online Learning in the Context of COVID-19 on Undergraduates with Disabilities and Mental Health Concerns (2022) ACM Transactions on Accessible Computing, 15(4), pp. 1--27 Authors: Han Zhang, Margie Morris, Paula Nurius, Kelly Mack, Jennifer Brown, Kevin Kuehn, Yasaman Sefidgar, Xuhai Xu, Eve Riskin, Anind K Dey, others Journal Article, Academic Journal Predicting multiple sclerosis outcomes during the COVID-19 stay-at-home period: Observational study using passively sensed behaviors and digital phenotyping (2022) JMIR Mental Health, 9(8), pp. e38495 Authors: Prerna Chikersal, Shruthi Venkatesh, Karman Masown, Elizabeth Walker, Danyal Quraishi, Anind K Dey, Mayank Goel, Zongqi Xia Conference Proceeding TypeOut: leveraging just-in-time self-affirmation for smartphone overuse reduction (2022) Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems, pp. 1--17 Authors: Xuhai Xu, Tianyuan Zou, Han Xiao, Yanzhang Li, Ruolin Wang, Tianyi Yuan, Yuntao Wang, Yuanchun Shi, Jennifer Mankoff, Anind K Dey Conference Proceeding 2021, April. Understanding health and behavioral trends of successful students through machine learning models. In International Conference on Human Interaction and Emerging Technologies (pp. 516-525). Springer, Cham. (2021) International Conference on Human Interaction and Emerging Technologies Authors: Abigale Kim, Fateme Nikseresht, Janine M Dutcher, Michael Tumminia, Daniella Villalba, Sheldon Cohen, K Creswell, David Creswell, Anind K Dey, Jennifer Mankoff, others Journal Article, Academic Journal CBT MobileWork\\copyright: User-centered development and testing of a mobile mental health application for depression (2021) Cognitive Therapy and Research, 45, pp. 287--302 Authors: Judith A Callan, Jacqueline Dunbar Jacob, Greg J Siegle, Anind K Dey, Michael E Thase, Annette DeVito Dabbs, Nikolaos Kazantzis, Armando Rotondi, Lisa Tamres, Ashley Van Slyke, others Journal Article, Academic Journal College from home during COVID-19: A mixed-methods study of heterogeneous experiences (2021) PloS one, 16(6), pp. e0251580 Authors: Margie Morris, Kevin S Kuehn, Jennifer Brown, Paula S Nurius, Han Zhang, Yasaman S Sefidgar, Xuhai Xu, Eve A Riskin, Anind K Dey, Sunny Consolvo, others Journal Article, Academic Journal Digital biomarkers of symptom bur",
  "content_length": 109632,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:46"
}