{
  "name": "Anirban Chowdhury",
  "homepage": "https://www.essex.ac.uk/people/chowd32703/anirban-chowdhury",
  "status": "success",
  "content": "Anirban Chowdhury | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Anirban Chowdhury People Dr Anirban Chowdhury Lecturer School of Computer Science and Electronic Engineering (CSEE) Email a.chowdhury@essex.ac.uk Location 5B.536, Colchester Campus Academic support hours Thursday 11.30-13.30 Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Dr. Anirban Chowdhury is a Lecturer in Neural Engineering and Robotics, School of ComputerScience and Electronic Engineering (CSEE), University if Essex (UoE) and a member of the Brain-computer interface and Neural Engineering (BCI-NE) Group, and Robotics Group at University of Essex. Prior to the joining at UoE Anirban was a postdoctoral Research Associate at the Northern Ireland Functional Brain Mapping Facility at Ulster University, Northern Ireland, UK. He holds a Ph.D. in Mechatronics from the Centre for Mechatronics at IIT Kanpur, India, M. Tech in Mechatronics from the School of Mechatronics and Robotics at IIEST, Shibpur, India, and B. Tech in Electronics and Communication Engineering from Kalyani Govt. Engineering College, India. He has contributed to two UK-India thematic partnership projects funded by the British Council, UK, and Department of Science and technology in India under grant UKIERI-DST-2013-14/126, DST-UKIERI-2016-17-0128, and DST-UKIERI2016-17-0128. He has also led the successful completion of two clinical trials on post-stroke robot-assisted neuro-rehabilitation, one in India (CTRI/2018/05/013876) and the other in the UK (ISRCTN1313909). His currentresearch interests are in the areas of robotic rehabilitation, brain-computerinterfaces, assistive technologies, human-robot co-operation, and autonomousmobile robotics. He has published several journal papers in the top journals of the field, including transactions and journals of the IEEE and Elsevier. Qualifications Ph.D. Indian Institute of Technology Kanpur, (2018) M. Tech Indian Institute of Engineering Science and Technology, Shibpur, (2013) B.Tech Kalyani Govt. Engieering College, (2010) Appointments University of Essex Lecturer(R), School of Computer Science and Electronic Engineering (CSEE), University of Essex (30/8/2019 - present) Research and professional activities Research interests Brain-computer Interfaces Open to supervise Assistive Technology Open to supervise Neurorehabilitation Open to supervise Human-robot Co-operation Open to supervise Autonomous Mobile Robots Open to supervise Conferences and presentations Acceleration of EEG signal processing on FPGA: A Step Towards Embedded BCI Invited presentation, IEEE COINS 2024, IEEE COINS 2024, London, United Kingdom, 30/7/2024 Teaching and supervision Current teaching responsibilities Team Project Challenge (CE101) Team Project Challenge (CE201) Control theory and practice (CE269) Current supervision Reshmi Mavadi Sivadasan Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Parasto Azizinezhad Thesis title: Development of Adaptive Gaze-Based Human-Machine Interface for Enhancing Assisted Daily Living Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 28/8/2025 Antonios Porichis Thesis title: Reaping the Rewards of Autonomous Robotic Harvesting: Imitation Learning of Picking Motions Directly From Video Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 24/2/2025 Publications Journal articles (16) Khanna, S., Chowdhury, A., Dutta, A. and Subramanian, VK., (2024). SCSP-3: A Spectrally Augmented Common Spatial Pattern Approach for Robust Motor Imagery-based Brain-Computer Interface. IEEE Sensors Journal. 24 (5), 6634-6642 Kundu, S., Tomar, AS., Chowdhury, A., Thakur, G. and Tomar, A., (2024). Advancements in Temporal Fusion: A New Horizon for EEG Based Motor Imagery Classification. IEEE Transactions on Medical Robotics and Bionics. 6 (2), 567-576 Saideepthi,, P., Gaur, P., Chowdhury, A. and Pachori, RB., (2023). Sliding Window along with EEGNet based Prediction of EEG Motor Imagery. IEEE Sensors Journal. 23 (15), 17703-17713 Youssofzadeh, V., Roy, S., Chowdhury, A., Izadysadr, A., Parkkonen, L., Raghavan, M. and Prasad, G., (2023). Mapping & decoding cortical engagement during motor imagery, mental arithmetic, and silent word generation using MEG. Human Brain Mapping. 44 (8), 3324-3342 Gaur, P., Chowdhury, A., McCreadie, K., Pachori, RB. and Wang, H., (2022). Logistic Regression with Tangent Space based Cross-Subject Learning for Enhancing Motor Imagery Classification. IEEE Transactions on Cognitive and Developmental Systems. 14 (3), 1188-1197 Gaur, P., Gupta, H., Chowdhury, A., McCreadie, K., Pachori, RB. and Wang, H., (2021). A Sliding Window Common Spatial Pattern for Enhancing Motor Imagery Classification in EEG-BCI. IEEE Transactions on Instrumentation and Measurement. 70, 1-9 Chowdhury, A. and Andreu-Perez, J., (2021). Clinical Brain-Computer Interface Challenge 2020 (CBCIC at WCCI2020): Overview, methods and results. IEEE Transactions on Medical Robotics and Bionics. 3 (3), 661-670 Chatterjee, D., Chowdhury, A., Gavas, R., Sinha, A. and Saha, SK., (2021). Real time estimation of task specific self-confidence level based on brain signals. Multimedia Tools and Applications. 80 (13), 19203-19217 Chowdhury, A., Dutta, A. and Prasad, G., (2020). Corticomuscular co-activation based hybrid brain-computer interface for motor recovery monitoring. IEEE Access. 8, 174542-174557 Roy, S., Rathee, D., Chowdhury, A., McCreadie, K. and Prasad, G., (2020). Assessing impact of channel selection on decoding of motor and cognitive imagery from MEG data. Journal of Neural Engineering. 17 (5), 056037-056037 Roy, S., Chowdhury, A., McCreadie, K. and Prasad, G., (2020). Deep Learning based Inter-subject Continuous Decoding of Motor Imagery for Practical Brain-Computer Interfaces. Frontiers in Neuroscience. 14, 918- Rathee, D., Chowdhury, A., Meena, YK., Dutta, A., McDonough, S. and Prasad, G., (2019). Brain–Machine Interface-Driven Post-Stroke Upper-Limb Functional Recovery Correlates With Beta-Band Mediated Cortical Networks. IEEE Transactions on Neural Systems and Rehabilitation Engineering. 27 (5), 1020-1031 Chowdhury, A., Nishad, SS., Meena, YK., Dutta, A. and Prasad, G., (2019). Hand-Exoskeleton Assisted Progressive Neurorehabilitation Using Impedance Adaptation Based Challenge Level Adjustment Method. IEEE Transactions on Haptics. 12 (2), 128-140 Chowdhury, A., Raza, H., Meena, YK., Dutta, A. and Prasad, G., (2019). An EEG-EMG Correlation-based Brain-Computer Interface for Hand Orthosis Supported Neuro-Rehabilitation. Journal of Neuroscience Methods. 312, 1-11 Chowdhury, A., Meena, YK., Raza, H., Bhushan, B., Uttam, AK., Pandey, N., Hashmi, AA., Bajpai, A., Dutta, A. and Prasad, G., (2018). Active Physical Practice Followed by Mental Practice Using BCI-Driven Hand Exoskeleton: A Pilot Trial for Clinical Effectiveness and Usability. IEEE Journal of Biomedical and Health Informatics. 22 (6), 1786-1795 Chowdhury, A., Raza, H., Meena, YK., Dutta, A. and Prasad, G., (2018). Online Covariate Shift Detection based Adaptive Brain-Computer Interface to Trigger Hand Exoskeleton Feedback for Neuro-Rehabilitation. IEEE Transactions on Cognitive and Developmental Systems. 10 (4), 1070-1080 Show all Conferences (15) Azizinezhad, P. and Chowdhury, A., Evaluating a Gaze-Controlled Navigation Interface: A User-Centered Approach Azizinezhad, P. and Chowdhury, A., (2025). Exploring Pupil Dilation as an Indicator of Performance in Gaze-Based Robot Navigation for Assistive Technology Kundu, S., Saha, P., Tomar, AS. and Chowdhury, A., (2024). Acceleration of EEG signal processing on FPGA: A Step Towards Embedded BCI Azizinezhad, P., Ghonchi, H. and Chowdhury, A., (2024). Pupil Diameter Classification using Machine Learning During Human-Computer Interaction Sudhakar, A. and Chowdhury, A., (2023). 3D localization of objects of daily living activities for rehabilitation applications Raza, H., Chowdhury, A. and Bhattacharyya, S., (2020). Deep Learning based Prediction of EEG Motor Imagery of Stroke Patients' for Neuro-Rehabilitation Application Raza, H., Chowdhury, A., Bhattacharyya, S. and Samothrakis, S., (2020). Single-Trial EEG Classification with EEGNet and Neural Structured Learning for Improving BCI Performance Chowdhury, A., Dutta, A. and Prasad, G., (2019). Can Corticomuscular Coupling be Useful in Designing Hybrid-Brain Robot Interfaces Towards Hand Functional Recovery? Chowdhury, A., Raza, H., Dutta, A. and Prasad, G., (2017). EEG-EMG based Hybrid Brain Computer Interface for Triggering Hand Exoskeleton for Neuro-Rehabilitation Chowdhury, A., Ansari, S. and Bhaumik, S., (2017). Earthworm like modular robot using active surface gripping mechanism for peristaltic locomotion Chowdhury, AMM., Kashem, FB., Hossan, A. and Hasan, MM., (2017). Brain controlled assistive buzzer",
  "content_length": 12323,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:46"
}