{
  "name": "Anirbit Mukherjee",
  "homepage": "https://www.research.manchester.ac.uk/portal/anirbit.mukherjee.html",
  "status": "success",
  "content": "Anirbit Mukherjee - Research Explorer The University of Manchester Anirbit Mukherjee Dr Lecturer in Machine Learning, Machine Learning and Robotics https://orcid.org/0000-0001-5189-8939 Accepting PhD StudentsPhD projectsFor more details see, https://anirbit-ai.github.io/repositories/ Personal profile OverviewDr. Anirbit is interested in the mathematics of neural networks and deep-learning. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationDoctor of Philosophy, Johns Hopkins UniversityJan 2016 → 15 Jul 2020Award Date: 15 Jul 2020Bachelor of Science, Chennai Mathematical InstituteMaster of Physics, Tata Institute of Fundamental ResearchPost-Doctorate , University of Pennsylvania: Wharton Areas of expertiseQA75 Electronic computers. Computer scienceResearch Beacons, Institutes and PlatformsInstitute for Data Science and AIChristabel Pankhurst InstituteKeywordsNeural Networks and Deep LearningStochastic OptimizationPartial Differential Equations Fingerprint Dive into the research topics where Anirbit Mukherjee is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Neural Network Mathematics 100% PDE Mathematics 75% Neural Net Mathematics 37% Finite Time Mathematics 37% Solving Differential Equation Mathematics 37% Loss Function Mathematics 37% Physics-Informed Neural Network Computer Science 37% Physics Informed Neural Network Engineering 37% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 8 Article 6 Poster 6 Preprint 3 Paper 1 More 1 Doctoral Thesis Research output per year Research output per year Global Convergence of SGD On Two Layer Neural NetsGopalani, P. & Mukherjee, A., 20 Jan 2025, In: Information and Inference: a Journal of the IMA. 22 p.Research output: Contribution to journal › Article › peer-review Open Access Neural Network 100% Regularization 50% Loss Function 50% Convergence Rate 50% Continuous Time 50% Towards Size-Independent Generalization Bounds for Deep Operator NetsGopalani, P., Karmakar, S., Kumar, D. & Mukherjee, A., 2 Dec 2024, In: Transactions on Machine Learning Research . 33 p.Research output: Contribution to journal › Article › peer-review Open Access PDE 100% Error Bound 100% Solving Differential Equation 100% Neural Network 100% Physical System 100% Size Lowerbounds for Deep Operator NetworksMukherjee, A. & Roy, A., 1 Feb 2024, In: Transactions on Machine Learning Research . 25 p.Research output: Contribution to journal › Article › peer-review Open Access PDE 100% Training Data 50% Reaction-Diffusion System 50% Dependent Data 50% Fixed Model 50% Improving PINNs By Algebraic Inclusion of Boundary and Initial ConditionsRen, M., Fang, Z., Li, K. & Mukherjee, A., 30 Jul 2024, (In preparation) arXiv, p. 1-48, 48 p.Research output: Preprint/Working paper › Preprint File Physics-Informed Neural Network 100% Initial Condition 100% Boundary Condition 100% Initial and Boundary Condition 100% Physics Informed Neural Network 100% 110 Downloads (Pure) Langevin Monte-Carlo Provably Learns Depth Two Neural Nets at Any Size and DataKumar, D., Jha, S. & Mukherjee, A., 13 Mar 2025, (Submitted) arXiv, p. 1-10, 10 p.Research output: Preprint/Working paper › Preprint Gibbs Distribution 100% Gibbs Free Energy 100% Neural Loss 100% View all 24 research outputs Projects 1 Active Projects per year MCAIF: Centre for AI FundamentalsKaski, S. (PI), Alvarez, M. (Researcher), Pan, W. (Researcher), Mu, T. (Researcher), Rivasplata, O. (PI), Sun, M. (PI), Mukherjee, A. (PI), Caprio, M. (PI), Sonee, A. (Researcher), Leroy, A. (Researcher), Wang, J. (Researcher), Lee, J. (Researcher), Parakkal Unni, M. (Researcher), Sloman, S. (Researcher), Menary, S. (Researcher), Quilter, T. (Researcher), Hosseinzadeh, A. (PGR student), Mousa, A. (PGR student), Glover, E. (PGR student), Das, A. (PGR student), DURSUN, F. (PGR student), Zhu, H. (PGR student), Abdi, H. (PGR student), Dandago, K. (PGR student), Piriyajitakonkij, M. (PGR student), Rachman, R. (PGR student), Shi, X. (PGR student), Keany, T. (PGR student), Liu, X. (PGR student), Jiang, Y. (PGR student), Wan, Z. (PGR student), Harrison, M. (Support team), Machado, M. (Support team), Hartford, J. (PI), Kangin, D. (Researcher), Harikumar, H. (PI), Dubey, M. (PI), Parakkal Unni, M. (PI), Dash, S. P. (PGR student), Mi, X. (PGR student) & Barlas, Y. (PGR student)1/10/21 → 30/09/26Project: Research Reinforcement Learning 100% Neural Network 71% Approximation (Algorithm) 62% Machine Learning 61% Artificial Intelligence 56% Prizes Inaugural MINDS (JHU) Data Science Fellowship for 2019/2020 Mukherjee, A. (Recipient), 2019Prize: Fellowship awarded competitively Walter L. Robb Fellowship Mukherjee, A. (Recipient), Nov 2018Prize: Fellowship awarded competitively Activities 8 Publication peer-review 3 Editorial work 3 Invited talk 3 Oral presentation 3 More 1 Organising a conference, workshop, exhibition, performance, inquiry, course etc 1 Examination 1 Membership of professional association Activities per year London Mathematical Society (External organisation)Mukherjee, A. (Academic expert member)Dec 2024 → …Activity: Membership › Membership of professional association › Research Investigating the Ability of PINNs To Solve Burgers' PDE Near Finite-Time BlowUpKumar, D. (Speaker) & Mukherjee, A. (Speaker)4 Apr 2025Activity: Talk or presentation › Oral presentation › Research File Bigger PINNs Are Needed for Noisy PDE TrainingAndre-Sloan, S. (Speaker), Mukherjee, A. (Speaker) & Colbrook, M. (Speaker)Mar 2025Activity: Talk or presentation › Oral presentation › Research Annals of Statistics (Journal)Mukherjee, A. (Peer reviewer of publications)2025Activity: Publication peer-review and editorial work › Publication peer-review › Research Measuring the Risk of Solving Fluid Dynamics by Neural NetsKumar, D. (Speaker) & Mukherjee, A. (Speaker)15 Dec 2024Activity: Talk or presentation › Oral presentation › Research File View all 20 activities",
  "content_length": 6539,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:49"
}