{
  "name": "Anish Hirwe",
  "homepage": "https://iitpkd.ac.in/people/anish",
  "status": "success",
  "content": "anish | IIT Palakkad Englishहिन्दी A- A A+ 0491 209 2013 (Office) | info@iitpkd.ac.in INDIAN INSTITUTE OF TECHNOLOGY PALAKKAD Kanjikode | Palakkad | Kerala - 678623 0491 209 2001 (Office) | info@iitpkd.ac.in Dr. Anish HirweAssistant ProfessorComputer Science And EngineeringResearch Area: \"Computer Networks, Distributed Systems, Security\"View Website Biosketch Anish Hirwe is an Assistant Professor in the Department of Computer Science and Engineering at Indian Institute of Technology Palakkad (Jan 2023 onward). My key research interest is in the intersection of Computer Systems, Networks and Security. Current Focus I am actively working on research problems related to: High-performance networking and observability Programmable data planes and custom network behavior Container security Network telemetry in distributed systems for fine-grained monitoring and diagnostics Current Research Students Krishnaveni K S (PhD) Chikkala Kiran Babu  (PhD) Arishmita Biswas (MS) Formar Students B.Tech Anusha Chapati Laasya Priya Chitturi Priyanshu Vishnu Nair Yukta Salunkhe (Accenture Japan) Mangesh Dalvi (MoneyForward Japan) Shubhang Kedia (Sprinklr) Sahil (Sprinklr) M.Tech David Shepherd Chintala Aniket Nargotra Bio: Education PhD from Dept. of Computer Science and Engineering, IIT Hyderabad M.Tech. from Dept. of Computer Science and Engineering, IIT Guwahati B.E. from Dept. of Computer Engineering, Institute of Engineering and Technology, Devi Ahilya University, Indore Research/Teaching experience Assistant Professor, Dept. of Computer Science and Engineering, Mahindra University (Feb 2022- Jan 2023) Research Associate, Dept. of Computer Science and Engineering, IIT Hyderabad (Aug 2021- Jan 2022) Research My key research interest is in the intersection of Computer Systems, Networks and Security. Publications XLA-LB: Latency Aware Load Balancing Using XDP Krishnaveni K S, Anish HirweIEEE 50th Conference on Local Computer Networks (LCN)(2025) (2025) Building a Digital Twin Network of SDN Using Knowledge Graphs Deepu Raj Ramachandran Raj, Tahir Ahmed Shaik, Anish Hirwe, Praveen Tammana, Kotaro KataokaIEEE Access 11 63092 - 63106 (2023) ResiConnect - Fault Detection and Resilience for Multi-Stage AWGR-based Optical Networks. Anish Hirwe, Nikita Makharia, Tanmay Renugunta, Kotaro Kataoka23rd Asia-Pacific Network Operations and Management Symposium (APNOMS) (2022) FDN: Function Delivery Network - Optimizing Service Chain Deployment in NFV. Anish Hirwe, Kotaro KataokaIEICE Transactions on Communications E103-B (7) 712-725 (2020) Predicting Dynamic Network State of SFC Operation With Uncertainties Anish Hirwe, Ibrahim Dalal, Kotaro KataokaIEEE Communications Letters 24 (11) 2564 - 2568 (2020) VIBHAJAN: A Lightweight and Scalable Control Plane Management for Multi-Controller SDNMohd. Saalim Jamal, Anish Hirwe, Kotaro KataokaIEEE Conference on Network Function Virtualization and Software Defined Networks (NFV-SDN) (2018) Dynamic Network Function (DNF): Service Chain Placement and Bottleneck Removal for Edge-Fog-Cloud Interplay Anish Hirwe, Mrinal Aich, Kotaro KataokaACM Proceedings of the 14th Asian Internet Engineering Conference (AINTEC '18) (2018) LightChain: A lightweight optimisation of VNF placement for service chaining in NFV Anish Hirwe, Kotaro KataokaIEEE NetSoft Conference and Workshops (NetSoft) (2016) Address Indian Institute of Technology Palakkad Kanjikode | Palakkad Kerala | Pin: 678623 +91 491 209 2001 (Office) | +91 491 2092035 (Academic Section) netadmin@iitpkd.ac.in Copyright ©2023 Indian Institute of Technology Palakkad. All Rights Reserved.",
  "content_length": 3603,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:47"
}