{
  "name": "Anisur Rahaman Molla",
  "homepage": "https://sites.google.com/site/mollaanisurrahaman",
  "status": "success",
  "content": "Anisur Rahaman MollaSearch this siteEmbedded FilesSkip to main contentSkip to navigationAnisur Rahaman Molla Associate Professor               Cryptology and Security Research Unit R. C. Bose Centre for Cryptology and Security                      Indian Statistical Institute, Kolkata                              Email: molla (@isical dot ac dot in)                                   anisurpm (@gmail dot com)I am a faculty member at the Indian Statistical Institute (ISI). I earned my PhD from the School of Physical and Mathematical Sciences at Nanyang Technological University, Singapore. Mathematics Genealogy Project  Google Scholar Citations DBLPResearch Interest:My research interests are in distributed computing and network algorithms. In particular, I am interested in the theory and application of large-scale distributed networks, security in distributed computing, Byzantine computation, distributed computation using mobile agents, distributed processing of big data, design and analysis of distributed and parallel algorithms, randomized algorithms and probabilistic analysis of algorithms.Publications: *Authors' names are in alphabetical order   Journal Papers: Fault-Tolerant Dispersion of Mobile Robots, with Prabhat Kumar Chand, Manish Kumar, Sumathi Sivasubramaniam. Discrete Applied Mathematics (DAM), 2025. (accepted)Sublinear Message Bounds of Authenticated Implicit Byzantine Agreement, with Manish Kumar. Theoretical Computer Science (TCS-A), 2024. https://doi.org/10.1016/j.tcs.2024.114888. Invited special issue of selected papers of the ICDCN 2024. Efficient live exploration of a dynamic ring with mobile robots, with Subhrangsu Mandal, William K. Moses Jr. Theoretical Computer Science (TCS-A), volume 980, pages 114201, 2023. DOI: https://doi.org/10.1016/j.tcs.2023.114201On the Message Complexity of Fault-Tolerant Computation: Leader Election and Agreement, with Manish Kumar. IEEE Transactions on Parallel and Distributed Systems (TPDS), volume 34, pages 1115 - 1127, 2023. DOI: 10.1109/TPDS.2023.3239993.  Economy Versus Disease Spread: Reopening Mechanisms for COVID-19, J. Augustine, K. Hourani, A. R. Molla, G. Pandurangan, A. Pasic. PLOS ONE 2022, 17(9): e0272739, 2022. DOI: 10.1371/journal.pone.0272739.  [PDF]. (The paper analyses and suggests some reopening mechanisms that investigate trade off between containing the spread of COVID-19 and maximizing the economic activities. An explanation of the results in layman's language, by Gopal Pandurangan can be found at LINK.)Greedy Routing and the Algorithmic Small-World Phenomenon,  K. Bringmann, R. Keusch, J. Lengler, Y. Maus, A. R. Molla. Journal of Computer and System Sciences (JCSS), volume 125, pages 59 - 105, 2022. https://doi.org/10.1016/j.jcss.2021.11.003. Dispersion of Mobile Robots using Global Communication, A. D. Kshemkalyani, A. R. Molla, G. Sharma. Journal of Parallel and Distributed Computing (JPDC), volume 161, pages 100 - 117, 2022. https://doi.org/10.1016/j.jpdc.2021.11.007.  Optimal Dispersion on an Anonymous Ring in the Presence of Weak Byzantine Robots, A. R. Molla, K. Mondal, W. K. Moses Jr. Theoretical Computer Science (TCS-A), volume 887, pages 111 - 121, 2021. The Cost of Global Broadcast in Dynamic Radio Networks, M. Ahmadi, A. Ghodselahi, F. Kuhn, A. R. Molla. Invited for the special issue at Theoretical Computer Science (TCS-A), volume 806, pages 363 - 387, 2020. Optimal Deterministic Distributed Algorithms for Maximal Independent Set in Geometric Graphs, A. R. Molla, S. Pandit, S. Roy. Journal of Parallel and Distributed Computing (JPDC), volume 132, pages 36 - 47, 2019.Distributed Computation in Dynamic Networks via Random Walks, A. Das Sarma, A. R. Molla, G. Pandurangan. Theoretical Computer Science (TCS-A), volume 581, pages 45 - 66, 2015. Efficient Random Walk Sampling in Distributed Networks, A. Das Sarma, A. R. Molla, G. Pandurangan. Journal of Parallel and Distributed Computing (JPDC), volume 77, pages 84 - 94, 2015.Fast Distributed PageRank Computation, A. Das Sarma, A. R. Molla, G. Pandurangan, E. Upfal. Theoretical Computer Science (TCS-A), volume 561, pages 113-121, 2015. Invited special issue of selected papers of the 14th International Conference on Distributed Computing and Networking (ICDCN 2013).   Peer Reviewed Conference Papers:Computing Tree Structures in Anonymous Graphs via Mobile Agents, with Prabhat Kumar Chand, Manish Kumar. SSS 2025. Kathmandu, Nepal. Distributed Butterfly Analysis using Mobile Agents (Brief Announcement), with Prabhat Kumar Chand, Apurba Das. SPAA 2025. Portlad, Oregon, USA. Dispersion is (Almost) Optimal under (A)synchrony, with Ajay D. Kshemkalyani,  Manish Kumar, Debasish Pattanayak, Gokarna Sharma. SPAA 2025. Portlad, Oregon, USA. Near-Linear Time Leader Election in Multiagent Networks, with Ajay D. Kshemkalyani,  Manish Kumar, Gokarna Sharma. AAMAS 2025, Detroit, Michigan, USA.Faster Leader Election and its Applications for Mobile Agents with Parameter Advice, with Ajay D. Kshemkalyani,  Manish Kumar, Gokarna Sharma. ICDCIT 2025. Bhubaneswar, India.Optimal Fault-Tolerant Dispersion on Oriented Grids, with Rik Banerjee, Manish Kumar. ICDCN 2025. Hyderabad, India.Agent-based Leader Election, MST, and Beyond, with Ajay D. Kshemkalyani, Manish Kumar, Gokarna Sharma. DISC (BA) 2024. Madrid, Spain. Optimizing Robot Dispersion on Unoriented Grids: with and without Fault Tolerance, with Rik Banerjee, Manish Kumar. ALGOWIN 2024. Royal Holloway, Egham, UK. Agent-Driven BFS Tree in Anonymous Graphs with Application, with Prabhat Kumar Chand, Manish Kumar. NETYS 2024. Rabat, Morocco. Agent-Based Triangle Counting and its Applications in Anonyous Graphs, with Prabhat Kumar Chand, Apurba Das. AAMAS 2024 (extended abstract). Auckland, New Zealand. Sublinear Message Bounds of Authenticated Implicit Byzantine Agreement, with Manish Kumar. ICDCN 2024. Chennai, India. DOI: 10.1145/3631461.3631548Maximal Independent Set via Mobile Agents, with Debasish Pattanayak, Subhash Bhagat, Sruti Gan Chaudhuri. ICDCN 2024. Chennai, India. DOI: 10.1145/3631461.3631543Run for Cover: Dominating Set via Mobile Agents, with Prabhat Kumar Chand, Sumathi Sivasubramaniam. ALGOWIN 2023. Amsterdam, The Netherlands. DOI: 10.1007/978-3-031-48882-5\\_10Fast Deterministic Gathering with Detection on Arbitrary Graphs: The Power of Many Robots, with with Kaushik Mondal, William K. Moses Jr.  IPDPS 2023. St. Petersburg, Florida, USA. DOI: 10.1109/IPDPS54959.2023.00015Improved Deterministic Leader Election in Diameter-Two Networks, with Manish Kumar, Sumathi Sivasubramaniam. CIAC 2023. Larnaca, Cyprus. DOI: 10.1007/978-3-031-30448-4\\_23 Fault-Tolerant Dispersion of Mobile Robots, with Prabhat Kumar Chand, Manish Kumar, Sumathi Sivasubramaniam. CALDAM 2023. Gandhinagar, India. DOI: 10.1007/978-3-031-25211-2\\_3Byzantine Connectivity Testing in the Congested Clique, with John Augustine, Gopal Pandurangan, Yadu Vasudev. DISC 2022. Augusta, Georgia, USA. DOI: 10.4230/LIPIcs.DISC.2022.7Fault-Tolerant Graph Realizations in the Congested Clique, with Manish Kumar, Sumathi Sivasubramaniam. ALGOSENSORS 2022. Potsdam, Germany. DOI: 10.1007/978-3-031-22050-0\\_8Message Complexity of Multi-Valued Implicit Agreement with Shared Random Bits, with Kaustav Bose.  23rd International Conference on Distributed Computing and Networking (ICDCN 2022),  New Delhi, India (held virtually). Nominated for the best paper award (one among the four nominated papers).  Weak Amnesiac Flooding, with Zahra Bayramzadeh, Ajay D. Kshemkalyani, Gokarna Sharma. ISPDC 2021. Cluj-Napoca, Romania (Virtual conference). On the Message Complexity of Fault-Tolerant Computation: Leader Election and Agreement (Brief Announcement), with Manish Kumar. PODC 2021. Virtual (Originally in Italy). (pdf)Weak Amnesiac Flooding of Multiple Messages, with Zahra Bayramzadeh, Ajay D. Kshemkalyani, Gokarna Sharma. NETYS 2021. Virtual conference. Min-Max Gathering of Oblivious Robots (Brief Announcement), with Subhash Bhagat. SPAA 2021. Virtual (Originally in Philadelphia, USA) Byzantine Dispersion on Graphs, with Kaushik Mondal, William K. Moses Jr. IPDPS 2021. Portland, Oregon, USA.Smoothed Analysis of Leader Election in Distributed Networks, with Disha Shur. SSS 2020. Austin, Texas, USA.Scalable and Secure Computation Among Strangers: Message-Competitive Byzantine Protocols, with John Augustine, Valerie King, Gopal Pandurangan, Jared Saia. DISC 2020. Freiburg, Germany. Live Exploration with Mobile Robots in a Dynamic Ring, Revisited, with Subhrangsu Mandal, William K. Moses Jr. (arXiv). ALGOSENSORS 2020. Pisa, Italy.Efficient Dispersion on an Anonymous Ring in the Presence of Weak Byzantine Robots,  with Kaushik Mondal, William K. Moses Jr. ALGOSENSORS 2020. Pisa, Italy.Efficient Distributed Algorithms for the K-Nearest Neighbors Problem, with Reza Fathi, Gopal Pandurangan. 32nd ACM Symposium on Parallelism in Algorithms and Architectures (SPAA 2020, Brief Announcement), Philadelphia, USA.Efficient Dispersion of Mobile Robots on Dynamic Graphs, with Ajay D. Kshemkalyani, Gokarna Sharma. 40th IEEE International Conference on Distributed Computing Systems (ICDCS 2020), Singapore.Dispersion of Mobile Robots on Grids, with Ajay D. Kshemkalyani, Gokarna Sharma. 14th International Conference and Workshops on Algorithms and Computation (WALCOM 2020), Singapore. Dispersion of Mobile Robots in the Global Communication Model, with Ajay D. Kshemkalyani, Gokarna Sharma. 21st International Conference on Distributed Computing and Networking (ICDCN 2020), Kolkata, India. Fast Dispersion of Mobile Robots on Arbitrary Graphs, with Ajay D. Kshemkalyani, Gokarna Sharma. International Symposium on Algorithms and Experiments for Wireless Sensor Networks (ALGOSENSORS 2019), Munich, Germany. pdfEfficient Distributed Community Detection in the Stochastic Block Model, with Reza Fathi, Gopal Pandurangan. 39th IEEE International Conference on Distributed Computing Systems (ICDCS 2019), Texas, USA.The Communication Cost ",
  "content_length": 23196,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:48"
}