{
  "name": "Anish Mathuria",
  "homepage": "http://intranet.daiict.ac.in/~anish_mathuria",
  "status": "success",
  "content": "Anish Mathuria at DA-IICT Anish Mathuria Anish Mathuria joined the DA-IICT faculty as Associate Professor in 2003, and was promoted to Professor in 2008. He served as DA-IICT's Dean (R&D) from 2008-16. From 2000 to 2002, he was an Assistant Professor in Computer and Information Sciences at the University of Massachusetts, Dartmouth, USA. He received the Ph.D. and MS (Honors) degrees in Computer Science from the University of Wollongong, Australia, and a BE in Electronics Engineering from the University of Bombay. Between 1997 and 1999, he worked at the IBM Tokyo Research Laboratory as a Postdoctoral Researcher and Visiting Scientist. Publications I've co-authored the following books. Protocols for Authentication and Key Establishment, Springer, 2003 (with Colin Boyd). Protocols for Authentication and Key Establishment, Springer, 2019, second edition (with Colin Boyd and Douglas Stebila). In press. A list of my other publications can be found here. My author pages on Google Scholar and DBLP. Two papers which I am a co-author of have received best paper awards. I received the 1997 Australian Computer Science Association Best Paper Award for the paper \"Causality, partial orders, and lower bounds on rounds for a class of authentication protocols\". Joint work with my students received a joint best student paper award at SPACE 2020. Selected Professional Service I'm a member of ACM and IEEE, and a life member of the Cryptology Research Society of India. I served as a member of the editorial board of Sadhana (2018-2024), a journal of the Indian Academy of Sciences. I have served on the following conference committees: Program Co-Chair: ICISS 2010 General Co-Chair: SPACE 2019, SPACE 2013 Steering Committee Member: ICISS 2011 Program Commitee Member: ICISS 2023, SSS 2023, 3rd Workshop on Blockchain Technologies and its Applications, ISEA-ISAP'18, ACM Compute 2016, ICISS 2015, ICISS 2014, SPACE 2014, ICISS 2012, IFIPTM 2012 ICISS 2011, ICISS 2009, ICISS 2008, Indocrypt 2007 Indocrypt 2004. I have served on the DeitY committee for e-Authentication standards constituted by the Ministry of Communications and Information Technology, Govt. of India. Referee for over 12 journals including Information Processing Letters, Computers & Security, Information Sciences, IEEE TIFS, IEEE TSC, and IET Information Security. Grant reviewer for the Swiss National Science Foundation (2015). External Thesis Examiner: IIT Kharagpur (2022), IIT Guwahati (2012), QUT (2008). Funded Projects I was co-PI (Indian side) in the Indo-French project, \"Study of Privacy, Accountability and Ownership in IoT\". I was PI (Indian side) of a project supported by DST and JST under India-Japan cooperative program. Courses I've offered I have taught a variety of courses including Operating Systems, Systems Software, Data Structures, Security Protocols, System and Network Security, and Introduction to Cryptography. Students Advised I enjoy working with motivated students with strong programming skills. Graduated PhD Students Pranav Verma (thesis defended January, 2024) → Uppsala University Naveen Kumar (thesis defended May, 2017) → IIIT Vadodara BTP/Mini-project alumni Pratik Kayastha (B.Tech 2019) → Johns Hopkins University Chinmay Gameti (B.Tech 2019) → IISc Anamika Modi (B.Tech 2018) → Visa Sneha Mandan (B.Tech 2018) → Factset Smriti Sharma (B.Tech 2018) → CMU Harshul Vaishnav (B.Tech 2018) → University of Padova Aalisha Dalal (B.Tech 2018) → UCLA Varun Garg (B.Tech 2017) → NC State University Miti Mazmudar (B.Tech 2016) → University of Waterloo Anuroop Kuppam (B.Tech 2015) → smallcase → UMass Amherst Aditya Basu (B.Tech 2014) → Directi → Penn State University M.Tech alumni Aashish Paliwal, SmartPT: PayTree with Smart Contracts, 2021. Shubham Lata, Privacy Preserving Evaluation of a Web-Based Questionnaire, 2021. Arohi Patel, Automatic Compact Alphanumeric Encoding of Shellcode, 2016. Sunil Arora, Multipath Veritification Defense against SSL Stripping Attack, 2013. Bhupendra Rajput, Improved Authenticated Packet Marking for IP traceback, 2013. Anshu Yadav, Modelling and Detecting Attacks Against Key Agreement Protocols, 2012. Shefali Jain, Enhancement of Misbehavior Detection Scheme for Vehicular Ad-hoc Networks, 2012. Shaik Basha, Improvement of RAD Technique for Detecting Reflector based DoS Attack, 2012. Anil Mundra, A Prolog based Approach to Reasoning about Dynamic Hierarchical Key Assignment Schemes, 2011. Ankit Sethi, Performance Evaluation of Kerberos Cross-realm Authentication using Simnet, 2011. Shraddha Soni, Formal Analysis of Two Standardized Protocols Using Strand Spaces, 2008. Tejaskumar Shah, Improvement of Tagged Architecture for Preventing Software Vulnerabilities, 2008. Jai Gahlot, Security Analysis of Two Fair Exchange Protocols, 2007. Praveen Vadnala, Secure and efficient key assignment scheme for dynamic access control, 2006. Abhay Jain, Protecting Structures on Heap from Buffer Overflow Vulnerabilities with TIED - LibsafePlus, 2005. Ekata Mandot, Traitor Tracing for XML Documents, 2005. Pooja Kamra, ACIDS: Automated Co-stimulation based Intrusion detectiong system with a sense of Dynamic self, 2005. Shivani Agrawal, \"An improved algorithm for modular multiplication and its application to block cipher RC6\", 2004. Nirav Panchal,\"Protecting mobile agents against malicious hosts using trusted computing\", 2004. Rajul Jain, \"Contributions to Parasitic Computing\", 2004. Dheeraj Tandon, Covert communication in TCP/IP network, 2003. Pawan Jadia, \"Energy Efficient Secret Aggregation in Wireless Sensor Networks\", 2003.",
  "content_length": 5585,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:48"
}