{
  "name": "Anita Raja",
  "homepage": "https://anraja.commons.gc.cuny.edu",
  "status": "success",
  "content": "Anita Raja Home Page – Professor of Computer Science at Hunter College, City University of New York CUNY Academic CommonsPeopleGroupsSitesCoursesEventsActivityAboutLog InRegisterSearchHelp Skip to main content Anita Raja Home Page Professor of Computer Science at Hunter College, City University of New York Search for: Search Recent Posts +Aug 2025 Raja and Chang co-chair IJCAI 2025 Doctoral Consortium in Montreal, Canada +July 2025 Two Hunter Computer Scientists Awarded Google Cybersecurity Grants +May 2025 Nan, Mahdi and Kat win Best Poster Awards at GC CS 2025 PhD Poster Presentations +May 2025 Masters student Jeffery Hsu defends Masters thesis +May 25 Work on automatic refactoring of DL programs receives FASE 25 ETAPS Distinguished Paper Award +Mar 25 Mahdi presents poster at AAAI 25 workshop paper on Large Language Models and Gen AI for Health +Feb 2025 Dylan Dominguez defends Masters thesis +Mar 2025 Raja receives NSF grant for Doctoral Mentoring Consortium +Dec 2024 DAIR Lab Featured in CUNY Research in Focus + Nov 24 Novel ML Approach for Early Preclampsia Prediction to appear in BMC Pregnancy Childbirth Journal Welcome Email:              anita.raja@hunter.cuny.edu Office:             695 Park Avenue, Hunter North Building, NY, NY 10065 Anita Raja is Professor of Computer Science at Hunter College and a  member of the doctoral faculty in Computer Science at the Graduate Center, City University of New York. She was previously Acting Chair of the Department (2024-2025), Associate Dean of Research and Graduate Programs and Professor of Computer Science in the Albert Nerken School of Engineering at The Cooper Union (2014-2019) and an Associate Professor of Software and Information Systems at The University of North Carolina at Charlotte (2003-2014). Her research expertise lies at the intersection of bounded rationality, distributed problem-solving, and artificial intelligence. She has made significant contributions in the design and control of rational agents interacting in real-time, multi-agent environments operating in the context of uncertainty and limited computational resources. Raja directs the Distributed Artificial Intelligence Research (DAIR) Lab. Her work is supported by grants from NSF, NIH, ONR, DARPA, DHS and PNNL. She is a co-investigator at the Civic-Led Urban Adaptation Research Center (CIVIC-UARC), an initiative at the Cornell Mui Ho Center for Cities.  She is recipient of the  2006 UNCC College of Computing Essam El-Kwae Student-Faculty research award. Her work has been recognized with best paper awards and nominations including a Best Paper Award at the 2010 IEEE Intelligent Agent Technology Conference, the Distinguished Paper award at FASE 2025, a 2021 National Institutes of Health’s Decoding Maternal Morbidity Challenge prize for developing a new methodology that identified patients with a high risk of preeclampsia early in pregnancy. Crain’s New York Business named her as one of 75 “Notable Women in Tech” in the Greater New York City area in 2019 .   She was elected to serve as a member of the Executive Council of the  Association for the Advancement of  Artificial Intelligence  (AAAI) in 2022. She is  a senior member of AAAI  and a 2024 TEDxCUNY speaker. Raja received a B.S. Honors in Computer Science with a minor in Mathematics summa cum laude, Phi Beta Kappa from Temple University, Philadelphia in 1996, and a M.S. and Ph.D. in Computer Science from the University of Massachusetts Amherst in 1998 and 2003 respectively. Click here for Extended bio This entry is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International license. Need help with the Commons? Email us at [email protected] so we can respond to your questions and requests. Please email from your CUNY email address if possible. Or visit our help site for more information: Visit our help site Help Privacy Terms of Service Accessibility Creative Commons (CC) license unless otherwise noted Built with WordPress Protected by Akismet Powered by CUNY",
  "content_length": 4034,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:49"
}