{
  "name": "Ankit Rajpal",
  "homepage": "http://people.du.ac.in/~arajpal",
  "status": "success",
  "content": "Dr. Ankit Rajpal, Department of Computer Science, University of Delhi Ankit Rajpal Assistant Professor Department of Computer Science University of Delhi Ankit Rajpal Assistant Professor, Department of Computer Science, University of Delhi Biography Ankit Rajpal has been an Assistant Professor in the Department of Computer Science at the University of Delhi since November 2020. He has recently been awarded a research publication award. He has completed some research projects. He has a patent for a video watermarking tool developed for MPEG-4 AVC videos. He has a PhD in image and video watermarking from the Department of Computer Science, University of Delhi. His research interests include machine learning, explainable AI, watermarking, and data mining. He has published several papers in reputed international journals and conference proceedings. Beyond research, he has co-authored books aligned with the CBSE-prescribed syllabus on computer science and informatics practices. He obtained his M.Sc. and B.Sc. Honours degrees in Computer Science from the University of Delhi. He possesses around 11 years of teaching experience at the undergraduate level. He has been actively involved in curriculum design for undergraduate and postgraduate courses. His commitment to excellence is evident through his continuous efforts to enhance teaching skills, marked by successful participation in various faculty development programs and Massive Open Online Courses (MOOCs). His dedication extends beyond the classroom, as he has played a pivotal role in organizing workshops for computer science educators in schools and colleges. Academic Qualifications Ph.D. Computer Science* Department of Computer Science, University of Delhi *Thesis title: Watermarking Schemes of Images and Videos using Extreme Learning Machine and its Variants M.Sc. Computer Science Department of Computer Science, University of Delhi B.Sc. (Hons.) Computer Science Deen Dayal Upadhyaya College, University of Delhi Related Qualifications Qualified UGC National Eligibility test (NET) for Lectureship. Qualified GATE- with 98.63 percentile. Research Profile Research Award/ Grant A research grant based on CiteScore rankings from Scopus for publications in Q1 journals: Rs. 500,000 grant for research published in the topmost Q1 journal (highest-ranked within Q1). Rs. 100,000 grant for research published in Q1 journals ranked within the 11-20% range of the CiteScore rankings. PhD Guidance Awarded, 2024, Kountay Dwivedi, An Explainable AI-driven Approach to Non-Small Cell Lung Cancer Biomarkers Discovery (jointly with Prof. Naveen Kumar) Ongoing, Rashika Bagri (joining Date: 03 February 2022) Ongoing, Madhu Kashania (Joining Date: 15 February 2023) Ongoing, Bhomic Kaushik (jointly with Prof. Naveen Kumar) (Joining Date: 23 October 2023) Patent Ankit Rajpal, Anurag Mishra, and Rajni Bala. System and method for watermarking MPEG-4 Advanced Video Coding (AVC) videos . Indian Patent Office, assignee. Patent 346917. 16 Sept. 2020. Naveen Kumar, Rashmi Mishra, Ankit Rajpal, and Sheetal Rajpal. An interpretable leaf disease detection device (I-LDD). German Patent Office, assignee. 202024103925. 20 Aug. 2024. Manoj Agarwal, Naveen Kumar, Virendra Kumar, Ankit Rajpal, Sheetal Rajpal. Arpita Saggar, and Ashok Kumar Vaid. An explainable artificial intelligence-based biomarker discovery system. German Patent Office, assignee. 202024100861. 18 Apr. 2024. Journal Publications Rashika Bagri, Ankit Rajpal (2026). \"A novel approach for grading renal cell carcinoma using wavelet-aided nuclei segmentation and handcrafted morphological features.\" Biomedical Signal Processing and Control, 113, 108878. (Impact Factor: 4.9, SCIE (Q1)) https://doi.org/10.1016/j.bspc.2025.108878. Ankit Rajpal, Megha Khanna, Naman Singhal. \"Explainable-AI-assisted feature selection for software change-proneness prediction.\" Soft Computing (2025). (Impact Factor: 2.5, SCIE (Q2)) https://doi.org/10.1007/s00500-025-10751-4. Rashika Bagri, Ankit Rajpal, Naveen Kumar. \"A Novel Lightweight Deep Attention Network for Automated Nuclei Segmentation in Histopathology Images.\" Neurocomputing (2025): Vol 649, 130797. (Impact Factor: 6.5, SCIE (Q1)) https://doi.org/10.1016/j.neucom.2025.130797. Rashika Bagri, Ankit Rajpal. \"Explaining Fuhrman Grading using Deep Convolutional-Driven Features of Renal Cell Carcinoma.\" Procedia Computer Science (2025): Vol 258, 2140–2149, https://doi.org/10.1016/j.procs.2025.04.464. Gaurav Pandey, Rashika Bagri, Rajan Gupta, Ankit Rajpal, Manoj Agarwal, Naveen Kumar. \"Robust Weighted General Performance Score for Various Classification Scenarios Intelligent Decision Technologies.\" Intelligent Decision Technologies (2024), 18(3), 2033-2054. (Impact Factor: 0.8, SCIE (Q3)) https://doi.org/10.3233/IDT-240465. Ankit Rajpal, Rashmi Mishra, Sheetal Rajpal, Kavita, Varnika Bhatia, Naveen Kumar. \"Explaining Deep Learning-Based Leaf Disease Identification.\" Soft Computing (2024). (Impact Factor: 2.5, SCIE (Q2)) https://doi.org/10.1007/s00500-024-09939-x. Kountay Dwivedi, Anshuman Gupta, Ankit Rajpal, Naveen Kumar. \"Deep Learning-based NSCLC Classification from Whole-Slide Images: Leveraging Expectation-Maximization and InceptionV3.\" Procedia Computer Science (2024): Vol 235, 2422–2433, https://doi.org/10.1016/j.procs.2024.04.229. Kountay Dwivedi, Ankit Rajpal, Sheetal Rajpal, Virendra Kumar, Manoj Agarwal, Naveen Kumar. \"XL1R-Net: Explainable AI-driven Improved L1-Regularized Deep Neural Architecture for NSCLC Biomarker Identification.\" Computational Biology and Chemistry (2024): Vol 108, 107990 (Impact Factor: 3.1, SCIE (Q2)), https://doi.org/10.1016/j.compbiolchem.2023.107990. Kountay Dwivedi, Ankit Rajpal, Sheetal Rajpal, Virendra Kumar, Manoj Agarwal, Naveen Kumar. \"Enlightening the Path to NSCLC Biomarkers: Utilizing the Power of XAI-guided Deep Learning.\" Computer Methods and Programs in Biomedicine (2024): Vol 243, 107864 (Impact Factor: 4.8, SCIE (Q1)), https://doi.org/10.1016/j.cmpb.2023.107864. Ankit Rajpal, Subodh Kumar, Neeraj Kumar Sharma, Ajith Abraham, Anurag Mishra, Naveen Kumar. \"CXRmark: A Watermarking Scheme for Chest X-Rays using Online Sequential Reduced Kernel ELM.\" Circuits, Systems and Signal Processing (2023), 43(2), 965-993. (Impact Factor: 2.0, SCIE (Q2)), https://doi.org/10.1007/s00034-023-02491-3. Vanshika Dua, Ankit Rajpal, Sheetal Rajpal, Manoj Agarwal, Naveen Kumar. \"I-FLASH: Interpretable Fake News Detector using LIME And SHAP.\" Wireless Personal Communications (2023): 131, 2841–2874 (Impact Factor: 2.2, SCIE (Q2)), https://doi.org/10.1007/s11277-023-10582-2. Rashmi Mishra, Kavita, Ankit Rajpal, Varnika Bhatia, Sheetal Rajpal, Manoj Agarwal, Naveen Kumar. \"I-LDD: An Interpretable Leaf Disease Detector.\" Soft Computing (2023). (Impact Factor: 2.5, SCIE (Q2)) https://doi.org/10.1007/s00500-023-08512-2 Sheetal Rajpal, Ankit Rajpal, Manoj Agarwal, Virendra Kumar, Ajith Abraham, Divya Khanna, Naveen Kumar. \"XAI-CNVMarker: Explainable AI-based Copy Number Variant Biomarker Discovery for Breast Cancer Subtypes.\" Biomedical Signal Processing and Control (2023): Vol. 84, 104979. (Impact Factor: 4.9, SCIE (Q1)) https://doi.org/10.1016/j.bspc.2023.104979 Sheetal Rajpal, Ankit Rajpal, Arpita Saggar, Ashok K. Vaid, Virendra Kumar, Manoj Agarwal, Naveen Kumar. \"XAI-MethylMarker: Explainable AI Approach for Biomarker Discovery for Breast Cancer Subtype Classification using Methylation Data.\" Expert Systems with Applications (2023): Vol. 225, 120130. (Impact Factor: 7.5, SCIE (Q1)) https://doi.org/10.1016/j.eswa.2023.120130 Ankit Rajpal, Khushwant Sehra, Anurag Mishra, Girija Chetty. \"A low-resolution real-time face recognition using extreme learning machine and its variants.\" The Imaging Science Journal (2023), 71(5), 456-471, (Impact Factor: 1.1, SCIE (Q4)) https://doi.org/10.1080/13682199.2023.2183544 Kountay Dwivedi, Ankit Rajpal, Sheetal Rajpal, Manoj Agarwal, Virendra Kumar, Naveen Kumar. \"An Explainable AI-driven Biomarker Discovery Framework for Non-Small Cell Lung Cancer Classification.\" Computers in Biology and Medicine: Vol. 153, 106544 (2023) (Impact Factor: 6.3, SCIE (Q1)) https://doi.org/10.1016/j.compbiomed.2023.106544 Ankit Rajpal, Khushwant Sehra, Rashika Bagri, and Pooja Sikka. \"XAI-FR: Explainable AI-Based Face Recognition Using Deep Neural Networks.\" Wireless Personal Communications (2022): 129(1) 663-680. (Impact Factor: 2.2, SCIE (Q2)) https://doi.org/10.1007/s11277-022-10127-z Neeraj Kumar Sharma, Subodh Kumar, Ankit Rajpal, and Naveen Kumar. \"MantaRayWmark: An image adaptive multiple embedding strength optimization based watermarking using Manta Ray Foraging and bi-directional ELM.\" Expert Systems with Applications (2022): 200, 116860. (Impact Factor: 7.5, SCIE (Q1)) https://doi.org/10.1016/j.eswa.2022.116860 Subodh Kumar, Ankit Rajpal, Neeraj Kumar Sharma, Sheetal Rajpal, Anand Nayyar, and Naveen Kumar. \"ROSEmark: Robust Semi-blind ECG Watermarking Scheme using SWT-DCT Framework.\" Digital Signal Processing (2022): 103648. (Impact Factor: 3.0, SCIE (Q2)) https://doi.org/10.1016/j.dsp.2022.103648 Sheetal Rajpal, Manoj Agarwal, Ankit Rajpal, Navin Lakhyani, Arpita Saggar, and Naveen Kumar. \"COV-ELM Classifier: An Extreme Learning Machine based Identification of COVID-19 using Chest X-Ray Images.\" Intelligent Decision Technologies Pre-Press (2022): 16(1) 193-203, (Impact Factor: 0.8, SCIE (Q3)). https://doi.org/10.3233/IDT-210055 Ankit Rajpal, Anurag Mishra, and Rajni Bala. \"A Novel fuzzy frame selection based watermarking scheme for MPEG-4 videos using Bi-directional extreme learning machine.\" Applied Soft Computing 74 (2019): 603-620, (Impact Factor: 6.6, SCIE (Q1)). 10.1016/j.asoc.2018.10.043 Ankit Rajpal, Anurag Mishra, and Khushwant Sehra. \"A novel OS-ELM classifier based on HOG feature extraction and Viola Jones Algorithm for facial recognition.\" Issues in Information Systems 20, no. 2 (2019). https://www.iacis.org/iis/2019/ 2_iis_2019_117-127.pdf Anurag Mishra, ",
  "content_length": 36703,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:52"
}