{
  "name": "Ankit Agrawal 0002",
  "homepage": "https://www.slu.edu/science-and-engineering/academics/computer-science/faculty-and-staff/ankit-agrawal.php/index.php",
  "status": "success",
  "content": "Ankit Agrawal, Ph.D. : SLU - Saint Louis University Skip to main content Back to Main School of Science and Engineering Saint Louis University _ School of Science and Engineering Toggle menu Toggle search Search Search Popular Searches SLU People Finder Academic Programs SLU Libraries mySLU Login SLU Bookstore Academic Calendar School of Science and Engineering Request Info Visit Apply Give School of Science and Engineering About Academics Student Resources Faculty Research Toggle menu Ankit Agrawal, Ph.D. Assistant ProfessorComputer Science Education Ph.D. in Computer Science, University of Notre Dame, Notre Dame, INMaster's in Software Engineering, National Institute of Technology, Rourkela, India Research Interests Dr. Ankit Agrawal is an Assistant Professor in the Department of Computer Science at Saint Louis University. He received his Ph.D. degree in Computer Science from University of Notre Dame, Indiana in 2022. Ankit works at the intersection of Human-Computer Interaction and Autonomous Systems, where he uses human-centered design techniques to design, build, and study interactive systems in order to improve human interactions with complex autonomous systems. His research aims to develop intelligent robots or autonomous systems that can act alongside humans as effective team members. His research interests include Human-Computer Interaction, Cyber-Physical Systems, and Software Engineering. Labs and Facilities Human Computation Lab, Litteken Hall, Room 203 Publications and Media Placements J. Cleland-Huang, A. Agrawal, M. Vierhauser, M. Murphy and M. Prieto, \"Extending MAPE-K to support Human-Machine Teaming,\" 2022 International Symposium on Software Engineering for Adaptive and Self-Managing Systems (SEAMS), 2022, pp. 120-131, doi: 10.1145/3524844.3528054.Agrawal, Ankit, and Jane Cleland-Huang. \"Explaining Autonomous Decisions in Swarms of Human-on-the-Loop Small Unmanned Aerial Systems.\" In Proceedings of the AAAI Conference on Human Computation and Crowdsourcing, vol. 9, pp. 15-26. 2021.Vierhauser, Michael, Md Nafee Al Islam, Ankit Agrawal, Jane Cleland-Huang, and James Mason. \"Hazard analysis for human-on-the-loop interactions in sUAS systems.\" In Proceedings of the 29th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering, pp. 8-19. 2021.Agrawal, Ankit, Sophia J. Abraham, Benjamin Burger, Chichi Christine, Luke Fraser, John M. Hoeksema, Sarah Hwang et al. \"The next generation of human-drone partnerships: Co-designing an emergency response system.\" In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, pp. 1-13. 2020.Agrawal, Ankit, Jane Cleland-Huang, and Jan-Philipp Steghöfer. \"Model-driven requirements for humans-on-the-loop multi-uav missions.\" In 2020 IEEE Tenth International Model-Driven Requirements Engineering (MoDRE), pp. 1-10. IEEE, 2020. Next Steps to SLUReady to take the next step? Request more information, schedule a visit or apply for admission. Request Info Visit Campus Apply ©",
  "content_length": 3050,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:51"
}