{
  "name": "Ankita Shukla",
  "homepage": "https://ankita-shukla.github.io",
  "status": "success",
  "content": "Ankita Shukla | Machine Learning and Computer Vision Google Scholar Twitter About Me I am an Assistant Professor in the Computer Science and Engineering Department at University of Nevada Reno, USA. Before joining UNR, I was a Postdoctoral researcher in GML, working with Prof. Pavan Turaga at Arizona State University. I defended my PhD in Oct, 2020 from IIIT-Delhi under the guidance of Dr. Saket Anand. My dissertation title is “Exploring Geometric Constraints for Learning Representations for Visual Data”. During my PhD, I also worked as a visiting research scholar with Prof. Pavan Turaga for 6 months in 2019 (Feb - Aug) as well as during the summer of 2017. I received my Master’s degree from IIIT-Delhi. I was awarded Best Thesis Award for my thesis titled “Signal Processing Techniques to Reduce Energy Consumption in EEG Acquisition and Transmission for WBAN” under the guidance of Dr. Angshul Majumdar. My research interests lie in deep learning and machine learning approaches for visual and time series data, topological data analysis, differential geometry and geometry driven approaches for learning. From the applications point of view, I focus on AI for Science and AI for Social Good (specifically towards wildlife conservation and human health applications). Note: I am actively looking for self-motivated graduate and undergraduate students to join my lab! Contact Me Reach me at ankitas@unr.edu Updates and News Paper titled “Improving Shape Awareness and Interpretability in Deep Networks Using Geometric Moments” accepted at Workshop and Challenge on Deep Learning for Geometric Computing at CVPR 2023 Paper titled “Polynomial Implicit Neural Representations For Large Diverse Datasets” accepted at CVPR 2023 Paper titled “Understanding the Role of Mixup in Knowledge Distillation: An Empirical Study” accepted at WACV 2023. Paper titled “The Gradient-Boosting Method for Tackling High Computing Demand in Underwater Acoustic Propagation Modeling” accepted at Special Issue Numerical Modelling of Atmospheres and Oceans, June 2022. Paper titled “Machine-Learning Approach for Automatic Detection of Wild Beluga Whales from Hand-Held Camera Pictures” accepted at Special Issue Sensors and Artificial Intelligence for Wildlife Conservation, May 2022. Presented my work on “AI based tool for Beluga Whale Conservation and Monitoring” at Ocean Sciences Meeting 2022. Organizing the DiffCVML 2020 Workshop, held in conjunction with CVPR 2020. Recieved travel grant from WiML 2019 to present my work titled “Ignorance is Bliss: Semantic Pairing for Fine-grained Visual Recognition” in the workshop. Publications 2023 Polynomial Implicit Neural Representations For Large Diverse Datasets Rajhans Singh, Ankita Shukla, Pavan Turaga CVPR 2023 Improving Shape Awareness and Interpretability in Deep Networks Using Geometric Moments Rajhans Singh, Ankita Shukla, Pavan Turaga DLGC, CVPR 2023 2022 Learning Free Energy Pathways through Reinforcement Learning of Adaptive Steered Molecular Dynamics Nicholas Ho, John Kevin Cava, John Vant, Ankita Shukla, Jake Miratsky, Pavan Turaga, Ross Maciejewski, Abhishek Singharoy. MLSB, NeurIPS 2022 Understanding the Role of Mixup in Knowledge Distillation: An Empirical Study Hongjun Choi, Eunsom Jeon, Ankita Shukla, Pavan Turaga WACV 2023 The Gradient-Boosting Method for Tackling High Computing Demand in Underwater Acoustic Propagation Modeling D. Lagrois, T. R. Bonnell, A. Shukla and C. Chion Journal of Marine Science and Engineering Role of Data Augmentation Strategies in Knowledge Distillation for Wearable Sensor Data E. Jeon, A. Som, A. Shukla, K. Hasanaj, M. P. Buman; P. Turaga IEEE Internet of Things Journal, vol. 9, no. 14, pp. 12848-12860, 15 July, 2022 Machine-Learning Approach for Automatic Detection of Wild Beluga Whales from Hand-Held Camera Pictures V. M. Arujo, A. Shukla, C. Chion, S. Gambs and R. Michaud Special Issue Sensors and Artificial Intelligence for Wildlife Conservation Deep Geometric Moment R. Singh, A. Shukla, P. Turaga 2021 Geometric Priors for Scientific Generative Models in Inertial Confinement Fusion, Machine Learning for Physical Sciences Ankita Shukla, R. Anirudh, E. Kur, J. J. Thiagarajan, P. Bremer, B. K. Spears, T. Ma, P. Turaga Machine Learning for Physical Sciences, NeurIPS 2021. Towards Conditional Generation of Minimal Action Potential Pathways for Molecular Dynamics J. K. Cava, J. Vant, N. Ho, A. Shukla, P. Turaga, R. Maciejewski, A. Singharoy ELLIS Machine Learning for Molecule Discovery Workshop, 2021 Cleaning Adversarial Perturbations with Image-Subspace Projections Ankita Shukla, Pavan Turaga, Saket Anand 3rd Workshop on Adversarial Learning Methods for Machine Learning and Data Mining, KDD 2021. 2020 GraCIAS: Grassmannian of Corrupted Images for Adversarial Security A. Shukla, P. Turaga, S. Anand Semi-supervised Clustering with Neural Networks A. Shukla, G.S. Cheema, Saket Anand BigMM 2020. 2019 A Hybrid Approach for Tiger Re-Identification Ankita Shukla, C. Anderson, G. S. Cheema, P. Guo, S. Onda, D. Anshumaan, S. Anand, R. Farrell (Workshop and Challenge on CVWC, ICCV 2019) PrOSe: Product of Orthogonal Spheres Parameterization for Disentangled Representation Learning Ankita Shukla, Shagun Uppal, Sarthak Bhagat, Saket Anand, Pavan Turaga (BMVC 2019) Primate Face Identification in the Wild Pages 387-401 Ankita Shukla*, Gullal Singh Cheema*, Saket Anand, Qamar Qureshi, Yadvendradev Jhala (PRICAI 2019) (*Equal Contribution) 2018 Geometry of Deep Generative Models for Disentangled Representations Ankita Shukla, Shagun Uppal, Sarthak Bhagat, Saket Anand, Pavan Turaga (ICVGIP 2018) Perturbation Robust Representations of Topological Persistence Diagrams Anirudh Som, Kowshik Thopalli, K. N. Ramamurthy, V. Venkataraman, Ankita Shukla, Pavan Turaga (ECCV 2018) 2017 Metric Learning on Biological Sequence Embeddings Dhananjay Kimothi, Ankita Shukla, Pravesh Biyani, Saket Anand, James M. Hogan IEEE International Workshop on Signal Processing Advances in Wireless Communications (SPAWC 2017) Energy efficient EEG acquisition and reconstruction for a Wireless Body Area Network Wazir Singh, Ankita Shukla, Sujay Deb, Angshul Majumdar Integration, the VLSI Journal 2017 2016 Metric Learning based Automatic Segmentation of Patterned Species Ankita Shukla, Saket Anand International Conference on Image Processing (ICIP 2016) 2015 Distance Metric Learning by Optimization on the Stiefel Manifold (Best Student Paper) Ankita Shukla, Saket Anand Differential Geometry in Computer Vision (in conjunction with BMVC 2015) Combining Sparsity with Rank Deficiency for Energy Efficient EEG Sensing and Transmission over Wireless Body Area Network Angshul Majumdar, Ankita Shukla, Rabab Ward International Conference on Acoustics, Speech and Signal Processing (ICASSP 2015) Exploiting Inter-channel Correlation in EEG Signal Reconstruction Ankita Shukla, Angshul Majumdar Biomedical Signal Processing and Control 2015 A Kronecker Compressed Sensing formulation for energy efficient EEG sensing Ankita Shukla, Angshul Majumdar, Rabab Ward (ICAPR 2015) Row-sparse blind compressed sensing for reconstructing multi-channel EEG signals Ankita Shukla, Angshul Majumdar Biomedical Signal Processing and Control 2015 2014 Split Bregman Algorithms for Sparse/Joint-sparse and Low rank Signal Recovery: Application in Compressive Hyperspectral Imaging Anupriya Gogna, Ankita Shukla, Hemant Kumar Aggarwal, Angshul Majumdar IEEE International Conference on Image Processing (ICIP 2014) Energy Efficient Acquisition and Reconstruction of EEG Signals Wazir Singh, Ankita Shukla, Sujay Deb, Angshul Majumdar IEEE Engineering in Machine and Biology Conference (EMBC 2014) Matrix Recovery using Split Bregman Anupriya Gogna, Ankita Shukla, Angshul Majumdar 22nd International Conference on Pattern Recognition (ICPR 2014) 2013 Real-Time Dynamic MRI Reconstruction: Accelerating Compressed Sensing on Graphical Processor Unit Ankita Shukla, Anghsul Majumdar, Rabab Ward IASTED Signal and Image Processing 2013 arXiv Pre-prints GraCIAS: Grassmannian of Corrupted Images for Adversarial Security Ankita Shukla, Pavan Turaga, Saket Anand (2020) Unique Identification of Macaques for Population Monitoring and Control Ankita Shukla*, Gullal Singh Cheema*, Saket Anand, Qamar Qureshi, Yadvendradev Jhala arXiv preprint arXiv:1811.00743 (2018) (*Equal Contribution) Semi-Supervised Clustering with Neural Networks Ankita Shukla*, Gullal Singh Cheema*, Saket Anand arXiv preprint arXiv:1806.01547 (2018) (*Equal Contribution)",
  "content_length": 8530,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:51"
}