{
  "name": "Ankur Srivastava",
  "homepage": "https://ece.umd.edu/clark/faculty/484/Ankur-Srivastava",
  "status": "success",
  "content": "Srivastava, Ankur | Department of Electrical and Computer Engineering Skip to main content Shape Copy 6Shape Copy 18ShapeShapenext month copynext month HomeFaculty DirectorySrivastava, Ankur Faculty Directory Srivastava, Ankur Director, Semiconductor Initiative and InnovationProfessorFormer Director, Institute for Systems Research (2019-2024)Former Associate Dean, Graduate Programs (2018-2019) Electrical and Computer EngineeringThe Institute for Systems Research 2173 and 2317 AV Williams Bldg ankurs@umd.edu 301.405.0434 Website(s): Personal and IDEA Lab websiteGoogle Scholar OVERVIEW RESEARCH INTERESTS RELATED NEWS FELLOWS Ankur Srivastava, the seventh director of the Institute for Systems Research, has a joint appointment in the Electrical and Computer Engineering Department and ISR. Dr. Srivastava received his B.Tech in Electrical Engineering from Indian Institute of Technology Delhi in 1998 and PhD in Computer Science from UCLA in 2002. He was awarded the prestigious Outstanding Dissertation Award from the CS department of UCLA in 2002. His primary research interests lie in the field of high performance, low power and secure electronic systems and applications such as computer vision, data and storage centers and sensor networks. He has published numerous papers on these topics at prestigious venues. He has been a part of the technical program & organizing committees of several conferences such as ICCAD, DAC, ISPD, ICCD, GLSVLSI, HOST and others. He has served as the associate editor for IEEE Transactions on VLSI, IEEE Transactions on CAD and INTEGRATION: VLSI Journal. His research and teaching contributions have also been recognized through various awards. Honors and awards Fellow, Institute of Electrical and Electronics Engineers (IEEE) \"for contributions to chip hardware security\" (2023) Best Paper Award, ACM International Symposium on Physical Design (ISPD 2007) High performance, low power and secure electronic systems and applications such as computer vision, data and storage centers and sensor networks UMD Semiconductor Retreat Builds Strategic Momentum A flagship event of UMD’s Semiconductor Initiative, the retreat aligned faculty around research priorities, partnerships, and national strategy. NSF Awards Advances ISR Alum Research in Quantum and Brain-Inspired Computing ISR alum Yuntao Liu, now an assistant professor at Lehigh University, has earned two NSF awards advancing secure quantum emulation and brain-inspired computing. Khaligh Named Interim Director of ISR Srivastava Begins Inaugural Director Role University of Maryland Moves Ahead in Its Leadership of the United States' Semiconductor Industry Two significant federally funded partnerships recently awarded Srivastava Named Inaugural Director of Semiconductor Initiatives and Innovation New position will begin January 1, 2025 UMD, Partners Receive $31M for Semiconductor Research Maryland engineers will help advance domestic production under a federal grant. Three ECE Alums to be Honored by A. James Clark School of Engineering Inducted into 2024 Class of Early Career Distinguished Alumni Two NSF Awards for ECE Alum Michael Zuzak (Ph.D. ’22) Receives NSF EAGER and NSF CRII Awards Srivastava is a co-general chair of 2024 IEEE HOST Symposium HOST is the premier symposium that facilitates the rapid growth of hardware-based security research and development. Alum Domenic Forte promoted to full professor at University of Florida Forte joined UF in 2015. Institute of Electrical and Electronics Engineers (IEEE) Edit your faculty profile",
  "content_length": 3559,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:53"
}