{
  "name": "Ankur Arjun Mali",
  "homepage": "https://ankurmali.github.io",
  "status": "success",
  "content": "Bio - Ankur Mali Ankur MaliAssistant Professor Follow Tampa , FL, USA Email Github Google ScholarAnkur Mali is an Assistant Professor in the Bellini College of Artificial Intelligence, Cybersecurity and Computing at the University of South Florida. He was awarded Ph.D. in Informatics at Pennsylvania State University in 2022, under Dr. Lee Giles. Before this, he worked in industry and obtained a bachelor’s in Computer Engineering from the University of Pune, India in 2013. He was also awarded prestigious IVADO postdoctoral Fellowship to work with University of Montreal.At USF, he is the founder and scientific director of the Trustworthy knowledge-driven AI TKAI lab. Note OLD_LAB_PAGE is inactive and no longer maintained.Research InterestsI have broad interests in natural language processing, neuro-symbloic AI and predictive coding. My research is mostly driven by two goals:Designing efficient and fundamental approaches to derive knowledge from data and encode human level reasnoning in to intelligents systems.Extending such model capabilities to generate interpretable, robust and fair representation.I believe Neuro-symbolic AI and understanding of complex systems is a crutical steps towards desigining stable Artificial General Intelligence systems.Research ProjectsFormal method meet AI/Neuro-Symbloic AI: My work is at the intersection of language, memory, and computation—spanning Natural Language Processing (NLP), linguistics, and formal language theory. In particular, I design knowledge-guided interpretable deep learning systems focused on generating trustworthy information. Furthermore, I am also interested in investigating the mysterious success of deep learning in recognizing natural language from a theoretical and empirical perspective.Predictive coding-inspired Neural Architectures: Our lab, in collaboration with NAC, works on designing learning algorithms and computational architectures guided by theories of the brain and its functionality that emphasize solving challenges such as continual/lifelong learning, learning with minimal supervision, Reinforcement Learning, and sparsity (both in computer vision and natural language processing).Low Resource and Robust NLP: In collaboration with our collaborator from University of Mississippi, we are working on designing low-resource Natural language processing (NLP) agents that are robust and capable of generating safe/ethical information. Such models are aimed to help under-represented groups.Notes to Prospective Students:Job Opening: I am looking for a new Ph.D. student to begin in Fall 2026. All emails should have the title: Ph.D. Fall 2026. In brief words, Please provide details about why you wish to join our lab and what topics you wish to work on/explore. Please refer to instructions prior to contacting me.Students at USF interested in doing an Independent Study or Master’s thesis (seeking me as advisor) should also provide all the details highlighted above.Recent NewsFor recent News(since Oct 2022 - Now), please follow the new lab webpage.Sept 2022: I will be giving a talk on Provable stability of Neural State Turing Machine at RITSept 2022: I will be giving a talk on Provable stability of Neural State Turing Machine at AI+X Seminar at USFSept 2022: One paper accepted in NeurIPS-22Aug 2022: Joined University of South Florida as Assistant Professor (Tenure-Track)Mar 2022: Received prestigious IVADO postdoctoral Fellowship (Declined)Jan 2022: Received Postdoctoral position at Harvard Medical and Dana-farber cancer center to work on NLP for clinical trials (Declined)June 2022: Defended my thesis on Turing Completeness of Neural Networks with bounded precision and timeJan 2022: One paper accepted in AAAI-22 (oral) (Backprop free RL).Jan 2022: One paper accepted in DCC-22 (Neural JPEG)",
  "content_length": 3804,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:51"
}