{
  "name": "Ankush Das",
  "homepage": "https://ankushdas.github.io",
  "status": "success",
  "content": "Ankush Das Ankush Das Google Scholar ankushd [AT] bu [DOT] edu Github Bitbucket ResearchGate CDS 1024 665 Commonwealth Ave, Boston, MA 02215 I am a tenure-track assistant professor in the Computer Science Department at Boston University and I am looking for motivated PhD students. My research interests are broadly in the area of programming languages, with applications in cryptographic protocols, distributed systems, and recently in probabilistic and machine learning models. Interested in working with me? Please reach out to me directly and/or apply to the CS PhD program at Boston University. Until Dec 2023, I worked as an applied scientist at Amazon working in the Automated Reasoning Group. At Amazon, I worked on testing and verification of distributed protocols and proving security and privacy of distributed systems. I graduated with a PhD from Carnegie Mellon University in 2021 where I was advised by Prof. Jan Hoffmann and closely worked with Prof. Frank Pfenning. I am broadly interested in programming languages with a specific focus on resource analysis, session types, distributed protocols, and language design for smart contracts on the blockchain. I am the lead designer and developer of Nomos, a domain-specific language for implementing smart contracts. I have also designed Rast along with Prof. Frank Pfenning, a language implementing resource-aware session types with arithmetic refinements. Before joining CMU, I worked as a Research Fellow at Microsoft Research, India with Akash Lal where I developed an efficient method to perform precise alias analysis for C and C++ programs for Windows driver modules to automatically infer safe null pointer dereferences. I completed my undergraduate at IIT Bombay, India in 2015 where I worked with Prof. Supratik Chakraborty and Prof. Akshay S on deciding termination of linear loop programs. Latest News Aug 2025 Our submission Practical Refinement Session Type Inference has been accepted to ESOP 2026. May 2025 My undergraduate student Toby Ueno has graduated from Boston University! He is joining University of Edinburgh to pursue his PhD. Best of luck! Apr 2025 Our submission Probabilistic Refinement Session Types has been accepted to PLDI 2025. Super excited about my first publication as an advisor! Also my first paper at PLDI! Jun 2024 Excited to host Oregon Programming Language Summer School (OPLSS) at Boston University! Jan 2024 Our paper Parametric Subtyping for Structural Parametric Polymorphism has been recognized with a distinguished paper award at POPL 2024! Publications 24. Practical Refinement Session Type Inference ESOP 2026 Toby Ueno and Ankush Das. In Proceedings of the 35th European Symposium on Programming. PDF 23. Probabilistic Refinement Session Types PLDI 2025 Qiancheng Fu, Ankush Das, and Marco Gaboardi. In Proceedings of the 46th ACM SIGPLAN Conference on Programming Language Design and Implementation. PDF 22. Parametric Subtyping for Structural Parametric Polymorphism POPL 2024 Henry DeYoung, Andreia Mordido, Frank Pfenning, and Ankush Das. In Proceedings of the 51st ACM SIGPLAN Symposium on Principles of Programming Languages. Distinguished paper award PDF 21. Automated Analyses of IOT Event Monitoring Systems CAV 2023 (Industrial Experience Report) Andrew Apicelli, Sam Bayless, Ankush Das, Andrew Gacek, Dhiva Jaganathan, Saswat Padhi, Vaibhav Sharma, Michael W. Whalen, and Raveesh Yadav. In Proceedings of the 35th International Conference on Computer Aided Verification. PDF 20. Probabilistic Resource-Aware Session Types POPL 2023 Ankush Das, Di Wang and Jan Hoffmann. In Proceedings of the 50th ACM SIGPLAN Symposium on Principles of Programming Languages. PDF video 19. Rast: A Language for Resource-Aware Session Types LMCS 2022 Ankush Das and Frank Pfenning. Logical Methods in Computer Science, Volume 18, Issue 1. PDF 18. Nested Session Types TOPLAS 2022 Ankush Das, Henry DeYoung, Andreia Mordido, and Frank Pfenning. ACM Transactions on Programming Languages and Systems, Volume 44, Issue 3. PDF 17. Polarized Subtyping ESOP 2022 Zeeshan Lakhani, Ankush Das, Henry DeYoung, Andreia Mordido, Frank Pfenning. In Proceedings of the 31st European Symposium on Programming. PDF 16. Nested Session Types ESOP 2021 Ankush Das, Henry DeYoung, Andreia Mordido and Frank Pfenning. In Proceedings of the 30th European Symposium on Programming. PDF tech report 15. Resource-Aware Session Types for Digital Contracts CSF 2021 Ankush Das, Stephanie Balzer, Jan Hoffmann, Frank Pfenning and Ishani Santurkar. In Proceedings of the 34th IEEE Computer Security Foundations Symposium. PDF video 14. Exact and Linear-Time Gas-Cost Analysis SAS 2020 Ankush Das and Shaz Qadeer. In Proceedings of the 27th International Static Analysis Symposium. PDF slides video 13. Verified Linear Session-Typed Concurrent Programming PPDP 2020 Ankush Das and Frank Pfenning. In Proceedings of the 22nd International Symposium on Principles and Practice of Declarative Programming. PDF slides 12. Session Types with Arithmetic Refinements CONCUR 2020 Ankush Das and Frank Pfenning. In Proceedings of the 31st International Conference on Concurrency Theory. PDF slides teaser video 11. Rast: Resource-Aware Session Types with Arithmetic Refinements FSCD 2020 Ankush Das and Frank Pfenning. In Proceedings of the 5th International Conference on Formal Structures for Computation and Deduction. Best system decription paper award by a junior researcher PDF slides code 10. Session Types with Arithmetic Refinements and Their Application to Work Analysis arXiv Preprint: 2001.04439 [cs.PL] Ankush Das and Frank Pfenning. PDF 9. Parallel Complexity Analysis with Temporal Session Types ICFP 2018 Ankush Das, Jan Hoffmann and Frank Pfenning. In 23rd International Conference on Functional Programming. PDF slides video 8. Work Analysis with Resource-Aware Session Types LICS 2018 Ankush Das, Jan Hoffmann and Frank Pfenning. In Proceedings of the 33rd Annual ACM/IEEE Symposium on Logic in Computer Science. PDF slides tech report 7. On Petri Nets with Hierarchical Special Arcs CONCUR 2017 S. Akshay, Supratik Chakraborty, Ankush Das, Vishal Jagannath and Sai Sandeep. In Proceedings of the 28th International Conference on Concurrency Theory. PDF tech report 6. Precise Null Pointer Analysis Through Global Value Numbering ATVA 2017 Ankush Das and Akash Lal. In Proceedings of the 15th International Symposium on Automated Technology for Verification and Analysis. PDF 5. ML for ML: Learning Cost Semantics by Experiment TACAS 2017 Ankush Das and Jan Hoffmann. In Proceedings of the 23rd International Conference on Tools and Algorithms for the Construction and Analysis of Systems. PDF slides tech report 4. Towards Automatic Resource Bound Analysis for OCaml POPL 2017 Jan Hoffmann, Ankush Das and Shu-Chun Weng. In Proceedings of the 44th ACM SIGPLAN Symposium on Principles of Programming Languages. PDF tech report 3. Learning Cost Semantics for Modeling Running Time of OCaml Programs LOLA 2016 Ankush Das and Jan Hoffmann. Workshop on Syntax and Semantics of Low-Level Languages PDF 2. Angelic Verification: Precise Verification Modulo Unknowns CAV 2015 Ankush Das, Shuvendu K. Lahiri, Akash Lal, Yi Li. In Proceedings of the 27th International Conference on Computer Aided Verification. PDF 1. On Pure Nash Equilibria in Stochastic Games TAMC 2015 Ankush Das, Shankara Narayanan Krishna, Lakshmi Manasa, Ashutosh Trivedi, Dominik Wojtczak. In Proceedings of the 12th Annual Conference on Theory and Applications of Models of Computation. PDF Students Advised Students Anthony DeRossi1st yearPhD student Toby UenoUndergraduate student Brendan CoyneUndergraduate student Collaborators and Mentored Students At Boston University, I've had the privilege to work with and mentor a number of fantastic students. Qiancheng FuFinal yearPhD student june wunder4th yearPhD student Sam Buxbaum2nd yearPhD student Sakshi Sharma1st yearPhD student Teaching Programming Language Foundations for Concurrency CS 599 A1, Boston University, Spring 2025. Concepts of Programming Languages CS 320, Boston University, Fall 2024. Programming Language Foundations for Concurrency CS 599 D1, Boston University, Spring 2024.",
  "content_length": 8204,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:52"
}