{
  "name": "Ann E. Nicholson",
  "homepage": "https://research.monash.edu/en/persons/ann-nicholson.html",
  "status": "success",
  "content": "Ann Nicholson - Monash University Ann Nicholson public CV View Scopus Profile Ann Nicholson Professor Dean Faculty of Information Technology, Faculty of Information Technology https://orcid.org/0000-0002-2269-9823 EmailAnn.Nicholsonmonashedu 1988 …2024 Research activity per year Personal profile BiographyProfessor Ann E. Nicholson is Dean in the Faculty of Information Technology. Other past leadership roles including Deputy Dean (Research) 2018-2020, (Acting) Deputy Dean 2016-2017, and Associate Dean (Education) 2014-2016. After completing her BSc (Hons) and MSc in Computer Sciene at the University of Melbourne, in 1988 she was awarded a Rhodes scholarship to Oxford, where she  did her doctorate in the Robotics Research Group. After completing a post-doc at Brown University, she returned to Australia to take up a lecturing position position at Monash in 1994. Prof. Nicholson specialises in the broad area of Artificial Intelligence, a  sub-discipline of computer science.  She is a leading international researcher in the specialised area of Bayesian networks, now the dominant technology for probabilistic causal modelling in intelligent systems. She has published more than 100 peer reviewed papers, co-authored the well-received book \"Bayesian Artificial Intelligence\", and attracted more than $8M in research funding. She has applied Bayesian Network technology to problem-solving in many domains including meteorology, epidemiology, medicine, education and environmental science. Examples include the use of BNs in biosecurity risk assessment, predicting the impact of conservation actions on threats and habitats of threatened species, fog forecasting and decision support for clinical cardiovascular risk assessment. Community service(Current 2020) Victorian Rhodes Scholarship Selection Committee, Honorary Secretary Monash teaching commitmentWhile having no curent teaching commitments, Professor Ann Nicholson has experience as the Chief Examiner and/or lecturer for the following units in the Faculty of IT: FIT1010 Introduction to software engineeringFIT1016/2044 Advanced project level 1 & 2FIT1049/2003 IT professional practiceResearch interestsAnn specialises in Bayesian network modelling and is an expert in dynamic Bayesian networks, planning under uncertainty, user modelling, Bayesian inference methods, and knowledge engineering with Bayesian networks. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationEngineering Science, Doctor of Philosophy, University of OxfordAward Date: 1 Jun 1993Computer Science, Master of Science, University of MelbourneAward Date: 1 Feb 1990Computer Science, Bachelor of Science (Honours), University of MelbourneAward Date: 1 Feb 1987 Research area keywordsArtificial intelligenceBayesian networksData MiningRisk analysisProbabilistic reasoningKnowledge EngineeringCausal discoveryDecision support Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2002 2020 2027 1 Curtailed 2 Not started 2 Active 18 Finished Projects per year TMLGenAI: Trustworthy Generative AI: Towards Safe and Aligned Foundation ModelsPhung, D. (Primary Chief Investigator (PCI)), Vu, T. (Chief Investigator (CI)), Qu, L. (Chief Investigator (CI)), Le, T. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)), Webb, G. (Chief Investigator (CI)), Nicholson, A. (Chief Investigator (CI)), Ke, Q. (Chief Investigator (CI)), Cai, J. (Chief Investigator (CI)) & Bui, T. (Chief Investigator (CI))11/06/24 → 10/07/26Project: Research Building 4.0 CRC: Better buildings, new efficiencies through technology and collaborationAitchison, M. (Primary Chief Investigator (PCI)), Ngo, T. D. (Chief Investigator (CI)), Maxwell, D. (Chief Investigator (CI)), Couper, R. (Chief Investigator (CI)), Breen Lovett, S. (Chief Investigator (CI)), Cumarasamy, S. (Project Manager), Blue, K. (Project Manager), Laverty, C. (Project Manager), Gerber, P. (Chief Investigator (CI)), Merkoulova, Y. (Chief Investigator (CI)), Sohal, A. (Chief Investigator (CI)), Dare, R. (Chief Investigator (CI)), Moehler, R. (Chief Investigator (CI)), Nicholson, A. (Chief Investigator (CI)), Grundy, J. (Chief Investigator (CI)), Garcia De La Banda Garcia, M. (Chief Investigator (CI)), McCormack, J. (Chief Investigator (CI)), Vu, L. H. (Chief Investigator (CI)), Dwyer, T. (Chief Investigator (CI)), Murray, S. (Chief Investigator (CI)), Kulic, D. (Chief Investigator (CI)), Bai, Y. (Chief Investigator (CI)), Davies, C. (Chief Investigator (CI)), Zhou, J. (Chief Investigator (CI)), Duffield, C. (Chief Investigator (CI)), Singh, P. J. (Chief Investigator (CI)), Bridge, A. (Chief Investigator (CI)), Erol, I. (Chief Investigator (CI)), Drogemuller, R. (Chief Investigator (CI)) & Mahendran, M. (Chief Investigator (CI))10/09/20 → 30/06/27Project: Research PHRisM: Prediction and decision making for prevention and management of postpartum haemorrhageLicqurish, S. (Chief Investigator (CI)), Nicholson, A. (Chief Investigator (CI)) & Mol, B. (Chief Investigator (CI))Project: Research To Enhance Operational Risk Modelling Methodology Through the Use of Bayesian NetworksKorb, K. (Primary Chief Investigator (PCI)) & Nicholson, A. (Chief Investigator (CI))Project: Research MCRI - Vaccine Surveillance using Bayesian NetworksNicholson, A. (Primary Chief Investigator (PCI)), Buttery, J. (Chief Investigator (CI)) & Pearson, E. R. (Project Manager)Murdoch Children's Research Institute31/03/22 → 29/09/25Project: Research View all 23 projects Research output Research output per year 1988 1997 1998 1999 2004 2005 2007 2011 2012 2014 2015 2020 2024 65 Conference Paper 36 Article 5 Chapter (Book) 4 Book 18 More 4 Other 3 Foreword / Postscript 2 Commissioned Report 2 Edited Book 2 Paper 2 Editorial 1 Other Report 1 Abstract 1 Review Article Research output per year Research output per year Shareable and inheritable incremental compilation in iOOBNSamiullah, M., Nicholson, A. & Albrecht, D., 2024, 20th Pacific Rim International Conference on Artificial Intelligence, PRICAI 2023 Jakarta, Indonesia, November 15–19, 2023 Proceedings, Part II. Liu, F., Sadanandan, A. A., Pham, D. N., Mursanto, P. & Lukose, D. (eds.). Singapore Singapore: Springer, p. 91-103 13 p. (Lecture Notes in Computer Science; vol. 14326).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 1 Citation (Scopus) Modeling COVID-19 disease processes by remote elicitation of causal Bayesian networks from medical expertsCOVID BN Advisory Group, Dec 2023, In: BMC Medical Research Methodology. 23, 1, 21 p., 76.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 9 Citations (Scopus) Automated construction of an Object-Oriented Bayesian Network (OOBN) class hierarchySamiullah, M., Nicholson, A. & Albrecht, D., 2022, Proceedings - 2022 IEEE 34th International Conference on Tools with Artificial Intelligence, ICTAI 2022. Reformat, M., Zhang, D. & Bourbakis, N. G. (eds.). Piscataway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, p. 1382-1389 8 p. (Proceedings - International Conference on Tools with Artificial Intelligence, ICTAI; vol. 2022-October).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 3 Citations (Scopus) BARD: a structured technique for group elicitation of Bayesian networks to support analytic reasoningNyberg, E. P., Nicholson, A. E., Korb, K. B., Wybrow, M., Zukerman, I., Mascaro, S., Thakur, S., Oshni Alvandi, A., Riley, J., Pearson, R., Morris, S., Herrmann, M., Azad, A. K. M., Bolger, F., Hahn, U. & Lagnado, D., Jun 2022, In: Risk Analysis. 42, 6, p. 1155-1178 24 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 38 Citations (Scopus) Predicting postpartum haemorrhage: A systematic review of prognostic modelsCarr, B., Jahangirifar, M., Nicholson, A., Li, W., Mol, B. W. J. & Licqurish, S., Dec 2022, In: Australian and New Zealand Journal of Obstetrics and Gynaecology. 62, 6, p. 813-825 13 p.Research output: Contribution to journal › Review Article › Research › peer-review Open Access 23 Citations (Scopus) View all 128 research outputs Prizes IEEE International Conference on Data Mining 10-year Highest Impact AwardWebb, G. (Recipient) & Nicholson, A. (Recipient), Dec 2023Prize: Prize (including medals and awards) Activities Activities per year 2011 2011 2014 2016 2018 2019 2020 2020 4 Other 3 External research and teaching 1 Membership of an advisory panel/policy group/ board Activities per year Interim Dean, Faculty of ITNicholson, A. (Speaker)Jul 2020 → …Activity: Other Teaching Engagements and non-HDR Supervisions › Other Honorary Secretary, Victoria Rhodes Selection CommitteeNicholson, A. (Speaker)2019 → 2023Activity: Other Teaching Engagements and non-HDR Supervisions › Other Deputy Dean (Research), Faculty of ITNicholson, A. (Speaker)Aug 2018 → Jul 2020Activity: Other Teaching Engagements and non-HDR Supervisions › Other Chair - Faculty Education Committee - Faculty of Information Technology, Monash UniversityNicholson, A. (Chair/ Co-Chair)1 Jan 2016Activity: External Academic Engagement › External research and teaching Associate Dean (Education) - Faculty of Information Technology, Monash UniversityNicholson, A. (Fellow)1 Jan 2014 → 30 Jun 2016Activity: External Academic Engagement › External research and teaching View all 8 activities Press/Medi",
  "content_length": 10124,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:55"
}