{
  "name": "Ann Barcomb",
  "homepage": "https://profiles.ucalgary.ca/ann-barcomb",
  "status": "success",
  "content": "Ann Barcomb | UCalgary Profiles | University of Calgary Skip to main content Dr. Ann Barcomb Pronouns: she/they Are you the profile owner? Login to edit. Positions Associate Processor Schulich School of Engineering, Department of Electrical and Software Engineering Contact information Email ann.barcomb@ucalgary.ca Web presence My research Group research LinkedIn Location Office: ICT352A Preferred method of communication Please use email to contact me. I do not listen to voicemail frequently. I'm looking for... Funding I am always interested in connecting with industry and researchers for potential collaboration. Learning opportunities If I am looking for graduate students or undergraduate summer students, the opportunities will be posted on my website. Research partners I am generally interested in collaborations, especially interdisciplinary ones. Background Biography Dr. Ann Barcomb is an assistant professor at the Schulich School of Engineering, University of Calgary. Her previous post was at Friedrich-Alexander University Erlangen-Nuremberg, Germany. Dr. Barcomb received her PhD from the University of Limerick, Ireland, in 2019, with a specialization in software engineering, and a master's in information systems from Maastricht University, The Netherlands. In the course of her industry career, she worked as a software developer for multiple firms and as a community manager for RIPE NCC. Dr. Barcomb's interests lie in the area of human-computer interaction, primarily in human factors - the people and processes that contribute toward software development, and how software can be used to facilitate work. Specific research topics include the use of open source software contributors and communities, diversity and inclusion, component and tool selection, natural language processing in requirements engineering, enabling smart city governance through residents' data, software engineering research methods, and software engineering education. Dr. Barcomb seeks to facilitate the exchange of knowledge between practitioners and researchers, and to align her work with empirical software engineering. Research Areas of Research Software engineering Open source Community management Activities My research falls in the area of human-computer interaction, with two main themes: improving work through software and data, and human factors in software engineering. In general I seek to facilitate the exchange of knowledge between practitioners and researchers. Participation in university strategic initiatives Human Dynamics in a Changing World (2015-2021) Courses Course number Course title Semester ENSF 380 Object-Oriented Principles for Software Development Winter ENSF 409 Principles of Software Development Winter ENSF 619 Software Development Using Open Source Fall ENSF 400 Industry practices and communication WS 2024 Publications Google Scholar ORCiD Personal website Are you the profile owner? Login to edit.",
  "content_length": 2943,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:53"
}