{
  "name": "Anna Korhonen",
  "homepage": "https://www.cl.cam.ac.uk/~alk23",
  "status": "success",
  "content": "Anna KorhonenSearch this siteEmbedded FilesSkip to main contentSkip to navigationProfessor Anna KorhonenAbout meI am a Professor of Natural Language Processing at the University of Cambridge where I co-direct the Language Technology Laboratory (LTL). I am also the director of the Centre for Human-Inspired Artificial Intelligence (CHIA) and the co-founder and co-director of the Institute for Technology and Humanity. I am a Senior Research Fellow of Churchill College, a Fellow of ACL, a fellow of ELLIS, and the elected member of Academia Europaea  I'm a chair elect of EACL, the European Chapter of ACL, and previously served as a Turing Fellow of the Alan Turing Institute.  My research focuses on Natural Language Processing (NLP) and other areas of AI, specifically on developing, adapting, and applying computational techniques to meet the needs of intelligent applications. I have a particular interest in responsible, human-centric technologies that are informed by an understanding of human cognitive, social, and creative intelligence, with a focus on applications that promote social and global good. Many of my projects are interdisciplinary and involve collaboration with researchers from various fields. Please see my research page for details!Prior to starting in my current position, I was a Royal Society University Research Fellow in this University, based in Computer Science and Linguistics.  Before that, I was a JSPS postdoctoral fellow in Japan where I worked at the National Institute of Informatics in Tokyo. Previously, I was a researcher at  University of Pennsylvania. I did my PhD in Computer Science at the University of Cambridge and hold masters degrees in both Computer Science  and Linguistics.NewsProspective PhD students: I welcome applications from outstanding candidates for PhD in Computation, Cognition and Language and PhD in Human-Inspired Artificial Intelligence. If you are interested in applying, (i) please take a look at my research interests and ongoing projects, and (ii) check that you meet the entry requirements before contacting me, and (iii) when contacting me, send me your CV including the overall mark of your previous university degree. I get many queries, so please make contact early. If you want to apply for PhD funding from Cambridge,  note that the funding deadlines for entry in October 2026 are in early December 2025. I also supervise PhD students as part of the European ELLIS PhD program. If you are interested in applying please take a look at  the application portal and get in touch.  Note that in addition to the ELLIS application, you also need to make a separate application to the University of Cambridge as described above.Current Part III and MPhil students: If you want to do your research project with LTL, please see the  projects that we offer.ContactAnna KorhonenLanguage Technology LabFaculty of Modern and Medieval Languages and LinguisticsFaculty of English Building9 West RoadCambridge CB3 9DB, UKOffice: TR-12Phone: (+44) 1223 767 389 Email: alk23 AT cam.ac.ukGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 3123,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:02"
}