{
  "name": "Anna Gambin",
  "homepage": "https://www.mimuw.edu.pl/~aniag",
  "status": "success",
  "content": "Anna Gambin homepage Anna Gambin homepage Home Research Teaching CV Affiliation Computational Biology Group Division of Mathematics, Informatics and Mechanics Warsaw University Family SÅawek Lasota prof. dr hab. (professor) aniag at mimuw edu pl +48 22 5544212       office 2120 former PhD students BogusÅaw Kluge MikoÅaj RybiÅski Piotr Dittwald MichaÅ Startek Maciej Sykulski Agata CharzyÅska Mateusz ÅÄ cki Weronika Wronowska Krzysztof Gogolewski Aleksandra JarmoliÅska current PhD students Barbara Poszewiecka Piotr RadziÅski MichaÅ Ciach Research interests Computational molecular biology and medicine: bioinformatics for genome rearrangements, algorithms for mass spectra processing, mathematical modelling of signaling pathways, comparative genomics of transposable elements. Recent research activities Programm Committees: Workshop on Algorithms for Bioinformatics 2021 Workshop on Algorithms for Bioinformatics 2020 Workshop on Algorithms for Bioinformatics 2019 Workshop on Algorithms for Bioinformatics 2018 Workshop on Algorithms for Bioinformatics 2017 Bioinformatics and Artificial Intelligence (IJCAI-BAI) 2017 Workshop on Algorithms for Bioinformatics 2016 Bioinformatics and Artificial Intelligence (IJCAI-BAI) 2016 Workshop on Algorithms for Bioinformatics 2015 RECOMB 2015, International Conference on Research in Computational Molecular Biology Bioinformatics and Artificial Intelligence (BAI) 2015 Workshop on Algorithms for Bioinformatics 2014 ACM Conference on Bioinformatics, Computational Biology and Biomedical Informatics 2013 Workshop on Algorithms for Bioinformatics 2013 Workshop on Algorithms for Bioinformatics 2012 Workshop on Computational Molecular Biology 2012 Workshop on Algorithms for Bioinformatics 2011 Journals: Fundamenta Informaticae Journal of Biotechnology, Computational Biology and Bionanotechnology Home | Research | Teaching | CV Copyright © Mark Florian 2004 adapted by AG",
  "content_length": 1932,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:58"
}