{
  "name": "Anna Zych-Pawlewicz",
  "homepage": "http://informatorects.uw.edu.pl/en/courses/view?prz_kod=1000-712ASD",
  "status": "success",
  "content": "Algorithms and data structures - University of WarsawOn-line services of the University of WarsawYou are not logged in | log ingo to the main portalSee other Course Catalogues in PolandWYŚWIETL PO POLSKUStudy programmesCourse searchInformation for students Conducted in terms: 2024L, 2025L Erasmus code: 11.3 ISCED code: 0612 ECTS credits: 4.5 Language: Polish Organized by: Faculty of Mathematics, Informatics, and Mechanics Related to study programmes: Inter-faculty Studies in Bioinformatics and Systems Biology Algorithms and data structures 1000-712ASD Basic methods of design and analysis of algorithms and data structures.Programming (algorithm coding, library usage).Text algorithms (pattern matching) and text data structures (suffix trees and tables).Graph algorithms (computer graph representation, searching, path problems, tree algorithms).Algorithms and data structures in computational biology (sequence alignment, phylogenetic trees). Type of course obligatory courses Course coordinators Norbert Dojer Learning outcomes Knowledge:- knows the basic methods of designing, analyzing and programming algorithms, including search algorithms, graph algorithms, path problems- knows the basic data structures and operations performed on them, with particular emphasis on data structures used in computational biology Skills:-designs, analyzes in terms of correctness and computational complexity, and programs algorithms; uses basic algorithmic techniques and data structures- uses the accepted formats of representation of various types of data according to the situation (numbers, tables, text) bearing in mind their limitations Assessment criteria test + project + writing exam Bibliography Cormen, Thomas H.; Leiserson, Charles E.; Rivest, Ronald L.; Stein, Clifford (2001). Introduction to Algorithms (2nd ed.). MIT Press and McGraw-Hill. ISBN 0-262-53196-8. Additional information Information on level of this course, year of study and semester when the course unit is delivered, types and amount of class hours - can be found in course structure diagrams of apropriate study programmes. This course is related to the following study programmes: Inter-faculty Studies in Bioinformatics and Systems Biology Additional information (registration calendar, class conductors, localization and schedules of classes), might be available in the USOSweb system: Description of 1000-712ASD in USOSweb ECTS Catalogue 7.2.0.0-64884fe",
  "content_length": 2437,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:07"
}