{
  "name": "Anna Gladkova 0001",
  "homepage": "https://pure.itu.dk/en/persons/anna-rogers",
  "status": "success",
  "content": "Anna Rogers - IT-University of Copenhagen © 2023 Anna Rogers X Anna Rogers Ph.D. Associate Professor, Data ScienceNLPnorth https://orcid.org/0000-0002-4845-4023 Emailarogitudk 20152026 Research activity per year Personal profile KeywordsNatural Language ProcessingArtificial intelligenceMachine Learning Fingerprint Dive into the research topics where Anna Rogers is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles NLP. Keyphrases 100% Large Language Models Keyphrases 69% Annotation Computer Science 57% Large Language Model Computer Science 51% Peer Review Keyphrases 49% Bidirectional Encoder Representations From Transformers Computer Science 43% Natural Language Processing Keyphrases 40% Case Study Computer Science 40% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2015 2016 2019 2020 2021 2022 2023 2024 2025 2025 35 Article in proceedings 6 Anthology 5 Other contribution 3 Journal article 5 More 3 Conference article 1 Book 1 Report Research output per year Research output per year A Primer in BERTology: What We Know About How BERT WorksRogers, A., Kovaleva, O. & Rumshisky, A., 1 Dec 2020, In: Transactions of the Association for Computational Linguistics. 8, p. 842-866 25 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review BERT Model 100% Transformer Model 100% Knowledge Level 100% Training Objectives 100% Popular 100% When BERT Plays the Lottery, All Tickets Are WinningPrasanna, S., Rogers, A. & Rumshisky, A., 1 Nov 2020, Proceedings of EMNLP. Online: Association for Computational Linguistics, p. 3208-3229 22 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Pre-trained BERT 100% Transformer Model 100% Lottery 100% Self-attention 100% Full Model 100% Machine Reading, Fast and Slow: When Do Models 'Understand' Language?Ray Choudhury, S., Rogers, A. & Augenstein, I., 2022, Proceedings of the 29th International Conference on Computational Linguistics. Gyeongju, Republic of Korea, p. 78-93 16 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Natural Language Understanding 100% Machine Reading 100% Reading Comprehension 100% Linguistic Competence 50% Encoder 50% Just What Do You Think You're Doing, Dave? A Checklist for Responsible Data Use in NLPRogers, A., Baldwin, T. & Leins, K., 1 Nov 2021, Findings of the Association for Computational Linguistics: EMNLP 2021. Punta Cana, Dominican Republic: Association for Computational Linguistics, p. 4821-4833 13 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review NLP. 100% Data Reuse 100% Data in Use 100% Natural Language Processing 100% Reuse 66% QA Dataset Explosion: A Taxonomy of NLP Resources for Question Answering and Reading ComprehensionRogers, A., Gardner, M. & Augenstein, I., 1 Aug 2022, In: ACM Computing Surveys.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Question Answering 100% Reading Comprehension 100% NLP Resources 100% QA Dataset 100% Practitioners 100% View all 54 research outputs Projects Projects per year 2021 2024 2025 2034 1 Finished 1 Not started 7 Active Projects per year PlagAIrism: Getting generative AI to provide references to its training dataRogers, A. (PI), Wührl, A. (Collaborator) & Ruckdeschel, M. (Collaborator)Villum Foundation01/05/2024 → 30/06/2029Project: Research Training Data 100% Generative AI 100% Generative 100% Artificial Intelligence 100% Generative Artificial Intelligence 100% Reducing hallucinations in Medical QARogers, A. (PI)Innovation Fund Denmark01/09/2024 → 31/08/2027Project: Research NLP. 100% Hallucinations 100% Medical Domain 100% Hallucination 100% Medical Coding 50% mitAI: Rethinking Retrieval-Augmented-Generation for a Citizen Services Digital AssistantRogers, A. (PI) & Martinez, A. V. (Collaborator)University of Copenhagen01/06/2025 → 31/12/2027Project: Research Digital Assistant 100% Citizen Services 100% Retrieval-augmented Generation 100% Digital Service 100% Information Retrieval 50% NLP@CPH2025 : The First Copenhagen NLP SymposiumRogers, A. (PI)Carlsberg Foundation01/06/2025 → 30/09/2025Project: Research Copenhagen 100% NLP. 100% Natural Language Processing 100% Danish 100% Europe 100% Research Stay (ETH Zürich)Højer, B. (PI), Heinrich, S. (Collaborator) & Rogers, A. (Collaborator)Stibo-Fonden01/09/2025 → 31/12/2025Project: Research Chat Generative Pre-trained Transformer (ChatGPT) 100% Method of Use 100% Matrix Models 100% PhD Studies 50% Text Corpus 50% View all 9 projects",
  "content_length": 5150,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:00"
}