{
  "name": "Anna Goldenberg",
  "homepage": "http://goldenberglab.ca",
  "status": "success",
  "content": "Goldenberg Lab Goldenberg Lab Goldenberg Lab Lab News Dec 2019: Anna Goldenberg named one of the CIFAR AI Chairs. Article June 2019: \"Do no harm: a roadmap for responsible machine learning for health care\" published in Nature Medicine Article April 2019: Toronto Life article Q and A with Anna Goldenberg Feb 2019: CBC article and BBC Digital Planet featuring Anna Goldenberg's work on predicting heart attacks with AI. Jan 2019: Globe and Mail article featuring Dr. Goldenberg's appointment as the hospital’s first chair in biomedical informatics and artificial intelligence. Oct 2018: Dr. Goldenberg attends the Anniversary AACR Special Conference Convergence: AI, Big Data, and Predition in Cancer and gives an invited talk. Oct 2018: Luaren goes to the American Association for Human Genetics conference and presents her work iModEst (our new tool to annotate gene regulation September 2018: Anna is invited to give two talks at the NCI workshop on deep learning: (1) Modeling Drug Response using Deep Learning and (2) Interpretability of Deep Learning Methods: Instance and Feature based. July 2018: Anna is invited as Keynote speaker at the NetBio COSI @ISMB. Talk title: Being Bayesian about gene networks to discover disease mechanisms for complex human diseases May 2018: Anna is a keynote speaker at the Parliamentary Health Caucus April 2018: Anna at Marbach Conference leading a session on Mathematical models in genomics and neurocircuitry April 2018: Anna chaired and spoke at AACR’s educational session on Big Data and Deep Learning in Cancer Feb 2018: Dr. Goldenberg invited to talk at NRC Research January 2018: Dr. Goldenberg is a speaker at the CIHR/CIFAR AI and Public Health Meeting Jan, 2018 January 2018: Dr. Goldenberg joins the AI panel during the Girl Geeks Toronto Ethics of AI panel December 2017: Dr. Goldenberg receives the Canadian Research Chair in Computational Medicine Award December 2017: Dr. Goldenberg is on the Artificial Intelligence for Drug Discovery Panel at JLABS Novemeber 2017: Dr Goldenberg to speak at Go North, Google conference in the AI for Social Good section October 2017: Atlantic article featuring Dr. Goldenberg October 2017: Dr Goldenberg giving a talk and speaking on panel at Georgian Partners conference October 2017: Dr Goldenberg and collaborator Dr Malkin featured in Google movie talking about AI in health October 2017: Dr. Goldenberg, Lauren Erdman, and Ben Brew go to ASHG and present September 2017: Dr.Goldenberg gives keynote talk at Elevate Toronto June 2017: Congratulations to Lauren Erdman for finishing her MSc and starting a PhD in the lab! May 2017: Summer students join the lab. Welcome Lebo, Angeline, Jaryd, and Mohamed April 2017: Lauren Erdman and Ben Brew go to Washington DC for the annual American Association of Cancer Research (AACR) conferecne to present their work August 2016: Ben talks about machine learning and medicine at data fest in Chicago August 2016: New members in the lab: welcome to Kingsley and Menjie! July 2016: Anna becomes CIFAR Fellow in Child and Brain Development! June 2016: Anna receives the DCS award for excellence in mentorship and grad student recruitment May 2016: Dustin joins the lab for the summer: welcome Dustin! May 2016: Hareem Naveed is heading to Chicago for the summer! Mar 2016: Early Research Award from the Ministry of Research and Innovation Nov 2015: Anna talks at Duke! Nov 2015: Anna talks at Brown! Nov 2015: Shems Saleh joins the lab! Oct 2015: Talk at Techna Symposium Oct 2015: Ben Brew joins the lab as a data analyst Oct 2015: CIFAR talk on data integration Read more",
  "content_length": 3607,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:58"
}