{
  "name": "Anna Kicheva",
  "homepage": "https://ist.ac.at/research/research-groups/kicheva-group",
  "status": "success",
  "content": "ISTA | Kicheva Group HomeResearchKicheva Group EDUCATION Graduate School Postdocs Internship and Scholarship Program VISTA Science Experiences Kicheva Group Tissue Growth and Developmental Pattern Formation Individuals of the same species can differ widely in size, but their organs have reproducible proportions and patterns of cell types. This requires coordination between tissue growth and the generation of diverse cell types during development. The Kicheva group studies how this coordination is achieved in the vertebrate neural tube, the embryonic precursor of the spinal cord and brain. Neural tube development is controlled by signaling molecules called morphogens, which are produced at the opposite poles of the tissue and spread to form gradients of concentration. Cells interpret morphogen signaling to determine their position and cell fate within the neural tube. Morphogens also control tissue growth by influencing the decisions of cells to divide or exit the cell cycle, but the exact mechanisms are unknown. The Kicheva group is aiming to better understand how morphogen gradients form in a growing tissue, how morphogen signaling is interpreted by cells to regulate tissue growth and how this is coordinated with the formation of tissue pattern. The group studies these questions by focusing on neural tube development in mouse and chick and combining in vivo assays with in vitro differentiation of mouse stem cells and organoids. They use mathematical modeling to relate their experiments to theoretical frameworks. Group Leader Anna Kicheva Professor +43 2243 9000 3076 Anna.Kicheva@ist.ac.at Administrative Support Evan Casella Assistant to Professors +43 2243 9000 1194 Evan.Casella@ist.ac.at Team Paraskevi Athanasouli Postdoc Paraskevi.Athanasouli@ist.ac.at Nursen Balekoglu Postdoc Nursen.Balekoglu@ist.ac.at Martina Greunz-Schindler Research Technician/Lab Management +43 2243 9000 2029 martina.greunz@ist.ac.at Rohit Harish Postdoc rohitkrishnan.harish@ist.ac.at Kasumi Kishi Postdoc Kasumi.Kishi@ist.ac.at Jindriska Leischner Fialova Postdoc Jindriska.LeischnerFialova@ist.ac.at Andreea-Corina Luca Postdoc Andreea-Corina.Luca@ist.ac.at Amrita Singh Postdoc Amrita.Singh@ist.ac.at Current Projects Morphogen gradient formation | Integration of multiple morphogen inputs | Control of tissue growth Publications Guerrero P, Perez-Carrasco R, Zagórski MP, Page D, Kicheva A, Briscoe J, Page KM. 2019. Neuronal differentiation influences progenitor arrangement in the vertebrate neuroepithelium. Development. 146(23), dev176297. View Zagórski MP, Tabata Y, Brandenberg N, Lutolf M, Tkačik G, Bollenbach T, Briscoe J, Kicheva A. 2017. Decoding of position in the developing neural tube from antiparallel morphogen gradients. Science. 356(6345), 1379–1383. View Kicheva A, Bollenbach MT, Ribeiro A, Pérez Valle H, Lovell Badge R, Episkopou V, Briscoe J. 2014. Coordination of progenitor specification and growth in mouse and chick spinal cord. Science. 345(6204), 1254927. View View All Publications ReX-Link: Anna Kicheva Open positions The group is open to outstanding postdoc and student applicants interested in working on tissue growth control in vertebrate development. Candidates with background in developmental, cell or molecular biology or at the interface between biophysics and biology are encouraged to apply. For further information about the research topics in the lab, click here. If you are interested in applying, please email anna.kicheva@ist.ac.at with your CV, motivation letter and contact details of 2-3 referees. Career Since 2024 Professor, Institute of Science and Technology Austria (ISTA)2015 – 2024 Assistant Professor, Institute of Science and Technology Austria (ISTA)2008 – 2015 Postdoc, National Institute for Medical Research (The Francis Crick Institute), UK2008 PhD, University of Geneva, Switzerland and Max Planck Institute of Cell Biology and Genetics, Dresden, Germany Selected Distinctions 2022 ERC Consolidator Grant2020 SFB grant “Stem cell modulation in neural development and regeneration”2017 Austria/Bulgaria scientific and technological cooperation (WTZ) grant2015 ERC Starting Grant2009 Marie-Curie Intra-European Fellowship2008 FEBS Long-term Fellowship Additional Information View Kicheva group site Back to Top We use cookies on our website. By clicking “Technically Necessary Cookies” no other cookies than cookies that are technically necessary to enable various functionalities of the website (e.g. provide access to the website, display of cookie banner) are enabled. However, you may go to \"Cookie Settings\" to provide a controlled consent.Read more...Cookie SettingsAccept AllTechnically Necessary CookiesManage cookies Close Privacy Overview This website uses cookies. Below you can provide individual consent regarding the use of cookies. Cookies under the category \"necessary\" are always enabled since they are technically necessary to access the website. You can find more information on the use of cookies in the data protection statement of ISTA Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website. CookieDurationDescriptioncookielawinfo-checkbox-analytics1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-necessary1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".CookieLawInfoConsent1 yearThis cookie only appears if you makes changes to the categories (e.g disable the category “Analytics”).pll_language1 yearThe ISTA website is a multilingual website, WordPress requires a default language to be selected and set by a cookie in order to display the website, which is recorded by the pll_language cookie by Polylang. Furthermore this cookie is also used to remember the language selected by the user when returning to the website.viewed_cookie_policy1 yearThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. CookieDurationDescription_pk_id*13 monthsMatomo tracking cookie stores a unique user id._pk_ses*13 monthsMatomo tracking cookie stores a unique session id. SAVE & ACCEPT Powered by",
  "content_length": 6664,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:02"
}