{
  "name": "Anna V. Kononova",
  "homepage": "https://www.universiteitleiden.nl/en/staffmembers/anna-kononova/publications#tab-3",
  "status": "success",
  "content": "Anna Kononova - Leiden University Skip to main content Anna Kononova Assistant professor Name Dr. A.V. Kononova Telephone +31 71 527 4799 E-mail a.kononova@liacs.leidenuniv.nl ORCID iD 0000-0002-4138-7024 PhD Candidates Kirill Antonov PhD candidate Mathieu Cherpitel PhD candidate Sebastian Ellmaier PhD candidate / self funded Lucas Ferreira Correia Guest PhD candidate / Self Funded Jacob de Nobel Postdoc Roberta Tamponi PhD candidate Maarten Vonk PhD Candidate / Self Funded Annie Wong PhD Candidate / Guest Haoran Yin PhD candidate / contract News 12 August 2025 Award for a method that can create even better algorithms 01 August 2025 New project explores how engineers and AI can truly work together 11 April 2023 Leiden University hosts conference uniting 80 world-class scientists 13 September 2021 New lecture series: Joint Lectures on Evolutionary Algorithms (JoLEA) 22 April 2021 TEMPORAL project helps improving hearing of the deaf External PhD Candidates Anna van Oosterzee Daniël van de Pavert Amsterdam UMC Savine Martens LUMC Former PhD candidates Duc Ahn Nguyen André Thomaser Outreach Twentieth JoLEA lecture Nineteenth JoLEA lecture Assistant professor Faculty of Science Leiden Inst of Advanced Computer Science Work address Gorlaeus Building Einsteinweg 55 2333 CC Leiden Contact +31 71 527 4799 a.kononova@liacs.leidenuniv.nl JavaScript is required to view this content. Vonk M.C., Vermetten D.L., Nobel J.P. de, Brand S., Malekovic N., Bäck T.H.W., Laarman A.W. & Kononova A.V. (2025), Optimizing causal interventions in hybrid bayesian networks: a discretization, knowledge compilation, and heuristic optimization approach. Lesot M.J., Vieira S., Reformat M.Z., Carvalho J.P., Batista F., Bouchon-Meunier B. & Yager R.R. (Eds.), Information Processing and Management of Uncertainty in Knowledge-Based Systems. IPMU 2024. International Conference on Information Processing and Management of Uncertainty in Knowledge-Based Systems (IPMU) 22 July 2024 - 26 July 2024. Lecture Notes in Networks and Systems no. 1174. Cham: Springer. 245–256. 'Refereed' congrespublicatie Ferreira Correia L., Goos J.C., Klein P., Bäck T.H.W. & Kononova A.V. (2025), TeVAE: a variational autoencoder aproach for discrete online anomaly detection in variable-state multivariate time-series data. Bäck T.H.W., Stein N. van, Wagner C., Garibaldi J.M., Marcelloni F., Lam H.K., Cottrell M., Doctor F., Filipe J., Warwick K. & Kacprzyk J. (Eds.), Computational intelligence: IJCCI 2023. Computational Intelligence. IJCCI 2023 13 November 2023 - 15 November 2023. Studies in Computational Intelligence no. 1196. Cham: Springer . 106-132. 'Refereed' congrespublicatie Ferreira Correia L., Goos J.C., Bäck T.H.W. & Kononova A.V. (2025), PATH: a discrete-sequence dataset for evaluating online unsupervised anomaly detection approaches for multivariate time series, Big Data Research 42: 100573. 'Refereed' artikel in tijdschrift Nobel J.P. de, Martens S.S.M., Briaire J.J., Bäck T.H.W., Kononova A.V. & Frijns J.H.M. (2024), Biophysics-inspired spike rate adaptation for computationally efficient phenomenological nerve modeling, Hearing Research 447: 109011. 'Refereed' artikel in tijdschrift Ferreira Correia L., Goos J.-C., Klein P., Bäck T.H.W. & Kononova A.V. (2024), Online model-based anomaly detection in multivariate time series: taxonomy, survey, research challenges and future directions, Engineering Applications of Artificial Intelligence 138(part A): 109323. 'Refereed' artikel in tijdschrift Vonk M.C., Brand S., Malekovic N., Bäck T.H.W., Laarman A.W. & Kononova A.V. (2024), Balancing computational cost and accuracy in inference of continuous Bayesian networks. Lawrence N. (Ed.), Proceedings of the 12th international conference on probabilistic graphical models, PMLR. Probabilistic Graphical Models (PGM) 2024 11 September 2024 - 13 September 2024. Proceedings of Machine Learning Research no. 246: PMLR. 361-381. 'Refereed' congrespublicatie Vermetten D.L., Doerr C., Wang H., Kononova A.V. & Bäck T.H.W. (2024), Large-scale benchmarking of metaphor-based optimization heuristics, Large-scale benchmarking of metaphor-based optimization heuristics. Gecco '24 Genetic and evolutionary computation 14 July 2024 - 18 July 2024. New York: Association for Computing Machinery. 41-49. 'Refereed' congrespublicatie Nobel J.P. de, Vermetten D.L., Kononova A.V., Shir O.M. & Bäck T.H.W. (2024), Avoiding redundant restarts in multimodal global optimization. Affenzeller M., Winkler S.M., Kononova A.V., Trautmann H., Tusar T., Machado P. & Bäck T.H.W. (Eds.), Parallel problem solving from nature: PPSN XVIII. Parallel Problem Solving from Nature – PPSN XVIII 14 September 2024 - 18 September 2024. Lecture Notes in Computer Science no. 15149. Cham: Springer. 268–283. 'Refereed' congrespublicatie Winter R. de, Long F.X., Thomaser A.M., Bäck T.H.W., Stein N. van & Kononova A.V. (2024), Landscape analysis based vs. domain-specific optimization for engineering design applications: a clear case, 2024 IEEE Conference on Artificial Intelligence (CAI). The 2024 IEEE Conference on Artificial Intelligence (IEEE CAI 2024) 25 June 2024 - 27 June 2024: IEEE. 776-781. 'Refereed' congrespublicatie Antonov K., Tukker T., Botari T., Bäck T.H.W., Kononova A.V. & Stein N. van (2024), Quality-diversity driven robust evolutionary optimization of optical designs. Smith D.G. & Erdmann A. (Eds.), Optical design and engineering IX. SPIE Optical Systems Design, 2024 7 April 2024 - 12 April 2024: SPIE. 130230B. 'Non-refereed' congrespublicatie Antonov K., Kalkreuth R., Yang K., Bäck T.H.W., Stein N. van & Kononova A.V. (2024), A functional analysis approach to symbolic regression, GECCO '24: proceedings of the genetic and evolutionary computation conference companion. Gecco '24 Genetic and evolutionary computation 14 July 2024 - 18 July 2024. New York, N.Y., U.S.A.: Association for Computing Machinery. 859-867. 'Refereed' congrespublicatie Nobel J.P. de, Kononova A.V., Briaire J.J., Frijns J.H.M. & Bäck T.H.W. (2023), Optimizing stimulus energy for cochlear implants with a machine learning model of the auditory nerve, Hearing Research 432: 108741. 'Refereed' artikel in tijdschrift Vermetten D.L., López-Ibánez M., Mersmann O., Allmendinger R. & Kononova A.V. (2023), Analysis of modular CMA-ES on strict box-constrained problems in the SBOX-COST benchmarking suite, GECCO '23 Companion: proceedings of the companion conference on genetic and evolutionary computation. GECCO '23 Companion: Companion Conference on Genetic and Evolutionary Computation 15 July 2023 - 19 July 2023. New York: Association for Computer Machinery. 2346–2353. 'Refereed' congrespublicatie Long X.F., Vermetten D.L., Stein N. van & Kononova A.V. (2023), BBOB instance analysis: landscape properties and algorithm performance across problem instances. Correia J., Smith S. & Qaddoura R. (Eds.), Applications of evolutionary computation. International Conference on the Applications of Evolutionary Computation (Part of EvoStar) 12 April 2023 - 14 April 2023. Lecture Notes in Computer Science no. 13989. Cham: Springer. 380-395. 'Refereed' congrespublicatie Stein N. van, Vermetten D.L., Caraffini F. & Kononova A.V. (2023), Deep BIAS: detecting structural bias using explainable AI, GECCO '23 companion: proceedings of the companion conference on genetic and evolutionary computation. GECCO '23 Companion: Companion Conference on Genetic and Evolutionary Computation 15 July 2023 - 19 July 2023. New York, U.S.A.: Association for Computing Machinery. 455-458. 'Refereed' congrespublicatie Vermetten D.L., Caraffini F., Kononova A.V. & Bäck T.H.W. (2023), Modular differential evolution, GECCO '23: Proceedings of the genetic and evolutionary computation conference. GECCO '23 Companion: Companion Conference on Genetic and Evolutionary Computation 15 July 2023 - 19 July 2023. New York, N.Y., U.S.A.: Association for Computer Machinery. 864–872. 'Refereed' congrespublicatie Thomaser A., Nobel J.P. de, Vermetten D.L., Ye F., Bäck T.H.W. & Kononova A.V. (2023), When to be discrete: analyzing algorithm performance on discretized continuous problems, GECCO '23: Proceedings of the genetic and evolutionary computation conference. GECCO '23 Companion: Companion Conference on Genetic and Evolutionary Computation 15 July 2023 - 19 July 2023. New York: Association for Computer Machinery. 856-863. 'Refereed' congrespublicatie Stein. N. van, Winter R. de, Bäck T.H.W. & Kononova A. V. (2023), AI for expensive optimization problems in industry, 2023 IEEE Conference on Artificial Intelligence (CAI). 2023 IEEE Conference on Artificial Intelligence 5 June 2023 - 6 June 2023: IEEE. 251-254. 'Non-refereed' congrespublicatie Back T.H.W., Kononova A.V., Stein N. van, Wang H., Antonov K., Kalkreuth R.T., Nobel J.P. de, Vermetten D., Winter R. de & Ye F. (2023), Evolutionary algorithms for parameter optimization: thirty years later, Evolutionary Computation 31(2): 81-122. 'Refereed' artikel in tijdschrift Thomaser A.M., Vogt M.E., Kononova A.V. & Bäck T.H.W. (2023), Transfer of multi-objectively tuned CMA-ES parameters to a vehicle dynamics problem. Emmerich M.T., Deutz A., Wang H., Kononova A.V., Naujoks B., Li K., Miettinen K. & Yevseyeva I. (Eds.), Evolutionary Multi-Criterion Optimization: EMO 2023. Evolutionary Multi-Criterion Optimization (EMO) 2023 20 March 2023 - 24 March 2023. Lecture Notes in Computer Science no. 13970. Cham: Springer . 546–560. 'Non-refereed' congrespublicatie Thomaser A.M., Vogt M.E., Bäck T.H.W. & Kononova A.V. (2023), Real-world optimization benchmark from vehicle dynamics: specification of problems in 2D and methodology for transferring (meta-)optimized algorithm parameters. Stein N. van: Marcellini F., Lam H.K., Cottrell M. & Filipe J. (Eds.), 15th International Conference on Evolutionary Computation Theory and Applications. 15th International Joint Conference on Computational Intelligence - ECTA 13 November 2023 - 15 November 2023: SCITEPRESS - Science and Techno",
  "content_length": 20859,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:05"
}