{
  "name": "Anna Jordanous",
  "homepage": "https://www.cs.kent.ac.uk/people/staff/akj22",
  "status": "success",
  "content": "Anna Jordanous - School of Computing - University of Kent Jump to content design1 Anna Jordanous Reader in Computing Deputy Head of School GTA Co-ordinator Email a.k.jordanous@kent.ac.uk Telephone +44 (0)1634 20 2990 More information Go to twitter Go to google-scholar ORCID iD: 0000-0003-2076-8642 Location Room 225 Kennedy Building University of Kent Canterbury Kent CT2 7FS On this page About Research interests Teaching Supervision Professional About Dr Anna Jordanous is a Reader in the School of Computing at the University of Kent. She is a member of the Artificial Intelligence and Data Analytics (AIDA) research group. Her research areas include computational creativity and its evaluation, music informatics, digital humanities, knowledge modelling, Semantic Web, and natural language processing. Primarily she works with computational creativity - the modelling, simulation or replication of creative activities and behaviour using computational means - with a focus on the question of how to evaluate claims of computer software being creative. As well as writing creative software to improvise music, Dr Jordanous has contributed a highly-cited standardised procedure for evaluating creative systems. She also uses music information retrieval and natural language processing in her work. Research interests Anna's research interests span the following areas:Computational creativity (particularly with music/language) and its evaluationMusic InformaticsCognitive modellingKnowledge Modelling and Information RetrievalMachine Learning and Data MiningNatural Language Processing/Computational LinguisticsDigital HumanitiesSemantic Web and Linked DataArtificial Intelligence Teaching Education is not the filling of a pail, but the lighting of a fire. Quote (possibly) from W. B. Yeats.Anna teaches a range of modules in the School of Computing covering algorithms, efficiency and problem solving. Supervision I would welcome people to contact me if they are interested in conducting PhD research. I prefer to hear from people who already have some idea of what research question(s)/topic they would like to investigate. For specific suggestions of PhD project with me, please see here. Information about becoming a postgraduate in the School of Computing is available here. Professional I am a member of the Advisory Board for the Association for Computational Creativity (ACC) (and Steering Committee Member 2018-2022) and Conference for AI and Music Creativity (AIMC). Prior to the formation of AIMC, I also sat on steering committees for for CSMC (Computer Simulation of Musical Creativity) and MuMe (Musical Metacreation). I served two terms (2016-2022) on the Steering Committee for the Society for the Study of Artificial Intelligence and Simulation of Behaviour (AISB). I was Program Co-Chair for the 2018 International Conference on Computational Creativity, in Salamanca, Spain, and the 2017 International Conference on Computational Creativity, in Atlanta, US.Media and Public EngagementMy research impact is measured on impactstory - see here for the impactstory report of the impact my research is having.Recent activities include:2022 Prize jury member for 1st The Sound of AI Hackathon (8-10 July 2022) (AI audio/music)New Scientist presents... Instant Expert: Artificial Intelligence, speaker on Can computers be creative? and panellist at this event at The Knowledge Centre at The British Library, 8th December 2019.Pint of Science talk: \"The Science of Creativity\" May 14th 2018 at the Good Intent pub, Rochester, Kent (Sold out!)Guest Speaker: \"Less-Artificial Artificial Intelligence\" at Credit Suisse AI and Robotic Expo, London, 16th May 2018TedXYouth talk, TedXBenendenSchool 2017, Benenden, KentNews attention from a number of sources for my PLOS ONE article with Bill Keller on modelling creativity2017-20 \"Critical friend\" for Arts Council-funded national initiative on creative people and places (http://creativepeopleplaces.org.uk), advising/collaborating with Ideas Test (cultural organisation based in Swale and Medway regions of Kent, funded by this initiative) on research and analysis of local cultural/community engagement data.Commentator on the two-part Sky Arts documentary ”Computer Says Show” (2016) on computational creativity and the ‘world’s first computer-generated musical’ Beyond the Fence. See more details here or watch the trailer for the documentary.Think Kent (public engagement with research) video lecture: Can a computer be creative? See the talk here.Moderator and chair for 'Digital Conversation' (talks and a panel discussion) on computational creativity at the British Library as part of their Digital Conversations series: Portrait of the Machine as a Young Artist. (This event sold out within weeks, well in advance of the event)2014 International Conference on Computational Creativity panel session: Computational Creativity and the Arts (invited panellist) as reported in this Creativity Post article.Co-organiser for a 2014 public engagement event for the AHRC Valuing Electronic Music project: an evening of talks and electronic music performances at a London pub. See http://valuingelectronicmusic.org/ for recordings of talks, performances and other talks and information related to the project.Featured in Science Gets Down With Miles Davis and Bernini. Interviews with Anna Jordanous and Tony Sigel. C. Cameron & L. Ostashevsky, Nautilus Issue 6 Ch. 5 (Oct 31st 2013).Waiting... with Rachel and Peter. Podcast by Stefan Kaegi with myself & Niki Neecke (2013) with Fuel Theatre, The Roundhouse (Camden) and Kings' Cultural Institute. Funded by Arts Council England/Wellcome Trust. Discussion of the making of the podcast also available here. Last updated 31 May 2024",
  "content_length": 5743,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:03"
}