{
  "name": "Anna Vallgårda",
  "homepage": "https://pure.itu.dk/portal/en/persons/anna-vallgaarda(2fa5dc89-7d78-45d0-96c7-e8f39b78dd3e).html",
  "status": "success",
  "content": "Anna Vallgårda - IT-University of Copenhagen Anna Vallgårda public CV Anna Vallgårda Head of Section Professor, Human-Computer Interaction and DesignIxD Lab https://orcid.org/0000-0001-9898-8106 Emailakavitudk 20042024 Research activity per year Personal profile Research areasIn my research, I seek to answer the question of how we can design alternative possible futures with stronger ethical and ecological commitments. This drives my research in three areas: developing critical practices for interaction design, designing new ethically responsible care technologies for a diverse population, and exploring the relationship between aesthetics and attunement. I do this through an exploratory design practice where I design artifacts that push the boundaries of what we can and should expect from the technologies we live with. I work with design as an inherently critical practice where artifacts in them selves question our current practice. KeywordsInteraction designResearch Through DesignCareAttunementFemTechDeeply Situated DesignCare TechnologiesFormgiving Fingerprint Dive into the research topics where Anna Vallgårda is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Human-Computer Interaction Computer Science 100% Interaction Design Computer Science 99% Design Research Computer Science 81% Design Practice Computer Science 51% Self-tracking Keyphrases 49% Temporal Arts and Humanities 48% Design Process Keyphrases 44% Computational Composites Keyphrases 44% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2004 2009 2016 2017 2020 2024 2024 32 Article in proceedings 6 Journal article 4 Conference article 1 Report 3 More 1 Book chapter 1 Paper 1 PhD thesis Research output per year Research output per year Attuning to Care TechnologiesVallgårda, A., 5 Jan 2024, In: Human-Computer Interaction. p. 1-12Research output: Journal Article or Conference Article in Journal › Conference article › Research › peer-review Open Access Health Technology 100% Design Case 25% Vulnerability 25% Action Potential 25% Intimate Relationships 25% Delineating a Design Space for Premenstrual Disorders as a Relational PhenomenonMartinussen, S. A. N. & Vallgårda, A., 13 Oct 2024, In: NordiCHI '24: Proceedings of the 13th Nordic Conference on Human-Computer Interaction. p. 1-13 59.Research output: Journal Article or Conference Article in Journal › Conference article › Research › peer-review Open Access Participatory Design 100% Design Criterion 100% Negative Experience 100% Premenstrual Dysphoric Disorder 100% Space-based 25% Life in Transitions: The Role of Technology in Supporting Well-being in the Heart of ChangeKarahanoğlu, A., Vidal, L. T., Harrison, D., Steane, J., Ekhtiar, T., Almeida, T., Vallgårda, A. & Balaam, M., 2024, NordiCHI '24 Adjunct: Adjunct Proceedings of the 2024 Nordic Conference on Human-Computer Interaction. p. 1-5 Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research Life Transitions 100% Life Event 66% Demand Adjustment 33% Significant Life Experiences 33% Health Monitoring System 33% What We Took From Metaphors: A Case of Designing For Care After AbortionLusi, B., Vallgårda, A., Bewley, H., Mouritzen, H. & Ludden, G. D. S., 13 Oct 2024, In: NordiCHI '24: Proceedings of the 13th Nordic Conference on Human-Computer Interaction. p. 1-15 14.Research output: Journal Article or Conference Article in Journal › Conference article › Research › peer-review Open Access Abortion 100% Human-Computer Interaction 100% Driven Design Process 100% Psychological Well-Being 100% Abortion Care 50% Craft as a matter of care to inspire the design of computational thingsTsaknaki, V. & Vallgårda, A., 2023, Nordes 2023: This Space Intentionally Left Blank, 12-14 June, Linköping University, Norrköping, Sweden. Design Research SocietyResearch output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile View all 46 research outputs Projects Projects per year 2013 2013 2015 2016 2023 2027 1 Active 4 Finished Projects per year Atmosfære til koncerterVallgårda, A. (PI)Innovationsnetværk for IT - InfinIT01/12/2013 → 30/06/2014Project: Research Mange 100% Deity 100% Finde 100% Gangs 50% Arbejde 50% TRACE : TRAnsformations in CarE - Investigating Emerging Human-Technology Interactions in Practice of CareFritsch, J. (PI), Ertner, S. M. (CoI), Grönvall, E. (CoI), Yndigegn, S. L. (CoI), Vallgårda, A. (CoI), Dzierzak, K. A. (CoI), Ravn, N. E. (CoI), Martinussen, S. A. N. (CoI), Hartmann, M. (CoI) & Karaturhan, P. (Collaborator)Velux Foundation01/10/2023 → 30/09/2027Project: Research Human-technology Relationship 100% Health Practices 100% In Care 100% Implantable Defibrillator 60% Chronic Illness 50% IoT: Internet of Things i produktion og værkstedVallgårda, A. (PI) & Boer, L. (CoI)Innovationsnetværk for IT - InfinIT01/01/2016 → 31/05/2016Project: Research Research Fellow visitVallgårda, A. (PI)University of Twente10/08/2016 → 31/07/2017Project: Research Teknologi til integration af bevægelse i folkeskolenVallgårda, A. (PI)Innovationsnetværk for IT - InfinIT01/02/2015 → 31/05/2015Project: Research Press/Media Kronik: KRONIKEN 18: Danmark står i en designkrise. Sådan løser vi denVallgårda, A.18/06/20251 Media contributionPress/Media: Press / Media Forskere undersøger digitalisering af omsorgspraksisserFritsch, J., Vallgårda, A., Grönvall, E. & Yndigegn, S. L.28/06/20231 Media contributionPress/Media: Press / Media Vi kontrollerer vores kroppe med apps. Men kan de også hjælpe graviditeten på vej?Vallgårda, A.10/03/20221 Media contributionPress/Media: Press / Media Banebrydende høreapparat får hørehæmmede til at høre ting, som ingen andre kanVallgårda, A.08/12/20161 item of Media coveragePress/Media: Press / Media Den moderne Da Vinci er et kollektivVallgårda, A.03/09/20141 item of Media coveragePress/Media: Press / Media Activities Activities per year 2013 2013 2014 2014 3 Organisation and participation in conference 1 Organisation and participation in workshop, seminar, course 1 Membership in review committee 1 Lecture and oral contribution Activities per year Alternative Art Fair CopenhagenVallgårda, A. (Organizer)5 Sept 2014 → 7 Sept 2014Activity: Participating in or organising an event types › Organisation and participation in conference Knowing things: objects, knowledge and interactionVallgårda, A. (Speaker)6 Oct 2014 → 7 Oct 2014Activity: Talk or presentation types › Lecture and oral contribution Konstfack (External organisation)Vallgårda, A. (Member)10 Aug 2014 → 10 Sept 2014Activity: Membership types › Membership in review committee Material Play Vallgårda, A. (Lecturer)4 Dec 2014Activity: Participating in or organising an event types › Organisation and participation in workshop, seminar, course Nordic Design Research Conference: Experiments in Design ResearchVallgårda, A. (Program Chair)9 Jun 2013 → 12 Jun 2013Activity: Participating in or organising an event types › Organisation and participation in conference View all 6 activities",
  "content_length": 7499,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:08"
}