{
  "name": "Annabelle McIver",
  "homepage": "https://researchers.mq.edu.au/en/persons/annabelle-mciver",
  "status": "success",
  "content": "Annabelle McIver - Macquarie University Annabelle McIver public CV Annabelle McIver public CV View Scopus Profile Annabelle McIver Professor Professor, School of ComputingData Horizons Research CentreFuture Communications Research CentreFrontier AI Research CentreAdvanced Drone Systems Research Centre https://orcid.org/0000-0002-2405-9838 Phone+61 2 9850 9579Emailannabelle.mcivermq.eduau h-index 1837 Citations 22 h-index Calculated based on number of publications stored in Pure and citations from Scopus 1987 …2025 Research activity per year Personal profile BiographyAnnabelle McIver trained as a mathematician at Cambridge and Oxford Universities. Her research uses mathematics to analyse security flaws in computer systems. Annabelle has had a number of international visiting positions and fellowships at institutions such as MIT (USA), Birmingham (UK),  LRI and INRIA (France), ETH Zurich, and was a Junior Research Fellow in Mathematics at St Hilda's College, Oxford. She is a member of the Programming Methodology technical working group of the International Federation of Information Processing. She was (co-) recipient of th 2014 Best Cybersecurity Research Paper awarded by the US National Security Agency. More about her research activities can be found at the Topete Research Group.Research interestsProgram verification, quantitative information flow, computer security, privacy. Education/Academic qualificationMathematics, DPhil, Finitely Generated Non-Hopf Modules, University of OxfordAward Date: 1 Jul 1990Mathematics, BA (Double First), University of CambridgeAward Date: 1 Jul 1985 External positionsVisiting Researcher, ETH Zurich15 Jul 2016 → 31 Dec 2016 Fingerprint Dive into the research topics where Annabelle McIver is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Probability Theory Mathematics 100% Proof Computer Science 88% Case Study Computer Science 76% Model Checking Computer Science 72% Nondeterminism Computer Science 59% Differential Privacy Computer Science 57% Probabilistic Choice Computer Science 56% Information Leakage Computer Science 55% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2008 2008 2010 2011 2012 2014 2016 2017 2018 2019 2022 2023 2024 2028 1 Not started 2 Active 14 Finished Projects per year DFCRC: Digital Finance CRC Industrial PhD Scholarship - Thisal DE SILVAMcIver, A. (Primary Chief Investigator), DE SILVA, T. (Student CI), Asghar, H. (Supervisor) & Bandara, D. (Supervisor)1/07/24 → 30/06/28Project: Research MRFF DoH (Usyd led): AIS-SHIELDS: Securing Health Intelligence Effors & Linking Data SilosSullivan, R. (Chief Investigator), Galloway, G. (Chief Investigator), Calamante, F. (Chief Investigator), Close, T. (Chief Investigator), Abramson, D. (Chief Investigator), Soyer , H. (Chief Investigator), Fernández-Peñas, P. (Chief Investigator), Janda, M. (Chief Investigator), Caffery, L. (Chief Investigator), Dras, M. (Primary Chief Investigator), McIver, A. (Chief Investigator), Barnett, M. (Chief Investigator), Wang, C. (Chief Investigator), Shieh, C.-C. (Chief Investigator), Pardey, M. (Chief Investigator), Pope, B. (Chief Investigator), Ward, N. (Chief Investigator), Jakrot, V. (Chief Investigator), Ferguson, P. M. (Chief Investigator) & Price, G. (Chief Investigator)30/06/23 → 30/08/26Project: Research Digital Finance Cooperative Research Centre PhD ProjectMcIver, A. (Primary Chief Investigator)Project: Research LP21: Robust and Scalable Autonomous Landing for DronesHan, R. (Primary Chief Investigator), McIver, A. (Chief Investigator), Zheng, J. (Chief Investigator), Houston, R. (Partner Investigator) & Kallinen, V. (Partner Investigator)16/08/22 → 17/08/25Project: Research Differential Privacy for Natural Language ProcessingDras, M. (Primary Chief Investigator) & McIver, A. (Chief Investigator)1/01/22 → 31/12/22Project: Research View all 17 projects Research Outputs Research output per year 1987 2001 2005 2006 2010 2011 2012 2014 2015 2018 2019 2020 2022 2025 56 Conference proceeding contribution 48 Article 8 Chapter 5 Editorial 12 More 3 Conference paper 2 Edited Book/Anthology 2 Book 2 Foreword/postscript/introduction 1 Paper 1 Short survey 1 Preprint Research output per year Research output per year Empirical calibration and metric differential privacy in language modelsFaustini, P., Fernandes, N., McIver, A. & Dras, M., Nov 2025, In: IEEE Access. 13, p. 196024-196039 16 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Differential Privacy 100% Language Modeling 100% Membership Inference Attack 33% Use Case 16% Gaussian White Noise 16% IDT: dual-task adversarial rewriting for attribute anonymisationFaustini, P., Tonni, S. M., McIver, A., Xu, Q. & Dras, M., 8 Jul 2025, (Accepted/In press) In: Computational Linguistics. 39 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Natural Language Processing 100% Sensitive Attribute 100% Anonymization 100% Sensitive Informations 50% Attack Technique 50% 18 Downloads (Pure) Probabilistic datatypesChen, C., McIver, A. & Morgan, C., 2025, Theoretical Aspects of Computing – ICTAC 2024: 21st International Colloquium, Bangkok, Thailand, November 25–29, 2024, proceedings. Anutariya, C. & Bonsangue, M. M. (eds.). Cham: Springer, Springer Nature, p. 3-16 14 p. (Lecture Notes in Computer Science; vol. 15373).Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Functional Property 100% Information Flow Model 100% Calling Program 100% Source-level reasoning for quantifying information leaksChen, C., McIver, A. & Morgan, C., 2025, Principles of verification: cycling the probabilistic landscape: essays dedicated to Joost-Pieter Katoen on the occasion of his 60th birthday, part I. Jansen, N., Junges, S., Kaminski, B. L., Matheja, C., Noll, T., Quatmann, T., Stoelinga, M. & Volk, M. (eds.). Cham: Springer, Springer Nature, p. 98-127 30 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter › peer-review Information Leak 100% Explaining ε in local differential privacy through the lens of quantitative information flowFernandes, N., McIver, A. & Sadeghi, P., 2024, 2024 IEEE 37th Computer Security Foundations Symposium CSF 2024: proceedings. Piscataway, NJ: Institute of Electrical and Electronics Engineers (IEEE), p. 419-432 14 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Differential Privacy 100% Information Theory 100% Computer System 33% Operational Interpretation 33% Research Information 33% 2 Citations (Scopus) View all 129 research outputs Prizes Best Scientific Cybersecurity Paper CompetitionMcIver, A. (Recipient), 10 Nov 2015Prize Distinguished paper award at Computer Security Foundations Conference (joint)McIver, A. (Recipient), 1 Jul 2024Prize Platt Prize McIver, A. (Recipient), 1984Prize Unwin PrizeMcIver, A. (Recipient), 1985Prize Winner - Faculty of Science and Engineering Award for Inter-School Collaboration - 2023Nayak, A. (Recipient), Mahmood, A. (Recipient), Beheshti, A. (Recipient), McIver, A. (Recipient), Bilgin, A. (Recipient), Liquet-Weiland, B. (Recipient), Svensson, C. (Recipient), Ramakrishnan, C. (Recipient), Smith, C. (Recipient), Molla-Aliod, D. (Recipient), Vatsalan, D. (Recipient), Xue, E. (Recipient), Gupta, G. (Recipient), Sofronov, G. (Recipient), Baker, G. (Recipient), Liu, G. (Recipient), Asghar, H. (Recipient), Doosti, H. (Recipient), Zhu, H. (Recipient), Jiang, I. (Recipient), Zheng, J. (Recipient), Lin, H. (Recipient), Wu, J. (Recipient), Ma, J. (Recipient), Binkowski, K. (Recipient), Dras, M. (Recipient), Manuguerra, M. (Recipient), Orgun, M. (Recipient), Lay, M. (Recipient), Zou, N. (Recipient), Kordzakhia, N. (Recipient), Busch, P. (Recipient), Graham, P. (Recipient), Schwitter, R. (Recipient), Chen, S. (Recipient), Smith, S. (Recipient), Cassidy, S. (Recipient), Prvan, T. (Recipient), Fung, T. (Recipient), Li, Y. (Recipient), Wang, Y. (Recipient), Zhang, Y. (Recipient) & Zhou, Y. (Recipient), 2023Prize: Other distinction School Collaboration 100% Activities Activities per year 2001 2018 2019 2019 5 Invited talk 2 Organising a conference, workshop or event series 2 Hosting an academic visitor 2 Membership of board 2 More 2 Visiting an external academic institution Activities per year Marta KwiatkowskaMcIver, A. (Host)29 Apr 2019 → 30 Apr 2019Activity: Hosting a visitor › Hosting an academic visitor Third World Congress on Formal MethodsMcIver, A. (Participant)7 Oct 2019 → 11 Oct 2019Activity: Participating in or organising an event › Organising a conference, workshop or event series Proofs for differential privacyMcIver, A. (Speaker)1 Dec 2019 → 4 Dec 2019Activity: Talk or presentation › Invited talk Mário S. AlvimMcIver, A. (Host)3 Jun 2019 → 25 Jun 2019Activity: Hosting a visitor › Hosting an academic visitor Experiments in information flowMcIver, A. (Speaker)7 Oct 2019Activity: Talk or presentation › Invited talk View all 13 activities Press/Media Socially responsible technologyMcIver, A.12/08/191 Media contributionPress/Media: Public Engagement Activities",
  "content_length": 9581,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:07"
}