{
  "name": "Anne C. Elster",
  "homepage": "https://www.ntnu.edu/employees/elster",
  "status": "success",
  "content": "Anne C. Elster - NTNU Anne C. Elster Download press photo Download press photo Foto: Close Anne C. Elster Professor Department of Computer Science Faculty of Information Technology and Electrical Engineering elster@ntnu.no +4798102638 Gamle Elektro G236B, Gløshaugen, Sem Sælands vei 9 Twitter Main Web Page -- English Research Group -- HPC-Lab About CV PhD EE Cornell Univ. 1994; IEEE Senior Member 2000; IEEE Computer Society Distinguished Contributor -- Charter member (2021) NTNU's Board 1st alternate (2017-2021, 2021-25), except Member (2022-23) IE Faculty (Dean's) Board, Member 2021-25 , Alternate 2019-21 Hiring Commitee (AU)  IE Faculty (member 2021-2025, alternate 2017-21) Prof. Elster has also been affiliated with the Oden Institute at  the University of Texas at Austin for many years. She spent her last sabbatical/research leave there (July 2023-June 2024), and has and spent several other summers and sabbaticals there. Her Senior Visiting Scientitst status has been extended until Summer 2025. https://oden.utexas.edu/people/directory/Anne-C.-Elster/ Elster hosted the NTNU booth at SC24, and served as a mentor in SC´s WHPC and the general mentoring program at SC24. She also served on the SC24 Program Committee, including reviewing papers, served on the Sid Fernbach Award Committee and helped judge SRC posters.  Some other recent talks & events can be found further below. In Fall 2024 a record number -- over 100 students --  took her 4th year class on Parallel Computing. This is real challenge given the reduced staff support due to the current economic challenges at NTNU. RESEARCH: Founder and Director – HPC-Lab, Dept. of Computer & Info. Science NTNU, started as her research group when she joined NTNU in 2001, and founded as a lab in 2008. It is now an established research lab in Heterogeneous and Parallel Computing, consisting of several Post Docs, PhD students and Master students as well as both national and international visiting colleagues and scientists who want to learn about and experiment with heterogeneous computing. Elster is or has been the main advisor for several PhD students, over 100 master students, and have been co-advisor, Opponent and EU evaluator for many more. PhD student Jakob R. Jørgensen, U of Århus, Denmark, spent Spring 2021 with us Prof. GavinTaylor, US Naval Academy, spent his13-month sabbatical leave from USNA at HPC-Lab (June 2017-Aug 2018). His research interests are in Deep Learning/Machine Learning and HPC. We learned a lot from eachother! He is back at NTNU for another sabbatical for 2024/25 visiting our AI group. PROJECTS : RCN SFI Centre for Geophysical Forecasting (2020-2028)-- to start Dec. 2020. Elster is WP leader, and have now hired 3 PhDs and soon 1 Post Doc as part of this project. The Postdoc will be joint with Prof. Ole Jakob Mengshoel (AI, IDI). RCN (NFR) FRINATEK project on Computational Microscopy with Prof. Dag Breiby  was funded (2019-2023), Elster was WP leader. EU H2020 MCSA Post Doc project TICOH: Taming Irregular Computations On Heterogeneous processor (approved jan 27, 2017).  Funded  (July 2017- June 2019).  Elster was PI. EU H2020 ICT FEIT 2014 Project CloudLightning, funded 2015-2018. Elster was NTNU's PI. TEACHING I love teaching. Here are some of the main courses I am or have been involved with: NTNU: Parallel Computing, Compilers, Operating Systems, + 3 special topics MS/PhD courses covering parallel environments, numerical methods, heterogeous and grid computing and highly parallel algorithms. IT-GK (Intro to Comp. Sci for majors). Taught main lectures in 2019 since wanted to be a role model for our incoming women. UT Austin: Algorithms, Data Structures, Operating Systems and Iterative Numerical Methods INVITED TALKS (recent/selected) Keynote speaker at IEEE CCGrid 2025: https://site.uit.no/ccgrid2025/professor-anne-c-elster/. Distinguished Speaker for the IEEE CS (2019-2022) +  EXA DVP Event talk Dec 5, 2024 Invited speaker, BDLD-15, Nov 26, 2024: https://conf.researchr.org/program/bldl-15/program-bldl-15/ Invited speaker, ScalPerf´24, Bertinoro, Italy. https://scalperf24.bici.events/program General Chair and Program Chair together with former PhD student and now colleague, Assoc. Prof. Jan Christian Meyer at IEEE IPDPS workshop HCW-24 and HCW-23, respectively, including charing a panel with Charles Leiserson, Yale Patt, DK Panda, Fred Kjolstad (Standford) and Phillip Tillet (OpenAI). Keynote/invited talk: \"GPUs and HPC: Empowering AI and the Sciences\", given virtually at Niles 2023, The 5th Novel Intelligent and Leading Emerging Sciences Conference, Oct 22, 2023, Egypt. Invited talk : \"GPUs and HPC: Empowering AI and the Sciences\", given virtually, Dec 28, 2023, Nusa Putra University, Indonesia SERVICE (selected): ICT Eval. Committee, SFF (Swedish Foundation for Strategic Research), 2021-22, 2025 RFK (National Resource Allocation Committe for computing, storage and advance user support,  Sigma2. Member 2019-22 & 2023 (resigned due to research leave). Evalation Committee for Vinnova, Sweden, 2023 NIK/NIKT Board member (2017-2021) & Co-Chair NIKT 2021 Current and previous Post Docs & Researchers . Elster is/was main advisor, if no comment given Dr. Bart Iver van Blokland Jan 1, 2023 - present (contract ends Dec 2026) Dr. Ajeet Pathak (ERCIM (Apr 2022-23, then CGF w/ Ole Jakob Mengshoel) April 2022-25) Dr. Weifeng Liu (MSCA Post Doc 2017-18) Dr. Mohammad Qasim (Researcher, joined Oct  2016, PhD fra UiB) Dr. Malik Khan (Post Doc 2013-18, PhD USC, USA) Dr. Annette Stahl (Reseacher 2013, PhD Univ. of Heldelberg, Germany, now Assof Prof., Cybernetics, NTNU) Dr. Ian Karlin (Post Doc 2011, PhD U of Colorado, Boulder 2011, now at Sandia, NL) Dr. Jan Perhac (ERCIM Post Doc 2010-2011) Dr. John Ryan (Post Doc 2010, PhD Irland, returned earlier than planned for a permanent job in Ireland) Dr. Henrik R. Nagel (Post Doc 2005-2007, now a permanent employee at NTNU's computing center, in the HPC group, NTNU) Current and former PhD students: Claudi Lleyda Moltó - CGF PhD in HPC, joined February 2023 Tobias Dyngeland - CGF PhD in HPC, Joined January 2023 Tor A. Haughdahl - RSO PhD in HPC, joined December 2022 (Elster main advisor for Masters´s degree and co-advisor with Stephanon Cherubin for PhD) Rune Jensen (on leave) Bart Iver van Blokland (Elster was co-advisor, Main Advisor Theo Theoharis, defended December 2021) Thomas Falch (PhD NTNU, completed 2017, defended March 2018, currently with Mathworks in Cambridge, UK) Johannes Kvam (Elster is co-advisor. Main advisor: B. Angelsen, defended May 2019) Lane Holloway (PhD, Univ. of Texas at Austin , 2016; Elster was co-advisor, main advisor: Don Fussell, UT Austin Computer Science (current Dept Chari)) Eirik Smistad (PhD, NTNU 2015; Elster was co-advisor, main advisor Lindseth) Jan Christinan Meyer (PhD 2012, now adjunct assoc. prof. in CS, NTNU and permanent employee at NTNU's computing center in the HPC group) Thorvald Natvik (PhD 2010, now working for madalia in California, USA) Cyrill Baninon (Elster main advisor 2003-2006, PhD 2007 w/ Prof. Natvig, now working for Telenor AI) External/International PhD committee work: Benjamin Chetioui, 2nd Opponent with 1st Opponent Bjarne Stroustrup, Dept. of Computer Science, University of Bergen, Norwat, Nov 27, 2024 David Strelak  PhD eval committee for (cotutelle of Masaryk University and UAM, Spain, Oct. 2022 Carl-Johannes Johnsen,  PhD committee /Opponent at DIKU, Univ of Copenhagen, March 2022. Profs. James Avery and Brian Vinter were advisors. Dissertation title: \"Automated AI Learning for X-Ray Based Classification\". Ali Charara  PhD Thesis Committee Membe, KAUST, Saudi Arabia, May 9, 2018. Prof. David Keys was the main advisor. Dissertation title \"High Performance Covariance Matrix Computations on Heterogeneous Systems\". Ivy Bo Peng External evaluation committee member of KTH , Dec. 29, 2017. Dissertation title:\"Data Movement on Emerging Large-Scale Parallel Systems\" . Her advisors were Profs Erwin Laure and Stefano Markidis, and the opponent was LLNL CTO Dr. Bronis R. de Supinski. Profs. Siegfried Benkner (Vienna) & Christoph Kessner (Linköping) served with Dr. Elster on the external committee. M. D. Naim Opponent for  at Univ of Bergen, Norway, June 27, 2017. Advisor: Prof Fredrik Manne. http://www.uib.no/ii/108716/disputas-md-naim May 2016 Lane Holloway - Co-supervisor, ECE, Univ. of Texas at Austin, USA (see PhD students) Kenneth Shovhede, - Opponent, Niels Bohr Institute, Copenhagen Univ., Denmark, June 2013. Michele Martone, EU evaluator of PhD thesis, Tor Verghata, Univ, of Rome, Italy, May 2011. Young Liu, Second Opponent, Computer Science, U of Tromsø, Norway, Feb 2011. Penti Huttunen, Second Opponent at Lappeenranta Univ. of Technology , Finland, Dec 2002. In addition I have been the main advisor for 100+ masterstudenter who really have taught me a lot! Since 2006 more than 35 of the masters thesis have been within GPU computings. Current and former Master students: For more info on current students, see here: https://www.ntnu.edu/idi/hpc-lab/people Jon Berquist - Elster main advisor, co-advised by Drs. Jan Petter Morten & Ole Henrik Waagaard (ASN); MTech thesis title: \"Benchmarking Popular SVD libraries and Optimizing and Autotuning RSVD Targeting the Real-Time Applications\" (July 2023). Jon worked for NTNU´s IT Dept. before joining PhD program sponsored by CGF.(Main Advisor: Ole Jakob Mengshoel) Steffen Haug - MTech thesis title: \"Improving Parallel SPH for Snow Simulations: Neighborhood Search and Kernel Derivatives (July 2023) Mikael Nilssen -  MTech thesis title: \"Vulkan Port of OpenGL-based CUDA Snow Simulation\" (June 2023) Mikael is now at KongsbergGruppen Ruben S. Valen - MTech thesis: \"Analysing Deep Halos on Modern GPUs\" (June 2023) Iver Håkonsen, Elster main advisor, co-advised by Dr. James D. Trotter, Simula Research, Oslo. MTech thesis title: \"GPU-enabled Laplace-Dirichlet Rule- Based Method for Cardiac Fiber Computations\", (February 2023) Hå",
  "content_length": 66844,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:14"
}