{
  "name": "Anne Driemel",
  "homepage": "http://tcs.cs.uni-bonn.de/doku.php?id=staff:annedriemel",
  "status": "success",
  "content": "Prof. Dr. Anne Driemel [Informatik-Abteilung V] University of Bonn · Institute of Computer Science · Algorithms and Complexity Sidebar Home People Research Research Seminar Teaching Portfolio By semester (including past and future semesters) Current Semester (WiSe 2025/26) Bachelor BA-INF 032 - Algorithmen und Berechnungskomplexität I BA-INF 011 - Logik und diskrete Strukturen Master MA-INF 1218 - Algorithms and Uncertainty MA-INF 1323 - Computational Topology MA-INF 1203 - Discrete and Computational Geometry Prof. Dr. Anne Driemel Address Universität Bonn Institut für Informatik V Friedrich-Hirzebruch-Allee 8 53115 Bonn Phone+49 (228) 73 - 69 683 Email lastname-at-cs-dot-uni-bonn-dot-de Office Room 2.060 Office HoursBy appointment Research interests Discrete and Computational Geometry Algorithms and Data structures Trajectory and Time Series Analysis Publications Google Scholar DBLP ArXiv Teaching I supervise theses in Computer Science and Mathematics. You can find a list of potential Master thesis topics here. For Bachelor thesis topics, please inquire by email. WS 2025/2026 MA-INF 1203 Discrete and Computational Geometry WS 2025/2026 S4C1 / MA-INF 1205 Seminar on Approximation Algorithms for Shape Matching SS 2025 BA-INF 144 Algorithmische Grundlagen des Maschinellen Lernens SS 2025 S4C1 / MA-INF 1205 Seminar on Approximation Algorithms for Optimal Transport WS 2024/2025 BA-INF 051 Projektgruppe Algorithmische Geometry -- Computational Origami WS 2024/2025 MA-INF 1203 Discrete and Computational Geometry WS 2024/2025 S4C1 / MA-INF 1205 Seminar on String and Curve Matching Algorithms WS 2023/2024 BA-INF 032 Algorithmen und Berechnungskomplexität I WS 2023/2024 MA-INF 1203 Discrete and Computational Geometry SS 2023 BA-INF 041 Algorithmen und Berechnungskomplexität II Service Steering Committees and Professional Societies Computational Geometry Steering Committee, elected for 2022-2026 European Association for Theoretical Computer Science (EATCS) Council, elected since 2023 Interest Group on Algorithmic Foundations of Information Technology (IGAFIT) , appointed since 2020 SafeTOC Steering Committee appointed since 2025 (advocate for SoCG and SODA since 2019) Program Committees (Selection) SODA 2017, SODA 2020, SODA 2025 ESA 2017, ESA S 2022, ESA A 2023 ACDA 2021, ALENEX 2021, SOSA 2022 SoCG 2015, SOCG 2021 CGWeek YRF 2022 (chair) Editorships Editor Discrete & Computational Geometry (DCG) Associate Editor Journal of Computational Geometry (JoCG) Guest editor ACM Transactions on Algorithms (TALG) (Special Issue on SODA’20) Editor Discrete Mathematics & Theoretical Computer Science (DMTCS) Co-Organization of Academic Events (Selection) Dagstuhl Seminar Computational Geometry 2021 , 2019 , and 2017 Hausdorff School Algorithmic Data Analysis 2022 Rhein-Ruhr Computational Geometry Workshop 2022 83rd Workshop on Algorithms and Complexity, GI-Theorietag 2022 Dagstuhl Seminar Computational Geometry of Earth System Analysis 2023 Workshop Massive Data Models and Computational Geometry 2024 Workshop Massive Data Models and Computational Geometry II 2025 Funding Lamarr-Institute , Institute for Machine Learning and Artificial Intelligence Efficient Representation of Geometric Similarity, DFG Research Grant funded as part of KI-FOR Algorithmic Data Analytics for Geodesy , since 2022 iBehave Research Network funded by the state of NRW, 2022-2026 Trajectory Forecasting, DFG Research Grant funded as part of FOR 2535 Anticipating Human Behavior, since 2021 HCM Bonn Junior Fellow of the Hausdorff Center for Mathematics, 2018-2023 Detection methods for similarity structures in time-dependent data, NWO Veni Award, 2014-2018 Brief Curriculum Vitae 2018 Professor (W2) of Computer Science at the University of Bonn, tenured 2015 Assistant Professor (UD) of Computer Science at the Eindhoven Technical University 2014 Postdoc at Eindhoven Technical University, Data Mining Group 2013 Postdoc at Dortmund Technical University, working with Christian Sohler 2013 PhD Computing Science from Utrecht University 2009 Diploma Computer Science from the Free University of Berlin Copy of my CV (as of Sept 2023) Group Current Lotte Blank Jacobus Conradi Marena Richter Alumni Frederik Brüning Benedikt Kolbe Dennis Rohde Ioannis Psarros Page Tools Imprint/Impressum",
  "content_length": 4301,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:11"
}