{
  "name": "Anne H. H. Ngu",
  "homepage": "http://www.cs.txstate.edu/~hn12",
  "status": "success",
  "content": "Anne Hee Hiong Ngu Anne Hee Hiong Ngu Home Teaching Research Publications Service About Latest News Computer Science Ph.D. program Priority application deadline is Feb 1 for the Fall admission. Current Research Project Site News on SmartFall Useful Links Computer Science Department Texas State University REU Site program on Edge Computig (active) REU Site program on Software System and Analysis (archived) REU Site Program on IoT(archived) REU Site Program on New Paradigm of IR (archived) Internet of Things Workshop (C-IOT2014) REUIOT students' presentations WISE 2005 Conference Online Guide for Women in STEM Search Welcome to my home page I am a Professor and the Ph.D. Program director with the Department of Computer Science at Texas State University. My main research interests are in smart health, knowledge or service discovery, internet of things, scientific workflows, databases, software engineering and agent technologies. I have worked in different countries as a researcher, including Institute of Systems Science in Singapore, Tilburg University in the Netherlands, CSIRO (Data61) in Australia, Telcordia Technologies, Lawrence Livermore National Laborartory, and the Microelectronics and Computer Technologies Corporation (MCC) in Austin, Texas. From 1992-2000, I was a Senior Lecturer in the School of Computer Science and Engineering, University of New South Wales (UNSW), Sydney, Australia where I specialized in teaching databases and performing research in next generation database systems. I also held an adjunct Associate Professor position at UNSW from 2002-2006 and a visiting scholar position at University of California, Berkeley in the fall of 2015. My research have been funded by the National Science Foundation, Lawrence Livermore National Laboratory, Pacific Northwest National Laboratory, USA Department of Education, and Australian Research Council in amount of over 5 millions. I was a receipent of the national NCWIT Undergraduate Research Mentoring Awards in 2013. The National Center for Women & Information Technology (NCWIT) created this award to recognize computing professors for their outstanding mentorship, high-quality research opportunities, and efforts to encourage and advance undergraduates (particularly women and minorities) in computing-related fields. In 2010 and 2022, I received the Texas State Presidential Distinction Award for Excellence in Scholarly/Creative Activities. Additionally, in 2014 and 2017, I was honored with the Texas State Presidential Distinction Award for Services. Home | Teaching | Research | Publications | Service |About Copyright © simplestyle_banner | HTML5 | CSS | HTML5 Web Templates",
  "content_length": 2673,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:17"
}