{
  "name": "Anne Håkansson",
  "homepage": "https://en.uit.no/ansatte/person?p_document_id=584195",
  "status": "success",
  "content": "Håkansson, Anne | UiT Skip to main content Unit startpage Employees Anne Håkansson Professor Department of Computer Science anne.hakansson@uit.no +4777644096 93069699 Tromsø You can find me here Anne Håkansson About Research and teaching CV Find me here Job description Anne Håkansson is Professor in Computer Science with focus on Artificial Intelligence, at UiT – The Arctic University of Norway Chair of the CAI Lab https://en.uit.no/forskning/forskningsgrupper/gruppe?p_document_id=504980 Publications Scientific articles and book chapters Books and anthologies Other Mahshid Nejati Amiri, Anne Eva Margareta Håkansson, Odne Stokke Burheim, Jacob Joseph Lamb : Lithium-ion battery digitalization: Combining physics-based models and machine learning Renewable and Sustainable Energy Reviews 21. May 2024 DOI / ARKIV Yigit Can Dundar, Bernt Arild Bremdal, Anne Eva Margareta Håkansson, Randi Karlsen : Multi-Agent Collision Avoidance Method Using Fuzzy Risk Estimation and Information Sharing in Unknown Environments 2023 DOI / ARKIV Muhammad Sulaiman, Anne Håkansson, Randi Karlsen : Fit-Twin: A Digital Twin of a User with Wearables and Context as Input for Health Promotion Biostec 2023 DOI / ARKIV Seshathiri Dhanasekaran, Anders Andersen, Randi Karlsen, Anne Håkansson, André Henriksen : Data Collection and Analysis Methods for Smart Nudging to Promote Physical Activity: Protocol for a Mixed Methods Study Studies in Health Technology and Informatics 2023 DOI / ARKIV Muhammad Sulaiman, Anne Eva Margareta Håkansson, Randi Karlsen : A Proof-of-Concept Implementation Based on the Framework of AI-Enabled Proactive mHealth: Health Promotion with Motivation 2023 DOI Muhammad Sulaiman, Anne Håkansson, Randi Karlsen : A Framework for AI-enabled Proactive mHealth with Automated Decision-making for a User’s Context Biostec 2022 DOI / ARKIV Seshathiri Dhanasekaran, Anders Andersen, Randi Karlsen, Anne Håkansson, André Henriksen : Data collection and smart nudging to promote physical activity and a healthy lifestyle using wearable devices 2022 DOI / ARKIV Aya Saad, Anne Håkansson : RAMARL: Robustness Analysis with Multi-Agent Reinforcement Learning - Robust Reasoning in Autonomous Cyber-Physical Systems Procedia Computer Science 2022 DOI / ARKIV Anne Håkansson, Aya Saad, Akhil Sadanandan Anand, Vilde Benoni Gjærum, Haakon Robinson, Katrine Seel : Robust Reasoning for Autonomous Cyber-Physical Systems in Dynamic Environments Procedia Computer Science 2021 DOI / ARKIV Akhil Sadanandan Anand, Katrine Seel, Vilde Benoni Gjærum, Anne Håkansson, Haakon Robinson, Aya Saad : Safe Learning for Control using Control Lyapunov Functions and Control Barrier Functions: A Review Procedia Computer Science 2021 DOI / ARKIV Chiara Bordin, Anne Håkansson, Sambeet Mishra : Smart Energy and power systems modelling: an IoT and Cyber-Physical Systems perspective, in the context of Energy Informatics Procedia Computer Science 2020 DOI / ARKIV Muhammad Sulaiman, Randi Karlsen, Anne Håkansson : AI-Enabled Proactive mHealth: A Review. ICT for Health, Accessibility and Wellbeing. IHAW 2021. Communications in Computer and Information Science Springer 2021 Anne Håkansson, Ronald Lee Hartung : ARTIFICIAL INTELLIGENCE Concepts, Areas, Techniques and Applications. Studentlitteratur AB 2020 FULLTEKST Anne Håkansson : Computer Science: Women matter! 2022 Muhammad Sulaiman, Anne Eva Margareta Håkansson, Randi Karlsen : A Proof-of-Concept Implementation Based on the Framework of AI-Enabled Proactive mHealth: Health Promotion with Motivation 2022 Vilde Benoni Gjærum, Anne Håkansson, Haakon Robinson, Aya Saad, Akhil Sadanandan Anand, Katrine Seel : The International Robust AI Workshop 2021 Anne Håkansson : Fastighetsägarens och fastighetsskötarens AI-vertyg 2021 Anne Håkansson : AI in Cyber-Physical Systems – when can fully autonomous CPS in Society be achieved? 2021 Anne Håkansson : AI in Cyber-Physical Systems: When Can Fully Autonomous CPS in Society Be Achieved? 2021 Anne Håkansson : AI in Cyber-Physical Systems: When Can Fully Autonomous CPS in Society be Achieved? 2021 Muhammad Sulaiman, Anne Håkansson, Randi Karlsen : AI-enabled proactive mHealth with automated decision-making 2021 Seshathiri Dhanasekaran, Anders Andersen, Randi Karlsen, Anne Håkansson : Data Analysis Techniques for Smart Nudging 2021 ARKIV Anne Håkansson : AI och smarta samhällen! 2020 Anne Håkansson : AI i det smarta samhället 2020 Anne Håkansson : AI - den nya personalstyrkan 2019 Anne Håkansson : AI - den nya personalstyrkan 2019 Anne Håkansson : Women in Tech 25. November 2019 Anne Håkansson : Mänskliga sinnen i artificiell intelligens. 2019 Anne Håkansson : Dra nytta av Artificiell Intelligens (AI) 2019 Anne Håkansson : En titt i spåkulan: Hur kan AI användas i industrin på tio års sikt? 2019 Anne Håkansson : Artificiell Intelligens och affärsjuridik – hur AI kan användas för att förbättra verksamheten 2019 Anne Håkansson : Artificiell Intelligens (AI) och hur påverkar det oss? 2019 Anne Håkansson : AI and Cyber-Physical Systems 2019 Anne Håkansson : AI i det smarta samhället 2019 Anne Håkansson : Artificiell Intelligens 2019 Anne Håkansson : Artificial Intelligence Now and near future - A look in the Crystal Ball 2019 Anne Håkansson : ARTIFICIELL INTELLIGENS – FÖRBANNELSE ELLER VÄLSIGNELSE? 2018 Anne Håkansson : AI och den digitala revolutionen 2018 The 50 latest publications is shown on this page. See all publications in Cristin here → Research interests Professor Anne Håkansson research lies within Computer science with the focus on Artificial Intelligence, and reasoning strategies, for different application areas, among others e-business, environmental impact assessment, and context. Especially, Håkansson has conducted research within Knowledge-based systems and Knowledge Base modelling, Reasoning, Graphic Representation, Visualisation, Visual Programming, Declarative Programming, Multi-agent systems, and Meta-agents. Currently Professor Håkansson conducts research within Cyber-Physcial Systems, Reasoning and Negotiation in Computer Systems, Sustainability and  Artificial Intelligence for combining senses. This includes Event-driven algorithm for searching in network, Smart cities and Smart sociteies Ontologies, and Contexts. Volatile Multiple Smart Systems, VoLM2s (for stationary and mobile systems, e.g. CPS, IoT): Next generation of smart systems – multiple connected systems that are only connected in some situations or for some purposes. Volatile – the situation decides the incorporated systems – data and information exchange is lost when systems are out of the communication sphere. Smart everywhere: Collaborations between different systems, everywhere; Co-operations to perform complex tasks Complex and situation-dependent data Generalize in heterogeneous environments The systems are a part of the Volatile Distributed Multi Smart Network. Teaching Introduction to Artificial Intelligence Degree projects Research and teaching Member of research group Open Distributed Systems (ODS) Computational Analytics and Intelligence (CAI) Member of project Better Balance in Informatics (BBI) Nudge Project CV Anne Håkansson is a professor of computer science with a focus on Artificial Intelligence, UiT The Arctic University of Norway. Professor Håkansson has more than 25 years of experience in the AI ​​field, giving her broad knowledge in AI areas. Her research interests lie in decision-making and strategies, and visualizing and explaining, particularly reasoning and negotiation with internal and external parts. She has worked with knowledge-based systems, KBS, meta-agents in multi-agent systems, MAS, and works with smart interactive cyber-physical systems, CPS, in transportation sector, Industry 4.0 and Smart Cities and Societies with automated smart products and services. Anne Håkansson is the chair of Computational Analytics and Intelligence (CAI) research group at UiT, Tromsö. She is the author and co-author of several books, proceedings and international publications and serves in technical program committees of international top conferences IJCAI and AAAI as well as general track chair for KES international conferences. She has been a frequent speaker for Artificial Intelligence and the future and has been an ambassador for Uppsala municipality, Sweden. Realfagbygget A142 Click for bigger map",
  "content_length": 8364,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:16"
}