{
  "name": "Anne S. Hsu",
  "homepage": "http://www.eecs.qmul.ac.uk/~ahsu",
  "status": "success",
  "content": "Web page of Anne Hsu Dr Anne Hsu Lecturer (Associate Professor)Risk and Information Management GroupSchool of Electronic Engineering and Computer Science Queen Mary University of London E-mail: anne.hsu at qmul.ac.uk Research interests My work combines computer science and psychology. My research includes machine learning, artificial agents, natural language processing and learning, human decision making, interaction design, and well being technology. My interests include developing interactive systems that use machine learning and understanding of human psychology to improve emotional wellbeing. My doctoral and postdoctoral research was in neuroscience. My PhD was awarded from the Department of Physics at UC Berkeley. You can learn more about our AI to support difficult conversations and improve emotional health here at Emotional Health Essentials Peer Reviewed Publications Hsu, A., Chaudhury, D. (2023). AI4PCR: Artificial intelligence for practicing conflict resolution. Computers in Human Behavior: Artificial Humans Krusche, A., Jack, C. D., Blunt, C., and Hsu, A. (2020) Mindfulness-based organisational education: an evaluation of a mindfulness course delivered to employees at the Royal Orthopaedic Hospital. Mindfulness Wilde, N., & Hsu, A. (2019). The influence of general self-efficacy on the interpretation of vicarious experience information within online learning. International Journal of Educational Technology in Higher Education, 16(1), 1-20. Wilde, N., & Hsu, A. (2019). The feasibility of a student-centred approach to the presentation of vicarious experience information within online learning. Research on Education and Media, 11(12), 3-18. Dewitt, S., Hsu, A., Lagnado, D., Desai, S.C., Fenton, N.E. (2019) Nested Sets and Natural Frequencies Proceedings of the 41st Annual Conference of the Cognitive Science Society (pdf) Hsu, A., Martin, J.B., Sanborn, A.N. et al. (2019). Identifying category representations for complex stimuli using discrete Markov chain Monte Carlo with people Behavior Research Methods (pdf) Silina, Y., & Hsu, A. (2018, July). Infusing meaning into social wearables: lessons from sentimental jewelry. In Proceedings of the 32nd International BCS Human Computer Interaction Conference (p. 72). Silina, Y., Apetroaia, A., & Hsu, A. (2018, July). Love is all you need: user preferences of strategies for mediating intimate relationships through technology. In Proceedings of the 32nd International BCS Human Computer Interaction Conference (p. 28). Griffiths, TL, Abbott, JT, and Hsu, A, (2016) Exploring human cognition using large image databases, Topics in Cognitive Science (pdf) Hsu, A., Griffiths, T.L., (2016) Sampling Assumptions Affect Use of Indirect Negative Evidence in Language Learning, PLOS ONE (pdf) Hsu, A, Horng, A, Griffiths, G, Chater, N, (2016) When absence of evidence is evidence of absence: Rational inferences from absent data Cognitive Science (pdf) Harris, A, Hsu, A, Madsen, J, Hahn, U., (2015) The Appeal to Expert Opinion: Quantitative support for a Bayesian Network Approach Cognitive Science (pdf) Hsu A, Vlaev, I, (2014) Monetary cost for time spent in everyday physical activities. Social Science and Medicine (pdf) Hsu A, Blandford, A, (2014) Designing for Psychological Change: Individuals' Reward and Cost Valuations in Weight Management. Journal of Medical Internet Research (pdf) Hsu A, Yang, J., Yilmaz, Y., Haque, Md., Cengiz, C., Blandford, A, (2014) Persuasive technology for overcoming food cravings and improving snack choices, Proceedings of CHI (pdf) Fenton, N. E., Neil, M., & Hsu, A. (2013). \"Calculating and understanding the value of any type of match evidence when there are potential testing errors\". Artificial Intelligence and Law (pdf) Fenton, N, Berger, D, Lagnado, D, Neil, M, Hsu, A. (2013) When 'neutral' evidence still has probative value (with implications from the Barry George Case) Science and Justice (pdf) Jabbar, Y., Majed, A., Hsu, A., Fairhurst, P., Vlaev, I., Reilly, P., & Emery, R. J. (2013). Decision making in proximal humeral fractures. Shoulder & Elbow,5(2), 78-83 Hsu A, Chater N, Vitányi P, (2013) Language learning from positive evidence, reconsidered: A simplicity-based approach Topics in Cognitive Science 5(1), 35-55(pdf) Harris A, Hsu A, M Koedsen J (2012) Because Hitler did it! Quantitative tests of Bayesian argumentation using Ad Hominem. Thinking and Reasoning 18(3), 311-343 (pdf) Hsu A, Chater N, Vitányi P, (2011) The probabilistic analysis of language acquisition: Theoretical, computational, and experimental analysis. Cognition 120, 380-390. (pdf) Hsu A., Griffiths, T. L., (2010) Effects of generative and discriminative learning on use of category variability. Proceedings of the 32nd Annual Conference of the Cognitive Science Society (pdf) Hsu A., Chater N., (2010) Probabilistic language acquisition: Theoretical, Computational and Experimental analysis. Proceedings of the 32nd Annual Conference of the Cognitive Science Society (pdf) Hsu A, Griffiths, TL, Schreiber, E., (2010) Subjective randomness and natural scene statistics. Psychonomic Bulletin & Review, 17, 624-629. (pdf) Hsu A, Chater N, (2010) The logical problem of language acquisition goes probabilistic: No negative evidence as a window on language acquisition. Cognitive Science, 34:972-1016. (pdf) Chamorro-Premuzic T, Burke C, Hsu A, Swami V. (2010) Personality predictors of artistic preferences as a function of the emotional valence and perceived complexity of paintings. Psychology of Aesthetics, Creativity and the Arts, 4, 196-204. Hsu A, Griffiths T, (2009) Differential Use of Implicit Negative Evidence in Generative and Discriminative Language Learning. Advances in Neural Information Processing Systems 22 (pdf) Chamorro-Premuzic T, Reimers S, Hsu A, Ahmetoglu G. (2008) Who Art Thou? Personality predictors of artistic preferences in a large UK sample: the importance of Openness. British Journal of Psychology, 100:501-516. (pdf) Schwartz O, Hsu A, Dayan P (2007) Space and time in visual context. Nature Reviews Neuroscience. 8: 522-535. (pdf) Hsu A, Dayan P (2007) An unsupervised learning model of neural plasticity: Orientation-selectivity in goggle-reared kittens. Vision Research 47(22): 2868-2877. (pdf) Woolley, S., Fremouw T., Hsu, A. and Theunissen FE (2005) Tuning for Spectro-temporal Modulations: a Mechanism for Auditory Discrimination of Natural Sounds. Nature Neuroscience 8(10): 1371-9. (pdf) Hsu A, Woolley SMN, Fremouw T, Theunissen FE (2004) Modulation power and phase spectrum of natural sounds enhance neural encoding performed by single auditory neurons. J. Neurosci 24: 9201-9211. (pdf) Hsu A, Borst A, Theunissen FE (2004) Quantifying variability in neural responses and its application for the validation of model predictions. Network: Comp Neural Syst 15: 91 - 109. (pdf) Theunissen FE, Woolley SM, Hsu A and Fremouw T (2004). Methods for the analysis of auditory processing in the brain. In Behavioral Neurobiology of Birdsong. P. Zeigler P. and Marler P Eds. Ann NY Acad Sci. 1016: 187-207. Theunissen FE, David SV, Singh NC, Hsu A, Vinje W, Gallant JL (2001) Estimating spatio-temporal receptive fields of auditory and visual neurons from their responses to natural stimuli. Network: Comp Neural Syst 12:1-28. (pdf) Book Chapters Chamorro-Premuzic, Kallias, & Hsu (2013) Personality as Predictor of Movie Uses and Preferences: A Psychographic Approach. The Social Science of Cinema. Kaufman, J., & Simonton, D.K. Eds. Theunissen FE, Woolley SM, Hsu A and Fremouw T (2004). Methods for the analysis of auditory processing in the brain. Behavioral Neurobiology of Birdsong. P. Zeigler P. and Marler P Eds. Ann NY Acad Sci. 1016: 187-207. Grants 2014-2018: Bayes Knowledge, ERC-2013-AdG339182-BAYES_KNOWLEDGE, co-I (1,572,562 euros) 2011: Discriminative vs. generative machine and human learning, PASCAL pump priming, PI 2009-2010: When something is missing: can absence of evidence be evidence of absence?, ESRC Reference: RES-000-22-3275, PI 2008-2009: The learnability of linguistic irregularities: A simplicity-based approach, ESRC ESRC Reference: RES-000-22-2768, co-PI rapporteurs report grade: Outstanding, top grade 2007: Wellcome Trust Value in People Award",
  "content_length": 8235,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:20"
}