{
  "name": "Annette Bieniusa",
  "homepage": "https://softech.informatik.uni-kl.de/team/annettebieniusa",
  "status": "success",
  "content": "Annette Bieniusa - TU Kaiserslautern HauptnavigationInhalt Lehrstuhl Softwaretechnik RPTU/Koziel I am interested in the semantics of concurrent and distributed programming, focusing on (geo-)replication, synchronization, and programming languages.My research targets programming models that use relaxed memory semantics, where updates to the shared state are visible only eventually to other processes. Such models enable optimistic execution of computations with minimal synchronization overhead while still being able to construct programs with provably correct behavior.I am also working on topics related to the development of correct and highly scalable programs in concurrent and distributed systems, such as Software Transactional Memory (STM) and Convergent Replicated Datatypes (CRDTs). In this effort, I am leading the development of AntidoteDB, a planet-scale, highly available, transactional CRDT database.Anschrift RPTU in Kaiserslautern Gebäude: 32, Raum: 426 67663 Kaiserslautern Postfach: 3049 67653 Kaiserslautern Kontakt+49 631 205 3958+49 631 205 12 3341annette.bieniusa@cs.rptu.deSprechstunde Mittwoch 13:00 - 14:00 Uhr Nur nach Terminvereinbarung! Only with Appointment!Antidote: Highly-available transactional data store featuring geo-replication, CRDTs and transactional causal+ consistency (since 2013 leading developer and project manager)ArrowTasks: Declarative Workflow Programming. Draft paperOutreach Program for local schools and kindergardens: https://schule.cs.uni-kl.deResearch Training Group “weacon” (May 2014 - May 2015): The members of the research training group investigate (weak) notions of consistency in concurrent and distributed systems.ConcoRDanT: Replicated date types for consistency without concurrency control in Cloud and Peer-to-Peer systems (funded by ANR, 2010–2013)J-Cell: Scalable and robust distributed run-time environments for clusters of heterogeneous many-core processors (funded by BMBF, 2009–2011)GeNIUS: Gelingensbedingungen für den Naturwissenschaftlich-Informatischen Unterricht in Schulen (BMBF, 2023-25)Lightkone: Synchronization-free programming for edge networks (EU Horizon 2020, 2017-2019)SyncFree (EU FP7-Strep, 2013-2016)Carl-Zeiss-Doktoranden-Programm, Projekt “Architecture-aware Verification” (with Prof. Roland Meyer, TU Braunschweig)Nachwuchsring TU Kaiserslautern Amazon AWS in EducationExpert Panel ``Programming Languages'' on IEEE Computer Society, ACM and AAAI ``CS202X Curriculum Report: Curriculum Guidelines for Undergraduate Programs in Computer ScienceProgram Manager for the PhD Program of the Department of Computer Science, TU Kaiserslautern (since 2012)Member of the Faculty Board in CS (since 2018)Member of the Board for Studies and Teaching (since 2011)Member of the Forum Wissenschaftlicher Mitarbeiter at TU Kaiserslautern (2018-2022)Scientific advisory board for BOBKonfProgram Chair for Erlang Workshop’20 (with Viktoria Fördös) and Erlang Workshop'21 (with Stavros Aronis)Program Chair for PaPoc’17 (with Alexey Gotsman)Program committees: WTTM’12, TRANSACT’13, EuroSys’13 (Shadow Program committee), ICDCS’14, TRANSACT’15, BOB’15, DCC’15, CloudCom’15, BOB’16, DCC’16, PMLDC’16, W-PSDS’16, CloudCom’16, ICDCN’17, InfoComm’17, BOB’17, Mobilware’17, CloudCom’17, Eurosys’18, Netys’18, BOB’18, PPDP’18, BOB’19, FORTE’19, Erlang Workshop’19, SummerBOB’19, W-PSDS at SRDS’19, Middelware’20, POPL'20, CCGrid'21, USENIX ATC'21, ECOOP'22, OOPSLA'22, OSDI'22, USENIX ATC'22, PLF'22, PADL'23, ESOP'23, OOPSLA'23, PaPoC'23, PLF'23, USENIX ATC'23, Eurosys'24, PaPoC'24, ASPLOS'24, Erlang Workshop'24, FUNARCH'24Reviews for Journal of Distributed and Parallel Computing (JDPC), ACM Transactions on Parallel Computing (TOPC), ACM Transactions on Programming Languages and Systems (TOPLAS), JFP (Journal of Functional Programming), Journal of Logical and Algebraic Methods in Programming (JLAMP), Computer Networks (COMNET)Local organization of ICFP 2007 and IFL 2007 in Freiburg and of the ACM Europe Chapter Workshop 2012 in Paris",
  "content_length": 4017,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:23"
}