{
  "name": "Anne Benoit",
  "homepage": "http://graal.ens-lyon.fr/~abenoit/anne.benoit",
  "status": "success",
  "content": "Anne Benoit - Homepage Anne Benoit Who am I? Research Teaching Links Who am I? Full professor, ENS Lyon, LIP laboratory, ROMA project Visiting Research Scholar at IDEaS, Georgia Tech, USA (2025) Mercator Fellow for the Collaborative Research Center FONDA, Berlin, Germany (2024-2028) Senior member of the Institut Universitaire de France (IUF) since 2023 Senior member of the IEEE, and IEEE Computer Society Golden Core Member Chair of IEEE TCPP, the IEEE Technical Committee on Parallel Processing (2020-2024) Visiting Associate Professor at CSE, Georgia Tech, USA (2017-2018) Junior member of the Institut Universitaire de France (IUF) from 2009 to 2014 Defended my habilitation on July 8, 2009: see my thesis and my slides. Brief curriculum vitae (2024): in english. Contact: Laboratoire de l'Informatique du Parallélisme UMR CNRS -- ENS Lyon -- INRIA 5668 Ecole Normale Supérieure de Lyon 46, allée d'Italie, 69364 Lyon Cedex 07, France E-mail: Anne.Benoit at ens-lyon.fr Office: GN1.374N Full Professor at ENS Lyon (September 1st, 2025). Editor-in-Chief of ParCo, the journal of Parallel Computing: Systems and Applications. See my editorial. Senior IUF member 2023 (Fondamental chair, on parallel algorithms). Article sur le site de l'INS2I, octobre 2023. Research List of publications | Recent slides. PhD Students: Adrien Obrecht (1st year), co-supervising with Loris Marchal. Dominik Schweisgut (2nd year), co-supervising with Henning Meyerhenke (Humboldt-Universitat zu Berlin and Karlsruhe Institute of Technology, Germany). Joachim Cendrier (3rd year), co-supervising with Frederic Vivien. Svetlana Kulagina (4th year), co-supervising with Henning Meyerhenke (Humboldt-Universitat zu Berlin, Germany). Redouane Elghazi (defended October 9, 2023), co-supervising with Louis-Claude Canon and Pierre-Cyrille Héam (FEMTO-ST, Besancon). Lucas Perotin (defended June 29, 2023), co-supervising with Yves Robert. Valentin Le Fèvre (defended June 18, 2020), co-supervising with Yves Robert. Changjiang Gou (defended September 25, 2020), co-supervising with Loris Marchal. In co-tutelle with East China Normal University (Mingsong Chen). Loic Pottier (defended September 18, 2018), co-supervising with Yves Robert. Issam Rais (defended September 28, 2018), co-supervising with Laurent Lefèvre and Anne-Cécile Orgerie. Aurélien Cavelan (defended July 7, 2017), co-supervising with Yves Robert. Guillaume Aupy (defended September 16, 2014), co-supervising with Yves Robert. Paul Renaud-Goud (defended July 5, 2012), co-supervising with Yves Robert. Fanny Dufossé (defended September 6, 2011), co-supervising with Yves Robert. Veronika Rehn-Sonigo (defended July 7, 2009), co-supervising with Yves Robert. Principal Investigator of the Keystone Associate Team (2016-2018) on scheduling algorithms for sparse linear algebra at extreme scale. Editor-in-Chief of ParCo, the journal of Parallel Computing: Systems and Applications (2024-Present). See my editorial. Member of the Editorial Board (Associate Editor) of ACM TOPC (Transactions on Parallel Computing) (2024-2026). Associate Editor in Chief of JPDC, the Journal of Parallel and Distributed Computing (2022-2023). Associate Editor (in Chief) of ParCo, the journal of Parallel Computing: Systems and Applications (2018-2023). Member of the Editorial Board (Associate Editor) of TPDS, IEEE Transactions on Parallel and Distributed Systems (2015-2019). Member of the Editorial Board (Associate Editor) of JPDC, the Journal of Parallel and Distributed Computing (2011-2018). Member of the Editorial Board (Associate Editor) of SUSCOM, the Journal of Sustainable Computing (2013-2017). PC chair of ESA 2025, Track B (part of ALGO 2025), Warsaw, Poland, Sep 15-19, 2025. Co-chair for Track 2: \"Scheduling, Resource Management, Cloud, Edge Computing, and Workflows\" of the 30th Int. European Conf. on Parallel and Distributed Computing (EuroPar 2024), Madrid, Spain, August 26-30, 2024. Program area co-chair (parallel and distributed algorithms for computational science) of IPDPS'2023. Member of the organizing committee of SIAM ACDA 2023. Chair of the Graduate Student Research Competition (SRC) Posters at SC'2022. General co-chair of IPDPS'2022, Lyon, France, May 30 - June 3, 2022. Poster chair of ICPP'2021, Chicago, Illinois, August 2021. Track chair for HPC Algorithms track of ISC High Performance 2020, Frankfurt, Germany, June 21-25, 2020. Global chair for topic 3: \"Scheduling and Load Balancing\" of the 24th Int. European Conf. on Parallel and Distributed Computing (EuroPar 2018), Torino, Italy, August 27-31, 2018. Program chair of the 32nd IEEE International Parallel and Distributed Processing Symposium (IPDPS 2018), Vancouver, Canada, May 21-25, 2018. Technical papers co-chair for the International Conference for High Performance Computing, Networking, Storage and Analysis (SC 2017), Denver, USA, November 12-17, 2017. Program co-chair of the 46th Int. Conf. on Parallel Processing (ICPP 2017), Bristol, UK, August 14-17, 2017. Program chair of the 23rd IEEE International Conference on High Performance Computing, Data, and Analytics (HiPC 2016), Hyderabad, India, December 19-22, 2016. Program chair for the Algorithms area of the International Conference for High Performance Computing, Networking, Storage and Analysis (SC 2016), Salt Lake City, USA, November 13-18, 2016. Workshops co-chair of the 45th Int. Conf. on Parallel Processing (ICPP 2016), Philadelphia, USA, August 16-19, 2016. Program vice-chair for the Algorithms track of the 22nd IEEE International Conference on High Performance Computing (HiPC 2015), Bangalore, India, December 16-19, 2015. Program vice-chair for the Applications and Algorithms track of the 27th International Symposium on Computer Architecture and High Performance Computing (SBAC-PAD 2015), Florianopolis, Brazil, October 18-21, 2015. Workshops co-chair of the 44th Int. Conf. on Parallel Processing (ICPP 2015), Beijing, China, September 1-4, 2015. Workshops co-chair of the 43rd Int. Conf. on Parallel Processing (ICPP 2014), Minneapolis, MN, USA, September 9-12, 2014. Program vice-chair for the Algorithms track of the 28th IEEE International Parallel & Distributed Processing Symposium (IPDPS 2014), Phoenix, Arizona, USA, May 2014. Member of the organizing committee of the 13th forum for young mathematicians (forum des jeunes mathématicien-ne-s), Lyon, France, November 13-15, 2013. Workshops co-chair of the 42nd Int. Conf. on Parallel Processing (ICPP 2013), Lyon, France, October 1-4, 2013. Program vice co-chair of the IEEE Cluster 2012 Conference, in \"Applications and Algorithms\", Beijing, China, September 2012. Program vice chair of the 26th IEEE Int. Conf. on Advanced Information Networking and Applications (AINA 2012), for Track 5: \"Distributed and Parallel Systems\", Fukuoka, Japan, March 2012. Member of the organizing committee of the SIAM Conf. on Parallel Processing for Scientific Computing (PP 2012), Savannah, USA, February 2012. Program chair of the 19th Int. Heterogeneity in Computing Workshop (HCW 2010); General chair of HCW 2011 (in conjunction with IPDPS). Member of the organizing committee of the \"Scheduling for large-scale systems\" workshop in Knoxville, May 2009. Co-chair and co-organizer of the int. workshops on Practical Aspects of high-level Parallel Programming PAPP 2010, PAPP 2009, PAPP 2008, PAPP 2007, and PAPP 2006 (in conjunction with ICCS). Program committee member: IPDPS (2026-2021-2020-2019-2016-2014-2013-2012-2011-2010-2008), SuperComputing (2023-2022-2021-2019-2016-2015), Euro-Par (2025-2023), Alenex (2025), SIAM ACDA (2023), PPAM (2024-2022), IEEE BigData (2024), COMPAS (2021-2019), SuperCheck (2021), ESA (2019), HCW (2016-2015-2014-2013), Ena-HPC (2016-2015-2014), CCGrid (2015-2014-2013-2012), FEEDBACK (2015), PDP 2014, ICPP (2025-2013), IGCC 2013, ICPE 2013, CLOSER 2013, HiPC (2013-2011-2010), HPDC 2012, SPAA 2011, HLPP 2010, APDCM 2010, ICCS (2010-2009-2008-2007-2006-2005), TCPP PhD Forum 2009, ISCIS 2009, ISPDC 2009, HPCC 2009, SBAC-PAD 2008. Older information on my old homepage in Edinburgh. Teaching 2023-2026: Cours M1 \"Parallel and Distributed Algorithms and Programs\". 2022-2023: Directrice du département informatique de l'ENS de Lyon; Cours M1 \"Parallel and Distributed Algorithms and Programs\"; Cours L3 \"Algo 2 (Algorithmique avancée)\". 2018-2022: Responsable des L3; M1 course: Parallel and Distributed Algorithms and Programs; Cours L3: Algo 2 (Algorithmique avancée). 2017-2018: Algorithms course CSE-6140 (Georgia Tech). 2016-2017: Responsible of the M2; M2 course: CR02 (Resilient and energy-aware scheduling algorithms); Cours Algo2 (Algorithmique avancée) en L3. 2015-2016: Responsible of the M2; M2 course: CR02 (Resilient and energy-aware scheduling algorithms); Cours Algo2 (Algorithmique avancée) en L3. 2014-2015: Cours Algo 2 (Algorithmique avancée) en L3; Cours ASR 2 (Systčmes et réseaux) en L3. 2013-2014: Cours ASR 2 (Systčmes et réseaux) en L3. 2012-2013: Cours ASR 2 (Systčmes et réseaux) en L3. 2010-2012: No teaching (due to my IUF status). 2009-2010: Responsable des L3 (rčglement du L3 info et annexe sur la filičre math-info); Cours Algorithmique 1 en L3; Cours Algorithmique parallčle en M1; La page des stages L3, gérés par Clément Rezvoy. 2008-2009: Responsable des L3; Cours Algorithmique 1 en L3; Cours Algorithmique parallčle en M1; La page des stages L3, gérés par Colin Riba. 2007-2008: Responsable des L3; Cours Algorithmique 1 en L3; Cours Algorithmique parallčle en M1; La page des stages L3, gérés par Sébastien Briais. 2006-2007: Responsable des L3 et des stages L3; Cours Algorithmique 1 en L3; Cours Algorithmique des réseaux et des télécommunications en M1. 2005-2006: Les séminaires du MIM; TD d'algorithmique en L3; Cours algorithmique des réseaux et des télécommunications en M1. 2000-2005: Mes activités d'enseignement passées. Personal links Music: CinqRhone wind quintet, OSYRA symphonic orchestra, MAGYC brass quintet, harmonie d'Eybens (wind band) Family:",
  "content_length": 10207,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:09"
}