{
  "name": "Anne Roudaut",
  "homepage": "https://anneroudaut.fr",
  "status": "success",
  "content": "Anne Roudaut Anne RoudautProfessor of Human computer interactionroudauta(at)gmail(dot)com Publications Short resume I am Professor of Human-Computer Interaction and head of the Bristol Interaction Group in the Computer Science Department at the University of Bristol (UK). My research is rooted within Human Computer Interaction although I am working toward creating synergies with Material Engineering and Soft Robotics. I believe that the static shape of computers is the bottleneck of today’s interactive systems. We need shape-changing computers that are malleable and reconfigure into any shapes and provide affordances that unleash users interactive potential. However, despite tremendous breakthroughs in advanced materials, their implementation is far off because we don’t understand how to support interactions with them. My goal is to help designers create the best possible interfaces and devices we will soon have in our hands. Understanding shape-changing interfaces Investigating how shape-changing interfaces can change applications for non-rectangular and dynamic displays, delving into both their practical applications and the psychological aspects of interacting with varied shapes. Exploring morphing / sensing / display materialsInvestigating various materials for crafting soft-morphing substances on both small and large scales, alongside strategies for embedding sensing capabilities within them. Also delving into innovative methods for making displays via programmable inks.Empowering end-users via personnal fabricationStriving to democratize this knowledge in order to empower individuals to fabricate their interactive devices more easily through accessible platforms and equipment.STAFFS PHDsjack burnettellen weirjed preistwenda zhaoimmi biswaskaren lirichard grafton (alumni)eszter vigh (alumni)ollie hanton (alumni)daniel bennett (alumni)lulwah al-barrack (alumni)gareth barnaby (alumni)rachel eardley (alumni)hyunyoung kim (alumni)themis omirou (alumni)tom carter (alumni)PDRAsDan BaioccoMuhamman yasir Khan (alumni)ALUNA EVERITT (alumni)josh tailor (alumni)jenna shapiro (alumni)jingqi liu (alumni)isabel quamar (alumni)",
  "content_length": 2159,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:18"
}