{
  "name": "Anne Lauscher",
  "homepage": "https://anne-lauscher.de",
  "status": "success",
  "content": "Anne Lauscher - Associate Professor of Data Science - Conversational AI · Computational Argumentation · Ethical AI · Transfer Learning Associate Professor of Data Science Anne Lauscher (ˈanə ˈlaʊ̯ʃɐ, she/her) is Associate Professor of Data Science at the University of Hamburg, where her research group investigates Conversational Artificial Intelligence (AI) systems with a focus on fair, inclusive, and sustainable communication. The professorship is funded by the Excellence Initiative of the German federation and the federal states. Before, she was a Postdoctoral Researcher in the Natural Language Processing group at Bocconi University (Milan, Italy) where she was working on introducing demographic factors into language processing systems with the aim of improving algorithmic performance and system fairness. She obtained her Ph.D., awarded with the highest honors (summa cum laude), from the Data and Web Science group at the University of Mannheim (Germany), where her research focused on the interplay between language representations and computational argumentation. During her studies, she conducted research internships at and became an independent research contractor for Grammarly Inc. (New York City, U.S.) and for the Allen Institute for Artificial Intelligence (Seattle, U.S.). Her research gets regularly published at international top-tier Natural Language Processing (e.g., ACL, EMNLP, etc.) and Artificial Intelligence (e.g., AAAI) venues and has been recognized with multiple awards. For instance, in 2021, Anne received the Maria Gräfin von Linden-Award in life sciences/ STEM, which honors outstanding female researchers in the German State of Baden-Württemberg, and in 2022, she was nominated for the Dissertation Award of the German Informatics Society and named as one of the \"100 Brilliant Women in AI Ethics for 2023\". Conversational AI · Computational Argumentation · Ethical AI · Transfer Learning Tweets by anne_lauscher Selected Publications Anne regularly publishes in international top-tier Artificial Intelligence (e.g., AAAI) and Natural Language Processing (e.g., ACL, EMNLP) venues. Some examples are listed here. A full list of her publications can be found on Google Scholar. Briding Fairness and Environmental Sustainability in Natural Language Processing Marius Hessenthaler, Emma Strubell, Dirk Hovy, Anne Lauscher In Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP, A), pages tba, Abu Dhabi, UAE. Association for Computational Linguistics. Paper Fair and Argumentative Language Modeling for Computational Argumentation Carolin Holtermann, Anne Lauscher, Simone Paolo Ponzetto In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (ACL, A*), pages 7841–7861, Dublin, Ireland. Association for Computational Linguistics. Paper RedditBias: A Real-World Resource for Bias Evaluation and Debiasing of Conversational Language Models Soumya Barikeri, Anne Lauscher, Ivan Vulić, Goran Glavaš Proceedings of the Joint Conference of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (ACL-IJCNLP, A*), pages 1941--1955, Online, August 2021, Association for Computational Linguistics Paper Specializing unsupervised pretraining models for word-level semantic similarity Anne Lauscher, Ivan Vulić, Edoardo Maria Ponti, Anna Korhonen, and Goran Glavaš Proceedings of the 28th International Conference on Computational Linguistics (COLING, A), December 2020, pages 1371--1383, Barcelona, Spain (Online), International Committee on Computational Linguistics. Paper Rhetoric, Logic, and Dialectic: Advancing Theory-based Argument Quality Assessment in Natural Language Processing Anne Lauscher, Lily Ng, Courtney Napoles, and Joel Tetreault Proceedings of the 28th International Conference on Computational Linguistics (COLING, A), pages 4563–-4574, Barcelona, Spain (Online), December 2020, International Committee on Computational Linguistics Paper From Zero to Hero: On the limitations of zero-shot cross-lingual transfer with multilingual transformers Anne Lauscher, Vinit Ravishankar, Ivan Vulić, and Goran Glavaš Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP, A), pages 4483--4499, Online, November 2020, Association for Computational Linguistics Paper A general framework for implicit and explicit debiasing of distributional word vector spaces Anne Lauscher, Goran Glavaš, Simone Paolo Ponzetto, and Ivan Vulić Proceedings of the Thirty-Fourth AAAI Conference on Artificial Intelligence (AAAI, A*), pages 8131--8138, New York, New York, January 2020, AAAI Press Paper Investigating the role of argumentation in the rhetorical analysis of scientific publications with neural multi-task learning models Anne Lauscher, Goran Glavaš, Simone Paolo Ponzetto, and Kai Eckert Proceedings of the 2018 Conference on Empirical Methods in Natural Language Processing (EMNLP, A), pages 3326--3338, Brussels, Belgium, October-November 2018, Association for Computational Linguistics Paper News Recognition December 2022 Anne is named as one of the \"100 Brilliant Women in AI Ethics for 2023\"! Paper Acceptance October 2022 One paper accepted at Transactions of ACL! Key Note Talk October 2022 Anne is giving a key note at the Digital Workshop \"Reflection on intelligent systems: towards a cross-disciplinary definition\" Paper Acceptance October 2022 Two papers to appear at EMNLP 2022! Position Update!!! October 2022 Appointment as Professor of Data Science at the University of Hamburg! Paper Acceptance September 2022 One paper (\"Scientia Potentia Est: On the Role of Knowledge in Computational Argumentation\") accepted to TACL. Paper Acceptance September 2022 One paper accepted at COLING 2022. COLING 2022 Paper Acceptance July 2022 Paper on AI and Discrimination accepted for publication in the German law journal \"Zeitschrift für Digitalisierung und Recht\" Workshop July 2022 Together with Professor Sarah Legner, Anne is hosting a workshop on AI and Discrimination. Action Editor June 2022 Anne is now serving as Action Editor for the ACL Rolling Review! Area Chair Invitation May 2022 Invitation to serve as an Area Chair for the Resource and Evaluation track of AACL-IJCNLP 2022 AACL-IJCNLP 2022 Invited Talk May 2022 Invited talk at the German Society for Computational Linguistics GSCL Talk Description Paper Acceptance April 2022 Two papers accepted at the NAACL main conference! Invited Talk April 2022 Invited talk at the Women in Data Science Conference in Mannheim WiDS Program Award Nomination March 2022 Nomination for the Disseration Award 2022 of the German Informatics Society by the University of Mannheim Award Information Paper Acceptance March 2022 One paper accepted at the ACL main conference and one paper at the ACL findings Preprint 1 Invited Talk January 2022 Invited talk in the Colloquium for Computational Linguistics and Linguistics at the Institute for Natural Language Processing Stuttgart Colloquium Info Award November 2021 Anne receives the Maria Gräfin von Linden-Award in life sciences/ STEM, which honors excellent female researchers with outstanding didactic skills in the German state of Baden-Württemberg Award Information Position Update September 2021 Anne starts as a Postdoctoral Research Fellow in the Natural Language Processing Lab of Professor Dirk Hovy at the Bocconi University in Milan (Italy) Ph.D. Defense September 2021 Anne successfully defends her Ph.D. thesis \"Language Representations for Computational Argumentation\" with the highest honors (summa cum laude)! Impressum Angaben gemäß § 5 TMG Anne Lauscher Simon-von-Utrecht-Str. 90 20359 Hamburg Vertreten durch: Anne Lauscher Kontakt: Telefon: 0049-17684334486 E-Mail: anne-lauscher@web.de Verantwortlich für den Inhalt nach § 55 Abs. 2 RStV: Anne Lauscher Simon-von-Utrecht-Str. 90 20359 Hamburg Haftungsausschluss: Haftung für Inhalte Die Inhalte unserer Seiten wurden mit größter Sorgfalt erstellt. Für die Richtigkeit, Vollständigkeit und Aktualität der Inhalte können wir jedoch keine Gewähr übernehmen. Als Diensteanbieter sind wir gemäß § 7 Abs.1 TMG für eigene Inhalte auf diesen Seiten nach den allgemeinen Gesetzen verantwortlich. Nach §§ 8 bis 10 TMG sind wir als Diensteanbieter jedoch nicht verpflichtet, übermittelte oder gespeicherte fremde Informationen zu überwachen oder nach Umständen zu forschen, die auf eine rechtswidrige Tätigkeit hinweisen. Verpflichtungen zur Entfernung oder Sperrung der Nutzung von Informationen nach den allgemeinen Gesetzen bleiben hiervon unberührt. Eine diesbezügliche Haftung ist jedoch erst ab dem Zeitpunkt der Kenntnis einer konkreten Rechtsverletzung möglich. Bei Bekanntwerden von entsprechenden Rechtsverletzungen werden wir diese Inhalte umgehend entfernen.Haftung für Links Unser Angebot enthält Links zu externen Webseiten Dritter, auf deren Inhalte wir keinen Einfluss haben. Deshalb können wir für diese fremden Inhalte auch keine Gewähr übernehmen. Für die Inhalte der verlinkten Seiten ist stets der jeweilige Anbieter oder Betreiber der Seiten verantwortlich. Die verlinkten Seiten wurden zum Zeitpunkt der Verlinkung auf mögliche Rechtsverstöße überprüft. Rechtswidrige Inhalte waren zum Zeitpunkt der Verlinkung nicht erkennbar. Eine permanente inhaltliche Kontrolle der verlinkten Seiten ist jedoch ohne konkrete Anhaltspunkte einer Rechtsverletzung nicht zumutbar. Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Links umgehend entfernen.Urheberrecht Die durch die Seitenbetreiber erstellten Inhalte und Werke auf diesen Seiten unterliegen dem deutschen Urheberrecht. Die Vervielfältigung, Bearbeitung, Verbreitung und jede Art der Verwertung außerhalb der Grenzen des Urheberrechtes bedürfen der schriftlichen Zustimmung des jeweiligen Autors bzw. Erstellers. Downloads und ",
  "content_length": 14963,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:16"
}