{
  "name": "Annibale Panichella",
  "homepage": "https://apanichella.github.io",
  "status": "success",
  "content": "Annibale Panichella Search Annibale Panichella Associate Professor Delft University of Technology Biography I am an Associate Professor in the Software Engineering Research Group (SERG) at Delft University of Technology (TU Delft) in the Netherlands. Within SERG, I lead the Computation Intelligence for Software Engineering Lab (CISELab), where my research focuses on advancing the fields of software testing, search-based software engineering, software testing for AI, and empirical software engineering. I serve as the track lead for “Testing for and with AI” at the AI4SE, TU Delft’s tenth ICAI lab, funded by JetBrains, a global leader in intelligent software development tools. Additionally, I am the principal investigator for the UBRI program at TU Delft, a pioneering joint initiative with Ripple, a leader in the Blockchain sector. My research has also been funded by the European Commission under the H2020 program, focusing on test amplification (STAMP) and testing for cyber-physical systems (COSMOS). With over 100 peer-reviewed publications in top-tier journals and conferences in software engineering and evolutionary computation, I have had the opportunity to contribute to the SE field. I am grateful to have received the Most Influential Paper Award at SANER (2024) and several Best Paper Awards at ICPC, SBFT, and SSBSE. In addition to my research contributions, I actively contribute to the academic community by serving as a program committee member for prestigious international conferences such as ICSE, ESEC/FSE, ASE, ISSTA, GECCO, and ICST, and as a reviewer for leading journals including TSE, TOSEM, TEVC, EMSE, and STVR. Interests Computational Intelligence for Software Engineering Test Case Generation and Fuzzing Software Testing for AI Validation of Generative AI Security Testing Regression Testing Empirical Software Engineering Evolutionary Computation Education PhD in Software Engineering, 2014 University of Salerno Experience Scientific Developer Fondazione Bruno Kessler - Security & Trust January 2014 – December 2014 Trento, Italy Post-doc Delft University of Technology January 2015 – September 2016 Delft, The Netherlands Research Associate Interdisciplinary Centre for Security, Reliability and Trust (SnT) - University of Luxembourg October 2016 – February 2018 Luxembourg Research Fellow Interdisciplinary Centre for Security, Reliability and Trust (SnT) - University of Luxembourg February 2018 – December 2020 Luxembourg Assistant Professor Delft University of Technology March 2018 – December 2022 Delft, The Netherlands Associate Professor Delft University of Technology January 2023 – Present Delft, The Netherlands Projects * All European Projects Indutry Projects AI for Fintech Research AI for Fintech Research (AFR) is a five year collaboration between ING and Delft University of Technology. The mission of AFR is to perform world-class research at the intersection of Artificial Intelligence, Data Analytics, and Software Analytics in the context of FinTech. AFR was launched in 2020. AI4SE Collaboration The emergence of advanced AI-driven tools has led to a wide range of opportunities and transformations in software engineering practices and education. Recognizing this potential, JetBrains and Delft University of Technology have collaborated to establish the AI for Software Engineering Lab (AI4SE). Together, we are committed to conducting cutting-edge research on the impact and utilization of AI methodologies in software engineering. Our areas of focus include diverse facets of the domain, such as software development, testing, and programming education. DevOps for Complex Cyber-physical Systems Emerging Cyber-Physical Systems (CPS)—from robotics, transportation, to medical devices—play a crucial role in the quality of life of European citizens and the future of the European economy. Increasing automation to such an extent, however, gives rise to many challenges, at the crux of which lies the hardware and software symbiosis. COSMOS proposes to overcome the strain on developing and evolving high-quality, dependable CPS by employing two key technologies, namely DevOps and Artificial Intelligence (AI). These technologies offer the potential to address CPS development, verification, and evolution. STAMP: Software Testing Amplification for DevOps STAMP stands for Software Testing AMPlification. Leveraging advanced research in automatic test generation, STAMP aims at pushing automation in DevOps one step further through innovative methods of test amplification. STAMP will reuse existing assets (test cases, API descriptions, dependency models), in order to generate more test cases and test configurations each time the application is updated. UBRI: University Blockchain Research Initiative UBRI is a partnership between Ripple and top universities around the world to support academic research, technical development and innovation in blockchain, cryptocurrency and , digital payments. Ripple is providing both financial and technical resources to university partners and collaborates with faculty and students on research and technical projects. Recent Publications Quickly discover relevant content by filtering publications. Ali Asgari, Milan de Koning, Pouria Derakhshanfar, Annibale Panichella (2025). Metamorphic Testing of Deep Code Models: A Systematic Literature Review. ACM Transaction on Software Engineering and Methodology (TOSEM 2025). Preprint Antony Bartlett, Cynthia Liem, Annibale Panichella (2025). The Last Dependency Crusade: Solving Python Dependency Conflicts with LLMs. The 1st International Workshop on Agentic Software Engineering (AgenticSE). Antony Bartlett, Cynthia Liem, Annibale Panichella (2025). The Pursuit of Diversity: Multi-Objective Testing of Deep Reinforcement Learning Agents. 17th Symposium on Search-Based Software Engineering (SSBSE 2025). Antony Bartlett, Cynthia Liem, Annibale Panichella (2025). DRVN at the ICST 2025 Tool Competition – Self-Driving Car Testing Track. The 18th IEEE International Conference on Software Testing, Verification and Validation (ICST 2025). Preprint Wishaal Kanhai, Ivar van Loon, Yuraj Mangalgi, Thijs van der Valk, Lucas Witte, Annibale Panichella, Mitchell Olsthoorn, Burcu Ozkan (2025). Rocket: A System-Level Fuzz-Testing Framework for the XRPL Consensus Algorithm. The 18th IEEE International Conference on Software Testing, Verification and Validation (ICST 2025). Preprint PDF Video See all publications Recent & Upcoming Talks Do Tests Generated by AI Help Developers? Open Challenges, Applications, and Opportunities Mar 18, 2022 11:17 AM Virtual Slides What Are We Really Testing in Mutation Testing for Machine Learning? A Critical Reflection May 27, 2021 11:17 AM Virtual Revisiting test smells in automatically generated tests: limitations, pitfalls, and opportunities Sep 27, 2020 11:17 AM Virtual Video Automated Repair of Feature Interaction Failures in Automated Driving Systems Jul 18, 2020 11:17 AM Virtual Slides Video Automated Test Generation for Unit Testing Beyond Oct 28, 2019 11:17 AM Hotel De Wageningsche Berg, Wageningen Slides See all events Popular Topics Code Smell Crash Replication Debugging Deep Learning Empirical Software Engineering Evolutionary Computation Evolutionary Testing EvoSuite Fuzzing Information Retrieval Machine Learning Many-objective Optimization Meta-heuristics Multi-objective Optimization Mutation Testing Regression Testing search-based software engineering self-driving cars software testing test case generation Contact a.panichella@tudelft.nl +31 15 27 89306 Van Mourik Broekmanweg 6, Delft, 2628 XE Email for appointment Cite × Copy Download",
  "content_length": 7666,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:22"
}