{
  "name": "Anrin Chakraborti",
  "homepage": "https://anrin.xyz",
  "status": "success",
  "content": "Anrin Chakraborti | University of Illinois at Chicago About Me I am an assistant professor in the Department of Computer Science at University of Illinois at Chicago. I build systems that incorporate cryptographic protocols to solve real-world problems. My research lies in the intersection of cryptography, systems and theory. As part of my research I build secure databases and cloud computing technologies, end-to-end encrypted messaging applications, and cryptographic tools for autonomous vehicle communication. Before joining UIC, I was a postdoctoral research associate in the Department of Computer Science at Duke University working with Prof. Michael Reiter. I obtained my PhD from Stony Brook University where I was advised by Prof. Radu Sion. Even before that I obtained my undergraduate degree in Computer Science from Jadavpur University, India I am recruiting 2 - 3 PhD students starting in 2025. If you want to build secure systems, design new cryptographic protocols, or simply chat about other computer security-related research ideas, feel free to reach out. My current research involves answering the following questions (among other things) How do we make smart vehicle technologies more robust against adversarial interference? How do we make secure messaging services truly private and censorship-resilient? How do we design efficient cryptographic tools for statistical frameworks? Selected Publications (Full List) INVISILINE: Invisible Plausibly-Deniable Storage S. Pinjala, B. Carbunar, A. Chakraborti, R. Sion IEEE Symposium on Security & Privacy (S&P ‘24) Distance-Aware Private Set Intersection A. Chakraborti, G. Fanti, M. K. Reiter Usenix Security Symposium (USENIX Security ‘23) Wink: Deniable Secure Messaging A. Chakraborti, D. Suciu, R. Sion Usenix Security Symposium (Usenix Security ‘23) Privately Estimating Region Containment and Overlaps with Applications to Collaborate Sensor Output Validation A. Chakraborti, M. K. Reiter IEEE European Symposium on Security & Privacy (EuroS&P ‘23) PEARL: Plausibly Deniable Flash Translation Layer using Write-Once Memory coding C. Chen, A. Chakraborti, R. Sion Usenix Security Symposium (Usenix Security ‘21) rORAM: Efficient Range ORAM with O(log2N) Locality A. Chakraborti, A. Aviv, S. G. Choi, T. Mayberry, D. Roche, R. Sion ISOC Network and Distributed System Security Symposium (NDSS ‘19) ConcurORAM: High-throughput stateless parallel multi-client ORAM A. Chakraborti, R. Sion ISOC Network and Distributed System Security Symposium (NDSS ‘19) Teaching University of Illinois at Chicago CS 588: Network and Privacy in Distributed System, Spring 2025 CS 594: Topics in Applied Cryptography, Spring 2024 CS 488: Introduction to Cryptography, Fall 2023, Fall 2024 Powered by Jekyll and Minimal Light theme.",
  "content_length": 2787,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:25"
}