{
  "name": "Ansgar Fehnker",
  "homepage": "https://researchers.mq.edu.au/en/persons/ansgar-fehnker",
  "status": "success",
  "content": "Ansgar Fehnker - Macquarie University Ansgar Fehnker public CV View Scopus Profile Ansgar Fehnker Dr, Associate Professor (Teaching and Leadership), School of Computing https://orcid.org/0000-0002-5326-3432 Emailansgar.fehnkermq.eduau h-index 1530 Citations 18 h-index Calculated based on number of publications stored in Pure and citations from Scopus 1998 …2024 Research activity per year Personal profile BiographyAnsgar Fehnker is an Associate Professor (Teaching and Leadership) in the School of Computing at Macquarie University. He was previously an Associate Professor at the University of Twente, a professor in CS/IS at the University of the South Pacific, and a researcher at National ICT Australia in Sydney. His research interest is the use of automated system and software verification tools, in particular model checking and static analysis, and their application in the design and development of software systems. His work includes verification for cyber-physical systems, static analysis for C/C++, modelling and verification of wireless routing protocols, analysis of block-chain technology and more recently, developing and applying software analysis tools and methods for an educational context. External positionsAssociate Professor, University of Twente1 Feb 2016 → 14 Nov 2021Professor, University of the South Pacific1 Feb 2012 → 31 Jan 2016Researcher, National ICT Australia Limited (NICTA)1 Nov 2004 → 31 Dec 2012 Fingerprint Dive into the research topics where Ansgar Fehnker is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 1 Similar Profiles Model Checking Computer Science 100% Static Program Analysis Computer Science 78% model checker Computer Science 41% Timed Automaton Computer Science 35% Computer Science Computer Science 31% Correctness Computer Science 28% Case Study Computer Science 27% State Space Computer Science 20% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research Outputs Research output per year 1998 2020 2024 50 Conference proceeding contribution 9 Article 4 Chapter 3 Other 7 More 2 Foreword/postscript/introduction 2 Digital or Visual products 1 Edited Book/Anthology 1 Paper 1 Other journal contribution Research output per year Research output per year Keeping humans in the loop: LLM supported oral examinationsFehnker, A. & Glover, L., 2024, ITS 2024: generative intelligence and intelligent tutoring systems: 20th International Conference, proceedings. Sifaleras, A. & Lin, F. (eds.). Switzerland: Springer, Springer Nature, p. 312-319 8 p. (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics); vol. 14798).Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Generative Artificial Intelligence 100% Oral Examination 100% Large Language Model 100% Oral 100% Artificial Intelligence 75% 1 Citation (Scopus) Lazy model checking for recursive state machinesDubslaff, C., Wienhöft, P. & Fehnker, A., Apr 2024, In: Software and Systems Modeling. 23, 2, p. 369-401 33 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Model Checking 100% State Machine 100% Model Checking Algorithm 60% Computation Tree 40% Procedural Program 40% 1 Citation (Scopus) 6 Downloads (Pure) What's in school? – topic maps for secondary school computer scienceFehnker, A., 2022, A journey from process algebra via timed automata to model learning : essays dedicated to Frits Vaandrager on the occasion of his 60th birthday. Jansen, N., Stoelinga, M. & van den Bos, P. (eds.). Cham: Springer, Springer Nature, p. 151-163 13 p. (Lecture Notes in Computer Science; vol. 13560).Research output: Chapter in Book/Report/Conference proceeding › Chapter › peer-review Computer Science 100% UK 100% Science Education 100% Secondary School 100% Model Checking 33% Atelier Hands-On TrainingBlaas, R., Fehnker, A. & Mader, A. H., 1 Jun 2021Research output: Non-traditional research output › Digital or Visual products Open Access Starting Point 100% Online Tutorial 100% Driven Exploration 100% Atelier 100% Education 100% Atelier – tutor moderated comments in programming educationFehnker, A., Mader, A. H. & Rump, A., 2021, Technology-Enhanced Learning for a Free, Safe, and Sustainable World: 16th European Conference on Technology Enhanced Learning, EC-TEL 2021 Bolzano, Italy, September 20–24, 2021 Proceedings. De Laet, T., Klemke, R., Alario-Hoyos, C., Hilliger, I. & Ortega-Arranz, A. (eds.). Cham, Switzerland: Springer, Springer Nature, p. 379-383 5 p. (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics); vol. 12884 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Education 100% Academic Teaching Personnel 100% Educational Philosophy 50% Set Expectation 50% 1 Citation (Scopus) View all 73 research outputs",
  "content_length": 5364,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:25"
}