{
  "name": "Anthony Peruma",
  "homepage": "https://www.peruma.me",
  "status": "success",
  "content": "Anthony PerumaSearchAnthony S. PerumaAssistant ProfessorUniversity of Hawai‘i at MānoaBiographyDr. Peruma is an Assistant Professor in the Department of Information and Computer Sciences at the University of Hawai‘i at Mānoa, where he leads the Intelligent Software Quality Assurance Research & Engineering Laboratory. Dr. Peruma holds a Ph.D. in Computing and Information Sciences, a Master’s in Software Engineering from Rochester Institute of Technology, and a Bachelor’s in Computer Application from Bangalore University, India.Dr. Peruma’s research is around software code quality and program comprehension, with a particular emphasis on developing tools and techniques to improve the developer experience in implementing and maintaining secure, high-quality software systems. Dr. Peruma has published several papers in leading software engineering journals and conferences on the topic of code quality and program comprehension. In addition to his research, Dr. Peruma is also actively involved in the software engineering community, serving on the program committees of several conferences and regularly reviewing papers for journals in his field.Additionally, Dr. Peruma also possesses hands-on experience in the software development industry, working on software projects for clients in multiple industries. Dr. Peruma’s industry experience includes consulting, designing, implementation, project management, and sales. InterestsProgram ComprehensionSoftware RefactoringSoftware Maintenance & EvolutionEducationPh.D. in Computing and Information SciencesRochester Institute of Technology, New York, USA  ThesisAdvisor: Christian D. Newman, PhDM.Sc. in Software EngineeringRochester Institute of Technology, New York, USA  ThesisAdvisor: Mohamed W. Mkaouer, PhDBachelor of Computer ApplicationsBangalore University, Bangalore, IndiaExperience     Assistant ProfessorUniversity of Hawai‘i at MānoaAug 2022 – Present Honolulu, Hawai‘i, USAResponsibilities include:Teaching graduate and undergraduate coursesConducting researchAcademic advisor to studentsParticipation in department and university committees     Software ArchitectVirtusa CorporationOct 2010 – Jul 2016 USA & Sri LankaResponsibilities include:Requirement AnalysisSolution ArchitectureTechnical Delivery ManagementResource Planning, Management and DevelopmentStrategic Planning and Client Management     Technology LeadVirtusa CorporationJan 2008 – Oct 2010 USA & Sri LankaResponsibilities include:Technical Design & ModelingInformation Architecture DesignClient LiaisonLead ReviewsTeam Mentoring     Software EngineerVirtusa CorporationAug 2004 – Jan 2008 USA & Sri LankaResponsibilities include:Requirements ElicitationPrototype DevelopmentRequirements ImplementationApplication DeploymentProduction SupportAccomplish­ments  Honorable Mention - Tool DemoThe 33rd International Conference on Program Comprehension (ICPC) Apr 2025Awarded For: ‘SCALAR: A Part-of-speech Tagger for Identifiers’ See certificate  IEEE TCSE Distinguished Paper AwardThe 40th International Conference on Software Maintenance and Evolution (ICSME) Oct 2024Awarded For: ‘On the Rationale and Use of Assertion Messages in Test Code: Insights from Software Practitioners’ See certificate  Best Paper Award - Mining ChallengeThe 19th International Conference on Mining Software Repositories (MSR) May 2022Awarded For: ‘Refactoring Debt: Myth or Reality? An Exploratory Study on the Relationship Between Technical Debt and Refactoring’ See certificate  Best Student Presentation - Mining ChallengeThe 19th International Conference on Mining Software Repositories (MSR) May 2022Awarded For: ‘Refactoring Debt: Myth or Reality? An Exploratory Study on the Relationship Between Technical Debt and Refactoring’ See certificate  Software Engineering Graduate Excellence AwardDepartment of Software Engineering - Rochester Institute of Technology May 2022 See awardDoctoral Symposium2019 IEEE International Conference on Software Maintenance and Evolution (ICSME) Sep 2019For: ‘Towards a Model to Appraise and Suggest Identifier Names’ See certificate  ACM Student Research Competition2019 IEEE/ACM 6th International Conference on Mobile Software Engineering and Systems (MOBILESoft) May 20192nd Place Award for ‘A Preliminary Study of Android Refactorings’  Best Paper Award2017 IEEE International Conference on Software Architecture (ICSA) Apr 2017Awarded for ‘Understanding Software Vulnerabilities Related to Architectural Security Tactics: An Empirical Investigation of Chromium, PHP and Thunderbird’ See certificateRecent & Upcoming TalksExploring Large Language Models for Analyzing and Improving Method Names in Scientific CodeOct 3, 2025 Honolulu, Hawaii, USASlidesExploring Code Comprehension in Scientific Programming: Preliminary Insights from Research ScientistsApr 28, 2025 Ottawa, Ontario, CanadaSlidesDeveloping Culturally-responsive and Equity-minded Assessment Practices in ICSMar 28, 2025 Virtual EventPDFSee all events Recent Publications Briana Lee, Samantha Limon, Alyssia Chen, Kenny Ka'aiakamanu-Quibilan, Anthony S. Peruma (2026). Understanding Computer Science Students' Career Fair Experiences: Goals, Preparation, and Outcomes. The Proceedings of the 59th Hawaii International Conference on System Sciences.PDF Cite Eman Abdullah AlOmar, Luo Xu, Sofia Martinez, Anthony S. Peruma, Mohamed Wiem Mkaouer, Christian D. Newman, Ali Ouni (2025). ChatGPT for Code Refactoring: Analyzing Topics, Interaction, and Effective Prompts. Proceedings of the 35th IEEE International Conference on Collaborative Advances in Software and Computing.PDF Cite Gunnar Larsen, Carol Wong, Anthony S. Peruma (2025). Exploring Large Language Models for Analyzing and Improving Method Names in Scientific Code. Proceedings of the 19th International Symposium on Empirical Software Engineering and Measurement.PDF Cite Carol Wong, Mai Abe, Silvia De Benedictis, Marissa Halim, Anthony S. Peruma (2025). Identifier Name Similarities: An Exploratory Study. Proceedings of the 19th International Symposium on Empirical Software Engineering and Measurement.PDF CiteSee all publications Cite × Copy Download",
  "content_length": 6141,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:32"
}