{
  "name": "Anthony Finkelstein",
  "homepage": "https://finkelstein.uk",
  "status": "success",
  "content": "Anthony Finkelstein SIR Anthony FinkelsteinSIR Anthony FinkelsteinSIR Anthony FinkelsteinSIR Anthony FinkelsteinSIR Anthony FinkelsteinSIR Anthony FinkelsteinSIR Anthony FinkelsteinSIR Anthony FinkelsteinHomeProfileResearchPublicationsAdvice & ConsultingTalks & Resources About MePresident of City St George's, University of LondonPresident of City St George's, University of LondonPresident of City St George's, University of LondonI am the President of City St George's, a constituent member of the University of London. In this role I lead an institution that is committed to business and the professions and that delivers education and research deeply informed by, and engaged with, practice. Professor of Software Systems EngineeringPresident of City St George's, University of LondonPresident of City St George's, University of LondonI am a Professor of Software Systems Engineering. I have active interests across computer science and in all aspects of the development of complex software systems. In particular I am interested in software development methods, tools and business context.ENTREPRENEUR & CONSULTANTENTREPRENEUR & CONSULTANTENTREPRENEUR & CONSULTANTI enjoy working on applied problems as a consultant. I have built successful spin-outs and advise start-up companies. I have always thought of myself as an engineer who happens to be an academic, rather than an academic who happens to be an engineer!Science AdviserENTREPRENEUR & CONSULTANTENTREPRENEUR & CONSULTANTI have served as a Chief Scientific Adviser in UK Government and have a particular background in problems of national security and defence. I have a strong and continuing interest in science and innovation policy and in government use of technology Blogsserious stuff ...prof serious (my alter ego) blog and letter. It covers both professional and personal topics, serious and light-hearted.Read the blog bluesky Contact MeNameEmail*SendThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Copyright © 2021 Anthony Finkelstein - All Rights Reserved.Powered by",
  "content_length": 2085,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:28"
}