{
  "name": "Anthony James Howard Simons",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/anthony-simons",
  "status": "success",
  "content": "Dr Anthony Simons | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Anthony Simons MA, PhD School of Computer Science Senior Lecturer Deputy Director of UG Admissions Member of the Testing research group Open staff member portrait in a modal window a.j.simons@sheffield.ac.uk +44 114 222 1838 Regent Court (DCS) Full contact details Dr Anthony Simons School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0002-5925-7148 Google Scholar Personal website Profile Dr Anthony J H Simons is an academic software engineer in the Department of Computer Science. He has an MA in Modern Languages from the University of Cambridge and a PhD in Computer Science from the University of Sheffield. After graduating he joined Sheffield as a Research Associate in the Speech and Hearing Research Group to build speech recognition systems. Later, in the Verification and Testing Research Group, he developed the type theory of object-oriented programming languages for his PhD. Subsequently becoming a Lecturer, he was active in developing object-oriented software engineering methods, and became the UK respondent for an OPEN ISO standard. As a Senior Lecturer, he investigates the area of Model-Based Testing and Model-Driven Engineering, with application to Cloud Computing. Research interests Dr Simons' research focuses on turning formal results from verification and testing into practical benefits for software engineering. His current research areas include model-based testing and model-driven engineering, with applications to Cloud computing. He has also published widely in object-oriented software engineering, including type theory and software development methods. He is inventor of the JWalk automatic software testing tool for Java; and the JAST library for processing XML in Java. He is co-author of the OPEN Toolbox of Techniques. Publications Journal articles Gyeera TW, Simons AJH & Stannett M (2023) Regression analysis of predictions and forecasts of cloud data center KPIs using the boosted decision tree algorithm. IEEE Transactions on Big Data, 9(4), 1071-1085. View this article in WRRO Gyeera TW, Simons AJH & Stannett MP (2023) Kalman filter based prediction and forecasting of cloud server KPIs. IEEE Transactions on Services Computing, 16(4), 2742-2754. View this article in WRRO Alharbi S, Hasan M, Simons AJH, Brumfitt S & Green P (2020) Sequence labeling to detect stuttering events in read speech. Computer Speech & Language, 62. Simons A & Lefticaru R (2020) A verified and optimized Stream X-Machine testing method, with application to cloud service certification. Software Testing, Verification and Reliability, 30(3). View this article in WRRO Fernández-y-Fernández CA & Simons AJH (2018) An algebra to represent task flow models. Journal of Advance Computational Research, 3(2), 63-74. View this article in WRRO Kiran M & Simons A (2016) Testing software services in cloud ecosystems. International Journal of Cloud Applications and Computing, 6(1), 42-58. View this article in WRRO Gonidis F, Paraskakis I & Simons AJH (2015) Rapid development of service-based cloud applications. International Journal of Systems and Service-Oriented Engineering, 5(4), 1-25. View this article in WRRO Fernandez-Fernandez CA & Simons AJH (2014) An Implementation of the Task Algebra, a Formal Specification for the Task Model in the Discovery Method. Journal of Applied Research and Technology, 12(5), 908-918. View this article in WRRO Simons AJH, Fraser G & Bottaci L (2013) Guest editor's introduction to the special section on TAIC-PART 2010 - Testing: Academic and Industrial Conference-Practice and Research Techniques. Software - Practice and Experience, 43(9), 1101-1102. Derrick J, North S & Simons AJH (2009) Z2SAL: a translation-based model checker for Z. Formal Aspects of Computing, 1-29. Hierons RM, Bogdanov K, Bowen JP, Cleaveland R, Derrick J, Dick J, Gheorghe M, Harman M, Kapoor K, Krause P , Luttgen G et al (2009) Using Formal Specifications to Support Testing. ACM COMPUT SURV, 41(2). Simons AJH (2007) JWalk: a tool for lazy, systematic testing of java classes by design introspection and user interaction. AUTOMAT SOFTW ENG, 14(4), 369-418. Simons AJH (2006) A theory of regression testing for behaviourally compatible object types. SOFTWARE TESTING VERIFICATION & RELIABILITY, 16(3), 133-156. Simons AJH (2006) Verification and validation for quality of UML 2.0 models. By Bhuvan Unhelkar. Published by John Wiley & Sons, Inc., Hoboken, NJ, U.S.A., 2005. ISBN: 0-471-72783-0, 271 pp. Software Testing, Verification and Reliability, 16(1), 62-64. View this article in WRRO Simons AJH (2005) The theory of classification part 18: Polymorphism through the looking glass. Journal of Object Technology, 4(4), 7-18. Simons AJH (2005) The theory of classification part 18: The theory of classification part 18: polymorphism through the looking glass. The Journal of Object Technology, 4(4), 7-18. View this article in WRRO Simons AJH (2005) Extreme programming refactored: the case against XP. Matt Stephens and Doug Rosenberg. Apress, Berkeley, CA, U.S.A., 2003. ISBN: 1-59059-096-1, pp. 400.. Software Testing, Verification and Reliability, 15(1), 63-64. View this article in WRRO Simons AJH (2005) The theory of classification part 16: Rules of extension and the typing of inheritance. Journal of Object Technology, 4(1), 13-25. Simons AJH (2005) The theory of classification part 19: The proliferation of parameters. Journal of Object Technology, 4(5), 37-48. Simons AJH (2005) The theory of classification part 17: Multiple inheritance and the resolution of inheritance conflicts. Journal of Object Technology, 4(2), 15-26. Simons AJH (2005) The Theory of Classification part 20: Modular checking of classtypes. Journal of Object Technology, 4(7), 7-18. Simons AJH (2004) The theory of classification: Part 14: Modification and objects like myself. Journal of Object Technology, 3(8), 15-26. Simons AJH (2004) The theory of classification - Part 10: Method combination and super-reference. Journal of Object Technology, 3(1), 43-53. Simons AJH (2004) The theory of classification part 12: Building the class hierarchy. Journal of Object Technology, 3(5), 13-24. Simons AJH (2004) The Theory of Classification part 11: Adding class types to object implementations. Journal of Object Technology, 3(3), 7-19. Simons AJH (2004) The theory of classification part 15: Mixins and the superclass interface. Journal of Object Technology, 3(10), 7-18. Simons AJH (2004) The theory of classification part 13: Template classes and genericity. Journal of Object Technology, 3(7), 15-25. Simons AJH (2003) The theory of classification part 7: A class is a type family. Journal of Object Technology, 2(3), 13-22. Simons AJH (2003) The theory of classification part 6: The subtyping inquisition. Journal of Object Technology, 2(2), 17-26. Simons AJH (2003) The theory of classification part 5: Axioms, assertions and subtyping. Journal of Object Technology, 2(1), 13-21. Simons AJH (2003) The theory of classification part 9: Inheritance and self-reference. Journal of Object Technology, 2(6), 25-34. Simons AJH (2003) The theory of classification part 8: Classification and inheritance. Journal of Object Technology, 2(4), 55-64. Simons AJH (2002) The theory of classification part 2: The scratch-built typechecker. Journal of Object Technology, 1(2), 47-54. Simons AJH (2002) The theory of classification part 1: Perspectives on type compatibility. Journal of Object Technology, 1(1), 55-61. Simons AJH (2002) The theory of classification part 4: Object types and subtyping. Journal of Object Technology, 1(5), 27-33. Simons AJH (2002) The theory of classification part 3: Object encodings and recursion. Journal of Object Technology, 1(4), 49-57. Henderson-Sellers B & Simons AJH (2000) The OPEN software engineering process architecture: From activities to techniques. J RES PRACT INF TECH, 32(1), 47-68. Simons AJH, Snoeck M & Hung KSY (1999) Using design patterns to reveal the competence of object-oriented methods in system-level design. COMPUT SYST SCI ENG, 14(6), 343-352. van den Berg KG & Simons AJH (1999) Control-flow semantics of use cases in UML. INFORM SOFTWARE TECH, 41(10), 651-659. Henderson-Sellers B, Firesmith DG, Graham I & Simons AJH (1999) Instantiating the process metamodel. JOOP Journal of Object Oriented Programming, 12(3), 51-57. Henderson-Sellers B & Graham IM (1999) Metalevel relationship cardinalities. JOURNAL OF OBJECT-ORIENTED PROGRAMMING, 12(1), 51-58. Simons AJH (1998) Borrow, copy or steal? Loans and larceny in the orthodox canonical form. ACM SIGPLAN NOTICES, 33(10), 65-83. Henderson-Sellers B & Graham I (1996) OPEN: toward method convergence?. Computer, 29(4), 86-89. View this article in WRRO Simons AJH, Low Eng Kwang & Ng Yee Mei (1994) An optimizing delivery system for object-oriented software. Object Oriented Systems, 1(1), 21-44. Book chapters Gonidis F, Paraskakis I & Simons AJH (2016) Rapid Development of Service-Based Cloud Applications, Big Data (pp. 392-417). IGI Global Gonidis F, Paraskakis I & Simons AJH (2014) On the role of ontologies in the design of service based cloud applications In Lopes L, Žilinskas J, Costan A, Cascella RG, Kecskemeti G, Jeannot E, Cannataro M, Ricci L, Benkner S, Petit S , Scarano V et al (Ed.), Lecture Notes in Computer Science (pp. 1-12). Springer International Publishing View this article in WRRO Cabot J, Albert P, Dupé G, del Fabro MD & Lee S (2011) MELO 2011 - 1st Workshop on Model-Driven Engineering, Logic and Optimization, Lecture Notes in Computer Science (pp. 379-380). Springer Berlin Heidelberg Simons AJH & Graham I (1999) 30 things that go wrong in object modelling with UML 1.3 In Kilov H, Rumpe B & Simmonds I (Ed.), Behavioral Specifications of Businesses and Systems (pp. 237-257). Springer US View this articl",
  "content_length": 21135,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:32"
}