{
  "name": "Anthony Gitter",
  "homepage": "https://www.biostat.wisc.edu/~gitter",
  "status": "success",
  "content": "Gitter Lab Gitter Lab Our lab's research involves designing algorithms that leverage biological networks to connect different types of experimental data and detect surprising relationships among them. We use such techniques to study human disease, in particular cancer and viral infection. We also focus on the dynamic behaviors of biological networks and develop techniques to reconstruct dynamic models of signaling pathways and transcriptional regulatory networks from high-throughput proteomic and transcriptomic data. In addition, we use machine learning to prioritize biological experiments for drug discovery, protein engineering, and other biomedical challenges. Learn More We are not currently actively recruiting new graduate students or postdocs. However, prospective graduate students are always welcome to contact Anthony to discuss research in case that changes. Please send a follow up message if you do not hear back after a week or two. In the Fall 2019, 2021, 2022, 2023, 2024, and 2025 semesters Anthony co-taught Computational Network Biology with Sushmita Roy. 2025 Website 2024 Website 2023 Website 2022 Website 2021 Website 2019 Website In the Fall 2020 semester Anthony co-taught Introduction to Artificial Intelligence with Yin Li, Yingyu Liang, and Daifeng Wang. Course Website In the Spring 2016-2018 semesters Anthony taught Advanced Bioinformatics. 2018 Website 2017 Website 2016 Website In the Spring 2015 semester Anthony taught a special topics course on Cancer Bioinformatics. Course Website Anthony and Hannah Wayment-Steele launch the Madison AI for Proteins community as part of the RISE AI Collaboration HQ. Our Assay2Mol manuscript was presented at EMNLP 2025. Assay2Mol generates chemicals by retrieving relevant biochemical assays from PubChem to use as context. Tapanmitra Ravi has joined the group for a rotation. Welcome Tapanmitra! The journal versions of our manuscripts on biophysics-based protein language models and multi-omic pathway analysis have been published. Our Chemical Language Model Linker method for text-based chemical generation has been published. Anthony participated in two collaborative machine learning projects: a workshop on benchmarking and evaluation in biology and a community challenge on ADMET assay property prediction. Our paper on predicting protein fitness with protein structure-based models was presented at the ICLR 2025 GEM workshop. Anthony contributed to the Adaptyv EGFR Binder Competition preprint. Our commentary preprint \"A renewed call for open artificial intelligence in biomedicine\" is available. Anthony has been named the Jeanne M. Rowe Chair. University of Wisconsin-Madison, Morgridge Institute for Research Mailing address: 330 N Orchard St, Madison, WI 53715, United States Office location: WID 3268 Office phone: (608) 316-4442 Email: gitter@biostat.wisc.edu Twitter: @anthonygitter Bluesky: @anthonygitter.bsky.social © Anthony Gitter 2014. All rights reserved. Design: HTML5 UP Last updated November 16, 2025",
  "content_length": 3007,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:30"
}