{
  "name": "Anthony Steed",
  "homepage": "http://wp.cs.ucl.ac.uk/anthonysteed",
  "status": "success",
  "content": "Anthony Steed - Computer Graphics and Virtual Reality at Department of Computer Science Home Teaching Project Suggestions Research Themes Projects Technology Completed Doctoral Students Publications Reviewing Consultancy Blog Timeline Contact Home Responsibilities I am a Professor in the Virtual Environments and Computer Graphics group in the Department of Computer Science, University College London. I am currently head of the group. My research area is real-time interactive virtual environments, with particular interest in virtual reality, augmented reality, novel forms of interaction, large-scale graphical models, collaborative systems and networking for tightly synchronous telecollaboration. Details of my active projects can be found here. The group runs a CAVE-like facility, a large tracking space and several other high-end virtual reality systems. I am first supervisor for several doctoral students: Jingyi Zhang, Kalila Shapiro, Lisa Izzouzi, Klara Brandstatter, Nels Numan, Dan Archer and Felix Thiel. I have three post-doctoral fellows: Ben Congdon, Daniele Giunchi and Sebastian Friston. Our labs are run by our senior researcher and technician David Swapp. My teaching responsibilities can be found here. I am currently deputy head of department. I have a responsibility for estates planning. I consult to a small number of companies in areas related to graphics or new media. See personal pages about me. I was director of the Engineering Doctorate Centre in Virtual Environment, Imaging and Visualisation from 2005- 2013 and 2014-2018. For my Office Hours, please my contact page. I have co-authored two books: Networked Graphics by myself and Manuel Oliveira published in 2010 Computer Graphics and Virtual Environments: From Realism to Real-Time by Mel Slater, Yiorgos Chrysanthou and I 2 books News & Announcements Discussions about Apple Vision Pro14th June 2023 - 4:32 pmThoughts on Facebook/Oculus Accounts23rd September 2020 - 1:41 pmVR’s “Cat Problem”14th August 2020 - 4:15 pm top Office My office is in 169 Euston Road, room 4.10. Jobs and Studentships I am always interested in discussing potential PhD topics. I am not actively recruiting for open positions now, but I will interested in talking with students who want to start in late 2022 or 2023. I am happy to receive applications  on topics related to 3D user interfaces, virtual reality, networked virtual reality, perceptual and cognitive issues in mixed reality, haptics and telepresence. Tweet TweetsTweets by anthony_steed Recent Posts Discussions about Apple Vision Pro Thoughts on Facebook/Oculus Accounts VR’s “Cat Problem” Sabbatical Part 2 Sabbatical TwitterFollow @anthony_steed Blog Discussions about Apple Vision Pro 14th June 2023 Thoughts on Facebook/Oculus Accounts 23rd September 2020 VR’s “Cat Problem” 14th August 2020 Sabbatical Part 2 8th February 2019 Sabbatical 17th September 2018 PagesHome Teaching Research Publications Consultancy Blog Contact Categories Uncategorised Address Professor Anthony Steed Department of Computer Science University College London Gower Street London WC1E 6BT United Kingdom © Copyright - Anthony Steed - Wordpress Premium Theme by Kriesi University College London This website uses cookies More infoOK",
  "content_length": 3248,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:37"
}