{
  "name": "Anthony Johnson",
  "homepage": "http://physics.umbc.edu/people/faculty/johnson",
  "status": "success",
  "content": "Anthony M. Johnson – Department of Physics – UMBC Skip to main content Department of Physics Menu Apply Search Search Context This Site All of UMBC Location Physics Building Room 220 Contact Phone: 410-455-2513Contact Us Department of Physics on myUMBCDepartment of Physics on TwitterDepartment of Physics on Instagram Contact Information amj@umbc.edu Room 029, TRC Building Office: 410-455-8440 Cell: 732-216-5635 CASPR CASPR Bio Page Title Professor of Physics Professor of Computer Science & Electrical Engineering (CSEE) Director, Center for Advanced Studies in Photonics Research (CASPR) Education Ph.D. Physics – City College of New York (CCNY) 1981 [Support from the AT&T Bell Laboratories Cooperative Research Fellowship Program for Minorities] B. S. Physics – Polytechnic Institute of New York 1975, Magna Cum Laude Previous Experience Dr. Johnson was a Member of the Technical Staff in the Quantum Physics and Electronics Research Dept. and a Distinguished Member of the Technical Staff in the Photonic Circuits Research Dept. at AT&T Bell Laboratories for 14 years prior to joining the New Jersey Institute of Technology (NJIT) in 1995. At NJIT he was Chairperson and Distinguished Professor of Physics for 8 years prior to joining the UMBC Physics Dept. in August 2003. 2002 President of the Optical Society of America (OSA) Editor-in-Chief of Optics Letters (1995-2001) Fellow – AAAS (1996), APS (1995), IEEE (2000), National Society of Black Physicists (1992), OSA (1991) Life Fellow, Institute of Electrical and Electronics Engineers (IEEE) (2020) Election to the American Academy of Arts and Sciences (2021) DOE Basic Energy Sciences Advisory Committee [BESAC] (99-08) 1990 Program Co-Chair and 1992 General Co-Chair, Conference on Lasers & Electro-Optics (CLEO) Professional Interest Dr. Johnson’s general area of research is in ultrafast optical and optoelectronic phenomena. He has nearly 80 refereed publications, 2 book chapters and 4 US patents. His current research interests include the ultrafast photophysics and nonlinear optical properties of bulk, nanostructured and quantum well semiconductor structures, ultrashort pulse propagation in fibers and high-speed lightwave systems. Member, NIST Visiting Committee on Advanced Technology (VCAT) (2021-2024) Election to the American Academy of Arts and Sciences (2021) Stephen D. Fantone Distinguished Service Award of the Optical Society (OSA) (2021) Member, 2021 IEEE Technical Activities Board (TAB) Committee on Diversity and Inclusion (CDI) (2021- ) Member, National Academies Panel on Materials and Manufacturing Sciences at the Army Research Laboratory (ARL) (May 2020) Member, NSF Science & Technology Center (STC) External Advisory Committee for the STC on Real-Time Functional Imaging (STROBE), with lead institution University of Colorado at Boulder and PI Margaret M. Murnane (June 2020) Member, External Review Team for the Institute of Optics, University of Rochester (May 2020) Member, OSA Diversity, Equity and Inclusion Rapid Action Committee (DEI RAC) (2020-2021) Member, Advisory Council for the Princeton Institute for the Science and Technology of Materials (PRISM) at Princeton University (2018-2021) Member, Search Committee for a new Editor-in-Chief of the OSA Journal Advances in Optics and Photonics (AOP) (2018-2019) OSA Representative to the Liaison Committee for Underrepresented Minorities (LCURM) of the American Institute of Physics (AIP) (2007-2019) Distinguished Traveling Lecturer, APS Division of Laser Science, 2018 Committee Member, 2017 IEEE Corporate Innovation Award Committee, 2016-2018 Committee Member, American Physical Society (APS) Nominating Committee, 2016-2018 Committee Member, The Frederic Ives Medal/Jarus Quinn Prize Committee — the highest award of the OSA (Optical Society), 2017-2019 Committee Chair, American Physical Society (APS) Bridge Program’s National Advisory Board, 2015-Present http://www.apsbridgeprogram.org/about/leadership.cfm Invited to join the HistoryMakers/ScienceMakers (2013) http://www.thehistorymakers.com/biography/anthony-johnson Joseph S. Tyler Jr. Award, National Technical Association, Baltimore Chapter, June 7, 2013 Honorary Doctorate – Doctor of Science, Honoris Causa at the Commencement of the City College of the City University of NY (CCNY), June 3, 2011 Deputy Director of the NSF Engineering Research Center MIRTHE (Mid-Infrared Technologies for Health and the Environment), 2006-2016 Founding Member of the Editorial Board of the new APS open access, all electronic journal Physical Review X (PRX), 2011-2018 Sigma Xi Distinguished Lecturer, 2011-2013 Member, APS Division of Laser Science (DLS) Executive Committee and Representative to APS Council (2011-2014); Member, APS Executive Board (2013-2014) Steering Committee Member and National Advisory Board Member of the APS Minority Bridge Program, 2010-present Member-at-Large of the National Academies US Liaison Committee for the International Union of Pure and Applied Physics (IUPAP), 2009-2014 Member, National Research Council (NRC) Committee on Atomic, Molecular, and Optical Sciences (CAMOS), 2013-2015 Member, Steering Committee of the International Year of Light and Light-based Technologies (IYL2015) for the period 2014-2016 Selected Publications “Stimulated Raman generation of aqueous singlet oxygen without photosensitizers,” A.M. Olaizola, R. Kuis, A.M. Johnson, D. Kingsley, Journal of Photochemistry & Photobiology, B: Biology, 235, (2022), 112562 “Engineering of Large Third-Order Nonlinearities in Atomic Layer Deposition Grown Nitrogen-Enriched TiO2 ,” R. Kuis, T. Gougousi, I. Basaldua, P. Burkins, J. Kropp, and A. M. Johnson, ACS Photonics, 6, 2966-2973 (2019) “Oxygen-dependent laser inactivation of murine norovirus using visible light lasers,” David Kingsley, Robinson Kuis, Rafael Perez, Isaac Basaldua, Paul Burkins, Aristides Marcano and Anthony Johnson, Virology Journal 15:117 (2018) “Thermally managed Z-scan methods investigation of the size-dependent nonlinearity of graphene oxide in various solvents,” P. Burkins, R. Kuis, I. Basaldua, A. M. Johnson, S. R. Swaminathan, D. Zhang, and S. Trivedi, J. Opt. Soc. Am. B33, 2395 (2016) “Dark Matters: Metaphorical Black Holes that Affect Underrepresentation in Engineering,” R. G. Tull, D. L. Tull, S. S. Hester and A. M. Johnson, American Society for Engineering Education (ASEE). Paper (ID #17239) Annual Conference and Exposition, New Orleans, LA, June 2016 “Determination of the nonlinear refractive index of multimode silica fiber with a dual-line ultrashort pulse laser source by using the induced grating autocorrelation technique,” A. Traore, E. Lalanne, and A. M. Johnson, Opt. Express 23, 17127 (2015) “Investigation of giant Kerr nonlinearity in quantum cascade lasers using mid-infrared femtosecond pulses ,” H. Cai, S. Liu, E. Lalanne, and A. M. Johnson, Appl. Phys. Lett. 106, 051102 (2015) “Femtosecond measurements of near-infrared pulse induced mid-infrared transmission modulation of quantum cascade lasers,” H. Cai, S. Liu, E. Lalanne, D. Guo, X. Chen, X. Wang, F-S. Choa, and A. M. Johnson, Appl. Phys. Lett. 104, 211101 (2014) “Near-infrared induced optical quenching effects on mid-infrared quantum cascade lasers,” D. Guo, H. Cai, M. A. Talukder, X. Chen, A. M. Johnson, J. B. Khurgin and F-S. Choa., Appl. Phys. Lett. 104, 251102 (2014) “Treatment efficacy of laser photothermal therapy using gold nanorods,” N. Manuchehrabadi, R. Toughiri, C. Bieberich, H. Cai, A. Attaluri, R. Edziah, E. Lalanne, A. M. Johnson, R. Ma and L. Zhu, Int. J. Biomedical Engineering and Technology, 12 (2), 157 (2013) “Combatting Stereotype Threat” A. M. Johnson, Optics & Photonics News 24, 16 (May 2013) “MicroCT imaging and in vivo temperature elevations in implanted prostatic tumors in laser photothermal therapy using gold nanorods” N. Manuchehrabadi, A. Attaluri, H. Cai, R. Edziah, E. Lalanne, C. Bieberich, R. Ma, A. M. Johnson, L. Zhu, J. of Nanotechnology in Engineering and Medicine 3, 021003 (2012) “Minority Women Scientists: At the Culture-Gender Crossroads” A. M. Johnson, Optics & Photonics News 23, 15 (March 2012) “Femtosecond Carrier Dynamics and Nonlinear Effects in Quantum Cascade Lasers” S. Liu, E. Lalanne, P.Q. Liu, X. Wang, C. F. Gmachl and A. M. Johnson, IEEE Journal of Selected Topics in Quantum Electronics (Invited Paper) 18(1), pp. 92-104 (2012) “Second harmonic generation in quantum cascade lasers pumped by femtosecond mid-infrared pulses” S. Liu, H. Cai, E. Lalanne, P. Q. Liu, X. Wang, C. Gmachl and A. M. Johnson Appl. Phys. Lett. 99, 122104 (2011) “Measurement of the Effective Nonlinear and Dispersion Coefficients in Optical Fibers by the Induced Grating Autocorrelation Technique” R. Kuis, A. M. Johnson and S. Trivedi, Opt. Express 19, 1755 (2011). “Z-scan Measurements Using Ultrashort High-Repetition-Rate Lasers: How to Recognize the Parasitic Effects of Nonlinear Behavior of Fused -Silica Damage Sites” R. Edziah, E. Lalanne, V. Torres, A. M. Johnson, and S. Trivedi, J. Opt. Soc. Am. B28, 1385 (2011) “Hands-on optics: an informal science education initiative” A. M. Johnson, S. M. Pompea, E. G. Arthurs, C. E. Walker, and R. T. Sparks, in Novel Optical Systems Design and Optimization X, edited by R. J. Koshel, G. G. Gregory, Proc. of SPIE Vol. 6668, 66680D (2007). “Technique for Simultaneous Measurement of the Raman Coefficient and Nonlinear Refractive Index of Optical Fibers – Theory and Experiment” F. A. Oguama, H. Garcia and A. M. Johnson J. Opt. Soc. Am. B 22, 426 (2005) “Measurement of the Nonlinear Coefficient of Telecommunication Fibers as a Function of Er, Al and Ge Doping Profiles Using the Photorefractive Beam-Coupling Technique” F. A. Oguama, A. M. Johnson and W. A. Reed, J. Opt. Soc. Am B 22, 1600 (2005). “Pump Induced Nonlinear Refractive Index Change in Erbium and Ytterbium Doped Fibers – Theory and Experiment” H. Garcia, A. M. Johnson, F. A. Oguama and S. Trivedi, Opt. Lett. 30, 1261 (2005) “Numerical Modeling of t",
  "content_length": 11180,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:32"
}