{
  "name": "Anthony W. Lin",
  "homepage": "https://anthonywlin.github.io",
  "status": "success",
  "content": "Homepage of Anthony Widjaja Lin [previously Anthony W. To] | Home Page of Anthony W. Lin Skip to the content. Homepage of Anthony Widjaja Lin [previously Anthony W. To] NEWS I will be chairing the PC of CAV’26 (together with Eva Darulova and Philipp Ruemmer) I am delighted to be invited as a keynote speaker at VMCAI’26 I am delighted to have given an invited talk at RP’25. The invited paper can be found here Background Full Professor (W3) in Theoretical Computer Science (Automated Reasoning) and Max-Planck Fellow at University of Kaiserslautern-Landau, Germany Previously: (2016 - 2019) Associate Professor in Programming Languages at Oxford University Department of Computer Science and Governing Body Fellow at Kellogg College. I taught at the MSc Software Engineering Programme. (2014 - 2016) assistant professor at Yale-NUS, Singapore. (2010-2013) EPSRC Postdoctoral Research Fellow at Oxford University hosted by Marta Kwiatkowska Completed PhD in Informatics at University of Edinburgh in 2010 under Leonid Libkin (supervisor) and Richard Mayr (co-advisor). Awards (selected): ERC Consolidator Grant (2023), Amazon Research Award (2021), ERC Starting Grant (2017), Google Faculty Award (2017), LICS Kleene Award (2010) Where else I studied: BSc (Honours) at Melbourne University and MSc at University of Toronto Where I am from: I am Australian (and since recently also German) and was born in Indonesia Research Interests I am interested in automated reasoning (particularly over strings), formal language theory, learning/synthesis, and foundations of machine learning. Applications of interests include software verification, program synthesis, querying graph databases, machine learning, and computer security. My publications page contains pretty much all my published papers. Selected Tool: OSTRICH - our string solver supporting complex constraints (concatenation, real-world regexes, lengths, transducers) that primarily exploit regular constraint propagation. Research Group Members Current Members Pascal Bergstraßer (Postdoc) Antonio Casares (Postdoc) Julian Parsert (Postdoc) Marco Sälzer (Postdoc) Eva Gonzalez Garcia (PhD Student) Moritz Graf (PhD Student) Hongjian Jiang (PhD Student) Heyang Li (PhD Student) Oliver Markgraf (PhD Student) Past Postdocs Dr. Shuanglong Kan (Postdoc Researcher completed in 2022, now Researcher at Certik) Dr. Muhammad Najib (Postdoc Researcher completed in 2022, now Lecturer at Heriot-Watt University, UK) Dr. Reino Niskanen (Postdoc Researcher completed in 2018, now Lecturer at Liverpool John Moores University, UK) Dr. Rodrigo Raya (Postdoc Researcher completed in 2024, now Assistant Professor at Polytechnic University of Madrid, Spain) Dr. Daniel Stan (Postdoc Researcher completed in 2022, now Assistant Professor at Epita, France) Dr. Di-De Yen (Postdoc Researcher completed in 2023, now postdoc at Academia Sinica, Taipei) Past PhD Students Dr. Pascal Bergsträßer (completed in 2025) Dr. Chih-Duo Hong (PhD student completed in 2022, now Assistant Professor at National Chingchi University, Taiwan) Dr. Xuan-Bach Le (PhD student completed in 2018, now Postdoc at Nanyang Technical Uni, Singapore) Events PC chair/organizer: CAV’26 (co-chaired with Eva Darulova and Philipp Ruemmer) RP’22 (co-chaired with Georg Zetzsche) APLAS’19 MOSCA (Meetings on String Constraints and Applications) 2019 (co-chaired with Loris D’Antoni and Philipp Rümmer) ICECCS’18 (co-chaired with Jun Sun) IMS Workshop Series on Formal Verification (co-chaired with Luke Ong) Executive Committee Member: Asian Association for Foundation of Software Program committee member: CAV’25 [Area chair] FoSSaCS’25 Highlights’24 CAV’24 [Area chair] LICS’24 STACS’24 TACAS’24 CAV’23 ICALP’23 VMCAI’23 ATVA 2022 CSL 2022 POPL 2022 ATVA 2021 CAV 2020 Pre 2020: PPDP’19, ATVA’19, VMCAI’19, CAV’19 Verification Mentoring Workshop, LICS’18, ICALP’17, PSI,17, FoSSaCS’17, APLAS’16, PSI’15, LICS’15, INFINITY’13 Teaching I regularly offer courses, seminars, and projects on computational logic, verification, and automata. Please check the group’s official website.",
  "content_length": 4090,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:34"
}