{
  "name": "Anthony Hunter",
  "homepage": "http://www0.cs.ucl.ac.uk/staff/a.hunter",
  "status": "success",
  "content": "Anthony Hunter I am a Professor of Artificial Intelligence in the Department of Computer Science, University College London. I am also Head of the Intelligent Systems Group, and Department Graduate Tutor. Department of Computer Science University College London Gower Street London WC1E 6BT UK Phone: +44 20 3108 7113 Internal: 57113 anthony.hunter@ucl.ac.uk Research My research is in the area of machine reasoning which is a branch of artificial intelligence. Reasoning is a critically important faculty of human intelligence, and machine reasoning is concerned with capturing aspects of this for use in software. More specifically, I am currently interested in the following inter-related topics involving machine reasoning. Computational models of argument: Formalization of monological and dialogical argumentation using logic and probability theory; Handling enthymemes through the use of common/commonsense knowledge; And applications in decision making and sense making. Computational persuasion: Automated systems for engaging in a dialogue with a user (the persuadee) in order to persuade them through the use of convincing arguments and counterarguments. For more information, see www.computationalpersuasion.com. Further topics that I am interested in include non-monotonic reasoning, commonsense reasoning, paraconsistent reasoning, methods for aggregating knowledge, and measures of inconsistency. Publications Books Elements of Argumentation Journal special issues Papers in journals, conference proceedings and books Technical reports Background I am a graduate of Bristol University and Imperial College London. I did my PhD in the Department of Computing at Imperial College on the topic of non-monotonic reasoning (supervised by Professor Dov Gabbay). I moved to UCL after undertaking a couple of post-docs positions at Imperial (on the role of non-monotonic reasoning in machine learning, and on the analysis of inconsistency in specifications). I have published over 200 papers on aspects of inconsistency, argumentation, and knowledge representation and reasoning. Many of these papers are in leading journals such as Artificial Intelligence, Journal of Artificial Intelligence Research, and Journal of Logic and Computation, and conferences such as IJCAI, AAAI, AAMAS, KR, and ECAI. I also co-authored, with Philippe Besnard, Elements of Argumentation, MIT Press, 2008. I have been principal investigator or co-investigator on numerous projects funded EPSRC, the Royal Society, Leverhulme Trust, Alan Turing Institute, and Innovate UK. Also I have had PhD students funded by EPSRC, SAP Research, Cancer Research UK, and the Royal Free Charity. I am an Associate Editor of Artificial Intelligence (Elsevier), an Area Editor of International Journal of Approximate Reasoning (Elsevier), and an editorial board member of Argumentation and Computation (Taylor & Francis), and Journal of Artificial Intelligence Research (Open AI Foundation). Previously, I have been on the editorial board of Knowledge Engineering Review (Cambridge University Press) and Knowledge and Information Systems (Springer). Also, I have been on the senior programme committee member or area chair for numerous conferences including IJCAI, AAAI, ECAI, KR, and UAI. I have been an invited speaker at various European and international conferences including ECSQARU, SUM, DL, JELIA, COMMA, and KSEM, as well as the Brazilian AI Symposium, the Japanese AI conference, and the German AI conference.",
  "content_length": 3488,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:30"
}