{
  "name": "Antinisca Di Marco",
  "homepage": "http://people.disim.univaq.it/adimarco",
  "status": "success",
  "content": "Dr. Antinisca Di Marco's Home Page DEPARTMENT OF APPLIED CLINICAL SCIENCE AND BIOTECHNOLOGY Dr. Antinisca Di Marco Home Profile Research People Publications Teaching Personal Associate Professor Software Engineering and Architecture Laboratory Quality of Service Group BioInformatics Group Department of Biotechnological and Applied Clinical Sciences, University of L'Aquila Via Vetoio s.n.c., 67100 Coppito (AQ), Italy phone: +39 0862 433178fax: +39 0862 433131 e-mail: antinisca_dot_dimarco_at_univaq_dot_it PINKAMP: Le ragazze contano! Primo camp di informatica dedicato alle ragazze organizzato presso Università degli Studi dell'Aquila. AFFRETTATEVI: ISCRIZIONI FINO AL 2 OTTOBRE OFFSITEART: L'Aquila si riveste d'arte. Paola Inverardi. Intervista al Corriere della Sera: «I miei studenti all'Aquila? Devono dare tutti una mano alla ricostruzione» Upcoming Events IEEE International Conference on Pervasive Computing and Communications (PERCOM2019) Paper Abstract:\tSeptember 21, 2018 Paper Submission: September 28, 2018 Notification of acceptance: December 11, 2018 Conference: March 11- 15 2019, Kyoto, Japan. womENcourage 2018  Creating the Future Together, ACM Celebration of Women in Computing Conference: Belgrade, Serbia, October 3-5, 2018. 10th IEEE International Conference on Performance Engineering(ICPE 2019 Conference: April 7-11 2019, Mumbai, India. Smartly is a spinoff of the University of LAquila, founded in May 2014. It was conceived at the end of an evolution path started in 2012 with the participation to a program for the selection of best business ideas internal to the University of LAquila. The core business was enlarged to include technological solutions, either mobile or wireless, that could improve the quality of life and make easier any action perceived by the users as complex.",
  "content_length": 1822,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:37"
}