{
  "name": "Anton Bankevich",
  "homepage": "https://sites.google.com/view/anton-bankevich",
  "status": "success",
  "content": "About meSearch this siteEmbedded FilesSkip to main contentSkip to navigationAnton BankevichMy name is Anton Bankevich. I am an assistant professor at Penn State university.I received my PhD at the Center for Algorithmic Biotechnology (Saint Petersburg State University, Russia) and was a postdoctoral researcher at UCSD under supervision of Prof. Pavel A. Pevzner. You can find out more about me in my CV.My research interests include sequencing data analysis and genome assembly. I believe that bioinformatics algorithms are crucial for the studies based on sequencing data and I enjoy unraveling true potential of new sequencing technologies that is hidden behind basic applications. I am also interested in graph theory, effective data structures and theoretical foundations of the genome assembly algorithms.I contributed to multiple genome assembly algorithms optimized for complex sequencing data including single-cell genome sequencing (Bankevich et al., J. Comp. Biol. 2012, Nurk et al., J. Comp. Biol. 2013, Prjibelski et al., Bioinformatics, 2014), metagenome sequencing (Sanders et al., Genome Biology 2019), synthetic long reads (Bankevich and Pevzner, Nature Methods 2016, Tolstoganov et al., Bioinformatics 2019), and long error-prone reads (Bankevich and Pevzner, Cell Systems, 2018) (more about these tools here). Currently I am working genome assembler LJA (La Jolla assembler) optimized for PacBio HiFi reads and their combinations with other technologies.I have a vacant positions for PhD students in my lab. You can read about it in more details here.Research experience:2022-present. Assistant professor, Penn State University, Joint position in CSE department and Huck institute for life sciences.2018-2021. Postdoctoral researcher, University of California San Diego, Computer Science and Engineering department. Supervisor: Pavel A. Pevzner2015-2018. Researcher, Center for Algorithmic Biotechnology, Institute for Translational Biomedicine, St. Petersburg State University. Supervisor: Pavel A. Pevzner2011-2015. Researcher, Laboratory for Algorithmic Biology, St. Petersburg Academic University. Supervisor: Pavel A. PevznerTeaching experience:2022, 2024 Conducted undergraduate lectures in Discrete mathematics at Penn State (CMPSC360)2023 Computational biology graduate course at Penn State2019 Multiple invited lectures on genome assembly as a part of \"Genomic data science\" course (graduate  course at UCSD, CSE 291). 2016. Computational Omics (graduate course at St. Petersburg Academic University, Saint Petersburg, Russia).2014. Genome Assembly (graduate course at St. Petersburg Academic University, Saint Petersburg, Russia).2011. Discrete mathematics (graduate seminar at Computer Science Center, Saint Petersburg, Russia).2008, 2011. Algebra (undergraduate seminar at St. Petersburg State University, Saint Petersburg, Russia).2004-2007. Olympiad Mathematics (seminar for students at the school #533 for gifted children, Saint Petersburg, Russia).Education:2017. PhD Thesis: “Genome assembly from complex sequencing data”  (supervisor: Pavel Pevzner). School of Mathematics and Mechanics at Saint Petersburg State University.2009. B.S. and M.S. Degree. Department of Mathematics and Mechanics (Algebra Division). St. Petersburg State University M.S. Thesis: Bounds on the length of monochrome paths in colored directed graphs (supervisor: Dmitriy Karpov).Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 3465,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:39"
}