{
  "name": "Antonis Michalas",
  "homepage": "https://www.tuni.fi/en/antonios-michalas",
  "status": "success",
  "content": "Antonios Michalas | Tampere universitiesAntonios MichalasProfessor, cyber securityFaculty of Information Technology and Communication Sciences | Computing SciencesTampere Universityantonios.michalas [at] tuni.fi (antonios[dot]michalas[at]tuni[dot]fi)phone number+358504478399Hervanta CampusOrcidhttps://orcid.org/0000-0002-0189-3520Websiteshttps://www.amichalas.comAbout meI received my PhD in Provable Security and Privacy from Aalborg University, Denmark and I currently work as an Associate Professor at the Department of Computing Sciences where I also lead the Network and Information Security group (NISEC). The group comprises PhD students, professors a nd researchers. Group members conduct research in areas spanning from the theoretical foundations of cryptography to the design and implementation of leading-edge efficient and secure communication protocols. Apart from my research work at NISEC, as an associate professor, I am actively involved in the teaching activities of the University. Finally, my role expands to student supervision and research project coordination. You can find more information on my profile and my latest activities at www.amichalas.com Fields of expertise Applied Cryptography; Operations on Encrypted Data; Privacy Enhancing Technologies; Privacy-Preserving Machine Learning; and...anything that looks interesting! Latest publicationsBlind Brother: Attribute-Based Selective Video EncryptionFrimpong, E., Liu, B., Nuoskala, C. & Michalas, A., 4 Jun 2025, Proceedings of the 15th ACM Conference on Data and Application Security and Privacy: CODASPY '25. ACM, p. 371-382 Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewChallenges and Solutions in Internet of Things-Based Smart ApplicationsShekokar, N. M., Shinde, S. K., Ambarkar, S. S., Michalas, A., Mangla, M. & Thomas, A., Jan 2025, Chapman and Hall/CRC. 186 p.Research output: Book/Report › Anthology › Scientific › peer-reviewFaaS and Furious: Accelerating Privacy-Preserving ML with Function as a Service at the EdgeTusa, F., Michalas, A., Bowden, J. & Kiss, T., 2025, 2025 34th International Conference on Computer Communications and Networks (ICCCN). IEEE, p. 1-6 (Proceedings : International Conference on Computer Communications and Networks).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewTo Vaccinate or Not to Vaccinate? Analyzing X Power over the PandemicKhan, T., Sohrab, F., Michalas, A. & Gabbouj, M., 2025, Advanced Information Networking and Applications: Proceedings of the 39th International Conference on Advanced Information Networking and Applications (AINA-2025), Volume 7. Springer, p. 352-365 14 p. (Lecture Notes on Data Engineering and Communications Technologies; vol. 251).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewA More Secure Split: Enhancing the Security of Privacy-Preserving Split LearningKhan, T., Nguyen, K. & Michalas, A., 2024, Secure IT Systems: 28th Nordic Conference, NordSec 2023, Oslo, Norway, November 16–17, 2023, Proceedings. Fritsch, L., Hassan, I. & Paintsil, E. (eds.). Cham: Springer, p. 307-329 23 p. (Lecture Notes in Computer Science; vol. 14324).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewA Pervasive, Efficient and Private Future: Realizing Privacy-Preserving Machine Learning Through Hybrid Homomorphic EncryptionNguyen, K., Budzys, M., Frimpong, E., Khan, T. & Michalas, A., 5 Nov 2024, 2024 IEEE Conference on Dependable, Autonomic and Secure Computing (DASC). IEEE, p. 47-56 10 p. (IEEE International Conference on Dependable, Autonomic and Secure Computing).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewFE[r]Chain: Enforcing Fairness in Blockchain Data Exchanges Through Verifiable Functional EncryptionNuoskala, C., Rabbaninejad, R., Dimitriou, T. & Michalas, A., Jun 2024, Proceedings of the 29th ACM Symposium on Access Control Models and Technologies (SACMAT 2024). ACM, p. 183-191 9 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewGuardML: Efficient Privacy-Preserving Machine Learning Services Through Hybrid Homomorphic EncryptionFrimpong, E., Nguyen, K., Budzys, M., Khan, T. & Michalas, A., 2024, Proceedings of the 39th ACM/SIGAPP Symposium on Applied Computing (SAC '24). ACM, p. 953-962 10 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewLearning in the Dark: Privacy-Preserving Machine Learning using Function ApproximationKhan, T. & Michalas, A., 2024, Proceedings - 2023 IEEE 22nd International Conference on Trust, Security and Privacy in Computing and Communications, TrustCom/BigDataSE/CSE/EUC/iSCI 2023. Hu, J., Min, G. & Wang, G. (eds.). IEEE, p. 62-71 10 p. (IEEE International Conference on Trust, Security and Privacy in Computing and Communications).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewMake Split, not Hijack: Preventing Feature-Space Hijacking Attacks in Split LearningKhan, T., Budzys, M. & Michalas, A., 24 Jun 2024, Proceedings of the 29th ACM Symposium on Access Control Models and Technologies (SACMAT 2024). ACM, p. 19-30 12 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewAll publicationsCVhttp://www.amichalas.com/CV/Antonis_Michalas_CV.pdf",
  "content_length": 5655,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:20"
}