{
  "name": "Antonio Blanca",
  "homepage": "http://www.cse.psu.edu/~azb1015",
  "status": "success",
  "content": "Antonio Blanca Antonio Blanca Associate Professor Pennsylvania State University Theory Group I am the Dorothy Quiggle Professor in Engineering in the CSE Department at Pennsylvania State University. My research interests include randomized algorithms, Markov chain Monte Carlo, spin systems, learning, testing, and applications in statistical physics and computational biology. My research has been supported by the NSF (CAREER CCF-2143762, CISE CCF-2312709, GRFP), NIH (NIGMS R01GM146462), and the UC Berkeley Chancellor’s Fellowship. I am currently serving as the Professor in Charge of the CSE Graduate Programs. Education Postdoctoral Fellow, 2016-2018 Georgia Tech PhD in Computer Science, 2016 UC Berkeley BS in CS/Math, 2011 Georgia Tech Students Md Tahmidur Rafid Heehyun Park Xusheng Zhang (Summer '24) Papers Cutoff for the Swendsen-Wang dynamics on the complete graph A. Blanca and Z. Song FSTTCS 2025 Estimation of substitution and indel rates via k-mer statistics M.R. Hera, P. Medvedev, D. Koslicki and A. Blanca WABI 2025 K-mer-based estimators of the substitution rate between repetitive sequences H. Wu, A. Blanca, and P. Medvedev WABI 2025 Mean-field Potts and random-cluster dynamics from high-entropy initializations A. Blanca, R. Gheissari and X. Zhang Annals of Applied Probability, 2025, To appear. SODA 2025 Rapid mixing of global Markov chains via spectral independence: the unbounded degree case A. Blanca and X. Zhang RANDOM 2023 On the tractability of sampling from the Potts model at low temperatures via Swendsen-Wang dynamics A. Blanca and R. Gheissari Probability Theory and Related Fields, 2024, 191, pp. 1121-1168 FOCS 2023 Complexity of high-dimensional identity testing with coordinate conditional sampling A. Blanca, Z. Chen, D. Stefankovic and E. Vigoda ACM Transactions on Algorithms, 2024, 21(1), pp. 1-58 COLT 2023 Fast and perfect sampling of subgraphs and polymer systems A. Blanca, S. Cannon and W. Perkins ACM Transactions on Algorithms, 2023, 20(1), pp. 1-30 RANDOM 2022 Sampling from Potts on random graphs of unbounded degree via random-cluster dynamics A. Blanca and R. Gheissari Annals of Applied Probability, 2023, 33(6B), pp. 4997-5049 RANDOM 2022 The minimizer Jaccard estimator is biased and inconsistent M. Belbasi, A. Blanca, R. Harris, D. Koslicki and P. Medvedev ISMB 2022 On mixing of Markov chains: coupling, spectral independence, and entropy factorization A. Blanca, P. Caputo, Z. Chen, D. Parisi, D. Stefankovic and E. Vigoda Electronic Journal of Probability, 2022, 27(142), pp. 1-42. SODA 2022 The critical mean-field Chayes-Machta dynamics A. Blanca, A. Sinclair and X. Zhang Combinatorics, Probability and Computing, 2022 31(6), pp. 924-975. RANDOM 2021 The Swendsen-Wang dynamics on trees A. Blanca, Z. Chen, D. Stefankovic and E. Vigoda Random Structures & Algorithms, 2023, 62(4): pp. 791-831 RANDOM 2021 Random-cluster dynamics on random regular graphs in tree uniqueness A. Blanca and R. Gheissari Communications in Mathematical Physics, 2021, 386, pp. 1243-1287. Entropy decay in the Swendsen-Wang dynamics on Z^d A. Blanca, P. Caputo, D. Parisi, A. Sinclair and E. Vigoda Annals of Applied Probability, 2021, 32(2), 1018-1057. STOC 2021 The statistics of k-mers from a sequence undergoing a simple mutation process without spurious matches A. Blanca, R. Harris, D. Koslicki and P. Medvedev Journal of Computational Biology, 2022, 29(2), pp. 155-168. RECOMB 2021 Hardness of identity testing for Restricted Boltzmann Machines and Potts models A. Blanca, Z. Chen, D. Stefankovic and E. Vigoda Journal of Machine Learning Research, 2021, 22(152):1−56. COLT 2020 Random-cluster dynamics in Z^2: rapid mixing with general boundary conditions A. Blanca, R. Gheissari and E. Vigoda Annals of Applied Probability, 2020, 30 (1), pp. 418-459. RANDOM 2019 Lower bounds for testing graphical models: colorings and antiferromagnetic Ising models I. Bezakova, A. Blanca, Z. Chen, D. Stefankovic and E. Vigoda Journal of Machine Learning Research, 2020, 21(25), pp. 1−62. COLT 2019 Swendsen-Wang dynamics for general graphs in the tree uniqueness region A. Blanca, Z. Chen and E. Vigoda Random Structures & Algorithms, 2020, 56 (2), pp. 373-400. RANDOM 2018 Sampling in Uniqueness from the Potts and random-cluster models on random regular graphs A. Blanca, A. Galanis, L.A. Goldberg, D. Stefankovic, E. Vigoda and K. Yang SIAM Journal on Discrete Mathematics, 2020, 34 (1), pp. 742-793. RANDOM 2018 Structure learning of H-colorings A. Blanca, Z. Chen, D. Stefankovic and E. Vigoda ACM Transactions on Algorithms, 2020, 16(3), pp. 1-28. ALT 2018 - Best Paper Award Spatial mixing and non-local Markov chains A. Blanca, P. Caputo, A. Sinclair and E. Vigoda Random Structures & Algorithms, 2019, 55(3), pp. 584-614. SODA 2018 Phase coexistence for the hard-core model on Z^2 A. Blanca, Y. Chen, D. Galvin, D. Randall and P. Tetali Combinatorics, Probability and Computing, 2018, pp. 1-22. Random-cluster dynamics in Z^2 A. Blanca and A. Sinclair Probability Theory and Related Fields, 2017, 168 (3), pp. 821-847. SODA 2016 Dynamics for the mean-field random-cluster model A. Blanca and A. Sinclair RANDOM 2015 Phase coexistence and slow mixing for the hard-core model on Z^2 A. Blanca, D. Galvin, D. Randall and P. Tetali RANDOM 2013 On universal cycles for new classes of combinatorial structures A. Blanca and A.P. Godbole SIAM Journal on Discrete Math, 2011, 25 (4), pp. 1832-1842. Teaching Fall 2024: CSE 565 - Algorithm Design and Analysis Fall 2023: CMPSC 465 - Data Structures and Algorithms Spring 2023: CMPSC 497 - Advanced Algorithms Fall 2022: CSE 565 - Algorithm Design and Analysis Spring 2022: CSE 597 - The Markov chain Monte Carlo method Fall 2021: CMPSC 465 - Data Structures and Algorithms Spring 2021: CSE 562 - Probabilistic Algorithms Fall 2020: CSE 565 - Algorithm Design and Analysis Fall 2019: CMPSC 465 - Data Structures and Algorithms Spring 2019: CSE 562 - Probabilistic Algorithms Contact ablanca@cse.psu.edu 311W Westgate Building, Penn State, University Park, PA 16802 Office hours: Wednesdays 3:30 pm to 4:30 pm × Cite Copy Download",
  "content_length": 6121,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:01"
}