{
  "name": "Antonis Dimakis",
  "homepage": "http://nes.aueb.gr/dimakis.html",
  "status": "success",
  "content": "Network Economics and Services Group - Athens University of Economics and Business Home People Archive Papers By Date By Topic Presentations Others Research Contact us Network Economics and Services Group Athens University of Economics and Business People Antonis Dimakis Contact Info Athens University of Economics and Business, Department of Computer Science, 28 Ydras Street, Athens 11362, Greece Office: Tel.: +30 210 8203154 E-mail: dimakis@aueb.gr Studies Ph.D. in \" Electrical Engineering and Computer Sciences\" (2006) University of California at Berkeley Thesis: \"Stability and Approximation of Queueing Networks\". M.Sc. in \"Computer Science\" (1999) University of Crete, Department of Computer Science. B.Sc. in \"Computer Science\" (1996) University of Crete, Department of Computer Science. Research Interests Queueing Theory Applied Probability Optimal Control of Queues and Networks Congestion Control Algorithms for the Internet Selected Publications A. Dimakis, S. Papafragkos. “Resource pooling in CDMA cell-based systems through uplink power control ”. IEEE INFOCOM, San Francisco, California, April 2016. A. Dimakis, S. Papafragkos. “Minimizing queueing delay through CDMA uplink power control ”. IEEE CAMAD, Guildford, Surrey, September 2015. [pdf] C. Courcoubetis, A. Dimakis, M. Kanakakis. “Congestion Control for Background Data Transfers with Minimal Delay Impact”. submitted for publication. [pdf] C. Courcoubetis, A. Dimakis, M. Kanakakis. “Fair Congestion Control for Long-lived Background Flows”. International Conference on Network Games, Control and Optimization, Trento, Italy, October 2014 [pdf] C. Courcoubetis, A. Dimakis, M. Kanakakis. “Designing incentive compatible protocols for background data transfers”. In Communication Systems (ICCS), 2014 IEEE International Conference, (pp. 182-186), IEEE. [pdf] A. Kostopoulos, A. Dimakis, C. Courcoubetis. “Economic Incentives for Adopting Congestion Accountability Protocols”. 26th International Teletraffic Congress (ITC 26), Karlskrona, Sweden, September 2014 [pdf]. A. Dimakis, S. Papafragkos. “Optimizing Queueing Cost and Energy Efficiency in a Wireless Network ”. 12th Intl. Symposium on Modeling and Optimization in Mobile, Ad Hoc, and Wireless Networks, Hammamet, Tunisia 2014 [pdf]. C. Courcoubetis, A. Dimakis. “Fair Background Data Transfers of Minimal Delay Impact ”. IEEE INFOCOM, Orlando, Florida, March 2012. [pdf]. C. Courcoubetis and A. Dimakis. “Tariffs, Mechanisms and Equilibria at a Single Internet Link”. NETCOOP, 2009. [pdf] C. Courcoubetis, A. Dimakis, “Congestion Control and Pricing of Volume Intensive Applications”. ITC 21, Paris, September 2009. [pdf] A. Dimakis and J. Walrand \"Approximating queues in slowly varying stationary environments\", Journal of Applied Probability. A.Dimakis and J. Walrand \"Sufficient conditions for stability of longest-queue-first scheduling: second order properties using fluid limits\", Advances in Applied Probability, vol. 38, no. 2, 2006. C.Courcoubetis, A.Dimakis and G. Stamoulis, \"Traffic equivalence and substitution in a multiplexer with applications to dynamic available capacity estimation\", IEEE/ACM Trans. on Networking, vol. 10, no. 2, 2002. Copyright © 2012 - All Rights Reserved.",
  "content_length": 3231,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:15"
}