{
  "name": "Antonio Toral Ruiz",
  "homepage": "http://antoniotor.al",
  "status": "success",
  "content": "Antonio Toral – Machine Translation, Universitat d'Alacant Skip to content I work as Distinguished Researcher at the Department of Software and Computing Systems, Universitat d’Alacant (Spain). Previously I was an Associate Professor at the Computational Linguistics group, Center for Language and Cognition, Faculty of Arts, University of Groningen (The Netherlands). Prior to starting a faculty position, I was a postdoctoral researcher and research fellow at Dublin City University, and before that a PhD student at Istituto di Linguistica Computazionale and Universitat d’Alacant. I coordinated the Abu-MaTran project, which was flagged by the European Commission as a success story and won the best paper award at MT Summit 2019 for my research on post-editese. My research is in the area of Machine Translation (MT). My main interests include the application of MT to literary texts, MT for under-resourced languages and the computational analysis of translations produced by machines and humans. My current (and recent) work includes: Building literary-adapted MT systems, working with professional human translators to explore the usage of such systems for assistance, and testing the reception of such translations with readers. Analysing quantitatively the characteristics of translations produced by humans and machines, e.g. raw MT, post-edited MT and human translation. Preparing teaching materials about generative AI for language and translation study programmes and industries, in the LT-LiDER project. Selected older work: Enriching parallel corpora for low-resourced European languages (e.g. translation direction) and evaluating such corpora both automatically (by building MT systems) and manually, in the MaCoCu project. Ran a pilot study to assess the feasibility of using Machine Translation to assist with the professional translation of novels by means of post-editing. This study was funded by the EAMT and builds upon our evidence that literary-adapted MT results in promising results for closely-related languages (I, II) Co-ordinated the EU-FP7 Abu-MaTran project, which deals with rapid development of Machine Translation systems for under-resourced languages. As part of the project I co-organised a National Linguistics Olympiad in Spain. Adapted Active Learning to the task of Post-Editing of Machine Translation, which leads to more efficient and less tedious post-editing, as part of a Technology Innovation Development Award from Science Foundation Ireland (SFI-TIDA). Devised a diagnostic evaluation metric for Machine Translation, as part of the CoSyne project. Implemented a web services-based platform for Machine Translation tasks, as part of the PANACEA project. In my PhD thesis I explored the automatic enrichment of linguistic resources (e.g. WordNet) with additional information from the Web 2.0 (e.g. Wikipedia). Search for: Links Google Scholar LinkedIn Twitter Iconic One Theme | Powered by Wordpress",
  "content_length": 2949,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:15"
}