{
  "name": "Antoni B. Chan",
  "homepage": "https://www.cs.cityu.edu.hk/~abchan",
  "status": "success",
  "content": "Prof. Antoni B. Chan Prof. Antoni B. ChanProfessorCity University of Hong Kong Quick Links: Lab Research News Members Prospective Students Publications Google Scholar ORCID Scopus Prof. Antoni B. Chan Professor, Dept. of Computer Science Associate Dean (Research & Postgraduate), College of Computing Deputy Director, Multimedia Engineering Research Centre (MERC) BSc MEng Cornell, PhD UC San Diego SrMIEEE Video, Image, and Sound Analysis Lab (VISAL) Department of Computer Science College of Computing City University of Hong Kong Office: Room AC1-G7311, Yeung Kin Man Academic Building (lift 7) Phone: +852 3442 6509 Fax: +852 3442 0503 Email: abchan at cityu dot edu dot hk News Research Assistant and Technical Assistant positions are available for a project on using ChatGPT in teaching. Details here. Bio Dr. Antoni Chan is a Professor at the City University of Hong Kong in the Department of Computer Science.  Before joining CityU, he was a postdoctoral researcher in the Department of Electrical and Computer Engineering at the University of California, San Diego (UC San Diego).  He received the Ph.D. degree from UC San Diego in 2008 studying in the Statistical and Visual Computing Lab (SVCL). He received the B.Sc. and M.Eng. in Electrical Engineering from Cornell University in 2000 and 2001. From 2001 to 2003, he was a Visiting Scientist in the Computer Vision and Image Analysis lab at Cornell. In 2005, he was a summer intern at Google in New York City. In 2012, he was the recipient of an Early Career Award from the Research Grants Council of the Hong Kong SAR, China. Research Interests [more] Computer Vision, Surveillance, Machine Learning, Explainable AI (XAI), Pattern Recognition, Computer Audition, Music Information Retrieval, Eye Gaze Analysis image captioning, object tracking, dynamic textures, motion segmentation, motion analysis, semantic image annotation, image retrieval, crowd counting, probabilistic graphical models, support vector machines, Bayesian regression, Gaussian processes, semantic music annotation and retrieval, music segmentation, feature extraction. For more information about my current research projects, please visit my lab website. Opportunities for graduate students and research assistants! If you are interested in joining the lab, please check this information. Outstanding non-HK students may also consider applying for the HK PhD fellowship. Recent Publications [more] Video Individual Counting for Moving Drones.Yaowu Fan, Jia Wan, Tao Han, Antoni B. Chan, and Jinhua Ma, In: International Conf. Computer Vision (ICCV), Honolulu, To appear 2025. Temporal Unlearnable Examples: Preventing Personal Video Data from Unauthorized Exploitation by Object Tracking.Qiangqiang Wu, Yi Yu, Chennai Kong, Ziquan Liu, Jia Wan, Haoliang Li, Alex C. Kot, and Antoni B. Chan, In: International Conf. Computer Vision (ICCV), Honolulu, to appear 2025. Explaining Object Detection Through Difference Map.Shujun Xia, Chenyang Zhao, and Antoni B. Chan, In: International Conf Computer Vision (ICCV) 2025 Workshop on Explainable Computer Vision (eXCV), Honolulu, to appear 2025. Large language model tokens are psychologically salient.David A. Haslett, Antoni B. Chan, and Janet H. Hsiao, In: Annual Conference of the Cognitive Science Society (CogSci), San Francisco, to appear Jul 2025. Whose Values Prevail? Bias in Large Language Model Value Alignment.Ruoxi Qi, Gleb Papyshev, Kellee Tsai, Antoni B. Chan, and Janet H. Hsiao, In: Annual Conference of the Cognitive Science Society (CogSci), San Francisco, to appear Jul 2025. Eye movement behavior during mind wandering in older adults.Xiaoru Teng, Gloria Wong, Antoni B. Chan, and Janet H. Hsiao, In: Annual Conference of the Cognitive Science Society (CogSci), San Francisco, to appear Jul 2025. DistinctAD: Distinctive Audio Description Generation in Contexts.Bo Fang, Wenhao Wu, Qiangqiang Wu, YuXin Song, and Antoni B. Chan, In: IEEE/CVF Conf. on Computer Vision and Pattern Recognition (CVPR), June 2025 (highlight). Point-to-Region Loss for Semi-Supervised Point-Based Crowd Counting.Wei Lin, Chenyang Zhao, and Antoni B. Chan, In: IEEE/CVF Conf. on Computer Vision and Pattern Recognition (CVPR), June 2025 (highlight). Advancing Multiple Instance Learning with Continual Learning for Whole Slide Imaging.Xianrui Li, Yufei Cui, Jun Li, and Antoni B. Chan, In: IEEE/CVF Conf. on Computer Vision and Pattern Recognition (CVPR), June 2025 (highlight). Speaker’s Use of Mental Verbs to Convey Belief States: A Comparison between Humans and Large Language Model (LLM) .Ruoxi Qi, Zixuan Wang, Antoni B. Chan, and Janet H. Hsiao, In: 19th International Pragmatics Conference, Brisbane, Jun 2025. Collaborative contrastive learning for cross-domain gaze estimation.Lifan Xia, Yong Li, Xin Cai, Zhen Cui, Chunyan Xu, and Antoni B. Chan, Pattern Recognition, 161:111244, May 2025. Proximal Mapping Loss: Understanding Loss Functions in Crowd Counting & Localization.Wei Lin, Jia Wan, and Antoni B. Chan, In: Intl. Conf. on Learning Representations (ICLR), Singapore, Apr 2025. Another Perspective of Over-Smoothing: Alleviating Semantic Over-Smoothing in Deep GNNs.Jin Li, Qirong Zhang, Wenxi Liu, Antoni B. Chan, and Yang-Geng Fu, IEEE Transactions on Neural Networks and Learning Systems (TNNLS), 36(4):6897-6910, Apr 2025 (online May 2024). Group-based Distinctive Image Captioning with Memory Difference Encoding and Attention.Jiuniu Wang, Wenjia Xu, Qingzhong Wang, and Antoni B. Chan, International Journal of Computer Vision (IJCV), 133:1435-1455, April 2025 (online Oct 2024). Re-Attentional Controllable Video Diffusion Editing.Yuanzhi Wang, Yong Li, Mengyi Liu, Xiaoya Zhang, Xin Liu, Zhen Cui, and Antoni B. Chan, In: AAAI Conference on Artificial Intelligence (AAAI), Philadelphia, Feb 2025. Selected Publications [more] Understanding the role of eye movement consistency in face recognition and autism through integrating deep neural networks and hidden Markov models.Janet H. Hsiao, Jeehye An, Veronica Kit Sum Hui, Yueyuan Zheng, and Antoni B. Chan, npj Science of Learning, 7:28, Oct 2022. PRIMAL-GMM: PaRametrIc MAnifold Learning of Gaussian Mixture Models.Ziquan Liu, Lei Yu, Janet H. Hsiao, and Antoni B. Chan, IEEE Trans. on Pattern Analysis and Machine Intelligence (TPAMI), 44(6):3197-3211, June 2022 (online 2021). [code] Wide-Area Crowd Counting: Multi-View Fusion Networks for Counting in Large Scenes.Qi Zhang and Antoni B. Chan, International Journal of Computer Vision (IJCV), 130(8):1938-1960, Aug 2022. On Distinctive Image Captioning via Comparing and Reweighting.Jiuniu Wang, Wenjia Xu, Qingzhong Wang, and Antoni B. Chan, IEEE Trans. on Pattern Analysis and Machine Intelligence (TPAMI), 45(2):2088-2103, Feb 2023 (online 2022). Kernel-based Density Map Generation for Dense Object Counting.Jia Wan, Qingzhong Wang, and Antoni B. Chan, IEEE Trans. Pattern Analysis and Machine Intelligence (TPAMI), 44(3):1357-1370, Mar 2022. On Diversity in Image Captioning: Metrics and Methods.Qingzhong Wang, Jia Wan, and Antoni B. Chan, IEEE Trans. on Pattern Analysis and Machine Intelligence (TPAMI), 44(2):1035-1049, Feb 2022. A Generalized Loss Function for Crowd Counting and Localization.Jia Wan, Ziquan Liu, and Antoni B. Chan, In: IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), Jun 2021. [supplemental] Eye Movement analysis with Hidden Markov Models (EMHMM) with co-clustering.Janet H. Hsiao, Hui Lan, Yueyuan Zheng, and Antoni B. Chan, Behavior Research Methods, 53:2473-2486, April 2021. Visual Tracking via Dynamic Memory Networks.Tianyu Yang and Antoni B. Chan, IEEE Trans. on Pattern Analysis and Machine Intelligence (TPAMI), 43(1):360-374, Jan 2021. [code] Incorporating Side Information by Adaptive Convolution.Di Kang, Debarun Dhar, and Antoni B. Chan, International Journal of Computer Vision (IJCV), 128:2897-2918, July 2020. Density-Preserving Hierarchical EM Algorithm: Simplifying Gaussian Mixture Models for Approximate Inference.Lei Yu, Tianyu Yang, and Antoni B. Chan, IEEE Trans. on Pattern Analysis and Machine Intelligence (TPAMI), 41(6):1323-1337, June 2019. Beyond Counting: Comparisons of Density Maps for Crowd Analysis Tasks - Counting, Detection, and Tracking.Di Kang, Zheng Ma, and Antoni B. Chan, IEEE Trans. on Circuits and Systems for Video Technology (TCSVT), 29(5):1408-1422, May 2019. Eye Movement Patterns in Face Recognition are Associated with Cognitive Decline in Older Adults.Cynthia Y.H. Chan, Antoni B. Chan, Tatia M.C. Lee, and Janet H. Hsiao, Psychonomic Bulletin & Review, 25(6):2200-2207, Dec 2018. Maximum-Margin Structured Learning with Deep Networks for 3D Human Pose Estimation.Sijin Li, Weichen Zhang, and Antoni B. Chan, International Journal of Computer Vision (IJCV), 122(1):149-168, March 2017. Counting People Crossing a Line using Integer Programming and Local Features.Zheng Ma and Antoni B. Chan, IEEE Trans. on Circuits and Systems for Video Technology (TCSVT), 26(10):1955-1969, Oct 2016. [appendix] Understanding eye movements in face recognition using hidden Markov models.Tim Chuk, Antoni B. Chan, and Janet H. Hsiao, Journal of Vision, 14(11):8, Sep 2014. Clustering hidden Markov models with variational HEM.Emanuele Coviello, Antoni B. Chan, and Gert R.G. Lanckriet, Journal of Machine Learning Research (JMLR), 15(2):697-747, Feb 2014. [code] Clustering Dynamic Textures with the Hierarchical EM Algorithm for Modeling Video.Adeel Mumtaz, Emanuele Coviello, Gert R.G. Lanckriet, and Antoni B. Chan, IEEE Trans. on Pattern Analysis and Machine Intelligence (TPAMI), 35(7):1606-1621, Jul 2013. [appendix] Counting People with Low-Level Features and Bayesian Regression.Antoni B. Chan and Nuno Vasconcelos, IEEE Trans. on Image Processing (TIP), 21(4):2170-2177, May 2012. Generalized Gaussian Process Models.Antoni B. Chan and Daxiang Dong, In: IEEE Conf. Computer Vision and Pattern Recognition (CVPR), Colorado Springs, Jun 2011. [supplemental] Layered dynamic textures.Antoni B. Chan",
  "content_length": 19259,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:52"
}