{
  "name": "Antonio Miele",
  "homepage": "http://home.deib.polimi.it/miele",
  "status": "success",
  "content": "Antonio Miele @ DEIB Home Curriculum Vitae Research Activities Teaching Activities Publications ANTONIO MIELE Associate Professor Contacts: Dipartimento di Elettronica, Informazione e Bioingegneria Via Ponzio 34/5 - 20133 Milano First floor - Room 061 P: +39 02 2399 3513 F: +39 02 2399 3411 @: antonio<dot>miele<at>polimi<dot>it CURRICULUM VITAE I'm an Associate Professor at the Department of Electronics, Information and Bioengineering (DEIB, website), Politecnico di Milano, Milano, Italy. I received a Ph.D. in Information Technology in 2010 from the same institution where I worked as a postdoc Research Assistant from 2010 to 2014 and as an Assistant Professor from 2014 to 2021. During his doctoral studies, I spent a 4-month period at European Space Agency - ESTEC in Nordwjik, Netherlands. Previously, I received the M.Sc. and the B.Sc. in Computer Science Engineering from Politecnico di Milano in 2006 and 2003, respectively. In 2006 I also got an M.Sc. in Computer Science at the University of Illinois at Chicago, USA. I am part of the System Architectures group at DEIB. My main research interests are related to fault tolerance and reliability issues in digital computing systems and to self-adaptive approaches for runtime resource management in heterogeneous multi-/many-core systems. In the past I also worked on FPGA-based systems design, and context-aware data personalization. I'm co-author of more than 100 scientific publications in international conference proceedings and selected journals. I have served as Program Chair of the International Symposium on Defect and Fault Tolerance in VLSI and Nanotechnology Systems (DFT) in 2016 and in 2017; moreover, I have been a DATE Topic Chair from 2018 to 2021 and in 2026, and the Interactive Presentation chair for the same conference in 2022. I serve as associate editor of the IEEE Transactions on VLSI Systems and the Elsevier Microprocessors and Microsystems journal, and I have served as Guest co-Editor 2 special issues focusing on fault tolerance in digital systems, one in the IEEE Transactions in Emerging Topics in Computing (2016-2017 and published in 2020) and one in the IET Computers & Digital Techniques (2017-2018, published in 2019). Finally, I'm part of the technical program committees of various conferences, such as DATE, DFT, FPL, IOLTS, ARC, DSD. I actively participate in various national and EU-funded projects: \"SAVE\" FP7 STREP project (2013-2016), \"SMECY\" EU-ARTEMIS project (2010-2013), \"SCALOPES\" EU-ARTEMIS project (2009-2010) and a MIUR-PRIN 2008 project (2010-2012). Recent research activities on fault tolerance in image processing and machine learning applications and on runtime resource management in distributed edge systems have been supported by Intel Corporation and Huawei, respectively. Download the complete curriculum vitae in PDF format here. RESEARCH ACTIVITIES My current research interests are briefly reported here. Various thesis proposals are available on these topics; interested M.Sc. students may contact me for further details. Design and analysis of dependable computing systems Dependability aspects play a relevant role in computing systems' design due to their pervasiveness in today's life. Moreover, the susceptibility of digital systems to faults, transient ones mainly caused by environmental phenomena (such as radiations) and permanent ones due to aging and wear-out effects, has increased due to the aggressive technological scaling. In this scenario, I have spent more than 15 years investigating novel approaches for the dependability-aware design and analysis of digital computing systems, considering various platforms, applications, and working scenarios. Recently, I've been focusing on the dependability issues of systems running deep learning applications. In this field, ongoing research activities are devoted to: Error modeling and simulation for image processing and deep learning applications Hardening of image processing and deep learning applications Energy-aware tuning write current in STT-MRAMS for approximate computing applications Runtime resource management in multi-/many-core systems Modern system architectures are very complex and composed of several heterogeneous computing resources. At the same time, the executed workload is frequently variable in time and consists of multiple applications with different performance requirements entering and leaving the system with an unknown trend. In this scenario, I'm investigating novel self-adaptive approaches for runtime resource management aimed at distributing the workload on the available processing resources and tuning architectural knobs to optimize competing objectives (e.g., performance vs. power consumption vs. lifetime reliability). The main topics of the ongoing research activities are: Combined application autotuning and runtime resource management for heterogeneous systems Dynamic lifetime reliability management in many-core systems Runtime resource management in distributed systems for edge computing TEACHING ACTIVITIES 2025 - 2026 GPUs and Heterogeneous Systems (Programming models and architectures) - Lecturer Fondamenti di Informatica - Lecturer Reti Logiche - Lecturer Reti Logiche - Teaching assistant Prof. Gianluca Palermo 2024 - 2025 Fondamenti di Informatica - Lecturer Reti Logiche - Lecturer Reti Logiche - Teaching assistant Prof. Gianluca Palermo 2023 - 2024 Dependable Computing Systems - Lecturer together with Prof. Cristiana Bolchini and Prof. Luca Cassano GPUs and Heterogeneous Systems (Programming models and architectures) - Lecturer Fondamenti di Informatica - Lecturer Reti Logiche - Lecturer Reti Logiche - Teaching assistant Prof. Gianluca Palermo 2022 - 2023 Fondamenti di Informatica - Lecturer Reti Logiche - Lecturer Reti Logiche - Teaching assistant Prof. Gianluca Palermo 2021 - 2022 Reliable Computing Systems - Lecturer together with Dr. Luca Cassano and Prof. Cristiana Bolchini. GPUs and Heterogeneous Systems (Programming models and architectures) - Lecturer Fondamenti di Informatica - Lecturer Reti Logiche - Lecturer Reti Logiche - Teaching assistant Prof. Gianluca Palermo 2020 - 2021 Advanced Topics on Heterogeneous System Architectures - Lecturer together with Prof. Marco Santambrogio. Fondamenti di Informatica - Lecturer Reti Logiche - Lecturer Reti Logiche - Teaching assistant Prof. Gianluca Palermo 2019 - 2020 Fondamenti di Informatica - Lecturer Reti Logiche - Lecturer Reti Logiche - Teaching assistant Prof. Gianluca Palermo 2018 - 2019 Advanced Topics on Reconfigurable FPGA-based Systems Design - Lecturer together with Prof. Marco Santambrogio. Informatica - Lecturer Reti Logiche - Lecturer Reti Logiche - Teaching assistant Prof. Gianluca Palermo 2017 - 2018 Advanced Topics on Heterogeneous System Architectures - Lecturer together with Prof. Marco Santambrogio. Informatica - Lecturer Reti Logiche - Teaching assistant Prof. Gianluca Palermo 2016 - 2017 Advanced Topics on Reconfigurable FPGA-based Systems Design - Lecturer together with Prof. Marco Santambrogio. Informatica - Lecturer Reti Logiche - Teaching assistant Prof. Gianluca Palermo 2015 - 2016 Heterogeneous System Architectures - Lecturer at University of Turku (Finland) Advanced Topics on Heterogeneous System Architectures - Lecturer together with Prof. Marco Santambrogio. Informatica B - Lecturer Reti Logiche - Teaching assistant Prof. Gianluca Palermo 2014 - 2015 Informatica B - Lecturer Reti Logiche - Teaching assistant Prof. Cristiana Bolchini 2013 - 2014 Informatica B - Contract professor Reti Logiche - Teaching assistant Prof. Cristiana Bolchini 2012 - 2013 Informatica (per Aerospaziali) - Teaching assistant Prof. Fausto Distante Reti Logiche - Teaching assistant Prof. Cristiana Bolchini Fondamenti di Informatica - Teaching assistant Prof. Cristiana Bolchini Fondamenti di Informatica - Lab. supervisor Prof. Cristiana Bolchini 2011 - 2012 Dependable Systems - Teaching assistant Prof. Cristiana Bolchini Informatica (per Aerospaziali) - Teaching assistant Prof. Fausto Distante Reti Logiche - Teaching assistant Prof. Cristiana Bolchini Fondamenti di Informatica - Lab. supervisor Prof. Cristiana Bolchini 2010 - 2011 Informatica (per Aerospaziali) - Teaching assistant Prof. Fausto Distante Reti Logiche - Teaching assistant Prof. Cristiana Bolchini Fondamenti di Informatica - Lab. supervisor Prof. Cristiana Bolchini 2009 - 2010 Reti Logiche - Teaching assistant Prof. Cristiana Bolchini Fondamenti di Informatica - Lab. supervisor Prof. Cristiana Bolchini 2007 - 2008 Laboratorio Software - Teaching assistant Prof. Cristiana Bolchini Informatica B (per Ingegneria Fisica) - Teaching assistant Prof. Lorenzo Mezzalira 2006 - 2007 Informatica B - Teaching assistant Prof. Fausto Distante Informatica B (per Ingegneria Fisica) - Teaching assistant Prof. Lorenzo Mezzalira PUBLICATIONS International Journals C. Bolchini, A. Bosio L. Cassano, A. MIELE, S. Pappalardo, D. Passarello and A. Ruospo, E. Sanchez M. Sonza Reorda, V. Turco: Benchmark Suite for Resilience Assessment of Deep Learning Models. In IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, Early access. Z. Taufique, A. Kanduri, A. MIELE, A. Rahmani, C. Bolchini, N. Dutt, P. Liljeberg: Exploiting Approximation for Run-time Resource Management of Embedded HMPs. In ACM Transactions on Embedded Computing Systems, Vol. 24(3), no. 39, pp. 1-30, May 2025. S. Shahsavari, M.H. Haghbayan, A. MIELE, E. Immonen, J. Plosila: A Coordinated Approach to Control Mechanical and Computing Resources in Mobile Robots. In IEEE Transactions on Robotics, Vol. 41, pp. 347-363, 2025. C. Bolchini, L. Cassano, A. MIELE: Resilience of deep learning applications: A systematic literature review of analysis and hardening techniques. Computer Science Reviews, Vol. 54, no. 100682, pp. 1-21, October 2024. M.H. Haghbayan, A. MIELE, O. Mutlu, J. Plosila: Run-Time Resource Management in CMPs Handling Multiple Aging Mechanisms. In IEEE Transaction",
  "content_length": 38328,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:09"
}