{
  "name": "Antonios Gouglidis",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/antonios-gouglidis",
  "status": "success",
  "content": "Antonios Gouglidis - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Dr Antonios Gouglidis FHEA Senior Lecturer Research Overview Antonio's research aims at the integration between theoretical and applied security towards designing secure systems and protecting them. He has a background in theoretical informatics and experience working in the industry. This combination is prerequisite good basis for conducting notable research, while proposing practical solutions. Although he has an interest in several aspects of security, he is currently conducting research in the areas of access control models, policies and systems, Cloud security, Critical Infrastructure Protection (CIP), and formal verification (model checking). Publications Projects PhD Students Research Groups Vehicle systems check (student - Aditya Singh) 02/06/2025 → 01/09/2025 Research SL:H2020 SANCUS: analysis software scheme of uniform statistical sampling, audit and defence processes 01/09/2020 → 30/11/2023 Research SL:H2020 SANCUS: analysis software scheme of uniform statistical sampling, audit and defence processes 01/09/2020 → 30/11/2023 Research BEIS: Nuclear Research and Development Programme: Research and Development of Reactor Design - Operational Technology Management After Cyber Incident 01/01/2019 → 31/07/2022 Research Enable Ancillary Services bY Renewable Energy Sources 01/03/2018 → 31/12/2021 Research Towards Ultimate Convergence of All Networks 01/10/2017 → … Other Resilient communication services protecting end-user applications from disaster-based failures 01/03/2016 → 29/02/2020 Research Economics of Assurance Activities 01/01/2015 → 31/03/2015 Other Hybrid Risk Management for Utility Providers 01/04/2014 → 30/09/2017 Other Ovini Gunasekera PhD student Security Lancaster, Security Lancaster (Distributed Systems), Security Lancaster (Software Security) enable JavaScript to view email address Igor Ivkic PhD student enable JavaScript to view email address Cyber Security Research Centre (Security Group) SCC (Security) Security Lancaster Security Lancaster (Academic Centre of Excellence) Security Lancaster (Distributed Systems) Security Lancaster (Software Security) Security Lancaster (Systems Security) Back to listing Contact Details Department: Computing and Communications Office: B54, B - Floor, InfoLab21 TelTelephone: enable JavaScript to view email address Back to listing",
  "content_length": 2645,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:13"
}