{
  "name": "Anton Eliëns",
  "homepage": "http://vu-nl.academia.edu/AntonEli%C3%ABns",
  "status": "success",
  "content": "Anton Eliëns - Vrije Universiteit Amsterdam Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Anton EliënsVrije Universiteit Amsterdam, Computer Science, Faculty MemberaddFollowdoneFollowingFollowers35Following7Co-authors6Public ViewsRelated Authors tatja scholteUniversity of Amsterdam Zhisheng Huang Ysbrand Hummelen Zhisheng Huang Elly A KonijnVrije Universiteit Amsterdam Dhaval VyasThe University of Queensland, Australia Gerrit van der VeerOpen University The Netherlands Liliana Coutinho Vivian van SaazeMaastricht University, Faculty of Arts and Social Sciences Pavel SmetanaInterests UploadsPapers by Anton EliënsNavigating media-rich information spaces using concept graphs : the abramovic dossierNavigating media-rich information spaces usually involves switching back and forth between catego... more Navigating media-rich information spaces usually involves switching back and forth between categories and lists indexing the material and the actual media presentations. In this paper, we describe a multidisciplinary case study of creating a digital dossier to present a collection of artworks and related information in a more immersive manner, using a concept graph for navigation. The case study is done for the artworks of the Serbian-Dutch performance artist Marina Abramovic, in cooperation with the Dutch Institute for Cultural heritage. In the paper, we describe the design requirements, as well as the technical realization of the abramovic dossier. Based on an initial user evaluation, we also indicate directions for future research, and discuss the style criteria for the user interface of our digital dossier(s).Download So Many Users — So Many PerspectivesSpringer eBooks, 1998Visualization -the transformation of data and information into multimedia including pictures, ani... more Visualization -the transformation of data and information into multimedia including pictures, animation and 3D scenes -enables users to understand information more naturally. It reveals patterns and relations in the information which may otherwise remain hidden. As a consequence, it can provide a single user with enough valuable information to support decision making. In addition to this, visualization can also be used to explain information to other people. In this case, the results of visualization are deployed as arguments in collaborative decision making. This paper discusses a distributed visualization architecture which supports collaborative decision making. The architecture is designed with the following consideration in mind: \"multiple users, with different information needs, require multiple views or perspectives of the data.\" Additionally, in order to support the cooperation between users during the decision making process, we extend the architecture with collaborative aspects including session management, and the exchange of visualization perspectives.Download ECA Perspectives - Requirements, Applications, TechnologyIn the last years we have developed a platform for the realization of embodied (conversational) a... more In the last years we have developed a platform for the realization of embodied (conversational) agents, in a distributed logic programming framework. In this paper we will present an overview of our work, by discussing the requirements that acted as our guidelines for design decisions during development, some of the applications that have served as target demonstrators for developing and testing new functionality, and the (distributed logic programming) technology which we used for the realization of the platform and the implementation of our STEP scripting language. Although the focus of our paper will primarily be our own DLP+X3D platform, we believe that our discussion along the perspectives of requirements, applications and technology might be more generally worthwhile in establishing the relative merits of the operational use of ECA-technology. At the end of this paper, we will moreover provide some hints of how to approach the experimental validation of the (possible) benefits...Download Mashups in second life at VUGAME-ON 2007, 2007 VU at Second Life: Creating a (virtual) community of learnersIn this paper we report on our experiences in creating presence for our university in the Second ... more In this paper we report on our experiences in creating presence for our university in the Second Life environment. After a brief explanation of our motivation(s), we will describe our approach, which resulted in creating a virtual campus acting both as a portal for information, and, more importantly, as a meeting point, offering the opportunity to create a virtual community of learners, in line with the overall educational policy of our university. We will discuss the merits of Second Life as an educational platform, and indicate relevant research perspectives. To illustrate how the virtual meets the real, an impression will be given of our encounters with the press.Download An ontology for task models VU @ Second Life: A Report on Experiences with the Development of a (Virtual) Community of LearnersVirtual Social Networks, 2009Online virtual worlds have been present for more than ten years and the recent substantial media ... more Online virtual worlds have been present for more than ten years and the recent substantial media attention on Second Life can be considered an indication that virtual worlds are no longer the domain of a selective group of fanatical online gamers. For example, the number of registered residents in Second Life increased from two million at the beginning of 2007 to more than 12 million in February 2008, at times even reaching a growth of 1 million new registrations a month.1 Big companies such as Reebok, IBM, Philips, Randstad, and ABN AMRO organize press meetings to announce their presence in virtual worlds. Even governments, municipalities, and NGOs have entered Second Life with an eagerness comparable to the ‘don’t miss the boat’ feeling experienced during the early days of the Internet. Rate, Recommend, Regret - an Expert-based Approach to the Personalization of Guided ToursIn this paper we propose an approach to generate personalized guided tours based on a finite coll... more In this paper we propose an approach to generate personalized guided tours based on a finite collection of tours obtained by tracking the navigation of expert users. Our proposal is based on a variant of decision theory, that uses a regret function to measure the difference between a proposed decision and a finite collection of expert decisions, generalized to a finite sequence of discrete choices. Personalization may then be seen as a minimization problem over a weighting scheme, expressing the relative importance of experts of which tours are available. We illustrate our approach by showing how we may obtain guided tours in 3D digital dossiers containing information on contemporary art installations, and discuss how our approach may be applied in other cultural heritage applications.Download Exploration and guidance in media-rich information spaces : the implementation and realization of guided tours in digital dossiersConfronted with media-rich information spaces involves interfaces that are usually designed to fa... more Confronted with media-rich information spaces involves interfaces that are usually designed to facilitate personal exploration to locate information of interest. Navigating such media-rich information spaces, where information structures can be complex, may result in disorientation and demotivation. The need of suited approaches able to support the exploration of such media-rich archives has motivated the development of several types of guidedDownload 1a) Project: Intelligent MultiMEDIA Transactions Environment 1b) Project Acronym: IMMEDIATEDownload A High-Level Symbolic Language for Distributed Web ProgrammingDownload Exploring community building with an awareness displayProceedings of the 4th International Conference on PErvasive Technologies Related to Assistive Environments, 2011In this paper, we present a field trial of a pervasive system called Panorama that is aimed at su... more In this paper, we present a field trial of a pervasive system called Panorama that is aimed at supporting social awareness in work environments. Panorama is an intelligent situated display in the staff room of an academic department. It artistically represents non-critical user generated content such as images from holidays, conferences and other social gatherings, as well as textual messages on its display. It also captures images and videos from different public spaces of the department and streams them onto the Panorama screen, using appropriate abstraction techniques. We studied the use of Panorama for two weeks and observed how Panorama affected staff members' social awareness and community building. We report that Panorama simulated curiosity and learning, initiated new interactions and provided a mechanism for cherishing old memories.Download A taxonomy of web agentsProceedings 11th International Workshop on Database and Expert Systems ApplicationsIn this paper we propose a taxonomy of web agents, which encompasses agents that provide a text-b... more In this paper we propose a taxonomy of web agents, which encompasses agents that provide a text-based interface to for example information retrieval services as well as avatarembodied guides that help visitors to navigate in virtual environments. Our taxonomy must be regarded as an instrument to delineate targets for research and the realization of prototype applications that demonstrate the usefulness of agent-based intelligence on the Web. In addition, we deploy our agent-taxonomy to establish the implicatio",
  "content_length": 16836,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:49"
}