{
  "name": "Antonino Furnari",
  "homepage": "http://www.antoninofurnari.it",
  "status": "success",
  "content": "Antonino Furnari Antonino FurnariAssociate ProfessorUniversity of CataniaDepartment of Mathematics and Computer ScienceImage Processing LaboratoryNext Vision s.r.l. HOMEAbout MeI am an Associate Professor at the Department of Mathematics and Computer Science of the University of Catania, where I am a member of the Image Processing Laboratory (IPLAB).My expertise lies in Computer Vision and Machine Learning. Specifically, my research investigates how intelligent systems can perceive, understand, and anticipate human actions and interactions directly from an embodied, egocentric viewpoint, to enable assistive technologies on wearable devices that provide direct support to users. See this page for selected research highlights and this page for the full list of publications.I teach a Bachelor course on Fundamentals of Data Analysis and a Master Course on Deep Learning. I supervised more than 30 bachelor and master theses and supervised/currently supervising 8 PhD students.Here is a bio page that can be used for talks.Recent and Upcoming Talks20 Oct. 2025Action-Centric Graphs for Procedural Video Understanding - ICCV 2025 Workshop on Scene Graphs and Graph Representation Learning19 Oct. 2025From Observation to Intervention: Mistake Detection and Procedural Assistance in Egocentric Vision - ICCV 2025 Workshop on AI-driven Skilled Activity Understanding, Assessment & Feedback Generation16 Sept. 2025Egocentric Vision in the Kitchen: From Interaction Prediction to Recipe‑Level Understanding - AICV4Food workshop @ ICIAP 202521 July 2025Learning to Act like a Pro: Discovering Procedural Models of Expert Workflows for Assistance and Validation - AMBEATion Workshop17 July 2023Learning to See the World from an Egocentric Perspective - Universidad Carlos III de Madrid (UC3M)See All TalksNewsNov 2025The Ego-Exo4D IJCV extension is out: https://link.springer.com/article/10.1007/s11263-025-02557-6.Oct 2025Organizing the Thirteenth International Workshop on Assistive Computer Vision and Robotics (ACVR) in conjunction with ICCV 2025Sep 2025Our paper “How Far Can Off-the-Shelf Multimodal Large Language Models Go in Online Episodic Memory Question Answering?” by Giuseppe Lando, Rosario Forte, Giovanni Maria Farinella, and Antonino Furnari, has been awarded the best student paper award at the 23rd International Conference on Image Analysis and Processing (ICIAP 2025).Sep 2025Three papers accepted for publication at the IEEE Winter Conference on Application of Computer Vision (WACV) 2026:Zaira Manigrasso, Matteo Dunnhofer, Antonino Furnari, Moritz Nottebaum, Antonio Finocchiaro, Davide Marana, Rosario Forte, Giovanni Maria Farinella, Christian Micheloni (2026). Online Episodic Memory Visual Query Localization with Egocentric Streaming Object Memory. In IEEE Winter Conference on Application of Computer Vision (WACV).Michele Mazzamuto, Daniele Di Mauro, Gianpiero Francesca, Giovanni Maria Farinella, Antonino Furnari (2026). ProSkill: Segment-Level Skill Assessment in Procedural Videos. In IEEE Winter Conference on Application of Computer Vision (WACV).Francesco Ragusa, Michele Mazzamuto, Rosario Forte, Irene D’Ambra, James Fort, Jakob Engel, Antonino Furnari, Giovanni Maria Farinella (2026). Ego-EXTRA: video-language Egocentric Dataset for EXpert-TRAinee assistance. In IEEE Winter Conference on Application of Computer Vision (WACV).Sep 2025I will be serving as an Area Chair for CVPR 2026.Sep 2025I’ll be giving two talks at the following ICCV 2025 Workshops:October 19: ICCV 2025 Workshop on AI-driven Skilled Activity Understanding, Assessment & Feedback Generation.October 20: Workshop on Scene Graphs and Graph Representation Learning.Jul 20257 papers accepted at the 23rd International Conference on Image Analysis and Processing (ICIAP 2025)!Of these, 3 have been accepted for oral presentation, 2 as posters, and 2 in the workshops.Oral Presentations:Catinello, A. S., Farinella, G. M., & Furnari, A. (2025). Mamba-OTR: a Mamba-based Solution for Online Take and Release Detection from Untrimmed Egocentric Video.Finocchiaro, A., Farinella, G. M., & Furnari, A. (2025). Efficient Calisthenics Skills Classification through Foreground Instance Selection and Depth Estimation.Lando, G., Forte, R., Farinella, G. M., & Furnari, A. (2025). How Far Can Off-the-Shelf Multimodal Large Language Models Go in Online Episodic Memory Question Answering?Poster Presentations:Catinello, A. S., Dunnhofer, M., Farinella, G. M., Frontoni, E., Furnari, A., Micheloni, C., Paolanti, M., Pietrini, R., Salierno, D., Stacchio, L., & Yaar, A. (2025). Ego and exo views for an object-level human behavior analysis and understanding through tracking in retail spaces.Manigrasso, Z., Finocchiaro, A., Manara, D., Forte, R., Nottebaum, M., Dunnhofer, M., Farinella, G. M., Furnari, A., & Micheloni, C. (2025). T-EVO: Tracking in Egovision for Online Visual Episodic Memory.Workshop Papers:Yaar, A., Rodin, I., Farinella, G. M., & Furnari, A. (2025). A Benchmark of Egocentric Scene Graph Prediction Methods for Understanding Human-Object Interactions.Finocchiaro, A., Catinello, A. S., Mazzamuto, M., Leonardi, R., Furnari, A., & Farinella, G. M. (2025). A Real-Time System for Egocentric Hand-Object Interaction Detection in Industrial Domains.Full program here.Jul 2025I gave a week-long seminar on Video Understanding at Universidad Carlos III de Madrid to the students of the PhD in Signal Processing and Communications Engineering.Jul 2025Serving as an Area Chair for WACV 2026.Jun 2025Organizing the Second Joint Workshop on Egocentric Vision (EgoVis) in conjunction with CVPR 2025See All NewsResearch HighlightsShort list of selected research projects. Click here for a full list. Click here for the full list of publications. @inproceedings{mazzamuto2025gazing, author = {Mazzamuto, Michele and Furnari, Antonino and Sato, Yoichi and Farinella, Giovanni Maria}, booktitle = {IEE/CVF Conference on Computer Vision and Patter Recognition}, title = {Gazing Into Missteps: Leveraging Eye-Gaze for Unsupervised Mistake Detection in Egocentric Videos of Skilled Human Activities}, pdf = {https://arxiv.org/pdf/2406.08379.pdf}, year = {2025} } @inproceedings{seminara2024differentiable, author = {Seminara, Luigi and Farinella, Giovanni Maria and Furnari, Antonino}, booktitle = {Advances in Neural Information Processing Systems}, title = {Differentiable Task Graph Learning: Procedural Activity Representation and Online Mistake Detection from Egocentric Videos}, pdf = {https://arxiv.org/pdf/2406.01486.pdf}, url = {https://github.com/fpv-iplab/Differentiable-Task-Graph-Learning}, year = {2024} } @inproceedings{mur-labadia2024AFF-ttention, pdf = { https://arxiv.org/pdf/2406.01194.pdf }, year = { 2024 }, booktitle = { European Conference on Computer Vision (ECCV) }, title = { AFF-ttention! Affordances and Attention models for Short-Term Object Interaction Anticipation }, author = { Lorenzo Mur-Labadia and Ruben Martinez-Cantin and Josechu Guerrero and Giovanni Maria Farinella and Antonino Furnari }, url = {https://github.com/lmur98/AFFttention} } @inproceedings{quattrocchi2024synchronization, pdf = { https://arxiv.org/pdf/2312.02638.pdf }, year = { 2024 }, booktitle = { European Conference on Computer Vision (ECCV) }, title = { Synchronization is All You Need: Exocentric-to-Egocentric Transfer for Temporal Action Segmentation with Unlabeled Synchronized Video Pairs }, author = { Camillo Quattrocchi and Antonino Furnari and Daniele Di Mauro and Mario Valerio Giuffrida and Giovanni Maria Farinella }, url = {https://github.com/fpv-iplab/synchronization-is-all-you-need} } @article{quattrocchi2024synchronization, url = { https://github.com/fpv-iplab/synchronization-is-all-you-need }, author = { Camillo Quattrocchi and Antonino Furnari and Daniele Di Mauro and Mario Valerio Giuffrida and Giovanni Maria Farinella }, title = { Exocentric-to-Egocentric Adaptation for Temporal Action Segmentation with Unlabeled Synchronized Video Pairs}, journal = { International Journal on Computer Vision (IJCV) }, year = { 2025 } } @inproceedings{leonardi2024synthetic, pdf = { https://arxiv.org/pdf/2312.02672.pdf }, year = { 2024 }, booktitle = { European Conference on Computer Vision (ECCV) }, title = { Are Synthetic Data Useful for Egocentric Hand-Object Interaction Detection? }, author = { Rosario Leonardi and Antonino Furnari and Francesco Ragusa and Giovanni Maria Farinella }, url = {https://github.com/fpv-iplab/HOI-Synth} } @inproceedings{flaborea2024PREGO, year = { 2024 }, booktitle = { Conference on Computer Vision and Pattern Recognition (CVPR) }, title = { PREGO: online mistake detection in PRocedural EGOcentric videos }, author = { Alessandro Flaborea and Guido D'Amely and Leonardo Plini and Luca Scofano and Edoardo De Matteis and Antonino Furnari and Giovanni Maria Farinella and Fabio Galasso }, pdf={https://arxiv.org/pdf/2404.01933.pdf}, url={https://github.com/aleflabo/PREGO?tab=readme-ov-file} } @inproceedings{grauman2023egoexo4d, primaryclass = { cs.CV }, archiveprefix = { arXiv }, eprint = { 2311.18259 }, pdf = { https://arxiv.org/pdf/2311.18259.pdf }, url = { https://ego-exo4d-data.org/ }, year = { 2024 }, booktitle = { Conference on Computer Vision and Pattern Recognition (CVPR) }, title = { Ego-Exo4D: Understanding Skilled Human Activity from First- and Third-Person Perspectives }, author = { Kristen Grauman and Andrew Westbury and Lorenzo Torresani and Kris Kitani and Jitendra Malik and Triantafyllos Afouras and Kumar Ashutosh and Vijay Baiyya and Siddhant Bansal and Bikram Boote and Eugene Byrne and Zach Chavis and Joya Chen and Feng Cheng and Fu-Jen Chu and Sean Crane and Avijit Dasgupta and Jing Dong and Maria Escobar and Cristhian Forigua and Abrham Gebreselasie and Sanjay Haresh and Jing Huang and Md Mohaiminul Islam and Suyog Jain and Rawal Khirodkar and Devansh Kukreja and Kevin J Liang and Jia-Wei Liu and Sagnik Majumder and Yongsen Mao and Miguel Martin and Effrosyni Mavroudi and Tushar Nagarajan and Fran",
  "content_length": 23958,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:58"
}