{
  "name": "Antonio Bianchi",
  "homepage": "https://antoniobianchi.me",
  "status": "success",
  "content": "Antonio Bianchi Search Antonio Bianchi Associate Professor Purdue University Biography I am an Associate Professor at Purdue University in the Computer Science Department and co-founder of the PurSec Lab. My research interests span the domains of software and systems security. Specifically, I am currently focusing on enhancing the security of edge devices, such as smartphones, IoT devices, drones, and embedded systems. Within this area, my work is dedicated to designing and developing innovative automated methodologies and tools that identify vulnerabilities, remediate them, and prevent future occurrences. To achieve these goals, I have developed novel techniques in program analysis, binary analysis, fuzzing, reverse engineering, program repair, and binary patching. Additionally, I have performed several user studies, involving both developers and end-users, to evaluate the usability of the proposed solutions. As a core member of the Shellphish, OOO , and Nautilus teams, I played and organized many security competitions (CTFs), and I won the third place at the DARPA Cyber Grand Challenge. I am looking for interns, PhD students, and Postdocs working in the areas of Mobile Authentication, IoT, Trustzone, and Binary Analysis. Please contact me if you are interested. Interests Computer Security Systems Security Software Security Mobile Security Android IoT Security Binary Analysis Embedded Systems Security CTF Education PhD in Computer Science, 2018 UC Santa Barbara MSc in Computer Science, 2012 University of Illinois at Chicago MSc in Computer Engineering, 2012 Politecnico di Milano Recent Posts Solving Defcon Quals 2019 VeryAndroidoso using angr Antonio Bianchi May 28, 2019 Defcon Quals 2019: ASRybaB Antonio Bianchi May 27, 2019 iCTF 2013: mathconsole Antonio Bianchi Dec 10, 2013 See all Cite × Copy Download",
  "content_length": 1837,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:57"
}