{
  "name": "Antti Oulasvirta",
  "homepage": "http://users.comnet.aalto.fi/oulasvir",
  "status": "success",
  "content": "Antti Oulasvirta Aalto.fi elec.aalto.fi dice.aalto.fi Antti Oulasvirta Prof. Antti Oulasvirta Antti Oulasvirta leads the Computational Behavior Lab (cbl.aalto.fi) at Aalto University and the Interactive AI research program at FCAI (Finnish Center for AI). Prior to joining Aalto, he was a Senior Researcher at the Max Planck Institute for Informatics and the Cluster of Excellence on Multimodal Computing and Interaction at Saarland university. He received his doctorate in Cognitive Science from the University of Helsinki in 2006, after which he was a Fulbright Scholar at the School of Information in University of California-Berkeley in 2007-2008 and a Senior Researcher at Helsinki Institute for Information Technology HIIT in 2008-2011. During his postgraduate studies in 2002-2003, he was an exchange student at UC Berkeley's Neuropsychology Lab. He was awarded the ERC Starting Grant (2015-2020) for research on computational design of user interfaces and the ERC Advanced Grant (2024-2029) for studying computational models of human behavior. Dr. Oulasvirta serves as an associate editor for ACM TOCHI and has previously served International Journal of Human-Computer Studies and IEEE Computer. He frequently participates in the paper committees of HCI conferences, including the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI). His work has been awarded the Best Paper Award and Best Paper Honorable Mention at CHI sixteen times between 2008 and 2025. He has held keynote talks at NordiCHI'14, CoDIT'14, EICS'16, IHCI'17, ICWE'19, Chinese CHI'19, and IS-EUD'23. He is a Fellow of ELLIS (European Laboratory for Learning and Intelligent Systems). In 2019, he was invited to the Finnish Academy of Science and Letters and in 2025 to the CHI Academy. He was a SICSA Distinguished Visiting Fellow in 2011 and in 2022. Research Lead Computational Behavior Lab at Aalto University Interactive AI research programme at FCAI Publications Full publication list in Scholar Books Introduction to Human-Computer Interaction (co-authored, Oxford University Press, 2025) Bayesian Methods for Interaction and Design (edited, Cambridge University Press, 2022) Computational Interaction (edited, Oxford University Press 2018) Awards and Recognition 2025 CHI Best Paper Honorable Mention 2024 CHI Best Paper Honorable Mention x 2 2024 Nordic Mensa Award for Best Articles 2022 SICSA Distinguished Visiting Fellow 2022 CHI Best Paper Honorable Mention x 2 2019 Invited to the Finnish Academy of Science and Letters 2019 MobileHCI Best Paper Honorable Mention 2019 Member of ELLIS (European Laboratory of Learning and Intelligent Systems) 2018 CHI Best Paper Honorable Mention x 2 2017 CHI Best Paper Award x 2 2016 CHI Best Paper Award 2015 CHI Best Paper Award 2015 CHI Best Paper Honorable Mention 2014 CHI Best Paper Honorable Mention 2013 CHI Best Paper Honorable Mention 2013 MUM Best Paper Nomination 2013 MobileHCI Most Influential Paper Award 2011 CHI Best Paper Award 2011 MobileHCI Best Note Award 2011 SICSA Distinguished Visiting Fellow 2009 CHI Best Paper Honorable Mention 2008 CHI Best Paper Honorable Mention Teaching We organize a Human-Computer Interaction major in the CCIS Master's program, with a specialization in computational methods. Key courses: ELEC-E7851 Computational Design and Interaction (our group's flagship course) ELEC-D7011 Human Factors Engineering (introduction to human factors engineering) ELEC-E7861 Research Project in Human-Computer Interaction (capstone course of the major) ELEC-E7870 Advanced Topics in Human-Computer Interaction See Aalto MyCourses for details. We often haev exciting Master's thesis topics. To inquire topics, please email me with your CV, study transcript, and letter of interest. We also offer internship possiblities for Aalto and foreign students via ASCI. Postdocs and PhD Students Postdocs (current and former) Dr. Thomas Langerak, human models and haptics (joined from ETH) Dr. Yinuo Du, behavioral modeling in cybersecurity (joined from CMU) Dr. Shuai Ma, AI for decision-making (joined from HKUST) Dr. Francisco Erivaldo Fernandes Jr., ML engineering for behavioral models Dr. Joon-Gi Shin, creativity and generative AI (joined from KAIST) Dr. Danqing Shi, visualization and behavioral modeling (joined from Tongi) Dr. Hee-Seung Moon, intelligent ML (now at Chungnam National University) Dr. Suyog Chandramouli, cognitive science (now at Princeton) Dr. Zhenhui Peng, intelligent systems (now prof at Sun Yat-Sen University) Dr. Xiuli Chen, cognitive science (now at Yelp!) Dr. Aurelien Nioche, cognitive science (now at Glasgow Uni) Dr. Kashyap Todi, interactive systems (now at Meta) Dr. Luis Leiva, human-computer interaction and ML (now prof at Uni Luxembourg) Dr. Jussi Jokinen, computational cognitive science (now prof at Uni Jyvaskyla) Dr. Niraj Dayama, optimization (now at Arcada) Dr. Sunjun Kim, interaction techniques (now prof at DGIST) Dr. Markku Laine, web technology Dr. Byungjoo Lee, modeling and input techniques (now prof at Yonsei University) Dr. Ai Nakajima, interactive systems (now research scientist at CSC) Dr. Mathieu Nancel, input devices (now research scientist at INRIA Lille) Dr. Gilles Bailly, input and menus (now research director at CNRS) Dr. Daryl Weir, modeling (now data scientist at Futurice) PhD students (current): Xuejing Luo (ELLIS PhD program), Aalto University Jan Kompatscher, Aalto University Ruofeng Wang, Aalto University Yue Jiang (supervised with Vikas Garg), Aalto University Aini Putkonen, Aalto University Lena Hegemann, Aalto University Anna Riha (2nd supervisor), Aalto University Katri Leino (2nd supervisor), Aalto University PhD students (graduated): Yi-Chi Liao, Aalto University (now at ETH Zurich) Morteza Shiripour, Aalto University (now at Dispelix) Maria Montoya Freire (now at UEES), Aalto University Janin Koch, Aalto University (now prof. at University of Paris Saclay) Anna Feit, Aalto University SIGCHI Best Dissertation Award 2019 (now prof. at Saarland University) Srinath Sridhar (2nd supervisor), Saarland University, defended 2016 (now prof. at Brown University) Myroslav Bachynskyi, Saarland University, defended 2016 (now prof. at Bergen) Kumaripaba Athukorala (2nd supervisor), University of Helsinki, defended 2016 (now at Rovio) Eeva Raita, University of Helsinki, defended 2015 (now at Futurice) Joanna Bergstrom-Lehtovirta, Aalto University, defended 2014 (now prof. at University of Copenhagen) Airi Lampinen, University of Helsinki, defended 2014 (now prof. at Stockholm University) Antti Salovaara, University of Helsinki, defended 2012 (now senior lecturer at Aalto ARTS) Note! We are always looking for outstanding PhD students and postdocs. See our group page. Contact Department of Information and Communications Engineering, Konemiehentie 1, 13000 Aalto University, Finland Email: firstname dot lastname at aalto dot fi Latest update 2025-02-03 12:42 EET Maintained by Antti Oulasvirta",
  "content_length": 6957,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:19"
}