{
  "name": "Antti Honkela",
  "homepage": "https://www.cs.helsinki.fi/u/ahonkela",
  "status": "success",
  "content": "Antti Honkela Antti Honkela Professor, Department of Computer Science, University of Helsinki Coordinating Professor of Research Programme in Privacy-preserving and Secure AI, Finnish Center for Artificial Intelligence (FCAI) D.Sc. (Tech.), Docent in Statistical Machine Learning (Aalto University) Open postdoc and/or PhD positions in probabilistic modelling with differential privacy Antti Honkela is a Professor of Data Science (Machine Learning and AI) at the Department of Computer Science, University of Helsinki. Prior to his current appointment, he was an Assistant Professor of Statistics at the Department of Mathematics and Statistics and the Department of Public Health, University of Helsinki. He is the coordinating professor of Research Programme in Privacy-preserving and Secure AI at the Finnish Center for Artificial Intelligence (FCAI), a flagship of research excellence appointed by the Academy of Finland, and leader of the Privacy and infrastructures WP in European Lighthouse in Secure and Safe AI (ELSA), a European network of excellence in secure and safe AI. He serves in multiple advisory positions for the Finnish government in privacy of health data. Prof. Honkela's research interests include privacy-preserving machine learning and differential privacy, Bayesian machine learning and probabilistic modelling, as well as their applications in computational biology and health. Prof. Honkela is an action editor for the Transactions on Machine Learning and regularly serves as area chair for NeurIPS, ICML and AISTATS. News Started as a full professor in the beginning of 2023. New paper Strong pathogen competition in neonatal gut colonisation published in Nature Communications. European Lighthouse in Secure and Safe AI funded by Horizon Europe. New paper Differentially Private Bayesian Inference for Generalized Linear Models accepted to ICML 2021. New paper Tight Differential Privacy for Discrete-Valued Mechanisms and for the Subsampled Gaussian Mechanism Using FFT accepted to AISTATS 2021. Data Literacy for Responsible Decision-making project funded by the Strategic Research Council at the Academy of Finland. I am co-organising the Privacy-Preserving Machine Learning workshop at NeurIPS 2020. Two papers accepted to AISTATS 2020: Learning Rate Adaptation for Differentially Private Learning and Computing Tight Differential Privacy Guarantees Using FFT New paper Differentially Private Markov Chain Monte Carlo accepted as a spotlight at NeurIPS 2019. I am co-organising the Privacy in Machine Learning workshop at NeurIPS 2019. New paper Representation transfer for differentially private drug sensitivity prediction published at ISMB/ECCB 2019. I have started as an associate professor (tenure track) of data science at the Department of Computer Science at the University of Helsinki. I am co-organising the Machine Learning Open Source Software 2018: Sustainable communities workshop at NeurIPS 2018 I am co-organising the Privacy in Machine Learning and Artificial Intelligence workshop at the Federated AI Meetings 2018 in Stockholm. New paper Differentially private Bayesian learning on distributed data accepted to NIPS 2017. I am co-organising the ICML 2017 Workshop on Privacy and Secure Machine Learning Research group Postdocs Joonas Jälkö Razane Tajeddine PhD students Elio Nushi Ossi Räisä Marlon Tobaben Aki Rehn Gauri Pradhan Talal Alrawajfeh Alumni Onur Dikmen (Postdoc) Mikko Heikkilä (PhD student) Liisa Ilvonen (Postdoc) Antti Koskela (Postdoc) Tommi Mäklin (PhD student) Ola Salman (Postdoc) Hande Topa (PhD student) Selected projects ELSA - European Lighthouse on Secure and Safe AI DataLit - Data Literacy for Responsible Decision Making Contact information Room D228 at the Department of Computer Science, Exactum, Kumpula campus, University of Helsinki Telephone: +358 2941 51253 Email: antti.honkela@helsinki.fi Mobile: +358 50 311 2483 Mailing address: Department of Computer Science University of Helsinki P.O. Box 68 (Pietari Kalmin katu 5) 00014 University of Helsinki, Finland Software Differential privacy software on GitHub. My group's software releases on GitHub. BitSeq software for transcript-level expression and differential expression estimation from RNA-sequencing data is available as a standalone C++ package and in BitSeq Bioconductor package. The tigre package implementing the transcription factor target ranking method from our recent PNAS paper is available in Bioconductor. A Matlab implementation used to produce the results reported in the paper is also available. tigreBrowser is a web-based browser for displaying and ranking genomic modelling results. It allows easy viewing, sorting and filtering of visualisations of models from tigre or other tools. Older free software tools I have created are available on the pages of the Bayes and IVGA groups. Teaching University of Helsinki: Autumn 2022 DATA11007 Statistics for Data Science DATA20019 Trustworthy Machine Learning Autumn 2021 DATA20019 Trustworthy Machine Learning Autumn 2020 MAST32001 Computational statistics I DATA20019 Trustworthy Machine Learning Autumn 2019 MAST32001 Computational statistics I DATA20019 Trustworthy Machine Learning Autumn 2018 MAST32001 Computational statistics I Spring 2018 Statistical methods of medical research Autumn 2017 MAST32001 Computational statistics I Spring 2017 Statistical methods of medical research Autumn 2016 58316301 Seminar on Probabilistic Programming 582746 Modelling and Analysis in Bioinformatics Autumn 2015 582746 Modelling and Analysis in Bioinformatics Autumn 2014 58314301 Seminar in Probabilistic Models for Big Data Spring 2014 582637 Project in Probabilistic Models Spring 2013 582637 Project in Probabilistic Models Spring 2012 582637 Project in Probabilistic Models Spring 2011 582637 Project in Probabilistic Models Helsinki University of Technology: Spring 2009 T-61.6070 Special Course in Bioinformatics I: Learning and Inference in Dynamic Models of Biological Networks Autumn 2008 T-61.5110 Modelling of biological networks 2006-2007 Scientific coordinator of the International Master's Programme in Machine Learning and Data Mining - Macadamia Spring 2007 T-61.152 Informaatiotekniikan seminaari: tiedonhaku (Seminar in Computer and Information Science: Information retrieval) Autumn 2006 T-61.6010 Special Course in Computer and Information Science I: Gaussian Processes for Machine Learning Spring 2006 T-61.152 Informaatiotekniikan seminaari: ydinfunktiomenetelmät (Seminar in Computer and Information Science: Kernel methods) 2005-2006 Coordinator for the lab of Computer and Information Science for the department of Computer Science and Engineering B.Sc. seminar (Kandidaattiseminaari) Autumn 2004 T-61.182 Information Theory and Machine Learning Autumn 2001 T-61.181 Independent Component Analysis Publications Google Scholar Pubmed Journal articles A. Honkela, J. Peltonen, H. Topa, I. Charapitsa, F. Matarese, K. Grote, H.G. Stunnenberg, G. Reid, N.D. Lawrence and M. Rattray. Genome-wide modelling of transcription kinetics reveals patterns of RNA production delays. PNAS (2015). doi:10.1073/pnas.1420404112, arXiv:1503.01081 [q-bio.GN]. J. Hensman, P. Papastamoulis, P. Glaus, A. Honkela, and M. Rattray. Fast and accurate approximate inference of transcript expression from RNA-seq data. Bioinformatics (2015). doi:10.1093/bioinformatics/btv483, arXiv:1412.5995 [q-bio.QM]. (Earlier version as arXiv:1308.5953 [q-bio.GN]) K. Uziela and A. Honkela. Probe region expression estimation for RNA-seq data for improved microarray comparability. PLoS ONE 10(5):e0126545 (2015). DOI:10.1371/journal.pone.0126545, arXiv:1304.1698 [q-bio.GN] H. Topa, Á Jónás, R. Kofler, C. Kosiol, and A. Honkela. Gaussian process test for high-throughput sequencing time series: application to experimental evolution. Bioinformatics 31(11):1762-1770 (2015). doi:10.1093/bioinformatics/btv014, arXiv:1403.4086 [q-bio.PE]. J. C. Costello, L. M. Heiser, E. Georgii, M. Gönen, M. P. Menden, N. J. Wang, M. Bansal, M. Ammad-ud-din, P. Hintsanen, S. A. Khan, J-P. Mpindi, O. Kallioniemi, A. Honkela, T. Aittokallio, K. Wennerberg, NCI DREAM Community, J. J. Collins, D. Gallahan, D. Singer, J. Saez-Rodriguez, S. Kaski, J. W. Gray, and G. Stolovitzky. A community effort to assess and improve drug sensitivity prediction algorithms. Nature Biotechnology 32:1202-1212 (2014). doi:10.1038/nbt.2877 S. Seth, N. Välimäki, S. Kaski, and A. Honkela. Exploration and retrieval of whole-metagenome sequencing samples. Bioinformatics 30(17):2471-2479 (2014). doi:10.1093/bioinformatics/btu340, arXiv:1308.6074 [q-bio.GN] C. wa Maina, A. Honkela, F. Matarese, K. Grote, H. G. Stunnenberg, G. Reid, N. D. Lawrence, and M. Rattray. Inference of RNA Polymerase II Transcription Dynamics from Chromatin Immunoprecipitation Time Course Data. PLoS Comput Biol 10(5):e1003598 (2014). doi:10.1371/journal.pcbi.1003598, arXiv:1303.4926 [q-bio.QM] M. Titsias*, A. Honkela*, N. D. Lawrence, and M. Rattray. Identifying targets of multiple co-regulating transcription factors from expression time-series by Bayesian model comparison. BMC Systems Biology 6:53 (2012). doi:10.1186/1752-0509-6-53 P. Glaus, A. Honkela*, and M. Rattray*. Identifying differentially expressed transcripts from RNA-seq data with biological variation. Bioinformatics 28(13):1721-1728 (2012). doi:10.1093/bioinformatics/bts260, arXiv:1109.0863 [q-bio.GN] U. Remes, K. J. Palomäki, T. Raiko, A. Honkela, and M. Kurimo. Missing-feature reconstruction with bounded nonlinear state-space model. IEEE Signal Processing Letters 18(10):563-566 (2011). doi:10.1109/LSP.2011.2163508 A. Honkela, P. Gao, J. Ropponen, M. Rattray, N. D. Lawrence. tigre: Transcription factor Inference through Gaussian process Reconstruction of Expression for Bioconductor. Bioinformatics 27(7):1026-1027 (2011). doi:10.1093/bioinformatics/btr057 A. Honkela*, T. Raiko*, M. Kuusela, M. Tornio, and J. Karhunen. Approximate Riemannian conjugate gradient learn",
  "content_length": 21281,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:17"
}