{
  "name": "Antónia Lopes",
  "homepage": "https://ciencias.ulisboa.pt/perfil/malopes",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo Contactos Departamento de Informática Sala/Gabinete 6.3.16 Ext. Principal 526316 Telefone Direto 217500604 Email malopes@ciencias.ulisboa.pt Página Pessoal Carreira Docente Universitário Categoria Professor Associado Indicadores ResearcherID Orcid Google Scholar Currículo Resumido Antónia Lopes is Associate Professor in the Department of Informatics of the University of Lisbon, Faculty of Science, Portugal, since March 2006. She received a Ph.D. in Informatics at the University of Lisbon in 1999. Her research interests are in the area of formal methods for software engineering. These include mathematically based techniques for the specification, modelling and analysis of various types of software intensive systems, namely service-oriented systems and self-adaptive systems. She is a member of the Editorial Board of ACM TOSEM (Transactions on Software Engineering and Methodology) and the Board of Academic Editors of PeerJ Computer Science. She is, or has been, a member of the Steering Committees for the international conferences such as ECSA, FASE, FMOODS/FORTE, COORDINATION. She was the program committee co-chair of International Conference on Fundamental Approaches to Software Engineering 2007 (FASE 2007), the 11th IFIP WG 6.1 International Conference on Formal Techniques for Distributed Systems (FMOODS/FORTE 2009) and ASAAS 2011 (First Workshop on Assurances for Self-Adaptive Systems) and program committee chair of European Conference on Software Architecture 2017 (ECSA 2017). She was keynote speaker at MEDI 2011 (International Conference on Model & Data Engineering), ICGT 2012 (International Conference on Graph Transformation) and IMM 2016 (Iberian Mathematical Meeting), She gave an invited tutorial on Software Architecture at the 2nd Latin-American School on Software Engineering in July 2015 and a course on Software Reliability Methods at ECI 2018 in July 2018. Interesses Científicos Métodos Formais para a Engenharia de Software; Design e Arquitectura de Software Scientific Interests Formal Methods for Software Engineering; Software Architecture and Design Publicações selecionadas José Luiz Fiadeiro, Antónia Lopes: Heterogeneous and Asynchronous Networks of Timed Systems. Theor. Comput. Sci. 663: 1-33 (2017) Javier Cámara, Antónia Lopes, David Garlan, Bradley Schmerl: Adaptation impact and environment models for architecture-based self-adaptive systems, Science of Computer Programming (2016) Liliana Rosa, Luís E. T. Rodrigues, Antónia Lopes, Matti A. Hiltunen, Richard D. Schlichting: Self-Management of Adaptable Component-Based Applications. IEEE Trans. Software Eng. 39(3): 403-421 (2013) Antónia Lopes, José Luiz Fiadeiro: Adding mobility to software architectures. Sci. Comput. Program. 61(2): 114-135 (2006) Antónia Lopes, Michel Wermelinger, José Luiz Fiadeiro: High-order architectural connectors. ACM Trans. Softw. Eng. Methodol. 12(1): 64-104 (2003) Ver todas as Publicações",
  "content_length": 3091,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:20"
}