{
  "name": "António Casimiro Costa",
  "homepage": "https://ciencias.ulisboa.pt/perfil/accosta",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo António Casimiro Contactos Departamento de Informática Sala/Gabinete 6.3.45 Ext. Principal 526345 Telefone Direto 217500612 Extensão pessoal 26345 Email accosta@ciencias.ulisboa.pt Página Pessoal Carreira Docente Universitário Categoria Professor Associado Indicadores ResearcherID Orcid Scopus Google Scholar CiênciaVitae Palavras Chave Segurança crítica Computação em Tempo-Real Internet das Coisas Keywords Safety engineering Real-Time computing IoT Currículo Resumido António Casimiro (http://www.di.fc.ul.pt/~casim/) é Professor Associado do Departamento de Informática da Faculdade de Ciências da Universidade de Lisboa (FCUL), onde leciona desde 1996. Licenciou-se (1991) e fez o Mestrado em Engenharia Electrotécnica e de Computadores (1995) pelo Instituto Superior Técnico (IST) da Universidade de Lisboa e doutorou-se em Informática (2003) pela Universidade de Lisboa. Foi professor adjunto do Carnegie Mellon Information Networking Institute de 2008 a 2011 e lecionou no IST entre 1993 e 1996. É membro da unidade de investigação LASIGE, onde lidera a linha de investigação em Sistemas Ciberfísicos. Está atualmente envolvido nos projetos H2020 ADMORPH e VEDLIoT, e coordena o projeto AQUAMON (FCT). Anteriormente coordenou os projetos KARYON (FP7) e TRONE (CMU|Portugal), tendo participado em diversos projetos nacionais e internacionais, tais como os projetos HIDENETS, CORTEX, CaberNet e TACID. A sua investigação tem sido focada nas arquiteturas, tolerância a faltas e adaptação em sistemas distribuídos e sistemas embebidos de tempo-real, com aplicações em sistemas ciberfísicos tais como veículos autónomos e cooperativos ou sistemas de monitorização e controlo de infraestruturas críticas. Tem mais de 80 publicações em revistas e atas de reuniões científicas internacionais com arbitragem nas áreas dos sistemas distribuídos confiáveis e de tempo-real. Serviu como Program Chair e organizador das conferências SAFECOMP 2020 e Ada-Europe 2018 e foi Program Co-Chair do SRDS 2014. Organizou diversas reuniões científicas internacionais e é regularmente membro da Comissão de Programa de diversas conferências de referência nas suas áreas de investigação, tais como DSN, SRDS e SAFECOMP. Presidiu a Comissão Coordenadora da conferência nacional de informática (INForum) entre 2013 e 2015, foi diretor dos recursos informáticos da FCUL entre 2004 e 2006, e foi membro do Conselho Científico da FCUL de 2015 a 2018. Coordena atualmente o Mestrado em Segurança Informática da FCUL e é Vice-Presidente do Conselho Pedagógico da FCUL. É membro do IFIP WG 10.4 on Dependable Computing and Fault Tolerance, do Ada-Europe Board, do EWICS TC7, do IEEE, da ACM e da Ordem dos Engenheiros. Interesses Científicos Arquiteturas, tolerância a faltas e adaptação em sistemas distribuídos e sistemas embebidos de tempo-real, com aplicações em sistemas ciberfísicos tais como veículos autónomos e cooperativos ou sistemas de monitorização e controlo de infraestruturas críticas Scientific Interests Architectures, fault-tolerance and adaptation in distributed systems and real-time and embedded systems, with applications in cyber-physical systems such as autonomous and cooperative vehicles or monitoring and control systems for critical infrastructures. Publicações selecionadas Gonçalo Jesus, António Casimiro, Anabela Oliveira. Using Machine Learning for Dependable Outlier Detection in Environmental Monitoring Systems. ACM Transactions on Cyber-Physical Systems, 5(3):29,1-30, July 2021. doi: 10.1145/3445812. Paolo Ferrari, Emiliano Sisinni, Paolo Bellagente, Stefano Rinaldi, Marco Pasetti, Alan Oliveira de Sa, Raphael C. S. Machado, Luiz F. R. da C. Carmo, Antonio Casimiro. Model-Based Stealth Attack to Networked Control System Based on Real-Time Ethernet. IEEE Transactions on Industrial Electronics, 68(8):7672-7683, June 2020. doi: 10.1109/TIE.2020.3001850. Georg Jäger, Sebastian Zug, António Casimiro. Generic Sensor Failure Modeling for Cooperative Systems. Sensors, 18(3), 31 pages, March 2018. doi: 10.3390/s18030925. André Nogueira, António Casimiro, Alysson Bessani. Elastic State Machine Replication. IEEE Transactions on Parallel and Distributed Systems, 28(9):2486-2499, Sept. 1 2017. doi: 10.1109/TPDS.2017.2686383. Mônica Dixit, António Casimiro, Paolo Lollini, Andrea Bondavalli, Paulo Veríssimo. Adaptare: Supporting automatic and dependable adaptation in dynamic environments. ACM Transactions on Autonomous and Adaptive systems, 7(2):1-25, July 2012. doi: 10.1145/2240166.2240168. Ver todas as Publicações",
  "content_length": 4695,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:21"
}