{
  "name": "Antônio Augusto de Aragão Rocha",
  "homepage": "http://www2.ic.uff.br/~arocha",
  "status": "success",
  "content": "Antonio Guto Rocha's home page Antonio \"Guto\" Rocha Associate Professor Institute of Computing (C.S. Dept.) Fluminense Federal University Short Bio Antonio Augusto \"Guto\" de Aragão Rocha is Associate Professor in the Computer Science Department from the Institute of Computing at the Fluminense Federal since 2011. He received a MSc and PhD degrees in Computer and Systems Engineering (PESC/COPPE) from the Federal University of Rio de Janeiro (UFRJ) Brazil, in 2003 and 2010, respectively. During PhD, in 2008-209, he has been a visiting scholar in the Computer Science at University of Massachusetts Amherst (UMass). He worked as a post-doc researcher at UFRJ, supported by INCT WebScience. He received his bachelor's degree in Computer Science at University of Salvador (UNIFACS) in 2000. He has a Research Productivity Fellowship granted by CNPq (since 2014). His areas of interest include performance evaluation, traffic engineering, network measurement, next generation Internet, network science and security systems. Dr. Antonio Rocha has published many papers in important journals and conferences and his work has received a few awards. Best paper on ACM/CoNext 2009 Best paper on SBRC 2006 Best paper on WPerformance 2014 Best paper on WPerformance 2012 Best paper on WPerformance 2004 Best Ph.D. Thesis nominee by SBC (Brazilian Computer Society) Vote of Honour by COPPE/UFRJ in 2009 for the work realized during PhD Travel grants: Sigmetrics/Performance 09, Sigcomm 08, ICC 07, IMC 06 ▼ Undergraduate level: ► Computer Networks II ✓2014-2 ► Computer Networks I ✗ 2014-1 ✗ 2013-1 ► Distributed Systems ✗ 2013-2 ✗ 2012-2 ✗ 2012-1 ► Computer Security ✗ 2013-2 ✗ 2011-2 ► Database Systems ✗ 2011-1 ► Database Systems ✗ 2011-1 ► Numerical analysis ✗ 2011-1 ▼ Graduate level: ► Computer System ✓2014-2 ✗ 2014-1 ✗ 2013-2 ✗ 2013-1 ► Performance Evaluation ✗ 2012-2 ✗ 2011-2 ► Large-Scale Networked Systems ✗ 2012-1 Future Internet Architectures This topic focus on proposals that attempt to make the future Internet architecture a solution really scalable, robust, secure and, why not, fully oriented to content and context. Epidemic Seedind in Social Networks This topic involves the evaluation of the performance for different network seeding strategies over different network models, especially in social network. BT Streamer Detector This project aims on developing techniques to detect BT users cheating the system (e.g., operating in a streaming mode) and evaluating the performance of the swarm in the presence of such entities. Estimating Populations Size of System Consider a really large system, e.g. an extremely popular swarm in BT. A fundamental question is, how to estimate its real size from outside? The project tries to answer this and other related questions. New Passive and Active Measurement Techniques This project aims to develop new passive and active measurement techniques and/or methods which help to understand better how the Internet behaves. P2P System Scalability Swarms with high peers arrival rate and limited publisher capacity might be unstable (i.e., # of peers increasing unboundedly). Is it possible to mitigate this effect changing the Publishers operational mode? Can we identify actual swarms in such state? by email ... arocha@ic.uff.br find me on ... Facebook Google+ Twitter LinkedIn Instagram Skype or come visit me: Fluminense Federal University Institute of Computing Office 443 Rua Passas da Pátria, 156 São Domingos, Niterói - RJ Brazil - 24210-240",
  "content_length": 3501,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:23"
}