{
  "name": "António Branco",
  "homepage": "https://ciencias.ulisboa.pt/perfil/ambranco",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo António Branco Contactos Departamento de Informática Sala/Gabinete 6.3.24 Ext. Principal 526324 Telefone Direto 21750606 Email ambranco@ciencias.ulisboa.pt Página Pessoal Carreira Docente Universitário Categoria Professor Associado com Agregação Currículo Resumido Sou um CIENTISTA cuja investigação se debruça sobre a Inteligência Artificial com enfoque no Processamento da Linguagem Natural e com uma preocupação particular na preparação tecnológica da língua portuguesa para a era digital, procurando assim contribuir para assegurar a cidadania dos seus falantes na sociedade da informação.I am a SCIENTIST whose research is devoted to Artificial Intelligence and its subarea of Natural Language Processing, with a special focus on the technological preparation of the Portuguese language for the digital age, aiming thus at contributing to enhance the citizenship of its speakers in the information society. Download currículo completo Publicações selecionadas Branco, António, João Rodrigues, Malgorzata Salawa, Ruben Branco, Chakaveh Saedi, 2020, \"Comparative Probing of Lexical Semantics Theories for Cognitive Plausibility and Technological Usefulness\", In Proceedings, 28th International Conference on Computational Linguistics (COLING2020), International Committee on Computational Linguistics (ICCL), pp.4004-4019. Gaudio, Rosa Del, Gustavo Batista e António Branco, 2014, \"Coping with Highly Imbalanced Datasets: A Case-study with Definition Extraction in a Multilingual Setting\", Journal of Natural Language Engineering, vol. 20, n. 3, pp.327-359 Branco, António, 2012, Um Gigante com Pés de Barro na Era Digital, Jornal \"Expresso\", edição de 8 de dezembro de 2012, caderno principal, p. 51, seção de artigos de opinião. Leitão, José, António Branco, Maria Piñango, Luís Pires, 2009, \"Pronoun Resolution to Commanders and Recessors: A View from Event-Related Brain Potentials\", Lecture Notes in Artifical Intelligence 5847, Berlim, Springer, pp. 107-120. Branco, António, 2005, \"Binding Constraints and Dualities in the Semantics of Nominals\", Journal of Language Logic and Information, vol. 14, n. 2, pp.149-171. Ver todas as Publicações Prizes and Awards 2024-10-22 - Reconhecimento da Investigação de Excelência em Ciências (Faculdade de Ciências da Universidade de Lisboa)",
  "content_length": 2449,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:19"
}