{
  "name": "Anuja Thimali Dharmaratne",
  "homepage": "https://research.monash.edu/en/persons/anuja-thimali-dharmaratne",
  "status": "success",
  "content": "Anuja Dharmaratne - Monash University View Scopus Profile Anuja Dharmaratne Assoc Professor Associate Professor, Department of Human Centred Computing https://orcid.org/0000-0002-5630-4818 EmailAnuja.Dharmaratnemonashedu Accepting PhD StudentsPhD projects-Event based feature detection and image classification-EEG and QEEG analysis for early detection of psychological disorders-Analysis of common learning behaviour patterns in programming classrooms 20032024 Research activity per year Personal profile BiographyAnuja Dharmaratne is an Associate Professor attached to the Department of Human Centred Computing (HCC) at Faculty of IT. She graduated from the University of Colombo, Sri Lanka in 1995 with a First Class Honours in Computer Science. She had her postgraduate education at Hiroshima University, Japan and obtained her M.Eng and Doctoral degrees from the Graduate School of Engineering in 2000 and 2004 respectively. Her main research interests are in Image Processing, Computer Vision, Game based education,  Learning Analytics, Digital Health and ICT for Society. She has served Monash University Malaysia for 9+ years from 2014-2023 and  University of Colombo School of Computing (UCSC) from 1996-2013.Research interestsImage ProcessingComputer VisionGame based EducationLearning AnalyticsDigital HealthICT for SocietyMonash teaching commitmentFIT3081- Image ProcessingFIT3155 - Advanced Algorithms and data structuresFIT2014 - Theory of ComputationFIT2004 - Algorithms & Data StructuresITO4001- Foundations of Computing Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationInformation Engineering, Doctor of Engineering, Hiroshima University1 Apr 2000 → 4 Mar 2004Award Date: 4 Mar 2004Information Engineering, Master of Engineering, Hiroshima University1 Apr 1998 → 24 Mar 2000Award Date: 24 Mar 2000Computer Science, B.Sc. (Hons) Computer Science, University of ColomboAward Date: 1 Nov 1995 External positionsAssociate Professor, Monash University Malaysia13 Jan 2014 → 21 Mar 2023Senior Lecturer, University of Colombo1996 → 2013 Research area keywordsImage ProcessingComputer VisionLearning AnalyticsGame based EducationDigital HealthICT for Society Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2013 2013 2020 2021 2022 2024 2026 1 Active 4 Finished Projects per year RewardQNet: RewardQNet: Novel Reward-based Deep Learning Agent Self-structuring Framework for Untreated Intracranial Aneurysm (UIA) SegmentationTing, S. F. F. (Primary Chief Investigator (PCI)), Phan, R. (Chief Investigator (CI)), Dharmaratne, A. (Chief Investigator (CI)), Lim, C. H. (Chief Investigator (CI)) & Chee Pin, T. (Chief Investigator (CI))1/09/22 → 28/02/26Project: Research Native Grains and Tubers AllianceAppoo, S. (Chief Investigator (CI)), Sridharan, S. (Primary Chief Investigator (PCI)), Hartel, C. (Chief Investigator (CI)), Shahriar, A. Z. (Chief Investigator (CI)), Scally, A. (Chief Investigator (CI)), Walter, G. (Chief Investigator (CI)), Dharmaratne, A. (Chief Investigator (CI)) & Khabar, J. (Chief Investigator (CI))2/04/24 → 31/12/24Project: Research Adapting a Personalized Positive Parenting Digital Health Program for Youth Mental Health Promotion in MalaysiaGolden, K. (Primary Chief Investigator (PCI)), Yap, M. (Chief Investigator (CI)), Xie, J. (Chief Investigator (CI)), Olivier, P. (Chief Investigator (CI)), Wu, L. (Chief Investigator (CI)), Shaikh, F. (Chief Investigator (CI)), Kia Fatt, Q. (Chief Investigator (CI)), Su, T. T. (Chief Investigator (CI)), Phan, R. (Chief Investigator (CI)), Dharmaratne, A. (Chief Investigator (CI)), Kirk, H. (Chief Investigator (CI)), Warren, N. (Chief Investigator (CI)), Robinson, P. (Chief Investigator (CI)), Ilias, K. (Associate Investigator (AI)), Jamil, N. (Associate Investigator (AI)) & Kamaralzaman, S. (Associate Investigator (AI))Monash University Malaysia4/01/21 → 30/12/22Project: Research Investigating very deep convolutional networks architecture for learning and recognizing microexpression of child social learning behaviorFermi Pasha, M. (Primary Chief Investigator (PCI)), Nai Ming, L. (Chief Investigator (CI)), Nailah, N. (Chief Investigator (CI)), Mandava, R. (Chief Investigator (CI)), Dharmaratne, A. (Chief Investigator (CI)) & Agnes Coleman, S. (Chief Investigator (CI))1/11/20 → 31/10/24Project: Research The Practice of Online Evidence Based Medicine Amongst Physicians in Malaysia: Is there Evidence at Point of Care and Are We Information Communication Technology (ICT) Ready?Dharmaratne, A. (Primary Chief Investigator (PCI))16/12/13 → 16/12/16Project: Research Research output Research output per year 2003 2011 2013 2014 2015 2020 2022 2024 37 Conference Paper 9 Article 1 Chapter (Book) 1 Review Article Research output per year Research output per year A framework informing the interplay of physical, digital and social spaces in supporting an environment for active learningChang-Tik, C., Dharmaratne, A., Driskell, J. & Kumari, Y., 2024, (Accepted/In press) In: Asia Pacific Journal of Education. 19 p.Research output: Contribution to journal › Article › Research › peer-review Open Access 4 Citations (Scopus) Enhanced 3D-OTSU algorithm for robust tuberculosis and COVID-19 CT scans segmentationAlebiosu, D. O., Lim, C. H. & Dharmaratne, A., 2023, 2023 IEEE International Conference on Visual Communications and Image Processing. Kim, M., Ik Cho, N. & Wien, M. (eds.). Piscataway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, 5 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 1 Citation (Scopus) Improving tuberculosis severity assessment in computed tomography images using novel DAvoU-Net segmentation and deep learning frameworkOlayemi Alebiosu, D., Dharmaratne, A. & Hong Lim, C., 1 Mar 2023, In: Expert Systems with Applications. 213, Part C, 11 p., 119287.Research output: Contribution to journal › Article › Research › peer-review 18 Citations (Scopus) Towards AST-LLDs for the analysis of depression in speech signalsNagappan, S., Lim, C. H. & Dharmaratne, A. T., 2023, 2023 Asia Pacific Signal and Information Processing Association Annual Summit and Conference (APSIPA ASC). Lin, T.-L., Kajikawa, Y. & Yin, Z. (eds.). Piscataway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, p. 1323-1328 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review AI-based multidisciplinary framework to assess the impact of gamified video-based learning through schema and emotion analysisVidanaralage, A. J., Dharmaratne, A. T. & Haque, S., 2022, In: Computers and Education: Artificial Intelligence. 3, 25 p., 100109.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 16 Citations (Scopus) View all 48 research outputs Prizes School Research Grant: Clinical Pharmacy & Pharmacy Education Research Grant 2022 Pre-development framework to validate health promotion audio-visuals using AI technology for the emotional needs of tobacco smokersAppalasamy, J. R. (Recipient), Shaharuddin, S. (Recipient), Selvaraj, A. (Recipient), Ramachandram, D. S. (Recipient), Dharmaratne, A. T. (Recipient) & Buhari, A. M. (Recipient), Aug 2022Prize: Prize (including medals and awards)",
  "content_length": 7850,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:27"
}