{
  "name": "Anupam Joshi",
  "homepage": "http://www.csee.umbc.edu/~joshi",
  "status": "success",
  "content": "Homepage of Anupam Joshi Anupam Joshi Oros Family Professor and Chair of CSEE Department, UMBC Director, UMBC Center for Cybersecurity joshi@umbc.edu Phone: +1-410-455-2590 Prospective Students Dr. Joshi was born in New Delhi, India, many (or not so many, depending on your POV) moons ago. Assorted geeeky acts like memorising the schedule for Indian Railways (North Zone) at an early age showed to all and sundry that he was destined to be a Professor. He set out to fulfil this prediction with gusto, in the process asking long, complicated and troublesome questions of his teachers at Modern School and IIT Delhi. While in his senior years in high school, and through his undergraduate education, he continued his interest in asking (and answering) questions by representing his institutions in debating and quizzing at an intercollegiate level. He also got involved in research activities, which lead him to Purdue University, from where he obtained his Ph.D degree in Computer Science. After a stint at Purdue as a research faculty, he headed off to the University of Missouri , and spent two wonderful years there as Assistant Professor of Computer Engineering and Computer Science. He next exchanged life in small town midwest surrounded by fields of corn for life in suburban big town east cost. Currently, he is found roaming the campus of the University of Maryland, Baltimore County. After assisting and then associating with Professors, we was given the right to Profess on his own in 2005. He has since been made the Oros Family Professor, Director of the Cybersecurity Center, and Chair of the Department. He was elected a Fellow of the IEEE. He continues to ask many questions, though he concentrates on answering only some of them. Media Interview to ABC 2 News on Ashley Madison cyberattack Response to SOTU remarks on Cybersecurity Anupam Joshi joshi@cs.umbc.edu",
  "content_length": 1880,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:33"
}