{
  "name": "Anupam Das 0001",
  "homepage": "https://www.anupamdas.org",
  "status": "success",
  "content": "Anupam Das: Personal Webpage Anupam Das Associate Professor Computer Science Department North Carolina State University About Me I am an Associate Professor in the Department of Computer Science at NC State University and a member of the Wolfpack Security and Privacy Research (WSPR) lab. I am also the director of the IoT Smarthome Lab. I received my Ph.D. in Computer Science from the University of Illinois at Urbana-Champaign (UIUC). Prior to joining NC State University, I was a postdoctoral fellow at Carnegie Mellon University (CMU). Research Interests I conduct research in different aspects of security and privacy with a special focus towards designing secure and privacy-preserving technologies. My research is currently focuses on investigating the security and privacy challenges in the era of the Internet of Things (IoT). I am developing new techniques and systems that not only assess security, privacy, and safety issues but also enhance transparency and control over how personal data is collected and used by emerging technologies. [Hiring] I'm looking to hire motivated students to work together on emerging security and privacy problems. Especically if you have experience is developing VR games. Recent News Excited to receive a Google Faculty research award for studying the design of privacy assistants for the smart home IoT ecosystem. Excited to receive another Meta research award for studying predictors of privacy preferences in social virtual reality. Excited to receive a Meta research award for developing Physical Context-aware Voice Assistants. Our paper on \"Understanding Privacy Expectations and Preferences in the Age of Video Analytics,\" is one of the winners for the 12th Annual Privacy Papers for Policymakers (PPPM) Award that recognizes impactful academic papers that advance policy solutions Our work on Amazon Alexa skills was invited for presentation and discussion at FTC PrivacyCon 2021. Our recent work on Amazon Alexa skills was covered in a podcast by Cybercrime Magazine Podcast. Our paper on analyzing the Alexa skill ecosystem has been accepted to NDSS 2021. Our paper on understanding people's privacy expectations and preferences in using video analytics has been accepted to PETS 2021. Our paper on understanding the privacy implications of Adblock Plus’s acceptable ads has been accepted to ASIACCS 2021. Our paper on user's perception of risk regarding IFTTT Applets has been accepted to SOUPS 2020. Was panelist at FTC PrivacyCon 2019 talking about abusive use of mobile sensor data. Our paper on analyzing how sensors on smartphones are being used by websites has been accepted for presentation at CCS 2018. Our paper on analyzing the feasibility of using embedded sensors to fingerprint smartphones has been accepted for presentation at PoPETs/PETS 2018. Our work on detecting XSS has been accepted for presentation at NDSS 2018. Congrats to Junjue Wang for winning the 'Best Paper Award' at ACM MMSys 2017. Recent Professional Activities Serving as a PC member for NDSS 2026, Usenix Security 2026. Serving as a PC member for ACM CCS 2025, IEEE S&P 2025, Usenix Security 2025, PETS 2025, Poster Co-chair for ACSAC 2025. Serving as a PC member for ACM CCS 2024, IEEE S&P 2024, Poster Co-chair for ACSAC 2024. Serving as a PC member for ACM CCS 2023, ACSAC 2023, PETS 2023. Serving as a PC member for USENIX Security 2022, ACM CCS 2022, Poster Chair for IEEE S&P 2022. Serving as a PC member for CCS 2021, IEEE S&P 2021, USENIX Security 2021, NDSS 2021 and PoPETs/PETS 2021. Serving as a PC member for NDSS 2020 and PoPETs/PETS 2020. Served as a PC member for PoPETs/PETS 2019. Served as a Program Co-chair for MMSys 2018 (Special Session on IoT and Smart Cities). Served as a PC member for WWW 2018, WPES 2018, Workshop on The Bright and Dark Sides of Computer Vision (in conjunction with the 2018 IEEE CVPR), NSysS 2018. Served as a PC member for CCS 2017. Contact Department of Computer Science College of Engineering Campus Box 8206 890 Oval Drive Engineering Building II Room 2240G Raleigh, NC 27695 Email: anupam dot das at ncsu dot edu",
  "content_length": 4101,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:28"
}