{
  "name": "Anup Bhattacharya",
  "homepage": "https://sites.google.com/site/anupbtcs",
  "status": "success",
  "content": "Anup BhattacharyaSearch this siteEmbedded FilesSkip to main contentSkip to navigationI am a faculty at the School of Computer Sciences, NISER, Bhubaneswar. Earlier, I was a postdoctoral researcher at the Indian Statistical Institute, Kolkata and the University of Bonn in Germany. I completed my PhD in the Department of Computer Science and Engineering at IIT Delhi under the supervision of Prof. Ragesh Jaiswal.  Research interests: Algorithm design, Randomized algorithms. Details of my publications can be found here, and DBLP, Google Scholar.  Contact: bhattacharya.anup@gmail.comNews: Please note that I am not taking any summer interns who are not from NISER. Emails with summer internship requests will be ignored.We are organising a winter school on \"Algorithmic Foundations of Data Science\" at NISER, Bhubaneswar (sponsored by NISER and ACM India) from 11th December to 22nd December, 2023. Details can be found here.Recent Publications: Faster Counting and Sampling Algorithms using a Colorful Decision Oracle in TOCT 2024 with (Arijit Bishnu, Arijit Ghosh and  Gopinath Mishra)Faster Counting and Sampling Algorithms Using Colorful Decision Oracle in STACS 2022 (with Arijit Bishnu, Arijit Ghosh, and Gopinath Mishra)Hardness of Approximation of Euclidean k-Median in Approx 2021 (with Dishant Goyal and Ragesh Jaiswal)Even the Easiest (?) Graph Coloring Problem is not Easy in Streaming to appear in ITCS 2021 (with Arijit Bishnu, Gopinath Mishra, Anannya Upasana)On Sampling Based Algorithms for k-Means to appear in FSTTCS 2020 (with Dishant Goyal, Ragesh Jaiswal and Amit Kumar)Disjointness Through the Lens of VC-dimension: Sparsity and Beyond in RANDOM 2020 (with Sourav Chakraborty, Arijit Ghosh, Gopinath Mishra, and Manaswi Paraashar)Noisy, Greedy and Not So Greedy k-means++ in ESA 2020 (with Jan Eube, Heiko Röglin, Melanie Schmidt)Complete list of publications can be found here.Teaching/Seminars: Advanced Machine Learning (CS461/CSE661 in Spring 2025)Randomized Algorithms (CS425/CSE625) in Autumn 2024Programming and Data Structures Lab: II (CS142) with Abhishek Sahu (Spring 2024)Algorithms (CS301),  with Abhishek Sahu in Fall 2023Programming and Data Structures Lab: I (CS141), with Abhishek Sahu in Fall 2023Approximation Algorithms (CS458) in Spring 2023Algorithms (CS301) in Autumn 2022Programming and Data Structures Lab- II in Spring 2022Advanced Machine Learning (CS461/CS672) in Spring 2022Computational Laboratory-I in Autumn 2021Randomized Algorithms (CS661) in Autumn 2021CS458 (Approximation Algorithms) in Spring 2021Computational Laboratory I (with Rishiraj Bhattacharyya)Earlier:Algorithms (with Sourav Chakraborty)Spectral Techniques in Theoretical Computer ScienceReading Group on Sublinear Algorithms and Property TestingStudents: Pinki Pradhan (PhD)Suraj Sahoo (MSc, now a PhD student at IISc)Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2889,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:26"
}