{
  "name": "Anurag Srivastava 0001",
  "homepage": "https://directory.statler.wvu.edu/faculty-staff-directory/anurag-srivastava",
  "status": "success",
  "content": "Anurag Srivastava | Statler College Faculty-Staff Directory | West Virginia University 304-293-3017 anurag.srivastava@mail.wvu.edu AERB 363B Google Scholar Chairperson, Professor - Lane Department of Computer Science and Electrical Engineering As the Chairperson of the Computer Science and Electrical Engineering Department and Raymond J. Lane Professor at West Virginia University, Dr. Srivastava leads a team of faculty, staff, and students passionate about advancing computer science, cybersecurity, electrical engineering, computer engineering, AI, robotics, and biometrics. Over the past three years, research expenses in the department have more than doubled, while also significantly increasing both the quality and quantity of total departmental publications. With over 18 years of experience as a scientist, educator, researcher, and leader, he brings a robust background in academic leadership, power grid operation and control, electric power grid resilience against cyber and weather events, renewable energy integration, physics-aware ML, synchrophasor applications, and integrated cyber-power simulations. Currently, Dr. Srivastava holds a joint appointment as a Senior Scientist at Pacific Northwest National Laboratory, working on projects leveraging computational methods to address complex scientific and societal challenges. Additionally, he serves as an Adjunct Professor at Washington State University, mentoring graduate students in electric power engineering. In previous roles, Dr. Srivastava has worked internationally in visiting positions at institutions such as the Réseau de transport d´électricité in France, RWTH Aachen University in Germany, Indian Institute of Technology Kanpur in India, and at Asian Institute of Technology in Thailand. He also worked at the PEAK Reliability Coordinator, Idaho National Laboratory, PJM Interconnection, Schweitzer Engineering Lab (SEL), GE Grid Solutions, Massachusetts Institute of Technology and Mississippi State University. Notably, he served as Technical Lead and Lead Co-I of the $30M UI-ASSIST Center, driving advancements in renewable energy integration and decarbonization. His research interests include data-driven algorithms for power system operation and control, with high-impact projects resulting in tools installed at utility control centers, supported for more than $60M by funding agencies such as the US Department of Energy, National Science Foundation, Siemens Corporate Research, Electric Power Research Institute, Schweitzer Engineering Lab, Power System Engineering Research Center, Office of Naval Research, DARPA, and several National Labs. He is serving as co-chair of the IEEE PES microgrid working group, chair of power system operation SC, chair of PES voltage stability working group, chair of PES synchrophasors applications working group, co-chair of distributed optimization application in power grid, co-chair of tools for power grid resilience TF, and past-chair of the IEEE Power & Energy Society’s (PES) PEEC committee, as well as a member of CIGRE WG’s related to Voltage Stability, Resilience, AI, and wide area monitoring. Dr. Srivastava has also contributed significantly as an editor for various esteemed journals such as the IEEE Transactions on Smart Grid, IEEE Transactions on Power Systems, IEEE Transactions on Industry Applications, and Elsevier Sustainable Computing. He holds the distinction of being an IEEE Fellow, IEEE distinguished lecturer, and the author of more than 375 technical publications, 3 books, and 3 patents. Dr. Srivastava's extensive experience includes delivering 35+ keynotes, tutorials, and IEEE distinguished lectures in over 18 countries. He has visited all 50 US states and more than 75 countries. Dr. srivastava has supervised/co-supervised 60 graduate theses (25 Ph.D and 35 M.S. students) and mentored 20+ post-doctoral fellows. Dr. Srivastava serves as a conference chair for the International Conference on Smart Grid Synchronized Measurements and Analytics 2024 (SGSMA 2024) and Co-Chair of an IEEE WS on “Modeling and simulation of Cyber-Physical Energy Systems at CPSWeek 2024. Additionally, he has held key roles such as Technical Co-Chair of IEEE SmartGridComm 2021, organizing committee member of NSF Sponsored “Forging Connections between Machine Learning, Data Science, & Power Systems Research” in 2020, chair of NSF sponsored “Data analytics workshop for the power grid resiliency” in 2018, North American Power Symposium in 2014, and Chair of IEEE WS on Testing and validation of synchrophasor devices and applications in 2012. His mission is to promote innovative solutions and create leaders in academia and research, ultimately aiming to improve the quality of life for all. Dr. Srivastava values collaboration, creativity, and integrity. Education Ph.D., Electrical engineering, Illinois Institute of Technology, 2005. Statler College Faculty and Staff Directory Connect With Us Facebook Twitter Instagram LinkedIn YouTube Podcasts on Anchor Benjamin M. Statler College of Engineering and Mineral Resources 1374 Evansdale Drive | PO Box 6070 Morgantown, West Virginia 26506-6070 Phone: 304.293.4821 | Email: statler-info@mail.wvu.edu Driving Directions Connect With Us Facebook Twitter Instagram LinkedIn YouTube",
  "content_length": 5279,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:30"
}