{
  "name": "Anurag Khandelwal",
  "homepage": "http://anuragkhandelwal.com",
  "status": "success",
  "content": "Anurag Khandelwal About I am an Assistant Professor at the Department of Computer Science at Yale University. My research interests span systems and networking. I am always looking for motivated graduate students and postdoctoral researchers! Recent News [2025] NSF Award to fortify cloud confidential computing environments (with Lin and Seung-seob)! Thanks NSF! Spirit and Mage accepted to SOSP’25! Found In Translation accepted to USENIX Security’25! Weave accepted to OSDI’25! CORD accepted to ISCA’25! PULSE accepted to ASPLOS’25! [2024] NetApp Faculty Fellowship! Thanks NetApp! Yupeng has successfully defended his Thesis! Congrats Dr. Tang! Length leakage in oblivious storage accepted to USENIX Security’24! Trinity accepted to EuroSys’24, wins Best Student Paper Award! Congratulations Ziming Mao! PromptCache accepted to MLSys’24! SCALO selected for inclusion in IEEE Micro’s Top Picks in Computer Architecture in 2024! [2023] SCALO accepted to ISCA’23, wins Best Paper Award! Work on using Complementary Learning Systems for prefetching in disaggregated memory accepted to HotOS’23! Karma accepted to OSDI’23! Received Roberts Innovation Fund Award for work on resource disaggregation! [2022] Congratulations to Ziming Mao for CRA Outstanding Undergraduate Researcher Award (runner up)! Shepherd accepted to NSDI’23! NSF Award to build disaggregated & serverless infrastructure for virtualizing Massive MIMO PHY layer (with Lin)! Thanks NSF! Shortstack accepted to OSDI’22! Jiffy accepted to EuroSys’22! [2021] MIND accepted to SOSP’21! Member of NSF AI Institute for Edge Computing Leveraging Next-generation Networks! NSF Award for work on Pancake (with Rachit and Tom)! Thanks NSF! What serverless computing is and should become published in CACM! NetApp Faculty Fellowship (with Abhishek Bhattacharjee)! Thanks NetApp! NSF CAREER Award! Thanks NSF! Caerus accepted to NSDI’21! [2020] Pancake accepted to USENIX Security’20, wins Distinguished Paper Award! Le Taureau accepted to SIGMOD’20! Started at Yale! Research You can find a full list of my publications here. OS Stack for Disaggregated & Serverless Architectures: Spirit: Fair Allocation of Interdependent Resources in Remote Memory Systems [SOSP’25] [Code] Scalable Far Memory: Balancing Faults and Evictions [SOSP’25] [Code] CORD: Low-Latency, Bandwidth-Efficient and Scalable Release Consistency via Directory Ordering [ISCA’25] [Code] PULSE: Accelerating Distributed Pointer-Traversals on Disaggregated Memory [ASPLOS’25] [Code] Exploring Intelligent Dynamic Resource Provisioning for Elastic Massive MIMO vRAN [HotMobile’25] PromptCache: Modular Attention Reuse for Low-latency Inference [MLSys’24] Karma: Resource Allocation for Dynamic Demands [OSDI’23] Prefetching Using Principles of Hippocampal-Neocortical Interaction [HotOS’23] Shepherd: Serving DNNs in the Wild [NSDI’23] Jiffy: Elastic Far-Memory for Stateful Serverless Analytics [EuroSys’22] [Code] MIND: In-Network Memory Management for Disaggregated Data Centers [SOSP’21] [Code] What serverless computing is and should become: the next phase of cloud computing [CACM’21] Caerus: NIMBLE Task Scheduling for Serverless Analytics [NSDI’21] Le Taureau: Deconstructing the Serverless Landscape & A Look Forward [SIGMOD’20] A Berkeley View on Serverless Computing [UC Berkeley Tech Report] Secure cloud systems: Found in Translation: A Generative Language Modeling Approach to Memory Access Pattern Attacks [USENIX Security’25] [Code] Weave: Efficient and Expressive Oblivious Analytics at Scale [OSDI’25] [Code] Length Leakage in Oblivious Data Access Mechanisms [USENIX Security’24] Shortstack: Distributed, Fault-tolerant, Oblivious Data Access [OSDI’22][Code] Pancake: Frequency Smoothing for Encrypted Data Stores [USENIX Security’20] [Code] High-performance storage stacks for automated data: TRINITY: A Fast Compressed Multi-attribute Data Store [EuroSys’24] [Code] SCALO: An Accelerator-Rich Distributed System for Scalable Brain-Computer Interfacing [ISCA’23] Distributed Monitoring & Diagnosis Stack for High Speed Networks [NSDI’19], [Code] (Prior work) Queries on compressed data: Succinct: Enabling Queries on compressed data [NSDI’15], [Code: C++], [Code: Java] BlowFish: Dynamic Storage-Performance Tradeoff in Data Stores [NSDI’16] Sprint: Regular Expression Queries on Compressed Data [Tech Report], [Code] ZipG: Serving Queries on Compressed Graphs [SIGMOD’17] Research Group Postdocs: Seung-seob Lee (with Lin Zhong) PhD Students: Current: Yanpeng Yu (with Lin Zhong) Grace Jia Mahdi Soleimani Yash Lala Past: Yupeng Tang -> Meta Research Undergraduates: Past: Jeff Ma -> PhD, U. Michigan Ziming Mao -> PhD, UC Berkeley Teaching CPSC 422/522: Operating Systems Spring 2024, Spring 2025 CPSC 433/533: Computer Networks Spring 2020, Spring 2021, Spring 2022 CPSC 438/538: Big Data Systems Fall 2020, Fall 2021. Fall 2023 Service Program Committees: 2025: OSDI, NSDI 2024: OSDI, SOSP, EuroSys 2023: CoNEXT (Poster Co-Chair), NSDI, EuroSys 2022: NSDI, HotNets, EuroSys 2021: JSys, NSDI 2020: SIGCOMM (Poster/Demo, SRC), ASPLOS (EPC), NSDI",
  "content_length": 5089,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:30"
}