{
  "name": "Anwitaman Datta",
  "homepage": "https://www3.ntu.edu.sg/home/anwitaman",
  "status": "success",
  "content": "Anwitaman Datta @ NTU Singapore From the fall of 2024, I am on leave from NTU and I shall be working at the Cyber Technology Institute at DMU, Leicester, UK as a Professor of Cyber Security. I joined NTU Singapore in 2006, where I hold the position of an Associate Professor in the College of Computing and Data Science. I did my undergraduate studies at IIT Kanpur, India and my doctoral dissertation at EPFL, Switzerland. During 2014-2018 I was a co-founder and non-executive director of Qiv Storage Pte Ltd. Between 2019-2023, I served as a Senior Scientific Officer in a consulting role with QPQ.IO. Distributed ledgers and DeFi I am working on mechanisms enabling decentralized finance and the issues of interoperbility, sovereign identity and access control over assets & information across federation of distributed ledgers. Societal impact of technology I am working on topics spanning social media & network analysis, privacy, cyber-risk analysis & management, cryptocurrency forensics and the governance of disruptive technologies (RegTech). Distributed systems I like working on diverse bread & butter distributed systems research topics such as system availability, integrity, consistency, scalability and security in the context of both mature as well as novel or emerging systems and setups. Cybersecurity: Post Breach On Ransomware, Cyber-armies and Malicious AI Bitcoin Forensics Blockchain for Government Tutorial on Bitcoin network analysis & forensics Sextortion case studies Developing Data Products This undergraduate course for NTU's degree programme in Data Science and Artificial Intelligence (DSAI) offered jointly by the School of Computer Science and Engineering (SCSE) and the School of Physical and Mathematical Sciences (SPMS) is hands-on in its treatment, and looks at the challenges, the corresponding solutions and the underlying principles essential for developing data products. See the Course Site for more details and my teaching material. Advanced Topics in Distributed Systems In this graduate (PhD) level course, students learn some basic principles of distributed computing and systems, and some selected and timely advanced topics focusing on specific niche distributed systems. Specifically, I currently teach about RAID and (erasure coding based) RAIN storage, cloud scale file systems used in data centre environments, and blockchain technologies. My Teaching material: RAID & beyond, Cloud scale storage, Cryptocurrencies and blockchain An extended version of the first module of this course has also been delivered as part of GIAN at IIT Indore. Security (& Risks) Management Variations of this course are offered to undergraduate (computer science/engineering) and masters (in cyber-security) students. In it, problems associated with information and cyber-security management are studied. Case studies from real world secuity incidents are used to demonstrate practical approaches used by organisations to solve or mitigate these problems. My Teaching material: Introduction (slides|lecture notes), Information security governance & the law (slides|lecture notes), Risk analysis & assessments (slides|lecture notes), Contingency planning & management (slides|lecture notes). School of Computer Science and Engineering Blk N4 (office: 02A-18), North Spine Nanyang Avenue, Nanyang Technological University Singapore 639798 E-mail: firstname@ntu.edu.sg Phone: +65.6790.4855 Fax: +65.6792.6559",
  "content_length": 3438,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:31"
}