{
  "name": "Aparna Chandramowlishwaran",
  "homepage": "https://hpcforge.eng.uci.edu",
  "status": "success",
  "content": "HPC Forge Search HPC Forge HPC Forge is a scalable scientific machine learning research lab at the University of California, Irvine. Check out our recent Publications to see what we do. We are always looking for interested and motivated students/postdocs to join our team. If you are interested in joining our research lab, please email your CV and one representative publication (if any) to amowli@uci.edu. Aparna Chandramowlishwaran Associate Professor HPC Forge Department of Electrical Engineering and Computer Science Hi there! I’m an associate professor in the Department of Electrical Engineering and Computer Science at UC Irvine. My research is at the intersection of scientific machine learning and high-performance computing. I lead the HPC Forge research lab. I received my Ph.D in Computational Science and Engineering from Georgia Tech in 2013 in the HPC Garage. Prior to joining UCI, I was a research scientist at MIT CSAIL, where I worked on the X-Stack (exascale software stack) project. Interests Scientific machine learning Neural solvers Foundational models for science High-performance computing Performance analysis and modeling Education PhD in Computational Science and Engineering, 2013 Georgia Institute of Technology BE in Computer Science and Engineering, 2007 Anna University The Lab PhD Students Arthur Feeney PhD student, EECS, 2022-present MS in Computer Science, University of Massachusetts Amherst, 2021 BS in Computer Science, Trinity University, 2019 Current research: Scalable Neural Operators for Continuum Mechanics to Dynamics Zitong Li PhD student, EECS, 2022-present MS in Computer Science, Wake Forest University, 2022 BS in Computer Science, University of Nebraska-Lincoln, 2018 Current research: Sparse Kernels for Tensor Cores Shakeel Hassan MS/PhD student, EECS, 2022-present BTech in Electronics and Communication Engineering, National Institute of Technology Trichy, 2020 Current research: Autoregressive Neural Operators for Long-range Dynamics Xianwei Zou PhD student, EECS, 2024-present MS in Electrical and Computer Engineering, Carnegie Mellon University, 2024 BE in Telecommunication Engineering, Xidian University, 2021 Current research: Foundational Models for Multiphysics Kuei-Hsiang Huang MS/PhD student, EECS, 2024-present BS in Mathematics, National Tsing Hua University, 2024 Current research: Transformers and Scalable Attention for PDEs Alumni Srikar Arani EECS MS (2024) BS in Computer Engineering, University of California Santa Barbara, 2022 Sebastian Barschkis EECS MS (2023) BS in Computer Science, Ludwig Maximilian University of Munich, 2018 Octavi Obiols Sales MAE PhD (2022) Behnam Pourghassemi EECS PhD (2021) Hengjie Wang MAE PhD (2021) Shu-Mei Tseng EECS MS (2021) Rohit Zambre EECS PhD (2020) Laleh Beni CS PhD (2019) Ferran Marti Postdoctoral Scholar (2017 - 2018) Bahareh Davani EECS MS (2016) Recent Publications Wael Fatnassi, Arthur Feeney, Aparna Chandramowlishwaran, Yasser Shoukry November 2024 IEEE Transactions on Computer-Aided Design (IEEE TCAD) BERN-NN-IBF: Enhancing Neural Network Bound Propagation Through Implicit Bernstein Form and Optimized Tensor Operations PDF Cite Project Youngjoon Suh, Aparna Chandramowlishwaran, Yoonjin Won March 2024 npj Computational Materials Recent progress of artificial intelligence for liquid-vapor phase change heat transfer PDF Cite Project Sheikh Md Shakeel Hassan, Arthur Feeney, Akash Dhruv, Jihoon Kim, Youngjoon Suh, Jaiyoung Ryu, Yoonjin Won, Aparna Chandramowlishwaran December 2023 Neural Information Processing Systems Datasets and Benchmarks Track (NeurIPS Spotlight) BubbleML: A Multiphysics Dataset and Benchmarks for Machine Learning PDF Cite Project Arthur Feeney, Zitong Li, Ramin Bostanabad, Aparna Chandramowlishwaran November 2023 Proc. ACM/IEEE International Conference for High Performance Computing, Networking, Storage, and Analysis (SC) Breaking Boundaries: Distributed Domain Decomposition with Scalable Physics-Informed Neural PDE Solvers PDF Cite Project Octavi Obiols-Sales, Abhinav Vishnu, Nicholas Malaya, Aparna Chandramowlishwaran August 2023 International Conference on Parallel Processing (ICPP) ADARNet: Deep Learning Predicts Adaptive Mesh Refinement PDF Cite Project Project See all publications Projects HiPer A CFD solver for high-performance turbulent flow simulations Machine & Deep Learning HPC for accelerating ML/DL and DL for science Recent & Upcoming Talks Transferable Deep Learning Surrogates for Solving PDEs May 6, 2021 — Worldwide online event SPCL_Bcast online seminar at ETH Zurich Aparna Chandramowlishwaran Project Project Watch Only Relative Speed Matters -- Virtual Causal Profiling November 2, 2020 — November 6, 2020 Online IFIP Performance Behnam Pourghassemi Slides Watch Scalable Web Performance Analysis Using Causal Profiling August 4, 2020 — August 5, 2020 Online Google Future of the Mobile Web Workshop Behnam Pourghassemi On the Limits of Parallelizing Convolutional Neural Networks on GPUs July 14, 2020 — July 16, 2020 Online ACM Symposium on Parallelism in Algorithms and Architectures (SPAA) Behnam Pourghassemi Project Watch CFDNet - A deep learning-based accelerator for fluid simulations June 29, 2020 — July 2, 2020 Worldwide online event ACM International Conference on Supercomputing (ICS) Octavi Obiols Sales Project Project Watch See all talks Cite × Copy Download",
  "content_length": 5373,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:33"
}