{
  "name": "Aparna Bharati",
  "homepage": "https://sites.google.com/view/aparna-bharati",
  "status": "success",
  "content": "Aparna BharatiSearch this siteEmbedded FilesSkip to main contentSkip to navigationI am an Assistant Professor in the Department of Computer Science & Engineering at Lehigh University with research interests in the areas of Media Forensics, Computer Vision, Biometrics, Pattern Recognition and Machine Learning. I serve as a member of the IEEE Information Forensics and Security Technical Committee, IEEE Biometric Council's Editorial Board and PAMI-TC and have served in the program committee of venues such as CVPR, AAAI, WACV, IJCB, FG and ICPR.  Prior to coming to Lehigh, I received my Ph.D. from the University of Notre Dame where I was a research assistant for DARPA's MediFor project led by Drs. Kevin Bowyer, Walter Scheirer and Patrick Flynn and a member of the Computer Vision Research Lab. As a Machine Learning Research Intern in the Document Intelligence Lab at Adobe Research, I worked on document change analysis with Drs. Rajiv Jain and Vlad Morariu during the summer of 2019. In 2015, I graduated from IIIT-Delhi with a B. Tech in Computer Science & Engineering and specialized in Image Analysis and Machine Intelligence. My undergraduate research was supervised by Drs. Mayank Vatsa and Richa Singh. Prospective Students: I am looking for motivated M.S., Ph.D. students. Please email at aparna.bharati@lehigh.edu with details about your experience, areas of interest and reasons for pursuing graduate studies/research. Research Statement: Major goals of my work are the following:Re-establish trust in visual media and popular information mediumsUnderstand human perception to modify modern forensic approachesImprove generalizability of models used for visual learningDive deeper into visual tasks that humans may not be proficient inRelevant Links : News Paper on Understanding Human-like Biases in VLMs via Subjective Face Analytics accepted to WACV 2026. Preprint coming soon!Organizing the workshop on Visual Art, GenAI and the Legal/Ethical Dilemma (VALED) at WACV 2026.Paper on Right Looks, Wrong Reasons: Compositional Fidelity in Text-to-Image Generation will be presented at AAAI 2026. Pre-print of our work on StyleProtect: Safeguarding Artistic Identity in Fine-tuned Diffusion Models is now available!Delivered a keynote talk on Tracing the Hidden Trails: Provenance, Leakage, and Privacy in Synthetic Multimedia at ACM IHMMSec 2025Doctoral Consortium Chair, WACV 2026Paper on Is Perturbation-based Protection Disruptive to Image Editing? to be published in ICIP 2025Paper on Implications of Neural Compression for Scientific Images is accepted to ACM IHMMSec 2025Pre-print for From No to Know: Taxonomy, Challenges, and Opportunities for Negation Understanding in Multimodal Foundation Models is now available!Paper on Watermarks vs. Perturbations for Preventing AI-based Style Editing accepted to ICLR Workshop on GenAI Watermarking, 2025Paper on Learning the Power of \"No\": Foundation Models with Negations published at WACV, 2025Received a grant from PITA for research on Monitoring Health and Well-being through Videos on Edge Devices, 2025-2026Broadening Participation Chair, WACV 2025, IJCB 2025Paper on A Relative Data Diversity Measure for Synthetic Face Images accepted to IJCB, 2024Paper on Exploring Saliency Bias in Manipulation Detection accepted to ICIP, 2024Doctoral Consortium Chair, CVPR 2024Paper titled SynthProv: Interpretable framework for profiling identity leakage  accepted to WACV, 2024Short Paper titled IdProv: Identity-Based Provenance for Synthetic Image Generation accepted to AAAI, 2023Program Chair, ACM IHMMSec Workshop, 2023Associate Editor, Elsevier Pattern Recognition, 2023-PresentPaper titled A Computer Vision Method for Estimating Velocity from Jumps accepted to WACV Workshop on Computer Vision for Winter Sports, 2023Multi-Demographic Retouched Faces Dataset with Human Responses - IJCB 2022 Data ReleasePC Member, AAAI 2023Awarded two PITA grants for work on Visual Summarization and Defect Detection, 2023Received GHC Faculty Scholarship, 2022Joined PAMI-TC as the Web Operations Officer. Keep up with the community via the monthly newsletter and LinkedIn, May 2022Book chapter published in the new book on Multimedia Forensics published by Springer, 2022Area Chair, IAPR International Conference on Pattern Recognition (ICPR), 2022Reviewer, IEEE/CVF CVPR, ECCV, ICASSP 2022Paper on Athlete Performance Evaluation using Video accepted to WACV's Computer Vision for Winter Sports Workshop, 2022Area Chair, IEEE International Conference on Automatic Face and Gesture Recognition (FG), 2021Paper on Fast Local Spatial Verification for Feature-Agnostic Large-Scale Image Retrieval accepted to IEEE Trans. on Image Processing (TIP), July 2021Program Committee Member for Workshop on Face and Gesture Analysis for COVID-19 (FG4COVID19) @ FG2021Demo co-chair for IEEE International Conference on Automatic Face and Gesture Recognition, 2021Invited Talk at Women in Data Science, Bethlehem Chapter meeting 2021Elected member of the IEEE IFS Technical Committee, Jan 2021Our work on learning Transformation-Aware Embeddings for Image Provenance got accepted to IEEE Trans. on Information Forensics & Security (TIFS), Dec 2020Media Coverage - Interview with WIRED, read full story here , Oct 2020Invited talk at University of Campinas, Brazil on Vision and Learning-based Methods for Image Forensics, Aug 2020, (Online)Invited talk at Texas A&M University on Provenance Analysis: A step beyond forgery detection, March 2020, College Station, TXInvited talk at Facebook AI on Media Provenance Analysis, Feb 2020, Menlo Park, CAInvited to attend the Grad Cohort Workshop organized by CRA in New Orleans, LA (April 16-April 18, 2020)Attended the Grace Hopper Celebration 2019 in Orlando, FL (Oct 1-Oct 4, 2019)Was on Internship at the Document Intelligence Lab, Adobe Research for Summer'19 (June, 2019 - Sept, 2019)Won the Annual CSE Department Poster Competition at the University of Notre Dame (March, 2019)Presented our work on Image Provenance Analysis Leveraging Metadata at WACV, 2019, Hawaii (Jan, 2019)Invited talk on Demography-based Facial Retouching Detection at the Demographic Variations in Performance of Biometric Algorithms workshop at WACV, 2019, Hawaii (Jan, 2019)Contact: Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 6303,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:32"
}