{
  "name": "Apostolos Traganitis",
  "homepage": "https://www.csd.uoc.gr/index.jsp?custom=apostolos_traganitis",
  "status": "success",
  "content": "Απόστολος Τραγανίτης | Τμήμα Επιστήμης Υπολογιστών - Πανεπιστήμιο Κρήτης Επικοινωνία Ανακοινώσεις | Νέα Τρίπτυχο του Τμήματος GR EN webmailelearneduportal Αρχική Σελίδα Άνθρωποι Επίτιμοι Διδάκτορες Απόστολος Τραγανίτης Απόστολος Τραγανίτης A+ A- Professor of Computer Science, University of Crete University of Crete Department of Computer Science P.O.Box 2208 Knossou Avenue GR-71409 Heraklion Crete, GREECE Affiliated Researcher to ICS-FORTH Institute of Computer Science (ICS) Foundation for Research and Technology - Hellas (FORTH) N.Plastira 100, Vassilika Vouton P.O Box 1385 GR-70013 Heraklion, Crete, GREECE Phone: +30 2810 391724 Fax: +30 2810 391601 E-mail: traganiATics.forth.gr Apostolos Traganitis, PhD - Professor Traganitis joined ICS, FORTH in 1988 and since then he co-ordinated and participated in a number of EEC and Nationally funded projects in the Wireless Communications and Health Care sector. He is also a professor in the Dept. of Computer Science of the University of Crete, where he teaches and does research in the areas of Digital Communications,. Wireless Networks, Communications Security, hardware design and biomedical engineering. During 1993 and 1994 he was a Visiting Research Fellow at the Center of Satellite and Hybrid Communications Networks (CSHCN) of the Institute of Systems Research (ISR), University of Maryland, USA. Previously he has been a Researcher in the Hellenic Navy Research Laboratory (GETEN), in charge of the Electronic Warfare Unit. He has been extensively involved in research, development, deployment and evaluation activities in the area of the security of Information, Health, and Wireless Communications Systems. His more recent activities include: the evaluation of the security aspects of the card-phones in Greece, the development of a contact less smart-card reader, the evaluation of hardware attacks to security protocols, the development of a secure m-commerce payment system using cellular telephony, the development of a system for monitoring off-the-air cellular communications, and the development of a contributory cipher key generation and distribution in ad hoc wireless networks using Elliptic Curve Cryptography. Prof. Traganitis holds a M.Sc. and a PhD degree from Princeton University, USA, and the Diploma in Electrical Engineering from the National Technical University of Athens. Copyright © 2025, Τμήμα Επιστήμης Υπολογιστών - Συντελεστές - Σχόλια για Ιστότοπο",
  "content_length": 2446,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:35"
}