{
  "name": "Apostolos Meliones",
  "homepage": "https://www.ds.unipi.gr/en/faculty/meliones-en",
  "status": "success",
  "content": "Apostolos Meliones - Department of Digital Systems Skip to content Apostolos Meliones Phone +30 210-4142762 Email meliones@unipi.gr Title Professor Office Hours Tuesday 11:00-13:00 - Wednesday 15:00-17:00 Office 201 (150, Androutsou Str, Piraeus, 18532) Courses Development of Telecommunication Systems — 7th semester Computer Architecture — 2nd semester Embedded Systems — 8th semester Distributed Systems — 8th semester Logic and Logic Programming — 1st semester Brief CV Dr. Apostolos Meliones received a diploma with honours in Computer Engineering and Informatics from the University of Patras, in 1994, and a Ph.D. degree in distributed systems and telecoms from the National Technical University of Athens, in 1999. Since 1994 to 1999, he held a research position at NTUA. He was the initiator and coordinator of the ESPRIT INNO Technology Transfer Node on High Performance Computing and Networking, and of the successful ESPRIT EROPPA project on the use of metacomputing and distributed supercomputing in the post-production industry. From 2001 until 2005 he was Technical Manager of Network Embedded Systems at Ellemedia Technologies, a Lucent product development partner. In January 2006 he joined inAccess Networks, as an R&D Manager. Mr. Meliones was the project manager of the ESA SATWAYS, Eurostars Z-PHONE and NetHomEra, HTCI/A2, ESPRIT EROPPA and INNO TTN, Tender III/98/028 Tetramed, and several national research activities, coordinator of the application of the Hellenic Semiconductor Industry Association in the framework of the Hellenic Technology Cluster Initiative and member of the Project Coordination Committee of ICT-FET ATRACO, CELTIC IMPULSE and GENIO, ENIAC END and AAL PeerAssist projects. He is the Project Manager of the recent T1RCI-593 MANTO R&D project that developed innovative state-of-the-art autonomous outdoor and indoor blind navigation applications using smartphones, and of the KALLIPOS+ open access coursebook 556 on Embedded Systems. He non-profitably designed and implemented and put into production the widely used talking books web library of the Lighthouse for the Blind of Greece, which hosts more than 6,000 audiobooks (27,000 certified visits and 9,000 audiobook downloads in 2024). Currently he is a Full Professor at the Department of Digital Systems, University of Piraeus, where he has been teaching since 2005. He has received the Bodosakis Foundation grant and State Scholarships Foundation awards for excellence in academics. He is the author of over 100 publications in the areas of distributed systems, metacomputing, fault-tolerant supercomputing, total quality management of broadband networks, network embedded systems, telecommunication systems, audiovisual systems, real-time systems, industrial HPCN, satcom applications and pervasive computing. He is the developer of the open source MPC8260 Linux ATM device driver for the PowerQUICC-II family of communication processors which has been widely used worldwide. Publications I) INTERNATIONAL SCIENTIFIC JOURNALS A. Meliones, G. Mantzoros, Robust Finding of Vertical Roads on a Navigation Route, Accepted for publication, Special Issue on Navigation and Positioning Based on Multi-Sensor Fusion Technology, Applied Sciences, MDPI, 2025. N. Stavrou, J. Morelos, D. di Francesco, A. Meliones, P. Progias, D. Duncan, Development, Verification and Certification of a Digital Twin for a Voyage Data Recorder, Data-Centric Engineering, Cambridge University Press, 2025, doi:10.1017/dce.2024.59. P. Theodorou, A. Meliones, K. Tsiligkos, M. Sfakianakis, ‘Blind Indoor Navigation App for Enhancing Accessible Tourism in Smart Cities’, Tourism Review, Oct. 2024, Emerald Publishing, Vol. ahead-of-print No. ahead-of-print. https://doi.org/10.1108/TR-02-2024-0123. Theodorou, P., Tsiligkos, K., Meliones, A., Challenges in Acceptance of Smartphone-Based Assistive Technologies – Extending the UTAUT Model for People with Visual Impairments, Journal of Visual Impairement and Blindness, 118(1), March 2024, American Foundation for the Blind, Sage Journals, DOI: 10.1177/0145482X241231990. P. Theodorou, K. Tsiligkos, A. Meliones, Multi-Sensor Data Fusion Solutions for Blind and Visually Impaired: Research and Commercial Navigation Applications for Indoor and Outdoor Spaces, Sensors, 2023, Volume 23, Issue 12, 5411, doi: 10.3390/s23125411. P. Theodorou, K. Tsiligkos, A. Meliones, C. Filios, A Training Smartphone Application for the Simulation of Outdoor Pedestrian Navigation for People with Blindness: Usabillity, UX Evaluation, Sentiment Analysis, Sensors 2023, 23(1), 367; https://doi.org/10.3390/s23010367. Theodorou, P., Tsiligkos, K., Meliones, A., & Tsigris, A. An extended usability and UX evaluation of a mobile application for the navigation of individuals with blindness and visual impairments indoors: An evaluation approach combined with training sessions. British Journal of Visual Impairment, 42(1), pp. 1-38, October 2022, https://doi.org/10.1177/02646196221131739. Τheodorou, P.; Tsiligkos, K.; Meliones, A.; Filios, C. An Extended Usability and UX Evaluation of a Mobile Application for the Navigation of Individuals with Blindness and Visual Impairments Outdoors—An Evaluation Framework Based on Training. Sensors, 22(12), 4538, June 2022, https://doi.org/10.3390/s22124538. P. Theodorou, A. Meliones, C. Filios, Smart traffic lights for people with visual impairments: A literature overview and a proposed implementation. British Journal of Visual Impairment, 41(1), pp. 1 –29, June 2022, Sage Journals, https://doi.org/10.1177/02646196221099154. P. Theodorou and A. Meliones, Gaining insight for the design, development, deployment and distribution of assistive navigation systems for blind and visually impaired people through a detailed user requirements elicitation. Universal Access in the Information Society, Vol. 22, Springer, 2023 (published online June 2022), https://doi.org/10.1007/s10209–022–00885–9. A. Meliones, C. Filios, J. Llorente, Reliable Ultrasonic Obstacle Recognition for Outdoor Blind Navigation. Technologies, 10, 54, April 2022, MDPI, https://doi.org/10.3390/technologies10030054, (Editor’s Choice Paper, Candidate for Technologies 2024 Best Paper Award). A. Meliones and D. Pappas, ‘Data Fusion and Tracking in a Simulated Multiradar Air Command and Control System’, Journal of Sensing and Imaging, 21(44), August 2020, Springer, DOI: 10.1007/s11220-020-00303-5. A. Tsigris and A. Meliones, ‘Highly Accurate Step Length and Walking Distance Estimation using Smartphones’, IEEE Sensors (under review). A. Tsigris and A. Meliones, ‘Highly Accurate Step Detection Algorithm at Various Walking Speeds using Smartphones’, IEEE Sensors (under review Sensors-34354-2020). A. Meliones and N. Stavrou, ‘AITHALES Autonomous M2M Satellite Tracking Embedded System Harvesting Ambient Energy: Land and Sea Applications’, IEEE Transactions on Industrial Informatics (under review). P. Theodorou and A. Meliones, ‘Towards a Training Framework for Improved Assistive Mobile App Acceptance and Use Rates by Blind and Visually Impaired People’, Education Sciences, MDPI, 10, 58, March 2020, doi:10.3390/educsci10030058. A. Meliones, E. Touloupis, J. Perello, Embedded Parallelism Enabling Ultralow-Power Zigbee Voice Communications, Journal of Computer Networks and Communications, Wiley, 14p., Feb 2019, https://doi.org/10.1155/2019/6595282. A. Meliones and D. Sampson, «Blind MuseumTourer: A System for Self-Guided Tours in Museums and Blind Indoor Navigation», Technologies, 2018, 6(4), MDPI, doi:10.3390/technologies6010004 S. Apostolacos, A. Meliones (corr.), S. Badessi, G. Stassinopoulos, “Adaptation of the E-model for satellite internet protocol radio calls in Air Traffic Control”, IEEE Transactions on Aerospace and Electronic Systems, 50(1), January 2015. A. Meliones, S. Apostolacos, A. Nouvaki, «A Web-based Three-Tier Control and Monitoring Application for Integrated Facility Management of Photovoltaic Systems», Applied Computing and Informatics, Elsevier, 2014, 10(1-2), 14–37. E. Touloupis, A. Meliones (corr.), S. Apostolacos, «Speech Codecs for High Quality Voice-over-ZigBee Applications: Evaluation and Implementation Challenges», IEEE Communications Magazine, 50(4): 122-128, April 2012. H. Hangras, C. Wagner, A. Kameas, C. Goumopoulos, A. Meliones (corr.), L. Seremeti, Y. Bellik, G. Pruvost, T. Heinroth, W. Minker, «Symbiotic Ecologies in Next Generation Ambient Intelligent Environments», International Journal of Next Generation Computing, March 2012, pp. 52-86. S. Apostolakos, A. Meliones (corr.), G. Lykakis, E. Touloupis, V. Vlagoulis, «Design, Implementation and Validation of an Open Source IP-PBX/VoIP Gateway Multi-Core SoC», International Journal of Parallel Programming, Springer, 38(3-4): 288-302, June 2010. S. Spanos, A. Meliones (corr.), G. Stassinopoulos, ‘The Internals of Advanced Interrupt Handling Techniques: Performance Optimization of an Embedded Linux Network Interface’, Computer Communications, Elsevier, 31(14): 3460-3468, September 2008. S. Apostolacos, M. Manoussos, A. Meliones (corr.), D. Kavadas, G. Lykakis, M. Kardaris, K. Simaiakis, ‘Design and Implementation of a Solution for the Provisioning of Converged Remote Tower and Facility Management Services over Satellite IP for Greek Heliports’, IEEE Communications Magazine, 46(8),  August 2008. V. Lawrence, N. Zervos, T. Zahariadis, A. Meliones, ‘Digital Gateways for Multimedia Home Networks’, Telecommunication Systems (TELS), Kluwer Academic Publishers, 23(3/4):335-349, July/August 2003. A. Meliones, Α. Karidis, ‘Distributed High-End Audio-Visual Content Creation: An Experience Report’, Computer Supported Cooperative Work (CSCW), Kluwer Academic Publishers, 10(3/4):373-386, January 2001. Y. Manolessos, G. Prezerakos, A. Meliones, M. Theologou, ‘A TQM-based Approach to QoS Management’, Journal of Network and Systems Management (JNSM), Kluwer Academic/Plenum Publishers, 8(2):191-218, June 2000. A. Meliones, T. Varvarigou, P. Tsagronis",
  "content_length": 63926,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:36"
}