{
  "name": "Apostolos Gerasoulis",
  "homepage": "https://www.cs.rutgers.edu/~gerasoul",
  "status": "success",
  "content": "Apostolos Gerasoulis Apostolos Gerasoulis, Professor: Interests: Numerical Computing, Information Retrieval and Extraction, Search Engines, Data Mining and Machine Learning in Financial Data. Teaching: CS672: Recommendations and Search Engines-A Social Network Approach Class Webpage Recent Patents:United States Patent Office- Search Engines. A list of Papers: Can be found in Google Scholar Founder,CEO and CTO : a Rutgers technology transfer search engine company. Teoma was bought by Ask Jeeves in September 11, 2001 when Ask Jeeves was valued at $40 Million. Teoma had a significant impact in the survival and turnaround of Ask Jeeves which was sold to an IAC Interactive company in 2005 for $1.85 Billion. David A. Vice in his book \"The Google Story\" (Chapter 11-The Google economy, page 128.) argues that because of Teoma Ask Jeeves adopted the Google adwords and indirectly influencing the establishement of the internet economy. From 2001 until today I have been associated with ask.com as an Executive Vice President, where at times I have managed over 200 engineers and scientists and developed several key products for ask.com. TV Commercials: The following unscripted TV commercials were directed by Berlin Cameron Company and were edited in colaboration with Sydney Polack an award winning Hollywood director and actor. They were used by ask.com national TV campaigns during 2007-2008 time period. Rims shot at my house Bear Attack was shot at Rutgers University Librarians was shot at Rutgers Library Poetry with Eli Gerasoulis Publicity: The Teoma search engine is one of the few search engines that has been developed in a University and successfully being commercialized. There have been thousands of articles written in newspapers and blogs a sample is given below: In a Tech Nation Interview Dr. Moira Gunn argued that Dr. Gerasoulis might be the first computer scientist and mathematician that has acted on his own TV commercials-a claim that needs to be verified!. A BBC TV Interview on Search Engines and SEO An article in ZEIT newspaper An interview with e-marketing news Los Angeles Times article on Teoma USA Today Teoma article More information can be found in the following link Watch TV Online OLDER RESEARCH PROJECTS A graduate seminar will be given in the Fall of 2008. A short description can be found Here Performance Clique here for the UMD/Rutgers/Syracuse performance prediction project. DiscoWeb Research on a new search Engine using link analysis. HPCD: Click here to go to HPCD Research info. Number of visitors since 09/15/1999. Powered by CounterBot.com Last Updated August 15 2010.",
  "content_length": 2623,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:36"
}