{
  "name": "Appie van de Liefvoort",
  "homepage": "http://umkc.academia.edu/appieLiefvoort",
  "status": "success",
  "content": "appie van de Liefvoort - University of Missouri Kansas City Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless appie van de LiefvoortUniversity of Missouri Kansas City, School of Computing and Engineering, ProfessoraddFollowdoneFollowingFollowers23Following7Public ViewsThis bio will be updated after I see what/where etc.lessRelated Authors Sharmila Chopade Ishu Bansal Tarik TalebAalto University Julian Garbiso Mohammad MukhtaruzzamanUniversity of Oklahoma Haleem FarmanUniversity Of Peshawar Sahar EbadinezhadCyprus Near East University Mohammed AtiquzzamanUniversity of Oklahoma Edris Khezri Saleh KhawatrehInterests UploadsPapers by appie van de LiefvoortPartial Packet Duplication: Control of Fade and Non-Fade Duration Outages using Matrix Exponential DistributionsIEEE Transactions on Vehicular Technology, 2020Several vehicular ad hoc network (VANET) studies have focused on communication methods based on I... more Several vehicular ad hoc network (VANET) studies have focused on communication methods based on IEEE 802.11p, which forms the standard for wireless access for vehicular environments. In networks employing IEEE 802.11p only, the broadcast storm and disconnected network problems at high and low vehicle densities, respectively, degrade the delay and delivery ratio of safety message dissemination. Recently, as an alternative to the IEEE 802.11p-based VANET, the usage of cellular technologies has been investigated due to their low latency and wide-range communication. However, a pure cellular-based VANET communication is not feasible due to the high cost of communication between the vehicles and the base stations and the high number of handoff occurrences at the base station, considering the high mobility of the vehicles. This paper proposes a hybrid architecture, namely, VMaSC-LTE, combining IEEE 802.11p-based multihop clustering and the fourth-generation (4G) cellular system, i.e., Long-Term Evolution (LTE), with the goal of achieving a high data packet delivery ratio (DPDR) and low delay while keeping the usage of the cellular architecture at a minimum level. In VMaSC-LTE, vehicles are clustered based on a novel approach named Vehicular Multihop algorithm for Stable Clustering (VMaSC). The features of VMaSC are cluster head (CH) selection using the relative mobility metric calculated as the average relative speed with respect to the neighboring vehicles, cluster connection with minimum overhead by introducing a direct connection to the neighbor that is already a head or a member of a cluster instead of connecting to the CH in multiple hops, disseminating cluster member information within periodic hello packets, reactive clustering to maintain the cluster structure without excessive consumption of network resources, and efficient size-and hop-limited cluster merging mechanism based on the exchange of cluster information among CHs. These features decrease the number of CHs while increasing their stability, therefore minimizing the usage of the cellular architecture. From the clustered topology, elected CHs operate as dual-interface nodes with the functionality of the IEEEarrow_back_iosarrow_forward_iosDownload Mission Critical Publish Subscribe Performance Modeling Using Linear Algebraic and Classical MethodsSociety for Computer Simulation International, Apr 12, 2015Modeling Service Oriented Architecture (SOA) Publish-Subscribe (Pub/Sub) message patterns using q... more Modeling Service Oriented Architecture (SOA) Publish-Subscribe (Pub/Sub) message patterns using queueing models is challenging for several reasons. Most queueing models assume a work conserving approach where a pass-thru server does not create jobs. However in the Pub-Sub message pattern, a message can be duplicated at any message node along the route to be delivered to a different destinations, forming a tree type distribution. Also, most analytic performance models of large networks make simplifying assumptions for the arrival and service processes to keep the models tractable. These assumptions may affect the accuracy of the model significantly. In this work, we construct analytic and simulation performance models for Pub/Sub messaging systems. The analytic performance model which uses Linear Algebraic Queueing Theory (LAQT) is both scalable, reasonably accurate with low to medium utilization, and enables interesting and important new research directions like the study of correlation in traffic flows across a network. Matrix-Exponential distributions are used to model general arrival and service processes (Gi/G/1). A second analytic model constructed is a variation of the classic model Queueing Network Analyzer (QNA) with customer creation for Pub/Sub. Finally, we use a simulation model both to validate the QNA and LAQT models. We test these models on a network of 9 nodes with up to 12 products. Realization from both the Markov parameters and the momentsProceedings of the 32nd Midwest Symposium on Circuits and SystemsAbstract The minimal realization problem is compared with the classical moment problem. A solutio... more Abstract The minimal realization problem is compared with the classical moment problem. A solution to the realization problem, from both the Markov parameters and some time moments, is seen to be comparable to the strong Stieltjes moment problem. Gragg&amp;amp;#x27;s algorithm is used to obtain a solution for this situation in the continuous time case A case study on evaluating the benefits of MPLS traffic engineering through constraint-based routing and network controls2002 IEEE International Conference on Communications. Conference Proceedings. ICC 2002 (Cat. No.02CH37333)In this paper, we attempt to understand the benefits of MPLS traffic engineering through a case s... more In this paper, we attempt to understand the benefits of MPLS traffic engineering through a case study. Specifically, we do a comparative study of MPLS traffic engineering in the presence of constraint-based routing compared to destination-based routing. For this case study, we use an actual data set obtained from a real-life network. Different control schemes that can be deployable for MPLS traffic engineering are also considered. This case study shows that services can indeed obtain benefits from constraint-based routing and traffic engineering controls.Download Traffic engineering in tunnel-based networks in the presence of heterogeneous streamsABSTRACT Investigations into a command and response language interface[1988] Proceedings of the Twenty-First Annual Hawaii International Conference on System Sciences. Volume II: Software trackAbstract Access to the variety of resources offered by computer networks is often complicated by ... more Abstract Access to the variety of resources offered by computer networks is often complicated by the diversity of interfaces and protocols encountered. To overcome this diversity, a command-and-response language interface to a network of heterogeneous systems is proposed. A brief account of previous work in command languages and system interfaces motivates the study of a prototype of the proposed interface. The design, implementation, and lessons learned through the successful realization of the prototype ... Approximation models of wireless cellular networks using moment matchingIEEE Journal on Selected Areas in Communications, 2001In this paper we present an analytical model for micro-and pico-cell wireless networks for any ar... more In this paper we present an analytical model for micro-and pico-cell wireless networks for any arbitrary topology in a high mobility environment. We introduce an approximation technique which uses a single cell decomposition analysis which incorporates moment matching of hand-off processes into the cell. The approximation technique is novel in that it can provide close approximations for non-Poisson arrival traffic and it is easily parallelized. Performance measures such as new calls blocked and hand-off calls lost are presented for any general call arrival distribution in a non-homogeneous traffic environment. We produce some numerical examples for some simple topologies with varying mobility for several call arrival distributions and compare our results to those from simulation studies.Download Traffic engineering of MPLS backbone networks in the presence of heterogeneous streamsComputer Networks, 2009Heterogeneous streams (due to issues such as disparate traffic characteristics of each stream, or... more Heterogeneous streams (due to issues such as disparate traffic characteristics of each stream, or competing customers' traffic) raise the issue of whether to multiplex (some of) these streams. In an MPLS network, such multiplexing can be considered by putting different streams into a tunnel identified by a single label switched path (LSP), assuming that the different LSPs are assigned a reserved share of the resources. This issue becomes even more important in the traffic engineering of a backbone network when a decision needs to be made on which streams to multiplex when there are constraints on tunneling and capacity along with routing requirements for tunnels. In this paper, we introduce a distortion factor due to heterogeneous streams in traffic engineering of MPLS backbone networks in the presence of tunneling and capacity constraints by formulating a distortion-aware nonlinear discrete optimization problem. Furthermore, we present a two phase heuristic approach to solve this formulation efficiently. In the first phase, the problem is decoupled into two subproblems and in the second phase we show how the non-linear problem (for one of the subproblems) can be simplified. We then present numerical results for both small and large netwo",
  "content_length": 18021,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:36"
}