{
  "name": "Arabella J. Sinclair",
  "homepage": "https://www.abdn.ac.uk/people/arabella.sinclair",
  "status": "success",
  "content": "Dr Arabella Sinclair | The University of Aberdeen Dr Arabella Sinclair Dr Arabella SinclairHonorary Lecturer About School/DepartmentSchool of Natural and Computing Sciences Biography I am an Honorary Lecturer in Computing Science at the University of Aberdeen, and start as Lecturer (Assistant Professsor) in Knowledge, Information and Data Science at UCL, in the Department of Information Studies in October 2025. I am very interested in exploring how humans adapt to one another as they interact or communicate. To that end, my work involves analysing human properties of language in a dialogue setting, analysing whether machine generated text contains human-like linguistic properties, and, more recently, analysing whether modern language models exhibit similar patterns to humans when exposed to certain linguistic phenomena. I am interested in applying my work to an educational setting, as well as exploring more general communicative properties of language. My research interests include Natural Language Processing, Computational Linguistics, Cognitive Science and Education. My undergraduate degree was in Computer Science at the University of Aberdeen, where I gained an interest in Natural Language Processing. I then went on to do a MPhil in advanced computer science at the University of Cambridge, where I was supervised by Simone Teufel. I then spent just under a year in Berlin working as a back end programmer in a software start up, after which I returned to Scotland to do my PhD in Computational Linguistics at the University of Edinburgh, where I worked with Jon Oberlander, Dragan Gašević , Adam Lopez and Chris Lucas. I then went on to do a postdoc at the University of Amsterdam, where I was part of the Dialogue Modelling Group, working with Raquel Fernández. I started at the University of Aberdeen in 2022, as a Lecturer of Computing Science, where I co-led our interdisciplinary Human Centred AI research network. I started The Context Lab in Aberdeen, and currently supervise 3 interdisciplinary PhD students on the topics of adaptive generation, structural priming in humans and LMs, and dialogic AI feedback for second language learning. Update",
  "content_length": 2177,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:38"
}