{
  "name": "Arambam James Singh",
  "homepage": "https://jamesarambam.me",
  "status": "success",
  "content": "Welcome to my webpage! I am currently an Assistant Professor at Yardi School of Artificial Intelligence, Indian Institute of Technology (IIT) Delhi. I did my postdoctoral research fellowships at Department of Computer Science, Nanyang Technological University (NTU) Singapore and National University of Singapore (NUS). I completed my PhD in Computer Science in August 2021 from School of Computing, Singapore Management University (SMU) advised by Prof. Akshat Kumar and Prof. Hoong Chuin Lau. I did my B.Tech from NIT Silchar, Assam. [Full Bio] Office Address:513-C, Academic Complex East Building [Direction] Indian Institute of Technology Delhi Hauz Khas, New Delhi, India.Email - jamesa@scai.iitd.ac.in Hiring I am looking for highly motivated PhD/MSR/MTech students to work in the field of Reinforcement Learning and Multi-Agent Learning. Candidates should have a strong mathematical background and good coding skills. Please apply through proper addmission channel and drop me an email. Students from IIT Delhi with strong coding skills are encouraged to apply for long-term projects (at least 1 year)/BTP/MTP/Minor Projects. If interested, please drop me an email with your latest CV. No vacancy for summer or winter internships or any short term projects. Research Interests My primary research interests are in Reinforcement Learning (RL) and Multi-Agent Learning. Below is a list of research areas I am currently working on: Reinforcement Learning Multi-Agent Learning Large-Scale Multi-Agent Systems Human-AI Interaction News I will be teaching Deep Learning (AIL7021/721) next semester (AY2025-2026 - II). Our paper, CRLLK: Constrained Reinforcement Learning for Lane Keeping in Autonomous Driving (demonstration track) is accepted in International Conference on Autonomous Agents and MultiAgent Systems (AAMAS-2025). Our paper, PAS: Probably Approximate Safety Verification of Reinforcement Learning Policy Using Scenario Optimization is accepted in International Conference on Autonomous Agents and MultiAgent Systems (AAMAS-2024). Professional Services Program Committee Member (Reviewer): AAMAS 2026-2025, AAAI 2026-2020, IJCAI 2024-2022, ICAPS 2024-2022, ICRA 2022, IAAI 2022 Journal of Artificial Intelligence Research (JAIR) Local Organizing Committee, AAMAS - 2016 Awards & Honours New Faculty Seed Grant, IIT Delhi - 2024 Young Faculty Incentive Fellowship, IIT Delhi - 2024 Dean List - 2021, 2020, 2019 for research excellence at School of Computing, Singapore Management University (SMU). SMU Presidential Doctoral Fellowship - 2020, 2019 for outstanding academic research achievements. Selected to attend Global Young Scientists Summit 2020. Fujitsu-SMU Ph.D Student Scholarship - (2017-2021). Gold Medal from National Institute of Technology Durgapur, India for M.Tech. 2014. Invited Talks Yardi School of Artificial Intelligence, IIT Delhi - April 2024. Department of Computer Science, IIT Delhi - April 2024. Department of Computer Science & Automation, IISc Banglore - March 2024. Department of Industrial Engineering & Operations Research, IIT Bombay - February 2024. Center for Machine Intelligence & Data Science, IIT Bombay - February 2024. Your Name Your Email Your Message Send now",
  "content_length": 3216,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:37"
}