{
  "name": "Arash Rafiey",
  "homepage": "http://cs.indstate.edu/info/people.php",
  "status": "success",
  "content": "Computer Science | College of Arts and Sciences Â­ Skip to main content Search form Search Note - the CS homepage has moved, and the site you are viewing is no longer current. If you just go to cs.indstate.edu, you will be redirected to the new site. Location We are located in Root Hall. See our location for details. Normal Hours for Department Office   8am-noon, 1-4:00pm Address   Math & CS Dept, ISU, 424 Nth 7th Street, Terre Haute, Indiana, 47809, USA Phone   812-237-2391     fax 812-237-4296 Who to Contact If you are not sure who to contact (after looking through the list below), you can contact the computer science administrative assistant: Brenda Lower - brenda.lower@indstate.edu, 812-237-2391, Root Hall A-141 Or you can contact the chairperson of the Math & CS department: Liz Brown - liz.brown@indstate.edu. Contact information for CS faculty, GAs and student workers: CS People. The following is a list of who to contact depending on your need. Academic misconduct - ?? Administrative issues - Mrs. Lower (exit survey) Budget - Dr. Exoo (S&E budget and supplies, ISU Foundation) Faculty evaluations - chairperson of CS personnel committee (Dr. Rafiey in 2022-2023) Faculty search/hiring - chairperson of CS search committee (Dr. Rafiey in 2022-2023 Graduate admissions - Dr. Exoo (admissions questions), Dr. Rafiey (admissions decisions), Mrs. Lower(application status questions and reminders) Graduate advising - Dr. Abhyankar (forms, transfer credit, graduate program director, probation/dismissals), Dr. Rafiey (course overrides) Graduate assistants - Dr. Rafiey (selection, supervision), Mrs. Lower (grad school forms) Labs and servers - Mr. May (systems administrator, equipment), purchases (Dr. Exoo) Library - Dr. Abhyankar Schedule of classes - Dr. Rafiey Seminar - Dr. Rafiey Undergrad admissions - Mr. May Undergrad advising - Mr. May (course overrides, TSAP), Dr. Kinne (transfer credit, students not yet declared as CS, CS placement test) Website - Mr. May (email lists, website), Dr. Kinne (wiki)",
  "content_length": 2028,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:39"
}