{
  "name": "Aravind Srinivasan",
  "homepage": "https://www.cs.umd.edu/~srin",
  "status": "success",
  "content": "Aravind Srinivasan's Home Page Aravind Srinivasan Hi, welcome to my home-page. I am a Distinguished University Professor and Professor of Computer Science, UMIACS, and AMSC, at the University of Maryland, College Park. My Wikipedia page provides a reasonable summary. Brief bio: Aravind Srinivasan's main research-interests are in algorithms, probabilistic methods, data science, network science, and machine learning: theory, and applications in areas including health, E-commerce, cloud computing, Internet advertising, and fairness. They span areas including: Algorithms, probabilistic methods, and continuous/combinatorial optimization; Interpretability and explainability in AI; The interface of algorithms, AI, and machine learning in: Data science and health: incl. computational epidemiology, (cancer) genomics, pharmacology, organ exchange, and medical devices. Data science and the Internet economy: incl. E-commerce, digital marketing, cloud optimization, crowdsourcing, and social networks. Data science and fairness: systematically incorporating (probabilistic, per-user/demographic) fairness in AI and in algorithms. Algorithms in networking (wireless and peer-to-peer), social networks, and distributed/parallel computing; Computational approaches to sustainable growth (incl. energy, monitoring and sensing, electric-power and water networks). Dr. Srinivasan received his PhD from Cornell University, and Bachelor's from IIT Madras. He is an elected Fellow of six professional societies: ACM, IEEE, AMS, AAAS, EATCS, and SIAM. He has been elected a Member of Academia Europaea, the Academy of Europe. He was appointed a Distinguished University Professor of the University of Maryland in 2020: this is the highest academic honor the university confers upon its faculty. He received a Distinguished Alumnus Award from his alma mater IIT Madras. He also received the Distinguished Faculty Award from the Board of Visitors of the College of Computing, Mathematical, and Natural Sciences (University of Maryland). He is a recipient of the Dijkstra Prize, the Danny Lewin Award, and the Distinguished Career Award in Computer Science from the Washington Academy of Sciences. One of his coauthored papers on forecasting/prediction received a KDD Test of Time Award. His past/current research has been funded by research awards from Adobe, Amazon, and Google, and by grants/contracts from the NSF, IARPA, the Laboratory for Telecommunication Sciences, and USARO. He serves as Associate Editor for the ACM Transactions on Algorithms (Editor-in-Chief, 2014-2020), as an Editor for Theory of Computing (Managing Editor, 2006-2019), and as an Editor for the Journal of the IISc. Srinivasan has also been serving as an Amazon Scholar since 2019. Expanded bio and full CV: Here are my expanded bio and a link to my CV (last updated: Nov. 11, 2025). For prospective students: Please read this if you wish to email me about admissions or about working with me. Education: B.Tech. (Computer Science & Engineering), Indian Institute of Technology Madras, 1989. Advisor: Prof. C. Pandu Rangan Ph.D. (Computer Science), Cornell University, 1993. Advisor: Prof. David B. Shmoys Postdoc: Institute for Advanced Study (Princeton) and DIMACS (Rutgers), 1993-94. Publications: My publications and co-authors. Teaching: I am teaching the class CMSC 454, Algorithms for Data Science, in Fall 2025; there will be significant similarities with a previous offering, with some new topics as well. Students: Please join the class' Piazza forum when the semester starts. My previous courses. Students: Current PhD Students: Sharmila Duppala, Kishen Gowda, Sanna Madan, Nitya Raju, and Renata Valieva. (Duppala co-advised with John P. Dickerson; Gowda co-advised with Laxman Dhulipala; Madan co-advised with Eytan Ruppin; Valieva co-advised with Leonid Koralov.) Graduated PhD Students: Dr. Brian Brubach, faculty member at Wellesley College; Dr. Amit Chavan, AWS --> Snowflake, Inc.; Dr. Tom DuBois, CTO of Maven --> Salesforce; Dr. Seyed Abdulaziz Esmaeili, Postdoc at MSRI/SLMath and the University of Chicago; Dr. Nathaniel Grammel, Swarthmore College; Dr. Bo Han, AT&T Labs Research --> faculty member at George Mason University; Dr. David G. Harris, U.S. Government; Dr. David Levin, faculty member at the University of Maryland; Dr. Juan Luque, Research Scientist at Meta; Dr. Srinivasan Parthasarathy, IBM T. J. Watson Research Center; Dr. Karthik Abinav Sankararaman, Research Scientist at Facebook; Dr. Khoa Trinh, Google Research; Dr. Leonidas Tsepenekas, J. P. Morgan Chase AI Research; Dr. Nan Wang, Bank of America Merrill Lynch; Dr. Pan Xu, faculty member at NJIT. (Brubach co-advised by Mihai Pop, Chavan co-advised by Amol Deshpande, Esmaeili co-advised by John P. Dickerson, Han co-advised by Bobby Bhattacharjee, Levin co-advised by Bobby Bhattacharjee and Neil Spring, Tsepenekas co-advised by John P. Dickerson, and Xu co-advised by John P. Dickerson.) Current/former MS students: Dr. Ioana Bercea, John Robert Cole, Evar Jones, Deepa Joy, Dan-Dan Lin, Geoffrey Moores, Tommy Pensyl, Danesh Sivakumar (external co-mentor: Amey Bhangale), Thomas Wrona, Jiayi Alvin Wu, and Michael Xie (co-advised by Dung Nguyen). Other current/former students with significant collaborations: Dr. Suman Banerjee, Dr. Rajiv Gandhi, Dr. Seungjoon Lee, Dr. Ruggero Morselli, and Dr. Barna Saha. Summer intern at Bell Labs: Dr. Adam Meyerson. Mentorship of undergrad Gemstone teams: On novel pharmaceutical drug-design processes through bioinformatics, machine learning, and computational toxicology, 2018-2019. On bio-engineering and computer science for medical devices, 2013-2016. On information interfaces for reducing information overload, 2011-2014. Undergraduate students: George Li (2020-2024), Jeffery Liu (2025-present), Jiayi Alvin Wu (2022-2025), Zach Zhao (2020-2021), and Kelin Zhu (2025-present). . Undergraduate independent study: Michael Eleff (Spring 2015). High-school students continuing through undergrad: Naveen Durvasula (2015-2022; co-advised by John Dickerson), Xiaoran (Steven) Qu (2017-2022; co-advised by Madhav Marathe and Anil Vullikanti), and Naveen Raman (2018-2020; co-advised by John Dickerson and Max Leiserson). High-school students: Antares Chen (2014-2015; co-advised by David Harris), Tanya Das (2021-2022; co-advised by Achla Marathe and Anil Vullikanti), Anushka Gandhi (2021-2022; co-advised by Achla Marathe and Anil Vullikanti), Tyler He (2025-present), Levon Mkrtchyan (2006), Arjun Subramanian (2023-present), Shreya Vallimanalan (2020-2021; co-advised by Anil Vullikanti), and Shawn Zhao (2019-2020; co-advised by Brian Brubach). Recent/Current Program Committees: Area Chair, ICML 2025; PC Member, SODA 2025; Area Chair, NeurIPS 2024; PC Member, SIGMETRICS 2023; Area Chair, ICLR 2023; PC Member, SIAM ACDA 2023; Area Chair, NeurIPS 2022; Area Chair, ICLR 2022; PC Member, SODA 2022; Area Chair, ICLR 2021; Area Chair, ICML 2020; Senior PC, AAAI 2020. Editorial Boards: Associate Editor, ACM Transactions on Algorithms (TALG; Editor-in-Chief, 2014-2020). Editor, Theory of Computing (ToC), an open-access journal (Managing Editor, 2006-2019). Editor, Journal of the IISc. Associate Editor, Networks, 2006-2019. Associate Editor, Journal of Computer and System Sciences (JCSS), 2004-2014. Editor, Journal of Discrete Algorithms (JDA), 2004-2012. Guest Co-editor, special issue of the SIAM Journal on Computing for selected papers from STOC 2010 (completed). Guest Co-editor, special issue of Theory of Computing Systems (2004) for selected papers from SPAA 2004 (completed). Guest Co-editor, special issue of JCSS (2004) for selected papers from STOC 2003 (completed). Links: My links are here. Contact: Room 4204 (note the change from before), Iribe Center Dept. of Computer Science University of Maryland at College Park College Park, MD 20742, USA Phone (email preferred): 301-405-2695, Fax: 301-405-6707 E-mail: asriniv1 AT umd DOT edu",
  "content_length": 7969,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:39"
}