{
  "name": "Archontis Politis",
  "homepage": "https://www.tuni.fi/en/archontis-politis",
  "status": "success",
  "content": "Archontis Politis | Tampere universitiesArchontis PolitisAssistant Professor, Signal Processing and Machine LearningFaculty of Information Technology and Communication Sciences | Computing SciencesTampere Universityarchontis.politis [at] tuni.fi (archontis[dot]politis[at]tuni[dot]fi)phone number+358504422417Hervanta CampusOrcidhttps://orcid.org/0000-0002-0595-2356About meI am an assistant professor in audio signal processing and machine learning at the Faculty of Information Technology and Communication Sciences of Tampere University, and part of the Audio Research Group and the Signal Processing Research Center.ResponsibilitiesApart from research and teaching at Tampere University, I am additionally a member of the European Association for Signal Processing (EURASIP) technical area committee on Acoustic, Speech, and Music Signal Processing, and a regular organiser in the DCASE Challenge. On the industry side, I am a co-founder of Aani, a spatial audio technology startup.Fields of expertiseMy research focus is on capturing, modeling, and rendering spatial properties of sound scenes using both signal processing and machine learning methods. Applications of the research range from 3D audio capture, spatial audio coding, spatial audio rendering, and audio for XR, to sound source localization and tracking, acoustic SLAM, and spatial machine listening. I am additionally interested in sound field modeling, virtual acoustics, and acoustical modeling in general.Top achievementsEditor of \"Parametric Time-Frequency Domain Spatial Audio\", Ville Pulkki, Symeon Delikaris-Manias, Archontis Politis, Wiley/IEEE Press, Dec. 2017.SPARTA/COMPASS advanced spatial audio production tools (with PhD supervisee Leo McCormack).Main organiser of Sound Event Localization and Detection task in DCASE Challenge, 2020-2024.Architect of the reference implementation of \"6DOF spatial audio rendering from multi-point recordings\" track in the MPEG-I standard for next-gen immersive media (together with Nokia Technologies).Research unitSignal Processing Research CenterLatest publicationsClass-Incremental Learning for Sound Event Localization and DetectionPandey, R., Mulimani, M., Politis, A. & Mesaros, A., 2025, 2025 IEEE International Conference on Acoustics, Speech, and Signal Processing Workshops (ICASSPW). IEEE, p. 1-5 (Proceedings of the IEEE International Conference on Acoustics, Speech, and Signal Processing).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewGen-A: Generalizing Ambisonics Neural Encoding to Unseen Microphone ArraysHeikkinen, M., Politis, A., Drossos, K. & Virtanen, T., 2025, ICASSP 2025 - 2025 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). Rao, B. D., Trancoso, I., Sharma, G. & Mehta, N. B. (eds.). IEEE, p. 1-5 (Proceedings of the IEEE International Conference on Acoustics, Speech, and Signal Processing).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewSynthSOD: Developing an Heterogeneous Dataset for Orchestra Music Source SeparationGarcia-Martinez, J., Diaz-Guerra, D., Politis, A., Virtanen, T., Carabias-Orti, J. J. & Vera-Candeas, P., 2025, In: IEEE Open Journal of Signal Processing. 6, p. 129-137Research output: Contribution to journal › Article › Scientific › peer-reviewAttention-Driven Multichannel Speech Enhancement in Moving Sound Source ScenariosWang, Y., Politis, A. & Virtanen, T., 2024, ICASSP 2024 - 2024 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, p. 11221-11225 (Proceedings of the IEEE International Conference on Acoustics, Speech, and Signal Processing).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewBaseline models and evaluation of sound event localization and detection with distance estimation in DCASE 2024 ChallengeDiaz-Guerra Aparicio, D., Politis, A., Ariyakulam Sudarsanam, P., Shimada, K., Krause, D., Uchida, K., Koyama, Y., Takahashi, N., Takahashi, S., Shibuya, T., Mitsufuji, Y. & Virtanen, T., 2024, Proceedings of the 9th Workshop on Detection and Classification of Acoustic Scenes and Events (DCASE 2024). DCASE, p. 41-45 Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewBinaural Sound Source Distance Estimation and Localization for a Moving ListenerKrause, D. A., Garcia-Barrios, G., Politis, A. & Mesaros, A., 2024, In: IEEE/ACM Transactions on Audio Speech and Language Processing. 32, p. 996 - 1011 16 p.Research output: Contribution to journal › Article › Scientific › peer-reviewDynamic Processing Neural Network Architecture for Hearing Loss CompensationDrgas, S., Bramslow, L., Politis, A., Naithani, G. & Virtanen, T., 2024, In: IEEE/ACM Transactions on Audio Speech and Language Processing. 32, p. 203-214 12 p.Research output: Contribution to journal › Article › Scientific › peer-reviewNeural Ambisonics Encoding For Compact Irregular Microphone ArraysHeikkinen, M., Politis, A. & Virtanen, T., 2024, ICASSP 2024 - 2024 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, p. 701-705 (Proceedings of the IEEE International Conference on Acoustics, Speech, and Signal Processing).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewPerceptually-Motivated Spatial Audio Codec for Higher-Order Ambisonics CompressionHold, C., McCormack, L., Politis, A. & Pulkki, V., 2024, ICASSP 2024 - 2024 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, p. 1121-1125 (Proceedings of the IEEE International Conference on Acoustics, Speech, and Signal Processing).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewPermutation Invariant Recurrent Neural Networks for Sound Source Tracking ApplicationsDiaz-Guerra Aparicio, D., Politis, A., Miguel, A., Beltran, J. R. & Virtanen, T., 2024, Proceedings of the 10th Convention of the European Acoustics Association Forum Acusticum 2023. European Acoustics Association, p. 2137 2142 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewAll publicationsOwn linksSpatial audio libraries repositoriesSPARTA/COMPASS spatial audio production tools",
  "content_length": 6470,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:43"
}