{
  "name": "Arend Rensink",
  "homepage": "https://people.utwente.nl/arend.rensink",
  "status": "success",
  "content": "Prof.dr.ir. A. Rensink | People Pages: Find employees & contact details | University of Twente Skip to content EEMCS-CS-FMTZilverling 3090arend.rensink@utwente.nl+31534894862Business card I am fascinated and inspired by how systems work, in their composition from small interacting building blocks. This has always applied to computer systems; more and more I also include organisational and social systems in my sphere of interest, in particular where it concerns the university educational system.After understanding why a system works, or doesn't work, the question of improvement arises. I usually do not take for granted that things must be the way they currently are, even after understanding why they are that way. Change, however, is not easily brought about: in software, the (lack of) maintainability stands in the way, in organisations it is typically inertia and lack of motivation for change.OrganisationsFaculty of Electrical Engineering, Mathematics and Computer Science (EEMCS)Computer Science (EEMCS-CS)Formal Methods and Tools (EEMCS-CS-FMT)Digital Society InstituteI am fascinated and inspired by how systems work, in their composition from small interacting building blocks. This has always applied to computer systems; more and more I also include organisational and social systems in my sphere of interest, in particular where it concerns the university educational system.After understanding why a system works, or doesn't work, the question of improvement arises. I usually do not take for granted that things must be the way they currently are, even after understanding why they are that way. Change, however, is not easily brought about: in software, the (lack of) maintainability stands in the way, in organisations it is typically inertia and lack of motivation for change.PublicationsJump to: 2025 | 2024 | 2023 | 2022 | 20212025Experimenting with Reaction Systems using Graph Transformation and GROOVE (2025)Natural Computing (E-pub ahead of print/First online). Bruni, R. & Rensink, A.https://doi.org/10.1007/s11047-025-10045-6Counterexample-Guided Abstraction Refinement for Generalized Graph Transformation Systems (2025)In Graph Transformation - 18th International Conference, ICGT 2025, Held as Part of STAF 2025, Proceedings: 18th International Conference, ICGT 2025, Held as Part of STAF 2025, Koblenz, Germany, June 11–12, 2025, Proceedings (pp. 157-176) (Lecture Notes in Computer Science; Vol. 15720 LNCS). Springer. König, B., Rensink, A., Stoltenow, L. & Urrigshardt, F.https://doi.org/10.1007/978-3-031-94706-3_8Sequential Composition of BDD Transition Systems for Model-Based Testing (2025)In Formal Techniques for Distributed Objects, Components, and Systems - 45th IFIP WG 6.1 International Conference, FORTE 2025, Held as Part of the 20th International Federated Conference on Distributed Computing Techniques, DisCoTec 2025, Proceedings (pp. 36-54) (Lecture Notes in Computer Science; Vol. 15732 LNCS). Springer. Zameni, T., van den Bos, P., Foederer, J. & Rensink, A.https://doi.org/10.1007/978-3-031-95497-9_3Conformance in the railway industry: Single-Input-Change testing a EULYNX controller (2025)International journal on software tools for technology transfer, 27(3), 377-395. Wal, D. v., Gerhold, M., Stoelinga, M. & Rensink, A.https://doi.org/10.1007/s10009-025-00790-5Counterexample-Guided Abstraction Refinement for Generalized Graph Transformation Systems: Full Version (2025)[Working paper › Preprint]. ArXiv.org. König, B., Rensink, A., Stoltenow, L. & Urrigshardt, F.https://doi.org/10.48550/arXiv.2504.08617What is... the point?: Single-input-change testing a EULYNX controller (2025)[Thesis › PhD Thesis - Research UT, graduation UT]. University of Twente. van der Wal, D.https://doi.org/10.3990/1.9789036565042Supporting software for the paper: Conformance in the Railway Industry: Single-Input-Change Testing a EULYNX Controller (Extended Version) (2025)[Dataset Types › Dataset]. 4TU.Centre for Research Data. van der Wal, D., Gerhold, M., Rensink, A. & Stoelinga, M.https://doi.org/10.4121/49fe4e0a-a92a-4fd6-b567-9dd408ff9867On Categories of Nested Conditions (2025)In Principles of Verification: Cycling the Probabilistic Landscape: Essays Dedicated to Joost-Pieter Katoen on the Occasion of His 60th Birthday, Part I (pp. 393-418) (Lecture Notes in Computer Science; Vol. 15260). Springer. Rensink, A. & Corradini, A.https://doi.org/10.1007/978-3-031-75783-9_162024An Intermediate Language to Integrate Behavior-Driven Development Scenarios and Model-Based Testing (2024)In 2024 IEEE International Conference on Software Analysis, Evolution and Reengineering - Companion (SANER-C) (pp. 199-206). Article 10621723. IEEE. Zameni, T., Bos, P. v. d., Rensink, A. & Tretmans, J.https://doi.org/10.1109/SANER-C62648.2024.00033On Categories of Nested Conditions (2024)[Working paper › Working paper]. ArXiv.org. Rensink, A. & Corradini, A.https://doi.org/10.48550/arXiv.2408.06196Team Effectiveness Data: A Bibliometric Analysis 1992-2022 (2024)[Dataset Types › Dataset]. Zenodo. Barrios Fleitas, Y. d. C., Hoogeboom, M. A. M. G., Eysink, T. & Rensink, A.https://doi.org/10.5281/zenodo.120825282023From BDD Scenarios to Test Case Generation (2023)In Proceedings - 2023 IEEE 16th International Conference on Software Testing, Verification and Validation Workshops, ICSTW 2023 (pp. 36-44). IEEE. Zameni, T., van den Bos, P., Tretmans, J., Foederer, J. & Rensink, A.https://doi.org/10.1109/ICSTW58534.2023.00019A Case in Point: Verification and Testing of a EULYNX Interface (2023)Formal aspects of computing, 35(1), 1–38. Article 2. Bouwman, M., Wal, D. v. d., Luttik, B., Stoelinga, M. & Rensink, A.https://doi.org/10.1145/35282072022Preface (2022)CEUR workshop proceedings, 3089. Garavel, H., de Lara, J., Molina, P. J., Paige, R., di Ruscio, D., Wimmer, M., Barmpis, K., Boronat, A., Boubeta-Puig, J., Bousse, E., Le Calvar, T., García-Domínguez, A., Hinkel, G., Horvath, A., Rensink, A., Cuadrado, J. S., Varró, G. & Wei, R.2021Synthesising middleware components for reusable software (2021)[Thesis › EngD Thesis]. University of Twente. van der Vlist, K. B.Zero-downtime schema changes (2021)[Thesis › EngD Thesis]. University of Twente. Dijkstra, J.-J.Multi-paradigm modelling for cyber–physical systems: a descriptive framework (2021)Software and systems modeling, 20(3), 611-639. Amrani, M., Blouin, D., Heinrich, R., Rensink, A., Vangheluwe, H. & Wortmann, A.https://doi.org/10.1007/s10270-021-00876-zIntegration and Orchestration of Analysis Tools (2021)In Composing Model-Based Analysis Tools (pp. 71-95). Springer. Heinrich, R., Bousse, E., Koch, S., Rensink, A., Riccobene, E., Ratiu, D. & Sirjani, M.https://doi.org/10.1007/978-3-030-81915-6_5On the Efficacy of Online Proctoring using Proctorio (2021)In Proceedings of the 13th International Conference on Computer Supported Education (CSEDU 2021) (pp. 279-290). SCITEPRESS. Bergmans, L., Bouali, N., Luttikhuis, M. & Rensink, A.https://doi.org/10.5220/0010399602790290Research profilesGoogle Scholarresearch.utwente.nl profileSince 2021 I am vice-dean for education of the faculty EEMCS. In this capacity I am one of the members of the faculty board, being the primary contact person for all education-related metters that concern the entire faculty, rather than any particular study programme.Before this, I served in a number of other roles in our educational organisation, besides actually developing and teaching numerous courses in the Computer Science Bachelor and Master programmes:Examination Board member for Computer ScienceExamination Board chair for the facultProgramme Director of the Bachelor of Technical Computer Science and the Master of Computer ScienceAffiliated study programsMaster Computer ScienceBachelor Technical Computer ScienceCourses academic year 2025/2026Courses in the current academic year are added at the moment they are finalised in the Osiris system. Therefore it is possible that the list is not yet complete for the whole academic year.191211650 - Multi-Disciplinary Design Project192166200 - Capita Selecta I-Tech192199508 - Research Topics CS192199968 - Internship CS192199978 - Final Project CS201300086 - Research Topics 2 CS201400171 - Capita Selecta ST201500039 - Security Verification201800524 - Research Topics EIT201900194 - Research Topics I-Tech201900195 - Final Project I-Tech201900234 - Internship I-Tech202001434 - Internship EMSYS202001613 - MSc Final Project BIT / CS202100114 - Graph Transformations202300070 - Final Project EMSYS202400608 - Internship TCSCourses academic year 2024/2025191211650 - Multi-Disciplinary Design Project192199508 - Research Topics CS192199968 - Internship CS192199978 - Final Project CS201300086 - Research Topics 2 CS201400171 - Capita Selecta ST201500039 - Security Verification201800524 - Research Topics EIT201900194 - Research Topics I-Tech201900195 - Final Project I-Tech201900234 - Internship I-Tech202001434 - Internship EMSYS202001613 - MSc Final Project BIT + CS202100114 - Graph Transformations202200251 - Capita Selecta DST202300070 - Final Project EMSYS202300357 - Concurrency and Compiler ConstructionThe principle of Model-Driven Engineering is widely applicable and, indeed, widely applied. In consequence, collaborations and projects can be established in many places. This diversity is clearly reflected in the list below: there are industrial collaborations and large European projects as well as more fundamental research projects.Current projectsFormaSigFormal Methods in Railway Signalling Infrastructure Standardisation ProcessesEuropean railroad infrastructure managers have joined forces in the EULYNX organisation with the aim to arrive at standardised interfaces between interlockings and trackside equipment. Standardisation efforts will significantly reduce the cost of ownership of signalling systems. Indeed, if the interfaces and architecture of a signalling systemare standardised, then different components can be procured from different suppliers, thereb",
  "content_length": 19263,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:43"
}