{
  "name": "Ari Rappoport",
  "homepage": "http://www.cs.huji.ac.il/~arir",
  "status": "success",
  "content": "Ari Rappoport's homepage Ari Rappoport I am an Associate (Full) Professor at the Hebrew University of Jerusalem, Israel. My main contribution is in the areas of Neuroscience, Neurology, and Psychiatry, where I developed comprehensive theories of the brain and brain disorders and diseases. My Computer Science area of interest is language (Computational Linguistics, Natural Language Processing (NLP)), from cognitive science and machine learning perspectives. Neuroscience (2010-present): Research and publications // Language (2002-present): Research, Publications // Geometry (1987-2001): Research, Publications // Contact // Picture (Sep 16, 2015) Brain Research To develop the theories below, I thoroughly examined the scientific literature, covering a large part of the relevant papers published in the last decades (hundreds of thousands of papers). I discovered that published papers already contain evidence for almost all of the lower-level details needed for developing complete theories. In each disorder/disease, what was needed is a high-level coherent story to connect these pieces of evidence (i.e., a theory). This is what my papers present. In many cases, the drugs to treat these disorders already exist and are routinely used for other indications. Disorders and Diseases Rappoport, Ari. A Lipid Rafts Theory of Alzheimer's Disease (October 2023. In press, Annual Review of Biochemistry, Volume 94). This paper presents the first complete theory of Alzheimer's Disease (AD), explaining its etiology, symptoms, pathology, and risk factors. The causal mechanism in AD is impaired formation of plasma membrane lipid rafts, which are essential for the conversion of short-term to long-term memory and for convergence of brain plasticity processes. The core cause of AD is reduced neural uptake and intracellular trafficking of cholesterol. Rappoport, Ari. A Polyunsaturated Fatty Acid (PUFA) Theory of Schizophrenia. Rappoport, Ari. A Dynorphin Theory of Depression and Bipolar Disorder. Rappoport, Ari. A Sympathetic Nervous System Theory of Migraine. Rappoport, Ari. A CRH Theory of Autism Spectrum Disorder. Rappoport, Ari. A KATP Channel Theory of Attention-Deficit Hyperactivity Disorder. Rappoport, Ari. A CRH-HCN Theory of Obsessive-Compulsive Disorder (OCD). Rappoport, Ari. Uploaded to Arxiv, waiting approval: a complete theory of anorexia and bulimia. Rappoport, Ari. Uploaded to Arxiv, waiting approval: a complete theory of Parkinson's Disease. Rappoport, Ari. Uploaded to Arxiv, waiting approval: a complete theory of multiple sclerosis demyelinization. Rappoport, Ari. Completed, to be uploaded to Arxiv: a complete theory of amyotrophic lateral sclerosis and frontotemporal dementia. Rappoport, Ari. Insulin in Amyotrophic Lateral Sclerosis: Impairment, Tests and Treatment (January 2023). The paper shows that insulin function is impaired in ALS patients (even patients with normal glucose levels who are not diagnosed with diabetes), explains why this happens, discusses the possible usage of insulin-affecting drugs in treating ALS, and proposes biomarker tests. The proposed tests are immediately available in any medical facility, and physicians are allowed to use them without any special approval. Updated 9.9.24. Neuroscience Rappoport, Ari. The Brain, Explained: A Comprehensive Theory of Brain Function (Dec 2017). Full version (130 pages) (citation information). This version contains a 3-page extended abstract that serves as a short introduction to the theory. Rappoport, Ari. Short Version of `The Brain, Explained': A Response Process Theory of Brain Function (2018). Short version (20 pages) (citation information). This paper summarizes the long version, presenting the main ideas of the theory. November 2023: I have significantly improved both the presentation of the brain theory and many of its mechanistic details. Major updates will eventually be published. Rappoport, Ari. Basal Ganglia Paths Support Acute vs. Learned Execution, Not Movement vs. Stopping (June 2018. 2nd version May 2019). 22 pages (citation information). This paper focuses on the basal ganglia, showing how the brain theory allows a novel understanding of BG paths and of the main symptoms of Parkinson's disease. Specifically, the paper shows that the role of the indirect path is to support learned movements, a view that stands in sharp contrast to the accepted account in which it suppresses movement. Rappoport, Ari. A Comprehensive Biological Theory of Sleep (April 2019. An improved 2nd version is available upon request, Feb 2020). 32 pages (citation information). This paper presents a theory that covers the roles and mechanisms of sleep, rapid-eye movement (REM) sleep, NREM sleep, dreaming, and anesthesia. Updated 1.11.23. Language Research My Computer Science research area is Computational Linguistics and Natural Language Processing (NLP). I am interested in a wide range of topics, including linguistic semantics (analysis and annotation) and applications (e.g., mining web social media, technology for helping people learn foreign languages). Both academics and the general public are fascinated by this research area. Our sarcasm detection algorithm was included in Time Magazine's 50 Best Inventions of 2010, and has generated world-wide media coverage. My lab's current major direction is semantics, with two main projects. (1) We developed UCCA, Universal Conceptual Cognitive Annotation of natural language texts. UCCA annotation is purely semantic, letting automated algorithms derive syntax (regularities in the mapping between forms and meanings). An interactive UCCA web annotation application can be accessed here. (2) We use pattern-based methods for unsupervised acquisition of lexical and relational semantics. We showed their superiority over leading word embeddings in several different settings. Our less recent focus was on using fully unsupervised and semi-supervised methods, in order to make use of the huge corpora available today and to overcome the problems associated with manual syntactic annotation (annotation cost and the arbitrariness of annotation schemes). I publish papers in ACL, CoNLL, EMNLP, NAACL, COLING, and EACL, and also in more applied venues related to social media and the web (WSDM, WWW, ICWSM) (see the detailed publication list below). I am routinely a program committee member in ACL, NAACL, EACL, EMNLP, COLING, CoNLL and the ACL workshops on Cognition in NLP, and an occasional one in WSDM, SEM, AAAI and IJCAI. I am one of the organizers of the Workshops on Unsupervised Learning in NLP. Publications (Language) Elior Sulem, Omri Abend, Ari Rappoport. Semantic Structural Decomposition for Neural Machine Translation. Lexical and Computational Semantics (*SEM) 2020. Daniel Hershcovich, Omri Abend, Ari Rappoport. Content Differences in Syntactic and Semantic Representation. NAACL 2019. Adi Shalev, Jena D. Hwang, Nathan Schneider, Vivek Srikumar, Omri Abend. Ari Rappoport. Preparing SNACS for Subjects and Objects. Designing Meaning Representations Workshop (ACL 2019). Daniel Hershcovich, Zohar Aizenbud, Leshem Choshen, Elior Sulem, Ari Rappoport, Omri Abend. SemEval-2019 Task 1: Cross-lingual Semantic Parsing with UCCA. SemEval 2019 (International Workshop on Semantic Evaluation, NAACL-HTL 2019). Elior Sulem, Omri Abend, Ari Rappoport. BLEU is Not Suitable for the Evaluation of Text Simplification. EMNLP 2018. Daniel Hershcovich, Omri Abend, Ari Rappoport. Multitask Parsing Across Semantic Representations. ACL 2018. Elior Sulem, Omri Abend, Ari Rappoport. Simple and Effective Text Simplification using Semantic and Neural Methods. ACL 2018. Elior Sulem, Omri Abend, Ari Rappoport. Semantic Structural Evaluation for Text Simplification. NAACL 2018. Daniel Hershcovich, Omri Abend, Ari Rappoport. Universal Dependency Parsing with a General Transition-Based DAG Parser. CoNLL 2018 (UD Shared Task). Daniel Hershcovich, Omri Abend, Ari Rappoport. A Transition-Based Directed Acyclic Graph Parser for UCCA. ACL 2017 (Outstanding Paper Award). Omri Abend, Ari Rappoport. The State of the Art in Semantic Representation. ACL 2017. Omri Abend, Shai Yerushalmi, Ari Rappoport. UCCAApp: Web-application for Syntactic and Semantic Phrase-based Annotation. ACL 2017 Demos. Ivan Vulić, Roy Schwartz, Ari Rappoport, Roi Reichart, Anna Korhonen. Automatic Selection of Context Configurations for Improved Class-Specific Word Representations. CoNLL 2017. Effi Levi, Roi Reichart, Ari Rappoport. Edge-Linear First-Order Dependency Parsing with Undirected Minimum Spanning Tree Inference. ACL 2016. Roy Schwartz, Roi Reichart, Ari Rappoport. Symmetric Patterns and Coordinations: Fast and Enhanced Representations of Verbs and Adjectives. NAACL 2016 (short paper). Dana Rubinstein, Effi Levi, Roy Schwartz, Ari Rappoport. How Well Do Distributional Models Capture Different Types of Semantic Knowledge? ACL 2015 (short paper). Roy Schwartz, Roi Reichart, Ari Rappoport. Symmetric Pattern Based Word Embeddings for Improved Word Similarity Prediction. CoNLL 2015. Elior Sulem, Omri Abend, Ari Rappoport. Conceptual Annotations Preserve Structure Across Translations: A French-English Case Study. ACL 2015 Workshop on Semantics-Driven Statistical Machine Translation (S2MT). Oren Tsur, Ari Rappoport. Dont Let Me Be #Misunderstood: Linguistically Motivated Algorithm for Predicting the Popularity of Textual Memes. International AAAI Conference on Web and Social Media (ICWSM) 2015. Roy Schwartz, Roi Reichart, Ari Rappoport. Minimally Supervised Classification to Semantic Categories using Automatically Acquired Symmetric Patterns. COLING 2014. Roy Schwartz, Oren Tsur, Ari Rappoport, Moshe Koppel. Authorship Attribution of Micro-Messages. EMNLP 2013. Omri Abend, Ari Rappoport. Universal Conceptual Cognitive Annotation (UCCA). ACL 2013. _ Oren Tsur, Adi Littman, Ari Rappoport. Efficient Clustering of Short Messages into General Domains. International AAAI Conference on Web and Social Media (ICWSM) 20",
  "content_length": 30004,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:46"
}