{
  "name": "Ari Juels [Tech]",
  "homepage": "http://tech.cornell.edu/people/ari-juels",
  "status": "success",
  "content": "Cornell Tech - Ari Juels Skip to Main Content People / Jacobs Technion-Cornell Institute Ari Juels Weill Family Foundation and Joan and Sanford I. Weill Professor Jacobs Technion Ari Juels is the Weill Family Foundation and Joan and Sanford I. Weill Professor of computer science at Cornell Tech, the Cornell Ann S. Bowers College of Computing and Information Science, and the Jacobs Technion-Cornell Institute. He is co-director of the Initiative for CryptoCurrencies and Contracts (IC3). He is also the chief scientist at Chainlink Labs. Juels is the author of crypto thriller novels “The Oracle” and “Tetraktys.” His recent areas of interest include blockchains, cryptocurrency, and smart contracts, as well as applied cryptography, user authentication, and privacy. Juels was the chief scientist of RSA, director of RSA Laboratories, and a distinguished engineer at EMC (now Dell EMC), where he worked until 2013. He received his Ph.D. in computer science from the University of California, Berkeley. He has been featured as an expert source in news publications like Coindesk, the Wall Street Journal, the New York Times, Forbes, Popular Science, and more. < Back to People SHARE THIS ON: GET IN TOUCH: Website X LinkedIn Bluesky juels@cornell.edu JACOBS TECHNION-CORNELL INSTITUTE About the Jacobs Institute FEATURED COURSE CS 5435 Security & Privacy Concepts in the Wild Credits 3 This course will give students a technical and social understanding of how and why security and privacy matter, help them think adversarially and impart how (and how not) to design systems and products. Less attention will be paid to specific skills such as hacking, writing secure code and security administration. Topics will include user authentication, cryptography, malware, behavioral economics in... Ari Juels Weill Family Foundation and Joan and Sanford I. Weill Professor",
  "content_length": 1868,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:43"
}