{
  "name": "Ari Visa",
  "homepage": "https://www.tuni.fi/en/ari-visa",
  "status": "success",
  "content": "Ari Visa | Tampere universitiesAri VisaProfessor, signaalinkäsittelyFaculty of Information Technology and Communication Sciences | Computing SciencesTampere Universityari.visa [at] tuni.fi (ari[dot]visa[at]tuni[dot]fi)phone number+358407287969Hervanta CampusLatest publicationsA comparison of various algorithms for classification of food scents measured with an ion mobility spectrometryMinaev, G., Müller, P., Salminen, K., Rantala, J., Surakka, V. & Visa, A., 7 Jan 2021, In: Sensors. 21, 2, 15 p., 361.Research output: Contribution to journal › Article › Scientific › peer-reviewDrilling Operations Classification Utilizing Data Fusion and Machine Learning TechniquesZare, M., Lehtinen, J.-P., Jafarian, H., Visa, A. & Aha, L., 2021, Proceedings of the 22nd Engineering Applications of Neural Networks Conference, EANN 2021. Iliadis, L., Macintyre, J., Jayne, C. & Pimenidis, E. (eds.). Springer, p. 389-398 10 p. (Proceedings of the International Neural Networks Society; vol. 3).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewNatural Gradient Boosting Collision Detection in Robot ManipulatorsJafarian, H., Zare, M., Pieters, R., Mehrang, S. & Visa, A., 15 Jul 2021. 2 p.Research output: Other conference contribution › Abstract › ScientificProgramming languages for data-Intensive HPC applications: A systematic mapping studyAmaral, V., Norberto, B., Goulão, M., Aldinucci, M., Benkner, S., Bracciali, A., Carreira, P., Celms, E., Correia, L., Grelck, C., Karatza, H., Kessler, C., Kilpatrick, P., Martiniano, H., Mavridis, I., Pllana, S., Respício, A., Simão, J., Veiga, L. & Visa, A., Mar 2020, In: Parallel Computing. 91, 17 p., 102584.Research output: Contribution to journal › Article › Scientific › peer-reviewReal-Time Manufacturing Drilling Operations Analysis by Utilization of Data-FusionZare, M., Visa, A., Pärssinen, V., Jafarian, H., Oksman, H. & Aha, L., 2020, 2020 IEEE 23rd International Conference on Information Fusion (FUSION). IEEE, 6 p. 9190248Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewAutomatic detection of water inside concrete slabs using ground penetrating radarKhan, M. A., Vehmas, R. & Visa, A., 1 Apr 2019, 2019 IEEE Radar Conference, RadarConf 2019. IEEEResearch output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewBig Data in 5G Distributed ApplicationsNejkovic, V., Visa, A., Tosic, M., Petrovic, N., Valkama, M., Koivisto, M., Talvitie, J., Rancic, S., Grzonka, D., Tchorzewski, J., Kuonen, P. & Gortazar, F., 26 Mar 2019, High-Performance Modelling and Simulation for Big Data Applications: Selected Results of the COST Action IC1406 cHiPSet. Kolodziej, J. & González-Vélez, H. (eds.). Cham: Springer International Publishing, p. 138-162 25 p. (Lecture Notes in Computer Science; vol. 11400).Research output: Chapter in Book/Report/Conference proceeding › Chapter › Scientific › peer-reviewReal-time online drilling vibration analysis using data miningZare, M., Huova, M., Visa, A. & Launis, S., 19 Jul 2019, Proceedings of the 2019 2nd International Conference on Data Science and Information Technology, DSIT 2019. ACM, p. 175-180 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewRegulation of asymmetries in the kinetics and protein numbers of bacterial gene expressionStartceva, S., Kandavalli, V. K., Visa, A. & Ribeiro, A. S., 1 Feb 2019, In: Biochimica et Biophysica Acta - Gene Regulatory Mechanisms. 1862, 2, p. 119-128 10 p.Research output: Contribution to journal › Article › Scientific › peer-reviewData-driven motion compensation techniques for noncooperative ISAR imagingVehmas, R., Jylhä, J., Väilä, M., Vihonen, J. & Visa, A., Feb 2018, In: IEEE Transactions on Aerospace and Electronic Systems.Research output: Contribution to journal › Article › Scientific › peer-reviewAll publications",
  "content_length": 4006,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:46"
}