{
  "name": "Ariel D. Procaccia",
  "homepage": "http://procaccia.info",
  "status": "success",
  "content": "Home - Ariel Procaccia Skip to main content 21 Ariel Procaccia Close Ariel Procaccia Harvard University I am the Alfred and Rebecca Lin Professor of Computer Science at Harvard University. I am a member of the EconCS Group; I am also affiliated with the Center for Research on Computation and Society, the Harvard Data Science Initiative, the Ash Center for Democratic Governance and Innovation, the Institute for Quantitative Social Science and the Center of Mathematical Sciences and Applications. I work on a broad and dynamic set of problems related to AI, algorithms, economics, and society. I am especially excited about projects that involve both interesting theory and direct applications; examples include the websites Spliddit and Panelot, as well as recent collaborations with nonprofit organizations such as refugees.AI, 412 Food Rescue, and the Sortition Foundation. Highlights 1 Spliddit Not-for-profit service that provides solutions to everyday fair division problems go there 2 Panelot Not-for-profit service that helps organizations select citizens' panels by lot go there 3 Popular Writing Exposition and commentary about computing, science and governance go there 4 Optimized Democracy Graduate course on the mathematical and algorithmic foundations of democracy go there Recent Talks Group 13 Created with Sketch. Venue Cooperative AI Summer School, July 2025 Abstract How should one design unprecedented democratic processes capable of handling enormous sets of alternatives like all possible policies, bills, or statements? I argue that this challenge can be addressed through a framework called generative social choice, which fuses the rigor of social choice theory with the flexibility and power of large language models. I then explore an application of generative social choice to the problem of identifying a proportionally representative slate of opinion statements. This includes a discussion of desired properties, an algorithm that provably achieves them, an implementation using GPT, and insights from an end-to-end pilot. By providing guarantees, generative social choice could alleviate concerns about AI-driven democratic innovation and help unlock its potential. Group 13 Created with Sketch. Venue ECAI-23 (keynote), October 2023 Abstract Sortition is a storied paradigm of democracy built on the idea of choosing representatives through lotteries instead of elections. In recent years this idea has found renewed popularity in the form of citizens’ assemblies, which bring together randomly selected people from all walks of life to discuss key questions and deliver policy recommendations. A principled approach to sortition, however, must resolve the tension between two competing requirements: that the demographic composition of citizens’ assemblies reflect the general population and that every person be given a fair chance (literally) to participate. I will describe our work on designing, analyzing and implementing randomized participant selection algorithms that balance these two requirements. I will also discuss practical challenges in sortition based on experience with the adoption and deployment of our open-source system, Panelot. Group 13 Created with Sketch. Venue MD4SG Workshop, June 2019 Abstract I will present the 'virtual democracy' framework for the design of ethical AI. In a nutshell, the framework consists of three steps: first, collect preferences from voters on example dilemmas; second, learn models of their preferences, which generalize to any (previously unseen) dilemma; and third, at runtime, predict the voters' preferences on the current dilemma, and aggregate these virtual 'votes' using a voting rule to reach a decision. I will focus on two instantiations of this approach: a proof-of concept system that decides ethical dilemmas potentially faced by autonomous vehicles, and a decision support tool designed to help a Pittsburgh-based nonprofit allocate food donations to recipient organizations. These projects bridge AI, social choice theory, statistics, and human-computer interaction; I will discuss challenges in all of these areas. News May 8, 2025 Daniel Halpern to join the University of Toronto Expand Close Daniel Halpern to join the University of Toronto Congratulations to Daniel Halpern, who has accepted a position as assistant professor of computer science at the University of Toronto! He will spend some time as a research scientist at Google Research before starting his faculty position. Apr 30, 2025 Jamie Tucker-Foltz to join Yale Expand Close Jamie Tucker-Foltz to join Yale Congratulations to Jamie Tucker-Foltz, who has accepted a position as assistant professor of operations and computer science at Yale! He will start the position in July. Feb 15, 2025 Interview in Science News Explores Expand Close Interview in Science News Explores Science News Explores, a science magazine for kids, published a cute interview with me. Their definition of “solution” (under “power words”) is not quite what I had in mind, though. Sep 28, 2024 Daniel Halpern wins a Siebel Scholarship Expand Close Daniel Halpern wins a Siebel Scholarship Congratulations to Daniel Halpern, who was selected as a 2024 Siebel Scholar. May 15, 2024 SIGecom Mid-Career Award Expand Close SIGecom Mid-Career Award I was selected to receive the SIGecom Mid-Career Award for “breakthroughs in theory and practice of democracy and social choice, and contributions to SIGecom.” I look forward to giving the award talk at EC’24. Apr 28, 2024 Spliddit is back Expand Close Spliddit is back Our not-for-profit fair division website, spliddit.org, died in 2022 at the ripe old age of 8. It’s now miraculously working again thanks to a heroic effort by Nisarg Shah and Soroush Ebadian. The resurrected version has a vastly improved algorithm for dividing chores! Mar 11, 2024 Bailey Flanigan to Join MIT Expand Close Bailey Flanigan to Join MIT Congratulations to Bailey Flanigan, who has accepted a position as assistant professor of political science and EECS at MIT! She will join MIT in 2025. Feb 20, 2024 Greg Kehne to join WashU Expand Close Greg Kehne to join WashU Congratulations to Greg Kehne, who has accepted a tenure-track faculty position in the Department of Computer Science and Engineering at Washington University at St. Louis! He will join WashU in summer 2024. Jan 2, 2024 AAAI Fellow Expand Close AAAI Fellow I was elected as Fellow of the Association for the Advancement of AI (AAAI), for “contributions to AI and society, including foundational work on economic paradigms and practical impact on governance and group decisions.” Dec 20, 2023 Kalai Prize in Game Theory and Computer Science Expand Close Kalai Prize in Game Theory and Computer Science Our paper “The Unreasonable Fairness of Nash Welfare” won the Game Theory Society’s Prize in Game Theory and Computer Science in honor of Ehud Kalai, awarded to one paper every four years. The prize talk will be given by Nisarg Shah at the 7th World Congress of the Game Theory Society. Sep 19, 2023 Op-ed about the Israeli constitutional crisis in the Washington Post Expand Close Op-ed about the Israeli constitutional crisis in the Washington Post An op-ed that I wrote with Liav Orgad was published today in the Washington Post. Israel needs a constitution, but who can be trusted to write it? Our answer is a bunch of random people — that is, a citizens’ assembly. Jul 10, 2023 Jamie Tucker-Foltz wins a Google PhD Fellowship Expand Close Jamie Tucker-Foltz wins a Google PhD Fellowship Congratulations to Jamie Tucker-Foltz, who was selected as a Google PhD Fellow in Algorithms, Optimization and Markets (with a secondary area in Algorithmic Fairness). Jul 7, 2023 EC-23 Exemplary Paper in the Applied Modeling Track Expand Close EC-23 Exemplary Paper in the Applied Modeling Track Our paper “Welfare-Maximizing Pooled Testing” has been selected as the exemplary paper in the applied modeling track of EC-23. The paper is joint work with Simon Finster, Michelle González Amador, Edwin Lock, Francisco Marmolejo-Cossío, and Evi Micha. Abstract: In an epidemic, how should an organization with limited testing resources safely return to in-person activities after a period of lockdown? We study this question in a setting where the population at hand is heterogeneous in both utility for in-person activities and probability of infection. In such a period of re-integration, tests can be used as a certificate of non-infection, whereby those in negative tests are permitted to return to in-person activities for a designated amount of time. Under the assumption that samples can be pooled, the question of how to allocate a limited testing budget in the population to maximize the aggregate utility (i.e. welfare) of negatively-tested individuals who return to in-person activities is non-trivial, with a large space of potential testing allocations. We show that non-overlapping testing allocations, which are both conceptually and (crucially) logistically more simple to implement, are approximately optimal, and we design an efficient greedy algorithm for finding non-overlapping testing allocations with approximately optimal welfare. In computational experiments, we highlight the efficacy and viability of our greedy algorithm in practice. To the best of our knowledge, we are also first to implement and provide causal evidence on the benefits of utility-weighted pooled testing in a real-world setting. Surprisingly, our pilot study at a higher education research institute in Mexico finds no evidence that performance and mental health outcomes of participants in our testing regime are worse than under the first-best counterfactual of full reopening without testing. Jul 1, 2023 Paul Gölz to join Cornell University Expand Close Paul Gölz to join Cornell University Congratulations to Paul Gölz, who has accepted a tenure-track faculty position in the Department of Operations Research and Information Engineering at Cornell University! He wi",
  "content_length": 31412,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:48"
}