{
  "name": "Arijit Ghosh",
  "homepage": "https://sites.google.com/site/homepagearijitghosh",
  "status": "success",
  "content": "HomepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationArijit GhoshAssociate ProfessorACM UnitIndian Statistical Institute (ISI)Office AddressACM UnitIndian Statistical Institute203, B. T. Road, Kolkata 700108West Bengal, IndiaResearch interestsBroadly, my interests lie in Theoretical Computer Science and Combinatorics. I am currently exploringDiscrete and Computational Geometry and TopologyPolynomial Methods and Incidence GeometryRandomized Algorithms Analytic Methods in Theoretical Computer Science and CombinatoricsRecent papersPrice of Parsimony: Complexity of Fourier Sparsity Testing with Manmatha RoyNeurIPS 2025: Annual Conference on Neural Information Processing SystemsTesting Isomorphism of Boolean Functions over Finite Abelian Groupswith Swarnalipa Datta, Chandrima Kayal, Manaswi Paraashar and Manmatha RoyRANDOM 2025: International Conference on Randomization and ComputationTesting vs Estimation for Index-Invariant Properties in the Huge Object Modelwith Sourav Chakraborty, Eldar Fischer, Amit Levi, Gopinath Mishra and  Sayantan SenSTOC 2025: Annual ACM Symposium on Theory of ComputingStabbing boxes with finitely many axis-parallel lines and flatswith Sutanoya Chakraborty and Soumi NandiDiscrete Mathematics, 348 (2): 114269, 2025Exploring the Gap between Tolerant and Non-tolerant Distribution Testingwith Sourav Chakraborty, Eldar Fischer, Gopinath Mishra, and Sayantan SenIEEE Transactions on Information Theory, 71(2): 1153 – 1170, 2025Improved Streaming Algorithm for Klee's Measure Problem  and Generalizationswith Sourav Chakraborty, Kuldeep Meel, Mridul Nandi, Soumit Pal, and N. V. VinodchandranAPPROX 2024: International Conference on Approximation Algorithms for Combinatorial Optimization ProblemsFaster Counting and Sampling Algorithms using a Colorful Decision Oraclewith Anup Bhattacharya, Arijit Bishnu, and  Gopinath MishraACM Transactions on Computation Theory, 16(2): 1 – 19, 2024(Featured in Oded Goldreich's Choices)Testing of Index-Invariant Properties in the Huge Object Model with Sourav Chakraborty, Eldar Fischer, Gopinath Mishra, and Sayantan Sen COLT 2023: Annual Conference on Learning Theory(Featured in Oded Goldreich's Choices)Local Criteria for Triangulating General Manifoldswith Jean-Daniel Boissonnat, Ramsay Dyer, and Mathijs WintraeckenDiscrete & Computational Geometry, 69(1): 156 – 191, 2023Covering almost all the layers of the hypercube with multiplicitieswith Chandrima Kayal and Soumi NandiDiscrete Mathematics, 346(7): 113397, 2023On the Complexity of Triangle Counting using Emptiness Querieswith Arijit Bishnu and Gopinath MishraRANDOM 2023: International Conference on Randomization and Computation Uniform Brackets, Containers, and Combinatorial Macbeath Regionswith Kunal Dutta  and Shay MoranITCS 2022: Innovations in Theoretical Computer ScienceDisjointness through the Lens of Vapnik–Chervonenkis Dimension: Sparsity and Beyondwith Anup Bhattacharya, Sourav Chakraborty, Gopinath Mishra, and Manaswi ParaasharComputational Complexity, 31(2): 9, 2022 Tolerant Bipartiteness Testing in Dense Graphswith Gopinath Mishra, Rahul Raychaudhury, and Sayantan SenICALP 2022: International Colloquium on Automata, Languages and ProgrammingLocal Conditions for Triangulating Submanifolds of Euclidean Spacewith Jean-Daniel Boissonnat, Ramsay Dyer, André Lieutier, and Mathijs WintraeckenDiscrete & Computational Geometry, 66(2): 666 – 686, 2021Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 3507,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:51"
}