{
  "name": "Aris Pagourtzis",
  "homepage": "http://users.softlab.ntua.gr/~pagour",
  "status": "success",
  "content": "Aris Pagourtzis's Home Page Aris T. Pagourtzis Position: Professor, School of Electrical and Computer Engineering, NTUA Other affiliations: Lead Researcher, Archimedes Research Center, Athena RC Research Interests Computational Complexity, Graph Algorithms, Distributed Algorithms and Protocols, Approximability, Network Algorithms, Cryptography, Counting Complexity. Research Group: Computation and Reasoning Laboratory (corelab) Publications my publications in the DBLP bibliography server For earlier publications please check this (not regularly updated) list of publications Courses (details at corelab courses): Undergraduate. Current: Algorithms and Complexity, Foundations of Computer Science, Computational Cryptography, Programming Techniques, Advanced Algorithms. Past: Introduction to Programming, Introduction to Computer Science. Graduate. Current: Theoretical Computer Science I: Computational Complexity, Cryptography and Complexity, Network Algorithms and Complexity. Past: Algorithms and Complexity I & II, Theoretical Computer Science II: Advanced Topics. Academic service IWOCA 2024 SSS 2024 IWOCA 2023 FCT 2021, BCCA 2020, FoCoDiLe-DisCoTec 2020, IWOCA 2020, WAOA-ALGO 2019, FCT 2019, CIAC 2017, ADHOC-NOW 2015, I-SPAN 2017 (\"Distributed algorithms and graph computing\" Track), SEA 2015, DPS (part of IISA 2014) EUROCRYPT 2013, WAOA 2008 (part of ALGO 2008), AdHoc-NOW 2007 ACAC series: ACAC 2017, ACAC 2016, ACAC 2015, ACAC 2014, ACAC 2013, ACAC 2012, ACAC 2011, ACAC 2010, ACAC 2009 ACAC 2008, ACAC 2007, ACAC 2006 AtheCrypt series: AtheCrypt 2018, AtheCrypt 2017, AtheCrypt 2016, AtheCrypt 2015, AtheCrypt 2014, AtheCrypt 2013 EESTEC competition for Android (2014, 2015) Curriculum Vitae: pdf (last update: 2025) Address National Technical University of Athens (NTUA) School of Electrical and Computer Engineering Department of Computer Science Heroon Politechniou 9 GR-15780 Zographou, Greece tel: +30-210-7721640 fax: +30-210-7721645 e-mail: pagour AT cs DOT ntua DOT gr",
  "content_length": 1996,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:56"
}