{
  "name": "Aristides Gionis",
  "homepage": "https://www.kth.se/profile/argioni",
  "status": "success",
  "content": "KTH | Aristides Gionis Skip to main content Aristides GionisPROFESSORKungliga Tekniska Högskolanhttps://www.kth.se/profile/argioniDetailsWorks for Division of Theoretical Computer ScienceUnit address Lindstedtsvägen 5 Plan 5E-mail argioni@kth.seResearcherResearcher IDORCID IDAbout meI am a WASP professor at KTH Royal Institute of Technology and an adjunct professor at Aalto University. I work in algorithms, data mining, graph mining, and social-network analysis. In KTH I work with a team of bright and highly-motivated researchers: Ece Calikus (postdoc) Lutz Oettershagen (postdoc) Yifei Jin (doctoral student) Sijing Tu (doctoral student) Ruo-Chun Tzeng (doctoral student) Honglian Wang (doctoral student) Tianyi Zhou (doctoral student) Tommaso Lanciano (research engineer) My research is currently funded by ERC, WASP, and the EU SoBigData++ project. My ERC project, REBOUND, focuses on understanding and mitigating phenomena of bias and polarization in online media. Past students, postdocs, and visitors Guangyi Zhang (PhD, graduated in February 2023) Florian Adriaens (postdoc, 2020-2022) Stefan Neumann (postdoc, 2020-2023) Federico Cinus (visitor in spring 2022) Corinna Coupette (visitor in summer 2022) Ilie Sarpe (visitor in autumn 2022) CoursesDegree Project in Computer Science and Engineering, Second Cycle (DA239X), examinerDegree Project in Computer Science and Engineering, Second Cycle (DA250X), examinerDegree Project in Computer Science and Engineering, Second Cycle (DA231X), examinerDegree Project in Computer Science and Engineering, specialising in ICT Innovation, Second Cycle (DA258X), examinerDegree Project in Computer Science and Engineering, specialising in ICT Innovation, Second Cycle (DA256X), examinerMachine Learning, Advanced Course (DD2434), teacherMachine Learning, Advanced Course (FDD3434), teacher",
  "content_length": 1842,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:55"
}