{
  "name": "Aristidis Likas",
  "homepage": "https://cs.uoi.gr/~arly",
  "status": "success",
  "content": "Aristidis Likas Research: Neural Networks, Mixture Models, Machine Learing, Pattern Recognition, Bioinformatics, Data Mining, Reinforcement Learning, Clustering, Classification, Fuzzy Logic, Genetic Algorithms Aristidis Likas Professor    Department of Computer Science and Engineering    University of Ioannina    GR-45110 Ioannina, Greece    Tel     : +30-26510-08810    Fax     : +30-26510-08882    e-mail  : arly@cs.uoi.gr Diploma in Electrical Engineering, National Technical University of Athens, June 1990. Ph.D. in Electrical and Computer Engineering, National Technical University of Athens, July 1994. Research Interests Neural Networks Machine Learning Data Mining Image Processing and Analysis Video Analysis and Summarization Text Mining Intelligent Systems in Medicine / Biology Scientific Computing Courses  (recent) Artificial Intelligence (undergraduate) Computational Intelligence (undergraduate) Data Mining (graduate) Machine Learning (graduate) Office hours: Tuesday 9.30-11.30 Associate Editor: IEEE Transactions on Neural Networks (2008-2012) General Co-chair: ECML/PKDD 2011, SETN 2014 Miscellaneous · The inclusion measure for community detection · Clustering based on unimodal projections (pdip-means) · Video Summarization (VIDEOSUM) · PRotEin S-Sulfenylation Server (PRESS) · Multimodality in Data Clustering: Application to Video Summarization (plenary talk at AIAI 2016) · Global k-means matlab code Publications Google Scholar information The following material is provided to ensure timely dissemination of scholarly and technical work. Copyright and all rights therein are retained by authors or by other copyright holders. All persons copying this information are expected to adhere to the terms and constraints invoked by each author's copyright. In most cases, these works may not be reposted without the explicit permission of the copyright holder. Journal Publications ·       A. Likas, and A. Stafylopatis, \"Multiscaling in Binary Hopfield-type Neural Networks: Application to the Set Partitioning Problem\", International Journal of Neural Networks , Vol. 3, No. 2, pp. 55-65, June 1992. ·       A. Stafylopatis and A. Likas, \"Pictorial Information Retrieval Using the Random Neural Network\", IEEE Transactions on Software Engineering , Vol. 18, No. 7, pp. 590-600, July 1992. ·       D. Kontoravdis, A. Likas and  A. Stafylopatis, \"A Path-Finding Technique Based on the Integration of Neural Network Models at Different Levels of Abstraction\", Elektrik - Special Issue on Neural Networks , Vol. 2, No. 1, pp. 40-51, April 1994 (invited paper). ·       D. Kontoravdis, A. Likas and A. Stafylopatis, \"Enhancing Stochasticity in Reinforcement Learning Schemes: Application to the Exploration of Binary Domains\", Journal of Intelligent Systems , Vol. 5, No. 1, pp. 49-77, 1995. ·       A. Likas and A. Stafylopatis, \"Differential Association and Operational Equivalence of Discrete Hopfield Networks\", Neural Network World , Vol. 5, No. 1, pp. 81-89, 1995. ·       A. Likas and A. Stafylopatis, \"A Parallel Algorithm for the Minimum Weighted Vertex Cover Problem\", Information Processing Letters , Vol. 53, pp. 229-234, 1995. ·       A. Likas, D. Kontoravdis and A. Stafylopatis, \"Discrete Optimization Based on the Combined Use of Reinforcement and Constraint Satisfaction Schemes\", Neural Computing and Applications , Vol. 3, pp. 101- 112, 1995. ·       A. Likas, G. Papageorgiou and A. Stafylopatis, \"A Parallelizable Operation Scheme of the Boltzmann Machine Optimizer Based on Group Updates\", Neural, Parallel and Scientific Computations , Vol. 3, pp. 451-466, 1995. ·       M. Afif, A. Likas and V. Paschos, \"A Natural Model and a Parallel Algorithm for Approximately Solving the Maximum Weighted Independent Set Problem\", Chaos, Solitons & Fractals , Vol. 5, No. 5, pp. 739-746, 1995. ·       A. Likas and A. Stafylopatis, \"Group Updates and Multiscaling: An Efficient Neural Network Approach to Combinatorial Optimization\", IEEE Transactions on Systems, Man, and Cybernetics, Part B: Cybernetics , Vol. 26, No. 2, pp. 222-232, April 1996. ·       A. Likas, K. Blekas and A. Stafylopatis, \"Parallel Recombinative Reinforcement Learning: A Genetic Approach\", Journal of Intelligent Systems , vol. 6, no. 2, pp. 145-177, 1996. ·       A. Likas and K. Blekas, \"A Reinforcement Learning Approach Based on the Fuzzy Min-Max Neural Network\", Neural Processing Letters , vol. 4, no. 3, pp. 167-172, 1996. ·       A. Likas and A. Stafylopatis, \"High Capacity Associative Memory Based on the Random Neural Network Model\", International Journal of Pattern Recognition and Artificial Intelligence , vol. 10, no. 8, pp. 919-937, 1997. ·       A. Likas, G. Papageorgiou and A. Stafylopatis, \"A Connectionist Approach for Solving Large Constraint Satisfaction Problems\", Applied Intelligence , vol. 7, pp. 215-225, 1997. ·       I. Lagaris, A. Likas and D. Fotiadis, \"Artificial Neural Network Methods in Quantum Mechanics\", Computer Physics Communications , vol. 104, pp. 1-14, 1997. ·       A. Likas, D. Karras and I. Lagaris, \"Neural Network Training and Simulation Using a Multidimensional Optimization System\", International Journal of Computer Mathematics , vol. 67, pp. 33-46, 1998. ·       K. Blekas, A. Stafylopatis, D. Kontoravdis, A. Likas and P. Karakitsos, \"Cytological Diagnosis Based on Fuzzy Neural Networks\", Journal of Intelligent Systems , vol. 8, pp. 55-79, 1998. ·       G. Papageorgiou, A. Likas and A. Stafylopatis, \"A Hybrid Neural Optimization Scheme Based on Parallel Updates\", International Journal of Computer Mathematics , vol. 67, pp. 223-237, 1998. ·       G. Papageorgiou, A. Likas and A. Stafylopatis, \"Improved exploration in Hopfield Network State-Space through Parameter Perturbation Driven by Simulated Annealing \", European Journal of Operations Research , vol. 108, no. 2, pp. 283-292, 1998. ·       I. Lagaris, A. Likas and D. Fotiadis, \"Artificial Neural Networks for Solving Ordinary and Partial Differential Equations\", IEEE Trans. on Neural Networks , vol. 9, no. 5, pp. 987-1000, 1998. ·       A. Likas, A. and I. Lagaris, \"Training Reinforcement Neurocontrollers Using the Polytope Algorithm \", Neural Processing Letters , vol. 9, no. 2, pp. 119-127, 1999. ·       A. Likas, \"A Reinforcement Learning Approach to On-Line Clustering\", Neural Computation, vol. 11, no. 8, pp. 1915-1932, 1999. ·       N. Vlassis and A. Likas, \"A Kurtosis-Based Dynamic Approach to Gaussian Mixture Modeling \", IEEE Trans. on Systems, Man and Cybernetics: Part A , vol. 29, no. 4, pp. 393-399, July 1999. ·       A. Likas and A. Stafylopatis, \"Training the Random Neural Network Using Quasi-Newton Methods \", European Journal of Operations Research , vol. 126, no. 2, pp. 331-339, 2000. ·       I. Lagaris, A. Likas and D. Papageorgiou, \"Neural Networks Methods for Boundary Value Problems with Irregular Boundaries\", IEEE Trans. on Neural Networks , vol. 11, no. 5, pp. 1041-1049, Sept. 2000. ·       C. Papaloukas, D. Fotiadis, A. Liavas, A. Likas and L. Michalis, \"A Knowledge-based Technique for Automated Detection of Ischemic Episodes in Long Duration ECGs\", Medical and Biological Engineering and Computing , vol. 39, pp. 105-112, 2001. ·       A. Likas, \"Probability Density Estimation Using Artificial Neural Networks\", Computer Physics Communications , vol. 135, no. 2, pp. 167-175, 2001. ·       A. Likas, \"Reinforcement Learning Using the Stochastic Fuzzy Min-Max Neural Network\", Neural Processing Letters, vol. 13, pp. 213-220, 2001. ·       M. Titsias and A. Likas, \"Shared Kernel Models for Class Conditional Density Estimation\", IEEE Trans. on Neural Networks , vol. 12, no. 5, pp. 987-997, September 2001. ·       N. Vlassis and A. Likas, \"A greedy EM algorithm for Gaussian mixture learning\" , Neural Processing Letters , vol. 15, pp. 77-87, 2002. ·       A. Likas and V. Paschos, \"A note on a new greedy solution representation and a new greedy parallelizable heuristic for the traveling salesman problem\", Chaos, Solitons & Fractals , vol. 13, pp. 71-78, 2001. ·       C. Papaloukas, D. Fotiadis, A. Likas and L. Michalis, \"Use of a Novel Rule-Based Expert System in the Detection of Changes in the ST Segment and T Wave in Long Duration ECGs\", Journal of Electrocardiology , vol. 35, no. 1, pp. 27-34, 2002. ·       C. Papaloukas, D. Fotiadis, A. Likas and L. Michalis, \"An Ischemia Detection Method based on Artificial Neural Networks\", Artificial Intelligence in Medicine , vol. 24, no. 2, pp. 167-178, February 2002. ·       A. Likas, N. Vlassis and J. Verbeek, \"The Global K-Means Clustering Algorithm\" , Pattern Recognition , vol. 36, pp. 451-461, 2003. ·       A. Papadopoulos, D. Fotiadis and A. Likas, \"An Automatic Microcalcification System based on a Hybrid Neural Network Classifier\", Artificial Intelligence in Medicine , vol. 25, no. 2, pp. 149-167, 2002. ·       M. Titsias and A. Likas, \"Mixture of Experts Classification Using a Hierarchical Mixture Model\" , Neural Computation , vol. 14, no. 9, pp. 2221-2244, 2002. ·       D. Frossyniotis, A. Stafylopatis and A. Likas, \"A Divide-and-Conquer Method for Multi-net Classifiers\", Pattern Analysis and Applications Journal, vol. 6, no. 1, pp. 32-40, 2003. ·       M. Titsias and A. Likas, \"Class Conditional Density Estimation Using Mixtures with Constrained Component Sharing\" , IEEE Trans. on Pattern Analysis and Machine Intelligence , vol. 25, no.7, pp. 924-928, 2003. ·       K. Blekas, D. Fotiadis and A. Likas, \"Greedy Mixture Learning for Multiple Motif Discovery in Biological Sequences\", Bioinformatics , vol. 19, no. 5, pp. 609-617, 2003. ·       K. Blekas, D. Fotiadis and A. Likas, \"A Sequential Method for Discovering Probabilistic Motifs in Proteins\", Methods of Information in Medicine ,vol. 43, pp. 9-12, 2004. ·       D. Frossyniotis, A. Likas and A. Stafylopatis, \"A Clustering Method Based on Boosting\", Pattern Recognition Letters , vol. 25, pp. 641-654, 2004. ·       A. Likas and N. Galatsanos,  \"A Variational Approach for Bayesian Bli",
  "content_length": 39378,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:55"
}