{
  "name": "Aritra Hazra",
  "homepage": "https://cse.iitkgp.ac.in/~aritrah",
  "status": "success",
  "content": "Aritra Hazra Home Hello World! Hi! I am an Associate Professor in the Department of Computer Science and Engineering at Indian Institute of Technology Kharagpur. I joined as a faculty in the Department of Computer Science and Engineering at Indian Institute of Technology Kharagpur on August 2017. Prior to this position, I also served as an Assistant Professor in the Department of Computer Science and Engineering at Indian Institute of Technology Madras from August 2015 to July 2017. My primary areas of research interest broadly include Formal Methods, Design Verification, VLSI CAD, Artificial Intelligence and Machine Learning. Biography \"Be yourself; everyone else is already taken.\"    – Oscar Wilde Dr. Aritra Hazra is currently an Associate Professor in the Department of Computer Science and Engineering (CSE) at Indian Institute of Technology (IIT) Kharagpur. Prior to this position, he also served as an Assistant Professor in the Department of CSE at IIT Madras from August 2015 to July 2017 and an Assistant Professor in the Department of CSE at IIT Kharagpur from August 2017 to October 2025. Earlier, he did his Bachelor of Engineering (B.E.) from the Department of CSE at Jadavpur University (Kolkata) in 2006. He received his Master of Science (M.S.) degree in 2010 and earned his Doctor of Philosophy (Ph.D.) degree in 2015, both from the Department of CSE at IIT Kharagpur. Dr. Hazra's research interest lies broadly on the areas of Formal Methods, Design Verification, VLSI CAD, Artificial Intelligence and Machine Learning. He has published many research articles in several leading journals and well-known conferences, including two best student paper awards in VLSI Design Conferences (in 2010 and 2017). He also received several accolades for his PhD work, including ACM (India) Best PhD Dissertation Award 2015 and IESA Technovation – TechnoInventor (Ph.D.) Award 2015. Besides, Dr. Hazra was a recipient of INAE (Indian National Academy of Engineering) Young Engineer Award in 2017 and is an Young Associate of INAE since then. He was also awarded the Associateship of IASc. (Indian Academy of Science) in 2018, IEI (The Institute of Engineers India) Young Engineer Award in 2019 and Institute Faculty Excellence Award (Assistant Professor) in 2021. He is an eminent speaker of ACM India since 2023. He is a member of IEEE (Institute of Electrical and Electronics Engineers) and a professional member of ACM (Association for Computing Machinery). And ... an illeist is a person who refers to himself in the third person. Contact Designation:   Associate Professor Office:   CSE-102   (Ground-Floor) Email:   aritrah [at] cse [dot] iitkgp [dot] ac [dot] in Phone:   +91-3222-304640   (Extn: 84640) Address: Department of Computer Science and Engineering, Indian Institute of Technology Kharagpur, Paschim Medinipur, West Bengal 721302, INDIA. http://www.iitkgp.ac.in/department/CS/faculty/cs-aritrah Home Background Teaching Research Projects Recognitions Services © Aritra Hazra   |   Last Updated: November 2025",
  "content_length": 3041,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:57"
}