{
  "name": "Aritra Banik",
  "homepage": "https://www.niser.ac.in/~aritra",
  "status": "success",
  "content": "Aritra Banik - Academic Webpage Aritra Banik Associate Professor, School of Computer Sciences National Institute of Science Education and Research (NISER) Theoretical Computer Scientist Specializing in Parameterized Algorithms and Computational Geometry. About Me Dr. Aritra Banik is an Associate Professor in the School of Computer Sciences at the National Institute of Science Education and Research (NISER), a position he has held since July 2023. Prior to this, he served as Reader-F and Assistant Professor at NISER, steadily contributing to both the academic and research landscape by navigating between lecture halls, whiteboards, and deadlines with equal commitment. Before joining NISER, Dr. Banik was an Assistant Professor at the Indian Institute of Technology Jodhpur. His academic journey also includes a crucial tenure as a Postdoctoral Associate at Ben-Gurion University of the Negev, where he spent time exploring computational geometry and algorithms; areas where precision and patience are both scientific requirements and acquired virtues. He received his Ph.D. and M.Tech. in Computer Science from the Indian Statistical Institute Kolkata, an experience that thoroughly prepared him for both the elegance of theory and the unpredictability of reviewer comments. His foundational education includes a B. Tech. in Computer Science from West Bengal University of Technology. Dr. Banik's research is primarily focused on algorithmic problems, with a particular emphasis on designing efficient algorithms within the domains of Parameterized Algorithms, Computational Geometry, and Approximation Algorithms. He currently serves as a member of the ACM India Council (2024–2026), where he contributes to the larger computing community. Whether in the classroom or at the whiteboard, his work is guided by a genuine interest in clarity, structure, and the occasional well-placed lemma. Research Interests Dr. Aritra Banik's research primarily lies at the intersection of theoretical computer science and practical algorithm design. His core interests revolve around developing efficient algorithms for challenging computational problems. Parameterized Algorithms: Focusing on designing algorithms whose running time depends polynomially on the input size but exponentially on a parameter, allowing for efficient solutions to NP-hard problems when the parameter is small. Computational Geometry: Exploring algorithmic problems involving geometric objects. This includes topics like convex hulls, Voronoi diagrams, triangulations, and efficient query structures for spatial data. Approximation Algorithms: Devising algorithms that find near-optimal solutions for NP-hard optimization problems within a provable factor of the optimal solution, especially when finding an exact solution is computationally intractable. He is particularly interested in the theoretical underpinnings of these areas and their applications in various fields requiring robust and efficient computational solutions. Publications For a complete list of my publications, please visit: DBLP Profile Google Scholar Profile Teaching Dr. Aritra Banik is deeply committed to teaching and has offered a range of courses across undergraduate and postgraduate levels at both NISER and IIT Jodhpur. His teaching philosophy centers on building a strong conceptual foundation, cultivating analytical thinking, and bridging the gap between elegant theory and practical relevance, an ongoing challenge he considers both necessary and rewarding. Courses Taught: Computational Geometry Discrete Structures and Computation Design and Analysis of Algorithms Operating System Discrete Mathematics Data Structure Algorithm Design and Analysis Selected Topics in Algorithms He consistently strives to create an engaging learning environment, one where curiosity is encouraged, questions are welcomed (even the late-night ones before exams), and complex topics are unpacked with both clarity and just enough challenge to keep things interesting. His approach emphasizes not just mastering the material, but learning how to think with it. Curriculum Vitae For a detailed overview of my academic background, professional experience, research contributions, and teaching record, please download my curriculum vitae. Download CV Contact Email: aritra@niser.ac.in (For academic queries, collaborations, or the occasional Indian academia existential crisis.) Address: School of Computer Sciences (School of Mathematical Sciences Building) National Institute of Science Education and Research (NISER) P.O. Jatni, Khurda 752050 Odisha, India",
  "content_length": 4595,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:59"
}