{
  "name": "Aritran Piplai",
  "homepage": "https://hb2504.utep.edu/Home/Profile?username=apiplai",
  "status": "success",
  "content": "UTEP Faculty Profiles MinerAlert Skip to main content Search pages and people FACULTY PROFILES X Quick Links Library Parking & Maps UTEP News Events Student Affairs Business Affairs Employment Opportunities University Bookstore Technology Support Main Content UTEP Faculty Profiles UTEP Faculty Profiles Aritran Piplai Assistant Professor Computer Science Office Building: Chemistry and Computer Science Building Office Room: CCSB 3.0512 Phone: (915) 747-8381 Email: apiplai@utep.edu Bio Education Scholarly and Creative Activity Grants Courses Course Evaluations Bio < Dr. Piplai joins UTEP from the University of Maryland, Baltimore County (UMBC), where he taught introduction to AI courses and served as a graduate research assistant creating novel knowledge graph-guided reinforcement learning algorithms for autonomous cyber defense projects. His research background focuses on automated cyber defenses, cybersecurity knowledge graphs, cyber threat intelligence, reinforcement learning, and adversarial learning. Dr. Piplai earned a doctoral degree in computer science from UMBC and a bachelor’s in computer science and engineering from Jadavpur University in India. While at UMBC, Dr. Piplai served on program committees for the International Conference on Machine Learning and the International Conference on Big Data. He was the session chair for the IEEE International Conference on Machine Learning Applications in 2022. He also has industry experience at Amazon Science and Samsung Research. At UTEP his research area is finding evolving cyber-threats and malware. Some of the methods that he uses are leveraging LLMs, natural language processing, and knowledge graphs to provide textual descriptors of cyber-attacks. He also looks at simulating cyber-attacks and defense strategies with Reinforcement Learning, as well as classifying and identifying malware samples from unknown families. Awards and Honors Best Paper Award (12/01/2024-12/31/2024) > Education < Ph D in Computer Science, University of Maryland Baltimore County (2023) > Publications < Towards Building Generalizable Models for Malware Detection IEEE International Conference on Big Data (2024), Jihoon Shin, Emilia Rivas, Daniel Lucio, Aritran Piplai, Lavanya Elluri. LOCALINTEL: Generating Organizational Threat Intelligence from Global and Local Cyber Knowledge 17th International Symposium on Foundations & Practice of Security (FPS – 2024) (in press), Shaswata Mitra, Subhash Neupane, Trisha Chakraborty, Sudip Mittal, Aritran Piplai, Manas Gaur, Shahram Rahimi. An In-Depth Investigation into the Performance of State-of-the-Art Zero-Shot, Single-Shot, and Few-Shot Learning Approaches on an Out-of-Distribution Zero-Day Malware Attack Detection 2024 International Symposium on Networks, Computers and Communications (ISNCC) (2024), Tosin Ige, Christopher Kiekintveld, Aritran Piplai, Amy E. Wagler, Olukunle Kolade, Bolanle H. Matti. Enhancing classroom teaching with LLMs and RAG Proceedings of the 25th Annual Conference on Information Technology Education (2024), Elizabeth Mullins, Adrian Portillo, Kristalys R. Rohena, Aritran Piplai. Towards an In-depth Evaluation of the Performance, Suitability and Plausibility of Few-Shot Meta Transfer Learning on An Unknown Out-of-Distribution Cyber-attack Detection MDPI AI (2024), Tosin Ige, Christopher Kiekintveld, Aritran Piplai, Amy E. Wagler, Olukunle Kolade, Bolanle Matti. Knowledge-enhanced Neuro-Symbolic AI for Cybersecurity and Privacy IEEE Computer Society (2023), Aritran Piplai, Anantaa Kotal, Seyedreza Mohseni, Manas Gaur, Sudip Mittal. Knowledge guided two-player reinforcement learning for cyber attacks and defenses 2022 21st IEEE International Conference on Machine Learning and Applications (ICMLA) (2023), Aritran Piplai, Mike Anuruo, Kayode Fasaye, Anupam Joshi, Tim Finin. Privetab: Secure and privacy-preserving sharing of tabular data Proceedings of the 2022 ACM on International Workshop on Security and Privacy Analytics (2023), Anantaa Kotal, Aritran Piplai, Sai Sree Laya Chukkapalli, Anupam Joshi. A policy-driven approach to secure extraction of covid-19 data from research papers Frontiers in big Data (2022), Lavanya Elluri, Aritran Piplai, Anantaa Kotal, Anupam Joshi, Karuna P. Joshi. Combating fake cyber threat intelligence using provenance in cybersecurity knowledge graphs 2021 IEEE International Conference on Big Data (Big Data) (2022), Shaswata Mitra, Aritran Piplai, Sudip Mittal, Anupam Joshi. Cybersecurity Knowledge Graph Improvement with Graph Neural Networks 2021 IEEE International Conference on Big Data (Big Data) (2022), Soham Dasgupta, Aritran Piplai, Priyanka Ranade, Anupam Joshi. Cybert: Contextualized embeddings for the cybersecurity domain 2021 IEEE International Conference on Big Data (Big Data) (2022), Priyanka Ranade, Aritran Piplai, Anupam Joshi, Tim Finin. Generating Fake Cyber Threat Intelligence Using Transformer-Based Models International Joint Conference on Neural Networks 2021 (IJCNN 2021) (2022), Priyanka Ranade, Aritran Piplai, Sudip Mittal, Anupam Joshi, Tim Finin. A comparative study of deep learning based named entity recognition algorithms for cybersecurity 2020 IEEE International Conference on Big Data (Big Data) (2021), Soham Dasgupta, Aritran Piplai, Anantaa Kotal, Anupam Joshi. A smart-farming ontology for attribute based access control 2020 IEEE 6th Intl Conference on Big Data Security on Cloud (BigDataSecurity), IEEE Intl Conference on High Performance and Smart Computing,(HPSC) and IEEE Intl Conference on Intelligent Data and Security (IDS) (2021), Sai Sree Laya Chukkapalli, Aritran Piplai, Sudip Mittal, Maanak Gupta, Anupam Joshi. Creating cybersecurity knowledge graphs from malware after action reports IEEE Access (2021), Aritran Piplai, Sudip Mittal, Anupam Joshi, Tim Finin, James Holt, Richard Zak. Knowledge Enrichment by Fusing Representations for Malware Threat Intelligence and Behavior 18th IEEE International Conference on Intelligence and Security Informatics (ISI) (2021), Aritran Piplai, Sudip Mittal, Mahmoud Abdelsalam, Maanak Gupta, Anupam Joshi, Tim Finin. NAttack! Adversarial Attacks to bypass a GAN based classifier trained to detect Network intrusion 2020 IEEE Big Data Security/HPSC/IDS (2021), Aritran Piplai, Sai Sree Laya Chukkapalli , Anupam Joshi. Using knowledge graphs and reinforcement learning for malware analysis 2020 IEEE International Conference on Big Data (Big Data) (2021), Aritran Piplai, Priyanka Ranade, Anantaa Kotal, Sudip Mittal, Sandeep Nair Narayanan, Anupam Joshi. Preventing poisoning attacks on AI based threat intelligence systems IEEE Machine Learning for Signal Processing (2020), Nikita Khurana, Sudip Mittal, Aritran Piplai, Anupam Joshi. RelExt: Relation Extraction using Deep Learning approaches for Cybersecurity Knowledge Graph Improvement ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM '19), August 27--30, 2019, Vancouver, BC, Canada (2020), Aditya Pingle, Aritran Piplai, Sudip Mittal, Anupam Joshi, Tim Finin, James Holt, Richard Zak. Presentations Towards building Adaptive Models for Autonomous Cyber Defense (2024), Volume Fort Collins, Colorado, Aritran Piplai. LLMs for Malware Binaries (2024), Aritran Piplai. Modeling Cyber attacks and Defenses with Semantic Knowledge (2024), Aritran Piplai. Adaptive AI models for detecting novel attacks (2024), Aritran Piplai, Christopher Kiekintveld. > Grants < No info available. > Current/Future Courses < Term Course Section Syllabus Fall 2025 CS 4351 - Computer Security 12721 Fall 2025 CS 5352 - Computer Security 13266 Fall 2025 CS 6294 - Doctoral Research 17910 Fall 2025 CS 6394 - Doctoral Research 18556 Fall 2025 CS 6694 - Doctoral Research 16234 Fall 2025 AI 4361 - Machine Learning 17005 Fall 2025 CS 4361 - Machine Learning 12746 Fall 2025 CS 5399 - Master's Thesis 17903 Past Courses Select Term: All Spring 2025 Fall 2024 Summer 2024 Spring 2024 Fall 2023 Apply Term Course Section Syllabus Spring 2025 CS 6391 - Individual Studies 28050 Spring 2025 CS 4361 - Machine Learning 24321 Syllabus Spring 2025 CS 5398 - Master's Thesis 26494 Spring 2025 CS 5398 - Master's Thesis 28356 Fall 2024 CS 4361 - Machine Learning 13052 Syllabus Fall 2024 CS 5399 - Master's Thesis 18200 Summer 2024 CS 4371 - Computer Science Problems 34155 Spring 2024 CS 4361 - Machine Learning 25011 Syllabus Spring 2024 CS 5361 - Machine Learning 25012 Syllabus Spring 2024 CS 5398 - Master's Thesis 28236 Fall 2023 CS 4361 - Machine Learning 13576 > Course Evaluations < Term Course Section Evaluation Spring 2025 CS 4361 - Machine Learning 24321 Evaluation Fall 2024 CS 4361 - Machine Learning 13052 Evaluation Spring 2024 CS 4361 - Machine Learning 25011 Evaluation Spring 2024 CS 5361 - Machine Learning 25012 Evaluation Fall 2023 CS 4361 - Machine Learning 13576 Evaluation > Bio Bio Dr. Piplai joins UTEP from the University of Maryland, Baltimore County (UMBC), where he taught introduction to AI courses and served as a graduate research assistant creating novel knowledge graph-guided reinforcement learning algorithms for autonomous cyber defense projects. His research background focuses on automated cyber defenses, cybersecurity knowledge graphs, cyber threat intelligence, reinforcement learning, and adversarial learning. Dr. Piplai earned a doctoral degree in computer science from UMBC and a bachelor’s in computer science and engineering from Jadavpur University in India. While at UMBC, Dr. Piplai served on program committees for the International Conference on Machine Learning and the International Conference on Big Data. He was the session chair for the IEEE International Conference on Machine Learning Applications in 2022. He also has industry experience at Amazon Science and Samsung Research. At UTEP his research area is finding evolving cyber-threats and malware. Some of the methods that he uses are leveraging LLMs, natural language processing, and knowledge graphs to provide textual descripto",
  "content_length": 14118,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:58"
}