{
  "name": "Arjun Bhagoji",
  "homepage": "https://arjunbhagoji.github.io",
  "status": "success",
  "content": "Arjun Bhagoji Arjun BhagojiAssistant Professor @ C-MInDS, IITB Follow CC 120 Email LinkedIn Github Google ScholarI am an Assistant Professor in the Centre for Machine Intelligence and Data Science (C-MInDS) at IIT Bombay where I work with the IRoHS Lab. Previously, I was a Research Scientist in the Department of Computer Science at the University of Chicago working with Ben Zhao and Nick Feamster. My research focuses on robust and reliable machine learning. I am also interested in the application of machine learning to problems of societal interest. I completed my Ph.D. under the supervision of Prateek Mittal in the Department of Electrical and Computer Engineering at Princeton University. I spent five wonderful years at the Indian Institute of Technology Madras in a Dual Degree (B.Tech.+M.Tech.) program in Electrical Engineering. For an accessible overview of my research, see Research and for a full list of papers, see Publications.News05/2025: Paper auditing Twitch’s content moderation tool has been accepted to ACL 2025. Congratulations Prarabdh, Geralyn and Yash!05/2025: Work demonstrating how to adapt models to be robust to evolving adversaries has been accepted to ICML 2025. Congratulations Sophie and Christian!02/2025: Joined C-MInDS at IIT Bombay as an Assistant Professor.08/2024: Our work on analyzing content moderation policies was featured on the UChicago CS Department’s website.07/2024: Showed that unsupervised machine learning models can discover new blocking signatures for DNS censorship in a paper appearing in FOCI 2024. Congratulations Paola and Larissa!03/2024: Paper on analyzing content moderation policies across the top 43 websites has been accepted to CHI 2024. Congratulations Brennan!02/2024: Gave talks on Towards Robust and Reliable Machine Learning at IIT Bombay, IIT Madras, IIT Palakkad, IIT Gandhinagar, IISc, MSR India, IISER Pune, TIFR, IIT Delhi and IIIT-Delhi.01/2024: We demonstrated a model versioning technique to create model sequences robust to transferable adversarial examples which was accepted to IEEE SaTML. Congratulations Wenxin!12/2023: Our work demonstrating diffusion models can be adapted to generate protocol-compliant network data is to appear in SIGMETRICS 2024/POMACS. Congratulations Chase and Shinan!09/2023: Paper on lower bounds for robust multi-class classifiers accepted to Neurips 2023 as a Spotlight!07/2023: Two papers accepted to the ICML 2023 Workshop on Frontiers of Adversarial Machine Learning on lower bounds for multi-class models and feature extractors.07/2023: The LEAF paper on drift mitigation in cellular networks is accepted to CoNEXT 2023 and PACMNET. Congratulations Shinan!05/2023: Paper on automated censorship detection is accepted to KDD 2023. Congratulations to the team!",
  "content_length": 2779,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:58"
}