{
  "name": "Arjun Mukherjee",
  "homepage": "http://www2.cs.uh.edu/~arjun",
  "status": "success",
  "content": "Arjun Mukherjee, Computer Science, University of Houston Arjun Mukherjee Department of Computer Science University of Houston 501 Philip G. Hoffman Hall (PGH), Dept. of Computer Science, 3551 Cullen Blvd., Houston, TX 77204-3010 Research Interests Areas: Bayesian Inference, Data Mining, Natural Language Processing, Sentiment Analysis, Opinion Spam, and Web Mining. Publications Full listing ordered by citations: Google Scholar Recent publications reverse chronologically sorted: Google Scholar Selected older papers: [Hosseinia/etal/19] Marjan Hosseinia, Eduard Dragut, and Arjun Mukherjee. Pro/Con: Neural Detection of Stance in Argumentative Opinions. International Conference on Social Computing, Behavioral-Cultural Modeling & Prediction (SBP'19). [Paper] [Maity/etal/18] Suman Kalyan Maity, Santosh KC and Arjun Mukherjee. Spam2Vec: Learning Biased Embeddings for Spam Detection in Twitter.. In proceedings of the ACM International World Wide Web Conference (WWW'18) Poster Track. [Paper] [Schneider/etal/18] Andrew Schneider, Arjun Mukherjee and Eduard Dragut. Leveraging Social Media Signals for Record Linkage. In proceedings of the ACM International World Wide Web Conference (WWW'18). [Paper] [Boumber/etal/18] Dainis Boumber, Yifan Zhang, Arjun Mukherjee. Experiments with Convolutional Neural Networks for Multi-Label Authorship Attribution.. In proceedings of the 11th International Conference on Language Resources and Evaluation (LREC'18). [Paper] [Yang/etal/17] Fan Yang, Arjun Mukherjee, Eduard Dragut. Satire News Detection and Analysis using Attention Mechanism and Linguistic Features. In proceedings of the conference on Empirical Methods in Natural Language Processing (EMNLP'17). [Paper] [Li/etal/17] Huayi Li, Geli Fei, Shuai Wang, Bing Liu, Weixiang Shao, Arjun Mukherjee and Jidong Shao. Bimodal Distribution and Co-Bursting in Review Spam Detection. In proceedings of the ACM International World Wide Web Conference (WWW'17). April 3-7, 2017, Perth, Australia. [Paper] [Hosseinia/Mukherjee/17] Marjan Hosseinia and Arjun Mukherjee. Detecting Sockpuppets in Deceptive Opinion Spam . In proceedings of the 18th International Conference on Intelligent Text Processing and Computational Linguistics (CICLING'17). April 17-23, 2017 in Budapest, Hungary. [Paper] [Fei/etal/15] Geli Fei, Arjun Mukherjee, Zhiyuan Chen and Bing Liu. Discovering Correspondence of Sentiment Words and Aspects. In proceedings of the 17th International Conference on Intelligent Text Processing and Computational Linguistics (CICLING'16). April 3-9, 2016 in Konya, Turkey. [Paper] [Kc/Mukherjee/16] Santosh Kc and Arjun Mukherjee. On the Temporal Dynamics of Opinion Spamming: Case Studies on Yelp. In proceedings of the ACM International World Wide Web Conference (WWW'16). April 11-15, 2016, Montreal, Canada. [Paper] [Dataset] [Shrehtha/etal/16] Prasha Shrestha, Arjun Mukherjee, Thamar Solorio. Large Scale Authorship Attribution of Online Reviews. In proceedings of the 17th International Conference on Intelligent Text Processing and Computational Linguistics (CICLING'16). April 3-9, 2016 in Konya, Turkey. [Paper] [Dataset] [Mukherjee/16] Arjun Mukherjee. Extracting Aspect Specific Sentiment Expressions implying Negative Opinions. In proceedings of the 17th International Conference on Intelligent Text Processing and Computational Linguistics (CICLING'16). April 3-9, 2016 in Konya, Turkey. [Paper] [Dataset] [Li/etal/15] Huayi Li, Zhiyuan Chen, Arjun Mukherjee, Bing Liu, Jidong Shao. Analyzing and Detecting Opinion Spam on a Large-scale Dataset via Temporal and Spatial Patterns. In proceedings of the 9th International AAAI Conference on Web and Social Media (AAAI-ICWSM'15). May 26-29, 2015 Oxford, UK. [Paper] [Li/etal/14] Huayi Li, Arjun Mukherjee, Bing Liu, Rachel Kornfield, Sherry L. Emery. Detecting Campaign Promoters on Twitter using Markov Random Fields. In proceedings of the IEEE International Conference on Data Mining (ICDM'14). December 14-17, 2014 - Shenzhen, China. [Paper] [Si/etal/14] Jianfeng Si, Arjun Mukherjee, Bing Liu, Sinno Jialin Pan, Qing Li, and Huayi Li. Exploiting Social Relations and Sentiment for Stock Prediction. In proceedings of the Conference on Empirical Methods in Natural Language Processing (EMNLP'14). October 25-29, 2014 - Doha, Qatar. [Paper] [Chen/etal/14] Zhiyuan Chen, Arjun Mukherjee, Bing Liu. Aspect Extraction with Automated Prior Knowledge Learning. Accepted for Oral presentation. To appear in the proceedings of the 52nd Annual Meeting of the Association for Computational Linguistics (ACL'14). Baltimore, June 22-27, 2014. [Paper] [Mukherjee/etal/13c] Arjun Mukherjee, Abhinav Kumar, Bing Liu, Junhui Wang, Meichun Hsu, Malu Castellanos, and Riddhiman Ghosh. Spotting Opinion Spammers using Behavioral Footprints. Proceedings of the 19th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD'13). August 11-14, Chicago, USA. [Paper] [Si/etal/13] Jianfeng Si, Arjun Mukherjee, Bing Liu, Qing Li, and Huayi Li. Exploiting Topic based Twitter Sentiment for Stock Prediction. Proceedings of the 51st Annual Meeting of the Association for Computational Linguistics (ACL'13). August 4-9, Sofia, Bulgaria. [Paper] [Mukherjee/etal/13b] Arjun Mukherjee, Vivek Venkataraman, Bing Liu, and Sharon Meraz. Public Dialogue: Analysis of Tolerance in Online Discussions. Proceedings of the 51st Annual Meeting of the Association for Computational Linguistics (ACL'13). August 4-9, Sofia, Bulgaria. [Paper] [Mukherjee/etal/13a] Arjun Mukherjee, Vivek Venkataraman, Bing Liu, and Natalie Glance. What Yelp Fake Review Filter might be Doing? Proceedings of the 7th International AAAI Conference on Weblogs and Social Media (ICWSM'13). July 8-10, 2013, Boston, USA. [Paper] For Dataset, and more detailed analysis, refer to the technical report UIC-CS-2013-03 below [Mukherjee/Liu/12a] Arjun Mukherjee and Bing Liu. Mining Contentions from Discussions and Debates. In Proceedings of the 18th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD'12). August 12-16, Beijing, China. [Paper] [Dataset] [Mukherjee/etal/12] Arjun Mukherjee, Bing Liu, and Natalie Glance. Spotting Fake Reviewer Groups in Consumer Reviews. In Proceedings of the ACM International World Wide Web Conference (WWW'12). April 16-20, 2012, Lyon, France. [Paper] [Dataset] [Mukherjee/Liu/12b] Arjun Mukherjee and Bing Liu. Aspect Extraction through Semi-Supervised Modeling. In the Proceedings of the 50th Annual Meeting of the Association for Computational Linguistics (ACL'12). July 9-12, 2012, Jeju, Korea. [Paper] [Dataset] [Mukherjee/Liu/10] Arjun Mukherjee and Bing Liu. Improving Gender Classification of Blog Authors. In Proceedings of the conference on Empirical Methods in Natural Language Processing (EMNLP'10). Oct. 9-11, 2010, MIT, Massachusetts, USA. [Paper] [Dataset] Technical Reports [Kc/Mukherjee/17] Santosh Kc and Arjun Mukherjee. Characterizing Product Lifecycle in Online Marketing: Sales, Trust, Revenue, and Competition Modeling.. arXiv preprint arXiv:1704.02993. 2017 [Dataset] This is a near-complete Amazon review dump as of Mar 2017 [Li/etal/16] Huayi Li, Geli Fei, Shuai Wang, Bing Liu, Weixiang Shao, Arjun Mukherjee, Jidong Shao. Modeling Review Spam Using Temporal Patterns and Co-bursting Behaviors.. arXiv preprint arXiv:1611.06625. 2016 [Mukherjee/14] Arjun Mukherjee. Probabilistic Models for Fine-Grained Opinion Mining: Algorithms and Applications. Ph.D. Thesis. University of Illinois at Chicago, 2014. [Mukherjee/Venkataraman/14] Arjun Mukherjee, Vivek Venkataraman. Opinion Spam Detection: An Unsupervised Approach using Generative Models. UH-CS-TR-2014-07. 2014 [Mukherjee/etal/13] Arjun Mukherjee, Vivek Venkataraman, Bing Liu, Natalie Glance. Fake Review Detection: Classification and Analysis of Real and Pseudo Reviews. UIC-CS-2013-03. 2013 [Dataset] Teaching Data Structures Advanced Natural Language Processing Data Mining Machine Learning Natural Language Processing Tutorial: Detecting Deceptive Opinion Spam using Linguistics, Behavioral and Statistical Modeling. In the 53rd Annual Meeting of the Association for Computational Linguistics (ACL'15). Beijing, China July 26-31, 2015 [Abstract] [Slides]",
  "content_length": 8201,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:59"
}