{
  "name": "Arjun Arunasalam",
  "homepage": "https://arjunarunasalam.github.io",
  "status": "success",
  "content": "About me - Arjun Arunasalam Arjun Arunasalam Follow Miami, FL Twitter LinkedIn Google Scholar I am an Assistant Professor at Florida International University (Knight Foundation School of Computing and Information Sciences). My research goal is understanding and improving human-centered security, privacy, and trust in sociotechnical systems. I received my Ph.D. in Computer Science at Purdue University, working under the supervision of Dr. Z. Berkay Celik and part of PurSec Lab. Before that I received my Bachelors in Computer Engineering from the University of Michigan, Ann Arbor. Now recruiting two PhD students for Fall 2026 at FIU (Computer Science). We study human-centered security & privacy— with areas of interest in (1) human-AI interfaces, (2) XR and (3) online cybercrime. Prior research experience, especially in applied AI and user-centered methodologies, is highly valued. Please email aarunasa [at] fiu [dot] edu with the subject “Interest in fall 2026 phd position at FIU”, to express your interest and summarize your research experience. Please include a CV in your email. News(scroll to see older news)[October 2025] Two papers accepted to IEEE S&P Oakland 2026 - Congratulations Katie, Brandon and Devin![September 2025] Our work on LLMs and Values was accepted to the main findings of EMNLP 2025.[August 2025] I just joined FIU as an assistant professor.[May 2025] I successfully defended my PhD dissertation! Very grateful to my research advisor for his support. Big thanks to my friends, family and mentors.[April 2025] Our work on user privacy concerns with conversational AI agents (done in collaboration with UC Irvine) was accepted to IEEE S&P. Congrats Mutahar![March 2025] Our user-centered work on investigating Indicators of Compromise for Industrial Control System Security was accepted to Elsevier's Computers & Security journal. Congratulations Mohammed![February 2025] Our work on studying online communities of threat actors was accepted into a IEEE S&P magazine special issue on cybercrime and online harm[January 2025] Our paper on XR Security was accepted into USENIX 25. Congratulations to Chandrika![December 2024] I gave an invited talk at UIowa as part of the rising star event!",
  "content_length": 2224,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:58"
}