{
  "name": "Arkady Yerukhimovich",
  "homepage": "https://www2.seas.gwu.edu/~arkady",
  "status": "success",
  "content": "Arkady Yerukhimovich Arkady Yerukhimovich Assistant Professor of Computer Science About Me I am an Assistant Professor of Computer Science at The George Washington University. Previously, I was a research scientist in the Secure Resilient Systems and Technology group at MIT Lincoln Laboratory. I received my Ph.D. at the University of Maryland under Jonathan Katz. I am always looking for talented, mathematically-mature, students interested in theoretical and applied cryptography. E-Mail: arkady@gwu.edu Research Interests I am broadly interested in various topics across theoretical and applied cryptography with a particular focus on secure, privacy-preserving computation. I am interested both in the theoretical questions of what is possible as well as in analyzing security of and building protocols for practical applications. Large-Scale Secure Computation Detecting Fake News in Encrypted Messaging Post-Quantum Cryptography Secure Search Black-Box Reductions Secure multi-party computation (MPC) enables privacy-preserving computation on private inputs. As the collection and use of sensitive data proliferates in today’s world, MPC provides a means for data owners to regain control of their private information. I am interested in developing MPC protocols that scale to the needs of today’s applications. Specifically, I aim to design protocols that can scale to thousands of participants and that can handle large input sizes. My research combines techniques such as committee-based MPC, sketching algorithms, and differential privacy to develop protocols with the needed privacy and performance guarantees. Selected Papers: TCC 2022, Eurocrypt 2021, PETS 2020, CCS 2019 The proliferation of fake news in today’s social networks and communication platforms poses a critical problem to society. While platforms such as Facebook attempt to monitor fake information on their platform, this becomes very challenging when the data is encrypted and thus unavailable to the platform. I am interesting in designing protocols to help address this fake news problem in encrypted messaging platforms such as Signal. My research develops secure crowd-sourcing protocols that allow detection of viral fake news without harming the privacy of honest users. Selected Papers: NDSS 2022 In preparation for the eventual availability of quantum computing, it is necessary to develop and study the security of post-quantum cryptographic protocols that remain secure in the presence of quantum computing. My research has focused on analyzing the security of the finalist schemes in the NIST PQC standardization process showing their vulnerability to remote Rowhammer attacks. We have demonstrated that most of these schemes are vulnerable. Selected Papers: CCS 2022 Secure search enables a database to answer queries over private data while revealing little more than the answers to those queries. Over the last decade, this has grown into an active reseearch area with many constructions and analyses of security and privacy of these schemes. I am interested in designing new secure search schemes achieving better trade-offs between performance and security both for general search problems and for specialized classes of queries such as range queries. Selected Papers: CCS 2021, IEEE S&P 2017, CCS 2016 An important goal in cryptography is to show which advanced primitives can be constructed from simpler primitives and assumptions. The most common way of building such constructions is via black-box reductions. I am very interested both in showing black-box constructions of useful primitives from general assumptions, and in demonstrating black-box, and nonblack-box, separations to understand the barriers to such constructions. Selected Papers: PKC 2017, TCC 2014, TCC 2011a, TCC 2011b, TCC 2011c, Latincrypt 2010, Asiacrypt 2009 Recent Publications ID Title Authors Bibliography C 1 Secure Sampling with Sublinear Communication Secure Sampling with Sublinear Communication Seung Geol Choi, Dana Dachman-Soled, S. Dov Gordon, Linsheng Liu, and Arkady Yerukhimovich TCC C 2 When Frodo Flips: End-to-End Key Recovery on FrodoKEM via Rowhammer When Frodo Flips: End-to-End Key Recovery on FrodoKEM via Rowhammer Michael Fahr, Hunter Kippen, Andrew Kwong, Thinh Dang, Jacob Lichtinger, Dana Dachman-Soled, Daniel Genkin, Alexander Nelson, Ray A. Perlner, Arkady Yerukhimovich, and Daniel Apon ACM CCS C 3 Fighting Fake News in Encrypted Messaging with the Fuzzy Anonymous Complaint Tally System (FACTS) Fighting Fake News in Encrypted Messaging with the Fuzzy Anonymous Complaint Tally System (FACTS) Linsheng Liu, Daniel S. Roche, Austin Theriault, and Arkady Yerukhimovich NDSS C 4 Compressed Oblivious Encoding for Homomorphically Encrypted Search Compressed Oblivious Encoding for Homomorphically Encrypted Search Seung Geol Choi, Dana Dachman-Soled, S. Dov Gordon, Linsheng Liu, and Arkady Yerukhimovich ACM CCS C 5 The More the Merrier: Reducing the Cost of Large Scale MPC The More the Merrier: Reducing the Cost of Large Scale MPC S. Dov Gordon, Daniel Starin, and Arkady Yerukhimovich EUROCRYPT Complete list",
  "content_length": 5116,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:05"
}