{
  "name": "Arkadi Nemirovski",
  "homepage": "https://www.isye.gatech.edu/users/arkadi-nemirovski",
  "status": "success",
  "content": "Arkadi Nemirovski | H. Milton Stewart School of Industrial and Systems Engineering Skip to main navigation Skip to main content Arkadi Nemirovski John P. Hunter, Jr. Chair and Professor Contact Groseclose 446 404.385.0769 Personal website Contact Education Ph.D. Mathematics (1974), Moscow State University Doctor of Physical & Mathematical Sciences (1990), Supreme Attestation Board at the USSR Council of Ministers Expertise Convex and Continuous Optimization About Arkadi Nemirovski is the John P. Hunter, Jr. Chair in the H. Milton Stewart School of Industrial and Systems Engineering at Georgia Tech. Dr. Nemirovski's research interests focus on Optimization Theory and Algorithms, with emphasis on investigating complexity and developing efficient algorithms for nonlinear convex programs, optimization under uncertainty, applications of convex optimization in engineering, and nonparametric statistics. Dr. Nemirovski has made fundamental contributions in continuous optimization in the last thirty years that have significantly shaped the field. In recognition of his contributions to convex optimization, Nemirovski was awarded the 1982 Fulkerson Prize from the Mathematical Programming Society and the American Mathematical Society (joint with L. Khachiyan and D. Yudin), the Dantzig Prize from the Mathematical Programming Society and the Society for Industrial and Applied Mathematics in 1991 (joint with M. Grotschel). He was elected a Member of the National Academy of Engineering (2017) and a Fellow of the American Academy of Arts and Sciences (2018). In recognition of his seminal and profound contributions to continuous optimization, Nemirovski was awarded the 2003 John von Neumann Theory Prize by the Institute for Operations Research and the Management Sciences (along with Michael Todd). He He continues to make significant contributions in almost all aspects of continuous optimization: complexity, numerical methods, stochastic optimization, and non-parametric statistics. Dr. Nemirovski earned a Ph.D. in Mathematics (1974) from Moscow State University,  the Doctor of Sciences in Mathematics (1990) from the Supreme Attestation Board at the USSR Council of Ministers, and the Doctor of Mathematics (Honoris Causa) from the University of Waterloo, Canada (2009). Awards and Honors Member of the National Academy of Sciences 2020 Norbert Wiener Prize in Applied Mathematics from AMS and SIAM (with M. Berger) 2019 Member of the American Academy of Arts and Sciences 2018 Member of the National Academy of Engineering 2017 Honoris Causa Degree of Doctor of Mathematics, University of Waterloo, Canada 2009 John von Neumann Theory Prize of INFORMS (with M. Todd) 2003 Dantzig Prize of the Mathematical Programming Society and SIAM (with M. Grotschel) 1991 Fulkerson Prize of the Mathematical Programming Society and AMS (with L. Khachiyan and D. Yudin) 1982",
  "content_length": 2880,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:59"
}