{
  "name": "Arman Adibi",
  "homepage": "https://adibiarman.github.io",
  "status": "success",
  "content": "Bio - Arman Adibi’s homepage Arman AdibiAssistant Professor, School of Computer and Cyber Sciences, Augusta University Follow Email Twitter LinkedIn Github Google ScholarI am an Assistant Professor in the School of Computer and Cyber Sciences at Augusta University. Previously, I was a postdoctoral researcher in Electrical and Computer Engineering at Princeton University, working with Prof. H. Vincent Poor and Prof. Sanjeev Kulkarni; I also collaborated with Prof. Vahid Tarokh (Duke) and Prof. Taposh Banerjee (University of Pittsburgh). I earned my Ph.D. in Electrical and Systems Engineering from the University of Pennsylvania under Prof. Hamed Hassani and worked closely with Prof. George J. Pappas, Prof. Aritra Mitra (NC State), and Prof. Aryan Mokhtari (UT Austin).ResearchMy research focuses on the theoretical foundations of artificial intelligence with emphasis on scalable and reliable learning algorithms operating in nonstationary, distributed, and adversarial environments. A central objective is to develop methods that remain statistically efficient, computationally feasible, and robust under uncertainty, which motivates several interconnected research directions listed below.Reinforcement Learning. I analyze and design reinforcement learning algorithms under delayed, partial, or adversarial updates and derive non-asymptotic reliability guarantees for distributed systems.Distributed Learning. I develop communication- and computation-efficient methods for large-scale collaborative learning under heterogeneous delays, partial participation, and Byzantine failures.Minimax Optimization. I study convex and nonconvex minimax problems and construct algorithms with provable convergence guarantees in adversarial, asynchronous, and resource-constrained settings.Change Detection under Uncertainty. I develop sequential detection methods for high-dimensional and unnormalized distributions, including energy-based models, that adapt to nonstationarity with quantifiable false-alarm and detection-delay guarantees.Submodular Optimization. I design scalable algorithms for discrete decision-making under uncertainty with provable near-optimality based on submodular structure.Meta-Learning. I study adaptive learning procedures that transfer knowledge across related tasks, enabling sample-efficient generalization and reliable performance in nonstationary environments.Decision-Making under Uncertainty. I examine principled risk measures, distributionally robust optimization, and worst-case formulations to ensure dependable performance in safety-critical and shift-sensitive settings.Robustness of Deep Learning. I investigate the statistical and algorithmic foundations of deep models subject to perturbations, memorization, and distribution shift, aiming for guarantees on generalization, stability, and reliability in high-dimensional regimes.Generative AI and Diffusion Models. I study score-based diffusion processes, normalizing flows, and energy-based models with theory for sample efficiency, stability, and control of memorization, together with statistically grounded estimators based on score matching.Multimodal Machine Learning. I develop representation learning and modality fusion methods for heterogeneous data including vision, audio, text, and temporal signals, with guarantees for alignment, robustness, and sequential decision-making across modalities.Open PositionsI am currently recruiting highly motivated PhD students who have a strong mathematical background to join my research group. If you are interested in pursuing a PhD in a collaborative and dynamic environment, please send your CV and transcript to aadibi@augusta.edu with the subject line: “PhD Application – Augusta University.”",
  "content_length": 3739,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:01"
}