{
  "name": "Arman Roohi",
  "homepage": "https://armanroohi.com",
  "status": "success",
  "content": "iDEA Lab Arman Roohi Home Research Teaching Publications Academic Services Contact Download CV Search for: ©Copyright armanoid 2024 I (Arman Roohi) am an associate professor in the Department of Electrical and Computer Engineering at the University of Illinois, Chicago, Chicago, IL, USA, where I am the director of the SIRIUS (Self-sustainable Intelligent Resilient Ubiquitous Systems) Laboratory. Before joining UIC, I was an assistant professor at the University of Nebraska-Lincoln (2020-2024) and a postdoctoral research fellow at the University of Texas at Austin (2019-2020). I received my Ph.D. in Computer Engineering at the University of Central Florida, Orlando, FL, USA, in 2019. My group research endeavors span the areas of design and implementation of cross-layer (device, circuit, architecture) co-design for complex machine learning tasks, secure computation, and intermittent computing. Our work emphasizes resiliency and ubiquity in systems to ensure robust performance across varying conditions and environments. We also delve into hardware security and the security of artificial intelligence. Specifically, our team tackles practical challenges in machine learning, computer architecture, and embedded systems, aiming to seamlessly integrate neuromorphic computing approaches with traditional Von Neumann architectures to advance ubiquitous and intermittent computing solutions. News [Mar 2025]: Our paper “Wet-Neuromorphic Computing: A New Paradigm for Biological Artificial Intelligence” is accepted to IEEE Intelligent Systems. [Feb 2025]: Our paper “Autonomous Integrated Sensing and Processing for BioRadar: Advancing Non-Invasive Biomedical Monitoring and Signal Analysis” is accepted to IMBioC 2025. [Feb 2025]: Our paper “ResISC: Residue Number System-Based Integrated Sensing and Computing for Efficient Edge AI” is accepted to DAC 2025. [Feb 2025]: Our paper “Pseudo-Random versus Quasi-Random Number Generation using Quantum Circuits” is accepted to ARQTEC co-located with HPCA 2025. [Feb 2025]: I am invited to serve as a TPC member for the ICCAD 2025. [Feb 2025]: I am invited to serve as the Associate Editor for EMBC 2025. [Feb 2025]: I am invited to serve as a TPC member for the SenSys 2025. [Feb 2025]: Our paper “ATM-Net: Adaptive Termination and Multi-Precision Neural Networks for Energy-Harvested Edge Intelligence” is accepted to EMC2 co-located with HPCA 2025. [Jan 2025]: Our paper “Neuro-Photonix: Enabling Near-Sensor Neuro-Symbolic AI Computing on Silicon Photonics Substrate” is accepted to IEEE TCASAI. [Jan 2025]: I am invited to serve as the TPC track chair for FCCM 2025. [Jan 2025]: I am invited to serve as the TPC track chair for COINS 2025. [Dec 2024]: Our paper “PINSim: A Processing In- and Near-Sensor Simulator to Model Intelligent Vision Sensors” is accepted to IEEE CAL. [Nov 2024]: I am invited to serve as a TPC member for the EDGE AI Research Symposium 2025. [Nov 2024]: I have organized a special session entitled “SMART: Enhancing Sensory IoT with In/Near-Sensor Processing for Advanced Imaging and Visual Sensing” collocated with FCCM 2025. [Oct 2024]: Our paper “APRIS: Approximate Processing ReRAM In-Sensor Architecture Enabling Artificial-Intelligence-Powered Edge” is accepted to IEEE TETC. [Oct 2024]: I have been invited to serve as a Panelist at the Workshop on AI integration with Renewable Energy harvesting sources (WAIRE) at IEEE BSN. [Sep 2024]: Our paper “SRC: Sustainable Reactive Computing for Battery-free Edge Intelligence” is accepted to IGSC 2024. [July 2024]: Our paper “ViTSen: Bridging Vision Transformers and Edge Computing with Advanced In/Near-Sensor Processing” is accepted to IEEE ESL. [May 2024]: Our paper “DECO: Dynamic Energy-Aware Compression and Optimization for In-Memory Neural Networks” is accepted to MWSCAS 2024. [May 2024]: Four papers have been accepted to ISVLSI 2024.” Congratulations all! [May 24]: I am invited to serve as a TPC member for ICCD 2024. [April 24]: I am invited to serve as a TPC member for ICONS 2024. [April 24]: I am invited to serve as a TPC member for ICCAD 2024. [April 2024]: Our paper “RACSen: Residue Arithmetic and Chaotic Processing in Sensors to Enhance CMOS Imager Security” is accepted to GLSVLSI 2024. [Feb 2024]: Our paper “Intermittent-Aware Design Exploration of Systolic Array Using Various Non-Volatile Memory: A Comparative Study” is accepted to Micromachines Journal. My NSF CAREER “Elastic Intermittent Computation Enabling Batteryless Edge Intelligence” is funded by NSF (abstract). Thanks, NSF, for the generous support! [Feb 2024]: Two papers have been accepted to DAC 2024. [Feb 2024]: Our paper “Enabling Normally-off In-Situ Computing with a Magneto-Electric FET-based SRAM Design” is accepted to IEEE TED. [Feb 2024]: I am invited to serve as a TPC member for GLSVLSI 2024. [Feb 2024]: I am invited to serve as a track chair for ISVLSI 2024. [Jan 2024]: I am invited to serve as a TPC member for ISLPED 2024. [Dec 2023]: I am invited to serve as a TPC member for ICMI 2024. [Nov 2023]: Three papers have been accepted to DATE 2024. [Oct 2023]: I am invited to serve as a TPC member for tinyML Research Symposium 2024. [Oct 2023]: Our paper “Deep Mapper: A Multi-Channel Single-Cycle Near-Sensor DNN Accelerator” is accepted to IEEE ICRC. [Oct 2023]: I am invited to serve as a TPC member for DAC 2024. Our project proposal entitled “CSR: Small: Cross-Layer Solutions Enabling Instant Computing for Edge Intelligence Devices” is funded by NSF (abstract). Thanks, NSF, for the generous support! [Sep 2023]: I am invited to serve as a TPC member for SVCC 2024. [Sep. 2023]: Our paper “EnCoDe: Enhancing Compressed Deep Learning Models through Feature Distillation and Informative Sample Selection” is accepted to IEEE ICMLA. [August 2023]: I am invited to serve as a TPC member for ISQED 2024. [August 2023]: I am invited to serve as a TPC member for ICMLA 2024. [August 2023]: Our paper “PiPSim: A Behavior-Level Modeling Tool for CNN Processing-in-Pixel Accelerators” is accepted to IEEE TCAD. [July 2023]: I am invited to give a talk at the Solid-State Circuits Society (SSCS) Open Journal Webinar Series. Our collaborative project proposal entitled “SaTC: CORE: Medium: Security and Robustness for Intermittent Computing Using Cross-Layer Post-CMOS Approaches” is funded by NSF (abstract). Thanks, NSF, for the generous support! [July 2023]: I am invited to give a talk at the Solid-State Circuits Society (SSCS) Open Journal Webinar Series. [July 2023]: I am invited to serve as a TPC member for ISQED 2024. [July 2023]: Our paper “Design and Evaluation of a Near-Sensor Magneto-Electric FET-based Event Detector” is accepted to IEEE TED. [July 2023]: Our paper “Ocellus: Highly Parallel Convolution-in-Pixel Scheme Realizing Power-Delay-Efficient Edge Intelligence” has been selected as the Best Paper Candidate in ISLPED 2023. [July 2023]: Our paper “PISA: A Non-Volatile Processing-In-Sensor Accelerator for Imaging Systems” is accepted to IEEE TETC 2023. [June 2023]: I am invited to serve as a TPC member for ICCD 2023. [June 2023]: Our paper “Near-Sensor Processing Accelerator for Approximate Local Binary Pattern Networks” is accepted to IEEE TETC 2023. [June 2023]: Our paper “Comparative Study of Low Bit-width DNN Accelerators: Opportunities and Challenges” is accepted to MWSCAS 2023. [May 2023]: Our paper “Ocellus: Highly Parallel Convolution-in-Pixel Scheme Realizing Power-Delay-Efficient Edge Intelligence” is accepted to ISLPED 2023. [May 2023]: I am invited to give a talk at the Multicore and Multiprocessor SoCs (MPSoC) 2023. [Mar 2023]: I am the recipient of the Outstanding Teaching Award – Graduate Level, School of Computing, University of Nebraska-Lincoln, 2022-2023. [Mar 2023]: Our paper “SenTer: A Reconfigurable Processing-in-Sensor Architecture Enabling Efficient Ternary MLP” is accepted to GLSVLSI 2023. [Mar 2023]: I am invited to serve as a TPC member for NOCS 2023. [Feb 2023]: I am invited to serve as a Track Chair for ISVLSI 2023. [Feb 2023]: Our paper “AppCiP: Energy-Efficient Approximate Convolution-in-Pixel Scheme for Neural Network Acceleration” is accepted to IEEE JETCAS. [Jan 2023]: Our paper “XOR-CiM: An Efficient Computing-in-SOT-MRAM Design for Binary Neural Network Acceleration” is accepted to ISQED 2023. [Jan 2023]: I am invited to serve as a session chair for the tinyML Research Symposium 2023. [Jan 2023]: I am invited to serve as a TPC member for GLSVLSI 2023. [Jan 2023]: I am invited to serve as a TPC member for ISLPED 2023. [Jan 2023]: Our paper “NeSe: Near-Sensor Event-Driven Scheme for Low Power Energy Harvesting Sensors” is accepted to ISCAS 2023. [Dec 2022]: I am invited to serve as a TPC member for the tinyML Research Symposium 2023. [Nov 2022]: Our paper “P-PIM: A Parallel Processing-in-DRAM Framework Enabling RowHammer Protection” is accepted to DATE 2023. [Nov 2022]: Our paper “LT-PIM: An LUT-based Processing-in-DRAM Architecture with RowHammer Self-Tracking” is accepted to IEEE Computer Architecture Letters (CAL). [Oct 2022]: Our paper “Ocelli: Efficient Processing-in-Pixel Array Enabling Edge Inference of Ternary Neural Networks” is accepted to Journal of Low Power Electronics and Applications. [Oct 2022]: Our paper “HARDeNN: Hardware-assisted Attack-resilient Deep Neural Network Architectures” is accepted to Microprocessors & Microsystems. [Sep 2022]: Our paper “MR-PIPA: An Integrated Multi-level RRAM (HfOx) based Processing-In-Pixel Accelerator” is accepted to IEEE JXCDC. Our collaborative project proposal entitled “Integrated Sensing and Normally-off Computing for Edge Imaging Systems” is funded by NSF (abstract). Thanks, NSF, for the generous support! [Sep 2022]: Our paper “semiMul: Floating-Point Free Implementations for Efficient and Accurate Neural Network Training” is accepted to ICMLA 2022. [Aug 2022]: Our paper “TizBin: A Low-Power Image Sensor with Event and Object Detection Using Efficient Processing-in-Pixel Schemes” is acc",
  "content_length": 13853,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:03"
}