{
  "name": "Armaghan Moemeni",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/armaghan.moemeni",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Armaghan (Magan) MoemeniAssistant Professor in Computer Science, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsTeaching and LearningResearchPublications Contact workRoom B72 Computer SceinceJubilee CampusWollaton RoadNottinghamNG8 1BBUKworkn/aArmaghan.Moemeni@nottingham.ac.ukhttps://www.linkedin.com/in/amoemeni/ BiographyArmaghan is a senior fellow of higher education academy (SFHEA) and holds a BEng (Hons) degree in Electrical and Electronics Engineering, MSc in Multimedia Computing and PhD in Computer Vision (Hybrid Motion Tracking Systems). She joined Nottingham's School of Computer Science, following her experience as Senior/Principal Lecturer at De Montfort University (DMU) for 17 years. Prior to her academic career, Armaghan worked in industry for a number of years where she held the position of developer and senior software architect. Her current research work is in applied machine learning ( personalised health and medical image understanding and diagnosis), ambient intelligence for assisted living as well as human computer/machine/robot interaction. At School of Computer Science,she currently holds the role of Director of Equality, Diversity and Inclusion (EDI) which is to operationalise EDI strategic objectives as well as representing school on Faculty and University EDI boards and activities.Teaching Summary COMP4124 - Big Data Learning and Technologies - L3 UG and L4 PGT COMP2005 Introduction to Image Processing - L2 UG COMP3010 Communication and Collaboration Technologies - L3 UG and L4… read moreResearch SummaryArmaghan's research expertise are in applied machine learning, computer vision, and multimodal human machine/computer interaction in virtual and physical environments. She has led projects with the… read moreSelected Publications SAUL CALDERON-RAMIREZ, SHENGXIANG YANG, ARMAGHAN MOEMENI, SIMON COLREAVY-DONNELLY, DAVID A. ELIZONDO, LUIS OALA, JORGE RODRÍGUEZ-CAPITÁN, MANUEL JIMÉNEZ-NAVARRO and EZEQUIEL LÓPEZ-RUBIO, 2021. Improving Uncertainty Estimation with Semi-supervised Deep Learning for COVID-19 Detection Using Chest X-ray Images IEEE Access Journal. CALDERON-RAMIREZ, S., GIRI, R., YANG, S., MOEMENI, A., UMANA, M., ELIZONDO, D., TORRENTS-BARRENA, J. and MOLINA-CABELLO, MIGUEL A., 2021. Dealing with Scarce Labelled Data: Semi-supervised Deep Learning with Mix Match for Covid-19 Detection Using Chest X-ray Images In: 25th International Conference on Pattern Recognition (ICPR). SAUL CALDERON-RAMIREZ, DIEGO MURILLO-HERNANDEZ, KEVIN ROJAS-SALAZAR, LUIS-ALEXANDER CALVO-VALVERDE, SHENGXIANG YANG, ARMAGHAN MOEMENI, DAVID ELIZONDO, EZEQUIEL LOPEZ-RUBIO and MIGUEL MOLINA-CABELLO, 2021. Improving Uncertainty Estimations for Mammogram Classification using Semi-Supervised Learning In: International Joint Conference on Neural Networks (IJCNN). BERMUDEZ, A., THANG, T., CALDERON-RAMIREZ, S., MOEMENI, A., YANG, S. and TORRENTS-BARRENA, J., 2020. A First Glance to the Quality Assessment of Dental Photostimulable Phosphor Plates with Deep Learning In: Proceedings of the 2020 IEEE International Joint Conference on Neural Networks, Glasgow, UK, July 2020.. View all publications COMP4124 - Big Data Learning and Technologies - L3 UG and L4 PGT COMP2005 Introduction to Image Processing - L2 UG COMP3010 Communication and Collaboration Technologies - L3 UG and L4 PGT COMP3014 Communication and Collaboration Technologies Development - L3 UG and L4 PGT COMP2002 Software Engineering Group Project - L2 UG MSc Projects Supervision - L4 PGT Undergraduate Projects Supervision - L3, L4 Level 6 Data Science Apprenticeship (2020-2022) UG : Undergraduate PGT : Postgraduate Current ResearchArmaghan's research expertise are in applied machine learning, computer vision, and multimodal human machine/computer interaction in virtual and physical environments. She has led projects with the theme of personalised healthcare, medical images diagnosis and understanding, semantic segmentation, assisted human-robot interaction, intelligent sensing to develop methods for recognising abnormal data patterns and behaviours in context-aware systems. Armaghan is a member of the UoN's Cyber-physical Health and Assistive Robotics Technologies (CHART) Research Group, where she conducts fundamental and applied research in intelligent cyber-physical systems and robotics technologies to support personalised and assisted health and well-being. Armaghan has also an interest in innovative pedagogical methodologies for teaching and learning. Accordingly; She has been the PI of an EU funded project ' Innovative ICT education for socio-economic development' - IESED (2017-2020) - with a pedagogical development focus. ZILING WU, ARMAGHAN MOEMENI, SIMON CASTLE-GREEN and PRAMINDA CALEB-SOLLY, 2023. Robustness of Deep Learning Methods for Occluded Object Detection - A Study Introducing a Novel Occlusion Dataset In: 2023 International Joint Conference on Neural Networks (IJCNN). CALDERON-RAMIREZ, SAUL, MURILLO-HERNANDEZ, DIEGO, ROJAS-SALAZAR, KEVIN, ELIZONDO, DAVID, YANG, SHENGXIANG, MOEMENI, ARMAGHAN and MOLINA-CABELLO, MIGUEL, 2022. A real use case of semi-supervised learning for mammogram classification in a local clinic of Costa Rica MEDICAL & BIOLOGICAL ENGINEERING & COMPUTING. CALDERON-RAMIREZ, S., GIRI, R., YANG, S., MOEMENI, A., UMANA, M., ELIZONDO, D., TORRENTS-BARRENA, J. and MOLINA-CABELLO, MIGUEL A., 2021. Dealing with Scarce Labelled Data: Semi-supervised Deep Learning with Mix Match for Covid-19 Detection Using Chest X-ray Images In: 25th International Conference on Pattern Recognition (ICPR). SAUL CALDERON-RAMIREZ, SHENGXIANG YANG, ARMAGHAN MOEMENI, SIMON COLREAVY-DONNELLY, DAVID A. ELIZONDO, LUIS OALA, JORGE RODRÍGUEZ-CAPITÁN, MANUEL JIMÉNEZ-NAVARRO and EZEQUIEL LÓPEZ-RUBIO, 2021. Improving Uncertainty Estimation with Semi-supervised Deep Learning for COVID-19 Detection Using Chest X-ray Images IEEE Access Journal. SAUL CALDERON-RAMIREZ, DIEGO MURILLO-HERNANDEZ, KEVIN ROJAS-SALAZAR, LUIS-ALEXANDER CALVO-VALVERDE, SHENGXIANG YANG, ARMAGHAN MOEMENI, DAVID ELIZONDO, EZEQUIEL LOPEZ-RUBIO and MIGUEL MOLINA-CABELLO, 2021. Improving Uncertainty Estimations for Mammogram Classification using Semi-Supervised Learning In: International Joint Conference on Neural Networks (IJCNN). SAUL CALDERON-RAMIREZ, SHENGXIANG YANG, ARMAGHAN MOEMENI, DAVID ELIZONDO, SIMON COLREAVY-DONNELLY, LUIS FERNANDO CHAVARRÍA-ESTRADA and MIGUEL A. MOLINA-CABELLO, 2021. Correcting data imbalance for semi-supervised COVID-19 detection using X-ray chest images Applied Soft Computing. 111, 107692ROSTAMI-SHAHRBABAKI,M., BOGENBERGER,K., SAFAVI, A.A. and MOEMENI, A., 2020. Intersection SPaT Estimation by means of Single-Source Connected Vehicle Data In: Transportation Research Board (TRB) Annual Meeting, Washington D.C., USA , January 2020.. BERMUDEZ, A., THANG, T., CALDERON-RAMIREZ, S., MOEMENI, A., YANG, S. and TORRENTS-BARRENA, J., 2020. A First Glance to the Quality Assessment of Dental Photostimulable Phosphor Plates with Deep Learning In: Proceedings of the 2020 IEEE International Joint Conference on Neural Networks, Glasgow, UK, July 2020.. CALDERON-RAMIREZ, S., LUIS OALA, TORRENTS-BARRENA, J., YANG, S., MOEMENI, A. and MOLINA-CABELLO,MIGUEL A., 2020. MixMOOD: A systematic approach to class distribution mismatch in semi-supervised learning using deep dataset dissimilarity measures Available at: <https://arxiv.org/abs/2006.07767> BERMUDEZ, ARIANA, CALDERON-RAMIREZ, SAUL, THANG, TREVOR, TYRRELL, PASCAL, MOEMENI, ARMAGHAN, YANG, SHENGXIANG and TORRENTS-BARRENA, JORDINA, 2020. A First Glance to the Quality Assessment of Dental Photostimulable Phosphor Plates with Deep Learning 2020 INTERNATIONAL JOINT CONFERENCE ON NEURAL NETWORKS (IJCNN). MOEMENI, A., GATWARD R., KANKEVICIENE L. and PYKO A., 2019. Revising ICT Programmes Through Learning Outcome Alignment: A Practical Exercise in Belarusian Universities. In: CARTER J. and ROSEN C., eds., Transnational Higher Education in Computing Courses Springer, Cham. 61-69HAFEZI, Z., SAFAVI, A.A. and MOEMENI, A., 2019. Enhancing the Traffic Delay Model (TDM) in Signalised Intersections using GPS Data In: Iranian Conference on Electrical Engineering (ICEE 2019). MALEKMOHAMADI,H., MOEMENI, A., ORUN, A. and KUMAR PUROHIT,J., 2018. Low-Cost Automatic Ambient Assisted Living System In: IEEE Annual Conference on Pervasive Computing and Communications Workshops (PerCom). GATWARD R. and MOEMENI, A., 2018. An Outcome based approach to developing a Belarusian Qualification Framework In: Role of Higher Education Institutions in Society: Challenges, Tendancies and Perspectives, Alytus College, Lithuania. MALEKMOHAMADI, HOSSEIN, MOEMENI, ARMAGHAN, ORUN, AHMET and PUROHIT, JAYENDRA KUMAR, 2018. Low-Cost Automatic Ambient Assisted Living System 2018 IEEE INTERNATIONAL CONFERENCE ON PERVASIVE COMPUTING AND COMMUNICATIONS WORKSHOPS (PERCOM WORKSHOPS). ORUN, A.B., SEKER, H., ROSE, J., MOEMENI, A. and FIDAN,M., 2016. A Quantisation of Cognitive Learning Process by Computer Graphics-Games: Towards More Efficient Learning Models Open Access Library Journal, Psychology. 3(e2329), 1-12MOEMENI, A. and TATHAM, E., 2014. Inertial-visual Pose Tracking using Optical Flow-aided Particle Filtering In: IEEE Symposium on Computational Intelligence for Multimedia, Signal and Vision Processing (CIMSIVP), Orlando, FL, December 2014. 1-8MOEMENI, ARMAGHAN and TATHAM, ERIC, 2014. Inertial-Visual Pose Tracking Using Optical Flow-aided Particle Filtering 2014 IEEE SYMPOSIUM ON COMPUTATIONAL INTELLIGENCE FOR MULTIMEDIA, SIGNAL AND VISION PROCESSING (CIMSIVP)",
  "content_length": 10850,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:01"
}