{
  "name": "Armin Kashefi",
  "homepage": "https://www.brunel.ac.uk/people/armin-kashefi",
  "status": "success",
  "content": "Dr Armin Kashefi | Introduction | Brunel University London Skip to Content Home People Dr Armin Kashefi Dr Armin KashefiLecturer (Education) in Computer Science Wilfred Brown Building 111 Email: armin.kashefi@brunel.ac.uk Tel: +44 (0)1895 268180 Computer Science College of Engineering, Design and Physical Sciences Summary Dr. Armin Kashefi is a Lecturer in the Department of Computer Science at Brunel University London. He holds an MSc and PhD in Information Systems Management and is a Fellow of the Higher Education Academy (FHEA). His research interests encompass modelling and simulation, strategic management of information systems, and digital innovation and transformation. His postdoctoral experience includes involvement in the Tools for Economic Evaluation around Point-of-Care Testing (TEA-PoCT) project, funded by Innovate UK, as well as contributing to two Horizon 2020 EU projects—TANDEM and Sci-GaIA—which aimed to foster dialogue between the EU and African Research and Education Networks, particularly in Western and Central Africa. Currently, Dr. Kashefi leads the second-year CS2006 Business Analysis and Process Modelling module, a core component of the Business Computing degree. In addition, he tutors second-year undergraduates and supervises final-year projects and MSc dissertations in Computer Science. His ongoing research continues to explore themes emerging from Simulation-based research in Information Systems, alongside hybrid simulation and modelling. Qualifications PhD in Management Information Systems MSc in Management Information Systems BSc in Software Engineering Fellow member of the Higher Education Academy (FHEA) Postgraduate Certificate in Academic Practice (PGCAP) Responsibility Departmental Athena SWAN team - Communication Team Made in Brunel Software Innovation - Student Engagement and Logistics Member of the Senior Tutor team Newest selected publications Kashefi, A. and Alwzinani, F. (2025) 'A Multiscale Modeling Framework for Organizational Resilience: Integrating Agent-Based, Discrete Event, and System Dynamics Approaches'.25th International Conference on Computational Science: Workshops on Computational Science (WCS). Singapore. 5 - 9 July. Springer Nature Switzerland. pp. 48 - 56. ISSN: 0302-9743 Conference paper Kashefi, A., Alwzinani, F. and Malek, N. (2025) 'ENHANCING OPERATIONAL EFFICIENCY IN MUMBAI’S AIRPORT DEPARTURE TERMINAL: A HYBRID SIMULATION MODELING APPROACH'.Winter Simulation Conference 2025. Seattle, WA, USA.Open Access Link Conference paper Kashefi, A. and Alwzinani, F. (2024) 'Advancing Organizational Performance: A Strategic Framework to Multiscale Modeling and Simulation'.International Conference on Computational Science. Malaga, Spain. 28 - 4 July. Springer Nature Switzerland. pp. 429 - 436. ISSN: 0302-9743 Open Access Link Conference paper Gambo, N., Perry, M., Kashefi, A. and Ayoung, DA. (2020) 'Harnessing social and collaborative tools in digital disaster response work: Implications for design and practice'. Information Development, 37 (3). pp. 1 - 14. ISSN: 0266-6669 Open Access Link Journal article Abdulhamid, NG., Ayoung, DA. and Kashefi, A. (2020) 'A survey of social media use in emergency situations: A literature review'. Information Development, 37 (2). pp. 1 - 31. ISSN: 0266-6669 Open Access Link Journal article More publications(18)",
  "content_length": 3350,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:03"
}