{
  "name": "Armon Barton",
  "homepage": "https://armonbarton.com",
  "status": "success",
  "content": "Armon Barton, PhD Assistant Professor Computer Science Department Naval Postgraduate School Education: PhD in Computer Science | University of Texas at Arlington | 2018 Research Interests: Secure Machine Learning, Computer Vision, Anonymity, Security and Privacy SHORT BIO I am an Assistant Professor in the Department of Computer Science at Naval Postgraduate School (NPS). Before joining this amazing department, I spent one year working as a Data Scientist at Lockheed Martin Space in Boulder, CO. Prior to that, I earned my PhD at The University of Texas at Arlington. Before attending graduate school, I worked in the oil and gas industry where I performed marine seismic surveys in several locations around the world. I earned a Bachelor of Science in Mechanical Engineering at Texas Tech University. RESEARCH PUBLICATIONS Armon Barton, Mohsen Imani, Jiang Ming, and Matthew Wright. Towards Predicting Efficient and Anonymous Tor Circuits. In Proceedings of the 27th USENIX Security Symposium (USENIX Security'18), Baltimore, MD, USA, August 15-17, 2018. (Acceptance ratio: 19.1%) Mohsen Imani, Armon Barton and Matthew Wright. Guard Sets in Tor using AS Relationships. In Proceedings of the 18th Privacy Enhancing Technologies Symposium (PETS’18), Barcelona, Spain, July 24-27, 2018. (Acceptance ratio: 17.3%) Armon Barton, Mohsen Imani, and Matthew Wright. DeNASA: Destination-Naive AS-Awareness in Anonymous Communications. In Proceedings of the 16th Privacy Enhancing Technologies Symposium (PETS’16), Darmstadt, Germany, July 19-22, 2016. (Acceptance ratio: 23.8%) INVITED TALKS Armon Barton. Towards Defending Deep Neural Networks Against Adversarial Examples, and Predicting Efficient and Anonymous Tor Circuits.  Naval Postgraduate School, Monterey, CA, USA, March 4, 2019. Armon Barton, Mohsen Imani, Jiang Ming, and Matthew Wright. Towards Predicting Efficient and Anonymous Tor Circuits. In Proceedings of the 27th USENIX Security Symposium (USENIX Security'18), Baltimore, MD, USA, August 15-17, 2018. Armon Barton, Mohsen Imani, Jiang Ming, and Matthew Wright. Poster: PredicTor: Predicting Fast Circuits For A Faster User Experience in Tor.  In the 38th IEEE Symposium on Security and Privacy (S&P’17) Poster Session.  San Jose, CA, USA, May 22-24 2017. Armon Barton, Mohsen Imani, and Matthew Wright. DeNASA: Destination-Naive AS-Awareness in Anonymous Communications. In Proceedings of the 16th Privacy Enhancing Technologies Symposium (PETS’16), Darmstadt, Germany, July 19-22, 2016. HONORS AND AWARDS STEM Doctoral Fellowship    Spring 2014 - Fall 2018 Privacy Enhancing Technologies Symposium (PETS’16) Stipend       June 2016 Privacy Enhancing Technologies Symposium (PETS’15) Stipend       June 2015 PROFESSIONAL SERVICES IEEE Transactions on Network Science and Engineering 2019 | External Reviewer    Fall 2018 Privacy Enhancing Technologies Symposium 2019 (PETS’19) | External Reviewer    Fall 2018 Privacy Enhancing Technologies Symposium 2017 (PETS’17) | External Reviewer    Spring 2017 Privacy Enhancing Technologies Symposium 2015 (PETS’15) | External Reviewer    Spring 2015 TEACHING CS3315 Introduction to Machine Learning and Big Data, Section 1, Fall 2020 CS3315 Introduction to Machine Learning and Big Data, Section 2, Fall 2020 © 2022 Armon Barton",
  "content_length": 3289,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:04"
}