{
  "name": "Arnab Kumar Biswas",
  "homepage": "https://pure.qub.ac.uk/en/persons/arnab-kumar-biswas",
  "status": "success",
  "content": "Arnab Kumar Biswas - Queen's University Belfast View Scopus Profile Arnab Kumar Biswas Dr Lecturer, School of Electronics, Electrical Engineering and Computer Science https://orcid.org/0000-0002-3057-2478 Phone+44 (0)28 9097 1764Emaila.biswasqub.acuk Accepting PhD StudentsPhD projectsCurrently I have the following 2 open positions. Apply using the given links. 1.Quantum-Safe and Privacy-Preserving Federated Learning for Remote Healthcare IoT (https://www.qub.ac.uk/courses/postgraduate-research/phd-opportunities/quantumsafe-and-privacypreserving-federated-learning-for-remote-healthcare-iot.html) 2.Federated Trust and Privacy Optimization for Decentralized IoT Networks (https://www.qub.ac.uk/courses/postgraduate-research/phd-opportunities/federated-trust-and-privacy-optimization-for-decentralized-iot-networks.html) 20132026 Research activity per year Personal profile Research InterestsHardware-software co-design to secure systems, Network security, Security issues in Remote healthcare and Satellite communication, Accelerator for Quantum and Post-quantum cryptographyResearch StatementI am a member of the the Centre for Secure Information Technologies (CSIT) which holds the prestigious academic center of excellence for cyber security research (ACE-CSR) from NCSC, UK. My research work covers the security of embedded systems which involves software security, network security, and hardware security. The aim is to develop new security solutions for specific areas like remote health and Sattelite communication and implement that efficiently in hardware and/or software. I am open to new resarch ideas which involves security based resarch work.Achievements-> I have received funding from Impact accelearation account (IAA) to purchase equipements necessary for research on Space 2.0. The instrument is already in our lab and ready to be used. It is a high end equipment from Alpha-data https://www.alpha-data.com/product/adk-va600/. -> I have also received a CHERI enabled prototype from ARM called Morello board. This is a new secure system which is going to be used for further development of secure by design concept. The documentation is available at https://developer.arm.com/documentation/den0132/0200/Overview. -> I have also received an equipment donation from Intel which will be used for development of secure systems. The details are available at https://www.intel.com/content/www/us/en/partner/showcase/offering/a5b3b000000TcqfAAC/de10pro-stratix-10-gxsx-accelerator.html. -> I have also received 12 PYNQ Z2 boards from AMD for small projects and practical teaching. KeywordsQA75 Electronic computers. Computer science Fingerprint Dive into the research topics where Arnab Kumar Biswas is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Networks on Chips Computer Science 100% Routers Computer Science 81% Attack Computer Science 80% Intellectual Property Computer Science 56% Channels Computer Science 45% Protection Computer Science 44% multiprocessor system on chip Computer Science 39% Programs Computer Science 37% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2013 2016 2018 2019 2020 2021 2022 2025 2026 15 Article 6 Conference contribution 1 Chapter 1 Review article Research output per year Research output per year An expert hybrid federated learning and trust management for security, efficiency, and power optimization in smart health systemsKhan, S., Imtiaz, N., Biswas, A. K., Siddique, Z. B. & Khan, Q. A., 31 Mar 2025, In: IEEE Access. 13, p. 58191 - 58210 10 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Power Optimization 100% Security and Privacy 100% Trust Management 100% Federated machine learning 100% Support Vector Machine 33% 8 Downloads (Pure) Constant-time modulo: a secure hardware design against timing attacksBiswas, A. K., 17 Nov 2025, 38th International System-on-Chip Conference (SOCC): Proceedings. IEEE, 6 p. (IEEE International System-on-Chip Conference (SOCC): Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open Access Hardware Design 100% Computer Hardware 100% Side Channel Attack 100% Execution Time 33% Cybersecurity 33% Hybrid CNN–GRU–XGBoost framework for optimized coronary artery disease diagnosis and risk stratificationAdnan, M., Yang, Y., Biswas, A. K. & Khan, S., Feb 2026, In: Computational Biology and Chemistry. 120, Part 2, 20 p., 108725.Research output: Contribution to journal › Article › peer-review Open AccessFile Feature Interaction 100% Diagnostic System 100% de-noising 100% Gated Recurrent Unit 100% Source Distribution 100% 1 Downloads (Pure) Privacy-preserving lightweight LoRaWAN authentication protocol for IoT applicationsAkram, M. A., Mian, A. N., Biswas, A. K., Kumari, S. & Chen, C.-M., 15 Oct 2025, In: IEEE Internet of Things Journal. 12, 20, p. 42790 - 42802Research output: Contribution to journal › Article › peer-review Security Feature 100% On the design of a searchable encryption protocol for keyword search using proactive secret sharingK, P., K S, G. A., Ghosh Ray, I., Adhikari, A., Datta, S. & Biswas, A. K., 22 Sept 2024, 2024 IEEE 20th International Conference on e-Science (e-Science): Proceedings. IEEE Xplore, (IEEE International Conference on e-Science (e-Science): Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Keyword Search 100% Secret Sharing 100% Regular Interval 50% Security Parameter 25% Cryptographic Primitive 25% 1 Citation (Scopus) 84 Downloads (Pure) View all 23 research outputs Prizes Best presentation award in EECS Research students symposiumBiswas, A. K. (Recipient), 05 Jul 2016Prize: Prize (including medals and awards) Complimentary ACM professional membershipBiswas, A. K. (Recipient), 12 Jul 2020Prize: Prize (including medals and awards) Fredrik and Catherine Eaton FellowshipBiswas, A. K. (Recipient), 08 Apr 2024Prize: Fellowship awarded competitively Morello BoardBiswas, A. K. (Recipient), 06 Jun 2023Prize: Prize (including medals and awards) Software Development 100% Development Platform 100% ARM Processors 100% Richard Newton Young Fellow awardBiswas, A. K. (Recipient), 05 Jun 2014Prize: Prize (including medals and awards) View all 6 prizes Activities Activities per year 2022 2022 2024 2025 12 Other examination 4 Visiting an external academic institution 2 Participation in workshop, seminar, course 2 Oral presentation 4 More 1 Participation in conference 1 Editorial activity 1 Publication peer-review 1 Membership of network Activities per year SPRITE+, a EPSRC-funded Digital Economy NetworkPlus (External organisation)Biswas, A. K. (Advisor)17 Jun 2025Activity: Membership types › Membership of network 2025 IEEE International Symposium on Circuits and Systems (Event)Biswas, A. K. (Peer reviewer)29 Nov 2024Activity: Publication peer-review and editorial work types › Publication peer-review ELE8093: Network Security and MonitoringBiswas, A. K. (Examiner)14 Nov 2024 → 29 Nov 2024Activity: Examination types › Other examination ELE8093: Network Security and MonitoringBiswas, A. K. (Examiner)14 Nov 2024 → 29 Nov 2024Activity: Examination types › Other examination Workshop on Generative AI and FAIR Principles in Science Communication (AI4SC-2024) (Event)Biswas, A. K. (Peer reviewer)16 Sept 2024 → 20 Sept 2024Activity: Publication peer-review and editorial work types › Editorial activity View all 24 activities",
  "content_length": 7898,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:07"
}