{
  "name": "Arnab Nandi 0001",
  "homepage": "http://arnab.org",
  "status": "success",
  "content": "Arnab Nandi Arnab Nandi Professor, Computer Science & Engineering, The Ohio State University Email: firstname at this domain Publications | Slides | LinkedIn How do we help humans work with data better, faster, and more effectively? Arnab's work focuses on bridging human interaction and database systems. He has been recognized by the Association for Computing Machinery as an ACM Distinguished Member for his \"contributions to human-in-the-loop data infrastructure, next-generation query interfaces, and interactive data analytics systems\". Arnab is a recipient of the US National Science Foundation's CAREER Award, a Google Faculty Research Award, and IEEE's TCDE Early Career Award for his contributions towards user-focused data interaction. Closer to home, Arnab has received the University's Alumni Award for Distinguished Teaching, and the Early Career Innovator of the Year Award. At Ohio State, he co-founded the OHI/O Program, that fosters a tech culture through hackathons and informal learning, and The STEAM Factory, an interdisciplinary research and collaboration network. Arnab was founder and CEO of Mobikit, a connected vehicles data analytics startup that was acquired by Azuga Inc., a Bridgestone company. Arnab holds a PhD in Computer Science & Engineering from the University of Michigan. Active Projects: Vibe Querying: Keynote at HILDA 2025 Omni: Multimodal Data Exploration DBTutor: Integrating LLMs into Database Systems Education Teaching: CSE 5251: Introduction to Software Startups (Pre-registration for Sp2026) CSE 3241: Introduction to Database Systems CSE 5242: Advanced Database Systems Selected Service: Steering Committee Member, HILDA 2024– Workshops co-chair, SIGMOD 2025–26 Demonstrations co-chair, SIGMOD 2024 Area Chair, ICDE 2024 Associate Editor, VLDB 2019 Program Committee, SIGMOD, VLDB, ICDE: Multiple Years Selected Projects: DREAM: Data Exploration in Augmented and Mixed Reality CropFusion: Multimodal Data Fusion for Precision Agriculture GestureDB: Querying Beyond Keyboards DICE: Distributed Interactive Cube Exploration Icarus: Amplifying Domain Expertise in Clinical Data Pipelines Perceptvis: Perceptually-aware Interactive Visualization Systems Crossroads: Interactive Vehicle Fleet Data Analysis Invisible Library: Interactive Analytics meets Public Art Prompt: Query Autocompletion for Structured Search in Databases OHI/O: Hackathon and Informal Learning Program STEAM Factory: Facilitating interdisciplinary collaboration Students & Alumni: Dominik Winecki, PhD Student Luke Waltz, PhD Student (w/ Sami Khanal) Ritesh Sarkhel, PhD, Applied Scientist, Amazon AI Protiva Rahman, PhD, Research Assistant Professor, University of Florida Behrooz Omidvar Tehrani, PostDoc, Principal Scientist, Microsoft Meraj Ahmed Khan, PhD, Senior Scientist, P&G Data Science & AI Research Lilong Jiang, PhD, Principal Machine Learning Engineer, Roblox Niranjan Kamat, PhD, Software Engineer, AWS Redshift Codi Burley, MS, Software Engineer, Optiwatt Karthik Tunga, MS, Software Engineer, Meta Prasanth Jayachandran, MS, Software Engineer, Apple Dalton Flanagan, BS, Member of Technical Staff, Anthropic Trey Hakanson, BS, Senior Software Engineer, Skydio",
  "content_length": 3195,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:05"
}