{
  "name": "Arnaud Lefray",
  "homepage": "http://ens-lyon.academia.edu/ArnaudLeveau",
  "status": "success",
  "content": "Arnaud Leveau - Université Paris Dauphine - PSL Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Arnaud LeveauUniversité Paris Dauphine - PSL, Master Affaires Internationales Et Développement Parcours économie, Faculty MemberÉcole Normale Supérieure de Lyon, Humanities, Department MemberKyoto University, Center for Southeast Asian Studies, Post-DocInstitute for East Asian Studies, Sogang University, Institute for East Asian Studies, Post-DocChulalongkorn University, Political Science, Faculty MemberaddFollowdoneFollowingFollowers630Following142Public ViewsRelated Authors John P DiMoiaSeoul National University Andreas UmlandNational University of \"Kyiv-Mohyla Academy\" Timur DadabaevUniversity of Tsukuba David SeamonKansas State University Barbara VossStanford University Armando Marques-GuedesUNL - New University of Lisbon Giulia SissaUcla Enrico CirelliUniversità di Bologna Jack SidnellUniversity of Toronto Roland B Wilson, PhDGeorge Mason UniversityInterestsView All (23) CVUploadsall181 Papers13 Talks1 Conference PresentationsPapers by Arnaud LeveauIndonesia Economic Militarization and Strategic TensionsAsie21, 2025Since President Prabowo Subianto took office in October 2024, Indonesia has embarked on a rapid t... more Since President Prabowo Subianto took office in October 2024, Indonesia has embarked on a rapid transformation of its state apparatus and economic strategy. Amid budgetary fragility, depreciation of the national currency, and questions over political stability, the country is pursuing a deliberate interventionist approach—combining public spending-driven stimulus, power centralization, and an expanded role for the military in civilian affairs. At the same time, Indonesia is seeking to redefine its place in the global order through accession to the BRICS, closer ties with the OECD, and by asserting itself as a pivotal power in the Indo-Pacific. This dual dynamic—domestic and international—is shaping a high-stakes vision of Indonesian power.Download Kazakhstan – Mongolia: Alternatives to Chinese Rare Earths?Asie21, 2025As China seeks to tighten its control over rare earth exports amid growing trade tensions with th... more As China seeks to tighten its control over rare earth exports amid growing trade tensions with the United States, Kazakhstan and Mongolia are emerging as strategic players in the critical resources arena. Promising deposit discoveries, diplomatic rapprochements, and infrastructure projects are positioning the two Central Asian countries as credible alternatives to Chinese dominance.Download Mongolia - South Korea - Japan : Towards a three-way partnership?Mongolia’s Foreign Minister, Battsetseg Batmunkh, during her visit to Japan, reaffirmed the impor... more Mongolia’s Foreign Minister, Battsetseg Batmunkh, during her visit to Japan, reaffirmed the importance of the bilateral partnership between the two countries and the ties Mongolia has developed with other liberal democracies.Download Japan-Australia-France :ustralia might reconsider its options for its submarines. Japan waiting in the wings.Asie21, 2025Australia is beginning to doubt the feasibility of the AUKUS nuclear submarine program. Faced wit... more Australia is beginning to doubt the feasibility of the AUKUS nuclear submarine program. Faced with growing uncertainties over costs, delays, and technological constraints—especially potential U.S. policy reversals—the country may be forced to consider an alternative solution. While France could (re)emerge as an obvious partner, it is not the only one. Japan is already making moves.Download Corée du Sud / Philippines : un partenariat stratégique aux implications régionalesAsie21, 2025La Corée du Sud s’affirme comme un acteur majeur de la coopération en matière de défense en Asie ... more La Corée du Sud s’affirme comme un acteur majeur de la coopération en matière de défense enAsie du Sud-Est. Son partenariat avec les Philippines se renforce à travers des ventes d’équipements militaires, des accords de coopération et un alignement stratégique face auxtensions régionales. En janvier 2025, le ministère philippin de la Défense nationale a révélé sonintention d’acquérir 12 FA-50 pour environ 683 millions de dollars. Si elle se confirme, cette acquisition doublerait la flotte actuelle de FA-50 des Philippines, portant le total à 24 appareils. Cependant, la crise politique en Corée du Sud pourrait fragiliser ces relations, tandis que a l’essor de l’industrie de défense sud-coréenne concurrence directement les entreprises européennes qui cherchent également à se positionner dans le pays.Download Japon – Indonésie Développement conjoint d’un navire de guerre asie21Asie21, 2025Alors que le Premier ministre japonais Ishiba Shigeru n’est pas encore parvenu, malgré de nombreu... more Alors que le Premier ministre japonais Ishiba Shigeru n’est pas encore parvenu, malgré de nombreux efforts, à prendre attache avec le nouveau président américain Donald Trump, c’est en Asie qu’il essaie d’engranger des points et de restaurer une image écornée après son échec aux élections législatives d’octobre 2024. Si un déplacement en Chine au cours de l’année 2025 est fort probable, c’est d’abord en Asie du Sud-Est1 qu’il concentre son attention. Il s’est ainsi rendu en Malaisie (qui exerce la présidence tournante de l’ASEAN) et en Indonésie en janvier 2025 pour une mission principalement axée sur les questions de coopération en matière de sécurité, y compris énergétique, et de défense. En Indonésie, il a confirmé le développement conjoint d’un futur navire de guerre nippo-indonésien, rappelant la volonté croissante du japon de devenir, à terme, un acteur majeur du marché de l’armement mondial2Download CORÉE DU SUD UNE PUISSANCE AUX MULTIPLES VISAGESAsia Magazine, 2024Moteur économique, démocratique et culturel, la Corée du Sud occupe aujourd’hui une place de prem... more Moteur économique, démocratique et culturel, la Corée du Sud occupe aujourd’hui une place de premier plan sur la scène internationale. Puissance moyenne aux ambitions mondiales, son d􏰀namisme se re􏰁􏰂te dans ses a􏰃anc􏰄es technolo􏰅iques et la r􏰄silience de ses institutions 􏰆ace aux crises et aux tensions 􏰅􏰄opolitiques􏰇Download Mongolie-Kazakhstan : un partenariat stratégique pour quoi faire ?Asie21, 2024Quelques jours avant d’effectuer une visite d’État en France, le président du Kazakhstan Kassym-J... more Quelques jours avant d’effectuer une visite d’État en France, le président du Kazakhstan Kassym-Jotmat Tokaïev s’est rendu en Mongolie pour une autre visite d’État marquée par la création d’un conseil d’affaires Kazakhstan-Mongolie, afin de renforcer les liens commerciaux et économiques entre les deux pays mais aussi élever leurs relations à un niveau de partenariat stratégique. À la différence de son prédécesseur, le président Tokaïev souhaite placer la relation avec la Mongolie sur la liste des priorités de la politique étrangère du Kazakhstan. Si les deux pays ont tout intérêt à renforcer leur partenariat pour tenter de sortir de l’ornière russo-chinoise, ils pourraient également se trouver rapidement en concurrence sur le marché mondial des métaux précieux. Une meilleure coordination entre eux pourrait leur éviter de se trouver à la merci des grandes puissances qui cherchent à contrôler leur approvisionnement en matériaux essentiels.Download Vietnam : l'art subtil de l'équilibreAsie21Peu de temps après avoir reçu le président russe Vladimir Poutine au Vietnam en juin 2024, To Lam... more Peu de temps après avoir reçu le président russe Vladimir Poutine au Vietnam en juin 2024, To Lam, le nouveau président du Vietnam, nommé ensuite secrétaire général du Parti communiste au pouvoir, s’est rendu en Chine pour sa première visite officielle. Quatorze accords de coopération ont été signés en matière de santé, de développement des infrastructures et d’échanges bancaires. Pour rassurer ceux qui s’inquiètent d’un éventuel changement d’orientation de la politique étrangère vietnamienne, To Lam s’est rendu aux États-Unis en septembre pour participer à l’Assemblée générale des Nations unies. Il a prolongé son séjour américain pour rencontrer le président Joe Biden et assister à la signature de plusieurs contrats dans les domaines de l’aéronautique, de l’énergie et des technologies. Si l’équilibre semble maintenu, les principaux partenaires des États-Unis (Australie, Nouvelle- Zélande, Singapour et dans une moindre mesure le Japon et la Corée du Sud) semblent avoir été oubliés dans les premiers pas à l’international du nouvel exécutif vietnamien.Download Cambodge à la recherche d'un nouvel équilibreAsie21, 2024Lettre confidentielle Asie21-Futuribles n° 186/2024-09 © copyright reproduction interdite /77 43 ... more Lettre confidentielle Asie21-Futuribles n° 186/2024-09 © copyright reproduction interdite /77 43 Cambodge À la recherche d'un nouvel équilibre Les travaux pour la construction du canal Funan-Techo ont commencé au Cambodge le 5 août 2024 1 . Le canal doit relier le port automne de Phnom Penh à la province de Kep. Les travaux estimés à 1.7 milliards de dollars devraient durer quatre ans. Le projet divisé en deux phases (21 km et 159 km) a fait l'objet d'un accord cadre de partenariat entre la Cambodge et la China Bridge and Road Corporation (CRBC).Download Mongolie – Chine – Russie : de l’eau dans le gazAsie21, 2024Le gouvernement mongol a décidé de ne pas inclure le projet de construction du gazoduc Power of S... more Le gouvernement mongol a décidé de ne pas inclure le projet de construction du gazoduc Power of Siberia-2 dans son plan de dépenses pour les quatre prochaines années. Concrètement, cela repousse d’autant le début des travaux. Power of Siberia-2 est un projet commun entre la China",
  "content_length": 18376,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:09"
}