{
  "name": "Arnd Hartmanns",
  "homepage": "https://arnd.hartmanns.name",
  "status": "success",
  "content": "Arnd Hartmanns Arnd Hartmanns I am an associate professor in the Formal Methods and Tools group at the University of Twente. My primary research interests are modelling tools and formalisms for stochastic timed and hybrid systems (in particular Modest) and their applications in various fields. I advocate reproducibility in Computer Science research, via artifact evaluation initiatives, tool competitions, and standardised benchmark sets. I was previously a postdoc in the Formal Methods and Tools group at the University of Twente and the Dependable Systems and Software group at Saarland University, where I also completed my Ph.D. in computer science with a thesis On the Analysis of Stochastic Timed Systems in 2015. Contact University of Twente Room: Zilverling 3061 E-Mail: Projects Trustworthy Analysis of Stochastic Timed Systems (TruSTy) (NWO VIDI project, 2024-2029) Software Reliability for Critical Infrastructures: Co-Development, Implementation and Wider Application of Solutions in Pilot Infrastructures such as Storm Surge Barriers (STORM_SAFE) (Interreg North Sea project, 2024-2027) Models in Space Systems: Integration, Operation, and Networking (MISSION) (coordinator, MSCA RISE project, 2021-2026) Verified Probabilistic Verification (NWO Open Competition project, 2021-2025) Verification of Cyber-Physical Systems: Exploiting Uncertainty for Scalability (NWO VENI personal grant, 2018-2023) Committees TACAS 2026 program committee member QEST-FORMATS 2025 program committee member FM 2024 artifact evaluation committee chair RRRR 2024 workshop organiser and program chair FORMATS 2023 artifact evaluation committee chair RRRR 2023 workshop organiser and program chair QEST 2022 artifact evaluation committee chair FormaliSE 2022 program committee chair RRRR 2022 workshop organiser and program chair QEST 2021 artifact evaluation committee chair TACAS 2020 artifact evaluation committee chair TACAS 2018 artifact evaluation committee chair I was previously a member of the program committees for ICSOB 2024, MARS 2024, and QEST-FORMATS 2024 2024; for FormaliSE, QEST, and SPIN, 2023; for FORMATS and FORTE 2022; for FORMATS, SNR, and SPIN 2021; for FORMATS, QEST, and SBMF 2020; for QEST and SETTA 2019; for FORTE 2018; and for ACSD 2017. Publications [DBLP] [Google Scholar] 2026 Probabilistic Verification for Modular Network-on-Chip Systems with Nick Waddoups, Jonah Boe, Prabal Basu, Sanghamitra Roy, Koushik Chakraborty, and Zhen Zhang: VMCAI 2026, Rennes, France (January 2026, to appear) 2025 DTMC Model Checking by Path Abstraction Revisited with Robert Modderman: RP 2025, Madrid, Spain (October 2025, to appear) [arXiv] An Overview of Sound and Modest Approaches to Quantitative Model Checking from Sea to Space FMICS 2025, Aarhus, Denmark (August 2025) [DOI] PyDSMC: Statistical Model Checking for Neural Agents Using the Gymnasium Interface with Timo P. Gros, Ivo Hoese, Joshua Meyer, Nicola J. Müller, and Verena Wolf: QEST+FORMATS 2025, Aarhus, Denmark (August 2025) [DOI] Statistical Model Checking Beyond Means: Quantiles, CVaR, and the DKW Inequality with Carlos E. Budde, Tobias Meggendorfer, Maximilian Weininger, and Patrick Wienhöft: QEST+FORMATS 2025, Aarhus, Denmark (August 2025) [DOI] Time-Sensitive Importance Splitting with Gabriel Dengler, Carlos E. Budde, and Laura Carnevali: QEST+FORMATS 2025, Aarhus, Denmark (August 2025) [DOI] A Formally Verified IEEE 754 Floating-Point Implementation of Interval Iteration for MDPs with Bram Kohlen, Maximilian Schäffeler, Mohammad Abdulaziz, and Peter Lammich: CAV 2025, Zagreb, Croatia (July 2025) [DOI] Rare Event Simulation for Stochastic Hybrid Systems using Symbolic Importance Functions with Mathis Niehage, Carina da Silva, and Anne Remke: NASA Formal Methods 2025, Williamsburg, VA, USA (June 2025) [DOI] Sound Statistical Model Checking for Probabilities and Expected Rewards with Carlos E. Budde, Tobias Meggendorfer, Maximilian Weininger, and Patrick Wienhöft: TACAS 2025, Hamilton, Canada (May 2025) [DOI] [arXiv] Comparing Statistical, Analytical, and Learning-Based Routing Approaches for Delay-Tolerant Networks with Pedro R. D'Argenio, Juan A. Fraire, and Fernando Raverta: ACM Transactions on Modeling and Computer Simulation (April 2025) [DOI] 2024 Modest Models and Tools for Real Stochastic Timed Systems with Carlos E. Budde, Pedro R. D'Argenio, Juan A. Fraire, and Zhen Zhang: Principles of Verification, Aachen, Germany (November 2024) [DOI] Digging for Decision Trees: A Case Study in Strategy Sampling and Learning with Carlos E. Budde and Pedro R. D'Argenio: AISoLA 2024, Crete, Greece (November 2024) [DOI] Efficient Formally Verified Maximal End Component Decomposition for MDPs with Bram Kohlen and Peter Lammich: FM 2024, Milan, Italy (September 2024) [DOI] 2023 Fast Verified SCCs for Probabilistic Model Checking with Bram Kohlen and Peter Lammich: ATVA 2023, Singapore (October 2023) [DOI] A Practitioner's Guide to MDP Model Checking with Sebastian Junges, Tim Quatmann, and Maximilian Weininger: TACAS 2023, Paris, France (April 2023) [DOI] Tools at the Frontiers of Quantitative Verification (QComp 2023 Competition Report) with Roman Andriushchenko, Alexander Bork, Carlos E. Budde, Milan Češka, Ernst Moritz Hahn, Bryant Israelsen, Nils Jansen, Joshua Jeppson, Sebastian Junges, Maximilian A. Köhl, Bettina Könighofer, Jan Křetínský, Tobias Meggendorfer, David Parker, Stefan Pranger, Tim Quatmann, Enno Ruijters, Landon Taylor, Matthias Volk, Maximilian Weininger, and Zhen Zhang: TOOLympics 2023, Paris, France (April 2023) [DOI] 2022 The Modest State of Learning, Sampling, and Verifying Strategies with Michaela Klauck, ISoLA 2022, Rhodes, Greece (October 2022) [DOI] Comparing Statistical and Analytical Routing Approaches for Delay-Tolerant Networks with Pedro R. D'Argenio, Juan A. Fraire, and Fernando Raverta: QEST 2022, Warsaw, Poland (September 2022) [DOI] Correct Probabilistic Model Checking with Floating-Point Arithmetic TACAS 2022, Munich, Germany (April 2022) [DOI] An Overview of Modest Models and Tools for Real Stochastic Timed Systems MARS 2022, Munich, Germany (April 2022) [DOI] 2021 Learning Optimal Decisions for Stochastic Hybrid Systems with Mathis Niehage and Anne Remke: MEMOCODE 2021, Beijing, China (November 2021) [DOI] Probabilistic Verification for Reliability of a Two-by-Two Network-on-Chip System with Riley Roberts, Benjamin Lewis, Prabal Basu, Sanghamitra Roy, Koushik Chakraborty, and Zhen Zhang: FMICS 2021, Paris, France (August 2021) [DOI] Tweaking the Odds in Probabilistic Timed Automata with Joost-Pieter Katoen, Bram Kohlen, and Jip Spel: QEST 2021, Paris, France (August 2021) [DOI] A Modest Approach to Markov Automata with Yuliya Butkova and Holger Hermanns: ACM Transactions on Modeling and Computer Simulation (July 2021) [DOI] Balancing Wind and Batteries: Towards Predictive Verification of Smart Grids with Thom S. Badings, Nils Jansen, and Marnix Suilen: NASA Formal Methods 2021, Norfolk, VA, USA (May 2021) [DOI] Replicating Restart with Prolonged Retrials: An Experimental Report with Carlos E. Budde: TACAS 2021, Luxembourg, Luxembourg (March 2021) [DOI] Symblicit Exploration and Elimination for Probabilistic Model Checking with Ernst Moritz Hahn: ACM SAC 2021, Gwangju, South Korea (March 2021) [DOI] 2020 An Efficient Statistical Model Checker for Nondeterminism and Rare Events with Carlos E. Budde, Pedro R. D'Argenio and Sean Sedwards: Software Tools for Technology Transfer (November 2020) [DOI] On Correctness, Precision, and Performance in Quantitative Verification (QComp 2020 Competition Report) with Carlos E. Budde, Michaela Klauck, Jan Křetínský, David Parker, Tim Quatmann, Andrea Turrini, and Zhen Zhang: ISoLA 2020, Rhodes, Greece (October 2020) [DOI] Multi-cost Bounded Tradeoff Analysis in MDP with Sebastian Junges, Joost-Pieter Katoen, and Tim Quatmann: Journal of Automated Reasoning (October 2020) [DOI] Optimistic Value Iteration with Benjamin Lucien Kaminski: CAV 2020, Los Angeles, CA, USA (July 2020) [DOI] Sampling Distributed Schedulers for Resilient Space Communication with Pedro R. D'Argenio and Juan A. Fraire: NASA Formal Methods 2020, Moffet Field, CA, USA (May 2020) [DOI] Classic and Non-Prophetic Model Checking for Hybrid Petri Nets with Stochastic Firings with Carina Pilch and Anne Remke: HSCC 2020, Sydney, Australia (April 2020) [DOI] 2019 A Modest Markov Automata Tutorial with Holger Hermanns: RW 2019, Bolzano, Italy (September 2019) [DOI] A Modest Approach to Modelling and Checking Markov Automata with Yuliya Butkova and Holger Hermanns: QEST 2019, Glasgow, United Kingdom (September 2019) [DOI] Model-Based Testing of Stochastically Timed Systems with Marcus Gerhold and Mariëlle Stoelinga: Innovations in Systems and Software Engineering (September 2019) [DOI] Probabilistic Verification for Reliable Network-on-Chip System Design with Prabal Basu, Koushik Chakraborty, Rajesh Jayashankara Shridevi, Benjamin Lewis, Sanghamitra Roy, and Zhen Zhang: FMICS 2019, Amsterdam, The Netherlands (August 2019) [DOI] Automated Compositional Importance Splitting with Carlos E. Budde and Pedro R. D'Argenio: Science of Computer Programming (April 2019) [PDF] [DOI] The Quantitative Verification Benchmark Set with Michaela Klauck, David Parker, Tim Quatmann, and Enno Ruijters: TACAS 2019, Prague, Czech Republic (April 2019) [DOI] The 2019 Comparison of Tools for the Analysis of Quantitative Formal Models with Ernst Moritz Hahn, Christian Hensel, Michaela Klauck, Joachim Klein, Jan Kretínský, David Parker, Tim Quatmann, Enno Ruijters, and Marcel Steinmetz: TACAS 2019, Prague, Czech Republic (April 2019) [DOI] 2018 Lightweight Statistical Model Checking in Nondeterministic Continuous Time with Pedro R. D'Argenio and Sean Sedwards: ISoLA 2018, Limassol, Cyprus (November 2018) [DOI] A Statistical Model Checker for Nondeterminism and Rare Events with Carlos E. Budde, Pedro R. D'Argenio, and Sean Sedwards: TACAS 2018, Thessaloniki, Greece (A",
  "content_length": 19863,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:08"
}