{
  "name": "Arnold W. M. Smeulders",
  "homepage": "https://staff.fnwi.uva.nl/a.w.m.smeulders",
  "status": "success",
  "content": "Arnold Smeulders Arnold Smeulders Publications Research What I do What I did Key of Life CV Contact Homepage of Arnold Smeulders Published September 14th, 2014 Let me introduce myself. The driving factor has always been research up to the current day. I say a few words about it below. Vision has always interested me. How is it possible to communicate in words about the content of an image? How is it possible to mutually decide what the topic of an image is, when there is so much to see? How can the words be learned to attach to the contents of an image? When the pictorial content of an image is varying so widely from scene to scene and from instance to instance, how can we recognize an object in an instance? Why is the one image considered to be more beautiful than the other? How can we memorize pictures to the thousands when so many bits are needed to capture them? How can pictures express non-visual notions as happiness, democracy and tension? So I am happy to be a scientist in computer vision. Professor is the best job in the world. First I spend a substantial part of my career in the medical field of various universities in the Netherlands but later moved to the computer science institute at the University of Amsterdam. Currently, we make image search engines. Not by tracing what others think about the image - as Google does very efficiently - but rather looking at the content of images. And the computer vision community has recently learned how to successfully find cars, planes and boats in an image. This may seem a trivial accomplishment but remember babies spend their whole first year acquiring just this ability (and not much more). In reality it takes half of the brain to process incoming images so trivial it likely is not. With these search engines we perform very well in the competitions for scientists posing harder and harder visual search tasks every year. Computer vision works much differently than the human explanation of an object they have seen. Then, they typically describe semantically important components or functions of the object. But important components - such as the eyes in a face - may be only a small part of the image. Or they may be difficult to discriminate against other objects - there are many door-like things in the world yet they are always used to describe a house. And, the function - a chair is something to sit on - is not visual after all. It took a long time to find out that vision should work by properties common to the type of objects: boats are best described as a hole in the water because water shares many visual characteristics and there are only a few other things which create a hole in the water. When looking for a table knife, search for a table fork as it has a very distinct shape common to all forks, then search with great likelihood for the knife next to it. I suspect human vision works similarly, surely before we start to talk about it. When we have recognized the object, we construe intellectual decompositions by function and components. The other thing is policy for the purpose of letting things blossom. In the board of COMMIT/ , I am chairman since 2011, the nation-wide, public-private ICT-Science project with 70 (non)profit partners. The budget for its 6 year lifetime is 110 Million Euro, 50 of which are from the government, 30 from the universities and 30 from industry. The ICT Platform Netherlands (IPN) advises the Netherlands organization for scientific research NWO on the policy of ICT - science. The members of the IPN are representing important research or educational institutes or groups of institutes in the Netherlands in the full breadth of ICT. The mission of IPN is to reinforce the ICT - science in the Netherlands. ICT is important in economy, in social life and in science. And it is important by itself as it formalises all knowledge and information. Similar to electricity, raid roads, machines and DNA, ICT is a powerful driver of innovation all over science and society. I have chaired IPN from 2007 to 2014. The Topsector ICT is part of the national policy for the innovation of industry. For the aim to renovate the industry and society at large, the Topsector ICT has been positioned at the transversal position to all other topsectors of the Netherlands, from High Tech Materials and Systems to Creative Industry, from Agriculture to Water. In all these sectors, ICT plays an enabling role. The “Roadmap ICT” gives an overview of the needs, divided into \"ICT one can rely on”, “ICT for monitoring and control”, “ICT for an open society”, and “Data & data & data”. For these efforts I have received the ICT-Personality Price with Peter Apers. Arnold Smeulders",
  "content_length": 4697,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:15"
}