{
  "name": "Aron Laszka",
  "homepage": "https://aronlaszka.com",
  "status": "success",
  "content": "Aron Laszka Search Aron Laszka Assistant Professor Pennsylvania State University Biography Aron Laszka is an Assistant Professor in the College of Information Sciences and Technology at the Pennsylvania State University. Previously, he was an Assistant Professor at the University of Houston, a Research Assistant Professor at Vanderbilt University, and a Postdoctoral Scholar at the University of California, Berkeley. His research interests revolve around artificial intelligence and cyber-physical systems, focusing on machine learning for decision making and optimization, with applications in smart and connected communities, critical infrastructure, and cybersecurity. His research is funded in part by the National Science Foundation, the Department of Energy, the Department of Transportation, and other agencies. Open PhD Student Positions Research Areas Artificial Intelligence Machine Learning, Optimization Cyber-Physical Systems Transportation, Power Systems, IoT Cybersecurity Decision Support, Data Analytics Recent Publications Baiting Luo, Ava Pettet, Aron Laszka, Abhishek Dubey, Ayan Mukhopadhyay (2025). Scalable Decision-Making in Stochastic Environments through Learned Temporal Abstraction. ICLR 2025. Spotlight (top 5.1% of submitted papers). PDF Cite Rishav Sen, Amutheezan Sivagnanam, Aron Laszka, Ayan Mukhopadhyay, Abhishek Dubey (2024). Grid-Aware Charging and Operational Optimization for Mixed-Fleet Public Transit. ITSC 2024. PDF Cite Project Project Sophie Pavia, David Rogers, Amutheezan Sivagnanam, Michael Wilbur, Danushka Edirimanna, Youngseo Kim, Philip Pugliese, Samitha Samaranayake, Aron Laszka, Ayan Mukhopadhyay, Abhishek Dubey (2024). Deploying Mobility-On-Demand for All by Optimizing Paratransit Services. IJCAI 2024. Acceptance rate: 20%. PDF Cite Project Project Sophie Pavia, David Rogers, Amutheezan Sivagnanam, Michael Wilbur, Danushka Edirimanna, Youngseo Kim, Ayan Mukhopadhyay, Philip Pugliese, Samitha Samaranayake, Aron Laszka, Abhishek Dubey (2024). SmartTransit.AI: A Dynamic Paratransit and Microtransit Application. IJCAI Demos 2024. PDF Cite Project Project Amutheezan Sivagnanam, Ava Pettet, Hunter Lee, Ayan Mukhopadhyay, Abhishek Dubey, Aron Laszka (2024). Multi-Agent Reinforcement Learning with Hierarchical Coordination for Emergency Responder Stationing. ICML 2024. PDF Cite Project Project See all publications Applied Artificial Intelligence Lab Faculty Aron Laszka Assistant Professor Students Taha Eghtesad Ph.D. Candidate Afiya Ayman Ph.D. Candidate Amutheezan Sivagnanam Ph.D. Candidate Chaeeun Han Ph.D. Student Alumni Salah Uddin Kadir Ph.D. Soodeh Atefi Ph.D. Projects * All Artificial Intelligence Cyber-Physical Systems Cybersecurity AI-Powered Autonomy-Aware Neighborhood Mobility Zones The AI-Powered Autonomy-Aware Neighborhood Mobility Zones project reimagines public transportation for mid-sized U.S. cities through an AI-driven, multi-modal mobility framework that integrates fixed-line buses and on-demand microtransit into a single, responsive system. Rural Transit Solutions for Enhancing Access & Connectivity This Civic Innovation Challenge (CIVIC) Stage 1 project will perform research that attempts to address transportation challenges faced by residents and workers in rural areas around industrial hubs. Rapid economic growth in these areas demands efficient public transit systems that can serve a geographically dispersed workforce with strict arrival times. AI for Equitable and Resilient Food Distribution during Disasters Food insecurity is the lack of consistent and reliable access to nutritious food. In the Houston (Texas) area, over 14% of Harris County households experienced food insecurity before the emergence of COVID-19. Equitable Electric Mobility: Smart Charging and Smart Parking This Houston-based project establishes a collaborative process with community and commercial technology partners to accelerate the equitable development of accessible fast charging infrastructure and electric vehicle (EV) ownership for low income families by leveraging regional markets of early EV adopters. AI-Engine for Optimizing Mixed-Fleet Transit Operations In every public transit system, a trade-off has to be made between concentrating service into very useful routes that serve large numbers of people and spreading service out to ensure that people everywhere have access to at least some service. Microtransit Solutions for Underserved Communities Public transportation infrastructure is an essential component in cultivating equitable communities. However, public transit agencies have historically struggled to achieve this since they are often severely stressed in terms of resources as they have to make the trade-off between concentrating service into routes that serve large numbers of people and spreading service out to ensure that people everywhere have access to at least some service. Addressing Transit Accessibility Challenges due to COVID-19 The COVID-19 pandemic has not only disrupted the lives of millions but also created exigent operational and scheduling challenges for public transit agencies. Agencies are struggling to maintain transit accessibility with reduced resources, changing ridership patterns, vehicle capacity constraints due to social distancing, and reduced services due to driver unavailability. Blockchain Security and Applications This project studies the following research topics: Security of blockchain-based consensus protocols Secure smart contracts Applications of blockchains Efficient and Scalable Bug-Bounty Programs Many organizations and companies have recently chosen to use so-called bug-bounty programs (also known as vulnerability reward programs), which allow outside security experts to evaluate the security of an organization’s products and services and to report security vulnerabilities in exchange for rewards. Data-Driven Energy Optimization for Multi-Modal Transit The goal of this project is to develop a high-resolution system-level data capture and analysis framework to revolutionize the operational planning of a regional transportation authority, specifically the Chattanooga Area Regional Transportation Authority (CARTA). Blockchains for Transactive Energy Systems Due to rapid growth in renewable energy resources and improvements in battery technology, power grids are undergoing major changes, which create significant management and control challenges. To tackle these challenges, decentralized solutions are needed, which can support the evolution of electrical power distribution systems. Correct-by-Design Blockchain-based Smart Contracts The adoption of blockchain based distributed ledgers is growing fast due to their ability to provide reliability, integrity, and auditability without trusted entities. One of the key capabilities of these emerging platforms is the ability to create self-enforcing smart contracts. Academic Experience Assistant Professor Pennsylvania State University 2022 â Present Assistant Professor University of Houston 2017 â 2022 Research Assistant Professor Vanderbilt University 2016 â 2017 Postdoctoral Scholar UC Berkeley 2015 â 2016 Postdoctoral Research Scholar Vanderbilt University 2014 â 2015 Visiting Research Scholar Pennsylvania State University 2013 â 2013 Academic Service Program Chair SMARTCOMP 2023 (8th IEEE International Conference on Smart Computing) DI-CPS 2023 (3rd Workshop on Data-Driven and Intelligent Cyber-Physical Systems at CPS-IoT Week 2023) DI-CPS 2022 (2nd Workshop on Data-Driven and Intelligent Cyber-Physical Systems at CPS-IoT Week 2022) DI-CPS 2021 (1st Workshop on Data-Driven and Intelligent Cyber-Physical Systems at CPS-IoT Week 2021) TREC4CPS 2018 (1st International Workshop on Trustworthy and Real-time Edge Computing for Cyber-Physical Systems) General Chair BlockNet 2020 (ACM MobiHoc Workshop on Blockchain for Network Resource Sharing) Program Committee Member NeurIPS 2025 (39th Conference on Neural Information Processing Systems) IJCAI-25 (34th International Joint Conference on Artificial Intelligence) ICLR 2025 (13th International Conference on Learning Representations) AAAI-25 (39th AAAI Conference on Artificial Intelligence) NeurIPS 2024 (38th Conference on Neural Information Processing Systems) DESTION 2024 (6th Workshop on Design Automation for CPS and IoT at IEEE/ACM CPS-IoT Week) IJCAI-24 (33rd International Joint Conference on Artificial Intelligence) AAMAS 2024 (23rd International Conference on Autonomous Agents and Multiagent Systems) AAAI-24 (38th AAAI Conference on Artificial Intelligence) NeurIPS 2023 (37th Conference on Neural Information Processing Systems) IJCAI-23, Distinguished PC Member Recognition (32nd International Joint Conference on Artificial Intelligence) ICCPS 2023 (14th ACM/IEEE International Conference on Cyber-Physical Systems) AAMAS 2023 (22nd International Conference on Autonomous Agents and Multiagent Systems) AAAI-23 (37th AAAI Conference on Artificial Intelligence) DESTION 2022 (4th Workshop on Design Automation for CPS and IoT at IEEE/ACM CPS-IoT Week) IJCAI-22, Distinguished PC Member (Top 3%) Recognition (31st International Joint Conference on Artificial Intelligence) AAMAS 2022 (21st International Conference on Autonomous Agents and Multiagent Systems) AAAI-22, Senior PC Member (36th AAAI Conference on Artificial Intelligence) GameSec 2021 (12th Conference on Decision and Game Theory for Security) AAMAS 2021 (20th International Conference on Autonomous Agents and Multiagent Systems) FC21 (25th International Conference on Financial Cryptography and Data Security) AAAI-21 (35th AAAI Conference on Artificial Intelligence) GameSec 2020 (11th Conference on Decision and Game Theory for Security) ICBC 2020 (2nd IEEE International Conference on Blockchain and Cryptocurrency) AAMAS 2020 (19th International Conference on Autonomous Agents and Multiagent Systems) FC20 (24th International Conference on Financial Cryptography and Data Security) AAAI-20 (34th A",
  "content_length": 15290,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:17"
}