{
  "name": "Aron Culotta",
  "homepage": "http://www.cs.tulane.edu/~aculotta",
  "status": "success",
  "content": "aron culotta nicholas j. altiero professor of computer science director   jurist center for artificial intelligence director   center for community-engaged artificial intelligence tulane university Sorry, you need Javascript on to email me. cv   scholar   teaching   funding   awards   pubs I conduct interdisciplinary research in human-centered artificial intelligence, particularly in areas of natural language processing, social network analysis, and machine learning, with applications in public health, emergency response, criminal justice, and civic transparency. Examples include tracking diseases, measuring effectiveness of public health campaigns, informing crisis response, preventing online harassment, detecting deceptive marketing, and identifying unsafe products. The methods rely on machine learning, natural language processing, and social network analysis. Areas of technical contribution include domain adaptation, learning from label proportions, and causal inference. Please see my research statement for more details. I also lead the Tulane Center for Community-Engaged Artificial Intelligence and the Jurist Center for Artificial Intelligence. Are you a student interested in a phd or independent study? teaching natural language processing intro to algorithms intro to data science artificial intelligence online social network analysis information retrieval service learning senior capstone funding This research is made possible in part by the National Science Foundation, the National Endowment for the Humanities, Answer ALS, the Jurist Center for Artificial Intelligence, the Newcomb Institute, Tulane's Office of Research, the Nayar Prize, the Educational and Research Initiative, and the Louisiana Board of Regents. I am grateful for this support. awards barbara e. moely service learning award nayar prize ii finalist outstanding paper honorable mention, aaai best paper honorable mention, cscw teacher of the year, cs department, illinois tech microsoft live labs fellow publications Safety reviews on Airbnb: An information tale Aron Culotta, Ginger Zhe Jin, Yidan Sun, Liad Wagman Marketing Science, 2025 Using Text-Based Causal Inference to Disentangle Factors Influencing Online Review Ratings Linsen Li, Aron Culotta, Nicholas Mattei HLT/NAACL, 2025 Artistic Network Toolkit (ANT): Democratizing Network Modeling in Art Historical Scholarship Alexis Culotta, Aron Culotta DHQ, 2025 Artificial intelligence can be a powerful social innovation for public health, if community engagement is at the core Alessandra Bazzano, Andrea Mantsios, Nicholas Mattei, Michael Kosorok, Aron Culotta JMIR, 2025 Predicting hurricane evacuation behavior synthesizing data from travel surveys and social media Tanmoy Bhowmik, Naveen Eluru, Samiul Hasan, Aron Culotta, Kamol Chandra Roy Transportation Research Part C: Emerging Technologies, 2024 Characterizing online criticism of partisan news media using weakly supervised learning Shivaram, Karthik, Bilgic, Mustafa, Shapiro, Matthew A, Culotta, Aron ICWSM, 2024 code Forecasting political news engagement on social media Shivaram, Karthik, Bilgic, Mustafa, Shapiro, Matthew A, Culotta, Aron ICWSM, 2024 code How Does Empowering Users with Greater System Control Affect News Filter Bubbles? Liu, Ping, Shivaram, Karthik, Culotta, Aron, Shapiro, Matthew A, Bilgic, Mustafa ICWSM, 2024 code Use Open Source for Safer Generative AI Experiments Aron Culotta, Nicholas Mattei MIT Sloan Management Review, 2023 Domain Adaptation for Learning from Label Proportions Using Domain-Adversarial Neural Network Xintian Li, Aron Culotta SN Computer Science, 2023 Online Reviews Are Leading Indicators of Changes in K-12 School Attributes Linsen Li, Aron Culotta, Douglas N. Harris, Nicholas Mattei WWW, 2023 Forecasting COVID-19 Vaccination Rates using Social Media Data Xintian Li, Aron Culotta SocialNLP, 2023 Safety Reviews on Airbnb: An Information Tale Aron Culotta, Ginger Zhe Jin, Yidan Sun, Liad Wagman PlatStrat, 2022 Reducing Cross-Topic Political Homogenization in Content-Based News Recommendation Karthik Shivaram, Ping Liu, Matthew Shapiro, Mustafa Bilgic, Aron Culotta RecSys, 2022 Identifying Hurricane Evacuation Intent on Twitter Xintian Li, Samiul Hasan, Aron Culotta ICWSM, 2022 Leaders or Followers? A Temporal Analysis of Tweets from IRA Trolls Siva K Balasubramanian, Mustafa Bilgic, Aron Culotta, Libby Hemphill, Libby, Anita Nikolich, Matthew A Shapiro ICWSM, 2022 Enhancing Model Robustness and Fairness with Causality: A Regularization Approach Zhao Wang, Kai Shu, and Aron Culotta EMNLP WS, 2021 The Interaction between Political Typology and Filter Bubbles in News Recommendation Algorithms Ping Liu, Karthik Shivaram, Matthew Shapiro, Aron Culotta, Mustafa Bilgic WWW, 2021 code Robustness to Spurious Correlations in Text Classification via Automatically Generated Counterfactuals Zhao Wang, Aron Culotta AAAI, 2021 code Identifying Spurious Correlations for Robust Text Classification Zhao Wang, Aron Culotta EMNLP, 2020 code Characterizing Variation in Toxic Language by Social Context Bahar Radfar, Karthik Shivaram, Aron Culotta ICWSM, 2020 Big data and emergency management: Concepts, methodologies, and applications Xuan Song, Haoran Zhang, Rajendra A. Akerkar, Huawei Huang, Song Guo, Lei Zhong, Yusheng Ji, Andreas Lothe Opdahl, Hemant Purohit, Andre Supkin, Akshay Pottathil, Aron Culotta IEEE BigData, 2020 When do words matter? Understanding the Impact of Lexical Choice on Audience Perception using Individual Treatment Effect Estimation Zhao Wang, Aron Culotta AAAI, 2019 code Discovering and Controlling for Latent Confounds in Text Classification Using Adversarial Domain Adaptation Virgile Landeiro, Tuan Tran, Aron Culotta SDM, 2019 Using weak supervision to scale the development of machine-learning models for social media-based marketing research Jennifer Cutler, Aron Culotta Applied Marketing Analytics, 2019 Collecting Representative Samples from a Search Engine by Adaptive Query Generation Virgile Landeiro, Aron Culotta ASONAM, 2019 Estimating Tie Strength in Follower Networks to Measure Brand Perceptions Tung Nguyen, Li Zhang, Aron Culotta FAB, 2019 Personality and Behavior in Role-based Online Games Zhao Wang, Anna Sapienza, Aron Culotta, Emilio Ferrara COG, 2019 Robust Text Classification under Confounding Shift Virgile Landeiro, Aron Culotta JAIR, 2018 code Forecasting the presence and intensity of hostility on Instagram using linguistic and social features Ping Liu, Joshua Guberman, Libby Hemphill, Aron Culotta ICWSM, 2018 code Learning from noisy label proportions for classifying online social data Ehsan Mohammady Ardehaly, Aron Culotta SNAM, 2018 Mining the Demographics of Political Sentiment from Twitter Using Learning from Label Proportions Ehsan Ardehaly, Aron Culotta ICDM, 2017 Co-training for Demographic Classification Using Deep Learning from Label Proportions Ehsan Ardehaly, Aron Culotta ICDM-WS, 2017 Are Words Commensurate with Actions? Quantifying Commitment to a Cause from Online Public Messaging Zhao Wang, Jennifer Cutler, Aron Culotta ICDM-WS, 2017 code Controlling for Unobserved Confounds in Classification Using Correlational Constraints Virgile Landeiro, Aron Culotta ICWSM, 2017 code Identifying leading indicators of product recalls from online reviews using positive unlabeled learning and domain adaptation Shreesh Kumara Bhat, Aron Culotta ICWSM, 2017 code Using online social networks to measure consumers’ brand perception Jennifer Cutler, Aron Culotta Applied Marketing Analytics, 2017 Towards identifying leading indicators of smoking cessation attempts from social media Aron Culotta ICHI-WS, 2016 Polar Scores: Measuring Partisanship Using Social Media Content Libby Hemphill, Aron Culotta, Matthew Heston Journal of Information Technology & Politics, 2016 code Cold-start recommendations for audio news stories using matrix factorization Ehsan Mohammady Ardehaly, Aron Culotta IJCAI, 2016 Domain adaptation for learning from label proportions using self-training Ehsan Mohammady Ardehaly, Aron Culotta IJCAI, 2016 Training a text classifier with a single word using Twitter Lists and domain adaptation Aron Culotta SNAM, 2016 Reducing confounding bias in observational studies that use text classification Virgile Landeiro, Aron Culotta AAAI Symposium, 2016 Predicting Twitter User Demographics using Distant Supervision from Website Traffic Data Aron Culotta, Nirmal Kumar Ravi, Jennifer Cutler JAIR, 2016 code Mining brand perceptions from Twitter social networks Aron Culotta, Jennifer Cutler Marketing Science, 2016 code Robust text classification in the presence of confounding variables Virgile Landeiro, Aron Culotta AAAI, 2016 code Finding truth in cause-related advertising: A lexical analysis of brands' health, environment, and social justice communications on Twitter Aron Culotta, Jennifer Cutler, Junzhe Zheng The Journal of Values-Based Leadership, 2015 A demographic and sentiment analysis of e-cigarette messages on Twitter Elaine Cristina Resende, Aron Culotta BCB-WS, 2015 code Inferring latent attributes of Twitter users with label regularization Ehsan Mohammady Ardehaly, Aron Culotta HLT/NAACL, 2015 Using Matched Samples to Estimate the Effects of Exercise on Mental Health from Twitter Virgile Landeiro Dos Reis, Aron Culotta AAAI, 2015 code Predicting the Demographics of Twitter Users from Website Traffic Data Aron Culotta, Nirmal Ravi Kumar, Jennifer Cutler AAAI, 2015 code Reducing Sampling Bias in Social Media Data for County Health Inference Aron Culotta JSM, 2014 code Anytime Active Learning Maria E Ramirez-Loaiza, Aron Culotta, Mustafa Bilgic AAAI, 2014 Using county demographics to infer attributes of Twitter users Ehsan Mohammady, Aron Culotta ACL-WS, 2014 Tweedr: Mining Twitter to Inform Disaster Response Zahra Ashktorab, Christopher Brown, Manojit Nandi, Aron Culotta ISCRAM, 2014 code Estimating County Health Statistics with Twitter Aron Culotta CHI, 2014 code Inferring the origin l",
  "content_length": 13959,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:18"
}