{
  "name": "Aroor Dinesh Dileep",
  "homepage": "http://faculty.iitmandi.ac.in/~addileep",
  "status": "success",
  "content": "Dr. Dileep A. D. << IIT Mandi Dr. Dileep A. D. Phone: +91-1905-300047 EMail: addileep[at]iitmandi[dot]ac[dot]in Address: School of Computing and Electrical Engineering Room No 12, 2nd Floor, A3 Building, IIT Mandi, Kamand Campus, Kamand - 175005 Himachal Pradesh India Research interests Pattern Recognition Kernel Methods for Pattern Analysis Machine Learning Speech Technology Computer Vision Education Ph.D. in Computer Science and Engineering from Indian Institute of Technology Madras, Chennai Thesis title: Matching based Dynamic Kernels for Classification of Varying Length Patterns of Speech M.Tech. in Computer Science and Engineering from Indian Institute of Technology Madras, Chennai B.E. in Computer Science and Engineering from Rural Engineering College, Bhalki, Gulbarga University, Karnataka Work Experience Academic Research Experience School of Computing and Electrical Engineering, Indian Institute of Technology Mandi, Mandi Associate Professor: October 2019 - Till Date School of Computing and Electrical Engineering, Indian Institute of Technology Mandi, Mandi Assistant Professor: August 2013 - October 2019 Department of Computer Science and Engineering, Indian Institute of Technology Madras, Chennai Project Officer: April 2012 - December 2012 Department of Computer Science and Engineering, Indian Institute of Technology Madras, Chennai Project Associate: June 2006 - December 2006 Teaching Experience Department of Computer Science and Engineering, N.M.A.M. Institute of Technology, Nitte, Karnataka Lecturer: September 2001 - August 2004 Publications Papers published/accepted in refereed journals P. Sharma, V. Abrol, A. D. Dileep and A. K. Sao, \"Sparse coding based features for speech units classification\", in Computer Speech & Language, vol. 47, pp. 333-350, 2018. A. D. Dileep and C. Chandra Sekhar, “GMM based intermediate matching kernel for classification of varying length patterns of long duration speech using support vector machines”, in IEEE Transactions on Neural Networks and Learning Systems, vol. 25, no. 8, pp. 1421-1432, August 2014. A. D. Dileep and C. Chandra Sekhar, “Class-specific GMM based intermediate matching kernel for classification of varying length patterns of long duration speech using support vector machines”, in Speech Communication, vol. 57, pp. 126-143, February 2014. A. D. Dileep and C. Chandra Sekhar, “HMM based intermediate matching kernel for classification of sequential patterns of speech using support vector machines”, in IEEE Transactions on Audio, Speech and Language Processing , vol. 21, no. 12, pp. 2570-2582, December 2013. A. D. Dileep and C. Chandra Sekhar, “Speaker identification using pyramid match kernel based support vector machines”, in International Journal of Speech Technology, vol. 15, no. 3, pp. 365-379, September 2012. S. Swapna, A. D. Dileep, C. Chandra Sekhar, and Sri Kant, “Block cipher identification using support vector classification and regression,” in Journel of Discrete Mathematical Sciences and Cryptography, vol. 13, no. 4, pp. 305-318, August 2010. Papers in edited volumes T. Veena, A. D. Dileep and C. Chandra Sekhar, “Dynamic Kernels based Approaches to Analysis of Varying Length Patterns in Speech and Image Processing Tasks”, Chapter 13 in Pattern Recognition and Big Data, Amita Pal, Sankar K Pal, Eds. Hershey, PA, World Scientific, 2017. A. D. Dileep and C. Chandra Sekhar, “Speaker recognition using intermediate matching kernel based support vector machines”, in Forensics Speaker Recognition: Law Enforcement and Counter-Terrorism, A. Neustein and H. Patil, Eds., pp. 389-424, 2011. A. D. Dileep, T. Veena and C. Chandra Sekhar, “A review of kernel methods based approaches to classification and clustering of sequential patterns, Part I: Sequences of continuous feature vectors”, in Pattern Discovery Using Sequence Data 2. Mining: Applications and Studies, Pradeep Kumar, P. Radha Krishna and S. Bapi Raju, Eds. Hershey, PA, USA:IGI Global, pp. 24-50, 2011. T. Veena, A. D. Dileep and C. Chandra Sekhar, “A review of kernel methods based approaches to classification and clustering of sequential patterns, Part II: Sequences of discrete symbols”, in Pattern Discovery Using Sequence Data Mining: Applications and Studies, Pradeep Kumar, P. Radha Krishna and S. Bapi Raju, Eds. Hershey, PA, USA:IGI Global, pp. 51-71, 2011. Papers in conferences 2018 2017 A. Thakur, J. Jain, A. D. Dileep and P. Rajan, “Rapid Bird Activity Detection Using Probabilistic Sequence Kernels”, in Proceedings of 25th European Signal Processing Conference (EUSIPCO 2017), Kos Island, Greece, August 2017. P. Sharma, V. Abrol, A. D. Dileep and A. K. Sao, “Class specific GMM based sparse feature for speech units classification”, in Proceedings of 25th European Signal Processing Conference (EUSIPCO 2017), Kos Island, Greece, August 2017. V. Abrol, P. Sharma, A. Thakur, P. Rajan, A. D. Dileep and A. K. Sao, “Archetypal analysis based sparse convex sequence kernel for bird activity detection”, in Proceedings of 25th European Signal Processing Conference (EUSIPCO 2017), Kos Island, Greece, August 2017. Shikha Gupta, A. D. Dileep, and T. Veena, \"The Semantic Multinomial Representation of Images Obtained using Dynamic Kernel Based Pseudo-concept SVMs\", in Proceedings of 23rd National Conference on Communications (NCC 2017), Chennai, India, March 2017. Shaifu Gupta and A. D. Dileep, \"Online Adaptation Models for Resource Usage Prediction in Cloud Network\", in Proceedings of 23rd National Conference on Communications (NCC 2017), Chennai, India, March 2017. 2016 Shaifu Gupta, A. D. Dileep and T. A. Gonsalves, \"Fractional Difference based Hybrid Model for Resource Prediction in Cloud Network,\" in Proceedings of Fifth International Conference on Network, Communication and Computing (ICNCC 2016), Kyoto, Japan, December 2016, pp. 93-97. D. Chakraborty, P. Mukker, P. Rajan and A. D. Dileep, \"Bird Call Identification Using Dynamic Kernel Based Support Vector Machines and Deep Neural Networks,\" in Proceedings of 15th IEEE International Conference on Machine Learning and Applications (ICMLA 2016), Anaheim, CA, December 2016, pp. 280-285. Shikha Gupta, A. D. Dileep, and T. Veena, \"Segment-level Probabilistic Sequence Kernel based Support Vector Machines for Classification of Varying Length Patterns of Speech\", in Proceedings of The 23rd International Conference on Neural Information Processing (ICONIP 2016), Kyoto, Japan, October 2016, Part IV, LNCS 9950, pp. 321–328. Neeraj Sharma, Anshu Sharma, A. D. Dileep, and T. Veena, \"Text Classification using Combined Sparse Representation Classifiers and Support Vector Machines\", in Proceedings of 4th International Symposium on Computational and Business Intelligence (ISCBI 2016), Olten, Switzerland, September 2016. P. Sharma, V. Abrol, A. Sachdev and A. D. Dileep, \"Speech emotion recognition using kernel sparse representation based classifier,\" in Proceedings of 24th European Signal Processing Conference (EUSIPCO 2016), Budapest, August 2016, pp. 374-377. Shikha Gupta, A.D.Dileep, Veena Thenkanidiyoor, \"Segment-Level Pyramid Match Kernels For The Classification of Varying Length Patterns of Speech Using SVMs,\" in Proceedings of 24th European Signal Processing Conference (EUSIPCO 2016), Budapest, August 2016, pp. 2030-2034. Shikha Gupta, A. D. Dileep, and T. Veena, \"Spatial Probabilistic Sequence Kernel for Scene Classification using Support Vector Machines”, in Proceedings of Women in Computer Vision (WiCV 2016) workshop in Computer Vision for Pattern Recognition (CVPR 2016), Las Vegas, NV, June 2016. Shikha Gupta, Samriddhi Jain, A. D. Dileep, and T. Veena, \"Semantic Multinomial Representation for Scene Images Using Dynamic Kernel based SVMs”, in Proceedings of Scene Understanding Workshop (SUNw) in Computer Vision for Pattern Recognition (CVPR 2016), Las Vegas, NV, June 2016 2015 A. Sachdev, T. Veena, A. D. Dileep and C. Chandra Sekhar, “Example-specific density based matching kernels for scene classification using support vector machines, In Proceedings of 14th International Conference on Machine Learning and Applications (ICMLA 2015),  Miami, Florida, USA, December 2015, pp. 115-120. A. Sachdev, A. D. Dileep and T. Veena, “A family of example-specific density based matching kernel for classification of varying length patterns of speech using support vector machines”, In Proceedings of 2nd International Conference on Soft Computing and machine Intelligence (ISCMI 2015), Hong Kong, November 2015, pp. 121-125. [This paper bagged INNS Best Paper Award.] A. Sachdev, A. D. Dileep, and T. Veena, “Example-specific density based matching kernel for classification of varying length patterns of speech using support vector machines”, In Proceedings of 22nd International Conference on Neural Information Processing (ICONIP 2015), Istanbul, Turkey, November 2015, Part I, LNCS 9489, pp. 1–8. P. Sharma, V. Abrol, A. D. Dileep, and A. K. Sao, “Sparse coding based features for speech units classification”, in Proceedings of INTERSPEECH 2015, Dresden, Germany, September 2015. 2014 A. D. Dileep and C. Chandra Sekhar, “HMM based intermediate matching kernel for classification of sequential patterns of speech using support vector machines”, In Proceedings of 2nd IEEE Global Conference on Signal and Information Processing, (GlobalSIP 2014), Atlanta, Georgia, USA, December 2014. K. Gupta, V. Gupta, A. K. Sao, A. Bhavsar, and A. D. Dileep, “Class-specific hierarchical classification of HEp-2 cell images: The case of two classes,” In Proceedings of 2014 1st Workshop on Pattern Recognition Techniques for Indirect Immunofluorescence Images (I3A), August 2014, pp. 6-9. 2006-2013 A. D. Dileep and C. Chandra Sekhar, “HMM based pyramid match kernel for classification of sequential patterns of speech using support vector machines”, In Proceedings of IEEE International Conference on Acoustics, Speech, and Signal ",
  "content_length": 14925,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:18"
}