{
  "name": "Arpan Mukhopadhyay",
  "homepage": "https://warwick.ac.uk/fac/sci/dcs/people/arpan_mukhopadhyay",
  "status": "success",
  "content": "Arpan Mukhopadhyay Skip to main content Skip to navigation Associate ProfessorRoom: MB2.33HomepageLink opens in a new windowemail: firstname.lastname AT warwick DOT ac DOT ukResearch Interests Applied Probability Stochastic Modeling and Analysis of Computer Systems Design and Analysis of Randomized Algorithms Interacting Particle Systems Available PositionsI am always looking for motivated Ph.D. students with strong mathematical background to work with me. To have a better understanding of the type of research I do, please have a look at some of my recent papersLink opens in a new window. If you are interested to work with me, please send in your CV. Students with non-CS background (e.g., in Mathematics, Statistics, Electrical Engineering) are encouraged to apply. Information on the application process and funding opportunities can be found hereLink opens in a new window and hereLink opens in a new window.Program Committees WiOpt 2026, Comsnets 2026 ACM SIGMETRICS 2025, 2026 ACM SIGMETRICS/IFIP Performance 2024 IFIP Performance (2020, 2021) International Teletraffic Congress (2019,2020,2022,2023) Co-organiser of workhop on \"Queuing Theory for Emerging Classical and Quantum Systems (QTECQS)Link opens in a new window\" collocated with IFIP Performance 2023. Co-organizer of workshop on \"Advances in Probability Theory and Applications to Systems ModelingLink opens in a new window\" (in honor of Prof. Ravi R. Mazumdar). Awards Best Paper Award, ACM Mobihoc, 2024 Rising Scholar Award, International Teletraffic Congress, 2018 Best Paper Award, IFIP Performance 2015 Best Paper Award, International Teletraffic Congress 2015 Best-in-session Presentation Award (in Scheduling-1 Session), IEEE INFOCOM 2018 Teaching ST343/ST419: (Advanced) Topics in Data Science (Years taught: 2021-22, 2022-23, 2023-24) CS241: Operating Systems and Computer Networks (Years taught: 2019-20, 2020-21, 2021-22, 2022-23, 2023-24, 2024-25) Selected Publications S. Ghanbarian, A. Mukhopadhyay, R. R. Mazumdar, and F. M. Guillemin, \"On Optimal Server Allocation for Moldable Jobs with Concave Speed-UpLink opens in a new window\", ACM Mobihoc 2024. (Best Paper Award) S. Bhambay, A. Mukhopadhyay, and T. Vasantam, \"The Power of Two Choices with Load Comparison ErrorsLink opens in a new window\", ACM Mobihoc 2023. A. Mukhopadhyay, \"Phase Transitions in Biased Opinion Dynamics with 2-choices RuleLink opens in a new window\", Probability in Engineering and Informational Sciences, 2023. S. Bhambay, A. Mukhopadhyay, “Asymptotic Optimality of Speed-Aware JSQ for Heterogeneous Service SystemsLink opens in a new window”, Performance Evaluation, vol. 157, pp. 102320, 2022. A. Mukhopadhyay, R. R. Mazumdar, R. Roy, “Voter and Majority Dynamics with Biased and Stubborn AgentsLink opens in a new window”, Journal of Statistical Physics, vol. 181, pp. 1239–1265, 2020. A. Mukhopadhyay, N. Hegde, M. Lelarge, “Asymptotics of Replication and Matching in Large Caching SystemsLink opens in a new window”, IEEE/ACM Transactions on Networking, vol. 27(4), pp. 1657-1668, 2019. A. Mukhopadhyay, A. Karthik, and R. R. Mazumdar, “Randomized Assignment of Jobs to Servers in Heterogeneous Clusters of Shared Servers for Low DelayLink opens in a new window”, Stochastic Systems, vol. 6(1), pp. 90-131, 2016. A. Mukhopadhyay, R. R. Mazumdar, “Analysis of Randomized Join-The-Shortest-Queue (JSQ) Schemes in Large Heterogeneous Processor Sharing SystemsLink opens in a new window”, IEEE Transactions on Control and Network Systems, vol. 3(2), pp. 116-126, 2016. Full list of publications can be found on Google ScholarLink opens in a new windowSupervisionPh.D. Luke MeredithLink opens in a new window (2024-Present) Sanidhay BhambayLink opens in a new window (2020-24), Now a postdoc at Durham University Business School M.Sc Pak-Ho-Gordon Sy (2023-24) Ruaidhri Archbold (2022-23) Ying Jin (2022-23) Gabriel Wright (2021-22) Ryan Headlam (2021-22) Mitch Goh (2020-21) Ernie Chow (2019-20) Let us know you agree to cookies We use cookies to give you the best online experience. Please let us know if you agree to functional, advertising and performance cookies. You can update your cookie preferences at any time. Cookie policy Essential cookies Functional cookies Advertising cookies Performance cookies Accept all Remember my preference More information",
  "content_length": 4330,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:23"
}