{
  "name": "Arpit Agarwal",
  "homepage": "https://agarpit.github.io",
  "status": "success",
  "content": "Arpit Agarwal Arpit Agarwal Assistant Professor Computer Science & Engineering Indian Institute of Technology, Bombay Email: agarpit [at] outlook.com About Me I am currently an Assistant Professor at the Department of Computer Science and Engineering at IIT Bombay. Prior to joining IIT Bombay, I was a postdoctoral researcher at FAIR Labs (Meta) working with Max Nickel on socially responsible recommendation systems. Before that I was a postdoctoral fellow at the Data Science Institute at Columbia University hosted by Prof. Yash Kanoria and Prof. Tim Roughgarden. I completed my PhD from the Department of Computer & Information Science at University of Pennsylvania, under the guidance of Prof. Shivani Agarwal. My research lies in the area of machine learning (ML) and artificial intelligence (AI). Specifically, I am interested in the interaction of humans with ML/AI systems. This includes topics in learning from implicit, strategic, and heterogenous human feedback. This also includes understanding the dynamics in the interaction between humans and AI and understanding how one influences the other in the long-term. Finally, this also includes responsible design of AI systems and understanding/mitigating undesired consequences on individuals and society. Teaching CS767 Theoretical Machine Learning Autumn'25. CS6103 Human-Centered AI: From Learning Models to Responsible Systems Spring'25. Research Publications Misalignment, Learning, and Ranking: Harnessing Users Limited Attention Arpit Agarwal, Rad Niazadeh, Prathamesh Patil (alphabetical order) . To Appear at Web and Internet Economics (WINE) 2025. [arXiv preprint] Non-Stationary Dueling Bandits Under a Weighted Borda Criterion Joe Suk, Arpit Agarwal. In Transactions of Machine Learning Research (TMLR), 2025. Invited for presentation at ICLR, 2025 [arXiv preprint] Learning-Augmented Dynamic Submodular Maximization Arpit Agarwal, Eric Balkanski. In Neural Information Processing Systems (NeurIPS) 2024. [arXiv preprint] Semi-Bandit Learning for Monotone Stochastic Optimization Arpit Agarwal, Rohan Ghuge, Viswanath Nagarajan (alphabetical order) . In IEEE Symposium on Foundations of Computer Science (FOCS) 2024. [arXiv preprint] System-2 Recommenders: Disentangling Utility and Engagement in Recommendation Systems via Temporal Point-Processes Arpit Agarwal, Nicolas Usunier, Alessandro Lazaric, Maximilian Nickel. In ACM Conference on Fairness, Accountability, and Transparency (FAccT) 2024. [arXiv preprint] Online Recommendations for Agents with Discounted Adaptive Preferences Arpit Agarwal, William Brown (alphabetical order) . ALT 2024. [paper] Parallel Approximate Maximum Flows in Near-Linear Work and Polylogarithmic Depth Arpit Agarwal, Sanjeev Khanna, Huan Li, Prathamesh Patil, Chen Wang, Nathan White, Peilin Zhong (alphabetical order) . SODA 2024. [paper] When Can We Track Significant Preference Shifts in Dueling Bandits? Joe Suk, Arpit Agarwal. NeurIPS 2023. [paper] Diversified Recommendations for Agents with Adaptive Preferences Arpit Agarwal, William Brown (alphabetical order) . NeurIPS 2022. [paper] Sublinear Algorithms for Hierarchical Clustering Arpit Agarwal, Sanjeev Khanna, Huan Li, Prathamesh Patil (alphabetical order) . NeurIPS 2022. [paper] An Asymptotically Optimal Batched Algorithm for the Dueling Bandit Problem Arpit Agarwal, Rohan Ghuge, Viswanath Nagarajan (alphabetical order) . NeurIPS 2022. [paper] A Sharp Memory-Regret Trade-Off for Multi-Pass Streaming Bandits Arpit Agarwal, Sanjeev Khanna, Prathamesh Patil (alphabetical order) . COLT 2022. [paper] Batched Dueling Bandits Arpit Agarwal, Rohan Ghuge, Viswanath Nagarajan (alphabetical order) . ICML 2022. Long presentation (top 2% of submissions). [arXiv preprint]. PAC Top-$k$ Identification under SST in Limited Rounds Arpit Agarwal, Sanjeev Khanna, Prathamesh Patil (alphabetical order) . AISTATS 2022. [paper] Stochastic Dueling Bandits with Adversarial Corruption Arpit Agarwal, Shivani Agarwal, Prathamesh Patil (alphabetical order) . ALT 2021. [paper] Choice Bandits Arpit Agarwal, Nicholas Johnson, Shivani Agarwal. NeurIPS 2020. [paper] [supplemental] Rank Aggregation from Pairwise Comparisons in the Presence of Adversarial Corruptions Arpit Agarwal, Shivani Agarwal, Sanjeev Khanna, and Prathamesh Patil (alphabetical order) . ICML 2020. [paper] Peer Prediction with Heterogeneous Users. Arpit Agarwal, Debmalya Mandal, David C. Parkes , and Nisarg Shah (alphabetical order) . ACM Transactions on Economics and Computation (TEAC) 2020. [paper] Supercedes the EC-17 paper below. Stochastic Submodular Cover with Limited Adaptivity. Arpit Agarwal, Sepehr Assadi, and Sanjeev Khanna (alphabetical order) . SODA 2019. [paper] [arXiv version] Accelerated Spectral Ranking. Arpit Agarwal, Prathamesh Patil, and Shivani Agarwal. ICML 2018. [paper] Learning with Limited Rounds of Adaptivity: Coin Tossing, Multi-Armed Bandits, and Ranking from Pairwise Comparisons. Arpit Agarwal, Shivani Agarwal, Sepehr Assadi, and Sanjeev Khanna (alphabetical order) . COLT 2017. [paper] Peer Prediction with Heterogeneous Users. Arpit Agarwal, Debmalya Mandal, David C. Parkes , and Nisarg Shah (alphabetical order) . EC 2017. [paper] Informed Truthfulness in Multi-Task Peer Prediction. Victor Shnayder, Arpit Agarwal, Rafael Frongillo, and David C. Parkes . EC 2016. [paper] [arXiv version] A short version appeared in HCOMP Workshop on Mathematical Foundations of Human Computation, 2016 On Consistent Surrogate Risk Minimization and Property Elicitation. Arpit Agarwal and Shivani Agarwal. COLT 2015. [paper] GEV-Canonical Regression for Accurate Binary Class Probability Estimation when One Class is Rare. Arpit Agarwal, Harikrishna Narasimhan, Shivaram Kalyanakrishnan and Shivani Agarwal. ICML 2014. [paper]",
  "content_length": 5784,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:18"
}