{
  "name": "Arpita Biswas",
  "homepage": "https://sites.google.com/view/arpitabiswas",
  "status": "success",
  "content": "Arpita BiswasSearch this siteEmbedded FilesSkip to main contentSkip to navigationARPITA BISWAS, Ph.D.Assistant Professor,Department of Computer Science,Rutgers Universitya.biswas@rutgers.edu | arpita.biswas@live.in Quick Links: Publications  | Awards |  Invited Talks ResearchMy broad areas of interest include Algorithmic Game Theory, Optimization, and Machine Learning. I work on designing responsible algorithms spanning a range of problems in intervention planning, multi-agent learning (multi-armed bandit), incentive mechanisms, two-sided markets, etc. and thus far, I have worked on problems arising from real-world scenarios like healthcare, recommendation, resource allocation, online crowd-sourcing, dynamic pricing in transportation, and ride-sharing. More recently, I have been working on projects related to decision-making in energy system decarbonization and resilience. My long-term goal as a researcher is to help provide responsible and resilient decision-support solutions to socially impactful problems.Prior to joining Rutgers, I was a Research Associate at  Harvard T.H. Chan School of Public Health. Before that, I was a CRCS Postdoctoral Fellow at the John A. Paulson School of Engineering and Applied Sciences (SEAS), Harvard University. I earned my Ph.D. degree from the Department of Computer Science and Automation (CSA), Indian Institute of Science (IISc). My dissertation provides algorithms for fair decision-making in three main contexts---resource allocation, recommendation, and classification. I have received the Best Thesis Prize from the Indian National Academy of Engineering (INAE) 2021, Best Thesis Award by the Dept. of CSA, IISc (2020-2021), a Google Ph.D. Fellowship (2016-2020), and a GHCI scholarship (2018). I am extremely grateful to have been recognized as a Rising Star in STOC 2021 and in the Trustworthy ML Seminar Series for my contributions to algorithms for fair decision-making.Media CoveragePaper titled Quantifying the Effects of Solar Power Adoption on CO2 Emissions Reduction, published in Science Advances, covered by several news outlets: The Fast Company, The Hill, Rutgers Today, Mirage News, The New Lede.StudentsAditya Ahlawat, Rutgers Honors College (undergraduate student)Nadine Angela Cantonjos, Douglass Residential College, Rutgers University (undergraduate student)Apoorv Bankey, Rutgers University (Masters in Data Science)Anamta Rizvi, Rutgers University (Masters in Data Science)TeachingDesign and Analysis of Computer Algorithms, CS 344, Rutgers University, Fall 2025Fair AI for Multi-Agent Decision Making, CS 596, Rutgers University, Fall 2024Photo GalleryInvited Speaker,Women in AI Ignite @ NeurIPS New OrleansJunior Chair for \"ML for Population Health\",Machine Learning for Health (ML4H) New OrleansField visit for a maternal health project,ARMMAN (NGO), Mumbai, IndiaWomen in Theory (WIT), Simons Institute, BerkeleyA new health-van inauguration event,The Family Van, BostonInvited speaker,Milton Academy (High School), Milton Professional Experience:Assistant Professor, Department of Computer Science, Rutgers University (September 2024 - till date)Research Associate, Harvard T.H. Chan School of Public Health (February 2023 - June 2024)CRCS Postdoctoral Fellow, Harvard John A. Paulson School of Engineering and Applied Sciences (November 2020-2022)Visiting Researcher, Google Research (July 2020 to October 2020)Research Intern at Microsoft Research Cambridge (April 2019 to July 2019)Research Intern at Microsoft Research India (August 2018 to December 2018)Research Engineer at Xerox Research Center India (July 2014 to July 2016)List of Publications and PatentsList of AwardsInvited TalksAcademic QualificationsList of ProjectsProfessional ServicesGoogle SitesReport abuseGoogle SitesReport abuse",
  "content_length": 3786,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:18"
}