{
  "name": "Arthur Gregory Money",
  "homepage": "https://www.brunel.ac.uk/people/arthur-money",
  "status": "success",
  "content": "Dr Arthur Money | Introduction | Brunel University London Skip to Content Home People Dr Arthur Money Dr Arthur MoneyReader Wilfred Brown Building 114 Email: arthur.money@brunel.ac.uk Tel: +44 (0)1895 266758 Google Scholar Profile Computer Science College of Engineering, Design and Physical Sciences Summary Dr Arthur G. Money is a Reader in the Department of Computer Science at Brunel University London, where he also received his MSc in Distributed Information Systems with distinction in 2001 and PhD in Multimedia Computing in 2007. Prior to embarking on a fully funded EPSRC PhD scholarship in 2004, he worked for Oracle UK Ltd as an e-Business Technology Consultant. Dr Money’s research focuses on the user-centred design, development and evaluation of multimedia computing systems and the effective deployment of these systems with users who have complex needs spanning a range of domains including older adults, healthcare, education, and defence. Qualifications BSc (Hons), MSc., PhD Responsibility Computer Science Work Placements Director Computer Science Marketing Co-ordinator Newest selected publications Ibrahim, Z., Money, A., Atwal, A. and Spiliotopoulou, G. (2025) 'PilOT-Measure: A mobile 3D depth sensing application to support accurate and efficient clinician-led home-based falls risk assessments'. BMC Medical Informatics and Decision Making, 25 (1). pp. 1 - 27. ISSN: 1472-6947 Open Access Link Journal article Yusuf, H., Money, A. and Daylamani-Zad, D. (2025) 'Towards reducing teacher burden in Performance-Based assessments using aivaluate: an emotionally intelligent LLM-Augmented pedagogical AI conversational agent'. Education and Information Technologies, 0 (ahead of print). pp. 1 - 45. ISSN: 1360-2357 Open Access Link Journal article Yusuf, H., Money, A. and Daylamani-Zad, D. (2025) 'Pedagogical AI conversational agents in higher education: a conceptual framework and survey of the state of the art'. Educational Technology Research and Development, 73 (2). pp. 815 - 874. ISSN: 1042-1629 Open Access Link Journal article Coleman, T. and Money, AG. (2024) 'Developing a game design framework to embed student-centred learning'. International Journal of Information and Learning Technology, 41 (4). pp. 448 - 469. ISSN: 2056-4880 Open Access Link Journal article Coleman, TE. and Money, A. (2020) 'Student Centered Digital Game-Based Learning: A Conceptual Framework and Survey of the State of the Art'. Higher Education, 79 (3). pp. 415 - 457. ISSN: 0018-1560 Open Access Link Journal article More publications(59)",
  "content_length": 2552,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:22"
}