{
  "name": "Arthorn Luangsodsai",
  "homepage": "http://pioneer.netserv.chula.ac.th/~larthorn",
  "status": "success",
  "content": "Home ผศ. ดร. อาธร เหลืองสดใส (Assistant Professor Dr. Arthorn Luangsodsai) Department of Mathematics and Computer Science, Faculty of Science, Chulalongkorn University, Bangkok 10330, Thailand. E-mail: arthorn.l at chula dot ac dot th; larthorn at hotmail dot com Education: PhD (Computer Science), University of Essex, UK. MSc (Computer Science), University of Essex, UK. MSc (Analysis, Design, and Management of Information Systems), London School of Economics, UK. BSc (Computer Science), Thammasat University, Thailand. Taught Courses: Distributed Systems; Distributed Database Systems; Introduction to Computer Networks; Information Systems; Software Engineering. Research Interests: Software Engineering; Distributed Systems; IT Management; Outlier Detections Past Consulting Projects: IT Master Plans for Election Commission of Thailand (2020-2025), ongoing Income Management of Leasing Areas for Department of Airports Data Integration Projects for Chulalongkorn University IT Master Plans of Bangkok Vision 2032 for Bangkok Metropolitan Administration IT Master Plans 2014-2018 for Rice Deparment, Ministry of Argiculture and Cooperatives Publications: P. Khanarsa, A. Luangsodsai, and K. Sinapiromsaran, Self-Identification ResNet-ARIMA Forecasting Model, WSEAS Transactions on Systems and Control, Volume 15, 2020. P. Khanarsa, A. Luangsodsai, and K. Sinapiromsaran, Self-Identificatin Deep Learning ARIMA, Journal of Physics Conference Series, 4th International Conference on Mathematical Models & Computational Techniques in Science & Engineering, MMCTSE 2020, London, UK, February 22-24, 2020. C. Peechapol, J. Na-Songkhlad, S. Sujiva, A. Luangsodsai, An Exploration of Factors Influencing Self-Efficacy in Online Learning: A Systematic Review, International Journal of Emerging Technologies in Learning, 2018. C. Peechapol, J. Na-Songkhlad, S. Sujiva, A. Luangsodsai, Development of smartphone application based on the theory of planned behaviour to enhance self-efficacy for online learning, International Journal of Interactive Mobile Technologies, 2018 C. Peechapol, S. Sujiva, A. Luangsodsai, J. Na-Songkhlad, Development of Online Learning Environment Model based on Theory of Planned Behavior to Enhance Learner Self-Efficacy, International Conference on Education, Psychology, and Learning, 2018. W. Kiangia, A. Luangsodsai and K. Sinapiromsaran, Weighted minimum consecutive pair of the extreme pole outlier factor, 2016 International Computer Science and Engineering Conference (ICSEC), Chiang Mai, Thailand, 2016. N. Buthong, A. Luangsodsai, K. Sinapiromsaran, Outlier Detection Score Based on Ordered Distance Difference, In 17th Int. Computer Science and Engineering Conference (ICSEC), 2013. A. Luangsodsai and C. Fox. Concurrent statechart slicing. In Computer Science and Electronic Engineering Conference (CEEC), 2010, Colchester, Essex, UK, September 2010. A. Luangsodsai and C. Fox. Statechart slicing. In 6th Int. Conf. Computer Science and Software Engineering (JCSSE2009), Phuket, Thailand, May 2009. C. Fox and A.Luangsodsai. And-or dependence graphs for slicing statecharts. In Proceedings of the Dagstuhl Seminar Beyond Program Slicing, 2005.",
  "content_length": 3181,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:20"
}