{
  "name": "Arthur Gervais",
  "homepage": "http://arthurgervais.com",
  "status": "success",
  "content": "Arthur Gervais - Professor of Information Security @ UCL | AI for Security Research riddle.exe Daily Challenge I speak in zeros and ones, yet I understand human lies. I learn from patterns hidden, yet I see through disguise. In networks I wander, seeking threats that hide in plain sight. What am I? solution$ Execute research.log Research Areas Our working areas include but are not limited to: AI for Security Developing AI systems that can detect and prevent cyber threats in real-time Blockchains Analyzing smart contracts for vulnerabilities and blockchain security mechanisms Decentralized Finance Understanding DeFi protocols, their security implications, and automated analysis Publications → Google Scholar teaching.course Teaching Blockchain Course Comprehensive blockchain technology course covering fundamentals, security, and applications. Watch on YouTube → DeFi Course Deep dive into Decentralized Finance protocols, mechanisms, and security considerations. Course Website → YouTube Playlist → Academic Paper Writing Guide to writing high-quality academic papers in computer science and security research. Writing Tutorial → phd_application.md PhD? How to Apply • Please send me an email with 3 bullet points listing signs of exceptional achievements. • Out of these, please share 1 sign of splendid technical achievements (maybe you're n°1 on hackthissite.org...). • Those signs do not necessarily have to be related to your or our work; they can be a hobby etc. > The shorter and stronger, the better. cycling_adventures.jpg Cycling Adventures Between debugging code and decoding threats, I find balance on two wheels. 01 10 11 100 101 110 111 1000 1001 1010 1011 1100 1101 1110 1111 contact.sh Contact Institution: University College London (UCL) Department: Computer Science Email: a.gervais@ucl.ac.uk Research Group: Information Security Scholar: Google Scholar Profile ×",
  "content_length": 1891,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:21"
}