{
  "name": "Arto Klami",
  "homepage": "https://www.cs.helsinki.fi/u/aklami",
  "status": "success",
  "content": "Arto Klami Arto Klami Associate Professor (tenure track) in Data Science D.Sc. (Tech)., Docent in Information and Computer Science (Aalto University) I lead the Multi-source probabilistic inference research group at the Department of Computer Science of University of Helsinki. I am also a member of Helsinki Institute for Information Technology HIIT and Finnish Center for Artificial Intelligence (FCAI). Until the end of 2012 I was a postdoctoral researcher at the Department of Information and Computer Science, Aalto University, and between March 2015 and June 2015 I was a Visiting Research Scientist at Amazon Berlin. I conduct research on statistical machine learning and artificial intelligence. More information on ongoing projects, main research themes and highlights, as well as possible open positions, are available on my group web page. In 2011 I organized a PASCAL challenge on MEG Mind Reading. In 2022 I co-chaired ProbAI, the Nordic Probabilistic AI School together with Luigi Acerbi, with publicly available lectures and materials. Contact Postal address: Department of Computer Science, P.O.Box 68, FIN-00014 UNIVERSITY OF HELSINKI, Finland Physical address: Room A344, Exactum, Pietari Kalmin Katu 5, Helsinki Tel: +358-50-582 3654 Email: arto.klami'at'helsinki.fi Teaching (at University of Helsinki) 2021-23 Bayesian machine learning 2021 Seminar on Reinforcement Learning with Chang Rajani and Ville Tanskanen 2016-20 Advanced course in machine learning 2017-20 Data Science Project 2016 Seminar on probabilistic programming with Antti Honkela. 2014 Seminar in probabilistic models for big data with Antti Honkela. Software R implementations for Bayesian canonical correlation analysis and group factor analysis are available in package CCAGFA, and the implementation for collective matrix factorization in package CMF. Publications See Google scholar profile for a complete list of publications. arto.klami@helsinki.fi Last update 4.2.2023",
  "content_length": 1964,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:23"
}