{
  "name": "Arun Rajkumar",
  "homepage": "https://sites.google.com/view/arun-rajkumar",
  "status": "success",
  "content": "Arun RajkumarSearch this siteEmbedded FilesSkip to main contentSkip to navigationArun RajkumarAssistant ProfessorComputer Science and Engineering IIT Madras.Office: SSB-414.Core MemberSchool of Data Science and AI, IIT MadrasEmail: arunr [at] cse [dot] iitm [dot] ac [dot] inI offer an 8 week  NPTEL course on 'Introduction to Machine Learning' in Tamizh. Interested folks can check details here .--------------------------------------------------------------------------------------------------------------Research paper titled 'Byzantine Spectral Ranking' co-authored by  Arnhav Datar and John Augustine has been accepted for publication at  Neurips 2022.I was awarded the Young Faculty Recognition  Award for the year 2022. Arnhav Datar,  a B.Tech student receives the best BTP award for the year 2022. He worked on a Byzantine Ranking problem and was jointly guided by Dr. John Augustine. Research paper titled 'A Theory of Tournament Representations' co-authored by  Abdul Bakey Mir and Vishnu Veerathu has been accepted for publication at ICLR 2022.Program Chair for the RBCDSAI-FCAI Conference on Deployable AI (March 7-10, 2022)Short research paper titled  'Hyper-IMRANK: Ranking-based Influence Maximization for Hypergraphs' co-authored by Athul M.A has been accepted for publication at CODS-COMAD, 2022.Research paper titled 'On The Structure of Parametric Tournaments with Application to Ranking from Pairwise Comparisons' co-authored by Vishnu Veerathu has been accepted for publication at NeurIPS, 2021.Research paper titled 'PaRWiS: Winner Determination from Active Pairwise Comparisons Under a Shoestring budget' co-authored by Dev Yashpal Sheth has been accepted for publication at ICDM, 2021.Athul M. A, a 2021 M.Tech pass out from the lab receives the Prof.H.N.Mahabala Endowment Prize(Best M. Tech. Project Prize). Congratualtions, Athul!Program Chair for the First Conference on Deployable AI (June 16-18, 2021)Dev Yashpal Sheth and I will give a tutorial on Pariwise Preference Learning at PAKDD 2021 on 13th May.I will give an invited talk at the COMSNET MINDS workshop on Jan 5th.Research paper titled 'Sequential Ski Rental Problem' co-authored by Anant Shah has been accepted for publication at AAMAS 2021.I will be presenting a tutorial on Recent Advances in Multiple Facets of Preference Learning at AAAI 2021 .I am co-organizing RBCDSAI's International Summit on Data Science and AI, 2020.Research paper titled 'Censored Semi Bandits: A Framework for Resource Allocation with Censored Feedback' co-authored by Arun Verma, Manjesh Kumar Hanawal and Raman Sankaran has been accepted for publication at NeurIPS, 2019I will be speaking at the 'Data Science in India' ACM event at KDD 2019, Anchorage, Alaska. Research paper titled 'Learning Transferable Feature Representation Using Neural Network' co-authored by HImanshu Sharad Bhatt, Shourya Roy and Sriranjani Ramakrishnan will be presented at ACL-2019 this July.Research paper titled 'Lovasz Convolutional Networks' co-authored by Prateek Yadav, Madhav R Nimishakavi, Naganand Yadati, Shikhar Vashishth and Partha Talukdar will be presented at AISTATS-2019 this April. I joined the Computer Science and Engineering Department of IIT Madras as an Assistant Professor on March 1st, 2019.Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 3312,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:27"
}