{
  "name": "Arun Siddharth Konagurthu",
  "homepage": "https://research.monash.edu/en/persons/arun-konagurthu",
  "status": "success",
  "content": "Arun Konagurthu - Monash University View Scopus Profile Arun Konagurthu Assoc Professor Associate Professor, Department of Data Science & AI https://orcid.org/0000-0002-1610-8329 EmailArun.Konagurthumonashedu Accepting PhD StudentsPhD projects<a href=\"https://supervisorconnect.it.monash.edu/\" onclick=\"target='_blank';\">https://supervisorconnect.it.monash.edu/</a> 20042025 Research activity per year Personal profile BiographyArun Konagurthu is a continuing academic at Monash University, since 2010. He currently serves as the Director of Graduate Research in the Department of Data Science and AI. Between 2016-2019 he served as the Director of the undergraduate Bachelor of Computer Science Degree offered by Monash. Between 2011-2013, he held a Larkins Fellowship at this faculty. Prior to that he held an Eberly College of Science postdoctoral Fellowship at the Pennsylvania State University. His primary research area is Computational Biology and Bioinformatics, statistical learning and information theory. His academic home page is maintained at: http://lcb.infotech.monash.edu.au/~karun His research lab page is maintained at: http://lcb.infotech.monash.edu.au Monash teaching commitmentDr Arun Konagurthu has experience as the Chief Examiner for the following units in the Faculty of IT: FIT3155 Advanced data structures and algorithms (2018- to date)FIT2004 Algorithms and data structures (2014-2017)FIT3139 Computational science (2011-2017) Arun has experience as the Lecturer for the following units in the Faculty of IT: FIT3155 Advanced data structures and algorithms (2018 - to date)FIT2004 Algorithms and data structures (2014-2017)FIT3139 Computational science (2011-2017)FIT4012 Advanced topics in computational science (2016) Education/Academic qualificationComputer Science, Doctor of Philosophy, University of MelbourneAward Date: 15 Jan 2007 Research area keywordsBioinformaticsComputational Biologystatistical learning theoryAlgorithmsInformation Theory Projects Projects per year 2012 2012 2015 2020 2021 3 Finished Projects per year Modelling, synthesis and testing of potential agents against COVID-19 main proteaseKonagurthu, A. (Primary Chief Investigator (PCI)), Lesk, A. (Chief Investigator (CI)), Garcia De La Banda Garcia, M. (Chief Investigator (CI)), Stuckey, P. (Chief Investigator (CI)), Allison, L. (Chief Investigator (CI)) & Abramson, D. (Chief Investigator (CI))15/07/20 → 31/05/21Project: Research Next-generation Protein Structural comparison using Information TheoryKonagurthu, A. (Primary Chief Investigator (PCI)), Garcia De La Banda Garcia, M. (Chief Investigator (CI)), Stuckey, P. (Chief Investigator (CI)) & Lesk, A. (Partner Investigator (PI))4/02/15 → 30/09/19Project: Research Macromolecular InformaticsKonagurthu, A. (Primary Chief Investigator (PCI)) & Garcia De La Banda Garcia, M. (Chief Investigator (CI))1/02/12 → 31/01/16Project: Research Research output Research output per year 2004 2008 2010 2012 2013 2014 2021 2022 2025 29 Article 8 Conference Paper 3 Chapter (Book) 1 Review Article Research output per year Research output per year PhiSiCal-Checkup: A Bayesian framework to validate amino acid conformations within experimental protein structuresAmarasinghe, P. R., Allison, L., Morton, C. J., Stuckey, P. J., de la Banda, M. G., Lesk, A. M. & Konagurthu, A. S., 2 Jan 2025, In: Proceedings of the National Academy of Sciences of the United States of America. 122, 1, 9 p., e2416301121.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile Getting 'ϕψχal' with proteins: minimum message length inference of joint distributions of backbone and sidechain dihedral anglesAmarasinghe, P. R., Allison, L., Stuckey, P. J., García De La Banda, M. G., Lesk, A. M. & Konagurthu, A. S., Jun 2023, In: Bioinformatics (Oxford, England). 39, 39, p. i357-i367 11 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) Sequence and structure alignments in post-AlphaFold eraRajapaksa, S., Konagurthu, A. S. & Lesk, A. M., Apr 2023, In: Current Opinion in Structural Biology. 79, 7 p., 102539.Research output: Contribution to journal › Review Article › Research › peer-review 3 Citations (Scopus) Bridging the gaps in statistical models of protein alignmentSumanaweera, D., Allison, L. & Konagurthu, A. S., 1 Jul 2022, In: Bioinformatics. 38, p. i229-i237 9 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) On the reliability and the limits of inference of amino acid sequence alignmentsRajapaksa, S., Sumanaweera, D., Lesk, A. M., Allison, L., Stuckey, P. J., Garcia De La Banda, M., Abramson, D. & Konagurthu, A. S., Jul 2022, In: Bioinformatics. 38, p. i255-i263 9 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 9 Citations (Scopus) View all 41 research outputs Prizes Larkins Fellow - Faculty of Information Technology, Monash UniversityKonagurthu, A. (Recipient), 1 Jan 2011Prize: Competitive Fellowships Activities Activities per year 2012 2016 2016 4 Professional association or peak discipline body 1 Committees and working groups Activities per year Course Director - Bachelor of Computer Science - Faculty of Information Technology, Monash UniversityKonagurthu, A. (Chair/ Co-Chair)1 Jan 2016Activity: External Academic Engagement › Professional association or peak discipline body Member - Undergraduate Programs Committee - Faculty of Information Technology, Monash UniversityKonagurthu, A. (Member)1 Jan 2016Activity: External Academic Engagement › Committees and working groups Member - Faculty Research Committee - Faculty of Information Technology, Monash UniversityKonagurthu, A. (Member)1 Jan 2016Activity: External Academic Engagement › Professional association or peak discipline body Past Alternate HDR coordinator for Faculty of IT - Monash UniversityKonagurthu, A. (Executive Member)28 Apr 2013Activity: External Academic Engagement › Professional association or peak discipline body Past FIT representative on Faculty of Science Board of Studies - Monash UniversityKonagurthu, A. (Executive Member)22 Jun 2012Activity: External Academic Engagement › Professional association or peak discipline body",
  "content_length": 6286,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:29"
}