{
  "name": "Aruna Tiwari",
  "homepage": "http://www.iiti.ac.in/~artiwari",
  "status": "success",
  "content": "Profile | Dr. Aruna Tiwari News & Updates 1) Consortium Project on AgriHub:Innvoation Hub for Agriculture, led by Prof. Arua Tiwari(PI) and Prof. Pavan Kankar (Co-PI), has been sanctioned by MeitY with total cost of Rs 15 Crores. 2) MoUs signed ICAR-IISR Indore . IIT Indore My research interests are around the Soft computing, Machine learning frameworks which are able to perform learning by handling real life ambiguous situations. Specifically with artificial neural networks, fuzzy clustering, genetic programming and their applications to bioinformatics, medical diagnosis. The growing births of new intelligent system architectures are often due to the multi strategy learning and adaptation of advanced soft computing techniques in various fields such as pattern recognition, and data mining, particularly to address the issues of Big data for classification, clustering and feature selection. Big data computing needs advanced technologies or methods to solve the issues of computational time to extract valuable information, in a realistic and practical time frame, without compromising the models quality. Therefore, the need for developing intelligent scalable algorithms has been felt, which will be able to perform classification, clustering and feature selection in optimal sense after adjusting their parameters in an adaptive way to accomplish faster solutions to address Big data. Collaboration is enable with Soyabean Research Centre, Indore for testing real life big data. To make Soft computing frameworks useful in industry, there is a need to realize these frameworks on hardware. Hardware-based Soft computing models are important to industry as they offer low power consumption and small size compared with PC software and they can be embedded in a wide range of systems. Thus, it originated the need to define high-level descriptions of the Soft computing algorithms with industry standards to allow full simulations & fabrication and to produce demonstrators of the technology for industry. That enables to achieve high speed of information processing. Currently, collaborating with CSIR-Central Electronics Engineering Research Institute, Pilani for the problems related to hardware realization of Soft computing models. Member Professional Bodies: (i) Life member of Computer Society of India. (ii) Senior Member of IEEE Computational Intelligence Society. (iii) Life member of Soft Computing research Society, India. See more External Examinership & Reviews: (i) Approximately 500 Master Thesis examined. (ii) Master Thesis evaluated for University of York UK, IIT Roorkee, IIT Delhi, BHU, MANIT Bhopal, and DA-IICT Gandhinagar. Collaborations: - C-DAC: Centre for Development of Advanced Computing, Pune, India - Council of Scientific and Industrial Research - Central Electronics Engineering Research Institute (CSIR - CEERI) Pilani, - Indian Institute of Soyabean Research (Indian Council of Agriculture & Research), and - University of Technology Sydney Po Box 123, Broadway NSW 2007 Australia - University of York, UK (Dr. Stephen. L. Smith Graduate Admissions Tutor, Department of Electronics, University of York, UK) Home Education Work Experience Research Interests Research Titles for Ph.D. Candidates Responsibilities Achivements Publications PhD Supervision Master Supervision Research scholars Research Fellows Projects Research Facilities Events coordinated Expert Talks Photo Gallery Contact Details Dr. Aruna Tiwari Professor Computer Science and Engineering & PI, CoE:AgriHub artiwari[at]iiti.ac.in pi_agrihub[at]iiti.ac.in Faculty Profile Computer Science and Engineering",
  "content_length": 3618,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:32"
}