{
  "name": "Arup Abhinna Acharya",
  "homepage": "https://cse.kiit.ac.in/profiles/arup-abhinna-acharya",
  "status": "success",
  "content": "Arup Abhinna Acharya - KIIT School of Computer Engineering Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Arup Abhinna Acharya Arup Abhinna Acharya Arup Abhinna Acharya Associate ProfessorDr. Arup Abhinna Acharya is an Associate Professor in the School of Computer Engineering, KIIT Deemed to be University, Bhubaneswar,Odisha, India. He received his Ph.D degree from KIIT Deemed to be University Bhubaneswar in the year 2016. He worked on the title “ Regression Testing of Object-Oriented Systems” under the supervision of Prof. (Dr.) Durga Prasad Mohapatra, National Institute of Technology, Rourkela. In year 2002 , he received his B.Tech. (CSE) degree from Utkal University and in 2006 he received his M.Tech. (CSE) degree from KIIT Deemed to be University. His research areas include Object Oriented Systems, Software Testing, Software Cost Estimation, Security Testing, and Data mining. There are more than forty number of publications are there to his credit in many International and National level journal and proceedings. One student has been awarded Ph.D. degree under his supervision and currently two students are pursuing Ph.D. under his supervision. He is having seventeen years of experience in teaching undergraduate and postgraduate courses. Apart from teaching he holds many administrative positions in the University like the Program Head (Information Technology), Sr.Superintendent of Hostels to name a few. He is a member of ISTE and IET. Profile LinksEmail :[email protected]Google Scholar :https://scholar.google.com/citations?user=ocM4ZaMAAAAJ&hl=en&oi=sra Social LinksProfileRecent PublicationsProfileResearch Interests Object Oriented Systems Software Testing Software Cost Estimation Security Testing and Data mining Administrative ResponsibilityProgram Head (Information Technology)Awards & Honours Received the Best Teacher Award for the year 2013MembershipsISTE, IETRecent Publications sachi2020-06-23T08:04:29+05:30 Page load link Go to Top",
  "content_length": 2033,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:33"
}