{
  "name": "Arup Sarkar",
  "homepage": "https://cse.kiit.ac.in/profiles/arup-sarkar",
  "status": "success",
  "content": "Arup Sarkar - KIIT School of Computer Engineering Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Arup Sarkar Arup Sarkar Arup Sarkar Assistant Professor\"Arup Sarkar, M.E, PhD(Pursuing), is an Assistant Professor of School of Computer Engineering. Before joining KIIT Deemed to be University,Arup Sarkar worked as an Assistant Professor at DIT University, Dehradun. He also previously served as an Assistant Professor at Yamuna Institute of Engineering and Technology ,Yamunanagar,Haryana .He earned his Masters degree at BIT Mesra (2009) Ranchi and B.Tech degree at WBUT,Kolkata. Arup Sarkar also qualified in GATE exam. He joined KIIT School of Computer Engineering in 2015. Arup Sarkar has authored several peer-reviewed publications. His research interests include Blockchain,Information Security,Wireless sensor network,Smart City. \" Profile LinksEmail :[email protected] Social LinksProfileRecent PublicationsProfileResearch Interests Blockchain Information Security Smart City Wireless Sensor Network Administrative Responsibility FIC Seminar Course Co-coordinator of OOSD MembershipsIndian Science congress,IEEERecent PublicationsJournals/Conferences :1.Dipti Dash, Debarshi Kumar Sanyal, Arup Sarkar, Dibyajyoti Guha “A Comparative Study of Two Classical Topology- Transparent Scheduling Algorithms for Multi-Hop Packet Radio Networks”, The IEEE international Conference on Wireless Communications, Signal Processing and Networking (WiSPNET) on March 2016 in Chennai. 2. Prashant Kumar, Rupak Chakraborty and Arup Sarkar have published a paper titled “Robust Object Tracking under Cluttered Environment” in International Journal of Emerging Technology & Advanced Engineering (ISSN 2250-2459, ISO 9001:2008 Certified Journal), Volume 4, Issue 2, February, 2014. 3. Ankit Manchanda and Arup Sarkar Published a Paper titled “RF & IF NOISE BYPASSING ON TWIN GSM CHANNELS ” in International Journal of Science, Engineering and Technology Research (IJSETR), Volume 3, Issue 4, April 2014 4.Ankit Manchanda ,Arup Sarkar & Dr. Sanjay Bhargava Published a Paper titled “Minimizing Noise on Dual GSM Channels Using Adaptive Filters” in International Journal of Research in Information Technology(IJRIT) ISSN 2001-5569. sachi2020-06-24T08:07:33+05:30 Page load link Go to Top",
  "content_length": 2333,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:33"
}