{
  "name": "Arvind Narayanan",
  "homepage": "http://randomwalker.info",
  "status": "success",
  "content": "Arvind Narayanan — Princeton Arvind Narayanan — Princeton Publications Teaching Talks Bio Professor of computer science, Princeton University Director, Center for Information Technology Policy I study the societal impact of digital technologies, especially AI. arvindn@cs.princeton.edu LinkedIn: @randomwalker Twitter/X: @random_walker YouTube: Arvind on AI AI as normal technology AI as Normal Technology is an essay, an ongoing book project, and a newsletter in collaboration with Sayash Kapoor. It is a framework for thinking about AI and its future impacts, and has become the leading intellectual alternative to the view of AI as impending superintelligence. The essay has been reviewed or covered in depth by the Economist, the New Yorker, several times by the NYT, by MIT Tech Review, and many other outlets. The newsletter (previously named AI Snake Oil) is read by 60,000 researchers, policy makers, journalists, and AI enthusiasts. Subscribe here. We were recognized for the newsletter on the inaugural TIME 100 AI list. AI snake oilRead the first chapter online » My book with Sayash Kapoor cuts through AI hype and gives you an essential understanding of how AI works and why it often doesn’t. Get it from Amazon, Bookshop, etc. It is one of Nature's 10 best books of 2024 and one of Forbes's 10 must-read tech books of 2024. The book is based on years of research on limits to prediction, the dangers of predictive decision making, the reproducibility crisis in machine learning based science, the limits of large language models, and the risks of social media algorithms. Algorithmic amplification on social media For 2022-23 I was a visiting senior researcher at Columbia's Knight First Amendment Institute, studying how social media algorithms amplify some speech and suppress others. My capstone essay: Understanding Social Media Recommendation Algorithms. I co-organized a symposium on algorithmic amplification in April 2022 at Columbia University. Watch the videos here. Fairness and ethics in computing » see more I coauthored a textbook on fairness and machine learning, available online. My work was among the first to rigorously show how machine learning reflects racial, gender, and other cultural biases. I've also worked on exposing dark patterns online. Web privacy » see more I led Princeton's Web Transparency and Accountability Project. Through large-scale, automated web measurement, we uncovered how companies collect and use our personal information. Our open-source tool OpenWPM has enabled over 100 studies of web privacy. Cryptocurrencies and blockchains » see more I led the creation of an online course / textbook on cryptocurrencies which has been used in over 150 courses worldwide. My main interest these days is helping shape public policy to counter the harms of cryptocurrency. De-anonymization » see more I've shown how sensitive information can be inferred from seemingly innocuous \"anonymized\" data, ranging from browsing histories to genomes. See this primer of the research and this policy piece on what it means for privacy.",
  "content_length": 3075,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:35"
}