{
  "name": "Aryan Deshwal",
  "homepage": "https://aryandeshwal.github.io",
  "status": "success",
  "content": "Aryan Deshwal Search Aryan Deshwal Assistant Professor University of Minnesota, Twin Cities About me I am an Assistant Professor in the Department of Computer Science and Engineering at University of Minnesota, Twin Cities. I got my PhD in Computer Science at Washington State University where I was very fortunate to be advised by Dr. Jana Doppa. I also spent three wonderful summers as research intern at Meta and Google. My general research interests are in the areas of artificial intelligence (AI) and machine learning (ML) where I focus on advancing foundations of AI/ML to solve challenging real-world problems. The overarching theme of my research program is AI to Accelerate Scientific Discovery and Engineering Design. Specific topics include: Sequential decision-making under uncertainty (Bayesian optimization and Reinforcement learning) in a data-efficient manner. Probabilistic modeling over combinatorial structured data in small supervised data settings. Applications: accelerate the discovery of nanoporous materials for sustainability applications (e.g., carbon capture and storage/separation of gases); accelerate the design of effective, safe, and low-cost drugs/vaccines; and design of high-performance and low-power hardware to overcome Moore’s law. Latest News November 2025 - Paper on AI driven adaptive experimental design for discovering 3D printing configurations accepted to IAAI/AAAI 2026. November 2025 - Paper on offline safe reinforcement learning accepted to NeurIPS 2025. Code November 2025 - Paper on real-world benchmark for high dimensional Bayesian optimization derived from urban mobility accepted to NeurIPS 2025. Code September 2025 - Paper on sample-efficient exploration of accuracy-calibration pareto frontier in language models accepted to EMNLP 2025. Code September 2025 - Tutorial on Black-box Optimization from Offline Datasets accepted at AAAI 2026. September 2025 - Excited to organize the fifth iteration of our Annual AAAI Workshop on AI to Accelerate Science and Engineering (AI2ASE) at AAAI 2026. August 2025 - Co-organized the GenAI4Science Workshop: Integrating Scientific Knowledge into Generative AI at the Univesity of Minnesota. August 2025 - New perspective article on AI enabled scientific revolution capturing the consensus discussed at the second NSF workshop on AI-enabled scientific revolution. Cite × Copy Download",
  "content_length": 2381,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:33"
}