{
  "name": "Arye Nehorai",
  "homepage": "https://www.ese.wustl.edu/~nehorai",
  "status": "success",
  "content": "Professor Arye Nehorai FACULTY PROFILE RESEARCH PUBLICATIONS STUDENTS & VISITORS TEACHING DEPARTMENT CHAIR NEWS PERSONAL GALLERY USEFUL LINKS ST. LOUIS CONTACT & DIRECTIONS nehorai. at .wustl.edu ph # 314-935-7520 fax # 314-935-7500 Green Hall, Room 2160C Campus Box 1042-207-1101 One Brookings Drive St. Louis, MO 63130 USA Ph.D. Electrical Engineering Stanford University, 1983 M.Sc. Electrical Engineering Technion, Israel, 1979 B.Sc. Electrical Engineering Technion, Israel, 1976 The Eugene & Martha Lohman Emeritus Professor of Electrical Engineering,WUSTL, since 2023 The Eugene and Martha Lohman Professor of Electrical Engineering, inaugural holder, WUSTL, 2006 to 2023 Chair, Preston M. Green Department of Electrical & Systems Engineering,WUSTL, January 2006 to June 2016 Professor (joint/courtesy appointments), Division of Biology and Biomedical Sciences (DBBS), Division of Biostatistics, Department of Biomedical Engineering, and Department of Computer Science and Engineering, WUSTL. Director, Center for Sensor Signal and Information Processing,WUSTL, since 2006 Fellow of the IEEE (since 1994), Life Fellow of the IEEE (since 2017), Fellow of the AAAS (since 2012), Fellow of the Royal Statistical Society (since 1996), Fellow of the Asia-Pacific Artificial Intelligence Association (AAIA) (since 2021) Recipient, 2009 Meritorious Service Award,IEEE Signal Processing Society Recipient, 2006 Technical Achievement Award,IEEE Signal Processing Society Distinguished Lecturer, IEEE Signal Processing Society,2004-2005 Recipient, University Scholar Award, University of Illinois, 2001-2004 Recipient, Sustained Impact Paper Award,IEEE Signal Processing Society, 2022 Co-author of Young Author Best Paper Award,IEEE Signal Processing Society, 2003, 2019 Recipient, Magazine Paper Award,IEEE Signal Processing Society, 2004 Recipient, Senior Award for Best Paper,IEEE Signal Processing Society, 1989 Co-author of best paper awards in student competitions,IEEE CAMSAP, 2013; WDD, 2012; Asilomar Conf., 2010; IEEE Radar Conf., 2010; WDD, 2010; and IEEE ICASSP, 2006 Member of the Board of Governors and Executive Committee,IEEE Signal Processing Society,January 2003 to December 2005 Chair of the Publications Board, IEEE Signal Processing Society,January 2003 to December 2005 Vice President (Publications), IEEE Signal Processing Society,January 2003 to December 2005 Founding Editor, Special Columns on Leadership Reflections,IEEE Signal Processing Magazine,2003-2006 Chair, Electrical and Computer Engineering Division,UIC, 2001-2002 Editor-in-Chief, IEEE Transactions on Signal Processing,January 2000 to December 2002 Co-General Chair, First and Second IEEE SAM Workshops, 2002 and 2004 Chair and Co-founding Member, Technical Committee on Sensor Array and Multichannel (SAM), Processing,IEEE Signal Processing Society, 2000-2002 Associate Editor of five IEEE journals and three others,from 1987 Principal Investigator, Multidisciplinary University Research Initiative (MURI) grant on Adaptive Waveform Design for Full Spectral Dominance, including eight universities and a company,DOD/AFOSR, 2005-2010",
  "content_length": 3118,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:36"
}