{
  "name": "Ashikur Rahman",
  "homepage": "http://ashikur.buet.ac.bd",
  "status": "success",
  "content": "Wireless ad hoc networks CSE 6811: Wireless Ad hoc Networks Instructor Dr. Ashikur Rahman E-mail: ashikur@cse.buet.ac.bd Prerequisites Basic Computer Networks (CSE 401 or equivalent) and Consent of the instructor. Lectures MON 5:30-8:00 pm CSE 504 Notice Class begins from May 13, 2013 Monday 20/05/2013: Today's class will be in Room No. CSE 504 26/05/2013: No class tomorrow May the 27th as I am heavily sick. Office hours TBA Required Text There is no required text for this course. Although a book titled \"Ad-hoc Wireless Networks\" by C Siva Ram Murty and B S Manoj is available. The course is based exclusively on a collection of required research paper readings that are available on-line. Additional notes are provided by the instructor. Course Objective This course is an advanced research-oriented course specially designed for graduate students. We will cover various topics relevant to a cutting-edge technology, namely, Wireless Mobile Ad Hoc Networks (MANETs). Upon completion of this course, a student will learn the state of the art researches on MANETs and enhance their potential to perform research in this new exciting area. Evaluation The final grade of this course will be evaluated by the following weighted combination: (a) Mid term Examination: 30% (b) Final Examination: 35% (c) Project (total): 25% (i) Presentation: 10% (ii) Findings and reports: 15% (d) Class participation: 10% Notes: (1) Exams are based on the required readings presented in the class. (2) Projects are group works and each group consists of a certain number of student members. The number of students allowefd in a group will be announced later. Group members are chosen by the students themselves based on mutual understandings and must be approved by the instructor. The project topics will be supplied by the instructor once the groups are formed. Projects are mostly survey type focusing on a particular topic.  A synthesis of the survey must be presented in the class starting from 10th weeks of the classes. Some projects might require simulations to be performed. A project report needs to be submitted at the end of the term. Grades Look at the following chart for a quick conversion: 90-100% A+ 4.0 80-89% A 3.5 70-79% B+ 3.0 60-69% B 2.5 50-59% C 2.0 0-49% F 0.0 Note that this is an approximate conversion chart and the mark/grade conversion may fluctuate a few % for any given class of students. Lecture Slides Introduction to Ad hoc wireless networks Broadcast Introduction Broadcast Storm Problem Self Pruning and Dominant pruning Lecture Notes Introduction reading material Papers that will be Covered in the class (it might get updated as needed) Unicast Routing protocols : DSR , AODV , DSDV . Broadcasting protocols : Broadcast storm problem , Multicast Tree construction and flooding... , Reducing Broadcast redundency [1], Reducing Broadcast redundency [2], MAC protocols : IEEE 802.11 (Read only DCF) , Hidden Problems with hidden node problem , MACA-P: Concurrent transmission ,  RTS/CTS induced congestion ,(m) DoS Attack , ()Power control protocols : MAC-Assisted Topology Control , Minimum Energy Revisited , Project topics: (Topic 1) Swarm intelligence for routing in ad hoc wireless networks 0413052013 Naila Bushra, 0413052025 Nursat Jahan, 0413052057 Nushrat Humaira (Presentation: August 18) Sample paper: ARA-the ant-colony based routing algorithm for MANETs (Topic 2) Challenges in vehicular ad hoc networks (VANETs) 0413052017 Shamim Ahmed, 0413052087 Nadia Akbar Tumpa, 0413052099 Deloara Khushi (Presentation: August 26) Sample paper: Vehicle ad hoc networks: Applications and related technical issues (Topic 3) Issues for routing in vehicular ad hoc networks (VANETs) 0412052004 Fatema Tuz Zohra, 0412052013 Md Hasan Tareque, 0412052017 Ahmed Shoeb Al Hasan (Presentation: August 26) Sample paper: Routing in Vehicular Ad Hoc Networks: A Survey (Topic 4) Delay bounded routing in VANETS 0413052039 Md. Khaledur Rahman, 0413052020 Dipon Lal Shaw (Presentation: August 26) Sample paper: Delay bounded routing in Vehicular Ad Hoc Networks (Topic 5) Mobility aware data dissemination in VANETS 0411052052 Md. Mahbub Alam, 0412052006 Rabeya Zaman, 0412052026 Shamim Ahmed (Presentation: August 26) Sample paper: MDDV: A Mobility-Centric Data Dissemination Algorithm for Vehicular Networks (Topic 6) Coverage algorithms in visual sensor networks 0413052054 Khalid Bin Sarower, 0413052009 Md. Ali Hossain (Presentation: August 18) Sample paper: Coverage algorithms in visual sensor networks Project Report Guideline: Project guideline",
  "content_length": 4561,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:38"
}