{
  "name": "Ashiqur R. KhudaBukhsh",
  "homepage": "https://www.rit.edu/directory/axkvse-ashique-khudabukhsh",
  "status": "success",
  "content": "Ashique KhudaBukhsh | RIT RIT Logo with Text Ashique KhudaBukhsh Assistant Professor Department of Software Engineering Golisano College of Computing and Information Sciences khudabukhsh@mail.rit.edu Ashique KhudaBukhsh Assistant Professor Department of Software Engineering Golisano College of Computing and Information Sciences Education Ph.D., Carnegie Mellon University Bio Ashique KhudaBukhsh is an Assistant Professor in the Software Engineering Department and is affiliated with the ESL Global Cybersecurity Institute, where he directs the Social Insight Lab. Dr. KhudaBukhsh's current research lies at the intersection of natural language processing (NLP) and AI for Social Impact, as applied to: (i) globally important events arising in linguistically diverse regions, requiring methods to tackle practical challenges involving multilingual, noisy, social media texts; (ii) polarization in the context of the current US political crisis; and (iii) auditing generative AI systems and platforms for unintended harms. In addition to having his research accepted at top artificial intelligence conferences and journals, his work has also received widespread international media attention, including coverage from The New York Times, BBC, Wired, Times of India, The Indian Express, The Daily Mail, VentureBeat, and Digital Trends.Dr. KhudaBukhsh has been selected for the New Faculty Highlight program at AAAI 2024 and was the recipient of the RIT GGCIS Emerging Scholar Award in 2023. He enjoys melding teaching and research and, in 2022, he offered a course that studied contemporary US politics through the lens of cutting-edge AI and NLP techniques. This course was offered simultaneously at RIT and CMU (team-taught with Dr. Mark Kamlet, a noted political scientist), and students from both schools conducted collaborative research. KhudaBukhsh received his PhD in artificial intelligence in 2017 from Carnegie Mellon University (CMU) and started his tenure-track position at RIT in 2021. khudabukhsh@mail.rit.edu Personal Links Personal Website Google Scholar Areas of Expertise Machine Learning Natural Language Processing AI for Social Impact Computational Social Science Currently Teaching DSCI-601Applied Data Science I3 CreditsThis is the first of a two course applied data science seminar series. Students will be introduced to the data science masters program along with potential projects which they will develop over the course of this series in con-junction with the applied data science directed studies. Students will select a project along with an advisor and sponsor, develop a written proposal for their work, and investigate and write a related work survey to refine this proposal with their findings. Students will begin preliminary design and implementation of their project. Work will be presented in class for peer review with an emphasis on developing data science communication skills. This course will keep students up to date with the broad range of data science applications.DSCI-602Applied Data Science II3 CreditsThis is the second of a three course applied data science seminar series. Students will design an implementation plan and preliminary documentation for their selected applied data science project, along with an in class presentation of this work. At the end of the semester students will present preliminary demos of their project and write a preliminary project report. Writing and presentations will be peer reviewed to further enhance data science communication skills. This course will keep students up to date with the broad range of data science applications.DSCI-790Independent Study1 - 3 CreditsThis course provides the graduate student an opportunity to explore an aspect of data science independently and in depth, under the direction of an advisor. The student selects a topic and then works with a faculty member to describe the value of the work and the deliverables.SWEN-780Capstone Research Project3 - 6 CreditsThis course provides the student with an opportunity to explore a project-based research experience that advances knowledge in that area. The student selects a research problem, conducts background research, develops the system, analyses the results, and builds a professional document and presentation that disseminates the project. The report must include an in-depth research report on a topic selected by the student and in agreement with the student's adviser. The report must be structured as a conference paper, and must be submitted to a conference selected by the student and his/her adviser.SWEN-790Thesis6 CreditsThis course provides the student with an opportunity to execute a thesis project, analyze and document the project in thesis document form. An in-depth study of a software engineering topic will be research focused, having built upon the thesis proposal developed prior to this course. The student is advised by their primary faculty adviser and committee. The thesis and thesis defense is presented for approval by the thesis adviser and committee.SWEN-799Independent Study3 - 6 CreditsThis course provides the graduate student an opportunity to explore an aspect of software engineering in depth, under the direction of an adviser. The student selects a topic, conducts background research, develops the system, analyses results, and disseminates the project work. The report explains the topic/problem, the student's approach and the results. (Completion of 9 semester hours is needed for enrollment) In the News November 7, 2025 Presidential Office says discussions still underway on finalizing S. Korea-U.S. joint fact sheet Ashique KhudaBukhsh, assistant professor in the Department of Software Engineering, appeared on Arirang News, a Korean broadcasting station, for a discussion about Nvidia and Korea’s partnership in the artificial intelligence race. September 26, 2025 University leaders gathering for inauguration tackle important questions facing academia University presidents and leaders from across academia gathered in Rochester to discuss the rapidly shifting landscape of higher education. The distinguished experts noted how universities at the center of this change—including RIT—can use headwinds as opportunities to propel forward. September 2, 2025 AI chatbots are creating more hateful online content ABC News speaks to Ashique KhudaBukhsh, assistant professor in the Department of Software Engineering, about how AI chatbots can be manipulative. November 19, 2025 Tupakula and KhudaBukhsh publish in &#039;INFORMS Journal on Computing&#039; November 12, 2025 KhudaBukhsh recognized with Outstanding Senior Area Chair Award February 28, 2025 KhudaBukhsh publishes on media coverage of policing January 19, 2024 KhudaBukhsh findings featured by Montreal AI Ethics Institute More News Search RIT Close  X This website uses cookies to provide better user experience and functionality. You can control and configure cookies in your web browser. Cookie Statement | How to Disable Cookies OK",
  "content_length": 7011,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:40"
}