{
  "name": "Ashish Venkat",
  "homepage": "http://www.cs.virginia.edu/venkat",
  "status": "success",
  "content": "Ashish Venkat Toggle navigation Ashish Venkat News Students Papers Teaching Bio Curriculum Vitae Ashish Venkat Associate Professor Department of Computer Science University of Virginia Office: Rice 312 Email: <lastname>@virginia.edu My research interests lie broadly in Computer Architecture, Compilers, and Computer Security. My research explores novel and cross-disciplinary hardware and software techniques to design secure systems that offer robust exploit mitigations, while maintaining high levels of performance, energy efficiency, and programmability. I'm also interested in applying novel machine learning techniques to detect and mitigate security threats, model dynamic execution behavior, and provide efficient hardware/runtime support to enable the seamless adoption of highly heterogeneous platforms and emerging computing paradigms. News 2025 Honored to have been recognized at UVA's university-wide Sixth Annual Research Achievement Awards through a nomination from the Dean of Engineering for making substantial contributions to the field of study, influencing the academic community, or having a positive impact on society. 2024 Our paper on Ceviche, a novel capability-based secure cache design has been accepted to IEEE Security and Privacy (S&P 2025), at an acceptance rate of 14%! Our paper on securing large monolithic and heterogeneous systems has been accepted to the Special Session on Security-By-Design at the Embedded Systems Week with visioning talks from research groups headed by Todd Austin, Guru Venkataramani, Sai Manoj Pudukotai, and myself. Our paper on modeling and benchmarking for digital PIM architectures has been accepted to IISWC 2024. We received a DARPA award on HERCULES: Hardware-Enhanced Resilient Compartmentalization and Program Analysis for Upgraded Legacy Environment Security. The total award amount is $4.9 million dollars with UVA as the prime (myself as the PI and Jack Davidson as the co-PI), in collaboration with UC Riverside and UC Irvine as subcontractors. Thanks to DARPA for the generous funding! Honored to have been recognized for outstanding research and scholarship at UVA's university-wide Fifth Annual Research Achievement Awards (National Recognition Category). 2023 My student Lingxi Wu (co-advised with Kevin Skadron) successfully defended his Ph.D. dissertation. He will be joining Open Sesame as an architect. My student Uday Kiran successfully obtained his Master's degree in Computer Science. He will be joining AMD as a Staff Engineer. Honored to have appeared in the list of prolific authors at ISCA for the decade 2013-2022, put together as part of the retrospective on Fifty Years of ISCA! Thanks to my amazing co-authors, who I have been fortunate to collaborate with! Our paper on leveraging processing-with-storage-technology (PWST) to accelerate k-mer counting has been accepted to appear in the ACM Transactions on Architecture and Code Optimization journal (ACM TACO). My student Alenkruth Krishnan Murali's paper on Core Fuzzing has been accepted to SRC TECHCON 2023! My students Lingxi Wu and Rahul Sreekumar put together an amazing set of presentation materials (Slides, Video, Poster) describing our DATE 2023 work on New Hardware Trojans in Neuromorphic Architectures that has been nominated for the Best Paper Award! Received the prestigious NSF CAREER award! Thanks to NSF for the generous support! 2022 My student Conner Ward successfully defended his Master's thesis on Speculative Vector Widening! Congratulations to Conner! Our paper on Hardware Trojan threats in eNVM devices has been accepted to DATE 2023, and has been nominated for Best Paper Award! My student Logan Moody gave an excellent talk on our work on Speculative Code Compaction in Chicago, at MICRO 2022. Our MICRO 2022 paper has been awarded all three artifact badges (Available, Functional, Reproduced)! Our codebase is now available on GitHub! I have been invited to participate in CRA's Computing Community Consortium (CCC) visioning workshop on Mechanism Design for Improving Hardware Security organized by Simha Sethumadhavan and Tim Sherwood! Thanks for the extremely invigorating brainstorming sessions! Our paper on DRAM-CAM, an architecture for General-Purpose Bit-Serial Exact Pattern Matching, has been accepted to IEEE Computer Architecture Letters Our paper on Speculative Code Compaction (SCC) has been accepted to appear in MICRO 2022!. SCC is an aggressive microarchitectural optimization that is able to leverage speculatively identified program invariants to accelerate inherently sequential and statically compile-time optimized code, without the need for profiling, compiler metadata, or other source-level information. We have been awarded a large NSF PPoSS grant to pursue research on co-designing Hardware, Software, and Algorithms to Enable Extreme-Scale Machine Learning Systems. Thanks to NSF for the generous support! Our paper on ProxyVM, a privacy-preserving machine learning framework, has been accepted at SRC TECHCON 2022! We have been awarded an NSF CCRI grant to pursue research on a scalable Hardware and Software Environment Enabling Secure Multi-party Learning. Thanks to NSF for the generous support! 2021 SRC contract awarded for our work on privacy-preserving machine learning, with Intel Labs and IBM Research as our industry liaisons. Thanks to SRC, Intel, and IBM for the generous support! Our paper on CHEx86, a transparent and high performance memory safety solution, has been recognized as a 2021 Top Pick in Hardware and Embedded Security, among hardware security conference papers that have appeared in the last 6 years (2015-2020) in leading architecture, security, and VLSI design conferences. Our USENIX Security 2022 paper has been awarded all three artifact badges (Available, Functional, Reproduced)! Our codebase is now available on GitHub! Our paper on secure SMT architectures got accepted to USENIX Security 2022! Our proof-of-concept exploit code for our transient execution attack variants that exploit the micro-op cache is now available on Github. My students, Xida Ren, Logan Moody, and Lingxi Wu, put together excellent video presentations (links below) for the upcoming ISCA 2021 global virtual conference. Our work on the micro-op cache vulnerability has been covered widely by a number of global technology news and mainstream media outlets! Our group shines again at the 2021 Annual Computer Science Department Awards Ceremony! Congratulations to Xida Ren for winning the Graduate Service Award and to Joey Rudek for winning the Louis T. Rader Undergraduate Teaching Award! My students, Xida Ren and Logan Moody, gave an excellent talk at Intel labs on their recent ISCA work -- I See Dead µops, a novel transient execution attack that exploits Intel/AMD µop caches to leak secrets. Two papers accepted to ISCA 2021! 2020 Our Spectre mitigation paper on Context-Sensitive Fencing has been selected as a 2020 Top Pick in Hardware and Embedded Security, among hardware security conference papers that have appeared in the last 6 years (2014-2019) in leading architecture, security, and VLSI design conferences. My student, Layne Berry, presented our work on speculative superoptimization at SRC TECHCON 2020. Our research on Composite-ISA Cores has been covered by Coreteks, in the article \"AMD Master Plan Pt. 2 -- Heterogeneous Revolution\"! Received an NSF REU supplement award to our FoMR grant to support undergraduate research. Thanks to NSF for the generous support! I gave a virtual tech talk to Intel Labs and the FoMR community, on our work on superoptimization. My student, Rasool Sharifi, gave an excellent talk about our work on CHEx86 at ISCA 2020! Our research group shines at the 2020 Annual Computer Science Department Awards Ceremony! Congratulations to Layne Berry for winning two awards -- the Louis T. Rader Undergraduate Research Award and the Louis T. Rader Outstanding Undergraduate Student Education Award! Congratulations to Ishika Paul for winning the Outstanding Graduate Student Teaching Award! Paper on CHEx86, a microcode-based capability machine accepted to ISCA 2020! Paper on the Packet Chasing attack accepted to ISCA 2020! I'm serving as the Student Travel Grant Chair for HPCA 2020. I have been awarded an NSF grant to support student travel to the conference. Thanks to NSF for the generous support! 2019 Congratulations to my student, Layne Berry, who has been recognized nationally as one of CRA's Outstanding Undergraduate Researcher Award Honorable Mention recipients! I will be providing teaching mentorship to my student, Ishika Paul, under the Engineering Graduate Teaching Internship (GTI) program in Spring 2020. Presented our work on microcode customization at University of Cambridge, UK. Attending the NSF SaTC 2019 PI Meeting at Alexandria, VA. We expose yet another new vulnerability in Intel CPUs, in our paper on Packet Chasing -- verfied by Intel (CVE-2019-11184)! NSF/Intel FoMR Grant awarded: Speculative Superoptimization -- Boosting Performance via Speculation-Driven Dynamic Binary Optimization. Thanks to NSF and Intel for their generous support! Paper on ML-based scheduling accepted at SAMOS 2019! My first mentee, Kazem Taram, gave an amazing talk about our Spectre mitigation, Context-Sensitive Fencing, at ASPLOS 2019! Presented our work on Heterogeneous-ISA architectures at NC State University. Composite-ISA Cores recognized as the best paper runner-up at HPCA 2019! Presented our work on Composite-ISA Cores at HPCA 2019. Our work on Microcode Customization has been recognized as an IEEE Micro Top Pick of all Computer Architecture conferences held in 2019! 2018 NSF SaTC CRII Grant awarded: Mitigating Microarchitectural Attacks via Microcode Customization!. Thanks to NSF for the generous support! Paper on Spectre mitigation accepted to ASPLOS 2019! Paper on Composite-ISA Cores accepted to HPCA 2019! DARPA SSITH subcontract awarded for our microcode customization work. Thanks to DARPA for their",
  "content_length": 20429,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:42"
}