{
  "name": "Ashok Samal",
  "homepage": "http://cse.unl.edu/~samal",
  "status": "success",
  "content": "Ashok Samal | Dr. Ashok Samal Professor Ashok Samal 359 Avery Hall Phone: (402) 472-2217 FAX: (402) 472-7767 e-mail: samal at cse dot unl dot edu Research Summary Selected Publications Teaching Useful Links Research Summary Image Understanding: In the area of image understanding my focus has been in face processing and document image analysis. While much of the research community has focused on recognition of the face, I have focused on extracting the full complement of the information from the face (identify, gender, expression, attractiveness). My research has made contributions in the applications where the appearance of the face is either unclear or is unavailable. Using a landmark based approach, we have developed techniques to match faces, sketches, and faces of parents and children. My research in document image analysis centers on engineering drawings, topographic maps, and mixed mode documents. Extraction of high level information from documents is a significant challenge and is critical to archival and semantic analysis.  We have developed algorithms to extract underlying semantic structures from these three classes of documents. Geospatial Data Analysis and Spatial Data Mining: Parsing the spatial organization to derive higher level features is a difficult challenge in geographic computation. We have developed techniques to extract these structures in their geographic contexts and exploit them for important problems including conflation and satellite image retrieval. My contribution in spatial data mining has been in explicitly incorporating the properties of the geographic space into the clustering algorithms; traditional clustering techniques are ineffective in the geospatial domain. Selected Publications Image Understanding Joyita Mallik, Ashok Samal and Scott L. Gardner. A Content Based Image Retrieval System for a Biological Specimen Collection. Submitted to Computer Vision and Image and Understanding, January 2010. Ramalingamurthy Meduri, Ashok Samal, and Scott L. Gardner. ParasiteWeb: Web Based Framework for Content Based Image Retrieval System for HWML Parasite Collection. Accepted for publication in Occasional Papers of the Museum, August 2008. Sarvani Kare, Ashok Samal and David Marx.  Face Recognition using Bidimensional Regression. Machine Vision and Applications, Vol. 19, No. 1. 2008 Sudhindra Shukla and Ashok Samal. Recognition and Quality Assessment of Data Charts in Mixed Mode Documents. Accepted for publication to International Journal of Document Analysis and Recognition, April 2008. Govinda Konda Naganathan, Jeyam Subbiah, and Ashok Samal. Visible/Near-Infrared Hyperspectral Imaging for Beef Tenderness Prediction.  Computers and Electronics in Agriculture, Available online on 7 July 2008. Debasis Chaudhuri and Ashok Samal.  An Automatic Bridge Detection Technique for Multi-spectral Images. IEEE Transactions in Geosciences and Remote Sensing, Vol. 46, No, 9, pp. 2720-2727, September 2008. Kendra Schmid, David Marx and Ashok Samal.  Computation of a Face Attractiveness Index Based on Neoclassical Canons, Symmetry, and Golden Ratios.  Pattern Recognition, Vol. 41, No. 8, pp. 2710-2717, August 2008. Debasis Chaudhuri and Ashok Samal. A Simple Method for Fitting Bounding Rectangle to Closed Regions. Pattern Recognition, Vol. 40, No. 7, pp. 1981-1989, 2007. Dongsheng Zhang, James R. Brandle, and Ashok Samal. A Method for Estimating Fractal Dimension of Tree Crowns from Digital Images. International Journal of Pattern Recognition and Artificial Intelligence, Vol. 21, No. 3, pp. 543-559, 2007 Jiazheng Shi, Ashok Samal and David Marx. Face Recognition Using Landmark-based Bidimensional Regression. Computer Vision and Image Understanding, Vol.102, No. 2, pp. 117-133, 2006. Geospatial Data Analysis and Spatial Data Mining Deepti Joshi, Leen-Kiat Soh and Ashok Samal, Redistricting Using Heuristic-Based Polygonal Clustering,  IEEE International Conference on Data Mining (ICDM’2009), Miami, FL, December 6-9, 2009. Deepti Joshi, Leen-Kiat Soh and Ashok Samal, A Dissimilarity Function for Clustering Geospatial Polygons,  Proceedings of 17th ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems (ACM-GIS), Seattle, WA, November 2009. D. Joshi, A. K. Samal, and L. K. Soh, Density-Based Clustering of Polygons, IEEE Symposium Series on Computational Intelligence and Data Mining, 2009, pp: 171-178. Tao Hong, Ashok Samal, and Leen-Kiat Soh. Computing Information Gain for Spatial Data Support. 16th ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems (ACM-GIS), Irvine, CA, November 2008. Kendra Schmid, David Marx and Ashok Samal. Weighted Bidimensional Regression. Accepted for publication in Geographical Analysis), 2009. Leen-Kiat Soh, Ashok Samal and Lei Fu.  Techniques for Computing Fitness of Use (FoU) for Time Series Datasets with Applications in the Geospatial Domain.  Geoinformatica, Volume 12, No. 1, pp. 73-89, March 2008. A. Samal and S. Seth. Abstract Feature Extraction from Remotely Sensed Images of Urban Areas. in Encyclopedia of Geographic Information Systems. Eds. S. Shekhar and H. Xiong.  Springer, 2008, pp. 314-320. Tao Hong, Ashok Samal, and Leen-Kiat Soh. Computing Information Gain for Spatial Data Support. ACM-GIS, November 2008. A. Kerby, D. Marx, Ashok Samal, and V. Adamchuck. Spatial Clustering Using the Likelihood Function. Seventh IEEE International Conference on Data Mining, Workshop on Spatial and Spatio-Temporal Data Mining, Omaha, NE, pp. 637-642, October 2007. Ashok Samal, Sharad Seth and Kevin Cueto. A Feature-Based Approach to Conflation of Geospatial Sources. International Journal of Geographic Information Science, Vol.18, No. 3, pp. 459-490, 2004. Course Information I normally teach the following courses. CSCE 473/873: Introduction to Computer Vision CSCE 474/874: Introduction to Data Mining CSE Graduate Program",
  "content_length": 5924,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:42"
}