{
  "name": "Ashraf Aboulnaga",
  "homepage": "https://ashraf.aboulnaga.me",
  "status": "success",
  "content": "Ashraf Aboulnaga Ashraf Aboulnaga Professor Department of Computer Science and Engineering University of Texas at Arlington [Research] [Students] [Publications] [Teaching] [Scientific Activities] Office: Engineering Research Building (Room 622B), 500 UTA Blvd., Arlington, TX Phone: +1 (817) 272-3716 E-mail: firstname.lastname@uta.edu Mailing Address: For postal mail and package deliveries Short bio / Detailed CV Research I am a Professor in the Department of Computer Science and Engineering at the University of Texas at Arlington. Prior to joining UTA, I was the Chief Scientist of the Qatar Computing Research Institute (QCRI), an Associate Professor at the University of Waterloo, and a Research Staff Member at the IBM Almaden Research Center. My research is in the area of databases, with a current focus on the following topics: Machine learning on graph data. Data infrastructure for AI. Cloud-native database systems. Large-scale graph analytics. Ph.D. Students (Former Students) Fatima Farooq Fahim Shahriar Khan Abdalla Mohamed Humera Sabir Selected Publications (Complete List | DBLP | Google Scholar) Fahim Shahriar Khan and Ashraf Aboulnaga. A Vision for SQL-Based Relational Deep Learning. International Workshop on Tabular Data Analysis (TaDA '25), London, United Kingdom, September 2025. Publisher's version Yifei Yang, Xiangyao Yu, Marco Serafini, Ashraf Aboulnaga, and Michael Stonebraker. FlexpushdownDB: Rethinking Computation Pushdown for Cloud OLAP DBMSs. The VLDB Journal (VLDBJ), volume 33, number 5, pages 1643-1670, September 2024. Publisher's version Chaoyi Ruan, Yingqiang Zhang, Chao Bi, Xiaosong Ma, Hao Chen, Feifei Li, Cheng Li, Ashraf Aboulnaga, and Xinjun Yang, Yinlong Xu. Persistent Memory Disaggregation for Cloud-Native Relational Databases. Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS '23), Volume 3, Vancouver, Canada, pages 498-512, March 2023. Publisher's version Ghadeer Abuoda, Saravanan Thirumuruganathan, and Ashraf Aboulnaga. Accelerating Entity Lookups in Knowledge Graphs Through Embeddings. IEEE International Conference on Data Engineering (ICDE '22), Virtual Conference, pages 1111-1123, May 2022. Publisher's version Aisha Mohamed, Ghadeer Abuoda, Abdurrahman Ghanem, Zoi Kaoudi, and Ashraf Aboulnaga. RDFFrames: Knowledge Graph Access for Machine Learning Tools. The VLDB Journal (VLDBJ), volume 31, number 2, pages 321-346, March 2022. Publisher's version Special issue on big graph data management and processing. Aisha Mohamed, Shameem A. Parambath, Zoi Kaoudi, and Ashraf Aboulnaga. Popularity Agnostic Evaluation of Knowledge Graph Embeddings. Conference on Uncertainty in Artificial Intelligence (UAI '20), Virtual Conference, pages 1059-1068, August 2020. Publisher's version Xiaowei Zhu, Marco Serafini, Xiaosong Ma, Ashraf Aboulnaga, Wenguang Chen, and Guanyu Feng. LiveGraph: A Transactional Graph Storage System with Purely Sequential Adjacency List Scans. Proceedings of the VLDB Endowment (PVLDB), volume 13, number 7, pages 1020-1034, March 2020. Presented at the International Conference on Very Large Data Bases (VLDB '20), Virtual Conference, August 2020. Publisher's version Ghadeer Abuoda, Gianmarco De Francisci Morales, and Ashraf Aboulnaga. Link Prediction via Higher-Order Motif Features. European Conference on Machine Learning and Knowledge Discovery in Databases (ECML/PKDD '19), Würzburg, Germany, pages 412-429, September, 2019. Publisher's version Junjay Tan, Thanaa Ghanem, Matthew Perron, Xiangyao Yu, Michael Stonebraker, David J. DeWitt, Marco Serafini, Ashraf Aboulnaga, and Tim Kraska. Choosing a Cloud DBMS: Architectures and Tradeoffs. Proceedings of the VLDB Endowment (PVLDB), volume 12, number 12, pages 2170-2182, August 2019. Presented at the International Conference on Very Large Data Bases (VLDB '19), Los Angeles, California, USA, August 2019. Publisher's version Rebecca Taft, Nosayba El-Sayed, Marco Serafini, Yu Lu, Ashraf Aboulnaga, Michael Stonebraker, Ricardo Mayerhofer, and Francisco Andrade. P-Store: An Elastic Database System with Predictive Provisioning. ACM SIGMOD International Conference on Management of Data (SIGMOD '18), Houston, Texas, USA, pages 205-219, June 2018. Publisher's version Ahmed El-Roby and Ashraf Aboulnaga. UFeed: Refining Web Data Integration Based on User Feedback. ACM International Conference on Information and Knowledge Management (CIKM '17), Singapore, pages 187-196, November 2017. Publisher's version Marco Serafini, Rebecca Taft, Aaron J. Elmore, Andrew Pavlo, Ashraf Aboulnaga, and Michael Stonebraker. Clay: Fine-Grained Adaptive Partitioning for General Database Schemas. Proceedings of the VLDB Endowment (PVLDB), volume 10, number 4, pages 445-456, December 2016. Presented at the International Conference on Very Large Data Bases (VLDB '17), Munich, Germany, August 2017. Publisher's version Carlos H. C. Teixeira, Alexandre J. Fonseca, Marco Serafini, Georgos Siganos, Mohammed J. Zaki, and Ashraf Aboulnaga. Arabesque: A System for Distributed Graph Mining. Symposium on Operating Systems Principles (SOSP '15), Monterey, California, USA, pages 425-440, October 2015. Publisher's version Rebecca Taft, Essam Mansour, Marco Serafini, Jennie Duggan, Aaron J. Elmore, Ashraf Aboulnaga, Andrew Pavlo, and Michael Stonebraker. E-Store: Fine-Grained Elastic Partitioning for Distributed Transaction Processing. Proceedings of the VLDB Endowment (PVLDB), volume 8, number 3, pages 245-256, November 2014. Presented at the International Conference on Very Large Data Bases (VLDB '15), Kohala Coast, Hawaii, USA, August 2015. Publisher's version Ahmed El-Roby and Ashraf Aboulnaga. ALEX: Automatic Link Exploration in Linked Data. ACM SIGMOD International Conference on Management of Data (SIGMOD '15), Melbourne, Australia, pages 1839-1853, June 2015. Publisher's version Jingen Xiang, Cong Guo, and Ashraf Aboulnaga. Scalable Maximum Clique Computation Using MapReduce. IEEE International Conference on Data Engineering (ICDE '13), Brisbane, Australia, pages 74-85, April 2013. Publisher's version Iman Elghandour and Ashraf Aboulnaga. ReStore: Reusing Results of MapReduce Jobs. Proceedings of the VLDB Endowment (PVLDB), volume 5, number 6, pages 586-597, February 2012. Presented at the International Conference on Very Large Data Bases (VLDB '12), Istanbul, Turkey, August 2012. Publisher's version Ahmed A. Soror, Umar Farooq Minhas, Ashraf Aboulnaga, Kenneth Salem, Peter Kokosielis, and Sunil Kamath. Automatic Virtual Machine Configuration for Database Workloads. ACM Transactions on Database Systems (TODS), volume 35, number 1, article 7 (47 pages), February 2010. Publisher's version Extended version of SIGMOD '08 paper. Special issue for the best papers of SIGMOD '08. Ashraf Aboulnaga, Alaa R. Alameldeen, and Jeffrey F. Naughton. Estimating the Selectivity of XML Path Expressions for Internet Scale Applications. International Conference on Very Large Data Bases (VLDB '01), Rome, Italy, pages 591-600, September 2001. Publisher's version Ashraf Aboulnaga and Jeffrey F. Naughton. Accurate Estimation of the Cost of Spatial Selections. IEEE International Conference on Data Engineering (ICDE '00), San Diego, California, USA, pages 123-134, February 2000. Publisher's version Ashraf Aboulnaga and Surajit Chaudhuri. Self-tuning Histograms: Building Histograms Without Looking at Data. ACM SIGMOD International Conference on Management of Data, Philadelphia, Pennsylvania, USA pages 181-192, June 1999. Publisher's version Recent Teaching (Complete List) CSE 3330 - Database Systems and File Structures Fall 2025 Fall 2024 CSE 6331 - Advanced Topics in Database Systems (Topic: Data Infrastructure for Machine Learning) Spring 2025 Recent Scientific Activities (Complete List) Member of the Editorial Board of Distributed and Parallel Databases (DAPD), 2014-present. Associate Editor of the VLDB Journal (VLDBJ), 2015-2021. Associate Editor of the Proceedings of the VLDB Endowment (PVLDB), volume 19, 2025-2026. Papers published in this volume of PVLDB were presented at the International Conference on Very Large Databases (VLDB), 2026. Area Chair in the Research Program Committee of the IEEE International Conference on Data Engineering (ICDE), 2026. Associate Editor of the ACM SIGMOD International Conference on Management of Data (SIGMOD), 2025. (Distinguished Associate Editor Award, Best Paper Selection Committee.) Area Chair in the Research Program Committee of the IEEE International Conference on Data Engineering (ICDE), 2025. Senior Program Committee Member of the Conference on Extending Database Technology (EDBT), 2025. (Best Paper Selection Committee.) Associate Editor of the Proceedings of the VLDB Endowment (PVLDB), volume 17, 2023-2024. Papers published in this volume of PVLDB were presented at the International Conference on Very Large Databases (VLDB), 2024. Associate Editor of the ACM SIGMOD International Conference on Management of Data (SIGMOD), 2024. (Distinguished Associate Editor Award, Best Paper Selection Committee.) Industry and Applications Track Program Committee Co-Chair (with Peter Boncz and Fatma Özcan) of the IEEE International Conference on Data Engineering (ICDE), 2024. Senior Program Committee Member of the Conference on Extending Database Technology (EDBT), 2024. Industrial Track Program Committee Co-Chair (with Avrilia Floratou) of the ACM SIGMOD International Conference on Management of Data (SIGMOD), 2022. Associate Editor of the Proceedings of the VLDB Endowment (PVLDB), volume 14, 2020-2021. Papers published in this volume of PVLDB were presented at the International Conference on Very Large Databases (VLDB), 2021. Guest Editor of the VLDB Journal Special Section on the Best Papers of the Workshop on Data Management on New Hardware (DaMoN) 2019, November 2020. Program committee member of: ACM SIGMOD International Conference on Management of Data, 2026. ACM SIGMOD International Conference on Management of Data, 20",
  "content_length": 10587,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:42"
}