{
  "name": "Ashutosh Bhatia",
  "homepage": "http://www.bits-pilani.ac.in/pilani/ashutoshbhatia/profile",
  "status": "success",
  "content": "Ashutosh Bhatia - BITS Pilani Campus Header Institute Header Home Academics Integrated first degree B.E.(Manufacturing Engineering) M.Sc.(Mathematics) M.Sc.(Chemistry) M.Sc.(General Studies) M.Sc.(Biological Sciences) M.Sc.(Physics) M.Sc.(Economics) B.E.(Mechanical) B.E.(Civil) B.E.(Electronics and Instrumentation) B.E.(Electronics and Communication) B.E.(Electrical and Electronics) B.E.(Chemical) B.Pharm.(Pharmacy) B.E.(Computer Science) Higher Degree M.E.(Sanitation Science, Technology and Management) M.E. Chemical Engineering (with specialization in Petroleum Engineering) M.E.(Chemical) MBA(Master of Business Administration In Business Analytics) Master in Public Health M.Sc. General Studies – Communication and Media Studies Stream M.E. (Mechanical with specialization in Thermal Engineering) M.E.(Software Systems) M.E. M.Pharm M.Pharm.(Pharmacology) M.Pharm.(Pharmaceutics) M.Pharm.(Pharmaceutical Chemistry) M.Pharm.(Pharmacy) M.E.(Design Engineering) M. E. Computer Science with Specialization in Information Security with B.Sc. input M.E.(Microelectronics) M.E.(Mechanical) M.E.(Manufacturing Systems Engineering) M.E.(Embedded Systems) M.E. Electronics & Control M.E.(Computer Science) M.E.(Communication Engineering) M.E. Civil – Water Resource Engineering M.E.(Civil with specialization in Transportation Engineering) M.E.(Civil with specialization in Structural Engineering) M.E.(Civil with specialization in Infrastructure Engineering and Management) M.E.(Biotechnology) M.E.(Environmental Engineering) Doctoral Programmes Pharmacy Physics Civil Engineering Computer Science & Information Systems Electrical & Electronics Engineering Biological Sciences Chemical Engineering Chemistry Economics & Finance Humanities & Social Sciences Mathematics Mechanical Engineering Management WILP Admission Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions Research & Innovation R&I Home Grants Publications Patents Facilities CoE IIC IPEC TTO TBI Startups Outreach Contacts Department Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Management Mechanical Engineering Pharmacy Physics Faculty Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Management Mechanical Engineering Pharmacy Physics Students Student Activities Events & Festivals BITScan BITS Embryo Picture Gallery Convocation 2025 BITS BEAT Student Achievements Student Services Academic Counseling Academic Document/Verification Requests Student Facilities Student Welfare Procedure for Issurance of Duplicate Degree Anti Ragging Scrutiny of Grades Information for Prospective Students Prevention of Sexual Harassment Centers Teaching Learning Centre Centre for Women’s Studies Centre for Entrepreneurial Leadership Centre for Desert Development Technologies Centre for Robotics and Intelligent Systems Technology Business Incubator Central Instrumentation Facility AI Centre Alumni Quick Links Academic Counselling Center Medical Center Library e-services Outreach IT Services Unit Central Workshop Campus Pilani Dubai K K Birla Goa Hyderabad BITSoM, Mumbai BITS Law School, Mumbai Links For BITS Library Admissions Faculty Practice School Placements Student Arena Career News Alumni Internationalization Events MOUs Current Students Invest in Leaders Outreach Picture Gallery Admission Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions BITSAT IMPORTANT CONTACTS Pilani Dubai Goa Hyderabad RESEARCH & INNOVATION Overview Sponsored Research Projects Consultancy Based Projects Patents Publications R&D Centers DEPARTMENTS Pilani Dubai Goa Hyderabad Academics Integrated First Degree B.E.(Chemical) B.E.(Civil) B.E.(Computer Science) B.E.(Electrical and Electronics) B.E. (Electronics and Computer ) B.E.(Electronics and Communication) B.E.(Electronics and Instrumentation) B.E.(Manufacturing Engineering) B.E.(Mechanical) B.Pharm.(Pharmacy) M.Sc.(Biological Sciences) M.Sc. Semiconductor and Nanoscience B.E. Environmental and Sustainability Engg. M.Sc.(Chemistry) M.Sc.(Economics) M.Sc.(General Studies) M. Sc. (Mathematics) M.Sc.(Physics) B. E. (Mathematics and Computing) Higher Degree MBA (Master of Business Administration) M.E.(Electrical with specialization in Power Electronics and Drives) M.E. Civil – Water Resource Engineering MBA (Master of Business Administration) MBA (Master of Business Administration in Business Analytics) M.E.(Communication) M. E. Computer Science with Specialization in Information Security with B.Sc. input M.E. (Mechanical with specialization in Thermal Engineering) M.E. Electronics & Control M.E. M.Pharm M.E.(Biotechnology) M.E.(Chemical) M.E.(Civil with specialization in Infrastructure Engineering and Management) M.E.(Civil with specialization in Structural Engineering) M.E.(Civil with specialization in Transportation Engineering) M.E.(Computer Science) M.E.(Design Engineering) M.E.(Embedded Systems) M.E.(Manufacturing Systems Engineering) M.E.(Mechanical) M.E. Environmental engineering M.E.(Microelectronics) M.E.(Sanitation Science, Technology and Management) M.E.(Software Systems) M.Pharm.(Pharmaceutical Chemistry) M.Pharm.(Pharmaceutics) M.Pharm.(Pharmacology) M.Pharm.(Pharmacy) M.Sc. General Studies – Communication and Media Studies Stream Master in Public Health MBA(Master of Business Administration In Business Analytics) Doctoral Programmes Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities & Social Sciences Management Mathematics Mechanical Engineering Pharmacy Physics General Sciences WILP Dubai Campus Integrated First Degree Higher Degree Doctoral Programmes Explore BITS About Legacy Achievements Social Responsibility Sustainability Divisions Pilani Dubai K K Birla Goa Hyderabad Mumbai Pilani K K Birla Goa Hyderabad Dubai follow us Feedback Give us your feedback If you notice any issues or missing content, please let us know. Your feedback helps us improve. Thank you. Upload Screenshot Ashutosh Bhatia Pilani Computer Science Associate Professor, Department of Computer Science & Information Systems, BITS Pilani, Pilani Campus Body Area Network, Internet of Things, Software Defined Networking and Network Virtualization, Vehiculer Adhoc Network, Wireless Sensor Networks Room No:6121-P, New Academic Building, Department of Computer Science & Information Systems, Birla Institute of Technology & Science, Pilani- 333031, Rajasthan. India. ashutosh.bhatia@pilani.bits-pilani.ac.in Phone: +91-1596-255725 Mobile: +91-9739049663 https://www.linkedin.com/in/ashutosh-bhatia-61532618b/ Ashutosh Ph.D. (IISc.), Associate Professor, CTO COGNIX Room No 6121-P,Department of Computer Science and Information Systems,Birla Institute of Technology and Science Pilani, Pilani Campus, Rajasthan, INDIA 333031E-mail: ashutosh.bhatia@pilani.bits-pilani.ac.in Mobile: +91-9739049663 Short BioDr. Ashutosh Bhatia, an Associate Professor in the Department of Computer Science and Information Systems at Birla Institute of Technology and Science Pilani (BITS Pilani). Dr. Bhatia's academic background includes a PhD and postgraduate degree from the Indian Institute of Science (IISc) in Bangalore, and a B.E. degree from Barkatullah University in Bhopal. Before joining academia, Dr Bhatia spent nearly seven years as a scientist at the Defence Research and Development Organization (DRDO) under the Ministry of Defence. In DRDO his primary research assignment was to develop secure, robust, and energy-efficient communication systems suited for battlefield environments.  Later, from 2007-2010, he worked as a research engineer and team leader at Samsung India. While at Samsung, he was part of the MAC core committee of the IEEE 802.15.6 standardization group. Some of his patented technologies are now part of this communication standard.  He is the co-inventor of a number of US and Indian patents for several methods related to energy-efficient protocols and blockchain technology.  Dr. Bhatia's research interests span a wide range of topics, including the development of novel designs, protocols, algorithms, and theories to enhance their security, performance, and robustness. He has published more than 70 research articles in prestigious international journals and conferences stemming from his research during his time at DRDO, Samsung, IISc, and BITS. As a principal investigator (PI) or Co-PI, Dr. Bhatia has completed several government and industry-sponsored projects, with more currently underway. He has successfully supervised one PhD student in the area of software-defined networking and is presently guiding five other PhD students in the fields of cryptography, biometric security, blockchain, and wireless network-related areas.  He is also in charge of the blockchain and networking research labs within the department. Quantum technology is his relatively new research interest.  Recently, he has started working on topics related to quantum computing, specifically quantum algorithms, quantum cryptography, and post-quantum cryptography. Recently, he started the Quantum Computing Interest Group (QCIG) at BITS, which comprises nearly fifty faculty members and more than a hundred students across all campuses, and is working as the coordinator of the same. So far, QCIG has organized a number of guest lectures and discussion sessions. His work in coordinating the Quantum Computing Interest Group and online workshop has helped to foster a community of scholars and students interested in advancing the field of quantum computing. Area of InterestCryptography, Cyber Security, IoT Security, Bl",
  "content_length": 12301,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:50"
}