{
  "name": "Asia J. Biega [SP]",
  "homepage": "https://asiabiega.github.io",
  "status": "success",
  "content": "Asia J. Biega she/her Contact: first . last at mpi-sp.org Name: How to pronounce Asia I am a computer scientist and a tenure-track faculty member (W2) at the Max Planck Institute for Security and Privacy (MPI-SP). I am also a principal investigator of the Cluster of Excellence CASA and of the interdisciplinary and intersectoral consortium FINDHR. At MPI-SP, I lead the interdisciplinary Responsible Computing group. To date, my team has included brilliant students, postdocs, and visitors with backgrounds ranging from Computer Science, Information Science, and Engineering to Psychology, Philosophy, Law, and Public Policy. My team and I study questions at the intersection of computing & society, particularly in the context of data-driven systems. Our current research centers around developing, examining and computationally interpreting principles of responsible computing, data protection & governance, and digital well-being. My work has been recognized with Council of Europe's Rodota Award for innovative research in data protection, Annual Privacy Forum's Best Paper Award, SaTML Notable Reviewer Award, and GI-DBIS Dissertation Award of the German Informatics Society. In 2025, I have been named one of the \"100 Brilliant Women in AI Ethics\". I often collaborate with scholars in law, philosophy, and social sciences, draw from my industry experience at Microsoft and Google, and share my expertise with policymakers, data protection authorities, artists, industry, and NGOs. I have served as an external expert for the European Commission and the General Co-Chair of ACM FAccT 2025, the biggest academic conference focusing on the societal impacts of computing. I now sit on FAccT's Executive Committee. Before joining MPI-SP, I was a postdoctoral researcher at Microsoft Research Montréal in the Fairness, Accountability, Transparency, and Ethics in AI (FATE) Group. I completed my PhD in Computer Science at the MPI for Informatics, the MPI for Software Systems, and the Saarbrücken Graduate School of Computer Science. During my PhD, I also spent time in the USA (UMass Amherst) and Switzerland (Google Zurich). I grew up and studied computer science in Poland. OPENINGS IN THE RESPONSIBLE COMPUTING GROUP Applications currently open (start date as soon as possible): Student or research assistant (HiWi) -- you must be enrolled at a German university as a MSc/BSc student. The assistant will help with our open-source software release focusing on the measurement of fairness in compliance with data protection laws (Python, algorithmic fairness, multi-party computation). More details and how to apply: here. Internship candidates (for internships starting in Spring/Summer/Fall 2025): please apply to the internship program and mention my name in your application. I unfortunately don't have the bandwidth to reply to individual email inquiries. Responsible Computing Group at MPI-SP I lead the Responsible Computing group at the Max Planck Institute for Security and Privacy (MPI-SP). Our research centers around developing, examining and computationally operationalizing principles of responsible computing, data protection & governance, and digital well-being. We study these themes in particular in the context of data-driven and AI-based systems, covering all their facets (data, algorithms, interfaces, user interactions). We eagerly collaborate across disciplinary boundaries, allowing us not only to make technical contributions in Computer Science, but also to lend our expertise to support research in other fields. Our current research themes include: Data Protection & Governance, Privacy Technology Governance, Policy, Regulation Digital Well-Being Social Responsibility in Computing Research in my group is currently funded by the Max Planck Society, Alexander von Humboldt Foundation, and the European Union (Horizon Europe FINDHR). Group Members Changyang He (postdoc) Selin Fidan (PhD student, co-advised with Abraham Mhaidli) Lin Kyi (PhD student) Amruta Mahuli (PhD student) Parnian Jahangirirad (research assistant, 2024-2025) Magdalena Krysztoforska (visiting scholar, ICI Berlin, 2024-2025) Alumni: Matthias Juentgen (research assistant, 2025) Marina Ceccon (visiting PhD student, University of Padua, 2024-2025) Alessandro Fabris (postdoc, Humboldt Postdoctoral Fellow, 2023-2025 -> Tenure-Track Assistant Professor, University of Trieste) Yu Yamashita (research intern, 2023-2024) Upamanyu Das (research assistant, 2023) Önder Askin (visiting PhD student, RUB, 2023) Kirandeep Kaur (research intern, 2023 -> PhD Student in Computer Science, University of Washington) Sushil Kumar (research assistant, 2022-2023) Niall Docherty (visiting scholar, 2022-2023) Tanusree Sharma (visiting PhD student, UIUC, 2022 -> Assistant Professor, Penn State) Alessandro Fabris (visiting PhD student, University of Padua, 2021-2022 -> postdoc, MPI-SP) Martin Pawelczyk (visiting PhD student, University of Tübingen, 2021-2022 -> postdoc, Harvard University) Aparna Balagopalan (visiting PhD student, University of Toronto / MIT, 2021) Nasim Sonboli (visiting PhD student, University of Colorado, Boulder, 2021 -> postdoc, Brown University) Athina Kyriakou (research intern, 2022 -> PhD student in Computer Science, University of Zurich) Nikhil Prakhash (research intern, 2022 -> PhD student in Computer Science, Northeastern University) Valentina Ferraioli (research intern, 2021-2022 -> PhD student in Learning Sciences, EPFL) Before joining MPI-SP, I was extremely lucky to work with these amazing folks while at Microsoft Research: Divya Shanmugam (MIT), research internship, 2020 Maria Antoniak (Cornell), research internship, 2020 Ruohan Li (CMU), remote research project, 2020 Jianxiang Li (CMU), remote research project, 2020 While at MPI-INF + MPI-SWS: Tom Sühr (TU Berlin), research internship, 2018-2019 Jana Schmidt (Saarland University), BSc thesis, 2018 Sedigheh Eslami (Saarland University) MSc thesis, 2016-2017 Publications [Google Scholar] [DBLP] Governance of Generative AI in Creative Work: Consent, Credit, Compensation, and Beyond Lin Kyi, Amruta Mahuli, M. Six Silberman, Reuben Binns, Jun Zhao, and Asia Biega (CHI 2025) The ACM CHI Conference on Human Factors in Computing Systems [PDF] What’s in a Query: Polarity-aware Distribution-based Fair Ranking Aparna Balagopalan, Kai Wang, Olawale Elijah Salaudeen, Asia Biega, Marzyeh Ghassemi (WWW 2025) The Web Conference 2025 [PDF] Turning to Online Forums for Legal Information: A Case Study of GDPR’s Legitimate Interests Lin Kyi, Cristiana Santos, Sushil Ammanaghatta Shivakumar, Franziska Roesner, Asia Biega (APF 2025) Annual Privacy Forum 2025 [PDF] Best Paper Award Fairness and Bias in Algorithmic Hiring: A Multidisciplinary Survey Alessandro Fabris, Nina Baranowska, Matthew J. Dennis, David Graus, Philipp Hacker, Jorge Saldivar, Frederik Zuiderveen Borgesius, Asia J. Biega ACM Transactions on Intelligent Systems and Technology, 2025 [PDF] Featured in the Montreal AI Ethics Brief. \"I’m not convinced that they don’t collect more than is necessary\": User-Controlled Data Minimization Design in Search Engines Tanusree Sharma, Lin Kyi, Yang Wang, Asia J. Biega (Usenix Security 2024) 33rd Usenix Security Symposium [PDF] \"It doesn't tell me anything about how my data is used\": User Perceptions of Data Collection Purposes Lin Kyi, Abraham Mhaidli, Cristiana Santos, Franziska Roesner, Asia J. Biega (CHI 2024) The ACM CHI Conference on Human Factors in Computing Systems [PDF] Featured in the Montreal AI Ethics Brief. Invited for presentation at the French Data Protection Authority (CNIL). Data Repurposing through Compatibility: A Computational Perspective Asia J. Biega Special Issue of the Journal of Institutional and Theoretical Economics on \"Machine Learning and the Law\", 2024 [publisher version][author preprint] Invited contribution for the interdisciplinary JITE Symposium on Machine Learning and the Law of the Max Planck Institute for Research on Collective Goods. Algorithmically Mediated User Relations: Exploring Data's Relationality in Recommender Systems Athina Kyriakou, Oana Inel, Asia Biega, Abraham Bernstein (Regulatable ML @ NeurIPS 2023) Regulatable ML Workshop at the Thirty-seventh Annual Conference on Neural Information Processing Systems [PDF] The Role of Relevance in Fair Ranking Aparna Balagopalan, Abigail Z. Jacobs, Asia J. Biega (SIGIR 2023) The 46th International ACM SIGIR Conference on Research and Development in Information Retrieval [PDF] Featured in the Montreal AI Ethics Brief. On the Trade-Off between Actionable Explanations and the Right to be Forgotten Martin Pawelczyk, Tobias Leemann, Asia Biega, and Gjergji Kasneci (ICLR 2023) The 11th International Conference on Learning Representations [PDF] Investigating Deceptive Design in GDPR’s Legitimate Interest Lin Kyi, Sushil Ammanaghatta Shivakumar, Franziska Roesner, Cristiana Santos, Frederike Zufall, and Asia J. Biega (CHI 2023) The ACM CHI Conference on Human Factors in Computing Systems [PDF] Council of Europe's 2024 Stefano Rodotà Award Selected for presentation at the French Data Protection Authority's CNIL Privacy Research Day 2023. Prelimiary version selected for presentation at the Berkeley Center for Long-Term Cybersecurity's annual research symposium on \"Comparing Effects of and Responses to the GDPR and CCPA/CPRA\". Integrative Objects in Sociotechnical Contexts: Constructing Digital Well-Being with Generic Epistemology Magdalena Krysztoforska, Niall Docherty, Asia J. Biega (CHI 2023) The ACM CHI Conference on Human Factors in Computing Systems [PDF] Pairwise Fairness in Ranking as a Dissatisfaction Measure Alessandro Fabris, Gianmaria Silvello, Gian Antonio Susto, Asia J. Biega (WSDM 2023) The 16th ACM International Conference on Web Search and Data Mining [PDF] Learning to Limit Data Collection via Scaling Laws: A Computational Interpretation for the Legal Principle of Data Minimization Divya Shanmugam, Fernando Diaz, Samira Shabanian, Michèle Finck, As",
  "content_length": 27376,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:47"
}