{
  "name": "Asif Uddin Khan",
  "homepage": "https://cse.kiit.ac.in/profiles/asif-uddin-khan",
  "status": "success",
  "content": "Asif Uddin Khan - KIIT School of Computer Engineering Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Asif Uddin Khan Asif Uddin Khan Asif Uddin Khan Assistant ProfessorReceived Ph.D. degree in Computer Science from Utkal University, Bhubaneswar. Completed Ph.D. coursework from National Central University Taiwan, M.Tech in Computer Science & Engg from IIIT Bhubaneswar and B.Tech in Computer Science & Engg. from CV Raman College of Engineering Bhubaneswar. Presently working as a senior Asst Professor in the School of Computer Engineering, KIIT Deemed to be University Bhubaneswar. My research interest includes designing improved models, frameworks and protocols for the modern networks and network based services to achieve guaranteed quality of service, improved quality of user experience and overall cost minimization. I am interested in emerging network technologies like vehicular ad-hoc networks, software defined networks, cloud computing, fog computing and edge computing. My current research focuses on Vehicular Fog Computing, Mobile Edge Computing and cloud-edge-fog (CEF) federation and IoT. Profile LinksEmail :[email protected] Social LinksProfileRecent PublicationsProfileResearch InterestsCloud Computing, Fog and Edge Computing •\tWireless and Mobile Networks •\tVANET and Connected Vehicles •\tSoftware Defined Network •\tNetwork Security •\tIoTProjectsProgram Committee: •\tTechnical program committee member in 4th International Conference on Advances in Distributed Computing and Machine Learning (ICADCML)-2023 will be organized by National Institute of Technology, Rourkela, Odisha, India during Jan 15-16, 2023. (https://www.icadcml.in/) •\tTechnical program committee member in 3rd International Conference on Innovative Trends in Information Technology (ICITIIT), 2022. •\tTechnical program committee member in IEEE OCIT-2021, 19th OITS International Conference on Information Technology, 18-20 December 2021. •\tTechnical program committee member in ICAIHC- 2022, International Conference on Ambient Intelligence in Health Care, Springer, April 15-16, 2022. Session Chair: •\tICAIHC- 2022, International Conference on Ambient Intelligence in Health Care, Springer, April 15-16, 2022, SOA Deemed to be University, Bhubaneswar. Invited Talks: •\tSeminars talk on Application of VANET and SDN a motivation and research direction for the M.Tech students at the Department of Computer Science, Utkal University, Bhubaneswar in 2017. Journal Reviewer: •\tFuture Generation Computer Systems, Elsevier journal •\tInternational Journal of Network Security Conference Reviewer: •\tThe 4th International Conference on Advances in Distributed Computing and Machine Learning (ICADCML)-2023 will be organized by National Institute of Technology, Rourkela, Odisha, India during Jan 15-16, 2023. •\t1st IEEE International Conference on Industrial Electronics: Developments & Applications (ICIDeA), 2022 •\tIEEE OCIT-2021, 19th OITS International Conference on Information Technology, 18-20 December 2021. •\tIEEE International IOT, Electronics and Mechatronics Conference (IEMTRONICS), Toronto, Canada, March 2021. •\tIEEE International Women in Engineering (WIE) Conference on Electrical and Computer Engineering (WIECON-ECE), 2020. •\tInternational Conference on Innovative Trends in Information Technology (ICITIIT-20) organized by IIIT-Kottayam, 2020. •\t1st IEEE International conference on Applied Machine Learning (ICAML2019) organized by Siksha ‘O’ Anusandhan Deemed to be University during September 27-28, 2019 in Bhubaneswar, Odisha, India. •\t3rd International Conference on Advanced Computing and Intelligent Engineering (ICACIE 2018). Awards & Honours •Qualified Graduate Aptitude Test in Engineering (GATE), 2008. •BPUT 20th university foundation day award for faculty mentor of startup cell in the college during session 2020-2021 •Innovation ambassador certificate from Ministry of Education's Innovation Cell, and AICTEMembershipsIEEE, OITSRecent Publications sachi2023-04-25T10:17:06+05:30 Page load link Go to Top",
  "content_length": 4089,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:49"
}