{
  "name": "Asif Salekin",
  "homepage": "https://asalekin.github.io",
  "status": "success",
  "content": "Asif Salekin Asif Salekin (Pronouns: he/him/his) Assistant Professor (Tenure-track) Ira A. Fulton Schools of Engineering - SBHSE Graduate Faculty - Computer Science and Biomedical Engineering Arizona State University Assistant Professor (Affiliated) The School of Medicine and Advanced Medical Engineering (SOMME) Arizona State University Research Affiliate Mayo Clinic ARZ-Research Assistant Professor (Affiliated) Syracuse University Assistant Professor (Affiliated) Department of Psychiatry SUNY Upstate Medical University asif-dot-salekin-at-asu-dot-edu About: I am directing the Laboratory for Ubiquitous and Intelligent Sensing (UIS Lab) at Ira A. Fulton Schools of Engineering, Arizona State University. I hold an interdisciplinary position where I will advise PhD students from both Computer Science (CS) and Biomedical Engineering (BME). Previously, I served as a tenure-track Assistant Professor at Syracuse University and gained research experience as a research intern at both Nokia Bell Labs in Murray Hill, NJ, USA, and the BOSCH Research and Technology Center in California, USA. My research takes a multi-disciplinary approach to developing novel and practical human-centric computing and sensing solutions. My research interests go beyond the conventional learning or sensing approaches and address the research challenges, such as: Investigating the natural distribution shifts within real human-centric applications, understanding their impact, and developing solutions to attain robustness against these shifts. Addressing issues of Fairness and bias mitigation in human-centric computing, especially in scenarios where the factors subject to inequitable treatment remain unidentified. Multimodal-integration and Co-teaching-based ubiquitous and human-centric computing solutions. Interpretability of ML inference, particularly in the context of healthcare applications. Scalable and compressed ubiquitous computing solutions addressing the challenges of resource-constrained edge computing platforms. Trustworthiness and reliability in automated human-centric sensing, computing, and actuation/intervention. Addressing the privacy and security challenges associated with human-centric computing, sensing, and Internet-of-things (IoT) applications. A core focus of my research program is to integrate computing solutions to advance health assessment, identify latent markers, automate health monitoring, and facilitate automated interventions. My recent and ongoing projects include real-world health applications, such as Passive assessment of mental health (e.g., depression, social anxiety disorder, PTSD, etc.) and affective states. Automated assessment of opioid craving in opioid-use-disorder (OUD) individuals and providing reliable, trustworthy, and just-in-time interventions to mitigate craving. Understanding mental, speech, and sensorimotor factors of children-stuttering and providing automated interventions. Automated assessment of socio-behavioral well-being of dairy cattle and providing adaptive just-in-time interventions to the farmers. Automated monitoring of asthma and dementia patients. Predicting COVID-19 mortality, risk factors, and its effect on mental health. Identify, visualize, and interpret health-related (for Autism, Alzheimer's, and PTSD) atypical brain-activity patterns from EEG, MRI (fMRI), and fNIRS signals, etc. Identifying markers of chronic kidney disease (CKD). Starting in 2023, I have taken on the role of Associate Editor (AE) for the journal 'The Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT)' and the prestigious 'UbiComp' conference, which is the leading publication platform for ubiquitous computing research. I have been regularly serving on the TPC of AAAI and SenSys. Additionally, from 2021 to 2024, I served as an Associate Editor (AE) for the 'ACM Transactions on Computing for Healthcare' journal. Announcements! I am seeking multiple motivated Ph.D. students and Postdoctoral researchers (for Post-doc positions, US citizenship or permanent residency required) in Computer Science. Interested students and researchers should email their curriculum vitae, transcripts, and a paragraph or two detailing their research experiences, with the subject as 'Ph.D. admission or Post-Doc position at ASU.' Research Interests Human-centered AI and Sensing, Mobile Health, Machine Learning, Cyber-Physical Systems (CPS), Ubiquitous Computing, Human-Centered Fairness, Robustness, Privacy, Security, and Reliability. Latest News 2025 Sept 2025: Research grant news! We received an $800k, two-year grant from NIH AIM-AHEAD Program, in collaboration with Tyler S. Oesterle, M.D., M.P.H., and Benjamin Lai, M.B., B.Ch., B.A.O. from Mayo Clinic, MN, supporting our research on developing a human-centered, community-engaged AI framework for substance craving detection that is generalizable across substances (including poly-substance-use), trustworthy, and deployable across diverse contexts. Thanks to NIH AIM-AHEAD Program! Aug 2025: Research grant news! In collaboration with the Mayo Clinic’s Comprehensive Cancer Center Team at AZ, we have been awarded the 2025 Mayo Clinic and Arizona State University Alliance for Health Care Collaborative Research Seed Grant. This funding will support our efforts to develop AI models for predicting the final pathologic stage and chemotherapy response in bladder cancer patients using early-stage imaging and pathology data. Thanks to Mayo Clinic and Arizona State University Alliance! July 2025: Congratulations to Dr. Sawinder Kaur, my third advisee, for successfully defending her doctoral dissertation with flying colors! She worked on robust and compressed AI for human sensing. July 2025: Yi Xiao's paper on human heterogeneity invariant out-of-distribution stress sensing that extends to opioid substance abuse individuals as well(!) was accepted in IMWUT/Ubicomp 2025. Congratulations, Yi and the team! April 2025: Sawinder Kaur's paper on contextually robust personalization of human-centered AI was accepted in IMWUT/Ubicomp 2025. Congratulations, Sawinder and the team! March 2025: Presented our NSF CPS-funded project on farm animal health sensing at NSF PI meeting in Nashville, TN. March 2025: Yi Xiao's paper was accepted in ICCPS (CPS-week) 2025. Congratulations, Yi and the team! 2024 Oct 2024: Attended the Ubicomp 2024 conference in Melbourne, AUS, and presented our paper on Co-teaching based thermal stress detection Sept 2024: Attended the ACII 2024 conference in Glasgow, UK, and presented our paper on multimodal hostility detection from conversational speech. Sept 2024: Attended the Global AI Summit at Riyadh, KSA as an invited speaker and discussed responsible AI in healthcare. Sept 2024: Congratulations to Dr. Brian Philip Testa, my second advised, to successfully finish defending his doctoral dissertation! He worked on privacy and security in AI and human-sensing. Aug 2024: I have joined Arizona State University as a tenure-track Assistant Professor. June 2024: Congratulations to Dr. Jingyu Xin, my first advisee to successfully defend his doctoral dissertation! He has set a wonderful standard for those who will follow in my lab. June 2024: Jingyu's paper got accepted at ACII 2024. Congratulations Jingyu! March 2024: Avery Gump received the 2024 Earl H. Devoe Prize for Outstanding Undergraduate Research. Congratulations Avery! 2023 Dec 2023: Multiple papers have been accepted in the 'IEEE/ACM Transactions on Computational Biology and Bioinformatics, 2024', the 'Journal of Medicine in Novel Technology and Devices', and the 'Signal Analytics for Motor Speech Workshop, Motor Speech 2024'. Nov 2023: News about our research! Our work on protecting users' emotional privacy from smart speakers like Alexa was featured as a story. You can read the paper here: [paper link] Oct 2023: Our paper on developing Verified Robust Compressed Neural Networks from Scratch got accepted at the AAAI Conference on Artificial Intelligence, 2024 (Emerging Applications of AI track: acceptance rate 24%). Congratulations to Sawinder Kaur! Oct 2023: News about our research! . Syracuse University has recently showcased our ongoing research aimed at creating an automated and trustworthy intervention to aid individuals with opioid use disorder treatment. I am fortunate to be able to lead this impactful project with the support of such enthusiastic and capable collaborators, Dr. Dessa Bergen-Cico, and Dr. Tauhidur Rahman, who contribute their expertise in opioid behavior and intervention. Additionally, Dr. Monika Taylor, Crouse Hospital's director, has collaborated with us on data collection. Oct 2023: Our paper on Co-teaching thermal sensing for stress detection, titled \"Reading Between the Heat\": Co-Teaching Body Thermal Signatures for Non-intrusive Stress Detection, got accepted in IMWUT 2024. Congratulations to Yi Xiao and the team! Oct 2023: A paper got accepted into a reputable journal, Nature Molecular Psychiatry (Impact Factor 13.437). July 2023: Our paper on protecting emotional privacy against commercial smart speakers, titled \"Privacy against Real-Time Speech Emotion Detection via Acoustic Adversarial Evasion of Machine Learning,\" got accepted in IMWUT. Congratulations to Brian and the team! May 2023: Our recent NIH R01 grant made the news . We will develop fair and ethical AI algorithms to understand children's speech disfluency and provide automated interventions. May 2023: Multiple papers got accepted in INTERSPEECH and ACII 2023. March 2023: It’s official today! We got an NIH R01 grant! Title: “Intensive Speech Motor Chaining Treatment and Artificial Intelligence Integration for Residual Speech Sound Disorders.” Thank you, NIH. 2022 July 2022: Our paper titled “Psychophysiological Arousal in Young Children Who Stutter: An Interpretable AI Approach” has been accepted to IMWUT ’22. Congratulations to Harshit and Yi! July 2022: Excited to share that Dr. Sucheta Soundarajan (PI",
  "content_length": 34903,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:48"
}