{
  "name": "Aske Mottelson",
  "homepage": "https://pure.itu.dk/portal/en/persons/aske-mottelson(410df04c-bc1d-4cd3-9726-c35469ddab8c).html",
  "status": "success",
  "content": "Aske Mottelson - IT-University of Copenhagen Aske Mottelson offentligt CV Aske Mottelson PhD, MSc Associate Professor, Human-Computer Interaction and DesignPattern Recognition Revisited labHead of Programme, BSc in Digital Design and Interactive Technologies https://orcid.org/0000-0003-1827-8513 Emailasmoitudk 4E, RLVDenmark 20162025 Research activity per year Personal profile Current positionAssociate Professor, Human-Centered Data Science, IT University of CopenhagenResearch areasI’m a computer scientist with research interests in human-computer interaction, psychology, and data science. My research is about understanding user behavior of computer systems, and what this tells us about human psychology. My work entails designing and conducting computerized experiments with human participants, and modeling the interactions using statistical and machine learning techniques. I’m studying, and ultimately aiming at improving, how to conduct empirical research in computer science. I utilize a range of technologies such as extended reality and mobile interfaces to evaluate, understand, and improve the study of interactions between humans and computers at scale. I am a fan of open science and reproducibility.Employments/positions2024-: Associate Professor, HCI & Design, IT University of Copenhagen2021-2024: Assistant Professor, Digital Design, IT University of Copenhagen2019-2021: Postdoc, Department of Psychology, University of Copenhagen2017: Visiting scholar, Fluid Interfaces, MIT Media Lab2016-2019: PhD student, Department of Computer Science, University of Copenhagen Education/Academic qualificationComputer Science, PhD, Computer Cognition Interfaces, University of CopenhagenAward Date: 1 Feb 2019Computer Science, MSc, Detecting and understanding the impact of affect in touch-based computer interaction, University of CopenhagenAward Date: 1 Dec 2015 KeywordsHuman-Computer InteractionData scienceHCIExperimental psychologyVirtual RealityArtificial intelligence Fingerprint Dive into the research topics where Aske Mottelson is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Virtual Reality Keyphrases 100% Meta-analysis Keyphrases 50% Human Computer Interaction Computer Science 37% Human-computer Interaction Keyphrases 32% User Study Keyphrases 27% Smartphone Keyphrases 25% User Interface Keyphrases 25% Model Prediction Keyphrases 25% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2016 2016 2018 2019 2020 2021 2022 2023 2024 2025 2025 14 Article in proceedings 11 Journal article 2 Book chapter 1 Conference article Research output per year Research output per year Replicating replicability modeling of psychology papersMottelson, A. & Kontogiorgos, D., 7 Aug 2023, In: Proceedings of the National Academy of Sciences of the United States of America. 120, 33Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open AccessFile Model Prediction 100% Learning Model 100% Psychological Science 100% Psychology 100% Machine Learning Models 33% A self-administered virtual reality intervention increases COVID-19 vaccination intentionMottelson, A., Vandeweerdt, C., Atchapero, M., Luong, T., Holz, C., Böhm, R. & Makransky, G., 2021, In: Vaccine.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open AccessFile Practitioners 100% Effective Intervention 100% A Systematic Review and Meta-Analysis of the Effectiveness of Body Ownership Illusions in Virtual RealityMottelson, A., Muresan, A., Hornbæk, K. & Makransky, G., 1 Apr 2023, In: A C M Transactions on Computer - Human Interaction. p. 1-43 43 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open AccessFile Meta-analysis 100% Virtual Reality 100% Body Ownership Illusion 100% Systematic Review 100% Meta-Analysis 100% Pedagogical Agents in Educational VR: An in the Wild StudyPetersen, G. B., Mottelson, A. & Makransky, G., 2021, Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. New York, NY, USA: Association for Computing MachineryResearch output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Why Do People Take Screenshots on Their Smartphones?Mottelson, A., 2023, Proceedings of the 2023 ACM Designing Interactive Systems Conference. New York, NY, USA: Association for Computing Machinery, p. 740–752 (DIS '23).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Interactivity 100% Mixed Methods 100% Mobile Phones 100% Smartphone 100% Screen Content Image 100% View all 28 research outputs Projects Projects per year 2021 2021 2022 2023 2034 1 Active 2 Finished Projects per year DEEPFAKE: Effects of deep fake design on human processingMottelson, A. (PI), Rossi, L. (CoI) & Wegmann, D. J. (CoI)Meta01/03/2023 → 01/06/2025Project: Research Deepfake 100% Social Media Posts 50% Human Computer Interaction 50% Cognitive effects 50% Online Information 50% P1: Pioneer Centre for Artificial IntelligenceSestoft, P. (PI), Plank, B. (CoI), Hansen, D. W. (CoI), Larsen, A. W. (CoI), Bogers, T. (CoI), Madsen, I. J. W. (CoI), Dixen, L. (CoI), Trinhammer, M. L. (CoI), Iarygina, O. (CoI), Grasshof, S. (CoI), Mottelson, A. (CoI), Burelli, P. (CoI), Risi, S. (CoI), Rogers, A. (CoI), Goot, R. V. D. (CoI), Coscia, M. (CoI), Hardmeier, C. (CoI), Heinrich, S. (Collaborator) & Güven, A. B. (Collaborator)Danish National Research Foundation01/07/2021 → 30/06/2034Project: Research Pre-registered Replication 100% Registered Report 100% Body Attitude 100% Body Perception 100% Experimental Psychology 100% DMM : Den Mageløse Maskine: Nyskabende datalogisk videnskabsformidlingMottelson, A. (PI)Carlsberg Foundation01/04/2022 → 01/07/2023Project: Research Childrens 100% Computer Science 100% Science Dissemination 100% Dissemination 100% Press/Media Efter sagen om den falske Brad Pitt har forsker en nedslående beskedMottelson, A.19/01/20251 Media contributionPress/Media: Press / Media Netbutikker med hollandske ejere bruger kunstig intelligens til at lokke danskerneMottelson, A.24/11/20241 Media contributionPress/Media: Press / Media Kan du kende forskel? 'Deepfakes' udvisker grænsen mellem sandt og falskMottelson, A.02/11/20241 Media contributionPress/Media: Press / Media Radio4 Morgen 02.07.2024 07:05Mottelson, A.02/07/20241 Media contributionPress/Media: Press / Media Verdens største demokrati har været til valg - én teknologi har ændret slagets gangMottelson, A.07/06/20241 Media contributionPress/Media: Press / Media View all 21 press/media Datasets A Meta-Analysis of Text Entry StudiesIarygina, O. (Creator) & Mottelson, A. (Creator), Open Science Foundation, Apr 2025https://osf.io/be4y9/Dataset Asynchrony in VRIarygina, O. (Creator) & Mottelson, A. (Creator), Open Science Foundation, Apr 2025https://osf.io/nfgq4/Dataset Prizes Honorable Mention DIS '23Mottelson, A. (Recipient), Jul 2023Prize: Prizes, scholarships, distinctions Screen Content Image 100% Mobile Phones 100% Honorable Mention CHI '21Mottelson, A. (Recipient), 2021Prize: Prizes, scholarships, distinctions Honorable Mention UbiComp '16Mottelson, A. (Recipient), 2016Prize: Prizes, scholarships, distinctions Detection Method 100% Ubicomp 100% Affect Detection 100% In the Wild 100% Honorable Mention 100% Honorable Mention CHI'25Mottelson, A. (Recipient), Apr 2025Prize: Prizes, scholarships, distinctions Activities Activities per year 2020 2020 2023 2024 2024 2 Organisation and participation in conference 1 Membership in research network Activities per year 2021 CHI Conference on Human Factors in Computing SystemsMottelson, A. (Program co-chair)8 May 2020 → 12 May 2020Activity: Participating in or organising an event types › Organisation and participation in conference CHI 2024Mottelson, A. (Program co-chair)2024Activity: Participating in or organising an event types › Organisation and participation in conference The Young Academy of Technology, Science and Innovation (External organisation)Mottelson, A. (Member)2023 → 2028Activity: Membership types › Membership in research network",
  "content_length": 8674,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:58"
}