{
  "name": "Aske Plaat",
  "homepage": "https://askeplaat.wordpress.com",
  "status": "success",
  "content": "Aske Plaat | Leiden University Professor  Department of Artificial Intelligence & Computer Science (LIACS)Leiden University, Snellius 158Niels Bohrweg 1, 2333 CA Leiden, The Netherlands Research InterestsI am professor in artificial intelligence at the Institute of Artificial Intelligence and Computer Science (LIACS) of  Leiden University, the Netherlands, where I head, with Thomas Moerland, the Sustainable Energy Learning Lab and the Reinforcement Learning Group.  I am interested in large language models, music, and self-learning systems. Please have a look at my books: learning to play deep reinforcement learning BioI studied artificial intelligence with Jonathan Schaeffer at the University of Alberta, Edmonton and Arie de Bruin & Wim Pijls at the Erasmus University, Rotterdam where I obtained my PhD in 1996. I worked with Charles Leiserson at the MIT Lab for Computer Science, Cambridge, Massachusetts, on the Cilk parallel computing system. Later I worked with Henri Bal at VU Amsterdam on scalable algorithms. In 2014 I joined Leiden University. From 2016-2023 I served two terms as scientific director of LIACS. Longer Bio. Office Gorlaeus Building, BE4.21 AppointmentsPlease send a one-line email message to make an appointment, or drop by in person Email: Dans les champs de l’observation le hasard ne favorise que les esprits prepares – Louis Pasteur (often rendered as: Chance favors the prepared mind) Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy Subscribe Subscribed Aske Plaat Sign me up Already have a WordPress.com account? Log in now. Aske Plaat Subscribe Subscribed Sign up Log in Report this content View site in Reader Manage subscriptions Collapse this bar Loading Comments... Write a Comment... Email (Required) Name (Required) Website Design a site like this with WordPress.comGet started",
  "content_length": 1955,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:50"
}