{
  "name": "Asohan Amarasingham",
  "homepage": "https://www.ccny.cuny.edu/profiles/asohan-amarasingham",
  "status": "success",
  "content": "Asohan Amarasingham | The City College of New York Skip to main content > Home / Faculty and Staff Profiles / Asohan Amarasingham Asohan Amarasingham Professor Main Affiliation Mathematics Areas of Expertise/Research Theoretical and Computational Neuroscience Non-Stationary Point Processes Conditional and Simultaneous Inference Neurophysiology Building Marshak Science Building Office 209B Fax 212-650-5112 Email aamarasingham@ccny.cuny.edu Asohan Amarasingham Profile As an undergraduate at Virginia (B.Sc., Mathematics &Cognitive Science, 1997), influenced by Chip Levy, I developed an interest in the mathematical and statistical foundations of emerging branches of the neural and cognitive sciences. I completed graduate study at Brown (M.Sc., Cognitive &Linguistic Sciences, 1999;Ph.D., Applied Mathematics, 2004), where I worked in the Pattern Theory group and wrote a dissertation under the supervision of Stuart Geman, on statistical topics in neurophysiology. Following a period of teaching mathematics at the University of Jaffna, Sri Lanka, I completed my postdoctoral training in the laboratory of hippocampal neurophysiologist György Buzsáki at Rutgers. I joined the faculty at City College and the Graduate Center in 2010-11 Education 1997 University of Virginina - B.Sc. Mathematics & Cognitive Science 1999 Brown University - M.Sc. Cognitive & Linguistic Sciences 2004 Brown University - Ph.D. Applied Mathematics Research Interests Currently, my research interests span topics in statistics as well as neural coding and computation, with an emphasis on questions raised by large-scale neurophysiological data sets, and their implications for our understanding of the dynamics and functional properties of neuronal circuits. Publications J. Platkiewicz, Z. Saccomano, S. Mckenzie, D. English, A. Amarasingham. (2019) \"Monosynaptic inference via finely-timed spikes.\" Arxiv. J. Platkiewicz, E. Stark, and A. Amarasingham. (2017) \"Spike-centered jitter can mistake temporal structure.\" Neural Computation. 29:783-803. A. Amarasingham, S. Geman, and M. Harrison. (2015) \"Ambiguity and nonidentifiability in the statistical analysis of neural codes.\" Proceedings of the National Academy of Sciences. 112:6455-6460. M. Harrison, A. Amarasingham, and W. Truccolo. (2015) \"Spatiotemporal conditional inference and hypothesis tests for neural ensemble spiking precision.\" Neural Computation. 27:104-150. A. Amarasingham, M. Harrison, N. Hatsopoulos, and S. Geman. (2012) \"Conditional modeling and the jitter method of spike resampling.\" Journal of Neurophysiology. (Here is the supporting tech report). S. Fujisawa, A. Amarasingham, M. Harrison, and G. Buzsaki. (2008) \"Behavior-dependent short-term assembly dynamics in the medial prefrontal cortex.\" Nature Neuroscience. 11:823-833. E. Pastalkova, V. Itskov, A. Amarasingham, and G. Buzsaki. (2008) \"Internally-generated cell assembly sequences in the rat hippocampus.\" Science. 321:1322-1327 A. Amarasingham, T.-L. Chen, S. Geman, M. Harrison, and D. Sheinberg. (2006) \"Spike count reliability and the Poisson hypothesis.\" Journal of Neuroscience. 26:801-809 [software]",
  "content_length": 3132,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:51"
}