{
  "name": "Assefaw Hadish Gebremedhin",
  "homepage": "http://www.eecs.wsu.edu/~assefaw",
  "status": "success",
  "content": "Assefaw H. Gebremedhin Assefaw H. Gebremedhin Publications Teaching Research Service Vitae Assefaw Gebremedhin is Berry Family Distinguished Associate Professor in the School of Electrical Engineering and Computer Science at Washington State University, where he leads the Scalable Algorithms for Data Science (SCADS) Lab. He is also the Director and Lead PI of the Department of Defense-funded VICEROY Northwest Institute for Cybersecurity Education and Research (CySER), Director of the new CyberCorps Scholarship for Service (SFS) program at WSU, and Director of a Department of Education-funded Graduate Assistance in Areas of National Need (GAANN) program that focuses on training PhD students in AI for complex engineering applications. Assefaw received the 2024 EECS Outstanding Program Leadership Award for contributions to cybersecurity and the 2022 Reid Miller Teaching Excellence Award from the Voiland College of Engineering and Architecture. He also received the 2021 George Polya Prize in Applied Combinatorics for joint work with Fredrik Manne and Alex Pothen, and he received the National Science Foundation CAREER Award in 2016 for work on fast and scalable combinatorial algorithms for data analytics. His research interests include: combinatorial scientific computing, high-performance computing, machine learning and AI, cybersecurity, and applications in bioinformatics, environmental health, and energy ecosystems. Prior to joining WSU in Fall 2014, Assefaw was a research faculty member at Purdue University, Department of Computer Science, where he served as a founding member and invesigator in the Department of Energy-funded SciDAC Institute for Combinatorial Scientific Computing and Petascale Simulations (CSCAPES). He earned his PhD and MS in Computer Science from the University of Bergen, Norway and his BS in Electrical Engineering from Addis Ababa University, Ethiopia. A few favorites and oldies ElevatingMath Video Competition 2019 Winner Helen Catanese (Advancing Vaccine Development with Network Science) 2021 SIAM Prize Recipients Video SIAM CSC'16 Website (program, slides, history, pictures, and more) Address Email: assefaw.gebremedhin@wsu.edu Telephone: (509) 335-3952 Office: EME B43 Teaching Fall 2024 Semester: CptS 317: Automata and Formal Languages (Syllabus) CptS 475: Data Science (Syllabus) CptS 575: Data Science (Syllabus) Current Graduate Students: James Crabb, Postdoc, started Spring 2024. Topic: Cybersecurity education. Deven Biehler, MS student, started Spring 2024. Topic: Geospatial algorithms. Zayn Abou-Harb, MS student, started Fall 2024. Topic: Geospatial algorithms. Tashi Stirewalt, PhD student, started Fall 2023. Topic: Cybersecurity. Harrison Greenlee, PhD student, started Spring 2023. Topic: Computational epidemiology. Jarren Briscoe, PhD student, co-advised with Diane Cook, started Fall 2021. Topic: AI and ML, Fairness. Coby Soss, PhD student, started Fall 2021. Topic: Graph algorithms and AI. Funso Oje, PhD student, started Fall 2021. Topic: Environmental health. Shruti Patil, PhD student, started Fall 2020. Topic: Bioinformatics. James Halvorsen, PhD student, joined Summer 2020. Topic: Cybersecurity and ML. Stephanie Kane, PhD student (IID program), co-advised with Jan Dasgupta. Topic: Data science. Former Graduate Students (SCADS Lab Graduates): James Crabb, MS, Graduated December 2023. Thesis Title: A Critical Review of Cybersecurity Education in the United States Abstract Current Position: Postdoc at WSU Xu (Tony) Liu, PhD, Graduated July 2021. Tony was WSU-PNNL Distiguished Graduate Research Program (DGRP) fellow (first cohort), and was co-advised by Andrew Lumsdaine. Thesis Title: Structure Detection in Graphs and Hypergraphs Abstract Current Position: SDE II at AWS Yunshu Du, PhD, co-advised with Matt Taylor. Graduated April 2021. Thesis Title: Transfer in Deep Reinforcement Learning: How an Agent Can Leverage Knowledge from Another Agent, a Human, or Itself Abstract Current Position: Data Scientist at Sony AI Sayan Ghosh, PhD, Graduated April 2019. Thesis Title: Supporting Efficient Graph Analytics and Scientific Computation using Asynchronous Distributed-Memory Programming Models Abstract Current Position: Computer Scientist at PNNL Ramyar Saeedi, PhD, Graduated July 2018. Thesis Title: Efficient Machine Learning Algorithms for Automatic Reconfiguration of Mobile Health Monitoring Systems Abstract Current Position: ML Engineer at Uber Keyvan Sasani, MS, Graduated Dec 2018. Thesis Title: Machine Learning for Predicting Performance of Graph Algorithms with Applications in Graph Databases and Network Similarity Abstract Current Position: Data Engineer at Meta Helen Catanese, MS, Graduated May 2017. Thesis Title: RepeatAnalyzer: A Tool for Analyzing and Managing Short-Sequence Repeat Data Abstract Current Position: Senior Software Engineer at Addium Select Recent News and Activities: How Is AI Being Used in Day-to-Day Life? Washington State Steps Ahead Summer workshop brings cybersecurity education and research to Pullman campus Cybersecurity education varies widely in US Students get real-world learning in cybersecurity Degree in cybersecurity gets underway CyberCougs place first at regional competition 2021 George Polya Prize in Applied Combinatorics SIAM AN21 Prize Spotlight Article SIAM AN21 Prize Spotlight Video Training students at the intersection of power engineering and computer science CyberSecurity Education and Research Institute (CySER) Panel on AI Jobs of the Future at the AI Expo held at the NCESD STEM Summit 2021 NeurIPS 2021 Workshop on Differentiable Programming SIAM Conference on Applied and Computational Discrete Algorithms (ACDA21) Virtual Mini Summit on AI at WSU Research Week 2020 Connecting AI research Understanding bacterial pathogens Beating the crowds -- with data science Transfer students in computer science prove successful Software improves ability to catalog bacterial pathogen SIAM Workshop on Combinatorial Scientific Computing 2016: SIAM News article SIAM Workshop on Combinatorial Scientific Computing 2016: Workshop website",
  "content_length": 6099,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:55"
}