{
  "name": "Astrid Nieße",
  "homepage": "https://uol.de/des/team/astrid-niesse",
  "status": "success",
  "content": "Astrid Nieße // Universität Oldenburg Fk. II Department für Informatik Digitalisierte Energiesysteme Astrid Nieße Department für Informatik  (» Postanschrift) Carl von Ossietzky Universität Oldenburg Ammerländer Heerstraße 114-118 26129 Oldenburg Industriestraße 11, Raum 0-004 (» Adresse und Lageplan)nach Vereinbarung+49 441 798-2750  (F&P) vCard QR-Code Astrid Nieße ForschungsaktivitätenDer Forschungsschwerpunkt von Astrid Nieße liegt in der Anwendung von informatischen Methoden auf Fragestellungen multimodaler Energiesysteme. Der methodische Schwerpunkt der von ihr betreuten Arbeitsgruppe liegt auf der Anwendung von Methoden der verteilten künstlichen Intelligenz für Fragestellungen in diesem Kontext, wie z.B. der agentenbasierten Kontrolle von dezentralen Energieanlagen für die - teils marktbasierte - Erbringung von Systemdienstleistungen, der agentenbasierten Simulation, der Flexibilitätsmodellierung, Methoden der Datenanalyse sowie der Analyse der Resilienz verteilter Energiesysteme. LehreAstrid Nieße und die Mitarbeiter.innen in der Abteilung Digitalisierte Energiesysteme bieten Lehrveranstaltungen im Bachelor und Master Informatik und Wirtschaftsinformatik sowie Informatik-Lehrveranstaltungen für andere Studiengänge an. Thematisch werden neben Aspekten verteilter Algorithmen, naturinspirierter Verfahren und agentenbasierter Systeme auch Lehrveranstaltungen im Bereich der Umweltinformatik angeboten (siehe Bereich Lehre). Gremienarbeit und scientific communityAstrid Nieße engagiert sich in den folgenden Bereichen:GIFachgruppe Energieinformatik der Gesellschaft für Informatik (Sprecherin)ACMACM Special Interest Group SIGEnergyVDIVDI/VDE-Gesellschaft Mess- und Automatisierungstechnik (GMA),Fachgruppe TC 5.15 \"software agents in industrial applications\"IEEEIEEE TCIA – Technical Committee on Industrial AgentsBMBF PLLSPlattform Lernende Systeme, AG4 – GeschäftsmodellinnovationEFZNEnergieforschungszentrum NiedersachsenZDINZentrum für Digitale Innovationen NiedersachsenForWindZentrum für Windenergieforschung der Universitäten Oldenburg, Hannover und Bremen An der Gestaltung nachfolgender Konferenzen ist sie regelmäßig bzw. aktuell maßgeblich beteiligt: ACM e-EnergyDACH+ Conference on Energy InformaticsJahrestagung der Gesellschaft für Informatik INFORMATIK2021 Kurzlebenslauf Prof. Dr.-Ing. Astrid Nieße ist seit 2020 Professorin für Digitalisierte Energiesysteme an der Universität Oldenburg und Mitglied im Bereichsvorstand Energie des OFFIS - Institut für Informatik. In den Jahren 2018 bis 2020 war sie Professorin für Energieinformatik an der Leibniz Universität Hannover. Promoviert wurde Astrid Nieße an der Universität Oldenburg im Jahr 2015; in ihrer Doktorarbeit befasste sie sich mit der Anwendung verteilter Algorithmen im Anwendungsbereich dezentraler Energiesysteme. Astrid Nieße studierte Informatik und Biologie auf Diplom an der Hochschule Bremen sowie an der Universität Oldenburg. Wintersemester 2025 / 2026 2.01.5110 Practical Course (Energy Informatics) 2.01.5124 Research Project Digitalised Energy Systems 2.01.516 Agent-based Control in Energy Systems 2.01.801-N Forschungsseminar Digitalisierte Energiesysteme 2.01.AM-8 Oberseminar Digitalisierte Energiesysteme Webmaster (Stand: 20.06.2024) |  Kurz-URL:Shortlink: https://uol.de/p79716 Zum Seitananfang scrollen Scroll to the top of the page",
  "content_length": 3355,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:54"
}