{
  "name": "Ata Kabán",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/kaban-ata.aspx",
  "status": "success",
  "content": "Professor Ata Kaban - School of Computer Science - University of Birmingham Professor Ata Kaban PhD School of Computer Science Contact details Emaila.kaban@cs.bham.ac.uk View my research portal AddressSchool of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Ata Kaban is Professor in Computer Science working in statistical machine learning and data mining in high dimensional settings. The two major problems of her focus are the `curse of dimensionality’ and the gap between theory and practice. Ata Kaban is also an EPSRC Fellow (Jan 2017- Jan 2022) with the project “FORGING: Fortuitous Geometries and Compressed Learning”, and a part-time Turing Fellow. For more information please visit Ata's Computer Science page. PhD in Computer Science 2002 PhD in Musicology 2000 BSc (Hons) in Computer Science 1999 MSc in Musicology 1994 BA in Musical Composition 1993 Ata Kaban obtained a BSc in Computer Science from the Babes-Bolyai University of Cluj-Napoca, Romania, alongside of finishing a PhD in Musicology. She went on to pursue a PhD in Computer Science in Scotland, at the University of Paisley, under the supervision of Professor Mark Girolami. Upon completing, she briefly took an assistant professor position at the Eotvos Lorand University of Budapest, Hungary, before joining the University of Birmingham as a lecturer in 2003. She has been working in Birmingham since then, from 2018 as a Professor. Statistical machine learning - theory and practice High-dimensional data spaces, distance concentration Probabilistic modelling of data, Bayesian inference Large scale black-box, optimisation Dimensionality reduction, random projections Compressive learning, compressive optimisation Professor Kaban’s research contributed to the theory and practice of statistical machine learning, data mining, pattern recognition, as well as to evolutionary black-box optimisation. Her main focus has been to explain, test and resolve computational, statistical, inferential, geometric, and interpretational problems associated with the ‘curse of dimensionality’ in these areas. Her current work (supported by a 5 years EPSRC Fellowship) develops theory for high dimensional data analytics through compressive learning, to provide better risk guarantees and new algorithms that exploit naturally occurring structures in the high dimensional learning problems. In previous years, she had several fruitful inter-disciplinary collaborations where she developed novel machine learning algorithms to analyse data from Palaeontology (through a visit to the University of Helsinki), Astrophysics (as a Co-I on a PPARC-funded project), and Biology (as an MRC Discipline Hopping Award recipient). Recent publications Article Zhou, S, Lei, Y & Kabán, A 2025, 'PAC–Bayes Guarantees for Data-Adaptive Pairwise Learning', Entropy, vol. 27, no. 8, 845. https://doi.org/10.3390/e27080845 Kaban, A & Palias, E 2024, 'A Bhattacharyya-type conditional error bound for quadratic discriminant analysis', Methodology and Computing in Applied Probability, vol. 26, no. 4, 38. https://doi.org/10.1007/s11009-024-10105-x Huang, Z, Kaban, A & Reeve, H 2024, 'Efficient Learning with Projected Histograms', Data Mining and Knowledge Discovery. https://doi.org/10.1007/s10618-024-01063-6 Kaban, A & Reeve, H 2024, 'Structure discovery in PAC-Learning by Random Projections', Machine Learning. https://doi.org/10.1007/s10994-024-06531-0 Huang, Z, Lei, Y & Kaban, A 2023, 'Optimisation and Learning with Randomly Compressed Gradient Updates', Neural Computation. https://doi.org/10.1162/neco_a_01588 Turner, A & Kaban, A 2023, 'PAC learning with approximate predictors', Machine Learning. https://doi.org/10.1007/s10994-023-06301-4 Palias, E & Kabán, A 2023, 'The effect of intrinsic dimension on the Bayes-error of projected quadratic discriminant classification', Statistics and Computing, vol. 33, no. 4, 87. https://doi.org/10.1007/s11222-023-10251-1 Reeve, H, Kaban, A & Bootkrajang, J 2022, 'Heterogeneous sets in dimensionality reduction and ensemble learning', Machine Learning. https://doi.org/10.1007/s10994-022-06254-0 Kaban, A & Durrant, RJ 2020, 'Structure from Randomness in Halfspace Learning with the Zero-One Loss', Journal of Artificial Intelligence Research. Conference contribution Zhou, S, Lei, Y & Kaban, A 2025, Learning to Sample in Stochastic Optimization. in S Chiappa & S Magliacane (eds), Proceedings of the Forty-first Conference on Uncertainty in Artificial Intelligence. Proceedings of Machine Learning Research, vol. 286, Proceedings of Machine Learning Research, pp. 5099-5115, 41st Confenence on Uncertainty in Artificial intelligence, Rio de Janeiro, Brazil, 21/07/25. <https://proceedings.mlr.press/v286/zhou25b.html> Palias, E & Kaban, A 2024, Compressive Mahalanobis Metric Learning Adapts to Intrinsic Dimension. in 2024 International Joint Conference on Neural Networks (IJCNN)., 10649958, Proceedings of International Joint Conference on Neural Networks, IEEE, 2024 IEEE World Congress on Computational Intelligence, Yokohama, Japan, 30/06/24. https://doi.org/10.1109/IJCNN60899.2024.10649958 Zhou, S, Lei, Y & Kaban, A 2024, Self-certified Tuple-wise Deep Learning. in A Bifet, J Davis, T Krilavičius, M Kull, E Ntoutsi & I Žliobaitė (eds), Machine Learning and Knowledge Discovery in Databases. Research Track: European Conference, ECML PKDD 2024, Vilnius, Lithuania, September 9–13, 2024, Proceedings, Part II. vol. 2, Lecture Notes in Computer Science, vol. 14942, Springer, European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases, Vilnius, Lithuania, 9/09/24. https://doi.org/10.1007/978-3-031-70344-7_18 Huang, Z, Lei, Y & Kaban, A 2023, Noise-efficient learning of differentially private partitioning machine ensembles. in M-R Amin, S Canu, A Fischer, T Guns, PK Novak & G Tsoumakas (eds), Machine Learning and Knowledge Discovery in Databases: European Conference, ECML PKDD 2022, Grenoble, France, September 19–23, 2022, Proceedings, Part IV. 1 edn, Lecture Notes in Computer Science, vol. 13716, Springer, Cham, pp. 587–603, European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases, Genoble, France, 19/09/22. https://doi.org/10.1007/978-3-031-26412-2_36 Zhou, S, Lei, Y & Kaban, A 2023, Toward Better PAC-Bayes Bounds for Uniformly Stable Algorithms. in Advances in Neural Information Processing Systems: NeurIPS 2023. Advances in Neural Information Processing Systems, Thirty-seventh Conference on Neural Information Processing Systems, New Orleans, United States, 10/12/23. Reeve, HWJ & Kaban, A 2020, Optimistic Bounds for Multi-output Prediction. in 37th International Conference on Machine Learning (ICML 2020). 37th International Conference on Machine Learning (ICML 2020), Virtual Event, 12/07/20. View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 7008,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:56"
}