{
  "name": "Atanas P. Gotchev",
  "homepage": "https://www.tuni.fi/en/atanas-gotchev",
  "status": "success",
  "content": "Atanas Gotchev | Tampere universitiesAtanas GotchevProfessor, Signal ProcessingFaculty of Information Technology and Communication Sciences | Computing SciencesTampere Universityatanas.gotchev [at] tuni.fi (atanas[dot]gotchev[at]tuni[dot]fi)phone number+358408490733Hervanta CampusOrcidhttps://orcid.org/0000-0003-2320-1000About meI am Professor of Signal Processing at Tampere University, Finland, where I lead the 3D Media Group and direct the Centre for Immersive Visual Technologies (CIVIT). I am also the Chair of the Erasmus Mundus Joint Master Programme in Imaging and the Deputy Director of TAU Imaging Research Platform. I received the M.Sc. degree in Electronics and Automation Engineering and the M.Sc. degree in Applied Mathematics, both from Technical University – Sofia, Bulgaria, in 1990 and 1992, correspondingly, the PhD degree in Information Technologies, from Bulgarian Academy of Sciences in 1996, and the D. Tech. degree from Tampere University of Technology, Finland, in 2003. My research interests include immersive, 3D and light field imaging, image quality assessment, and computational optics. With my colleagues from 3D Media Group, we investigate methods for capture, processing and display of 3D visual data based on extensive knowledge about the human perception of depth and 3D visual cues. We employ advanced signal processing methods to tackle specific problems related to the huge amount of data to be processed and the optimal way of visualization using immersive displays. More recently, we have focused on developing computational cameras and displays employing end-to-end design of diffractive and metaoptics and corresponding computation imaging.  I have been coordinating three Marie Sklodowska-Curie doctoral networks in the area of light field and plenoptic imaging. I am Senior Area Editor of the IEEE Transactions of Image Processing and Senior Editor of the Journal of Electronic Imaging. I have been the Chair of the conference Image Processing Algorithms and Systems, part of the IS&T Electronic Imaging Symposium since 2012, and was the General Chair of the IEEE Multimedia Signal Processing Workshop (IEEE MMSP 2020 and 2021). I am also the General Chair of the Organizing Committee of IEEE International Conference on Image Processing (IEEE ICIP 2026) to be held in Tampere on 13 – 17 September, 2026.  I was a Visiting Professor with Prof. Rajesh Menon's Group on Nano-photonics technologies at University of Utah (August 2023 - June 2024) supported by a Fulbright Scholarship and Nokia Foundation Visiting Professor Grant. Project linksEuropean Joint Doctoral Programme on Plenoptic Imaging (Plenoptima)Immersive Visual Technologies for Safety-critical Applications (ImmerSAFE)European Training Network on Full Parallax ImagingCVCurriculum vitae (PDF, 159.75 KB)Own links3D Media GroupCentre for Immersive Visual TechnologiesTAU Imaging Research PlatformErasmus Mundus Joint Master in Imaging PublicationsMSc thesis topics in Image quality assessment (2025)MSc thesis topics in computational cameras and displays (2025)",
  "content_length": 3071,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:57"
}