{
  "name": "Athanasios G. Kanatas",
  "homepage": "https://www.ds.unipi.gr/en/faculty/kanatas-en",
  "status": "success",
  "content": "Athanasios Kanatas - Department of Digital Systems Skip to content Athanasios Kanatas Phone +30 210-4142759 Email kanatas@unipi.gr Title Professor Office Hours Monday 13:00 - 14:00 & Wednesday 14:00 - 15:00 Office 305 (150, Androutsou Str, Piraeus, 18532) Research cooperations and citations map https://researchmaps.ds.unipi.gr/citations/kanatas wp_statistics_words_count 4652 Courses Wireless Communications — 6th semester Satellite Communications — 7th semester Introduction to Telecommunications — 3rd semester Mobile Communication Systems — 8th semester Brief CV Athanasios (Thanasis) G. Kanatas is a Professor at the Department of Digital Systems at the University of Piraeus, Greece, (https://www.ds.unipi.gr/en/faculty/kanatas-en/) and the Director of the Telecommunication Systems Laboratory (http://tsl.ds.unipi.gr). He received the Diploma in Electrical Engineering from the National Technical University of Athens (NTUA), Greece, in 1991, the M.Sc. degree in Satellite Communication Engineering from the University of Surrey, Surrey, UK in 1992, and the Ph.D. degree in Mobile Satellite Communications from NTUA, Greece in February 1997. From 1993 to 1994 he was with National Documentation Center of National Research Institute. In 1995, he joined SPACETEC Ltd. as Technical Project Manager for VISA/EMEA VSAT Project in Greece. In 1996, he joined the Mobile Radio-Communications Laboratory as a research associate. From 1999 to 2002 he was with the Institute of Communication & Computer Systems responsible for the technical management of various research projects. In 2000, he became a member of the Board of Directors of OTESAT S.A. In 2002, he joined the University of Piraeus as an Assistant Professor. He has published more than 200 papers in international journals and conference proceedings. He is the author of 6 books in the field of wireless and satellite communications in Greek and/or English language. He has been the technical manager of several European and National R&D projects. His current research interests include V2X communications and cybersecurity issues for V2X communications in beyond 5G systems, the development of new waveforms and digital techniques for next generation wireless and satellite communications systems; channel characterization, simulation, and modeling for mobile and mobile-satellite communication systems; antenna design and array beamforming for next generation wireless systems; stochastic geometry for next generation wireless systems; UAV-assisted wireless communications. He has been a Senior Member of IEEE since 2002. In 1999, he was elected Chairperson of the Communications Society of the Greek Section of IEEE. From 2013 to 2017, he has served as Dean of the School of Information & Communication Technologies of the University of Piraeus, Greece. In 2021 he elected delegate of Region 15 (Greece, Cyprus, Israel, Turkey) in European Association on Antennas and Propagation (EurAAP). Ηe is an Editor of IEEE Transactions on Wireless Communications, an Associate Editor of IEEE Transactions on Antennas and Propagation, and Editor of IEEE Communication Letters. Publications Publications Journals A. G. Kanatas, H.K. Armeniakos, H. Dhillon, M. Di Renzo“Deterministic and Statistical Analysis of the DoF of Continuous Linear Arrays in the Near Field”, accepte for publication in IEEE Transactions on Communications, 2025. H. K. Armeniakos, P. S. Bithas, S. A. Tegos, A. G. Kanatas and G. K. Karagiannidis, “Stochastic Geometry for Modeling and Analysis of Sensing and Communications: A Survey,” in IEEE Communications Surveys & Tutorials, doi: 10.1109/COMST.2025.3594560, 2025. L. Tsipi, E. T. Michailidis, M. Karavolos, D. Vouyioukas and A. G. Kanatas, “AI-Driven Aerial Relay Placement and Power Allocation for Enhanced Secrecy in Untrusted UAV-Enabled Networks,” in IEEE Access, doi: 10.1109/ACCESS.2025.3577053, 2025. P. S. Bithas, A. G. Kanatas and K. Maliatsos, “Performance Analysis of Sensing-Assisted Communications in Aerial-to-Ground Networks,” in IEEE Open Journal of Vehicular Technology, vol. 6, pp. 1140-1151, 2025, doi: 10.1109/OJVT.2025.3559698, 2025. P.S. Bithas, G.P. Efthymoglou, A.G. Kanatas, K. Maliatsos, “Joint Sensing and Communications in Unmanned-Aerial-Vehicle-Assisted Systems”, Drones, 2024. H. Armeniakos, P.S. Bithas, K. Maliatsos, and A. G. Kanatas, “Joint Energy and SINR Coverage Probability in UAV Corridor-assisted RF-powered IoT Networks”, Accepted for publication in IEEE Communications Letters, 2024. H. Armeniakos, A. G. Kanatas and H. S. Dhillon, “Comprehensive Analysis of Maximum Power Association Policy for Cellular Networks Using Distance and Angular Coordinates,” in IEEE Transactions on Wireless Communications, doi: 10.1109/TWC.2024.3388845, 2024. H.K. Armeniakos, K. Maliatsos, P.S. Bithas, and A.G. Kanatas, “A stochastic geometry-based performance analysis of a UAV corridor-assisted IoT network”, Frontiers in Communications and Networks, 5:1337697, doi: 10.3389/frcmn.2024.1337697, 2024. A. G. Kanatas, “Spherical Random Arrays With Application to Aerial Collaborative Beamforming,” in IEEE Transactions on Antennas and Propagation, vol. 71, no. 1, pp. 550-562, Jan. 2023, doi: 10.1109/TAP.2022.3214845, 2023. C.K. Armeniakos and A.G. Kanatas, “Performance Comparison of Wireless Aerial 3D Cellular Network Models”, IEEE Communications Letters, 2022. A. G. Kanatas, “Coordinates Distributions in Finite Uniformly Random Networks,” in IEEE Access, doi: 10.1109/ACCESS.2022.3173312, 2022. C. Armeniakos, P. S. Bithas and A. G. Kanatas, “Finite Point Processes in a Truncated Octahedron-Based 3D UAV Network,” in IEEE Transactions on Vehicular Technology, doi: 10.1109/TVT.2022.3161758, 2022. C.K. Armeniakos, V. Tsekenis, V. Nikolaidis, K. Maliatsos, P.S. Bithas, A.G. Kanatas, “Human Fall Detetction Using mmWave Radars: A Cluster-Assisted Experimental Approach”, accepted for publication in Journal of Ambient Intelligence and Humanized Computing, 2022. A.G. Kanatas, “Analysis of Planar Random Arrays With Stochastic Geometry Tools”, IEEE Transactions on Antennas and Propagation, 2021. E.T. Michailidis, P. Bithas, N. Nomikos, D. Vouyioukas, A. Kanatas, “Outage Probability Analysis in Multi-User FSO/RF and UAV-enabled MIMO Communication Networks “, Physical Communication, 2021. K. Maliatsos, P.S. Bithas, A.G. Kanatas, “A Low-Complexity Reconfigurable Multi-Antenna Technique for non-Terrestrial Networks”, Frontiers in Communications and Networks-Aerial and Space Networks, 2021. V. Tsekenis, C.K. Armeniakos, V. Nikolaidis, P.S. Bithas, A.G. Kanatas, “Machine Learning-Assisted Man Overboard Detection Using Radars.”, Electronics, 10, 1345, 2021. C. Kalloniatis, C. Lambrinoudakis, M. Musahl, A. Kanatas, S. Gritzalis, “Incorporating privacy by design in Body Sensor Networks for Medical Applications: A Privacy and Data Protection Framework”, (https://doi.org/10.2298/CSIS200922057K) Computer Science and Information Systems, Vol. 18, No. 1, 323–350, 2021. C. K. Armeniakos, P. S. Bithas and A. G. Kanatas, “SIR Analysis in 3D UAV Networks: A Stochastic Geometry Approach,” (10.1109/ ACCESS.2020.3036983) in IEEE Access, vol. 8, pp. 204963-204973, 2020. P. S. Bithas, V. Nikolaidis, A. G. Kanatas and G. K. Karagiannidis, “UAV-to-Ground Communications: Channel Modeling and UAV Selection,” in IEEE Transactions on Communications, vol. 68, no. 8, pp. 5135-5144, Aug. 2020. E.T. Michailidis, S.M. Potirakis, A.G. Kanatas, “AI-Inspired Non-Terrestrial Networks for IIoT: Review on Enabling Technologies and Applications”, 1, 21-48, IoT 2020. K. Maliatsos, L. Marantis, P. S. Bithas, Athanasios G. Kanatas “Hybrid Multi-Antenna Techniques for V2X Communications: Prototyping and Experimentation”, accepted for publication, Telecom, 2020. D. K. Rongas, A. S. Paraskevopoulos, L. D. Marantis, and A. G. Kanatas, “An Integrated Shark-Fin Reconfigurable Antenna for V2X Communications”, Progress In Electromagnetics Research C, Vol. 100, 1–16, 2020. V. Nikolaidis, N. Moraitis, D. Vouyioukas, A. Kanatas, “Building Entry Loss and Capacity Evaluation of a UAV-to-Indoor Dual-Polarized MIMO Channel”, accepted for publication in IET Microwaves, Antennas & Propagation, 2020. E. T. Michailidis, N. Nomikos, P. Trakadas and A. G. Kanatas, “Three-Dimensional Modeling of mmWave Doubly Massive MIMO Aerial Fading Channels,” (10.1109/TVT.2019.2956460) in IEEE Transactions on Vehicular Technology, vol. 69, no. 2, pp. 1190-1202, Feb. 2020. P. Bithas , E. Michailidis , N. Nomikos , D. Vouyioukas , A. Kanatas, “A Survey on Machine-Learning Techniques for UAV-Based Communications”, accepted for publication in Sensors, 2019. C. Kalloniatis, V. Diamantopoulou, K. Kotis, C. Lyvas, K. Maliatsos, M. Gay, A. Kanatas, and C. Lambrinoudakis, “Towards the design of an assurance framework for increasing security and pri-vacy in connected vehicles”, accepted for publication in International Journal of Internet of Things and Cyber-Assurance, 2019. E. Michailidis , N. Nomikos , P. Bithas , D. Vouyioukas , A. Kanatas, “Optimal 3-D Aerial Relay Placement for Multi-User MIMO Communications”, accepted for publication in IEEE Transactions on Aerospace & Electronic Systems, 2019. P. Bithas, A. Kanatas, D. B. da Costa, P. K. Upadhyay, A. Hatziefremidis, “Novel Results for the Multivariate Ricean Distribution With Non-Identical Parameters”, accepted for publication in IEEE Transactions on Vehicular Technology, 2019. Bithas, A. Kanatas, D. Matolak, “Exploiting Shadowing Stationarity for Antenna Selection in V2V Communications”, (10.1109/TVT.2018.2888802) accepted for publication in IEEE Transactions on Vehicular Technology, 2018. Nikolaidis, N. Moraitis, P. S. Bithas and A. G. Kanatas, “Multiple Scattering Modeling for Dual-Polarized MIMO Land Mobile Satellite Channels,” (10.1109/TAP.2018.2854410) in IEEE Transactions on Antennas and Propagation, vol. 66, no. 10, pp. 5657-5661, Oct. 2018. Nikolaidis, N. Moraitis, A. Kanatas, “Statistical Characterization of an Urban Dual-Polari",
  "content_length": 37386,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:00"
}