{
  "name": "Athanasios D. Panagopoulos",
  "homepage": "http://users.ntua.gr/thanpan",
  "status": "success",
  "content": "Home Faculty Member Assistant Professor School of Electrical and Computer Engineering National Technical University of Athens, GR Athanasios D. Panagopoulos (S’98, M’02, SM’09): was born in Athens, Greece on January 26, 1975. He received the Diploma Degree in Electrical and Computer Engineering (summa cum laude) and the Dr. Engineering Degree from National Technical University of Athens (NTUA) in July 1997 and in April 2002. From May 2002 to July 2003, he served the Technical Corps of Hellenic Army. In September 2003, he joined School of Pedagogical and Technological Education, as part-time Assistant Professor, up to June 2008. From January 2005 to May 2008, he was Head of the Satellite Division of Hellenic Authority for the Information and Communication Security and Privacy. From May 2008 to May 2013 he was Lecturer in the School of Electrical and Computer Engineering of NTUA and now he is Assistant Professor. He has published more than 120 papers in international journals and more than 150 papers conference proceedings. He has also published more than 25 Book Chapters in International Books. He is the recipient of URSI General Assembly Young Scientist Award in 2002 (Commission F) and 2005 (Commission C). He is co-recipient of the Best Paper Award in the 2006 IEEE Radio and Wireless Symposium.  His research interests include radio communication systems design, mobile computing technologies, wireless and satellite communications networks and the propagation effects on multiple access systems and on communication protocols. He participates to ITU-R and ETSI Study Groups, he is member of Technical Chamber of Greece and Senior Member of IEEE. He is Chairman of the IEEE Greek Communication Chapter. He serves on the editorial boards of International Journal of Antennas and Propagation and Elsevier Physical Communication. Finally, he is an Associate Editor of IEEE Transactions on Antennas and Propagation and an Associate Editor in IEEE Communication Letters.",
  "content_length": 1986,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:58"
}