{
  "name": "Athena Stassopoulou",
  "homepage": "https://www.unic.ac.cy/stassopoulou-athena",
  "status": "success",
  "content": "Professor Athena Stassopoulou - University of Nicosia Skip to content APPLY Professor Athena Stassopoulou Professor Athena Stassopoulou Head of Department Professor School of Sciences and Engineering Department of Computer Science 22 841648 [email protected] Central Building›2nd Floor›B224 Brief CV Research Profile Google Scholar Dr Athena Stassopoulou is a Professor and Head of the Computer Science Department at the University of Nicosia. She holds a BSc in Computer Science and Mathematics (University of Manchester, UK) and a PhD in Artificial Intelligence (Center for Vision, Speech and Signal Processing, University of Surrey, UK). She worked as a Post-doctoral Researcher and as a Senior Research Associate at the Center for Mapping, NASA Commercial Space Center, The Ohio State University, USA, where she developed novel machine vision algorithms with applications in image understanding. She has worked in projects funded by NASA, the National Imagery and Mapping Agency (NIMA) in the USA, the European Union, and the RPF, Cyprus. She has also served as an External Evaluator and a Scientific Reviewer in projects of the European Union. Dr Stassopoulou has been publishing in international refereed journals and conferences in the following areas which constitute her research interests: uncertain reasoning, Bayesian Networks, Geographic Information Systems, Computer Vision and Image Understanding, Machine Learning, Neural Networks, Artificial Intelligence Applications for the Web and in Medicine. UNIC NICOSIA46 Makedonitissas Avenue, CY-2417P.O. Box 24005, CY-1700Nicosia, CyprusPhone.: +357 22 841500Email: [email protected] UNIC ATHENSNo. 17, 29th StreetElliniko 167 77Athens, GreecePhone:  +30 210 6748293Email: [email protected] USEFUL LINKSAll Academic ProgrammesUNIC Brand CentreUNIC in the NewsVerify a CertificateCareers at UNIC CONNECT WITH UNICSubscribe to NewslettersCopyright © University of Nicosia. All Rights Reserved | Privacy Policy | Terms & Conditions Page load link Live chat is available. Activate it by agreeing to the use of marketing cookies here. Please refresh the page after activation. × Go to Top",
  "content_length": 2143,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:58"
}