{
  "name": "Atm Shafiul Alam",
  "homepage": "http://eecs.qmul.ac.uk/profiles/alamatm.html",
  "status": "success",
  "content": "Dr Atm Alam - School of Electronic Engineering and Computer Science Skip to main content School of Electronic Engineering and Computer Science School of Electronic Engineering and Computer SciencePeopleProfiles Dr Atm AlamLecturerEmail: a.alam@qmul.ac.ukRoom Number: Engineering, Eng 212Website: https://atmalam.wordpress.com/TeachingResearchTeachingCloud Computing (BUPT joint programme)Cloud computing is to represent the future of modern computing. This module provides students adequate information on the basic topics of cloud computing, such as cloud infrastructure, service oriented architectures, data storage and protocols. This module also introduces current platforms, social networking and explores the managing and security issues. This module contains practical topics requiring students to understand how to develop applications on the cloud using the application programming interfaces(APIs).Digital Circuit Design (BUPT joint programme)Image and Video Processing (BUPT joint programme)This course provides fundamental knowledge about well-established techniques for digital image and video processing. It covers mathematical models used to analyse still images, technology and standards for image and video compression and the basic methods used to design and develop a wide range of imaging solutions. Such solutions relate to the fields of machine vision, imaging graphics, pattern recognition, medical imaging, image and video coding. Digital image representation, Sampling, Quantization, Sub-sampling, Pixel interpolation. Histograms: definition, properties, colour histograms, thresholding, segmentation, equalization. Using Matlab for the coursework. Detailed content: Algebraic transformations, Edge detection, Interest points, JPEG, JPEG2000, JPEG vs. JPEG2000. 2D wavelet decomposition, Tier, Layer, Region of interest, Introduction to colour image processing, Motion pictures, Video coding standards, Predictive coding, H.261, MPEG-1/2/4/AVC/HEVC.Information Systems Management (BUPT joint programme)ResearchResearch Interests: My broad research interests are in the areas of wireless communications:Communications and networks: Modelling and analysis of mobile communication networks and protocols (5G and beyond), design of next-generation wireless communication architecture (5G/B5G testbed), smart spectrum and interference management, ultra-reliable and low latency communications (URLLC), self-organizing network for UAVs, machine-type communications, fog networks and edge computing, Internet-of-things (IoT), integration of satellite and terrestrial networks.AI for communications: Optimization and intelligent algorithm design for next-generation communication systems.Emerging applications of wireless communications in other sectors and industries such as intelligent transport systems (V2X), smart grids, smart cities/homes, factory automation, healthcare, public safety and nuclear control (wireless protocols).Data analytics and big data: Statistical modelling and prediction.ICT economy: Wireless communication technologies as the key contributor to new digital economy.Pedagogic Research:Technology-enhanced teaching and learning.Gamification for creative teaching and learning. Back to top",
  "content_length": 3233,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:01"
}