{
  "name": "Atsuko Takefusa",
  "homepage": "https://www.nii.ac.jp/en/faculty/architecture/takefusa_atsuko",
  "status": "success",
  "content": "TAKEFUSA Atsuko - Information Systems Architecture Science Research Division - Faculty - Research - å½ç«æ å ±å­¦ç ç©¶æ / National Institute of Informatics ACCESS CONTACT æ¥æ¬èª About NII Introduction Greeting from the Director-General Mission & Strategies Overview of NII History Administrative Council Organization Charts Intellectual Properties Staff / Budget Outline and Catalogue of National Institute of Informatics PR Video International Exchange International Exchange based on MOU Conclusion of International Exchange Agreements or MOUs NII International advanced lectures series on ICT NII Shonan Meeting Global Liaison Office (GLO) - DAAD Alumni NII Library NII Library Usage Guide(For General Public) NII Library Accessing databases via GakuNin International Seminar House for Advanced Studies Advanced ICT Center Publications NII Today PR Video Recruitment Access National Institute of Informatics (National Center of Sciences) Kashiwa Annex International Seminar House Contact News Event Link Sitemap Research Research Divisions Research Centers Research and Development Center for Academic Networks Research Center for Knowledge Media and Content Science Research Center for Community Knowledge Center for Cloud Research and Development Center for Dataset Sharing and Collaborative Research Center for Strategic Cyber Resilience Research and Development Research Center for Open Science and Data Platform Center for Research Data Ecosystem Development Center for Trust & Digital Identity Research and Development Global Research Center for Quantum Information Science Global Research Center for Big Data Mathematics Research Center for Mathematical Trust in Software and Systems Research Center for Medical Bigdata Global Research Center for Synthetic Media Research and Development Center for Large Language Models Center for Advanced Mobile Driven Research Faculty Director-General Executives(related to research) Principles of Informatics Research Division Information Systems Architecture Science Research Division Digital Content and Media Sciences Research Division Information and Society Research Division Directory of Faculty and Staff index Professor Emeritus Major Project Involvement Kakenhi Human Resource Development Top SE Experts in Information Science Quantum Technology Education:A New Approach Collaborative Research Promotion Collaboration with Industry, Government, and Academia Research Results Progress in Informatics NII Technical Reports Service Network SINET6 Research Data Cloud GakuNin RDM JAIRO Cloud CiNii Research CiNii Books IRDB Authentication Infrastructure GakuNin eduroam JP UPKI Notice of Authentication Service Maintenance Cloud GakuNin Cloud GakuNin Cloud Adoption Support Service GakuNin Cloud Gateway Service GakuNin Cloud On-Demand Configuration Service SINETStream Information Security NII Security Operation Collaboration Services (NII-SOCS) Princess Rinrin's information security column Scholarly Communication NACSIS-CAT/ILL E-resources Data Sharing Services KAKEN NII-REO Collaboration Collaboration with University Libraries Japan Alliance of University Library Consortia for E-Resources Future Scholarly Information Systems Committee Japan Consortium for Open Access Repository SPARC Japan Research Data Ecosystem Development Project to Promote the Use of AI HPCI mdx Academic Information Infrastructure Open Forum Human Resource Development GakuNin LMS Education and Training Services NII JMOOC | gacco Experts in Information Science Computer Science Park Graduate Program Research Research Faculty Information Systems Architecture Science Research Division TAKEFUSA Atsuko Information Systems Architecture Science Research Division TAKEFUSA Atsuko Information Systems Architecture Science Research Division, Professor Research Fields: Parallel and distributed processing; Cloud infrastructure technologies; IoT; Cyber-physical systems; Security Degrees: Ph.D. (Science) Detail: https://researchmap.jp/takefusa/ Introduction Research and development of inter-cloud technology Cloud computing (the cloud) is a computing technology that orchestrates individual computers via network to use the computing power and storage capacity as resources. The cloud could be used to reduce capital investment in institutions such as universities. It could reduce its cost for office environments and it has flexibility to handle situations when resources are needed temporarily such as computer class for students. for practical classes using computers. Cloud could also respond quickly to future trends in any kind of platforms. The inter-cloud: connecting clouds I have been researching resource management in distributed computing such as the grids and clouds. I have developed a technology to construct an international network path dynamically in order to perform analyses and computations using resources provided by various research institutions. I am currently working on fundamental technologies to allow users to easily construct their computing environment on a cloud and connect it to another cloud or clouds on-demand. This is to develop inter-cloud technologies. The Internet enables mutual uses between networks, whereas the inter-cloud connects cloud to cloud and allows more effectively beneficial uses. Security and performance have been an issue of the inter-cloud network. But the launch of the Science Information Network \"SINET 5\" which connects universities, research institutions, and multiple public clouds led to create an high performance inter-cloud environment to be build. Advantages and future of the inter-cloud There are several advantages to the inter-cloud. One of them is disaster recovery: When one cloud goes down due to a large-scale disaster, then another cloud in a distance place could take over the process running in the original cloud. Dispersion and redundant backup of the data are also possible. In addition, scale-out uses public cloud resources in order to maintain service quality in cases of resource shortage of the private cloud, e.g., a university with minimum number of computers. Major cloud companies tend to enclosed users in their own systems, but the inter-cloud is a very important technology in the academia. The processing vast amounts at the experiments of data from Large Hadron Collider (LHC) experiments at the European Organization for Nuclear Research (CERN) contributed the discovery of the Higgs boson, for which the Nobel Prize in Physics was awarded in 2013. Systems that enables research institutions all over the world to share and process data instantly are needed for such Big Science. Promoting widespread use of the inter-cloud The bandwidths of infrastructure networks will continue to increase in the future, and having Tokyo Olympics soon, we will probably see many new applications with improved realism. The processing of these applications will be carried out in the cloud, so the amount of data will naturally increase. This will make technologies for managing data and resources on multiple clouds and the network between those clouds more and more important. Many issues will emerge and need to be addressed in order to use these technologies efficiently. I hope to provide environments that enable people to do what they wish to do, without noticing the usage of the inter-cloud, by developing fundamental technologies. On-demand construction of a computing environment using multiple distributed clouds Scientific computing using multiple clouds Research data Computation results Cloud data center Data redundancy management, scale-out of services View research contents with researchmap ãã¤ã¼ã Research Divisions Research Centers Research and Development Center for Academic Networks Research Center for Knowledge Media and Content Science Research Center for Community Knowledge Center for Cloud Research and Development Center for Dataset Sharing and Collaborative Research Center for Strategic Cyber Resilience Research and Development Research Center for Open Science and Data Platform Center for Research Data Ecosystem Development Center for Trust & Digital Identity Research and Development Global Research Center for Quantum Information Science Global Research Center for Big Data Mathematics Research Center for Mathematical Trust in Software and Systems Research Center for Medical Bigdata Global Research Center for Synthetic Media Research and Development Center for Large Language Models Center for Advanced Mobile Driven Research Faculty Director-General Executives(related to research) Principles of Informatics Research Division FUJII Kaito HIRAHARA Shuichi KAWARABAYASHI Ken-ichi KOBAYASHI Taisuke KUROIWA Ryo MATSUMOTO Keiji SATO Ryoma SHIGAKI Shunsuke SOEDA Akihito SUGIYAMA Mahito TAKEDA Hideaki TATSUTA Makoto UNO Takeaki WATANABE Kazuki WELLNITZ Philip YOSHIDA Yuichi Information Systems Architecture Science Research Division AIDA Kento AOKI Shunsuke FUJIWARA Ikki FUKUDA Kensuke GOSHIMA Masahiro HASUO Ichiro ISHIKAWA Fuyuki JI Yusheng KANEKO Megumi KATO Hiroyuki KITAGAWA Naoya KOIBUCHI Michihiro KURIMOTO Takashi SAKANE Eisaku SATO Hiroyuki SEKIYAMA Taro SHIMIZU Sayako TAKAKURA Hiroki TAKEFUSA Atsuko Digital Content and Media Sciences Research Division AIZAWA Akiko ANDRES Frederic ASANO Yuta HUANG Lang IKEHATA Satoshi KANAZAWA Teruhito KATAYAMA Norio KITAMOTO Asanobu KODAMA Kazuya KOMIYAMA Yusuke KOYAMA Shoichi KURITA Shuhei MO Hiroshi PRENDINGER Helmut SATO Imari SATOH Shin'ichi SUGAWARA Saku SUGIMOTO Akihiro TAKASU Atsuhiro YAMAGISHI Junichi YAMAJI Kazutsuna Information and Society Research Division ARAI Noriko BONO Mayumi ECHIZEN Isao FUNAMORI Miho FURUKAWA Masako GOTODA Hironobu KANDO Noriko KATAOKA Hiroshi KATO Makoto MIZUNO Takayuki NISHIZAWA Masaki OKADA Hitoshi SANO takiko SATOH Ichiro SUN Yuan UEKI Kouichirou Directory of Faculty and Staff index Research staff Other research staff Professor Emeritus Major Project Involvement Kakenhi Human Resource Development Top SE Experts in Information S",
  "content_length": 10728,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:00"
}