{
  "name": "Audrey Durand",
  "homepage": "https://audur2.ift.ulaval.ca",
  "status": "success",
  "content": "Audrey Durand - Academic Website Audrey Durand - Academic Website Audrey Durand Canada CIFAR AI Chair Associate Professor Computer Science and Software Engineering Department Electrical and Computer Engineering Department Université LavalQuébec (QC) G1V 0A6Canada Email: audrey.durand@ift.ulaval.ca I am an Associate Professor in Computer Science and Software/Computer/Electrical Engineering at Université Laval (Québec City, Canada), where I am a core member of the Institute Intelligence and Data (IID). I am also affiliated with Mila — Quebec Artificial Intelligence Institute through a Canada CIFAR AI Chair. My research is focused on interactive learning, where the learning model shapes and is shaped by its data collection or exposure process. This includes: Reinforcement learning (RL) Bandits Active learning Partial monitoring Continual/incremental learning with feedback loops I am also interested in leveraging interactive learning in scientific applications, with a focus on health science. Publications: My Google scholar Teaching: My RL course videos (in French!) Students I currently (co-)supervise these students/postdocs: Caro Strickland (postdoctoral researcher) Randy Lefebvre (PhD student) Guylain Breton (MSc student, director, co-supervisor: Benoît Gosselin) Julien Armand (MSc student) Bruno Joyal (MSc student) Yohai-Eliel Berreby (PhD student, co-supervisor, director: Suresh Krishna) Hugo Delhaye (MSc student, co-supervisor, director: Lune Bellec) Baptiste Bonin (MSc student) Kaoutar Mimouni (MSc student) Hadi Moazen (PhD student, director, co-supervisor: Flavie Lavoie-Cardinal) Alexandre Larouche (PhD student, director, co-supervisor: Mario Marchand) Maxime Heuillet (PhD student, director, co-supervisor: Ola Ahmad) Mathieu Godbout (PhD student) Anthony Bilodeau (PhD student, co-supervisor, director: Flavie Lavoie-Cardinal) Past I previously (co-)supervised the following students/postdocs: Frédéric Dulude-de-Broin (PhD 2020-2025, co-supervisor, director: Pierre Legagneux) Yasmeen Hitti (PhD 2019-2025, co-supervisor, director: Mark Lefsrud), now postdoc at U. de Montréal Charles Bourbeau (MSc 2022-2024), now at Icentia Dorra Rakia Allegue (postdoctoral researcher 2023-2024) Alexandre Bouras (MSc 2021-2024, director, co-supervisor: Richard Khoury) Guillaume Desmarais-De Grandpré (MSc 2020-2024, co-supervisor, director: Richard Khoury) Louis-Philippe Vignault (MSc 2021-2024, director, co-supervisor: Pascal Germain), now at LTI Informatique et Génie Catherine Villeneuve (MSc 2021-2023, director, co-supervisor: Pierre Legagneux), now PhD student at McGill University Benoît Turcotte (MSc 2020-2023, director, co-supervisor: Flavie Lavoie-Cardinal) Albert Michaud-Gagnon (MSc 2020-2023, co-supervisor, director: Flavie Lavoie-Cardinal) Rupali Bhati (MSc 2020-2023), now PhD student at Northearstern University Renaud Bernatchez (MSc 2020-2023, co-supervisor, director: Flavie Lavoie-Cardinal) Théophile Berteloot (MSc 2020-2022, co-supervisor, director: Richard Khoury), now PhD student at U. Laval Roseline Olory (postdoctoral researcher 2022, co-supervised with Flavie Lavoie-Cardinal), founder of BrainInnov Alexandre Larouche (MSc 2021-2022, director, co-supervisor: Richard Khoury), now PhD student at U. Laval Antoine Gariépy (MSc 2020-2022), now at Norda Stelo François-Alexandre Tremblay (MSc 2020-2022, co-supervisor, director: Jonathan Gaudreault), now at Baseline Deepak Sharma (MSc 2019-2021, co-supervisor, director: Joelle Pineau), now at Nuance-Microsoft Seyed Moustafa Mousavi (MSc 2019-2021, co-supervisor, director: Holly Witteman) Mathieu Godbout (MSc 2019-2020, co-supervisor, director: Luc Lamontagne), now PhD at U. Laval Louis-Émile Robitaille (MSc 2019-2020, co-supervisor, director: Christian Gagné), now at Coveo Suggested readings Some books to get into RL and bandits: Bandit Algorithms by Tor Lattimore and Csaba Szepesvari Algorithms for Reinforcement Learning by Csaba Szepesvari",
  "content_length": 3954,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:01"
}