{
  "name": "Augustin Chaintreau",
  "homepage": "http://www.cs.columbia.edu/~augustin",
  "status": "success",
  "content": "Augustin Chaintreau @ Columbia CS Augustin Chaintreau Assistant Professor, Computer Science Department Columbia University Mail to: 1214 Amsterdam Ave, Mailcode 0401 New York, NY 10027 Office: Phone: email: CEPSR 610 +1 212 939-7082 augustin@cs.columbia.edu Home Publications Resume Research Interests I design algorithms and mathematical analysis of networks. The goal of my research is to reconcile the benefits of leveraging personal data and social networks with a commitment to fairness and privacy. Latest results of my research address transparency in personalization, fairness in personal data markets, efficiency of crowdsourced content curation, and privacy of users across several domains. Some Recent Papers (complete chronological list) M. Gabielkov, A. Ramachandran, A. Chaintreau, and A. Legout, Social Clicks: What and Who Gets Read on Twitter?, SIGMETRICS '16: Proceedings of the ACM SIGMETRICS/international conference on Measurement and modeling of computer systems, Jun. 2016. Y. Zeng, A. Chaintreau, D. Towsley, and C. H. Xia, A Necessary and Sufficient Condition for Throughput Scalability of Fork and Join Networks with Blocking, SIGMETRICS '16: Proceedings of the ACM SIGMETRICS/international conference on Measurement and modeling of computer systems, Jun. 2016. C. Riederer, Y. Kim, A. Chaintreau, N. Korula, and S. Lattanzi, Linking Users Across Domains with Location Data: Theory and Validation, WWW '16: Proceedings of the 25th international conference on World Wide Web, Apr. 2016. A. Ramachandran and A. Chaintreau, Who Contributes to the Knowledge Sharing Economy?, COSN '15: Proceedings of the third ACM conference on Online social networks, pp. 37-48, Nov. 2015. C. J. Riederer, S. Zimmeck, C. Phanord, A. Chaintreau, and S. M. Bellovin, I don't have a photograph, but you can have my footprints.: Revealing the Demographics of Location Data, presented at the COSN '15: Proceedings of the third ACM conference on Online social networks, Nov. 2015, pp. 185-195. M. Lecuyer, R. Spahn, Y. Spiliopolous, A. Chaintreau, R. Geambasu, and D. Hsu, Sunlight: Fine-grained Targeting Detection at Scale with Statistical Confidence, presented at the CCS '15 Proceedings of the 22nd ACM SIGSAC Conference on Computer and communications, oct. 2015. media coverage of my research On what people read in social media in Washington Post, Fortune, New Scientist, NY Daily News, PC Mag, Daily Mail, Times of India, Les Echos, 20 Minutes, Slate.fr, BFM TV, La Stampa. On revealing the risk of your location data in BuzzFeed, CBS, Forbes. On fair use of data in the Economist and on ad targeting policies in Slate. On web transparency featured in the New York Times bits blog, the Guardian Technology Blog, FastCompany co.exist. On online advertisment revenues featured in MIT Technological Review. On secure tools for journalists featured in lawyers.com. Interview on Privacy and Internet of Things in O'Reilly Report. Interview on Geo-Personalization of Search Engines in NY Daily News. Interview on Privacy in Social Networks in ThinkProgress. Interview on Crowdsourcing in MIT Technological Review. Interview on Social Network Dating Apps in Columbia Spectator. This year's research community service PC Co-chair for ACM SIGMETRICS. General Chair for the Data Transparency Lab Conference 2016. Area editor for IEEE Transactions on Mobile Communication. Member of the Board of Director for ACM SIGMETRICS. Prior to that, I was area editor for ACM SIGCOMM Computer Communication Review, ACM GetMobile, and Program Co-chair (with Luigi Rizzo) of ACM CoNEXT 2014. I also promoted and co-organized student shadow PCs for ACM CoNEXT and ACM SIGMETRICS, and the student travel grant for ACM SIGCOMM and ACM COSN. I also participated as members of the program committees for more than thirty conferences, including ACM SIGCOMM, ACM SIGMETRICS, ACM WWW, ACM MOBICOM, ACM WSDM, ACM COSN, ACM CoNEXT, ACM MOBIHOC, USENIX/ACM IMC, AAAI ICWSM, IFIP PERFORMANCE, IEEE INFOCOM. Teaching In Fall 2016: COMS 4995: Introduction to Social Networks . Teaching materials available through this link. In Spring 2015: CSEE 4119: Computer Networks . Teaching materials available through this link. In Fall 2014: COMS 6998: Social Networks . Teaching materials available through this link. In Spring 2014: CSEE 4119: Computer Networks . Teaching materials available through this link. In Fall 2013: COMS 6998-1: Social Networks Economics . Teaching materials available through this link. In Spring 2013: CSEE 4119: Computer Networks . Teaching materials available through this link. In Fall 2012: COMS 4995-1: Introduction to Social Networks . Teaching materials available through this link. In Spring 2012: CSEE 4119: Computer Networks . Teaching materials available through this link. In Fall 2011: COMS 4995-1: Introduction to Social Networks . Teaching materials available through this link. In Spring 2011: COMS 6998-2: Analysis of Social Information Networks . Teaching materials available through this link. If you happen to like the graphic design of this webpage, make sure to tell Prof. S. Chong who originally designed it for his own webpage. Last updated in March 2011.",
  "content_length": 5173,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:03"
}