{
  "name": "Aura Conci",
  "homepage": "http://www2.ic.uff.br/~aconci",
  "status": "success",
  "content": "Prof. Aura Conci Aura Conci Prof. Titular Department of Computer ScienceSala 557 - 5. andar - Bloco do ICCampus da Praia Vermelha Av. Gal. Milton Tavares de Souza, s/n Sao Domingos - Niteroi - RJ CEP: 24210-346 fax +55 (21) 2629.5665 , IC ext. 6279. tel. 2629 5627 , 2629 5628, 2629 5629 - secr. pos-grad. +55 (21) 2629 5669, 2629 5670 - secr. dep. E-mail: aconci@ic.uff.br Dedicated people never need a path, they make their own ways to reach the destiny. Orcid: 0000-0003-0782-2501 Scopus: Id 6701460323 Publications: 2025 2024 . 2023 . 2022 . 2021 . 2020 . 2019 . 2018 . 2017 . 2016 . 2015 . 2014 . 2013 . 2012 . 2011 . 2010 . 2009 . 2008 . 2007 . 2006 . 2005 . 2004 . 2003 . 2002 . 2001 . 2000 . 1999 . 1998 . 1997 . 1996 . 1995 . Courses: Image Analysis / Analise de Imagens Numerical Methods / Metodos Numericos Computer Graphics / Computacao Grafica Image & Signal Processing / Processamento de Sinais e Imagens Applied Computing / Informatica Aplicada Matematical Morfology / Morfologia Matematica Computer Programming / Programacao de Computadores V Creating WEB Pages / Construcao de Paginas WEB/ Introduction to Computer Science/ Introducao a Informatica Fractal Geometry / Geometria Fractal Projects: FAPERJ - Proc. No E26.200.924/2022 - Program: Scientist of our State - (Cientista do nosso Estado - CnE) (2022-2026) FAPERJ - Proc. No E26. 210.019/2020 Support Program for Thematic Projects in the State of RJ 2019 - Track A - UFF/INT - USE OF 3D SCANNING AND PRINTING TO EVALUATE CHANGES IN THE SURFACE OF THE BREAST FOR INVESTIGATION OF BREAST CANCER (USO DA DIGITALIZACAO E DA IMPRESSAO 3D PARA AVALIACAO DE ALTERACOES DA SUPERFICIE DA MAMA PARA INVESTIGACAO DO CANCER DE MAMA). Digit3D (2020-2024) - DataSet developed by the project. Red Tematica \"Smart Cities\" do Programa Iberoamericano de Ciencia y Tecnologia para el Desarrollo - CYTED: (Universidad de Buenos Aires, Universidade Federal Fluminense, Universidad del Bio-Bio, Escuela Superior Politecnica del Litoral, Universidad Rey Juan Carlo, Universidad Autonoma de Madrid, Universidad Autonoma de Barcelona, Universidad de Guanajuato, CIMAT, Universidade do Aveiro) (2018-2022). Erasmus+ (Oct-2016 to July-2025) - UPB (Bucarest) - UFF (Niteroi) - Projects: e-Prep e-VET & Digi4me . Visual Lab. : Database for Mastologic Researches (DMI) . Universal Project (Projeto Universal) CNPq 402988/2016-7 ( dez-2021) : Lumbar Puncture and Anesthesia (Puncao Lombar e anestesias). MACC - Medicine Assisted by Scientific ComputationMedicina Assistida por Computacao Cientifica Visible Human Project International cooperation: Professor Yan Tian, School of Computer Science, Zhejiang Gongshang University Centre for Disease Modelling (CDM) - York University Diseases and diagnostics modelling: Infrared images for thyroid diseases. HUAP - Endocrinology Service. Research Project: \"Assessment of the Importance of Thermography in Aiding the Diagnostic Investigation of Thyroid Nodules in Patients Followed at HUAP-UFF\" ( Projeto de Pesquisa: \"Avaliacao da Importancia da Termografia no Auxilio a Investigacao Diagnostica de Nodulos Tireoidianos em Pacientes Acompanhados no HUAP-UFF\") , Responsible Researcher: Giovanna Aparecida Balarini Lima) ZIKA : MRI evaluation of neurological complications in patients and fetuses infected zika virus (Avaliacao por RM das complicacaes neurologicas em pacientes e fetos infectados pelo zika virus)Principal (Responsible Researcher): C. A. P. FONTES , from : 27/02/2016, reg. Plataforma Brasil : www.saude.gov.br/plataformabrasil , plataformabrasil@saude.gov.br Cancer: Universidad Tecnologica de Pereira, Colombia, Grupo de Electrofisiologia y red ARTINSA, 2020-2024. Pro Engenharias - CAPES - 2008 a 2013: Image Processing Applied to Mastology Indicated to the award of application for SUS2016 . Pro CAD-NF 2009 a 2013- CAPES: Analysis of Mastological Images CT Segmentation - award of SUS of best dissertion of 2016 at UFFin exact sciences. Neurodegenerative disease. Finalist of award for technologies for the SUS 2013 Pro CAD 2008 a 2012 - CAPES: GPU clusters Cluster de GPUs Meeting Organization: LIQUE 2025IMX ACM 2025 LIQUE 2023IMX ACM 2023 ICGG 2022ICGG2021 . LIQUE 2022IMX ACM 2022 . LIQUE 2021IMX ACM 2021 . IWSSIP 2020 conference . photos of 2010 as pptphotos of 2010 as pdf . IWSSIP 2010 Proceedings . News: UFF / news . BITS Ciencia . Invitation:: book! . . . . . . Early diagnosis of breast diseases.Detecao precoce de doencas dos seios / . Approval of the ethics committee of the Brazilian Ministry of Health/ Projeto aprovado pelo comite de etica do ministerio da saude brasileiro . Thermal image database for detection breast diseasesCriacao e publicacao de um banco de imagens termica.. Books: Graphics & Image Processing: 3th Ed. - JavaScript : Colaborations: Non Linear and Chaos grupo GAVAB : Universidad Rey Juan Carlos - Madrid Escuela Superior de Ciencias Experimentales y TecnologiaLaboratoire de Mecanique et Acoustique, Universite Aix-Marseille , CNRS Universite d Orleans, Polytech Orleans, Institut PRISME Programa de Pos Graduacao em Eng. Eletrica UFMA - LabPAI LIA - Laboratorio de Investigacao Audiovisual. Cinema na UFFProjeto Bestiaire - Multimidia winner 14th Edition Mobius prize (see more....) Other: Birthday Photos/Fotos Projeto Fusion Pesquisa Anteriores - versao PDF Former projects (English Version) Former personal pages Tips: ABCMPeriodicos Chess without Mystery , Richard M. Stephan e Alan C. Kubrusly Ed. Ciencia Moderna. ISBN: 9788573936179 How read Greek in minutes ! ? ! Data set INFRARED images in UFF Pos-Graduacao em Computacao (PGC) Graduacao em Ciencia da Computacao (CC) IFRO (Instituto Federal de Educacao, Ciencia e Tecnologia de Rondonia) Universidade Federal Fluminense (UFF)",
  "content_length": 5736,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:08"
}