{
  "name": "Aurojit Panda",
  "homepage": "https://cs.nyu.edu/~apanda",
  "status": "success",
  "content": "Aurojit Panda Aurojit Panda 405, 60 Fifth Ave. Mail Trackers Verboten @apanda apanda I am an associate professor in Computer Science at NYU. Previously, I received my PhD from UC Berkeley where I was advised by Scott Shenker and worked in the NetSys Lab. Even earlier, I received a Sc.B. with honors in Math-CS from Brown. Before starting at NYU, I spent a year as a software developer at Nefeli Networks, a startup focused on solutions for Network Function orchestration. Between Brown and Berkeley I spent a few years working on the Midori kernel at Microsoft. I work on systems and networking problems. I am particularly interested in approaches to improve system reliability, either by identifying bugs before deployment or by improving fault tolerance. Please see my publications for recent interests. Working with me I am interested in working with NYU undergraduates, masters and PhD students. Please look at recent papers to get a sense of the type of work I do: I am generally open to working on a variety of topics. If you are a NYU undergraduate or masters student: it is easiest if you have either taken a class I taught (and done well) or have prior experience (e.g., from internships or prior employment) in systems or networking. If you are applying for a PhD at NYU: I am always interested in recruiting students, you can just mention me in your applications. You do not need to send me an e-mail before applying, and I cannot evaluate your application. Teaching Fall 2025 Undergraduate Operating Systems Spring 2025 Distributed Systems Spring 2024 Distributed Systems Fall 2023CS202: Undergraduate Operating Systems Spring 2023 Big Data and Machine Learning Fall 2022 Distributed Systems Spring 2022 Big Data and Machine Learning Fall 2021 Distributed Systems Spring 2021 Big Data and Machine Learning Fall 2020 Distributed Systems Spring 2020 Undergraduate Operating Systems Fall 2019 Undergraduate Computer Networks Fall 2018 Distributed Systems Publications 2026 CLM: Removing the GPU Memory Barrier for 3D Gaussian Splatting. Hexu Zhao, Xiwen Min, Xiaoteng Liu, Moonjun Gong, Yiming Li, Ang Li, Saining Xie, Jinyang Li, Aurojit Panda. ASPLOS 2026. Preprint It Takes Two to Entangle. Zhanghan Wang, Ding Ding, Hang Zhu, Habin Lin, Aurojit Panda. ASPLOS 2026. Preprint 2025 Beyond Lamport, Towards Probabilistic Fair Ordering. Muhammad Haseeb, Jinkun Geng, Radhika Mittal, Aurojit Panda, Srinivas Narayana, Anirudh Sivaraman. HotNets 2025. Demystifying Performance of eBPF Network Applications. Farbod Shahinfar, Sebastiano Miano, Aurojit Panda, Gianni Antichi. CoNEXT 2025. Reasoning Models Know When They’re Right: Probing Hidden States for Self-Verification . Anqi Zhihong, Yulin Chen, Jane Pan, Chen Zhao, Aurojit Panda, Jinyang Li, He He. COLM 2025. Performance Implications at the Intersection of AF_XDP and Programmable NICs. Marco Molè, Farbod Shahinfar, Francesco Maria, Davide Zoni, Aurojit Panda, Gianni Antichi. eBPF 2025. Designing a Datacenter-wide Distributed Shared Log. Micah Murray, Wen Zhang, Aisha Mushtaq, Natahca Crooks, Aurojit Panda, Scott Shenker. HotOS 2025. Understanding Stragglers in Large Model Training Using What-if Analysis. Jinkun Lin, Ziheng Jiang, Zuquan Song, Sida Zhao, Menghan Yu, Zhanghan Wang, Chenyuan Wang, Zuocheng Shi, Xiang Shi, Wei Jia, Zherui Liu, Shuguang Wang, Haibin Lin, Xin Liu, Aurojit Panda, Jinyang Li. OSDI 2025. On Scaling Up 3D Gaussian Splatting Training. Hexu Zhao, Haoyang Weng, Daohan Lu, Ang Li, Jinyang Li, Aurojit Panda, Saining Xie. ICLR 2025. Preprint Runtime Protocol Refinement Checking for Distributed Protocol Implementations. Ding Ding, Zhanghan Wang, Jinyang Li, Aurojit Panda. NSDI 2025. 2024 Incremental Specialization of Network Programs. Fabian Ruffy, Zhanghan Wang, Gianni Antichi, Aurojit Panda, and Anirudh Sivaraman. HotNets 2024. An Architecture for Edge Networking Services. Lloyd Brown, Emily Marx, Dev Bali, Emmanuel Amaro, Debnil Sur, Ezra Kissel, Inder Monga, Ethan Katz-Bassett, Arvind Krishnamurthy, James McCauley, Tejas Natechania, Aurojit Panda, and Scott Shenker. SIGCOMM 2024. Efficient Auditing of Event-driven Web Applications. Ioanna Tzialla, Jeffery Wang, Jingyi Zhu, Aurojit Panda, Michael Waflish. EuroSys 2024. 2023 Of Apples and Oranges: Fair Comparisons in Heterogenous Systems Evaluation Hugo Sadok, Aurojit Panda, Justine Sherry. HotNets 2023. Logical memory pools: Flexible and local disaggregated memory. Emmanuel Amaro, Stephanie Wang, Aurojit Panda, Marcos K. Aguilera. HotNets 2023. How I Learned to Stop Worrying About CCA Contention. Lloyd Brown, Yash Kothari, Akshay Narayan, Arvind Krishnamurthy, Aurojit Panda, Justine Sherry, Scott Shenker. HotNets 2023. Automatic Kernel Offload using BPF. Farbod Shahinfar, Sebastiano Milano, Giuseppe Siracusano, Roberto Bifulco, Aurojit Panda, Gianni Antichi. HotOS 2023. Access Control for Database Applications: Beyond Policy Enforcement. Wen Zhang, Aurojit Panda, Scott Shenker. HotOS 2023. Enso: A Streaming Interface for NIC-Application Communication. Hugo Sadok, Nirav Atre, Zhipeng Zhao, Daniel S. Berger, James C. Hoe, Aurojit Panda, Justine Sherry, Ren Wang. OSDI 2023. Fine-Grained Re-Execution for Efficient Batched Commit of Distributed Transactions. Zhiyuan Dong, Zhaoguo Wang, Zhang Xiaodong, Xu Xian, Changgeng Zhao, Haibo Chen, Aurojit Panda, Jinyang Li. VLDB 2023. NNSmith: Generating Diverse and Valid Test Cases for Deep Learning Compilers. Jiawei Liu, Jinkun Lin, Fabian Ruffy, Cheng Tan, Jinyang Li, Aurojit Panda, Lingming Zhang. ASPLOS 2023. 2022 The Case for an Internet Primitive for Fault Localization. Will Sussman, Emily Marx, Venkat Arun, Akshay Narayan, Mohammad Alizadeh, Hari Balakrishnan, Aurojit Panda, Scott Shenker. Hotnets 2022. Measuring the Effect of Training Data on Deep Learning Predictions via Randomized Experiments. Jinkun Lin, Anqi Zhang, Mathias Lécuyer, Jinyang Li, Aurojit Panda, Siddhartha Sen. ICML 2022. Blockaid: Data Access Policy Enforcement for Web Applications. Wen Zhang, Eric Sheng, Michael Chang, Aurojit Panda, Mooly Sagiv, Scott Shenker. OSDI 2022. CostCO: An automatic cost modeling framework for secure multi-party computation. Vivian Fang, Lloyd Brown, William Lin, Wenting Zheng, Aurojit Panda, Raluca Popa. Euro S&P 2022. Isolation mechanisms for high-speed packet-processing pipelines. Tao Wang, Xiangrui Yang, Gianni Antichi, Anirudh Sivaraman, Aurojit Panda. NSDI 2022. 2021 Revitalizing the Public Internet By Making it Extensible. Hari Balakrishnan, Sujata Banerjee, Israel Cidon, David Culler, Deborah Estrin, Ethan Katz-Bassett, Arvind Krishnamurthy, Murphy McCauley, Nick McKeown, Aurojit Panda, Sylvia Ratnasamy, Jennifer Rexford, Michael Schapira, Scott Shenker, Ion Stoica, David Tennenhouse, Amin Vahdat, and Ellen Zegura. CCR Editorial 2021. We Need Kernel Interposition over the Network Dataplane Hugo Sadok, Zhipeng Zhao, Valerie Choung, Nirav Atre, Daniel S. Berkger, James C. Hoe, Aurojit Panda, Justine Sherry. HotOS 2021. Cerebro: A Platform for Multi-Party Cryptographic Collaborative Learning Wenting Zheng, Ryan Deng, Weikeng Chen, Raluca Ada Popa, Aurojit Panda, Ion Stoica. USENIX Security 2021. 2020 Bertha: Tunneling through the Network API Akshay Narayan, Aurojit Panda, Mohammad Alizadeh, Hari Balakrishnan, Arvind Krishnamurthy, Scott Shenker. HotNets 2020. Remote Memory Calls Emmanuel Amaro, Zhihong Luo, Amy Ousterhout, Arvind Krishnamurthy, Aurojit Panda, Sylvia Ratnasamy, Scott Shenker. HotNets 2020. Kappa: A Programming Framework for Serverless Computing Wen Zhang, Vivian Fang, Aurojit Panda, Scott Shenker. SOCC 2020. Making Edge-Computing Resilient Yotam Harchol, Aisha Mushtaq, Vivian Fang, James McCauley, Aurojit Panda, Scott Shenker. SOCC 2020. A Public Option for the Core Yotam Harchol, Dirk Bergemann, Nick Feamster, Eric Friedman, Arvind Krishnamurthy, Aurojit Panda, Sylvia Ratnasamy, Michael Schapira and Scott Shenker. SIGCOMM 2020. EGGS: Sparsity-Specific Code Generation Xuan Tang, Teseo Schneider, Shoaib Kamil, Aurojit Panda, Jinyang Li, Daniele Panozzo. SGP 2020. Multitenancy for Fast and Programmable Networks in the Cloud Tao Wang, Hang Zhu, Fabian Ruffy, Xin Jin, Anirudh Sivaraman, Dan R.K. Ports, Aurojit Panda. HotCloud 2020. Can Far Memory Improve Job Throughput? Emmanuel Amaro, Christopher Branner-Augmon, Zhihong Luo, Amy Ousterhout, Marcos K. Aguilera, Aurojit Panda, Sylvia Ratnasamy and Scott Shenker. EuroSys 2020. Network architecture in the age of programmability Anirudh Sivaraman, Thomas O. Mason, Aurojit Panda, Ravi Netravali, Sai Anirudh Kondaveeti. CCR Editorial. January 2020. 2019 Enabling a Permanent Revolution in Internet Architecture James McCauley, Barath Raghavan, Yotam Harchol, Aurojit Panda, Scott Shenker. SIGCOMM 2019. Thoughts on Load Distribution and the Role of Programmable Switches James McCauley, Aurojit Panda, Arvind Krishnamurthy, Scott Shenker. CCR Editorial. January 2019. 2018 Revisiting Network Support for RDMA Radhika Mittal, Alex Shpiner, Aurojit Panda, Eithan Zahavi, Arvind Krishnamurthy, Sylvia Ratnasamy, Scott Shenker. SIGCOMM 2018. Monarch: Gaining Command on Geo-Distributed Graph Analytics Anand Iyer, Aurojit Panda, Mosharaf Chowdhury, Aditya Akella, Scott Shenker, Ion Stoica. HotCloud 2018. Bridging the GAP: Towards Approximate Graph Analytics Anand Iyer, Aurojit Panda, Shivaram Venkatraman, Mosharaf Chowdhury, Aditya Akella, Scott Shenker, Ion Stoica. GRADES-NDA 2018. Network Evolution for DNNs Michael Chang, Aurojit Panda, Domenic Bottini, Lisa Jian, Pranay Kumar, Scott Shenker. SysML 2018. Tasvir: Distributed Shared Memory for Machine Learning Amin Tootoonchian, Aurojit Panda, Aida Nematzadeh, Scott Shenker. SysML 2018. ResQ: Enabling SLOs in Network Function Virtualization Amin Tootoonchian, Aurojit Panda, Chang Lan, Melvin Walls, Katerina Argyraki, Sylvia Ratnasamy, Scott Shenker. NSDI 2018. 2017 Drizzle: Fast and Adaptable Stream Processing at Scale Shivaram Venkatraman, Aurojit Panda, Kay Ousterhout, Michael Armbrust, A",
  "content_length": 14768,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:08"
}