{
  "name": "Austin J. Brockmeier",
  "homepage": "https://www.cis.udel.edu/people/faculty-profile/?id=264",
  "status": "success",
  "content": "Austin Brockmeier | Computer & Information Sciences Austin Brockmeier Assistant Professor Joint Appointment Office: 306 Evans Hall Phone: 302-831-4274 Email: ajbrock@udel.edu Google Scholar DBLP Profile Computational Neural Information Engineering Laboratory Austin Brockmeier Assistant Professor Joint Appointment EDUCATION PhD | 2014 | University of Florida BS | 2009 | University of Nebraska–Lincoln Executive Summary I am a computer scientist and electrical engineer working to develop the next generation of algorithms and statistical models for machine learning and data science to process and extract relevant information from complex, high-dimensional data sets. In this pursuit I am interested in mathematical and statistical approaches that accurately represent both the uncertainty and natural characteristics of signals and data. In particular, I am interested in processing and deciphering neural signals using better representations of the biophysiology of the brain. As a graduate student, I collaborated with neuroscientists and other engineers to develop sensory prostheses that optimized subject-specific stimulation patterns to create naturalistic neural responses in downstream sensory areas. This required developing machine learning techniques to automatically identify the characteristics of the natural response that distinguish different stimuli. As a postdoctoral researcher, I was engaged in a multiyear project on processing large amounts of biomedical related text, both scientific abstracts and clinical records, to help with precision medicine and public health. The intellectual challenge with this work was dealing with high-dimensional sparse data. I developed approaches to search and organize large data sets, provide descriptions of persistent clusters, and quantify the significance of interesting patterns. Research Areas Artificial Intelligence and Machine Learning View All Faculty",
  "content_length": 1922,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:14"
}