{
  "name": "Avah Banerjee",
  "homepage": "https://www.avahbanerjee.com",
  "status": "success",
  "content": "Avah Banerjee (艾娃 巴納吉) Home Teaching Research Blog + News Teaching Research Blog + News Avah Banerjee (艾娃 巴納吉) Contact: banerjeeav [at] mst [dot] edu Computer Science Department, S&T I am an assistant professor at S&T. Prior to this I was a postdoc at LSU's CCT. Before this I obtained my PhD in Computer Scienece from GMU. My adviosr was Dana Richards. I am married to Emily Hsiang. More About Me My research is currently supported in part by the National Science Foundation (link). Research Interests (circa 2023). My interests have evolved over the years. I initially started research in nature-inspired computation, with a focus on the theory of evolutionary algorithms. Due to the inherent difficulty in deriving formal guarantees (such as convergence, approximation ratio, etc.) for evolutionary heuristics, I eventually transitioned away from that domain. During my Ph.D., I predominantly focused on algorithms and data structures. My dissertation addressed problems in comparison complexity models and routing models for graphs. During my postdoctoral research, I explored a variety of topics, including the well-quasi ordering of bigenic induced subgraphs, graph labeling, and several variants of the min-uncut problem. I also ventured into online algorithms, particularly the \\(k\\)-server problems. In the past two years, my focus has pivoted to the theory of quantum computing. Like many in this field, I'm keen on identifying \"natural\" problems where there's a definitive quantum advantage. Specifically, my current research centers on exploring quantum walks and their generalizations, as well as quantum property testing. \\(\\neg\\)Research Interests. I like to write both short and long poems and play with, especially, self-referentialism. ~A Gruk about Gruks~ If you wish to write a Grook that's witty and smart, then don't go on reading a crook like this for a start. If I had lots of time (which I don't), I'd paint (not the practical kind). I used to be into photography, but I'm not sure I can call myself an practicing photographer anymore.",
  "content_length": 2060,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:15"
}