{
  "name": "Aviad Rubinstein",
  "homepage": "https://cs.stanford.edu/~aviad",
  "status": "success",
  "content": "Aviad Rubinstein | Stanford Aviad Rubinstein [Last updated 8/23] I am an assistant professor of Computer Science at Stanford. Algorithms for Toddlers: the book! Yes, Mary Wootters and I wrote a book about Algorithms for Toddlers. Mentoring PhD advisees: Joshua Brakensiek, Ruiquan Gao, Jabari Hastings, Mohammad Roghani, Xiao Mao, Kianna Wan, Junyao Zhao, Zixin (Jack) Zhou Postdocs: Soheil Behnezhad (Stanford -> Northeastern), Kangning Wang Undergraduates: Isabel Papadimitriou (Berkeley -> Stanford), Erik Jones (Stanford -> Berkeley), Ruiquan Gao (Tsinghua -> Stanford), Qianfan Zhang (Tsinghua -> Princeton), Jake Kaplan (Stanford Math Undergraduate Research Award), Michael Zhang, Paul Duggan, Vedant Garg, Ishan Khare, Anthony Zhan. High school: Ishaan Sinha Masters: Sadly there are no masters students on this list (yet). But here is a great resource if you're considering doing a masters in theory of computer science! (Also, if you know of a relevant masters program that isn't represented on the spreadsheet, please send me an email!) Teaching What I'm teaching this year Design and Analysis of Algorithms (CS161) - Fall 18, Fall 19, Fall 20, Fall 21, Fall 22, Fall 23 Incentives in Computer Science (CS269i) - Spring 21, Winter 23, Spring 24 Topics in Intractability: Unfulfilled Algorithmic Fantasies (CS354) - Spring 19, Winter 22 Incentives in Computer Science (CS259q) - Winter 20 Research: algorithms, complexity, and game theory. Most of my research is quite theoretical, but I'm also interested in the real world. At least some of the time. [BGORZ23] is my most practical paper. (Cool fact about this paper: the best parts were done by my co-authors Ruiquan Gao and Qianfan Zhang when they were undergrads!) If you just want to read one of my papers, [RWW20] is probably the most accessible. (Cool fact about this paper: the best part was done by my co-author Jack Wang when he was an undergrad!) Even more accessible is this really nice Quanta Magazine article about [BR20] by Erica Klarreich. (Cool fact: Yakov Babichenko and I also received the Kalai Prize from the Game Theory Society for this work.) In sharp contrast, [Rub16] is probably my least accessible paper. I tried, but the proof is just very hard. (At least it got some nice recognition such as a FOCS Best Paper Award :)) If you still want to read more papers, check out my dblp. Workshops I co-organized Early career mentoring at EC 2022 with Ruta Mehta and Alex Teytelboym. Early career mentoring at EC 2021 with Raf Frongillo and Irene Lo. Fine-grained complexity at TAU-FEST 2020 with Amir Abboud. Early career mentoring at FOCS 2019 with Yael Kalai and Matt Weinberg. Total search problems at FOCS 2018, with Manolis Zampetakis. Consulting Outside of my work at Stanford, I also consult part time for a blockchain start-up called Lava. Contact email:       aviad@cs.stanford.edu Office: Gates 164 Department of Computer Sciences Stanford University",
  "content_length": 2939,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:16"
}