{
  "name": "Avinash Sharma 0001",
  "homepage": "https://3dcomputervision.github.io",
  "status": "success",
  "content": "3DVisLab Human Body Reconstruction Tree Generation & Modeling Terrain Generation Latest News & Updates Conference November 2025 Paper Accepted at AAAI 2026 One paper accepted at the Association for the Advancement of Artificial Intelligence (AAAI) 2026. Conference October 2025 Technical Communications Paper at SIGGRAPH Asia 2025 Our research work has been accepted as a Technical Communications paper at SIGGRAPH Asia 2025. Award September 2025 Qualcomm Innovation Fellowship India 2025 Our team has been awarded the prestigious Qualcomm Innovation Fellowship India 2025 for outstanding research contributions. Conference October 2025 Paper Accepted at ICCV 2025 One paper accepted at the International Conference on Computer Vision (ICCV) 2025. Conference December 2024 Paper Accepted at ICVGIP 2024 One paper accepted at the Indian Conference on Computer Vision, Graphics and Image Processing (ICVGIP) 2024. Conference September 2024 Paper Accepted at ECCV 2024 One paper accepted at the European Conference on Computer Vision (ECCV) 2024. Conference June 2024 Paper Accepted at CVPR 2024 One paper accepted at the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR) 2024. Conference May 2024 Paper Accepted at ICRA 2024 One paper accepted at the IEEE International Conference on Robotics and Automation (ICRA) 2024. Conference January 2024 Paper Accepted at 3DV 2024 One paper accepted at the International Conference on 3D Vision (3DV) 2024. About Us This is a research group led by Dr Avinash Sharma, who has recently moved to Computer Science & Engineering department, IIT Jodhpur as an associate professor while continuing his affiliation with Centre for Visual Information Technology (CVIT), IIIT Hyderabad. We primarily work on the computer vision and machine learning problems with a focus on 3D scene understanding and reconstruction. Specifically, we deal with problems where human body is reconstructed from 2D images and analysed in 3D, generation & analysis of 3D terrains, registration of point clouds of indoor scenes captured from commodity sensors as well as large outdoor scenes captured from LIDAR scanners. Students part of our group have been honored as recipients of prestigious fellowships from Google, Tata Consultancy Services (TCS), and Qualcomm. Human Garment Modeling Reconstructing clothed human bodies from monocular data. Generation of novel garments. Human Head Modeling High-fidelity facial reconstruction, relighting, and animation of head avatars. Tree Reconstruction and Generation Creating realistic 3D tree models from images for virtual world assets. Terrain Modelling and Generation Large-scale outdoor environment modeling and generation. Point-Cloud Processing SLAM, Point-Cloud Forecasting for autonomous driving. Human Body Modelling 3D body shape and pose estimation. Human motion tracking and generation.",
  "content_length": 2872,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:18"
}