{
  "name": "Avishek Ghosh",
  "homepage": "https://sites.google.com/view/avishekghosh/home",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationAvishek GhoshAssistant ProfessorDepartment of Computer Science and Engineering (CSE)Associate Faculty, Centre for Machine Intelligence and Data Science (CMInDS)Indian Institute of Technology, Bombay (IITB)Office Address: KR-218 (KReSIT Building)Email: avishek_ghosh@iitb.ac.in, avishek@cse.iitb.ac.in  Research Interests: I work on algorithmic and statistical aspects of machine learning includingNon-convex Optimization - Mixtures, Federated Learning (FL)Online Learning - Markets and Bandits, Robust online learning, Distributed RLLearning Theory - Single/Multi-index models, Model SelectionNew Course: In Autumn 2025, I am teaching an advanced course on Multi Agent Machine Learning. Please take a look at this link for details.In Spring 2025, I taught a course on Statistical Learning Theory which is an advanced course on ML Theory. Please take a look at this link for detailed lecture notes and other resources.AI@CSE, IIT Bombay: Please take a look at https://www.cse.iitb.ac.in/~ml/ to learn more about AI/ML research at CSE, IITB.Short-Term/Internship Positions: I currently do not have any short-term research positions or internships. Students, please refrain from requesting the same.About me:  I am an Assistant Professor at the Department of Computer Science and Engineering and an associated faculty member at the Centre for Machine Intelligence and Data Science (C-MInDS) at the Indian Institute of Technology, Bombay.  I work in Theoretical Machine Learning with a focus on (a) Large Scale (non-convex) Optimization and (b) Sequential learning in Multi Armed Bandits and Reinforcement Learning framework. Previously, I was an Assistant Professor at the Centre for Systems and Control Engineering (SysCon) at IIT Bombay. Before that, I was a Postdoctoral fellow at HDSI (Data-Science Institute), University of California, San-Diego, where I worked with Prof. Arya Mazumdar and Prof. Tara Javidi. Prior to that, I did my PhD from the EECS Dept. of University of California, Berkeley, with Prof. Kannan Ramchandran (EECS) and Prof. Aditya Guntuboyina (Statistics). I did my masters in the ECE Dept. of IISc Bangalore (working with Prof. Anurag Kumar and Prof. Aditya Gopalan) and Bachelors from the ETCE Dept. of Jadavpur University. Students interested in working with me:  If you want to work in Machine Learning and Optimization, I encourage you to get in touch with me. You can work with me through either  Department of Computer Science and Engineering or Centre for Machine Intelligence and Data Science (C-MInDS). Feel free to send an email for further details. Also, have a look at my research page for more information.Updates: Oct 25 --[New Preprint] On the Theory of Continual Learning with Gradient Descent for Neural Networks (see here )May - June 25 -- [Visiting Researcher] Visited University of California, San Diego (TILOS visitor) in the Department of Data Science (HDSI) (Host: Prof. Arya Mazumdar)May 25 -- [New Preprint] LocalKMeans: Convergence of Lloyd's Algorithm with Distributed Local Iterations (see here )May 25 -- [New Preprint] Incentivize Contribution and Learn Parameters Too: Federated Learning with Strategic Data Owners (see here)May 25 -- [New Paper] Near Optimal Best Arm Identification for Clustered Bandits accepted at International Conference on Machine Learning (ICML), 2025April 25 -- [New Paper] Learning and Generalization With Mixture Data accepted at IEEE International Symposium on Information Theory (ISIT) 2025Feb 25 -- [Invited Talk] Presented works on Non-Convex Optimization in the Probability Seminar, School of Mathematics, University of BristolFeb -Mar, 2025 -- [Visiting Researcher] Visited the University of Bristol in the School of Mathematics (Host: Prof. A Ganesh)Jan 25 -- [Invited Talk] Presented works on Multi agent Bandits at RL Workshop 2025, IISc BangaloreDec 24 -- [New Paper] on Learning Causal Representations via Simulator is accepted at Transactions in Machine Learning Research (TMLR)Nov 24 -- [New Paper] on Contextual Matching Markets: https://arxiv.org/pdf/2411.11794Oct 24 -- [New Paper] on Simulator based Learning Causal Representations accepted at NeurIPS Causal Representation Learning Workshop 2024May 24 -- [New Paper] on Agnostic Learning of Mixed Linear Regressions with EM and AM Algorithms accepted at International Conference on Machine Learning (ICML), 2024, Vienna, AustriaMay 24 -- [New Paper] on PairNet: Training with Observed Pairs to Estimate Individual Treatment Effect accepted at International Conference on Machine Learning (ICML), 2024, Vienna, AustriaApril 24 -- [New Paper] on Explore-then-Commit Algorithms for Decentralized Two-sided Matching Markets accepted at IEEE International Symposium on Information Theory (ISIT) 2024April 24 -- [New Paper] on saddle point avoidance using cubic regularized Newton method accepted at IEEE International Symposium on Information Theory (ISIT) 2024April 24 -- [New Paper] on False data injection in cyber-physical system accepted at IEEE International Symposium on Information Theory (ISIT) 2024Feb 24 -- [Invited Talk] at the Reinforcement Learning: Recent Trends and Future Challenges Workshop at IISc BangaloreFeb 24 -- [Invited Talk] at TIFR Mumbai on Non Stationary Matching MarketsFeb 24 -- [New Paper] on Improved Federated Clustering accepted at Transactions in Machine Learning Research (TMLR)Dec 23 -- [New Paper] on Dynamic matching markets accepted at IEEE Transactions on Information TheoryDec 23 -- Organized Indian Symposium on Machine Learning (IndoML) at IIT Bombay.Dec 23 -- Organized workshop on Large Scale Learning Learning and Control at IIT Bombay. Please check this link Sept 23 -- Proposal on Incentivizing Contribution in Federated Learning got accepted at Amazon IITB AI-ML Initiative program (Co-PI: Swaprava Nath, CSE, IITB)Jul 23 -- [New Paper] on Model selection for Generic contextual bandits accepted at IEEE Transactions on Information TheoryJul 23 -- [New Paper] on Understanding and Control of Zener Pinning via Phase Field and Ensemble Learning accepted at Computational Materials ScienceJun 23 -- 2 papers on Economic Markets and (Multi-armed) Bandits (on dynamic markets and two sided competitive learning) accepted at ICML 2023 (Many Facets of Preference-Based Learning Workshop)Jun 23 -- 2 papers on Improved Clustering in Federated Learning and Saddle point avoidance accepted at ICML 2023 (Federated Learning and Analytics Workshop)April 23 -- [New Paper] on Optimal Compression of Unit Norm Vectors in the High Distortion Regime accepted in ISIT 2023March 23 -- [Talk] on Federated Learning and Non Convex Optimization at Electrical Engg. and Computer Science respectively, IIT BombayJan 23 -- [New Paper] on Spectral Lower Bounds for Linear Bandits accepted in AISTATS 2023Dec 22 -- [New Job] Joined IIT Bombay as an Assistant ProfessorNov 22 -- [New paper] on Improved Clustered Federated Learning arxived: https://arxiv.org/abs/2210.11538 Sept 22 -- Presented 2 papers (long-talk) at ECML-PKDD 2022July 22 -- Presented 2 Spotlight talks at ICML 2022, Baltimore Selected (10) Publications (see full list  here): Near Optimal Best Arm Identification for Clustered Bandits -- Yash, Avishek Ghosh, Nikhil Karamchandani; ICML, 2025Agnostic Learning of Mixed Linear Regressions with EM and AM Algorithms; Avishek Ghosh and Arya Mazumdar; ICML, 2024Decentralized Competing Bandits In Non-Stationary Matching Markets; Avishek Ghosh, Abishek Sankararaman, Kannan Ramchandran, Tara Javidi and Arya Mazumdar-- IEEE Transactions on Information Theory, 2024. On Learning Mixture of Linear Regressions in the Non-Realizable Setting; Avishek Ghosh, Arya Mazumdar, Soumyabrata Pal and Rajat Sen -- ICML, 2022An Efficient Framework for Clustered Federated Learning--Avishek Ghosh, J. Chung, Dong Yin, Kannan Ramchandran--NeurIPS 2020 (long version in IEEE Transactions on Information Theory, 2022)Max-Affine Regression: Parameter Estimation for Gaussian Designs; Avishek Ghosh, Ashwin Pananjady, Aditya Guntuboyina, Kannan Ramchandran--IEEE Transactions on Information Theory, 2022Problem-Complexity Adaptive Model Selection for Stochastic Linear Bandits -- Avishek Ghosh, Abishek Sankararaman, Kannan Ramchandran--AISTATS 2021Alternating Minimization Converges Super-linearly for Mixed Linear Regression; Avishek Ghosh, Kannan Ramchandran--AISTATS 2020Communication-Efficient and Byzantine-Robust Distributed Learning with Error Feedback; Avishek Ghosh, Raj Kumar Maity, Swanand Kadhe, Arya Mazumdar and Kannan Ramchandran, IEEE Journal on Selected Areas in Information Theory, 2021 (a variation in NeurIPS 2020).Misspecified Linear Bandits ; Avishek Ghosh, Sayak R. Chowdhury, Aditya Gopalan--AAAI 2017Current CollaboratorsArya Mazumdar , Professor, University of California, San DiegoKannan Ramchandran, Professor, University of California, BerkeleySunita Sarawagi, Professor, CSE, IIT BombayNikhil Karamchandani, Professor, EE, IIT BombaySwaprava Nath, Professor, CSE, IIT BombayAyalvadi Ganesh, Professor, School of Mathematics, University of Bristol, UKAbishek Sankararaman, Research Scientist, Amazon, USADong Yin, Research Scientist, Deepmind (Google), USAAditya Gopalan, Professor, Indian Institute of Science, BangaloreSayak Ray Chowdhury, Postdoc, Microsoft Research, IndiaGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 9416,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:18"
}