{
  "name": "Avrim Blum",
  "homepage": "https://home.ttic.edu/~avrim",
  "status": "success",
  "content": "Avrim Blum's home page Avrim Blum (avrim at ttic.edu) Chief Academic Officer and Interim President Toyota Technological Institute at Chicago (TTIC) 6045 S. Kenwood Ave, Chicago, IL 60637 [Admin: Mary Marre 773-834-1757] TTIC is a PhD-granting computer science institute focusing in the areas of machine learning, algorithms, AI (robotics, natural language, speech, and vision) and computational biology, located on the University of Chicago campus. We are essentially a self-contained, free-standing department of machine learning, algorithms, AI, and data science. We have tenure-track faculty, limited-term research faculty, PhD students, and postdocs. We are hiring Tenure-Track Faculty and Research Assistant Professors and recruiting new PhD students. Here is a slide deck with more information and our 2024 CRA flyer. I am also co-director of the NSF TRIPODS Institute for Data, Econometrics, Algorithms, and Learning (IDEAL), a member of the Simons Collaboration on Algorithmic Fairness, and supported by an ONR MURI award on Multi-Agent Learning. I am currently (Fall 2025) teaching TTIC 31290 - Machine Learning for Algorithm Design (TR 9:30-10:50) My main research interests are in machine learning theory, approximation algorithms, on-line algorithms, algorithmic game theory / mechanism design, algorithmic fairness, and non-worst-case analysis of algorithms. Many years ago I also did work in AI Planning. I am a member of the Simons Collaboration on the Theory of Algorithmic Fairness. Before joining TTIC, I was a faculty member in the Computer Science Department at Carnegie Mellon University from 1992 to 2017. I am on the Steering Committees for ITCS and FORC, on the editorial board for JACM, and on the Advisory Board of a new open access journal TheoretiCS. I am also on the Advisory Committee/Board for the Learning Theory Alliance and The Institute for Learning-enabled Optimization at Scale. I was Program Chair for the 2019 Innovations in Theoretical Computer Science (ITCS) Conference, on the Organizing Committee for the STOC 2018 and STOC 2017 Theory Fest, and a member of the SafeToC committee. For more information on my research, see the publications and research interests links below. Publications Research Interests Survey Talks Courses Taught Blum, Hopcroft, & Kannan, Foundations of Data Science. (This pre-publication version is free to view and download for personal use only. Not for re-distribution, re-sale or use in derivative works. Please do not re-post or mirror.) Current PhD advisees: Keziah Naggita (jointly advised with Matt Walter), Kavya Ravichandran, Melissa Dutz, Donya Saless, Hirota Kinoshita Former PhD advisees: Prasad Chalasani, Santosh Vempala, Carl Burch, Adam Tauman Kalai, John Langford, Nikhil Bansal, Martin Zinkevich, Shuchi Chawla, Brendan McMahan, Maria-Florina (Nina) Balcan, Shobha Venkataraman, Mugizi Robert Rwebangira, Katrina Ligett, Aaron Roth, Or Sheffet, Pranjal Awasthi, Liu Yang, Ankit Sharma, Jamie Morgenstern, Nika Haghtalab. Kevin Stangl, Han Shao, Naren Manoj Though I am no longer at CMU, I endorse the CMU SCS Reasonable Person Principle which basically asks people to be reasonable and assume everyone else is doing likewise. Note: Scammers are starting to use my name. I will never send an email that says \"Good afternoon and happy Thursday!\", I will never ask for gift cards, etc.",
  "content_length": 3368,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:20"
}