{
  "name": "Awais Rashid",
  "homepage": "https://research-information.bris.ac.uk/en/persons/awais-rashid",
  "status": "success",
  "content": "Awais Rashid - University of Bristol View Scopus Profile Professor Awais Rashid BSc, MSc, PhD Professor of Cyber Security, School of Computer Science https://orcid.org/0000-0002-0109-1341 Emailawais.rashidbristol.acuk BS8 1UB Personal profile Research interestsHead, Bristol Cyber Security Group Director, National Research Centre on Privacy, Harm Reduction and Adversarial Influence Online (REPHRAIN)) Director, EPSRC Centre for Doctoral Training in Cyber Security: Trust, Identity, Privacy and Security in Large-scale Infrastructures (TIPS-at-Scale) Principle Investigator and Editor-in-Chief, Cyber Security Body of Knowledge (CyBOK) My research spans cyber security and software engineering. I focus on novel software modularity techniques that underpin software that is adaptable, evolvable and resilient in the face of changes and the volatile nature of user requirements and behaviours in the modern digital world. This naturally ties in with my cyber security research which focuses on developing tools and techniques that are adaptable to the constantly changing threat patterns utilised by criminals online. I am particularly interested in security of cyber-physical systems, such as, industrial control systems and Internet of Things. I am also a keen researcher of adversarial and non-adversarial behaviours pertaining to cyber security. I lead projects as part of the UK Research Institute on Trustworthy Industrial Control Systems (RITICS) and UK Research Institute on Socio-technical Cyber Security (RISCS), the National Centre of Excellence on Cyber Security of Internet of Things (PETRAS) and am a member of the UK Centre for Research and Evidence on Security Threats (CREST). I also lead research on readiness of software engineers and developers to work with new secure hardware as part of the ESRC Hub on Digital Security by Design (Discribe). I am a Fellow of the Alan Turing Institute. Prior to joining the University of Bristol, I was co-founder and co-director of the Security Lancaster Institute at Lancaster University. Research Groups and ThemesCyber Security Fingerprint Dive into the research topics where Awais Rashid is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 8 Similar Profiles Industrial Control System Computer Science 100% Critical Infrastructure Computer Science 80% Security Expert Computer Science 60% Software Developer Computer Science 59% Decision-Making Computer Science 52% Cybersecurity Computer Science 47% Case Study Computer Science 41% Cyber Physical Systems Computer Science 38% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 160 Conference Contribution (Conference Proceeding) 64 Article (Academic Journal) 9 Conference Paper 7 Commissioned report 16 More 4 Other chapter contribution 3 Chapter in a book 2 Authored book 2 Other contribution 1 Edited book 1 Other report 1 Conference Abstract 1 Review article (Academic Journal) 1 Article (Specialist Publication) Research output per year Research output per year The Good, the Bad and the Ugly: A Study of Security Decisions in a Cyber-Physical Systems GameFrey, S., Rashid, A., Anthonysamy, P., Pinto-Albuquerque, M. & Naqvi, S. A., 1 May 2019, In: IEEE Transactions on Software Engineering. 45, 5, p. 521-536 16 p., 8194898.Research output: Contribution to journal › Article (Academic Journal) › peer-review Open AccessFile Cyber Physical Systems 100% Security Expert 100% Decision-Making 66% Computer Scientist 66% Security Requirements 33% 56 Citations (Scopus) 911 Downloads (Pure) Discovering \"unknown known\" security requirementsRashid, A., Naqvi, S. A. A., Ramdhany, R., Edwards, M., Chitchyan, R. & Ali Babar, M., 14 May 2016, Proceedings of the 38th International Conference on Software Engineering, ICSE 2016, Austin, TX, USA, May 14-22, 2016. IEEE Computer Society, p. 866-876 11 p. (Proceedings - International Conference on Software Engineering; vol. 14-22-May-2016).Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Security Model 100% Security Requirements 100% Wireless Access 33% Data Recovery 33% Access Control 33% 21 Citations (Scopus) It Bends But Would It Break? Topological Analysis of BGP Infrastructures in EuropeFrey, S., Elkhatib, Y., Rashid, A., Follis, K., Vidler, J., Race, N. J. P. & Edwards, C., 2016, IEEE European Symposium on Security and Privacy, EuroSP 2016, Saarbrücken, Germany, March 21-24, 2016. p. 423-438 16 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) 9 Citations (Scopus) View all 256 research outputs Projects 8 Active 20 Finished Projects per year REPHRAIN Safer Streets: A Blueprint for Integrated Data Systems Linking Online Harms and Street CrimeRashid, A. (Principal Investigator)1/06/25 → 31/03/26Project: Research REPHRAIN: National Research centre on Privacy, Harm Reduction and Adversarial Influence online (Phase II)Rashid, A. (Principal Investigator) & Owen, R. (Co-Investigator)1/09/24 → 31/03/26Project: Research, Parent SCULI: Securing Convergent Ultra-large Scale InfrastructuresRashid, A. (Principal Investigator), Belguith, S. (Co-Investigator), Adepu, S. (Co-Investigator), Creese, S. (Co-Investigator), Flechais, I. (Co-Investigator), Suri, N. (Co-Investigator), Bradbury, M. (Co-Investigator), Rushforth, Y. (Manager), Abaimov, S. (Researcher) & Badva, P. K. (Researcher)1/09/24 → 31/08/29Project: Research View all 28 projects Datasets User Survey App PermissionsRashid, M. (Creator), Rigby, Y. (Creator) & Tahaei, M. (Creator), University of Bristol, 24 Jan 2023DOI: 10.5523/bris.2qv93u6isblq42ixbofaahnfwm, http://data.bris.ac.uk/data/dataset/2qv93u6isblq42ixbofaahnfwmDataset RITICS Catch Me If You Can DatasetThomas, R. (Creator), Gardiner, J. (Creator), Chothia, T. (Creator), Rashid, A. (Creator), Samanis, M. (Creator) & Perrett, T. J. (Creator), University of Birmingham, 8 Oct 2020DOI: 10.25500/edata.bham.00000548, http://edata.bham.ac.uk/548/Dataset Activities 2 Participation in workshop, seminar, course Activities per year Securing IoT in Critical National Infrastructure Craggs, B. (Organiser) & Rashid, A. (Keynote/plenary speaker)5 Feb 2019Activity: Participating in or organising an event types › Participation in workshop, seminar, course PETRAS - Critical National infrastructure WorkshopCraggs, B. (Organiser) & Rashid, A. (Chair)5 Feb 2018Activity: Participating in or organising an event types › Participation in workshop, seminar, course",
  "content_length": 6880,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:22"
}