{
  "name": "Awais Aziz Shah",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/awaisazizshah",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Awais Aziz Shah Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffAwais Aziz ShahMr Ethan KellyZhen Tian Dr Awais Aziz Shah Lecturer (School of Computing Science) telephone: 01413301799 email: AwaisAziz.Shah@glasgow.ac.uk 308, Sir Alwyn Williams Building, University of Glasgow, Glasgow, G12 8RZ Import to contacts https://orcid.org/0000-0002-1656-739X Biography I am currently a lecturer within the school of computing science. I am a member of the Glasgow Systems Section (GLASS). My research is focused towards using Software-Defined Networks (SDN) and virtualisation technologies such as containers to virtualise the modern network infrastructures in achieving low-latency, high energy efficiency, Quality of Service (QoS) and optimal Virtual Network Functions (VNF) chain deployments. During my PhD at the Telematics Lab, Politecnico di Bari, Italy, I developed an SDN-based hierarchical framework for the orchestration and management of VNFs in Optical Transport Networks. Through this work, in collaboration with industrial partners from Telco industry in Italy (SMOptics and Experis), I performed simulating large-scale optical nodes been monitored by multiple levels of SDN controllers and centeralised network service orchestrator (OSMANO) inside OpenStack Cloud. Furthermore, I have worked on developing a routing strategy for Transport Networks using SDN to ensure energy efficiency and at the same time QoS.  Moreover, I worked as a Research Fellow from December 2021 to September 2022 in the Communication, Sensing and Imaging group on several use cases under the umbrella of Scotland 5G testbed that includes orchestration of services on the 5G testbed using SDN and Internet of Things frameworks. Research interests Laboratory (netlab) Research Interests: Software-Defined Networks (SDN) Network Function Virtualisation (NFV) Internet-of-Space Things Container networking Resilience and CyberSecurity Cloud and Edge Computing Anomaly detection in Networks Network Routing Algorithms Research groupsNetlab (Networked Systems Research Laboratory)Glasgow Systems Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019Number of items: 21.2025 Yang, Jinming, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2025) A game-theoretic task offloading framework for blockchain-enabled UAV–satellite MEC systems. IEEE Networking Letters, (doi: 10.1109/LNET.2025.3615273) (Early Online Publication) Yang, Jinming, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2025) Task offloading and resource allocation in Mobile Edge Computing assisted vehicular networks across multiple regions. IEEE Transactions on Vehicular Technology, (doi: 10.1109/TVT.2025.3611347) (Early Online Publication) Holik, Filip ORCID: https://orcid.org/0000-0001-6595-0419, Cook, Marco M. ORCID: https://orcid.org/0000-0002-5232-2381, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2025) Network-Wide Service Deployment Using Centrally Orchestrated, eBPF-Based Programmable Dataplanes. In: 2025 EuCNC & 6G Summit, Poznan, Poland, 03-06 Jun 2025, pp. 351-356. ISBN 9798350391817 (doi: 10.1109/EuCNC/6GSummit63408.2025.11036869) Holik, Filip ORCID: https://orcid.org/0000-0001-6595-0419, Mcilwraith, Kyle, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios P. ORCID: https://orcid.org/0000-0003-0939-378X (2025) In-Network GOOSE Encryption with eBPF-based Programmable Network Architecture. In: IEEE SmartGridComm 2025, Toronto, Canada, 29 Sep - 02 Oct 2025, (Accepted for Publication) Mahboob, Tahira, Holik, Filip ORCID: https://orcid.org/0000-0001-6595-0419, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2025) Adaptive Learning Feature Quantization for In-network FDI Detection in IEC 61850 Digital Substations. In: IEEE SmartGridComm 2025, Toronto, ON, Canada, 29 September - 2 October 2025, (Accepted for Publication) Holik, Filip ORCID: https://orcid.org/0000-0001-6595-0419, Cook, Marco M. ORCID: https://orcid.org/0000-0002-5232-2381, Deol, Bikram Singh ORCID: https://orcid.org/0009-0004-5675-7499, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios P. ORCID: https://orcid.org/0000-0003-0939-378X (2025) Dashboard Orchestration of eBPF-based Programmable OT Networks. In: IEEE International Conference on Computer Communications (INFOCOM 2025), London, UK, 19-22 May 2025, ISBN 9798331543709 (doi: 10.1109/INFOCOMWKSHPS65812.2025.11152767) Durci, Adrian, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2025) AI in Space: Evaluating ML Algorithms for Onboard Decision-Making in Nanosatellites. In: 2nd Workshop on AI-Driven Integration of Terrestrial and Non-Terrestrial Networks (AITNTN 2025), London, UK, 19 May 2025, ISBN 9798331543709 (doi: 10.1109/INFOCOMWKSHPS65812.2025.11152837) Yang, Jinming, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2025) Priority-Aware Task Offloading in UAV-Assisted Satellite MEC Networks. In: WS12: Workshop on AI-Driven Integration of Terrestrial and Non-Terrestrial Network, Montreal, Canada, 08-12 Jun 2025, (Accepted for Publication) Holik, Filip ORCID: https://orcid.org/0000-0001-6595-0419, Cook, Marco M. ORCID: https://orcid.org/0000-0002-5232-2381, Li, Xicheng, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2025) Programmable data planes for increased digital resilience in OT networks. IEEE Communications Magazine, (doi: 10.1109/MCOM.001.2400446) (Early Online Publication) 2024 Karkashina, Teodor, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios P. ORCID: https://orcid.org/0000-0003-0939-378X (2024) In-Network Real-Time Flow Classification Using Hierarchical Decision Trees. In: 20th International Conference on Network and Service Management (CNSM 2024), Prague, Czech Republic, 28 - 31 Oct 2024, ISBN 9783903176669 (doi: 10.23919/CNSM62983.2024.10814623) Li, Mingwei, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2024) Federated Learning with Sharpness-aware Minimisation for Intrusion Detection in Smart Grids. In: 2024 IEEE Global Communications Conference (GLOBECOM), Cape Town, South Africa, 8-12 December 2024, (Accepted for Publication) Meng, Ruofei, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X, Jamshed, Muhammad Ali and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2024) Federated Learning-based Intrusion Detection Framework for Internet of Things and Edge Computing backed Critical Infrastructure. In: WS23 ICC 2024 Workshop - IIUC6GB, Denver, CO, USA, 9–13 June 2024, ISBN 9798350304053 (doi: 10.1109/ICCWorkshops59551.2024.10615814) 2023 Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X, Ansari, Shuja ORCID: https://orcid.org/0000-0003-2071-0264, Jamshed, Muhammad Ali, Sambo, Yusuf ORCID: https://orcid.org/0000-0002-8760-6800 and Ur Rehman, Masood ORCID: https://orcid.org/0000-0001-6926-7983 (2023) The role of 6G and beyond for urban air mobility and utilising space systems for road to net-zero carbon. In: Imran, Muhammad Ali, Taha, Ahmad, Ansari, Shuja, Usman, Muhammad and Abbasi, Qammer H. (eds.) The Role of 6G and Beyond on the Road to Net-Zero Carbon. Series: IET telecommunications series (108). Institution of Engineering and Technology, pp. 37-59. ISBN 9781839537363 (doi: 10.1049/PBTE108E_ch3) Yang, Jinming, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2023) A survey of energy optimization approaches for computational task offloading and resource allocation in MEC networks. Electronics, 12(17), 3548. (doi: 10.3390/electronics12173548) 2022 Abbas, Adeel, Khan, Muazzam A., Latif, Shahid, Ajaz, Maria, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Ahmad, Jawad (2022) A new ensemble-based intrusion detection system for Internet of Things. Arabian Journal for Science and Engineering, 47(2), pp. 1805-1819. (doi: 10.1007/s13369-021-06086-5) 2021 Khan, Muhammad Almas, Khan, Muazzam A., Jan, Sana Ullah, Ahmad, Jawad, Jamal, Sajjad Shaukat, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X, Pitropakis, Nikolaos and Buchanan, William J. (2021) A deep learning-based intrusion detection system for MQTT enabled IoT. Sensors, 21(21), 7016. (doi: 10.3390/s21217016) (PMID:34770322) (PMCID:PMC8588509) Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X, Piro, Giuseppe, Grieco, Luigi Alfredo and Boggia, Gennaro (2021) A quantitative cross-comparison of container networking technologies for virtualized service infrastructures in local computing environments. Transactions on Emer",
  "content_length": 22703,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:21"
}