{
  "name": "Axel Kalenborn",
  "homepage": "https://www.uni-trier.de/index.php?id=17390",
  "status": "success",
  "content": "apl. Prof. Dr. Axel Kalenborn | Universität Trier ArbeitsschwerpunkteMeine Arbeitsschwerpunkte lassen sich dem weiten Bereich der Anforderungsanalyse in Software Projekten zuordnen. In diesem Bereich interessiert mich insbesondere der Dialog mit fachfremden Anwendern, denen wir die Funktionen von Informationssystemen erklären müssen und von denen wir die Anforderungen an Software Systeme erhalten. Diesen Anwendern können wir nicht mit komplexen Methoden zur Dokumentation von Anforderungen begegnen, da sie diesen nicht beherrschen und verstehen. Eine konkrete und möglichst bildliche Erläuterung steht daher im Zentrum meiner Arbeiten.Darüber hinaus befasse ich mich mit der Planung und Steuerung von Software Projekten, worin ich auch in vielen Jahren praktische Erfahrungen gesammelt habe.ForschungModelling by Example: Ein werkzeugbasierte Methode zur Vorbereitung von Software ProjektenRequirements Engineering & ManagementAllgemeine Methoden des Software EngineeringVorbereitung und Management von Software ProjektenOrganisationstheorieContent ManagementKonzeption und Umsetzung von Internet-basierten SystemenKombination von Algorithmik und KI bei Internet-basierten SystemenLehreWirtschaftsinformatik I & IIRequirements EngineeringManagement von Software ProjektenContent ManagementWeb-EntwicklungForschungsprojekte2004-2006 CBTesten gefördert durch das BMBF: Entwicklung und Transfer einfacher Konzepte zur Überprüfung komponenten-basierter Applikationen hinsichtlich deren funktionalen und temporalen Eigenschaften (www.cbtesten.org)Partner: ICT Solutions AG, Fraunhofer IESE, Market Maker Software AG2006-2009 SecFlow gefördert durch das BMBF: Entwicklung manipulationssicherer Software: IT-Sicherheitsprobleme an der Quelle beseitigen. Das SecFlow Projekt orientiert sich dabei an den Anforderungen moderner Software Implementierungskonzepte. Unser Ziel ist es, die Programmierer in jeder Phase der Software Entwicklung optimal unterstützen zu können, also während der Codierung im Rahmen der Compilierung und beim späteren Test.Partner: ICT Solutions AG, Fraunhofer IESE, CC GmbH, SHE AG2013-2015: SmartOffergefördert durch das BMBF: Vor der Umsetzung eines Software Projektes liegt die in der Literatur bisher wenig beachtete Phase der Angebotserstellung, während der eine Grobkonzeption der umzusetzenden Software in Form eines Angebotes erstellt werden muss. Bestandteil eines Angebots ist eine möglichst präzise Aufwandschätzung. In der Angebotsphase erhalten die Anbieter keine Vergütung und stehen in Konkurrenz zueinander, weshalb unter hohem Zeit-, Erfolgs- und Kostendruck gearbeitet werden muss. Viele Methoden des Requirements Engineering verursachen einen zu hohen Aufwand, sodass sie in dieser Phase noch nicht angewendet werden können. \tZiel des Prjekts ist ie Enwicklung eines Ansatzes und seiner Werzeugutertützung zur Verbesserung des Akquiseprozesses bei webbasieren Anwendungen.Partner: Fraunhofer IESE, ICT Solutions AG, Insiders Software AG2015-2017: Abakus gefördert durch das BMBF: Ziel des Abakus-Projekts ist die Entwicklung einer neuartigen, softwaregestützten Schätzmethode. Mit dieser Abakus-Methode sollen kleine und mittlere Unternehmen in die Lage versetzt werden, ihre IT-Vorhaben schneller und in einer besseren Qualität als bisher zu planen und zu kalkulieren. Der Methode liegt ein Experience Management System zugrunde, das strukturierte Informationen zu bereits abgeschlossenen, kalkulierten Projekten enthält und in Form einer zentralen Wissensbasis zur Verfügung stellt. Als Ergebnis der Methode ist eine strukturierte, möglichst genaue und nachvollziehbare Kalkulation aller Projektaufwände vorgesehen.Partner: Fraunhofer IESE, HK Business Solutions GmbH, ICT Solutions AG, Insiders Software AG, OSSENO Software GmbH, [site]VERTREIBER]Seit 2019: SPIRIT gefördert durch das BMWi: Der Aufbau einer zentralen Struktur zur Förderung des unternehmerischen Denkens und Handelns an der Universität Trier steht im Fokus des Projekts SPIRIT. Vier Jahre lang fördert das Bundesministerium für Wirtschaft und Energie im Rahmen des Gründungsförderungsprogramms „EXIST-Potentiale“ die Bündelung und den gezielten Ausbau des universitätsweiten Programms. Zukünftig steht damit allen Disziplinen von der Sensibilisierung und dem Erwerb grundlegender Kompetenzen bis hin zur individuellen Gründungsberatung ein passendes Angebot offen. Der interdisziplinäre Ansatz des Projekts unterstützt dabei besonders die innovative Ideenentwicklung in den Geistes- und Gesellschaftswissenschaften.Partner: Betriebswirtschaftslehre, Organisationpädagogik und Gründungsbüro der Universität TrierMonographienKalenborn, A.: Prozessorganisation und Workflow-Management: Organisationstheoretisches Konzept und informationstechnische Umsetzung, Trier 1998.Kalenborn, A.: Angebotserstellung und Planung von Internet-Projekten: Die werkzeugbasierte \"Modeling by Example\"-Methode, Trier 2014.  Skripte Kalenborn, A. / Czap, H.: Manual zur Einführung in die Wirtschaftsinformatik, Trier 1994-2004.Kalenborn, A.: Skript zum Software Engineering, Trier 1999-2002. ZeitschriftenbeiträgeKalenborn, A.: Innovationstempo durch Wettbewerb: Was E-Government vom E-Banking lernen kann, in: Behörden Spiegel 1/2006.Kalenborn, A. / Will, T. / Thimm, R. / Raab, J. / Fregin, R.: Java-basiertes automatisiertes Test-Framework, in: Wirtschaftsinformatik 6/2006.Kalenborn, A. / Romstätter, P.: Usability-Prüfung am Projektstart: Mit Mock-Ups zum besseren System, Mittelstand-Digital, 1/2014. Sammelbände / KonferenzbeiträgeKalenborn, A: Workflow Management, in: Häberle, S. G.: Das neue Lexikon der Betriebswirtschaftslehre, 2008.Kalenborn, A: Modeling by Example: Requirements engineering during the bidding stage of dialog-oriented software projects, 1st Workshop RE in Small Companies (RESC), 2010.Kalenborn, A. / Fetzer, K.: Modeling by Example: Ein Ansatz zur Unterstützung der Vorvertragsphase Internet basierter Software Projekte, Praxisforum der Fachtagung Modellierung 2012, 2012.Kalenborn, A. / Timm, I.: Der Einfluss der Vorvertragsphase auf die Qualität von IT-Projekten, Qualitätsmanagement und Vorgehensmodelle - 19. Workshop der Fachgruppe Vorgehensmodelle im Fachgebiet Wirtschaftsinformatik, 2012. Kalenborn, A. / Romstätter, P.: Warum testen? Mock-Ups als Basis für die Usablity-Prüfung, Workshop Usability in der betrieblichen Praxis der Tagung Interaktive Vielfalt, 2013.Kalenborn, A. / Kuhn, D. / Lorig, F.: Calculating Software Projects on a Mockup based approach, Workshop on Requirements Engineering for the Precontract Phase (RE4P²) der Tagung RefsQ, 2014.Kalenborn, A. / Adam, S.: SmartOffer: Eine werkzeugbasierte Methode zur Vorbereitung von Softwareprojekten, GI Fachruppentagung Software Engineering 2014.Breiner, K. / Gillmann, M. / Kalenborn, A / Müller, Ch.: Requirements Engineering in the Bidding Stage of Software Projects - A Research Preview, RefsQ, 2015.Hennen, Ch. / Kalenborn, A. / Stadlbauer, S. / Timm, I. J.: Systematisierung der Auswahl von Vorgehensmodellen durch Kennzahlen, GI Fachtagung Projektmanagement + Vorgehensmodelle 2015.Kalenborn, A. / Kuhn, D.: SmartOffer: Requirements-Engineering in der Vorvertragsphase von Software Projekten, Metrikon 2015.Kalenborn, A. / Becker, A. C. / Messerich, P.: Requirements-Engineering mit Visual-User-Stories, GI Fachtagung Projektmanagement + Vorgehensmodelle 2016.Kalenborn, A. / Stadlbauer, S. / Hausen, M.: Simulation von Software Projekten auf Basis von Kennzahlen, GI Fachtagung Projektmanagement + Vorgehensmodelle 2017 (vorbereitet).Kalenborn, A. / Hess, A. / Kläs, M. / Schmitt, H.: Experience-Based Calculation of Software Projects based on Customer Requirements, Tagung Requirements Engineering 2017 (vorbereitet).Workshop ProccedinsPenzenstadler, B. et. al: Joint Proceedings of REFSQ-2014 Workshops, Doctoral Symposium, Empirical Track, and Posters, co-located with the 20th International Conference on Requirements Engineering: Foundation for Software Quality (REFSQ 2014), Essen, Germany, April 7-10, 2014. CEUR Workshop Proceedings 1138, CEUR-WS.org 2014Matulevicius, R. et al.: Joint Proceedings of REFSQ-2015 Workshops, Research Method Track, and Poster Track co-located with the 21st International Conference on Requirements Engineering: Foundation for Software Quality (REFSQ 2015), Essen, Germany, March 23, 2015. CEUR Workshop Proceedings 1342, CEUR-WS.org 2015Teilnahme an Messe und KongressenCeBIT 2000-2009 und 2015RefsQ Konferenz Essen 2010Multimediakonferenz Rheinland-Pfalz 2011CeBIT 2012, MobexMensch & Computer 2013RefsQ Essen 2014RefsQ Essen 2015 Vorträge bei Kongressen und KonferenzenMultimediakongress Rheinland-Pfalz 2006: Personalisierung von Internet basierten SystemenRefsQ Essen 2010: Modelling by Example Multimediakongress Rheinland-Pfalz 2011: Wie wird aus Design ITModellierung 2012: Modelling by ExampleGI Fachgruppentreffen Requirements Engineering 2014: SmartOffer: Eine werkzeugbasierte Methode zur Vorbereitung von SoftwareprojektenRefsQ Essen 2015: Requirements Engineering in the Bidding Stage of Software Projects - A Research PreviewProjektmanagement und Vorgehensmodelle 2016 - 2020Organisation von Workshops First International Workshop on Requirements Engineering for the Precontract Phase (RE4P²) 2014Second International Workshop on Requirements Engineering for the Precontract Phase (RE4P²) 2015GutachtertätigkeitWI 2011 Track 6: Neue Technologien und AnwendungenWI 2013 Track 6: Neue Technologien und AnwendungenWissenschaftlicher und beruflicher WerdegangAxel Kalenborn, geboren am 28.03.19681987 Abitur am Staatlichen-Erich-Klausener Gyminasium in AdenauDiplom-Kaufmann, Prüfung im Wintersemester 1992/93Seit 01.05.1993 Mitarbeiter am Lehrstuhl für Wirtschaftsinformatik IAm 14.05.1998 Abschluss der Promotion zum Dr. rer. pol.Von 1998-2009 Inhaber, Geschäftsführer und Vorstand der ICT Gruppe (www.ict.ag)Seit 2001 Studienberater der WirtschaftsinformatikVon 2001-2005 Dozent für Wirtschaftsinformaik an der Verwaltungs- und Wirtschaftsakademie",
  "content_length": 10849,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:21"
}