{
  "name": "Axel Küpper",
  "homepage": "https://www.snet.tu-berlin.de/menue/team/prof_dr_axel_kuepper",
  "status": "success",
  "content": "Service-centric Networking - TU Berlin Willkommen auf der Homepage des Fachgebiets Service-centric Networking. Mit dieser Internetpräsenz bieten wir Studierenden, Unternehmen und interessierten Menschen die Möglichkeit, sich einen Überblick über unser Leistungsangebot in Sachen Lehre, Forschung und Beratung zu verschaffen.Über unsHier finden Sie Informationen über die Struktur des Fachgebietes, inklusive aller Ansprechpartner*innen.©  Bild von creativeart auf FreepikForschungAuf diesen Seiten finden Sie die Forschungsleistungen, Forschungsprojekte und Publikationen des Fachgebietes.© Bild von mindandi auf FreepikStudium & LehreAuf diesen Seiten finden Sie Informationen zu allen aktuellen Lehrveranstaltungen, den Modulbeschreibungen und die Möglichkeiten für AbschlussarbeitenJobangebote Werde Teil unseres Teams. Unsere aktuellen Stellenausschreibungen für wissenschaftliche Mitarbeiter:innen und studentische Beschäftigte finden Sie hier. Wir freuen uns auf Ihre Bewerbung. Ich bin damit einverstanden, dass mir Inhalte von OpenStreetMap angezeigt werden. Fachgebietsleitung Prof. Dr. Axel Küpper info(at)snet.tu-berlin.de Adresse Ernst - Reuter - Platz 1, BH-N 215 10587 Berlin Sprechstunde Prof. Dr. Axel Küpper Mittwoch - 11.00-12.00 Uhr Teamassistenz Andrea Hahn & Sandra Wild info(at)snet.tu-berlin.de +49 30 314 77159 und +49 30 314 77160 Sekretariat BH-N SNET Adresse Ernst - Reuter - Platz 1, BH-N 226 10587 Berlin 31.01.2025 Projekt SUSTAINET_guarDIAN ist gestartetSUSTAINET_guarDian ist eine Forschungsinitiative, die sich auf die Entwicklung nachhaltiger, widerstandsfähiger und energieeffizienter Telekommunikationssysteme konzentriert. mehr erfahren 27.01.2025 Save the date: 28. Juni 2025 - Lange Nacht der WissenschaftenSie finden uns im \"Haus der digitaen Zukunft\": Ernst-Reuter-Platz 1, BH-N Gebäude, 10587 Berlin mehr erfahren 29.04.2024 Herzlichen Glückwunsch Dr. Aikaterini Katsarou mehr erfahren 29.04.2024 Herzlichen Glückwunsch Dr. Philip Raschke mehr erfahren 28.02.2024 BRAINS 2024 - Call for paper out now!BRAINS 2024 will offer its attendees a variety of state-of-the-art sessions, including technical presentations, keynotes, demonstrations and panel discussions. mehr erfahren 16.02.2024 BRAINS 2024 - Save the Date!Die 6th Conference on Blockchain Research & Applications for Innovative Networks and Services (BRAINS 2024), findet vom 9.-11. October 2024 in Berlin statt! mehr erfahren",
  "content_length": 2426,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:26"
}