{
  "name": "Axel Krieger",
  "homepage": "https://me.jhu.edu/faculty/axel-krieger",
  "status": "success",
  "content": "Axel Krieger - Department of Mechanical Engineering Contact axel@jhu.edu Connect Google Scholar Website Research Areas Research and development of surgical robotic systems, robotic tools, and laparoscopic devices. Projects include autonomous robotic surgery systems, 3D printed patient-specific implants, and magnetically controlled microsurgery. Axel Krieger, Engr ’08 (PhD), an associate professor in mechanical engineering with a secondary appointment in computer science, focuses on both the fundamental and translational development of novel tools, imaging, and robot control techniques for medical robotics. Specifically, he investigates methodologies that increase smartness and autonomy and improve image guidance of medical robots to perform previously impossible tasks, improve efficiency, and ultimately enhance patient outcomes. Axel is also a Carol Croft Linde Faculty Scholar. As director of the Intelligent Medical Robotic Systems and Equipment (IMERSE) Lab, Krieger leads a team of students, scientists, and engineers in the research and development of robotic tools and laparoscopic devices. The team made international news in early 2022 when its Smart Tissue Autonomous Robot (STAR) surgical robot performed laparoscopic surgery on the soft tissue of a pig without the guiding hand of a human—a significant step toward fully automated surgery on humans. He is also a member of the Data Science and AI Institute. Additional projects include the use of 3D printing for surgical planning and patient-specific implants; autonomous robotic soft tissue surgery; image-guided interventions and planning; autonomous robotic trauma diagnosis and care; magnetically actuated microrobots; and cardiac planning and patient-specific implant design. A member of the Laboratory for Computational Sensing and Robotics (LCSR) and the Malone Center for Engineering in Healthcare, as well as an inventor, Krieger has more than 30 patents and patent applications. Licensees of his patents include medical device start-ups Activ Surgical and PeriCor, as well as industry leaders such as Siemens, Philips, and Intuitive Surgical. Before joining Johns Hopkins in 2020, Krieger was an assistant professor at the University of Maryland and a research professor and program lead for smart tools at the Sheikh Zayed Institute for Pediatric Surgical Innovation at Children’s National Hospital in Washington, D.C.. He spent several years as a product leader at Sentinelle Medical Inc and Hologic Inc., developing devices and software systems from concept to FDA approval and market introduction. In 2022, Krieger was awarded the National Science Foundation’s prestigious Early CAREER Award to support his research on advancing autonomy for soft tissue robotic surgery and interventions. His team won the Best Innovation award in the Medical Robotics for Contagious Disease Challenge at the 2021 Hamlyn Symposium. Krieger completed his undergraduate and master’s degrees at the University of Karlsruhe in Germany and his doctorate at Johns Hopkins, where he pioneered an MRI-guided prostate biopsy robot used in more than 50 patient procedures at three hospitals. Related News View All News Krieger appointed Carol Croft Linde Faculty Scholar Axel Krieger, associate professor of mechanical engineering, has been appointed as the Carol Croft Linde Faculty Scholar. The five-year scholarship was endowed by L. Gordon Croft, Engr ’56, to help… Krieger Lab's robot performs first realistic surgery without human help Categories Faculty News Research System trained on videos of surgeries performs like an expert surgeon Beyond assistants: How AI could enable surgical robots to think and act autonomously Categories Autonomous Systems Faculty News Research Multi-modal training promises smarter, safer robotic surgery Site Menu Close ﻿",
  "content_length": 3821,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:21"
}