{
  "name": "Ayan Mukhopadhyay",
  "homepage": "https://www.ayanmukhopadhyay.com",
  "status": "success",
  "content": "Ayan Mukhopadhyay's WebpageSearch this siteEmbedded FilesSkip to main contentSkip to navigationayan dot mukhopadhyay at vanderbilt dot edu1025 16th Ave S,  Nashville, TN 37212I am a senior research scientist at Vanderbilt University I work on Artificial Intelligence to positively impact society. My research interests include multi-agent systems, robust machine learning, and decision-making under uncertainty. I am honored to be a Google AI Impact Scholar (2021) for Social Good.Before this, I was a postdoctoral research fellow at the Stanford Intelligent Systems Lab at Stanford University, USA, working under Mykel Kochenderfer, where I was awarded the 2019 CARS post-doctoral fellowship by the Center of Automotive Research at Stanford (CARS). Before joining Stanford, I was a Ph.D. student at Vanderbilt University’s Computational Economics Research Lab under Eugene Vorobeychik, working on decision-theoretic and machine learning-based approaches for multi-agent planning. My thesis was nominated for the Victor Lesser Distinguished Dissertation Award 2020.Recent NewsTwo papers accepted at NeurIPS 2025! Two new NSF grants: 1) a $700,000 award from NSF CIVIC Innovation Challenge Phase 2 to design machine learning and routing algorithms for sparse spatial-temporal data to improve the detection of illegal road closures, with Co-PIs Daniel Work, Meiyi Ma, and William Barbour; and 2) a $1.25 million Smart & Connected Communities grant to design decision-making algorithms in rapidly evolving environments to improve emergency response, with PI Hemant Purohit, and Co-PIs Hiba Baroud, Joshua Behr, and me! We are grateful to NSF for supporting our research. March 2024: Our work on using annealed importance sampling for decision-making in partially observable environments has been accepted at ICAPS 2025. February 2024: Our AAMAS '25 paper on optimizing vehicle-to-building interfaces by using reinforcement learning has been nominated for the best paper award, and the ICLR '25 paper on scalable decision-making in stochastic environments is now a spotlight paper!February 2025: At Vanderbilt, we received the VU-ISIS Outstanding System Award for deploying an AI-based paratransit optimization system and the VU-ISIS Outstanding Paper Award for using probabilistic search to make fixed-line services more efficient. January 2024: Our paper on scalable decision-making in stochastic environments has been accepted at ICLR 2025!December 2024: We have two papers accepted at AAMAS 2025, one as a full paper and another as an extended abstract. See you in Detroit!October 2024: Our EAAMO 23 paper \"Designing Equitable Transit Networks,\" led by student Sophie Pavia, has won the INFORMS Diversity, Equity, and Inclusion (DEI) Student Paper Award.October 2024: I co-presented a tutorial on Non-stationary Markov decision processes and NS-Gym, a software framework we have developed that enables seamless simulation of Gym-based problems in a non-stationary context. Check out the slides or access a Google Colab notebook to learn more!Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 3115,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:24"
}