{
  "name": "Ayan Chaudhury",
  "homepage": "https://cse.iitkgp.ac.in/~ayanc",
  "status": "success",
  "content": "Ayan Chaudhury Ayan Chaudhury Assistant Professor Department of Computer Science and Engineering Indian Institute of Technology Kharagpur Kharagpur 721302, West Bengal, India Office: A-203, CSE Annex building Phone: ext. 84646 E-mail: Bio: I am an Assistant Professor in the Department of Computer Science end Engineering at Indian Institute of Technology Kharagpur. Before joining IIT Kharagpur, I spent beautiful 2½ years as a postdoc at INRIA in the MOSAIC team working with Christophe Godin. Before that, I was a visiting scientist during the period Dec'18-Jan'19 at CVPR Unit, Indian Statistical Institute Kolkata, hosted by Ujjwal Bhattacharya. Previously I was a postdoc for about an year at KTH Royal Institute of Technology in the Lagergren lab. I did my PhD in October 2017 in Computer Science from University of Western Ontario where I was advised by John Barron. I did my bachelors in Physics (Hons.) and masters in Computer Science & Engineering from University of Calcutta. Research Interests: I am interested in 3D computer vision, and geometry processing in general. I am fascinated about problems like multi/single view 3D reconstruction, point cloud/mesh registration, segmentation, and shape analysis problems for different application areas. These days I am focusing on problems like correspondence estimation among deformable and occluded objects, object detection and registration in cluttered scene, part segmentation, volumetric reconstruction, and related problems. Alongside, I have long term interest in the interdisciplinary area on agricultural robotics and plant phenomics applications of computer vision. I am interested in problems like plant organ detection & tracking, tree modelling & reconstruction, organ segmentation, etc). Teaching Autumn'25: Machine Learning (CS60050), with Prof. Somak Aditya Programming and data structures laboratory (CS19003), with Prof. Monosij Maitra Spring'25: Programming and data structures (CS10003) Programming and data structures laboratory (CS19003), with Prof. Palash Dey and Prof. Debaditya Roy Autumn'24: Algorithms-I (CS21203), with Prof. Abir Das Algorithms laboratory (CS29203), with Prof. Abir Das Spring'24: Computer Graphics (CS60012) Programming and data structures laboratory (CS19003) Autumn'23: Algorithms-I (CS21203), with Prof. Abir Das Algorithms laboratory (CS29203), with Prof. Abir Das Spring'23: Computer Graphics (CS60012) Programming and data structures laboratory (CS19003), with Prof. Jayanta Mukhopadhyay Autumn'22: Algorithms-I (CS21003/21203), with Prof. Abir Das Algorithms laboratory (CS29003/29203), with Prof. Abir Das Spring'22: Computer Graphics (CS43004/CS60012) Programming and data structures laboratory (CS19003), with Prof. Bivas Mitra Students PhD: Rahul Barman Soumyajit Das (Co-supervision with Prof. Jayanta Mukhopadhyay) Supon Mazumdar Saptak Sil Project JRF: Kartikeya Singh(2024), Pritesh Kumar Verma(2023-24) BTech/Dual degree: Rishit Garg, Saptarshi Sarkar, Bhukya Mahesh, Lubesh Sharma, Sreejita Saha, Sakshi Agarwal Kothapalli Dileep('23), Anamitra Mukhopadhyay('24), Aditya Vallakatla('24), Tushar Bokade('24) MTech: Siddhamsetti Bhaskar Chandu, Ayan Maity Sharmistha Bhattacharjee('23 - RoboAnalyzer Award for best algorithm/software oriented masters thesis project), Pranav Sonare('24), Aditya Hirwani('24), Vivek Das ('25), Sumit Dwivedi ('25), Rahul Ram ('25), Bankar Akash Vijay ('25), Aditya Shrivastava ('25 - Best institute masters thesis project award) Funded Projects \"4D Cardiac Modelling of Pediatric Heart\", TCS Research, 2025-'28 (role: Co-PI) \"Multimodal Learning of Document Image Features With Mobile VLM Using Data Centric Approach\", Microsoft India R&D, 2024-'25 (role: Co-PI) \"4D Shape Reconstruction and Pose Estimation of Underwater Fish towards Smart Aquaponic System\", Technology Innovation Hub on AI and ML for Interdisciplinary Cyber Physical Systems (AI4ICPS), 2023-'25 (role: Co-PI) \"Deep 3D Plant Organ Segmentation: from Annotated Real Data to Geometric Plant Models\", Faculty Start-up Research Grant IIT Kharagpur, 2023-'26 (role: PI) \"3D Reconstruction of Deformable Plants for Smart Farming and Remote Sensing Applications\", DST SERB (Start-up Research Grant), 2022-'24 (role: PI) Publications Journals and Conferences R. Barman and A. Chaudhury, \"Deformable Shape Registration from Inexact Correspondences\", IEEE International Conference on Image Processing (ICIP), Anchorage, Alaska, September 14-18, 2025. A. Vallakatla and A. Chaudhury, \"BicycleDualNet: BicycleGAN-powered Dual Encoder Network for Single Image 3D Reconstruction\", IEEE International Conference on Image Processing (ICIP), Anchorage, Alaska, September 14-18, 2025. S. B. Pandey, D. Colliaux and A. Chaudhury, \"Spatio-Temporal Correspondence Estimation of Growing Plants by Hausdorff Distance based Skeletonization for Organ Tracking\", IEEE International Conference on Robotics and Automation (ICRA), Yokohama, Japan, May 13-17, 2024. A. Chaudhury, P. S. Mukherjee, S. Das, C. Biswas and U. Bhattacharya, \"A Deep OCR for Degraded Bangla Documents\", ACM Transactions on Asian and Low-Resource Language Information Processing, Vol. 21, No. 5, Article 98, pp 1-20, September 2022. A. Chaudhury, P. Hanappe, R. Azais, C. Godin and D. Colliaux, \"Transferring PointNet++ Segmentation from Virtual to Real Plants\", in Computer Vision in Plant Phenotyping and Agriculture (CVPPA), in Conjunction with International Conference on Computer Vision (ICCV), Montreal, Canada, October 2021. A. Chaudhury, \"Multilevel Optimization for Registration of Deformable Point Clouds\", IEEE Transactions on Image Processing, Vol. 29, pp. 8735-8746, 2020. A. Chaudhury, F. Boudon and C. Godin, \"3D Plant Phenotyping: All You Need is Labelled Point Cloud Data\", in Proceedings of Computer Vision Problems in Plant Phenotyping (CVPPP), in Conjunction with European Conference on Computer Vision (ECCV), Glasgow, Scotland, August 2020. A. Chaudhury and C. Godin, \"Skeletonization of Plant Point Cloud Data using Stochastic Optimization Framework\", Frontiers in Plant Science, 11:773, 2020. A. Chaudhury and J.L. Barron, \"Plant Species Identification from Occluded Leaf Images\", IEEE/ACM Transactions on Computational Biology and Bioinformatics, Vol. 7, No. 3, pp. 1042-1055, 2020. A. Chaudhury, C. Ward, M. Brophy, A.G. Ivanov, N.P.A. Huner, B. Grodzinski, R.V. Patel, and J.L. Barron, \"Machine Vision System for 3D plant phenotyping\", IEEE/ACM Transactions on Computational Biology and Bioinformatics, Vol. 16, No. 6, pp. 2009-2022, 2019. A. Chaudhury, and J.L. Barron, \"Occluded leaf matching with full leaf databases using explicit occlusion modelling\", In Proceedings of the 15th Conference on Computer and Robot Vision (CRV), Toronto, Canada, 9-11 May 2018 (oral). A. Chaudhury, M. Brophy, and J.L. Barron, \"Junction Based Correspondence Estimation of Plant Point Cloud Data using Subgraph Matching\", IEEE Geoscience and Remote Sensing Letters, Vol. 13, No. 8, pp. 1119-1123, August 2016. A. Chaudhury, C. Ward, A. Talasaz, A.G. Ivanov, N.P.A. Huner, B. Grodzinski, R.V. Patel, and J.L. Barron, \"Computer Vision Based Autonomous Robotic System for 3D Plant Growth Measurement\", In Proceedings of the 12th Conference on Computer and Robot Vision (CRV) 2015. M. Brophy, A. Chaudhury, S. Beauchemin, and J.L. Barron, \"A method for global non-rigid registration of multiple thin structures\", In Proceedings of the 12th Conference on Computer and Robot Vision (CRV) 2015. Book Chapters A. Chaudhury and J.L. Barron, \"3D Phenotyping of Plants\", in \"3D Imaging, Analysis, and Applications\", 2nd edition, Springer (pp. 699-732), 2020. A. Chaudhury and C. Godin, \"Geometry Reconstruction of Plants\", in \"Intelligent Image Analysis for Plant Phenotyping\", CRC Press/Taylor & Francis (Chapter 6), 2020. Technical Report A. Chakrabarti, S. Sur-Kolay, and A. Chaudhury, \"Linear Nearest Neighbor Synthesis of Reversible Circuits by Graph Partitioning\", arxiv:1112.0564, 2012. Previous Teaching (at University of Western Ontario) Instructor Computer Graphics: Fall'16 Teaching Assistance Computer Vision: Fall'14, Fall'15 Computer Graphics: Fall'12, Fall'13, Fall'15 Data Analysis & Visualization: Winter'14, Winter'15, Winter'16, Winter'17 Computer Science Fundamentals II: Winter'13, Summer'14 Non-academic interests: I am passionate about high altitude mountaineering. I have done Basic Mountaineering Course (BMC) from Nehru Institute of Mountaineering (NIM), Uttarkashi and Advance Mountaineering Course (AMC) from Atal Bihari Vajpayee Institute of Mountaineering and Allied Sports (ABVIMAS), Manali, both with \"A\" grade. I am interested in high altitude mountaineering expeditions & it's a serious hobby.",
  "content_length": 8694,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:23"
}