{
  "name": "Aylin Yener",
  "homepage": "https://ece.osu.edu/people/yener.5",
  "status": "success",
  "content": "Yener, Aylin | Electrical & Computer Engineering Skip to main content Aylin Yener Professor, Electrical and Computer Engineering Professor, Computer Science and Engineering Roy and Lois Chope Chair in Engineering, College of Engineering Professor, Integrated Systems Engineering Dreese Laboratories2015 Neil Ave Columbus, OH 43210-1210 yener.5@osu.edu Download CV Ohio State Research Lab Website 6G and Beyond Initiative Biography Aylin Yener holds the Roy and Lois Chope Chair in Engineering at The Ohio State University since January 2020, and is Professor of Electrical and Computer Engineering, Professor of Computer Science and Engineering and Professor of Integrated Systems Engineering.  Until December 2019, she was a Distinguished Professor of Electrical Engineering and a Dean’s Fellow at Penn State, where she joined in 2002 as an assistant professor. In 2008-2009, she was a visiting associate professor in the Electrical Engineering Department at Stanford University, and in 2016-2017 she was a visiting professor in the same department. She also held a visiting position in Telecom Paris Tech in the summer of 2016. Yener’s research studies networked entities. Her current focus areas relate to various pillars of next generation connectivity of computing, communicating and sensing entities (known as 6G) including smart environments, artificial intelligence and security/privacy. Yener is known for introducing several \"first papers\" in communications and information theory that led to research areas including physical layer security (2005 thanks to NSF), energy harvesting wireless communication networks (2009 thanks to NSF) (co-inventor), and semantic communications (2012 thanks to ARL). She is an unusual theorist who gets inspired by futuristic applications and seeks to make real life impact by foundational thinking. Her research has been supported by NSF, DARPA, NSA, ARL/ARO, DoT, and various industry and state entities. Yener is a fellow of the American Association for Advancement Science (AAAS). She is a fellow of the Institute of Electrical and Electronics Engineers  (IEEE).  She is an elected member of The Science Academy, Turkey. Yener received the IEEE Information Theory Society Joy Thomas Paper Award in 2025, IEEE Communication Society Communication Theory Technical Achievement Award in 2020, the IEEE Communications Society Best Tutorial Paper Award in 2019, the IEEE Women in Communications Outstanding Achievement Award in 2018, the IEEE Marconi Prize Paper Award in 2014, and the IEEE ICC best paper award in 2010. In 2017, she was a Clariviate Analytics highly cited researcher. She has been a Distinguished Lecturer for three professional societies: IEEE Communication Society (2018-2019), IEEE Information Theory Society (2019-2021) and IEEE Vehicular Technology Society (2017-2021). She has delivered over 80 technical keynotes and invited lectures. An active volunteer for IEEE, Yener was the president of the IEEE Information Theory Society in 2020.  She also served on the adcom for the IEEE Systems Council and as an elected member (among former society presidents) of the nominations and appointments committee of the Technical Activities Board of the IEEE. She served as the Treasurer, Board of Governors member,  Vice President and Past President of the IEEE Information Theory Society.  Simultaneously, she has held numerous volunteer roles (such as conference chair/organizer, editor, senior editor) for the IEEE Communications, Information Theory, Signal Processing and Vehicular Technology Societies over a quarter of a century. Yener is the current Editor-in-Chief of IEEE Transactions on Green Communication and Networking (2022-2026), a journal dedicated to energy sustainability of next generation networked systems, jointly sponsored by IEEE Communications Society, IEEE Signal Processing Society and IEEE Vehicular Technology Society. In 2022, Yener has been elected in the IEEE general elections as Division IX Director Elect which is a three year leadership position, with 2023 Director Elect, followed by 2024-2025 Director for Division IX. In this capacity, in addition to being Division IX director that places her as a voting member of the Technical Activities Board of the IEEE, she serves on the Board of Directors for IEEE. Yener has mentored and trained 16 PhD students and 5 postdocs to date, who have gone on to professorships (with early career awards), and various top industries. She is committed to highest scholarly standards to advance science and technology for the benefit of humanity as well as the educational broader impact of research. She is the co-founder of the IEEE North American School of Information Theory which runs annually since 2008, and presently leads the education and workforce development efforts of an NSF-funded national center. Fun fact: she had no idea buckeye was a type of nut prior to joining Ohio State. Expertise 6G networked communications, sensing, computation and learning Artificial Intelligence and Machine Learning Wireless Communications Information Theory Security and Privacy Optimization",
  "content_length": 5115,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:26"
}