{
  "name": "Ayon Chakraborty",
  "homepage": "https://www.cse.iitm.ac.in/~ayon",
  "status": "success",
  "content": "Homepage of Ayon Chakraborty CV Google Scholar DBLP Profile Ayon Chakraborty Assistant Professor Department of Computer Science and Engineering IIT Madras Email: ayon@cse.iitm.ac.in Office Phone: (044) 2257 4390 Research Group: Sensing and Networked Systems Engineering Group (SeNSE) Interested in working with us? We are looking for full-time M.S. or PhD candidates in the general area ML-driven sensing systems for mobile computing applications. Explore more about our recent works and openings here - SeNSE. I am broadly interested in system-level design of future intelligent wireless systems and sensing technologies, spanning both algorithm design as well as system prototyping. I received my PhD in Computer Science from the State University of New York (SUNY) at Stony Brook (advisor: Samir R. Das). Further, I worked as a researcher at the Mobile Communications and Networking Division at NEC Labs America, Princeton, NJ for three years. Earlier, I received a B.E. in Computer Science and Engineering from Jadavpur University. I completed my schooling from South Point (High) School. I was born and brought up in the beautiful city of Kolkata (Tollygunj). Teaching CS2300: Foundations of Computer Systems Design (UG Core, Diwali'23, Diwali'22). The class also includes a laboratory component. Additionally, I offer (a slightly simplified version) of this course through the BS Data Science Program as an elective for the Computer Systems bucket. The recordings are publicly available and are linked in the CS2300 webpage. CS3205: Introduction to Computer Networks (UG Elective, Holi'25, Holi'24, Holi'22). I will be offering a version of this course through the BS Data Science Program as an elective for the Computer Systems bucket. The recordings are not available yet. The course is likely going to be offered from Sep'25 batch. CS6120 - Wireless Communication and Networks (PG Elective, Diwali'25). *Currently Teaching* CS6650: Smart Sensing for Internet of Things (PG Elective, Holi'23, Diwali'21, Holi'21). I also offer this course as an elective for our CSE Web M.Tech program in Information Security. The recordings are publicly available and are linked in the CS6500 webpage. CS1100: Introduction to Programming (Non-CSE UG Core, Summer'21, Diwali'24). The class also includes a laboratory component. Holi semester is held between January and May, while Diwali semester is held between August and December. Instead of naming semesters after seasons in the United States (Spring, Fall - hey, Chennai doesn't even have winter), I prefer naming them after two large Indian festivals held during the respective semesters. Yes, India is a \"land of festivals\"! Location Tracking for Internet of Things (AICTE QIP Short Term Course, 2022). Recorded lectures are available in the linked course page. Services Conference (as TPC Member) ACM MobiCom (2026) IEEE PerCom (2026) IEEE INFOCOM (2026, 2025, 2024) COMSNETS (2026, 2025, 2024, 2023, 2022, 2021) ACM CoNEXT (2025, 2024) ICDCN (2025, 2024, 2023, 2022) IEEE ICCCN (2022) ACM COMPASS (2021, 2022) IEEE ICDCS (2018, 2019, 2021) Journals (* most regularly) Editorial Board Member Ad-Hoc Networks (Elsevier) IEEE Transactions on Mobile Computing * IEEE/ACM Transactions on Networking * IEEE Transactions on Wireless Communications IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems IEEE Communications Magazine",
  "content_length": 3397,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:27"
}