{
  "name": "Ayse Tosun",
  "homepage": "http://web.itu.edu.tr/tosunay",
  "status": "success",
  "content": "Dr. Ayşe Tosun Dr. Ayse Tosun Home Courses Research Publications Latest News 28th Oct 2016 New article w/ Woubshet Nema, Pilar Rodriguez and Markku Oivo published online in Information and Software Technology: Analyzing the concept of technical debt in the context of agile software development: A systematic literature review 6th Jan 2016 New article w/ Ayse Bener and Shirin Akbarinasaji published online in Software Quality Journal: A systematic literature review on the applications of Bayesian networks to predict software quality 28th June 2015 New article w/ Bora Caglayan, Andriy Miranskyy and Ayse Bener published in Software Quality Journal: Predicting Defective Modules in Different Test Phases 7th June 2015 New chapter on \"Software Analytics Patterns In Practice\" w/ Ayse Bener, Bora Caglayan, Ekrem Kocaguneli and Gul Calikli is ready for publication in the new book by Morgan Kaufmann: \"The Art and Science of Analyzing Software Data\". 22nd Feb 2015 New paper w/ Emad Shihab and Yasu Kamei published in Emp. Soft. Eng. Journal: Studying High Impact Fix Inducing Changes 12th Jan 2015 Our paper Are Students Representatives of Professionals in Software Engineering Experiments? w/ Iflaah Salman and Prof. Natalia Juristo is accepted for publication at ICSE 2015! Dr. Ayse Tosun is an assistant professor at Faculty of Computer and Informatics Engineering, Istanbul Technical University (ITU), Istanbul, Turkey. She served as vice chair for Computer Engineering Department between 2017-2018, member of the Faculty Board between 2017-2019, and coordinator of ABET Accreditation during 2014-2017. She has still been in executive boards of Artificial Intelligence and Data Science Applied Research Center and Informatics Institute in ITU. Prior to joining ITU, she worked as a post-doctoral research fellow at Department of Information Processing Science, University of Oulu, Finland. As a post-doc, she visited Rochester University, USA for four weeks, and UPM, Madrid for two weeks. She received her PhD in 2012, and MSc degree in 2008 from the Department of Computer Engineering, Bogazici University, Turkey. During her PhD, she visited Software Reliability Lab at Microsoft Research, Cambridge as a research intern for five weeks. Dr. Tosun is in the review boards of the top-tier journals in software engineering, such as IEEE Transactions on Software Engineering, Empirical Software Engineering, Information and Software Technology, Software Quality Journal, and Journal of Systems and Software. She has also been in the program and organization committees of the international conferences on software engineering. Her research interests are empirical software engineering, more specifically mining software data repositories, software measurement, software process improvement, software quality prediction models, and applications of AI on building recommendation systems for software engineering. Contact details Dr. Ayşe Tosun Assistant Professor Faculty of Computer & Informatics Engineering Istanbul Technical University 34469 Maslak Istanbul - TURKEY Room: 2220 E-mail: tosunay at itu dot edu dot tr Phone: +90 212 285 7459",
  "content_length": 3147,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:30"
}