{
  "name": "Aysenur Birturk",
  "homepage": "http://user.ceng.metu.edu.tr/~birturk",
  "status": "success",
  "content": "CV of Aysenur Akyuz Birturk Ayşenur Akyüz Birtürk Contact Information. 1 Scientific Interest Areas. 1 Education. 1 Experience. 2 Courses Taught 2 Theses Supervised. 3 Publications. 4 Honors and Awards. 10 Seminars. 10 Projects. 10 Memberships. 10 Useful Links. 11 Other. 11 Contact Information Middle East Technical University, Dept. of Computer Engineering, 06531 Ankara-TURKEY Office: A-303 Telephone: +90-312-210-5578 Fax: +90-312-210-5544 e-mail: birturk@ceng.metu.edu.tr Scientific Interest Areas Artificial Intelligence, Natural Language Processing, Computational Linguistics, Knowledge Engineering, Knowledge Representation and Reasoning, Data Mining, Expert Systems, Web Personalization, Recommender Systems. Education Basic Education: Bahçelievler Deneme Lisesi, Ankara, Turkey, June 1980. Bachelor of Science: Dept. of Computer Engineering, Middle East Technical University, Ankara, Turkey, June 1985. Master of Science: Dept. of Computer Engineering, Middle East Technical University, Ankara, Turkey, May 1988. Thesis: A Model for Representing Concepts: Conceptual Dependency Theory. Supervisor: Dr.Müren Gökeri. Doctor of Philosophy: Dept. of Computer Engineering, Middle East Technical University, Ankara, Turkey, January 1998. Thesis: A Computational Analysis of Turkish using the Government-Binding Approach. Supervisor: Dr.Cem Bozşahin. Experience Programmer and Systems Expert: (September'85-September'89) IsBank Computer Center, Ankara, Turkey. Projects worked on this position include: systems analysis and development of programs for several banking applications on the environments SPERRY1100/EXEC/DBMS and IBM3090/MVS/IMS. design and development of a Management Information System(MIS) for the bank. relational database design and tool testing. development of an expert system for the financial analysis of firms using the expert system shell TI PC++. Research/Teaching Assistant: (September'89-February'94) Middle East Technical University, Dept. of Computer Engineering, Turkey. Instructor: (February'94- now) Middle East Technical University, Dept. of Computer Engineering, Turkey. New Course(s) Developed: · Ceng 463 Introduction to Natural Language Processing · Ceng 414 Introduction to Data Mining Courses Taught: · Ceng 111 Introduction to Computer Engineering · Ceng 301 Programming in COBOL · Ceng 112/220/221Programming in Pascal · Ceng 200/210 Programming in Fortran · Ceng 230 C Programming · Ceng 301 Algorithms and Data Structures · Ceng 491-492 Senior Seminar and Project I&II · Ceng 223 Discrete Computational Structures · Ceng 280 Formal Languages and Abstract Machines · Ceng 356 Lisp and Prolog · Ceng 424 Logic for Computer Science · Ceng 463 Introduction to Natural Language Processing · Ceng 462 Artificial Intelligence · Ceng 561 Artificial Intelligence · Ceng 563 Computational Linguistics · Ceng 565 Theory of Computation · Ceng 568 Knowledge Engineering · Ceng 770 Advanced Data Mining · IDEA- C ile Bilgisayar Programcılığına Giriş Summer Research Assistant: (June'96 - Nov'96 and June'97 - August'97) NEC Research Institute, Inc., Computer Science Division, Princeton, NJ, USA; worked with Dr.Sandiway Fong on PAPPI project, and developed a GB parser for Turkish. Academic Intern: (July'98 - August'98) NEC Research Institute, Inc., Computer Science Division, Princeton, NJ, USA; worked on a finite state machine solution to Turkish compounds. Theses Supervised Caglar Iskender, A Method for Estimation of Empty Categories and its Application to Turkish, M.S.Thesis, December 2002. Ozgen Canan, Generating Motion-Economical Plans for Manual Operations, Ms. Thesis, September 2005. Oznur Kirmemis, OpenMoRe: A Content-based Movie Recommendation System, M.S.Thesis, May 2008. Fatih Mehmet Guler, Natural Intelligence – A Question Answering System, M.S. without Thesis Graduation Project, January 2010. Omer Sunercan, Missing Link Discovery in Wikipedia: A Comparative Study, M.S.Thesis, January 2010. Mustafa Azak, CROSSING: A Framework to Develop Knowledge-based Recommenders in Cross Domains, M.S.Thesis, February 2010. Fatih Gurcan, A Hybrid Movie Recommender Using Dynamic Fuzzy Clustering, M.S.Thesis, February 2010. Akif Boynuegri, Cross-Lingual Information Retrieval on Turkish and English Texts, M.S. Thesis, April 2010. Seda Cakiroglu, Suggest me a Movie: A Multi-Client Movie Recommendation Engine on Facebook, M.S. Thesis, June 2010. Fatih Aksel, Enhancing Accuracy of Hybrid Recommender Systems through Adapting the Domain Trends, M.S. Thesis, August 2010. Yusuf Karagol, Event Recognition in Turkish Texts, M.S. Thesis, September 2010. Ipek Tatli, A Tag-based Hybrid Music Recommendation System Using Semantic Relations and Multi-Domain Information, M.S.Thesis, September 2011. Ugur Ceylan, An Ontology-Based Hybrid Recommendation System Using Semantic Similarity Measure and Feature Weighting, M.S.Thesis, September 2011. Sayil Sacak Duzgun, BORGO: A Book Recommender for Reading Groups, M.S.Thesis, January 2012. Elif Kamer Karatas, An Ontology-Based Approach to Requirements Reuse Problem in Software Product Lines, M.S.Thesis, August 2012. Ceyda Er Koksoy, Improved Wind Power Forecasting Using Combination Methods, M.S.Thesis, September 2015. Yusuf Arslan, M.S.Thesis, Basin-based Clustering of Hydroelectric Power Plants in Turkey by Use of Stream-Flow and Hydroelectric Energy Production Data, September 2015. Publications · Ceyda Er Koksoy, Mehmet Baris Ozkan, Serkan Buhan, Turan Demirci, Aysenur Birturk, and Pinar Karagoz, Improved Wind Power Forecasting Using Combination Methods, Special session on Machine Learning in Energy Applications of the 14th IEEE International Conference on Machine Learning and Applications (ICMLA'15), Miami, Florida, USA, December 9 – 11, 2015. · Yusuf Arslan, Aysenur Birturk, Sinan Eren, Basin Clustering of Turkey by Use of Monthly Stream-flow Data, Special session on Machine Learning in Energy Applications of the 14th IEEE International Conference on Machine Learning and Applications (ICMLA'15), Miami, Florida, USA, December 9 – 11, 2015. · Ceyda Er Koksoy, Mehmet Baris Ozkan, Dilek Kucuk, Abdullah Bestil, Sena Sonmez, Serkan Buhan, Turan Demirci, Pinar Karagoz and Aysenur Birturk, Performance Analysis of Data Mining Techniques for Improving the Accuracy of Wind Power Forecast Combination, ECML/PKDD 2015, 3rd International Workshop on Data Analytics for Renewable Energy Integration (DARE'15), 6-11 September 2015, Porto, Portugal. · Fatih Gurcan, Aysenur Birturk, A Hybrid Movie Recommender using Dynamic Fuzzy Clustering, 30th International Symposium on Computer and Information Sciences (ISCIS 2015), 23-25 September 2015, London, UK. Book Chapter in Information Sciences and Systems 2015, Volume 363 of the series Lecture Notes in Electrical Engineering, pp 159-169, 04 August 2015, Editors: Omer H. Abdelrahman, Erol Gelenbe, Gokce Gorbil, Ricardo Lent. ISBN: 978-3-319-22634-7 (Print) 978-3-319-22635-4 (Online) · Elif Karatas, Baris Iyidir, and Aysenur Birturk, Ontology-based Software Requirements Reuse: Case Study in Fire Control SPL Domain, The 3rd InternationalWorkshop on Software Mining, In conjunction with the IEEE International Conference on Data Mining ( ICDM 2014), Shenzhen, China, December 14-17, 2014. · Kemal Alecakir, Aysenur Birturk, Ontoloji Tabanlı Tıbbi Form Tasarim Aracı, accepted for oral presentation at Global Conference on Healthcare Systems Engineering  (GCHSE) 2014, Istanbul Technical University, Macka, Istanbul, Turkey, 5-8 August 2014 (withdrawn paper, since not registered). · Sayil Düzgün, Aysenur Birtürk, A Web-based Book Recommendation Tool for Reading Groups, The AAAI 2012 (The Twenty-Sixth Conference on Artificial Intelligence)  Workshop on Intelligent Techniques for Web Personalization and Recommender Systems (ITWP 2012), 22-26 June 2012, Toronto, Ontario, Canada. · Elif Kamer Karataş, Barış İyidir ve Ayşenur Birtürk. Yazılım Ürün Hattı Yaklaşımında Gereksinimlerin Yeniden Kullanımı: ASELSAN Deneyimi, 6.Ulusal Yazılım Mühendisliği Sempozyumu (UYMS 2012), 30 Mayıs-1 Haziran 2012. · Ipek TATLI, Aysenur BIRTURK, A Tag-based Hybrid Music Recommendation System Using Semantic Relations and Multi-domain Information, The Fifth ICDM Workshop on Mining Multiple Information Sources (MMIS11), In conjunction with The IEEE International Conference on Data Mining (ICDM-11), December 11-14, 2011, Vancouver, Canada. · Ipek TATLI, Aysenur BIRTURK, Using Semantic Relations in Context-based Music Recommendations, ACM RecSys'11 Workshop on Music Recommendation and Discovery (WOMRAD11), In conjunction with ACM RecSys 2011, 22-27 October 2011, Chicago, Illinois, USA. · Sayil Duzgun, Aysenur Birturk, BoRGo: A Book Recommender for Reading Groups, accepted for oral presentation at ACM RecSys'11 Workshop on \"Human Decision Making in Recommender Systems\", In conjunction with the 5th ACM Conference on Recommender Systems, 22-27 October 2011, Chicago, Illinois, USA (withdrawn paper, since not registered). · Ugur Ceylan, Aysenur Birturk, Combining Feature Weighting and Semantic Similarity Measure for a Hybrid Movie Recommender System, The fifth International Workshop on Social Network Mining and Analysis (SNAKDD 2011), In conjunction with 17th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD-2011), August 21, 2011. · Ugur Ceylan, Aysenur Birturk, Content-boosted Collaborative Filtering Using Semantic Similarity Measure, 7th International Conference on Web Information Systems and Technologies (WEBIST'11),  6-9 May 2011, Noordwijkerhout, The Netherlands. · Ipek Tatli, Aysenur Birturk. A Content-based Recommendation System for Music Domain Based on Tags. Accepted to eChallenges e-2010, 27-29 October 2010, Warsaw, Poland (withdrawn paper, since not registered). · Fatih Aksel, Aysenur Birtürk. Enhancing Accuracy of Hybrid Recommender Systems through Adapting the Domain Trends, The International Workshop on the Practical Use of Recommender Systems, Algorithms and Technologies (PRSAT 2010) in conjunction wi",
  "content_length": 20594,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:36"
}