{
  "name": "Ayse Kivilcim Coskun",
  "homepage": "https://www.bu.edu/eng/profile/ayse-coskun",
  "status": "success",
  "content": "Ayșe Coskun, PhD | College of Engineering Ayșe Coskun, PhDProfessor (ECE, SE Affiliate); Associate Dean for Research and Faculty Development, Director, Center for Information and Systems Engineering Office 8 St. Mary’s St Boston, MA 02215, Room 338Email acoskun@bu.eduPhone (617) 358-3641 Website Ayse Kivilcim Coskun Education PhD, University of California, San Diego, 2009Primary Appointment Department of Electrical and Computer Engineering In the News BU Engineers Are Helping to Bring Semiconductor Production Back to the US November 17, 2025 Ayse Coskun highlights chip technology research at BU. [ More ] Seven ENG Faculty Honored for Real-World Impact Research October 15, 2025 The annual Ignition Awards honor innovative BU projects that are ready to... [ More ] Areas of Interest Energy-efficient computing Cloud computing High performance computing Computer architecture Embedded Systems PublicationsView a complete list of publications chronologically by year.View a complete list of publications by citation. Honors and Awards Editorship: Deputy Editor-in-Chief, IEEE Transactions on Computer Aided Design, 2022-Present Associate Editor, ACM Transactions on Architecture and Code Optimization, 2021-Present Associate Editor, IEEE Transactions on Computers, 2020-2021 Associate Editor, IEEE Transactions on Computer Aided Design, 2016-2021 Associate Editor, Elsevier Microelectronics Journal, 2017-2018 Awards: IBM Faculty Award (IBM Global University Program Academic Award), 2020 Invited participant at the National Academy of Engineering Frontiers of Engineering Symposium, Sept. 2019 Best Artifact Award at the International European Conference on Parallel and Distributed Computing (EuroPar), 2018 Ernest S. Kuh Early Career Award, IEEE Council on Electronic Design Automation (CEDA), 2017 Gauss Award at the International Supercomputing Conference – High Performance (ISC-HPC), 2017 NSF CAREER Award, 2012-2017 Junior Fellow at The Rafik B. Hariri Institute for Computing at Boston University, 2012-2013 Best Paper Award, High Performance Embedded Computing (HPEC) Workshop, Sept. 2011 Best Paper Award, IFIP/IEEE International Conf. on Very Large Scale Integration (VLSI-SoC), Oct. 2009Classes Taught EC327 Introduction to Software Engineering EC535 Introduction to Embedded Systems EC713 Advanced Computing Systems and ArchitectureAdditional Affiliations Center for Information and Systems Engineering Hariri Institute for Computing and Computational Science & Engineering Division of Systems Engineering Department of Computer Science Departments or Divisions: Electrical & Computer Engineering, Systems Engineering Affiliations: Energy, Sustainability & Climate, Intelligent, Autonomous & Secure Systems, Primary & Affiliated Faculty View all profiles",
  "content_length": 2773,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:29"
}