{
  "name": "Aysegul Dundar",
  "homepage": "http://www.cs.bilkent.edu.tr/~adundar",
  "status": "success",
  "content": "Aysegul Dundar Ayşegül Dündar Asst. Prof. at Bilkent University Ankara, Turkey Google Scholar I am an Assistant Professor of Computer Science at Bilkent University, Ankara, Turkey. Previously, I was a senior research scientist at NVIDIA, Santa Clara, USA. I received my Ph.D. degree at Purdue University, under the supervision of Professor Eugenio Culurciello, in 2016. My research was focused on embedded vision systems and was featured in popular technology journals such as MIT Technology Review and BBC. I received a B.Sc. degree in Electrical and Electronics Engineering from Bogazici University in Turkey, in 2011. My current research focuses on deep learning algorithms for computer vision. I lead the Generative Deep Learning Research Lab at Bilkent University. Please visit the web-page. Prospective students, please see this page. Recent Publications: RoPECraft: Training-Free Motion Transfer with Trajectory-Guided RoPE Optimization on Diffusion Transformers Ahmet Berke Gokmen, Yigit Ekin, Bahri Batuhan Bilecen, Aysegul Dundar Neural Information Processing Systems (NeurIPS) 2025 Paper Web-page Code Identity Preserving 3D Head Stylization with Multiview Score Distillation Bahri Batuhan Bilecen, Ahmet Berke Gokmen, Furkan Guzelant, Aysegul Dundar IEEE International Conference on Computer Vision (ICCV) 2025 Paper Web-page Code 3D Stylization via Large Reconstruction Model Ipek Oztas, Duygu Ceylan, Aysegul Dundar SIGGRAPH 2025 Paper Web-page Code Reference-Based 3D-Aware Image Editing with Triplanes Bahri Batuhan Bilecen, Yigit Yalin, Ning Yu, Aysegul Dundar IEEE Conference on Computer Vision and Pattern Recognition (CVPR) 2025 Highlight Paper Web-page Code Dual Encoder GAN Inversion for High-Fidelity 3D Head Reconstruction from Single Images Bahri Batuhan Bilecen, Ahmet Berke Gokmen, Aysegul Dundar Neural Information Processing Systems (NeurIPS) 2024 Web-page Code CLIPAway: Harmonizing Focused Embeddings for Removing Objects via Diffusion Models Yigit Ekin, Ahmet Burak Yildirim, Erdem Eren Caglar, Erkut Erdem, Aykut Erdem, Aysegul Dundar Neural Information Processing Systems (NeurIPS) 2024 Paper Web-page Code Warping the Residuals for Image Editing with StyleGAN Ahmet Burak Yildirim, Hamza Pehlivan, Aysegul Dundar International Journal of Computer Vision (IJCV) 2024 Paper Diverse Semantic Image Editing with Style Codes Hakan Sivuk, Aysegul Dundar in submission Paper Web-page Code Inst-Inpaint: Instructing to Remove Objects with Diffusion Models Ahmet Burak Yildirim, Vedat Baday, Erkut Erdem, Aykut Erdem, Aysegul Dundar in submission Paper Web-page Code Refining 3D Human Texture Estimation from a Single Image Said Fahri Altindis, Adil Meric, Yusuf Dalva, Ugur Gudukbay, Aysegul Dundar IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 2024 Paper Web-page Code Learning Portrait Drawing with Unsupervised Parts Burak Tasdemir, Mustafa Goktan Gudukbay, Dogac Eldenk, Adil Meric, Aysegul Dundar International Journal of Computer Vision (IJCV) 2023 Paper Diverse Inpainting and Editing with GAN Inversion Ahmet Burak Yildirim, Hamza Pehlivan, Bahri Batuhan Bilecen, Aysegul Dundar IEEE International Conference on Computer Vision (ICCV) 2023 Paper Progressive Learning of 3D Reconstruction Network from 2D GAN Data Aysegul Dundar, Jun Gao, Andrew Tao, Bryan Catanzaro IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 2023 Paper StyleRes: Transforming the Residuals for Real Image Editing with StyleGAN Hamza Pehlivan, Yusuf Dalva, Aysegul Dundar IEEE Conference on Computer Vision and Pattern Recognition (CVPR) 2023 Paper Web-page Code Image-to-Image Translation with Disentangled Latent Vectors for Face Editing Yusuf Dalva, Hamza Pehlivan, Oyku Irmak Hatipoglu, Cansu Moran, Aysegul Dundar IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 2023 Paper Web-page Code Fine Detailed Texture Learning for 3D Meshes with Generative Models Aysegul Dundar, Jun Gao, Andrew Tao, Bryan Catanzaro IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 2023 Paper Benchmarking the Robustness of Instance Segmentation Models Yusuf Dalva, Hamza Pehlivan, Said Fahri Altındis, Aysegul Dundar IEEE Transactions on Neural Networks and Learning Systems (TNNLS) 2023 Paper VecGAN: Image-to-Image Translation with Interpretable Latent Directions Yusuf Dalva, Said Fahri Altındis, Aysegul Dundar European Conference on Computer Vision (ECCV) 2022 Paper Web-page Code Partial Convolution for Padding, Inpainting, and Image Synthesis Guilin Liu*, Aysegul Dundar*, Kevin J. Shih, Ting-Chun Wang, Fitsum A. Reda, Karan Sapra, Zhiding Yu, Xiaodong Yang, Andrew Tao, Bryan Catanzaro (*equal contribution) IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 2022 Paper Using Orthogonality of Weights for Improved Quantization in Deep Neural Networks Sukru Burc Eryilmaz, Aysegul Dundar IEEE Transactions on Neural Networks and Learning Systems (TNNLS) 2022 Paper Dual Contrastive Loss and Attention for GANs Ning Yu, Guilin Liu, Aysegul Dundar, Andrew Tao, Bryan Catanzaro, Larry Davis, and Mario Fritz IEEE International Conference on Computer Vision (ICCV) 2021 Paper View Generalization for Single Image Textured 3D Models Anand Bhattad, Aysegul Dundar, Guilin Liu, Andrew Tao, Bryan Catanzaro IEEE Conference on Computer Vision and Pattern Recognition (CVPR) 2021 Paper Web-page Unsupervised Disentanglement of Pose, Appearance and Background from Images and Videos Aysegul Dundar, Kevin J. Shih, Animesh Garg, Robert Pottorf, Andrew Tao, Bryan Catanzaro IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 2021 Paper Code Neural FFTs for Universal Texture Image Synthesis Morteza Mardani, Guilin Liu, Aysegul Dundar, Shiqiu Liu, Andrew Tao, Bryan Catanzaro Neural Information Processing Systems (NeurIPS) 2020 Paper Panoptic-based Image Synthesis Aysegul Dundar, Karan Sapra, Guilin Liu, Andrew Tao, Bryan Catanzaro IEEE Conference on Computer Vision and Pattern Recognition (CVPR) 2020 Paper Domain Stylization: A Fast Covariance Matching Framework towards Domain Adaptation Aysegul Dundar, Ming-Yu Liu, Zhiding Yu, Ting-Chun Wang, John Zedlewski, Jan Kautz IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 2020 Paper Unsupervised Video Interpolation Using Cycle Consistency Fitsum A Reda, Deqing Sun, Aysegul Dundar, Mohammad Shoeybi, Guilin Liu, Kevin J Shih, Andrew Tao, Jan Kautz, Bryan Catanzaro IEEE International Conference on Computer Vision (ICCV) 2019 Paper Code Patents: Domain stylization using a neural network model. US Patent 10,984,286 Computing architecture with concurrent programmable data co-processor. US Patent 9,858,220 Video interpolation using one or more neural networks. US Patent App. 16/559,312 Video prediction using one or more neural networks. US Patent App. 16/558,620 Fourier Transform-based Image Synthesis Using Neural Networks. US Patent App. 17/039,805 Disentanglement of Image Attributes Using a Neural Network. US Patent App. 17/678,666 Awards and Funding: \"Young Scientist Award\" (BAGEP) given by the Science Academy, 2024 EuroHPC AI and Data-Intensive Award, 2024 Received TÜBİTAK 3501 support, 2021 Awarded the Marie Skłodowska-Curie Individual Fellowship by the European Research Commission, 2020 1st place, Domain Adaptation for Semantic Segmentation Competition, WAD Challenge, CVPR 2018",
  "content_length": 7399,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:31"
}