{
  "name": "Azalea Raad",
  "homepage": "http://www.soundandcomplete.org",
  "status": "success",
  "content": "Dr. Azalea Raad - Homepage Dr. Azalea Raad Imperial College London About Me Research Group Publications Awards & Grants Talks Professional Activities Teaching Contact Me Dr. Azalea Raad I am a computer scientist and a Reader (associate professor) at the Department of Computing of Imperial College London, where I lead the Veritas Lab. I am also the co-director of the UK Research Institute on Verified, Trustworthy Software Systems. As of October 2021, I am a UKRI Future Leader Fellow. Between September 2020 and July 2022 I was additionally a consulting research scientist at Facebook, London. As of September 2022, I am also a research consultant at Bloomberg. My research is in the area of programming languages and verification, spanning several topics including non-volatile memory, persistency semantics, weak memory models, stateless model checking, program logics and bug detection tools and techniques. I am always eager to supervise enthusiastic candidates for PhD and Masters positions. If you are interested in programming languages theory, concurrency and formal methods, then get in touch with me! You can contact me on MyFirstName@imperial.ac.uk. For a list of my publications see here, Google Scholar or DBLP. You can access my curriculum vitae here. News Sep 2024 I have been promoted to Reader (Associate Professor)! Sep 2023 I will give an invited talk at TRENDS co-located with CONFEST 2023! Sep 2023 I will give an invited talk at YR-CONCUR co-located with CONFEST 2023! Aug 2023 I will serve on the ESOP 2024 program committee! Jul 2023 Our paper on Concurrent Adversarial Separation Logic has been accepted to CONCUR 2023! Jun 2023 I gave a keynote talk at the Federated Conference on Distributed Computing Techniques (DisCoTec) Jun 2023 I gave a keynote talk at the Mathematical Foundations of Programming Semantics (MFPS) May 2023 I gave an invited talk at the IRIS workshop! Apr 2023 I have been awarded an EPSRC research grant for Safe and Secure Remote Direct Memory Access! Mar 2023 Our paper on a framework for persistent programming has been accepted to PLDI 2023! Jan 2023 I've been appointed as the co-director of the UK Research Institute on Verified Trustworthy Software Systems (VeTSS)! Dec 2022 Our paper \"Finding Real Bugs in Big Programs with Incorrectness Logic\" received the SIGPLAN Distinguished Paper Award! Oct 2022 I have been awarded a Meta research gift as part of the Privacy Aware Program Analysis Request for Proposals! Oct 2022 I gave an invited talk at the Dependable and Secure Software Systems! Sep 2022 I have been promoted to Senior Lecturer (Associate Professor)! Jun 2022 Our Dagstuhl seminar proposal on Formal Methods for Persistent Programming has been accepted to take place in 2023! Apr 2022 Our paper \"View-Based Owicki-Gries Reasoning for Persistent x86-TSO\" is a winner of the ESOP 2022 Distinguished Artifact Award! Mar 2022 I had the honour to serve as the Imperial College Mace Bearer at the Faculty of Engineering Graduation, 2022! Mar 2022 I will serve on the program committee of POPL 2023! Feb 2022 Our paper \"Finding Real Bugs in Big Programs with Incorrectness Logic\" has been accepted to OOPSLA 2022! Jan 2022 Our paper \"View-Based Owicki-Gries Reasoning for Persistent x86-TSO\" has been accepted to ESOP 2022! Nov 2021 I will serve on the program committee of ICFP 2022! Oct 2021 I will serve on the program committee of CAV 2022! Sep 2021 Our paper on Concurrent Incorrectness Separation Logic has been accepted to POPL 2022! Sep 2021 Our paper on formalising the semantics of Intel-x86 memory types and non-temporal stores has been accepted to POPL 2022! Sep 2021 I have been awarded a UKRI Future Leaders Fellowship for my research into the future of persistent memory technology! Jun 2021 I will deliver a tutorial on memory persistency at PLDI 2021! May 2021 I have received the Imperial College President's Award for Outstanding Early Career Researcher! Feb 2021 Our paper on hardware persistency models has been accepted to PLDI 2021! Jan 2021 I will give a talk about our recent ISL work at the World Logic Day 2021! Nov 2020 Our Dagstuhl seminar proposal on Foundations of Persistent Programming has been accepted to take place in 2021! Oct 2020 Our paper on model checking persistency semantics has been accepted to POPL 2021! Jul 2020 Our persistent program logic (POG) paper has been accepted to OOPSLA 2020! May 2020 Our paper on transactional consistency has been accepted to ECOOP 2020! Apr 2020 Our paper on incorrectness separation logic (ISL) has been accepted to CAV 2020! Feb 2020 We have been awarded a VeTSS grant for our proposal on NVM Validation!",
  "content_length": 4650,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:32"
}