{
  "name": "Azer Bestavros",
  "homepage": "http://www.bu.edu/cs/azer-bestavros",
  "status": "success",
  "content": "BU Data Science Initiative takes off | Computer Science BU Data Science Initiative takes off By: conroynm January 9, 2015 Launched in the summer of 2014 by University Provost Jean Morrison, Boston University’s Data Science Initiative (DSI) seeks both to leverage BU’s existing strengths and further expand its capacity to compete and lead in the Big Data revolution. Data is the currency of discovery and innovation in almost every scientific and professional endeavor. At BU, data scientists have long been mining mountains of data to uncover new information and transform research methodologies in diverse disciplines — from health care and business to design and communications. Now, BU is growing its capacity to evolve the technologies and methodologies of data science itself. From engineering and mathematics to politics, business and the sciences, BU researchers are breaking important ground in their fields by merging disciplines and discovering new answers through the application of data science. At the core of DSI is an effort to recruit some of the world’s finest interdisciplinary faculty with proven track records in data science and strong potential for long-term impact at BU and beyond. Anchored at the Rafik B. Hariri Institute for Computing and Computational Science and Engineering and led by Computer Science Professor Azer Bestavros, the Initiative supports the hiring of a cohort of faculty members who will complement and expand BU’s footprint in data science research. As a hub for high-impact collaborative research that applies data-driven solutions to real-world problems, the Hariri Institute is exceptionally equipped to lead the expansion of BU’s data science capacity, in coordination with cognate academic departments and research centers. The Hariri Institute provides a unique environment and a common space that encourages DSI faculty to connect, cross disciplinary lines, and pursue game-changing research outside traditional departmental settings. [Read More] View all posts",
  "content_length": 2015,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:33"
}