{
  "name": "Azhar Ilyas",
  "homepage": "https://site.nyit.edu/bio/ailyas",
  "status": "success",
  "content": "Azhar Ilyas | New York Tech Staff & Faculty Directory Azhar Ilyas Associate Professor of College of Engineering & Computing Sciences; Electrical & Computer Engineering, College of Engineering & Computing Sciences Associate Professor; Electrical & Computer Engineering, College of Engineering & Computing Sciences Associate Professor; Computer Science, College of Engineering & Computing Sciences Education Credentials: Ph.D.Expertise: Biomedical Engineering, Nanoscience, and NanotechnologyJoined New York Tech: 2016 Azhar Ilyas is an assistant professor of electrical and computer engineering. Prior to joining New York Tech, he was a post-doctoral fellow at Texas A&M University in the Department of Biomedical Sciences. He received his Ph.D. in electrical engineering from the University of Texas at Arlington in 2013. His research experience and interests are in the general areas of biomedical engineering, nanoscience, and nanotechnology, with a particular focus towards their application in disease diagnostics and bone regeneration. In 2016, Ilyas came to New York Tech, where he established the Bio-Nanotechnology and Biomaterials (BNB) Laboratory. The research in this lab focuses on two major themes: 1) point-of-care disease diagnostics; and 2) osteoinductive materials for bone-implant systems. Because most diseases originate at molecular or cellular levels, nanotechnology can provide tools to investigate the presence at a very small scale of potentially fatal diseases like cancer. Ilyas and his students at the BNB Lab conduct research to design and develop novel micro/nanodevices to sense and characterize important biomarkers. Ilyas and his students work with nanofabricated and 3-D printed structural biomaterials to understand the role of biomaterial surface morphology and chemistry in cellular attachment, surface bioactivity, and gene expression. Biomaterial surface morphology also affects cellular functions and in-vivo tissue healing. Ilyas’s hope is to develop new micro/nanodevices that can sense and characterize biological entities, processes, and interactions that can be used for diagnostics and to measure the therapeutic effect. Such devices can have immediate and far-reaching impacts in medicine. Author of more than 50 peer-reviewed journal and conference papers, Ilyas is a member of the Institute of Electrical and Electronics Engineers (IEEE) and IEEE Engineering in Medicine and Biology Society (EMBS). He has served as a reviewer for government funding agencies and several prestigious journals including Nanoscale, Langmuir, Analyst, Nanoscale Research Letters, ACS Applied Materials and Interfaces, and Biosensors and Bioelectronics. He also serves on the Research & Development Policy Committee for IEEE-USA. Recent Projects/Research “Acquisition of a high-energy micro-computed tomography scanner for inter- and multi-disciplinary STEM research,” (Co-PI) funded by National Science Foundation (NSF-MRI), Award No. 1828305 ECCS-1337965, ($426,621.00), Oct. 1, 2018 – Sept. 30, 2021. “The Effects of a Siliconized Biodegradable 3D Scaffold on Osteoblast Behavior,” (PI) funded by New York Tech, Institutional Support for Research and Creativity ($9,981.00), Sept. 1, 2018 – Aug. 31, 2019. “Development of a 3D Bioprinter Utilizing the Dexter Robotic Framework,” (Co-PI) funded by New York Tech, Institutional Support for Research and Creativity ($10,000.00), Sept. 1, 2017 – Aug. 31, 2018. “Electro-mechanical system for controlled assembly of earplugs,” (PI) funded by Student-centered Assistive Technology Research Conducted under the NYSID CREATE Program ($1,000.00), Nov. 1, 2017 – Oct. 30, 2018. Recent Publications Sharma, R. Zhuang, M. Long, M. Pavlovic, Y. Kang, A. Ilyas, and W. Asghar, “Circulating tumor cell isolation, culture, and downstream molecular analysis,” Biotechnology Advances, vol. 36, no. 4, pp. 1063-1078 (2018). DOI: 10.1016/j.biotechadv.2018.03.007 G. Varanasi, A. Ilyas, M. Maginot, Ami Shah, W. A. Lanford, and P. B. Aswath, “Role of Hydrogen and Nitrogen on the Surface Chemical Structure of Bioactive Amorphous Silicon Oxynitride Films,” The Journal of Physical Chemistry B, vol. 121, no. 38, pp. 8991-9005 (2017). DOI: 10.1021/acs.jpcb.7b05885 Ilyas, T. Odatsu, A. Shah, F. Monte, H. K.W. Kim, P. Kramer, P. B. Aswath, and V. G. Varanasi, “Amorphous Silica: A New Antioxidant Role for Rapid Critical-Sized Bone Defect Healing,” Advanced HealthCare Materials, vol. 5, no. 17, pp. 2199-2213 (2016). DOI: 10.1002/adhm.201600203 Ali, A. Ilyas, L. Bui, B. Sayles, Y. Hur, S. M. Iqbal, and Y.-T. Kim, “Differentiating Metastatic and Non-metastatic Tumor Cells from their translocation through Solid-State Micropores,” Langmuir, vol. 32, no. 19, pp. 4924-4934 (2016). DOI: 10.1021/acs.langmuir.6b00016 Ilyas, N. V. Lavrik, H. K.-W. Kim, P. B. Aswath, and V. G. Varanasi, “Enhanced Interfacial Adhesion and Osteogenesis for Rapid “Bone-like” Biomineralization by PECVD-Based Silicon Oxynitride,” ACS Applied Materials & Interfaces, vol. 7, no. 28, pp. 15368-15379 (2015). DOI: 10.1021/acsami.5b03319 Ilyas, W. Asghar, Y.-T. Kim and S. M. Iqbal, “Parallel Recognition of Cancer Cells using Addressable Array of Solid-state Micropores,” Biosensors and Bioelectronics, vol. 62, pp. 343-349 (2014). DOI: 10.1016/j.bios.2014.06.048 Honors + Awards “Young Scientist Lecture Competition Award” at the 3rd NANAOSMAT USA Conference, 2016. “Postdoctoral Scholars Travel Award,” 2016. “Best Paper Award,” Research Scholars Competition, Texas A&M University, 2015. “N. M. Stelmakh Outstanding Student Research Award,” 2013. “Best Paper Award” at 5th IEEE/NIH 2011 Life Science Systems and Applications Workshop (LISSA’ 11), 2011. Courses Taught at New York Tech EENG 270: Introduction to Electronic Circuits EENG 780/482: Silicon Integrated Circuits Theory and Fabrication EENG 341: Signals and Systems EENG 860: Special Topics – Nano-Biotechnology EENG 489/491: Senior Design Project I and II Contact Information Email: ailyas@nyit.edu Phone: 516.686.7455 Office: Long Island, NY Website: Ilyas lab By continuing to use the website, you consent to analytics tracking per New York Tech's Privacy StatementAccept Cookies",
  "content_length": 6178,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:33"
}