{
  "name": "Aznul Qalid Md Sabri",
  "homepage": "https://umexpert.um.edu.my/aznulqalid",
  "status": "success",
  "content": "UMEXPERT - ASSOCIATE PROF. TS. DR. AZNUL QALID BIN MD SABRI ASSOCIATE PROF. TS. DR. AZNUL QALID BIN MD SABRI Department of Artificial Intelligence Faculty of Computer Science and Information Technology aznulqalidum.edu.my View CV View 1-Page CV Publons Scopus Link Biography Dr. Aznul Qalid Md Sabri currently holds the position of Associate Professor at the Department of Artificial Intelligence, Faculty of Computer Science & IT, Universiti Malaya. He was previously the Director of UM Centre of Innovation and Enterprise (UMCIE). In that role, he led a center that manages technology transfer, and the commercialization of research output for the entire of Universiti Malaya. Prior to that, he was appointed as the Head for the Department of Artificial Intelligence, Faculty of Computer Science and Information Technology (FCSIT), Universiti Malaya, Malaysia. During his tenure as the department head, he had led the establishment of Malaya AIR, which stands for the Malaya AI Research center. He is a graduate of the prestigious Erasmus Mundus Master in Vision and Robotics (ViBot), a Master program jointly coordinated by three different universities (University of Burgundy, France, University of Girona, Spain and Heriot-Watt University Edinburgh, United Kingdom). He then completed his Master's degree by performing a research internship program at the Commonwealth Scientific Research Organization (CSIRO) in Brisbane, Australia focusing on Medical Imaging. Next, he pursued his PhD on the topic of “Human Action Recognition” (completed with distinction, très honorable), under a program jointly offered by a well-known research institution in France, Mines de Douai (a research lab) and the reputable University of Picardie Jules Verne, Amiens, France. He is an active researcher in the field of Artificial Intelligence, having published in multiple international conferences as well as international journals. His main research interest is in the field of Computer Vision and Machine Learning especially the application of AI in Healthcare. Among the highlight of his research achievement is securing a bilateral collaboration with France through the Malaysia-France- Bilateral Research Collaboration 2021 (MATCH 2021)  grant. Through this grant, he is currently co-supervising a PhD student (with a French counterpart) that has published a paper on the usage of AI for emotion detection and estimation, that has potential usage for evaluating the emotional level of Autistic children. He is also active in research commercialization, having co-founded a UM spin-off company, Fylix Sdn. Bhd. (www.fylix.my). Fylix is an AI-based company that has delivered projects for government agencies such as the Malaysia Government Call Center (MyGCC) as well as large private corporations such as PETRONAS and the Employees Provident Fund (EPF) focusing on intelligent Chatbot solution as well as automating operations via AI. He is also instrumental in moving the faculty's business pod forward, FSKTM Technovations (https://technovations.com.my/), which has delivered multiple projects focused on system development as well as providing training and consultations for local and international companies such as Air Liquide, a French multi-national company. Hide Collaborator sitihafizah rosli_salleh amir rjry cswoo fidah zaily cochow sameem suresh yamani yasmin fazidah norisma zulkana abdullah maizatul noraniza norjihan misslaiha View all collaborators Statistics Publication Annual Publications by Category Publication WoS Indexed SCOPUS Indexed Book Chapter in Book Summary of Budget vs Expenditure per vote for all research grants Finance Budget Expenditure Latest Publications View All Article in Academic Journals Proceeding 2025 Emerging Trends in Graph Neural Networks for Traffic Flow Prediction: A Survey 2025 DynaKey-GNN: An efficient dynamic key-node multi-graph neural network for spatio-temporal traffic flow forecasting 2025 Revolutionizing colorectal cancer detection: A breakthrough in microbiome data analysis 2024 Autism classification and monitoring from predicted categorical and dimensional emotions of video features 2014 A Virtual Mid-Line Formation Approach for Maintaining Vehicle s On-Road Position 2014 Using Mutual Information to Construct Spatio Temporal Co-occurrence based Characterization for Human Action Classification 2013 Caract'erisation spatio-temporelle des co-occurrences par ACP `a noyau pour la classification des actions humaines 2013 Multi Spatio Temporal Co-occurrence Measures for Human Action Classification",
  "content_length": 4559,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:34"
}