{
  "name": "Azza Abouzied",
  "homepage": "https://azzaabouzied.com",
  "status": "success",
  "content": "Azza Abouzied Toggle theme Light Dark Auto Bootstrap AZZA ABOUZIED Associate Professor of Computer Science New York University Abu Dhabi azza@nyu.edu I lead ... the Human-Data Interaction Lab (HuDa) where we research tools for decision-making in groups, in uncertain environments, with AI, across different domains. We mix it up; here are our publications. I teach ... You can read more about my teaching philosophy here. Here are links to the latest editions of my courses. Operating Systems Database Systems Data Techruption I serve ... I'm Vice Provost of Faculty Advancement and Engagement. I co-chaired SIGMOD's 2025 program with Joe Hellerstein. I led NYUAD's faculty council in 2024. Pushing for the expansion of the global PhD fellowship program was one of our biggest wins! I mentor ... If you are a CS undergrad at NYUAD and would like to work on your capstone with me, please read this. For prospective PhD students, one-year research assistants or Post-Docs, please show your interest using this form. Note that funding opportunities are limited but there are openings every year. We will reach out when the stars align. My bio ... Azza Abouzied designs tools that help users make sense of and take decisions with data. Straddling two research fields, database systems and human computer interaction, she approaches tool-building from an interdisciplinary perspective tackling both scalability and usability challenges. Her earlier work explored example-driven techniques to help users query databases, extract data from documents and generate synthetic data. Recently, her focus has been on in-database support for prescriptive analytics in uncertain environments and examining the challenges of decision-makers in specific applications such as disinformation-mitigation, epidemic-planning, or group-booking, where data is limited or uncertain and collaborative-support is lacking. Azza Abouzied received her doctoral degree from Yale in 2013. She spent a year as a visiting scholar at UC Berkeley. She is also one of the co-founders of Hadapt – a Big Data analytics platform. In 2019, she received a VLDB test of time award. She has received best paper awards and honorable mentions for her publications in both database systems and HCI. The CV ... and more. I blog occasionally. I give talks. Here is one on decision-making and an older one on example-driven querying.",
  "content_length": 2383,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:34"
}