{
  "name": "Azzedine Boukerche",
  "homepage": "http://www.site.uottawa.ca/~boukerch",
  "status": "success",
  "content": "Azzedine Boukerche Dr. Azzedine Boukerche Full Professor Canada Research Chair in Large-Scale Distributed Interactive Simulations and Mobile Computing and Networking Director of PARADISE Research Laboratory SITE, University of Ottawa Co-Associate Director of OC-MISS Email: boukerch @ site.uottawa.ca ________________________ More News @SITE More News @Faculty of Engineering ________________________ 2008 Keynote Speaker at ISCC Workshop on Wireless Multimedia (Marrakesh), July 2008 2008 ICC Wireless Networking Symposium Best Research Paper Award , Beijing, May 2008 2008 Keynote Speaker at IPDPS/PMEO- Workshop on Pervasive and Mobile Systems (Florida), April 2008 2006 George S. Glinski Award for Excellence in Research, Univ. of Ottawa 2005 Ontario Early Researcher Award (11th Round) Premier's Research Excellence Award (PREA) 2004 Ontario Distinguished Researcher Award Email: boukerch@site.uottawa.ca Tel: (613) 562-5800 Ext. 6712 2008 Editor of Wiley, \"Algorithms and Protocols for Wireless Sensor Networks, 2008 Editor of Wiley, \"Algorithms and Protocols for Wireless and Mobile Ad Hoc Networks 2005 Editor of CRC/Chapman \"Handbook of Algorithms for Wireless Networking and Mobile Computing\", focuses on several aspects of mobile computing, particularly algorithmic methods and distributed computing with mobile communications capability. Including you Research Interests: Wireless Communication and Mobile Networking Sensor Networks Wireless and Mobile Ad hoc and Mesh Networks Wireless Multimedia QoS in Heterogeneous Wired and Wireless Networks Security: Ad hoc, Sensor and ubiquitous Networks Distributed and Mobile Computing Distributed and Mobile Systems Distributed Algorithms Large-Scale Distributed Interactive Simulation DoD High Level Architecture (HLA/RTI) Grid Based Distributed Simulation Parallel and Distributed Simulation Distributed and Collaborative Virtual Environments Projects Biography Teaching Publications Technical Contributions PARADISE Research Lab Team Decb. 2007-Present: Secretary: IEEE Technical Communication Society, On Ad Hoc and Sensor Networks Associate Editor: 2009-Present IEEE Communications Surveys & Tutorials 2008-Present Elsevier Ad Hoc Networks 2007-Present IEEE Transactions on Vehicular Technology 2007-Present Pervasive and Mobile Computing Journal, (Elsevier) 2007-Present Wiley journal: Security and Communication Networks 2007-Present IEEE Transactions on Parallel and Distributed Systems (TPDS) 2006-Present IEEE Wireless Communication Magazine 2003-Present ACM/Springer Wireless Networks Subject Area: Ad hoc and Sensor Networks, and Wireless Networks 2003-Present Int'l Journal of Wireless Communication and Mobile Computing, (Wiley) 2003-Present Journal of Parallel and Distributed Computing (JPDC), Elsevier (Subject Areas: Ad hoc & Sensor Networks and Mobile Computing) Distributed & Mobile Systems, and Distributed & Parallel Simulation) 2000-Present SCS Transactions on Modeling and Simulation General/Program Chair: Conferences & Events (Some of the events from 2005-2007 (In progress)) General Co-Chair: IEEE WoWMoM 2010: EEE International Symposium on a World of Wireless Mobile and Multimedia Networks June 14-19. 2010, Montreal, Canada Program Co-Chair: IEEE Globecom 2009: Ad Hoc and Sensor Networking Symposium - Nov. 30- Decemebr 4th, 2009, Honolulu, Hawaii, Program Co-Chair: 14th IEEE ISCC 2009: The IEEE International Conference on Computers and Communications July 5 - 8, 2009, Sousse, Tunisia Local Arrangement Chair: IEEE Conference on Local Computer Networks Montreal, October 14-17, 2008. Program Co-Chair: IEEE Globecom 2007: Ad Hoc and Sensor Networking Symposium - New Orleans, Nov. 30- Decemebr 4th, 2008. General Vice Chair: IEEE DCOSS 2007: The 3rd IEEE International Conference on Distributed Computing in Sensor Systems June 18-20, 2007, Santa Fe, New Mexico, USA Program Co-Chair: IEEE Globecom 2007: Ad Hoc and Sensor Networking Symposium - Washington, DC, Nov. 26-30, 2007. Program Co-Chair: Fourth Int'l Conference on Wireless and Optical Communications Networks July 2-4, 2007, Singapore Program Co-Chair: IEEE P2MNet 2007: Third IEEE International Workshop on Performance and Management of Wireless and Mobile Networks 15-18 October 2007, Dublin, Ireland Program Co-Chair: Second IEEE International Workshop on Performance and Management of Wireless and Mobile Networks Tampa, FL, Nov. 14-17, 2006. Program Co-Chair: Second ACM Workshop on QoS and Security for Wireless and Mobile Networks October 2-6, 2006 Torremolinos, (Malaga), Spain General Co-Chair: 8th ACM Symposium on Modeling, Analysis and Simulation of Wireless and Mobile Systems, October 10-13, 2005, Montreal (Canada) General Co-Chair: 9th IEEE/ACM Symposium on Distributed Simulation and Real-Time Applications October 10-12, 2005, Montreal (Canada) Program Co-Chair: 5th IEEE International Workshop on Algorithms for Wireless, Mobile Ad Hoc and Sensor Networks, Denver, (Jointly with IPDPS'05 Symposium, April 4-8) Program Co-Chair: IEEE International Workshop on Performance and Management of Wireless and Mobile Networks, Sydney, Australia, (jointly with IEEE LCN'05 Conference, November 15-17) Conferences & Events (2006 Only): (for a Full list Click Here) Technical Program Committee: IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks Niagara-Falls, Buffalo-NY, 26-29 June 2006 Technical Program Committee: 31st IEEE Local Computer Networks Conference. November 14-17, 2006, Tampa, FL. Technical Program Committee: 14th IEEE International Conference on Networks, Singapore, September 13-15, 2006. Technical Program Committee: 20th IEEE International Parallel & Distributed Processing Symposium April 25-29, 2006, Rhodes Island, Greece. Technical Program Committee: 20th ACM/IEEE/SCS Workshop on Advanced and Distributed Simulation (PADS 2006) May 23-26, 2006, Singapore. See Prof. Azzedine Boukerche's profile at See News Release- University of Ottawa at \"Canada's University\" See News Release- Ottawa Citizens at PARAllel, Distributed and Interactive Simulation of LargE scale Systems and Wireless and Mobile Networking Research Laboratory Prof. Azzedine Boukerche University of Ottawa School of Information Technology and Engineering(SITE) 800 King Edward Avenue Ottawa, Ontario, Canada, K1N 6N5 Tel: (613) 562-5800 ext. 6712 Fax: (613) 562-5664 Email: boukerch@site.uottawa.ca Contactez: L'École d'Ingénierie et de Technologie de l'Information Contact: School of Information Technology and Engineering Copyright © Université D'Ottawa / University Of Ottawa Webmestre / Webmaster",
  "content_length": 6585,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:36"
}