{
  "name": "B. Aditya Prakash",
  "homepage": "http://www.cc.gatech.edu/~badityap",
  "status": "success",
  "content": "B. Aditya Prakash, Professor at Georgia Tech COVID-19 Response PostDoc Ad About News Publications Talks Students Teaching Contact B. Aditya Prakash Professor and Associate Chair for Academic Affairs School of Computational Science and Engineering College of Computing Georgia Institute of Technology About Me I am the Associate Chair for Academic Affairs and a Professor at the School of CSE, College of Computing, Georgia Institute of Technology, Atlanta. I received a PhD in Computer Science from Carnegie Mellon University, Pittsburgh in 2012, and a BTech in Computer Science and Engineering from the Indian Institute of Technology - Bombay in 2007. Short third-person bio can be found HERE. My CV is here: PDF. Research Interests If you are interested in joining the group: Thank you for your interest. Please see this first. How do you forecast pandemics? How you do distribute resources to stop an outbreak as fast as possible? How do failures in power grids cascade? I am broadly interested in Data Science, Machine Learning and AI with emphasis on solving big-data problems in networks and sequences. Many of the research questions I answer deal with understanding and managing efficiently, dynamical mechanisms (like propagation) on networks, occurring across natural, social and technological systems. These include problems motivated from public health, computational epidemiology, cybersecurity, urban computing and the web. My research combines theoretical analysis of models, developing efficient algorithms and empirical studies on large scale data. My advisor at CMU was Prof. Christos Faloutsos. Earlier at IIT Bombay, my advisor was Prof. S. Sudarshan where I worked on Query Optimization. News Tweets by badityap Updates: Pinned: We are hiring, come join us! Several open positions for PhD students and postdocs in my group! Many impactful projects on ml+data science for networks+time-series (covid, hospital infections, campus mobility, energy grids etc). PhD: apply here. PostDocs: apply here. Fall 2022: Aditya is leading a new multi-institution NSF BEHIVE project for developing the science of pandemic prevention and prediction, with members from Georgia Tech, MIT, Michigan, Mayo Clinic and UGA. Fall 2022: Congrats to Alex and co-authors for winning a best paper award at the AI4ABM workshop at ICML 2022. January 2022: Gave a plenary keynote presentation/panel on Data Science and AI for disasters and resilency for the AI @ DOE roundtable. Slides here. December 2021: Congratulations to Alex on being named a 'Rising Star in Data Science'! December 2021: Interesting discussions in the AI in Healthcare roundtable for the Indo-US Science and Technology Forum (IUSSTF) AI Initiative. December 2021: Alex, Harsha and Aditya gave an invited workshop/tutorial for data-driven computational methods for disease forecasting by the Forecasting for Social Good Research Network to researchers and practitioners. November 2021: Talking at AI-ML Systems conference at IISc on the invited panel 'Machine Intelligence and the next pandemic: Are we ready?'. October 2021: Great speaking at the NSF Emerging Data Science Methods for BioMedical Data workshop in beautiful Augusta. October 2021: New paper at NeuRIPS on principled uncertainty quantification in time-series forecasting using gaussian process with deep sequential models. Congrats to all co-authors! August 2021: Congratulations to Aditya for winning a Facebook Faculty Award on Statistics for Improving Insights, Models, and Decisions (w/ Prof. Chao Zhang). August 2021: PhD student Alex Rodriguez with collaborators co-organized the 4th SIGKDD Epidemiology meets Data (epiDAMIK) workshop and it was a success. Aditya served on the steering committee. Stay tuned for videos. August 2021: Aditya gave a keynote talk (slides here) at the SIGKDD 2021 workshop on Mining and Learning with Time-Series (MiLeTS) workshop. July 2021: Congratulations on getting a new NSF IIS Medium grant on uncertainty quantification for time-series forecasting. June 2021: Aditya gave an invited talk at the 'Promise of Machine Learning in Responding to Pandemics' session at the Annual SER Symposium. May 2021: Aditya was a panelist at the AI in a Post COVID world symposium organized by Penn State. February 2021: Aditya is co-organizing the National PREVENT symposium on pandemic prevention and prediction, on behalf of multiple directorates of the NSF. Please join us and register at (or send Aditya an email). We have a terrific set of speakers and participants. January 2021: Two papers at AAAI 2021, on disease forecasting using deep learning/machine learning models. December 2020: Excited to announce our work (led by PhD student Alex Rodriguez) won 1st place (out of 35 global teams) in the COVID-19 Symptom Data Challenge (organized by Facebook/Catalyst Health/CMU) and 2nd place (out of 777 participants from 43 countries) in the C3AI COVID-19 Grand Challenge! Congratulations to all for this recognition! Spring 2020 2020: Our group is involved in many efforts as part of COVID-19 response. See our landing page here. Please contact us if you want to help! September 2020: Our COVID19 work and Aditya's comments were highlighted in articles in Nature Biotechnology and IEEE Spectrum. August 2020: We are hiring a PostDoc! Please see the advertisement and help spread the word. August 2020: Aditya will be teaching a new course 'CSE 8803: EPI: Data Science for Epidemiology' in Fall 2020. Lectures will be available online. August 2020: Aditya will be one of the Focus Area Chairs for the AAAI 2021 'AI for COVID-19' track. Please submit your best work! July 2020: Gave a talk on our COVID-19 forecasting work at the Global Pervasive Epidemiology Seminar Series. July 2020: New RAPID grant on adaptive surveillance. Thanks to the NSF for supporting this timely and pressing work! June 2020: Was great participating in the ML for COVID panel organized by Georgia Tech. Talked about our work in using machine learning for forecasting and surveillance. June 2020: Looking forward to leading a new NSF grant (collaborating with UVA and Iowa) on new data-driven methods for Hospital-Acquired-Infections. June 2020: New article from Georgia Tech covering our work on CDC COVID forecasting. We are also being covered by Fivethirtyeight.com May 2020: Thrilled to be organizing the epiDAMIK 3.0 full-day workshop at ACM SIGKDD 2020, the premier data science conference of the ACM, with colleagues from UVA, Georgetown, Harvard, UIowa and Google. Looking forward to great papers in this extremely timely and crucial area. Papers due June 15. Workshop is on Aug 24. May 2020: Congrats to all co-authors, for our AAMAS 2020 paper being selected as one of the 'best papers' of the conference for fast-track publication in JAAMAS. April 2020: Congratulations to Dr. Bijaya Adhikari, the newest PhD graduate from our group! Bijaya will join as a tenure-track Asst. Prof. in CS@Iowa in the Fall, after defending a terrific thesis on domain-based frameworks and embeddings for dynamics on networks. April 2020: Great to become a member of the modeling infectious diseases MIDAS network April 2020: Co-organizing the SDM 2020 workshop DRSE (Data Science for Retail and E-commerce) with colleagues from Home Depot, Snap, Google and IUPUI --- accepted papers are out! March 2020: Thanks to GT CoC for a nice welcome article, discussing some of our past and ongoing work. March 2020: Excited to be part of the new NSF CISE Expeditions project on Computational Epidemiology as a Co-PI! March 2020: New paper at ACM TIST, on explaining time-series segmentations, joint work with ORNL and VT. February 2020: New paper at AAMAS 2020 on designing near-optimal epidemic interventions, to get temporally sensitive policies. January 2020: Moved to Georgia Tech and joined the College of Computing --- looking forward to new adventures! Publications: Pre-prints and Peer-reviewed Disclaimer: All pdfs here are the author's version of the work. They are posted here by permission of ACM/IEEE/Springer for your personal use, not for re-distribution. The definitive version was published in the respective conference proceedings/journal issue. My DBLP entry (contains a subset of my publications) (in reverse chronological order) Peer-reviewed Journals, Conferences and Workshops AHA: Scalable Alternative History Analysis for Operational Timeseries Applications [PDF] Harshavardhan Kamarthi, Harshil Shah, Henry Milner, Sayan Sinha, Yan Li, B. Aditya Prakash, Vyas Sekar in ACM SIGKDD 2026, Jeju, Korea Automatically Surfacing Opportunities for Improvements In Internet-Scale Applications [PDF] Vipul Harsh, Sayan Sinha, Henry Milner, Haijie Wu, B. Aditya Prakash, Vyas Sekar and Hui Zhang in ACM HotNETS 2025, College Park DF2: Distribution-Free Decision-Focused Learning [PDF] Lingkai Kong, Wenhao Mu, Jiaming Cui, Yuchen Zhuang, B. Aditya Prakash, Bo Dai, Chao Zhang in Conference on Uncertainty in Artificial Intelligence (UAI) 2025, Rio de Janeiro. Performative Time-Series Forecasting [PDF] Zhiyuan Zhao, Haoxin Liu, Alexander Rodríguez and B. Aditya Prakash in ACM SIGKDD 2025, Toronto. EARTH: Epidemiology-Aware Neural ODE with Continuous Disease Transmission Graph [PDF] Guancheng Wan, Zewen Liu, Xiaojun Shan, Max SY Lau, B. Aditya Prakash, Wei Jin in ICML 2025, Vancouver. Identifying and forecasting importation and asymptomatic spreaders of multi-drug resistant organisms in hospital settings [PDF] Jiaming Cui, Jack Heavey, Eili Klein, Gregory R. Madden, Costi D. Sifri, Anil Vullikanti and B. Aditya Prakash in NPJ Digital Medicine 2025. A Picture is Worth A Thousand Numbers: Enabling LLMs Reason about Time Series via Visualization [PDF] Haoxin Liu, Chenghao Liu and B. Aditya Prakash in NAACL 2025, Albuquerque. Accurately Estimating Unreported Infections using Information Theory [PDF] Jiaming Cui, Arash Haddadan, A S M Ahsan Ul Haque, Bijaya Adhikari, Anil Vullikanti and B. Aditya Prakash in SIAM Data Mining (SDM) 2025, Alexandria. Large Pr",
  "content_length": 39352,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:38"
}