{
  "name": "B. David Saunders",
  "homepage": "https://www.eecis.udel.edu/~saunders",
  "status": "success",
  "content": "David Saunders' Home Page David Saunders I work on high performance exact linear algebra computation: algorithms and implementation: LinBox, a C++ template library for dense and sparse matrices over the integers and over finite rings,is found at github.com/linbox-team. Email: saunders@udel.edu Snail mail: Dept of Computer and Information Sciences / College of Engineering / University of Delaware / Newark / DE / 19716 Computer Algebra Research: Talk on {0,1}-matrices: the Four Russians and Mailman methods slides(pdf). A publication list, some brief abstracts, vitae(pdf). ACA, Conferences on Applications of Computer Algebra. PASCO, International Workshop on Parallel Symbolic Computation. ISSAC, International Symposium on Symbolic and Algebraic Computation. LinBox, a C++ template library for exact linear algebra. SIGSAM is the ACM Special Interest Group on Symbolic and Algebraic Manipulation. ILAS is the International Linear Algebra Society. Journal of Symbolic Computation. Student Activity Links: Programming contests, Annual ACM International Collegiate Programming Contests (and others). Competitive Programming Club, Beginning in March 2022, this club holds weekly meetings at 6pm Tuesdays in 102a Smith Hall to practice for programming contests such as the ACM ICPC listed above. ACM (no current link) is UDel's student chapter of the Association for Computing Machinery. CISGSA (no current link) is Computer Science Graduate Student Association. CISters A group of undergraduate, graduate, and faculty women in technology-driven fields at the University of Delaware LUG, the Linux Users Group. Upsilon Pi Epsilon (no current link for UD chapter) is the international honor society for the Computing Sciences. Misc. links My courses past. Clippings from the input stream, The Standard Template Library. Take a walk with the Wilmington Trail Club. Promote cycling in Newark with BikeNewark I study computationalgebraicomputation. ...You get the idea: something to do with computing and something to do with pushing mathematical symbols around. The words are run together to indicate the fact that the practice of algebra and of computing have much in common, the more so in the discipline called Computer Algebra. I am specifically interested in computational exact linear algebra, (matrix problems where the entries are integers and/or expressions in parameters and indeterminates and where exact, complete solutions are sought). To that end I care about anything it takes: algorithms, languages, machines, system design issues, parallel and distributed computing, .... B. David Saunders, Professor Emeritus, Department of Computer Science, University of Delaware",
  "content_length": 2680,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:38"
}