{
  "name": "Babak Salimi",
  "homepage": "https://bsalimi.github.io",
  "status": "success",
  "content": "Babak Salimi Home Research Publication Teaching Services Babak Salimi Assistant Professor, UCSD Contact Halıcıoğlu Data Science Institute Department of Computer Science and Engineering (Affiliate) University of California, San Diego E-mail: bsalimi@ucsd.edu Research Interest My research interests focus on advancing the field of trustworthy data analysis by fostering responsible data management practices. I am deeply passionate about data management, as I believe that having reliable, accessible, and well-organized data is crucial for establishing trust in data-driven decision-making. My research aims to create methods that promote transparency, fairness, reliability, and robustness in algorithmic decision-making processes. By adopting a data management-centric approach, I strive to develop tools and techniques that empower human decision-makers to interpret data more accurately and confidently. In my research group, we are committed to creating tools that support decision-makers from diverse backgrounds in understanding data and making more informed choices. Our goal is to enable better decision-making by bridging the gap between complex data and human understanding, ultimately fostering trust in data analysis. See details. I am actively seeking Ph.D. students interested in Data Management, particularly in areas such as Data Management for Machine Learning, Responsible Data Science, Data Cleaning and Debiasing, Data Integration, and Data-centric AI. It's worth noting that my research primarily gets published in top-tier venues like VLDB and SIGMOD. The research topics I focus on require a multifaceted skill set, including expertise in data management, machine learning, statistics, and optimization. If these areas align with your interests, I encourage you to carefully fill out this questionnaire. This is also applicable to undergraduate and master's students interested in joining our lab; please complete the questionnaire before reaching out. About me I am an Assistant Professor in the Halıcıoğlu Data Science Institute and affiliated with the Department of Computer Science and Engineering at University of California, San Diego. Before joining UCSD, I was a postdoctoral research associate at University of Washington and part of the UW Database Group, where I worked with Prof. Dan Suciu. I completed my Ph.D. in 2016 at Carleton University, advised by Prof. Leopoldo Bertossi. I have been honored with the following awards: NSF CAREER Award (2024) Research Highlight Award at SIGMOD (2020) Best Paper Award at SIGMOD (2019) Best Demonstration Paper Award at VLDB (2018) Postdoc Research Award at the University of Washington (2017)",
  "content_length": 2670,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:41"
}