{
  "name": "Badri Nath",
  "homepage": "http://www.cs.rutgers.edu/~badri",
  "status": "success",
  "content": "Badri Nath | Professor | ML/NLP lead at USHUR Badri NathProfessor All of Machine Learning is basically dot products Dr. Badri Nath is a Professor in the Department of Computer Science here at Rutgers University. Office : Core 320 Phone : 848-445-8320/848-445-0537 Email : badri@cs.rutgers.edu Website : htpp:/www.cs.rutgers.edu/~badri Education : Ph.D., Univ. of Massachusetts, Amherst Awards : Award papers: ACM SIGMOBILE TEST of TIME AWARD 2016,IEEE INFOCOM TEST of TIME AWARD 2015, VLDB 2002(ten-year best paper award), Excellence in teaching award (2010), HSPR 2003, Best paper award, Professor of the year award 1995. Research Awards: Outstanding Achievement in Research award (2016), UMASS, Amherst About Badri His research interests are in the area of machine learning for determining distributed systems health. Current projects explore research issues in adapting ML techniques for inferring health of large scale distributed systems. Education 1983-1989 Ph.D., Univ. of Massachusetts, Amherst My primary research interests are in the are of ML models to predict overall health of distributed systems. I am particularly interested in the area of prediction models for distributed systems performance. 0000-0000 Bangalore University BS,Electronics 0000-0000 Indian Institute of Science ME, Computer Science Teaching Current Course: CS 416:Operating Systems (FALL 2020) See what students have to say about the courses I have taught. Evaluation for the latest course: • CS552 Computer Networks (Spring 2018) Student Evaluation (2015) • CS352 Intro to Internet Technology (Fall 2014) Student Evaluation Previous year courses: • CS552 Computer Networks (FALL 2013) Student evaluations • CS552 Computer Networks (Spring 13) Student Evaluations • CS352 (Fall 2014) Student Evaluations • CS352 (Fall 2011) Student Evaluations • CS552 (Spring 11) Student evaluations • CS552 (Spring 10) Student evaluations CS 211, CS 553, CS352, CS552, CS519, CS416,CS111 Conferences In the Media Awards & Distinctions • Test of time award (SIGMOBILE) 2016 for the paper I-TCP: Indirect TCP for mobile hosts • UMASS, Amherst, Computer Science Department OAA Award for outstanding achievement in research, April 2016 • TEST OF TIME AWARD (INFOCOM 2015) for the paper APS using AOA published inInfocom 2003 • Pictures of the Award ceremony; Award, Award, Citation • 10 Year VLDB Best Paper Award (VLDB 2002) for the paper Querying in highly distributed mobile environments • Excellence in Teaching Award (2010). Awarded by CSGSS. • Professor of the year award for best teaching (1995) Awarded by CSGSS Recent Papers Paper to appear in Mobiquitous 2020. \"InsideOut: Model to Predict Outside CO Concentrations from Mobile CO Dosimeter Measurements Inside Vehicles\", Devarakonda, Srinivas; Chittaranjan, Senthil M ; Kwak, Daehan; Nath, Badri Current Research • Learning Distributed state from remote measurements • ML based techniques for performance inference Protocols Developed • APS (DV-hop) • I_TCP, M-RPC, MRSVP • Transformer tunnels Contact Contact me through the form below. If your message requires a response, I will get back to you at my earliest convenience. Name * Email * Subject Message * Send message Your message has been sent. Thank you! Sorry your message can not be sent.",
  "content_length": 3270,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:45"
}