{
  "name": "Badri Roysam",
  "homepage": "http://www.ee.uh.edu/faculty/roysam",
  "status": "success",
  "content": "Badri Roysam | UH Department of Electrical and Computer Engineering Skip to main content Faculty Dr. Badri Roysam, Fellow IEEE, Fellow AIMBE Hugh Roy and Lillie Cranz Cullen University Professor Office Location N325 Engineering Building 1 Phone 713-743-1773 Fax 713-743-4444 Email broysam [at] uh.edu Publications Education B.Tech., Electronics Engineering, Indian Institute of Technology, 1984 M.S., Electrical Engineering, Washington University in St. Louis, 1987 D.Sc., Electrical Engineering, Washington University in St. Louis, 1989 Professional Experience Professor and Chair of Electrical and Computer Engineering, University of Houston, 2010-Present Co-Director, Rensselaer Center for Open Source Computing, 2007-2010 Associate Editor, IEEE Transactions on Biomedical Engineering, 2006-Present Associate Editor, IEEE Transactions on Information Technology in Biomedicine, 2002-2010 Professor, Department of Electrical, Computer and Systems Engineering, Rensselaer Polytechnic Institute, Troy, NY., 2001-2010 Director, Center for Sub-Surface Sensing and Imaging Systems, a NSF Engineering Research Center Rensselaer component, 2001-2010 Adjunct Professor, Biomedical Engineering Department, Rensselaer Polytechnic Institute, Troy, NY., 1998-2010 Associate Professor with Tenure, Department of Electrical, Computer and Systems Engineering, Rensselaer Polytechnic Institute, Troy, NY., 1995-2001 Assistant Professor, Department of Electrical, Computer and Systems Engineering, Rensselaer Polytechnic Institute, Troy, NY., 1989-1995 Awards & Honors DIADEM Challenge, HHMI/NIH, September 2010 Collins Lecture, Harvard Medical School, Harvard University, September 2009 Questar III Excellence in K-12 Service, Rensselaer Polytechnic Institute, 2007 Engineering Research Excellence Award, Rensselaer Polytechnic Institute, 2005 Best Paper Award, IEEE Conference on Computer Vision and Pattern Recognition, 1999 Research Interests Biological image analysis; Signal Processing; Pattern Analysis; High-performance computing; Multiplex Computational Histology; Drug Discovery and Systems Biomedicine; Computational Methods for Cell-based Cancer Therapy. Funded Research Principal Investigator: Defense Advanced Research Agency Grant N66001-11-1-4015, “Multispectral 3-D Histology and Predictive Statistical technologies for Identifying the Critical Combination of factors Impacting Long-term Performance of Implanted Neuroprosthetics” Principal Investigator: NIH Biomedical Research Partnerships Grant R01 EB005157, titled “Multi-dimensional Image Analysis Tools for Brain Tissue Co-investigator: NIH Grant RO1 CA135509, “Genotype and phenotype predictors in therapy response in renal cell carcinoma” Co-investigator: NIH Grant R01 DK046943-14, \"GnRH Receptor Signaling Specificity\" Selected Publications Al-Kofahi Y, Lassoued W, Grama K, Nath SK, Zhu J, Oueslati R, Feldman M, Lee WM, Roysam B. Cell-based quantification of molecular biomarkers in histopathology specimens. Histopathology. 2011 Jul;59(1):40-54. Narayanaswamy A, Wang Y, Roysam B. 3-D image pre-processing algorithms for improved automated tracing of neuronal arbors. Neuroinformatics. 2011 Sep;9(2-3):219-31. Luisi J, Narayanaswamy A, Galbreath Z, Roysam B. The FARSIGHT trace editor: an open source tool for 3-D inspection and efficient pattern analysis aided editing of automated neuronal reconstructions. Neuroinformatics. 2011 Sep;9(2-3):305-15. Choi SG, Ruf-Zamojski F, Pincas H, Roysam B, Sealfon SC. Characterization of a MAPK scaffolding protein logic gate in gonadotropes. Mol Endocrinol. 2011 Jun;25(6):1027-39. Wang Y, Narayanaswamy A, Tsai CL, Roysam B. A broadly applicable 3-D neuron tracing method based on open-curve snake. Neuroinformatics. 2011 Sep;9(2-3):193-217. Tsai CL, Lister JP, Bjornsson CS, Smith K, Shain W, Barnes CA, Roysam B. Robust, globally consistent and fully automatic multi-image registration and montage synthesis for 3-D multi-channel images. J Microsc. 2011 Aug;243(2):154-71. Mukherjee A, Jenkins B, Fang C, Radke RJ, Banker G, Roysam B. Automated kymograph analysis for profiling axonal transport of secretory granules. Med Image Anal. 2011 Jun;15(3):354-67. Melichar HJ, Li O, Herzmark P, Padmanabhan RK, Oliaro J, Ludford-Menting MJ, Bousso P, Russell SM, Roysam B, Robey EA. Quantifying subcellular distribution of fluorescent fusion proteins in cells migrating within tissues. Immunol Cell Biol. 2011 May;89(4):549-57. Isse K, Grama K, Abbott IM, Lesniak A, Lunz JG, Lee WM, Specht S, Corbitt N, Mizuguchi Y, Roysam B, Demetris AJ. Adding value to liver (and allograft) biopsy evaluation using a combination of multiplex quantum dot immunostaining, high-resolution whole-slide digital imaging, and automated image analysis. Clin Liver Dis. 2010 Nov;14(4):669-85. Padfield D, Rittscher J, Roysam B. Coupled minimum-cost flow cell tracking for high-throughput quantitative analysis. Med Image Anal. 2011 Aug;15(4):650-68. Kokovay E, Goderie S, Wang Y, Lotz S, Lin G, Sun Y, Roysam B, Shen Q, Temple S. Adult SVZ lineage cells home to and leave the vascular niche via differential responses to SDF1/CXCR4 signaling. Cell Stem Cell. 2010 Aug 6;7(2):163-73. Seggio AM, Narayanaswamy A, Roysam B, Thompson DM. Self-aligned Schwann cell monolayers demonstrate an inherent ability to direct neurite outgrowth. J Neural Eng. 2010 Aug;7(4):046001. Narayanaswamy A, Dwarakapuram S, Bjornsson CS, Cutler BM, Shain W, Roysam B. Robust adaptive 3-D segmentation of vessel laminae from fluorescence confocal microscope images and parallel GPU implementation. IEEE Trans Med Imaging. 2010 Mar;29(3):583-97. Cohen AR, Gomes FL, Roysam B, Cayouette M. Computational prediction of neural progenitor cell fates. Nat Methods. 2010 Mar;7(3):213-8. Al-Kofahi Y, Lassoued W, Lee W, Roysam B. Improved automatic detection and segmentation of cell nuclei in histopathology images. IEEE Trans Biomed Eng. 2010 Apr;57(4):841-52. News Helping Pathologists Use New Technology to Identify and Classify Cancer Related Cells Mine Software Cancer Detection Tissue Analysis Gets Boost from Cross-Disciplinary Collaboration Software interprets 3-D confocal microscopy images Location Dept. of Electrical & Computer Engineering Engineering Building 1, Room N308 4226 Martin Luther King Boulevard Houston, TX 77204-4005 Phone: 713-743-4400 Fax: 713-743-4444 Department: ece [at] egr.uh.edu (ece[at]egr[dot]uh[dot]edu) Campus Map UH Parking & Routes Google Map About Message from the Chair UH Calendar Open Positions Giving Contact Us People Faculty Pathway Professors Staff Students Alumni Industry Advisory Board NSF Career Award Winners Research Faculty Expertise Laboratories & Facilities Centers and Consortia Seminars ECE Speaker Series Nano Speaker Series News Undergraduate Research Theses and Dissertations Industrial Relations Undergraduate General Information Degree Programs Accelerated Master's Program Accreditation Admissions Advising Advising FAQs Scholarships & Careers Academic/Professional Assistance Capstone Design Cadence Graduate Degree Programs Admission Guidelines Degree Requirements Admission Procedures Procedures Graduate Courses Graduate Calendar Forms Financial Aid & Related Info Fellowship Opportunities FAQs Online Graduate Degrees UH Graduate School Student Resources Resources Fellowship Opportunities Academic Forms Image Gallery Resources for Faculty & Staff Online Programs UH-Extend Online ECE Graduate Programs Online Programs at the Cullen College News News ECE Connections eNewsletters Other Publications",
  "content_length": 7518,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:45"
}