{
  "name": "Baek-Young Choi",
  "homepage": "http://umkc.academia.edu/baekyoungchoi",
  "status": "success",
  "content": "baek-young choi - University of Missouri Kansas City Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless baek-young choiUniversity of Missouri Kansas City, Computer Science, Faculty MemberaddFollowdoneFollowingFollowers16Following1Public ViewsRelated Authors G. Leedham Dimitrios MeletisUniversity of Vienna karun vermaThapar University, Patiala Jungpil ShinUniversity of Aizu Kavya ManoharDigital University Ryan WilliamsonUniversity of Reading Shashidhar JangiliIndian Institute of Science Ramakrishnan Angarai GanesanIndian Institute of Science Antonio BaroniUniversità degli Studi di Padova Stanley PortierInterests UploadsPapers by baek-young choiConstraints on handwriting Korean characters to improve the machine readabilityInternational Journal of Industrial Ergonomics, 2000Realizing the fact that the availability of a practical recognition system for Korean characters ... more Realizing the fact that the availability of a practical recognition system for Korean characters handwritten without any constraints is a long way to go, we try to find a set of writing constraints which improve the machine readability significantly. Based on our observation that the majority of the misrecognitions reported are caused by ambiguous characters, we developed a set of writing constraints which maximally disambiguate those characters. Through experiments, we confirmed that the recognition rate of those data handwritten by applying the proposed set of constraints could improve significantly. Also we found through experiments that the writing speed under those constraints could be increased and the number of writing errors could be reduced to a great extent after a small amount of training.arrow_back_iosarrow_forward_iosDownload Dynamic Hybrid Topology Design for Multicast in Constrained WDM NetworksHigh bandwidth one-to-many applications emerging in IP over WDM optical networks demand multicast... more High bandwidth one-to-many applications emerging in IP over WDM optical networks demand multicast support at WDM layer so that data signals would be efficiently duplicated inside network without O/E/O conversion. Multicast trees in an optical layer can be built with light-trees which use light-splitting technique. Most of recent studies have been focused to efficiently build and configure light-trees without existing unicast or multicast traffic into consideration. In this paper we consider the dynamic and optimal design problem of multicast configuration for realistic and constrained WDM networks. In such a network, both unicast and multicast are supported, and WDM switches have limited number of wavelengths and light splitting capability. On the other hand, the amount of bandwidth per wavelength is abundant. Using subwavelength sharing among traffic demands of unicast and multicast, we build a hybrid virtual topology which exploits both existing light-trees and light- paths. By optimizing WDM resources in addition to resource sharing with existing unicast and multicast demands, we truly maximize the WDM layer capability and efficiently support more multicast traffic demands. We validate the efficiency of our approach with extensive simulations. Observations on Cisco sampled NetFlowSigmetrics Performance Evaluation Review, 2005... necessity. The Sampled NetFlow [10] is Cisco router&#x27;s traffic measure-ment functionality... more ... necessity. The Sampled NetFlow [10] is Cisco router&#x27;s traffic measure-ment functionality with static packet sampling for high speed links. Since ... usage. The operational router of our study is a Cisco GSR 12000 series router. The ... On the Accuracy and Overhead of Cisco Sampled NetFlowTraffic measurement and monitoring are an important first step for network management and traffic... more Traffic measurement and monitoring are an important first step for network management and traffic engineering. With high-speed Internet backbone links, efficient and effective packet sampling are not only desirable, but also increasingly becoming a necessity. The Sampled NetFlow [10] is a Cisco router's traffic measurement functionality with static packet sampling for high speed links. Since the utility of sampling depends on the accuracy and economy of measurement, it is important to understand sampling error and measurement overhead. In this paper, we first discuss fundamental limitations of sampling techniques used in the Sampled NetFlow. We assess the accuracy of the Sampled NetFlow by comparing its output with complete packet traces [8] from an operational router. We also show the overheads involved in the Sampled NetFlow. We find that the Sampled NetFlow performs correctly without incurring dramatic overhead during our experiments. However, a care should be taken in its use, since the overhead is linearly proportional to the number of flows recored.arrow_back_iosarrow_forward_iosDownload Hybrid Topology for Multicast Support in Constrained WDM NetworksSupporting multicast at WDM layer is an important requirement for high bandwidth multicast applic... more Supporting multicast at WDM layer is an important requirement for high bandwidth multicast applications emerging in IP over WDM optical networks. Light-splitting technique has been proposed to provide light-trees, i.e., multicast trees in an optical layer. Many recent studies have been focused to efficiently build and configure light-trees without existing light-paths for unicast traffic into consideration. In this paper we identify and explore the optimal design problem of multicast configuration for realistic and constrained WDM networks. In such a network, both unicast and multicast are supported, and WDM switches have limited light splitting capability. Using wavelength sharing among traffic demands of unicast and multicast, we build a hybrid virtual topology which exploits both light-trees and light-paths. By optimizing WDM resources in addition to resource sharing with unicast, we truly maximize the WDM layer capability and efficiently support multicast traffic demands. We validate the efficiency of our approach with extensive simulations. Using RTT Variability for Adaptive Cross-Layer Approach to Multimedia Delivery in Heterogeneous NetworksIEEE Transactions on Multimedia, 2009A holistic approach should be made for a wider adoption of a cross-layer approach. A cross-layer ... more A holistic approach should be made for a wider adoption of a cross-layer approach. A cross-layer design on a wireless network assumed with a certain network condition, for instance, can have a limited usage in heterogeneous environments with diverse access network technologies and time varying network performance. The first step toward a cross-layer approach is an automatic detection of the NQAR: Network Quality Aware Routing in Error-Prone Wireless Sensor NetworksEurasip Journal on Wireless Communications and Networking, 2010We propose a network quality aware routing (NQAR) mechanism to provide an enabling method of the ... more We propose a network quality aware routing (NQAR) mechanism to provide an enabling method of the delay-sensitive data delivery over error-prone wireless sensor networks. Unlike the existing routing methods that select routes with the shortest arrival latency or the minimum hop count, the proposed scheme adaptively selects the route based on the network qualities including link errors and collisions with minimum additional complexity. It is designed to avoid the paths with potential noise and collision that may cause many non-deterministic backoffs and retransmissions. We propose a generic framework to select a minimum cost route that takes the packet loss rate and collision history into account. NQAR uses a data centric approach to estimate a single-hop delay based on processing time, propagation delay, packet loss rate, number of backoffs, and the retransmission timeout between two neighboring nodes. This enables a source node to choose the shortest expected end-to-end delay path to send a delay-sensitive data. The experiment results show that NQAR reduces the end-to-end transfer delay up to approximately 50% in comparison with the latency-based directed diffusion and the hop count-based directed diffusion under the error-prone network environments. Moreover, NQAR shows better performance than those routing methods in terms of jitter, reachability, and network lifetime.Download Hybrid Topology for Multicast Support in Constrained WDM NetworksSupporting multicast at WDM layer is an important requirement for high bandwidth multicast applic... more Supporting multicast at WDM layer is an important requirement for high bandwidth multicast applications emerging in IP over WDM optical networks. Light-splitting technique has been proposed to provide light-trees, i.e., multicast trees in an optical layer. Many recent studies have been focused to efficiently build and configure light-trees without existing light-paths for unicast traffic into consideration. In this paper we identify and explore the optimal design problem of multicast configuration for realistic and constrained WDM networks. In such a network, both unicast and multicast are supported, and WDM switches have limited light splitting capability. Using wavelength sharing among traffic demands of unicast and multicast, we build a hybrid virtual topology which exploits both light-trees and light-paths. By optimizing WDM resources in addition to resource sharing with unicast, we truly maximize the WDM layer capability and efficiently support multicast traffic demands. We validate the efficiency of our approach with extensive simulations. Analysis of point-to-point packet delay in an operational networkComputer Networks, 2007In this paper we perform a de",
  "content_length": 23357,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:43"
}