{
  "name": "Bahtijar Vogel",
  "homepage": "https://mau.se/en/persons/bahtijar.vogel",
  "status": "success",
  "content": "Bahtijar Vogel | Malmö University i Skip to main content Go to chat Cookies We use cookies on this website. Cookies help us deliver the best experience on our website. Read about cookies. Accept all Accept necessary Malmö University Student Web Library Staff Web På svenska Education Education Education Programmes and courses Applications and admissions Tuition fees Scholarships Exchange studies at Malmö University Study Guidance Housing Housing Housing Find housing in Malmö University Housing After admission After admission After admission Moving to Malmö Pre-orientation Arrival guide About studies at Malmö University About studies at Malmö University About studies at Malmö University Why choose Malmö University Understanding university studies Connect with our students On the page Research Research Research Doctoral studies Doctoral studies Doctoral studies Doctoral courses Doctoral schools Doctoral schools Doctoral schools Adaptation of urban space through sustainable regeneration ComBine Culturally Empowering Education through Language and Literature Education, Learning and Globalisation Finding ways in a time of great future challenges (FinnFram) Swedish National Graduate School in Science and Technology Education Research Learning in Multicultural Societal Contexts Pedagogy and Vocational Skills Relevancing Mathematics and Science Education (RelMaS) Sustainable Movement Education The National Research School for Professionals in Social Services Research subjects Research centres Research centres Research centres Biofilms Research Centre for Biointerfaces Citizen Health Imagining and Co-Creating Futures Institute for Urban Research Malmö Institute for Migration Studies Literacy and Inclusive Teaching Centre for Work Life Studies Sustainable Digitalisation Research Centre Centre for Sexology and Sexuality Studies Research publications Research publications Research publications Search publications Malmö University Press Research in focus Research in focus Research in focus Focus: In the classroom Focus: A future with AI Focus: Climate and society Focus: The mouth Focus: Migration Focus: The war in Ukraine Focus: Perspectives on Malmö Focus: Loneliness Focus: Peace, democracy and human rights Research events Participate in a research study Coffee Break Quiz On the page Collaboration and Innovation Collaboration and Innovation Collaboration and Innovation Levels of collaboration Levels of collaboration Levels of collaboration Local collaboration Regional collaboration National collaboration International collaboration Innovation Collaboration with students Collaborate with researchers Collaborate with researchers Collaborate with researchers Labs and facilities Culture collaboration Support Malmö University Alumni & Friends On the page About us About us About us Job opportunities Job opportunities Job opportunities Apartments for researchers Current vacancies Meet our staff Employee benefits HR Excellence in Research award EURAXESS Faculties and departments Faculties and departments Faculties and departments Faculty of Health and Society Faculty of Health and Society Faculty of Health and Society Department of Biomedical Science Department of Criminology Department of Social Work Department of Care Science Department of Police Work Faculty of Culture and Society Faculty of Culture and Society Faculty of Culture and Society Department of Global Political Studies School of Arts and Communication Department of Urban Studies Faculty of Education and Society Faculty of Education and Society Faculty of Education and Society Department of Childhood, Education and Society Department of Sports Sciences Department of Culture, Languages and Media Department of Natural Science, Mathematics and Society Department of Society, Culture and Identity Department of School Development and Leadership Faculty of Technology and Society Faculty of Technology and Society Faculty of Technology and Society Department of Computer Science and Media Technology Department of Materials Science and Applied Mathematics Faculty of Odontology Faculty of Odontology Faculty of Odontology Master's programmes in Dental Science University Dental Clinic Find and contact Malmö University Find and contact Malmö University Find and contact Malmö University Visit Malmö University News and press News and press News and press Graphic manual Map of the buildings (Google Maps) Merchandise Supplier information and invoice management Whistleblowing Management and decision-making paths Malmö University's strategy 2030 Malmö University's strategy 2030 Malmö University's strategy 2030 Global engagement Sustainability Widened recruitment and participation Quality assurance work at the University Malmö Academic Choir and Orchestra Malmö Academic Choir and Orchestra Malmö Academic Choir and Orchestra Student work – video pieces Annual Academic Celebration Annual Academic Celebration Annual Academic Celebration Academic traditions Meet our new professors Meet our new doctors Honorary doctors The University in a troubled world On the page På svenska På svenska Menu Search Search Search ﻿ Bahtijar Vogel Head of department/Senior lecturer/Associate Professor bahtijar.vogel@mau.se +46 40 665 70 12 orcid.org/0000-0001-6708-5983 Employed at Faculty of Technology and Society Department of Computer Science and Media Technology Research subject Computer Sciences Software Engineering Presentation I'm an Associate Professor, Head of Department of Computer Science and Media Technology, Faculty of Technology and Society, Malmö University. I hold a PhD in Computer Science from Linnaeus University. My research focuses on software engineering and architecture within the domains of the Internet of Things (IoT), digitalization, and AI-driven Learning Technologies. It centers on the development of open architecture concepts that enable the deployment of adaptable, intelligent, and user-friendly systems across diverse application domains and operational contexts, especially in dynamic and evolving environments. The aim of these open architectures is to foster transparency and interoperability through the use of open-source components, standardized open data formats, and collaborative open innovation. By integrating digitalization and artificial intelligence, the research seeks to enhance system responsiveness, scalability, and personalization, ultimately contributing to more efficient and inclusive technological ecosystems. I'm a theme leader of Education and Lifelong Learning within the Sustainable Digitalization Research Centre (SDRC) at Malmö University. We research the use of digital tools to facilitate lifelong learning in different contexts, including both professional and informal learning in different sectors of society. I teach within the Applied Data Science master's program. Previously was teaching in the areas of web and mobile development, cross-platform mobile development, testing web and mobile applications, agile development practices, architectures, etc. I also worked in industry as an IT architect consultant, software engineer and software developer for a couple of years. Research Interests: Digitalization and AI, IoT, Open Architectures, Software Engineering, User Design, Security, Learning Technologies Publications 2025 | Conference paper Designing Education for the AI Era: Principles for Integrating LLMs in Pedagogy Alberto Biscalchin, Arezoo Sarkheyli-Hägele, Jeanette Eriksson, Bahtijar Vogel 2024 | Conference paper Conceptual Design of Multimodal Learning Analytics for Spoken Language Acquisition Hamza Ouhaichi, Daniel Spikol, Zaibei Li, Bahtijar Vogel 2024 | Conference paper A SYSTEMATIC REVIEW OF MULTIMODAL LEARNING ANALYTICS DESIGN MODELS AND FRAMEWORKS Hamza Ouhaichi, Daniel Spikol, Bahtijar Vogel 2024 | Conference paper Analytics in Glocal Classrooms: Integrating Multimodal Learning Analytics in a Smart Learning Environment Hamza Ouhaichi, Daniel Spikol, Bahtijar Vogel, Zaibei Li 2024 | Conference paper Learning Swedish with AI: Exploring Multimodal Learning Analytics in Spoken Language Acquisition Hamza Ouhaichi, Daniel Spikol, Bahtijar Vogel See all Publications in Diva Research Projects You can find previous research projects in the Diva database. Previous research projects in Diva My research environments Sustainable Digitalisation Research Centre The research centre studies both social and technological aspects to promote sustainable digitalisation. The aim is to... Back to top",
  "content_length": 8495,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:51"
}