{
  "name": "Bai Xue 0001",
  "homepage": "https://lcs.ios.ac.cn/~xuebai/index.html",
  "status": "success",
  "content": "Prof. Bai Xue - Institute of Software, CAS About I am a professor at the Key Laboratory of System Software, Institute of Software, Chinese Academy of Sciences since September 2021. In September 2024, I was appointed Deputy Director of the Key Laboratory of System Software. I received my B.Sc. degree from Tianjin University of Technology and Education in 2008, and Ph.D. degree from Beihang University in 2014. Before joining the Institute of Software as an Associate Research Professor in November 2017, I worked as a Research Fellow at the Centre for High Performance Embedded Systems, Nanyang Technological University (May 2014 – September 2015), and as a Postdoctoral Researcher in the Department für Informatik, Carl von Ossietzky Universität Oldenburg (November 2015 – October 2017). Research Interests Verification and control of cyber-physical systems Safe reinforcement learning Control theory Formal methods Recent News Nov 08, 2025 Our paper 'Efficient Verification and Falsification of ReLU Neural Barrier Certificates' was accepted by AAAI-26! Oct 15, 2025 Our paper 'Finite-time Safety and Reach-avoid Verification of Stochastic Discrete-time Systems' was accepted by Information and Computation! Publications Equation Relaxation-based Methods: Barrier-like condition construction for system verification Set-boundary Propagation: Reachability analysis PAC Learning-driven Methods: Probably Approximately Correct learning for system analysis View All Publications Research Team Current Members Taoran Wu (PhD student) Yiling Xue (PhD student) Dejin Ren (PhD student) Zhipeng Cao (PhD student) Jingduo Pan (Master student) Wei Li (Master student) Haoyang Cao (Master student) Alumni Shengchao He (Post-doc) Chenyu Wu (JD.com) Yonghan Li (Huawei) Shuyuan Zhang (UCLouvain) Changyuan Zhao (NTU Singapore) Jianqiang Ding (Aalto University) Professional Activities Current Committees HSCC/ICCPS 2026 - PC Member CAV 2026 - PC Member IEEE ITSC 2025 - Associate Editor ICCPS 2025 - PC Member HSCC 2025 - PC Member Recent Committees IEEE ITSC 2024 - Associate Editor RTCSA 2024 - PC Member ATVA 2024 - PC Member HSCC 2024 - PC Member AAAI 2024 - PC Member HSCC 2023 - PC Member Teaching Reinforcement Learning School of Intelligence and Technology, HIAS, University of Chinese Academy of Sciences Offered: Autumn 2022, Autumn 2023, Spring 2024, Spring 2025 Foundational Academic Skills Development Seminars University of Chinese Academy of Sciences Offered: Autumn 2024 Contact Office Room 215, Building 5 Institute of Software, CAS No. 4, South Fourth Street Zhong Guan Cun, Beijing 100190 Contact Email: xuebai@ios.ac.cn Phone: +86-10-6266-1624 Homepage: people.ucas.ac.cn/~xuebai",
  "content_length": 2695,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:45"
}