{
  "name": "Baihua Li",
  "homepage": "https://www.lboro.ac.uk/departments/compsci/staff/academic-teaching/baihua-li",
  "status": "success",
  "content": "Baihua Li | Computer Science | Loughborough University Professor Baihua Li Professor of Computer Vision and Machine Learning Research groups and centres Publications Google Scholar +44 (0) 1509 222 672 Send email Office: N.3.29 (Haslegrave Building) Biography Research grants PDRA/PhD Teaching/Admin Press and External Activities About me I am a Professor in AI, Computer Vision and Machine Learning in the Department of Computer Science, Loughborough University. I am a key member of Centre for Sensing and Imaging Science, and Vision, AI, Autonomous and Human Centred Systems Research Group.  I  received a PhD degree in Computer Science from Aberystwyth University, and MSc and BSc degrees in Electronic Engineering from Tianjin University, China (one of the top 15 universities in China). Research expertise I have over 15-year research track record in AI, computer vision, machine learning, pattern recognition and signal/image processing. Primary research topics include: Artificial Intelligence Computer vision and pattern recognition Machine learning and deep learning Image and signal processing Human-computer interaction Computer graphics, virtual reality and visualization technology Publications More than 90 papers have been published in high impact journals and conferences. such as publications in recent years in the most prestigious scientific journals in my research area: IEEE Trans. on Cybernetics, IEEE Trans. Industrial Informatics, IEEE Trans. Image Processing, IEEE Trans. System, Man, Cybernetics, IEEE Trans. Biomed Eng.,  Pattern Recognition, Information Sciences, and IEEE Journal of Biomedical and Health Informatics.  Selected publications Enterprise, Knowledge Transfer & Impact My research emphasizes innovations and novel applications of AI, computer vision, machine learning, pattern recognition and deep learning techniques for human motion analysis, robotics, HCI, surveillance, ambient assisted living, machine vision, intelligent systems, big data, IoT and sensor data fusion. I work with industry on a number of projects funded by Innovate UK, Newton Fund and KTP etc. My research has been widely reported by media, including New Scientist, AI Business, Engineering & Technology, Interesting Engineering, etc. My expertise in human motion tracking and activity recognition leads to the commercial product \"Dance UK\", and reported by BBC, S4C on TV evening news, Independent, Western Mail, Cambrian News, Dailypost and Aber News). The current football project funded by the Innovate UK leads to prestigious MSDUK Innovation Challenge Award under category Industry 4.0 in 2019. The research has generated and will continually produce social and economic impact. Grants I have a proven track record of attracting external funding. I contributed to a number of projects funded by EPSRC, Innovate UK, Newton, NHS, TSB and industry. In the last 3 years, I have successfully secured over £1.4M external funding in total (to Loughborough Univ.). These grants are mainly from Innovate UK, Newton Fund, EPSRC, KTP, NHS and a wide range of industry. Ongoing external grants are over £1.2M (PI & CoI). I lead the research team of 6 PDRAs and 7+ PhDs. Recent funding obtained includes AI and bio-sensors for sleep breathing disorder diagnosis and rehabilitation (£540k), food manufacturing automation (£204K), AI for risk modelling in commodity supply chain (£206k), Automated Football Action Event Detection (IUK, total £359K), Air Quality Monitoring (Newton, total £470K), Agricultural Robot (IUK, £388K; Total £500k), Biofeedback for Amputee Gait\" (EPSRC National Productivity Investment Fund, £78K), four EPSRC PhD CDT-EI projects sponsored by industry(£450K), Upper Limb MSK Rehabilitation funded NHS England Regional Innovation Fund (total £130K). These projects aim to develop novel algorithms and technology in AI, computer vision, machine learning, deep learning, robotics and intelligent systems. The developed technology will help to solve a number of theoretical and industrial challenges in real-world applications, e.g. machine understanding of human activity and behaviours, human movement analysis in sports, manufacturing automation, autonomous underwater vehicles, HCI, AI-assisted diagnosis and rehabilitation in healthcare, biofeedback and myoelectric control, agricultural robots, ambient intelligence, surveillance, sentiment analysis, business analysis, assistive living and digital document analysis etc. Research Topics Human motion analysis Vision-based human and object detection and tracking Gesture and activity recognition Visual and wearable sensors Machine understanding of human behaviours Autonomous underwater robots Movement intention and musculoskeletal function analysis Driverless vehicles Embedded AI systems Machine vision and applications Robotics and autonomous systems Medical image processing Data-driven computer-aided disease diagnosis Data science, big data and data mining Intelligent systems Multi-modal sensor data fusion and IoT Research Application Sports science Healthcare Industry 4.0 Environmental protection Finance Agriculture Food manufacturing industry Biomechanics Research grants AI-driven Talent Scouting: Revolutionizing Automated Football Player Performance Assessment. IUK, £279K. 2024~2027. Airbridge – Integrated last-mile drone-based automation solution for health and medical services. £1.6m  2025 ~2028. Self-Learning Digital Twins for Sustainable Land Management. UKRI/EPSRC, £2.5M, CoI/LU PI, 2023~ 2025. Press release AI-embedded railway passenger counting and information system. IUK, £487K. 2023~2026. Autonomous building environment mapping. PhD studentship sponsored by Willis Towers Watson, 2022~2025. Trustworthiness of AI by Improving Adversarial Robustness for Autonomous Systems. Industry-sponsored PhD studentship. 2023~2026 Quality assurance system for real-time monitoring of food processing quality on automated production lines. IUK/KTP,£250K. 2022~2025. AI technology and automated inspector for the discovery of new generation safe and effective herbicides. £186K, 2022~2024. Improving Livestock Welfare and Reducing Carbon Emissions. National Bovine Data Centre and Cattle Information Service, £67K, 2022~2025. Sensory and vision systems for food manufacturing automation. £204K, IUK Knowledge Transfer. 2020-2022. Project website Engineering & Technology Towards an Automated Sports Performance Improvement. High Education Innovation Fund, £84k, 2021. AI-based capability to automate the extraction of data from documents processed by the financial services community. £146K. KTP. 2020 ~ 2021. Project website Robotics & Automation InkTracer PPR – Closing The Gap Between Analogue/Digital Handwriting Through Pen-Path Recovery. High Education Innovation Fund EPG. £31K, 2021~2022. Connected and intelligent device for personalised diagnostic, treatment and management of sleep breathing disorders. SnooZeal-Connect. £540k.  Innovate UK. 2019~2021. AI and machine learning technology for credit modelling in commodity supply chain. Innovate UK, £205K, 2019 ~ 2021. Automated football action event detection. Innovate UK, £359K. 2019~2020. Project website AI Business \"InkTracer - Closing the Gap Between Analog and Digital Handwriting to Enable New Products\". Innovate UK, £223K. 2019 ~ 2020. \"Triple-Network Air Quality Monitoring and Carbon Credit Trading Platform for Sustainable Urban Environments\". Newton Fund £349K. 2018 ~2020. Project website NewScientist \"Building embedded intelligence for autonomous underwater vehicle\", £40k, EPSRC CDT-EI. Sept. 2018 ~ Aug. 2022. \"Deep Learning for vision-based football player performance analysis”, EPSRC and industry-sponsored PhD project. Sept. 2018 ~ Aug. 2022. \"Remote Monitoring and Shared Decision Making for Upper Limb MSK Conditions Using MS Kinect\", NHS England Regional Innovation Fund, £130k. 2015 ~ 2017. \"Hand-drawn Document Cognitive Systems\", EPSRC and industry-sponsored PhD studentship. April 2018 ~ March 2022. \"AgriRobot: Autonomous Agricultural Robot System for Precision Spraying\", Innovate UK, £500k. 2018 ~ 2020. Project website \"InkTracer - Closing the Gap Between Analog and Digital Handwriting to Enable New Products\". Innovate UK £223K. 2018 ~ 2020. \"EMG-based Biofeedback to Improve Amputee Gait\", EPSRC National Productivity Investment Fund. CoI, £78,434. Oct. 2017 ~Sept. 2021. \"Supper Resolution Videos from High Resolution\", £40K, EPSRC and ARM sponsored PhD project. July 2016 ~ June 2020. \"Developing Intelligent and Interactive HVAC Pipe Network\", Tata sponsored (£13k) PhD studentship, 2017~ 2021. \"Virtual Reality Gaming to Improve Motor Control in Autism\", MIMIT-Manchester Integrating Medicine and Innovative Technology.  Co-I, £24k. 2014 ~2015. \"A Face Mask for Real-time Facial Motion Capture\", Technology Strategy Board, £20k. 2009 ~2010. \"Automatic Detection of Features in Retinal Images to Improve Diagnosis of Eye Diseases\", EPSRC, Co-supervision, £90k. Sept. 2012 ~ Aug. 2015. \"Dance: UK\"- a commercial game product was developed by this knowledge transfer project, Baihua Li (RA), Funder: Broadsword Interactive Ltd. The project has been widely reported by media, e.g. BBC, Independent, S4C, etc. 2003 ~ 2004. Self-Learning Digital Twins for Sustainable Land Management (£2.5M, CoI), £406K (LU PI).  We collaborate with our partners focusing on GHG emission reduction from livestock farming and land use by developing AI and digital twin technology. 2023~ 2025. AI-embedded railway passenger counting and information system. IUK, £487K. 2023~2026. Patterner with TrainFX Autonomous building environment mapping. PhD studentship sponsored by Willis Towers Watson , 2022~2025. Trustworthiness of AI by Improving Adversarial Robustness for Autonomous Systems. PhD studentship sponsored by Willis Towers Watson. 2023~2026. Please contact me for available PDRA and PhD opportunities PDRA/PhD recruitment We are looking for postdoctoral Research Associates and PhD students in AI, computer v",
  "content_length": 23709,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:46"
}