{
  "name": "Baile Chen",
  "homepage": "https://faculty.sist.shanghaitech.edu.cn/faculty/chenbl/#about",
  "status": "success",
  "content": "Optoelectronic Devices Group Dr. Baile Chen Associate Professor ShanghaiTech University Biography Professor. Baile Chen received his B.S degree in physics from the Department of Modern Physics at the University of Science and Technology of China in Hefei, China, in 2007. He received his Master degree in physics and Ph.D degree in electrical engineering both from the University of Virginia, Charlottesville, VA, USA in 2009 and 2013, respectively. After finishing his Ph.D, he was employed by Qorvo Inc (formerly Triquint Semiconductor) in Oregon as an RF product development engineer, where he worked on various RF power amplifiers and BAW filters for RF wireless communication systems. In January 2016, he joined the School of Information Science and Technology at ShanghaiTech University, where he is currently a tenured associate professor. He is a senior member of IEEE. His research interests include III-V semiconductor materials and devices, SWIR/MWIR photodiodes, Ultra-high-speed Photodiodes/High Power Photodiodes, Ultra-compact Spectrometers, and silicon photonics. He is the first author or corresponding author of more than 60 peer-reviewed journal papers, such as Nature Communications, Optica, ACS Photonics, ACS Nano, IEEE Journal of Lightwave Technology, IEEE Journal of Selected Topics in Quantum Electronics, IEEE Transactions on Electron Devices, Applied Physics Letters, Optics Letters, Optics Express, etc. Interests III-V Semiconductor Materials and Devices Ultra-high-speed Photodiodes/High Power Photodiodes Ultra-compact Spectrometers SWIR/MWIR Photodiodes Silicon Photonics Education PhD in Electrical Engineering, 2013 University of Virginia, Charlottesville, VA, USA Master in Physics, 2009 University of Virginia, Charlottesville, VA, USA BS in Physics, 2007 University of Science and Technology of China in Hefei, China Research High speed SWIR/MWIR photodiodes High-speed short-wavelength infrared (SWIR)/mid-wavelength infrared (MWIR) have a wide range of applications in emerging areas such as free-space communications, 2 Âµm optics fiber communication, dual-frequency comb spectroscopy, chemical sensing, and LIDAR. Our group works on InP based on InGaAs/GaAsSb type-II superlattice for high-speed SWIR photodiodes applications, which enjoys the mature process technologies developed by InP-based fiber optics communications. In the MWIR region, our group mainly focuses on the InAs/InAsSb and InAs/GaSb type-II superlattice for high-speed MWIR detection. High speed, high power photodiodes The recent explosive growth in communications has been brought about by fiber optic and wireless communications technologies. These two technologies have merged to create an interdisciplinary area called microwave photonics, including RF optical links, oscillators, and radar. The research in the Optoelectronic Devices Group at ShanghaiTech University focuses on developing optoelectronic components and technologies that enable new applications and advances in microwave photonic systems. One of the critical devices for signal generation in microwave photonic systems is the high-speed, high-power photodiode. Our work includes developing state-of-the-art Silicon-based, InP-based high-speed, high-power photodetectors and arrays. Monolithic integration of III-V devices on silicon The vast majority of research on silicon photonics has focused on devices operating within near-infrared (NIR) telecommunication bands from 1310 nm to 1550 nm wavelength. It was driven by the low-cost photonics fabricated with existing complementary metal-oxide-semiconductor (CMOS) infrastructure and the large market for telecommunications with the ever-increasing demands. Our group works on the monolithic integration of III-V MWIR photonic devices on Silicon. These technologies can offer potentially high performance, high yield, and low-cost products, significantly reshaping the current mid-infrared market. Recent Publications Journals (# co-first authors, * corresponding authors): J90. Jingyi Wang#, Beibei Pan#, Zi Wang#, Jiakai Zhang, Zhiqi Zhou, Lu Yao, Yanan Wu, Wuwei Ren, Jianyu Wang, Haiming Ji, Jingyi Yu*, Baile Chen*, âSingle-pixel p-graded-n junction spectrometersâ, Nature Communications 15 (1), 1773, 2024 J89. Zhijian Shen#, Jinshan Yao#, Jian Huang, Zhecheng Dai, Luyu Wang, Fengyu Liu, Xinbo Zou, Bo Peng, Weimin Liu, Hong Lu*, Baile Chen*ï¼ âHigh-Speed Mid-Wave Infrared Uni-Traveling Carrier Photodetector with Inductive Peaked Dewar Packagingâï¼Journal of Lightwave Technology 42 (5), 1504-1510, 2024 J88. Haolan Qu, Wei Huang, Yu Zhang, Jin Sui, Jiaxiang Chen, Baile Chen, David Wei Zhang, Yuangang Wang, Yuanjie Lv, Zhihong Feng, Xinbo Zou, âReliable electrical performance of Î²-Ga2O3 Schottky barrier diode at cryogenic temperaturesâ, Journal of Vacuum Science & Technology A 42 (2), 2024 J87. S Yu, H Kang, X Shen, Y Xue, W Wan, C Zou, B Chen, J Lu, âPoling-assisted hydrofluoric acid wet etching of thin-film lithium niobateâ, Optics Letters 49 (4), 854-857, 2024 J86. Jingyi Wang, Huachen Ge, Yue Liao, Daqi Shen, Linze Li, Mengxin Zha, Tianyu Long, Qiushi Chen, Zhiyang Xie, Haiming Ji, Pengfei Tian*, Baile Chen*, âInGaP/AlGaAs Near-UV and Visible Avalanche Photodiodes for Li-Fi Applicationâ, IEEE Photonics Technology Letters 2024 Vol. 36 Issue 5 Pages 293-296 J85. W. Wang#, J. Yao#, L. Li, H. Ge, L. Wang, L. Zhu, Q. Chen, H. Lu*, and Baile Chen*, âHigh-speed InAlAs digital alloy avalanche photodiode,â Applied Physics Letters, vol. 123, no. 19, pp. 191102, 2023. J84. H. Xie, H. Guo, L. Zhu, L. Yang, C. Shen, B. Chen, L. Chen, and L. He, âStudy on high gain-bandwidth product HgCdTe MWIR electron avalanche photodiodes,â Infrared Physics & Technology, vol. 135, pp. 104994, 2023. J83. Y. Zhang, Y. Gu, J. Chen, Y. Zhu, B. Chen, H. Jiang, K. M. Lau, and X. Zou, âSmall Vth Shift and Low Dynamic Ron in GaN MOSHEMT With ZrO2 Gate Dielectric,â IEEE Transactions on Electron Devices, vol. 70, no. 11, pp. 5590-5595, 2023. J82. H. Liu, J. Wang, D. Guo, K. Shen, B. Chen, and J. Wu, âDesign and Fabrication of High Performance InGaAs near Infrared Photodetector,â Nanomaterials, vol. 13, no. 21, 2023. J81. Jinshan Yao, Jiayi Li, Qihang Zhang, Zongyan Zuo, Weiwei Zhang, Wenyang Wang, Chen Li, Baile Chen, Yu Deng, Xuejin Zhang, Hong Lu, Yan-Feng Chen, âLarge redshift in photoluminescence of InAs/AlAs short-period superlattices due to highly ordered lateral composition modulationâ, Journal of Vacuum Science & Technology A, 41(4), 042705, 2023 J80. Lu Yao, Wenyang Wang, Jinshan Yao, Kechao Lu, Hong Lu, Changcheng Zheng, Baile Chen*, “Interband transitions of InAs/AlAs Short-Period superlattices grown by molecular beam epitaxy”, Journal of Crystal Growth 2023 Vol. 605 Pages 127071 J79. Liqi Zhu, Huachen Ge, Huijun Guo, Lu Chen, Chun Lin, Baile Chen*, “Gain and Excess Noise in HgCdTe e-Avalanche Photodiodes at Various Temperatures and Wavelengths”, IEEE Transactions on Electron Devices 2023 Vol. 70 Issue 5 Pages 2384-2388 J78. Liqi Zhu, Huijun Guo, Zhiqi Zhou, Zhiyang Xie, Hao Xie, Lu Chen, Chun Lin, Baile Chen*, “Bandwidth Characterization and Optimization of High-Performance Mid-wavelength Infrared HgCdTe e-Avalanche Photodiodes”, Infrared Physics & Technology 2023 Vol. 131 Pages 104682 J77. Luyu Wang, Zhiyang Xie, Beibei Pan, Zhiqi Zhou, Linze Li, Xinbo Zou, Haiming Ji, Baile Chen*, “High-Speed Photodetector With Simultaneous Electrical Power Generation”, Journal of Lightwave Technology 2023 Vol. 41 Issue 2 Pages 662-670 J76.Daqian Guo, Jian Huang, Mourad Benamara, Yuriy I Mazur, Zhuo Deng, Gregory J Salamo, Huiyun Liu, Baile Chen, Jiang Wu, “High operating temperature mid-infrared InGaAs/GaAs submonolayer quantum dot quantum cascade detectors on silicon”, IEEE Journal of Quantum Electronics 2023 Vol. 59 Issue 2 Pages 1-7 J75. Yinan Zhao, Kechao Lu, Jinshan Yao, Jiqiang Ning, Baile Chen, Hong Lu, Changcheng Zheng, “Strain evolution and confinement effect in InAs/AlAs short-period superlattices studied by Raman spectroscopy”, Scientific Reports 2023 Vol. 13 Issue 1 Pages 123 J74. Jinshan Yao, Jiayi Li, Qihang Zhang, Zongyan Zuo, Weiwei Zhang, Wenyang Wang, Chen Li, Baile Chen, Yu Deng, Xuejin Zhang, Hong Lu, Yan-Feng Chen, “Large redshift in photoluminescence of InAs/AlAs short-period superlattices due to highly ordered lateral composition modulation”, Journal of Vacuum Science & Technology A 2023 Vol. 41 Issue 4, 042705 J73. Jian Huang, Zhecheng Dai, Zhijian Shen, Zongti Wang, Zhiqi Zhou, Ziyu Wang, Bo Peng, Weimin Liu, Baile Chen*, “High-Speed Mid-Wave Infrared InAs/InAsSb Superlattice Uni-Traveling Carrier Photodetectors With Different Absorber Doping”, IEEE Transactions on Electron Devices 2022 Vol. 69 Issue 12 Pages 6890-6896 J72. Baile Chen*, “Equivalent circuit model of the RF characteristics of multi-stage infrared photodetectors”, Journal of Lightwave Technology 2022 Vol. 40 Issue 15 Pages 5224-5230 J71. Zongti Wang, Jian Huang, Liqi Zhu, Zhiqi Zhou, Xuyi Zhao, Antian Du, Wenfu Yu, Ruotao Liu, Qian Gong, Baile Chen*, “High-performance InP-based bias-tunable near-infrared /extended-short wave infrared dual-band photodetectors”, Journal of Lightwave Technology 2022 Vol. 40 Issue 5 Pages 5157-5162 J70. Zhiqi Zhou, Liqi Zhu, Zhiyang Xie, Baile Chen*,âMonte Carlo Simulation of High-Speed MWIR HgCdTe e-APDâ, IEEE Transactions on Electron Devices, Vol. 69 Issue 7 Pages 3753-3760, 2022 J69. Linze Li#, Rui Pan#, Zhiyang Xie, Yao Lu, Jiaxiang Chen, Xinbo Zou, Ziyuan Yuan, Menglin Chang, Hong Lu*, and Baile Chen*ï¼ âHigh-speed Ge-on-GaAs photodetectorâï¼Optics Express 2022, 30 (12), 20684-20696. J68. Jiajun Yu, Yinan Zhao, Siqi Li, Jinshan Yao, Lu Yao, Jiqiang Ning, Yucheng Jiang, Hong Lu*, Baile Chen* , Changcheng Zheng*, “Carrier localization effect in the photoluminescence of In composition engineered InAlAs random alloy”, Journal of Luminescence (2022), Vol. 249 Pages 119009 J67. Jingyi Wang, Zhiyang Xie, Liqi Zhu, Xuyi ",
  "content_length": 44817,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:46"
}