{
  "name": "Bakhadyr Khoussainov",
  "homepage": "https://bakh-tcs.github.io",
  "status": "success",
  "content": "Bakh M. Khoussainov's Homepage Bakh M.Khoussainov University of Electronic Science and Technology of China The University of Auckland Bakh M.Khoussainov I am a professor of computer science at The University of Electronic Science and Technology of China (UESTC), Chengdu. I lead The Algorithm and Logic Lab at the computer science school of the UESTC. I work on computable structures, automatic structutres, games on graphs, mechanism design, and probability structures. Interests & Hobbies Research Teaching Football (Soccer) Tennis Taekwondo Table Tennis Drinking coffee Work experience 2020–present: The University of Electronic Science and Technology of China (UESTC). 1996–2021: The University of Auckland. 2016–2019: Kyoto University. 2012–2013: National University of Singapore. 2007-2010 (1991-1997): Cornell University. 2006: National University of Singapore. News recent news Prof. Bakh Khoussainov’s talk at Beijing Logic Meeting Prof. Bakh Khoussainov is an invited speaker at Beijing Logic Meeting, see http://www.amss.cas.cn/xshy/202304/t20230417_6739972.html for details. June 7, 2023 Congrats! Prof. Bakh Khoussainov elected Member of the European Academy of Sciences! Recently, the European Academy of Humanities and Natural Sciences (Academia Europaea, referred to as the \"European Academy of Sciences\") released the list of new academicians in 2023, and Prof. Bakh Khoussainov of the School of Computer Science and Engineering (School of Cyberspace Security) of UESTC was elected. May 23, 2023 Prof. Bakh Khoussainov’s talk at Asian Logic Conference Prof. Bakh Khoussainov is an invited speaker at Asian Logic Conference, see https://logic.nankai.edu.cn/alc2023/ for the details. April 19, 2023 Prof. Bakh Khoussainov’s talk at Fifth Workshop on Digitalization and Computable Models Prof. Bakh Khoussainov is an invited speaker at Fifth Workshop on Digitalization and Computable Models (WDCM2023), see https://sites.google.com/view/wdcm2023/ home/invited-speakers for the details. April 19, 2023 If you want know more news about my work or my lab's work click here >>more Publications papers&books I have published more than 170 research articles. Many of these works have been published in SIAM Journal of Computing, ACM Trans of Computational Logic, Proceedings of LICS, STOC, STACS, MFCS, Journal of Symbolic Logic, Algebra and Logic, and Transactions of the AMS. These are top publication venues in theoretical computer science, logic, and mathematics. Selected papers: Automatic Presentations of Structures Deciding Parity Games in Quasi-polynomial Time Degree spectra and computable dimensions in algebraic structures Automatic Structures: Richness and Limitations Infinite Strings and their Large Scale Properties Multi-Unit Auction in Social Networks with Budgets you want to know more about my articles click here My DBLP or My AMS Research personal research Primary research: Automatic structures Algorithmic game theory Large databases and graphs Algorithmic randomness Probability structures Computable model theory Secondary research: Study of large graphs Mechanism design Collaborations: A network with over 100 experts from over 30 academic institutions in Europe, America and Asia, including Cornell University, The University of Chicago, University of California at Berkeley, Notre–Dame University, Novosibirsk University, Moscow University, National University of Singapore, Kyoto University, University of Wisconsin-Madison. I have collaborated with 89 experts so far. Services appointment Administrative work at the University of Electronic Sciences and Technology: 2021–Present: Director of the Algorithms and Logic Lab at the UESTC. 2020–2021: Member of the recruitment panel into the school of computer science. Administrative work at the University of Auckland: 2017–2020: Faculty of Science Awards, Prizes and Fellows Committee. 2016–2019 and 2009: Member of Faculty of Science Staffing Committee. 2014–2016: Deputy Head of Department (DHoD-Academic). 2009–2012 and 2002–2008: Deputy Head of Department (DHoD-Research). 2005–2011: Faculty of Science Research Committee member. PC membership: I have been a member of more than 100 conference and workshop program committees including LICS, MFCS, LFCS, CSL, and DLT. Here is the recent list: 2021: ICALP, International Conference on Automata, Languages, and Programming. 2020: Logic in Computer Science (LICS). Logical Foundations of Computer Science (LFCS). Maltzev meeting 2019: Asian Logic Conference (ALC), Astana. Languages, Automata, and Applications (LATA). Maltzev meeting. 2018: Logical Foundations of Computer Science (LFCS), Mathematical Foundations of Computer Science (MFCS). 2016: Logical Foundations of Computer Science (LFCS). Editorship: 2014–2021: An editor of the Journal for Symbolic Logic, a premier journal in logic, computability, and applications. Awards & Grants personal awards Awards Distinctions: 2021: Nerode prize. The EATCS-IPEC Nerode Prize for outstanding papers in the area of multivariate algorithmics (co-winner). 2020: Humboldt prize. Euro 60K. The first computer scientist from NZ awarded. 2019: Aitken lecturer. A competitive lectureship selected by the London and the NZ Math Societies once every two years. Includes a series of lectures at UK universities. 2017: Best STOC 2017 paper award (co-winner). 2005: Fellow of the Academy of The Royal Society of New Zealand. Grants: 2024–2024: NSFC senior international scientist grant. 2022–2026: NSFC research grant (15% success rate). 2017–2020: MOE Singapore. 2016–2019: Marsden fund grant Royal Society of NZ (10-15% success rate). 2011–2016: Marsden fund grant Royal Society of NZ (10-15% success rate). 2008–2011: Marsden fund grant Royal Society of NZ (10-15% success rate). 2004–2008: Marsden fund grant Royal Society of NZ (10-15% success rate). 2001–2004: Marsden fund grant Royal Society of NZ (10-15% success rate). Teaching awards: 2022: International Cooperation and International Education Advanced Team in UESTC. 2018: Engineering Faculty top teaching award, The University of Auckland. 2017: Top undergraduate teacher award in Engineering Faculty, The University of Auckland. 2011: Top undergraduate teacher award in Engineering Faculty, The University of Auckland. 2001: The University of Auckland Distinguished Teaching Award. Contact contact me Address: Qingshuihe Campus of UESTC, No.2006, Xiyuan Avenue, West Hi-tech Zone, Chengdu, Sichuan, P.R.China Zip/Postal Code: 611731. Telephone: (649) 3737599 ext. 85120 Email: bmk@uestc.edu.cn Welcome to use this website No. Visitor Since Oct 2022. Powered by w3.css",
  "content_length": 6609,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:48"
}