{
  "name": "Baki Cakici",
  "homepage": "https://pure.itu.dk/portal/en/persons/baki-cakici(b614ac6f-eefa-44a3-8b9a-092b88d86d37).html",
  "status": "success",
  "content": "Baki Cakici - IT-University of Copenhagen Baki Cakici Associate Professor, Technologies in PracticeETHOS Lab https://orcid.org/0000-0002-1039-8177 Emailbakcitudk 20102025 Research activity per year Personal profile KeywordsSocial theoryHistory of computingPolitics of numbersIdentificationSurveillance StudiesPostcolonial theorySoftware Studies Fingerprint Dive into the research topics where Baki Cakici is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Official Statistics Keyphrases 100% Citizen Data Keyphrases 66% Personally Identifiable Information Keyphrases 66% Official Statistic Computer Science 66% Personal Identification Number Computer Science 41% Open the Black Box Keyphrases 33% Introduction to the Special Issue Keyphrases 33% Citizen Trust Keyphrases 33% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2010 2013 2014 2018 2019 2021 2024 2025 13 Journal article 7 Book chapter 2 Working paper 1 Article in proceedings 1 More 1 Doctoral thesis Research output per year Research output per year Addressability: Identification and Communicative Positions in Critical Sociological PerspectiveCakici, B. & Thiel, A., 12 Jun 2025, In: Sociologisk Forskning. 62, 1-2, p. 107-120 14 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Mode 2 Knowledge Production 100% Sociological Perspective 100% Entitlement 100% Personally Identifiable Information 100% Systems Theory 100% Spaceships and Poetry: Enlivening the Lab as a site of Feminist Critical PedagogyDouglas-Jones, R., Cakici, B., Cohn, M., Gahoonia, S. K., Ojala, M. & Laursen, C. S., 1 Dec 2024, In: Engaging Science, Technology, and Society. 10, 1-2, 28 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Lab Work 100% Critical Pedagogy 100% Social Formation 50% Feminist Praxis 50% Technical Recommendations 50% The politics of seamlessness: a rights claims perspective on digital identification technologiesCakici, B., Thiel, A. & Singh, R., 2024, Digitalization in Practice: : Intersections, Implications and Interventions. Perriam, J. & Meldgaard Kjær, K. (eds.). De Gruyter, Vol. 14. p. 93-108 15 p. (De Gruyter Contemporary Social Sciences).Research output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research › peer-review When Numbers Run Out: Civil Registration and the Performativity of Methods Cakici, B., 15 Dec 2024, In: Science & Technology Studies. 37, 4, p. 62-76 14 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open AccessFile Performativity 100% Civil Registration 100% Personally Identifiable Information 100% Sweden 100% Denmark 100% Data Subjects: Calibrating and SievingCakici, B., 2021, Data Practices: Making Up a European People. Scheel, S. & Ruppert, E. (eds.). London, UK: Goldsmiths PressResearch output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research › peer-review Open Access View all 24 research outputs Projects Projects per year 2023 2023 2025 1 Finished Projects per year Managing Uncertainty in Disaster Risk Reduction – An Ethnography of Data Practices in Ghana’s Emergency Preparedness and Early Intervention InfrastructureCakici, B. (PI) & Thiel, A. (PI)European Commission01/09/2023 → 31/08/2025Project: Research Disaster Risk Reduction 100% Data Practices 100% Emergency Preparedness 100% Early Intervention 100% Managing Uncertainty 100% Press/Media ”Risken är att att 500 miljoner kronor kastas bort på en ny folkräkning.”Cakici, B.12/04/20231 Media contributionPress/Media: Press / Media Activities Activities per year 2021 2021 2021 1 Membership in review committee Activities per year Hiring committee for recruitment of associate professor in Science and Technology Studies with a focus on climate, digitalisation and critical data studies (Event)Pries-Heje, L. (Chair), Cakici, B. (Member) & Douglas-Jones, R. (Member)1 Feb 2021 → 1 Jan 2022Activity: Membership types › Membership in review committee",
  "content_length": 4547,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:53"
}