{
  "name": "Balaji Palanisamy",
  "homepage": "http://www.sis.pitt.edu/bpalan",
  "status": "success",
  "content": "Balaji Palanisamy Associate Professor & Director of Graduate Studies Department of Informatics & Networked Systems School of Computing and Information Office: 135 N. Bellefield Avenue, Room 704 Pittsburgh, PA 15260 Email: bpalan@pitt(-dot--edu) Phone: 412.624.0232 CV I am an Associate Professor in the School of Computing and Information at the University of Pittsburgh. My research broadly spans the areas of Distributed Systems and Data Privacy. At Pitt, I carry out research in the Laboratory for Education and Research on Security Assured Information Systems (LERSAIS). I am also an Affiliate Scholar at the Institute for Cyber Law, Policy, and Security. Prior to joining the University of Pittsburgh, I received my Ph. D. degree in Computer Science from Georgia Institute of Technology. PhD positions: Were always looking for self-motivated and dedicated Ph.D students. If you are interested in joining our research group, please apply to our graduate program here. Research          Publications       Teaching         Contact RESEARCH INTERESTS: My research interest lies in the areas of Blockchains, Data Privacy, Privacy-aware Computing, Distributed Computer Systems, Edge Computing and Cloud Computing. I am especially interested in tackling problems related to scalable and privacy-conscious computing and data sharing in untrusted and outsourced computing environments. TEACHING: · INFSCI 2750 Cloud Computing (Spring 2016, Spring 2017, Spring 2018, Spring 2019, Spring 2020, Spring 2021, Spring 2022, Spring 2023, Spring 2024) · INFSCI 3350 - Doctoral Seminar - Blockchains (Spring 2022) · INFSCI 2150  Information Security & Privacy (Spring 2014, Fall 2014, Spring 2017, Fall 2017, Fall 2018, Fall 2019, Fall 2022, Summer 2024) · INFSCI 1690 - Cloud Computing (Fall 2021) · INFSCI 1620 - Advanced Information Security & Privacy (Spring 2021, Fall 2022) · INFSCI 2955  Special Topics Systems - Cloud Computing (Spring 2015) · INFSCI 1074  Computer Security (Fall 2013, Fall 2014, Fall 2015, Fall 2016, Fall 2019) PUBLICATIONS: COPYRIGHT: The following materials are copyrighted by the corresponding publishers (e.g. ACM, IEEE, Springer Verlag). Download them only if you accept and obey the terms and restrictions defined by the respective publishers, including the use of the downloaded materials only for personal or educational purpose. JOURNAL PUBLICATIONS: · T-Watch: Towards Timed Execution of Private Transaction in Blockchains Chao Li and Balaji Palanisamy IEEE Transactions on Services Computing (IEEE TSC 2024) · Blockchain Takeovers in Web 3.0: An Empirical Study on the TRON-Steem Incident Chao Li, Runhua Xu, Balaji Palanisamy, Li Duan, Meng Shen, Jiqiang Liu, Wei Wang in ACM Transactions on the WEB (ACM TWEB 2024) · Network Connectivity Resilience in Next Generation Backhaul Networks: Challenges and Future Opportunities David Tipper, Amy Babay, Balaji Palanisamy, Prashant Krishnamurthy IEEE Transactions on Network and Service Management (IEEE TNSM 2024) · Securing Blockchain-based Timed Data Release against Adversarial Attacks Jingzhe Wang, Balaji Palanisamy Journal of Computer Security (JCS 2023) · Amnis: Optimized stream processing for edge computing Jinlai Xu, Balaji Palanisamy, Qingyang Wang, Heiko Ludwig, Sandeep Gopisetty Journal of Parallel and Distributed Computing (JPDC 2022) · SilentDelivery: Practical Timed-Delivery of Private Information Using Smart Contracts Chao Li and Balaji Palanisamy IEEE Transactions on Services Computing (IEEE TSC 2022) · Optimized Contract-based Model for Resource Allocation in Federated Geo-distributed Clouds Jinlai Xu and Balaji Palanisamy IEEE Transactions on Services Computing (IEEE TSC 2021) · Improving Collaborative Filtering with Social Influence over Heterogeneous Information Networks Yang Zhou, Ling Liu, Kisung Lee, Balaji Palanisamy, Qi Zhang ACM Transactions on InternetTechnology (ACM TOIT 2020) · Optimizing N-Tier Application Scalability in the Cloud: A Study of Soft Resource Allocation Qingyang Wang, Shungeng Zhang, Yashuhiko Kanemasa, Calton Pu, Balaji Palanisamy, Lilian Harada and Motoyuki Kawaba ACM Transactions on Modeling and Performance Evaluation of Computing Systems (ACM TOMPECS 2019) · Reversible Location Perturbation Mechanisms for Protecting Multi-level Location Privacy Chao Li and Balaji Palanisamy Elsevier Computer Communications 2018 · Integrating Concurrency Control in n-Tier Application Scaling Management in the Cloud Qingyang Wang, Hui Chen, Shungeng Zhang,, Liting Hu, Balaji Palanisamy IEEE Transactions on Parallel and Distributed Systems (IEEE TPDS 2018) · Privacy in Internet of Things: from Principles to Technologies Chao Li and Balaji Palanisamy IEEE Internet of Things Journal (IEEE IoT-J 2018) · k-Trustee: Location injection attack-resilient anonymization for location privacy Lei Jin, Chao Li, Balaji Palanisamy and James Joshi Elsevier Computers & Security (Computers & Security 2018) · Privacy-preserving Publishing of Multi-level Utility Controlled Graph Datasets Balaji Palanisamy, Ling Liu, Yang Zhou and Qingyang Wang ACM Transactions on Internet Technology (ACM TOIT 2018) · G-SIR: An Insider Attack Resilient Geo-Social Access Control Framework Nathalie Baracaldo, Balaji Palanisamy, James Joshi IEEE Transactions on Dependable and Secure Computing (IEEE TDSC 2017) · Distributed Algorithms for Spatial Retrieval Queries in Geospatial Analysis Qiulei Guo, Balaji Palanisamy, Hassan A. Karimi and Liming Zhang Services Transactions on Cloud Computing (STCC 2016). · Road Network-Aware Spatial Alarms Kisung Lee, Ling Liu, Balaji Palanisamy and Emre Yigitoglu IEEE Transactions on Mobile Computing (IEEE TMC 2016) · Attack-resilient Mix-zones over Road Networks: Architecture and Algorithms Balaji Palanisamy and Ling Liu IEEE Transactions on Mobile Computing (IEEE TMC 2015) · Cost-effective Resource Provisioning for MapReduce in a Cloud Balaji Palanisamy, Aameek Singh and Ling Liu IEEE Transactions on Parallel and Distributed Systems (IEEE TPDS 2015) · Anonymizing Continuous Queries with Delay-tolerant Mix-zones on Road Networks Balaji Palanisamy, Ling Liu, Kisung Lee, Shicong Meng, Yuzhe Tang and Yang Zhou, Distributed and Parallel Databases (DAPD 2014) · Effective Mix-zone Anonymization for Mobile Travelers Balaji Palanisamy and Ling Liu Geoinformatica 2014. CONFERENCE PUBLICATIONS: · PR-TDR: Privacy-preserving and Reliable Timed Data Release Jingzhe Wang and Balaji Palanisamy Proc. of the 43rd International Symposium on Reliable Distributed Systems (SRDS 2024) · Timed Data Release using Smart Contracts Jingzhe Wang, Haocheng Wang, Chao Li and Balaji Palanisamy Proc. of 44th IEEE International Conference on Distributed Computing Systems (ICDCS 2024) (System Demonstration) Received Best Demo Award · How Hard is Takeover in DPoS Blockchains? Understanding the Security of Coin-based Voting Governance Chao Li, Balaji Palanisamy, Runhua Xu, Li Duan, Jiqiang Liu, Wei Wang Proc. of  The 30th ACM Conference on Computer and Communications Security (CCS 2023) Received Distinguished Paper Award · Cross-Consensus Measurement of Individual-level Decentralization in Blockchain Chao Li, Balaji Palanisamy, Runhua Xu, Li Duan Proc. of  The 9th International Conference on Big Data Security on Cloud, BigDataSecurity (BigDataSecurity 2023) · CTDRB: Controllable Timed Data Release Using Blockchains Jingzhe Wang and Balaji Palanisamy Proc. of  the 18th EAI International Conference on Security and Privacy in Communication Networks (SecureComm 2022) · Decentralized Allocation of Geo-distributed Edge Resources using Smart Contracts Jinlai Xu, Balaji Palanisamy, Qingyang Wang, Heiko Ludwig, Sandeep Gopisetty Proc. of  the 22nd IEEE/ACM international Symposium on Cluster, Cloud and Internet Computing (IEEE/ACM CCGrid 2022) · Efficient Blockchain Enabled Attribute-based Access Control as a Service Ritik Kumar, Balaji Palanisamy, Shamik Sural Proc. of  the 4th IEEE International Conference on Trust, Privacy and Security in Intelligent Systems, and Applications, (IEEE TPS-ISA 2022) · BECT: Beacon-based Contact Tracing for Detecting Direct & Indirect Contacts Akshay Madan, David Tipper, Balaji Palanisamy, Mai Abdelhakim and Prashant Krishnamurthy Proc. of The 19th IEEE International Conference on Mobile Ad-Hoc and Smart Systems, (IEEE MASS 2022) · Attack-Resilient Blockchain-Based Decentralized Timed Data Release Jingzhe Wang, Balaji Palanisamy Proc. of 36th Annual IFIP WG 11.3 Conference on Data and Applications Security and Privacy (DBSec 2022) Received Best Paper Award · Decentralized Authorization using Hyperledger Fabric Muthukur Venkata Akhil Vasishta, Balaji Palanisamy, Shamik Sural Proc. of 2022 IEEE International Conference on Blockchain, (IEEE Blockchain 2022) · Mitigating Frontrunning Attacks in Ethereum Maddipati Varun, Balaji Palanisamy, Shamik Sural Proc. of the 4th ACM International Symposium on Blockchain and Secure Critical Infrastructure (BSCI 2022) · Credit-based Peer-to-Peer Ride Sharing using Smart Contracts (poster) Somay Chopra, Balaji Palanisamy, Shamik Sural Proc. of IEEE International Conference on Blockchain and Cryptocurrency (IEEE ICBC 2022) · Protecting Blockchain-based Decentralized Timed release of Data from Malicious Adversaries (poster) Jingzhe Wang, Balaji Palanisamy Proc. of IEEE International Conference on Blockchain and Cryptocurrency (IEEE ICBC 2022) · Cost-aware & Fault-tolerant Geo-distributed Edge Computing for Low-latency Stream Processing Jinlai Xu and Balaji Palanisamy Proc. of The 7th IEEE International Conference on Collaboration and Internet Computing (IEEE CIC 2021) · Model-based Reinforcement Learning for Elastic Stream Processing in Edge Computing Jinlai Xu and Balaji Palanisamy Proc. of 29th IEEE International Conference on High Performance Computing, Data, and Analytics (HiPC 2021) Best Paper Award Nominee · Decentralized Authorization in Web Services Using Public Blockchain Maddipati Varun, Muthukur Venkata Akhil Vasishta, Balaji Palanisamy",
  "content_length": 23544,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:53"
}