{
  "name": "Balagopal Komarath",
  "homepage": "https://iitgn.ac.in/faculty/cse/balagopal",
  "status": "success",
  "content": "IIT Gandhinagar | Balagopal Komarath IIT Gandhinagar: 17 Years of ExcellenceNews Research A+ A A- A English | हिंदी | Contact Quick Links Research@IITGN IITGN-X Webmail Internal Website (IWS) Competency Development Foundation Institute Management System (IMS) Career Development Services Medical Centre cNARMADA Staff Development Cell (SDC) Reservation Cell Guest House Campus on the Sabarmati Art@IITGN Unnat Bharat Abhiyan List of Holidays NIRF Reports ARIIA Reports Tenders and Auctions Campus Facilities Library Student Affairs Alumni Affairs Scholarships and Financial Aid Internal Complaints Committee IITGN Counseling Service Leadership Development Initiative RTI ISTF Subscribe Balagopal Komarath Faculty Computer Science & Engineering Balagopal Komarath Balagopal Komarath Assistant Professor, Computer Science & Engineering B.Tech.: Government Engineering College, Thrissur, 2007 M.Tech.: IIT Madras, 2011 PhD: IIT Madras, 2016 Office: 13/405 B Recent Publications Christian Ikenmeyer, Balagopal Komarath, Christoph Lenzen, Vladimir Lysikov, Andrey Mokhov, and Karteek Sreenivasaiah. On the Complexity of Hazard-free Circuits. J. ACM 66, 4, Article 25 (August 2019), 20 pages. Balagopal Komarath, Jayalal Sarma, K. S. Sunil: Comparator Circuits over Finite Bounded Posets. Inf. Comput. 261(Part): 160-174 (2018) Balagopal Komarath, Jayalal Sarma, Saurabh Sawlani: Pebbling meets coloring: Reversible pebble game on trees. J. Comput. Syst. Sci. 91: 33-41 (2018) Balagopal Komarath, Jayalal Sarma, K. S. Sunil: On the Complexity of L-reachability. Fundam. Inform. 145(4): 471-483 (2016) Balagopal Komarath, Jayalal Sarma: Pebbling, Entropy, and Branching Program Size Lower Bounds. TOCT 7(2): 8:1-8:21 (2015) Work Experience Scientific Assistant (postdoc), Saarland University, May 2016 to Sep 2019. Research Assistant, IIT Madras, Jul 2011 to Apr 2016. Teaching Assistant, IIT Madras, Aug 2009 to Apr 2011. Software Engineer, Tata Elxsi Pvt. Ltd. Aug 2007 to Aug 2009. Research Interests ● Circuit complexity and other low-level computational models",
  "content_length": 2058,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:49"
}