{
  "name": "Balakrishnan Chandrasekaran 0002",
  "homepage": "https://balakrishnanc.github.io",
  "status": "success",
  "content": "Bala ChandrasekaranI’m an assistant professor (tenured) at Vrije Universiteit Amsterdam in Amsterdam, Netherlands, and my research focusses on the performance and security aspects of networked systems. Previously, I was a senior researcher at the Max-Planck-Institut für Informatik in Saarbrücken, Germany. I graduated with a PhD in 2016 from Duke University in Durham, USA and was advised by Prof. Bruce MacDowell Maggs.Recent Publications“Unlocking Diversity of Fast-Switched Optical Data Center Networks with Unified Routing” Jialong Li, Yiming Lei, Federico De Marchi, Raj Joshi, Balakrishnan Chandrasekaran, and Yiting Xia In IEEE/ACM Transactions on Networking (TON) July 2025“On the Constancy of Latency at the Internet’s Edge” Aditya Bhat, Vaibhav Ganatra, Aniket Shaha, Balakrishnan Chandrasekaran, and Vinayak Naik In Proceedings of the International Conference on Traffic Monitoring and Analysis (TMA) June 2025“On The Governance of Decentralized Autonomous Organizations” Vabuk Pahari, Balakrishnan Chandrasekaran, Abhisek Dash, Krishna Gummadi, and Johnnatan Messias In The Latest in DeFi Research (TLDR) May 2025“CellReplay: Towards accurate record-and-replay for cellular networks” William Sentosa, Balakrishnan Chandrasekaran, Brighten Godfrey, and Haitham Hassanieh In Proceedings of the 22nd USENIX Symposium on Networked Systems Design and Implementation (NSDI) “Community Award” April 2025“Lighthouse: An Open Research Framework for Optical Data Center Networks” Yiming Lei, Federico De Marchi, Jialong Li, Raj Joshi, Balakrishnan Chandrasekaran, and Yiting Xia arXiv:2411.18319; Computing Research Repository (CoRR) November 2024“Enabling System Innovation in Optical Data Center Networks with OpenOptics” Yiming Lei, Raj Joshi, Federico De Marchi, Jialong Li, Balakrishnan Chandrasekaran, and Yiting Xia In ACM SIGCOMM Workshop on Hot Topics in Optical Technologies and Applications in Networking (HotOptics) August 2024All publications",
  "content_length": 1958,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:51"
}