{
  "name": "Balaji Parthasarathy",
  "homepage": "http://citapp.iiitb.ac.in/staff-members/balaji-parthasarathy",
  "status": "success",
  "content": "Balaji Parthasarathy | IIITB CITAPP Balaji Parthasarathy Professor Education : Ph.D. (University of California Berkeley) Balaji Parthasarathy joined IIITB in July 2000 as an Assistant Professor, and became a Professor in February 2013. He served as the Institute’s first Dean (Faculty) from January 2014 until February 2017. In 2014, he also co-founded IIITB’s Center for Information Technology and Public Policy. His intellectual interests are rooted in economic geography and economic sociology, and explore the relationships between technological change and innovation, economic globalization, and social transformation. Within this broad focus, his work follows two threads. One thread examines the impacts of public policies and firm strategies on the social and spatial organization of production in the ICT (information and communications technology) industry. Another thread deals with ICTs for Development or ICTD. Here, his interests lie in understanding how ICTs are deployed in various domains of activity to transform social relationships, especially in underprivileged contexts. Research Interests: The State and Late Industrialisation; Innovation Policies and Regional Economic Development; Civil Society Institutions, Frugal/Social Innovation; Multinational Enterprises, Small and Medium Enterprises; Computer Software and New Media Industries;  Political-Economy of E-Governance and Information Access; E-Waste Flows; Urbanism, Urbanisation and “Smart” cities; The Platform Economy View Publications>> Email: pbalaji(@iiitb.ac.in CITAPP at IIIT Bangalore is an interdisciplinary think-tank set-up to focus on the policy challenges and the organizational demands made by technological innovation. Of particular interest to the Centre is how technological advances, along with institutional changes that harness the legitimacy and the powers of bureaucracies and market, address the needs of underserved communities.",
  "content_length": 1931,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:58"
}