{
  "name": "Balbir S. Barn",
  "homepage": "http://www.cs.mdx.ac.uk/people/balbir-barn",
  "status": "success",
  "content": "Barn, Prof. Balbir – CS@MDX Skip to the content Close Menu Email: B.Barn @ mdx.ac.ukOffice: T109 Town Hall Building, Hendon Campus About Professor & Academic Dean of the Faculty of Science and Technology Research Interests Publications Repository Model-driven engineering for digital twins: opportunities and challengesMichael, J., Cleophas, L., Zschaler, S., Clark, T., Combemale, B., Godfrey, T., Khelladi, D.E., Kulkarni, V., Lehner, D., Rumpe, B., Wimmer, M., Wortmann, A., Ali, S., Barn, B., Barosan, I., Bencomo, N., Bordeleau, F., Grossmann, G., Karsai, G., Kopp, O., Mitschang, B., Ariza, P.M., Pierantonio, A., Polack, F.A.C., Riebisch, M., Schlingloff, H., Stumptner, M., Vallecillo, A., van den Brand, M. and Vangheluwe, H. 2025. Model-driven engineering for digital twins: opportunities and challenges. Systems Engineering. 28 (5), pp. 659-670. https://doi.org/10.1002/sys.21815A simulation based aid for complex dynamic decision makingBarat, S., Clark, T., Barn, B. and Kulkarni, V. 2016. A simulation based aid for complex dynamic decision making. Sandkuhl, K. and Söderström, E. (ed.) Doctoral Consortium at the 9th IFIP WG 8.1 Working Conference on The Practice of Enterprise Modeling. Skovde, Sweden 08 Nov 2016 CEUR-WS.Texture-based 3d image retrieval for medical applicationsGao, X., Qian, Y., Hui, R., Loomes, M., Comley, R., Barn, B., Chapman, A. and Rix, J. 2010. Texture-based 3d image retrieval for medical applications. Macedo, M. (ed.) IADIS International Conference e-Health 2010. Freiburg, Germany 29 - 31 Jul 2010 IADIS. pp. 101-108From components to web based servicesBarn, B. 2004. From components to web based services. Seruca, I., Filipe, J., Hammoudi, S. and Cordeiro, J. (ed.) 6th International Conference on Enterprise Information Systems. Porto, Portugal 14 - 17 Apr 2004 Institute for Systems and Technologies of Information, Control and Communication.Sociotechnical digital twin: public policy evaluation and a research roadmap for the digital societyBarn, B. 2023. Sociotechnical digital twin: public policy evaluation and a research roadmap for the digital society. 2nd International Workshop on Digital Twin Engineering (DTE) . Vienna, Austria 29 - 29 Nov 2023Adaptation of enterprise modeling methods for large language modelsBarn, B., Barat, S. and Sandkuhl, K. 2023. Adaptation of enterprise modeling methods for large language models. Almeida, J., Kaczmarek-Heß, M., Koschmider, A. and Proper, H. (ed.) 16th IFIP WG 8.1 Working Conference on the Practice of Enterprise Modeling. Vienna, Austria 28 Nov - 01 Dec 2023 Cham Springer. https://doi.org/10.1007/978-3-031-48583-1_1Neural text generators in enterprise modeling: can ChatGPT be used as proxy domain expert?Sandkuhl, K., Barn, B. and Barat, S. 2023. Neural text generators in enterprise modeling: can ChatGPT be used as proxy domain expert? da Silva, A.R., da Silva, M.M., Estima, J., Barry, C., Lang, M., Linger, H. and Schneider, C. (ed.) 31st International Conference on Information Systems Development. Lisbon, Portugal 30 Aug - 01 Sep 2023 Lisbon, Portugal Association for Information Systems (AIS). https://doi.org/10.62036/ISD.2023.44Towards the essence of specifying sociotechnical digital twinsBarn, B., Clark, T., Barat, S. and Kulkarni, V. 2023. Towards the essence of specifying sociotechnical digital twins. Agarwal, S., Roychoudhury, A., Purandare, R., Tiwari, S. and Kumar, L. (ed.) ISEC 2023: 16th Innovations in Software Engineering Conference. Prayagraj, Uttar Pradesh, India 23 - 25 Feb 2023 Association for Computing Machinery (ACM). pp. 1-5 https://doi.org/10.1145/3578527.3578542An innovative blockchain-based traceability framework for industry 4.0 cyber-physical factoryDavis, W., Yaqoob, M., Bennett, L., Mihai, S., Hung, D., Trestian, R., Karamanoglu, M., Barn, B. and Nguyen, H. 2023. An innovative blockchain-based traceability framework for industry 4.0 cyber-physical factory. 2022 11th International Conference on Industrial Technology and Management. Oxford, United Kingdom 18 - 20 Feb 2022 New York, NY, USA Association for Computing Machinery (ACM). https://doi.org/10.1145/3588155.3588174Digital twin as an aid for decision-making in the face of uncertaintyKulkarni, V., Barat, S., Clark, T. and Barn, B. 2022. Digital twin as an aid for decision-making in the face of uncertainty. 2022 Winter Simulation Conference (WSC). Singapore 11 - 14 Dec 2022 IEEE. pp. 1371-1385 https://doi.org/10.1109/wsc57314.2022.10015528« Previous123...13Next » Address Department of Computer ScienceMiddlesex UniversityHendon Town HallThe BurroughsLondon NW4 4BT, United Kingdom Contact Us For enquiries about research collaboration & knowledge transfer, please contact Dr Aboubaker Lasebae. For postgraduate research enquiries (PhD & MRes), please contact Professor Juan Augusto. For undergraduate/postgraduate taught degrees (BSc & MSc), please contact the director of programmes Dr Serengul Smith.",
  "content_length": 4918,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:55"
}