{
  "name": "Bao-Liang Lu",
  "homepage": "http://bcmi.sjtu.edu.cn/~blu",
  "status": "success",
  "content": "Bao-Liang Lu's Home Page Bao-Liang Lu Ph.D., IEEE Fellow, Professor, Directors Center for Brain-like Computing and Machine Intelligence Department of Computer Science and Engineering Shanghai Jiao Tong University Key Laboratory of Shanghai Commission for Intelligent Interaction and Cognitive Engineering Shanghai Jiao Tong University Center for Brain-Machine Interface and Neuromodulation, RuiJin Hospital, Shanghai Jiao Tong University School of Medicine RuiJin-MiHoYo Laboratory, RuiJin Hospital, Shanghai Jiao Tong University School of Medicine bllu AT sjtu DOT edu DOT cn Phone.: +86-21-34205422 Office: Room 431, Dian Xin Building 3 Address: 800 Dong Chuan Road Shanghai 200240, China Research Interest Brain-like Computing, Neural Networks, Deep Learning, Emotion AI, Affective Brain-Computer Interface. Education Background I received the B.S. degree in instrument and control engineering from Qingdao University of Science and Technology, China, in 1982, the M. S. degree in computer science and engineering from Northwestern Polytechnical University, Xi'an, China, in 1989, and the Dr. Eng. degree in electrical engineering from Kyoto University, Kyoto, Japan, in 1994. Work Experience From 1982 to 1986, I was with the Qingdao University of Science and Technology. From April 1994 to March 1999, I was a Frontier Researcher at the Bio-Mimetic Control Research Center, the Institute of Physical and Chemical Research (RIKEN), Nagoya, Japan. From April 1999 to August 2002, I was a Research Scientist at the RIKEN Brain Science Institute, Wako, Japan. Since August 2002, I have been a full professor at the Department of Computer Science and Engineering, Shanghai Jiao Tong University, China. Teaching Neural Network Theory and Applications Parallel Machine Learning with Application to Large-Scale Data Mining Awards 2012 Asia Pacific Neural Network Assembly (APNNA) Excellent Service Award 2018 IEEE Transactions on Autonomous Mental Development Outstanding Paper Award 2020 First Prize, Wu Wen Jun AI Science & Technology Award 2021 Best of IEEE Transactions on Affective Computing Paper Collection ACM Multimedia 2022 Top Paper Award 2022 Asia Pacific Neural Network Society (APNNS) Outstanding Achievement Award Editorial Board of IEEE Transactions on Affective Computing 2022- Journal of Neural Engineering 2021- Chinese Journal of Intelligent Science and Technology 2019- Pattern Recognition and Artificial Intelligence (in Chinese) 2017- IEEE Transactions on Cognitive and Developmental Systems 2016- Major Grants Investigating Age, Gender, and Cultural Differences in Emotion Recognition Using EEG and Eye Movement Signals Principal Investigator: Bao-Liang Lu Grant Number: NSFC 61976135 Agency: National Science Foundation of China Period: Jan. 1, 2020 to Dec. 31, 2023 A Study on the Discrimination Ability, Representation Characteristics and Stability of EEG and Eye Movement Signals for Multimodal Emotion Recognition Principal Investigator: Bao-Liang Lu Grant Number: NSFC 61673266 Agency: National Science Foundation of China Period: Jan. 1, 2017 to Dec. 31, 2020 A Study on Visual Cognition Coding and Information Integration Mechanism of the Brain Principal Investigator: Bao-Liang Lu Grant Number: 2013CB329401 Agency: National Basic Research Program (973) of China Period: Jan. 1, 2013 to Dec. 31, 2017 A Study on Key Techniques for Fatigue Monitoring by Using Forehead EOG Principal Investigator: Bao-Liang Lu Grant Number: NSFC 61272248 Agency: National Science Foundation of China Period: Jan. 1, 2013 to Dec. 31, 2016 A Driving Fatigue Detection System by Combining EOG and EEG Signals Principal Investigator: Bao-Liang Lu Grant Number: 13511500200 Agency: Science and Technology Commission of Shanghai Municipality Period: July. 1, 2013 to June 30, 2015 Dry-electrode-based Wireless Wearable EEG-cap and Its Application to Drivers' Vigilance Monitor System Principal Investigator: Bao-Liang Lu Grant Number: 09511502400 Agency: Science and Technology Commission of Shanghai Municipality Period: July. 1, 2009 to June 30, 2011 The Basic Mechanism Research of Visual Information Processing Principal Investigator: Bao-Liang Lu Grant Number: 2009CB320901 Agency: National Basic Research Program (973) of China Period: Jan. 1, 2009 to Dec. 31, 2013 EEG Based Vigilance Estimation and Prediction for Drivers Principal Investigator: Bao-Liang Lu Grant Number: NSFC 90820018 Agency: National Science Foundation of China Period: Jan. 1, 2009 to Dec. 31, 2011 Integrated platform for analysis of metagenomic and metabonomic data and study on metabolic disease Principal Investigator: Bao-Liang Lu Grant Number: NSFC 2008AA02Z315 Agency: National High-Tech Research Program (863) of China Period: Jan. 1, 2008 to Dec. 31, 2010. Learning algorithm for Large-scale, multi-label, and imbalanced classification problems Principal Investigator: Bao-Liang Lu Grant Number: NSFC 60773090 Agency: National Science Foundation of China Period: Jan. 1, 2008 to Dec. 31, 2010. Task decomposition and module combination for massively parallel pattern classifiers Principal Investigator: Bao-Liang Lu Grant Number: NSFC 60473040 Agency: National Science Foundation of China Period: Jan. 1, 2005 to Dec. 31, 2007. Incremental learning model Principal Investigator: Bao-Liang Lu Grant Number: NSFC 60375022 Agency: National Science Foundation of China Period: Jan. 1, 2004 to Dec. 31, 2006. Publication 2025 Wei-Bang Jiang, Yansen Wang, Bao-Liang Lu, Dongsheng Li, NeuroLM: A Universal Multi-task Foundation Model for Bridging the Gap between Language and EEG Signals.In The Thirteenth International Conference on Learning Representations, 2025. [pdf] Hao-Long Yin, Wei-Long Zheng, Bao-Liang Lu, STAR: A Spatial-Temporal Autoencoder for EEG Restoration in Emotion Recognition, Proc. of ICASSP 2025. Jian-Ming Zhang, Wei-Bang Jiang, Wei-Long Zheng, Bao-Liang Lu, Multi-Scale Attention-Based Dense Spatial-Temporal Model for Emotion Induction in Response to Olfactory Stimuli, Proc. of ICASSP 2025. Ziyi Li, Wei-Long Zheng, Bao-Liang Lu, Gram: A Large-Scale General EEG Model for Raw Data Classification and Restoration Tasks, Proc. of ICASSP 2025. Haiqing Hu, Hanwen Shi, Bao-Liang Lu, Wei-Long Zheng, Multi-Source Multi-Target Domain Similarity Network for Cross-Cultural EEG Emotion Recognition, Proc. of ICASSP 2025. David Edwin Carlson, Ricardo Chavarriaga, Yiling Liu, Fabien Lotte, Bao-Liang Lu, The NERVE-ML (Neural Engineering Reproducibility and Validity Essentials for Machine Learning) Checklist: Ensuring Machine Learning Advances Neural Engineering, Journal of Neural Engineering. Huan Liu, Shusen Yang, Yuzhe Zhang, Mengze Wang, Fanyu Gong, Chengxi Xie, Guanjian Liu, Zejun Liu, Yong-Jin Liu, Bao-Liang Lu, Dalin Zhang, Libeer: A comprehensive benchmark and algorithm library for EEG-based emotion recognition, IEEE Transactions on Affective Computing Yong Peng, Jiangchuan Liu, Honggang Liu, Natasha Padfield, Junhua Li, Wanzeng Kong, Bao-Liang Lu, Andrzej Cichocki, Prediction Consistency and Confidence-Based Proxy Domain Construction for Privacy-Preserving in Cross-Subject EEG Classification, IEEE Journal of Biomedical and Health Informatics Khin Pa Pa Aung, Hao-Long Yin, Tian-Fang Ma, Wei-Long Zheng, Bao-Liang Lu, SEED-MYA: A Novel Myanmar Multimodal Dataset for Enhancing Emotion Recognition, IEEE Transactions on Affective Computing Cunbo Li, Zehong Cao, Yue Pan, Pengcheng Zhu, Peiyang Li, Fali Li, Huafu Chen, Bao-Liang Lu, Feng Wan, Dezhong Yao, Peng, Xu, EEG-Based Emotion Monitoring and Regulation System by Learning the Discriminative Brain Network Manifold, IEEE Transactions on Neural Networks and Learning Systems Lu Zhang, Hanwen Shi, Ziyi Li, Wei-Long Zheng, Bao-Liang Lu, Multi-View Self-Supervised Domain Adaptation for EEG-Based Emotion Recognition, IEEE Transactions on Affective Computing Ziyi Li, Le-Yan Tao, Ruo-Xiao Ma, Wei-Long Zheng, Bao-Liang Lu, Investigating the Effects of Sleep Conditions on Emotion Responses with EEG Signals and Eye Movements, IEEE Transactions on Affective Computing Linxing Zhu, Shu Jiang, Hai Zhao, Zuchao Li, Jiashuang Huang, Weiping Ding, Bao-Liang Lu, Document-Level Neural Machine Translation With Document Embeddings, IEEE Access Yan-Kai Liu, Jinyu Cai, Bao-Liang Lu, Wei-Long Zheng, Multi-to-Single: Reducing Multimodal Dependency in Emotion Recognition Through Contrastive Learning, Proceedings of the AAAI Conference on Artificial Intelligence 39 (2), 1438-1446 Xuan-Hao Liu, Bao-Liang Lu, Wei-Long Zheng, mixEEG: Enhancing EEG Federated Learning for Cross-subject EEG Classification with Tailored mixup, arXiv preprint arXiv:2504.07987 2024 Wei-Bang Jiang, Li-Ming Zhao, Bao-Liang Lu, Large Brain Model for Learning Generic Representations with Tremendous EEG Data in BCI. In The Twelfth International Conference on Learning Representations, 2024. [pdf] Wei-Bang Jiang*, Ziyi Li*, Wei-Long Zheng, Bao-Liang Lu, Functional Emotion Transformer for EEG-Assisted Cross-Modal Emotion Recognition, Proc. of ICASSP 2024. (*contributed equally as joint first authors) [pdf] Ziyi Li, Li-Ming Zhao, Wei-Long Zheng, Bao-Liang Lu, Temporal-Spatial Prediction: Pre-Training on Diverse Datasets for EEG Classification, Proc. of ICASSP 2024. [pdf] Pengxuan Gao, Tianyu Liu, Jia-Wen Liu, Bao-Liang Lu, Wei-Long Zheng, Multimodal Multi-View Spectral-Spatial-Temporal Masked Autoencoder for Self-Supervised Emotion Recognition, Proc. of ICASSP 2024. [pdf] Yu-Ting Lan, Wei-Bang Jiang, Wei-Long Zheng, Bao-Liang Lu, CEMOAE: A Dynamic Autoencoder with Masked Channel Modeling for Robust EEG-Based Emotion Recognition, Proc. of ICASSP 2024. [pdf] Wei-Bang Jiang*, Yu-Ting Lan*, Bao-Liang Lu, REmoNet: Reducing Emotional Label Noise via Multi-regularized Self-supervision. Proceedings of the 32nd ACM International Conference on Multimedia (ACM MM 2024). (*contributed equally as joint first authors) [pdf] Wei-Bang Jiang*, Xuan-Hao Liu*, Wei-Long Zheng, Bao-Liang Lu, SEED-VII: A Multimodal Dataset of Six Basic Emotions with Continu",
  "content_length": 85298,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:55"
}