{
  "name": "Baochun Li",
  "homepage": "http://iqua.ece.toronto.edu/bli",
  "status": "success",
  "content": "Baochun Li :: iQua Baochun Li At a Glance (as of December 2024): Contact Information Â· Curriculum Vitae Â· Biography Â· Awards Â· Publications Â· Teaching Â· Research Â· Professional Services Â· Google Scholar Citations Â· Photograph (full resolution version) Baochun Li is a Professor and serves as Associate Chair, Research in the Edward S. Rogers Sr. Department of Electrical and Computer Engineering at the University of Toronto. He is cross-appointed to the Department of Computer Science. He is a member of the Computer Engineering research group. Starting August 2005, he holds the Bell Canada Endowed Chair in Computer Engineering. Baochun received his B.Engr. degree in 1995 from Tsinghua University, China, and his M.S. and Ph.D. degrees in 1997 and 2000 from the Department of Computer Science, University of Illinois at Urbana-Champaign. Baochun’s research interests are in the areas of cloud computing, distributed systems such as distributed machine learning and federated learning, security and privacy, and networking. He enjoys the process of bridging the gap between theory and practice, and of bringing theoretical results to practical implementations. In the past two decades, he has worked on applications of control theory, game theory, optimization theory, as well as network coding to address practical challenges. He also enjoys writing actual code, building real systems from scratch, and making them work efficiently. In 2000, Baochun was the recipient of the IEEE Communications Society Leonard G. Abraham Prize Paper Award in the Field of Communications Systems, for his paper published in the IEEE Journal on Selected Areas in Communications. The work represents one of the earliest research results in the area of application-layer Quality of Service adaptations using a control-theoretic model. In 2005, with Ying Zhu (now Associate Professor at Ontario Tech University), he received the Best Student Paper Award in the Thirteenth International Workshop on Quality of Service (IWQoS 2005), for his research on modeling application-layer overlay networks with linear capacity constraints. In 2009, he won the Multimedia Communications Best Paper Award from the IEEE Communications Society, with his paper co-authored with Mea Wang (now Professor at the University of Calgary), titled “R$^2$: Random Push with Random Network Coding in Live Peer-to-Peer Streaming,” published in the IEEE Journal on Selected Areas in Communications in December 2007. In the same year, at the age of 38, he also won the University of Toronto McLean Award, offered to young and talented researchers to help them continue their first-rate research. In 2014, he was elevated to the grade of IEEE Fellow, class of 2015. In 2023, he received the Best Paper Award from IEEE INFOCOM 2023, as well as the Best Paper Award from the IEEE International Conference on Metaverse Computing, Networking and Applications (IEEE MetaCom 2023). In June 2023, he was elected as a Fellow of the Canadian Academy of Engineering. In December 2023, he was elected as a Fellow of the Engineering Institute of Canada. In May 2024, he is a recipient of the IEEE INFOCOM Achievement Award, which is the highest honour that can be bestowed on a researcher in the IEEE INFOCOM community. As of May 2025, Baochun has co-authored more than 480 research papers, with a total of over 27000 citations, an H-index of 91 and an i10-index of 367, according to Google Scholar Citations. According to Research.com and using the Discipline H-index (D-index) as the metric, Baochun is ranked #20 in Canada and #545 worldwide in the field of Computer Science with a D-index of 90, and ranked #14 in Canada and #329 worldwide in the field of Electronics and Electrical Engineering with a D-index of 85. He has also been listed in the Worldâs Top 2% Scientists (based on impact and citations), published by Stanford University in 2022. Baochun has dedicated much of his time and efforts to achieve teaching excellence, by taking advantage of both traditional techniques (the use of chalkboards) and state-of-the-art technologies (animations of algorithms). In classrooms, he prefers simple and well-paced narratives, a clear flow of ideas, and appropriate use of examples. Whenever possible, he introduces more recent research results in his lectures that cover foundational topics. In 2011, he received a Departmental Teaching Award for excellence in undergraduate teaching. At the age of 39, he was the Inaugural recipient of the Distinguished Educator Award (in the “under 40” category), from his alma mater, the Department of Computer Science at the University of Illinois at Urbana-Champaign. In July 2021, he successfully delivered a two-hour invited talk, titled “Writing Perfect Papers,” to an audience of 17,000 attendees over two simultaneous live streaming sessions on Tencent Meetings and Bilibili Live Streaming (video and slides). In Fall 2024, he created a new graduate course titled Performant Software Systems with Rust in the ECE Department, which covers how the Rust programming language can be used to build systems of high performance. The course is tailored specifically for students in the Masters of Engineering program, and is open to all graduate students in the Department. 122 and 102 students enrolled in this course in Fall 2024 and 2025, respectively, and it was the first time Rust is taught in a University course in Canada. In his academic career, Baochun has always been devoted to professional services, in the Department of Electrical and Computer Engineering, the Faculty of Applied Science and Engineering, as well as in the international academic community. At the University of Toronto, he was the inaugural winner of the ECE Departmental Service Award in 2006, for his leadership and contribution in the development of mission-critical web-based software systems for graduate admissions and undergraduate course selection, in support for the flexible curriculum. He served as the chair of the Departmental Curriculum Matters Committee, as well as a voting member on the Faculty Curriculum Committee. In the international academic community, he has served as the Program Co-Chair of the 12th IEEE International Workshop on Quality of Service (IWQoS 2004), the Program Co-Chair of the 3rd International Conference on Quality of Service in Heterogeneous Wired/Wireless Networks (QShine 2006), the Program Co-Chair of the 2010 IEEE Symposium on Network Coding (NetCod 2010), the Area TPC Chair of IEEE INFOCOM 2011, 2014, 2016 â 2024, the Program Vice Chair of the 31st IEEE International Conference on Distributed Computing Systems (IEEE ICDCS 2011), the Program Co-Chair of the 19th IEEE International Conference on Network Protocols (ICNP 2011), the Program Co-Chair of the 22nd International Workshop on Network and Operating Systems Support for Digital Audio and Video (NOSSDAV 2012), the General Chair of the 21st ACM/IEEE International Symposium on Quality of Service (IWQoS 2013). He also served as the Panel Co-Chair, Area Chair, and Local Arrangement Co-Chair of IEEE INFOCOM 2014, the Program Co-Chair of IEEE INFOCOM 2015, the Chief Technology Officer of IEEE INFOCOM 2016 and IEEE INFOCOM 2017, the General Chair of the 25th IEEE International Conference on Network Protocols (IEEE ICNP 2017), the General Chair of IEEE INFOCOM 2020, the first online edition of IEEE INFOCOM, the Program Co-Chair of the 43rd IEEE International Conference on Distributed Computing Systems (IEEE ICDCS 2023), the Program Co-Chair of the 2nd IEEE International Conference on Metaverse Computing, Networking and Applications (IEEE MetaCom 2024), the General Co-Chair of the 3rd IEEE International Conference on Metaverse Computing, Networking and Applications (IEEE MetaCom 2025), the Program Co-Chair of the 23rd IEEE International Conference on Mobile Ad-Hoc and Smart Systems (MASS 2025), as well as the General Chair of the IEEE INFOCOM 2026 Workshop on Embodied Intelligence Networks (EIN 2026). Baochun is a fan of Apple computers. One of the early computers he worked with, dating back to the early 1980s, was an Apple IIe with 64 KB of physical memory, dual 5.25-inch floppy drives, with a high-resolution mode of 280x192. His current office computer is a late 2021 14-inch Macbook Pro with Apple M1 Max, 64 GB of unified memory, and 1 TB of SSD storage. His current home computer is a late 2019 16-inch Macbook Pro with a 2.3 GHz 8-Core Intel Core i9, 16 GB of physical memory, and 1 TB of SSD storage. This website is served with a Dell Precision server with 40 CPU cores, 256 GB of physical memory, and 3x NVIDIA RTX A4500 GPUs. When he is not in front of a computer, he enjoys reading a good book, writing with a good fountain pen in notebooks with Tomoe River paper, as well as writing short essays in Chinese. He self-published his first book, “Happiness,” in Chinese in 2019, and his link blog, “What I’ve been reading,” in English in 2025. On the more active side, he enjoys running long distances with his iPhone 13 Pro (and swimming with his 2021 Garmin Instinct Solar), working with free weights following YouTube videos, washing his car, and flying without the Internet on Air Canada transoceanic flights. He has successfully completed a half-marathon in the 2014 Hong Kong Marathon, and four full marathons at the Toronto Waterfront Marathon in 2015, 2016, 2017, and 2019.",
  "content_length": 9395,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:57"
}