{
  "name": "Baoliu Ye",
  "homepage": "https://cs.nju.edu.cn/yebl",
  "status": "success",
  "content": "Baoliu Ye at Nanjing University Baoliu Ye Ph.D., Professor National Key Laboratory for Novel Software Technology School of Computer Science Nanjing University, P. R. China Tel/Fax: +86-25-89686448 Email: yebl@nju.edu.cn Office: Room 616, Building of Computer Science Technology, Xianlin Campus [Research Interests] [Funded Projects] [Selected Publications] [Awards] [Professional Services] [Courses] [dislab.nju.edu.cn] Research Interests My current research interests mainly include Cloud Computing and Edge Computing, Edge Intelligence and Distributed Machine Learning, Novel Storage Architecture. I am interested in both theoretical algorithms and system technologies for novel distributed computing and systems. My recent work mainly focus on the following research issues. l  Resource Optimization for the Fusion of Could-Edge Computing l  Distributed Machine Learning in Could-Edge Environment l  Federated Learning and Edge Intelligence l  Large Model Structure Optimization and Cooperative Inference l  Distributed Storage Systems I am recruiting well-motivated and dedicated Ph.D. / master students to do research in the above-mentioned areas. Undergraduate students are also welcome to join our team and work on related topics. Please feel free to contact me(yebl at nju.edu.cn). For more details regarding our lab, please refer to DISLAB. Funded Projects l  “Theories and Key Technologies of High Efficiency Computing Systems for Numerical Fusion”, Special Program of National Natural Science Foundation of China (No. 62441225), 1.9 mil. RMB, 2025.01-2027.12（在研），PI The deep integration and efficient collaboration of data and computing resources are the key driving forces behind technological innovation and the advancement of the digital economy. However, the existing computing resource-centric computing methodology lacks supporting mechanism for data circulation, resulting in data silos that hinder the realization of data value and restrict the transformation and development of the digital economy. This project focuses on complex scenarios of data circulation, with the objective of constructing theories and technologies for high-performance computing system that support the integration of both data and computing. It addresses two fundamental scientific issues: spatial-temporal dislocation of data and computing resources, and diverse mismatch of intelligent data elements. The research will systematically explore four aspects: computing system architecture, resource scheduling technology, data processing methods, and intelligent computing training models. Innovations will be achieved in areas such as the computing architecture for pooling and integrating data and computing resources of Cloud-Edge-End; scheduling technology for bidirectional collaborative migration of both data and computing; multimodal data processing methods that perceive circulation characteristics; and intelligent computing training models that collaborate across Cloud-Edge-End environments. The goal is to achieve breakthroughs in the data circulation-driven integration processing model of data and computing. Based on these innovative results, application validation will be conducted in the context of data and computing integration in power grids. The anticipated outcomes will provide strong technical support and innovative scientific methods for promoting the release of data factor value, optimizing resource allocation and management, and developing a data market economy in the digital economy era. l  “Research on Theory and Key Techniques for The Fusion of Cloud and Edge Computing”, Key Program of Natural Science Foundation of China (No. 61832005), 2.86 mil. RMB, 2019.01-2023.12，PI l  “Research on Practical Network Coding Techniques for Wireless Networks”, General Program of Natural Science Foundation of China (No. 61373014), 0.77 mil. RMB, 2014.01-2017.12，PI l  “Peer-to-Peer Based Cooperative Streaming Service Technology for Mobile Wireless Network”, General Program of Natural Science Foundation of China (No. 61170069), 0.56 mil. RMB, 2012.01-2015.12，PI l  “Network Coding Based Performance Optimization Technology for Wireless Mesh Networks”, Youth Program of Natural Science Foundation of China (No. 60903025), 0.19 mil. RMB, 2010.01-2012.12，PI l  “Complex Adaptive Systems Model Inspired Resource Management Mechanism for Distributed Systems”, General Program of Natural Science Foundation of China (No. 60573106), 0.19 mil. RMB, 2006.01-2008.12，Co-PI l  “Research on The Credibility Traceability and Privacy Protection Technology for Scientific Research Behavior Data”，National Key R&D Program of China (No. 2018YFB1004704), 3.84 mil. RMB, 2018.05-2021.05，PI l  “Edge Intelligence Service”, ****, 3.84 mil. RMB, 2022.06-2024.07，PI l  “Distributed Resource Collaboration”, ****, 1.63 mil. RMB, 2019.04-2020.12，PI l  “Cloud-Edge Integrated Distributed Multi-Source Collaborative Learning: Theory and Key Technologies”, Provincial Key Project of Jiangsu Basic Research Program (No. BK20253011), 5 mil. RMB, 2025.09-2028.08（在研）, PI The Cloud-Edge integrated distributed multi-source collaborative learning is an important way to break down the barriers between both Cloud and Edge computing resources and better leverage the collaborative effects of computing, data, and AI models. However, the Cloud-Edge environment presents complex interwoven characteristics such as open operating environments, distributed terminal devices, multi-dimensional heterogeneous resources, and diversified data types. Coupled with the real-time and security requirements brought by the ubiquitous intelligent applications, existing distributed machine learning (such as federated learning) still faces many challenges in the multi-source collaborative learning environment for Cloud-Edge fusion. Motivated by constructing the Cloud-Edge resource dynamic adapted collaborative learning paradigm and sustainable learning guarantee mechanism, this project focuses on the two fundamental scientific problems (i.e., the mismatch  of resource time-varying model, and the failure of scene-dynamic learning), and tries to address the key challenges including the controllability of resource environment, the decoupling-ability of model collaboration, the sustainability of dynamic evolution, and the balancing-ability of privacy efficiency. The research will be carried out from the aspects of resource system architecture, model decoupling methods, evolutional learning mechanism, and privacy enhancement technology, etc. that support distributed multi-source collaborative learning in the Cloud-Edge fusion environment. The objective of this project is to achieve a breakthrough in the distributed machine learning mode from \"Cloud training and Edge inference\" to \"Cloud-Edge collaborative training and inference\". The project will also develop a multi-source collaborative learning support platform for Cloud-Edge fusion based on domestic software and hardware environments, and carry out application verification in vertical fields such as water conservancy and power grid. l  “Cloud Computing Platform and Application over Next Generation ICT Infrastructure”, Provincial Key Research and Development Program of Jiangsu (No. BE 2017179), 2.4 mil. RMB, 2017.07-2020.06，PI l  “Virtualized Service Platform and Software Integration Tool for Cloud Computing”, Provincial High-Tech Research Program of Jiangsu (No. BE 2012179), 1.2 mil. RMB, 2010.05-2012.12，Co-PI l  “Ubiquitous Service Integration Techniques over Self-organized Dynamic Network Environment”, Provincial Natural Science Foundation of Jiangsu (No. BK2009231), 0.2 mil. RMB, 2009.06-2011.12，PI l  “Research on Key Techniques for Distributed Confusion Based IT Infrastructure and Platform”, Science and Technology Program of State Grid Corporation of China, 1.02 mil. RMB, 2017.01-2018.12，PI l  “Research on Key techniques for Distributed File System over Domestic Servers”, Science and Technology Program of State Grid Corporation of China, 0.8 mil. RMB, 2015.01-2016.12，PI l  “Research on Key techniques for Distributed Resource and File Management over Cloud Computing Environment and Its Application”, Science and Technology Program of State Grid Corporation of China, 1.5 mil. RMB, 2013.01-2014.12，PI Selected Publications [IEEE INFOCOM’25] Hengrui Cui, Zhihao Qu, Xinyu Wang, Bin Tang, and Baoliu Ye, “LCO-AGQ: A Lightweight Client-Oriented Adaptive Gradient Quantization Algorithm for Federated Learning”, Proceedings of International Conference on Computer Communications, 2025,  pp. 1~10. [IEEE ICPP’25] Junru Shen, Miao Cai, Kangyue Gao, Baoliu Ye, and Guo Cheng, “HeatList: The Case for Retrofitting In-memory Range Index with Hotspot Awareness”, Proceedings of the 54th International Conference on Parallel Processing, 2025, Accepted. [IEEE TMC’25] Yanyan Wang, Jia Liu, Zhihao Qu, Shenhuan Lyu, Bing Tang, Baoliu Ye, \"Time-Efficient Identifying Key Tag Distribution in Large-Scale RFID Systems\", IEEE Transactions on Mobile Computing, accepted. [IEEE TSC’25] Shihong Hu, Kaixin Zhang, Zhihao Qu, Baoliu Ye, \"SPAVM: A SFC Placement and VNF Migration Framework for VNF Instance Reuse in Vehicle-Infrastructure Collaboration\", IEEE Transactions on Services Computing, accepted. [IEEE TOS’25] Miao Cai, Junru Shen, and Baoliu Ye, \"Achieving Both Performance and Reliability in An Asymmetric File System on Disaggregated Persistent Memory\", ACM Transactions on Storage, accepted. [IEEE/ACM TON’25] Andong Zhu, Ji Qi, Sheng Zhang, Gangyi Luo, Ke Cheng, Xiaohang Shi, Zhuzhong Qian, Baoliu Ye, and Sanglu Lu, “Machine-Centric High-Accuracy Multi-Video Analytics with Adaptive Neural Codecs”, IEEE/ACM Transactions on Networking, accepted. [IEEE TMC’25] Mingtao Ji, Hehan Zhao, Lei Jiao, Sheng Zhang, Xin Li, Zhuzhong Qian, and Baoliu Ye, “Edge AI Inference as a Service via Dynamic Resources from Repeated Auctions”, IEEE Transactions on Mobile Computing, Vol. 24(9), pp. 7947~7964, 2025. [IEEE TMC’25] Shiyuan Ma, Lei Xie, Ch",
  "content_length": 26901,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:57"
}