{
  "name": "Baowen Xu",
  "homepage": "https://cs.nju.edu.cn/xubaowen",
  "status": "success",
  "content": "Baowen Xu's Homepage Docs » Home Welcome to Baowen Xu's Homepage Biography Baowen Xu received the bachelor's, master's, and PhD degrees in computer science from Wuhan University, Huazhong University of Science and Technology, and Beihang University in 1982, 1985 and 2002. He is currently a professor with the Department of Computer Science and Technology, Nanjing University. His major research interests are programming languages, software testing, software maintenance, and software metrics. He has published extensively in premiere software engineering journals and conferences such as TOSEM, TSE, JSS, TR, ICSE, FSE, ICSME, ICST, etc. He is the Fellow of the CCF and the Distinguished Young Scholars of NSFC(2004). Education Ph.D., Computer Science and Technology, Beihang University, September 1998 ~ June 2002 M.S., Computer Science, Huazhong University of Science and Technology, February 1982 ~ December 1984 B.S., Computing Technology, Wuhan University, February 1978 ~ January 1982 Working Experience December 2008 ~ present, Department of Computer Science and Technology, Nanjing University, China, Professor, PhD supervisor April 1994 ~ December 2008, School of Computer Science and Engineering, Southeast University, China, Professor, PhD supervisor August 1986 ~ March 1994, Department of Computer, Nanjing University Of Aeronautics And Astronautics, China, Lecture, Associate Professor December 1984 ~ May 1986, China State Shipbuilding Corporation, Research Scientist/Project Leader Address Baowen Xu Office: Rm 701, Computer Science Building, Nanjing University Xianlin Campus National Key Laboratory for Novel Software Technology Nanjing University, Xianlin Campus Mailbox 603 163 Xianlin Avenue, Qixia District URL: http://cs.nju.edu.cn/xubaowen/ Nanjing 210023, China Selected Publications [Google Scholar] [DBLP] [ORCID] [IEEE] Journals Peng Zhang, Yanhui Li, Wanwangying Ma, Yibiao Yang, Lin Chen, Hongmin Lu, Yuming Zhou, Baowen Xu. CBUA: A probabilistic, predictive, and practical approach for evaluating test suite effectiveness. IEEE Trans. Software Eng. Accepted. Weijun Shen, Yanhui Li, Yuanlei Han, Lin Chen, Di Wu, Yuming Zhou, Baowen Xu: Boundary sampling to boost mutation testing for deep learning models. Inf. Softw. Technol. 130: 106413 (2021) Xiaoyuan Xie, Zhiyi Zhang, Tsong Yueh Chen, Yang Liu, Pak-Lok Poon, Baowen Xu: METTLE: A METamorphic Testing Approach to Assessing and Validating Unsupervised Machine Learning Systems. IEEE Trans. Reliab. 69(4): 1293-1322 (2020) Zhaoqiang Guo, Yanhui Li, Wanwangying Ma, Yuming Zhou, Hongmin Lu, Lin Chen, Baowen Xu: Boosting crash-inducing change localization with rank-performance-based feature subset selection. Empir. Softw. Eng. 25(3): 1905-1950 (2020) Lin Chen, Di Wu, Wanwangying Ma, Yuming Zhou, Baowen Xu, Hareton Leung: How C++ Templates Are Used for Generic Programming: An Empirical Study on 50 Open Source Systems. ACM Trans. Softw. Eng. Methodol. 29(1): 3:1-3:49 (2020) Weiqin Zou, David Lo, Zhenyu Chen, Xin Xia, Yang Feng, Baowen Xu: How Practitioners Perceive Automated Bug Report Management Techniques. IEEE Trans. Software Eng. 46(8): 836-862 (2020) Chuanqi Wang, Yanhui Li, Lin Chen, Wen-Chin Huang, Yuming Zhou, Baowen Xu: Examining the effects of developer familiarity on bug fixing. J. Syst. Softw. 169: 110667 (2020) Weiqin Zou, Jifeng Xuan, Xiaoyuan Xie, Zhenyu Chen, Baowen Xu: How does code style inconsistency affect pull request integration? An exploratory study on 117 GitHub projects. Empir. Softw. Eng. 24(6): 3871-3903 (2019) Zhiqiang Li, Xiao-Yuan Jing, Xiaoke Zhu, Hongyu Zhang, Baowen Xu, Shi Ying: On the Multiple Sources and Privacy Preservation Issues for Heterogeneous Defect Prediction. IEEE Trans. Software Eng. 45(4): 391-411 (2019) Gongzheng Lu, Lei Xu, Yibiao Yang, Baowen Xu: Predictive analysis for race detection in software-defined networks. Sci. China Inf. Sci. 62(6): 62101:1-62101:20 (2019) Jingxuan Tu, Xiaoyuan Xie, Tsong Yueh Chen, Baowen Xu: On the analysis of spectrum based fault localization using hitting sets. J. Syst. Softw. 147: 106-123 (2019) Zhiqiang Li, Xiao-Yuan Jing, Xiaoke Zhu, Hongyu Zhang, Baowen Xu, Shi Ying: Heterogeneous defect prediction with two-stage ensemble learning. Autom. Softw. Eng. 26(3): 599-651 (2019) Zhiqiang Li, Xiao-Yuan Jing, Fei Wu, Xiaoke Zhu, Baowen Xu, Shi Ying: Cost-sensitive transfer kernel canonical correlation analysis for heterogeneous defect prediction. Autom. Softw. Eng. 25(2): 201-245 (2018) Yuming Zhou, Yibiao Yang, Hongmin Lu, Lin Chen, Yanhui Li, Yangyang Zhao, Junyan Qian, Baowen Xu: How Far We Have Progressed in the Journey? An Examination of Cross-Project Defect Prediction. ACM Trans. Softw. Eng. Methodol. 27(1): 1:1-1:51 (2018) Zhifei Chen, Lin Chen, Wanwangying Ma, Xiaoyu Zhou, Yuming Zhou, Baowen Xu: Understanding metric-based detectable smells in Python software: A comparative study. Inf. Softw. Technol. 94: 14-29 (2018) Zhifei Chen, Wanwangying Ma, Wei Lin, Lin Chen, Yanhui Li, Baowen Xu: A study on the changes of dynamic feature code when fixing bugs: towards the benefits and costs of Python dynamic features. Sci. China Inf. Sci. 61(1): 012107:1-012107:18 (2018) Yangyang Zhao, Yibiao Yang, Hongmin Lu, Jinping Liu, Hareton Leung, Yansong Wu, Yuming Zhou, Baowen Xu: Understanding the value of considering client usage context in package cohesion for fault-proneness prediction. Autom. Softw. Eng. 24(2): 393-453 (2017) Yangyang Zhao, Hareton Leung, Yibiao Yang, Yuming Zhou, Baowen Xu: Towards an understanding of change types in bug fixing code. Inf. Softw. Technol. 86: 37-53 (2017) Xiao-Yuan Jing, Fei Wu, Xiwei Dong, Baowen Xu: An Improved SDA Based Defect Prediction Framework for Both Within-Project and Cross-Project Class-Imbalance Problems. IEEE Trans. Software Eng. 43(4): 321-339 (2017) Fumin Qi, Xiao-Yuan Jing, Xiaoke Zhu, Xiaoyuan Xie, Baowen Xu, Shi Ying: Software effort estimation based on open source projects: Case study of Github. Inf. Softw. Technol. 92: 145-157 (2017) Zhiyi Zhang, Zhenyu Chen, Ruizhi Gao, W. Eric Wong, Baowen Xu: An empirical study on constraint optimization techniques for test generation. Sci. China Inf. Sci. 60(1): 12105 (2017) Qingkai Shi, Jeff Huang, Zhenyu Chen, Baowen Xu: Verifying Synchronization for Atomicity Violation Fixing. IEEE Trans. Software Eng. 42(3): 285-301 (2016) Qingkai Shi, Zhenyu Chen, Chunrong Fang, Yang Feng, Baowen Xu: Measuring the Diversity of a Test Set With Distance Entropy. IEEE Trans. Reliab. 65(1): 19-27 (2016) Qinbao Song, Xiaoyan Zhu, Guangtao Wang, Heli Sun, He Jiang, Chenhao Xue, Baowen Xu, Wei Song: A machine learning based software process model recommendation method. J. Syst. Softw. 118: 85-100 (2016) Wanwangying Ma, Lin Chen, Yibiao Yang, Yuming Zhou, Baowen Xu: Empirical analysis of network measures for effort-aware fault-proneness prediction. Inf. Softw. Technol. 69: 50-70 (2016) Yibiao Yang, Yangyang Zhao, Changsong Liu, Hongmin Lu, Yuming Zhou, Baowen Xu: An empirical investigation into the effect of slice types on slice-based cohesion metrics. Inf. Softw. Technol. 75: 90-104 (2016) Di Wu, Lin Chen, Yuming Zhou, Baowen Xu: An extensive empirical study on C++ concurrency constructs. Inf. Softw. Technol. 76: 1-18 (2016) Lin Chen, Wanwangying Ma, Yuming Zhou, Lei Xu, Ziyuan Wang, Zhifei Chen, Baowen Xu: Empirical analysis of network measures for predicting high severity software faults. Sci. China Inf. Sci. 59(12): 122901:1-122901:18 (2016) Yibiao Yang, Yuming Zhou, Hongmin Lu, Lin Chen, Zhenyu Chen, Baowen Xu, Hareton K. N. Leung, Zhenyu Zhang: Are Slice-Based Cohesion Metrics Actually Useful in Effort-Aware Post-Release Fault-Proneness Prediction? An Empirical Study. IEEE Trans. Software Eng. 41(4): 331-357 (2015) Debiao He, Sherali Zeadally, Baowen Xu, Xinyi Huang: An Efficient Identity-Based Conditional Privacy-Preserving Authentication Scheme for Vehicular Ad Hoc Networks. IEEE Trans. Inf. Forensics Secur. 10(12): 2681-2691 (2015) Yangyang Zhao, Yibiao Yang, Hongmin Lu, Yuming Zhou, Qinbao Song, Baowen Xu: An empirical analysis of package-modularization metrics: Implications for software fault-proneness. Inf. Softw. Technol. 57: 186-203 (2015) Peng Wang, Baowen Xu, Yurong Wu, Xiaoyu Zhou: Link prediction in social networks: the state-of-the-art. Sci. China Inf. Sci. 58(1): 1-38 (2015) Yuming Zhou, Baowen Xu, Hareton Leung, Lin Chen: An in-depth study of the potentially confounding effect of class size in fault prediction. ACM Trans. Softw. Eng. Methodol. 23(1): 10:1-10:51 (2014) Yuming Zhou, Yibiao Yang, Baowen Xu, Hareton Leung, Xiaoyu Zhou: Source code size estimation approaches for object-oriented systems from UML class diagrams: A comparative study. Inf. Softw. Technol. 56(2): 220-237 (2014) Lin Chen, Ju Qian, Yuming Zhou, Peng Wang, Baowen Xu: Identifying extract class refactoring opportunities for internetware. Sci. China Inf. Sci. 57(7): 1-18 (2014) Xiaoyuan Xie, Tsong Yueh Chen, Fei-Ching Kuo, Baowen Xu: A theoretical analysis of the risk evaluation formulas for spectrum-based fault localization. ACM Trans. Softw. Eng. Methodol. 22(4): 31:1-31:40 (2013) Xiaoyuan Xie, W. Eric Wong, Tsong Yueh Chen, Baowen Xu: Metamorphic slice: An application in spectrum-based fault localization. Inf. Softw. Technol. 55(5): 866-879 (2013) Ju Qian, Lin Chen, Baowen Xu: Finding shrink critical section refactoring opportunities for the evolution of concurrent code in trustworthy software. Sci. China Inf. Sci. 56(1): 1-20 (2013) Dazhou Kang, Baowen Xu, Yanhui Li: A fuzzy extension for SHOIQ based on comparisons between degrees of membership. Sci. China Inf. Sci. 56(8): 1-11 (2013) Yuming Zhou, Hareton Leung, Qinbao Song, Jianjun Zhao, Hongmin Lu, Lin Chen, Baowen Xu: An in-depth investigation into the relationships between structural metrics and unit testability in object-oriented systems. Sci. China Inf. Sci. 55(12): 2800-2815 (2012) Hongmin Lu, Yuming Zhou, Baowen Xu, Hareton Leung, Lin Chen: The ability of object-oriented metrics to p",
  "content_length": 22615,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:57"
}