{
  "name": "Baoxiang Wang 0001",
  "homepage": "http://bxiangwang.github.io",
  "status": "success",
  "content": "Baoxiang Wang Baoxiang Wang Baoxiang Wang Assistant Professor, The Chinese University of Hong Kong, Shenzhen Email Google Scholar LinkedIn Github I am an assistant professor at School of Data Science, The Chinese University of Hong Kong, Shenzhen. I work on the broad areas of reinforcement learning, online learning, and learning theory. My recent works have a specific focus on game theoretic settings. I obtained my Ph.D. in Computer Science and Engineering from The Chinese University of Hong Kong in 2020, fortunate to be advised by Siu On Chan and Andrej Bogdanov. Before that, I obtained my B.E. in Information Security from Shanghai Jiao Tong University in 2014, under Hai Zhao. I was visiting Vector Institute as a visiting researcher during Jan-Aug 2024, with Yaoliang Yu, and University of Waterloo as a visiting assistant professor during May-Aug 2023, with Pascal Poupart. Education 2014 - 2020 Ph.D. The Chinese University of Hong Kong 2010 - 2014 B.E. Shanghai Jiao Tong University Some topics I am currently investigating Markov decision process and its guarantees in regret bound, convergence, and game-theoretic properties Understanding and learning incentive mechanism design and information design among multiple intelligent agents Efficient methods in solving games, including gradient-based, learning-based, LLM-based solvers Other topics in learning theory and game theory that I find interesting Prospective students I am recruiting PhD students for Fall 2025 enrollment. The degree will be issued by CUHK for PhD in Computer Science or PhD in Data Science, with a mark that the study in completed in the Shenzhen campus. The programs are similar to the ones in Hong Kong. See the program information. For candidates, I care mostly about their math background and their motivation on working on new and explorative problems. We emphasize novelty in research, including new problem settings, new key lemmas, and applications of advanced tools in mathematics. I also host postdocs and visitors, with similar qualifications, if you are willing to spend at least a year with us. Contact Office: 503 DY, CUHK Shenzhen. Shenzhen, 518172 Phone: +86 755 235-17020",
  "content_length": 2179,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:58"
}