{
  "name": "Baoyuan Wu",
  "homepage": "https://sites.google.com/site/baoyuanwu2015/home",
  "status": "success",
  "content": "Baoyuan WuSearch this siteEmbedded FilesSkip to main contentSkip to navigationWelcome to my homepageCurrently I am Tenured Associate Professor, and Assistant Dean (research) of School of Artificial Intelligence (I moved from School of Data Science on October, 2025), the Chinese University of Hong Kong, Shenzhen (CUHK-Shenzhen). From November 2016 to August 2020, I was a Senior and Principal Researcher at Tencent AI lab. From August 2014 to November 2016, I was a Postdoc in KAUST, working with Prof. Bernard Ghanem. On June 2014, I received the PhD degree from the National Laboratory of Pattern Recognition, Institute of Automation, Chinese Academy of Sciences, supervised by Prof. Baogang Hu. I was a visiting student in Prof. Qiang Ji's lab of Rensselaer Polytechnic Institute, from September 2011 to September 2013. I am Senior Member of IEEE. I am the director of Longgang District Key Laboratory of Intelligent Digital Economy Security (iDES，龙岗区智能数字经济安全重点实验室). My research interests are trustworthy AI, generative AI, machine learning, computer vision, optimization, such as adversarial examples, backdoor learning, federated learning, face image editing/manipulation/generation, deepfake detection, etc. Email: wubaoyuan1987@gmail.com; wubaoyuan@cuhk.edu.cn Job openingsI am recruiting PhD and Master students to start at 2026 Fall. If you are interested in trustworthy AI, generative AI, machine learning, computer vision, optimization, and have solid mathematical foundations and experienced programming skills,  please send me email. I am also recruiting Postdoc  Researcher (博士后), Visiting Students (master or PhD students) (访问学生). News2025/11/30 -- 1 paper “Versatile Backdoor Attack with Visible, Semantic, Sample-specific and Compatible Triggers” is accepted to TPAMI 2025. Congrats to all my students and collaborators! 2025/11/20 -- I am invited as an Area Chair of ICML 2026.2025/10/05 -- I am appointed as Senior Area Editor of IEEE Transactions on Information Forensics and Security (TIFS). 2025/09/18 -- 1 paper \"X2-DFD: A framework for eXplainable and eXtendable Deepfake Detection\" is accepted to NeurIPS 2025. 2025/09/10 -- Our survey \"Defenses in Adversarial Machine Learning: A Systematic Survey from the Lifecycle Perspective\" is accepted to TPAMI 2025. Congrats to all collaborators! 2025/09/05 -- 1 paper \"Task-Distributionally Robust Data-Free Meta-Learning\" is accepted to TPAMI 2025. Congrats to all collaborators!2025/08/25 -- Our survey \"Attacks in Adversarial Machine Learning: A Systematic Survey from the Lifecycle Perspective\" is accepted to IJCV 2025. Congrats to all collaborators!2025/08/16 -- I am invited as Area Chairs of ICLR 2026 and CVPR 2026.2025/07/18 -- 1 paper \"Hiding Faces in Plain Sight: Defending DeepFakes by Disrupting Face Detection\" is accepted to TDSC 2025. Congrats to Yuezun Li and all collaborators. 2025/06/26 -- 1 paper \"BadVideo: Stealthy Backdoor Attack against Text-to-Video Generation\" is accepted to ICCV 2025. Congrats to Ruotong Wang and all collaborators. 2025/06/19 -- I am invited as an Area Chair of AAAI 2026.2025/06/18 -- I am honored to deliver a Keynote talk at The 13th ACM Workshop on Information Hiding and Multimedia Security (ACM IH\\&MMSec 25), and the talk title is \"Generalizable and Explainable Deepfake Detection in the Era of Large Language Models\".  2025/05/19 -- Our benchmark of black-box and transfer-based adversarial attacks, \"BlackboxBench: A Comprehensive Benchmark of Black-box Adversarial Attacks\" has been accepted to TPAMI 2025. Congrats to all students contributing to this work!2025/05/15 -- 2 papers about LLM copyright protection are accepted to ACL 2025 (1 Main, 1 Findings). Congrats to Zongqi Wang and all collaborators. 2025/05/01 -- 1 paper \"Orthogonal Subspace Decomposition for Generalizable AI-Generated Image Detection\" is accepted to ICML 2025 as Spotlight. Congrats to Zhiyuan Yan and all collaborators. 2025/03/29 -- The second version of BackdoorBench, \"BackdoorBench: A Comprehensive Benchmark and Analysis of Backdoor Learning\", is accepted to IJCV 2025. Congrats to all contributors. 2025/03/13 -- 1 paper \"Smart Touchless Palm Sensing via Palm Adjustment and Dynamic Registration\" is accepted to Nature Communications. Congrats to Professor David Zhang and Dandan Fan, and all other collaborators. 2025/02/26 -- 1 paper \"SIDA: Social Media Image Deepfake Detection, Localization and Explanation with Large Multimodal Model\" is accepted to CVPR 2025. 2025/02/17 -- I am invited as an Area Chair of NeurIPS 2025.2025/01/22 -- 1 paper \"Activation Gradient based Poisoned Sample Detection Against Backdoor Attacks\" is accepted to ICLR 2025. 2024/12/10 -- 2 papers are accepted to AAAI 2025, covering CLIP model and deepfake detection. Congrats to all collaborators. 2024/11/22 -- I am invited as an Area Chair of ICML 2025.2024/11/19 -- I am awarded \"2023 Young Researcher Award of The Chinese University of Hong Kong, Shenzhen\" (2023年度香港中文大学(深圳)青年科研奖)2024/09/26 -- 3 papers are accepted to NeurIPS 2024, covering two backdoor defenses, and one deepfake detection. Congrats to all students and collaborators. 2024/09/19 -- I will serve as Associate Editor for IEEE Transactions on Information Forensics and Security (TIFS).2024/09/14 -- I am invited as an Area Chair of CVPR 2025.2024/08/07 -- I am invited as an Area Chair of ICLR 2025.2024/05/17 -- I am invited as an Area Chair of AAAI 2025.2024/04/25 -- 1 paper \"Regional Adversarial Training for Better Robust Generalization\" is accepted to IJCV. Congrats to all collaborators.2024/03/27 -- I am invited as an Area Chair of NeurIPS 2024, and NeurIPS 2024 Datasets and Benchmarks Track. 2024/03/15 -- 1 paper \"Improving Fast Adversarial Training with Prior-Guided Knowledge\" is accepted to TPAMI. Congrats to Dr. Xiaojun Jia and all collaborators.2024/02/27 -- 3 papers are accepted to CVPR 2024, covering backdoor attack, deepfake detection and federated learning. Congrats to all students and collaborators. 2024/01/16 -- 1 paper \"VDC: Versatile Data Cleanser for Detecting Dirty Samples via Visual-Linguistic Inconsistency\" is accepted to ICLR. A very simple but highly effective approach for detecting any kind of noisily labeled samples (e.g., poisoned samples, samples with random noisy labels), based on the Visual-Linguistic matching capability of multi-modal large models. Congrats to all my student Zihao Zhu and all collaborators!2023/12/07 -- I am invited as an Area Chair of ICML 2024. 2023/10/31 -- 1 paper \"Imperceptible and Robust Backdoor Attack in 3D Point Cloud\" is accepted to TIFS. Congrats to Kuofeng Gao, Jiawang Bai, and all collaborators.2023/10/11 -- I am elected as the Senior Member of IEEE. 2023/10/03 -- The \"Tutorial on Backdoor Learning: Recent Advances and Future\" has been successfully presented at ICCV 2023 in Paris. The tutorial website is here. 2023/09/22 -- 3 papers are accepted by NeurIPS 2023, including two backdoor defense works in main track, and one deepfake benchmark (DeepfakeBench ) in the Datasets and Benchmark Track. Congrats to all my students and collaborators!2023/08/15 -- I am invited as an Area Chairs of ICLR 2024, AISTATS 2024, and WACV 2024. 2023/08/13 -- I am invited as an Area Chair of CVPR 2024. 2023/07/14 -- Four papers are accepted to ICCV 2023, as well as one tutorial named \"Backdoor Learning: Recent Advances and Future Trends\". Congrats to all students and collaborators. 2023/07/08 -- DeepfakeBench (a benchmark for deepfake detection) has been released. 2023/07/06 -- Our work \"Versatile Weight Attack via Flipping Limited Bits\" is accepted to TPAMI. Congrats to Jiawang Bai and all collaborators.2023/06/07 -- I am invited as an Area Chair of NeurIPS 2023 Datasets and Benchmarks Track. 2023/05/19 -- I am invited as an Area Chair of AAAI 2024. 2023/05/11 -- 1 paper \"Robust and Generalized Physical Adversarial Attacks via Meta-GAN\" is accepted to IEEE Transactions on Information Forensics & Security.2023/04/25 -- 1 paper \"Learning to Learn from APIs: Black-box Data-free Meta-Learning\" is accepted to ICML 2023.2023/04/21 -- 1 paper \"TAT: Targeted Backdoor Attacks against Visual Object Tracking\" is accepted to Pattern Recognition. 2023/04/14 -- We (me, Bernard Ghanem and Hasan Hammoud) will give a tutorial named \"Backdoor Learning: Recent Advances and Future Trends\" on Oct. 3 at ICCV 2023. See you in Paris :)2023/04/12 --  BackdoorBench v2.0 has been released, with significant updates on codes, methods, and analysis tools. 2023/04/02 -- One paper is accepted to SIGGRAPH 2023. Congrats to Yanbo Fan and all collaborators.2023/03/27 -- Our website \"Adversarial Machine Learning\" has been released at http://adversarial-ml.com/ .2023/02/28 -- I am invited as an Area Chair of NeurIPS 2023. 2023/02/28 -- 1 paper \"DropMAE: Masked Autoencoders with Spatial-Attention Dropout for Tracking Tasks\" is accepted to CVPR 2023. 2023/02/21 -- Our survey \"Adversarial Machine Learning: A Systematic Survey of Backdoor Attack, Weight Attack and Adversarial Example\" has been released. 2022/12/20 -- I am invited as an Area Chair of ICML 2023. 2022/09/17 -- Our BackdoorBench is accepted to NeurIPS 2022 Datasets and Benchmarks Track. Congrats to all contributed students and collaborators.2022/09/15 -- Two works about transfer-based adversarial attack and backdoor defense are accepted to NeurIPS 2022.  Congrats to Yanbo Fan, Zeyu Qin and Weixin Chen. 2022/08/27 -- Our work \"Robust Physical-World Attacks on Face Recognition\" is accepted to Pattern Recognition. Congrats to Xin Zheng and Yanbo Fan. 2022/08/10 -- I am invited as an Area Chair of ICLR 2023. 2022/07/21 -- Our latest work about black-box adversarial attack has been accepted to TPAMI. Congratulations to all co-authors.2022/07/04 -- 3 papers about adversarial training, black-box attack, talking face generation are accepted to ECCV 2022.  2022/05/28 -- 1 paper about adversarial training is accepted to TIP. 2022/04/06 -- BackdoorBench (a benchmark for backdoor learning) and Blackb",
  "content_length": 46101,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:58"
}