{
  "name": "Baptiste Jeudy",
  "homepage": "http://perso.univ-st-etienne.fr/jeudbapt",
  "status": "success",
  "content": "Page de Baptiste Jeudy Baptiste Jeudy, associate professor (maître de conférences) at Université de Saint-Étienne since 2006. Member of the machine learning group of the Hubert Curien laboratory. Tel : +33 (0)4 77 91 57 99 Email : baptiste point jeudy at univ-st-etienne point fr Adress : Laboratoire Hubert Curien UMR CNRS 5516, Bâtiment F 18, Rue du Pr. B. Lauras, 42000 Saint-Etienne, France Directions to the lab. Enseignement / Teaching Responsable de la licence professionnelle ATII (animateur des technologies de l'information et de l'internet). Algorithmique en licence pro ATII. Introduction à l'informatique en L1. Systèmes d'exploitation et réseaux en L2 informatique. Algorithmique des graphes en L2 informatique. Architecture des ordinateurs en L2 informatique. sujet du tp1 Data Mining 1 en master Web Intelligence et master MLDM. Research Local Chair of the Fourteenth International Symposium on Intelligent Data Analysis (IDA 2015) organized in St-Etienne (22-24 oct. 2015). Member of the ANR project SoLSTiCe (2014-2018). Past projects : ANR MDCO BINGO2 project (2008-2011): resp. for St-Etienne partner. ACI Masse de Données BINGO project (2004-2007): member. European project cInQ FET IST-2000-26469 (2001-2004): member. Research Domains Data-mining, graph mining, application to tracking in videos. See our main papers, datasets and code. Grammatical inference. Students co-supervision Romain Deville (PhD, ANR Solstice) 2014-? Fabien Diot (PhD, CIFRE Alcatel Lucent Bell Labs) 2011-2014 Hoang-Tung Tran (PhD, USTH), 2010-2014 Romain Deville (Master 2 INSA), 2014 Adrien Martins (Master 2 WI), 2012 Fabien Diot (Master 2 WI), 2010 Christopher Grand (Master 1 WI), 2009 Publications since 2004 See also DBLP. Publications before 2004 Book Chapter J-F. Boulicaut, B. Jeudy. Constraint-Based Data Mining. In O. Maimon, L. Rokach (Eds.): The Data Mining and Knowledge Discovery Handbook, pp. 399-416, 2005, Springer. International Journals B. Jeudy, J-F. Boulicaut. Optimization of association rule mining queries. Intelligent Data Analysis, 6(4):341-357, 2002. IOS Press. C. Becquet, S. Blachon, B. Jeudy, J-F. Boulicaut, O. Gandrillon. Strong association rule mining for large gene expression data analysis: a case study on human SAGE data. Genome Biology, 3(12) 2002. 16 pages. Available on line. BioMed Central Ltd. Conferences B. Jeudy, F. Rioult. Database transposition for constrained closed pattern mining. In Proceedings of the third International Workshop on Knowledge Discovery in Inductive Databases (KDID 2004 ) co-located with ECML-PKDD, Pise, Italy, September 2004, 12 pages. pdf. B. Jeudy, J-F. Boulicaut. Using condensed representations for interactive association rule mining. in: Proceedings of the 6th European conferences on Principles and practice of Knowledge Discovery in Databases ECML/PKDD 2002 , Helsinki, 19-23 August 2002. Springer-Verlag LNAI 2431, pp. 225-236. © Springer-Verlag. pdf. B. Jeudy, J-F. Boulicaut. Constraint-based discovery and inductive queries: application to association rule mining. in: Proceedings of the European Science Foundation Exploratory Workshop on Pattern Detection and Discovery in Data Mining, volume 2447 of Lecture Notes in Computer Science, pages 110-124, Imperial College, London. 16-18 September 2002. Berlin : © Springer-Verlag. pdf. J-F. Boulicaut, B. Jeudy. Mining Free Sets under Constraints. In: Proceedings of the International Database Engineering and Applications Symposium IDEAS'01, Grenoble (F), July 2001, IEEE Computer Press. pp. 322-329. © IEEE Computer Press.. pdf. J-F. Boulicaut, B. Jeudy. Constraint-based discovery of a condensed representation for frequent patterns. In: Proceedings of the Workshop Database Support for KDD co-located with the 5th European Conference on Principles and Practice of Knowledge Discovery in Databases PKDD'01, Freiburg (Germany), September 7, 2001. pp. 3-13. pdf. J-F. Boulicaut, A. Bykowski, and B. Jeudy. Towards the Tractable Discovery of Association Rules with Negations. In: Proceedings of the Fourth International Conference on Flexible Query Answering Systems FQAS'00, Warsaw (Poland), October 25-28, 2000. Physica-Verlag, Advances in Soft Computing. pp. 425-434. © Physica-Verlag. pdf. National Conferences J-F. Boulicaut, B. Jeudy. Using Constraints during Itemset Mining: should we Prune or not? In: Actes des Seizième Journées Bases de Données Avancées BDA'00, Blois (F), 24-27 Octobre 2000. pp. 221-237. pdf. Thèse Baptiste Jeudy, Thèse : Optimisation de requêtes inductives : application à l'extraction sous contraintes de règles d'association, 153 pages. Soutenue le 13 décembre 2002 à L'INSA de Lyon. Version postscript ou pdf, Transparents de la soutenance. Page valide xhtml 1.0 strict.",
  "content_length": 4734,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:01"
}