{
  "name": "Barak A. Pearlmutter",
  "homepage": "https://golconda.cs.nuim.ie/~barak",
  "status": "success",
  "content": "Barak Pearlmutter Homepage Barak Pearlmutter, PhD Onboarding If you are interested in being a student in my lab: any available funded positions will be advertised via the appropriate university portal. I do not in general sponsor IRC Masters Scholarship applications. If you are doing a final year or masters project with me, read this. Professional I'm the principal of our Brain and Computation Lab. Interests Adaptive systems, neural Networks, how the brain works, machine learning, acoustic source separation and localization, neuroscience, programming language design and implementation. You can view a short demo page. Employment I am a professor in the Department of Computer Science. at NUI Maynooth in Co. Kildare, Ireland, with some sort of vague affiliation with the Hamilton Institute. I was a professor in the Department of Computer Science at the University of New Mexico in Albuquerque, with adjunct appointments in the Department of Neurosciences and the Department of Electrical and Computer Engineering. Publications The communal memory of science. Teaching Present Teaching Schedule, Spring 2026: Wed: 10:00–12:00 CS637 (Reinforcement Learning) Fri: 09:00–11:00 CS353 (Automata Theory) Alternative Futures That Never Occurred Anticipated future \"special topics\" courses: sparse methods in signal processing and machine learning, algorithmic differentiation, information geometry, source separation, computational aspects of magnetoencephalography, program specialization aka partial evaluation. Rants and Randomness Giving away money I was co-organizer of the Abbadingo One DFA Learning Competition, which ended on Nov 15, 1997. If you are interested in language induction you should have a look. A follow-up continuous competition called Gowachin has been running for some years, and is able to automatically track improvements in the state of the art. My PGP public key. Key fingerprint = 64F4 29E3 6EA1 1CC2 D966 546F 125B 5747 5E19 0D18 Art My ceramic art combines wheel thrown techniques and hand building to play at the ago old tension in pottery between doing something and saying something. Randomness Mastodon Barak Pearlmutter <barak@pearlmutter.net> Department of Computer Science & Hamilton Institute National University of Ireland Maynooth Maynooth, Co. Kildare Ireland",
  "content_length": 2305,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:01"
}