{
  "name": "Barbara Liskov",
  "homepage": "https://www.csail.mit.edu/user/971",
  "status": "success",
  "content": "Barbara Liskov | MIT CSAIL Skip to main content PI Core/Dual Barbara Liskov Institute Professor Email liskov@csail.mit.edu Phone 253-5886 Barbara Liskov is an Institute Professor and head of the Programming Methodology Group. Liskov's research interests lie in programming methodology, programming languages and systems, and distributed computing. Major projects include: the design and implementation of CLU, the first language to support data abstraction; the design and implementation of Argus, the first high-level language to support implementation of distributed programs; and the Thor object-oriented database system, which provides transactional access to persistent, highly-available objects in wide-scale distributed environments. Her current research interests include Byzantine-fault-tolerant storage systems, peer-to-peer computing, and support for automatic deployment of software upgrades in large-scale distributed systems. Liskov is a member of the National Academy of Engineering, and a fellow of the American Academy of Arts and Sciences, and the Association for Computer Machinery. She received The Society of Women Engineers' Achievement Award in 1996 and the IEEE von Neumann medal in 2004. At the ACM SIGPLAN Programming Languages Design and Implementation Conference in 2008, she was awarded the Programming Languages Achievement Award. In 2009, she received the A.M. Turing Award from ACM. Related Links Website Last updated Nov 22 '24 Related Links Website Groups Community of Research Systems Community of Research The Systems CoR is focused on building and investigating large-scale software systems that power modern computers, phones, data centers, and networks, including operating systems, the Internet, wireless networks, databases, and other software infrastructure. +23 Michael Cafarella Leads Michael Cafarella Research Areas Computer Architecture Programming Languages & Software Engineering Security & Cryptography Systems & Networking Impact Areas Big Data Cybersecurity Internet of Things Transportation Wireless Lead Michael Cafarella +23 Michael Cafarella Research Group Programming Methodology Group We develop innovative approaches for building software and for solving problems in modern parallel and distributed software systems. Barbara Liskov Leads Barbara Liskov Research Areas Programming Languages & Software Engineering Impact Areas Big Data Lead Barbara Liskov Barbara Liskov",
  "content_length": 2428,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:03"
}