{
  "name": "Barbara J. Grosz",
  "homepage": "http://grosz.seas.harvard.edu",
  "status": "success",
  "content": "Barbara J. Grosz | Barbara J. Grosz Skip to main content arrow_circle_down Barbara J. Grosz ResearchArtificial Intelligence Collaborative Planning and Human-Computer CommunicationProfessor Grosz’s research in Artificial Intelligence (AI) aims to develop the capabilities needed for computer-agent systems to function as intelligent, helpful team members over the long term and in uncertain, dynamic environments. It aspires to understand thinking and intelligence in ways that enable the construction of computer systems capable of acting intelligently and to inform the design of such systems. Professor Grosz’s contributions to AI include pioneering research in natural language processing and in theories of multi-agent collaboration and their application to human-computer interaction.Professor Grosz’s groundbreaking contributions to the field of natural-language processing include developing the first computational theories of natural-language dialogue and demonstrating their usefulness in spoken language systems. Her contributions to multi-agent systems include development of the first computational model of collaboration and, with her students, design of novel algorithms for information sharing in support of teamwork. This work has provided foundations for constructing systems able to communicate fluently with people and to work well with each other and their users. Such capabilities are essential for systems to be helpful assistants and partners on achieving users’ goals. Her research group has used the models developed in this research to design algorithms for improving health care coordination and science education.A member of the National Academy of Engineering and the American Philosophical Society, Professor Grosz is a fellow of the American Academy of Arts and Sciences, the Association for the Advancement of Artificial Intelligence, the Association for Computational Linguistics, the Association for Computing Machinery, and the American Association for the Advancement of Science, and a corresponding fellow of the Royal Society of Edinburgh. She received the 2009 ACM/AAAI Allen Newell Award, the 2015 IJCAI Award for Research Excellence, and the 2017 Association for Computational Linguistics Lifetime Achievement Award.Professor Grosz is known for her role in the establishment and leadership of interdisciplinary institutions She co-founded Stanford’s Center for the Study of Language and Information and was founding dean of science and then dean of Harvard’s Radcliffe Institute for Advanced Study, which developed the Academic Ventures Program under her leadership. She co-founded Harvard's Embedded Ethics program, which integrates teaching of ethical reasoning into core computer science courses.Professor Grosz is also known for her contributions to the advancement of women in science. She chaired Harvard FAS’s Standing Committee on Women, producing the 1990 Report on Women in Science. She subsequently chaired the 2005 Harvard Task Force on Women in Science and Engineering, producing a report comprehensive in its coverage of all Harvard schools and all levels of participation in the academy from undergraduate students to senior faculty.CVDownload Professor Grosz's CV here. (Please note:  Professor Grosz is not accepting any new Ph.D. students or postdoctoral fellows, and she is no longer supervising undergraduate research.)",
  "content_length": 3381,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:03"
}