{
  "name": "Barbara G. Ryder",
  "homepage": "http://people.cs.vt.edu/ryder",
  "status": "success",
  "content": "Dr. Barbara G. Ryder J. Byron Maupin Professor Emerita of Engineering Department of Computer Science College of Engineering Virginia Tech Email: ryder 'at' cs.vt.edu ryder \"at\" acm.org Short Biography Dr. Barbara G. Ryder is a emerita faculty member in the Department of Computer Science at Virginia Tech, where she held the J. Byron Maupin Professorship in Engineering. She received her A.B. degree in Applied Mathematics from Brown University (1969), her Masters degree in Computer Science from Stanford University (1971) and her Ph.D degree in Computer Science at Rutgers University (1982). From 2008-2015 she served as Head of the Department of Computer Science at Virginia Tech, and retired on September 1, 2016. Dr. Ryder served on the faculty of Rutgers from 1982-2008. She also worked in the 1970s at AT&T Bell Laboratories in Murray Hill, NJ. Dr. Ryder's research interests on static and dynamic program analyses for object-oriented systems, focus on usage in practical software tools for ensuring the quality and security of industrial-strength applications. Dr. Ryder became a Fellow of the ACM in 1998, received the NCWIT Harrold-Notkin Research and Graduate Mentoring Award (2021), received the IEEE Computer Society TCSE Distinguished Women in Science and Engineering Award (2018), received the ACM SIGSOFT Influential Educator Award (2015) and the ACM President's Award (2008), was selected as a CRA-W Distinguished Professor (2004), and received the ACM SIGPLAN Distinguished Service Award (2001). She has been an active leader in ACM (e.g., Vice President 2010-2012, Secretary-Treasurer 2008-2010; ACM Council 2000-2008; General Chair, FCRC 2003; Chair ACM SIGPLAN (1995-97)). She serves as a Member of the Board of Directors of the Computer Research Association (2014-present,1998-2001). Dr. Ryder has served as an editorial board member of ACM Transactions on Software Engineering and Methodology, ACM Transactions on Programming Languages and Systems, IEEE Transactions on Software Engineering, Software: Practice and Experience, and Science of Computer Programming. Dr. Ryder received the Virginia AAUW Woman of Achievement Award in 2014. She led the Department of Computer Science team which tied nationally for 2nd place in the 2016 NCWIT NEXT Awards. She is a founding member of the NCWIT VA/DC Aspirations in Computing Awards, having co-chaired these awards in 2012-13 and 2014-15 and having served on the organizing committee since 2011. She also was an executive champion for CS@VT in the NCWIT Pacesetters (2009-2015). CV (as of 9/18/2021) Google Scholar Page In rememberance of those slain 9/11/2001 We Remember 4/16/2007 Honors ACM Fellow, 1998 NCWIT Harrold-Notkin Research and Graduate Mentoring Award, 2021 IEEE Computer Society's TCSE 2018 Distinguished Women in Engineering and Science (WISE) Award Rutgers School of Arts and Sciences Computer Science Distinguished Alumni Award, 2016 Team leader for Department of Computer Science at Virginia Tech, which tied for 2nd place in the 2016 National Center for Women in Information Technology (NCWIT) Extension Services Transformation (NEXT) Awards, and received a $50,000 gift for continuing diversity activities. ACM SIGSOFT Influential Educator Award, 2015 Elected Member of Board of Directors of CRA, 2014-2017, (1998-2001) Woman of Achievement Award from Virginia AAUW, 2014 Elected ACM Vice President, 2010 ACM Presidential Award, 2008 Elected ACM Secretary-Treasurer, 2008 Graduate School Teaching Award, Rutgers Univeristy, New Brunswick, 2007 Rutgers University Leader in Diversity Award, 2006 Distinguished Program Committee Member Award, Conference on Foundations of Software Engineering (FSE), 2006 CRA-W Distinguished Professor, 2004 Professor of the Year, Computer Science Graduate Students Society (CSGSS) Award for Excellence in Teaching, Rutgers University, 2003 ACM SIGPLAN Distinguished Service Award, 2001 Keynote Speaker, 19th Asia-Pacific Enginering Conference (APSEC 2012); ACM India Annual Conference, Hyderabad, India (2011); International Conference on Compiler Construction, Warsaw, Poland (2003) Best of PLDI Collection 1970-1996, Landi-Ryder PLDI'92 Research My research group has been informally referred to as PROLANGS@VT the PROgramming LANGuageS research group. A full listing of publications from the group (and its predecessor at Rutgers University) is available here in reverse chronological order. Current Grants NSF Student Travel Grant for 2017 Programming Languages Mentoring Workshop (PLMW@SPLASH) at the ACM SIGPLAN SPLASH Conference, PI: Dr. Barbara G. Ryder. Talks/Lectures Here is my keynote talk on Blended Analysis for JavaScript at APSEC 2012. I was an invited instructor at ACACES 2007: Third International Summer School on Advanced Computer Architecture and Compilation for Embedded Systems, in L'Aquila, Italy, in July 2007. I taught a course in program analyses for object-oriented languages. My five lectures are available 2-up in PDF format here: Lecture 1 Lecture 2 Lecture 3 Lecture 4 Lecture 5 References During September 2006, I delivered a lecture at the International School on Software Engineering at the University of Salerno, entitled \"Practical Program Anlaysis for Object-oriented Software Tools\", available in PDF format in two parts (1) and (2). In April 2003, I was a keynote speaker at the International Conference on Compiler Construction, Warsaw, Poland. My talk there on Dimensions of Precision in Reference Analysis of Object-oriented Languages is available in PDF with the animations as a 4.5Mb file or without the animations printed 2-up as a .5Mb file. Service 2018-2021 External: --Served as a Coach with 2 mentees for the NSF CS4GradUS program, 2021-2023 --Served as a reviewer for the ACM India Outstanding Contributions in Computing by a Woman Award (2020, 2021) --Served on the HOPL-IV program committee, actively shepherding and reviewing papers; the conference occurred in conjunction with PLDI 2021. ---Organizer of the 2020 CRA Mentoring Workshop in February. ---In June 2020, finished 6 years on the CRA Board of Directors, and became an emerita member of the CRA-Education Committee. In 2019, I co-organized a CRA-E Teaching Professors Workshop at SIGCSE 2019 and I will help with the 2021 virtual workshop of the same name. ---In 2018, I was on the organizing committee of the Programming Languages Mentoring Workshop (PLMW@SPLASH) at SPLASH 2018 in Boston. Department: I continue to serve on the CS@VT Alumni Advisory Board and as Chair of its Alumni Awards Committee (until June 2020). A description of our alumni awards and several previous awardees can be found here. You can find the nomination form here. I also have been actively fund-raising for the CS@VT's diversity endowment fund, which at the end of 2020 attained a balance of more than $160,000 dollars. Community: My main volunteer focus is (i) the All Faiths Food Bank, although our monthly food pantry is closed now, due to COVID-19, we are bagging weekend snacks for children who are food insecure, and (ii) the League of Women Voters of Florida and LWV of Sarasota County. In LWVFL, I became a key volunteer in the LWVFL effort to help ex-felons in Florida register to vote, as Assistant to LWVFL President Cecile Scoon, Esq.. In this position, I administer the Volunteer Pro Bono Attorney Referral Program to match pro bono attorneys with ex-felons needing assistance to obtain their voting rights, and keep track of LWVFL online lawyer trainings on voting rights restoration. In LWVSRQ I participate in the Election Reform Committee and register voters. 2017 I am honored to be serving on the History of Programming Languages IV (HOPL-IV) program committee, having served on the HOPL-II PC and as co-program/general chair of HOPL-III (2007). I am co-chairing the Programming Languages Mentoring Workshop (PLMW@SPLASH) at SPLASH 2017 in Vancouver, with Lori Pollock. I was re-elected to the Computing Research Association (CRA) Board for a term from 2017-2020. As a member of the CRA-Education Committee, I am chairing the Undergraduate Research Faculty Mentoring Awards for 2017 and 2018. I currently serve on an ad hoc CRA Board committee concerned with addressing the problems experienced by underrepresented minorities in computing. I continue to serve as an Associate Editor of ACM TOSEM. I am an ex-officio member of CS@VT Alumni Advisory Board, as it is being reconstituted by Department Head Dr. Cal Ribbens and have agreed to serve as Chair of the Awards Committee of this Board. I also am participating in Meet CS Alumni visits (with Dr. Ribbens) around the country. I continue to mentor junior CS faculty and served on the CS@VT NSF CAREER Award mentoring committee. Community: In Sarasota, Florida, my new home, I volunteer regularly at the All Faiths Food Bank I am active member of the Sarasota League of Women Voters. 2016 I am a member of the CRA Board of Directors, the CRA Education Committee, and the organizing committee for Snowbird 2016. I served on the committee to select the CRA-E Undergraduate Research Faculty Mentoring Award, which I will chair for the 2017 competition. I also helped develop a workshop on undergraduate research mentoring given at ICSE 2016. At Snowbird, I am chairing/organizing the Data Sciences in the 21st Century panel session and helping to organize the New Department Heads Workshop. I served on the selection committee for the new EIC of ACM TOPLAS and was a member of the Technical Briefings Program Committee for ICSE 2016. I chaired the CS@VT Diversity Committee (AY 2015-16) I became an emerita professor in September 2016. As such, I continue to work on diversity activities (e.g., Tapia Celebration), mentor younger CS faculty members, and actively participate/help organize activities with CS@VT alumni. 2015 I continue on the CCICADA Advisory Board and the CRA Board of Directors. I am a member of the CRA-E committee, working on mentoring young faculty/graduate students as to how to do reserach wit",
  "content_length": 16763,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:03"
}