{
  "name": "Bartosz Wilczynski",
  "homepage": "http://regulomics.mimuw.edu.pl/~bartek",
  "status": "success",
  "content": "Home Page of Bartek Wilczynski Research Teaching Personal Homepage of Bartek Wilczyński Photo Links Regulomics group CompBio@MIMUW MIMUW Furlong Lab EMBL IM PAN PTBI ISCB EMBO JEDI Research interests I'm interested in computational biology approaches to gene expression regulation. This falls into two main areas: Role of chromatin state in transcription regulation I am very interested in understanding the role chromatin state dynamics is playing in transcriptional regulation. We are involved in building probabilistic models relating transcription factor binding, histone modifications and chromatin interactions with the transcriptional events occuring in developing organisms. This reasearch is partially funded by Foundation for Polish Science through the project entitled Computational modeling of transcriptional regulation in the context of chromatin dynamics. Modeling gene regulatory networks I'm working on computational modelling of regulatory networks. This includes computational approaches to network reconstruction or parameter estimation from experimental data as well as stochastic simulations of epigenetics systems. Regulatory sequence analysis Many regulatory interactions depend on specific sequence signals like cis-regulatory elements, microRNA sequences or amino-acid sequence motifs in proteins. Understanding the precise relation between sequence motifs and their regulatory function is a great challenge which most likely requires integrating diverse sources of data. I'm heading the lab of regulatory genomics@University of Warsaw. Here you can find the list of my publications and my short CV. Contact Bartek Wilczyński, PhD Associate professor Computational Biology Group Institute of Informatics, University of Warsaw Banacha 2, 02-097 Warsaw, Poland room 5770, tel. +48 22 5544 577, e-mail: bartek[at]mimuw.edu.pl Design by studio7designs | copyright 2006 Bartek Wilczyński",
  "content_length": 1908,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:17"
}