{
  "name": "Bart Jacobs 0001",
  "homepage": "http://www.cs.ru.nl/B.Jacobs",
  "status": "success",
  "content": "Bart Jacobs (Index) Webpage of Bart Jacobs Professor of Security, Privacy and Identity working at iHub, Nijmegen's interdisciplinary hub for digitalisation and society. professor in the Digital Security group, Institute for Computing and Information Sciences, Faculty of Science; affiliated professor in Philosophy, in the Ethics and Political Philosophy group; affiliated professor in Law, in the Legal History group, at Radboud University Nijmegen, The Netherlands. Separately from this academic work, I am (non-renumerated) chair of the non-profit Privacy by Design foundation, that offers the Yivi wallet app for attribute-based authentication and signing and PubHubs, an online platform based on public values. General Contact info Research topics Identity and autonomy, with applications in value-driven design and in identity management (centered around Yivi and the community network PubHubs.net); Computer security and privacy in societal perspective, with special focus on developments in health (see PEP), law and intelligence; Theoretical computer science, esp. category theory, coalgebra and probabilistic reasoning. Research links Publications: local list with downloads, DBLP, or Google Scholar list with citations, see also Mathematics Genealogy. talks press contacts and online videos. Teaching The 3ec bachelor course Privacy and Identity, in the spring, together with Frederik Zuiderveen Borgesius. The 6ec master course Category Theory and Coalgebra, in the spring, together with Jurriaan Rot. Other Recipient of the Stevin prize 2021, the highest distinction in Dutch Science. Member of the Royal Netherlands Academy of Sciences (Koninklijke Nederlandse Akademie van Wetenschappen KNAW), since 2020. Member of the (Informatics section of the) Academia Europaea since 2012 (see my personal page there, at the AE). Emeritus member of IFIP WG1.3 Foundations of System Specification. Member of the Royal Holland Society of Sciences and Humanities (Koninklijke Hollandsche Maatschappij der Wetenschappen KHMW), since 2013. Member of the Review Committee for the Intelligence Law (WiV 2017), headed by Renée Jones-Bos, in 2020. Member of the Supervisory Committee for contact-tracing apps, set up by the Ministry of Health (VWS), in 2020. Member of the National Cybersecurity Council, during 2011 - 2023. Member of the scientific advice board of the Dutch police, since 2023. Member of the board of experts (Kenniskring en tegenspraak) of the Review Committee on the Intelligence and Security Services (Commissie van Toezicht op de Inlichtingen- en Veiligheidsdiensten, CTIVD), since 2015. Holder of ERC Advanced Grant (2012-2017) on Quantum Computation, Logic, and Security. Founder and chair of the Privacy by Design Foundation, a non-profit spin-off that focuses on privacy-friendly attribute-based authentication. Recipient of the Dutch order of chivalry: Officer of Orange-Nassau, 2012. Winner of the 2018 Brouwer award for science and society from KHMW. Recipient of the 2012 Huibregtsen award, for Science and Society. Winner of the SURF Security en Privacy Award 2017. Former chair of the Advice Board (Raad van Advies) of the Dutch digital rights group Bits of Freedom (2012-2017) There is a wikipedia page about me (in Dutch), containing some basic biographical information. Website Follow the Money ranked me as most influential cyber security expert in The Netherlands, in 2017, see ranking and follow-up interview. Kids (very old pictures)",
  "content_length": 3467,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:13"
}