{
  "name": "Bartosz Krawczyk",
  "homepage": "https://www.rit.edu/directory/bxkcis-bartosz-krawczyk",
  "status": "success",
  "content": "Bartosz Krawczyk | RIT RIT Logo with Text Bartosz Krawczyk Assistant Professor Chester F. Carlson Center for Imaging Science College of Science bartosz.krawczyk@rit.edu 585-475-2916 Office Location CAR- Bartosz Krawczyk Assistant Professor Chester F. Carlson Center for Imaging Science College of Science Bio Bartosz Krawczyk is an Assistant Professor at the Chester F. Carlson Center for Imaging Science, where he heads the Machine Learning and Computer Vision (MLVision) Lab. His current research interests include continual learning, data streams, concept drift, class imbalance, ensemble learning, and XAI. He obtained his M.Sc. and Ph.D. degrees in Computer Science from Wroclaw University of Science and Technology, Poland, in 2012 and 2015 respectively. Dr. Krawczyk coauthored the book Learning from Imbalanced Data Sets (Springer 2018). He was a recipient of prestigious awards for his scientific achievements such as IEEE Richard Merwin Scholarship, IEEE Outstanding Leadership Award, and Amazon Machine Learning Award. He served as a Guest Editor for four journal special issues and as a Chair for twenty special session and workshops. Dr. Krawczyk is Program Committee member for high-ranked conferences, such as KDD (Senior PC member), AAAI, IJCAI, ECML-PKDD, ECAI, PAKDD, and IEEE BigData. He is the member of the editorial board for Applied Soft Computing (Elsevier).Dr. Krawczyk’s team is working on novel ML algorithms designed for holistic continual learning from evolving data streams. These algorithms address the challenges of robustness to catastrophic forgetting and the accumulation of knowledge over time, while also ensuring adaptability to concept drift and data shift phenomena through proactive memory revisitation and relevant past information updating. Another vital part of Dr. Krawczyk’s research portfolio lies in the critical area of data imbalance and fairness, where he and his team are at the forefront of devising strategies to mitigate bias inherent in both data and algorithms. This research holds profound implications across numerous domains, particularly in contexts involving underrepresented groups and sensitive information, where biased decision-making processes can have significant ramifications. Dr. Krawczyk has co-authored “Learning from Imbalanced Datasets” (Springer, 2018), a seminal monograph in this field. Furthermore, the MLVision team explores methodologies for handling sparse access to data, a common challenge in real-world scenarios characterized by limited ground truth or training examples. Dr. Krawczyk focuses on the development of active and semi-supervised learning algorithms, as well as meta-models for few/one/zero-shot learning, to accommodate these constraints effectively. Beyond core ML/CV research, Dr. Krawczyk's team applies their algorithms to solve practical challenges, particularly in the domains of medical image analysis and remote sensing. Through their interdisciplinary approach, they seek to translate theoretical innovations into tangible solutions with real-world impact. bartosz.krawczyk@rit.edu 585-475-2916 Personal Links ORCID Publication Database Curriculum Vitae Google Scholar Select Scholarship Selected journal publications:Damien Dablain, Colin Bellinger, Bartosz Krawczyk, David W Aha, Nitesh Chawla: Understanding imbalanced data: XAI & interpretable ML framework. Machine Learning 113: 3751–3769 (2024)Gabriel Aguiar, Bartosz Krawczyk, Alberto Cano: A survey on learning from imbalanced data streams: taxonomy, challenges, empirical study, and reproducible experimental framework. Machine Learning 113: 4165–4243 (2024)Damien Dablain, Bartosz Krawczyk, Nitesh V. Chawla: DeepSMOTE: Fusing Deep Learning and SMOTE for Imbalanced Data. IEEE Transactions on Neural Networks and Learning Systems 34(9): 6390-6404 (2023) Lukasz Korycki, Bartosz Krawczyk: Adversarial Concept Drift Detection under Poisoning Attacks for Robust Data Stream Mining. Machine Learning 112(10): 4013-4048 (2023)Selected conference publications:Lukasz Korycki, Bartosz Krawczyk: Class-Incremental Mixture of Gaussians for Deep Continual Learning. CVPR 2024 Workshops: 4097-4106 Jedrzej Kozal, Jan Wasilewski, Bartosz Krawczyk, Michal Wozniak: Continual Learning with Weight Interpolation. CVPR 2024 Workshops: 4187-4195Damien Dablain, Colin Bellinger, Bartosz Krawczyk, Nitesh V. Chawla: Efficient Augmentation for Imbalanced Deep Learning. ICDE 2023: 1433-1446Lukasz Korycki, Bartosz Krawczyk: Concept Drift Detection from Multi-Class Imbalanced Data Streams. ICDE 2021: 1068-1079 Currently Teaching IMGS-609Graduate Laboratory2 CreditsThis course provides foundational skills in computer programming required in the field of Imaging Science. This course is focused on mastery of fundamental of Python and C++ computer programming skills and their application to problems in Imaging Science.IMGS-621Computer Vision2 CreditsThis course will cover a wide range of current topics in modern image processing and computer vision. Topics will include introductory concepts in supervised and unsupervised machine learning, linear and nonlinear filtering, image enhancement, supervised and unsupervised image segmentation, object classification, object detection, feature matching, image registration, and the geometry of cameras. Assignments will involve advanced computational implementations of selected topics from the current literature in a high-level language such as Python, MATLAB, or Julia and will be summarized by the students in written technical papers.IMGS-699Imaging Science Graduate Co-op0 CreditsThis course is a cooperative education experience for graduate imaging science students.IMGS-789Graduate Special Topics1 - 3 CreditsThis is a graduate-level course on a topic that is not part of the formal curriculum. This course is structured as an ordinary course and has specific prerequisites, contact hours, and examination procedures.IMGS-890Research & Thesis1 - 6 CreditsDoctoral-level research by the candidate on an appropriate topic as arranged between the candidate and the research advisor.IMGS-891Continuation of Thesis0 CreditsContinuation of Thesis Search RIT Close  X This website uses cookies to provide better user experience and functionality. You can control and configure cookies in your web browser. Cookie Statement | How to Disable Cookies OK",
  "content_length": 6350,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:18"
}