{
  "name": "Bartlomiej Blaszczyszyn",
  "homepage": "http://www.di.ens.fr/~blaszczy",
  "status": "success",
  "content": "Bartlomiej Blaszczyszyn Bartłomiej (Bartek) Błaszczyszyn Senior Researcher (DR1) at INRIA INRIA-ENS research group MathNet (formerly DYOGENE) Inria Paris Centre 48 rue Barrault 75013 Paris E-mail: Bartek.Blaszczyszyn(a)ens.fr Office: C208 Phone: [+33] (0) 1 80 49 43 34 Some presentations \"Geometric statistics of point processes: limit theory and (some) statistical\tlearning\", 4th Workshop on Cumulants, Concentration and Superconcentration10-11 January, 2019, University of Münster. resume, slides \"Wireless communications: Coverage - Connectivity - Capacity; from simple stochastic geometry models to practice\", Workshop on Probabilistic Methods in Telecommunication, WIAS Berlin WIAS Berlin, November 14-16, 2016, WIAS Berlin; resume, Slides part I; Coverage, part II; Connectivity, part III; Capacity \"How user throughput depends on the traffic demand in large cellular networks\", 1st Symposium on Spatial Networks7-8 September, 2016, Oriel College, Oxford; resume, slides \"On a coverage problem in communications and its relations to Poisson-Dirichlet point processes\", Simons Conference on Networks and Stochastic Geometry May 18-21, 2015, UT Austin Department of Mathematics; resume, slides: part I, part II \"Clustering comparison of point processes with applications to percolation\", Simons Workshop on Stochastic Geometry and Point Processes May 5-8, 2014, UT Austin Department of Mathematics; resume, slides in pdf \"Random geometry of wireless cellular networks\", Prawdopodobienstwo i statystyka dla nauki i technologii Sesja Specjalna pod auspicjami Komitetu Matematyki PAN, Torun, Jun 5th 2013; resume, slides in pdf \"Random Graphs and Wireless Ad-hoc Networks\", Journe Graphes alatoires et rseaux sans fil, Nancy, 28 October 2011; resume, slides in pdf \"Wireless Cellular Networks with Shadowing\", NetGCooP, Paris, 12-14 October 2011; resume, slides in pdf \"Clustering, percolation and directionally convex ordering of point processes\", Summer Academy on Stochastic Analysis, Modelling and Simulation of Complex Structures, Söllerhaus, Hirschegg/Kleinwalsertal, 11-24 September 2011; slides in pdf \"Stochastic geometry and wireless ad-hoc networks - from the coverage probability to the asymptotic end-to-end delay on long routes\" Spatial Network Models for Wireless Communications, Newton Institute programme Stochastic Processes in Communication Sciences Cambridge, 6 April to 9 April 2010; slides in pdf \"Spatial Aloha Mac Protocol for Wireless Mobile Ad-Hoc Networks\" Rescom 2009 La Palmyre 7-12 June 2009; slides in pdf \"A Stochastic Geometry Framework for Modeling of Wireless Communication Networks\", 10th Conference on Probability, Będlewo, Poland, 2008; slides in pdf \"Tessellations in communication networks: Voronoi and beyond it\", The World a Jigsaw: Tessellations in the Sciences, University of Leiden and Lorentz Center, Netherlands, 2006; slides in pdf \"Stochastic Geometry and Wireless Networks\", Performance Conference, Juan-les-Pins, France, October 2005; slides in pdf \"Géometrie aléatoire: un cadre pour la modélisation des réseaux sans fil\", Seminaire DGA/INRIA , INRIA Rocquencourt, France, March 2009; slides in pdf Books and book-chapters [11] Giovanidis, A. and Błaszczyszyn, B. (2021). Randomised geographic caching and its applications in wireless networks. In Edge Caching for Mobile Networks. ed. H. V. Poor and W. Chen. Telecommunications Series. The Institution of Engineering and Technology ch. 13. Cloth: 978-1-83953-122-4, eISBN: 978-1-83953-123-1. [ bib | BiblioVault | HAL ] [10] Baccelli, F., Błaszczyszyn, B. and Karray, M. (2020). Random Measures, Point Processes, and Stochastic Geometry. In preparation. [ bib | HAL ] [9] Błaszczyszyn, B., Haenggi, M., Keeler, P. and Mukherjee, S. (2018). Stochastic Geometry Analysis of Cellular Networks. Cambridge University Press. [ bib | HAL | CUP ] [8] Błaszczyszyn, B. (2017). Lecture Notes on Random Geometric Models - Random Graphs, Point Processes and Stochastic Geometry. In preparation. [ bib | HAL ] [7] Błaszczyszyn, B. and Yogeshwaran, D. (2014). Clustering comparison of point processes with applications to random geometric models. In Stochastic Geometry, Spatial Statistics and Random Fields: Models and Algorithms. ed. V. Schmidt. vol. 2120 of Lecture Notes in Mathematics. Springer ch. 2, pp. 31-71. [ bib | Springer | arXiv | HAL ] [6] Błaszczyszyn, B., Mühlethaler, P. and Banaouas, S. (2012). Comparison of Aloha and CSMA in wireless ad-hoc networks under different channel conditions. In Wireless Ad-Hoc Networks. ed. H. Zhou. InTech pp. 3-22. [ bib | InTech | HAL ] [5] Baccelli, F. and Błaszczyszyn, B. (2009). Stochastic Geometry and Wireless Networks, Volume I - Theory vol. 3, No 3-4 of Foundations and Trends in Networking. NoW Publishers. [ bib | now | HAL ] [4] Baccelli, F. and Błaszczyszyn, B. (2009). Stochastic Geometry and Wireless Networks, Volume II - Applications vol. 4, No 1-2 of Foundations and Trends in Networking. Now Publishers. [ bib | now | HAL ] [3] Błaszczyszyn, B. and Rolski, T. (2004). Life Insurance Mathematics. WNT, Warsaw, Poland. in Polish, 391 pages. [ bib | http ] [2] Błaszczyszyn, B. (2004). Approximate decomposition of some modulated Poisson point process with locally dependent marking. In Spatial Point Process, Modelling and its Applications. ed. A. Baddeley, P. Gregori, J. Mateu, R. Stoica, and D. Stoyan. Universitat Jaume I, Castelló de la Plana, Spain pp. 17-26. Proc. of the International Conference on Spatial Point Process Modelling and its Applications, held in Benicàssim, Spain, 2004. [ bib | http ] [1] Błaszczyszyn, B., Rolski, T. and Schmidt, V. (1995). Light-traffic approximations in queues and related stochastic models. In Advances in Queueing: Theory, Methods and Open Problems. ed. J. Dshalalow. CRC Press, Boca Raton, Florida. [ bib | http | .ps ] generated by bibtex2html 1.93 Journal papers [42] Blaszczyszyn, B., Jacquet, P., Mans, B. and Popescu, D. (2023). Energy and delay trade-offs of end-to-end vehicular communications using a hyperfractal urban modelling. Annals of Telecommunications. Published online 27 February 2023. [ bib | Springer | HAL ] [41] Brochard, A., Błaszczyszyn, B., Mallat, S. and Zhang, S. (2022). Particle gradient descent model for point process generation. Statistics and Computing 32, 1-25. [ bib | Springer | arXiv | HAL ] [40] Le Gall, Q., Błaszczyszyn, B., Cali, E. and En-Najjary, T. (2021). Continuum line-of-sight percolation on Poisson-Voronoi tessellations. Advances in Applied Probability 2, 510-536. Available online 01 July 2021. [ bib | arXiv | HAL | Euclid ] [39] Błaszczyszyn, B. and Hirsch, C. (2021). Optimal stationary markings. Stoch. Proc. Appl. 138, 153-185. Available online 20 April 2021. [ bib | arXiv | HAL | ScienceDirect ] [38] Błaszczyszyn, B. and Karray, M. K. (2019). Performance analysis of cellular networks with opportunistic scheduling using queueing theory and stochastic geometry. IEEE Trans. Wireless Commun. 18, 5952-5966. Published 18 September 2019. [ bib | HAL | IEEE Xplore ] [37] Chattopadhyay, A., Błaszczyszyn, B. and Altman, E. (2019). Two-tier cellular networks for throughput maximization of static and mobile users. IEEE Trans. Wireless Commun. 18, 997-1010. Published 27 December 2018. [ bib | arXiv | HAL | IEEE Xplore ] [36] Błaszczyszyn, B., Yogeshwaran, D. and Yukich, J. E. (2019). Limit theory for geometric statistics of point processes having fast decay of correlations. The Annals of Probability 47, 835-895. [ bib | arXiv | HAL | Euclid ] [35] Chattopadhyay, A., Błaszczyszyn, B. and Altman, E. (2018). Location aware opportunistic bandwidth sharing between static and mobile users with stochastic learning in cellular networks. IEEE Transactions on Mobile Computing. Published 27 August 2018 on Early Access. [ bib | arXiv | HAL | IEEE Xplore ] [34] Chattopadhyay, A. and Błaszczyszyn, B. (2018). Gibbsian on-line distributed content caching strategy for cellular networks. IEEE Trans. Wireless Commun. 17, 969 - 981. Publised online 17 November 2017. [ bib | arXiv | HAL | IEEE Xplore ] [33] Blaszczyszyn, B., Ibrahim, R. and Karray, M. (2016). Spatial disparity of QoS metrics between base stations in wireless cellular networks. IEEE Trans. Commun. 64, 4381 - 4393. Publised online 16 August 2016. [ bib | HAL | IEEE Xplore ] [32] Keeler, H., Ross, N., Xia, A. and Blaszczyszyn, B. (2016). Stronger wireless signals appear more Poisson. IEEE Wireless Comm Letters 5, 572 - 575. Publised online 26 August 2016. [ bib | arXiv | HAL | IEEE Xplore ] [31] Blaszczyszyn, B. and Karray, M. (2016). Spatial distribution of the SINR in Poisson cellular networks with sector antennas. IEEE Trans. Wireless Commun. 15, 581 - 593. Publised online 7 April 2015. [ bib | HAL | IEEE Xplore ] [30] Błaszczyszyn, B. and Keeler, H. P. (2015). Studying the SINR process of the typical user in Poisson networks by using its factorial moment measures. IEEE Trans. Inf. Theory 61, 6774 - 6794. Publised online 26 October 2015. [ bib | arXiv | HAL | IEEE Xplore ] [29] Karray, M. K., Jovanovic, M. and Błaszczyszyn, B. (2015). Theoretical expression of link performance in OFDM cellular networks with MIMO compared to simulation and measurements. Annals of Telecommunications - Annales des Télécommunications 70, 479-490. Publised online 24 June 2015. [ bib | Springer | HAL ] [28] Błaszczyszyn, B., Karray, M. K. and Keeler, H. P. (2015). Wireless networks appear Poissonian due to strong shadowing. IEEE Trans. Wireless Commun. 14, 4379-4390. Publised online 7 April 2015. [ bib | arXiv | HAL | IEEE Xplore ] [27] Błaszczyszyn, B. and Mühlethaler, P. (2015). Random linear multihop relaying in a general field of interferers using spatial Aloha. IEEE Trans. Wireless Commun. 14, 3700-3714. Publised online 19 March 2015. [ bib | arXiv | HAL | IEEE Xplore ] [26] Błaszczyszyn, B. and Mühlethaler, P. (2015). Interference and SINR coverage in spatial non-slotted Aloha networks. Annales des telecommunications-annals of telecommunications 70, 345-35",
  "content_length": 26847,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:17"
}