{
  "name": "Bart de Keijzer",
  "homepage": "https://www.kcl.ac.uk/people/bart-de-keijzer",
  "status": "success",
  "content": "Bart De Keijzer | King's College London Skip to main contentDr Bart De Keijzer Deputy Head of the Distributed AI Research Group and Informatics Finance Hub ChampionSenior Lecturer in Computer ScienceResearch interestsComputer scienceContact details+44 020 7848 1807bart.de_keijzer@kcl.ac.ukBiographyBart De Keijzer is a Senior Lecturer in Computer Science, in the Department of Informatics at King's College London. Bart's research is in the intersection of economics and theoretical computer science. He studied Computer Science at the Delft University of Technology, and obtained his PhD in algorithmic game theory at the Centrum Wiskunde & Informatica (CWI) and Vrije Universiteit Amsterdam. Bart has held post-doctoral research positions at Sapienza University of Rome, CWI Amsterdam and the University of Liverpool, and was a lecturer at the University of Essex prior to joining King's. Research Interests Algorithms and complexity Algorithmic game theory Mechanism design Markets and auctions PublicationsResearchResearchFinance HubThe Finance Hub conducts fundamental and applied research at the intersection of finance and computation, a sector which is colloquially known as FinTech.Distributed Artificial IntelligenceUnderstanding AI in social and economic contexts where an intelligent entity may be interacting with other entitiesNewsNews25 July 2024Three King's scientists win prestigious New Investigator AwardsThree King’s academics have been awarded funding from EPSRC to establish research groups.Technology & SciencePublicationsResearchNewsResearchFinance HubThe Finance Hub conducts fundamental and applied research at the intersection of finance and computation, a sector which is colloquially known as FinTech.Distributed Artificial IntelligenceUnderstanding AI in social and economic contexts where an intelligent entity may be interacting with other entitiesNews25 July 2024Three King's scientists win prestigious New Investigator AwardsThree King’s academics have been awarded funding from EPSRC to establish research groups.Technology & ScienceBH (N)5.07Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering Sciences",
  "content_length": 2220,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:15"
}