{
  "name": "Basem Shihada",
  "homepage": "https://www.kaust.edu.sa/en/study/faculty/basem-shihada",
  "status": "success",
  "content": "Basem Shihada - Professor, Computer Science - King Abdullah University of Science and Technology Top Home Study Faculty Basem Shihada Professor, Computer Science Principal Investigator, Networking Research Lab Computer, Electrical and Mathematical Science and Engineering Division basem.shihada@kaust.edu.sa KAUST NetLab My research philosophy is to bridge the gap between theory and practice in a working system. Having worked intensively in computer networking from both theoretical and system aspects, I have acquired both analytical modelling background and an acute sense of applying models to build practical systems. Program Affiliations Computer Science Electrical and Computer Engineering Center of Excellence Center of Excellence for Generative AI Biography Basem Shihada obtained his Ph.D. in Computer Science from the University of Waterloo, Canada, in 2007. Shortly after completing his studies, he joined KAUST as a Founding Faculty member in 2008. Currently, he is a Professor of Computer Science in the Computer, Electrical and Mathematical Sciences & Engineering Division at KAUST. His expertise lies in developing cutting-edge wireless systems, where he has made groundbreaking contributions across various domains, including intelligent wireless systems, wireless underwater systems, molecular communication systems, and non-terrestrial systems. Dr. Shihada’s notable achievements are the creation and successful demonstration of Aqua-Fi, the world’s first underwater Wi-Fi. This pioneering work represents a significant breakthrough, enabling high-speed internet connectivity in aquatic environments. Collaborating closely with his students and fellow researchers, his work has been recognized with several best paper awards at renowned conferences within his field. His invaluable contributions have also been published in prestigious scientific journals such as Nature Electronics, IEEE Transactions on Communications, and IEEE Transactions on Wireless Communications. Research Interests Intelligent wireless systems, wireless underwater systems, Internet of Things systems, molecular communication systems, and non-terrestrial systems are among Dr. Shihada's areas of interest. Data Networks Network Systems Wireless Systems Education Profile University of Waterloo, Waterloo, Canada, PhD in Computer Science, 2007 Dalhousie University, Halifax, Canada, Master in Computer Science, 2001 United Arab Emirates University, Al-Ain, UAE, Bachelor in Computer Science, 1997 Awards and Recognitions Exemplary Editor at IEEE Communication Letters, 2023 and 2024. KAUST Insight, KAUST Discovery, archyde, euronews, yahoo, and new atlas article coverage for our Sun-Fi work, 2022. IEEE Spectrum, Dailymail, SciTech, TechCrunch article coverage. Also, France24, Saudi TV, and Duabi TV live interviews for our Aqua-Fi work, 2020. eeDesignlt, telecoms.com, digitaltrends.com, techtarget.com article coverage for our 6G vision work, 2020.  Techxplore.com, news-medical.net, eurekalet.org articles for our communication via breath work, 2019. Photonics Media, Phys.org, and Innov Oil articles and Saudi TV interview for our underwater video communications work, 2018. Recipient of the Best Paper Award at IEEE WiMob, 2013. KAUST Excellence Annual Review Recognition, 2012. Recipient of the Best Paper Award at AFIN, 2011. Show more Publications Google Scholar Show more Research Areas Computer Science Electrical and Computer Engineering Multimedia - ORCID - KAUST Repository - KAUST Academic Portal",
  "content_length": 3507,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:21"
}