{
  "name": "Bashir I. Morshed",
  "homepage": "https://www.myweb.ttu.edu/bmorshed",
  "status": "success",
  "content": "Dr. Bashir Morshed - Home Previous Next Welcome to the Cyber Physical Systems (CPS) Lab at Texas Tech University Directed by: Bashir I. Morshed, Ph.D. Associate Professor, Undergraduate Program Coordinator Department of Computer Science Edward E. Whitacre Jr. College of Engineering Texas Tech University, Lubbock, TX 79409 Email: bmorshed@ttu.edu Phone: (806) 834-4898 Office: 308 Engineering Center Building (EC308) Research Lab: Cyber Physical Systems Lab (EC303) Web: http://myweb.ttu.edu/bmorshed/ Biography: Dr. Bashir I. Morshed is an Associate Professor at the Department of Computer Science, Texas Tech University, Lubbock TX USA. Previously, he was a tenured Associate Professor at Electrical and Computer Engineering (EECE), University of Memphis, Memphis TN USA. He has received the B.Sc. degree in Electrical and Electronic Engineering from Bangladesh University of Engineering and Technology (BUET) in 2001. Afterwards, he completed the M.A.Sc. degree in Electrical and Computer Engineering from University of Windsor, Windsor ON Canada, in 2004 and earned the Ph.D. degree in Electrical and Computer Engineering from Electronics department of Carleton University, Ottawa ON Canada, in 2010. He was a post-doctoral fellow at Medical Devices Innovation Institute, University of Ottawa, Ottawa ON Canada, prior to his joining EECE department at the University of Memphis in 2011. Dr. Morshed is a recipient of the prestigious Canadian Commonwealth Fellowship (2002-2004), Indira Gandhi Memorial Fellowship (2004 and 2006), Ontario Graduate Scholarship (2007), and Ontario Graduate Scholarship in Science and Technology (2008). He also received 2018 MHTI Scholar award by NIH mHealth Summer Training Institute at UCLA. He was awarded Faudree Professorship (2019-2020) and Faculty Research Award of Herff College of Engineering (2020) at the University of Memphis. Dr. Morshed, a Senior Member of IEEE, has published 30+ journal articles and 100+ referred conference papers and posters, one of which has received the best paper award in an international conference (IEEE EIT 2018). He has been issued 2 patents (USPTO), while 3 patent applications are pending. He has received multiple federal research grants from National Science Foundation (NSF) as a Principal Investigator (PI). He also received several other extramural and internals funds as a PI, CoPI, CoI, or Senior Personnel. His research interest focuses on cyber-physical systems (CPS) development using inkjet-printed body-worn and wearable flexible electronic biomedical devices and sensors for real-life health monitoring towards smart and connected community. Furthermore, he explores real-time artificially intelligent algorithms implemented with smartphone enabled edge-computing for future generation mobile health (mHealth). Access CV (Spring 2023) Research profile: Dr. Morshed's research interests are body-worn electronic patch sensor development using inkjet printing and utilization of these and other wearables for mobile health applications utilizing machine learning. Embedded systems (ES) are electronic information processing elements embedded into cyber-physical systems (CPS) and contain micro-controllers dedicated for sensing, actuation, and/or control. Our research group focuses on cutting-edge ES combined with nanotechnology and Inkjet printed (IJP) additive manufactured flexible electronics for ultra-low power or zero-power wearables & body-worn sensors and artificially intelligent (AI) real-time signal processing techniques at Edge Computing realized with smartphones for mobile health (mHealth) applications towards Smart and Connected Communities (SCC) and Smart Cities. Our research is/was supported by National Science Foundation (NSF), National Institutes of Health (NIH), Strengthening Communities Initiative (SCI) and multiple FedEx Innovation and Technology Development grants. We have established many external collaborations including University of Tennessee Health Science Center (UTHSC), Special Kids & Families (SKF), Le Bonheur Children's Hospital, and Memphis District of the United Methodist Church (UMC) for our research studies. Due to the highly trans-disciplinary nature of our research, we collaborate with researchers from varied disciplines (Public Health, Chemistry, Psychology, Physics, and medical professionals) that span across various institutes. Major Research Project Links: Open Access Repository of CPS Lab >> CPS Lab GitHub link >> 2022 NSF CPS project video NSF Cyber Physical Systems (CPS) Project Portal >> NSF Virtual Code Camp for High School students >> Voluntary online survey on Flexible ECG/EKG electrodes/devices NSF Smart and Connect Community (S&CC) Project Portal >> Smart and Connected community Health, Memphis Web-server Our research group's Github (public access of app codes and sensor designs) >> Lab News Bulletin: July 2023: Mst Moriom R. Momota has successfully defended her Ph.D. Dissertation. Congratulations Dr. Mst Moriom R. Momota! Jun. 2023: A journal paper has been accepted. Mohammad Abu-Saude and Bashir I. Morshed, âInductive Coupling of Bipolar Signals with a Conjugate Coil Pair for an Analog Passive ECG Sensor Using A PPy-Coated pvCNT Dry Electrodesâ, MDPI Sensors Journal, vol. 23, no. 11, June 2023. May 2023: A conference paper has been accepted. Ucchwas T. Utsha, I Hua Tsai, and Bashir I. Morshed, âA Smart Health Application for Real-Time Cardiac Disease Detection and Diagnosis Using Machine Learning on ECG Dataâ, 6th IFIP Intl. Internet of Things Conf. (IFIP-IoT), Dallas, TX, 2-3 Nov. 2023. May 2023: Dr. Morshed will serve as a Special Session Organizer (Edge AI for smart wearables) at 6TH IFIP Intl. Internet of Things (IoT) Conf., held on 2-3 Nov. 2023, at DFW, TX. May 2023: A conference paper has been accepted. I Hua Tsai and Bashir I. Morshed, âScalable and Upgradable AI for Detected Beat-by-Beat ECG Signal in Smart Healthâ, IEEE World AI IoT Congress (AIIOT), 7-10 June 2023. Apr. 2023: Mst Moriom R. Momota has been awarded CPS Rising star 2023 (NSF funded effort to identify and recognize upcoming excellent researchers in CPS    domain within the USA). Apr. 2023: A conference paper has been accepted. Bashir I. Morshed, Mst Moriom R. Momota, and Tomoko Fujiwara, âCharacterization of Inkjet-Printed Stacked MIM Thin-film Solid-State Flexible Super-Capacitorâ, IEEE Intl Conf on Electro/Information Technology (EIT), Romeoville, IL, 18-20 May 2023. Apr. 2023: A conference paper has been accepted. Nabonita Mitra and Bashir I. Morshed, âDetection of Situational Context from Minimal Sensor Modality of a Smartphone Using Machine Learning Algorithmâ, IEEE Intl Conf on Electro/Information Technology (EIT), Romeoville, IL, 18-20 May 2023. Apr. 2023: A conference paper has been accepted. Ucchwas T. Uthas and Bashir I. Morshed, âA Smartphone App for Real-time Heart Rate Computation from Streaming ECG/EKG dataâ, IEEE Intl Conf on Electro/Information Technology (EIT), Romeoville, IL, 18-20 May 2023. Apr. 2023: A journal paper has been accepted. Md Nayeem H. Kashem, Karl Gardner, Moriom R. Momota, Bashir I. Morshed, and Wei Li, âDeciphering the Correlation between Color Response, Temperature, and Relative Humidity in a Photo-patternable Polymeric Nanofilm for Tunable Multimodal Displayâ, Chemical Engineering Journal, vol. 463, article 142333, 1 May 2023. Mar. 2023: A conference paper has been accepted. Mst. Moriom R. Momota, Tamanna Ferdous, Tomoko Fujiwara, and Bashir I. Morshed, âFabrication and Characterization of Flexible Solid-State MIM Supercapacitor with Inkjet-Printing of Stacked Ag NP and Polymer Dielectric Layersâ, IEEE Dallas Circuits and Systems (DCAS), 14-16 Apr. 2023. Mar. 2023: A conference paper has been accepted. Mahfuzur Rahman, Robert Hewitt, and Bashir I. Morshed, âDesign and Packaging of a Custom Single-lead Electrocardiogram (ECG) Sensor Embedded with Wireless Transmissionâ, IEEE Dallas Circuits and Systems (DCAS), 14-16 Apr. 2023. Feb. 2023: A journal paper has been accepted. Mst. M. R. Momota, Bashir I. Morshed, Tamanna Ferdous, and Tomoko Fujiwara, âFabrication and Characterization of Inkjet Printed Flexible Dry ECG Electrodesâ, IEEE Sensors Journal, vol. 23, no. 7, pp. 7917-7928, 1 Apr. 2023. Jan. 2023: A provisional patent application has been filed. B. I. Morshed and Mst Moriom R. Momota, âFabrication of Supercapacitors with Inkjet Printed Manufacturingâ, USPTO Provisional Patent Application, Number: 63439906, Filed Jan. 19, 2023. Jan. 2023: A patent application has been filed. B. I. Morshed and Mahfuzur Rahman, âIntermediate Passive Wireless Loop Coil and Methods of Use Thereofâ, USPTO PCT Patent Application, Number: PCT/US2023/060019, filed on Jan. 03, 2023. Jan. 2023: A conference paper has been presented. B. I. Morshed, Mst Moriom R. Momota, and Mahfuzur Rahman, âExtended Range Wireless Power Transfer with Inkjet Printed Thin-film Flexible Loop Coilsâ, Invited Paper, (Special session: Wireless Power Transfer Techniques for Biomedical Applications), National Radio Science Meeting, Boulder, CO, Jan. 10-14, 2023. Dec. 2022: A journal paper has been accepted. Md. M. H. Shuvo, S. K. Islam, J. Cheng, and B. I. Morshed, âEfficient Acceleration of Deep Learning Inference on Resource-Constrained Edge Devices: A Reviewâ, Proceedings of the IEEE, vol. 111, no. 1, pp. 42-91, 14 Dec. 2022. Dec. 2022: A journal paper has been accepted. Mst M. R. Momota, and Bashir I. Morshed, âML Algorithms to Estimate Data Reliability Metric of ECG from Inter-Patient Data for Trustable AI-based Cardiac Monitorsâ, Smart Health Journal, Elsevier, vol. 26, 100350, Dec. 2022. https://doi.org/10.1016/j.smhl.2022.100350 Oct. 2022: A conference paper has been presented. Nabonita Mitra and Bashir I. Morshed, âAnalyzing Clinical 12-Lead ECG Images Using Deep Learning Algorithms for Objective Detection of Cardiac Diseasesâ, IEEE Ubiquitous Computing, Electronics & Mobile Communication Conf",
  "content_length": 19202,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:21"
}