{
  "name": "Basit Shafiq",
  "homepage": "http://web.lums.edu.pk/~basit",
  "status": "success",
  "content": "BASIT SHAFIQ Professor Department of Computer Science Lahore University of Management Sciences Address Syed Babar Ali School of Science and Engineering Lahore University of Management Sciences DHA, Lahore Cantt. 54792 Phone: +92 42 3560-8366 Email: basit at lums dot edu dot pk Education PhD, Purdue University, 2002 - 2006 MS, Purdue University, 1999 - 2001 BS, Ghulam Ishaq Khan Institute of Engineering Sciences and Technology, 1995 - 1999 Areas of Interest Security and Privacy, Access Control, Distributed Systems, Web Services, Semantic Web, Services Computing, Cloud Computing Curriculum Vitae (pdf) Publications Journal Papers H. Zafar, M. Ali, Z. Ahmad, M. Sarfraz, B. Shafiq, S. Shamail, A. Afzal, J. Vaidya, S. Raza, and A. Imran,, \"Sustainable Personalized Home Care for Pandemic Management: A Service-Oriented Approach,\" (accepted) Digital Government: Reasearch and Practice (2025). doi: 10.1145/3724402. A. Akhtar, M. Barati, B. Shafiq, O. Rana, A. Afzal, J. Vaidya, and S. Shamail, \"Blockchain based Auditable Access Control for Business Processes with Event Driven Policies,\" IEEE Transactions on Dependable and Secure Computing, Vol. 21, No. 5, pp. 4699-4716, Sept.-Oct. 2024. doi: 10.1109/TDSC.2024.3356811. S. Amjad, A. Akhtar, M. Ali, A. Afzal, B. Shafiq, J. Vaidya, S. Shamail, and O. Rana, \"Orchestration and Management of Adaptive IoT-Centric Distributed Applications,\" IEEE Internet of Things Journal, Vol. 11, No. 3, pp. 3779-3791, 1 Feb.1, 2024. doi: 10.1109/JIOT.2023.3306238. M. Zahid, B. Shafiq, J. Vaidya, A. Afzal, and S. Shamail, \"A Framework for Collaborative Business Process Fault Resolution in the Services Cloud,\" IEEE Transactions on Services Computing, vol. 16, no. 1, pp. 162-176, 1 Jan.-Feb. 2023. doi: 10.1109/TSC.2021.3112525. A. Elahraf, A. Afzal, A. Akhtar, B. Shafiq, J. Vaidya, S. Shamail, N. Adam, \"A Framework for Dynamic Composition and Management of Emergency Response Processes,\" IEEE Transactions on Services Computing, vol. 15, no. 4, pp. 2018-2031, 1 July-Aug. 2022, doi: 10.1109/TSC.2020.3030211. A. Afzal, B. Shafiq, S. Shamail, A. Elahraf, J. Vaidya and N. R. Adam, \"ASSEMBLE: Attribute, Structure and Semantics based Service Mapping Approach for Collaborative Business Process Development,\" IEEE Transactions on Services Computing, vol. 14, no. 2, pp. 371-385, 1 March-April 2021, doi: 10.1109/TSC.2018.2805346. A. Afzal, B. Shafiq, S. Shamail, and N. R. Adam, \"Requirements modeling of Web services-based business processes,\"Business Process Management Journal, Vol. 26, No. 6, November 2020. R. Wieder, B. Shafiq, and N. Adam, \"Greater Survival Improvement in African American vs. Caucasian Women with Hormone Negative Breast Cancer,\" Journal of Cancer, Vol. 11, No. 10 (2020), Pages 2808-2820. H. Asif, T. Talukdar, J. Vaidya, B. Shafiq, and N. Adam, \"Differentially Private Outlier Detection in a Collaborative Environment,\" in International Journal of Cooperative Information Systems, Vol 27, No. 3, 2018. B. Shafiq, S. Ghayyur, A. Masood, Z. Pervaiz, A. Almutairi, F. Khan, and A. Ghafoor, \"Composability Verification of Multi-service Workflows in a Policy-Driven Cloud Computing Environment,\" IEEE Transactions on Dependable and Secure Computing, Vol. 14, No. 5 (2017), Pages 478-493. R. Wieder, B. Shafiq, and N. Adam, \"African American Race is an Independent Risk Factor in Survival from Initially Diagnosed Localized Breast Cancer,\" Journal of Cancer, Vol. 7, No. 12 (2016), Pages 1587-1598. D. Lorenzi, S. Chun, J. Vaidya, B. Shafiq, V. Atluri, and N. Adam, \"PEER: A Framework for Public Engagement in Emergency Response,\" International Journal of E-Planning Research (IJEPR), Vol. 4, No. 3 (2015): 29-46. J. Vaidya, B. Shafiq, W. Fan, D. Mehmood, and D. Lorenzi ,\"A Random Decision Tree Framework for Privacy-preserving Data Minning,\" IEEE Transactions on Dependable and Secure Computing, Vol.11, No.5, pp.399,411, Sept.-Oct. 2014. D. Lorenzi, J. Vaidya, S. Chun, B. Shafiq, and V. Atluri,\"Enhancing the Government Service Experience through QR Codes on Mobile Platforms,\" Government Information Quarterly, Volume 31, Issue 1, January 2014, Pages 6 - 16. N. Adam and B. Shafiq, \"Spatial Computing and Social Media in the Context of Disaster Management,\" IEEE Intelligent Systems, Nov/Dec 2012. X. He, J. Vaidya, B. Shafiq, N. Adam, and V. Atluri, \"Structure-Aware Graph Anonymization,\" Web Intelligence and Agent Systems, (2), pp. 193 - 208, April, 2012, IOS Press, NL. B. Shafiq, V. Atluri, J. Vaidya, S. Chun, and G. Nabi, \"Resource Sharing using UICDS Framework for Incident Management,\" Transforming Government: People, Process and Policy, 6(1), pp. 41 - 61, 2012. A. Paliwal, B. Shafiq, J. Vaidya, H. Xiong, and N. Adam, \"Semantics Based Automated Service Discovery,\" IEEE Transactions on Services Computing, April 2012. X. He, J. Vaidya, B. Shafiq, N. Adam, and T. White, \"Privacy Preserving Integration of Health Care Data,\" International Journal of Computational Models and Algorithms in Medicine, 1(2), special issue on Privacy and Security Issues for Medical Data, pp. 22-36, 2010, IGI Global. B. Shafiq , J. Joshi, E. Bertino, and A. Ghafoor, \"Secure Interoperation in a Multi-Domain Environment Employing RBAC Policies,\" IEEE Transactions on Knowledge and Data Engineering, Vol. 17, No. 11, November 2005, pp. 1557-1577. R. Bhatti, B. Shafiq, J. Joshi, E. Bertino, and A. Ghafoor, \"X-GTRBAC Admin: A Decentralized Administration Model for Enterprise Wide Access Control,\" ACM Transactions on Information and System Security, Vol. 8, No. 4, pp. 388-423. R. Bhatti, B. Shafiq, M. Shehab, and A. Ghafoor, \"Distributed Access Management in Multimedia IDCs,\" IEEE Computer, Vol. 38, No. 9, September 2005, pp. 60-69. B. Shafiq, H. Fahmi, S. Baqai, A. Khokhar, and A.Ghafoor, \"Wireless Network Resource Management for Web-Based Multimedia Document Services,\" IEEE Communication Magazine, Vol. 41, No. 3, March 2003, pp. 138-145. J. Joshi, K. Li, H. Fahmi, B. Shafiq, and A. Ghafoor, \"A Model for Secure Multimedia Document Database System in a Distributed Environment,\" IEEE Transactions on Multimedia, Vol. 4, No. 2, June 2002, pp. 215-234. Conference and Workshop Papers S. Amjad, A. Akhtar, M. Ali, B. Shafiq, S. Shamail, A. Afzal, J. Vaidya, \"Orchflow: Orchestration and Management of IoT-Centric Distributed Workflows,\" (Demo Paper)in Proceedings of the 44th IEEE International Conference on Distributed Computing Systems (ICDCS 2024), Jersey City, USA, July 23 – 26, 2024. M. A. Zahid, A. Afzal, A. Akhtar, B. Shafiq, J. Vaidya and S. Shamail, \"An Integrated Framework for Fault Resolution in Business Processes,\" in Proceedings of the IEEE International Conference on Web Services (ICWS 2022), Barcelona, Spain, July 11 – 15, 2022. M. A. Zahid, B. Shafiq, A. Afzal, J. Vaidya and Shafay Shamail, \"BP-DEBUG: A Fault Debugging and Resolution Tool for Business Processes,\" (Demo Paper)in Proceedings of the 42nd IEEE International Conference on Distributed Computing Systems (ICDCS 2022), Bologna, Italy, July 10 – 13, 2022. A. Elahraf, A. Afzal, A. Akhtar, B. Shafiq and J. Vaidya, \"A Service-oriented Framework for Developing Personalized Patient Care Plans for COVID-19,\" in Proceedings of the 22nd Annual International Conference on Digital Government Research (dgo 2021), Omaha, Nebraska, June 9 - 11, 2021. A. Akhtar, B.Shafiq, J. Vaidya, A. Afzal, S. Shamail, and O. Rana, \"Blockchain Based Auditable Access Control for Distributed Business Processes,\" in Proceedings of the 40th IEEE International Conference on Distributed Computing Systems (ICDCS 2020) November 29 – December 1, 2020, Singapore. A. Afzal, A. Akhtar, M. A. Zahid, B.Shafiq, S. Shamail, A. Elahraf, J. Vaidya, and N. Adam, \"BP-Com: A Service Mapping Tool for Rapid Development of Business Processes,\" (Demo Paper) in Proceedings of the 40th IEEE International Conference on Distributed Computing Systems (ICDCS 2020) November 29 – December 1, 2020, Singapore. M. Anam, B. Shafiq, S. Shamail, S. Chun, and N. Adam, \"Discovering Events from Social Media for Emergency Planning,\" in Proceedings of the 20th Annual International Conference on Digital Government Research (dgo '19), Dubai, UAE, June 18 - June 20, 2019. A. Affan, H. A. Nasir, B. Shafiq, and A. Muhammad, \"Data Assimilation of Mobile Sensors in Hydrological Models of Unsteady Flow ,\" IFAC-PapersOnLine 52, no. 23 (2019): 29-36. A. Afzal, B. Shafiq, S. Shamail, A. Elahraf, J. Vaidya, and N. Adam, \"Emergency Response Plan Recommendation and Composition System (ERPRCS),\" in Proceedings of the 19th Annual International Conference on Digital Government Research (dgo '18), Delft, The Netherlands, May 30 - June 01, 2018 A. Afzal, A. Akhtar, N. Ishfaq, B. Shafiq, S. Shamail, A. Elahraf, J. Vaiya, and N. Adam, \"ASSEMBLE: A Collaborative Business Process Development Tool,\" in 40th International Conference on Software Engineering (ICSE) 2018, poster track. J. Vaidya, B. Shafiq, M. Asan, N. Adam, X. Jiang, and L. Ohno-Machado, \"A Scalable Privacy-preserving Data Generation Methodology for Exploratory Analysis,\"in Proceedings of the AMIA 2017 Annual Symposium, November 04 - 08, 2017, Washington DC, USA. H. Asif, J. Vaidya, B. Shafiq and N. Adam, \"Secure and Efficient k-NN Queries,, in Proceedings of the IFIP International Conference on ICT Systems Security and Privacy Protection (IFIP SEC 2017), pp. 155-170. Springer, Cham, 2017. H. Asif, T. Talukdar, J. Vaidya, B. Shafiq, and N. Adam, \"Collaborative Differentially Private Outlier Detection for Categorical Data,, in IEEE 2nd International Conference on Collaboration and Internet Computing (CIC), November 2016. pp. 92-101. D. Ghosh, S. Chun, B. Shafiq, and N. Adam, \"Big Data-based Smart City Platform: Real-Time Crime Analysis,, in Proceedings of the 17th International Digital Government Research Conference on Digital Government Research. June 2016. pp. 58-66. J. Vaidya, B. Shafiq, V. Atluri, and D. Lorenzi, \"A framework for policy similarity evaluation and migration based on change detection,\" 9th International Co",
  "content_length": 18525,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:22"
}