{
  "name": "Beatriz Pérez-Sánchez",
  "homepage": "https://pdi.udc.es/en/File/Pdi/TS32G",
  "status": "success",
  "content": "Beatriz Pérez Sánchez File. Department Computer Science and Information Technologies Knowledgment area Computational Science and Artificial Intelligence Research Research group Laboratorio de Investigación y Desarrollo en Inteligencia Artificial Research lines No data available from Curriculum Management System at UDC. (SUXI). Contacto UDC directory Orcid id0000-0002-8770-7257 ResearcherIDH-2503-2015 Scopus23397987900 Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Computational Intelligence for Bioinformatics Master in Bioinformatics for Health Sciences Compulsory 0 22 Computer Communications Networks Master's Degree in Industrial Computing and Robotics Optional 0 5.25 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 3.5 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 2 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 1 Large Scale Machine Learning Degree in Data Science and Engineering Optional 0 12 Large-Scale Artificial Intelligence Degree in Artificial Intelligence Optional 0 4.5 Master's Dissertation Master's in Computer Engineering Compulsory 0 5 Master's Dissertation Master in Bioinformatics for Health Sciences Compulsory 0 2 Programming II Degree in Computer Engineering Programa de Simultaneidad del Grado en Ingeniería Informática y Grado en Ciencia e Ingeniería de Datos Core 0 62 Software Design Degree in Computer Engineering Compulsory 0 50 Work Placement Degree in Computer Engineering Optional 0 12 Work Placement Master's in Computer Engineering Compulsory 0 6 Subject and involved studies Type Distance hours Total hours Computational Intelligence for Bioinformatics Master in Bioinformatics for Health Sciences Compulsory 0 22 Computer Communications Networks Master's Degree in Industrial Computing and Robotics Optional 0 10.5 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 4 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 1.5 Large Scale Machine Learning Degree in Data Science and Engineering Optional 0 12 Master's Dissertation Master in Bioinformatics for Health Sciences Compulsory 0 4 Programming II Degree in Computer Engineering Core 0 81 Software Design Degree in Computer Engineering Compulsory 0 81 Work Placement Degree in Computer Engineering Optional 0 0 Work Placement Degree in Computer Engineering Optional 0 12 Work Placement Master's in Computer Engineering Compulsory 0 2 Subject and involved studies Type Distance hours Total hours Computational Intelligence for Bioinformatics Master in Bioinformatics for Health Sciences Compulsory 0 22 Computer Communications Networks Master's Degree in Industrial Computing and Robotics Optional 0 10.5 Large Scale Machine Learning Degree in Data Science and Engineering Optional 0 7.5 Master's Dissertation Master in Bioinformatics for Health Sciences Compulsory 0 4 Programming II Degree in Computer Engineering Core 0 48 Software Design Degree in Computer Engineering Compulsory 0 85 Work Placement Degree in Computer Engineering Optional 0 0 Work Placement Degree in Computer Engineering Optional 0 12 Work Placement Master's in Computer Engineering Compulsory 0 4 Subject and involved studies Type Distance hours Total hours Computational Intelligence for Bioinformatics Master in Bioinformatics for Health Sciences Compulsory 0 22 Master's Dissertation Master in Bioinformatics for Health Sciences Compulsory 0 4 Programming II Degree in Computer Engineering Core 0 70 Software Design Degree in Computer Engineering Compulsory 0 90 Work Placement Degree in Computer Engineering Optional 0 12 Subject and involved studies Type Distance hours Total hours Computational Intelligence for Bioinformatics Master in Bioinformatics for Health Sciences Compulsory 0 22 Programming II Degree in Computer Engineering Core 0 80 Software Design Degree in Computer Engineering Compulsory 0 30 Work Placement Degree in Computer Engineering Optional 0 12 Work Placement Master's in Computer Engineering Compulsory 0 8 Subject and involved studies Type Distance hours Total hours Computational Intelligence for Bioinformatics Master in Bioinformatics for Health Sciences Compulsory 0 16 Programming II Degree in Computer Engineering Core 0 90 Software Design Degree in Computer Engineering Compulsory 0 50 Work Placement Degree in Computer Engineering Optional 0 0 Work Placement Degree in Computer Engineering Optional 0 10 Work Placement Master's in Computer Engineering Compulsory 0 10 Tutoring 2025/2026 Defined tutoring by teacher for 2025/2026 academic course. Faculty of Computer Science Quarter Day Site 1st quarter Monday 11:30 a 14:00 Teams (Virtual) / Despacho 4.02 Facultad de Informática 1st quarter Wednesday 09:00 a 10:30 Teams (Virtual) / Despacho 4.02 Facultad de Informática 2nd quarter Wednesday 11:30 a 13:30 Teams (Virtual) 2nd quarter Thursday 09:00 a 11:00 Teams (Virtual) EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2024/2025 2022/2023 2021/2022 2020/2021 2018/2019 2016/2017 Analysis of vocal record features for the classification of Parkinson's Disease Feature analysis of vocal registers for Parkinson desease classification Machine learning for Parkinson's diagnosis through vocal recordings Classification of Atrial Fibrillation from single-lead ECG recordings Development of an application for sales and stock management of a fashion store New distributed and non iterative training method for anomaly detection through artificial neural networks. Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Papers in research journals Book chapters Conference papers 2024 2022 2020 2019 2016 ... 2013 2010 Funding entity Ministerio de Ciencia, Innovación y Universidades Main researches Berta Guijarro Berdiñas (IP1) / Amparo Alonso Betanzos (IP2) Type Proyecto Programas Nacionales Dates From 01/09/2024 to 31/08/2027 Funding entity Ministerio de Ciencia e Innovación Main researches Cancela Barizo, Brais Type Proyecto Programas Nacionales Dates From 01/09/2022 to 31/08/2025 Funding entity Consellería de Educación Main researches Amparo Alonso Betanzos Type Proyecto Programas Autonomicos Dates From 01/01/2022 to 20/11/2025 Funding entity Ministerio de Ciencia e Innovación Main researches Francisco Javier Bellas Bouza (IP1) / Óscar Fontenla Romero (IP2) Type Proyecto Programas Nacionales Dates From 01/12/2022 to 30/11/2024 Funding entity Red.es Main researches José Luis Calvo Rolle ; Óscar Fontenla Romero Type Proyecto Programas Nacionales Dates From 01/09/2022 to 30/04/2024 Funding entity INSTITUTO DE LA MUJER. MINISTERIO DE IGUALDAD Main researches María Teresa Piñeiro Otero Type Proyecto Otros Programas Dates From 01/01/2022 to 31/12/2023 Funding entity Ministerio de Ciencia, Innovación y Universidades Type Proyecto Programas Nacionales Dates From 01/06/2020 to 31/05/2024 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Amparo Alonso Betanzos Type Proyecto Programas Autonomicos Dates From 01/01/2019 to 20/11/2021 Funding entity Ministerio de Economía y Competitividad (MINECO) Main researches AMPARO ALONSO BETANZOS/OSCAR FONTENLA ROMERO Type Proyecto Programas Nacionales Dates From 01/01/2016 to 31/12/2019 Funding entity Ministerio de Economía y Competitividad (MINECO) Main researches Amparo Alonso Betanzos Type Proyecto Programas Nacionales Dates From 01/01/2013 to 31/12/2015 Funding entity Ministerio de Economía y Competitividad Main researches Berta M Guijarro Berdiñas Type Proyecto Otros Programas Dates From 01/01/2010 to 31/12/2012 2025 2023 2021 2018 2017 ... 2014 2013 2011 2010 2007 Authors Javier Ortega-Morla, Antonio José Leis Iglesias, Alma Mallo, Laura Morán-Fernández, Sara Guerreiro-Santalla, Alejandro Paz-Lopez, Beatriz Pérez-Sánchez, Noelia Sánchez-Maroño, Alejandro Rodríguez-Arias, Óscar Fontenla-Romero, Francisco Bellas Journal IEEE Transactions on Learning Technologies Vol. 18 (pages 783 to 797) DOI https://doi.org/10.1109/tlt.2025.3598041 Authors Fontenla-Romero, Óscar, Bertha Guijarro-Berdiñas, Elena Hernandez-Pereira, Beatriz Pérez-Sánchez Journal FUTURE GENERATION COMPUTER SYSTEMS Vol. 149 (pages 200 to 211) DOI https://doi.org/10.1016/j.future.2023.07.018 Authors Óscar Fontenla-Romero, Beatriz Pérez-Sánchez, Bertha Guijarro-Berdiñas Journal INTERNATIONAL JOURNAL OF INTELLIGENT SYSTEMS Vol. 36 (pages 177 to 199) Authors Óscar Fontenla-Romero, Beatriz Pérez-Sánchez, Bertha Guijarro-Berdiñas Journal IEEE Transactions on Neural Networks and Learning Systems Vol. 29 Num. 8 (pages 3900 to 3905) DOI https://doi.org/10.1109/tnnls.2017.2738118 Authors Beatriz Pérez-Sánchez, Óscar Fontenla-Romero, Bertha Guijarro-Berdiñas Journal ARTIFICIAL INTELLIGENCE REVIEW Vol. 49 Num. 2 (pages 281 to 299) DOI https://doi.org/10.1007/s10462-016-9526-2 Authors Óscar Fontenla-Romero, Beatriz Pérez-Sánchez, Bertha Guijarro-Berdiñas Journal Applied Soft Computing Vol. 70 (pages 951 to 958) DOI https://doi.org/10.1016/j.asoc.2017.07.061 Authors José Luis Calvo-Rolle, Óscar Fontenla-Romero, Beatriz Pérez-Sánchez, Bertha Guijarro-Berdiñas Journal INFORMATICA Vol. 25 Num. 3 (pages 401 to 414) DOI https://doi.org/10.15388/informatica.2014.20 Authors Diego Peteiro Barral, Bertha Guijarro-Berdiñas, Beatriz Pérez-Sánchez, Óscar Fontenla-Romero Journal Expert Systems with Applications Vol. 40 Num. 10 (pages 3900 to 3905) Authors Enrique Ron Castillo, Roberto Mínguez, Antonio J. Conejo, Beatriz Pérez-Sánchez, Óscar Fontenla-Romero Journal ANNALS OF OPERATIONS RESEARCH Vol. 210 (pages 309 to 331) DOI https://doi.org/10.1007/s10479-011-0",
  "content_length": 16247,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:28"
}