{
  "name": "Bei Yu 0001",
  "homepage": "http://www.cse.cuhk.edu.hk/~byu",
  "status": "success",
  "content": "Bei Yu@CUHK-CSE Bei Yu About Biography Teaching News Services Research Students Topics Publications Softwares Tips Bei Yu Professor, Department of Computer Science and Engineering Assistant Dean (Mainland Affairs), Faculty of Engineering The Chinese University of Hong Kong M.E. (Tsinghua), Ph.D. (Texas) Resume/CV (as of Oct., 2025) “If I knew what I was doing, it wouldn't be called research.” - Albert Einstein. About I'm a Professor in the Department of Computer Science and Engineering, and Assistant Dean (Mainland Affairs) in the Engineering Faculty, at The Chinese University of Hong Kong. My research interests include machine learning and deep learning with applications in electronic design automation (EDA) and computer vision (more about my research). I served as TPC Co-Chair of ACM/IEEE Workshop on Machine Learning for CAD (MLCAD) 2019 and International Symposium of EDA (ISEDA) 2025 & 2026, in the program committees of DAC, ICCAD, DATE, ASPDAC, ISPD, AAAI, and in the editorial boards of IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), ACM Transactions on Design Automation of Electronic Systems (TODAES), and Integration, the VLSI Journal. I am always looking for motivated graduate students with background in computer science, microelectronics, electronic engineering, or mathematics, working on research fields of 1) hardware friendly computer vision; and/or 2) machine learning in EDA. Asking for Recommendation Letters? Please read these conditions and details. Some recent presentation slides: “3D-IC Physical Design” (pdf) “Large Language Model in EDA” (2024-pdf) (2025-pdf) “EDA for AI Chip Designs” (pdf) “Large Scale VLSI Mask Optimization” (pdf) “Hardware Friendly Computer Vision” (pdf) “Machine Learning in EDA” (2024-pdf) (2023-pdf) (2021-pdf) “Placement in Advanced Technology Nodes” (pdf) A curated paper list of AI x EDA research. Contact E-mail: byu[at]cse.cuhk.edu.hk Phone: (852)-3943-8435 (hardly reachable, email better) Fax: (852)-2603-5024 Office: Rm907, Ho Sin Hang Engineering Building (map: by-walking; by-shuttle) Consultation Hours: Monday 13:00–15:00 (by appointment or Zoom: https://cuhk.zoom.us/j/91451203243) Recent News Oct/2025: 1st Place Award in ICCAD 2025 CAD Contest, Problem C: congratulations to Fangzhou and the whole team! (photo-1) (photo-2) May/2025: Serving as TPC Chair of ISEDA 2025. See you in Hong Kong! (media) Mar/2025: Congratulations to Yuan Pu and all co-authors, our paper on Logic Optimization receives Best Paper Award Nomination at ISPD 2025! (photo) Nov/2024: The work collaborated with Zhejiang University received ICCAD 2024 Best Paper Award. (CUHK-CSE news) Nov/2024: Congratulations to Dr. Siting Liu for Winning 1st Place at the ACM Student Research Competition at ICCAD 2024. (CUHK-CSE news) Jul/2024: Selected to be IEEE CEDA Distinguished Lecturer. (IEEE-CEDA webpage) (CUHK-CSE news) Jul/2024: Research Grants Council (RGC) Research Fellow Scheme 2024-25. (CUHK news) (CUHK-weixin news) (CUHK-CSE news) Jul/2024: Binwu Zhu (PhD, 2024) will join Southeast University, as a tenure-track Associate Professor. Congratulations! Jul/2024: Congratulations to Siting Liu for winning the Best PhD Dissertation Poster Award at CCF DAC 2024. (photo) (CUHK-CSE news) Jul/2024: 10 papers accepted by ICCAD 2024. Jun/2024: DAC 2024 Under-40 Innovator Award. (photo) (CUHK-CSE news) (CUHK-Engineering news) Mar/2024: Congratulations to Yuan Pu and all co-authors, our paper on Incremental Macro Placement receives Best Paper Award Nomination at ISPD 2024! (photo) More archival news Selected Awards Best Paper Award ICCAD 2024 Best Paper Award IEEE TSM 2022 Best Paper Award DATE 2022 Best Paper Award ICCAD 2021 Best Paper Award ASPDAC 2021 Best Paper Award Integration, VLSI Journal 2018 Best Paper Award ISPD 2017 Best Paper Award ICCAD 2013 Best Paper Award ASPDAC 2012 Best Student Paper Award ICTAI 2019 Best Student Paper Award SPIE 2016 Best Paper Award Nomination ICCAD 2025 Best Paper Award Nomination ISPD 2025 Best Paper Award Nomination ICCAD 2024 Best Paper Award Nomination ISPD 2024 Best Paper Award Nomination ASPDAC 2023 Best Paper Award Nomination MLCAD 2022 Best Paper Award Nomination DATE 2021 Best Paper Award Nomination ASPDAC 2019 Best Paper Award Nomination DAC 2014 Best Paper Award Nomination ASPDAC 2013 Best Paper Award Nomination ICCAD 2011 Research Fellow Scheme (RFS) RGC 2024 Under-40 Innovator Award DAC 2024 Distinguished Lecturer IEEE CEDA 2024 Mid-Career Award IEEE TCSDM 2022 Ernest S. Kuh Early Career Award IEEE CEDA 2022 Meritorious Service Award ACM SIGDA 2021 Outstanding Dissertation Award EDAA 2014 Outstanding Students Abroad Award China Scholarship Council 2014 SPIE Scholarship SPIE 2013 IBM Ph.D. Scholarship IBM 2012 1st Place Award in CAD Contest ICCAD 2025 1st Place Award in CAD Contest ICCAD 2015 2nd Place Award in CAD Contest ICCAD 2024 2nd Place Award in CAD Contest ICCAD 2018 2nd Place Award in CAD Contest ICCAD 2013 2nd Place Award in CAD Contest ICCAD 2012 3rd Place Award in CAD Contest ICCAD 2022 3rd Place Award in ISPD Contest ISPD 2020 3rd Place Award in ISPD Contest ISPD 2017 2nd Place Award in ICDAR Competition ICDAR 2021 My Calendar",
  "content_length": 5216,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:31"
}