{
  "name": "Bei Wang 0001",
  "homepage": "http://www.sci.utah.edu/~beiwang",
  "status": "success",
  "content": "Bei Wang Bei Wang Phillips Topological Intelligence Lab Topology, Geometry, Visualization and Machine Learning for Data-Driven Discovery Click here for high-res photo Bei Wang Phillips Publish Under: Bei Wang Associate Professor, Kahlert School of Computing Adjunct Associate Professor, Department of Mathematics Faculty member, Scientific Computing and Imaging (SCI) Institute University of Utah Warnock Engineering Building (WEB) Room 4608 72 South Central Campus Drive Salt Lake City, Utah 84112 Email: beiwang AT sci.utah.edu Research keywords: topological data analysis, data visualization, computational topology, data mining, and machine learning. CV: (last update October 1, 2025) Web page last update: October 2, 2025. Lab News Youjia Zhou received the IEEE VGTC Visualization Dissertation Award Honorable Mention. November 4, 2025. Mingzhe Li received the prestigious Engineering Postdoctoral Fellowship from the University of Notre Dame. September, 2025. Dr. Bei Wang Phillips was awarded the inaugural Price College of Engineering Outstanding Researcher Award. August, 2025. Dr. Bei Wang Phillips was awarded the 2024 Presidential Early Career Award for Scientists and Engineers (PECASE) Award by President Biden, the highest honor bestowed by the U.S. government on outstanding scientists and engineers early in their careers. January 14, 2025. Dr. Lin Yan won the IEEE 2024 VGTC Visualization Dissertation Award, which recognizes outstanding academic research and development in visualization and visual analytics. October, 2024. Dr. Youjia Zhou won the Price College of Engineering Outstanding Dissertation for 2023 at the University of Utah. May, 2024. Short Biography Dr. Bei Wang Phillips is an Associate Professor in the School of Computing, an Adjunct Associate Professor in the Department of Mathematics, and a faculty member of the Scientific Computing and Imaging (SCI) Institute at the University of Utah. She received her Ph.D. in Computer Science from Duke University. Her research lies at the intersection of topological data analysis, data visualization, and computational topology, with a focus on integrating topological, geometric, statistical, data mining, and machine learning methods with visualization to enable scientific discovery in large and complex datasets. Her work has been supported by multiple awards from the NSF, NIH, and DOE. Dr. Phillips received a DOE Early Career Research Program award in 2020, an NSF CAREER award in 2022, and the Presidential Early Career Award for Scientists and Engineers (PECASE) from President Biden in 2024, the highest honor bestowed by the U.S. government on early-career scientists and engineers. Professional Experience Associate Professor, School of Computing, University of Utah (2022 - present) Faculty Member, Scientific Computing and Imaging (SCI) Institute , University of Utah (2016 - Present) Adjunct Associate Professor, Department of Mathematics, University of Utah (2022 - present) Assistant Professor, School of Computing, University of Utah (2016 - 2022) Adjunct Assistant Professor, Department of Mathematics, University of Utah (2019 - 2022) Research Computer Scientist, Scientific Computing and Imaging Institute (SCI), University of Utah (2011 - 2016) Postdoctoral Fellow, Scientific Computing and Imaging Institute (SCI), University of Utah (2010 - 2011) Visiting Researcher, Institute of Science and Technology Austria (IST Austria) (Fall 2009) Education Ph.D. in Computer Science, Duke University (2010), Advisor: Herbert Edelsbrunner Certificate in Computational Biology and Bioinformatics, Duke University (2010) B.S. in Computer Science and Mathematics, Minor in Psychology, Summa Cum Laude, University of Bridgeport (2003) Best Paper Awards Honorable Mention Paper Award at IEEE Workshop on Topological Data Analysis and Visualization (TopoInVis), 2023. Visual Computer Cover of the Year 2023, by Daniel Klötzl, Tim Krake, Youjia Zhou, Ingrid Hotz, Bei Wang, Daniel Weiskopf, 2023. Visual Computer Second Best Paper Award at Computer Graphics International (CGI), 2022. Honorable Mention Paper Award at IEEE Workshop on Topological Data Analysis and Visualization (TopoInVis), 2022. Best Paper at Shape Modeling International (SMI), 2019. Best Poster at China Visualization and Visual Analytics Conference (ChinaVis), 2019. Best Paper at International Workshop on Connectomics in NeuroImaging (CNI) at MICCAI, 2018. Best Paper at IEEE Pacific Visualization (PacificVis), 2016. Best Paper at IEEE Pacific Visualization (PacificVis), 2014. First runner-up for the Best Student Paper Award at International Topical Meeting on Probabilistic Safety Assessment and Analysis (PSA), 2013. Student: Dan Maljovec. Student Awards Lin Yan: IEEE VGTC Visualization Dissertation Award, 2024. Youjia Zhou: Price College of Engineering Outstanding Dissertation for 2023, University of Utah, 2024. Nithin Chalapathi: Finalist in the Computing Research Association (CRA) Outstanding Undergraduate Researcher Awards, 2021. Adam Brown: ISTplus Postdoctoral Fellowship Awardee from IST Austria, 2019-2021. Yiliang Shi: Honorable Mention in the Computing Research Association (CRA) Outstanding Undergraduate Researcher Awards, 2018. Keri Anderson: School of Computing Outstanding Graduating Senior award at the University of Utah, 2018. William Garnes: College of Engineering Scholarship, 2017-2018. GEM fellowship from the National GEM Consortium, 2018. Research Interests I am interested in the analysis and visualization of large and complex data. My research expertise lies in the theoretical, algorithmic, and application aspects of data analysis and data visualization, with a focus on topological techniques. My research interests include: topological data analysis, data visualization, computational topology, computational geometry, machine learning and data mining. Previously, I have worked on projects related to computational biology and bioinformatics, as well as robotics. My vision is to tackle problems involving large and complex forms of data that require rich structural descriptions, by combining topological, geometric, statistical, data analysis and visualization techniques. Current Projects 2023 - 2026 NSF DMS-2301361 Multiparameter Topological Data Analysis. Project Website 2023 - 2026 NSF OAC-2313124 Topology-Aware Data Compression for Scientific Analysis and Visualization. Project Website 2022 - 2027 NSF IIS-2145499 CAREER: A Measure Theoretic Framework for Topology-Based Visualization. Project Website. 2022 - 2026 NSF IIS-2205418 SCH: Geometry and Topology for Interpretable and Reliable Deep Learning in Medical Imaging Project Website. 2022 - 2025 DOE DE-SC0023157 Implicit Continuous Representations for Visualization of Complex Data. Utah Project Website. 2021 - 2024 NSF DMS-2134223 Advancing Theoretical Minimax Deep Learning: Optimization, Resilience, and Interpretability. Project Website. 2020 - 2025 DOE DE-SC0021015 Topology-Preserving Data Sketching for Scientific Visualization. Project Website. Past Projects 2021 - 2024 Utah Board of Higher Education Deep Technology Initiative Bringing Fairness in AI to the Forefront of Education. Project Website. 2019 - 2022 NSF IIS-1910733 Visualizing Robust Features in Vector and Tensor Fields. Project Website. 2017 - 2020 NSF DBI-1661375 ABI Innovation: A Scalable Framework for Visual Exploration and Hypotheses Extraction of Phenomics Data using Topological Analytics. Utah Project Website. Collaborative Project Website. 2015 - 2019 NSF IIS-1513616 Topological Data Analysis for Large Network Visualization. Project Web Site. 2016 - 2019 NIH 1R01EB022876 Beyond Diagnostic Classification of Autism. Project Website. 2016 - 2017 NRAO-NSF Pilot Grant Feature Extraction & Visualization of ALMA Data Cubes through Topological Data Analysis. Project Web Site. Organized Workshops/Tutorials 2023: A Hands-on TTK Tutorial for Absolute Beginners at IEEE VIS Conference, October 22, 2023. Organizers: Bei Wang, Christoph Garth, Robin Maack, Mathieu Pont, Julien Tierny, Florian Wetzels, Michael Will. 2023: Dagstuhl Seminar: Topological Data Analysis and Applications, May 7-12, 2023. Organizers: Bei Wang, Ulrich Bauer, Vijay Natarajan. 2022: Topological Analysis of Ensemble Scalar Data with TTK, A Sequel at IEEE VIS Conference, October 16-21, 2022. Organizers: Bei Wang, Christoph Garth, Charles Gueunet, Pierre Guillou, Federico Iuricich, Joshua A Levine, Jonas Lukasczyk, Mathieu Pont, Julien Tierny, Jules Vidal, Florian Wetzels. 2022: AWM Research Symposium Special Session on Topological Data Analysis, June 16-19, 2022. Organizers: Bei Wang, Radmila Sazdanovic, Lori Ziegelmeier. 2022: Topological Data Visualization Workshop, May 16-20, 2022. Organizers: Bei Wang, Isabel Darcy. 2021: Topological Analysis of Ensemble Scalar Data with TTK at IEEE VIS Conference, October 24-29, 2021. Organizers: Bei Wang, Christoph Garth, Charles Gueunet, Pierre Guillou, Lutz Hofmann, Joshua A Levine, Jonas Lukasczyk, Julien Tierny, Jules Vidal, Florian Wetzels. 2021: A Visual Tour of Bias Mitigation Techniques for Word Representations at KDD Tutorial, August 14-18, 2021. Organizers: Bei Wang, Sunipa Dev, Jeff Phillips, Archit Rathore, Vivek Srikumar. 2021: Geometric and Topological Methods in Biomedical Image Analysis during the Computational Geometry Week, June 7-11, 2021. Organizers: Bei Wang, Chao Chen. 2021: A Visual Tour of Bias Mitigation Techniques for Word Representations at AAAI Tutorial Forum, February 3, 2021. Organizers: Bei Wang, Sunipa Dev, Jeff Phillips, Archit Rathore, Vivek Srikumar. 2020: Visualization in Astrophysics: Developing New Methods, Discovering Our Universe, Educating the Earth at IEEE VIS, October 25-30, 2020. Organizers: Bei Wang, Juna Kollmeier, Lauren Anderson. 2020: Application Spotlights: Challenges in the Visualization of Bioelectric Fields for Cardiac and Neural Research at IEEE VIS, October 25-30, 2020. Organizers: Bei Wang, Rob MacLeod, Wilson Good. 2020: Visualization in Ast",
  "content_length": 77872,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:33"
}