{
  "name": "Bela Gipp",
  "homepage": "https://gipplab.org",
  "status": "success",
  "content": "Home - Prof. Dr. Bela Gipp, University of Göttingen, GippLab Skip to content Homewp-admin2024-01-13T16:33:02+01:00 Chair for Scientific Information Analytics Prof. Bela Gipp Welcome to the Chair for Scientific Information Analytics. On this page, you will find information about the members of this research group, ongoing research projects, offered courses, topics for Bachelor’s and Master’s projects and open positions. Our interdisciplinary research covers the fields of: Machine Learning & Data Science Information Science Distributed Ledger Technology Natural Language Processing Information Retrieval, Analysis & Visualization Digital Libraries News GippLab Presents Five Papers at EMNLP Conference in China Gallery GippLab Presents Five Papers at EMNLP Conference in China Anastasia Zhukova, Artificial Intelligence, Conferences, GippLab News, Plant Assistant, Publications, Research, Uncategorized GippLab Presents Five Papers at EMNLP Conference in Chinawp-admin2025-11-04T17:27:07+01:00November 4th, 2025|Our team, together with collaborators from Mercedes-Benz, eschbach, the North [...]Read More GippLab Showcases Research to DAAD President at NII Tokyo Gallery GippLab Showcases Research to DAAD President at NII Tokyo Dr. André Greiner-Petter, Dr. Timo Spinde, GippLab News, Math IR, Math PD, Media, Media Bias, Research GippLab Showcases Research to DAAD President at NII Tokyowp-editor2025-10-24T19:13:47+02:00October 24th, 2025|GippLab members Dr. André Greiner-Petter and Dr. Timo Spinde had [...]Read More We’re Hiring Eight New Researcher Positions Gallery We’re Hiring Eight New Researcher Positions GippLab News We’re Hiring Eight New Researcher Positionswp-editor2025-10-06T12:20:16+02:00October 6th, 2025|Our research group is growing, and we’re excited to announce [...]Read More Lower Saxony Funds Project on AI in Museums with €2.25 Million Gallery Lower Saxony Funds Project on AI in Museums with €2.25 Million GippLab News Lower Saxony Funds Project on AI in Museums with €2.25 Millionwp-editor2025-10-18T13:35:50+02:00October 2nd, 2025|How can artificial intelligence (AI) support museums in digitally unlocking [...]Read More Lower Saxony Ministry of Science and Culture Funds Göttingen Project “EDIKILEX” with €4.5 Million Gallery Lower Saxony Ministry of Science and Culture Funds Göttingen Project “EDIKILEX” with €4.5 Million GippLab News Lower Saxony Ministry of Science and Culture Funds Göttingen Project “EDIKILEX” with €4.5 Millionwp-editor2025-10-03T09:06:10+02:00September 19th, 2025|How can the literary treasures found in texts from the [...]Read More Spektrum der Wissenschaft Highlights Our Research on the Future of Plagiarism Detection Gallery Spektrum der Wissenschaft Highlights Our Research on the Future of Plagiarism Detection Dr. André Greiner-Petter, Dr. Norman Meuschke, GippLab News, Hyplag, Math PD Spektrum der Wissenschaft Highlights Our Research on the Future of Plagiarism Detectionwp-editor2025-09-23T15:59:04+02:00September 17th, 2025| How can science uphold integrity in an era where [...]Read More Research‑Internship Opportunities at the National Institute of Informatics (NII) in Tokyo Gallery Research‑Internship Opportunities at the National Institute of Informatics (NII) in Tokyo Bela Gipp, GippLab News, Uncategorized Research‑Internship Opportunities at the National Institute of Informatics (NII) in Tokyowp-editor2025-09-01T14:51:28+02:00September 1st, 2025|The National Institute of Informatics (NII) in Tokyo is Japan’s [...]Read More GippLab wins ACL Best Paper Awards Gallery GippLab wins ACL Best Paper Awards Bela Gipp, GippLab News GippLab wins ACL Best Paper Awardswp-editor2025-08-10T13:32:12+02:00August 4th, 2025|We're excited to share that our work on multilingual resources [...]Read More New Open-Access Book on Media Bias Gallery New Open-Access Book on Media Bias GippLab News, Media Bias New Open-Access Book on Media Biaswp-admin2025-06-23T14:59:10+02:00June 22nd, 2025|We're excited to announce that the book Automated Detection of [...]Read More Nacht des Wissens Gallery Nacht des Wissens GippLab News Nacht des Wissenswp-admin2025-08-09T18:47:58+02:00June 19th, 2025|Visit us at the Nacht des Wissens! For more information, [...]Read More Collaborative AI project with our industry partner eschbach wins twice in the German Innovation Award 2025 Gallery Collaborative AI project with our industry partner eschbach wins twice in the German Innovation Award 2025 Anastasia Zhukova, GippLab News, Marco Kaiser, Plant Assistant Collaborative AI project with our industry partner eschbach wins twice in the German Innovation Award 2025wp-editor2025-07-10T11:49:12+02:00May 20th, 2025|Shiftconnector AI Suit, which is developed as a collaborative project [...]Read More DFG Funds Development of a Virtual Assistant to Facilitate Research in Libraries Gallery DFG Funds Development of a Virtual Assistant to Facilitate Research in Libraries Artificial Intelligence, Bela Gipp, GippLab News DFG Funds Development of a Virtual Assistant to Facilitate Research in Librarieswp-admin2025-06-14T15:34:53+02:00May 9th, 2025|How can we use Artificial Intelligence (AI) to fundamentally simplify [...]Read More Dr. Terry Ruas passes habilitation exam Gallery Dr. Terry Ruas passes habilitation exam GippLab News, Uncategorized Dr. Terry Ruas passes habilitation examwp-admin2025-03-05T19:23:45+01:00March 5th, 2025|We are excited to announce that our group member, Dr. [...]Read More “Smart Solutions” wins Best of Industry Award 2024 Gallery “Smart Solutions” wins Best of Industry Award 2024 Anastasia Zhukova, GippLab News, Plant Assistant, Uncategorized “Smart Solutions” wins Best of Industry Award 2024wp-editor2025-04-14T16:26:24+02:00January 17th, 2025|We are excited to announce that a result of our [...]Read More Talk on the Ethical Challenges of AI in Bursfelde Gallery Talk on the Ethical Challenges of AI in Bursfelde Artificial Intelligence, Bela Gipp, GippLab News, Uncategorized Talk on the Ethical Challenges of AI in Bursfeldewp-editor2024-10-21T15:28:31+02:00October 21st, 2024|On Oct. 23 2024, Bela Gipp will take part in [...]Read More Federal Funding Approved for AI Research Collaboration with eschbach Gallery Federal Funding Approved for AI Research Collaboration with eschbach Anastasia Zhukova, GippLab News, Plant Assistant, Uncategorized Federal Funding Approved for AI Research Collaboration with eschbachwp-admin2024-08-20T13:49:50+02:00August 19th, 2024|We are thrilled to announce that the Federal Ministry for [...]Read More 12Next © Copyright 2025▸ Disclaimer Institute of Computer Science Scientific Information Analytics Group Prof. Dr. Bela Gipp Page load link Go to Top",
  "content_length": 6692,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:35"
}