{
  "name": "Belgin Ergenç",
  "homepage": "http://ceng.iyte.edu.tr/people/belgin-ergenc",
  "status": "success",
  "content": "Belgin Ergenç Bostanoğlu - Computer Engineering Department Computer Engineering Department Izmir Institute of Technology Search Computer Engineering Department Izmir Institute of Technology Home About People Research Research Focus Projects Publications Collaborations Education Undergraduate Program MS Programs CENG MS Program SEDS MS Program PhD Program Minor Program Contact lidya multisite > Computer Engineering Department > Belgin Ergenç Bostanoğlu Belgin Ergenç Bostanoğlu Professor Belgin Ergenç Bostanoğlu received the Diploma Degree in Computer Science from Middle East Technical University, Ankara,Turkey in 1983. She worked with different titles and responsibilities in IT industry during 1983 – 2000. She received the MS Degree in Computer Engineering from Izmir Institute of Technology, Turkey in 2002 and Ph.D. degree from Paul Sabatier University of Toulouse, France, in 2008 respectively. She is an associate professor in the Department of Computer Engineering at Izmir Institute of Technology, Turkey. Her main research interests include query optimization in distributed databases, association rule mining.She is managing the research laboratory of Dworld. She likes reading, travelling, photography, cinema and jazz music. Her favorite sports are walking, swimming and pilates. B.Sc. : Computer Engineering, Middle East Technical University (1983) M.Sc. : Computer Engineering, Izmir Institute of Technology (2002) Ph.D. : Computer Engineering, Paul Sabatier University, France (2008) CoursesPublicationsProjectsCourses CENG 315 - Information Management CENG 541 - Advanced Database Management Systems SEDS 502 - Contemporary Database Management Systems CENG 491 - Field Course CENG 435 - Database System Design and Implementation CENG 436 - Distributed Information Management CENG 542 - Knowledge Discovery CENG 642 - Privacy Preserving Data Mining SEDS 482 - Software Engineering and Data Science Primer II SEDS 535 - Knowledge Discovery CENG 643 - Pattern Discovery in Data Mining Publications 2025 Oğul İÜ; Soygazi F; Belgin Ergenç BostanoğluTurkMedNLI: a Turkish medical natural language inference dataset through large language model based translation Journal Article PeerJ Computer Science, 11 , pp. e2662, 2025.Links | BibTeX@article{\\.{I}\\\"{U}30.0c, title = {TurkMedNLI: a Turkish medical natural language inference dataset through large language model based translation}, author = {O\\u{g}ul \\.{I}\\\"{U} and Soygazi F and Belgin Ergen\\c{c} Bostano\\u{g}lu}, doi = {https://doi.org/10.7717/peerj-cs.2662}, year = {2025}, date = {2025-01-30}, journal = {PeerJ Computer Science}, volume = {11}, pages = {e2662}, keywords = {}, pubstate = {published}, tppubtype = {article} } Closedoi:https://doi.org/10.7717/peerj-cs.2662Close 2024 Büşra Çalmaz; Belgin Ergenç BostanoğluBDAC: Boundary-driven approximations of k-cliques Journal Article Journal of Symmetry, 16 (8), pp. 983, 2024.Links | BibTeX@article{\\c{C}almaz2024, title = {BDAC: Boundary-driven approximations of k-cliques}, author = {B\\\"{u}\\c{s}ra \\c{C}almaz and Belgin Ergen\\c{c} Bostano\\u{g}lu}, doi = {10.3390/sym16080983}, year = {2024}, date = {2024-01-01}, journal = {Journal of Symmetry}, volume = {16}, number = {8}, pages = {983}, keywords = {}, pubstate = {published}, tppubtype = {article} } Closedoi:10.3390/sym16080983CloseLeyla Tekin; Belgin Ergenç BostanoğluA Qualitative Survey on Community Detection Attack Algorithms Journal Article Journal of Symmetry, 16 (10), pp. 1272, 2024.Links | BibTeX@article{Bostanoglu2024, title = {A Qualitative Survey on Community Detection Attack Algorithms}, author = {Leyla Tekin and Belgin Ergen\\c{c} Bostano\\u{g}lu}, doi = {10.3390/sym16101272}, year = {2024}, date = {2024-01-01}, journal = { Journal of Symmetry}, volume = {16}, number = {10}, pages = {1272}, keywords = {}, pubstate = {published}, tppubtype = {article} } Closedoi:10.3390/sym16101272CloseLeyla Tekin; Belgin Ergenç BostanoğluEdge Deletion Based Subgraph Hiding Journal Article WSEAS Transactions on Information Science and Applications, 21 , pp. 2224-3402, 2024.Links | BibTeX@article{Tekin2024, title = {Edge Deletion Based Subgraph Hiding}, author = {Leyla Tekin and Belgin Ergen\\c{c} Bostano\\u{g}lu}, doi = {10.37394/23209.2024.21.32}, year = {2024}, date = {2024-01-01}, journal = {WSEAS Transactions on Information Science and Applications}, volume = {21}, pages = {2224-3402}, organization = {WSEAS Transactions on Information Science and Applications}, keywords = {}, pubstate = {published}, tppubtype = {article} } Closedoi:10.37394/23209.2024.21.32CloseBüşra Çalmaz; Belgin Ergenç Bostanoğluk-Clique counting on large scale-graphs: a survey Journal Article PeerJ Computer Science, 10 , pp. e2501, 2024.BibTeX@article{ccalmaz2024k, title = {k-Clique counting on large scale-graphs: a survey}, author = {B\\\"{u}\\c{s}ra \\c{C}almaz and Belgin Ergen\\c{c} Bostano\\u{g}lu}, year = {2024}, date = {2024-01-01}, journal = {PeerJ Computer Science}, volume = {10}, pages = {e2501}, publisher = {PeerJ Inc.}, keywords = {}, pubstate = {published}, tppubtype = {article} } CloseBelgin Ergenç Bostanoğlu; Nourhan AbuzayedDynamic frequent subgraph mining algorithms over evolving graphs: a survey Journal Article PeerJ Computer Science, 10 , 2024.Links | BibTeX@article{bostanoglu2024b, title = {Dynamic frequent subgraph mining algorithms over evolving graphs: a survey}, author = {Belgin Ergen\\c{c} Bostano\\u{g}lu and Nourhan Abuzayed}, doi = {10.7717/peerj-cs.2361}, year = {2024}, date = {2024-01-01}, journal = { PeerJ Computer Science}, volume = {10}, keywords = {}, pubstate = {published}, tppubtype = {article} } Closedoi:10.7717/peerj-cs.2361Close 2020 Belgin Ergenç Bostanoǧlu; Ahmet Cumhur ÖztürkMinimizing information loss in shared data: Hiding frequent patterns with multiple sensitive support thresholds Journal Article Statistical Analysis and Data Mining: The ASA Data Science Journal, 13 (4), pp. 309–323, 2020.BibTeX@article{ergencc2020minimizing, title = {Minimizing information loss in shared data: Hiding frequent patterns with multiple sensitive support thresholds}, author = { Belgin Ergen\\c{c} Bostanoǧlu and Ahmet Cumhur \\\"{O}zt\\\"{u}rk}, year = {2020}, date = {2020-01-01}, journal = {Statistical Analysis and Data Mining: The ASA Data Science Journal}, volume = {13}, number = {4}, pages = {309--323}, publisher = {Wiley Online Library}, keywords = {}, pubstate = {published}, tppubtype = {article} } Close Projects Türkçe Medikal Dil Modeli Geliştirilmesi ve Modelin Medikal Metinlerden Yararlanarak Türkçe Metin Sınıflandırma Amacı ile Kullanılması, Bilimsel Araştırma Projeleri (BAP) Biomedical Technologies and Innovation Doctoral Program (BIOTIN), Fellowships under Horizon Europe MSCA-COFUND Program Behavioral Next Generation in Wireless Networks for Cyber Security, COST Action B.Sc. : Computer Engineering, Middle East Technical University (1983) M.Sc. : Computer Engineering, Izmir Institute of Technology (2002) Ph.D. : Computer Engineering, Paul Sabatier University, France (2008) Courses Publications Projects CENG 315 - Information Management CENG 491 - Field Course CENG 541 - Advanced Database Management Systems SEDS 502 - Contemporary Database Management Systems CENG 435 - Database System Design and Implementation CENG 436 - Distributed Information Management CENG 542 - Knowledge Discovery CENG 642 - Privacy Preserving Data Mining CENG 643 - Pattern Discovery in Data Mining SEDS 482 - Software Engineering and Data Science Primer II SEDS 535 - Knowledge Discovery Journal Article Öztürk, A.C., Ergenç Bostanoğlu, B., \"Dynamic Itemset Hiding Algorithm for Multiple Sensitive Support Thresholds\", International Journal of Data Warehousing and Mining, vol.14, no.2, pp.37-59, 2018. Güvenoğlu, B., Ergenç Bostanoğlu, B., “A Qualitative Survey on Frequent Subgraph Mining,” Open Computer Science, vol. 8, no.1, pp.194-209, 2018. Oğuz, D., Yin, S., Ergenç Bostanoğlu, B., Hameurlain, A., Dikenelli, O., “Extended Adaptive Join Operator with Bind-Bloom Join for Federated SPARQL Queries,” International Journal of Data Warehousing and Mining, vol.13, no.3, 2017. Öztürk, A. C., Ergenç Bostanoğlu, B., “Itemset Hiding under Multiple Sensitive Support Thresholds,” International Conference on Knowledge Management and Information Sharing, KMIS, 2017. Darrab, S., Ergenç Bostanoğlu, B., “Vertical Pattern Mining Algorithm for Multiple Support Thresholds,” International Conference on Knowledge-Based and Intelligent Information & Engineering Systems, KES, 2017. Abuzayed, N., Ergenç Bostanoğlu, B., “Comparison of Dynamic Itemset Mining Algorithms for Multiple Support Thresholds,” International Database Engineering and Applications Symposium, IDEAS, 2017. Abuzayed, N., Ergenç Bostanoğlu, B., “Dynamic Itemset Mining under Multiple Support Thresholds,” Fuzzy Systems and Data Mining II, IOS Press, 2016. Oğuz, D., Yin, S., Hameurlain, A., Ergenç Bostanoğlu, B., Dikenelli, O., “Adaptive Join Operators for Federated Queries over Linked Data Endpoints,” European Conference on Advances in Databases and Information Systems, ADBIS, 2016. Darrab, S., Ergenç Bostanoğlu, B., “Frequent Pattern Mining under Multiple Support Thresholds,” Wseas Transactions on Computer Research, 4, 2016. Ayav, T., Ergenç, B., “Full-Exact Approach for Frequent Itemset Hiding,” International Journal of Data Warehousing and Mining, vol.11, no.4, pp.49-63, November 2015. Oğuz D., Ergenç Bostanoğlu, B., Yin, S., Dikenelli, O., Hameurlain, A., “Federated Query Processing on Linked Data: A Qualitative Survey and Open Challenges,” The Knowledge Engineering Review, vol.30, no.5, pp.545-563, 2015. Leloğlu, E., Ayav, T., Ergenç, B., “Coefficient-Based Exact Approach for Frequent Itemset Hiding,” International Conference on Information, Process, and Knowledge Management, eKNOW, 2014. Oğuz, D., Yıldız, B., Ergenç Bostanoğlu, B., “Matrix-Based Dynamic Itemset Mining Algorithm,” International Journal of Data Warehousing and Mining, vol.9, no.4, pp.62-75, 2013. Oğuz, D., Ergenç Bostanoğ",
  "content_length": 12215,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:44"
}