{
  "name": "Ben Stock",
  "homepage": "https://people.cispa.io/ben.stock",
  "status": "success",
  "content": "CISPA - Ben Stock × Abstract Dr.-Ing. Ben Stock Tenured Faculty Kaiserstrasse 21, St. Ingbert +49 681 87083 2681 stock [at] cispa.de Inspired by my PhD advisor Felix Freiling, since May 2020 I am introducing d for my inbox. Quoting his site: \" I will fix a time interval d and after d time I will completely remove all unanswered email from my inbox that is older than d\". As of May 2020, d is set to 7 days. That is, if you haven't received an answer from me within d, assume you'll not get an answer anymore. I am a tenured faculty at the CISPA Helmholtz Center for Information Security. Prior to that, I was a research group leader and previously postdoctoral researcher at the Center for IT-Security, Privacy and Accountability at Saarland University in the group of Michael Backes. Before joining CISPA, I was a PhD student and research fellow at the Security Research Group of the University Erlangen-Nuremberg, supervised by Felix Freiling. During that time, I was fortunate enough to join Ben Livshits and Ben Zorn at Microsoft Research in Redmond for an internship. My research interests lie within Web Security, Network Security, Reverse Engineering, and Vulnerability Notifications. In addition, I enjoy the challenges provided in Capture the Flag competitions and am always trying to get more students involved in them (especially in our local team saarsec). Work experience Since January 2022: Tenured Faculty at the CISPA Helmholtz Center for Information Security July 2018 to December 2021: Tenure-Track Faculty at the CISPA Helmholtz Center for Information Security June 2017 to June 2018: Research Group Leader at CISPA October 2015 to May 2017: Postdoctoral Researcher at CISPA July 2014 to October 2014: Research Intern at Microsoft Research, Redmond February 2013 to October 2015: PhD Student at Security Research Group of the University of Erlangen-Nuremberg July 2012 to January 2013: Master thesis student at SAP Research, Karlsruhe Awards Busy Beaver Teaching Award for lecture \"Foundations of Cybersecurity 1\" at CS Department of Saarland University (Winter Term 2023/2024) Distinguished Reviewer Award (NDSS 2024) Distinguished Paper Award (IEEE S&P 2023) for The Leaky Web: Automated Discovery of Cross-Site Information Leaks in Browsers and the Web Best Reviewer Award (ACM CCS 2021) image Top 5 \"digital teaching\" lecture (out of 117) at CS Department of Saarland University (Summer 2021) Busy Beaver Teaching Award for lecture \"Foundations of Cybersecurity 1\" at CS Department of Saarland University (Winter Term 2018/2019) Busy Beaver Teaching Award for lecture \"Web Security\" at CS Department of Saarland University (Summer Term 2018) Finalist for Best Dissertation Award (CAST e.V.) (2015/2016) Best German Bachelor Thesis (CAST e.V.) (2009/2010) Community service USENIX Security 2026 Program Committee Co-Chair IEEE EuroS&P 2024-2025 Program Committee Co-Chair USENIX Security 2025 Vice Chair IEEE S&P 2023 Associate Chair ACM CCS 2022 Track Chair for Web Security Program Committee Member for USENIX Security (2019-2024), NDSS (2020-2022; 2024-2025), ACM CCS (2019-2021; 2024), IEEE S&P (2020-2021; 2024; 2025 (first cycle only)), MADWeb (2019-2021), WWW S&P track (2018, 2020, 2022), ACSAC (2018-2019), IEEE EuroS&P (2019) Workshop Chair NDSS 2022-2023 Steering Committee for SecWeb Program Co-Chair for SecWeb 2020 and SecWeb 2021 Publications Chair for EuroS&P 2016-2020 Reviewer for USENIX Security 2017, IEEE S&P 2017, USENIX Security 2016, NDSS 2016, DIMVA 2013, ICICS 2013, DIMVA 2011 Academic Career Doktor Ingenieur (PhD), Friedrich-Alexander-Universität Erlangen-Nürnberg (2015) – Thesis “Untangling the Web of Client-Side Cross-Site Scripting” (PDF, runner-up for best disseration at CAST e.V.) Master of Science in IT Security, Technische Universität Darmstadt (2013) – Thesis “Implementing low-level browser-based security functionality” (PDF) Bachelor of Science in Internet and Software Technology, University of Mannheim (2010) – Thesis “P2P-Botnetz-Analyse — Waledac” (german) (PDF, won best bachelor thesis in IT Security at CAST e.V.) Publications and Talks",
  "content_length": 4112,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:44"
}