{
  "name": "Ben Glocker",
  "homepage": "http://wp.doc.ic.ac.uk/bglocker",
  "status": "success",
  "content": "Ben Glocker | Professor in Machine Learning for Imaging Ben Glocker Professor in Machine Learning for Imaging Recent PapersRoschewitz et al (2025) Robust image representations with counterfactual contrastive learning Jones et al. (2025) Rethinking Fair Representation Learning for Performance-Sensitive Tasks Kori et al. (2024) Identifiable Object-Centric Representation Learning via Probabilistic Slot Attention Jones et al. (2024) A causal perspective on dataset bias in machine learning for medical imaging Kori et al. (2024) Grounded Object-Centric Learning Ng et al. (2023) Prospective implementation of AI-assisted screen reading to improve early detection of breast cancer Imperial Profile | dblp | Google Scholar | PubMed | arXiv | CV | YouTube I am Professor in Machine Learning for Imaging and Kheiron Medical / RAEng Research Chair in Safe Deployment of Medical Imaging AI. I am co-leading the Biomedical Image Analysis Group, lead the Heartflow-Imperial Research Team and I am the Knowledge Transfer Lead of CHAI – The EPSRC Causality in Healthcare AI Hub. My research is at the intersection of medical imaging and artificial intelligence aiming to build safe and ethical computational tools for improving image-based detection and diagnosis of disease. Talk at RCR-NHS Global AI Conference 2025Safe deployment of medical imaging AI Opinion pieceIn AI development, equality starts with a mandate for fairness and inclusivity PerspectiveJones et al. (2024) A causal perspective on dataset bias in machine learning for medical imaging Research articleRoschewitz et al. (2023) Automatic correction of performance drift under acquisition shift in medical image classification Research articleGlocker et al. (2023) Risk of Bias in Chest Radiography Deep Learning Foundation Models PerspectiveCastro, Walker, Glocker (2020) Causality Matters in Medical Imaging Print Email to a Friend Email to a Friend Page URL: http://wp.doc.ic.ac.uk/bglocker/ Your Information: Your Name Your Email Friend’s Information: Friend’s Name Friend’s Email Close Can you beat our AI?EventsMICCAI Tutorial on Causality in Medical Image Computing IPAM Workshop Deep Learning and Medical Applications MedNeurIPS MICCAI Tutorial DeepA2Z {U|I|K}CL Bio-Imaging Symposium SoftwareTeam MIRA GitHub BLAST-CT DeepMedic Drop 2 – Image Registration Reverse Classification Accuracy ElasticFusion DatasetsMorpho-MNIST Annotated Spine CT RGB-D 7-Scenes Contact b.glocker@imperial.ac.uk Office 377, Huxley Building Department of Computing Imperial College London 180 Queen’s Gate London SW7 2AZ United Kingdom Login Main campus address: Imperial College London, South Kensington Campus, London SW7 2AZ, tel: +44 (0)20 7589 5111 Campus maps and information About this site This site uses cookies © Copyright – Imperial College London",
  "content_length": 2801,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:38"
}