{
  "name": "Ben Matthews",
  "homepage": "http://researchers.uq.edu.au/researcher/646",
  "status": "success",
  "content": "Associate Professor Ben Matthews | UQ Experts Skip to menu Skip to content Skip to footer Associate Professor Ben Matthews Email: matthews@uq.edu.au Phone: +61 7 336 52185 Positions Affiliate of Centre for Communication and Social Change Centre for Communication and Social Change Faculty of Humanities, Arts and Social Sciences Associate Professor School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Overview Background I study design as a collaborative process that materialises alternative social futures. Those futures are sometimes new products, systems, services, infrastructures and technologies. But they can also be social contracts, agreements, processes, ways of working and new possibilities for our collective lives together. I currently lead research projects in three broad domains: designing advocacy, designing the materials of participation, and augmenting skill and expertise through design. The designing advocacy project has worked with a range of stakeholders with reduced agency such as people with mental health needs, chronic illnesses, injured workers, and other stigmatised or at-risk groups. We have developed methods for the inclusion of their perspectives in design processes, insights about their specific conditions and needs, critical analyses of how they are conceptualised from the perspectives of technologists and service providers, and design proposals for services and technologies that amplify their agency. The designing the materials of participation project develops formats and processes for participatory design—the inclusion of stakeholders in the design of systems that will affect the organisation of their work and life. In this project we study how technologies and systems are used in microanalytic detail, analysing how tools and materials shape people's interactions. We use this understanding as a basis for the design of new methods and processes (and sometimes new matierals) for involving people in the design process, and giving them greater autonomy over the systems they will use. The augmenting skill and expertise through design project studies specialist work practices for the purposes of developing technology support for that work. We have worked with aeromedical teams, audiologists, passport officers, emergency first responders, quick service chefs, primary school teachers, and other professional contexts of use to understand the local and particular skills that enable those workplaces to function effectively and collaboratively. We use these understandings to inform the deisgn of technologies and work practices that support, and preserve, those core professional skills. The constants across these projects relate to the design process—the methods used to understand people, identify design opportunities, facilitate collaboration between project stakeholders, champion users' contexts and requirements, prototype early solutions, evaluate concepts in the field, and build new technologies. This results in a variety of research contributions: new design methods and perspectives that have been tailored for specific contexts of use, identification of the potentials and limitations of different approaches to design and analysis, the discovery of context-specific issues for the design of new systems, new understandings of people, their work and contexts of use, and the design and evaluation of bespoke technologies. Read more Read less Availability Associate Professor Ben Matthews is: Available for supervision Fields of research Built Environment and Design Design Distributed computing and systems software Engineering design Engineering practice and education Information and Computing Sciences Mobile computing Qualifications Bachelor (Honours) of Engineering, The University of Queensland Doctor of Philosophy, The University of Queensland Research interests Interaction design Ben's research focuses on the human and social aspects of designing technologies. His research develops methods for studying design, for studying how people use technologies, and for designing interactive products and systems. His work has developed methods and approaches for involving users and other stakeholders in technology design processes, designing new products and systems, as well as case studies of design processes in organisations and analyses of technology use in people's everyday lives. Read more Read less Works Search Professor Ben Matthews’s works on UQ eSpace All (104) Journal Article (34) Other Outputs (6) Conference Publication (52) Book Chapter (12) Featured 2021 Journal Article Head-worn displays for healthcare and industry workers: a review of applications and design Schlosser, Paul D., Matthews, Ben and Sanderson, Penelope M. (2021). Head-worn displays for healthcare and industry workers: a review of applications and design. International Journal of Human-Computer Studies, 154 102628, 1-18. doi: 10.1016/j.ijhcs.2021.102628 Head-worn displays for healthcare and industry workers: a review of applications and design Featured 2021 Journal Article Reconceptualising feedback: designing educational tangible technologies to be a creative material Matthews, Sarah and Matthews, Ben (2021). Reconceptualising feedback: designing educational tangible technologies to be a creative material. International Journal of Child-Computer Interaction, 29 100278, 100278. doi: 10.1016/j.ijcci.2021.100278 Reconceptualising feedback: designing educational tangible technologies to be a creative material Featured 2018 Journal Article Designing for practice: understanding technology use in rural community-based youth mental health contexts Orlowski, Simone, Matthews, Ben, Lawn, Sharon, Jones, Gabrielle, Bidargaddi, Niranjan and Venning, Anthony (2018). Designing for practice: understanding technology use in rural community-based youth mental health contexts. CoDesign, 15 (2), 1-22. doi: 10.1080/15710882.2018.1453844 Designing for practice: understanding technology use in rural community-based youth mental health contexts Featured 2014 Journal Article Displacing use: exploring alternative relationships in a human-centred design process Kelly, Janet and Matthews, Ben (2014). Displacing use: exploring alternative relationships in a human-centred design process. Design Studies, 35 (4), 353-373. doi: 10.1016/j.destud.2014.02.001 Displacing use: exploring alternative relationships in a human-centred design process Featured 2012 Journal Article Analysing conversation: studying design as social action Matthews, Ben and Heinemann, Trine (2012). Analysing conversation: studying design as social action. Design Studies, 33 (6), 649-672. doi: 10.1016/j.destud.2012.06.008 Analysing conversation: studying design as social action Featured 2008 Journal Article Participatory innovation Buur, Jacob and Matthews, Ben (2008). Participatory innovation. International Journal of Innovation Management, 12 (3), 255-273. doi: 10.1142/S1363919608001996 Participatory innovation 2025 Journal Article Leveraging swipe gesture interactions from mobile games as indicators of anxiety and depression: an exploratory study Chitale, Vibhav, Henry, Julie D., Matthews, Ben, Cobham, Vanessa and Baghaei, Nilufar (2025). Leveraging swipe gesture interactions from mobile games as indicators of anxiety and depression: an exploratory study. JMIR Mental Health, 12 e70577, e70577. doi: 10.2196/70577 Leveraging swipe gesture interactions from mobile games as indicators of anxiety and depression: an exploratory study 2025 Conference Publication Patient Handover in the Emergency Department Is Not Just a Point Event: Insights for Designing Information Support Tools Ambe, Aloha Hufana, Salisbury, Isaac, Grundgeiger, Tobias, Bodnar, Daniel, Rothwell, Sean, Brown, Nathan, Sanderson, Penelope and Matthews, Ben (2025). Patient Handover in the Emergency Department Is Not Just a Point Event: Insights for Designing Information Support Tools. CHI 2025: CHI Conference on Human Factors in Computing Systems, Yokohama, Japan, 26 April - 1 May 2025. New York, NY United States: Association for Computing Machinery. doi: 10.1145/3706598.3713756 Patient Handover in the Emergency Department Is Not Just a Point Event: Insights for Designing Information Support Tools 2025 Journal Article Virtual reality analytics map (VRAM): a conceptual framework for detecting mental disorders using virtual reality data Chitale, Vibhav, Henry, Julie D., Liang, Hai-Ning, Matthews, Ben and Baghaei, Nilufar (2025). Virtual reality analytics map (VRAM): a conceptual framework for detecting mental disorders using virtual reality data. New Ideas in Psychology, 76 101127, 101127. doi: 10.1016/j.newideapsych.2024.101127 Virtual reality analytics map (VRAM): a conceptual framework for detecting mental disorders using virtual reality data 2024 Conference Publication Whispers: playfully enhancing teamwork through ambiguity Elliott, Thomas C., Vashist, Nisha, Luanzon, Chaitanya Dasi, Gapusan, Enoe, Knibbe, Jarrod and Matthews, Ben (2024). Whispers: playfully enhancing teamwork through ambiguity. OzCHI 2024, Brisbane, QLD Australia, 30 November - 4 December 2024. New York, NY United States: Association for Computing Machinery. Whispers: playfully enhancing teamwork through ambiguity 2024 Conference Publication Using annotated portfolios to interrogate speculative designs: the case of emergent personal data trails Snow, Stephen, Khan, Awais Hameed, Matthews, Ben, Rodríguez, Inmaculada, Desjardines, Audrey, Seals, Ayanna, Sosa-Tzec, Omar, Tran, Anh-Ton, Pierce, James, Peng, Xiangjun and Viller, Stephen (2024). Using annotated portfolios to interrogate speculative designs: the case of emergent personal data trails. Australian Conference on Computer-Human Interaction OzChi 2024: Beyond being human, Brisbane, QLD Australia, 30 November - 4 December 2024. New York, NY United States: Association for Computing Machinery. doi: 10.1145/3726986.3727904 Using annotated portfoli",
  "content_length": 18900,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:46"
}