{
  "name": "Benjamin M. Marlin",
  "homepage": "https://groups.cs.umass.edu/marlin",
  "status": "success",
  "content": "Benjamin Marlin – Professor University of Massachusetts Amherst Search Google Appliance Enter the terms you wish to search for. Links to common UMass Amherst services and features College of Information and Computer Sciences Go.UMass Email SPIRE Moodle Blackboard Learn UDrive People Finder I am a professor in the Manning College of Information and Computer Sciences at the University of Massachusetts Amherst where I direct the Robust and Efficient Machine Learning  (REML) Lab. I was previously a fellow of both the Pacific Institute for the Mathematical Sciences and the Killam Trusts at the University of British Columbia where I was based in the Laboratory for Computational Intelligence in the Department of Computer Science. I completed my PhD in machine learning in the Department of Computer Science at the University of Toronto. Prospective Students Note: I will be on sabbatical in the 2026-2027 academic year and will not be taking new PhD students for fall 2026 or new honors thesis students in Spring 2026 through Spring 2027. Research Interests From a methodological perspective, my current research focuses on the development of machine learning models and algorithms that are both robust and efficient. The REML Lab studies multiple aspects of robustness including robustness to uncertainty and missing data, as well as multiple aspects of efficiency including data efficiency, computational scalability, and communication efficiency. The Lab’s foundations are in probabilistic machine learning and deep learning. Recent research topics include modeling sparse and irregularly sampled time series, methods for learning from scarce time series data data (including domain adaptation, active learning and Bayesian deep learning), and optimizing models for resource-constrained and real-time deployment. See the REML Lab web page for details on lab members, current and completed projects and publications. Research Collaborations My research is informed by multiple real-world application domains and machine learning deployment contexts including clinical and mobile health, embedded systems, and the Internet of Things. My lab has been supported by multiple large-scale collaborative research grants including the MD2k Center, the mDOT Center, MassAITC, and the IoBT Collaborative Research Alliance. Through these and other projects, my research group collaborates widely with behavioral scientists, health researchers, statisticians, engineers and computer scientists from UMass Amherst and across the country. Affiliations Robust and Efficient Machine Learning Lab Massachusetts AI & Technology Center for Connected Care in Aging & Alzheimer’s Disease CICS Center for Data Science CICS Center for Intelligent Information Retrieval UMass Computational Social Science Institute UMass Institute for Applied Life Sciences Center for Personalized Health Monitoring",
  "content_length": 2879,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:01"
}