{
  "name": "Benjamin Tag",
  "homepage": "https://www.unsw.edu.au/staff/benjamin-tag",
  "status": "success",
  "content": "Dr Benjamin Tag Type in a search term Search Follow Follow LinkedIn Facebook Instagram TikTok YouTube Back to Dr Benjamin Tag Senior Lecturer BA (FU Berlin), MA (Keio University), PhD (Keio University) Engineering Computer Science and Engineering Follow me Follow me I am a Senior Lecturer at UNSW Sydney, specializing in Human-Computer Interaction (HCI) and Ubiquitous Computing. My research explores how technology influences human cognition, emotion, and physiology, focusing on designing adaptive systems that enhance user experiences and support practical applications. My interdisciplinary work bridges computer science, biomechanics, and cognitive psychology by integrating physiological sensors and everyday devices to tackle challenges in fatigue modelling, mental state sensing, and Human-AI interaction. Before joining UNSW, I was a Lecturer at Monash University and a Postdoctoral Research Fellow at the University of Melbourne. I earned my PhD in March 2019 from Keio University, Japan, with a dissertation titled Cognitive State Assessments through Monitoring Physiological Signals on the Face. I am an active contributor to the HCI community, serving as an Associate Editor for PACM IMWUT and participating in ACM and IEEE conference committees. Additionally, I co-founded a startup and led as Director of Science at Optimal XR, translating cutting-edge research into real-world applications. E-mail benjamin.tag@unsw.edu.au Location K17 Publications Publications Media Media Grants Grants Awards Awards Research Activities Research Activities Engagement Engagement Teaching and Supervision Teaching and Supervision Books Book Chapters Edited Books Journal Articles Journal articles | 2025 Babaei E; Dingler T; Tag B; Velloso E, 2025, 'Should we use the NASA-TLX in HCI? A review of theoretical and methodological issues around Mental Workload Measurement', International Journal of Human Computer Studies, 201, http://dx.doi.org/10.1016/j.ijhcs.2025.103515 Journal articles | 2025 Jayasiriwardene S; Tag B; Withana A; Sarsenbayeva Z, 2025, 'More Than Words: The Impact of Voice Assistant Personality Traits on Failure Mitigation', Proceedings of the ACM on Interactive Mobile Wearable and Ubiquitous Technologies, 9, http://dx.doi.org/10.1145/3749518 Journal articles | 2025 Neigel P; Vargo A; Tag B; Kise K, 2025, 'Unobtrusive stress detection using wearables: application and challenges in a university setting', Frontiers in Computer Science, 7, http://dx.doi.org/10.3389/fcomp.2025.1575404 Journal articles | 2025 de Jong S; Paananen V; Tag B; van Berkel N, 2025, 'Cognitive Forcing for Better Decision-Making: Reducing Overreliance on AI Systems Through Partial Explanations', Proceedings of the ACM on Human Computer Interaction, 9, http://dx.doi.org/10.1145/3710946 Journal articles | 2025 van Berkel N; Visuri A; Shalawadi S; Evans MR; Tag B; Hosio S, 2025, 'From Reflection to Action: Enhancing Workplace Well-Being Through Digital Solutions', Interacting with Computers, 37, pp. 133 - 146, http://dx.doi.org/10.1093/iwc/iwae049 Journal articles | 2024 Jiang W; Windl M; Tag B; Sarsenbayeva Z; Mayer S, 2024, 'An Immersive and Interactive VR Dataset to Elicit Emotions', IEEE Transactions on Visualization and Computer Graphics, 30, pp. 7343 - 7353, http://dx.doi.org/10.1109/TVCG.2024.3456202 Journal articles | 2024 Li Y; Tag B; Dai S; Crowther R; Dwyer T; Irani P; Ens B, 2024, 'NICER: A New and Improved Consumed Endurance and Recovery Metric to Quantify Muscle Fatigue of Mid-Air Interactions', ACM Transactions on Graphics, 43, http://dx.doi.org/10.1145/3658230 Journal articles | 2024 van Berkel N; Tag B; Jacobsen RM; Russo D; Purchase HC; Buschek D, 2024, 'Impact of interaction technique in interactive data visualisations: A study on lookup, comparison, and relation-seeking tasks', International Journal of Human Computer Studies, 192, http://dx.doi.org/10.1016/j.ijhcs.2024.103359 Journal articles | 2023 Blackburn AM; Vestergren S; Tran TP; Stöckli S; Griffin SM; Ntontis E; Jeftic A; Chrona S; Ikizer G; Han H; Milfont TL; Parry D; Byrne G; Gómez-López M; Acosta A; Kowal M; De Leon G; Gallegos A; Perez M; Abdelrahman M; Ahern E; Yar AWA; Ahmed O; Alami NH; Amin R; Andersen LE; Araújo BO; Asongu NA; Bartsch F; Bavoľár J; Bhatta KR; Bircan T; Bita S; Bombuwala H; Brik T; Cakal H; Caniëls M; Carballo M; Carvalho NM; Cely L; Chang S; Chayinska M; Chen FY; Ch’ng B; Chukwuorji JBC; Costa AR; Dalizu VL; Deschrijver E; Dilekler Aldemir İ; Doherty AM; Doller R; Dubrov D; Elegbede S; Elizalde J; Ermagan-Caglar E; Fernández-Morales R; García-Castro JD; Gelpí R; Ghafori S; Goldberg X; González-Uribe C; Alpízar-Rojas H; Haugestad CAP; Higuera D; Hoorelbeke K; Hristova E; Hubená B; Huq H; Ihaya K; Jayathilake G; Jen E; Jinadasa A; Joksimovic J; Kačmár P; Kadreva V; Kalinova K; Kandeel HAA; Kellezi B; Khan S; Kontogianni M; Koszałkowska K; Hanusz K; Lacko D; Landa-Blanco M; Lee Y; Lieberoth A; Lins S; Liutsko L; Londero-Santos A; Mauritsen AL; Maegli MA; Magidie P; Maharjan R; Makaveeva T; Makhubela M; Malagón MG; Malykh S; Mamede S, 2023, 'Author Correction: COVIDiSTRESS diverse dataset on psychological and behavioural outcomes one year into the COVID-19 pandemic (Scientific Data, (2022), 9, 1, (331), 10.1038/s41597-022-01383-6)', Scientific Data, 10, http://dx.doi.org/10.1038/s41597-022-01896-0 Journal articles | 2023 Sarsenbayeva Z; van Berkel N; Hettiachchi D; Tag B; Velloso E; Goncalves J; Kostakos V, 2023, 'Mapping 20 years of accessibility research in HCI: A co-word analysis', International Journal of Human Computer Studies, 175, http://dx.doi.org/10.1016/j.ijhcs.2023.103018 Journal articles | 2023 Tag B; Van Berkel N; Verma S; Zhao BZH; Berkovsky S; Kaafar D; Kostakos V; Ohrimenko O, 2023, 'DDoD: Dual Denial of Decision Attacks on Human-AI Teams', IEEE Pervasive Computing, 22, pp. 77 - 84, http://dx.doi.org/10.1109/MPRV.2022.3218773 Journal articles | 2023 Vargo A; Tag B; Blakely C; Kise K, 2023, 'Poverty Traps in Online Knowledge-Based Peer-Production Communities', Informatics, 10, http://dx.doi.org/10.3390/informatics10030061 Journal articles | 2023 Wang C; Jiang W; Yang K; Sarsenbayeva Z; Tag B; Dingler T; Goncalves J; Kostakos V, 2023, 'Use of thermal imaging to measure the quality of hand hygiene', Journal of Hospital Infection, 139, pp. 113 - 120, http://dx.doi.org/10.1016/j.jhin.2023.05.016 Journal articles | 2023 Yang K; Tag B; Wang C; Gu Y; Sarsenbayeva Z; Dingler T; Wadley G; Goncalves J, 2023, 'Survey on Emotion Sensing Using Mobile Devices', IEEE Transactions on Affective Computing, 14, pp. 2678 - 2696, http://dx.doi.org/10.1109/TAFFC.2022.3220484 Journal articles | 2023 Yang K; Wang C; Gu Y; Sarsenbayeva Z; Tag B; Dingler T; Wadley G; Goncalves J, 2023, 'Behavioral and Physiological Signals-Based Deep Multimodal Approach for Mobile Emotion Recognition', IEEE Transactions on Affective Computing, 14, pp. 1082 - 1097, http://dx.doi.org/10.1109/TAFFC.2021.3100868 Journal articles | 2022 Blackburn AM; Vestergren S; Tran TP; Stöckli S; Griffin SM; Ntontis E; Jeftic A; Chrona S; Ikizer G; Han H; Milfont TL; Parry D; Byrne G; Gómez-López M; Acosta A; Kowal M; De Leon G; Gallegos A; Perez M; Abdelrahman M; Ahern E; Yar AWA; Ahmed O; Alami NH; Amin R; Andersen LE; Araújo BO; Asongu NA; Bartsch F; Bavoľár J; Bhatta KR; Bircan T; Bita S; Bombuwala H; Brik T; Cakal H; Caniëls M; Carballo M; Carvalho NM; Cely L; Chang S; Chayinska M; Chen FY; Ch’ng B; Chukwuorji JC; Costa AR; Dalizu VL; Deschrijver E; Aldemir İD; Doherty AM; Doller R; Dubrov D; Elegbede S; Elizalde J; Ermagan-Caglar E; Fernández-Morales R; García-Castro JD; Gelpí R; Ghafori S; Goldberg X; González-Uribe C; Alpízar-Rojas H; Haugestad CAP; Higuera D; Hoorelbeke K; Hristova E; Hubená B; Huq H; Ihaya K; Jayathilake G; Jen E; Jinadasa A; Joksimovic J; Kačmár P; Kadreva V; Kalinova K; Kandeel HAA; Kellezi B; Khan S; Kontogianni M; Koszałkowska K; Krzysztof H; Lacko D; Landa-Blanco M; Lee Y; Lieberoth A; Lins S; Liutsko L; Londero-Santos A; Mauritsen AL; Maegli MA; Magidie P; Maharjan R; Makaveeva T; Makhubela M; Malagón MG; Malykh S; Mamede S; Mandillah S; Mansoor MS, 2022, 'COVIDiSTRESS diverse dataset on psychological and behavioural outcomes one year into the COVID-19 pandemic', Scientific Data, 9, http://dx.doi.org/10.1038/s41597-022-01383-6 Journal articles | 2022 Tag B; Goncalves J; Webber S; Koval P; Kostakos V, 2022, 'A Retrospective and a Look Forward: Lessons Learned from Researching Emotions In-the-Wild', IEEE Pervasive Computing, 21, pp. 28 - 36, http://dx.doi.org/10.1109/MPRV.2021.3106272 Journal articles | 2022 Tag B; Sarsenbayeva Z; Cox AL; Wadley G; Goncalves J; Kostakos V, 2022, 'Emotion trajectories in smartphone use: Towards recognizing emotion regulation in-the-wild', International Journal of Human Computer Studies, 166, http://dx.doi.org/10.1016/j.ijhcs.2022.102872 Journal articles | 2022 Tag B; van Berkel N; Vargo AW; Sarsenbayeva Z; Colasante T; Wadley G; Webber S; Smith W; Koval P; Hollenstein T; Goncalves J; Kostakos V, 2022, 'Impact of the global pandemic upon young people's use of technology for emotion regulation', Computers in Human Behavior Reports, 6, http://dx.doi.org/10.1016/j.chbr.2022.100192 Journal articles | 2022 Vargo A; Ishimaru S; Islam MR; Tag B; Kise K, 2022, 'Obtaining Labels for In-the-Wild Studies: Using Visual Cues and Recall', IEEE Pervasive Computing, 21, pp. 9 - 17, http://dx.doi.org/10.1109/MPRV.2021.3129500 Journal articles | 2022 Wang C; Jiang W; Yang K; Sarsenbayeva Z; Tag B; Dingler T; Goncalves J; Kostakos V, 2022, 'A System for Computational Assessment of Hand Hygiene Techniques', Journal of Medical Systems, 46, http://dx.doi.org/10.1007/s10916-022-01817-z Journal articles | 2022 van Berkel N; Tag B; Goncalves J; Hosio S, 2022, 'Human-centred artificial intelligence: a contextual morality perspective', Behaviour and Information Technology, 41, pp. 502 - 518, http://dx.doi.org/10.1080/0144929X.2020.1818828 Journal articles | 2021 Liebero",
  "content_length": 47266,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:03"
}