{
  "name": "Benjamin Dowling",
  "homepage": "https://www.kcl.ac.uk/people/benjamin-dowling",
  "status": "success",
  "content": "Benjamin Dowling | King's College London Skip to main contentDr Benjamin Dowling Senior Lecturer in CryptographyResearch interestsComputer scienceContact detailsbenjamin.dowling@kcl.ac.ukBiographyBenjamin Dowling is a Senior Lecturer in Cryptography in the Department of Informatics, King's College London. Joining King's in August 2024, he was previously a Lecturer of Cybersecurity in the Security of Advanced Systems Research group at the University of Sheffield. Benjamin held postdoctoral researcher positions at the Applied Cryptography group at ETH Zurich, and at the Information Security Group at Royal Holloway, University of London with Kenny Paterson. He received his PhD at the Queensland University of Technology under the supervision of Douglas Stebila, which focused primarily on the provable security of internet protocols. Research interests Real-world cryptography Provable security Key exchange Secure messaging Post-quantum protocols ResearchResearchCybersecurityThe group studies design, modelling, analysis, verification and testing of networks and systems.NewsNews07 July 2025WhatsApp still vulnerable to security flaws discovered almost a decade agoThe first reverse-engineered version of the app otherwise retains a clean bill of health and full end-to-end encryption. Technology & ScienceResearchNewsResearchCybersecurityThe group studies design, modelling, analysis, verification and testing of networks and systems.News07 July 2025WhatsApp still vulnerable to security flaws discovered almost a decade agoThe first reverse-engineered version of the app otherwise retains a clean bill of health and full end-to-end encryption. Technology & Science(N)6.03Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering Sciences",
  "content_length": 1822,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:54"
}