{
  "name": "Benjamin C. M. Kao",
  "homepage": "https://www.cs.hku.hk/index.php/people/academic-staff/kao",
  "status": "success",
  "content": "Kao, B.C.M. The School of Computing and Data Science (https://www.cds.hku.hk/) was established by the University of Hong Kong on 1 July 2024, comprising the Department of Computer Science and Department of Statistics and Actuarial Science and Department of AI and Data Science. HomeAbout UsMessage to StudentsOur HistoryDept VideosComputing FacilitiesHow to Get Here & Where to StayLocation MapContact InformationPeopleAcademic StaffAdministrative StaffResearch StudentJob OpeningsTeaching & LearningUndergraduateBEng (Computer Science)AdmissionCurriculumAcademic AdvisingProg Objectives & Learning OutcomesCourse DescriptionsCareer ProspectsBASc(FinTech)OverviewAdmissionCurriculumAcademic AdvisingProgramme Learning OutcomesCareer Prospects2nd Major in CSMinor in Computer Science BBA(IS)/BEng(CompSc)Course OfferedFinal Year ProjectsFinal Year Project ExhibitionFinal Year Project CompetitionIndustry-based ProjectsDownload AreaPostgraduateResearch BasedMPhil/PhDProgramme StructureAdmissionFurther InquiriesStudent Conference Travel SupportCourse Offered and Seminar RequirementsTaught BasedMSc(CompSc)MSc(ECom&IComp)MSc(FTDA) MDASCMSc(AI)ResearchResearch Groups & LaboratoriesInnovation & Technology ProjectsResearch ProjectsResearch HighlightsMajor FacilitiesCS Past ThesesCS Technical ReportsCS Research InternshipNews & EventsIn the MediaPhoto GallerySeminars and EventsNews and AnnouncementsCompetitionsAbout the StudentsStudent Bodies Hiring StudentsInformation for EmployersHKUCS Job Portal MENU HomeAbout UsMessage to StudentsOur HistoryDept VideosComputing FacilitiesHow to Get Here & Where to StayLocation MapContact InformationPeopleAcademic StaffAdministrative StaffResearch StudentJob OpeningsTeaching & LearningUndergraduateBEng (Computer Science)AdmissionCurriculumAcademic AdvisingProg Objectives & Learning OutcomesCourse DescriptionsCareer ProspectsBASc(FinTech)OverviewAdmissionCurriculumAcademic AdvisingProgramme Learning OutcomesCareer Prospects2nd Major in CSMinor in Computer Science BBA(IS)/BEng(CompSc)Course OfferedFinal Year ProjectsFinal Year Project ExhibitionFinal Year Project CompetitionIndustry-based ProjectsDownload AreaPostgraduateResearch BasedMPhil/PhDProgramme StructureAdmissionFurther InquiriesStudent Conference Travel SupportCourse Offered and Seminar RequirementsTaught BasedMSc(CompSc)MSc(ECom&IComp)MSc(FTDA) MDASCMSc(AI)ResearchResearch Groups & LaboratoriesInnovation & Technology ProjectsResearch ProjectsResearch HighlightsMajor FacilitiesCS Past ThesesCS Technical ReportsCS Research InternshipNews & EventsIn the MediaPhoto GallerySeminars and EventsNews and AnnouncementsCompetitionsAbout the StudentsStudent Bodies Hiring StudentsInformation for EmployersHKUCS Job Portal Home People Academic Staff Kao, B.C.M. Professor Kao, Benjamin C.M. BSc HK; PhD Princeton Professor Tel: (+852) 2857 8445 Fax: (+852) 2559 8447 Email: kao@cs.hku.hk Homepage: https://www.cs.hku.hk/~kao Professor Ben Kao is a professor in the Department of Computer Science at The University of Hong Kong. He received the BSc degree in computer science from The University of Hong Kong in 1989, the PhD degree in computer science from Princeton University in 1995. From 1989-1991, he was a teaching and research assistant at Princeton University. From 1992-1995, he was a research fellow at Stanford University. Professor Kao has published extensively in various international journals, conference proceedings, and books. (DBLP records) He has also served as program committee member for many international computer conferences and as reviewer for many journals. Professor Kao's research interests include database management systems, data mining, real-time systems, and information retrieval systems. Research Interests Database Management Systems, Data Mining, Real-time Systems, and Information Retrieval Systems Selected Publications Ben Kao, S.D. Lee, Foris Lee, David Cheung, W.S. Ho, Clustering Uncertain Data Using Voronoi Diagrams and R-Tree Index, in IEEE Transaction on Knowledge and Data Engineering (IEEE TKDE). Smith Tsang, Ben Kao, Kevin Y. Yip, Wai-Shing Ho, S.D. Lee, Decision Trees for Uncertain Data, in IEEE Transactions on Knowledge and Data Engineering (IEEE TKDE). Minghua Zhang, Ben Kao, David Cheung and Kevin Yip, Mining Periodic Patterns with Gap Requirement from Sequences, in ACM Transactions on Knowledge Discovery from Data (ACM TKDD), Volume 1, Issue 2 (August 2007). Chun-Kit Chui, Eric Lo, Ben Kao and David W. Cheung, S-OLAP: an OLAP system for analysis sequence data, in the proceedings of ACM SIGMOD International Conference on Management of Data 2010 (SIGMOD 2010), Indianapolis, USA, June 2010. Bin Bi, Lifeng Shang, Ben Kao, Collaborative Resource Discovery in Social Tagging Systems, in the proceedings of the 18th ACM Conference on Information and Knowledge Management (CIKM 2009), Hong Kong, November 2009. Recent Research Grants Online Analytical Processing on Sequence Data, GRF, 2008 Computational Issues in Mining Uncertain Data, GRF, 2006 Computational problems in sequence mining, RGC, 2002-2004 Computational problems in sequence mining, RGC, 2002 Music retrieval in digital library, RGC, 1999-2001 Efficient data structure and algorithms for WWW information retrieval, RGC, 1998-2000 HomeAbout UsMessage to StudentsOur HistoryDept VideosComputing FacilitiesHow to Get Here & Where to StayLocation MapContact InformationPeopleAcademic StaffAdministrative StaffResearch StudentJob OpeningsTeaching & Learning UndergraduateBEng (Computer Science)AdmissionCurriculumAcademic AdvisingProg Objectives & Learning OutcomesCourse DescriptionsCareer ProspectsBASc(FinTech)OverviewAdmissionCurriculumAcademic AdvisingProgramme Learning OutcomesCareer Prospects2nd Major in CSMinor in Computer Science BBA(IS)/BEng(CompSc)Course OfferedFinal Year ProjectsFinal Year Project ExhibitionFinal Year Project CompetitionIndustry-based ProjectsDownload AreaPostgraduateResearch BasedMPhil/PhDProgramme StructureAdmissionFurther InquiriesStudent Conference Travel SupportCourse Offered and Seminar RequirementsTaught BasedMSc(CompSc)MSc(ECom&IComp)MSc(FTDA) MDASCMSc(AI)Research Research Groups & LaboratoriesInnovation & Technology ProjectsResearch ProjectsResearch HighlightsMajor FacilitiesCS Past ThesesCS Technical ReportsCS Research InternshipNews & Events In the MediaPhoto GallerySeminars and EventsNews and AnnouncementsCompetitionsAbout the Students Student Bodies Hiring StudentsInformation for EmployersHKUCS Job Portal Don't have an account yet?\t\tRegister Now! × Sign in to your account Username * Password * Remember me Log in Forgot your username? Forgot your password?",
  "content_length": 6645,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:52"
}