{
  "name": "Benjamin Golub",
  "homepage": "https://bengolub.net",
  "status": "success",
  "content": "Ben Golub - economics and computer science professor at Northwestern Skip to main content Hit enter to search or ESC to close Close Search Benjamin Golub Professor Department of Economics and Department of Computer Science (by courtesy) Northwestern University Google Scholar profile    CV Surveys Eigenvalues in Microeconomics 2025    arXiv How spectral methods power the microeconomics of networks, from social influence to complex markets. More Square matrices often arise in microeconomics, particularly in network models addressing applications from opinion dynamics to platform regulation. Spectral theory provides powerful tools for analyzing their properties. We present an accessible overview of several fundamental applications of spectral methods in microeconomics, focusing especially on the Perron-Frobenius Theorem’s role and its connection to centrality measures. Applications include social learning, network games, public goods provision, and market intervention under uncertainty. The exposition assumes minimal social science background, using spectral theory as a unifying mathematical thread to introduce interested readers to some exciting current topics in microeconomic theory. Networks and Economic Fragility (with Matt Elliott) Annual Review of Economics 2022    Publisher's Site Bad shocks, even fairly small ones, can cause a lot of damage because of network propagation mechanisms. This is a survey of relevant facts and theories, with a focus on extensive margin channels: firms or relationships between them not functioning for a while. More Many firms, banks, or other economic agents embedded in a network of codependencies may experience a contemporaneous, sharp drop in functionality or productivity following a shock—even if that shock is localized or moderate in magnitude. We offer an extended review of motivating evidence that such fragility is a live concern in supply networks and in financial systems. Network models of fragility are then reviewed, focusing on the forces that make aggregate functionality especially sensitive to the economic environment. We consider the key structural features of networks that determine their fragility, emphasizing the importance of phase transitions. We then turn to endogenous decisions, both by agents in the models (e.g., firms investing in network formation and robustness) and by planners (e.g., an authority undertaking macroprudential regulation), and discuss some distinctive implications of fragility phenomena for such decisions. Networks in Economic Development (with Emily Breza, Arun Chandrasekhar, and Aneesha Parvathaneni) Oxford Review of Exonomic Policy 2019    Publisher's Site A survey of network models, especially on information diffusion and risk sharing, in the context of economic development. More This chapter surveys the implications of studies in network economics for economic development. We focus on information flow and risk-sharing—two topics where work in theory, empirics, and policy analysis have been especially intensive and complementary. In analysing information, we distinguish models of information diffusion and aggregation, and highlight how different models imply very different guidance regarding the right way to seed information. In discussing risk-sharing, we look at the key frictions that impede efficient informal insurance, and some potential unintended consequences when policymakers intervene to help. Throughout, we stress practical insights that can be used with limited measurement of the details of networks. Learning in Social Networks (with Evan Sadler) The Oxford Handbook of the Economics of Networks 2016    SSRN    Oxford Handbook A broad overview of two kinds of network learning models: (i) sequential ones in the tradition of information cascades and herding, and (ii) iterated linear updating models (DeGroot), along with their variations, foundations, and critiques. Ideal for a graduate course. More This survey covers models of how agents update behaviors and beliefs using information conveyed through social connections. We begin with sequential social learning models, in which each agent makes a decision once and for all after observing a subset of prior decisions; the discussion is organized around the concepts of diffusion and aggregation of information. Next, we present the DeGroot framework of average-based repeated updating, whose long- and medium-run dynamics can be completely characterized in terms of measures of network centrality and segregation. Finally, we turn to various models of repeated updating that feature richer optimizing behavior, and conclude by urging the development of network learning theories that can deal adequately with the observed phenomenon of persistent disagreement. The two parts (sequential and DeGroot) may be read independently, though we take care to relate the different literatures conceptually. Companion handwritten lecture notes on DeGroot part Published and forthcoming research papers When Less is More: Experimental Evidence on Information Delivery During India’s Demonetization (with Abhijit Banerjee, Emily Breza, and Arun Chandrasekhar) Review of Economic Studies 2024     SSRN  NBER  Publisher's Site Suppose people are worried about how asking questions makes them look. Then giving information to fewer people can make for greater diffusion and better learning, in theory and in practice. More How should information be disseminated to large populations? The options include broadcasts (e.g., via mass media) and informing a small number of “seeds” who then spread the message. While it may seem natural to try to reach the maximum number of people from the beginning, we show, theoretically and experimentally, that information frictions can reverse this result when incentives to seek are endogenous to the information policy. In a field experiment during the chaotic 2016 Indian demonetization, we varied how information about the policy was delivered to villages along two dimensions: how many people were initially informed (i.e. broadcasting versus seeding) and whether the identities of the initially informed were publicly disclosed (common knowledge). The quality of information aggregation is measured in three ways: the volume of conversations about demonetization, the level of knowledge about demonetization rules, and choice quality in a strongly incentivized decision dependent on understanding the rules. Under common knowledge, broadcasting performs worse and seeding performs better (relative to no common knowledge). Moreover, with common knowledge, seeding is the more effective strategy of the two. These comparisons hold on all three outcomes. First version: October 20, 2017. On the Difficulty of Characterizing Network Formation with Endogenous Behavior (with Yu-Chi Hsieh and Evan Sadler) Mathematical Social Sciences 2024    arXiv  Publisher's Site A recent paper claimed to show that if we combine a coordination game with a network formation game, players naturally sort themselves into cliques with others putting in similar effort levels. But the paper’s analysis is flawed and the result is not correct. More Bolletta (Mathematical Social Sciences, 2021) studies a model in which a network is strategically formed and then agents play a linear best-response investment game in it. The model is motivated by an application in which people choose both their study partners and their levels of educational effort. Agents have different one-dimensional types—private returns to effort. A main result claims that (pairwise Nash) stable networks have a locally complete structure consisting of possibly overlapping cliques: if two agents are linked, they are part of a clique composed of all agents with types between theirs. A counterexample shows that the claimed characterization is incorrect. We specify where the analysis errs and discuss implications for network formation models. Learning from Neighbors about a Changing State (with Krishna Dasaratha and Nir Hak) Review of Economic Studies 2023      arXiv  SSRN  Appendix  EC 18 conference version  Slides  Publisher's Site A model of learning in a network where agents use neighbors’ estimates linearly (as in the famously tractable DeGroot model) but their learning is fully rational and the updating rules are an equilibrium outcome. The rational modeling substantially changes predictions about when a society learns well. More Agents learn about a changing state using private signals and their neighbors’ past estimates of the state. We present a model in which Bayesian agents in equilibrium use neighbors’ estimates simply by taking weighted sums with time-invariant weights. The dynamics thus parallel those of the tractable DeGroot model of learning in networks, but arise as an equilibrium outcome rather than a behavioral assumption. We examine whether information aggregation is nearly optimal as neighborhoods grow large. A key condition for this is signal diversity: each individual’s neighbors have private signals that not only contain independent information, but also have sufficiently different distributions.  Without signal diversity—e.g., if private signals are i.i.d.—learning is suboptimal in all networks and highly inefficient in some.  Turning to social influence, we find it is much more sensitive to one’s signal quality than to one’s number of neighbors, in contrast to standard models with exogenous updating rules. Final version: December 2022. First version: January 6, 2018. Exit Spirals in Coupled Networked Markets (with Christoph Aymanns and Co-Pierre Georg) Operations Research 2023     SSRN  Publisher's Site Strategic agents are involved in two different networks simultaneously. Activity is complementary across networks, and across neighbors. Equilibrium activity in a coupled-network can be very fragile to an aggregate shock, though either network on its own would be robust. More Strategic agents choose whether to be active in networked markets. The v",
  "content_length": 45806,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:57"
}