{
  "name": "Benjamin Lok",
  "homepage": "http://www.lokben.com",
  "status": "success",
  "content": "Benjamin Lok - Personal Homepage Benjamin Lok, Ph.D. Professor, Graduate Program Director CISE, Faculty Liaison for NSF I-Corp Southeast Hub Computer and Information Science and Engineering Department University of Florida Malachowsky Hall 5400E, lok@ufl.edu CV bio Benjamin Lok, Ph.D.Professor, Graduate Program Director CISE, Faculty Liaison for NSF I-Corp Southeast Hub Computer and Information Science and Engineering Department University of Florida Malachowsky Hall 5400E, lok@ufl.edu CVbio tl;dr – New Ph.D. students to my research group can only be supported by a department TA-ship. Everyone who applies is given full consideration. List me as one of the professors you are interested in working with. No, you don’t need to email me ahead of time. Research If you are interested in learning about Entrepreneurship: The lessons learned from taking virtual patients from research to realization, please email me. If you are interested in learning about Virtual Reality research: If you are not a UF student and are looking for a graduate research assistantship (RA), teaching assistantship (TA), or grader, do not email me to evaluate your resume. Please apply to the University of Florida. That’s all you need to do. Read the info on funding here. If you are an undergraduate UF student looking for research experience, welcome! I too was an undergraduate researcher and my research group supports undergraduates pursuing research. We do require students apply by at latest with at least two years remaining. Next, Learn about the work we do and how to join us: Visit the Virtual Experiences Research Group where we research how to improve how humans communicate by creating virtual experiences that improve people’s communication skills, training, and health. Check out our OKRs (inspired by Measure What Matters by John Doerr) If you an undergraduate UF student looking for senior projects/independent study: Information for senior projects/independent study. I am a part of Human-Centered Computing@UF, Previous presentations, NSF Early CAREER Proposal. Teaching: Spring 2026, Fall 2025, Spring 2025, Fall 2024 – no classes Previous courses User Experience Design (Spring 2024, Fall 2023, Spring 2023, Fall 2022) VR for the Social Good (Fall 2020, Spring 2019, Fall 2018, Spring 2018 (sabbatical), Fall 2017 (sabbatical)) Human-Computer Interaction (Spring 2017, Spring 2021), Virtual Reality (Spring 2016), Computer Graphics (Spring 2008) Service: * Graduate Program Director -Please read information for current graduate students,  graduate admissions information and admissions FAQ pages before emailing me. With over 2,000 applicants and 1000 enrolled students , we work hard to keep our online information accurate and up to date. I receive dozens of emails daily, so if your question is already answered in the FAQs, I will not be able to respond. For unique questions not covered in the FAQ, I’ll do my best to reply. Bio: Ben is a Professor and Graduate Program Director in UF’s CISE department and CTO of Rovex, Inc. He co-founded Shadow Health (acquired by Elsevier) and leads the Virtual Experiences Research Group, where we build virtual humans and mixed-reality systems to train real-world communication skills—especially in healthcare. He’s UF’s Faculty Lead for the NSF I-Corps Southeast Regional Hub and was inducted into the inaugural IEEE VGTC VR Academy. Our group publishes and wins awards at IEEE VR, IVA, and ACM I3D; we like projects that ship, not just papers. If you want to turn ideas into tools used by clinicians, learners, and robots, come talk to us. My homepage © 2025 by benjamin Lok is licensed under Attribution-NoDerivatives 4.0 International",
  "content_length": 3688,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:03"
}