{
  "name": "Benjamin Weyers",
  "homepage": "https://www.uni-trier.de/index.php?id=68465",
  "status": "success",
  "content": "Benjamin Weyers | Universität Trier Univ.-Prof. Dr.-Ing. Benjamin WeyersRaum H 424Telefon: +49 (0)651 201-2852Email: weyers[at]uni-trier.deKurzbiografieBenjamin Weyers leitet seit Dezember 2018 die Professur für Human-Computer Interaction (eingerichtet als Juniorprofessur für praktische Informatik) an der Universität Trier. Zuvor war er seit 2013 als Postdoc in der Virtual Reality and Immersive Visualization Group an der RWTH Aachen tätig. An der Universität Duisburg-Essen hat er Angewandte Informatik studiert und anschließend im Bereich der formalen Modellierung für die Entwicklung interaktiver Systeme promoviert (Diplom 2008, Promotion 2011). Seine primären Interessen in Forschung und Lehre liegen in der wissenschaftlichen Entwicklung und Untersuchung interaktiver Systeme mit dem spezifischen Fokus auf der Verwendung von Virtual und Augmented Reality-Technologie in alltäglichen Arbeitskontexten und -umgebungen. Neben seiner Tätigkeit in Forschung und Lehre ist er als Gutachter für verschiedene Journale und Konferenzen tätig. Weiterhin ist er in die Organisation verschiedener wissenschaftlicher Workshops und Konferenzen involviert und in Fachgruppen der Gesellschaft für Informatik sowie der International Federation of Information Processing (IFIP) engagiert. Benjamin Weyers unterstützt zudem die Studienstiftung des deutschen Volkes als Gutachter in Auswahlverfahren.  Mehr...ProjekteIVAA – Intentionales Vergessen von Gewohnheiten im Arbeitsalltag – DFG SPP 1921AR für Ambient Awareness - DFGMitgliedschaftenIEEE, ACM, GILiteraturverzeichnis (Auszug)Google Scholar:https://scholar.google.de/citations?user=L7JClToAAAAJ&hl=enDBLP: http://dblp.uni-trier.de/pers/hd/w/Weyers:BenjaminResearch Gate: https://www.researchgate.net/profile/Benjamin_WeyersORCID:https://orcid.org/0000-0003-4785-708XBücherWeyers, B. (2012). Reconfiguration of User Interface Models for Monitoring and Control of Human-Computer Systems. Dissertation, Berlin, Dr. Hut Verlag, ISBN 978-3-8439-0440-7. Weyers, B., Baloian, N., & Luther, W. (Eds.). (2013). Readings of the Chilean Workshop on Ambient Intelligence in Metropolitan Regions. Berlin, Logos.Weyers, B., Bowen, J., Dix, A., & Palanque, P. (Eds.). (2017), The Handbook on Formal Methods in Human Computer Interaction. Berlin, Heidelberg, Springer.Artikel (Auswahl)Weyers, B., Luther, W., & Baloian, N. (2010). Interface creation and redesign techniques in collaborative learning scenarios. Journal for Future Generation Computer Systems, 27(1), 127–138. doi:10.1016/j.future.2010.05.001Weyers, B., Luther, W., & Baloian, N. (2012). Cooperative Reconfiguration of User Interfaces for Learning Cryptographic Algorithms. Journal of Information Technology and Decision Making, 11(6), 1127–1154. doi:10.1142/S0219622012400172Weyers, B., Burkolter, D., Luther, W., & Kluge, A. (2012). Formal Modeling and Reconfiguration of User Interfaces for Reduction of Human Error in Failure Handling of Complex Systems. Journal of Human Computer Interaction, 28(1), 646–665. doi:10.1080/10447318.2011.654199Burkolter, D., Weyers, B., Kluge, A., & Luther, W. (2014). Customization of user interfaces to reduce errors and enhance user acceptance. Applied Ergonomics, 45(2), 346–353. doi:10.1016/j.apergo.2013.04.017Weyers, B., Borisov, N. & Luther, W. (2014). Creation of Adaptive User Interfaces Through Reconfiguration of User Interface Models Using an Algorithmic Rule Generation Approach. International Journal on Advances in Intelligent Systems, 7(1&2), 302–336.Stückrath, J., & Weyers, B. (2014). Lattice-extended Coloured Petri Net Rewriting for Adaptable User Interface Models. Electronic Communications of the EASST, 67(13), 13 pages. doi:10.14279/tuj.eceasst.67Kluge, A., Greve, J., Borisov, N., & Weyers, B. (2014). Exploring the usefulness of two variants of gaze-guiding-based dynamic job aid for performing a fixed sequence start up procedure after longer periods of non-use. Human Factors and Ergonomics, 3(2), 148–169. doi:10.1504/IJHFE.2014.067819Rebner, G., Sacher, D., Weyers, B., & Luther, W. (2015). Verified stochastic methods in geographic information system applications with uncertainty. Structural Safety, 52(B), 244–259. doi:10.1016/j.strusafe.2014.05.002Braier, J., Lattenkamp, K., Räthel, B., Schering, S., Wojatzki, M., & Weyers, B. (2015). Haptic 3D Surface Representation of Table-Based Data for People with Visual Impairments. ACM Transactions on Accessible Computing, 6(1), 1–35. doi:10.1145/2700433Nowke, C., Zielasko, D., Weyers, B., Hentschel, B., Peyser, A., & Kuhlen, T.W. (2015). Integrating Visualizations into Modeling NEST Simulations. Frontiers in Neuroinformatics, 9, 29 pages. doi:10.3389/fninf.2015.00029Weyers, B., Frank, B., Bischof, K., & Kluge, A. (2015). Gaze Guiding as Support for the Control of Technical Systems. International Journal of Information Systems for Crisis Response and Management, 7(2), 59–80. doi:10.4018/IJISCRAM.2015040104Kötteritzsch, A., & Weyers, B. (2016). Assistive Technologies for Older Adults in Urban Areas: A Literature Review. Cognitive Computation, 8(2), 299–317. doi:10.1007/s12559-015-9355-7Freitag, S., Weyers, B., & Kuhlen, T.W. (2016). Examining Rotation Gain in CAVE-like Virtual Environments. Transactions on Visualization and Computer Graphics, 22(4), 1462–1471. doi:10.1109/TVCG.2016.2518298Pick, S., Weyers, B., Hentschel, B., & Kuhlen, T.W. (2016). Design and Evaluation of Data Annotation Workflows for CAVE-like Virtual Environments. Transactions on Visualization and Computer Graphics, 22(4), 1452–1461. doi:10.1109/TVCG.2016.2518086Hänel, C., Weyers, B., Hentschel, B., & Kuhlen, T.W. (2016). Visual Quality Adjustment for Volume Rendering in a Head-Tracked Virtual Environment. Transactions on Visualization and Computer Graphics, 22(4), 1472–1481. doi:10.1109/TVCG.2016.2518338Zielasko, D., Weyers, B., Hentschel, B., Kuhlen, T.W. (2016). Interactive 3D Force-Directed Edge Bundling. Computer Graphics Forum, 35(3), 51–60. doi:10.1111/cgf.12881Biella, D., Pilz, T., Sacher, D., Weyers, B., Luther, W., Baloian, N., Schreck, T. (2016). Crowdsourcing and Co-curation in Virtual Museums: A Practice-driven Approach. Journal of Universal Computer Science, 22(10), 1277–1297. doi:10.3217/jucs-022-10-1277Nowke, C., Diaz-Pier, S., Weyers, B., Hentschel, B., Morrison, A., Kuhlen, T.W., Peyers, A. (2018). Toward Rigorous Parameterization of Underconstrained Neural Network Models Through Interactive Visualization and Steering of Connectivity Generation. Frontiers in Neuroinformatics, 12, 32 pages. doi:10.3389/fninf.2018.00032Senk, J., Carde, C., Hagen, E., Kuhlen, T.W., Diesmann, M., Weyers, B. (2018). VIOLA - A multi-purpose and web-based visualization tool for neuronal-network simulation output. Frontiers in Neuroinformatics, 12, 75 pages. doi: 10.3389/fninf.2018.00075Borisov, N., Weyers, B., Kluge, A. (2018). Designing a Human Machine Interface for Quality Assurance in Car Manufacturing: An Attempt to Address the “Functionality versus User Experience Contradiction” in Professional Production Environments. Advances in Human-Computer Interaction, 2018, 18 pages. doi: 10.1155/2018/9502692Weyers, B., Auer, E., Luther, W. (2019). The Role of Verification and Validation Techniques within Visual Analytics. Journal of Universal Computer Science, 25(8), 967–987.Zielasko, D., Zhao, X., Demiralp, A. C., Kuhlen, T. W., Weyers, B. (2019). Voxel-Based Edge Bundling Through Direction-Aware Kernel Smoothing. Computers & Graphics, 83, 87–96. doi: 10.1016/j.cag.2019.06.008Weyers, B., Frank, B. & Kluge, A. (2020), A Formal Modeling Framework for the Implementation of Gaze Guiding as an Adaptive Computer-Based Job Aid for the Control of Complex Technical Systems, International Journal of Human–Computer Interaction, 36(8), 748-776. doi: 10.1080/10447318.2019.1687234Luther, W., Auer, E. & Weyers, B. (2020), Reliable Visual Analytics, a Prerequisite for Outcome Assessment of Engineering Systems, Acta Cybernetica 24(3), 287-314. doi: 10.14232/actacyb.24.3.2020.3Thomaschewski, L., Weyers, B., & Kluge, A. (2021). A Two-Part Evaluation Approach for Measuring the Usability and User Experience of an Augmented Reality-based Assistance System to Support the Temporal Coordination of Spatially Dispersed Teams. Cognitive Systems Research, 68, 1-17. doi: 10.1016/j.cogsys.2020.12.001Bowen, J., Dittmar, A., & Weyers, B. (2021). Task modelling for interactive system design: A survey of historical trends, gaps and future needs. Proceedings of the ACM on Human-Computer Interaction, 5(EICS), 1-22. doi: 10.1145/3461736Spreizer, S., Senk, J., Rotter, S., Diesmann, M., & Weyers, B. (2021). NEST Desktop, an Educational Application for Neuroscience. Eneuro, 8(6). doi: 10.1523/ENEURO.0274-21.2021Sonnentag, S., Wehrt, W., Weyers, B., & Law, Y. C. (2022). Conquering unwanted habits at the workplace: Day-level processes and longer term change in habit strength. Journal of Applied Psychology, 107(5), 831. doi: 10.1037/apl0000930Kreutz, C. K., Wolz, M., Knack, J., Weyers, B., & Schenkel, R. (2022). SchenQL: in-depth analysis of a query language for bibliographic metadata. International Journal on Digital Libraries, 23(2), 113-132. doi: 10.1007/s00799-021-00317-8Bowen, J., Weyers, B., & Liu, B. (2022). Creating Formal Models from Informal Design Artefacts. International Journal of Human–Computer Interaction, 1-18. doi: 10.1080/10447318.2022.2095833Prinz, L. M., Mathew, T., & Weyers, B. (2022). A Systematic Literature Review of Virtual Reality Locomotion Taxonomies. IEEE Transactions on Visualization and Computer Graphics. doi: 10.1109/TVCG.2022.3206915Law, Y. C., Wehrt, W., Sonnentag, S., & Weyers, B. (2023). Obtaining semi-formal models from qualitative data: From interviews into BPMN models in user-centered design processes. International Journal of Human–Computer Interaction, 39(3), 476-493. doi: 10.1080/10447318.2022.2041899 Besucheradresse: Universität TrierFB IV - InformatikwissenschaftenHuman-Computer InteractionCampus II - Gebäude H - Raum 424",
  "content_length": 10124,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:05"
}