{
  "name": "Benjamin Peherstorfer",
  "homepage": "https://cims.nyu.edu/~pehersto",
  "status": "success",
  "content": "Benjamin Peherstorfer - Courant Institute of Mathematical Sciences, New York University Benjamin Peherstorfer   |   Courant Institute of Mathematical Sciences, New York University HOME RESEARCH GROUP CODE TEACHING PUBLICATIONS Benjamin Peherstorfer Associate Professor Courant Institute of Mathematical Sciences | New York University 251 Mercer Street, New York, NY 10012 Research (Google Scholar) computational mathematics, machine learning, computational statistics, numerical analysis, and scientific computing Contact pehersto at cims dot nyu dot edu | 212 998 3297 | Warren Weaver Hall (WWH), Room 421 Download short bio News Sep 2025 Looking forward to serving on the editorial board of Numerische Mathematik. Sep 2025 Very much looking forward to giving an invited presentation at the 10th Workshop on High-Dimensional Approximation in Bonn, Germany. Jul 2025 Congratulations to Yifan Chen who is starting a new position as a tenure-track assistant professor in the Department of Mathematics at University of California, Los Angeles (UCLA). Jun 2025 Wonderful to have the opportunity to present our work on learning population dynamics from data at the IMSI workshop on Statistical and Computational Challenges in Probabilistic Scientific Machine Learning (SciML). Jun 2025 Great pleasure to moderate the discussion on probabilistic methods for inverse problems at the workshop on Inverse Methods for Complex Systems under Uncertainty, sponsored by the U.S. Department of Energy, Office of Science, Advanced Scientific Computing Research. May 2025 Invited to present our work on nonlinear reduced modeling and learning population dynamics at the trimester on Particles, Fluids and Patterns: Analytical and Computational Challenges at the Gran Sasso Science Institute (GSSI). Mar 2025 Looking forward to giving an invited presentation at the Annual Meeting of the European Mathematical Society Activity Group on Scientific Machine Learning. Jan 2025 Great honor to have been elected to serve as Secretary of the SIAM Activity Group on Computational Science and Engineering. Jan 2025 Looking forward to serving on the editorial board of Springer's Journal of Scientific Computing. Dec 2024 Excited to give a Distinguished Seminar in Computational Science and Engineering at the Massachusetts Institute of Technology. Expand Nov 2024 Co-organizer of workshop on Reduced Order and Surrogate Modeling for Digital Twins at the Institute for Mathematical and Statistical Innovation. It will be held as part of the Long Program on Digital Twins in November 2025. Oct 2024 Co-organizer of Long Program on Multi-Fidelity Methods for Fusion Energy that will be hosted at Institute for Pure & Applied Mathematics (IPAM) in Spring 2026. Looking very much forward to it. May 2024 Congratulations to Jules Berman for winning the Harold Grad Memorial Prize. Jan 2024 Excited to join the editorial boards of the SIAM Journal on Scientific Computing and SIAM/ASA Journal on Uncertainty Quantification. Jan 2024 Co-editing invited special issue on generative modeling for predictive simulations and decision-making in science and engineering that will be published in CMAME. Oct 2023 Big congratulations to Jules Berman for getting his work on Randomized Sparse Neural Galerkin Schemes for Solving Evolution Equations with Deep Networks accepted as a Spotlight Paper at NeurIPS 2023. Oct 2023 Looking forward to working as a team of seven PIs on learning fast computational models from data to accelerate energy breakthroughs, as part of a Department of Energy project developing Science Foundations for Energy Earthshots. Press release. Sep 2023 Looking forward to serving as one of the editors of the book series Numerical Mathematics and Scientific Computation of Oxford University Press. Aug 2023 It is a great honor to be a plenary speaker at the International Conference on Spectral and High Order Methods (ICOSAHOM) 2023. Aug 2023 Congratulations to Steffen Werner who is starting a new position as a tenure-track assistant professor in the Department of Mathematics at Virginia Tech. Apr 2023 Excited to have the opportunity to visit the Isaac Newton Institute again and participate in the program on The Mathematical and Statistical Foundation of Future Data-Driven Engineering with a talk about our work on Context-Aware Controller Inference from Scarce Data. Apr 2023 Looking very much forward to speaking at the Workshop on Scientific Machine Learning at the Oden Institute. Feb 2023 Co-organizing minisymposium on Nonlinear approximations of latent dynamics for model reduction and beyond at the SIAM Conference on Computational Science and Engineering 2023. Dec 2022 Our work on multi-fidelity gradient sampling for non-smooth, non-convex optimization and robust control (to appear in SISC) is highlighted in the Year In Review 2022 issue of Aerospace America. Sep 2022 Congratulations to Frederick Law for winning the Moses A. Greenfield Research Prize. Sep 2022 Co-organizing minisymposium on Learning from scarce data at the SIAM Conference on Mathematics of Data Science 2022. Sep 2022 Excited to serve on the Scientific Committee of the conference on Model Reduction and Surrogate Modeling (MORE) that will be held in Berlin, Germany in September 2022. Aug 2022 Looking forward to Mathematical and Scientific Machine Learning (MSML) 2022 and happy to serve on the program committee. Jul 2022 Co-organizing minisymposium on Model Reduction for Chemically Reacting Flows: Challenges, Advances, and Benchmarks at the SIAM Annual Meeting 2022. Additionally information and benchmarks for model reduction of chemically reacting flows can be found here. Jun 2022 Looking forward to giving an invited tutorial presentation on multi-fidelity uncertainty quantification at the AIAA Aviation Forum. Apr 2022 Happy to have the opportunity to highlight the exciting field of nonlinear model reduction, which is emerging at the intersection of scientific computing and machine learning, in the featured article on Breaking the Kolmogorov Barrier with Nonlinear Model Reduction that appeared in the Notices of the American Mathematical Society. Feb 2022 Invited speaker at the workshop on The Mathematics of Soft Matter, which is held at the Institute for Mathematical and Statistical Innovation (IMSI). Jan 2022 Looking forward to serving as a panelist in the session on data-driven methods for simulating chemically reacting flows at the upcoming American Institute of Aeronautics and Astronautics (AIAA) SciTech Forum. Dec 2021 Invited to present in the Data-Driven Methods for Science and Engineering Seminar at University of Washington and the workshop RAMSES: Reduced order models; Approximation theory; Machine learning; Surrogates, Emulators and Simulators. Sep 2021 Co-organizing two minisymposia at the IACM Conference on Machine Learning and Digital Twins (MMLDT-CSET) 2021. Jun 2021 Chairing an Invited Focus Session on \"High-Performance Computing for AI\" at the ISC High Performance 2021. Apr 2021 Congratulations to Yuxiao Wen for winning Courant's prize for outstanding undergraduate performance in computer science. Mar 2021 Co-organizer, with Themistoklis Sapsis (MIT), of minisymposium \"Learning Dynamics from Data for Prediction and Control\" at the SIAM Conference on Computational Science And Engineering 2021. Feb 2021 I feel very honored to be an NSF CAREER recipient. My proposal Formulations, Theory, and Algorithms for Nonlinear Model Reduction in Transport-Dominated Systems was funded through the Computational Mathematics program in the Division Of Mathematical Sciences. Nov 2020 Excited to be a 2021 AFRL/AFOSR Young Investigator Program (YIP) award recipient. My proposal is about context-aware learning for intelligent decision-making in science and engineering. Oct 2020 Looking forward to Mathematical and Scientific Machine Learning (MSML) 2021 and happy to serve on the program committee. Sep 2020 I am co-organizing the Numerical Analysis and Scientific Computing seminar at Courant Institute starting fall 2020. Jul 2020 Invited to present our work on multifidelity methods as a keynote lecture in the minisymposium Multifidelity Optimization at the European Congress on Computational Methods in Applied Sciences and Engineering (ECCOMAS). Jul 2020 Presenting at summer school Learning Models from Data: Model Reduction, System Identification and Machine Learning at Max Planck Institute for Dynamics of Complex Technical Systems, organized by GAMM Juniors. Jun 2020 Invited to give a tutorial presentation on multifidelity methods for uncertainty quantification at the workshop Multifidelity Modeling in Support of Design and Uncertainty Quantification that is organized as part of the AIAA Aviation Forum. May 2020 Co-organizer, with Themistoklis Sapsis (MIT), of minisymposium \"Learning Dynamical-System Models for Prediction and Control\" at the SIAM Conference on Mathematics of Data Science 2020. Apr 2020 Congratulations to Elizabeth Qian for winning a 2020 SIAM Student Paper Prize for her work Multifidelity Monte Carlo Estimation of Variance and Sensitivity Indices. The paper appeared in SIAM/ASA Journal on Uncertainty Quantification in 2018. Apr 2020 Congratulations to Frederick Law for winning a DoD NDSEG Fellowship. Apr 2020 Co-organizer of ICERM workshop on Computational Statistics and Data-Driven Models, which will be held virtually April 20-24, 2020. Mar 2020 Co-organizer with Youssef Marzouk (MIT) and Yaoliang Yu (U Waterloo) of minisymposium on \"Inference and preconditioning via Stein methods, flows, and other transport maps\" at the SIAM Conference on Uncertainty Quantification 2020. Feb 2020 Invited to give a presentation on model reduction for transport-dominated problems at workshop on \"Mathematics of Reduced Order Models\", which is organized at the Institute for Computational and Experimental Research in Mathematics (ICERM). Jan 2020 Invited to give a tutorial presentation on learning dynamical-system models from data as part of t",
  "content_length": 138452,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:02"
}