{
  "name": "Benjamin J. Belzer",
  "homepage": "http://www.eecs.wsu.edu/~belzer",
  "status": "success",
  "content": "Ben Belzer's WSU Homepage Benjamin Belzer Associate Professor, School of Electrical Engineering and Computer Science Contact Information Benjamin Belzer School of Electrical Engineering and Computer Science Washington State University P.O. Box 642752 Pullman, WA, 99164-2752 belzer@eecs.wsu.edu Research Interests Digital communications: equalization and channel coding for two- and three-dimensional magnetic recording channels and multi-dimensional intersymbol interference channels, machine learning for turbo equalization, machine learning for non-orthogonal multiple access (NOMA) wireless channels, communications over doubly-dispersive wireless channels, underwater acoustic communications, wireless networks on chip, turbo coded modulation, joint source/channel coding, image and video communication. I am a member of the Systems Engineering Research Group at WSU's School of EECS. The Systems Group research areas include Control, Communications, and Signal Processing. A one page flyer summarizing the accomplishments of Systems Group faculty and graduate students is here: Systems Engineering Research Group Flyer I am also a member of the Information Research Lab (IRL) at WSU EECS. Open Research and/or Teaching Assistant Position starting Spring or Fall 2026 I am currently seeking one Ph.D. student to conduct research on signal processing and machine learning techniques for NOMA wireless channels and for doubly-dispersive wireless channels, starting in Spring or Fall 2026. The selected student will be funded as a teaching assistant and/or research assistant for the next three years, providing that he/she maintains excellent academic performance and high research productivity while at WSU. In addition to applying to WSU's Graduate School through the normal process, interested students should email me a CV summarizing their academic and research accomplishments to date. Please note that GRE scores are not required by EECS for Spring or Fall 2026 applicants. I am primarily interested in students who will have earned an M.S. degree and who will have one or more published or accepted conference and/or journal papers by the time they arrive at WSU; however, truly outstanding students who hold the B.S. degree in EE or related fields will also be considered. Graduate Student Positions with Financial Support Available Publications",
  "content_length": 2357,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:00"
}