{
  "name": "Benjamin E. Ujcich",
  "homepage": "https://personal.benujcich.georgetown.domains",
  "status": "success",
  "content": "Benjamin E. Ujcich - Home Toggle navigation Benjamin E. Ujcich Home Research Courses CV GU SecLab Benjamin E. Ujcich About I am an Assistant Professor in the Department of Computer Science at Georgetown University working on secure systems and network design research. I am a member of the Department’s SecLab, where we investigate information assurance and computer and network security challenges. Interests My research interests span systems and networking. In particular, I am interested in securing future networking architectures such as intent-based networking (IBN), 5G security, 6G/next-gen networking security, software-defined networking (SDN), programmable control planes, programmable data planes (e.g., OpenFlow and P4), and network operating systems. I am also interested in applications of data provenance for systems and networks. Please see my research projects, teaching, and CV for more information. I also maintain the intent-based networking (IBN) reading list. News September 2025: The IBN reading list is now live! August 2025: Our article arguing for a systems security approach for emerging programmable network architectures was accepted and will be published in IEEE Security & Privacy in the November/December 2025 issue July 2025: Our work on exploiting intent-flow state vulnerabilities in intent-based networking was accepted and will be presented at IEEE SecDev ‘25 June 2025: Our work on provenance-enabled explainable AI was presented at ACM SIGMOD ‘25 April 2025: Zhao Zhang successfully defended his PhD dissertation March 2025: Our work on uncovering vulnerabilities in P4 infrastructure was presented at IEEE S&P/Oakland ‘25 October 2024: Our work on temporal vulnerabilities in intent-based networks was presented at ACM CCS ‘24 June 2024: Our article on security challenges in intent-based networking was published in the Communications of the ACM (CACM) May 2024: Our work on P4-based “shuffle proxies” for censorship circumvention was presented at IEEE S&P/Oakland ‘24 March 2024: Awarded the NSF CAREER Award for secure and trustworthy intent-based networking August 2023: Our work on vulnerability detection in intent-based networks was presented at USENIX Security ‘23 Current Students Dhiraj Saharia (PhD) Jacob Heybey (MS) Alumni Zhao Zhang (PhD ‘25, co-advised with Micah Sherr) Jiachi Zhang (PhD ‘23, co-advised with Wenchao Zhou) Working With Me Students at or applying to Georgetown: I am currently interested in working with students who have security, systems, and/or networking backgrounds and who are interested in computer security research. Please contact me by e-mail if interested! If you are not a student at Georgetown already, check out an overview of the CS PhD program at Georgetown and how to apply to Georgetown. Collaborators: If you would like to collaborate (academic or industry), please contact me! Contact Benjamin E. Ujcich Department of Computer Science Georgetown University St. Mary’s Hall, Room 315-F 3700 Reservoir Road NW Washington, DC 20057 USA e-mail bu31 [at] georgetown [dot] edu web https://benujcich.georgetown.domains/ PGP key: 9B35 59DE D3CE ECF0 44B5 A1B6 D421 784B 458F 6B3F Find me at: Google Scholar, DBLP, LinkedIn, GitHub Copyright © 2025 Benjamin E. Ujcich.This website is written in Jekyll based on the theme from the Allan Lab.",
  "content_length": 3325,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:55"
}