{
  "name": "Benjamin Eysenbach",
  "homepage": "https://www.cs.princeton.edu/people/profile/eysenbach",
  "status": "success",
  "content": "Benjamin Eysenbach CS Skip to main content Benjamin Eysenbach Assistant Professor Contact Building 416 Computer Science Envelope eysenbach@cs.princeton.edu Phone (609) 258-8592 Diploma Ph.D., Carnegie Mellon University, 2023 Homepage Research Areas Machine Learning Short Bio Eysenbach joined the Princeton faculty in 2023. His research aims to develop principled reinforcement learning algorithms that obtain state-of-the-art performance with a higher degree of simplicity, scalability, and robustness than current methods. Much of his work uses ideas for probabilistic inference to make progress on a important problems in reinforcement learning (e.g., long-horizon and high-dimensional reasoning, robustness, exploration).He completed a Ph.D. in machine learning at Carnegie Mellon University and spent a number of years at Google Brain/Research before and during his doctoral work. He has an undergraduate degree in mathematics from MIT. Related News May 16, 2025 Ben Eysenbach and Ellen Zhong win junior faculty awards The School of Engineering and Applied Science has honored Ben Eysenbach and Ellen Zhong with junior faculty awards for excellence in research and teaching. March 11, 2025 Without feedback, AI systems learn to explore Artificial intelligence systems often learn through guided trial and error, practicing tasks that become progressively more difficult. But what if training could skip those intermediate steps? June 6, 2024 Ben Eysenbach, an expert in reinforcement learning, joins the faculty Ben Eysenbach, an expert in reinforcement learning, has joined the computer science faculty as an assistant professor. March 28, 2024 Faculty commended for outstanding teaching Computer science recognized for their outstanding teaching during the fall 2023 semester.",
  "content_length": 1783,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:56"
}