{
  "name": "Benjamin Fish",
  "homepage": "http://ben.fish",
  "status": "success",
  "content": "Benjamin Fish Benjamin Fish Home Papers email Most recently I was an Assistant Professor in Computer Science and Engineering at the University of Michigan. My research is in developing methods for understanding and incorporating human values into AI by making the social world visible to AI. I was also previously at Mila and Microsoft Research, and completed my PhD at the University of Illinois at Chicago. CV     Google Scholar page selected papers (all papers) RelAItionship Building: Analyzing Recruitment Strategies for Participatory AI (arXiv) Gena Eugene Kim, Vaibhav Balloli, Berelian Karimian, Elizabeth Bondi-Kelly, and Benjamin Fish To appear at AIES 2025 Equal Merit Does Not Imply Equality: Discrimination at Equilibrium in a Hiring market with Symmetric Agents (arXiv) Serafina Kamp and Benjamin Fish AAAI 2025 On Performance Discrepancies Across Local Homophily Levels in Graph Neural Networks (open review) Donald Loveland, Jiong Zhu, Mark Heimann, Benjamin Fish, Michael T Schaub, and Danai Koutra LoG 2023 Itâs Not Fairness, and Itâs Not Fair: The Failure of Distributional Equality and the Promise of Relational Equality in Complete-Information Hiring Games (arXiv) Benjamin Fish and Luke Stark EAAMO 2022 Gaps in Information Access in Social Networks (pdf) Benjamin Fish, Ashkan Bashardoust, danah boyd, Sorelle A. Friedler, Carlos Scheidegger, and Suresh Venkatasubramanian WWW 2019 preprints Last-Iterate Convergence of No-Regret Learning for Equilibria in Bargaining Games (preprint) Serafina Kamp, Reese Liebman, and Benjamin Fish Manuscript Centralization vs Decentralization in Hiring and Admissions (preprint) Benjamin Fish, Diptangshu Sen, and Juba Ziani Manuscript teaching Instructor, EECS 498/598: Foundations of Fairness in Machine Learning (Fall 2024) Instructor, EECS 298: Introduction to the Social Consequences of Computing (Winter 2023, Winter 2024, Winter 2025) Instructor, EECS 376: Foundations of Computer Science (Fall 2023) Instructor, EECS 492: Introduction to Artificial Intelligence (Fall 2021, Fall 2022) Instructor, EECS 598: Social Consequences of Computing (Winter 2022) phd students Serafina Kamp, Ph.D. in progress Eugene Kim, Ph.D. in progress",
  "content_length": 2200,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:55"
}