{
  "name": "Benjamin J. Blalock",
  "homepage": "http://web.eecs.utk.edu/~bblalock",
  "status": "success",
  "content": "Benjamin Blalock's home page Benjamin J. Blalock, Associate Professor Ph.D., Georgia Institute of Technology, 1996 Awarded the Eta Kappu Nu Outstanding Teacher Award, Dept. of Electrical & Computer Engineering, The University of Tennessee, April 2002 Engineering Research Fellow Award, The University of Tennessee, 2005 & 2006 Academic/Research and Field Interests: Analog/Mixed-Signal Integrated Circuit Design Analog/Mixed-Signal IC Design for Extreme Environments Ultra Low Voltage CMOS IC Design Multi-gate transistors and circuit applications Bio-microelectronics Background Summary: (click here) Current Research Students & Research Activity: I direct the Integrated Circuits & Systems Laboratory in the Min H. Kao Department of Electrical Engineering and Computer Science at The University of Tennessee. Our current research focus includes analog IC design for extreme environments, mixed-signal/mixed-voltage circuit design for systems-on-a-chip in SOI technology, multi-gate transistors and circuits on SOI, body-driven circuit techniques for ultra low-voltage CMOS analog, and bio-microelectronics. Some Recent Journal Articles: K. Akarvardar, R. D. Schrimpf, D. M. Fleetwood, S. Cristoloveanu, P. Gentil, and B. J. Blalock, \"Evidence of Radiation-Induced Dopant Neutralization in Partially-Depleted SOI NMOSFETs,\" IEEE Transactions on Nuclear Science, vol. 54, no. 7, Dec. 2007, pp. 1920-1924. R. Vijayaraghavan, S. K. Islam, M. Zhang, S. Ripp, S. Caylor, N. D. Bull, S. Moser, S. C. Terry, B. J. Blalock, G.S. Sayler, \"A bioreporter bioluminescent integrated circuit for very low-level chemical sensing in both gas and liquid environments,\" Journal Sensors and Actuators B: Chemical, vol. B123, issue 2, 21 May 2007, pp. 922-928. K. Akarvardar, S. Cristoloveanu, P. Gentil, R. D. Schrimpf, and B. J. Blalock, \"Depletion-All-Around Operation of the SOI Four-Gate Transistor,\" IEEE Transactions on Electron Devices, vol. 54, no. 2, Feb. 2007, pp. 323-331. S. K. Islam, R. Vijayaraghavan, M. Zhang, S. Ripp, S. D. Caylor, B. Weathers, S. Moser, S. Terry, B. J. Blalock, and G. S. Sayler, \"Integrated Circuit Biosensors Using Living Whole-Cell Bioreporters,\" IEEE Transactions on Circuits and Systems I, vol. 54, no. 1, Jan. 2007, pp. 89-98. A. L. Sternberg, L. W. Massengill, M. Hale, and B. Blalock, \"Single- Event Sensitivity and Hardening of a Pipelined Analog-to-Digital Converter,\" IEEE Transactions on Nuclear Science, vol. 53, no. 6, Dec. 2006, pp. 3532-3538. S. Chen and B. J. Blalock, \"Switched capacitor bandgap voltage reference for sub-1-V operation,\" IEICE Electron. Express, vol. 3, no. 24, pp.529-533, 2006. C. S. A. Durisety, R.Vijayraghavan, L. Seshan, S. K. Islam, B. J. Blalock, \"Dose Control Circuit for Digital Electrostatic Electron-Beam Array Lithography,\" Journal of Analog Integrated Circuits and Signal Processing, vol. 48, no. 2, Aug. 2006, pp. 143-150. D. M. Binkley, B. J. Blalock, and J. M. Rochelle, \"Optimizing Drain Current, Inversion Coefficient, and Channel Length in Analog CMOS Design,\" Journal of Analog Integrated Circuits and Signal Processing, vol. 47, no. 2, May 2006, pp. 137-163. K. Akarvardar, B. M. Dufrene, S. Cristoloveanu, P. Gentil, B. J. Blalock, and M. M. Mojarradi, \"Low-Frequency Noise in SOI Four-Gate Transistors,\" IEEE Transactions on Electron Devices, vol. 53, no. 4, April 2006, pp. 829-835. S. K. Islam, C. S. A. Durisety, R. Vijayraghavan, B. J. Blalock, T. Grundman, L. R. Baylor, and W. L. Gardner, \"A Novel All-Inverter CMOS Based Dose Control Circuit for Using Vertically Aligned Carbon Nanofibers in Maskless Lithography,\" Journal of Vacuum Science & Technology B, vol. 24, no. 2, Mar./Apr. 2006, pp. 1026-1029. J. Yang, A. Balijepalli, T. J. Thornton, J. Vandersand, B. J. Blalock, M. E. Wood, and M. M. Mojarradi, \"Silicon-Based Integrated MOSFETS and MESFETS: A New Paradigm for Low Power, Mixed Signal, Monolithic Systems Using Commercially Available SOI,\" International Journal of High Speed Electronics and Systems, vol. 16, no. 2, 2006, pp. 723-732. Contact information: e-mail: bblalock@utk.edu office: Ferris Hall - room 404 phone: (865) 974-0927 fax: (VOL) 974-5483 mail: 404 Ferris Hall 1508 Middle Drive The University of Tennessee Knoxville, TN 37996-2100",
  "content_length": 4243,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:59"
}