{
  "name": "Benjamin J. Raphael",
  "homepage": "https://www.cs.princeton.edu/people/profile/braphael",
  "status": "success",
  "content": "Ben Raphael CS Skip to main content Ben Raphael Graduate Class of 1991 Professor of Computer Science Contact Building 309 Computer Science Envelope braphael@cs.princeton.edu Phone (609) 258-6314 Diploma Ph.D., University of California, San Diego, 2002 Homepage Research Areas Computational Biology Short Bio My research is focused on the design and application of computational methods to analyze large-scale biological data. My group uses diverse computatational approaches including combinatorial optimization, graph algorithms, machine learning, and statistical methods. Recent areas of emphasis include cancer evolution, network/pathway analysis of genetic variants, and structural variation in human and cancer genomes. Our algorithms have been used in multiple projects from The Cancer Genome Atlas (TCGA) and the International Cancer Genome Consortium (ICGC). I co-led the TCGA Pancreatic Adenocarcinoma project and the network analysis in the ICGC Pan-Cancer Analysis of Whole Genomes (PCAWG).Further information about my research is on my research group webpage. and a full list of publications is on Google Scholar.I joined Princeton University in 2016, after a decade on the faculty in the Computer Science Department and Center for Computational Molecular Biology (CCMB) at Brown University, and directed the CCMB from 2013-2016. I am Associated Faculty in the Lewis-Sigler Institute for Integrative Genomics, the Omenn-Darling Bioengineering Institute, and the Center for Statistics and Machine Learning at Princeton University. I am also a Affiliate Faculty at the Rutgers Cancer Institute of New Jersey, the Irving Institute for Cancer Dynamics at Columbia University, and the New York Genome Center. Other Affiliations CSML Genomics PBI Related News October 31, 2024 Tracking cell mutations, a new tool reveals how tumors evolve Researchers at Princeton have created a new tool to track the progression of mutations in cancer cells, showing how tumors evolve over time and in space. February 12, 2024 Spatial data adds ‘great new dimension’ to studies on cancer and development Ben Raphael has become an expert interpreter of experiments that sequence the genes expressed in a tissue sample while retaining spatial information. January 30, 2024 Ben Raphael and Kyle Jamieson recognized by the ACM Kyle Jamieson and Ben Raphael have been recognized for their contributions to computer science and technology by the Association for Computing Machinery (ACM).",
  "content_length": 2472,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:59"
}