{
  "name": "Benjamin C. Lee",
  "homepage": "https://www.cis.upenn.edu/~leebcc/index.html",
  "status": "success",
  "content": "Benjamin C. Lee Benjamin C. Lee School of Engineering and Applied Science University of Pennsylvania Benjamin C. Lee Curriculum Vitae Research People Publications Software Teaching News Benjamin C. Lee Biographical Sketch Honors & Awards Service Contact Appointments Professor Electrical and Systems Engineering Computer and Information Science Associate Chair Electrical and Systems Engineering Co-Director NSF Expedition in Computing: Carbon Connect Visiting Researcher Google, Global Infrastructure Group Member Distributed Systems Laboratory (DSL) Penn Research in Embedded Computing and Integrated Systems Engineering (PRECISE) Affiliate The Warren Center for Network & Data Sciences Center for AI-Enabled Systems (ASSET) Biographical Sketch Benjamin Lee is a Professor in the Department of Electrical and Systems Engineering and the Department of Computer and Information Science at the University of Pennsylvania. He is also a visiting researcher at Google in the Global Infrastructure Group. Dr. Lee's research focuses on computer architecture (e.g., microprocessors, memories, datacenters), energy efficiency, and environmental sustainability. He builds interdisciplinary links to machine learning and algorithmic economics to better design and manage computer systems. Dr. Lee was an Assistant and then Associate Professor at Duke University. He received his post-doctorate at Stanford University, his S.M. and Ph.D. from Harvard University, and his B.S. from the University of California at Berkeley. He has held visiting research positions at Meta AI, formerly Facebook AI Research, at Microsoft Research, at Intel Corporation, and at Lawrence Livermore National Laboratory. Selected Honors & Awards 2024 IEEE Fellow 2024 ASPLOS Distinguished Reviewer 2022 Persistent Impact Prize, Non-volatile Memory Workshop 2020 Persistent Impact Prize, Non-volatile Memory Workshop 2019 ACM Distinguished Scientist 2019 CACM Research Highlight 2018 HPCA Best Paper Award 2018 HPCA Hall of Fame 2016 ASPLOS Best Paper Award 2014 IEEE Micro Top Picks 2013 Duke Nortel Networks Professorship 2012 NSF CAREER Award 2011 Google Faculty Research Award 2011 CACM Research Highlight 2010 CACM Research Highlight 2009 IEEE Micro Top Picks 2009 NSF Computing Innovation Fellowship 2006 SC Student Research Competition Winner 2004 Harvard Engineering & Applied Sciences Fellowship 2004 ICPP Best Paper 2000 National Merit Scholarship Benjamin C. Lee, Ph.D. Electrical and Systems Engineering Computer and Information Science University of Pennsylvania Levine 276 200 S 33rd St Philadelphia, PA 19104 leebcc@seas.upenn.edu",
  "content_length": 2610,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:52"
}