{
  "name": "Benjamin Moseley",
  "homepage": "http://www.andrew.cmu.edu/user/moseleyb",
  "status": "success",
  "content": "Benjamin Moseley's Research Website Ben Moseley is an Associate Professor of Operations Research in the Tepper School of Business at Carnegie Mellon University (CMU) and is a consulting professor at the start-up Relational AI. He is an Associate Professor of Machine Learning in the School of Computer Science (by courtesy) and member of the Ph.D. program Algorithms, Combinatorics and Optimization (ACO). He received a Ph.D. from the University of Illinois in Computer Science and was advised by Chandra Chekuri. Ben Moseley enjoys inspiring students though teaching. He was selcted as a \"Top 50 Undergraduate Business School Professor\" by Poets and Quants. He developed the undergraduate minor on Business Analytics and Optimization offered at Tepper. He has developed a range of courses for the Undergraduate in Business Administration (UBA), Master in Business Administration (MBA) and Master of Science in Business Anaytics (MSBA) on machine learning for business, optimization for business and uses of probability and statistic in business. Professor Moseley's research interests are broadly in operations research, theoretical computer science and machine learning. He works on the design, analysis and evaluation of algorithms. He is currently working on the algorithmic foundations of machine learning, distributed algorithm design, and algorithms for scheduling and logistics. Ben Moseley has won several best paper awards including a 2015 IPDPS Best Paper Award, a SPAA 2013 Best Paper Award, and a SODA 2010 Best Student Paper Award. His work has been recognized with an oral presentaion at NeurIPS 2021 (top 1% of submissions), an oral presentation at NIPS 2017 (top 1.3% of submissions) and spotlight presentations at NeurIPS 2023 and NIPS 2018 (top 3.5% of submissions). Moseley's work has been supported by generous grants from the National Science Foundation, Office of Naval Research, Yahoo, Infor, Google and Bosch. Financial support for Moseley's work includes a NSF CAREER Award, grants from NSF divisions on Computing and Communication Foundations (CCF) and Operations Engineering (OE), grants from the Office of Naval Research's Mathematical and Resource Optimization division, two Google Faculty Research Awards, a Yahoo! Academic Career Enabling (ACE) Award, an Infor faculty award and a Carnegie-Bosch faculty chair. In the past, he was an Assistant Professor in the Department of Computer Science and Engineering at Washington University in St. Louis from 2014-2017. He was a 2016 Simons-Berkeley Fellow. From 2012-2014 he was a Research Assistant Professor at the Toyota Technological Institute at Chicago. He was a visiting professor at Sandia National Laboratories in 2013 and has frequently been affiliated with Yahoo Labs. Benjamin Moseley Associate Professor of OR and of Machine Learning (by courtesy) Tepper School of Business Carnegie Mellon University Office: Tepper 4111 CV",
  "content_length": 2911,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:02"
}