{
  "name": "Benno Stein 0001",
  "homepage": "https://www.uni-weimar.de/en/media/chairs/computer-science-department/webis/people/stein",
  "status": "success",
  "content": "Bauhaus-Universität Weimar: Stein Contact and Information Stein Bauhaus-Universität Weimar Bauhausstraße 9a · Room 306 99423 Weimar, Germany Email: benno.stein@uni-weimar.de Phone: +49 (0)3643 - 58 3795 | 3710 Twitter: @bennostein ORCID: 0000-0001-9033-2217 Benno Stein is chair of the Intelligent Information Systems Group at the Bauhaus-Universität Weimar. His research focuses on modeling and solving data- and knowledge-intensive information processing tasks. Common ground of his research are the principles and methods of symbolic Artificial Intelligence. Benno Stein has developed theories, algorithms, and tools for information retrieval, machine learning, natural language processing, knowledge processing, as well as for engineering design and simulation (patents granted). For several achievements of his research he has been awarded with scientific and commercial prizes. Professional background: Study at the University of Karlsruhe (1984 - 1989). Dissertation (1995) and Habilitation (2002) in computer science at the University of Paderborn. Appointment as a full professor for Intelligent Information Systems at the Bauhaus-Universität Weimar (2005). Research stays at IBM, Germany, and the International Computer Science Institute, Berkeley. Benno Stein serves on scientific boards, on program committees, as reviewer in various relevant conferences and journals, and he is the initiator and a co-chair of PAN, an excellence network and evaluation lab on digital text forensics with focus on authorship analysis, profiling, and reuse detection. He is cofounder and spokesperson of the Digital Bauhaus Lab Weimar, a visionary and interdisciplinary research center for Computer Science, Arts, and Engineering. Not least, he is a cofounder (1996) and scientific director of the Art Systems Software Ltd, a world leading company for simulation technology in fluidic engineering. Accessibility panel  Simple language Information about the Bauhaus-Universität Weimar in German. Set contrast Read more about this setting Changes from color to monochrome mode contrast active contrast not active switch on activate contrast view switch off deactivate contrast view Darkmode for the lightsensitive Read more about this setting Changes the background color from white to black Darkmode active Darkmode not active switch off deactivate darkmode switch on activate darkmode Click- and Focus-feedback Read more about this setting Elements in focus are visually enhanced by an black underlay, while the font is whitened Feedback active Feedback not active switch off Deactivate Feedback switch on Activate Feedback Animations on this Website Read more about this setting Halts animations on the page Animations active Animations not active switch off disable animations switch on enable animations Close",
  "content_length": 2807,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:06"
}