{
  "name": "Benno Stabernack",
  "homepage": "https://www.uni-potsdam.de/de/aess/mitarbeiter/mitarbeiter",
  "status": "success",
  "content": "Alle Mitarbeiter - Mitarbeiter - Architekturen eingebetteter Systeme für die Signalverarbeitung - Universität Potsdam JavaScript ist in ihrem Browser deaktiviert. Bitte aktivieren Sie JavaScript um alle Funktionen der Website nutzen zu können! Zum Hauptinhalt springenForschung Übersicht Projekte NAAICE Lehre WS24/25 SS24 WS2023/24 SS2023 WS2019/20 SS2019 WS2018/19 WS2017/18 SS2017 Abschlussarbeiten Veröffentlichungen Veröffentlichungen Mitarbeiter Alle Mitarbeiter Viktor Herrmann Niklas Schelten Fritjof Steinert Benno Stabernack Justin Knapheide Anton Schulte Philipp Kreowsky Uni-Startseite Intranet Notfall Uni A-Z Gebärdensprache Leichte Sprache Sitemap Schliessen Schliessen EnglishDeutschOverviewOverviewSchliessenStudiumStudieren an der UPStudienangebotBewerbung und ImmatrikulationStudium konkretBeratungs- und ServiceeinrichtungenTermine und FristenForschungForschen an der UPProfile, Programme und ProjekteForschungsförderungOpen ScienceForschungsdatenKooperationen und PartnerschaftenWissenschaftlicher NachwuchsUniversitätUP entdeckenOrganisationWirtschaft, Transfer und GesellschaftCampus InternationalFörderinstrumenteArbeiten an der UPOnline-DiensteAccount.UPBI.UPMail.UP (Webmailbox)PULSMoodleUniversitätsbibliothekEvaluationsportal (PEP)PraxisportalZIM – Zentrum für IT und MedienSchliessen Lehrstuhlinhaber Prof. Dr.-Ing. Benno Stabernack stabernack (at) uni-potsdam.de +49-331 977-3010 +49-30-31002-661(HHI) Haus 70, Raum 1.29 Sekretariat Alexandra Roy aroy (at) cs.uni-potsdam.de +49-331 977-3001 Haus 70, Raum 2.08 Mitarbeiter Philipp Kreowsky philipp.kreowsky (at) hhi.fraunhofer.de +49-30-31002-265 (UP/HHI) Haus 70, Raum 1.28 Fritjof Steinert fritjof.steinert (at) hhi.fraunhofer.de +49-30-31002-271 (HHI) Viktor Herrmann viktor.herrmann (at) hhi.fraunhofer.de +49-30-31002-271 (HHI) Justin Knapheide justin.knapheide (at) hhi.fraunhofer.de +49-331 977-362082 (UP/HHI) Haus 70, Raum 1.28 Tilmann Ripke Tilmann.Ripke (at) hhi.fraunhofer.de +49-30-31002-271 (HHI) Niklas Schelten niklas.schelten (at) hhi.fraunhofer.de +49-30-31002-372 (HHI) Lukas Klapproth Lukas.Klapproth (at) hhi.fraunhofer.de +49-30-31002-xxx (HHI)",
  "content_length": 2146,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:05"
}