{
  "name": "Benny Akesson",
  "homepage": "https://akesson.nl",
  "status": "success",
  "content": "Benny Akesson - Design Methodologies for Cyber-Physical Systems Benny Akesson Senior Research Fellow @ TNO-ESI | Endowed Professor @ University of Amsterdam Today, we proudly celebrate Lars van der Water’s successful defense of his Master’s thesis, Exploring Vast Design Spaces with Hyperheuristics: Theoretical Foundations and Autotuning Implementation, at the University of Amsterdam. This work has been conducted in connection with the DSE2.0 project, a research collaboration between University of Amsterdam, Leiden University, and ASML, co-funded by NWO and TNO-ESI as a part of the Mastering Complexity (MasCot) Program. Lars’ thesis addresses the growing complexity in designing Distributed Cyber-Physical Systems, which are increasingly vital to infrastructure and industry. Traditional Design Space Exploration methods struggle with scalability, algorithm selection, and parameter tuning, creating a bottleneck in efficient exploration of system designs. To overcome this, this work explores hyperheuristics (HHs) as a higher-level domain-agnostic approach to automate the selection and tuning of metaheuristics.  Key contributions include a modular framework for integrating HH strategies, and empirical insights into the trade-offs between performance, effort, and computational cost in autotuning. Experiments show promising results for auto-tuning of simpler meta-heuristic search algorithms like Gravitational Search and Particle Swarm Optimization, but revealing limitations with more complex ones like Genetic Algorithms. We sincerely thank Lars for the excellent collaboration and wish him all the best in the next chapter of his career! I am thrilled to announce that the paper “Unraveling Parallelism in Automated Workload Modeling for Distributed Cyber-Physical Systems” has been accepted for publication at the 28th Euromicro Conference Series on Digital System Design (DSD). This paper was first-authored by Faezeh Sadat Saadatmand and is a result from the DSE2.0 project, a collaboration between University of Amsterdam, Leiden University, and ASML. The paper addresses the problem of limited exploration of software-level parallelism in distributed Cyber-Physical Systems, due to fixed execution orders in current workload models used in design-space exploration. It proposes refined workload models based on execution traces that capture both inter- and intra-process dependencies, enabling safe task reordering and parallel execution without modifying the software. A case study on the ASML Twinscan lithography machine demonstrates performance improvements while maintaining functional correctness. It has been a pleasure to serve as the General Chair of the 31st IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS 2025). RTAS is a top-tier conference on real-time systems that is a part of the CPS-IoT Week. This year, CPS-IoT week was hosted at UC Irvine, USA, and it was one of the most well-attended instances so far with over 550 registrations from all over the world. Here are some personal highlights: Keynote: “Trusted AI on Mars” by Dr. Steve Chien: This keynote discussed the challenge of controlling the Perseverance rover on Mars. The original planner was time-triggered and struggled to efficiently adapt to unexpected changes, e.g. in temperature and battery state. The core of the presentation covered the design, analysis, prototyping and testing of a new AI-based Onboard Planner that was deployed in October 2023. This planner enabled the schedule to be revised on average 16 times per day to manage resources, such as energy, more efficiently and maximize the scientific operations conducted by the rover. This presentation was very interesting to the real-time systems community as it focused on planning inside a heavily resource-constrained cyber-physical system in a dynamic environment far away from earth. It was interesting to hear the challenges of getting new technology adopted in such a critical system, where the cost of verification and validation is a key driver for decision-making. Inaugural CPS-IoT Debate: We have all attended bland panel discussions at conferences. This was different, as it had the format of an Oxford debate and discussed whether the inherent complexity of modern engineering challenges renders exhaustive mathematical analysis overkill, and that an iterative, adaptive design approach should be prioritized—even for life-critical systems. The format, the existential nature of this question for our community, and the excellent choice of the debate team resulted in an engaging session with high audience participation that sparked conversations throughout the day. I strongly encourage other conferences to try out this format. RTAS Technical Sessions: The technical sessions of RTAS are always of high quality and interesting. I particularly enjoy the papers that help bring theory into practice. Here are a few papers that stood out to me: LiME: The Linux Real-Time Task Model Extractor by Bjorn Brandenburg et al. describes a tool to extract real-time task models from real-time threads in a Linux environment.  LiME runs on unmodified Linux kernels and requires neither knowledge of real-time theory nor familiarity with Linux internals to be used effectively. Such a tool can significantly reduce the engineering, modeling, and analysis effort required to develop real-time systems whose timing behavior can be formally verified. Reconciling ROS 2 with Classical Real-Time Scheduling of Periodic Tasks by Harun Teper et al. explains how minor changes to the event executor of ROS2 makes a large body of research results from classical real-time scheduling theory directly applicable to ROS 2. This enables analytical bounds on the worst-case response time and the end-to-end latency, outperforming bounds for the default ROS 2 executor in many scenarios. CROS-RT: Cross-Layer Priority Scheduling for Predictable Inter-Process Communication in ROS 2 by Kim et al., which won the Best Paper Award, addresses the challenge of providing real-time guarantees in ROS2 due to unpredictable delays and priority inversions across ROS 2’s multi-layered communication architecture. They present a cross-layer scheduler explicitly designed to tackle the unpredictability in ROS 2 inter-process communication that has been implemented and evaluated on the current stable release of ROS 2. These works all make significant strides in bringing theory to practice. Just imagine what happens if you combine them all! All in all, it was a very successful event thanks to the excellent work done by Program Chair Tam Chantem, Program Co-chair Geoffrey Nelissen, the General Co-chairs of CPS-IoT Week Mohammad Al Faruque and Yasser Shoukry, Local Arrangement Chairs Fadi Kurdahi and Halle Gonzales, and many others involved in the organization. Of course, RTAS would not have been possible without the many authors who submitted their work and the members of the TPC who took the time to read the submissions and provide high-quality reviews. The Award Ceremony of the 31st IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS) has concluded, and it is our pleasure to announce the highlights of this year’s awards. The RTAS 2025 Technical Program Committee nominated four papers for awards, evaluating them based on novelty, presentation, applicability to real-world applications/systems, and relevance and completeness of experimental evidence. The four papers were selected as Outstanding Papers and candidates for the Best (Student) Paper Award. Best Paper AwardCROS-RT: Cross-Layer Priority Scheduling for Predictable Inter-Process Communication in ROS 2Authors: Sohyun Kim, Juho Song, Kilho Lee, Sangeun Oh, and Hoon Sung Chwa This paper tackles the challenges of achieving real-time guarantees in ROS2 due to unpredictable delays and priority inversions. CROS-RT, a cross-layer scheduler, ensures consistent priority-based scheduling across application, middleware, and kernel layers. Experiments show that CROS-RT significantly improves communication predictability, reducing the worst-case response time compared to baseline ROS2. The Best Paper Award committee was impressed by this paper’s practical significance and immediate, as well as long-term, impact on the field. Best Student Paper AwardA Unified Framework for Quantitative Cache AnalysisAuthors: Sophie Kahlen and Jan Reineke This work unifies two approaches to cache analysis for non-LRU policies. It is applicable to microarchitectures with timing anomalies and enhances WCET analysis using existing persistence analyses for LRU. Experiments demonstrate that the precision of cache analysis for FIFO and MRU is comparable to that of LRU. The Best Paper Award committee viewed this paper as an excellent example of a well-integrated blend of theoretical results and implementation efforts, which embody the spirit of RTAS. The Best Reviewer Committee evaluated six nominated reviews/reviewers based on criteria like review quality, completeness, and helpfulness to the authors. Four reviewers were recognized as Outstanding Reviewers and candidates for the Best Reviewer Award. Best Reviewer AwardZoe Stephenson, Rapita Systems, UK RTAS is grateful to all members of the Technical Program Committee who volunteer their time to review submitted papers. It is particularly rewarding when industry members contribute to the conference and stand out in terms of reviewing excellence, both in thorough reviews and active participation in discussions. Thank you, Zoë! We want to thank the members of the Award Committees and congratulate all award recipients on their achievements and thank you for your contributions to another successful RTAS! Benny Akesson, General ChairTam Chantem, Program ChairGeoffrey Nelissen, Vice Program Chair I’m excited to share that our journal article “CompDSE: A Methodology for Design Space Exploration of Computing Subsystems within Complex Cyber-Physical Systems” has been accepted for pu",
  "content_length": 23724,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:06"
}