{
  "name": "Benoît Libert",
  "homepage": "http://perso.ens-lyon.fr/benoit.libert",
  "status": "success",
  "content": "Benoit Libert Benoît Libert homepageSenior CNRS Researcher (DR2) (on leave) Ecole Normale Supérieure de Lyon AriC Team, LIP laboratory 46 Allée d'Italie69364 Lyon Cedex 07France email: benoit.libert at ens-lyon.fr Phone: +33.426.23.39.32 Ph.D. in Cryptography (February 2006) at the UCL Crypto Group. Habilitation à diriger des recherches (May 2015) at ENS de Lyon. Previously F.N.R.S. post-doctoral researcher, scientific collaborator at the UCL Crypto Group and researcher at Technicolor Research & Innovation. Previously involved in the ERC project LattAC led by Damien Stehlé. Previously coordinator of the PALSE project \"Towards practical enhanced asymmetric encryption schemes\" (2014-2016). Involved in the ANR project ALAMBIC (2016-2020). Coordinator of the H2020 project PROMETHEUS (2018-2021). Supervision Current and past students and post-docs Thomas Peters (PhD student, UCL, 2010-2014; main supervisor was Olivier Pereira). Sanjay Bhattacherjee (Post-doc, PALSE project, ENS Lyon, 2015-2016). Somindu Ramanna (Post-doc, PALSE project, ENS Lyon, 2015-2016). Junqing Gong (Post-doc, ENS Lyon, 2017-2018). Alonso Gonzalez (Post-doc, ENS Lyon, 2017-2021). Dingding Jia (Post-doc, ENS Lyon/CNRS, 2019-2020). Amit Deo (Post-doc, ENS Lyon, 2019-2021). Fabrice Mouhartem (PhD student, ENS Lyon, 2015-2018). Chen Qian (PhD student, IRISA, 2016-2019). Radu Titiu (PhD student, ENS de Lyon, 2017-2020). Julien Devevey (PhD student, ENS de Lyon, 2020-Present). Calvin Abou Haidar (PhD student, ENS de Lyon, 2021-Present). Mahshid Riahinia (PhD student, ENS de Lyon, 2021-Present). Internships Nicolas Bernard (2nd year student, ENS Lyon, UCL, June-August 2003). Elie de Panafieu (MPRI student, ENS Cachan, UCL, June-July 2009). Saurabh Yadav (2nd year student, IIT Delhi, ENS Lyon, July-August 2014). Laura Chira (3rd year student, Univ. of Cluj, ENS Lyon, July-September 2014). Fabrice Mouhartem (M2 student, ENS Lyon, February-June 2015). Balthazar Bauer (M2 student, MPRI, March-August 2016). Chen Qian (M2 student, MPRI, March-August 2016). Julien Devevey (M2 student, ENS de Lyon, January-June 2020). Calvin Abou Haidar (M2 student, ENS de Lyon, January-June 2020). Mahshid Riahinia (M2 student, ENS de Lyon, January-June 2021). Ky Nguyen (M2 student, MPRI, March-August 2021). Publications Journal Papers Dingding Jia, Benoît Libert, SO-CCA secure PKE from pairing based all-but-many lossy trapdoor functions, in Designs, Codes & Cryptography, vol. 89(5), pp. 895-923, 2021. Benoît Libert, Damien Stehlé, Radu Titiu, Adaptively Secure Distributed PRFs from LWE, in Journal of Cryptology, vol. 34(3), 2021. Benoît Libert, Moti Yung, Adaptively Secure Non-Interactive CCA-Secure Threshold Cryptosystems: Generic Framework and Constructions, in Journal of Cryptology, vol. 33(4), pp. 145-1441, 2020. Benoît Libert, San Ling, Fabrice Mouhartem, Khoa Nguyen, Huaxiong Wang, Zero-Knowledge Arguments for Matrix-Vector Relations and Lattice-Based Group Encryption, in Theoretical Computer Science, vol. 759, pp. 72--97, 2019. Benoît Libert, Marc Joye, Moti Yung, Born and Raised Distributively: Fully Distributed Non-Interactive Adaptively Secure Threshold Signatures with Short Shares, in Theoretical Computer Science, vol. 645, pp. 1-24, 2016 Fabrice Ben Hamouda, Marc Joye and Benoît Libert, A Framework for Privacy-Preserving Aggregation of Time-Series Data, in ACM Transactions on Information and System Security (ACM-TISSEC), vol. 18(3), pp. 10:1-10:21, 2016. Fabrice Ben Hamouda, Javier Herranz, Marc Joye and Benoît Libert, Efficient Cryptosystems from 2^k-th Power Residue Symbols, in Journal of Cryptology, vol. 30(2), pp. 519-549, 2017. Benoît Libert, Thomas Peters, Marc Joye and Moti Yung, Linearly Homomorphic Structure-Preserving Signatures and their Applications, in Designs, Codes & Cryptography, vol. 77(2-3), pp. 441-477, 2015. Benoît Libert, Moti Yung, Adaptively Secure Non-Interactive Threshold Cryptosystems, in Theoretical Computer Science, vol. 478, pp. 76-100, 2013. Nuttapong Attrapadung, Javier Herranz, Fabien Laguillaumie, Benoît Libert, Elie de Panafieu, Carla Ràfols, Attribute-Based Encryption Schemes with Constant-Size Ciphertexts, in Theoretical Computer Science, vol. 422, pp. 15-38, 2012. Nuttapong Attrapadung, Benoît Libert, Functional Encryption for Public-Attribute Inner Products: Achieving Constant-Size Ciphertexts with Adaptive Security or Support for Negation, in Journal of Mathematical Cryptology, October 2011, vol. 5, n°2, pp. 115-158. Benoît Libert, Damien Vergnaud, Towards Practical Black-Box Accountable Authority IBE: Weak Black-Box Traceability with Short Ciphertexts and Private Keys, in IEEE Trans. on Information Theory, October 2011, vol. 57, n°10, pp. 7189-7204. Benoît Libert, Moti Yung, Efficient Traceable Signatures in the Standard Model, in Theoretical Computer Science, March 2011, vol. 412, n° 12-14, pp. 1220-1242. Benoît Libert, Damien Vergnaud, Unidirectional Chosen-Ciphertext Secure Proxy Re-Encryption, in IEEE Trans. on Information Theory, March 2011, vol. 57, n° 3, pp. 1786-1802. Benoît Libert, Jean-Jacques Quisquater, Moti Yung, Key Evolution Systems in Untrusted Update Environments, in ACM Transactions on Information and System Security (ACM-TISSEC), Vol. 13 Issue 4, December 2010. Conference Papers Benoît Libert, Alain Passelègue, Mahshid Riahinia, PointProofs Revisited, in Asiacrypt 2022, to appear. Benoît Libert, Ky Nguyen, Alain Passelègue, Cumulatively All-Lossy-But-One Trapdoor Functions from Standard Assumptions, in SCN 2022, to appear. Benoît Libert, Alain Passelègue, Mahshid Riahinia, New and Improved Constructions for Partially Equivocable Public Key Encryption, in SCN 2022, to appear. Calvin Abou Haidar, Benoît Libert, Alain Passelègue, Updatable Public Key Encryption from DCR: Efficient Constructions With Stronger Security, in ACM-CCS 2022, to appear. Full version Benoît Libert, Khoa Nguyen, Thomas Peters, Moti Yung, One-Shot Fiat-Shamir-based NIZK Arguments of Composite Residuosity and Logarithmic-Size Ring Signatures in the Standard Model, in Eurocrypt 2022, LNCS 13276, pp. 488-519. Full version Julien Devevey, Benoît Libert, Thomas Peters, Rational Modular Encoding in the DCR Setting: Non-Interactive Range Proofs and Paillier-Based Naor-Yung in the Standard Model, in PKC 2022, LNCS 13177, pp. 615-646, 2022. Benoît Libert, Khoa Nguyen, Thomas Peters, Moti Yung, Bifurcated Signatures: Folding the Accountability vs. Anonymity Dilemma into a Single Private Signing Scheme, in Eurocrypt 2021, LNCS 12698, pp. 521-552, 2021. Full version Julien Devevey, Benoît Libert, Khoa Nguyen, Thomas Peters, Moti Yung, Non-interactive CCA2-Secure Threshold Cryptosystems: Achieving Adaptive Security in the Standard Model Without Pairings, in PKC 2021, LNCS 12710, pp. 659-690, 2021. Full version Benoît Libert, Khoa Nguyen, Alain Passelègue, Radu Titiu, Simulation-Sound Arguments for LWE and Applications to KDM-CCA2 Security, in Asiacrypt 2020, LNCS 12491, pp. 128-158, 2020. Full version Amit Deo, Benoît Libert, Khoa Nguyen, Olivier Sanders, Lattice-Based E-Cash Revisited, in Asiacrypt 2020, LNCS 12492, pp. 318-348, 2020. Full version Benoît Libert, Alain Passelègue, Hoeteck Wee, David J. Wu, New Constructions of Statistical NIZKs: Dual-Mode DV-NIZKs and More, in Eurocrypt 2020, LNCS 12107, pp. 410-441, 2020. Full version Shweta Agrawal, Benoît Libert, Monosij Maitra, Radu Titiu, Adaptive Simulation Security of Inner Product Functional Encryption, in PKC 2020, LNCS 12110, pp. 34-64, 2020. Copyright IACR. Benoît Libert, Radu Titiu, Multi-Client Functional Encryption for Linear Functions in the Standard Model from LWE, in Asiacrypt 2019, LNCS 11923, pp. 520-551, 2019. Full version Benoît Libert, Chen Qian, Lossy Algebraic Filters With Short Tags, in PKC 2019, LNCS 11442, pp. 34-65, 2019. Full version. Benoît Libert, Khoa Nguyen, Benjamin Hong Meng Tan, Huaxiong Wang, Zero-Knowledge Elementary Databases with More Expressive Queries, in PKC 2019, LNCS 11442, pp. 255--285, 2019. Full version. Benoît Libert, Damien Stehlé, Radu Titiu, Adaptively Secure Distributed PRFs from LWE, in Theory of Cryptography Conference 2018 (TCC'18), LNCS 11240, pp. 391-421, 2018. Full version. Benoît Libert, Thomas Peters, Chen Qian, Logarithmic-Size Ring Signatures With Tight Security from the DDH Assumption, in ESORICS 2018, LNCS 11099, pp. 288-308, 2018. Full version. Junqing Gong, Benoît Libert, Somindu C. Ramanna, Compact IBBE and Fuzzy IBE from Simple Assumptions, in Security and Cryptography for Networks (SCN 2018), LNCS 11035, pp. 563-582, 2018. Full version. Benoît Libert, San Ling, Khoa Nguyen, Huaxiong Wang, Lattice-Based Zero-Knowledge Arguments for Integer Relations, in Crypto 2018, LNCS 10992, pp. 700-732, 2018. Full version. Benoît Libert, San Ling, Khoa Nguyen, Huaxiong Wang, Zero-Knowledge Arguments for Lattice-Based PRFs and Applications to E-Cash, in Asiacrypt 2017, LNCS 10626, pp. 304-335, 2017. Full version. Benoît Libert, San Ling, Fabrice Mouhartem, Khoa Nguyen, Huaxiong Wang, Adaptive Oblivious Transfer with Access Control from Lattice Assumptions, in Asiacrypt 2017, LNCS 10624, pp. 533-563, 2017. Full version. Benoît Libert, Amin Sakzad, Damien Stehlé, Ron Steinfeld, All-But-Many Lossy Trapdoor Functions and Selective Opening Chosen-Ciphertext Security from LWE, in Crypto 2017, LNCS 10403, pp. 332--364, 2017. Full version. Benoît Libert, Thomas Peters, Chen Qian, Structure-Preserving Chosen-Ciphertext Security With Shorter Verifiable Ciphertexts, in PKC 2017, LNCS 10174, pp. 247--276, 2017. Full version. Marc Joye, Benoît Libert, Encoding-Free ElGamal-type Encryption Schemes on Elliptic Curves, in CT-RSA 2017, LNCS 10159, 2017. Proceedings version. Copyright Springer. Benoît Libert, San Ling, Fabrice Mouhartem, Khoa Nguyen, Huaxiong Wang, Zero-Knowledge Arguments for Matrix-Vector Relations and Lattice-Based Group Encryption, in Asiacrypt 2016, LNCS 10032, pp. 101--131, 2016. Full version. Benoît Libert, San Ling, Fabrice Mouhartem, ",
  "content_length": 25515,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:10"
}