{
  "name": "Bent Thomsen",
  "homepage": "http://people.cs.aau.dk/~bt",
  "status": "success",
  "content": "Welcome to Bent Thomsens home page Welcome to Bent Thomsens home page Bent Thomsen is a Professor (MSO) with special responsibilities as research leader for programming technology in the Distributed, Embedded and Intelligent Systems Group at the department of computer science at Aalborg University. His research is in programming languages and programming technology with applications in parallel, concurrent, distributed, mobile, embedded and data processing systems. His current research is on energy aware software development. Bent is the author of several book chapters, more than fifteen journal publications and forty conference papers. Bent has more than 10 years of industrial research and research management experience. Before joining Aalborg University, he was one of ICLs (now Fujitsu Services) three Principal Researchers, based at ICL HQ in Bracknell, UK. Before joining ICL, he was the team-leader for the Facile Programming Language team at ECRC in Munich, Germany. Bent Thomsen is a Chartered IT Professional (CITP), a Chartered Engineer (CEng) and a registered European Engineer (Eur Ing). He is a fellow of the British Computer Society (BCS), a lifelong senior member of the ACM, a senior member of IEEE, a member of BSC FACS, EAPLS and EATCS. Bent has a B.Sc in Mathematics and an M.Sc in computer science from Aalborg University, Denmark and a Ph.D and DIC from Imperial College, London University, UK. Link to my PhD Thesis Link to my MSc Thesis Bent Thomsen - Google Scholar B. Thomsen - Arnetminer Bent Thomsen - ACM author profile page Bent Thomsen - ResearchGate DBLP: Bent Thomsen Bent Thomsen | Aalborg University - Academia.edu Bent Thomsen (0000-0002-5853-7973) - ORCID | Connecting Research and Researchers Scopus - Author details (Thomsen, Bent) Bent Thomsen - Linkedin Bent Thomsen - Person Profil - Aalborg Universitet (AAU) .",
  "content_length": 1865,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:11"
}