{
  "name": "Benyuan Liu",
  "homepage": "http://www.cs.uml.edu/~bliu",
  "status": "success",
  "content": "Welcome to Benyuan Liu's Website Benyuan Liu Professor Department of Computer Science University of Massachusetts Lowell Phone: (978) 934-2425 Fax: (978) 934-3551Email: bliu@cs.uml.edu Home Teaching Publications Students Services Short Bio Dr. Benyuan Liu has been a faculty member in the Department of Computer Science at the University of Massachusetts Lowell since 2004. He received his Ph.D. degree in computer science from the University of Massachusetts Amherst. Prior to that, he received his B.S. degree in physics from University of Science and Technology of China (USTC) and M.S. degree in physics from Yale University. Dr. Liu's main research interests are in the area of application, design and performance analysis of mobile computing, data mining and computer networking technologies. Using a mix of theoretical and experimental approaches, he seeks a fundamental understanding of the performance limits and efficient protocol design of new and emerging computing and networking technologies. His research has been published in premium computer science conferences and journals, and has been widely reported by major news media, including MIT Technology Review, Wired, etc. His research has been supported by the National Science Foundation (NSF), National Institutes of Health (NIH), MassDOT and Microsoft Research. He is a recipient of the NSF CAREER Award. Dr. Liu served as program co-chair of International Performance Computing and Communications Conference (IPCCC) 2016, International Conference on Wireless Algorithms, Applications, and Systems (WASA) 2009, Demo/Posters co-chair of Infocom 2010, track co-chair of International Conference on Distributed Computing in Sensor Systems (DCOSS) 2016, IEEE ICCCN 2008, and program committee member of numerous computer networking conferences such as IEEE Infocom, ICDCS, and SECON. He is the lead guest editor of a special issue of EURASIP Journal on Wireless Communications and Networking, 2009. News Team wins a $2.5M NSF smart and connected community grant in 2022, featured on UML News and Lowell Sun. Multi-disciplinary student team wins the 2021 Transportation Technology Tournament. Tong Sun graduated with Ph.D., 2021, now at HarbourVest. Pengfei Zhang graduated with Ph.D., 2020, now at Tencent. Paper won Best Student Paper Finalist at IJCNN 2020 conference. Smart Health for Diagnoses of Tuberculosis project was reported by NIH. Paper My Google Glass Sees Your Password! reported by CNN, Wired, Huffington Post, Forbes, Yahoo, MIT Technology Review, PC Magazine, etc check here) Research on online dating behavior analysis was reported by the MIT Technology Review(link) Paper Predicting User Replying Behavior on a Large Online Dating Site at the Eighth International AAAI Conference on Weblogs and Social Media (ICWSM 2014) was reported by Follow the Crowd and the Conversation. Paper (HAWK: An Unmanned Mini Helicopter-based Aerial Wireless Kit for Localization, by Zhongli Liu, Yinjie Chen, Benyuan Liu, Chunyu Cao, Xinwen Fu) selected as the Spotlight article of the IEEE Transactions on Mobile Computing (TMC), Feb, 2014. Harsh Achrekar received Best Student Paper Award at HealthInf 2012, for his work \"Twitter Improves seasonal Influenza Prediction\". Our flu prediction with online social media work has been reported by UMass Lowell News, Georgia Department of Public Health News, and Italian Magazine Focus Extra (page 78). Peng Xia graduated in 2014, now at Facebook, congratulations! Bhanu Kaushik gradauted in 2014, now at Schlumberger, congratulations! Harsh Achrekar (PhD) graduated in 2012 , now at eClinicalWorks. Congratulations! Bill Gauvin (PhD) graduted in 2011, now at Symantec Research Labs. Congratulations! Anwar Saipulla (PhD) graduated in 2010, now at Microsoft. Congratulations! Stanley Barr (PhD) graduated in 2009, now at MITRE Corporation. Congratulations! Sean Casey (MS) graduated in 2007, now at BAE Systems. Congratulations! All Rights Reserved. Page last modified on November, 2022",
  "content_length": 3996,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:12"
}