{
  "name": "Beom-Joon Kim",
  "homepage": "https://beomjoonkim.github.io",
  "status": "success",
  "content": "Beomjoon Kim (김범준) Beomjoon Kim {firstname}.{lastname} at kaist.ac.kr I am an Associate Professor in Graduate School of AI at KAIST. I direct the Humanoid Generalization (HuGe) lab, where we have several research internship positions available. I am interested in creating general-purpose humanoids that can efficiently make decisions in complex environments. Previously, I obtained my Ph.D. in computer science from MIT CSAIL, my MSc in computer science from McGill University, and my BMath in computer science and statistics from University of Waterloo. CV  / Google Scholar / Github / Twitter Recent research Check out my talk at MIT Embodied Intelligence seminar for our recent effort in developing a general-purpose robot. HuGe lab Ph.D students Jamie (Yoonyoung) Cho Dongwon Son Junhyek Han Dongryung Lee Haewon Jung Seunghoon Jeon (co-adivsed by Jemin Hwangbo) Masters students Haecheol Park Yoontae Cho Hojin Jung Donguk Lee Interns Jiho Kim Hyunho Noh Publications PRESTO: Fast motion planning using diffusion models based on key-configuration environment representation. Mingyo Seo, Yoonyoung Cho, Yoonchang Sung, Peter Stone, Yuke Zhu, Beomjoon Kim. International Conference on Robotics and Automation (ICRA), 2025. [pdf] Prime the Search: Using Large Language Models for Guiding Geometric Task and Motion Planning by Warm-starting Tree Search. Dongryung Lee*, Sejune Joo*, Kimin Lee, Beomjoon Kim. International Journal of Robotics Research (IJRR), 2025. [pdf] CORN: Contact-based Object Representation for Nonprehensile Manipulation of General Unseen Objects Yoonyoung Cho, Junhyek Han, Yoontae Cho, Beomjoon Kim International Conference on Learning Representations (ICLR), 2024. [pdf] [video] [project page] An Intuitive Multi-Frequency Feature Representation for SO(3)-Equivariant Networks Dongwon Son, Jaehyung Kim, Sanghyeon Son, Beomjoon Kim International Conference on Learning Representations (ICLR), 2024. [pdf] Open X-Embodiment: robotic learning datasets and RT-X models Open X-Embodiment Collaboration International Conference on Robotics and Automation (ICRA), 2023. [pdf] Learning whole-body manipulation for quadrupedal robot Seunghun Jeon, Moonkyu Jung, Suyoung Choi, Beomjoon Kim (co-corresponding author), Jemin Hwangbo Robotics and Automation Letters (RA-L), 2023. [pdf] [video] Preference learning for guiding the tree search in continuous POMDPs Jiyong Ahn, Sanghyeon Son, Dongryung Lee, Jisu Han, Dongwon Son, and Beomjoon Kim. Conference on Robot Learnining (CoRL), 2023. [pdf] [project page] Pre- and Post-Contact Policy Decomposition for Non-Prehensile Manipulation with Sim-to-Real Transfer. Minchan Kim, Junhyek Han, Jaehyung Kim, and Beomjoon Kim. International Conference on Intelligent Robots and Systems (IROS), 2023. [pdf] [project page] Local object crop collision network for efficient simulation of non-convex objects in GPU-based simulators. Dongwon Son, Beomjoon Kim. Robotics: Science and Systems (RSS), 2023. [pdf] [project page] Ohm^2: Optimal hierarchical planner for object search in large environments via mobile manipulation Yoonyoung Cho*, Donghoon Shin*, Beomjoon Kim. International Conference on Intelligent Robots and Systems (IROS), 2022. [pdf] Representation, learning, and planning algorithms for geometric task and motion planning Beomjoon Kim, Luke Shimanuki, Leslie Pack Kaelbling, Tomás Lozano-Pérez. International Journal of Robotics Research, 2021. [doi] [arXiv] Integrated task and motion planning . Caelan Reed Garrett, Rohan Chitnis, Rachel Holladay, Beomjoon Kim, Tom Silver, Leslie Pack Kaelbling, Tomás Lozano-Pérez. Annual Review of Control, Robotics, and Autonomous Systems, 2021. [pdf] [arXiv] A Long Horizon Planning Framework for Manipulating Rigid Pointcloud Objects . Anthony Simeonov, Yilun Du, Beomjoon Kim, Francois Hogan, Joshua Tenenbaum, Pulkit Agrawal, Alberto Rodriguez. Conference on Robot Learning (CoRL), 2020. [arXiv] [project page] [video] CAMPs: Learning Context-Specific Abstractions for Efficient Planning in Factored MDPs . Rohan Chitnis*, Tom Silver*, Beomjoon Kim, Leslie Pack Kaelbling, Tomás Lozano-Pérez Conference on Robot Learning (CoRL), 2020. Plenary talk (top 12% of accepted papers). [pdf] [video] Monte Carlo Tree Search in continuous spaces using Voronoi optimistic optimization with regret bounds . Beomjoon Kim, Kyungjae Lee, Sungbin Lim, Leslie Pack Kaelbling, Tomas Lozano-Perez. AAAI Conference on Artificial Intelligence (AAAI), 2020. Oral (top 6% of accepted papers). [pdf] [appendix] Learning to guide task and motion planning using score-space representation. Beomjoon Kim, Zi Wang, Leslie Pack Kaelbling, Tomás Lozano-Pérez. International Journal of Robotics Research, 2019. [doi] [arXiv] Learning value functions with relational state representations for guiding task-and-motion planning. Beomjoon Kim, Luke Shimanuki Conference on Robot Learning (CoRL), 2019. [pdf] [appendix] Adversarial actor-critic method for task and motion planning problems using planning experience. Beomjoon Kim, Leslie Pack Kaelbling, Tomás Lozano-Pérez AAAI Conference on Artificial Intelligence (AAAI), 2019. Oral (top 6% of accepted papers). [pdf] [appendix] Regret bounds for meta Bayesian optimization with an unknown Gaussian process prior. Zi Wang*, Beomjoon Kim*, Leslie Pack Kaelbling Neural Information Processing Systems (NeurIPS), 2018. Spotlight (top 3.5% of accepted papers). [pdf] Guiding search in continuous state-action spaces by learning an action sampler from off-target search experience. Beomjoon Kim, Leslie Pack Kaelbling, Tomás Lozano-Pérez AAAI Conference on Artificial Intelligence (AAAI), 2018. Oral (top 6% of accepted papers). [pdf] Learning to guide task and motion planning using score-space representation. Beomjoon Kim, Leslie Pack Kaelbling, Tomás Lozano-Pérez International Conference on Robotics and Automation (ICRA), 2017. Best Cognitive Robotics Paper award. [pdf] Socially adaptive path planning in human environments using inverse reinforcement learning . Beomjoon Kim, Joelle Pineau International Journal of Social Robotics, 2016. [pdf] Generalizing over uncertain dynamics for on-line trajectory generation. Beomjoon Kim, Leslie Pack Kaelbling, Tomás Lozano-Pérez International Symposium of Robotics Research (ISRR), 2015. [pdf] Learning from limited demonstrations . Beomjoon Kim, Amir-massoud Farahmand, Doina Precup, Joelle Pineau. Neural Information Processing Systems (NeurIPS), 2013. Spotlight (top 4% of accepted papers). [pdf] Maximum mean discrepancy imitation learning. Beomjoon Kim, Joelle Pineau. Robotics: Science and Systems (RSS), 2013. [pdf] template for this site 김범준",
  "content_length": 6628,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:11"
}