{
  "name": "Berk Çalli",
  "homepage": "https://www.wpi.edu/people/faculty/bcalli",
  "status": "success",
  "content": "Berk Calli | Worcester Polytechnic Institute Skip to main content Office Unity Hall, Room: 284, Phone ext.: 5448 Phone +1 (508) 8315000 x5448 Youtube Icon of Youtube Logo LinkedIn Icon of LinkedIn Logo Google Scholar Icon of a grad with a graduation cap Personal Website Lab Links Manipulation and Environmental Robotics Laboratory (MER Lab) Berk Calli Robotics Engineering Associate Professor Affiliated Department or Office Robotics Engineering Computer Science Mechanical & Materials Engineering Education Postdoc Yale University 2014-2018 PhD Delft University of Technology, The Netherlands 2009-2014 MS Sabanci University, Turkey 2006-2008 BS Sabanci University, Turkey 2002-2006 Berk's research primarily focuses on problems related to robotic manipulation, which is a key functionality largely missing from the current state of the art in robotics for unstructured environments, including homes, modern warehouses, and collaborative manufacturing stations. He develops multi-modal robotic manipulation strategies mainly focusing on the role of vision feedback for coping with uncertainties of unstructured environments. He integrates advanced control methods, active vision framework, machine learning and intelligent mechanical design to provide robust dexterous manipulation capabilities. Prior to WPI, Berk worked in the Grab Lab at Yale University on robust within-hand manipulation techniques. He is also one of the founders and an administrator of the Yale-CMU-Berkeley (YCB) Object and Model Set project, which facilitates benchmarking efforts worldwide for robotic manipulation. He is the head of Manipulation and Environmental Robotics Lab (MER Lab), which focuses on fundamental manipulation problems and various environmental sustainability-related projects (e.g. sorting for recycling, metal scrap recovery). Berk Calli Robotics Engineering Associate Professor Affiliated Department or Office Robotics Engineering Computer Science Mechanical & Materials Engineering Education Postdoc Yale University 2014-2018 PhD Delft University of Technology, The Netherlands 2009-2014 MS Sabanci University, Turkey 2006-2008 BS Sabanci University, Turkey 2002-2006 Berk's research primarily focuses on problems related to robotic manipulation, which is a key functionality largely missing from the current state of the art in robotics for unstructured environments, including homes, modern warehouses, and collaborative manufacturing stations. He develops multi-modal robotic manipulation strategies mainly focusing on the role of vision feedback for coping with uncertainties of unstructured environments. He integrates advanced control methods, active vision framework, machine learning and intelligent mechanical design to provide robust dexterous manipulation capabilities. Prior to WPI, Berk worked in the Grab Lab at Yale University on robust within-hand manipulation techniques. He is also one of the founders and an administrator of the Yale-CMU-Berkeley (YCB) Object and Model Set project, which facilitates benchmarking efforts worldwide for robotic manipulation. He is the head of Manipulation and Environmental Robotics Lab (MER Lab), which focuses on fundamental manipulation problems and various environmental sustainability-related projects (e.g. sorting for recycling, metal scrap recovery). Office Unity Hall, Room: 284, Phone ext.: 5448 Phone +1 (508) 8315000 x5448 Youtube Icon of Youtube Logo LinkedIn Icon of LinkedIn Logo Google Scholar Icon of a grad with a graduation cap Personal Website Lab Links Manipulation and Environmental Robotics Laboratory (MER Lab) Sustainable Development Goals SDG 11: Sustainable Cities and Communities SDG 11: Sustainable Cities and Communities - Make cities and human settlements inclusive, safe, resilient and sustainable Image SDG 13: Climate Action SDG 13: Climate Action - Take urgent action to combat climate change and its impacts Image Research Interests Robotic manipulation Robot vision Machine learning Dexterous manipulation Environmental Robotics Professional Affiliations FORW-RD NRT Program NSF I/UCRC Robots and Sensors for Human Well-being News Chev Right Icon of hollow arrow pointing right Arrow Right Icon of arrow pointing right SEE MORE NEWS ABOUT Berk Calli WPI Researchers to Develop Robotic Arm for Wheelchairs February 18, 2025 LISTEN: Play Button Icon of a play button Pause Icon of pause button 00:00 | 04:26 Your browser does not support the audio element. Early-Career Faculty Receive Prestigious Research Awards October 09, 2024 LISTEN: Play Button Icon of a play button Pause Icon of pause button 00:00 | 07:46 Your browser does not support the audio element. Students Develop Robotic Technology for Recycling Centers April 28, 2022 WPI Researcher Leads Study to Develop Robotics for Recycling November 05, 2019 Announcements WPI Projects Win AI Innovation Challenge October 20, 2025 Advancing Robotics: Berk Calli Secures NSF CAREER Award for Innovative Research October 11, 2024 Media Coverage Chev Right Icon of hollow arrow pointing right Arrow Right Icon of arrow pointing right See More Media Coverage Boston Business Journal Massachusetts AI Hub starts awarding money for applied AI projects Several media outlets reported on two WPI research projects being selected as winners of the first Massachusetts AI Models Innovation Challenge. The projects led by Michael Timko, William B. Smith Professor of Chemical Engineering and head of the Department of Chemical Engineering, and Berk Calli, associate professor in the Robotics Engineering Department, harness artificial intelligence to advance clean technology. Additional Publications: Worcester Business Journal | The Worcester Guardian Recycling Today International Shipbreaking to add robotics technology Berk Calli, assistant professor of robotics engineering, is leading efforts to develop robotics and software technology that seeks to make metal cutting and metal recycling safer and more sustainable. Podcast Episodes E11: Climate Robotics | Berk Calli, associate professor, Robotics Engineering Guest: Berk Calli July 02, 2025",
  "content_length": 6086,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:12"
}