{
  "name": "Berk Canberk",
  "homepage": "http://bcrg.itu.edu.tr",
  "status": "success",
  "content": "BCRG About us Welcome to Broadband Communication and Network Automation Research Group (BCRG) official web site. Our research focuses include: AI-Enabled Autonomous 5G+ Systems Data - Driven Networks Unmanned Aerial Networks (UAV) Digital Twin Networks BCRG has 11 active members including 7 PhD and 2 MS students and 2 BSc students. Supervisor Berk Canberk, PhD b[DOT]canberk[AT]napier[DOT]ac[DOT]uk, canberk[AT]itu[DOT]edu[DOT]tr, canberk[AT]northeastern[DOT]edu Professor, School of Computing, Engineering and The Built Environment | Edinburgh Napier University Artificial Intelligence and Data Engineering | Istanbul Technical University Academic Director Research and Innovation | BTS Group He is a Professor at the Department of Artificial Intelligence and Data Engineering in Istanbul Technical University (ITU), and Professor at the School of Computing, Engineering and The Built Environment in Edinburgh Napier University. Since October 2016, He is also an Adjunct Professor in the Electrical and Computer Engineering Department at Northeastern University, Boston-USA. Also, Between January 2016 - July 2016, he was a Visiting Associate Professor in the School of Electronics, Electrical Engineering and Computer Science at Queen’s University Belfast (QUB), UK. He was a Visiting Assistant Professor in the Department of Electronic and Communication Engineering at Tampere University of Technology, Finland, between June 2015 - September 2015. Dr. Canberk is a Senior Member of the IEEE, Member of the ACM and Member of the IET. He serves as an Editor in IEEE Transactions in Vehicular Technology, Elsevier Computer Networks and Elsevier Computer Communications Journal. He is a Board Member / Observer of the IEEE 1900.5 Cognitive Radio for Dynamic Spectrum Access and IEEE Tactile Internet Standardization Working Groups. He is a group member of Internet Research Task Force’s Network Management Research Group (IRTF NMRG). He has been involved in several international conferences as technical program co-chair, symposium chair, demo/poster chair, regional chair, publicity chair, tutorial chair, and TPC member. Recent Achievements JUNE 2023 Award T. Bilen has received Serhat Özyar Young Scientist of the Year Honorary Award for her thesis titled 'Artificial Intelligence-based and Digital Twin-enabled Aeronautical Ad-Hoc Network Management'. link JUNE 2023 Award T. Bilen has received Most Succesfull Doctoral Thesis Award from Istanbul Technical University for her thesis titled 'Artificial Intelligence-based and Digital Twin-enabled Aeronautical Ad-Hoc Network Management'. link APR 2023 Award \"Turkish Academy of Sciences\" has awarded T. Bilen with PhD. Science Award for her thesis titled 'Artificial Intelligence-based and Digital Twin-enabled Aeronautical Ad-Hoc Network Management'. link 11 MAY 2023 Recognition Prof. Canberk will give a speach titled \"Digital Twin Approaches for Communication and CyberSecurity\" at 6th International Conference on Big Data in Cybersecurity,Edinburgh, Scotland, UK, May 2023. link MAR 2023 Recognition Prof. Canberk gave an invited talk titled \"Digital Twin Networks for Future 6G Deployments\" at Turkish Telekom. MAR 2023 Recognition Prof. Canberk gave an invited talk titled \"A new frontier in Energy Governance: Digital Twin Enabled Sustainable Energy Management\" at Uniper Energy Germany. 26 FEB 2023 Recognition Prof. Canberk is the General Chair of IEEE CAMAD 2023 . 20 FEB 2023 Recognition Prof. Canberk will give an invited talk titled 'Digital Twins: Infrastructure, Cybersecurity & Digital Innovation' at the CyberScotland Week, 2 March 2023, link. 20 FEB 2023 Recognition Prof. Canberk will give an invited talk titled 'Digital Twins in the 6G Era: The Real-Time Connected Intelligence' at the CyberScotland Week, 1 March 2023, link. Partners",
  "content_length": 3811,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:13"
}