{
  "name": "Berk Ustun",
  "homepage": "https://www.berkustun.com",
  "status": "success",
  "content": "Berk Ustun Assistant Professor Halıcıoğlu Data Science Institute Department of Computer Science & Engineering University of California, San Diego HDSI 452 CV Bio Google Scholar GitHub LinkedIn Bluesky Twitter Assistant Professor Data Science Computer Science HDSI 452 CV Bio Google Scholar GitHub LinkedIn Bluesky Prospective Students and Postdocs: please read this page. About My group develops methods to promote the adoption and safety of machine learning in domains like medicine, consumer finance, and the physical sciences. We focus on last mile problems related to fairness, interpretability, personalization, and governance. Previously, I held research positions at Google AI and Harvard. I also co-founded Petal, a company that uses machine learning to broaden credit access. I received a PhD in Computer Science from MIT, and Bachelors degrees in Operations Research and Economics from UC Berkeley. News Sep 25 2025 Thrilled to be part of ARIA, a new AI Research Institute on Interaction for AI Assistants! Thank you NSF for supporting this research! Aug 25 2025 I’m now a Faculty Affiliate with UCSD’s Jacobs Center for Health Innovation. Looking forward to collaborations on safety, interpretability, personalization, and fairness in healthcare. Jun 25 2025 Congratulations to Hailey Joren for successfully defending her PhD thesis! Hailey will be heading to Anthropic to work on AI Safety! Nov 24 2024 Our group grew by 1! Welcome Meredith Stewart! Jun 24 2024 Excited to serve on the Executive Committee at FAccT! May 24 2024 Our group grew by 1! Welcome Harry Cheon! May 24 2024 Congratulations to Jamelle Watson-Daniels for successfully defending her PhD thesis! Jamelle will be heading to Meta AI! Dec 23 2023 Recognized as a Notable Area Chair at NeurIPS! Nov 23 2023 We’re hiring postdocs on Responsible ML at UCSD! Apply here. Aug 23 2023 I’ll be visiting the MSRI Program on Fairness, Equity, and Algorithms. See you there! Jun 23 2023 Our group grew by 1! Welcome Shreyas Kadekodi! Jun 23 2023 We received an NSF Award for Recourse Verification! Thank you NSF! Jan 23 2023 Amazon Research Award for Participatory Personalization in Machine Learning! Nov 22 2022 I’ll be serving as a Program Chair for FAccT 2023! Nov 22 2022 I’ll be giving a keynote talk at DeepMath 2022. Oct 21 2021 NIH Award for Bridge to Artificial Intelligence. I’ll be part of the Ethics Core! Sep 21 2021 Started as an Assistant Professor at UCSD! Sep 21 2021 NSF Award for AI-Driven Wildfire Prevention! Thank you NSF! Jul 21 2021 Selected as a Kavli Fellow by the National Academy of Sciences! Jul 21 2021 FAI Award for Fair AI in Medicine! Thank you NSF & Amazon! Jul 21 2021 Keynote @ ICML Workshop for Algorithmic Recourse. See More",
  "content_length": 2733,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:11"
}