{
  "name": "Bernardo Cuenca Grau",
  "homepage": "http://www.cs.ox.ac.uk/people/bernardo.cuencagrau",
  "status": "success",
  "content": "Bernardo Cuenca Grau | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyBernardo Cuenca GrauBernardo Cuenca Grau Professor Bernardo Cuenca Grau Professor of Computer ScienceDeputy Head of Department (Teaching)Tutorial Fellow, Keble CollegeE: bernardo.grau@cs.ox.ac.ukT: (+44) 1865273887I: Google Scholar Room 305, Wolfson Building, Parks Road, Oxford OX1 3QD United Kingdom Themes:Data, Knowledge and ActionCompleted Projects:Privacy in Ontology-Based Information SystemsScore!OptiqueLogMapDBOntomore…InterestsMy research is in the broad field of artificial intelligence. In particular, my work revolves around the areas of knowledge representation and reasoning, knowledge graphs, computational logic, semantic technologies, and graph representation learning. My activities within these areas cover a wide spectrum, including theory and foundations, algorithm design, software and systems, technology standards, and engagement with industry You can find my DBLP entry here and my Google Scholar profile here. You can also find my full CV here. BiographyI am a professor at the Department of Computer Science and a Tutorial Fellow at Keble College.  Until October 2017, I held a prestigious University Research Fellowship awarded by the British Royal Society.  I was a co-founder of Oxford Semantic Technologies , a start-up company from the University of Oxford focusing on high-performance reasoning and query evaluation over large-scale knowledge graphs; the company was acquired by Samsung Electronics in July 2024. Awards and Fellowships University of Oxford's Vice-Chancellor Award for Innovation and Commercialisation, 2025. Distinguished Paper Award at the 2017 International Joint Conference on Artificial Intelligence for the paper \"Foundations of Declarative Data Analysis Using Limit Datalog Programs\" University of Oxford Mathematical and Physical Sciences Division (MPLS) Commercial Impact Award (honourable mention), 2021. Best Paper Award at the 2010 AAAI Conference on Artificial Intelligence for the paper \"How Incomplete is your Semantic Web Reasoner?\" The 2021 Semantic Web Science Association 10 Year Award for the paper \"LogMap: Logic Based and Scalable Ontology Matching\". Best Paper Award at the 3thrd European Semantic Web Conference (ESWC-2006) for the paper \"Repairing Unsatisfiable Concepts in OWL Ontologies.\" Royal Society University Research Fellowship (2009-2017). Oxford Department of Computer Science Teaching Award in 2021 and teaching commendation in 2022 for the course \"Artificial Intelligence\". University of Oxford Mathematical And Physical Sciences Division (MPLS) Commercial Impact Award (Honourable Mention) in 2021. Doctoral Study in Computer Science Students working towards their D.Phil (PhD) are an integral part of the Information Systems Group, and make a vital contribution to our research. See our  studentships page  for further details, and information about  funding opportunities  .  Should you consider applying for a doctoral position in our group, please do not hesitate to contact me first. Selected Activities Co-founder, Oxford Semantic Technologies. Editorial Board Member, ACM Transactions on the Web. Editorial Board Member, Transactions on Graph Data and Knowledge. Editorial Board Member, Semantic Web Journal. General Chair: 2020 International Workshop on Description Logics (DL-2020) Software Tools I have been involved in the design of several tools for ontology management and reasoning. These include the ontology matching tool LogMap , the ontology reasoners MORe , PAGOdA , and SEQUOIA, the temporal reasoner METEOR, and the semantic faceted search system SemFacet See alsoThe OWL 2 ActivityNew Semantic Web JournalISG projectsToolsThe LogMap Web InterfaceSelected PublicationsView AllManage publications Bayesian Treatment of the Spectrum of the Empirical Kernel in (Sub)Linear−Width Neural Networks Ouns El Harzli and Bernardo Cuenca Grau In Proceedings of the Thirteenth International Conference on Learning Representations (ICLR−2025). 2025. Details about Bayesian Treatment of the Spectrum of the Empirical Kernel in (Sub)Linear−Width Neural Networks | BibTeX data for Bayesian Treatment of the Spectrum of the Empirical Kernel in (Sub)Linear−Width Neural Networks Adversarial Attacks as Near−Zero Eigenvalues in the Empirical Kernel of Neural Networks Ouns El Harzli and Bernardo Cuenca Grau In Proceedings of NeurIPS 2024 Workshop on Mathematics of Modern Machine Learning. 2024. Details about Adversarial Attacks as Near−Zero Eigenvalues in the Empirical Kernel of Neural Networks | BibTeX data for Adversarial Attacks as Near−Zero Eigenvalues in the Empirical Kernel of Neural Networks Algorithmic Stability of Minimum−Norm Interpolating Deep Neural Networks Ouns El Harzli‚ Yoonsoo Nam‚ Bernardo Cuenca Grau Ilja Kuzborskĳ and Ard A. Louis In Proceedings of NeurIPS 2024 Workshop on Mathematics of Modern Machine Learning. 2024. Details about Algorithmic Stability of Minimum−Norm Interpolating Deep Neural Networks | BibTeX data for Algorithmic Stability of Minimum−Norm Interpolating Deep Neural Networks ActivitiesDatabasesKnowledge Representation and ReasoningCompleted ProjectsPrivacy in Ontology-Based Information SystemsScore!OptiqueLogMapDBOntoED3 Current Students Ouns  El HarzliEva FengKrzysztof OlejniczakKaalkidan SaheleJingchuan  ShiXiaxia WangElle Michelle Yang Past Students Temitope AjileyeAna ArmasAndrew BateShuwen LiuMaximilian PflügerDingmin WangYujiao Zhou Past Researchers Yuan HeResearch AssociatePan HuAlina PetrovaMichał ZawidzkiAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 5835,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:16"
}