{
  "name": "Bernhard K. Aichernig",
  "homepage": "http://aichernig.blogspot.com",
  "status": "success",
  "content": "Bernhard K. Aichernig Pages Home My Projects Journal Papers Conference Papers Edited Books and Journals Book Chapters DBLP Index Google Scholar Tuesday, 3 June 2025 Two Open PhD Positions as Graduate Teaching Assistant I'm building up my new research group on Formal Methods at Johannes Kepler University Linz (JKU), Austria, and currently have two open PhD positions as Graduate Teaching Assistants:🔗 Job Posting LinkIf you're interested in Specification, Verification, Falsification, and Automata Learning (yes – we learn formal models!), and want to pursue a PhD, please apply!My Institute for Formal Models and Verification (FMV) is responsible for courses such as Formal Models, Model Checking, Debugging, and other research-aligned special topics.I'm also a Key Researcher in the BilAI Cluster of Excellence, which focuses on integrating symbolic and sub-symbolic AI.I work closely with my PhD students, including weekly one-to-one meetings.Deadline: July 2, 2025📨 Looking forward to your application! Eingestellt von Cavaliere Email ThisBlogThis!Share to XShare to FacebookShare to Pinterest Thursday, 10 April 2025 CV Bernhard K. Aichernig is a full professor of Formal Methods at Johannes Kepler University Linz (JKU), Austria, where he leads the Institute of Formal Models and Verification (FMV). His research focuses on the foundations of software engineering for dependable and trustworthy systems, with interests in automated falsification, verification, and modelling. Current topics include automata learning, learning-based testing, and the integration of symbolic and subsymbolic AI. He is the author of more than 140 scientific publications. Until April 2025, he was affiliated with Graz University of Technology. From 2002 to 2006, he held a faculty position at the United Nations University in Macao, China. He served on the board of Formal Methods Europe from 2004 to 2016. Prof. Aichernig holds a habilitation in Practical Computer Science and Formal Methods, a doctorate, and a Diplom-Ingenieur degree, all from Graz University of Technology. Eingestellt von Cavaliere Email ThisBlogThis!Share to XShare to FacebookShare to Pinterest Tuesday, 1 April 2025 New Position at JKU I started on April 1st as Professor of Formal Methods at Johannes Kepler University in Linz, where I’m now heading the Institute of Formal Models and Verification.This marks a new chapter after more than 27 years at Graz University of Technology, interrupted only by four years at UNU in Macau (2002–2006). It was a fantastic time at TU Graz, and I’m very grateful to my alma mater for all the opportunities, collaborations, and support over the years.I’m looking forward to working with my new colleagues at JKU and continuing research and teaching in formal methods. Let’s make systems not only more intelligent — but also more dependable and trustworthy. Eingestellt von Cavaliere Email ThisBlogThis!Share to XShare to FacebookShare to Pinterest Tuesday, 23 January 2024 Activities in 2024 Dean of Studies of the Faculty of Computer Science at TU GrazKey Researcher in three research projects: LearnTwins, AIDoARt (both projects got extended), and TASTE.Co-Manager and key researcher of the  TU Graz - SAL Dependable Embedded Systems Lab (DES Lab) Steering board member of TAP, the International Conference on Tests and ProofsCo-Organizer of the track on AI-Assisted Programming at AISOLA 2024.Invited speaker at the following events:LearnAut 2024, 5th workshop on Learning and Automata, 7 July 2024, Tallinn, Estonia.AISOLA 2024, 2nd Artificial Intelligence ISoLA, Track on AI-Assisted Programming, 30 Oct - 3 Nov 2024, Crete, Greece.10 peer-reviewed publications:4 journal articles6 conference articles, including three A*-conferences (ICSE and ACL)PC Member of several peer-reviewed conferences and workshops, including ECAI 2024, 27th European Conference on Artificial Intelligence FMICS 2024, 29th International Conference on Formal Methods for Industrial Critical SystemsA-MOST 2024, 20th Workshop on Advances in Model Based Testing Teaching Software Paradigms (Bachelor-level)Declarative Programming (Bachelor-level)Quality Assurance in Software Development (Bachelor-level)Model-based Testing (MSc-level)PhD supervision ofEdi Muskardin (defended on September 17th with distinction)Felix WallnerBenjamin von BergExternal PhD reviewer and opponent of Wenjing Chu, Leiden University, the Netherlands (defended on December 4th). Eingestellt von Cavaliere Email ThisBlogThis!Share to XShare to FacebookShare to Pinterest Older Posts Home Subscribe to: Comments (Atom) WELCOME TO BERNHARD'S SITE Bernhard is a full professor (Univ.-Prof.) of Formal Methods at the Institute for Formal Models and Verification at Johannes Kepler University Linz, Austria. Contact e-mail: bernhard.aichernig at jku.attelephone: +43 732 2468 4541 mail: Institute for Formal Models and Verification, Johannes Kepler University Linz, Altenbergerstr. 69, 4040 Linz, Austria, Europe Search Bernhard's Site Labels Research (23) Program Committee (13) Publications (10) Lecturing (9) Testing (6) Mogentes (5) MBAT (3) Programming (3) TRUFAL (2) Blog Archive ▼ 2025 (3) ▼ June (1) Two Open PhD Positions as Graduate Teaching Assistant ► April (2) ► 2024 (1) ► January (1) ► 2023 (1) ► November (1) ► 2022 (1) ► December (1) ► 2021 (1) ► October (1) ► 2020 (2) ► September (1) ► January (1) ► 2019 (2) ► May (1) ► April (1) ► 2018 (1) ► June (1) ► 2017 (2) ► July (1) ► January (1) ► 2016 (3) ► October (1) ► August (1) ► February (1) ► 2015 (2) ► October (1) ► August (1) ► 2014 (2) ► November (1) ► September (1) ► 2013 (1) ► October (1) ► 2012 (4) ► September (2) ► May (1) ► February (1) ► 2011 (6) ► December (1) ► November (2) ► October (2) ► March (1) ► 2010 (10) ► September (5) ► May (2) ► April (1) ► March (1) ► January (1) ► 2009 (15) ► November (1) ► October (4) ► September (2) ► August (1) ► July (7) Followers Subscribe To Posts Atom Posts All Comments Atom All Comments",
  "content_length": 5962,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:25"
}