{
  "name": "Bernard Mans",
  "homepage": "https://researchers.mq.edu.au/en/persons/bernard-mans",
  "status": "success",
  "content": "Bernard Mans - Macquarie University View Scopus Profile Bernard Mans PhD in Computer Science, Université Pierre et Marie Curie (UPMC), Paris, France, 1992, Professor Professor, School of ComputingData Horizons Research CentreFuture Communications Research CentreAdvanced Drone Systems Research Centre https://orcid.org/0000-0001-7897-2043 Phone+61 2 9850 9574Emailbernard.mansmq.eduau h-index 1180 Citations 20 h-index Calculated based on number of publications stored in Pure and citations from Scopus 1994 …2023 Research activity per year Personal profile BiographyProfessor Bernard Mans is an expert in design and analysis of algorithms, specially for graphs and distributed networks. His current interests are in dynamic graphs and dynamic networks for: networking (wireless and mobile networks, including vehicular and human mobility), graph theory (time-varying graphs), Mathematics (functional graphs on finite fields) and disease propagation (pandemic modeling). Bernard was selected as the INRIA-Hitachi Chair in 2003. He is Director and Foundation Member with Prof Igor Shparlinski of the Algorithms and Complexity research group in 1997 upon joining Macquarie University, which is now the Centre for Advanced Computing: Algorithms and Cryptography (ACAC) at Macquarie University. Bernard Mans was the Interim Executive Dean of the Faculty of Science and Engineering at Macquarie University, in Sydney (August 2019 - July 2020). Editorial Board Member of the Journals: Theory of Computing Systems (TOCS), Springer, since 2002.Discrete Mathematics & Theoretical Computer Science (DMTCS), section \"Distributed Computing and Networking\", since 2006. Fingerprint Dive into the research topics where Bernard Mans is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Edge Mathematics 100% delay-tolerant network Computer Science 84% Upper Bound Mathematics 52% Vehicular Network Computer Science 50% routing scheme Computer Science 50% Regular Graph Mathematics 46% mobile ad-hoc network Computer Science 41% Computability Computer Science 39% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2006 2010 2017 2027 2 Active 9 Finished Projects per year Scalable and Extensible Document intelligence PlatformBeheshti, A. (Primary Chief Investigator), Zhang, X. (Chief Investigator), Mans, B. (Chief Investigator), Wu, J. (Chief Investigator), Liu, G. (Chief Investigator), Sheng, M. (Chief Investigator), Yang, J. (Chief Investigator), Asadnia, M. (Chief Investigator), Ghezelbash, D. (Chief Investigator) & Simpson, M. (Other)14/10/22 → 1/01/27Project: Research Efficient Management of Things for the Future World Wide WebSheng, M. (Primary Chief Investigator) & Mans, B. (Other)1/01/17 → …Project: Research Mans - OSP 2017 - What can be computed locally in Dynamic NetworksMans, B. (Primary Chief Investigator)9/01/17 → 30/06/17Project: Research What can be computed locally in Dynamic NetworksMans, B. (Primary Chief Investigator)1/01/17 → 30/06/21Project: Research What can be computed in Dynamic NetworksMans, B. (Primary Chief Investigator)1/01/16 → 31/12/16Project: Research View all 11 projects Research Outputs Research output per year 1994 1998 2005 2008 2009 2010 2016 2018 2019 2020 2023 46 Conference proceeding contribution 44 Article 3 Editorial 2 Chapter 2 More 1 Edited Book/Anthology 1 Conference paper Research output per year Research output per year Balanced allocation on hypergraphsGreenhill, C., Mans, B. & Pourmiri, A., Dec 2023, In: Journal of Computer and System Sciences. 138, p. 1-15 15 p., 103459.Research output: Contribution to journal › Article › peer-review Hypergraphs 100% Edge 75% Probability Theory 25% Balancedness 25% 1 Citation (Scopus) Energy and delay trade-offs of end-to-end vehicular communications using a hyperfractal urban modellingBłaszczyszyn, B., Jacquet, P., Mans, B. & Popescu, D., Jun 2023, In: Annales des Telecommunications/Annals of Telecommunications. 78, 5-6, p. 363-381 19 p.Research output: Contribution to journal › Article › peer-review End to End Communication 100% Vehicular Communication 100% Fractal Dimension 100% Open Data 50% routing path 50% 1 Citation (Scopus) Functional graphs of families of quadratic polynomialsMans, B., Sha, M., Shparlinski, I. E. & Sutantyo, D., Sept 2023, In: Mathematics of Computation. 92, 343, p. 2307-2331 25 p.Research output: Contribution to journal › Article › peer-review Polynomial 100% Quadratic Polynomial 100% Elliptic Curve 50% Finite Field 50% 1 Citation (Scopus) Asynchronous rumor spreading in dynamic graphsMans, B. & Pourmiri, A., Feb 2022, 25th International Conference on Principles of Distributed Systems, OPODIS 2021. Bramas, Q., Gramoli, V. & Milani, A. (eds.). Saarbrücken, Germany: Dagstuhl Publishing, p. 1-20 20 p. 31. (Leibniz International Proceedings in Informatics, LIPIcs; vol. 217).Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Open AccessFile Upper Bound 100% Mobile Network 100% Probability Theory 66% Dimensional Space 66% High Dimensional Space 50% 1 Citation (Scopus) 54 Downloads (Pure) Connecting flying backhauls of unmanned aerial vehicles to enhance vehicular networks with fixed 5G NR infrastructurePopescu, D., Jacquet, P. & Mans, B., Dec 2022, In: IET Smart Cities. 4, 4, p. 239-254 16 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Drone 100% Unmanned Aerial Vehicle 100% Vehicular Network 100% Sustainable Urban Development 100% Mobile Broadband 33% 2 Citations (Scopus) 56 Downloads (Pure) View all 97 research outputs",
  "content_length": 6005,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:15"
}