{
  "name": "Bernhard Jenny",
  "homepage": "https://research.monash.edu/en/persons/bernhard-jenny",
  "status": "success",
  "content": "Bernhard Jenny - Monash University View Scopus Profile Bernhard Jenny Assoc Professor Associate Professor, Department of Human Centred Computing https://orcid.org/0000-0001-6101-6100 EmailBernie.Jennymonashedu 20012025 Research activity per year Personal profile BiographyBernie is an associate professor of immersive visualisation. After obtaining his PhD from ETH Zurich, he was an assistant professor of cartography and geovisualisation at Oregon State University, and a senior lecturer at RMIT University, Melbourne. He joined Monash University in 2017. Homepage: berniejenny.infoResearch interestsI love maps, and my research focuses on the visualisation of geospatial data. I combine cartography, computer graphics, immersive visualisation, and human-computer interaction. My research activities currently focus on virtual reality and augmented reality applied to geospatial data,outdoor augmented reality, storytelling and immersive analytics with geospatial data,adaptive composite map projections for digital maps and virtual reality,the representation of terrain in 2D and 3D, andalgorithms and methods for the design of thematic maps, such as flow maps and dot maps.Supervision interestsI am looking for students who want to create new types of visualisations by combining immersive visualisation, computer graphics, augmented and virtual reality, cartography, geovisualisation, and geographic information science. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationCartography, Doctor of Sciences, Eidgenössische Technische Hochschule Zürich (ETH Zürich) (Federal Institute of Technology Zurich)Award Date: 4 Mar 2010Computer Science, Postgraduate Certificate in Computer Science, Eidgenössische Technische Hochschule Zürich (ETH Zürich) (Federal Institute of Technology Zurich)Award Date: 26 Oct 2005Surveying, Master of Science (Rural Engineering, Environmental Technologies and Surveying), Ecole Polytechnique Federale de Lausanne (EPFL) (Swiss Federal Institute of Technology in Lausanne) Award Date: 1 Apr 2000 Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2022 2022 2023 2026 1 Finished 1 Not started 1 Active Projects per year NG Relief Shading: National Geographic Relief ShadingJenny, B. (Primary Chief Investigator (PCI)), Singh, D. (Chief Investigator (CI)) & Patterson, T. (Chief Investigator (CI))27/11/23 → 30/04/26Project: Research Immersive Analytics - Extension (Data61 CRP 31)Marriott, K. (Primary Chief Investigator (PCI)), Dwyer, T. (Chief Investigator (CI)), Jenny, B. (Chief Investigator (CI)), Cordeil, M. (Chief Investigator (CI)), Engelke, U. (Partner Investigator (PI)), Nguyen, H. (Partner Investigator (PI)), Watkins, D. (Partner Investigator (PI)), Chen, H. (Partner Investigator (PI)) & Knight, K. (Project Manager)Project: Research CaGIS Rising: Remastering Natural Earth with Neural NetworksJenny, B. (Primary Chief Investigator (PCI)), Walker, B. (Chief Investigator (CI)), Singh, D. (Chief Investigator (CI)) & Patterson, T. (Chief Investigator (CI))1/08/22 → 31/07/23Project: Research Research output Research output per year 2001 2010 2011 2015 2016 2017 2021 2025 77 Article 17 Conference Paper 6 Chapter (Book) 1 Letter 1 More 1 Review Article Research output per year Research output per year From Diagrams to Experience: Data Visceralisation of Ecosystem State-and-Transition Models in Virtual RealityGenay, A., Neylan, M. J., Laird, W., Romanis, T., Szetey, K., Richards, A. E., Jenny, B. & Chandler, T., 2025, Proceedings of the 2025 ACM Designing Interactive Systems Conference. Ceccarini, C. & Simão, H. (eds.). New York NY USA: Association for Computing Machinery (ACM), p. 2034-2046 13 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile Ambient Occlusion for Terrain ShadingJenny, B., 19 Jul 2024, In: Cartographic Perspectives. 2024, 103, p. 74-81 8 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile Deimos: A grammar of dynamic embodied immersive visualisation morphs and transitionsLee, B., Satyanarayan, A., Cordeil, M., Prouzeau, A., Jenny, B. & Dwyer, T., 2023, Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems. Mueller, S., R. Williamson, J. & L. Wilson, M. (eds.). New York NY USA: Association for Computing Machinery (ACM), 18 p. 810Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 15 Citations (Scopus) Drawing connections: Designing situated links for immersive mapsGhaemi, Z., Ens, B., Engelke, U. & Jenny, B., 13 Sept 2023, In: Proceedings of the ACM on Human-Computer Interaction. 7, MHCI, 205.Research output: Contribution to journal › Article › Research › peer-review 2 Citations (Scopus) Visualization placement for outdoor augmented data toursGhaemi, Z., Satriadi, K. A., Engelke, U., Ens, B. & Jenny, B., 2023, Proceedings - SUI 2023, ACM Symposium on Spatial User Interaction. Spencer, S. N. (ed.). New York NY USA: Association for Computing Machinery (ACM), 14 p. 9Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 5 Citations (Scopus) View all 102 research outputs Prizes 2007: Henry Johns Award for the Best Cartographic Journal Article in 2006Jenny, B. (Recipient) & Hurni, L. (Recipient), 2007Prize: Prize (including medals and awards) 2009: CaGIS Doctoral Scholarship Award, Cartography and Geographic Information SocietyJenny, B. (Recipient), 2009Prize: Prize (including medals and awards) 2010: ETH MedalJenny, B. (Recipient), 2010Prize: Prize (including medals and awards) 2011: Henry Johns Award for the Best Cartographic Journal Article in 2010Jenny, B. (Recipient), Jenny, H. (Recipient) & Hurni, L. (Recipient), 2011Prize: Prize (including medals and awards) 2012: Henry Johns Award for the Best Cartographic Journal Article in 2011 Jenny, B. (Recipient), Jenny, H. (Recipient), Cartwright, W. E. (Recipient) & Hurni, L. (Recipient), 2012Prize: Prize (including medals and awards) View all 18 prizes Activities Activities per year 2007 2007 2009 2013 2014 2016 2017 2017 6 Editorial responsibility Activities per year Cartography and Geographic Information Science (Journal)Jenny, B. (Editorial board member)Mar 2017 → …Activity: Publication peer-review and editorial work types › Editorial responsibility Journal of Maps (Journal)Jenny, B. (Associate editor)2016 → …Activity: Publication peer-review and editorial work types › Editorial responsibility International Journal of Cartography (Journal)Jenny, B. (Editorial board member)2014 → …Activity: Publication peer-review and editorial work types › Editorial responsibility Cartographic Perspectives (Journal)Jenny, B. (Editorial board member)2013 → …Activity: Publication peer-review and editorial work types › Editorial responsibility Journal of Maps (Journal)Jenny, B. (Editorial board member)2009 → …Activity: Publication peer-review and editorial work types › Editorial responsibility View all 6 activities Press/Media American Mathematical Society: Making the Earth FlatPatterson, T., Šavrič, B. & Jenny, B.12/06/191 item of Media coveragePress/Media: Blogs, Podcasts and Social Media › Podcasts Muse: All Maps Are WrongŠavrič, B., Patterson, T. & Jenny, B.1/05/191 item of Media coveragePress/Media: Article/Feature ArcUser: New Map Projection Meets Cartographic Needs and DesiresPatterson, T., Šavrič, B. & Jenny, B.22/02/191 item of Media coveragePress/Media: Article/Feature xyHt: Equal EarthJenny, B.1/12/181 Media contributionPress/Media: Article/Feature CityLab: MapLab: The Ghosts of Projections PastJenny, B.24/10/181 Media contributionPress/Media: Article/Feature View all 22 press/media",
  "content_length": 8295,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:26"
}