{
  "name": "Bernd Sturmfels",
  "homepage": "https://math.berkeley.edu/~bernd",
  "status": "success",
  "content": "Bernd Sturmfels | U.C. Berkeley Mathematics Home Biography Articles Books Research Students Postdocs Teaching Bernd Sturmfels Director at the Max Planck Institute for Mathematics in the Sciences Leipzig, Germany Professor Emeritus in Mathematics, Statistics and Computer Science, University of California at Berkeley Research Interests: Algebraic Geometry, Combinatorics, Commutative Algebra, Algebraic Statistics, Convex Optimization, Computational Biology, Theoretical Physics Honorary Doctorates On December 2, 2023, I was awarded an honorary doctorate by the University of Bern, Switzerland. In June 2024, I will be awarded an honorary doctorate by the University of Chicago. Many thanks to everyone who supported me. Metric Algebraic Geometry Paul Breiding, Kathlén Kohn and I published this book in the Oberwolfach Seminars Series. We hope you'll find it useful for teaching or self-study. Students Going Places News from 2024: Madeline Brandt accepted a tenure-track position at Vanderbilt University. Kemal Rose starts a postdoc at KTH Stockholm in February. Yelena Mandelshtam won an NSF postdoctoral fellowship, which she will take at IAS Princeton and the University of Michigan. Yassine El Maazouz will be a Harry Bateman Fellow Caltech starting in January 2025. Congratulations to everone!! Invitation to Nonlinear Algebra Mateusz Michalek and I published this textbook in the Graduate Studies Series of the American Mathematical Society. We hope you'll find it useful for teaching or self-study. What is Algebraic Geometry? This is a webinar, aimed at a general audience, in the NAS series Mathematical Frontiers. Mark Green hosts short presentations by Ravi Vakil and me. Adventures in Mentoring I wrote this piece for the Early Career Section of the Notices of the AMS. Excellence through Diversity This article appeared in the newsletter of the European Women in Mathematics (EWM). Nina and Pascal My daughter Nina is a Fashion Designer. She works for Athleta. Click here for a article that features her. My son Pascal is a PhD student in Computer Science. You can find him on Google Scholar. :: Some Coming Activities 02/26 Amplitudes in Vienna 06/26 Metric Algebraic Geometry at MLI :: Some Recent Activities 11/25 Cosmology and Algebra in Amsterdam 10/25 Dynamics+ in Saarbrücken 09/25 MathemAmplitudes in Mainz 09/25 Distances and Critical Points in Romania 09/25 OEMV-DMV Jahrestagung in Linz 08/25 Algebraic Geometry in Zürich 07/25 SIAM Conference in Wisconsin 05/25 Commutative Algebra in Toronto 03/25 Algebraic Statistics in Munich 02/25 Numerical Algebra in Dresden 10/24 D-modules and Physics in Munich 11/24 Combinatorics and Physics at IAS 10/24 Tropical Geometry in Frankfurt 09/24 Dress Legacy at MPI 06/24 Amplitudes at IAS :: Some Writings Linear Programming Dualities Space Curves Chemistry Pictures of tropical planes How to evaluate integrals? What is a Grobner basis? Elimination for tropical varieties The human genotope Home | Biography | Articles | Books | Research | Students | Postdocs | Teaching",
  "content_length": 3040,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:23"
}