{
  "name": "Bernard Tiddeman",
  "homepage": "https://www.aber.ac.uk/en/cs/staff-profiles/listing/profile/bpt",
  "status": "success",
  "content": "Staff profiles  :\t\tDepartment of Computer Science ,\t\tAberystwyth UniversityProf Bernie Tiddeman Professor in Computer Science Department of Computer Science Contact Details Email: bpt@aber.ac.uk ORCID: 0000-0001-7570-1192 Office: C60, Llandinam Building Phone: +44 (0) 1970 621777 Personal Website: http://users.aber.ac.uk/bpt Research Portal Profile Teaching Module Coordinator CS24320 - Applied Graphics CS34020 - Computer Vision CSM4220 - Computer Vision Lecturer PGM2310 - Research Skills and Personal Development (Science) (2310) CSM9060 - Dissertation CSM0960 - Dissertation CSM0960 - Dissertation CSM0960 - Dissertation CS39440 - Major Project CS31920 - Advanced Algorithms CS24320 - Applied Graphics CS21120 - Algorithm Design and Data Structures CHM9360 - MSC Project Coordinator CS34020 - Computer Vision CS24320 - Applied Graphics CSM4220 - Computer Vision Moderator CS27020 - Modelling Persistent Data Tutor CS24320 - Applied Graphics CC39440 - Prosiect Hir Research Groups Vision Graphics and Visualisation Group Athena SWAN Publications Zahid, Y, Zarges, C, Tiddeman, B & Han, J 2025, 'Adversarial diffusion for few-shot scene adaptive video anomaly detection', Neurocomputing, vol. 614, 128796. 10.1016/j.neucom.2024.128796Gregory Dal Toe, S, Tiddeman, B & Zarges, C 2025, Evolutionary Neural Architecture Search using Random Weight Distributions. in G Ochoa (ed.), Proceedings of the Genetic and Evolutionary Computation Conference Companion, GECCO 2025, Málaga, Spain, July 14-18, 2025. GECCO 2025 Companion - Proceedings of the 2025 Genetic and Evolutionary Computation Conference Companion, Association for Computing Machinery, pp. 723-726, GECCO 2025, Málaga, Spain, 14 Jul 2025. 10.1145/3712255.3726664Chapman, S, Beauchamp, G, Evans, R, Zeeman, G, Young, N, Yhnell, E, Wills, N, Williams, C, Watkins, G, Tiddeman, B, Owen, S, Owen, K, Osborne, S, Morgan, G, Meace-Williams, S, Martin, L, Lewis, J, Lewis, C, Layland, S, Karlinger, P, Jones, M, Jones, K, Hughes, C, Horder, S, Haines, J, Gregory, C, Giddy, J, Francis, N, Davies, O, Crick, T, Ayres, J & Atherton, S 2025, 'Using currere to consider past and future landscapes of technology use in learning and teaching: a view from the Wales Collaborative for Learning Design (WCLD)', Cylchgrawn Addysg Cymru | Wales Journal of Education, vol. 27, no. 1, pp. 128-153. 10.16922/wje.27.1.6Zuo, H & Tiddeman, B 2024, 'A U-Net Architecture for Inpainting Lightstage Normal Maps', Computers, vol. 13, no. 2, 56. 10.3390/computers13020056Iftikhar, M, Neal, M, Hold, N, Gregory Dal Toé, S & Tiddeman, B 2024, 'Detection of Crabs and Lobsters Using a Benchmark Single-Stage Detector and Novel Fisheries Dataset', Computers, vol. 13, no. 5, 119. 10.3390/computers13050119More publications on the Research Portal",
  "content_length": 2773,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:16"
}