{
  "name": "Bernhard Bauer",
  "homepage": "https://www.uni-augsburg.de/de/fakultaet/fai/informatik/prof/swtpvs/team/bernhard-bauer",
  "status": "success",
  "content": "Bernhard Bauer Professur für Softwaremethodik für verteilte Systeme Universität Fakultäten Fakultät für Angewandte Informatik Institut für Informatik Lehrstühle und Professuren der Informatik Softwaremethodik für verteilte Systeme Team Bernhard Bauer Prof. Dr. Bernhard Bauer Professor Professur für Softwaremethodik für verteilte Systeme Telefon: +49 821 598 - 2118 Fax: +49 821 598 - 142118 E-Mail: bernhard.bauer@informatik.uni-augsburginformatik.uni-augsburg.de () Raum: 3001 (N) Sprechzeiten: Anmeldung per E-Mail Adresse: Universitätsstraße 6a, 86159 Augsburg Kontakt (.vcf) Hochschulausbildung WS 1987/88 bis November 1992 - Universität Passau Studium der Informatik mit Nebenfach Mathematik, Abschluss: Diplom-Informatiker (Univ.); Berufspraxis Februar 1993 bis April 1997 - Wissenschaftlicher Mitarbeiter am Lehrstuhl Prof. Dr. Eickel, Institut für Informatik, Technische Universität München (TUM) 19. Dezember 1996 - Promotion (Dr. rer. nat.) am Institut für Informatik, TUM Thema: \"Attributed Algebraic Specifications\"; April 1997 bis Dezember 2002 - Fachzentrum \"Intelligente Autonome Systeme\" der Corporate Technology der Siemens AG München (CT IC 6), zuletzt Principal Research Scientist: Internet-Technologien und Middleware, inklusive Software-Engineering und Komponenten für Multi-Agenten-Systeme Reiseassistenz-Systeme und Telematik, mobile Anwendungen und Ubiquitous Computing Agentenstandardisierung FIPA Technologiebeurteilung, Projektleitung und Recruiter für CT Gutachter für die Europäische Kommission z.B. im Bereich Middleware, Grid Computing, Networked Businesses Seit Januar 2003 - Professur für „Programmierung verteilter Systeme\" bzw. „Softwaremethodik für verteilte Systeme“ am Institut für Informatik der Universität Augsburg 2004–2011 - Studiendekan der Fakultät für Angewandte Informatik; Mitglied im Bibliotheksausschuss, Mitglied im Ausschuss für Etat, Raum- und Bauangelegenheiten Seit 2011 -     Dekan der Fakultät für Angewandte Informatik Gutachtertätigkeiten Gutachter, Mitglied in Programmkomitees für Workshops, Konferenzen und Journale im Bereich Agententechnologie, CPS, Softwaretechnik und Autonome Systeme. Gutachter und Experte für die Europäische Kommission, Bundesministerien, DAAD etc. Publikationen 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 | 2012 | 2011 | 2010 | 2009 | 2008 | 2007 | 2006 | 2005 | 2004 | 2003 | 2002 | 2001 | 2000 | 1999 | 1998 | 1996 | 1995 | 1994 | 1993 2025 Benjamin Weigell, Fabian Stieler and Bernhard Bauer. 2025. All you need is an AI platform: a proposal for a complete reference architecture. In Grace Lewis, Henry Muccini, Marcos Kalinowski, Karthik Vaidhyanathan (Eds.). 2025 IEEE/ACM 4th International Conference on AI Engineering – Software Engineering for AI (CAIN), 27-28 April 2025, Ottawa, ON, Canada. IEEE, Piscataway, NJ, 273-274 DOI: 10.1109/CAIN66642.2025.00046PDF | BibTeX | RIS | DOI Raphael Ronge, Bernhard Bauer and Benjamin Rathgeber. 2025. Approaching principles of XAI: a systematization. IEEE Transactions on Artificial Intelligence 6, 5, 1067-1079. DOI: 10.1109/tai.2024.3515937PDF | BibTeX | RIS | DOI Paula Ziethmann, Fabian Stieler, Miriam Elia, Bernhard Bauer and Kerstin Schlögl-Flierl. 2025. CDSS – an interdisciplinary perspective on the statement of the central ethics commission of the German Medical Association [Abstract]. The Royal College of Radiologists Open 3, 100163. DOI: 10.1016/j.rcro.2024.100163PDF | BibTeX | RIS | DOI Paula Ziethmann, Miriam Elia, Fabian Stieler, Bernhard Bauer, Julia Welzel and Kerstin Schlögl-Flierl. 2025. Clinical decision support systems at the intersection of technology and ethics: a critical analysis of the ethical guidelines issued by the German Medical Association. Digital Society 4, 15. DOI: 10.1007/s44206-025-00175-wPDF | BibTeX | RIS | DOI Miriam Elia, Paula Ziethmann, Julia Krumme, Kerstin Schlögl-Flierl and Bernhard Bauer. 2025. Responsible AI, ethics, and the AI lifecycle: how to consider the human influence?. AI and Ethics 5, 4, 4011-4028. DOI: 10.1007/s43681-025-00666-zPDF | BibTeX | RIS | DOI 2024 Vivian Grünherz, Alanna Ebigbo, Miriam Elia, Alessandra Brunner, Tamara Krafft, Leo Pöller, Pia Schneider, Fabian Stieler, Bernhard Bauer, Anna Muzalyova, Helmut Messmann and Sandra Nagl. 2024. Automatic three-dimensional reconstruction of the oesophagus in achalasia patients undergoing POEM: an innovative approach for evaluating treatment outcomes. BMJ Open Gastroenterology 11, 1, e001396. DOI: 10.1136/bmjgast-2024-001396PDF | BibTeX | RIS | DOI Fabian Stieler and Bernhard Bauer. 2024. Enhancing collaboration and agility in data-centric AI projects. In Hermann Kaindl, Mike Mannion, Leszek A. Maciaszek (Eds.). Evaluation of Novel Approaches to Software Engineering: 18th International Conference, ENASE 2023, Prague, Czech Republic, April 24–25, 2023, revised selected papers. Springer, Cham, 321-343 DOI: 10.1007/978-3-031-64182-4_15BibTeX | RIS | DOI Julian Bichl, Thomas Driessen, Melanie Langermeier and Bernhard Bauer. 2024. GraphVault: a temporal graph persistence engine. In Joaquim Filipe, Michał Śmiałek, Alexander Brodsky, Slimane Hammoudi (Eds.). Proceedings of the 26th International Conference on Enterprise Information Systems, April 28-30, 2024, Angers, France. SciTePress, Setúbal, 224-231 DOI: 10.5220/0012556500003690PDF | BibTeX | RIS | DOI Paula Ziethmann, Fabian Stieler, Raphael Pfrommer, Kerstin Schlögl-Flierl and Bernhard Bauer. 2024. Towards a framework for interdisciplinary studies in explainable artificial intelligence. In Helmut Degen, Stavroula Ntoa (Eds.). Artificial Intelligence in HCI: 5th International Conference, AI-HCI 2024, held as part of the 26th HCI International Conference, HCII 2024, Washington, DC, USA, June 29 – July 4, 2024, proceedings, part I. Springer, Cham, 316-333 DOI: 10.1007/978-3-031-60606-9_18PDF | BibTeX | RIS | DOI Miriam Elia, Fabian Stieler, Fabian Ripke, Marius Nann, Sarah Dopfer and Bernhard Bauer. 2024. Towards certifiable AI in medicine: illustrated for multi-label ECG classification performance metrics. In José Antonio Iglesias, Rashmi Dutta Baruah, Araceli Sanchis, Mario Muñoz Organero, Dimitry Kangin, Paulo Vitor De Campos Souza (Eds.). 2024 IEEE International Conference on Evolving and Adaptive Intelligent Systems (EAIS), 23-24 May 2024, Madrid, Spain. IEEE, Piscataway, NJ, 1-8 DOI: 10.1109/eais58494.2024.10570023PDF | BibTeX | RIS | DOI 2023 Miriam Elia and Bernhard Bauer. 2023. A methodology based on quality gates for certiﬁable AI in medicine: towards a reliable application of metrics in machine learning. In Hans-Georg Fill, Francisco José Domínguez Mayo, Marten van Sinderen, Leszek Maciaszek (Eds.). ICSOFT 2023: Proceedings of the 18th International Conference on Software Technologies, 10-12 July 2023, Rome, Italy. SciTePress, Setúbal, 486-493 DOI: 10.5220/0012121300003538PDF | BibTeX | RIS | DOI Fabian Stieler and Bernhard Bauer. 2023. Git workflow for active learning - a development methodology proposal for data-centric AI projects. In Hermann Kaindl, Mike Mannion, Leszek Maciaszek (Eds.). Proceedings of the 18th International Conference on Evaluation of Novel Approaches to Software Engineering (ENASE 2023), April 24-25, 2023, in Prague, Czech Republic. SciTePress, Setúbal, 202-213 DOI: 10.5220/0011988400003464PDF | BibTeX | RIS | DOI Fabian Stieler, Miriam Elia, Benjamin Weigell, Bernhard Bauer, Peter Kienle, Anton Roth, Gregor Müllegger, Marius Nann and Sarah Dopfer. 2023. LIFEDATA - a framework for traceable active learning projects. In Kurt Schneider, Fabiano Dalpiaz, Jennifer Horkoff (Eds.). 2023 IEEE 31st International Requirements Engineering Conference Workshops (REW), 4-5 September 2023, Hannover, Germany. IEEE, Piscataway, NJ, 465-474 DOI: 10.1109/REW57809.2023.00088PDF | BibTeX | RIS | DOI Miriam Elia, Tobias Peter, Fabian Stieler, Bernhard Bauer, Sandra Nagl, Alanna Ebigbo and Vivien Grünherz. 2023. Precision medicine for achalasia diagnosis: a multi-modal and interdisciplinary approach for training data generation [Abstract]. In IEEE - ISBI 2023: International Symposium on Biomedical Imaging, Cartagena de Indias, Colombia, April 18-21, 2023. PDF | BibTeX | RIS Dominik Mueller, Silvan Mertes, Niklas Schroeter, Fabio Hellmann, Miriam Elia, Bernhard Bauer, Wolfgang Reif, Elisabeth André and Frank Kramer. 2023. Towards automated COVID-19 presence and severity classification. In Maria Hägglund, Madeleine Blusi, Stefano Bonacina, Lina Nilsson, Inge Cort Madsen, Sylvia Pelayo, Anne Moen, Arriel Benis, Lars Lindsköld and Parisis Gallos (Ed.). Caring is sharing – exploiting the value in data for health and innovation. IOS Press, Amsterdam (Studies in Health Technology and Informatics ; 302), 917-921. DOI: 10.3233/shti230309PDF | BibTeX | RIS | DOI Dennis Rall, Bernhard Bauer and Thomas Fraunholz. 2023. Towards democratizing AI: a comparative analysis of AI as a service platforms and the open space for machine learning approach. In ICCBDC 2023: Proceedings of the 2023 7th International Conference on Cloud and Big Data Computing, August 17-19, 2023, Manchester, UK. ACM, New York, NY, 34-39 DOI: 10.1145/3616131.3616136PDF | BibTeX | RIS | DOI 2022 Fabian Stieler, Marius Nann and Bernhard Bauer. 2022. Vertrauenswürdige KI in der Medizin - von effizienter Datenannotation bis intuitiver Modellerklärung. In KI-Fabrigk @WIKOIN22, Ingolstadt, 30. Juni 2022. BibTeX | RIS 2021 Reinhard Pröll, Noël Hagemann and Bernhard Bauer. 2021. Abstract test execution for early testing activities in model-driven scenarios. In Slimane Hammoudi, Luís Ferreira Pires and Bran Selić (Ed.). Model-Driven Engineering and Software Development: 8th International Conference, MODELSWARD 2020, Valletta, Malta, February 25–27, 2020, Revised Selected Papers. Springer International, Cham (Communications in Computer and Information Science ; 1361), 273-297. DOI: 10.1007/978-3-030-67445-8_12PDF | BibTeX | RIS | DOI Julia Rauscher and Bernhard Bauer. 2021. Ad",
  "content_length": 77803,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:25"
}