{
  "name": "Bernd Meyer 0001",
  "homepage": "https://research.monash.edu/en/persons/bernd-meyer",
  "status": "success",
  "content": "Bernd Meyer - Monash University Bernd Meyer public CV View Scopus Profile Bernd Meyer Professor Professor, Department of Data Science & AI https://orcid.org/0000-0003-1080-0338 EmailBernd.Meyermonashedu 1992 …2025 Research activity per year Personal profile BiographyBernd Meyer is a Professor in the Faculty of Information Technology at Monash University.Research interestsSelf-Organized Systems and Natural ComputationCollective Behaviour and Collective Decision Making Optimization in NatureNature-inspired Algorithms (specifically Meta-Heuristics for Stochastic Optimization)Supervision interestscollective behaviour and decision makingnatural computationMonash teaching commitmentProfessor Bernd Meyer has experience as the Chief Examiner for the following units in the Faculty of IT: FIT1042 Algorithms, computation and intelligenceFIT9059 Algorithms and data structuresMON1002 The changing face of science: how computational science helps us make sense of the worldFIT2004 Data Structures and Algorithms Bernd has experience as the Lecturer for the following units in the Faculty of IT: FIT1042 Algorithms, computation and intelligenceFIT9059 Algorithms and data structuresFIT4012 Advanced Topics in Computational ScienceMON1002 The changing face of science: how computational science helps us make sense of the worldFIT2004 Data Structures and AlgorithmsFIT3082 (Programming languages and paradigms) Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Dr. rer nat, FernUniversitat (University of Hagen)Award Date: 15 Jun 1994Computer Science, Diplom Informatik, Technische Universitat Braunschweig (Technical University of Braunschweig)Award Date: 1 Jun 1990 Research area keywordsCollective BehaviourCollective Decision MakingModelling and SimulationNatural ComputingIntelligent Systems Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2001 2016 2018 2024 11 Finished Projects per year Self-organised communication as a foundation of large, complex societiesMeyer, B. (Primary Chief Investigator (PCI)), Reid, C. R. (Chief Investigator (CI)), Landgraf, T. (Partner Investigator (PI)) & Couzin, I. (Partner Investigator (PI))1/02/21 → 26/12/24Project: Research Driving Social Change: Women, Entrepreneurship, IoTGonsalvez, C. (Primary Chief Investigator (PCI)), Whittle, J. (Chief Investigator (CI)), Meyer, B. (Chief Investigator (CI)), Cheah, J. (Chief Investigator (CI)), Meitiner, P. (Chief Investigator (CI)), Pakakis, M. (Chief Investigator (CI)), Beekhuyzen, J. (Chief Investigator (CI)) & Van Krieken, A. (Chief Investigator (CI))1/07/18 → 28/02/21Project: Research Modelling collective behaviour to protect social insect ecosystem servicesMeyer, B. (Primary Chief Investigator (PCI)), Burd, M. (Chief Investigator (CI)), Garcia Gallego, J. (Chief Investigator (CI)), Traulsen, A. (Partner Investigator (PI)) & Offenberg, J. (Partner Investigator (PI))9/02/18 → 31/08/22Project: Research Digital Careers Program - Monash University EngagementMeyer, B. (Primary Chief Investigator (PCI))1/07/16 → 30/06/17Project: Research Division of Labour and Collective Homeostasis in Dynamic EnvironmentsMeyer, B. (Primary Chief Investigator (PCI)) & Kleineidam, C. (Chief Investigator (CI))Monash University – Internal University Contribution1/02/16 → 31/12/17Project: Research View all 11 projects Research output Research output per year 1992 1996 1997 1998 2001 2002 2004 2007 2008 2009 2011 2017 2025 50 Conference Paper 42 Article 10 Chapter (Book) 3 Other 5 More 2 Book 1 Commissioned Report 1 Edited Book 1 Letter Research output per year Research output per year Acoustic recognition of individuals in closed and open bird populationsHuang, L., Clarke, R. H., Teixeira, D., Chiaradia, A. & Meyer, B., Dec 2025, In: Ecological Informatics. 90, 14 p., 103330.Research output: Contribution to journal › Article › Research › peer-review Open Access Age polyethism can emerge from social learning: A game-theoretic investigationKhajehnejad, M., García, J. & Meyer, B., 25 Aug 2025, In: PLoS Computational Biology. 21, 8, 22 p., e1013415.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile Self-supervised Learning for Acoustic Few-Shot ClassificationLiang, J., Meyer, B., Lee, I. N. & Do, T. T., 2025, 2025 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). D Rao, B., Trancoso, I., Sharma, G. & B. Mehta, N. (eds.). Piscataway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, 5 p. (ICASSP, IEEE International Conference on Acoustics, Speech and Signal Processing - Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Deep Active Audio Feature Learning in Resource-Constrained EnvironmentsMohaimenuzzaman, M., Bergmeir, C. & Meyer, B., 2024, In: IEEE/ACM Transactions on Audio Speech and Language Processing. 32, p. 3224-3237 14 p.Research output: Contribution to journal › Article › Research › peer-review 3 Citations (Scopus) Environmental sound classiﬁcation on the edge: a pipeline for deep acoustic networks on extremely resource-constrained devicesMohaimenuzzaman, M., Bergmeir, C., West, I. & Meyer, B., Jan 2023, In: Pattern Recognition. 133, 12 p., 109025.Research output: Contribution to journal › Article › Research › peer-review 54 Citations (Scopus) View all 110 research outputs Activities Activities per year 2010 2010 2011 2016 2016 6 Membership of an advisory panel/policy group/ board 5 External research and teaching 2 Submissions to industry or govt committees, commissions and inquiries 1 Thesis Examination Activities per year Curriculum Writer - Victorian Curriculum & Assessment AuthorityMeyer, B. (Member)1 Jan 2016Activity: External Academic Engagement › External research and teaching Member - Association for Computer MachineryMeyer, B. (Fellow)1 Jan 2016Activity: External Academic Engagement › External research and teaching Director - Educational Outreach - Faculty of Information Technology, Monash UniversityMeyer, B. (Fellow)1 Jan 2016Activity: External Academic Engagement › External research and teaching 2015 Course Reviewer - Australian National UniversityMeyer, B. (Member)2015Activity: External Academic Engagement › External research and teaching 2015 Exam Vetter - Victorian Curriculum & Assessment AuthorityMeyer, B. (Examiner)2015Activity: Examination types › Thesis Examination View all 14 activities",
  "content_length": 7011,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:23"
}