{
  "name": "Bernard Gendron",
  "homepage": "https://www.iro.umontreal.ca/~gendron",
  "status": "success",
  "content": "Bernard Gendron Bernard Gendron English Professeur titulaire Département d'informatique et de recherche opérationnelle (DIRO) Université de Montréal C.P. 6128,  Succursale Centre-Ville Montréal, Québec, Canada H3C 3J7 gendron AT iro.umontreal.ca Chercheur Centre interuniversitaire de recherche sur les réseaux d'entreprise, la logistique et le transport (CIRRELT) Université de Montréal C.P. 6128,  Succursale Centre-Ville Montréal, Québec, Canada H3C 3J7 Bernard.Gendron AT cirrelt.ca Adresse pour courrier rapide DIRO Université de Montréal Pavillon André-Aisenstadt, bureau 2194 2920, Chemin de la Tour Montréal, Québec, Canada H3T 1J4 Téléphone : 1 (514) 343-7093 FAX : 1 (514) 343-5834 Enseignement IFT 1575 (A19) IFT 6551 (H19) IFT 6542 (A10) IFT 1063 (A03) IFT 6503 (A03) PLU 6000 (H00) Intérêts de recherche Mon domaine de recherche est l'optimisation combinatoire. Je m'intéresse à la théorie, aux développements méthodologiques et aux applications de l'optimisation combinatoire, notamment: à la théorie polyhédrale pour les modèles de programmation en nombres entiers, en particulier la classe des modèles de conception de réseau; aux méthodes de relaxation et de décomposition pour les modèles de programmation en nombres entiers (coupes, génération de colonnes, relaxation lagrangienne); aux méthodes exactes et heuristiques pour des modèles de programmation en nombres entiers; aux métaheuristiques basées sur l'exploration de voisinages et la diversification pour résoudre des problèmes d'optimisation combinatoire difficiles; à la programmation par contraintes; aux algorithmes parallèles pour résoudre des problèmes d'optimisation combinatoire de grande taille; à de nombreuses applications, notamment dans les domaines de la logistique, du transport, des télécommunications et de la santé. Publications Voici une liste d'articles disponibles. Une liste à jour de mes publications se trouve dans le curriculum vitae détaillé. Curriculum vitae Bernard Gendron est professeur au Département d'informatique et de recherche opérationnelle, Université de Montréal. Son expertise touche à l'optimisation des réseaux logistiques et de transport. Il a été directeur du CIRRELT (Centre interuniversitaire de recherche sur les réseaux d'entreprise, la logistique et le transport) de 2008 à 2015. Il a occupé des postes de professeur-chercheur invité chez ILOG, Paris, au MIT, à l'EPFL, à l'Ecole Centrale de Lille, de même qu'aux universités de Pise, Nice-Sophia-Antipolis, Blaise-Pascal, Versailles et Valenciennes. Il a été président de la Société canadienne de recherche opérationnelle (SCRO), président de la section Montréal de la SCRO, et président de la Section on Transportation Science & Logistics d'INFORMS (la société américaine de recherche opérationnelle). Il a reçu le Prix de la pratique de la SCRO (2004), le Prix de services de la SCRO (2006) et le Prix du mérite de la SCRO (2010) (pour plus de détails). Autres activités Membre du comité de programme, Odysseus 2018 Membre du comité de rédaction, EURO Journal on Transportation and Logistics, 2012-... Rédacteur-en-chef sortant, INFOR, 2006-2014 Président sortant, Société canadienne de recherche opérationnelle (SCRO), 2005-2006 Président sortant, section Montréal de la SCRO, 2000-2007 Président sortant, INFORMS Section on Transportation Science & Logistics (TSL), 2002-2003 Membre, SCRO Membre, INFORMS Membre, INFORMS TSL 2019/08/07",
  "content_length": 3414,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:16"
}