{
  "name": "Bernard D. Frischer",
  "homepage": "http://frischer.org",
  "status": "success",
  "content": "Bernard Frischer Skip to content Bernard Frischer is a digital archaeologist who writes about virtual heritage, Classics, and the survival of the Classical world. He received his B.A.Â  in Classics from Wesleyan University (CT) in 1971 and his Ph.D.Â  in Classics from the University of Heidelberg in 1975. From 1974 to 1976, he had a two-year Prix de Rome fellowship at the American Academy in Rome, where he studied Roman topography and archaeology, worked in the Fototeca Unione as a photographer and typographer, and served two summers as an assistant professor in the Academy’s summer program on Roman topography. He taught Classics at UCLA from 1976 until 2004. In the fall of 2004, he moved to the University of Virginia, where he directed a digital humanities research center and was Professor of Art History and Classics. In 2013, he joined the Luddy School of Informatics and Computing at Indiana University, where until 2021 he directed the Virtual Heritage track. Virtual Heritage is a new field studying ways of applying the new 3D technologies to research and instruction in fields such as anthropology, art and architectural history, and conservation science. He has been a guest professor at the University of Pennsylvania (1992), the University of Bologna (1993), and Beijing Normal University (2009). In 2001-2002 Frischer held the one-year post of Professor-in-Charge of the Intercollegiate Center for Classical Studies in Rome. He is a member of Phi Beta Kappa (inducted in 1970), a Fellow of the Michigan Society of Fellows (1971-1974), a Fellow (1974-76), a Resident (1996), and a Trustee (2009-2012) of the American Academy in Rome. He has also won research fellowships from the American Council of Learned Societies (1981-82, 1996-97), the Center for Advanced Study in the Visual Arts, (1997), and the Zukunftskolleg at the University of Konstanz (2010-11). From 1996 to 2003, he directed the excavations of Horace’s Villa (Licenza, Italy) sponsored by the American Academy in Rome, and from 1996 to 2004 he was founding director of the UCLA Cultural Virtual Reality Laboratory. The lab was one of the first in the world to use 3D computer modeling to reconstruct cultural heritage sites. In 2008 he founded the Virtual World Heritage Laboratory, which was at first based at the University of Virginia and then moved in 2013 to Indiana University, where it is still active today. Through his labs and with the help of many technical and scholarly collaborators, Frischer has overseen many 3D modeling projects, including âRome Reborn,â the digital recreation of the entire city of ancient Rome within the Aurelian Walls, the “Digital Hadrian’s Villa Project,” and the “Uffizi-Indiana University 3D Digitization Project.” In 2004, Frischer made one of the first 3D digital reconstructions of an ancient statueâthe lost portrait of the philosopher Epicurus. In 2006, he used a structured light scanner to model the first statue in the Vatican Museums, the Laocoon statue group, and in 2011 he was one of the first to use photogrammetry to create state models of ancient sculpture and large-scale 3D maps of cultural heritage sites. In 2016 he started a five-year project to digitize in 3D all the Greek and Roman sculptures in Uffizi Gallery in Florence. In 2017 he received a grant from Loeb Classical Library Fund in order to conduct new fieldwork in Rome to clarify the design of the âHorologiumâ of Augustus, a monumental timepiece in the northern Campus Martius. In 2017 and 2018 he published two articles critiquing Edmund Buchnerâs theories about the Horologium and proposing a new interpretation of the relationship between the Horologium and the nearby Ara Pacis Augustae. In recent years, he has founded two online, peer-reviewed journals in the field of digital archaeology. He is now co-editor-in-chief emeritus of one of them: Open Access journal Studies in Digital Heritage. He is Founder and President of Flyover Zone Productions (established in 2016), a commercial company based in Bloomington, Indiana whose mission is to commercialize products and services using 3D digital technologies to present cultural heritage sites and monuments to the general public. In 2005 he was given the Pioneer Award of the International Society on Virtual Systems and Multimedia. In 2009, he was the recipient of the Tartessus Lifetime Achievement Prize from the Spanish Society of Virtual Archaeology. Â Menu TitleAboutContact & CVProjectsResources",
  "content_length": 4483,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:13"
}