{
  "name": "Bernt Schiele [INF]",
  "homepage": "https://www.mpi-inf.mpg.de/departments/computer-vision-and-multimodal-computing/people/bernt-schiele",
  "status": "success",
  "content": "Bernt Schiele - Max Planck Institute for Informatics Skip to main content or main navigation Prof. Dr. Bernt SchieleAddressMax-Planck-Institut für Informatik Saarland Informatics Campus Campus E1 4 66123 SaarbrückenLocationE1 4 - 601Phone+49 681 9325 2000Fax+49 681 9325 2099 E-mail Get email via email Research InterestsUnderstanding sensor information is a fundamental problem in computer science. Scientific challenges cover the entire pipeline from single-sensor processing, over spatial and temporal fusion of multiple and divergent sensor modalities to the complete description of large-scale multimodal sensor streams. At the same time we observe a tremendous increase in both the quantity as well as the diversity of sensor information due to the increasing number of sensors (such as cameras, GPS, or inertial sensors) embedded in a wide variety of digital devices and environments as well as due to the increasing storage of multimodal sensor data (such as surveillance data, personal storage of digital information, multimedia databases, or simply the Internet). While storing and indexing large amounts of sensor data has made tremendous progress, understanding of this multimodal sensor data still lacks far behind. Therefore the long-term goal of our research is to make progress on how to process, structure, access and truly understand multi-sensory data both for online use as well as for large-scale databases.The group currently focuses on two main areas of the broader field, namely computer vision and multimodal sensor processing. In the area of computer vision we address some of the most basic functionalities of image and video understanding such as 3D object class recognition or 3D people detection and tracking. We also look at the problem of 3D scene understanding of traffic scenes as a case study for complete scene understanding. In the area of multimodal computing we currently focus on the problem of human activity recognition as a means to study how ubiquitous or wearable computing may benefit from better sensor understanding. As a final cross-cutting theme for both areas we also work in the area of machine learning. It is clear that only advanced machine learning techniques will enable to infer higher-level information from noisy sensor data and enable to deal with the large-scale nature of current and future multimodal databases and sensor-streams.EducationPhD: Docteur de l'Institut Polytechnique de Grenoble, France, 1997 MSc's: Diplom-Informatiker, University of Karlsruhe, Germany, 1994, and DEA de l'informatique de l'ENSIMAG, France, 1993Short-BioBernt Schiele has been Max Planck Director at MPI for Informatics and Professor at Saarland University since 2010.He studied computer science at the University of Karlsruhe, Germany. He worked on his master thesis in the field of robotics in Grenoble, France, where he also obtained the \"diplome d'etudes approfondies d'informatique\". In 1994 he worked in the field of multi-modal human-computer interfaces at Carnegie Mellon University, Pittsburgh, PA, USA in the group of Alex Waibel. In 1997 he obtained his PhD from INP Grenoble, France under the supervision of Prof. James L. Crowley in the field of computer vision. The title of his thesis was \"Object Recognition using Multidimensional Receptive Field Histograms\". Between 1997 and 2000 he was postdoctoral associate and Visiting Assistant Professor with the group of Prof. Alex Pentland at the Media Laboratory of the Massachusetts Institute of Technology, Cambridge, MA, USA. From 1999 until 2004 he was Assistant Professor at the Swiss Federal Institute of Technology in Zurich (ETH Zurich). Between 2004 and 2010 he was Full Professor at the computer science department of TU Darmstadt.ExperienceFull Professor, TU Darmstadt, Germany, 2004-2010Assistant Professor, ETH Zurich, Switzerland, 1999-2004 Postdoctoral Associate and Visiting Assistant Professor, MIT (Massachussets Institute of Technology), Cambridge, MA, USA, 1997-2000 Visiting researcher at CMU (Carnegie Mellon University), Pittsburgh, PA, USA, 1994 Some External ActivitiesPAMI, IEEE Transactions on Pattern Analysis and Machine Intelligence, Associate Editor in ChiefIJCV, International Journal of Computer Vision, Associate EditorECCV 2018, European Conference on Computer Vision, General Co-ChairECCV 2014, European Conference on Computer Vision, Program Co-ChairICCV 2011, IEEE International Conference on Computer Vision, Program Co-ChairPublicationsSee list of publications",
  "content_length": 4505,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:32"
}