{
  "name": "Bernardo Ferreira",
  "homepage": "https://ciencias.ulisboa.pt/en/perfil/blferreira",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Skip to main content Ciências ULisboa Pesquisa Português English Login You are here / / Back to Top Bernardo Ferreira Contactos Departamento de Informática Sala/Gabinete 6.3.22 Ext. Principal 26378 Telefone Direto 217500255 Email blferreira@ciencias.ulisboa.pt Página Pessoal Carreira Docente Universitário Categoria Professor Auxiliar Indicadores Orcid Scopus Google Scholar CiênciaVitae Keywords Security, Privacy, Distributed Systems Currículo Resumido Bernardo Ferreira is an assistant professor at the Computer Science Department, Faculty of Sciences, University of Lisbon. He obtained his PhD in Computer Science from the NOVA University of Lisbon in 2016. He has participated in multiple national and European research projects and has led a national research project with participation from two major Portuguese universities. He has also published in multiple top tier venues (S&P, NDSS, DSN, TDSC) and has been an invited reviewer for various international journals and conferences. Scientific Interests My main interests are in distributed systems security and privacy, with special focus on cloud computing, decentralized systems, computing on encrypted data, and searchable encryption. Publicações selecionadas Joel Samper and Bernardo Ferreira. \"SoK: Self-generated nudes over private chats: How can technology contribute to a safer sexting?\". In 2025 IEEE Symposium on Security and Privacy (SP'25). Daniela Lopes, Jin-Dong Dong, Pedro Medeiros, Daniel Castro, Diogo Barradas, Bernardo Portela, João Vinagre, Bernardo Ferreira, Nicholas Christin, Nuno Santos. \"Flow Correlation Attacks on Tor Onion Service Sessions with Sliding Subset Sum\". In 2024 Network and Distributed System Security Symposium (NDSS'24). Robin Vassantlal, Eduardo Alchieri, Bernardo Ferreira, Alysson Bessani. \"COBRA: Dynamic Proactive Secret Sharing for Confidential BFT Services\". In 2022 IEEE Symposium on Security and Privacy (SP'22). Manuel Barbosa, Bernardo Ferreira, João Marques, Bernardo Portela, Nuno Preguiça. “Secure conflict-free replicated data types” in 2021 ACM International Conference on Distributed Computing and Networking (ICDCN’21). Bernardo Ferreira, Bernardo Portela, Tiago Oliveira, Guilherme Borges, Henrique Domingos, João Leitão. Boolean Searchable Symmetric Encryption with Filters on Trusted Hardware. 2020. IEEE Transactions on Dependable and Secure Computing (TDSC). Ver todas as Publicações",
  "content_length": 2457,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:19"
}