{
  "name": "Bernd Bischl",
  "homepage": "https://www.slds.stat.uni-muenchen.de",
  "status": "success",
  "content": "Statistical Learning and Data Science Chair :: About Welcome to the chair of Statistical Learning and Data Science at the LMU of Prof. Dr. Bernd Bischl (formerly working group Computational Statistics until early 2020). Our chair is composed of the following research groups, which are led by at least one PostDoc: Automated Machine Learning and Optimization Boosting Causal and Fair Machine Learning Empirical Machine Learning Interpretable Machine Learning / Explainable AI Machine Learning for Survival Analysis Methods Beyond Supervised Learning Natural Language Processing Probabilistic Machine and Deep Learning Research Software Engineering Our Machine Learning Consulting Unit offers consulting regarding the application and evaluation of machine learning methods for (applied) scientists from the LMU, MCML and other interested parties. Our research areas of interest are statistical computing and computational statistics predictive modeling, especially non-linear classification and regression boosting and ensembles deep learning automated machine learning causal inference fair machine learning empirical machine learning and benchmarking model- and variable selection expensive black-box / Bayesian optimization interpretable machine learning machine learning based survival analysis research software development Contact Department of Statistics Chair of Statistical Learning & Data Science Ludwig-Maximilians-Universität München Ludwigstraße 33 D-80539 München For all administrative inquiries please contact our office administration: slds [at] stat.uni-muenchen.de Tel: +49 89 2180 2814 (administration) Fax: +49 89 2180 5308 For general inquiries please contact our scientific manager: juliane.lauks [at] stat.uni-muenchen.de News Please check our BlueSky account for news.",
  "content_length": 1796,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:20"
}