{
  "name": "Bernhard Wicht",
  "homepage": "https://www.ims.uni-hannover.de/wicht.html?&no_cache=1",
  "status": "success",
  "content": "Prof. Dr.-Ing. Bernhard Wicht – Institut für Mikroelektronische Systeme – Leibniz Universität Hannover Bernhard Wicht – Institut für Mikroelektronische Systeme – Leibniz Universität Hannover Fakultät Fakultät für Elektrotechnik und Informatik Start Kontakt Institut für Mikroelektronische Systeme Institut Bernhard Wicht Prof. Dr.-Ing. Bernhard Wicht Prof. Dr.-Ing. Bernhard Wicht Telefon +49 511 762 19690 Fax +49 511 762 19694 E-Mail bernhard.wichtims.uni-hannover.de Prof. Dr.-Ing. Bernhard Wicht Telefon +49 511 762 19690 Fax +49 511 762 19694 E-Mail bernhard.wichtims.uni-hannover.de Publikationsliste Google Scholar alle Kategorien Konferenzbeiträge Journalbeiträge Dissertationen Sonstiges Buchbeiträge Bücher alle Jahre 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2009 2008 2007 2004 2003 2001 2000 Zurücksetzen Konferenzbeiträge Kaufmann, M.; Seidel, A.; Wicht, B. (2020): Long, Short, Monolithic-The Gate Loop Challenge for GaN Drivers, IEEE Custom Integrated Circuits Conference (CICC) DOI: 10.1109/CICC48029.2020.9075937 Rindfleisch, C.; Wicht, B. (2020): A One-Step 325V to 3.3-to-10V 0.5W Resonant DC-DC Converter with Fully Integrated Power Stage and 80.7% Efficiency, 2020 IEEE International Solid- State Circuits Conference - (ISSCC) DOI: 10.1109/ISSCC19947.2020.9063150 Kaufmann, M.; Lueders, M.; Cetin, K.; Wicht, B. (2020): A Monolithic E-Mode GaN 15W 400V Offline Self-Supplied Hysteretic Buck Converter with 95.6% Efficiency, 2020 IEEE International Solid- State Circuits Conference - (ISSCC) DOI: 10.1109/ISSCC19947.2020.9063102 Wicht, B. (2020): Analog Building Blocks of DC-DC Converters, 2020 IEEE International Solid- State Circuits Conference - (ISSCC) DOI: 10.1109/ISSCC19947.2020.9062975 Renz., P.; Deneke, N.; Wicht, B. (2020): Dynamic Modeling and Control of a Resonant Switched-Capacitor Converter with Switch Conductance Regulation, IEEE 21st Workshop on Control and Modeling for Power Electronics (COMPEL) DOI: 10.1109/COMPEL49091.2020.9265644 ISSN: 1093-5142 Chae, Y.; Wicht, B.; Verbruggen, B.; Heydari, P.; Luong, H. (2019): Introduction to the Special Issue on the 2019 IEEE International Solid-State Circuits Conference (ISSCC), IEEE Journal of Solid-State Circuits ( Volume: 54 , Issue: 12 , Dec. 2019 ) DOI: 10.1109/JSSC.2019.2946496 Olorunfemi Ojo, J. (2019): Best Papers and Star Associate Editors (2018), IEEE Journal of Emerging and Selected Topics in Power Electronics ( Volume: 7 , Issue: 4 , Dec. 2019 ) DOI: 10.1109/JESTPE.2019.2943771 Renz, P.; Kaufmann, M.; Lueders, M.; Wicht, B. (2019): A 3-Ratio 85% Efficient Resonant SC Converter With On-Chip Coil for Li-Ion Battery Operation, IEEE Solid-State Circuits Letters ( Volume: 2 , Issue: 11 , Nov. 2019 ) DOI: 10.1109/LSSC.2019.2927131 Kiesel, S.; Kern, T.; Wicht, B.; Graeb, H. (2019): A 30 ns 16 Mb 2 b/cell Embedded Flash with Ramped Gate Time-Domain Sensing Scheme for Automotive Application, 2019 International Symposium on VLSI Design, Automation and Test (VLSI-DAT) DOI: 10.1109/VLSI-DAT.2019.8741536 Funk, T.; Groeger, J.; Wicht, B. (2019): An Integrated and Galvanically Isolated DC-to-15.3 MHz Hybrid Current Sensor, 2019 IEEE Applied Power Electronics Conference and Exposition (APEC) DOI: 10.1109/APEC.2019.8722098 Quenzer-Hohmuth, S.; Messner, J.; Ritzmann, S.; Rosahl, T.; Wicht, B. (2019): Accelerated Low Gate Count Parameter Identification for Integrated Switched-Mode Power Supplies with Digital Control, 2019 IEEE Applied Power Electronics Conference and Exposition (APEC) DOI: 10.1109/APEC.2019.8722002 Renz, P.; Kaufmann, M.; Lueders, M.; Wicht, B. (2019): A Fully Integrated 85%-Peak-Efficiency Hybrid Multi Ratio Resonant DC-DC Converter with 3.0-to-4.5V Input and 500μA -to-120mA Load Range, 2019 IEEE International Solid- State Circuits Conference - (ISSCC) DOI: 10.1109/ISSCC.2019.8662491 Seidel, A.; Wicht, B. (2018): Integrated Gate Drivers Based on High-Voltage Energy Storing for GaN Transistors, IEEE Journal of Solid-State Circuits ( Volume: 53 , Issue: 12 , Dec. 2018 ) DOI: 10.1109/JSSC.2018.2866948 Lutz, D.; Seidel, A.; Wicht, B. (2018): A 50V, 1.45ns, 4.1pJ High-Speed Low-Power Level Shifter for High-Voltage DCDC Converters, ESSCIRC 2018 - IEEE 44th European Solid State Circuits Conference (ESSCIRC) DOI: 10.1109/ESSCIRC.2018.8494292 Quenzer-Hohmuth, S.; Ritzmann, S.; Rosahl, T.; Wicht, B. (2018): A Boost Converter with 3-6V Input and Fast Transient Digital Control Comprising a 90 ns-Latency Live-Tracking Window ADC, ESSCIRC 2018 - IEEE 44th European Solid State Circuits Conference (ESSCIRC) DOI: 10.1109/ESSCIRC.2018.8494242 Wittmann, J.; Funk, T.; Rosahl, T.; Wicht, B. (2018): A 48-V Wide- Vin 9–25-MHz Resonant DC–DC Converter, IEEE Journal of Solid-State Circuits ( Volume: 53 , Issue: 7 , July 2018 ) DOI: 10.1109/JSSC.2018.2827953 Funk, T.; Wicht, B. (2018): A fully integrated DC to 75 MHz current sensing circuit with on-chip Rogowski coil, 2018 IEEE Custom Integrated Circuits Conference (CICC) DOI: 10.1109/CICC.2018.8357028 Quenzer-Hohmuth, S.; Ritzmann, S.; Rosahl, T.; Wicht, B. (2018): ΔV/Δt-intervention control concept for improved transient response in digitally controlled boost converters, 2018 IEEE Applied Power Electronics Conference and Exposition (APEC) DOI: 10.1109/APEC.2018.8341029 Santoro, F.; Kuhn, R.; Gibson, N.; Rasera, N.; Tost, T.; Graeb, H.; Wicht, B.; Brederlow, R. (2018): A Hysteretic Buck Converter With 92.1% Maximum Efficiency Designed for Ultra-Low Power and Fast Wake-Up SoC Applications, IEEE Journal of Solid-State Circuits ( Volume: 53 , Issue: 6 , June 2018 ) DOI: 10.1109/JSSC.2018.2799964 Thomsen, A.; Wicht, B.; Harpe, P.; Kay Law, M.; Cheol Chae, Y. (2018): Advances in energy efficient analog design, 2018 IEEE International Solid - State Circuits Conference - (ISSCC) DOI: 10.1109/ISSCC.2018.8310408 Seidel, A.; Wicht, B. (2018): A fully integrated three-level 11.6nC gate driver supporting GaN gate injection transistors, 2018 IEEE International Solid - State Circuits Conference - (ISSCC) DOI: 10.1109/ISSCC.2018.8310345 Lutz, D.; Renz, P.; Wicht, B. (2018): An Integrated 3-mW 120/230-V AC Mains Micropower Supply, IEEE Journal of Emerging and Selected Topics in Power Electronics ( Volume: 6 , Issue: 2 , June 2018 ) DOI: 10.1109/JESTPE.2018.2798504 Wittmann, J.; Funk, T.; Rosahl, T.; Wicht, B. (2017): A 12–48 V wide-vin 9–15 MHz soft-switching controlled resonant DCDC converter, ESSCIRC 2017 - 43rd IEEE European Solid State Circuits Conference DOI: 10.1109/ESSCIRC.2017.8094597 Kiesel, S.; Kern, T.; Wicht, B. (2017): Time-domain ramped gate sensing for embedded multi-level flash in automotive applications, 2017 IEEE 60th International Midwest Symposium on Circuits and Systems (MWSCAS) DOI: 10.1109/MWSCAS.2017.8053017 Groeger, J.; Wicht, B.; Norling, K. (2017): Dynamic stability of a closed-loop gate driver enabling digitally controlled slope shaping, 2017 13th Conference on Ph.D. Research in Microelectronics and Electronics (PRIME) DOI: 10.1109/PRIME.2017.7974107 Groeger, J.; Schindler, A.; Wicht, B.; Norling, K. (2017): Optimized dv/dt, di/dt sensing for a digitally controlled slope shaping gate driver, 2017 IEEE Applied Power Electronics Conference and Exposition (APEC) DOI: 10.1109/APEC.2017.7931209 Schindler, A.; Koeppl, B.; Wicht, B.; Groeger, J. (2017): 10ns Variable current gate driver with control loop for optimized gate current timing and level control for in-transition slope shaping, 2017 IEEE Applied Power Electronics Conference and Exposition (APEC) DOI: 10.1109/APEC.2017.7931210 Seidel, A.; Wicht, B. (2017): A 1.3A gate driver for GaN with fully integrated gate charge buffer capacitor delivering 11nC enabled by high-voltage energy storing, 2017 IEEE International Solid-State Circuits Conference (ISSCC) DOI: 10.1109/ISSCC.2017.7870446 Renz, P.; Lamprecht, P.; Teufel, D.; Wicht, B. (2017): A 40V current sensing circuit with fast on/off transition for high-voltage power management, 2016 IEEE 59th International Midwest Symposium on Circuits and Systems (MWSCAS) DOI: 10.1109/MWSCAS.2016.7870011 Hackel, J.; Seidel, A.; Wittmann, J.; Wicht, B. (2016): Capacitive Gate Drive Signal Transmission with Transient Immunity up to 300 V/ns, ANALOG 2016; 15. ITG/GMM-Symposium ISBN: 016 978-3-8007-4265-3 Schindler, A.; Koeppl, B.; Pottbaecker, A.; Zannoth, M.; Wicht, B. (2016): Gate driver with 10 / 15ns in-transition variable drive current and 60% reduced current dip, ESSCIRC Conference 2016: 42nd European Solid-State Circuits Conference DOI: 10.1109/ESSCIRC.2016.7598308 Lutz, D.; Renz, P.; Wicht, B. (2016): A 120/230 Vrms-to-3.3V micro power supply with a fully integrated 17V SC DCDC converter, ESSCIRC Conference 2016: 42nd European Solid-State Circuits Conference DOI: 10.1109/ESSCIRC.2016.7598338 Rindfleisch, C.; Wicht, B. (2016): Efficiency impact of air-cored inductors in multi-MHz power converters, 2016 18th European Conference on Power Electronics and Applications (EPE'16 ECCE Europe) DOI: 10.1109/EPE.2016.7695433 Quenzer-Hohmuth, S.; Ritzmann, S.; Rosahl, T.; Wicht, B. (2016): Boost converter with load dependent adaptive controller for improved transient response, 2016 12th Conference on Ph.D. Research in Microelectronics and Electronics (PRIME) DOI: 10.1109/PRIME.2016.7519468 Wittmann, J.; Barner, A.; Rosahl, T.; Wicht, B. (2016): An 18 V Input 10 MHz Buck Converter With 125 ps Mixed-Signal Dead Time Control, IEEE Journal of Solid-State Circuits ( Volume: 51 , Issue: 7 , July 2016 ) DOI: 10.1109/JSSC.2016.2550498 Barner, A.; Wittmann, J.; Rosahl, T.; Wicht, B. (2016): A 10 MHz, 48-to-5V synchronous converter with dead time enabled 125 ps resolution zero-voltage switching, 2016 IEEE Applied Power Electronics Conference and Exposition (APEC) DOI: 10.1109/APEC.2016.7467859 Lutz, D.; Renz, P.; Wicht, B. (2016): A 10mW fully integrated 2-to-13V-input buck-boost SC converter with 81.5% peak efficiency, 2016 IEEE International Solid-State Circuits Conference (ISSCC) DOI: 10.1109/ISSCC.2016.7417988 Schindler, A.; K",
  "content_length": 41418,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:38"
}