{
  "name": "Bernardo David",
  "homepage": "http://www.bmdavid.com",
  "status": "success",
  "content": "Bernardo's Homepage Bernardo David Email me: bernardo at bmdavid.com About Me I am an Associate Professor at the IT University of Copenhagen (ITU) and a member of the Center for Information Security and Trust. From 2017 to 2018 I was an Assistant Professor at the Tokyo Institute of Technology. I hold a Ph.D. in Computer Science from Aarhus University obtained under the supervision of Ivan Damgård and Jesper Buus Nielsen. I have also been a long term visitor at the NTT Secure Plaftorm Laboratories and at the Bar Ilan University Cryptography Group. I also consult on industry projects, currently serving as Scientific Advisor to Concordium. →Download my full CV My Research I'm interested in a broad range of topics in cryptography and information theory. Currrently, my focus is on theoretical and practical aspects of secure multiparty computation and blockchains, as well as the interplay between these topics. I aim at both understanding the fundamental asymptotic limits of cryptographic protocols and at constructing efficient protocols for privacy preserving applications (e.g. on blockchains). My work is supported by Concordium Foundation, Danmarks Frie Forskningsfond (DFF) and Protocol Labs, among others. →My Google Scholar Profile and my DBLP News 10/08/2023 - I am currently looking for a talented PhD student interested in Multiparty Computation (MPC), zero knowledge, differential privacy, blockchains, or the intersection of these topics. Please see the official call. 15/01/2023 - Together with partners from Aarhus University, Monash University, University of Brasilia and University of Washington, I have received a grant from the Global Innovation Network Program of the Danish Ministry of Higher Education and Science for our project \"Privacy Preserving Solutions for Network Security\"! Publications You can also find an up-to-date list of my publications at my DBLP or Google Scholar Profile. Conference Papers James Hsin-yu Chiang, Bernardo David, Ittay Eyal, Tiantian Gong. FairPoS: Input Fairness in Proof-of-Stake with Adaptive Security. AFT 2023. James Hsin-yu Chiang, Bernardo David, Mariana Gama, Christian Janos Lebeda. Correlated-Output-Differential-Privacy and Applications to Dark Pools. AFT 2023. Carsten Baum, James Hsin-yu Chiang, Bernardo David, Tore Kasper Frederiksen. SoK: Privacy-Enhancing Technologies in Finance. AFT 2023. Bernardo David, Yuval Ishai, Anders Konring, Eyal Kushilevitz, Varun Narayanan: Perfect MPC over Layered Graphs. CRYPTO 2023. Joakim Brorsson, Bernardo David, Lorenzo Gentile, Elena Pagnin, Paul Stankovski Wagner. PAPR: Publicly Auditable Privacy Revocation for Anonymous Credentials. CT-RSA 2023. Ignacio Cascudo, Bernardo David, Omer Shlomovits, Denis Varlakov. Mt. Random: Multi-tiered Randomness Beacons. ACNS 2023. Carsten Baum, Bernardo David, Rafael Dowsley, Ravi Kishore, Jesper Buus Nielsen, Sabine Oechsner. CRAFT: Composable Randomness Beacons and Output-Independent Abort MPC From Time. PKC 2023. Carsten Baum, James Hsin-yu Chiang, Bernardo David, Tore Kasper Frederiksen: Eagle: Efficient Privacy Preserving Smart Contracts. Financial Cryptography 2023. Steven Golob, Sikha Pentyala, Rafael Dowsley, Bernardo David, Mario Larangeira, Martine De Cock, Anderson Nascimento. A Decentralized Information Marketplace Preserving Input and Output Privacy. ACM 2nd Data Economy Workshop Co-Located with ACM SIGMOD 2023. Ignacio Cascudo, Bernardo David, Lydia Garms, Anders Konring. YOLO YOSO: Fast and Simple Encryption and Secret Sharing in the YOSO Model. ASIACRYPT 2022. Matteo Campanelli, Bernardo David, Hamidreza Khoshakhlagh, Anders Konring, Jesper Buus Nielsen. Encryption to the Future: A Paradigm for Sending Secret Messages to Future (Anonymous) Committees. ASIACRYPT 2022. Carsten Baum, Bernardo David, Rafael Dowsley. A Framework for Universally Composable Publicly Verifiable Cryptographic Protocols. ProvSec 2022. Bernardo David, Bernardo Magri, Christian Matt, Jesper Buus Nielsen, Daniel Tschudi. GearBox. An Efficient UC Sharded Ledger Leveraging the Safety-Liveness Dichotomy. CCS 2022. Carsten Baum, James Hsin-yu Chiang, Bernardo David, Tore Kasper Frederiksen, Lorenzo Gentile. SoK: Mitigation of Front-running in Decentralized Finance. 2nd Workshop on Decentralized Finance, Financial Cryptography 2022. Bernardo David, Lorenzo Gentile, Mohsen Pourpouneh. FAST: Fair Auctions via Secret Transactions. ACNS 2022. Carsten Baum, Bernardo David, Tore Frederiksen. P2DEX: Privacy-Preserving Decentralized Cryptocurrency Exchange. ACNS 2021. Carsten Baum, Bernardo David, Rafael Dowsley, Jesper Buus Nielsen, Sabine Oechsner. TARDIS: A Foundation of Time-Lock Puzzles in UC. EUROCRYPT 2021 Ignacio Cascudo, Bernardo David. ALBATROSS: Publicly AttestabLe BATched Randomness Based On Secret Sharing. ASIACRYPT 2020 Bernardo David, Rafael Dowsley. Efficient Composable Oblivious Transfer from CDH in the Global Random Oracle Model. In: CANS 2020 Carsten Baum, Bernardo David, Rafael Dowsley. Insured MPC: Efficient Secure Multiparty Computation with Punishable Abort. In: Financial Cryptography 2020 Ignacio Cascudo, Ivan Damgård, Bernardo David, Nico Döttling, Rafael Dowsley, Irene Giacomelli. Efficient UC Commitment Extension with Homomorphism for Free (and Applications) In: Asiacrypt 2019. Bernardo David, Rafael Dowsley, Mario Larangeira: ROYALE: A Framework for Universally Composable Card Games with Financial Rewards and Penalties Enforcement. In: Financial Cryptography 2019 Bernardo David, Rafael Dowsley, Mario Larangeira: 21 - Bringing Down the Complexity: Fast Composable Protocols for Card Games Without Secret State. ACISP 2018 Bernardo David, Rafael Dowsley, Mario Larangeira: MARS: Monetized Ad-hoc Routing System (A Position Paper). In: CRYBLOCK@MobiSys 2018 Bernardo David, Peter Gazi, Aggelos Kiayias, Alexander Russel: Ouroboros Praos: An adaptively-secure, semi-synchronous proof-of-stake protocol. In: Eurocrypt 2018 Bernardo David, Rafael Dowsley, Mario Larangeira: Kaleidoscope: An Efficient Poker Protocol with Payment Distribution and Penalty Enforcement. In: Financial Cryptography 2018 Aggelos Kiayias, Alexander Russel, Bernardo David, Roman Oliynykov: Ouroboros: A Provably Secure Proof-of-Stake Blockchain Protocol. In: Crypto 2017 Ignacio Cascudo, Bernardo David: SCRAPE: Scalable Randomness Attested by Public Entities. In: ACNS 2017. Ignacio Cascudo, Ivan Damgård, Bernardo David, Nico Döttling, Jesper Buus Nielsen: Rate-1, Linear Time and Additively Homomorphic UC Commitments. In: Crypto 2016. Bernardo David, Rafael Dowsley, Raj Katti, and Anderson C. A. Nascimento: Efficient Unconditionally Secure Comparison and Privacy Preserving Machine Learning Classification Protocols. In: Provsec 2015. Bernardo David, Ryo Nishimaki, Samuel Ranellucci, Alain Tapp: Generalizing Efficient Multiparty Computation. In: ICITS 2015. Ignacio Cascudo, Ivan Damgård, Bernardo David, Irene Giacomelli, Jesper Buus Nielsen, Roberto Trifiletti: Additively Homomorphic UC commitments with Optimal Amortized Overhead. In: PKC 2015. Ivan Damgård, Bernardo David, Irene Giacomelli, Jesper Buus Nielsen: Compact VSS and Efficient Homomorphic UC Commitments. In: Asiacrypt 2014. Bernardo David, Rafael Dowsley, Anderson C. A. Nascimento: Universally Composable Oblivious Transfer based on a variant of LPN. In: CANS 2014. Masayuki Abe, Bernardo David, Markulf Kohlweiss, Ryo Nishimaki, Miyako Ohkubo: Tagged One-Time Signatures: Tight Security and Optimal Tag Size. In: PKC 2013. Masayuki Abe; Melissa Chase; Bernardo David; Markulf Kohlweiss; Miyako Okhubo; Ryo Nishimaki. Constant-Size Structure Preserving Signatures: Generic Constructions and Simple Assumptions. In: Asiacrypt 2012. Adriana Pinto; Bernardo David; Anderson C. A. Nascimento; Jeroen Van de Graaf. Universally Composable Committed Oblivious Transfer with a Trusted Initializer. In: SBSEG 2012. (Best Paper Award) Bernardo David ; Anderson C. A. Nascimento; Joern Mueller-Quade. Universally Composable Oblivious Transfer From Lossy Encryption And The McEliece Assumptions. IN: ICITS 2012. Bernardo David ; Anderson C. A. Nascimento . Efficient fully simulatable oblivious transfer from the McEliece assumptions. In: IEEE Information Theory Workshop (ITW), 2011. QUELHO, R. T. M. ; Bernardo David ; Alves, V. M. . Universally Composable Private Proximity Testing. In: Provsec 2011. Bernardo David ; QUELHO, R. T. M. ; Anderson C. A. Nascimento . Obtaining Efficient Fully Simulatable Oblivious Transfer from General Assumptions. In: SBSEG 2011. Journal Papers Masayuki Abe, Melissa Chase, Bernardo David, Markulf Kohlweiss, Ryo Nishimaki, Miyako Ohkubo. Constant-Size Structure-Preserving Signatures: Generic Constructions and Simple Assumptions. In: Journal of Cryptology (2015). Bernardo David, Rafael Dowsley, Jeroen van de Graaf, Davidson Marques, Anderson C. A. Nascimento, Adriana C. B. Pinto. Unconditionally Secure, Universally Composable Privacy Preserving Linear Algebra. In: IEEE Transactions on Information Forensics and Security (2015). Bernardo David; Anderson C. A. Nascimento. Fully Simulatable Oblivious Transfer Based on The McEliece Assumptions. In: IEICE Transactions 95-A(11): 2059-2066 (2012) Network Security Bernardo David ; Anderson C. A. Nascimento ; QUELHO, R. T. M. ; Rafael Timoteo de Sousa Junior . A framework for secure single sign-on. In: Workshop de Gestao de Identidades Digitais, SBSEG 2012. Bernardo David; da Costa, J. P. C. L. ; Amaral, D. ; Rafael Timoteo de Sousa Junior ; FREITAS, E. P. ; SERRANO, A. M. R. . Improved Blind Automatic Malicious Activity Detection in Honeypot Data. In: ICoFCS 2012. (Best Paper Award) Holtz, M. D. ; Bernardo David ; Sousa Jr., R. T. . An architecture for distributed Network Intrusion Detection based on the Map-Reduce Framework. In: IWT 2011. Bernardo David ; da Costa, J. P. C. L. ; Anderson C. A. Nascimento ; Holtz, M. D. ; Amaral, D. ; Sousa Jr., R. T. . Blind Automatic Malicious Activity Detection in Honeypot Data. In: ICoFCS 2011. Bernardo Dav",
  "content_length": 18169,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:16"
}