{
  "name": "Bernard Ries",
  "homepage": "https://www.unifr.ch/inf/dsor/en/group/people/185432/ecfa2",
  "status": "success",
  "content": "Bernard Ries | Decision Support & Operations Research Group | Université de Fribourg Bernard Ries bernard.ries@unifr.ch +41 26 300 8333 https://orcid.org/0000-0003-4395-5547 Vice-Rector, Rectorate PER 21 bu. C324Bd de Pérolles 901700 Fribourg PER 21, C324 +41 26 300 8333 Professor, Department of Informatics PER 21 bu. C324Bd de Pérolles 901700 Fribourg PER 21, C324 +41 26 300 8333 International Relations Digitalisation Interdisciplinarity Combinatorial optimization Structural and algorithmic graph theory Mathematical Modeling Computational complexity Biography Biography: In 2007, I received my PhD in mathematics from Ecole Polytechnique Fédérale de Lausanne(CH). From 2008 to 2009, I was a Postdoctoral Research Fellow at Columbia University (US) in the Department of Industrial Engineering and Operations Research. In 2009-2010, I was appointed as Assistant Professor at the University of Warwick (UK) in the Center for Discrete Mathematics and its Applications (DIMAP) and the Warwick Business School (WBS). From September 2010 to July 2015, I was an Associate Professor at the Université Paris Dauphine (F) in the Computer Science and Mathematics Department. Currently I am a Professor at the University of Fribourg (CH), where I am heading the Decision Support & Operations Research Group together with Marino Widmer in the Department of Informatics. In 2022, I joined the Smart Living Lab project with some members of my team. My main research interests are: Structural and algorithmic graph theory Combinatorial optimization Computational complexity Mathematical Modeling Phd Students: Nathanael Barrot: 2012 - 2015 (currently postdoc at RIKEN Research Center in Japan) (co-supervisor: Jérôme Lang (Université Paris Dauphine)) Esther Galby: 2015 - 2020 (currently Assistant professor at Chalmers University of Technology, Sweden) Vera Fischer: 2018 - 2023 (co-supervision with Meritxell Pacheco, currently at La Poste) Felix Mann: 2019 - Felicia Lucke: 2020 - 2024 Narmina Baghirova: 2020 - (co-supervision with David Schindl) Elise Bangerter: 2023 - (co-supervision with Meritxell Pacheco) Visiting PhD students: Zakir Deniz (2017, Duzce University (Turkey)) Pierre Hauweele (2018, Université de Mons (Belgium)) Paloma Thomé de Lima (2018, University of Bergen (Norway)) Carolina Goncalvez (20021, 2022, University of Buenos Aires (Argentina)) Member of PhD committees: Grégoire Cotté, Conservatoire National des Arts et Métiers, Paris, France (2016) Vasileios Papapanagiotu, Università della Svizzera Italiana, Lugano, Switzerland (2018) Gauvain Devillez, Université de Mons, Belgium (2022) Nikolaos Melissinos, Université Paris Dauphine PSL, France (2022) Valentin Bouquet, Conservatoire National des Arts et Métiers, Paris, France (2022) Postdocs: Diana Sasaki: 2014 - 2015 (now Professor at Universidade do Estado do Rio de Janeiro (Brazil)) Maria Pia Mazzoleni: August 2017 (now Docencia at Universidad Nacional La Plata (Argentina)) Andrea Munaro: February - June 2018 (now Assistant Professor at University of Parma (Italy)) Zakir Deniz: September - December 2019 Meritxell Pacheco: January 2021 - August 2021 (now Senior Researcher and Lecturer at University of Fribourg (CH)) Jérôme De Boeck: March 2022 - August 2023 (now Assistant Professor at HEC Liège, Belgium) Nour Elhouda Tellache: 2024 - Research and publications Publications 137 publications 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 2005 Matching Cuts in Graphs of High Girth and H-Free Graphs Carl Feghali, Felicia Lucke, Daniël Paulusma, Bernard Ries, Algorithmica\t(2025) | Journal article Finding k-community structures in special graph classes Narmina Baghirova, Clément Dallard, Bernard Ries, David Schindl, Discrete Applied Mathematics\t(2024) | Journal article Dichotomies for Maximum Matching Cut: H-freeness, bounded diameter, bounded radius Felicia Lucke, Daniël Paulusma, Bernard Ries, Theoretical Computer Science\t(2024) | Journal article On blockers and transversals of maximum independent sets in co-comparability graphs Felicia Lucke, Bernard Ries, Discrete Applied Mathematics\t(2024) | Journal article Finding Matching Cuts in H-Free Graphs Felicia Lucke, Daniël Paulusma, Bernard Ries, Algorithmica\t(2023) | Journal article Using edge contractions to reduce the semitotal domination number Galby, E. and Lima, P.T. and Mann, F. and Ries, B., Theoretical Computer Science\t(2023) | Journal article Dichotomies for Maximum Matching Cut: H-Freeness, Bounded Diameter, Bounded Radius Lucke, F. and Paulusma, D. and Ries, B. , arXiv\t(2023) | Other Finding k-community structures in special graph classes Baghirova, N. and Dallard, C. and Ries, B. and Schindl, D. , Research Square\t(2023) | Other Dichotomies for Maximum Matching Cut: H-Freeness, Bounded Diameter, Bounded Radius Lucke, F. and Paulusma, D. and Ries, B., Leibniz International Proceedings in Informatics, LIPIcs: (2023) | Conference Preface Paulusma, D. and Ries, B. (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 2023) | Book Dichotomies for Maximum Matching Cut: H-Freeness, Bounded Diameter, Bounded Radius Lucke, F. and Paulusma, D. and Ries, B. , arXiv\t(2023) | Other Matching Cuts in Graphs of High Girth and H-Free Graphs Feghali, Carl and Lucke, Felicia and Paulusma, Daniël and Ries, Bernard, Schloss Dagstuhl – Leibniz-Zentrum für Informatik (2023) | Conference On some special classes of contact B0-VPG graphs Bonomo-Braberman, F. and Mazzoleni, M.P. and Rean, M.L. and Ries, B., Discrete Applied Mathematics\t(2022) | Journal article On The Complexity of Matching Cut for Graphs of Bounded Radius and H-Free Graphs Lucke, F. and Paulusma, D. and Ries, B. , arXiv\t(2022) | Other FINDING K-COMMUNITY STRUCTURES IN SPECIAL GRAPH CLASSES Baghirova, N. and Dallard, C. and Ries, B. and Schindl, D. , arXiv\t(2022) | Other LOCALLY CHECKABLE PROBLEMS PARAMETERIZED BY CLIQUE-WIDTH Baghirova, N. and Gonzalez, C.L. and Ries, B. and Schindl, D. , arXiv\t(2022) | Other Finding Matching Cuts in H-Free Graphs Lucke, F. and Paulusma, D. and Ries, B. , arXiv\t(2022) | Other Matching Cuts in Graphs of High Girth and H-Free Graphs Feghali, C. and Lucke, F. and Paulusma, D. and Ries, B. , arXiv\t(2022) | Other Finding Matching Cuts in H-Free Graphs Lucke, F. and Paulusma, D. and Ries, B., Leibniz International Proceedings in Informatics, LIPIcs: (2022) | Conference On The Complexity of Matching Cut for Graphs of Bounded Radius and H-Free Graphs Lucke, F. and Paulusma, D. and Ries, B. , arXiv\t(2022) | Other On the complexity of matching cut for graphs of bounded radius and H-free graphs Lucke, F. and Paulusma, D. and Ries, B., Theoretical Computer Science\t(2022) | Journal article Locally Checkable Problems Parameterized by Clique-Width Baghirova, N. and Gonzalez, C.L. and Ries, B. and Schindl, D., Leibniz International Proceedings in Informatics, LIPIcs: (2022) | Conference Matching Cuts in Graphs of High Girth and H-Free Graphs Feghali, C. and Lucke, F. and Paulusma, D. and Ries, B. , arXiv\t(2022) | Other CPG graphs: Some structural and hardness results Nicolas Champseix and Esther Galby and Andrea Munaro and Bernard Ries, Discrete Applied Mathematics\t(2021) | Journal article Using edge contractions to reduce the semitotal domination number Galby, E. and Lima, P.T. and Mann, F. and Ries, B. , arXiv\t(2021) | Other Reducing the domination number of (P3+kP2)-free graphs via one edge contraction Galby, E. and Mann, F. and Ries, B., Discrete Applied Mathematics\t(2021) | Journal article Reducing the domination number of graphs via edge contractions and vertex deletions Galby, E. and Lima, P.T. and Ries, B., Discrete Mathematics\t(2021) | Journal article Blocking total dominating sets via edge contractions Galby, E. and Mann, F. and Ries, B., Theoretical Computer Science\t(2021) | Journal article New progress in combinatorial optimization Chen, B. and Martello, S. and Ries, B., Discrete Applied Mathematics\t(2021) | Journal article Using edge contractions to reduce the semitotal domination number Galby, E. and Lima, P.T. and Mann, F. and Ries, B. , arXiv\t(2021) | Other Semitotal Domination: New hardness results and a polynomial-time algorithm for graphs of bounded mim-width Galby, E. and Munaro, A. and Ries, B., Theoretical Computer Science\t(2020) | Journal article Blocking total dominating sets via edge contractions Galby, E. and Mann, F. and Ries, B. , arXiv\t(2020) | Other On Some Subclasses of Split B<sub>1</sub> -EPG Graphs Deniz, Z. and Nivelle, S. and Ries, B. and Schindl, D. (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 2020) | Book Blocking total dominating sets via edge contractions Galby, E. and Mann, F. and Ries, B. , arXiv\t(2020) | Other Critical vertices and edges in H-free graphs Paulusma, D. and Picouleau, C. and Ries, B., Discrete Applied Mathematics\t(2019) | Journal article Detecting strong cliques Hujdurovi?, A. and Milani?, M. and Ries, B., Discrete Mathematics\t(2019) | Journal article Classifying k-edge colouring for H-free graphs Galby, E. and Lima, P.T. and Paulusma, D. and Ries, B., Information Processing Letters\t(2019) | Journal article Preface: Tenth International Colloquium on Graphs and Optimization (GO X), 2016 Crama, Y. and Gendron, B. and Ries, B., Discrete Applied Mathematics\t(2019) | Journal article Proper circular arc graphs as intersection graphs of pathson a grid Galby, E. and Mazzoleni, M.P. and Ries, B., Discrete Applied Mathematics\t(2019) | Journal article Blocking dominating sets for H-free graphs via edge contractions Galby, E. and Lima, P.T. and Ries, B., Leibniz International Proceedings in Informatics, LIPIcs: (2019) | Conference Reducing the domination number of graphs via edge contractions Galby, E. and Lima, P.T. and Ries, B., Leibniz International Proceedings in Informatics, LIPIcs: (2019) | Conference Maxim",
  "content_length": 30249,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:16"
}