{
  "name": "Bernd Hellingrath",
  "homepage": "https://www.wi.uni-muenster.de/de/institut/logistik/personen/bernd-hellingrath",
  "status": "success",
  "content": "Prof. Dr.-Ing. Bernd Hellingrath | Institut für Wirtschaftsinformatik VCard QR-Code Prof. Dr.-Ing. Bernd Hellingrath Professor Lehrstuhl für Wirtschaftsinformatik und Logistik (Prof. Hellingrath) Leonardo Campus 3 48149 Münster Raum: 109Telefon: +49 251 83-38001Fax: +49 251 83-38009bernd.hellingrath@uni-muenster.dewww.wi.uni-muenster.de/logistikShort-URL: erc.is/p/hellingrath Über Publikationen Projekte Auszeichnungen Veranstaltungen Abschlussarbeitsbetreuung Forschungsschwerpunkte Einsatz von Informationssystemen in der Logistik Prozesskonzepte des kollaborativen Supply Chain Management Dezentrale Planungs- und Steuerungskonzepte im Supply Chain Management Ökologische Gestaltung, Planung und Steuerung der Logistik Methoden zur Gestaltung und Bewertung flexibler Supply Chains Akademische Ausbildung 2001 Promotion zum Doktor der Ingenieurwissenschaften am Fachbereich Maschinenbau der Technischen Universität Dortmund, Thema der Dissertationsschrift:\"Entscheidungsunterstützung für die Auftragsablaufplanung\" 1988 Abschluss des Studiums als Diplom-Informatiker 1980- 1988 Studium der Informatik und Mathematik an der Technischen Universität Dortmund Beruflicher Werdegang seit 2008 Universitätsprofessor (W3), Inhaber des Lehrstuhls für Wirtschaftsinformatik und Logistik im Institut für Wirtschaftsinformatik der Westfälischen Wilhelms-Universität Münster 2006- 2008 Universitätsprofessur (W2) für Wirtschaftsinformatik, insbesondere Planung und Modellierung von Produktions- und Logistiknetzen an der Universität Paderborn 1995- 2008 Leiter der Hauptabteilung \"Unternehmensmodellierung\" und Mitglied im Institutslenkungsausschuß (ILA) des Fraunhofer IML 1991- 1995 Leiter der Abteilung \"Modellierungsmethoden\" am Fraunhofer Institut Materialfluss und Logistik in Dortmund 1988- 1991 Wissenschaftlicher Mitarbeiter am Fraunhofer Institut Materialfluss und Logistik (IML) in Dortmund Mitgliedschaften und Aktivitäten in Gremien seit 1998 Gutachter für die Europäische Kommision, das Bundesministerium für Bildung und Forschung (BMBF) und das Bundesministerium für Wirtschaft und Technologie (BMWi)",
  "content_length": 2108,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:23"
}