{
  "name": "Bernard Wong 0001",
  "homepage": "https://cs.uwaterloo.ca/~bernard",
  "status": "success",
  "content": "Bernard Wong Bernard Wong Associate Professor Davis Center Room 3514 David R. Cheriton School of Computer Science University of Waterloo 200 University Ave. West Waterloo, ON N2L 3G1, Canada E-mail: bernard AT uwaterloo DOT ca Phone: (519) 888-4567 x31301 My research interests span distributed systems and networking, with particular emphasis on problems involving decentralized services, self-organizing networks, and distributed storage systems. Prospective students: I am currently seeking motivated graduate students who enjoy building large systems. More information about the School's graduate program requirements can be found here. Teaching Spring 2024 CS 854 Consensus Protocols and Blockchains Winter 2024 CS 350 Operating Systems Spring 2023 CS 854 Consensus Protocols and Blockchains Spring 2022 CS 854 Cloud and Serverless Computing Fall 2020 CS 456 Computer Networks Fall 2018 CS 350 Operating Systems Fall 2017 CS 350 Operating Systems Winter 2017 CS 350 Operating Systems Fall 2016 CS 854 Consensus Protocols Winter 2016 CS 350 Operating Systems Fall 2015 CS 350 Operating Systems Winter 2015 CS 854 Cloud Computing and Software-Defined Networking Fall 2014 CS 350 Operating Systems Spring 2014 CS 854 Cloud Computing and Software-Defined Networking Fall and Winter 2013 CS 343 Concurrent and Parallel Programming Fall 2012 CS 854 Cloud Computing & Management Winter 2012 CS 454/654 Distributed Systems Project Webpages CrossStitch An Efficient Transaction Processing Framework for Geo-Distributed Systems. EdgeCloud A Hybrid Edge-Cloud Architecture for Reducing On-Demand Gaming Latency. Nessie A Client-Driven, RDMA-Enabled Storage System. Microfuge Performance Isolation in Cloud-based Storage Systems. HyperDex A Distributed, Searchable Key-Value Store for Cloud Computing. Cubit Approximate Matching for Peer-to-Peer Overlays. Octant A Comprehensive Framework for Geolocalization on the Internet. Meridian A Lightweight Approach to Network Positioning. Publications Obtaining Accurate Bandwidth Estimations for the Internet of Things Sharon Choy and Bernard Wong. In Proceedings of the Conference on Cloud and Internet of Things (CIoT), Lisbon, Portugal, March 2023. Link to PDF Reducing the Cost of GPU Cold Starts in Serverless Deep Learning Inference Serving Justin San Juan and Bernard Wong. In Proceedings of the Workshop on Serverless Computing for Pervasive Cloud-Edge-Device Systems and Services (STARLESS), Atlanta, GA, March 2023. PDF Toward Reducing Cross-Shard Transaction Overhead in Sharded Blockchains. Liuyang Ren, Paul A. S. Ward, and Bernard Wong. In Proceedings of the ACM International Conference on Distributed and Event-based Systems (DEBS), Copenhagen, Denmark, June 2022. Best Student Paper Award. Link to PDF Natto: Providing Distributed Transaction Prioritization for High-Contention Workloads. Linguan Yang, Xinan Yan, and Bernard Wong. In Proceedings of the ACM SIGMOD International Conference on Management of Data, Philadelphia, PA, June 2022. PDF Antipaxos: Taking Interactive Consistency to the Next Level. Chunyu Mao, Wojciech M. Golab, and Bernard Wong. In Proceedings of the International Conference on Distributed Computing and Networking (ICDCN), Delhi, India, January 2022. Link to PDF Improving the Performance of Blockchain Sharding Protocols with Collaborative Transaction Verification. Liuyang Ren, Paul A. S. Ward, and Bernard Wong. In Proceedings of the IEEE Internationl Conference on Blockchain, Melbourne, Australia, December 2021. Link to PDF Domino: Using Network Measurements to Reduce State Machine Replication Latency in WANs. Xinan Yan, Linguan Yang, and Bernard Wong. In Proceedings of the International Conference on emerging Networking EXperiments and Technologies (CoNEXT), Barcelona, Spain, December 2020. PDF Fault Tolerant Service Function Chaining. Milad Ghaznavi, Elaheh Jalalpour, Bernard Wong, Raouf Boutaba, and Ali José Mashtizadeh. In Proceedings of the SIGCOMM Conference, New York, NY, August 2020. PDF Sift: Resource-Efficient Consensus with RDMA. Mikhail Kazhamiaka, Babar Memon, Chathura Kankanamge, Siddhartha Sahu, Sajjad Rizvi, Bernard Wong, and Khuzaima Daudjee. In Proceedings of the International Conference on emerging Networking EXperiments and Technologies (CoNEXT), Orlando, FL, December 2019. PDF SpecRPC: A General Framework for Performing Speculative Remote Procedure Calls. Xinan Yan, Arturo Pie Joa, Bernard Wong, Benjamin Cassell, Tyler Szepesi, Malek Naouach, and Disney Lam. In Proceedings of the ACM/IFIP/USENIX International Middleware Conference (Middleware), Rennes, France, December 2018. PDF RaMP: A Lightweight RDMA Abstraction for Loosely Coupled Applications. Babar Naveed Memon, Xiayue Charles Lin, Arshia Mufti, Arthur Scott Wesley, Tim Brecht, Kenneth Salem, Bernard Wong, and Benjamin Cassell. In Proceedings of the USENIX Workshop on Hot Topics in Cloud Computing (HotCloud), Boston, MA, July 2018. PDF Carousel: Low-Latency Transaction Processing for Globally-Distributed Data. Xinan Yan, Linguan Yang, Hongbo Zhang, Xiayue Charles Lin, Bernard Wong, Kenneth Salem, and Tim Brecht. In Proceedings of the ACM SIGMOD International Conference on Management of Data, Houston, TX, June 2018. PDF (Updated 6/2021) Disk Prefetching Mechanisms for Increasing HTTP Streaming Video Server Throughput. Benjamin Cassell, Tyler Szepesi, Jim Summers, Tim Brecht, Derek Eager, and Bernard Wong. In ACM Transactions on Modeling and Performance Evaluation of Computing Systems (TOMPECS). Volume 3, Issue 2, April 2018. PDF NetStore: Leveraging Network Optimizations to Improve Distributed Transaction Processing Performance. Xu Cui, Michael Mior, Bernard Wong, Khuzaima Daudjee, and Sajjad Rizvi. In Proceedings of the International Workshop on Active Middleware on Modern Hardware, Las Vegas, NV, December 2017. PDF Canopus: A Scalable and Massively Parallel Consensus Protocol. Sajjad Rizvi, Bernard Wong, and Srinivasan Keshav. In Proceedings of the International Conference on emerging Networking EXperiments and Technologies (CoNEXT), Seoul/Incheon, South Korea, December 2017. Best Paper Award Nominee. PDF/ Extended Technical Report/ Presentation Nessie: A Decoupled, Client-Driven Key-Value Store Using RDMA. Benjamin Cassell, Tyler Szepesi, Bernard Wong, Tim Brecht, Jonathan Ma, and Xiaoyi Liu. In IEEE Transactions on Parallel and Distributed Systems (TPDS), Volume 28, Issue 12, December 2017, doi.ieeecomputersociety.org/10.1109/TPDS.2017.2729545. PDF Using Libception to Understand and Improve HTTP Streaming Video Server Throughput. Tyler Szepesi, Ben Cassell, Tim Brecht, Derek Eager, Jim Summers, and Bernard Wong. In Proceedings of the International Conference on Performance Engineering (ICPE), L'Aquila, Italy, April 2017. PDF R3S: RDMA-based RDD Remote Storage for Spark. Xinan Yan, Bernard Wong, and Sharon Choy. In Proceedings of the International Workshop on Adaptive and Reflective Middleware (ARM), Trento, Italy, December 2016. PDF Mayflower: Improving Distributed Filesystem Performance Through SDN/Filesystem Co-Design. Sajjad Rizvi, Xi Li, Bernard Wong, Fiodar Kazhamiaka, and Benjamin Cassell. In Proceedings of the International Conference on Distributed Computing Systems (ICDCS), Nara, Japan, June 2016. PDF Understanding the Causes of Consistency Anomalies in Apache Cassandra. Hua Fan, Aditya Ramaraju, Marlon McKenzie, Wojciech Golab, and Bernard Wong. In Proceedings of the International Conference on Very Large Data Bases (VLDB), Kohala Coast, Hawaii, August 2015. PDF Towards Reconfigurable Rack-Scale Networking. Tyler Szepesi, Bernard Wong, Tim Brecht, and Sajjad Rizvi. In Proceedings of the Workshop on Rack-scale Computing (WRSC), Bordeaux, France, April 2015. PDF PRISM: Fine-Grained Resource-Aware Scheduling for MapReduce. Qi Zhang, Mohamed Faten Zhani, Yuke Yang, Raouf Boutaba, and Bernard Wong. In IEEE Transactions on Cloud Computing (TCC), Volume 3, Issue 2, January 2015. Link to PDF Latency Amplification: Characterizing the Impact of Web Page Content on Load Times. Catalin Avram, Kenneth Salem, and Bernard Wong. In Proceedings of the Workshop on Planetary-Scale Distributed Systems (W-PSDS), Nara, Japan, October 2014. Quartz: A New Design Element for Low-Latency DCNs. Yunpeng James Liu, Peter Xiang Gao, Bernard Wong, and Srinivasan Keshav. In Proceedings of the SIGCOMM Conference, Chicago, Illinois, August 2014. PDF Automated Control of Aggressive Prefetching for HTTP Streaming Video Servers. Jim Summers, Tim Brecht, Derek Eager, Tyler Szepesi, Ben Cassell, and Bernard Wong. In Proceedings of the International Systems and Storage Conference (SYSTOR), Haifa, Israel, June 2014. PDF MicroFuge: A Middleware Approach to Providing Performance Isolation in Cloud Storage Systems. Akshay K. Singh, Xu Cui, Benjamin Cassell, Bernard Wong, and Khuzaima Daudjee. In Proceedings of the International Conference on Distributed Computing Systems (ICDCS), Madrid, Spain, June 2014. PDF Designing A Low-Latency Cuckoo Hash Table for Write-Intensive Workloads Using RDMA. Tyler Szepesi, Bernard Wong, Benjamin Cassell, and Tim Brecht. In Proceedings of the Workshop on Rack-scale Computing (WRSC), Amsterdam, The Netherlands, April 2014. PDF Kronos: The Design and Implementation of an Event Ordering Service. Robert Escriva, Ayush Dubey, Bernard Wong, and Emin Gün Sirer. In Proceedings of the European Conference on Computer Systems (EuroSys), Amsterdam, The Netherlands, April 2014. PDF A Hybrid Edge-Cloud Architecture for Reducing On-Demand Gaming Latency. Sharon Choy, Bernard Wong, Gwendal Simon, and Catherine Rosenberg. In Springer's Multimedia Systems Journal (MMSJ) Special Issue on Network and Systems Support for Games, 2014, doi:10.1007/s00530-014-0367-z. Link to PDF Towards an Efficient Online Causal-Event-Pattern-Matching Framework. Sukanta Pramanik, David Taylor, and Bernard Wong. In Proceedings of the International Conference on Distributed Computing Systems (ICDCS), Philadelphia, Pennsylvania, July 2013. PDF MemR",
  "content_length": 16229,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:16"
}