{
  "name": "Berthold Klaus Paul Horn",
  "homepage": "http://people.csail.mit.edu/bkph",
  "status": "success",
  "content": "Berthold K.P. Horn Berthold K.P. Horn Professor of Computer Science and Engineering Computer Science and Artificial Intelligence Laboratory (CSAIL) Department of Electrical Engineering and Computer Science Massachusetts Institute of Technology Publications Awards Routes Courses Ideas Other: Quaternions: what are they, and why do we need to know? Tired of stop-and-go traffic and phantom traffic jams? — How to suppress traffic flow instabilities. Indoor equivalent of GPS? Overview: Fine Time Measurement (FTM) Round Trip Time (RTT) FTMRTT app for indoor localization using Wi-Fi access points (IEEE 802.11mc). WifiRttScanX app for finding FTM RTT responders and calibrating distance measurements Wish to improve cell phone reception? — How to install a cellular repeater. Want to learn more about cellular signals? — CellTracker app for Android. Where is cell phone coverage poor? — Distribution of femto cells as a proxy for poor service. Interested in weather data collection? — Crowd-sourcing urban air temperatures from smartphone battery temperatures “Absolute Orientation” third in list of top cited papers in the Journal of the Optical Society (JOSA A) Still using Y&Y TeX? Would you like to 'upgrade' to TeX 3.14159265? Download zip file of .exe and .dll Which pored mushroom is it? — Identifying boletes of the North East Hiking in the Ossipee Mountains? — Get the detailed map for your GPS Hiking on the Kapalua Resort Trails? — Get tracks for Google Earth or your GPS Some more random links... Some Knight Display hacks (PDP-10 ITS) re-created by Lars Brinkhoff. æè¿ (ORCID) Computer Science and Artificial Intelligence Laboratory Department of Electrical Engineering and Computer Science Massachusetts Institute of Technology Cambridge, MA 02139 bkph@ai.mit.edu Accessibility",
  "content_length": 1793,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:37"
}