{
  "name": "Bettina Rolke",
  "homepage": "https://fit.uni-tuebingen.de/Portfolio/Details?id=495",
  "status": "success",
  "content": "FIT - Portfolio PortfolioBettina Rolke Personendaten Akademischer Titel: Prof. Dr. Name: Bettina Rolke Einrichtungen: Mathematisch-Naturwissenschaftliche Fakultät Universität Tübingen Fachbereich Psychologie Mathematisch-Naturwissenschaftliche Fakultät URL: webpage Rolke Kontaktdaten E-Mail: bettina.rolke@uni-tuebingen.de Telefon: +49 7071 29-75638 Adresse: Universität Tübingen Fachbereich Psychologie Schleichstraße 4 72076 Tübingen Download vCard: für Outlook (ISO-8859-1) für alle anderen (UTF-8) Forschungsschwerpunkte Die Kognitionswissenschaft in Tübingen ist ein interdisziplinärer Studiengang. Ihm gehört der Arbeitsbereich Evolutionäre Kognition (Fachbereich Psychologie) und der Arbeitsbereich Kognitive Modellierung (Fachbereich Informatik) an. Weiterhin wird der Studiengang Kognitionswissenschaft durch Veranstaltungen aus der Informatik, Linguistik, Mathematik, Medizin, Neurobiologie, Philosophie und der Psychologie gebildet. Das gemeinsame Ziel der Kognitionswissenschaftler ist die Erforschung der Mechanismen, die den kognitiven Fähigkeiten von Organismen (z.B. Wahrnehmung, Motorik, Lernen, Gedächtnis, Problemlösen, Denken und Sprache) zugrunde liegen. So fragen wir beispielsweise, welche Form mentale Repräsentationen einnehmen,  welche Faktoren bestimmen, wie gut wahrgenommen und gelernt wird, welche verschiedenen Komponenten der Sprachverarbeitung es gibt, was „Bewusstsein“ ist,  welches die neuronalen Korrelate kognitiver Prozesse sind, und wie kognitive Prozesse mittels Computermodellen beschreibbar sind. Je nach Fachdisziplin werden unterschiedliche Aspekte dieses Untersuchungsgegenstandes näher beleuchtet und unterschiedliche Untersuchungsmethoden gewählt. Aufgrund der Interdisziplinarität eröffnet sich so ein umfassender Einblick in die Mechanismen kognitiver Fähigkeiten. Projekte Hirnkorrelate kontextabhängiger Sprachverarbeitung 2020 - 2023Bettina RolkeDeutsche Forschungsgemeinschaft e.V. (DFG) Wirkmechanismen der zeitlichen Vorbereitung im Kontext der Reizselektion 2018 - 2021Verena SeiboldDeutsche Forschungsgemeinschaft e.V. (DFG) Heisenbergprofessur 2010Bettina RolkeDeutsche Forschungsgemeinschaft e.V. (DFG) Mechanismen der zeitlichen Vorbereitung - Interaktion zeitlicher und räumlicher Vorbereitung 2006 - 2010Bettina RolkeDeutsche Forschungsgemeinschaft e.V. (DFG) Zeitdiskrimination unter Aufmerksamkeitseinfluss 2004 - 2010Bettina RolkeDeutsche Forschungsgemeinschaft e.V. (DFG) Ältere Projekte anzeigen Publikationen Hilfe wird permanent gelöscht. Dies kann nicht rückgängig gemacht werden.",
  "content_length": 2552,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:47"
}