{
  "name": "Bharat Jayaraman",
  "homepage": "https://www.cse.buffalo.edu/faculty/bharat",
  "status": "success",
  "content": "UB CSE Department: Bharat Jayaraman Dr. Bharat Jayaraman, Professor Emeritus Dr. Bharat Jayaraman, Professor Emeritus Department of Computer Science and Engineering University at Buffalo, The State University of New York 338 Davis Hall Buffalo, NY 14260-2500, U.S.A. Phone: (716) 645-4755 Fax: (716) 645-3464 Email: bharat at buffalo.edu Dr. Jayaraman received his bachelors and masters degrees from the Indian Institute of Technology, Madras, and his doctorate in Computer Science from the University of Utah. Prior to joining the University at Buffalo in 1989, he was on the faculty at the University of North Carolina. He also served as CSE Department Chair at the University at Buffalo during 2001-09. Dr. Jayaraman's research centers around programing languages and software systems. He has published over 100 scientific articles--see a selected or a detailed list of papers coauthored with his doctoral students and other collaborators. The research was supported by the National Science Foundation (NSF), Office of Naval Research (ONR), as well as the Fujitsu, IBM, and Xerox Foundations. Current projects include: (1) run-time visualization in a state-of-the-art execution environment for Java called JIVE; (2) program analysis and applications of temporal constrained objects, and constraint-based design; (3) logic languages with sets, constraints, and preferences; and (4) software verification and finite-state models. Recent Talks ``Subset-Logic Programming: a Declarative Approach to Sets,\" Programming with High-level Abstractions, December 2022. ``Model Extraction and Runtime Verification of Java-based UAV Controllers,\" ITD 2022: Conf. on Info. Technology in Defence, March 4-5, 2022 ``Three Rs of Smart Environments,\" Symposium on AI for Social Good, June 30, 2021 ``Runtime Visualization and Verification of Java Programs,\" Keynote Talk, Workshop on Applications of Formal Methods in Safety and Security (AFMSS 2016), May 25, 2016, Bangalore. ``Dynamic Analysis and Visualization of Programs,\" Indian Statistical Institute, Kolkata (March 2014), \"Formal Policy Language for Secure Cloud Configurations,\" Ambient Networks and Technologies (ANT 2012), August 2012 \"Spatio-Temporal Querying in Smart Spaces,\" Ambient Networks and Technologies (ANT 2012), August 2012 \"Pedagogic Tool for Computer Programming,\" given at International Conference on Technology Enhanced Education, January 2012 \"Query Based Debugging and Scalable Visualizations,\" given at Reliable Software Engineering group, Microsoft Research, May 2011 \"JIVE: Java Interactive Visualization Environment,\" given at Workshop on Program Verification, Testing, and Debugging, Sunnyvale, CA, June 2010. Recent Profesional Service Associate Editor, CSI Transactions on ICT, published by Springer, since 2012 Guest Editor, Computer Journal, published by Oxford University, special issue (September 2012) Editorial Board, Journal of Functional and Logic Programming, 1995-2010 Program Chair, ACM Intl. Conference on Interdisciplinary Advances in Computing, 2014 General Co-Chair, International Conference on Distributed Computing and Network(ICDCN), 2014 Track Co-Chair, System Software and Engineering, Third International Conference on Ambient Systems and Technologies, ANT 2012-2013 Program Chair, Symposium on Data, Information, and Knowledge Spectrum, ISDIKS 2007 Program Chair, Thirteenth International Conference on Advanced Computing, ADCOM 05, 2005 Program Chair, PADL 2004: Sixth Intl Symposium on Practical Aspects of Declarative Languages, Dallax, TX Member of Program Committees of Conferences: First International Conference on Security in Internet of Things (2012) Practical Aspects of Declarative Languages (2008, 2004, 1999) ACM Conference on Principles and Practice of Declarative Programming (2006, 2004, 1999) International Conference on Advanced Computing and Communications (2006) International Conference on Logic Programming (2005, 2002, 2000) Send comments: webmaster@cse.Buffalo.EDU",
  "content_length": 3983,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:45"
}