{
  "name": "Bharat M. Deshpande",
  "homepage": "https://www.bits-pilani.ac.in/goa/bmd/Profile",
  "status": "success",
  "content": "Bharat Madhusudan Deshpande - BITS Pilani Campus Header Institute Header Home Academics Integrated first degree B.E.(Mechanical) B.E.(Electrical and Electronics) B.E.(Computer Science) M.Sc.(Biological Sciences) B.E.(Chemical) M.Sc.(Physics) B.E.(Electronics and Instrumentation) M.Sc.(Chemistry) M.Sc.(Mathematics) M.Sc.(Economics) B.E.(Electronics and Communication) Higher Degree M.E.(Sanitation Science, Technology and Management) M.E.(Embedded Systems) M.E. Chemical Engineering (with specialization in Petroleum Engineering) M.E.(Microelectronics) M.E.(Biotechnology) M.E.(Chemical) M.E.(Mechanical) M.E.(Design Engineering) M.E.(Computer Science) M.E.(Environmental Engineering) Doctor Programmes Electrical & Electronics Engineering Economics & Finance Physics Biological Sciences Humanities & Social Sciences Chemical Engineering Mathematics Computer Science & Information Systems Chemistry Mechanical Engineering Admission Overview Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions Research & Innovation R&I Home Grants Publications Patents Facilities CoE IIC IPEC TTO TBI Startups Outreach Contacts Sophisticated Instruments Repository Department Biological Sciences Chemical Engineering Chemistry Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Mechanical Engineering Physics Faculty Biological Sciences Chemical Engineering Chemistry Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Mechanical Engineering Physics Students Student Activities Events & Festivals BITScan Picture Gallery Video Gallery Annual Magazine Student Services Admissions Convocation Academic Undergraduate Studies Division (AUGSD) Student Welfare Division Anti Ragging Academic Calendar 2025-26 Prevention of sexual Harassment Wellness & Emergency Helplines For Prospective Students Campus Facilities View Campus Academic Bulletin 2025-26 PMP - A Students’ Initiative Students Club NIRMAAN - Social Responsibility Electronics and Robotics Club (ERC) Centers Teaching Learning Centre Center for Technical Education AI Centre Alumni Quick Links Wellness & Emergency Helplines BITS Goa Virtual Tour Login Links Divisions, Units and Cell Forthcoming Seminars & Workshops Campus Events Calendar About Us Administrative Contacts JRF/SRF/RA Positions Library BITS Media Outreach Hotels around BITS Campus Pilani Dubai K K Birla Goa Hyderabad BITSoM, Mumbai BITS Law School, Mumbai Links For BITS Library Admissions Faculty Practice School Placements Student Arena Career News Alumni Internationalization Events MOUs Current Students Invest in Leaders Outreach Picture Gallery Admission Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions BITSAT IMPORTANT CONTACTS Pilani Dubai Goa Hyderabad RESEARCH & INNOVATION Overview Sponsored Research Projects Consultancy Based Projects Patents Publications R&D Centers DEPARTMENTS Pilani Dubai Goa Hyderabad Academics Integrated First Degree B.E.(Chemical) B.E.(Civil) B.E.(Computer Science) B.E.(Electrical and Electronics) B.E. (Electronics and Computer ) B.E.(Electronics and Communication) B.E.(Electronics and Instrumentation) B.E.(Manufacturing Engineering) B.E.(Mechanical) B.Pharm.(Pharmacy) M.Sc.(Biological Sciences) M.Sc. Semiconductor and Nanoscience B.E. Environmental and Sustainability Engg. M.Sc.(Chemistry) M.Sc.(Economics) M.Sc.(General Studies) M. Sc. (Mathematics) M.Sc.(Physics) B. E. (Mathematics and Computing) Higher Degree MBA (Master of Business Administration) M.E.(Electrical with specialization in Power Electronics and Drives) M.E. Civil – Water Resource Engineering MBA (Master of Business Administration) MBA (Master of Business Administration in Business Analytics) M.E.(Communication) M. E. Computer Science with Specialization in Information Security with B.Sc. input M.E. (Mechanical with specialization in Thermal Engineering) M.E. Electronics & Control M.E. M.Pharm M.E.(Biotechnology) M.E.(Chemical) M.E.(Civil with specialization in Infrastructure Engineering and Management) M.E.(Civil with specialization in Structural Engineering) M.E.(Civil with specialization in Transportation Engineering) M.E.(Computer Science) M.E.(Design Engineering) M.E.(Embedded Systems) M.E.(Manufacturing Systems Engineering) M.E.(Mechanical) M.E. Environmental engineering M.E.(Microelectronics) M.E.(Sanitation Science, Technology and Management) M.E.(Software Systems) M.Pharm.(Pharmaceutical Chemistry) M.Pharm.(Pharmaceutics) M.Pharm.(Pharmacology) M.Pharm.(Pharmacy) M.Sc. General Studies – Communication and Media Studies Stream Master in Public Health MBA(Master of Business Administration In Business Analytics) Doctoral Programmes Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities & Social Sciences Management Mathematics Mechanical Engineering Pharmacy Physics General Sciences WILP Dubai Campus Integrated First Degree Higher Degree Doctoral Programmes Explore BITS About Legacy Achievements Social Responsibility Sustainability Divisions Pilani Dubai K K Birla Goa Hyderabad Mumbai Pilani K K Birla Goa Hyderabad Dubai follow us Feedback Give us your feedback If you notice any issues or missing content, please let us know. Your feedback helps us improve. Thank you. Upload Screenshot Bharat Madhusudan Deshpande K K Birla Goa Computer Science & Information Systems Professor Theoretical Computer Science bmd@goa.bits-pilani.ac.in 0832-2580438 CV About the Faculty Prof. Bharat Deshpande received his Ph.D. degree from IIT Bombay in the year 1998. After which for a year he received postdoctoral fellowship from Department of Atomic Energy. Before joining BITS he worked as a Reader for two years at M.S. University Baroda. Dr. Deshpande joined BITS Pilani in year 2001 and moved to BITS Pilani, Goa Campus in the Year 2005. He was heading the Department of Computer Science & Information Systems at Goa from 2006 to 2017. Apart from basic courses in Computer Science, he has taught specialized courses like Algorithms, Theory of Computation, Parallel Computing, Artificial Intelligence & few more. His research interests are in areas of Complexity Theory, Parallel Algorithms, and Data Mining.   Over the years he has supervised numerous masters and doctoral students. He has many national and international publications to his credit. In 2010 he was felicitated as Distinguished faculty at the BITS alumni global meet held in New Delhi. He is also on the Board of Studies of College of Engineering, Pune. Dr. Deshpande was also Vice President of the Goa Chapter of Computer Society of India.Along with his academic interest Dr. Deshpande is also a sports enthusiast. He was In-charge of Students sporting activities at BITS-Pilani, Goa. He was a member on the panel Committee of the Goa Football Association. Educational Qualification M.Sc. in Mathematics (1992) - Mumbai University Ph.D. in Mathematics (1998) - IIT Bombay Title of Thesis: Hypertoplogies on Uniform Spaces & Stability in Optimization Professional Experience DAE Post Doctoral Fellow 1998 - 1999 at I.I.T. Bombay Lecturer from 1999 - 2001 in Department of Applied Mathematics at Technology Faculty of M.S. University Baroda Lecturer from Oct.2001 - Feb. 2004 in Department of Computer Science & Information Systems, BITS Pilani, Pilani Campus Assistant Professor from March 2004-June. 2005 in Department of Computer Science & Information Systems, BITS Pilani, Pilani Campus Assistant Professor from July 2005 - Feb. 2010 in Department of Computer Science & Information Systems, BITS Pilani, K K Birla, Goa Campus Associate Professor from March 2010 – Feb. 2018 in Department of Computer Science & Information Systems, BITS Pilani, K K Birla, Goa Campus Professor from Feb. 2018 till date in Department of Computer Science & Information Systems, BITS Pilani, K K Birla, Goa Campus Administrative Experience Head of the Department, Department of Computer Science & Information Systems from 2006 - 2017 Associate Dean, Academic Graduate & Studies Research Division, from April 2018 to May 2025 Acting Dean, Administration, from January 2020 to December 2020 Faculty In-Charge, Students Activity Center from 2006 to 2011 Faculty In-Charge of CTE (Center of Technical Education) which meet the demands of students to be trained in specific technologies. Member of Curriculum Restructuring Committee Member of Recruitment Committee for Computer Science Department & Mathematics Department Chair – Organizing Committee ICDCN (2015), 16th International Conference on Distributed Computing & Networking, held at BITS Pilani, K K Birla Goa campus from 4-7 Jan.2015. Local Chair – Organizing Committee ACM India Annual Meet, held at BITS Pilani, K K Birla Goa Campus from 5-7 Feb. 2015. Faculty In-Charge of Computer Science Association, BITS Pilani Loading... Keep Exploring Admission News Alumni Academics Admission Campus University Home K K Birla Goa Pilani Hyderabad Dubai BITSoM, Mumbai BITSLAW, Mumbai Faculty Explore Home Integrated first degree Higher Degree Doctor Programmes Academics Integrated first degree Higher Degree Doctor Programmes Admission Overview Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions Research & Innovation R&I Home Grants Publications Patents Facilities CoE IIC IPEC TTO TBI Startups Outreach Contacts Sophisticated Instruments Repository Department Biological Sciences Chemical Engineering Chemistry Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Mechanical Engineering Physics Faculty Biological Sciences Chemical Engineering Chemistry Computer Science & Information Systems Economics & Finance Elec",
  "content_length": 10641,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:45"
}