{
  "name": "Bharti Rana",
  "homepage": "http://people.du.ac.in/~bharti",
  "status": "success",
  "content": "Dr. Bharti - Department of Computer Science, University of Delhi A Brief Education Achievements Experience Activities Journals Conferences Books Projects A Brief My research interests span the areas of machine learning, image processing and pattern recognition. I have a specific interest in developing Computer-aided diagnosis (CAD) methods for differential diagnosis of an individual and identification of imaging biomarkers of a disease. I’ve worked on T1-weighted MRI dataset of Parkinson’s disease (acquired at All Indian Institute of Medical Science, Delhi), Alzheimer’s disease and fMRI dataset of Schizophrenia disease. I like to practice applied research for developing CAD methods that may be helpful for the clinicians and patients. Education Ph. D. in Computer Science (July 2012 - May 2016) School of Computer and Systems Sciences, Jawaharlal Nehru University (JNU), Delhi, INDIA Thesis title: Computer Aided Diagnosis of Parkinson’s Disease using T1-weighted Magnetic Resonance Imaging Master of Technology in Computer Science & Technology (Aug 2010 - July 2012) School of Computer and Systems Sciences, Jawaharlal Nehru University (JNU) Delhi, INDIA Dissertation title: Salient Features Selection for Multi-class texture classification Master of Computer Applications (Aug 2006 - June 2009) Tecnia Institute of Advanced Studies, Guru Gobind Singh Indraprastha University (GGSIPU) Delhi, INDIA Dissertation title: Implementation of Image Retrieval Techniques For Dissertation, worked at: Defence Terrain Research Laboratory (DTRL), Defence Research & Development Organization (DRDO), Metcalfe House, Delhi, INDIA. Awards & Achievements Department of Science & Technology-INSPIRE Fellow from July 2013 to Aug, 2015. 1 st Position during Master of Technology (SC&SS, JNU). UGC-NET (Computer Science), June 2012 GATE-2010 qualified in Computer Science Work Experience Worked as a Skill Assistant Professor, Computer Science Engineering/Information Technology, Skill Faculty of Engineering & Technology, Shri Vishwakarma Skill University, Haryana, INDIA from August 06, 2019 to December 03, 2020. Worked as an Assistant professor (Ad-hoc) at Hansraj College, University of Delhi, Delhi, INDIA from Sept 8, 2015 to August 05, 2019. Worked as Senior Research Fellow under Department of Information Technology, Ministry of Communication & IT, Govt. of India funded project entitled \"Agri-Bioinformatics Promotion Programme\" at Indian Institute of Wheat & Barley Research, (formerly named as Directorate of Wheat Research) Karnal, Haryana, INDIA from October 1, 2009 to August 10, 2010. Completed Master of Computer Applications (VI semester) project at Defence Terrain Research Laboratory (DTRL), Defence Research & Development Organization (DRDO), Metcalfe House, Delhi, INDIA as a Trainee. Administrative Activities Member, Dean of Students’ Welfare, Shri Vishwakarma Skill University, Palwal, Haryana Project Coordinator, Post Graduate Diploma in Aerospace Structural Design, Skill Faculty of Engineering & Technology, Shri Vishwakarma Skill University, Palwal, Haryana Project Coordinator, Post Graduate Diploma in Aerospace Technical Publication, Skill Faculty of Engineering & Technology, Shri Vishwakarma Skill University, Palwal, Haryana NSS Officer, Shri Vishwakarma Skill University, Palwal, Haryana Coordinator, Monthly Progress Report, Skill Faculty of Engineering & Technology, Shri Vishwakarma Skill University, Palwal, Haryana Member, Anti-ragging squad, Shri Vishwakarma Skill University, Palwal, Haryana Convener, Cultural Committee, Shri Vishwakarma Skill University, Palwal, Haryana Member, Youth Red cross committee, Shri Vishwakarma Skill University, Palwal, Haryana Member, Adventure Cell, Shri Vishwakarma Skill University, Palwal, Haryana Member, Admission committee, Shri Vishwakarma Skill University, Palwal, Haryana Member, Board of Studies, Skill Faculty of Engineering & Technology, Shri Vishwakarma Skill University, Haryana Member, Social-media Committee, Admission Committee, Shri Vishwakarma Skill University, Haryana Active member of Election Committee in Hans Raj College since 2015. Active member of the Admission Committee in Hans Raj College since 2016. Journal Articles 01. Indranath Chatterjee, Virendra Kumar, Bharti Rana, Manoj Agarwal, Naveen Kumar. Impact of ageing on the brain regions of the schizophrenia patients: an fMRI study using evolutionary approach, Multimedia Tools and Applications, 1-23, 2020, DOI: https://doi.org/10.1007/s11042-020-09183-z 02. Indranath Chatterjee, Virendra Kumar, Bharti Rana, Manoj Agarwal, Naveen Kumar. Identification of changes in grey matter volume using an evolutionary approach: an MRI study of schizophrenia, Multimedia Systems, 26, 383–396, 2020 03. Namita Aggarwal, Bharti Rana, R.K. Agrawal. Role of surfacelet transform in diagnosing Alzheimer’s disease. Multidimensional Systems and Signal Processing, 30, 1839–1858, 2019. https://doi.org/10.1007/s11045-019- 00632-z 04. Indranath Chatterjee, Manoj Agarwal, Bharti Rana, Navin Lakhyani, Naveen Kumar. Bi-objective Approach for Computer aided Diagnosis of Schizophrenia Patients using fMRI Data, Multimedia Tools and Applications, 77, 26991-27015, 2018. DOI: https://doi.org/10.1007/s1104 05. Akanksha Juneja, Bharti Rana, R.K. Agrawal. A novel fuzzy rough selection of non-linearly extracted features for schizophrenia diagnosis using fMRI, Computer Methods and Programs in Biomedicine, 155, 139-152, 2018. https://doi.org/10.1016/j.cmpb.2017.12.001. 06. Akanksha Juneja, Bharti Rana, R.K. Agrawal. fMRI based Computer Aided Diagnosis of Schizophrenia using Fuzzy Kernel Feature Extraction and Hybrid Feature Selection, Multimedia Tools and Applications, 77(3) 3963-3989, 2018. doi:10.1007/s11042017-4404-8. 07. Bharti Rana, Akanksha Juneja, Mohit Saxena, Sunita Gudwani, S.S. Kumaran, Madhuri Behari, R.K. Agrawal. Relevant 3D Local Binary Pattern based Features from Fused Feature Descriptor for Differential Diagnosis of Parkinson’s Disease using Structural MRI, Biomedical Signal Processing and Control, 34, 134-143, 2017. ISSN 1746-8094, http://dx.doi.org/10.1016/j.bspc.2017.01.007. 08. Akanksha Juneja, Bharti Rana, R.K. Agrawal. A Combination of Singular Value Decomposition and Multivariate Feature Selection Method for Diagnosis of Schizophrenia using fMRI, Biomedical Signal Processing and Control, 27, 122-133, 2016, ISSN: 1746-8094. 09. Bharti Rana, Akanksha Juneja, Mohit Saxena, Sunita Gudwani, S.S. Kumaran, Madhuri Behari, R.K. Agrawal. Graph Theory based Spectral Feature Selection for Computer Aided Diagnosis of Parkinson’s Disease using T1-weighted MRI, International Journal of Imaging Systems and Technology, 25(3), 245-255, 2015, Online ISSN: 1098-1098 10. Namita Aggarwal, Bharti Rana, R.K. Agrawal. A Combination of Dual-Tree Discrete Wavelet Transform and Minimum Redundancy Maximum Relevance Method for Diagnosis of Alzheimer’s Disease, International Journal of Bioinformatics Research and Applications, 11(5), 433-461, 2015, Online ISSN: 1744-5493 11. Namita Aggarwal, Bharti Rana, R.K. Agrawal. Discrete Wavelet Transform for Computer Aided Diagnosis of Alzheimer’s Disease using T1-Weighted Brain MRI, International Journal of Imaging Systems and Technology, 25(2), 179-190, 2015, ISSN:1098-1098 12. Bharti Rana, Akanksha Juneja, Mohit Saxena, Sunita Gudwani, S.S. Kumaran, R.K. Agrawal, Madhuri Behari. Regions-of-Interest based Automated Diagnosis of Parkinson’s Disease using T1-weighted MRI, Expert Systems with Applications, 42(9), 4506-4516, 2015, ISSN: 0957-4174 For all publication list: https://scholar.google.com/citations?user=CABw3dkAAAAJ&hl=en Conference Articles 01. Bharti Rana, Akanksha Juneja, Mohit Saxena, Sunita Gudwani, S.S. Kumaran, R.K. Agrawal, Madhuri Behari. Voxel-based Morphometry and Minimum Redundancy Maximum Relevance Method for Classification of Parkinson’s Disease and Controls from T1-weighted MRI, In: The Tenth Indian Conference on Computer Vision, Graphics and Image Processing (ICVGIP-2016), pp. 22, ACM. 02. Mohit Saxena, Bharti Rana, Akanksha Juneja, S.S. Kumaran, R.K. Agrawal, Madhuri Behari. Imaging Neurodegeneration in Movement Disorders: A VBM Study, In: Nineteenth International Congress of Parkinson’s Disease and Movement Disorders, JUNE 14-18,2015, SAN DIEGO, CA, USA. Movement Disorders, Vol. 30, Suppl. 1, Pg S393-394, 2015. 03. Akanksha Juneja, Bharti Rana, R.K. Agrawal. A Novel Approach for Computer Aided Diagnosis of Schizophrenia using Auditory Oddball Functional MRI, In: The ninth Indian Conference on Computer Vision, Graphics and Image Processing (ICVGIP2014), Dec 14-17, 2014, doi: http://dx.doi.org/10.1145/2683483.2683520, p 37, ACM, ISBN: 978-1-4503-3061-9. 04. Bharti Rana, Akanksha Juneja, Mohit Saxena, Sunita Gudwani, S.S. Kumaran, Madhuri Behari, R.K. Agrawal, A Machine Learning Approach for Classification of Parkinson’s Disease and Controls using T1-weighted MRI, In: 4th Asian and Oceanian Parkinson’s Disease and Movement Disorders Congress, Pattaya, Thailand, Nov 28-30, 2014. Movement Disorders, Vol 29, Suppl. 2, 2014, ISSN: 1531-8257 05. Akanksha Juneja, Bharti Rana, R.K. Agrawal. A Novel Approach for Classification of Schizophrenia Patients and Healthy Subjects using Auditory Oddball Functional MRI, In: Proceedings of 13th Mexican International Conference on Artificial Intelligence (MICAI-2014), Nov. 16-22, 2014, IEEE. 06. Namita Aggarwal, Bharti Rana, R.K. Agrawal. Detection of Alzheimer’s Disease via Statistical Features from Brain Slices, In: Proceedings of the Twenty-Sixth International Florida Artificial Intelligence Research Society Conference, FLAIRS-2013, St. Pete Beach, Florida. May 22-24, 2013. AAAI Press 2013. 07. Bharti Rana, R.K. Agrawal. Salient Features Selection for Multiclass Texture Classification, In Proceedings of 11th Mexican International Conference on Artificial Intelligence, MICAI 2012, San Luis Potosi, Mexico, Oct 27-Nov 4, 2012, Volume Part I, 2012, 205-215, Lecture Notes in Computer Science Spri",
  "content_length": 11660,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:46"
}