{
  "name": "Bhaskar Mukhoty",
  "homepage": "https://sites.google.com/view/bhaskar-mukhoty",
  "status": "success",
  "content": "Bhaskar Pratim MukhotySearch this siteEmbedded FilesSkip to main contentSkip to navigationAboutI am an Assistant Professor at the Yardi School of Artificial Intelligence, IIT Delhi. Prior to this, I was a postdoctoral associate at Machine Learning Department, MBZUAI, where I worked with Prof. Bin Gu and Prof. Huan Xiong. I obtained a Ph.D. in Machine Learning from the Department of CSE, IIT Kanpur, under the supervision of Prof. Purushottam Kar and Prof. Sandeep K. Shukla. I am interested in developing scalable machine learning / deep learning algorithms with theoretical guarantees on possibly corrupted training and test data, with a broad interest in understanding competing aspects of generalization and security. One of my recent research directions is Spiking Neural Networks, where we studied the implications of this energy-efficient neuronal computational model on generalization and adversarial robustness tasks.EducationPh.D. (CSE) Indian Institute of Technology Kanpur,  Uttar Pradesh, India 2016-2022Thesis: Learning in the Presence of an Adversary: A Provable ApproachAdvisors: Prof. Purushottam Kar and Prof. Sandeep Kumar ShuklaReceived Outstanding PhD Thesis Award (CSE/IITK/2023)M.Tech. (CSE) PDPM IIITDM Jabalpur, Madhya Pradesh, India 2014-2016 Thesis: Marginal Probability Distribution of Nodes Being Informed in Gossip and Independent Cascade ModelAdvisor: Prof. Ruchir Gupta       Received Certificate of Merit for Academic Excellence in Postgraduate (M.Tech/IIITDMJ/2015)B.Tech. (CSE) Guru Nanak Institute of Technology, West Bengal, India 2007-2011TeachingAIL7014 Introduction to Optimization ScAI, IIT Delhi Semester-I, 2025-26AIL8022 / AIL821 Trustworthy ML ScAI, IIT Delhi Semester-II, 2025-26AIV790 / AIV7090 Ethics of AI ScAI, IIT Delhi Semester-II, 2025-26PublicationsConferences (*first co-author)[ICLR 2025] Bhaskar Mukhoty, Hilal AlQuabeh, and Bin Gu, Improving Generalization and Robustness in SNNs Through Signed Rate Encoding and Sparse Encoding Attacks, in The Thirteenth International Conference on Learning Representations (2025).  [ link ] [ pdf ]  [ code ][ICLR 2024] Bhaskar Mukhoty*, Hilal AlQuabeh*, Giulia De Masi, Huan Xiong, and Bin Gu, Certified adversarial robustness for rate encoded spiking neural networks, in The Twelfth International Conference on Learning Representations (2024).  [ link ] [ pdf ]  [ code ]  [ poster ]   [AAAI 2024] Srinivas Anumasa*, Bhaskar Mukhoty*, Velibor Bojkovic, Giulia De Masi, Huan Xiong, and Bin Gu, \"Enhancing training of spiking neural network with stochastic latency\",  Proceedings of the AAAI Conference on Artificial Intelligence 2024, Vol. 38, No. 10, pp. 10900-10908.  [ link ] [ pdf ]  [ code ][AAAI 2024] William de Vazelhes, Bhaskar Mukhoty, Xiaotong Yuan, and Bin Gu, \" Iterative regularization with k-support norm: an important complement to sparse recovery\",  Proceedings of the AAAI Conference on Artificial Intelligence 2024, Vol. 38, No. 10, pp. 11731-11739. [ link ] [ pdf ]  [ arxiv ]  [ code ]  [Neurips 2023] Bhaskar Mukhoty*, Velibor Bojkovic*, William de Vazelhes, Xiaohan Zhao, Giulia De Masi, Huan Xiong, and Bin Gu, \"Direct Training of SNN using Local Zeroth Order Method\", Thirty-seventh Conference on Neural Information Processing Systems 2023, Vol. 36. [ link ] [ pdf ]  [ code]  [ poster ][ACML 2023] Hilal AlQuabeh, Bhaskar Mukhoty, and Bin Gu,  \"Variance Reduced Online Gradient Descent for Kernelized Pairwise Learning with Limited Memory\", Asian Conference on Machine Learning 2023, pp. 28-43. [ link ] [ pdf  ]  [ code ][AAAI 2023] Bhaskar Mukhoty, Debojyoti Dey, and Purushottam Kar, \"Corruption-tolerant Algorithms for Generalized Linear Models\", Proceedings of the AAAI Conference on Artificial Intelligence 2023, Vol. 37. No. 8, pp. 9243-9250 .  [ link ] [ pdf ]  [ arxiv ]  [ code ]  [ slides ][CODS-COMAD 2022] Debojyoti Dey, Bhaskar Mukhoty, and Purushottam Kar, \"Agglio: Global optimization for locally convex functions\", in 5th Joint International Conference on Data Science & Management of Data (9th ACM IKDD CODS and 27th COMAD) 2022, pp. 37–45. [ link ]  [ pdf ]  [ arxiv ]  [ code ]   [AISTATS 2019] Bhaskar Mukhoty, Govind Gopakumar, Prateek Jain, and Purushottam Kar, \"Globally convergent iteratively reweighted least squares for robust regression problems\", The 22nd International Conference on Artificial Intelligence and Statistics, Vol. 89, pp. 313–322. [ link ]  [ pdf ]  [ arxiv ]  [ code ]   [ poster ][PowerTech 2019] Bhaskar Mukhoty, Vikas Maurya, and Sandeep K Shukla, \"Sequence to sequence deep learning models for solar irradiation forecasting\", IEEE PowerTech 2019, Milan. [ link ] [ pdf ][ACSAC 2018] Manish Kesarwani, Bhaskar Mukhoty, Vijay Arya, and Sameep Mehta, \"Model extraction warning in mlaas paradigm\", Proceedings of the 34th Annual Computer Security Applications Conference 2018, pp. 371-380 [ link ] [ pdf ]Journals [Machine Learning 2021] Bhaskar Mukhoty, Subhajit Dutta, and Purushottam Kar, \"Robust non-parametric regression via incoherent subspace projections\", ECML-PKDD 2021, Mach Learn 110, 2941–2989 (2021). [ link ] [ pdf ]  [ slides ]  [ code ] [TINAE 2020] Amit Chandak, Debojyoti Dey, Bhaskar Mukhoty, and Purushottam Kar, \"Epidemiologically and socio-economically optimal policies via bayesian optimization\", Transactions of the Indian National Academy of Engineering 5, 117–127. [ link ]  [ pdf ]  [ code ][Appl. Intell. 2020] Bhaskar Mukhoty, Ruchir Gupta, K Lakshmanan, and Mayank Kumar, \"A parameter-free affinity based clustering\", Applied Intelligence 50, 4543–4556. [ link ]  [ pdf ][Acta Phy. Pol. B  2016] Anoop Mehta, Bhaskar Mukhoty, and Ruchir Gupta, \"Controlling spread of rumor using neighbor centrality\", Acta Physica Polonica B 47, 2325–2340. [ pdf ]Workshop[CPSIoTSec 2021] Aneet K Dutta, Bhaskar Mukhoty, and Sandeep K Shukla, Catchall: A robust multivariate intrusion detection system for cyber-physical systems using low rank matrix, in Proceedings of the 2th Workshop on CPS&IoT Security and Privacy, pp. 47-56. [ link ]  [ pdf ]ExperienceAssistant Professor ScAI, IIT Delhi July'2025 - PresentPostdoctoral Associate MBZUAI, Abu Dhabi Jun'2022 - Jun'2025Student Research Associate C3I Center, IIT Kanpur Jan'2021 - Dec’2021Student Research Associate UKICERI, IIT Kanpur Aug’2017 - Dec’2020Applied Research Scientist Intern Amazon India, Bangalore July'2019 - Oct’2019Research Intern IBM India Research Lab, Delhi May'2017 -July’2017Software Engineer Tech Mahindra, Pune April’2012 -Jun’2014ReviewerConferences:  ICML 2025 NeurIPS [2024, 2025]CVIP [2023, 2024]AISTATS [2022, 2023] IJCAI-ECAI [2022, 2023]   QIP 2022 Journals: IEEE Transactions on Information Forensics & Security [Feb'25]IEEE Signal Processing Letters [Dec'24] The Journal of Supercomputing [Nov'23]ACM Transactions on Cyber-Physical Systems [Nov'20] Notes: (under development)Continuity, Lipschitzness, and SmoothnessConvex Sets and FunctionsEntropy, KL and Mutual InformationLinks:[ Google Scholar ] [ DBLP  ] [ Scopus ] [ WoS ] [ ORCiD ]      [ OpenReview ]      [ GitHub ] [ LinkedIn ]Office Address:515 A, Academic Complex East (99C)Yardi  School of Artificial IntelligenceIIT Delhi, Hauz Khas, New Delhi - 110016Email:Email 1: bp{lastname}@scai.iitd.ac.inEmail 2: {firstname}.{lastname}@gmail.com Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 7342,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:46"
}