{
  "name": "Bhavani Thuraisingham",
  "homepage": "http://www.utdallas.edu/~bhavani.thuraisingham",
  "status": "success",
  "content": "Dr. Bhavani ThuraisinghamDr. Bhavani ThuraisinghamAbout MeMy WorkHigh ImpactEducation ProjectsAwardsNews and EventsMotivational ArticlesCyber Security InstituteHomeAbout MeBiographyEducationContactMy WorkAbout My WorkWork ExperienceAcademiaMitre, Government, Non-profitCommercial IndustryPublicationsReferred Journal PapersReferred Conference PapersBooksTechnical ArticlesEdited WorksDiscussion of PublicationsPresentationsResearch & Education FundingResearch & Education ProjectsSoftware Development ProjectsResearch SupervisionTeachingMentoringPatents & Technology TransferServiceHigh Impact Education ProjectsBig Data Security and PrivacySecure Cloud ComputingBlockChain TechnologiesAwardsNews and EventsHigh Profile Media AppearancesQuotes by Dr. BhavaniArticles About Dr. BhavaniRecent UT Dallas Press ReleasesMotivational ArticlesCyber Security InstituteOne of 30+ \"Women that Changed the Face of World Wide Computing Forever.\"By the Association of Computing Machinery (ACM), April 2024Dear Students, Colleagues and Friends:Welcome to my website hosted by the University of Texas at Dallas. I describe my 44 year career that includes working in the Commercial Industry, Federally Funded Research and Development Center, the US Government, and Academia. My work includes (i) Research, Development, and Technology Transfer of Software Systems at the intersection of Cyber Security and Data Science as well as AI/ML from the Expert Systems in the 1980s to Generative AI Systems in the 2020s, (ii) Educating a Global Community in Cyber Security and Data Science, and (iii) Service to the Community by chairing conferences, serving on editorial boards, and giving over 250 keynote and feature addresses. My passion is to mentor Women and Marginalized Communities and support a variety of events including Women in Cyber Security (WiCyS) and Women in Data Science (WiDS). I am a Fellow of multiple organizations include the ACM, IEEE, AAAS, and the NAI. I have also participated in high profile events including serving on panels organized by the Stanford University Women in Data Science, Fortune Media, Dell Technologies World, and Lloyds of London Insurance and have written opinion columns including for the New York Times. I am honored and humbled to be named in a Book published by the ACM in April 2024 as one of 30+ \"Women that Changed the Face of World Wide Computing Forever.\" The advice I give to my students and those I mentor is the following: To have a successful and fulfilling career, you must work hard, be patient, get a mentor, be flexible, and build a strong support network.SincerelyDr. Bhavani ThuraisinghamThe University of Texas at DallasJuly 4, 2024",
  "content_length": 2674,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:50"
}