{
  "name": "Bhuwan Dhingra",
  "homepage": "http://www.cs.cmu.edu/~bdhingra",
  "status": "success",
  "content": "Bhuwan Dhingra Bhuwan Dhingra Assistant Professor of Computer Science Duke University Research Scientist Google Deepmind CV Github Google-Scholar Twitter Contact Home Prospective Students Updates Group Teaching Publications My group works on machine learning for natural language processing and knowledge representation. I completed my PhD in 2020 from the Language Technologies Institute at Carnegie Mellon University. My thesis advisers were William Cohen and Russ Salakhutdinov. Before that I did Electrical Engineering at IIT Kanpur, where I worked with Amitabha Mukerjee. In between I worked at Qualcomm Research in San Diego, USA. Current topics of interest include: Question answering and information retrieval Reasoning over structured and unstructured knowledge Robustness to corrupted text inputs Misinformation / propaganda detection Model calibration for inherently subjective NLP tasks Prospective students PhD applicants: Please apply to the Duke CS PhD program here (next deadline is Dec 15). I am currently looking for students to join my group. Please only email if you have questions which are not answered here, I may not be able to respond to all emails. Undergraduate or masters students at Duke: If you are interested in working with me, please send an email describing your background and what specifically you want to work on. Include your transcript and also mention how much time will you be able to commit to the project. Others: Please note that at this point I have limited bandwidth to advise students not currently at Duke. However, if you think you are a very good fit please send an email describing your background and what you want to work on. Please only email if you have significant prior experience in NLP or ML. Updates 5/24 I will be spending the summer at Google Deepmind in San Francisco. 2/24 Gave a lecture on LLMs as part of the UNIV103: Let's talk about digital you course. 1/24 Received a grant from the Learning Engineering Virtual Institute (joint with University of Florida). 1/23 Three new papers appearing at EACL 2023 and one at CHI 2023 (my first!). publications 12/22 Serving as Senior Area Chair for the Large Language Models track at ACL 2023. 10/22 Received an Amazon Research Award for my proposal titled \"Long-form QA via collaborative writing\". announcement 8/22 Awarded an NSF Medium grant with Jun Yang and Lavanya Vasudevan. link 6/22 Recieved a gift from P&G for exploring search interfaces based on concept graphs. 10/21 Received a gift from Google for exploring NLP tools to combat misinformation. 10/21 Invited talk at UNC Chapel Hill on \"Language models as Structured KBs\". slides 10/21 Organizing the 2nd workshop on Structured & Unstructured KBs at AKBC2021. 9/21 Teaching CS590.03: Introduction to NLP with Sam Wiseman. 9/21 Started at Duke University. 7/21 New preprint on time-aware language models. 12/20 New preprint on evaluating explanations. 7/20 Joined Google AI in Seattle. 12/19 Invited talks at IIT Delhi, UMass Amherst and USC. 10/19 Invited talks at Stanford and UC Irvine. details Students PhD Rich Stureborg (co-advised with Jun Yang) Raghuveer Thirukovalluru Ghazal Khalighinejad Sanxing Chen Junlin Wang Roy Xie Yukun Huang Undergraduate & Masters Angikar Ghosal (undergraduate, now a PhD student at Stanford) Phyllis Ang (MS, now at Nvidia) Dev Seth (undergraduate, now at McKinsey) Anni Chen (undergraduate, now at Amazon) Teaching Spring 2024: CS572: Introduction to NLP(graduate) Fall 2023: CS590: Generative Models(graduate) Fall 2022: CS572: Introduction to NLP (graduate) Spring 2022: CS590: Advanced NLP (graduate, co-taught with Sam Wiseman) Fall 2021: CS590: Introduction to NLP (graduate, co-taught with Sam Wiseman) Publications Please see my Google Scholar page for the most up-to-date list. 2023 Learning the Legibility of Visual Text Perturbations Dev Seth, Rickard Stureborg, Danish Pruthi and Bhuwan Dhingra EACL, 2023 DiffQG: Generating Questions to Summarize Factual Changes Jeremy R. Cole, Palak Jain, Julian Martin Eisenschlos, Michael J.Q. Zhang, Eunsol Choi and Bhuwan Dhingra EACL, 2023 Salient Span Masking for Temporal Understanding Jeremy R. Cole, Aditi Chaudhary, Bhuwan Dhingra and Partha Talukdar EACL, 2023 Interface Design for Crowdsourcing Hierarchical Multi-Label Text Annotations Rickard Stureborg, Bhuwan Dhingra, Jun Yang CHI, 2023 2022 ASQA: Factoid Questions Meet Long-Form Answers arxiv code bib @article{stelmakh2022asqa, title={ASQA: Factoid Questions Meet Long-Form Answers}, author={Stelmakh, Ivan and Luan, Yi and Dhingra, Bhuwan and Chang, Ming-Wei}, journal={EMNLP}, year={2022} } Ivan Stelmakh, Yi Luan, Bhuwan Dhingra, Ming-Wei Chang EMNLP, 2022 Characterizing the Efficiency vs. Accuracy Trade-off for Long-Context NLP Models arxiv code bib @inproceedings{ang-etal-2022-characterizing, title = \"Characterizing the Efficiency vs. Accuracy Trade-off for Long-Context {NLP} Models\", author = \"Ang, Phyllis and Dhingra, Bhuwan and Wu Wills, Lisa\", booktitle = \"Proceedings of NLP Power! The First Workshop on Efficient Benchmarking in NLP\", month = may, year = \"2022\", address = \"Dublin, Ireland\", publisher = \"Association for Computational Linguistics\", url = \"https://aclanthology.org/2022.nlppower-1.12\", doi = \"10.18653/v1/2022.nlppower-1.12\", pages = \"113--121\", } Phyllis Ang, Bhuwan Dhingra, Lisa Wu Wills NLP Power! Workshop, ACL, 2022 Time-Aware Language Models as Temporal Knowledge Bases arxiv data bib @article{dhingra2022time, author = {Dhingra, Bhuwan and Cole, Jeremy R. and Eisenschlos, Julian Martin and Gillick, Daniel and Eisenstein, Jacob and Cohen, William W.}, title = \"{Time-Aware Language Models as Temporal Knowledge Bases}\", journal = {Transactions of the Association for Computational Linguistics}, volume = {10}, pages = {257-273}, year = {2022}, month = {03}, issn = {2307-387X}, doi = {10.1162/tacl_a_00459}, url = {https://doi.org/10.1162/tacl\\_a\\_00459}, eprint = {https://direct.mit.edu/tacl/article-pdf/doi/10.1162/tacl\\_a\\_00459/2004543/tacl\\_a\\_00459.pdf}, } Bhuwan Dhingra, Jeremy R. Cole, Julian Martin Eisenschlos, Daniel Gillick, Jacob Eisenstein, William W. Cohen TACL, 2022 Evaluating Explanations: How much do explanations from the teacher aid students? arxiv code bib @article{pruthi2022evaluating, author = {Pruthi, Danish and Bansal, Rachit and Dhingra, Bhuwan and Soares, Livio Baldini and Collins, Michael and Lipton, Zachary C. and Neubig, Graham and Cohen, William W.}, title = \"{Evaluating Explanations: How Much Do Explanations from the Teacher Aid Students?}\", journal = {Transactions of the Association for Computational Linguistics}, volume = {10}, pages = {359-375}, year = {2022}, month = {04}, issn = {2307-387X}, doi = {10.1162/tacl_a_00465}, url = {https://doi.org/10.1162/tacl\\_a\\_00465}, eprint = {https://direct.mit.edu/tacl/article-pdf/doi/10.1162/tacl\\_a\\_00465/2006971/tacl\\_a\\_00465.pdf}, } Danish Pruthi, Bhuwan Dhingra, Livio Baldini Soares, Michael Collins, Zachary C. Lipton, Graham Neubig, William W. Cohen TACL, 2022 2021 Reasoning Over Virtual Knowledge Bases With Open Predicate Relations arxiv bib @inproceedings{sun2021reasoning, title={Reasoning over virtual knowledge bases with open predicate relations}, author={Sun, Haitian and Verga, Pat and Dhingra, Bhuwan and Salakhutdinov, Ruslan and Cohen, William W}, journal={ICML}, year={2021} } Haitian Sun, Pat Verga, Bhuwan Dhingra, Ruslan Salakhutdinov, William W. Cohen ICML, 2021 Siamese BERT for Authorship Verification pdf bib @inproceedings{TyoEtAl:CLEF-2021, title = {Siamese Bert for Authorship Verification}, author = {Jacob Tyo and Bhuwan Dhingra and Zachary Lipton}, pages = {2169--2177}, url = {http://ceur-ws.org/Vol-2936/#paper-193}, crossref = {CLEF-2021}, } Jacob Tyo, Bhuwan Dhingra, Zachary Lipton CLEF, 2021 Investigating the Effect of Background Knowledge on Natural Questions aclweb bib @inproceedings{balachandran-etal-2021-investigating, title = \"Investigating the Effect of Background Knowledge on Natural Questions\", author = \"Balachandran, Vidhisha and Dhingra, Bhuwan and Sun, Haitian and Collins, Michael and Cohen, William\", booktitle = \"Proceedings of Deep Learning Inside Out (DeeLIO): The 2nd Workshop on Knowledge Extraction and Integration for Deep Learning Architectures\", month = jun, year = \"2021\", address = \"Online\", publisher = \"Association for Computational Linguistics\", url = \"https://aclanthology.org/2021.deelio-1.3\", doi = \"10.18653/v1/2021.deelio-1.3\", pages = \"25--30\", } Vidhisha Balachandran, Bhuwan Dhingra, Haitian Sun, Michael Collins, William Cohen DeeLIO Workshop, 2021 Differentiable Open-Ended Commonsense Reasoning arxiv code+data bib @inproceedings{lin-etal-2021-differentiable, title = \"Differentiable Open-Ended Commonsense Reasoning\", author = \"Lin, Bill Yuchen and Sun, Haitian and Dhingra, Bhuwan and Zaheer, Manzil and Ren, Xiang and Cohen, William\", booktitle = \"Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies\", month = jun, year = \"2021\", address = \"Online\", publisher = \"Association for Computational Linguistics\", url = \"https://www.aclweb.org/anthology/2021.naacl-main.366\", pages = \"4611--4625\" } Bill Yuchen Lin, Haitian Sun, Bhuwan Dhingra, Manzil Zaheer, Xiang Ren, William W. Cohen NAACL, 2021 Fool Me Twice: Entailment from Wikipedia Gamification arxiv code+data bib @inproceedings{eisenschlos-etal-2021-fool, title = \"Fool Me Twice: Entailment from {W}ikipedia Gamification\", author = {Eisenschlos, Julian Martin and Dhingra, Bhuwan and Bulian, Jannis and Borschinger, Benjamin and Boyd-Graber, Jordan}, booktitle = \"Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies\", month = jun, year = \"2021\", address = \"Online\", publisher = \"Association for Computational Linguistics\", url = \"https://www.aclweb.org/anthology/2021.naacl-main.32\", pages = \"352--365\", } Julian Martin ",
  "content_length": 25603,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:51"
}