{
  "name": "Bianca Schröder",
  "homepage": "http://www.cs.toronto.edu/~bianca",
  "status": "success",
  "content": "Bianca's homepage [ About me | News | Research | Publications ] Bianca Schroeder Full professor Canada Research Chair Sloan Research Fellow E-mail: first-name@cs.toronto.edu Office: Bahen 5236 Computer Science Department University of Toronto Bahen Centre for Information Technology 40 St. George Street Toronto, ON M5S 2E4 Department of Computer and Mathematical Sciences University of Toronto Scarborough IC Building 1265 Military Trail Toronto, ON M1C 1A4 About me Bianca is a full professor and Canada Research Chair in the Computer Science Department at the University of Toronto and a member of the computer systems and networks group . She is also currently serving as associate department chair in the Computer and Mathematical Sciences Department at the University of Toronto, Scarborough. Before joining UofT, she spent 2 years as a post-doc at Carnegie Mellon University working with Garth Gibson. She received her doctorate from the Computer Science Department at Carnegie Mellon University under the direction of Mor Harchol-Balter. She is an Alfred P. Sloan Research Fellow, the recipient of the Outstanding Young Canadian Computer Science Prize of the Canadian Association for Computer Science, an Ontario Early Researcher Award, an NSERC Accelerator Award, a two-time winner of the IBM PhD fellowship and her work has won five best paper awards, one best presentation award and two Test of Time Awards. She has served on numerous program committees and has co-chaired the TPCs of Systor 2020, Usenix FAST'14, ACM Sigmetrics'14 and IEEE NAS'11. Her work on the reliability of hard drives, solid state drives and DRAM have been featured in articles at a number of news sites, including Computerworld, Wired, Slashdot, PCWorld, StorageMojo and eWEEK. Bianca's research focuses on the design, implementation and analysis of computer systems, especially large-scale systems, storage systems and data centers. Her current interests mostly evolve around system reliability and resource allocation, with a focus on applying techniques from data mining, statistics and machine learning to better understand and improve computer systems. Much of her work is done in collaboration with industry partners, currently including Microsoft, Google and NetApp. Prospective students I am recruiting exceptional students interested in joining my group. My group's current projects are in the general areas of resource allocation and scheduling in data centers and reliability of large-scale systems and storage systems. The ideal student is interested in applying analytical techniques from areas like machine learning, data mining, queuing theory, game theory, coding theory, etc., to real-world problems in computer systems and/or also has a keen interest in computer system design and implementation. If you decide to contact me about available positions, please include information on the type of projects you are interested in and why you are considering joining my group. Faculty are receiving a large number of emails from prospective students and if your email does not contain any personalized information it will likely be deleted as spam. News February 2022: Our 2008 FAST paper \"An Analysis of Data Corruption in the Storage Stack\" has received the 2021 Test of Time Award! The USENIX Test of Time Awards recognize papers that have had a lasting impact on their fields. February 2022: Congratulations, Shehbaz and Kaveh, to the Best Paper Award for our paper Rethinking WOM Codes to Enhance the Lifetime in New SSD Generations at Usenix Fast! December 2021: Congratulations, on your FAST papers, Shehbaz and Stathis! Looking forward to seeing you present these two papers at the FAST conference next month. February 2020: Congratulations, Stathis and Kaveh! Our FAST 2020 paper on the reliability of enterprise SSDs just won the FAST Best Paper Award. It also received some press coverage on ZDnet . A big thank you to our collaborators at Netapp for making this work possible! September 2019: I am serving as the program committee co-chair for SYSTOR 2020. Take a look at the Call for Papers and consider submitting your best work! July 2019: I have been named a Canada Research Chair in Data Centre Technologies. Thanks to everyone who supported my nomination! May 2019: I am serving as Workshop and Tutorials Chair for SOSP 2019. Consider attending some of the great workshops and tutorials that will be offered. February 2019: Our FAST 2008 paper \"Disk Failure in the Real World: What does an MTTF of 1,000,000 hours mean to you?\" has been awarded the Test of Time Award. The USENIX Test of Time Awards recognize papers that have had a lasting impact on their fields. Current Research In my current work, I am particularly interested in system reliability and resource allocation and scheduling in data centres. A common thread connecting much of my work is that I like to start with measurements in real production systems to characterize the underlying problems in detail. During this process I often make unexpected discoveries, where systems behave/fail differently from what researchers or operators commonly assume. I then use these insights to derive better solutions to problems. In my past work, I have for example measured and analyzed systems at Google, Microsoft, Network Appliances and national laboratories, such as Los Alamos National Lab. Publications The list below is unfortunately very much out of date. For a more up-to-date list of publications see Google Scholar. Conferences and journals (out of date) N. El-Sayed, I. Stefanovici, G. Amvrosiadis, A. Hwang, B. Schroeder. \"Temperature management in data centers: Why some (might) like it hot.\" Sigmetrics/Performance 2012. pdf. Best paper award. A. Hwang, I. Stefanovici, B. Schroeder. \"Cosmic rays don't strike twice: Understanding the characteristics of DRAM errors and the implications for system design.\" Seventeenth International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2012). pdf. G. Amvrosiadis, A. Oprea, B. Schroeder. \"Practical Scrubbing: Getting to the bad sector, at the right time.\" International Symposium on Dependable Systems and Networks (DSN 2012). pdf. B. Schroeder, Sotirios Damouras, Phillipa Gill. \"Understanding latent sector errors and how to protect against them.\" 8th Usenix Conference on File and Storage Technologies (FAST 2010) pdf. B. Schroeder, E. Pinheiro, W.-D. Weber. \"DRAM errors in the wild: A Large-Scale Field Study.\" Sigmetrics/Performance 2009 . pdf. Winner of Sigmetrics Best Presentation Award. Invited to appear as a \"Research Highlight\" in the Communications of the ACM. L. Bairavasundaram, G. Goodson, B. Schroeder, A. Arpaci-Dusseau, R. Arpaci-Dusseau, FAST'08. \"An analysis of data corruption in the storage stack.\" 6th Usenix Conference on File and Storage Technologies (FAST 2008). pdf. Best student paper award. Short version of the paper appeared in USENIX Login magazine. Extended version in ACM Transactions on Storage (TOS) Vol. 4 issue 3, 2008. The paper has also been featured in an article on Storagemojo. Bianca Schroeder, Garth Gibson. \"Understanding failures in petascale computers.\" Presented at the SciDAC 2007 conference. Journal of Physics: Conf. Ser. 78. pdf. Bianca Schroeder, Garth Gibson. \"The computer failure data repository.\" Invited contribution to the Workshop on Reliability Analysis of System Failure Data (RAF'07) to be held at MSR Cambridge, UK. pdf. Bianca Schroeder, Garth Gibson. \"Disk failures in the real world: What does an MTTF of 1,000,000 hours mean too you?\" 5th Usenix Conference on File and Storage Technologies (FAST 2007). pdf Best paper award. Extended version in ACM Transactions on Storage (TOS), Volume 3 Issue 3, October 2007. The above paper has also been featured in an article on slashdot, which so far has received more than 75,000 hits! Ernst Biersack, Bianca Schroeder. \"Scheduling in Practice.\" Invited to special issue of the ACM Sigmetrics PER (Performance Evaluation Review) on \"New Perspectives in Scheduling\". To appear in 2007. pdf Bianca Schroeder, Garth Gibson. \"A large scale study of failures in high-performance-computing systems.\" International Symposium on Dependable Systems and Networks (DSN 2006). pdf As one of the best DSN'06 papers invited to IEEE Transactions on Dependable and Secure Computing (TDSC). Bianca Schroeder, Adam Wierman and Mor Harchol-Balter. \"Open vs closed: a cautionary tale.\" 3rd Symposium on Networked System Design and Implementation (NSDI 2006). pdf Bianca Schroeder, Mor Harchol-Balter, Arun Iyengar, Erich Nahum. \"Achieving class-based QoS for transactional workloads.\" Poster paper in 22nd International Conference on Data Engineering (ICDE 2006). pdf Bianca Schroeder, Mor Harchol-Balter, Arun Iyengar, Erich Nahum and Adam Wierman. \"How to determine a good multi-programming level for external scheduling.\" 22nd International Conference on Data Engineering (ICDE 2006). pdf David T. McWherter, Bianca Schroeder, Anastassia Ailamaki and Mor Harchol-Balter. \"Improving Preemptive Prioritization via Statistical Characterization of OLTP Locking.\" 21th International Conference on Data Engineering (ICDE 2005). pdf David T. McWherter, Bianca Schroeder, Anastassia Ailamaki and Mor Harchol-Balter. \"Priority Mechanisms for OLTP and Transactional Web Applications.\" 20th International Conference on Data Engineering (ICDE 2004). pdf Bianca Schroeder and Mor Harchol-Balter. \"Web servers under overload: How scheduling can help.\" . 18th International Teletraffic Congress (ITC 2003). (Original Tech report Number CMU-CS-02-143, pdf). Best student paper award. Extended version in ACM Transactions on Internet Technologies (TOIT 2006), vol. 6, no.1, February, 2006. pdf A. Nucci, B. Schroeder, S. Bhattacharyya, N. Taft, C. Diot. \"IS-IS Link Weight Assignment for Transient Link Failures.\" 18th International Teletraffic Congress (ITC 2003). Mor Harchol-Balter, Bianca Schroeder, Nikhil Bansal, Mukesh Agrawal. \"Size-base",
  "content_length": 11878,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:51"
}