{
  "name": "Bianca Trinkenreich",
  "homepage": "https://biancatrink.github.io",
  "status": "success",
  "content": "Bianca Trinkenreich, Ph.D. - Tenure-Track Assistant Professor of Computer Science Bianca Trinkenreich Tenure-Track Assistant Professor of Computer Science and Research Analyst I am a Tenure-Track Assistant Professor of Software Engineering in the Department of Computer Science at Colorado State University and a Research Analyst of Linux Foundation Research. I am researching human factors in software engineering. My interdisciplinary research aims to understand how the members of software engineering teams can flourish and better interact to produce software, leveraging Human-Centric AI, Software Teams' Culture, Developer Experience, Productivity, Creativity and Technostress. I have authored more than 50 papers in top venues of my area, including ICSE, ESEM, CSCW, IST, EMSE, IEEE Software, TSE, and TOSEM, and have received awards at ACM SIGSOFT 2024 Outstanding Doctoral Dissertation Award, ICSE Technical Track 2023 (Distinguished Paper Award), ICSE SEIS 2022 (Best Paper Award), CSCW 2020 (Honored Mention Award), Software Quality Brazilian Conference - SBQS 2018 (Best master’s Degree Thesis Award), Product-Focused Software Process Improvement - PROFES 2015 (Indication for Best Paper Award), Annual Workshop for Software and Services Quality Improvement - WAMPS 2014 (Best Paper Award). I was also awarded an Outstanding Graduate Student 2021 by Northern Arizona University and a Distinguished Reviewer by MSR 2023. Work authorization: USA (Green Card - EB2-NIW visa), EU (citizen), Brazil (citizen) Check my CV for more Publications Ph.D. Dissertation (2022) Understanding and Supporting Women's Participation in Open Source Software Trinkenreich, B. Committee: Dr. Igor Steinmacher (Professor of Computer Science - Northern Arizona University, USA), Dr. Marco Aurelio Gerosa (Professor of Computer Science - Northern Arizona University, USA), Dr. Lisa Hardy (Professor of Anthropology - Northern Arizona University, USA), Dr. Anita Sarma (Professor of Computer Science - Oregon State University, USA), Dr. Daniel German (Professor of Computer Science - University of Victoria, Canada) Journal Papers Making Software Development More Diverse and Inclusive: Key Themes, Challenges, and Future Directions Hyrynsalmi S.M., Baltes S., Brown C., Prikladnicki R., Rodriguez-Perez G., Serebrenik A., Simmonds J., Trinkenreich, B. b>, Wang Y, Liebel G. Accepted at Transactions of Software Engineering and Methodology, 2024. Predicting Attrition among Software Professionals: Antecedents and Consequences of Burnout and Engagement Trinkenreich, B., Santos, F., Sarma, A., Stol, K. Accepted at Transactions of Software Engineering and Methodology, 2024. Guiding the way: A systematic literature review on mentoring practices in open source software projects Feng, Z., Kimura, K., Trinkenreich, B., Sarma, A., Steinmacher, I. Accepted at Information and Software Technology, 2024. Can AI Serve as a Substitute for Human Subjects in Software Engineering Research? Gerosa, M., Trinkenreich, B., Steinmacher, I., Sarma, A. Accepted at Automated Software Engineering, 2024. Tag that issue: Applying API-domain labels in issue tracking systems Santos, F., Vargovich, J., Trinkenreich, B., Santos, I., Penney, J., Britto, R., Pimentel, J., Wiese, I., Steinmacher, I., Sarma, A., Gerosa, M. Accepted at Empirical Software Engineering, 2023. Women's Participation in Open Source Software: A Survey of the Literature Trinkenreich, B., Wiese, I., Gerosa, M., Sarma, A., Steinmacher, I. Accepted at Transactions of Software Engineering and Methodology, 2022. Pots of Gold at the End of the Rainbow: What is Success for Open Source Contributors? Trinkenreich, B., Guizani, G., Wiese, I., Conte, T., Gerosa, M., Sarma, A., Steinmacher, I. Accepted at Transactions of Software Engineering, 2021. Being a mentor in Open Source projects Steinmacher, I., Balali, S., Trinkenreich, B., Guizani, M., Izquierdo-Cortazar, D., Zambrano, G., Gerosa, M., Sarma, A. Accepted at Journal of Internet Services and Applications, 2021. SINIS: A GQM+Strategies-based Approach for Identifying Goals, Strategies and Indicators for IT Services Trinkenreich, B., Santos, G., M. P. Barcellos Accepted at Information and Software Technology, v. 100, p. 147-164, 2018. Evaluation of measurement process on a Global Organization under the light of MR-MPS-SV maturity model (in Portuguese) Trinkenreich, B., Santos, G. Accepted at iSys Brazilian Journal of Information Systems, v. 8, issue 2: p. 58-77, 2015 Peer Reviewed Magazine Papers Women in Open Source: We Need to Talk About It Trinkenreich, B., Gerosa, M., Steinmacher, I. Accepted at IEEE Computer, v. 55, p. 145-149, 2011. Guidelines for Cultivating a Sense of Belonging to Reduce Developer Burnout Trinkenreich, B., Gerosa, M., Steinmacher, I., Sarma, A. Accepted at IEEE Software, 2024. Peer Reviewed Conference Papers The Shifting Sands of Toxicity: The Evolving Nature of Interpersonal Challenges in Open Source Bharadwaj, S., Santos, Trinkenreich, B. Accepted by the 19th ACM/IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM) Technical Track 2025. Get on the Train or be Left on the Station: Using LLMs for Software Engineering Research Trinkenreich, B., Calefato, F., Hanssen, G., Blincoe, K., Kalinowski, M., Pezze, M., Tell, P., Storey, M. Published by the 33rd ACM Symposium on the Foundations of Software Engineering (FSE) HumanAISE Workshop 2025. Analyzing the Communication Patterns of Different Teammate Types in a Software Engineering Course Project Luther, Y., Nielsen, L., Cadman, L., Moraes, S., Ghosh, S., Trinkenreich, B. Accepted at 33rd ACM Symposium on the Foundations of Software Engineering (FSE ’25) Education Track 2025 Exploring the Untapped: Student Perceptions and Participation in OSS Santos, I., Felizardo, K., Trinkenreich, B., German, D., Steinmacher, I., Gerosa, M. Accepted at 33rd ACM Symposium on the Foundations of Software Engineering (FSE ’25) Education Track 2025 Systematizing Inclusive Design in MOSIP: An Experience Report Guenes, P., Tomaz, R., Trinkenreich, B., Baldassarre, M., Storey, M., Kalinowski, M. Accepted at 47th ACM/IEEE International Conference on Software Engineering (ICSE) - Software Engineering in Practice (SEIP) Track 2025. Insights from the Frontline: GenAI Utilization Among Software Engineering Students Choudhuri, R., Ramakrishnan, A., Chatterjee, A., Trinkenreich, B., Steinmacher, I., Gerosa, M., Sarma, A. Accepted at 47th ACM/IEEE International Conference on Software Engineering (ICSE) - Software Engineering in Education (CSEET) Track 2025. Impostor Phenomenon Among Software Engineers: Investigating Gender Differences and Well-Being Chattopadhyay, S., Chatterjee, A., Agarwal, P., Trinkenreich, B., Kumar, S., Rai, R., Chugani, R., Kumari, P., Burnett, M., Sarma, A. Accepted at 47th ACM/IEEE International Conference on Software Engineering (ICSE) - Software Engineering in Practice (SEIP) Track 2025. Investigating the Impact of Interpersonal Challenges on Feeling Welcome in OSS Trinkenreich, B., Feng, Z., Choudhuri, R., Gerosa, M., Sarma, A., Steimacher, I. Accepted at 47th ACM/IEEE International Conference on Software Engineering (ICSE) - Research Track 2025. What Guides Our Choices? Modeling Developers’ Trust and Behavioral Intentions Towards GenAI Choudhuri, R., Trinkenreich, B., Pandita, R., Kalliamvakou, E., Steimacher, I., Gerosa, M., Sanchez, C., Sarma, A. Accepted at 47th ACM/IEEE International Conference on Software Engineering (ICSE) - Research Track 2025. Unraveling the Drivers of Sense of Belonging in Software Delivery Teams: Insights from a Large-Scale Survey Trinkenreich, B., Gerosa, M., Steimacher, I. Accepted at 46th ACM/IEEE International Conference on Software Engineering (ICSE) - Research Track 2024. Do I Belong? Modeling Sense of Virtual Community Among Linux Kernel Contributors (Distinguished paper award) Trinkenreich, B., Stol, K., Sarma, A., German, D., Gerosa, M., Steinmacher, I. Accepted at 45th ACM/IEEE International Conference on Software Engineering (ICSE) - Research Track 2023. A Model for Understanding and Reducing Developer Burnout Trinkenreich, B., Stol, K., Steimacher, I., Gerosa, M., Sarma, A., Lara, M., Feathers, M., Ross, N., Bishop, K. Accepted at 45th ACM/IEEE International Conference on Software Engineering (ICSE) - Software Engineering in Practice (SEIP) Track 2023 Organization culture and burnout in software development teams Trinkenreich, B., Steimacher, I., Gerosa, M., Feathers, M., Bishop, K., Lara, M., Ross, N., Sancho, E., Sarma, A. Accepted at Industry Forum of 16th ACM/IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM) 2022. How to choose a task? Mismatches in perspectives of newcomers and existing contributors Santos, F., Trinkenreich, B., Pimentel, J. F., Wiese, I., Steinmacher, I., Sarma, A., & Gerosa, M. Accepted at 16th ACM/IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM) 2022. An Empirical Investigation on the Challenges Faced by Women in the Software Industry: A Case Study (Best paper award) Trinkenreich, B., Britto, R., Gerosa, M., Steinmacher, I. Accepted at 44th ACM/IEEE International Conference on Software Engineering (ICSE) - Software Engineering in Society (SEIS) Track 2022 Presentation video Perceptions of the State of D&I and D&I Initiative in the ASF Guizani, M., Trinkenreich, B., Castro-Guzman, A., Steinmacher, I., Gerosa, M., Sarma, A. Accepted at 44th ACM/IEEE International Conference on Software Engineering (ICSE) - Software Engineering in Society (SEIS) Track 2022. SINIS-LA Method for IT Alignment Considering Service Level Management Ferreira, E., Trinkenreich, B., Santos, G., M. P. Barcellos Accepted at Brazilian Symposium on Information Systems (SBSI), 2021. The Shifting Sands of Motivation: Revisiting What Drives Contributors in Open Source Gerosa, M., Wiese, I., Trinkenreich, B., Link, G., Robles, G., Treude, C., Steinmacher, I., Sarma, A. Accepted at 43rd ",
  "content_length": 23455,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:50"
}