{
  "name": "Biaoshuai Tao",
  "homepage": "https://jhc.sjtu.edu.cn/~bstao",
  "status": "success",
  "content": "Biaoshuai Tao Biaoshuai Tao é¶è¡¨å¸ Assistant Professor John Hopcroft Center for Computer Science School of Computer Science Shanghai Jiao Tong University Email: bstao[at]sjtu[dot]edu[dot]cn I received my Ph.D. in the Computer Science and Engineering Division at the University of Michigan, Ann Arbor. My advisor was Professor Grant Schoenebeck. I received my bachelor degree in mathematics from Nanyang Technological University. My research interests are mainly in the interdisciplinary area between theoretical computer science and economics, including computational social choice, social network analyses, and algorithmic game theory. Students: Ph.D. Panfeng Liu (2022) Jiarong Jin (2023) Xiaolin Bu (2025) Undergraduate Ex: Jiaxin Song (Now Ph.D. student at UIUC), Yichen Tao (Now Ph.D. student at UMich), Ziqi Yu (Now Ph.D. student at UToronto), Jiayin Chen (Now Ph.D. student at SJTU), Cheng Peng (Now Ph.D. student at CUHK), Chengkai Zhang (Now Ph.D. student at Rutgers) Senior: Wentao He Junior: Xuanxuan Liu, Hao Qiu, Zhenning Ran, Jiayou Shi Teaching: AI2615: Design and Analysis of Algorithms (ç®æ³è®¾è®¡ä¸åæ): 2021 Fall (jointly with Professor Yuhao Zhang), 2022 Spring, 2022 Fall (jointly with Professor Yuhao Zhang), 2023 Spring, 2023 Fall, 2024 Spring, 2024 Fall, 2025 Spring, 2025 Fall. CS3343: Computational Economics (è®¡ç®ç»æµå­¦): 2025 Fall. CS3330: Combinatorics (ç»åæ°å­¦): 2022 Fall (jointly with Professor Shuai Li), 2023 Fall. CS1212: Introduction to Theoretical Computer Science (jointly with Professor Kuan Yang, Professor Yu Yu, Professor Chihao Zhang, and Professor Yuhao Zhang): 2022 Fall, 2023 Fall, 2024 Fall, 2025 Fall. Professional Service: Track/Session Chair: IJTCS'21, IJTCS-FAW'22, IJTCS-FAW'23, IJTCS-FAW'24 SPC Member: WINE'24 PC Member: AAAI'21, AAAI'22, WINE'22, AAAI'23, IJCAI'23, EC'23, WINE'23, AAAI'24, IJCAI'24, EC'24, AAAI'25, IJCAI'25, EC'25, ECAI'25, WINE'25, AAAI'26 Local Organizor: WINE'23 Working Papers: âThe Art of Two-Round Voting *Qishen Han, Grant Schoenebeck, Biaoshuai Tao, Lirong Xia arXiv version âAggregating Information and Preferences with Bounded-Size Deviations *Qishen Han, Grant Schoenebeck, Biaoshuai Tao, Lirong Xia arXiv version Publications: By international convention, authors for papers in theoretical computer science are ordered alphabetically. Asterisk indicates papers in theoretical computer science where alphabetical authorship is used. âLikelihood of the Existence of Average Justified Representation *Qishen Han, Biaoshuai Tao, Lirong Xia, Chengkai Zhang, Houyu Zhou SODA'26, arXiv version âOn Pareto-Optimal and Fair Allocations with Personalized Bi-Valued Utilities *Jiarong Jin, Biaoshuai Tao WINE'25, arXiv version âIncentive Analysis of Collusion in Fair Division *Haoqiang Huang, Biaoshuai Tao, Mingwei Yang, Shengwei Zhou WINE'25 âNew Concentration Bounds and Their Applications in Online Resource Allocation Jinshan Zhang, Biaoshuai Tao, Nan Zhao, Meng Xi, Tao Jin, Jianwei Yin WINE'25 âTruthful and Almost Envy-Free Mechanism of Allocating Indivisible Goods: the Power of Randomness *Xiaolin Bu, Biaoshuai Tao FOCS'25, arXiv version âWhen is Truthfully Allocating Chores no Harder than Goods? *Bo Li, Biaoshuai Tao, Fangxiao Wang, Xiaowei Wu, Mingwei Yang, Shengwei Zhou SAGT'25, arXiv version âApproximability Landscape of Welfare Maximization within Fair Allocations *Xiaolin Bu, Zihao Li, Shengxin Liu, Jiaxin Song, Biaoshuai Tao EC'25, arXiv version âIt's Not All Black and White: Degree of Truthfulness for Risk-Avoiding Agents *Eden Hartman, Erel Segal-Halevi, Biaoshuai Tao EC'25, arXiv version âThe Incentive Guarantees Behind Nash Welfare in Divisible Resources Allocation *Xiaohui Bei, Biaoshuai Tao, Jiajun Wu, Mingwei Yang Artificial Intelligence 2025, WINE'23, arXiv version âParameterized Complexity of Influence Maximization *Panfeng Liu, Biaoshuai Tao COCOON'25 âOn the Existence of EFX (and Pareto-Optimal) Allocations for Binary Chores *Biaoshuai Tao, Xiaowei Wu, Ziqi Yu, Shengwei Zhou Theoretical Computer Science 2025, IJTCS'24, arXiv version âStrong Equilibria in Bayesian Games with Bounded Group Size *Qishen Han, Grant Schoenebeck, Biaoshuai Tao, Lirong Xia WWW'25, arXiv version âThe Degree of (Extended) Justified Representation and Its Optimization *Biaoshuai Tao, Chengkai Zhang, Houyu Zhou AAMAS'25, arXiv version âA Thorough Comparison Between Independent Cascade and Susceptible-Infected-Recovered Models *Panfeng Liu, Guoliang Qiu, Biaoshuai Tao, Kuan Yang AAAI'25, arXiv version âAggregation of Antagonistic Contingent Preferences: When Is It Possible? *Xiaotie Deng, Biaoshuai Tao, Ying Wang WINE'24 [Best Paper Award], arXiv version âBest-of-Both-Worlds Fair Allocation of Indivisible and Mixed Goods *Xiaolin Bu, Zihao Li, Shengxin Liu, Xinhang Lu, Biaoshuai Tao WINE'24, arXiv version âLogarithmic Comparison-Based Query Complexity for Fair Division of Indivisible Goods *Xiaolin Bu, Zihao Li, Shengxin Liu, Jiaxin Song, Biaoshuai Tao WINE'24, arXiv version âFair and Almost Truthful Mechanisms for Additive Valuations and Beyond *Biaoshuai Tao, Mingwei Yang WINE'24, arXiv version âA Complete Landscape for the Price of Envy-Freeness *Zihao Li, Shengxin Liu, Xinhang Lu, Biaoshuai Tao, Yichen Tao AAMAS'24 âFair Allocation of Items in Multiple Regions *Houyu Zhou, Tianze Wei, Biaoshuai Tao, Minming Li (authors ordered reverse alphabetically) AAAI'24 âFair Division with Allocator's Preference *Xiaolin Bu, Zihao Li, Shengxin Liu, Jiaxin Song, Biaoshuai Tao WINE'23, arXiv version âAverage Envy-freeness for Indivisible Items *Qishen Han, Biaoshuai Tao, Lirong Xia EAAMO'23, arXiv version âThe Wisdom of Strategic Voting *Qishen Han, Grant Schoenebeck, Biaoshuai Tao, Lirong Xia EC'23, arXiv version âTruthful Fair Mechanisms for Allocating Mixed Divisible and Indivisible Goods *Zihao Li, Shengxin Liu, Xinhang Lu, Biaoshuai Tao IJCAI'23, arXiv version âOn Existence of Truthful Fair Cake Cutting Mechanisms *Xiaolin Bu, Jiaxin Song, Biaoshuai Tao Artificial Intelligence 2023 (Journal Version), arXiv version âFair Division with Prioritized Agents *Xiaolin Bu, Zihao Li, Shengxin Liu, Jiaxin Song, Biaoshuai Tao AAAI'23, arXiv version âOn Existence of Truthful Fair Cake Cutting Mechanisms *Biaoshuai Tao EC'22 Think Globally, Act Locally: On the Optimal Seeding for Nonsubmodular Influence Maximizationââââââ â*Grant Schoenebeck, Biaoshuai Tao, Fang-Yi Yu Information and Computation 2022 âAdaptive Greedy versus Non-adaptive Greedy for Influence Maximizationâââ *Wei Chen, Binghui Peng, Grant Schoenebeck, Biaoshuai Tao JAIR'22, arXiv version âWisdom of the Crowd Voting: Truthful Aggregation of Voter Information and Preferences *Grant Schoenebeck, Biaoshuai Tao NeurIPS'21, arXiv full version âDesigning a Combinatorial Financial Options Market Xintong Wang, David Pennock, Nikhil R. Devanur, David Rothschild, Biaoshuai Tao, Michael Wellman EC'21, arXiv full version âCooperation in Threshold Public Projects with Binary Actions *Yiling Chen, Biaoshuai Tao, Fang-Yi Yu IJCAI'21, arXiv full version âInfluence Maximization on Undirected Graphs: Towards Closing the (1-1/e) Gapâââ *Grant Schoenebeck, Biaoshuai Tao TEAC'20 (journal full version), EC'19 (conference version), video presentation Limitations of Greed: Influence Maximization in Undirected Networks Re-visitedââââââ â*Grant Schoenebeck, Biaoshuai Tao, Fang-Yi Yu AAMAS'20, arXiv full version âAdaptive Greedy versus Non-adaptive Greedy for Influence Maximizationâââ *Wei Chen, Binghui Peng, Grant Schoenebeck, Biaoshuai Tao AAAI'20 âInformation Elicitation Mechanisms for Statistical Estimationâââ *Yuqing Kong, Grant Schoenebeck, Biaoshuai Tao, Fang-Yi Yu AAAI'20 Outsourcing Computation: the Minimal Refereed Mechanismâââ â*Yuqing Kong, Chris Peikert, Grant Schoenebeck, Biaoshuai Tao WINE'19, arXiv full version Think Globally, Act Locally: On the Optimal Seeding for Nonsubmodular Influence Maximizationââââââ â*Grant Schoenebeck, Biaoshuai Tao, Fang-Yi Yu RANDOM'19, arXiv full version Beyond Worst-Case (In)approximability of Nonsubmodular Influence Maximizationâââââââââ â*Grant Schoenebeck, Biaoshuai Tao TOCT'19 (journal full version), WINE'17 (conference version), arXiv version âImproving K-Subspaces via Coherence Pursuitâââ Andrew Gitlin, Biaoshuai Tao, Laura Balzano, John Lipor IEEE: Journal of Selected Topics in Signal Processing, 2018; Technical report appendix: \"On the Hardness of K-Subspacesâââ\", by Biaoshuai Tao and Laura Balzano Cake Cutting: Envy and Truthââââ â*Xiaohui Bei, Ning Chen, Guangda Huzhang, Biaoshuai Tao, Jiajun Wu IJCAI'17 Improving the Biclique Cryptanalysis of AESââââ Biaoshuai Tao, Hongjun Wu ACISP'15 On Computational Complexity of Plane Curve Invariantsââââ *Fedor Duzhin, Biaoshuai Tao Online Journal of Analytic Combinatorics, 2014 âOptimal Proportional Cake Cutting with Connected Piecesââââ *Xiaohui Bei, Ning Chen, Xia Hua, Biaoshuai Tao, Endong Yang AAAI'12",
  "content_length": 9143,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:50"
}