{
  "name": "Bidyut Gupta",
  "homepage": "https://www.cs.siu.edu/gupta",
  "status": "success",
  "content": "Continuing Faculty | Department of Computer Science | SIU Left Side Bar Website Problems? For a timely response please send email to admin@cs.siu.edu Dr. Bidyut Gupta Professor Ph.D., University of Calcutta, 1986 Senior Member, IEEE Contact Info Phone: (618)453-7194 Fax: (618)453-6044 Email: bidyut@cs.siu.edu Mail Address : Department of Computer Science Southern Illinois University Carbondale Carbondale, IL 62901 Mailcode 4511 Office: Faner 3044 Current Research Interests: Distributed systems, cluster computing, mobile computing, and computer networks Cluster computing has recently enjoyed an increase in popularity as a distributed computing architecture for its applications including supercomputing, large scale code coupling etc. The design of fault-tolerant algorithms for distributed cluster computing environment is a new challenging area. Dr. Gupta's research activity mainly concentrates on designing such algorithms. Besides, the growing importance of cellular, mobile ad-hoc, and sensor networks for their many applications, designing energy efficient communication protocols for such networks is a demanding area of research in which he is also currently involved. References: B. Gupta, S. Rahimi, and Z. Liu, \"A Novel Low-Overhead Roll-Forward Recovery Scheme for Distributed Systems,\" IET Computers and Digital Techniques, 2007 Vol. 1, No. 4, pp. 397-403, 2007. B. Gupta, S. Rahimi, and Z. Liu, “Design of High Performance Distributed Snapshot / Recovery Algorithms for Ring Networks”, Journal of Computing and Information Technology, Vol. 16, No. 1, pp.23-33, 2008. B. Gupta and S. Rahimi. Novel Crash Recovery Approach for Concurrent Failures in Cluster Federation, Book Series: Springer Verlag Lecture Notes in Computer Science, Vol. 5529/ 2009, pp.434-445; Book: Advances in Grid and Pervasive Computing. Teaching Area Operating Systems Computer Networks Fault-tolerant Computing Computer Architecture Digital Logic Right Sidebar",
  "content_length": 1955,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:52"
}