{
  "name": "Bihuan Chen 0001",
  "homepage": "https://chenbihuan.github.io",
  "status": "success",
  "content": "Bihuan Chen - Fudan University About Me Bihuan Chen is an associate professor at the College of Computer Science and Artificial Intelligence in Fudan University. He received his B.Sc. and Ph.D. degrees in Computer Science from Fudan University in 2009 and 2014, respectively. He was a postdoctoral research fellow at the School of Computer Science and Engineering in Nanyang Technological University from 2014 to 2017. His research interests lie in software engineering, focusing on software supply chain and trustworthy AI. He received four ACM SIGSOFT Distinguished Paper Awards at FSE 2016, ASE 2018, ASE 2022 and FSE 2025, and two IEEE TCSE Distinguished Paper Awards at ICSME 2020 and SANER 2023. Please submit your high-quality work to ASE 2025, ICSE 2026, FSE 2026! Research Interests Software Supply Chain Our fuxi (伏羲) platform aims to assess and mitigate security, legal and maintenance risks of software supply chain across the entire engineering lifecycle (e.g., develop, build, deliver and maintain), across multiple programming languages (e.g., Java, Go, Python, JavaScript and C/C++), and across multiple application domains (e.g., application systems and AI systems). Trustworthy AI Assure human-centric, system-level and multi-dimension trustworthy AI (e.g., fairness, safety, security, robustness, privacy, explainability, interpretability, transparency and accountability) across the full AI system engineering lifecyle (e.g., develop, train, test, deploy and monitor). Pulications See also at DBLP and Google Scholar. Journals Junan Zhang, Kaifeng Huang, Yiheng Huang, Bihuan Chen, Ruisi Wang, Chong Wang, and Xin Peng. Killing Two Birds with One Stone: Malicious Package Detection in NPM and PyPI using a Single Model of Malicious Behavior Sequence. ACM Transactions on Software Engineering and Methodology, vol. 34, no. 4, 2025. (Impact factor: 6.600) CCF Prototype Competition Award (3nd Prize) Kan Shen, Kaifeng Huang, Bihuan Chen, and Xin Peng. Detecting Incompatible Third-Party Library APIs in Python Based on Static Analysis. Journal of Software (in Chinese), vol. 36, no. 4, pages 1435-1460, 2025. (Impact factor: 3.120) Yutong Zhao, Lu Xiao, Andre B. Bondi, Bihuan Chen, and Yang Liu. A Large-Scale Empirical Study of Real-Life Performance Issues in Open Source Projects. IEEE Transactions on Software Engineering, vol. 49, no. 2, pages 924-946, 2023. (An extended version of the ICPE'20 paper; Impact factor: 6.226) Bihuan Chen, Yang Liu, Xin Peng, Yijian Wu, and Shengchao Qin. Baton: Symphony of Random Testing and Concolic Testing through Machine Learning and Taint Analysis. SCIENCE CHINA Information Sciences, vol. 66, 2023. (Impact factor: 4.380) Kaifeng Huang, Bihuan Chen, Congying Xu, Ying Wang, Bowen Shi, Xin Peng, Yijian Wu, and Yang Liu. Characterizing Usages, Updates and Risks of Third-Party Libraries in Java Projects. Empirical Software Engineering, vol. 27, no. 4, 2022. (An invited extended version of the ICSME'20 paper; Impact factor: 2.522) Chi Chen, Xin Peng, Bihuan Chen, Jun Sun, Zhenchang Xing, Xin Wang, and Wenyun Zhao. \"More Than Deep Learning\": Post-Processing for API Sequence Recommendation. Empirical Software Engineering, vol. 27, no. 1, 2022. (Impact factor: 2.522) Fengyi Zhang, Bihuan Chen, Rongfan Li, and Xin Peng. A Hybrid Code Representation Learning Approach for Predicting Method Names. Journal of Systems and Software, vol. 180, 2021. (Impact factor: 2.450) Wenjian Liu, Bihuan Chen, Xin Peng, Qinghao Sun, and Wenyun Zhao. Identifying Change Patterns of API Misuses from Code Changes. SCIENCE CHINA Information Sciences, vol. 64, no. 3, 2021. (Impact factor: 2.731) Kun Cheng, Yuan Zhou, Bihuan Chen, Rui Wang, Yuebin Bai, and Yang Liu. Guardauto: A Decentralized Runtime Protection System for Autonomous Driving. IEEE Transactions on Computers, vol. 70, no. 10, pages 1569-1581, 2021. (Impact factor: 3.131) Yu Wang, Fengjuan Gao, Kexin Ma, Lingyun Situ, Linzhang Wang, Bihuan Chen, Yang Liu, Jianhua Zhao, and Xuandong Li. Detecting and Preventing Dangling Pointers. Journal of Software (in Chinese), vol. 31, no. 6, pages 1600-1618, 2020. (Impact factor: 2.446) Hang Ruan, Bihuan Chen, Xin Peng, and Wenyun Zhao. DeepLink: Recovering Issue-Commit Links based on Deep Learning. Journal of Systems and Software, vol. 158, 2019. (Impact factor: 2.559) Chenyu Wang, Bihuan Chen, Yang Liu, and Hongjun Wu. Layered Object Oriented Programming: Advanced VTable Reuse Attacks on Binary-Level Defense. IEEE Transactions on Information Forensics and Security, vol. 14, no. 3, pages 693-708, 2019. (Impact factor: 4.332) Xiaofei Xie, Bihuan Chen, Liang Zou, Yang Liu, Wei Le, and Xiaohong Li. Automatic Loop Summarization via Path Dependency Analysis. IEEE Transactions on Software Engineering, vol. 45, no. 6, pages 537-557, 2019. (An extended version of the FSE'16 paper; Impact factor: 3.272) Bihuan Chen, Xin Peng, Yang Liu, Songzheng Song, Jiahuan Zheng, and Wenyun Zhao. Architecture-Based Behavioral Adaptation with Generated Alternatives and Relaxed Constraints. IEEE Transactions on Services Computing, vol. 12, no. 1, pages 73-87, 2019. (Impact factor: 2.365) Sanjeev Das, Bihuan Chen, Mahinthan Chandramohan, Yang Liu, and Wei Zhang. ROPSentry: Runtime Defense against ROP Attacks using Hardware Performance Counters. Computers & Security, vol. 73, pages 374–388, 2018. (Impact factor: 2.849) Wenyi Qian, Xin Peng, Bihuan Chen, John Mylopoulos, Huanhuan Wang, and Wenyun Zhao. Rationalism with a Dose of Empiricism: Combining Goal Reasoning and Case-Based Reasoning for Self-Adaptive Software Systems. Requirements Engineering, vol. 20, no. 3, pages 233–252, 2015. (An invited extended version of the RE'14 paper; Impact factor: 0.882) Bihuan Chen, Xin Peng, Yijun Yu, and Wenyun Zhao. Requirements-Driven Self-Optimization of Composite Services using Feedback Control. IEEE Transactions on Services Computing, vol. 8, no. 1, pages 107-120, 2015. (Impact factor: 3.049) Ling Yu, Yi Xie, Bihuan Chen, Xin Peng, and Wenyun Zhao. Towards Runtime Dynamic Provision of Virtual Resources Using Fedforward and Fedback Control. Journal of Computer Research and Development (in Chinese), vol. 52, no. 4, pages 889-897, 2015. (Impact factor: 2.649) Mingliang Wang, Bihuan Chen, Xin Peng, Gang Huang, and Wenyun Zhao. Personal Service Publishing and Composition in Mobile Computing Environment. Journal of Software (in Chinese), vol. 26, no. 4, pages 802-818, 2015. (Impact factor: 2.669) Bihuan Chen, Xin Peng, Yijun Yu, and Wenyun Zhao. Uncertainty Handling in Goal-Driven Self-Optimization - Limiting the Negative Effect on Adaptation. Journal of Systems and Software, vol. 90, pages 114-127, 2014. (Impact factor: 1.352) Richang Lin, Bihuan Chen, Xin Peng, and Wenyun Zhao. Dynamic Web Service Composition Approach Supporting Different Risk Appetites. SCIENCE CHINA Information Sciences (in Chinese), vol. 44, no. 1, pages 130-141, 2014. (Impact factor: 0.670) Xin Peng, Bihuan Chen, Yijun Yu, and Wenyun Zhao. Self-Tuning of Software Systems through Dynamic Quality Tradeoff and Value-Based Feedback Control Loop. Journal of Systems and Software, vol. 85, no. 12, pages 2707-2719, 2012. (An extended version of the RE'10 paper; Impact factor: 1.135) Conferences Haowen Jiang, Xinyu Huang, You Lu, Yuheng Cao, Chaofeng Sha, Bihuan Chen, Dingji Wang, Keyu Chen, and Xin Peng. ExpertAD: Enhancing Autonomous Driving Systems with Mixture of Experts. In Proceedings of the 40th Annual AAAI Conference on Artificial Intelligence (AAAI 2026), Singapore, accepted, 2026. (Oral, Acceptance rate: 4167/23680 = 17.6%) Ziqian Chen, Zekai Chen, Susheng Wu, Bihuan Chen, Wenyan Song, Yiheng Huang, Zhuotong Zhou, Yiheng Cao, and Xin Peng. A First Look at Model Supply Chain: From the Risk Perspective. In Proceedings of the IEEE/ACM International Conference on Software Engineering (ICSE 2026), Rio de Janeiro, Brazil, accepted, 2026. (Direct acceptance rate at Cycle 2: 72/795 = 9.1%) Xuezhi Song, Yijian Wu, Bihuan Chen, Zhengjie Lu, Shuning Liu, and Xin Peng. Characterizing Regression Bug‑Inducing Changes and Improving LLM‑Based Regression Bug Detection. In Proceedings of the IEEE/ACM International Conference on Software Engineering (ICSE 2026), Rio de Janeiro, Brazil, accepted, 2026. (Direct acceptance rate at Cycle 2: 72/795 = 9.1%) Dingji Wang, You Lu, Bihuan Chen, Shuo Hao, Haowen Jiang, Yifan Tian, and Xin Peng. Argus: Resilience-Oriented Safety Assurance Framework for End-to-End ADSs. In Proceedings of the 40th IEEE/ACM International Conference on Automated Software Engineering (ASE 2025), Seoul, South Korea, accepted, 2025. (Acceptance rate: 245/1136 = 21.6%) Yiheng Huang, Wen Zheng, Susheng Wu, Bihuan Chen, You Lu, Zhuotong Zhou, Yiheng Cao, Xiaoyu Li, and Xin Peng. ProfMal: Detecting Malicious NPM Packages by the Synergy between Static and Dynamic Analysis. In Proceedings of the 40th IEEE/ACM International Conference on Automated Software Engineering (ASE 2025), Seoul, South Korea, accepted, 2025. (Direct acceptance rate: 113/1136 = 9.9%) Qicai Chen, Kun Hu, Sichen Gong, Bihuan Chen, Zikui Kong, Haowen Jiang, Bingkun Sun, You Lu, and Xin Peng. Structure-Aware, Diagnosis-Guided ECU Firmware Fuzzing. [ ] In Proceedings of the ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2025), Trondheim, Norway, pages 871-893, 2025. (Acceptance rate: 107/500 = 21.4%) Yiheng Cao, Susheng Wu, Ruisi Wang, Bihuan Chen, Yiheng Huang, Chenhao Lu, Zhuotong Zhou, and Xin Peng. Recurring Vulnerability Detection: How Far Are We? [ ] In Proceedings of the ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2025), Trondheim, Norway, pages 573-595, 2025. (Acceptance rate: 107/500 = 21.4%) Junming Cao, Xuwen Xiang, Mingfei Cheng, Bihuan Chen, Xinyan Wang, You Lu, Chaofeng Sha, Xiaofei Xie, and Xin Peng. RegTrieve: Reducing System-Level Regression Errors for Machine Learning Systems via Retrieval-Enhanced Ensemble. [ ] In Proceedings of the ACM International Conference ",
  "content_length": 37315,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:51"
}