{
  "name": "Biing-Feng Wang",
  "homepage": "http://clark.cs.nthu.edu.tw/advisor.php",
  "status": "success",
  "content": "Professor Biing-Feng Wang çç³è± (Biing-Feng Wang) ææ åç«å°ç£å¤§å­¸åå£« ç ç©¶é å: æ¼ç®æ³è¨­è¨èåæãå¹³è¡è¨ç® Professor Department of Computer Science, National Tsing Hua University Ph.D., National Taiwan University Research Field: Algorithm design, Parallel processing Contact Info E-Mail: bfwang@cs.nthu.edu.tw Office: Room 548, EECS building Tel: (886) 3574-2805 Curriculum Vitae å­¸æ­· åç«èºç£å¤§å­¸è³è¨å·¥ç¨æ (åå£«) 1988/9 ~ 1991/6 åç«äº¤éå¤§å­¸è³è¨ç§å­¸ç³» (å­¸å£«) 1984/9 ~ 1988/6 ç¶æ­· æ¸ è¯å¤§å­¸ è¬åº§ææ 2018/8 ~ present æ¼ç®æ³èè¨ç®çè«å­¸æçäº 2013 ~ 2022 æ¸ è¯å¤§å­¸ç¹èææ 2006/8 ~ 2018/7 æ¸ è¯å¤§å­¸è³è¨ç³»ç³»ä¸»ä»» 2003/8 ~ 2006/7 æ¸ è¯å¤§å­¸ææ 1999/8 ~ 2006/7 æ¸ è¯å¤§å­¸è¨ç®æ©ä¸­å¿ç³»çµ±çµçµé· 1998/1 ~ 2000/6 æ¸ è¯å¤§å­¸è³è¨ç³»å¯ææ 1993/8 ~ 1999/7 ç¶æ¿é¨ä¸»å°æ§æ°ç¢åéç¼è¨ç«æè¡å¯©æ¥å§å¡æå§å¡ 1988/7 ~ 1992/7 å°é·é å æ¼ç®æ³è¨­è¨èåæ (Design and Analysis of Algorithms) å¹³è¡è¨ç® (Parallel Computation) æ¦®è­½ æ åº  ç§ æ è« æ ç - è³ é è¨ ç§ æ é¡ 2019 æ¸ è¯ å¤§ å­¸ è¬ åº§ æ æ 2018 æ¸ è¯ å¤§ å­¸ ç¹ è æ æ 2006 æ¸ è¯ å¤§ å­¸ å åº æ å­¸ ç 1997, 2002, 2006 æ¸ è¯ å¤§ å­¸ æ å­¸ ç ï¥¿ - é¢ ç´ æ å­¸ åª ï¥¼ æ å¸«ï¼å6%) 2013, 2015-2020, 2022, 2023 ISI Citation Classic Award 2001 ACM æ å é¼ é å¹´ ç  ç©¶ ç 1999 ä¸­ å¤® ç  ç©¶ é¢ å¹´ è¼ å­¸ è ç  ç©¶ è ä½ ç 1999 æ¸ è¯ å¤§ å­¸ æ° é² äºº å¡ ç  ç©¶ ç 1999 å ç§ æ ç² ç­ ç  ç©¶ ç å© 1993-2000 Publications International Journals [J1] W.-H. Sheu and B.-F. Wang*, \"A kernelization algorithm for finding a perfect phylogeny from mixed tumor samples,\" IEEE/ACM Transactions on Computational Biology and Bioinformatics, accepted. [J2] B.-F. Wang*, C.-Y. Li, and W.-H. Sheu (2025), \"Faster algorithms for constructing frequency difference consensus trees,\" IEEE/ACM Transactions on Computational Biology and Bioinformatics, vol. 22, no. 4, pp. 1358-1368. [J3] B.-F. Wang* (2023), \"A new dynamic programming algorithm for the simplified partial digest problem,\" Theoretical Computer Science, vol. 954, 113801. [J4] W.-H. Sheu and B.-F. Wang* (2023), \"Parameterized complexity for finding a perfect phylogeny from mixed tumor samples,\" SIAM Journal on Discrete Mathematics, vol. 37, no. 3, pp. 2049-2071. [J5] B.-F. Wang* (2023), \"Fast algorithms for the simplified partial digest problem.\" Journal of Computational Biology, vol. 30, no. 1, pp. 41-51. [J6] B.-F. Wang* (2022), \"Efficient algorithms for the minmax regret path center problem with length constraint on trees.\" Theoretical Computer Science, vol. 918, pp. 18-31. [J7] B.-F. Wang* and K. M. Swenson, (2021) \"A faster algorithm for computing the kernel of maximum agreement subtrees.\" IEEE/ACM Transactions on Computational Biology and Bioinformatics, vol. 18, no. 2, pp. 416-430. [J8] B.-F. Wang*, J.-H. Ye, and C.-Y. Li (2020), \"An improved algorithm for the minmax regret path center problem on trees.\" Journal of Computer and System Sciences, vol. 114, pp. 36-47. [J9] B.-F. Wang* and C.-Y. Li (2018), \"Fast algorithms for computing path-difference distances.\" IEEE/ACM Transactions on Computational Biology and Bioinformatics, vol. 16, no. 2, pp. 569-582. [J10] J.-H. Ye, C.-Y. Li, and B.-F. Wang* (2018), \"An improved algorithm for the minmax regret path centdian problem on trees.\" Journal of Computer and System Sciences, vol. 97, pp. 94-105. (Best paper award, 2018, Association of Algorithm and Computation Theory, Taiwan) [J11] B.-F. Wang* (2018), \"A new efficient algorithm for the frequent gene team problem.\" IEEE/ACM Transactions on Computational Biology and Bioinformatics, vol. 15, no. 2, pp. 588-598. [J12] B.-F. Wang* (2016), \"A new efficient algorithm for the all sorting reversals problem with no bad components,\" IEEE/ACM Transactions on Computational Biology and Bioinformatics, vol. 13, no. 4, pp. 599-609. [J13] B.-F. Wang*, J.-H. Ye, and P.-J. Chen (2016), \"Efficient algorithms for the round-trip 1-center and 1-median problems,\" Journal of Computer and System Sciences, vol. 82, iss. 5, pp. 782-792. (Best paper award, 2016, Association of Algorithm and Computation Theory, Taiwan) [J14] J.-H. Ye and B.-F. Wang* (2015), \"On the minmax regret path median problem on trees,\" Journal of Computer and System Sciences, vol. 81, iss. 7, pp. 1159-1170. (Best paper award, 2015, Association of Algorithm and Computation Theory, Taiwan) [J15] B.-F. Wang*, C.-H. Lin, and I-T. Yang (2014), \"Constructing a gene team tree in almost O(n lg n) time,\" IEEE/ACM Transactions on Computational Biology and Bioinformatics, vol. 11, no. 1, pp. 142-153. [J16] R. Benkoczi, B. K. Bhattacharya, Y. Hu, C.-H. Lin, Q. Shi, and B.-F. Wang* (2012), \"Efficient algorithms for the conditional covering problem,\" Information and Computation, vol. 219, pp. 39-57. [J17] B.-F. Wang* (2012), \"Output-sensitive algorithms for finding the nested common intervals of two general sequences,\" IEEE/ACM Transactions on Computational Biology and Bioinformatics, vol. 9, no. 2, pp. 548-559. [J18] B.-F. Wang*, C.-C. Kuo, S.-J. Liu, and C.-H. Lin (2012), \"A new efficient algorithm for the gene team problem on general sequences,\" IEEE/ACM Transactions on Computational Biology and Bioinformatics, vol. 9, no. 2, pp. 330-344, 2012. [J19] C.-Y. Chan, H.-I Yu, W.-K. Hon, and B.-F. Wang* (2011), \"Faster query algorithms for the text fingerprinting problem,\" Information and Computation, vol. 209, no. 7, pp. 1057-1069. [J20] B.-F. Wang* and C.-H. Lin (2011), \"Improved algorithms for finding gene teams and constructing gene team trees,\" IEEE/ACM Transactions on Computational Biology and Bioinformatics, vol. 5, no. 5, pp. 1258-1272. [J21] C.-C. Yu, W.-K. Hon, and B.-F. Wang* (2011), \"Improved data structures for the orthogonal range successor problem,\" Computational Geometry: Theory and Applications, vol. 44, iss. 3, pp. 148-158. [J22] C.-C. Yu, C.-H. Lin, and B.-F. Wang* (2010), \"Improved algorithms for finding length-bounded two vertex-disjoint paths in a planar graph and minmax k vertex-disjoint paths in a directed acyclic graph,\" Journal of Computer and System Sciences, vol. 76, iss. 8, pp. 697-708. [J23] L.-P. Yeh, B.-F. Wang*, and H.-H. Su (2010), \"Efficient algorithms for the problems of enumerating cuts by non-decreasing weights\", Algorithmica, vol. 56, no. 3, pp. 297-312. (NSC-97-2221-E-007- 118) [J24] J.-J. Lin, and C.-Y. Chan, and B.-F. Wang* (2010), \"Improved algorithms for the continuous tree edge-partition problems and a note on ratio and sorted matrices searches,\" Discrete Applied Mathematics, vol. 150, iss. 8, pp. 943-950. (NSC-97-2221-E-007-053) [J25] T.-C. Lin, C.-C. Kuo, Y.-H. Hsieh, and B.-F. Wang* (2009), \"Efficient algorithms for the inverse sorting problem with bound constraints under the l∞-norm and the hamming distance,\" Journal of Computer and System Sciences, vol. 75, issue 8, pp. 451-464. (NSC-97-2221-E-007-053-MY3) [J26] C.-Y. Chan, S.-C. Ku, C.-J. Lu, and B.-F. Wang* (2009), \"Efficient algorithms for two generalized 2-median problems and the group median problem on trees,\" Theoretical Computer Science, vol. 410, no. 8-10, pp. 867-876. (NSC-96-2221-E-007-029) [J27] H.-I Yu, T.-C. Lin, and B.-F. Wang* (2008), \"Improved algorithms for the minmax-regret 1-center and 1-median problems,\" ACM Transactions on Algorithms, vol. 4, no. 3, article no. 36. (NSC-94-2213-E-007-082, NSC- 95-2221-E-007-028) [J28] B.-F. Wang*, T.-C. Lin, C.-H. Lin, and S.-C. Ku (2008), \"Finding the conditional location of a median path on a tree,\" Information and Computation, vol. 206, no. 7, pp. 828-839. (NSC-93-2213-E-007-006, NSC93-2752-E-007- 004-PAE) [J29] Y.-H. Hsieh, C.-C. Yu, and B.-F. Wang* (2008), \"Optimal algorithms for the interval location problem with range constraints on length and average,\" IEEE/ACM Transactions on Computational Biology and Bioinformatics, vol. 5, no. 2, pp. 281-290. (EI, SCI) (NSC-94-2213-E-007-091, NSC-95-2213- E-002-029) [J30] H.-L. Cheng and B.-F. Wang* (2007), \"On Chen and Chen's new tree inclusion algorithm,\" Information Processing Letters, vol. 103, no. 1, pp. 14-18. (EI, SCI) [J31] B.-F. Wang*, S. Peng, H.-Y. Yu, and S.-C. Ku (2006), \"Efficient algorithms for a constrained k-tree core problem in a tree network,\" Journal of Algorithms, vol. 59, pp. 107-124. (EI, SCI) (NSC-92- 2213-E-007-006, NSC-93-2752-E-007-004-PAE) [J32] B.-F. Wang* (2005), \"Linear time algorithms for the ring loading problem with demand splitting,\" Journal of Algorithms, vol. 54, pp. 45-57. (EI, SCI) (NSC-93-2213-E-007- 029) [J33] B.-F. Wang* (2004), \"Finding r-dominating sets and p-centers of trees in parallel,\" IEEE Transactions on Parallel and Distributed Systems, vol. 15, no. 8, pp. 687-698. (EI, SCI) (NSC-91-2213-E-007-044) [J34] B.-F. Wang*, J.-J. Lin, and S.-C. Ku (2004), \"Efficient algorithms for the scaled indexing problem,\" Journal of Algorithms, vol. 52, pp. 82-100. (EI, SCI) (NSC-92-2213-E-007-021) [J35] S.-C. Ku, B.-F. Wang*, and, T.-K. Hung (2003), \"Constructing edge-disjoint spanning trees in product networks,\" IEEE Transactions on Parallel and Distributed Systems, vol. 14, no. 3, pp. 213-221. (EI, SCI) (NSC-90-2213-E-007-071) [J36] B.-F. Wang* (2002), \"Finding a two-core of a tree in linear time,\" SIAM Journal on Discrete Mathematics, vol. 15, no. 2, pp. 193-210. (EI, SCI) (NSC-90-2213-E-007-061) [J37] S.-C. Ku and B.-F. Wang* (2002), \"An optimal simple parallel algorithm for testing isomorphism of maximal outerplanar graphs,\" Journal of Parallel and Distributed Computing, vol. 62, pp. 221-227. (EI, SCI) (NSC-89-2213-E-007-017) [J38] B.-F. Wang*, S. C. Ku, and K.-H. Shi (2001), \"Cost-optimal parallel algorithms for the tree bisector and related problems,\" IEEE Transactions on Parallel and Distributed Systems, vol. 12, no. 9, pp. 888-898. (EI, SCI) (NSC-89-2213-E-007-099) [J39] C.-H. Peng, B.-F. Wang*, and J.-S. Wang (2000), \"Recognizing unordered depth-first search tree",
  "content_length": 22964,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:51"
}