{
  "name": "Bijan Parsia",
  "homepage": "http://www.cs.man.ac.uk/~bparsia",
  "status": "success",
  "content": "Bijan Parsia at the School of Computer Science at the Univeristy of Manchester Bijan Parsia at the University of Manchester Hit 't' to toggle to a non-slide view. Right and left arrows move forward or back. Sometimes there are slides \"below\" the current slide which you can visit by using up and down arrows. Hit 't' to toggle to a slideshow view, thanks to a 3rd year project I supervised. The formatting isn't there yet, but it's an interesting experience. Quick Links: owl.cs, Twitter, Blog Who am I? refugee philosopher I am a Reader in the School of Computer Science. (Contact info) I have been a member of the Information Management Group (IMG) since 2006. I was promoted to Senior Lecturer in 2012 and to Reader in 2014. Before that, I was a Faculty Research Associate in the Mindswap group at the University of Maryland College Park (UMCP). Research this! My academic specialties are philosophy and computer science. My graduate training is in philosophy (at the University of North Carolina at Chapel Hill, though my doctorate (Aug 2009) is from UMCP (in philosophy, though I was employed there in CS)), but I've only held research and academic positions in CS. I'm an autodidact in CS. I'm not sure why I find that important to mention. If you are interested in collaborating or studying with me, drop me a line! Computer Science by day [Semantic Web, Knowledge Representation and Reasoning, AI, Programming languages, Software and Ontology Engineering, HCI, Visualization, Belief Revision, Web services, Planning] I have worked on Swoop and Pellet. A lot. Among other things. With complete sentences in the mix. On occasion. Philosophy by night My master's thesis was on the epistemology of \"essentially\" computer based proofs of mathematical theorems, specifically of the four-color theorem. My dissertation killed me. My diploma reanimated me. The nicest thing I want to say about my thesis is that it is done! [Epistemology, Oppression Theory, Feminisms, Early Moderns, Ethics, Metaphysics, Philosophy of Logic|Mathematics|Mind|Language, History of Analytic Philosophy] The thesis was completed Ok, ok. The final one was on Topic Sensitive Belief Revision under the direction of Jeff Horty (thanks, Jeff!). It explored ideas first proposed by Rohit Parikh in his modification of the AGM approach to revision. Some of the thesis is re-emerging a bit in some of my current modularity work. My original topic was on non-logical reductio ad absurdums, which I still think is pretty interesting. Maybe I'll take it up again one of these decades. The purpose of a thesis is to be done. Mine is done. Publications burning like Alexandria DLDB has a reasonable, if incomplete, list of my publications. I scraped their BibTeX to make an (experimental) Exhibt. But my Google Scholar page is probably the best place to find stuff. I'm particularly proud of Laconic and Precise Justifications in OWL (with Matthew Horridge and Uli Sattler). It was Best Paper at ISWC 2008. Variants were rejected from several conferences, including KR (and without giving useful comments). It's a lottery, folks! Teaching the light fantastic I'm privileged to have co-instructors on all my courses. I'm more priviledged to teach entirely within my core interests. Undergraduate Knowledge Representation (suspended for 2015-2016 due to work overload!) MSc Semi-structured Data and the Web (with Uli Sattler) Software engineering: Concepts in Practice (NEW!): I have been banging on for years about how to make our software engineering MSc pathway awesome. For my sins, I've been given a chance to make it so! Ontology Engineering for the Semantic Web (with Sean Bechhofer) turned over to Uli Sattler PhD Effective Academic Writing (with Renate Schmidt) Student Projects big and small Each year I supervise several 3rd year (library) and MSc Projects (library). (In all cases, search in the page for \"Bijan\" should jump to my projects.) Students in the rough I am looking for bright, motivated students. If you look at my publications you'll get some idea of the eclectic mix of topics I've worked on. I am a bit of an intellectual magpie and can get quite enthused by new and wacky things. Drop me a line if you think you'd be interested in working with me. I especially encourage non-traditional students of every sort (having been something of a non-traditional student myself). In particular, I would like to increase the number of woman in our group. Computer science, as an academic discipline, has been very welcoming to me (refugee philosopher!); I hope it is or becomes so to ever wider groups of people. Supervising the dreadful wind & rain For my current students, my co-supervisor is Uli Sattler, except for Maria (Robert Stevens). Michael Lee (explanation; 2015-) Jarad Leo (temporal description logics; 2013-) Nicolas Matentzoglu (empirical studies of modular reasoning; 2012-) Maria Copeland (ontology evolution; 2011-) Habibullah Aminu (benchmarking reasoners; 2011-2012) Tahani Alsubait, PhD (Ontology-Based Multiple-Choice Question Generation; 2011-2015) Chiara Del Vescovo, PhD (The Modular Structure of an Ontology: Atomic Decomposition and its Applications; 2009-2013; EPSRC Doctoral Prize Fellow) Rafael Gonçalves, PhD (Impact Analysis in Description Logic Ontologies; 2009-2013) At Stanford Samantha Bail, PhD (The Justificatory Structure of OWL Ontologies; 2009-2013) at Flatiron Health Jasmin Optiz (information system analysis; 2008-2012) Pavel Klinov, PhD (Practical Reasoning in Probabilistic Description Logic; 2008-2011; School Best Thesis, 2011) At Complexible Matthew Horridge, PhD (Justification Based Explanation in Ontologies; 2007-2011) At Stanford winner of the 2012 BCS Distinguished Dissertation award and the University of Manchester's Student of the Year award for the Faculty of Engineering and Physical Sciences Francisco Martin-Recuerda (2006-2007) Service with a smile Reviewing. There is always the reviewing. I was the school's eLearning Champion for a number of years. This is a real post. I did not name it (The first rule of eLearning is that you do not talk about eLearning.) I don't know that the usual litany of PCing and chairing is really all that interesting. If you need to know, drop me a line and I'll drop you a CV. (Short answer, ISWC, AAAI, KR, DL, OWLED, etc.) I did (co)found OWLED (a personal take on the OWLED series). That led (by design) to OWL 1.1 and then to a second W3C OWL Working Group and then to OWL 2. These were good, if tiring, things. Standards to choose from I co-edited several of the key OWL 2 documents and am listed as an author on most. I've been on loads of working groups, but am taking a bit of a break. Personal stuff I was born in Philadelphia, PA, USA and grew up in a suburb of it (note, Google maps is pointing at where our mailbox would be; the house I grew up in is the second on the right of White Pine Lane). My spousetype is the fabulous Zoe Mulford. For many years, we were marriage resisters, but the lure of tax advantages, medical insurance, and, of course, our staying together when I came to the UK wore us down. Good thing we're madly in love. We met in high school. Music does not smell Zoe is a professional, full time musician. She has four albums (CDBaby, iItunes) out: Traveling Moon , Roadside Saints, Bonfires, and, in 2013, Coyote Wings. (There was a prior homegrown CD, \"As Soon As I'm On Top Of Things\", \"published\" through (the old) MP3.com. Lotta good songs on it which are moving to produced albums.) She plays guitar, banjo, piano, and, most recently, the melodica. She sings, arranges, and composes as well as writing lyrics. I've snuck a vocal cameo onto all albums. I am the voice of the drunken frat boy in Party Cows, in the chorus of The American Wake and One Day the Sun's Gonna Shine, and making the Road Runner's \"meep meep\" in Coyote Wings. People remembered Some of my dead have prompted me to put something on the Web. My essay about my grandfather includes a poem about him written well before his death. Part of my coping with Chris Mulford's death is to build her a memorial website. Not only is in theraputic, but I've learning things about her that are just so cool. See my Ada Lovelace Day essay about her. My current favorite quote: \" If it comes down to a choice between having rights and having manners, I'll go for rights…but I think we can aim for having both.\" My name explained My name, \"Bijan Parsia,\" is Iranian (my middle name, \"John,\" isn't, but I don't generally use it except in signatures as an initial and in initials). \"Bijan\" is the name of an Iranian epic hero, who, as far as I can tell, was mainly heroically imprisoned (note the telling typo \"Bijan was the son Giw, a great worrier...\"; my father was, indeed, an annoyingly great worrier). My last name, so the story goes, was a contraction (by my father) of a really long (and pretentious) name coined by my grandfather. From ages 6 to around 10, I didn't mind explaining my name (to teachers, for example). Most people thought it was French. But then came the Iranian Revolution and the hostage crises. It wasn't ideal to be Iranian in the US at that point. (I never got beat up, though I was threatened a few times. Then again, I got threatened for being me as well, so.) I developed a reluctance to explain after that. My nationality ...-American/British My mother is American. My father is a first generation immigrant to the US from Iran. I was born and raised in the US. I have some degree of Iranian-American consciousness, but, for example, I never learned Farsi and have been to Iran only once (when I was 5). I do celebrate Noruz. My mother's grandparents immigrated from Germany, and my grandmother spent a bit of time there as a child. So, I have some consciousness as a German-American (Catholic, not Lutheran). My mother's father's family were in the US for several generations, but originally (within memory) came from Wales. I have a bit of Welsh-American consciousness. (See a poem to my",
  "content_length": 10216,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:54"
}