{
  "name": "Bijaya Adhikari",
  "homepage": "https://cs.uiowa.edu/people/bijaya-adhikari",
  "status": "success",
  "content": "Bijaya Adhikari, Ph.D. | Computer Science - College of Liberal Arts and Sciences | The University of Iowa Skip to main content Bijaya Adhikari, Ph.D. Assistant Professor Emeriti-Faculty Scholar Biography Research InterestsMy research interest lies in data mining and machine learning, with a focus on dynamical processes (e.g. spread of misinformation, diseases, failures) on large networks (e.g. web, population contact networks, critical infrastructures). My recent work include AI for influenza forecasting, e-commerce search and fraud detection, outbreak detection in hospitals, network embedding, community detection, and network summarization.As a member of the Computational Epidemiology Group, I primarily investigate problems motivated by public health such as propagation of diseases via contact network, forecasting outbreaks of infectious diseases, and designing optimal surveillance systems.Research Interests (Keywords)Graph Mining; Computational Epidemiology; Machine LearningSelected PublicationsEfficient and Effective Implicit Dynamic Graph Neural Network [PDF][CODE][SLIDES] Yongjian Zhong, Hieu Vu, Tianbao Yang, and Bijaya Adhikari. ACM SIGKDD Conference on knowledge Discovery and Data Mining (KDD 2024), August 2024, Barcelona, SpainEnd-to-End Risk-aware Reinforcement Learning to Detect Asymptomatic Cases in Healthcare Facilities [PDF][CODE][SLIDES] Yongjian Zhong, Weiyu Huang and Bijaya Adhikari. IEEE International Conference on Healthcare Informatics (ICHI 2024), June 2024, Orlando, FLContinually-Adaptive Representation Learning Framework for Time-Sensitive Healthcare Applications [PDF][CODE][SLIDES] Akash Choudhuri, Hankyu Jang, Alberto M. Segre, Philip M. Polgreen, Kishlay Jha and Bijaya Adhikari. ACM International Conference on Information and Knowledge Management (CIKM 2023), October 2023, Birmingham, UKDetecting Sources of Healthcare Associated Infections [PDF] [CODE] [SLIDES] Hangkyu Jang, Andrew Fu, Jiaming Cui, Methun Kamruzzaman, B. Aditya Prakash, Anil Vullikanti, Bijaya Adhikari and Sriram Pemmaraju. AAAI Conference on Artificial Intelligence. (AAAI 2023). Feb 2023, Washinton, DCEINNs: Epidemiologically-Informed Neural Networks [PDF] Alexander Rodriguez, Jiaming Cui, Naren Ramakrishnan, Bijaya Adhikari and B. Aditya Prakash. AAAI Conference on Artificial Intelligence. (AAAI 2023). Feb 2023, Washinton, DCNear-Optimal Spectral Disease Mitigation in Healthcare Facilities. [PDF] [CODE][SLIDES] Masahiro Kiji, D.M. Hasibul Hasan, Alberto M. Segre, Sriram Pemmaraju, and Bijaya Adhikari. IEEE International Conference on Data Mining, 2022. (ICDM 2022), Nov 2022, Orlando, FLDynamic Healthcare Embeddings for Improving Patient Care. [PDF] [CODE][SLIDES] Hankyu Jang, Sulyun Lee, D. M. Hasibul Hasan, Philip M. Polgreen, Sriram V. Pemmaraju and Bijaya Adhikari. IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining. (ASONAM 2022), Nov 2022, Istanbul, Turkey Research areas Health- and Human-Centric Computing Email bijaya-adhikari@uiowa.edu Website Personal Website, Computational Epidemiology Research, Google Scholar Education Ph.D., Virginia Tech, 2020 Contact Information Office Address 258 Macbride Hall (MH) Iowa City, IA 52242 United States",
  "content_length": 3230,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:52"
}