{
  "name": "Bijoy Chand Chatterjee",
  "homepage": "https://www.bijoycc.site",
  "status": "success",
  "content": "BIJOY CHATTERJEE Search Bijoy Chand Chatterjee Associate Professor South Asian University (An international university established by SAARC nations), New Delhi, India Biography Bijoy Chand Chatterjee, Ph.D., is an Associate Professor in the Department of Computer Science and Engineering at South Asian University (SAU), New Delhi, a SAARC-established international university. He is also an Adjunct Faculty at Indraprastha Institute of Information Technology Delhi (IIITD), India. He earned his Ph.D. degree from the department of Computer Science and Engineering, Tezpur University, in 2014 (Supervisor Prof. Nityananda Sarma). From 2014 to 2017, he was a Postdoctoral Researcher at The University of Electro-Communications, Tokyo, Japan, where he worked in the Japan-US Network Opportunity (JUNO) project with Prof. Eiji Oki and his research group to develop high-speed flexible optical backbone networks. From 2017 to 2018, he served as an Assistant Professor (Full-time Visiting) at IIIT Delhi, followed by a prestigious ERCIM Postdoctoral Research Fellowship at the Norwegian University of Science and Technology (NTNU), Norway. Additionally, he was a Visiting Researcher at Oki Lab, Kyoto University, Japan, in 2019 and 2022. Dr. Chatterjee has authored over 120 research papers in leading journals and conferences in networking and communication. His work has been published in IEEE Communications Surveys and Tutorials, IEEE/ACM Transactions on Networking, IEEE Transactions on Communications, IEEE Journal on Selected Areas in Communications, IEEE Transactions on Network and Service Management, IEEE/OSA Journal of Optical Communications and Networking, IEEE/OSA Journal of Lightwave Technology, IEEE INFOCOM, IEEE ICC, IEEE GLOBECOM, and IEEE HPSR, among others. He has also authored two books on optical networks, published by Springer International Publishing and CRC Press. His research has been supported by multiple national and international funding agencies, including SERB, MeitY, DST, ERCIM, JSPS (Japan), NICT (Japan), and MEXT (Japan). His research interests include optical networks, QoS-aware protocols, network optimization, and routing. Dr. Chatterjee is a Senior Member of IEEE and a Fellow of IETE. He has actively contributed to the organization of several international conferences, having served as TPC Co-Chair for IEEE HPSR 2025, and is currently serving as TPC Chair for IEEE ANTS 2025 and Workshops Co-Chair for IEEE/IFIP NOMS. He will also serve as General Co-Chair for IEEE HPSR 2028, which is scheduled to be held at South Asian University, New Delhi. Dr. Chatterjee presently serves as the Vice-Chair of the IEEE Communications Society Delhi Chapter. Publications Books and Book Chapters: Book: Chatterjee, B.C.♦ and Oki, E., Spectrally-Spatially Flexible Optical Networks: Principles, Architectures, and Management. in Optical Networks book series, Springer Nature Switzerland AG (Proposal Accepted, Under Preparation). Book: Chatterjee, B.C.♦ and Oki, E., Elastic Optical Networking Technologies: Fundamentals, Design, Control, and Management. CRC Press, Taylor and Francis Group, Boca Raton, U.S.A, 2020; ISBN-13: 978-1138611719, ISBN-10: 1138611719. Book: Chatterjee, B.C.♦, Sarma, N., Sahu, P.P. and Oki, E., “Routing and Wavelength Assignment for WDM-based Optical Networks: Quality-of-Service and Fault Resilience”, Springer International Publishing, Lecture Notes in Electrical Engineering, Volume 410, 2017; ISBN: 978-3-319-46202-8 (Print) 978-3-319-46203-5 (Online) Journals: Chatterjee, B.C.♦, Kumar, V., and Oki, E. “Optimizing Virtual Network Embedding in Spectrally-Spatially Elastic Optical Networks: A Crosstalk-Aware Perspective,” IEEE Transactions on Network and Service Management, vol. 22, no. 5, pp. 4112-4125, 2025, IF: 5.3. Barbhuiya, D.H., Deka, S.K., Sarma, N., and Chatterjee, B.C.♦, “FARASP: Fragmentation-Aware Resource Allocation with Spectrum Partitioning in Elastic Optical Networks,” Computer Network, vol. 269, pp. 111386, 2025, IF: 5.6. Kawabata, A., Hiragi, S., Chatterjee, B.C., and Oki, E. “Distributed Processing Network Design Scheme for Virtual Application Processing Platform,” IEEE Transactions on Network and Service Management, vol. 22, no. 4, pp. 3632 - 3645, 2025, IF: 5.3. Imanaka, S., Kawabata, A., Chatterjee, B.C., and Oki, E. “Distributed Server Allocation for Internet-of-Things Monitoring Services with Preventive Start-Time Optimization against Server Failure,” IEEE Transactions on Network and Service Management, vol. 22, no. 3, pp. 2679 - 2701, 2025, IF: 5.3. Ahmed, I., Oki, E., Chatterjee, B.C.♦, “AnDefrag: Analytical Model for Blocking Probabilities Considering Defragmentation in Spectrally-Spatially Elastic Optical Networks,” IEEE Transactions on Networking, vol. 33, no. 4, pp. 1528 - 1542, 2025, IF: 3.7. Bao, B., Yang, H., Yao, Q., Zhang, J., Chatterjee, B.C., Oki, E., “Node-Oriented Slice Reconfiguration Based on Spatial and Temporal Traffic Prediction in Metro Optical Networks,” IEEE Transactions on Network and Service Management, vol. 21, no. 6, pp. 6731-6743, 2024, IF: 5.3. Kumar, V., Halder, J., Mitra, A., Oki, E., and Chatterjee, B.C.♦, “VNEavXT: Offline Virtual Network Embedding Model Considering Crosstalk-Avoided Approach in Spectrally-Spatially Elastic Optical Networks,” IEEE Transactions on Network Science and Engineering, vol. 11, no. 5, pp. 4807 - 4821, 2024, IF: 6.7. Imanaka, S., Kawabata, A., Chatterjee, B.C., and Oki, E., “Polynomial-Time Server Allocation Algorithm in Delay-Sensitive Internet-of-Things Monitoring Services,” Computer Network, vol. 248, pp. 110504, 2024, IF: 5.6. Prajapati, U., Chatterjee, B.C., and Banerjee, A., “GLBMF: Greedy-based Load Balancing in SDN by Reducing Switch Migrations and Prioritizing Mice Flow Traffic,” Wireless Personal Communications, pp. 1-24, 2024, IF: 2.2 [to appear]. Kawabata, A., Chatterjee, B.C., and Oki, E., “DSND: Delay-Sensitive Network Design Scheme for Multi-Service Slice Networks,” IEEE Networking Letters, vol. 6, no. 2, pp. 143 - 147, 2024. Ahmed, I., Oki, E., and Chatterjee, B.C.♦, “Modeling and Analysis of Crosstalk-Avoided and Crosstalk-Aware Approaches in Spectrally-Spatially Elastic Optical Networks,” Computer Network, vol. 242, pp. 110256, 2024, IF: 5.6. Prajapati, U., Chatterjee, B.C.♦, and Banerjee, A., “FractionalLB: Controller Load Balancing using Fractional Switch Migration in Software-Defined Networks,” IEEE Networking Letters, vol. 6, no. 2, pp. 129 - 133, 2024. Takeda, K., Sato, T., Chatterjee, B.C., and Oki, E., “Lightpath Provisioning Model Considering Crosstalk-Derived Fragmentation in Spectrally-Spatially Elastic Optical Networks,” Computer Network, vol. 237, pp. 110099, 2023, IF: 5.6. Ahmed, I., Rai, R., Maity, M., Oki, E., and Chatterjee, B.C.♦, “AnalyticalBP: Analytical Model for Blocking Probabilities Considering Crosstalk-Avoided Approach in Spectrally-Spatially Elastic Optical Networks,” IEEE Transactions on Communications, vol. 72, no. 3, pp. 1487 - 1501, 2024, IF: 8.3. Kawabata, A., Chatterjee, B.C., and Oki, E., “CMND: Consistent-aware Multi-Server Network Design Model for Delay-Sensitive Applications,” IEEE/IEICE Transactions on Communications, vol. E107-B, no. 3, pp. 321-329, 2024, IF: 0.7. Prajapati, U., Chatterjee, B.C., Banerjee, A., “OptiGSM: Greedy-Based Load Balancing with Minimum Switch Migrations in Software-Defined Networks,” IEEE Transactions on Network and Service Management, vol. 21, no. 2, pp. 2200-2210, 2023, IF: 5.3. Kawabata, A., Chatterjee, B.C., and Oki, E., “MHND: Multi-Homing Network Design Model for Delay Sensitive Applications,” IEICE Transactions on Communications, vol. E106-B, no. 11, pp. 1143-1153, 2023, IF: 0.7. Halder, J. and Chatterjee, B.C.♦, “A Resource Allocation Model for Mixed-Grid Optical Networks,” IEEE Transactions on Network and Service Management, vol. 20, no. 4, pp. 4158-4169, 2023, IF: 5.3. Kawabata, A., Tojo, Chatterjee, B.C., and Oki, E., “A Network Design Scheme in Delay Sensitive Monitoring Services,” IEICE Transactions on Communications, vol.E106-B, no.10, Oct 2023, IF: 0.7. Chatterjee, B.C.♦, Ahmed, I., Wadud, A., Maity, M., and Oki, E., “BPRIA: Crosstalk-Avoided Bi-Partitioning-Based Counter-Propagating Resource Identification and Allocation for Spectrally-Spatially Elastic Optical Networks,” IEEE Transactions on Network and Service Management, vol. 19, no. 4, pp. 4369-4383, 2022, IF: 5.3. Takeda, K., Sato, T., Chatterjee, B.C., and Oki, E., “Joint Inter-Core Crosstalk- and Intra-Core Impairment-Aware Lightpath Provisioning Model in Space-Division Multiplexing Elastic Optical Networks,” IEEE Transactions on Network and Service Management, vol. 19, no. 4, pp. 4323-4337, 2022, IF: 5.3 Chatterjee, B.C.♦, Basavaprabhu, S., and Oki, E., “BPA: Approximation Batch-Processing Algorithm for Static Lightpath Requests in Elastic Optical Networks,” IEEE Networking Letters, vol. 4, no. 4, pp. 189-193, 2022. Jana, R.K., Chatterjee, B.C., Singh, A.P., Srivastava, A., Mukherjee, B., Lord, A., and Mitra, A., “Quality-Aware Resource Provisioning for Multiband Elastic Optical Networks: A Deep Learning-Assisted Approach,” IEEE/OSA Journal of Optical Communications and Networking, vol. 14, no. 11, pp. 882-893, 2022, IF: 5.0. Halder, J., Maity, M., Oki, E., and Chatterjee, B.C.♦, “Shared Backup Path Protection-Based Resource Allocation Considering Inter-Core and Inter-Mode Crosstalk for Spectrally-Spatially Elastic Optical Networks,” IEEE Communications Letters, vol. 26, no. 3, pp. 637-641, 2022, IF: 4.1 Jana, R.K., Chatterjee, B.C., Singh, A.P., Srivastava, A., Mukherjee, B., Lord, A., and Mitra, A., “Machine Learning-Assisted Nonlinear-Impairment-Aware Proactive Defragmentation for C+L Band Elastic Optical Networks,” IEEE/OSA Journal of Optical Communications and Networking, vol. 14, no. 3, pp. 56-68, 2022, IF: 5.0 Bao, B., Yang, H., Yao, Q., Yu, A., Chatterjee, B.C., Oki, E., and Zhang, J. “SDFA: A Service-Driven Fragmentation-Aware Resource Allocation in Elastic Optical Ne",
  "content_length": 40940,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:52"
}