{
  "name": "Billy Bob Brumley",
  "homepage": "https://www.rit.edu/directory/bbbics-billy-brumley",
  "status": "success",
  "content": "Billy Brumley | RIT RIT Logo with Text Billy Brumley Kevin O'Sullivan Professor Department of Cybersecurity Golisano College of Computing and Information Sciences Department of Cybersecurity Director of Research, GCI Kevin O'Sullivan Endowed Professor in Cybersecurity bbbics@rit.edu Office Location GOL-3783 Office Mailing Address Cybersecurity Hall 70-1770, 100 Lomb Memorial Drive, Rochester, NY 14623 Billy Brumley Kevin O'Sullivan Professor Department of Cybersecurity Golisano College of Computing and Information Sciences Department of Cybersecurity Director of Research, GCI Kevin O'Sullivan Endowed Professor in Cybersecurity Education Sc.D., Aalto University Bio A native Texan, Bill Brumley received his doctorate from Aalto University (Helsinki, Finland) in 2012. He is a former Staff Engineer for Qualcomm's Product Security Initiative (QPSI) in San Diego, California. He is a 2018 European Research Council (ERC) Starting Grant Laureate. Before joining RIT, he spent a decade as a Professor at Tampere University (Finland). He specializes in system security, cryptography engineering, and side-channel analysis. bbbics@rit.edu Personal Links ORCID Publication Database Google Scholar Areas of Expertise System Security Cryptography Engineering Side-Channel Analysis Currently Teaching CSEC-522Side Channel Analysis3 CreditsSide-channel analysis (SCA) is an offensive security technique that targets not the formal description of a security-critical system, but the implementation of it. Examples of side channels include—but are not limited to—latency measurements, power consumption, electro-magnetic radiation, and acoustic emanations. This is a young but very active field within applied computer security. Modern processors are equipped with numerous features to improve the average performance of software, including—but not limited to—low-latency execution pipelines, various caches, prediction, speculative execution, and multi-layered parallelism. These mechanisms can often be used as side channels to attack implementations of security-critical systems by using leakage to recover critical data or state that should remain secret. This course provides an overview of these modern SCA concepts, explains how to establish and construct these channels, demonstrates how to apply SCA techniques, and furthermore basic methods to prevent them.CSEC-535Open Source Software Security3 CreditsThe Free and Open-Source Software (FOSS) movement promotes the principles of software freedom, collaboration, and innovation, allowing users to access, modify, and share software without restrictions. FOSS is good for software security because it promotes transparency, allowing anyone to review the source code for vulnerabilities and ensuring that security flaws are more likely to be discovered and fixed quickly: \"given enough eyeballs, all bugs are shallow\" –Eric S. Raymond (Linus's law) In this course, we use OpenSSL—one of the most security-critical FOSS projects of our time—as a case study on the evolution of an FOSS project in response to vulnerabilities reported by security researchers. We study, discuss, and present their discovery, potential exploitation, mitigation, and disclosure. We also learn how to effectively contribute to FOSS projects.CSEC-599Independent Study in CSEC1 - 6 CreditsStudents will work with a supervising faculty member on a project of mutual interest. Project design and evaluation will be determined through discussion with the supervising faculty member and documented through completion of an independent study form to be filed with the department of computing security.CSEC-622Side Channel Analysis3 CreditsSide-channel analysis (SCA) is an offensive security technique that targets not the formal description of a security-critical system, but the implementation of it. Examples of side channels include—but are not limited to—latency measurements, power consumption, electro-magnetic radiation, and acoustic emanations. This is a young but very active field within applied computer security. Modern processors are equipped with numerous features to improve the average performance of software, including—but not limited to—low-latency execution pipelines, various caches, prediction, speculative execution, and multi-layered parallelism. These mechanisms can often be used as side channels to attack implementations of security-critical systems by using leakage to recover critical data or state that should remain secret. This course provides an overview of these modern SCA concepts, explains how to establish and construct these channels, demonstrates how to apply SCA techniques, and furthermore basic methods to prevent them. Students will also be exposed to current literature covering research in side-channel analysis. Students will program in C and need a strong understanding of the design of modern computer architectures.CSEC-635Open Source Software Security3 CreditsThe Free and Open-Source Software (FOSS) movement promotes the principles of software freedom, collaboration, and innovation, allowing users to access, modify, and share software without restrictions. FOSS is good for software security because it promotes transparency, allowing anyone to review the source code for vulnerabilities and ensuring that security flaws are more likely to be discovered and fixed quickly: \"given enough eyeballs, all bugs are shallow\" –Eric S. Raymond (Linus's law) In this course, we use OpenSSL—one of the most security-critical FOSS projects of our time—as a case study on the evolution of an FOSS project in response to vulnerabilities reported by security researchers. We study, discuss, and present their discovery, potential exploitation, mitigation, and disclosure. We also learn how to effectively contribute to FOSS projects and we will explore vulnerability lifecycles of past open source software vulnerabilities.CSEC-799Independent Study1 - 3 CreditsThe graduate independent study offers students the opportunity to investigate a topic not covered in an available course in the MS program in conjunction with a faculty sponsor. Working cooperatively, the faculty sponsor and the student draft a proposal of the work to be completed, the deliverables expected from the student, the number of credits assigned, and the means by which the student’s work will be evaluated. The proposal must be approved by the graduate program director before a student can be registered for independent study. In the News September 18, 2024 Two faculty members installed as Kevin O’Sullivan Endowed Professors in Cybersecurity Billy Brumley and Matthew Wright were appointed for their work in building RIT’s cybersecurity education and research legacy. As one of the highest honors in academia, endowed professorships recognize and support outstanding researchers and educators who profoundly impact the lives of their students. April 5, 2024 New study investigates illegal child sexual abuse material and anonymity on Tor network With the help of multidisciplinary researchers from around the globe, Billy Brumley is investigating the availability of child sexual abuse material (CSAM) in order to better understand and combat its widespread dissemination. November 17, 2023 Billy Brumley named new Endowed Professor in Cybersecurity Billy Brumley has been named the Kevin O’Sullivan Endowed Professor in Cybersecurity at RIT. As part of RIT’s ESL Global Cybersecurity Institute and Golisano College of Computing and Information Sciences, Brumley will contribute to the university’s growing cybersecurity research profile and lead expertise in side-channel attack analysis. November 21, 2025 Brumley presents at OpenSSL Conference More News Search RIT Close  X This website uses cookies to provide better user experience and functionality. You can control and configure cookies in your web browser. Cookie Statement | How to Disable Cookies OK",
  "content_length": 7902,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:00"
}