{
  "name": "Bimal Kumar Roy",
  "homepage": "https://www.isical.ac.in/~bimal",
  "status": "success",
  "content": "Bimal Kumar Roy Professor, Applied Statistics Unit, Indian Statistical Institute, Kolkata Head, Cryptology Research Group, Indian Statistical Institute, Kolkata Founder and General-Secretary, Cryptology Research Society of India Address Applied Statistics Unit Indian Statistical Institute 203 Barackpore Trunk Road Kolkata, West Bengal, India 700108 Office Applied Statistics Unit, Eighth Floor S N Bose Building (Library Building) Phone +91 (33) 2575 2809 (office) Fax +91 (33) 2578 5260 (office) Email bimal@isical.ac.in Website http://www.isical.ac.in/~bimal Educational Qualifications Ph.D. in Combinatorics from University of Waterloo, Canada, in 1982. Master of Statistics from Indian Statistical Institute, Kolkata, in 1979. Bachelor of Statistics from Indian Statistical Institute, Kolkata, in 1978. Academic Positions Professor, Applied Statistics Unit, Indian Statistical Institute since 1997. Head, R C Bose Centre for Cryptology and Security, ISI Kolkata, 2015-2021. Director, Indian Statistical Institute, 2010-2015. Associate Prof., Dept. of Computer Science, State University of USA, 1990-1991. Associate Prof., Computer Science Unit, Indian Statistical Institute, 1989-1997. Lecturer, Computer Science Unit, Indian Statistical Institute, 1984-1989. Assistant Prof., Dept. of Computer Science, SUNY at Utica, 1982-1984. For further details, check my Curriculum Vitae (in PDF format). Padma Shri Award, Government of India, 2015. Teacher’s Award, Indian National Science Academy, 2014. Fellow, Indian Society for Probability and Statistics, since 2014. Fellow, National Academy of Sciences, India, since 2010. Reliance Platinum Jubilee Award, National Academy of Science, India, 2007. IBM Faculty Award for research, teaching and initiative in Cryptology, 2007. Chairman, Steering Board, Indo-French Centre for Applied Mathematics (IFCAM), Department of Science and Technology, Government of India and The National Center for Scientific Research, Government of France, since 2013. Member, Scientific Council, Indo-French Centre for the Promotion of Advanced Research (CEFIPRA), Department of Science and Technology, Government of India and Ministry of Foreign Affairs, Government of France, since 2013. Member, India-Japan Science Council, Department of Science and Technology (DST), Government of India, since 2013. Board Member, National Board for Higher Mathematics (NBHM), since 2012. Member, UNESCO Technical Advisory Committee, Asia-Pacific, since 2009. Member, Program Advisory Committee for Mathematical Sciences, Department of Science and Technology (DST), Government of India, 2007–2012. Adviser for Secure Wireless Communication, Special Protection Group (SPG), Government of India, 2006–2007. Member, Technical Advisory Committee for Surveys, Reserve Bank of India (RBI), Government of India, since 2007-2015. Member, Governing Council, National Sample Survey Organization (NSSO), Government of India, 2002–2006. Member, Board for Security and Assurance, National Association of Software and Service Companies (NASSCOM), since 2004. Founder-Secretary, Cryptology Research Society of India, since inception in 2001. Member, International Association for Cryptologic Research, since 2000. Editorial Responsibilities Associate Editor, Journal of Ad Hoc & Sensor Wireless Networks. Associate Editor, Journal of Wireless Sensor Networks. Associate Editor, Research & Reviews: Journal of Statistics. My primary research interest involves all aspects of Statistics and its applications. Currently I am working on Combinatorics, and application of Statistics in Cryptology and Design of Experiments. Supervised thirteen (13) PhD theses in four different technical areas -- 3 in Statistics, 7 in Computer Science, 1 in Mathematics and 2 in Statistical Applications. PhD Students Srimanta Bhattacharyya Mrinal Nandi (Graduated 2015) Vignesh T S (Graduated 2015) Samiran Bag (Graduated 2015) Rishiraj Bhattacharyya (Graduated 2011) Sushmita Ruj (Graduated 2009) Dibyendu Chakrabarti (Graduated 2008) Amir Hossain (Graduated 2008 from Jadavpur University) Mridul Nandi (Graduated 2005) Avishek Adhikari (Graduated 2004) Soumen Maiti (Graduated 2001) Subhamoy Maitra (Graduated 1999) Tridib Dutta (Graduated 1992) Dipankar Basu (Graduated 1991 from Jadavpur University) Teaching has always been my passion, and I love teaching various courses on Statistics, Combinatorics and Cryptography at the Bachelors and Masters level. Taught at Indian Statistical Institute for over 30 years, since 1984. Taught at almost all degree courses offered at the Institute – B.Stat., M.Stat., M.Math., M.Tech.(CS), M.Tech.(QR&OR) and M.S.(QE) – at almost every possible level. Taught more than 60 courses, including almost all courses related to Statistics and Computer Science offered at all undergraduate and postgraduate levels of the Institute. Pioneered Cryptology education in India. Taught the subject through numerous courses, lectures, popular talks, seminars and workshops, and promoted this niche subject area. Supervised over fifty (50) Masters dissertations in four different technical areas -- Master of Statistics, Master of Mathematics, Master of Technology in Computer Science, and Master of Technology in Quality, Reliability and Operations Research. High budget projects in Cryptology Principal Investigator in all the following projects. Centre of Excellence in Cryptology, funded by Defence Research and Development Organization, 2011–2016. Strategic Japanese-Indian Co-operative Program on Multidisciplinary Research Field which combines Information and Communications Technology with Other Fields, 2009–2012. Research and development of Cryptographic Primitives, funded by Depart- ment of Information Technology, 2006–2011. Evaluation of a stream cipher designed by KDDI, Tokyo, Japan, 2006–2007. Development of pairing based cryptographic protocols, funded by Depart- ment of Information Technology, 2003–2006. Cryptanalysis of complex LFSR based stream ciphers, funded by Scientific Analysis Group, Defence Research and Development Org., 2000–2002. Cryptanalysis of LFSR based stream ciphers, funded by Defence Research and Development Organization, 1998–2000. Other projects in Cryptology Principal Investigator in all the following projects. Construction of Universal One-Way Hash Functions, funded by WESEE, Indian Navy, 2005–2006. Study of connection polynomials over GF(2^k), funded by CAIR, Defence Research and Development Organization, 2005–2006. Development of visual cryptographic schemes, funded by WESEE, Indian Navy, 2005–2006. Development of visual cryptographic schemes, funded by ADRIN, Indian Space Research Organization, 2002–2004. Study of connection polynomials over GF(2), funded by CAIR, Defence Research and Development Organization, 2001–2002. Development of indigenous stream cipher for Indian Navy, funded by WESEE, In- dian Navy, 2001–2002. Construction of Boolean functions with cryptographic properties, funded by CAIR, Defence Research and Development Organization, 2000–2001. Design of new stream cipher, funded by SHOGHI. Design of self-synchronizing stream cipher, funded by Sutech. Sponsored projects in Statistics Member of a project on Methods for Estimating Tiger Population in the Sunderbans, funded by the Government of West Bengal, 2006–2007. Member of a project on Methods for Estimating Elephant Population in Jal- dapara funded by the Government of West Bengal, 2006–2007. Member of a project on Life Distribution of Currency Notes, funded by the Reserve Bank of India, 2002–2003. Principal investigator of a project on Tracer Study of ITI Trainees, funded by Directorate General (Education and Training), 1994–1996. Principal investigator of a project on Rural Indebtedness, funded by the Reserve Bank of India, 1993–1995. Principal investigator of a project on Garbage Management of Calcutta Municipal Corporation, funded by Calcutta Municipal Corporation, 1989–1990. Published around forty (40) papers in refereed Journals; around twenty (20) book chapters, including proceedings for International Conferences; with over twenty (20) papers in Cryptology and Information Security, in reputed International Conferences and Journals. For a detailed list of my publications, check my Curriculum Vitae (in PDF format). Check my DBLP Profile for a select list of publications in Cryptology/Computer Science. Edited Volumes Bimal K. Roy and Nicolas Sendrier (editors). Progress in Cryptology – INDOCRYPT 2009. Lecture Notes in Computer Science, Volume 5922, Springer 2009. D.K. Ray-Chaudhuri, A.R. Rao, and Bimal K. Roy (editors). R. C. Bose Centen- nial Symposium on Discrete Mathematics and Applications. Discrete Mathematics (Special Edition), Volume 306, Issue 14, Elsevier 2006. Bimal K. Roy (editor). Advances in Cryptology – ASIACRYPT 2005. Lecture Notes in Computer Science, Volume 3788, Springer 2005. Bimal K. Roy and Willi Meier (editors). Fast Software Encryption – FSE 2004. Lecture Notes in Computer Science, Volume 3017, Springer 2004. Bimal K. Roy and Eiji Okamoto (editors). Progress in Cryptology – INDOCRYPT 2000. Lecture Notes in Computer Science, Volume 1977, Springer 2000. Bimal K. Roy (editor). Special Issue on Cryptology Journal of the Indian Statistical Association, Volume 42, 2004.",
  "content_length": 9331,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:59"
}