{
  "name": "Bin Jiang 0006",
  "homepage": "http://csee.hnu.edu.cn/people/jiangbin",
  "status": "success",
  "content": "蒋斌-湖大信息科学与工程学院 教师登录 English 返回首页 学院概况 学院简介 学院领导 师资力量 机构设置 决策机构 教学单位 计算机科学系 软件工程系 通信工程系 信息工程系 计算机工程系 网络空间安全系 实验中心 基础教学部 研究机构 特色学院 条件装备 办事机构 人才培养 本科培养 研究生培养 博士生培养 留学生培养 学科专业方向 科学研究 科研项目 科研成果 成果转化 学术信息 工作流程 招生就业 本科招生 硕士招生 博士招生 学生就业 实习就业基地 学生工作 学生动态 学生党建 团学工作 日常管理 心理健康 奖励工作 社团组织 党群工作 党建工作 工会工作 关工委工作 学术资源 资源管理系统 精品课程 实验仪器设备 蒋斌 我的位置在： 首页 > 学院概况 > 师资力量 > 蒋斌 教师介绍 蒋斌，湖南邵阳人，教授，博士生导师，计算机工程系主任。日本国东京工业大学工学博士、外国人特别研究员。CCF高级会员，ACM、IEEE会员，中国计算机学会大数据专家委员会（TFBD）专家委员，中国计算机学会协同计算专业委员会（TCCC）委员，中国计算机学会计算机应用专业委员会（TCAPP）委员，中国人工智能学会（CAAI）会员，教育部学位与研究生教育评估专家，北京市自然科学基金评审专家，湖南省科技咨询与评审专家，湖南省工业机器视觉工程技术研究中心专家指导委员，长沙市工业科技特派员，邵阳市人民政府科技经济顾问，株洲市网络安全和信息化专家。通信地址：湖南省长沙市岳麓区湖南大学信息科学与工程学院（410082）Email：jiangbin@hnu.edu.cnjiangbinedu@gmail.com 中文名： 蒋斌 英文名： 学历： 博士 职称： 教授 联系电话： 电子邮件： jiangbin@hnu.edu.cn 研究方向： 人工智能，大数据技术，机器视觉，机器学习，自然语言处理，智能计算，推荐系统，社会计算 联系地址： 湖南大学信息科学与工程学院 所属机构： 计算机工程系 学院教师 个人简历 Professor, Ph.D.  JIANG, Bin, Doctoral SupervisorHe is the director of Department of Computer Engineering, College of Computer Science and Electronic Engineering, Hunan University, China.He received his B.S. and B.E. degrees, M.E. degree both from Hunan University (HNU), China, and had the Doctor of Engineering Degree from Tokyo Institute of Technology (Tokyo TECH), Japan.During 2002 and 2003, he worked at the KISTEM Co., Ltd (Key Information System, Gate-Group), Japan as trainee.His research interests include Artificial Intelligence, Big Data Technology, Machine Vision, Machine Learning, Natural Language Processing, Intelligent Computing, Recommender System, Social Computing and etc.He is a member of CCF, CAAI, IEEE, ACM and etc.--------------------------------蒋斌 (ショウ ビン) 教授は、博士論文指導教授です。中国湖南大学（こなん だいがく）理工学部を卒業、同大学情報工学科修士課程を修了。日本国東京工業大学（とうきょう こうぎょう だいがく）の工学博士を取得し、現在は中国湖南大学情報科学と工程学院コンピューター工程専攻の専攻長である。2002年から2003年にかけて、日本国キステム株式会社の研修生として勤務。取り組んでいる研究として、人工知能、ビッグデータ技術、マシンビジョン、機械学習、自然言語処理、進化計算、レコメンダシステム、ソーシャルコンピューティングが挙げられる。?CCF、CAAI、IEEE、ACMなどに所属。 研究领域 本研究室招收计算机科学与技术（学术型）、计算机技术（专业型）及软件工程（专业型）硕士同时招收计算机科学与技术博士、工程博士及博士后--------------------------------人工智能，大数据技术，机器视觉，机器学习，自然语言处理，智能计算，推荐系统，社会计算--------------------------------Artificial Intelligence, Big Data Technology, Machine Vision, Machine Learning, Natural Language Processing, Intelligent Computing, Recommender System, Social Computing and etc.--------------------------------人工知能、ビッグデータ技術、マシンビジョン、機械学習、自然言語処理、進化計算、レコメンダシステム、ソーシャルコンピューティングなど 主讲课程 本科生课程：算法设计与分析 [课程网页]                    计算的智能 [课程网页]                    机器学习 [课程网页]研究生课程：智能优化算法（英文）[课程网页] [湖南省研究生优质课程]留学生课程：Intelligent Optimization Algorithms [Course Website] [Excellent Postgraduate Courses in Hunan Province]                      Discrete Mathematics and Its Applications [Course Website] 学术合作 1. 袁浚菘（Junsong Yuan）副教授    纽约州立大学布法罗分校（University at Buffalo, the State University of New York，UB）    URL：https://cse.buffalo.edu/~jsyuan/2. 洪西进（Shin-Jinn Horng）教授    台湾科技大学（National Taiwan University of Science and Technology，NTUST）    URL：http://140.118.155.58/3. 周晓康（Xiaokang Zhou）副教授    日本国立滋贺大学（Shiga University） 日本理化学研究所（RIkagaku KENkyusho，RIKEN）革新智能综合研究中心 客座研究员    URL：https://researchmap.jp/7000001724/4. 王诗菡（Shihan Wang）助理教授    荷兰乌得勒支大学（Utrecht University，UU）    URL：https://www.uu.nl/staff/SWang2 学术论文 - 2025-1.  Jianbo Zheng, Chao Yang(*), Tairui Zhang, Longbing Cao, Bin Jiang, Xuhui Fan, Xiao-Ming Wu, Xianxun Zhu. Dynamic Spectral Graph Anomaly Detection, Proc. of the 39th AAAI Conference on Artificial Intelligence (AAAI 2025), February 25 - March 4, 2025, Philadelphia, Pennsylvania, USA. (CCF A)(to appear?)2.  Jianbo Zheng, Chao Yang(*), Tairui Zhang, Bin Jiang, Xuhui Fan, Xiao-Ming Wu, Haidong Shao. PeriodicMFD: A Periodic-based Framework for Multi-source Fault Diagnosis, IEEE Transactions on Transportation Electrification, 2025. DOI: 10.1109/TTE.2024.3525077. (SCI JCR 1#) [PDF]3.  Jianbo Zheng, Lida Huang, Tairui Zhang, Bin Jiang, Chao Yang. Subdomain Uncertainty Optimization for Cross-Speed Fault Diagnosis, Proc. of IEEE International Conference on Multimedia and Expo (ICASSP 2025), April 6- 11, 2025, Philadelphia, Pennsylvania, USA. (CCF B)(to appear)- 2024-1.  Zhiyu Wang, Chao Yang, Bin Jiang, Junsong Yuan. A Dual Reinforcement Learning Framework for Weakly Supervised Phrase Grounding, IEEE Transactions on Multimedia, 2024, 26: 394-405. DOI: 10.1109/TMM.2023.3265816. (SCI JCR 1#) [PDF]2.  Qiao Li, Bin Jiang(*), Xiaochen Bo, Chao Yang, Xu Wu. DANet: A Domain Alignment Network for Low-Light Image Enhancement, Electronics, 2024, 13(15): 2954. DOI: 10.3390/electronics13152954. (SCI JCR 3#) [PDF]3.  Haotian Hu, Bin Jiang(*), Chao Yang, Xinjiao Zhou, Xiaofei Huo. ScribbleEditor: Guided Photo-realistic and Identity-preserving Image Editing with Interactive Scribble, Proc. of IEEE International Conference on Multimedia and Expo (ICME 2024), July 15-19, 2024, Marriott on the Falls, Niagara Falls, Canada. (CCF B)4.  Jianbo Zheng, Bin Jiang(*), Chao Yang. Proportional periodic sampling for cross-load bearing fault diagnosis, International Journal of Machine Learning and Cybernetics, 2024. DOI: 10.1007/s13042-024-02233-0. (SCI JCR 2#) [PDF]5.  Md. Yousuf Ali, Bin Jiang, Oindrila Chowdhury, Md. Harun-Ar-Rashid, M. Shamim Hossain, Khalid AlMutib. Cosine Modulated Filter Bank-Based Architecture for Extracting and Fusing Saliency Features, Expert Systems, 2024, 41(3): e13508. DOI: 10.1111/exsy.13508. (SCI JCR 2#) [PDF]6.  Bin Jiang(*), Renjun Wang, Jiawu Dai, Qiao Li, Weiyuan Zeng. FBGAN: Multi-Scale Feature Aggregation Combined with Boosting Strategy for Low-light Image Enhancement, Visual Computer, 2024, 40: 1745-1756. DOI: 10.1007/s00371-023-02883-1. (SCI JCR 2#) [PDF]- 2023-1.  Zhiyu Wang, Chao Yang(*), Bin Jiang, Junsong Yuan. A Dual Reinforcement Learning Framework for Weakly Supervised Phrase Grounding, IEEE Transactions on Multimedia, 2023. DOI: 10.1109/TMM.2023. 3265816. (SCI JCR 1#) [PDF]2.  Xinjiao Zhou, Bin Jiang(*), Chao Yang, Xiaofei Huo, Haotian Hu. DF-CLIP: Towards Disentangled and Fine-grained Image Editing From Text, Proc. of IEEE International Conference on Multimedia and Expo (ICME 2023), July 10-14, 2023, Brisbane, Australia. DOI: 10.1109/ICME55011.2023.00106. (CCF B) [PDF]3.  Lin Sun, Chao Yang(*), Bin Jiang. DSP-Net: Diverse Structure Prior Network for Image Inpainting, Proc. of IEEE International Conference on Multimedia and Expo (ICME 2023), July 10-14, 2023, Brisbane, Australia. DOI: 10.1109/ICME55011.2023.00088. (CCF B) [PDF]4.  Minyu Sun, Bin Jiang(*), Chao Yang. Dynamic Dense-Sparse Representations for Real-Time Question Answering, Proc. of IEEE International Conference on Multimedia and Expo (ICME 2023), July 10-14, 2023, Brisbane, Australia. DOI: 10.1109/ICME55011.2023.00250. (CCF B) [PDF]5.  Bin Jiang(*), Weiyuang Zeng, Chao Yang, Renjun Wang, Bolin Zhang. DE-GAN: Text-to-Image Synthesis with Efficient Fusion Model, Multimedia Tools and Applications, 2023. DOI: 10.1007/s11042-023-16377-8. (SCI JCR 3#) [PDF]6.  Lin Sun, Bin Jiang(*), Chao Yang, Jiawu Dai, Weiyuan Zeng. RePGAN: Image Inpainting via Residual Partial Connection and Mask Discriminator, International Journal of Machine Learning and Cybernetics, 2023. DOI: 10.1007/s13042-023-01827-4. (SCI JCR 2#) [PDF]7.  Xiaofei Huo, Bin Jiang(*), Haotian Hu, Xinjiao Zhou, Bolin Zhang. OSAGGAN: One-Shot Unsupervised Image-to-Image Translation using Attention-Guided Generative Adversarial Networks, International Journal of Machine Learning and Cybernetics, 2023. DOI: 10.1007/s13042-023-01844-3. (SCI JCR 2#) [PDF]8.  Qun Zhang, Bin Jiang(*), Bolin Zhang, Chao Yang. CMGN: Cross-Modal Grounding Network for Temporal Sentence Retrieval in Video. Proc. of the 18th CCF Conference on Computer Supported Cooperative Work and Social Computing (ChineseCSCW 2023), August 18-20, 2023, Harbin, China. DOI: 10.1007/978-981-99-9640-7_19. [PDF]- 2022-1.  Bolin Zhang, Chao Yang(*), Bin Jiang, Xiaokang Zhou. Video Moment Retrieval with Hierarchical Contrastive Learning, Proc. of ACM International Conference on Multimedia (ACM MM 2022), October 10-14, 2022, Lisbon, Portugal. DOI: 10.1145/3503161.3547963. (CCF A) (多媒体领域顶级会议) [PDF]2.  Bin Jiang(*), Wei Huang, Chao Yang, Yun Huang. Image Inpainting based on Cross-Hierarchy Global and Local Aware Network, Multimedia Tools and Applications, 2022. DOI: 10.1007/s11042-022-14245-5. (SCI JCR 3#) [PDF]3.  Qiao Li, Bin Jiang(*), Xiaochen Bo, Chao Yang, Xu Wu. Effective Low-Light Image Enhancement with Multiscale and Context Learning Network, Multimedia Tools and Applications, 2022. DOI: 10.1007/s11042-022-13830-y. (SCI JCR 3#) [PDF]4  Haotian Hu, Bin Jiang(*), Xiaofei Huo, Xinjiao Zhou, Bolin Zhang. Unsupervised Discovery of Disentangled Interpretable Directions for Layer-wise GAN, book in Communications in Computer and Information Science, Volume 1709 CCIS: 21-39, 2022. DOI: 10.1007/978-981-19-8331-3_2. [PDF]5.  Bolin Zhang, Bin Jiang, Chao Yang(*), Liang Pang. Dual-Channel Localization Networks for Moment Retrieval with Natural Language, Proc. of ACM International Conference on Multimedia Retrieval (ICMR 2022), June 27-30, 2022, Newark, NJ, USA. DOI: 10.1145/3512527.3531394. (CCF B) (多媒体检索领域会议) [PDF]6.  Bin Jiang(*), Jiawu Dai, Weiyuang Zeng, Renjun Wang. Diverse Image Colorizaiton via Deep Color Prior and Triplet Latent Regularization, Proc. of IEEE International Conference on Multimedia and Expo (ICME 2022), July 18-22, 2022, Taipei, Taiwan. DOI: 10.1109/ICME52920.2022.9859969. (CCF B) [PDF]7.  Jianbo Zheng, Chao Yang, Fangrong Zheng, Bin Jiang(*). A Rolling Bearing Fault Diagnosis Method Using Multi-Sensor Data and Periodic Sampling, Proc. of IEEE International Conference on Multimedia and Expo (ICME 2022), July 18-22, 2022, Taipei, Taiwan. DOI: 10.1109/ICME52920.2022.9859658. (CCF B) [PDF]8.  Guoqing Wang, Chao Yang, Su Feng, Bin Jiang. LPGN: Language-Guided Proposal Generation Network for Referring Expression Comprehension, Proc. of IEEE International Conference on Multimedia and Expo (ICME 2022), July 18-22, 2022, Taipei, Taiwan. DOI: 10.1109/ICME52920.2022.9859830. (CCF B) [P",
  "content_length": 31052,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:59"
}