{
  "name": "Bin Xu 0001",
  "homepage": "http://keg.cs.tsinghua.edu.cn/persons/xubin",
  "status": "success",
  "content": "About me - Bin Xu 许斌 Bin Xu Professor at Tsinghua University Follow Beijing, China Email (010)62771736 Google Scholar I am a professor in Department of Computer Science and Technology of Tsinghua University. I obtained my Ph.D., master and bachelor in Tsinghua University in 2006, 1998 and 1996 respectively. I am a member of Knowledge Engineering Group, working on exciting areas of artificial intelligence. I am very honored to work with Prof. Juanzi LI, Prof. Jie Tang, Prof. Yuxiao Dong, Prof. Lei Hou in the same research group. Research Interests Large Language Model, Knowledge Graph, Artificial Intelligence Address Department of Computer Science and Technology, Tsinghua University, Beijing, 100084. China PR. Titles Distinguished Member of CCF Honorary Chair of CCF Technical Committee of Computer Applications Chair of IEEE P2807.6 Educational Knowledge Graph Working Group Director of Knowledge Modeling and Analysis Laboratory in National Engineering Research Center of Cyberlearning and Intelligent Technology Highlighted Publications Please refer to my publications or my Google Scholar for the full list. Yunjia Qi*, Hao Peng*, Xiaozhi Wang, Youfeng LIu, Amy Xin, Bin Xu, Lei Hou, and Juanzi Li. AGENTIF: Benchmarking instruction following of large language models in agentic scenarios. NeurIPS 2025 (Spotlight paper)[code][pdf] Xujia Wang, Yunjia Qi, Bin Xu. LoSiA: Efficient High-Rank Fine-Tuning via Subnet Localization and Optimization. EMNLP 2025[code][pdf] Yucheng Wang*, Jifan Yu*, Daniel Zhang-Li, Shangqing Tu, Haoxuan Li, Zhiyuan Liu, Huiqin Liu, Lei Hou, Bin Xu. EduCraft: A System for Generating Pedagogical Lecture Scripts from Long-Context Multimodal Presentations. CIKM 2025[code][pdf] Yunjia Qi, Hao Peng, Xiaozhi Wang, Bin Xu, Lei Hou, Juanzi Li. ADELIE: Aligning Large Language Models on Information Extraction. EMNLP 2024[code][pdf] Weihan Wang, Qingsong Lv, Wenmeng Yu, Wenyi Hong, Ji Qi, Yan Wang, Junhui Ji, Zhuoyi Yang, Lei Zhao, Song XiXuan, Jiazheng Xu, Keqin Chen, Bin Xu, Juanzi Li, Yuxiao Dong, Ming Ding, Jie Tang. CogVLM: Visual expert for pretrained language models. NeurIPS 2024[code][pdf] Jifan Yu, Xiaozhi Wang, Shangqing Tu, Shulin Cao, Daniel Zhang-Li, Xin Lv, Hao Peng, Zijun Yao, Xiaohan Zhang, Hanming Li, Chunyang Li, Zheyuan Zhang, Yushi Bai, Yantao Liu, Amy Xin, Nianyi Lin, Kaifeng Yun, Linlu Gong, Jianhui Chen, Zhili Wu, Yunjia Qi, Weikai Li, Yong Guan, Kaisheng Zeng, Ji Qi, Hailong Jin, Jinxin Liu, Yu Gu, Yuan Yao, Ning Ding, Lei Hou, Zhiyuan Liu, Bin Xu, Jie Tang, Juanzi Li. KoLA: Carefully Benchmarking World Knowledge of Large Language Models. ICLR 2024[code][pdf] Ji Qi, Chuchun Zhang, Xiaozhi Wang, Kaisheng Zeng, Jifan Yu, Jinxin Liu, Jiuding Sun, Yuxiang Chen, Lei Hou, Juanzi Li, Bin Xu. Preserving Knowledge Invariance: Rethinking Robustness Evaluation of Open Information Extraction. EMNLP 2023 (Outstanding Paper Award)[code][pdf] Professional Services General Chair of 2025 CCF 40th National Conference of Computer Applications General Chair of 2024 China Conference on Knowledge Graph and Semantic Computing and International Joint Conference on Knowledge Graphs Awards 2020 The Second Prize of the National Science and Technology Progress Award 2020 Outstanding scientific research achievement award by Chinese Association for Artificial Intelligence 2017 The First Prize of the Beijing Science and Technology Progress Award 2017 Silver Medal of International Exhibition of Inventions of Geneva 45th 2016 Gold Medal of International Exhibition of Inventions (Kunshan) 9th 2009 First Runner-up Team of Semantic Composition in Web Services Challenge (CEC '09) 2008 First Place Team of Semantic Composition in Web Services Challenge (CEC/EEE 2008) 2007 First Place Team of Semantic Composition in Web Services Challenge (CEC/EEE 2007) 2006 First Place Team of Syntactic Composition in Web Services Challenge (CEC 2006) 2005 Java Champion elected by Sun Microsystems",
  "content_length": 3941,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:00"
}