{
  "name": "Bin Wang 0004",
  "homepage": "http://people.ucas.ac.cn/~wangbin",
  "status": "success",
  "content": "王斌-中国科学院大学-UCAS [中文] [English] 教育背景 工作经历 教授课程 出版信息 基本信息 王斌  男  博导(客座)电子邮件： wangbin@iie.ac.cn通信地址： 北京市海淀区西二旗中路小米科技园邮政编码： 100085 研究领域 信息检索；自然语言处理；数据挖掘 教育背景 1996-09--1999-07   中国科学院计算技术研究所   博士1993-09--1996-07   武汉大学计算机科学系   硕士1989-09--1993-07   武汉大学计算机科学系   学士 学历 中国科学院计算技术研究所 19960901--19990701 博士研究生毕业 武汉大学计算机科学系          19930901--19960701 硕士研究生毕业 武汉大学计算机科学系          19890901--19930701 本科毕业 学位 中国科学院计算技术研究所 19960901--19990701 工学博士学位 武汉大学计算机科学系          19930901--19960701 工学硕士学位 武汉大学计算机科学系          19890901--19930701 理学学士学位 出国学习工作 爱尔兰都柏林城市大学   20040701-20041225  国家留学基金委高级访问学者 工作经历 工作简历 2018-08~现在, 小米科技责任有限公司, AI实验室主任2014-09~2018-08,中国科学院信息工程研究所, 研究员1999-07~2014-08,中国科学院计算技术研究所, 助研、副研 社会兼职 2017-09-14-2017-12-01,WWW2018 PC, 2017-03-01-2017-08-25,SIGIR2017PC, 2017-02-03-2017-08-25,CIKM2017 PC, 2016-03-01-2016-04-08,SIGIR2016PC, 2015-10-01-今,中国科学院大学岗位教授, 2015-03-01-2015-06-01,ACL2015PC, 2015-02-01-2015-05-01,SIGIR2015PC, 2014-09-25-今,中国中文信息学会语言与知识计算专委会委员, 2014-03-01-2014-06-01,ACL2014 PC, 2014-02-01-2014-05-01,SIGIR2014 PC, 2013-03-01-2013-08-01,AIRS2013 Area Co-chair, 2013-01-01-2013-06-01,ACL2013 PC, 2012-10-01-今,中国中文信息学会社会媒体处理专委会常务委员, 2012-03-01-2013-08-01,AIRS2012 Area Co-chair, Area Co-chair2011-12-01-今,中国中文信息学会理事, 2010-12-16-今,中国计算机学会中文信息处理专委会委员, 2007-11-01-今,中文信息学报编委, 2005-10-01-今,中国中文信息学会信息检索专委会委员, 教授课程 舆情分析与信息检索信息检索导论现代信息检索 出版信息 发表论文 [1] Xin Cong, Jiawei Sheng, Shiyao Cui, Bowen Yu, Tingwen Liu, Bin Wang. Relation-Guided Few-Shot Relational Triple Extraction. SIGIRnull. 2022, [2] Jiangxia Cao, Xin Cong, Tingwen Liu, Bin Wang. Item Similarity Mining for Multi-Market Recommendation. SIGIRnull. 2022, [3] Jiangxia Cao, Jiawei Sheng, Xin Cong, Tingwen Liu, Bin Wang. Cross-Domain Recommendation to Cold-Start Users via Variational Information Bottleneck. ICDEnull. 2022, [4] Bowen Yu, Zhenyu Zhang, Jingyang Li, Haiyang Yu, Tingwen Liu, Jian Sun, Yongbin Li, Bin Wang. Towards Generalized Open Information Extraction. Findings of EMNLPnull. 2022, [5] Jiangxia Cao, Xinxun Lin, Xin Cong, Jing Ya, Tingwen Liu, Bin Wang. DisenCDR: Learning Disentangled Representations for Cross-Domain Recommendation. SIGIRnull. 2022, [6] Jiangxia Cao, Xin Cong, Jiawei Sheng, Tingwen Liu, Bin Wang. Contrastive Cross-Domain Sequential Recommendation. CIKMnull. 2022, [7] Bowen Yu, Zhenyu Zhang, Jiawei Sheng, Tingwen Liu, Yubin Wang, Yucheng Wang, Bin Wang. Semi-Open Information Extraction. WWWnull. 2021, [8] Bowen Yu, Yucheng Wang, Tingwen Liu, Hongsong Zhu, Limin Sun, Bin Wang. Maximal Clique Based Non-Autoregressive Open Information Extraction. EMNLPnull. 2021, [9] Xixun Lin, Jiangxia Cao, Peng Zhang, Chuan Zhou, Zhao Li, Jia Wu, Bin Wang. Disentangled Deep Multivariate Hawkes Process for Learning Event Sequences. ICDMnull. 2021, [10] Bowen Yu, Mengge Xue, Zhenyu Zhang, Tingwen Liu, Yubin Wang, Bin Wang. Learning to Prune Dependency Trees with Rethinking for Neural Relation Extraction. COLINGnull. 2020, [11] Jiangxia Cao, Xixun Lin, Shu Guo, Luchen Liu, Tingwen Liu, Bin Wang. Bipartite Graph Embedding via Mutual Information Maximization. WSDMnull. 2020, http://arxiv.org/abs/2012.05442.[12] 王斌, 王育军, 崔建伟, 孟二利. 智能语音交互技术进展. 人工智能[J]. 2020, 14-28, http://lib.cqvip.com/Qikan/Article/Detail?id=7103366276.[13] Mengge Xue, Bowen Yu, Zhenyu Zhang, Tingwen Liu, Yue Zhang, Bin Wang. Coarse-to-Fine Pre-training for Named Entity Recognition. EMNLPnull. 2020, http://arxiv.org/abs/2010.08210.[14] Bowen Yu, Zhenyu Zhang, Tingwen Liu, Bin Wang, Sujian Li, Quangang Li. Beyond Word Attention: Using Segment Attention in Neural Relation Extraction. IJCAInull. 2019, [15] Dong Wang, Tingwen Liu, Bin Wang. Revising Attention with Position for Aspect-Level Sentiment Classification. ICANNnull. 2019, [16] Wang Pengming, Li Peng, Li Rui, Wang Bin, Huang X, Jiang J, Zhao D, Feng Y, Hong Y. Improving Retrieval Quality Using PRF Mechanism from Event Perspective. NATURAL LANGUAGE PROCESSING AND CHINESE COMPUTING, NLPCC 2017null. 2018, 10619: 590-599, [17] Wu Jianjun, Sha Ying, Li Rui, Liang Qi, Jiang Bo, Tan Jianlong, Wang Bin, Huang X, Jiang J, Zhao D, Feng Y, Hong Y. Identification of Influential Users Based on Topic-Behavior Influence Tree in Social Networks. NATURAL LANGUAGE PROCESSING AND CHINESE COMPUTING, NLPCC 2017null. 2018, 10619: 477-489, [18] 王斌. Attentive Path Combination for Knowledge Graph Completion. ACML‘2017. 2017, [19] Guo, Shu, Wang, Quan, Wang, Bin, Wang, Lihong, Guo, Li. SSE: Semantically Smooth Embedding for Knowledge Graphs. IEEE TRANSACTIONS ON KNOWLEDGE AND DATA ENGINEERING[J]. 2017, 29(4): 884-897, https://www.webofscience.com/wos/woscc/full-record/WOS:000397581000013.[20] 徐安滢, 吉宗诚, 王斌. 基于用户回答顺序的社区问答答案质量预测研究. 中文信息学报[J]. 2017, 31(2): 132-138, http://lib.cqvip.com/Qikan/Article/Detail?id=672249358.[21] Sha Ying, Shi Zhenhui, Li Rui, Liang Qi, Wang Bin, Koumoutsakos P, Lees M, Krzhizhanovskaya V, Dongarra J, Sloot P. Resolving Entity Morphs based on Character-Word Embedding. INTERNATIONAL CONFERENCE ON COMPUTATIONAL SCIENCE (ICCS 2017)null. 2017, 108: 48-57, http://dx.doi.org/10.1016/j.procs.2017.05.106.[22] Zhao Sendong, Wang Quan, Massung Sean, Qin Bing, Liu Ting, Wang Bin, Zhai ChengXiang, ACM. Constructing and Embedding Abstract Event Causality Networks from Text Snippets. WSDM'17: PROCEEDINGS OF THE TENTH ACM INTERNATIONAL CONFERENCE ON WEB SEARCH AND DATA MININGnull. 2017, 335-344, http://dx.doi.org/10.1145/3018661.3018707.[23] Yin, Rongchao, Li, Peng, Wang, Bin, IEEE. Sentiment Lexical-Augmented Convolutional Neural Networks for Sentiment Analysis. 2017 IEEE SECOND INTERNATIONAL CONFERENCE ON DATA SCIENCE IN CYBERSPACE (DSC)null. 2017, 630-635, http://dx.doi.org/10.1109/DSC.2017.82.[24] 王斌. Leveraging External Knowledge to Enhance Query Model for Event Query. CCIR'2017. 2017, [25] Wang, Quan, Mao, Zhendong, Wang, Bin, Guo, Li. Knowledge Graph Embedding: A Survey of Approaches and Applications. IEEE TRANSACTIONS ON KNOWLEDGE AND DATA ENGINEERING[J]. 2017, 29(12): 2724-2743, https://www.webofscience.com/wos/woscc/full-record/WOS:000414712700008.[26] 王斌. Relation Extraction with Multi-instance Multi-label Convolutional Neural Networks.. COLING. 2016, [27] Ye Yongjun, Li Peng, Li Rui, Zhou Meilin, Wan Yifang, Wang Bin, Cellary W, Mokbel MF, Wang J, Wang H, Zhou R, Zhang Y. Ranking Microblog Users via URL Biased Posts. WEB INFORMATION SYSTEMS ENGINEERING - WISE 2016, PT IInull. 2016, 10042: 85-93, [28] Wan Yifang, Li Peng, Li Rui, Zhou Meilin, Ye Yongjun, Wang Bin, Cellary W, Mokbel MF, Wang J, Wang H, Zhou R, Zhang Y. Towards Understanding URL Resources in Recent Sina Weibo. WEB INFORMATION SYSTEMS ENGINEERING - WISE 2016, PT Inull. 2016, 10041: 50-57, [29] 王斌. Jointly Embedding Knowledge Graphs and Logical Rules. PROCEEDINGSOFEMNLP16CCFRANKB. 2016, [30] Yang Wenjing, Li Rui, Li Peng, Zhou Meilin, Wang Bin, Cui B, Zhang N, Xu J, Lian X, Liu D. Event Related Document Retrieval Based on Bipartite Graph. WEB-AGE INFORMATION MANAGEMENT, PT Inull. 2016, 9658: 467-478, [31] 王斌. Partially Decompressing Binary Interpolative Coding for Fast Query Processing. WISE'2016. 2016, [32] Wang Quan, Liu Jing, Luo Yuanfei, Wang Bin, Lin ChinYew, Erk K, Smith NA. Knowledge Base Completion via Coupled Path Ranking. PROCEEDINGS OF THE 54TH ANNUAL MEETING OF THE ASSOCIATION FOR COMPUTATIONAL LINGUISTICS, VOL 1null. 2016, 1308-1318, http://apps.webofknowledge.com/CitedFullRecord.do?product=UA&colName=WOS&SID=5CCFccWmJJRAuMzNPjj&search_mode=CitedFullRecord&isickref=WOS:000493806800124.[33] Wang Shuxin, Jiang Xin, Li Hang, Xu Jun, Wang Bin, Ma S, Wen JR, Liu Y, Dou Z, Zhang M, Chang Y, Zhao X. Incorporating Semantic Knowledge into Latent Matching Model in Search. INFORMATION RETRIEVAL TECHNOLOGY, AIRS 2016null. 2016, 9994: 29-41, [34] 王书鑫, 卫冰洁, 鲁骁, 王斌. 面向微博搜索的时间敏感的排序学习方法. 中文信息学报[J]. 2015, 29(4): 175-182, http://lib.cqvip.com/Qikan/Article/Detail?id=666607109.[35] Wang Quan, Wang Bin, Guo Li, Yang Q, Wooldridge M. Knowledge Base Completion Using Embeddings and Rules. PROCEEDINGS OF THE TWENTY-FOURTH INTERNATIONAL JOINT CONFERENCE ON ARTIFICIAL INTELLIGENCE (IJCAI)null. 2015, 1859-1865, http://apps.webofknowledge.com/CitedFullRecord.do?product=UA&colName=WOS&SID=5CCFccWmJJRAuMzNPjj&search_mode=CitedFullRecord&isickref=WOS:000442637801131.[36] Guo Shu, Wang Quan, Wang Bin, Wang Lihong, Guo Li, Zong C, Strube M. Semantically Smooth Knowledge Graph Embedding. PROCEEDINGS OF THE 53RD ANNUAL MEETING OF THE ASSOCIATION FOR COMPUTATIONAL LINGUISTICS AND THE 7TH INTERNATIONAL JOINT CONFERENCE ON NATURAL LANGUAGE PROCESSING, VOL 1null. 2015, 84-94, http://apps.webofknowledge.com/CitedFullRecord.do?product=UA&colName=WOS&SID=5CCFccWmJJRAuMzNPjj&search_mode=CitedFullRecord&isickref=WOS:000493808900009.[37] 王斌. A Regularized Competition Model for Question Difficulty Estimation in Community Question Answering. EMNLP2014. 2014, [38] 王斌. Context Sensitive Microblog Recommendation based on Users Activity Session. 2014, [39] Wang Shuxin, Lu Kai, Lu Xiao, Wang Bin, Chen L, Jia Y, Sellis T, Liu G. Query Dependent Time-Sensitive Ranking Model for Microblog Search. WEB TECHNOLOGIES AND APPLICATIONS, APWEB 2014null. 2014, 8709: 644-651, [40] 鲁凯, 张冠元, 王斌. CICF：一种基于上下文信息的协同过滤推荐算法0. 中文信息学报[J]. 2014, 28(2): 122-128, [41] Lu Xiao, Li Peng, Ma Hongyuan, Wang Shuxin, Xu Anying, Wang Bin, ACM. Computing and Applying Topic-level User Interactions in Microblog Recommendation. SIGIR'14: PROCEEDINGS OF THE 37TH INTERNATIONAL ACM SIGIR CONFERENCE ON RESEARCH AND DEVELOPMENT IN INFORMATION RETRIEVALnull. 2014, 843-846, http://dx.doi.org/10.1145/2600428.2609455.[42] 卫冰洁, 王斌. 面向微博搜索的时间感知的混合语言模型. 计算机学报[J]. 2014, 37(1): 229-237, http://lib.cqvip.com/Qikan/Article/Detail?id=48544445.[43] 王斌. 一种基于多源信息融合的音乐推荐方法. CCIR2013. 2013, [44] 王斌. 一种用于压缩的索引表示形式. CCIR2013. 2013, [45] 李鹏, 王斌, 晋薇. 一种基于社会化标签的信息检索方法. 中文信息学报[J]. 2013, 39-46,55, http://lib.cqvip.com/Qikan/Article/Detail?id=44852590.[46] 张冠元, 王斌. 一种基于液体状态机的音乐和弦序列识别方法. 模式识别与人工智能[J]. 2013, 26(7): 643-647, http://lib.cqvip.com/Qikan/Article/Detail?id=46777644.[47] 王斌. 利用",
  "content_length": 12482,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:00"
}