{
  "name": "Bin Guo 0001",
  "homepage": "http://www.guob.org",
  "status": "success",
  "content": "Welcome to Bin Guo's Homepage Dr. Bin Guo School of Computer Science Northwestern Polytechnical University Xi'an, Shaanxi, 710129, P. R. China Email: guobin.keio(AT)gmail.com Tel: +86-29-88431525 (office) Biography Research Activities Course Honors & Awards Publications Students Projects Employment History Useful Links Dr. Bin Guo is currently a professor with Northwestern Polytechnical University (NPU), China. He was previous a post-doctoral researcher of Prof. Daqing Zhang's research group at Institute TELECOM SudParis, France. He received his Ph.D. degree in computer science from Keio University, Tokyo, Japan, in 2009. He completed his Ph.D studies in the Anzai-Imai Lab, under the supervision of Prof. Michita Imai and Prof. Yuichiro Anzai (president of JSPS in Japan).  He received his B.E and M.E of Computer Sciencefrom Xi'an Jiaotong University in 2003 and 2006, respectively. He serves as the vice-dean of the School of Computer Science, the deputy director of the Intelligent Sensing and Computing Lab. of the Ministry of Industry and Information Technology of China, the founding director of the AI&Art Research Center of NPU，and the Secretary General of the Belt and Road AIoT International Cooperative Alliance (BRAVE). His current research interests include: Ubiquitous Computing, Crowd Intelligence, Mobile Crowd Sensing, Social and Community Intelligence, and AIoT. He has served as an associate editor of IEEE Communications Magazine (ComMag), IEEE Trans. on Human-Machine-Systems (THMS), Proceedings of the ACM (PACM) on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT), IEEE IT Professional (ITPro), ACM/Springer Journal of Personal and Ubiquitous Computing (PUC), Springer Frontiers of Computer Science (FCS), the guest editor of ACM Trans. on Intelligent Systems and Technology (TIST), IEEE Trans. on Industrial Informatics (TII), IEEE Internet of Things (IoT), Elsevier Journal of Network and Computer Applications (JNCA), and so on. He initiated the International Conference on Artificial Intelligence of Things and Systems (AIoTSys), and has served as the the program chair of 15th International Conference on Green, Pervasive and Cloud Computing (GPC'20), general chair of the 10th IEEE International Conference on Cyber, Physical, and Social Computing (CPSCom'17), the general co-chair of the 12th IEEE International Conference on Ubiquitous Intelligence and Computing (IEEE UIC'15) and the program chair of IEEE CPSCom'16, IEEE UIC'13. He serves as the TPC member for a number of conferences, including UbiComp, PerCom, CHI, WWW, etc. He is a senior member of IEEE, a distinguished and council member of CCF, a member of ACM, the chair of computer chapter at IEEE Xi'an Section, the chair of CCF Xi'an Section. He has published over 150 papers in refereed journals, conference proceedings and book chapters. His research was mainly funded by the National Key R&D Program of China, National Natural Science Foundation of China, the National Basic Research Program of China (973), and partly funded by theEU FP7 Project (SOCIETIES). He is ranked in the Elsevier Chinese Highly Cited Researcher list (2021-), Stanford World's Top 2% Scientists (2023). He received the support of the National Science Fund for Distinguished Young Scholars in 2020，the Program for \"New Century Excellent Talents in University(NCET)\" of the State Ministry of Education in 2012, the\"Scientific and Technology New Star of Shaanxi Province\" in 2013, and the National Youth Talent Support Program in 2017. He has won the the First Class of Natural Scientific Award of the State Education Ministry of China in 2020, the First Prize of Natural Science Award of Shaanxi Province in 2020, and the Second Class of Natural Scientific Award of the State Education Ministry of China in 2014, the Best Paper Award of IEEE BIBM'20, UIC'19, IEEE UIC'17, CPSCom'13,BigDataSci'14, CPSCom'13, GPC'12, AMT'12, and the Chinese Government Award For Outstanding Self-Financed Students Abroad in 2009. Course Education 2006.10~ 2009.3, Ph.D, Department of Computer Science, Keio University, Japan. 2005.10~ 2006.9, Research Student , Department of Computer Science, Keio University, Japan. 2003.9~ 2006.3, M.E, Computer Software, Xi'an Jiaotong University, China. 1999.9~ 2003.7, B.E, Computer Science and Technology, Xi'an Jiaotong University, China. Recent Publications Bin Guo, Qi Han, Huihui Chen, Longfei Shangguan, Zimu Zhou, Zhiwen Yu.\"The Emergence of Visual Crowdsensing: Challenges and Opportunities\",IEEE Communications Surveys and Tutorials, 2017. Bin Guo, Huihui Chen, Qi Han, Zhiwen Yu, Daqing Zhang, Yu Wang.\"Worker-Contributed Data Utility Measurement for Visual Crowdsensing Systems\", IEEE Transactions on Mobile Computing, 2017. Bin Guo, Huihui Chen, Wenqian Nan, Zhiwen Yu, Xing Xie, Daqing Zhang, Xingshe Zhou.\"TaskMe: Toward a Dynamic and Quality-Enhanced Incentive Mechanism for Mobile Crowd Sensing\", International Journal of Human Computer Studies, 2017. Bin Guo, Yi Ouyang, Cheng Zhang, Jiafan Zhang, Zhiwen Yu, Di Wu, Yu Wang. \"CrowdStory: Fine-Grained Event Storyline Generation by Fusion of Multi-Modal Crowdsourced Data\", The 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing (ACM UbiComp'17), 2017. Bin Guo, Huihui Chen, Zhiwen Yu, Xing Xie, Shenlong Huangfu, Daqing Zhang. \"FlierMeet: A Mobile Crowdsensing System for Cross-Space Public Information Reposting, Tagging, and Sharing\", IEEE Transactions on Mobile Computing, 2015. Yan Liu, Bin Guo, Yang Wang, Wenle Wu, Zhiwen Yu, Daqing Zhang. \"TaskMe: Multi-Task Allocation in Mobile Crowd Sensing\", The 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (ACM UbiComp'16), 2016. Huihui Chen, Bin Guo, Zhiwen Yu, Qi Han, Daqing Zhang, Xingshe Zhou. \"Toward Real-time and Cooperative Mobile Visual Sensing and Sharing\", IEEE INFOCOM'16 , 2016. Bin Guo, Yan Liu, Wenle Wu, Zhiwen Yu, Qi Han. \"ActiveCrowd: A Framework for Optimized Multi-Task Allocation in Mobile Crowdsensing Systems\", IEEE Transactions on Human-Machine Systems, 2016. Bin Guo,Zhu Wang, Zhiwen Yu, Yu Wang, Neil Yen, Runhe Huang, Xingshe Zhou.\"Mobile Crowd Sensing and Computing: The Review of an Emerging Human-Powered Sensing Paradigm\", ACM Computing Surveys, 2015 [PDF]. View full publication list CrowdHMT aims to build a self-organizing, self-learning, and continuous-evolving smart space with the deep fusion of Human, Machine, and IoT intelligence. The CrowdHMT platform is open for the source codes, tools, datasets from our team and third parties. Please kindly join us and make your contribution to the promising area. AI-Mate aims to build human-like mate-bots towarding a smart space of harmonious human-machine interaction. It is unique on the characters such as \"companionship, virtual-reality interaction, hardware-software cooperation, crowd-intelligence\". Please kindly join us and make your contribution to the promising area. Welcome to visit our open source Mobile Crowd Sensing Platform CrowdOS, which supports complex task allocation, quality-enhanced incentives, crowd data selection, and crowd data mining. \"Creating Personal, Social, and Urban Awareness through Pervasive Computing\" edited by Bin Guo,Daniele Riboni (University of Milano, Italy) and Peizhao Hu (NICTA, Australia), published by IGI Global in Oct. 2013. \"Many would consider research on pervasive computing as mature because of a proliferation of models and prototypes for augmenting work and everyday user environments. There are, however, many facets of pervasive computing that are still very challenging for the research community. These challenging areas include the three aspects that the editors of this book address: personal awareness, social awareness and urban awareness. Addressing such challenges will lead to the next generation of pervasive computing.\" -Foreword by Jadwiga Indulska, The University of Queensland, AU What's New? 教材：郭斌等，计算社会学（上下册），机械工业出版社 (2024). 教材：郭斌等，智能物联网导论，机械工业出版社 (2023). 专著：郭斌等，人机物融合群智计算，机械工业出版社 (2022). 普适计算30年，从想象到落地，中国科学报 (Oct., 21, 2021). 人机物融合群智计算，中国计算机学会通讯，2021(PDF). 群智智能制造，中国计算机学会通讯，2021. 智能物联如何连接未来，人民论坛-学术前沿，人民智库(Aug. 10, 2020). Welcome to visit our newly launched, open source Mobile Crowd Sensing Platform CrowdOS (Nov., 21, 2019). Our work on Mobile App Lifespan Prediction is reported by IEEE Spectrum (Aug., 24, 2020). Our paper about human identification using WiFi signals is reported by The Atlantics, also referred by IThome and Netease (Aug. 30, 2016). Leading guest Editor of IEEE Communications Magazine, Special Issue on \"Behavior Recognition based on WiFi CSI\" Our paper on \"Mobile Crowd Sensing and Computing: The Review of an Emerging Human-Powered Sensing Paradigm\" is accepted by ACM Computing Surveys [PDF] (Jun. 10, 2015). 普适计算2018：发展趋势，《2013中国计算机科学技术发展报告》，中国计算机学会 文集(PDF). 机会物联--兼谈物联网的社会性，中国计算机学会通讯，2011 (PDF). 数字脚印与“社群智能”，中国计算机学会通讯，2011 (PDF). 陕ICP备17016013号",
  "content_length": 8924,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:59"
}