{
  "name": "Bin Zhang 0042",
  "homepage": "https://mbzuai.ac.ae/study/faculty/bin-zhang",
  "status": "success",
  "content": "Bin Zhang - MBZUAI MBZUAI About About Leadership and Governance Alumni Mission Faculty Directory Fast Facts Office of the President Office of the Provost Study Study Graduate Admission Process Undergraduate Admission Process Faculty Directory Aspire Ph.D. Fellowship Program Master in Applied Artificial Intelligence (MAAI) Master’s Programs Ph.D. Programs Undergraduate Program Undergraduate Research Internship Program University Catalogue Research Research Computer Vision Research Machine Learning Research Natural Language Processing Projects Research Centers Innovate Innovate Consulting Incubation and Entrepreneurship Center Institute of Digital Public Health Institute of Foundation Models Office of Public Affairs and Alumni Relations Partnerships and Collaborations Training Programs Student Resources Undergraduate Academic Calendar Graduate Academic Calendar Campus Facilities Career Services and Internships Publications Repository Educational Affairs Library Portal Office of the Registrar Campus Map News & Events Commencement Events Media Center The Node | Stories of MBZUAI MBZUAI Nexus | The Global AI Research & Knowledge Network Apply now Home / Faculty directory / Bin Zhang Bin Zhang Assistant Professor of Computational Biology Research Interests Professor Zhang focuses on addressing the challenge of discovering novel biological patterns from large-scale omics data by leveraging artificial intelligence (AI) and advanced computational methods. His research aims to develop innovative omics analysis tools and construct comprehensive databases and atlases to uncover gene regulatory mechanisms associated with diseases such as cancer and genetic disorders, with a particular emphasis on RNA regulation. Email Share Prior to joining MBZUAI, Professor Zhang was deeply engaged in developing omics analysis tools leveraging deep learning and other artificial intelligence (AI) technologies. His work focused on applying these methods to large-scale omics datasets to uncover gene regulatory mechanisms associated with diseases such as cancer and genetic disorders, particularly those involving RNA regulation. Looking ahead to the paradigm shift in life science research driven by AI, Professor Zhang aims to integrate multi-omics data through AI for modeling and designing complex biological processes. His future research will concentrate on building an interpretable foundational model for antigen presentation and modeling RNA isoform regulation at the single-cell level. Specifically, he plans to utilize isoform expression—rather than the currently more common gene expression—to characterize cell types, states, and spatiotemporal velocity fields, with the ultimate goal of constructing RNA-centric gene regulatory networks. These efforts seek to address critical gaps in existing biological foundation models and to advance the quantitative understanding and rational design of living systems. Postdoctoral Fellow, Computational Bioscience Research Center, KAUST Research Fellow, Cancer Science Institute of Singapore, National University of Singapore Ph.D. in Computational Biology from CAS-MPG Partner Institute of Computational Biology, Shanghai Institutes for Biological Sciences, Chinese Academy of Sciences Joint Ph.D. Student from the Berlin Institute for Medical Systems Biology, Max-Delbrück-Center for Molecular Medicine B.Eng. in Bioinformatics from College of Life Science and Technology, Huazhong University of Science and Technology Key contributions include: Constructing the first comprehensive resource of RNA splicing events within untranslated regions (UTRs), leading to the discovery of a novel regulatory mechanism where pan-cancer widespread 3’ UTR splicing promotes oncogene expression and tumorigenesis. Building the first full-length transcriptomic atlas of colorectal cancer using single-cell long-read sequencing, and proposing a new tumor immunology concept that aberrant RNA processing generates shared neoantigens across multiple tumors. Developing a series of omics analysis tools, including the first fully automated AI agent for multi-omics analysis. Professor Zhang has published over a dozen papers as first/co-first or corresponding author in leading journals such as Nature Cell Biology, Nature Genetics, Cell Genomics, Genome Research, and Advanced Science. Zhou, J.*, Zhang, B.*, Chen, X., Li, H., Xu, X., Chen, S., ... & Gao, X. (2024). An AI Agent for Fully Automated Multi-omic Analyses. Advanced Science, 2024, 2407094. Li, Z.*, Zhang, B.*,#, Chan, J. J.*, Tabatabaeian, H., Tong, Q. Y., Chew, X. H., ... & Tay, Y. (2024). An isoform-resolution transcriptomic atlas of colorectal cancer from long-read single-cell sequencing. Cell Genomics, 4(9), 100641. Zhang, B., & Gao, X. (2023). Deciphering DNA variant-associated aberrant splicing with the aid of RNA sequencing. Nature genetics, 1-2. Long, Y.*, Zhang, B.*,#, Tian, S.*, Chan, J. J., Zhou, J., Li, Z., ... & Gao, X. (2023). Accurate transcriptome-wide identification and quantification of alternative polyadenylation from RNA-seq data with APAIQ. Genome Research, 33(4), 644-657. Chan, J. J.*, Zhang, B.*, Chew, X. H., Salhi, A., Kwok, Z. H., Lim, C. Y., ... & Tay, Y. (2022). Pan-cancer pervasive upregulation of 3′ UTR splicing drives tumourigenesis. Nature Cell Biology, 24(6), 928-939. Tian, S.*, Zhang, B.*, He, Y., Sun, Z., Li, J., Li, Y., ... & Chen, W. (2022). CRISPR-iPAS: a novel dCAS13-based method for alternative polyadenylation interference. Nucleic Acids Research, 50(5), e26. Xiao, M. S.*, Zhang, B.*, Li, Y. S., Gao, Q., Sun, W., & Chen, W. (2016). Global analysis of regulatory divergence in the evolution of mouse alternative polyadenylation. Molecular systems biology, 12(12), 890. ORCID LinkedIn Contact faculty affairs Interested in working with our renowned faculty? Fill out the below form and we will get back to you. Please enable JavaScript in your browser to complete this form.Name *Organization *Phone number *Email *Message *Checkboxes *I consent to receive communication from MBZUAISubmitSubmit x We use cookies We use necessary and analytics cookies to operate our website, analyze traffic, and improve your experience. By continuing to use this website, you agree to our use of cookies. Learn more Got it",
  "content_length": 6268,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:02"
}