{
  "name": "Bin Xiao 0001",
  "homepage": "https://www4.comp.polyu.edu.hk/~csbxiao",
  "status": "success",
  "content": "Prof. Bin Xiao - HK PolyU Dr. Bin Xiao's Homepage Bin Xiao Fellow OF IEEE, Fellow of aaia Professor Department of Computing Home Research Interests/projects Students Activities Publications Contact Office: PQ824, Mong Man Wai Building Department of Computing The Hong Kong Polytechnic University 11 Yuk Choi Road, Hung Hom Kowloon, Hong Kong Phone: (852) 2766-7270 Fax: (852) 2774-0842 Email: b.xiao (at) polyu.edu.hk Dr. Bin Xiao (肖斌) is a full professor in the Department of Computing, the Hong Kong Polytechnic University. He received the B.Sc and M.Sc degrees in the Electronics Engineering from Fudan University, China, and Ph.D. degree in Computer Science from University of Texas at Dallas, USA in 2003. After his Ph.D. graduation, he joined the Hong Kong Polytechnic University as an assistant professor. Currently, he is the associate editor of IEEE TCC and IEEE TNSE, IEEE ComSoc distinguished lecturer, the chair of IEEE ComSoc Communications and Information Security Technical Committee (CISTC Chair), a Fellow of IEEE and a Fellow of AAIA. He has been the associate editor for Elsevier JPDC from 2016 to 2021 and IEEE IoTJ from 2020 to 2023. Many graduates from his group got faculty positions in the top universities in both the mainland and HK. Ph.D. Opportunity: In general, we are looking for good Ph.D. candidates all year around (fellowship HK$19,660 per month) in the areas of Data Science, focusing on security and privacy, e.g., AI security, Database security and privacy, Web3 (DID) and Blockchain Systems. Please send me your CV and supporting documents if you have interest. We also have the Hong Kong PhD Fellowship Scheme (HKPFS) and other prestigeous schemes that welcome your application, up to support. We have a number of positions for the 2026 academic year (2 for AI security and 2 or more positions reserved for Web3/Quantum Computing). Post-Doc Opportunity: We have the HK RGC, PolyU Postdoctoral Fellowship schemes (around HKD32,000/month ) to support aspiring scholars (以及同内地共同培养博士后计划，香港这边资助18个月). If your research area is in the field of Data Science, AI security, Database security and privacy, or Web3, please contact me with your CV and publications. News: Congratulations to Dr. Xuelong Dai who got the Assistant Professor position in the schoold of AI, Shandong Univ., China, Aug. 2025! Congratulations to Dr. Peng Zhe, promoted to Assistant Professor in ISE PolyU, Jun. 2025! Welcome submissions to IEEE CNS 2025 - IEEE Conference on Communications and Network Security, Manuscript Submission Deadline: 5 May 2025. Congratulations to Dr. Shang Gao who got the Assistant Professor offer from the HK Polytechnic Univ., Feb. 2025! Congratulations to Ms Yuni LAI who got the PolyU Postdoctoral Fellowship for two years, Jan. 2025! Congratulations to Dr. Yihao GUO who got the PolyU Distinguished Postdoctoral Fellowship for two years, Oct. 2024! Congratulations to Ph.D. student Yanjie Li selected by the Research Student Attachment Programme (RSAP-Outgoing) and he will visit UIUC for 6 months, 2024. pic1, pic2. Welcome submissions to IEEE GLOBECOM 2024 - Communication & Information Systems Security Symposium (CISS), Manuscript Submission Deadline: 1 Apr. 2024. Congratulations to Mr. Yiquan Li (undergraduate in the PolyU URIS programme), whose paper (second author) is accepted in IEEE/CVF CVPR 2023, Vancouver, Canada, June 2023! Congratulations to our Ph.D. graduate, Dr. Zecheng Li, who got the Research Assistant Professor offer from the HK Polytechnic Univ., Sept. 2022! Welcome submissions to IEEE ICDCS 2022 - Security, Privacy, and Trust in Distributed Systems, Manuscript Submission Deadline: 17 Jan. 2022. Welcome submissions to IEEE TNSE special issue - Security and Privacy for AI Models and Applications, Manuscript Submission Deadline: 1 September 2020. Congratulations to Dr. Shang Gao who got the Research Assistant Professor offer from the HK Polytechnic Univ., Feb. 2020! Congratulations to Dr. PENG Zhe who got the Research Assistant Professor offer from the HK Baptist Univ., Oct. 2019! Congratulations to GAO Shang's work in the Mining Attacks to the Blockchain System, which is accepted in the top conference ACM CCS 2019! Welcome submissions to IEEE SECON 2018, 11-13 June 2018, Hong Kong. Submission deadline: Dec. 15, 2017. Welcome submissions to the AD HOC AND SENSOR NETWORKING SYMPOSIUM of IEEE ICC 2018. Submission deadline: Oct. 15, 2017. Ph.D. student PENG, Zhe visited Stony Brook Univ., USA, started from Sept. 2017 for 6 months. Congratulations to PENG, Zhe and GAO, Shang for winning the first prize in the COMP Annual Research Day! May 2017. Welcome submissions to the Communication & Information Systems Security Symposium of IEEE Globecom 2017. Submission deadline: April 1, 2017. A Special Issue on \"High Performance and Security in Cloud Computing\" is open for submission in Concurrency and Computation: Practice and Experience (SCI).  Please visit the following link for detailed instructions: http://www.cc-pe.net/journalinfo/issues/2016.html#CloudCom-Asia2016. Submission deadline:  1 October 2016. Welcome Dr. Yuan Yao to be the PostDoc in our group, June 2016. Congratulations to Dr. Xuan Liu, who now is the assistant professor in the College of Computer Science and Electronic Engineering, Hunan University, Changsha China, Aug. 2015. Congratulations to Dr. Qingjun Xiao, who now is the assistant professor in the School of Computer Science and Engineering, Southeast University, Nanjing China, July 2014. A Ph.D. position is available for the MCC lab, with the salary about HKD14,350/month, Feb. 2014. The Post-Doc position is filled for the MCC lab, Feb. 2014. A Post-Doc position is available for the MCC lab, with the salary about HKD21,000/month. Dec. 2013. The Mobile Cloud Computing (MCC) lab is set up. Dr. Xiao is the lab director. Nov. 2013. A Ph.D. position now is open in the mobile cloud computing and smartphone technology areas. Send me email if you are interested in these areas. A master-degree candidate will be considered first. July 2013. Congratulations to Dr. Kai Bu, who will be the assistant professor in the College of Computer Science and Technology, Zhejiang University, Hangzhou China, July 2013. Congratulations to Dr. Jiaqing Luo, who was recently promoted to associate professor in the School of Computer Science and Engineering, University of Electronic Science and Technology of China, Chengdu China, June 2013. The Hong Kong Polytechnic University",
  "content_length": 6474,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:01"
}