{
  "name": "Bin Yu 0001",
  "homepage": "https://www.stat.berkeley.edu/~binyu/Site/Welcome.html",
  "status": "success",
  "content": "Home – Bin Yu Professor Bin Yu CDSS Chancellor’s Distinguished Professor of Statistics Electrical Engineering and Computer Sciences, and Center for Computational Biology Statistics Department Chair, 2009 - 2012 Contact Address: 367 Evans Hall #3860, Berkeley, CA 94720 Phone: 510-642-2781 Fax: 510-642-7892 Email: binyu@berkeley.edu Welcome Professor Bin Yu leads the Yu Group at UC Berkeley, an interdisciplinary team in Statistics and EECS dedicated to advancing machine learning, artificial intelligence, and veridical data science. Her group develops efficient and interpretable ML/AI methods and theory—ranging from iterative random forests (iRF) and tree-based FIGS to LoRA+ for fine-tuning deep learning and CD-T and SPEX for interpreting deep models. The Yu Group collaborates closely with domain experts in medical AI, genomics, and neuroscience. A member of both the National Academy of Sciences and the American Academy of Arts and Sciences, she has delivered major keynotes, including the 2019 Breiman Lecture at NeurIPS, 2023 IMS Wald Lectures and the COPSS DAAL Lecture (formerly Fisher Lecture). She and her team pioneered the PCS framework (predictability, computability, and stability) for veridical (truthful) data science (VDS), which has become an influential guide for transparent, trustworthy data science and AI. Recent Publications, Talks & News 2025PCS workflow for veridical data science in the age of AI - Framework for responsible AI development and deployment 2025Veridical Data Science in Biology workshop, UC Berkeley, July 11 - Applying trustworthy data science to biological research 2025Rome Workshop on Veridical Data Science, June 20 - International workshop on responsible data analysis 2024Veridical data science and medical foundation models - Guidelines for trustworthy medical AI systems 2024Mechanistic Interpretation through Contextual Decomposition in Transformers - Method for understanding transformer decision-making processes 2024LoRA+: Efficient Low Rank Adaptation of Large Models - Improved technique for fine-tuning large language models 2024VDS book review in Harvard Data Science Review - Praise for pedagogical approach to responsible data science 2024Berkeley-Stanford Workshop on Veridical Data Science (videos) - Inaugural academic collaboration on trustworthy AI 2024Veridical Data Science book released (online) - Comprehensive guide to responsible data analysis and decision making 2023Explaining black box text modules in natural language with language models - Natural language explanations for neural network text processing 2023Diagnosing transformers: illuminating feature space for clinical decision-making - Interpretability methods for medical transformer applications 2023COPSS Distinguished Award and Lecture, JSM Toronto - Recognition for contributions to statistical science and AI View all papers →",
  "content_length": 2872,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:03"
}