{
  "name": "Binay K. Bhattacharya",
  "homepage": "http://www.cs.sfu.ca/~anoop",
  "status": "success",
  "content": "Anoop Sarkar · SFU Computer Science © 2013 - 2025 Anoop Sarkar CC BY-NC-SA 4.0 RSS feed. About this site. Anoop Sarkar SFU Computer Science Professor Natural Language Lab School of Computing Science Simon Fraser University Curriculum Vitae ACL Anthology Google Scholar Semantic Scholar DBLP Github Mastodon Biography Contact details If you are interested in working with me, before you email me, please read my First Contact guide. Research More on research Multilingual Natural Language Processing Machine learning for Natural Language Processing Machine Reading and Information Visualization Teaching Recent teaching Fall 2024: Natural Language Processing Summer 2023: Advanced Natural Language Processing Fall 2021: Compilers Recent Publications and Talks All publications ACL Anthology Google Scholar Semantic Scholar DBLP . . , () : URL PDF BibTeX Abstract Abstract: Bibtex: Software All software TroFi Metaphor dataset: literal versus non-literal uses of words [More] Yarowsky algorithm Bootstrapping algorithms for semi-supervised learning in NLP [More] Research Grants All grants NSERC Discovery Accelerator Supplements Program: 2012-2015 and 2017-2023. NSERC Discovery Grants Program, 2003-2007, 2007-2012, 2012-2017, 2017-2023. Google Faculty Research Award, 2014-2015 and 2009-2010 IBM Faculty Award: 2008-2009 Service All activities Area chair, EMNLP 2023. Tutorial co-chair, NAACL 2019, Minneapolis, MN Local co-organizer, ACL 2017, Vancouver, BC Area co-chair, Machine Learning track, EMNLP 2017 Program co-chair, NAACL HLT 2015. Recently Graduated Students All students and postdocs Student theses Phd (Total: 12) Shavarani, Sayyedhassan. Structured Prediction for Compute Efficient and High Accuracy NLP. (from: Fall 2017 to: Summer 2024) Kambhatla, Nishant. Augmented Input Representations in Sequence Generation Models for Decipherment and Translation. (from: Fall 2018 to: Summer 2024) MSc (Total: 26) Moradi, Pooya. Training with adversaries to improve faithfulness of attention in neural machine translation. (from: Fall 2018 to: Summer 2020) Zhu, Zhenqi. Deconstructing supertagging into multi-task sequence prediction. (from: Fall 2018 to: Spring 2020) p.s. Did you try clicking on the three bars on the upper left?",
  "content_length": 2238,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:04"
}