{
  "name": "Bing Liu 0001",
  "homepage": "https://www.cs.uic.edu/~liub",
  "status": "success",
  "content": "Bing Liu (Liu, Bing)'s Home Page Bing Liu Professional Recognitions Distinguished Professor Peter L. and Deborah K. Wexler Professor of Computing Department of Computer Science University of Illinois at Chicago (UIC) 850 W Taylor Street, (M/C 152) 3rd Floor, CDRLC-Bldg. 649 Chicago, IL 60607 Email Addresses Press Coverage of My Work ACM SIGKDD Innovation Award 4 Test-of-Time [3 awards + 1 honorable mention] IEEE Fellow AAAI Fellow ACM Fellow Research Interests (Bio: short, very short) Lifelong and continual learning Autonomous AI and open world learning: AGI Sentiment analysis, opinion mining Machine learning, NLP, and Data mining Publications Google Scholar DBLP Publications Professional Activities Chair, SIGKDD (7/1/2013 - 6/30/2017) PC Chairs: KDD, ICDM, SDM, WSDM, CIKM Editorial Board, DMKD, TWEB, TKDE, TKDD More ... Teaching Research Projects Recent Talks Published Books Lifelong and Continual Learning Dialogue Systems New Book Springer, February 2024. Order from MIT Press Bookstore Order from Amazon.com Lifelong Machine Learning (Second Edition) Download for free, if your institution is on this list Get the first edition Morgan & Claypool, 207 pages, August, 2018. Order from Amazon.com Sentiment Analysis: mining opinions, sentiments, and emotions How to build a Sentiment Analysis system, and more Table of Contents, 448 pages Cambridge Univ. Press, 2020. Order from Amazon.com Sentiment Analysis and Opinion Mining A comprehensive introduction and survey Morgan & Claypool, May 2012, 167 pages Order from Amazon.com Web Data Mining: exploring hyperlinks, contents & usage data 2nd Edition, 2011, 622 Pages Order from Amazon.com, Order from Springer Get the eBook Research Projects Opinion Mining, Sentiment Analysis and Opinion Spam Detection (inactive) Book: Sentiment Analysis and Opinion Mining: Introduction and survey Emotional chatbot - enable chatbots or dialogue systems to converse with emotions Lifelong Machine Learning - Continual Learning. An Interview in Nature Outlook. New Survey: Continual Learning of Natural Language Processing Tasks: A Survey. arXiv:2211.12701, 11/23/2022. Continual Pre-training of Language Models and Cruise - Cross-system Architecture Design for Automous Wireless Networks based on Lifelong Learning. Autonomous Learning and Self-Evolving AI or Continual Learning After Model Deployment for Autonomous and Interactive AI Agents. AI Autonomy and Self-Evolving Agents: AI agents learn on their own continuously after deployment. Learning is self-motivated and self-initiated. NSF AI Institute: ACTION - Agent-based Cyber Threat Intelligence and Operation. Open World Machine Learning to achieve AI Learning Autonomy. Closed world assumption: classic machine learning assumes that test instances must be from training classes. Not true in many real-world environments. Open-world learning: It involves novelty (out-of-distribution) dection, characterization, adaptation and continual learning of novelty/new classes. Extrapolation Learning (or Learning for Extrapolation): Existing machine learning is mainly for interpolation. Length extrapolation or generalization in reasoning (ICLR-2025). Lifelong and Continual Learning Dialogue Systems SIGIR-2022 and IJCAI-2021 Tutorial: Continual Learning Dialogue System - Learning after Model Deployment. New Book: \"Lifelong and Continual Learning Dialogue Systems.\" by Sahisnu Mazumder and Bing Liu, Feb 2024. Earlier projects (inactive currently) PU Learning - Learning from Positive and Unlabeled Examples (Set Expansion is also a form of PU learning) Detect Fake Reviews and Fake Reviewers - Detect Opinion Spam Detecting fake or deceptive opinions on review sites, facebook, Twitter, Weibo, and forum discussion sites Intent Mining - Mining user Intents or Intentions in Social Media Posts Chapter 11 of my sentiment analysis book discusses this topic; also see this NAACL-HLT-2013 paper. Generate a Book Automatically using Web Content: Synthesize knowledge on the Web (See our WWW-2003 paper). Given a topic, discover sub-topics and related concepts, and synthesize information from multiple Web pages to present a coherent and fairly complete picture of the topic. Web Data Extraction from Flat/Nested Data Records - Web page template detection and noise removal Download MDR; Two new systems are DEPTA and NET. Data Mining and Knowledge Discovery Diagnostic Data Mining - Interestingness of Knowledge: Finding interesting and actionable knowledge. We built a system in 2006, called Opportunity Map (also known as OM in Motorola). It was deployed in 2006 and is still in regular use in Motorola. Motorola has sold copies of the system to some Telco companies. There is also a patent, but unfortunately it is owned by Motorola, not us :-(. Classification Based on Associations - Integrating Classification and Association Rule Mining Download CBA - asociation rules based classification. You can also use the CBA implementation of Frans Coenen from Univesity of Livepool. KDD-98 paper and others (KDD-99, PKDD-00, etc) Association rule mining with multiple minimum supports Interestingness: subjective interestingness, rule summary, rule query language, change mining Keynote and Invited Talks (not updated) -- (recent talks on continual learning, some older talks) Invited Talk. \"Sentiment Analysis with Lifelong Learning.\" ETS, December 7, 2015. Invited Talk. \"Sentiment Analysis with Lifelong Learning.\" Brigham Young University, December. 3, 2015. Keynote speech. \"Sentiment Analysis, Lifelong Learning and Intelligent Personal Assistants.\" The 2015 Conf. on Technologies and Applications of Artificial Intelligence (TAAI-2015). Taiwan, Nov. 20-22, 2015. Invited talk. \"Sentiment analysis and lifelong machine learning.\" Frontiers in Computational Mathematics: AMS Central Fall Sectional Meeting, October 2-4, 2015. Keynote speech. \"The State of Sentiment.\" Sentiment Analysis Symposium, New York City, July 15-16, 2015. Invited tutorial. \"Sentiment analysis: mining opinions, sentiments, and emotions.\" Sentiment Analysis Symposium, New York City, July 15-16, 2015. Keynote speech. \"Deception Detection via Pattern Mining of Web Usage Behavior\" Workshop on Data mining for Big Data: Applications, Challenges & Perspectives, Morocco, 03/25/2015 Keynote speech. \"Social Media Analysis via Continuous Learning.\" Adobe Text Analytics Summit, Feb 26, 2015. Some older talks Teaching Fall 2025: CS 583 - Data Mining and Text Mining Fall 2024: CS 583 - Data Mining and Text Mining Spring 2024: CS 583 - Data Mining and Text Mining Fall 2023: CS 583 - Data Mining and Text Mining Spring 2023: CS 583 - Data Mining and Text Mining Fall 2022: CS 583 - Data Mining and Text Mining Summer 2022: Lifelong and Continual Learning. A Short PhD Course (8 hours), Aalborg University, June 14 and 16, 2022. (Bing Liu and Zixuan Ke) Spring 2022: CS 411 - Artificial Intelligence I Past teaching Professional Recognitions and Memberships ACM Fellow, Association for Computing Machinery (ACM). AAAI Fellow, Association for the Advancement of Artificial Intelligence (AAAI) (was Amercian Association of Artificial Intelligence). IEEE Fellow, Institute of Electrical and Electronics Engineers (IEEE). Member, ACM Special Interest Group on Knowledge Discovery and Data Mining (SIGKDD). fake reviews: 2 and 3 First Draft: by Bing Liu on April 10, 2002.",
  "content_length": 7345,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:04"
}