{
  "name": "Bingpeng Ma",
  "homepage": "http://people.ucas.edu.cn/~bpma",
  "status": "success",
  "content": "马丙鹏-中国科学院大学-UCAS [中文] [English] Bingpeng MAProfessor, School of Computer Science and Technology, University of Chinese Academy of Science(UCAS), Beijing, 100190, China.马丙鹏，中国科学院大学，计算机科学与技术学院，教授，博士生导师。2009年在中国科学院计算技术研究所获工学博士学位，师从高文院士。2009年9月至2013年3月期间任教于华中科技大学计算机科学与技术学院，2011年至2012年期间在法国卡昂诺曼底大学从事博士后研究，合作导师Frederic Jurie教授。主要研究方向包括图像视频处理，计算机视觉，模式识别，人工智能和机器学习，尤其关注人体身份再识别、行人检测、行人跟踪等方面的研究。先后在包括IEEE T-PAMI、IEEE T-IP、CVPR和ICCV等本领域权威国际期刊与会议上发表学术论文80余篇，谷歌学术引用4000余次，2020年获得中国科学院朱李月华优秀教师奖。作为第一完成人荣获2018年中国计算机学会科学技术奖自然科学二等奖，指导研究生获得ICME 2018铂金最佳论文奖，ECCV 2018行人检测竞赛冠军,ECCV 2022 视觉目标跟踪竞赛（VOT 2022）矩形框标注下实时跟踪（RTb）和矩形框标注下短时跟踪（STb）两个赛道冠军。中国计算机学会高级会员，中国计算机学会青年计算机科技论坛(YOCSEF)学术委,中国计算机学会青年工作委员会委员。研究生招生：招生：2026年入学的研究生，目前有一个普博名额，请有意向的同学及时联系。 通常每年7月和9月招收研究生，同时也欢迎有坚实计算机专业基础的同学前来客座。Mr. Bingpeng MA received the PH.D degree in computer science from Institute of Computing Technology (ICT), Chinese Academy of Sciences (CAS) and the supervisor is Prof. Wen GAO.  From Oct. 2011 to Sept. 2012, he is the academic visitor of University of Caen, France. His supervisor in Caen is Frederic Jurie. He joined the School of Computer Science and Technology, University of Chinese Academy of Sciences, Beijing, in March 2013. Recent Research Focus:(1) Person Re-identification(2) Video Surveillance: Human Detection/Tracking, Vehicle Detection/Tracking, Vehicle Re-identification, Image/Video Representation  (3) Machine Learning Methods: Metric Learning, Deep Neural Networks, Manifold LearningJournal PaperJiahe Zhao, Ruibing Hou, Hong Chang, Xinqian Gu, Bingpeng Ma, Shiguang Shan and Xilin Chen. Clothes-Changing Person Re-Identification With Feasibility-Aware Intermediary Matching. IEEE Trans. on Multimedia, vol. 27, pp. 3303-3319, March 2025.[PDF]Ziqiang Wu and Bingpeng Ma. Prototype-Guided Text-based Person Search based on Rich Chinese Descriptions.  Pattern Recognition, vol. 169, January 2026. [PDF]Zhixiong Han and Bingpeng Ma. Enhancing Identification for Person Search with Multi-Scale Multi-Grained Representation Learning. Pattern Recognition, vol. 150, pp. 110361, June 2024. [PDF]Shutao Bai, Hong Chang and Bingpeng Ma. Incorporating texture and silhouette for video-based person re-identification. Pattern Recognition, vol. 156, pp. 110759, December 2024. [PDF]Ruibing Hou, Hong Chang, Bingpeng Ma, Shiguang Shan and Xilin Chen. Triplet Adaptation Framework for Robust Semi-Supervised Learning. IEEE Trans. on Pattern Analysis and Machine Intelligence, vol. 46, no. 12, pp. 8056-8073, December 2024. [PDF]Nan Kang, Hong Chang, Bingpeng Ma and Shiguang Shan. A Comprehensive Framework for Long-Tailed Learning via Pretraining and Normalization. IEEE Trans. on Neural Networks and Learning Systems, vol. 35, no. 3, pp. 3437-3449, March 2024. [PDF] Ruibing Hou, Hong Chang, Bingpeng Ma, Shiguang Shan and Xilin Chen. Dual Compensation Residual Networks for Class Imbalanced Learning. IEEE Trans. on Pattern Analysis and Machine Intelligence, vol. 45, no. 10, pp. 11733-11752, October 2023. [PDF] Ziqiang Wu, Bingpeng Ma, Hong Chang and Shiguang Shan. Refined Knowledge Transfer for Language-Based Person Search. IEEE Trans. on Multimedia, vol. 25, pp. 9315-9329, 2023. [PDF]Yuqi Liu and Bingpeng Ma. A Sketch Images-guided Pedestrian Costume-varied Re-identification Method. Journal of Image and Graphics, vol. 28, no.5, pp. 1396-1408, May 2023. [PDF](in Chinese)Cheng Wang, Bingpeng Ma, Hong Chang, Shiguang Shan and Xilin Chen. Person Search by a Bi-directional Task-Consistent Learning Model. IEEE Trans. on Multimedia, vol. 25, pp. 1190-1203, 2023. [PDF] Ruibing Hou, Hong Chang, Bingpeng Ma, Rui Huang and Shiguang Shan. Temporal Multi-scale Complementary Feature for Video Person Re-Identification. Chinese Journal of Computers, vol. 46, no.1, pp. 32-50, January 2023. [PDF] (in Chinese)Furong Xu, Bingpeng Ma, Hong Chang and Shiguang Shan. PRDP: Person Re-identification with Dirty and Poor Data. IEEE Trans. on Cybernetics, vol. 52, no. 10, pp. 11014-11026, October 2022. [PDF]  Ruibing Hou, Bingpeng Ma, Hong Chang, Xinqian Gu, Shiguang Shan and Xilin Chen. Feature Completion for Occluded Person Re-Identification. IEEE Trans. on Pattern Analysis and Machine Intelligence, vol. 44, no. 9, pp. 4894-4912, September 2022. [PDF]Xinqian Gu, Hong Chang, Bingpeng Ma and Shiguang Shan. Motion Feature Aggregation for Video-based Person Re-identification. IEEE Trans. on Image Processing, vol. 31, 3908-3919, 2022. [PDF] Linmao Zhou, Hong Chang, Bingpeng Ma and Shiguang Shan. Interactive Regression and Classification for Dense Object Detector. IEEE Trans. on Image Processing, vol. 31, pp. 3684-3696, 2022. [PDF]Shutao Bai, Bingpeng Ma, Hong Chang, Rui Huang, Shiguang Shan and Xilin Chen. SANet: Statistic Attention Network for Video-Based Person Re-Identification. IEEE Trans. on Circuits and Systems for Video Technology, vol. 32, no. 6, pp. 3866-3879, June 2022. [PDF] Xiaoyi Yin, Zhen Cui, Hong Chang, Bingpeng Ma and Shiguang Shan. Extending Generalized Unsupervised Manifold Alignment. SCIENCE CHINA Information Sciences, vol. 65, no. 7,  pp. 135-152, 2022. [PDF] Ziqiang Wu, Hong Chang and Bingpeng Ma. Person Re-identification Based on Fusion Relationship Learning Network. Pattern Recognition and Artificial Intelligence, vol. 34, no. 9, pp. 798-808, September 2021. [PDF] (in Chinese)Xiangzhou Zhang, Bingpeng Ma, Hong Chang, Shiguang Shan and Xilin Chen. Location Sensitive Network for Human Instance Segmentation. IEEE Trans. on Image Processing, vol. 30, pp. 7649-7662, 2021. [PDF]Ruibing Hou, Bingpeng Ma, Hong Chang, Xinqian Gu, Shiguang Shan and Xilin Chen. IAUnet: Global Context-Aware Feature Learning for Person Re-Identification. IEEE Trans. on Neural Networks and Learning Systems, vol. 32, no. 10, pp. 4460-4474, October 2021. [PDF] Yucheng Chen, Rui Huang, Hong Chang, Chuanqi Tan, Tao Xue and Bingpeng Ma. Cross-Modal Knowledge Adaptation for Language-Based Person Search. IEEE Trans. on Image Processing, vol. 30, pp. 4057-4069, 2021. [PDF]Fengling Mao, Bingpeng Ma, Hong Chang, Shiguang Shan and Xilin Chen. Learning Efficient Text to Image Synthesis via Interstage Cross-sample Similarity Distillation. SCIENCE CHINA Information Sciences, vol. 64, no. 2, pp. 120102:1-120102:12, 2021. [PDF]Furong Xu, Bingpeng Ma, Hong Chang and Shiguang Shan. Isosceles Constraints for Person Re-identification. IEEE Trans. on Image Processing, vol. 29, no. 11, pp. 8930-8943, November 2020. [PDF] Yucheng Chen, Bingpeng Ma and Hong Chang. Part Alignment Network for Vehicle Re-identification. Neurocomputing, vol. 418, no. 12, pp. 114-125, December 2020. [PDF] Kongming Liang, Hong Chang, Bingpeng Ma, Shiguang Shan and Xilin Chen. Unifying Visual Attribute Learning with Object Recognition in a Multiplicative Framework. IEEE Trans. on Pattern Analysis and Machine Intelligence, vol. 41, no. 7, pp. 1747-1760, July 2019. [PDF]Liang Zhang, Bingpeng Ma, Guorong Li, Qingming Huang and Qi Tian. Generalized Semi-supervised and Structured Subspace Learning for Cross-Modal Retrieval. IEEE Trans. on Multimedia, vol. 20, no. 1, pp. 128-141, January 2018. [PDF][Code]Jianfeng He, Bingpeng Ma, Shuhui Wang, Yugui Liu and Qingming Huang. Multi-label Double Layers Learning for Cross-Modal Retrieval. Neurocomputing, vol. 275, pp. 1893-1902, January 2018. [PDF]Jiazhong Chen, Bingpeng Ma, Hua Cao, Jie Chen, Yebin Fan, Rong Li and Weimin Wu. Updating Initial Labels from Spectral Graph by Manifold Regularization for Saliency Detection. Neurocomputing, vol. 266, pp.79-90, November 2017. [PDF]Jiazhong Chen, Bingpeng Ma, Hua Cao, Jie Chen, Yebin Fan, Tao Xia and Rong Li. Attention Region Detection Based on Closure Prior in Layered Bit Planes. Neurocomputing, vol. 251, pp. 16-25, August 2017. [PDF]Lingling Chang, Bingpeng Ma, Hong Chang and Zhiyi Ding. Comparative Study on Deep Network Architectures in Pedestrian Detection Task. Computer Simulation, vol. 34, no. 7, pp. 373-377, July 2017. [PDF] (in Chinese)Liang Zhang, Bingpeng Ma, Guorong Li, Qingming Huang and Qi Tian. Cross-modal Retrieval using Multi-ordered Discriminative Structured Subspace Learning. IEEE Trans. on Multimedia, vol. 19, no. 6, pp. 1220-1233, June 2017. [PDF]Wei Zhang, Bingpeng Ma, Kan Liu and Rui Huang. Video-Based Pedestrian Re-Identification by Adaptive Spatio-Temporal Appearance Model. IEEE Trans. on Image Processing, vol. 26, no. 4, pp. 2042-2054, April 2017. [PDF]Guorong Li, Bingpeng Ma, Jun Huang, Qingming Huang and Weigang Zhang. Beyond Appearance Model: Learning Appearance Variations for Object Tracking. Neurocomputing, vol. 214, pp. 796-804, November 2016. [PDF]Hao Liu, Bingpeng Ma, Lei Qin, Junbiao Pang, Chunjie Zhang and Qingming Huang. Set-Label Modeling and Deep Metric Learning on Person Re-Identification. Neurocomputing, vol. 151, no. 3, pp. 1283-1292, March 2015. [PDF]Bingpeng Ma, Rui Huang and Lei Qin. VoD: A Novel Image Representation for Head Yaw Estimation. Neurocomputing, vol. 148, pp. 455-466, January 2015.  [PDF]Bingpeng Ma, Annan Li, Xiujuan Chai and Shiguang Shan. CovGa: A Novel Descriptor based on Symmetry of Regions for Head Pose Estimation. Neurocomputing, vol. 143, pp. 97-108, November 2014. [PDF]Zhen Cui, Hong Chang, Shiguang Shan, Bingpeng Ma and Xilin Chen. Joint Sparse Representation for Video-based Face Recognition. Neurocomputing, vol. 135, pp. 306-312, July 2014. [PDF]Bingpeng Ma, Yu Su and Frederic Jurie. Covariance Descriptor based on Bio-inspired Features for Person Re-identification and Face Verification. Image and Vision Computing, vol. 32, no. 6-7, pp. 379-390, June 2014. [PDF][Code][Results]Bingpeng Ma, Xiujuan Chai and Tianjiang Wang. A Novel Feature Descriptor based on Biologically Inspired Feature for Head Pose Estimation. Neurocomputing, vol. 115, pp. 1-10, September 2013. [PDF]Jiazhong Chen, Zengwei Ju, Cao Hua, Bingpeng Ma, Changnian Chen, Leihua Qin and Rong Li. Accelerated Implementation of Adaptive Directional Lifting-based Discrete Wavelet Transform on GPU. Signal Processing: Image Communication, vol. 28, no. 9, pp. 1202-1211, Octob",
  "content_length": 23659,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:04"
}