{
  "name": "Bing Wang 0001",
  "homepage": "http://www.engr.uconn.edu/~bing",
  "status": "success",
  "content": "Wang, Bing | College of Engineering Our websites may use cookies to personalize and enhance your experience. By continuing without changing your cookie settings, you agree to this collection. For more information, please see our University Websites Privacy Notice. UConn Cookie Information What are Cookies? Authentication Cookies Analytics Cookies Opt Out Web cookies (also called HTTP cookies, browser cookies, or simply cookies) are small pieces of data that websites store on your device (computer, phone, etc.) through your web browser. They are used to remember information about you and your interactions with the site. Purpose of Cookies: Session Management: Keeping you logged in Remembering items in a shopping cart Saving language or theme preferences Personalization: Tailoring content or ads based on your previous activity Tracking & Analytics: Monitoring browsing behavior for analytics or marketing purposes Types of Cookies: Session Cookies: Temporary; deleted when you close your browser Used for things like keeping you logged in during a single session Persistent Cookies: Stored on your device until they expire or are manually deleted Used for remembering login credentials, settings, etc. First-Party Cookies: Set by the website you're visiting directly Third-Party Cookies: Set by other domains (usually advertisers) embedded in the website Commonly used for tracking across multiple sites Authentication cookies are a special type of web cookie used to identify and verify a user after they log in to a website or web application. What They Do: Once you log in to a site, the server creates an authentication cookie and sends it to your browser. This cookie: Proves to the website that you're logged in Prevents you from having to log in again on every page you visit Can persist across sessions if you select \"Remember me\" What's Inside an Authentication Cookie? Typically, it contains: A unique session ID (not your actual password) Optional metadata (e.g., expiration time, security flags) Analytics cookies are cookies used to collect data about how visitors interact with a website. Their primary purpose is to help website owners understand and improve user experience by analyzing things like: How users navigate the site Which pages are most/least visited How long users stay on each page What device, browser, or location the user is from What They Track: Some examples of data analytics cookies may collect: Page views and time spent on pages Click paths (how users move from page to page) Bounce rate (users who leave without interacting) User demographics (location, language, device) Referring websites (how users arrived at the site) Here’s how you can disable cookies in common browsers: 1. Google Chrome Open Chrome and click the three vertical dots in the top-right corner. Go to Settings > Privacy and security > Cookies and other site data. Choose your preferred option: Block all cookies (not recommended, can break most websites). Block third-party cookies (can block ads and tracking cookies). 2. Mozilla Firefox Open Firefox and click the three horizontal lines in the top-right corner. Go to Settings > Privacy & Security. Under the Enhanced Tracking Protection section, choose Strict to block most cookies or Custom to manually choose which cookies to block. 3. Safari Open Safari and click Safari in the top-left corner of the screen. Go to Preferences > Privacy. Check Block all cookies to stop all cookies, or select options to block third-party cookies. 4. Microsoft Edge Open Edge and click the three horizontal dots in the top-right corner. Go to Settings > Privacy, search, and services > Cookies and site permissions. Select your cookie settings from there, including blocking all cookies or blocking third-party cookies. 5. On Mobile (iOS/Android) For Safari on iOS: Go to Settings > Safari > Privacy & Security > Block All Cookies. For Chrome on Android: Open the app, tap the three dots, go to Settings > Privacy and security > Cookies. Be Aware: Disabling cookies can make your online experience more difficult. Some websites may not load properly, or you may be logged out frequently. Also, certain features may not work as expected. Close UConn College of Engineering COE Search University of Connecticut Search UConn Search University Communications Search UConn Search UConn A to Z Index UConn A to Z Index Click to open menu Professor, School of Computing Email bing@uconn.edu Phone (860) 486-0582 Mailing Address University of Connecticut 371 Fairfield Way, Unit 4155 Storrs, CT 06269-4155 Campus Storrs Link Research Website Google Scholar Link Overview Research Interests Projects Teaching Publications Related News Fellows Brief Bio Dr. Wang lead the Computer Networking Research Group at UConn. Her students and she work broadly in computer networking, including ubiquitous computing, multimedia streaming, network management, performance modeling and evaluation, and network security. She enjoy teaching both undergraduate and graduate-level computer science courses. These courses are maintained in HuskyCT, UConn’s learning management system. Computer Networking, Distributed and Real Time Systems, Cybersecurity, Cryptography, Privacy, Systems Optimal Proxy Cache Allocation for Efficient Streaming Media Distribution B Wang, S Sen, M Adler, D Towsley IEEE Transaction on Multimedia 6 (2), 366-374 Multimedia streaming via TCP: An analytic performance study B Wang, J Kurose, P Shenoy, D Towsley ACM Transactions on Multimedia Computing, Communications, and Applications … Correlating S&P 500 stocks with Twitter data Y Mao, W Wei, B Wang, B Liu Proceedings of the first ACM international workshop on hot topics on … Multimedia streaming via TCP: An analytic performance study B Wang, J Kurose, P Shenoy, D Towsley Proceedings of the 12th annual ACM international conference on Multimedia … LinkForecast: Cellular link bandwidth prediction in LTE networks C Yue, R Jin, K Suh, Y Qin, B Wang, W Wei IEEE Transactions on Mobile Computing 17 (7), 1582-1594 Behavior vs. introspection: refining prediction of clinical depression via smartphone sensing data AA Farhan, C Yue, R Morillo, S Ware, J Lu, J Bi, J Kamath, A Russell, ... 2016 IEEE wireless health (WH), 1-8 Multipath live streaming via TCP: scheme, performance and benefits B Wang, W Wei, Z Guo, D Towsley ACM CoNEXT 2007 Adaptive routing in underwater delay/disruption tolerant sensor networks Z Guo, G Colombi, B Wang, JH Cui, D Maggiorini, GP Rossi 2008 Fifth Annual Conference on Wireless on Demand Network Systems and … Deploying Energy Router in an Energy Internet Based Electric Vehicles P Yi, T Zhu, B Jiang, R Jin, B Wang IEEE Transactions on Vehicular Technology Predicting individual thermal comfort using machine learning algorithms AA Farhan, K Pattipati, B Wang, P Luh 2015 IEEE International conference on automation science and engineering … Passive online rogue access point detection using sequential hypothesis testing with TCP ACK-pairs W Wei, K Suh, B Wang, Y Gu, J Kurose, D Towsley Proceedings of the 7th ACM SIGCOMM conference on Internet measurement, 365-378 Continuous-time hidden Markov models for network performance evaluation W Wei, B Wang, D Towsley Performance Evaluation 49 (1-4), 129-146 Efficient error recovery with network coding in underwater sensor networks Z Guo, B Wang, P Xie, W Zeng, JH Cui Ad Hoc Networks 7 (4), 791-802 Efficient encrypted keyword search for multi-user data sharing A Kiayias, O Oksuz, A Russell, Q Tang, B Wang European symposium on research in computer security, 173-195 Malware detection for mobile devices using software-defined networking R Jin, B Wang 2013 Second GENI research and educational experiment workshop, 81-88 Enabling resilient distributed power sharing in networked microgrids through software defined networking L Ren, Y Qin, Y Li, P Zhang, B Wang, PB Luh, S Han, T Orekan, T Gong Applied Energy 210, 1251-1265 Network performance of smart mobile handhelds in a university campus WiFi network X Chen, R Jin, K Suh, B Wang, W Wei Proceedings of the 2012 internet measurement conference, 315-328 Joint modeling of heterogeneous sensing data for depression assessment via multi-task learning J Lu, C Shang, C Yue, R Morillo, S Ware, J Kamath, A Bamis, A Russell, ... Proceedings of the ACM on interactive, mobile, wearable and ubiquitous … A practical joint network-channel coding scheme for reliable communication in wireless networks Z Guo, J Huang, B Wang, JH Cui, S Zhou, P Willett Proceedings of the tenth ACM international symposium on Mobile ad hoc … Enabling resilient microgrid through programmable network L Ren, Y Qin, B Wang, P Zhang, PB Luh, R Jin IEEE Transactions on Smart Grid 8 (6), 2826-2836",
  "content_length": 8720,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:10"
}