{
  "name": "Bingkai Lin",
  "homepage": "https://sites.google.com/site/bingkai314159",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationLin Bingkai (林 冰凱)Email: lin at nju.edu.cnPO Box 603, 163 Xianlin Ave, Nanjing, Jiangsu Province, China, 210023Ph.D. (2016), The University of TokyoMS(2013) and BE(2010), ACM Honors Class, Shanghai Jiao Tong University.Professor, School of Computer Science,  Nanjing University.Research Interests:graph theory, parameterized complexity, extremal combinatoric, hardness of approximation.Talks at Dimacs workshop 2025. pdf1 pdf2Talk at ITCS, SHUFE. pdfTalk at PAAW, pdfTalk at ICALP 2019, pdfTalk at SODA 2020, pdfTalk at STOC 2021, pdfPublications:with Yusuke Kobayashi, Hardness and Fixed Parameter Tractability for Pinwheel Scheduling Problems. ISAAC 2025.with Yijia Chen,Parameterized inapproximability: From Clique to PIH. Computer Science Review.with Yijia Chen, Yuwei Liu, Shuangle Li, Xin Zheng, On Average Baby PIH and Its Applications. STACS 2025.with Venkatesan Guruswami, Xuandi Ren, Yican Sun, Kewen Wu, Almost Optimal Time Lower Bound for Approximating Parameterized Clique, CSP, and More, under ETH. STOC 2025.(slides)with Venkatesan Guruswami, Xuandi Ren, Yican Sun, Kewen Wu, Parameterized Inapproximability Hypothesis under ETH, STOC 2024, Best Paper Award.(slides)Journal version: Parameterized Inapproximability Hypothesis under ETH. Journal of the ACMwith Shuangle Li, Yuwei Liu, Improved Lower Bounds for Approximating Parameterized Nearest Codeword and Related Problems under ETH, ICALP 2024. (slides)with Huairui Chu, FPT Approximation using Treewidth: Capacitated Vertex Cover, Target Set Selection and Vector Dominating Set, ISAAC 2023. (slides)with Xuandi Ren, Yican Sun, Xiuhan Wang, Improved Hardness of Approximating k-Clique under ETH. FOCS 2023. (slides)with Xuandi Ren, Yican Sun, Xiuhan Wang, Constant Approximating Parameterized k-SetCover is W[2]-hard. SODA 2023.with Xuandi Ren, Yican Sun, Xiuhan Wang, On Lower Bounds of Approximating Parameterized k-Clique. ICALP 2022.Constant approximating k-clique is w[1]-hard.  STOC 2021.with A.Bhattacharyya, É. Bonnet, L. Egri, S. Ghoshal, Karthik C.S., P.Manurangsia, D.Marx,  Parameterized Intractability of Even Set and Shortest Vector Problem.  Journal of the ACM, 68(3):16:1-16:40, 2021.with Ken-ichi Kawarabayashi, A nearly 5/3-approximation FPT Algorithm for Min-k-Cut.  SODA 2020A Simple Gap-producing Reduction for the Parameterized Set Cover Problem. ICALP 2019(track A), best paperThe Parameterized Complexity of k-Biclique. Journal of the ACM (JACM), Volume 65 Issue 5 (2018)Conference version: The Parameterized Complexity of k-Biclique. SODA 2015, best paper and best student paperwith Yijia Chen, The parameterized complexity of k-edge induced subgraphs. Information and Computation, Volume 252 (2017), 138-160Conference version: The parameterized complexity of k-edge induced subgraphs. ICALP 2012(track A)with Yijia Chen, The Constant Inapproximability of the Parameterized Dominating Set Problem. FOCS 2016with Yijia Chen, Martin Grohe, The hardness of embedding grids and walls. WG 2017with Chihao Zhang, Xiaojie Deng, Multi-Multiway Cut Problem on Graphs of Bounded Branch Width. FAW-AAIM 2013On Parameterized Inapproximability of Several Optimization Problems. PhD thesis 2016Links:School on Parameterized Algorithms and ComplexityOpen Problem ListParameterized Complexity WikiTen Lessons I wish I had been TaughtThe Barrier of Meaning(an interesting discussion on the AI-problem)Turning STOC 2017 into a “Theory Festival”Graph ClassesGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 3578,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:05"
}