{
  "name": "Bingyao Li",
  "homepage": "https://libingyao.github.io",
  "status": "success",
  "content": "Bingyao Li Profile Page Hi! I am an Assistant Professor in the Department of Computer Science and Engineering, University of California, Riverside. I received my Ph.D. in Computer Science from the University of Pittsburgh, where I was advised by Dr. Xulong Tang. I earned my B.E. and M.S. degrees from the College of Intelligence and Computing at Tianjin University in 2017 and 2020, respectively. My research interests lie broadly in advanced computer architectures, high-performance computing systems, and emerging parallel applications, with a specific focus on the GPU ecosystem from architecture to application. My work aims to design architectures and system features for next-generation GPU systems, enabling and supporting emerging large-scale applications on both single- and multi-GPU platforms. I am also actively working on system-level optimizations for large language model serving. Prospective Students: I am looking for 2-3 self-motivated Ph.D. students to start in Fall 2026. Feel free to contact me at bingyaol@ucr.edu with CV and transcript. Warning Problem: The current name of your GitHub Pages repository (\"\") does not match the recommended repository name for your site (\"\"). Solution: Please consider renaming the repository to \"\", so that your site can be accessed directly at \"http://\". However, if the current repository name is intended, you can ignore this message by removing \"{% include widgets/debug_repo_name.html %}\" in index.html. Action required Problem: The current root path of this site is \"\", which does not match the baseurl (\"\") configured in _config.yml. Solution: Please set the baseurl in _config.yml to \"\". News 11/2024 One paper is accepted by HPCA 2025. Thanks to all collaborators! 07/2024 One paper is accepted by MICRO 2024. Thanks to all collaborators! 06/2024 Gave a talk on \"Towards Efficient and Salable Computing for Multi-GPUs\" at NVIDIA. 05/2024 Start intern at NVIDIA Architecture Research Group. 10/2023 One paper is accepted by HPCA 2024. Thanks to all collaborators! 07/2023 One paper is accepted by MICRO 2023. Thanks to all collaborators! 06/2023 Awarded the CS50 Outstanding Research Fellowship. 04/2023 Gave a talk on \"Towards Efficient and Salable Computing for Multi-GPUs\" at Tianjin University. 02/2023 One paper is accepted by DAC 2023. Thanks to all collaborators! 10/2022 One paper is accepted by HPCA 2023. Thanks to all collaborators! 04/2022 Awarded the CS50 Outstanding Research Fellowship. 07/2021 One paper is accepted by MICRO 2021. Thanks to all collaborators! Selected Publications (view all ) HPCA 2025 OASIS: Object-Aware Page Management for Multi-GPU Systems Yueqi Wang, Bingyao Li, Mohamed Tarek Ibn Ziad, Lieven Eeckhout, Jun Yang, Aamer Jaleel, and Xulong Tang The 31th IEEE International Symposium on High-Performance Computer Architecture 2025 MICRO 2024 STAR: Sub-Entry Sharing-Aware TLB for Multi-Instance GPU Bingyao Li, Yueqi Wang, Tianyu Wang, Lieven Eeckhout, Jun Yang, Aamer Jaleel, and Xulong Tang In Proceedings of the 57th IEEE/ACM International Symposium on Microarchitecture 2024 HPCA 2024 GRIT: Enhancing Multi-GPU Performance with Fine-Grained Dynamic Page Placement Yueqi Wang*, Bingyao Li*, Aamer Jaleel, Jun Yang, and Xulong Tang (*The authors contribute equally) The 30th IEEE International Symposium on High-Performance Computer Architecture 2025 MICRO 2023 IDYLL: Enhancing Page Translation in Multi-GPUs via Light Weight PTE Invalidations Bingyao Li, Yanan Guo, Yueqi Wang, Aamer Jaleel, Jun Yang, and Xulong Tang In Proceedings of the 56th IEEE/ACM International Symposium on Microarchitecture 2023 DAC 2023 Orchestrated Scheduling and Partitioning for Improved Address Translation in GPUs Bingyao Li, Yueqi Wang, and Xulong Tang The 60th Design Automation Conference 2023 HPCA 2023 Trans-FW: Short Circuiting Page Table Walk in Multi-GPU Systems via Remote Forwarding Bingyao Li, Jieming Yin, Anup Holey, Youtao Zhang, Jun Yang, and Xulong Tang The 29th IEEE International Symposium on High-Performance Computer Architecture 2023 MICRO 2021 Improving Address Translation in Multi-GPUs via Sharing and Spilling aware TLB Design Bingyao Li, Jieming Yin, Youtao Zhang, and Xulong Tang In Proceedings of the 54th IEEE/ACM International Symposium on Microarchitecture 2021",
  "content_length": 4279,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:05"
}