{
  "name": "Bingsheng He",
  "homepage": "http://www.comp.nus.edu.sg/~hebs",
  "status": "success",
  "content": "Bingsheng He @ NUS SoC Welcome to Dr. Bingsheng He's Homepage Professor, Vice Dean (Research), NUS School of Computing, Department of Computer Science, School of Computing, National University of Singapore Office: #COM3-02-12, COM3 Building, 11 Research Link, NUS, Singapore 119391[map] Ph.D. HKUST, 2008   Email: dcsheb(at)nus.edu.sg Phone: (65) 6516 7998, Fax: (65) 6779 4580 Site Navigator: [CV] [Influential Works] [Research and Publication] [Teaching and Supervision] [Academic Services] [Awards] [Prospective Students] Bio Dr. Bingsheng He is currently a Professor and Vice-Dean (Research) at School of Computing, National University of Singapore. Before that, he was a faculty member in Nanyang Technological University, Singapore (2010-2016), and held a research position in the System Research group of Microsoft Research Asia (2008-2010). He got the Bachelor degree in Shanghai Jiao Tong University (1999-2003), and the Ph.D. degree in Hong Kong University of Science & Technology (2003-2008). His current research interests include cloud computing, database systems and high performance computing. He has been a winner for industry faculty awards from Google, Microsoft, NVIDIA, AMD/Xilinx, Alibaba and Bytedance etc. His work also won multiple recognitions as \"Best papers\" collection or awards in top forums such as SIGMOD 2008, VLDB 2013 (demo), IEEE/ACM ICCAD 2017, PACT 2018, IEEE TPDS 2019, FPGA 2021, VLDB 2023 (industry) and VLDB 2024. Since 2010, he has (co-)chaired a number of international conferences and workshops, including IEEE CloudCom 2014/2015, BigData Congress 2018, ICDCS 2020 and ICDE 2024. He has served in editor board of international journals, including IEEE Transactions on Cloud Computing (IEEE TCC), IEEE Transactions on Parallel and Distributed Systems (IEEE TPDS), IEEE Transactions on Knowledge and Data Engineering (TKDE), Springer Journal of Distributed and Parallel Databases (DAPD) and ACM Computing Surveys (CSUR). He is an ACM Distinguished member (class of 2020), and an fellow of IEEE (class of 2025). Recent Updates We are hiring! Several positions including Ph.D. students, Research Fellow, and Research Assistant are available. Research areas: 1) Infrastructure and systems for large Language Model (LLM): fine-tuning, inference, systems and applications, and 2) Reconfigurable computing (such as building 10X more energy efficient data and AI systems on FPGAs), and 3) Digital finance and blockchain (such as building next generation digital finance and blockchain systems) More about our research can be found in the following surveys: A Survey on Federated Learning Systems: Vision, Hype and Reality for Data Privacy and Protection AI-powered Fraud Detection in Decentralized Finance: A Project Life Cycle Perspective A survey of imbalanced learning on graphs: Problems, techniques, and future directions Vertical Federated Learning in Practice: The Good, the Bad, and the Ugly Some interesting position papers: Position: The Current AI Conference Model is Unsustainable! Diagnosing the Crisis of Centralized AI Conference Position: Current Model Licensing Practices are Dragging Us into a Quagmire of Legal Noncompliance Call for contributions. Xtra members are building various data systems. See Repositories for Xtra Computing Group. For example, ThunderSVM and ThunderGBM has got 1.1K and over 500 stars in GitHub. We still have quite some issues to make the libraries more usable and functional. Please let me know if you want to join this journey. ThundeRiNG can generate 655 billion random numbers per second on a single FPGA! Jan 2025: Dr. Shuhao Zhang and Dr. Qinbin Li won China Overseas Outstanding Youth Scholar Award 2024, and joined Huazhong University of Science and Technology as FULL professors. Dec 2024: I am elected as an IEEE Fellow (class of 2025). Sept 2024: Best Research Paper Award Nomination for VLDB 2024 (for the work of \"LLM-PBE: Assessing Data Privacy in Large Language Models\" in VLDB 2024, Paper, Project Website), Besides, we have other two VLDB papers. Yuhang Chen*, Jiaxin Jiang^, Shixuan Sun, Bingsheng He, Min Chen. RUSH: Real-time Burst Subgraph Discovery in Dynamic Graphs. VLDB: International Conference on Very Large Data Bases (VLDB) 2024. Yiqun Diao*, Yutong Yang*, Qinbin Li*, Bingsheng He, Mian Lu. OEBench: Investigating Open Environment Challenges in Real-World Relational Data Streams. VLDB: International Conference on Very Large Data Bases (VLDB) 2024. (also published in Proc. VLDB Endow. (2023)). June 2024: Dr. Zemin Liu won China Overseas Outstanding Youth Scholar Award 2023, and join Zhejiang University as Tenure-track professor ACM SIGMOD23 Honorable Mention for Best Artifact (for the work of \"DeltaBoost: Gradient Boosting Decision Trees with Efficient Machine Unlearning\" in SIGMOD 2023, Paper, Project Website) April 2024: ICLR 2024 Spotlight (for the work \"Nan Chen^, Zemin Liu^, Bryan Hooi, Bingsheng He, Rizal Fathony, Jun Hu^, Jia Chen. Consistency Training with Learnable Data Augmentation for Graph Anomaly Detection with Limited Supervision. ICLR: The Eleventh International Conference on Learning Representations 2024.\"). Besides, we have other four ICLR papers. Qinbin Li*, Chulin Xie, Xiaojun Xu, Xiaoyuan Liu, Ce Zhang, Bo Li, Bingsheng He, Dawn Song. Effective and Efficient Federated Tree Learning on Hybrid Data. ICLR: The Eleventh International Conference on Learning Representations 2024. Zhaomin Wu*, Junyi Hou*, Bingsheng He. VertiBench: Advancing Feature Distribution Diversity in Vertical Federated Learning Benchmarks. ICLR: The Eleventh International Conference on Learning Representations 2024. Qian Wang*, Zhen Zhang^, Zemin Liu^, Shengliang Lu^, Bingqiao Luo*, Bingsheng He. EX-Graph: A Pioneering Dataset Bridging Ethereum and X. ICLR: The Eleventh International Conference on Learning Representations 2024. Wei Zhuo*, Zemin Liu^, Bryan Hooi, Bingsheng He, Guang Tan, Rizal Fathony, Jia Chen. Partitioning Message Passing for Graph Fraud Detection. ICLR: The Eleventh International Conference on Learning Representations 2024. Highlights in NUS School of Computing: Conversation With Professor He Bingsheng, Vice Dean of Research Sept 2023: Dr. Shixuan Sun won China Overseas Outstanding Youth Scholar Award 2022, and join Shanghai Jiao Tong University as Tenure-track professor VLDB 2023 Industry Track Best Paper Runner-up Award (for the work \"Xuanhe Zhou, Cheng Chen, Kunyi Li, Bingsheng He, Mian Lu, Qiaosheng Liu, Wei Huang, Guoliang Li, Zhao Zheng, Yuqiang Chen. FEBench: A Benchmark for Real-Time Relational Data Feature Extraction. VLDB: International Conference on Very Large Data Bases (VLDB) 2023.\") Sept 2022: Basic Theory and Approaches for High-Performance Big Data Processing, CCF Natural Science Awards, 2022, first prize July 2022: Open-source: NIID-Bench: a benchmark for federated learning algorithms under non-IID data distribution scenarios. By Qinbin Li and Yiqun Diao. Open-source: FedTree: a federated learning system for tree-based models. By Qinbin Li etc. Oct 2021: Qinbin Li, Zeyi Wen, Zhaomin Wu, Sixu Hu, Naibo Wang, Xu Liu, Bingsheng He. A Survey on Federated Learning Systems: Vision, Hype and Reality for Data Privacy and Protection. Accepted by IEEE Transactions on Knowledge and Data Engineering. Our demo paper \"From Community Search to Community Understanding: A Multimodal Community Query Engine\" received the Best Demo Paper Runner-up Award at CIKM 2021 (Queensland). Sept 2021: Mr. Qinbin Li got Google PhD Fellowship 2021. My Google citation has reached five digits :) Zeyi Wen, Zhishang Zhou, Hanfeng Liu, Bingsheng He, Xia Li, Jian Chen. Enhancing SVMs with Problem Context Aware Pipeline. ACM KDD: In Proceedings of the 27th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 21) Jin Zhao, Yu Zhang, Xiaofei Liao, Ligang He, Bingsheng He, Hai Jin, Haikun Liu. LCCG: A Locality-Centric Hardware Accelerator for High Throughput of Concurrent Graph Processing. IEEE/ACM SC: International Conference for High Performance Computing, Networking, Storage and Analysis 2021. Shixuan Sun^, Yuhang Chen*, Shengliang Lu*, Bingsheng He, Yuchen Li: ThunderRW: An In-Memory Graph Random Walk Engine. VLDB: International Conference on Very Large Data Bases (VLDB) 2021. (also published in Proc. VLDB Endow. 14(11): 1992-2005 (2021)). [Book] Johns Paul*, Shengliang Lu* and Binsheng He. Database Systems on GPUs. Foundations and Trends in Databases (Now Publisher) 2021. July 2021: Mr. Shengliang Lu, Mr. Qinbin Li and Mr. Xinyu Chen got Research Achievement Award of SoC, 2021. Hongshi Tan*, Xinyu Chen*, Yao Chen, Bingsheng He, Weng-Fai Wong. ThundeRiNG: Generating Multiple Independent Random Number Sequences on FPGAs. ACM ICS: International Conference on Supercomputing 2021. Qinbin Li*, Bingsheng He, Dawn Song. Practical One-Shot Federated Learning for Cross-Silo Setting. IJCAI: 30th International Joint Conference on Artificial Intelligence, 2021. [Survey] Zeyi Wen^, Qinbin Li*, Bingsheng He, Bin Cui. Challenges and Opportunities of Building Fast GBDT Systems. IJCAI: 30th International Joint Conference on Artificial Intelligence - Survey Track, 2021. May 2021: Our ThunderGP paper was selected as one of the top papers at FPGA 2021, invited to submit to FPGA 2021 Special Issue in ACM TRETS. PREMIA Best Student Paper Gold Award 2021 (for the work \"Qinbin Li*, Zeyi Wen^, Bingsheng He. Practical Federated Gradient Boosting Decision Trees. AAAI: Thirty-Fourth AAAI Conference on Artificial Intelligence (AAAI-2020)\"). March 2021: Johns Paul*, Bingsheng He, Shengliang Lu*, Chiew Tong Lau. MG-Join: A Scalable Join for Massively Parallel Multi-GPU Architectures. ACM SIGMOD: ACM SIGMOD International Conference on Management of Data 2021. Shengliang Lu*, Shixuan Sun^, Johns Paul*, Yuchen Li, Bingsheng He. Cache-Efficient Fork-Processing Patterns on Large Graphs. ACM SIGMOD: ACM SIGMOD International Conference on Management of Data 2021. Shixuan Sun^, Yuhang Chen*, Bingsheng He, Bryan Hooi. Path",
  "content_length": 11304,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:06"
}