{
  "name": "Binh T. Nguyen",
  "homepage": "https://tbng.github.io",
  "status": "success",
  "content": "Binh T. Nguyen Binh T. Nguyen About | Teaching About Starting in Summer 2025, I am an Assistant Professor at the College of Engineering & Computer Science (CECS) of VinUniversity. My current research interest are on generative models, optimal transport and AI safety, with a focus on methodological/theoretical side. Before joining VinUniversity, from 2023-2025, I was a Research Fellow at Mathematics Department of National University of Singapore (NUS), working with Soh Yong Sheng. Before that, in 2022, I was a postdoctoral researcher at Télecom Paris, working with Florence d’Alché, Gabriel Peyré and Remi Flamary on the applications of optimal transport to machine learning. I obtained my PhD in 2021 within the Proba-Stat team of Département de Mathématiques d’Orsay and INRIA Parietal team, working with problems in high-dimensional statistics. I was very fortunate to be advised by Sylvain Arlot and Bertrand Thirion. I spent a fair amount of time during my PhD for the developments of open-source software, and still code daily (though less than I want to). Check out Nilearn, hidimstat, and Benchopt for the open-source projects that I have been developing/contributing to. Interested in research collaborations? I am recruiting junior researchers at all ranks working at the CECS of VinUniversity: Undergraduate/Research assistants Master/Ph.D. students Postdoctoral Fellows Or just research collaborator The topics are flexible, but should be based on my research interest, and the remuneration is attractive. Please contact me by email or fill in this Google Form. Contact tuanbinhs [AT] gmail.com binh.nt2 [AT] vinuni.edu.vn github.com/tbng Research (I no longer maintain this list; for the most recent publication lists, please see my Google Scholar) *: Equal contributions. Chen, JY.*, BN* , Soh, YS. Semidefinite Relaxations of the Gromov-Wasserstein Distance. NeuRIPS 2024. [paper] [code] [reviews] – A preliminary version was presented at the Optimal Transport and Machine Learning workshop at NeuRIPS 2023. Nguyen, NB., BN, Nguyen, TH., Nguyen, VA. Generative Conditional Distributions by Neural (Entropic) Optimal Transport, ICML 2024. [paper] [code] Nguyen, NB., BN, Nguyen, VA. Bellman Optimal Step-size Straightening of Flow-Matching Models, ICLR 2024. [paper & reviews] [code] Dao, Q., Phung, H., BN, & Tran, A. Flow Matching in Latent Space. arXiv 2023. [paper] [code] BN, Thirion, B., & Arlot, S. A Conditional Randomization Test for Sparse Logistic Regression in High-Dimension. NeuRIPS 2022. [paper] [code] [reviews] Moreau, T. et al. Benchopt: Reproducible, efficient and collaborative optimization benchmarks. NeuRIPS 2022. [paper] [code] [reviews] J.-A. Chevalier, BN, B. Thirion J. Salmon, Spatially relaxed inference on high-dimensional linear models. Statistics & Computing 32, 83 (2022). [paper] J.-A. Chevalier, BN, J. Salmon, G. Varoquaux, B. Thirion, Decoding with confidence: Statistical control on decoder maps. In NeuroImage, Volume 234, 2021, 117921, ISSN 1053-8119. [paper] BN, J.-A. Chevalier, B.Thirion, & S. Arlot, Aggregation of Multiple Knockoffs. In Proceedings of the 37th International Conference on Machine Learning (ICML); PMLR 119:7283-7293, 2020. [paper] [code] BN, J.-A Chevalier, & B. Thirion, ECKO: Ensemble of Clustered Knockoffs for Robust Multivariate Inference on fMRI Data. In International Conference on Information Processing in Medical Imaging (pp. 454-466). Springer, Cham., 2019 [paper] Slides Slides of my thesis defense.",
  "content_length": 3492,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:06"
}