{
  "name": "Binhang Yuan",
  "homepage": "https://cse.hkust.edu.hk/admin/people/faculty/profile/biyuan",
  "status": "success",
  "content": "Binhang YUAN | HKUST CSE More about HKUST University News Academic Departments A-Z Life@HKUST Library Map & Directions Careers at HKUST Faculty Profiles About HKUST Intranet School of Engineering Quick Links for Undergraduates Postgraduates Faculty & Staff Alumni Job Seekers Employers & Industry Partners About Welcome Mission & Vision About CSE Fast Facts News & Events Job Openings Contact Us People Faculty Staff Postgraduates Alumni Research Research Themes Research Labs & Centers Research Projects Computing Facilities Academics Undergraduate Postgraduate Enrichment Quality Assurance Admissions Undergraduate Postgraduate PG Early Recruiting Graduate Placements School of Engineering Binhang YUAN Binhang YUAN 袁彬航 PhD in Computer Science, Rice University Assistant Professor Tel: (852) 2358 6978 Email: Office: Room 3517 Links: Personal Webpage Faculty Profile Scholar Profile Google Scholar Telephone (852) 2358 6978 Email Office Room 3517 Personal Webpage https://cse.hkust.edu.hk/~biyuan/ Research Area Loading ... Data, Knowledge and Information Management Research Interests Data management systems for machine learning; Distributed machine learning systems Biography Binhang Yuan is an Assistant Professor at the Department of Computer Science and Engineering (CSE), the Hong Kong University of Science and Technology (HKUST). He received his Ph.D. and master's degrees from Rice University and his bachelor's degree from Fudan University. Before joining HKUST, he was a Postdoc at the Swiss Federal Institute of Technology Zurich (ETH Zurich). His main research interests are in data management systems for machine learning, distributed and decentralized machine learning systems. His work won the Best Paper Honorable Mention Award at VLDB and Research Highlight Award in SIGMOD. Navigation Navigation About Welcome Mission & Vision About CSE Fast Facts News & Events Job Openings Contact Us People Faculty Staff Postgraduates Alumni Research Research Themes Research Labs & Centers Research Projects Computing Facilities Academics Undergraduate Postgraduate Enrichment Quality Assurance Admissions Undergraduate Postgraduate PG Early Recruiting Graduate Placements Last updated on 2023-07-25 Privacy Sitemap Copyright © The Hong Kong University of Science and Technology. All rights reserved. Follow us on Facebook LinkedIn Instagram YouTube Contact Us Privacy Sitemap Follow us on Facebook LinkedIn Instagram YouTube Contact Us Copyright © The Hong Kong University of Science and Technology. All rights reserved.",
  "content_length": 2530,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:06"
}