{
  "name": "Bipin C. Desai",
  "homepage": "http://www.cs.concordia.ca/~bcdesai",
  "status": "success",
  "content": "Bipin C. DESAI Dr. Bipin C. DESAI Address: Dept. of Computer Science & Software Engineering Concordia University, Montreal, H3G 1M8 Canada Telephone: +1 514 848 2424(3025) messages +1 514 848 3000 Fax: +1 514 848 2830 Email: Bipin C period Desai AT concordia yet-another dot two-character-code-4-CANADA-with-no-spaces!! Pl. note: This page and all the associated ones are updated, very irregularly!!. Your email would never reach me, specially if it comes from free email sites which mines private email messages for their own enrichment; such emails would be deleted by my spam filter and sent to /dev/null. If you want to reach me, get yourself an email address e.g., which is from your own university or work place. Let us hope that some time soon, the idiotic/bent/egoist politicians would use the public postal systems to manage a secure publicly controlled email system. Even though I was involved in the very early days of the WWW, it has been a dis-appointing betrayal of its original intent. I do not participate in any networks - social(!) or unsocial, so pl. don't invite me to join any! If you are a prospective masters thesis student and want me to supervise you, you must be able to fund your graduate studies (must have funds for: fees, living, personal , emergencies expenses). I am very selective and don't expect a reply to your request. I lo longer take doctoral students Current Research Interests: Applications of AI and Intelligent Systems, Applications of Cryptography, Database Systems, Database Engineering and Applications, Econsumer and Ecommerce, Privacy and Security, Virtual Library, Web and its applications Useful Links CopyForward An Introduction to Database Systems An Introduction to Database Systems: Second edition WORK IN PROGRESS! Solutions-to-selected-exercises--An-Introduction-to-Database-Systems_Bipin_C._DESAI - epub and PDF versions Database Web Programming An electronic text book on Web-database programming covering HTML, JavaScript, PhP, Mysql/MaraiDB. Database Web Programming (Complete)Examples from Web-database programming using HTML, JavaScript, PhP, Mysql/MaraiDB. Lecture Notes for COMP5531 Files and Databases ConfSys - A Complete Academic Conference and Journal Management System Allows all phases of a academic meeting from CFP to the final program and presentation. The current system is in its 5th version and has been used over the years to manage a number of academic conferences including C3S2E and IDEAS. ConfSys is availble, at no cost, to host and manage, not-for-profit, academic meetings. CrsMgr: Course Manager System This is a system to allow a professor, a department, a faculty to manage all aspects of one or more courses; it could be a single section or multi-section one requiring individual or group work(which could use peer evaluation to gather the contribution of the mebers of a group). Has its own on-line submission and quiz system. Source code available under CopyForward C3S2E -International C* Conference on Computer Science & Software Engineering C3S2E is a series of annual international conference to address the need of the academic community in computing science and software engineering. . The meeting were held from 2008 through 2016 and the final programs of all these m eeting have been compiled and accessible here and also from Spectrum IDEAS: International Database Engineering & Applications Symposium IDEAS provides an international forum for discussion of the problems of engineering database systems involving not only database technology but the related areas of information retrieval, multimedia, human machine interface and communication. Note: The IDEAS series, after a quarter century and over 26 meetings, has been re-incarnated as a new series. The steering committee members of IDEAS have retired and the new series as IDEAS-II had its founding meeting in 2022. The detailed final programs of all 26 meeting of IDEAS are here and also in Spectrum IDEAS-II: International Database Engineered Applications Symposium IDEAS provides an international forum for discussion of the problems of engineering database systems involving not only database technology but the related areas of information retrieval, multimedia, human machine interface and communication. CINDI - A Digital Library Search | Contacts | Home | Disclaimer Concordia University | Faculty of ENCS | Department of CS http://users.encs.concordia.ca/~bcdesai Last updated Feb. 1, 2007.",
  "content_length": 4455,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:10"
}