{
  "name": "Biplav Srivastava",
  "homepage": "https://sites.google.com/site/biplavsrivastava",
  "status": "success",
  "content": "Dr. Biplav SrivastavaSearch this siteEmbedded FilesSkip to main contentSkip to navigationDr. Biplav SrivastavaProfessor, AI Institute, University of South CarolinaACM Distinguished Scientist, AAAI Senior Member, IEEE Senior Member, AAAS Leshner Fellow (2020-21)Contact: biplav.s AT sc.edu, +1 518 496 0128, @biplav_s (Twitter), LinkedIn, Research group - AI for Society (AI4S)I am a Professor of Computer Science at the AI Institute at University of South Carolina, Columbia, SC, USA.  Here are links to my Google researcher profile, LinkedIn profile and my research group webpage, AI for Society**, which has the latest research information. Research InterestsMy research deals with enabling people to make rational decisions despite real world complexities of poor data, changing goals and limited resources by augmenting their cognitive limitations with technology. I am working on (details - recent, collective): (Fundamentals oriented) Neuro-symbolic methods, that are methods which combine symbolic and neural methods. In particular, we are focusing on AI sub-areas of planning and group recommendation, and how LLMs may help overcome existing research challenges. (Usability oriented) Trusted AI, that is how to make AI reliable, with chatbots as a particular usecase.(Application oriented) Use sensor and open data for better decisions for better living in Smarter Communities (water, elections, finance, power, health)Information AvailableOne can go to pages with more details on my background, research (students, papers, patents, tools), teaching, communication (talks, technical blogs, client interactions, professional activities, opinions and research ideas for community) and resume. Personal NoteI am involved with organizing a Meetup, called TechTalk, to engage local community in technology (2025-) and in a privately funded non-governmental organization, called APPLTrust,  doing public service in health and education in India (2006-).Pick-3 Highlights Research and Publications: Generative AI result Comparator tool (GAICO; IAAI/AAAI2026); AI-driven group recommendation (teaming recommendations  - IAAI/AAAI 2024 Deployed Award); Generalized planning using metacognitive architecture, search, deep learning transformers, search, and knowledge (ontology); SafeChat architecture - 2025)(election instance  AI Magazine 2023), Trust ratings (AI Ethics; Dec 2023) for critical applications like elections and education, information spread in opinion networks (AAAI 2024 best demo award and Neurips 2024);  Traffic management in SC (AAAI 2025), Power and AI/ML (IAAI/ AAAI 2023, with Tantiv4), Teaching and Activities: AI outreach event, Safe AI for Seniors (Nov 14, 2025); Read about teaching innovations, CSCE-581 Trusted AI becomes regular course starting Fall 2023; Leading workshop on AI for Credible Elections at AAAI-24, Collaborative activities with HBCU Benedict(Spring 2023)Funding and Collaborations: Corporate - JP Morgan Research, Cisco Research, Tantiv4, IBM Research; Government - NSF, UMD/Arlis/DoD, SCRA; Academic - MIT, UT Dallas, IIT Roorkee, IIT-BHUCall for CollaborationI am looking for (a) enthusiastic and curious students, particularly at PhD and Post-doc levels, to work on exciting problems in AI with social intelligence. We build novel proof-of-concept systems, and in particular, collaborative assistants, that do work which people want. Please fill the interest form and drop me an email; (b) partners who are innovative organizations to accelerate sustainable technology adoption for the benefit of society.Academic Genealogy** I am grateful to trace my academic genealogy (PhD mentoring relationship) from  prominent AI researchers as follows:  Marvin Minsky -> Eugene Charniak -> Jim Hendler -> Subbarao Kambhampati ->  Biplav Srivastava -> {PhD Student}. The AI for Society group strives to move it forward with excellence and responsibility.Visited 27 countries (12%)Visited 38 states (76%)Visited 24 states (68.5)Create your own visited map of The World Create your own visited map of The United StatesCreate your own visited map of IndiaGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 4163,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:08"
}