{
  "name": "Birgit Lugrin",
  "homepage": "https://www.informatik.uni-wuerzburg.de/sia/team/prof-dr-birgit-lugrin",
  "status": "success",
  "content": "Prof. Dr. Birgit Lugrin - Lehrstuhl für Informatik V English Intern Animation stoppen Lehrstuhl für Informatik V HomeForschungTeamÜbersichtProf. Dr. Birgit LugrinPublikationenMargarete LeinMichael BanckOhenewa Bediako AkuffoMelissa DonnermannElisabeth GanalChantal KlierMartina LeinAnna RiedmannSophia SteinhäusserWissenschaftliche HilfskräfteRoboterAlumniLehre> Institut für Informatik> Institut MCM Prof. Dr. Birgit Lugrin Lehrstuhlinhaberin birgit.lugrin@uni-wuerzburg.de Research Profil: Birgit Lugrin's research is interdisciplinary and lies at the intersection of computer science and psychology. She is deeply committed to crafting technology that serves individuals or humanity as a whole. Within her research endeavors, she concentrates on the implementation and assessment of socially interactive agents across diverse domains that hold significant social relevance amidst ongoing technological advancements. These domains include education, interactive storytelling, assisted living, support for aging populations, and the promotion of cultural understanding. To achieve these goals, she adeptly synthesizes methodologies and insights from human-computer interaction, artificial intelligence, psychology, and cognitive science. Birgit Lugrin is an active member of the research community focused on SIAs. She served as one of the editors of ACM’s \"The Handbook on Socially Interactive Agents”, a comprehensive compilation of surveys that provide in-depth introductions, summaries, and discussions spanning the last two decades of research across the domains of embodied conversational agents, intelligent virtual agents, and social robotics. Authored by leading experts in their respective fields, this publication serves as a pivotal resource for scholars and practitioners alike. The book is accessible via the ACM digital library, with over 1000 downloads to date, or through freely available preprints of individual chapters. In 2015, Birgit Lugrin was appointed as the first female professor at the Institute of Computer Science, and since 2024, she is the first female chairholder. She strives to serve as a role model for female students and staff in her work. Since 2015, she has alternated with the Mathematics department as the Faculty Women's Representative or Deputy Faculty Women's Representative. Short Bio: Birgit Lugrin heads the Socially Interactive Agents Group (Chair for Computer Science V) since May 2024. Prior she lead the Media Informatics Group at the Chair for Human-Computer Interaction (Chair for Computer Science IX) at JMU. She completed her studies at Augsburg University, earning both a Bachelor of Science and a Master of Science degree in computer science. Following this, she pursued her doctoral thesis (Dr. rer. nat.), entitled \"Cultural Diversity for Virtual Characters\", at the Chair for Human-Centered Artificial Intelligence. She also conducted a post-doctoral phase at the same chair. During this period, Birgit undertook research visits at esteemed research institutes including the Institute for Creative Technologies (University of Southern California), the National Institute of Informatics (Tokyo University), and INESC-IS (University of Lisbon). Awards: Best Paper Nominee, International Conference on Intelligent Virtual Agents 2024 (Elisabeth Ganal, Anastasia Fiolka, Anika Christen, Birgit Lugrin. The Applicability of Using Virtual Social Contexts as Stimuli and Training Material for Social Context Research) Best Presentation Award, International Conference on Educational Technolgies and Computers 2024 (Melissa Donnermann, Birgit Lugrin. Integration of Robot-supported Tutoring in Higher Education - An Empirically Based Concept) Best Paper Award, International Conference on Multimodal Interaction 2022 (David Obremski, Helene Hering, Paula Friedrich, Birgit Lugrin. Exploratory Study on the Perception of Intelligent Virtual Agents with Non-Native Accents using Synthetic and Natural Speech in German) Best Presentation Award, International Conference on Persuasive Technologies 2020 (Andrea Deublein, Birgit Lugrin. (Expressive) Social Robot or Tablet? – On the Benefits of Embodiment and Non-verbal Expressivity of the Interface for a Smart Environment) Best Paper Finalist, International Conference on Social Robotics 2017 (Hendrik Striepe, Birgit Lugrin. There once was a Robot Storyteller: Measuring the Effects of Emotion and non-verbal Behaviour) Best Late Breaking Report Nomination, International Conference on Human-Robot Interaction 2017 (Stephan Hammer, Elisabeth Andre, Kim Kirchner, Birgit Lugrin. Touch or Talk? - Comparing Social Robots and Tablet PCs for an Elderly Assistant Recommender System) Best Paper Award, International Conference on Culture and Computing 2015 (Birgit Lugrin, Julian Frommel and Elisabeth André. Modeling and Evaluating a Bayesian Network of Culture-Dependent Behaviors) IFAAMAS-12 Victor Lesser Distinguished Dissertation Award Research Award of Augsburg University (best Dissertation in 2012) PhD grant from the Elite Network Bavaria Weiterführende Links:  Publikationen Researchgate Google Scholar Aktuelle Aktivitäten in der wissenschaftlichen Gemeinschaft: Area Chair for \"Human Agent Interaction\" at the 24nd International Conference on Autonomous Agents and Multiagent Systems (AAMAS 2025) Area Chair for “Humans and AI / Human Agent Interaction” at the 22nd International Conference on Autonomous Agents and Multiagent Systems (AAMAS 2023)  General Chair at the 23rd ACM International Conference on Intelligent Virtual Agents (IVA 2023) Special Track Chair for “Socially Interactive Agents” at the the 17th International Conference on Persuasive Technologies (Persuasive 2022)  Program Chair at the 16th International Conference on Persuasive Technologies (Persuasive 2021) Prof. Dr. Birgit Lugrin Lehrstuhl für Informatik V Socially Interactive Agents Universität Würzburg Am Hubland (Campus Süd)  D-97074 Würzburg, Germany E-Mail: birgit.lugrin@uni-wuerzburg.de Tel: +49 931 31-84602 Raum: B110, Gebäude M2 Sprechstunde: nach Vereinbarung Kontakt Lehrstuhl für Informatik V (Socially Interactive Agents) Am Hubland 97074 Würzburg Tel.: +49 931 31-83549 E-Mail Suche Ansprechperson Hubland Süd, Geb. M2 StartseiteUniversitätStudiumForschungLehreEinrichtungenInternationalUniversitätFristen und TermineStudienangebotNachrichtenKarriereportalBeschäftigteVerwaltungsABCAmtliche VeröffentlichungenServiceUniversitätsbibliothekIT-DiensteHochschulsportStudienberatungPrüfungsamtStudierendenkanzleiStudierendenvertretungCareer CentreDiensteWueStudyWueCampusVorlesungsverzeichnisOnline-Bewerbung und Online-EinschreibungKatalog der BibliothekKontaktTelefon- und AdressverzeichnisStandorte und AnfahrtPresseStudienberatungStörungsannahmeTechnischer BetriebHilfe im Notfall Seitenoptionen Sitemap Bildnachweise Nach oben Letzte Änderung: 04.11.2024 Seite: 160634/688 Bildnachweise ImpressumDatenschutzBarrierefreiheit",
  "content_length": 6927,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:10"
}