{
  "name": "Birte Kehr",
  "homepage": "https://www.rcii.de/forschung/forschergruppen-klinische-kooperationsgruppen-emerging-strategies/ag-algorithmische-bioinformatik",
  "status": "success",
  "content": "Prof. Birte Kehr - Leibniz Institute for Immunotherapy Skip to content Prof. Birte Kehr Head of Research Group | Algorithmic Bioinformatics Open video modal Modern technologies such as DNA sequencing have revolutionized biomedical research by generating vast amounts of data. Understanding and interpreting these data requires skills in mathematics, statistics, computer science and programming. Professor Birte Kehr’s training as a bioinformatician enables her to bring this expertise to the field of biomedicine. Professor Kehr specializes in the development of algorithms and software for analyzing large amounts of genome-sequence data. Her earlier research addressed the comparison of whole genomes from different species, while her more recent research has mostly focused on studying the human genome in a biomedical context. Here she has developed algorithms for detecting and genotyping genomic structural variation in population-scale data sets, she identified various genotype-disease associations, and she has contributed to basic research insights into human genome evolutionary processes. Prof. Kehr’s mission at the LIT is to develop new algorithms for analyzing the latest types of sequence data as well as introducing recent genome analysis approaches to the field of immunotherapy research. Examples of structural variants discovered with PopIns in Whole Genome Sequencing (WGS) data from 15,219 Icelanders. Our software tool, PopIns, identifies types of genomic structural variants that involve a non-repetitive sequence not found in the reference genome. We call these variants ‘non-reference sequence variants’ (NRS variants). Using the variants discovered with PopIns, we were able to show that the majority of human non-reference sequence is ancestral, rather than newly inserted. We were also able to describe an NRS variant in the SREBF1 gene which is associated with myocardial infarction (Kehr et al, 2017, Nature Genetics). Quote from Prof. Birte Kehr With our newly developed algorithms and software tools, we analyze sequence data to gain fresh insights into human genetics and the immune system. Prof. Birte Kehr Head of Research Group Algorithmic Bioinformatics Biography Academic background and qualifications Prof. Kehr received her Diploma in Bioinformatics at the Friedrich Schiller University, Jena in 2008. From 2009–2013 she studied to be a Doctor of Natural Sciences (Dr. rer. nat.) at the Freie Universität Berlin and as a student of the International Max Planck Research School for Computational Biology & Scientific Computing (IMPRS-CBSC). Professional career From 2013–2016 Prof. Kehr worked as a Research Scientist at deCODE genetics/Amgen Inc. based in Reykjavík, Iceland. She went on to be a Junior Research Group Leader at the Berlin Institute of Health/Charité Berlin from 2016–2023. Since 2020 she has held a W2 professorship at the University of Regensburg. Explore our Research Group in greater depth Get to know our team and find out more about our pioneering research. Algorithmic Bioinformatics Visit the complete publications list on Google Scholar: https://scholar.google.com/citations?user=eFJKGe4AAAAJ&hl=de&oi=ao Here is a selection of the most important publications from the last few years: Mirus T, Lohmayer R, Döhring C, Halldórsson BV, Kehr B. GGTyper: genotyping complex structural variants using short-read sequencing data. Bioinformatics 2024. Lüpken R, Krannich T, Kehr B. Bcmap: fast alignment-free barcode mapping for linked-read sequencing data. Preprint on bioRxiv 2022. doi: 10.1101/2022.06.20.496811 Krannich T, White WTJ, Niehus S, Holley G, Halldórsson BV, Kehr B. Population-scale detection of non-reference sequence variants using colored de Bruijn graphs. Bioinformatics 2022;38(3):604-611. doi: 10.1093/bioinformatics/btab749. PMID: 34726732 Niehus S, Jónsson H, Schönberger J, Björnsson E, Beyter D, Eggertsson HP, Sulem P, Stefánsson K, Halldórsson BV, Kehr B. PopDel identifies medium-size deletions simultaneously in tens of thousands of genomes. Nature communications 2021;12(1):730. doi: 10.1038/s41467-020-20850-5. PMID: 33526789 Jónsson H, Sulem P, Kehr B, Kristmundsdottir S, Zink F, Hjartarson E, Hardarson MT, Hjorleifsson KE, Eggertsson HP, Gudjonsson SA, Ward LD, Arnadottir GA, Helgason EA, Helgason H, Gylfason A, Jonasdottir A, Jonasdottir A, Rafnar T, Frigge M, Stacey SN, Th Magnusson O, Thorsteinsdottir U, Masson G, Kong A, Halldorsson BV, Helgason A, Gudbjartsson DF, Stefansson K. Parental influence on human germline de novo mutations in 1,548 trios from Iceland. Nature 2017;549(7673):519-522. doi: 10.1038/nature24018. PMID: 28959963 Kehr B, Helgadottir A, Melsted P, Jonsson H, Helgason H, Jonasdottir A, Jonasdottir A, Sigurdsson A, Gylfason A, Halldorsson GH, Kristmundsdottir S, Thorgeirsson G, Olafsson I, Holm H, Thorsteinsdottir U, Sulem P, Helgason A, Gudbjartsson DF, Halldorsson BV, Stefansson K. Diversity in non-repetitive human sequences not found in the reference genome. Nature genetics 2017;49(4):588-593. doi: 10.1038/ng.3801. PMID: 28250455 Halldorsson BV, Hardarson MT, Kehr B, Styrkarsdottir U, Gylfason A, Thorleifsson G, Zink F, Jonasdottir A, Jonasdottir A, Sulem P, Masson G, Thorsteinsdottir U, Helgason A, Kong A, Gudbjartsson DF, Stefansson K. The rate of meiotic gene conversion varies by sex and age. Nature genetics 2016;48(11):1377-1384. doi: 10.1038/ng.3669. PMID: 27643539 Stacey SN, Kehr B, Gudmundsson J, Zink F, Jonasdottir A, Gudjonsson SA, Sigurdsson A, Halldorsson BV, Agnarsson BA, Benediktsdottir KR, Aben KKH, Vermeulen SH, Cremers RG, Panadero A, Helfand BT, Cooper PR, Donovan JL, Hamdy FC, Jinga V, Okamoto I, Jonasson JG, Tryggvadottir L, Johannsdottir H, Kristinsdottir AM, Masson G, Magnusson OT, Iordache PD, Helgason A, Helgason H, Sulem P, Gudbjartsson DF, Kong A, Jonsson E, Barkardottir RB, Einarsson GV, Rafnar T, Thorsteinsdottir U, Mates IN, Neal DE, Catalona WJ, Mayordomo JI, Kiemeney LA, Thorleifsson G, Stefansson K. Insertion of an SVA-E retrotransposon into the CASP8 gene is associated with protection against prostate cancer. Human molecular genetics 2016;25(5):1008-1018. doi: 10.1093/hmg/ddv622. PMID: 26740556 Kehr B, Melsted P, Halldórsson BV. PopIns: population-scale detection of novel sequence insertions. Bioinformatics 2016;32(7):961-967. doi: 10.1093/bioinformatics/btv273. PMID: 25926346 Kehr B, Trappe K, Holtgrewe M, Reinert K. Genome alignment with graph data structures: a comparison. BMC bioinformatics 2014;15:99. doi: 10.1186/1471-2105-15-99. PMID: 24712884 Many thanks to the funding agencies who support our work: FOR 2841 Beyond the Exome, Project P3 The Research Unit, FOR 2841, aims to identify, analyze, and predict the disease potential of non-coding DNA variants in patients with rare genetic diseases. The aim of Project P3 is to comprehensively identify genomic structural variants (SVs) in linked- and long-read sequencing data or rare disease patients. To this end, we developed a new genome-wide local assembly tool for SV detection during the first funding period. In the second funding period we are extending the tool to multi-sample variant calling. https://www.beyond-the-exome.org/P03.html CRC Transregio 221, GvH/GvL INF project The Transregional Collaborative Research Center, CRC/TRR 221, is investigating innovative immune-modulation strategies to separate graft-versus-host disease from graft-versus-leukemia effects. This seeks to enhance the safety and efficacy of allogeneic hematopoietic stem cell transplantation (HSCT) in the future. Within this the INF project is dedicated to data infrastructure. It focuses mainly on data management, while it also supports the individual projects with adequate software and expert knowledge during the entire data analysis process. https://www.gvhgvl.de/en/projects-publications/projects/project-section-b Prof. Birte Kehr Tel: +49 941 944–18161 Email: birte.kehr@ukr.de",
  "content_length": 7924,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:14"
}