{
  "name": "Biswa",
  "homepage": "https://www.cse.iitb.ac.in/~biswa",
  "status": "success",
  "content": "Biswa's Home Main Research Research Interests CASPER Research Group Publications Note to students Achievements Teaching/Learning Courses Computer Architecture@YouTube Fun@Computer Architecture Rewind Computer Architecture Professional Service Service Past Mentees Mentees Misc Blogs Tips for good/bad research Top conferences/journals Travel Cricket Sachin's centuries Biswabandan Panda Member of faculty@CSE Department n (Indian) Institute of Technology Bombay biswa[AT]cse[DOT]iitb[DOT]ac[DOT]in Research group: CASPER research group and Trust Lab ComputerSystems@India Talk Series: ComputerSysTalks@India Brief Bio A mortal who is excited about microarchitecture and in general computer architecture research. A micro-architect does all the heavy lifting to squeeze out the best performance out of applications running on computing systems. Biswa is interested in microarchitecture ideas for improving performance and security of modern processors. Biswa is one of the recipients of Qualcomm India Faculty Award 2022, Google India Research Award 2022, Prof. Krithi Ramamritam Award for creative research 2023, Qualcomm Faculty Award 2024, Shridhar Shukla Chair Professor in Digital Trust (2025-2028), USENIX SECURITY 2025 Distinguished Artifact Award, and Class of 1973 Faculty Award for research excellence 2025. Finally, Biswa likes demystifying microarchitecture mysteries in his architecture classes through memes and videos :) Research: Interests, Mission, and Philosophy Research interests: As a mortal I am passionate about CPUs/GPUs for better latency/bandwidth and a bit(not even a byte) of security. Research mission (responsibility): To ensure India's presence on the global map of computer architecture research with top quality publications at the flagship research forums . Research Philosophy: Motivated by this quote on Cricket \"Play Life like a Cricket match. Don’t try to hit hard in every situation, Just keep rotating, moving, and then look for that one Delivery and hit it as hard as you can.\" Replace \"life\" with \"research\", \"delivery\" with \"idea\", and \"hit as hard as you can\" with \"the impact\". If you want to do top-quality research aligned with our research mission and philosophy, and you know what it takes to do the same then welcome;looking forward to doing research with you. Gratitude Thanks to all the gurus who taught me the value of hardwork, failure, and inculcated the habit of striving for excellence. Thanks to students@IITK/IITB for some of the best \"teaching/learning\" moments. Thanks to Intel labs, Qualcomm, NXP, and Google Research for all the \"financial\" support. News October 2025: ASPLOS 2026 acceptance it is. A dream comes true finally. It is an honor working with the gritty Vedant and Hrishikesh. Wow moment for me and my research group as CASPER is at ISCA, MICRO, HPCA, and now ASPLOS. Gratitude to all the members for this day. October 2025: Drishti, nominated as one of the best paper candidates at MICRO 2025. Kudos to Sweta and Prerna. August 2025: Distinguished Artifact Award Winner at USENIX SECURITY 2025. Kudos to Anubhav and Hari. July 2025: \"Drishti\" by Sweta and Prerna accepted at MICRO 2025. Congrats Sweta and Prerna. May 2025: Anubhav and Hari's paper on randomized caches made it to flagship USENIX SECURITY 2025. Pre-print coming soon. May 12th to June 20th 2025: In Europe (away from office@CSE-IITB).Email responses will be tardy. May 2025: Invited to serve on the Program Committee of HPCA 2026. April 2025: M.S./Ph.D./M.Tech. RA openings in designing secure ISA for secure processors. Please apply. March 2025: Awarded Trust lab Early Career Award 2024. Thanks Trust lab. Feb. 2025: Invited to serve on the Program Committee (PC) of MICRO 2025 . Consider submitting your best works. Jan. 2025: Awarded Shridhar Shukla Chair Professor in Digital Trust. Thanks Shridhar. Jan. 2025: 21 years ago, an epic test hundred from Sachin with no cover drives. Grit, Determination, Resilience, and Restraint personified. Here is the link. Dec. 2024: ACM SIGARCH blog on secure caches is here . Nov. 2024: Choo Lo: Computer Architecture Bottlenecks by Param Shah is here . Nov. 2024: Sumon and I attended MICRO 2024 at Austin. Sept. 2024: At University of Virginia till Sept. 22. Email responses will be tardy. Sept. 2024: Invited to serve on the Program Committee (PC) for flagship ISCA 2025 . Consider submitting your best works. August 2024: CPU+GPU security workshop on December 13. Please register . August 2024: Sumon's thesis selected for the best MS thesis award. July 2024: Sumon did it in style. MICRO 2024 acceptance it is. A great year for CASPER with presence at three flagship conferences: HPCA 24, ISCA 24, and MICRO 24. #This-little(micro:))-moment-is-called-happ(y)ness. June 2024: Qualcomm Faculty Award 2024. Thanks Qualcomm again and again :) May 2024: Invited to serve on the program committee of HPCA 2025. May 2024: In Europe till June 9, 2024. Email responses will be a bit tardy. May 2024: Trust lab chitchat on Maya cache is here . April 2024: I will be teaching CS683 in July-24 and CS773 in Jan-25. Updated course content will be live soon. April 2024: Devashish will be joining faculty@CSE-IITB in June. He is looking for motivated MS/PhD students. Please consider CSE-IITB and Devashish as the mentor if you are interested in network measurements and security. Sayandeep joined faculty at CSE-IITB and looking for motivated MS/PhD students. Please consider working with him if you are interested in cryptographic hardware and fault attacks. April 2024: I will be chairing the AE of PACT 2024 . I am looking for PhDs and postdocs who can help us in AE. April 2024: Trust lab Pre-doc program is live. Please apply . March 2024: Invited to serve on the program committee of MICRO 2024 . March 2024: Woohooo!! The maya of Anubhav and Navneet worked. The Maya cache accepted at the flagship ISCA 2024 . A student author paper from IITs after a gap of 44 years. Kudos!! ACM ROCS Talk on Plenty of rooms available in computer systems . February 2024: Aman's paper accepted at the top-tier HOST 2024 . January 2024: ComputerSysTalks@India is live. December 2023: All you have got is all it takes . November 2023: CS230-wrap with Shraddha, Sadhana, and Saahas (see the RHS of the pic) :). Thanks Kavya for the pic :) November 2023: CLIP (MICRO'23) is in top chips achievements. Cool to be in the list :) November 2023: Recipient of Professor Krithi Ramamritham Award for creative research in the field of Computer Architecture. October 2023: On my way to MICRO 2023@Toronto. Email responses will be tardy, till November 3. October 2023: Hari's paper accepted at HiPC 2023. Arun's paper accepted at the flagship HPCA 2024 . #Proud advisor moment :) October 2023: CASPER@ IND vs PAK CWC. October 2023: CSE spotlight . October 2023: Invited to serve on the Program Committee (PC) for ISCA 2024 . Consider submitting your best works. August 2023: Drishyam accepted at the top-tier PACT 2023. Prerna, Nishkarsh, Naman, Vedant, and Ravi joined the group for MS by Research and PhD. Welcome. July 2023: CLIP accepted at the flagship MICRO 2023. Old news is here.",
  "content_length": 7143,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:12"
}