{
  "name": "Bivas Mitra",
  "homepage": "http://cse.iitkgp.ac.in/~bivasm",
  "status": "success",
  "content": "Bivas Mitra's Homepage Welcome to My Homepage! Bivas Mitra Associate ProfessorDepartment of Computer Science & EngineeringIndian Institute of Technology KharagpurWest Bengal, India About Me Academics Research Publications Experiences Projects Teaching Students Presentations & Talks Professional Activities Awards I am a faculty member (since April 2013) in the Department of Computer Science & Engineering at IIT Kharagpur, India. Prior to that, I worked briefly (Aug. 2012-March 2013) with Samsung Electronics, Noida as a Chief Engineer. I received my Ph.D in Computer Science & Engineering from IIT Kharagpur under the supervision of Prof. Niloy Ganguly and Prof. Sujoy Ghose. I did my first postdoc (May 2010-June 2011) at the French National Centre for Scientific Research (CNRS), Paris, France and second postdoc (July 2011-July 2012) at the Universite catholique de Louvain (UCL), Belgium. I am also associated with the Complex Networks Research Group (CNeRG), IIT Kharagpur, India. My research interests include Network science, Multilayer networks Social networks, Data science, Anomaly detectionMobile affective computing, Socio-mobile applicationsCrowdsensing, Social-IoTPeer-to-Peer networksOptical networks Office : Room#: 322 Department of Computer Science & EngineeringIndian Institute of Technology KharagpurWest Bengal, India, 721302. Email : bivas [AT] cse.iitkgp.ac.in, bivasmitra [AT] gmail.com Telephone: +91-3222-282358. News/Upcoming Events: New (short) paper in TPDL 2025: \"On Recommending Fair Influential Scholars with Geographically Diverse Impact\" with Microsoft. Offering a course on Smartphone Computing & Application (CS60009) in Autumn 2025. New paper in ASONAM 2025: \"Fair2Vec: Learning Fair and Topic-Aware Representations for Influencer Recommendation\" with Microsoft. New paper in DaWaK 2025: \"FNoDe: Faulty Node Detection in Microservices Architecture\". New (short) paper in DEXA 2025: \"SysResolve: Study on In-Context LLM Generation of Resolution Scripts\". New (short) paper in DaWaK 2025: \"MicroSuggest: Kernel-Aware Microservice Decomposition\". New paper in ACM SAC 2025: \"LonelyTracker: An IoT Solution with Multimodal Data and Split Computing for Secure Loneliness Detection\". Debasree Das successfully defended her Ph.D thesis on Nov. 28, 2024. Congratulations Debasree! New paper in Expert Systems with Applications : \"ProxyLabel: A Framework to Evaluate Techniques for Survey Fatigue Reduction Leveraging Auxiliary Modalities\". New paper in IEEE APSCON 2025: \"socialLens: Unveiling Loneliness Levels From Wearable and Smartphone Data\". New paper in CODS-COMAD 2024: \"On the Badge Aware Influence Representation Learning & Influencer Detection in Social Networks\". New paper in MobileHCI 2024: \"Title: DriveR: Towards Generating a Dynamic Road Safety Map with Causal Contexts\". New paper in ACM CHI 2024: \"Towards Estimating Missing Emotion Self-reports Leveraging User Similarity: A Multi-task Learning Approach\". New paper in ACM JCSS: \"Zero-configuration Alarms: Towards Reducing Distracting Smartphone Interactions while Driving\". New paper in IEEE PerCom 2024: \"Early Detection of Driving Maneuvers for Proactive Congestion Prevention\" with Missouri University of Science and Technology, USA. New paper in IEEE Transactions on Network Science and Engineering: \"Epidemic Spreading on Directed Networks and Twitter Cascades\" with Wroclaw University of Science and Technology, Poland. ...... Archive Announcements Open Positions: Ph.D/MS positions are available in the areas of (1) Complex networks/Social networks (mostly theoretical/analytical and real data driven research) and (2) Mobile Systems (mostly experimental research). Highly motivated candidates with strong academic background (B.E./B. Tech with high CGPA, preferably with an M.E./M.Tech in CS) are encouraged to contact for the positions (drop me a CV). Internship: I do not encourage students to spend their second year vacations doing summer projects. So do not expect any response from me. Third year students, if you are interested, apply via link . Please do not send me any mail, neither expect any reply. The staff responsible for that will send you a reply in due time.",
  "content_length": 4189,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:15"
}