{
  "name": "Biwei Huang",
  "homepage": "https://biweihuang.com",
  "status": "success",
  "content": "Biwei Huang | Exploring the mysteries of AI & science … I am an Assistant Professor at Halicioğlu Data Science Institute (HDSI), UC San Diego (UCSD). My research interests include Causal Discovery and Inference, Causality-Empowered ML/AI and Foundation Models, White-Box LLMs, GUI Agents, World Models, and VLA Models. I received my Ph.D. degree at Carnegie Mellon University (CMU) in 2022. I am fortunate to work with my supervisors Prof. Kun Zhang and Prof. Clark Glymour. Before joining CMU, I got my Master’s degree in Neural Information Processing at the University of Tübingen, Germany (2012 – 2014). Later, I joined the Max-Planck Institute for Intelligent Systems (Bernhard Schölkopf‘s lab), working on causal discovery (2014 – 2015). I am taking on new students and postdocs from HDSI, the Department of Computer Science and Engineering, and related departments. Welcome to contact me if you are interested in my research. I am recruiting a postdoc researcher to join our team and build the next generation of causality-empowered VLA Models and World Models. Selected News: 04/2025: Our Causal-Copilot: Autonomous Causal Analysis Agent (Version 2) was released. 2024: Our Causal-Copilot: Autonomous Causal Analysis Agent (Version 1) was released. 2024: Program Co-Chair for the 4th Conference on Causal Learning and Reasoning (CLeaR 2025) 2024: Keynote/invited talks at ACIC, RLC workshop, Celluar and Molecular Medicine at UCSD, etc. 2023: Keynote/invited talks at KDD workshop, ICSA conference, USC summer school, IROS workshop, UAI workshop, SIAM conference, UCSD Biostatistics seminar, UCSD ECE seminar, etc. 11/2021: Our Python package for causal discovery ‘causal-learn‘ was released. 10/2021: I was named a Rising Star of the Trustworthy ML Initiative. 04/2021: I was awarded the 2021 Apple Scholars in AI and Machine Learning (AI/ML). Biwei Huang Sign up Log in Copy shortlink Report this content Manage subscriptions Loading Comments... Write a Comment... Email (Required) Name (Required) Website",
  "content_length": 2014,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:13"
}