{
  "name": "Björn Lisper",
  "homepage": "http://www.idt.mdh.se/~blr01",
  "status": "success",
  "content": "BJÖRN LISPER MDH Latest update Sep. 24, 2024 (this page is permanently under construction) To avoid spam, all mail addresses on this page have the \"@\" replaced by \"#\". Björn Lisper Hello world, I'm professor in Computer Engineering at School of Innovation, Design, and Technology (IDT), Mälardalen University,where I belong to the Embedded Systems Research Profile. My research interests lie in the area of embedded and real-time systems and especially languages and program analysis, where my group has specialized in Worst-Case Execution Time (WCET) analysis. We have also contributed in areas such as event algebras, polyhedral abstract interpretation, program slicing, and race condition analysis. I also have an old interest in program transformation, functional languages, and data parallel languages. My latest contribution in this area is the HERO-ML very high-level language for modeling and specification of data parallel algorithms. I have been much involved in the WCET Workshop (Int'l Workshop on Worst-Case Execution Time Analysis). Until recently I was on the steering committee. I was program chair for the WCET 2010 edition, and I am usually on the PC. I was the coordinator of the EU FP7 STREP ALL-TIMES (2007-2010), and the Marie Curie IAPP project APARTS (2010-2014). I also chaired the TACLe COST Action (2012-2016), and 2007-2011 I was responsible for the Timing Analysis activity within the ARTIST2 and Artist-Design Networks of Excellence on embedded systems design (2004-2011). Currently I'm a member of HiPEAC, and of IFIP WG 10.2 on Embedded Systems. I have taught a course on functional programming for many years. I have also developed and taught a number of courses on both undergraduate and graduate level, on topics such as parallel systems, formal semantics of programming languages, algorithm analysis, and static program analysis. This is my personal full CV (pdf). Here is our research database info on me (contact info, projects, publications, etc.) I also have a Google Scholar profile. Here is a somewhat more detailed account for the research that I have carried out throughout my career. The not so Serious Part of this Home Page A course I used to give at KTH (link currently defunct, sorry) The best answer ever on a math exam (or, the difference between syntax and semantics) \"A mathematician is a device for turning coffee into theorems\" -- P. Erdos \"Fråga inte så mycket! Det är lättare att få förlåtelse än att få tillstånd.\" -- Östen Mäkitalo Björn Lisper bjorn.lisper#mdu.se",
  "content_length": 2523,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:20"
}