{
  "name": "Björn Scheuermann 0001",
  "homepage": "https://www.kom.tu-darmstadt.de",
  "status": "success",
  "content": "Kommunikationsnetze – TU Darmstadt – Fachgebiete Multimedia Kommunikation / Kommunikationsnetze (KOM) Multimedia Kommunikation / Kommunikationsnetze (KOM) Die Fachgebiete Multimedia Kommunikation und Kommunikationsnetze (zusammen KOM) verfolgen die Vision der nahtlosen Kommunikation, in der Mensch und Maschine (“Internet of Things”) überall auf der Welt effektiv und sicher kooperieren. Zu konkreten Forschungsthemen gehören das Ermöglichen stabiler Verbindungen durch Transition, Adaption und Resilienz, die neuen Mobilfunkstandards 5G und 6G, die Kommunikation in Ad-Hoc-Netzwerken, beispielsweise von Satelliten oder Autonomen Fahrzeugen, hochperformante Netzwerke, die mit besonders geringen Verzögerungen oder sehr hohen Datenraten arbeiten, Netzwerksicherheitstechnologien zum Beispiel für leistungsstarke Firewalls sowie der Einsatz Künstlicher Intelligenz (KI) in der automatischen Sprachverarbeitung. Kontakt News Zurück Vor Bild: Reallabor Antrieb 4.0, https://www.antrieb40.org/ Bild: Reallabor Antrieb 4.0, https://www.antrieb40.org/ 27. Juni 2025 Data Governance-Konzept im Datenraum Antrieb 4.0 Studienbericht zum rechtssicheren und effizienten Umfang mit Daten im geteilten Datenraum veröffentlicht Bild: Mark Cruz Bild: Mark Cruz 16. Mai 2025 Ein schöner Tag und leckeres Eis! Treffen der Besten in „Logischer Entwurf“ Bild: Julia Müller Bild: Julia Müller 6. Mai 2025 So lernt man sich gerne kennen … Kaffeetrinken der Besten aus dem WiSe 2024/2025 Bild: Adobe Stock Bild: Adobe Stock 8. Oktober 2024 Von wegen Individualverkehr! Wie autonomes Fahren im Kollektiv besser gelingt. Ahmad Khalil forscht mit Federated Learning an Lösungen für das vernetzte und vollautonome Fahren. Bild: Dall.e AI Image Generator / Prompt: Pratyush Agnihotri Bild: Dall.e AI Image Generator / Prompt: Pratyush Agnihotri 15. August 2024 „Echtzeit-Daten sind das neue Öl. Ich arbeite daran, wie sie effizient verarbeitet werden“ Pratyush Agnihotri forscht an einem KI-basierten System. Im Interview erzählt er, wie damit die vorhandene Rechenleistung bei der Verarbeitung von Echtzeit-Daten effizienter gesteuert und letztlich Energie gespart werden kann. Bild: Fotostudio Hirch Bild: Fotostudio Hirch 4. Juli 2024 SFB MAKI: Zwölf Jahre Grundlagenforschung für das Internet der Zukunft Wie sieht das Internet der Zukunft aus? Der Sonderforschungsbereich MAKI – „Multi-Mechanismen-Adaption für das künftige Internet\" beschäftigt sich seit 2013 mit dieser Fragestellung. Nach zwölf Jahren Höchstförderdauer endet er zum Jahresende. Bild: Reallabor Antrieb 4.0, https://www.antrieb40.org/ Bild: Reallabor Antrieb 4.0, https://www.antrieb40.org/ 27. Juni 2025 Data Governance-Konzept im Datenraum Antrieb 4.0 Studienbericht zum rechtssicheren und effizienten Umfang mit Daten im geteilten Datenraum veröffentlicht Bild: Mark Cruz Bild: Mark Cruz 16. Mai 2025 Ein schöner Tag und leckeres Eis! Treffen der Besten in „Logischer Entwurf“ Bild: Julia Müller Bild: Julia Müller 6. Mai 2025 So lernt man sich gerne kennen … Kaffeetrinken der Besten aus dem WiSe 2024/2025 Bild: Adobe Stock Bild: Adobe Stock 8. Oktober 2024 Von wegen Individualverkehr! Wie autonomes Fahren im Kollektiv besser gelingt. Ahmad Khalil forscht mit Federated Learning an Lösungen für das vernetzte und vollautonome Fahren. Bild: Dall.e AI Image Generator / Prompt: Pratyush Agnihotri Bild: Dall.e AI Image Generator / Prompt: Pratyush Agnihotri 15. August 2024 „Echtzeit-Daten sind das neue Öl. Ich arbeite daran, wie sie effizient verarbeitet werden“ Pratyush Agnihotri forscht an einem KI-basierten System. Im Interview erzählt er, wie damit die vorhandene Rechenleistung bei der Verarbeitung von Echtzeit-Daten effizienter gesteuert und letztlich Energie gespart werden kann. Bild: Fotostudio Hirch Bild: Fotostudio Hirch 4. Juli 2024 SFB MAKI: Zwölf Jahre Grundlagenforschung für das Internet der Zukunft Wie sieht das Internet der Zukunft aus? Der Sonderforschungsbereich MAKI – „Multi-Mechanismen-Adaption für das künftige Internet\" beschäftigt sich seit 2013 mit dieser Fragestellung. Nach zwölf Jahren Höchstförderdauer endet er zum Jahresende. mehr News lesen Zum Seitenbeginn Kontakt Prof. Dr. Björn Scheuermann bjoern.scheuermann@tu-... work +49 6151 16-29107 fax +49 6151 16-29109 Work S3|20 120 Kommunikationsnetze Rundeturmstr. 10 64283 Darmstadt Prof. Dr.-Ing. Ralf Steinmetz steinmetz.office@kom.tu-... work +49 6151 16-29101 fax +49 6151 16-29109 Work S3|20 219a Multimedia KommunikationRundeturmstr. 10 64283 Darmstadt Wir möchten die Informationen und das Nutzungserlebnis auf dieser Webseite an Ihre Bedürfnisse anpassen. Deswegen verwenden wir sog. Cookies. Sie können selbst entscheiden, welche Cookies genau bei Ihrem Besuch unserer Webseiten gesetzt werden sollen. Einige Cookies sind für den Abruf der Website notwendig, damit diese auf Ihrem Endgerät richtig anzeigen werden kann. Diese essentiellen Cookies können nicht abgewählt werden. Der Komfort-Cookie speichert Ihre Spracheinstellung, während „Statistik“ die Auswertung durch die Open-Source-Statistik-Software „Matomo“ regelt. Weitere Informationen zum Einsatz von Cookies erhalten Sie in unserer Datenschutzerklärung . Nur essentielle Komfort Statistiken Alle akzeptieren Speichern & schließen Impressum",
  "content_length": 5255,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:20"
}