{
  "name": "Blair Archibald",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/blairarchibald",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Mr Blair Archibald Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffMr Blair ArchibaldMr Ethan KellyZhen Tian Dr Blair Archibald Lecturer (School of Computing Science) email: Blair.Archibald@glasgow.ac.uk 502c, School of Computing Science, Sir Alwyn Williams Building, University of Glasgow, G12 8RZ Import to contacts https://orcid.org/0000-0003-3699-6658 Biography I am Lecturer in Computing Science with an interest in how we can (computationally) model and reason about complex systems, e.g. using Milner's Bigraphs and associated formal modelling techniques such as probabilistic model checking. I was formerly a Research Associate working on the Science of Sensor Systems (S4) project which aims to deliver new principles and techniques for the development and deployment of verifiable, reliable, autonomous sensor systems that operate in uncertain, multiple and multi-scale environments. I have a keen interest in reproducible research and how software is built and managed across research domains and was named a Software Sustainability Institute Fellow in 2017. I obtained a Ph.D in Computing Science from the University of Glasgow in 2018. My thesis focused on creating re-usable high level abstractions (algorithmic skeletons) for parallel tree search problems. This led to the creation of YewPar, a C++ framework for parallel search. I am an active member of the Systems,  PLUG, and FATA research groups. Research interests Bigraphical modelling (Wireless) Sensor Systems Search, e.g. Constraint Programming Parallel and Distributed Computing Programming Languages/Functional Programming Research groupsGlasgow SystemsFormal Analysis, Theory & Algorithms Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017Number of items: 35.2025 Morris, Nicholas, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658 and Mehr, S. Hessam M. ORCID: https://orcid.org/0000-0001-7710-3102 (2025) TideScript: A Domain Specific Language for Peptide Chemistry. In: Onward! '25: Proceedings of the 2025 ACM SIGPLAN International Symposium on New Ideas, New Paradigms, and Reflections on Programming and Software, Singapore, 12-18 Oct 2025, ISBN 9798400721519 (doi: 10.1145/3759429.3762627) Das, Susmoy ORCID: https://orcid.org/0000-0001-9118-7402, Almeida, Ricardo, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658 and Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 (2025) Formal Analysis of Resilience in Transport Systems with Bigraphs. In: 2nd International Workshop on Safety/Reliability/Trustworthiness of Intelligent Transportation Systems (SRToITS 2025) in conjunction with SAFECOMP 2025, Stockholm, Sweden, 09-12 September 2025, ISBN 9783032020178 (doi: 10.1007/978-3-032-02018-5_31) Almeida, Ricardo, Das, Susmoy ORCID: https://orcid.org/0000-0001-9118-7402, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658, Calder, Muffy ORCID: https://orcid.org/0000-0001-5033-7232 and Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 (2025) Modelling Railway Networks with Bigraphs: Electrification, Failures, and Optimisation. In: 6th International Conference on Reliability, Safety, and Security of Railway Systems (RSSRail), Pisa, Italy, 26-28 Nov 2025, (Accepted for Publication) Althubiti, Ebtihal, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658 and Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 (2025) Formalising privacy regulations with bigraphs. Software and Systems Modeling, (doi: 10.1007/s10270-025-01293-2) (Early Online Publication) Mitchell, Daniel ORCID: https://orcid.org/0000-0002-9390-4150, Gu, Yue ORCID: https://orcid.org/0000-0002-8134-5822, Blanche, Jamie, Harper, Samuel, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658, Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 and Flynn, David ORCID: https://orcid.org/0000-0002-1024-3618 (2025) A cyber physical architecture for symbiotic multi-robot fleet management. In: Virtual and Augmented Reality Technology-Enhanced Learning. Series: Gaming media and social effects. Springer, pp. 379-421. ISBN 9789819623327 (doi: 10.1007/978-981-96-2332-7_17) Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658, Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 and Xu, Mengwei (2025) Modelling and verifying BDI agents under uncertainty. Science of Computer Programming, 242, 103254. (doi: 10.1016/j.scico.2024.103254) Marcon, Cécile, Allignol, Cyril, Picard, Celia, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658, Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 and Thirioux, Xavier (2025) BiCoq : Bigraphs Formalisation with Coq. In: SAC '25: 40th ACM/SIGAPP Symposium on Applied Computing, New York, USA, 31 Mar - 04 Apr 2025, pp. 1982-1989. ISBN 9798400706295 (doi: 10.1145/3672608.3707824) Abioye, Ayodeji O., Hunt, William, Gu, Yue ORCID: https://orcid.org/0000-0002-8134-5822, Schneiders, Eike, Naiseh, Mohammad, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658, Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481, Ramchurn, Sarvapali D., Fishcer, Joel E. and Soorati, Mohammad (2025) A user study evaluation of predictive formal modelling at runtime in human-swarm interaction. ACM Transactions on Human-Robot Interaction, (doi: 10.1145/3727989) (Early Online Publication) Xu, Mengwei ORCID: https://orcid.org/0000-0003-4978-3061, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658 and Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 (2025) CAN-Verify: automated analysis for BDI agents. Science of Computer Programming, 241, 103233. (doi: 10.1016/j.scico.2024.103233) Albalwe, Maram, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658 and Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 (2025) Modelling Real-time Systems with Bigraphs. In: 15th International Workshop on Graph Computation Models, Enschede, Netherlands, 09 Jul 2024, pp. 96-116. (doi: 10.4204/EPTCS.417.6) Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658, Calder, Muffy ORCID: https://orcid.org/0000-0001-5033-7232 and Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 (2025) Practical modelling with bigraphs. Formal Aspects of Computing, (doi: 10.1145/3721142) (Early Online Publication) 2024 Albalwe, Maram, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658 and Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 (2024) Modelling and analysing routing protocols diagrammatically with bigraphs. Formal Aspects of Computing, 36(3), 17. (doi: 10.1145/3685934) Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658 and Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 (2024) A Bigraphs Paper of Sorts. In: 17th International Conference on Graph Transformation (ICGT 2024), Enschede, Netherlands, 10-11 July 2024, pp. 21-38. ISBN 9783031642845 (doi: 10.1007/978-3-031-64285-2_2) Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658, Calder, Muffy ORCID: https://orcid.org/0000-0001-5033-7232, Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 and Xu, Mengwei ORCID: https://orcid.org/0000-0003-4978-3061 (2024) Quantitative modelling and analysis of BDI agents. Software and Systems Modeling, 23(2), pp. 343-367. (doi: 10.1007/s10270-023-01121-5) Abioye, Ayodeji O., Hunt, William, Gu, Yue, Schneiders, Eike, Naiseh, Mohammad, Fischer, Joel E., Ramchurn, Sarvapali D., Soorati, Mohammad D., Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658 and Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 (2024) The Effect of Predictive Formal Modelling at Runtime on Performance in Human-Swarm Interaction. In: 19th Annual ACM/IEEE International Conference on Human Robot Interaction (HRI 2024), Boulder, Colorado, USA, 11-15 March 2024, pp. 172-176. ISBN 9798400703232 (doi: 10.1145/3610978.3640725) 2023 Gu, Yue ORCID: https://orcid.org/0000-0002-8134-5822, Hunt, William, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658, Xu, Mengwei ORCID: https://orcid.org/0000-0003-4978-3061, Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 and Soorati, Mohammad D. (2023) Successful Swarms: Operator Situational Awareness with Modelling and Verification at Runtime. In: IEEE RO-MAN 2023, Busan, Korea, 28-31 August 2023, pp. 541-548. ISBN 9798350336702 (doi: 10.1109/RO-MAN57019.2023.10309626) Xu, Mengwei ORCID: https://orcid.org/0000-0003-4978-3061, Rivoalen, Thibault, Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658 and Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 (2023) CAN-verify: A Verification Tool for BDI Agents. In: 8th International Conference on integrated Formal Methods (iFM 2023), Leiden, The Netherlands, 13-15 November 2023, ISBN 9783031477058 (doi: 10.1007/978-3-031-47705-8_19) Archibald, Blair ORCID: https://orcid.org/0000-0003-3699-6658, Calder, Muffy ORCID: https://orcid.org/0000-0001-5033-7232, Sevegnani, Michele ORCID: https://orcid.org/0000-0001-6773-9481 and Xu, Mengwei ORCID: https://orcid.org/0000-0003-4978-3061 (2023) Quantitative Verification and Strategy Synthesis for BDI Agents. In: NASA Formal ",
  "content_length": 31578,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:22"
}