{
  "name": "Blanca Rodríguez",
  "homepage": "http://www.cs.ox.ac.uk/people/blanca.rodriguez",
  "status": "success",
  "content": "Blanca Rodriguez | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyBlanca RodriguezBlanca Rodriguez Professor Blanca Rodriguez Professor of Computer ScienceGoverning Body Fellow, St Cross CollegeThemes:Computational Biology and Health InformaticsCompleted Projects:ChasteMechanisms of arrhythmogenesis and defibrillation in ischaemiamore…InterestsImportant information for applications for a DPhil in Computer Science (Computational Medicine): here Deadline for consideration for scholarships is Dec 3, noon, 2024. Topics: Digital Twins and In Silico Trials for Cardiology and Pharmacology. Please read my latest publications for further information. iCASE DPhil scholarship with Astrazeneca on \"Strategies for novel cardiomyopathy treatments from organoids-informed computational multiscale modelling and simulation\": to be considered, applications through here(DPhil in Computer Science, by Dec 3) and indicate 'iCASE' before the project title and by using the reference code iCASE. Designed to nurture the academic entrepreneurs of the future, the Enterprise studentship programme offers a stimulating educational experience as part of the Oxford-MRC DTP cohort, with the additional benefit of working closely with an industrial partner. This will provide entrepreneurial training opportunities and an insight into how commercial science is conducted alongside a superb academic base within the University. Students will work for at least 3 months in the associated company. Science & Innovation My scientific interest is in innovating in medical therapy development through a focus on human pathophysiology with modelling and simulation augmented by big data, machine learning and non-animal experimental methods. Our work has been featured as pioneering case studies for the 'Digital Twin' vision in cardiology, as well as In Silico Trials in drug development. My scientific publications can be found here, enabled by effective collaborations with academia, industry and regulators, including joint work with Merck, Amgen, Janssen, European Medicines Agencies, Food and Drug Administration, Sanofi, UCB, AnaBios, In Silico Medicine. We have developed a number of cardiac models and simulation softwares, with substantial validation, including the Virtual Assay software for pro-arrhythmia and cardiac contractility prediction, and human ventricular electrophysiology, electromechanical and Purkinje models. Advisor & Consultancy As part of my work to accelerate medical innovation, I enjoy working with industry on the integration and validation of novel modelling and simulation solutions for new medical products. Entrepreneurship is key for innovation and I actively collaborate with investors and venture capitalists, participate in The Entrepreneurship Lab at the London Business School, as well as being chair of the Partnership fund panel for the Impact Acceleration Account at Oxford for many years. I regularly act as board member and advisor for organisations such as the European Commission (ECVAM) and the National Centre for the 3Rs of animals in Reserach, the European Society of Cardiology (e-cardiology working group and Council of Basic Caardiovascular Science) and Wellcome Trust. Training & Coaching I have deep interest in scientific training in modelling and simulation, with a focus on technical aspects such as verification, validation and uncertainty quantification, and importantly also the skills required to collaborate across disciplines and sectors (academia/industry). I coach colleagues and deliver workshops on navigating career challenges with a healthy work-life balance, getting funding, collaborating, problem solving and conflict resolution. Public speaking I am regularly invited to give talks to academics, clinicians and industry on modelling and simulation for innovation in medical product development, within the Digital Twin and In Silico Trials visions. Here is a recent podcast 'Beyond communication, building up trust with potential interdisciplinary collaborators.' Here is a recording with my recent participation at public engagement event at the Science Museum in London. More recordings: Human in silico trial for the VPH summer school, NC3Rs award: how computer models can replace animal testing, 18th FRAME Annual Lecture, AWARDS Wellcome Trust Senior Research Fellowship in Biomedical Sciences, (2013-2025). European Society of Cardiology Fellow, 2019 Impact Award, MPLS Division, University of Oxford, 2018. 2017 NC3Rs International Prize (for Passini et al., 2017). NC3Rs Infrastructure for Impact Award (2016-2021). 2014 NC3Rs International Prize (for Britton et al., 2013). Archer Leadership project (2015-2017). EPSRC Impact Acceleration Award (2013-2016) Medical Research Council Centenary Award (2012-2013). Medical Research Council Industrial Partnership Award (2012-2013). Medical Research Council Career Development Award (2007-2013). Wellcome Trust Career Development Research Fellowship (2007-2012) BHF Intermediate Research Fellowship (2007-2011) Leverhulme Early Career Research Fellowship (2007-2009) Merit Award, Oxford University Computing Laboratory, 2005-2006 and 2008-2009. First Prize, Young Investigators Award Competition, Heart Rhythm Society Scientific Sessions, San Francisco, USA, May 2004. BiographyProfessor Blanca Rodriguez is Professor of Computational Medicine, Wellcome Trust Senior Research Fellow and Head of the Computational Biology and Health Informatics Theme at the Department of Computer Science, University of Oxford. Originally, she is from Valencia, Spain, where she trained in Engineering at the Universidad Politecnica de Valencia (MSc and PhD), and as a postdoc for two years at Tulane University in New Orleans, USA. She then joined Oxford, holding personal research fellowships since 2007 and a professorship since 2014. She has raised over £40 million as principal or co-investigator and leads the Computational Cardiovascular Science team (www.cs.ox.ac.uk/ccs). She is interested in novel, interdisciplinary methodologies to accelerate therapy development, and replace animal testing through collaboration with industry and regulators. Her team has contributed pioneering case studies for the Digital Twin vision in precision medicine, and In Silico Trials for therapy testing. She has a deep commitment to training on technical aspects of modelling and simulation including verification, validation and uncertainty quantification, but importantly also skills for effective interdisciplinary and intersectoral collaborations.  She regularly speaks in scientific conferences, to industry and public events. She also enjoys a healthy life style, has three children and loves friendship, swimming, yoga, food and travelling amongst many other things. RolesBoard of the National Centre for the Replacement, Refinement and Reduction of Animals in ResearchBoard of the National Centre for the Replacement, Refinement and Reduction of Animals in ResearchSelected PublicationsView AllManage publications From ionic to cellular variability in human atrial myocytes: an integrative computational and experimental study A. Muszkiewicz‚ X. Liu‚ A. Bueno−Orovio‚ B. A. J. Lawson‚ K. Burrage‚ B. Casadei and B. Rodriguez In Am J Physiol Heart Circ Physiol. Vol. 314. No. 5. Pages H895−H916. 2018. Details about From ionic to cellular variability in human atrial myocytes: an integrative computational and experimental study | BibTeX data for From ionic to cellular variability in human atrial myocytes: an integrative computational and experimental study | DOI (10.1152/ajpheart.00477.2017) | Link to From ionic to cellular variability in human atrial myocytes: an integrative computational and experimental study Computational techniques for ECG analysis and interpretation in light of their contribution to medical advances A. Lyon‚ A. Mincholé‚ J. P. Martínez‚ P. Laguna and B. Rodriguez In J R Soc Interface. Vol. 15. No. 138. 2018. Details about Computational techniques for ECG analysis and interpretation in light of their contribution to medical advances | BibTeX data for Computational techniques for ECG analysis and interpretation in light of their contribution to medical advances | DOI (10.1098/rsif.2017.0821) | Link to Computational techniques for ECG analysis and interpretation in light of their contribution to medical advances Distinct ECG Phenotypes Identified in Hypertrophic Cardiomyopathy Using Machine Learning Associate With Arrhythmic Risk Markers A. Lyon‚ R. Ariga‚ A. Mincholé‚ M. Mahmod‚ E. Ormondroyd‚ P. Laguna‚ N. de Freitas‚ S. Neubauer‚ H. Watkins and B. Rodriguez In Front Physiol. Vol. 9. Pages 213. 2018. Details about Distinct ECG Phenotypes Identified in Hypertrophic Cardiomyopathy Using Machine Learning Associate With Arrhythmic Risk Markers | BibTeX data for Distinct ECG Phenotypes Identified in Hypertrophic Cardiomyopathy Using Machine Learning Associate With Arrhythmic Risk Markers | DOI (10.3389/fphys.2018.00213) | Link to Distinct ECG Phenotypes Identified in Hypertrophic Cardiomyopathy Using Machine Learning Associate With Arrhythmic Risk Markers ProjectsArtificial intelligence for deep phenotyping and target discovery in Heart FailureTarget safety and efficacy evaluation in chronic heart failure using human-based modelling and simulationCompleted ProjectsChasteMechanisms of arrhythmogenesis and defibrillation in ischaemiapreDiCTeuHeartCompBioMedWellcome Trust Senior Research FellowshipNC3Rs Infrastructure for Impact AwardTransQSTPICPRACE Project AccessCompBioMed-XCompBioMed2PersonalizeAFHuman in silico clinical trials in post myocardial infarctionQuantitative Systems Toxicology Research Ambre  BertrandResearch Associate, Doctoral StudentLeto Luana RiebelResearch AssociateHannah SmithResearcher, Doctoral StudentZhinuo (Jenny) WangSenior Research Associate Past Students Miguel BernabeuOliver BrittonLouie Cardone-NoottAlberto CorriasCiara DangerfieldSara",
  "content_length": 10446,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:23"
}