{
  "name": "Blayne E. Mayfield",
  "homepage": "http://cs.okstate.edu/%7Ebem",
  "status": "success",
  "content": "Current research HTC Vive XR Elite Headset and Controls My research efforts include working toward unique and interesting applications of augmented reality (AR) and virtual reality (VR) to safety workers and first responders, industrial and manufacturing concerns, digital entertainment, and the quality of life for people in general. Unreal Tournament 2004: Steel Halo Mod In another direction, I am working to improve the believability and playing ability of NPCs (Non-Player Characters) in first-person shooter video games. With the assistance of graduate students, I am evaluating various machine learning techniques that will permit the NPCs to learn by trial-and-error or by observation. A paper is in the works that describes the application of evolutionary algorithms to create NPCs for the Capture the Flag mode of Unreal Tournament 2004. Interested in this research? Stop by and visit me! OSU CS Online BS in CS Degree OSU now offers our Bachelor's degree in Computer Science as an online program. If you are interested in taking online courses or completing your BS in CS degree online, contact Cara Brun, the CS undergraduate advisor. Motion capture for interactive digital entertainment Gollum The Department of CS operates a motion capture facility in the lab I use. It is comprised of an 8-camera Vicon system attached to an Intel Xeon, Windows-based computer with AutoDesk Maya and MotionBuilder software to create 3D models and manipulate them using the data captured using the Vicon system. This provides an excellent opportunity for students to experiment with the creation of realistic character animations for video games and films. This is the same technology Peter Jackson used to bring the character Gollum to life in his Lord of the Rings films. \"The idea that Bill Gates has appeared like a knight in shining armour to lead all customers out of the mire of technological chaos neatly ignores the fact tht it was he who, by peddling second-rate technology, led them into it in the first place\" —Douglas Adams",
  "content_length": 2033,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:26"
}