{
  "name": "Bo An 0001",
  "homepage": "https://www3.ntu.edu.sg/home/boan",
  "status": "success",
  "content": "Bo AN's Home Agent Mediated Intelligence Research Group HOME RESEARCH PUBLICATIONS CURRICULUM VITAE VACANCIES AWARDS CONTACT Your browser does not support JavaScript! OR The JavaScript has been turned off! Please upgrade your browser OR turn on the JavaScript on your browser. Bo An President's Chair Professor College of Computing and Data Science Nanyang Technological University Email: boan@ntu.edu.sg Phone: (65) 6790-5389 Fax: (65) 6792-6559 Address: Blk N4-02b-55, 50 Nanyang Avenue, Singapore 639798 News: I was invited to give a keynote speach at IJCAI 2024. [slides] News: We released our RL for fintech platform TradeMaster. News: I will be Program Chair of IJCAI 2027. News: I am General Co-Chair of the 22nd Int. Conference on Autonomous Agents and Multi-Agent Systems (AAMAS'23), London, May 2023. Biography Bo An is a President's Chair Professor and Head of Division of Artificial Intelligence at the College of Computing and Data Science of the Nanyang Technological University (NTU). He is also Director for Centre of AI-for-X of NTU. He was a Nanyang Assistant Professor during 2014-2018. Prior to join NTU in 2013, he spent one year as an Associate Professor at the Institute of Computing Technology of the Chinese Academy of Sciences. During October 2010 to June 2012, he was a Postdoctoral Researcher at the University of Southern California, working with Professor Milind Tambe. He received the Ph.D degree in Computer Science from the University of Massachusetts, Amherst, where he was advised by Professor Victor Lesser. Prior to that, he received the B.Sc. and M.Sc. degrees in Computer Science from Chongqing University, China. His research interests include artificial intelligence, multi-agent systems, computational game theory, reinforcement learning, automated negotiation, and optimization. He has published over 150 referred papers at top conferences (AAMAS, IJCAI, AAAI, ICML, NeurIPS, ICLR, KDD, ICAPS, EC, UAI, AISTATS, and WWW) and journals (JAAMAS, AIJ and ACM/IEEE Transactions). His research results in complex resource allocation have been applied to e-commerce, sensor networks, distributed streaming processing systems, and cloud computing. His work on applying game theory to security has been applied to develop game-theoretic randomization software that is currently deployed by the United States Federal Air Marshals Service, the United States Coast Guard, and wildlife conservation organizations. He has served as program committee members for many top conferences and was co-chair for some key international conferences/symposia. He is the recipient of the 2010 IFAAMAS Victor Lesser Distinguished Dissertation Award, an Operational Excellence Award from the Commander, First Coast Guard District of the United States, the 2012 INFORMS Daniel H. Wagner Prize for Excellence in Operations Research Practice, 2018 Nanyang Research Award (Young Investigator), and 2022 Nanyang Research Award. His publications won the Best Innovative Application Paper award at AAMAS'12 and the Innovative Application Award at IAAI'16. He was invited to give Early Career Spotlight talk at IJCAI'17. He led the team HogRider which won the 2017 Microsoft Collaborative AI Challenge. He was named to IEEE Intelligent Systems' \"AI's 10 to Watch\" list for 2018. He is on the IJCAI Board of Trustees and will be Program Chair of IJCAI’27. He is Editor-in-Chief of IEEE Intelligent Systems. He is the Associate Editor of Artificial Intelligence Journal (AIJ), Journal of Autonomous Agents and Multi-agent Systems (JAAMAS), ACM Transactions on Intelligent Systems and Technology, and ACM Transactions on Autonomous and Adaptive Systems and a member of the editorial board of Journal of Artificial Intelligence Research (JAIR). He was elected to the board of directors of IFAAMAS, senior member of AAAI, and Distinguished member of ACM. Current/recent conference/journal service Editor-in-Chief of IEEE Intelligent Systems Associate editor of Artificial Intelligence Journal (AIJ), Journal of Autonomous Agents and Multi-agent Systems (JAAMAS), Annals of Mathematics and Artificial Intelligence, ACM Transactions on Intelligent Systems and Technology, and ACM Transactions on Autonomous and Adaptive Systems Editorial board member of Journal of Artificial Intelligence Research (JAIR) General co-Chair: DAI'2024, DAI'2023, AAMAS'2023, DAI'2019, ICA'2017 PC co-Chair: ICAIF'2025, AAMAS'2020, PAAMS'2018, GameSec'2017, PRIMA'2017, IAT'2015 AAMAS: 2023 (General Co-Chair), 2022 (SPC, Blue Sky Ideas Track co-Chair), 2021 (SPC), 2020 (Program Co-Chair), 2019 (Innovative Applications co-Chair), 2018 (Tutorial co-Chair), 2017 (Scholarship co-Chair), 2016 (SPC), 2015 (SPC), 2014 (SPC, Demonstrations co-Chair), 2013 (Innovative Applications co-Chair) IJCAI: 2027 (Program Chair), 2023 (Associate Program Chair), 2022 (SPC), 2021 (SAC), 2020 (SPC), 2019 (SPC), 2018 (Tutorial co-Chair, SPC), 2017 (SPC), 2016 (SPC), 15 (SPC), 2013 (SPC) AAAI: 2026 (Associate Program Chair), 2025 (AC), 2024 (Tutorial co-Chair, AC), 2023 (AC), 2022 (SPC, Demonstrations co-Chair), 2021 (SPC), 2020 (SPC), 2019 (SPC), 2018 (SPC), 2017 (PC), 2016 (PC), 2015 (PC), 2014 (PC), 2013 (PC) EC: 2025 (SPC), 2024 (SPC), 2023 (PC), 2022 (PC), 2021 (PC), 2020 (PC), 2019 (PC), 2016 (PC), 2015 (PC) Your browser does not support JavaScript! OR The JavaScript has been turned off! Please upgrade your browser OR turn on the JavaScript on your browser.",
  "content_length": 5438,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:22"
}