{
  "name": "Bo Han 0003",
  "homepage": "https://bhanml.github.io",
  "status": "success",
  "content": "Bo Han Bo Han Home News Research Research Group Professional Service Teaching Codes & Data Awards & Honors Home Bo Han Associate Professor in Machine Learning @ Department of Computer Science Hong Kong Baptist University Faculty of Science BAIHO Visiting Scientist @ Imperfect Information Learning Team RIKEN Center for Advanced Intelligence Project [Google Scholar] [Github] [Group Website] [Blog] [RedNote] [Twitter] E-mail: bhanml@comp.hkbu.edu.hk (for general academic work) & bo.han@a.riken.jp TMLR Group is always looking for highly self-motivated PhD/RA/Visiting students and Postdoc researchers. Please read this document for recruiting information, browse link'23, link'24 and link'25 for group-wise research, and check this link for group information and this link for department information. Meanwhile, TMLR Group is happy to host remote research trainees. Due to the large number of emails we receive, we cannot respond to every email individually. Thanks! News TMLR Group is always looking for highly self-motivated PhD/RA/Visiting students and Postdoc researchers to work on trustworthy and efficient learning and reasoning algorithms, theories and systems. Various types of fellowship are available for outstanding applicants, such as HKPFS Fellowship and multiple government & industry-funded fellowships. TMLR Group is jointly looking for visiting scholars for Asian Trustworthy Machine Learning (ATML) Fellowships [Class 2023] [Class 2024] [Class 2025]. TMLR Group releases several papers that represent our research flavors: [Co-teaching], [OOD Theory], [G-effect], [CounterAnimal], [SFAT], [AR-Bench]. TMLR Group releases several papers that represent our current research: [AlphaApollo], [CRU], [Co-rewarding], [LoT], [DeepInception]. TMLR Group delivers our research perspective of trustworthy machine learning and reasoning: [Monograph], [Summary Paper], [Position Paper]. TMLR Group delivers several talks that represent our group-wise research thrusts: [Video'23a], [Video'23b], [Video'24a], [Video'24b], [Video'25a], [Video'25b]. Jan 2026: I will serve as Senior Area Chair for ICML'26. Jan 2026: I am honored to become an ACM Distinguished Speaker. Dec 2025: TMLR Group will author a position paper invited by IEEE Intelligent Systems [PDF]. Oct 2025: TMLR Group is honored to co-author a definition paper with many great researchers [PDF]. Oct 2025: TMLR Group open-sourced AlphaApollo, an agentic LLM reasoning library based on verl. Check out our paper for details. Sep 2025: I am honored to deliever an invited lecture at International School on Deep Learning 2026 [PDF]. Jun 2025: I am grateful to receive tenure promotion (effective Jul 2025). Jun 2025: TMLR Group is honored to receive 2025/26 RGC General Research Fund. Jun 2025: TMLR Group has co-organized several tutorials on Trustworthy Machine Learning under Imperfect Data [Slides] [Link]. May 2025: Qizhou and Jianing successfully defended their PhD Theses. Congratulations to TMLR's newly supervised Dr. Wang and Dr. Zhu! May 2025: TMLR Group is honored to receive INNS Aharon Katzir Young Investigator Award 2024 [News]. Apr 2025: TMLR Group will present \"Exploring Trustworthy Foundation Models: Benchmarking, Finetuning, and Reasoning\" [Slides] [Video]. Mar 2025: I will serve as Session Chair of Oral Efficient Transformer Optimization and Mentor Committee for ICLR'25. Jan 2025: TMLR Group is honored to receive 2024/25 RGC Young Collaborative Research Grant [News]. Dec 2024: I will serve as Session Chair of Oral Machine Learning and Science, Safety for NeurIPS'24. Dec 2024: I will serve as Program Co-chair for ACML'27. Nov 2024: TMLR Group is honored to receive IEEE AI's 10 to Watch Award 2024 by IEEE Intelligent Systems [PDF] [News]. Oct 2024: TMLR Group is honored to jointly receive NeurIPS'24 Workshop Outstanding Student Paper Award [Paper]. Jul 2024: I will serve as Session Chairs of Oral Labels and Oral Robustness and Safety for ICML'24. Jun 2024: I will serve as Associate Editor for IEEE TPAMI. Jun 2024: TMLR Group is honored to receive Dean's Award for Outstanding Achievement 2024. Jun 2024: TMLR Group's research is honored to be highlighted by Faculty of Science [News]. May 2024: TMLR Group is honored to receive IJCAI Early Career Spotlight 2024 [Paper] [Slides] [Poster]. Mar 2024: I will serve as Senior Area Chair and Workshop Co-Chair for NeurIPS'24. Mar 2024: TMLR Group will co-author a ML monograph invited by Foundations and Trends [PDF] [Link]. Dec 2023: I am honored to receive NeurIPS'23 Notable Area Chair. Dec 2023: I regularly serve as Area Chair for NeurIPS, ICML, ICLR, UAI and AISTATS (see Professional Service). Oct 2023: TMLR Group will co-organize HKBU-RIKEN AIP Joint Workshop on AI and ML [News]. Aug 2023: TMLR Group will co-author a ML monograph accepted by Springer Nature [Link]. Aug 2023: TMLR Group's collaborative work with Alibaba has been deployed into its online advertisement platform [News]. Aug 2023: I will serve as Action Editor for MLJ and JAIR and Area Chair for AISTATS'24. Jul 2023: TMLR Group has co-authored an interdisciplinary article published by Nature Plants. Feb 2023: I will serve as Area Chair for NeurIPS'23. Jan 2023: TMLR Group's collaborative work with Tencent achieves state-of-the-art results in GOOD benchmark. Dec 2022: I will serve as Area Chair for ICML'23 and UAI'23 and Publication & Publicity Co-Chair for ACML'23. Dec 2022: I will serve as Session Chair of Featured Papers for NeurIPS'22. Nov 2022: TMLR Group is honored to jointly receive NeurIPS'22 Outstanding Paper Award [Paper]. Aug 2022: TMLR Group will jointly organize Online Asian Machine Learning School 2022. Aug 2022: I will join the Editorial Board of JMLR and MLJ and serve as Area Chair for ICLR'23. May 2022: TMLR Group is honored to jointly receive NeurIPS'18 Most Influential Paper [Paper]. Feb 2022: RIKEN Team will author a ML monograph accepted by MIT Press [Link]. Oct 2021: TMLR Group is honored to receive Microsoft Research StarTrack Scholars Program 2021 (with AI for Science team). May 2021: I am honored to receive ICLR'21 Outstanding Area Chair. Jun 2020: TMLR Group is honored to receive 2020/21 RGC Early CAREER Scheme. Mar 2020: I am honored to receive RIKEN BAIHO Award 2019. See more news here. Research My research interests lie in machine learning, deep learning and foundation models. My long-term goal is to develop trustworthy and efficient intelligent systems (e.g., trustworthy foundation models), which can learn and reason from a massive volume of complex (e.g., weakly supervised, self-supervised, out-of-distribution, causal, fair, and privacy-preserving) data (e.g, label, example, preference, domain, similarity, graph, demonstration, rationale, and prompt) reliably and efficiently. Recently, I develop core machine learning methodology. Besides, I am actively applying our fundamental research into the interdisciplinary domain. I am heading Trustworthy Machine Learning and Reasoning Group. Our current research work center around several major themes (more information here): Foundation Models and Causal Representation Learning: [NeurIPS'21] [ICLR'22] [NeurIPS'22] [NeurIPS'23] [ICLR'24] [ICML'24] [NeurIPS'24] [ICLR'25] [ICML'25] Weakly Supervised and Self-supervised Representation Learning: [Survey] [NeurIPS'18] [ICML'19] [ICML'20] [ICML'21] [ICML'22] [ICLR'23] Robustness, Security and Privacy in Machine Learning: [ICML'20] [ICML'21] [ICLR'21] [NeurIPS'22] [ICLR'22] [NeurIPS'23] [NeurIPS'24] [ICLR'25] Federated, Efficient and Graph Machine Learning: [ICML'20] [KDD'21] [ICML'22] [ICLR'22] [NeurIPS'23] [ICLR'24] [NeurIPS'24] [ICLR'25] Interdisciplinary Problems (e.g., Healthcare Analytics and AI for Science): [NeurIPS'22] [Nature Plants'23] [ICLR'24] [NeurIPS'24] [ICLR'25] Selected Projects RGC Young Collaborative Research Grant (PC): Towards Trustworthy Foundation Models under Imperfect Scenarios [Link] [Website] RGC General Research Fund (PI): Towards Dynamic Knowledge-aware Federated Learning for Foundation Models [Link] [Website] RGC Early CAREER Scheme (PI): Trustworthy Deep Learning from Open-set Corrupted Data [Link] [Website] NSFC General Program (PI): The Research on Trustworthy Federated Learning in Imperfect Environments [Link] [Website] NSFC Young Scientists Fund (PI): The Research on the Automated Trustworthy Machine Learning [Link] [Website] GDST Basic Research Fund (PI): Trustworthy Graph Representation Learning under Out-of-distribution Data [Link] [Website] GDST Basic Research Fund (PI): Trustworthy Deep Reasoning with Human-level Constraints [Link] [Website] RIKEN Collaborative Research Fund (PI): New Directions in Trustworthy Machine Learning [Link] [Website] RIKEN BAIHO Award (PI): Development of Robust Deep Learning Technologies for Heavily Noisy Data [Link] [Website] Research Highlights (* indicates advisees/co-advisees; updating through the time; see the full list here) Trustworthy Machine Learning: From Data to Models. B. Han, J. Yao, T. Liu, B. Li, S. Koyejo, and F. Liu. Foundations and Trends® in Privacy and Security, 2025, [PDF] [Link] [Monograph]. From Passive to Active Reasoning: Can Large Language Models Ask the Right Questions under Incomplete Information? Z. Zhou*, X. Feng*, Z. Zhu, J. Yao, S. Koyejo, and B. Han. In Proceedings of 42nd International Conference on Machine Learning (ICML'25), [PDF] [Code] [Poster] [Blog]. Rethinking LLM Unlearning Objectives: A Gradient Perspective and Go Beyond. Q. Wang*, J.P. Zhou, Z. Zhou*, S. Shin, B. Han, and K.Q. Weinberger. In Proceedings of 13th International Conference on Learning Representations (ICLR'25), [PDF] [Code] [Poster] [Blog]. W-DOE: Wasserstein Distribution-agnostic Outlier Exposure. Q. Wang*, B. Han, Y. Liu, C. Gong, T. Liu, and J. Liu. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 47(5): 3530-3545, 2025, [PDF] [Code] [Blog]. Can Language Models Perform Robust Reasoning in Chain-of-thought Prompting with Noisy Rationales? Z. Zhou*, R. Tao*, J. Zhu",
  "content_length": 34021,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:24"
}