{
  "name": "Bo Ji 0001",
  "homepage": "http://people.cs.vt.edu/boji",
  "status": "success",
  "content": "Bo Ji's Homepage Home Research Publications Teaching Group Activities Links News Bo Ji (季博) Associate Professor, Department of Computer Science Faculty Fellow, College of Engineering Virginia Tech Editor, IEEE/ACM Transactions on Networking (ToN) Editor, ACM SIGMETRICS Performance Evaluation Review (PER) Associate Editor, IEEE Transactions on Network Science and Engineering (TNSE) Research Lab: Synergistic Networking and Augmented Intelligence Lab (SNAIL) Contact Information Email: boji AT vt DOT edu and boji AT cs DOT vt DOT edu Phone: +1 (540) 231-0331 Fax: +1 (540) 231-9218 Office: Gilbert Place, Room 4203 Address: 220 Gilbert Street, Blacksburg, VA 24060 Biography: Bo Ji received his B.E. and M.E. degrees in Information Science and Electronic Engineering from Zhejiang University, Hangzhou, China, in 2004 and 2006, respectively, and his Ph.D. degree in Electrical and Computer Engineering from The Ohio State University, Columbus, OH, USA, in 2012. Dr. Ji is an Associate Professor of Computer Science and a College of Engineering Faculty Fellow at Virginia Tech. Prior to joining Virginia Tech, he was an Associate Professor in the Department of Computer and Information Sciences at Temple University, where he was an Assistant Professor from July 2014 to June 2020. He was also a Senior Member of Technical Staff at AT&T Labs, San Ramon, CA, from January 2013 to June 2014. My research focuses on the design, analysis, control, and optimization of complex networked systems, including wireless and wired communication networks, edge and cloud computing, data centers, information-update systems, Internet of Things, and cyber-physical systems. With a strong emphasis on the synergy between network systems and artificial intelligence/machine learning (AI/ML), my research aims to address fundamental challenges by integrating theoretical insights with empirical investigation, driven by two tightly connected objectives: (1) Exploiting advanced AI/ML techniques to design next-generation network systems and support emerging applications such as extended reality (XR, including MR/VR/AR); (2) Designing high-performance computer and network systems optimized for large-scale, distributed AI/ML. Additionally, I am interested in addressing critical security and privacy challenges across these systems and applications. He has been the general co-chair of IEEE/IFIP WiOpt 2021 and the technical program co-chair of IEEE/IFIP WiOpt 2026, ACM MobiHoc 2023, and ITC 2021, and he has also served on the editorial boards of various IEEE/ACM journals (IEEE/ACM Transactions on Networking, ACM SIGMETRICS Performance Evaluation Review, IEEE Transactions on Network Science and Engineering, IEEE Internet of Things Journal, and IEEE Open Journal of the Communications Society). Dr. Ji is a senior member of the IEEE and the ACM and a member of the AAAS. He was a recipient of the National Science Foundation (NSF) CAREER Award in 2017, the NSF CISE Research Initiation Initiative Award in 2017, the IEEE INFOCOM 2019 Best Paper Award, the IEEE/IFIP WiOpt 2022 Best Student Paper Award, the IEEE TNSE Excellent Editor Award (three times in 2021, 2022, and 2024), and the Dean's Faculty Fellow Award from the College of Engineering at Virginia Tech in 2023. News [November 2025]: Dr. Bo Ji was invited to serve as TPC Co-Chair for IEEE INFOCOM 2027. [November 2025]: Dr. Bo Ji was invited to serve as TPC Co-Chair for the 4th Workshop on Next-generation Open and Programmable Radio Access Networks (NG-OPERA), in conjunction with IEEE INFOCOM 2026. [September 2025]: Former Ph.D. student, Matthew Corbett, received the Rising Star Alumni Award, as part of the Center for Human-Computer Interaction’s 30th Anniversary. Congratulations, Matt! [July 2025]: Thanks to the United States Military Academy for funding our project on “Assessing and Enhancing Team Situational Awareness via Real-Time Gaze Sharing.” This is a joint project with Dr. Brendan David-John. [June 2025]: Dr. Bo Ji was invited to serve as TPC Co-Chair for IEEE/IFIP WiOpt 2026. Please consider submitting your best work. [April 2025]: Chameleon Cloud featured HiRED, our work on attention-guided token dropping for efficient inference of vision language models. Hasan recently presented this work at AAAI’25. If you are interested, check out the story and Hasan's talk. [April 2025]: Thanks to ICAT/CHCI for funding our project on “Planning for AI-Augmented Human Decision-Making in Secure Space Operations: Building an Interdisciplinary Research Vision”. This is a joint project with Dr. Christiana Chamon Garcia and Dr. Brendan David-John. [March 2025]: Dr. Bo Ji was invited to serve as Area Chair for IEEE INFOCOM 2026. [February 2025]: A Computerworld article covers our recent research on users’ perceptions of security attacks and mitigation strategies in collaborative mixed reality, which will be presented at IEEE VR 2025 in March 2025. [January 2025]: Thanks to the NSF for funding our project on “Securing Gaze Data from Side-Channel Attacks in Foveated Systems.” This is a joint project with Dr. Brendan David-John. [VT News] [January 2025]: Dr. Bo Ji was invited to serve as Guest Editor for IEEE Transactions on Networking Special Issue on AI and Networking. [More news …] Page generated 2025-11-24 09:55:14 EST, by jemdoc+MathJax.",
  "content_length": 5320,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:26"
}