{
  "name": "Bo Luo",
  "homepage": "http://www.ittc.ku.edu/~bluo",
  "status": "success",
  "content": "Bo Luo - Homepage Bo Luo H.J. and Joan O. Wertz Professor Department of Electrical Engineering and Computer Science Director, High Assurance and Secure Systems (HASS) Research Center Institute for Information Sciences (I2S) The University of Kansas Home Research Publications Teaching Research Group Contact info Department of Electrical Engineering and Computer Science (EECS) 2016 Eaton Hall, 1520 West 15th St, Lawrence KS, 66045 Institute for Information Sciences (I2S) 341 Nichols Hall, 2335 Irving Hill Road, Lawrence, KS 66045 phone: 785-864-7749; email: bluo <at> ku <dot> edu My PGP public key My not-so-updated vita Research My current research interests lie in the intersection of security and privacy and AI/ML. In particular, I (together with my students and collaborators) mostly focus on two topics (in the past 5 years or so): Trustworthy and privacy-preserving machine learning: CCS'24a (benchmarking and detection of ChatGPT-generated text), CCS'24b (a physical-world attack against face recognition systems), ESORICS'24a (benchmarking and detection of AI-generated images), PETS'24 (secure multi-party computing for DNNs), CCS'22a (a feature-domain neural Trojan), ESORICS'22a (benchmarking the stealthiness of DL attacks), ACSAC'21 (universal defense against DNN adversarial example attacks), ESORICS'21 (defense against poisoning attacks in federated learning) IoT/CPS/Mobile security and privacy: ACSAC'25 (IoT privacy leakage detection), CCS'25 (detection and defense against IoT hidden attribute attack), PETS'25 (IoT cross-app privacy leak detection), ACSAC'24 (privacy policy compliance for Alexa skills), ESORICS'24b (security assessment of automative companion apps), ICPC'24 (mask app detection in iOS), ESORICS'22b (privacy compliance in IoT apps), ESORICS'20 (defense against CAN-bus denial and spoofing attacks), USENIX Sec'20 (IoT device identification in public WiFi) Before that, I also worked on social network analysis and user privacy protection, hardware-enabled security, information retrieval, database/XML access control, and privacy-preserving information sharing. We are looking for self-motivated students who are interested in academic research on information security. If you are interested in this opportunity or if you have questions, please drop me an email: bluo <at> ku <dot> edu. I will serve as the PC Co-Chair of SecureComm 2026. Submit your paper and join us in Lancaster, UK! I'm an associate editor of IEEE TDSC and ACM TIoT. I'm also on the program commitee of NDSS'26, USENIX Security'26, CCS'26, and PoPETS/PETS'26. I am the PI of Jayhawk SFS -- CyberCorps: Scholarship for Service program at KU. For more information about the program, please visit Jayhawk SFS program homepage. I am the director of the High Assurance and Secure Systems (HASS) Research Center at I2S. I2S is a National Center of Academic Excellence in Cyber Defense (CAE/CD) and Research (CAE-R) designated by the National Security Agency and Department of Homeland Security. Awards Distinguished Paper Award, IEEE/ACM International Conference on Program Comprehension (ICPC), 2024 KU EECS Excellence in Undergraduate Teaching Professorship, 2023 Best paper honorable mention, ACM Conference on Computer and Communications Security (CCS), 2022 Best paper award, Annual Computer Security Applications Conference (ACSAC), 2021 Miller Scholar, University of Kansas, 2016, 2017, 2021 Best paper award, Annual Computer Security Applications Conference (ACSAC), 2017 Miller Professional Development Award for Distinguished Service, University of Kansas, 2015 Education The Pennsylvania State University, University Park, Pennsylvania Ph.D., Information Sciences and Technology, August, 2008.      Advisor: Dr. Dongwon Lee The Chinese University of Hong Kong, Shatin, N.T. Hong Kong M.Phil., Information Engineering, December, 2003. Advisor: Dr. Xiaoou Tang University of Sciences and Technology of China, Hefei, Anhui, P.R.China B.E., Electronic and Information Engineering, July, 2001. Advisor: Dr. Nenghai Yu Selected Publications ACSAC 2025. Zhaohui Wang, Bo Luo, and Fengjun Li. InteractionShield: Harnessing Event Relations for Interaction Threat Detection and Resolution in Smart Homes. In Annual Computer Security Applications Conference (ACSAC), 2025. (Accepted) CCS 2025. Xuening Xu, Chenglong Fu, Xiaojiang Du, and Bo Luo. Discovering and Exploiting IoT Device Hidden Attributes: A New Vulnerability in Smart Homes. In ACM Conference on Computer and Communications Security (CCS), 2025. (Accepted) PETS 2025. Zhaohui Wang, Bo Luo, and Fengjun Li. PrivacyGuard: Exploring Hidden Cross-App Privacy Leakage Threats In IoT Apps. In the 25th Privacy Enhancing Technologies Symposium (PETS), 2025. ACSAC 2024. Javaria Ahmad, Fengjun Li, Razvan Beuran, and Bo Luo. Eunomia: A Real-time Privacy Compliance Monitor for Alexa Skills. In Annual Computer Security Applications Conference (ACSAC), 2024. CCS 2024. Zeyan Liu, Zijun Yao, Fengjun Li, and Bo Luo. On the Detectability of ChatGPT Content: Benchmarking, Methodology, and Evaluation through the Lens of Academic Writing. In ACM Conference on Computer and Communications Security (CCS) , 2024. [full paper with appendix ][data and code] CCS 2024. Ye Wang, Zeyan Liu, Bo Luo, Rongqing Hui, and Fengjun Li. The Invisible Polyjuice Potion: an Effective Physical Adversarial Attack against Face Recognition. In ACM Conference on Computer and Communications Security (CCS), 2024. [pdf] CCS 2024. Lingjing Yu, Jingli Hao, Jun Ma, Yong Sun, Yijun Zhao, and Bo Luo. A Comprehensive Analysis of Security Vulnerabilities and Attacks in Satellite Modems. In ACM Conference on Computer and Communications Security (CCS), 2024. [pdf] ESORICS 2024. Yuying Li, Zeyan Liu, Junyi Zhao, Liangqin Ren, Fengjun Li, Jiebo Luo, and Bo Luo. The Adversarial AI-Art: Understanding, Generation, Detection, and Benchmarking. In European Symposium on Research in Computer Security (ESORICS), 2024. [pdf][data and code] ESORICS 2024. Prashanthi Mallojula, Fengjun Li, Xiaojiang Du, and Bo Luo. Companion Apps or Backdoors? on the Security of Automotive Companion Apps. In European Symposium on Research in Computer Security (ESORICS), 2024. [pdf] USENIX Security 2024. Jinrui Ma, Lutong Chen, Kaiping Xue, Bo Luo, Xuanbo Huang, Mingrui Ai, Huanjie Zhang, David S. L. Wei, Yan Zhuang. FakeBehalf: Imperceptible Email Spoofing Attacks against the Delegation Mechanism in Email Systems. In USENIX Security Symposium, 2024. [pdf] USENIX Security 2024. Xuanbo Huang, Kaiping Xue, Lutong Chen, Mingrui Ai, Huancheng Zhou, Bo Luo, Guofei Gu, and Qibin Sun. You Can Obfuscate, but You Cannot Hide: CrossPoint Attacks against Network Topology Obfuscation. In USENIX Security Symposium, 2024. [pdf] USENIX Security 2024. Dongli Liu, Wei Wang, Peng Xu, Laurence T. Yang, Bo Luo, and Kaitai Liang. d-DSE: Distinct Dynamic Searchable Encryption Resisting Volume Leakage in Encrypted Databases. In USENIX Security Symposium, 2024. PETS 2024. Liangqin Ren, Zeyan Liu, Fengjun Li, Kaitai Liang, Zhu Li, and Bo Luo. PrivDNN: A Secure Multi-Party Computation Framework for Deep Learning using Partial DNN Encryption. In the 24th Privacy Enhancing Technologies Symposium (PETS), Bristol, UK, 2024. ICPC 2024. Yijun Zhao, Lingjing Yu, Yong Sun, Qingyun Liu, and Bo Luo. No Source Code? No Problem! Demystifying and Detecting Mask Apps in iOS. In ACM/IEEE International Conference on Program Comprehension (ICPC), Lisbon, Portugal, 2024. (ICPC 2024 Distinguished Paper Award) NDSS 2023. Tianyang Chen, Peng Xu, Stjepan Picek, Bo Luo, Willy Susilo, Hai Jin, and Kaitai Liang. The Power of Bamboo: On the Post-Compromise Security for Searchable Symmetric Encryption. In Network and Distributed System Security Symposium (NDSS), 2023. [link] TDSC 2023. Tao Xue, Yu Wen, Bo Luo, Gang Li, Yingjiu Li, Boyang Zhang, Yang Zheng, Yanfei Hu, and Dan Meng. SparkAC: Fine-Grained Access Control in Spark for Secure Data Sharing and Analytics. In IEEE Transactions on Dependable and Secure Computing (TDSC), vol. 20, iss. 2, 2023. [link] CCS 2022. Zeyan Liu, Fengjun Li, Zhu Li, and Bo Luo. LoneNeuron: a Highly-effective Feature-domain Neural Trojan using Invisible and Polymorphic Watermarks. In ACM SIGSAC Conference on Computer and Communications Security (CCS), Los Angeles, CA, USA, 2022 (Acceptance rate: 22.5%) [link][pdf] CCS 2022. Mingrui Ai, Kaiping Xue, Bo Luo, Lutong Chen, Nenghai Yu, Qibin Sun, and Feng Wu. Blacktooth: Breaking through the Defense of Bluetooth in Silence. In ACM SIGSAC Conference on Computer and Communications Security (CCS), Los Angeles, CA, USA, 2022 (Acceptance rate: 22.5%) (CCS Best Paper Honorable Mention) [link][pdf] ESORICS 2022. Zeyan Liu, Fengjun Li, Jingqiang Lin, Zhu Li, and Bo Luo. Hide and Seek: on the Stealthiness of Attacks against Deep Learning Systems. In European Symposium on Research in Computer Security (ESORICS), Copenhagen, Denmark, 2022. (Acceptance rate: 18.5%) [pdf] ESORICS 2022. Javaria Ahmad, Fengjun Li, and Bo Luo. IoTPrivComp: A Measurement Study of Privacy Compliance in IoT Apps. In European Symposium on Research in Computer Security (ESORICS), Copenhagen, Denmark, 2022. (Acceptance rate: 18.5%) [pdf] ACSAC 2021. Sohaib Kiani, Sana Awan, Chao Lan, Fengjun Li, and Bo Luo. Two Souls in an Adversarial Image: Towards Universal Adversarial Example Detection using Multi-view Inconsistency. In Annual Computer Security Applications Conference (ACSAC), 2021. (Acceptance rate: 24.5%) (ACSAC Distinguished Paper Award) [link][pdf][code] ESORICS 2021. Sana Awan, Bo Luo, and Fengjun Li. CONTRA: Defending against Poisoning Attacks in Federated Learning. In European Symposium on Research in Computer Security (ESORICS), 2021. (Acceptance rate: 20.2%) [link][pdf] TDSC 2021. Congwu Li, Le Guan, Jingqiang Lin, Bo Luo, Quanwei Cai, Jiwu Jing, and Jing Wang. Mimosa: Protecting Private Keys against Memory Disclosure Attacks using Hardware Transactional Memory. In IEEE Transactions on Dependable and Secure Computi",
  "content_length": 16730,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:27"
}