{
  "name": "Bo Ou",
  "homepage": "http://csee.hnu.edu.cn/people/oubo",
  "status": "success",
  "content": "欧博-湖大信息科学与工程学院 教师登录 English 返回首页 学院概况 学院简介 学院领导 师资力量 机构设置 决策机构 教学单位 计算机科学系 软件工程系 通信工程系 信息工程系 计算机工程系 网络空间安全系 实验中心 基础教学部 研究机构 特色学院 条件装备 办事机构 人才培养 本科培养 研究生培养 博士生培养 留学生培养 学科专业方向 科学研究 科研项目 科研成果 成果转化 学术信息 工作流程 招生就业 本科招生 硕士招生 博士招生 学生就业 实习就业基地 学生工作 学生动态 学生党建 团学工作 日常管理 心理健康 奖励工作 社团组织 党群工作 党建工作 工会工作 关工委工作 学术资源 资源管理系统 精品课程 实验仪器设备 欧博 我的位置在： 首页 > 学院概况 > 师资力量 > 欧博 教师介绍 湖南大学信息科学与工程学院，副教授、博士生导师，从事可逆隐藏领域的相关研究。近年来主持了1项国家自然科学基金-面上项目，1项湖南省自然科学基金-青年项目和1项国家自然科学基金-青年基金项目。作为第一作者或通讯作者在国内国际学术会议和刊物上发表可逆信息隐藏的30余篇，其中SCI检索论文21篇，总用次数1300多次，Google学术影响力H指数和i10指数分别为15和21。 中文名： 欧博 英文名： 学历： 博士 职称： 副教授 联系电话： 电子邮件： oubo@hnu.edu.cn 研究方向： 可逆信息隐藏及相关研究。 联系地址： 湖南省长沙市岳麓区麓山南路2号,湖南大学信息科学与工程学院（410082） 所属机构： 网络空间安全系 学院教师 教育经历 2004-2008 本科 北京交通大学 专业：计算机科学与技术2008-2014 硕博连读 北京交通大学 专业：人机交互 科研状况 可逆信息隐藏:1.高保真的可逆算法；2.彩色图像可逆算法。 科研项目 适用于JPEG图像的高保真鲁棒可逆信息隐藏算法研究，国家自然科学基金-面上项目，2019-2022。彩色图像的高保真可逆信息隐藏算法研究，国家自然科学基金-青年基金，2016-2018。适用于彩色图像的高维多直方图可逆信息隐藏技术研究，湖南省自然科学基金-青年基金，2018-2021。 学术论文 期刊论文：[1] Bo Ou, Xiaolong Li, Yao Zhao, Rongrong Ni, Yun-Qing Shi: \"Pairwise Prediction-Error Expansion for Efficient Reversible Data Hiding\". IEEE Transactions on Image Processing, vol.22, no.12, pp.5010-5021, Dec. 2013. (SCI, IF = 3.20)[2] Bo Ou, Xiaolong Li, Jinwei Wang, Fei Peng:\"High-fidelity reversible data hiding based on geodesic path and pairwise prediction-error expansion\",Neurocomputing, vol.226, pp.23-34, Feb. 2017. (SCI, IF = 2.39)[3] Bo Ou, Xiaolong Li, Jinwei Wang, Improved PVO-based reversible data hiding: A new implementation based on multiple histograms modification, Journal of Visual Communication and Image Representation, vol.38, pp.328-339, Jul. 2016. (SCI, IF = 1.42)[4] Bo Ou, Xiaolong Li, Jinwei Wang, High-fidelity reversible data hiding based on pixel-value-ordering and pairwise prediction-error expansion, Journal of Visual Communication and Image Representation, vol. 39,pp.12-23, Aug. 2016. (SCI, IF = 1.42)[5] Bo Ou, Xiaolong Li, Yao Zhao, Rongrong Ni:“Efficient color image reversible data hiding based on channel-dependent payload partition and adaptive embedding”. Signal Processing, vol. 108, pp.642-657, 2015. (SCI, IF = 2.238)会议文章：[1] Bo Ou, Xiaolong Li, Weiming Zhang: PVO-based reversible data hiding for encrypted images. ChinaSIP 2015: 831-835.(EI)[2] Bo Ou, Yao Zhao, Rongrong Ni: “Reversible watermarking using prediction error histogram and blocking”. IWDW 2010: pp. 170-180. (EI & ISTP)[3] Bo Ou, Yao Zhao, Rongrong Ni, Gang Cao: “A high payload histogram-based reversible watermarking using linear prediction”. IIH-MSP 2010: pp. 446-449. (EI & ISTP) 湖大官网 湖大微信 湖大微博 版权所有©湖南大学2017          湖南大学党委宣传部          地址：湖南省长沙市岳麓区麓山南路麓山门          邮编：410082          Email：xiaoban@hnu.edu.cn          域名备案信息：[www.hnu.edu.cn,www.hnu.cn/湘ICP备05000239号]          [hnu.cn 湘教QS3-200503-000481 hnu.edu.cn 湘教QS4-201312-010059]",
  "content_length": 2798,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:25"
}