{
  "name": "Bo Zhu 0002",
  "homepage": "https://faculty.cc.gatech.edu/~bozhu",
  "status": "success",
  "content": "BO ZHU@GT Bo Zhu Assistant Professor, School of Interactive Computing Georgia Institute of Technology Office: Klaus 3146, GT Campus, Atlanta Email: bo.zhu@gatech.edu About Me I am an Associate Professor in the School of Interactive Computing at Georgia Tech. My research interests lie in computer graphics, computational physics, and scientific machine learning. My primary focus is to develop geometric data structures and numerical algorithms for solving computational challenges associated with various kinds of physical systems. I am consistently fascinated by the beauty and complexity of fluids, with a particular emphasis on simulating their interfacial dynamics, vortical structures, and topological evolution. For these works, I was awarded the NSF Career Award in 2022. Prior to relocating to Atlanta, I spent five wonderful years as an Assistant Professor of Computer Science at Dartmouth College. I formerly worked as a postdoc researcher at MIT CSAIL. I earned my Ph.D. from the Computer Science Department at Stanford University, under the guidance of Prof. Ron Fedkiw. My B.Eng. and M.Sc. degrees were obtained at Shanghai Jiao Tong University. [SCA 2025] This year, I am co-organizing the 24th Symposium on Computer Animation (SCA 2025) together with Prof. Yin Yang from the University of Utah. SCA 2025 will be co-located with ACM SIGGRAPH in downtown Vancouver from August 8 to 10. We would sincerely appreciate it if you would consider submitting your work and/or sponsoring this long-standing symposium in computer animation! [NSF IRES: Summer Research Intern Opportunity] Starting in the fall of 2022, I began leading a three-year research project on Physical AI Design, sponsored by the NSF Office of International Science and Engineering. We are actively seeking summer research interns in the areas of physics simulation, machine learning, and user interface design. If you are interested in collaborating with us, please don't hesitate to submit your application. Additional information about the internship can be found on the project webpage. Publications See my Google Scholar for an up-to-date publication list. Yuchen Sun, Junlin Li, Ruicheng Wang, Sinan Wang, Zhiqi Li, Bart G. van Bloemen Waanders, Bo Zhu. Leapfrog Flow Maps for Real-Time Fluid Simulation. ACM Transactions on Graphics (SIGGRAPH 2025), Volume 44, Issue 4 (to appear). [paper][video][project page][code] Duowen Chen*, Zhiqi Li* (joint 1st authors), Taiyuan Zhang, Jinjin He, Junwei Zhou, Bart G. van Bloemen Waanders, Bo Zhu. Fluid Simulation on Compressible Flow Maps. ACM Transactions on Graphics (SIGGRAPH 2025), Volume 44, Issue 4 (to appear). [paper][video][project page] Zhiqi Li, Candong Lin, Duowen Chen, Xinyi Zhou, Shiying Xiong, Bo Zhu. Clebsch Gauge Fluid on Particle Flow Maps. ACM Transactions on Graphics (SIGGRAPH 2025), Volume 44, Issue 4 (to appear). (Best Paper Award Honorable Mention) [paper][video][project page] Zhiqi Li*, Ruicheng Wang*, Junlin Li* (joint 1st authors), Duowen Chen, Sinan Wang, Bo Zhu. EDGE: Epsilon-Difference Gradient Evolution for Buffer-Free Flow Maps. ACM Transactions on Graphics (SIGGRAPH 2025), Volume 44, Issue 4 (to appear). [paper][video][project page] Mengdi Wang, Fan Feng, Junlin Li, Bo Zhu. Cirrus: Adaptive Hybrid Particle-Grid Flow Maps on GPU. ACM Transactions on Graphics (SIGGRAPH 2025), Volume 44, Issue 4 (to appear). [paper][video][project page][code] Sinan Wang, Junwei Zhou, Fan Feng, Zhiq i Li, Yuchen Sun, Duowen Chen, Greg Turk, Bo Zhu. Fluid Simulation on Vortex Particle Flow Maps. ACM Transactions on Graphics (SIGGRAPH 2025), Volume 44, Issue 4 (to appear). [paper][video][project page][code] Duowen Chen, Junwei Zhou, Bo Zhu. A Neural Particle Level Set Method for Dynamic Interface Tracking. ACM Transactions on Graphics, Volume 44, Issue 3 (to be presented in SIGGRAPH 2025). [paper][video][project page] Yue Gao*, Hong-Xing Yu* (joint 1st authors), Bo Zhu, Jiajun Wu. FluidNexus: 3D Fluid Reconstruction and Prediction from a Single Video. Computer Vision and Pattern Recognition (CVPR 2025), Oral Presentation. [paper][project page][code] Mengdi Wang, Matthew Cong, Bo Zhu. An Interface Tracking Method with Triangle Edge Cuts. Journal of Computational Physics (JCP), Volume 520, 2025. [paper][project page] Ziqian Wu, Jiyoon Park, Paul R Steiner, Bo Zhu, John XJ Zhang. A Graph-Based Machine-Learning Approach Combined with Optical Measurements to Understand Beating Dynamics of Cardiomyocytes. Journal of Computational Biology, Volume 32, Issue 3, 2025. [paper] Ziqian Wu, Jiyoon Park, Paul R Steiner, Bo Zhu, John XJ Zhang. Generative Adversarial Network Model to Classify Human Induced Pluripotent Stem Cell-Cardiomyocytes based on Maturation Level. Scientific Reports, 14, 2024. [paper] Yifei Li, Yuchen Sun, Pingchuan Ma, Eftychios Sifakis, Tao Du, Bo Zhu, Wojciech Matusik. Neural Fluidic System Design and Control with Differentiable Simulation. Neural Information Processing Systems (NeurIPS 2024). [paper][project page] Yuchen Sun, Linglai Chen, Weiyuan Zeng, Tao Du, Shiying Xiong, and Bo Zhu. An Impulse Ghost Fluid Method for Simulating Two-Phase Flows. ACM Transactions on Graphics (SIGGRAPH Asia 2024), Volume 43, Issue 6. [paper][video][project page] Zhiqi Li, Duowen Chen, Candong Lin, Jinyuan Liu, and Bo Zhu. Particle-Laden Fluid on Flow Maps. ACM Transactions on Graphics (SIGGRAPH Asia 2024), Volume 43, Issue 6. (Best Paper Award) [paper][video][project page] Sinan Wang, Yitong Deng, Molin Deng, Hong-Xing Yu, Junwei Zhou, Duowen Chen, Taku Komura, Jiajun Wu, and Bo Zhu. An Eulerian Vortex Method on Flow Maps. ACM Transactions on Graphics (SIGGRAPH Asia 2024), Volume 43, Issue 6. [paper][video][project page][code] Duowen Chen, Zhiqi Li, Junwei Zhou, Fan Feng, Tao Du, Bo Zhu. Solid-Fluid Interaction on Particle Flow Maps. ACM Transactions on Graphics (SIGGRAPH Asia 2024), Volume 43, Issue 6. [paper][video][project page] Jinjin He, Taiyuan Zhang, Hiroki Kobayashi, Atsushi Kawamoto, Yuqing Zhou, Tsuyoshi Nomura, and Bo Zhu. Multi-level Partition of Unity on Differentiable Moving Particles. ACM Transactions on Graphics (SIGGRAPH Asia 2024), Volume 43, Issue 6. [paper][video][project page] Qiqin Le, Jiamu Bu, Yanke Qu, Bo Zhu, Tao Du. Computational Biomimetics of Winged Seeds. ACM Transactions on Graphics (SIGGRAPH Asia 2024), Volume 43, Issue 6. [paper] [project page][code] Hui Wang, Yuwei Xiao, Yankai Mao, Shiying Xiong, Xubo Yang, and Bo Zhu. A Two-Way Coupling Approach for Simulating Bouncing Droplets. International Journal for Numerical Methods in Engineering (IJNME), Volume 125, Issue 24, 2024. [preprint][video][project page] Hui Wang, Zhi Wang, Shulin Hong, Xubo Yang, and Bo Zhu. A Moving Least-Squares/Level-Set Particle Method for Bubble and Foam Simulation. IEEE Transactions on Visualization and Computer Graphics (TVCG), 2024. [paper][video][project page] Junwei Zhou, Duowen Chen, Molin Deng, Yitong Deng, Yuchen Sun, Sinan Wang, Shiying Xiong, Bo Zhu. Eulerian-Lagrangian Fluid Simulation on Particle Flow Maps. ACM Transactions on Graphics (SIGGRAPH 2024), Volume 43, Issue 4. [paper][video][project page][code] Ningxiao Tao, Liangwang Ruan, Yitong Deng, Bo Zhu, Bin Wang, Baoquan Chen. A Vortex Particle-on-Mesh Method for Soap Film Simulation. ACM Transactions on Graphics (SIGGRAPH 2024), Volume 43, Issue 4. [video][pdf][project page] Zhiqi Li, Barnabás Börcsök, Duowen Chen, Yutong Sun, Bo Zhu, Greg Turk. Lagrangian Covector Fluid with Free Surface. ACM SIGGRAPH 2024 (Conference Track). [paper][video][project page] Fan Feng, Shiying Xiong, Hiroki Kobayashi, Yuqing Zhou, Masato Tanaka, Atsushi Kawamoto, Tsuyoshi Nomura, Bo Zhu. Nonlinear Topology Optimization on Thin Shells using a Reduced-order Elastic Shell Mode. Thin-Walled Structures, Volume 197, 2024. [paper] Yunjin Tong, Shiying Xiong, Xingzhe He, Shuqi Yang, Zhecheng Wang, Rui Tao, Runze Liu, and Bo Zhu. RoeNet: Predicting Discontinuity of Hyperbolic Systems from Continuous Data. International Journal for Numerical Methods in Engineering (IJNME), Volume 125, 2024. [paper] Hong-Xing Yu*, Yang Zheng*, (joint 1st authors) Yuan Gao, Yitong Deng, Bo Zhu, Jiajun Wu. Inferring Hybrid Fluid Fields from Videos. Neural Information Processing Systems (NeurIPS 2023). [paper][video][project page][code] Yitong Deng, Hong-Xing Yu, Diyang Zhang, Jiajun Wu, Bo Zhu. Fluid Simulation on Neural Flow Maps. ACM Transactions on Graphics (SIGGRAPH Asia 2023), Volume 42, Issue 6. (Best Paper Award) [paper][video][project page][code] Qiqin Le, Yitong Deng, Jiamu Bu, Bo Zhu, Tao Du. Second-Order Finite Elements for Deformable Surfaces. SIGGRAPH Asia 2023 (Conference track). [paper][video][project page] Xingqiao Li, Xingyu Ni, Bo Zhu, Bin Wang, Baoquan Chen. GARM-LS: A Gradient-Augmented Reference-Map Method for Level-Set Fluid Simulation. ACM Transactions on Graphics (SIGGRAPH Asia 2023), Volume 42, Issue 6. [video][paper][code] Yitong Deng, Hong-Xing Yu, Jiajun Wu, Bo Zhu.Learning Vortex Dynamics For Fluid Inference and Prediction. International Conference on Learning Representations (ICLR 2023). [paper][video][project page][code] Zhou Xian, Bo Zhu, Zhenjia Xu, Hsiao-Yu Tung, Antonio Torralba, Katerina Fragkiadaki, Chuang Gan. FluidLab: A Differentiable Environment for Benchmarking Complex Fluid Manipulation. International Conference on Learning Representations (ICLR 2023). [paper][project page][code] Shiying Xiong, Xingzhe He, Yunjin Tong, Yitong Deng, and Bo Zhu. Neural Vortex Method: from Finite Lagrangian Particles to Infinite Dimensional Eulerian Dynamics. Computers & Fluids, 2023. [paper] Fan Feng, Shiying Xiong, Ziyue Liu, Zangyueyang Xian, Yuqing Zhou, Hiroki Kobayashi, Atsushi Kawamoto, Tsuyoshi Nomura, Bo Zhu. Cellular Topology Optimization on Differentiable Voronoi Diagrams. International Journal for Numerical Methods in Engineering (IJNME), Volume 124, Issue 1, 2023. [paper][video][project page] Jinyuan Liu, Mengdi Wang, Fan Feng, Annie Tang, Qiqin Le, and Bo Zhu. Hydro",
  "content_length": 19093,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:30"
}