{
  "name": "Bo Zhao 0019",
  "homepage": "https://www.aalto.fi/en/people/bo-zhao",
  "status": "success",
  "content": "Bo Zhao | Aalto University People Bo Zhao Assistant Professor Assistant Professor T313 Dept. Computer Science Assistant Professor Department of Computer Science Assistant Professor Computer Science Professors Assistant Professor Computer Science - Computing Systems (ComputingSystems) - Research area Assistant Professor Computer Science - Large-scale Computing and Data Analysis (LSCA) - Research area Assistant Professor Computer Science - Artificial Intelligence and Machine Learning (AIML) - Research area I have open PhD and Intern positions. Please find more details in my personal website and vacancies. I am a tenure-track Assistant Professor in the Department of Computer Science at Aalto University. I am also affiliated with the Finnish Center for Artificial Intelligence (FCAI) and the Helsinki Institute for Information Technology (HIIT). My research focuses on efficient data-intensive systems that translate data into value for decision making. The scope of my research spans across multiple layers of the data-intensive systems, from scalable machine learning systems to distributed data management systems, as well as code optimization techniques. That is to answer the question “how to co-design multiple layers of the software stack to improve scalability, performance, and energy efficiency of machine learning systems”. My long-term goal is to explore and understand the fundamental connections between data management and modern machine learning systems to make decision-making more transparent, robust and efficient. Please find more details in my research statement and the press coverage. My publication lists are available at DBLP and Google Scholar. Before joining Aalto, I was an Assistant Professor at Queen Mary University of London, after working as a post-doctoral researcher at Imperial College London in the Large-Scale Data & Systems (LSDS) group with Prof. Peter Pietzuch. Before Imperial, I was a research assistant and obtained my PhD in the Databases and Information Systems Group at Humboldt-Universität zu Berlin (HU), supervised by Prof. Matthias Weidlich. Before HU, I worked as a student assistant at the Parallel Programming group with Prof. Felix Wolf in RWTH-Aachen University and  Technical University of Darmstadt. Full researcher profile https://research.aalto.fi/... Email bo.zhao@aalto.fi Postal address Otakaari 1 00076 Aalto Finland Phone number +358503227953 Areas of expertise 113 Computer and information sciences Honors and awards Distinguished Reviewer Award for VLDB 2025 Award or honor granted for academic or artistic career Department of Computer Science Sep 2025 Research groups Computer Science Professors, Assistant Professor Computer Science - Computing Systems (ComputingSystems) - Research area, Assistant Professor Computer Science - Large-scale Computing and Data Analysis (LSCA) - Research area, Assistant Professor Computer Science - Artificial Intelligence and Machine Learning (AIML) - Research area, Assistant Professor Professorship Zhao Bo, Assistant Professor Publications Scalpel : High Performance Contention-Aware Task Co-Scheduling for Shared Cache Hierarchy Song Liu, Jie Ma, Zengyuan Zhang, Xinhe Wan, Bo Zhao, Weiguo Wu 2025 IEEE Transactions on Computers Distributional Counterfactual Explanations With Optimal Transport Lei You, Lele Cao, Mattias Nilsson, Bo Zhao, Lei Lei 2025 Proceedings of the 28th International Conference on Artificial Intelligence and Statistics (AISTATS) 2025 OLAP on Modern Chiplet-Based Processors Alessandro Fogli, Bo Zhao, Peter Pietzuch, Maximilian Bandle, Jana Giceva 2024 Proceedings of the VLDB Endowment Tenplex : Dynamic Parallelism for Deep Learning using Parallelizable Tensor Collections Marcel Wagenländer, Guo Li, Bo Zhao, Luo Mai, Peter Pietzuch 2024 SOSP 2024 - Proceedings of the 2024 ACM SIGOPS 30th Symposium on Operating Systems Principles TurboStencil : You only compute once for stencil computation Song Liu, Xinhe Wan, Zengyuan Zhang, Bo Zhao, Weiguo Wu 2023 Future Generation Computer Systems MSRL: Distributed Reinforcement Learning with Dataflow Fragments Huanzhou Zhu, Bo Zhao, Gang Chen, Weifeng Chen, Yijie Chen, Liang Shi, Yaodong Yang, Peter Pietzuch, Lei Chen 2023 Proceedings of the 2023 USENIX Annual Technical Conference Adaptive incentive-based demand response with distributed non-compliance assessment Gururaghav Raman, Bo Zhao, Jimmy Chih Hsien Peng, Matthias Weidlich 2022 Applied Energy State Management for Efficient Event Pattern Detection Bo Zhao 2022 EIRES: Efficient Integration of Remote Data in Event Stream Processing Bo Zhao, Han Van Der Aa, Thanh Tam Nguyen, Quoc Viet Hung Nguyen, Matthias Weidlich 2021 SIGMOD '21: Proceedings of the 2021 International Conference on Management of Data Load shedding for complex event processing Bo Zhao, Nguyen Quoc Viet Hung, Matthias Weidlich 2020 Proceedings - 2020 IEEE 36th International Conference on Data Engineering, ICDE 2020 Dynamic Decision Making for Demand Response through Adaptive Event Stream Monitoring Gururaghav Raman, Jimmy Chih Hsien Peng, Bo Zhao, Matthias Weidlich 2019 2019 IEEE Power and Energy Society General Meeting, PESGM 2019 Complex event processing under constrained resources by state-based load shedding Bo Zhao 2018 Proceedings - IEEE 34th International Conference on Data Engineering, ICDE 2018 Beyond Data Parallelism : Identifying parallel tasks in sequential programs Zhen Li, Bo Zhao, Ali Jannesari, Felix Wolf 2015 Algorithms and Architectures for Parallel Processing - 15th International Conference, ICA3PP 2015, Proceedings Dependence-based code transformation for coarse-grained parallelism Bo Zhao, Zhen Li, Ali Jannesari, Felix Wolf, Weiguo Wu 2015 Proceedings of the 2nd International Workshop on Code OptimiSation for MultI and Many Cores, COSMIC 2015 - Held in conjunction with the International Symposium on Code Generation and Optimization,CGO 2015",
  "content_length": 5899,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:28"
}