{
  "name": "Bob P. Weems",
  "homepage": "http://ranger.uta.edu/~weems",
  "status": "success",
  "content": "Bob Weems Bob Weems is an associate professor at the University of Texas at Arlington, Department of Computer Science and Engineering. His past efforts emphasize parallel computing and online computation. (current efforts) weems@uta.edu (My computing life in weblinks, as presented to CSE 1105) Fall 2025 Office Hours - Wednesday 11:30 - 1:30 ERB 627 CSE 3318-004 - Tuesday/Thursday 11:00 - 12:20 SH 324 CSE 3318-003 - Tuesday/Thursday 2:00 - 3:20 PKH 321 Graduate Teaching Assistants CSE 3318 (primarily for section 004) Chaoqun Li, cxl6029@mavs.uta.edu Office Hours - Monday 2:00 - 5:00 p.m. / Wednesday 12:40 - 3:40 p.m. in ERB 312 CSE 3318 (primarily for section 003) Ayesha Siddiqua, axs0940@mavs.uta.edu Office Hours - Tuesday / Thursday 12:15 - 3:15 p.m. in ERB 505 Have you considered ACM membership? CSE 1105 Homework / Reality Check Preparation for Senior Design I, II, and Beyond (mostly from CACM: Current Issue, The First 25 Years, The First 50 Years): Y R U here? (Destructive Innovation?, The Alternative?, It's bigger than you and you are not me) Quality (Values Questioned I, Values Questioned II) I hope you're tough Prof. Dr. Edsger W. (Dijkstra), the (Kingsfield) of CS (detractors?) Real Texans don't sweat (The Underworld meets The Academy) Get real, reading is so last millenium The other design patterns book How about a teeny, tiny bit of extensibility? e-democracy or democracy? (Redistricting, The Tech Coup: How to Save Democracy from Silicon Valley) Current ACM TechNews The world as you've never seen it before (Learning - Mapmaking for your life) The reason CS students must take physics (Care for a Feynman sandwich? Nobel physicists on the move) The Bootstrapping of Computer Science Highly Recommended . . . Free pdf: Elements of Programming The One-Week Challenge: Read The Shorthorn and The Chronicle (But, what do you want?, \"Humanity is going to take its course no matter what I try to do about it.\") Before you do much with ChatGPT (what it does), some insights from a Former ACM President and the Professor Emeritus of The Art of Computer Programming A book that leads to much of my recreational reading: Exact Thinking in Demented Times: The Vienna Circle and the Epic Quest for the Foundations of Science Past Courses CSE 3302: Programming Languages CSE 3318: Algorithms and Data Structures CSE 4351: Parallel Processing CSE 5311: Design and Analysis of Algorithms CSE 5314: Online Algorithms CSE 5319: Computational Geometry CSE 6319: Algorithmic Game Theory CSE 6350: Advanced Topics in Computer Architecture",
  "content_length": 2552,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:35"
}