{
  "name": "Bob Fisher",
  "homepage": "http://homepages.inf.ed.ac.uk/rbf",
  "status": "success",
  "content": "Bob Fisher's Personal Page Bob Fisher Click image for 3D Video: See the University of Edinburgh online research video collection. Here's mine: Prof. Robert Fisher has been an academic in the School of Informatics (originally in the former Department of Artificial Intelligence) at University of Edinburgh since 1984 and a full Professor since 2003. He received his PhD from University of Edinburgh (1987), investigating computer vision in the former Department of Artificial Intelligence. His previous degrees are a BS with honors (Mathematics) from California Institute of Technology (1974) and a MS (Computer Science) from Stanford University (1978). He worked as a software engineer for 5 years before returning to study for his PhD. Research Overview Publication List. Google Scholar List. University PURE research activity entry. ResearchGate. LinkedIn. He has been researching 3D scene understanding since 1982, and has worked on model based object recognition, range image analysis and parallel vision algorithms. He is or has been the principal investigator of these projects: a partner in euCognition: European Network for the Advancement of Artificial Cognitive Systems DERMOFIT: A cognitive prosthesis to aid focal skin lesion diagnosis (Wellcome Foundation funded research project). ChiRoPing: Dynamic shape capture of bats using a high speed 3D range sensor Fish4Knowledge: investigating knowledge extraction from very large datasets (of fish), including its SecondLife Exhibition Hall TrimBot2020: investigating the robotics and computer vision needed by a gardening robot for rose, hedge and topiary trimming Advanced Care Research Centre - a University-wide activity focussing on improving care for ageing adults. My group is investigating what can be done with video analysis. His current PhD students and research staff are: Longfei Chen Chris Lochhead Fiona Smith Yucheng Xu His PhD graduates are: Emilio Agustin Molina, Cigdem Beyan, Edvaldo Bispo, Scott Blunsden, Dibio Borges, Jay Bradley, Toby Breckon, Li Dong Cai, Michael Cameron-Jones, Helmut Cantzler, Adam Clayden, Hanz Cuevas Vélasquez, Andrew Fitzgibbon, Herman Gomes, Julian Habekost, Luis Horna Carranza, Xuan (Phoenix) Huang, Howard Hughes, Alex Hunt, Kiyoon Kim, Nanbo Li, Xiang Li, Tim Lukins, Steven McDonagh, Maurizio Pilu, Can Pu, M. Ahmed Raza, Rowland Sillito, William Smith, Yaoru Sun, Zhaole Sun, and David Wren. Look here for information about applying to study for a PhD or MSc in Informatics at Edinburgh. The School is recruiting PhD students (mainly UK) into their EPSRC Centre for Doctoral Training in Robotics and Autonomous Systems. Internships, Visitors, Jobs and PhD Places PhD places: I have no places. See other computer vision and robotics colleagues in the Institute of Perception, Action and Behaviour. Jobs: no vision jobs are open at the moment Internships: I have no places. See other computer vision and robotics colleagues in the Institute of Perception, Action and Behaviour. Visitors: If you have a fellowship paying your own salary plus visitor fees, then we may have room for visiting scientists. Main administrative responsibilities None at the moment Main teaching responsibilities None at the moment Popular image analysis datasets/databases BEHAVE - Interacting Person Video Data with markup CAVIAR - video sequences with tracking and behavior ground truth CEILIDHDATA - video data and ground truth for 16 Ceilidh with two different dance patterns DERMOFIT - 1300 images of 10 types of skin lesion (5 malignant) FACECHANGE - frontal images of faces captured several times a day for several months FORUMTRACKING - overhead camera person tracking dataset EATSENSE - eating action HIPR2 Image Catalogue - a small dataset of different types of images HUMOLS - 101 videos capturing a single human subject in a motionless state OFFICEDATA - 20 days of monitoring a person in their office PIGDATA - 23 days (over 6 weeks) of daytime pig RGBD video captured from a nearly overhead camera SURGICALTOOLS - RGBD images of five simulated surgical tools (two kinds of scalpels, two kinds of clamps, and one tweezers), synthetic and real images, total 64,728 images Time-Lapse Videos of a Building Site UTENSILS - 897 raw and binary images of 20 categories of kitchen utensil WeightGait - multi-factorial dataset for simulated gait abnormality detection and assessment Research community contributions CVonline, The Evolving, Distributed, Non-Proprietary, On-Line Compendium of Computer Vision, including its listing of computer vision datasets, software, image analysis applications, and books. The current version of HIPR2: Hypertext Image Processing Reference. The support web site for the second edition of the Dictionary of Computer Vision and Image Processing. He was the Chair (2007-2010) of the Education Committee of the International Association for Pattern Recognition, which has produced online education resources. Later, he was the Chair (2016-2020) of the IAPR's Industrial Liaison Committee, and then the IAPR Treasurer (2020-2024). Currently, he is IAPR President (2024-2026). He has been elected an IAPR Fellow. He has organized a series of workshops on Visual observation and analysis of Vertebrate And Insect Behavior (2008-2024). Some thoughts on AI / Artificial Intelligence: R. B. Fisher, AI and Cinema - Does artificial insanity rule?, unpublished, 2002. R. B. Fisher, Is your robot afraid of dying (and why you should care)?, unpublished, 2017. R. B. Fisher et al, Evidence contribution to the UK House of Lords inquiry on Artificial Intelligence, 2017. Other things that might interest you A study on the Representations of Artificial Intelligence in Cinema An online Dictionary of Computer Graphics A short video children's video (Ani's Year in the Garden), featuring the robot developed in the TrimBot2020 project. All Thanks to Turing - a robot gives thanks to Alan Turing (video) as part of Take Tea With Turing, a celebration by Victoria Adams. My favourite MP3 mashup - Bob Rocks! (by James Fairlie). My professorial inaugural lecture (2003). A short video (10 min) by Meirul Din, on \"How seriously should we take the hype about AI?\", which includes an interview of me. (185Mb) The University now has a set of 500+ one minute research-in-a-nutshell videos and mine (about the Chiroping project) is here. Some suggestions on introducing talks. You might also be interested in: PowerPoint Is Evil Do you worry that you might be an Academic Imposter? You are not alone! We're surrounded by hugely talented people and we only know a little bit more about one specialized topic. Except that everyone feels this way. See: Imposter Syndrome in Academia, Impostor syndrome. Spanish translation of biography (Science for Everyone) Some interesting recent undergraduate and MSc theses: J. Aizeboje, Ceilidh dance recognition from an overhead camera, MSc dissertation, 2016. L. Alkurdi,\tFuzzy Control of a Robotic Blimp, MSc dissertation, 2011. T. Anthoni;Recognition and Location of Ugaritic Character Stylus Strokes from Clay Tabley Images, MSc dissertation, 1994. P. Baron; Evolutionary Shape Optimisation Using a Voxel Based Representation, MSc dissertation, 1997. part 1 and part 2. C. Cobzarenco, Quantifying Skin Lesion Change over a Short Period, Undergraduate dissertation, 2013. T. Collins; The Deformable Disparity Model for Semi-Dense 3D Scene Reconstruction, MSc dissertation, 2005. part 1 and part 2. L. Danev, Fruit and vegetable classification from live video, Undergraduate dissertation, 2017. A. Ferguson, Automated Classification of Fish Species from CCTV Footage, MSc dissertation, 2014. P. Green, Investigation into the use of surf web cameras to improve the accuracy of forecasting wave behavior, Undergraduate dissertation, 2017. B. Majecka, Statistical models of pedestrian behaviour in the Forum, MSc dissertation, 2009. S. McDonagh, Skin Cancer Surface Shape Based Classification, Undergraduate dissertation, 2008. C. A. Morrison; Trinocular Stereo 3D Parts Location, MSc dissertation, 1989. G. Papadimitriou, Psychophysics of Autostereogram Videos: Blur, Contrast and Repetition Period, MSc dissertation, 2010. G. Petkov, Tracking and annotating a chess game, Undergraduate dissertation, 2013. J. L. Reyes Ortiz, Probabilistic Time Lapse Video, MSc dissertation, 2008. P. Satlawa, Detecting the necessity of thinnings with deep learning, MSc dissertation, 2021. C. Shotton, The Spam Companion: An Investigation Into Counter Spam Measures, Undergraduate dissertation, 2012. C. Tarlungianu, Detection of Road Gully Drains, Undergraduate dissertation, 2015. J. O. N. Woodward; Change Direction in MRI Brain Scan Data, MSc dissertation, 1990. part 1, part 2. Other legacy undergraduate and MSc dissertations not already included in the more recent School database Other people you might want to contact over specific issues Informatics Secretary Inst. of Perception, Action and Behaviour Secretary Contact Details School of Informatics University of Edinburgh 1.11 Bayes Centre 47 Potterrow Edinburgh EH8 9BT UK TEL: 44-131-651-3441 plus code: WRW7+54 Email: Here is a map to my office in the Bayes Centre. Enter via the main entrance in the courtyard off of Crichton Street. Go up the stairs/elevator 1 floor. My office is 1.11. Here is a Google map link with a streetside view. Locations of my site visitors:",
  "content_length": 9360,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:33"
}