{
  "name": "Bob Williamson",
  "homepage": "https://uni-tuebingen.de/en/197812",
  "status": "success",
  "content": "Foundations of Machine Learning Systems | University of Tübingen Prof. Dr. Robert C. Williamson W3-Professor for \"Foundations of Machine Learning Systems\" at the Eberhard Karls University Tübingen, Faculty of Mathematics and Natural Sciences Research Interests Bob Williamson is interested in understanding and designing machine learning systems as a whole. To that end he is pursuing theoretical questions regarding machine learning problems and how they relate to each other, including information theoretic limits of performance; the connections between information theory and societal challenges in machine learning (such as fairness); as well as developing new approaches to the overall architecture of machine learning systems that support trustworthiness and reliability in their use. The Key Notions of Foundations of Machine Learning Systems: 1. Atoms of ML regarding the relationship between information and utility. 2. Data as process. 3. Context of data in ML. 4. Models of Uncertainty, how they are represented and the implication of different choices. 5. Rhetoric of ML and how it can be shaped to deal with all the points listed above. 6. Relations between ML problems to better illustrate the nature of ML problems. 7. Tradeoffs, especially between the notions of utility and ethics. Further Information For further information visit Bob Williamson's website. About Bob is a fellow of the Australian Academy of Science and the Australian Mathematical Society. He has served on program committees for the major machine learning conferences (NeuriPS, COLT, ICML). In 2020, he is co-chair for tutorials at NeurIPS.  He was the lead author on the report Technology and Australia’s Future: New technologies and their role in our security, cultural, democratic, social and economic systems, conducted through the auspices of the Australian Council of Learned Academies. Prof. Dr. Robert C. Williamson Foundations of Machine Learning Systems University of Tübingen Cluster of Excellence \"Machine Learning\" Maria-von-Linden-Str. 6, 3rd floor Room No. 30-31/A4 72076 Tübingen +49 7071 29-70793 bob.williamsonspam prevention@uni-tuebingen.de Office: Charlotte Wenner +49 7071 29-70791 fmlsspam prevention@inf.uni-tuebingen.de",
  "content_length": 2231,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:33"
}