{
  "name": "Bob Edmison",
  "homepage": "http://people.cs.vt.edu/~kedmison",
  "status": "success",
  "content": "Bob Edmison Search Bob Edmison Collegiate Associate Professor of Computer Science Virginia Tech Biography I’m Bob Edmison, and I am a Collegiate Associate Professor in the Department of Computer Science at Virginia Tech. My research interests center on developing new ways to provide feedback to computer science students, using tools and techniques originally developed for software engineering. I am also the Coordinator of Online Teaching and Learning in the Department of Computer Science Previously, I was the Director of Software Development for Technology-enhanced Learning and Online Strategies, TLOS, in the Division of Information Technology at Virginia Tech. I’ve also done extensive work in industry and not-for-profits, as well as research for the U.S. Department of Energy in the areas of materials management, experimental simulation and visualization, and nuclear non-proliferation. Interests Computer Science Education Contextualized Feedback Learning Analytics Alternative Grading Strategies Accessibility Education PhD in Computer Science and Applications, 2019 Virginia Tech M.IT in Information Technology, 2006 Virginia Tech M.A.Ed. in Curriculum and Instruction, 1995 Virginia Tech B.A. in Economics, 1992 Virginia Tech Recent & Upcoming Talks Panel Discussion: Keeping Students Engaged Through Change No matter what the world has in store next, educators need the best tools and tactics for holding students' attention. In this panel discussion, higher education leaders discuss ways to create a more engaging student experience. Learn how to maintain consistency in the classroom through times of transition—whether you’re online, hybrid, or in-person—and empower your institution with data that can help drive better decisions. 06 May 2021 11:40 AM EDT -0400 Virtual Bob Edmison InstructureCon 2020: Find Out How Your Instructors Are *Really* Using Canvas: We Can Show You! We have figured out a data-driven way to measure how deeply instructors are using Canvas, beyond just published course counts or numbers of instructors. Knowing this, we can help instructors make better use of the tools available in Canvas and focus our support efforts. 15 Oct 2020 12:20 PM EDT -0400 Virtual Bob Edmison, Taha Hassan, Brian Broniak Recent Publications Quickly discover relevant content by filtering publications. Learning to Trust: Understanding Editorial Authority and Trust in Recommender Systems for Education Hassan, Taha, Edmison, Bob, Stelter, Timothy, McCrickard, D. Scott DOI Turn up the Heat!: Using Heat Maps to Visualize Suspicious Code to Help Students Successfully Complete Programming Problems Faster Edmison, Bob, Edwards, Stephen H. DOI Depth of Use: An Empirical Framework to Help Faculty Gauge the Relative Impact of Learning Management System Tools Hassan, Taha, Edmison, Bob, Cox, Larry, Louvet, Matt, Williams, Daron, McCrickard, D. Scott DOI Exploring the Context of Course Rankings on Online Academic Forums Hassan, Taha, Edmison, Bob, Cox, Larry A., Louvet, Matthew, Williams, Daron DOI Experiences Using Heat Maps to Help Students Find Their Bugs: Problems and Solutions Edmison, Bob, Edwards, Stephen H. DOI See all publications Courses Taught CS 5040 Intermediate Data Structures and Algorithms Analysis Fall 2020, Spring 2021 CS 5744 Software Design and Quality Fall 2020, Spring 2021 CS 3114 Intermediate Data Structures and Algorithms Spring 2020, Spring 2019 CS 3704 Intermediate Software Design and Engineering Fall 2016, Spring 2017, Fall 2017, Fall 2018 CS 4704 Software Engineering Capstone Spring 2018, Fall 2019 Experience Collegiate Assistant Professor Virginia Tech Department of Computer Science Aug 2020 – Present Blacksburg, VA Director of Software Development Virginia Tech Technology-enhanced Learning and Online Strategies (TLOS) Sep 2014 – Aug 2020 Blacksburg, VA Managed the team responsible for developing and integrating our enterprise learning systems portfolio, including Canvas, Kaltura, and Zoom. Senior Research Associate Virginia Tech Software Technologies Laboratory Oct 2001 – Sep 2014 Blacksburg, VA Led a variety of software engineering research projects for industry, state and federal government sponsors. Our research portfolio exceeded $1.5M per year. Web Application Engineer Interactive Design and Development Aug 1999 – Sep 2001 Blacksburg, VA Developed web applications and point-of-presence sites for industry and government customers. Web Application Engineer VTLS, Inc Aug 1997 – Aug 1999 Blacksburg, VA Developed and supported first commercial web-based online patron access catalog for libraries Contact Name Email Message Send +1 (540) 231-3957 2220F Torgersen Hall, Blacksburg, VA 24061 Zoom LinkedIn Google Scholar Github code.vt.edu Cite × Copy Download",
  "content_length": 4746,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:33"
}