{
  "name": "Bobak J. Mortazavi",
  "homepage": "http://faculty.cse.tamu.edu/bobakm",
  "status": "success",
  "content": "Jack Bobak Mortazavi, Ph.D. Bio Research Publications Teaching Misc. About Me - Ph.D. Computer Science I am an Assistant Professor in Computer Science & Engineering at Texas A&M University, and a member of the Center for Remote Health Technologies & Systems. I currently have several openings with my group for highly motivated and driven students in all areas of our group's research including: clinical outcomes research, machine learning, embedded systems design, and internet of things research, to name a few! If you are interested in joining the team, please read through this page Prior to joining Texas A&M, I was a postdoctoral associate under the supervision of Prof. Harlan Krumholz at the Center for Outcomes Research and Evaluation (CORE) and Prof. Sahand Negahban of the Department of Statistics. I worked as a graduate student (and earned my Ph.D.) in Computer Science under the supervision of Prof. Majid Sarrafzadeh at the University of California Los Angeles (UCLA) Wireless Health Institute (2014). I earned a B.A. in Applied Mathematics and a B.S. in Electrical Engineering and Computer Science from the Univeristy of California Berkeley (2007). My research interests include end-to-end research on medical embedded systems and the application of data mining and machine learning algorithms necessary to make personalized, preventative medical treatments possible through advanced health analytics . My background is in embedded systems design, where I studied sensor fusion, reconfigurable architectures and systems, hardware accelerators, and gpu computing. During my Ph.D. I applied data mining and machine learning techniques to these systems to develop a personalized, exercise-level activity-recognition video game with wearable sensors. I am now primarily concerned with the ability to use supervised and unsupervised techniques to learn more about medical prediction and risk-stratification in order to better develop personalized medical systems, prediction models, comparative effectiveness techniques, and combine wearable sensors and other necessary data to make a clinical impact at the system level, provider level, and patient level. My office: 328A HRBB College Station, TX 06510 Office: (979) 458-2642 Back to top Research Currently, my interdisciplinary work involves bridging of computer science with the medical research realm, particularly in Patient-Centered Outcomes Research. For example, I have worked on projects ranging from Personalized Activity Recognition for exergaming, exercise repetition, rehabilitation and nutrition monitoring (while at UCLA) to Remote Monitoring and Clinical prediction in clinical settings using Clinical Trial Data, Clinical Registry Data, and Clinical Electronic Health Record Data (while at Yale). These projects investigate system design, user adherence and cheating, risk prediction, comparative effectiveness, and a deeper understanding and evaluation of clinical questions and challenges at a patient-centered outcomes focus. To detailed description of research projects Back to top Publications Journals [j13] Mortazavi, B., Downing, N., Bucholz, E., Dharmarajan, K., Manhapra, A., Li, S., Negahban, S., Krumholz, H. (2015) Analysis of Machine Learning Techniques for Heart Failure Readmissions. Circulation: Cardiovascular Quality and Outcomes (Accepted - In Press) [link] [pdf] [j12] Hunter, D., Torkelson, J., Bodnar, J., Mortazavi, B., Laurent, T., Deason, J., Thephavongsa, K., Zhong, J. (2015) The Rickettsia Endosymbiont of Ixodes Pacificus Contains All Genes of De Novo Folate Biosynthesis. PLOS One (Accepted - In Press) [link] [pdf] [j11] Mortazavi, B., Pourhomayoun, M., Lee, S.I., Nyamathi, S., Wu, B., Sarrafzadeh, M. (2015) User-Optimized Activity Recognition for Exergaming. Elsevier Journal of Pervasive and Mobile Computing (Accepted - In Press) [link] [pdf] [j10] Lee, S.I., Park, E., Huang, A., Mortazavi, B., Garst, J.H., Espinal, M., Siero, T., Pollack, S., Afridi, M., Daneshvar, M., Ghias, S., Lu, D.C., Sarrafzadeh, M. (2015) Objectively Quantifying Walking Ability in Degenerative Spinal Disorder Patients using Sensor Equipped Smart Shoes. Medical Engineering & Physics (Med Eng Phys) (Under Review - Second Revision) [link] [pdf] [j9] Lee, S.I., Li, C., Hoffman, H., Lu, D., Getachew, R., Mortazavi, B., Garst, J., Espinal, M, Razaghy, Ghalehsari, N., Paak, B., Chavam, A., Afridi, M., Ostowari, A., Ghasemzadeh, H., Lu, D., Sarrafzadeh, M. (2014) Quantitative Assessment of Hand Motor Function in Cervical Spinal Disorder Patients Using Target Tracking Tests. Journal of Rehabilitation Research and Development (J-RRD) (Accepted - In Press) [link] [pdf] [j8] Kalantarian, H., Alshuarafa, N., Sideris, C., Le, T., Mortazavi, B., Sarrafzadeh, M. (2015) A Comparison of Piezoelectric-Based Inertial Sensing and Audio-Based Detection of Swallows. Elsivier Journal of Pervasive and Mobile Computing (Under Review) [link] [pdf] [j7] Mortazavi, B., Nemati, E., VanderWall, K., Flores-Rodriguez, H., Cai, J., Lucier, J., Naeim, A., Sarrafzadeh, M. (2015) Can Smartwatches Replace Smartphones for Posture Tracking? Sensors vol. 15, no. 10, pp. 26783-26800 [link] [pdf] [j6] Woodbridge, J., Mortazavi, B., Bui, A.A.T., Sarrafzadeh, M. (2015) Improving Biomedical Signal Search Results in Big Data Case-Based Reasoning Environments. Elsevier Journal of Pervasive and Mobile Computing (Accepted - In Press) [link] [pdf] [j5] Lee, S.I., Mortazavi, B., Hoffman, H., Lu, D., Paak, B., Garst, J., Razaghy, M., Lu, D., Sarrafzadeh, M. (2014) A Prediction Model for Functional Outcomes in Spinal Cord Injured Patients Using Gaussian Process Regression. IEEE Journal of Biomedical and Health Informatics (J-BHI) (Accepted - In Press) [link] [pdf] [j4] Mortazavi, B., Pourhomayoun, M., Ghasemzadeh, H., Jafari, R., Roberts, C.K., Sarrafzadeh, M. (2014) Context-Aware Data Processing to Enhance Quality Measurements in Wireless Health Systems: An Application to MET Calculation of Exergaming Actions. IEEE Internet of Things Journal (J-IOT) vol. 2, no. 1, pp. 84-93 [link] [pdf] [j3] Alshurafa, N., Xu, W., Liu, J., Huang, M.C., Mortazavi, B., Roberts, C.K., Sarrafzadeh, M. (2013) Designing a Robust Activity Recognition Framework for Health and Exergaming using Wearable Sensors. IEEE Journal of Biomedical and Health Informatics (J-BHI) vol. 18, no. 5., pp 1636-1646 [link] [pdf] [j2] Mortazavi, B., Nyamathy, S., Lee, S.I., Wilkerson, T., Ghasemzadeh, H., Sarrafzadeh, M. (2014) Near-Realistic Mobile Exergames with Wireless Wearable Sensors. IEEE Journal of Biomedical and Health Informatics (J-BHI) vol. 18, no. 2, pp. 449-456 (March Feature Article) [link] [pdf] [j1] Lee, S.I., Ghasemzadeh, H., Mortazavi, B., Sarrafzadeh, M. (2013) Pervasive Assiessment of Motor Function: A Lightweight Grip Strength Tracking System. IEEE Journal of Biomedical and Health Informatics (J-BHI) vol. 17, no. 6, pp. 1023-1030 [link] [pdf] Conferences [c19] Pourhomayoun, M., Nemati, E., Mortazavi, B., Sarrafzadeh, M. (2015) Context-Aware Data Analytics for Activity Recognition. In Proceedings of the Fourth International Conference on Data Analytics (DATA ANALYTICS 2015) (Accepted - In Press) [link] [pdf] (Best Paper Award) [c18] Alinia, P., Saeedi, R, Mortazavi, B., Ghasemzadeh, H. (2015) Impact of Sensor Misplacement on Estimating Metabolic Equivalent of Task with Wearables. In Proceedings of the 2015 IEEE Conference on Wearable and Implantable Body Sensor Networks (BSN 2015) (Accepted - In Press) [link] [pdf] [c17] Mortazavi, B., Pourhomayou, M., Nyamathi, S., Wu, B., Lee, S.I., Sarrafzadeh, M. (2015) Multiple Model Recognition for Near-Realistic Exergaming. In Proceedings of the 2015 IEEE Interantional Conference on Pervasive Computing and Communication (PerCom) St. Louis, Mo., Mar. 2015. [link] [pdf] [c16] Mortazavi, B., Pourhomayoun, M., Alshurafa, N., Chronley, M., Lee, S.I., Roberts, C.K., Sarrafzadeh, M. (2014) Support Vector Regression for Estimating the Metabolic Equivalent of Task of Exergaming Actions. In Proceedings the Conference on Healthcare Innovations and Point-of-Care Technologies. (HIC) Seattle, Wa., Oct. 2014. [link] [pdf] [c15] Pourhomayoun, M., Alshurafa, N., Mortazavi, B., Ghasemzadeh, H., Sarrafzadeh, M. (2014) Multiple Model Analytics for Adverse Event Prediction in Remote Health Monitoring Systems. In Proceedings of the Conference on Healthcare Innovations and Point-of-Care Technologies. (HIC) Seattle, Wa., Oct. 2014 [link] [pdf] [c14] Mortazavi, B., Lee, S.I., Sarrafzadeh, M. (2014) User-Centric Exergaming with Fine-Grain Activity Recognition: A Dynamic Optimization Approach. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (Ubicomp ’14 Adjunct) Seattle, Wa., Sept. 2014, pp. 1233-1240 [link] [pdf] [c13] Mortazavi, B., Pourhomayoun, M., Alsheikh, G., Alshurafa, N., Lee, S.I., Sarafzadeh, M. (2014) Determining the Single Best Axis for Exercise Repetition Recognition and Counting in SmartWatches. In Proceedings of the 11th IEEE International Conference on Wearable and Implantable Body Sensor Networks (BSN 2014) Zurich, Switzerland, June 2014 [link] [pdf] [c12] Alshurafa, N., Pourhomayoun, M., Nyamathi, S., Bao, L., Mortazavi, B., Eastwood, J., Sarrafzadeh, M. (2014) Anti-Cheating: Detecting Self-Inflicted and Impersonator Cheaters for Remote Health Monitoring Systems with Wearable Sensors. In Proceedings of the 11th IEEE International Conference on Wearable and Implantable Body Sensor Networks (BSN 2014) Zurich, Switzerland, June 2014 [link] [pdf] [c11] Lee, S.I., Ghasemzadeh, H., Mortazavi, B., Lan, M., Ong, M., Sarrafzadeh, M. (2013) Remote Monitoring Systems: What Impact Can Data Analytics Have on Cost? In Proceedings of Wireless Health 2013(WH 13) Baltimore, MD, Oct. 2013. pp 4:1-4:8 [link] [pdf] [c10] Mortazavi, B., Alsharufa, N., Lee, S.I., Lan, M., Chronley, M., Roberts, C.K., Sarrafzadeh, M. (2013) MET Calculations from On-Body Accelerometers for Exergaming",
  "content_length": 23019,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:36"
}