{
  "name": "Bodo Rosenhahn",
  "homepage": "http://www.tnt.uni-hannover.de/staff/rosenhahn",
  "status": "success",
  "content": "Institut für Informationsverarbeitung (TNT) - Homepage of Bodo Rosenhahn Prof. Dr.-Ing. Bodo RosenhahnLeibniz Universität HannoverInstitut für Informationsverarbeitung Appelstr. 9A 30167 Hannover Germany phone: +49 511 762-5316fax: +49 511 762-5333office location: room 1323 Bodo Rosenhahn studied Computer Science (minor subject Medicine) at the University of Kiel. He received the Dipl.-Inf. and Dr.-Ing. degrees from the University of Kiel in 1999 and 2003, respectively. From 10/2003 till 10/2005, he worked as post doc at the University of Auckland (New Zealand), funded with a scholarship from the German Research Foundation (DFG). In 11/2005-08/2008 he worked as senior researcher at the Max-Planck Insitute for Informatics in Saarbruecken. Since 09/2008 he is Full Professor at the Leibniz University Hannover, heading a group on automated image interpretation. His works received several awards, including a DAGM-Prize 2002, the Dr.-Ing. Siegfried Werth Prize 2003, the DAGM-Main Prize 2005, the IVCNZ best student paper award, the DAGM-Main Prize 2007, the Olympus-Prize 2007, the ICPRAM Best student paper award 2014, the ICMC Best student paper award 2014, the WACV 2015 Challenge Award, the Günter Enderle Award (Eurographics) 2017, the CVPR 2017 Multi-Object Tracking Challenge, a special price for the Road Damage Detection Challenge at the IEEE BigData conference 2018, the TÜV-Süd Innovation award 2018, a AIIDE Best Student Paper Award 2020, a PhysRev-A Editors Suggestion in 2023 and participated in the ICCV-25 challenge on Multi-Target Tracking (2nd place). In 2011, the European Commission awarded Bodo Rosenhahn with a EUR 1.43 million ERC-Starting Grant and in 2013 with a POC Grant. In 2019, Bodo Rosenhahn received an Erskine Fellowship for a longer research stay at the University of Canterbury. Since 2023 he is associate editor of the journal IEEE TPami, the highest ranked journal in computer science. He is head coach of the LUH AI competition team, published more than 400 research papers, journal articles and book chapters, holds more than 10 patents and edited several books. His current citations are available at google scholar. We have profound knowledge in Computer Vision, Machine Learning or Big Data Analysis and  experience in the successful transfer to industry. We offer basic and advance training as well as consulting services and are open to any industry related challenges. Please don't hesitate to contact us. Cooperations: Projects Multiple People Tracking Relational Object Tracking Physics-based modeling Video-based Motion Capture Semantic Scene Analysis AI Competition GreenAutoML4FAS Quantum Learning Reinforcement Learning Anomaly Detection Motion Capture Pose Tracking and Motion Capture Test Sequences Multimodal Motion Capture Indoor Dataset (MPI08) Multimodal Motion Capture Dataset (TNT15) Recent Publications Thomas Norrenbrock, Timo Kaiser, Sovan Biswas, Neslihan Kose, Ramesh Manuvinakurike, Bodo RosenhahnCHiQPM: Calibrated Hierarchical Interpretable Image Classification The Thirty-ninth Annual Conference on Neural Information Processing Systems (NeurIPS), San Diego, USA, December 2025(pdfCode, Link) BibTeX Patrick Glandorf, Rosenhahn BodoPruning by Block Benefit: Exploring the Properties of Vision Transformer Blocks during Domain Adaptation International Conference on Computer Vision Workshops (ICCVW), October 2025(arXiv.org) BibTeX Bodo Rosenhahn, Tobias Osborne, Christoph HircheOptimization driven quantum circuit reduction New Journal of Physics, IOP Publishing Ltd, p. 17, October 2025(DOI, arXiv.org) BibTeX Selected PublicationsShow all publicationsConference Contributions Timo Kaiser, Thomas Norrenbrock, Bodo RosenhahnUncertainSAM: Fast and Efficient Uncertainty Quantification of the Segment Anything Model Forty-second International Conference on Machine Learning (ICML), PLMR, Vancouver, July 2025(pdf, pdfGitHub, arXiv.org) BibTeX Thomas Norrenbrock, Timo Kaiser, Sovan Biswas, Ramesh Manuvinakurike, Bodo RosenhahnQPM: Discrete Optimization for Globally Interpretable Image Classification The Thirteenth International Conference on Learning Representations (ICLR), April 2025(PDF, Link, GitHub) BibTeX Maximilian Schier, Frederik Schubert, Bodo RosenhahnExplainable Reinforcement Learning via Dynamic Mixture Policies 2025 IEEE International Conference on Robotics and Automation (ICRA), IEEE, p. To be published, 2025(pdfGitHub) BibTeX Yannik Mahlau, Frederik Schubert, Bodo RosenhahnMastering Zero-Shot Interactions in Cooperative and Competitive Simultaneous Games Proceedings of the 41st International Conference on Machine Learning (ICML), July 2024(arXiv.org) BibTeX Florian Kluger, Bodo RosenhahnPARSAC: Accelerating Robust Multi-Model Fitting with Parallel Sample Consensus AAAI, February 2024(arXiv.org) BibTeX Thomas Norrenbrock, Marco Rudolph, Bodo RosenhahnQ-SENN: Quantized Self-Explaining Neural Networks AAAI Technical Track on Safe, Robust and Responsible AI, AAAI Press, Vol. 38, No. 19, pp. 21482--21491, Vancouver, Canada, February 2024, edited by Michael J. Wooldridge and Jennifer G. Dy and Sriraam Natarajan(pdf) BibTeX Yuren Cong, Mengmeng Xu, Christian Simon, Shoufa Chen, Jiawei Ren, Yanping Xie, Juan-Manuel Perez-Rua, Bodo Rosenhahn, Tao Xiang, Sen HeFLATTEN: optical FLow-guided ATTENtion for consistent text-to-video editing International Conference on Learning Representations (ICLR) , 2024(arXiv, Webpage) BibTeX Maximilian Schier, Christoph Reinders, Bodo RosenhahnDeep Reinforcement Learning for Autonomous Driving Using High-Level Heterogeneous Graph Representations 2023 IEEE International Conference on Robotics and Automation (ICRA), IEEE, pp. 7147-7153, 2023(pdfGithub, Final Paper) BibTeX Bodo RosenhahnMixed Integer Linear Programming for Optimizing a Hopfield Network European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases (ECML-PKDD), Springer Nature, No. 5, p. 344–360, September 2022(pdfDOI) BibTeX Duy Nguyen, Roberto Henschel, Bodo Rosenhahn, Daniel Sonntag, Paul SwobodaLMGP: Lifted Multicut Meets Geometry Projections for Multi-Camera Multi-Object Tracking Computer Vision and Pattern Recognition (CVPR), IEEE, pp. 1-10, New Orleans, June 2022(pdfIEEEexplore, arXiv.org, GitHub) BibTeX Kaiqin Hu, Wentong Liao, Michael Yang, Bodo RosenhahnText to Image Generation with Semantic-Spatial Aware GAN IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), IEEE, pp. 18166-18175, June 2022(GitHub, arXiv.org, IEEEexplore) BibTeX Christoph Reinders, Frederik Schubert, Bodo RosenhahnChimeraMix: Image Classification on Small Datasets via Masked Feature Mixing Proceedings of the Thirty-First International Joint Conference on Artificial Intelligence (IJCAI), 2022(arXiv.org, GitHub) BibTeX Tom Wehrbein, Marco Rudolph, Bodo Rosenhahn, Bastian WandtProbabilistic Monocular 3D Human Pose Estimation with Normalizing Flows International Conference on Computer Vision (ICCV), IEEE, October 2021(pdfarXiv.org, GitHub) BibTeX Andrea Hornakova*, Timo Kaiser*, Michal Rolinek, Bodo Rosenhahn, Paul Swoboda, Roberto Henschel, (* equal contribution)Making Higher Order MOT Scalable: An Efficient Approximate Solver for Lifted Disjoint Paths International Conference on Computer Vision (ICCV), IEEE, October 2021(pdf, pdfarXiv.org) BibTeX Yuren Cong, Wentong Liao, Hanno Ackermann, Michael Yang Yang, Bodo RosenhahnSpatial-Temporal Transformer for Dynamic Scene Graph Generation International Conference on Computer Vision (ICCV), July 2021(arXiv.org) BibTeX Sen He, Wentong Liao, Michael Ying Yang, Yongxin Yang, Yi-Zhe Song, Bodo Rosenhahn, Tao XiangContext-Aware Layout to Image Generation with Enhanced Object Appearance IEEE Conference on Computer Vision and Pattern Recognition, June 2021(pdf) BibTeX Florian Kluger, Hanno Ackermann, Eric Brachmann, Michael Ying Yang, Bodo RosenhahnCuboids Revisited: Learning Robust 3D Shape Fitting to Single RGB Images CVPR, June 2021(arXiv.org) BibTeX Bastian Wandt, Marco Rudolph, Petrissa Zell, Helge Rhodin, Bodo RosenhahnCanonPose: Self-Supervised Monocular 3D Human Pose Estimation in the Wild Computer Vision and Pattern Recognition (CVPR), IEEE, Virtual, June 2021(pdfarXiv.org, GitHub, YouTube) BibTeX Petrissa Zell, Bodo Rosenhahn, Bastian WandtWeakly-supervised Learning of Human Dynamics European Conference on Computer Vision (ECCV), August 2020(arXiv.org, data) BibTeX Yuren Cong, Hanno Ackermann, Wentong Liao, Michael Ying Yang, Bodo RosenhahnNODIS: Neural Ordinary Differential Scene Understanding European Conference on Computer Vision (ECCV), August 2020(arXiv.org) BibTeX Andrea Hornakova*, Roberto Henschel*, Bodo Rosenhahn, Paul Swoboda, (* equal contribution)Lifted Disjoint Paths with Application in Multiple Object Tracking Proceedings of the 37th International Conference on Machine Learning (ICML), July 2020(pdf, pdfVisual Results, Code, Video Presentation) BibTeX Florian Kluger, Eric Brachmann, Hanno Ackermann, Carsten Rother, Michael Ying Yang, Bodo RosenhahnCONSAC: Robust Multi-Model Fitting by Conditional Sample Consensus Computer Vision and Pattern Recognition (CVPR), Seattle, WA, USA, June 2020(arXiv.org) BibTeX Bastian Wandt, Bodo RosenhahnRepNet: Weakly Supervised Training of an Adversarial Reprojection Network for 3D Human Pose Estimation Computer Vision and Pattern Recognition (CVPR), IEEE, June 2019(pdfGitHub, arXiv.org) BibTeX Timo von Marcard, Roberto Henschel, Michael J. Black, Bodo Rosenhahn, Gerard Pons-MollRecovering Accurate 3D Human Pose in The Wild Using IMUs and a Moving Camera European Conference on Computer Vision, September 2018(pdf) BibTeX Eduardo Pérez-Pellitero, Jordi Salvador, Javier Ruiz-Hidalgo, Bodo RosenhahnManifold Span Reduction for Super Resolution IEEE Conference on Computer Vision and Pattern Recognition (CVPR). , Las Vegas, June 2016 BibTeX Andrey Bushnevskiy, Lorenzo Sorgi, Bodo RosenhahnMulticamera Calibration from Visible and Mirrored Epipoles IEEE Conference on Computer Vision and ",
  "content_length": 22267,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:38"
}