{
  "name": "Bogdan Vasilescu",
  "homepage": "http://bvasiles.github.io",
  "status": "success",
  "content": "Bogdan Vasilescu's homepage Bogdan Vasilescu Computer Scientist, Associate Professor at CMU Contact TCS Hall 326 (412) 268-1048 Email Twitter GitHub Google Scholar DBLP STRUDEL lab Admin: Dabney Schlea TCS Hall 430 (412) 268-6032 Email Hi there! I’m an Associate Professor in CMU’s School of Computer Science and a member of the Software and Societal Systems Department. My students and I form the Socio-Technical Research Using Data Excavation Lab (STRUDEL). I’m most active in the software engineering research community, where I have co-chaired the MSR 2023 PC, have been serving on program committees for the major software engineering venues (including ICSE, ESEC/FSE, and ASE; thanks for the Distinguished Reviewer Award at ASE 2018 and ESEC/FSE 2021!), and am an Associate Editor for the ACM Transactions on Software Engineering and Methodology, among others. On the internets I’m sometimes referred to as a “prominent female professor from a gender studies department, that no one ever audits and that gets to peer review herself“. I also suffer from cognitive dissonance as a scientist who uses LaTeX. Prospective Students If you’re a motivated student looking for a PhD position, check out the Software Engineering and Societal Computing programs at CMU, which most of my current students are part of. Applications are due early/mid December. Please feel free to reach out to me before applying, to introduce yourself and describe your research interests. Note: I don’t always have capacity to take on new students or funding to support them, but don’t let that preclude you from reaching out! Research Experiences for Undergraduates My favorite time of the year is summer, partly because that’s when Pittsburgh stops being a top-5 Gloomiest Place in America for a few days, but mostly because of the Research Experiences for Undergraduates in Software Engineering (REUSE) Program. If you’re an undergraduate student (and preferably also a U.S. citizen, national, or permanent resident, because of how some of the funding for the program works) interested in summer research in interdisciplinary software engineering, please consider applying! It’s okay if you’re a first- or second-year, or if you don’t have prior research experience or advanced coursework in computer science or software engineering. Former REU students in the STRUDEL lab have generally had a good experience, published papers, won awards, and went on to graduate schools or to do other amazing things. Brief Bio Prior to joining CMU, I was a postdoc in the Davis Eclectic Computational Analytics Lab (DECAL) at UC Davis, where I worked with Vladimir Filkov and Prem Devanbu. I obtained my PhD in Computer Science cum laude (and cum tuxedo) at Eindhoven University of Technology, The Netherlands, in October 2014, under the supervision of Alexander Serebrenik and Mark van den Brand. My PhD work won the Best Dissertation Award from the Institute for Programming Research and Algorithmics. I also hold a master’s degree in Computer Science and Engineering from Eindhoven University of Technology (thesis advisor: Alexander Serebrenik) and an engineer’s degree in Systems and Computer Science from Romania (webpage in Romanian; thesis advisor: Gabriel Rădulescu). See my CV for details.",
  "content_length": 3266,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:39"
}