{
  "name": "Bogdan S. Chlebus",
  "homepage": "https://www.augusta.edu/faculty/directory/view.php?id=BCHLEBUS",
  "status": "success",
  "content": "Bogdan Chlebus - Faculty Profile Home Faculty Directory Profile Update Your Profile Directory FAQs PACT Login Give Feedback Bogdan Chlebus Professor Bogdan Chlebus Professor Academic Appointment(s)AdministrationDepartment of Computer ScienceSchool of Computer and Cyber SciencesDepartment of Computer ScienceAdministrationDepartment of The Graduate School BioBogdan Chlebus was born in Poland. His graduated with the doctoral degree from the University of Warsaw. Previously affiliated with the University of Warsaw, Poland, and the University of Colorado Denver. Joined Augusta University in 2019. bchlebus@augusta.edu Energy Plant (CE) General Credentials Instruction Scholarship Service Education Ph.D., Computer Science Warsaw University, 1983 Courses Taught Most Recent Academic Year CSCI 7100 Algorithm Analysis CSCI 2700 Ethics in Computer Science CSCI 3500 Theory of Computation Teaching Interests Combinatorial algorithms, especially distributed and communication algorithms. Theoretical foundations of Computer Science. Ethical problems in Computer Science and Information Technology. Scholarship Selected Recent Publications Energy Efficient Adversarial Routing in Shared Channels, 2025 Journal Article, Academic Journal Disconnected Agreement in Networks Prone to Link Failures, 2023 Book, Chapter in Scholarly Book-New Stable Scheduling in Transactional Memory, 2023 Book, Chapter in Scholarly Book-New Flexible scheduling of transactional memory on trees, 2023 Journal Article, Academic Journal Adversarial Contention Resolution Games, 2023 Conference Proceeding Research Interests Design and analysis of combinatorial algorithms.Algorithms for distributed and parallel computing and communication networks. College Service PhD Committee 2019 - Present Role: Committee Member University Service University Senate Committe Promotion & Tenure 2020 - 2022 Role: Committee Member Professional Service Fundamenta Informaticae 2018 - Present Role: Editor Steering Committee of the International Symposium on Fundamentals of Computation Theory (FCT) 1999 - Present Role: Committee Member The 15th International Symposium on Algorithms and Experiments for Wireless Networks (ALGOSENSORS) 2018 - 2019 The 46th International Colloquium on Automata, Languages and Programming (ICALP) 2018 - 2019",
  "content_length": 2298,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:39"
}