{
  "name": "Boleslaw K. Szymanski",
  "homepage": "http://www.cs.rpi.edu/~szymansk",
  "status": "success",
  "content": "Boleslaw K. Szymanski Boleslaw K. Szymanski 518 • 276 • 6838 MRC 335A • RPI • 110 8th St. • Troy NY 12180 Home Papers Projects & Software Students Courses Dr. Szymanski's research interests span from network science, with emphasis on social networks and computer wireless and sensor networks to analysis and design of distributed algorithms, simulation of computers, networks and biological/ecological phenomena. His projects include spread of opinion and other dynamic processes on networks, communities in social networks, and large-scale parallel and distributed computing and simulation. Dr. Szymanski developed a novel Mutual Exclusion algorithm, led the development of the GANXIS and SpeakEasy community detection algorithms; the SENSE simulator for sensor network simulation, and VOGUE and Conceptor-based innovative HMM models. Papers Quantifying patterns of research-interest evolution, T. Jia, D. Wang, and B.K. Szymanski, Nature Human Behaviour 1(4):0078, 2017. Overlapping Community Detection in Networks: the State of the Art and Comparative Study, J. Xie, S. Kelly, and B.K. Szymanski, ACM Computing Surveys 45(4):43, 2013. Polarization and tipping points Michael W. Macy, Manqing Ma, Daniel R. Tabin, Jianxi Gao, and Boleslaw K. Szymanski Proceedings of the National Academy of Science 118(50):e2102144118, Dec. 14, 2021; https://doi.org/10.1073/pnas.2102144118 More… The three most recent CS Ph.D. Graduates Xiang Niu (Ph.D. Computer Science, June, 2019) The Dynamics in Opinion and Global Risk Networks: Modeling, Discovering and Control Researcher, Google, Inc., Mountain View, CA Ashwin Bahulkar (Ph.D. Computer Science, July, 2019) Evolution Dynamics of Attribute-Rich Social Networks Researcher, Facebook, Inc., Menlo Park, CA Xiaoyan Lu (Ph.D. Computer Science, May, 2019) Community Detection and its Applications in Understanding Dynamics of Social Networks Researcher, Google, Inc., New York, NY More… Projects & Software MetPetDB MetPetDB is a database for metamorphic petrology built by a global community of metamorphic petrologists and computer scientists at RPI, a part of the National Cyberinfrastructure Initiative of the NSF. MilkyWay@home A research project that uses Internet-connected computers to trace the evolution of the Milkyway galaxy. Mutual Exclusion Algorithm Algorithm with linear wait that solved the open problem posed by Lamport in 1978. Parallel Toolkit for Community Quality Metrics Software for a Parallel Toolkit for Community Quality Metrics, including modularity Q and modularity density Qds for community detection. More… Current Graduate Researcher Assistants James Flamino, Physics Amr Elsisy, CS Manqing Ma, CS Omar Malik, CS Brendan Cross, CS Aamir Mandviwalla,CS Cheng, Ma, Physics Bowen Gong, Engineering Current Undergraduate Researchers Fred Buchanan Lake Yin Download Curriculum Vitae Wikipedia link Current Positions Claire and Roland Schmitt Distinguished Professor of Computer Science Professor of Physics, Applied Physics, and Astronomy Director, Network Science and Technology Center (NeST) formerly SCNARC, NS CTA Foreign Member, Polish Academy of Sciences Board Member, Network Science Society Editorial Board Member,IEEE Trans. on Computational Social Systems; Computer Science Journal; Computational Methods in Science and Technology (CMST) Courses Fall 2021 CSCI-6250/4250 Frontiers of Network Science Home Papers Projects & Software Students Courses 518 • 276 • 6838 MRC 335A • RPI • 110 8th St. • Troy NY 12180 Copyright © 2007 Boleslaw K. Szymanski",
  "content_length": 3525,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:42"
}