{
  "name": "Bonita Sharif",
  "homepage": "https://www.shbonita.me",
  "status": "success",
  "content": "Bonita Sharif, Ph.D. | Associate Professor About Bonita Sharif, Ph.D. is an Associate Professor in the School of Computing at University of Nebraska - Lincoln, Lincoln, Nebraska USA. She received her Ph.D. in 2010 and MS in 2003 in Computer Science from Kent State University, U.S.A and B.S. in Computer Science from Cyprus College, Cyprus. Her research interests are in software engineering, eye tracking, empirical studies, software visualization, human factors, and software traceability. She has authored over 80 refereed publications. She serves on numerous program committees in various leadership roles including ASE, ESEC/FSE, ICSME, ICSE, VISSOFT, SANER, and ICPC. She also reviews for SE journals TSE, TOSEM, EMSE and RE. She served as general chair of VISSOFT 2016 and ETRA 2018 and 2019. In 2014, she served as Program Co-Chair for VISSOFT and currently is steering committee chair. Sharif has graduated two Ph.D. students and 16 Masters students and is currently supervising 1 Ph.D. student and several undergraduate students. Sharif is a recipient of the NSF CAREER award and the NSF CRI award related to empowering software engineering with eye tracking. She directs the Software Engineering Research and Empirical Studies Lab at UNL. Service Profile on conf.researchr.org Google Scholar Citations - h-index: 30 , total citations: 3484 (Last Date accessed: Feb 1, 2025) Labs Directing Software Engineering Research and Empirical Studies Lab at UNL iTrace Project Portal iTrace Community Infrastructure Portal - NSF Funded Project Research Areas of Interest software engineering, program comprehension, human factors, eye tracking, empricial studies, human computer interaction, software traceability, emotional awareness in development Mentoring Philosopy Dr. Sharif’s mentoring philosophy is centered around providing a fun and collaborative environment for students to learn the technical and critical thinking skills needed in their training. Students get a well-rounded experience and are included in all aspects of research including literature reviews, design, coding, analyses, effective group communication, writing to disseminate results, and presenting research results to different audiences. Students are integrated into the lab along with other undergraduate research assistants, graduate students, and the research team. The lab meets weekly as a group for status updates, progress discussions, and brainstorming solutions to roadblocks. In addition to the weekly lab meetings, each individual student meets with Dr. Sharif individually or in a smaller group during the week to tackle specific issues to move the project forward. A clear set of goals, objectives, and measurable outcomes is identified collaboratively with the student for each project. A weekly journal update is kept by each student to record weekly progress. Professional development in the form of career mentoring advice, workshop and conference volunteering as well as attending and presenting research at appropriate venues are intentionally part of conversations and regularly brought up in lab meetings. As a scholar, mentor, and educator, Dr. Sharif knows that there is no one size fits all. She strives to break down barriers for students so they may engage in research by tailoring her mentoring strategy to fit the needs of each individual student. Students Mentored - Graduate Level Since Joining UNL in 2018: Directed 3 Ph.D. students and 3 Masters students as primary research advisor. 20 papers published with student authors. Prior to Joining UNL 2010-2017: Directed 13 Masters student theses, 5 Master’s projects, 6 independent research projects, and actively participated in 3 Ph.D. theses as an external committee member. 6 total papers published with student authors Students Mentored - Undergraduate Level Since joining UNL in 2018: Directed 16 SOC(CSE)/Psychology/Software Engineering program undergraduates and 2 Raikes school undergraduates. Directed 7 UCare students and 5 honors theses students. 5 papers published with student authors. Prior to joining UNL 2010-2017: Directed 1 honors thesis, 23 undergraduate capstone research projects, and 13 undergraduate independent study research projects. 18 total papers published with student authors. Spring 2025 Teaching Senior Design (Capstone) - Tribe Lead for 6 teams CSCE/SOFT 445/845 Eye Tracking in Usability and Software Engineering Eye tracking is a powerful method that provides insights into how the mind processes information. The course provides students with the skill of creating and evaluating new and existing human computer interfaces in the context of software engineering. The eye tracker’s role will be discussed as both an input tool to inform software engineering tasks as well as an assessment tool to evaluate them. Interdisciplinary applications of eye tracking in various areas of software engineering, biometrics, and psychology among others will be presented. The anatomical and physiological aspects of human vision will be presented along with certain aspects of the Brain Computer Interface (BCI). The course will focus on eye tracking empirical research: developing good research questions, tradeoffs in designing and instrumenting an eye tracking study, data quality, analyzing existing eye tracking data, developing eye tracking metrics, usability and human factors, and finally analyzing and writing up results. Students will learn how to design, conduct, and analyze a technically sound eye tracking empirical study for software engineering problems in a group setting. Fall 2024 On Sabbatical. Spring 2024 Teaching Senior Design (Capstone) - Tribe Lead for 6 teams CSCE/SOFT 468/868 Requirements Elicitation and Modeling In-depth coverage of processes, methods and techniques for determining, or deciding, what a proposed software system should do. Topics include the requirements engineering process, identification of stakeholders, requirements elicitation techniques, methods for informal and formal requirements documentation, techniques for analyzing requirements models for consistency and completeness, and traceability of requirements across system development and evolution. Tool support for modeling functional and non-functional requirements to support elicitation and analysis will be studied. Fall 2023 Teaching Senior Design (Capstone) - Tribe Lead for 6 teams Spring 2023 Teaching Soft 161 - Software Engineering II Design and modeling of complex software systems. Techniques and tools based on disciplined software engineering principles and practices for designing and modeling software-intensive systems from technical, organizational, and management perspectives. Techniques for building and analyzing event-driven applications and multi-layer applications with an SQL database backend. Data structures and operations for lists, stacks, queues, and other data structures. Algorithms and data structures for searching and sorting. Concepts and practice of object-oriented programming, including encapsulation, composition, inheritance, and polymorphism. Recent News I am sponsoring a Senior Design Team for the School of Computing in Fall 2024-Spring 2025 I am on sabbatical in Fall 2024. I joined the CSE department (now School of Computing) at UNL in August of 2018. I have several topics related to my research in software engineering for both undergraduate and graduate students. These topics can be developed into a senior project for undergraduates as well as thesis topics for graduate students. Contact me for more information. Publications A full listing of my publications is available on DBLP. A more comprehensive list will be made available on my website soon. Associate Editor/Steering Committee Positions Associate Editor for IEEE Transactions on Software Engineering (TSE) Associate Editor for ACM Transactions on Computer Education (TOCE) Steering Committee Chair for IEEE Working Conference on Software Visualization (VISSOFT) Steering Committee Chair for ACM Symposium on Eye Tracking Research & Applications (ETRA) Steering Commitee Member for the IEEE/ACM International Conference on Program Comprehension (ICPC). SIGSOFT Cares Member - Committee. Past Service Program Committee Member for ICSME 2015 ERA track, VISSOFT 2015, SANER 2015, OCWIC 2015, SST 2015 (formerly TEFSE), JSEET 2015, ICPC 2015 Research and ERA tracks, ICPC 2014 (Research and tool demo track), CSEET 2014, ICPC 2013 ERA Track, VISSOFT 2013, TEFSE 2013, CSEET 2013, ICPC 2012 Poster track, CSEET 2012, ICSM 2012, CSEET 2011. General chair for VISSOFT 2016. Tool Demo track co-chair for ICPC 2016 with Mircea Lungu. Demo/Video track co-chair for ETRA 2016 with Preethi Vaidhyanathan. Tutorial co-chair for SANER 2015 with Jens Krinke. Program co-chair for VISSOFT 2014 with Andy Zaidman - (co-located with ICSME 2014) Registration chair for TEFSE 2013 and OCWIC 2015 Eye movement Data Standards Sub-committee, Cogain.org (2012 - present) I have reviewed for the following conferences Symposium on Special Interest Group on Computer Science Education (SIGCSE 2015) Symposium on Special Interest Group on Computer Science Education (SIGCSE 2014) Symposium on Eye Tracking Research & Applications (ETRA 2014) - full and short papers track Symposium on Eye Tracking Research & Applications (ETRA 2012) - short papers track Symposium on Special Interest Group on Computer Science Education (SIGCSE 2013) I am a reviewer for the following journals. IEEE Transactions on Education IEEE Transactions on Software Engineering Journal of Software Engineering Research and Development Information and Software Technology Journal of Systems and Software Journal of Software: Evolution and Process Empirical Software Engineering Journal Requirements Engineering Journal Elsevier's Science of Computer Programming Journal I have also served as an additional reviewer for the following conferences and journals. Advances in Software Engineering Journal International Symposium on Grand Challenges in T",
  "content_length": 11301,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:44"
}