{
  "name": "Bonnie Berger",
  "homepage": "https://people.csail.mit.edu/bab",
  "status": "success",
  "content": "Bonnie Berger Home Page Background and Research Interests Bonnie Berger is the Simons Professor of Mathematics at MIT and serves as head of Computation and Biology group at MIT's Computer Science and AI Lab. Her recent work focuses on designing algorithms to gain biological insights from advances in automated data collection and the subsequent large data sets drawn from them. She works on a diverse set of problems, including Compressive Genomics, Network Inference, Structural Bioinformatics, Genomic Privacy, and Medical Genomics. Additionally, she collaborates closely with biologists in order to design experiments to maximally leverage the power of computation for biological explorations. After beginning her career working in algorithms at MIT, she was one of the pioneer researchers in the area of computational molecular biology and, together with the many students she has mentored, has been instrumental in defining the field. Professor Berger is an elected fellow of the American Academy of Arts and Sciences, Association for Computing Machinery, International Society for Computational Biology (ISCB), American Institute of Medical and Biological Engineering, American Mathematical Society, the Society of Industrial and Applied Mathematics. Recently she was recognized by ISCB with their Accomplishments by a Senior Scientist Award. She received the NIH Margaret Pittman Director's Award, the SIAM Sonya Kovalevsky Lecture Prize and an Honorary Doctorate from EPFL. Earlier in her career, she received an NSF Career Award, the Biophysical Society's Dayhoff Award, and recognition as Technology Review Magazine's inaugural TR100 top young innovators. She won the RECOMB Test of Time Award both in 2010 and 2019. She also serves on the Executive Editorial Board of Journal of Computational Biology and as member of the editorial boards of Annual Review for Biomedical Data Science, Genome Biology, Bioinformatics, IEEE/ACM TCBB, and Cell Systems. In addition, Professor Berger is an Associate Member of the Broad Institute, Faculty member of Harvard/MIT Health Science \t& Technology, and Affiliated Faculty of Harvard Medical School. Recently she was elected to the National Academy of Sciences Class of 2021. Recent Highlights Professor Bonnie Berger has been elected to the National Academy of Sciences Ellen Zhong and Bonnie Berger are co-organizing a workshop on Machine Learning for Structural Biology at NeurIPS 2020 For more info see our website. Maxwell Sherman Adam Uri Yaari ASHG 2020: Reviewersâ Choice Recipients Seq â a language for bioinformatics Seq is a programming language for computational genomics and bioinformatics. For more info see our website. Sonia Kovalevsky Lecture Prize AWM SIAM - Annual Meeting, 2020 Professor Bonnie Berger has been selected to give the 2020 AWM SIAM Sonia Kovalevsky Lecture ISCB 2019 Senior Scientist Award Professor Bonnie Berger has been honored with ISCB Senior Scientist Award Paper in Science - October 19, 2018 Realizing private and practical pharmacological collaborationBrian Hie†, Hyunghoon Cho† and Bonnie Berger* Lillian wins MIT UROP Award - May 2019 Lillian Zhang was selected as a co-recipient of the 2019 Randolph G. Wei UROP Award for her outstanding work âat the interface of the life sciences and engineering.â MIT News - March 22, 2019 Learning protein sequence embeddings using information from structureTristan Bepler and Bonnie Berger* Featured in Cell Systems - September 2018 Generalizable and Scalable Visualization of Single-Cell Data Using Neural Networks PI Berger in CACM News - August 2018 ACM News: Is Genomic Privacy Possible? Featured in Science - Jun 8, 2018 Genomic crowdsourcing with privacy - Paper in Nature Biotechnology ISMB Best Oral Presentation Award Hyunghoon Cho receives \"Best Oral Presentation Award\" at ISMB 2018 TransMed Track MIT News - May 8, 2018 Protecting confidentiality in genomic studies - Paper in Nature Biotechnology Ariya receives Best Student Paper Award at RECOMB 2018 Ariya Shajii's paper received Best Student Paper Award at RECOMB 2018. This paper has been accepted to Cell Systems. F1000Prime Recommended Article - May 2017 Compact Integration of Multi-Network Topology for Functional Analysis of Genes [Cell Systems Article, F1000Prime Recommendation] Cell Systems Cover - February 22, 2017 Genome-scale networks link diverse molecular pathways and neurodegenerative disease genes to alpha-synuclein [featured in Science Translational Medicine Editor's Choice] iFold_1 wins CASP 12 PCP - December 2016 The deep learning algorithm by Team iFold_1 ranked first place in protein contact prediction amongst all CASP12 participants, during a year where the CASP organizers deemed the improvement in contact prediction to be one of the four major advances in the 24 year history of CASP.Y. Liu, P. Pameldo â , Q. Ye, B. Berger *, and J. Peng *. \"Deep Learning Reveals Evolutionary Grammar of Interaction Motifs\". Nature News - August 15, 2016 Spiking genomic databases with misinformation could protect patient privacy - Paper in Cell Systems MIT News - August 10, 2016 Protecting Privacy in Genomic Databases - Paper in Cell Systems CACM Cover - August 2016 Computational Biology in the 21st Century: Scaling with Compressive Algorithms ISMB Best Student Paper Award - July 2016 Yaron Orenstein's Paper Received Ian Lawson Van Toch Memorial Award for Outstanding Student Paper William wins MIT Johnson Prize - May 2016 Yun William Yu awarded \"MIT Charles W. and Jennifer C. Johnson Prize\" for Cell Systems PaperYun William Yu, Noah M. Daniels, David C. Danko, & Bonnie Berger. \"Entropy-scaling search of massive biological data.\" Cell systems (2015) 1(2): 130-140. Nature Biotechnology Paper - April 2016 Compressive Mapping for Next-Generation Sequencing:accurate multi-read mapping at orders of magnitude speedup Data Science @ Stanford - March 2016 click on the video to play or pause Previous Next",
  "content_length": 5939,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:46"
}