{
  "name": "Boon Thau Loo",
  "homepage": "http://www.cis.upenn.edu/~boonloo",
  "status": "success",
  "content": "Boon Thau Loo – RCA Professor, Senior Associate Dean for Education and Global Initiatives – Penn Engineering Skip to content composite8 copycomposite13composite20 Teaching CV Talks Welcome Fall 2025 office hours: Tuesday 2-3pm ET (Virtual via OHQ -- PennKey authentication required. See announcements within link for any date/time changes) Academic Biography Boon Thau Loo is the RCA Professor in the Computer and Information Science (CIS) department, with a secondary appointment in Electrical and Systems Engineering at the University of Pennsylvania. He leads the NetDB@Penn research group and is an active member of the Distributed Systems Lab and the Penn database group. He received the NSF CAREER Award (2009), AFOSR Young Investigator Award (2012), Penn's Emerging Inventor of the Year Award (2018), EDBT Best Paper (2020), Ruth and Joel Spira Award for Excellence in Teaching (2021), the University Lindback Award for Distinguished Teaching (2022), NSDI Outstanding Paper (2024), and the International Student Advocate of the Year (ISAY) (2024) awarded by Penn ISSS. He has mentored 18 Ph.D. students, five of whom have won dissertation awards. Boon received his Ph.D. in Computer Science from the University of California, Berkeley in 2006, his M.S. from Stanford University in 2000, and his B.S. with highest honors from UC Berkeley in 1999. He was honored with the 2006 David J. Sakrison Memorial Prize for outstanding dissertation research in EECS at UC Berkeley and the 2007 ACM SIGMOD Dissertation Award. Administrative Biography As the Senior Associate Dean for Graduate Education and Global Initiatives at Penn Engineering, Boon Thau Loo oversees all doctoral and professional master’s programs, comprising approximately 6,000 students. He also spearheads the expansion of Penn Engineering into non-degree programs, collaborates with Penn Global to enhance the engineering school's international presence, guides Penn Engineering's strategic investments in Engineering Entrepreneurship, and oversees the professional development of students at all levels. He has led several new initiatives, including the creation of the Penn Engineering Online organization, the accelerated master’s program, annual graduate student awards, the Dean's doctoral scholarship, the Dean’s master’s fellowship, the Dean's Bridge-to-Ph.D. master's fellowship, MCIT Online (the first Ivy League fully online master’s degree program in computer science for non-computer science majors), MSE-DS Online (online master's in data science), MSE-AI Online (online master's in artificial intelligence), lifelong learning for alumni, a school-wide professional development course for master's students, and semester-long academic field studies for master's students. Entrepreneurship Biography As an entrepreneur, Boon Thau Loo has successfully co-founded two technology companies. In 2015, he co-founded Termaxia, a software-defined, energy-efficient big data storage startup based in Philadelphia, which was acquired in 2020 by Frontiir, a leading technology company in Southeast Asia. Previously, in 2014, he co-founded Gencore Systems (Netsil), a cloud performance analytics company commercializing his research on the Scalanytics declarative network analytics platform. Netsil was acquired in 2018 by Nutanix Inc., a public cloud infrastructure company. Netsil was one of the first faculty-led startups from Penn Engineering's CIS department, and its acquisition marked a significant milestone for faculty-led startup exits at Penn Engineering.",
  "content_length": 3535,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:50"
}