{
  "name": "Boris Motik",
  "homepage": "https://www.cs.ox.ac.uk/boris.motik",
  "status": "success",
  "content": "Boris Motik | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyBoris MotikBoris Motik Professor Boris Motik Professor of Computer ScienceSenior Research Fellow, Somerville CollegeE: firstname.lastname@cs.ox.ac.ukT: +44 (0)1865 283544 Room 308, Wolfson Building, Parks Road, Oxford OX1 3QD United Kingdom Themes:Data, Knowledge and ActionArtificial Intelligence and Machine LearningCompleted Projects:HermiTConDORREOLREQUIEMExODAQueReScore!OptiqueMaSI3DBOntoED3AnaLOGInterestsI am interested in developing algorithms and techniques necessary for realizing advanced applications in the Semantic Web. In the past, my research is focused around the ontology language OWL. More recently, I became interested in applying ontology techniques to data management problems in databases and big data. Specifically, I am investigating ways in using variants of datalog — a language at the intersection of logic programming and databases — to represent and access data, and I am studying the related theoretical and practical problems, such as efficient evaluation of datalog programs and efficient maintenance of datalog materialisations. My research involves the development of tools that demonstrates the techniques I am working on. In my PhD, I developed algorithms for reasoning in OWL by reusing database technologies. I implemented these techniques in the KAON2 reasoner. The German company ontoprise GmbH is currently using KAON2 in a commercial setting. In my postdoc research I have developed the HermiT reasoner. This reasoner is based on a novel reasoning algorithm based on hypertableau, which allows HermiT to process certain ontologies that have traditionally been quite \"hard\". Recently, I have been working on a new reasoner for datalog and RDF called RDFox. Based on the outcome of this research, Ian Horrocks, Bernardo Cuenca Grau, Adam Parr, and me founded Oxford Semantic Technologies — a startup company whose objective is to productise RDFox and apply it to a variety of advanced use cases. Publications complete list with downloadable papers BiographyBefore coming to Oxford, I worked in the Information Management Group, School of Computer Science, University of Manchester. I got my PhD from the University of Karlsruhe under supervision of Prof. Rudi Studer. While in Karlsruhe, Germany, I was employed at the Research Center for Information Technologies (FZI). I speak English, German, and Croatian, so feel free to send me e-mails in any of these languages. Awards Winner of the 2025 Vice Chancellor’s Award for Innovation and Commercialisation for his work on Oxford Semantic Technologies as a spinout company of Oxford University Distinguished Paper at the 2017 International Joint Conference on Artificial Intelligence for the paper \"Foundations of Declarative Data Analysis Using Limit Datalog Programs\" Best Applications Paper at the 2016 International Semantic Web Conference for the paper \"Semantic Technologies for Data Analysis in Health Care\" The 2013 Roger Needham award by the British Computer Society (BCS) for \"a distinguished research contribution in computer science\" Selected as one of \"2008 AI's 10 to Watch\" by the IEEE Intelligent Systems magazine The 2007 Cor Baayen award by the European Research Consortium for Informatics and Mathematics (ERCIM) for \"a most promising young researcher in computer science and applied mathematics\" Best Paper at the 2005 International Semantic Web Conference for the paper \"On the Properties of Metamodeling in OWL\" Technology Transfer Projects with Industry Partners I am collaborating with Oracle on developing methods for efficient management of large-scale graph data. With EDF I am working on an ontology-based recommender system helping customers save energy. With Armasuisse I was working on using ontologies to detect events from Twitter streams. For Samsung, I developed a lightweight ontology-based data store that can support intelligent applications on mobile devices. For ExperienceOn, a start-up in Barcelona, Spain, I developed an ontology-based data store that is powering their multilingual Fogg search engine. See alsoCV in PDF formatHermiT reasonerThe RDFox systemSelected PublicationsView AllManage publications Modular Materialisation of Datalog Programs Pan Hu‚ Boris Motik and Ian Horrocks In Proceedings of the Thirty−Third AAAI Conference on Artificial Intelligence (AAAI−19). 2019. Details about Modular Materialisation of Datalog Programs | BibTeX data for Modular Materialisation of Datalog Programs Consequence−Based Reasoning for Description Logics with Disjunctions and Number Restrictions Andrew Bate‚ Boris Motik‚ Bernardo Cuenca Grau‚ David Tena Cucala‚ Frantisek Simancik and Ian Horrocks In J. Artif. Intell. Res.. Vol. 63. Pages 625–690. 2018. Details about Consequence−Based Reasoning for Description Logics with Disjunctions and Number Restrictions | BibTeX data for Consequence−Based Reasoning for Description Logics with Disjunctions and Number Restrictions | DOI (10.1613/jair.1.11257) | Link to Consequence−Based Reasoning for Description Logics with Disjunctions and Number Restrictions ActivitiesKnowledge Representation and Reasoning Current Student Shaoyu Wang Past Students Temitope AjileyeFredah BandaAndrew BateDespoina MagkaHector Perez-UrbinaAnthony PotterRob Shearer Past Researchers Birte GlimmResearch AssistantPan HuClemens KupkeRobert PiroGiorgos StoilosZhe WangAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 5689,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:51"
}