{
  "name": "Borko Furht",
  "homepage": "http://www.cse.fau.edu/~borko",
  "status": "success",
  "content": "Dr. Borko Furht - Home Page Dr. Borko Furht Home Bio Academic Research Publications Misc Dr. Borko Furht Borko Furht Professor and Director of the NSF Industry/University Cooperative Research Center Department of Computer & Electrical Engineering and Computer Science at Florida Atlantic University Contact information Department of Computer & Electrical Engineering and Computer Science Florida Atlantic University 777 Glades Road Boca Raton, FL 33431 - USA Office: Engineering East Building - EE 503 Phone: (561) 297-3180• Fax: (561) 297-2800 Email: bfurht@fau.edu Department's Page: http://www.ceecs.fau.edu Current Creative Activities •One of PIs in a Federal Earmark Research Project on Center for Coastline Security Technologies •Co-PI in NSF funded project on A Global Living Laboratory for Cyberinfrastructure Application Enablement •Founder and Editor in Chief of the Journal of Multimedia Tools and Applications •Consulting Editor for the Book Series on Multimedia Systems and Applications (Springer) •Consulting Editor for the Book Series on Telecommunications (CRC Press, Taylor & Francis Group) •Editor-in-Chief of Multimedia Security Handbook (with D. Kirovski, Microsoft Research), CRC Press, 2005. •Editor-in-Chief of Encyclopedia of Wireless and Mobile Communications, OnlineVersion , Auerbach Publishing, Taylor & Francis Group, 2008. •Editor-in-Chief of Handbook of Mobile Broadcasting, (jointly with Syed Ahson), CRC Press, Taylor & Francis Group, 2008. •Editor-in-Chief of Handbook of Long Term Evolution of the 3GPP Radio Technology , (jointly with Syed Ahson), CRC Press, Taylor & Francis Group, 2008. •Editor-in-Chief of Encyclopedia of Multimedia, 2nd Edition, Springer, 2008. •Editor-in-Chief of Handbook of Digital Media in Entertainment and Arts, Springer, 2009. •Editor-in-Chief of Handbook of HSDPA/HSUPA, (jointly with Syed Ahson),CRC Press, Taylor & Francis Group, 2009. •Editor-in-Chief of Handbook of Cloud Computing, Springer 2010. •Center of Excellence for High-Performance Computing (Technical Proposal) •President Obama's Inauguration (Amizing digital image technology) •World University Presidents Summit, Belgrade (Serbia), April 2009 •Seven IT Grand Challenges •Editor-in-Chief of Handbook of Social Networks Technologies and Applications, Springer 2010. •Presentation: Vision of the Computing in the New Global Economy, 2009 •Presentation: The Magic of the Hypercube: From Parallel Computing to Multimedia, 2009 •Presentation: Inaugural Department's Presentation, 21 August, 2009 •Presentation: Meeting with PhD Students, September 2009 •Presentation: Vision of Information Science and Technology in the New Global Economy, 2010 •Editor-in-Chief of Handbook of Augmented Reality Technologies and Applications, Springer 2011. •Presentation: I/U CRC •Presentation: MUE •Presentation: IAB Meeting, November 2010 •IabMeetings - Photos •Belgrade, October2010 •Editor-in-Chief of Handbook of Data Intesive Computing, Springer 2012. •Presentation: Vision of Engineering,ICMCS,April 2011 •Presentation: Dean's Interview, May 9, 2011 •Presentation: LACCEI, Medellin, Colomiba, August 2011 •Editor-in-Chief of Handbook of Medical and Healthcare Technologies, Springer 2013. •Editor-in-Chief of Handbook of Big Data, Springer 2013. •Presentation: Board of Trustees, January 2012",
  "content_length": 3309,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:54"
}