{
  "name": "Bosheng Song",
  "homepage": "http://csee.hnu.edu.cn/people/songbosheng",
  "status": "success",
  "content": "宋勃升-湖大信息科学与工程学院 教师登录 English 返回首页 学院概况 学院简介 学院领导 师资力量 机构设置 决策机构 教学单位 计算机科学系 软件工程系 通信工程系 信息工程系 计算机工程系 网络空间安全系 实验中心 基础教学部 研究机构 特色学院 条件装备 办事机构 人才培养 本科培养 研究生培养 博士生培养 留学生培养 学科专业方向 科学研究 科研项目 科研成果 成果转化 学术信息 工作流程 招生就业 本科招生 硕士招生 博士招生 学生就业 实习就业基地 学生工作 学生动态 学生党建 团学工作 日常管理 心理健康 奖励工作 社团组织 党群工作 党建工作 工会工作 关工委工作 学术资源 资源管理系统 精品课程 实验仪器设备 宋勃升 我的位置在： 首页 > 学院概况 > 师资力量 > 宋勃升 教师介绍 宋勃升，教授，博士生导师，入选2项省级人才项目（湖湘青年英才、湖南省优青）。研究方向为生物计算、药物研发等，近年来在国际期刊和国际会议上发表相关领域学术论文90多篇，其中以第一/通讯作者发表在IEEE-TCYB、IEEE-TPDS、IEEE-TC等高水平SCI论文50多篇（中科院一区/CCFA类/IEEE汇刊论文25篇，6篇影响因子大于10，6篇论文入选ESI高被引）。主持国家级项目3项，省部级项目4项，参与国家级项目2项。 中文名： 宋勃升 英文名： 学历： 博士 职称： 教授 联系电话： 电子邮件： boshengsong@hnu.edu.cn 研究方向： 生物计算，生物信息学，药物发现 联系地址： 湖南省长沙市岳麓区麓山南路2号，湖南大学信息科学与工程学院（410082） 所属机构： 计算机科学系 学院教师 学生培养 毕业学生：        2022届：罗晓妍（德睿实习，长沙银行工作）                       苏祥（南京数睿数据）        2023届：程玉（英国爱丁堡大学读博，全球大学排名22位）                       胡传龙（武汉大学读博）                       李芬（华为）                       李梓盟（阿里巴巴）指导学生：        2021级硕士：陈述高、王玉杰        2022级硕士：程志祥、侯琳琳        2023级硕士：何玉琴、李晓雯、张嘉仪、胡君爽        2020级博士：李艳艳        2023级博士：马腾飞        招生计划：        本人招收2025年硕士研究生3名左右，研究方向为生物信息学，生物计算等。课题组长期招收博士及博士后，欢迎感兴趣的学生与我联系。 科研状况 1. 国家自然科学基金面上项目，62272151，多通道膜系统及应用研究，2023/01-2026/12，在研，主持2. 国家自然科学基金面上项目，61972138，动态结构膜系统及应用研究，2020/01-2023/12，已结题，主持3. 湖南省青年科技人才(荷尖人才)项目，2022RC1099，2022/09-2025/09，在研，主持4. 湖南省优秀青年科学基金项目，2022JJ20016，生物计算模型理论及实现，2022/01-2024/12，已结题，主持5. 之江实验室开放课题，2021RD0AB02，新型类组织膜系统理论及实现方法研究，2022/01-2023/12，已结题，主持6. 湖南省自然科学基金面上项目，2020JJ4215，树状结构膜系统理论及应用研究，2020/01-2021/12，已结题，主持 学术论文 一、主要代表性论文（第一/通讯作者）1. Bosheng Song, Chuanlong Hu, David Orellana-Martín, Antonio Ramírez-de-Arellano, Mario J. Pérez-Jiménez, Xiangxiang Zeng*, The computational properties of P systems with mutative membrane structures, Information and Computation, 2025, 303, 105277. (SCI，CCF A类)2. Leshan Lai, Yuansheng Liu*, Bosheng Song*, Keqin Li, Xiangxiang Zeng, Deep generative models for therapeutic peptide discovery: a comprehensive review, ACM Computing Surveys, 2025, 57(6), Article No.:155, Pages 1-29. (SCI，IF=23.8, 中科院一区)3.  Tengfei Ma, Yujie Chen, Liang Wang, Xuan Lin, Bosheng Song*, Xiangxiang Zeng, S2DN: Learning to denoise unconvincing knowledge for inductive knowledge graph completion, Proceedings of the AAAI Conference on Artificial Intelligence (AAAI 2025), 2025, 39(12),  12355-12363. (CCF A 类会议，并被提名为oral文章，提名率约4.63%)4. Bosheng Song, Kenli Li, David Orellana-Martín, Xiangxiang Zeng*, Mario J. Pérez-Jiménez, Tissue P systems with states in cells, IEEE Transactions on Computers, 2023, 72(9), 2561-2570. (SCI，CCF A类)5. Bosheng Song, Kenli Li*, Xiangxiang Zeng, Mario J. Pérez-Jiménez, Claudio Zandron, Monodirectional evolutional symport tissue P systems with channel states and cell division, SCIENCE CHINA Information Sciences, 2023, 66(3), 139104. (SCI，CCF A类)6. Yanyan Li, Bosheng Song*, Xiangxiang Zeng, Rule synchronization for monodirectional tissue-like P systems with channel states, Information and Computation, 2022, 285, 104895. (SCI，CCF A类，理论计算机顶刊)7. Bosheng Song, Kenli Li, Xiangxiang Zeng, Monodirectional evolutional symport tissue P systems with promoters and cell division, IEEE Transactions on Parallel and Distributed Systems, 2022, 33(2), 332-342. (SCI，CCF A类)8. Bosheng Song, Xiaoyan Luo, Xiaoli Luo,Yuansheng Liu, Zhangming Niu, Xiangxiang Zeng*, Learning spatial structures of proteins improves protein–protein interaction prediction, Briefings in Bioinformatics, 2022, 23(2), bbab558.  (SCI，IF=13.994,  ESI高被引论文，生物信息学顶刊)9. Bosheng Song, Fen Li, Yuansheng Liu, Xiangxiang Zeng, Deep learning methods for biomedical named entity recognition: a survey and qualitative comparison, Briefings in Bioinformatics, 2021, 22(6), bbab282. (SCI，IF=13.994,  生物信息学顶刊)10. Yu Cheng, Yongshun Gong, Yuansheng Liu*, Bosheng Song*, Quan Zou, Molecular design in drug discovery: a comprehensive review of deep generativemodels, Briefings in Bioinformatics, 2021, 22(6), bbab344. (SCI，IF=13.994,  生物信息学顶刊)11. Bosheng Song, Shengye Huang, Xiangxiang Zeng, The computational power of monodirectional tissue P systems with symportrules, Information and Computation, 2021, 281, 104751. (SCI，CCF A类，理论计算机顶刊)12.  Bosheng Song, Kenli Li, David Orellana-Martín, Mario J. Pérez-Jiménez, Ignacio Pérez-Hurtado, A survey of nature-inspired computing: membrane computing, ACM Computing Surveys, 2021, 54(1), 1-31. (SCI，IF=14.324, 中科院一区顶刊)13.  Bosheng Song, Linqiang Pan, Rule synchronization for tissue P systems, Information and Computation, 2021, 281, 104685. (SCI，CCF A类，理论计算机顶刊)14. Bosheng Song, Xiangxiang Zeng, Min Jiang, Mario J. Pérez-Jiménez, Monodirectional tissue P systems with promoters, IEEE Transactions on Cybernetics, 2021, 51(1), 438-450. (SCI，IF=19.118, 中科院一区顶刊，ESI高被引论文)15. Bosheng Song, Kenli Li, David Orellana-Martín, Luis Valencia-Cabrera, Mario J. Pérez-Jiménez, Cell-like P systems with evolutional symport/antiport rules and membrane creation, Information and Computation, 2020, 275, 104542. (SCI，CCF A类，理论计算机顶刊)更多论文请见：https://scholar.google.com.hk/citations?user=n2szdRoAAAAJ&hl=zh-CN 湖大官网 湖大微信 湖大微博 版权所有©湖南大学2017          湖南大学党委宣传部          地址：湖南省长沙市岳麓区麓山南路麓山门          邮编：410082          Email：xiaoban@hnu.edu.cn          域名备案信息：[www.hnu.edu.cn,www.hnu.cn/湘ICP备05000239号]          [hnu.cn 湘教QS3-200503-000481 hnu.edu.cn 湘教QS4-201312-010059]",
  "content_length": 5282,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:52"
}