{
  "name": "Boyuan Chen 0001",
  "homepage": "http://boyuanchen.com",
  "status": "success",
  "content": "Boyuan Chen Boyuan Chen Dickinson Family Assistant Professor Dept. of Mechanical Engineering & Materials Science Dept. of Electrical and Computer Engineering Dept. of Computer Science Duke University I lead the General Robotics Lab. My research interests span across Robotics, Perception, Machine Learning, Human-AI Teaming, AI for Science, and Dynamical Systems. Research Building autonomous machines that sense, adapt, and connect to advance embodied intelligence, drawing inspiration from natural intelligence in humans and animals. We take a \"full-stack\" approach to study both the \"body\" and \"brain\" of machines. Sense Adapt Connect Fundamental Science We focuses on multimodal perception systems that enable machines to understand complex environments. Various modalities such as vision, sound, vibration, smell, and touch can enable a more complete understanding of the world and a more robust perception system. We explore how how machines can learn and evolve in response to changing environments and tasks. Example work includes the study of self-aware robots, computational design of robots, and robot policy transfer and sharing. Our research investigates how machines can effectively communicate and collaborate with humans and other machines. We develop techniques for natural interaction, knowledge sharing, and coordinated action in mixed human-machine teams. We are excited to leverage AI and robotics to accelerate scientific discovery and applications across broad domains such as healthcare and material science. Selected Talks or Interviews Some of my recent talks and interviews. If you are interested in learning more about different projects, please see some of our research videos. What Brains Forgot, Bodies Remember: Building Intelligence from the Ground Up Stanford Robotics Seminar Â· 2025 This talk presents a developmental arc for embodied intelligence: \"sense, adapt, and connect\", as a blueprint for building machines that evolve, recover, and relate. Interview with ASME Watch List ASME Watch List Â· 2025 Boyuan was selected for his work on full-stack robotics that emphasizes constructing not only the mechanical structuresâthe bodyâbut also developing the algorithms that form the brain. Research Videos Our research is sometimes best described by brief videos and animations. Here are some of them. If you are interested in more details, please see full publication list. Click the bottom list to view more videos. Click to Show More Videos ... Click to Show Less Videos ...",
  "content_length": 2516,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:57"
}