{
  "name": "Bradley Hayes",
  "homepage": "http://www.bradhayes.info",
  "status": "success",
  "content": "Brad Hayes | AI & Robotics Researcher Brad Hayes, Ph.D. Associate Professor of Computer ScienceDirector of the Collaborative AI and Robotics (CAIRO) LabUniversity of Colorado Boulder About Me I am an Associate Professor of Computer Science at the University of Colorado Boulder and the Director of the Collaborative AI and Robotics (CAIRO) Laboratory. My work focuses on developing techniques that enable autonomous agents and robots to learn from and collaborate with humans safely, reliably, and productively. This research occurs at the intersection of pervasive and personalized artificial intelligence, human-robot teaming, and decision support. I also serve as the Chief Technology Officer at Circadence, where I lead efforts in developing AI-enabled products for state-of-the-art cybersecurity training and assessment. Research Focus Collaborative Robotics Creating robots that can understand human intent and act as seamless partners in shared tasks, from manufacturing to healthcare. Dependable (X)AI Developing AI systems that can provided factually grounded explanations for their decisions and actions, establishing and maintaining trust and transparency for human collaborators. Imitation Learning Enabling robots to acquire new skills and learn conventions by observing and interacting with humans and other agents in their environment. The Collaborative AI and Robotics (CAIRO) Lab is where we turn theory into practice. We are a team of passionate researchers dedicated to advancing the state of the art in human-robot interaction. Our work is hands-on, involving real robots, real people, and real-world challenges. Visit the Lab Website Publications For a complete and up-to-date list of my publications, please visit my Google Scholar profile. This ensures you have access to the latest pre-prints, articles, and citation information. View on Google Scholar View on CAIRO Lab Website",
  "content_length": 1902,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:59"
}