{
  "name": "Brad A. Myers",
  "homepage": "http://www.cs.cmu.edu/~bam",
  "status": "success",
  "content": "Brad A. Myers's Home Page Brad A. Myers Charles M. Geschke Director & Professor Human Computer Interaction Institute Software and Societal Systems Department (affiliated faculty) School of Computer Science Carnegie Mellon University 5000 Forbes Avenue, Pittsburgh, PA 15213-3891 USA Resume & publication list     ORCID=0000-0002-4769-0219 Google Scholar YouTube channel Phone: 412-268-5150 Fax: 412-268-1266 Email: bam@cs.cmu.edu Office: NSH 3513(Newell-Simon Hall) Admin Support: Carolyn Buzzelli-Stumpf NSH 3519 cbstumpf@andrew.cmu.edu Projects Natural Programming       See also EUSES consortium Former Pebbles        See also EdgeWrite Former QoLT Former RADAR Former The Silver Video Editor Former Command Post of the Future Former Amulet Former Demonstrational Interfaces Former Garnet » All Projects Students Jenny Liang Matthew C. Davis Amber Horvath Former Daye Nam Former Michael Xieyang Liu Former Mary Beth Kery Former Toby Jia-Jun Li Former Michael Coblenz Former Kerry Shih-Ping Chang Former YoungSeok Yoon Former Staff Andrew Faulring Former Stephen Oney Former Thomas LaToza Former Postdoc Christian Doerner Former Jeff Stylos Former Christopher Scaffidi Former Amy Ko Former Jeff Nichols Former Jake Wobbrock » All Students Courses 05-440 / 05-640Spring, 2025 Interaction Techniques 05-431 / 05-631Fall, 2022. Software Structures for User Interfaces (SSUI). 05-773A4Spring, 2021, Mini 4. Computer Science Perspectives in HCI, (CS Mini). 05-830Spring, 2020. Advanced User Interface Software. » All Courses Bio Editorial Boards Family Links See my new book: Pick, Click, Flick! The Story of Interaction Techniques at ixtbook.com. It just won a 2025 CBI Human-Computer Interaction History Prize. I taught a course at CHI'25: Interaction Techniques - History, Design and Evaluation In Spring, 2025, I taught: 05-440 / 05-640 Interaction Techniques using my new book! (Jump right to the  schedule or homeworks). I became the Director (Department Head) of the HCII on February 1, 2023. In Fall, 2022, I taught: 05-431/631 Software Structures for User Interfaces (SSUI). I was interviewed for the 99% Invisible, podcast, episode 369, titled \"Wait Wait…Tell Me!\" aired September 3, 2019. html and audio. My Lifetime Research award talk at CHI'2017: video (1:18:12), slides, 2023 tree pdf, advisee tree, abstract, SIGCHI’s citation, Steven Feiner's introduction, and Nicolai Marquardt's \"Sketchnote\". List of systems and their acronyms HCII Current Seminar Series \"Human-Centered Methods for Improving API Usability.\" Stanford University Human-Computer Interaction Seminar on People, Computers, and Design, 27 October, 2017, Palo Alto, CA. YouTube video of talk. Keynote address at WAPI: 1st International Workshop on API Usage and Evolution (https://w-api.github.io/), May, 2017. \"Human-Centered Methods for Improving API Usability\". local pdf and slides. Co-Chair for the HCII 20th Anniversary Celebration! November 1416, 2014. Research Projects Natural Programming Please try the Adamite.net Chrome extension - Exciting new research system for annotating documentation to help programmers collaborate and learn APIs with each other. Try Unakite, our plugin for Chrome to help programmers organize information: https://unakite.info/. Try our toolkit for JavaScript: ConstraintJS Collaboration on Analysis Engineering Former Projects Pebbles Hand-Held Computer Project including the EdgeWrite text entry method (patented: U.S. Pat. No. 7,729,542 [Patent]). Variations to Support Exploratory Programming, affliated with the former EUSES Consortium The ENGAGE Project on Educational Video Games, sponsored by DARPA Quality of Life Technology (QoLT) Engineering Research Center. RADAR: Reflective Agents with Distributed Adaptive Reasoning, which is part of: PAL program: Perceptive Assistant that Learns, which is part of: EPCA Enduring Personal Cognitive Agent. includes Citrine Smart Clipboard The Silver Video Editor Command Post of the Future AmuletDemonstrational InterfacesGarnet Biography (See also my complete resume and publication list). Brad A. Myers is the Charles M. Geschke (SCS 1973) Director of the Human-Computer Interaction Institute and Professor in the School of Computer Science at Carnegie Mellon University, with an affiliated faculty appointment in the Software and Societal Systems Department. He was chosen to receive the ACM SIGCHI Lifetime Achievement Award in Research in 2017, for outstanding fundamental and influential research contributions to the study of human-computer interaction, and his most recent book, \"Pick, Click, Flick! The Story of Interaction Techniques\" won a 2025 CBI Human-Computer Interaction History Prize. He was awarded the 2022 Alan J. Perlis Award for Imagination in Computer Science \"for pioneering human-centered methods to democratize programming\", from the School of Computer Science, Carnegie Mellon University. He is an IEEE Life Fellow, ACM Fellow, member of the CHI Academy, and winner of 19 Best Paper type awards and 6 Most Influential Paper Awards. He is the author or editor of over 550 publications, including three books, and he has been on the editorial board of 8 journals. He has been a consultant on user interface design and implementation to over 90 companies, and regularly teaches courses on user interface design and software. Myers received a PhD in computer science at the University of Toronto where he developed the Peridot user interface tool. He received the MS and BSc degrees from the Massachusetts Institute of Technology during which time he was a research intern at Xerox PARC. From 1980 until 1983, he worked at PERQ Systems Corporation. His research interests include user interfaces, programming environments, programming language design, end-user software engineering (EUSE), API usability, developer experience (DevX or DX), interaction techniques, programming by example, mobile computing, and visual programming. He belongs to ACM, SIGCHI, IEEE, and the IEEE Computer Society. Advisee Students (PhD, MS, BS, in CS, HCII, ISRI at CMU) Current Students Jenny Liang, PhD student, S3D Matthew C. Davis, PhD student, S3D Former Students & PostDocs Amber Horvath, PhD, HCII, August, 2024. Meta-Information to Support Sensemaking by Developers, CMU-HCII-24-103. doi.org/10.1184/R1/26880229.v1 Currently, Postdoc at MIT. Daye Nam, PhD, S3D, May, 2024, User-centered Intelligent Information Support for Programmers, CMU-S3D-24-101. pdf. Currently, visiting researcher at Google. Next, Assistant Professor at University of California, Irvine. Michael Xieyang Liu, PhD, HCII, August, 2023. Tool Support for Knowledge Foraging, Structuring, and Transfer During Online Sensemaking. CMU-HCII-23-105. pdf. Currently at Google. Mary Beth Kery, PhD, HCII, August, 2021. Designing Effective History Support for Exploratory Programming Data Work. CMU-HCII-21-106. pdf. Currently, at Apple. Toby Jia-Jun Li, PhD, HCII, August, 2021. A Multi-Modal Intelligent Agent that Learns from Demonstrations and Natural Language Instructions. CMU-HCII-21-102. pdf. Currently, Assistant Professor in the Department of Computer Science and Engineering at the University of Notre Dame. Michael Coblenz, PhD, CSD, August, 2020. User-Centered Design of Principled Programming Languages. CMU-CS-20-127. pdf. Currently, Victor Basili Fellow in the Department of Computer Science at the University of Maryland. Andrew Faulring, Staff, Deceased. Kerry Shih-Ping Chang, PhD, HCII, May, 2016. A Spreadsheet Model for Using Web Services and Creating Data-Driven Applications. CMU-HCII-16-100. pdf. Currently, Senior Research Scientist at Instabase. YoungSeok Yoon, PhD, ISR, May, 2015. Backtracking Support in Code Editing. pdf. CMU-ISR-15-103. Currently at Google. Stephen Oney, PhD, HCII May, 2015, Expressing Interactivity with States and Constraints. pdf. CMU-HCII-150-100. Currently, Assistant Professor at the University of Michigan School of Information. Thomas LaToza, PhD ISR, May, 2012, Answering Reachability Questions. CMU-ISR-12-104. pdf. Currently, Assistant Professor at Department of Computer Science, Volgenau School of Engineering, George Mason University. Christian Doerner, PostDoc, 2010-2011, currently, Build Manager at BMW Group Jeff Stylos, PhD CSD, May, 2009, Making APIs More Usable with Improved API Designs, Documentation and Tools, CMU-CS-09-130. pdf. Currently, at SAS. Christopher Scaffidi, PhD ISR, May, 2009, Topes: Enabling End-User Programmers to Validate and Reformat Data, CMU-ISR-09-105. pdf. Currently, launching a startup. Amy J. Ko, PhD, May, 2008, Asking and Answering Questions about the Causes of Software Behavior. CMU-HCII-08-106 and CMU-CS-08-122. pdf. Currently, Professor & Informatics Program Chair at University of Washington. Jeff Nichols, PhD, December, 2006, Automatically Generating High-Quality User Interfaces for Appliances. pdf. CMU-HCII-06-109. Currently, Research Scientist at Apple. Jake Wobbrock. PhD, August, 2006, EdgeWrite: A Versatile Design for Text Entry and Control. Abstract and pdf. Currently, Professor in the Information School and, Adjunct Professor, Paul G. Allen School of Computer Science & Engineering, at the University of Washington. Michael Coblenz, MS CSD, 2006. JASPER: Facilitating Software Maintenance Activities With Explicit Task Representations. Currently, Victor Basili Fellow in the Department of Computer Science at the University of Maryland. Iván Eduardo González, BS CSD, 2006. Thumb Based Interaction Techniques for Input on a Steering Wheel. Currently, at Microsoft. Andrew Faulring, BS in Computer Science, 1999. Gold: Charting by Demonstration. MS, 2005. Deceased.Rajesh Seenichamy, MS, Information Networking Institute, August, 2003, Communicating With X-10 And Vehicle Functions To Enable Two-Way Remote Control.Rob Miller, PhD, May, 2002, Lightweight Structure in Text. Currently, Distinguished Professor of Computer Science at MIT. John Pane, PhD, May, 2002, A Programming System for Children that is Designed for Usability, Currently ",
  "content_length": 24010,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:56"
}