{
  "name": "Brad Karp",
  "homepage": "http://www0.cs.ucl.ac.uk/staff/B.Karp",
  "status": "success",
  "content": "Brad Karp Brad Karp Professor of Computer Systems and Networks Head of Systems and Networks Research Group Department of Computer Science University College London Gower Street London, WC1E 6BT United Kingdom Office: 169 Euston Road, Room 207 Voice: +44 20 7679 0406 Current Teaching Computer Science 0019: Computer Systems (formerly 3007), Spring 2019 (past years: 2018) Computer Science 0133: Distributed Systems and Security (formerly M030/GZ03), Fall 2019 (past years: 2018, 2017, 2016, 2015, 2014, 2013, 2012, 2011, 2010, 2009, 2008, 2007, 2006) Past Teaching Computer Science 3035 / GZ01: Networked Systems, Fall 2014, 2013, 2012, 2011, 2010, 2009 Computer Science M038 / GZ06: Mobile and Cloud Computing, Spring 2016, 2014, 2013, 2012, 2011, 2010, 2009, 2008, 2007, 2006 Upcoming Conferences and Workshops Steering committee member: ACM HotOS Workshop (2019-) ACM SIGCOMM Conference (2016-2019) ACM HotNets Workshop (2009-2014) Program committee member: SOSP 2024, 2019, 2017, 2015 OSDI 2023, 2010 SIGCOMM 2022, 2019, 2016, 2015 (PC co-chair), 2014, 2013, 2012, 2011, 2009 (\"heavy\"), 2006 (\"light\") HotOS 2019 ASPLOS 2019 Oakland 2017 HotNets 2017 (PC co-chair), 2008 NSDI 2016, 2013, 2012, 2011, 2008, 2007 EuroSys 2013 IPSN 2010, 2006 MobiCom 2008, 2005, 2004 SenSys 2007 IPTPS 2006 WORLDS 2005 (PC co-chair), 2004 (at OSDI 2004) INFOCOM 2005 NetDB 2005 (at ICDE 2005) Recent and Upcoming Talks Google (Sunnyvale, CA), October 3rd, 2019 Frontiers in Security and Privacy (EPFL), June 3rd, 2013 13th Annual High-Confidence Software and Systems (HCSS) Conference (NSA), May 7th, 2013 EPFL Summer Research Institute, July 18th, 2008 COST ARCADIA US-EU Workshop: From Fundamentals to Infrastructure--Steps Toward the Future Internet, December 4th, 2006 NSF Workshop on Geometric Approaches to Ad Hoc and Sensor Networks, June 12th-13th, 2006 Google Labs (Mountain View, CA), May 11th, 2006 Harvard University CS Department Colloquium, February 2nd, 2006 Stanford University CS Networking Seminar, November 10th, 2005 Biography Brad Karp earned a B.S. at Yale University in 1992, an S.M. at Harvard University in 1995, and a Ph.D. at Harvard University in 2000, all in Computer Science. In his dissertation, he designed robust and scalable geographic routing algorithms and protocols for wireless networks with large numbers of nodes and highly dynamic topologies. He was a staff scientist at ICIR, the ICSI Center for Internet Research (previously named ACIRI) at the International Computer Science Institute (ICSI) at Berkeley between the fall of 2000 and fall of 2002. While at ICIR, he worked on topics including scalable distributed storage for sensor networks, reordering-robust window-based congestion control, and traffic engineering for multi-hop wireless networks. He then spent three years as a Senior Staff Researcher at Intel Research Pittsburgh, and as an Adjunct Assistant Professor in Carnegie Mellon University's Computer Science Department. At Intel Research/CMU, he continued his long-standing research thrust on geographic routing (CLDP), and started new projects in distributed system architecture (Open DHT) and Internet worm defense (Autograph and Polygraph). Brad joined UCL in October 2005 as a recipient of a Royal Society-Wolfson Research Merit Award, where he is now a Professor of Computer Systems and Networks. Curriculum vitae Publications Awad, A. and Karp, B., Enclave-Accelerated Replay: Efficient Integrity for Server Applications, in the Proceedings of the 5th ACM Workshop on System Software for Trusted Execution (SysTEX 2022), Lausanne, Switzerland, 2022. .pdf Awad, A. and Karp, B., Execution Integrity without Implicit Trust of System Software, in the Proceedings of the 4th ACM Workshop on System Software for Trusted Execution (SysTEX 2019), Huntsville, Ontario, Canada, 2019. .pdf Gvozdiev, N., Vissicchio, S., Karp, B., and Handley, M., On Low-Latency-Capable Topologies, and their Impact on the Design of Intra-Domain Routing, in the Proceedings of the ACM SIGCOMM Conference on Computer Communications (SIGCOMM 2018), Budapest, Hungary, August, 2018. .pdf Gvozdiev, N., Vissicchio, S., Karp, B., and Handley, M., Low-Latency Routing on Mesh-Like Backbones, in the Proceedings of the Sixteenth ACM SIGCOMM Workshop on Hot Topics in Networks (HotNets 2017), Palo Alto, CA, November, 2017. .pdf Nikolaidis, G., Handley, M., Jamieson, K., and Karp, B., COPA: Cooperative Power Allocation for Interfering Wireless Networks, in the Proceedings of the Eleventh International Conference on Emerging Networking Experiments and Technologies (CoNEXT 2015), Heidelberg, Germany, December, 2015. .pdf Gvozdiev, N., Karp, B., and Handley, M., FUBAR: Flow Utility-Based Routing, in the Proceedings of the Thirteenth ACM SIGCOMM Workshop on Hot Topics in Networks (HotNets 2014), Los Angeles, CA, October, 2014. .pdf Stefan, D., Yang, E., Marchenko, P., Russo, A., Herman, D., Karp, B., and Mazières, D., Protecting Users by Confining JavaScript with COWL, in the Proceedings of the 11th USENIX Symposium on Operating Systems Design and Implementation (OSDI 2014), Broomfield, CO, October, 2014. .pdf Salameh, L., Zhushi, A., Handley, M., Jamieson, K., and Karp, B., HACK: Hierarchical ACKs for Efficient Wireless Medium Utilization, in the Proceedings of the 2014 USENIX Annual Technical Conference (USENIX ATC 2014), Philadelphia, PA, June, 2014. Winner of Best Paper Award. .pdf Yang, E., Stefan, D., Mitchell, J., Mazières, D., Marchenko, P., and Karp, B., Toward Principled Browser Security, in the Proceedings of the Fourteenth Workshop on Hot Topics in Operating Systems (HotOS XIV), Santa Ana Pueblo, NM, May, 2013. .pdf Gvozdiev, N., Karp, B., and Handley, M., LOUP: The Principles and Practice of Intra-Domain Route Dissemination, in the Proceedings of the Tenth USENIX Symposium on Networked Systems Design and Implementation (NSDI 2013), Lombard, IL, April, 2013. .pdf Gvozdiev, N., Karp, B., and Handley, M., LOUP: Who's Afraid of the Big Bad Loop?, in the Proceedings of the Eleventh ACM SIGCOMM Workshop on Hot Topics in Networks (HotNets 2012), Redmond, WA, October, 2012. .pdf Marchenko, P. and Karp, B., Structuring Protocol Implementations to Protect Sensitive Data, in the Proceedings of the Nineteenth USENIX Security Symposium (USENIX Security 2010), Washington, DC, August, 2010. .pdf Bittau, A., Marchenko, P., Handley, M., and Karp, B., Wedge: Splitting Applications into Reduced-Privilege Compartments, in the Proceedings of the Fifth USENIX/ACM Symposium on Networked System Design and Implementation (NSDI 2008), San Francisco, CA, April, 2008. .pdf Kim, Y.-J., Govindan, R., Karp, B., and Shenker, S., Lazy Cross-Link Removal for Geographic Routing, in the Proceedings of the Fourth ACM Conference on Embedded Networked Sensor Systems (SenSys 2006), November, 2006. .pdf Newsome, J., Karp, B., and Song, D., Paragraph: Thwarting Signature Learning by Training Maliciously, in the Proceedings of the Ninth International Symposium on Recent Advances in Intrusion Detection (RAID 2006), Hamburg, Germany, September, 2006. .pdf Garriss, S., Kaminsky, M., Freedman, M., Karp, B., Mazières, D., and Yu, H., Re: Reliable Email, in the Proceedings of the Third USENIX/ACM Symposium on Networked System Design and Implementation (NSDI 2006), San Jose, CA, May, 2006. .pdf Kim, Y.-J., Govindan, R., Karp, B., and Shenker, S., On the Pitfalls of Geographic Face Routing, in the Proceedings of the Third ACM/SIGMOBILE International Workshop on Foundations of Mobile Computing (DIAL-M-POMC 2005), Köln, Germany, September, 2005. .pdf Rhea, S., Godfrey, P.B., Karp, B., Kubiatowicz, J., Ratnasamy, S., Shenker, S., Stoica, I., and Yu, H., Open DHT: A Public DHT Service and Its Uses, in the Proceedings of the ACM SIGCOMM Conference on Computer Communications (SIGCOMM 2005), Philadelphia, PA, August, 2005. .pdf Newsome, J., Karp, B., and Song, D., Polygraph: Automatically Generating Signatures for Polymorphic Worms, in the Proceedings of the IEEE Symposium on Security and Privacy (Oakland 2005), Oakland, CA, May, 2005. .pdf Kim, Y.-J., Govindan, R., Karp, B., and Shenker, S., Geographic Routing Made Practical, in the Proceedings of the Second USENIX/ACM Symposium on Networked System Design and Implementation (NSDI 2005), Boston, MA, May, 2005. .pdf Gummadi, R., Kothari, N., Kim, Y.-J., Govindan, R., Karp, B., Shenker, S., Reduced-State Routing in the Internet, in the Proceedings of the Third ACM SIGCOMM Workshop on Hot Topics in Networks (HotNets 2004), San Diego, CA, November, 2004. .pdf Kim, H.-A. and Karp, B., Autograph: Toward Automated, Distributed Worm Signature Detection, in Proceedings of the 13th Usenix Security Symposium (Security 2004), San Diego, CA, August, 2004. .ps.gz .pdf A previous version of this work: Intel Research Pittsburgh Technical Report IRP-TR-04-03, February, 2004. Karp, B., Ratnasamy, S., Rhea, S., and Shenker, S., Spurring Adoption of DHTs with OpenHash, a Public DHT Service, in Proceedings of the 3rd International Workshop on Peer-to-Peer Systems (IPTPS 2004), Springer-Verlag Lecture Notes in Computer Science Hot Topics Series, February, 2004. .ps.gz .pdf Gibbons, P., Karp, B., Nath, S., Ke, Y., and Seshan, S., IrisNet: An Architecture for a Worldwide Sensor Web, in IEEE Pervasive Computing, Special Issue on Sensor and Actuator Networks, IEEE Press, October-December, 2003. Zhang, M., Karp, B., Floyd, S., and Peterson, L., RR-TCP: A Reordering-Robust TCP with DSACK, in Proceedings of the Eleventh IEEE International Conference on Networking Protocols (ICNP 2003), Atlanta, GA, November, 2003. .ps.gz .pdf An extended version of this work is available as: ICSI Technical Report TR-02-006, Berkeley, CA, July 2002. .ps.gz .pdf Ratnasamy, S., Karp, B., Shenker, S., Estrin, D., Govindan, R., Yin, L., and Yu, F., Data-Centric Storage in Sensornets with GHT, A Geographic Hash Table, in Mobile Networks and Applications (MONET), Special Issue on Wireless Sensor Networks, 8:4, Kluwer Academic",
  "content_length": 14113,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:58"
}