{
  "name": "Brais Cancela-Barizo",
  "homepage": "https://pdi.udc.es/en/File/Pdi/9Y9SH",
  "status": "success",
  "content": "Brais Cancela Barizo File. Department Computer Science and Information Technologies Knowledgment area Computational Science and Artificial Intelligence Research Research group Laboratorio de Investigación y Desarrollo en Inteligencia Artificial Research lines Machine Learning, Deep Learning, Convex Optimization, Computer Vision Contacto UDC directory Orcid id0000-0002-2295-4142 ResearcherIDM-7669-2019 Scopus36975028400 Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours AI in Big Data Environments Master's Degree in Artificial Intelligence Optional 0 10.5 Basic Algorithms of Artificial Intelligence Degree in Artificial Intelligence Compulsory 0 24 Deep Learning Degree in Artificial Intelligence Optional 0 21 Design and Analysis of Algorithms Degree in Data Science and Engineering Compulsory 0 45 Final Year Dissertation Degree in Data Science and Engineering Compulsory 0 4 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 52 Subject and involved studies Type Distance hours Total hours AI in Big Data Environments Master's Degree in Artificial Intelligence Optional 0 10.5 Basic Algorithms of Artificial Intelligence Degree in Artificial Intelligence Compulsory 0 22.5 Deep Learning Degree in Artificial Intelligence Optional 0 21 Design and Analysis of Algorithms Degree in Data Science and Engineering Compulsory 0 45 Final Year Dissertation Degree in Data Science and Engineering Compulsory 0 3.5 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 75 Large Scale Machine Learning Degree in Data Science and Engineering Optional 0 21 Subject and involved studies Type Distance hours Total hours Algorithms Degree in Computer Engineering Compulsory 0 23 Algorithms Degree in Artificial Intelligence Compulsory 0 20 Basic Algorithms of Artificial Intelligence Degree in Artificial Intelligence Compulsory 0 20 Design and Analysis of Algorithms Degree in Data Science and Engineering Compulsory 0 45 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 5.5 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 3 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 15 Machine Learning II Degree in Data Science and Engineering Compulsory 0 29 Machine Learning III Degree in Data Science and Engineering Compulsory 0 21 Subject and involved studies Type Distance hours Total hours Algorithms Degree in Computer Engineering Compulsory 0 17 Design and Analysis of Algorithms Degree in Data Science and Engineering Compulsory 0 45 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 8 Large Scale Machine Learning Degree in Data Science and Engineering Optional 0 6 Machine Learning II Degree in Data Science and Engineering Compulsory 0 29 Machine Learning III Degree in Data Science and Engineering Compulsory 0 21 Programming II Degree in Computer Engineering Core 0 44 Subject and involved studies Type Distance hours Total hours Algorithms Degree in Computer Engineering Compulsory 0 32 Design and Analysis of Algorithms Degree in Data Science and Engineering Compulsory 0 45 Human Machine Interfaces Degree in Computer Engineering Compulsory 0 60 Machine Learning II Degree in Data Science and Engineering Compulsory 0 21 Machine Learning III Degree in Data Science and Engineering Compulsory 0 21 Programming II Degree in Computer Engineering Core 0 24 Subject and involved studies Type Distance hours Total hours Computer Science Automation and Industrial Electronics Engineering Degree in Electrical Engineering Industrial Engineering Core 0 60 Human Machine Interfaces Degree in Computer Engineering Compulsory 0 60 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 44 Programming II Degree in Computer Engineering Core 0 44 Software Design Degree in Computer Engineering Compulsory 0 20 Tutoring 2025/2026 Defined tutoring by teacher for 2025/2026 academic course. Faculty of Computer Science Quarter Day Site 1st quarter Tuesday 12:00 a 14:00 Edificio Área Científica - D1.02 1st quarter Thursday 12:00 a 14:00 Edificio Área Científica - D1.02 1st quarter Friday 12:00 a 14:00 Edificio Área Científica - D1.02 EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2024/2025 2023/2024 2021/2022 2020/2021 2015/2016 2014/2015 DNA strand classification through different explainable machine learning models Efficient Architectures for LLMs: Study and Implementation of Mixture of Experts in Transformer Models Perceptual Latent Representations: Improving Visual Fidelity and Autonomous Control in World Models Robustness analysis of a dynamic feature selection model against adversarial attacks Dynamic feature selection model applied to a classification task. Deep learning language models for music analysis and generation Deep reinforcement learning for image classification Metrics to determine how difficult is to hack a Convolutional Neural Network Creation of a human re-identification system based in features Web Application for human behavior analysis in crowded scenes Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Papers in research journals Book chapters Conference papers 2023 2022 2020 2019 Funding entity Union Europea Main researches Francisco Javier González Varela, Manuel F. González Penedo Type Proyecto UE Dates From 01/09/2023 to 31/12/2025 Funding entity Ministerio de Ciencia e Innovación Main researches Cancela Barizo, Brais Type Proyecto Programas Nacionales Dates From 01/09/2022 to 31/08/2025 Funding entity Consellería de Educación Main researches Amparo Alonso Betanzos Type Proyecto Programas Autonomicos Dates From 01/01/2022 to 20/11/2025 Funding entity Ministerio de Ciencia e Innovación Main researches Verónica Bolón Canedo Type Proyecto Programas Nacionales Dates From 01/12/2022 to 30/11/2024 Funding entity Agencia Gallega de Innovación (GAIN) Main researches Ricardo Cao Abad Type Proyecto Programas Autonomicos Dates From 01/11/2020 to 31/12/2022 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Amparo Alonso Betanzos Type Proyecto Programas Autonomicos Dates From 01/01/2019 to 20/11/2021 2025 2024 2023 2022 2021 ... 2020 2014 2013 2012 2011 Authors Miguel Escarda-Fernández, Carlos Eiras-Franco, Brais Cancela, Bertha Guijarro-Berdiñas, Amparo Alonso-Betanzos Journal Expert Systems with Applications Vol. 58 (pages 111265. to 111265.) DOI https://doi.org/10.1016/j.eswa.2024.125647 Authors Jorge Paz-Ruza, Amparo Alonso-Betanzos, Bertha Guijarro-Berdiñas, B. Cancela, Carlos Eiras-Franco Journal IEEE Transactions on Neural Networks and Learning Systems Authors S.Abdullahi, K. Chamnongthai, V. Bolón-Canedo, B. Cancela Journal Expert Systems with Applications Authors Jorge Paz-Ruza, Amparo Alonso-Betanzos, Bertha Guijarro-Berdiñas, Carlos Eiras-Franco, B. Cancela Journal Information Fusion Vol. 111 (pages 102497 to 102497) DOI https://doi.org/10.1016/j.inffus.2024.102497 Authors Verónica Bolón-Canedo, Laura Morán-Fernández, B. Cancela, Amparo Alonso-Betanzos Journal Neurocomputing Authors A. Ezquerro, Brais Cancela, A. López-Cheda Journal Mathematics Vol. 11 Num. 19 DOI https://doi.org/10.3390/math11194150 Authors Brais Cancela, Verónica Bolón-Canedo, Amparo Alonso-Betanzos Journal IEEE TRANSACTIONS ON PATTERN ANALYSIS AND MACHINE INTELLIGENCE DOI https://doi.org/10.1109/tpami.2022.3228824. Authors Elena Hernandez-Pereira, Óscar Fontenla-Romero, Verónica Bolón-Canedo, Brais Cancela, Bertha Guijarro-Berdiñas, Amparo Alonso-Betanzos Journal APPLIED INTELLIGENCE Vol. 52 (pages 6413 to 6431) DOI https://doi.org/10.1007/s10489-021-02743-2 Authors Brais Cancela, Verónica Bolón-Canedo, Amparo Alonso-Betanzos, João Gama Journal Knowledge-Based Systems Vol. 192 (pages 105326-1 to 105326-13) Authors Brais Cancela, Amparo Alonso-Betanzos Journal IEEE TRANSACTIONS ON PATTERN ANALYSIS AND MACHINE INTELLIGENCE Authors T. Andrade, Brais Cancela, João Gama Journal EXPERT SYSTEMS DOI https://doi.org/10.1111/exsy.12627 Authors T. Andrade, Brais Cancela, João Gama Journal ANNALES DES TELECOMMUNICATIONS-ANNALS OF TELECOMMUNICATIONS Vol. 75 (pages 505 to 521) Authors Brais Cancela, M Ortega, M G Penedo Journal MACHINE VISION AND APPLICATIONS Vol. 25 Num. 2 (pages 511 to 527) DOI https://doi.org/10.1007/s00138-013-0544-7 Authors Sonia González Vázquez, Brais Cancela Barizo, Noelia Barreira Rodríguez, Manuel González Penedo, María Rodríguez Blanco, Marta Pena Seijo, Gabriel Coll de Tuero, María Antonia Barceló, Marc Saez Zafra Journal MACHINE VISION AND APPLICATIONS Vol. 24 Num. 5 (pages 919 to 930) DOI https://doi.org/10.1007/s00138-012-0442-4 Authors Brais Cancela Barizo, Marcos Ortega Hortas, Manuel González Penedo, Jorge Novo Buján, Noelia Barreira Rodríguez Journal Pattern Recognition Vol. 46 Num. 7 (pages 2015 to 2027) DOI https://doi.org/10.1016/j.patcog.2013.01.013 Authors Brais Cancela, Marcos Ortega Hortas, A. Fernández, M G Penedo Journal Expert Systems with Applications Vol. 40 Num. 4 (pages 1116 to 1131) DOI https://doi.org/10.1016/j.eswa.2012.08.025 Authors A. Fernández, M Ortega, Brais Cancela, M G Penedo, C. Vázquez, L.M. Gigirey Journal Expert Systems with Applications Vol. 39 (pages 12683 to 12696) Authors Brais Cancela, Marcos Ortega Hortas, Alba Fernandez, M G Penedo Journal LECTURE NOTES IN COMPUTER SCIENCE Vol. 6979 (pages 50 to 59) Authors B. Cancela, Marcos Ortega Hortas, M G Penedo, A. Fernandez Journal LECTURE NOTES IN COMPUTER SCIENCE Vol. 6753 (pages 416 to 425) Authors M.G. Penedo, Alba Fernandez, Marcos Ortega Hortas, Brai",
  "content_length": 12901,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:04"
}