{
  "name": "Branislav Bosanský",
  "homepage": "https://sites.google.com/site/bbosansky",
  "status": "success",
  "content": "Branislav BosanskySearch this siteEmbedded FilesSkip to main contentSkip to navigationBranislav BosanskyCurrent AffiliationAssistant Professor at Department of Computer Science, Faculty of Electrical Engineering, Czech Technical University in Praguebosansky at fel.cvut.czSenior Research Scientist at Avast Softwarebranislav dot bosansky at avast.com CVCurrent Research Topics and Interestsalgorithmic and computational game theory, extensive-form games, stochastic games, computing Stackelberg equilibriaMaterialsGameSec 2018 tutorial on Algorithms for Solving Dynamic Games with Imperfect Information PDFSelected publicationsworking papers and topicsEquilibrium Computation in (Partially Observable) Dynamic Stochastic Games2020Automated Construction of Bounded-Loss Imperfect-Recall Abstractions in Extensive-Form GamesJ. Cermak, V. Lisy, B. Bosansky, Artificial Intelligence (link), extended abstract @ IJCAI 2020, PDF Dinkelbach-Type Algorithm for Computing Quantal Stackelberg EquilibriumJ. Cerny, V. Lisy, B. Bosansky, B. An, IJCAI 2020, PDF Finite State Machines Play Extensive-Form Games J. Cerny, B. Bosansky, B. An, EC 2020, PDF Discovering Imperfectly Observable Adversarial Actions using Anomaly DetectionO. Petrova, K. Durkota, G. Alperovich, K. Horak, M. Najman, B. Bosansky, V. Lisy, extended abstract @AAMAS 2020, full version2019Tackling Sequential Attacks in Security GamesT. Nguyen, A. Yadav, B. Bosansky and Y. Liang, GameSec 2019Hardening Networks Against Strategic Attackers Using Attack Graph GamesK. Durkota, V. Lisy, B. Bosansky, C. Kiekintveld, M. Pechoucek, Computers & Security, 2019Optimizing Honeypot Strategies Against Dynamic Lateral Movement Using Partially Observable Stochastic GamesK. Horak, B. Bosansky, P. Tomasek, C. Kiekintveld, C. Kamhoua, Computers & Security, 2019Compact Representation of Value Function in Partially Observable Stochastic GamesK. Horak, B. Bosansky, C. Kiekintveld, C. Kamhoua, IJCAI 2019, PDFSolving Partially Observable Stochastic Games with Public Observations. K. Horak, B. Bosansky, AAAI Conference on Artificial Intelligence, 2019, PDFWhen Players Affect Target Values: Modeling and Solving Dynamic Partially Observable Security GamesX. Wang, M. Tambe, B. Bosansky, B. An, OptMAS workshop @AAMAS 2019, GameSec 2019 PDFEvaluating Models of Human Behavior in an Adversarial Multi-Armed Bandit ProblemM. Gutierrez, J. Černý, N. Ben-Asher, E. Aharonov, A. Basak, B. Bošanský, C. Kiekintveld, and C. Gonzalez, CogSci 2019, OptMAS workshop @AAMAS 2019, PDF2018 Approximating maxmin strategies in imperfect recall games using A-loss recall propertyJ. Cermak, B. Bosansky, K. Horak, V. Lisy, M. Pechoucek, International Journal of Approximate Reasoning, 2018, linkConstructing Imperfect Recall Abstractions to Solve Large Extensive-Form GamesJ. Cermak, V. Lisy, B. Bosansky, under review, 2018, PDFGoal-HSVI: Heuristic Search Value Iteration for Goal-POMDPsK. Horak, B. Bosansky, K. Chatterjee, IJCAI 2018, Incremental Strategy Generation for Stackelberg Equilibria in Extensive-Form GamesJ. Cerny, B. Bosansky, C. Kiekintveld, EC 2018, 2017Heuristic Search Value Iteration for One-Sided Partially Observable Stochastic GamesK. Horak, B. Bosansky, M. Pechoucek. AAAI 2017, PDFCombining Incremental Strategy Generation and Branch and Bound Search for Computing Maxmin Strategies in Imperfect Recall GamesJ. Cermak, B. Bosansky, M. Pechoucek. AAMAS 2017, PDFAn Algorithm for Constructing and Solving Imperfect Recall Abstractions of Large Extensive-Form GamesJ. Cermak, B. Bosansky, V. Lisy. IJCAI 2017, PDFComparing Strategic Secrecy and Stackelberg Commitment in Security GamesQ. Guo, B. An, B. Bosansky, C. Kiekintveld. IJCAI 2017, PDFComputation of Stackelberg Equilibria of Finite Sequential Games B. Bosansky, S. Branzei, K. A. Hansen, T. B. Lund, P. B. Miltersen; ACM TEAC 2017; PDFManipulating Adversary’s Belief: A Dynamic Game Approach to Deception by Design for Proactive Network Security K. Horak, Q. Zhu, B. Bosansky ; GameSec 2017; PDFComputation of Stackelberg Equilibria of Finite Sequential Games K Durkota, V Lisy, C Kiekintveld, K Horak, B Bosansky, T Pevny; GameSec 2017; PDF2016Using Correlated Strategies for Computing Stackelberg Equilibria in Extensive-Form GamesJ. Cermak, B. Bosansky, K. Durkota, V. Lisy, C. Kiekintveld; AAAI 2016, PDF Algorithms for Computing Strategies in Two-Player Simultaneous Move Games B.Bosansky, V. Lisy, M. Lanctot, J. Cermak, M. Winands; Artificial Intelligence (AIJ) 2016; linkA Point-Based Approximate Algorithm for One-Sided Partially Observable Pursuit-Evasion Games K. Horak, B.Bosansky, GameSec 2016, PDFCase Studies of Network Defense with Attack Graph GamesK. Durkota, V. Lisy, C. Kiekintveld, B. Bosansky, M. Pechoucek; IEEE Intelligent Systems; 20162015Combining Compact Representation and Incremental Generation in Large Games with Sequential StrategiesB. Bosansky, A.X. Jiang, M. Tambe, C. Kiekintveld; AAAI 2015; PDFSequence-Form Algorithm for Computing Stackelberg Equilibria in Extensive-Form Games B. Bosansky, J. Cermak; AAAI 2015; PDFStrategy Effectiveness of Game-Theoretical Solution Concepts in Extensive-Form General-Sum Games (Extended Abstract) J. Cermak, B. Bosansky, N. Gatti; AAMAS 2015; PDF, full OPTMAS versionGame-Theoretic Algorithms for Optimal Network Security Hardening Using Attack Graphs (Extended Abstract) K. Durkota, V. Lisy, C. Kiekintveld, B. Bosansky; AAMAS 2015; PDF, full ACySe versionOptimal Network Security Hardening Using Attack Graph Games K. Durkota, V. Lisy, B. Bosansky, C. Kiekintveld; IJCAI 2015; PDFApproximate Solutions for Attack Graph Games with Imperfect InformationK. Durkota, V. Lisy, B. Bosansky, C. Kiekintveld; GameSec 2015Computation of Stackelberg Equilibria of Finite Sequential Games B. Bosansky, S. Branzei, K. A. Hansen, P. B. Miltersen, T. B. Sørensen; WINE 2015; PDF2014Practical Performance of Refinements of Nash Equilibria in Extensive-Form Zero-Sum GamesJ. Cermak, B. Bosansky, V. Lisy; ECAI 2014; PDFAn Exact Double-Oracle Algorithm for Zero-Sum Extensive-Form Games with Imperfect InformationB. Bosansky, C. Kiekintveld, V. Lisy, M. Pechoucek; Journal of Artificial Intelligence Research (JAIR) 2014; PDFSolving Adversarial Patrolling Games With Bounded Error (Extended Abstract)M. Abaffy, T. Brazdil, V. Rehak, B. Bosansky, A. Kucera, J. Krcal; AAMAS 2014; PDFIterative Algorithms for Solving Finite Sequential Zero-Sum GamesB. Bosansky; PhD thesis, 2014; PDF2013Using Double-oracle Method and Serialized Alpha-Beta Search for Pruning in Simultaneous Moves GamesB. Bosansky, V. Lisy, J. Cermak, R. Vitek, M. Pechoucek; IJCAI 2013; PDFDouble-oracle Algorithm for Computing an Exact Nash Equilibrium in Zero-sum Extensive-form GamesB. Bosansky, C. Kiekintveld, V. Lisy, J. Cermak, M. Pechoucek; AAMAS 2013; PDFSolving Extensive-form Games with Double-oracle Methods (Extended Abstract)B. Bosansky; AAMAS 2013; PDFConvergence of Monte Carlo Tree Search in Simultaneous Move GamesV. Lisy, V. Kovarik, M. Lanctot, B. Bosansky; NIPS 2013; PDF2012Game-theoretic Resource Allocation for Malicious Packet Detection in Computer NetworksO. Vanek, Z. Yin, M. Jain, B. Bosansky, M. Tambe, M. Pechoucek; AAMAS 2012; PDFTactical Operations of Multi-Robot Teams in Urban Warfare (Demonstration)P. Novak, A. Komenda, V. Lisy, B. Bosansky, M. Cap, M. Pechoucek; AAMAS 2012; PDFAnytime Algorithms for Multi-agent Visibility-based Pursuit-evasion Games (Extended Abstract)V. Lisy, B. Bosansky, M. Pechoucek; AAMAS 2012; PDFIterative Algorithm for Solving Two-player Zero-sum Extensive-form Games with Imperfect InformationB. Bosansky, C. Kiekintveld, V. Lisy, M. Pechoucek; ECAI 2012; PDFGame-theoretic Approach to Adversarial Plan RecognitionV. Lisy, R. Pibil, J. Stiborek, B. Bosansky, M. Pechoucek; ECAI 2012; PDFExtending Security Games to Defenders with Constrained MobilityO. Vanek, B. Bosansky, M. Jakob, V. Lisy, M. Pechoucek; AAAI Symposium on GTSSH 2012; PDFStrategy Representation Analysis for Patrolling GamesB. Bosansky, O. Vanek, M. Pechoucek; AAAI Symposium on GTSSH 2012; PDFGame Theoretic Model of Strategic Honeypot Selection in Computer NetworksR. Pibil, V. Lisy, C. Kiekintveld, B. Bosansky; GameSec 2012; PDF2011AgentC: Agent-Based System for Securing Maritime Transit (Demonstration)O. Vanek, M. Jakob, B. Bosansky, O. Hrstka, M. Pechoucek; AAMAS 2011; PDFIterative Game-Theoretic Route Selection for Hostile area Transit and Patrolling (Extended Abstract)O. Vanek, M. Jakob, V. Lisy, B. Bosansky, M. Pechoucek; AAMAS 2011; PDFComputing Time-Dependent Policies for Patrolling Games with Mobile TargetsB. Bosansky, V. Lisy, M. Jakob, M. Pechoucek; AAMAS 2011; PDFolderTransiting Areas Patrolled by a Mobile AdversaryO. Vanek, B. Bosansky, M. Jakob, M. Pechoucek; CIG 2010; PDFAgent Subset Adversarial Search for Complex Non-cooperative DomainsV. Lisy, B. Bosansky, R. Vaculin, M. Pechoucek; CIG 2010; PDFAdversarial Search with Procedural Knowledge HeuristicV. Lisy, B. Bosansky, M. Jakob, M. Pechoucek; AAMAS 2009; PDFGoogle SitesReport abuseGoogle SitesReport abuse",
  "content_length": 9060,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:04"
}