{
  "name": "Brandon Lucia",
  "homepage": "http://brandonlucia.com",
  "status": "success",
  "content": "\"Brandon Lucia - Brandon M. Lucia [My CV] Kavčić-Moura Professor of ECE @ Carnegie Mellon University Office: CIC 4114 Robert Mehrabian Collaborative Innovation Center (CIC) 4720 Forbes Avenue Pittsburgh, PA 15213 Email: blucia [ at ] andrew [ dot ] cmu [ dot ] edu science.music. Hello! I am the CEO and co-Founder of Efficient Computer Company and a Full Professor in the department of electrical and computer engineering at Carnegie Mellon University. I do research on the boundary between computer architecture, computer systems, and programming languages. I lead the abstract research group. I am always looking for graduate students who are excited about computer architecture, systems, and programming languages research. Apply to CMU ECE if you are an inspired, curious person and we can work together! Here are some of my current research interests: Defining Intermittent Computing We need to make intermittent computing devices that harvest energy from their environment, programmable, reliable, and robust to common-case power failures. These devices are really exciting because they are a great fit for sensing, medical implants, \"extreme\" scenarios (like outer space!) and lots of other things. Watch this video for a 3 minute overview of our work on intermittent computing. Safe & Efficient Computing at the Edge We need better software and architectures to make parallel computers correct and efficient. At the \"edge\", computers need to handle the landslide of sensor data that systems must constantly process. The constraints of the edge make the problem especially interesting. How do we efficiently process a graph with a hundred billion nodes on a single machine? How do we reliably process 16 4k video streams using a constellation of highly physically-constrained nanosatellites? Watch this video for a 3 minute overview of our work on edge computing in space! If you found me here, ignore that webpage, which never gets updated. I am blucia0a on Twitter and github I made the Chango. Check it out. I was interviewed by TheSetup and Popular Science. Our work got written up in CACM: A Battery-free Internet of Things I got the NSF CAREER Award in 2017, the IEEE TCCA Young Computer Architect Award in 2019, and the Sloan Foundation Fellowship in 2021. 🍔🍔🍔🍔🍔 Publications My publications are available on Google Scholar and in the list below. Orbital Edge Computing Nanosatellite Constellation and Ground Station Co-design for Low-Latency Critical Event Detection Zhuo Cheng and Brandon Lucia ArXiv 2025 [paper] Geoduck: Nanosatellite Constellation Scheduling for Low Latency Event Detection Zhuo Cheng and Brandon Lucia SenSys 2025 [] VINSat: Solving the Lost-in-Space Problem with Visual-Inertial Navigation Kyle McCleary, Swaminathan Gurumurthy, Paulo R.M. Fisch, Saral Tayal, Zachary Manchester, Brandon Lucia ICRA 2024 [paper] Lost in Space: Visual Satellite Navigation K McCleary, PRM Fisch, S Tayal, Z Manchester, B Lucia Active Methods in Autonomous Navigation Workshop (at ICRA 2023) [] EagleEye: Actuation-aware Scheduling for High-coverage High-resolution Satellite Imaging ConstellationsZhuo Cheng, Bradley Denby, Brandon LUciaASPLOS 2024 [paper] Kodan: Addressing the Computational Bottleneck in SpaceBradley Denby, Krishna Chintalapudi, Ranveer Chandra, Brandon Lucia, Shadi NoghabiASPLOS 2023 [paper] Tartan Artibeus: A Batteryless, Computational Satellite Research PlatformBradley Denby, Emily Ruppel, Vaibhav Singh, Shize Che, Chad Taylor, Fayyaz Zaidi, Swarun Kumar, Zac Manchester, Brandon Lucia36th Annual Small Satellite Conference (SmallSat) 2022 [paper] Computer Architecture Research in SpaceBrandon LuciaACM SIGARCH Blog [blog post] Computational Nanosatellite Constellations: Opportunities and ChallengesBrandon Lucia, Bradley Denby, Zachary Manchester, Harsh Desai, Emily Ruppel, Alexei ColinACM GetMobile: Mobile Computing and Communications, Volume 25, Issue 1 [paper] Orbital Edge Computing: Nanosatellite Constellations as a New Class of Computing SystemBradley Denby and Brandon LuciaASPLOS 2020 [paper][website][music (c/o nc)]ASPLOS 2020 Best Paper Award Orbital Edge Computing: Data Processing on NanosatellitesBradley Denby and Brandon LuciaComputer Architecture Letters March 2019 [paper] Selected for Best of CAL in 2019Featured in IEEE Computer 2020.04 \"Spotlight on Transactions\" Spatial Dataflow Architecture 🐝🐝🐝🐝🐝 NUPEA: Optimizing Critical Loads on Spatial Dataflow Architectures via Non-Uniform Processing-Element Access Souradip Ghosh, Graham Gobieski, Keyi Zhang, Brandon Lucia, Nathan Beckmann, Tony Nowatzki ISCA 2025 [paper] Ripple: Asynchronous Programming for Spatial Dataflow Architectures Souradip Ghosh, Yufei Shi, Brandon Lucia, Nathan Beckmann PLDI 2025 [paper] Monza: An Energy-Minimal, General-Purpose Dataflow SoC for the Internet of Things Nathan Beckmann, Brandon Lucia, Graham Gobieski, Tony Nowatzki, Thomas Jackson, Guénolé Lallement, Keyi Zhang, Amolak Nagi, Atharv Sathe, Harsh Desai IEEE MICRO 2024 [paper] MANIC: A 19\tμW@4MHz, 256 MOPS/mW, RISC-V microcontroller with embedded MRAM main memory and vector-dataflow co-processor in 22nm bulk finFET CMOS Graham Gobieski, Oguz Atli, Cagri Erbagci, Ken Mai, Nathan Beckmann, Brandon LuciaISCAS 2023 [paper] Pipestitch: An Energy-Minimal Dataflow Architecture with Lightweight Threads Nathan Serafin, Souradip Ghosh, Harsh Desai, Brandon Lucia, Nathan Beckmann MICRO 2023 [paper] RipTide: A programmable, energy-minimal dataflow compiler and architectureGraham Gobieski, Souradip Ghosh, Tony Nowatzki, Todd C. Mowry, Nathan Beckmann, Brandon LuciaMICRO 2022 [] SNAFU: An Ultra-low-power CGRA-generation Framework and ArchitectureGraham Gobieski, Ahmet Oguz Atli, Kenneth Mai, Brandon Lucia, Nathan BeckmannISCA 2021 [paper] The Role of Edge Offload for Hardware-Accelerated Mobile DevicesMahadev Satyanarayanan, Nathan Beckmann, Grace A. Lewis, Brandon LuciaHotMobile 2021 [paper ] MANIC: An Energy-Efficient, Parallel Architecture for Ultra-Low-Power Embedded SystemsGraham Gobieski, Amolak Nagi, Nathan Serafin, Mehmet Meric Isgenc, Nathan Beckmann, and Brandon LuciaMICRO 2019 [paper] We taped out a MANIC [test chip]! Intermittent Computing The Internet of Batteryless Things Saad Ahmed, Bashima Islam, Kasim Sinan Yildirim, Marco Zimmerling, Przemys¿aw Pawe¿czak, Muhammad Hamad Alizai, Brandon Lucia, Luca Mottola, Jacob Sorber, and Josiah Hester CACM February 2024 [paper] Architectures and Platforms for Intermittent Computing Energy-aware Scheduling and Input Buffer Overflow Prevention for Energy-harvesting Systems Harsh Desai, Xinye Want, Brandon Lucia ASPLOS 2025 [paper] A Hardware-Software Interface for Charge Management in Energy-Harvesting SystemsEmily Ruppel, Milijana Surbatovich, Harsh Desai, Kiwan Maeng, Brandon LuciaMICRO 2022 [paper] Camaroptera: A Long-Range Image Sensor with Local Inference for Remote Sensing ApplicationsHarsh Desai, Matteo Nardello, Davide Brunelli, Brandon LuciaIEEE Transactions on Embedded Computer Systems (TECS) [paper] Power-aware Heterogeneous Architecture Scaling for Energy-harvesting computersHarsh Desai and Brandon LuciaComputer Architecture Letters 2020 [paper ] Camaroptera: A Batteryless Long-Range Remote Visual Sensing SystemMatteo Nardello, Harsh Desai, Davide Brunelli, Brandon LuciaENSsys 2019 [paper] A Reconfigurable Energy Storage Architecture for Energy-harvesting DevicesAlexei Colin, Emily Ruppel, Brandon LuciaASPLOS 2018 [paper] ASPLOS 2018 Best Paper Award and IEEE MICRO Top Picks 2018 Honorable Mention Software Systems and Programming Support for Intermittent Computing A Type System for Safe Intermittent ComputingMilijana Surbatovich, Naomi Spargo, Limin Jia, Brandon Lucia PLDI 2023 [paper] Automatically Enforcing Freshness and Consistency of Inputs in Intermittent SystemsMilijana Surbatovich, Limin Jia, Brandon LuciaPLDI 2021 [paper] Toward a Formal Foundation for Intermittent ComputingMilijana Surbatovich, Brandon Lucia, and Limin JiaOOPSLA 2020 [paper] Adaptive Low-Overhead Scheduling for Periodic and Reactive Intermittent ExecutionKiwan Maeng and Brandon LuciaPLDI 2020 [paper] Dynamic Task-Based Intermittent Execution for Energy-Harvesting DevicesAmjad Yousef Majid, Carlo Delle Donne, Kiwan Maeng, Alexei Colin, Kasim Sinan Yldirim, Brandon Lucia, Przemełsaw PawełczakTransactions on Sensor Networks, January 2020 [paper] Transactional Concurrency for Intermittent SystemsEmily Ruppel and Brandon LuciaPLDI 2019 [paper][slides] Supporting Peripherals in Intermittent Systems with Just-In-Time CheckpointsKiwan Maeng and Brandon LuciaPLDI 2019 [paper][slides] Intelligence Beyond the Edge: Inference on Intermittent Embedded SystemsGraham Gobieski, Brandon Lucia, and Nathan BeckmannASPLOS 2019 [paper][slides] Adaptive Dynamic Checkpointing for Safe Efficient Intermittent ComputingKiwan Maeng and Brandon LuciaOSDI 2018 [paper][slides] Intermittent Deep Neural Network InferenceGraham Gobieski, Nathan Beckmann, and Brandon LuciaSysML 2018 [paper] Alpaca: Intermittent Execution Without CheckpointsKiwan Maeng, Alexei Colin, Brandon LuciaOOPSLA 2017 [paper] Chain: Tasks and Channels for Reliable Intermittent ProgramsAlexei Colin, Brandon LuciaOOPSLA 2016 [paper] [ press:UPI, phys.org, Energy Daily, TechDotMatrix, The Green Optimistic ] A Simpler, Safer Programming and Execution Model for Intermittent SystemsBrandon Lucia, Benjamin RansfordPLDI 2015[paper][Try DINO!][video abstract] Debugging and Toolchain Support for Intermittent Systems I/O Dependent Idempotence Bugs in Intermittent SystemsMilijana Surbatovich, Limin Jia, and Brandon LuciaOOPSLA 2019 [paper][slides] Termination Checking and Task Decomposition for Task-Based Intermittent ProgramsAlexei Colin and Brandon LuciaCC 2018 [paper] An Energy-Aware Debugger for Intermittently Powered SystemsAlexei Colin, Graham Harvey, Alanson Sample, Brandon LuciaIEEE MICRO, 2017 vol. 37 - Top Picks in Computer Architecture [paper] An Energy-interference-free Hardware/Software Debugger for Intermittent Energy-h",
  "content_length": 20510,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:04"
}