{
  "name": "Brenna D. Argall",
  "homepage": "http://www.eecs.northwestern.edu/~argall",
  "status": "success",
  "content": "Brenna D. Argall BRENNA D. ARGALL Associate Professor of Computer Science, Mechanical Engineering and Physical Medicine & Rehabilitation Northwestern University Faculty Research Scientist, Rehabilitation Institute of Chicago (now the Shirley Ryan AbilityLab) VITAE I am an Associate Professor of Rehabilitation Robotics at Northwestern University, affiliated with the Departments of Computer Science, Mechanical Engineering and Physical Medicine & Rehabilitation. I also am a Research Scientist at the Rehabilitation Institute of Chicago (now the Shirley Ryan AbilityLab), the nation's premier rehabilitation hospital. I am a receipient of the NSF Early Faculty CAREER Award, and was named on of the 40 under 40 by Crain's Chicago Business. The assistive & rehabilitation robotics laboratory (argallab) strives to advance human ability by leveraging robotics autonomy. I am the founder and director of the argallab, which is located at the Rehabilitation Institute of Chicago. Here is a quick video blurb on what we are about and a longer seminar about our work. Please visit the argallab website for current project details and publications. For information about open positions within my research group, visit this link. TEACHING EECS 495: Machine Learning & Artifiical Intelligence for Robotics. F19, F16, F14, S13 and S12. EECS 295: Introductory Robotics Laboratory. F17, F16, F15, F14, W14 and W13. Course website. I am also affiliated faculty with the Center for Robotics and Biosystems at Northwestern, and a faculty advisor for our new Masters of Science in Robotics program. PRIOR RESEARCH For project details and publications from my dissertation at CMU and postdoc at EPFL, please visit the topic links below. Robot Learning Retired Research Topics CONTACT Electrical Engineering and Computer Science, Northwestern University, 2145 Sheridan Rd, Tech. Inst. Rm L359, Evanston IL, 60208, USA brenna.argall_at_northwestern_dot_edu ::  +1 847 467 0862 Last updated: 7 December 2016",
  "content_length": 1988,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:10"
}