{
  "name": "Brendan O'Connor 0001",
  "homepage": "http://brenocon.com",
  "status": "success",
  "content": "Brendan T. O'Connor - UMass Amherst, Computer Science Brendan T. O'Connor Associate Professor, College of Information and Computer Sciences Associate Director, Computational Social Science Institute University of Massachusetts Amherst brenocon@cs.umass.edu, @brendan642, @brenocon.bsky.social Office: CSB W238, 140 Governors Drive, Amherst, MA 01003 I am an associate professor in the College of Information and Computer Sciences at UMass Amherst. My group is the SLANG Lab, part of UMass NLP. I am also an associate director of the Computational Social Science Institute, and affiliated with the UMass CogSci and the Centers for Data Science and Intelligent Information Retrieval. Links: CV, Bio, Teaching, Talks, Notes, Misc. Some current things: For Fall 2025, I'm teaching CS 685, Advanced Natural Language Processing. (See also my previous teaching.) Some current/recent collaborative projects: Co-Insights: Fostering community collaboration to combat misinformation. We are part of the UMass team, in a multi-site project with several other institutions. Understanding variation in African American Language: Corpus and prosodic fieldwork perspectives with Kristine Yu, Lisa Green, and Meghan Armstrong-Abrami; see also our earlier work in disparities in natural language processing. Analyzing Cross-country Bias in News Coverage of International Conflicts and Disasters, 2023 Interdisciplinary Research Grant Project, with Przemyslaw Grabowicz, Ethan Zuckerman, and Paul Musgrave. SaTC: Identifying the Demographic Representativeness of Social Media Polls, with Przemyslaw Grabowicz. Leveraging Large Language Models to Provide Clinically Feasible Tools for Assessing Discourse in Individuals with Communication Impairments, 2024 Interdisciplinary Research Grant Project, with Jacquie Kurland and Anna Liu. Research: What can statistical text analysis tell us about society? I develop text analysis methods that can help answer social science questions. I'm interested in statistical machine learning and natural language processing, especially when informed by or applied to areas like political science or sociolinguistics. My work often uses text data from news and social media. There is a rich set of other faculty at UMass interested in areas from computational social science to natural language processing. See the Computational Social Science Institute (CSSI) website, and UMass NLP affiliates. Background: I joined UMass after receiving my PhD from Carnegie Mellon University's Machine Learning Department. I have also been a Visiting Fellow at Harvard IQSS, and interned with the Facebook Data Science team. Before grad school, I worked on crowdsourced annotations at CrowdFlower / Dolores Labs, and natural language search at Powerset. I started studying the intersection of AI and social science as an undergrad/masters student in Stanford Symbolic Systems (cognitive science, more or less). Link: Full bio. Papers/Publications (For others, see Google Scholar or my CV.) δ-Stance: A large scale real world dataset of stances in legal argumentation. Ankita Gupta, Douglas Rice, and Brendan O'Connor. Proceedings of ACL 2025. Data (github). Earlier version presented at ACM Symposium on CS&Law 2025 (slides). Automated main concept generation for narrative discourse assessment in aphasia. Ankita Gupta, Marisa Hudspeth, Polly Stokes, Jacquie Kurland, and Brendan O'Connor. Findings of ACL 2025. Data/code (github). Earlier version presented at Clinical Aphasiology Conference 2025. Large Language Models' Ability to Assess Main Concepts in Story Retelling: A Proof-of-Concept Comparison of Human Versus Machine Ratings. Jacquie Kurland, Vishnupriya Varadharaju, Anna Liu, Polly Stokes, Ankita Gupta, Marisa Hudspeth, and Brendan O'Connor. American Journal of Speech-Language Pathology. Mar. 2025. Relation Extraction Across Entire Books to Reconstruct Community Networks: The AffilKG Datasets. Erica Cai, Sean McQuade, Kevin L. Young, and Brendan O'Connor. arXiv:2505.10798, May 2025. Identifying and Investigating Global News Coverage of Critical Events Such as Disasters and Terrorist Attacks. Erica Cai, Xi Chen, Reagan Grey Keeney, Ethan Zuckerman, Brendan O'Connor, and Przemyslaw A. Grabowicz. In ICWSM 2025. (AAAI Conference on Web and Social Media) Also presented at IC2S2 2025. Multilingualism, Transnationality, and K-pop in the Online #StopAsianHate Movement. Tessa Masis and Zhangqi Duan, Weiai Xu, Jane Pyo, Ethan Zuckerman, and Brendan O'Connor. In WebSci 2025. \"Let Me Just Interrupt You\": Estimating Gender Effects in Supreme Court Oral Arguments. Erica Cai, Ankita Gupta, Katherine A. Keith, Brendan O'Connor, and Douglas Rice. Journal of Law and Courts, Mar. 2025. Earlier version: SocArXiv preprint, Feb. 2023. Earlier version presented at New Directions in Analyzing Text as Data (TADA 2022), titled Quantifying the Causal Effect of Gender on Interruptions in Supreme Court Oral Arguments. Github repository Press coverage: Axios, Balls and Strikes, Strict Scrutiny A Semantic Parsing Algorithm to Solve Linear Ordering Problems. Maha Alkhairy, Vincent Homer, and Brendan O'Connor. arXiv:2502.08415, Feb 2025. Harnessing Toulmin's theory for zero-shot argument explication. Ankita Gupta, Ethan Zuckerman, and Brendan O'Connor. Proceedings of ACL 2024. Also plenary lightning talk (slides) at IC2S2 2024, for extended abstract titled \"Making sense of public participation in rulemaking using argument explication\" (Gupta, Zuckerman, and O'Connor). The State of Relation Extraction Data Quality: Is Bigger Always Better? Erica Cai and Brendan O'Connor. Findings of ACL 2024. Latin Treebanks in Review: An Evaluation of Morphological Tagging Across Time. Marisa Hudspeth, Brendan O'Connor, and Laure Thompson. First Workshop on Machine Learning for Ancient Languages (ML4AL), 2024. Where on Earth Do Users Say They Are?: Geo-Entity Linking for Noisy Multilingual User Input. Tessa Masis and Brendan O'Connor. NLP+CSS Workshop at NAACL 2024. Also panel talk at IC2S2 2024 for extended abstract. Evaluating Zero-Shot Event Structures: Recommendations for Automatic Content Extraction (ACE) Annotations. Erica Cai and Brendan O'Connor. Proceedings of ACL 2023. A Monte Carlo Language Model Pipeline for Zero-Shot Sociopolitical Event Extraction. Erica Cai and Brendan O'Connor. arXiv:2305.15051. NeurIPS 2023 Workshop on Instruction Tuning and Instruction Following. Also presented at New England Natural Language Processing, 2023. ezCoref: Towards Unifying Annotation Guidelines for Coreference Resolution. Ankita Gupta, Marzena Karpinska, Wenlong Zhao, Kalpesh Krishna, Jack Merullo, Luke Yeh, Mohit Iyyer, and Brendan O'Connor. Findings of ACL: EACL 2023. Also earlier arxiv version (2022) Examining Political Rhetoric with Epistemic Stance Detection. Ankita Gupta, Su Lin Blodgett, Justin H. Gross, and Brendan O'Connor. NLP+CSS workshop at EMNLP 2022 (Proceedings of the Fifth Workshop on Natural Language Processing and Computational Social Science) A large-scale Twitter-based exploration of morphosyntactic geographic variation in African American English. Tessa Masis, Chloe Eggleston, Anissa Neal, Lisa Green, and Brendan O'Connor. Abstract presented at New Ways of Analyzing Variation (NWAV50), 2022. Cross-Dialect Social Media Dependency Parsing for Social Scientific Entity Attribute Analysis. Chloe Eggleston and Brendan O'Connor. Proceedings of the Workshop on Noisy User-generated Text (W-NUT) at COLING 2022. Link: Code repository, including paper erratum. Corpus-Guided Contrast Sets for Morphosyntactic Feature Detection in Low-Resource English Varieties. Tessa Masis, Anissa Neal, Lisa Green, and Brendan O'Connor. Proceedings of the 1st Field Matters Workshop on NLP Applications to Field Linguistics, at COLING 2022. Link: Code repository Paying Attention to the Algorithm Behind the Curtain. Arun Dunna, Katherine A. Keith, Ethan Zuckerman, Narseo Vallina-Rodriguez, Brendan O'Connor, and Rishab Nithyanand. Proceedings of the 2022 ACM Conference on Computer Supported Cooperative Work (ACM CSCW 2022). ClioQuery: Interactive Query-Oriented Text Analytics for Comprehensive Investigation of Historical News Archives. Abram Handler, Narges Mahyar, and Brendan O'Connor. ACM Transactions on Interactive Intelligent Systems, 2022. Runner-up for the ACM TiiS 2022 Best Paper Award. Links: ACM, arxiv Text as Causal Mediators: Research Design for Causal Estimates of Differential Treatment of Social Groups via Language Aspects. Katherine A. Keith, Douglas Rice, and Brendan O'Connor. First Workshop on Causal Inference & NLP (CI-NLP) at EMNLP 2021. Abstract presented at 11th Annual Conference on New Directions in Analyzing Text as Data (TADA 2021). Challenges in Detecting Null Relativizers in African American Language for Sociolinguistic and Psycholinguistic Applications. Anissa Neal, Brendan O'Connor, and Lisa Green. Abstract presented at the UnImplicit workshop at ACL-IJCNLP 2021. Corpus-Level Evaluation for Event QA: The IndiaPoliceEvents Corpus Covering the 2002 Gujarat Violence. Andrew Halterman, Katherine A. Keith, Sheikh Muhammad Sarwar, and Brendan O'Connor. Findings of ACL 2021. Also presented at the CASE workshop at ACL-IJCNLP 2021 Data and code, arxiv version (obsolete) How white is the global elite? An analysis of race, gender and network structure. Kevin L. Young, Seth K. Goldman, Brendan O'Connor, and Tuugi Chuluun. Global Networks. 2021. Honorable Mention, Political Ties Award for Best Published Article in 2021, APSA Political Networks section. See Kevin and Tuugi's article about this work at The Conversation. Links: Journal, PDF Uncertainty over Uncertainty: Investigating the Assumptions, Annotations, and Text Measurements of Economic Policy Uncertainty. Katherine A. Keith, Christoph Teichmann, Brendan O'Connor, and Edgar Meij. NLP+CSS workshop at EMNLP 2020 (Proceedings of the Fourth Workshop on Natural Language Processing and Computational Social Science). Analyzing Gender Bias within Narrative Tropes.",
  "content_length": 18820,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:08"
}