{
  "name": "Brent J. Hecht",
  "homepage": "http://www.brenthecht.com",
  "status": "success",
  "content": "Dr. Brent Hecht - Northwestern University Brent Hecht Home Publications CV Blog Advising Teaching Personal BRENT HECHT Microsoft Research profile Google Scholar profile LinkedIn Director of Applied Science Experiences and Devices Microsoft brent(dot)hecht(at)microsoft.com Associate Professor Human-centered AI Spatial Computing Northwestern University bhecht(at)northwestern.edu Frances Searle Building 1-144 2240 Campus Rd., Evanston, IL Lab: People, Space, and Algorithms Research Group Frances Searle Building 1-310 Brent J. Hecht Dr. Brent Hecht is Director of Applied Science and Partner at Microsoft, as well as an affiliate associate professor at Northwestern University. Quick Bio: Dr. Brent Hecht has been doing award-winning human-centered artificial intelligence (AI) research for over 15 years. His early work was central in identifying what we now call 'algorithmic bias'. More recently, Dr. Hecht was one of the first scholars to raise alarms about how AI uses data without consent or compensation. For over a decade, he has advocated for alternative approaches that give people and institutions control over how their data is used in AI, both for those people and institutions but also for the long-term sustainability of the AI ecosystem. In doing so, his lab originated ideas like \"data strikes\", \"data dividends\", and \"data leverage\". He is the recipient of a CAREER award from the U.S. National Science Foundation and was on the founding executive committee of ACM FAccT, the premiere publication venue for responsible AI research. Dr. Hecht is also the leader of a team of exceptional scientists at Microsoft that has done mission-critical work for the company in areas like differentially-private synthetic data, fine-tuning for multi-party (group) reasoning and, most importantly, defining and working towards a positive vision for AI in the future of work. He additionally serves as scientific advisor at Microsoft to strategic explorations on topics like data markets and data value estimation. Dr. Hecht's academic work and work at Microsoft has received Best Paper recognition at top-tier publication venues in human-centered AI (e.g. ACM SIGCHI, ACM KDD, ACM CSCW, ACM Mobile HCI, AAAI ICWSM) Selected Recent Publications: ACL 2024: Lin, Y-C, Neville, J., Stokes, Jack W., Yang, L., Safavi. T., Wan, M., Counts, S., Suri, S., Andersen, R., Xu, X., Gupta, D., Jauhar, S., Song, X., Buscher, G., Tiwary, S., Hecht, B., and Teevan, J. Interpretable User Satisfaction Estimation for Conversational Systems with Large Language Models. Association for Computational Linguistics 2024. PDF Preprint ACM CHI 2024: Precel, H., McDonald, A., Hecht, B., and Vincent, N. A Canary in the AI Coal Mine: American Jews May Be Disproportionately Harmed by Intellectual Property Dispossession in Large Language Model Training. ACM SIGCHI 2024. PDF Preprint | PDF PNAS: Tao, Y., Yang, L., Jaffe, S., Amini, F., Bergen, P., Hecht, B. and You, F. Climate mitigation potentials of teleworking are sensitive to changes in lifestyle and workplace rather than ICT usage. Proceedings of the National Academy of Sciences. 2023. Full PDF Edited Volume: Butler, J., Jaffe, S., Baym, N., Czerwinski, M., Iqbal, S., Nowak, K., Rintel, R., Sellen, A., Vorvoreanu, M., Hecht, B., and Teevan, J. Microsoft New Future of Work Report 2023 (Third Edition). 2023. Full PDF Microsoft Technical Report: Cambon, A., Hecht, B., Edelman, B., Ngwe, D., Jaffe, S., Heger, A., Vorvoreanu, M., Peng, S., Hofman, J., Farach, A., Bermejo-Cano, M., Knudsen, E., Bono, J., Sanghavi, H., Spatharioti, S., Rothschild, D., Goldstein, D.G., Kalliamvakou, E., Cihon, P., Demirer, M., Schwarz, M., and Teevan, J. Early LLM-based Tools for Enterprise Information Workers Likely Provide Meaningful Boosts to Productivity. Microsoft Technical Report. 2023. Full PDF ACM Tran. Rec. Sys.: Tomlinson, K., Wan, M., Lu, C., Hecht, B., and Teevan, J. Targeted Training for Multi-Organization Recommendation. ACM Transactions on Recommender Systems. 2023. New York : ACM Press. Full PDF ACM FAccT 2023: Li, H. Vincent, N., Chancellor, S., and Hecht, B. The Dimensions of Data Labor: A Road Map for Researchers, Activists, and Policymakers to Empower Data Producers. ACM FAccT ’23 . New York : ACM Press. Full PDF ACM SIGKDD 2022: Ma, J. Wan, M., Yang, L., Li, J., Hecht, B., and Teevan, J. Learning Causal Effects on Hypergraphs. ACM SIGKDD ’22 . New York : ACM Press. Full PDF * Best Paper Award ACM FAccT 2022: Contractor, D., McDuff, D., Haines, J., Lee, J., Hines, C., Hecht, B., Vincent, N., and Li, H. Behavioral Use Licensing for Responsible AI. ACM FAccT 2022. New York : ACM Press HTML | PDF Edited Volume: Teevan, J., Baym, N., Butler, J., Hecht, B., Jaffe, S., Nowak, J., Yang, L. New Future of Work Report 2022. 2nd ed. Microsoft, 2022. Full PDF | Other Resources AAAI ICWSM 2022: Lin, H., Hecht, B., and Chancellor, S. Measuring the Monetary Value of Online Volunteer Work. Proceedings of the International AAAI Conference on Weblogs and Social Media (AAAI ICWSM ’22). Menlo Park, CA: AAAI Press. Full PDF * Best Paper Nomination AAAI ICWSM 2022: Lin, H., Hecht, B., and Chancellor, S. All That’s Happening Behind the Scenes: Putting the Spotlight on Volunteer Moderator Labor in Reddit. Proceedings of the International AAAI Conference on Weblogs and Social Media (AAAI ICWSM ’22). Menlo Park, CA: AAAI Press. Full PDF Nature Human Behavior: Yang, L., Holtz, D., Jaffe, S., Suri, S., Sinha, S., Weston, J., Joyce, C., Shah, N., Sherman, K., Hecht, B. and Teevan, J. 2021. The effects of remote work on collaboration among information workers. Nature Human Behaviour. (Sep. 2021), 1–12. Full PDF Harvard Business Review: Teevan, J., Jaffe, S., and Hecht, B. Let’s Redefine “Productivity” for the Hybrid Era. Harvard Business Review. Read Article ACM RecSys 2021: Jiang, J.J., Lee, C.J., Yang, L., Sarrafzadeh, B., Hecht, B., and Teevan, J. Learning to Represent Human Motives for Goal-directed Web Browsing. ACM RecSys 2021. New York : ACM Press. Full PDF Edited Volume: Teevan, J., Hecht, B., and Jaffe, S. eds. The New Future of Work: Research from Microsoft on the Impact of the Pandemic on Work Practices. 1st ed. Microsoft, 2021. Full PDF | Other Resources ACM CSCW 2021 / PACM CSCW: Vincent, N. and Hecht, B. Can “Conscious Data Contribution” Help Users to Exert “Data Leverage” Against Technology Companies? ACM CSCW 2021 / PACM CSCW. New York : ACM Press. Paper PDF | Archived Code ACM CSCW 2021 / PACM CSCW: Vincent, N. and Hecht, B. A Deeper Investigation of the Importance of Wikipedia Links to Search Engine Results. ACM CSCW 2021 / PACM CSCW. New York : ACM Press. Paper PDF | Software Library ACM CSCW 2021 / PACM CSCW: Bandy, J. and Hecht, B. Errors in Geotargeted Display Advertising: Good News for Local Journalism? ACM CSCW 2021 / PACM CSCW. New York : ACM Press. Paper PDF ACM FAccT 2021 (formerly FAT*): Vincent, N., Li, H., Tilly, N., Chancellor, S., and Hecht, B. Data Leverage: A Framework for Empowering the Public in its Relationship with Technology Companies. ACM FAccT 2021 (formerly FAT*). New York : ACM Press. Paper PDF ACM SIGCHI 2021: Cao, H., Lee, C.J., Iqbal, S. Czerwinksi, M., Wong, P., Rintel, S., Hecht, B., Teevan, J., and Yang, L. Large Scale Analysis of Multitasking Behavior During Remote Meetings. ACM SIGCHI 2021. New York : ACM Press. * Honorable Mention (Top 5% of Submissions) Paper PDF Communications of the ACM: Barocas, B., Biega, A.J., Boyarskaya, M., Crawford, K., Daumé, H., Dudík, M., Fish, B., Gray, M.L, Hecht, B., Olteanu, A., Poursabzi-Sangdeh, F., Stark, L., Wortman Vaughan, J., Wallach, H. and Zepf, M. 2021. Responsible computing during COVID-19 and beyond. Communications of the ACM 64, 7: 30–32. Article HTML | Article PDF ACM CSCW 2020 / PACM CSCW: Li, H. and Hecht, B. 3 Stars on Yelp, 4 Stars on Google Maps: A Cross-Platform Examination of Restaurant Ratings. ACM CSCW 2020 / PACM CSCW. New York : ACM Press. PDF of Paper ACM Collective Intelligence 2020: Vincent, N. and Hecht, B. Can “Conscious Data Contribution” Help Users to Exert “Data Leverage” Against Technology Companies?. Collective Intelligence 2020. New York : ACM Press. PDF of Paper ACM CSCW 2019 / PACM CSCW: Li, H., Vincent, N., Tsai, J., Kaye, J., and Hecht, B. How Do People Change Their Technology Use in Protest?: Understanding “Protest Users”. CSCW 2019 / PACM Computer-Supported Cooperative Work and Social Computing, 2 (1). New York : ACM Press. PDF of Paper WWW 2019 / The Web Conference 2019: Vincent, N., Hecht, B, and Sen, S. (2019) “Data Strikes”: Evaluating the Effectiveness of New Forms of Collective Action Against Technology Platforms. Proceedings of the 28th World Wide Web Conference (The Web Conference / WWW 2019). PDF of Paper AAAI ICWSM 2019: Vincent, N., Johnson, I., Sheehan, P., and Hecht, B. (2019) Measuring the Importance of User-Generated Content to Search Engines. Proceedings of the International AAAI Conference on Weblogs and Social Media (AAAI ICWSM ’19). Menlo Park, CA: AAAI Press. PDF of Paper ACM SIGCHI 2019: Das, M., Hecht, B., and Gergle, D. (2019) The Gendered Geography of Contributions to OpenStreetMap: Complexities in Self-Focus Bias. Proceedings of the 37th Annual ACM Conference on Human Factors in Computing Systems (CHI 2019). New York : ACM Press. PDF of Paper CSCW 2018 / PACM CSCW: Miller, H., Levonian, Z., Kluver, D., Terveen, L., and Hecht, B. (2018) What I See Is What You Don't Get: Effects of Seeing Emoji Rendering Differences Across Platforms. CSCW 2018 / PACM Computer-Supported Cooperative Work and Social Computing, 1 (1). New York : ACM Press. PDF of Paper CSCW 2018 / PACM CSCW: Li, H., Alarcon, B., Espinosa, S.M., and Hecht, B. (2018) Out of Site: Empowering a New Approach to Online Boycotts. CSCW 2018 / PACM Computer-Supported Cooperative Work and Social Computing, 1 (1). New York : ACM Press. PDF of Paper CSCW 2018 / PACM CSCW: Foong, E., Vincent, N., Hecht, B., and Gerber, E. (2018) Women (Still) Ask For Less: Gend",
  "content_length": 21904,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:13"
}