{
  "name": "Brendan A. Juba",
  "homepage": "https://www.cse.wustl.edu/~bjuba",
  "status": "success",
  "content": "Brendan Juba, Washington University in St. Louis Brendan Juba Washington University in St. Louis, School of Engineering, Department of Computer Science and Engineering and Division of Computational & Data Sciences, Theoretical Computer Science and Machine Learning & Artificial Intelligence groups, Associate Professor. Spring 22: Currently on leave. Check out the new Division of Computational and Data Sciences, a doctoral program for research that uses computational and data-driven methods to advance knowledge in a variety of disciplines in the social and behavioral sciences. Please follow the link for more information. My work primarily concerns theoretical approaches to artificial intelligence, founded on the theory of algorithms and computational complexity. In particular, I have worked on algorithms for integrated learning and reasoning (e.g., in common sense reasoning), a topic on which I recently gave a tutorial at AAAI-18 with Loizos Michael. Previously, I worked on a theory of communication in the absence of standards (introductions available in three lengths, short, medium, and long). I am also interested in theoretical computer science more broadly construed. I graduated from MIT under the supervision of Madhu Sudan in September 2010; subsequently, I worked as a postdoc under the supervision of Leslie Valiant at Harvard until joining Washington University in Fall 2014. I had also remained (jointly) affiliated with CSAIL as a postdoc with the Center for Science of Information through Summer 2012. In a past life, I was an undergraduate at Carnegie Mellon University, and had the privilege of working with Manuel Blum, which proved to be every bit as awesome as one could imagine. My thesis on Universal Semantic Communication is available on DSpace. (A revised version is published by Springer.) Papers Miscellaneous Current Ph.D. students: Golnoosh Dehghanpoor, Zihao Deng, Hai Le, Jizhou Huang Other students I have supervised Past teaching: CSE 347, Analysis of Algorithms Spring 17, Fall 17, Spring 19, Spring 20 CSE 513T, Theory of Artificial Intelligence and Machine Learning: Spring 15, Fall 16, Spring 18, Fall 21 CSE 519T, Advanced Machine Learning: Fall 19, Spring 21 CSE 544T, Special Topics in Computer Science Theory: Fall 19 CSE 547T, Formal Languages and Automata: Fall 15, Fall 20 CSE 582T, Computational Complexity: Fall 14 Seminars: CSE Colloquium, DSS, MLunch McKelvey 2010B",
  "content_length": 2426,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:07"
}