{
  "name": "Brian A. Barsky",
  "homepage": "http://www.cs.berkeley.edu/~barsky",
  "status": "success",
  "content": "La page web personnelle de Brian A. Barsky Personal Homepage Brian A. Barsky Photo by François Pesant High resolution version PROFESSOR OF THE GRADUATE SCHOOL Faculty Affiliations: Electrical Engineering and Computer Sciences (EECS) Optometry Vision Science Bioengineering Berkeley Institute of Design (BID) Berkeley Center for New Media (BCNM) Arts Research Center (ARC) Berkeley Canadian Studies Program Research: Research in Vision Enhancement, Accessibility, and Well-Being Teaching: Boeing 737 MAX: Money, Machines, and Morals in Conflict ENGIN/E24 Freshman Seminar on Class Schedule This seminar explores the ethical issues of corporate behavior as well as lack of government oversight leading to several accidents of the newest commercial passenger airplane. Within two years of its first commercial flight on May 22, 2017, the Boeing 737 MAX aircraft suffered two crashes within five months of each other, on October 29, 2018 and March 10, 2019. In both incidents, pilots could not control the aircraft shortly after takeoff resulting in tragic crashes with no survivors. Despite the similar characteristics of the two crashes, the FAA resisted international pressure to ground the aircraft, but then grounded it for nineteen months. Due to concerns about financial losses, there was pressure to resume the use of the 737 MAX for commercial passenger flight as soon as possible notwithstanding continued safety concerns. The FAA ungrounded it on on November 18, 2020, despite many lingering safety questions. On January 5, 2024, a door plug blew out on a 737 MAX at 16,000 feet altitude. These incidents were due to a flawed design and fundamental manufacturing issues. Examination of the many factors that led to these disastrous consequences illuminates disquieting ethical issues of corporate behavior and lack of government oversight. Possible topics to be discussed include physics of flight, aeronautics, avionics, aircraft design, engineering ethics and the social responsibility of engineers, corporate interest and business ethics, the role of responsible government, issues of increased reliance on complex software replacing humans, etc. ACM Distinguished Speaker UC Berkeley Presidential Chair Fellow Warren and Marjorie Minner Faculty Fellow in Engineering Ethics and Professional/Social Responsibility Fellow of the American Academy of Optometry William Evans Fellow Fulbright Scholar National Science Foundation Presidential Young Investigator Awardee IBM Faculty Development Awardee Biographical Sketch Official mailing address: University of California, Berkeley EECS Computer Science Division 387 Soda Hall #1776 Berkeley, CA 94720-1776 U.S.A. Contact information: E-mail: barsky at berkeley dot edu Telephone: +1 (510) 642-9838 Telephone: +1 (510) OH-BYTE-8 Bai Shi Qi Click for weather forecast Lattitude: 37° 37' North Longitude: 122° 22' West",
  "content_length": 2872,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:20"
}