{
  "name": "Brian C. Lovell",
  "homepage": "http://staff.itee.uq.edu.au/lovell",
  "status": "success",
  "content": "Brian C. Lovell - Home Page Professor Brian C. Lovell School of ITEE The University of Queensland (UQ) St. Lucia, Brisbane QLD 4072 Australia Office: +61 7 3365 4134 Fax: +61 7 3365 4999 Email: lovell at itee.uq.edu.au Research Leader Advanced Surveillance Group (AS) Security and Surveillance Research Group (SAS) Past-President International Association for Pattern Recognition , 2008-2010. Research Profiles Google Scholar Citations ResearchGate Publications DBLP Bibliography Biography: Brian C. Lovell was born in Brisbane, Australia in 1960. He received the BEng in electrical engineering in 1982, the BSc in computer science in 1983, and the PhD in signal processing in 1991: all from the University of Queensland (UQ). Professor Lovell was Research Leader in National ICT Australia (2006-2012) and Research Director of the Security and Surveillance Research group in the School of ITEE, UQ. He was President of the Australian Pattern Recognition Society 1995-2005, Senior Member of the IEEE, Fellow of the World Innovation Forum, Fellow of the IEAust, and voting member for Australia on the governing board of the International Association for Pattern Recognition since 1998. Professor Lovell was Technical Co-chair of ICPR2006 in Hong Kong (Computer Vision and Image Analysis), Program Co-chair of ICPR2008 in Tampa, Florida, and General Co-Chair of ICIP2013 in Melbourne, Australia. He served on the Editorial Board of Pattern Recognition Letters and reviews for many of the major journals in the fields of Computer Vision and Pattern Recognition as well as CVPR, ICCV, and ECCV. In March 2005, he was awarded Number 1 author at UQ and over 100,000 copies of his papers have been downloaded from the UQ library archive so far. His research interests include biometrics, intelligent surveillance techniques, optimal image segmentation, real-time video analysis, manifold-based classification, and robust non-cooperative face recognition from mobile and wearable devices. More Info: UQ Research Profile Affiliations and Roles Ass Editor Pattern Recognition Ass Editor Pattern Recognition Letters Fellow of the Asia-Pacific Artificial Intelligence Association Program Co-Chair AVSS2021, Washington, USA Program Co-Chair ICPR2020, Milan Italy Area Chair ICPR2018, Beijing, China Program Co-Chair ICPR2016, Cancun, Mexico Member of the IEEE Signal Processing Society Conference Board (2014-) Senior Editorial Board Member of the IEEE Signal Processing Magazine (2014-) General Co-Chair of IEEE ICIP2013 (International Conference on Image Processing) in Melbourne (2013) Chair of the Fellows Commitee of the IAPR from (2012-2014) Chair of the Nominating Committee of the IAPR from (2010-2012) Past-President of the International Association for Pattern Recognition (2008-2010) Region 10 member of the IEEE Computer Society Nominating Committee (2009-2010) Chair of the IAPR J.K. Aggarwal Prize Committee (2005-2008) Program Co-Chair of ICPR2008 in Tampa, Florida Fellow of the International Association for Pattern Recognition (2008-) Fellow of the Institution of Engineers Australia (2005-) Senior Member of the IEEE Signal Processing, Communications, and  Computer Societies Fellow of World Innovation Foundation Professor in The School of Information Technology and Electrical Engineering (2005-) Director of Engineering Programs in The School of Information Technology and Electrical Engineering (2005) Chair of the Engineering Curriculum Committee in ITEE from 2001 to 2005 Member of the ITEE Teaching and Learning Committee from 2001 to 2005 Voting Member for Australia on the Governing Board of the International Association for Pattern Recognition since 1998 Chair of the Conferences and Meetings Committee of the IAPR from 1998 to 2002 Member of the Nominating Committee and Conferences and Meetings Committee of the IAPR from 2002 to 2004 President of the Australian Pattern Recognition Society(APRS) with about 250 members nationally 1995 to 2005. General Chair of DICTA95(Digital Image Computing: Techniques and Applications)in Brisbane Local Organisation Chair of ICPR98 (The 14th International Conference on Pattern Recognition) in Brisbane General Chair of WDIC2003 (Workshop on Digital Image Computing) in Brisbane Technical Chair of ANZIIS2003 (Australian and New Zealand Intelligent Information Systems) in Sydney Technical Co-Chair of ICPR2006 (Computer Vision and Image Analysis) in Hong Kong General Co-Chair of WDIC2005 (Workshop on Digital Image Computing) in Brisbane General Co-Chair of DICTA2005 (Digital Image Computing: Techniques and Applications) in Cairns AI SEO Research Project at vivki Copyright © 2021 Brian C. Lovell All rights reserved.",
  "content_length": 4677,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:23"
}