{
  "name": "Brian C. Nelson",
  "homepage": "https://webapp4.asu.edu/directory/person/841981",
  "status": "success",
  "content": "Brian Nelson | ASU Search Brian Nelson Professor, Mary Lou Fulton College for Teaching and Learning Innovation [email protected] Phone: 480-727-4550 ‌ Payne Hall West 122H TEMPE, AZ 85287-2111 Mail code: 1811 Campus: Tempe ‌ Long Bio Brian C. Nelson's research focuses on the theory, design, and implementation of immersive learning and assessment environments, educational video games, augmented reality and virtual reality for STEM education. Dr. Nelson most recently served as PI on the NSF-funded Accessible Computational Thinking (ACT) project. ACT investigated best practices for helping teachers provide culturally relevant experiences for all elementary children to participate in and engage with computational thinking (CT) integrated into their science lessons. Dr. Nelson was co-founder and co-director of Computer Science for Arizona (CSforAZ), a statewide computer science taskforce that focused on bringing computer science education and professional development statewide. Nelson also served as vice president of the Arizona chapter of the Computer Science Teachers Association (CSTA). Previously, Dr. Nelson served as Co-PI on the NSF-funded Ask Dr. Discovery, SAVE Science, SURGE, and River City projects. He also served as Co-PI on the MacArthur funded 21st Century Assessment and Our Courts projects. Each of these studies explored the use of computer games to teach and assess STEM content and skills. He earned his doctorate in Education from Harvard University. Education Ed.D. Educational Technology, Harvard University 2005 M.A. Teaching English as a Second Language (TESOL), St. Michael's College, VT 1994 B.A. Communications and Theater Arts, Washington State University 1990 CV Curriculum Vitae Research Interests Guiding Research Questions: How can immersive computer environments be designed to best support learning and assessment? How can the curricula and activities in educational games and virtual worlds be structured to produce rich data as evidence for learning? How can we best support K12 students and teachers in building computational literacy? Current Research Projects: Dr. Nelson is currently serving as PI on the NSF-funded Accessible Computational Thinking (ACT) project. ACT investigates best practices for helping teachers provide culturally relevant experiences for all elementary children to participate in and engage with computational thinking (CT) integrated into their science lessons. Publications *Ha, J., *Pérez Cortés, L. E., *Su, M., Nelson, B., Bowman, C., & Bowman, J. D. (2021). The impact of a gamified mobile question-asking app on museum visitor group interactions: an ICAP framing. International Journal of Computer-Supported Collaborative Learning, 16(3), 367-401. Ketelhut, D.J & Nelson, B. (2021).Virtual Learning Environments. Oxford Bibliographies in Education. Ed. Anne Hynds. New York: Oxford University Press. *Conley, Q., Atkinson, R., *Nguyen, F., & Nelson, B. (2020). MantarayAR: Leveraging augmented reality to teach probability and sampling. Computers and Education. 153. https://doi.org/10.1016/j.compedu.2020.103895. Nelson, B., Bowman, C., Bowman, J., *Perez Cortes, L., *Adkins, A., *Escalante, E. & *Owen, B., *Ha, J., & *Su, M. (2020). Ask Dr. Discovery: The impact of a casual mobile game on visitor engagement with science museum content. Educational Technology Research and Development. 68, 345-362. Research Activity Bowman,Judd David*, Bowman,Catherine, Nelson,Brian Carl. Facilitating Museum Evaluation with Real-Time Data Mining. NSF-EHR(9/1/2014 - 8/31/2017). Nelson,Brian Carl*, Nelson,Brian Carl*. RD: SAVE Science Science: Situated Assessment Using Virtual Environments for Science Content. UNIV OF MARYLAND(9/1/2011 - 8/31/2015). Nelson,Brian Carl*. SURGE: Scaffolding Understanding by Redesigning Games for Education. VANDERBILT UNIV(1/15/2010 - 8/31/2011). Clark,Douglas B*, Clark,Douglas B*, Nelson,Brian Carl, Nelson,Brian Carl. Scaffolding Understanding by Redesigning Games for Education (SURGE). NSF-EHR(9/1/2008 - 2/28/2010). Nelson,Brian Carl*, Nelson,Brian Carl*. SAVE Science: Situated Assessment Using Virtual Environments for Science Content and Inquiry. TEMPLE UNIV(9/1/2008 - 8/30/2013). Gee,James Paul*, Calleros,Charles Richard, Haas,Nancy S, Hinde,Elizabeth Rose, Nelson,Brian Carl, Wood,Linda Alice Sargent. Our Courts. MACARTHUR FDN(5/1/2008 - 5/30/2010). Gee,James Paul*, Gee,James Paul*, Gee,James Paul*, Nelson,Brian Carl, Nelson,Brian Carl. 21st Century Assessment Project. MACARTHUR FDN(10/1/2007 - 1/31/2013). Rikakis,Thanassis*, Akay,Metin, Bedard,Roger Lee, Benin,Mary Holland, Birchfield,David A, Brungart,Jennifer, Campana,Ellen, Campana,Ellen, Candan,Kasim Selcuk, Clark,Douglas B, He,Jiping, Homa,Donald L, Ingalls,Todd Matthew, Isaac,Gwyneira, James,Jodi H, Karam,Lina, Kelliher,Aisling G, Kelliher,Aisling G, Laubichler,Manfred Dietrich, Leanos,John Jota, Mcbeath,Michael, Nelson,Brian Carl, Panchanathan,Sethuraman, Panchanathan,Sethuraman, Presson,Clark Cortelyou, Qian,Gang, Qian,Gang, Rodriguez,Armando A, Santello,Marco, Savenye,Wilhelmina C, Somerville,Susan Clare, Spanias,Andreas Savva, Spanias,Andreas Savva, Steinmetz,Peter Nathan, Sundaram,Hari, Sundaram,Hari, Thornburg,Harvey Devoe, Thornburg,Harvey Devoe. IGERT: An Arts, Sciences, and Engineering Research and Education Initiative for Experimental Media. NSF-EHR(10/1/2005 - 9/30/2012). Nelson,Brian Carl*. Studying Robust-Design Strategies for Developing Innovations Effective and Scalable in Challenging Classroom Settings. HARVARD UNIV(9/1/2005 - 8/31/2008). Courses 2026 Spring Course Number Course Title EDU 593 Applied Project 2025 Fall Course Number Course Title DCI 792 Research DCI 790 Reading and Conference DCI 799 Dissertation 2025 Spring Course Number Course Title DCI 799 Dissertation DCI 792 Research DCI 790 Reading and Conference TEL 799 Dissertation 2024 Fall Course Number Course Title CSE 493 Honors Thesis CSE 499 Individualized Instruction DCI 792 Research EDT 590 Reading and Conference DCI 790 Reading and Conference DCI 799 Dissertation TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 799 Dissertation TEL 710 Innov Disseminating Res TEL 710 Innov Disseminating Res EDU 593 Applied Project 2024 Summer Course Number Course Title TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 710 Innov Disseminating Res TEL 710 Innov Disseminating Res 2024 Spring Course Number Course Title CSE 595 Continuing Registration CSE 599 Thesis CSE 590 Reading and Conference CSE 790 Reading and Conference DCI 799 Dissertation DCI 792 Research DCI 790 Reading and Conference CEN 599 Thesis CSE 599 Thesis TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 792 Research 2023 Fall Course Number Course Title CSE 493 Honors Thesis CSE 499 Individualized Instruction DCI 792 Research EDT 590 Reading and Conference DCI 790 Reading and Conference DCI 799 Dissertation TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 792 Research TEL 710 Innov Disseminating Res TEL 710 Innov Disseminating Res EDU 593 Applied Project 2023 Spring Course Number Course Title CSE 493 Honors Thesis CSE 492 Honors Directed Study CSE 595 Continuing Registration CSE 599 Thesis CSE 590 Reading and Conference CSE 790 Reading and Conference DCI 799 Dissertation DCI 792 Research DCI 790 Reading and Conference CSE 595 Continuing Registration CEN 599 Thesis CSE 499 Individualized Instruction CSE 599 Thesis TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 799 Dissertation TEL 780 Practicum TEL 780 Practicum TEL 710 Innov Disseminating Res TEL 710 Innov Disseminating Res 2022 Fall Course Number Course Title CSE 493 Honors Thesis CSE 499 Individualized Instruction DCI 792 Research EDT 590 Reading and Conference DCI 790 Reading and Conference DCI 799 Dissertation TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 799 Dissertation TEL 710 Innov Disseminating Res TEL 710 Innov Disseminating Res EDU 593 Applied Project 2022 Summer Course Number Course Title TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 710 Innov Disseminating Res TEL 710 Innov Disseminating Res 2022 Spring Course Number Course Title CSE 493 Honors Thesis CSE 492 Honors Directed Study CSE 595 Continuing Registration CSE 599 Thesis CSE 590 Reading and Conference CSE 790 Reading and Conference DCI 799 Dissertation DCI 792 Research DCI 790 Reading and Conference CSE 595 Continuing Registration CEN 599 Thesis CSE 499 Individualized Instruction CSE 599 Thesis CSE 493 Honors Thesis TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 710 Innov Disseminating Res TEL 710 Innov Disseminating Res EDU 593 Applied Project TEL 792 Research 2021 Fall Course Number Course Title CSE 493 Honors Thesis CSE 595 Continuing Registration CSE 599 Thesis CSE 499 Individualized Instruction CSE 590 Reading and Conference DCI 792 Research EDT 590 Reading and Conference DCI 790 Reading and Conference DCI 799 Dissertation TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 780 Practicum TEL 792 Research TEL 710 Innov Disseminating Res TEL 710 Innov Disseminating Res EDU 593 Applied Project 2021 Spring Course Number Course Title CSE 493 Honors Thesis CSE 492 Honors Directed Study CSE 595 Continuing Registration CSE 599 Thesis CSE 59",
  "content_length": 16186,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:21"
}