{
  "name": "Brian Nielsen",
  "homepage": "http://people.cs.aau.dk/~bnielsen",
  "status": "success",
  "content": "Brian Nielsen's Homepage Welcome to my Homepage I am a member of the Distributed and Embedded Systems research group, and take active part in the Centre of Embedded Software Systems, CISS. My research interests include distributed, embedded, and cyber-physical systems and software, Internet-of-Things, robotics, and methods and tools for model-based development and test generation for embedded real-time systems, and industrial applications. I am involved in numerous European projects related to model-based testing and development, recently the industrially driven ENABLE-S3 (European Initiative to Enable Validation for Highly Automated Safe and Secure Systems). I am also a co-designer of the testing tool components of the Uppaal tool-suite for verification and validation of real-time systems. List of Publications (see also DBLP, Google Scholar, Research Gate) Extended CV Visiting and Postal Brian Nielsen, Room 2.2.36 Department of Computer Science Aalborg University Selma Lagerlöfs Vej 300 DK-9220 Aalborg, Denmark (Directions and Google Maps) Phone +45 99 40 88 83 (direct) +45 99 40 99 40 (switch) +45 99 40 97 98 (fax) Electronic E-Mail: bnielsen at cs.aau.dk LinkedIn Skype ID: Research Projects I am deeply involved in a number of European and national applied and foundational research projects. Current ones include: ENABLE S3: European Initiative to esatblish leadership in development and deployment of highly automated and autonomous cyber-physical systems, enabled by new functional, safety and security verification and validation approaches, EU ECSEL ARVI Runtime Verification beyond Monitoring, EU Cost Action Arrowhead, EU Artemis MANTIS: Cyber Physical System based Proactive Collaborative Maintenance, EU ECSEL DiCyPS, Center for Data-Intensive Cyber-Physical Systems, Innovationsfonden7 MCAAU Uppaal Model-Checking Compute Cluster at AAU More Details Conferences and Services I am serving as Program Committee Member for several quality conferences. Please submit a paper and/or participate! SVT-SAC 2017 Software Verification and Testing track at ACM Symposium on Applied Computing ICST 2016 9th IEEE International Conference on Software Testing, Verification and Validation ICTSS 2016 28th IFIP International Conference on Testing Software and Systems TAP 2016 10th IFIP International Conference on Tests and Proofs 11th AMOST 2016 Advances in Model-based Testing FMi 2016 IEEE International Workshop on Formal Methods Integration More Details Teaching and Education I do research-based teaching at all academic levels on topics in distributed and embedded systems at the School of ICT. Ph.D. Student Zhang Zhengkui: Time Optimal State-Space Search on Compute Clusters Dat 7 project: Course: Advanced Topics in Distributed Systems Course at ITV: Indlejret software til realtime- og IoT-systemer Course at ITV: Modeldrevet, komponentbaseret udvikling af indlejret software More Details Design based on: TEMPLATED Images: Unsplash (CC0)",
  "content_length": 2968,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:28"
}