{
  "name": "Brian Kulis",
  "homepage": "http://people.bu.edu/bkulis",
  "status": "success",
  "content": "Brian Kulis Brian Kulis Associate Professor Boston University Boston, MA Introduction I am an associate professor at Boston University, with appointments in the: Department of Electrical and Computer Engineering Department of Computer Science Division of Systems Engineering Faculty of Computing and Data Sciences Previously, I spent four years (2019-2023) also at Amazon as an Amazon Scholar in Alexa AI. From 2015-2018 I was the Peter J. Levine Career Development Assistant Professor in ECE and CS at Boston University, and from 2012-2015 I was an assistant professor in the Department of Computer Science and Engineering and the Department of Statistics at Ohio State University. Before that, I spent three years as a postdoc at UC Berkeley EECS (Computer Science Division), and was also affiliated with ICSI, where I had the good fortune to work with Trevor Darrell, Stuart Russell, Michael Jordan, and Peter Bartlett. Broadly speaking, I am interested in all aspects of machine learning. A major focus is on large-scale optimization for core problems in machine learning such as metric learning, content-based search, clustering, and online learning. I also focus on applications with audio and visual data. I am also interested in large-scale graphical models, Bayesian inference, Bayesian nonparametrics, and deep learning. I finished my Ph.D. in computer science in November, 2008, supervised by Inderjit Dhillon in the University of Texas at Austin computer science department. I did my undergrad in computer science and mathematics at Cornell University. I have also worked with John Platt and Arun Surendran at Microsoft Research on large-scale optimization, and as an undergraduate, I worked with John Hopcroft on tracking topics in networked data over time. During the Fall 2007 semester, I was a research fellow at the Institute for Pure and Applied Mathematics at U.C.L.A. Curriculum Vitae [pdf] Recent Service (Senior) Area Chair: AAAI 2025 (Senior) Area Chair: NeurIPS 2024 (Senior) Area Chair: ICML 2024 (Senior) Area Chair: AISTATS 2024 (Senior) Area Chair: AAAI 2024 Area Chair: ICLR 2024 (Senior) Area Chair: NeurIPS 2023 Area Chair: ICML 2023 (Senior) Area Chair: AISTATS 2023 (Senior) Area Chair: AAAI 2023 Area Chair: ICLR 2023 Area Chair: NeurIPS 2022 Area Chair: ICML 2022 Area Chair: AISTATS 2022 (Senior) Area Chair: AAAI 2022 Area Chair: ICLR 2022 Area Chair: NeurIPS 2021 Area Chair: ICML 2021 Area Chair: AISTATS 2021 (Senior) Area Chair: AAAI 2021 Area Chair: ICLR 2021 Area Chair: NeurIPS 2020 Area Chair: ICML 2020 Area Chair: AISTATS 2020 (Senior) Area Chair: AAAI 2020 Area chair: NeurIPS 2019 Area chair: ICML 2019 Area chair: AISTATS 2019 Area chair: NIPS 2018 Area chair: ICML 2018 Senior Program Committee: AAAI 2018 Area chair: NIPS 2017 Area chair: ICML 2017 Area chair: AISTATS 2017 Area chair: ICML 2016 Area chair: AISTATS 2016 Area chair: ICML 2015 Area chair: AISTATS 2015 Area chair: NIPS 2014 Area chair: ICML 2014 Local arrangements chair: CVPR 2014 Area chair: ICML 2013 Publications by Type Publications Chronologically Google scholar profile Teaching Fall, 2024. Advanced Data Structures and Algorithms Spring, 2024. Deep Learning Fall, 2023. Introduction to Machine Learning Spring, 2023. Deep Learning Fall, 2022. Introduction to Machine Learning Spring, 2022. Deep Learning Fall, 2021. Introduction to Machine Learning Spring, 2021. Introduction to Machine Learning Fall, 2020. Deep Learning Spring, 2019. Introduction to Machine Learning Fall, 2018. Deep Learning Spring, 2018. Advanced Data Structures and Algorithms Spring, 2017. Deep Learning Spring, 2017. Advanced Data Structures and Algorithms Fall, 2016. Advanced Data Structures and Algorithms Spring, 2015. Bayesian Modeling and Inference Fall, 2014. Survey of Artificial Intelligence II Spring, 2014. Survey of Artificial Intelligence II Spring, 2013. Machine Learning Fall, 2012. Probabilistic Graphical Models Spring, 2012. Bayesian Modeling and Inference Current Students Sadie Allen, PhD student Christopher Liao, PhD student David Liu, PhD student Former Group Members Dallin Gordon, MS. Kubra Cilingir, PhD. After BU: Amazon Ali Siahkamari, PhD. After BU: JP Morgan Chase Andrew Cutler, PhD. After BU: REACT Neuro Xide Xia, PhD. After BU: Facebook AI Natasha Frumkin, BS. After BU: PhD student, UT Austin Tayler Pauls, MS. After BU: Startup, then Amazon Vijay Thakkar, BS. After BU: PhD student, Georgia Tech. Rachel Manzelli, BS. After BU: Marlo Inc. then Modulate AI Siva Sankarapandian, MS. After BU: Proscia Inc. Robert Finn, PhD. After OSU: Assistant Professor, St. Peters University. Anirban Roychowdhury, PhD. After OSU: Research Scientist at Facebook. Ke Jiang, PhD. After OSU: Data Scientist at Microsoft. Xiangyang Xhou, MS. After OSU: Google. Lizzy Burl, BS. After OSU: Google. Jiaxin Zhang, MS. After OSU: Google. Ye Liu, MS. After OSU: PhD student, University of Michigan. Siddharth Singh, MS. After OSU: IBM, then Amazon. Research Details Click here to read more about some of my research (old projects, not updated). Contact Info Office: 441 PHO Email: bkulis [at] bu [dot] edu",
  "content_length": 5115,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:26"
}