{
  "name": "Brian S. Logan 0001",
  "homepage": "https://www.abdn.ac.uk/people/brian.logan",
  "status": "success",
  "content": "Professor Brian Logan | The University of Aberdeen Professor Brian Logan Professor Brian LoganChair in Computing Science Accepting PhDs About Email Addressbrian.logan@abdn.ac.ukSchool/DepartmentSchool of Natural and Computing Sciences Personal Website Biography My research interests span the specification, design and implementation of autonomous intelligent systems. A key theme of this work is `safe AI', specifically ensuring that autonomous intelligent systems function safely and in accordance with their design objectives. The current focus of my research is ensuring the safe behaviour of autonomous systems that adapt or learn at run time. I have also worked on a wide range of artificial intelligence research problems, including belief revision, reasoning, search and in agent-based simulation. Memberships and Affiliations Internal Memberships Core Research Lead Computing Science External Memberships I am a Visiting Associate Professor at Utrecht University. I also have an honorary position (Special Professor) at the University of Nottingham. Latest Publications Synthesising Minimum Cost Dynamic Norms 2025 - E-pub ahead of printAlechina, N., Logan, B., Perelli, G. Contributions to Conferences: Papers[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/353aa81e-028d-4f89-85cc-4164f848a048/downloadRun-time verification of robot-assisted surgery using visual input 2025 - Accepted/In pressGogoladze, K., Alechina, N., van Jaarsveld, R., De Jong, R., Al Khalil, Y., Kuiper, G., Logan, B., Ruurda, J. Contributions to Journals: Conference Articles[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/a87cb688-6afc-4f7a-b56e-f5ff90ac9657/download[ONLINE] https://ceur-ws.org/Pushdown Reward Machines for Reinforcement Learning 2025 - Accepted/In pressVarricchione, G., Klassen, T. Q., Alechina, N., Dastani, M., Logan, B., McIlraith, S. A. Chapters in Books, Reports and Conference Proceedings: Conference ProceedingsProbabilistic Strategy Logic with Degrees of Observability 2025 - PublishedMu, C., Motamed, N., Alechina, N., Logan, B. Contributions to Journals: Conference Articles[ONLINE] DOI: https://doi.org/10.1609/aaai.v39i14.33655[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/04d9740e-e77e-4ae0-8eac-22c4d1f00fb7/downloadTemporal Causal Reasoning with (Non-Recursive) Structural Equation Models 2025 - PublishedGladyshev, M., Alechina, N., Dastani, M., Doder, D., Logan, B. Contributions to Journals: Conference Articles[ONLINE] DOI: https://doi.org/10.1609/aaai.v39i14.33639[ONLINE] View publication in Scopus View My Publications Research Research Overview My research interests span the specification, design and implementation of autonomous intelligent systems. A key theme of this work is `safe AI', specifically ensuring that autonomous intelligent systems function safely and in accordance with their design objectives. The current focus of my research is ensuring the safe behaviour of autonomous systems that adapt or learn at run time. I have also worked on a wide range of artificial intelligence research problems, including belief revision, reasoning, search and agent-based simulation. Research Areas Accepting PhDs I am currently accepting PhDs in Computing Science. Please get in touch if you would like to discuss your research ideas further. Email Me Computing Science Supervising Accepting PhDsView Research Area Research Specialisms Artificial IntelligenceComputer Science Our research specialisms are based on the Higher Education Classification of Subjects (HECoS) which is HESA open data, published under the Creative Commons Attribution 4.0 International licence. Supervision My current supervision areas are: Computing Science. Current PhD students Jan de Mooij (Utrecht University) Giovanni Varricchione (Utrecht University) Previous PhD students Elizabeth Gordon Real-time Agent Architectures for Believable Worlds (graduated 2005) Mike Lees Adaptive Optmistic Simulation of Agent Based Systems (graduated 2006) Dan Fielding Agents Reporting from Collaborative Virtual Environments (co-supervised with Steve Benford, graduated 2007) Mark Jago Logics for Resource Bounded Agents (co-supervised with Natasha Alechina, graduated 2006) Neil Madden Multi-agent reporting on events in persistent virtual environments (graduated 2009) Nguyen Hoang Nga Reasoning about resource-bounded multi-agent systems (first supervisor Natasha Alechina, graduated 2011) Abdur Rakib Verifying requirements for resource-bounded agents (graduated 2011) Konstantin Vikhorev Real-time guarantees in high-level agent programming languages (graduated 2011) Trang Doan Thu Procedural reflection in agent prgramming languages (graduated 2014) Julian Zappala Agent-based models of group decsion making (graduated 2014) Hai Nguyen Belief revision for ontologies (first supervisor Natasha Alechina, graduated 2014) Liu Xiaofan Analysis and verification of business rules (first supervisor Natasha Alechina, graduated 2015) Daniela Dybalova Autonomy and context in human-agent collectives (graduated 2017) Yuan Yao Tractable deliberation in agent programming languages (graduated 2018) Sam Leask GROVE: A computationally bounded model for rational intention revision in BDI agents (graduated 2021) Kwabena Amponsah A framework for evaluating the impact of communication on performance in large-scale distributed urban simulations (graduated 2021) Salim Anas Monotonicity-Aware Bandit Algorithms: Enhancing Multi-Armed and Continuum-Armed Bandits with Structural Reward Information (graduated 2025) Funding and Grants Recent projects Normative cooperation among autonomous agents, ONRG/EOARD/DSTL CAUSES: Causality in multi-agent systems; learning and verification, Netherlands NWO Safe Correct-by-Construction Control Programs for FUSION reactor maintenance, EPSRC/RAIN feasibility study Elastic Manufacturing Systems --- a platform for dynamic, resilient and cost-effective manufacturing services, EPSRC EP/T024429/1 DiManD: Digital Manufacturing and Design Training Network, Marie Sklodowska-Curie Innovative Training Network, EU Teaching Courses Algorithms and Data Structures CS2522Languages And Computability CS3518 Teaching Responsibilities In the 2025-2026 academic session, I am teaching: CS2522 Algorithms and Data Structures CS4543 Languages and Computability In the past, I have also taught: CS2513 Mathematics for Computing Science Non-course Teaching Responsibilities I am a member of the steering committee of the European Summer School on Artificial Intelligence (ESSAI), and was PC chair for ESSAI 2024. Publications Page 1 of 4 Results 1 to 10 of 31 Synthesising Minimum Cost Dynamic Norms 2025 - E-pub ahead of printAlechina, N., Logan, B., Perelli, G. Contributions to Conferences: Papers[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/353aa81e-028d-4f89-85cc-4164f848a048/downloadRun-time verification of robot-assisted surgery using visual input 2025 - Accepted/In pressGogoladze, K., Alechina, N., van Jaarsveld, R., De Jong, R., Al Khalil, Y., Kuiper, G., Logan, B., Ruurda, J. Contributions to Journals: Conference Articles[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/a87cb688-6afc-4f7a-b56e-f5ff90ac9657/download[ONLINE] https://ceur-ws.org/Pushdown Reward Machines for Reinforcement Learning 2025 - Accepted/In pressVarricchione, G., Klassen, T. Q., Alechina, N., Dastani, M., Logan, B., McIlraith, S. A. Chapters in Books, Reports and Conference Proceedings: Conference ProceedingsProbabilistic Strategy Logic with Degrees of Observability 2025 - PublishedMu, C., Motamed, N., Alechina, N., Logan, B. Contributions to Journals: Conference Articles[ONLINE] DOI: https://doi.org/10.1609/aaai.v39i14.33655[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/04d9740e-e77e-4ae0-8eac-22c4d1f00fb7/downloadTemporal Causal Reasoning with (Non-Recursive) Structural Equation Models 2025 - PublishedGladyshev, M., Alechina, N., Dastani, M., Doder, D., Logan, B. Contributions to Journals: Conference Articles[ONLINE] DOI: https://doi.org/10.1609/aaai.v39i14.33639[ONLINE] View publication in ScopusTemporal Causal Reasoning with (Non-Recursive) Structural Equation Models 2025 - PublishedGladyshev, M., Alechina, N., Dastani, M., Doder, D., Logan, B. Contributions to Conferences: Papers[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/1520e548-d47a-4e6f-8b7f-852f78bf07db/downloadProbabilistic Strategy Logic with Degrees of Observability 2025 - PublishedMu, C., Motamed, N., Alechina, N., Logan, B. Working Papers: Preprint Papers[ONLINE] https://arxiv.org/abs/2412.15135[ONLINE] DOI: https://doi.org/10.48550/arXiv.2412.15135Maximally Permissive Reward Machines 2024 - PublishedVarricchione, G., Alechina, N., Dastani, M., Logan, B. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.3233/FAIA240613[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/c626bb8b-c7b9-4e5e-8333-265f13c93cb0/downloadGenSynthPop: generating a spatially explicit synthetic population of individuals and households from aggregated data 2024 - PublishedDe mooij, J., Sonnenschein, T., Pellegrino, M., Dastani, M., Ettema, D., Logan, B., Verstegen, J. a. Autonomous Agents and Multi-Agent Systems, vol. 38, no. 2, 48Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1007/s10458-024-09680-7[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/c021685f-86ed-4f1e-b164-7450c8c6337a/downloadIntention Progression with Temporally Extended Goals 2024 - PublishedYao, Y., Alechina, N., Logan, B. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.24963/ijcai.2024/33[ONLINE] View publication in Scopus Show 10 | 25 | 50 | 100 results per page Refine Chapters in Books, Reports and Conference Proceedings Conference Proceedings (17) Contributions to Conferences Papers (4) Contributions to Journals Articles (5) Conference Articles (4) Working Papers Preprint Papers (1) Update",
  "content_length": 9899,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:29"
}