{
  "name": "Brian Neil Levine",
  "homepage": "https://people.cs.umass.edu/~brian",
  "status": "success",
  "content": "Brian Neil Levine Brian Neil Levine Homepage Pubs Teaching NEWS STUDENTS SERVICE BIO Distinguished Professor Associate Dean, IT & Facilities ACM Fellow Manning College of Information and Computer Sciences University of Massachusetts Amherst My research and outreach efforts are mostly focused on child rescue (thwarting internet-based child sexual exploitation), an important nonpartisan issue. More broadly, I work in the areas of security, privacy, and forensics applied to networking. I have been named an ACM Fellow \"For contributions to network forensics, security, and privacy, and for thwarting crimes against children\". You can see a list of all of my publications online. More information can be found on the UMass Amherst Rescue Lab website. I am the founding Director of the UMass Amherst Cybersecurity Institute. And I am Co-Director of the UMass Accelerator for Responsible Technology, which transitions research into practice. I am passionate about drawing attention to the harms to children that take place on Tor (and Freenet) and on mobile apps. Visit my sites focused on the dangers to children on Tor and the blind-eyes of academia; and the dangers to children on mobile apps. Or watch the invited talk I gave at Usenix Security on Tor and child sexual exploitation. I gave the talk in 2019 and sadly not a thing has changed. Latest News Read my 2025 posts on LinkedIn regarding child sexual exploitation and the Tor Project: [1] [2], and [3]. Quoted in an August 2025 news articles on child sexual exploitation and the Tor Project: The Guardian: Privacy at a Cost: the dark web’s main browser helps pedophile networks flourish, experts say (free version) by Katie McQue. Globe and Mail: Canada’s child protection advocates urge dark-web administrators to block millions of child-abuse images (free version) by Marie Woolfe. Proud to have spoken on a February 2025 panel organized and attended by Senator Coons (D-DE) and Senator Cornyn (R-TX) on the threats posed by AI-generated CSAM and how lawmakers and law enforcement can work together to combat current instances and prevent future ones. [video] I'm grateful to be part of an article in the New York Times by Michael Keller (Dec. 7, 2024) on apps and the sexual abuse of children. Keller used our project as part of his reporting on apps where parents sell sex shows involving their children. I've been named a UMass Distinguished Professor. Our App Danger work has been featured in an article in the New York Times by Tripp Mickle (Aug. 17, 2023, Section B, Page 1). We are grateful for the coverage! Apple dropped ten apps from its App Store as a result. More coverage from ACM TechNews and 9to5Mac. Proud to be a part of Jeff Horwitz's reporting from the Wall Street Journal: Instagram Connects Vast Pedophile Network (free version) from June 2023. See further reporting from BNN Bloomberg TV, KCBS Radio San Francisco, and Ars Technica. The article inspired actions by the US Senate's Committee on Commerce, Science, and Transportation. Additionally, U.S. Senators Richard Blumenthal (D-CT) and Marsha Blackburn (R-TN) requested information from Meta. Here's my archive of older news and milestones. Icons: Freepik/ www.flaticon.com/ CC BY 3.0 © BNL including drawing/photo | Design by TEMPLATED.",
  "content_length": 3276,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:27"
}