{
  "name": "Brian Dorn",
  "homepage": "https://www.unomaha.edu/college-of-information-science-and-technology/about/faculty-staff/brian-dorn.php",
  "status": "success",
  "content": "Brian Dorn | College of Information Science & Technology | University of Nebraska Omaha Brian Dorn Brian Dorn, Ph.D. Associate Dean for Academic and Faculty Affairs Union Pacific Community Chair of Computer Science Education Associate Professor, Computer Science College of Information Science & Technology email: bdorn@unomaha.edu office: PKI 172C office phone: 402.554.4905 office hours: By Appointment Only fax: 402.554.3284 Google Scholar: https://scholar.google.com/citations?user=9xYR_5YAAAAJ&hl=en personal website: https://scholar.google.com/citations?user=9xYR_5YAAAAJ&hl=en note: This profile is pulling in data from Digital Measures. Postings on personal websites or social media do not indicate that the individual is speaking on behalf of UNO. General Information General Information Biography Dr. Brian Dorn is Associate Professor of Computer Science at the University of Nebraska at Omaha. His research combines work in computing education, human-computer interaction, and the learning sciences with a primary focus on the development of technologies and environments that support computational thinking and programming literacy across formal and informal settings. He has authored numerous peer-reviewed articles and has served as a PI or advisory board member on projects funded externally by SIGCSE and the NSF. He is an active member of the Association for Computing Machinery, SIGCSE, SIGCHI, and the American Educational Research Association. He has won various awards for his work in computing education including an Innovations in Teaching and Learning Award, an Engaged Learning Fellowship, and the Premier Award for Excellence in Engineering Education Courseware. Prior to joining the faculty at UNO, he taught computer science and web development at the University of Hartford, and he holds a Ph.D. in computer science from Georgia Tech's School of Interactive Computing. Teaching Interests Human Computer Interaction, User Experience Design, Introductory Programming Courses, Data Structures, Computer Science Teacher Education Courses Research Interests Computer Science Education, Educational Technology Design and Evaluation Awards and Honors Excellence in Teaching Award, Teaching - 2019Engaged Learning Fellowship, Teaching - 2013Innovations in Teaching and Learning Award, Teaching - 2012 Education Ph D, Georgia Institute of Technology, Atlanta, GA, Computer Science, Learning Sciences and Technologies (specialization), 2010MS, Iowa State University, Ames, IA, Computer Science, Higher Education (minor), 2005BS, Northwest Missouri State University, Maryville, MO, Computer Science, Mathematical Science (minor), 2002",
  "content_length": 2652,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:24"
}