{
  "name": "Brian Bullins",
  "homepage": "https://www.cs.purdue.edu/people/faculty/bbullins.html",
  "status": "success",
  "content": "Brian Anderson Bullins - Department of Computer Science - Purdue University Skip to content Home People Faculty Brian Anderson Bullins Faculty & Lecturers Staff Offices Brian Bullins Assistant Professor of Computer Science Brian Bullins is an assistant professor in the Department of Computer Science at Purdue University. Previously, he was a research assistant professor at the Toyota Technological Institute at Chicago. He received his Ph.D. in computer science at Princeton University, where he was advised by Elad Hazan, and his research was supported by a Siebel Scholarship. Before that, he received his B.S. degree from Duke University where he studied computer science and m… ↓More Joined department: Fall 2022 Research Areas Artificial Intelligence, Machine Learning, and Natural Language Processing Theory of Computing, Algorithms, and Quantum Computing Education Ph.D., Princeton University, Computer Science (2019) Brian Bullins is an assistant professor in the Department of Computer Science at Purdue University. Previously, he was a research assistant professor at the Toyota Technological Institute at Chicago. He received his Ph.D. in computer science at Princeton University, where he was advised by Elad Hazan, and his research was supported by a Siebel Scholarship. Before that, he received his B.S. degree from Duke University where he studied computer science and mathematics as a Benjamin N. Duke Scholar. His interests broadly lie in both the theory and practice of optimization for machine learning. In particular, his work on improving matrix estimation techniques has led to novel higher-order methods for convex and nonconvex optimization with provable guarantees. He continues to explore how we might leverage these approaches for faster methods in the highly parallel setting of distributed optimization, and his work received a best paper award at COLT 2021. Contact Info bbullins@purdue.edu DSAI 3127 Websites My Homepage Google Scholar",
  "content_length": 1973,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:19"
}