{
  "name": "Brian V. Funt",
  "homepage": "http://www.cs.sfu.ca/~funt",
  "status": "success",
  "content": "Professor Emeritus Brian Funt Office Phone 778-999-5095 Email funt [at] sfu [dot] ca Brian Funt Professor Emeritus, School of Computing Science, Faculty of Applied Sciences, Simon Fraser University Lab Director, Computational Vision Laboratory B.Sc. University of British Columbia, 1971 M.Sc. University of British Columbia, 1973 Ph.D. University of British Columbia, 1976 (Ph.D. Supervisor, Dr. Raymond Reiter) R E S E A R C H I N T E R E S T S I am interested in colour perception. My approach to understanding colour is to view colour perception as a computational process.  As such, the models of colour perception developed in my laboratory are formulated as algorithms that can be tested both in terms of whether or not they simply provide the expected results, and secondly in terms of whether they operate in a way that is congruent with what is known about human colour perception from the psychophysical experiments conducted by psychologists. The results of my research find application in the digital camera industry, the digital printing industry, the digital display industry, the textile industry, the lighting industry, and in the scientific use of colour (e.g., in medical applications). Google Scholar Listing GitHub: https://github.com/sfu-cs-vision-lab/ Datasets: https://www2.cs.sfu.ca/~colour/data/ C U R R E N T  S T U D E N T S Alex Forsythe (Ph.D.) G R A D U A T E D  S T U D E N T S Emitis Roshan (Ph.D.) Hoda Aghaei (M.Sc.) Charles Poynton (Ph.D.) Hamid Mirzaei (Ph.D.) Farnaz Agahian (M.Sc.) Milan Mosny (Ph.D.) Lilong Shi (Ph.D.) Hamid Mirzaei (M.Sc.) Nima Bastani (M.Sc.) Behnam Bastani (Ph.D.) Wallace Xiong (Ph.D. Florian Ciurea (Ph.D.) Bill Cressman (M.Sc.) Roozbeh Ghaffri (M.Sc.) Vlad Cardei (Ph.D.) Graham Finlayson (M.Sc. & Ph.D.) Louis Brassard (Ph.D.) Kobus Barnard (M.Sc. & Ph.D.) Pamela Gurski (M.Sc.) Shubo Chatterjee (M.Sc.) Paul Pelicano (M.Sc.) Frank Tong (M.Sc.) Janet Dueck (M.Sc.) Thomas Strohotte (M.Sc.) Arthur Lo (M.Sc.) Brigitte Dorner (M.Sc.) Dejan Kulpinski (M.Sc.) Ian Harder (M.Sc.) Ed Bryant (M.Sc.) Robert Laughlin (M.Sc.) C U R R E N T F U N D I N G Natural Science and Engineering Research Council, Discovery Grant A W A R D S CIC31 Cactus Award for Best Interactive Paper, 2023 Charles Ives Journal Award 2021 Journal of Vision, Exceptionally Good Review, August 2020 and again September 2020 Computer Graphics Image and Vision, Best Paper Award 2012 Canadian Robot Vision, Best Vision Paper Award, 2006 Marr Prize P A T E N T S Askoy, V., Nouria, R., Funt, B., Jiang, H., and Buckoll, C., Adaptive rate shading using texture atlas, US Patent No. 20230232008-A1, Aug. 8, 2023 Funt, B., Bastani, B. and Buckoll, C., Progressive Transmission of Detailed Image Data via Video Compression of Successive Subsampled Frames, US Patent Application No. US-11721064-B1, July 20, 2023. Funt, B., Nouria, R., Aksoy, V., and Htet, Z., “Latency-Resilient Cloud Rendering\" US Patent No. 11,544,894, Jan 3, 2023. Bastani, B., Funt., B., Vignaud, S. and Jiang, H., \"Smoothly Varying Foveated Rendering,\" US Patent 10,546,364, Jan. 28, 2020. Funt, B., Cardei, V. and Barnard, K. \"Method of Estimating Chromaticity of Illumination Using Neural Networks,\" US Patent 5,907,629. May 25, 1999. Grenier, L., Funt, B., Orth. P., and McIntosh, D. \"Transillumination method apparatus for the diagnosis of breast tumors and other breast lesions by normalization of an electronic image of the breast,\" U.S. Patent 5,079,698, 1992. Funt, B., Ho, J., and Drew, M. S.. Method and apparatus for determining ambient light and surface reflectance. U.S. Patent 4,992,963, 1991. P U B L I C A T I O N S (For reprints of those without hyperlinks please write to funt@sfu.ca) Logvinenko, A., Funt, B. and Bastani, P., The object-colour solid, Journal of Vision (2025) 25(2):2, 1–33, 2005. https://doi.org/10.1167/jov.0.0.08914 Roshan, E. and Funt, B., \"Metamer Mismatching Predicts Color Difference Ellipsoids,\" Color Research & Application, 2025; 0:1–8. https://doi.org/10.1002/col.22976, 2025. Forsythe, A. and Funt, B., “Assessing Color-rendering Differences in Cinematic Lighting with a New Metamer Mismatch Metric,” CIC 32 Thirty-Second Color and Imaging Conference, Montreal, pp. 13-16. Oct 2024. Funt, B. and Roshan, R., “What Underlies Focal Colours?,” CIC 31 Thirty-First Color and Imaging Conference, Paris, Nov. 2023.(Winner of the Cactus Award for Best Interactive Paper.) Funt, B. and Zhu, L., “The Laplacian of Logarithm as Illuminant-Invariant Input Space,” Proc. CIC30 Color & Imaging Conference, pp 182-187, Scottsdale, Nov. 2022. Dropbox link to associated video of the corresponding presentation Roshan, E. and Funt, B., “Color-Difference Ellipsoids Follow from Metamer Mismatching,” Proc. CIC30 Color & Imaging Conference, pp. A1-A2, Scottsdale, Nov. 2022. Dropbox link to associated video of the corresponding presentation Funt, B. and Roshan, E. \"Metamer mismatching underlies color difference sensitivity\", Journal of Vision 21(12):11, 1–11, 2021. Aghaei, H., and Funt, B., \"A Flying Grey Ball Multi-illuminant Image Dataset for Colour Research,\" Journal of Imaging Science and Technology, Vol. 64, No. 5, pp. 50411-1-50411-8(8), Sept. 2020. (Winner of the 2021 IS&T Charles E. Ives Journal Award)(Dataset available here) Xiangpeng, H., Funt, B., \"A Multi-illuminant Synthetic Image Test Set,\" Color Research and Application, Vol. 45, Issue 6, 2020. (Dataset available here) Roshan, R., and Funt, B., \"Color Sensor Accuracy Index Utilizing MetamerMismatch Radii,\" Sensors, 20(4275), 2020. Xiangpeng, H., Funt, B. and Jiang, H. \"Evaluating Colour Constancy on the new MIST dataset of Multi-Illuminant Scenes,\" CIC 27 Twenty-Seventh Color Imaging Conference, Paris, Oct. 2019. Hemrit, G., Finlayson, G.D., Gijsenij A., Gehler, P., Bianco, S., Drew, M.S., Funt, B.V. and Shi, L, \"Providing a Single Ground-truth for Illuminant Estimation for the ColorChecker Dataset,\" IEEE Pattern Analysis and Machine Intelligence, Vol. 14, No. 8, Oct. 2018. Funt, B., and Zhu, L., \"Does Colour Really Matter? Evaluation via Object Classification\" Proc. CIC'26 Twenty-Sixth IS&T Color Imaging Conference, Vancouver, Nov. 2018. Hemrit, G., Finlayson, G., Gijsenij, A., Gehler, P., Bianco, S., Funt, B., Drew, M. and Shi, L. \"Rehabilitating the ColorChecker Dataset for Illuminant Estimation,\" Proc. CIC26 26th Color Imaging Conference, Vancouver, Nov. 2018. Funt, B. and Roshan, R., \"Color Discrimination Ellipses Explained by Metamer Mismatching,\" Proc. AIC 2018 International Colour Association Conference, Lisbon, Sept. 2018. Funt, B. and Zhu, L., \"Colorization of Dichromatic Images,\" Proc. AIC 2018 International Colour Association Conference, Lisbon, Sept. 2018. Roshan, E. and  Funt, B. \"Computational color prediction versus least-dissimilar matching,\" J. Opt. Soc. Am. A 35, B292-B298 (March 2018). Zhu, L.and Funt, B., \"Colorizing Color Images,\" Proc. Human Vision and Electronic Imaging XXIII,  IS&T/SPIE Electronic Imaging, Feb. 2018 Funt, B, Mirzaei, H. and Zhang, X., \"A Colour Rendering Index for Dichromats,\"   Proc. AIC 2017 International Colour Association Conference,  Jeju Oct. 2017. Roshan, E. and Funt, B., \"Camera Color Accuracy Evaluated Via Metamer Mismatching,\"  Proc. AIC 2017 International Colour Association Conference,  Jeju Oct. 2017. Funt, B., Hull, B. and Zhang, X., \"Evaluation of the IES Method for Evaluating Light Source Color Rendition in terms of Metamer Mismatching,\" Proc. CIC’24 Twenty Fourth IS&T Color Imaging Conference, Nov. 2016. Zhang, X., Funt, B. and Mirzaei, H., \"Metamer Mismatching in Practice versus Theory,\" Journal of the Optical Society of America A, Vol. 33, No. 3, pp. A238-A247, March 2016 (Dataset of 41 million reflectances in Matlab available here) Li, B., Xiong, W., Hu, W, Funt, B. and Xing, J., \"Multi-Cue Illumination Estimation via a Tree-Structured Group Joint Sparse Representation\",  International Journal of Computer Vision, (Published on-line: DOI 10.1007/s11263-015-0844-7, July 2015)  Vol. 117, No. 1, pp 21–47. March 2016. Zhang, X., Funt, B. and Mirzaei, H., \"Metamer Mismatching and its Consequences for Predicting How Colours are Affected by the Illuminant,\" ICCV 2015 Workshop on Color and Photometry in Computer Vision,  Dec. 2015. Logvinenko, A.D., Funt, B., Mirzaei, H. and Tokunaga, R., \"Rethinking Colour Constancy,\"  PLOS ONE DOI: 10.1371/journal.pone.0135029, Sept. 10, 2015. Mirzaei, H. and Funt. B., \"Gaussian-Based Hue Descriptors,\" IEEE Pattern Analysis and Machine Intelligence, Vol. 37, No. 12, pp. 24441-2450, DOI 10.1109/TPAMI.2015.2420560. 2015. Logvinenko, A.D, Funt, B., and Godau, C. \"How Metamer Mismatching Decreases as the number of Colour Mechanisms Increases with Implications for Colour and Lightness Constancy,\"  Vision Research,  Volume 113, Part A, pp. 65-70, August 2015. (preprint available on ResearchGate) Mirzaei, H., and Funt, B., \" Robust Chroma and Lightness Descriptors,\" Proc. CIC'23 Twenty-Third IS&T Color Imaging Conference, Darmstadt, Oct. 2015. Hull, B. and Funt, B., \"Comparing Colour Camera Sensors Using Metamer Mismatch Indices,\"   Proc. AIC 2015  International Colour Association Conference,  Tokyo, May. 2015. Mirzaei, H., and Funt, B., \"Metamer Mismatching as a Measure of the Color Rendering of Lights,\"  Proc. AIC 2015 International Colour Association Conference,  Tokyo May 2015. Xu, L., and Funt, B., \"How Multi-Illuminant Scenes Affect Illumination Estimation Performance,\"  Proc. AIC 2015 International Colour Association Conference,  Tokyo May 2015 Agahian, F. and Funt. B., \"Spectral Compression using Subspace Clustering,\" Color Research and Application, (Article first published online:  DOI: 10.1002/col.21942, Jan. 27, 2015. Funt, B. and Bastani, P., \"Irradiance-Independent Camera Color Calibration,\" Color Research and Application, Vol. 39, No.6, pp. 540-548, Dec. 2014. Funt. B., Mirzaei, H. and Logvinenko, A., \"Metamer Mismatch Volumes of Flat Grey,\" Proc. CIC’22 Twenty Second IS&T Color Imaging Conference, Nov. 2014. Mirzaei",
  "content_length": 39805,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:30"
}