{
  "name": "Brian Curless",
  "homepage": "http://homes.cs.washington.edu/~curless",
  "status": "success",
  "content": "Brian Curless: Home page Brian Curless Professor Allen School of Computer Science & Engr. University of Washington Box 352350, Paul G. Allen Center 664 Seattle, Washington 98195-2350 Office: Allen Center 664 Phone: (206) 685-3796 Fax: (206) 543-2969 curless@cs.washington.edu http://www.cs.washington.edu/homes/curless Background Biographical sketch Honors and awards Curriculum Vitae Affiliations The UW Reality Lab Graphics and Imaging Laboratory (GRAIL) The Animation Research Labs Teaching CSE 457 Computer Graphics (undergraduate) CSE 557 Computer Graphics (graduate) CSEP 557 Computer Graphics (professional masters program) CSE 558 Advanced Topics in Computer Graphics Software VripPack: Volumetric range image processing package Snoop: Image magnifier for windows Research Below you will find a list of publications, roughly organized by topics, with links to PDF's or web pages that provide abstracts, PDF's, and supplementary materials. Recent papers Total Selfie: Generating Full-Body Selfies. Bowei Chen, Brian Curless, Ira Kemelmacher-Shlizerman, Steve Seitz, CVPR 2024. ExtraNeRF: Visibility-Aware View Extrapolation of Neural Radiance Fields with Diffusion Models. Meng-Li Shih, Wei-Chiu Ma, Lorenzo Boyice, Aleksander Holynski, Forrester Cole, Brian Curless, Janne Kontkanen, CVPR 2024. Generative Powers of Ten. Xiaojuan Wang, Janne Kontkanen, Brian Curless, Steve Seitz, Ira Kemelmacher, Ben Mildenhall, Pratul Srinivasan, Dor Verbin, Aleksander Holynski, CVPR 2024. Animating Street View. Mengyi Shan, Brian Curless, Ira Kemelmacher-Shlizerman, Steve Seitz, SIGGRAPH Asia 2023. Controllable Light Diffusion for Portraits. David Futschik, Kelvin Ritland, James Vecore, Sean Fanello, Sergio Orts-Escolano, Brian Curless, Daniel Sykora, Rohit Pandey, CVPR 2023. PersonNeRF: Personalized Reconstruction from Photo Collections. Chung-Yi Weng, Pratul P Srinivasan, Brian Curless, Ira Kemelmacher-Shlizerman, CVPR 2023. FILM: Frame interpolation for large motion. Fitsum Reda, Janne Kontkanen, Eric Tabellion, Deqing Sun, Caroline Pantofaru, Brian Curless, ECCV 2022. HumanNeRF: Free-viewpoint Rendering of Moving People from Monocular Video. Chung-Yi Weng, Brian Curless, Pratul P Srinivasan, Jonathan T Barron, Ira Kemelmacher-Shlizerman, CVPR 2022. 3D moments from near-duplicate photos. Qianqian Wang, Zhengqi Li, David Salesin, Noah Snavely, Brian Curless, Janne Kontkanen, CVPR 2022. SLIDE: Single image 3d photography with soft layering and depth-aware inpainting. Varun Jampani, Huiwen Chang, Kyle Sargent, Abhishek Kar, Richard Tucker, Michael Krainin, Dominik Kaeser, William T Freeman, David Salesin, Brian Curless, Ce Liu, ICCV 2021. Animating Pictures with Eulerian Motion Fields. Aleksander Holyinski, Brian Curless, Steven M. Seitz, Rick Szeliski, CVPR 2021. Real-Time High Resolution Background Matting. Peter Lin, Andrey Ryabtsev, Soumyadip Sengupta, Brian Curless Steve Seitz, Ira Kemelmacher-Shlizerman, CVPR 2021. No Shadow Left Behind: Removing Objects and their Shadows using Approximate Lighting and Geometry. Edward Zhang, Ricardo Martin-Brualla, Janne Kontkanen, Brian Curless, CVPR 2021. Fabrication-Aware Reverse Engineering for Carpentry. James Noeckel, Haisen Zhao, Brian Curless, Adriana Schulz, Symposium on Geometry Processing 2021. Monster Mash: A Single-View Approach to Casual 3D Modeling and Animation. Marek Marek Dvorožňák, Daniel Sýkora, Cassidy Curtis, Brian Curless, Olga Sorkine-Hornung, David Salesin, SIGGRAPH Asia 2020. Reconstructing NBA Players. Luyang Zhu, Konstantinos Rematas, Brian Curless, Steve Seitz, Ira Kemelmacher-Shlizerman, ECCV 2020. People as Scene Probes. Yifan Wang, Brian Curless, Steve Seitz, ECCV 2020. Background Matting: The World Is Your Green Screen. Soumyadip Sengupta, Vivek Jayaram, Brian Curless, Steven M. Seitz, Ira Kemelmacher-Shlizerman, CVPR 2020. 3D photography Photo Wake-Up: 3D Character Animation from a Single Photo. Chung-Yi Weng, Brian Curless, and Ira Kemelmacher-Shlizerman. CVPR 2019, Long Beach, CA, June 2019. Soccer on Your Tabletop. Konstantinos Rematas, Ira Kemelmacher-Shlizerman, Brian Curless, and Steve Seitz. CVPR 2018, Salt Lake City, Utah, June 2018. Discovering Point Lights with Intensity Distance Fields. Edward Zhang, Michael F. Cohen, and Brian Curless. CVPR 2018, Salt Lake City, Utah, June 2018. Emptying, Refurnishing, and Relighting Indoor Spaces. Edward Zhang, Michael F. Cohen, and Brian Curless. SIGGRAPH Asia 2016, Macau, December 2016. Occluding Contours for Multi-view Stereo. Qi Shan, Brian Curless, Yasu Furukawa, Carlos Hernandez, Steve Seitz, CVPR 2014, Columbus, Ohio, June 2014. The Visual Turing Test for Scene Reconstruction. Qi Shan, Riley Adams, Brian Curless, Yasutaka Furukawa, and Steven M. Seitz. 3D Vision 2013, June 2013 (Best Paper Award). Image-Based Remodeling. (video) Alex Colburn, Aseem Agarwala, Aaron Hertzmann, Brian Curless, Michael F. Cohen. IEEE TVCG, January, 2013. Photo Tours. (video) Avanish Kushal, Ben Self, Yasutaka Furukawa, David Gallup, Carlos Hernandez, Brian Curless, Steven M. Seitz. 3DimPVT, October 2012. Frequency-Space Decomposition and Acquisition of Light Transport under Spatially Varying Illumination. Dikpal Reddy, Ravi Ramamoorthi, Brian Curless. ECCV 2012, Florence, Italy, October 2012. Schematic Surface Reconstruction. Changchang Wu, Sameer Agarwal, Brian Curless, and Steven M. Seitz. CVPR 2012, Providence, RI, June 2012. Refractive Height Fields from Single and Multiple Images. Qi Shan, Sameer Agarwal, Brian Curless. CVPR 2012, Providence, RI, June 2012. Multicore Bundle Adjustment. Changchang Wu, Brian Curless, Steven M. Seitz. CVPR 2011, Colorado Springs, CO, June 2011. Autonomous Generation of Complete 3D Object Models Using Next Best View Manipulation Planning.  Michael Krainin, Brian Curless, Dieter Fox.  ICRA 2011, Shanghai, China, May 2011. Towards Internet-scale Multi-view Stereo. (video) Furukawa, Y., Curless, B., Seitz, S. M., and Szeliski, R. CVPR 2010, June 2010. Reconstructing Building Interiors from Images. Furukawa, Y., Curless, B., Seitz, Steven M., and Szeliski, R. ICCV 2009, Kyoto, Japan, September 2009. Manhattan-World Stereo. Furukawa, Y., Curless, B., Seitz, Steven M., and Szeliski, R.  CVPR 2009, Miami, Florida, June 2009. Multi-View Stereo for Community Photo Collections. Goesele, M., Snavely, N., Curless, B., Hoppe, H. and Seitz, S. M. Proceedings of ICCV 2007, Rio de Janeiro, Brazil, October 2007. A Theory Of Frequency Domain Invariants: Spherical Harmonic Identities for BRDF / Lighting Transfer and Image Consistency. Dhruv Mahajan, Ravi Ramamoorthi, and Brian Curless. IEEE Pattern Analysis and Machine Intelligence, June 2007. A Theory of Spherical Harmonic Identities for BRDF/Lighting Transfer and Image Consistency . Dhruv Mahajan, Ravi Ramamoorthi and Brian Curless, ECCV 2006, Graz , Austria , May 2006. Multiview stereo revisited.  Michael Goesele, Brian Curless, Steve Seitz, CVPR 2006, New York , NY , June 2006. A comparison and evaluation of multi-view stereo reconstruction algorithms. Steve Seitz, Brian Curless, James Diebel, Daniel Scharstein, and Rick Szeliski, CVPR 2006, New York, NY, June 2006. Shape and Spatially-Varying BRDFs From Photometric Stereo. Dan B Goldman, Brian Curless, Aaron Hertzmann, and Steven M. Seitz.  In IEEE PAMI, June, 2010. Shape and Spatially-Varying BRDFs From Photometric Stereo. Dan B Goldman, Brian Curless, Aaron Hertzmann, and Steven M. Seitz.  In ICCV 2005, Beijing, China, October 2005. Shape and motion under varying illumination: unifying structure from motion, photometric stereo, and multi-view stereo. Li Zhang, Brian Curless, Aaron Hertzmann, and Steven M. Seitz.  In ICCV 2003, Nice, France, October 2003. Spacetime stereo: shape recovery for dynamic scenes. Li Zhang, Brian Curless, and Steven M. Seitz, CVPR 2003, June 2003, Madison, Wisconsin. Rapid shape acquisition using color structured light and multi-pass dynamic programming, Li Zhang, Brian Curless, and Steve Seitz, International Symposium on 3D Data Processing Visualization and Transmission, Padova, Italy, June 2002. Surface light fields for 3D photography.  Daniel Wood, Daniel Azuma, Wyvern Aldinger, Brian Curless, Tom Duchamp, David Salesin, and Werner Stuetzle. SIGGRAPH 2000, New Orleans, LA, 24-28 July, 2000. The Digital Michelangelo Project: 3D scanning of large statues.  Marc Levoy, Kari Pulli, Brian Curless, Szymon Rusinkiewicz, David Koller, Lucas Pereira, Matt Ginzton, Sean Anderson, James Davis, Jeremy Ginsberg, Jonathan Shade, and Duane Fulk.  SIGGRAPH 2000, New Orleans, LA, 24-28 July, 2000. A volumetric method for building complex models from range images.  Brian Curless and Marc Levoy, SIGGRAPH `96, New Orleans, LA, 4-9 August 1996. Better optical triangulation through spacetime analysis.  Brian Curless and Marc Levoy, 1995 5th International Conference on Computer Vision, Boston, MA, 20-23 June 1995. Computational photography and videography Light Field Layer Matting.  Juliet Fiss, Brian Curless, Rick Szeliski.  CVPR 2015, Boston, MA, June, 2015. Photo uncrop.  Qi Shan, Brian Curless, Yasu Furukawa, Carlos Hernandez, Steve Seitz, ECCV 2014, Zurich, Switzerland, September 2014. Refocusing Plenoptic Images Using Depth-Adaptive Splatting. Juliet Fiss, Brian Curless, Rick Szeliski. ICCP 2014, Santa Clara, CA, April 2014. Candid Portrait Selection From Video. Juliet Fiss, Aseem Agarwala, Brian Curless. SIGGRAPH Asia 2012, Hong Kong, China, December 2012. Seeing through Obscure Glass. Qi Shan, Brian Curless, Tadayoshi Kohno. ECCV 2010, Crete, Greece, September 2010. Single Image Deblurring Using Motion Density Functions. Ankit Gupta, Neel Joshi, C. Lawrence Zitnick, Michael Cohen, Brian Curless. ECCV 2010, Crete, Greece, September 2010. GradientShop: A Gradient-Domain Optimization Framework for Image and Video Filtering. Bhat, P., Zitnick, C. L., Cohen, M. F., and Curless, B. ACM TOG 29(2), March 2010. Parallax Photography: Creating 3D Cinematic Effects from Stills. Zheng, K., Colburn, A., Agarwa",
  "content_length": 16165,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:23"
}