{
  "name": "Brian D. Davison 0001",
  "homepage": "http://www.cse.lehigh.edu/~brian",
  "status": "success",
  "content": "Brian D. Davison, Lehigh University, Computer Science and Engineering Dept. Brian D. Davison, Ph.D. Pronouns: He/him/his Chair, Department of Computer Science and Engineering P.C. Rossin College of Engineering and Applied Science Lehigh University Dr. Brian D. Davison is Professor and Chair of the Department of Computer Science and Engineering, Professor and Co-founder of the interdisciplinary Master's Program in Data Science, Co-founder of Lehigh's Center for Catastrophe Modeling and Resilience and the Master's Program in Catastrophe Modeling and Resilience, member (former associate director) of the Institute for Data, Intelligent Systems and Computation (I-DISC), and was Founding Director of the undergraduate minor in data science. He regularly teaches data science and previously has taught courses on data mining, web search engines, and more. During his most recent sabbatical, he worked in the Core Data Science group at Facebook (now called Meta). Dr. Davison earned his B.S. in (computer) engineering from Bucknell University and his M.S. and Ph.D. in Computer Science from Rutgers University. His research includes search, mining, recommendation and classification problems in text, on datasets, on the Web and in social networks. He is an NSF Faculty Early Career award winner. Dr. Davison's research has been supported by the National Science Foundation, the National Institutes of Health (NIH), the Defense Advanced Research Projects Agency, Microsoft, Amazon, and Sun Microsystems. Dr. Davison's CV is also available. Special opportunity for colleagues in industry, government, etc. Would you be interested in co-advising a doctoral student (who you approve) so that they learn to think in terms of research in your setting, and not just academia? Lehigh has a new program called P3 (Pasteur Partners PhD) that enables such an arrangement with me or my faculty colleagues in any STEM field, focusing on use-inspired research. Research Publications Externally-funded projects: The PRAISys project (NSF) Lehigh's Intelligent and Scalable Systems REU Site (NSF) Domain-Agnostic Dataset Search (NSF) Nanosensor Platform for Capturing Whole Disease Fingerprints (NIH+NSF) Other interdisciplinary projects: Lehigh's Center for Catastrophe Modeling Community Resilience: Perceptions Shaping Reality in Disaster Recovery Efficient, Explainable and Robust Data Scientific Methods for Smart Engineering Systems A Cross-City Knowledge Transfer Framework for Air Quality Sensing Member, Institute for Data, Intelligent Systems and Computation (I-DISC) Member, Institute for Cyber Physical Infrastructure and Energy (I-CPIE) Teaching Spring 2026: CSE 160 - Introduction to Data Science Fall 2025: DSCI 310 - Introduction to Data Science Spring 2025: CSE 160 - Introduction to Data Science Fall 2024: CSE 160 - Introduction to Data Science (not primary instructor) (earlier courses) Office Hours for Fall 2025 Thursdays 1-2pm and Fridays 3-4pm in BC 215 and zoom or other times by request. External Service Senior Associate Editor, ACM Transactions on Intelligent Systems and Technology (since 2021). Associate Editor, Frontiers in Big Data, Data Mining and Management Section (since 2018). Associate Editor, SIGKDD Explorations (since 2022) Editor-in-chief, ACM Transactions on the Web (2015-2021). Chair, WSDM Conference Steering Committee (2018-2020). Organizer or co-organizer of SIGIR 2018, WSDM 2017, SIGIR 2016, SIGIR 2015, WSDM 2014, AppWeb 2012, WSDM 2010, CES/HPC 2009, AIRWeb 2007, ECML/PKDD 2007 GraphLab Workshop, AIRWeb 2006, AIRWeb 2005, WCW 2003. Track chair, area chair or senior program committee member of WSDM 2026, SIGIR 2025, WSDM 2025, SIGIR 2024, TheWebConf 2024, WSDM 2024, SIGIR 2023, TheWebConf 2023, WSDM 2023, SIGIR 2022, TheWebConf 2022, SIGIR 2021, WSDM 2021, SIGIR 2020, WWW 2020, WSDM 2020, CIKM 2019, SIGIR 2019, WWW 2019, WSDM 2019, WWW 2018, WSDM 2018, SIGIR 2017, WSDM 2017, IJCAI 2016, WWW 2016, WSDM 2016, CIKM 2015, WWW 2015, CIKM 2014, SIGIR 2014, AAAI 2014, SIGIR 2013, AAAI 2011, WWW 2011, KDD 2010. Additional program committee membership in the past decade: CIKM 2024, CIKM 2023, WSDM 2022, BigData 2021, ASONAM 2021, WSDM 2021 Tutorials, BigData 2020, SIGIR 2020 Short Papers, HotWoT 2019, BigData 2019, SDM 2019, BigData 2018, HotWoT 2018, BigData 2017, HotWeb 2017, WWW 2017, CIKM 2016, HotWeb 2016, ACL 2016. Reviewer for funding agencies, multiple book publishers and many conferences and journals. Recent and Upcoming Travel Plans WhenWhereWhat Jul 28-31 2025San Francisco, CA CRA Summit Aug 7-8 2025Bethlehem, PA CERCat Workshop Feb 5-6 2026Houston, TX CERCat Meeting Fall 2025 Schedule (but see Google Calendar at right for specific days) WhenWhereWhat Mon 8-9:30amBethlehem Off-campus meeting (occasional) Mon 12-1:30pmLocal Restaurant Meeting with Assoc. Chair Mon 1:30-2pmOnline Meeting Mon 3:00-5:00pmPA 508 Rossin College Leadership Mtg (every other week) Tue 10-11amBC 215 Graduate Student Research Meeting Tue 11-noonBC 215 Postdoc Meeting (occassional) Tue 12-1:30pmBC 307 or PA 118 CSE Faculty Meeting (every other week) Tue 2:05-3:20pmBC 115 DSCI 310: Intro to Data Science Tue 4:45-5:45pmBIB 102 Department Chairs Exec Meeting (Monthly) Wed 8-9:30amOnline Off-campus meeting (occasional) Wed 2-3pmBC 215 Graduate Student Research Meeting Thu 8-9:30amOnline Off-campus meeting (occasional) Thu 10-11amOnline LLM Research Meeting (every other week) Thu 1-2pmBC 215 Office Hours Thu 2:05-3:20pmBC 115 DSCI 310: Intro to Data Science Thu 4-5pmHST 272 Research Meeting Fri 8-10amVaries Department Chairs Meeting (Monthly) Fri 9-10amOnline CatModeling Mtg (every other week) Fri 12:10-1:25pmVaries Rossin College Faculty Meeting (Monthly) Fri 12-12:30pmZoom Weekly Federal Updates Fri 1-2pmZoom Meeting for Independent Study Fri 2-3pmBC 215 Graduate Student Research Meetings Fri 3-4pmBC 215 Office Hours Other items of interest Dr. Davison in the news My advice to Lehigh students. Updated January 2022 Current students: Eashan Adhikarla, Xuehan Chen, Garrik Hoyt, and Yifan Zhang. Recent postdocs: Dr. Wenjuan Sun (2016-2020) Recent visitors: Dr. Qianrong Zhao Dr. Yan Fu (Beijing Normal Univ., 2011-2012) Dr. Xiannong Meng (Bucknell Univ., Spring 2012) Former undergraduate students: Mathangi Sundar (BITS-Pilani, summer and fall 2019) Yang Yi (2018) Baiyu Xiang (2017-2018) Faith Komlo (2016-2017) Elizabeth Koshelev (Brandeis University, summer of 2017) Marissa Como (Providence College, summer of 2015) Former graduate students: Jiaxin Liu (MS '25) Dan Luo (PhD '25) Zhiyu Chen (PhD '22) Youshan Zhang (PhD '21) Sicong Kuang (PhD '20) Ovidiu Dan (PhD '19) Zaihan Yang (PhD '14) William West (MS '14) Dawei Yin (PhD '13) Liangjie Hong (PhD '13) Na Dai (PhD '13) Yufei Xia (MS '13) Jennifer Bayzick Tannenbaum (MS '13) Xiaoguang Qi (PhD '12) Zhenzhen Xue (MS '10) Jian Wang (MS '09) Lan Nie (PhD '08) Shruti Bhandari (MS '08) YaoShuang Wang (MS '08) Baoning Wu (PhD '07) Vinay Goel (MS '06) Wei Zhang (MS '04) Kalyan C. Boggavarapu (MS '04) Kiran K. Komaravolu (MS '04) David B. Lewanda (MS '03) David G. Deschenes (MS '03) To Reach Me Email: davison(at)cse.lehigh.edu Office: Building C, Room 215 Mailing Address: Department of Computer Science and Engineering Lehigh University 113 Research Drive (Building C) Bethlehem, PA 18015-4731 A few sayings that I like (the wording is mine, but I've probably picked up the content elsewhere) Everything in moderation, also known in Latin as Modus omnibus in rebus. -- Ancient Greek Proverb (the Latin is from Plautus). Never ascribe to malice what you can ascribe to stupidity -- especially your own. -- See Hanlon's Razor and M.N. Plano's version The best-laid schemes o' mice an' men; Gang aft a-gley -- Robert Burns: To a Mouse (original Scots) Love like there is no tomorrow. -- Multiple popular references The perfect is the enemy of the good. -- Voltaire (loosely translated from the French) A PhD doesn't mean you are an expert in any particular subject; it just means that you could become one if you wanted to. -- Me (AFAIK) In theory, there is no difference between theory and practice. But, in practice, there is. -- Jan L. A. van de Snepscheut (attributed) Last modified: 7 November 2025",
  "content_length": 8214,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:23"
}