{
  "name": "Brigitte Jaumard",
  "homepage": "http://users.encs.concordia.ca/~bjaumard",
  "status": "success",
  "content": "Dr. Brigitte Jaumard Homepage Supply Chains Optimization algorithms for cross-docking management: assignment of trucks to door, truck scheduling, tardiness constraints, pick up and delivery, etc. Machine Learning Interplay of Optimization and Machine Learning Railway Systems Train Scheduling, Locomotive Assignment, Minimizing Fuel Consumption, Yard Management, Deadlock Avoidance Large Scale Optimization In today's digital world, with ever increasing amounts of readily-available data comes the need to solve optimization problems of unprecedented sizes. How to formulate and solve optimization problems with tens of thousands or millions of variables? Optical Networking Network Dimensioning, Seamless Service/Request Migration, Protection, Network Provisioning, SDN, SDM, RSA, NFV, etc. Wireless Networks Network Planning, Scheduling Algorithms, Overlapping Channels, Microwave, sensor, WiFi, PON networks, etc. Previous Next About Brigitte Jaumard holds a Concordia University Research Chair, Tier 1, on the Optimization of Communication Networks in the Computer Science and Software Engineering (CSE) Department at Concordia University. Her research focuses on mathematical modeling and algorithm design for large-scale optimization problems arising in communication networks, transportation and logistics networks and artificial intelligence. Recent studies include the design of efficient algorithms for network design, dimensioning and provisioning, scheduling algorithms in optical grids or clouds, in broadband wireless networks and in passive optical networks. In Artificial Intelligence, contributions include the development of efficient optimization algorithms for probabilistic logic (reasoning under uncertainty) and for automated mechanical design in social networks (design of trust estimator tools). In transportation, her recent contributions include new algorithms for freight train scheduling and locomotive assignment subject to energy minimization, as well as machine learning frameworks for efficient cross-docking. B. Jaumard has published over 300 papers in international journals in Operations Research and in Telecommunications. Latest News Brigitte Jaumard ranked among the most influential researchers in her field Brigitte Jaumard is among the top 2% of scientists in their field of research according to a recent study. based on research citations. She is a member of GERAD. More details available on GERAD website: https://www.gerad.ca/en/posts/890 Full data on the study can be downloaded here. Weekly Seminars Every Tuesday 16:00-17:00 EV 3.101, Fall 2017​ - Check out our next seminar by clicking on the Details below. Location: Concordia University - SGW Campus EV 3.101 More info Planifier la livraison de demain Brigitte Jaumard met les mathématiques au service de la distribution Il n’a jamais été aussi simple de commander en ligne le produit de ses rêves et de le recevoir à sa porte quelques jours plus tard. À l’inverse, le système de livraison permettant de soutenir la croissance exponentielle du commerce électronique est plus complexe que jamais. Heureusement, pour permettre à la distribution de suivre le rythme et de répondre aux besoins de clients de plus en plus exigeants, il y a des spécialistes comme Brigitte Jaumard.",
  "content_length": 3294,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:32"
}