{
  "name": "Brittany A. Duncan",
  "homepage": "http://cse.unl.edu/~bduncan",
  "status": "success",
  "content": "Brittany Duncan's Website Home Publications Teaching Brittany A. Duncan, Ph.D. Assistant Professor University of Nebraska-Lincoln Computer Science and Engineering 291 Schorr Center Lincoln, NE 68588 402-472-5073 bduncan [at] unl [dot] edu Research Interests My research is focused at the intersection of Artificial Intelligence, Human-Robot Interaction, and Unmanned Systems. My long-term research goal is to advance the state-of-the-art in human-drone interaction so that small Unmanned Aerial Vehicles (sUAVs) can comfortably and safely interact in proximity to a variety of people and communicate with them in a natural and efficient way across varying contexts (see Smithsonian Magazine, June 2014). I approach interactions with small Unmanned Aerial Vehicles through an exploration of behavior-based robotics and cognitive science principles. Additionally, I have been involved in extensive fieldwork through environmental applications of drones with NIMBUS, as well as urban search and rescue at the Center for Robot-Assisted Search and Rescue including 6 exercises and a deployment in 2014 to the SR-530 mudslides in Oso, Washington. About Me I am an Assistant Professor in the Computer Science and Engineering Department at the University of Nebraska-Lincoln. I am a co-Director of the NIMBUS Lab, where we study unmanned systems (with a focus on aerial robotics). I was awarded an NSF Early Faculty Career Award (CAREER) to continue studying foundational interactions between novice users and small Unmanned Aerial Vehicles. I completed my Ph.D. at Texas A&M University, studying field robotics and human-robot interaction through the Center for Robot-Assisted Search and Rescue. Education Ph.D. 2015, Texas A&M UniversityB.S. 2009, Georgia Institute of Technology web development by bryant smith",
  "content_length": 1805,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:32"
}