{
  "name": "Brittany Johnson-Matthews",
  "homepage": "https://cs.gmu.edu/~johnsonb",
  "status": "success",
  "content": "Brittany I. Johnson, Ph.D. Home Research Publications Teaching Dr. Brittany Johnson-Matthews Assistant Professor Dept. of Computer Science George Mason University Fairfax, VA johnsonb@gmu.edu (413) 461-0373 Download CV Download Research Statement Download Teaching Statement Download Diversity Statement BLACK LIVES MATTER Black in Computing: An Open Letter & Call to Action for the Computing Community Want to help? Here's some ways you can: Supporting Black lives through technology Fighting Anti-Blackness Resource List Supporting Black Lives Matter and Communities of Color Petition for racial data on coronavirus Sign other racial justice and equity related petitions Make donations (there's ways that don't require money!) If nothing else, educate yourself. If you're non-Black, listen and don't criticize. Be our allies not just in emails and private meetings, but in public and loudly. The fight is far from over. About Me I am Dr. Brittany Johnson-Matthews, an Assistant Professor in the Department of Computer Science at George Mason University. You may also know me as my pen name, Brittany Johnson. I direct the INSPIRED (INterdisciplinary Software Practice Improvement REsearch and Development) Lab. I received my Ph.D. in Computer Science from North Carolina State University (2017), after getting my B.A. in Computer Science from the College of Charleston (2011). I explore sociotechnical problems pertaining to developer productivity and software development/use, such as tool support, work environments, ethics, and software for social good. My research is interdisciplinary, cross-cutting with research in software engineering, human-computer interaction, and machine learning. Outside of work, I enjoy doing anything that allows me to be creative. From painting on canvas to painting my nails, I love to express myself! I also have a passion for mentoring and encouraging others to reach for the stars (while never forgetting who you are or where you started). Education North Carolina State University 2011-2017 Doctor of Philosophy in Computer Science A Tool (Mis)communication Theory and Adaptive Approach for Supporting Developer Tool Use [] [] College of Charleston 2007 - 2011 Bachelor of Arts in Computer Science",
  "content_length": 2238,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:33"
}