{
  "name": "Brit Ross Winthereik",
  "homepage": "https://orbit.dtu.dk/en/persons/brit-ross-winthereik",
  "status": "success",
  "content": "Brit Ross Winthereik - Welcome to DTU Research Database View Scopus Profile Brit Ross Winthereik Professor, Technology and Business Studies Professor, Head of Division, Department of Technology, Management and EconomicsScience and Technology StudiesTechnology and Business Studies https://orcid.org/0000-0002-1837-2385 EmailbrowidtudkWebsitehttp://www.man.dtu.dk Accepting PhD Students Personal profile ProfileI'm a Science and Technology Studies (STS) scholar originally trained as an anthropologist. For more than two decades, I have conducted research into the role of technology and knowledge practices in society. I have contributed to research on how digital technologies operate in and beyond organizational contexts and on the role of users. This has led to deep insights on the workings of information infrastructures with human users as a key focus area for understanding the dynamics and effects of their scope and scale. A main interest of mine is public sector digitalization and its impact on welfare service systems. A main concern revolves around mechanisms of inclusion and exclusion due to digital innovation and the intensification of data usage in the public sector. I explore these issues through concepts such as 'partially digital citizenship', 'informal digital welfare work', and 'experiential and socially thick computing'. I have contributed to and co-edited several books withing STS and anthropology and have extensive experience in leading large research projects. I supervise PhD students within the field of Science and Technology Studies. At DTU I teach the PhD course Experimenting with Ethnography and contribute to the Theory of Science BA course and the From Analytics to Action Msc course. I give many public talks in academic as well as non-academic settings. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationPhD, Erasmus University Rotterdam1 Apr 2000 → 30 Mar 2004Award Date: 1 Oct 2004 External positionsProfessor, IT University of Copenhagen1 Sept 2022 → 30 Dec 2023 KeywordsUser defined:Science and Technology Studies (STS)Anthropology of TechnologyEthnographic methodsInfrastructure StudiesGovernance and accountabilityBig DataDigital inclusionDigital citizenship Fingerprint Dive into the research topics where Brit Ross Winthereik is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Public Sector Social Sciences 100% Digitalization Computer Science 50% Wayfinding Computer Science 50% Research Collaboration Computer Science 50% Sociotechnical Network Computer Science 50% Multinationals Computer Science 50% Information and Communication Technologies Computer Science 50% Supply Chain Computer Science 50% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Publications 12 Journal article 4 Book chapter 2 Book 1 Report 1 More 1 Ph.D. thesis Research output per year Research output per year Fibreglass and steel: De-imagineering AI value claims for Danish SMEsSandbukt, S. & Winthereik, B. R., 2025, (Accepted/In press) In: Anthropological Theory.Research output: Contribution to journal › Journal article › Research › peer-review Imagineering 100% Enterprise Intelligence 16% Society Value 16% Multiple Meanings 16% Public Employment 16% Infrastructural Participation in Digital Societies: Challenges and AlternativesMarres, N., Winthereik, B. R., Fuster, G. G., Schneider, T. & Dickel, S., 2025, (Accepted/In press) In: Science and Technology Studies. 24 p.Research output: Contribution to journal › Journal article › Research › peer-review Open AccessFile And-States 100% User Participation 100% Citizen Science 100% People Data 100% Digital Education 100% 111 Downloads (Orbit) Inventorying Data: Circumvented Investment Conditions by Big Tech’s Supply Chain CapitalismSalling, C. A. & Winthereik, B. R., 2025, (Accepted/In press) In: Journal of Cultural Economy.Research output: Contribution to journal › Journal article › Research › peer-review Supply Chain 100% Multinationals 100% Supply Chain Capitalism 100% Business Models 50% Political Context 50% Data as relation: Ontological troubles in the data-driven public administrationWinthereik, B. R., 2024, In: Computer Supported Cooperative Work. 33, p. 371–388Research output: Contribution to journal › Journal article › Research › peer-review Open AccessFile Public Sector 100% Public Administration 100% Political Discourse 50% Organizational Decision-Making 50% Danish 50% 101 Downloads (Orbit) Digital InclusionWinthereik, B. R., Aanestad, M. & Mäkitalo, Å., 2024, Djøf Forlag. 179 p.Research output: Book/Report › Book › Research Digitalization 100% Digital 100% Human-Technology Interaction 100% Digital Transformation 50% Human-technology Relationship 50% View all 20 publications Projects 4 Finished 6 Active Projects per year The inclusivity challenge and computational ethnography (tentative)Duray, C. (PhD Student), Winthereik, B. R. (Main Supervisor) & Munk, A. K. (Supervisor)01/09/2025 → 31/08/2028Project: PhD Cultural value alignment with LLMsBay-Jørgensen, F. (PhD Student), Munk, A. K. (Main Supervisor) & Winthereik, B. R. (Supervisor)01/09/2025 → 31/08/2028Project: PhD Hvad koster digital inklusion? Værdisætning af inkluderende digitalisering i danske kommunerBækgaard, I. (PhD Student), Winthereik, B. R. (Main Supervisor), Bech, V. (Supervisor) & Hartig Danielsen, L. (Supervisor)01/03/2025 → 29/02/2028Project: PhD ¿Attending to alternative networks of expertise in Energy Island Bornholm¿ Nissen, E. (PhD Student), Kirkegaard, J. K. (Main Supervisor), Cronin, T. (Supervisor), Winthereik, B. R. (Supervisor) & Frantzen, D. N. (Supervisor)15/08/2024 → 14/08/2027Project: PhD Socially Sustainable Algorithms for Chronic PainLange, A. (PhD Student), Winthereik, B. R. (Main Supervisor), Lipp, B. (Supervisor) & Ziewitz, M. C. (Supervisor)01/02/2024 → 31/01/2027Project: PhD View all 10 projects Activities 14 Conference presentations 8 Talks and presentations in private or public companies and organisations 8 Guest lectures, external teaching and course activities at other universities 7 Membership in review committee 6 More 3 Participating in or organising workshops, courses, seminars etc. 2 Peer review of manuscripts 1 Participating in or organising a conference Activities per year Where to put the human in the non-places of digitalized societies and STS?Winthereik, B. R. (Guest lecturer)11 Jun 2025Activity: Talks and presentations › Conference presentations Redressing the Digital Leviathan with Science and Technology StudiesWinthereik, B. R. (Guest lecturer)10 Sept 2025Activity: Talks and presentations › Conference presentations Thinking intersectionally: Methods innovation in digitalization and energy researchWinthereik, B. R. (Guest lecturer)2 Sept 2025Activity: Talks and presentations › Conference presentations Aarhus University (External organisation)Winthereik, B. R. (Chairman)Jun 2024 → Sept 2024Activity: Membership › Membership in review committee Erasmus University Rotterdam (External organisation)Winthereik, B. R. (Chairman)29 Nov 2024Activity: Membership › Membership in review committee View all 43 activities Press/Media Supertanker: Er teknologi vores nye klimaskam?Winthereik, B. R.18/08/20251 Media contributionPress/Media: Press / Media Se tallene for alle danske kommuner: Så langt væk er regeringens AI-drømmeWinthereik, B. R.11/08/20251 Media contributionPress/Media: Press / Media Tirsdag kan 18.000 danskere ikke længere bruge MitID på telefonenWinthereik, B. R.11/08/20251 Media contributionPress/Media: Press / Media Datacentrene er en gigantisk demokratisk udfordring, der ikke er i dialog med samfundetWinthereik, B. R.16/06/20251 Media contributionPress/Media: Press / Media Amerikansk mand boede 17 år ulovligt i Danmark: »Det er meget usædvanligt«Winthereik, B. R.11/02/20251 Media contributionPress/Media: Press / Media View all 17 press/media",
  "content_length": 8485,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:36"
}