{
  "name": "Bruce J. MacLennan",
  "homepage": "http://web.eecs.utk.edu/~mclennan",
  "status": "success",
  "content": "Bruce MacLennan's home page Bruce MacLennans Home Page It would be catastrophic to become a nation of technically competent people who have lost the ability to think critically, to examine themselves, and to respect the humanity and diversity of others.  Martha Nussbaum, Cultivating Humanity: A Classical Defense of Reform in Liberal Education Bruce J. MacLennan Associate Professor Emeritus [he / his / him] Dept. of Electrical Engineering & Computer Science University of Tennessee Directory Ways to contact me Research Teaching Professional Activities Links Ways to contact me Email: MacLennan@utk.edu WWW: http://web.eecs.utk.edu/~bmaclenn/ Phone: (865) 974-3461 US Mail: Bruce J. MacLennan Department of Electrical Engineering & Computer Science The University of Tennessee 401 Min Kao EECS Bldg. Knoxville, TN 37996-2250 Research Complete List of Publications (see also Recent Papers, Presentations, etc.) Swarm Robotics for Morphogenetic Engineering Neural Information Processing Connectionist Knowledge Representation Emergent Computation Project Affiliated Faculty, NeuroNET Research Center Teaching Courses Previously Taught UT Science Forum presentation: Artificial Intelligence: Present and Future Prospects Professional Activities Fellow, Foro di Studi Avanzati Gaetano Massa Fellow, Institute for Advanced Studies, Collegium Budapest. Past Editor-in-Chief, International Journal of Nanotechnology and Molecular Computation. Fellow Member, American Nano Society. Member, Scientific Advisory Council and Scientific Cooperation Partner, INBIOSA (INtegral BIOmathics Support Action). Editorial Board member, Computational Intelligence and Neuroscience. BBS Associate, Behavioral and Brain Sciences. Member, Robotics/AI, Nanotechnology, and Scientific Freedom Advisory Boards of the Lifeboat Foundation. Links MacLennan links Research Related Links Professional Societies MacLennan links: Vita Complete list of publications Recent papers, presentations, technical reports, etc.   See my research interests for additional publications. Books by me (comments invited). A Course on Unconventional Computation: Analog, Molecular, and Quantum (available from Amazon ). Word and Flux: The Discrete and the Continuous in Computation, Philosophy, and Psychology. Volume I: From Pythagoras to the Digital Computer, The Intellectual Roots of Symbolic Artificial Intelligence, with a Summary of Volume II Continuous Theories of Knowledge (book in preparation, comments invited). Professional Societies: AAAS (American Association for the Advancement of Science) homepage and Science On-Line. IEEE Home Page including the IEEE Computer Society and the Computational Intelligence Society American Nano Society International Association for Computing and Philosophy (IACAP) International Society for Neoplatonic Studies (ISNS) American Association of University Professors (AAUP) Selected Statements from the Redbook (Policy Documents and Reports) Join the Blue Ribbon Online Free Speech Campaign! Send me mail This page is web.eecs.utk.edu/~bmaclenn Bruce MacLennan / MacLennan@utk.edu Last update: 2023-03-30.",
  "content_length": 3113,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:38"
}