{
  "name": "Bruce Robert Childers",
  "homepage": "https://www.cs.pitt.edu/~childers",
  "status": "success",
  "content": "Bruce R. Childers Bruce R. Childers Dean, School of Computing and Information Professor, Computer Science University of Pittsburgh Reproducible Computationally-Driven Science and Computer Systems Design Bio News Pubs Contact Learn More Code Diamond Code 2023—2024 School of Computing and Information Annual Report December 1, 2024: The SCI accomplished so much in the last year! Read selected highlights in our annual report. This is an amazing community, and I hope you feel the same after reviewing the report. Read more from my annual message at the SCI website. Data Science Task Force Report January 18, 2021: The Data Science Task Force completed its recommendations for a set of goals and actions to coordinate and amplify data, data methods, and their intersections with multiple disciplines at Pitt. Enjoy! Dean May 1, 2022: It is my honor to serve as Dean of the SCI. Building on the period while serving as Interim Dean (2020-2022), as a school, we will strive to be collaborative, open, and transparent, and we will pursue our goals and ideas with thoughtfulness, energy, and optimism. And most importantly, I invite you to join SCI in continuing to write our story together. Read more from my annual message at the SCI website. BMC Infectious Disease 2023 Inter-rater Reliability of the Infectious Disease Modeling Reproducibility Checklist (IDMRC) as Applied to COVID-19 Computational Model Research, Darya Pokutnaya, Willem G. Van Panhuis, Bruce R. Childers, Marquis S Hawkins, Alice E Arcury-Quandt, Meghan Matlack, Kharlya Carpio and Harry Hochheiser BMC Infectious Disease, Volume 23, Article number 733, October 27, 2023, https://doi.org/10.1186/s12879-023-08729-4 PLOS Computational Biology 2023 An implementation framework to improve the transparency and reproducibility of computational models of infectious diseases, Darya Pokutnaya, Bruce Childers, Alice E. Arcury-Quandt, Harry Hochheiser, and Willem G. Van Panhuis, PLOS Computational Biology, March 16, 2023, https://doi.org/10.1371/journal.pcbi.1010856 IEEE TCAD 2020 HPE: Hierarchical Page Eviction Policy for Unified Memory in GPUs, Qi Yu, Bruce Childers, Libo Huang, Cheng Qian, and Zhiying Wang IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems Vol. 39, No. 10, Oct. 2020 IEEE IPDPS 2020 Coordinated Prefetching and Page Eviction for Memory Oversubscription Management in GPUs, Qi Yu, Bruce Childers, Libo Huang, Cheng Qian, Hui Quo, and Zhiying Wang, IEEE Int'l. Parallel and Distributed Processing Symposium, New Orleans, Louisiana, May 2020 ACM CF 2018 CMH: Compression Management for Improving Capacity in the Hybrid Memory, Cheng Qian, Bruce R. Childers, Libo Huang, Qi Yu and Zhiying Wang, ACM Int'l. Conference on Computing Frontiers, Ischia, Italy, May 2018 ISCA 2017 Quality of Service Support for Fine-Grained Sharing on GPUs, Zhenning Wang, Jun Yang, Rami Melhem, Bruce R. Childers, Youtao Zhang and Minyi Guo, International Symposium on Computer Architecture (ISCA), Toronto, Canada, June 2017 ACM TODAES 2017 On the Restore Time Variations of Future DRAM Memory, Xianwei Zhang, Youtao Zhang, Bruce R. Childers and Jun Yang, ACM Transactions on Design Automation of Electronic Systems (TODAES), Volume 22, Issue 2, February 2017 HPCA 2016 Restore Truncation for Performance Improvement in Future DRAM Systems, Xianwei Zhang, Youtao, Zhang, Bruce R. Childers and Jun Yang, IEEE International Symposium on High Performance Computer Architecture, Barcelona, Spain, March 2016 HPCA 2016 Simultaneous Multikernel GPU: Multi-tasking Throughput Processors via Fine-Grained Sharing, Zhenning Wang, Jun Yang, Rami Melhem, Bruce R. Childers, Youtao Zhang and Minyi Guo, IEEE International Symposium on High Performance Computer Architecture, Barcelona, Spain, March 2016 HPCA 2015 Supporting Superpages in Non-Contiguous Physical Memory, Yu Du, Miao Zhou, Bruce R. Childers, Daniel Mosse' and Rami Melhem, IEEE International Symposium on High Performance Computer Architecture, San Francisco, California, February 2015",
  "content_length": 4030,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:42"
}