{
  "name": "Bruce W. Char",
  "homepage": "http://drexel.edu/cci/contact/Faculty/Char-Bruce",
  "status": "success",
  "content": "Bruce Char | Drexel CCI Skip to main content Bruce CharProfessor Emeritus Pronouns: he/him/his/himselfComputer Science Emailcharbw@drexel.eduWebsite(s)http://www.cs.drexel.edu/~bchar Bruce CharProfessor Emeritus Pronouns: he/him/his/himselfComputer ScienceBiographyDr. Char's research interests include computer algebra (systems, applications, theory); symbolic/numeric computing; scientific computation; parallel and distributed computation; computer environments for technical problem solving; software components for scientific computation; and educational uses of computer technology for computer science and engineering instruction. Dr. Char works in the areas of symbolic and numeric mathematical computation, parallel computation, interactive multimedia for education and problem-solving environments. Dr. Char was instrumental in developing Maple, a general purpose computer algebra system that performs both symbolic and numerical calculations and has facilities for interactive two- and three-dimensional graphics. Prior to joining the Drexel faculty, he was a professor in the Department of Computer Science at the University of Tennessee at Knoxville. Dr. Char is a member of the Association for Computing Machinery, the Mathematical Association of America, the IEEE Computer Society, and the Society for Industrial and Applied Mathematics. He is the author or co-author of five books and more than 70 articles and papers.Research InterestsSymbolic mathematical computation, algorithms and systems for computer algebra, parallel and distributed computation, computer science education, use of computing for STEM education.Academic Distinctions PhD, Electrical Engineering and Computer Science, University of California BA, Mathematics (with Honors), Swarthmore College CV Select Publications ”Representing and characterizing handwritten mathematical symbols through succinct functional approximation” by Bruce Char. Internatiional Conference onDocument Analysis and Recognition. pp. 1198-1202. IEEE Computer Society, 2007. ”LinBox and future high performance computer algebra” (Extended Abstract),by Bruce W. Char, B. David Saunders, Bryan S. Youse. Proceedings of PASCO 2007, pp. 102-103. ACM Press 2007. “Redesigning Computer Programming Using Multi-level Online Modules for Mixed Audience”, by Nira Herrmann, Jeffrey L. Popyack, Bruce Char, Paul Zoski, and others. To appear Proceedings of 34th SIGCSE Technical Symposium on Computer Science Education Reno, Nevada, Feb. 2003. ACM Press, 2003 Grant Awards Mathworks, \"Computation for engineering: a first course\", $40,000. 2013-15. National Science Foundation, “East Coast Computer Algebra Day 2006”, $7000. 2006. National Science Foundation, “ East Coast Computer Algebra Day 2004”, $6,800. 2004. National Science Foundation, “ITR: Beowulf Analysis Symbolic INterfce (Basin), with Stephen McMillan, Peter Voegeley, Michael Goldberg, Peter MacNeice. $1486500. 2003-2006. National Science Foundation, “IERI: Tools for mathematics communication in education”, with Jeremy Johnson, Thomas Hewett, Stephen Weimar, $1486500. 2003-2006. National Science Foundation, “Restructuring Computer Programming Courses for IT-Enabled Variable Paced Multilevel Learning”. With Jeff Popyack (Drexel,PI), Nira Herrmann. $74954. January 2001-December 2002. Awards & Recognition Nominated, best faculty mentor award, Drexel University Pennoni Honors College STAR Summer Reseearch program, 2011. Excellence in Teaching Award, Drexel University College of Engineering, 2004. 106 Research Funding Award, Drexel University, 2003. Best Poster Award, Drexel Research Day 2002. (shared with Christopher Cera, Nira Herrmann,Jeffrey Popyack, Paul Zoski, and others). ACM Service Award for performance as General Chair of ISSAC’97 conference. Science Alliance Award (University of Tennessee), 1988, 1989. Professional Activities & Associations Association for Computing Machinery Special Interest Group on Symbolic and Algebraic Computation Special Interest Group on Automata and Computability Theory Special Interest Group on Computer Science Education American Society for Engineering Education Computers in Education Division",
  "content_length": 4163,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:42"
}