{
  "name": "Bruce A. Draper",
  "homepage": "http://www.cs.colostate.edu/~draper",
  "status": "success",
  "content": "General Information Bruce A. Draper Professor Department of Computer Science General Information About Me I am a professor of Computer Science at Colorado State University; I also hold an appointment in the Molecular, Cellular and Integrated Neuroscience (MCIN) program and work with the CSU Energy Institute. I teach at virtually all levels of the curriculum. At the graduate level I often teach CS510 (Image Computation) and CS540 (Artificial Intelligence) . My research is in recognizing people, their gestures, and their actions, and applying this to complex systems of interacting people and machines. I have served the field in many capacities, including as General Chair of CVPR in 1999 and a senior program committee member for AAAI in 2015, 2016 and 2019. About the Lab Interested in the kind of work we do? Here is a recent interview from the 2018 IEEE Conference on Intelligent Systems... Ross Beveridge and I co-direct the computer vision lab. If you are a graduate student at CSU interested in computer vision, you should attend our weekly lab meetings. Students who are seriously interested in computer vision should take CS410 (Computer Graphics) in the fall of their first year, and CS510 (Image Computation) in the spring. If you are not currently a graduate student at CSU but are interested in a funded graduate research assistent position in the lab, you should first apply to the CS Department. Applying is free and online. When you apply, indicate that you are interested in working with either Ross Beveridge or myself, and your application will automatically by sent to us for consideration (if you meet the department's standards). Be aware that funded positions are highly competitive. The characteristics we look for are Research potential (e.g. publications, lab experience, letters of recommendation) Mathematical ability (M GRE scores, courses, grades) Programming ability (work experience, grades), and Written/oral presentation ability (quality of writing, V GRE, letters of recommendation). Quick Links CS540 CS Department CNS CSU Session Time 0 Secs. Originating IP 169.150.222.78 User: Guest Apply to CSU | Contact CSU | Disclaimer | Equal Opportunity Colorado State University, Fort Collins, CO 80523 USA © 2016 Colorado State University",
  "content_length": 2273,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:34"
}