{
  "name": "Bruce N. Walker",
  "homepage": "http://sonify.psych.gatech.edu/~walkerb",
  "status": "success",
  "content": "Bruce Walker Bruce N. Walker, PhD Professor School of Psychology and School of Interactive Computing Georgia Institute of Technology Office: J.S. Coon Building, Room 230 Phone: +1 (404) 894-8265 bruce.walker@psych.gatech.edu sonify.psych.gatech.edu/~walkerb Home Research Sonification Lab Publications Affiliations Classes Contact Research interests: Human Computer Interaction, User Centered Design, Auditory Displays, Data Sonification, Assistive Technology, User Interfaces in Driving. My overarching goal is to ensure that technology is developed with the end user in mind. All aspects of design, implementation, adoption, and use of a system or device can be enhanced by considering the perceptual, cognitive, and social needs and abilities of those who will use it. Research in my Sonification Lab focuses on three main areas: 1. Sonification and auditory displays. Determining which type of display is appropriate for a system, and then how best to implement it, is a growing challenge, especially as devices continue to shrink in size. The use of sound to communicate information has become more common, but there is little theory to guide auditory display designers. Therefore, we study the perception and understanding of auditory displays, and helping to build up both the theoretical and practical foundations. In particular, our lab studies sonification, the use of sound to display and analyze scientific data. Our findings about how listeners interpret these auditory graphs is leading to more effective data exploration tools, for both sighted and visually impaired researchers and students. 2. Human-Computer Interaction (HCI) in Non-Traditonal Interfaces. In situations where there is not necessarily a monitor, keyboard, mouse, etc., what are the best ways to create a successful interaction between the user and the system? Designers need to \"think outside the box\" and utilize novel interaction style, non-traditional interfaces, and make use of all sensory modalities. Certainly auditory displays fit into this category. However, tactile, voice, and vibration interfaces also apply, as do many others we have not even imagined yet! 3. Psychological and social factors in the adoption and use of technology. When first introduced, any new technology will raise both fears and excitement. What are the traits that help a new technology to become accepted and adopted by users so much that it becomes part of our daily lives (e.g., telephones, microwaves, electronic mail)? I am beginning to examine the many factors that contribute to the evolution of a device from \"new technology\" to \"household appliance\". Some other areas of my recent research include: HCI in unique task environments such as the International Space Station; delivery of government services through various channels (Web, telephone, and touch-screen kiosks); stimulus-response compatibility in the design of interface controls; and the use of sound in the teaching of statistical concepts. But who is this guy? I a professor at Georgia Institute of Technology, with joint appointments in the School of Psychology and the School of Interactive Computing. In addition, I am a member of Georgia Tech's HCI faculty and HCC faculty, as well as the Graphics, Visualization, and Usability (GVU) Center. I coordinate the Psychology Track in the GT Masters Program in HCI (MS-HCI). I completed my Ph.D. at Rice University (2001) in Psychology (Human Factors and Human-Computer Interaction). My Disseration was entitled Magnitude Estimation of Conceptual Data Dimensions for Use in Sonification. You can also check out what I did for my Masters: Congruency Effects with Dynamic Auditory Stimuli. In case you're wondering, I was born at a very early age in Montreal, Canada, and grew up all across the Great White North. I've spent time in many of Canada's major cities (from Montreal to Toronto, Saskatoon, Victoria, even Nanaimo...). As a teenager I attended Lester B. Pearson College, one of the United World Colleges, where I forged friendships with kindred spirits from all over the world. I have enjoyed traveling a lot, visiting many friends, and taking a fair few photographs along the way. I practice the defensive art of Ju Jutsu, and am interested in Human Languages, and people and places that promote Peace and International Understanding. Bruce N. Walker, PhD (bruce.walker@psych.gatech.edu) School of Psychology Georgia Institute of Technology, MS-0170 654 Cherry Street Atlanta, GA 30332-0170 USA (UWCPC86-88)",
  "content_length": 4505,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:39"
}