{
  "name": "Bruce Hartpence",
  "homepage": "http://www.brucehartpence.com",
  "status": "success",
  "content": "Bruce Hartpence Expert Network Education and Services for Small BusinessesExpert Network Education and Services for Small BusinessesExpert Network Education and Services for Small BusinessesExpert Network Education and Services for Small BusinessesTransforming professionals and businesses with data networking and AI.Contact us for more information Education, Network design, surveysExperienceWith nearly 30 years of experience in networking and machine learning, let us help your small businesses succeed in today's digital landscape. We are an easy choice for custom training or expert insight for the Rochester area. Solutions for Your BusinessCustom Network TrainingNetwork Design, ML/AI, WirelessNetwork Design, ML/AI, WirelessLet's build a training program that fits your needs and goals for the future. Optimize, refresh and power your workforce with communication expertise.Network Design, ML/AI, WirelessNetwork Design, ML/AI, WirelessNetwork Design, ML/AI, WirelessGet the most out of your small business wired network or artificial neural networks with onsite review and free initial consultation. Or get started expanding your wireless coverage with a site survey.Experienced Expert WitnessAuthor and Video Content CreatorAuthor and Video Content CreatorNeed an opinion for a patent or technical case? Count on standards, confidentiality and professionalism.Author and Video Content CreatorAuthor and Video Content CreatorAuthor and Video Content CreatorAuthor and video series creation for O'Reilly media and originator of all content for our popular youtube channel: https://www.youtube.com/@BruceHartpence Contact UsNameEmail*Attach FilesAttachments (0)SendThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.info@brucehartpence.com Copyright © 2025 Bruce Hartpence - All Rights Reserved.Privacy PolicyPowered by This website uses cookies.We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.Accept",
  "content_length": 2069,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:35"
}