{
  "name": "Bruno Feijó",
  "homepage": "http://www.icad.puc-rio.br/bfeijo",
  "status": "success",
  "content": "Bruno Feijó | ICAD/VisionLab Founder and General Coordinator Research Groups:  Games; VFX & Animation; Interactive Storytelling; Gamification; Education Contact email:  at domain P: +55 21 3527-1500 #4308 Curriculum Vitae (as of Nov 25, 2014) Official CNPq CV (in Portuguese): lattes.cnpq.br/8249534204731109 Associate Professor, Department of Informatics, PUC-Rio, Rio de Janeiro, Brazil Credits Bruno Feijó is Associate Professor of the Department of Informatics, PUC-Rio, Brazil, in the group of Computer Graphics. Also he is the founder and current coordinator of the ICAD/VisionLab Laboratory. He is pioneer in Brazil in the interdisciplinary areas of computer-aided design (CAD), animation, visual effects (VFX), digital entertainment, and games. He also has contributions to education in the field of technological innovation, from the secondary school level to the post-graduation level. Education PhD, University of London/Imperial College (1988) MSc, PUC-Rio (1980) Aeronautics Engineer, ITA (1975) Sabbatical Leave Columbia University, New York, NY, USA, 2015 – 2016 Jobs Pontifical Catholic University of Rio de Janeiro (PUC-Rio), Associate Professor, 1988 – current Imperial College, Honorary Lecturer, 1989 – 1993 Imperial College, Research Assistant, 1984 – 1988 Control Data, Senior Computer Systems Analyst, 1978 – 1982 Promon Eng., Senior Computer Systems Analyst, 1982 – 1984 J.Mason Cons. & Proj, Engineer, 1976 – 1978 ITA, Research Assistant, 1974 – 1975 Areas of Interest Games; Computer Graphics and Animation; Visual Effects (VFX); Interactive Storytelling; Digital TV; Multimedia; Gamification; Education Short Bio Bruno Feijó is Associate Professor of the Dept. of Informatics/PUC-Rio, Brazil, in the group of Computer Graphics, CNPq researcher Level 1, founder and coordinator of the ICAD/VisionLab (Research Lab on Visualization, Digital TV/Cinema, and Games) of PUC-Rio, one of the main designers of the multimedia course for the technical secondary level of NAVE/Oi Futuro (2008), one of the founders of the Special Commission of Games and Digital Entertainment of the Brazilian Computer Society – SBC (2002), PhD from University of London/Imperial College (1988), and engineer from Technological Institute of Aeronautics – ITA (1975). He worked several years in the industry, in the area of computer-aided design, before starting his doctoral studies in London (UK) and getting a research/lecture post in the Dept. of Informatics/PUC-Rio in 1988. He played a decisive role in the formation of the Brazilian academic community of games – an area that had a strong rejection by the academy. Also he is one of the founders of the Brazilian Symposium on Computer Games and Digital Entertainment – SBGames (2000). Bruno Feijó was the advisor of more than 15 doctoral dissertations and 40 master’s thesis. He wrote more than 30 journal papers, 12 book chapters, and 70 conference papers. He is one of the authors of a text book introducing programming through videogames. Several works by his students have being contemplated by national and international awards. Moreover, some of his students have attracted attention from startup investors and research centers abroad. His current research interests are on interdisciplinary areas he was a pioneer in Brazil: animation, visual special effects, digital entertainment, and games. His studies and proposed models for innovation and education go from the secondary school level up to post-graduation programs and technology incubators. In Brazil, some of his studies are used as guidelines for industrial policy for the sectors of visualization, audiovisual, and creative industries. He was the editor of the series Media Technology by Elsevier Brasil, with 30 volumes (2010-2012) on technology for the new digital media. His works on new digital technology can be found in several scenes with special effects for TV and innovative processes for digital TV/Cinema in Brazil. Publications (1989 – today) Projects Courses",
  "content_length": 3993,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:59"
}