{
  "name": "Bruno Bauwens",
  "homepage": "https://www.hse.ru/en/org/persons/160550073",
  "status": "success",
  "content": "Staff - Bruno Frederik Bauwens – HSE University В старых версиях браузеров сайт может отображаться некорректно. Для оптимальной работы с сайтом рекомендуем воспользоваться современным браузером.AAAABCABCABCАААААRegular version of the siteCampus in MoscowNizhny NovgorodSaint PetersburgPermRUENFor visually-impairedFor visually-impairedUser profile (HSE staff only)SearchSearchAdvanced searchMenuHSE UniversityHSE UniversityAbout HSEFaculty and StaffBruno Frederik BauwensRUENUser profile (HSE staff only)SearchAdvanced search  HomeTeachingResearch and PublicationsEmployment historyIn HSE news Language ProficiencyEnglishFrenchDutchContactsPhone:27240Address: 11 Pokrovsky Bulvar, Pokrovka Complex, room S834TimetableORCID: 0000-0002-6138-0591ResearcherID: N-2695-2015Scopus AuthorID: 26427988700Google ScholarOffice hoursWednesday 14h00-18h00SupervisorsN. VereshchaginE. SokolovPrintable versionwith publicationswith newsPrintHave you spotted a typo?Highlight it, click Ctrl+Enter and send us a message. Thank you for your help!To be used only for spelling or punctuation mistakes.Bruno Frederik BauwensAssociate Professor: Faculty of Computer Science / Big Data and Information Retrieval SchoolBruno Frederik Bauwens has been at HSE University since 2015.  HomeTeachingResearch and PublicationsEmployment historyIn HSE newsEducation and Degrees2010PhDGhent University2005Master's in EngineeringGhent University2003Bachelor's in MathematicsGhent University2002Bachelor's in EngineeringGhent UniversityProfessional InterestsComputational ComplexityKolmogorov complexitySupervisor of the following Doctoral thesesfor a Candidate of Sciences degree1Y. Ivanashev Classification and Study of Сomplexity Properties Of Problems that are Associated with Counting of The Number of Paths of Nondeterministic AlgorithmsCourses (2025/2026)Computational Complexity Theory (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 4 year, 1-3 module)EngStatistical Learning Theory (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)EngStatistical Learning Theory (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 4 year, 1, 2 module)EngTheory of Computation (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)EngPast CoursesCourses (2024/2025)Computational Complexity Theory (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 4 year, 1-3 module)EngStatistical Learning Theory (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)EngStatistical Learning Theory (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 4 year, 1, 2 module)EngTheory of Computation (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)EngCourses (2023/2024)Computational Complexity Theory (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 4 year, 1-3 module)EngStatistical Learning Theory (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 4 year, 1, 2 module)EngStatistical Learning Theory (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)EngTheoretical Informatics (Postgraduate course field of study Postgraduate Studies, field of study Postgraduate Studies; 1 year, 1 semester)EngTheory of Algorithms (Mago-Lego; 1, 2 module)RusTheory of Algorithms (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 1 year, 1, 2 module)RusTheory of Computation (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)EngCourses (2022/2023)Computational Complexity (Mago-Lego; 1 module)EngComputational Complexity (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics, field of study Applied Mathematics and Informatics; 2 year, 1 module)EngComputational Complexity Theory (Bachelor’s programme; Faculty of Computer Science field of study Software Engineering; 4 year, 1-3 module)EngComputational Learning Theory (Mago-Lego; 1 module)EngComputational Learning Theory (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics, field of study Applied Mathematics and Informatics; 2 year, 1 module)EngStatistical Learning Theory (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 4 year, 1, 2 module)EngStatistical Learning Theory (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)EngStatistical Learning Theory (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 2 year, 1, 2 module)EngStatistical Learning Theory (Mago-Lego; 1, 2 module)EngTheoretical Computer Science 2 (Postgraduate course; Faculty of Computer Science field of study Computer and Information Scienc; 2 year, 1 semester)EngTheoretical Informatics (Postgraduate course field of study Postgraduate Studies; 1 year, 1 semester)EngTheory of Computation (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)EngTheory of Computation (Mago-Lego; 1, 2 module)RusTheory of Computation (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 1 year, 1, 2 module)RusCourses (2021/2022)Statistical Learning Theory (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 2 year, 1, 2 module)EngStatistical Learning Theory (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)EngStatistical Learning Theory (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 4 year, 1, 2 module)EngTheory of Computation (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)EngTheory of Computation (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 1 year, 1, 2 module)EngCourses (2020/2021)Research Seminar (Postgraduate course; Faculty of Computer Science field of study Informatics and Computer Engineering; 3 year, 1, 2 semester)RusResearch Seminar (Postgraduate course; Faculty of Computer Science field of study Computer and Information Scienc, field of study Informatics and Computer Engineering; 2 year, 2 semester)RusResearch Seminar (Postgraduate course; Faculty of Computer Science field of study Computer and Information Scienc, field of study Informatics and Computer Engineering)EngStatistical Learning Theory (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 4 year, 1, 2 module)EngStatistical Learning Theory (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)EngStatistical Learning Theory (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 2 year, 1, 2 module)EngTheoretical Computer Science (Postgraduate course; Faculty of Computer Science field of study Computer and Information Scienc, field of study Informatics and Computer Engineering; 2 year, 1 semester)EngTheory of Computation (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 1, 2 module)EngTheory of Computation (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 1 year, 1, 2 module)EngTimetable for todayFull timetableConferencesPapers in refereed international conferences 1. BB and M. Zimand. Linear list-approximation for short programs (or the power of a few random bits). In the 29th Conference on Computational Complexity (CCC 2014), November 2013 2. BB. Asymmetry of the Kolmogorov complexity of online predicting odd and even bits. In the 31st International Symposium on Theoretical Aspects of Computer Science (STACS 2014), volume 25 of Leibniz International Proceedings in Informatics (LIPIcs), pages 125–136, Dagstuhl, Germany, 2014 3. BB, A. Makhlin, N. Vereshchagin, and M. Zimand. Short lists with short programs in short time. In the 28th Conference on Computational Complexity (CCC 2013), June 2013 4. BB. Complexity of complexity and maximal plain versus prefix-free Kolmogorov complexity. In Proceedings of the 39th International Colloquium on Automata, Languages and Programming (ICALP 2012), February 2012 5. BB. m-sophistication. In Proceedings of the 6th Conference on Computability in Europe (CiE 2010), July 2010 6. D. Devlaminck, W. Waegeman, BB, B. Wyns, G. Otte, and P. Santens. From circular ordinal regression to multilabel classification. In ECML 2010 Workshop on Preference Learning, Barcelona, Spain, September 2010 7. D. Devlaminck, W. Waegeman, B.Bauwens, B.Wyns, G.Otte, L.Boullart, and P.Santens. Directional predictions for 4-class bci data. In Proceedings of the 18th conference on Artificial Neural Networks, Computational intelligence, and Machine learning, pages 153–158, Brugge, April 2009 8. H. Cani`ere, BB, C. T’Joen, L. Boullart, and M. De Paepe. Classification of horizontal two-phase flow using support vector machines with capacitance signals. In Proceedings of the IIR International Congress of Refrigeration, pages 21–26, 2007 9. H. Cani`ere, BB, C. T’J",
  "content_length": 14378,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:43"
}