{
  "name": "Bruno F. Ribeiro",
  "homepage": "https://www.cs.purdue.edu/homes/ribeirob",
  "status": "success",
  "content": "Bruno Ribeiro - Purdue University Bruno Ribeiro Associate Professor of Computer Science Purdue University Hall of Data Science and AI 3142 Department of Computer Science Purdue University West Lafayette, IN ribeirob@purdue.edu Curriculum Vitae [PDF] Recent News (Spring 2025): The CS58700 Foundations of Deep Learning course has reached maximum capacity. However, we anticipate that some seats may become available after the initial week of classes since the class is at 9:30am.If you are interested in enrolling, we recommend waiting until after the first week of classes Upcoming talk at the Joint Mathematics Meeting on the Mathematics of Graph Foundation Models: Jan 8th, 2025, 1-2pm.\"As we exhaust sequential data for training LLMs, relational data remains mostly untapped. In this talk we will explore the mathematical challenges and potential solutions for harnessing relational data in foundation models.\" Congratulations to Beatrice Bevilacqua for her 2024 MIT EECS Risiting Stars award. I am back from my sabbatical at Stanford. Current Students PhD Beatrice Bevilacqua Jincheng Zhou Yucheng Zhang MSc Ipsit Mantri Undergraduate Former Students PhD S Chandra Mouli (Ph.D. 2024, Applied Scientist @ Meta) Yangze Zhou (Ph.D. 2024, Applied Scientist @ Spotify) Jianfei Gao (Ph.D. 2023, Applied Scientist @ Amazon) Leonardo Cotta (Ph.D. 2022, Postdoctoral Fellow @ Vector Institute) Bala Srinivasan (Ph.D. 2022, Senior Applied Scientist and Tech Lead @ Amazon) Mayank Kakodkar (Ph.D. 2022, Applied Scientist @ Amazon) Ryan Murphy (Ph.D. 2021, Financial Industry Regulatory Authority) Undergraduate Kevin Xia (now PhD student at Columbia) Jack Good (now PhD student at CMU) Publications See complete list at Google Scholar 2025 Yangyi Shen, Jincheng Zhou, Beatrice Bevilacqua, Joshua Robinson, Charilaos Kanatsoulis, Jure Leskovec, Bruno Ribeiro Zero-Shot Generalization of GNNs over Distinct Attribute Domains ICML 2025 BibTex | pdf @inproceedings{shen2025stage, title={Zero-Shot Generalization of GNNs over Distinct Attribute Domains}, author={Shen, Yangyi and Zhou, Jincheng and Bevilacqua, Beatrice and Robinson, Joshua and Kanatsoulis, Charilaos and Leskovec, Jure and Ribeiro, Bruno}, booktitle={ICML}, year={2025} } Abd Alrhman AlQiam,Zhuocong Li, Satyajeet Singh Ahuja, Zhaodong Wang, Ying Zhang, Sanjay Rao, Bruno Ribeiro, Mohit Tawarmalani Hattrick: Solving Multi-Class TE using Neural Models SIGCOMM 2025 BibTex | OpenReview @inproceedings{alqiam2025hattrick, title={Hattrick: Solving Multi-Class TE using Neural Models}, author={AlQiam, Abd Alrhman and Li, Zhuocong and Ahuja, Satyajeet Singh and Wang, Zhaodong and Zhang, Ying and Rao, Sanjay and Ribeiro, Bruno and Tawarmalani, Mohit}, booktitle={ACM SIGCOMM}, year={2025} } Kenneth Lee, Bruno Ribeiro, Murat Kocaoglu Constraint-based Causal Discovery from a Collection of Conditioning Sets UAI 2025 BibTex | OpenReview @inproceedings{bevilacqua2025holo, title={Constraint-based Causal Discovery from a Collection of Conditioning Sets}, author={Lee, Kenneth and Ribeiro, Bruno and Kocaoglu, Murat}, booktitle={UAI}, year={2025} } Beatrice Bevilacqua, Joshua Robinson, Jure Leskovec, Bruno Ribeiro Holographic Node Representations: Pre-training Task-Agnostic Node Embeddings ICLR 2025 BibTex | OpenReview @inproceedings{bevilacqua2025holo, title={Holographic Node Representations: Pre-training Task-Agnostic Node Embeddings}, author={Bevilacqua, Beatrice and Robinson, Joshua and Leskovec, Jure and Ribeiro, Bruno}, booktitle={ICLR}, year={2025} } Parjanya Prajakta Prashant, Seyedeh Baharan Khatami, Bruno Ribeiro, Babak Salimi Scalable Out-of-Distribution Robustness in the Presence of Unobserved Confounders AISTATS 2025 BibTex @inproceedings{prashant2025scaleOOD, title={Scalable Out-of-Distribution Robustness in the Presence of Unobserved Confounders}, author={Prashant, Parjanya Prajakta and Khatami, Seyedeh Baharan and Ribeiro, Bruno and Salimi, Babak}, booktitle={AISTATS}, year={2025} } Kaiyuan Zhang, Siyuan Cheng, Guangyu Shen, Bruno Ribeiro, Shengwei An, Pin-Yu Chen, Xiangyu Zhang, Ninghui Li CENSOR: Defense Against Gradient Inversion via Orthogonal Subspace Bayesian Sampling NDSS, 2025 BibTex @inproceedings{zhang2025censor, title={CENSOR: Defense Against Gradient Inversion via Orthogonal Subspace Bayesian Sampling}, author={Zhang, Kaiyuan and Cheng, Siyuan and Shen, Guangyu and Ribeiro, Bruno and An, Shengwei and Chen, Pin-Yu and Zhang, Xiangyu and Li, Ninghui}, booktitle={Network and Distributed System Security Symposium}, year={2025} } 2024 Krishna Sri Ipsit Mantri, Xinzhi Wang, Carola-Bibiane Scönlieb, Bruno Ribeiro, Beatrice Bevilacqua, Moshe Eliasof DiGRAF: Diffeomorphic Graph-Adaptive Activation Function NeurIPS, 2024 BibTex @inproceedings{mantri2024digraf, title={DiGRAF: Diffeomorphic Graph-Adaptive Activation Function}, author={Mantri, Krishna Sri Ipsit and Wang, Xinzhi and Scönlieb, Carola-Bibiane and Ribeiro, Bruno and Bevilacqua, Beatrice and Eliasof, Moshe}, booktitle={Advances in Neural Information Processing Systems}, year={2024} } Mikhail Galkin, Jincheng Zhou, Bruno Ribeiro, Jian Tang, Zhaocheng Zhu A Foundation Model for Zero-shot Logical Query Reasoning NeurIPS, 2024 BibTex @inproceedings{galkin2024foundation, title={A Foundation Model for Zero-shot Logical Query Reasoning}, author={Galkin, Mikhail and Zhou, Jincheng and Ribeiro, Bruno and Tang, Jian and Zhu, Zhaocheng}, booktitle={Advances in Neural Information Processing Systems}, year={2024} } Shirley Wu, Kaidi Cao, Bruno Ribeiro, James Zou, Jure Leskovec GraphMETRO: Mitigating Complex Graph Distribution Shifts via Mixture of Aligned Experts NeurIPS, 2024 BibTex @inproceedings{wu2024graphmetro, title={GraphMETRO: Mitigating Complex Graph Distribution Shifts via Mixture of Aligned Experts}, author={Wu, Shirley and Cao, Kaidi and Ribeiro, Bruno and Zou, James and Leskovec, Jure}, booktitle={Advances in Neural Information Processing Systems}, year={2024} } Abd AlRhman AlQiam, Yuanjun Yao, Zhaodong Wang, Satyajeet Singh Ahuja, Ying Zhang, Sanjay Rao, Bruno Ribeiro, Mohit Tawarmalani Transferable Neural WAN TE for Changing Topologies ACM SIGCOMM, 2024 BibTex @inproceedings{alqiam2024transferable, title={Transferable Neural WAN TE for Changing Topologies}, author={AlQiam, Abd AlRhman and Yao, Yuanjun and Wang, Zhaodong and Ahuja, Satyajeet Singh and Zhang, Ying and Rao, Sanjay and Ribeiro, Bruno and Tawarmalani, Mohit}, booktitle={ACM SIGCOMM}, year={2024} } Mai Elkady, Thu Bui, Bruno Ribeiro, David I. Inouye Vertical Validation: Evaluating Implicit Generative Models for Graphs on Thin Support Regions UAI, 2024 PDF | BibTex @inproceedings{elkady2024vertical, title={Vertical Validation: Evaluating Implicit Generative Models for Graphs on Thin Support Regions}, author={Elkady, Mai and Bui, Thu and Ribeiro, Bruno and Inouye, David I.}, booktitle={Conference on Uncertainty in Artificial Intelligence}, year={2024} } Jiacheng Li, Ninghui Li, Bruno Ribeiro MIST: Defending Against Membership Inference Attacks Through Membership-Invariant Subspace Training USENIX Security, 2024 BibTex | arXiv @inproceedings{li2024mist, title={MIST: Defending Against Membership Inference Attacks Through Membership-Invariant Subspace Training}, author={Li, Jiacheng and Li, Ninghui and Ribeiro, Bruno}, booktitle={USENIX Security Symposium}, year={2024} } S Chandra Mouli, Muhammad Alam, Bruno Ribeiro MetaPhysiCa: Improving OOD Robustness in Physics-informed Machine Learning ICLR, 2024 (spotlight) BibTex | arXiv @inproceedings{mouli2024metaphysica, title={MetaPhysiCa: Improving OOD Robustness in Physics-informed Machine Learning}, author={Mouli, S Chandra and Alam, Muhammad and Ribeiro, Bruno}, booktitle={International Conference on Learning Representations}, year={2024} } Beatrice Bevilacqua, Moshe Eliasof, Eli Meirom, Bruno Ribeiro, Haggai Maron Efficient Subgraph GNNs by Learning Effective Selection Policies ICLR, 2024 BibTex | arXiv @inproceedings{bevilacqua2024efficient, title={Efficient Subgraph GNNs by Learning Effective Selection Policies}, author={Bevilacqua, Beatrice and Eliasof, Moshe and Meirom, Eli and Ribeiro, Bruno and Maron, Haggai}, booktitle={International Conference on Learning Representations}, year={2024} } 2023 Jianfei Gao, Yangze Zhou, Jincheng Zhou, Bruno Ribeiro Double Equivariance for Inductive Link Prediction for Both New Nodes and New Relation Types arXiv:2302.01313 BibTex | arXiv @article{gao2023double, title={Double Equivariance for Inductive Link Prediction for Both New Nodes and New Relation Types}, author={Gao, Jianfei and Zhou, Yangze and Zhou, Jincheng and Ribeiro, Bruno}, journal={arXiv preprint arXiv:2302.01313}, year={2023} } Leonardo Cotta, Beatrice Bevilacqua, Nesreen Ahmed, Bruno Ribeiro Causal Lifting and Link Prediction Proceedings of the Royal Society A, 2023 BibTex | Paper @article{cotta2023causal, title={Causal Lifting and Link Prediction}, author={Cotta, Leonardo and Bevilacqua, Beatrice and Ahmed, Nesreen and Ribeiro, Bruno}, journal={Proceedings of the Royal Society A}, year={2023} } Chandan Botha, Jianfei Gao, Sanjay Rao, Bruno Ribeiro Veritas: Answering Causal Queries from Video Streaming Traces ACM SIGCOMM, 2023 BibTex @inproceedings{botha2023veritas, title={Veritas: Answering Causal Queries from Video Streaming Traces}, author={Botha, Chandan and Gao, Jianfei and Rao, Sanjay and Ribeiro, Bruno}, booktitle={ACM SIGCOMM}, year={2023} } Jiacheng Li, Ninghui Li, Bruno Ribeiro Effective passive membership inference attacks in federated learning against overparameterized models ICLR, 2023 BibTex | Paper @inproceedings{li2023effective, title={Effective passive membership inference attacks in federated learning against overparameterized models}, author={Li, Jiacheng and Li, Ninghui and Ribeiro, Bruno}, booktitle={International Conference on Learning Representations}, year={2023} } 2022 Yun Seong Nam, Jianfei Gao, Chandan Bothra, Ehab Ghabashneh, Sanjay Rao, Bruno Ribeiro, Jibin Zhan, Hui Zhang Xatu: Richer Neural Networ",
  "content_length": 44134,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:48"
}