{
  "name": "Bruno Ciciani",
  "homepage": "http://www.diag.uniroma1.it/users/bruno%20ciciani",
  "status": "success",
  "content": "Bruno Ciciani | Dipartimento di Ingegneria informatica, automatica e gestionale Salta al contenuto principale Home » Users » Bruno Ciciani Bruno Ciciani esternopagina personalestanza: B119telefono: +39 0677274109email uniroma1: bruno.ciciani@uniroma1.it Biografia Bruno Ciciani is Full Professor of Computer Engineering at the University of Rome \"La Sapienza\". His research interests include fault tolerance, computer architectures, distributed operating systems, manufacturing yield prediction, performance and dependability evaluation of distributed and parallel computing systems. In these fields he has published more than 130 papers, some of them have been published in qualified journals as: IEEE Trans. on Computers, IEEE Trans. on Parallel and Distributed Systems, IEEE Trans. on Software Engineering, IEEE Trans. on Knowledge and Data Engineering, IEEE Trans. on Communications, IEEE Trans. on Reliability, IEEE Trans. on Computer Aided Design, Performance Evaluation Journal, Distributed Computing and Journal of Parallel & Distributed Computing. Moreover he has published some books, among which two have been published by Mc Graw Hill and by IEEE Computer Society Press. Since his employment as Assistant Professor in 1983 (University of Tor Vergata, Rome), and then as Associate Professor in 1992 and Full Professor in 1994 (University of Rome “La Sapienza”),  Prof. Bruno Ciciani has engaged advising roles for more than 200 undergraduate and graduate students. Moreover he acted as Advisor for several PhD students working in the field of parallel and distributed computing. Also, he has been teaching supervisor of Master degree in Computer and Communication Systems. Prof. Bruno Ciciani spent more than two years as visiting researcher at the IBM Thomas J. Watson Research Center (N.Y.), where he contributed to the definition of three patents. He is a member of the IEEE Computer Society. Prof. Bruno Ciciani served as consultant for several public institutions like CNIPA (National Center for Informatics in the Public Administration), during these experiences he contributed in the infrastructure definition for the e-government. He is also a founder member of the International Research Institute for Autonomic Network Computing (IRIANC, Munich, Germany / Boston, USA), namely a non-profit research institution constituted in late 2006, which involves computer scientists in the field of distributed computing from both Europe and the United State. Moreover he is a founder member of InfQ (Informatica Quantitativa), a national association for the development research in the field of the Performance Evaluation. Prof. Bruno Ciciani has participated in international and national and research projects either has co-investigator or as Principal Investigator (PI). In particular, in the ‘80 he participated to the first and second Informatics National Research Projects, in the Air Traffic Control National Research Projects. In the ‘90 he participated to European projects like the Scientific Cooperation Network of the European Community “OLOS” (A holistic approach to the dependability analysis and evaluation  of control systems involving hardware, software and human resources) and the COST action “Stereoscopic Television: standards and technologies”.  In the meantime he participated to many large national research projects like: Reliable Web Systems (MIUR-COFIN);  Wide ScalE Broadband Middleware for Network Distributed Services - WEBMINDS (MIUR-FIRB);  Performance Evaluation of Complex Systems: Techniques, Methodologies and Tools – PERF (MIUR-FIRB). Actually he is participating to two European projects related to the cloud computing and to distributed transactional memory (CLOUD-Transactional Memory STREP project, Euro-Transactional Memory COST Action).Link alla biografiaInteressi di ricerca His research interests include fault tolerance, computer architectures, distributed operating systems, manufacturing yield prediction, performance and dependability evaluation of distributed and parallel computing systems. Membro di High Performance and Dependable Computing Systems Distributed Systems Ultime pubblicazioni Design and implementation of the new Italian healthcare digital interoperable registry for implantable medical devices in SOFTWARE-PRACTICE & EXPERIENCE 2022 Speculative Distributed Simulation of Very Large Spiking Neural Networks in SIGSIM-PADS '22: Proceedings of the 2022 ACM SIGSIM Conference on Principles of Advanced Discrete Simulation 2022 On power capping and performance optimization of multithreaded applications in CONCURRENCY AND COMPUTATION 2021 Adaptive Model-based Scheduling in Software Transactional Memory in IEEE TRANSACTIONS ON COMPUTERS 2020 Mutable locks: Combining the best of spin and sleep locks in CONCURRENCY AND COMPUTATION 2020 A Power Cap Oriented Time Warp Architecture in SIGSIM-PADS '18 Proceedings of the 2018 ACM SIGSIM Conference on Principles of Advanced Discrete Simulation 2018 Adaptive performance optimization under power constraint in multi-thread applications with diverse scalability in ICPE '18 Proceedings of the 2018 ACM/SPEC International Conference on Performance Engineering 2018 Last 50 publications © Università degli Studi di Roma \"La Sapienza\" - Piazzale Aldo Moro 5, 00185 Roma",
  "content_length": 5287,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:46"
}