{
  "name": "Bryan Parno",
  "homepage": "https://www.andrew.cmu.edu/user/bparno",
  "status": "success",
  "content": "Bryan Parno Bryan Parno Carnegie Mellon University Home Research Publications Teaching Service CV © 2017 Bryan Parno. Bryan Parno My research is primarily focused on investigating long-term, fundamental improvements in how to design and build secure systems. As a result, my work combines theory and practice to provide formal, rigorous security guarantees about concrete systems, with an emphasis on creating solid foundations for practical solutions. I am CMU's KavÄiÄ-Moura Professor of Electrical & Computer Engineering and Computer Science. More details Contact office: 412-268-2033 CIC 2121 bparno parno Collaborative Innovation Center 4720 Forbes Avenue Pittsburgh, PA 15213-3891 News Award Distinguished Artifact Award at USENIX Security August 13, 2025 - We were honored when our paper, OwlC: Compiling Security Protocols to Verified, Secure, High-Performance Libraries, received a Distinguished Artifact Award at the USENIX Security Symposium 2025. Award Jay Lepreau Best Paper Award at OSDI July 7, 2025 - We were honored when our paper, Basilisk: Using Provenance Invariants to Automate Proofs of Undecidable Protocols, received the Jay Lepreau Best Paper Award at OSDI 2025. News Amazon Scholar March 17, 2025 - As part of my sabbatical work, I recently joined Amazon Web Services as an Amazon Scholar. Award Distinguished Artifact Award at SOSP November 4, 2024 - We were honored when our paper, Verus: A Practical Foundation for Systems Verification, received a Distinguished Artifact Award at SOSP 2024. Award IEEE Cybersecurity Award for Practice October 9, 2024 - I was honored and humbled to receive the IEEE Cybersecurity Award for Practice for my 'contributions to the theory and practice of end-to-end secure systems.' Keynote Talk ACM Workshop on Principles of Secure Compilation October, 2024 - I've been invited to give a keynote talk at the ACM Workshop on Principles of Secure Compilation, which will be held in Denver on January 20th, 2025. Please consider attending! Award Intel's Hardware Security Academic Test-of-Time Award August, 2024 - We were deeply honored when our paper, Flicker: An Execution Infrastructure for TCB Minimization, received Intel's Hardware Security Academic Test-of-Time Award. Award Distinguished Paper Award at CAV July, 2024 - We were honored when our paper, A Framework for Debugging Automated Program Verification Proofs via Proof Actions, received a Distinguished Paper Award at CAV. Chair Endowed Chair April, 2024 - I was honored and humbled to receive the KavÄiÄ-Moura Chair of Electrical & Computer Engineering and Computer Science. News White House Report from the Office of the National Cyber Director February, 2024 - A recent report makes a compelling case for using memory-safe programming languages and for using formal methods to prove code is correct and secure. We were gratified to see a call out of our work on Project Everest, which developed verified components of the HTTPS ecosystem. Award Test-of-Time Award at IEEE S&P May, 2023 - We were greatly honored when our paper, Pinocchio: Nearly Practical Verifiable Computation, received a Test-of-Time Award at the IEEE Symposium on Security and Privacy. Learn more from this article. Award IEEE Golden Core March, 2023 - I was honored to receive the IEEE Computer Society's Golden Core Recognition. Award Distinguished Paper Award at OOPSLA December, 2022 - We were honored when our paper, Linear Types for Large-Scale Systems Verification, received a Distinguished Paper Award at OOPSLA. Award Aymeric Fromherz receives the ACM SIGSAC Doctoral Dissertation Award November, 2022 - Congratulations to Aymeric, whose thesis received the ACM SIGSAC Doctoral Dissertation Award. See more details. Award Best Paper Honorable Mention at CCS November, 2022 - We were honored when our paper, Hammurabi: A Framework for Pluggable, Logic-based X.509 Certificate Validation Policies, received a Best Paper Honorable Mention at ACM's CCS. Award Distinguished Paper Award + Internet Defense Prize August, 2022 - Our work on provably safe multilingual sandboxing via WebAssembly received a Distinguished Paper Award, as well as the Second Prize in the Internet Defense Prize competition, at USENIX Security. Award Jay Bosamiya Awarded a CyLab Presidential Fellowship August, 2022 - Congratulations to Jay for being named a CyLab Presidential Fellow! Award Aymeric Fromherz receives the A.G. Milnes Thesis Award May, 2022 - Congratulations to Aymeric, whose thesis received the ECE department's A.G. Milnes Award, which is \"awarded to a graduating ECE Ph.D. student for the Ph.D. thesis work judged to be of the highest quality and which has had, or is likely to have, significant impact in his or her field.\" Award Test-of-Time Award at IEEE S&P May, 2020 - We were greatly honored when our paper, Distributed Detection of Node Replication Attacks in Sensor Networks, received a Test-of-Time Award at the IEEE Symposium on Security and Privacy. It was the first paper I wrote in graduate school. Learn more from our acceptance video or this article. Award Joel & Ruth Spira Excellence in Teaching Award May, 2020 - I was very honored to receive the Joel and Ruth Spira Excellence in Teaching Award for 2019-2020. Award Distinguished Paper Award at PLDI May, 2020 - Our paper, Armada: Low-Effort Verification of High-Performance Concurrent Programs, received a Distinguished Paper Award at the ACM PLDI Conference. Keynote Talk IEEE Workshop on Foundations of Computer Security (FCS) May, 2020 - Iâve been invited to give a keynote talk at the IEEE Workshop on Foundations of Computer Security, which will be held online in June. Please consider attending! Code EverCrypt Code in Linux April 1, 2020 - Code from our EverCrypt cryptographic provider, developed using Vale, our tool for verified assembly language, now appears in the Linux kernel (more details). Award Aymeric Fromherz Awarded a CyLab Presidential Fellowship September, 2019 - Congratulations to Aymeric for being named a CyLab Presidential Fellow! Invited Talk IACR Conference on Cryptographic Hardware and Embedded Systems (CHES) July, 2019 - Iâve been invited to give a talk at the Conference on Cryptographic Hardware and Embedded Systems, which is located in Atlanta in August. Please consider attending! News Algorand Foundation June 11, 2019 - I recently joined the Technical Advisory Committee of the Algorand Foundation, along with Dan Boneh. News EverCrypt alpha release April 2, 2019 - We just posted an alpha release of EverCrypt, a verified, industrial-strength cryptographic provider. Read more in Quanta Magazine, our blog post, or our upcoming paper at IEEE S&P 2020. Award Sloan Fellowship February 15, 2018 - I was very honored to receive a Sloan Research Fellowship. Congratulations to all of the other recipients as well! Award Best Paper Award at the USENIX Security Symposium August 16, 2017 - Our paper, Vale: Verifying High-Performance Cryptographic Assembly Code, received a Distinguished Paper Award at the USENIX Security Symposium. Ashay and I accepted the award on behalf of all of our coauthors. Award Steve Matsumoto Awarded a CyLab Presidential Fellowship July, 2017 - Congratulations to Steve for being named a CyLab Presidential Fellow! Award Senior Member of ACM and IEEE July, 2017 - I recently became a Senior Member of ACM and IEEE. Award Research Highlight in the CACM July, 2017 - Our paper, IronFleet: Proving Practical Distributed Systems Correct, appears in this month's CACM as a Research Highlight, along with a short explanatory video. Invited Talk DIMACS Workshop on Outsourcing Computation Securely June, 2017 - Iâve been invited to give a talk at the DIMACS Workshop on Outsourcing Computation Securely, which is located at Rutgers in July. Please consider attending! Invited Talk Formal Methods for Security (FMS) Workshop February 2, 2016 - Iâve been invited to give a talk at the Formal Methods for Security (FMS) Workshop, which is co-located with PLDI in June. Please consider attending!. Invited Talk Layered Assurance Workshop December 15, 2015 - Iâve been invited to give a talk at the Layered Assurance Workshop in Los Angeles, on December 5-6, 2016. Please consider attending! Invited Talk Stanford Security Seminar December 10, 2015 - I gave a talk at the Stanford Security Seminar. Code Source code for IronFleet released October 4, 2015 - The source code for IronFleet, our system for verifying the safety and liveness of complex distributed systems, is now on GitHub. Invited Talk Conference on Verification, Model Checking, and Abstract Interpretation (VMCAI) September 9, 2015 - Iâve been invited to give a talk at the Conference on Verification, Model Checking, and Abstract Interpretation (VMCAI) in January. Iâll be discussing our Ironclad project and some of the interesting research questions weâve uncovered in trying to verify large, complex systems. Please consider attending! Code Source code for Geppetto released July 22, 2015 - The source code for Geppetto, our system for improving the versatility and performance of verifiable computations, is now online. Book New Book: Trust Extension as a Mechanism for Secure Code Execution on Commodity Computers July 24, 2014 - ACM published my book, Trust Extension as a Mechanism for Secure Code Execution on Commodity Computers, as part of their new ACM Books series. Award Best Paper Award at the IEEE Symposium on Security and Privacy May 21, 2013 - Our paper, Pinocchio: Nearly Practical Verifiable Computation, received the Best Paper Award at the IEEE Symposium on Security and Privacy. Award Best Paper Award at the USENIX Symposium on Networked Systems Design and Implementation (NSDI) April 3, 2013 - Our paper, Embassies: Radically Refactoring the Web, received the Best Paper Award at the USENIX Symposium on Networked Systems Design and Implementation (NSDI). Invited Talk Conference on Applied Cryptography and Network Security (ACNS) March 12, 2013 - Iâll be giving ",
  "content_length": 10798,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:56"
}