{
  "name": "Bryan A. Plummer",
  "homepage": "https://bryanplummer.com",
  "status": "success",
  "content": "B. Plummer Home People Teaching Publications Bryan A. Plummer Bryan A. Plummer Assistant Professor Image and Video Computing Group Department of Computer Science Boston University Office: CDS844 Email: bplum --at-- bu --dot-- edu Note for Students Curriculum Vitae My research interests fall within the umbrella of artificial intelligence with a focus on multimodal machine learning, efficient neural networks, explainable and fair AI, and robust ML. As of July 2020 I am an Assistant Professor in the Department of Computer Science at Boston University and a core faculty member of the Artificial Intelligence Research (AIR) initiative at the Rafik B. Hariri Institute for Computing and Computational Science & Engineering. I obtained my PhD in the computer vision group at the University of Illinois at Urbana-Champaign advised by Svetlana Lazebnik. After that I worked as a Postdoctoral Associate with Kate Saenko and Stan Sclaroff and later as a Research Assistant Professor before my current position. During my PhD I was fortunate to be named a 3M Foundation Fellow, NSF GRFP honorable mention, and was able to spend my summers working with Hadi Kiapour (eBay), Shuai Zheng (eBay), Robinson Piramuthu (eBay), Matthew Brown (Google), Himanshu Arora (A9), and Stephen Kelley (MIT Lincoln Labs). Recent News I will be serving as an Area Chair for ICML'26 My student's paper proposing a self-supervised method for multi-channel imaging was accepted at NeurIPS 2025 My student's have 3 papers accepted at EMNLP 2025 (2 main conference, 1 findings): a paper introducing the first token pruning approach for embodied navigation, a paper that learns to mix domains experts for temporal domain generalization, and a paper advocating for separating likely benign uses of LLMs (like polishing or machine translated text) from more potentially problematic uses in generated text detection My student has a paper proposing a self-supervised approach for MRIs with missing modalities accepted in Human Brain Mapping I will be serving as a Lead Area Chair for CVPR'26 I will be serving as an Area Chair for ICLR'26, and WACV'26 and a SPC for AAAI'26 My student Siqi Wang has defended their PhD thesis! Congratulations Dr. Wang! My student's paper that proposes a dataset for understanding spatial relationships in dynamic environments was accepted at COLM 2025 My student's paper that explores the vulnerabilities introduced due to training on web data was accepted at ICCV 2025 I am leading a team organizing the 1st Findings Workshop at ICCV'25. See our workshop website for our Call for Papers (deadline June 30th). My student Nannan Li has defended their PhD thesis! Congratulations Dr. Li! I will be serving as an Area Chair for NeurIPS'25 My student's paper that proposes an Error-Aware Refinement-based Schrodinger Bridge approach for virtual try-on was accepted at CVPR 2025 My student's paper on creating an extremely efficient low-rank update to large models and a paper that proposes an approach to measure the effect of domain generalization on data with distributional shifts from pretraining data was accepted at ICLR 2025",
  "content_length": 3127,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:52"
}