{
  "name": "Bryan C. Ward",
  "homepage": "https://my.vanderbilt.edu/bryancward",
  "status": "success",
  "content": "Bryan C. Ward | Vanderbilt University Skip to main content Bio I am an Assistant Professor of Computer Science (primary) and Electrical and Computer Engineering at Vanderbilt University. My research focuses on the design, implementation, and security of real-time and embedded systems, such as autonomous vehicles, industrial control systems, and satellites. I am generally interested in systems security, real-time and cyber-physical systems, distributed and concurrent systems, and operating systems. Prior to joining Vanderbilt, I was a member of the Technical Staff at MIT Lincoln Laboratory in the Secure Resilient Systems and Technology Group. I earned my Ph.D. in 2016 in Computer Science at UNC Chapel Hill, where I worked with Jim Anderson. I earned a B.S. in Computer Science and Engineering and a B.A. in Mathematics from Bucknell University in 2011. I’m a senior member of the IEEE. News Our paper “Buffered Scheduling: Hiding Decision Latency with Asynchronous Scheduling” has been accepted to RTNS. ECRTS ’26 Artifact Evaluation Co-Chair ECRTS ’26 PC Member Our paper “Resilient Scheduling of Real-Time Cyber-Physical Systems against Memory Corruptions” has been accepted at RTCSA. ECRTS ’25 Artifact Evaluation Co-Chair ECRTS ’25 PC Member RTNS ’25 PC Member Our paper “Job-Level Batching for Software-Defined Radio on Multicore” won the Vanderbilt Institute for Software Integrated Systems Director’s 2025 Best Paper Award! Our paper “Job-Level Batching for Software-Defined Radio on Multicore” won Best Student Paper and Best Presentation at RTSS! Congrats Abby! RTAS ’25 PC Member Our paper titled “Job-Level Batching for Software-Defined Radio on Multicore” will appear at RTSS ’24. Congrats Abby! Our paper titled “Partial Context-Sensitive Pointer Integrity for Real-Time Embedded Systems” will appear at RTSS ’24. Congrats Cai! My student, Abby Eisenklam, received the NSF Graduate Research Fellowship. Congrats Abby! RTSS ’24 PC Member EMSOFT ’24 PC Member RTNS ’24 PC Member RTCSA ’24 PC Member Our paper titled “InsectACIDE: Debugger-Based Holistic Asynchronous CFI for Embedded Systems” has been accepted at RTAS ’24 Our paper titled “Who’s Afraid of Butterflies?  A Close Examination of the Butterfly Attack” will appear at RTSS ’23, and it has been awarded an Outstanding Paper Award Deputy Track Chair for the Applied Methodologies and Foundations Track at RTAS ’24 RTSS ’23 PC Member OSPERT ’23 PC Member EMSOFT ’23 PC Member RTCSA ’23 PC Member ISORC ’23 Finance Chair Honors 2023 RTSS Outstanding Paper Award 2021 RTSS Outstanding Paper Award 2021 MIT Lincoln Laboratory Outstanding Mentor Award 2020 Winner AFCEA/Signal Magazine Cyber Edge Writing Competition RTAS 2016 Best Student Paper Award ECRTS 2013 Outstanding Paper Award 2012 National Science Foundation (NSF) Graduate Research Fellowship (GRFP) 2009 Barry M. Goldwater Scholarship",
  "content_length": 2873,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:53"
}