{
  "name": "Budi Arief",
  "homepage": "https://www.cs.kent.ac.uk/people/staff/ba284",
  "status": "success",
  "content": "Budi Arief - School of Computing - University of Kent Jump to content design1 Budi Arief Senior Lecturer Innovation Lead, Institute of Cyber Security for Society (iCSS) REF co-ordinator Email b.arief@kent.ac.uk Telephone +44 (0)1227 816797 More information ORCID iD: 0000-0002-1830-1587 Location Room 116 Kennedy Building School of Computing University of Kent Canterbury Kent CT2 7FS On this page About Research interests Teaching Supervision Professional About Dr Budi Arief's main research areas are cybercrime and computer security (most recently, ransomware, Internet of Things security, and combatting child sexual abuse), with a strong overarching element of interdisciplinary research. Budi has also conducted research in the dependability of computer-based systems, the application of Wireless Sensor Networks in the Intelligent Transport Systems domain, distributed systems (including performance modelling and simulation), and software engineering (in particular, open source software). So far, he as published more than 70 research papers in the areas of security and privacy, human factors, and dependability. Research interests I belong to the following research groups:Cyber Security GroupIf you are interested in doing a PhD in security-related topic with me, please drop me a line at b.arief@kent.ac.uk. Teaching Budi teaches various topics related to computer security, including introduction to computer security, privacy, network security, and information security management. Supervision Useful information about doing a PhD at the University of Kent (especially, within the Institute of Cyber Security for Society) is available here. Professional Funded ProjectsUK TSB: Safety App for Vulnerable Users (Oct'12-Mar'13)UK EPSRC: Cybercrime Network (Sep'12-Aug'15)UK EPSRC: Hyper-privacy: Case of Domestic Violence (Apr'13-Mar'14)UK TSB: Secure Mobile Safety Apps for Vulnerable Groups (Apr'13-Mar'15)EU ISEC: Novel Image/photo Forensic Tools for fighting against child pornography (Jul'13-Jul'15)UK Dstl: Cyber Defence: Identifying anomalous human behaviour in heterogeneous systems using beneficial intelligent software (Apr’14-Sep’14)EU CIPS: Shaping University Curricula to Critical Infrastructure Employer Needs (Sep’14-Feb’16)Newcastle University’s Contactless and Wearable Technologies (Feb’15-Mar’15)UK Metropolitan Police Service: Mobile Smartcard Reader (Mar’15-Oct’15)Fostering Collaboration Between Newcastle and Kent (Jan’16-Mar’16)Newcastle Access Control Live Lab (Jan’16-Mar’16)Kent University Internet of Things (Jan’16-Mar’16)Red-Blue Team Approach for Securing IoT Operating Systems (Jan'17-Mar'17)Equipment for Continuing Summer Internship Work (Feb'17-Mar'17)University of Kent Support for Internet of Things research (Feb'17-Jul'17)UK EPSRC: EconoMical, PsycHologicAl and Societal Impact of RanSomware (EMPHASIS) (Jul’17-Dec’19), https://gow.epsrc.ukri.org/NGBOViewGrant.aspx?GrantRef=EP/P011772/1UK VeTSS: Symbolic Computation for Mainstream Verification (Apr’21-Mar’22)UK Dstl/FNC: Playing Cyber Security Games (Jan’23-Nov’23)EU H2020: Novel Strategies to Fight Child Sexual Exploitation and Human Trafficking Crimes and Protect their Victims (HEROES) (Dec’21-Nov’24), https://heroes-fct.eu/EU ISF: Child-protection based strategies to fight against sexual abuse and exploitation crimes (ALUNA) (Jun'23-May'25), https://www.aluna-isf.eu/UK EPSRC: Countering HArms caused by Ransomware in the Internet Of Things (CHARIOT) (Sep'23-Aug'26), https://gow.epsrc.ukri.org/NGBOViewGrant.aspx?GrantRef=EP/X036707/1 Last updated 21 July 2025",
  "content_length": 3574,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:58"
}