{
  "name": "Burak Berk Üstündag",
  "homepage": "http://akademi.itu.edu.tr/bustundag",
  "status": "success",
  "content": "İTÜ AKADEMİ - Prof. Dr. Burak Berk Üstündağ Profil Araştırma Yayınlar Projeler Patentler Tezler Editörlük Etkinlikler Dersler Duyurular S.S.S. Prof. Dr. Burak Berk Üstündağ Çalışma Alanları : Yapay Zeka, Bilgisayar Sistem Yapısı ve Donanımı Eğitim Durumu : İstanbul Teknik Üniversitesi, Kontrol Ve Bilgisayar Mühendisliği (dr) (Doktora) Çalıştığı Birim : Bilgisayar ve Bilişim, Bilgisayar Mühendisliği Bölümü HAKKINDA SCOPUS Araştırma Profili İLETİŞİM BİLGİLERİ 90-212-2856702 bustundag@itu.edu.tr berk@berk.tc ALINAN ÖDÜLLER ASME(American Society of Mechanical Engineers/Turkey Sectıon) American Society of Mechanical Engineers, 2004 Outstanding young scientist of the year Junior Chamber İnternational, 2003 Yılın meslek ödülü Yılın Meslek Ödülü, 2002 Afet Yonetim Merkezine Faaliyetlerin Katki İl Valiliği , 2001 Service Award Air Force Academy, 2000 Gelişimine katkı ödülü İSTANBUL TEKNİK ÜNİVERSİTESİ, 1996 ÜYELİKLER İTÜ Bilişim Enstitüsü Yönetim Kurulu Üyesi, 2009 - 2014 Burak Berk Üstündağ Üyelik Yönetim Kurulu Üyesi Tümünü Görüntüle Öğrenim Bilgisi İş Deneyimleri Akademik Görev İdari Görev 2019 PROFESÖRİSTANBUL TEKNİK ÜNİVERSİTESİBİLGİSAYAR MÜHENDİSLİĞİ BÖLÜMÜ2019 / - 2018 Arş. Uyg. Merkezi MüdürüİSTANBUL TEKNİK ÜNİVERSİTESİ2018 / - 2017 Uzun süreli yurtdışı görevlendirmesiUniversity of Washington2017 / 2018 2014 DOÇENTİSTANBUL TEKNİK ÜNİVERSİTESİBİLGİSAYAR MÜHENDİSLİĞİ BÖLÜMÜ2014 / 2019 2011 Bakan DanışmanıDİĞER (KURUMLAR, HASTANELER VB.)2011 / 2013 2011 Arş. Uyg. Merkezi MüdürüİSTANBUL TEKNİK ÜNİVERSİTESİ2011 / 2018 2009 Bakan DanışmanıDİĞER (KURUMLAR, HASTANELER VB.)2009 / 2011 2008 Yönetim Kurulu ÜyeliğiİSTANBUL TEKNİK ÜNİVERSİTESİ2008 / 2012 2006 Arş. Uyg. Merkezi MüdürüİSTANBUL TEKNİK ÜNİVERSİTESİ2006 / 2011 2003 YARDIMCI DOÇENTİSTANBUL TEKNİK ÜNİVERSİTESİBİLGİSAYAR MÜHENDİSLİĞİ BÖLÜMÜ2003 / 2014 2000 ÖĞRETİM GÖREVLİSİ (DR)İSTANBUL TEKNİK ÜNİVERSİTESİBİLGİSAYAR MÜHENDİSLİĞİ BÖLÜMÜ2000 / 2002 1996 DoktoraİSTANBUL TEKNİK ÜNİVERSİTESİKONTROL VE BİLGİSAYAR MÜHENDİSLİĞİ (DR)1996 / 2000 1992 Yüksek LisansİSTANBUL TEKNİK ÜNİVERSİTESİKONTROL VE BİLGİSAYAR MÜHENDİSLİĞİ (YL) (TEZLİ)1992 / 1994 1991 ARAŞTIRMA GÖREVLİSİİSTANBUL TEKNİK ÜNİVERSİTESİKONTROL VE OTOMASYON MÜHENDİSLİĞİ BÖLÜMÜ1991 / 2000 1986 LisansİSTANBUL TEKNİK ÜNİVERSİTESİELEKTRİK MÜHENDİSLİĞİ BÖLÜMÜ1986 / 1991",
  "content_length": 2303,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:02"
}