{
  "name": "Burton Rosenberg",
  "homepage": "http://www.cs.miami.edu/~burt",
  "status": "success",
  "content": "Home Page: Burton Rosenberg John Conway, 11 April 2020 Life Game by xkcd Burton Rosenberg Associate Professor of Computer Science University of Miami Email: burt _(a)_ cs_(.)_miami_(.)_edu Office: 305-284-2141 Fax: 305-284-2264 Dept. Secretary: Christy Carrera, x-2268 Courses: CSC421/ECE421-E Computer Operating Systems MoWeFr 12:20PM—1:10PM; Mahoney Pearson 116 Witten LC 120 homepage CSC507/CSC609-G Cryptography MoWeFr 2:30–3:20; Knight Physics 108 homepage Questions? Ask in my csc-courses or csc-minicourses slack channels. All Courses/Talks QotD: The end of our foundation is the knowledge of causes, and the secret motions of things; and the enlarging of the bounds of human empire, to the effecting of all things possible. — Francis Bacon, The New Atlantis. 1626. I call him free who is led solely by reason. — Baruch Spinoza. 1632–1677. The meaning of a question is the method of answering it. Tell me how you are searching, and I will tell you what you are searching for. —Wittgenstein, Philosophical Remarks. 1975 (edited). Machines take me by surprise with great frequency. —Alan Turing , Computing Machinery and Intelligence, 1950. 2 cos (θ/2) = √ (2 + 2 cos θ) —Me, 7 December 2022 Bio: Financial cryptography; Quantum Computing; Scientific visualization. Research papers Curriculum Vitae (PDF) Projects: REU: Computing for Structure Phaser: A Web-enabled dynamical systems visualization workbench. Perl Cloudbook, for CSC 210.131. Live Cloudbook, old - to decommission learning (from 1995). the C Cloudbook Learn C: an experiment in web-based learning Ungar renovation and server room V&I Lab ePaper-Live: referencing a google-app running publicly instead of just code in the paper. How to loose with least probability Zinc@cs: various uses for the Google App Engine. Zinc is a metal, not a cloud. Artwork: April 15 Splash Random Dots Time Machine II, with Piotr Kowalski Communicationsphere with Aldo Tambellini Writings: Day of Civic Hacking: Data Visualization and Inspiration for Artistic Interpretations of Data Departmental infrastructure blog My class notes blog Departmental computer information Notes from hacking the NT Kernel Notes on cryptography Preface to Undergraduate thesis written at the MIT Visible Language Workshop. A theory of harmonic intervals (music) Fingering charts for piano old nwsa ptsa site Links: Locust Projects Miami Light Project Fountain Art Fair Pulse Art Fair Math/CS on the web since 1994. old homepage (1996) Calculators I have loved IBM 1130, my first computer; wrote Hunt the Wumpus with interrupt routine. music from data information is beautiful Pulse art fair UM CSC Alum Matt Mankins in United Airlines magazine who packed my eggs? and when? Central Office Lookup Find your CO by area code and exchange Credit card check sum. Time zone tool USGS Maps History USGS Maps Long/Lat coordinates FL driver license decode FL.US driver's license query (use with above) Docucolor tracing http://www.aegeanparkpress.com/ http://www.mathdl.org/ and http://nsdl.org/ Euclid's Elements Supercomputer time The Last Stage of Delirium PlanetMath.org Personal site Crypto/security software Kryptos FinancialCryptography.com Miami EASY Kernel Thread on OS X. Magnetic Declination by zip code. Internet Archive Item Response Theory BrainJar European Patent Office Yale CAS, the basis of UM CAS. Kerckhoff's principles Odonata (Dragonflies) Joanna Priestley RFID Handbook Alice Inkscape John Maeda Stamen Design Siganl vs. Noise ArtDaily Sam Brown Just Intonation Network Bell ringing methods a.k.a. change ringing Pixelito microbat C++ FQA FreeBSD Advisories opsound.org mital-U Artcircuits/Miami A Page at a time Miami-Dade schools art initiative Strandbeest by artist Theo Jansen. OK Dinghy Marshall sailboat Ensign sailboat The Swear The Mules Evanescence NaNuchka Miki Berenyi <3 4evr :-) Undertow Klaxons Gravity's rainbow (Van She r/x) The Knife Heartbeat Forever Young Overfire George Sarah Music A smaller god Darling Violetta Breathe Me by Sia Red Jumpsuit Apparatus White Stripes New Yorks a Gogo Slave to the Squarewave Cave, Muse Him, wicked game 4 non blondes As the rush comes Armin Van Burren remix. As the rush comes Gabriel and Dresden remix. Chairlift, Bruises (at the fountain) Blondie Nina Hagen, Naturtrane Say Anything, Cemetary -(-studio-)- Natalie Merchant at TED Black By the Way Rhinoceros Garbage Hypnogaja - Here comes the Rain again VNV nation Psychedelic furs The Smiths Sia, Breath Me (Butch Clancy Remix) Wait by M83 Hotride by Prodigy Depeche Mode Personal Jesus Covenant, Leiermann Mix Disposable War Pigs (Celldweller Klash-Up) Depeche Mode Personal J v. Doors Roadhouse v. TfF Shout JD's from Mars Pattie Smith My Heart (@ Capitol Theater 1979) Highly Suspect, My name is HuMan OK Go - Here It Goes Again Wintergatan Snow Patrol - Run Neil Young - After The Gold Rush cowboy junkies, bread and wine Not everything that goes around ... QotSA I'm Afraid of Americans, David Bowie Lazarus, David Bowie Alice in Chains, Nutcracker Alice in Chains, Nutcracker (with Layne Staley) Then Knife, Pass this on The Knife, Heartbeats Jose Gonzales, Heartbeats Phantogram \"When I'm Small\" Wicked Game cover by Hannah Bulton, Rabea Massaad When we're High LP Dance monkey Tones and I Sounds of Silence cover by Disturbed Zombie Tambellini/Piene Cologne Poème Symphonique For 100 Metronomes, GYÖRGY LIGETI, 1962. The Waterboys Long Strange Golden Road Meg Myers - \"Running Up That Hill\" (Behind The Scenes) Filter - Welcome to the Fold Shefita - Karma police Yemen Blues - Jat Mahibathi Out of Love - Hannah Boulton and Rabea Massaad Beth Hart - A Change is Gonna Come Peter Murphy - A Strange Kind of Love/Bela Lugosi is Dead Version II (Vinyl) Spoon - Held Kloot - Same Deep Water as Me Upside Down - Wolfgang Lohr feat. Alanna Lyes Patty Griffin - Little God (2013 mix) Lady Heroine - Sunday Bloody Sunday Last Update: 14 Aug 2024",
  "content_length": 5897,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:04"
}