{
  "name": "Buser Say",
  "homepage": "https://research.monash.edu/en/persons/buser-say",
  "status": "success",
  "content": "Buser Say - Monash University View Scopus Profile Buser Say Dr Senior Lecturer, Department of Data Science & AI https://orcid.org/0000-0003-2822-5909 EmailBuser.Saymonashedu Accepting PhD StudentsPhD projectshttps://supervisorconnect.it.monash.edu/supervisors/buser-say 20152025 Research activity per year Personal profile BiographyI am a Senior Lecturer and the Director of Student Experience in the FIT at Monash University, and an associate investigator for OPTIMA ARC. I have earned my Ph.D. (2020) on the topic of optimal planning with deep neural networks, my MASc. (2016) on the topic of least-commitment partial-order planning and my BASc. in Industrial Engineering (2014) from University of Toronto. Previously, I was the AI and ML theme coordinator for Building 4.0 CRC, a Postgraduate Affiliate with the Vector Institute and a visiting researcher at the Australian National University.Research interestsMy research is in the intersection of sequential decision making, mathematical optimisation and machine learning. I am currently offering the following Ph.D. projects: Blackbox Multi-Objective Optimization of Unknown Functions If interested, please apply via the link provided here. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationOptimal Planning with Learned Neural Network Transition Models, Ph.D., University of Toronto1 Sept 2016 → 14 Apr 2020Award Date: 18 Jun 2020Mixed-Integer Linear Programming Models for Least-Commitment Partial-Order Planning, M.A.Sc., University of Toronto1 Sept 2014 → 7 Nov 2016Award Date: 15 Mar 2017Industrial Engineering, B.A.Sc., University of Toronto1 Sept 2010 → 18 Jun 2014Award Date: 18 Jun 2014 Research area keywordsAutomated PlanningOperations ResearchNeural Networks Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2022 2022 2023 2024 2027 1 Finished 3 Active Projects per year Intelligent Robotics for Pharmaceutical Formulation DevelopmentKulic, D. (Primary Chief Investigator (PCI)), Burke, M. (Chief Investigator (CI)), Pham, H. (Partner Investigator (PI)), Vong, C. (Associate Investigator (AI)), Aleti, A. (Chief Investigator (CI)) & Say, B. (Chief Investigator (CI))15/09/24 → 14/09/27Project: Research Human-in-the-loop Microgrid Project: Human-in-the-loop Microgrid ProjectWang, H. (Primary Chief Investigator (PCI)), de Nijs, F. (Chief Investigator (CI)) & Say, B. (Chief Investigator (CI))ARC - Australian Research Council15/11/23 → 14/05/27Project: Research HARNESS: Hierarchical Abstractions and Reasoning for Neuro-Symbolic SystemsRezatofighi, H. (Primary Chief Investigator (PCI)), Garcia De La Banda Garcia, M. (Chief Investigator (CI)), Li, Y.-F. (Chief Investigator (CI)), Stuckey, P. (Chief Investigator (CI)), Gasevic, D. (Chief Investigator (CI)), Gutierrez, J. (Chief Investigator (CI)), Qu, L. (Chief Investigator (CI)), Ignatiev , A. (Chief Investigator (CI)), Swiecki, Z. (Chief Investigator (CI)), Vered, M. (Chief Investigator (CI)), Chen, G. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)) & Say, B. (Chief Investigator (CI))20/06/23 → 20/02/27Project: Research AI Biochemist - Software Infrastructure and Algorithm Development Phase 2Aleti, A. (Primary Chief Investigator (PCI)), Say, B. (Chief Investigator (CI)) & Webb, G. (Chief Investigator (CI))CSL Behring (Australia)1/04/22 → 31/12/23Project: Research Research output Research output per year 2015 2017 2018 2019 2020 2021 2023 2025 2025 15 Conference Paper 3 Article 1 Chapter (Report) Research output per year Research output per year A Bayesian Optimisation with segmentation approach to optimising liquid handling parametersYap, E., Huynh, V., Vong, C., Vogel, P., Louzado, V., Barnes, T., Say, B., Burke, M., Kulic, D. & Aleti, A., Dec 2025, In: Journal of Process Control. 156, 10 p., 103571.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile Human-in-the-Loop AI for HVAC Management Enhancing Comfort and Energy EfficiencyLiang, X., de Nijs, F., Say, B. & Wang, H., 2025, Proceedings of the 16th ACM International Conference on Future and Sustainable Energy Systems. Nieße, A. (ed.). New York NY USA: Association for Computing Machinery (ACM), p. 359-370 12 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile Probabilistic Active Goal RecognitionZhang, C., Rojas Cardenas, C., Rezatofighi, H., Vered, M. & Say, B., 2025, 22nd International Conference on Principles of Knowledge Representation and Reasoning. Ortiz, M., Wassermann, R. & Schaub, T. (eds.). Marina del Rey CA USA: Association for the Advancement of Artificial Intelligence (AAAI), p. 880–890 11 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile Rapid identification of protein formulations with Bayesian OptimisationHuynh, V., Say, B., Vogel, P., Cao, L., Webb, G. & Aleti, A., 2023, Proceedings - 2023 International Conference on Machine Learning and Applications, ICMLA 2023. Arif Wani, M., Boicu, M., Sayed-Mouchaweh, M., Henriques Abreu, P. & Gama, J. (eds.). Piscataway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, p. 776-781 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 1 Citation (Scopus) Robust metric hybrid planning in stochastic nonlinear domains using mathematical optimizationSay, B., 2023, Proceedings of the International Conference on Automated Planning and Scheduling 2023. Koenig, S., Stern, R. & Vallati, M. (eds.). 1 ed. Palo Alto CA USA: Association for the Advancement of Artificial Intelligence (AAAI), Vol. 33. p. 375-383 9 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 2 Citations (Scopus) View all 19 research outputs",
  "content_length": 6417,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:03"
}