{
  "name": "Byoungyoung Lee",
  "homepage": "https://lifeasageek.github.io",
  "status": "success",
  "content": "Byoungyoung Lee @SNU Professor Department of Electrical and Computer Engineering Seoul National University (SNU) CompSec Lab Email: byoungyoung@snu.ac.kr CV PGP key Short bio: I am a Professor in Electrical and Computer Engineering at Seoul National University (SNU). I'm leading the CompSec Lab and associated with SOR. I am interested in general computer security and privacy related problems in general. My research focus is in systems security, namely attack mitigation, vulnerability finding, and confidential computing. More details can be found here To prospective students: I'm looking for motivated students in system or security research. If you are interested in working with me, please contact me via byoungyoung@snu.ac.kr. SOSP 2024 Best Paper Award, Nov. 2024 CCS 2023 Top Reviwer Award, ACM Conference on Computer and Communication Security, 2023 Ministerial citation for excellent researcher, Minister of Science and ICT (대한민국 과학기술부 장관 우수연구자 표창), 2020 Google ASPIRE Award ($30,000 award), 2019 Internet Defense Prize by Facebook and USENIX ($100,000 award), 2015 Qualified for DARPA Cyber Grand Challenge (Team Disekt, $750,000 award), 2015 Third place award by CSAW Best Applied Research Paper Award, 2015 Vulnerability Bounty Award by Firefox, Mozilla ($3,000 award), 2014 Vulnerability Bounty Award by Firefox, Mozilla ($3,000 award), 2013 Vulnerability Bounty Award by Chrome, Google ($3,000 award), 2013 The 8th place at DEFCON 19 CTF (Team PLUS@POSTECH), Las Vegas, USA, Aug. 2011 The 3rd place at DEFCON 17 CTF (Team PLUS@POSTECH), Las Vegas, USA, Aug. 2009 The 6th place at DEFCON 14 CTF (Team TheEastSea), Las Vegas, USA, Aug. 2006 'Supereme Award' at Wowhacker Hacking Festival, Seoul, Korea, Jun. 2007 'Special Prize' at KISA Hacking Defense Competition, Seoul, Korea, Mar. 2006 POSTECH Undergraduate Research Program Scholarship, 2005 Full undergraduate study scholarship, Korea Science and Engineering Foundation (KOSEF), 2003 2026 GHost in the SHELL: A GPU-to-Host Memory Attack and Its Mitigation Sihyun Roh, Woohyuk Choi, Jaeyoung Chung, Yoochan Lee, Suhwan Song, and Byoungyoung Lee IEEE Symposium on Security and Privacy (SP) 2026 2025 DLBox: New Model Training Framework for Protecting Training Data [ paper ] Jaewon Hur, Juheon Yi, Cheolwoo Myung, Sangyun Kim, Youngki Lee, and Byoungyoung Lee Network and Distributed System Security Symposium (NDSS) 2025 Secure Data Analytics in Apache Spark with Fine-grained Policy Enforcement and Isolated Execution [ paper ] Byeongwook Kim⭑, Jaewon Hur⭑, Adil Ahmad, and Byoungyoung Lee Network and Distributed System Security Symposium (NDSS) 2025 ⭑ co-first authors TikTag: Breaking ARM's Memory Tagging Extension with Speculative Execution (to appear) [ paper | code ] Juhee Kim, Jinbum Park, Sihyeon Roh, Jaeyoung Chung, Youngjoo Lee, Taesoo Kim, and Byoungyoung Lee IEEE Symposium on Security and Privacy (SP) 2025 2024 PeTAL: Ensuring Access Control Integrity against Data-only Attacks on Linux [ paper | slide | code ] Juhee Kim, Jinbum Park, Yoochan Lee, Chengyu Song, Taesoo Kim, and Byoungyoung Lee ACM Conference on Computer and Communications Security (CCS) 2024 OZZ: Identifying Kernel Out-of-Order Concurrency Bugs with In-Vivo Memory Access Reordering [ paper | slide | code ] Dae R. Jeong, Yewon Choi, Byoungyoung Lee, Insik Shin, and Youngjin Kwon ACM Symposium on Operating Systems Principles (SOSP) 2024 Best Paper Award at SOSP 2024 (link) Bypassing ARM's Memory Tagging Extension with a Side-Channel Attack [ slide ] Juhee Kim, Jinbum Park, Sihyeon Roh, Jaeyoung Chung, Youngjoo Lee, Taesoo Kim, and Byoungyoung Lee BlackHat USA 2024 A Secure, Fast, and Resource-Efficient Serverless Platform with Function REWIND [ paper | slide ] Jaehyun Song, Bumsuk Kim, Minwoo Kwak, Byoungyoung Lee, Euiseong Seo, and Jinkyu Jeong USENIX Annual Technical Conference (ATC) 2024 SyzRisk: A Change-Pattern-Based Continuous Kernel Regression Fuzzer [ paper ] Gwangmu Lee, Duo Xu, Solmaz Salimi, Byoungyoung Lee, and Mathias Payer ACM Symposium on Information, Computer and Communications Security (ASIACCS) 2024 2023 Metamong: Detecting Render-update Bugs in Web Browsers through Fuzzing [ paper | slide ] Suhwan Song, and Byoungyoung Lee ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (FSE) 2023 An Extensible Orchestration and Protection Framework for Confidential Cloud Computing [ paper | slide ] Adil Ahmad, Alex Schultz, Byoungyoung Lee, and Pedro Fonseca USENIX Symposium on Operating Systems Design and Implementation (OSDI) 2023 SEGFUZZ: Segmentizing Thread Interleaving to Discover Kernel Concurrency Bugs through Fuzzing [ paper | code ] Dae R. Jeong, Byoungyoung Lee, Insik Shin, and Youngjin Kwon IEEE Symposium on Security and Privacy (SP) 2023 GRAMINER: Fuzz Testing Gramine LibOS to Harden the Trusted Computing Base [ paper ] Jaewon Hur, and Byoungyoung Lee Workshop on System Software for Trusted Execution (SysTEX) 2023 Extending a Hand to Attackers: Browser Privilege Escalation Attacks via Extensions [ paper ] Young Min Kim, and Byoungyoung Lee USENIX Security Symposium (Security) 2023 Pspray: Timing Side-Channel based Linux Kernel Heap Exploitation Technique [ paper ] Yoochan Lee, Jinhan Kwak, Junesoo Kang, Yuseok Jeon, and Byoungyoung Lee USENIX Security Symposium (Security) 2023 Diagnosing Kernel Concurrency Failures with AITIA [ paper ] Dae R. Jeong, Minkyu Jung, Yoochan Lee, Byoungyoung Lee, Insik Shin, and Youngjin Kwon ACM EuroSys Conference (EuroSys) 2023 2022 Perfect Spray: A Journey From Finding a New Type of Logical Flaw at Linux Kernel To Developing a New Heap Exploitation Technique Yoochan Lee, Byoungyoung Lee, Yuseok Jeon, Jinhan Kwak, and Junesoo Kang BlackHat Europe 2022 SpecDoctor: Differential Fuzz Testing to Find Transient Execution Vulnerabilities [ paper | slide | code ] Jaewon Hur, Suhwan Song, Sunwoo Kim, and Byoungyoung Lee ACM Conference on Computer and Communications Security (CCS) 2022 FuzzOrigin: Detecting UXSS vulnerabilities in Browsers through Origin Fuzzing [ paper | slide | code ] Sunwoo Kim, Young Min Kim, Jaewon Hur, Suhwan Song, Gwangmu Lee, and Byoungyoung Lee USENIX Security Symposium (Security) 2022 SYMSAN: Time and Space Efficient Concolic Execution via Dynamic Data-flow Analysis [ paper | slide ] Ju Chen, Wookhyun Han, Mingjun Yin, Haochen Zeng, Yuxuan Chen, Chengyu Song, Byoungyoung Lee, Heng Yin, and Insik Shin USENIX Security Symposium (Security) 2022 MundoFuzz: Hypervisor Fuzzing with Statistical Coverage Testing and Grammar Inference [ paper | slide ] Cheolwoo Myung, Gwangmu Lee, and Byoungyoung Lee USENIX Security Symposium (Security) 2022 R2Z2: Detecting Rendering Regressions in Web Browsers through Differential Fuzz Testing [ paper | slide ] Suhwan Song, Jaewon Hur, Sunwoo Kim, Philip Rogers, and Byoungyoung Lee IEEE/ACM International Conference on Software Engineering (ICSE) 2022 FuzzUSB: Hybrid Stateful Fuzzing of USB Gadget Stacks [ paper ] Kyungtae Kim, Taegyu Kim, Ertza Warraich, Byoungyoung Lee, Kevin Butler, Antonio Bianchi, and Dave (Jing) Tian IEEE Symposium on Security and Privacy (SP) 2022 2021 DiFuzzRTL: Differential Fuzz Testing to Find CPU Bugs [ paper | slide | code ] Jaewon Hur, Suhwan Song, Dongup Kwon, Eunjin Baek, Jangwoo Kim, and Byoungyoung Lee IEEE Symposium on Security and Privacy (SP) 2021 ExpRace: Exploiting Kernel Races through Raising Interrupts [ paper | slide ] Yoochan Lee, Changwoo Min, and Byoungyoung Lee USENIX Security Symposium (Security) 2021 Constraint-guided Directed Greybox Fuzzing [ paper | slide ] Gwangmu Lee, Woochul Shim, and Byoungyoung Lee USENIX Security Symposium (Security) 2021 M2MON: Building an MMIO-based Security Reference Monitor for Unmanned Vehicles [ paper ] Arslan Khan, Hyungsub Kim, Byoungyoung Lee, Dongyan Xu, Antonio Bianchi, and Dave Tian USENIX Security Symposium (Security) 2021 KARD: Lightweight Data Race Detection with Per-Thread Memory Protection [ paper ] Adil Ahmad, Sangho Lee, Pedro Fonseca, and Byoungyoung Lee International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS) 2021 Chancel: Efficient Multi-client Isolation Under Adversarial Programs [ paper | slide ] Adil Ahmad, Juhee Kim, Jaebaek Seo, Insik Shin, Pedro Fonseca, and Byoungyoung Lee Network and Distributed System Security Symposium (NDSS) 2021 2020 BlackMirror: Preventing Wallhacks in 3D Online FPS Games [ paper | slide ] Seonghyun Park, Adil Ahmad, and Byoungyoung Lee ACM Conference on Computer and Communications Security (CCS) 2020 TRUSTORE: Side-Channel Resistant Storage for SGX using Intel Hybrid CPU-FPGA [ paper | slide ] Hyunyoung Oh, Adil Ahmad, Seonghyun Park, Byoungyoung Lee, and Yunheung Paek ACM Conference on Computer and Communications Security (CCS) 2020 Vessels: Efficient and Scalable Deep Learning Prediction on Trusted Processors [ paper ] Kyungtae Kim, Chung Hwan Kim, Junghwan Rhee, Xiao Yu, Haifeng Chen, Dave Tian, and Byoungyoung Lee ACM Symposium on Cloud Computing (SoCC) 2020 A Tale of Two Trees: One Writes, and Other Reads. Optimized Oblivious Accesses to Large-Scale Blockchains [ paper ] Duc V. Le, Lizzy Tengana Hurtado, Adil Ahmad, Mohsen Minaei, Byoungyoung Lee, and Aniket Kate Privacy Enhancing Technologies Symposium (PETS) 2020 CrFuzz: Fuzzing Multi-purpose Programs through Input Validation [ paper ] Suhwan Song, Chengyu Song, Yeongjin Jang, and Byoungyoung Lee ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (FSE) 2020 Exploiting Kernel Races through Taming Thread Interleaving [ paper ] Yoochan Lee, Changwoo Min, and Byoungyoung Lee BlackHat USA 2020 HFL: Hybrid Fuzzing on the Linux Kernel [ paper | slide ] Kyungtae Kim, Dae R. Jeong, Chung Hwan Kim, Yeongjin Jang, Insik Shin, and Byoungyoung Lee Network and Distributed System Security Symposium (NDSS) 2020 2019 uXOM: Efficient eXecute-Only Memory on ARM Cortex-M [ paper | slide ] Donghyun",
  "content_length": 18880,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:04"
}