{
  "name": "Byron Choi",
  "homepage": "http://www.comp.hkbu.edu.hk/~bchoi",
  "status": "success",
  "content": "Ir Prof. Byron Choi's Homepage Ir Prof. Byron Choi (Koon Kau) in (Traditional Chinese and in Pinyin) Associate Head (Teaching and Learning) Programme Director of BSc in Computer Science (JS2510) Department of Computer Science (Map) Faculty of Science, Hong Kong Baptist University Fellow of the Hong Kong Institution of Engineers (FHKIE) Member of Database Research Group Office: Room 628 David C Lam Building (DLB628) Hong Kong Baptist University Kowloon Tong, Hong Kong Tel: (+852) 3411 7638 Email:  choi at hkbu.edu.hk ORCID: https://orcid.org/0000-0002-8381-336X SCOPUS: author profile HKBU scholars: profile Google scholar profile DBLP entry Semantic scholar profile PhD Graduates | Research Interests | Publications and Source Code | Grants | Hiring General Information: I obtained my Ph.D and MSE degrees in Computer and Information Science from the University of Pennsylvania in 2006 and 2001, respectively. I received my Bachelor of Engineering degree (with first-class honours) in Computer Engineering from the Hong Kong University of Science and Technology (HKUST). I was awarded the IEEE (Hong Kong Section) prize in 1999. Before joining the Hong Kong Baptist University, I was an Assistant Professor at School of Computer Engineering / Nanyang Technological University (NTU) for three years between 2005 and 2008. I was a research associate at the University of Edinburgh in 2005 and a summer student intern for the Galax project at AT&T Labs Florham Park. I also visited the HKUST theoretical computer science group in 2003. I have been elected as Fellow (FHKIE) of The Hong Kong Institution of Engineers (HKIE) - the Information discipline. I am a member of the Database Research Group at HKBU. I hold memberships with several professional associations, including professional member of ACM, senior member of IEEE, member of IEEE Computer Society and member of IEEE Technical Committee on Data Engineering (TCDE). I have been an associate editor of Distributed and Parallel Databases (DAPD) since March 2025. Since September 2021, I have been serving as the ACM SIGMOD information director. I have been recognized with several distinctions in roles throughout my career. In particular, I was the director of a Croucher Foundation Advanced Study Institute (ASI) titled \"Frontiers in Big Data Graph Research\" 2015. I have also served as a reviewer for the French Agence Nationale de Recherche (ANR) 2022, the Deutsche Forschungsgemeinschaft (DFG; German Research Foundation) 2022, and the Austrian Science Fund (FWF) 2014. I served as a supervisor of Hong Kong Scholars Program (é¦æ±å­¸è è¨å) 2020. I have received several awards recognizing my contributions to research, teaching and service. In particular, I was awarded a distinguished program committee (PC) member from ACM SIGMOD 2023 and 2021, respectively, a distinguished reviewer award from PVLDB 2019, an outstanding program committee member for IEEE ICDE 2025, and the best reviewers award from ACM CIKM 2021. I received a silver ring from DASFAA 2014 after serving as a session chair for multiple sessions. I was the recipient of the HKBU President's Award for Outstanding Performance in Individual Teaching 2022 and the HKBU President's Award for Outstanding Young Researcher 2016, the Department's Best Teaching Award in AY2020-2021 and AY2014-2015, Best Research Award in AY2023-2024 and AY2013-14, and Best Service Award in AY2019-2020 and AY2017-2018, respectively. Teaching: COMP3005 Design and Analysis of Algorithms COMP4035 Database System Implementation Always looking for strong applicants for Postdocs, PhD students, and research assistants: Strong PhD applicants may contact me directly for Hong Kong PhD Fellowship Scheme (HKPFS). Applicants should possess a strong background in (but not limited to) mathematics, algorithms and programming. Priority will be given to those with experience in graph data management or securities. The postdocs and research assistant positions are immediately available for one year and extensible for multiple years based on performance and availability of funds. In terms of research topics, the recent ones can be observed from my selected publications here. Possible research topics are graph-structured databases and time series analysis. Previous projects can be found here: Topic 1 and Topic 2. Our experience on providing secure subgraph query services can be found here. The general information of database research at HKBU can be found here. Research Interests (w. bibtex) (Selected Publications and Source Code): Graph-structured databases Time series analysis Database security User interfaces for database systems Incremental maintenance algorithms and view updates PhD Graduates: Lyu Xu, 2024. (First appointment: Postdoc at Hong Kong PolyU) Guozhong Li, 2021. [Webpage] (First appointment: Postdoc at HKBU) Jiaxin Jiang, 2020. (Appointment after a Postdoc at HKBU: Research Fellow at National University of Singapore, Singapore) Peipei Yi, 2018. (First appointment: Data Scientist, Machine Intelligence Center, Lenovo, Hong Kong SAR) Zhe Fan, 2015. (First appointment: Big Data Analyst Engineer at Huawei, Shenzhen, China) Yun Peng, 2013. (First appointment: Research Fellow at Nanyang Technological University, Singapore) General Research Funds (GRF) in the capacity of Principal Investigator (PI): Querying Large Networks of Cryptocurrencies (HKBU12203123, 2023-2024, on-going) Semantic Indexing for Keyword Search on Graphs (HKBU12201119, 2020-2022, completed) Exploring the Structural Critical Entities in Big Attributed Graphs (HKBU12201518, 2019-2021, transferred from Dr. Zhiwei Zhang, completed) Privacy-preserving Linear Algebra Framework for Graph Query Algorithms for Massive Networks (HKBU12232716, 2017-2019, completed) Exploratory Search on Graph Databases through Subgraph Query Feedback (HKBU12201315, 2016-2018, completed) Adaptive Filtering for Efficient Subgraph Isomorphism in Graph Databases (HKBU210510, 2011-2012, completed) Optimizations for the View Update Problem with Emerging Applications (HKBU210409, 2010-2011, completed) Editorial Board: SIGMOD 2027 (Associate Editor) PVLDB 2027 (Associate Editor) Distributed and Parallel Databases (Associate Editor) Program Committee (Partial): SIGMOD 2026-2023, 2021, and 2020, ICDE 2026, PVLDB demo 2025 (meta reviewer), ICDE 2025 (with rapid response review duties), EDBT 2023 (senior PC), PVLDB 2022-2021, 2019-2018 and 2015, CIKM 2021 (senior PC), ICDE 2022-2021, AAAI 2022, ICDM 2021, PAKDD 2022-2020, ER 2019, 2015, CIKM (tutorial) 2015, WWW (demo) 2014, CloudDb 2014, IEEE Big Data Science and Engineering (BDSE 2014), IEEE BigData Congress 2014-2013, DASFAA 2013-2011, SIGMOD IDAR 2008,... External Reviewer (Partial): TODS, VLDBJ, TKDE, TKDD, TOIS, DAPD, Journal of Supercomputing, Information Sciences, Information Systems, ER, ... Co-Organizer: The 5th International Workshop on Graph Data Management: Techniques and Applications (GDM 2014) in Conjunction with ICDE 2014, Chicago, USA. The Tutorials of the 19th International Conference on Database Systems for Advanced Applications (DASFAA 2014), Bali, Indonesia The First International Workshop on Graph-structured Data Bases (GDB) 2011 in Conjunction with DASFAA 2011, Hong Kong. Selected Publications (full list at DBLP): Y. Zhao, L. Xu, J. Jiang, B. Choi, J. Xu and B. He. ABFlow: Alert Bursting Flow Query in Streaming Temporal Flow Networks. Pro. ACM Manag. Data (SIGMOD) 2026. (bibtex) Z. Chen, W. K. Cheung, H-N Dai, B. Choi and J. Liu. Gated Variational Graph Autoencoders as Experts with Competition and Consensus for Multi-view Clustering. AAAI 2026. (bibtex) L. Xu, J. Jiang, B. Choi, J. Xu and B. He. Bursting Flow Query on Large Temporal Flow Networks. Pro. ACM Manag. Data (SIGMOD) 18:1-18:26, 2025. (bibtex) [github site!] G. Li, B. Choi, R. Zuo, S. S. Bhowmick and J. Xu. leSAX Index: A Learned SAX Representation Index for Time Series Similarity Search. ICDE 2025. (bibtex) [github site!] Z. Chen, Z. Wu, W. K. Cheung, H-N Dai, B. Choi and J. Liu. MSHTrans: Multi-Scale Hypergraph Transformer with Time-Series Decomposition for Temporal Anomaly Detection. SIGKDD 2025. (bibtex) [github site!] R. Zuo, G. Li, R. Cao, B. Choi, J. Xu and S. S. Bhowmick. DARKER: Efficient Transformer with Data-driven Attention Mechanism for Time Series. PVLDB, 17(11):3229-3242, 2024. (bibtex) [github site!] [SDD: a demo at CIKM '2025] J. Jiang, B. Choi, X. Huang, J. Xu and S. S. Bhowmick. DKWS: A Distributed System for Keyword Search on Massive Graphs. TKDE 39(5):1935-1950 2024. (bibtex) [pdf] [bitbucket repo!] L. Xu, B. Choi, Y. Peng, J. Xu and S. S. Bhowmick. A Framework for Privacy Preserving Localized Graph Pattern Query Processing. Pro. ACM Manag. Data (SIGMOD) 1(2):129:1-239:27 (2023). (bibtex) [github site!] Y. Peng, B. Choi, T. Chan, J. Yang and J. Xu. Efficient Approximate Nearest Neighbor Search in Multi-dimensional Databases. Pro. ACM Manag. Data (SIGMOD) 1:(1): 54:1-54:27 (2023). (bibtex) [github site!] R. Zuo, G. Li, B. Choi, S. S. Bhowmick, D. N-Y. Mah and G. L-H. Wong. SVP-T: A Shape-level Variable-Position Transformer for Multivariate Time Series Classification. AAAI, 11497-11505, 2023. (bibtex) [github site!] Y. Peng, B. Choi, T. Chan, and J. Xu. LAN: Learning-based Approximate k-Nearest Neighbor Search in Graph Databases. ICDE, 2022. Pages 2508-2521. (bibtex) [github site!] G. Li, B. Choi, J. Xu, S. S. Bhowmick, D. N-Y. Mah and G. L-H. Wong. IPS: Instance Profile for Shapelet Discovery for Time Series Classification. ICDE, 2022. Pages 1781-1793. G. Li, B. Choi, J. Xu, S. S. Bhowmick, K-P Chun and G. L-H. Wong. Efficient Shapelet Discovery for Time Series Classification. TKDE 34(3):1149-1163, 2022. [pdf] [Implementation!] [Visualet: a demo at CIKM '2020] P. Yi , B. Choi, Z. Zhang, S. S. Bhowmick and J. Xu. GFocus: User Focus-based Graph Query Autocompletion. TKDE 34(4):1788-1802, 2022. [pdf] L. Xu, J. Jiang, B. Choi, J. Xu, and S. S. Bhowmick. Privacy Preserving Strong Simulatio",
  "content_length": 17853,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:04"
}