{
  "name": "Byung-Gon Chun",
  "homepage": "https://bgchun.wordpress.com",
  "status": "success",
  "content": "Byung-Gon Chun Byung-Gon Chun Home Page Byung-Gon Chun (전병곤) Computer Science and Engineering Department Seoul National University Seoul, Korea bgchun at snu dot ac dot kr Biography Hi, there. I am an Associate Professor in the Computer Science and Engineering Department at Seoul National University (SNU) and an Associate Director at SNU Artificial Intelligence Institute. I am currently leading Software Platform Lab (SPL). My group research focuses on AI systems and models. You can check my current research at my research group site. I am a CEO of FriendliAI, which is a stealth start-up that builds that offers a platform for training and serving large-scale AI. We’re hiring talented researchers and engineers who would like to make huge impacts on large-scale AI. Contact at jobs(at)friendli(dot)ai. I am a recipient of the EuroSys 2021 Test of Time Award, the 2020 ACM SIGOPS Hall of Fame Award, the 2020 Google Research Award, the 2019 SNU Education Award, the 2018 Amazon Machine Learning Research Award, the 2017 Facebook Caffe2 Research Award, the 2017 Amazon Cloud Credits for Research Award, the 2015 Naver Young Faculty Award, and the 2014 Microsoft Research Faculty Fellowship. I was a visiting researcher at Naver in Spring and Summer 2020, and I was a visiting research scientist at Facebook, Menlo Park from mid 2016 to early 2017. Before joining SNU, I was a Principal Scientist at Microsoft. Before joining Microsoft, I led the systems research group at Yahoo! Research Silicon Valley for six months and worked as a Research Scientist for one and half years. My Yahoo! research projects include Mobius (data management platform for cloud-connected mobile apps) and workload-driven big data system designs. Before joining Yahoo! Research, I was a Research Scientist at Intel Research Berkeley from 2008 to 2011. I worked on CloneCloud, TaintDroid, and RouteBricks projects. Prior to that, I was a postdoctoral researcher at the International Computer Science Institute. I have a Ph.D. in Computer Science from the University of California, Berkeley, an M.S. in Computer Science from Stanford University, and a B.S. and an M.S. from the Electronic Engineering Department at Seoul National University. At SNU, I am teaching the following classes: Artificial Intelligence and Big Data Systems, Software Development Principles and Practices, and Operating Systems. In the Software Development Principles and Practices class, I teach how to build large-scale software. Students do semester-long team projects to develop web services they propose. You can find information about the class here: swpp2020, swpp2019. I am looking for MS/PhD students, postdoctoral researchers, and software engineers who are interested in working on large-scale NLP/multi-modal models and systems and more broadly deep learning models and systems. In addition, if you have good backgrounds and are interested in internships, please feel free to send me an email. Service – program committee member USENIX OSDI 2022, ACM SOSP 2021, USENIX ATC 2021, USENIX OSDI 2020, ACM EuroSys 2020, ACM APSys 2020, ACM APNet 2020, ACM APSys 2019, IEEE ICDCS 2019, ACM SoCC 2018, ACM APSys 2018, USENIX HotCloud 2018, IEEE ICDCS 2018, ACM SOSP 2017, ACM APSys 2017, ACM EuroSys 2017, WWW 2017, IEEE ICDCS 2017, USENIX OSDI 2016, USENIX ATC 2016, USENIX HotCloud 2016, IEEE ICDCS 2016, IEEE INFOCOM 2016, ACM APSys 2015, USENIX Security 2015, IEEE ICDCS 2015, IEEE IC2E 2015, HotCloud 2014, ACM MCS 2014, IEEE ICDCS 2014, WWW 2014, ACM SOCC 2013, ACM ASPLOS 2013, IEEE ICPADS 2013 (Vice Chair), WISA 2013, ACM SOCC 2012, ACM CCSW 2012, HotCloud 2012, USENIX NSDI 2011, HotCloud 2011, ACM CCSW 2011, ACM MobiHeld 2011, HotDep 2011, WRAITS 2011, ACM SOCC 2010, HotDep 2010, WRAITS 2010, ACM MCS 2010 Publications You can find my Google Scholar information here. Ahnjae Shin, Joo Seong Jeong, Do Yoon Kim, Soyoung Jung, Byung-Gon Chun. Hippo: Sharing Computations in Hyper-Parameter Optimization. To appear in VLDB 2022. Gyeong-In Yu, Saeed Amizadeh, Sehoon Kim, Artidoro Pagnoni, Ce Zhang, Byung-Gon Chun, Markus Weimer, Matteo Interlandi. WindTunnel: Towards Differentiable ML Pipelines Beyond a Single Model. To appear in VLDB 2022. Taebum Kim, Eunji Jeong, Geon-Woo Kim, Yunmo Koo, Sehoon Kim, Gyeong-In Yu, Byung-Gon Chun. Terra: Imperative-Symbolic Co-Execution of Imperative Deep Learning Programs. Thirty-fifth Conference on Neural Information Processing Systems (NeurIPS 2021), December 2021. Dohyeon Lee, Jaeseong Lee, Gyewon Lee, Byung-Gon Chun, Seung-Won Hwang. SCOPA: Soft Code-Switching and Pairwise Alignment for Zero-shot Cross-lingual Transfer. 30th ACM International Conference on Information and Knowledge Management (CIKM 2021), November 2021. Won Wook Song, Youngseok Yang, Jeongyoon Eo, Jangho Seo, Joo Yeon Kim, Sanha Lee, Gyewon Lee, Taegeon Um, Haeyoon Cho, Byung-Gon Chun. Apache Nemo: A Framework for Optimizing Distributed Data Processing. ACM Transactions on Computer Systems (TOCS), November 2021. Youngseok Yang, Taesoo Kim, Byung-Gon Chun. Finding Consensus Bugs in Ethereum via Multi-transaction Differential Fuzzing. 15th USENIX Symposium on Operating Systems Design and Implementation (OSDI 2021), July 2021. Gyewon Lee, Irene Lee, Hyeonmin Ha, Kyunggeun Lee, Hwarim Hyun, Ahnjae Shin, Byung-Gon Chun. Refurbish Your Training Data: Reusing Partially Augmented Samples for Faster Deep Neural Network Training. Gyewon Lee, Irene Lee, Hyeonmin Ha, Kyunggeun Lee, Hwarim Hyun, Ahnjae Shin, Byung-Gon Chun. 2021 Annual Technical Conference (ATC 2021), July 2021. Taegeon Um, Gyewon Lee, Byung-Gon Chun. Pluto: High-Performance IoT-Aware Stream Processing. IEEE 41th International Conference on Distributed Computing Systems (ICDCS 2021), July 2021. Woo-Yeon Lee, Yunseong Lee, Wonwook Song, Youngseok Yang, Joo Yeon Kim, Byung-Gon Chun. Harmony: A Scheduling Framework Optimized for Multiple Distributed Machine Learning Jobs. IEEE 41th International Conference on Distributed Computing Systems (ICDCS 2021), July 2021. Woosuk Kwon*, Gyeong-In Yu*, Eunji Jeong, Byung-Gon Chun (*equal contribution). Nimble: Lightweight and Parallel GPU Task Scheduling for Deep Learning. NeurIPS 2020 (Spotlight), December 2020. Ahnjae Shin, Dong-Jin Shin, Sungwoo Cho, Do Yoon Kim, Eunji Jeong, Gyeong-In Yu, Byung-Gon Chun. Stage-based Hyper-parameter Optimization for Deep Learning, Systems for ML Workshop at NeurIPS, December 2019. Eunji Jeong, Sungwoo Cho, Gyeong-In Yu, Joo Seong Jeong, Dong-Jin Shin, Taebum Kim, Byung-Gon Chun. Speculative Symbolic Graph Execution of Imperative Deep Learning Programs. Operating Systems Review, July 2019. Youngseok Yang, Jeongyoon Eo, Geon-Woo Kim, Joo Yeon Kim, Sanha Lee, Jangho Seo, Won Wook Song, Byung-Gon Chun. Apache Nemo: A Framework for Building Distributed Dataflow Optimization Policies. ATC 2019, July 2019. Woo-Yeon Lee, Yunseong Lee, Joo Seong Jeong, Gyeong-In Yu, Joo Yeon Kim, Ho Jin Park, Beomyeol Jeon, Wonwook Song, Gunhee Kim, Markus Weimer, Brian Cho, Byung-Gon Chun. Automating System Configuration of Distributed Machine Learning. ICDCS 2019, July 2019. Eunji Jeong, Sungwoo Cho, Gyeong-In Yu, Joo Seong Jeong, Dongjin Shin, Byung-Gon Chun. Demonstration of JANUS: Fast and Flexible Deep Learning via Symbolic Graph Execution of Imperative Programs. SysML Demo 2019, April 2019. Soojeong Kim, Gyeong-In Yu, Hojin Park, Sungwoo Cho, Eunji Jeong, Hyeonmin Ha, Sanha Lee, Joo Seong Jeong, Byung-Gon Chun. Parallax: Sparsity-aware Data Parallel Training of Deep Neural Networks. EuroSys 2019, March 2019. Eunji Jeong, Sungwoo Cho, Gyeong-In Yu, Joo Seong Jeong, Dongjin Shin, Byung-Gon Chun. JANUS: Fast and Flexible Deep Learning via Symbolic Graph Execution of Imperative Programs. NSDI 2019, February 2019. Yunseong Lee, Alberto Scolari, Byung-Gon Chun, Markus Weimer, Matteo Interlandi. From the Edge to the Cloud: Model Serving in ML .NET. IEEE Data Engineering Bulletin, December 2018. Gyeong-In Yu, Saeed Amizadeh, Byung-Gon Chun, Markus Weimer, Matteo Interlandi. Making Classical Machine Learning Pipelines Differentiable: A Neural Translation Approach. Systems for ML Workshop at NIPS 2018, December 2018. Yunseong Lee, Alberto Scolari, Byung-Gon Chun, Marco Domenico Santambrogio, Markus Weimer, Matteo Interlandi. PRETZEL: Opening the Black Box of Machine Learning Prediction Serving Systems. 13th USENIX Symposium on Operating Systems Design and Implementation (OSDI 2018), October 2018. Gyewon Lee, Jeongyoon Eo, Jangho Seo, Taegeon Um, Byung-Gon Chun. High-Performance Stateful Stream Processing on Solid-State Drives. 9th ACM SIGOPS Asia-Pacific Workshop on Systems (APSys 2018), August 2018. Eunji Jeong*, Joo Seong Jeong*, Soojeong Kim, Gyeong-In Yu, Byung-Gon Chun (*equal contribution). Improving the Expressiveness of Deep Learning Frameworks with Recursion. EuroSys 2018, April 2018. Yunseong Lee, Alberto Scolari, Matteo Interlandi, Markus Weimer, Byung-Gon Chun. Towards High-Performance Prediction Serving Systems. SysML Conference, February 2018. Yunseong Lee, Alberto Scolari, Matteo Interlandi, Markus Weimer, Byung-Gon Chun. Towards High-Performance Prediction Serving Systems. ML Systems Workshop at NIPS 2017, December 2017. Soojeong Kim, Eunji Jeong, Joo Seong Jeong, Gyeongin Yu, Hojin Park, Byung-Gon Chun. Auto-Parallelizing Deep Learning for Multi-machine, Multi-GPU Environments. Workshop on AI Systems at Symposium on Operating Systems Principles (SOSP), October 2017. Byung-Gon Chun, Tyson Condie, Yingda Chen, Brian Cho, Andrew Chung, Carlo Curino, Chris Douglas, Matteo Interlandi, Beomyeol Jeon, Joo Seong Jeong, Gye-Won Lee, Yunseong Lee, Tony Majestro, Dahlia Malkhi, Sergiy Matusevych, Brandon Myers, Mariia Mykhailova, Shravan Narayanamurthy, Joseph Noor, Raghu Ramakrishnan, Sriram Rao, Russell Sears, Beysim Sezgin, Tae-Geon Um, Julia Wang, Markus Weimer, Markus Weimer, Youngseok Yang. Apache REEF: Retainable Evaluator Execution Framework. ACM Transactions on Computer Systems (TOCS), October 201",
  "content_length": 23177,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:06"
}