{
  "name": "Byung-Chul Tak",
  "homepage": "http://sites.google.com/view/knudiscolab",
  "status": "success",
  "content": "CLODIS LAB at KNUSearch this siteEmbedded FilesSkip to main contentSkip to navigation Cloud & Distributed Systems (CLODIS) LabWelcome to Cloud & Distributed Systems Lab at KNU경북대학교 클라우드 & 분산시스템 연구실Director: Professor Byungchul Tak (탁병철 교수)● Member Lab of ERC, The Engineering Research Center, Year 2021~2028 (선도연구센터지원사업 공학분야  참여 연구실, 2021년~2028년)● KNU CSE BK21 FOUR Project Member Lab (경북대 컴퓨터학부 4단계 BK21 사업 참여 연구실)● Cisco Research Grant Recipient (Cybersecurity Research)I am actively looking for MS, PhD, MS/PhD students as well as Post Docs who are interested in learning how to apply AI and Deep Learning techniques to cloud and complex distributed systems. If you are interested in becoming a high-quality researcher, please feel free to contact me by sending me your CV or Resume. The mission of our lab is to develop advanced techniques for managing large-scale distributed systems in cloud environments. Our research areas include:Deep learning–based diagnosis and troubleshooting of cloud system problemsAI-driven log analysis for anomaly detectionCloud security, with a particular focus on container securityIoT, fog, and edge computingSystem resource monitoring for accounting and performance managementWe aim to develop techniques that support the reliable operation of distributed software components across large-scale distributed systems composed of many computing nodes. Our research begins with a deep understanding of system states through both theoretical and empirical analysis. Building on this foundation, we actively incorporate cutting-edge methods from other fields to address our challenges.As a result, our work requires a strong foundation not only in operating systems, computer architecture, and distributed systems, but also in data mining, artificial intelligence (AI), and deep learning (DL). The volume of data generated by large-scale cloud systems is far too vast for manual processing. Therefore, we focus on building automated data processing pipelines that can effectively analyze and make sense of this machine-generated data.In addition, we conduct research in several closely related areas, including big data processing, query processing, data mining, natural language processing (NLP), statistics, artificial intelligence (AI), deep learning (DL), data visualization, and information retrieval.(추가적인 프로젝트 내용은 Research 페이지 참조.)Announcements클라우드 컴퓨터 시스템 분야에 관심이 많고, 최신의 딥러닝, 인공지능 기법을 습득하여 깊이 있는 연구를 하고자 하는 열정이 넘치고 성실한 석사/박사 과정 학생을 모집합니다.bctak at knu.ac.kr로 이메일 컨택, 예약 후 연구실 방문.박사학위 취득 후의 진로를 4년제 우수 상위권 대학의 교수직으로 희망하는 경우 교수 임용을 목표로 집중 지도. 박사과정은 약4년 소요. 국내 상위권 기업의 급여와 비슷하거나 상회하는 인건비를 제공하므로 학위과정 중 금전적으로 직장생활과 차이가 없도록 지원함.박사학위 취득 후 국내의 주요 대학 및 주요 연구소 취직 가능. 대상기관: 정출연, 대기업연구소, (미)IBM, Cisco 등의 Research 부서석사 후 취업을 고려하는 학생은 그에 맞춘 지도.연구실로부터의 다양한 지원을 통해 금전적 부담없이 학업과 연구에 집중 가능.CLODIS Lab에서는 클라우드 및 대규모 시스템 분야의 연구를 함께 수행할 석사 및 박사과정 학생을 모집합니다. 최근 인공지능 기술의 빠른 발전과 함께, 인공지능 및 딥러닝 기법을 활용하여 클라우드 시스템의 문제를 해결하는 연구가 활발히 진행되고 있으며 큰 주목을 받고 있습니다.우리 연구실은 인공지능/딥러닝 기법 자체의 개발보다는, 이러한 기법들을 실제 클라우드 시스템의 문제 해결에 효과적으로 적용하여 문제들을 해결하는 방법을 찾는 연구에 중점을 두고 있습니다. 최신 인공지능 및 딥러닝 기술을 깊이 있게 이해하고, 이를 클라우드 시스템의 분석과 문제 해결에 적용하여 우수한 연구 성과를 내고자 하는 열정적인 학생들의 많은 지원을 바랍니다.현재 산업계에서는 대규모 클라우드 시스템 기반의 서비스들이 빠른 속도로 확산되고 있으며, 이 분야의 취업 기회는 전체 IT 산업의 약 40%를 차지하는 것으로 알려져 있습니다. 특히 인공지능 알고리즘 자체의 연구보다, 이를 실제 문제에 적용할 수 있는 실전 역량을 가진 인재에 대한 수요가 크게 증가하고 있습니다. 이에 CLODIS Lab은 졸업 후 높은 경쟁력을 갖출 수 있도록, 클라우드 시스템 분석 및 보안 등의 분야에서 딥러닝, 자연어 처리(NLP), 정보이론, 빅데이터 처리 등 다양한 최신 기법을 적극적으로 연구에 적용하고 있습니다.CLODIS 연구실 소속의 학생은 해외의 세계적 연구자들과 공동 연구를 하는 기회를 가집니다. 미국의 IBM TJ Watson 연구소, CISCO Research 연구소, Virginia Tech, Lousiana State University, 중국 칭화대 등 최정상급 컴퓨터 과학자들과 영어로 주간 미팅을 통하여 공동 연구를 수행합니다. 해외연구자들과 공동연구를 통하여 실력을 쌓고자 하는 도전적이고 성실한 학생들의 많은 관심과 지원을 바랍니다.News2025/9/30: Our paper \"Performance analysis of microVMs and containers for edge computing: A focus on file and network I/O\" is accepted for publication in FGCS, JCR top 10% SCIE Journal!2025/3/3: Youyang's paper \"Curating Online Forum Knowledge as Troubleshooting Dataset for Generative AI Using Fusion Retrieval\" won the best paper award at the AAAI'25 Workshop Good-data! Congratulations!!2024/9/1: Dr. Fatima Abdullah has been appointed assistant professor at one of the top universities in Pakistan, NUST(National University of Science and Technology). Congratulations!!!2024/6/30: Our paper, \"ReCG: Bottom-Up JSON Schema Discovery Using a Repetitive Cluster-and-Generalize Framework\" is accepted to VLDB'24 conference. Congratulations!!!2024/6/14: 신현석, 조민정, 유호상, 이용원 KSC 논문 우수상 수상. Our paper received the outstanding paper award at KSC. Congratulations!!2024/6/13: Our paper, \"Understanding Performance of eBPF Maps\" is accepted to eBPF'24 workshop (colocated with SIGCOMM). This is a joint work with Tsinghua University. Congratulations!!2024/3/13: 학부연구생 권은구 카카오 최종합격! Eungu Kwon received an offer from Kakao. Congratulations!!2023/8/5: Our paper, \"MicroVM on Edge: Is It Ready for Prime Time?\" is accepted to IEEE MASCOTS'23 conference. Congratulations!!2023/6/1: Our paper, \"ECM: An Energy-efficient HVAC Control Framework for Stable Construction Environment\" is accepted to IEEE SECON'23 conference.  Congratulations!!2023/5/10: Our paper, \"On the Value of Sequence-based System Call Filtering for Container Security\" is accepted to IEEE CLOUD'23 conference.  Congratulations!!2023/2/18: Our paper, \"QaaD (Query-as-a-Data): Scalable Execution of Massive Number of Small Queries in Spark\" is accepted to SIGMOD'23 conference!!!2023/2/18: Two poster papers by Somin and Fatima accepted to CCGrid'23 conference!2023/2/3: 김유양,  ERC워크샵에서 최우수 포스터 발표상 수상. 권은구, 우수 포스터 발표상 수상! Congratulations!!2022/12/26: Undergraduate intern, Minyeong Kim (김민영), joined the lab. Welcome!2022/12/24: Our paper, \"A Close Look At SharedResourceConsumption in NoSQL Databases for Accurate Accounting\" is accepted to NOMS'23 conference!!2022/12/14: 석사 졸업생 이재륜 카카오뱅크 합격! Jaeryun Lee received an offer from Kakao Bank. Congratulations!!2022/9/24: Our paper is accepted to ICCE-Asia conference. Congratulations!!2022/7/04: Undergraduate interns, 권은구, 민시온 joined the lab. Welcome!2022/6/29: 석사 졸업생 채윤창 삼성전자 합격! Yunchang Chae passed final intervew at Samsung Electronics. Contratulations!!2022/5/20: 석사과정 장선우 AWS 합격! Sunwoo Jang received an offer from AWS, Korea. Congratulations!!!2022/4/21: Our paper, \"Workload-driven Analysis on the Performance Characteristics of GPU-accelerated DBMSes\" is accepted to IEICE Transactions on Information Systems!!2022/3/31: Our paper, \"SecQuant: Quantifying Container System Call Exposure\" is accepted to ESORICS'22 conference!!2022/2/23: 석사 졸업생 서창호 카카오 합격! Changho Seo received an offer from Kakao. Congratulations!!!2022/2/11: Youyang and Somin received Poster presentation award at ERC workshop, Jeju. Congratulations!2021/12/22: Our paper, \"A Comprehensive Empirical Study of Query Performance Across GPU DBMSes\" is accepted to SIGMETRICS'22 conference!!2021/12/17: Our paper, \"NoSQL Database Performance Diagnosis through System Call-level Introspection\" is accepted to NOMS'22 conference!!2021/12/13: \"고품질 빅데이터 분석을 위한 최적의 전처리 순열 추천 방법\"이 2021년도 한국정보과학회 소사이어티우수논문상 수상!2021/10/29: Our paper, \"A Survey of IoT Stream Query Execution Latency Optimization within Edge and Cloud\" is accepted to Wireless Communications and Mobile Computing (WCMC) journal.2021/10/19: Our paper, \"Lognroll: Discovering Accurate Log Templates by Iterative Filtering\" is accepted to Middleware'21 conference!2021/9/1: Master student, Kim Youyang, has joined the lab. Welcome!2021/6/10: Our paper, \"Block-Level Storage Caching for Hypervisor-Based Cloud Nodes\" is accepted to IEEE Access journal.2021/6/1: ERC(Engineering Research Center, $14M USD, 7 years) proposal accepted!!!2020/12/20: Our paper, \"Privacy-aware collaborative task offloading in fog computing\" is accepted to IEEE Transactions on Computational Social Systems (TCSS).2020/9/1: Master student, Song Somin and Jang Sunwoo, have joined the lab. Welcome!2019/12/9: Our paper, \"Green Fog Planning for Optimal Internet-of-Thing Task Scheduling\" is accepted to IEEE Access journal.2019/11/24: Our paper, \"BlackEye: Automatic IP Blacklisting using Machine Learning from Security Logs\" is accepted to Wireless Networks journal.2019/11/6: Our paper, \"Priolog: mining important logs via temporal analysis and prioritization\" is accepted to Sustainability journal. This work is a collaboration with IBM TJ Watson Research Center.2019/5/30: Our paper, \"Measuring the Importance of Log using Temporal Correlation \" is accepted to BIC 2019.2019/5/1: Our paper, \"IP Blacklisting via Threat Modeling and Machine Learning from Security Logs \" is accepted to ISAIR2019.2018/12/14: Our paper, \"LADRA: Log-based Abnormal Task Detection and Root-cause Analysis in Big Data Processing with Spark \" is accepted for publication to the Future Generation Computer Systems (FGCS) journal.2018/11/2: 서창호 컴퓨터 학부 영예장학생 선발2018/10/28: Our paper, \"Accurate and Efficient Log Template Discovery Technique\" is published to KSCI(한국컴퓨터정보학회), 2018.2018/7/27: 한웅제,서창호 발표 논문이 KCC2018 학부생/주니어논문경진대회 우수상 입상2018/6: International Conference on Web Services (ICWS) Best paper award!2018/6: 학부연구생 한웅제, 서창호 - 제주도에서 열리는 KCC 참석 및 논문 발표2018/5: 차세대컴퓨팅학회 발표 논문, \"컨테이너 이미지의 보안 취약성 데이터 수집 및 분석\", 우수상 수상2018/5: Our paper, \"컨테이너 이미지의 보안 취약성 데이터 수집 및 분석(Vulnerability Data Collection and Security Analysis of Container Images)\" is accepted to 차세대컴퓨팅학회 2018.2018/5: Our paper, \"로그 분석을 위한 로그 템플릿 추출 기법(Log Template Extraction Technique for Log Analysis)\" is accepted to 차세대컴퓨팅학회 2018.2018/5: Our paper, \"라이브러리 인트로스펙션을 통한 NoSQL 데이터베이스 동작의 비교 분석\" is accepted to KCC 2018.2018/4/21: Our paper, \"EDGESTORE: A Single Namespace and Resource-aware Federation File System for Edge Servers\" is accepted to IEEE EDGE 2018 conference.2017/4/26: Our paper, \"Understanding Security Implications of Using Containers in the Cloud\" is accepted to USENIX ATC 2017 conference.2017/3/10: Our paper, \"Log-based Abnormal Task Detection and Root Cause Analysis for Spark\" is accepted to ",
  "content_length": 10074,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:06"
}