{
  "name": "C. Carvalho de Souza",
  "homepage": "http://www.ic.unicamp.br/~cid",
  "status": "success",
  "content": "Cid Carvalho de Souza's Welcome Page Instituto de Computação - UNICAMP Cid Carvalho de Souza Ph. D., Université Catholique de Louvain CORE (Center for Operations Research and Econometrics) Louvain-la-Neuve, Belgium, 1993. Email: Address: Instituto de Computação Universidade Estadual de Campinas (UNICAMP) Av. Albert Einstein 1251, Cidade Universitária Zeferino Vaz - Barão Geraldo 13083-852 Campinas, SP - BRAZIL Phone: +55 (19) 35215877 Fax: +55 (19) 35215847 Curriculum Vitae Short CV (in english) Buscar CV Lattes  na base do CNPq My profile at ResearcherID My profile at Google Scholar Research Interests Combinatorial Optimization Linear and Integer Programming Design and Analysis of Algorithms Heuristics Operations Research Research activities Benchmark instances for some combinatorial optimization problems I've been working with: Art Gallery Problem Capacitated m Ring Star Problem Minimum Convex Partition of Point Sets Dynamic Map Labeling Eternal Dominating Set Problem Firefighter Problem in Graphs Geometric Firefighter Geometric Knapsack Graph Partition Milling Problem with Turn Costs Minimum Flip Distance Between Two Triangulations Minimun Dilation Problems Minimum Length Corridor Problem Vertex Separator Problem Scheduling Problem Under Resource (Labour) Constraints Symbol Maps Problem Wireless Localization Problem For a copy of my PhD dissertation on graph partitioning problems click here Para alunos interessados em orientação de Iniciação Científica e/ou Pós-Graduação. Aviso: as páginas acessadas a partir deste link não têm sido atualizadas há muuuito tempo ... :( GOA home page. Warning: the pages linked from here have not been updated for a looong time ... :( Here you will find some research reports and theses for downloading. These works have been developed by members of the Group on Applied Optimization of the Institute of Computing of the State University of Campinas (UNICAMP). Current teaching (in Portuguese) Sem carga didática (afastado por dois anos a contar de fevereiro de 2020) Last updated in January, 2020, by cid.",
  "content_length": 2066,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:13"
}