{
  "name": "C. David Page Jr.",
  "homepage": "http://pages.cs.wisc.edu/~dpage",
  "status": "success",
  "content": "C. David Page Jr. active_molecule(A) if: hydrogen_acceptor(A,C) & hydrogen_acceptor(A,D) & distance(C,D,4.17) & hydrophobe(A,E) & distance(C,E,3.38) & distance(D,E,7.20) & hydrophobe(A,F) & distance(C,F,3.68) & distance(D,F,5.41) & distance(E,F,5.0). C. David Page Jr. Professor Department of Biostatistics and Medical Informatics and Department of Computer Sciences School of Medicine and Public Health University of Wisconsin-Madison Wisconsin Institute of Discovery (WID), Room 3174 330 N. Orchard St. Madison, WI 53715 U.S.A. Phone: 1-608-316-4687 (direct line) Email: page@biostat.wisc.edu Teaching BMI/CS 576: Bioinformatics CS 731: Advanced Methods in Artificial Intelligence CS 760: Machine Learning CS 838: Statistical Relational Learning Med/BMI 918: Health Informatics Research David Page works on algorithms for data mining and machine learning, and their applications to biomedical data, especially de-identified electronic health records and high-throughput genetic and other molecular data. Of particular interest are machine learning methods for complex multi-relational data (such as electronic health records or molecules as shown) and irregular temporal data, and methods that find causal relationships or produce human-interpretable output (such as the rules for molecular bioactivity shown in green to the side). Recent Work Inductive Logic Programming (ILP) and Statistical Relational Learning (SRL), including applications to clinical data Skewing: Learning Correlation Immune Targets Pharmacophore Discovery for Drug Design Analysis of High-Throughput Genetic Data Other Areas of Bioinformatics and Machine Learning active_molecule(A) if: zinc_binding_site(A,B) & hydrogen_acceptor(A,C) & distance(B,C,6.1) & hydrogen_acceptor(A,D) & distance(B,D,7.3) & distance(C,D,2.2) & hydrogen_acceptor(A,E) & distance(B,E,3.9) & distance(C,E,3.2) & distance(D,E,4.0). Some Recent Research Talks High-Throughput Machine Learning from Electronic Health Records, National Library of Medicine (one hour), earlier versions given at Johns Hopkins, University of Pittsburgh, Amazon, Seattle Healthcare, UCSD, Georgia Tech, Georgetown Improved Methods for Discovering Adverse Drug Events from EHR Data, Center for Predictive Computational Phenotyping (CPCP) Retreat (15 minutes) Predicting Health Events from EHRs Using Machine Learning, CPCP Small Talks on Big Data (18 minutes) Research Group Current Aubrey Barnard Collin Engstrom Daniel Griffin Xiayuan Huang Ross Kleiman Finn Kuusisto (post-doc, jointly advised with Nasia Safdar, Ron Stewart, and James Thomson) David Merrell Wei Zhang Alumni Soumya Ray (CS Ph.D. 2005, co-advised with Mark Craven). Thesis: Learning from Data with Complex Interactions and Ambiguous Labels. Irene Ong (CS Ph.D., 2007). Thesis: Computational Techniques for Inferring Regulatory Networks. Jesse Davis (CS Ph.D., 2007). Thesis: View Learning: A Statistical Relational Learning Approach to Mining Biomedical Databases. Sean McIlwain (CS Ph.D., 2008). Thesis: Annotating Proteomic Mass Spectrometry Data for Qualitative and Quantitative Experiments. Sriraam Natarajan (Postdoc, 2008-2010, co-advised with Jude Shavlik) Houssam Nassif (CS Ph.D., 2012). Thesis: Differential Relational Learning. Timothy Chang (ICTR Ph.D. in Clinical Investigation, 2012, co-advised with Ron Gagnon). Thesis: Towards Translational Biomedical Informatics: Interpretable Models for Etiology, Early Diagnosis, and Prognosis. Peggy Peissig (ICTR Ph.D. in Clinical Investigation, 2013). Thesis: Computational Methods for Electronic Health Record-Driven Phenotyping. Jie Liu (CS Ph.D., 2014). Thesis: Statistical Methods for Genome-Wide Association Studies and Personalized Medicine. Jeremy Weiss (CS Ph.D., 2014). Thesis: Statistical Timeline Analysis for Electronic Health Records. Kendrick Boyd (CS Ph.D., 2014). Thesis: Mitigating the Risks of Thresholdless Metrics in Machine Learning Evaluation. Finn Kuusisto (CS Ph.D. 2015, co-advised with Jude Shavlik). Thesis: Machine Learning for Medical Decision Support and Individualized Treatment Assignment. Eric Lantz (CS Ph.D., 2016). Thesis: Machine Learning for Risk Prediction and Privacy in Electronic Health Records. Irene Giacomelli (Postdoc, 2016-2018, co-advised with Somesh Jha) Charles Kuang (CS Ph.D., 2018). Thesis: Towards Learning with High Causal Fidelity from Longitudinal Event Data. David Page's Most Recent Work Sinong Geng, Zhoubin Kuang, Peggy Peissig, and David Page. Temporal Poisson Square Root Graphical Models. Proceedings of the International Conference on Machine Learning (ICML), 2018. Sinong Geng, Zhaobin Kuang, Jie Liu, Stephen Wright, and David Page. Stochastic Learning for Sparse Discrete Markov Random Fields with Controlled Gradient Approximation Error. Proceedings of the International Conference on Uncertainty in Artificial Intelligence (UAI), 2018. Zhaobin Kuang, Yujia Bao, James Thomson, Michael Caldwell, Peggy Peissig, Ron Stewart, Rebecca Willett, and David Page. A Machine Learning-Based Drug Repurposing Approach Using Baseline Regularization.. Invited book chapter. In Silico Methods for Drug Repurposing: Methods and Protocols. Methods in Molecular Biology Series. Springer 2018. Irene Giacomelli and Somesh Jha and Marc Joye and C. David Page and Kyonghwan Yoon. Privacy-Preserving Ridge Regression with only Linearly-Homomorphic Encryption. 16th International Conference on Applied Cryptography and Network Security (ACNS), 2018. Kalscheur MM, Kipp RT, Tattersall MC, Mei C, Buhr KA, DeMets DL, Field ME, Eckhardt LL, Page CD. Machine Learning Algorithm Predicts Cardiac Resynchronization Therapy Outcomes: Lessons From the COMPANION Trial. Circulation: Arrhythmia and Electrophysiology, 11(1):e005499, 2018. Cheng N, Rahman MM, Alatawi Y, Qian J, Peissig PL, Berg RL, Page CD, Hansen RA. Mixed Approach Retrospective Analyses of Suicide and Suicidal Ideation for Brand Compared with Generic Central Nervous System Drugs. Drug Safety, 41(4):363-376, 2018. Marsha R. Mailick, Arezoo Movaghar, Jinkuk Hong, Jan S. Greenberg, Leann S. DaWalt, Lili Zhou, Jonathan Jackson, Paul J. Rathouz, Mei W. Baker, Murray Brilliant, David Page, Elizabeth Berry-Kravis. Health Profiles of Mosaic Versus Non-mosaic FMR1 Premutation Carrier Mothers of Children With Fragile X Syndrome. Frontiers of Genetics, 9:173, 2018. Lauren Bishop-Fitzpatrick, Arezoo Movaghar, Jan S Greenberg, David Page, Leann S DaWalt, Murray H Brilliant, Marsha R Mailick. Using machine learning to identify patterns of lifetime health problems in decedents with autism spectrum disorder. Autism Research, May 7, 2018. Ling Hao, Jingxin Wang, David Page, Sanjay Asthana, Henrik Zetterberg, Cynthia Carlsson, Ozioma C Okonkwo, Lingjun Li. Comparative Evaluation of MS-based Metabolomics Software and Its Application to Preclinical Alzheimer's Disease. Scientific Reports, 18;8(1):9291, 2018. Yirong Wu, Jun Fan, Peggy Peissig, Richard Berg, Ahmad Pahlavan Tafti, Jie Yin, Ming Yuan, David Page, Jennifer Cox, Elizabeth S. Burnside. Quantifying predictive capability of electronic health records for the most harmful breast cancer. Proc SPIE Int Soc Opt Eng, Feb 2018. Xiayuan Huang, Robert C. Elston, Guilherme J. Rosa, John Mayer, Zhan Ye, Terrie Kitchner, Murray H. Brilliant, David Page, Scott J. Hebbring. Applying family analyses to electronic health records to facilitate genetic research. Bioinformatics 34(4): 635-642, 2018 (available electronically 2017). Powerpoint from Xiayuan Huang's presentation at the 2016 International Conference on Quanatitative Genetics (ICQG5). Zhaobin Kuang, Sinong Geng, David Page. A Screening Rule for L1-Regularized Ising Model Estimation. NIPS 2017: 720-731. Zhaobin Kuang, Peggy L. Peissig, Vitor Santos Costa, Richard Maclin, David Page. Pharmacovigilance via Baseline Regularization with Large-Scale Longitudinal Observational Data. KDD 2017: 1537-1546. Yujia Bao, Zhaobin Kuang, Peggy L. Peissig, David Page, Rebecca Willett. Hawkes Process Modeling of Adverse Drug Reactions with Longitudinal Observational Data. Machine Learning in Healthcare 2017: 177-190. Finn Kuusisto, John W. Steill, Zhaobin Kuang, James A. Thomson, David Page, Ron M. Stewart. A Simple Text Mining Approach for Ranking Pairwise Associations in Biomedical Applications. AMIA Clinical Research Informatics, 2017. Devendra Singh Dhami, Ameet Soni, David Page, Sriraam Natarajan. Identifying Parkinson's Patients: A Functional Gradient Boosting Approach. Artif Intell Med, 10259: 332-337, 2017. Richard A. Hansen, Jingjing Qian, Richard Berg, James Linneman, Enrique Seoane-Vazquez, Sarah K. Dutcher, Saeid Raofi, C. David Page, Peggy Peissig. Comparison of generic-to-brand switchback patterns for generic and authorized generic drugs. Pharmacotherapy, 37(4): 429-437, 2017. Sriraam Natarajan, Vishal Bangera, Tushar Khot, Jose Picado, Anurag Wazalwar, Vitor Santos Costa, David Page, Michael Caldwell. Markov logic networks for adverse drug event extraction from text. Knowl. Inf. Syst. 51(2): 435-457, 2017. Yirong Wu, Elizabeth S. Burnside, Jennifer Cox, Jun Fan, Ming Yuan, Jie Yin, Peggy L. Peissig, Alexander G. Cobian, David Page, Mark Craven. Breast Cancer Risk Prediction Using Electronic Health Records. ICHI 2017: 224-228. J Fan, Y Wu, M Yuan, D Page, Liu, IM Ong, P Peissig, E Burnside. Structure-Leveraged Methods in Breast Cancer Risk Prediction. Journal of Machine Learning Research (JMLR), 17(85):1-15, 2016. J Liu, C Zhang, and D Page. Multiple Testing under Dependence via Graphical Models. The Annals of Applied Statistics, 10(3): 699-1724, 2016. Z Kuang, JA Thomson, M Caldwell, PL Peissig, RM Stewart, D Page. Baseline Regularization for Computational Drug Repositioning with Longitudinal Observational Data. Proc International Joint Conference on Artificial Intelligence (IJCAI), 2521-2528, 2016. Z Kuang, JA Thomson, M Caldwell, PL Peissig, RM Stewart, D Page. Computational Drug Repositioning Using Continuous Self-Controlled Case Series. Proc International Conference on Knowledg",
  "content_length": 40517,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:13"
}