{
  "name": "C. Estelle Smith",
  "homepage": "https://estellesmithphd.com",
  "status": "success",
  "content": "C. Estelle Smith, Ph.D. – Building a future where sociotechnical systems are designed for spiritual and mental health. Skip to content C. Estelle Smith, Ph.D. CV | Google Scholar | Faculty Page C. Estelle Smith is an Assistant Professor in the Department of Computer Science at the Colorado School of Mines (CS@Mines) and director of the #HappyPlace research lab. She is also General Chair of the SPIRITED Collective — an interdisciplinary group of researchers and practitioners interested in spirituality, religion, and interactive technology design. Her research focuses on investigating design opportunities in online spiritual care, an emerging subfield in Human-Computer Interaction and Social Computing that brings together design, ethics, Human-AI Interaction (HAI), AI/ML, social computing, and wellbeing. (Watch this seminar lecture to learn more.) Dr. Smith regularly collaborates with non-profits, industry partners, and international professional organizations committed to spiritual care and chaplaincy, creating new opportunities for impact and innovation in healthcare. She publishes regularly at top-tier ACM venues like CHI, CSCW, and TOCHI, focusing on online health communities, spiritual care, and ethics. Dr. Smith completed her PhD in Computer Science with a social computing emphasis at GroupLens Research at the University of Minnesota, Twin Cities (2016-2020). She was co-advised by Professors Loren Terveen (Department of Computer Science & Engineering) and Susan O’Conner-Von (Earl E. Bakken Center for Spirituality & Healing). Her dissertation explored spiritual and social support for users of Online Health Communities such as CaringBridge where patients and caregivers can turn for support as they navigate life-threatening illness. Her interdisciplinary research has also focused on topics like human-centered artificial  intelligence and machine learning, and science communications in HCI. After her PhD, Dr. Smith worked as a postdoctoral researcher at the University of Colorado Boulder, Department of Information Science with Professors Brian Keegan and Chenhao Tan (2021-2022). Funded by an NSF-sponsored grant, she studied community-centered data science techniques, genealogical relationships, and governance bots in online communities on Reddit. Estelle draws inspiration and purpose from her eclectic and ever-evolving collection of life experiences. She grew up in Minneapolis, MN, and has also lived in Costa Rica, the UK, and Austria, interspersed with lots of international travel. She holds a BA in English (Creative Writing, 2010), a BS in Neuroscience (2015), and a PhD in Computer Science (2020), along with three years of experience at San Francisco tech start-ups between degrees and freelance side gigs in Science Writing. She has bicycled across the USA, run a marathon, scaled cliffs, and dreams of someday kayaking the Amazon. In Estelle’s professional day-to-day, she is a passionate researcher, communicator, and educator. She is deeply grateful and humbled to participate in collaborative engagements with impactful organizations such as non-profit organizations like CaringBridge and the Wikimedia Foundation, and companies like Reddit. In her personal day-to-day, she is obsessed with rock climbing, skiing, mountain biking, camping and hiking adventures all across the Front Range. Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook CV  | Google Scholar 2025 Alemitu Bezabih, Shadi Nourriz, Anne-Marie Snider, Rosalie Rauenzahn, George Handzo, and C. Estelle Smith. Meeting Patients Where They’re At: Toward the Expansion of Professional Chaplaincy Care into Online Spiritual Care Communities. CSCW 2025. ( ACM DL | local copy | blog post | slides ) Context Matters: Ethical Challenges in Research with Online Communities. Matthew Zent, Stevie Chancellor, Casey Fiesler, Sarah Gilbert, Mohammad Rashidujjaman Rifat, C. Estelle Smith, Svetlana Yarosh, Seraphina Yong, Michael Zimmer. ACM CSCW 2025 Workshop. October 2025. Bergen, Norway. ( ACM DL | local copy ) Diving Into the Ocean of Religious and Spiritual Design Research. Alexandra Kitson, Brett A. Halperin, C. Estelle Smith, Franzisca Maas, Michael Hoefer, Sara Wolf, and Elizabeth Buie.  DIS 2025 Workshop. July 2025. ( ACM DL | local copy ) Jesan Ahammed Ovi, Gabe Fierro, and C. Estelle Smith. Assessing Student Adoption of Generative Artificial Intelligence from 2023 to 2024.  ASEE 2025, Division of Computers in Education. Best Paper Award (Top 4% of Accepted Papers). ( local copy | Preprint | blog post ) 2024 C. Estelle Smith, Alemitu Bezabih, Diana Freed, Brett A. Halperin, Sara Wolf, Caroline Claisse, Jingjin Li, Michael Hoefer, and Md Rashidujjaman Rifat. (Un)designing AI for Mental and Spiritual Wellbeing. Panel at CSCW 2024. Moderator: Jingjin Li. Panelists: Munmun De Choudhury, George Handzo, Diana Freed, C. Estelle Smith. (ACM DL | local copy | slides | audio recording) C. Estelle Smith, Shamika Klassen, Gale H. Prinster, Chenhao Tan, Brian Keegan. Governance of the Black Experience on Reddit: r/BlackPeopleTwitter as a Case Study in Supporting Sense of Virtual Community for Black Users. CSCW 2024. DEI Recognition Award (Top 4% of papers). (ACM DL | local copy | blog post) Gale H. Prinster*, C. Estelle Smith*, Chenhao Tan, and Brian C. Keegan. Community Archetypes: An Empirical Framework for Guiding Research Methodologies to Reflect User Experiences of Sense of Virtual Community. CSCW 2024.  *Co-first authors. (ACM DL | local copy | blog post) Sanjay Kairam, Michael S. Bernstein, Amy Bruckman, Stevie Chancellor, Eshwar Chandrasekharan, Munmun De Choudhury, Casey Fiesler, Hanlin Li, Nicholas Proferes, Manoel Horta Ribeiro, C. Estelle Smith, Galen Weld. Community-Driven Models for Supporting Research on Social Platforms. SIG at CSCW 2024. C. Estelle Smith. Meeting Patients Where They’re @: Chaplains’ Reflections on Online Spiritual Care Communities. Virtual presentation for the Telechaplaincy.io Community of Practice, August 2024. (slides | recording) C. Estelle Smith, Kylee Shiekh, Hayden Cooreman, Sharfi Rahman, Yifei Zhu, Md Kamrul Siam, Michael Ivanitskiy, Ahmed M. Ahmed, Michael Hallinan, Alexander Grisak, and Gabe Fierro. Early Adoption of Generative Artificial Intelligence in Computing Education: Emergent Student Use Cases and Perspectives in 2023. ITiCSE 2024. Milan, Italy. July 2024. (ACM DL | local copy) C. Estelle Smith, Alemitu Bezabih, and Shadi Nourriz. On the Challenges of Implementing Online Spiritual Care Communities (OSCCs) in Collaboration with Diverse Healthcare Teams. Paper for CHI 2024 Workshop: Conducting Research at the Intersection of HCI and Health: Building and Supporting Teams with Diverse Expertise to Increase Public Health Impact. Honolulu, Hawaii. May 2024. (local copy) Shadi Nourriz, Alemitu Bezabih, and C. Estelle Smith. On the Design Risks of Empathy Fatigue. Paper for CHI 2024 Workshop: Empathy-Centric Design: Scrutinizing Empathy Beyond the Individual. Honolulu, Hawaii. May 2024. (ACM DL | local copy) Yifei Zhu, Joe Peak, Eryn Kelsey Adkins, and C. Estelle Smith. FETCH: Fostering and Enhancing Teamwork, Communication, and Healthy Community Among Animal Shelter Volunteers through Mobile Technology. Late-Breaking Work Paper at CHI 2024. Honolulu, Hawaii. May 2024. (ACM DL | local copy) C. Estelle Smith, Alemitu Bezabih, Shadi Nourriz, Bo Wu, and Gabe Fierro. Toward LLM-Powered Robots In Engineering Education. Workshop paper for HRI 2024 Workshop: Human – Large Language Model Interaction: The dawn of a new era or the end of it all? Boulder, Colorado. March 2024. (local copy) Alemitu Bezabih, Shadi Nourriz, and C. Estelle Smith. Toward LLM-Powered Social Robots for Supporting Sensitive Disclosures of Stigmatized Health Conditions. Workshop paper for HRI 2024 Workshop: Scarecrows in Oz: Large Language Models in Human-Robot Interaction. Boulder, Colorado. March 2024. (local copy) 2023 C. Estelle Smith, Hannah Miller-Hillberg, and Zachary Levonian. “Thoughts & Prayers” or “❤️ & 🙏”: How the Release of New Reactions on CaringBridge Reshapes Supportive Communication During Health Crises. CSCW 2023. ( ACM DL | local copy | slides | short blog ) Many Worlds of Ethics: Ethical Pluralism in CSCW. Mohammad Rashidujjaman Rifat, Ayesha Bhimdiwala, Ananya Bhattacharjee, Amna Batool, Dipto Das, Nusrat Jahan Mim, Abdullah Hasan Safir, Sharifa Sultana, Taslima Akter, C. Estelle Smith, Bryan Semaan, Shaimaa Lazem, Michael Muller, Robert Soden, Syed Ishtiaque Ahmed. CSCW 2023 Workshop. October 2023. Minneapolis, MN. (ACM DL ) Robert Markum, Sara Wolf, C. Estelle Smith, Simon Luthe, Caroline Claisse, Franzisca Maas, and Michael Hofer. Design Principles for Participatory Design in Religious and Spiritual Contexts. Spirituality, Religion, and Interactive Technology Design (SPIRITED) Collective Zine. Issue 1. June 2023. (Zine link) C. Estelle Smith. Ethical Training for the ChatGPT Future. Graduate Research and Discovery Symposium (GRADS) at Colorado School of Mines. April 6, 2023. (Slides) Joshua Nunziato, C. Estelle Smith, Heather Fester, and Helen Davies. Ethics of ChatGPT Workshop. February 10, 2023 at University of Colorado Boulder, Leeds School of Business. Funded by the Daniels Fund Ethics Initiative Collegiate Program (DFEICP). (Slides) 2022 C. Estelle Smith, Irfanul Alam, Chenhao Tan, Brian C. Keegan, and Anita Blanchard. The Impact of Governance Bots on Sense of Virtual Community: Development and Validation of the GOV-BOTs Psychometric Scale. CSCW 2022. (ACM DL | local copy | short blog ) Charles Chuankai Zhang, Mo Houtti, C. Estelle Smith, and Loren Terveen. Working for the Invisible Machines or Pumping Information into an Empty Void? An Exploration of Wikidata Contributors’ Motivations. CSCW 2022. (ACM DL | local copy) C. Estelle Smith. What are people really seeking when they’re looking for health information on Reddit? Workshop paper for Information-Seeking, Finding Identity: E",
  "content_length": 16242,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:11"
}