{
  "name": "C. Krishna Mohan",
  "homepage": "http://www.iith.ac.in/~ckm",
  "status": "success",
  "content": "Prof. C Krishna Mohan Address : Room No. CS-203 IIT Hyderabad Kandi, Sangareddy, Hyderabad-502284 Telangana (State), India. Phone : +91 - 94917 12312 (Mob) 040- 2301 6352(Off) Fax : +91 â 40 â 2301 6003 Email : ckm[at]cse.iith.ac.in Website : www.iith.ac.in/~ckm/ Google Scholar : GvSsuVEAAAAJ ORCiD : 0000-0002-7316-0836 SCOPUS : 55325461200 WoS ID : LZH-3921-2025 C Krishna Mohan Professor Department of Computer Science and EngineeringFormer Dean of Public and Corporate Relations Â Â Brief Biography Dr. C. Krishna Mohan is currently a Professor in the Department of Computer Science and Engineering at the Indian Institute of Technology Hyderabad (IIT Hyderabad), India. He has been with IIT Hyderabad since 2009. He worked as Dean of Public and Corporate Relations, IIT Hyderabad, from Jan 2020 till Jan 2022. He was also the Founding Head of the Department of Computer Science and Engineering, IIT Hyderabad, from May 2010 till October 2014. Before joining IIT Hyderabad, he was a senior faculty member at the National Institute of Technology Karnataka, Surathkal (NITK Surathkal). He received his M.Tech from NITK Surathkal and Ph.D. from the Indian Institute of Technology Madras (IIT Madras). He held a Visiting Professor's position at Nihon University, Japan. He was a Visiting Researcher at Carnegie Mellon University, Pittsburgh, USA during the summer of 2007, and he was a Visiting Researcher at University of California Irvine, California during the summer of 2013. Also, he was a Visiting Researcher at Kennesaw State University , Atlanta, USA during June to August 2025. Prof Krishna Mohan heads Visual Learning and Intelligence Lab (VIGIL) at IIT Hyderabad working in the research areas of video content analysis, Representation learning, and AI/ML. He is a 2 time recipient of Excellence in Teaching Award, in recognition of distinguished teaching in the years 2018 & 2021 at IIT Hyderabad. Also, he received the Faculty Research Excellence Award in 2024 at IIT Hyderabad. He has published more than 150 papers in peer-reviewed international journals and conference proceedings. He has guided several Ph.D. (20), Masters (75), and Undergraduate (56) students. He has successfully carried out several projects with industry, government agencies, and academia. Dr. C. Krishna Mohan was a Member of the Board of Governors (BOG), IIT Hyderabad, from June 2020 to December 2021 and Member of the Board of Governors (BOG), IIIT Kottayam from July 2022. Also, he is a Member of the Board of Directors, IIT Hyderabad Technology Research Park from September 2020 to August 4, 2024 and a Member of the Board of Directors, Idea Technology Incubation Center i-TIC which is Technology Business Incubator (TBI) at IIT Hyderabad from September 2020. He is a Senate Member of IIT Hyderabad from November 2010. Also, he served as Senate Member of IIT Tirupati from September 2019 to April 2022, and IIITDM Kurnool from May 2019 to May 2021. He serves as a reviewer for several reputed international conferences and IEEE journals and is a Senior Member of IEEE, Member of ACM, AAAI Member, Life Member of ISTE, Fellow of IEI, Fellow of IETE, and Fellow of TAS. In 2023-2024, he was awarded with the prestigious Fulbright-Nehru International Education Administrators Seminar fellowship. -<<< RESEARCH IMPACT >>>- Prof. C. Krishna Mohan's research is centered on advanced Representation Learning techniques, with a strong emphasis on Image and Video Content Analysis, Intelligent Transportation Systems, and Edge-deployable Artificial Intelligence. ... His work seamlessly integrates core machine learning methodologies with real-world problem-solving, enabling the development of scalable, data-efficient solutions for complex spatio-temporal data analysis. A central theme of his research is the design of robust representation learning techniques tailored for video understanding and image-based scene interpretation. In the domain of intelligent transportation systems (ITS), Prof. Mohan has led the development of cutting-edge AI solutions for traffic monitoring, vehicle re-identification, pedestrian behavior analysis, and anomaly detection. These systems are engineered to operate under real-time constraints, enabling efficient and low-latency deployment through Edge AI in scenarios such as autonomous navigation and on-device video analytics. In parallel, his ITS research also plays a pivotal role in enabling smart city infrastructure by providing scalable AI-driven tools for urban traffic optimization, public safety monitoring, and incident detection. By harnessing data from live surveillance feeds and embedded sensors, his work facilitates critical applications in geospatial intelligence, environmental monitoring, and urban planning. Prof. Mohan's ability to translate deep representation learning into practical, deployable, and impactful AI systems positions him at the forefront of applied artificial intelligence. His contributions continue to shape the evolution of edge-intelligent systems and domain-aware learning across both academia and industries. See more... I. Representation Learning for Urban Mobility and Implementation Research in representation learning has played a pivotal role in advancing urban mobility solutions, especially in the context of complex and unstructured traffic environments prevalent in Indian cities. These efforts have led to the development of AI-driven models capable of accurately detecting critical traffic violations, such as helmetless riding, abrupt lane changes, and potential collision trajectories, while also predicting risky behaviors in dynamic traffic conditions. These systems enable real-time decision-making in resource-constrained and cost-sensitive urban settings. As part of the Indo-Japanese M2Smart [Project Demo: Link] (Multimodal Mobility Smart City) Project, intelligent mobility solutions have been conceptualized and deployed through a collaborative framework involving academic and industrial stakeholders. ... The project covers the full AI pipeline from multimodal data acquisition via traffic cameras and environmental sensors to scalable system-level implementations for intersection monitoring, smart parking, and dynamic traffic management. Field deployments, including testbeds on the IIT Hyderabad campus and a 30 km segment of National Highway NH-65, serve as real-world validation environments for building sustainable and data-driven smart city infrastructure. Additionally, the advancements in representation learning for intelligent transportation have been deployed in real-world settings, notably in Ahmedabad and Hyderabad cities in India, where AI-powered traffic monitoring systems, including helmet detection, chain snatching detection and accident prediction modules, are operational. This work on detecting street-level crimes such as snatch theft using real-world surveillance footage marks a significant advancement in urban safety analytics and has garnered widespread attention in the media. See more... â¢ Societal Impact The project has contributed to safer and more efficient urban transportation by enabling real-time detection of traffic violations, accident prediction, and intelligent monitoring. ... These AI-driven systems support improved traffic management and enforcement, helping authorities respond more effectively to road incidents. With deployments in cities like Ahmedabad and Hyderabad, the solutions are actively enhancing public safety and urban mobility. See more... â¢ Open-Source Datasets and Codes SkyEye Dataset: This is the first aerial dataset for monitoring intersections with mixed traffic and lane-less behavior. Around 1 hour of video each from 4 intersections, namely, Paldi (P), Nehru bridge - Ashram road (N), Swami Vivekananda bridge - Ashram road (V), and APMC market (A) in the city of Ahmedabad, India. [Link] EyeonTraffic (EoT) Dataset: The EyeonTraffic (EoT) dataset is a large-scale aerial traffic dataset specifically curated to study traffic states in mixed, lane-less urban environments. It comprises three hours of high-resolution aerial videos recorded at three busy intersections in Ahmedabad, IndiaâPaldi, Nehru Bridge, and APMC Market captured using a DJI Phantom 4 Pro drone at 50 FPS in 4K resolution. [Link] Snatch 1.0 Dataset: This is a real-world surveillance video dataset curated to study the rare and complex activity of snatch thefts. It consists of 816 video clips, each 10 seconds long, extracted from over 4.5 hours of CCTV footage recorded by the Hyderabad Traffic Police [Link] IITH Accident Dataset: This is a surveillance video dataset curated for real-world road accident detection. Collected from the Hyderabad City CCTV surveillance network, the dataset comprises videos recorded at 30 FPS, capturing a variety of challenging conditions including daylight, high sunlight, and nighttime scenarios [Link] IITH Helmet 1 & IITH Helmet 2 Datasets: This dataset is collected from the surveillance network at the Indian Institute of Technology Hyderabad, India (IITH) campuS. It is a 2-hour surveillance video dataset which is collected at 30 frames per second. This second dataset is acquired from the CCTV surveillance network of Hyderabad city in India. It is a 1.5 hour video which is collected at 25 frames per second. [Link] AIWD6 (Adverse Intermediate Weather Driving) Dataset: This is A large-scale dataset encompassing six specific transitional weather states, sunny to rainy, rainy to sunny, sunny to foggy, foggy to sunny, cloudy to rainy, and rainy to cloudy, generated across three time intervals using a Variational Autoencoder (VAE) based data interpolation technique. [Link] IIT Hyderabad Open-Air Parking Dataset: The dataset comprises 24 hours of continuous video data captured from an open-air off-street parking area at IIT Hyderabad, using a Hikvision Exir mini bullet camera installed at a height of 25 meters. [Link] â¢ Patents India Patent No. 414699, Chalavadi Krishna Mohan, Dinesh Singh, C",
  "content_length": 84901,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:15"
}