{
  "name": "C. Maria Keet",
  "homepage": "http://www.meteck.org",
  "status": "success",
  "content": "Homepage of Maria Keet Homepage of Maria Keet Home Research Teaching Publications Software, data sets, ontologies Other topics Maria Keet R&D Manager and Senior Semantic Engineer Meaningfy S.a.r.l Luxembourg (remote) Professor extraordinary Computer Sience division, Department of Mathematical Sciences Stellenbosch University, South Africa Home (R&D): www.meteck.org Home (Author): mkeet.com Blog: keet blog email: maria dot keet apestaartje meaningfy dot ws LinkedIn Industry CV, 2-paragraph short bio, long academic CV, publications, and my Google Scholar profile ***If you ended up on this page, but are not interested in my work, then choose either my author page where there's information on the four books I wrote, or Other topics, where there's information on Escher, book reviews, some photos and other not-quite-random themes.*** Research interests Knowledge Engineering -- See als the KnowledgE ENgineering (KEEN) Team webpage - Ontology Engineering (foundations, methods, tools) - Relations in ontologies, such as their foundations, parthood and other part-whole relations - Conceptual modelling & ontology languages (Description Logics, OWL, Object-Role Modeling, etc.) - Natural language generation - Logic-based knowledge representation Brief outline research projects I am currently working mainly on various aspects of ontology engineering, ontology-driven conceptual data modelling, and ontologies' interface with natural language. With an extensive theoretical foundation in ontology engineering, methods such as FORZA and DiDOn, I lead or am involved in application development of some of the ontology engineering methods, such as TDDonto for test-driven development and the BFO Classifier to align ontologies to BFO, and OntoPartS to chose a part-whole relation, conduct evaluations, and contributed ontology development, including SewerNet and DMOP. Specific subject domains for AI application areas include, among others, cell biology, hydrology, and ecology Read more about current research and funded projects and/or check the Publications page for concrete results. Teaching (in 2025) Modelling Information for Data Analysis and Critical Thinking. (Digital Learning Hub, Luxembourg) Information Modelling for System Design. (Digital Learning Hub, Luxembourg) Introduction to AI & IT Ethics: Why an AI Act Is Needed. (Digital Learning Hub, Luxembourg) previous years and courses and current and previous postgraduate and honours students Short bio C. Maria Keet (PhD, MSc, MA, BSc(hons)) is the R&D Manager at Meaningfy S.a.r.l. where she is setting up the R&D division. She focuses her research on ontologies, ontology engineering, and conceptual data modelling (application profiles), which has resulted in over 150 peer-reviewed publications at venues including ESWC, FOIS, EKAW, K-CAP, ER, KR, CIKM, Applied Ontology, DKE, and the Semantic Web Journal. She was PI on three NRF-funded (CPRR-grant) projects on ontologies and natural language technologies, and was PI on an DST/MINCyT-funded bi-lateral project with Argentina on ontology-driven conceptual modelling. She was involved in several EU projects, including the 'STARWARS project' (MCSA, Horizon), TONES (FET FP6), Net2 (IRSES FP7), and e-Lico (FP7), and has served in over 70 Program Committees and reviewed for numerous journals; recently she was a General Chair of FOIS2025, and PC Chair for INLG2023 and ISWC2022 Resources, and she's an editorial board member of Applied Ontology and TGDK. She has over 15 years of teaching and teaching administration experience, from small to very large classes and both at undergraduate and postgraduate levels, she supervised numerous postgraduate students to graduation, and she wrote an award-winning textbook on ontology engineering. Before returning to industry, Maria was an Associate Professor in Computer Science at the University of Cape Town, South Africa, Senior lecturer at the University of KwaZulu-Natal, and an Assistant Professor at the KRDB Research Centre, Free University of Bozen-Bolzano, Italy. She obtained a PhD in Computer Science at the KRDB Research Centre in 2008, following a BSc(hons) 1st class in IT & Computing from the Open University UK in 2004, a MSc in Food Science (Microbiology) from Wageningen University and Research Centre, the Netherlands (1998), and an MA 1st class in Peace & Development Studies from the University of Limerick, Ireland (2003). Decades ago, she worked as systems engineer in the IT industry with its vocational training (MSCE, ASE, ITIL), for Compaq, Eurologic, and Brunel IT. This page was last updated on 11 May, 2025 Image credits: Je'nine May Photography Design based on 3XPL051V3 by Robin Holm | Valid xhtml | Valid css",
  "content_length": 4711,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:14"
}