{
  "name": "Cagdas Evren Gerede",
  "homepage": "http://cegerede.etu.edu.tr",
  "status": "success",
  "content": "﻿ Faculty Name: Department Name Çağdaş Evren Gerede Computer Engineering Department Home Teaching CV Research Contact Contact TOBB University of Economics and Technology, Söğütözü, Çankaya, Ankara Turkey Email: cegerede (@ sign) etu.edu.tr Web: cegerede.etu.edu.tr Çağdaş Evren Gerede received the B.Sc. degree in Computer Engineering and Information Science from Bilkent University and the M.S. and Ph.D. degrees in Computer Science from the University of California, Santa Barbara, USA. He is an Assistant Professor in Computer Engineering Department at TOBB University of Economics and Technology. Before joining the university, he worked at IBM TJ Watson Research Center, NY, USA, Citrix Systems, CA, USA, and Google, CA, USA and YouTube, CA, USA. Dr. Gerede graduated from Bilkent University as the valedictorian of his class in 2002. He moved to Santa Barbara, California for his PhD studies. Under the supervision of Prof. Jianwen Su and Prof. Oscar Ibarra, he worked on the application of Automata Theory on the areas of Web Services and Business Process Management. During his studies, he collaborated with Kamal Bhattacharya and Jun-Jang Jeng from IBM TJ Watson Research Center and Rick Hull from Bell Labs. After his PhD, he joined Citrix Systems as a Research Engineer and worked on products like GoToMeeting, GoToAssist and GoToMyPC. His last industry experience was at Google where he worked on developing large scale backend services for YouTube product followed by conducting research and development on Assistive Technologies with Android Devices at Google. He has hands-on experience in areas such as Service-Oriented Computing, Developing and Maintaining Scalable Web Services, Cloud Computing, Automated Analysis and Verification of Business Processes, Large-Scale Software Development, Developing Large Web-based or Mobile applications. .",
  "content_length": 1873,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:20"
}