{
  "name": "Cairong Zhao",
  "homepage": "https://vill.tongji.edu.cn/info/1067/1396.htm",
  "status": "success",
  "content": "ï»¿ Directorï¼Zhao Cairong-è§è§ä¸æºè½å­¦ä¹ å®éªå®¤Visual and Intelligent Learning Lab æ¬¢è¿è®¿é®è§è§ä¸æºè½å­¦ä¹ å®éªå®¤ç½ç«ï¼ English å­¦æ ¡é¦é¡µ ç½ç«é¦é¡µ å®éªå®¤ç®ä» æå è´è´£äºº æå¸ å­¦ç ç ç©¶æ¹å æºè½è§é¢çæ§åæ ä¸ç¡®å®æ§åæ æ¡¥æ¢ç¶æçæµ æºè½é©¾é©¶ è®ºè å­¦æ ¡è¯¾ç¨ æ¬ç§çè¯¾ç¨ ç ç©¶çè¯¾ç¨ èµæä¸è½½ ææ°å¨æ VILLæ°é» éç¥å ¬å Director ç½ç«é¦é¡µ > People > Director > æ­£æ Directorï¼Zhao Cairong ä½è ï¼ æ¶é´ï¼2020-04-07 ç¹å»æ°ï¼ Zhao Cairong, doctor of Engineering, Associate Professor of College of Electronics and Information Engineering of Tongji University, doctoral tutor and assistant director. Dr. Zhaoâs research interests include artificial intelligence, machine learning, granular computing, pattern recognition and computer vision, etc. Dr. Zhao has published more than 40 papers in international academic journals such as IEEE Transactions on MultimediaãIEEE Transactions on Neural Networks and Learning Systems, Sciences China Information Sciences, Pattern Recognition, Neurocomputing and international academic conferences such as ICCV, ICPR, ICIP, of which more than 30 articles are indexed by SCI. Google scholar has quoted more than 200 times in total. Dr. Zhao has hosted and participated in a number of National Natural Science Foundation projects, including two National Natural Science Foundations and a sub-project of National Science and Technology Major Project of the Ministry of Science and Technology of China. He also hosted five Fundamental Research Funds for the Central Universities, four Laboratory Research Funds, and more than ten Transverse Research Projects. Dr. Zhao is a Member of China Computer Federation, Chinese Association for Artificial Intelligence and Association for Computing Machinery (ACM). çæææï¼åæµå¤§å­¦ è§è§ä¸æºè½å­¦ä¹ å®éªå®¤ å°åï¼ä¸æµ·å¸åå®åºæ¹å®å ¬è·¯4800å·åæµå¤§å­¦åå®æ ¡åºæºä¿¡é¦4æ¥¼ Emailï¼zhaocairong@tongji.edu.cn",
  "content_length": 2028,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:21"
}