{
  "name": "Caitlin L. Kelleher",
  "homepage": "https://www.cse.wustl.edu/~ckelleher",
  "status": "success",
  "content": "[ Caitlin Kelleher @ WUSTL ] Caitlin Kelleher Professor Dept. of Computer Science and Engineering Washington University in St. Louis Email: PhD, Carnegie Mellon University Expertise: Human-Centered Programming EXPAND ALL SECTIONS COLLAPSE ALL SECTIONS Introduction About I'm a Professor at Washington University in St. Louis in the Department of Computer Science and Engineering. My research focuses on democratizing programming for diverse audiences of programmers. Most of my formal training has been in computer science and specifically in human-computer interaction, but I draw on bodies of work in the learning sciences, education, and social science as well. My research takes a user-centered approach, often beginning with studies that seek to understand users' strategies and barriers and culminating in new interface tools that address the identified needs. Along the way, I use both qualitative and quantitative tools to analyze user behavior. I've tried to incorporate a taste of these methods and experiences into my courses and empower students to apply user-centered design tools in their own projects. Research I have long been interested in the process of programming computers, and especially with the aspects of learning that are deeply entwined with the creation of computer programs. While individual statements are often simple, programs of any significant length introduce complexity that requires intricate and detailed problem solving. Exploring where and how complexity arises and how to make it manageable for people fascinates me. Understanding and supporting programmers is especially important today. Computer programs now support nearly every aspect of our lives, yet are still authored by a small, non-representative group. My work seeks to enable anyone and everyone to use programming to create. With my research group, I explore ways to democratize programming for audiences ranging from children to occupational therapists to occasional programmers. Background I received my PhD from Carnegie Mellon's School of Computer Science working with Dr. Randy Pausch and my BS from Virginia Tech, where I got my first taste of HCI research With Dr. Rex Hartson and Dr. Debbie Hix. The programming system I developed for my dissertation appears on Computer Engineering Barbie's laptop screen. In graduate school, I had an amazing opportunity to work with Dr. Alan Kay's group (then at Disney Imagineering) on Squeak's eToys project. I completed a short post-doc at CMU before beginning as an Assistant Professor at Washington University.",
  "content_length": 2563,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:23"
}