{
  "name": "Caiwen Ding",
  "homepage": "https://caiwending.github.io/web/home.html",
  "status": "success",
  "content": "Home Caiwen Ding Computer Science and Engineering University of Minnesota, Twin Cities Room 6-201 Keller Hall 200 Union Street S.E. Minneapolis, MN 55455-0159 Contact: Email: dingc@umn.edu Caiwen joined as an Associate Professor in the Department of Computer Science & Engineering at University of Minnesota Twin Cities in Aug 2024. Previously, he was an assistant professor in the School of Computing at the University of Connecticut. He received his Ph.D. degree from Northeastern University (NEU), Boston in 2019, supervised by Prof. Yanzhi Wang. His interests include Algorithm-system co-design of machine learning/artificial intelligence; computer architecture and heterogeneous computing (FPGAs/GPUs); privacy-preserving machine learning; machine learning for electronic design automation (EDA); neuromorphic computing; computer vision and natural language processing. His work has been frequently published in high-impact conferences (e.g., DAC, ICCAD, ASPLOS, ISCA, MICRO, HPCA, CCS, Oakland, SC, FPGA, MLSys, NeurIPS, ICML, CVPR, AAAI, ACL, EMNLP, IJCAI, ICRA, DATE). He is a recipient of the NSF CAREER Award, Amazon Research Award, and CISCO Research Award. He received the Best Paper Award at the 2025 IEEE International Conference on LLM-Aided Design (ICLAD), 2023 AAAI DL-Hardware Co-Design for AI Acceleration (DCAA) workshop, Outstanding student paper award at 2023 HPEC, Best Paper Award Nomination at DATE 2018 and DATE 2021, and publicity paper at DAC 2022. His team won first place in accuracy and fourth place overall at the 2022 ACM/IEEE TinyML Design Contest at ICCAD. He received two UConn Research Excellence Awards in 2021 and 2023, respectively, and the 2021 Excellent in Teaching Award from UConn Provost. Google Scholar DBLP Semantic Scholar Visit our GitHub repository! [To Prospective Ph.D./postdoc Applications] I am always looking for highly-motivated Ph.D./postdoc students who have strong interests in FPGAs/GPUs programming, EDA/Architecture, or machine learning/deep learning, with full financial support. You are welcome to drop me an email at cwen1988@gmail.com (receiving too many emails from my umn email address) with your materials such as CV and transcripts and mention my name in your application. PostDoc application portal: https://hr.myu.umn.edu/jobs/ext/365657. The \"Job Opening ID\" is #365657. Recent News 09/2025 Two Papers are accepted by 2025 NeurIPS. 08/2025 Honored to receive a Research Grant from NSF. 07/2025 Two Papers are accepted by 2025 ICCAD. 06/2025 HiVeGen won Best Paper Award at 2025 ICLAD! 05/2025 Amit starts summer intern at Adobe Research. Congrats! 05/2025 Xi starts summer intern at Nvidia. Congrats! 04/2025 Two papers are accepted to 2025 ICS. 04/2025 One paper is accepted to Scientific Reports. 03/2025 Honored to receive a CISCO Research Award. 03/2025 Our workshop proposal “DCgAA 2025: International Workshop on DL-Hardware Co-Design for Generative AI Acceleration” is accepted to DAC 2025. 02/2025 One paper is accepted to 2025 CVPR . 02/2025 Honored to receive a Research Grant from the DOE Lawrence Livermore National Laboratory as PI. 01/2025 One paper is accepted to 2025 ICLR. 12/2024 Hongwu has successfully defended and will be joining Adobe Research as a full-time Research Scientist. Congratulations, Dr. Peng! 11/2024 Honored to receive a Research Grant from DOE. 10/2024 Our team won third place at the 2024 ICCAD Contest on LLM-Assisted Hardware Code Generation. Thanks to Dr. Yu from UMD for the leading effort! 09/2024 One paper is accepted to 2024 NeurIPS. As of Oct 2024, MACM Ranked #1 on Math Word Problem Solving on MATH in paperwithcodes. 09/2024 Shanglin has successfully defended and will be joining Walmart AI Lab as a full-time Senior Data Scientist. Congratulations, Dr. Zhou! 09/2024 Honored to receive a Research Grant from the DOT Safe Streets and Roads for All (SS4A) Grant Program. 08/2024 Caiwen joins as an Associate Professor in the CS&E Department at University of Minnesota Twin Cities in Fall 2024. 08/2024 Honored to receive a Research Grant from NIH/NCI. 07/2024 One paper is accepted to 2024 ECCV. 06/2024 One paper is accepted to 2024 ICCAD. 05/2024 We have a fruitful School of Computing Annual PhD Fellowship achievement this year. Kiran receives Predoctoral Honorable Mention; Jiahui receives Predoctoral Fellowship; Hongwu receives Predoctoral Prize for Research Excellence; Shaoyi receives Marion and Frederick Buckman Engineering Fellowship; Shanglin receives Predoctoral Fellowship; Amit receives Professor Reda Ammar Fellowship. Congrats to everyone! 05/2024 Hongwu starts summer intern at Adobe Research. Congrats! 05/2024 Shaoyi is selected as one of the 2024 ML and Systems Rising Stars. Congrats! 05/2024 Shaoyi will join as a Tenure-Track Assistant Professor in the Department of Computer Science at Stevens Institute of Technology in Fall 2024. Congrats! 04/2024 Honored to receive a Research Grant from Connecticut Cooperative Transportation Research Program (CCTRP). 04/2024 Invited to serve as ComSys track co-chair for 2024 ICCD. 04/2024 Invited to serve on the external review committee for 2024 MICRO. 04/2024 One paper is accepted by 2024 ICS. 03/2024 Invited to serve as a reviewer at ECCV 2024, ACL 2024, IJCAI 2024. 03/2024 Honored to receive an Amazon Research Award. 03/2024 One paper is accepted by 2024 ICPE. 02/2024 Our workshop proposal “DCgAA 2024: International Workshop on DL-Hardware Co-Design for Generative AI Acceleration” is accepted to DAC 2024. 02/2024 Honored to receive the NSF CAREER Award. 02/2024 Honored to receive a CISCO Research Award. 12/2023 Honored to receive a Research Grant from the DOE Lawrence Livermore National Laboratory as PI. 12/2023 Honored to receive a Research Grant from the DOT NEUTC program as PI. 11/2023 One paper is accepted by 2024 DATE. 11/2023 One paper is accepted by 2024 ASPLOS. [Codes] 11/2023 One paper is accepted by IEEE CAL. 11/2023 One paper is accepted by IEEE I-ITS. 10/2023 One paper is accepted by 2024 HPCA. 9/2023 One paper is accepted by 2023 NeurIPS. More News Research Sponsors:",
  "content_length": 6091,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:21"
}