{
  "name": "Calin C. Guet",
  "homepage": "https://ist.ac.at/research/research-groups/guet-group",
  "status": "success",
  "content": "ISTA | Guet Group HomeResearchGuet Group EDUCATION Graduate School Postdocs Internship and Scholarship Program VISTA Science Experiences Guet Group Systems and Synthetic Biology of Genetic Networks Living systems are characterized by connections and interactions across many scales – from genes, to organelles, to cells, to organs, to ecologies – as parts of networks. Which basic rules, if any, do these networks follow? The Guet group studies the molecular biology and evolution of gene regulatory networks by analyzing both natural and synthetic networks.Genes and proteins constitute themselves into bio-molecular networks in cells. These genetic networks are engaged in a constant process of decision-making and computation over time scales of a few seconds to the time it takes a cell to divide, and beyond. By studying existing networks and constructing synthetic networks in living cells, the group works to understand how molecular mechanisms interact with evolutionary forces that ultimately shape each other. They use a variety of classical and modern experimental techniques that together enable them to construct any imaginable network in living bacteria and thus to study the network dynamics from the single-cell level all the way to the level of small ecologies, in which bacteria interact with bacteriophages. Group Leader Calin Guet Professor +43 2243 9000 4001 Calin.Guet@ist.ac.at Administrative Support Evan Casella Assistant to Professors +43 2243 9000 1194 Evan.Casella@ist.ac.at Iva Atanaskovic Postdoc Iva.Atanaskovic@ist.ac.at Athina Diakogianni PhD Student Athina.Diakogianni@ist.ac.at Nathalie Gruber PhD Student Nathalie.Gruber@ist.ac.at Ekaterina Krasnopeeva Postdoc +43 2243 9000 0 Ekaterina.Krasnopeeva@ist.ac.at Antoine Loussouarn PhD Student antoine.loussouarn@ist.ac.at Stepan Ovchinnikov PhD Student Stepan.Ovchinnikov@ist.ac.at Pavel Payne Postdoc Pavel.Payne@ist.ac.at Roderich Römhild Postdoc +43 2243 9000 4003 Roderich.Roemhild@ist.ac.at Bryan Wu Postdoc Bryan.Wu@ist.ac.at Puzhen Xia PhD Student puzhen.xia@ist.ac.at Current Projects Information processing and evolution of complex promoters | Single-cell biology of multi-drug resistance | Biology, ecology, and evolutionary dynamics of restriction-modification systems Recent Publications Pleska M, Lang M, Refardt D, Levin B, Guet CC. 2018. Phage-host population dynamics promotes prophage acquisition in bacteria with innate immunity. Nature Ecology and Evolution. 2(2), 359–366. View Lagator M, Sarikas S, Acar H, Bollback JP, Guet CC. 2017. Regulatory network structure determines patterns of intermolecular epistasis. eLife. 6, e28921. View Steinrück M, Guet CC. 2017. Complex chromosomal neighborhood effects determine the adaptive potential of a gene under selection. eLife. 6, e25100. View Bergmiller T, Andersson AM, Tomasek K, Balleza E, Kiviet D, Hauschild R, Tkačik G, Guet CC. 2017. Biased partitioning of the multidrug efflux pump AcrAB TolC underlies long lived phenotypic heterogeneity. Science. 356(6335), 311–315. View View All Publications ReX-Link: Calin Guet Career Since 2018 Professor, Institute of Science and Technology Austria (ISTA)2011 – 2018 Assistant Professor, Institute of Science and Technology Austria (ISTA)2009 Postdoc, Harvard University, USA2005 – 2008 Postdoc, The University of Chicago, USA2004 PhD, Princeton University, USA Selected Distinctions 2017 ESPCI Chair, Paris2015 ETAPS EASST Best Paper Award2011 HFSP Young Investigator Grant2005 Yen Fellow, The University of Chicago Additional Information Download CVVisit Guet Group Website Back to Top We use cookies on our website. By clicking “Technically Necessary Cookies” no other cookies than cookies that are technically necessary to enable various functionalities of the website (e.g. provide access to the website, display of cookie banner) are enabled. However, you may go to \"Cookie Settings\" to provide a controlled consent.Read more...Cookie SettingsAccept AllTechnically Necessary CookiesManage cookies Close Privacy Overview This website uses cookies. Below you can provide individual consent regarding the use of cookies. Cookies under the category \"necessary\" are always enabled since they are technically necessary to access the website. You can find more information on the use of cookies in the data protection statement of ISTA Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website. CookieDurationDescriptioncookielawinfo-checkbox-analytics1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-necessary1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".CookieLawInfoConsent1 yearThis cookie only appears if you makes changes to the categories (e.g disable the category “Analytics”).pll_language1 yearThe ISTA website is a multilingual website, WordPress requires a default language to be selected and set by a cookie in order to display the website, which is recorded by the pll_language cookie by Polylang. Furthermore this cookie is also used to remember the language selected by the user when returning to the website.viewed_cookie_policy1 yearThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. CookieDurationDescription_pk_id*13 monthsMatomo tracking cookie stores a unique user id._pk_ses*13 monthsMatomo tracking cookie stores a unique session id. SAVE & ACCEPT Powered by",
  "content_length": 5961,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:24"
}