{
  "name": "Calton Pu",
  "homepage": "http://www.cc.gatech.edu/~calton",
  "status": "success",
  "content": "Calton Pu: Professor and John P. Imlay, Jr Chair in Software Dr. Calton Pu Professor and John P. Imlay, Jr. Chair in Software College of Computing, Georgia Tech Director, Center for Experimental Research in Computer Systems (CERCS) Ph.D., Computer Science & Engineering, U. Washington Office: KACB, room 3334 Address: Georgia Tech, 266 Ferst Dr, Atlanta, GA 30332-0765 USA Phone +1-404-385-1106 (Due to the COVID-19 new normal, please send email) Email: calton dot pu AT cc dot gatech dot edu Research Interests Calton's research interests are in the areas of service computing, distributed and cloud computing, dynamic analytics on changing big data. His current projects include cloud computing (WISE/Elba project) and dynamic analytics (GRAIT-DM project) research. Using experimental data from realistic benchmarks, the WISE project studies millibottlenecks, very short bottleneck phenomena that have large impact on n-tier application latency. The GRAIT-DM project continuously collect fake news on COVID-19 and other disasters to distinguish real information from fake news. The sponsors for Calton's research include both government funding agencies such as NSF, and companies from industry such as Fujitsu.  He is the director of Center for Experimental Research in Computer Systems (CERCS) at Georgia Tech.  He is also the director of RCN on Big Data for Smart Cities, managed as part of the GRAIT-DM project. Positions available: Georgia Tech is recruiting good graduate students. Current projects: WISE/Elba Project: Automated N-Tier Application Deployment GRAIT-DM Project: Global Research on Applying Information Technology for Disaster Management NORP Project: big data management and analytics for non-profit research. Past projects: Denial of Information project: Research on Deceptive and Misleading Information Infosphere project: System Software for Reliable Distributed Systems Continual Queries (CQ) project: WebCQ Page, and OpenCQ Page Teaching Calton has taught several courses in the areas of systems and databases. In fall, he is teaching CS4220/6235 Real-Time Embedded Systems In spring, he is teaching CS4365/6365 Introduction to Enterprise Computing. Please see detailed information on Oscar and Canvas. Publications See my project publication pages (above) or google scholar [https://scholar.google.com/citations?user=Vbv-JEwAAAAJ&hl=en]. Other Interesting Information Calton's calendar (weekly and travel). Very short bio. My PhD students.",
  "content_length": 2468,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:25"
}