{
  "name": "Cameron Edmond",
  "homepage": "https://uncannymachines.com",
  "status": "success",
  "content": "Resume | About Itch | Twitter | Email | Google Scholar Hello! You've reached Uncanny Machines, the home page of Dr Cameron Edmond. I'm a game developer, educator and writer interested in ways poetry, storytelling and game development intersect - both for entertainment and for education. Currently, I am a lecturer in Game Development at Macquarie University's School of Computing, working in a Teaching Leadership role. I also make short poetry games, bots and other weird interactive things! I've dropped some of my recent/favourite works below. Check them out, or hit me up if you'd like to collaborate! Verse(us) (2021) Poetry platforming action! An experimental, \"poetry platformer\" made for Narrative Driven Jam #3! This game combines my love of poetry and platforming, transforming concrete poetry into platforming stages. Format (2021) Format is a point-and-click inspired, retrofutrist murder mystery. You play as a detective bot, who has just enough memory to solve a crime. But can your databanks store too much? This short game features my first attempt at 2.5D graphics, and integrates a story written with Ink into Unity. The Caretaker (2020) A short, unconventional Christmas tale. You are the caretaker for one of the most exclusive lodgings around, with some of the strangest guests. Check in on a business-savy alien, an architectural obsessed vampire and more as you listen to their stories and try to help them, however you can. 3D World Generation through narration (2020) A project I got to be a part of at EPICentre involved creating a tool that allowed users to narrate a story and have a 3D world generate around them in response! The tool was developed predominently by my friend Dominic Branchaud, while I handled the narrative elements. We presented a prototype of this project as part of OzCHI '20. Platforms Don't Float (2020)Platforms Don't Float is a short \"platformer\" game made in Twine. How does that work? I'm still not entirely sure, or even if it does. But I had fun making it, and hope you have fun playing it, too! Citizens[] (2017) My submission to NaNoGenMo 2017! This program will generate potential citizens for one of the greatest countries the world has ever seen. There is a catch, though: once an applicant is successful, one of their characteristics will be taken on board as a requirement for citizenship. That said, there is always a way around these kind of things, and our glorious leaders might be a bit more fickle than we'd hope... Written in Python during November 2017, the submitted \"novel\" seeks 21 citizens for its nation, and generates 22,612 applications to do so. The code and novel are both avaliable from Github.",
  "content_length": 2678,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:24"
}