{
  "name": "Camil Demetrescu",
  "homepage": "http://www.diag.uniroma1.it/demetres",
  "status": "success",
  "content": "Camil Demetrescu Camil Demetrescu Professor Department of Computer, Control, and Management Engineering Sapienza University of Rome Via Ariosto 25, Rome - 2nd floor, room B220 Email: demetres@dis.uniroma1.it - Phone: +39-06-7727-4115 - RID: H-9904-2012 Bio Sketch Research Awards Publications Committees Events Grants Teaching Personal Bio Sketch I obtained my Ph.D. in Computer Engineering in 2001 from Sapienza University of Rome. I have been visiting scientist at the AT&T Research Laboratories (Florham Park, NJ, USA), joining the Networks Group, and at the Theory Group of the IT University of Copenhagen. I have been consultant at Microsoft Research - Silicon Valley. I am currently Associate Professor in Computer Science at Sapienza University of Rome. I am a glider aircraft pilot. Member of ACM SIGPLAN and of the Software Analysis and Optimization Laboratory. Research Interests My interests cover different aspects related to computer security, algorithmics, software engineering, and programming languages: Performance engineering of software systems Malicious software analysis Combinatorial algorithms and data structures Experimental algorithmics Awards OOPSLA 2011 Distinguished Paper Award, Annual ACM Conference on Object-Oriented Programming, Systems, Languages & Applications 2002 EATCS Italian Chapter Prize for the best two Ph.D. Theses in Theoretical Computer Science Publications Articles: A partial list of my published articles appears on the DBLP server. Books: Some of the books I have edited or coauthored are listed below: Committees Steering Committee Member 2010-2013: European Symposia on Algorithms (ESA) 2005-2008: Algorithm Engineering and Experiments (ALENEX) Committee Chair: ECOOP 201529th European Conference on Object-Oriented ProgrammingArtifact Evaluation Committee co-chair (with Matthew Flatt) ECOOP 201428th European Conference on Object-Oriented ProgrammingArtifact Evaluation Committee co-chair (with Erik Ernst) ESA 201119th Annual European Symposium on Algorithms - Engineering and Applications TrackProgram Committee chair WEA 20076th International Workshop on Experimental AlgorithmsProgram Committee chair ALENEX 20057th SIAM Workshop on Algorithm Engineering and ExperimentsProgram Committee co-chair (with Roberto Tamassia) Program Committee Member (selected) PLDI 201923th Conference on Programming Language Design and Implementation ECOOP 201630th European Conference on Object-Oriented Programming ALENEX 201517th Workshop on Algorithm Engineering and Experiments SEA 2014 13th International Symposium on Experimental Algorithms ALENEX 201113th Workshop on Algorithm Engineering and Experiments FCT 201118th Symposium on Fundamentals of Computation Theory HiPC 200815th International Conference on High Performance Computing ESA 200816th European Symposium on Algorithms SOFSEM 200733rd International Conference on Current Trends in Theory and Practice of Computer Science ICALP 200734th International Colloquium on Automata, Languages and Programming SODA 200718th ACM-SIAM Symposium on Discrete Algorithms ESA 200412th European Symposium on Algorithms, Design and Analysis Track ESA 200210th European Symposium on Algorithms Events Cyberchallenge.it 2018 Introductory training program in cybersecurity for talented high-school and undergraduate students (coordinator) ECOOP 2016 30th European Conference on Object-Oriented Programming (general chair) Dagstuhl Seminar 16111Rethinking Experimental Methods in Computing (co-organizer) ADS 20157th Bertinoro Workshop on Algorithms and Data Structures (co-organizer) SEA 2013 (co-organizer) 12th International Symposium on Experimental Algorithms ADS 20115th Bertinoro Workshop on Algorithms and Data Structures (co-organizer) Dagstuhl Seminar 11191Graph Drawing with Algorithm Engineering Methods (co-organizer) ADS 20073rd Bertinoro Workshop on Algorithms and Data Structures (co-organizer) WEA 2007 (general chair) 6th International Workshop on Experimental Algorithms 9th DIMACS Implementation ChallengeThe Shortest Path Problem (co-organizer) FOCS 200445th Annual IEEE Symposium on Foundations of Computer Science (general co-chair) ADS 20031st Bertinoro Workshop on Algorithms and Data Structures (co-organizer) Grants Amanda: Algorithmics for MAssive and Networked DAta - MIUR, PRIN 2012 AlgoDEEP: Algorithmic Challenges for Data-intensive Processing on Emerging Computing Platforms - MIUR, PRIN 2008 MainStream: Algorithms for Massive Information Structures and Data Streams - MIUR, PRIN 2006 Algo-Next: Algorithms for the Next Generation Internet and Web: Methodologies, Design and Applications - MIUR, PRIN 2004 Teaching Recent teaching activities: Fall 2018: Programmazione Funzionale e Parallela Spring 2018: Advanced Programming Fall 2017: Sistemi di Calcolo Spring 2015: Ingegneria degli Algoritmi Personal For further information, please refer to my former website. Bio Sketch | Research | Awards | Publications | Committees | Events | Grants | Teaching | Personal Copyright © 2013-2015 Camil Demetrescu | Based on dreamtemplate css | Last updated: October 4, 2018",
  "content_length": 5086,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:26"
}