{
  "name": "Camille Cobb",
  "homepage": "https://camillec.com",
  "status": "success",
  "content": "Camille Cobb About Students Publications Teaching Camille Cobb I am an Assistant Professor of Computer Science at the University of Illinois. Until July 2021, I was a postdoctoral researcher working with Lujo Bauer in the CyLab at Carnegie Mellon University. I earned my Phd in June 2019 from the University of Washington in Computer Science & Engineering. During my PhD, I was advised by Tadayoshi Kohno in the Security & Privacy Research Lab and Alexis Hiniker from the UW Information School. Research Interests My research focus in usable security and privacy. My work aims to ellucidate and address users' security and privacy concerns. In particular, I recognize that many perspectives have been historically left out of conversations about security and privacy, and I seek to correct for this through my work. For more details, see my CV. Other Interests Some of my non-research interests include: hanging out with my awesome dog; dancing (recently, on roller skates); playing soccer and softball; going to local sports games; knitting and other artistic endeavors. Students I am currently advising the following talented PhD students: Yi-Shyuan Chiang (UIUC CS PhD started Fall 2021) Yeeun Jo (UIUC CS PhD started Fall 2022, co-advised by Adam Bates Yuile) Matthew Makila (UIUC CS PhD started Fall 2024) Muawiz Khan (UIUC CS PhD started Fall 2024) I am also fortunate to work or have worked closely with these students: Omar Khan (UIUC CS PhD started Fall 2022) Ali Zaidi (UIUC CS PhD, advised by Karrie Karahalios and Indy Gupta) Mahnoor Jameel (UIUC CS PhD, advised by Adam Bates Yuile) Raima Mathew (UIUC CS MS, thesis advisee) Thea Surya (UIUC CS Undergraduate, CS STARS researcher) Aditi Shukla (UIUC CS Undergraduate, CS STARS researcher) Effie Karas (UIUC CS Undergraduate, CS STARS researcher, graduated 2023) Sailaja Nallacheruvu (UIUC CS Undergraduate, CS STARS researcher) Saloni Vaishnav (UIUC CS Undergraduate, CS STARS researcher) Mutma Adebayo (UIUC CS Undergraduate, CS STARS researcher) I've previously worked with many excellent undergrad and masters students at UW and CMU, incuding: Kentrell Owens Diva-Oriane Marty (CMU) Shrutika Ruhela (CMU) Alison Hoffman (CMU) Varun Rao (CMU) Anna Kawakami (Wellesley College) Clemend Zhong (UW) Kayla Butler (UW) Early in my PhD, I led a UW HCDE Directed Research Group with undergrad and masters students from UW HCDE and UW CSE rotating in and out of the team over several quarters: Aiko Lin Ankitha Bharadwaj Brian Do Eng Phannipha Janelle Van Hofwegen Jared Comis Joe Kohlmann Katlyn Edwards Tridiv Sardesai I have also mentored high school students in computer science competitions. Publications Yi-Shyuan Chiang, Omar Khan, Adam Bates Camille Cobb. More than just informed: The importance of consent facets in smart homes. CHI 2024. pdf Ali Zaidi, Rui Yang, Vinay Koshy, Camille Cobb, Indranil Gupta, Karrie Karahalios. A User-Centric Evaluation of Smart Home Resolution Approaches for Conflicts Between Routines. UbiComp / ISWC October 2023. pdf, 30 second teaser video Andrea Gallardo, Chris Choy, Jaideep Juneja, Efe Bozkir, Camille Cobb, Lujo Bauer, and Lorrie Faith Cranor. Speculative privacy attitudes and concerns about AR glasses data collection. PETS July 2023. pdf McKenna McCall, Eric Zeng, Faysal Hossain Shezan, Mitchell Yang, Lujo Bauer, Abhishek Bichhawat, Camille Cobb, Limin Jia, Yuan Tian. Towards usable security analysis tools for trigger-action programming. SOUPS August 2023. pdf and other presentation materials Camille Cobb, Sruti Bhagavatula, Kalil Anderson Garrett, Alison Hoffman, Varun Rao, Lujo Bauer. “I would have to evaluate their objections”: Privacy tensions between smart home device owners and incidental users. PETS July 2021. pdf, 18 min talk video Lucy Simko, Britnie Chin, Sungmin Na, Harkiran Kaur Saluja, Tian Qi Zhu, Tadayoshi Kohno, Alexis Hiniker, Jason Yip, Camille Cobb. Would You Rather: A Focus Group Method for Eliciting and Discussing Formative Design Insights with Children. ACM Interaction Design and Children (IDC) June 2021. pdf, 10 min talk video Tianshi Li, Camille Cobb, Jackie (Junrui) Yang, Sagar Baviskar, Yuvraj Agarwal, Beibei Li, Lujo Bauer, Jason I. Hong. What Makes People Install a COVID-19 Contact-Tracing App? Understanding the Influence of App Design and Individual Difference on Contact-Tracing App Adoption Intention. Special Issue ``IoT for Fighting COVID-19'' of Elsevier Pervasive and Mobile Computing (PMC) Journal August 2021. paper, arXiv preprint Kentrell Owens, Camille Cobb, Lorrie Cranor. ``You Gotta Watch What You Say'': Surveillance of Communication with Incarcerated People. CHI 2021, May 2021(to be held virtually). pdf, 5 min talk video Camille Cobb, Milijana Surbatovich, Anna Kawakami, Mahmood Sharif, Lujo Bauer, Anupam Das, Limin Jia. How Risky Are Real Users’ IFTTT Applets? SOUPS 2020, August 2020 (held virtually). pdf, 5 min talk video and slides, 14 min talk video Camille Cobb, Lucy Simko, Tadayoshi Kohno, Alexis Hiniker. A Privacy-Focused Systematic Analysis of Online Status Indicators. PETS 2020, July 2020 (held virtually). pdf, talk video Camille Cobb, Lucy Simko, Tadayoshi Kohno, Alexis Hiniker. User Experiences with Online Status Indicators. CHI 2020, April 2020. pdf Camille Cobb. User-to-User Privacy in Social and Communications Applications. Doctoral Dissertation. pdf Camille Cobb, Tadayoshi Kohno. How Public Is My Private Life? Privacy in Online Dating. WWW 2017, Perth, Australia, April 2017. pdf, survey instrument, presentation slides Camille Cobb*, Samuel Sudar*, Nicholas Reiter, Richard Anderson, Franziska Roesner, Tadayoshi Kohno. Computer Security for Data Collection Technologies. Development Engineering, Volume 3, 2018. Journal version of prior work presented at ICTD ’16. Camille Cobb*, Samuel Sudar*, Nicholas Reiter, Richard Anderson, Franziska Roesner, Tadayoshi Kohno. Computer Security for Data Collection Technologies. ICTD 2016, Ann Arbor, MI, June 2016. pdf Camille Cobb, Ted McCarthy, Annuska Perkins, Ankitha Bharadwaj, Jared Comis, Brian Do, Kate Starbird. Designing for the deluge: understanding & supporting the distributed, collaborative work of crisis volunteers. CSCW 2014, Baltimore, MD, February 2014. pdf Sara Sprenkle, Camille Cobb, Lori Pollock. Leveraging user-privilege classification to customize usage-based statistical models of web applications. ICST 2012, Montreal, Canada, April 2012. * Denotes equal contributions, listed in alphabetical order. Full list of publications on Google Scholar. Teaching Fall 2021 CS598CAC Inclusive Cybersecurity and PrivacySchedule",
  "content_length": 6592,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:24"
}