{
  "name": "Cancan Wang",
  "homepage": "https://pure.itu.dk/portal/en/persons/cancan-wang(605b59ab-91b4-4f8e-bb12-df68ce0491c5).html",
  "status": "success",
  "content": "Cancan Wang - IT-University of Copenhagen Cancan Wang Associate Professor, Digitalization, Democracy, and GovernanceREFLACTCenter for Climate IT https://orcid.org/0000-0002-9065-6884 Emailcawaitudk 20152025 Research activity per year Personal profile KeywordsIT GovernancePrivate SectorPublic SectorSustainability TransitionDataDigital TransformationEnterpreneurshipRegulationsESG DataSustainability Data CommonsOpen Data CommonsPolitical Economy of Data and Automation Fingerprint Dive into the research topics where Cancan Wang is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles e-government Computer Science 100% Adaptive Governance Keyphrases 76% Electronic Government Keyphrases 75% China Social Sciences 68% Information System Computer Science 60% Information Systems Social Sciences 56% Data Governance Computer Science 55% Case Study Computer Science 52% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2015 2015 2016 2020 2021 2022 2024 2025 12 Journal article 9 Book chapter 4 Conference abstract for conference 3 Paper 11 More 2 Book 2 Article in proceedings 2 Net publication - Internet publication 1 Anthology 1 Contribution to newspaper - Newspaper article 1 Literature review 1 Other contribution 1 PhD thesis Research output per year Research output per year Data/Logics/China: 6 Conversations on Becoming Green: 数据, 逻辑, 中国 六场关于绿⾊转型的对话Douglas-Jones, R. (Editor) & Wang, C. (Editor), 2025, Copenhagen: RSS Press. 133 p.Research output: Book / Anthology / Report › Book › Research Open AccessFile Outsourcing response-ability: Tales from ‘agile’ governancePapazu, I., Wang, C., Perriam, J. & Marttila, S.-M., Aug 2025, Digitalization, Data and Welfare. Galis, V. & Vlassis, V.-S. (eds.). Edward Elgar Publishing, p. 74-91 Research output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research › peer-review Open Access Action Research BookletWang, C. (Editor), Juncker-Jensen, L. (Editor), Wang, C., Østerlund, C. S., Nicolajsen, H. W., Christensen, L. R., Juncker-Jensen, L., Nielsen, L., Marttila, S.-M., Finken, S., Jiang, Q., Baka, V., Guo, V. & Dittrich, Y., May 2024, 1 ed. Copenhagen: Really Simple Syndication Press. 114 p.Research output: Book / Anthology / Report › Anthology › Research › peer-review Open AccessFile Action Research 100% Digital Technology 66% Intervention Research 66% Digitization 66% Organizational Context 33% Introduction: Action Research in a World of Crises and CareWang, C. & Nicolajsen, H. W., 2024, Action Research Booklet. Wang, C. & Juncker-Jensen, L. (eds.). 1st ed. Copenhagen: RSS Press, p. 1-13 13 p.Research output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research › peer-review Open Access One data state, two data logics: Unfolding China's data governanceWang, C. & Liu, C., 2024, Digitalization in Practice: Intersections, Implications and Interventions. Perriam, J. & Kjær, K. M. (eds.). Berlin/Boston: De Gruyter, Vol. 14. p. 29 52 p.Research output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research › peer-review Open AccessFile China 100% Data Governance 100% One Data 100% Data State 100% Public Sector 100% View all 39 research outputs Projects Projects per year 2022 2022 2023 2024 2025 2027 2 Active 3 Finished Projects per year GreenITSME: Green IT Research for Impact and Sustainability: Explore A Service-Oriented ModelWang, C. (PI), Ibsen, P. (Admin), Jiang, Q. (CoI), Dittrich, Y. (CoI) & Østerlund, C. S. (CoI)01/08/2025 → 30/05/2026Project: Innovation Sustainable IT 100% High-tech SMEs 100% IT Research 100% Green IT 100% Service-oriented 100% CARE: Collaborative Analytics for Reporting ESG (CARE) in FintechWang, C. (PI), Oppermann, N. (Admin), Ibsen, P. (Admin), Dittrich, Y. (CoI) & Jiang, Q. (CoI)Copenhagen Fintech01/01/2022 → 31/12/2022Project: Innovation Fintech 100% Collaborative Analytics 100% Corporate Governance 50% Environmental Social Governance 50% Environmental, Social and Corporate Governance 50% Integrated Data for ESG Analytics (IDEA) for FintechWang, C. (PI), Oppermann, N. (Admin), Ibsen, P. (Admin), Dittrich, Y. (CoI) & Jiang, Q. (CoI)Copenhagen Fintech01/02/2023 → 31/12/2023Project: Research Fintech 100% Data Integration 50% Corporate Governance 50% Environmental Social Governance 50% Data Infrastructure 50% DecouplingIT: A Global Comparative Ethnography of the Role of IT in the Mitigation of the Climate CrisisDalsgaard, S. (PI), Wang, C. (CoI), Ahsan, H. (CoI), Maguire, J. (CoI), Santos da Costa, P. (CoI), Hansen, C. B. N. (CoI), Figueiredo, F. S. (CoI) & Guo, V. (CoI)European Commission01/11/2022 → 31/10/2027Project: Research Climate Crisis 100% IT Role 100% Climate Change 100% Private Sector 100% IT Professionals 100% Development of Education on ESG Data governance in Fintech startup (DEED-Fintech)Oppermann, N. (Admin), Wang, C. (PI), Dittrich, Y. (CoI) & Jiang, Q. (CoI)15/02/2024 → 31/12/2024Project: Education Environmental Social Governance 100% Fintech Startups 100% Education Development 100% Data Governance 100% Corporate Governance 100% Press/Media Dagens citatPapazu, I. & Wang, C.13/02/20251 Media contributionPress/Media: Press / Media Kronik: Hvad er formålet med Danmarks digitaliseringsmani?Papazu, I. & Wang, C.12/02/20251 Media contributionPress/Media: Press / Media MitID-partnerskab til forskere: Vi serverer ikke danskernes persondata til techgiganterneWang, C. & Papazu, I.02/05/20241 Media contributionPress/Media: Press / Media Forskere: Hvem råder over danskernes persondata i techgiganternes tidsalder?Papazu, I. & Wang, C.24/04/20241 Media contributionPress/Media: Press / Media De små fintech-virksomheder skal op på den grønne bølgeWang, C.03/05/20231 Media contributionPress/Media: Press / Media Prizes Kauffman Best Paper Award Runner UpWang, C. (Recipient), Østerlund , C. (Recipient), Jiang, Q. (Recipient) & Dittrich, Y. (Recipient), 2022Prize: Prizes, scholarships, distinctions International Conference 100% Best Paper Award 100% Information System 100% Activities Activities per year 2019 2019 2022 2023 2023 14 Peer review of manuscripts 4 Organisation and participation in workshop, seminar, course 3 Organisation and participation in conference 3 Lecture and oral contribution 2 More 1 Editor of Series 1 Membership in review committee Activities per year 1st Conference on Sustainability and DataWang, C. (Conference Chair)12 Sept 2023Activity: Participating in or organising an event types › Organisation and participation in conference Automating sustainability: Challenges in Data Collection and EcosystemWang, C. (Speaker)5 Sept 2023Activity: Talk or presentation types › Lecture and oral contribution CDW Global Comparisons Masterclass on The Global Concept of IT GovernanceWang, C. (Conference Chair)16 Nov 2023Activity: Participating in or organising an event types › Organisation and participation in workshop, seminar, course Curator (Journal)Wang, C. (Reviewer)2020Activity: Publication peer-review and editorial work types › Peer review of manuscripts › Research Data LogicsDouglas-Jones, R. (Workshop Chair), Wang, C. (Workshop Chair) & Liu, C. (Workshop Chair)11 Oct 2022Activity: Participating in or organising an event types › Organisation and participation in workshop, seminar, course View all 26 activities",
  "content_length": 7734,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:28"
}