{
  "name": "Cara MacNish",
  "homepage": "http://www.web.uwa.edu.au/people/cara.macnish",
  "status": "success",
  "content": "The University of Western Australia - Seek wisdom with a leading university for employability Begin your life-changing career journey at UWAApply through TISC and choose UWA as your first preference.Apply now You may be interested in Early Offers for 2026 Apply for semester 1, 2026 Discover what's on at UWA Our university rankings Setting you up for success Ranked in the world's Top 100 universities (77th in QS, 2025) Over 1500 active scholarships awarded to UWA students (StaffConnect report SCH0010, 2024) 13 subjects in the world's top 50 (QS 2025 and GRAS 2024) Study options International students Set yourself apart with a globally recognised degree from a world top 100 university. International students Information for agents Undergraduate Seeking your first university degree? Whatever career you seek, you’ll find a course that fits. Undergraduate Postgraduate Whether you're looking to develop your skills or change jobs completely, a postgraduate degree will take your career to the next level. Postgraduate coursework Higher degree by research Indigenous studentsBe a part of the story of Indigenous education and success at UWA. Welcome to our Bilya Marlee community.Indigenous study opportunitiesScholarships Life experience mattersTurn your life experience into something life-changing with our Experience-based entry pathway. Find out more OUR STUDENTS Words of wisdom Hear advice from #UWAStudents about making the most of life at uni. Seek wisdom \"Join a club to make lifelong friends and memories\" Anders, Engineering and Computer Science student \"Do what you love\" Nicole, Political Science and International Relations, and Marketing student \"Volunteer to enhance your job prospects\" Chandini, Finance and Marketing student Our impact View all news Please wait, loading... X Cookies help us improve your website experience. By using our website, you agree to our use of cookies. Confirm",
  "content_length": 1912,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:30"
}