{
  "name": "Carey E. Priebe",
  "homepage": "http://www.ams.jhu.edu/~priebe",
  "status": "success",
  "content": "Carey E. Priebe https://www.ams.jhu.edu/~priebe Carey E. Priebe cep@jhu.edu cv , short cv , bio , links to refereed journal publications Professor Department of Applied Mathematics and Statistics Whiting School of Engineering Johns Hopkins University Baltimore, MD 21218-2682 Johns Hopkins University Center for Imaging Science Johns Hopkins University Mathematical Institute for Data Science Johns Hopkins University Human Language Technology Center of Excellence Johns Hopkins University Department of Electrical and Computer Engineering Johns Hopkins University Department of Computer Science Johns Hopkins University Department of Biomedical Engineering * Fall 2021: Statistical Theory (553.730) Connecting the Dots Spring 2019: Heilbronn Distinguished Visitor in Data Science HUB ; Nature 2017 CY 2016: spring = The Alan Turing Institute ; fall = The Isaac Newton Institute 2014 NSF BRAIN EAGER: Discovery and characterization of neural circuitry from behavior, connectivity patterns and activity patterns NSF HUB Mapping poster Carey E. Priebe named 2013 Erskine Fellow ... Carey E. Priebe named recipient of 2011 McDonald Award for Excellence in Mentoring and Advising Carey E. Priebe named recipient of 2010 ASA SDNS Distinguished Achievement Award Carey E. Priebe named 2009 Erskine Fellow ... Carey E. Priebe named 2008 National Security Science and Engineering Faculty Fellow: Fusion and Inference from Multiple and Massive Disparate Data Sources •NSSEFF Press Release •Washington Post •Baltimore Sun •abstract (pdf) Carey E. Priebe named recipient of 2008 Pond Award for Excellence in Teaching Research Interests: • computational statistics, kernel and mixture estimates, statistical pattern recognition, statistical image analysis, dimensionality reduction, model selection, • statistical inference for high-dimensional and graph data. •Upcoming Conferences & Workshops •Current & Former Graduate Students",
  "content_length": 1918,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:33"
}