{
  "name": "Carey L. Williamson",
  "homepage": "http://www.cpsc.ucalgary.ca/~carey",
  "status": "success",
  "content": "Carey Williamson's Home Page Professor Carey Williamson Department of Computer Science University of Calgary 2500 University Drive NW Calgary, AB, Canada T2N 1N4 Phone: (403) 220-6780 Fax: (403) 284-4707 Email: carey at cpsc.ucalgary.ca I am a (retired) Professor Emeritus in the Department of Computer Science at the University of Calgary in Calgary, Alberta, Canada. Winter 2022 was my final semester of teaching. I retired on June 30, 2022. That is why I look so happy now! My research interests include the measurement, analysis, and evaluation of networked systems, such as the Internet, the World Wide Web, and mobile/wireless networks. During my time in the department, I was part of the Networks Research Group. I was on a 12-month Research and Scholarship Leave (i.e., sabbatical) throughout the 2020-2021 academic year, with no teaching or assigned duties. International travel for research collaborations was not possible during the lockdown, so I spent most of my time in Calgary, with a good part of it on Zoom. In Nov-Dec 2019, I was a Visiting Professor at Università Ca' Foscari in Venice, Italy. In October 2019, Tim Brecht (U. of Waterloo) and I hosted ACM SOSP 2019 at Deerhurst Resort in Huntsville, ON, Canada. Here is what a big conference chair looks like! From July 2010 to June 2016, I served as Head for the Department of Computer Science. From 2006-2011, I held an iCORE (Informatics Circle of Research Excellence) Chair in Broadband Wireless Networks, Protocols, Applications, and Performance. Prior to that, I held an iCORE Professorship in Broadband Wireless Networks (2001-2006), as well as an NSERC Industrial Research Chair in Wireless Internet Traffic Modeling (2004-2009). I was General Co-Chair for WWW2007 in Banff in May 2007. Here is a photo of us having fun at the WWW2007 banquet! From 1991-2001, I was a faculty member in the Department of Computer Science at the University of Saskatchewan in Saskatoon, Saskatchewan, Canada. Last Updated August 2022",
  "content_length": 1993,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:36"
}