{
  "name": "Carlos Hitoshi Morimoto",
  "homepage": "http://www.ime.usp.br/~hitoshi",
  "status": "success",
  "content": "Carlos Hitoshi Morimoto Department of Computer Science - IME - USP Carlos Hitoshi Morimoto Associate Professor Departamento de Ciência da Computação Instituto de Matemática e Estatística (IME) Universidade de São Paulo (USP) Contact Information: IME-USP, sala 209, bloco C Rua do Matão 1010, Cidade Universitária 05508-090 São Paulo, SP -- Brazil +55-11-3091-6499 (phone) +55-11-3091-6134 (fax) hitoshi @ ime . usp . br | Google Scholar | Lattes | Projects | Publications | Students & Collaborators | Informações para alunas e alunos Apostilas e Livros disponíveis Online Introdução à Computação com C por Carlos H. Morimoto e Ronaldo F. Hashimoto Introdução à Computação com Python [versão interativa] por José Augusto Soares, José Coelho de Pinha Jr. e Carlos H. Morimoto versão Aula dirigida com 24 aulas. Princípios de Desenvolvimento de Algoritmos [versão interativa] por José Coelho de Pina Jr. e Carlos H. Morimoto Introdução à Computação Gráfica com WebGL [versão interativa] por Carlos H. Morimoto. Baseada nas notas de aula de Dave Mount. Traduções de livros disponíveis online Como pensar como um cientista da computação - aprendendo com Python [versão interativa] por Brad Miller e David Ranum traduzido por: C. H. Morimoto, J. C. de Pina Jr. e J. A. Soares Resolução de Problemas com Algoritmos e Estruturas de Dados usando Python [versão interativa] por Brad Miller e David Ranum traduzido por Andrew Toshiaki Nakayama Kurauchi, Carlos Eduardo Leão Elmadjian, Carlos H. Morimoto e José Coelho de Pina Jr. Disciplinas ministradas nos últimos anos [2023/S2] MAC0122 - Princípios de Desenvolvimento de Algoritmos [2023/S2] MAC0446/MAC5786 - Princípios de Interação Humano Computador [2023/S1] MAC0420/MAC5744 - Introdução à Computação Gráfica [2022/S2] MAC0122 - Princípios de Desenvolvimento de Algoritmos [2022/S2] MAC0446/MAC5786 - Princípios de Interação Humano Computador [2022/S1] MAC0420/MAC5744 - Introdução à Computação Gráfica [2021/S2] MAC0122 - Princípios de Desenvolvimento de Algoritmos [2021/S2] MAC0446/MAC5786 - Princípios de Interação Humano Computador [2021/S1] MAC0420/MAC5744 - Introdução à Computação Gráfica [2021/S1] MAC0110 - Introdução à Computação",
  "content_length": 2185,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:05"
}