{
  "name": "Carlos Cid",
  "homepage": "https://www.simula.no/people/carlos",
  "status": "success",
  "content": "Carlos CidAboutToggle About navigationOrganisationLeadershipSimula CultureSimula AwardsMilestonesPeopleNewsResearchToggle Research navigationResearch AreasResearch DepartmentsPublicationsContract researchOpen science at SimulaProjectsEducationToggle Education navigationSimula AcademyCourses & summer schoolsMaster's studentsPhD candidatesResearcher trainingResearch exchangesInnovationToggle Innovation navigationSimula InnovationCareersToggle Careers navigationSummer internshipsProfessional developmentJob openingsServicesToggle Services navigationApplied AIPeopleCarlos CidCarlos CidProfessorDirector of Simula UiBDepartmentAdministration and ManagementOrganisationSimula UiBResearch Interestscryptography & cryptanalysis quantum cyber security secure computationEmailcarlos@simula.noWebwww.carloscid.eu/Publications2024Journal ArticlesRead Experimental Integration of Quantum Key Distribution and Post-Quantum Cryptography in a Hybrid Quantum-Safe CryptosystemL. Garms, T. K. Paraïso, N. Hanley, A. Khalid, C. Rafferty, J. Grant, J. Newman, A. J. Shields, C. Cid and M. O’NeillExperimental Integration of Quantum Key Distribution and Post-Quantum Cryptography in a Hybrid Quantum-Safe CryptosystemAdvanced Quantum Technologies2023Proceedings, refereedRead Verifying Classic McEliece: Examining the Role of Formal Methods in Post-Quantum Cryptography StandardisationM. Brain, C. Cid, R. Player and W. RobsonVerifying Classic McEliece: Examining the Role of Formal Methods in Post-Quantum Cryptography StandardisationCode-Based Cryptography. CBCrypto 2022. Lecture Notes in Computer Science2022Journal ArticlesRead Influence of the Linear Layer on the Algebraic Degree in SP-NetworksC. Cid, L. Grassi, A. Gunsing, R. Lüftenegger, C. Rechberger and M. SchofneggerInfluence of the Linear Layer on the Algebraic Degree in SP-NetworksIACR Transactions on Symmetric CryptologyProceedings, refereedRead FASTA – a stream cipher for fast FHE evaluationC. Cid, J. P. Indrøy and H. RaddumFASTA – a stream cipher for fast FHE evaluationTopics in Cryptology - CT-RSA 2022 - Cryptographers' Track at the RSA Conference 20222021Proceedings, refereedRead A Comparison of GKE Protocols based on SIDHH. Okada, S. Kiyomoto and C. CidA Comparison of GKE Protocols based on SIDHProceedings of the 18th International Conference on Security and Cryptography, SECRYPT 2021, July 6-8, 2021Read Partition Oracles from Weak Key ForgeriesM. Armour and C. CidPartition Oracles from Weak Key ForgeriesCryptology and Network Security - 20th International Conference, CANS 2021, Vienna, Austria, December 13-15, 2021, Proceedings2020Proceedings, refereedRead Integerwise Functional Bootstrapping on TFHEH. Okada, S. Kiyomoto and C. CidIntegerwise Functional Bootstrapping on TFHEInformation Security - 23rd International Conference, {ISC} 2020, Bali, Indonesia, December 16-18, 2020, ProceedingsRead Quantum Cryptanalysis on Contracting Feistel Structures and Observation on Related-Key SettingsC. Cid, A. Hosoyamada, Y. Liu and S. M. SimQuantum Cryptanalysis on Contracting Feistel Structures and Observation on Related-Key SettingsProgress in Cryptology - INDOCRYPT 2020 - 21st International Conference on Cryptology in India, Bangalore, India, December 13-16, 2020, ProceedingsRead Cryptanalysis of the Multivariate Encryption Scheme EFLASHM. Øygarden, P. Felke, H. Raddum and C. CidCryptanalysis of the Multivariate Encryption Scheme EFLASHRSA Conference Cryptographers' Track 20202019Proceedings, refereedRead Algebraic Cryptanalysis of STARK-Friendly Designs: Application to MARVELlous and MiMCM. R. Albrecht, C. Cid, L. Grassi, D. Khovratovich, R. Lüftenegger, C. Rechberger and M. SchofneggerAlgebraic Cryptanalysis of STARK-Friendly Designs: Application to MARVELlous and MiMCAdvances in Cryptology - {ASIACRYPT} 2019 - 25th International Conference on the Theory and Application of Cryptology and Information Security, Kobe, Japan, December 8-12, 2019, Proceedings, Part {III2007Proceedings, refereedRead An Analysis of the Hermes8 Stream CiphersS. Babbage, C. Cid, N. Pramstaller and H. RaddumAn Analysis of the Hermes8 Stream Ciphers12th Australasian Conference on Information Security and Privacy, ACISP 2007",
  "content_length": 4193,
  "method": "requests",
  "crawl_time": "2025-12-01 12:48:59"
}