{
  "name": "Carlos A. Varela",
  "homepage": "http://www.cs.rpi.edu/~cvarela",
  "status": "success",
  "content": "Carlos A. Varela's Home Page Worldwide Computing Lab Carlos A. Varela Research Vision Selected Publications Open Source Software Awards Carlos A. Varela Professor, Department of Computer Science Founding Director, Worldwide Computing Laboratory Rensselaer Polytechnic Institute, 110 8th Street, Troy, NY 12180, USA cvarela AT cs DOT rpi DOT edu Ph: +1 (518) 276-6912, Fax: +1 (518) 276-4033, Office: Lally 308. Short Bio Dr. Carlos A. Varela is Professor of Computer Science and Founding Director of the Worldwide Computing Laboratory at Rensselaer Polytechnic Institute. He is Associate Editor of the ACM Computing Surveys, the IEEE Transactions on Cloud Computing, and the IEEE Internet of Things Journal. He has authored the book \"Programming Distributed Computing Systems: A Foundational Approach\" (MIT Press, 2013). He was the General Chair for CCGrid 2016. He is PC Co-Chair for the InfoSymbiotics/Dynamic Data Driven Applications Systems (DDDAS2022) conference and was the PC Chair for the 2020 IEEE/ACM International Conference on Cluster, Cloud, and Internet Computing (CCGrid 2020), the 2011 IEEE/ACM International Conference on Cluster, Cloud, and Grid Computing (CCGrid 2011), the 2012 IEEE/ACM International Conference on Utility and Cloud Computing (UCC 2012,) and the ACM AGERE! Workshop on Programming based on Actors, Agents and Decentralized Control at SPLASH 2014 and 2015. Dr. Varela has given over 80 invited talks, including 12 plenary lectures on his research at international and national venues. He has been a member of over 100 conference and workshop Program Committees. He has supervised seven Ph.D. students and 19 M.S. students. He and his students have received Best Paper awards at HPDC-GECO'2006, eScience'2007, CCGrid'2007, CLEI'2010, CCGrid'2016, and DASC'2019. He is also a recipient of the NSF CAREER Award, and industry awards from IBM, Google, Amazon, and PSEG. His research has been supported by the National Science Foundation and the Air Force Office of Scientific Research. Dr. Varela is also an instrument-rated private pilot with over 1100 hours of flight experience, including cross-country trips from NY to CA, IL, TX, and FL. His current research interests include safer flight systems, software verification, cloud and edge computing, middleware for adaptive distributed systems, and concurrent programming models and languages. Dr. Varela received his B.S with honors, M.S., and Ph.D. degrees in Computer Science, all from the University of Illinois at Urbana-Champaign. For more information on Prof. Varela's group's research, please visit the Worldwide Computing Lab page.",
  "content_length": 2624,
  "method": "requests",
  "crawl_time": "2025-12-01 12:48:54"
}