{
  "name": "Carlos Teixeira",
  "homepage": "https://ciencias.ulisboa.pt/perfil/cjteixeira",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo Contactos Departamento de Informática Sala/Gabinete 6.3.44 Ext. Principal 26375 Telefone Direto 21700345 Email cjteixeira@ciencias.ulisboa.pt Página Pessoal Carreira Docente Universitário Categoria Professor Auxiliar Indicadores ResearcherID Orcid Google Scholar Currículo Resumido 2012 - Today, DI/FC/UL Library responsible. Supervision of the migration of all digital DI/FC/UL collections to the UL digital repository in the “Repositório Científico de Acesso Aberto de Portugal” RCAAP.2004 - Today, Assistant Professor of DI/FC/UL.2010 - 2015, Researcher of the national project PTDC/MAR/118767/2010 “Role Of Acoustic Signals In Mate Choice And Male-Male Assessment In A Strongly-Vocal Fish, Halobatrachus Didactylus”.2013 - 2014, FC/UL consultant team leader of the integration of national oncological databases and data warehouses. Supported by the National Program for Oncological Diseases.2011 - 2013, FC/UL team leader of the World Search QREN/COMPETE project – graphically advanced information search.2010 - 2014, Responsible for all Information Systems disciplines from a FC/UL/DI graduation course (LEI-PL).2005 - 2011, Researcher of the Large-Scale Informatics Systems Laboratory.1989 - 2005, Researcher of the Instituto de Engenharia de Sistemas e Computadores (INESC).2002 - 2004, Member of the executive commission of the L2F Laboratory / INESC-ID.1999 - 2004, Assistant Professor of the “Instituto Superior Técnico” / University of Lisbon (IST/UTL).1999 - 2002, Portuguese delegate of the Information Systems Technology NATO Panel TG-0011999 - 2001, Consultant auditing Philips Speech Technology for the Automatic directory assistant service - Portuguese Telecom project.2000, International Fellow of SRI International, Menlo Park (CA).1999, PhD IST/UL degree in Electrical Engineering and Computer Science.1984 - 1999, Research Assistant of IST/UL.1991 - 1992, Researcher (PhD Calouste Gulbenkian Foundation Scholarship) of the Speech Technology Center, University of Aalborg, Denmark.1989, MSc IST/UL degree in Electrical Engineering and Computer Science.1985 -1989, Researcher of the “Centro de Análise e Processamento de Sinais” (CAPS/IST).1984, Telecommunications Engineer of EDP - Portuguese electrical power company.1984, IST/UL Graduation in Electrical Engineering, Telecommunications and Computer Science.1979-1980, IBM System/370 and Cobol courses – supported by Petrogal. Interesses Científicos Análise e design de sistemas de informação;Usabilidade e experiência de utilização;Processamento de sinais;Aprendizagem de línguas assistida por computador;Processamento de fala multilingue;Análise de prosódia;Recuperação de informações multimédia;E-saúde;Mobilidade sustentável; Scientific Interests Information Systems Analysis and Design;Usability and User Experience;Signal processing;Computer Assisted Language Learning;Multilingual speech processing;Prosody analysis;Multimedia information retrieval;E-Health;Sustainable Mobility; Publicações selecionadas Manuel Vieira, Paulo J. Fonseca, M. Clara P. Amorim, and Carlos J. C. Teixeira. Call recognition and individual identification of fish vocalizations based on automatic speech recognition: An example with the lusitanian toadfish. The Journal of the Acoustical Society of America, 138(6):3941-3950, December 2015. Carlos J. C. Teixeira, Bernardo Santos, and Ana Respício. Usability testing tools for web graphical interfaces. Informatica, 37(4):435-441, December 2013. Carlos J. C. Teixeira. Multimedia enriched digital books. In BooksOnline'08, Workshop on Setting the Roadmap for Research Advances in Large Digital Book Repositories. ACM 17th Conference on Information and Knowledge Management, October 2008. Carlos J. C. Teixeira, Horacio Franco, Elizabeth Shriberg, Kristin Precoda, and Kemal Sömnez. Evaluation of speaker's degree of nativeness using text-independent prosodic features. In Workshop on Multilingual Speech and Language Processing, September 2001. Carlos J. C. Teixeira, Isabel M. Trancoso, and António J. Serralheiro. Accent identification. In Proc. Int. Conf. on Spoken Language Processing, Philadelphia, USA, November 1996. Ver todas as Publicações",
  "content_length": 4312,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:15"
}