{
  "name": "Carla Pedro Gomes",
  "homepage": "http://www.cs.cornell.edu/gomes",
  "status": "success",
  "content": "Carla P. Gomes Skip to main content Search Cornell menu Home News Research Publications Presentations UDiscoverIt Courses Grants Carla P. Gomes gomes at cs.cornell.edu Professor and Director Cornell University AI for Science Institute Institute for Computational Sustainability CompSustNet NEW! Postdoc Openings Postdoc openings posted January 13, 2023 Cornell University AI for Science Institute (CUAISci) CUAISci website Schmidt AI in Science Postdocs Cornell joins Schmidt AI in Science postdoc research initiative Computational Sustainability Network (CompSustNet) CompSustNet CompSustNet website NSF Expeditions in Computing Award: CompSustNet: Expanding the Horizons of Computational Sustainability (2016) Cornell Institute for Computational Sustainability (ICS) ICS website NSF Science News — cool video! NSF Expeditions in Computing Award: Computational Methods for a Sustainable Environment, Economy, and Society (2008) Home I am the Ronald C. and Antonia V. Nielsen Professor of Computing and Information Science, the director of the Institute for Computational Sustainability at Cornell University, and co-director of the Cornell University AI for Science Institute. My research area is Artificial Intelligence with a focus on large-scale constraint-based reasoning, optimization, and machine learning. Recently, I have become deeply immersed in the establishment of the new field of Computational Sustainability and in AI for Science. Computational Sustainability is a new interdisciplinary research field, with the overarching goal of studying and providing solutions to computational problems for balancing environmental, economic, and societal needs for a sustainable future. Such problems are unique in scale, impact, complexity, and richness, often involving combinatorial decisions, in highly dynamic and uncertain environments, offering challenges but also opportunities for the advancement of the state-of-the-art of computer and information science. Work in Computational Sustainability integrates in a unique way various areas within computer science and applied mathematics, such as constraint reasoning, optimization, machine learning, and dynamical systems. Concrete examples of computational sustainability challenges range from planning and optimization for wildlife preservation and biodiversity conservation, to poverty mapping, to combining (deep) data-intensive learning with inference, reasoning, and optimization to accelerate the discovery of new renewable materials such as solar fuels. DRNets Deep Reasoning Networks overview video from a Cornell Chronicle article Computational Sustainability CompSustNet overview video, Computational Sustainability: Computing for a Better World 2021 ACM–AAAI Allen Newell Award Carla Gomes receives the 2021 ACM–AAAI Allen Newell Award Subway Lines: Computational Themes and Project Interactions Bio Carla Gomes is the Ronald C. and Antonia V. Nielsen Professor of Computing and Information Science, the director of the Institute for Computational Sustainability at Cornell University, and co-director of the Cornell University AI for Science Institute. Gomes received a Ph.D. in computer science in artificial intelligence from the University of Edinburgh. Her research area is Artificial Intelligence with a focus on large-scale constraint reasoning, optimization, and machine learning. Recently, Gomes has become deeply immersed in research on scientific discovery for a sustainable future and, more generally, in research in the new field of Computational Sustainability. Computational Sustainability aims to develop computational methods to help solve some of the key environmental, economic, and societal challenges to help put us on a path toward a sustainable future. Gomes was the lead PI of two NSF Expeditions in Computing awards. Gomes has (co-)authored over 200 publications, which have appeared in venues spanning Nature, Science, and a variety of conferences and journals in AI and Computer Science, including several best paper awards. Gomes was named the “most influential Cornell professor” by a Merrill Presidential Scholar (2020). Gomes was also the recipient of the Association for the Advancement of Artificial Intelligence (AAAI) Feigenbaum Prize (2021) for “high-impact contributions to the field of artificial intelligence, through innovations in constraint reasoning, optimization, the integration of reasoning and learning, and through founding the field of Computational Sustainability, with impactful applications in ecology, species conservation, environmental sustainability, and materials discovery for energy” and of the 2022 ACM/AAAI Allen Newell Award, for contributions bridging computer science and other disciplines. Gomes is a Schmidt AI2050 Senior Fellow, a Fellow of the Association for the Advancement of Artificial Intelligence (AAAI), a Fellow of the Association for Computing Machinery (ACM), and a Fellow of the American Association for the Advancement of Science (AAAS). For more details, please see my CV. Contact Information Dept. Computer Science 479 CIS Building Cornell University Ithaca, NY 14853 USA Faculty of Computing and Information Science Dept. Information Science Dyson School of Applied Economics and Management 607-255-9189 (voice); 607-255-4428 (fax) gomes at cs.cornell.edu http://www.cs.cornell.edu/gomes Cornell University ©2016",
  "content_length": 5367,
  "method": "requests",
  "crawl_time": "2025-12-01 12:48:46"
}