{
  "name": "Carlo Lucibello",
  "homepage": "http://faculty.unibocconi.eu/carlolucibello",
  "status": "success",
  "content": "CARLO LUCIBELLO - Universita' Bocconi Apply Discover Programs Browse News and Events Login Close menu Faculty Close Contact Us CARLO LUCIBELLO Open share Close Share Close Associate Professor Department of Computing Sciences carlo.lucibello@unibocconi.it my personal page Download the cv Courses a.y. 2025/2026 20883 COMPLEX SYSTEMS AND PHYSICAL MODELS 21013 ARTIFICIAL INTELLIGENCE - MODULE 1 30592 TOPICS IN COMPUTATIONAL MODELLING: FROM INFORMATION THEORY TO EVOLUTIONARY MODELS 41001 MODERN APPLIED MACHINE LEARNING Courses previous a.y. I’m currently teaching Python programming courses at the Bachelor and MSc level, and Machine Learning courses at the Bachelor and PhD level. Biographical note I am an Assistant Professor of Computer Science at Bocconi University. I earned my PhD in Physics in 2015 from Sapienza University, under the supervision of Giorgio Parisi and Federico Ricci-Tersenghi. My research leverages analytical methods from statistical physics to deepen the theoretical understanding of machine learning and neural networks. I develop efficient, physics-inspired algorithms for learning, optimization, and inference. Research interestsNeural Networks, Machine Learning, Statistical Inference, Disordered Systems, Statistical Physics, Combinatorial Optimization. Selected PublicationsLucibello Carlo; Morone Flaviano; Rizzo TommasoOne-dimensional disordered Ising models by replica and cavity methodsPHYSICAL REVIEW. E, STATISTICAL, NONLINEAR AND SOFT MATTER PHYSICS, 2014 Lucibello, Carlo; Ricci-Tersenghi, FedericoThe statistical mechanics of random set packing and a generalization of the Karp-Sipser algorithmINTERNATIONAL JOURNAL OF STATISTICAL MECHANICS, 2014 Maria Chiara Angelini; Carlo Lucibello; Giorgio Parisi; Federico Ricci-Tersenghi; Tommaso RizzoLoop expansion around the Bethe solution for the random magnetic field Ising ferromagnets at zero temperaturePROCEEDINGS OF THE NATIONAL ACADEMY OF SCIENCES OF THE UNITED STATES OF AMERICA, 2020 George Stamatescu; Federica Gerace; Carlo Lucibello; Ian Fuss; Langford WhiteCritical initialisation in continuous approximations of binary neural networksInternational Conference on Learning Representations, 2020 Lucibello Carlo; Parisi Giorgio; Sicuro GabrieleOne-loop diagrams in the random Euclidean matching problemPHYSICAL REVIEW. E, 2017 Lucibello Carlo; Morone Flaviano; Parisi Giorgio; Ricci-Tersenghi Federico; Rizzo TommasoFinite-size corrections to disordered Ising models on random regular graphsPHYSICAL REVIEW. E, STATISTICAL, NONLINEAR AND SOFT MATTER PHYSICS, 2014 Ferrari Ulisse.; Lucibello Carlo; Morone Flaviano; Parisi Giorgio; Ricci-Tersenghi Federico; Rizzo TommasoFinite-size corrections to disordered systems on Erdös-Rényi random graphsPHYSICAL REVIEW. B, CONDENSED MATTER AND MATERIALS PHYSICS, 2013 Lucibello, Carlo; Morone, Flaviano; Parisi, Giorgio; Ricci-Tersenghi, Federico; Rizzo, TommasoAnomalous finite size corrections in random field modelsJOURNAL OF STATISTICAL MECHANICS: THEORY AND EXPERIMENT, 2014 Sergio Caracciolo; Carlo Lucibello; Giorgio Parisi; Gabriele SicuroScaling hypothesis for the Euclidean bipartite matching problemPHYSICAL REVIEW E, STATISTICAL, NONLINEAR, AND SOFT MATTER PHYSICS, 2014 Altieri Ada; Angelini Maria Chiara; Lucibello Carlo; Parisi Giorgio; Ricci-Tersenghi Federico; Rizzo TommasoLoop expansion around the Bethe approximation through the M-layer constructionJOURNAL OF STATISTICAL MECHANICS: THEORY AND EXPERIMENT, 2017 Lucibello, Carlo; Saglietti, Luca; Lu, YueGeneralized approximate survey propagation for high-dimensional estimationProceedings of Machine Learning Research. Vol. 97: International Conference on Machine Learning, 9-15 June 2019, Long Beach, California, USA, 2019 Feinauer, Christoph; Lucibello, CarloReconstruction of pairwise interactions using Energy-Based ModelsProceedings of Machine Learning Research vol 145: 2nd Annual Conference on Mathematical and Scientific Machine Learning, Forthcoming Ibáñez-Berganza, Miguel; Lucibello, Carlo; Santucci, Francesca; Gili, Tommaso; Gabrielli, AndreaNoise cleaning the precision matrix of short time seriesPHYSICAL REVIEW. E, 2023 Lucibello, Carlo; Pittorino, Fabrizio; Perugini, Gabriele; Zecchina, RiccardoDeep learning via message passing algorithms based on belief propagationMACHINE LEARNING: SCIENCE AND TECHNOLOGY, 2022 Lucibello, Carlo; Mézard, MarcExponential capacity of dense associative memoriesPHYSICAL REVIEW LETTERS, 2024 Ibáñez-Berganza, Miguel; Lucibello, Carlo; Mariani, Luca; Pezzulo, GiovanniInformation-theoretical analysis of the neural code for decoupled face representationPLOS ONE, 2024 Gabrié, Marylou; Ganguli, Surya; Lucibello, Carlo; Zecchina, RiccardoNeural networks: from the perceptron to deep netsSpin glass theory and far beyond : replica symmetry breaking after 40 years, 2023 Feinauer, Christoph; Meynard-Piganeau, Barthelemy; Lucibello, CarloInterpretable pairwise distillations for generative protein sequence modelsPLOS COMPUTATIONAL BIOLOGY, 2022 Angelini, Maria Chiara; Lucibello, Carlo; Parisi, Giorgio; Perrupato, Gianmarco; Ricci-Tersenghi, Federico; Rizzo, TommasoUnexpected upper critical dimension for spin glass models in a field predicted by the loop expansion around the Bethe solution at zero temperaturePHYSICAL REVIEW LETTERS, 2022 Scroll to top",
  "content_length": 5312,
  "method": "requests",
  "crawl_time": "2025-12-01 12:48:56"
}