{
  "name": "Carl Henrik Ek",
  "homepage": "http://carlhenrik.com",
  "status": "success",
  "content": "About My name is Carl Henrik Ek and I am the Professor of Statistical Learning at the Computer Lab at the University of Cambridge. I am part of the ml@cl research group and a fellow and Director of studies at Pembroke College. I am a visiting Professor at Karolinska Institute in Stockholm and a Docent in Machine Learning at the Royal Institute of Technology, Stockholm. I am the co-Director for the UKRI AI Centre for Doctoral Training in Decision Making for Complex Systems a collaboration between University of Cambridge and the University of Manchester. I am also involved with the Accelerate Program in the computer lab in Cambridge. Learning is the task of associating a new phenomena to previous knowledge. Knowledge is the capability of providing structure to the environment. In the field of machine learning we try to build methods that are capable of learning from data. The science of machine learning is concerned with how to formulate our knowledge into computational mathematics (modelling) and how to related them to observed data (inference) through computation. My research focus spans both these areas, in specific I am interested in how we can specify data efficient and interpretable assumptions that allows us to learn from small amounts of data. Most of my work is focused on Bayesian non-parametric methods and in specific Gaussian processes. Short Bio Before joining the Computer Lab in Cambridge I was a Senior Lecturer at the University of Bristol, prior to this I was an Assistant Professor in Machine Learning at the Royal Institute of Technology (KTH) in Stockholm. I did my postdoctoral research at University of California at Berkeley and my PhD is from Oxford Brookes University. I spent two years of my PhD at the University of Manchester where I was a research assistant in the Machine Learning and Optimisation group and a further six months at University of Sheffield as a visitor in the Machine Learning group. My PhD supervisors were Professor Neil Lawrence and Professor Phil Torr and during my post-doc I worked with Professor Trevor Darrell and Professor Raquel Urtasun. My undergraduate degree is a MEng degree in Vehicle Engineering from the Royal Institutie of Technology in Stockholm where I worked with Professor Stefan Carlsson and Dr. Neill Campbell at University of Bristol for my dissertation. PhD Applications I am not looking to take on PhD students starting 26/27 or 27/28. I use Emacs every day. I rarely notice it. But when I do, it usually brings me joy. – Norman Walsh Seeing Emacs as an editor is like seeing a car as a seating-accommodation – Karl Voit For as long as humanity doesn’t collapse and probably even after it does org mode and emacs will be used (there is going to be some nerd somewhere using org mode and ledger cli to meticulously track how many smoked rats and cockroach kebobs they have left to eat before they have to leave their bunker), there is just such an intense critical mass of utility under an open source license. – https://macadie.info/ In the beginning was the lambda, and the lambda was with Emacs, and Emacs was the lambda. News 2024/10Promoted to Professor of Statistical Learning 2024/03Awarded the Pilkington Price for Teaching Excellence 2023/11Started as a visiting Professor in Machine Learning at Karolinska Institute, Stockholm, Sweden 2020/06Started as a Senior Lecturer in Machine Learning in the Computer Laboratory of the University of Cambridge. 2016/10Awarded Teacher of the year in Computer Science at University of Bristol 2016/02Awarded the degree of Docent in Machine Learning at Royal Institute of Technology, KTH, Stockholm, Sweden 2015/12I gave a TEDx talk titled “Why I do not fear Artificial Intelligence” you can find the Video of the talk here. 2015/12Interview (in Swedish) for Campi magazine URL 2015/11Awarded Teacher of the year at Royal Institute of Technology, Sweden motivation 2015/10Awarded Teacher of the year from Student chapter in Industrial Economics at Royal Institute of Technology 2013/10Interview (in Swedish) about teaching in national Swedish student magazine Shortcut URL 2012/06Awarded Teacher of the year in Computer Science at Royal Institute of Technology",
  "content_length": 4198,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:33"
}