{
  "name": "Carlos M. Duarte 0001",
  "homepage": "https://ciencias.ulisboa.pt/perfil/caduarte",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo Carlos Duarte Contactos Departamento de Informática Sala/Gabinete 6.3.38A Ext. Principal 526364 Telefone Direto 217500519 Email caduarte@ciencias.ulisboa.pt Página Pessoal Carreira Docente Universitário Categoria Professor Associado Indicadores ResearcherID Orcid Scopus Google Scholar CiênciaVitae Currículo Resumido Carlos Duarte é doutorado (2008) em Informática pela Universidade de Lisboa, e mestre (2000) em Engenharia Electrotécnica e de Computadores pelo Instituto Superior Técnico, da Universidade Técnica de Lisboa, onde também se licenciou (1995) em Engenharia Electrotécnica e de Computadores. Actualmente é Professor Auxiliar do Departamento de Informática da Faculdade de Ciências da Universidade de Lisboa, e investigador sénior do LaSIGE, Laboratório de Sistemas Informáticos de Grande Escala, como membro do grupo HCIM desde 2000. Os seus principais interesses de investigação intersectam a Interação Pessoa-Máquina com a Acessibilidade, com um foco especial na engenharia para uma Web acessível. Coordenou projectos nacionais e internacionais, e a participação da Faculdade de Ciências da Universidade de Lisboa em projectos Europeus, para além de ter participado nas equipas de vários outros projectos de investigação, Europeus e nacionais. Orientou 2 teses de doutoramento e dezenas de dissertações de mestrado e projectos de licenciatura. Tem mais de 100 publicações arbitradas em conferências, revistas e livros. É membro de vários comités de programa de conferências internacionais e nacionais e revisor para várias revistas e conferências internacionais, bem como revisor de projetos para a Comissão Europeia. Interesses Científicos A minha principal área de investigação é a Interação Pessoa-Máquina. Nos últimos 10 anos, o meu trabalho nesta área focou-se na procura de alternativas que facilitem às pessoas com necessidades especiais, permanentes ou temporárias, o acesso a sistemas interactivos. Este trabalho permitiu-me contactar com populações especiais, incluindo idosos, pessoas com incapacidade visual, ou crianças com síndrome do espectro autista. A minha abordagem a este problema tão desafiante, evoluiu no sentido de considerar cada pessoa como um ser único e merecedor de uma interface adequada às suas capacidades. Para abordar este problema, considero, principalmente, duas soluções técnicas e científicas complementares: adaptação e multi-modalidade. Ao investigar sistemas adaptativos, procuro formas de capacitar um sistema com meios que lhe permitam aprender sobre o seu utilizador, e, com base no conhecimento adquirido, mudar o seu comportamento para melhor se adequar às suas necessidades. Ao investigar sistemas multimodais, procuro formas de comunicar com os utilizadores pelos canais mais apropriados, quer para transmitir, como para receber, informação. Scientific Interests My main area of research is Human-Computer Interaction. My work in this area for more than 10 years, has focused on finding ways to ease the access to interactive systems for populations with special needs, permanent or temporary. This has led me to work with unique populations, including older adults, visually impaired or children with autism spectrum disorder. My approach to this challenging problem has evolved to believing that each user is unique, and worthy of an interface adequate to her or his abilities. I have addressed this position from two, complementary, technological and scientific solutions: adaptation and multimodality. By researching adaptive systems, I look for ways to make a system learn about who is using it, and with that knowledge change its behaviour to better meet her or his unique needs. By researching multimodality, I look for ways to communicate with users through the most appropriate channels for them, both to transmit as well as to receive information. Publicações selecionadas Carlos Duarte, Luís Carriço, \"A Conceptual Framework for Developing Adaptive Multimodal Applications\", in Proceedings of the 11th ACM International Conference on Intelligent User Interfaces (IUI 2006), pp. 132-139, Sydney, Australia, 2006 José Coelho, Carlos Duarte, \"A literature survey on older adults' use of social network services and social applications\", Computers in Human Behavior, vol. 58, Pages 187-205, 2016. doi:10.1016/j.chb.2015.12.053 Jose Coelho, Carlos Duarte, Pat Langdon, Pradipta Biswas, \"Developing Accessible TV Applications\", in Proceedings of the 13th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS 2011), Dundee, Scotland, 2011 Pradipta Biswas, Carlos Duarte, Pat Langdon, Luís Almeida, Christoph Jung, (Eds.)\"A Multimodal End-2-End Approach to Accessible Computing\", Human-Computer Interaction Series, Springer, ISBN 978-1-4471-5081-7, 2013 Gonçalo Gomes, Carlos Duarte, José Coelho, Eduardo Matos, \"Designing a Facebook Interface for Senior Users\", The Scientific World Journal, vol. 2014, Article ID 741567, 8 pages, 2014. doi:10.1155/2014/741567 Ver todas as Publicações Prizes and Awards 2012-02-01 - Outstanding Service Award (Association for Computing Machinery)",
  "content_length": 5233,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:09"
}