{
  "name": "Carlos Lucena",
  "homepage": "http://www.inf.puc-rio.br/blog/professor/@carlos-jose-pereira-de-lucena",
  "status": "success",
  "content": "Departamento de Informática – PUC-Rio | Carlos José Pereira de Lucena Futuro Estudante Programas Futuro Estudante de Graduação Futuro Estudante de Pós Graduação Coordenação e Informações p/ Alunos Seminários da Graduação Agenda de Apresentações de Projeto Final Cursos Perguntas Frequentes Pós Graduação Disciplinas Seminários da Pós-graduação Agenda de Apresentações de Defesas da Pós-Graduação Pesquisa Linhas de Pesquisa Monografias e Teses Coordenadores Professores da Pós-Graduação Formulários e Modelos Perguntas Frequentes Especialização e Extensão Núcleos de Inovação Tecnologica / NIT Laboratórios Startups DI Contato Departamento de Informática História Professores Quadro Administrativo Laboratórios de Ensino e Suporte Parceiros Notícias Notícias Principais Teses e Dissertações Prêmios e Honrarias Oportunidades Redes Instagram LinkedIn Facebook Twitter YouTube Fechar Carlos José Pereira de Lucena Professor Emérito Short Bio Carlos Lucena é professor emérito do Departamento de Informática e é Diretor do Laboratório de Engenharia de Software da PUC-Rio. Tem se dedicado a pesquisa e desenvolvimento nas areas de Engenharia de Software e Sistemas Multi-Agentes. Promove a pesquisa básica, o desenvolvimento tecnológico, a cooperação universidade empresa, e o empreendorismo. É um dos pioneiros da Computação no Brasil e tem uma forte atuação na relação da PUC-Rio com outras instituições de ensino e pesquisa no país e no exterior. Curriculo Lattes lattes.cnpq.br/2491891766759477 Colaborador de Laboratório LES | Laboratório de Engenharia de Software Bolsas de Produtividade CNPq Nível 1A Tel +55 21 2540-6915 ramal 103 Sala Prédio RDC, Sala 517 Site Pessoal www.inf.puc-rio.br/~lucena Email lucena@inf.puc-rio.br Google Scholar https://scholar.google.com/citations?user=BCW5XGIAAAAJ&hl=pt-BR&oi=ao DBPL https://dblp.org/pid/l/CarlosJosePereiradeLucena Biografia O papel do professor pesquisador na área de Computação em uma universidade de pesquisa como a PUC-Rio envolve desde o ensino convencional, hoje apoiado por conteúdos na Web, até a orientação muito próxima de alunos de graduação, mestrado e doutorado. Implica também na obtenção de projetos de pesquisa financiados por agências governamentais e pela indústria, que possibilitam ao aluno uma dedicação integral ao ensino, à pesquisa e ao desenvolvimento de projetos no ambiente acadêmico. Neste ambiente onde os alunos associam a teoria à prática cabe também ao professor estimular a inovação tecnológica e o nascimento do espírito empreendedor nos alunos que podem vir a criar suas próprias empresas de base tecnológica. Possui graduação em Economia e Matemática pela Pontifícia Universidade Católica do Rio de Janeiro (1965), mestrado no Department of Computer Science & Applied Analysis pela University of Waterloo (1969), doutorado em Ciência da Computação pela University of California at Los Angeles (UCLA) (1974) e pós-doutorado pela IBM Research (1975) . Em 1982 virou professor titular da Pontifícia Universidade Católica do Rio de Janeiro. Desde 2023 é professor emérito da PUC-Rio. Ele é também professor adjunto da Universidade de Waterloo (Canadá) e pesquisador associado do Fraunhofer Institute FIRST em Berlim. É membro do corpo editorial de diversos periódicos internacionais: da Communications of the ACM, do periódico dos Anais da Academia Brasileira de Ciências, do Journal of Formal Aspects of Computing e do Journal of Agent-Oriented Software Engineering (IJAOSE). Tem experiência na área de Ciência da Computação, com ênfase em Métodos Formais, Engenharia de Software e Sistemas Multiagentes. Publicou mais de 450 trabalhos arbitrados nos principais veículos destas áreas. O professor é bolsista de produtividade em pesquisa do CNPq no nível 1A. Em sua carreira atuou na Pontifícia Universidade Católica do Rio de Janeiro como vice-reitor da Universidade, Decano do Centro Técnico Científico e por várias vezes Diretor do Departamento Informática. Prof Lucena. foi premiado com a insígnia da Classe Grã-Cruz da Ordem do Mérito Científico da Presidência da República do Brasil, com a Medalha Carlos Chagas Filho de Mérito Científico, Diretoria e Conselho Superior da FAPERJ, com o Prêmio Álvaro Alberto de Ciências e Tecnologia do Ministério de Ciência e Tecnologia e com vários prêmios IBM Innovation Award, dentre muitos outros. O prof. Lucena é fellow da Fundação Guggenheim, fellow of TWAS (Academy of Sciences for the Developing World) e membro titular da Academia Brasileira de Ciências. Até novembro de 2012, orientou 42 teses de doutorado e 108 dissertações de mestrado. Em 2009 recebeu o ACM Distinguished Scientist Award. Desde 2010, Prof Lucena se tornou o presidente do Instituto Nacional de Ciências da Web (INCT).",
  "content_length": 4725,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:13"
}