{
  "name": "Carlisle M. Adams",
  "homepage": "http://www.site.uottawa.ca/~cadams",
  "status": "success",
  "content": "Carlisle Adams Carlisle Adams Ph.D., P.Eng. Professor Research Interests: Cryptography Network Security Computer Security Access Control Privacy New textbook:  Introduction to Privacy Enhancing Technologies:  A Classification-Based Approach to Understanding PETs (available here or here) Courses Fall, 2023 CSI4108 / SEC5101 Winter, 2024 ELG5373 / CSI5106 Research groups I have been affiliated with Nexus for Quantum Technologies (NexQT) Information Security Research Group (uOttawa) Digital Security Group (Carleton University) Ontario Research Network for Electronic Commerce On the Identity Trail Project Background Education B.Sc. (Computing and Information Science) University of Guelph, Canada M.Sc. (Computing and Information Science) Queen's University, Kingston, Canada Ph.D. (Electrical Engineering) Queen's University, Kingston, Canada Work Prior to my appointment at the University of Ottawa, I worked for 13 years in cryptography and security engineering in the high-tech industry in Ottawa, Canada. I was Senior Cryptographer at Nortel Secure Networks, the business unit within Nortel that spun out to form Entrust, Inc. (now Entrust Datacard). At Entrust, I held the positions of Senior Cryptographer, Senior Manager - Standards Program, and Principal Architect - Advanced Security. Activities Conferences with which I'm currently associated: Selected Areas in Cryptography (SAC) [see the general SAC Conference website] · Selected scholarly and professional activities · Students Publications Books and Theses Papers Technical Specifications Patents Projects Major projects with which I've been involved over the years Professional Affiliations Licensed as a Professional Engineer, Professional Engineers Ontario (PEO) Senior Member, Institute of Electrical and Electronics Engineers (IEEE) Member, Association for Computing Machinery (ACM) Member, International Association for Cryptologic Research (IACR) Carlisle M. Adams, Ph.D., P.Eng. School of Electrical Engineering and Computer Science (EECS) University of Ottawa 800 King Edward Avenue P.O. Box 450, Station A Ottawa, Ontario, Canada K1N 6N5 Office: SITE Building, Room 5035 Tel: (613) 562-5800 ext. 2345 Fax: (613) 562-5664 Email: cadams -at- uottawa.ca",
  "content_length": 2230,
  "method": "requests",
  "crawl_time": "2025-12-01 12:48:49"
}