{
  "name": "Carlos Toxtli",
  "homepage": "https://www.carlostoxtli.com",
  "status": "success",
  "content": "Carlos Toxtli Homepage Carlos ToxtliMenuMenuContactBioPhD Student PositionsCurrent CoursesArtificial Intelligence portfolioEducationProfessional ExperienceSkillsAwardsPublicationsScientific - Paper/Journal/ChapterScientific - Other FormatsPostsPreprintsDemosTalksPressAcademic and Professional ProjectsServiceHobbiesContactDynamic versionEmail: me@carlostoxtli.comctoxtli@clemson.eduPhone: +16505644482Research Lab: https://haielab.orgProfiles: Linkedin , Github , Twitter,                 Slideshare , Facebook, Medium,               Youtube , ACM author,               Google Scholar< MENUBioCarlos Toxtli-Hernández is a Ph.D. in Computer Science. He is currently an Assistant Professor at Clemson University in the Human-Centered Computing division where he leads the Human-AI Empowerment Lab. He applies Human-Centered Artificial Intelligence to the design of tools that promote fair and frictionless interactions in the workplace. He applies the A.I. ethical principles of transparency, fairness, and inclusion in the design of socio-technical systems. His work contributes to the Future of Work. In the past, he worked at United Nations, Google, Microsoft Research, and Snap Inc, among other companies where he developed innovative tools to empower people through technology. His research has been published in top venues, awarded, and covered by international media. His passion for using technology to help individuals grow at their job has led him to become a tech evangelist facilitating the continuous learning of adults.  He has given more than a hundred talks at conferences around the world. He is also a serial entrepreneur, creating multiple startups focused on fintech, e-commerce, automation, bots, and education.< MENUPhD Student PositionsI am recruiting Ph.D. students for Spring 2023 and Fall 2023; if interested, please email me describing your main research topic preferences.< MENUCurrent CoursesSpring 2023 - Applied Data Science (CPSC 4300/6300)Fall 2022 - Algorithms and Data Structures (CPSC-2120)< MENUArtificial Intelligence portfolioI have implemented Artificial Intelligence techniques in the following areas:Natural Language Processing (NLP)MATT: Bot that delivers micro-tutorials via chat and retrieves feedback from experts.TaskBot: Research and development of a bot that helps teams to delegate tasks.HolaGus: Development of a chatbot platform for Whatsapp and Facebook.YBot Studio: Co-founded a company for the development of customized chatbots.Computer Vision (CV)DeepStab: Real-time Video Object Stabilization tool by using Deep LearningDeepPiracy: Video piracy detection system by using Longest Common Subsequence and Deep Learning,Multimodal Analysis for emotion recognitionMultiAffect: Reproducible Research Framework for Multimodal Video Categorization and Regression TasksQuantum Machine Learning (QML)Drug Discovery: School of AI fellowship advisor of a drug discovery machine learning algorithm by using Quantum Computing.Automatic Video EditingAutomEditor: Video blooper recognition and localization for automatic monologue video editingMusic GenerationHum2Song: Multi-track Polyphonic Music Generation from Voice Melody Transcription with Neural Networks,Content moderationUnfairReviews: System that detects inaccurate and unfair reviews given to gig workers.ID Extraction and validationKosmos: Design and development of Machine VIsion algorithms to validate identity.Recommendation systemsExpertTwin: Enhanced workspace by an AI agent that provides content to knowledge workers.Robotic Process AutomationBots Workflow Designer: Finite State Machine that orchestrates web crawlers.Crawlers: MicroVolunteering , SiteJabber , FreeMIDI ,  Facebook Fan Page Extractor , Facebook Profile Extractor , Twitter Content Deleter , Twitter Account Creator , Twitter Stream , Linkedin Extractor , Linkedin Inviter  Linkedin Deleter , Crawler Messaging (Facebook, Twitter, Linkedin) , News Crawler , Linkedin Feed Extractor , App Stores Reviews Extractor , Reddit Subreddits Scraper , Twitter Tweets Scraper , Instagram Hashtags Scraper , among others.Teaching materials in Interactive notebooks format: Notebooks adapted to run in Google ColaboratoryArtificial IntelligenceSupervised Learning plots , Unsupervised Learning plots , Machine Learning Basic concepts 1 & 2 & 3 & 4 , Linear Regression 1 & 2 & 3 , Decision Trees 1 , Random Forest 1 & 2 & 3 & , Naive Bayes 1 & 2 , k-Nearest Neighbor 1 & 2 , k-Means 1 & 2 & 3 , Support Vector Machines 1 , Logistic Regression 1 & 2 & 3 , Perceptron 1 , Machine Learning Overview 1 , Principal , Component Analysis 1 & 2 , Topic modeling 1 , GPU testing 1 , Artificial Neural Networks from scratch 1 , ANN Activation functions 1 , ANN Loss functions 1 , ANN Gradients 1 & 2 , ANN Optimizers 1 , ANN Decision Boundaries 1 , ANN Overfitting 1 & 2 , ANN Regularization 1 , Multi-Layer Perceptron 1 & 2 & 3 & 4 & 5 , Convolutional Neural Networks 1 & 2 & 3 & 4 & 5 & 6 & 7 & 8 & 9 , CNN from scratch 1 , Data Augmentation 1 & 2 & 3 , Recurrent Neural Networks 1 & 2 & 3 & 4 & 5 , Autoencoders 1 , Generative Adversarial Networks 1 & 2 & 3 & 4 & 5 , Ensembles 1 & 2 , AutoML 1 & 2 & 3 , Reinforcement Learning 1 & 2 & 3Robotic Process AutomationRPA - Basics - Threads 1 , RPA - Basics - Sockets 1 , RPA - Basics - Agents 1 , RPA - Basics - Web Server 1 , RPA - Crawlers - Beautiful Soup 1 , RPA - Crawlers - Selenium 1 & 2 , RPA - Chatbots - Facebook 1 , RPA - Chatbots - DialogFlow 1 , RPA - Chatbots - Deep Learning 1 & 2Fraud DetectionCompropago: Co-founded a platform that automates the payment gateway and detects malicious transactions.IoT TelemetryAztek: Co-founded a company that automates parking; the IoT devices are able to detect irregular behaviors.TeachingSchool of AI: Founded the WVU School of AI chapter.CourseworkSiamese Networks , SqueezeNet , VGG , RBF , AutoEncoders , AlexNet , LeNet , PCA , K means ,  XOR Binary Parity , XOR Decision Regions , Word2Vec , among others.Books (Technical editor)Hands-On Explainable AI (XAI) with Python, Credits: ScreenshotTransformers for Natural Language Processing with Python. Credits: ScreenshotArtificial Intelligence By Example Second Edition, Credits: ScreenshotAI related talksHow to implement Artificial Intelligence solutionsArtificial Intelligence From Zero To HeroChanging paradigms in AI prototypingUnderstanding Chatbot-Mediated Task ManagementEnabling Expert Critique with Chatbots and Micro GuidanceBots for CrowdsBots in Robotic Process AutomationExperTwin: An Alter Ego in Cyberspace forKnowledge WorkersUnderstanding Political Manipulation and BotnetsThe future of programming, predictions to 10 yearsJobs that are already being replaced by bots and the future of Robotic Process AutomationChatbots + RPA (Robotic Process Automation)Robotic Process Automation (RPA)Cognitive ComputingQuantum ProgrammingAffective computingHuman 2.0 - The future of human augmentationScience fiction and programmingIntroduction to Data ScienceThe future of workThe future of inclusive workThe future of work and educationData Labeling Work in the AI Ecosystem and Opportunities for ImprovementSoftware AutomationBots applied to Growth HackingCode for Social GoodA.I. in the workplace, a human-centered design approachThe power of CodeParadigms in artificial intelligenceEmpowering workers with Artificial Intelligence toolsHuman-Centered AI for the design of tools to shape the Future of WorkHuman-AI CollaborationThe future of employment in Latin America< MENUEducationNortheastern UniversityPh.D. in Computer ScienceWest Virginia University (WVU)Visiting Scholar & Ph.D. studentMonterrey Institute of Technology and Higher Education (ITESM)Master in Innovation and Technological Entrepreneurship IEDE Business School, European University of MadridMaster of Business Administration University of the Valley of Mexico (UVM)B.S. in Computer Science and Information SystemsNational Autonomous University of Mexico (UNAM)B.S. in Computer Engineering < MENUProfessional ExperienceClemson UniversityAssistant ProfessorMain Responsibilities: Leading the AI for Human Empowerment LabNortheastern UniversityGraduate Research AssistantMain Responsibilities: The design, development, and evaluation of A.I. tools to enable the Future of WorkMain Achievements:Publish research papers.SnapchatResearch InternMain Responsibilities: Research and development of tools that understand context-aware user behavior.Main Achievements:In progress Microsoft ResearchResearch InternMain Responsibilities: Research and development of tools that enable assisted document comments management. Worked under the guidance of Elnaz Nouri, Robert Sim, and Ryen White.Main Achievements:The first study about understanding the taxonomy of comments in documents. The outcome was a dataset and a Multi Context Neural Network architecture based on BERT for classifying comments to implement automatic comments triage.Twitch (Amazon)Twitch Research FellowMain Responsibilities: Research.Main Achievements:Crowd + AI-powered tools that can help Twitch moderators to fight disinformation & hate speech in live streams. GitHub (Microsoft)GitHub Campus ExpertMain Responsibilities: Enrich technology communities.Main Achievements:Empower developers. School of AIAI Dean & Research AdvisorMain Responsibilities: Promote AI technologies in the regionMain Achievements:Building a community and teaching about AI implementation Microsoft Research + AIResearch InternMain Responsibilities: Research and development of bot that helps teams to delegate tasks. Worked under the guidance of Andres Monroy and Justin Cranshaw.Main Achievements:The bot was developed and deployed during the internship.Performed user studies and published a research paper.  West Virginia UniversityResearch Visiting Scholar & Graduate Research AssistantMain Responsibilities: The design, development, and evaluation of bot-mediated systems.Publish research papers.Main Achievements:Development of Artificial Intelligence projects: Dee",
  "content_length": 48069,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:15"
}