{
  "name": "Carla M. D. S. Freitas",
  "homepage": "http://www.inf.ufrgs.br/~carla",
  "status": "success",
  "content": "Carla M. Dal Sasso Freitas - Institute of Informatics About / Short Bio Carla Dal Sasso Freitas has been a full professor at the Institute of Informatics at UFRGS (INF/UFRGS) since 1980. She is also a grantee of the National Council for Scientific and Technological Development (CNPq). She received her Ph.D. in Computer Science from UFRGS in 1994, and in 1996, was a visiting scholar at the International Computer Science Institute and E.O. Lawrence Berkeley National Laboratory in Berkeley, CA, USA. Besides the regular participation in program committees of national and international events in her areas of expertise and having organized for three times the Brazilian Symposium on Computer Graphics and Image Processing (currently designated as SIBGRAPI - Conference on Graphics, Patterns, and Images), her services to the scientific community include being a member of the board of the Brazilian Computer Society (SBC) from 2003 to 2009, president of the Special Committee on Computer Graphics and Image Processing from 1996 to 2000, and a current member of the SBC Council. She served as head and vice-head of the Department of Applied Informatics of INF/UFRGS and coordinator and vice-coordinator of the Graduate Program in Computing, also at INF/UFRGS. She was vice-director of the Institute of Informatics at UFRGS from 2011 to 2016 and is currently its director. She has supervised undergraduate and graduate students on topics in Computer Graphics, Human-Computer Interaction, and Information Visualization. Her current research interests include the development of novel visualization techniques and evaluating 2D and 3D interactions across various domains, including visual and immersive analytics applications. In these areas, she has coordinated cooperation projects with groups from the Paul Sabatier University (Toulouse) and INRIA (Saclay and Rocquencourt) in France and from the Université catholique de Louvain (Louvain la Neuve) in Belgium. Currently, she is collaborating with researchers at the University of Nice, France, and coordinating a network project involving more than 45 researchers from the Computing and Health areas (CIARS - Artificial Intelligence Applied to Health). Check the Visualization, Interaction and Simulation Lab page at https://www.inf.ufrgs.br/vislab/",
  "content_length": 2301,
  "method": "requests",
  "crawl_time": "2025-12-01 12:48:47"
}