{
  "name": "Carlo Baldassi",
  "homepage": "http://didattica.unibocconi.eu/docenti/cv.php?rif=195030",
  "status": "success",
  "content": "CARLO BALDASSI - Universita' Bocconi Apply Discover Programs Browse News and Events Login Close menu Faculty Close Contact Us CARLO BALDASSI Open share Close Share Close Associate Professor Department of Computing Sciences carlo.baldassi@unibocconi.it Download the cv Courses a.y. 2025/2026 20605 MACHINE LEARNING II 30562 MACHINE LEARNING AND ARTIFICIAL INTELLIGENCE 41046 COMPUTER SCIENCE I Courses previous a.y. I teach and have taught a number of programming courses, from undergraduate to PhD level, using Python and Julia. Biographical note I graduated in Trieste in Theoretical Physics with a thesis in applications to Computer Science and large scale discrete optimization problems. I then moved to Turin where I did a PhD in Computational Neuroscience, and also got interested in Bioinformatics and inference problems. Throughout I kept an eye on theoretical aspects of Machine Learning and Neural Networks, which are my main focus lately. About I've been the director of the BSc in Mathematical and Computing Sciences for Artificial Intelligence (BAI) since 2023/24. Research interestsMy research interests focus on the application of Statistical Mechanics to machine learning and computational neuroscience, and more generally to large-scale inference and optimization problems. Lately I've been particularly interested in studying the loss landscape of neural networks, analytically and numerically. Working papersP Chaudhari, A Choromanska, S Soatto, Y LeCun, C Baldassi, C Borgs, J Chayes, L Sagun, R Zecchina Entropy-sgd: Biasing gradient descent into wide valleysICLR 2017, Journal of Statistical Mechanics, 2019 C Baldassi, F Gerace, HJ Kappen, C Lucibello, L Saglietti, E Tartaglione, R ZecchinaRole of synaptic stochasticity in training low-precision neural networksPhysical review letters, 2018 C Baldassi, R ZecchinaEfficiency of quantum vs. classical annealing in nonconvex learning problemsProceedings of the National Academy of Sciences, 2018 C Baldassi, EM Malatesta, R ZecchinaProperties of the Geometry of Solutions and Capacity of Multilayer Neural Networks with Rectified Linear Unit ActivationsC Baldassi, EM Malatesta, R Zecchina, 2019 C Baldassi, F Pittorino, R ZecchinaShaping the learning landscape in neural networks around wide flat minimaProceedings of the National Academy of Sciences, 2019 Selected PublicationsBaldassi, Carlo; Ingrosso A; Lucibello C; Saglietti L; Zecchina R.Subdominant Dense Clusters Allow for Simple Learning and High Computational Performance in Neural Networks with Discrete SynapsesPHYSICAL REVIEW LETTERS, 2015 Baldassi, Carlo; Borgs, Christian; Chayes, Jennifer; Ingrosso, Alessandro; Lucibello, Carlo; Saglietti, Luca; Zecchina, RiccardoUnreasonable effectiveness of learning neural networks: from accessible states and robust ensembles to basic algorithmic schemesPROCEEDINGS OF THE NATIONAL ACADEMY OF SCIENCES OF THE UNITED STATES OF AMERICA, 2016 Chaudhari, Pratik; Choromanska, Anna; Soatto, Stefano; Lecun, Yann; Baldassi, Carlo; Borgs, Christian; Chayes, Jennifer; Sagun, Levent; Zecchina, RiccardoEntropy-SGD: biasing gradient descent into wide valleysJOURNAL OF STATISTICAL MECHANICS: THEORY AND EXPERIMENT, 2019 Baldassi, Carlo; Gerace, Federica; Kappen, Hilbert J.; Lucibello, Carlo; Saglietti, Luca; Tartaglione, Enzo; Zecchina, RiccardoRole of synaptic stochasticity in training low-precision neural networksPHYSICAL REVIEW LETTERS, 2018 Baldassi, Carlo; Zecchina, RiccardoEfficiency of quantum vs. classical annealing in nonconvex learning problemsPROCEEDINGS OF THE NATIONAL ACADEMY OF SCIENCES OF THE UNITED STATES OF AMERICA, 2018 Baldassi, Carlo; Malatesta, Enrico M.; Zecchina, RiccardoProperties of the geometry of solutions and capacity of multilayer neural networks with rectified linear unit activationsPHYSICAL REVIEW LETTERS, 2019 Baldassi, Carlo; Pittorino, Fabrizio; Zecchina, RiccardoShaping the learning landscape in neural networks around wide flat minimaPROCEEDINGS OF THE NATIONAL ACADEMY OF SCIENCES OF THE UNITED STATES OF AMERICA, 2020 Scroll to top",
  "content_length": 4050,
  "method": "requests",
  "crawl_time": "2025-12-01 12:48:56"
}