{
  "name": "Carlos M. P. Matos",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/carlos-matos(1fce6588-ec3e-4af6-b6af-514d26a8a679).html",
  "status": "success",
  "content": "Carlos Matos - Royal Holloway Research Portal Carlos Matos Professor Head of Department (Computer Science), Department of Computer Science Phone+44 1784 414161EmailCarlos.Matosrhul.acuk TW20 0EX Research output 3 Conference contribution 2 Chapter 1 Article 1 Doctoral Thesis Research output per year Research output per year A blended learning model for practical sessionsBarreiro, N. & Pinto de Matos, C., 7 Nov 2016, Computer Science and Information Systems (FedCSIS), 2016 Federated Conference on. Gdansk: IEEE, p. 903-912 10 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Reengineering Software to Three-tier Applications and ServicesMatos, C. M. P. D., 2012Research output: Thesis › Doctoral Thesis Legacy transformations for extracting service componentsMatos, C. & Heckel, R., 2011, Rigorous Software Engineering for Service-Oriented Systems: Results of the SENSORIA Project on Software Engineering for Service-Oriented Computing. Wirsing, M. & Hölz, M. (eds.). Springer-Verlag, p. 604-621 18 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter Migrating Legacy Systems to Service-Oriented ArchitecturesMatos, C. & Heckel, R., 2009, In: Electronic Communications of the EASST. 16, p. 1-16 16 p.Research output: Contribution to journal › Article › peer-review Architectural Transformations: From Legacy to Three-tier and ServicesHeckel, R., Correia, R., Matos, C., El-Ramly, M., Koutsoukos, G. & Andrade, L., 2008, Software Evolution. Mens, T. & Demeyer, S. (eds.). Springer-Verlag, p. 139-170 32 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter View all 7 research outputs Prizes College Certificate of Commendation for Teaching Excellence Matos, C. (Recipient) & Duarte Marques Barreiro, N. (Recipient), 2019Prize: Prize (including medals and awards) College Certificate of Commendation for Team TeachingMatos, C. (Recipient), Duarte Marques Barreiro, N. (Recipient) & Durant, S. (Recipient), 2020Prize: Prize (including medals and awards) College Team Teaching PrizeMatos, C. (Recipient), Duarte Marques Barreiro, N. (Recipient) & Lyons, J. (Recipient), 2019Prize: Prize (including medals and awards) College Team Teaching PrizeMatos, C. (Recipient), Cohen, D. (Recipient) & Kinder, J. (Recipient), 2015Prize: Prize (including medals and awards)",
  "content_length": 2344,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:06"
}