{
  "name": "Carl Nettelblad",
  "homepage": "https://katalog.uu.se/empinfo/?id=N6-1341",
  "status": "success",
  "content": "Carl Nettelblad - Uppsala universitet Carl Nettelblad Teknisk koordinator vid Institutionen för informationsteknologi; UPPMAX, Uppsala Multidisciplinary Centre for Advanced Computational Science Mobiltelefon: 070-359 12 42E-post: carl.nettelblad@uppmax.uu.seBesöksadress: Hus 10, Regementsvägen 10Postadress: Box 337751 05 Uppsala Ladda ned kontaktuppgifter för Carl Nettelblad vid Institutionen för informationsteknologi; UPPMAX, Uppsala Multidisciplinary Centre for Advanced Computational Science Universitetslektor vid Institutionen för informationsteknologi; Beräkningsvetenskap Telefon: 018-471 22 68Mobiltelefon: 070-359 12 42E-post: carl.nettelblad@it.uu.seBesöksadress: Hus 10, Regementsvägen 10Postadress: Box 337751 05 UPPSALA Ladda ned kontaktuppgifter för Carl Nettelblad vid Institutionen för informationsteknologi; Beräkningsvetenskap Akademiska meriter: DocentORCID: 0000-0003-0458-6902 Kort presentation Forskar inom beräkningsvetenskap, inriktat på att använda moderna datorarkitekturer (GPU, massiv parallellism) inom olika typer av dataanalys i livsvetenskaperna. En grundfrågeställning är \"hur kan vi ha bättre beräkningsmetoder för att ge säkrare analyser från sämre data\". Nyckelord xfelhpcgenomicshidden markov modelsartificial intelligencemachine learningoptimization Biografi Enorma framsteg har skett i metoder för massiv datainsamling inom biologi. Teknikutvecklingen har möjliggjort större och större datamängder, som snabbt passerat så stora att det inte finns någon som helst möjlighet för en enskild forskare att kontrollera om resultat är rimliga. Därför blir det viktigare att analysmetoder automatiskt kan identifiera och hantera fel. Utgångspunkten för min forskning är att data alltid kommer att innehålla fel, ofullständigheter och brus. Med den utgångspunkten kan man analysera \"dåliga\" prover, eller ta med en större del av materialet. Det mer vedertagna sättet i dag är att filtrera ut de delar som håller högst kvalitet och i stället fokusera analysen på dem, eller att använda metoder utformade för säkra prover och bara hoppas att de ger rätt resultat även när delar av labbresultatet är mer osäkert. I dagsläget fokuserar jag på samarbeten inom enkelpartikelavbildning med röntgenlaser, respektive modellering av haplotypstruktur och fasning av genomikdata vid låg täckning/hög felfrekvens. Jag är ändå hela tiden nyfiken på nya tillämpningar där statistisk modellering och massiva beräkningar kan vara relevant. Som kuriosa kan nämnas att jag längre tillbaka har deltagit och vunnit medaljer i olika internationella vetenskapstävlingar, som IMO (matematik), IOI (programmering), IBO (biologi) och ACM ICPC (programmering). Är du som student intresserad av ett projekt med inriktning mot dataanalys och högprestandaberäkningar på kandidatnivå, masternivå eller som doktorand/postdoc? Hör av dig. Projekt kan anpassas till dina förkunskaper. I dagsläget är vi väldigt intresserade av att mer explorativt utveckla testa andra arkitekturer för neurala nätverk för genomikdata (transfomers, diffusionsmodeller för att ta två exempel). Publikationer Urval av publikationer Achieving improved accuracy for imputation of ancient DNA Ausmees, Kristiina; Nettelblad, Carl Ingår i Bioinformatics, 2023 DOI för Achieving improved accuracy for imputation of ancient DNA Ladda ner fulltext (pdf) av Achieving improved accuracy for imputation of ancient DNA A deep learning framework for characterization of genotype data Ausmees, Kristiina; Nettelblad, Carl Ingår i G3, 2022 DOI för A deep learning framework for characterization of genotype data Ladda ner fulltext (pdf) av A deep learning framework for characterization of genotype data A joint use of pooling and imputation for genotyping SNPs Clouard, Camille; Ausmees, Kristiina; Nettelblad, Carl Ingår i BMC Bioinformatics, 2022 DOI för A joint use of pooling and imputation for genotyping SNPs Ladda ner fulltext (pdf) av A joint use of pooling and imputation for genotyping SNPs Coherent diffraction of single Rice Dwarf virus particles using hard X-rays at the Linac Coherent Light Source Munke, Anna; Andreasson, Jakob; Aquila, Andrew; Awel, Salah et al. Ingår i Scientific Data, 2016 DOI för Coherent diffraction of single Rice Dwarf virus particles using hard X-rays at the Linac Coherent Light Source Hummingbird: monitoring and analyzing flash X-ray imaging experiments in real time Daurer, Benedikt J.; Hantke, Max F.; Nettelblad, Carl; Maia, Filipe R. N. C. Ingår i Journal of applied crystallography, s. 1042-1047, 2016 DOI för Hummingbird: monitoring and analyzing flash X-ray imaging experiments in real time Three-dimensional reconstruction of the giant mimivirus particle with an X-ray free-electron laser Ekeberg, Tomas; Svenda, Martin; Abergel, Chantal; Maia, Filipe R. N. C. et al. Ingår i Physical Review Letters, 2015 DOI för Three-dimensional reconstruction of the giant mimivirus particle with an X-ray free-electron laser Ladda ner fulltext (pdf) av Three-dimensional reconstruction of the giant mimivirus particle with an X-ray free-electron laser Imputation of single nucleotide polymorphism genotypes in biparental, backcross, and topcross populations with a hidden Markov model Hickey, John M.; Gorjanc, Gregor; Varshney, Rajeev K.; Nettelblad, Carl Ingår i Crop science, s. 1934-1946, 2015 DOI för Imputation of single nucleotide polymorphism genotypes in biparental, backcross, and topcross populations with a hidden Markov model Breakdown of methods for phasing and imputation in the presence of double genotype sharing Nettelblad, Carl Ingår i PLOS ONE, 2013 DOI för Breakdown of methods for phasing and imputation in the presence of double genotype sharing Ladda ner fulltext (pdf) av Breakdown of methods for phasing and imputation in the presence of double genotype sharing Fast and accurate detection of multiple quantitative trait loci Nettelblad, Carl; Mahjani, Behrang; Holmgren, Sverker Ingår i Journal of Computational Biology, s. 687-702, 2013 DOI för Fast and accurate detection of multiple quantitative trait loci Inferring haplotypes and parental genotypes in larger full sib-ships and other pedigrees with missing or erroneous genotype data Nettelblad, Carl 2012 Ladda ner fulltext (pdf) av Inferring haplotypes and parental genotypes in larger full sib-ships and other pedigrees with missing or erroneous genotype data cnF2freq: Efficient determination of genotype and haplotype probabilities in outbred populations using Markov models Nettelblad, Carl; Holmgren, Sverker; Crooks, Lucy; Carlborg, Örjan Ingår i Bioinformatics and Computational Biology, s. 307-319, 2009 DOI för cnF2freq: Efficient determination of genotype and haplotype probabilities in outbred populations using Markov models Senaste publikationer Using feedback in pooled experiments augmented with imputation for high genotyping accuracy at reduced cost Clouard, Camille; Nettelblad, Carl Ingår i G3, 2025 DOI för Using feedback in pooled experiments augmented with imputation for high genotyping accuracy at reduced cost Ladda ner fulltext (pdf) av Using feedback in pooled experiments augmented with imputation for high genotyping accuracy at reduced cost Observation of a single protein by ultrafast X-ray diffraction Ekeberg, Tomas; Assalauova, Dameli; Bielecki, Johan; Boll, Rebecca et al. Ingår i Light, 2024 DOI för Observation of a single protein by ultrafast X-ray diffraction Ladda ner fulltext (pdf) av Observation of a single protein by ultrafast X-ray diffraction Project Hephaistos – II. Dyson sphere candidates from Gaia DR3, 2MASS, and WISE Suazo, Matías; Zackrisson, Erik; Mahto, Priyatam; Lundell, Fabian et al. Ingår i Monthly notices of the Royal Astronomical Society, s. 695-707, 2024 DOI för Project Hephaistos – II. Dyson sphere candidates from Gaia DR3, 2MASS, and WISE Ladda ner fulltext (pdf) av Project Hephaistos – II. Dyson sphere candidates from Gaia DR3, 2MASS, and WISE Genotyping of SNPs in bread wheat at reduced cost from pooled experiments and imputation Clouard, Camille; Nettelblad, Carl Ingår i Theoretical and Applied Genetics, 2024 DOI för Genotyping of SNPs in bread wheat at reduced cost from pooled experiments and imputation Ladda ner fulltext (pdf) av Genotyping of SNPs in bread wheat at reduced cost from pooled experiments and imputation Data-Driven Locality-Aware Batch Scheduling Gonthier, Maxime; Larsson, Elisabeth; Marchal, Loris; Nettelblad, Carl et al. Ingår i 2024 IEEE International Parallel and Distributed Processing Symposium Workshops (IPDPSW), s. 202-211, 2024 DOI för Data-Driven Locality-Aware Batch Scheduling Alla publikationer Artiklar i tidskrift Using feedback in pooled experiments augmented with imputation for high genotyping accuracy at reduced cost Clouard, Camille; Nettelblad, Carl Ingår i G3, 2025 DOI för Using feedback in pooled experiments augmented with imputation for high genotyping accuracy at reduced cost Ladda ner fulltext (pdf) av Using feedback in pooled experiments augmented with imputation for high genotyping accuracy at reduced cost Observation of a single protein by ultrafast X-ray diffraction Ekeberg, Tomas; Assalauova, Dameli; Bielecki, Johan; Boll, Rebecca et al. Ingår i Light, 2024 DOI för Observation of a single protein by ultrafast X-ray diffraction Ladda ner fulltext (pdf) av Observation of a single protein by ultrafast X-ray diffraction Project Hephaistos – II. Dyson sphere candidates from Gaia DR3, 2MASS, and WISE Suazo, Matías; Zackrisson, Erik; Mahto, Priyatam; Lundell, Fabian et al. Ingår i Monthly notices of the Royal Astronomical Society, s. 695-707, 2024 DOI för Project Hephaistos – II. Dyson sphere candidates from Gaia DR3, 2MASS, and WISE Ladda ner fulltext (pdf) av Project Hephaistos – II. Dyson sphere candidates from Gaia DR3, 2MASS, and WISE Genotyping of SNPs in bread wheat at reduced cost from pooled experiments and imputation Clouard, Camille; Nettelblad, Carl Ingår i Theoretical and Applied Genetics, 2024 DOI för Genotyping of SNPs in bread wheat at reduced ",
  "content_length": 24824,
  "method": "requests",
  "crawl_time": "2025-12-01 12:48:42"
}