{
  "name": "Carl Magnus Olsson",
  "homepage": "https://mau.se/en/persons/carl.magnus.olsson",
  "status": "success",
  "content": "Carl Magnus Olsson | Malmö University i Skip to main content Go to chat Cookies We use cookies on this website. Cookies help us deliver the best experience on our website. Read about cookies. Accept all Accept necessary Malmö University Student Web Library Staff Web På svenska Education Education Education Programmes and courses Applications and admissions Tuition fees Scholarships Exchange studies at Malmö University Study Guidance Housing Housing Housing Find housing in Malmö University Housing After admission After admission After admission Moving to Malmö Pre-orientation Arrival guide About studies at Malmö University About studies at Malmö University About studies at Malmö University Why choose Malmö University Understanding university studies Connect with our students On the page Research Research Research Doctoral studies Doctoral studies Doctoral studies Doctoral courses Doctoral schools Doctoral schools Doctoral schools Adaptation of urban space through sustainable regeneration ComBine Culturally Empowering Education through Language and Literature Education, Learning and Globalisation Finding ways in a time of great future challenges (FinnFram) Swedish National Graduate School in Science and Technology Education Research Learning in Multicultural Societal Contexts Pedagogy and Vocational Skills Relevancing Mathematics and Science Education (RelMaS) Sustainable Movement Education The National Research School for Professionals in Social Services Research subjects Research centres Research centres Research centres Biofilms Research Centre for Biointerfaces Citizen Health Imagining and Co-Creating Futures Institute for Urban Research Malmö Institute for Migration Studies Literacy and Inclusive Teaching Centre for Work Life Studies Sustainable Digitalisation Research Centre Centre for Sexology and Sexuality Studies Research publications Research publications Research publications Search publications Malmö University Press Research in focus Research in focus Research in focus Focus: In the classroom Focus: A future with AI Focus: Climate and society Focus: The mouth Focus: Migration Focus: The war in Ukraine Focus: Perspectives on Malmö Focus: Loneliness Focus: Peace, democracy and human rights Research events Participate in a research study Coffee Break Quiz On the page Collaboration and Innovation Collaboration and Innovation Collaboration and Innovation Levels of collaboration Levels of collaboration Levels of collaboration Local collaboration Regional collaboration National collaboration International collaboration Innovation Collaboration with students Collaborate with researchers Collaborate with researchers Collaborate with researchers Labs and facilities Culture collaboration Support Malmö University Alumni & Friends On the page About us About us About us Job opportunities Job opportunities Job opportunities Apartments for researchers Current vacancies Meet our staff Employee benefits HR Excellence in Research award EURAXESS Faculties and departments Faculties and departments Faculties and departments Faculty of Health and Society Faculty of Health and Society Faculty of Health and Society Department of Biomedical Science Department of Criminology Department of Social Work Department of Care Science Department of Police Work Faculty of Culture and Society Faculty of Culture and Society Faculty of Culture and Society Department of Global Political Studies School of Arts and Communication Department of Urban Studies Faculty of Education and Society Faculty of Education and Society Faculty of Education and Society Department of Childhood, Education and Society Department of Sports Sciences Department of Culture, Languages and Media Department of Natural Science, Mathematics and Society Department of Society, Culture and Identity Department of School Development and Leadership Faculty of Technology and Society Faculty of Technology and Society Faculty of Technology and Society Department of Computer Science and Media Technology Department of Materials Science and Applied Mathematics Faculty of Odontology Faculty of Odontology Faculty of Odontology Master's programmes in Dental Science University Dental Clinic Find and contact Malmö University Find and contact Malmö University Find and contact Malmö University Visit Malmö University News and press News and press News and press Graphic manual Map of the buildings (Google Maps) Merchandise Supplier information and invoice management Whistleblowing Management and decision-making paths Malmö University's strategy 2030 Malmö University's strategy 2030 Malmö University's strategy 2030 Global engagement Sustainability Widened recruitment and participation Quality assurance work at the University Malmö Academic Choir and Orchestra Malmö Academic Choir and Orchestra Malmö Academic Choir and Orchestra Student work – video pieces Annual Academic Celebration Annual Academic Celebration Annual Academic Celebration Academic traditions Meet our new professors Meet our new doctors Honorary doctors The University in a troubled world On the page På svenska På svenska Menu Search Search Search ﻿ Carl Magnus Olsson Associate Professor carl.magnus.olsson@mau.se +46 40 665 75 02 orcid.org/0000-0002-4261-281X Employed at Faculty of Technology and Society Department of Computer Science and Media Technology Research subject Computer Sciences Human Computer Interaction Design driven research methods Design Wearable technology Embedded systems Software Engineering Presentation Vice director and responsible for external relations for Sustainable Digitalization Research Center (SDRC), previously known as Internet of Things and People (IOTAP) research center. I also participate as researcher in the Biofilms Research Center for Biointerfaces. Background My research is positioned within the design and use of context-aware systems. These can be characterized as adapting their behavior to relevant changes in the environment they are in, and the human agents that are using them. With a background in software engineering as well as human-computer interaction, my interests have always been on how such technology can be developed and made into viable products relevant for end users. My publications therefore span from the more development oriented perspectives such as concept development and assessments, to user studies and data-driven indicators from use-time. Digital health Most of my work today is focused on digital health as application area, and making context-aware technology available for clinical researchers. This is enabled by sensors embedded in mobile phones and wearable devices such as smart watches, armbands, and rings having greatly improved in quality and biometric data they can provide. Using Mobistudy as the platform for most of our research, we work with a number of clinical partners in e.g. Parkinson's disease (Karolinska Institute and University of Edinburgh), spinal cord injury (National Hospital for Paraplegics, Toledo), pulmonary diseases (Oxford University Hospitals), and asthma (Usher Institute). Our role in these projects is typically to provide and adapt the Mobistudy platform so that modern wearable and mobile technology can be incorporated into clinical studies. We also develop and test indicators for complex conditions, and provide standardized and validated tests that allow patients to be monitored and in their home environments rather than always have to go into clinic to do tests. This includes for instance the submaximum physical capacity and function tests such as Six Minute Walk Test (6MWT) and Timed Up and Go (TUG) which are commonly used within cardiology and neurology. Aside from research using Mobistudy or similar technology, we also drive patient and public involvement initiatives (PPIs) and run workshops and interview studies with stakeholders relevant to digital health innovation. This includes co-design, ideation and other participant engaging approaches. Design mechanisms that promote trust, including e.g. privacy by design and privacy-preserving machine learning, as well as data visualization and transparency enhancing tools are core to the human-computer interaction side of my research. Other research and activities Since starting at Malmö University, I have led major projects assoctiated with sensor and data driven systems through our research center Internet of Things and People (IOTAP), which from 2025 has become the Sustainable Digitalization Research Center (SDRC) and includes all faculties of the university. This is done in close collaboration with a large number of industry partners, including directly integrated in research and development projects at these companies. Funding agencies of projects that I lead or am involved in include the Swedish Knowledge Foundation, Vinnova, Mats Paulsson Foundation, K2, STINT, and the European Commision. I supervise a number of PhD students including several industrial PhD students from companies I have close collaboration with, and have supervised 30+ MSc and BSc theses. Many MSc and BSc theses have been at companies and extended after completion to conference or journal publications by the students, the students and myself, or the students and colleagues at other universities. I received the Stefan Bengtsson Research Leader award 2019 at Malmö University, and the individual pedagogical prize at the University of Gothenburg 2010, for the Industrial IT and Embedded Systems Project (nominated by students from four different years of that project). For teaching, I focus on doctoral courses, but have an extensive background as course responsible for Embedded Systems, Software Processes and Improvement, Change Management, Software Architecture, Game Design, Game Engine Driven Product Development, and Research Methods, to name some. I teach exclusively using Problem Based Learning (PBL), and have self-developed pedagogical material for several courses emphasizing student-involvement during course and lear",
  "content_length": 12624,
  "method": "requests",
  "crawl_time": "2025-12-01 12:48:44"
}