{
  "name": "Carlos Vázquez 0001",
  "homepage": "https://www.etsmtl.ca/Professeurs/cvazquez",
  "status": "success",
  "content": "Vázquez, Carlos - ÉTS Montréal Accueil Étudier à l'ÉTS Corps professoral Vázquez, Carlos Carlos Vázquez Professeur Département Département de génie logiciel et TI Formation B.Ing., M.Sc. (ISPJAE, Cuba), Ph.D. (INRS, Montréal) Bureau A-4472 Courriel carlos.vazquez@etsmtl.ca Unités de recherche Visiter le site web de : Chaire de recherche Summit Tech sur la vidéo immersive et interactive Visiter le site web de : LABMULTIMEDIA – Laboratoire de recherche en multimédia Visiter le site web de : LIO-ÉTS – Laboratoire d'innovation ouverte en technologies de la santé Visiter le site web de : itechsanté – Institut de recherche et d'innovation en technologies pour la santé Axes de recherche Systèmes logiciels, multimédia et cybersécurité Technologies de la santé Expertises Vision par ordinateur Imagerie médicale Reconstruction 3D Traitement numérique des images et de la vidéo Imagerie stéréoscopique et multivue Codage vidéo multivues Programmation GPGPU Cours GTI411 Imagerie numérique 4 crédits Hiver 2025 GTI411 Imagerie numérique 4 crédits Automne 2025 Encadrements Thèse de doctorat (recherche appliquée) En codirection avec : Jacques De GuiseReconstruction 3D automatique de la colonne vertébrale à partir de radiographies bi-planaires EOS, par Benjamin AubertAutomne 2020En codirection avec : Carlos VàzquezFully Automatic CNN-Based Personalized 3D Femur Reconstruction from EOS 2D Bi-Planar Radiographs, par Nahid Babazadeh KhamenehHiver 2023En codirection avec : Carlos VàzquezCalibration d’un système de stéréoradiographie et correction des artéfacts de mouvement du patient sur des images radiographiques EOS, par Amiel AllabÉté 2024En codirection avec : Carlos VàzquezReconstruction 3D du genou ostéophytique à partir de radiographies bi-planes, par Ted Julien Tchinde FotsinÉté 2021En codirection avec : Carlos VàzquezMéthode automatique pour la localisation et l'identification de structures osseuses dans les radiographies EOS, par Roseline Olory AgommaAutomne 2021En codirection avec : Carlos VàzquezDivingFy: A system for marker-less kinematic analysis of diving and diver’s 2D pose estimation from a single and fixed camera, par Ramon Figueiredo PessoaHiver 2026En codirection avec : Carlos VàzquezAutomatic Personalized 3D model Reconstruction of The Distal Tibiofibular Joint from Biplanar Ankle X-Ray Images for Syndesmosis Assessment, par Pejman HashemibakhtiarAutomne 2025En codirection avec : Carlos VàzquezCréation de modèles surfaciques personnalisés et sans contact pour l’estimation précise des surfaces corporelles saines et brûlées en contexte clinique, par Anaïde ThibaultÉté 2025En codirection avec : Stéphane CoulombeReprésentation, compression et diffusion en temps réel efficaces de vidéos stéréoscopiques à 360°, par Hossein Pejman TavallaeeHiver 2026En codirection avec : Carlos VàzquezEstimation précise à postériori de cycles de marche à partir des vidéos (RGBD ou RGB) en utilisant des méthodes d’apprentissage automatique, par Lucas MercierHiver 2026En codirection avec : Carlos VàzquezReconstruction 3D et caractérisation automatique du poumon et de ses lésions à partir d'image radiographique biplanaire EOS, par Alice Le Nilias HoumeauHiver 2026 Mémoire à 30 crédits En codirection avec : Carlos VàzquezEstimation de la pose humaine sur des vidéos RGB ou RGBD basée sur des techniques d'apprentissage machine, par Arij SaidHiver 2026En codirection avec : Carlos VàzquezDéfinition d'un modèle biomécanique pour faciliter l'apprentissage des algorithmes d'estimation de la pose 3D et améliorer la précision et la robustesse de la cinématique du mouvement, par Léan MazierAutomne 2025En codirection avec : Jacques De GuiseSegmentation de l'articulation de la hanche à partir de radiographies biplanes en utilisant une approche multi-structures, par Fatma OuertaniHiver 2015En codirection avec : Christian DesrosiersEstimation du champ dense de mouvement pour la génération semi-automatique de cartes de profondeur, par Etienne RocheleauHiver 2017En codirection avec : Jacques De GuiseÉlaboration d'outils de traitement d'images pour aider à la reconstruction 3D du rachis à partir d'images radiographiques postopératoires, par Pierre-Antoine VidalAutomne 2016En codirection avec : Carlos VàzquezGénération automatique de cartes de profondeur relative par utilisation des occlusions dynamiques, par Louiza OudniAutomne 2017En codirection avec : Carlos VàzquezSegmentation précise des structures de l'articulation du genou sur des radiographies EOS de face, par Alexandre SarazinÉté 2018Plateforme de personnalisation du contenu visuel, par M'Hand KedjarÉté 2022En codirection avec : Carlos VàzquezDetection And Tracking of Sphere Markers, par Hesam EskandariAutomne 2019En codirection avec : Carlos VàzquezReconstruction tridimensionnelle du pelvis à partir de radiographies biplanes, par Romain LenéezAutomne 2023Estimation de mesure anthropométrique avec une seule image, par Michael BuronÉté 2022En codirection avec : Carlos VàzquezDéveloppement et validation d’une méthode de comptage de lamelles d’une turbine à gaz, par Imene BelkacemiAutomne 2021En codirection avec : Jacques De GuiseMéthode d’évaluation des reconstructions 3D de colonne vertébrale, issues d’images radiographiques bi-planaires, par Magali BonhommeÉté 2021En codirection avec : Carlos Vàzquez3D Human Body Mesh Generation from 2D Images Using Body Silhouette, Bone Orientation, and Joints Triangulation, par Jordy AjanohounHiver 2021En codirection avec : Carlos VàzquezSegmentation et identification des vertèbres sur des radiographies frontales de rachis par méthodes d'apprentissage profond, par Agathe MoncorgéHiver 2022En codirection avec : Carlos VàzquezDéformation 3D automatique du fémur à partir d'un nombre arbitraire de radiographies EOS calibrées, par Francis ToupinAutomne 2023En codirection avec : Jacques De GuisePrédiction de l’évolution de la scoliose idiopathique de l’adolescent à partir d’images radiographiques biplanaires, par Marie MoulinHiver 2022En codirection avec : Carlos VàzquezÉtude des mécanismes de compensation des membres inférieurs qui peuvent influencer la balance sagittale après fusion lombaire grâce au système d'imagerie EOS, par Victor BaisamyAutomne 2023En codirection avec : Eric PaquetteCréation d'avatars 3D réalistes et articulés avec vêtements à partir d'une seule image frontale, par Fares MallekHiver 2024En codirection avec : Stéphane CoulombeEnhancing the Performance of the Test Model for MPEG Immersive Video through Proximity-aware Grouping of Small Clusters, par Mahshad MahdavimoghadamHiver 2025Direct Estimation of the Knee Flexion Angle from a Monocular Image During Walking, par Anis FakhfakhÉté 2025En codirection avec : Stéphane CoulombeÉlagage d'information redondante dans le contexte de la norme MPEG de vidéo immersive, par Esteban DefranceHiver 2026Miroir magique : représentation virtuelle de la nouvelle apparence physique du patient oncologique après une opération délabrante du visage, par Antoine DessoliesAutomne 2025 Projet d'application à 15 crédits En codirection avec : Stéphane CoulombeDu 2D au 3D : Génération de nuages de points à partir d'images, par Patrice Leutou TientcheuHiver 2026En codirection avec : Carlos VàzquezPlateforme de recherche pour la vidéo conférence 3D : analyse et étude de la structure de la profondeur, par Lotfi LoukiliHiver 2016En codirection avec : Carlos VàzquezCorrection du regard pour les vidéoconférences, par Jean-Baptiste FontaineÉté 2015En codirection avec : Carlos VàzquezÉtude et amélioration du modèle de génération de reconstruction d'images radiologiques numériques, par Philippe AndrianavalonaÉté 2015Étude, conception et développement d'une application d'extraction de mesures d'une personne à partir d'un scan 3D, par Slim HarizHiver 2018En codirection avec : Carlos VàzquezEstimation de mouvement à partir de plusieurs caméras omnidirectionnelles stéréoscopiques pour le codage de vidéos immersives : performance du logiciel IVDE, par Ayyoub FakhariÉté 2023Reconstruction 3D automatique du bassin à l’aide d’un réseau CNN et d’un modèle de forme statistique à partir d’images radiographiques EOS, par Ayoub NasriÉté 2023Génération automatique de moules numériques pour la confection de prothèses faciales, par Ulysse CabanesÉté 2023Génération automatique de moules numériques pour la confection de prothèses faciales, par Pierre Le Chartier De SedouyAutomne 2023Génération et recalage de modèle 3D de visages à partir d'images, par Kevin BecquetÉté 2024En codirection avec : Carlos VàzquezRendu de nouvelles vues et accélération GPU pour la navigation 6DoF sur casque VR, par Enzo Di MariaÉté 2024 Stage industriel et rapport technique, 3 cr. Rapport de stage, par Ayoub NasriÉté 2023 Publications Affiche 6 Roseline Olory Agomma, Thierry Cresson, Carlos Vázquez, Jacques de Guise. 2017 « Détection automatique de régions anatomiques dans les radiographies frontales basée sur un réseau de neurones convolutionnel ». Affiche présentée lors de la conférence : 37e Journée de la Recherche du POES et de la Division d'Orthopédie de l'Université de Montréal (Montréal, QC, Canada, 18 mai 2017)Alexandre Sarazin, Thierry Cresson, Carlos Vázquez, Jacques de Guise. 2017 « Segmentation précise du fémur sur des images radiographiques avec un algorithme de chemin minimal amélioré ». Affiche présentée lors de la conférence : 37e Journée de la Recherche du POES et de la Division d'Orthopédie de l'Université de Montréal (Montréal, QC, Canada, 18 mai 2017)P. Laurent, T. Cresson, J. R. Dadour, J. Clément, N. J. Bureau, N. Hagemeister, C. Vazquez, J. A. de Guise. 2016 « An evaluation platform for segmentation algorithms :An application to femoral head X-RAY images ». P. Laurent, T. Cresson, N. Hagemeister, Carlos Vázquez, Jacques A. de Guise. 2016 « Plateforme d'évaluation d'algorithmes de traitement d'images médicales ». Affiche présentée lors de la conférence : 36e Journée de la Recherche du POES et de la Division d'Orthopédie de l'Université de Montréal (Mon",
  "content_length": 36411,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:17"
}