{
  "name": "Carlisle Elwidge George",
  "homepage": "http://www.eis.mdx.ac.uk/staffpages/cgeorge",
  "status": "success",
  "content": "Carlisle George Profile Dr. Carlisle George is a lawyer (Barrister) and computer scientist. Among other qualifications, he holds a Doctorate (PhD) in Computer Science from the University of London (Goldsmiths), a Masters degree (LLM) in Information Technology & Communications Law from the London School of Economics, and an MBA from Middlesex University. He is qualified as a Barrister and was called to the Bar of England and Wales at Lincoln's Inn (London) and the Bar of the Eastern Caribbean Supreme Court (St Lucia). He is currently an Associate Professor at Middlesex University (London) and has previously worked at several higher education institutions including: Singapore Institute of Management, Northumbria University and The London School of Economics and Political Science (Law Department). Dr. George is the author of many academic publications focusing on his research interests that include: legal aspects of eHealth, privacy and data protection, information technology law, Internet law, intellectual property law, and legal aspects of digital forensics. He has co-edited two books focusing on legal, ethical, social and governance aspects of eHealth and medical informatics respectively. He has been involved in several EU funded research projects as a senior legal expert and/or researcher. Since 2011 he has led the organisation of international workshops on legal, ethical, social and governance aspects of Health IT at Middlesex University. Dr. George has also been actively involved in numerous external academic activities including as an invited conference speaker, legal consultant, conference programme committee member, workshop facilitator and member of the editorial board of the International Journal of Electronic Security and Digital Forensics. He is also a Fellow of the Higher Education Academy (FHEA) and has served as an external examiner for several universities. He is a member of several professional bodies including the Honourable Society of Lincoln's Inn and the International Federation for Information Processing (IFIP) Working Group 9.2. Expertise: Information Technology Law; Privacy and Data Protection; Legal Aspects of Digital Forensics; Legal aspects of eHealth/mHealth/Health Informatics; Legal Aspects of Data Science and AI (Machine Learning); Internet Law; eCommerce Law; Corporate Compliance and Financial Crime Prevention Education/Qualifications PhD (Computer Science): University of London, Goldsmiths LLM (IT & Communications Law): London School of Economics MBA Middlesex University BVC: BPP Law School PGDip(Law): Nottingham Law School PGCert(HE): Middlesex University BSc (Computer Science & Mathematics): University of the West Indies Dip(Financial Crime Prevention): International Compliance Association Barrister: Lincoln's Inn, London Barrister & Attorney-at-Law: Eastern Caribbean Supreme Court FHEA: Fellow of the Higher Education Academy Teaching Current Teaching (Postgraduate modules) Legal and Ethical Aspects of Data Science and AI Legal and Ethical Aspects of Emerging Technologies Digital Business and Data Compliance Digital Compliance in Legal Practice Research Research Interests Legal and Regulatory Aspects of eHealth/mHealth Privacy and Data Protection Internet/cyber law and Regulation (social networks, cybercrime etc) Intellectual Property Rights - focus on digital technologies. Legal Aspects of Digital Forensics Legal Aspects Data Science and Artificial Intelligence (Machine Learning) Doctoral Students (recent) Ademola, A: Investigating the Interoperability of Electronic Health Records and Associated Privacy and Security Issues. Mpungu, C: Investigating the implementation of Digital Forensics Readiness in Wireless Medical Networks Using Specialised Logging. Jusob, F:  A Novel Privacy Framework for the Effective Adoption of mHealth for Monitoring Chronic Disease. Nnawuchu, U: Investigating a Rights-Based Approach to Explanation in AI. (PhD awarded 2025). Bell, S:  A transdisciplinary exploration of (mis)trust and interpretability in the Australian proptech community of practice (D Prof awarded 2023). Vithanwattana, N: Securing mHealth: Investigating the Development of a Novel Information Security Framework. (PhD awarded 2022). Juddoo, S: Investigating the Attainment of Optimum Data Quality in Big Data Health Datasets. (PhD awarded 2022). Research Grants/Funding NIHR Grant: Effectiveness of Surveillance Technologies to Prevent Suicides at High-Risk Locations. EU Project: Directorate for Internal Policies - study on horizontal issues on the area of freedom, security and justice, fundamental rights and citizenship. EU Project: Directorate-General for Migration and Home Affairs - Assessing the completeness and conformity of measures Member States to transpose Directive EU 681/2016 ( âPNR Directiveâ). EU Project: Internal Policies Directorate C - Citizens' Rights and Constitutional Affairs  - A study on the legal and political context for setting up a European Identity document. EU project: European Commission's 7th Framework Programme - VALCRI (Visual Analytics for Sense-making in CRiminal Intelligence analysis) EU Project: Directorate General for Internal Affairs in the framework of the Programme for the Prevention of /and Combating Crime - SAMi2(Semantics Analysis Monitor for Illegal Use of the Internet). EU Project: The European Executive Agency for Health and Consumers (EAHC) study focusing on âAn overview of the national laws on electronic health records in the EU Member States and their interaction with the provision of cross-border eHealth servicesâ. Activities University Activities Associate Professor: Regulation of Information and Communication Technologies Research Convenor (ALERT Research Group) Chair - Ethics Committee (Computer Science). Deputy Chair - University Ethics Committee Member - University Equality & Diversity Committee Research Supervisor (PhD & MSc Students). Programme Leader: MSc Information Systems and Data Management for Business MSc Legal Technology. Membership of Professional Bodies The Society of Lincoln's Inn Society of Lincoln's Inn Bar of St Lucia and the Eastern Caribbean Supreme Court UK Higher Education Academy IFIP Working Group 9.2, Social Accountability and Computing Visiting Academic Distinguished Visiting Scholar - University of Miami Miller School of Medicine, Institute for Bioethics and Health Policy USA. September, 2016 Department of Law, London School of Economics - Jan -Sept 2009 Faculty of Public Administration, University of Ljubljana (Slovenia)- March 2007 Editorial Boards International Journal of Electronic Security and Digital Forensics (IJESDF) Invited talks/Interviews/Panels/Conference & Workshop Programme Committees Organiser: 7th International Health IT Workshop - Emerging Technologies in Healthcare - Legal, Ethical, Social & Governance Aspects. Thursday 26th and Friday 27th June 2025. Middlesex University, London. Invited Speaker: UK-ASEAN Workshop on Partnership in Health Smart Technologies powered by Artificial Intelligence, 24-26 March 2024, Hanoi, Vietnam. Programme Committee Member - Thematic Track on Artificial Intelligence and Law (AIL), EPIA Conference on Artificial Intelligence: EPIA2025; EPIA2024; EPIA2023: EPIA2022; EPIA2021; EPIA2019. Programme Committee Member - Workshop on Legal Issues Intelligent Environments (LIIE'2021), 17th International Conference on Intelligent Environments, June 21-24, 2021,  Dubai. Programme Committee Member - 13th International Conference on Global Security, Safety & Sustainability (ICGS3), 14th -15th January 2021, Virtual Conference. Programme Committee Member - Workshop on Legal Issues Intelligent Environments (LIIE'19), 15th International Conference on Intelligent Environments,  2019, Morocco. Programme Committee Member - 12th International Conference on Global Security, Safety & Sustainability (ICGS3), 16th January 2019, Northumbria University London. Programme Committee Member -  13th International IFIP Summer School - Fairness, Accountability and Transparency in the Age of Big Data,  20-24 August 2018, Vienna, Austria. Organiser - Workshop on \" Developments in ICT and Healthcare - Legal, Ethical & Social Aspects\", Middlesex University, 8th-9th March 2018. Programme Committee Member - Workshop on Legal Issues Intelligent Environments (LIIE'18) at the 14th International Conference on Intelligent Environments, 25th - 26th June, Rome, Italy, 2018. Programme Committee Member -  12th International IFIP Summer School - Privacy and Identity Management, 3- 8 September 2017, Ispra, Italy Programme Committee Member - 11th International Conference on Global Security, Safety & Sustainability (ICGS3), 18th -20th  January 2017, GSM London. Panel Member- special meeting of the North American Center for the Study of Ethics and Health Information Technology. 10th Annual AMIA Policy Invitational, September 21-22, 2016, Bethesda, Maryland, near Washington, D.C. Keynote Speaker and Programme Committee Member - Legal Issues in Intelligent Environments'16 Workshop, 12th-13th September 2016 at 12th International Conference on Intelligent Environments, 14th-16th September 2016, Middlesex University. Senior Legal Expert,  EU-wide study on the legal and political context for setting up a European identity document. Organiser - eHealth Workshop: Legal, Ethical and Social Challenges, Middlesex University, 28th -29th October 2014, Member of Senior Advisory Board and Country Expert - EU-wide study - \"An overview of the national laws on electronic health records in the EU Member States and their interaction with the provisions of cross-border e-health services\", EAHC/2013/Health/06 Programme Committee Member and Chair (IT and Cyber Crime law workshop): International Conference on Global Security, Safety and Sustainability, 9th ICGS3-2013, Williams College, London, 4th-6th December 2013. Programme Committee Member: The 8th International IFIP Summer School on Privacy and Identity Management for Emerging Service",
  "content_length": 32855,
  "method": "requests",
  "crawl_time": "2025-12-01 12:48:51"
}