{
  "name": "Carlo Kopp",
  "homepage": "https://research.monash.edu/en/persons/carlo-kopp",
  "status": "success",
  "content": "Carlo Kopp - Monash University Carlo Kopp public CV View Scopus Profile Carlo Kopp Dr Lecturer, Department of Software Systems & Cybersecurity https://orcid.org/0000-0003-0742-3383 EmailCarlo.Koppmonashedu Accepting PhD StudentsPhD projects<a href=\"https://supervisorconnect.it.monash.edu/\" onclick=\"target='_blank';\">https://supervisorconnect.it.monash.edu/</a> 1996 …2025 Research activity per year Personal profile Biography Carlo Kopp is a Computer Science Lecturer at the Monash University Faculty of Information Technology, Clayton . His primary research activities at Monash are currently in the areas of modelling deceptions in social and biological systems, perceptual and decision modelling, especially using information theory, and cognitive cycle modelling. He remains active in the area of ad hoc networks and associated propagation problems, and in distributed computing. He has previously conducted research in operating systems, ad hoc networks and radio-frequency propagation, radar signature computational modelling, optical communications, and satellite navigation support protocols. His PhD project involved the adaptation of AESA radars for long range digital communications, and modelling associated tropospheric propagation problems for airborne platforms. Dr Kopp has also over two decades of research experience in strategy, including appointments as an Adjunct Research Fellow at Monash Asia Institute (2005-2010) and previously as a Visiting Research Fellow at ADFA@UNSW (2004). Dr Kopp has extensive industry experience as a designer, developer and integrator of: hard real-time embedded software;operating systems internals software, especially Unix device drivers;communications protocols;high speed digital hardware (Emitter Coupled Logic, SPARC motherboards, graphics adaptors, etc);analogue electronic hardware (wideband and optical receivers and transmitters) For four years he was a chief engineer, project manager and engineering manager for an Australian computer manufacturer in Melbourne, as well as managing an ISO9001 accreditation. He also has many years of experience as a computer systems performance analyst, measuring, modelling and benchmarking machines up to mainframe and cluster size. As an industry consultant, he advised on strategic planning, technology futures, tender proposals and evaluations, technology futures, and led new technology demonstration projects. Dr Kopp is a Fellow of the Lean Systems Society, an Associate Fellow of the American Institute of Aeronautics and Astronautics, a Senior Member of the Institution of Electrical and Electronic Engineers. Community service2004 - Present: Editor-in-Chief, Research Lead and Co-founder of Air Power Australia non-profit research organisation 2004 - Present: Multiple submissions to a wide range of Parliamentary Committees, and some US Congressional bodies. 2010 - 2011: Scientific Advisor (NCIS LA / CBS) Episode 3.11 dealing with infrastructure vulnerability to high power electromagnetic events (http://theconversation.edu.au/i-advised-ncis-la-on-e-bombs-but-theyre-not-a-work-of-fiction-5095). Research interestsDr Kopp's current research interests in science include information and game theoretic modelling of deception in social and biological systems, modelling of perceptual problems and cognitive cycles, using information theoretic methods, and modelling the evolutionary impacts of deception and perceptual problems. This research builds on earlier work dealing with information operations, and the Borden-Kopp information theoretic models. Previous research interests include ad hoc networks, especially performance, operating systems security, and radio-frequency propagation problems for terrestrial and airborne ad hoc networks.Supervision interestsInformation and game theoretic modelling of deception in social and biological systems;Modelling perceptual problems using information theoretic methods;Modelling cognitive cycles, using information theoretic methods;Modelling evolutionary impacts of deception and perceptual problems;Modelling ad hoc networks and associated propagation problems;Modelling distributed systems;Medical Informatics and Instrumentation;Monash teaching commitmentDr Kopp has experience as the Chief Examiner for the following units in the Faculty of IT: FIT2020 Network ArchitectureFIT2069 Computer ArchitectureFIT2100 Operating SystemsFIT3142 Distributed ComputingFIT3143 Parallel ComputingFIT3159 Computer ArchitectureFIT5011 Network Design and Performance Dr Kopp has experience as the Lecturer for the following units in the Faculty of IT: FIT1005 Networks and Data CommunicationsFIT3036 Computer Science ProjectFIT2069 Computer ArchitectureFIT2070 Operating SystemsFIT3142 Distributed ComputingFIT3143 Parallel ComputingFIT3159 Computer ArchitectureFIT4002 Software engineering industry experience studio projectFIT5011 Network Design and PerformanceFIT5011 Advanced Network Design Dr Kopp has prior experience as the Chief Examiner / Lecturer / Curriculum Designer for the following legacy and current units in the Faculty of IT: CSE468 Information Conflict Hons ModuleCSE1402 Software DocumentationCSE2324/3324 Computer ArchitectureCSE3141 Real Time Systems DesignCSE3301 Software ProjectCSE4884 Network Design and ManagementCSE5806 Telecommunications ManagementCSE5808 Quality of Service in NetworksFIT1005/2008 Networks and DatacommsFIT2002 Project Management (SIG curriculum development)FIT2022 Computer Systems (Operating Systems)FIT3010 Grid ComputingFIT3165 Computer networks (curriculum design / courseware)FIT4017 Network Design and ManagementFIT4165 Computer networks (curriculum design / courseware)FIT5011 Advanced Network Design Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Doctor of Philosophy, Monash UniversityAward Date: 6 Oct 2000Computer Science, Master of Science (Research), Monash UniversityAward Date: 1 May 1996Electrical Engineering, Bachelor of Engineering (Honours), University of Western AustraliaAward Date: 1 May 1984 Research area keywordsCognitive CyclesModelling DeceptionModelling Perceptual ErrorsAd Hoc NetworksDistributed Computing Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 1996 2003 2005 2007 2008 2010 2012 2025 32 Conference Paper 29 Article 6 Chapter (Book) 3 Book 5 More 2 Other 2 Other contribution 1 Review Article Research output per year Research output per year Ignorance of the crowd: dysfunctional thinking in social networksSeeme, F., Green, D. & Kopp, C., 19 May 2025, In: Frontiers in Communication. 10, 23 p., 1547489.Research output: Contribution to journal › Review Article › Research › peer-review Open AccessFile Defining Measures of Effect for Disinformation AttacksKopp, C., 2024, Human Aspects of Information Security and Assurance: 18th IFIP WG 11.12 International Symposium, HAISA 2024 Skövde, Sweden, July 9–11, 2024 Proceedings, Part I. Clarke, N. & Furnell, S. (eds.). 1 ed. Cham Switzerland: Springer, Vol. 1. p. 180-199 20 p. (IFIP Advances in Information and Communication Technology; vol. 18, no. 1).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Optimizing Renewable Energy Utilization in Cloud Data Centers through Dynamic Overbooking: An MDP-based ApproachChakraborty, T., Kopp, C. & Toosi, A. N., Jan 2024, In: IEEE Transactions on Cloud Computing. 13, 1, p. 1-17 17 p.Research output: Contribution to journal › Article › Research › peer-review 1 Citation (Scopus) Elastic Power Utilization in sustainable micro cloud data centersChakraborty, T., Toosi, A. N. & Kopp, C., 1 Jul 2023, In: IEEE Transactions on Sustainable Computing. 8, 3, p. 465-478 14 p.Research output: Contribution to journal › Article › Research › peer-review 13 Citations (Scopus) Joint host-network power scaling with minimizing VM migration in SDN-enabled cloud data centersChakraborty, T., Toosi, A. N., Kopp, C., Stuckey, P. & Mahet, J., 2020, Proceedings - 2020 IEEE/ACM 13th International Conference on Utility and Cloud Computing, UCC 2020. Brandic, I. & Sakellariou, R. (eds.). Piscataway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, p. 1-12 12 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 2 Citations (Scopus) View all 75 research outputs Prizes Best Paper Award, 3rd Australian Information Warfare and Security Conference 2002Kopp, C. (Recipient), 2002Prize: Prize (including medals and awards) Innovation in Teaching AwardJayasekara, C. (Recipient), Arora, C. (Recipient), Kopp, C. (Recipient) & Lee, V. (Recipient), 21 Nov 2025Prize: Prize (including medals and awards) Outstanding Teaching Award for the Faculty of Information TechnologyKopp, C. (Recipient), 2015Prize: Prize (including medals and awards) Recipient - Australian Industry Certificate AwardKopp, C. (Recipient), 2010Prize: Prize (including medals and awards) Activities Activities per year 1992 1992 1998 2013 2013 4 Membership of an advisory panel/policy group/ board Activities per year Lean Systems Society (External organisation)Kopp, C. (Member)21 Jun 2013Activity: Industry, Government and Philanthropy Engagement and Partnerships › Membership of an advisory panel/policy group/ board IEEE Computer Society (CS) (United States of America) (External organisation)Kopp, C. (Member)1 Nov 1998 → 31 Dec 2011Activity: Industry, Government ",
  "content_length": 10570,
  "method": "requests",
  "crawl_time": "2025-12-01 12:48:50"
}