{
  "name": "Carl K. Chang",
  "homepage": "http://www.cs.iastate.edu/people/carl-chang",
  "status": "success",
  "content": "Carl K Chang | Department of Computer Science Skip to main content Carl K Chang Position Professor Emeritus Contact Email chang@iastate.edu Phone (515) 294-4377 Social Media and Websites Dr. Carl Chang's Homepage Research Area Human Computer Interaction Software Engineering and Programming Languages Systems and Networking Education Ph.D., Computer Science, Northwestern University, 1982 M.S., Computer Science, Northern Illinois University, 1978 B.S., Mathematics, National Central University, 1974 Affiliations Chair Professor, National Central University, Taiwan Carl K. Chang is an Emeritus Professor of Computer Science, Emeritus Professor of Human-Computer Interaction and former Director of Software Engineering Laboratory at Iowa State University. He received a PhD in computer science from Northwestern University in 1982, and worked for GTE Automatic Electric and Bell Laboratories before joining the University of Illinois at Chicago in 1984. He joined Iowa State University in 2002 as Department chair of Computer Science, and completed three terms as its chairman in an eleven-year sprint. His research interests include requirements engineering, net-centric computing, situational software engineering and successful aging. Chang is 2004 President of IEEE Computer Society. Previously he served as the Editor-in-Chief for IEEE Software (1991-94). He received the Computer Society’s Meritorious Service Award, Outstanding Contribution Award, the Golden Core recognition, and the IEEE Third Millennium Medal. In 2006 he received the prestigious Marin Drinov Medal from the Bulgarian Academy of Sciences, and was recognized by IBM with the IBM Faculty Award in 2006, 2007 and 2009. From 2007-2010 he served the Editor-in-Chief of IEEE Computer, the flagship publication of IEEE Computer Society. He is the 2012 recipient of the Richard E. Merwin Medal from the IEEE Computer Society. In 2014, he was elected as a Distinguished Alumnus by the National Central University in Taiwan, and received the 2014 Overseas Outstanding Contribution Award from China Computer Federation (CCF). Chang is a Life Fellow of IEEE, a Fellow of AAAS, and a Life Member of the European Academy of Sciences.",
  "content_length": 2197,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:35"
}