{
  "name": "Carlo Alberto Furia",
  "homepage": "http://bugcounting.net",
  "status": "success",
  "content": "Carlo A. Furia · Homepage Overview ATOM group Publications Talks Teaching Events Carlo A. Furia Software Institute Faculty of Informatics USI Università della Svizzera italiana Via G. Buffi 13 CH-6900 Lugano, Switzerland Homepage: bugcounting.net E-mail: furiac@usi.ch Bluesky: @bugcounting.net I'm an associate professor in the Software Institute part of the Faculty of Informatics of the Università della Svizzera italiana (a.k.a. USI — pronounced \"OO-see\"). My research interests center around developing rigorous techniques and tools to analyze and improve the quality, correctness, and reliability of software and systems. 2025-08-10 Model-Based Testing of an Intermediate Verifier Using Executable Operational Semantics accepted at iFM 2025! 2025-05-16 What Makes a Level Hard in Super Mario Maker 2? accepted at COG 2025! 2024-12-20 Reasoning about Substitutability at the Level of JVM Bytecode accepted at FASE 2025! 2024-12-16 Reasoning About Exceptional Behavior At the Level of Java Bytecode with ByteBack to appear in FAC! About me I have a PhD in Computer Science from the Politecnico di Milano, a Master of Science in Computer Science from the University of Illinois at Chicago, and a Laurea degree in Computer Science and Engineering also from the Politecnico di Milano. Before joining USI, I was an associate professor at Chalmers University of Technology. Before Chalmers, I spent about seven years as senior researcher at ETH Zurich in the remarkable Chair of Software Engineering (don't look for it; it's not there anymore). CV Research Most of my research is in the area of formal methods for software engineering. These include a wide array of models, techniques, methods, and tools to support the analysis, rigorous development, and verification of software and software-intensive systems. Much of my work aims at making formal methods practical and more widely applicable—for example by increasing the level of automation. It often features combinations of diverse techniques to improve versatility and reduce limitations; and thorough empirical evaluations to assess relevance and impact of research outcomes. Aiming to improve the rigor of empirical evaluations, I have also been increasingly interested in using state-of-the-art Bayesian data analysis techniques to analyze software engineering data. My profile on: Google Scholar Citations, DBLP, ORCID, Semantic Scholar, ACM Digital Library, MS Academic Search, and Arnetminer. The ATOM research group page lists the current members of my group. The ATOM software page features some of the tools we developed as part of the group's research. Teaching The latest courses I've been teaching: Fall 2025: Programming fundamentals 1, Software design & modeling Spring 2025: Software analysis (publicly available material from the 2019 edition here) If you're a student looking for a project or thesis topic, feel free to drop me a line. My research page gives you an idea of some of the work I've done, but often there are more specific topics that we can discuss in person. Events Scientific events, such as conferences, I'm currently involved in organizing: PC member of the 27th International Symposium on Formal Methods (FM), Tokyo, Japan. 18–22 May 2026. PC member of FormaliSE 2026, the 14th International Conference on Formal Methods in Software Engineering, co-located with ICSE 2026, Rio de Janeiro, Brazil. 12–13 April 2026. Associate editor of the Empirical Software Engineering (EMSE) journal. Consider submitting your research there! PC member of ASE 2025, the 40th IEEE/ACM International Conference on Automated Software Engineering, Seoul, South Korea. 16–20 November 2025. PC member of the 20th International Conference on Integrated Formal Methods (iFM), Paris, France. 17–18 November 2025. Last updated on 2025-10-19",
  "content_length": 3807,
  "method": "requests",
  "crawl_time": "2025-12-01 12:48:50"
}