{
  "name": "Carmine Ventre",
  "homepage": "https://www.kcl.ac.uk/people/carmine-ventre",
  "status": "success",
  "content": "Carmine Ventre | King's College London Skip to main contentProfessor Carmine Ventre Professor of Computer ScienceChair in Computational FinanceDirector of Informatics Finance HubResearch interestsComputer scienceContact details+44 020 7848 1509 carmine.ventre@kcl.ac.ukBiographyProfessor Carmine Ventre is a Professor of Computer Science and Chair in Computational Finance in the Department of Informatics, King's College London. He was interim Head of the Department of Informatics between September 2024 and July 2025, and the Director of the King's Institute for Artificial Intelligence between May 2023 and May 2025. Professor Ventre’s research interests include algorithmic game theory, microeconomics and the internet, AI for algorithmic trading and finance and cryptography and security. After gaining an MSc in Computer Science, Professor Carmine Ventre was awarded his PhD in 2007, defending a thesis on theoretical advances in the design of incentive-compatible mechanisms. He subsequently worked at the University of Liverpool, as a post-doctoral researcher, and then held academic positions at Teesside University and the University of Essex. Carmine joined King's in September 2019, to lead the Finance research hub in the Department of Informatics. Research Interests Algorithmic game theory, microeconomics and the internet Algorithms and complexity (AI for) algorithmic trading and finance Cryptography and security PublicationsResearchResearchFinance HubThe Finance Hub conducts fundamental and applied research at the intersection of finance and computation, a sector which is colloquially known as FinTech.Distributed Artificial IntelligenceUnderstanding AI in social and economic contexts where an intelligent entity may be interacting with other entitiesClimate & sustainability researchers at King’sKing's researchers working across climate and sustainabilityNewsNews23 June 2025AI in Biosciences WorkshopArtificial Intelligence (AI) is becoming an increasingly important technology for research across all disciplines. In biology many powerful AI tools have been...HealthTechnology & Science14 May 2025King's Institute for Artificial Intelligence appoints new co-DirectorsProfessor Sir Bashir M. Al-Hashimi and Professor Elena Simperl will start in June 2025UniversityTechnology & ScienceSocietyLawHealthBusiness & FinanceArts & Culture04 October 2024Event summary: Grant Development Workshop on Digital SustainabilityIn this summary, we share the main challenges and insights discussed within our workshop on digital sustainability.Business & FinanceHealthSocietyTechnology & Science17 September 2024King's launches 'first-of-its-kind' degree in AI & PhilosophyThe new BSc aims to equip students with technical and critical skills that open doors to careers in tech, government, journalism, business, research and more. Arts & CultureTechnology & Science11 September 2024King's helping businesses understand the benefits of Artificial IntelligenceBusiness owners can enhance their knowledge of Artificial Intelligence (AI) and how it might affect them thanks to a new course from King’s College London.Business & FinanceSocietyTechnology & ScienceUniversity24 June 2024DeepTech Roadshow shines spotlight on UK's Deep Tech IndustryA delegation of US-based Venture Capitalists (VCs) visit Bush House with the Department for Business and Trade.Business & FinanceSocietyTechnology & ScienceUniversity17 January 2024King's academics and industry experts discuss developing AI and 'moving beyond the panic'King’s academics joined policy and industry experts at Science Gallery London on 16 Jan to discuss where we go next with AI development, regulation and policy.Arts & CultureLawTechnology & ScienceUniversitySocietyHealth26 October 2023Expectations for the AI Safety SummitWhat do members of the King’s Institute for Artificial Intelligence community expect from the upcoming summit?Technology & ScienceSociety19 May 2023Professor Carmine Ventre appointed Interim Director of the King's Institute for Artificial IntelligenceProfessor Carmine Ventre has been appointed as the Interim Director of the King’s Institute for Artificial Intelligence.Technology & Science03 February 2022KBS-Mathematics-Informatics Research Discussion on Climate FinanceVirtual meeting held to discuss research collaboration in the field of climate finance. Business & FinanceTechnology & ScienceEventsEvents24AprMechanism Design for Decentralised Justice: Law in the Age of Crowds and Code24 April 2025 09:30 to 20:00Discuss the latest research and applications in decentralised dispute resolution at this one-day conference.Please note: this event has passed.11AprAI and Finance - Collaborative Frontiers11 April 2025 14:00 to 18:00Join this workshop exploring the transformative potential of AI in financial systems.Please note: this event has passed.19SepSustainable Synergies: Uniting King's Expertise for Impactful Grant Ventures: Digital Sustainability19 September 2024 14:00 to 18:00“Sustainable Synergies” is a workshop series hosted by the Centre for Sustainable Business at King’s Business School. This series is designed to harness and...Please note: this event has passed.16JanLiving well with technology: AI and the future16 January 2024 18:30 to 19:45Amidst the rapid changes affecting all industries, how do we navigate the AI revolution?Please note: this event has passed.02MayDavid C. Parkes: Credible Decentralized Exchange Design via Verifiable Sequencing Rules02 May 2023 16:00 to 17:30Please join us for this instalment of the FinWork Blockchain Online Seminar Series with David Parkes from Harvard University.Please note: this event has passed.23MarInformatics Inaugural Lecture: Professors Carmine Ventre and Elena Simperl23 March 2023 17:00 to 19:00Join us to celebrate a special milestone for our new professors and hear about their inspiring career journeys.Please note: this event has passed.23FebClimate Finance Workshop - 23 February 202323 February 2023 12:00 to 17:30Join us for the next Climate Finance Workshop hosted by the Qatar Centre for Global Banking & Finance and the King’s Climate Hub.Please note: this event has passed.22SepClimate Finance Workshop22 September 2022 12:00 to 18:00Join us for the next Climate Finance Workshop hosted by the Qatar Centre for Global Banking & Finance and the King’s Climate Hub.Please note: this event has passed.FeaturesFeatures23 September 2024Meet Professor Carmine Ventre - new interim Head of InformaticsProfessor Carmine Ventre was appointed the interim Head of Department for Informatics, following the departure of Professor Luc Moreau.Technology & ScienceUniversityPublicationsResearchNewsEventsFeaturesResearchFinance HubThe Finance Hub conducts fundamental and applied research at the intersection of finance and computation, a sector which is colloquially known as FinTech.Distributed Artificial IntelligenceUnderstanding AI in social and economic contexts where an intelligent entity may be interacting with other entitiesClimate & sustainability researchers at King’sKing's researchers working across climate and sustainabilityNews23 June 2025AI in Biosciences WorkshopArtificial Intelligence (AI) is becoming an increasingly important technology for research across all disciplines. In biology many powerful AI tools have been...HealthTechnology & Science14 May 2025King's Institute for Artificial Intelligence appoints new co-DirectorsProfessor Sir Bashir M. Al-Hashimi and Professor Elena Simperl will start in June 2025UniversityTechnology & ScienceSocietyLawHealthBusiness & FinanceArts & Culture04 October 2024Event summary: Grant Development Workshop on Digital SustainabilityIn this summary, we share the main challenges and insights discussed within our workshop on digital sustainability.Business & FinanceHealthSocietyTechnology & Science17 September 2024King's launches 'first-of-its-kind' degree in AI & PhilosophyThe new BSc aims to equip students with technical and critical skills that open doors to careers in tech, government, journalism, business, research and more. Arts & CultureTechnology & Science11 September 2024King's helping businesses understand the benefits of Artificial IntelligenceBusiness owners can enhance their knowledge of Artificial Intelligence (AI) and how it might affect them thanks to a new course from King’s College London.Business & FinanceSocietyTechnology & ScienceUniversity24 June 2024DeepTech Roadshow shines spotlight on UK's Deep Tech IndustryA delegation of US-based Venture Capitalists (VCs) visit Bush House with the Department for Business and Trade.Business & FinanceSocietyTechnology & ScienceUniversity17 January 2024King's academics and industry experts discuss developing AI and 'moving beyond the panic'King’s academics joined policy and industry experts at Science Gallery London on 16 Jan to discuss where we go next with AI development, regulation and policy.Arts & CultureLawTechnology & ScienceUniversitySocietyHealth26 October 2023Expectations for the AI Safety SummitWhat do members of the King’s Institute for Artificial Intelligence community expect from the upcoming summit?Technology & ScienceSociety19 May 2023Professor Carmine Ventre appointed Interim Director of the King's Institute for Artificial IntelligenceProfessor Carmine Ventre has been appointed as the Interim Director of the King’s Institute for Artificial Intelligence.Technology & Science03 February 2022KBS-Mathematics-Informatics Research Discussion on Climate FinanceVirtual meeting held to discuss research collaboration in the field of climate finance. Business & FinanceTechnology & ScienceEvents24AprMechanism Design for Decentralised Justice: Law in the Age of Crowds and Code24 April 2025 09:30 to 20:00Discuss the latest research and applications in decentralised dispute resolution at this one-day conference.Please note: this event has passed.11AprAI and Finance - Collaborative Frontiers11 April 2025 14:00 to 18:00Join this workshop exploring the transformati",
  "content_length": 12054,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:19"
}