{
  "name": "Carole J. Twining",
  "homepage": "http://personalpages.manchester.ac.uk/staff/carole.j.twining",
  "status": "success",
  "content": "Carole Twining' Home Page Dr Carole Janet Twining Book Current Interests CV Publications Wedding Album MyCopy Version of the Book If your university has full electronic access, our book is available online at Springer. You will then also have the option to purchase a  grayscale printed version of the text, bound within a colour softcover, for only 24.95 (currency varies but price doesn't seem to!). Since I didn't include that many colour figures, this can be an affordable way to have your own copy of this book. Pop on a plastic reading cover, and it should stay unbattered for many years. Alternatively, if you're a bit persistent, you can download the pdf chapter by chapter, glue them all together, crop the margins off, and then have a copy of the book that you can view happily on your Kindle. Works for me! Our Book Statistical Models of Shape: Optimisation and Evaluation Rhodri Davies, Carole Twining and Chris Taylor Published by Springer. This book is intended to be a comprehensive and up-to-date account of the optimisation approach to groupwise correspondence for shapes, with particular focus on the Minimum Description Length  approach. It provides an in-depth treatement of the whole field, from the basics of statistical shape models, to the most recent work on fluid-based regularization on the shape surface (IPMI 2007). As well as a complete mathematical treatment, it also includes extensive details on implementation, with pseudocode provided for the most important algorithms. The question of evaluating such models in the absence of ground truth data is also included. At around 300 pages, with 9 chapters and 2 mathematical appendices (you know me chaps, I had to include those!), this is intended to be THE work on the subject. Tired of trying to find all those old papers which contained bits and pieces of what we were doing, tired of trying to make sense of the historical development of our ideas -- you need worry no longer! Soon you'll be able to go to the Springer website, and order a nice copy for yourself . As a principal author, I can highly recommend it! My Past: Full CV  in pdf format, if you're really interested! Current Position: Lecturer & Senior Scientist: Joint position in the Schools of Computer Science, and ISBE (now known as Imaging Science) in the Medical School. Former Post: Senior Scientist & RCUK Research Fellow in the Division of Imaging Science and Biomedical Engineering, University of Manchester. Current Areas of Interest Non-Rigid Registration : groupwise approaches to registration, representing diffeomorphic warps, constructing metrics on the diffeomorphism group and statistical analysis on curved spaces. Differential Geometry: Differential geometry of both continuous and discrete spaces, as it relates to issues that arise in image and shape registration, and analysis of registrations. For instance, working with discrete representations of surfaces, all sorts of issues arise when you try to consider flow on such surfaces, or deforming such surfaces. Sometimes, just taking the continuum version, and approximating all the derivatives by finite-differences isn't enough. Hence we got involved in the trying to construct a differential geometry intrinsic to such surfaces. Machine Learning: Information-Theoretic Approaches to practically anything..... Kernel Methods Publications: also upcoming and papers in preparation. 2016LATEST: Principal Autoparallel Analysis: Data Analysis in Weitzenbock Space. Joint work with Professor Stephen Marsland, Massey NZ.Steve presented a talk on this at the recent ICML (International Conference on Machine Learning, New York, June 19th-24th 2016) workshop on Geometry in Machine Learning (GIMLI). Slides available here. A related paper  is also available here. 201520142013 2012 In Preparation: Data-Driven Evaluation of Non-Rigid Registration via Image Modelling: Does what it says on the tin, how to evaluate registration without ground-truth. Preliminary version of this work can be found HERE. We have done quite a bit more work since then, and it's turned out rather well. Watch this space. Discrete Differential Geometry: The Non-Planar Quadrilateral Mesh. Carole Twining and Stephen Marsland Abstract: We consider the problem of constructing a discrete differential geometry defined on non-planar quadrilateral meshes. While such meshes are used in applications such as computation for electromagnetism, fluid mechanics, and image analysis, the majority of analysis has focused on triangular meshes. We consider two approaches: discretizing the tensor calculus, and a discrete, mesh version of differential forms. Whilst these two approaches are equivalent in the continuum, we show that this is not true in the discrete case. Nevertheless, we show that it is possible to construct mesh versions of the Levi-Civita connection (and hence the tensorial covariant derivative and the associated covariant exterior derivative), the torsion, and the curvature. We show how discrete analogs of the usual vector integral theorems are constructed, in order that the appropriate conservation laws for physical theories can be cast in a form that holds exactly on the mesh, rather than only as approximations to a continuum limit. We demonstrate the success of our method by constructing a mesh version of classical electromagnetism, and discuss how our formalism could be used to deal with other physical models, such as fluids. Phys. Rev. E 85, 066708 (2012) – Published June 27, 2012. 2011 Metrics, Connections, & Correspondence: The Setting for Groupwise Shape Analysis Carole Twining, Stephen Marsland, and Chris Taylor Abstract: This paper considers the general problem of the analysis of groups of shapes, and the issue of correspondence in that context. Many papers have been published on the topic of pairwise shape distances and pairwise shape similarity measures. However, most of these approaches make the implicit assumption that the methods developed for pairs of shapes are then sufficient when it comes to the problem of analyzing groups of shapes. In this paper, we consider the general case of pairwise and groupwise shape analysis within an infinite-dimensional Riemannian framework. We show how the issue of groupwise or pairwise shape correspondence is inextricably linked to the issue of the metric. We discuss how data-driven approaches can be used to find the optimum correspondence, and demonstrate how different choices of objective function lead to different groupwise correspondence, and why this matters in terms of groupwise modelling of shape. Presented as an oral at EMMCVPR2011. This paper looks at what correspondence means in the context of infinite-dimensional Riemannian geometry, and how the connection comes in. The take-home message is that you can't really just forget about the correspondence, or decide how to assign it beforehand, without having undesirable effects when it comes to analysing groups of shapes. It tries to make a link between our intuitive notions of shape similarity, shape difference, and shape change, and the concept of a connection in Riemannian geometry. Note the use of connection here, whereas the more usual focus is on the metric, then the Levi-Civita connection for that metric comes along for free. We are trying to say that the connection itself matters, because that is where the correspondence actually comes into the maths. Proceedings published in Lecture Notes in Computer Science, Springer, volume 6819, Boykov, Y.; Kahl, F.; Lempitsky, V.; Schmidt, F.R. (Eds.), pages 399-412. Carole J. Twining, Christopher J. Taylor, \"Specificity: A Graph-Based Estimator of Divergence,\" IEEE Transactions on Pattern Analysis and Machine Intelligence, Volume 33, Issue 12, pages 2492\t- 2505, 2011. This is a much-expanded version of the preliminary work HERE. The earlier work just considered the very simplest case, we have expanded on this to do the interesting ones as well! 2009-2010 Rhodri H. Davies, Carole J. Twining, Tim Cootes, and Chris Taylor, Building 3D Statistical Shape Models by Direct Optimisation, IEEE Transactions on Medical Imaging, Accepted for publication, Pdf available HERE Timothy F. Cootes, Carole J. Twining, Vladimir S. Petrović, Kolawole O. Babalola, and Christopher J. Taylor, Computing Accurate Correspondences Across Groups of Images, IEEE Transactions on Pattern Analysis and Machine Intelligence, Accepted for publication, Abstract available HERE 2008 Rhodri H. Davies, Carole J. Twining, and Chris Taylor, Groupwise surface correspondence by optimization: Representation and regularization, Medical Image Analysis, Volume 12, Issue 6, December 2008, Pages 787-796 Special issue on information processing in medical imaging (IPMI) 2007. Carole J. Twining and Stephen Marsland Constructing an atlas for the diffeomorphism group of a compact manifold with boundary, with application to the analysis of image registrations Journal of Computational and Applied Mathematics, Volume 222 ,  Issue 2  (December 2008), Pages 411-428. Stephen Marsland, Carole J. Twining and Chris J. Taylor A minimum description length objective function for groupwise non-rigid image registration Image and Vision Computing, Volume 26, Issue 3, 3 March 2008, Pages 333-346 T.F. Cootes, C.J. Twining, K.O. Babalola and C.J. Taylor Diffeomorphic statistical shape models Image and Vision Computing, Volume 26, Issue 3, 3 March 2008, Pages 326-332. 2007 Carole J. Twining, Rhodri H. Davies, Christopher J. Taylor Non-parametric Surface-Based Regularisation for Building Statistical Shape Models Talk presented at IPMI 2007, Kerkrade, the Netherlands.  LNCS 4584 Springer 2007, ISBN 978-3-540-73272-3, pages 738-750. Rhodri Davies, Carole Twining, Tomos Williams, Chris Taylor Group-wise Correspondence of Surfaces Using Non-parametric Regularisation and Shape Images Proceedings of ISBI 2007 Vladimir Petrovic, Tim Cootes, Carole Twining, Chris Taylor Simultaneous registration, segmentation and modelling of struc",
  "content_length": 21904,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:22"
}