{
  "name": "Carolyn R. Watters",
  "homepage": "https://www.dal.ca/about-dal/leadership-and-vision/leadership-team/carolyn-watters.html",
  "status": "success",
  "content": "About | Welcome to Dalhousie University Skip to main content Close Donate Go to Libraries Campus Maps Campus Tours People Directory Events Info for New Students Current Students Faculty and Staff Alumni Donors Community Employers Media Login myDal DalOnline Brightspace DalU OpenDal Get help with your login About Dalhousie University combines high-impact research, meaningful teaching, and a deep sense of social responsibility that inspires our diverse community to make a difference here in Nova Scotia, across Canada, and on the global stage. Where infinite ambition meets global impact Located on Canada’s welcoming East Coast, with campuses in the vibrant oceanside city of Halifax and an Agricultural Campus in the town of Truro, Dalhousie welcomes 21,000 students from across the country and more than 115 countries around the world. We are Nova Scotia’s leading research-intensive university, with 13 faculties that expand understanding through teaching excellence and a drive for discovery resulting in more than $210 million in external research funding each year. Dalhousie’s blend of groundbreaking research with outstanding teaching and makes for a unique and collaborative environment that empowers all our students, professors, researchers, and staff to achieve excellence and make a positive impact for our province, our country, and our world. Dalhousie University is located in Mi’kma’ki, the ancestral and unceded territory of the Mi’kmaq. We are all treaty people. We recognize African Nova Scotians are a distinct people whose histories, legacies, and contributions have enriched Mi’kma’ki for over 400 years. Kjipuktuk and We’kwampetitk are the ancestral Mi’kmaq territories known today as Halifax and Truro. Explore our Indigenous connections Discover our African Nova Scotian connections Dal at a glance 300+ Programs Top 12 Canadian universities $250M+ Annual research funds administered Top university in Atlantic Canada 155,000+ Alumni around the world Gold Rating in Sustainability Discover more facts, figures, and rankings Get to know us Leadership and governance Effective governance is critical for Dalhousie to advance our mission and our shared priorities. Campus locations Explore our campuses in Halifax, Truro, and Yarmouth, Nova Scotia; and in Saint John, New Brunswick. Our story Founded in Halifax, Nova Scotia, in 1818, Dalhousie has been delivering innovative and meaningful teaching and research for more than 200 years. Mission, vision, and values Dalhousie University's mission, vision, and values are focused on respect and inclusion in all of our academic, research, and civic priorities. Where reflection meets action Our commitment to achieving inclusive excellence is brought to life by championing equity, diversity, inclusivity, and accessibility (EDIA) in how we interact with our community every day. This commitment is driven by a strong responsibility to address historical and ongoing systematic inequalities locally, regionally, nationally, and beyond. Learn more about our commitment to EDIA Toward a sustainable future Dalhousie is committed to expanding understanding and adherence to the core principles of sustainability, advancing knowledge about climate change, and helping to catalyze evidence-based solutions through our teaching, research, and service that are consistent with the important work of fulfilling the United Nations Sustainable Development Goals (SDGs) for 2030. Learn about sustainability at Dal Discover our impact on the UN SDGs Expanding our partnerships at home and abroad Our global connections enhance the quality and impact of education and research at local, national, and international levels. Closer to home, we embrace our ongoing responsibility to engage, connect with, and support the community. Explore our global partnerships Learn more about community engagement More to explore In this section > Mission, vision, and values Leadership and governance Our story Campus locations Contact us University prospectus Strategic plan University policies",
  "content_length": 4044,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:26"
}