{
  "name": "Carolin Wienrich",
  "homepage": "https://www.mcm.uni-wuerzburg.de/piis/people/prof-dr-carolin-wienrich",
  "status": "success",
  "content": "Prof.in Dr. Carolin Wienrich - Psychologie Intelligenter Interaktiver Systeme Intern Animation stoppen Psychologie Intelligenter Interaktiver Systeme NewsPeopleResearchTeachingInfrastructureHCI Mentoring Circle Prof.in Dr. Carolin Wienrich Leitung e-Mail: carolin.wienrich(at)uni-wuerzburg.de Tel.: +49 931 31 90675 Psychologie Intelligenter Interaktiver Systeme Julius-Maximilians-Universität Würzburg Institut für Mensch-Computer-Medien Am Hubland, Campus Nord Emil-Fischer-Straße, Geb. 50 97074 Würzburg Deutschland 2010 Psychology Degree Martin Luther University Halle/Wittenberg 2015 Interdisciplinary PhD TU Berlin | Faculty of Traffic and Machine Systems 2016 - 2022 JProfessor for Human-Technology Systems JMU Würzburg | Faculty of Human Sciences 2019 - 2021 Deputy Professorship Computer Vision JMU Würzburg | Faculty of Mathematics and Computer Science Since 2020 Co-director XR HUB Würzburg Since 2022 Professor for Psychology of Intelligent Interactive Systems JMU Würzburg | Faculty of Human Sciences 2023 Presentation for the Federal Commissioner for Data Protection and Information Security, 11.10.2023 Title: The Metaverse - A look into the future Presentation and Panel Discussion at the German Ethics Council, 15.11.2023 Title: Metaverse - Psychological Consequences Presentation and Demo with members of the German parliament, 16.06.2023 Title: \"Human-Centered AI and GPT in the Metaverse\" Interview and Demo within the Bavarian AI Conference AI. BAY, 23.02.2023 Title: \"There's a lot of future potential in interacting with voice assistants\" Lecture at the For..Net Symposium, 20.04.2023 Title: \"eXtended Reality as Key for Human-AI Interaction\" 2020 Forschungspreis der Fakultät für Humanwissenschaften (JMU Würzburg) 2019 Preis für Gute Lehre Bayern (Freistaat Bayern) 2018 Best Impact Deutsches Institut für Virtual Reality Kontakt Professur für Psychologie intelligenter interaktiver Systeme Campus Hubland Nord Emil-Fischer-Straße 50 97074 Würzburg E-Mail Suche Ansprechperson Hubland Nord, Gebäude 50 StartseiteUniversitätStudiumForschungLehreEinrichtungenInternationalUniversitätFristen und TermineStudienangebotNachrichtenKarriereportalBeschäftigteVerwaltungsABCAmtliche VeröffentlichungenServiceUniversitätsbibliothekIT-DiensteHochschulsportStudienberatungPrüfungsamtStudierendenkanzleiStudierendenvertretungCareer CentreDiensteWueStudyWueCampusVorlesungsverzeichnisOnline-Bewerbung und Online-EinschreibungKatalog der BibliothekKontaktTelefon- und AdressverzeichnisStandorte und AnfahrtPresseStudienberatungStörungsannahmeTechnischer BetriebHilfe im Notfall Seitenoptionen Sitemap Bildnachweise Nach oben Letzte Änderung: 13.02.2025 Seite: 179801/788 Bildnachweise ImpressumDatenschutzBarrierefreiheit",
  "content_length": 2731,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:22"
}