{
  "name": "Carole Anne Goble",
  "homepage": "http://www.manchester.ac.uk/research/Carole.goble",
  "status": "success",
  "content": "Carole Goble - Research Explorer The University of Manchester Carole Goble Prof Professor, Information Management https://orcid.org/0000-0003-1219-2137 Personal profile OpportunitiesPostgraduate Opportunities Carole has supervised 7 PhD's to completion and 7 MPhil candidates. She currently supervises 3 PhD students. Carole is looking for students with initiative who are able to develop an independent research agenda. She is particularly looking for students interested in the following areas: - Novel methods for presenting complex provenance logs of workflows runs - AI approaches to workflow sharing and reusing - Mass curation of scientific protocols and workflows using AIMy groupResearch Group(s)Data Science InstituteeScienceInformation ManagementLazarusBiographyCo-Director Manchester eScience Lab (founded since 2001), a multi-disciplinary group of scientific informaticians, computer science researchers and software engineers that focus on data intensive e-Science. Joint Head of Node ELIXIR UK - 29 organisations (since 2016) - ELIXIR Europe, European Research Infrastructure for Life Science Data  -25 countries Co-director Federated Analytics, Health Data Research UK  (since 2022) Co-founder Software Sustainability Institute UK (since 2010) Co-founder FAIRDOM Consortium for RDM in Life Science (since 2018) Co-founder EVERSE European Virtual Institute for Research Software Excellence (since 2023) Co-lead FAIR Computational Workflows WG International Workflows Community Initiative (since 2022) Co-founder BioFAIR: A UK National Data and Method BioCommons (Chair RTAG Committee since 2025) Director Digital Infrastructure IBISBA, European Research Infrastructure for Industrial Biotechnology and Biomanufacturing (2017-2024) Node Director Open Middleware Infrastructure Institute UK (2006-2010) Selected Current Committees: UKRI Advisory Group for Digital Research Infrastructure (AGD) (UK)G7 Open Science WG, UK appointed expert memberSchloss Dagstuhl – Leibniz Center for Informatics SAB (Germany)Helmholtz Association Metadata Collaboration SAB (Germany)Sage Bionetworks Board of Directors (USA)National Dutch e-Science Center eSAC (Netherlands) Awards and Fellowships: Microsoft Research Jim Gray e-Science Award (2008); Commander of the Order of the British Empire for services to science (2014)The Carole Goble Medal for Outstanding Doctoral Paper in Computer Science, University of Manchester (awarded annually  since 2019)Doctorem Honoris Causa, Data Science, Maastricht University (2018) Microsoft Connect Vision Award (2013)Fellow of the Royal Academy of Engineering (2010)Fellow of the British Computing Society (2005) Ranking ScholarGPS Highly Ranked Scholar – Lifetime (62 Bioinformatics)Research.com Computer Science Leader (2023,2024) -26th in UKDeep Knowledge Analytics Top 100 AI Leaders in Drug Discovery and Advanced Healthcare (2019)Research interestsLeader in Digital Research Infrastructures, translating technical innovations in distributed computing, semantic and metadata technologies, data and software sharing and computational workflows into FAIR and Open information solutions for scientists. Framed as \"translational computer science\" for Digital Research Infrastructure and Scholarly Communications, she is internationally recognised for her work on semantic web, metadata, ontologies, distributed computing and workflow management systems, and Virtual Research Environments for scientists. She collaborates with researchers world-wide, from many disciplines: Life Sciences, Biodiversity, Astronomy, Chemistry, Health informatics, Social Science and Digital Libraries. A global leading advocate and thought leader for FAIR and Open Research; she is a co-author of the seminal paper on the FAIR principles for scientific data  and for FAIR Computational workflows. She has pioneered work in semantically enabled middleware using FAIR Digital Objects, notably Bioschemas and RO-Crate. She currently runs open science global services WorkflowHub, ELIXIR-TeSS, FAIRDOM-SEEK, RDMkit and RSQKit. Carole is facinated by the social dynamics of how scientists and technologists work together to make and use Digital Research Infrastructure, and the cultural challenges for FAIR and Open Research. Notable pioneering results: First ontology driven integration platform for bioinformatics (TAMBIS - 1996) First open source computational workflow system for life science (Taverna - 2005)First open source computional workflow sharing platform (myExperment - 2007)First web service registry for life science services (BioCatalogue - 2007)First ontology for bioinformatics (the myGrid ontology, 1996) Early Knowledge Graph technology for the pharmaceutical industry (open PHACTS - 2011) Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): External positionsCo-Director Federated Analytics, Health Data Research UK2022 → …Joint Head of Node, ELIXIR UK2016 → … Research Beacons, Institutes and PlatformsDigital FuturesChristabel Pankhurst Institute Fingerprint Dive into the research topics where Carole Goble is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Annotation Computer Science 100% Ontology Computer Science 94% Scientific Workflow Computer Science 89% Web Service Computer Science 68% Semantic Web Computer Science 62% Workflow System Computer Science 49% Linked Data Computer Science 47% Interoperability Computer Science 46% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 207 Conference contribution 163 Article 17 Chapter 8 Other report 47 More 8 Paper 7 Abstract 7 Poster 5 Preprint 4 Software 3 Commentary/debate 2 Book 2 Data set/Database 2 Web publication/site 2 Other contribution 1 Conference article 1 Editorial 1 Review article 1 Doctoral Thesis 1 Working paper Research output per year Research output per year A terminology for scientific workflow systemsSuter, F., Coleman, T., Altintaş, İ., Badia, R. M., Balis, B., Chard, K., Colonnelli, I., Deelman, E., Di Tommaso, P., Fahringer, T., Goble, C., Jha, S., Katz, D. S., Köster, J., Leser, U., Mehta, K., Oliver, H., Peterson, J.-L., Pizzi, G. & Pottier, L. & 6 others, Sirvent, R., Suchyta, E., Thain, D., Wilkinson, S. R., Wozniak, J. M. & Ferreira da Silva, R., 1 Jan 2026, In: Future Generation Computer Systems. 174, p. 107974Research output: Contribution to journal › Article › peer-review An Ecosystem of Services for FAIR Computational WorkflowsWilkinson, S. R., Gustafsson, J., Bacall, F., Belhajjame, K., Capella, S., Gonzalez, J. M. F., Tande, J. F., Gadelha, L., Garijo, D., Grubel, P., Grüning, B., Khan, F. Z., Kanwal, S., Leo, S., Owen, S., Pireddu, L., Pouchard, L., Rodríguez-Navas, L., Serrano-Solano, B. & Soiland-Reyes, S. & 5 others, Vilne, B., Williams, A., Wouters, M. A., Coppens, F. & Goble, C., 21 May 2025, (Submitted) Workflow Systems for Scientific Data Analysis: (working title by FONDA). Deutsche Forschungsgemeinschaft (DFG)Research output: Chapter in Book/Conference proceeding › Chapter File Best Practice 100% Persistent Identifier 100% Interoperability 50% Reproducibility 50% Workflow System 50% 2 Downloads (Pure) Applying the FAIR Principles to Computational WorkflowsWilkinson, S. R., Aloqalaa, M., Belhajjame, K., Crusoe, M. R., Kinoshita, B. D. P., Gadelha, L., Garijo, D., Gustafsson, O. J. R., Juty, N., Kanwal, S., Khan, F. Z., Köster, J., Gehlen, K.P.-V., Pouchard, L., Rannow, R. K., Soiland-Reyes, S., Soranzo, N., Sufi, S., Sun, Z. & Vilne, B. & 3 others, Wouters, M. A., Yuen, D. & Goble, C., 24 Feb 2025, In: Scientific Data. 12, 328.Research output: Contribution to journal › Article › peer-review Open AccessFile Reproducibility 100% Digital Object 100% System Developer 100% Workflow Management System 100% System Provider 100% 48 Downloads (Pure) A Terminology for Scientific Workflow SystemsSuter, F., Coleman, T., Altintaş, İ., Badia, R. M., Balis, B., Chard, K., Colonnelli, I., Deelman, E., Tommaso, P. D., Fahringer, T., Goble, C., Jha, S., Katz, D. S., Köster, J., Leser, U., Mehta, K., Oliver, H., Peterson, J.-L., Pizzi, G. & Pottier, L. & 6 others, Sirvent, R., Suchyta, E., Thain, D., Wilkinson, S. R., Wozniak, J. M. & da Silva, R. F., 9 Jun 2025, (Submitted) arXiv.Research output: Preprint/Working paper › Preprint File Workflow System 100% Scientific Workflow 100% Workflow Management System 100% Scientific Application 22% Research Problem 11% 8 Downloads (Pure) COVID-19: An exploration of consecutive systemic barriers to pathogen-related data sharing during a pandemicYehudi, Y., Hughes-Noehrer, L., Goble, C. & Jay, C., 8 Jan 2025, In: Data & Policy. 7, e4.Research output: Contribution to journal › Article › peer-review Open Access Social Isolation 100% View all 442 research outputs Projects 9 Active 35 Finished Projects per year TREvolution DARE UK Transformational Programme: core componentsSoiland-Reyes, S. (PI) & Goble, C. (CoI)1/03/25 → 31/03/27Project: Research CLIMATE-ADAPT4EOSC: FAIR Data and Innovative Services for Magnifying the Climate Adaptation potential of European CommunitiesSoiland-Reyes, S. (PI) & Goble, C. (CoI)1/01/25 → 31/12/28Project: Research Europeans 100% OSCARS - mTeSS-X: Scaling training portal federation for RIs through Multi-tenanting and ExchangeGoble, C. (PI)1/10/24 → 30/09/26Project: Research Research Infrastructure 100% Open Source 66% Research Community 33% ELIXIR-STEERSGoble, C. (PI)1/02/24 → 31/01/27Project: Research Ste",
  "content_length": 16434,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:24"
}