{
  "name": "Caroline Jay",
  "homepage": "https://www.research.manchester.ac.uk/portal/Caroline.Jay.html",
  "status": "success",
  "content": "Caroline Jay - Research Explorer The University of Manchester Caroline Jay Prof Professor of Computer Science, Human Computer Systems https://orcid.org/0000-0002-6080-1382 Personal profile BiographyCaroline Jay is a Professor of Computer Science and Head of Research in the School of Engineering. She is qualified as both a Psychologist (BA, CPsychol) and Computer Scientist (MSc, PhD), and undertakes research crossing these domains. She is Research Director of the Software Sustainabilty Institute, and a keen advocate for open and reproducible science. Caroline founded the Manchester arm of the BBC Data Science Research Partnership, and the Human-Centred Design theme of the 'Digital Futures' initiative. She was named in the Guardian as one of the 2022 Top 50 Women in Engineering.Research interestsCaroline's research focuses on software engineering and human-computer interaction, combining her expertise in computer science and psychology. She uses empirical methods to study and innovate in: Health Science and MedicineCreative Media and TelevisionKnowledge Representation and Software EngineeringMy groupHuman-Computer Systems Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research Beacons, Institutes and PlatformsDigital FuturesInstitute for Data Science and AISustainable FuturesChristabel Pankhurst InstituteManchester Environmental Research InstituteCreative Manchester Fingerprint Dive into the research topics where Caroline Jay is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Ontology Computer Science 100% Decision-Making Computer Science 79% Neural Network Computer Science 78% Web Page Computer Science 61% Eye Movement Psychology 61% Practitioners Psychology 57% Interview Study Computer Science 51% screen reader Computer Science 50% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 87 Article 49 Conference contribution 8 Paper 5 Chapter 13 More 2 Commentary/debate 2 Other contribution 2 Preprint 1 Commissioned report 1 Other 1 Poster 1 Meeting Abstract 1 Review article 1 Web publication/site 1 Working paper Research output per year Research output per year An evidence-based guidance framework for neural network system diagramsMarshall, G., Freitas, A. & Jay, C., 18 Mar 2025, In: PL o S One. p. 1-59Research output: Contribution to journal › Article › peer-review Open Access Neural Network 100% Scholarly Publication 50% Neural Network Architecture 25% User Experience 25% Qualitative Feedback 25% Contrasting attitudes towards current and future artificial intelligence applications for computerised interpretation of electrocardiograms: a clinical stakeholder interview studyHughes-Noehrer, L., Channer, L., Strain, G., Yates, G., Body, R. & Jay, C., 3 Jul 2025, In: JAMIA Open. 8, 4Research output: Contribution to journal › Article › peer-review Open Access COVID-19: An exploration of consecutive systemic barriers to pathogen-related data sharing during a pandemicYehudi, Y., Hughes-Noehrer, L., Goble, C. & Jay, C., 8 Jan 2025, In: Data & Policy. 7, e4.Research output: Contribution to journal › Article › peer-review Open Access Social Isolation 100% Determinants of mistrust in digital health research and approaches to address them among Muslim ethnic minorities living in the United Kingdom: A qualitative studyAli, S. M., Saiyed, M. M., Mcavoy, A., Meckin, R., Jay, C. & Van Der Veer, S., 9 Jul 2025, (Accepted/In press) In: International Journal for Equity in Health.Research output: Contribution to journal › Article › peer-review Health Care Personnel 100% Health Equity 100% Bite 100% UK 100% Health Research 100% Effects of Alternative Scatterplot Designs on BeliefStrain, G., Stewart, A., Jay, C., Rutherford, C. & Warren, P. A., 28 Apr 2025, p. 1-13. 13 p.Research output: Contribution to conference › Paper › peer-review Open AccessFile Behavior (Neuroscience) 100% 37 Downloads (Pure) View all 162 research outputs Projects 2 Not started 4 Active 11 Finished Projects per year Global-scale modelling of urban climate projection and adaptation based on local climate zonesZheng, Z. (PI), Jay, C. (CoI), Lindley, S. (CoI) & Topping, D. (CoI)1/07/25 → 30/06/28Project: Research Urban Climate 100% Local Climate Zone 100% Environmental Research 56% Climate Projection 50% Earth System Model 43% ECG-X: ECG-X: Making ECGs explainable with colour to support self-monitoring and early detection of life-threatening heart conditionsJay, C. (PI) & Body, R. (CoI)1/06/23 → 31/05/26Project: Research Electrocardiogram 100% Self Monitoring 83% Electrical Activity 41% Early Detection 41% Visualization Technique 41% DSH: NERC Digital Solutions ProgrammeKingston, R. (PI), Evans, J. (CoI), Lindley, S. (CoI), Ainsworth, J. (CoI), Brass, A. (CoI), Jay, C. (CoI), Coe, H. (CoI), Topping, D. (CoI) & Sharmina, M. (CoI)1/10/21 → 30/09/26Project: Research Infrastructure Provider 100% Digital Platform 100% Informed Decision 100% Entry Point 100% Technology Sector 100% Turing AI Fellowship: Human-AI Research Teams - Steering AI in Experimental Design and Decision-Making\t Kaski, S. (PI), Bristow, R. (CoI), Cai, P. (CoI), Jay, C. (CoI) & Peek, N. (CoI)1/10/21 → 30/09/26Project: Research Machine Learning 100% Approximation (Algorithm) 57% Differential Privacy 53% Artificial Intelligence 52% Neural Network 43% Fusion21 Ltd - Knowledge Exchange PartnershipMu, T. (PI), Embury, S. (CoI), Jay, C. (CoI) & Chowdhury, I. N. (PI)Project: Research Knowledge Exchange 100% View all 17 projects Prizes Better World AwardsBrass, A. (Recipient), Cruickshank, S. (Recipient), Hassan, L. (Recipient), Jay, C. (Recipient) & Vigo, M. (Recipient), 1 Feb 2017Prize: Other distinction Public Engagement 100% Making a Difference Award for Social ResponsibilityBrass, A. (Recipient), Cruickshank, S. (Recipient), Hassan, L. (Recipient), Jay, C. (Recipient) & Vigo, M. (Recipient), 11 May 2017Prize: Other distinction Public Engagement 100% Activities 1 Organising a conference, workshop, exhibition, performance, inquiry, course etc Activities per year NERC Digital Solutions Hub In Person WorkshopsKingston, R. (Organiser), Jay, C. (Co-Organiser), Topping, D. (Co-Organiser), Heysham, N. (Co-Organiser), Shakeri, M. (Co-Organiser) & Murabito, E. (Co-Organiser)23 Nov 2022 → 24 Jan 2023Activity: Participating in or organising event(s) › Organising a conference, workshop, exhibition, performance, inquiry, course etc › Research Datasets Novice programmers strategies for online resource use and their impact on source codeAlghamdi, O. (Creator), Clinch, S. (Creator), Alhamadi, M. (Creator) & Jay, C. (Creator), University of Manchester Figshare, 17 May 2023DOI: 10.48420/c.6366063.v2, https://figshare.manchester.ac.uk/collections/Strategies_for_Using_Websites_to_Support_Programming_and_Their_Impact_on_Source_Code/6366063/2 and one more link, https://figshare.manchester.ac.uk/collections/Strategies_for_Using_Websites_to_Support_Programming_and_Their_Impact_on_Source_Code/6366063 (show fewer)Dataset Strategies for Using Websites to Support Programming and Their Impact on Source Code: Interview TranscriptsAlghamdi, O. (Creator), Clinch, S. (Creator), Alhamadi, M. (Creator) & Jay, C. (Creator), University of Manchester Figshare, 4 Apr 2023DOI: 10.48420/21806244.v2, https://figshare.manchester.ac.uk/articles/dataset/Strategies_for_Using_Websites_to_Support_Programming_and_Their_Impact_on_Source_Code_Interview_Transcripts/21806244/2 and one more link, https://figshare.manchester.ac.uk/articles/dataset/Strategies_for_Using_Websites_to_Support_Programming_and_Their_Impact_on_Source_Code_Interview_Transcripts/21806244 (show fewer)Dataset RDM, FAIR, and data sharing practices and perceptions of people who work with sensitive health dataLawson-Tovey, S. (Creator), Goble, C. (Creator) & Jay, C. (Creator), University of Manchester Figshare, 17 Jun 2025DOI: 10.48420/29336837.v1, https://figshare.manchester.ac.uk/articles/presentation/RDM_FAIR_and_data_sharing_practices_and_perceptions_of_people_who_work_with_sensitive_health_data/29336837/1 and one more link, https://figshare.manchester.ac.uk/articles/presentation/RDM_FAIR_and_data_sharing_practices_and_perceptions_of_people_who_work_with_sensitive_health_data/29336837 (show fewer)Dataset How are websites used during development and what are the implications for the coding process? : Interview and Survey StudyAlghamdi, O. (Creator), Clinch, S. (Creator), Skeva, R. (Creator) & Jay, C. (Creator), University of Manchester Figshare, 31 Jul 2023DOI: 10.48420/c.6148593, https://figshare.manchester.ac.uk/collections/How_are_websites_used_during_development_and_what_are_the_implications_for_the_coding_process_Interview_and_Survey_Study/6148593Dataset How are websites used during development and what are the implications for the coding process? : Survey Analysis ScriptsAlghamdi, O. (Creator), Clinch, S. (Creator), Skeva, R. (Creator) & Jay, C. (Creator), University of Manchester Figshare, 28 Jul 2023DOI: 10.48420/20489628, https://figshare.manchester.ac.uk/articles/software/How_are_websites_used_during_development_and_what_are_the_implications_for_the_coding_process_Survey_Analysis_Scripts/20489628Dataset View all 19 datasets Press/Media THE GUARDIAN: United by sustainability: the top 50 women in engineering – the full list for 2022Jay, C. & Saiani, A.23/06/221 item of Media coveragePress/Media: Expert comment New Scientist: How covid-19 has expose",
  "content_length": 10393,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:28"
}