{
  "name": "Carolina Scarton",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/carolina-scarton",
  "status": "success",
  "content": "Dr Carolina Scarton | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Carolina Scarton BSc, MSc, PhD School of Computer Science Senior Lecturer in Natural Language Processing Research Innovation Grant Support Lead Member of the Natural Language Processing research group Open staff member portrait in a modal window c.scarton@sheffield.ac.uk +44 114 222 1892 Regent Court (DCS) Full contact details Dr Carolina Scarton School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0002-0103-4072 Google Scholar Personal website Profile Carolina Scarton is a Senior Lecturer in Natural Language Processing at the Department of Computer Science, University of Sheffield, UK. She is a member of the Natural Language Processing group and part of the GATE team.Previously, she worked as an Academic Fellow (from September 2019 to November 2021) and as a Research Associate for the WeVerify (from March 2019 to August 2019) and SIMPATICO (from July 2016 to February 2019) European projects. Qualifications In 2017, she was awarded a PhD degree in Computer Science from the University of Sheffield, under the supervision of Professor Lucia Specia. Her PhD was funded by the EXPERT project (a Marie Curie ITN network).She also has a MSc and a BSc degree from the University of São Paulo, Brazil (awarded in 2013).Her MSc supervisor was Dr. Sandra Aluísio and she was a member of the Interinstitutional Center for Computational Linguistics (NILC). Since 2018, she is the Secretary for the European Association for Machine Translation (EAMT). Research interests Dr Scarton's research area is Natural Language Processing (NLP). She is particularly interested in text adaptation, machine translation, online misinformation detection and verification, evaluation of NLP task outputs, NLP applied to healthcare and robotics, and dialog systems. Publications Books Pinheiro V, Gamallo P, Amaro R, Scarton C, Batista F, Silva D, Magro C & Pinto H (2022) Preface. Specia L, Scarton C, Paetzold GH & Hirst G (2018) Quality Estimation for Machine Translation. Specia L, Scarton C & Paetzold GH (2018) Quality Estimation for Machine Translation. Springer International Publishing. Journal articles Li Y, Zhao Z & Scarton C (2025) It's All About In-Context Learning! Teaching Extremely Low-Resource Languages to LLMs.. CoRR, abs/2508.19089. He W, Vieira TK, Garcia M, Scarton C, Idiart M & Villavicencio A (2025) Investigating idiomaticity in word representations. Computational Linguistics, 51(2), 505-555. View this article in WRRO Li Y, Vasilakes J, Zhao Z & Scarton C (2025) SCRum-9: Multilingual Stance Classification over Rumours on Social Media.. CoRR, abs/2505.18916. Singh I, Scarton C & Bontcheva K (2025) GateNLP at SemEval-2025 Task 10: Hierarchical Three-Step Prompting for Multilingual Narrative Classification.. CoRR, abs/2505.22867. Leite JA, Razuvayevskaya O, Bontcheva K & Scarton C (2025) Weakly supervised veracity classification with LLM-predicted credibility signals. EPJ Data Science, 14. View this article in WRRO Goldsack T, Scarton C & Lin C (2025) Leveraging Large Language Models for Zero-shot Lay Summarisation in Biomedicine and Beyond.. CoRR, abs/2501.05224. Leite JA, Razuvayevskaya O, Bontcheva K & Scarton C (2024) EUvsDisinfo: a dataset for multilingual detection of pro-Kremlin disinformation in news articles. CIKM '24: Proceedings of the 33rd ACM International Conference on Information and Knowledge Management, 5380-5384. View this article in WRRO Berto MVV, Freitas BL, Scarton C, Machado-Neto JA & Almeida TA (2024) Accelerating discoveries in medicine using distributed vector representations of words. Expert Systems with Applications, 250, 123566-123566. Razuvayevskaya O, Wu B, Leite JA, Heppell F, Srba I, Scarton C, Bontcheva K & Song X (2024) Comparison between parameter-efficient techniques and full fine-tuning: a case study on multilingual news article classification. PLoS ONE, 19(5). View this article in WRRO Mu Y, Wu BP, Thorne W, Robinson A, Aletras N, Scarton C, Bontcheva K & Song X (2024) Navigating prompt complexity for zero-shot classification: a study of large language models in computational social science. Proceedings of the 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation (LREC-COLING 2024), 12074-12086. View this article in WRRO Scarton C, Oakley C, Prescott C, Wright J, Bayliss C, Wrigley S & Song X (2024) Message from the Organising Committee. Proceedings of the 25th Annual Conference of the European Association for Machine Translation Eamt 2024, 2, iv-v. He W, Idiart M, Scarton C & Villavicencio A (2024) Enhancing Idiomatic Representation in Multiple Languages via an Adaptive Contrastive Triplet Loss. Findings of the Association for Computational Linguistics ACL 2024, 12473-12485. Gow-Smith E, Phelps D, Tayyar Madabushi H, Scarton C & Villavicencio A (2024) Word Boundary Information Isn’t Useful for Encoder Language Models. Proceedings of the 9th Workshop on Representation Learning for NLP (RepL4NLP-2024), 118-135. Zhang Z, Goldsack T, Scarton C & Lin C (2024) ATLAS: Improving Lay Summarisation with Attribute-based Control. Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers), 337-345. Vincent S, Prescott C, Bayliss C, Oakley C & Scarton C (2024) A Case Study on Contextual Machine Translation in a Professional Scenario of Subtitling. Proceedings of the 25th Annual Conference of the European Association for Machine Translation Eamt 2024, 1, 561-572. Li Y, Zhao Z & Scarton C (2024) Label Set Optimization via Activation Distribution Kurtosis for Zero-shot Classification with Generative Models.. CoRR, abs/2410.19195. Scarton C, Prescott C, Bayliss C, Oakley C, Wright J, Wrigley S & Song X (2024) Message from the Organising Committee. Proceedings of the 25th Annual Conference of the European Association for Machine Translation Eamt 2024, 1, iv-v. Leal SE, Duran MS, Scarton CE, Hartmann NS & Aluísio SM (2024) NILC-Metrix: assessing the complexity of written and spoken language in Brazilian Portuguese. Language Resources and Evaluation, 58(1), 73-110. Singh I, Scarton C & Bontcheva K (2023) UTDRM: unsupervised method for training debunked-narrative retrieval models. EPJ Data Science, 12(1). View this article in WRRO Wu B, Li Y, Mu Y, Scarton C, Bontcheva K & Song X (2023) Don’t waste a single annotation: improving single-label classifiers through soft labels. Findings of the Association for Computational Linguistics: EMNLP 2023, 5347-5355. View this article in WRRO Li Y, Scarton C, Song X & Bontcheva K (2023) Classifying COVID-19 vaccine narratives. Proceedings of the 14th International Conference on Recent Advances in Natural Language Processing, 648-657. View this article in WRRO Mu Y, Jin M, Grimshaw C, Scarton C, Bontcheva K & Song X (2023) VaxxHesitancy: A dataset for studying hesitancy towards COVID-19 vaccination on Twitter. Proceedings of the International AAAI Conference on Web and Social Media, 17(1), 1052-1062. View this article in WRRO Goldsack T, Zhang Z, Tang C, Scarton C & Lin C (2023) Enhancing Biomedical Lay Summarisation with External Knowledge Graphs. Proceedings of the 2023 Conference on Empirical Methods in Natural Language Processing, 8016-8032. Vincent ST, Flynn R & Scarton C (2023) MTCue: Learning Zero-Shot Control of Extra-Textual Attributes by Leveraging Unstructured Context in Neural Machine Translation.. CoRR, abs/2305.15904. Li Y & Scarton C (2023) Evaluating the Role of Target Arguments in Rumour Stance Classification.. CoRR, abs/2303.12665. Vincent ST, Sumner R, Dowek A, Blundell C, Preston E, Bayliss C, Oakley C & Scarton C (2023) Personalised Language Modelling of Screen Characters Using Rich Metadata Annotations.. CoRR, abs/2303.16618. Singh I, Scarton C & Bontcheva K (2021) Multistage BiCross encoder for multilingual access to COVID-19 health information. PLoS ONE, 16(9). View this article in WRRO Alva-Manchego F, Scarton C & Specia L (2021) The (un)suitability of automatic evaluation metrics for text simplification. Computational Linguistics, 47(4), 861-889. Mejova Y, Petrocchi M & Scarton C (2021) Special Issue on Disinformation, Hoaxes and Propaganda within Online Social Networks and Media. Online Social Networks and Media, 23, 100132-100132. Leite JA, Silva DF, Bontcheva K & Scarton C (2020) Toxic language detection in social media for Brazilian Portuguese : new dataset and multilingual analysis. Proceedings of the 1st Conference of the Asia-Pacific Chapter of the Association for Computational Linguistics and the 10th International Joint Conference on Natural Language Processing, 914-924. View this article in WRRO Scarton C, Silva DF & Bontcheva K (2020) Measuring what counts : the case of rumour stance classification. Proceedings of the 1st Conference of the Asia-Pacific Chapter of the Association for Computational Linguistics and the 10th International Joint Conference on Natural Language Processing, 925-932. View this article in WRRO Alva-Manchego F, Scarton C & Specia L (2020) Data-driven sentence simplification: Survey and benchmark. Computational Linguistics, 46(1), 135-187. Scarton C (2020) Horacio Saggion, Automatic Text Simplification. Synthesis lectures on human language technologies, April 2017.. Nat. Lang. Eng., 26, 489-492. Toledo CM, Cunha A, Scarton C & Aluísio S (2014) Automatic classification of written descriptions by healthy adults: An overview of the application of natural language processing and machine learning techniques to clinical discourse analysis. Dement Neuropsychol, 8(3), 227-235. View this article in WRRO Srba I, Razuvayevskaya O, Leite JA, Moro R, Schlicht IB, Tonelli S, García FM, Lottmann SB, Teyssou D, Porcellini V , Scarton C et al () A Survey on Automatic Credibility Assessment Using Textual Credibility Signals ",
  "content_length": 43508,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:27"
}