{
  "name": "Carrick J. Detweiler",
  "homepage": "http://cse.unl.edu/~carrick",
  "status": "success",
  "content": "Carrick Detweiler pic1, pic2, pic3, brief bio, CV Carrick Detweiler B.A. 2004, Middlebury College M.S. 2006, Massachusetts Institute of Technology Ph.D. 2010, Massachusetts Institute of Technology Professor University of Nebraska-Lincoln Computer Science and Engineering Mechanical and Materials Engineering (by courtesy) Office: carrick @ unl _dot_ edu 220 Schorr Center Department of Computer Science and Engineering University of Nebraska-Lincoln Lincoln, NE 68588 (402) 472-2449 I am not currently accepting new students as I'll be on leave focusing on Drone Amplified.* Contact the other NIMBUS Co-Directors if you are interested in research opportunities. About Me I am a Professor in the Computer Science and Engineering Department at the University of Nebraska-Lincoln, a Faculty Fellow of the Robert B. Daugherty Water for Food Institute, a Faculty Fellow of the University of Nebraska Public Policy Center, and have a courtesy appointment in the UNL Department of Mechanical and Materials Engineering (you can find my CV here). I co-Direct the NIMBUS Lab, where we work with aerial robots and other robot systems. I am co-founder and CEO of Drone Amplified, which sells drone-based fire ignition systems.* I completed my Ph.D. at the Computer Science and Artificial Intelligence Lab (CSAIL) at MIT, studying computer science and robotics in the Distributed Robotics Lab with my adviser Daniela Rus. My research interests include field robotics, environmental monitoring, agricultural robotics, adaptive sampling, perception, localization, and safety and reliability of robots in the wild. I work with and build everything from flying robots to underwater sensor networks and often explore the boundaries between robots and sensor networks. My goal is to develop systems and algorithms that enable robots to operate in real world conditions to aid scientists, farmers, and others. I have an Erdös number of at most 4 :) I enjoy skiing, scuba diving, flying (drones and \"real\" Cessna-like planes), reading science fiction, biking, cooking, photography, walking my dog, and spending time with my daughters. I am married to Courtney Hillebrecht, who is a faculty member in the political science department at UNL. Check the NIMBUS Lab website and our blog for the most up-to-date information on my research. If you want to meet with me, you can schedule it yourself if you are in one of my classes. If you are not in one of my classes or the Nimbus Lab, you should email me first. I also created a University of Nebraska-Lincoln letterhead template in LaTeX, which makes writing letters much easier in my opinion. If you have any suggestions or updates feel free to let me know. Publications Peer Reviewed Conference and Journal Publications A. Plowcha, J. Bradley, J. Hogberg, T. Ammon, M. Nail, B. Duncan, and C. Detweiler, Autonomous long-range sensor emplacement using unmanned aircraft systems, Field Robotics, pp. 437-467, 2022. P. Fletcher, A. Luther, C. Detweiler, and B. Duncan, Predicting visual differentiability for unmanned aerial vehicle gestures, IEEE Robotics and Automation Letters, 2022. K. Jelonek, P. Fletcher, B. Duncan, and C. Detweiler, Examining distance in uav gesture perception, Intelligent Robots and Systems (IROS), 2022. D. Rico, F. Munoz-Arriola, and C. Detweiler Trajectory Selection for Power-over-Tether Atmospheric Sensing UAS. Intelligent Robots and Systems (IROS), 2021. A. Shankar, S. Elbaum, and C. Detweiler. Freyja: A Full Multirotor System for Agile & Precise Outdoor Flights. International Conference on Robotics & Automation (ICRA), 2021. P. Fletcher, C. Detweiler, and B. Duncan. Investigation of unmanned aerial vehicle gesture perceptibility and impact of viewpoint variance. In Proceedings of IEEE International Conference on Robotics and Automation (ICRA), 2021. J.-P. Ore, C. Detweiler, and S. Elbaum. An Empirical Study on Physical Type Annotations: Accuracy, Speed, and Suggestion-Effectiveness. ACM Transactions on Software Engineering and Methodology (TOSEM), 30.2 (2021): 1-29. A. Islam, A. Shankar, A. Houston, and C. Detweiler. University of Nebraska UAS profiling during LAPSE-RATE. Earth System Science Data Discussions (2020): 1-13. A. Shankar, S. Elbaum, and C. Detweiler. Multirotor Docking with an Airborne Platform. In Proceedings of International Symposium on Experimental Robotics (ISER), 2020. A. Plowcha, J. Hogberg, C. Detweiler, and J. Bradley. Online Soil Classification Using a UAS Sensor Emplacement System. In Proceedings of International Symposium on Experimental Robotics (ISER), 2020. A. Shankar, S. Elbaum, and C. Detweiler. Towards In-Flight Transfer of Payloads between Multirotors. IEEE Robotics and Automation Letters, 2020. A. Shankar, S. Elbaum, and C. Detweiler. Dynamic Path Generation for Multirotor Aerial Docking in Forward Flight. IEEE Conference on Decision and Control (CDC). 2020. C. Fernando, C. Detweiler, and J. Bradley. Co-Regulated Information Consensus with Delays for Multi-Agent UAS. IEEE Conference on Decision and Control (CDC). 2020. M. Lussier, C. Detweiler, J. Bradley, Extending Endurance of Multicopters: The Current State-of-the-Art. AIAA SciTech, San Diego, California, 2019. J. Walther, L. PytlikZillig, C. Detweiler, and A. Houston How people make sense of drones used for atmospheric science (and other purposes): Hopes, Concerns, and Recommendations. Journal of Unmanned Vehicle Systems, 7(3), 219-234, 2019. P. Albuquerque, V. Garcia, A. Junior, T. Lewandowski, C. Detweiler, A. Goncalves, C. Costa, M. Naka, and H. Pistori. Automatic live fingerlings counting using computer vision. Computers and Electronics in Agriculture, 167, 1-9, 2019. A. Islam, A. Houston, A. Shankar, and C. Detweiler. Design and Evaluation of Sensor Housing for Boundary Layer Profiling Using Multirotors. Sensors, 19:2481, 2019. C. Fernando, C. Detweiler, and J. Bradley. Co-Regulated Consensus of Cyber-Physical Resources in Multi-Agent Unmanned Aircraft Systems. Electronics, 8(5):569, 2019. Lindsay Barbieri, Stephan T. Kral, Sean C. C. Bailey, Amy E. Frazier, Jamey D. Jacob, Joachim Reuder, David Brus, Phillip B. Chilson, Christopher Crick, Carrick Detweiler, Abhiram Doddi, Jack Elston, Hosein Foroutan, Javier Gonzalez-Rocha, Brian R. Greene, Marcelo I. Guzman, Adam L. Houston, Ashraful Islam, Osku Kemppinen, Dale Lawrence, Elizabeth A. Pillar-Little, Shane D. Ross, Michael Sama, David G. Schmale III, Travis J. Schuyler, Ajay Shankar, Suzanne W. Smith, Sean Waugh, Cory Dixon, Steve Borenstein, and Gijs de Boer. Small Unmanned Aircraft Systems (sUAS) in Atmospheric Science: Measurement Intercomparison for LAPSE-RATE. Sensors, 19(9):2179, 2019. L. PytlikZillig, B. Duncan, S. Elbaum and C. Detweiler. A Drone by Any Other Name: Purposes, End-User Trustworthiness, and Framing, but Not Terminology, Affect Public Support for Drones. IEEE Technology and Society Magazine, 37 (1) 80-91, 2018. C. Fernando, C. Detweiler, and J. Bradley, Co-Regulating Communication for Asynchronous Information Consensus. IEEE Conference on Decision and Control (CDC). Miami Beach, Florida, UAS, 2018. J.-P. Ore and C. Detweiler, Sensing Water Properties at Precise Depths from the Air. Journal of Field Robotics, 2018. (accepted version) Y. Sun, A. Plowcha, M. Nail, S. Elbaum, B. Terry, and C. Detweiler, Unmanned Aerial Auger for Underground Sensor Installation. In Proceedings of IEEE/RSJ International Conference on Intelligent Robotics and Systems (IROS), Madrid, Spain, 2018. A. Shankar, S. Elbaum, and C. Detweiler, Towards Aerial Recovery of Parachute-Deployed Payloads. In Proceedings of IEEE/RSJ International Conference on Intelligent Robotics and Systems (IROS), Madrid, Spain, 2018. N. Najeeb and C. Detweiler, UAV Based Wireless Charging of Sensor Networks without Prior Knowledge. In Proceedings of IEEE/RSJ International Conference on Intelligent Robotics and Systems (IROS), Madrid, Spain, 2018. E. Beachly, C. Detweiler, S. Elbaum, B. Duncan, C. Hilderbrandt, D. Twidwell, and C. Allen, Fire-Aware Planning of Aerial Trajectories and Ignitions. In Proceedings of IEEE/RSJ International Conference on Intelligent Robotics and Systems (IROS), Madrid, Spain, 2018. Awarded Best Paper on Safety, Security, and Rescue Robotics in memory of Motohiro Kisoi J.-P. Ore, S. Elbaum, C. Detweiler, L. Karkazis, Assessing the Type Annotation Burden Automated Software Engineering (ASE), 2018. A. Plowcha, Y. Sun, C. Detweiler, and J. Bradley, Predicting Digging Success for Unmanned Aircraft System Sensor Emplacement. Proceedings of International Symposium on Experimental Robotics (ISER), Buenos Aires, Argentina, 2018. A. Shankar, S. Elbaum, and C. Detweiler, In-air Exchange of Small Payloads Between Multirotor Aerial Systems. Proceedings of International Symposium on Experimental Robotics (ISER), Buenos Aires, Argentina, 2018. B. Duncan, E. Beachly, A. Bevins, S. Elbaum, and C. Detweiler, Investigation of Communicative Flight Paths for small Unmanned Aerial Systems. In Proceedings of IEEE International Conference on Robotics and Automation (ICRA), Brisbane, Australia, 2018. K. Song, A. Brewer, S. Ahmadian, A. Shankar, C. Detweiler, and A. Burgin. Using unmanned aerial vehicles to sample aquatic ecosystems. Limnology and Oceanography: Methods, 15(12), 1021-1030, 2017. D. Anthony and C. Detweiler. UAV Localization in Row Crops. Journal of Field Robotics, 10.1002/rob.21706, 2017. E. Beachly, C. Detweiler, S. Elbaum, B. Duncan, and D. Twidwell. UAS-Rx Interface for Mission Planning, Fire Tracking, Fire Ignition, and Real-Time Updating. In Proceedings of IEEE International Symposium on Safety, Security, and Rescue Robotics, Shanghai, China, 2017. N. Najeeb and C. Detweiler. Extending Wireless Rechargeable Sensor Network Life without Full Knowledge. Sensors, 17(7):1642, 2017. E. Basha, T. Watts-Willis, and C. Detweiler. Autonomous Meta-Classifier for Surface Hardness Classification from UAV Landings. In Proceedings of IEEE/RSJ International Conference on Intelligent Robotics and",
  "content_length": 27168,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:28"
}