{
  "name": "Carsten Sinz",
  "homepage": "http://verialg.iti.kit.edu/353.php",
  "status": "success",
  "content": "KIT - Mitarbeiter Stiftungsprofessur für zuverlässige Softwaresysteme in der Automobilindustrie StartseiteMitarbeiter ForschungsgruppeProfilMitarbeiterForschungLehrveranstaltungenMaster- und BachelorarbeitenVeröffentlichungenMitarbeiter Prof. Dr. Carsten Sinz ForschungsgruppenleiterSprechstunden: Freitag, 10:00-12:00Raum: 028Tel.: +49 721 608 - 44212Fax: +49 721 608 - 44021carsten sinz ∂does-not-exist.kit eduwww.carstensinz.de Institut für Theoretische Informatik Am Fasanengarten 5 76131 Karlsruhe Ausgewählte AktivitätenGefördert vom Daimler-Fonds im Stifterverband für die Deutsche Wissenschaft Co-Organisator der SAT-Challenge 2012. Programmkomitee 15th International Conference on Theory and Applications of Satisfiability Testing (SAT'12), Juni 2012, Trento, Italien. Programmkomitee Workshop on Graph Inspection and Traversal Engineering, März/April 2012, Tallinn, Estland. Programmkomitee TACAS Software Verification Competition, März/April 2012, Tallinn, Estland. Co-Chair des Symposiums „75 Years of Turing Machine and Lambda Calculus“, Oktober 2011, Karlsruhe. Co-Chair des GI Deduktionstreffen 2011 (Jahrestreffen der Sektion „Deduktionssysteme“ der GI), Oktober 2011, Karlsruhe. Programmkomitee Second International Workshop on Logics for Component Configuration (LoCoCo’11), September 2011, Perugia, Italien. Programmkomitee Workshop on Parallel/Portfolio Satisfiability Solving (WPSS 2011), Juli 2011, Istanbul, Türkei Workshop Chair, SAT for Practical Applications (SPA'11), Juni 2011, Ann Arbor, USA. Programmkomitee 14th International Conference on Theory and Applications of Satisfiability Testing (SAT'11), Juni 2011, Ann Arbor, USA. Programmkomitee 1st International Workshop of Rigorous Systems Engineering (WRiSE'11), April 2011, Salzburg, Österreich. Programmkomitee 24th AAAI Conference on Artificial Intelligence (AAAI'10), Juli 2010, Atlanta, USA. Programmkomitee Pragmatics of SAT Workshop (PoS'10), Juli 2010, Edinburgh, Schottland. SAT-Race 2010, Chair. Workshop Chair der SAT-Konferenz (SAT'10), Juli 2010, Edinburgh, Schottland. Eingeladener Vortrag auf dem Workshop on Logics for Component Configuration, Juli 2010, Edinburgh, Schottland. Programmkomitee 13th International Conference on Theory and Applications of Satisfiability Testing (SAT'10), Juli 2010, Edinburgh, Schottland. Programmkomitee Workshop on Parallel Satisfiability Solving (WPSS'10), Juni/Juli 2010, Caen, Frankreich. Programmkomitee 17th RCRA International Workshop on Experimental Evaluation of Algorithms for Solving Problems with Combinatorial Explosion (RCRA'10), Juni 2010, Bologna, Italien.",
  "content_length": 2603,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:32"
}