{
  "name": "Carsten Rudolph",
  "homepage": "https://research.monash.edu/en/persons/carsten-rudolph",
  "status": "success",
  "content": "Carsten Rudolph - Monash University Carsten Rudolph public CV View Scopus Profile Carsten Rudolph Professor Professor, Department of Software Systems & Cybersecurity https://orcid.org/0000-0001-9050-5675 EmailCarsten.Rudolphmonashedu Accepting PhD StudentsPhD projectshttps://supervisorconnect.it.monash.edu/ 1998 …2026 Research activity per year Personal profile BiographyProfessor Carsten Rudolph is Professor for Cybersecurity in the Department for Software Systems and Cybersecurity at the Faculty of Information Technology, Monash University in Melbourne, Australia. His research concentrates on information security, formal methods, cryptographic protocols, security of machine learning and human aspects of security with a strong focus inter-disciplinary topics. He contributes to the development of secure solutions for different areas, such as digital health or future energy networks. Further, he drives scientific exchange between cybersecurity, law and organisational informatics. Another focus of his research is on nation-level cybersecurity maturity and policy development. Dr. Rudolph has established the OCSC and leads cybersecurity maturity reviews for nations in the Pacific region, a collaboration with Oxford University. Monash teaching commitmentProfessor Carsten Rudolph has experience as the Chief Examiner/Lecturer for the following units in the Faculty of IT: FIT1047 Introduction to computer systems, networks and securityFIT3173 Software SecurityFIT3168 IT Forensics Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationInformation Security, Doctor of Philosophy, Queensland University of Technology (QUT)Award Date: 28 Mar 2002Computer Science, Diplom Informatik, Goethe-Universität Frankfurt am Main (Goethe University Frankfurt)Award Date: 30 Mar 1997 Research area keywordsCyber SecurityTrusted ComputingFormal MethodsSecurity ProtocolsSecurity EngineeringDigital ForensicsForensic ReadinessNetwork SecuritySecurity Verification Projects Projects per year 2016 2016 2018 2020 2021 2022 2023 2024 2026 2027 1 Not started 2 Active 8 Finished Projects per year Æinstein: Adversarial AI amongst Materials Discovery DomainsPhan, R. (Primary Chief Investigator (PCI)), Pal, A. (Chief Investigator (CI)), Rajanala, S. (Chief Investigator (CI)), Ting, C.-M. (Chief Investigator (CI)), Krishnasamy, G. (Chief Investigator (CI)), Noman, F. (Chief Investigator (CI)), Shu Min, L. (Chief Investigator (CI)), Liu, J. (Chief Investigator (CI)), Rudolph, C. (Chief Investigator (CI)), Steinfeld, R. (Chief Investigator (CI)), Siang Piao, C. (Chief Investigator (CI)), Tumian, A. (Partner Investigator (PI)) & Nik Hashim, N. N. W. (Partner Investigator (PI))1/06/24 → 31/05/26Project: Research RAI4IoE: RAI4IoE: Responsible AI for Enabling the Internet of EnergyLiu, L. (Primary Chief Investigator (PCI)), Yuan, X. (Chief Investigator (CI)), Rudolph, C. (Chief Investigator (CI)), Nepal, S. (Chief Investigator (CI)), Sethuvenkatraman, S. (Chief Investigator (CI)) & Xue, J. (Chief Investigator (CI))27/02/24 → 1/01/27Project: Research Building Cyber Resilience in Fiji: Securing the Nation’s Digital FutureLiu, J. (Primary Chief Investigator (PCI)), Rudolph, C. (Chief Investigator (CI)), Boorman, J. (Chief Investigator (CI)), Sakzad, A. (Chief Investigator (CI)), Yuen, J. (Chief Investigator (CI)), Ma, X. (Chief Investigator (CI)), Cui, H. (Chief Investigator (CI)) & Liu, D. (Chief Investigator (CI))2/02/26 → 29/01/27Project: Other 6G Network Security : 6G Network Security Rudolph, C. (Primary Chief Investigator (PCI)) & Yuan, X. (Chief Investigator (CI))20/03/23 → 30/06/25Project: Research Post-Quantum Cryptography in the Indo-PacificSteinfeld, R. (Primary Chief Investigator (PCI)), Esgin, M. (Chief Investigator (CI)), Sakzad, A. (Chief Investigator (CI)), Rudolph, C. (Chief Investigator (CI)), Phan, R. (Chief Investigator (CI)) & Boorman, J. (Chief Investigator (CI))Bureau of East Asian and Pacific Affairs (United States of America)26/09/22 → 30/09/25Project: Research View all 11 projects Research output Research output per year 1998 2013 2019 2020 2022 2023 2025 102 Conference Paper 23 Article 6 Chapter (Book) 4 Foreword / Postscript 6 More 2 Commissioned Report 2 Review Article 1 Other Report 1 Other contribution Research output per year Research output per year Enhancing Security and Resilience in DER Integration: A Self-Sovereign Identity Approach for Smart Inverters in Virtual Power PlantsDayaratne, T., Carsten, R. & Yu, J., 7 Mar 2025, (Accepted/In press) In: Distributed Ledger Technologies: Research and Practice. 29 p.Research output: Contribution to journal › Article › Research › peer-review Fostering Trust in Smart Inverters: A Framework for Firmware Update Management and Tracking in VPP ContextDayaratne, T., Rudolph, C., Shirley, T., Levi, S. & Shirley, D., Mar 2025, In: IEEE Transactions on Smart Grid. 16, 2, p. 1872-1884 13 p.Research output: Contribution to journal › Article › Research › peer-review 4 Citations (Scopus) Managing cyber harm: a survey of challenges, practices, and opportunitiesIslam, E., Rudolph, C. & Oliver, G., 30 Mar 2025, In: Information Security Journal. 34, 5, p. 424-454 31 p.Research output: Contribution to journal › Review Article › Research › peer-review Open AccessFile Pacific IslandsCarsten, R., Boorman, J. & Jack, J., 2025, The Palgrave Handbook on Cyber Diplomacy . Christou, G., Vosse, W., Burton, J. & A. Koops, J. (eds.). Cham Switzerland: Palgrave Macmillan, p. 653–672 20 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter (Book) › Research › peer-review Securing cross-domain data access with decentralized attribute-based access controlSalehi Shahraki, A., Rudolph, C., Alavizadeh, H., Kayes, A. S. M., Rahayu, W. & Tari, Z., 1 Jun 2025, In: Ad Hoc Networks. 173, 15 p., 103807.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 5 Citations (Scopus) View all 141 research outputs Activities Activities per year 2016 2016 2016 1 External research organisation, centre or institute Activities per year Member - Faculty Research Committee - Faculty of Information Technology, Monash UniversityRudolph, C. (Member)1 Jan 2016Activity: External Academic Engagement › External research organisation, centre or institute Press/Media Cybersecurity in the Pacific: how island nations are building their online defences.Rudolph, C., Boorman, J. & Whitty, M.15/06/221 Media contributionPress/Media: Blogs, Podcasts and Social Media › Blogs",
  "content_length": 6743,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:31"
}