{
  "name": "Carsten Eickhoff",
  "homepage": "https://health-nlp.com/people/carsten.html",
  "status": "success",
  "content": "Health NLP | Carsten people publications teaching openings resources news Carsten Eickhoff Professor, Director Office: Schaffhausenstraße 77, Office 1.35 [email protected] 0000-0001-9895-4061 carsteneickhoff eickhoff I develop data-driven computational methods for improving individual health and quality of medical care. I lead the Health NLP Lab at the University of Tübingen, where we specialize in mining, representation, and retrieval of large-scale natural language resources. I am a member of the Cluster of Excellence \"Machine Learning: New Perspectives for Science\". Check out their blog here. Metrics Number of publications: 191 Citations: 6,642 (Google Scholar) h-index: 36 i10-index: 98 Cumulative Journal Impact Factor: 415 Academic Career Year Position Affiliation 2022 - now Full Professor, Director University of Tübingen, Germany 2022 - now Scientific Director, Medical Data Integration Tübingen University Hospital, Germany 2018 - 2022 Manning Assistant Professor Brown University, USA 2017 Visiting Researcher Harvard University, USA 2014 - 2017 Postdoc ETH Zurich, Switzerland Education Year Degree Program Institution 2009 - 2014 PhD (Computer Science), advisor: Arjen P. de Vries, subject: “Contextual Multidimensional Relevance Models” TU Delft, The Netherlands 2008 - 2009 MS (Artificial Intelligence) The University of Edinburgh, UK 2005 - 2008 BS (Computer Science) FHDW Hannover, Germany Activities in the Research System Teaching Semester Class Institution Summer 2024 – present Understanding Language Models University of Tübingen Winter 2023 – present Introduction to Artificial Intelligence University of Tübingen Summer 2023 - present Natural Language Processing University of Tübingen Summer 2023 - present Modern Search Engines University of Tübingen Summer 2023 AI in Medicine University of Tübingen Winter 2023 Introduction to Artificial Intelligence University of Tübingen Spring 2019 - 2021 Artificial Intelligence in Biomedicine Brown University Spring 2016 - 2017 Advanced Topics in IR & NLP ETH Zürich Fall 2016 Machine Learning ETH Zürich Fall 2014 - 2016 Research in Computer Science ETH Zürich Advising Junior Faculty (6) Harrisen Scells (Assistant Professor at University of Tübingen), Kristof Meding (Assistant Professor at University of Tübingen), Taylor Burke (Assistant Professor at Harvard University), Adeel Abbasi(Assistant Professor at Brown University), Maya Vadiveloo (Associate Professor at the University of Rhode Island), Laura Mercurio (Assistant Professor at Brown University) Postdoc (4) Shrestha Ghosh (ongoing), Seyed Ali Bahrainian (ongoing), Augusto García-Agúndez (Postdoc at UCSF), Daniel Cohen (Research Scientist at DataMinr). PhD (13) Siran Li (ongoing), Gregory Polyakov (ongoing), Florian Rottach (ongoing), Michal Golovanevsky (ongoing), Catherine Chen (ongoing), Tasallah Abdullahi (ongoing), Ruochen Zhang (ongoing), William Rudman Jr. (PhD 2025, Postdoc at UT Austin), John Merullo (PhD 2025 Research Scientist at Goodfire), Georgios Zerveas (PhD 2023, Senior Applied Scientist at Microsoft Turing), Krishna Nand Keshava Murthy (PhD 2022, Lead Data Scientist at Memorial Sloan Kettering Cancer Center), Zhizhong Chen (PhD 2021, Software Engineer at Twitter), Wen Li (PhD 2015, Software Engineer at Google). M.Sc. (45) Nianzi Yi, Selina Ücker, Leon Scharwächter, Michelle Schlicher, Felix Strothmann, Michael Giang, Simon Frank, Dominik Hildebrand (PhD candidate at University of Tübingen), Kora Helm, Marc Seelmann, David Bernhardt, Koyena Pal (PhD candidate at Northeastern University), Babak Hemmatian Borujeni (Assistant Professor at University of Nebraska-Lincoln), Ge Zhu, Priscilla Hernández, Kunyu Zhang, Li Zhu, Heiki Riesenkampf, Jannick Griner, Julian Fuchs, Ingo Schilken, Karl Ruszics (PhD candidate at ETH Zurich), Floran Gmehlin (Data Scientist at Pricehubble AG), Xing Wei (Developer at Google), Lennart van der Goten (Data Scientist at SAP), David Frank (Developer at Google), Ferenc Galko (Developer at Google), Rik Melis (Developer at AutoForm Engineering GmbH), Arturo Vivas, Dina Zverinski (Developer at Google), Yarden Raiskin (Developer at IBM), Felix Mance (Developer at Palantir), Immanuel Schwall (PhD candidate at ETH Zurich), Simon Greuter, Zsolt Mezei (Co-Founder at Gleblu AG), Jing Yang (PhD candidate at ETH Zurich), Faiza Alsaied (Developer at AutoForm Engineering GmbH), Rolf Jagerman (Developer at Google), Jan Wilken Dörrie (Developer at Facebook), Lukas Elmer (Co-Founder at Renuo AG), Maria Han Veiga (Assistant Professor at Ohio State University), Jared Niederhauser (Developer at GetYourGuide), Martin Davtyan (Data Scientist at Episteme Capital), Siddharth Sarda (Data Scientist at Booking.com), Marina Horlescu (Developer at Google), Florian Schmidt (PhD candidate at ETH Zurich), Pieter Dekker (Developer at Apprentice Uitgevers). B.Sc. (21) Eliza Gilbert, Marco Madeja, Saman Sang, Koyena Pal, Abdullah Ahmed, Karen Tu, Prakrit Baruah, Erica Guo, Jerome Ramos, Nicolas Mesot (MSc at ETH Zurich), Samuel Müller (MSc at ETH Zurich), Panuya Balasuntharam (MSc at ETH Zurich), Kevin Klein (MSc at ETH Zurich), Noah Hollmann (MSc at ETH Zurich), Angela Rellstab (MSc at ETH Zurich), Lorenz Kuhn (MSc at ETH Zurich), Philip Junker (MSc at ETH Zurich), Tobias Verhulst (MSc at ETH Zurich), Nino Weingart (MSc at ETH Zurich), Nina Zinsli (MSc at ETH Zurich), Kieran Nirkko (Intern at Google). Doctoral Committees (26) Ahmad-Reza Ehyaei (University of Tübingen, Germany, PhD, expected), Katrin Renz (University of Tübingen, Germany, PhD, expected), Paul Fischer (University of Tübingen, Germany, PhD, expected), Maria Heuss (University of Amsterdam, The Netherlands, PhD, expected), Denise Junger (University of Tübingen, Germany, PhD, expected), Johann Frei (University of Augsburg, Germany, PhD, expected), Junjie He (University of Stuttgart, Germany, PhD, expected), Prithivi Jung Thapa (University of Tübingen, Germany, PhD, expected), Tom Sühr (University of Tübingen, Germany, PhD, expected), Polina Tsvilodub (University of Tübingen, Germany, PhD, expected), Meghal Dani (University of Tübingen, Germany, PhD, expected), Raphael Scheible (TU Munich, Germany, PhD, expected), Rita González Márquez (University of Tübingen, Germany, PhD, expected), Diogo Nunes (University of Lisbon, Portugal, PhD, expected), Isabelle Loster (University of Tübingen, Germany, MD, 2025), David La Barbera (University of Udine, Italy, PhD, 2025), Mihai Horia Popescu (University of Udine, Italy, PhD, 2025), Hassan Shahmohammadi (University of Tübingen, Germany, PhD, 2024), Nirmal Roy (TU Delft, The Netherlands, PhD, 2024), Jiechen Xu (University of Queensland, Australia, PhD, 2024), Tim Draws (TU Delft, The Netherlands, PhD, 2023), Alexander Bondarenko (University of Jena, Germany, PhD, 2023), Austin R. Ward (University of North Carolina at Chapel Hill, USA, PhD, 2023), Amir Ilkhechi (Brown University, USA, PhD, 2023), Babak Hemmatian Borujeni (Brown University, USA, PhD, 2021), Rolf Jagerman (University of Amsterdam, The Netherlands, PhD, 2020), Anton van der Vegt (University of Queensland, Australia, PhD, 2020), Navid Rekabsaz (TU Vienna, Austria, PhD, 2018). Awards Award Year Computer Science Teaching Award (University of Tübingen) 2024 Best Paper Award (IEEE ICMLA) 2022 Manning Endowed Chair of Medical Science (Brown University) 2022 Best Short Paper Award (ECIR) 2019 Karen T. Romer Undergraduate Teaching and Research Award (Brown University) 2019 DHZK Research Paper of the Month 2018 Winning entry to the BioASQ Biomedical Question Answering Challenge 2017 Best Abstract Award (AIMed) 2016 Best Paper Honorable Mention (ACM SIGIR) 2015 Best Reviewer Award (ECIR) 2014 Microsoft Bing Most Innovative Paper Award 2011 Grants As PI (€8,648,958) Grant Duration & Grant Amount UNC-Tübingen Collaborative Seed Grant (PI) Explainable Clinical Decision Support Systems (University of Tübingen) 2025 - 2026 €10,000 ProfilPLUS (PI) Artificial Intelligence in Biomedicine (University of Tübingen) 2023 - 2025 €75,600 Covid-19 Relief Grant (PI) Explaining COVID-19 Outcome Disparities via Natural Language Processing (Peter G. Peterson Foundation Pandemic Response Policy Research Fund) 2022 - 2023 $100,000 NSF/III Medium (PI) Generative Neural Information Retrieval Models (National Science Foundation) 2020 - 2024 $999,761 OVPR Seed Award (PI) Finding Social Narratives in Big Data (Brown University) 2020 - 2021 $71,000 DARPA Seed (Co-PI) Cognitively-Motivated Word Learning in Embodied Virtual Agents (Defense Advanced Research Projects Agency) 2019 - 2022 $954,509 IARPA BETTER (Co-PI) Task-and-User Aware Representation Learning for Fine-Grained Cross-Lingual Information Retrieval (Intelligence Advanced Research Projects Activity) 2019 - 2023 $6,100,000 NSF Workshop Support (PI) Student Travel Support for ACM WSDM 2019 (National Science Foundation) 2018 - 2019 $18,450 OVPR Big Data Seed Grant (PI) Forecasting Patterns of Delirium and Early Recovery After Acute Stroke (Brown University) 2018 - 2019 $25,000 NSF Workshop Support (PI) Doctoral Consortium for HCOMP 2018 (National Science Foundation) 2018 - 2019 $24,000 SNSF Ambizione (PI) Representation Learning for Clinical Artificial Intelligence (Swiss National Science Foundation) 2017 - 2019 CHF 743,444 Microsoft Azure for Research Grant (PI) Statistically Robust Multi-criteria Relevance Modelling (Microsoft) 2013 - 2014 $47,000 As Co-I (€66,737,557) Grant Duration & Grant Amount DFG Cluster of Excellence Machine Learning: New Perspectives for Science (German Research Foundation) 2026 - 2032 €50,000,000 NIH/AHRQ R01 Evaluating Diagnostic Decision Support Systems for Patients Requiring Urgent Primary or Emergency Care or with Stroke (National Institutes of Health) 2023 - 2028 $1,929,759 NIH/NIGMS COBRE Rhode Island Hospital Injury Control Center for Biomedical Research Excellence (National Institutes of Health) 2021 - 2026 $14,807,798 As Co-PI (€2,207,641) Grant & Grantee Duration & Grant Amount NIH NHLBI K01",
  "content_length": 16440,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:29"
}