{
  "name": "Carsten Baum",
  "homepage": "https://carstenbaum.com",
  "status": "success",
  "content": "Carsten Baum – Associate Professor at DTU Zum Inhalt springen I’m an Associate Professor in the Cybersecurity Section at DTU Compute in Copenhagen, Denmark. My research focus is on (applied) secure computation as well as post-quantum zero knowledge protocols. Furthermore, I am interested into security for machine learning and secure protocol design using public ledgers. Before starting on this position I have been an Assistant Professor and Postdoc at Aarhus University as well as a Postdoc at Bar Ilan University, Israel. I obtained my PhD in 2016 from Aarhus University. Teaching At DTU, I am teaching in the following courses: Cryptography 1 (01410) – spring semester Network Security (02233) – spring semester Applied Cryptography (02232) – fall semester Students I’m currently supervising two PhD students (Chiara-Marie Zok and Simon Ljungbeck). Moreover, I’m the proud doctor father of Alexander Munch-Hansen (co-supervised with Peter Scholl, Aarhus University). If you are a DTU student and want to do a masters or course project with me, please reach out to my DTU e-mail seen below. Media and Outreach 2025: I talked to the Danish Engineering Newspaper about the plans for the Danish age verification app. 2024: Together with other experts, I’m trying to convince the European Commission to adopt Anonymous Credentials as part of the EUDI Wallet. I’ve also given a talk at the newtpqc workshop on FAEST, which you can see here. 2023: I’ve spoken to Danish media outlets about the dangers of on-device scanning of chat messages. I gave a presentation about Secure Computation in Tel Aviv in 2018. Here is a link to the video. Other Work I’m a coauthor of the FAEST digital signature scheme which has been submitted to the ongoing NIST Post Quantum competition. We have reached round 2 of the competition, and if you want to learn more about it – reach out to me! I’m an organizer of the NordiCrypt workshops in Denmark, where we bring local experts together with those from neighboring countries. Join us at the next meeting! I organized a Summer School on Privacy-Preserving Machine Learning together with Bernardo David from ITU Copenhagen in 2022. Click here for more information. I’ve been a Program Committee member of ACNS 2017 & 2022, CCS 2019 Workshop on Privacy-Preserving Machine Learning, CCS 2019 Workshop on Encrypted Computing & Applied Homomorphic Cryptography ,The AAAI-20 Workshop on Privacy-Preserving Artificial Intelligence 2020 and 2021, IEEE ICME, LatinCrypt 2021, CCS 2021, ACISP 2021, PKC 2022, CRYPTO 2022, AsiaCrypt 2022, TPMPC 2022 & 2024, SCN 2024, CiC 2024. Projects My work is currently funded by a Villum Young Investigator starting grant (Project QUID-PRO). Previously, I received funding from Open Philanthropy (project SecureDNA) and DARPA under the SIEVE program (project FROMAGER). Contact E-Mail: cabau at dtu dot dkTwitter: @crypto_carstenLinkedIn: carsten-baumOffice: Building 322, room 210 (DTU Lyngby Campus)",
  "content_length": 2961,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:30"
}