{
  "name": "Carsten Binnig",
  "homepage": "http://binnig.name",
  "status": "success",
  "content": "About Us – Systems@TUDa – TU Darmstadt The Systems Group at TU Darmstadt Hello World! The Systems Group at TU Darmstadt is a collaboration of professors from the Computer Science department, pursuing research and teaching in systems topics together. Core Topics in the Systems Group Data and AI Systems Conducting research in several areas of databases and data management in conjunction with artificial intelligence (AI), focusing on Systems for AI and AI for Systems Learn more Distributed and Networked Systems Working in the intersection of distributed systems, specialized hardware and data management, with the goal of making data-intensive systems more efficient Learn more People Team of the systems group Teaching Courses offered by the systems group Work with us Open positions at the systems group Follow us on Bluesky & LinkedIn! We are on Bluesky and LinkedIn.Follow us to get up-to-date information about the Systems-Group@TU-Darmstadt News PhD positions in our Cluster of Excellence on Reasonable AI @ Technische Universität Darmstadt November 06, 2025 Postdoc Anupam Sanghi joining IIT Hyderabad as Assistant Professor September 16, 2025 Roman Heinrich is now a Doctor of Engineering! September 12, 2025 Advancing Learned Cost Models For Modern Data Systems Picture: Katrin Binner Picture: Katrin Binner Carsten Binnig named Distinguished Associate Editor at VLDB 2025 September 03, 2025 Distinguished Associate Editor at VLDB'25 Best Paper Award For JOB-Complex at AIDB@VLDB'25 September 01, 2025 JOB-Complex: A Challenging Benchmark for Traditional & Learned Query Optimization Systems Group at VLDB 2025 August 30, 2025 9 Systems Group publications at VLDB'25 in London Athene Young Investigator Award For Manisha Luthra Agnihotri August 26, 2025 How Do Learned Cost Models Improve Your Database Performance? August 07, 2025 How Good Are Learned Cost Models Really? Insights from Query Optimization Tasks Published in SIGMOD 2025 Systems Group at ACM CHI 2025 April 30, 2025 Najda Geisler and Benjamin Hättasch presented two position papers at workshops of the ACM CHI Conference in Yokohama Towards Database Query Optimizers that understand UDFs April 01, 2025 GRACEFUL: A Learned Cost Estimator For UDFs Published in ICDE 2025 More News Go to top We would like to customise the information and usability of this website to your preferences and needs. To this end, we use so-called cookies. Please choose which cookies you would like to enable when visiting our webpages. Some of these cookies are required to load and correctly display this website on your device. These are strictly necessary or essential cookies and cannot be deselected. The preferences cookie saves your language setting, while the statistics cookie regulates how the open-source statistical software “Matomo” analyses your visits to and activities on our website. For more information about cookies we use, please refer to our privacy policy. Strictly necessary only Preferences Statistics Accept all Save & close Legal note",
  "content_length": 3017,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:32"
}