{
  "name": "Cartic R. Ramakrishnan",
  "homepage": "http://www3.cs.stonybrook.edu/~cram",
  "status": "success",
  "content": "CR's Home Page C. R. Ramakrishnan Professor Ph.D., Computer Science, Stony Brook University M.Sc.(Tech.), Computer Science, BITS, Pilani, India M.Sc.(Hons.), Physics, BITS, Pilani, India Department of Computer Science 233, NCS Bldg Stony Brook University (SUNY) Stony Brook, NY 11794-2424 Phone: 631-632-8218 E-mail: cram@cs.stonybrook.edu Research Papers Educational Activities CV Research: I work in quantum computing as well as knowledge representation and logic programming. Quantum computing: My work is primarily in quantum networking and distributed quantum computing, and efficient simulation of quantum computation. Current projects include: Entanglement distibution in quantum neworks (joint with Prof. Himanshu Gupta): Algorithms and protocols for efficiently distributing entangled states (Bell pairs, GHZ states, Graph states) across nodes of a quantum network. Distributed quantum computing (joint with Prof. Himanshu Gupta): Resource-Efficient distributed evaluation of a quantum circuit/program over a network of quantum processors. Efficient simulation of quantum programs (joint with Profs. Dmitri Kharzeev/SBU Physics and Kazuki Ikeda/UMass-Boston) to evaluate ground and excited states of quantum systems on classical high-performance computers. Logic programming and knowledge representation: I work on representing and reasoning over incomplete and noisy data. Towards this my work focuses on combining statistical and logical knowledge: ways to represent such knowledge, learn, and perform inference over such knowledge. Current projects include: Robotic manipulation in human environments (joint with Profs. Nilanjan Chakraborty/SBU Mech. Engg. and IV Ramakrishnan), where the robot needs to perform activities reliably and autonomously in the presence of sensor noise, incomplete understanding of the environment, and actuation errors. The current application is to build assistive robots for people with locomotor difficulties. See here for more details on my current and past research; and here for recent research news. Educational Activities: Recent Teaching: Fall 2024: CSE 645, Seminar in Programming Languages (graduate, seminar) Spring 2024: CSE 583, Computer Science Foundations: Programming Abstractions (graduate, bridge) CSE 645, Seminar in Programming Languages (graduate, seminar) Courses taught in the past are listed here. Research Traineeship: I am closely associated with an NSF Research Traineeship program, BIAS-NRT: Detecting and Addressing Bias in Data, Humans, and Institutions (Susan Brennan/SBU Psychology, PI). This traineeship for doctoral students is aimed promoting convergent research combining human-centered sciences (e.g., Psychology, Political Science, Sociology, Linguistics, Economics) and data/computer sciences. As a part of this, it enables non-CS students from human-centered sciences to take Computer Science and Data Sciene graduate courses (and vice versa) to become fluent in each others' disciplines. Graduate Degree Programs: MS and PhD programs in Computer Science: Apply here; contact gradadm@cs.stonybrook.edu for information. MS and PhD programs in Data Science: see linked page for application and contact information. News: SCY-QNet is one of five projects funded in the first phase of NSF National Quantum Virtual Laboratory (NQVL) program (2024--2025). This project is led by Prof. Eden Figueroa/SBU Physics in collaboration with SBU/CS, Columbia University, Yale University, and Brookhaven National Labs. (more...) Quantum Computing and Networks Protocenter, led by Prof. Himanshu Gupta, is funded by SBU's Presidential Innovation and Excellence Fund (2023--2027). This protocenter focuses on solving complex problems related to the design and development of large, scalable, and reliable quantum computing systems. (more...) Robotic Assistant for Aging in Place, led by Prof. Nilanjan Chakraborty/SBU Mech. Engg., is funded by SBU's LINCATS Pilot program (2024--2025). This project is to explore the design and use of a robotic manipulation system to assist the elderly continue to live in their own homes. Caregiving Robot Assistant (CART), led by Prof. IV Ramakrishnan, is funded by U.S. Army (2023--2027). This project is to build a prototype assistive robotic system and evaluate it in its utility in helping patients with ALS and their caregivers. (more...) Last modified: Wed Nov 20 23:12:21 EST 2024",
  "content_length": 4387,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:34"
}