{
  "name": "Casey Fiesler",
  "homepage": "https://caseyfiesler.com",
  "status": "success",
  "content": "Casey Fiesler | #computing #ethics #law #feminism #geek Casey Fiesler #computing #ethics #law #feminism #geek Casey Fiesler is an associate professor and the William R. Payden Endowed Professor in the Department of Information Science (and Computer Science, by courtesy) at the University of Colorado Boulder.  Armed with a PhD in Human-Centered Computing from Georgia Tech and a JD from Vanderbilt Law School, she primarily researches technology ethics and law, human-computer-interaction, and online communities (occasionally all at the same time). [curriculum vitae] Follow me! Bluesky | Mastodon | TikTok | Instagram | LinkedIn | Threads | YouTube Things you might be looking for: casey.prof (social media/content creation landing page) | AI ethics news | computing ethics education resources including the giant syllabi spreadsheet | fiction reading recommendations | PhD application advice | Computer Engineer Barbie remix If you are a prospective graduate student thinking of applying to University of Colorado or a current student interested in working with me, please see this page on my lab’s website. NEWS 09.23.25 I ran sessions devoted to AI ethics and spoke on a panel related to the future of AI in libraries at the Arapahoe Libraries annual staff development event. 09.01.25 The book that I co-authored with Jonathan Lazar, Brian Wentz, and Raja Kushalnagar, Human-Computer Interaction and U.S. Law, is officially up on Cambridge University Press’ website, and will be released at the end of December! 08.28.25 I spoke to NPR about “AI slop” and YouTube’s policies regarding “inauthentic” content. 08.15.25 I was quoted in an article in MIT Technology Review about how people experienced grief following OpenAI’s model update. 08.04.25 I officially launched my online AI ethics syllabus, which is a mostly post-hoc curation of short form videos about AI ethics and policy that I’ve shared online. This document is a work in progress, but my hope is that it can be a resources for both teachers and learners! 07.15.25 I spoke about AI and its impacts on society to a group of middle and high school students as part of the St Vrain Valley School District’s Innovation Center’s STEM summer camp. 07.09.25 I spoke on Engaging with Science Policy Through Traditional and New Media as part of the SCOPE workshop on engaging early career scientists with science policy at the Banbury Center. 07.01.25 This academic year I am the Associate Chair for Graduate Studies for Information Science at CU Boulder. 06.23.25 I gave a keynote talk (“Scraping the Surface: Ownership and Ethics for AI Uses of Public Data”) virtually for the Navigating Generative AI Disclosure, Ownership, and Accountability in Co-Creative Domains workshop at CHIWORK 2025. 06.16.25 I attended the Human Computer Interaction Consortium annual meeting; the topic this year was “The Future of Being Human in a Generative AI World.” 06.14.25 I gave the annual Steve Jones Internet Research Lecture at the International Communication Association conference in Denver; the talk was titled “The Internet is Good for You. The Internet is Bad for You.” 06.07.25 I spoke to The Washington Post about social media algorithms and online identity in the context of the feud between Donald Trump and Elon Musk. 05.07.25 I spoke at the Sociotechnical Seminar Series at Brown University, on the topic of research ethics for use of public data in research and AI. 04.30.25 I spoke to a number of journalists (e.g., for Science and The Atlantic) about a research ethics controversy involving an experiment conducted on Reddit. 04.22.25 My NSF grant on AI education was terminated without explanation, and was featured in media coverage of the terminations, including The New York Times, KUNC, 9 News Denver, and Associated Press. [News Archive] Create a website or blog at WordPress.com Subscribe Subscribed Casey Fiesler Join 1,556 other subscribers Sign me up Already have a WordPress.com account? Log in now. Casey Fiesler Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar",
  "content_length": 4118,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:34"
}