{
  "name": "Casimir A. Kulikowski",
  "homepage": "https://www.cs.rutgers.edu/~kulikows",
  "status": "success",
  "content": "Dr. Casimir A. Kulikowski Board of Governors Professor of Computer Science Department of Computer Science Rutgers, The State University of New Jersey Hill Center, Busch Campus Piscataway, NJ 08855 USA Phone: (848) 445-2001 Email: kulikows AT cs.rutgers.edu Office: CoRE 323 Untitled: Research Interests My major areas of research are artificial intelligence, biomedical and health informatics, and the societal impact of computers, especially in health and historical analysis. In biomedical and health informatics I am working on models for representing underlying knowledge in clinical records and guidelines, on methods of medical clinical support, biomedical imaging and predictive data mining, and on the history of biomedical and health informatics. In artificial intelligence, my concentration is on pattern recognition, clustering, expert problem solving and knowledge representation, and visual reasoning. In imaging it is on clustering and segmentation in large scale image sets, and on the annotation of clinical images within the context of clinical problem-solving using metaphor and language in novel ways. On societal impact, I am investigating the effects of computer technology on medical practice, biomedical research, bioethics, and the history of informatics and its impact on clinical care. HONORS AND AWARDS Honorary Fellow, Greek Biomedical and Health Informatics Association (GBHIA) (2023) Distinguished Fellow, American College of Medical Informatics (ACMI) (2022) Fellow, International Academy of Health Sciences Informatics (IAHSI) (2017) Member, National Academy of Medicine, USA (NAM), previously Institute of Medicine (IOM) of the National Academy of Sciences (NAS) (2017) Working Group of the Year Award - International Medical Informatics Association (IMIA) (2016, 2015, 2014) Honorary Fellow, International Medical Informatics Association (IMIA) (2012) Fellow, American Institute for Medical and Biological Engineering (AIMBE) (2003) Fellow, Institute of Electrical and Electronic Engineers (IEEE) (1995) Fellow, Association for the Advancement of Artificial Intelligence (AAAI) (1991) Member, Institute of Medicine, National Academy of Sciences, USA (IOM-NAS) (1988) Fellow, American Association for the Advancement of Science (AAAS) (1987) Fellow, American Academy of Medical Informatics (ACMI) (1984) Prize Scientific Exhibit, American Academy of Ophthalmology (AAO) (1983) With Reinhold Haux, LC Lun, Francois Gremy At Dr. Gremy's Lifetime Achievement Award Presentation, MEDINFO 2004, San Francisco. PROFESSIONAL EXPERIENCE: Vice-President, International Medical Informatics Association (IMIA) (2006- 2012) Board of Governors Professor, Department of Computer Science, Rutgers University (1997 - present) Director, Laboratory for Computer Science Research, Rutgers University(1985-1996) Chair, Department of Computer Science, Rutgers University (1984- 1990) Director, Rutgers Research Resource on Artificial Intelligence in Medicine (1983- 1990) Distinguished Professor, Department of Computer Science, Rutgers University (1987 - 1997) Professor, Department of Computer Science, Rutgers University (1977 - 1987) Associate Professor, Department of Computer Science, Rutgers University (1974-1977) Assistant Professor, Department of Computer Science, Rutgers University (1970-1974) With Ted Shortliffe and Ed Fiegenbaumat 100th Birthday Celebration of Morrie Collen, San Francisco 2013 . 50th Anniversary of IMIA at MEDINFO, Hangzhou 2017. Otto Rienhoff, Lincoln A. Moura, Hyeoun-Ae Park , George Mihalas, Casimir Kulikowski, and Reinhold Haux SELECTED PROFESSIONAL ACTIVITIES: Vice-Chair, International Medical Informatics Association (IMIA) Working Group on the History of Biomedical and Health Informatics ( 2023 - ) Chair, International Medical Informatics Association (IMIA) Working Group on the History of Biomedical and Health Informatics (2016 - 2022) Chair, Committee of Historians, American College of Medical Informatics (2011 - ) Advisory Committee, ACTION-GRID European Commission Project (2008 - 2011) Editorial Board, International Journal of Software and Informatics (2007 - ) NLM Advisory Committee Long Term Planning, Health Informatics for Underserved and Diverse Populations and Support for Clinical and Public Health Systems in the 21st Century (2005-2006) Committee on Emerging Issues & Data Environmental Contaminants, NRC-NAS (2002-2005) Associate Editor, Artificial Intelligence in Medicine Journal (2001 - ) Co-editor, IMIA Yearbook of Medical Informatics, International Medical Informatics Association - IMIA (2000-2012) Editorial Board, Methods of Information in Medicine (1999 - ) Biomedical Library Review Committee, NLM-NIH (1994 -1999), Chair (1997 - 1999) Editorial Board, Journal of the Am Med Informatics Assoc (JAMIA) (1993 - 1998) Committee Rev Social Security Administration Systems Modernization, NRC-NAS (1988 - 1992) Board of Scientific Counselors, National Library of Medicine, NIH (1984-1987) As Chairman, Rutgers DCS, 1990 EDUCATION: Ph.D. Electrical Engineering, University of Hawaii (1970) M. Sc. Engineering and Applied Science, Yale University (1966) B.E. Electrical Engineering, Yale University (Honors) (1965) Alvaro Margolis (Uruguay), Steven Huesing (Canada), Enrico Coiera (Australia), Diarmuid UaConaill (Ireland), Hyeoun-Ae Park (Korea), Peter Murray (UK), Casimir Kulikowski (USA), Fernando Martin (Spain), Sedick Isaacs (South Africa), Don Detmer (USA), Lincoln Moura (Brazil), Hiroshi Takeda (Japan - in front), Yu-Chuan (Jack) Li (Taiwan), Antoine Geissbuhler (Switzerland), George Mihalas (Romania), Valerio Yacubsohn (Argentina), Reinhold Haux (Germany) -- Universidad Austral, Pilar, Buenos Aires, Argentina, 31 October 2008. RECENT AND SELECTED PUBLICATIONS: Kulikowski C Yarava A. Generative AI Analysis of Topics from IMIA Historical Narratives in Medical Informatics. Proc Medical Informatics Europe - MIE 2024, IOS Press (in press). Mihalas G Kulikowski C Hasman A Saranto K Mantas J. Will Adoption of AI in Medicine Mirror the Evolution of Medical Informatics? Proc. Medical Informatics Europe - MIE 2024, IOS Press (in press). Gonzalez-Alday R Garcia-Cuesta E Kulikowski CA Maojo V A scoping review on the progress, applicability, and future of explainable artificial intelligence in medicine, Applied Sciences, September 2023. Kulikowski CA Desafios de la IA en la Medicina y la Salud: Entre lo Calculado, lo Explicado y lo Predecido, Proc. Jornadas sobre la Inteligencia Artificial: Aplicaciones, tendencias,retos y oportunidades, CEF-UDIMA, Madrid, July 2023. Mihalas G Hasman A Kulikowski CA Mantas J Panel on Current Trends in Biomedical and Health Informatics. Proc. Informatics Management and Technology in Healthcare (ICIMTH) 2023, Athens, July 2023. IOS Press. Mihalas G Kulikowski CA Factors Influencing the Evolution of Topics in Health Informatics, Proc. Informatics Management and Technology in Healthcare (ICIMTH) 2023, Athens, July 2023. Kulikowski CA Greenes RA Shortliffe EH Langlotz C Ohno-Machado L del Fiol G Overhage M Labkoff S Panel on 60+ Years of Changes in Biomedical and Health Informatics, ACMI Committee of Historians, AMIA 2022, November 8, 2022. Kulikowski CA 50 Years of achievements and persistent challenges for biomedical and health informatics and John Mantas’ educational and nursing informatics contributions. Chapter in Achievements, Milestones, and Challenges in Biomedical and Health Informatics. Amsterdam: IOS Press; 2022.. Kingsland LC III, Kulikowski CA. A scientific mind embraces medicine: Donald Lindberg’s education and early career. In: Humphreys BL, Logan RA, Miller RA, Siegel ER, editors. Transforming biomedical informatics and access to health information: Don Lindberg and the U.S. National Library of Medicine. Amsterdam: IOS Press; 2022. Kulikowski CA Mihalas G Greenes RA Park H-A Yacubsohn V (Eds) International Medical Informatics and the Transformation of Healthcare 2021, HIM&CC & IMIA, ISSN 1485-7375, 2021. Kulikowski CA Maojo V Covid-19 Pandemic and Artificial Intelligence: Challenges of ethical bias and trustworthy reliable reproducibility? BMJ Health & Care Informatics 2021; doi: 10.1136/bmjhci-2021-100438. Kulikowski CA Bias in Machine Learning Methods for Healthcare Informatics: Challenges of Equity and Inclusivity, Proc. Romanian Medical informatics (RoMedInf21), Bucharest, September 2021. Kulikowski CA Pandemics: Historically “slow learning curve” leading to biomedical informatics and vaccine breakthroughs 2021 IMIA Yearbook of Medical Informatics, IMIA and Thieme-Verlag, 26-37, 2021. Kulikowski CA Computer Decision Support Systems, AI, and Clinical Ethics: By and For Whom? Proc. 15th Jornadas de Informatica en Salud (Otero, P. Ed), Buenos Aires, November 2020. Kulikowski CA Valerio Yacubsohn – Preeminente Lider Internacional en la Informatica Medica, Proc. 15th Jornadas de Informatica en Salud (Otero, P. Ed), Buenos Aires, November 2020. Kulikowski CA Mihalas G Evolution of Interdisciplinarity in Medical Informatics in Europe: Patterns of Intertwining Histories in Digital Personalized Health and Medicine: Proc MIE 2020, Pape-Haugaard et al (Eds), EFMI and IOS Press, Amsterdam,1113-1117. Kulikowski CA Donald A.B. Lindberg: Inspiring Leader and Visionary in Biomedicine, Healthcare, and Informatics, 2020 IMIA Yearbook of Medical Informatics 2020, IMIA and Thieme-Verlag, 203-208. Kulikowski CA Greenes RA Adlassnig K-P, Bellazzi R Shortliffe EH Panel on the History of Clinical Decision Support: A Six-Decade Retrospective, Proc. World Congress on Medical Informatics - MEDINFO 2019, Lyon, August 2019. Mihalas G Kulikowski CA Roots of Interdisciplinarity in European Medical Informatics, Proc. Inform Management and Technology in Healthcare (ICIMTH), Athens, July 2019. Kulikowski CA Beginnings of Artificial Intelligence in Medicine (AIM): Computational Artifice Assisting Scientific Inquiry and Clinical Art – with Reflections on Present AIM Challenges in IMIA Yearbook of Medical Informatics, IM",
  "content_length": 28814,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:38"
}