{
  "name": "Caterina Cinel",
  "homepage": "https://www.essex.ac.uk/people/cinel32002/caterina-cinel",
  "status": "success",
  "content": "Caterina Cinel | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Caterina Cinel People Dr Caterina Cinel Senior Lecturer School of Computer Science and Electronic Engineering (CSEE) Email ccinel@essex.ac.uk Location 5B.537, Colchester Campus Academic support hours Academic Support Hours on Wednesdays at 14:00-15:00 and Fridays at 11:00-12:00. Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Dr Caterina Cinel is a Senior Lecturer in Brain Sciences and Neural Engineering. She holds a degree in Psychology (Università di Padova, Italy) and an MSc in Cognitive Science (University of Birmingham). She obtained a PhD in Cognitive Psychology (University of Birmingham) with a thesis on multisensory feature integration in normal and brain damage individuals. Since 2004, she has been a member of the Brain-Computer Interface and Neural Engineering Lab (http://essexbcis.uk/) at Essex University, where she has been a postdoc and, since February 2020 a Lecturer . At Essex she investigates decision making and collaborative BCI (based on EEG), multisensory integration and cognitive enhancement. Other research activity includes attention, feature integration in visual and multisensory perception, decision making, memory and applied cognition. She is a member of the British Psychological Society, the Experimental Psychology Society and a Fellow of the Higher Education Academy. Qualifications PhD University of Birmingham, MSc Cognitive Sciences University of Birmingham, Laurea Psychology University of Padua, Appointments University of Essex Research Fellow, CSEE, University of Essex (1/11/2019 - 2/2/2020) Lecturer, CSEE, University of Essex (3/2/2020 - 30/9/2023) Senior Lecturer, CSEE, University of Essex (1/10/2023 - present) Research and professional activities Research interests Cognitive enhancement Open to supervise Brain Computer Interfaces Open to supervise Multisensory perception Open to supervise Neuroergonomics Open to supervise Decision making Open to supervise Memory enhancement Open to supervise Attention tracking Open to supervise Cognitive psychology and neurosciences Open to supervise Conferences and presentations Collaborative BCI per group decision-making Keynote presentation, NATO ORA conference, Copenhagen 2022, 17/10/2022 Collaborative BCI for group decision-making Keynote presentation, Neuroadaptive Systems Technology, 10/10/2022 Teaching and supervision Current teaching responsibilities Neural Engineering Research Methods (CE171) Individual Capstone Project Challenge (CE301) Current supervision Vishnu Pratap Singh Kirar Degree subject: Computer Science Degree type: Doctor of Philosophy Akashdeep Kaur Nijjar Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Zeel Mahendrakumar Pansara Thesis title: Automated Emotion Detection Using Multi-Modal Physiological Signals: A Path Towards Clinical Applications Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 13/10/2025 Rizeng Wu Thesis title: Neurotechnology for Augmenting Group Decision-Making Degree subject: Computing and Electronic Systems Degree type: Master of Science (by Dissertation) Awarded date: 30/7/2025 Ahmet Can Mercimek Thesis title: Erp-Based Bci Speller Based on a Novel Sequential Protocol Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 29/1/2025 Publications Publications (1) Pansara, Z., Navyte, G., Freitas-Mendes, T., Bottger, C., Franco, E., Citi, L., Jacobi, ES., Poerio, GL., Gillmeister, H., Cinel, C. and Feo, VD., (2025). Quantifying Emotional Arousal through Pupillary Response: A Novel Approach for Isolating the Luminosity Effect and Predicting Affective States Journal articles (33) Poli, R., Mercimek, AC. and Cinel, C., (2025). Novel Sequential BCI Speller based on ERPs and Event-Related Slow Cortical Potentials. Journal of Neural Engineering. 22 (3), 036030-036030 Lugo, ZR., Cinel, C., Jeunet, C., Pichiorri, F., Riccio, A. and Wriessnegger, SC., (2023). Editorial: Women in brain-computer interfaces. Frontiers in Human Neuroscience. 17, 1260479- Cinel, C., Fernandez Vargas, J., Tremmel, C., Citi, L. and Poli, R., (2022). Enhancing performance with multisensory cues in a realistic target discrimination task. PLoS One. 17 (8), e0272320-e0272320 Tremmel, C., Fernandez-Vargas, J., Stamos, D., Cinel, C., Pontil, M., Citi, L. and Poli, R., (2022). A meta-learning BCI for estimating decision confidence. Journal of Neural Engineering. 19 (4), 046009-046009 Novak, VD., Kostoulas, T., Muszynski, M., Cinel, C. and Nijholt, A., (2022). Editorial: Harnessing physiological synchronization and hyperscanning to enhance collaboration and communication. Frontiers in Neuroergonomics. 3, 956087- Fernandez-Vargas, J., Tremmel, C., Valeriani, D., Bhattacharyya, S., Cinel, C., Citi, L. and Poli, R., (2021). Subject- and task-independent neural correlates and prediction of decision confidence in perceptual decision making. Journal of Neural Engineering. 18 (4), 046055-046055 Bhattacharyya, S., Valeriani, D., Cinel, C., Citi, L. and Poli, R., (2021). Anytime collaborative brain–computer interfaces for enhancing perceptual group decision-making. Scientific Reports. 11 (1), 17008- Cinel, C., Valeriani, D. and Poli, R., (2019). Neurotechnologies for Human Cognitive Augmentation: Current State of the Art and Future Prospects. Frontiers in Human Neuroscience. 13 (13), 13- Valeriani, D., Cinel, C. and Poli, R., (2019). Brain–Computer Interfaces for Human Augmentation. Brain Sciences. 9 (2), 22-22 Cinel, C., Cortis Mack, C. and Ward, G., (2018). Towards augmented human memory: Retrieval-induced forgetting and retrieval practice in an interactive, end-of-day review. Journal of Experimental Psychology: General. 147 (5), 632-661 Valeriani, D., Cinel, C. and Poli, R., (2017). Group Augmentation in Realistic Visual-Search Decisions via a Hybrid Brain-Computer Interface.. Scientific Reports. 7 (1), 7772- Niforatos, E., Cinel, C., Cortis Mack, C., Langheinrich, M. and Ward, G., (2017). Can Less be More?. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies. 1 (2), 1-22 Valeriani, D., Poli, R. and Cinel, C., (2017). Enhancement of group perception via a collaborative brain-computer interface. IEEE Transactions on Biomedical Engineering. 64 (6), 1238-1248 Cortis Mack, C., Cinel, C., Davies, N., Harding, M. and Ward, G., (2017). Serial position, output order, and list length effects for words presented on smartphones over very long intervals. Journal of Memory and Language. 97, 61-80 Poli, R., Valeriani, D. and Cinel, C., (2014). Collaborative Brain-Computer Interface for Aiding Decision-Making. PLoS ONE. 9 (7), e102693-e102693 Salvaris, M., Cinel, C., Citi, L. and Poli, R., (2012). Novel Protocols for P300-Based Brain–Computer Interfaces. IEEE Transactions on Neural Systems and Rehabilitation Engineering. 20 (1), 8-17 Poli, R., Salvaris, M. and Cinel, C., (2012). A genetic programming approach to the evolution of brain–computer interfaces for 2-D mouse–pointer control. Genetic Programming and Evolvable Machines. 13 (3), 377-405 Cinel, C., Avons, SE. and Russo, R., (2010). Semantic activation and letter search: Blocking or suppression?. Quarterly Journal of Experimental Psychology. 63 (3), 580-594 Poli, R., Citi, L., Salvaris, M., Cinel, C. and Sepulveda, F., (2010). Eigenbrains: the free vibrational modes of the brain as a new representation for EEG. Engineering in Medicine and Biology Society (EMBC), 2010 Annual International Conference of the IEEE. 2010, 6011-6014 Salvaris, M., Cinel, C., Poli, R., Citi, L. and Sepulveda, F., (2010). Exploring multiple protocols for a brain-computer interface mouse. 2010 Annual International Conference of the IEEE Engineering in Medicine and Biology. 2010, 4189-4192 Citi, L., Poli, R. and Cinel, C., (2010). Documenting, modelling and exploiting P300 amplitude changes due to variable target delays in Donchin's speller.. Journal of Neural Engineering. 7 (5), creators-Citi=3ALuca=3A=3A Poli, R., Cinel, C., Citi, L. and Sepulveda, F., (2010). Reaction-time binning: A simple method for increasing the resolving power of ERP averages. Psychophysiology. 47 (3), 467-485 Avons, SE., Russo, R., Cinel, C., Verolini, V., Glynn, K., McDonald, R. and Cameron, M., (2009). Associative and repetition priming with the repeated masked prime technique: No priming found. Memory & Cognition. 37 (1), 100-114 Poli, R., Citi, L., Sepulveda, F. and Cinel, C., (2009). Analogue evolutionary brain computer interfaces. IEEE Computational Intelligence Magazine. 4 (4), 27-31 Cinel, C., Russo, R., Fox, E. and Boldini, A., (2009). RESPONSE. Psychosomatic Medicine. 71 (1), 115-116 Cinel, C., Russo, R., Boldini, A. and Fox, E., (2008). Exposure to Mobile Phone Electromagnetic Fields and Subjective Symptoms: A Double-Blind Study. Psychosomatic Medicine. 70 (3), 345",
  "content_length": 18017,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:39"
}