{
  "name": "Caterina Urban",
  "homepage": "https://caterinaurban.github.io",
  "status": "success",
  "content": "Caterina Urban Caterina Urban Research Scientist (Chargé de Recherche) INRIA École Normale Supérieure 📢 I have open PhD (starting Fall 2026) and postdoc positions! I am a member of the INRIA research team ANTIQUE (ANalyse StaTIQUE). Previously, I was a postdoctoral researcher at the Chair of Programming Methodology, led by Peter Müller at ETH Zurich. I completed my Ph.D. in Computer Science, working under the joint supervision of Radhia Cousot and Antoine Miné at École Normale Supérieure. I hold a Bachelor’s and a Master’s degree in Computer Science, both received with full marks and honors (summa cum laude) from the Università degli Studi di Udine. My research interests span the whole spectrum of formal methods and aim at developing methods and tools to enhance the reliability of computer software and understanding complex software systems. My main area of expertise is static analysis based on abstract interpretation, which provides rigorous mathematical guarantees of the behavior of computer programs. I am currently engaged in a long-term research effort to enhance the understanding and reliability of data science software, which nowadays plays an increasingly important role in critical decision making in fields such as finance and medicine. I am curating a personal (and unfinished) collection of (what I think is) good advice for academics. News (as of July 18th, 2025) 📢    I am the general chair of iFM 2025 in Paris in November 2025! 👥    I am on the program committee of OOPSLA 2026. 👥    I am on the program committee of PLDI 2026. 👥    I am on the program committee of CAV 2026. Interests Static Program Analysis Abstract Interpretation Programming Languages Data Science Machine Learning Education HDR in Computer Science, 2025 École Normale Supérieure | Université PSL, Paris, France PhD in Computer Science, 2015 École Normale Supérieure, Paris, France MSc in Computer Science, 2011 Università degli Studi di Udine, Udine, Italy BSc in Computer Science, 2009 Università degli Studi di Udine, Udine, Italy Research Projects ForML The ForML project investigates the use of abstract interpretation and counterexample-guided abstraction refinement with the purpose of efficiently answering queries about semantic properties of machine learning models such as robustness, fairness, and explainability. We also aim to formally verify existing and novel algorithms for answering such queries, and to derive certified implementations. SAIF The goal of SAIF is to use the vast knowledge accumulated over decades in formal methods to rethink them and address the novel safety concerns raised by machine learning-based systems. Through the synergy of a diverse consortium with complementary expertise, we aim to bring society closer to a state where it can benefit from achievements in machine learning without suffering undue consequences. SeDaNo […page under construction…] Libra The goal of the Libra project is to develop new analyses and tools to reason about and certify fairness of decision-making software. Lyra The Lyra research project is a long-term research effort to enhance the understanding and reliabilty of data science software. It aims ad developing new practical and accessible analyses and tools to reason about and provide rigorous guarantees of the behavior of data analytics, big data, machine learning, and deep learning applications. FuncTion The goal of the FuncTion project was the development of a static analyzer which automatically infers ranking functions and sufficient precondition for program termination (and other liveness properties) by means of abstract interpretation. Recent Publications More Publications Caterina Urban. Static Analyses for the Properties, Programs, and People of Tomorrow. HDR, 2025. PDF Slides Guannan Wei, Zhuo Zhang, Caterina Urban. Hallucination-Resilient LLM-Driven Sound and Tunable Static Analysis. In LMPL, 2025. PDF Project HAL ACM Marco Campion, Isabella Mastroeni, Caterina Urban. Relating Distances and Abstractions: An Abstract Interpretation Perspective. In SAS, 2025. PDF HAL Springer Recent Talks More Talks Termination Resilience Static Analysis Friday, September 26, 2025 1:30 PM Digital Industry Center Seminars, 🇮🇹 Fondazione Bruno Kessler, Italy (remote) Project Static Analysis for Trustworthy and Explainable Machine Learning Tuesday, July 8, 2025 2:20 PM 1ères Journées Scientifiques INESIA, 🇫🇷 Paris, France Project Termination (Resilience) Analysis, and Bugs in Its Implementation Thursday, June 12, 2025 Dagstuhl Seminar 25242 “Testing Program Analyzers and Verifiers”, 🇩🇪 Schloss Dagstuhl, Germany Slides Project People PhD Students Priyanka Maity PhD, Inria & École Normale Supérieure, France: Oct 2025 - Sep 2028 Naïm Moussaoui-Remil PhD, École Normale Supérieure, France: Nov 2023 - Serge Durand (co-supervised with Zakaria Chihani) PhD, Université Paris-Saclay, France: Nov 2021 - Dec 2025 Interns Lorenzo Gazzella (PhD Student, Università di Pisa, Italy) Research Internship, École Normale Supérieure, France: Sep 2025 - Jan 2026 Xiaolin Liu (PhD Student, KTH Royal Institute of Technology, Sweden) Research Internship, École Normale Supérieure, Oct 2025 Alumni Alessandro De Palma Postdoc, Inria & École Normale Supérieure, France: Nov 2023 - Oct 2025 Sarah Dribi Alaoui (Master Student, Institut Polytechnique de Bordeaux, France) M1 Research Internship, Inria & École Normale Supérieure, Jun - Sep 2025 Marco Campion Postdoc, Inria & École Normale Supérieure, France: Feb 2023 - Aug 2025 Guannan Wei Postdoc, Inria & École Normale Supérieure, France: Sep 2024 - Jul 2025 Thomas Winninger (Master Student, Télécom SudParis, France) M1 Research Internship, Inria & École Normale Supérieure, Mar - May 2025 Greta Dolcetti (PhD Student, Università Ca’ Foscari di Venezia, Italy) Research Internship, École Normale Supérieure, France: Sep - Dec 2042 Giacomo Zanatta (PhD Student, Università Ca’ Foscari di Venezia, Italy) Research Internship, École Normale Supérieure, France: Sep - Dec 2042 Denis Mazzucato PhD, École Normale Supérieure, France: Oct 2020 - Dec 2024 Pierre Goutagny (Master Student, École Normale Supérieure de Lyon, France) M2 Research Internship, École Normale Supérieure, France: Mar - Jul 2024 Loïc Chevalier (Master Student, École Normale Supérieure, France) Supervised Research Project, École Normale Supérieure, France: Spring 2024 Naïm Moussaoui-Remil (Master Student, École Normale Supérieure de Rennes, France) M2 Research Internship, Inria & École Normale Supérieure, France: Mar - Aug 2023 Kevin Pinochet (Master Student, University of Chile, Chile) Research Internship, Inria & École Normale Supérieure, France: Jan - Apr 2023 Abhinandan Pal (Bachelor Student, IIIT Kalyani, India) Research Internship, Inria & École Normale Supérieure, France: Nov 2022 - Jan 2023 Abhinandan Pal (Bachelor Student, IIIT Kalyani, India) Research Internship (remote): May - Jul 2022 Ali El Husseini (École Normale Supérieure Paris-Saclay, France) M2 Internship, École Normale Supérieure Paris-Saclay & Inria & École Normale Supérieure, France: Mar - Aug 2022 Luca Negrini (PhD Student, Università Ca’ Foscari Venezia, Italy) Research Internship, Inria & École Normale Supérieure, France: Jan - Apr 2022 Guruprerana Shabadi (Bachelor Student, École Polytechnique, France) L3 Internship, Inria & École Normale Supérieure, France: Jan - Mar 2022 🥇 Winner of the Global Undergraduate Awards 2022 Abhinandan Pal (Bachelor Student, IIIT Kalyani, India) Research Internship (remote): Dec 2021 - Jan 2022 Serge Durand (Master Student, École Normale Supérieure Paris-Saclay, France) M1 Internship, École Normale Supérieure, France (remote): Jun - Aug 2020 Marco Zanella (PhD Student, Università degli Studi di Padova, Italy) Research Internship, Inria & École Normale Supérieure, France (remote): May - Aug 2020 Radwa Sherif Abdelbar (Bachelor Student, German University in Cairo, Egypt) Bachelor’s Thesis, ETH Zurich, Switzerland: Mar - Aug 2018 Lowis Engel (Master Student, ETH Zurich, Switzerland) Bachelor’s Thesis, ETH Zurich, Switzerland: Feb - Aug 2018 Madelin Schumacher (Master Student, ETH Zurich, Switzerland) Master’s Thesis, ETH Zurich, Switzerland: Sep 2017 - Mar 2018 Samuel Ueltschi (Master Student, ETH Zurich, Switzerland) Master’s Thesis, ETH Zurich, Switzerland: Mar - Sep 2017 Mostafa Hassan (Bachelor Student, German University in Cairo, Egypt) Bachelor’s Thesis, ETH Zurich, Switzerland: Mar - Aug 2017 Simon Wehrli (Master Student, ETH Zurich, Switzerland) Master’s Thesis, ETH Zurich, Switzerland: Feb - Aug 2017 Flurin Rindisbacher (Master Student, ETH Zurich, Switzerland) Master’s Thesis, ETH Zurich, Switzerland: Mar - Aug 2017 Severin Münger (Master Student, ETH Zurich, Switzerland) Master’s Thesis, ETH Zurich, Switzerland: Sep 2016 - Mar 2017 Nathanaëlle Courant (Bachelor Student, École Normale Supérieure, France) L3 Internship, ETH Zurich, Switzerland: Jun - Jul 2016 Lukas Neukom (Master Student, ETH Zurich, Switzerland) Master’s Thesis, ETH Zurich, Switzerland: Mar - Sep 2016 Seraiah Walter (Master Student, ETH Zurich, Switzerland) Master’s Thesis, ETH Zurich, Switzerland: Feb - Aug 2016 Teaching Year 2025-2026 Abstract Interpretation: Application to Verification and Static Analysis M2, Master Parisien de Recherche en Informatique (MPRI), Université de Paris, France Year 2024-2025 Abstract Interpretation-Based Static Analysis for Machine Learning Safety and Security 4th Summer School on Security Testing and Verification (ST&V 2025), Brussels, Belgium Static Analysis by Abstract Interpretation and Applications to Security and Machine Learning Oregon Programming Languages Summer School 2025 (OPLSS 2025), Eugene, USA Abstract Interpretation: Application to Verification and Static Analysis M2, Master Parisien de Recherche en Informatique (MPRI), Université de Paris, France Year 2023-2024 Formal Methods for Machine Learning Pipelines Lipari Summer School on Abstract Interpretation 2024 (LSSAI 2024), Lipary, Italy. Formal Methods",
  "content_length": 12298,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:39"
}