{
  "name": "Catherine Blake",
  "homepage": "https://ischool.illinois.edu/people/catherine-blake",
  "status": "success",
  "content": "Catherine Blake | School of Information Sciences School of Information Sciences Search Visit What is an iSchool? Request Information Upcoming Events Tuition & Financial Support Recruitment & Admissions Staff iSchool Ambassadors Student Videos Academics Undergraduate Graduate Informatics Programs Course Catalog People Dean's Cabinet Faculty Staff Adjuncts & Affiliates Emeriti Faculty Doctoral Students Committees School Directory Research Areas Projects Vision Labs Services Showcase Research Fellows Scholars-in-Residence Postdoctoral Researchers Videos Engage Corporate Recruit iSchool Talent Give Host a Practicum Alumni Dean's Council Student Life Academic Support Center Student Development Opportunities Student Organizations Convocation Practicum & Career Courses Career Support Help Desk News News Feed Events Calendar In the Media Publications Upcoming Events Lectures Awards About Strategic Plan History Data and Reporting iSchool at a Glance Building Facilities Community Job Openings Contact Us Catherine Blake Catherine Blake CV Professor PhD, Information and Computer Science, University of California, Irvine Room 5090, 614 E. Daniel St. (217) 333-0115 clblake@illinois.edu https://publish.illinois.edu/catherineblake Other professional appointments Health Innovation Professor, Carle Illinois College of Medicine Faculty Affiliate, Department of Computer Science Faculty Affiliate, National Center for Supercomputing Applications Faculty Affiliate, Personalized Nutrition Initiative Faculty Affiliate, Informatics Faculty Affiliate, Center for Health Informatics Research focus Biomedical informatics, natural language processing, evidence-based discovery, learning health systems, socio-technical systems, data analytics, literature-based discovery. Biography Catherine Blake is a professor in the School of Information Sciences and Health Innovation Professor in the Carle Illinois College of Medicine at the University of Illinois Urbana-Champaign (UIUC). She holds a courtesy appointment in the Department of Computer Science and is affiliated with the National Center for Supercomputing Applications (NCSA), Informatics, Center for Health Informatics, and the Personalized Nutrition Initiative (PNI). She currently serves as the principal investigator for the NSF's Midwest Big Data Innovation Hub (MBDH, NSF abstract) and is leading a study to assess the use of Artificial Intelligence for targeted search (CSL/Behring). She is co-PI for projects to develop a cadre of health data literacy ambassadors (a collaborative effort with UIUC extension to reach teens (data literacy project); extend text mining methods to identify critical facets of privacy statements (CISCO) and estimate risk as part of a big data-theoretic approach to quantify organizational failure mechanisms in probabilistic risk assessment (NSF abstract). She served as program director for the iSchool's master’s degree in information management (MS/IM) and the campus-wide MS in bioinformatics programs (2019-2022) and as associate director for the Center for Informatics Research in Science and Scholarship (2011-2021).Blake's research explores both human and automated methods to synthesize evidence from text. She brings industrial experience as a software developer, formal training in information and computer science, and almost two decades of research experience in text mining and natural language processing, primarily in biomedicine. Much of her work centers around the Claim Framework that provides both a conceptual framework along with a set of automated methods that extract key findings from empirical studies in medicine, toxicology, and epidemiology that was developed as part of a grant on evidence-based discovery (NSF abstract). She has also explored text mining in humanities to detect authorship from movie reviews, and in news stories to recognize textual entailment in news stories and create multiple document summaries.Blake earned master's and doctoral degrees in information and computer science at the University of California, Irvine and bachelor's and master's degrees in computer science at the University of Wollongong. Courses currently teaching Fall 2025 - Independent Study - IS389CLB Fall 2025 - Independent Study - IS589CLB Spring 2026 - Practicum - IS549CLB Spring 2026 - Independent Study - IS589CLB Office hours By appointment, please contact professor. Active Research Projects BD Hubs: Collaborative Proposal: Midwest: Midwest Big Data Hub: Building Communities to Harness the Data Revolution Completed Research Projects Information Forum Requirements to Promote Knowledge Capture, Knowledge Sharing, and Community Interaction on the VHA Data Portal Socio-technical Data Analytics (SODA) Education Towards Evidence-Based Discovery Big Data-Theoretic Approach to Quantify Organizational Failure Mechanisms in Probabilistic Risk Assessment In the News iSchool well represented at ASIS&T 2025 November 10 2025 Midwest Big Data Innovation Hub wins Synergy Award June 3 2025 iSchool participation in iConference 2025 March 11 2025 iSchool researchers present at iConference 2024 April 22 2024 Blake named associate dean for academic affairs July 10 2023 Blake to join IAspire Leadership Academy November 7 2022 iSchool well-represented at ALISE and ASIS&T October 24 2022 Blake to deliver keynote at HSLI September 6 2022 Blake joins Carle Illinois as a Health Innovation Professor July 7 2022 New approach improves systematic reviews of scientific literature April 22 2022 Research Areas: Data Analytics and Human Centered Data Health, Medical, and Bio-Informatics Information Literacy Information Practices and Behaviors Artificial Intelligence and Machine Learning Natural Language Processing, Text Mining, Text Analysis, Computational Linguistics Information Policy FATE (fairness, accountability, transparency, ethics) Science of Science School of Information Sciences 501 E. Daniel St. MC-493 Champaign, IL 61820-6211 Voice: (217) 333-3280 Fax: (217) 244-3302 Email: ischool@illinois.edu About Cookies Back to top",
  "content_length": 6052,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:40"
}