{
  "name": "Cathy Wu 0001",
  "homepage": "http://bioinformatics.udel.edu/people/personnel/cathy_wu",
  "status": "success",
  "content": "Cathy Wu, PhD | Center for Bioinformatics & Computational Biology Cathy Wu, PhD Unidel Edward G. Jefferson Chair in Engineering and Computer ScienceFounder, Center for Bioinformatics & Computational Biology (CBCB)Director, Data Science Institute (DSI)Director, Protein Information Resource (PIR)Professor, Computer & Information SciencesProfessor, Biological Sciences Research Interests Computational Biology and Bioinformatics Data Science: Protein Informatics, Biological Text Mining and and Natural Language Processing, Ontology and Semantic Computing, Gene-Disease-Drug Knowledge Network Analytics, Artificial Neural Networks and Machine Learning, Cyberinfrastructure Professional Preparation BS, Plant Pathology, National Taiwan University, Taiwan, 1978MS, Plant Pathology, Purdue University, West Lafayette, IN, 1982PhD, Plant Pathology, Purdue University, West Lafayette, IN, 1984Postdoc, Molecular Biology, Michigan State University, East Lansing, MI, 1986MS, Computer Science, University of Texas at Tyler, Tyler, TX, 1989 Appointments Founding Director, Data Science Institute (DSI), University of Delaware (UD), Newark, Delaware, 2018–Present Unidel Edward G. Jefferson Chair in Engineering and Computer Science; Founding Director, Online Graduate Certificate in Applied Bioinformatics (2017–Present) & Online Graduate Certificate in Biomedical Informatics and Data Science (2019–Present), UD, 2017–Present Director, PhD Program in Bioinformatics and Systems Biology (renamed as PhD Program in Bioinformatics Data Science in 2021), UD, 2012–Present Director, Master of Science (MS) in Bioinformatics & Computational Biology; ProfessionalScience Master’s (PSM) in Bioinformatics; and Graduate Certificate in Bioinformatics, UD, 2010–Present Edward G. Jefferson Chair and Director, Center for Bioinformatics & Computational Biology;Professor, Department of Computer & Information Sciences and Department of BiologicalSciences; University of Delaware (UD), 2009–Present Co-Director, Bioinformatics Track, M.S. Degree in Biochemistry and Molecular Biology, GUMC,2008–Present Professor (2001-2008), Adjunct Professor (since 2009), Department of Biochemistry andMolecular & Cellular Biology; Member, Lombardi Comprehensive Cancer Center, Georgetown University Medical Center(GUMC), 2001–Present Director of Bioinformatics (1999-2001), Director (since 2001), Protein Information Resource(PIR), Georgetown University (since 1999) and University of Delaware (since 2009), 1999–Present Assistant Professor (1990–1994), Associate Professor (1994–1998), Professor (1998–1999), Department of Epidemiology & Biomathematics, University of Texas Health Center at Tyler, 1990–1999 Assistant Professor, Department of Mathematics and Computer Science, University of Texas at Tyler, 1989–1994 Research Scientist, Dept. of Plant Pathology & Microbiology, Texas A&M University, 1986–1987 Postdoctoral Fellow, MSU-DOE Plant Research Laboratory, Michigan State University (Advisor:Christopher R. Somerville, Member, National Academy of Sciences),1985–1986 Books Wu CH, Arighi CN and Ross KE (Editors) (2017). Protein Bioinformatics: From Protein Modifications and Networks to Proteomics. Series Methods in Molecular Biology, Volume 1558, Series Editor: Walker, John M. 472p. Humana Press. ISBN: 978-1-4939-6781-0; DOI: 10.1007/978-1-4939-6783-4 Wu CH and Chen C. (Editors) (2011). Bioinformatics for Comparative Proteomics. Series Methods in Molecular Biology, Volume 694, Series Editor: Walker, John M. 387p. Humana Press. ISBN: 978-1-60761-976-5. Wang J, Wu CH and Wang P. (Editors) (2003) Computational Biology and Genome Informatics. World Scientific. ISBN 981-238-257-7. Wu CH and McLarty J. (2000) Neural Networks and Genome Informatics. Methods in Computational Biology and Biochemistry, Volume 1, Series Editor: Konopka, AK. 205 p. Elsevier Science. ISBN 0 08 042800 2. Refereed Publications (>290 peer-reviewed publications) Google Scholar (>48,000 citations, h-index: 71)NIH MyBibliographyResearchGate Delaware Biotechnology Institute590 Avenue 1743, Suite 147Newark, DE 19713Phone:  302-831-8869Email:  wuc@udel.edu Website Google Scholar NIH Biosketch Curriculum Vitae View All Faculty",
  "content_length": 4184,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:50"
}