{
  "name": "Catherine Combes",
  "homepage": "http://perso.univ-st-etienne.fr/combes",
  "status": "success",
  "content": "Catherine COMBES Snail mail: Catherine COMBES Laboratoire Hubert Curien 18 rue du Professeur Benoit Lauras F42000 Saint-Etienne FRANCE E-mail: catherine[dot] combes[at] univ–st–etienne [dot] fr Short bio I defended my Phd in 1994 at the University of Clermont-Ferrand (France). Since 1995, I am assistant professor at the University Jean Monnet (UJM) of Saint-Etienne and I am member of the Laboratoire Hubert Curien UMR CNRS 5516 in the Machine Learning Team . Research interests Artificial intelligence - Deep learning Data mining Forecasting and decision Complex data - Imbalanced Data Amoroso's family distributions (specially, Generalized Extreme Value and 4th-parameter Generalized Gamma Distributions): Fitting. Application domain: Health care Publications International journals: C.COMBES, H.K.T. Ng, On parameter estimation for Amoroso family of distributions, Mathematics and Computers in Simulation,  Volume 191, 2022, p. 309-327. ISSN 0378-4754, (IF : 2.463) A. DORAI, V. FRESSE, C. COMBES, E-B BOURENNANA, A. MTIBAA, A collision management structure for NoC deplayment on multi-FPGA. Microprocessors and Microsystems, 49, 2017, p. 28-43. V. FRESSE, C. COMBES, M. PAYET, F. ROUSSEAU, Methodological Framework for NoC Resources Dimensioning on FPGAs. Procedia Computer Science 56(1), 2015, DOI: 10.1016/j.procs.2015.07.225, p. 391-396. C. COMBES, J. AZEMA, Inference of Markov Chain Models by Using k-Testable Language: Application on Aging People. Transactions On Computational Collective Intelligence XVII. Lecture Notes in Computer Science, 2014, p. 89-106.C. COMBES, J. AZEMA, Clustering using principal component analysis applied to autonomy-disability of elderly people. Decision Support Systems, 55, 2013, p. 578–586 http://dx.doi.org/10.1016/j.dss.2012.10.016.H. FEI, N. MESKENS, C. COMBES, C. CHU, Endoscopy Scheduling Problem: a case study dealing with two specialized operating rooms, International Journal of Production Economics, Volume 120, Issue 2, August 2009, p. 452-462 International Journal of Production Economics, January 2009. DOI information: 10.1016/j.ijpe.2007.09.016. O. GOMES, C. COMBES, A. DUSSAUCHOY, Parameter estimation of the generalized gamma Distribution,  Mathematics and Computers in Simulation, Volume 79, Issue 12, 15 December 2008, ISSN : 0378-4754, p. 955-963. C. COMBES, C. RIVAT. A modelling environment based on data warehousing to manage and to optimize the running of international company, International Journal of Production Economics, Volume 112, Issue 1, March 2008, p. 294-308. C. COMBES, N. MESKENS, C. RIVAT and J.P. VANDAMME, Using KDD Process to forecast the duration of surgery, International Journal of Production Economics, Volume 112, Issue 1, March 2008, p. 279-293. C. COMBES, A. DUSSAUCHOY, Generalized Extreme Value distribution for fitting opening/closing asset prices and returns in stock-exchange, Operational Research: An International Journal. Springer, Editor in chief Constantin Zopounidis, Vol. 6 (1), January-April 2006, p. 3-26. C. COMBES, Contribution of modelling and simulation to health care systems, Health and System Science, Edition Hermès, Volume 4, 2000, p. 11-31. National journals: C. COMBES, A. DUSSAUCHOY, N. MESKENS, Un modèle de loi bidimensionnelle : application aux différentes durées liées à l'activité chirurgicale, Journal de la Société Française de Statistique - JSFdS-RSA, Tome 149, n°3, 2008.H. FEI, N. MESKENS, C. COMBES, C. CHU, Planification de l'activité d'endoscopie, Edité par le comité de ROADEF'06, Presses de Valenciennes, 2006, 291-306, ISBN 2-905725-83-4 [25 papiers retenus sur 43].C. COMBES, C. GERTOSIO, A. DUSSAUCHOY, Simulation de l’activité d’un bloc opératoire utilisant des données expérimentales, Vol 7-2003, n° 3-4 de Santé et Systémique (Ed. Lavoisier-Hermès), p. 85-106. International conferences and workshops: V. FRESSE, C. COMBES, H. BELHASSEN, Mathematical models applied to on-chip network on FPGA for resource estimation. 17th IEEE International Conferences on Computational Science and Engineering (CSE2014), Chengdu, China, Dec. 19-21, 2014, Chengdu, China.C. COMBES, F. KADRI, S. CHAABANE, Predicting hospital length of stay using regression models: application to emergency department. 10th International Conference of Modeling and Simulation - MOSIM’14 – November 5-7 - Nancy – France.C. COMBES, Cluster analysis of patients suffering from addictions. Trends in Practical Applications of Heterogeneous Multi-Agent Systems.  The PAAMS Collection Advances in Intelligent Systems and Computing. Salamanca. Spain. Volume 293, June 4th-6th 2014, pp 69-77.C. COMBES, J. AZEMA, Contribution of Probabilistic Grammar Inference with K-Testable Language for Knowledge Modeling: Application on aging people. In: Proceedings of 5th International Conference on Agents and Artificial Intelligence - ICAART, 15-17 feb 2013, Barcelone, Espagne. Vol 1, pp. 451-460. ISBN 978-989-8563-38-9. RG C (Core List). TS 14% (Full Paper).J-W. van't KLOOSTER ,  C. COMBES, B-J. van BEIJNUM, Towards decision support for a home care services platform, WI&C 2012, 4th International Workshop on Web Intelligence & Communities, April 16th 2012,  collocated with the WWW 2012 conference, Lyon - France. p. 48-54. ACM. ISBN 978-1-4503-1189-2. C. COMBES, J. AZEMA, Clustering using principal component analysis: application of elderly people autonomy-disability, 8e Conférence Internationale de MOdélisation et SIMulation - MOSIM’10 - 10 au 12 mai 2010 - Hammamet – Tunisie. RG UO. ROUX, D. DUVIVIER, E. RAMAT, G. QUESNEL, C. COMBES, UML-statechart modeling tool for the VLE simulator: an application to a chronic renal dialysis unit,  8e Conférence Internationale de MOdélisation et SIMulation - MOSIM’10 - 10 au 12 mai 2010 - Hammamet – Tunisie.O. GOMES, C. COMBES, A. DUSSAUCHOY. Decisional System Modelling: A Methodological Framework To Help in Decisional System designing, EPIA. 3-7 décembre 2007. Guimaraes (Portugal). p.451-462.O. GOMES, C. COMBES, A. DUSSAUCHOY, A metamodel to manage OLAP information. IEEE International conference on Digital Information Management Regular sessions (ICDIM - http://icdim.insa-lyon.fr/CFP.php). 28-31 octobre 2007. Lyon, France. p. 43-48. O. GOMES, C. COMBES, A. DUSSAUCHOY. Decisional System Modelling: A Methodological Framework To Help in Decisional System designing. New trend in artificial intelligence, p. 451-462. C. COMBES, JP. VANDAMME, N. MESKENS, A. DUSSAUCHOY, Identification of bivariate Gamma probability distribution model to fit different periods of time related to surgical activity, International Conference on Industrial Engineering and Systems Management (IESM 2007).H. FEI , D. DUVIVIER, C. COMBES, N. MESKENS. Planning and scheduling of endoscopic activities by taking into account the availability of recovery beds. Fifth International Conference on Quantitative Modelling in the Management of Healthcare, London, 2-4 April 2007.C. COMBES, J.P. VANDAMME, N. MESKENS, A. DUSSAUCHOY. Identification of bivariate Gamma probability distribution model to fit different periods of time related to surgical activity. International Conference on Industrial Engineering and Systems Management (Beijing, China).O. ROUX, C. COMBES, D. DUVIVIER, A modeling methodology dedicated to simulation and based on generic meta-models using MDA-UML: an application to a chronic renal dialysis unit, IEEE/ICSSSM conference, October  2006, Troyes - France. ISBN: 1-4244-0451-7 (CD-ROM). H. FEI, C. COMBES, N. MESKENS, C. CHU, Endoscopies scheduling problem: a case study, Conférence INCOM 06, May 17-19, 2006, Saint-Etienne (France), vol 3, p. 635-640. [Award: prize for the best paper within the track “Innovative Engineering Techniques in Healthcare Delivery”]. A. ELKHYARI, C. COMBES, Using constraint programming for solving dynamic scheduling in the endoscopy unit, Conférence INCOM 06, May 17-19, 2006, Saint-Etienne (France), vol 3, p. 707-712. (603 papiers soumis pour 361 acceptés – taux d’acceptation 59%).C. COMBES, N. MESKENS, H. FEI, M. GOURGAND, A methodological framework dedicated to hospital supply chain management with the combination of data warehousing and data mining, ILS’06, International Conference on Information Systems, Logistics and Supply Chain, May 15-17, 2006, Lyon  - France. C. COMBES, N. MESKENS, P. LEVECQ, C. RIVAT, J.P. VANDAMME, Using KDD Process to Predict the Duration of Surgery, International Conference on Industrial Engineering and Systems Management, IESM 2005, May 16 – 19, Marrakech - Morocco. ISBN 2-9600532-0-6 (CD-ROM).C. COMBES, C. RIVAT, A modeling environment based on data warehouse approach to manage and optimize business company abroad, International Conference on Industrial Engineering and Systems Management, IESM 2005, May 16 – 19, Marrakech - Morocco. ISBN 2-9600532-0-6 (CD-ROM).O. GOMES, C. COMBES, A. DUSSAUCHOY, Parameter estimation of the generalized gamma distribution, 5th Mathmod congress, Vienna University of Technology, Vienna (Autria) February 8 – 10, 2006.O. GOMES, C. COMBES, A. DUSSAUCHOY, Four-Parameter Generalized Gamma Distribution used for Stock Return Modelling, Computational Engineering in Systems Applications, IMACS Multiconference, October 4 – 6, 2006.O. ROUX, C. COMBES, D. DUVIVIER, A modeling methodology dedicated to simulation and based on generic meta-models using MDA-UML: an application to a chronic renal dialysis unit, conférence IEEE/ICSSSM, October 25-27 , 2006, Troyes (France). (500 papiers soumis pour 284 acceptés – Taux d’acceptation 57%). C. GERTOSIO, C. COMBES, A. DUSSAUCHOY, Towards a methodology to simulate an organization from a UML modeling: An operational efficiency for chronic renal dialysis unit, The 6th Edition of the International Conference on Industrial Engineering and Production Management Conference (IEPM 2003), 26-28 mai 2003, Porto - Portugal, Vol 2, p. 218-226.French conferences: C. COMBES, A. DUSSAUCHOY, N. MESKENS, Apports de la loi de probabilité GEV pour la modélisation des durées opératoires et d’évolution du degr",
  "content_length": 14898,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:41"
}