{
  "name": "Catia Trubiani",
  "homepage": "http://cs.gssi.it/catia.trubiani",
  "status": "success",
  "content": "Catia Trubiani, Ph.D. in Computer Science Gran Sasso Science Institute (GSSI) viale Luigi Rendina, 26-28, 67100 LâAquila, Italy catia.trubiani@gssi.it \"... if you don't know then guess it precisely...\" quote from Fred Brooks at 3rd Heidelberg Laureate Forum Upcoming events: International Conference on Performance Engineering - ICPE 2026 International Conference on Software Analysis, Evolution and Reengineering - SANER 2026 International Symposium on Software Engineering for Adaptive and Self-Managing Systems - SEAMS 2026 International Conference on Software Architecture - ICSA 2026 Short bio I am Associate Professor in Computer Science at the Gran Sasso Science Institute (GSSI), L’Aquila (AQ), Italy. Before joining the GSSI, I have been with various international research institutes like the Karlsruhe Institute of Technology in Germany, and the Imperial College of London in UK. Among various projects, I am scientific coordinator for the MUR-PRIN project DREAM under the Young Line action. My main research interests include the quantitative modelling and analysis of interacting heterogeneous distributed systems. Some topics of interest include software performance, software reliability, software architectures, model-based software testing. Recent applications target federated learning systems, cyber-physical systems, and multi-agent systems. I hold the National scientific qualification as Full Professor in Italian Universities in Computer Science (01/B1) and Computer Engineering (09/H1). Highlights 2024: Ten Year Most Influential Regular Paper Award for International Journal on Software and Systems Modeling (SoSyM) [certificate] 2022: Editorial Board member for Journal of Systems and Software (JSS), Elsevier [JSS editorial board] 2021: Ten Year Most Influential Paper Award for International Conference on Performance Engineering (ICPE) [certificate] 2019: Marie Sklodowska-Curie Individual Fellowship Action Seal of Excellence provided by the European Commission for the project proposal \"PLUS: Performance Learning for Uncertainty of Software\" [certificate] 2017: selected for participation as Young Global Changer to The Think 20 Summit G20 Germany 2017 (acceptance: 8%) [certificate] 2015: selected for participation to 3rd Heidelberg Laureate Forum HLF 2015 (acceptance: 10%) [certificate] Awards 2025: Best Paper Award at European Conference on Software Architecture (ECSA) [certificate] 2024: Research Distinguished Reviewer for International Symposium on Software Reliability Engineering (ISSRE) [link, certificate] 2024: Distinguished Reviewer Award for International Conference on Software Maintenance and Evolution (ICSME) [certificate] 2024: Honorable Mention (Review Quality) for the European Conference on Software Architecture (ECSA) [certificate] 2024: Distinguished Reviewer for the International Conference on Software Testing (ICST) [certificate] 2024: Best Reviewer Award for the International Conference on Performance Engineering (ICPE) [certificate] 2023: Best Paper Award for Journal of Systems and Software (JSS) submissions in 2022 [paper] 2022: Best Reviewer Award for the European Conference on Software Architecture (ECSA) [certificate] 2022: Best Reviewer Award for the International Conference on Software Testing, Verification and Validation (ICST), [certificate] 2021: Best Reviewer Award for the International Conference on Software Architecture (ICSA) [certificate] 2018: Exceptional Reviewer Award for the International Conference on Software Architecture (ICSA) [certificate] 2016: Outstanding Contribution in Reviewing from the Editors of the Journal of Systems and Software, Elsevier [certificate] 2015: Best Paper Award at European Conference on Software Architecture (ECSA) [certificate] 2014: Best Poster Award at International Conference on Component-Based Software Engineering and Software Architecture (CompArch) [certificate] 2013: ACM SIGSOFT Sof. Eng. Notes reports our QoSA paper in the list of Top 10 Downloaded Articles [link] 2011: Best Paper Award at International Conference on Performance Engineering (ICPE) [certificate] Program Committee (latest) International Conference on Software Engineering (ICSE 2026) International Conference on Software Analysis, Evolution and Reengineering (SANER 2026) International Symposium on Software Engineering for Adaptive and Self-Managing Systems (SEAMS 2026, SEAMS 2025, SEAMS 2024) International Conference on Software Architecture (ICSA 2026, ICSA 2025, ICSA 2024) International Symposium on Empirical Software Engineering and Measurement - Emerging Results and Vision Track (ESEM-NIER 2025) International Symposium on Software Reliability Engineering (ISSRE 2024, ISSRE 2023) International Conference on Software Testing, Verification and Validation (ICST 2024) International Conference on Software Maintenance and Evolution (ICSME 2024, ICSME 2023) International Conference on Performance Engineering (ICPE 2024, ICPE 2023) European Conference on Software Architecture (ECSA 2024) International Conference on the Foundations of Software Engineering (FSE) Posters Track (Posters@FSE 2024) Organizing Committee (most relevant roles) General co-Chair for the International Conference on Performance Engineering (ICPE 2026) Program co-Chair for the Diversity, Inclusion and Newcomers initiative for the International Conference on Software Analysis, Evolution and Reengineering (Diversity @ SANER 2026) Program co-Chair for the Research Technical Track for the International Symposium on Software Reliability Engineering (Research Track @ ISSRE 2025) Program co-Chair for the Short Papers, Vision and Emerging Results Track for the International Conference on Software Testing (NIER @ ICST 2025) Program co-Chair for the Research Technical Track Program co-Chair for the European Conference on Software Architecture (Research Track @ ECSA 2023) Program co-Chair for the Research Technical Track Program co-Chair for the International Conference on Performance Engineering (Research Track @ ICPE 2020) Editorial service Editorial Board member for Journal of Systems and Software (JSS), Elsevier [more details]. Editorial Board member for ACM Transactions on Autonomous and Adaptive Systems (TAAS), ACM Digital Library [more details]. Co-Editor for Empirical Software Engineering, Springer, special Issue on \"Software Performance\" together with: Tse-Hsun (Peter) Chen, Concordia University, Canada; Cor-Paul Bezemer, University of Alberta; Andre van Hoorn, University of Stuttgart, Germany; Weiyi Shang, Concordia University, Canada [more details]. Education Ph.D. in Computer Science at the University of L’Aquila (AQ), Italy. Title of the thesis: \"Automated generation of architectural feedback from software performance analysis results\", [PhD Thesis - download]. Master’s Degree in Computer Science at the University of L’Aquila (AQ), Italy, final rank: 110/110 cum laude. Title of the thesis: \"Design and composition of Performance models for Osi Security Architecture\". Bachelor’s Degree in Computer Science at the University of L’Aquila (AQ), Italy, final rank: 110/110 cum laude. Title of the thesis: \"Evaluation of services in Publisher/Subscriber architectures with Petri Nets\". Scientific Secondary School \"Albert Einstein\" of Teramo (TE), Italy, final rank: 100/100. Latest Publications Ivan Compagnucci, Riccardo Pinciroli, and Catia Trubiani \"Experimenting Architectural Patterns in Federated Learning Systems\", Journal of Systems and Software (JSS), 2025, [preprint] Yelyzaveta Kurkchi and Catia Trubiani \"Ethics-Based Requirements for Engineering Cyber-Physical Systems: a Literature Study\", Euromicro Conference Series on Software Engineering and Advanced Applications (SEAA), 2025, to appear, [preprint] J. Andres Diaz-Pace, Catia Trubiani, and David Garlan \"Data-driven Understanding of Design Decisions in Pattern-based Microservices Architectures\", European Conference on Software Architecture (ECSA), 2025, to appear, [preprint] Alberto Avritzer, Andrea Janes, Andrea Marin, Catia Trubiani, Andre van Hoorn, Matteo Camilli, Daniel S. Menasche, and Andre B. Bondi \"Software Aging Detection and Rejuvenation Assessment in Heterogeneous Virtual Networks\", IEEE Transactions on Emerging Topics in Computing (TETC), 2025, [preprint] Ivan Compagnucci, Riccardo Pinciroli, and Catia Trubiani \"Performance Analysis of Architectural Patterns for Federated Learning Systems\", International Conference on Software Architecture (ICSA), 2025, [preprint] Alberto Avritzer, Andrea Janes, Catia Trubiani, Helena Rodrigues, Yuanfang Cai, Daniel Sadoc Menasche, and Alvaro Jose Abreu de Oliveira \"Architecture and Performance Antipatterns Correlation in Microservice Architectures\", International Conference on Software Architecture (ICSA), 2025, [preprint] Luciana Brasil Rebelo dos Santosa, Erica Ferreira de Souza, Andre Takeshi Endo, Catia Trubiani, Riccardo Pinciroli, and Nandamudi Lankalapalli Vijaykumar \"Performance regression testing initiatives: a systematic mapping\", Journal of Information and Software Technology (IST), 2025, [preprint] Willem Meijer, Catia Trubiani, and Aldeida Aleti \"Experimental evaluation of architectural software performance design patterns in microservices\" Journal of Systems and Software (JSS), 2024, [open access] Publications from the DBLP Dagstuhl Seminars and Shonan Meetings (latest) Shonan Meeting no. 241, February 9 - 12, 2026 [more details] \"Patterns and Practices in AI Engineering and Governance\" organized by Hironori Washizaki (Waseda University / National Institute of Informatics, Japan), Foutse Khomh (Polytechnique Montreal / MILA, Canada), Qinghua Lu (DATA61, CSIRO, Australia), Shaukat Ali (Simula Research Lab, Norway). GI-Dagstuhl Seminar 24182, April 28 - May 3, 2024 [more details] \"Resilience and Antifragility of Autonomous Systems\" organized by Simon Burton (Gerlingen, DE), Radu Calinescu (University of York, GB), Raffaela Mirandola (KIT - Karlsruhe Institute of Technology, DE). Shonan Meeting no. 204, N",
  "content_length": 14930,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:46"
}