{
  "name": "Ce Zhu",
  "homepage": "http://www.avc2-lab.net/~eczhu",
  "status": "success",
  "content": "Lab of Advanced Visual Communications & Computing (AVC2) – 视频通信与智能计算实验室 跳至内容 Ce ZHU IEEE/Optica/IET/AAIA Fellow ChangJiang Distinguished Professor Dean, Glasgow College University of Electronic Science and Technology of China (UESTC) Email: eczhu@uestc.edu.cn Biography Honors & Awards Research Grants as PI Professional Activities Keynote/Invited Talks Teaching & Supervision Standardization Proposals& Patents Publications 1. Biography Ce ZHU is a ChangJiang (Cheung Kong) Distinguished Professor at the University of Electronic Science and Technology of China (UESTC), China, and serves as the Dean of Glasgow College, a joint school between the University of Glasgow, UK and UESTC, China, since 2022. He has also been an Affiliate Professor of James Watt School of Engineering, University of Glasgow, UK, since 2023 (https://www.gla.ac.uk/schools/engineering/staff/cezhu). He has been leading the Lab of Advanced Visual Communication & Computing, UESTC, as the Founding Director since 2012. He was with Nanyang Technological University (NTU), Singapore, for 14 years from 1998 to 2012, where he was a Research Fellow, a Program Manager, an Assistant Professor and then promoted to an Associate Professor in 2005. Additionally, he held visiting positions at Queen Mary University of London (UK) in 2008, and Nagoya University (Japan) in 2011. Previously, he pursued postdoctoral research at the Chinese University of Hong Kong, Hong Kong, in 1995, City University of Hong Kong, Hong Kong, and the University of Melbourne, Australia, from 1996 to 1998. He received his B.S. degree from Sichuan University, Chengdu, China, in 1989, and his M.Eng and Ph.D. degrees from Southeast University, Nanjing, China, in 1992 and 1994, respectively, all in electronic and information engineering. His research interest lies in the general areas of visual information processing, multimedia signal processing and systems, specializing in image/video coding and processing, 3D video, (AI-enabled) visual analysis, perception and applications. He has authored or co-authored over 400 publications, which have received 15,000+ citations (H-index: 63) in Google Scholar. As the lead editor, he has edited three books and contributed five book chapters. He co-authored a book entitled “Tensor Computation for Data Analysis” (Springer) released in 2021. He has filed more than 130 patents (103 granted with 4 transferred and 10 PCT). He has contributed 94 proposals (38 adopted) to the JVET, JCT-3V, MPEG IVC, and AVS2 video coding standardizations (mainly on encoding optimization, with proposed techniques adopted in the standard reference software). He is one of the principal drafters of a certified industrial standard in China, namely Video mezzanine coding – Part 1: Scalable ultra high-definition video coding (GY/T 398.1—2024). Prof. Zhu has served on the editorial boards of a dozen journals, including as an Associate Editor of  IEEE Transactions on Image Processing,  IEEE Transactions on Circuits and Systems for Video Technology, IEEE Transactions on Broadcasting, IEEE Signal Processing Letters, an Editor of IEEE Communications Surveys and Tutorials, an Area Editor of Signal Processing: Image Communication (Elsevier), an Associate Editor of Multidimensional Systems and Signal Processing (Springer), an Editorial Board Member of Multimedia Tools and Applications (Springer), and an Associate Editor of Frontiers in Signal Processing – Image Processing. He has also served as a Guest Editor of five special issues in international journals, including as a Guest Editor (twice) in IEEE Journal of Selected Topics in Signal Processing. He has served a number of international conferences, including IEEE BMSB 2021 as a General Chair, and IEEE ICME 2017 as a Technical Program Chair, at both of which he received Outstanding Leadership Award. He has also given three-hour tutorials at international conferences, including at the IEEE ISCAS 2015, IEEE VCIP 2014, PCM 2014, and has also been invited to deliver keynote speeches at a dozen of international conferences, including the most recent keynote at the APSIPA ASC 2024. He is now serving as the Chair of IEEE ICME Steering Committee (2024-2025), and the Chair of IEEE Chengdu Section (2024-2028), and the Member-at-Large of APSIPA (2026). He has served as a Co-Chair of the Interest Group of Multimedia Processing for Communications (MPCIG) of Technical Committee on Multimedia Communications (MMTC), IEEE ComSoc, and a Chair of Special Interest Group on Big Multimedia of Technical Committee on Multimedia Computing, IEEE Computer Society. He was an elected member of the Multimedia Signal Processing Technical Committee (MMSP-TC, 2015-2020), the Chair of Webmaster Subcommittee of MMSP-TC, IEEE SPS, and an elected member of the Multimedia Systems and Applications Technical Committee (MSA-TC, 2004-2012, 2015-2023), IEEE CASS. He is a Fellow of IEEE (2017, “for contributions to video coding and communications”), a Fellow of Optica (formerly OSA, 2024, “For pioneering and sustained contributions to visual information coding and processing”), a Fellow of IET (2014), a Fellow of AAIA (2021), and a Fellow of AIIA (2024). He was a Distinguished Lecturer of IEEE Circuits and Systems Society (2019-2020), IEEE Broadcast Technology Society (2012-2019), and an APSIPA Distinguished Lecturer (2021-2022). He has received 11 (best) paper/demo awards, including five Best Paper Awards (IEEE BMSB 2025, ICSPS 2025, IEEE HPCC 2022, IEEE BMSB 2014, IIH-MSP 2013), a Best Paper Runner Up Award (IEEE ICME 2020), three Best Student Paper Awards (IEEE BMSB 2018, IEEE ICME 2017, MobiMedia 2011), and two Best Demo Awards (IEEE ICME 2025, IEEE MMSP 2022). He has been ranked among the Most Cited Chinese Researchers by Elsevier each year in the latest eight years since 2017. He has also been ranked as one of the World’s Top 2% Scientists since 2020, released by Stanford University. 2. Honors & Awards 2024, Science and Technology Advancement Award (First Prize), China Society of Image and Graphics 2024, Fellow of the Artificial Intelligence Industry Academy, International Artificial Intelligence Industry Alliance (AIIA) 2024, Fellow of Optica (formerly OSA), “For pioneering and sustained contributions to visual information coding and processing” 2023, Sichuan Provincial Natural Science Award (Second Prize), Sichuan Provincial Government 2022, Innovation Award for Individuals, China Industry-University-Research-Institute Collaboration Association 2021, Fellow, Asia-Pacific Artificial Intelligence Association (AAIA) 2021-2022, Distinguished Lecturer, Asia Pacific Signal Processing and Information Processing Association (APSIPA) 2021, Outstanding Leadership Award, IEEE International Symposium on Broadband Multimedia Systems and Broadcasting (BMSB), Chengdu, China, Aug.2021 2021, Fellow, China Institute of Communications (CIC) 2020-2025, World’s Top 2% of the Most Cited Scientists, released by Stanford University 2020, Science and Technology Achievement Award (Second Prize), China Instrument and Control Society 2019-2020, Distinguished Lecturer, IEEE Circuits and Systems Society 2018, Science and Technology Achievement Award (Second Prize),  China Society of Image and Graphics 2018, ChangJiang (Cheung Kong) Professorship, Ministry of Education of China 2017-2024,  Most Cited Chinese Researchers (each year in the latest eight years),  Elsevier 2017, Outstanding Leadership Award, IEEE International Conference on Multimedia & Expo (ICME), Hong Kong, China, July 2017 2017, IEEE Fellow, “for contributions to video coding and communications” 2014, Fellow of the Institution of Engineering and Technology (IET) 2012-2019, Distinguished Lecturer, IEEE Broadcast Technology Society 2009-2014, Guest Professor, Southwest Jiaotong University, China 2010, Special Service Award, IEEE Broadcast Technology Society 2010, Awardee of JSPS Scientist Exchange Programme, Japan Society for the Promotion of Science 2008, Awardee of Tan Chin Tuan Exchange Fellowship in Engineering, Nanyang Technological University, Singapore, & Queen Mary University of London, UK 2007, Awardee of Research Outstanding and Award Recognition, Nanyang Technological University, Singapore 2007, Advisory Professor, Beijing Jiaotong University, China 2006, Adjunct/Visiting Professor, Harbin Institute of Technology, Shenzhen Graduate School Paper Awards & Distinctions Best Paper Award, International Conference on Signal Processing Systems (lCSPS 2025), Chengdu, China, Oct. 2025K. Tan, Z. Sun, Y. Sun, C. Zhu, Y. Liu, “DATSIL: Domain Adaptation in Tensor Subspace for Wi-Fi-Based Indoor Localization,” International Conference on Signal Processing Systems (lCSPS 2025), Chengdu, China, Oct. 2025.Best Demo Award, IEEE International Conference of Multimedia and Expo (ICME 2025), Nantes, France, June 2025.X. Lin, Y. Zhou, Y. Liu, Z. Long, C. Zhu, “A High-Precision, Low-Latency, and Robust Vision-Based Localization System for Embodied Intelligent Robots in Complex Environments,” IEEE International Conference of Multimedia and Expo (ICME 2025), Nantes, France, June 2025.Best Paper Award, IEEE International Symposium on Broadband Multimedia Systems and Broadcasting (BMSB 2025), Dublin, Ireland, June 2025.H. Guo, Y. Du, L. Luo, Y. Liu, C. Zhu, “VVC Rate Control Based on Distortion Propagation Factors,” IEEE International Symposium on Broadband Multimedia Systems and Broadcasting (BMSB 2025), Dublin, Ireland, June 2025.Best Paper Award (out of 663 submissions), IEEE International Conference on High Performance Computing & Communications (HPCC 2022), Chengdu, China, Dec. 2022F. Liu, C. Zeng, L. Zhang, Y. Zhou, Q. Mu, Y. Zhang, L. Zhang and C. Zhu, “FedTADBench: Federated Time-Series Anomaly Detection Benchmark,” IEEE International Conference on High Performance Computing & Communications (HPCC), Chengdu, China, Dec. 2022.Best Demo Award, The 24th IEEE International Workshop on Multimedia Signal Processing (MMSP 2022), Shanghai, China, Sept. 2022X",
  "content_length": 27854,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:46"
}