{
  "name": "Ce Zhang 0001",
  "homepage": "https://zhangce.github.io",
  "status": "success",
  "content": "Home Skip to main content Link Search Menu Expand Document (external link) About MeI am currently the CTO of Together, building a cloud tailored for artificial intelligence, and a Neubauer Associate Professor at the Department of Computer Science of the University of Chicago. Before that I was an Associate Professor at ETH Zurich. I am also currenlty a PhD mentor at INSAIT. I am interested in the fundamental tension between data, model, computation and infrastructure and the goal of my research is to democratize machine learning for everyone to use it to make our world a better place.I finished my PhD at the University of Wisconsin-Madison and spent another year as a postdoctoral researcher at Stanford, both advised by Chris Ré. I did my undergraduate study at Peking University, advised by Bin Cui.We believe in a system approach in tackling emerging problems that we are facing. Our current research focues on building next-generation machine learning platforms and systems that are data-centric, human-centric, and declaratively scalable.[Email: cez@uchicago.edu] [Google Scholar] [Twitter]Check out a summary of our research here.Another exciting initiative that I am lucky to be part of as the co-Editors-in-Chief is a new journal DMLR, a new member of the JMLR family focusing on data-centric machine learning research. Stay tuned!As a research group, one of our most important duties is to nurture the next generation of leaders, which arguably gives us the most significant long-lasting impact to the society. Over the years, students graduated from our groups have became professors in great universities and researchers and engineers in leading industrial companies. See a list and their achievements here.We are super lucky to have been involved in several community building efforts, from machine learning systems, data management for ML, to Data-centric AI. Here are a few recent positioning papers on various topics (joint work with many fellow researchers):Advances, challenges and opportunities in creating data for trustworthy AI (Nature Machine Intelligence), with Weixin Liang, Girmaw Tadesse, Daniel Ho, Li Fei-Fei, Matei Zaharia, and James Zou.DataPerf: Benchmarks for Data-Centric AI Development (MLCommons), with a great consortium of researchers who are passionated about data quality for ML and data iterations.A Data Quality-Driven View of MLOps (IEEE Data Engineering Bulletin).MLSys: The New Frontier of Machine Learning Systems, the positioning paper for the first MLSys conference, with a awesome consortium of researchers from machine learning, systems, data management, security, computer architecture, etc.We are always looking for top candidates for PhDs and Postdocs with background in systems or theory on data management, mathematical optimization, and machine learning. Feel free to reach out! News and Student HighlightsSIGMOD Best Demo Runner Up for ArgusEyes, a system to improving data quality for ML, based on PTIME Data Shapley techniques, e.g., DataScopeBinhang Yuan is joining Hong Kong University of Science and Technology as an assistant professor;Nezihe Merve Gurel joins TU Delft as an assistant professor;ERC Grant. Blog: What are we going to build with an ERC?Generation Google Scholarship for Nezihe Merve Gurel;Jiawei Jiang joins Wuhan University as a full professor;Nezihe Merve Gurel joins the Board of Directors of WiML;ICLR Outstanding Paper for Shuai Zhang;Nora Hollenstein joins University of Copenhagen as an assistant professor;Google Focused Research Award, 2018.MIT Technology Review Latin American Innovators under 35 for Leonel Aguilar;SNSF Eccellenza Professorial Fellowship for Thomas Lemmin, joins University of Bern as assistant professor;IBM Q Best paper award for Zhikuan Zhao;CoNLL special award for the best paper on research inspired by human language learning and processing for Nora HollensteinSIGMOD Research Hightlight Award, 2015.SIGMOD Best Paper Award, 2014.",
  "content_length": 3950,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:43"
}