{
  "name": "Cecilia R. Aragon",
  "homepage": "http://faculty.washington.edu/aragon",
  "status": "success",
  "content": "Cecilia Aragon | Professor, University of Washington About Publications Teaching Short Bio Full Bio CV Treaps Links Dr. Aragon is the director of the Human-Centered Data Science Lab at the University of Washington. Her research focuses on enabling humans to explore and gain insight from vast data sets. This emerging field, known as human-centered data science, is situated at the intersection of human-computer interaction and data science/artificial intelligence. Aragon's work includes: Human-centered artificial intelligence Human-centered machine learning Visual analytics (visualization and machine learning) Data science and big data Data-intensive scientific collaborations Emotion in informal text communication Games for good (collaborative educational games) Accessible computing Aviation and astronautics sociotechnical systems Aragon and her team use both quantitative (statistical and computational) and qualitative (ethnographic, human-centered design) methods to study how people make sense out of very large data sets, and develop algorithms to facilitate these processes. In 2008, Aragon won the Presidential Early Career Award for Scientists and Engineers (PECASE) for her work. Aragon was the architect for Sunfall, a collaborative visual analytics system for supernova astrophysics. She developed an augmented-reality visualization system for helicopter pilots that increased their ability to land safely during simulated hazardous conditions. She was the co-inventor (with Raimund Seidel) of the treap, a binary search tree in which each node has both a key and a priority, and the randomized search tree, which uses random priorities in treaps to achieve good average-case performance. With Johnson, McGeoch, and Schevon, she conducted the first extensive evaluation of the simulated annealing algorithm in combinatorial optimization problems. Awards: In 2008, she received the Presidential Early Career Award for Scientists and Engineers (PECASE) for her work in collaborative data-intensive science. Aragon was awarded a 2017-18 Fulbright Fellowship to conduct research in human-centered data science and teach visual analytics in Chile. Her research has been recognized with six Best Paper awards since 2004. In 2015, she received the HCDE Faculty Innovator in Research Award from the University of Washington. She won the Distinguished Alumni Award in Computer Science from UC Berkeley in 2013, the student-nominated Faculty Innovator in Teaching Award from her department at UW that same year, and was named one of the Top 25 Women of 2009 by Hispanic Business Magazine. Funding: Aragon has been principal investigator or co-PI for over $28M in grants from the National Science Foundation (NSF), the National Institute of Standards and Technology (NIST), the Department of Energy (DOE), the Gordon and Betty Moore Foundation, the Alfred P. Sloan Foundation, the Washington Research Foundation, the UW Center for Commercialization, Microsoft, and Intel. Research Interests: human-centered data science human-centered artificial intelligence human-centered machine learning human-computer interaction (HCI) computer-supported cooperative work (CSCW) visual analytics accessible computing aviation and astronautics sociotechnical systems emotion in informal text communication (sentiment analysis in social media) Affiliations and Projects: Director, Human-Centered Data Science Lab dub group, University of Washington eScience Institute, University of Washington Advanced Computing for Science, LBNL Visualization Group, LBNL Nearby Supernova Factory NERSC Analytics Deep Sky Particle Data Group",
  "content_length": 3622,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:45"
}