{
  "name": "Cecilia Mascolo",
  "homepage": "https://www.cl.cam.ac.uk/~cm542",
  "status": "success",
  "content": "Professor Cecilia Mascolo I am a Full Professor of Mobile Systems in the Department of Computer Science and Technology and I head the Mobile Systems Research Laboratory. I am also a director for the Centre for Mobile, Wearable Systems and Augmented Intelligence. My interests are in the study of mobile systems, the learning from their data offline and on device and their applications, especially in terms of mobile health. I am a Royal Academy of Engineering Fellow. I hold an ERC Advanced Research Grant (2019-2025) and an EPSRC Open Fellowship (2025-2030). I am currently on sabbatical. News I was elected as Fellow at the Royal Academy of Engineering. I am on sabbatical. I spent a few months at Harvard University and I am spending time as CSO at auryx. Here is a write up of my ERC Advanced Research Grant findings! The slides for our Audio for Respiratory Health Workshop can be found here. Our paper on respiration rate monitrong from earables has won the Best Paper Award at IEEE Percom! Our earable computing for physiological monitoring has featured in a BBC Click Episode (minute 22). Our work on gait monitoring from earables has been accepted at IEEE Percom! Our collaboration with SleepCycle for a new Alzheimer's study is covered here. I have been awarded an EPSRC Open Research Fellowship to work on foundations of hearable computing! Here is our annoucement. Our novel work on exploring the power of Open Respiratory Acoustic Foundation Models will appear in NeurIPS Datasets and Benchmarks Track 2024! Read our blog! Our Seminar Series on Mobile and Wearable Health is restarting. Recordings of previous talks here. Our paper \"TinyTTA: Efficient Test-time Adaptation via Early-exit Ensembles on Edge Devices\" was accepted at NeurIPS24. I have delivered a keynote at the CHIA annual conference. Our paper TinyTrain: Resource-Aware Task-Adaptive Sparse Training of DNNs at the Data-Scarce Edge has been accepted at ICML24. I have delivered the Keynote Talk at IEEE Percom 2024. \"RELOAD: REspiratory disease progression through LOngitudinal audio Data machine learning.\" funded through UKRI AI for Health . An ERC Proof of Concept grant was awarded to my team for our work on hearables for health. I have delivered a keynote speech at ICDCS23 in Hong Kong Ex PhD Student Andrea Ferlini won the 2023 ACM SIGMOBILE Doctoral Dissertation Runner-up Award! Evaluating Listening Performance for COVID-19 Detection by Clinicians and Machine Learning: Comparative Study is out. Our paper Machine Learning Detects Altered Spatial Navigation Features in Outdoor Behaviour of Alzheimer’s Disease Patients won the Computer Laboratory Ring Hall of Fame Best Paper Award! I have given the inaugural talk in the new Imperial-X seminar series. We have organized this event on Using Mobiles and Wearables for Public Health. My talk for it is here. Finished teaching a new, first of its kind, Mobile Health course: slides and videos available! Read about our work on VO2Max estimation with wearables in free living context here. Paper here. I have delivered a talk at the Royal Society event on Innovation in Sport. My University of Oxford Strachey Lecture talk can be found here. Our paper on On-Device Emotion Recognition won the 10-Year Impact Award at ACM Ubicomp! Group I head a team of about fifteen researchers, including postdocs and PhD students. I have graduated around twentyfive additional PhD students. Publications My publications can be found on the team's page. My Google Scholar page is here. Profile You can find my bio and more about me here, including professional activities. Research I w ork on a variety of projects funded by research councils and industry. Teaching I teach a course on Mobile Health and I am Director of Studies for Computer Science in Jesus College.",
  "content_length": 3790,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:44"
}