{
  "name": "Cees de Laat",
  "homepage": "https://delaat.net",
  "status": "success",
  "content": "Welcome to the Homepage of Cees de Laat Welcome to the Homepage of Cees de Laat Introduction Current Activities Interesting & fun Subjects Committees Archived Supervised PhD's Presentations & Keynotes Publications Prof.dr.ir. Cees T. A. M. de Laat Professor Emeritus, University of Amsterdam web-link Affiliate Lawrence Berkeley National Lab. Note: most parts of this website require authentication. Contact me if needed. IntroductionThe complexity of digital systems on all scales is my research field. Cyber Infrastructure is rapidly evolving from relatively simple fixed components to programmable and virtualized objects with many degrees of freedom, owned, operated and governed by different entities in multiple administrative domains interacting on the Internet. Security and sovereignty in the digital world are enormously under pressure. Participation in the digital world in a transparent trust-able way for safe and secure data processing is a major research topic that nowadays defines my interest and activities. Although I am retired I support and engage in several international initiatives in Cyber Infrastructure development and am part of international advisory boards. At the UvA I am guest member of the Multiscale Networked Systems (MNS), Complex Cyber Infrastructure (CCI) and Parallel Computing Systems (PCS) research groups that were spawn from my former System and Network Engineering (SNE) research group. Current Activities SC - SuperComputing Conference demonstrators, presentations, articles Interesting & fun Subjects Model Train - setup for grandchildren Snap-Circuits & Snapino - E-Blox STEM material to play with electronica and Arduino programming for kids Radio and Clock - a practical Clock Radio page programmed with JavaScript (as an exercise) SETUP - Internet tools, Web Server (Apache) and DNS (bind) on MacOS using Homebrew. delaat.net scores maximal at internet.nl for WEB: and for MAIL: Archived Teaching (As per Sept 2022 I am not teaching anymore) Master SNE ; See also introduction and curriculum. (until 2022) Research projects (RP) local copy of rp pages Bachelor Computer Science VU, Introduction to CS (until 2021) System and Network Engineering Research for Big Data Sciences. Talk abstract, referenced papers and slides. Master Informaton Sciences, Fundamentals of Data Science (until 2020) Snowden and the Internet. Talk abstract, referenced papers and slides. Minor Privacy & Data Protection (Faculty of Law) (until 2018) Snowden and the Internet. Talk abstract, referenced papers and slides. Research Reports - Department of Energy, National Science Foundation, White House Cyber Infrastructure and EU Reports. Symposium - System and Network Engineering, on occasion of my (partly) retirement. Oratie - Kwaliteit in een virtuele wereld, January 27, 2011. TNC - Terena Networking Conference demonstrators, presentations, articles. OFC - Optical Forum Conference demonstrators, presentations, articles OFCnet - Optical Forum Conference network exhibition / demo zone. Posters - Posters presented by the SNE (untill 2020) and CCI Research Laboratory SDI - Software Defined Networks NetBuf - Networks and Buffering SSDTCP - TCP for File transfer from ssd to ssd OLEX - Open LightPath Exchanges SmartNetworks - Smart High-Performance Networks QN - Quantum Networks AAAARCH - Authentication Authorisation and Accounting Architecture Research Group Awards - Awards received by SNE-Lab researchers (till 2020) Funding - acquired research funding Staff-SNE and Staff-CCI - staff pages when I was chair Completed projects AMDEX - Amsterdam Data Exchange pilot EPI - Enabling Personalized Interventions DL4LD - Data Logistics 4 Logistic Data SSPDDP - Secure Scalable Policy-enforced Distributed Data Processing. SecConNet - Smart, Secure Container Networks for Trusted Big Data Sharing. DAS - Distributed ASCI Supercomputer DAS2, DAS3, DAS4, DAS5, DAS6 SARNET EU-ENVRIplus EU-EXTRA EU-VRE4EIC EU-CYCLONE EU-SWITCH EU-EDISON COMMIT EU GEANT (GN4 project) NWO-SES GreenClouds Completed projects PIRE workshop CineGrid-Amsterdam, CineGrid-UVA EU-GEYSERS EU-NOVI SCARIe VL-e GigaPort + 40G @ GLIF and SC10 StarPlane EU Phosphorus EU NextGrid GigaPort-NG EU EGEE EU DataTAG Privacy and Security platform @ UVA Completed Fun Projects Check - Security checks on a number of Websites and email Servers. Logo - The logo's designed for SNE, CCI, MNS, etc. O365 - Office cloud - pro's, con's and best practices. MDM - Mobile Device Management; pro's, con's and best practices. WebCams - Webcams in the office during COVID shutdown. AUX - junk yard Completed Committee's FEC - Faculty Ethical Committee ECIS - Ethics Committee for Information Sciences - UvA-IvI, VU-INF, CWI and ILLC IOC - IT for Research committee HPC-committee - University High Performance Computing Committee",
  "content_length": 4811,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:49"
}