{
  "name": "Celine Latulipe",
  "homepage": "https://celinelatulipe.net",
  "status": "success",
  "content": "Computing Creatively | Dr. Celine Latulipe I teach and engage in research in the fields of Human-Computer Interaction and Computer Science Education at the University of Manitoba. My research involves understanding how older adults and their caregivers engage with technology, and developing systems and tools to support a partnership model for the older adult’s digital life. I also conduct research in innovative curriculum and pedagogy for Computer Science, and I am particularly interested in how to support underserved populations learning computer science. A third area of interest is in developing and evaluating novel interaction techniques, creativity support tools and measurement, and the study of how people use complex software, whether mobile, web-based or traditional desktop systems. I have previously conducted research on technology to support the arts and I am a strong advocate for interdisciplinary research and funding that goes beyond STEM.  Beyond technology, education and art, I am also interested in politics, gender issues, philosophy, behavioural economics, neuroscience, psychology and sociology. I received my PhD in Computer Science from the University of Waterloo in 2006. I have a Master of Mathematics in Computer Science and a Bachelor of Arts in Honours Economics and Applied Studies, both from Waterloo. I began my research career as an Assistant Professor in the College of Computing and Informatics at the University of North Carolina at Charlotte in 2006, was granted tenure there in 2012, and was promoted to Full Professor there in 2017. I am still a research affiliate at UNC Charlotte, where I am actively involved in various CS Education projects and where I was a co-PI on the Connected Learner project. I am Co-Chair, along with Micheal Mueller, of the SIGCHI Cares Committee. I also am on the steering committee for the ACM Creativity & Cognition Conference. In 2021 and 2023, I served as a Virtual Conference Co-Chair for Creativity & Cognition, both of which were held in Gather virtual spaces that I created ( 2021 space and 2023 space ). These spaces include interactive art galleries, pictorial galleries, and posters and demos rooms. In 2024 I served as Co-Chair for the in-person Creativity & Cognition conference held in Chicago. In 2025 I will serve as Virtual Conference venue chair, designing the online conference space for Creativity & Cognition 2025. Recent news: Our CS Education Research paper, “Investigating the Impact of Classroom Structure, Sociality, and Inclusivity on Student’s Perceptions of Mastery” has been accepted to the ACM ITiCSE 2025 conference, so I’ll be heading to the Netherlands to present in late June! This work is the culmination of many years of collaborative work with colleagues at the University of North Carolina at Charlotte and Temple University. Happy to announce that important work by my MSc student Zach Havens about supporting older adults and their banking delegates is now available in the ACM DL. Lauren Himbeault and I had our paper “Students Investigating Pedagogy: A Project for Learning about Learning in CS” accepted for publication in ACM SIGCSE 2024. Excited to announce that the Master’s Thesis work of Afsane Baghestani (co-supervised with Dr. Andrea Bunt) was published in CSCW! The paper is titled: “Older Adults’ Collaborative Learning Dynamics When Exploring Feature-Rich Software.” In June 2023, an interdisciplinary research team that I lead presented a poster at Creativity & Cognition detailing a case study on designing a creativity-supporting virtual workspace in Gather. See the poster: and read the associated paper. In May 2023, Lauren Himbeault and I presented a short paper on using a 2-Stage Exam in and Introductory Computer Science Course at the Western Canadian Conference on Computing Education (WCCCE ’23). Two papers were accepted for publication in the Gerontechnology Journal. The first paper is by my former MSc student, Nabila Chowdhury, is titled, “Music Co-listening over Video Chat to Support Intergenerational Connectedness” (co-authored by me and Jim Young). The second paper is by undergraduate Psychology student Dallas Murphy titled “Exploratory Study of Google Nest Hubs in the Long-Term Care Setting”, with co-authors Michelle Porter, Nicole Dunn and myself. I collaborated with an amazing group of ITICSE co-authors in the 2022 Working Group to study COVID Impacts on CS students. Our working group paper has now been published: “The Impact of COVID-19 on the CS Student Learning Experience: How the Pandemic has Shaped the Educational Landscape” File this under ‘finally!’. A journal paper that I have been iterating on with colleagues Tonya Frevert and Lina Lee, from work done in 2018 and 2019 at UNC Charlotte has been accepted for publication in ACM TOCE. The paper is titled: “Using Discrimination Response Ideation to Uncover Student Attitudes about Diversity and Inclusion in Computer Science“. In collaboration with colleagues at UNC Charlotte and Temple University, we have just had a paper accepted at the IEEE FIE 2022 conference: “Developing CALI: An Inventory to Capture Collaborative Active Learning and Inclusive Practices in Introductory CS Courses”. Very excited to announce that the paper I wrote with Deborah Turnbull Tillman about the Interactive Online Art Gallery at C&C 2021 was accepted to C&C 2022: “Curating Interactive Art for Online Conferences: Artist, Curator and Technologist Experiences in Gather.Town” Paper accepted to SIGCSE 2022: “Comparing Student Experiences in Synchronous CS1 Classes in Gather.Town vs. Zoom“, in collaboration with Amy De Jaeger from the University of Manitoba’s Centre for the Advancement of Teaching and Learning. Gather.Town has made my pandemic teaching experience much more enjoyable. Check out my conference presentation to hear about the impact on students. Read my Medium blog post about using Gather.town to teach my large CS1 class online. Our paper: “Security and Privacy Risks Associated With Adult Patient Portal Accounts in US Hospitals” has been published in JAMA-IR (Journal of the American Medical Association – Internal Medicine). It has also been featured in the news. Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Contact Info Dr. Celine Latulipe Professor Dept. of Computer Science Faculty of Science University of Manitoba celine.latulipe@umanitoba.ca Teaching Winter 2026: COMP 7570 Graduate Students Melika Adabinejad Emmanuel Segun-Lean Simran Panthi Mehran Hossain Simon Wermie Former Students Computing Creatively Sign up Log in Copy shortlink Report this content Manage subscriptions Loading Comments... Write a Comment... Email (Required) Name (Required) Website",
  "content_length": 6767,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:49"
}