{
  "name": "Ceren Budak",
  "homepage": "http://cbudak.com/index.html",
  "status": "success",
  "content": "Ceren Budak Ceren Budak Associate Professor University of Michigan School of Information Home Publications Projects Teaching Talks Service CV Mail: cbudak [at] umich.edu Twitter: @cerenbudak Office: 3336 NQ I am an Associate Professor at the University of Michigan School of Information. Before that, I was a Postdoctoral Researcher at Microsoft Research New York. I received my PhD from the Computer Science Department at University of California, Santa Barbara in December 2012. I received my Bachelors degree from Computer Science Dept. @Bilkent University in Turkey in 2007. My research interests lie in the area of computational social science; a discipline at the intersection of computer science, statistics, and the social sciences. I am particularly interested in applying large scale data analysis techniques to study problems with social, political, and policy implications. Active Projects Below are a few active research projects I am interested in. Each is accompanied with a word cloud from one of my related papers. Because who doesn't like pretty figures? News Media Production & Consumption News media are a key source of information for society. How is this source of information produced and how is it consumed? Are news outlets biased? Do readers prefer ideologically biased content? Continue Reading » Social Movements & Media The high-level goal of this project is to understand social movements using social media data; A few questions we have looked at in the past and are working on right now are: What motivates people to participate in collective action? How do social movements change the participants that took part in them? How sticky is activism? What recruitment methods and networks work better in engaging the participants? Continue Reading » Social Networks The power of online social networks lies in their ability to enable the diffusion of information, ideas, and innovations. This significance motivates our work that focuses on understanding the diffusion process, and using this understanding to build technological solutions to facilitate and guide such spread. Our efforts that resulted in advances in modeling diffusion, limiting the spread of misinformation and trend detection in social networks. Continue Reading » Measuring and Promoting the Quality of Online Discussions This project will amplify the efforts of people to bring out the best in other people in online conversations, and will make it easier for people to find high quality online conversations. The first goal of the research is to create automated classifiers to measure the quality of everyday online political talk. The second goal of the research is to create a Conversation Coach that helps the general public to improve the quality of conversation spaces they participate in, by helping them craft messages that directly contribute to quality and that indirectly inspire others. Continue Reading » Prospective Students Prospective PhD students must first be admitted to UMSI's PhD program before they can work with an individual advisor. If you are interested in working with me, please first apply to our program and then drop me an email. Undergraduate and Masters students who have already been admitted to the University of Michigan and are interested in working on computational social science problems are welcome to contact me. Include your interests, degree, major, and resume in your email. School of Information, University of Michigan 4322 North Quad, 105 S. State St. Office: NQ 3336",
  "content_length": 3516,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:54"
}