{
  "name": "Cesare Alippi",
  "homepage": "https://alippi.faculty.polimi.it",
  "status": "success",
  "content": "Cesare Alippi Homepage Cesare Alippi Professor of Information Processing Systems Home research publications projects Classes contacts Cesare Alippi, born in beautiful Lecco on the Como lake, Italy, received the degree in electronic engineering cum laude in 1990 and the PhD in 1995 from Politecnico di Milano, Italy. Currently, he is a Professor with the Politecnico di Milano, Milano, Italy and Università della Svizzera italiana, Lugano, Switzerland. Currently, he is a visiting professor at the University of Kobe, Japan, and the University of Guangzhou, China. He has been a visiting researcher at UCL (UK), MIT (USA), ESPCI (F), CASIA (RC), A*STAR (SIN). Alippi is an IEEE Fellow, Member of the Administrative Committee of the IEEE Computational Intelligence Society, Board of Governors member of the International Neural Network Society, Board of Directors member of the European Neural Network Society, Past Vice-President education of the IEEE Computational Intelligence Society, past associate editor of the IEEE Transactions on Emerging topics in computational intelligence, the IEEE Computational Intelligence Magazine, the IEEE-Transactions on Instrumentation and Measurements, the IEEE-Transactions on Neural Networks. In 2018 he received IEEE CIS Outstanding Computational Intelligence Magazine Award, the 2016 Gabor award from the International Neural Networks Society and the IEEE Computational Intelligence Society Outstanding Transactions on Neural Networks and Learning Systems Paper Award; in 2013 the IBM Faculty award; in 2004 the IEEE Instrumentation and Measurement Society Young Engineer Award. Current research activity addresses adaptation and learning in non-stationary environments and Intelligence for embedded and cyber-physical systems. He holds 8 patents, has published one monograph book, 6 edited books and about 200 papers in international journals and conference proceedings. Read More NEWS - Cesare is recipient of the 2016 \"Gabor Award\" of the International Neural Networks Society, recognizing outstanding achievements in engineering and applications of neural networks. The International Neural Network Society (INNS) is the premiere international organization for individuals interested in a theoretical and computational understanding of the brain and applying that knowledge to develop new and more effective forms of machine intelligence. INNS supports activities that advance the world’s understanding of how mental functions such as sensation/ perception, biological learning, cognition, decision-making, memory and motor control emerge from the nervous system, and to use this understanding to build smarter machines and algorithms for applications across all disciplines. - 2018 IEEE CIS Outstanding Computational Intelligence Magazine Award for the paper Adaptive Strategies for Learning in Nonstationary Environments: a Survey, by G. Ditzler, M. Roveri, C. Alippi, R. Polikar, IEEE Computational Intelligence Magazine, vol. 10, no. 4, pp. 12-25, 2015 - 2016 IEEE CIS Outstanding TNNLS Paper Award for the paper titled “Just-in-Time Classifiers for Recurrent Concepts.” The award recognizes outstanding papers published in the IEEE Transactions on Neural Networks and Learning Systems in the year of 2013. - Papers C. Alippi, G. Boracchi, D. Carrera, CCM: Controlling the Change Magnitude in High Dimensional Data C. Alippi, S.Ntalampiras, M.Roveri: Designing HMM models in the age of Big Data won the two “Best regular paper awards\" of the 2nd INNS Conference on Big Data 2016 (INNS Big Data 2016), Thessaloniki, Greece, 23-25 October, 2016 Intelligence for Embedded Systems, a Methodological Approach Alippi, Cesare Springer 2014, XVI, 294 p. 81 illus., 73 illus. in color. \"This book presents the underpinnings of state-of-the-art embedded systems. … The target audience is ‘researchers, practitioners, and students’ who are designing the Internet of Things (IOT). … The volume itself is attractively laid out and faultlessly presented. It is definitely at the top end of current publication design and one of the best looking books I’ve seen this year.\" Bayard Kohlhepp, Computing Reviews, March, 2015 Find the book Table of Contents in the flyer You can find the book at Springer About the book : A comprehensive, interdisciplinary treatment of intelligent systems, teaching the reader everything from metrology to cognition Shows students and engineers how to understand basic mechanisms and design advanced applications, feeding a digital world eager for intelligent mechanisms Introduces researchers to ideas characterizing the transition from one generation of intelligent devices to the next more details in the book page - Cesare has been appointed Distinguished Lecturer of the IEEE Computational Intelligence Society (CIS) for the 2014-2016 term. The CIS Distinguished Lecturer Program (DLP) aims at serving communities interested in Computational Intelligence and, specifically, supporting local CIS Chapters and CIS members who like to stay up-to-date on the latest research and practical applications by organizing lectures given by distinguished experts. CIS distinguished lecturers are recognized authorities in their respective fields, mostly IEEE fellows, and selected by an Ad-Hoc committee to serve the Society in this capacity. - Cesare Alippi was awarded the 2013 IBM Faculty Award. The IBM Faculty Award is a worldwide competitive program intended to foster collaboration between researchers at leading universities and those at IBM. Faculty Awards are cash grants awarded to full-time professors at accredited universities that have an outstanding reputation for contributions in their field or show unusual promise. The $18,000 award will be used to advance research on Intelligent Embedded Systems working in non-stationary environments. In particular, the focus of the research is on perfecting machine learning mechanisms allowing intelligent systems to detect changes in the environment they are working and react accordingly to anticipate potential performance drops. Combining research and education The \t\t\t\t\tIEEE Computational Intelligence Society strongly promotes education through a number of  diversified initiatives. More specifically, multimedia tutorials are being identified and recorded by exploiting keynotes, tutorial and webinars given by our senior members in flagship conferences. Research grants are provided to facilitate research experiences of our graduate student members while other initiatives are taken into account to both serve the computational intelligence community and practitioners interested in computational intelligence and applications. Among these activities there are: student games-based competitions, pre-college educational programs, development of suggested university curricula, continuing education programs (especially for people in industry) and creation of the educational archive. My vision as Vice President for Education can be read in the following editorial Special Issue on Learning In Nonstationary and Evolving Environments IEEE TRANSACTIONS ON NEURAL NETWORKS AND LEARNING SYSTEMS, VOL. 25, NO. 1, JANUARY 2014 Using a computational model to learn under various environments has been a well-researched field that produced relevant results; unfortunately, the majority of these efforts rely on three fundamental assumptions: i) there is a sufficient and representative data set to configure and assess the model performance; ii) data are drawn from a fixed – albeit unknown – distribution; and iii) samples are mostly supposed to be independent. Alas, all these assumptions often do not hold in many real-world applications. The timely special issue discusses the state-of-the-art and latest results on detecting and adapting to changes in underlying data distributions. Cesare Alippi : Guest Editor Guest Editorial pdf IEEE WCCI 14 The IEEE World Congress on Computational Intelligence (IEEE WCCI) is the largest technical event in the field of computational intelligence. IEEE WCCI 2014, to be help in Beijing, China, 6-11 July 2014, will host three conferences: The 2014 International Joint Conference on Neural Networks (IJCNN 2014), the 2014 IEEE International Conference on Fuzzy Systems (FUZZ-IEEE 2014), and the 2014 IEEE Congress on Evolutionary Computation (IEEE CEC 2014). IEEE WCCI 2014 will engage in cross-fertilization among the three big areas and provide a stimulating forum for scientists, engineers, educators, and students from all over the world to discuss and present their research findings on computational intelligence. Cesare: Program Chair IJCNN14 World Congress link IEEE SSCI 2014 The IEEE Symposium Series on Computational Intelligence co-locates multiple exciting symposiums at one single location, providing a unique opportunity to encourage cross-fertilization and collaborations in all areas of CI. The IEEE SSCI 2014, which will be held in Orlando, Florida, U.S.A on December 9 to 12, 2014, features a large number of keynotes, tutorials, and special sessions. Cesare: General Program Chair Conference link Some about me International Activities Awards and Recognitions Labs and Start-up Favorite hobby: History A man and his mountains My medioeval tower My Links IEEE-CIS IEEE Computational Intelligence Society ENNS European Neural Networks Society IEEE-IMS IEEE Instrumentation and Measurement Society INNS International Neural Networks Society Lecco Campus Politecnico di Milano - Polo territoriale di Lecco DEIB Politecnico di Milano - Dipartimento di Elettronica, Informazione e Bioingegneria © 2013 Cesare Alippi Design by styleshout Number of visitors since March, 12th 2013",
  "content_length": 9653,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:54"
}