{
  "name": "Cesare Pautasso",
  "homepage": "http://search.usi.ch/persone/ea9b8e9c9be1b5ed3f03aff779452080/Pautasso-Cesare",
  "status": "success",
  "content": "Pautasso, Cesare | Università della Svizzera italiana Università della Svizzera italiana search.usi Tools usi.ch Info Desk Links Campus map Italiano Italiano English search.usi Search for contacts, projects, courses and publications People Education Research Organisation Education Courses Funded projects Publications Competences maps Faculties Institutes Services Other organisational units Cesare Pautasso http://usi.to/hjo Biography Cesare Pautasso is full professor in the Faculty of Informatics at the University of Lugano, Switzerland. Previously he was a researcher at the IBM Zurich Research Lab and a senior researcher at ETH Zurich, where he was awarded his PhD in 2004. His research focuses on building experimental systems to explore the intersection of model-driven software composition techniques, business process modeling languages, and autonomic/Grid computing. Recently he has developed an interest in Web 2.0 Mashups and Architectural Decision Modeling. He is the lead architect of JOpera (www.jopera.org), a powerful rapid service composition tool for Eclipse. His teaching and training activities both in academia and in industry cover advanced topics related to Web Development, Middleware, Service Oriented Architectures and emerging Web services technologies. He is a reviewer for several international funding agencies, including the EU FET-Open program. He is an active member of the ACM and the IEEE Computer Society where he has served on more than 100 program committees. He served as the general chair of the 9th European Conference on Web Services (ECOWS) hosted at USI in 2011. For more information, visit www.pautasso.info and twitter.com/pautasso. Research * Software Composition for Distributed Systems * Web 2.0 Mashups * Cloud Computing * Business Process Management * Service Oriented Architectures and Web Services * Model Driven Engineering * REST and Web API Design Competence areas Autonomic Computing Business Process Management Cloud Computing End-User Software Engineering Fog Computing Liquid Software Microservices Model-Driven Engineering REST Service Engineering Service Oriented Computing Software Architecture Software Composition Web Engineering Contact Su appuntamento cesare.pautasso@usi.ch tel +41 58 666 4311 East Campus, Sector D, Office D3.15 (Level P3) Via la Santa 1, 6962 Lugano-Viganello Roles Faculty of Informatics Full Professor Software Institute Links Website or personal page Social media X Update data Edit profile Università della Svizzera italiana Via Buffi 13 6900 Lugano, Svizzera tel +41 58 666 40 00 e-mail info@usi.ch Other contacts Feedback on the website Maps and directions Lugano Campus Mendrisio Campus Bellinzona Campus Stay in touch Newsletter Annual Report Subscribe © Università della Svizzera italiana Disclaimer Credits Faculties Institutes Bodies Libraries and archives Areas Services Job offers",
  "content_length": 2884,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:06"
}