{
  "name": "Cevdet Aykanat",
  "homepage": "http://www.cs.bilkent.edu.tr/~aykanat/doku.php",
  "status": "success",
  "content": "Homepage [Cevdet Aykanat] skip to content Cevdet Aykanat User Tools Log In Site Tools Search ToolsShow pagesourceOld revisionsBacklinksRecent ChangesMedia ManagerSitemapLog In> Recent ChangesMedia ManagerSitemap Trace: • Homepage Sidebar Vitae Projects and Research Interests Welcome Publications Supervised Theses Awards: Projects Lecture Notes My DBLP My Google Scholar Bilkent University Computer Engineering Dept. 06800 Bilkent Ankara, Turkey aykanat@cs.bilkent.edu.tr phone: +90 (312) 290-1625 fax: +90 (312) 266-4047 start Homepage Dr. Cevdet Aykanat is a Professor of Computer Engineering in Bilkent University, Ankara, Turkey. Prof. Aykanat earned his BS and MS degrees in electrical engineering from the Middle East Technical University, and received his PhD in electrical and computer engineering from Ohio State University, where he was a Fullbright scholar, He worked at the Intel Supercomputer Systems Division, Beaverton, Oregon, as a research associate. Since 1989, he has been affiliated with the Department of Computer Engineering, Bilkent University. Research interests of Prof. Aykanat mainly include parallel computing (especially for irregular and unstructured applications), parallel scientific computing and its combinatorial aspects, parallel computer graphics applications, parallel data mining, graph and hypergraph partitioning, load balancing, high-performance information retrieval, parallel and distributed databases, grid computing and high performance computing for big data applications“. Prof. Aykanat (co)authored above 100 articles in prestigious SCI journals such as IEEE Transanctions on Computers, IEEE Transactions on Parallel and Distributed Systems, Journal of Parallel and Distributed Computing, Parallel Computing, IEEE Trans. Power Systems, IEEE Trans. Computer-Aided Design of Integrated Circuits, Data Mining and Knowledge Discovery, Information Systems, Neurocomputing, Neural Networks, Computers & Graphics, Computer-Aided Design, Visual Computer, Computer Networks, Information Processing & Management, ACM Trans. on the Web, ACM Trans. on Parallel Computing, ACM Trans. on Mathematical Software, Future Generation Computing Systems, IEEE Trans. Knowledge and Data Engineering, Parallel and Distributed Databases, Very Large Data Bases, IEEE Trans. Biomedical Systems, SIAM J. Scientific Computing and SIAM Review. His publications received about 5500 citations in Harzing's Publish or Perish Index and Google Scholar Citation Database. He has an H-index of 40 for all of his citations. Several of his research projects have been funded by TUBITAK (The Scientific and Technological Research Council of Turkey), Intel SSD and European Commission (ITDC, FP6, FP7). Prof. Aykanat has been the principal investigator of 6 TUBITAK projects, investigator of 2 TUBITAK projects, principal investigator of one Intel-SSD project, general co-ordinator of a 2.5-year EC-funded ITDC project, and principal investigator of Bilkent University in the EC-funded SEE-GRID, SEE-GRID2, PRACE-1IP, PRACE-2IP, PRACE-3IP, PRACE-4IP, PRACE-5IP and PRACE-6IP projects. Prof. Aykanat is the recipient of the 1996 Investigator Award of TUBITAK and 2007 Science Award of METU Parlar foundation. He was appointed as a member of the IFIP Working Group 10.3 (Concurrent System Technology) in April 2004 and as a member of the EU-INTAS Council of Scientists in June 2005. He has participated in the expert panels of The Research Council of Norway for the research program eVITA- eScience. Prof. Aykanat has served as an Associate Editor of IEEE Transactions of Parallel and Distributed Systems (2008-2013). Prof. Aykanat has been an Associate Provost of Bilkent University since 2010. start.txt · Last modified: 2022/10/28 13:46 by aykanat Page Tools Show pagesourceOld revisionsBacklinksBack to top Except where otherwise noted, content on this wiki is licensed under the following license: CC Attribution-Noncommercial-Share Alike 4.0 International",
  "content_length": 3969,
  "method": "requests",
  "crawl_time": "2025-12-01 12:49:56"
}