{
  "name": "Chaabane Djeraba",
  "homepage": "http://cristal.univ-lille.fr/~djeraba",
  "status": "success",
  "content": "Chabane DJERABA - Université de Lille Professeur des universités CNU : SECTION 27 - INFORMATIQUE Laboratoire / équipe UMR 9189 - CENTRE DE RECHERCHE EN INFORMATIQUE, SIGNAL ET AUTOMATIQUE DE LILLE Page Orcid du membre (Ouverture dans une nouvelle fenêtre) HAL chaabane-djeraba (Ouverture dans une nouvelle fenêtre) Page Researchgate du membre (Ouverture dans une nouvelle fenêtre) chabane.djeraba[chez]univ-lille[point].fr +33 6 05 37 51 93 Lien vers la page Facebook ( Nouvelle fenêtre) Lien vers la page Linkedin ( Nouvelle fenêtre) Composantes, facultés FACULTE DES SCIENCES ET TECHNOLOGIESDEPARTEMENT INFORMATIQUE Spécialité Informatique Domaines de recherche Data, Multimédia, vision FR EN Présentation Titulaire d’un master et d’un doctorat en informatique, obtenus respectivement des universités de Grenoble et de Lyon en 1990 et 1993. Auparavant (1989), Ingénieur informaticien de l’Institut National d'Informatique (ex. INI). Maître de conférences à l’Ecole Polytechnique de l’université de Nantes de 1994 à 2003, ensuite Professeur à l’université Lille, depuis 2003. J’ai fondé en 2011 la start-up anaxa-vida que j'ai gérée de 2011 à 2016, dans le cadre de la valorisation de la recherche scientifique. Mes activités pédagogiques concernent les unités d’enseignement en informatique (ex. initiation à l'innovation et la recherche, algorithme, programmation objet, technologies web, data mining et vision par ordinateur). Mes domaines de recherche concernent l'apprentissage à très faible consommation énergétique par une approche bio-inspirée, pour résoudre des problèmes de vision. Mes recherches concernent aussi la reconnaissance des formes dynamiques. J'ai une activité importance et continue en animation, diffusion et médiation scientifique. J'évalue régulièrement des projets de recherche, en tant qu'expert scientifique, pour l'Europe, l’Agence Nationale de la Recherche (ANR), l'Association Nationale Recherche et Technologie (ANRT), certaines régions et universités au niveau national et international. Sami Barchid, José Mennesson, Jason Eshraghian, Chaabane Djéraba, Mohammed Bennamoun, \"Spiking neural networks for frame-based and event based single object localization\", Neurocomputing, 2023, 126805, ISSN 0925-2312, https://doi.org/10.1016/j.neucom.2023.126805.",
  "content_length": 2286,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:01"
}