{
  "name": "Chaitanya Swamy",
  "homepage": "http://www.math.uwaterloo.ca/~cswamy",
  "status": "success",
  "content": "Chaitanya Swamy Chaitanya Swamy Professor, University Research Chair Dept. of Combinatorics & Optimization Faculty of Mathematics, MC 5118 University of Waterloo 200 University Avenue West Waterloo, ON N2L 3G1, CANADA (519) 888-4567 ext. 42600 cswamy@uwaterloo.ca Hi. I joined the Department of Combinatorics and Optimization at the University of Waterloo as an assistant professor in September 2006. Previously I was a postdoctoral scholar at the Center for the Mathematics of Information (CMI) at Caltech. I graduated from the Department of Computer Science at Cornell University in May 2004. My advisor was David Shmoys. For research, I mostly think about algorithms. My research interests include combinatorial optimization, approximation algorithms, algorithmic game theory, stochastic optimization, network design, scheduling, and online algorithms. Professional Activities (selected) Associate editor: Discrete Optimization, SIAM Journal on Computing (2011-21). Organizer and chair: CanaDAM 2021 invited minisymposium on \"Approximation algorithms\". Organizer and chair: ISMP 2018 session on \"Approximation algorithms for clustering\" (Discrete optimization and integer programming cluster). Co-organizer: IPCO 2017, Waterloo. Co-organizer: Workshop on Flexible Network Design 2013, Fields Institute, Toronto. Committee member (selected): STOC 2023, APPROX 2022 (Chair), ESA 2021, WAOA 2021, SODA 2021, APPROX 2020, ICALP 2019, FOCS 2017, EC 2017, IPCO 2014, SODA 2014. Teaching CO 450/650: Combinatorial Optimization, Fall 2022, Fall 2019. CO 255: Introduction to Optimization (Advanced), Winter 2019. CO 454: Scheduling, Spring 2018, Spring 2017, Spring 2016, Spring 2013, Spring 2012. CO 250: Introduction to Optimization, Spring 2018, Spring 2017, Winter 2016. CO 759: Algorithmic Game Theory, Spring 2021, Spring 2015, Fall 2010, Spring 2008. CO 602/CM 740/CS 795: Fundamentals of Optimization, Fall 2021. CO 372: Portfolio Optimization, Winter 2022. CO 353: Computational Discrete Optimization, Winter 2022, Winter 2021, Winter 2019, Winter 2015, Winter 2011. CO 327: Deterministic OR Models (Non-Spec), Winter 2015, Spring 2012, Spring 2011. CO 351: Network Flows, Fall 2014, Spring 2009. CO 759: Approximation and Randomized Algorithms, Spring 2013. CO 350: Linear Optimization, Fall 2006. CO 370: Deterministic OR Models, Winter 2016, Winter 2013, Fall 2012, Fall 2011, Fall 2010, Winter 2009, Fall 2007, Winter 2007. CO 453: Network Design, Winter 2007. CO 456: Game Theory, Fall 2011. CO 452/652: Integer Programming. Winter 2009. Students and Postdoctoral fellows Current students David Aleman Espinosa, Ph.D, started Fall 2020. Jason Canon, Master's, started Fall 2021. Past students Sharat Ibrahimpur, Ph.D, 2016-2022, thesis: \"Stochastic Minimum-Norm Combinatorial Optimization\" → Postdoc at London School of Economics (LSE). Andre Linhares, Ph.D, 2013-2019, thesis: \"Approximation Algorithms for Distributionally Robust Stochastic Optimization\" → Google, Zurich. Received the University of Waterloo Alumni Gold Medal, Ph.D awarded to the best student across the university for their academic achievements. Sara Ahmadian, Ph.D, 2012-2017, thesis: \"Approximation Algorithms for Clustering and Facility Location Problems\" → Google, New York. Received the Outstanding Achievement for Graduate Studies (Ph.D) award from the Faculty of Mathematics, University of Waterloo for the best student in the faculty in terms of academic achievements. Hadi Minooei, Ph.D, 2008-2013, thesis: \"Mechanism Design for Covering Problems\" → Snapchat, California. Haripriya Pulyassary, Master's, Spring 2021 - Spring 2022, thesis: \"Algorithm Design for Original Settings\" → Ph.D student at Cornell University. Alexander Stoll, Master's, Fall 2017 - Winter 2021, thesis: \"Tolls for Atomic Congestion Games\" → MITRE Corporation, USA. Ishan Bansal (with Jochen Koenemann), Master's, Winter 2019 - Spring 2020, thesis: \"Capacitated Network Design on Outer Planar Graphs\" → Ph.D student at Cornell University. Named a University Finalist for the Alumni Gold Medal, Master’s, awarded to five outstanding students across the university. Sanchit Kalhan, Master's, Fall 2016 - Winter 2018, thesis: \"The Capacitated Matroid Median Problem\" → Ph.D student at Northwestern University. Sharat Ibrahimpur, Master's, Fall 2015 - Spring 2016, thesis: \"Packing and Covering Odd (u,v) Trails\" → C&O Ph.D student at U. Waterloo. Alexander Lange, Master's, Fall 2013 - Winter 2015, thesis: \"Approximation Algorithms for Graph Protection Problems\" → Square, California. Shubham Gupta, Master's, Fall 2009 - Spring 2011, thesis: \"Building Networks in Uncertainty\" → Snapchat, California. Sara Ahmadian, Master's, Fall 2008 - Spring 2010, thesis: \"Approximation Guarantees for Lower-Bounded Facility Location.\" Aaron Dos Remedios, Master's, Fall 2008 - Fall 2009, thesis: \"Approximation Algorithms for Multi-unit Online Auctions\" → Canadian Tire, Canada. Undergraduate Research Assistants (URAs): Felix Zhou (Spring 2021 → Ph.D, Yale), Ruilin Xiao (Spring 2020 → Citi), Ting Han Hu (Spring 2016), Tyler Johnson (Spring 2011), Ming Ben Feng (Spring 2009 → Ph.D, Northwestern → Faculty, Statistics & Actuarial Science @ UW), Aaron Dos Remedios (Spring 2008), Shane Cernele (Winter 2007 → Ph.D, UBC), Maurice Cheung (Spring 2007 → Ph.D, Cornell → Disney). Past postdocs Martin Gross, 2016-2017, (with Jochen Koenemann and Laura Sanita), Umang Bhaskar, 2014-2015 → TIFR, India. Andreas Feldmann, 2012-2014 (with Jochen Koenemann and Laura Sanita) → Charles University, Czech Republic. Ian Post, 2012-2014 (with Jochen Koenemann) → Google, Mountain View. Zachary Friggstad, 2011-2013 (with Jochen Koenemann) → University of Alberta, Canada. Costis Georgiou, 2010-2012 (with Jochen Koenemann) → Ryerson University, Canada. Deeparnab Chakrabarty, 2008-2010 (with Jochen Koenemann) → Dartmouth, USA. Recent Publications Combinatorial Algorithms for Rooted Prize-Collecting Walks and Applications to Orienteering and Minimum-Latency Problems. IPCO 2022. A Simple Approximation Algorithm for Vector Scheduling and Applications to Stochastic Min-Norm Load Balancing. SOSA 2022. Minimum-Norm Load Balancing Is (Almost) as Easy as Minimizing Makespan. ICALP 2021. Constant-Factor Approximation to Deadline TSP and Related Problems in (Almost) Quasi-polynomial Time. ICALP 2021. Approximation Algorithms for Stochastic Minimum Norm Combinatorial Optimization. FOCS 2020. A Constant-Factor Approximation for Directed Latency in Quasi-polynomial Time. JCSS 2022 (full version of ESA 2020 paper). Simpler and Better Algorithms for Minimum-Norm Load Balancing. ESA 2019. Approximation Algorithms for Distributionally Robust Stochastic Optimization with Black-Box Distributions. STOC 2019. Approximation Algorithms for Minimum Norm and Ordered Optimization Problems. STOC 2019. Approximate Multi-Matroid Intersection via Iterative Refinement. IPCO 2019. Algorithms for Inverse Optimization Problems. ESA 2018. Minimizing Latency in Online Ride and Delivery Services. WWW 2018. Interpolating between k-Median and k-Center: Approximation Algorithms for Ordered k-Median. ICALP 2018. Publications (in reverse chronological order) Sampling Bounds and Algorithms for Distributionally Robust Stochastic Optimization with Arbitrary Black-Box Distributions (with Andre Linhares). Combinatorial Algorithms for Rooted Prize-Collecting Walks and Applications to Orienteering and Minimum-Latency Problems (with Sina Dezfuli, Zachary Friggstad, and Ian Post). IPCO 2022. A Simple Approximation Algorithm for Vector Scheduling and Applications to Stochastic Min-Norm Load Balancing (with Sharat Ibrahimpur). SOSA 2022. Minimum-Norm Load Balancing Is (Almost) as Easy as Minimizing Makespan (with Sharat Ibrahimpur). ICALP 2021. Constant-Factor Approximation to Deadline TSP and Related Problems in (Almost) Quasi-polynomial Time (with Zachary Friggstad). ICALP 2021. Approximation Algorithms for Stochastic Minimum Norm Combinatorial Optimization (with Sharat Ibrahimpur). FOCS 2020. A Constant-Factor Approximation for Directed Latency in Quasi-polynomial Time (with Zachary Friggstad). Journal of Computer and System Sciences 2022. Special issue devoted to selected papers from ESA 2020. Simpler and Better Algorithms for Minimum-Norm Load Balancing (with Deeparnab Chakrabarty). ESA 2019, Approximation Algorithms for Distributionally Robust Stochastic Optimization with Black-Box Distributions (with Andre Linhares). STOC 2019. Approximation Algorithms for Minimum Norm and Ordered Optimization Problems (with Deeparnab Chakrabarty). STOC 2019. Approximate Multi-Matroid Intersection via Iterative Refinement (with Andre Linhares, Neil Olver, and Rico Zenklusen). Mathematical Programming 2021. Special issue devoted to papers from IPCO 2019. Algorithms for Inverse Optimization Problems (with Sara Ahmadian, Umang Bhaskar, and Laura Sanita). ESA 2018. Minimizing Latency in Online Ride and Delivery Services (with Abhimanyu Das, Sreenivas Gollapudi, Anthony Kim, and Debmalya Penigrahi). WWW 2018. Received the honorable mention research paper citation. Interpolating between k-Median and k-Center: Approximation Algorithms for Ordered k-Median (with Deeparnab Chakrabarty). Proceedings of ICALP 2018, pages 29:1-29:14. Detailed version posted on the CS arXiv, November 2017. Detailed vresion ps, pdf or conference version pdf. On the Integrality Gap of the Prize-Collecting Steiner Forest LP (with Jochen Koenemann, Neil Olver, Kanstantsin Pashkovich, R. Ravi, and Jens Vygen). Proceedings of APPROX 2017, pages 17:1-17:13. Detailed version posted on the CS arXiv, June 2017. Detailed version pdf or conference version pdf. Orienteering Algorithms for Generating Travel Itineraries (with Zachary Friggstad, Sreenivas Gollapudi, Kostas Kollias, Tamas Sarlos, and Andrew Tomkins). To appear in Proceedings of the ACM International Conference on Web Search and Data Mining (WSDM) 2018. pdf. Improved Algorithms for MST and Metric-TSP Interdiction (with An",
  "content_length": 30325,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:03"
}