{
  "name": "Chakkrit Tantithamthavorn",
  "homepage": "https://research.monash.edu/en/persons/chakkrit-tantithamthavorn",
  "status": "success",
  "content": "Kla Tantithamthavorn - Monash University View Scopus Profile Kla Tantithamthavorn Assoc Professor Associate Professor, Department of Software Systems & Cybersecurity https://orcid.org/0000-0002-5516-9984 EmailChakkritmonashedu Accepting PhD StudentsPhD projectsSoftware Engineering for AI-Software SystemsOperating LLMs at Scale (LLMOps, MLOps)Multi-Agent AI-Powered Software Development ToolsResponsible \"AI Software\" Engineering (RAISE)Retrieval Augmented Generation 20122025 Research activity per year Personal profile BiographyI’m Kla (published papers as Chakkrit Tantithamthavorn) (IEEE Senior Member, ex-ARC DECRA Fellow, ex-JSPS Fellow), an Associate Professor in Software Engineering and the Course Director for Bachelor of Software Engineering (Honours) in the Faculty of Information Technology, Monash University, Australia. Research. My research is focused on developing AI-enabled software development techniques (e.g., AI for Software Defects, AI for Code Review, and AI for Agile) and tools (e.g, AIBugHunter) in order to help developers find defects faster, improve developers’ productivity, make better data-informed decisions, and better improve the quality of software systems. In addition, I’m currently investigating new tools and techniques that enable software engineers to test, safeguard, and monitor the safety and security risks of LLM-based software systems at scale (called LLMSecOps).Research interestsWith the rise of software systems ranging from personal assistance to the nation's facilities, software defects become more critical concerns as they can cost millions of dollar as well as impact human lives. Yet, at the breakneck pace of rapid software development settings (like DevOps paradigm), the Quality Assurance (QA) practices nowadays are still time-consuming. Continuous Analytics for Software Quality (i.e., defect prediction models) can help development teams prioritize their QA resources and chart better quality improvement plan to avoid pitfalls in the past that lead to future software defects. Due to the need of specialists to design and configure a large number of configurations (e.g., data quality, data preprocessing, classification techniques, interpretation techniques), a set of practical guidelines for developing accurate and interpretable defect models has not been well-developed. The ultimate goal of my research aims to (1) provide practical guidelines on how to develop accurate and interpretable defect models for non-specialists; (2) develop an intelligible defect model that offer suggestions how to improve both software quality and processes; and (3) integrate defect models into a real-world practice of rapid development cycles like CI/CD settings. My research project is expected to provide significant benefits including the reduction of software defects and operating costs, while accelerating development productivity for building software systems in many of Australia's critical domains such as Smart Cities and e-Health.Supervision interestsI'm available to supervise Honours/Master/PhD students. Please feel free to contact me if you are interested. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationSoftware Engineering, Doctor of Engineering, Nara Institute of Science and TechnologyAward Date: 26 Sept 2016Software Engineering, Master of Engineering, Nara Institute of Science and TechnologyAward Date: 31 Mar 2014 Research area keywordsSoftware EngineeringEmpirical Software EngineeringSoftware Quality AssuranceMachine LearningStatistical and Data AnalysisDeep Learning for Cyber SecurityArtificial intelligence Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2019 2023 2024 2027 3 Active 5 Finished Projects per year Australian Summer School in Software Engineering (OzSE) 2026Tantithamthavorn, K. (Primary Chief Investigator (PCI)), Arora, C. (Chief Investigator (CI)), Thongtanunam, P. (Chief Investigator (CI)), Bi, T. (Chief Investigator (CI)) & Fu, M. (Chief Investigator (CI))1/07/25 → 31/12/26Project: Research CSIRO Next Generation Graduates Program: Automated Testing of Large Language Models (LLMs) in MLOpsTantithamthavorn, K. (Primary Chief Investigator (PCI)), Chua, J. (Chief Investigator (CI)), Yang, R. (Chief Investigator (CI)) & Arora, C. (Chief Investigator (CI))CSIRO - Commonwealth Scientific and Industrial Research Organisation, Transurban Limited (trading as Transurban Linkt)15/04/24 → 15/10/27Project: Research RAISE: RAISE: Creating Responsible AI Software Engineering CapabilityTantithamthavorn, K. (Primary Chief Investigator (PCI)), Grundy, J. (Chief Investigator (CI)), Abdelrazek, M. A. (Chief Investigator (CI)), Thongtanunam, P. (Chief Investigator (CI)), Aleti, A. (Chief Investigator (CI)), Nakisa, B. (Chief Investigator (CI)), Treude, C. (Associate Investigator (AI)), Zahedi, M. (Associate Investigator (AI)), Arora, C. (Associate Investigator (AI)), Hoda, R. (Associate Investigator (AI)), Chen, C. (Associate Investigator (AI)), Chen , J. (Associate Investigator (AI)), Cooray, M. (Associate Investigator (AI)), Bigdeli, A. (Associate Investigator (AI)), Uzunov, A. (Associate Investigator (AI)), Hurse, M. (Associate Investigator (AI)) & Saunders, S. (Associate Investigator (AI))Episoft Pty Ltd, Swordfish Computing Pty Ltd1/01/23 → 31/12/27Project: Research LLM4SE: Improving Developer's Productivity Through Large Language Models for Various Software Engineering Tasks at AtlassianTantithamthavorn, K. (Primary Chief Investigator (PCI)) & Takerngsaksiri, W. (Chief Investigator (CI))8/04/24 → 8/07/24Project: Research Improving ChulaVerse: Improving ChulaVerse for Lifelong LearningTantithamthavorn, K. (Primary Chief Investigator (PCI))5/03/24 → 23/04/24Project: Research View all 8 projects Research output Research output per year 2012 2022 2023 2024 2025 40 Conference Paper 39 Article 2 Comment / Debate 2 Editorial Research output per year Research output per year An empirical study of model-agnostics techniques for defect prediction modelsJiarpakdee, J., Tantithamthavorn, C., Dam, H. K. & Grundy, J., 1 Jan 2022, In: IEEE Transactions on Software Engineering. 48, 1, p. 166-185 21 p.Research output: Contribution to journal › Article › Research › peer-review 101 Citations (Scopus) Predicting defective lines using a model-agnostic techniqueWattanakriengkrai, S., Thongtanunam, P., Tantithamthavorn, C., Hata, H. & Matsumoto, K., 1 May 2022, In: IEEE Transactions on Software Engineering. 48, 5, p. 1480-1496 17 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 74 Citations (Scopus) AI for DevSecOps: A Landscape and Future OpportunitiesFu, M., Pasuksmit, J. & Tantithamthavorn, C., 28 Apr 2025, In: ACM Transactions on Software Engineering and Methodology. 34, 4, 61 p., 115.Research output: Contribution to journal › Article › Research › peer-review 5 Citations (Scopus) Enhancing large language models for text-to-testcase generationAlagarsamy, S., Tantithamthavorn, C., Takerngsaksiri, W., Arora, C. & Aleti, A., Dec 2025, In: Journal of Systems and Software. 230, 14 p., 112531.Research output: Contribution to journal › Article › Research › peer-review 2 Citations (Scopus) MLOps, LLMOps, FMOps, and BeyondTantithamthavorn, C. K., Palomba, F., Khomh, F. & Chua, J. J., Jan 2025, In: IEEE Software. 42, 1, p. 26-32 7 p.Research output: Contribution to journal › Editorial › Other 3 Citations (Scopus) View all 83 research outputs Prizes ARC Discovery Early Career Researchers AwardTantithamthavorn, C. (Recipient), 2 Mar 2020Prize: Prize (including medals and awards) JSPS Research FellowshipTantithamthavorn, C. (Recipient), 1 Apr 2014Prize: Competitive Fellowships Activities Activities per year 2016 2016 2020 2020 2 Peer review responsibility 1 Editorial responsibility Activities per year IEEE Transactions on Software Engineering (Journal)Tantithamthavorn, C. (Peer reviewer)2020Activity: Publication peer-review and editorial work types › Peer review responsibility IEEE Transactions on Software Engineering (Journal)Tantithamthavorn, C. (Peer reviewer)1 May 2016Activity: Publication peer-review and editorial work types › Peer review responsibility Empirical Software Engineering (Journal)Tantithamthavorn, C. (Peer reviewer)1 Dec 2016Activity: Publication peer-review and editorial work types › Editorial responsibility Press/Media How data helps doctors make life-saving decisions in emergency careTantithamthavorn, C.16/11/201 Media contributionPress/Media: Article/Feature JITBot: An Explainable Just-In-Time Defect Prediction BotTantithamthavorn, C.22/09/201 Media contributionPress/Media: Article/Feature",
  "content_length": 9199,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:01"
}