{
  "name": "Chang Hyun Park 0001",
  "homepage": "https://iamchanghyunpark.github.io",
  "status": "success",
  "content": "Chang Hyun Park Chang Hyun Park I am an Assistant Professor at the Uppsala Architecture Research Team, Uppsala University My previous positions were: Post-doctoral researcher at Uppsala University working with Professor David Black-Schaffer PhD student at the Computer Architecture and Systems Lab in KAIST, advised by Professor Jaehyuk Huh Contact Information: Email: chang.hyun.park [_a_t_] it.uu.se Linkedin Profile, Google Scholar, DBLP Profile Research Interests My research interests are in the following: Architectural support for system softwares: both native and virtualized. The virtual memory system and address translation, cache and memory systems. Virtual memory system and address translation for emerging memory systems such as stacked DRAM and NVRAM. Virtual memory system for I/O devices (NVMe, Network, etc.) and Accelerators (GPUs, NPUs, etc.) Publications Conferences Wonung Kim, Yubin Lee, Yoonsung Kim, Jinwoo Hwang, Seongryong Oh, Jiyong Jung, Aziz Huseynov, Woong Gyu Park, Chang Hyun Park, Divya Mahajan, and Jongse Park \"Pimba: A Processing-in-Memory Acceleration for Post-Transformer Large Language Model Serving\" The 58th IEEE/ACM International Symposium on Microarchitecture (MICRO), October 2025 ACM DL Alireza Haddadi, David Black-Schaffer and Chang Hyun Park \"Large-scale Graph Processing on Commodity Systems: Understanding and Mitigating the Impact of Swapping\" The International Symposium on Memory Systems (MEMSYS), October 2023 Paper Slides Recording Bibtex Muhammad Hassan, Chang Hyun Park and David Black-Schaffer, \"Protean: Resource-efficient Instruction Prefetching\" The International Symposium on Memory Systems (MEMSYS), October 2023 Paper Slides Bibtex Bokyeong Kim, Soojin Hwang, Sanghoon Cha, Chang Hyun Park, Jongse Park and Jaehyuk Huh, \"Supporting Dynamic Translation Granularity for Hybrid Memory Systems\" The 40th IEEE International Conference on Computer Design (ICCD), October 2022 IEEE Xplore Bibtex Chang Hyun Park, Ilias Vougioukas, Andreas Sandberg, and David Black-Schaffer, \"Every Walk’s a Hit: Making Page Walks Single-Access Cache Hits\", The 27th ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), February 2022 DIVA Open Access ACM DL(Open Acces) Slides Poster Arm Blog Uppsala University Newsletter Bibtex Recording Chang Hyun Park, Sanghoon Cha, Bokyeong Kim, Youngjin Kwon, David Black-Schaffer, and Jaehyuk Huh, \"Perforated Page: Supporting Fragmented Memory Allocation for Large Pages\", The 47th International Symposium on Computer Architecture (ISCA), June 2020 DIVA Open Access IEEE Xplore Slides Poster Bibtex Recording Jungi Jeong, Chang Hyun Park, Jaehyuk Huh, and Seungryoul Maeng, \"Efficient Hardware-assisted Logging with Asynchronous and Direct Update for Persistent Memory\", The 51st Annual IEEE/ACM International Symposium on Microarchitecture (MICRO), October 2018 IEEE Xplore Bibtex Jeongseob Ahn, Chang Hyun Park, Taekyung Heo, and Jaehyuk Huh, \"Accelerating Critical OS Services in Virtualized Systems with Flexible Micro-sliced Cores\" The 13th ACM European Conference on Computer Systems (EuroSys), April 2018 Paper ACM DL Bibtex Chang Hyun Park, Taekyung Heo, Jungi Jeong, Jaehyuk Huh, \"Hybrid TLB Coalescing: Improving TLB Translation Coverage under Diverse Fragmented Memory Allocations\" The 44th International Symposium on Computer Architecture (ISCA), June 2017 Paper ACM DL Slides Bibtex Chang Hyun Park, Taekyung Heo, and Jaehyuk Huh, \"Efficient Synonym Filtering and Scalable Delayed Translation for Hybrid Virtual Caching\", The 43rd International Symposium on Computer Architecture (ISCA), June 2016 Paper ACM DL Slides Bibtex Jeongseob Ahn, Chang Hyun Park, and Jaehyuk Huh, \"Micro-sliced Virtual Processors to Hide the Effect of Discontinuous CPU Availability for Consolidated Systems\", The 47th Annual IEEE/ACM International Symposium on Microarchitecture (MICRO), December 2014 Paper IEEE Xplore Bibtex Journals Muhammad Hassan, Chang Hyun Park, and David Black-Schaffer \"Second-level Caches: Not for Instructions\" ACM Transactions on Architecture and Code Optimization (ACM TACO) Accepted on 8 September 2025 ACM DL(Open Access) Jongho Baik, Jonghyeon Kim, Chang Hyun Park, and Jeongseob Ahn, \"Accelerating Page Migrations in Operating Systems with Intel DSA\" IEEE Computer Architecture Letters (IEEE CAL), 2025 IEEE Xplore DIVA Open Access Ahmed Nematallah, Chang Hyun Park, and David Black-Schaffer, \"Exploring the Latency Sensitivity of Cache Replacement Policies\" IEEE Computer Architecture Letters (IEEE CAL), vol. 22, no. 2, pp. 93-96, July-December 2023 IEEE Xplore DIVA Open Access Muhammad Hassan, Chang Hyun Park, and David Black-Schaffer \"A Reusable Characterization of the Memory System Behavior of SPEC2017 and SPEC2006\" ACM Transactions on Architecture and Code Optimization (ACM TACO) Vol. 18, No. 2, Article 24, March 2021 ACM DL(Open Access) Taeklim Kim, Chang Hyun Park, Jaehyuk Huh, and Jeongseob Ahn \"Reconciling Time Slice Conflicts of Virtual Machines With Dual Time Slice for Clouds\", IEEE Transactions on Parallel and Distributed Systems (IEEE TPDS) Vol. 31 Issue 10, May 2020 IEEE Xplore Sanghoon Cha, Bokyeong Kim, Chang Hyun Park, and Jaehyuk Huh, \"Morphable DRAM Cache Design for Hybrid Memory Systems\", ACM Transactions on Architecture and Code Optimization (ACM TACO) Vol. 16, No. 3, Article 31, July 2019 ACM DL(Open Access) Daehoon Kim, Chang Hyun Park, Hwanju Kim, and Jaehyuk Huh, \"Virtual Snooping Coherence for Multi-core Virtualized Systems\", IEEE Transactions on Parallel and Distributed Systems (IEEE TPDS) Vol. 27 Issue 7, July 2016 IEEE Xplore Posters Bokyeong Kim, Soojin Hwang, Sanghoon Cha, Chang Hyun Park, Jongse Park, Jaehyuk Huh \"Decoupled Address Translation for Heterogeneous Memory Systems\" The 29th International Conference on Parallel Architectures and Compilation Techniques (PACT), October 2020 ACM DL Muhammad Hassan, Chang Hyun Park, David Black-Schaffer \"Architecturally-independent and Time-based Characterization of SPEC CPU 2017\" IEEE International Symposium on Performance Analysis of Systems and Software (ISPASS), August 2020 Extended Abstract Appendix DIVA",
  "content_length": 6180,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:07"
}