{
  "name": "Changhee Joo",
  "homepage": "https://rain.korea.ac.kr/members/professor",
  "status": "success",
  "content": "RAIN Lab. - ProfessorSearch this siteEmbedded FilesSkip to main contentSkip to navigationChanghee JooProfessorDept. of Computer Science and Engineering, Korea UniversityOffice: JUNGWOONOH IT&Education Center (정운오IT교양관) 604Email: changhee@korea.ac.kr For publication list, please visit [Google Scholar] or [DBLP]Awards:Contribution award, KICS (2021, 2023)Best paper award, EAI GAMENETS (2018)Best paper award, KICS ICTC (Oct. 2015)Haedong Young Scholar Award, KICS (2014)Best teaching award, UNIST (Feb. 2012)Best paper award, IEEE INFOCOM (2008)Professional activities:Senior Member of IEEEMember of KICS (한국통신학회), KIISE (한국정보과학회), KIPEE (한국실천공학교육학회)Deputy director of the BK21 Project Group, Sept. 2022 – PresentHead of Data Science Department, Aug. 2024 – Jan. 2025.Head of CSE (Graduate) Department, Aug. 2021 – July 2023.Member of Review Board (RB), National Research Foundation of Korea, Mar. 2021 – Aug. 2023.Dean of Academic Information Affairs, UNIST, Feb. 2016 – Aug.2018.Journal EditorEditor of IEEE Transactions on Vehicular Technology, Dec. 2020 – Present. Division Editor of Journal of Communications and Networks, Feb. 2020 – Present.Editor of IEEE/ACM Transactions on Networking, Aug. 2016 – Dec. 2020. Editor of Journal of Communications and Networks, April 2013 – Jan. 2019. Leading Guest Editor of Special Issue on V2X Communications and Networks, Journal of Communications and Networks, June 2017.Organizing Committee General Co-Chair of IEEE WiOpt (2024)General Co-Chair of ACM MobiHoc (2022)Publication Co-Chair of IEEE WiOpt (2021)Publicity Co-Chair of IEEE WCNC (2021)Symposium Co-Chair of IEEE/CIC ICC (Next Generation Networking and Internet) (2021)Track Co-Chair of IEEE WCNC (2020)Publicity Co-Chair of IEEE DySPAN (2018)Special session Co-Chair of KICS ICTC (2017)Workshop Co-Chair of KICS ICTC (2015)Social media Chair of IEEE SECON (2012)Technical Program Committee (TPC) 2026: ICOIN, ICAIIC2025: MOBIHOC, ICOIN, ICAIIC, ICUFN, APCC2024: MOBIHOC, ICOIN, ICTC2023: MOBIHOC, WiOpt2022: WiOpt, ICOIN, ICAIIC2021: MOBIHOC, WiOpt, COMSNETS, ICOIN2020: INFOCOM (Distinguished), COMSNETS, ICOIN, ICAIIC2019: INFOCOM, MOBIHOC, ICOIN2018: INFOCOM, MOBIHOC, ICOIN, VTC (Fall) 2017: INFOCOM, MOBIHOC, ISCC, ICUFN, ICOIN, VTC (Fall) 2016: INFOCOM, WiOpt, SECON, WCNC, ISCC, ICUFN, ICTC, ICOIN2015: INFOCOM, WiOpt, GLOBECOM, WCNC, ISCC, ICUFN, ICTC, ICNC, ATC 2014: INFOCOM, GLOBECOM, WCNC, ICUFN, ICTC, ICNC, ATC, ICC, VTC, COMSNETS2013: INFOCOM, GLOBECOM, ICUFN, ICNC.2012: INFOCOM, GLOBECOM, WCNC, ICUFN, ICNC, PIMRC 2011: INFOCOM, GLOBECOM, WCNC, ICUFN, COMSNETS2010: INFOCOM, COMSNETS, WCNC, ICOIN2009: INFOCOM, MOBIHOC, GLOBECOM, ICUFN, COMSNETS2008: MOBIHOC, GLOBECOM, IWCMC, COMSWARE, CHINACOM2007: GLOBECOM, COMSWARE2006: IWCMC, ICONGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2833,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:10"
}