{
  "name": "Changliu Liu",
  "homepage": "https://www.ri.cmu.edu/ri-faculty/changliu-liu",
  "status": "success",
  "content": "Warning: You are viewing this site with an outdated/unsupported browser. Please update your browser or consider using a different one in order to view this site without issue. For a list of browsers that this site supports, see our Supported Browsers page. Changliu Liu - The Robotics Institute - CMU Skip to content Changliu Liu Associate Professor Home Department: RI Office: 4525 Newell-Simon Hall Personal Homepage Administrative Assistant: Lynnetta Miller Lab: Intelligent Control Lab Statement Research Publications Students/Affiliates The ultimate goal of my research is to build intelligent and autonomous robots that think, behave and interact with the world in the way that human beings do, so that they can better serve, assist and collaborate with people in their daily lives across work, home and leisure. The fundamental research question is to ensure those robots operate efficiently and safely in a human-involved environment. I am interested in addressing the microscopic aspect of the problem, e.g. the design of the behavior system (i.e. a mapping from observation to action) for single robot, as well as the macroscopic aspect of the problem, e.g. the analysis and validation of the human-robot system from a multi-agent perspective. Such human-robot system can be human-robot collaboration system in production lines, future transportation system with both automated and human-driven vehicles, or general cyber physical social system (CPSS). Research Topics Human Robot Collaboration Safety for Physical Human-Robot Interaction Human-Robot Interaction Motion Planning Motion Control Manufacturing Robotics Multi-Robot Planning & Coordination AI Reasoning for Multi-Robot Systems Industrial Robotics Field & Service Robotics Intelligent Transportation Systems Human-Centered Robotics Robotics Foundations Changliu Liu's Google Scholar Profile current phd students Rui Chen Hongyi Chen Tairan He Feihan Li Wayne Liu Yifan Sun current masters students Maggie Cai Jacob Lessing Mehul Menon Yiyuan Pan Haowei Wen current affiliates Yikuan Fang Hanjiang Hu Sebin Jung Jiaxing Li Shangtao Li Bowei Li Guanxing Lu Xusheng Luo Rohan Nagabhirava Jichuan Yu Peiqi Yu past phd students Jaskaran Singh Grover Simin Liu Ravi Pandya past masters students Alvin Shek Zhihao Zhang",
  "content_length": 2284,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:15"
}