{
  "name": "Chang Xu 0001",
  "homepage": "https://cs.nju.edu.cn/changxu",
  "status": "success",
  "content": "Welcome to Chang Xu's homepage XU, Chang (许畅) Ph.D. (HKUST), CCF/IEEE senior member, ACM distinguished member Professor (Ph.D. supervisor) with: State Key Laboratory for Novel Software Technology School of Computer Science Institute of Computer Software (ICS) Mailing address: Room 807, Building of Computer Science and Technology Nanjing University (Xianlin Campus) 163 Xianlin Avenue, Qixia District, Nanjing, Jiangsu, China (210023) E-mail: [News] [Bio] [Research Interests] [Students] [Academic Services] [Teaching Duties] [Hobbies] News Magic on software engineering research: zhihu articles Potential graduate students: ICS recruitment portal (2025 open) Bio I obtained Ph.D. from The Hong Kong University of Science and Technology (HKUST) in 2008 (advisor: Prof. S.C. Cheung), M.Eng. from Institute of Software, Chinese Academy of Sciences (ISCAS) in 2003, and B.Eng. from University of Science and Technology of China (USTC) in 2000. I was a research assistant professor with HKUST from 2008 to 2010. I joined Nanjing University (NJU) as an associate professor in 2010, and was promoted to full professor in 2015. Awards or honors: ACM SIGSOFT Distinguished Paper Award (杰出论文奖) from ICSE 2025 Best Student Paper Award (最佳学生论文奖) from EUROSYS 2025 ACM Distinguished Member in 2024 Best Paper Award (最佳论文奖) from SOSP 2023 Best Paper Candidate (最佳论文提名奖) from ISSRE 2022 Yangtze River Scholar by the Ministry of Education (教育部长江学者特聘教授) in 2021 ACM SIGSOFT Distinguished Paper Awards and ACM Europe Council Best Paper Award (杰出论文奖和最佳论文奖) from ICSE 2021 Safety and Security of System Software Best Paper Award (最佳论文奖) from NASAC 2018 ACM SIGSOFT Distinguished Paper Award (杰出论文奖) from ASE 2018 NJU CS Virtue Star Award (南京大学计算机学科美德之星奖) in 2017 NJU Du-Sha Teaching Award (南京大学杜厦奖教金) in 2017 CCF Young Computer Scientist Award (中国计算机学会CCF青年科学家奖) in 2015 ACM Nanjing Rising Star Award (ACM南京新星奖) in 2014 Best Paper Award (最佳论文奖) from APSEC 2014 NJU BOB \"Jing\"-Ying Teaching Award (南京大学北京银行\"京\"英奖教金) in 2014 ACM SIGSOFT Distinguished Paper Award (杰出论文奖) from ICSE 2014 Mountain-Climbing Talent (南京大学登峰人才支持计划) since 2013 CVIC SE Talent (中创软件人才奖) in 2012 National Science and Technology Progress Award (国家科学技术进步奖) (Second Class) in 2011 New Century Excellent Talent in University by the Ministry of Education (教育部新世纪优秀人才) in 2010 Research Interests My research interests include big data software engineering, intelligent software testing and analysis, and adaptive and autonomous software systems. Recent research topics focus on the construction and runtime support for intelligent software in open environments, which cover the inconsistency detection and resolution for environments, and quality assurance for adaptive/concurrent/learning-based/smartphone-based/spreadsheet-based applications. My full publications, Google Scholar Citations, and DBLP page Associated research groups: SPAR (NJU) and CASTLE (HKUST) Students Present (MSc + PhD): Han Li (MSc; with Dr. Huiyan Wang; constraint checking) Li Qu (MSc; metamorphic testing) Zhiyong Chen (MSc; large language model) Yifei Xu (MSc; with Dr. Yi Qin; self-adaptive system) Ziyang Yan (Msc; program analysis) Zengji Li (Msc; software consistency) Peifeng Lu (Msc; software testing) Jiachen Zhu (Msc; system software) Chenxi Zhang (PhD; with Dr. Yue Li; program analysis) Lingyu Zhang (PhD; with Dr. Huiyan Wang; software consistency) Teng Zhang (PhD; with Dr. Yue Li; program analysis) Hanzhi Liu (PhD; with Dr. Yanyan Jiang; system software) Weijie Sun (PhD; software evoluation) Chaoyi Zhao (PhD; with Dr. Yanyan Jiang; system software) Yufei Liang (PhD; with Dr. Yue Li; program analysis) Tailin Chen (PhD; program analysis) Past: 2025: Xianfei Ou (PhD; with Dr. Yanyan Jiang; thesis: \"Research on Key Methodologies for Compiler Testing\"), Mingchen Gao (MSc; with Dr. Huiyan Wang), Mingxiao Wang (MSc; with Dr. Yi Qin), and Shuhui Zhang (MSc; with Dr. Huiyan Wang) 2024: Daohan Qu (MSc; with Dr. Yanyan Jiang), Ruijie Guo (MSc; with Dr. Ying Wang), Yan Yuan (MSc; with Dr. Ying Wang), Tianyun Zhang (MSc; with Dr. Yanyan Jiang), and Rong Yang (MSc; with Dr. Yi Qin) 2023: Cong Li (PhD; with Dr. Yanyan Jiang; thesis: \"Automating Device Adaptability of GUIs for Android Applications\"), Yicheng Huang (MSc; with Dr. Yanyan Jiang), Jinchi Chen (MSc; with Dr. Yi Qin), Chuyang Chen (MSc; with Dr. Huiyan Wang), Xinyi Mao (MSc; with Dr. Yi Qin), and Shuguan Liu (MSc; with Prof. Xiaoxing Ma and Dr. Huiyan Wang) 2022: Wenjie Li (PhD; with Dr. Jun Ma and Yanyan Jiang; thesis: \"Research on Inefficient Image Displaying Issues in Android Apps\"), Jue Wang (PhD; with Prof. Jian Lu and Dr. Yanyan Jiang; thesis: \"Automatically Detecting Deep Logic Bugs in Mobile Applications\"), Ziqi Chen (MSc; with Dr. Huiyan Wang), Yingzhuo Yang (MSc), and Siyuan Zhu (MSc; with Dr. Jingwei Xu) 2021: Huiyan Wang (PhD; thesis: \"Input Validation for Context-aware Intelligent Software via Consistency Checking\"), Dongjie Chen (PhD; with Prof. Xiaoxing Ma and Dr. Yanyan Jiang; thesis: \"Bug Interpretation-based Input Generation for Software Testing\"), Zelin Zhao (PhD; with Prof. Xiaoxing Ma and Dr. Yanyan Jiang; thesis: \"Automatic Patch Generation and Validation for Dynamic Software Updates\"), Jinci Chen (MSc), Da Li (MSc; with Prof. Jian Lu), and Shaocong Liu (MSc; with Dr. Jun Ma) 2020: Qingwei Sun (MSc; with Dr. Jun Ma) and Yi Liu (MSc; with Prof. Xiaoxing Ma and Dr. Yanyan Jiang) 2019: Yang Cao (MSc; with Dr. Yanyan Jiang), Yuju Shen (MSc; with Dr. Yanyan Jiang), and Dawei Cheng (MSc; with Prof. Xiaoxing Ma) 2018: Yi Qin (PhD; with Prof. Jian Lu; thesis: \"Software Testing for Cyber-physical Systems Suffering Uncertainty\"), Zhanshuai Meng (MSc; with Prof. Xiaoxing Ma and Dr. Yanyan Jiang), and Bingying Guo (MSc) 2017: Yanyan Jiang (PhD; with Prof. Jian Lu and Xiaoxing Ma; thesis: \"Understanding Shared Memory Dependences\"), Wenhua Yang (PhD; with Prof. Xiaoxing Ma; thesis: \"Verification and Counterexample Validation for Self-adaptive Software Systems Suffering Uncertain Environmental Interactions\"), Xiangyu Wu (MSc), Qiwei Li (MSc), Ruiqing Zhang (MSc), Xiaofan Li (MSc), and Tianxiao Gu (PhD; with Prof. Xiaoxing Ma and Chun Cao; thesis: \"On Dynamic Updating of Java Programs\") 2016: Jun Sui (MSc) 2015: Xuezhi Hong (MSc), Wang Xi (MSc), Hao Jin (MSc; with Prof. Xiaoxing Ma), and Xiujiang Li (MSc; with Prof. Xiaoxing Ma) 2014: Linghao Zhang (PhD; with Prof. Jian Lu and Xiaoxing Ma; thesis: \"Dealing with Faults in Self-adaptive Software System: An Explicit Environment Model-based Approach\"), Xiaokang Chen (MSc), Lei Jiang (MSc), and Hui Sun (MSc; with Prof. Xiaoxing Ma) 2012: Hailong Ge (MSc; with Prof. Xiaoxing Ma) and Hao Chen (MSc; with Prof. Xiaoxing Ma) Academic Services Editing journals: Editorial Board of Young Scientists on the area of Software Systems, Journal of Computer Science and Technology (JCST) Youth Area Editor, Frontiers of Computer Science (FCS) Special Editor on the area of Intelligent Software Engineering, Computer Science (CS) Associate Editor, Journal of Software: Evolution and Process (JSEP) Reviewing journals/magzines: Journal of Automated Software Engineering (ASEJ), Communications of the ACM (CACM), Journal of Computer Research and Development (CRAD), Frontiers of Computer Science (FCS), Journal of Computer Science and Technology (JCST), Journal of Software (JOS), Journal of Parallel and Distributed Computing (JPDC), The Journal of Systems and Software (JSS), Pervasive and Mobile Computing (PMC), Science China: Information Sciences (SCIS), IEEE Transactions on Systems, Man and Cybernetics: Systems (SMCA), Software: Practice and Experience (SPE), Software Testing, Verification and Reliability (STVR), IEEE Software (SW), ACM Transactions on Autonomous and Adaptive Systems (TAAS), IEEE Transactions on Parallel and Distributed Systems (TPDS), IEEE Transactions on Reliability (TR), IEEE Transactions on Services Computing (TSC), IEEE Transactions on Software Engineering (TSE), etc. Organizing conferences/symposiums: Program Co-chair, 2018 10th Asia-Pacific Symposium on Internetware (INTERNETWARE 2018) SETA Symposium Program Co-chair, 2017 41st Annual International Computers, Software and Applications Conference (COMPSAC 2017) English Track Co-chair, 2016 15th National Software Application Conference (NASAC 2016) Co-chair, 2014 Software Engineering Educators Symposium (SEES 2014; with FSE 2014) Doctoral Symposium Co-chair, 2013 ACM/IFIP/USENIX International Middleware Conference (MIDDLEWARE 2013) Serving program committees: 2026 ACM International Conference on the Foundations of Software Engineering (FSE 2026) Also for FSE 2025, ESEC/FSE 2022 (Ideas, Visions and Reflections Track) and ESEC/FSE 2021 2025 47th IEEE/ACM International Conference on Software Engineering (ICSE 2025) Also for ICSE 2024, ICSE 2021 (Doctoral Symposium), ICSE 2020, ICSE 2017 (Student Research Competition Track), and ICSE 2012 (Formal Demonstrations Track) 2025 40th IEEE/ACM International Conference on Automated Software Engineering (ASE 2025) Also for ASE 2024, ASE 2023, and ASE 2022 2021 21st IEEE International Conference on Software Quality, Reliability, and Security (QRS 2021) Also for QRS 2020, QRS 2019, QRS 2018, QRS 2017, QRS 2016, and QRS 2015 2015 ACM International Symposium on Software Testing and Analysis (ISSTA 2015, Demonstrations Track) Teaching Duties 2025 (Spring; 64/112): Principles and Techniques of Compilers (编译原理) Also in 2024 (Spring; 64/131), 2023 (Spring; 64/107), 2022 (Spring; 68/81), 2021 (Spring * 2; 64/41 and 64/106), 2020 (Spring * 2; 68/60 and 68/68), 2019 (Spring; 64/50), 2018 (Spring; 64/59), 2017 (Spring; 72/65), 2016 (Spring; 72/81), 2015 (Spring and Fall; 72/65 and 72/44), 2014 (Spring and Fall), 2013 (Spring), 2012 (Spring), and 2011 (Spring) 2024 (Spring; 16/95): 科学之光――走近 CSAI（计算机科学与人工智能） Also in 2023 (16/120), 2022 (Spring; 16/82) 2024 (Fall; 30/47): Guidance to Software Engineering Research (软件工程研究导引) Also in 2023 (Fall; 30/56), 2022 (Fall; 28/3",
  "content_length": 10274,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:08"
}