{
  "name": "Changhee Lee",
  "homepage": "https://sites.google.com/view/actionable-intelligence",
  "status": "success",
  "content": "The AI-LABSearch this siteEmbedded FilesSkip to main contentSkip to navigationThe Actionable Intelligence LabEver tried. Ever failed. No matter.Try again. Fail again. Fail better.- Samuel Beckett -Who we areThe Actionable Intelligence Lab at Korea University aims to develop cutting-edge machine learning and artificial intelligence theories and methods, with the goal of making \"better\" decisions. Led by Prof. Changhee Lee, the Actionable Intelligence Lab’s research team is developing a wide range of machine learning approaches including self- and semi-supervised learning, causal inference, automated ML, and many more to address unsolved real-world problems in healthcare, manufacturing, and other domains where critical decision making is the key.Find out more about our research pillars:Research PillarsJoin UsFor prospective students:  Prof. Lee will be accepting applications from highly motivated MS/Ph.D. students who are interested in solving real-world problems in healthcare. For post-doctoral researchers: Our group is seeking talented post-doctoral researchers to join our research team on an ambitious multi-year mission to develop cutting-edge ML/AI algorithms to solve real-world problems in healthcare.Apply via this application form!Preferred skillsets:  Linear algebra / Probability and Statistics /  Programming Skills (Python / Tensorflow / Pytorch)Recent News(11/2025) Eungyeop has been selected as a recipient of the AI Seoul Tech Scholarship for Graduate Students. Congratulations!(11/2025) Our paper on risk prediction of major adverse cardiovascular events has been accepted to JMIR Medical Informatics.(10/2025) Prof. Lee won 3rd place in the 2025 IEEE Transactions on Biomedical Engineering Best Paper Awards!!!(10/2025) Prof. Lee will give a tutorial on ML for next-generation LEO satellite communications at ICTC 2025.(10/2025) Prof. Lee will give a talk on the time-series foundation model at the National AI LAB - MILA Workshop.(09/2025) Prof. Lee will give a talk on global- and local-level interpretation using DL at the CCLAIM Summer School 2025.(08/2025) Prof. Lee and Jaeho will be organizing the ICAIF ’25 Workshop on Rethinking Financial Time-Series — Foundations, Frontiers, and Future Directions!(07/2025) Our paper on contrastive learning for text-image retrieval has been accepted to Applied Intelligence. Great job! Eungyeop :)(05/2025) Our paper on active feature acquisition has been accepted to ICML 2025.(01/2025) Our paper using NLP to predict risk in the pediatric ER has been accepted to Scientific Reports. Great job! Chohee and Dongjoon :)(09/2024) Our paper on contrastive learning-based survival analysis has been accepted to NeurIPS 2024. Great job! Dongjoon & Hyeryn :)(09/2024) Prof. Lee will give a talk on DL-based feature selection at the CCAIM Summer School 2024.(08/2024) Prof. Lee will join Korea University as an assistant professor in the Department of Artificial Intelligence starting Sep. 2024! (07/2024) Our paper on the group-sparse feature selection method has been accepted to IEEE Access. Great job! Hyeryn :)(07/2024) Our paper on domain-agnostic anomaly detection has been accepted to CIKM 2024. Great job! Hyuntae :)(05/2024) Our paper on synergistic feature selection has been accepted to ICML 2024. Great job! Chohee :)(01/2024) Our paper on time-series imputation has been accepted to ICLR 2024. Great job! MinGyu :)(01/2024) Our paper on Predictive HO with Time-series Forecasting has been accepted to IEEE Network Magzine (Impact Factor: 9.6).(09/2023) Our paper on active sensing under cost pressure has been accepted to NeurIPS 2023. (04/2023) Our paper on time-series forecasting using SDEs has been accepted to ICML 2023. (04/2023) We signed MOU with Incheon Fire Headquarters for the development of the AI System \"119 Amigo\"(01/2023) Our paper on temporal clustering has been accepted to AISTATS 2023. (12/2022) Chohee Kim, Hyuntae Kim, and Dongjoon Lee won the Grand Prize at the 2nd KAMP Contest sponsored by the Ministry of SMEs and Startups!(11/2022) Our work in collaboration with Aivis and Nuri Eye Hospital won the Grand Prize at Digital Innovation Award 2022!(07/2022) Our paper on the longitudinal time-to-event analysis and temporal clustering in non-metastatic prostate cancer patients has been accepted to npj Digital Medicine (Impact Factor: 15.357). Again, we are making real clinical impacts!(01/2022) Our paper on self-supervised learning for feature selection has been accepted to ICLR 2022. We got a spotlight :)(01/2022) Our paper on predicting good sleep based on physical activity and light exposure has been accepted to the Journal of Clinical Sleep Medicine.(10/2021) Our paper on treatment effect estimation on time-to-event outcomes has been accepted to NeurIPS 2021.(08/2021) I have joined Chung-Ang University (Department of Artificial Intelligence) as an assistant professor starting on Sep. 1st, 2021.(01/2021) Our paper on applying AutoML for time-to-event analysis in non-metastatic prostate cancer patients has been accepted to the Lancet Digital Health (Impact Factor: 36.615). We are making real clinical impacts!(01/2021) Our paper on integrating multi-omics data under various omics-missing patterns has been accepted to AISTATS 2021. (11/2020) Our paper on applying temporal clustering to Stage III breast cancer patients has been accepted to IEEE Transactions on Biomedical Engineering. (06/2020) Our paper on temporal clustering of heterogeneous disease progression patterns has been accepted to ICML 2020.  Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 5610,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:11"
}