{
  "name": "Chandra Krintz",
  "homepage": "http://www.cs.ucsb.edu/~ckrintz",
  "status": "success",
  "content": "Chandra Krintz, UCSB Professor Chandra Krintz Professor, Associate Dean of Graduate Division UCSB Computer Science HH 2009/2101 ckrintz@ucsb.edu Pubs Lab Students CV Bio News Chandra co-directs the Lab for Research on Adaptive Computing Environments (RACELab) and research efforts on xGFabric, SmartFarm, Where's the Bear (WTB), and Next-Gen Cloud/Edge IoT Systems, with Prof. Rich Wolski. Research Interests/Areas: Digital and precision agriculture; AI systems for the Internet of Things (IoT); programming systems; cloud computing and services; distributed edge computing; energy efficient computing. A complete publication list can be found here. Examples from the past few years: UCSB SmartFarm -- including xGFabric and other IoT/AI applications...Hybrid Edge Cloud Systems and HPC-linked Sensor Networks for Simplifying and Automating Energy Efficient Systems, Digital Agriculture, and Biosurveilance (including Where's The Bear (WTB)) [XLOOP25] [Sensors24] [CUPS 2023] [IEEE SmartAGR23] [SCI21] [ACM SEC20] [SPESI20] [ACM SEC19] [ICIOT19] [EDGE19] Next-Generation Cloud-Edge IoT SystemsIoT and Hybrid Cloud Computing, Edge Clouds, Adaptive Optimization, and more [AIoT25] [FMEC25] [IEEE Cloud24] [IEEE FMEC24] [IEEE CLOUD24] [ACM CF24] [IEEE SESAME23] [IEEE IC2E23] [IEEE CloudCom23] [IEEE TPDS] [Bench22] [IOTSMS22] [ACM SEC21] [IC2E21_Invited] [SCI21] [IC2E21] [EDGE21] [ACM SEC20] [SPESI20] [SmartEdge20] [DEBS19] [ACM SEC19] [IEEECloud19] [IC2E19] [EDGE19] Teaching and Service (past 3 years) Courses: (course links only available when course is being taught) F20-W21 CS595J/BREN595AL Research Seminar: Data-Driven Food Systems CS148 -- Computer Science Project (TBD) Syllabus CS263 -- Runtime Systems (F25) Syllabus CS189AB -- Computer Science Undergraduate Capstone (F25 - CS189A, W26 - CS189B) CS190B -- IoT Systems (F23) Syllabus Service (past 3 years): 2025-Present: Associate Graduate Dean of UCSB Graduate Division 2025-2026: Co-Editor (w/ Ovidiu Vermesan and Rosa Badia) for the special journal issue on Intelligent Self-Organised, Dynamic, and Adaptive Complex Distributed Systems in Frontiers in Complex Systems 2024-Present: Member Editorial Board, Digital Agriculture Journal; Pivot Science Publications 2024-25: Member -- Council on Research and Instructional Resources (CRIR) and the subcommittee on Information Technology 2023-24: Chair of the UCSB Graduate Council (+ member of the UCSB Executive Council, and UC-wide CCGA) 2022 Program Co-Chair (with Dave Bermbach) of IEEE IC2E 2022 2021-25: Member -- CRA Computing Community Consortium (CCC) Council 2021-2023: Chair of the Scientific Advisory Board -- AIFarms AI Institute 2022-2023: Vice Chair of the UCSB Graduate Council 2021-2023: Members of the Scientific Advisory Board -- IoT4Ag Engineering Research Center 2021-2024: Member of the UCSB Graduate Council 2021-24: Member of the IEEE IC2E Steering Committee 2019-23: Vice Chair of Graduate Affairs, CS Dept. UCSB Awards and Press (past 3 years) RACELab's massive raspberry pi cluster (Oracle Gift!) featured in the UCSB Current (Apr 2025) 2025 NSF funds our 3-year project on Distributed Dataflow for the Internet of Things! 2025 Co-led a panel on energy efficient computing selected as a scientific session at the AAAS Annual Meeting 2025. Computing is Eating the World: Will Saving the Planet Destroy It? 2024 Interview on Energy Efficient AI with Michela Taufer (UTK) for Inside AI News, Oct 2024 2024 DOE funds UCSB/BNL/UNL/UND collaboration on Coupling Sensor Networks and HPC Facilities with Advanced Wireless Networks for Near-Real-Time Simulation of Digital Agriculture! 2024 Honored to be featured as the Cal-Bridge Spotlight!! 2024 - Invited to give keynote at the IEEE World AI IoT Congress (AIIoT)! 2024 - Invited to speak at the Vineyard Team's Ag Expo © Copyright Chandra Krintz. Last update 11/14/25",
  "content_length": 3850,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:07"
}