{
  "name": "Changhee Jung",
  "homepage": "https://www.cs.purdue.edu/homes/chjung",
  "status": "success",
  "content": "Changhee Jung Changhee Jung Samuel D. Conte Associate Professor Department of Computer Science Purdue University 305 N. University Street West Lafayette, IN 47907 Office: LWSN 3154G Phone: (765) 494-8508 Email: chjung at purdue (_dot_) edu Ph.D., Georgia Tech, 2013 My research interests are in compilers and computer architecture with an emphasis on performance, reliability, and security. I have developed program analysis and microarchitecture optimization techniques for soft error resilience, concurrency bug detection, and system security such as memory safety and Linux kernel permission check. Currently, I am working on energy-efficient intermittent computation and nonvolatile memory crash consistency. To come up with cost-effective solutions, I often leverage compiler-architecture codesign and repurpose existing hardware features. Prior to joining Purdue, I was an Assistant Professor at Virginia Tech which I joined after completing my PhD under the supervision of Prof. Santosh Pande at Georgia Tech in 2013. During the three summers between 2010 and 2012, I worked as a software engineering intern with the compiler optimization team at Google. From 2005 to 2008, I was a member of the research staff at ETRI (Electronics and Telecommunications Research Institute). I was honored to receive an NSF CAREER Award (2018) and inducted into MICRO Hall of Fame (2021). Currently, I am serving as an Associate Editor for ACM Transactions on Computer Systems (TOCS) . Please submit your best article to TOCS! My lab, the CompArch (Compiler and Architecture) research group, was formed in 2013 at Virginia Tech and is now at Purdue. CompArch focuses on compiler-architecture cooperation, compiler optimization, and computer architecture exploration to address cross-cutting concerns involving performance, reliability, and security. The two logos below were designed by my daugthers Hannah and Chayah, respectively, when they were 11 and 8 years old. News Open positions for graduate students and postdocs. Email me your CV, if you are interested in compilers and computer architecture. Kagura accepted to HPCA 2026. Congratulations to Gan, Jianping, and Yuchen! 2 jounral papers accepted IEEE Micro and ACM TECS. Congratulations to all the authors! IPEX nominated for the Best Paper Award at ISCA 2025! Congratulations to Gan, Jianping, and Aditya! 2 papers (IPEX and WarmCache) accepted to ISCA 2025. Congratulations to all the authors! EDBP accepted to HPCA 2025. Congratulations to Gan! 5 papers accepted to MICRO (2x), ICCAD, EMSOFT, and CODES+ISSS 2024. Congratulations to all the authors! 4 papers accepted to ISCA, OSDI, ICS, and RTAS 2024. Congratulations to all the authors! Congratulations to Jianping for getting his paper selected as Memorable Paper Award Finalist in NVMW 2024. Jongouk received ACM SIGBED Paul Caspi Memorial Dissertation Award! Congratulations to Prof. Choi! RTailor accepted to RTSS 2023. Congratulations to Shao-Yu and Jianping! 2 papers (SweepCache and Persistent Processor) accepted to MICRO 2023! Congratulations to Yuchen, Jongouk, Jianping and Jungi! Write-Light Cache accepted to ISCA 2023. Congratulations to Jongouk and Jianping! DevFuzz accepted to S&P (Oakland) 2023. Congratulations to Yilun and Tong! Flame accepted to MICRO 2022. Congratulations to Yida! Capri accepted to HPDC 2022. Congratulations to Jungi and Jianping! CapOS and RockClimb accepted to EMSOFT 2022 and RTAS 2022 respectively. Congratulations to Jongouk! Inducted to MICRO Hall of Fame 2 papers (ReplayCache and Turnpike) accepted to MICRO 2021! Congratulations to Jianping (2x), Jongouk, and Hongjune! Congratulations to Jongouk for getting his paper selected as Memorable Paper Award Finalist in NVMW 2021. PMEM-Spec accepted to ASPLOS 2021. Congratulations to Jungi! UHTM accepted to MICRO 2020. Congratulations to Jungi! Penny accepted to PLDI 2020. Congratulations to Hongjune, Jianping, and Qingrui! I am serving as the program chair for LCTES 2020. Submit your best work! CoSpec accepted to MICRO 2019. Congratulations to Jongouk and Qingrui! PeX accepted to USENIX Security 2019. Congratulations to Tong! Old News I will be joining the Department of Computer Science at Purdue University as an Associate Professor. Elastin accepted to RTAS 2019. Congratulations to Jongouk! I am co-charing HIPS 2019 with Neha Gholkar (Intel). Submit your best work! BOGO accepted to ASPLOS 2019. Congratulations to Tong! 2 papers (iDO and Sampler) accepted to MICRO 2018! Congratulations to Qingrui and Tong! Congratulations to Qingrui for successfully defending his PhD thesis! A new grant awarded from NSF CSR CommAnalyzer accepted to HPDC 2018. Congratulations to Ahmed! Received an NSF CAREER Award nAdroid accepted to CGO 2018. Congratulations to Xinwei! AutoMatch accepted to IISWC 2017. Congratulations to Ahmed! BenchPrime accepted to EMSOFT 2017. Congratulations to Qingrui, Xiaolong, and Larry! ProRace accepted to ASPLOS 2017. Congratulations to Tong! Received AMD Faculty Research Award A paper accepted to MICRO 2016. Congratulations to Qingrui! Bolt accepted to SC 2016 as Best Student Paper Finalist. Congratulations to Qingrui! A paper accepted to NVMSA 2016. Congratulations to Qingrui! A journal paper accepted to ACM TECS. Congratulations to Qingrui! TxRace accepted to ASPLOS 2016. Congratulations to Tong! A new patent granted! It was proposed to improve TCMalloc, Google 's open-source memory allocator, but would be applicable to other allocators. If you are interested in it, please take a look at US Patent 9063668. Received Google Faculty Research Award A new grant awarded from NSF CCF Clover accepted to LCTES 2015. Congratulations to Qingrui! I will be serving as the Publicity and Publications Chair for ASPLOS 2016. Please consider submitting your best work! 2 papers accepted to ICSE 2014! Publications [TOP-TIER] tag is used to mark the paper that appears in one of the top CS conferences selected by csrankings.org Gan Fang, Jianping Zeng, Yuchen Zhou, and Changhee Jung, \"Intermittence-Aware Cache Compression\", IEEE International Symposium on High-Performance Computer Architecture (HPCA), January 2026. Khakim Akhunov, Kasim Sinan Yildirim, Jongouk Choi, and Changhee Jung, \"Adaptive Computing In Memory Meets Conventional Batteryless Platforms\", ACM Transactions on Embedded Computing Systems (TECS), 2025. Jianping Zeng, Shuyi Pei, Da Zhang, Yuchen Zhou, Amir Beygi, Xuebin Yao, Ramdas Kachare, Tong Zhang, Zongwang Li, Marie Nguyen, Rekha Pitchumani, Yang Seok Ki, and Changhee Jung, \"Performance Characterizations and Usage Guidelines of Samsung CXL Memory Module Hybrid Prototype\", IEEE Micro Special Issue, 2025. Gan Fang, Jianping Zeng, Aditya Gupta, and Changhee Jung, \"Rethinking Prefetching for Intermittent Computing\", [TOP-TIER] ACM/IEEE International Symposium on Computer Architecture (ISCA), June 2025. Best Paper Honorable Mention Noureldin Hassan, Byounguk Min, Changhee Jung, Yan Solihin, and Jongouk Choi, \"WarmCache: Exploiting STT-RAM Cache for Low-Power Intermittent Systems\", [TOP-TIER] ACM/IEEE International Symposium on Computer Architecture (ISCA), June 2025. Gan Fang and Changhee Jung, \"Rethinking Dead Block Prediction for Intermittent Computing\", IEEE International Symposium on High-Performance Computer Architecture (HPCA), March 2025. Yuchen Zhou, Jianping Zeng, and Changhee Jung, \"LightWSP: Whole-System Persistence on the Cheap\", Annual Non-Volatile Memories Workshop (NVMW), March 2025. Gan Fang, Jongouk Choi, and Changhee Jung, \"Hybrid Power Failure Recovery for Intermittent Computing\", Annual Non-Volatile Memories Workshop (NVMW), March 2025. Jongouk Choi, Jaeseok Choi, Hyunwoo Joe, and Changhee Jung, \"Caphammer: Exploiting Capacitor Vulnerability of Energy Harvesting Systems\", Annual Non-Volatile Memories Workshop (NVMW), March 2025. Jaeseok Choi, Hyunwoo Joe, Changhee Jung, and Jongouk Choi, \"Defending Against EMI Attacks on Just-In-Time Checkpoint for Resilient Intermittent Systems\", Annual Non-Volatile Memories Workshop (NVMW), March 2025. Youngkwang Han, Zhenyu Hu, Jongouk Choi, Kazi Abu Zubair, Amro Awad, Changhee Jung, and Brent Byunghoon Kang, \"A Novel Efficient Crash Consistency Solution Enabling Rollback Recovery for Secure NVM in Low-Power Energy Harvesting Systems\", IEEE Transactions on Dependable and Secure Computing (TDSC), 2025. Yuchen Zhou, Jianping Zeng, and Changhee Jung, \"LightWSP: Whole-System Persistence on the Cheap\", [TOP-TIER] IEEE/ACM International Symposium on Microarchitecture (MICRO), November 2024. Jaeseok Choi, Hyunwoo Joe, Changhee Jung, and Jongouk Choi, \"Defending Against EMI Attacks on Just-In-Time Checkpoint for Resilient Intermittent Systems\", [TOP-TIER] IEEE/ACM International Symposium on Microarchitecture (MICRO), November 2024. Gan Fang, Jongouk Choi, and Changhee Jung, \"Hybrid Power Failure Recovery for Intermittent Computing\", [TOP-TIER] ACM/IEEE International Conference on Computer-Aided Design (ICCAD), October 2024. Jongouk Choi, Jaeseok Choi, Hyunwoo Joe, and Changhee Jung, \"Caphammer: Exploiting Capacitor Vulnerability of Energy Harvesting Systems\", [TOP-TIER] ACM SIGBED International Conference on Embedded Software (EMSOFT), September 2024. Sen Wang, Dong Li, Shao-Yu Huang, Xuanliang Deng, Ashrarul H. Sifat, Jia-Bin Huang, Changhee Jung, Ryan Williams, and Haibo Zeng, \"Time-Triggered Scheduling for Non-Preemptive Real-Time DAG Tasks Using 1-Opt Local Search\", International Conference on Hardware/Software Codesign and System Synthesis (CODES+ISSS), September 2024. Yilun Wu, Byounguk Min, Mohannad Ismail, Wenjie Xiong, Changhee Jung, and Dongyoon Lee, \"IntOS: Persistent Embedded Operating System and Language Support for Multi-threaded Intermittent Computing\", [TOP-TIER] USENIX Symposium on Operating Systems Design and Implementation (OSDI), July 2024. Jianping Zeng, Tong Zhang, and Changhee Jung, \"Compiler-Directed Whole-System Persistence\", [TOP-TIER] ACM/IEEE International Symposium on Computer Architecture (ISCA)",
  "content_length": 29568,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:12"
}