{
  "name": "Chandrajit L. Bajaj",
  "homepage": "http://www.cs.utexas.edu/~bajaj",
  "status": "success",
  "content": "Chandrajit Bajaj Chandrajit Bajaj Biography Research Publications Teaching Group Projects Software Sponsors Collaborators Computational Applied Mathematics Chair in Visualization Professor of Computer Science Director of Center for Computational Visualization Department of Computer Sciences & The Oden Institute of Computational Engineering and Sciences & Center for Computational Visualization; CVC Mirror, 201 East 24th Street, ACES 2.324A, 1 University Station, C0200 Austin, TX 78712-0027 Admin. Assoc. : Suzanne Bailey (suzanne@ices.utexas.edu) Office Phone : +1 512-471-8870 FAX : +1 512-471-0982 EMAIL : bajaj@cs.utexas.edu Education B.Tech. in Electrical Engineering(1980) Indian Institute of Technology, New Delhi, India M.S. and Ph.D. in Computer Sciences (1983, 1984) Cornell University, Ithaca, New York Professional Experience Computational Applied Mathematics Chair of Visualization, University of Texas 1997- Professor of Computer Sciences, University of Texas 1997- Director of Center for Computational Visualization, University of Texas 1997- Director of Image Analysis and Visualization Center, Purdue University 1996-97 Professor of Computer Sciences, Purdue University 1993-97 Associate Professor of Computer Sciences, Purdue University 1989-93 Visiting Associate Professor of Computer Sciences, Cornell University 1990-91 Assistant Professor of Computer Sciences, Purdue University 1984-89 Honors, Awards & Membership in Professional Societies National Science Talent Scholarship, 1975. Dean's Honor Roll, IIT Delhi, 1975-1980, Scholastic Merit Award, (B. Tech. DGPA of 10.00/10.00) Frame Technology Excellence in Publishing Award, 1993 Purdue University, Provost's Research Center Initiation Award, 1994 Association of Computing Machinery, Student Chapter, Appreciation Certificate 2001, Recognition of Service Award, 2002 University of Texas, Faculty Research Assignment Award 2004, Dean Research Assignment Award 2004 Selected Keynote Addresses at SIAM Computational Science (2000), Pacific Computer Graphics (2002), Volume Graphics (2003), EuroGraphics (2004), CyberWorlds (2005), Jacques Morgenstern Lecture, INRIA-Sophia Antipolis, (2006), Nexus Colloquium, U. of Stuttgart, (2006), Institute of Mathematics and Applications (2006, 2007) Papers Committee Chairman International Symposium on Algebraic and Symbolic Computation (2000), Symposium on Computational Geometry (2002) Elected Member of Sigma Xi and Upsilon Pi Epsilon Honor Societies Member of Association of Computing Machinery(ACM), Institute of Electrical and Electronic Engineers (IEEE), Society of Industrial and Applied Mathematics (SIAM), American Association for Advancement of Sciences (AAAS) Member of the NSF-CISE Board of Visitors, (2004), ETH Zurich Evaluation Committee (2004), INRIA Evaluation Committee (2007) Member of the NIH-NCRR National Biomedical Computation Resource Advisory Committee, 2006 - Present Member of the National Academy of Sciences -Vietnam Education Foundation, 2006, 2007 Fellow of the American Association for the Advancement of Science (AAAS), 2008 Fellow of the Association for Computing Machinery (ACM), 2009 Editorships ACM Computing Surveys International Journal of Computational Geometry and Applications SIAM Journal on Imaging Sciences The long version of my Curriculum Vitae",
  "content_length": 3309,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:09"
}