{
  "name": "Chang Ge 0002",
  "homepage": "https://www-users.cse.umn.edu/~cge",
  "status": "success",
  "content": "Chang Ge Work Experience Teaching Selected Publications Patents Awards & Honors Recent Services Miscellanies Chang Ge Email: cge AT umn.edu Office: 4-213 Keller Hall, 200 Union Street SE, Minneapolis, MN 55455 I am an assistant professor in the Department of Computer Science and Engineering at the University of Minnesota since September 2022. I obtained a PhD in computer science from the University of Waterloo in June 2022. My main research focuses on the area of data systems, with special interest in enabling data analysis on dirty, private, and federated data. Open positions: I have multiple openings for self-motivated students. If you are interested in working with me, please read this. Work Experience University of Minnesota - Twin Cities, Minneapolis, MN Department of Computer Science and Engineering Assistant Professor, 09/2022 – present Apple, WFH Research Intern in Proactive Intelligence, 01/2022 – 05/2022 Megagon Labs, Mountain View, CA Research Intern, 05/2019 – 08/2019 Microsoft Research, Redmond, WA Research Intern in the Database Group, 05/2018 – 08/2018 IBM Toronto Lab, Markham, ON Software Engineer in the DB2 Performance team, 06/2014 – 06/2016 SAP, Waterloo, ON Research Intern in HANA, 06/2013 – 03/2014 Teaching University of Minnesota - Twin Cities, Minneapolis, MN Department of Computer Science and Engineering Spring'24: CSCI 4707: Practice of Database Systems Fall'23: CSCI 4707: Practice of Database Systems Spring'23: CSCI 8980: Advanced Topics in Databases Toronto Metropolitan University, Toronto, ON Sessional Lecturer, 09/2014 – 06/2016 The founding instructor for the certificate course CKCS 110: Data Access and Management. Class photos: Fall'14, Winter'15, Spring'15, Fall'15, Winter'16, Spring'16. Selected Publications SoK: Privacy-Preserving Data Synthesis Yuzheng Hu, Fan Wu, Qinbin Li, Yunhui Long, Gonzalo Munilla Garrido, Chang Ge, Bolin Ding, David Forsyth, Bo Li, Dawn Song To appear in IEEE S&P 2024 Kamino: Constraint-Aware Differentially Private Data Synthesis Chang Ge, Shubhankar Mohapatra, Xi He, Ihab F. Ilyas VLDB 2021 Talk, Paper, Code Secure Multi-Party Functional Dependency Discovery Chang Ge, Ihab F. Ilyas, Florian Kerschbaum VLDB 2020 Talk, Paper, Code APEx: Accuracy-Aware Differentially Private Data Exploration Chang Ge, Xi He, Ihab F. Ilyas, Ashwin Machanavajjhala SIGMOD 2019 Talk, Paper, Code Ruler: Data Programming by Demonstration for Document Labeling Sara Evensen, Chang Ge, Cagatay Demiralp EMNLP (Findings) 2020 Speculative Distributed CSV Data Parsing for Big Data Analytics Chang Ge, Yinan Li, Eric Eilebrecht, Badrish Chandramouli, Donald Kossmann SIGMOD 2019 Talk Towards a Hybrid Design for Fast Query Processing in DB2-BLU Using Graphical Processing Units Sina Meraji, Berni Schiefer, Lan Pham, Lee Chu, Peter Kokosielis, Adam Storm, Wayne Young, Chang Ge, Geoffrey Ng, Kajan Kanagaratnam SIGMOD 2016 Indexing Bi-temporal Windows Chang Ge, Martin Kaufmann, Lukasz Golab, Peter M. Fischer, Anil K. Goel SSDBM 2015 Bi-temporal Timeline Index: A Data Structure for Processing Queries on Bi-temporal Data Martin Kaufmann, Peter M. Fischer, Norman May, Chang Ge, Anil K. Goel, Donald Kossmann ICDE 2015 Patents Timeline Index for Partitioned Temporal Database Tables Anil Goel, Norman May, Martin Kaufmann, Chang Ge, Andreas Luethi, Puspanantha Shanmuganathan, Donald Kossmann, Elias Yousefi Amin Abadi US-2016-0042039-A1 Bi-temporal Timeline Index Martin Kaufmann, Anil Goel, Chang Ge, Donald Kossmann US-2015-0169697-A1 Awards and Honors Queen Elizabeth II Graduate Scholarships in Science & Technology, 2019 – 2020, 2021 – 2022 Ontario Graduate Scholarship, Government of Ontario, 2017 – 2018, 2020 – 2021 President’s Graduate Scholarship, University of Waterloo, 2017 – 2022 Cybersecurity and Privacy Excellence Graduate Scholarship, 2019 – 2020 Cheriton Scholarship, University of Waterloo, 2016 – 2020 Recent Services PC: - 2023: ICDE, ASTRIDE, SIGMOD AR, SDM, DOLAP, VLDB, QDB, SBBD, SoCC - 2022: ICDE University of Minnesota: - Committee member of Graduate Admissions, 2022 - present - Member of Minnesota Population Centre, 2022 - present - Member of Data Science Initiative, 2022 - present Miscellanies Half-Marathon Runner: YYZ'14,15,16, SWA'17, SFO'18, YYZ'19,20,21,22, MSP'23. I have a Coffee Skills Diploma from the Specialty Coffee Association, my certificate number is 3341. I developed the Samaritan. © 2024 Chang Ge Template design by Andreas Viklund",
  "content_length": 4487,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:09"
}