{
  "name": "Changyou Chen",
  "homepage": "https://cse.buffalo.edu/~changyou",
  "status": "success",
  "content": "Home ← Changyou Chen Home Publication Code Contact Courses Welcome I am an Associate Professor in the Department of Computer Science and Engineering at the University at Buffalo, State University of New York. I am interested in general AI techniques, with current research focusing on the topics of Multi-Modal Modeling and Learning Self-Supervised Learning Large Language Models Generative Models Large-scale Bayesian sampling and inference Previously, I was an Assistant Professor at the University at Buffalo, a Research Assistant Professor and a Postdoctoral Associate in the Department of Electrical and Computer Engineering at Duke University. I got my PhD from College of Engineering and Computer Science, the Australian National University in 2014 (PhD thesis), and my master and bachelor degrees both from School of Computer Science, Fudan University, Shanghai, China. I am an Area Chair for multiple AI conferences including ICML, NeurIPS, AAAI, IJCAI, and an Action Editor for Transactions on Machine Learning Research. My CV (outdated) can be downloaded here. With the current pace of AI development, it is difficult to maintain an up-to-date publication page. Please refer to my Google Scholar page for my up-to-date research. Highlights (More Recentâ¦) We are orgonizing the 1st workshop on [Foundation Models in Vision and Language], held in December 1st in conjunction with ICDM 2022, Orlando, FL, USA. Please click [here] for the details. We look forward to your excellent work! I will serve as an Area Chair for AAAI 2022. I will serve as an Area Chair for NeurIPS 2021-2022. I will serve as an Area Chair for IJCAI 2021. â¦ Two papers accepted by ICLR 2019. Two papers accepted by NeurIPS 2019. One paper accepted by IROS 2018. One paper accepted by UAI 2018. Two papers accepted by ICML 2018. Two papers accepted by AISTATS 2018. Students Shijie Zhou Jiayu Qin Jingchen Sun Rohan Jagdish Sharma Yaman Kumar Jian Chen Yufan Zhou: Now at Adobe Ping Yu: Now at Meta Yang Zhao: Now at Google Le Fang: Now at Meta Design by Mark Reid, (Some rights reserved) Powered by Jekyll, Pandoc, MathJax",
  "content_length": 2109,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:15"
}