{
  "name": "Chang-Hun Kim 0001",
  "homepage": "https://pure.korea.ac.kr/en/persons/chang-hun-kim",
  "status": "success",
  "content": "Chang-Hun Kim - Korea University Pure View Scopus Profile Chang-Hun Kim Professor Department of Computer Science and Engineering Emailchkimkorea.ackr h-index 1975 Citations 21 h-index Calculated based on number of publications stored in Pure and citations from Scopus 1996 …2025 Research activity per year Fingerprint Dive into the research topics where Chang-Hun Kim is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Fluid Simulation Engineering 100% Target Shape Engineering 83% 3D Objects Keyphrases 69% Multiphase Fluid Keyphrases 69% Experimental Result Engineering 66% Least Squares Method Computer Science 61% Visual Simulation Keyphrases 54% Virtual Worlds Keyphrases 50% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 1996 2003 2005 2006 2007 2013 2014 2015 2016 2017 2021 2025 78 Article 18 Conference contribution 5 Conference article 3 Chapter 3 More 2 Comment/debate 1 Paper Research output per year Research output per year Text Location-Aware Framework for Chinese Meme GenerationWang, L., Wu, R., Luo, P. & Kim, C. H., 2025, In: IEEE Access. 13, p. 151421-151434 14 p.Research output: Contribution to journal › Article › peer-review Open Access Location-aware 100% Text Location 100% Meme Generation 100% Object Detection 100% Meme 100% Real-Time Interaction for 3D Pixel Human in Virtual EnvironmentDeng, H., Zhang, Q., Jin, H. & Kim, C. H., 2023 Jan, In: Applied Sciences (Switzerland). 13, 2, 966.Research output: Contribution to journal › Article › peer-review Open Access Video Stream 100% Virtual Objects 100% Virtual Environment 100% Virtual Avatar 100% Real-time Interaction 100% 4 Citations (Scopus) Sequential UI behaviour prediction system based on long short-term memory networksChung, J., Hong, S., Kang, S. & Kim, C., 2022, In: Behaviour and Information Technology. 41, 6, p. 1258-1269 12 p.Research output: Contribution to journal › Article › peer-review Systems-based 100% User Interface 100% Interface Behavior 100% Prediction System 100% Behavior Prediction 100% 5 Citations (Scopus) Visual simulation of turbulent foams by incorporating the angular momentum of foam particles into the projective frameworkKim, K. H., Lee, J., Kim, C. H. & Kim, J. H., 2022 Jan 1, In: Applied Sciences (Switzerland). 12, 1, 133.Research output: Contribution to journal › Article › peer-review Open Access Angular Momentum 100% Visual Simulation 100% Foaming Effect 100% Projective 100% Overlying Water 71% 3 Citations (Scopus) Accelerated Smoke Simulation by Super-Resolution with Deep Learning on Downscaled and Binarized SpaceHong, B. S., Zhang, Q., Kim, C. H., Lee, J. & Kim, J. H., 2021, In: IEEE Access. 9, p. 98615-98629 15 p., 9478850.Research output: Contribution to journal › Article › peer-review Open Access High-resolution 100% Downscaling 100% Binarization 100% Super-resolution 100% Deep Learning 100% 1 Citation (Scopus) View all 107 research outputs",
  "content_length": 3338,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:10"
}