{
  "name": "Changshui Zhang",
  "homepage": "http://bigeye.au.tsinghua.edu.cn/english/Introduction.html",
  "status": "success",
  "content": "ï»¿ Big eyes laboratory Bigeye Lab Homepage Concern ä¸­æ Homepage People Projects Publication Events Visit Album Personal circumstances Professor Zhang Changshui Dutyï¼ Professor, Dept of Automation, Tsinghua University; Associate Editor, Pattern Recognition ; Associate Editor, Jisuanji Xuebao; Member of the Standing Council, Chinese Association of Artificial Intelligence; Contactï¼ Emailï¼ zcs@mail.tsinghua.edu.cn Telï¼ (010)62782455 (010)62782447 Faxï¼ (010)62786911 Mailingï¼ Dept of Automation, Tsinghua University Addressï¼Beijing,100084ï¼China Experience Learning experienceï¼ July 1986 graduated from the Mathematics Department of Beijing University, BS. July 1992 graduated from the Department of Automation of Tsinghua University, Ph.D. Work experience: 1992,7-1994,12: the Department of Automation in Tsinghua University lecturer. 1995,1-2000,8: Department of Automation in Tsinghua University Associate Professor.. 2000,9 - now: Department of Automation in Tsinghua University Professor. Research interests The projects I have worked on and I am working on: Automated Fingerprint Identification System, Face Recognition, Biometrics, Thin File Circuit Automated Inspecting, Analysis of Reply Network in Bulletin Boards System, etc. Research topics Fingerprint identification, face recognition, biometric identification, detection of industrial circuit boards, BBS palindrome network analysis, the book during the excavation and analysis of the network Taught courses Undergraduate courses Subject Introduction Artificial Intelligence A required course for senior students in Dept.Automation. Postgraduate courses Pattern Recognition âPattern recognition focuses on the method of getting features in data and the analysis method of patterns.This course introduces fundamental concepts, theories and algorithms for pattern recognition which can be utilized in various fields to solve real problems. Topics include: Bayesian Decision Theory, Parametric and non-parametric Learning, EM and GMM, Linear Discrimination Function, Support Vector Machine, KL Transform, Fuzzy Clustering, Fusion of Classifiers, Hidden Markov Model, etc. Special Topics on Intelligent Technology This course introduces some most important theories in intelligent technology. Students are requied to read papers and complete some projects.The contents include: Principal Component Analysis, Kernel based PCA, Kernel Based Techniques, ISOMAP & LLE, Active Learning; Intelligent Optimization Technology: Genetic Algorithm, MCMC; Multi-Agent and Distributed AI: Bayesion Network, etc. Published Books 1.Artificial Neural Network And Computing On The Simulation Of Evolution,By YanPingfan,ZhangChangshui,Tsinghua University Press,2000,November(In Chinese) 2.Intelligent Infomation Processing And Intelligent Control, Coeditor,ZheJiang Science and Technology Press(In Chinese) 3. David Zhang,Automated Biometrics: Technologies and Systems, Kluwer Acdemic Publisher, USA, June,2000 Published Papers Papers Published recently (2002- ) List of Old Papers(1991-2001) Copyright © 2004. All Rights Reserved E-mail Toï¼ zcs@mail.tsinghua.edu.cnTelï¼86-010-62796872ãZip Codeï¼100084 Addressï¼Room 626C, Main building, Tsinghua University, Beijing, China. Latest updateï¼2008-08-08",
  "content_length": 3273,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:13"
}