{
  "name": "Changhyun Choi",
  "homepage": "https://choice.umn.edu/people",
  "status": "success",
  "content": "People | Choice Robotics Lab Skip to main content People Changhyun Choi (PI) CVPhone: +1-612-625-7870Email: Office: Keller Hall 5-157Mailing address: 5-157 Keller Hall, 200 Union St. SE, Minneapolis, MN 55455, USABio: Changhyun Choi is an Assistant Professor in the Department of Electrical and Computer Engineering at the University of Minnesota (UofM), Twin Cities. Before joining the UofM, he was a Postdoctoral Associate in the Computer Science & Artificial Intelligence Lab (CSAIL) at Massachusetts Institute of Technology (MIT) working with Prof. Daniela Rus. He obtained a Ph.D. in Robotics at the School of Interactive Computing, College of Computing, Georgia Institute of Technology. His broad research interests are in visual perception for robotic manipulation, with a focus on deep learning for object grasping and assembly manipulation, soft manipulation, object pose estimation, visual tracking, and active perception. He is the recipient of the NSF CAREER Award, Sony Research Award, Russell J. Penrose Excellence in Teaching Award, and ICRA 2022 Outstanding Student Paper Award.Ph.D. StudentsJiacheng Yuan, Ph.D. student in ECE (co-advised with Prof. Isler), Aug 2020 - presentAlireza Rezazadeh, Ph.D. student in ECE, Sep 2020 - presentHoujian Yu, Ph.D. student in ECE, Sep 2020 - presentRoss Worobel, Ph.D. student in CS&E , Sep 2022 - presentMingen Li, Ph.D. student in ECE, Sep 2022 - presentMaster StudentsChase Anderson, MS student in ECE, Sep 2022 - presentNikhilanj Venkata Pelluri, MS student in Robotics, Jan 2023 - presentUndergraduate Students AlumniSrujan Gowdru Lingaraju, MS student in Robotics, Feb 2022 - Dec 2023, now at Intl' Electronic Machines CorporationXibai Lou, Ph.D. student in ECE, Sep 2018 - May 2023, now at Amazon RoboticsRoss Worobel, Robotics MS, Nov 2020 - Aug 2022, now at CS&E Ph.D. studentEddie Sasagawa, Robotics MS, Feb 2021 - Jun 2022, now at Mine Vision SystemsYang Yang, Ph.D. student in CS&E, Apr 2019 - May 2022, now at Meta (Facebook)Benjamin Tyrrell, Undergraduate student in ECE (Senior Honor Thesis), Sep 2021 - May 2022, now at SpaceXSasha Hydrie, Undergraduate UROP students in CS&E, Jan 2022 - May 2022Song Liu, Ph.D. student in CS&E (co-advised with Prof. He), Oct 2020 - Dec 2021, now at GoogleAbhinav Mehta, MS student in CS&E, Sep 2019 - May 2021, now at NuroHengyue Liang, Ph.D. student in ECE, Sep 2018 - Jun 2020, now at UMNYuanhao Liu, MS student in ECENickhil Gupta, Undergraduate student (Independent Research) in ECE, Sep 2019 - May 2020Jeanine Thao, Undergraduate student in ECE (NorthStar STEM Alliance Summer Internship, UROP), Jun - Aug 2019, Jan - May 2020Stephen Mylabathula, Undergraduate student in ECE (UROP, Senior Honor Thesis), Sep - Dec 2018, Jan - May 2019, now at Facebook Oculus Home People Research Publications Teaching Contact Us",
  "content_length": 2824,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:12"
}