{
  "name": "Chang Lou",
  "homepage": "https://changlousys.github.io",
  "status": "success",
  "content": "About · Chang Lou Chang Lou Chang LouAssistant Professor, University of Virginia mail chlou [AT] virginia [DOT] edu Department of Computer ScienceUniversity of VirginiaRice Hall 304, 85 Engineer’s WayCharlottesville, VA 22904 We are hiring! Our lab has Ph.D. student positions starting from Fall 2026. If you are interested in building/hacking systems, we should talk. [Link] AboutI am a tenure-track assistant professor in Department of Computer Science at University of Virginia. My research centers on building robust and highly available systems. One major focus is to enhance the capabilities of distributed systems to detect, localize, and react to complex failures at runtime. I am also interested in solving reliability challenges in real-world systems from other domains, such as deep learning systems. Our ongoing research efforts focus on: runtime assurance via reasoning/enforcing system semantics/dynamics: [NSF abstract] synthesize runtime checkers to detect silent failures: [T2C, OSDI’25] a generative verification approach to prevent cloud regressions: [HotNets’25] formal verification techniques to uncover silent errors in ML models: [EuroMLSys’25] systematic anomaly mitigation in production cloud infrastructure: [AIOps’25] My earlier dissertation works include runtime solutions to handle: silent semantic violations: [OKLib, OSDI’22] memory leaks in production cloud infrastructure: [RESIN, OSDI’22] partial failures: [Watchdog, HotOS’19] [OmegaGen, NSDI’20 Best Paper Award] News 2025/10: Interviewed by NPR (Jaclyn Diaz) and ABC News Australia (James Glenday and Emma Rebellato) to discuss the global AWS outage and the future of resilient cloud infrastructures. ▸ screenshots 2025/9: Our position paper on preventing cloud regressions via inferred low-level semantics is accepted to appear at HotNets’25. Congrats Dimas! 2025/4: Congratulations to Zhenyu winning UVA CS Outstanding Graduate Teaching Award for his excellent service in CS4740 Cloud Computing! 2025/4: Our proposal on low-level semantics inference is awarded by Accelerating Foundation Models Research, big thanks to Microsoft and our collaborators! 2025/3: T2C is accepted by OSDI’25! 2025/2: Our workshop paper on Verifying Large ML Models has been accepted by EuroMLSys ‘25 (co-located with EuroSys 2025). Congrats to Kahfi and Wenbo, and many thanks to our AWS collaborators for their support. 2025/1: Will be serving on NSDI’26 Program Committee. 2024/12: Awarded NSF CAREER for my proposal “Low-Effort Runtime Assurance for Robust Cloud Systems”. Thank you NSF! 2024/12: Will present our position paper on host anomaly detection/mitigation (deployed at Microsoft Azure) at AIOps’25 (co-located with ICSE 2025). 2024/10: Congratulations to Tseganesh (Grace) for being selected to present her work at SOSP SRC, see you at Austin! 2024/10: Zhenyu, Dimas and Kahfi received SOSP travel grants. Thanks to sponsors for the generous support! 2024/10: Will be serving on SOSP’25 Program Committee. 2024/5: Co-organizing a SIGCOMM workshop on Formal Methods x Networked Systems. Welcome to submit your work! 2024/4: Received grants from 4-VA Collaborative Program. Thanks to 4-VA! 2024/3: Invited to give a talk at the University of Chicago System Seminar. 2024/3: Will be serving on NSDI’25 Program Committee. 2023/12: Gave a talk to student interns in Alibaba on graduate school advice. 2023/10: I’m honored that my Ph.D. thesis titled “Enhancing Cloud System Runtime to Address Complex Failures” has been recognized with an Honorable Mention for ACM SIGOPS Dennis M. Ritchie Doctoral Dissertation Award. A heartfelt thank you to Ryan, the best Ph.D. advisor ever, as well as my wonderful collaborators Suman and Ding! 2023/10: Will be serving on EuroSys’25 Program Committee. 2023/10: Did a talk on 2023 UVA CS Research Symposium, Securing A Bad Career In Ph.D. Program, revealing three common pitfalls for junior Ph.D. students. (Chinese ver.) 2023/9: Will be teaching CS4740: Cloud Computing with a new syllabus in Spring 2024. UVA undergraduates: if you are interested in principles and concepts behind cloud systems, this course is for you. 2023/9: Received Google Cloud Computing Research Credits. Thank you Google! 2023/8: A new chapter at UVA started. PublicationsOnce Bitten, Still Shy: Can We Prevent Cloud Systems from Repeating Their Mistakes?Dimas Shidqi Parikesit, Chang LouHotNets’25 [ bib, slides ] Deriving Semantic Checkers from Tests to Detect Silent Failures in Production Distributed SystemsChang Lou, Dimas Shidqi Parikesit, Yujin Huang, Zhewen Yang, Senapati Diwangkara, Yuzhuo Jing, Achmad Imam Kistijantoro, Ding Yuan, Suman Nath, Peng HuangOSDI’25 [ bib, slides, code, talk ] Verifying Semantic Equivalence of Large Models with Equality SaturationKahfi S. Zulkifli*, Wenbo Qian* (co-first author), Shaowei Zhu, Yuan Zhou, Zhen Zhang, Chang LouEuroMLSys Workshop (co-located with EuroSys’25) [ bib, slides ] Orchestrating Cross-Layer Anomaly Detection and Mitigation to Address Gray Failures in Large-Scale Cloud InfrastructureZe Li, Chang Lou, Vignatha Yenugutala, Vivek Ramamurthy, Eion Blanchard, Minghua Ma, Murali Chintalapati.AIOps Workshop (co-located with ICSE’25) Enhancing Cloud System Runtime to Address Complex FailuresChang LouPh.D. Dissertation (2023) ACM Dennis M. Ritchie Dissertation Award (Honorable Mention) Demystifying and Checking Silent Semantic Violations in Large Distributed SystemsChang Lou, Yuzhuo Jing, Peng Huang.OSDI’22 [ bib, slides, code, talk ] RESIN: A Holistic Service for Dealing with Memory Leaks in Production Cloud InfrastructureChang Lou, Cong Chen, Peng Huang, Yingnong Dang, Si Qin, Xinsheng Yang, Xukun Li, Qingwei Lin, Murali Chintalapati.OSDI’22 Deployed on Microsoft Azure [ bib, slides, talk, blog ] Understanding, Detecting and Localizing Partial Failures in Large System SoftwareChang Lou, Peng Huang, Scott Smith.NSDI’20 Best Paper Award [ bib, slides, talk ](A TL;DR version from Morning Paper) Comprehensive and Efficient Runtime Checking in System Software through WatchdogsChang Lou, Peng Huang, Scott Smith.HotOS’19 [ bib, slides ] Fast and Concurrent Distributed RDF Queries using RDMA-assisted GPU Graph ExplorationSiyuan Wang, Chang Lou, Rong Chen, Haibo Chen.USENIX ATC’18 [ bib, slides, code, poster ] StudentsI am very fortunate to work with these students: Zhenyu Li, Ph.D. student, 2024 - now Dimas Shidqi Parikesit, Ph.D. student, 2024 - now Kahfi Soobhan Zulkifli, Ph.D. student, 2024 - now Angting Cai, Master student, 2025 - now Wenbo Qian, Master student, 2024 - now Tseganesh Beyene Kebede, Master student, 2024 - now Praggnya Kanungo, Undergraduate student, 2024 - now Yichi Zhang, Undergraduate student, 2024 Yujin Huang, Undergraduate student, 2023 - 2024 Teaching CS4740: Cloud Computing, Fall 2025, University of Virginia CS6501: Cloud System Reliability, Fall 2024, University of Virginia CS4740: Cloud Computing, Spring 2024, University of Virginia [course eval] CS6501: Cloud System Reliability, Fall 2023, University of Virginia [course eval] LiftLab Reading Group Academic ServiceProgram Committee 2026: NSDI 2025: SOSP, NSDI, EuroSys, APSys, SIGCOMM FMANO 2024: ATC, SIGCOMM FMANO Misc. Reviewer: ACM TOCS, IEEE TMC, ACM TOPS, IEEE TCC Shadow PC: EuroSys’23 AEC: EuroSys’23 Web Chair: HAOC’21 (in conjunction with EuroSys’21) Work Experience Data Scientist Intern (part-time), Microsoft Azure, Nov 2021 - Jan 2022 Data Scientist Intern, Microsoft Azure, Jun 2021 - Aug 2021 Data Scientist Intern, Microsoft Azure, Jun 2020 - Sept 2020 Research Intern, Microsoft Research Asia, Oct 2015 - Jun 2016 Misc. My favorite proverb is “The unexamined life is not worth living“ from Socrates. A related comics. I like to spend my leisure time reading or playing sports (mostly basketball). I play guitar sometimes [Bob Dylan, The Beatles, Eva Cassidy]. My first name is Chang (畅). This sometimes causes confusion since Chang is also a common last name. BioI received my Ph.D. from Johns Hopkins University in May 2023, advised by Prof. Ryan (Peng) Huang. I obtained my B.S. degree in Computer Science from Shanghai Jiao Tong University in June 2016 and spent one gap year at IPADS working with Prof. Haibo Chen and Prof. Rong Chen.",
  "content_length": 8217,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:07"
}