{
  "name": "Chang-Tsun Li",
  "homepage": "https://warwick.ac.uk/fac/sci/dcs/people/chang-tsun_li",
  "status": "success",
  "content": "Chang-Tsun Li Skip to main content Skip to navigation Professor, FBCS, Marie Curie Fellow Room CS228 Department of Computer Science University of Warwick Gibbet Hill Road Coventry CV4 7AL UK Tel: +44 (0) 24 7657 3794 C-T.Li@warwick.ac.uk RESEARCH INTERESTS Data Analytics, Multimedia Forensics & Security, Biometrics, Computer Vision, Image Processing, Machine Learning, Data Mining, Pattern Recognition, Content-Based Image Retrieval, Bioinformatics BIOGRAPHY Chang-Tsun Li received the BEng degree in electrical engineering from National Defence University (NDU), Taiwan, in 1987, the MSc degree in computer science from U.S. Naval Postgraduate School, USA, in 1992, and the PhD degree in computer science from the University of Warwick, UK, in 1998. He was an associate professor of the Department of Electrical Engineering at NDU during 1998-2002 and a visiting professor of the Department of Computer Science at U.S. Naval Postgraduate School in the second half of 2001. He is currently a professor of the Department of Computer Science at the University of Warwick, UK. His research interests include multimedia forensics and security, biometrics, data mining, machine learning, data analytics, computer vision, image processing, pattern recognition, bioinformatics, and content-based image retrieval. He is currently Associate Editor of IEEE Access, the EURASIP Journal of Image and Video Processing (JIVP) and IET Biometrics. He has involved in the organisation of a number of international conferences and workshops and also served as member of the international program committees for several international conferences. He was the Coordinator and PI of the international joint project entitled Digital Image and Video Forensics (acronym: DIVEFOR) funded through the Marie Curie Action under the EU's Seventh Framework Programme (FP7) from June 2010 to May 2014. RESEARCH GROUP Signal and Image Processing Digital Forensics Lab Multimedia Processing and Computer Vision Lab Major Recent Projects Computer Vision Enabled Multimedia Forensics and people Identification (IDENTITY): funded EU Horizon 2020 - Marie Skłodowska-Curie Actions - Research and Innovation Staff Exchange (RISE) Jan 2016 - Dec 2019 Academic Centre of Excellence in Cyber Security Research - University of Warwick: funded by Engineering and Physical Sciences Research Council (EPSRC UK), Project ID: EP/R007195/, July /2017 – June 2022 MIUSS: Machine Intelligence in Urban Security Systems: funded by EPSRC Institutional Award (Global Challenges Research Fund (GCRF); 01 June 2016 to March 2017 Integrating Biometrics and Forensics for the Digital Age (COST Action IC1106): funded by European Cooperation in Science and Technology (COST), March 2012 - May 2016 Non-intrusive Multimedia Authentication and Integrity Verification (EPSRC Industrial CASE Award): funded by EPSRC & Forensic Pathways Ltd, Feb 2012 - July 2015 Digital Image and Video Forensics (DIVEFOR): funded by EU Seventh Framework Programme: FP7 Marie Curie Actions: Industry-Academia Partnerships and Pathways (IAPP), June 2010 - March 2014 Milamber Digital: funded by Technology Strategy Board (Innovate UK), January 2012 - December 2013 SELECTED PUBLICATIONS R. Leyva, V. Sanchez and C.-T. Li, \"Compact and Low-complexity Binary Feature Descriptor and Fisher Vector for Video Analytics,\" IEEE Transactions on Image Processing, vol. 28, no. 12, pp. 6169-6184, Dec. 2019 R. Rouhi, F. Bertini, D. Montesi, X. Lin, Y. Quan, C.-T. Li, \"Hybrid Clustering of Shared Images on Social Networks for Digital Forensics\", IEEE Access, 2019 C.-C. Chang, C.-T. Li and K. Chen, \"Privacy-Preserving Reversible Information Hiding Based on Square Roots of Quadratic Residues,” IEEE Access, 2019 I. Amerini, C.-T. Li, R. Caldelli, \"Social Network Identification through Image Classification with CNN\", IEEE Access, 2019 (DOI: 10.1109/ACCESS.2019.2903876) C.-C. Chang, C.-T. Li and Y. Shi, “Privacy-Aware Reversible Watermarking in Cloud Computing Environments,” IEEE Access, 2018 (DOI: 10.1109/ACCESS.2018.2880904) R. Li, C.-T. Li and Y. Guan \"Inference of a Compact Representation of Sensor Fingerprint for Source Camera Identification,\" Pattern Recognition, vol. 74, no. 2, pp. 556 -567, 2018 X. Guan, C.-T. Li, and Y. Guan, \"Matrix Factorization with Rating Completion: an Enhanced SVD Model for Collaborative Filtering Recommender Systems,” IEEE Access, vol. 5, pp. 27668 – 27678, Nov 2017 R. Leyva, V. Sanchez and C.-T. Li, \"Video Anomaly Detection With Compact Feature Sets for Online Performance,\" IEEE Transactions on Image Processing, vol. 26, no. 7, pp. 3463 – 3478, July 2017 A Khadidos, V. Sanchez, and C-T Li, “Weighted Level Set Evolution Based on Local Edge Features for Medical Image Segmentation,” IEEE Transactions on Image Processing, vol. 26, no. 4, pp. 1979 - 1991, April 2017 X. Lin and C.-T. Li, \"Large-Scale Image Clustering based on Camera Fingerprint,” IEEE Transactions on Information Forensics and Security, vol. 12, no. 4, pp. 793-1808, April 2017 F. Azhar and C.-T. Li, \"Hierarchical Relaxed Partitioning System for Activity Recognition,\" IEEE Transactions on Cybernetics, vol. 47, no. 3, pp. 784 - 795, March 2017 X. Lin and C.-T. Li, \"Preprocessing Reference Sensor Pattern Noise via Spectrum Equalization,\" IEEE Transactions on Information Forensics and Security, vol. 11, no. 1, pp. 126-140, Jan 2016 Y Guan, C.-T. Li and F. Roli, \"On Reducing the Effect of Covariate Factors in Gait Recognition: a Classifier Ensemble Method,\" IEEE Transactions on Pattern Analysis and Machine Intelligence, vol. 37, no. 7, pp 1521 - 1528, July 2015 Paper, Supplement X. Wei, C.-T. Li, Z. Lei, D. Yi and S. Z. Li, \"Dynamic Image-to-Class Warping for Occluded Face Recognition,\" IEEE Transactions on Information Forensics and Security, vol. 9, no. 12, pp. 2035-2050, Dec 2014 C.-T. Li and Y. Li, \"Color-Decoupled Photo Response Non-Uniformity for Digital Image Forensics,\" IEEE Transactions on Circuits and Systems for Video Technology, vol. 22, no. 2, pp. 260-271, Feb 2012 Y. Yuan , C.-T. Li, O. Windram, \"Directed Partial Correlation: Inferring Large-Scale Gene Regulatory Network through Induced Topology Disruptions\" PLoS ONE, vol. 6, no. 4, e16835, 2011 C.-T. Li, \"Source Camera Identification Using Enhanced Sensor Pattern Noise,\" IEEE Transactions on Information Forensics and Security, vol. 5, no. 2, pp. 280 - 287, June 2010 R. Krishna, C.-T Li and V. Buchanan-Wollaston, \"A Temporal Precedence Based Clustering Method for Gene Expression Microarray Data,\" BMC Bioinformatics 2010, 11:68 Y. Yang, X.Sun, H. Yang, C.-T. Li and R. Xiao, \"A Contrast-Sensitive Reversible Visible Image Watermarking Technique,\" IEEE Transactions on Circuits and Systems for Video Technology,vol. 19, no. 5, pp. 656 - 667, May 2009 C.-H. Wei, Y. Li, W. Y. Chau, and C.-T. Li, \"Trademark Image Retrieval Using Synthetic Features for Describing Global Shape and Interior Structure,\" Pattern Recognition, vol. 42, no. 3, pp. 386-394, 2009 C.-T. Li, Y. Yuan, and R. Wilson, \"An Unsupervised Conditional Random Fields Approach for Clustering Gene Expression Time Series,\" Bioinformatics, vol. 24, no. 21, pp. 2467-2473, August 2008 (doi: 10.1093/bioinformatics/btn375) Y. Yuan, C.-T. Li and R. Wilson, \"Partial Mixture Model for Gene Expression Tight Clustering,\" BMC Bioinformatics, 2008, 9:287. (doi:10.1186/1471-2105-9-287) R. Wilson and C.-T. Li, \"A Class of Discrete Multiresolution Random Fields and its Application to Image Segmentation,\" IEEE Transactions on Pattern Analysis and Machine Intelligence, vol. 25, no. 1, pp. 42-56, 2003 Teaching Research Publication Patents Professional Activities Digital Forensics Lab Multimedia Processing and Computer Vision Lab Let us know you agree to cookies We use cookies to give you the best online experience. Please let us know if you agree to functional, advertising and performance cookies. You can update your cookie preferences at any time. Cookie policy Essential cookies Functional cookies Advertising cookies Performance cookies Accept all Remember my preference More information",
  "content_length": 8065,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:09"
}