{
  "name": "Chao Li 0009",
  "homepage": "http://www.cs.sjtu.edu.cn/~lichao",
  "status": "success",
  "content": "Chao Li - Professor - SJTU Dr. Chao Li ProfessorSchool of Computer Science Shanghai Jiao Tong University (SJTU) Home CV ä¸­æ About Me Research Services Teaching Students Publications Laboratory Hello & Welcome ! I am a Full Professor in the School of Computer Science, Shanghai Jiao Tong University (SJTU). At SJTU, I'm a proud member of Emerging Parallel Computing Center (EPCC) and I direct Sustainable Architecture and Intelligence Lab (SAIL). Prior to joining SJTU, I earned my PhD degree from the University of Florida and my BS degree from Zhejiang University (with honors). Research Interests My primary research area is system SW/HW architecture design with an emphasis on energy-efficient, high-performance computers of extreme scales. I devise innovative cross-layer approaches to improve the scalability, sustainability, and manageability of today's computing infrastructure. My broader interests also include evolving applications, emerging technologies, and transformative tools that could ultimately shape the next-generation intelligent computing paradigms. Selected Honors ISCA Hall of Fame, International Symposium on Computer Architecture, 2025 CCF-IEEE CS Young Computer Scientist Award, CCF, 2024 CCF TCDCP Young Innovation Pioneer Award, CCF TCDCP, 2023 Sun Yong Qiang Young Professorship, SJTU CSE Department, 2021 Excellent Young Scientists Fund, NSFC, 2021 Shanghai Rising-Star Program Award, Shanghai Science and Technology Committee, 2021 CCF Distinguished Speaker, China Computer Federation, 2020 Outstanding Young Professional Award, Shanghai Jiao Tong University, 2020 IEEE TCSC Award for Excellence in Scalable Computing (Early Career), IEEE TCSC, 2018 CCF Young Elite Scientists Sponsorship Plan, China Computer Federation, 2017 MSRA \"StarTrack\" Visiting Young Faculty Program, Microsoft Research Asia, 2017 CCF-Intel Young Faculty Researcher Program Award, China Computer Federation and Intel, 2016 Chinese Government Award for Outstanding Student Studying Abroad, CSC, 2014 Facebook Fellowship, Facebook Inc , 2013 Yahoo! Key Scientific Challenges Program Award, Yahoo! Inc , 2012 A.M. Turing Centenary Celebration Student Scholarship, ACM SIGARCH, 2012 Attributes of a Gator Engineer Recognition Award, University of Florida , 2010 Graduate Alumni Fellowship, University of Florida , 2009 Chu Kochen Certificate of Honors, Zhejiang University, 2009 Paper Highlights Best Paper Nominee, IEEE ICCD, 2024 Best Paper Nominee, IEEE/ACM ISCA, 2024 Best Paper Honorable Mention, IEEE/ACM IWQoS, 2024 Best Paper Nominee, Euro-Par, 2023 Best Paper Runner-Up, ACM/SPEC ICPE, 2022 Spotlight on Transactions (March Issue), Computer, 2020 IEEE TC Featured Paper (July Issue), IEEE Transactions on Computers, 2019 Best Paper Award, IEEE ICCD, 2018 Best of Computer Architecture Letters, IEEE Computer Architecture Letters, 2015 Best Paper Award, IEEE HPCA, 2011 © Chao Li, last updated: 2025/08/25",
  "content_length": 2919,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:16"
}