{
  "name": "Chao Li 0023",
  "homepage": "http://www.lichao.work",
  "status": "success",
  "content": "Chao Li @ Beijing Jiaotong University Chao LiPh.D., Associate Professor, School of Computer and Information Technology, Beijing Jiaotong University. Follow Beijing, China Email ResearchGate Google Scholar PublonsI am an Associate Professor in the School of Computer and Information Technology at Beijing Jiaotong University. My current research interests are focused on Blockchain and Data Privacy. I received my MSc degree from Imperial College London and my Ph.D. degree in Information Science from University of Pittsburgh.—>[My Chinese Homepage]<——>[My CV]<—Publications[TSC] Chao Li and Balaji Palanisamy. “T-Watch: Towards Timed Execution of Private Transaction in Blockchains.” IEEE Transactions on Services Computing, accepted, 2024. [PDF][TDSC] Guorong Chen, Chao Li, Wei Wang, Li Duan, Bin Wang, Zhen Han and Xiangliang Zhang. “FairReward: Towards Fair Reward Distribution using Equity Theory in Blockchain-based Federated Learning.” IEEE Transactions on Dependable and Secure Computing, accepted, 2024.[TDSC] Xiangrui Xu, Wei Wang, Zheng Chen, Bin Wang, Chao Li, Li Duan, Zhen Han, and Yufei Han. “Finding the PISTE: Towards Understanding Privacy Leaks in Vertical Federated Learning Systems.” IEEE Transactions on Dependable and Secure Computing, accepted, 2024.[ICDCS’24] Jingzhe Wang, Haocheng Wang, Chao Li and Balaji Palanisamy. “Timed Data Release using Smart Contracts.” Proc. of 44th IEEE International Conference on Distributed Computing Systems, Ney Jersey, USA. [Received Best Demo Award][TWEB] Chao Li, Runhua Xu, Balaji Palanisamy, Li Duan, Meng Shen, Jiqiang Liu and Wei Wang, “Blockchain Takeovers in Web 3.0: An Empirical Study on the TRON-Steem Incident.” ACM Transactions on the Web, accepted, 2024.[TDSC] Runhua Xu, Bo Li, Chao Li, James Joshi, Shuai Ma, Tyler Zhou, Jin Dong and Jianxin Li. “TAPFed: Threshold Secure Aggregation for Privacy-Preserving Federated Learning.” IEEE Transactions on Dependable and Secure Computing, 2024. [PDF][CCS’23] Chao Li, Balaji Palanisamy, Runhua Xu, Li Duan, Jiqiang Liu, Wei Wang. “How Hard is Takeover in DPoS Blockchains? Understanding the Security of Coin-based Voting Governance.” ACM SIGSAC Conference on Computer and Communications Security, Copenhagen, Denmark. [PDF][SLIDES] [Received Distinguished Paper Award][TDSC] Runhua Xu, Chao Li and James Joshi. “Blockchain-based Transparency Framework for Privacy Preserving Third-party Services.” IEEE Transactions on Dependable and Secure Computing, 20 (3), 2302-2313, 2023. [PDF][BSCI’23] Chao Li, Runhua Xu, and Li Duan. “Liquid democracy in DPoS blockchains.” In Proceedings of the 5th ACM International Symposium on Blockchain and Secure Critical Infrastructure, Melbourne, Australia. [PDF][ICWSM’23] Chao Li, Runhua Xu, and Li Duan. “Characterizing Coin-Based Voting Governance in DPoS Blockchains.” In Proceedings of the International AAAI Conference on Web and Social Media, Limassol, Cyprus. [PDF][ICBC’23] Jingyu Liu, Lu Liu, Zijing Li, and Chao Li. “DeMonitor: Monitoring Decentralization in Blockchains using BigQuery.” In 2023 IEEE International Conference on Blockchain and Cryptocurrency, Dubai, United Arab Emirates.[BigDataSec’23] Chao Li, Balaji Palanisamy, Runhua Xu, and Li Duan. “Cross-Consensus Measurement of Individual-level Decentralization in Blockchains.” In 2023 IEEE 9th Intl Conference on Big Data Security on Cloud, New York, USA. [PDF][BigDataSec’23] Rui Sun, Chao Li, Jingyu Liu, and Xingchen Sun. “Exploring Downvoting in Blockchain-based Online Social Media Platforms.” In 2023 IEEE 9th Intl Conference on Big Data Security on Cloud, New York, USA.[TSC] Chao Li and Balaji Palanisamy. “SilentDelivery: Practical Timed-delivery of Private Information using Smart Contracts.” IEEE Transactions on Services Computing, 15 (6), 3528-3540, 2022. [PDF][TDSC] Runhua Xu, James B.D. Joshi and Chao Li. “NN-EMD: Efficiently Training Neural Networks using Encrypted Multi-sourced Datasets.” IEEE Transactions on Dependable and Secure Computing, 19 (4), 2807-2820, 2022. [PDF][APPENDIX][HPCC’22] Yufang Wu, Guorong Chen, Yuhao Liu, Chao Li , Mingqing Hu, and Wei Wang. “TBFL: A Trusted Blockchain-based Federated Learning System.” In 2022 IEEE 24th Int Conf on High Performance Computing & Communications, Chengdu, China.[ICDEW’21] Qinwei Lin, Chao Li, Xifeng Zhao and Xianhai Chen. “Measuring Decentralization in Bitcoin and Ethereum using Multiple Metrics and Granularities.” In 2021 IEEE 37th International Conference on Data Engineering Workshops (ICDEW). [PDF][CODASPY’21] Chao Li, Balaji Palanisamy, Runhua Xu, Jinlai Xu and Jingzhe Wang. “SteemOps: Extracting and Analyzing Key Operations in Steemit Blockchain-based Social Media Platform.” Proc. of 11th ACM Conference on Data and Application Security and Privacy, Virtual Event, USA. [PDF][DATASET][SRDS’20] Chao Li, Balaji Palanisamy, Runhua Xu, Jian Wang and Jiqiang Liu. “NF-Crowd: Nearly-free Blockchain-based Crowdsourcing.” Proc. of 39th IEEE International Symposium on Reliable Distributed Systems, Shanghai, China. [PDF][ICWS’20] Chao Li and Balaji Palanisamy. “EventWarden: A Decentralized Event-driven Proxy Service for Outsourcing Arbitrary Transactions in Ethereum-like Blockchains.” Proc. of 27rd IEEE International Conference on Web Services, Beijing, China. [PDF][ICBC’20] Chao Li and Balaji Palanisamy. “Comparison of Decentralization in DPoS and PoW Blockchains.” Proc. of 2020 International Conference on Blockchain, Honolulu, Hawaii, USA. [PDF][DATASET][CIC’19] Balaji Palanisamy and Chao Li. “Self-emerging Data Infrastructures.” Proc. of 5th IEEE International Conference on Collaboration and Internet Computing, Los Angeles, California, USA. [PDF][ICDCS’19] Runhua Xu, James BD Joshi, and Chao Li. “CryptoNN: Training Neural Networks over Encrypted Data.” Proc. of 39th IEEE International Conference on Distributed Computing Systems, Dallas, Texas, USA. [PDF][WebSci’19] Chao Li and Balaji Palanisamy. “Incentivized Blockchain-based Social Media Platforms: A Case Study of Steemit.” Proc. of 11th ACM International Web Science Conference, Boston, MA, USA. [PDF][DATASET][BlockDM’19] Chao Li, Balaji Palanisamy and Runhua Xu. “Scalable and Privacy-preserving Design of On/Off-chain Smart Contracts.” Proc. of 1st International Workshop on Blockchain and Data Management, in Conjunction with ICDE 2019. [PDF][ComCom] Chao Li and Balaji Palanisamy. “Reversible spatio-temporal perturbation for protecting location privacy.” Elsevier Computer Communications 135, 16-27, 2019. [PDF][IoTJ] Chao Li and Balaji Palanisamy. “Privacy in Internet of Things: from Principles to Technologies.” IEEE Internet of Things Journal 6 (1), 488-505, 2018. [PDF][HiPC’18] Chao Li and Balaji Palanisamy. “Decentralized Privacy-preserving Timed Execution in Blockchain-based Smart Contract Platforms.” Proc. of 25th IEEE International Conference on High Performance Computing, Data, and Analytics, Bengaluru, India. [PDF][SRDS’18] Chao Li and Balaji Palanisamy. “Decentralized release of self-emerging data using smart contracts.” Proc. of 37th IEEE International Symposium on Reliable Distributed Systems, Salvador, Brazil. [PDF][COSE] Lei Jin, Chao Li, Balaji Palanisamy and James Joshi. “k-Trustee: Location injection attack-resilient anonymization for location privacy.” Elsevier Computers & Security 78, 212-230, 2018. [PDF][BigData Congress’18] Chao Li, Balaji Palanisamy and Prashant Krishnamurthy. “Reversible Data Perturbation Techniques for Multi-level Privacy-preserving Data Publication.” Proc. of 7th International Congress on Big Data, Seattle, USA. [PDF][Received Best Paper Award][Big Data’17] Balaji Palanisamy, Chao Li and Prashant Krishnamurthy, “Group Privacy-aware Disclosure of Association Graph Data.” Proc. of 5th IEEE International Conference on Big Data, Boston, USA. [PDF][Cloud’17] Chao Li and Balaji Palanisamy, “Emerge: Self-emerging Data Release using Cloud Data Storage.” Proc. of 10th IEEE International Conference on Cloud Computing, Honolulu, USA. [PDF][BigData Congress’17] Chao Li, Balaji Palanisamy and James Joshi, “Differentially Private Trajectory Analysis for Points-of-Interest Recommendation.” Proc. of 6th IEEE International Congress on Big Data, Honolulu, USA. [PDF][Received Best Paper Award][ICDCS’17] Chao Li and Balaji Palanisamy, “Timed-release of Self-emerging Data using Distributed Hash Tables.” Proc. of 37th IEEE International Conference on Distributed Computing Systems, Atlanta, USA. [PDF][ICDCS’17, Demo] Chao Li, Balaji Palanisamy, Aravind A. Kalaivanan and Sriram Raghunathan, “ReverseCloak: A Reversible Multi-level Location Privacy Protection System.” Proc. of 37th IEEE International Conference on Distributed Computing Systems, Atlanta, USA. [PDF][ICDCS’17, Poster] Balaji Palanisamy, Chao Li and Prashant Krishnamurthy, “Group Differential Privacy-preserving Disclosure of Multi-level Association Graphs.” Proc. of 37th IEEE International Conference on Distributed Computing Systems, Atlanta, USA. [PDF][ICWS’16] Chao Li, Balaji Palanisamy and James Joshi, “SocialMix: Supporting Privacy-aware Trusted Social Networking Services.” Proc. of 23rd IEEE International Conference on Web Services, San Francisco, USA. [PDF][NSS’15] Chao Li and Balaji Palanisamy, “De-anonymizable Location Cloaking for Privacy-controlled Mobile Systems.” Proc. of 9th International Conference on Network and System Security, New York, USA. [PDF][CIKM’15] Chao Li and Balaji Palanisamy, “ReverseCloak: Protecting Multi-level Location Privacy over Road Networks.” Proc. of 24th ACM International Conference on Information and Knowledge Management, Melbourne, Australia. [PDF]",
  "content_length": 9616,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:17"
}