{
  "name": "Chao Chen 0012",
  "homepage": "http://chaochen.github.io",
  "status": "success",
  "content": "Chao Chen Home Research Publications Group Teaching Chao Chen Associate Professor Department of Biomedical Informatics Also affiliated with Computer Science and Applied Mathematics & Statistics Stony Brook University Stony Brook, NY 11794-8322 Contact Office: Computer Science Building, 2313C Tel: +1-631-632-2593 Email: chao.chen.1 (@) stonybrook.edu Research Interests I develop robust and trustworthy learning methods for modern biomedical data and beyond. My research draws from the following different domains. Robust and Trustworthy Machine Learning: backdoor attacks, adversarial attacks, label noise, uncertainty. Biomedical informatics: digital pathology, multi-omics data analytics, spatial and topological analysis of tissue micorenvionment. Topological data analysis: learning with topological features, topology-informed image segmentation and analysis. For more information, please see the Research Webpage. Past Experience Assistant Professor of Computer Science, City University of New York (CUNY), United States Postdoc at Rutgers University, United States (advised by Prof. Dimitris Metaxas) Postdoc at Institute of Science and Technology, Austria (advised by Prof. Herbert Edelsbrunner) Ph.D. at Rensselaer Polytechnic Institute, United States (advised by Prof. Daniel Freedman) B.S. at Peking University, China Awards 2022, NSF CAREER Award Topology-Driven Learning for Biomedical Imaging Informatics More details can be found at the department news! 2023, Stony Brook Trustees Faculty Awards (Story) Recent Services Associate Editor, Pattern Recognition Action Editor, TMLR Area Chair, ICML 2023-2025 Area Chair, CVPR 2025,2026 Area Chair, NeurIPS 2021-2025 News and Annoucement New!! One paper accepted by NeurIPS. Congratulations to Meilong for getting his paper accepted by NeurIPS'25! The paper tackles topology-preserving segmentation in a semi-supervised setting for digital pathology, introducing fine-grained modeling of coherency measuare of topological structures to help model learn topological invariance effectively. New!! One paper accepted by IEEE JBHI. Congratulations to Jiaqi for getting her paper accepted by IEEE Journal of Biomedical and Health Informatics (JBHI). The paper tackles leason segmentation of OCT images incorporating textual description in a domain-agnostic manner. New!! One paper accepted by TMI. Congratulations to Shahira for getting her paper accepted by the top medical imaging journal: IEEE Transactions on Medical Imaging! The paper tackles the task of effective cell detection and segmentation in multiplex IHC images, enabling spatial analysis of tumor microenvionment. New!! One paper accepted by TopoInVis. Congratulations to Nancy for getting her paper accepted by the TopoInVis! We extend previous work on topological uncertainty to time-varying data. This enables reasoning about strutual uncertainty and can be of big impact to scientific visualization. New!! Two papers accepted by CVPR 2025! Congratulations to Meilong and Ani for getting their papers accepted by the top CV conference CVPR. Meilong's paper proposes the first topology-aware diffusion model for cell layout generation. Ani's paper proposes a novel gene prediction method based on spatial transcriptomics data, using a multi-faceted graph GNN that is well motivated by the biology. New!! Three papers accepted by ICLR 2025! Congratulations to Saumya, Weimin, and Chris for getting their papers accepted by the top ML conference ICLR. Saumya's paper proposes the first topology-aware diffusion network, generating images with explicit topological constraints (thus correct object counts and correct holes). Weimin's paper tackles backdoor attack problem for vision-language models, especially for out-of-distribution data. Chris' paper studies the geometry of long-tail data representation, and proposes a new solution via feature generation. New!! One paper accepted to JMLR! Congratulations to Zuoyu for his paper being accepted by the top ML journal JMLR. Zuoyu's paper discusses in details the theoretical foundation and applicaiton benefit of incoporating topological features (i.e., persistent homology) into graph neural networks. New!! One paper accepted to MeDIA! Congratulations to Fan and Zhilin for their paper being accepted by the top medical imaging journal MeDIA. Their paper Proposes TopoTxR, a topology-guided deep neural network for breat tissue analysis from DEC-MRIs. Page generated by jemdoc.",
  "content_length": 4453,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:16"
}