{
  "name": "Chao Xu 0002",
  "homepage": "https://chaoxuprime.com",
  "status": "success",
  "content": "Chao Xu Chao Xu | 许 超 I'm an Assosiate Professor at UESTC, a member of the Algorithms and Logic Group. My research interests are algorithms, combinatorial optimization and computational geometry. I'm also interested in more applied problems with nice theoretical components. Here is my CV. I maintain a github account, a blog and a Mastodon @chao. I frequent cstheory. Here is the list of all who have worked in my group. You can contact me through email [email protected]. 中文博客 前沿算法课程 Selected PublicationsSee all publications. Conference Publications description airplay An Optimal Algorithm for the Stacker Crane Problem on Fixed Topologies Yike Chen Ke Shi Chao Xu ISAAC 2025 The Stacker Crane Problem (SCP) is a variant of the Traveling Salesman Problem. In SCP, pairs of pickup and delivery points are designated on a graph, and a crane must visit these points to move objects from each pickup location to its respective delivery point. The goal is to minimize the total distance traveled. SCP is known to be NP-hard, even on trees. The only positive results, in terms of polynomial-time solvability, apply to graphs that are topologically equivalent to a path or a cycle. We propose an algorithm that is optimal for each fixed topology, running in near-linear time. This is achieved by demonstrating that the problem is fixed-parameter tractable (FPT) when parameterized by both the cycle rank and the number of branch vertices. description airplay Efficient Branch-and-Bound for Submodular Function Maximization under Knapsack Constraint Yimin Hao Yi Zhou Chao Xu Zhang-Hua Fu ECAI 2025 The submodular knapsack problem (SKP), which seeks to maximize a submodular set function by selecting a subset of elements within a given budget, is an important discrete optimization problem. The majority of existing approaches to solving the SKP are approximation algorithms. However, in domains such as health-care facility location and risk management, the need for optimal solutions is still critical, necessitating the use of exact algorithms over approximation methods. In this paper, we present an optimal branch-and-bound approach, featuring a novel upper bound with a worst-case tightness guarantee and an efficient dual branching method to minimize repeat computations. Experiments in applications such as facility location, weighted coverage, influence maximization, and so on show that the algorithms that implement the new ideas are far more efficient than conventional methods. description airplay Large-Scale Trade-Off Curve Computation for Incentive Allocation with Cardinality and Matroid Constraints Yu Cong Chao Xu Yi Zhou IJCAI 2025 We consider a large-scale incentive allocation problem where the entire trade-off curve between budget and profit has to be maintained approximately at all time. The application originally comes from assigning coupons to users of the ride-sharing apps, where each user can have a limit on the number of coupons been assigned. We consider a more general form, where the coupons for each user forms a matroid, and the coupon assigned to each user must be an independent set. We show the entire trade-off curve can be maintained approximately in near real time. description airplay Almost optimum \\ell-covering of \\Z_n Ke Shi Chao Xu COCOON 2024 A subset B of the ring \\Z_n is referred to as a \\ell-covering set if \\{ ab \\pmod n \\mid 0\\leq a \\leq \\ell, b\\in B\\} = \\Z_n. We show that there exists a \\ell-covering set of \\Z_n of size O(\\frac{n}{\\ell}\\log n) for all n and \\ell, and how to construct such a set. We also provide examples where any \\ell-covering set must have a size of \\Omega(\\frac{n}{\\ell}\\frac{\\log n}{\\log \\log n}). The proof employs a refined bound for the relative totient function obtained through sieve theory and the existence of a large divisor with a linear divisor sum. The result can be used to simplify a modular subset sum algorithm. description airplay Resource-Limited Network Security Games with General Contagious Attacks Rufan Bai Chao Xu Chenyang Xu Ruilong Zhang COCOON 2024 In classic security games on the graph with contagious attacks, there is a defender and an attacker. The defender first distributes defending resources to the nodes of the graph, and each unit of defending resource incurs a cost. The attacker picks a node to attack to maximize the damage after the transmission of the attack. Generally, the attacker has two attack types—uniform attack and adaptive attack, where the uniform attacker attacks each node with uniform and the adaptive attacker can select one node to attack according to the defender’s strategy. The usual objective in the literature is to minimize the total loss of the defender, including the damage caused by the attacker and the paid cost. However, we notice that in many real-world applications, the defending resources are often limited, and the existing objective fails to capture these scenarios. The paper handles this issue by considering the resource-limited setting of the security game, where there is a given upper bound on the paid resource cost and the defender aims to minimize the caused damage without violating the resource cost constraint. We first discuss the hardness, proving that for both attack types, the problem is NP-hard on general graphs. Then, we focus on bounded treewidth graphs, a well-known graph class that includes many common graphs. We show that given any graph with bounded treewidth and any attack type, a dynamic programming algorithm always exists that solves the problem in polynomial time. Further, the algorithm can be easily extended to more general objective settings. The proposed algorithm is built on an interesting connection to a graph partition problem, which could be intrigued independently. description airplay Nested and Interlaced Ticketing for Multiple Travelers Dongyu Lv Yizhi Song Chao Xu IJTCS-FAW 2024 Nested ticketing represents a prevalent practice in airline bookings, employed to bypass certain airline ticketing regulations with the aim of reducing costs on multiple round-trip tickets. We consider the computational complexity of nested ticketing, and it is 'covert' version, which we call interleaved ticketing. Consider multiple agents living in different locations and a single client who demands that one agent be present each week. The objective for the company is to schedule these agents and arrange their flight itineraries to minimize the cost. We show that when nested ticketing is allowed, the problem is NP-hard when there are at least two agents. We also show there exists a polynomial-time algorithm if only interleaved ticketing is allowed, and the number of airlines is bounded. description airplay On the Congruency-Constrained Matroid Base Siyue Liu Chao Xu IPCO 2024 Consider a matroid where all elements are labeled with an element in \\mathbb{Z}. We are interested in finding a base where the sum of the labels is congruent to g \\pmod m. We show that this problem can be solved in \\tilde{O}(2^{4m} n r^{5/6}) time for a matroid with n elements and rank r, when m is either the product of two primes or a prime power. The algorithm can be generalized to all moduli and, in fact, to all abelian groups if a classic additive combinatorics conjecture by Schrijver and Seymour holds true. We also discuss the optimization version of the problem. description airplay Solving systems of linear equations through zero forcing sets Jianbo Wang Chao Xu Siyun Zhou COCOON 2023. Let \\mathbb{F} be any field, we consider solving Ax=b for a matrix A\\in\\mathbb{F}^{n\\times n} of m non-zero elements and b\\in\\mathbb{F}^{n}. If we are given a zero forcing set of A of size k, we can solve the linear equation in O(mk+k^\\omega) time, where \\omega is the matrix multiplication exponent. As an application, we show how the lights out game in an n\\times n grid is solved in O(n^3) time, and then improve the running time to O(n^\\omega\\log n) by exploiting the repeated structure in grids. description airplay A Polynomial Time Algorithm for Finding a Minimum 4-Partition of a Submodular Function Tsuyoshi Hirayama Yuhao Liu Kazuhisa Makino Ke Shi Chao Xu SODA 2023. In this paper, we study the minimum k-partition problem of submodular functions, i.e., given a finite set V and a submodular function f:2^V\\to \\R, computing a k-partition \\{ V_1, \\ldots, V_k \\} of V with minimum \\sum_{i=1}^k f(V_i). The problem is a natural generalization of the minimum k-cut problem in graphs and hypergraphs. It is known that the problem is NP-hard for general k, and solvable in polynomial time for k \\leq 3. In this paper, we construct the first polynomial-time algorithm for the minimum 4-partition problem. description airplay Linear TreeShap Peng Yu Chao Xu Albert Bifet Jesse Read NeurIPS 2022. Selected as Oral. Decision trees are well-known due to their ease of interpretability. To improve accuracy, we need to grow deep trees or ensembles of trees. These are hard to interpret, offsetting their original benefits. Shapley values have recently become a popular way to explain the predictions of tree-based machine learning models. It provides a linear weighting to features independent of the tree structure. The rise in popularity is mainly due to TreeShap, which solves a general exponential complexity problem in polynomial time. Following extensive adoption in the industry, more efficient algorithms are required. This paper presents a more efficient and straightforward algorithm: Linear TreeShap. Like TreeShap, Linear TreeShap is exact and requires the same amount of memory. description airplay Approximate Representation of Symmetric Submodular Functions via Hypergraph Cut Functions Calvin Beideman Karthekeyan Chandrasekaran Chandra Chekuri Chao Xu FSTTCS 2022. Submodular functions are fundamental to combinatorial optimization. Many interesting problems can be formulated as special cases of problems involving submodular functions. In this work, we consider the problem of approximating symmetric sub",
  "content_length": 44882,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:19"
}