{
  "name": "Chao Yang 0015",
  "homepage": "http://csee.hnu.edu.cn/people/yangchao",
  "status": "success",
  "content": "杨超-湖大信息科学与工程学院 教师登录 English 返回首页 学院概况 学院简介 学院领导 师资力量 机构设置 决策机构 教学单位 计算机科学系 软件工程系 通信工程系 信息工程系 计算机工程系 网络空间安全系 实验中心 基础教学部 研究机构 特色学院 条件装备 办事机构 人才培养 本科培养 研究生培养 博士生培养 留学生培养 学科专业方向 科学研究 科研项目 科研成果 成果转化 学术信息 工作流程 招生就业 本科招生 硕士招生 博士招生 学生就业 实习就业基地 学生工作 学生动态 学生党建 团学工作 日常管理 心理健康 奖励工作 社团组织 党群工作 党建工作 工会工作 关工委工作 学术资源 资源管理系统 精品课程 实验仪器设备 杨超 我的位置在： 首页 > 学院概况 > 师资力量 > 杨超 教师介绍 杨超，现为湖南大学信息科学与工程学院副教授、博士生导师，中国计算机学会杰出会员，中国计算机学会协同计算、计算机应用专委执委，中国人工智能学会智能信息网络专委委员，中国仿真学会人工社会专委委员，教育部学位与研究生教育评估专家，湖南省科技咨询与评审专家，曾任CCFYOCSEF2021-2022年度长沙学术委员会主席。本科、硕士均毕业于湖南大学计算机与通信学院，博士毕业于日本东京工业大学，曾获最优博士论文奖和秋山奖，后留校任博士后研究员。长期从事计算机和人工智能相关领域的研究，包括自然语言处理、计算机视觉、跨媒体分析与推理、多智能体系统等。长期专注于以AI技术如何更好服务于人类需求为导向，围绕情感智能、信息检索与推荐、图像内容理解与生成、对话系统、AIGC方面展开系统研究，研究成果可在智能AI助手、内容创作与生成、老年人/儿童辅助等众多领域应用。主持国家、湖南省自然科学基金和科技计划10余项，在AAAI、MM、ICCV、ECCV、COLING、ICMR、ICME、ICASSP、TMM、TOMM高水平会议和期刊发表研究论文近60篇。主持多项企业委托研发课题，授权中国发明专利11项。 中文名： 杨超 英文名： 学历： 博士 职称： 副教授 联系电话： 电子邮件： yangchaoedu at hnu.edu.cn 研究方向： 信息检索与推荐、跨媒体检索与分析、复杂多agent系统建模与仿真、数字图像内容理解与安全。 联系地址： 湖南省长沙市岳麓区麓山南路2号,湖南大学信息科学与工程学院（410082） 所属机构： 计算机科学系 学院教师 个人简历 杨超，副教授，博士生导师，本科、硕士均毕业于湖南大学计算机与通信学院计算机应用技术专业，2010年博士毕业于日本东京工业大学智能系统专业，获工学博士学位，同年4月开始博士后研究员工作。现为中国计算机学会协同计算专委执委、计算机应用专委执委，中国人工智能学会智能信息网络专委委员，中国仿真学会人工社会专委委员。长期以来一直专注以AI技术如何更好服务于人类需求为导向，围绕智能检索与推荐、多Agent建模与仿真及应用场景创新展开研究。近年来面向智能推荐、生命健康、生态文旅方面，加强与政府企业合作，2023-2025年与芒果TV智能算法部合作在人工智能顶会IJCAI推出用户未来价值预估、基于多样性的跨域推荐、大模型逻辑推理、影视语音多语种翻译赛，推动相关技术在智能视听推荐服务的场景创新与应用，通过对南洞庭湖生物多样性的数字资源建设，推动南洞庭特色生态文旅资源的提炼、创新与复用。 教育研究经历 2010/04 – 2014/03，东京工业大学，综合理工学院智能系统专业，外国人特别研究员2007/04– 2010/03，东京工业大学，综合理工学院智能系统专业，工学博士2002/09 – 2005/06，湖南大学，计算机与通信学院计算机科学系，工学硕士1995/09 – 1999/06，湖南大学，计算机系，工学学士 学术论文 2025[1] JianboZheng, Chao Yang(*), Tairui Zhang, Longbing Cao*, BinJiang, Xuhui Fan, Xiao-ming Wu, Xianxun Zhu. Dynamic Spectral Graph AnomalyDetection. The Thirty-Ninth AAAI Conference on Artificial Intelligence(AAAI-25). Philadelphia. February 25 to March 4, 2025 (人工智能顶会，CCF A).[2] Jianbo Zheng, Chao Yang(*),Tairui Zhang, Bin Jiang, XuhuiFan, Xiaoming Wu, Haidong Shao.PeriodicMFD:A Periodic-based Framework for Multi-source Fault Diagnosis. IEEE Transactions on Transportation Electrification, 2025.(中科院1区Top期刊)[3] Chenglong Lei, Chao Yang(*), Jianbo Zheng. Improving Open-Ended Referring Expression Comprehension via Dual-Language Constraints. The 2025 IEEE International Conference on Acoustics, Speech,and Signal Processing (ICASSP 2025). Hyderabad, April 06 to April 11, 2025. （语音信号处理顶会，CCF B）[4] Jianbo Zheng, Lida Huang(*), Tairui Zhang, Bin Jiang, Chao Yang. Subdomain Uncertainty Optimization for Cross-Speed Fault Diagnosis. The 2025 IEEE International Conference on Acoustics, Speech, andSignal Processing (ICASSP 2025). Hyderabad, April 06 to April 11, 2025. （语音信号处理顶会，CCF B）[5] Bolin Zhang, Chao Yang(*), Bin Jiang, TakahiroKomamizu, Ichiro Ide.Multi-proposal Collaboration and Multi-task Training for Weakly-supervised Video Moment Retrieval, International Journal of Machine Learning and Cybernetics,2025(SCI/SSCI期刊).[6] Qun Zhang, Chao Yang(*), Bin Jiang and Bolin Zhang. Multi-Grained Alignment with Knowledge Distillation for Partially Relevant Video Retrieval. ACM Transactions on Multimedia Computing, Communications, and Applications(TOMM), 2025 (多媒体领域顶刊，CCF B)[7] Siyu Cheng, Chao Yang(*), Bin Jiang. Multi-Passage Retrieval-Augmented Multimodal Language Generation Model for Knowledge-Based Visual Question Answering, ICME 2025. (CCF B)[8] Mengchao Liu,Chao Yang(*), Bin Jiang, Chenglong Lei. Advancing Multi-Hop Question Answering via Alternating Retrieval and Reasoning over Multi-view Knowledge Integration, ICME2025. (CCF B)2024[1] Zhiyu Wang, Chao Yang(*), Bin Jiang,  Junsong Yuan, A Dual Reinforcement Learning Framework for Weakly Supervised Phrase Grounding, IEEE Transactions on Multimedia,  January 2024.  (多媒体领域顶刊，中科院1区Top) [2] Shuqi Ruan, Chao Yang(*), Dongsheng Li. Knowledge-enhanced personalized hierarchical attention network for sequential recommendation. World Wide Web, Volume 27, Issue 1, January 24 （CCF B）.[3] Chao Yang(*), Linli Peng, Bin Jiang, Chenglong Lei, and Mengchao Liu.  MEH-GNN: Meta-path Enhanced Heterogeneous Graph Neural Network for Dual-Target Cross-Domain Recommendation. Chinese CSCW 2024, July 2024 (Best Paper Award).2023[1]  Lin Sun, Chao Yang(*), Bin Jiang. DSP-Net: Diverse Structure Prior Network for Image Inpainting, Proc. of IEEE International Conference on Multimedia and Expo, July 10-14, 2023, Brisbane, Australia. (CCF B) 2022[1] Bolin Zhang, Chao Yang(*), Bin Jiang, Xiaokang Zhou, Video Moment Retrieval with Hierarchical Contrastive Learning, ACM MM 2022 (多媒体领域顶会，CCF A)[2] Guoqing Wang, Chao Yang(*),Su Feng, and Bin Jiang. LPGN: Language-guided Proposal Generation Network for Referring Expression Comprehension. 2022 IEEE International Conference on Multimedia and Expo, July 18-22, 2022, Taipei, Taiwan. （CCF B）[3] Jianbo Zheng, Chao Yang(*), Fangrong Zheng, Bin Jiang. A Rolling Bearing Fault Diagnosis Method Using Multi-sensor Data and Periodic Sampling, 2022 IEEE International Conference on Multimedia and Expo, July 18-22, 2022, Taipei, Taiwan. （CCF B）[4]Bolin Zhang, Chao Yang(*), Bin Jiang, Liang Pang. Dual-Channel Localization Networks for Moment Retrieval with Natural Language, Proc. of ACM International Conference on Multimedia Retrieval, June 27-30, 2022, Newark, NJ, USA. (CCF B)[5]Bin Jiang, Fangqiang Xu, Jun Xia, Chao Yang, Wei Huang, Yun Huang. Stacked Multi-Scale Attention Network for Image Colorrization, Proc. of the 2022 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP 2022), May 22-27, 2022, Singapore. （CCF B）[5]Zifan Chen, Xin Qin, Chao Yang, Li Zhang(*), Cooperative Localization for Human Pose Estimation, Communications in Computer and Information Science, Volume 1491 CCIS, 541-552, 2022.2021 [1] Chao Yang(#)(*), Weixin Zhou, Zhiyu Wang, Bin Jiang, Dongsheng Li, Huawei Shen. Accurate and Explainable Recommendation via Hierarchical Attention Network Oriented Towards Crowd Intelligence,  Knowledge-Based Systems, Volume 213, 15 February 2021, 106687. (中科院2区) [2]Chao Yang(#)(*),Su Feng, Dongsheng Li, Huawei Shen, Guoqing Wang and Bin Jiang. \"Learning Content and Context with Language Bias for Visual Question Answering.\" 2021 IEEE International Conference on Multimedia and Expo, Shen Zhen, China, 2021. （CCF B, Oral）[3] Chao Yang(#)(*), Zhiyu Wang, Huawei Shen, Huizhou Li and Bin Jiang, Multi-Modality Image Manipulation Detection, 2021 IEEE International Conference on Multimedia and Expo, Shen Zhen, China, 2021. （CCF B, Oral）[4]Shangrong Huang, Quanyu Ma, Chao Yang and Yazhou Yao, Link Prediction with Multiple Structural Attentions in Multiplex Networks, IJCNN 2021(CCF C).2020[1]Chao Yang(#)(*), Huizhou Li, Fangting Lin, Bin Jiang, hao Zhao. Constrained R-CNN: A general image manipulation detection model. IEEE International Conference on Multimedia and Expo, London, United Kingdom,6-10July 2020.(CCF B)[2] Yang Chao(#)(*), Lianhai Miao, Jiang Bin, Dongsheng Li, Da Cao. Gated and Attentive Neural Collaborative Filtering for User Generated List Recommendation, Knowledge-Based Systems, 2020. (中科院2区) [3] Bin Jiang, Wenxuan Tu, Chao Yang, Junsong Yuan. Context-Integrated and Feature-Refined Network for Lightweight Object Parsing. IEEE Transactions on Image Processing（TIP）, 2020.   (CCF A, 中科院1区TOP)[4]Yang Chao(#)(*),  Wang Xiaochan, Jiang Bin. Sentiment Enhanced Multi-modal Hashtag Recommendation for Micro-Videos,  IEEE ACCESS, 2020.[5]Hongyu Liu, Bin Jiang(*), Yibing Song, Wei Huang, Chao Yang. Rethinking Image Inpainting via a Mutual Encoder-Decoder with Feature Equalization. Proc. the 16th European Conference on Computer Vision（ECCV）, August 23 - 28, 2020, Glasgow, Scotland. (CCF B) (Oral, Acceptance rate of 2%)[6]Bin Jiang(#)(*), Jingxu Yang, Chao Yang, Wangyue Zhou, Liang Pang, Xiaokang Zhou. Knowledge Augmented Dialogue Generation with Divergent Facts Selection. Knowledge-Based Systems, 2020. (中科院2区)[7]Bin Jiang(#)(*), Wanyue Zhou, Jingxu Yang, Chao Yang, Shihan Wang, Liang Pang. PEDNet: A Persona Enhanced Dual Alternating Learning Network for Conversational Response Generation. Proc. the 28th International Conference on Computational Linguistics, December 8-13, 2020, Barcelona, Spain. (CCF B) [8]Bin Jiang(#)(*), Jing Hou, Wanyue Zhou, Chao Yang, Shihan Wang, Liang Pang. METNet: A Mutual Enhanced Transformation Network for Aspect-based Sentiment Analysis. Proc. the 28th International Conference on Computational Linguistics , December 8-13, 2020, Barcelona, Spain. (CCF B)[9]Chao Yang(#)(*), Hefeng Zhang,   Jing Hou, Bin Jiang. CLMNet: A Contextual and Local Modification Enhanced Transformer Network for Target-oriented Sentiment Classification, ChineseCSCW 2020, November 7-9, Shenzhen, China. 2019 [1] Yang Chao(#)(*), Zhang Hefeng,  Jiang Bin, Li keqin. Aspect-based Sentiment Analysis with Alternating Coattention Networks, Information Processing and Management, 2019.(SCI，CCF B)[2]Yang Chao(#)(*),  Jiang Mengqi, Jiang Bin, Zhou Weixin, Li keqin. Co-Attention Network with Question Type for Visual Question Answering, IEEE ACCESS, 2019.[3]Bin Jiang, Xin Huang, Chao Yang, Junsong Yuan. Cross-Modal Video Moment Retrieval  with Spatial and Language-Temporal Attention. Proc. the ACM  International Conference on Multimedia Retrieval (ICMR 2019), June 10-13, 2019, Ottawa, Canada.  (CCF B)[4]Hongyu Liu, Bin Jiang, Yi Xiao, Chao Yang. Coherent Semantic Attention for Image Inpainting, International Conference in Computer Vision(ICCV 2019)，Seoul, Korea. (CCF A) [5] Bin Jiang, Xin Huang, Chao Yang, Junsong Yuan. SLTFNet: A Spatial and Language-Temporal Tensor Fusion Network for Video Moment Retrieval. Information Processing and Management, 2019. (CCF B)[6]蒋斌(#)(*), 涂文轩, 杨超, 刘虹雨, 赵子龙. 基于DenseNet的复杂交通场景语义分割方法. 模式识别与人工智能, 2019, 32(5): 472-480.  (中文 CCF B)[7]蒋斌(#)(*), 刘虹雨, 杨超, 涂文轩, 赵子龙. 一种基于局部属性生成对抗网络的人脸修复算法. 计算机研究与发展, 2019. (中文 CCF A)[8] Yiwei Lv，Minghao Hu，Chao Yang, YuanYan Tang, Hongjun Wang. Extract, Attend, Predict: Aspect-Based Sentiment Analysis with Deep Self-Attention Network. i",
  "content_length": 15636,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:18"
}