{
  "name": "Chaoping Xing",
  "homepage": "https://infosec.sjtu.edu.cn/DirectoryDetail.aspx?id=132",
  "status": "success",
  "content": "邢朝平-上海交通大学网络空间安全学院 简体中文 | English 首 页 学院概况 欢迎辞 学院介绍 组织结构 学院领导 历任领导 学院办公室 联系我们 师资队伍 教师名录 两院院士 会士 国家级人才计划 国家网络安全奖 其他人才计划 学院新闻 科学研究 科研方向 科研基地 科研团队 科研成果 人才培养 三全育人 本科生 硕士研究生 博士研究生 工程硕士生 国际联合培养项目 教学研究室 党建工作 党建动态 学习园地 招聘专栏 教职招聘 博士后招聘 通知通告 通知通告 信息公开 师资队伍 教师名录 两院院士 会士 国家级人才计划 国家网络安全奖 其他人才计划 首页 » 师资队伍 » 教师名录 xingcp@sjtu.edu.cn 软件大楼5220 个人主页 邢朝平 讲席教授 邢朝平目前是上海交通大学讲席教授，中组部国家特聘教授。1990年在中国科学技术大学获得博士学位后留校工作，1993年获德国洪堡奖学金在Essen大学工作，其后在奥地利科学院从事研究工作。1998年加入新加坡国立大学，历任助教、tenured副教授、教授。2007年始任职于新加坡南洋理工大学教授。2019年加盟上海交通大学。长期从事密码、编码、安全多方计算、代数数论等方面的研究。入选国家海外高层次人才计划、上海市海外高层次人才计划、中科院百人计划等。 获得新加坡国家科学奖、荷兰Leiden大学Kloosterman讲席教授、德国洪堡学者等。曾任国际编码界最高奖Hamming奖评审专家委员会成员、斯坦福大学访问教授。出版专著四本，由剑桥出版社出版的《Coding Theory -- A First Course》一书先后被欧美、亚洲等世界多所大学作为教材使用。已在《Journal of the ACM》上发表文章一篇，在美密会、欧密会、亚密会、TCC、PKC上发表密码文章20多篇，在计算机理论会议FOCS、STOC、SODA、ICALP、CCC、RANDOM等发表论文20多篇。在信息论期刊《IEEE Transactions on Information Theory》发表编码论文80多篇，同时在数学期刊《Advances in Mathematics》、《Trans. Of the Amer. Math. Soc.》等数学期刊上发表论文20多篇。主持过中国国家自然科学基金重点项目，中国科技部重点研发项目，新加坡国家自然科学基金重点项目，新加坡国防部基金，新加坡教育部基金等项目。目前任包括《IEEE Transactions on Information Theory》、《Finite Fields and Their Applications》在内的多个SCI期刊编委。 研究兴趣 教育背景 工作经验 教授课程 论文发表 项目资助 获奖信息 学术服务 编码、密码、代数数论 1.IEEE班：《信息论》， 2019-2020第二学期（合上）； 2.研究生课程：《基础代数》， 2020-2021第一学期（合上） 1. Z. Guo, Chaoping Xing, C. Yuan and Z. Zhang: Random Gabidulin codes achieve list decoding capacity in rank metric, FOCS 2024 2. F. Lin, Chaoping Xing and Z. Yao: More Efficient Zero-Knowledge Protocols over $\\mathbb{Z}_{2^k}$ via Galois Rings, CRYPTO 2024 3. S. Li, Chaoping Xing: Fast Fourier transform via automorphism groups of rational function fields. SODA 2024: 4. S. Liu, T. Wu and Chaoping Xing: Nonlinear codes exceeding the Gilbert-Varshamov and Tsfasman-Vl?du?-Zink bounds. SODA 2023. 5. Venkatesan Guruswami, Chaoping Xing: 6. Optimal Rate List Decoding over Bounded Alphabets Using Algebraic-geometric Codes. J. ACM 69(2): 10:1-10:48 (2022) 7. D. Escudero, Chaoping Xing, C. Yuan:More Efficient Dishonest Majority Secure Computation over $\\mathbb {Z}_{2^k}$ via Galois Rings. CRYPTO (1) 2022: 8. R. Cramer and Chaoping Xing, Blackbox Secret Sharing Revisited: A Coding-Theoretic Approach with Application to Expansionless Near-Threshold Schemes, Eurocrypt 2020. 9.  R Cramer, I. Damgard, D. Escudero, P. Scholl and Chaoping Xing,: SPDZ2k: Efficient MPC mod 2^k for Dishonest Majority: CRYPTO 2018. 10.  I. Cascudo, R. Cramer, Chaoping Xing and C. Yuan: Amortized Complexity of (Information-Theoretically) Secure MPC Revisited, CRYPTO 2018. 11. R. Cramer, I. Damgard, Chaoping Xing, C. Yuan: Amortized complexity of zero-knowledge proofs revisited: achieving linear soundness slack, Eurocrypt 2017. 学院概况 优秀的师资团队，丰富的校园生活，温馨如家的环境，积极的学习氛围 科学研究 学院先后承担多项国家军事科研项目、国家信息安全应用示范工程等40余项 人才培养 国家教育部、科技部、上海市人民政府共同发起的国内首家信息安全专业人才培养基地 友情链接： 上海交通大学电子信息与电气工程学院 上海交通大学 Copyright © 2017 - 2019 上海交通大学网络空间安全学院 沪ICP备05052060号",
  "content_length": 2878,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:19"
}