{
  "name": "Chao Yang 0016",
  "homepage": "https://faculty.xidian.edu.cn/yc",
  "status": "success",
  "content": "西安电子科技大学主页平台管理系统 杨超 首页 中文主页 登录 西安电子科技大学 English qNdqyNwRgYVTv1oDn5syzzniOZiXkinq0OJdYWvg1rsNIXZmCzbFUMjs432I 首页 科学研究 研究领域 科研项目 论文成果 科研成果简介 科研资源 教学改革 授课信息 国际化培养 教学改革研究 获奖信息 招生信息 学生信息 师生风采 我的相册 杨超 个人信息Personal Information 教授 博士生导师 硕士生导师 主要任职：网络与信息安全学院副院长 性别：男 毕业院校：西安电子科技大学 学历：博士研究生毕业 学位：博士研究生毕业 在职信息：在岗 所在单位：网络与信息安全学院 双肩挑单位： 网络与信息安全学院 学科：网络空间安全 办公地点：网络安全大楼AII-0810 联系方式：63d882614b140aabf6f9b9c8baba728172fd0a93a1971e4415c09ebe7cd0519b30f5f896f572c83809860081517da647c57dedc31b3edfb412a5ef0c5eb6c0a7ac8decb3d6999fce8494733368694341d2a5f117d59e7351baab4aae1b06bd98c3f4c43262cd44d96d8848515c003ae3cfb44a5369b0b7d254d5df91c334184d 电子邮箱：580bc1b9bfd6615a06284b48e90b287673b4b9c821e12de88ee4fd5d8d8f66680b42df13d3c5fef27c1f5e7acb000a41ff179516d7ccea645eea21b06363694402e074bc5992d93dc1c96f70ffdd106c5b27787b123e7a53c1ba27c48e236e165b113bae575d015d1307bbbd9c5850f331d2547d7f2f2f8bb0f11d5427d44173 其他联系方式Other Contact Information 邮箱 : 580bc1b9bfd6615a06284b48e90b287673b4b9c821e12de88ee4fd5d8d8f66680b42df13d3c5fef27c1f5e7acb000a41ff179516d7ccea645eea21b06363694402e074bc5992d93dc1c96f70ffdd106c5b27787b123e7a53c1ba27c48e236e165b113bae575d015d1307bbbd9c5850f331d2547d7f2f2f8bb0f11d5427d44173 通讯/办公地址 : 570d77b08962326c5522b7bac42ee50fe9914ed251e67362ec118c75c379d430ad319153b4bbd2905e9499701485cd68699cb28c56564d8df6d6cc2cfc73b6923faedb75fcd616cbb78f3c8a44b5b69927c1fdb3851bf2024544e430aa2530068921b6f0ae5d633463b566a4568acf1bc592aa5c6f693a9abb79137bb17a283c 邮编 : 4f52fcb1cccea9b05a2a85486644e58f184db98011c170e3ae952a669d39451be169a79c97ff0c42326a7947ca29efe29df057669ae8131d3b029efc49ab5030834186e484e757487d83cf426efe3dd53c4b8dbde62d11b345c6fcbd687232626a25b6fd300d969d7168cb2716576a8c7f2ae28884a42a70c0260f504dda4c94 扫描关注 同专业博导 同专业硕导 个人简介Personal Profile 杨超，博士，西安电子科技大学华山菁英教授、博士生导师。2008年6月于西安电子科技大学获得密码学专业工学博士学位，2012年-2013年于美国密歇根州立大学完成博士后研究工作。现任西安电子科技大学网络与信息安全学院（国家一流网络安全学院）副院长，陕西省委网信办网络安全风险防控实验室副主任、陕西省秦创原全域流量分析与检测技术研究及应用“科学家+工程师”队伍首席科学家，中国计算机学会计算机安全专委会委员、中国密码学会混沌保密通信专委会委员、中国指挥与控制学会智能指挥调度专委会常务委员、陕西省信息安全标准化技术委员会委员、陕西省计算机教育学会理事。获聘教育部学科评估评议专家、教育部全国研究生教育评估监测专家、教育部高等学校科学研究评审专家、教育部普通高等学校本科教育教学评估专家、教育部全国学生资助信息化工作专家、教育部教育系统网络安全保障专业人员培训（ECSP）专家、科技部科研项目评审专家、西安市科技专家、中国信息安全测评西北中心高级咨询专家、腾讯公司特聘网络安全专家、深信服公司特聘网络安全高级顾问。 长期从事无人智能系统安全、软件供应链安全、工业互联网安全等研究工作，主持各类国家重点研发计划专项（子课题）、国家自然科学基金、某单位技术攻关重点专项、陕西省重点研发计划（重点产业创新链）、陕西省科技创新计划（重大科技创新平台建设）、陕西省技术创新引导计划等科研项目，以及腾讯科研合作项目、华为创新研究计划、CCF-绿盟科技“鲲鹏”科研基金等产教融合创新项目共计二十余项。相关成果发表在ACM/IEEE ICSE、FSE、ICC、GLOBECOM、IEEE TIFS、TITS、IoTJ、计算机学报、软件学报等国内外顶级学术会议/期刊。并以第一完成人授权PCT国际发明专利3项、US美国发明专利1项、中国技术发明专利40余项，部分成果被纳入国际标准ITU-T X.1125。获陕西省科学技术一等奖（排名2）、中国航空学会科学技术一等奖，陕西省科技工作者创新创业大赛金奖。自主研发了综合化航空电子安全性测试系统、软件供应链漏洞检测系统、无人机/自动驾驶缺陷检测系统等多款网络安全技术与产品，在国家关键行业得到应用示范。 学术新闻： 1)杨超教授团队“无人机系统安全”相关研究成果“Control Parameters Considered Harmful: Detecting Range Specification Bugs in Drone Configuration Modules via Learning-Guided Search”被软件工程领域顶级国际会议ACM/IEEE ICSE 2022（CCF A）录用！【西电新闻报道】【陕西日报报道】 2)杨超教授团队“无人机系统安全”相关研究成果“DPFuzzer:Discovering Safety Critical Vulnerabilities for Drone Path Planners”被软件工程领域顶级国际会议ACM/IEEE ICSE 2025（CCF A）录用！【西电新闻报道】【西电网信院报道】 3)杨超教授指导的本科生科研小组，其研究成果“Watchout! -基于模糊测试的自动驾驶功能安全测试系统”一举夺魁第十六届全国大学生信息安全竞赛作品赛决赛一等奖，并在全国决赛300多支队中脱颖而出一举斩获最高奖“最具创新创业价值奖（11/300+）”。【西电新闻报道】 参赛队员均推免。步桐推免复旦大学、黄田田、张柏迪推免西安电子科技大学、李超凡推免上海交通大学。 4)2024年中国国际大学生创新大赛以“我敢闯，我会创”为主题，以“更中国、更国际、更教育、更全面、更创新、更协同”为总体目标，落实立德树人根本任务，传承和弘扬红色基因，聚焦“五育”融合创新创业教育实践，激发青年学生创新创造热情，打造共建共享、融通中外的国际创新盛会。杨超教授指导的郭家豪等同学，其参赛作品“SafePilot-基于对抗性驾驶策略的自动驾驶系统安全性检测平台”获得高教主赛道陕西赛区银奖。 5)2025年8月14日，第十八届全国大学生信息安全竞赛作品赛决赛在西安交通大学兴庆校区举办，大赛已连续举办18届，大赛于2020年正式入选“全国高校学科竞赛排行榜”，目前已成为国内最具影响力的网络安全学科竞赛，被誉为“网安国赛”。杨超教授指导的魏彬宇等同学，其参赛作品“V2X-Safer:大模型生成场景驱动下的V2X车路协同ADS安全检测系统”获得一等奖。【西电网信院报道】 参赛队员均推免。魏彬宇推免浙江大学、郑智历、黄依宇推免西安电子科技大学、丁有涛推免上海交通大学。 6)2023年，在中央网信办指导下，天融信科技集团、奇安信集团、蔚来、蚂蚁集团、一流网络安全学院、中国网络空间安全协会、中国互联网发展基金会共同发起了（全国首批）网络安全学院学生创新资助计划。资助计划旨在深入贯彻落实习近平总书记关于坚持网络安全教育技术产业融合发展的重要指示精神，鼓励和资助高校网络安全学院学生开展创新活动，培育网络安全人才创新能力。通过层层选拔与激烈竞争，杨超教授指导的博士生赵肖云获批该计划资助（全国首批）。 在中央网信办指导下，由天融信、奇安信、蔚来、蚂蚁集团、华为等网信企业，一流网络安全学院及相关协会、基金会共同发起的“网络安全学院学生创新资助计划二期”，吸引1472名学生申报，最终28所高校的320名学生获资助、151个课题立项。2024年，我院本科生朱育民入选该计划第二批资助名单，同期成功推免至杨超教授课题组深造。 7)2022年“华为杯”第一届中国研究生网络安全创新大赛”以国家战略需求为驱动，紧紧围绕研究生培养目标，从“产教融合”“科教融合”“赛教融合”等维度设立揭榜挑战赛、创意作品赛和实网对抗赛三个赛道，重点锻炼研究生的科学创新能力和工程实践能力，力求解决国家在网络空间安全领域的“卡脖子”问题。大赛初赛共有670支队伍参赛，其中创意作品赛351支队伍、揭榜挑战赛126支队伍、实网对抗赛193支队伍，现初赛评审工作已顺利结束，共有125支队伍入围决赛，创意作品赛、揭榜挑战赛及实网对抗赛分别有70支队伍、30支队伍、25支队伍入围决赛。西电一共进入决赛7个队伍，最难的揭榜挑战赛西电只有3个队伍进决赛】【最终获奖（揭榜挑战赛）：一等奖五个，二等奖十个，三等奖十五个】。杨超教授指导的硕士生罗思琦、常梦媛等同学，分别获得2022年“华为杯”第一届中国研究生网络安全创新大赛全国总决赛二等奖、三等奖： 基于边缘检测和隐写术的大容量数字水印嵌入方案，2022年“华为杯”第一届中国研究生网络安全创新大赛全国总决赛二等奖，“队名：天妇罗”，“队员：罗思琦、田笑、韦梓涵、罗东旭”“指导教师：杨超”。 基于边缘检测和隐写术的大容量数字水印嵌入方案，2022年“华为杯”第一届中国研究生网络安全创新大赛全国总决赛三等奖，“队名：生逢其时”，“队员：常梦媛、陈涛，黄凯琦” “指导教师：杨超”。 8)受特邀在陕西省2020年“第四届丝绸之路网络安全论坛”作主旨报告、受邀作为圆桌论坛嘉宾参加2020年教育部信息技术新工科产学研联盟年会做网络安全人才培养交流探讨等特邀报告与讲座10余次。接受国家级期刊与报纸采访30余次，就网络安全和密码学的人才培养等问题展开讨论（包括：中央广播电视总台央广网、科技日报、中国青年报、经济日报《经济》杂志、中国产经新闻、《财经》杂志、瞭望东方新闻周刊、中国新闻网、华商报、湖南卫视、陕西二套都市热线、陕西广播新闻教育百分百等）。 9)2021年12月21日受华商报记者专访，就疫情期间西安“一码通”系统多次崩溃的问题发表看法，指出此系统的健壮性应进一步增强，以满足高负荷运行下软硬件之间的平衡与稳定，同时需要从网络安全方面加强防护，做好纵深防御。【华商报专访报道】 10)2022年1月12日受央广网（中央广播电视总台主办的中国最大的音频广播新闻网站）采访，就近期多地健康码系统“频崩”问题发表看法，指出访问量激增引起的网络拥堵是系统崩溃的主因，反映出系统缺乏足够的弹性伸缩能力等问题，在全国推广刷身份证自动核验健康码很有必要，但同时也应注意身份验证的多样化、数据交换的安全传输和数据共享的隐私保护等问题。【央广网官网报道】【央广网微博报道】 教育经历Education Background 工作经历Work Experience 1998.08 2002.06 西安电子科技大学 计算机及应用 大学本科毕业 学士学位 2002.08 2005.03 西安电子科技大学 计算机系统结构 硕士研究生毕业 硕士学位 2003.08 2008.06 西安电子科技大学 密码学 博士研究生毕业 博士学位 2005.03 2014.12 西安电子科技大学 计算机学院 讲师、副教授 在职 计算机科学与技术 2015.01 2021.07 西安电子科技大学 网络与信息安全学院 教授 在职 网络与信息安全 研究方向Research Focus 社会兼职Social Affiliations 1. 网络协议/安全协议的漏洞挖掘与缺陷检测（Vulnerability Discovery/Detection of Network/Security Protocols） 【核心】：网络协议与安全协议是数字世界的“交通规则”、是构建网络通信的基石，其设计或实现中的缺陷会直接导致系统性风险，其安全至关重要。其安全技术研究主要包括：结合人工智能AI与大模型LLM技术，设计与研发开源/典型的网络协议/安全协议（TCP/IP网络协议、OpenSSL安全协议）、新型应用系统（智能车联网、卫星互联网）专用网络协议/安全协议的漏洞挖掘与缺陷检测的方法、技术和工具。 2. 智能无人系统/机器人车辆RV/自动驾驶ADS的安全技术研究（CPS/RV/ADS Safety & Security） 【核心】：智能无人系统/机器人车辆等是一种典型的物理信息系统CPS，其进阶版为“具身智能（Embodied Intelligence）”，是将人工智能融入机器人、新能源汽车等物理实体，强调智能体通过身体与环境的动态交互实现自主学习和进化，其核心在于将感知、行动与认知深度融合。其安全技术研究主要包括：设计网络空间与物理空间交叉融合下智能无人系统的语义安全性测试的方法、技术与工具；研发具有内生安全/弹性可容错的无人系统安全智能算法与软件系统。 教育部学位中心评审专家中国工程教育专业认证专家中国密码学会混沌保密通信专委会委员陕西省计算机教育学会理事陕西省信息安全标准化技术委员会委员腾讯公司特聘网络安全专家 美国计算机学会（ACM）会员美国电子与电气工程师学会（IEEE-CS）会员中国计算机学会（CCF）会员中国计算机学会-青年计算机科学家论坛西安分论坛委员（CCF-YOCSEF）中国密码学会（CACR）会员网络空间安全协会（CSAC）会员 版权所有：西安电子科技大学　陕ICP备05016463号 手机版 访问量：次 最后更新时间： ..",
  "content_length": 6306,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:18"
}