{
  "name": "Chao Ma 0004",
  "homepage": "https://vision.sjtu.edu.cn",
  "status": "success",
  "content": "Chao Ma's Homepage Homepage Publications Members Talks Services Teaching Resources Join us Chao Ma's Homepage Dr. Chao Ma Professor, PhD Advisor 5-504 Software Building, AI Institute, Shanghai Jiao Tong University 800 Dongchuan Road, Shanghai, P. R. China Email: chaoma(at)sjtu.edu.cn, chaoma99(at)gmail.com Phone: +86-21-34208478 Google Scholar | Github Looking for self-motivated graduate students and post-docs working with me. For prospective students, please send your resume and transcript to my email. Biography I am a full professor at Shanghai Jiao Tong University. I advise both PhD and MS students in computer science. Prior to joining Shanghai Jiao Tong University in 2019, I was a postdoc researcher with Australian Centre for Robotic Vision at the University of Adelaide. I completed my PhD study at Shanghai Jiao Tong University in 2016. During the fall of 2013 to the fall of 2015, I was a joint-training PhD student at University of California, Merced. I received bachelor and master degrees from University of Electronic Science and Technology of China in 2008 and 2011 respectively. I am interested in computer vision problems. Typically, I work on object detection and tracking vision problems for autonomous driving multi-modal understanding (vision and language) image restoration and enhancement image/video generation a.k.a. artificial intelligence generated content Highlights and News 08/2025, I will serve as an Area Chair for ICLR 2026 07/2025, seven papers were accepted to ICCV 2025 07/2025, two papers were accepted to ACM MM 2025 06/2025, I will serve as an Area Chair for AAAI 2026 and WACV 2026 02/2025, two papers were accepted to CVPR 2025 12/2024, I will serve as an Area Chair for ICCV 2025 11/2024, two papers are accepted to NeurIPS 2024 09/2024, I will serve as an Associcate Editor for IEEE Trans. on Multimedia (TMM) 09/2024, I will serve as an Area Chair for ICLR 2025 and CVPR 2025 08/2024, I will serve as an Associate Editor for the Journal of Artificial Intelligence Research (JAIR) 08/2024, two papers are accepted to IJCV 08/2024, four papers are accepted to TPAMI, TIP, ACM MM 2024, Siggraph Asia 2024 07/2024, three papers are accepted to ECCV 2024 02/2024, six papers are accepted to CVPR 2024 01/2024, we won the best paper award in the 30th International Conference on Multimedia Modeling (MMM 2024) [link] 01/2024, two papers are accepted to ICRA 2024 01/2024, one paper is accepted to ICLR 2024 09/2023, I am honered to be sponsored by NSFC for excellent youth scholars ï¼NSFCä¼ç§éå¹´ç§å­¦åºéï¼ 07/2023, our cross-modal segementation work is accepted to ICCV 2023 06/2023, I will serve as an Area Chair for CVPR 2024 03/2023, I again ranked among Elsevier Chinese highly cited scholars ï¼ä¸­å½é«è¢«å¼å­¦è ï¼ 03/2023, six papers are accepted to CVPR 2023 07/2022, two papers are accepted to ECCV 2022 05/2022, one paper is accepted to IEEE TPAMI 04/2022, I again ranked among Elsevier Chinese highly cited scholars ï¼ä¸­å½é«è¢«å¼å­¦è ï¼ 03/2022, three papers are accepted to CVPR 2022 01/2022, we release the source code of PointAugmenting (CVPR 2021) [code] 09/2021, one paper on 3D point cloud detection is accepted by NeurIPS 2021 07/2021, I will serve as a Senior Program Committee (SPC) member for AAAI 2022 07/2021, one paper is accepted to ICCV 2021 05/2021, our paper about AlphaTrack is accepted to IROS 2021 05/2021, one paper is accepted to ICML 2021 04/2021, I ranked among Elsevier Chinese highly cited scholars ï¼ä¸­å½é«è¢«å¼å­¦è ï¼ 03/2021, three papers are accepted to CVPR 2021 01/2021, one tracking paper is accepted to TIP 11/2020, we rank first on the nuScenes detection learderboard 11/2020, we rank first on the nuScenes tracking learderboard 11/2020, the journal version of DLST (ECCV 2018) is accepted to TPAMI 11/2020, one tracking paper is accepted to TIP 09/2020, I join the StarTrack program of Microsoft Research Asia (MSRA) ï¼å¾®è½¯äºç é¢é¸æè®¡åï¼ 08/2020, our paper “Cross-Modality 3D Object Detection” is accepted to WACV 2021 07/2020, one tracking paper is accepted to ACM MM 2020 07/2020, three papers are accepted to ECCV 2020 06/2020, our 3D face reconstruction paper won CVPR workshop best paper 03/2020, the journal version of our UDT tracker is accepted to IJCV 01/2020, one MOT paper with end-to-end CRF learning is accepted to TCSVT 10/2019, one tracking paper with knowledge distilling is accepted to TIP 09/2019, I am honered to be sponsored by Shanghai Pujiang Talent Program ï¼ä¸æµ·å¸æµ¦æ±äººæè®¡åï¼ 07/2019, I am honered to be sponsored by NSFC 05/2019, I was recognized as outstanding reviewer in CVPR 2019 02/2019, four papers are accepted to CVPR 2019 01/2019, I serve as a guest editor of Pattern Recognition Special Issue on Deep Video Analysis [call for paper] 11/2018, I receive an honer for CSIG excellent doctoral dissertation ï¼ä¸­å½å¾è±¡å¾å½¢å­¦å­¦ä¼ä¼åï¼ 10/2018, I will join Shanghai Jiao Tong University as a tenure-track assistant professor in January, 2019 visitors since Feb. 18th, 2015 | æ²ªäº¤ICPå¤20200181 | Page generated 2025-10-13, by VLG @ SJTU.",
  "content_length": 5128,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:17"
}