{
  "name": "Chao Lan",
  "homepage": "https://www.cs.ou.edu/~clan",
  "status": "success",
  "content": "Chao Lan Lan, Chao Assistant Professor School of Computer Science University of Oklahoma email: clan [AT] ou.edu I am an assistant professor in the School of Computer Science, Gallogly College of Engineering, at the University of Oklahoma (OU). I am also affiliated with the Data Science and Analytics Institute at OU. I work on machine learning. My primary research interest is to explore (provable) probabilistic natures of a learning task and exploit them to better understand or improve task efficiency and trustworthiness. My current research focuses on designing, analyzing and applying randomized learning algorithms. I received my Ph.D. degree from the University of Kansas. Here is my CV. What's New 11/2025: I'll serve as an Area Chair for ICML'26 and SPC for PAKDD'26. 09/2025: Luyuan will serve as reviewers for ICLR'26 and AISTATS'26. 02/2025: I'll serve as an Area Chair for NeurIPS'25. 12/2024: Two papers accepted by ICASSP'25. Congrats to Yiting, Jacob, Shayan and Luyuan. 12/2024: I'll serve as an Area Chair for ICML'25 and SPC for PAKDD'25. Research Work on Randomized Learning Efficient Data-Dependent Random Projection for Least Square Regressions Jacob Sturges, Luyuan Yang, Shayan Shafaei and Chao Lan International Conference on Acoustics, Speech, and Signal Processing (ICASSP), 2025 Efficient Estimation of Kernel Matrix Spectral Norm based on Random Features Yiting Cao, Shayan Shafaei, Luyuan Yang and Chao Lan International Conference on Acoustics, Speech, and Signal Processing (ICASSP), 2025 A Model-Agnostic Randomized Learning Framework via Random Hypothesis Subspace Sampling Yiting Cao and Chao Lan International Conference on Machine Learning (ICML), 2022 Other Selected Work Active Approximately Metric-Fair Learning Yiting Cao and Chao Lan Conference on Uncertainty in Artificial Intelligence (UAI), 2022 Towards a Theorectical Understanding of Negative Transfer in Collective Matrix Factorization Chao Lan, Jianxin Wang and Jun Huan Conference on Uncertainty in Artificial Intelligence (UAI), 2016 Ph.D. Students Shayan Shafaei, 2022- Luyuan Yang, 2023- * To OU students: if you are interested in doing research with me, please take CS 4033/5033 first. Recent Teaching Spring 2025. CS2813: Discrete Structures Fall 2024. CS4033/5033: Machine Learning Fundamentals Fall 2024. CS4013/5013: Artificial Intelligence Recent Service Area Chair: NeurIPS'24-25, ICML'25-26 Senior PC: PAKDD'25-26 Associate Editor: ACM Transactions on Probabilistic Machine Learning Honors Top Reviewer: UAI'23, AISTATS'23, NeurIPS'22, AAAI'21 Distinguished Lecture, NSF NRT@KU, 2021 Distinguished Paper Award, ACSAC, 2021 NSF CRII Award, 2019 UAI Scholarship, 2016 Data Science Summer Institute Scholarship, UIUC, 2012 Contact Office: DEH 210 Phone: (405)325-5735",
  "content_length": 2778,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:18"
}