{
  "name": "Chao Gu",
  "homepage": "https://pure.qub.ac.uk/en/persons/chao-gu",
  "status": "success",
  "content": "Chao Gu - Queen's University Belfast View Scopus Profile Chao Gu Dr Lecturer, School of Electronics, Electrical Engineering and Computer Science https://orcid.org/0000-0002-9183-7820 Phone+44 (0)28 9097 1736EmailChao.Guqub.acuk Accepting PhD Students 20142025 Research activity per year Personal profile Research InterestsMy current research focus is novel antennas for advanced wireless sensing and imaging applications. I am seeking highly motivated PhD students to join my research group and contribute to cutting-edge projects in this exciting field. Key Research Interests: RF antenna design and optimizationAntenna packaging and integrationSub-terahertz and mmWave technologiesAdvanced sensing and imaging applications PhD Studentship Opportunities: I am currently offering PhD studentship opportunities for qualified candidates with a strong background in electrical engineering or a related field. Successful applicants will have the opportunity to work on challenging research projects, collaborate with leading experts, and contribute to the advancement of RF antenna technology. Current Studentship Qualifications: Master's degree in electrical engineering or a related fieldStrong background in RF/microwave engineeringExperience with electromagnetic simulation tools (e.g., HFSS, CST)Excellent research and communication skillsPassion for innovation and a desire to contribute to cutting-edge research How to Apply: Interested applicants should submit their CV, transcripts, and a research statement outlining their research interests and experience. Contact: For more information or to apply, please contact me at [email protected] Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Fingerprint Dive into the research topics where Chao Gu is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 8 Similar Profiles Antenna Engineering 100% Design Engineering 48% Broadband Physics 36% Frequencies Physics 33% Rectifiers Physics 30% Arrays Physics 27% Selective Surface Engineering 22% High Gain Engineering 21% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2014 2020 2021 2022 2024 2025 2025 61 Article 37 Conference contribution 2 Paper 1 Book Research output per year Research output per year A dual-frequency shared aperture wide-beam antenna for LEO satellite applicationsZhao, D., Han, G., Liu, G., He, Q. & Gu, C., 20 Feb 2025, 2024 IEEE 12th Asia-Pacific Conference on Antennas and Propagation (APCAP) - Proceedings. Institute of Electrical and Electronics Engineers Inc., (2024 IEEE 12th Asia-Pacific Conference on Antennas and Propagation, APCAP 2024 - Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Antenna 100% Low Earth Orbit 100% X-Band 28% Simulation Result 14% Horn Antenna 14% A frequency-reconfigurable single-port handset antenna for GEO and LEO satellite communicationsZhang, H., Shi, H., Gu, C., Gao, S., Zhang, K. & Xu, L., 02 Jun 2025, (Early online date) In: IEEE Antennas and Wireless Propagation Letters.Research output: Contribution to journal › Article › peer-review Open AccessFile Antenna 100% Geostationary Orbit 100% Low Earth Orbit 100% Port 100% Satellite Communication 100% 39 Downloads (Pure) A generalized design approach for dual-band class-F GaN HEMT-based rectifiersZhang, Z., Zhou, D., Xuan, X. & Gu, C., Nov 2025, In: IEEE Transactions on Microwave Theory and Techniques. 73, 11, p. 8788-8800 13 p.Research output: Contribution to journal › Article › peer-review Phase Shift 100% Rectification 100% Continuous Mode 50% Test Result 25% Networks (Circuits) 25% 1 Citation (Scopus) A high-efficiency reconfigurable bidirectional array antenna based on transmit-reflect switchable metasurfaceQin, F., Bi, J., Gu, C., Zhang, H., Cheng, W. & Gao, S., 05 Jun 2025, (Early online date) In: IEEE Transactions on Antennas and Propagation.Research output: Contribution to journal › Article › peer-review Open AccessFile Metasurface 100% Antenna Arrays 100% Insertion Loss 10% Incident Wave 10% Antenna 10% 12 Downloads (Pure) A wideband multibeam planar quasi-yagi array antenna based on parasitic pixel stripsBi, J., Qin, F., Gu, C. & Zhang, H., 02 Apr 2025, (Early online date) In: IEEE Antennas and Wireless Propagation Letters. 5 p.Research output: Contribution to journal › Article › peer-review Antenna 100% Antenna Arrays 100% Antenna Array 100% array antenna 100% Beam Direction 33% 2 Citations (Scopus) View all 101 research outputs Activities Activities per year 2020 2022 2025 2025 5 Participation in conference 1 Participation in Festival/Exhibition 1 Participation in workshop, seminar, course 1 Editorial activity 3 More 1 Publication peer-review 1 Membership of network 1 Visiting an external academic institution Activities per year 2025 IEEE MTT-S International Microwave Workshop Series on Advanced Materials and Processes for RF and THz Applications, IMWS-AMP 2025Gu, C. (Member of programme committee)Jul 2025Activity: Participating in or organising an event types › Participation in conference EEECS OPEN DAY JUNE 2025Gu, C. (Participant)07 Jun 2025Activity: Participating in or organising an event types › Participation in Festival/Exhibition Terahertz, Microwave and Millimetre Technologies for Earth Observation WorkshopGu, C. (Participant)28 Feb 2025Activity: Participating in or organising an event types › Participation in workshop, seminar, course IEEE Journal on Selected Areas in Communications (Journal)Gu, C. (Peer reviewer)2025Activity: Publication peer-review and editorial work types › Publication peer-review 19th European Conference on Antennas and Propagation 2025Gu, C. (Member of the organising committee)2025Activity: Participating in or organising an event types › Participation in conference View all 11 activities",
  "content_length": 6399,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:17"
}