{
  "name": "Chao Zhang 0034",
  "homepage": "https://rucchao.github.io",
  "status": "success",
  "content": "Bio - Chao Zhang@Database Chao ZhangAssociate Professor@RUC Follow Renmin University, Beijing Email Github Google ScholarI am an Associate Professor at Renmin University of China (School of Information, CSRanking’s TOP-3 in Mainland China’s DB Researches). Currently, I am closely working with Prof. Ju Fan.I did my postdoc with Prof. Guoliang Li at Database group, Tsinghua University. I was awarded the Ph.D. degree in Computer Science, at University of Helsinki, Finland. I am very honored to have Prof. Jiaheng Lu as my Ph.D. supervisor. Prior to joining UH, I spent one year at School of Information, Renmin University of China (RUC) for Ph.D. studies, Here is a recent interview about me.My current research topic focuses on performance benchmarking and optimization for cutting-edge data systems including HTAP databases, AI-Enhanced DBMSs, Cloud-Native Databases, and Big Data Systems. Please find more details in my selected publications.Academic ServicesPC member for the following conferences:ACM SIGMOD 2024-2025VLDB 2023-2024 (Tutorial)IEEE ICDE 2023DASFAA 2023-2026Reviewer for the following journals:TKDE 2023-2024VLDB Journal 2024News[2025.7.29] I have been promoted to an Associated Professor! Cheers![2025.6.23] Our paper on Cloud Analytical Benchmarking has been accepted to VLDB 2025! Cheers![2025.5.9] Our paper on Cloud-Native Database Benchmarking has been selected as ICDE 2025 Best Paper Runner-Up Award! It is our great honor and see you at HK![2025.3.26] Our paper on Cloud-Native Database Benchmarking has been accepted to ICDE 2025! Cheers![2024.9.12] I have joined Renmin Univeristy of China as an Assistant Professor! Cheers![2024.7.5] Our survey paper on Cloud-Native Databases has been accepted to TKDE 2024! Cheers![2024.4.18] I serve as a PC member for VLDB 2024 Tutorial Track.[2024.4.13] Our HTAP survey has been accepted to TKDE 2024! Cheers![2023.12.25] I am honored to be invited as a Program Committee member of SIGMOD 2025![2023.12.18] Two papers got accepted: one is an HTAP benchmark paper in VLDB 2024, the other one is learned cardinality estimation study in SIGMOD 2024. Cheers![2023.3.6] I am honored to be invited as a Program Committee member of VLDB 2023 Tutorial Track! [Website][2023.2.17] One research paper about learned cardinality estimation got accepted at ICDE 2023! Cheers![2022.11.9] I am honored to be invited as a Program Committee member of SIGMOD 2024! [Website][2022.8.21] We will give a new tutorial at VLDB 2022! The title is “Cloud Databases: New Techniques, Challenges, and Opportunities”. See you at VLDB 2022! [Website][2022.4.18] I am honored to be invited as a Program Committee member of ICDE 2023! [Website][2022.3.10] We will give a new tutorial at SIGMOD 2022! The title is “HTAP Databases: What is New and What is Next”. See you at SIGMOD 2022! [Website]",
  "content_length": 2833,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:19"
}