{
  "name": "Charalampos Saitis",
  "homepage": "http://eecs.qmul.ac.uk/profiles/saitischaralampos.html",
  "status": "success",
  "content": "Dr Charalampos Saitis - School of Electronic Engineering and Computer Science Skip to main content School of Electronic Engineering and Computer Science School of Electronic Engineering and Computer SciencePeopleProfiles Dr Charalampos SaitisLecturer in Digital Music ProcessingEmail: c.saitis@qmul.ac.ukRoom Number: Engineering, Eng 111Twitter: @noindentProfileTeachingResearchSupervisionProfileI am based at the Centre for Digital Music (C4DM), one of the world’s largest music and acoustic technology research groups. Within C4DM I lead the Communication Acoustics Lab, where we conduct cutting-edge research into the ways people perceive sound and technologies for improving communication. This involves using empirical and computational methods to understand different modalities of experience, interaction, and control between the digital music “user” (listeners, performers, producers) and sound as a multimodal semiotic system. My research focuses on cognitive representations of timbre and metaphor, including digital interactive cross-sensory games for public engagement and in-the-wild collection of behavioural data. I am a founding member of the International Conference on Timbre and acted as co-editor for the scientific volumes Timbre: Acoustics, Perception, & Cognition (2019) and Musical Haptics (2018). I am also interested in data-driven approaches to modelling human values (and biases) using multimodal music data (Turing Fellow 2021–2023). My CV and publication list can be found here: Charalampos Saitis CV (updated January 2023)My publications can also be found on my Google Scholar profile. I am a member of the EECS Equalities Committee and the QMUL Racial Equality Action Group, and Chair of the EECS Devolved School Research Ethics Committee. TeachingInteractive Digital Multimedia Techniques (Postgraduate) This is a Master's level course in developing real-time interactive digital media systems. The course will focus on graphics and sound programming, with a secondary emphasis on basic electronic hardware design for sensors and human-computer interfaces. The course will employ widely-used development environments including Arduino, Processing Max/MSP and Jitter, Processing. Course material will be delivered through a combination of lectures, interactive lab sessions, and individual/group exercises (both in and out of class). Generally speaking, each class period will consist of a combination of lecture and interactive lab session. Professional and Research Practice (Undergraduate) This module provides you with the opportunity to examine the role of engineering in society and the expectations of society for a professional engineer. During the module, you should develop and achieve a level of written and spoken communication expected of a professional engineer. You will also construct a personal development plan (PDP) and an on-going employability skills folder. The assessment of the module is 100 per cent coursework, broken down as follows: oral presentation: 25 per cent; in-class essay: 25 per cent; PDP folder: 25 per cent; employability folder: 25 per cent. Not open to Associate Students or students from other departments. Electronic Engineering Mathematics 2 (Undergraduate) This module covers topics in engineering mathematics relevant to Electronics and Electrical Engineering programs: Vector Calculus (field theory, surface and volume integration, field operators), linear algebra (matrices and matrix operations, applications to systems of equations, reduced Row Echelon Form, determinants, Cramer's rule, eigenvalues and eigenvectors), differential equations (solving first and second order DEs).ResearchResearch Interests:See Charalampos Saitis’s research profile pages including details of research interests, publications, and live grants.SupervisionCurrent PhD funding opportunities for September 2023 entry include: AIM studentships for PhD in Artificial Intelligence and Music (opening date: November 2022; deadline: end January 2023) Applicants are encouraged to contact me before submitting their application – please send an email with your CV and draft research proposal. Suggested PhD topics include: Timbre tools for the digital instrument maker (for PhD in Artificial Intelligence and Music) Back to top",
  "content_length": 4281,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:24"
}