{
  "name": "Charles P. Martin",
  "homepage": "http://cs.anu.edu.au/people/charles-martin",
  "status": "success",
  "content": "Charles Martin | ANU School of Computing School Sharepoint College Sharepoint ANU College of Systems & Society Search this site Search this site (powered by Google) Powered by Google Close search Interests new interfaces for musical performance computational creativity smartphone/tablet musical instruments collaborative work co-creative interfaces improvisation computer music Research My research work is at the nexus of music technology, human-computer interaction and machine learning. I’m convinced that we can use computing systems to unlock new ways for people to be creative and enrich our everyday lives with new kinds of music and art. To do this, we need to imagine new kinds of computers, including embedding computers into new physical settings and to exploit machine learning to allow these computer systems to understand and interact with our complex creative activities. I’m available to supervise student projects in computational creativity, creativity support systems, music technology, and interactive systems. I’m interested in creating and studying new computing systems at the nexus of creative arts, physical embodiment, interaction, and intelligence. I’m currently searching for a PhD student to create intelligent musical instruments. If you’re interested in working with me, read about my lab and get in touch! :-) Biography Charles Martin a computer scientist specialising in music technology, musical AI and human-computer interaction. He develops musical apps such as MicroJam, and PhaseRings, researches creative AI, and performs music with Ensemble Metatone and Andromeda is Coming. At the ANU, Charles leads research into intelligent musical instruments. His lab’s focus is on developing new intelligent instruments, performing new music with them, and bringing them to a broad audience of musicians and performers. Charles was a postdoctoral fellow at the University of Oslo in the Engineering Prediction and Embodied Cognition (EPEC) project and the RITMO Centre for Interdisciplinary Studies in Rhythm, Time, and Motion from 2016–2019 where he developed new ways to predict musical intentions and performances in smartphone apps and embedded devices. Charles has a background in mathematics, computing, and music performance and has a classical percussion playing alter-ego. Teaching Charles is a committed educator and achieved recognition as a Senior Fellow of the Higher Education Academy (SFHEA) in 2023. At the moment, Charles is the convenor for the Human-Centred and Creative Computing minors, majors and specialisations and he is involved in teaching the following courses: COMP4350/COMP8350 Sound and Music Computing COMP1720/COMP6720 Art and Interaction Computing Activities & Awards Charles is involved in international research organisations related to music computing, HCI and creative AI. New Interfaces for Musical Expression conference Australasian Computer Music Association Chroma: Journal of the Australasian Computer Music Association bars search times",
  "content_length": 3023,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:34"
}