{
  "name": "Charles Albert Wüthrich",
  "homepage": "https://www.uni-weimar.de/de/medien/professuren/medieninformatik/grafische-datenverarbeitung",
  "status": "success",
  "content": "Bauhaus-Universität Weimar: Professur Grafische Datenverarbeitung Kontakt und Infos Prof. Dr. Charles A. Wüthrich Die Computer Graphics, Visualization and Man-Machine Communication Gruppe ist Teil der Medienfakultät an der Bauhaus-Universität Weimar seit 1994. Die Gruppe ist Mitbegründer dieser Fakultät. Seit seinen Anfängen hat sich der Lehrstuhl für graphische Datenverarbeitung für die Integration von Wissenschaftlern, Gestaltern und Künstlern in die wissenschaftliche Forschung eingesetzt und damit die alte Bauhaus-Tradition fortgesetzt, in der Kunst und Technik bzw. Handwerk eine Einheit bilden. Die Gruppe hat sich seit der Grundung der Fakultaet Medien immer wieder engagiert, um Kuenstler und Informatiker an gemeinsamen Projekten und an gemeinsame Forschung arbeiten zu lassen. Die dadurch entstehende Sinergien haben sich erwiesen als eine echte Bereicherung im Bereich der Computergrafik. Die Forschungsthemen der Gruppe sind:Theoretische Computergrafik: Abtastung von Lichtsignale, Rasterungsalgorithmen, Alternative Pixeldispositionen auf der Ebene, Volumengrafik.Computational Photography, Photographische Sensoren, Bildqualität.Wahrnehmung von Qualität in Digitalen und Analogen Bilder.Echtzeitsimulationen von elastischen Materialien.Naturgetreue L-Systeme für Pflanzenwachstumssimulationen.Echtzeit-Darstellung komplexer, anisotroper Materialien Prof. Dr. Charles A. Wüthrich Bauhausstr. 11, 99423 Weimar Telefon: +49 (0) 3643/58 37 12E-mail: charles.wuethrich[at]uni-weimar.de PersonenLehrePublikationenAbschlussarbeitenForschung Barrierefreiheit  Leichte Sprache Informationen über die Bauhaus-Universität Weimar. Kontrast-Einstellungen lesen Sie mehr über diese Einstellung Wechsel zwischen Farb- und Schwarz-Weiß-Ansicht Kontrastansicht aktiv Kontrastansicht nicht aktiv Anschalten Kontrastansicht einschalten Ausschalten Kontrastansicht ausschalten Darkmode für lichtsensitive Augen lesen Sie mehr über diese Einstellung Wechsel der Hintergrundfarbe von Weiß zu Schwarz Darkmode aktiv Darkmode nicht aktiv Ausschalten Darkmode deaktivieren Anschalten aktiviere Darkmode Klick- und Fokus-Feedback lesen Sie mehr über diese Einstellung Fokussierte Elemente werden schwarz hinterlegt und so visuell hervorgehoben. Feedback aktiv Feedback nicht aktiv Ausschalten Feedback ausschalten Anschalten Feedback einschalten Animationen auf der Website lesen Sie mehr über diese Einstellung Beendet Animationen auf der Website Animationen aktiv Animationen nicht aktiv Ausschalten Animationen abschalten Anschalten Animationen anschalten Schließen",
  "content_length": 2562,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:24"
}