{
  "name": "Charles Chuan Zhang",
  "homepage": "http://www.cs.ust.hk/~charlesz",
  "status": "success",
  "content": "Charles Zhang Charles Zhang Professor, Director of Cybersecurity Laboratory Department of Computer Science and Engineering (direction) The Hongkong University of Science and Technology Room 3002A in CYT Building Tel: (852)23586997 Fax: (852)23581477 I am looking for experienced programmer to join the Clearblue team as research sicentists. I am currently involved with the following: SPLASH 25 Clearblue [ Publications | Students | Teaching | Professional Activities | Bio | Fun] Highlights Congrats to Linghao on successfully defending his PhD thesis. Congrats to Linghao on his TOCS paper acceptance. This is an invited submission. Congrats to Yiyuan on defending his doctoral thesis! Congrats to Bangyan on defending his M.Phil thesis! Wei's work on kernel driver bug detection using static analysis has been accepted by Eurosys 25! Yongchao's work on redundancy reduction of value-flow summaries has been accepted by ICSE 25! Yuandao received Honorable Mention in 2024 Best PhD Thesis of our department. Yiyuan's work received ACM SIGSOFT Distinguished Paper Award! Maryam's work accepted by TSE. Her very first publication! Ling Hao's work received ASPLOS 2024 Best Paper Award! Research My general reseach interest centers around the use of both static and dynamic programm analysis techniques for making complex software systems more secure and reliable. The 10-million-line static analysis statement: \"to achieve all-sensitive precision and sublinear scalability while SIMULTANEOUSLY addressing the CODA requirements : achieve scalability by being continuous both in time, incremental, and in space, accumulative (Continuous); be open for defining customized source-code test cases through APIs or DSLs (Open); respect the fact that source code is largely unavailable(Dark code); understand assembled program dependency (Aassembled) introduced by frameworks and middleware. Our answer to these challenges is the Clearblue research project, a database-like software analysis platform. Clearblue analyzes software in its binary form with or without debug symbols, with or without sourcecode. It is capable, currently, of generating precise data flow information for Linux kernel, almost 30M lines of code, in 30 mins and materializes it on disk. Investigation tasks such as bug finding can be coded via the Clearblue API, on average, in 30 mins. Achievements Charles' research has received many awards and led to successful commercialization:ASPLOS 24 best paper, ICSE 24 distinguished reviewer, distinguished paper in ISSTA 24, OOPSLA 22, ICSE 19, and PLDI 13. ACM SIGSOFT Best PhD Dissertation 2013 (student Jeff Huang), Honorable Mention of Best PhD Dissertation of CSE in 2024 (Yuandao Cai) and 2022 (Peisen Yao), Huawei Distinguished Collaborator both 2022 and 2021 , Ant Group Outstanding Collaboration 2023 , start-up Sourcebrella acquired by Ant Group in 2020. Recent Papers Yiyuan Guo, Charles Zhang Efficient Strong Updates For Path Sensitive Data Dependence Analysis, In ICSE 2026:IEEE/ACM International Conference on Software Engineeringa, April 12-18 2026, Rio de Janeiro, Brazil Hao Ling, Yiyuan Guo, Charles Zhang Optimizer-Friendly Instrumentation for Event Quantification with PRUE Algorithm, In ASPLOS 26: ACM Conference on Architectural Support for Programming Languages and Operating Systems, March 22-26, 2026, Pittsburgh, USA Hao Ling, Heqing, Huang, Chengpeng, Wang, Yuandao Cai, Charles Zhang GiantSan: Efficient Operation-Level Memory Sanitization with Segment Folding In ACM TOCS: ACM Transactions on Computer Systems, to appear Anshunkang Zhou, Heqing Huang, Charles Zhang. KRAKEN: Program-Adaptive Parallel Fuzzing In ISSTA 2025:ACM SIGSOFT International Symposium on Software Testing and Analysis, Wed 25 - Sat 28 June 2025 Trondheim, Norway Hao Ling, Heqing Huang, Yuandao Cai, and Charles Zhang. Efficient Fuzzing Infrastructure for Pointer-to-Object Association. In ACM TOSEM: ACM Transaction of Software Engineering Methodologies, April, 2025 https://doi.org/10.1145/3730580 Wei CHEN, Bowen Zhang, Chengpeng Wang, Wensheng Tang, Charles Zhang Seal: Towards Diverse Specification Inference for Linux Interfaces from Security Patches In Eurosys 2025:the 20th European Conference on Computer Systems, Rotterdam, March 30 - April 3, 2025 Yongchao Wang, Yuandao Cai, Charles Zhang Boosting Path-Sensitive Value Flow Analysis via Removal of Redundant Summaries In ICSE 2025: 47th International Conference on Software Engineering Sun 27 April - Sat 3 May 2025 Ottawa, Ontario, Canada Maryam Masoudian, Heqing Huang, Morteza Amini, Charles Zhang Mole: Efficient Crash Reproduction in Android Applications with Enforcing Necessary UI Events In IEEE TSE: IEEE Transactions on Software Engineering. vol. 50, no. 8, pp. 2200-2218, Aug. 2024 Chengpeng Wang, Jipeng Zhang, Rongxin Wu, Charles Zhang DAInfer: Inferring API Aliasing Specifications from Library Documentation via Neurosymbolic Optimization In FSE 2024: ACM International Conference on the Foundations of Software Engineering, Mon 15 - Fri 19 July 2024 Porto de Galinhas, Brazil, Brazil Chengfeng Ye , Yuandao Cai, Anshunkang Zhou, Heqing Huang, Hao Ling, Charles Zhang Manta: Hybrid-Sensitive Type Inference Toward Type-Assisted Bug Detection for Stripped Binaries In ASPLOS 2024: ACM Conference on Architectural Support for Programming Languages and Operating Systems, San Diego, USA, April 27- May 1, 2024 Bowen Zhang, Wei Chen, Peisen Yao, Chengpeng Wang, Wensheng Tang, Charles Zhang SIRO: Empowering Version Compatibility in Intermediate Representations via Program Synthesis In ASPLOS 2024: ACM Conference on Architectural Support for Programming Languages and Operating Systems, San Diego, USA, April 27- May 1, 2024 (ACM SIGSOFT Distinguished Paper Award) Yiyuan Guo, Peisen Yao, and Charles Zhang Precise Compositional Buffer Overflow Detection via Heap Disjointness In ISSTA 2024:The 33rd ACM SIGSOFT International Symposium on Software Testing and Analysis, Vienna, Austria, 16-20 Sept, 2024 Peisen Yao, Jinguo Zhou, Xiao Xiao, Qingkai Shi, Rongxin Wu, Charles Zhang Efficient Path-Sensitive Data Dependence Analysis for Millions of Lines of Code In PLDI 2024:The 45nd ACM SIGPLAN Conference on Programming Language Design and Implementation, 24-28 June, 2024, Copenhagen, Denmark Chengfeng Ye, Yuandao Cai, Charles Zhang When Threads Meet Interrupts: Effective Static Detection of Interrupt-Based Deadlocks in Linux In USENIX Security 24:the 33nd USENIX Security Symposium, August 14-16, 2024, Philadelphia, PA, USA Anshunkang Zhou, Yikun Hu, Xiangzhe Xu, Charles Zhang ARCTURUS: Full Coverage Binary Similarity Analysis with Reachability-Guided Emulation, In ACM TOSEM:: ACM Transactions on Software Engineering and Methodology, 2024 Anshunkang Zhou, Chengfeng Ye, Heqing Huang, Yuandao Cai, Charles Zhang Plankton: Reconciling Binary Code and Debug Information, In ASPLOS 2024: ACM Conference on Architectural Support for Programming Languages and Operating Systems, San Diego, USA, April 27- May 1, 2024 (ASPLOS Best Paper Award) Hao Ling, Heqing Huang, Chengpeng Wang, Yuandao Cai, Charles Zhang GIANTSAN: Efficient Memory Sanitization with Segment Folding, In ASPLOS 2024: ACM Conference on Architectural Support for Programming Languages and Operating Systems, San Diego, USA, April 27- May 1, 2024 Heqing Huang, Anshunkang Zhou, Mathias Payer, Charles Zhang, Everything is Good for Something: Counterexample-Guided Directed Fuzzing via Likely Invariant Inference, In S&P'24: The 45th IEEE Symposium on Security and Privacy, San Francisco, USA, May 20-23, 2024 J. Gong, W. Zhang, C. Zhang and T. Wang, WFDefProxy: Real World Implementation and Evaluation of Website Fingerprinting Defenses In TIFS: IEEE Transactions on Information Forensics and Security, doi: 10.1109/TIFS.2023.3327662. Rongxin Wu, Yuxuan He, Jiafeng Huang, Chengpeng Wang, Wensheng Tang, Qingkai Shi, Xiao Xiao, and Charles Zhang. LibAlchemy: A Two-Layer Persistent Summary Design for Taming Third-Party Libraries in Static Bug-Finding Systems. In ICSE 2024: 46th International Conference on Software Engineering, April 14-20, Lisbon, Portugal. Wensheng Tang, Dejun Dong, Shijie Li, Chengpeng Wang, Peisen Yao, Jinguo Zhou, and Charles Zhang. Octopus: Scaling Value-Flow Analysis via Parallel Collection of Realizable Path Conditions. In TOSEM: ACM Transactions on Software Engineering and Methodology, Volume 33, Issue 3 Article No.: 66, Pages 1 - 33, March, 2024 Yuandao Cai, Yibo Jin, Charles Zhang. Unleashing the Power of Type-Based Call Graph Construction by Using Regional Pointer Information, In USENIX Security 24:the 33nd USENIX Security Symposium, August 14-16, 2024, Philadelphia, PA, USA Heqing Huang, Peisen Yao, Hung-Chun Chiu, Yiyuan Guo, Charles Zhang. Titan : Efficient Multi-target Directed Greybox Fuzzing, In S&P'24: The 45th IEEE Symposium on Security and Privacy, San Francisco, USA, May 20-23, 2024 View all publications Students I am fortunate to work with the following students: In progress: Yongchao Wang, Maryam Masoudian, Chengfeng Ye, Bowen Zhang, Yibo Jin, Wei Chen, Sixiang Peng, Shuhao Fu,Xiang Chen,Chenyang Sun, Qi Zhang, Yuanchen Gao Alumni with last known employment: Anshunkang Zhou Yiyuan Guo, Huawei Hao Ling, Tencent Wensheng Tang, Huawei Chengpeng Wang, Post Doc, Purdue, Yuandao Cai, Huawei Heqing Huang(Post Doc), Post Doc, ETH Peisen Yao , Assistant Professor, Zhejiang University Jiajun Gong, Post Doc, NUS Kexin Ma (M.Phil) Qingkai Shi (Ph.D), Ant Financial Gang Fan (Ph.D) , Staff Engineer, SourceBrella Inc., now at Ant Financial Rongxin Wu (Post-Doc), Associate Professor, Xiamen University Yepang Liu (Post-Doc), Assistant Professor, SUSTech Richard Xiao (Ph.D, Post-Doc), SourceBrella Inc. (Founder, CEO), now at Ant Financial Jinguo(Andy) Zhou (Post-Doc), SourceBrella Inc. (Co-Founder), now at Ant Financial Qirun Zhang (Post Doc) Assistant Professor, Georgia Tech Peng Liu (Ph.D), Researcher, IBM T.J.Watson Research Lab Jeff Huang (Ph.D), Assitant Professor, Texas A",
  "content_length": 13853,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:26"
}