{
  "name": "Charles K. Nicholas",
  "homepage": "http://www.csee.umbc.edu/~nicholas/charles_nicholas.html",
  "status": "success",
  "content": "Charles Nicholas Charles K. Nicholas Professor Department of Computer Science and Electrical Engineering Office: ITE 356 410-455-2594, -3969 fax nicholas@umbc.edu I received my B.S. in Computer Science from the University of Michigan - Flint in 1979, and the M.S. and Ph.D. degrees in Computer Science from Ohio State University in 1982 and 1988, respectively. I joined the Computer Science Department at the University of Maryland Baltimore County in 1988. My research interests include electronic document processing, intelligent information systems, and software engineering. In recent years I have focused on the problems of storing and retrieving information from large collections of documents. Intelligent software agents are an important aspect of this work. Here is a list of various publications available on-line. I do need to add some of my more recent work. A somewhat expanded version of the paper Randy Dahlberg and I presented at PODDP'98 Spotting Topics with the Singular Value Decomposition. The copyright for this paper is held by Springer-Verlag The paper Meta-data for Distributed Text Retrieval that Grace Crowder and I presented at the SIGIR'97 Workshop on Network Information Retrieval, Philadelphia, August 1997. The paper TKQML: A Scripting Tool for Building Agents presented at the conference Agent Theories, Architectures and Languages (ATAL'97), Providence, RI, July 1997. The poster session paper Agent Development Support for Tcl presented at the Fifth Tcl/Tk Workshop, Boston, July 1997. The paper Resource Selection in CAFE: An Architecture for Networked Information Retrieval that Grace Crowder and I presented at the SIGIR'96 Workshop on Network Information Retrieval, Zurich, August 1996. The paper Using Statistical Properties of Text to Create Metadata that Grace Crowder and I presented at the First IEEE Metadata Conference, April 1996. My SIGIR 95 Trip Report. Kenneth E. Rowe and Charles K. Nicholas, \"Reliability of WWW Name Servers\", presented at WWW'95, Darmstadt, Germany, April 1995. You can also see the HTML presentation I gave at WWW 95, and my WWW 95 Trip Report Intelligent Web Servers and the Automatic Construction of HTML Documents (with Jim Mayfield, UMBC Computer Science Technical Report 94-01, January 1994.) SNITCH: Augmenting Hypertext Documents with a Semantic Net (with Jim Mayfield, International Journal of Intelligent and Cooperative Information Systems, June 1993.) Canto: A Hypertext Data Model (with Linda Rosenberg, Electronic Publishing, June 1993.) (Authors' page proof - send e-mail for an offprint.) Category Theory as a Foundation for Document Processing (with Jim Mayfield and Jim Sasaki) On the Interchangeability of SGML and ODA (with L. Welsch, Electronic Publishing - Origination, Dissemination and Design, September 1992. ) I teach a variety of courses, including CS 201 Computer Science I, CS 331 Principles of Programming Languages, and topics courses. I am involved in the ACM's International Conference on Information and Knowledge Management (CIKM) I volunteer my time as system administrator at New Hope Lutheran Church, in Columbia, MD. I am also involved in the Via de Cristo.",
  "content_length": 3165,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:32"
}