{
  "name": "Charlie Obimbo",
  "homepage": "https://www.uoguelph.ca/computing/people/charlie-obimbo",
  "status": "success",
  "content": "Charlie Obimbo | School of Computer Science Charlie Obimbo ProfessorEmail: cobimbo@uoguelph.caPhone number: x52634Office: 150 Research Lane (Research Park), Suite 120, Office J / Reynolds 3310 Research StatementResearch KeywordsSelected Publications The primary focus of my research is Computer Systems Security and Intrusion Detection & Prevention Systems. We aim to create effective Systems which are able to detect and protect Network Intrusions effectively and in reasonable time. This is an important area in Computer Security as made evident by, recent events in the news, including, the recent heist of over 80 million US dollars from a number of banks in South Africa by over 100 people in Japan through ATMs and the alleged meddling in the recent US elections, by the hacking into and releasing of the DNC email. With customers of banks and various entities feeling vulnerable, consumer confidence is bound to go down and this can adversely affect the economy worldwide. Our main current focus has been using AI classification methods such as Support Vector Machines, Deep Learning and k-nearest neighbours to enable us classify network payloads so as to help a-priori detection and prevention of malicious payloads on the network. Our other focus is data encryption and cryptanalysis, which is an important aspect right now, especially with the ubiquitous use of mobile devices, and the attempt, both by Federal agents and Criminals to hack and have back-doors to our devices (whether for purposes of security or malice). The third aspect of our research is using differential privacy (epsilon-differential privacy) to ensure continued privacy and anonymity when large datasets are used from individual data in Research. Intrusion Detection Privacy Preservation Cryptography Algorithm Analysis and Design Zaman, A., Obimbo, C., & Dara, R. (2018).  Information Disclosure, Security, and Data Quality.   Lecture Notes in Computer Science, 768-779. Yousefi, J., Data, R., & Obimbo, C. (in press, 2018).  A synergistic approach to enhance the accuracy-interpretability trade-off of the NECLASS classifier for skewed data distribution.   10th International Joint Conference on Computational Intelligence (IJCCI). Zaman, A., Obimbo, C., & Dara, R. (2017).  An improved differential privacy algorithm to protect re-identification of data.   IEEE Canada International Humanitarian Technology Conference (IHTC), 133-138. Obimbo, C. & Nyakundi, E. (2017).  Comparison of SVMs with Radial-Basis function & Polynomial Kernels in Classification of Categories in Intrusion Detection.   International Conference on Security and Management, CSREA Press, 240 - 246. Obimbo, C., Ali, K., & Mohamed, K. (2017).  Using IDS to prevent XSS Attacks.   International Conference on Security and Management, CSREA Press, 233 - 239. Zaman, A., Obimbo, C., & Dara, R. (2017).  An Improved Data Sanitization Algorithm for Privacy Preserving Medical Data Publishing.   Advances in Artificial Intelligence: Proceedings of the Conference of the Canadian Society for Computational Studies of Intelligence, 10233, Edmonton, Alberta: Springer International Publisher, 64-70. Obimbo, C. (2017).  Setting MCQs that Adhere to Given Course Learning Outcomes for an Algorithms Class.  In Hamid R. Arabnia, Leonidas Deligiannidis, Fernando G. Tinetti (Ed.)   International Conference on Frontiers in Education: Computer Science and Computer Engineering, CSREA Press, 128-133. Zaman A. N. K., Obimbo C., Dara R. A Novel Differential Privacy Approach that Enhances Classification Accuracy. Proceedings of the Ninth International C* Conference on Computer Science & Software Engineering (C3S2E), July 20-22, 2016, will be held in Porto, Portugal. Sharma, S., Swayne, D., & Obimbo, C. (2015). Identification of concurrent control chart patterns in time series. International Journal of Innovative Research in Science Engineering & Technology, 1-17. Accepted for publication. Benjamin Ferriman and Charlie Obimbo, Solving For The RC4 Stream Cipher State Register Using A Genetic Algorithm. International Journal of Advanced Computer Science and Applications (IJACSA), 5(5), 2014. http://thesai.org/Downloads/Volume5No5/Paper_33-Solving_for_the_RC4_stream_cipher_state_register.pdf. pp 216 - 223. DOI: 12.14569/IJACSA.2013.041206. Sharma, S., Swayne, D. A., & Obimbo, C. (2015).  Automating the Smoothing of Time Series Data.   Journal of Environmental & Analytical Toxicology, 5 (5), 216 - 223, doi: 10.4172/2161-0525.1000304. Zaman, A. N. K. & Obimbo, C. (2014).  Privacy Preserving Data Publishing.  International Journal of Advanced Computer Science and Applications, 5 (5), 216 - 223, doi: 10.14569/IJACSA.2013.041206. Share this page Share on Facebook Share on Twitter Share on LinkedIn Print this page",
  "content_length": 4771,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:40"
}