{
  "name": "Charles E. Leiserson",
  "homepage": "http://people.csail.mit.edu/cel",
  "status": "success",
  "content": "Charles E. Leiserson : HomePage Charles E. Leiserson's MIT Homepage Charles E. Leiserson is Professor of Computer Science and Engineering at MIT. He holds the position of Edwin Sibley Webster Professor in MIT's Department of Electrical Engineering and Computer Science (EECS). He was selected as a Margaret MacVicar Faculty Fellow, the highest recognition at MIT for undergraduate teaching. He is a member and former Associate Director and Chief Operating Officer of MIT's Computer Science and Artificial Intelligence Laboratory (CSAIL), a member of the Lab's Theory of Computation Group (TOC), and head of the Lab's Supertech Research Group. Professor Leiserson is a member of the National Academy of Engineering and a Fellow of four professional societies: ACM, AAAS, SIAM, and IEEE. Contact information Curriculum vitae (including biography) Research Publications Workshop on Leadership Skills for Engineering and Science Faculty FAQ Information about Professor Leiserson's textbook Introduction to Algorithms can be obtained at The MIT Press website. If you are interested in Professor Leiserson's workshop on Leadership Skills for Engineering and Science Faculty, taught jointly with management consultant Chuck McVinney, please visit the MIT Professional Education Program website. This article in Nature describes the workshop and why technical academic leaders need human-centered leadership skills. Professor Leiserson received the 2014 ACM-IEEE Computer Society Ken Kennedy Award for his “enduring influence on parallel computing systems and their adoption into mainstream use through scholarly research and development.” He was also cited for “distinguished mentoring of computer science leaders and students.” The award was presented at SC14 on Tuesday, November 18, 2014, in New Orleans. Professor Leiserson received the 2014 IEEE Computer Society Taylor L. Booth Education award for “worldwide computer science education impact through writing a best-selling algorithms textbook and developing courses on algorithms and parallel programming.” Professor Leiserson and his former Ph.D. student Robert D. Blumofe were awarded the 2013 ACM Paris Kanellakis Theory and Practice Award for “contributions to robust parallel and distributed computing.”",
  "content_length": 2258,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:29"
}