{
  "name": "Charles Rich",
  "homepage": "http://www.cs.wpi.edu/~rich",
  "status": "success",
  "content": "Charles Rich Charles Rich Flipping a Crepe (Compare to Kormushev robot) Charles Rich is a Professor Emeritus in the Computer Science department and a member of the associated faculty of the Interactive Media and Game Development, Robotics Engineering and Learning Sciences & Technology programs at Worcester Polytechnic Institute. He was previously Distinguished Research Scientist and a founding member of Mitsubishi Electric Research Laboratories. Rich earned his Ph.D. at the MIT Artificial Intelligence Laboratory, where he was a founder and director of the Programmer's Apprentice project. He is a Fellow and past Councilor of the Association for the Advancement of Artificial Intelligence, a Senior Member of the IEEE, as well as having served as chair of the 1992 International Conference on Principles of Knowledge Representation and Reasoning, cochair of the 1998 National Conference on Artificial Intelligence, program cochair of the 2004 and general cochair of the 2010 International Conference on Intelligent User Interfaces, and program cochair of the 2011 International Conference on the Foundations of Digital Games. MERL 25th Anniversary Aaron, Me and Melvin Teaching: See previously taught courses Research: A Unified Theory of Learning, Doing and Teaching Hierarchical Tasks Collaborative Robot Learning from Demonstration Using Hierarchical Task Networks Always-On Relational Agents for Social Support of Older Adults Engagement and Collaboration in Human-Robot Interaction AIPaint: A Sketch-Based Behavior Tree Authoring Tool Robots and Avatars as Hosts, Advisors, Companions and Jesters (photos and videos accompanying the Spring 2009 AI Magazine article) Disco collaborative dialogue manager (GitHub repository) Disco for Games (D4g) ANSI/CEA-2018 Task Model Description CETask 1.0 reference implementation. Other Information: Official faculty page Curriculum Vitae DBLP citation index (incomplete) News release when I joined WPI",
  "content_length": 1951,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:35"
}