{
  "name": "Charalambos Christou",
  "homepage": "https://www.unic.ac.cy/christou-charalambos",
  "status": "success",
  "content": "Dr Charalambos Christou - University of Nicosia Skip to content APPLY Dr Charalambos Christou Dr Charalambos Christou Associate Professor School of Sciences and Engineering Department of Computer Science Member of the Senate 22 841651 [email protected] Central Building›2nd Floor›B211 Brief CVFull CV Research Profile Dr Charalambos Christou is an Associate Professor at the University of Nicosia, Cyprus. Dr Christou earned his BSc, MSc and PhD in Electrical and Computer Engineering from New Jersey Institute of Technology, New Jersey, USA. He served as a University Senator, representing the School of Sciences and Engineering from 2007 to 2016. He served as the Head of the Computer Science Department from 2011 to 2016. He worked in the USA as an IT Consultant, as a Visiting Adjunct Professor at New Jersey Institute of Technology and as a Lecturer at Essex County College. He has conducted extensive work in the area of Parallel Computers / Parallel Processing, E-learning and ICT, and participated as a researcher in several projects funded by the EU or the Research Promotion Foundation of Cyprus. He has served as a reviewer/organizer for several International Conferences. His research work has been published in international conference proceedings, books and journals. UNIC NICOSIA46 Makedonitissas Avenue, CY-2417P.O. Box 24005, CY-1700Nicosia, CyprusPhone.: +357 22 841500Email: [email protected] UNIC ATHENSNo. 17, 29th StreetElliniko 167 77Athens, GreecePhone:  +30 210 6748293Email: [email protected] USEFUL LINKSAll Academic ProgrammesUNIC Brand CentreUNIC in the NewsVerify a CertificateCareers at UNIC CONNECT WITH UNICSubscribe to NewslettersCopyright © University of Nicosia. All Rights Reserved | Privacy Policy | Terms & Conditions Page load link Live chat is available. Activate it by agreeing to the use of marketing cookies here. Please refresh the page after activation. × Go to Top",
  "content_length": 1911,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:24"
}