{
  "name": "Charles Isbell",
  "homepage": "http://www.cc.gatech.edu/fac/Charles.Isbell",
  "status": "success",
  "content": "Charles Isbell, Industrious Researcher (once) at: Georgia Tech about.... pfunk lab academics publications classes sponsors Charles L. Isbell, Jr. Once Dean Now Provost Still Professor What do I do? I do a lot of things. Let's talk about research for a second, though. Although I tend to focus on statistical machine learning, my research passion is actually artificial intelligence. I like to build large integrated systems, so I have also tended to spend a great deal of my time doing research on autonomous agents, interactive entertainment, some aspects of HCI, software engineering, and even programming languages. I think of my field as interactive artificial intelligence. My fundamental research goal is to understand how to build autonomous agents that must live and interact with large numbers of other intelligent agents, some of whom may be human. Progress towards this goal means that we can build artificial systems that work with humans to accomplish tasks more effectively; can be more robust to changes in environment, relationships, and goals; and can better co-exist with humans as long-lived partners. After thinking about this problem for a number of years, I've decided that the central technical issues here are: adaptive modeling, especially activity discovery (as distinct from activity recognition); and scalable interaction, including coordination and influence. Further, I have come to believe that as a practical matter, it is necessary to build development environments that support rapid development, and so I try to think seriously about authorial tools, including adaptive programming languages, domain-specific example-driven development, socially-guided machine learning, and corresponding issues in software engineering. All in all, I believe that there are many opportunities in this space, and it should interest anyone who cares about any of the areas I mention above. To that end, I have spent time building The Laboratory for Interactive Artificial Intelligence and the pfunk research group. Our research goal is to develop methodologies for building persistent, adaptive, collaborative, and believable agents that must live with other similar agents, including humans. It is also worth pointing out that I have developed a strong interest in (re)defining Computing as a separate and vivid discipline. This has most obviously manifested itself in my efforts at curricular development and reform. Possibly related to these efforts, I was the Associate Dean of Academic Affairs in the College for a number of years before becoming the Senior Associate Dean and eventually the Executive Associate Dean (where I retained my role in Academic Affairs while overseeing a lot of the operations of the College). I was lucky enough to serve as the fourth John P. Imlay, Jr. Dean of the College. After four years doing that, I became the Provost at University of Wisconsin-Madison. Definitely related to these efforts, I have put a great deal of energy into thinking about access at all levels, with an eye toward broadening participation in the professoriate. I don't have dozens of papers in this space, but I care about it as deeply as I do my AI research and all the rest that I do. Generally speaking, I split my time among my professor and admin selves because I think efforts around operationalizing and supporting broad access deserve as much intellectual energy and thought as any of our other academic efforts. Where do I come from? I claim that I'm from Atlanta. I even went to college in Atlanta, at what is now Ga Tech's College of Computing. After graduating in 1990, I found myself at MIT's AI Lab (now CSAIL) pursuing a PhD and learning all about machine learning. For my dissertation, I developed a novel algorithm for inferring sparse, multi-level structure from a large collection of electronically available text. This was done in an unsupervised way, using principles from statistics and information theory. My advisors were Rod Brooks and Paul Viola. They are the first in a long line of illustrious academic ancestors, including Galileo, Copernicus, Jacobi, and Hess (no Bayes, alas). After graduation I ended up at AT&T Shannon Labs, where I spent many fruitful years working with a slew of luminaries in machine learning (who happen to be spectacularly wonderful folks to boot). I left the Labs in the spring of 2002 in what has become known as the Great AT&T Labs Diaspora. I spent that summer hanging out at the University of Pennsylvania working with some good friends and colleagues of mine (most notably Michael Kearns and Lawrence Saul) on a variety of fun stuff. I eventually edned up back at Ga Tech, doing the faculty thing and reveling in the ongoing irony that is faculty life. I was awarded tenure (you should see what my students did to my office) and not too long after promoted to Professor, so I've decided that the academy is, in fact, a perfectly fair and meritocratic institution. …or at least it can come closer and closer to that if we work hard at it all the time. Do I have a life? Why, yes... yes I do... or did at any rate. Although research is obviously its own reward, I have pursued a truly ridiculous slew of hobbies over the years. For example, I sometimes wrote Hip Hop Reviews; used to run The Annual New Jack Hip Hop Awards; ran the funky-music and hiphop mailing lists; and for more than 15 years maintained the This Week In Black History page and calendar (I believe it was one of the first online databases of its kind). I sometimes interact with the physical world, doing things like racquetball, reading (I have several thousand more than 20,000 comic books because, well, of course I do), and ultimate frisbee. I have a family, too, or so they tell me.",
  "content_length": 5745,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:30"
}