{
  "name": "Charles Dierbach",
  "homepage": "https://www.towson.edu/fcsm/departments/computerinfosci/facultystaff/cdierbach.html",
  "status": "success",
  "content": "Charles Dierbach | Towson University Skip to Main Content Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Give to TU Calendars & Events Directories SearchSearch Towson University Visit TU Apply Now Request Information Facts & Figures Mission & Strategic Plan Rankings & Achievements Administration Commitment to Diversity & Inclusion Accessibility Sustainability Consumer Information & Accreditation Visit TU Apply Now Request Information Undergraduate Studies Graduate Studies Accelerated Programs Research International Initiatives Colleges & Departments Off-Campus Locations Extended & Professional Education Summer Session Academic Services & Resources Commencement Visit TU Apply Now Request Information Undergraduate Admissions Graduate Admissions Tuition & Expenses Financial Aid Counselor & Advisor Resources Visit Campus Apply Now Request Information Visit TU Apply Now Request Information Student Involvement Housing & Dining Student Services & Resources Health & Well-being Safety & Security New Student & Family Programs Visit TU Apply Now Request Information Anchor Mission BTU-Partnerships for Greater Baltimore Business & Public Engagement Community Programs & Resources Arts & Culture Campus Landmarks & Features Planning Events & Conferences at TU Towson University SearchSearch Menu SearchSearch Go Back About TU Academics Admissions & Aid Student Life Campus & Community Information For Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Visit TUApply NowRequest Information Give to TU Calendars & Events Directories Charles Dierbach Associate Professor & Interim Program Director, B.S. Computer Science Contact Info Phone: 410-704-3552 Office: YR-495 Email: cdierbach@towson.edu Education Ph.D., Computer Science, University of Delaware, 1991 Areas of Expertise Artificial Intelligence (Analogical Reasoning), Object-Oriented Design, Computer Science Education Scholarship, Creative Activity: Author of the textbook \"Introduction to Computer Science Using Python: A Computational Problem-Solving Focus\", John Wiley, 2013. Professional Service: Program evaluator for ABET (Accreditation Board for Engineering and Technology) Selected Publications and Presentations: James Braman, Charles Dierbach, âUtilizing Virtual Worlds for Personalized Search: Developing the PAsSIVE Framework,â Proceedings of HCI International 2015, August 2-7, 2015, Los Angeles, CA, pp. 3-11. Charles Dierbach, Harry Hochheiser, Samuel Collins, et. al. âA Model for Piloting Pathways for Computational Thinking in a General Education Curriculum,â Proceedings of SIGCSE 2011, March 9-12, 2011, Dallas, TX,  pp. 257-262. James Braman, Charles Dierbach, âUsing Second Life as an Interface for Personalized Search.â In SLActions: Research Conference in the Second Life World. November 18-19, 2010. Braman, J., Dierbach, C. (2010). Second Life as a Context for Personalized Search. 7th International Conference on Cybernetics and Information Technologies, Systems and Applications (CITSA 2010). Oral Presentation. Conference Proceedings, June 29-July 2 2010, Orlando, FL, pp. 230-235. Charles Dierbach, âThe Use of Collaborative Meta-Agents in Multi-Agent Systems,â Technical Report of the AAAI Fall Symposium on Interaction and Emergent Phenomena in Societies of Agents,â October 12-15, 2006, Arlington, Virginia, pp. 82-87. Charles Dierbach, âApplication of the Abstractional Concept Mapping Theory for the Interpretation of Novel Metaphor,â Proceedings of the 6th International Conference on Software Engineering, Artificial Intelligence, Networking, and Parallel/Distributed Computing (SNPD 2005), May 23-25, Towson, Maryland, pp. 157-162. C. Dierbach, B. Taylor, H. Zhou, and I. Zimand, âExperiences with a CS0 Course Targeted for CS1 Success,â Proceedings of the Thirty-Sixth SIGCSE Conference on Computer Science Education, February 23-27, 2005, St. Louis, MO, pp. 317-320. Direct Edit JS for Moving Direct Edit Button into place.",
  "content_length": 5575,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:27"
}