{
  "name": "Charless C. Fowlkes",
  "homepage": "http://www.ics.uci.edu/~fowlkes",
  "status": "success",
  "content": "charless c. fowlkes - uc irvine - computer vision charless c. fowlkes professor computer science uc irvine fowlkes@uci 4076 dbh 949.824.6945 uci : cs : vision group home publications presentations cv My research is in computational vision, in particular how to integrate mechanisms for visual recognition and perceptual organization with 3D scene understanding. We apply these computational models to a variety of problems including development of tools for biological image and shape analysis in neuroscience, animal development and palynology as well as applications to forensic science. some research highlights: S. Shafique, S. Kong, C. Fowlkes, \"CriSp: Leveraging Tread Depth Maps for Enhanced Crime-Scene Shoeprint Matching\", ECCV, (Sept. 2024) arXiv:2404.16972 [code] [data] Y. Zhao, H. Ma, S. Kong, C. Fowlkes, \"Instance Tracking in 3D Scenes from Egocentric Videos\", CVPR, (June 2024) arXiv:2312.04117 [pdf] Y. Dukler, A. Achille, H. Yang, B. Bowman, V. Vivek, L. Zancato, A. Ravichandran, C. Fowlkes, A. Swaminathan, S. Soatto, \"Your representations are in the network: composable and parallel adaptation for large scale models\", NeurIPS, (Dec. 2023) [pdf] H. Li, C. Fowlkes, H. Yang, O. Dabeer, Z. Tu, S. Soatto, \"Guided recommendation for model fine-tuning\", CVPR, (June 2023) [pdf] S. Shafique, B. Kong, S. Kong, C. Fowlkes, \"Creating a Forensic Database of Shoeprints from Online Shoe Tread Photos\", WACV (Jan. 2023) arXiv:2205.02361 Y. Zhao, C. Barnes, Y. Zhou, E. Shechtman, S. Amirghodsi, C. Fowlkes, \"GeoFill: Reference-Based Image Inpainting of Scenes with Better Geometric Understanding\", WACV (Jan. 2023) arXiv:2201.08131 M. Wallingford, H. Li, A. Achille, A. Ravichandran, C. Fowlkes, R. Bhotika, S. Soatto, \"Task Adaptive Parameter Sharing for Multi-Task Learning\", CVPR, (June 2022), arXiv:2203.16708 C. Zhu, P. Rajendran, P. Hanna, I. Efimov, G. Salama, C. Fowlkes, K. Shivkumar, \"High resolution structure-function mapping of intact hearts reveals altered sympathetic control of infarct border zones\", JCI Insight, (2022), 7(3):e153913. 10.1172/jci.insight.153913 Z. Li, A. Ravichandran, C. Fowlkes, M. Polito, R. Bhotika, S. Soatto \"Representation Consolidation for Training Expert Students\", Technical Report (July 2021), arXiv:2107.08039 Y. Zhao, S. Kong, C. Fowlkes, \"Camera Pose Matters: Improving Depth Prediction by Mitigating Pose Distribution Bias\", CVPR, (June 2021) arXiv:2007.03887 Z. Cai, A. Ravichandran, S. Maji, C. Fowlkes, Z. Tu, S. Soatto \"Exponential Moving Average Normalization for Self-supervised and Semi-supervised Learning\", CVPR, (June 2021) arXiv:2101.08482 I. Romero, S. Kong, C. Fowlkes, C. Jaramillo, M. Urban, F. Oboh-Ikuenobe, C. D'Apolito, S. Punyasena, \"Improving the taxonomy of fossil pollen using convolutional neural networks and superresolution microscopy\", Proc. of the National Academy of Sciences (PNAS) Oct 2020, 202007324. DOI:10.1073/pnas.2007324117 Y. Zhao, S. Kong, D. Shin, C. Fowlkes, \"Domain Decluttering: Simplifying Images to Mitigate Synthetic-Real Domain Shift and Improve Depth Estimation\", CVPR, (June 2020) [pdf] [project] arXiv:2002.12114 C. Huh, K. Abdelaal, K. Salinas, D. Gu, J. Zeitoun, D. Velez, J. Peach, C. Fowlkes, S. Gandhi, \"Long-term monocular deprivation during juvenile critical period disrupts binocular integration in mouse visual thalamus\", Journal of Neuroscience, (Nov. 2019) 10.1523/JNEUROSCI.1626-19.2019 D. Shin, Z. Ren, E. Sudderth, C. Fowlkes, \"3D Scene Reconstruction with Multi-layer Depth and Epipolar Transformers\", ICCV (Oct. 2019) [pdf] [project] arXiv:1902.06729 A. Achille, M. Lam, R. Tewari, A. Ravichandran, S. Maji, C. Fowlkes, S. Soatto, P. Perona, \"Task2Vec: Task Embedding for Meta-Learning\", ICCV (Oct. 2019) [pdf] arXiv:1902.03545 Z. Wang, L. Chen, S. Rathore, D. Shin, C. Fowlkes, \"Geometric Pose Affordance : 3D Human Pose with Scene Constraints\", (May 2019). arXiv:1905.07718 full list of publications here... students: current academic advisees and lab members Edward Li (PhD, co-advised with Alex Berg) Xinxuan Lu (PhD, co-advised with Alex Berg) Daeyun Shin (PhD) past academic advisees Samia Shafique (PhD, 2024) now at Google Yunhan Zhao (PhD, 2024) now at Google Viktor Liviniuk (MS, 2022) now at Nuro Alina Liviniuk (MS, 2022) now at Pinterest Zhe Wang (PhD, 2021) now at Cruise Chinmayee Athalye (MS, 2020) Linfeng Wang (MS, 2020) Shaurya Rathore (MS, 2020) Ryan Sivoraphonh (BS, 2020) Shu Kong (PhD, 2019) now faculty at University of Macau. Minhaeng Lee (PhD, 2019) now at Apple Liyan Chen (BS, 2019) now at UT Austin Bailey Kong (PhD, 2018) Phuc Nguyen (PhD, 2018) now at Google Dongxu Zhao (MS 2018) now at UNC Chapel Hill Jasmine Bhanushali (MS, 2018) now at Microsoft Maharshi Patel (BS, 2017) now at Microsoft Golnaz Ghiasi (PhD, 2016) now at Google Research Raúl Díaz (PhD, 2016) now at Amazon Sam Hallman (PhD, 2015) now at Amazon Gio Borje (BS, 2015) now at LinkedIn Samreen Anjum (MS, 2014) now at Qatar Computing Research Institute Shaofei Wang (MS, 2013) now at U Penn Jason Lee (BS, 2013) now at OCLARO Julian Yarkony (PhD,2012) now at Experian Data Lab Matthew Nease (BS, 2012) now at Edmunds Shu-Chi Hsu (MS, 2012) Ragib Morshed (MS, 2011) now at Amazon Nityananda Jayadevaprakash (MS, 2010) now at Apple Sangeeta Jha (MS, 2010) now at Intel Tony Tran (MS, 2009) now at Uber Dennis Park (MS, 2009) now at Vicarious past co-advisees and visitors Michelle Ngo (MCBS rotation, 2018) Katiana Khouri (MCBS rotation, 2017) Yoon Jung (BS, 2017) Michael Chiang (PhD w/Olivier Cinquin, 2015) Joseph Nash (CCBS rotation, 2015) Hyeoungho Bae (PhD w/Pai Chu, 2013) now at Microsoft Yihang Bo (visiting PhD, 2010-2011) now at Beijing Film Academy awards: UCI Chancellors fellow (2019-2022) American Staistical Society SPAIG award for building a statistically sound and scientifically solid foundation for the analysis and interpretation of forensic evidence. Helmholtz Prize in 2015 for significant impact in computer vision with our paper: \"A Database of Human Segmented Natural Images and its Application to Evaluating Segmentation Algorithms and Measuring Ecological Statistics\", D. Martin, C. Fowlkes, D. Tal, J. Malik. ICCV 2001 [pdf] Award for Teaching Excellence in Undergarduate Education, UCI ICS, 2014 National Science Foundation CAREER Award, 2013 Marr Prize in 2009 for our paper: \"Discriminative models for multi-class object layout\", C. Desai, D. Ramanan, C. Fowlkes. ICCV 2009 [pdf] teaching: cs 116 : computational photography and vision [2010-present] cs 117 : project in computer vision[2009-present] cs 216 : image understanding [2008-present] cs 217 : light and geometry in vision [2010-present] ics 162 : modeling and world building [f12,s14,f15] cs 295 : research topics in vision [s09,w10,w11] cs 177 : applications of probability in computer science [s08] funding: My research is currently supported by: National Science Foundation ( DBI 2434867 ) previously: DARPA Perceptually-enabled Task Guidance Program (PTG) NIST CSAFE: Center for Statistics and Applications in Forensic Evidence NIH ( NIBIB R25:EB022366, OD OT2:OD024899, NIA R01AG057748 OD OT2:OD023848, ) National Science Foundation ( DBI-1053036, DBI-1262547, IIS-1618806, IIS-1253538 IIS-1813785, CNS-1730158 ) Funding from Adobe Funding from Qualcomm Research Hardware donation from NVIDIA Google Research Award UC Labs Research Program service and meetings/workshops organized: Area chair for CVPR (2010,2012,2016,2017,2019,2020,2021,2023), ICCV (2015,2017,2019), ECCV (2016,2018), ISMB (2016) Associate editor for IEEE TPAMI (2018-), CVIU (2016-2019), IEEE/ACM TCBB (2015-2018) USA-Sino Summer School in Vision, Learning, Pattern Recognition (VLPR 2012) Fudan Unviersity, Shanghai, China July 2012. The Eighth Workshop on Perceptual Organization in Computer Vision (POCV 2012), CVPR, Providence, RI. Southern California Computer Vision Meetup (2009-2012) Big Data Image Processing and Analysis (2016-2018).",
  "content_length": 7932,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:39"
}