{
  "name": "Charles Yuan",
  "homepage": "https://pages.cs.wisc.edu/~charlesyuan",
  "status": "success",
  "content": "Charles Yuan — Computer Science, UW–Madison Morgridge Hall, UW–Madison Charles Yuan I’m an assistant professor of computer science at UW–Madison, where I am a member of the madPL and quantum computing groups. I’m recruiting Ph.D. students in 2025–2026! If you’re interested, I encourage you to understand my approach to advising, read my work, learn about Madison, and apply. New faculty do not appear in the list of CS faculty in the application. Instead, select Prof. Swamit Tannu, type my name under “Other” faculty, and mention me in your statement. Contact Email ude.csiw.sc@nauyselrahc or find me in Morgridge 7663. Research My group studies how to program a quantum computer to realize quantum algorithms. Quantum computers promise incredible speedups for tasks such as simulation, search, and optimization. However, achieving this speedup in practice forces us to fundamentally rethink the abstractions, such as data structures and control flow, that we use to write algorithms as programs. Our research thus builds a software stack of languages and compilers to work with and reason about quantum information. Teaching I teach a graduate seminar on programming quantum computers this fall. Service I am on the PC for PLDI 2026 and PLanQC 2026 and ERC for ASPLOS 2026. Advisees Shengyuan Yang (Ph.D.) Biographical Here are my CV and Google Scholar. I completed my Ph.D. at MIT CSAIL with Michael Carbin. I’ve worked at Google Quantum AI and Hudson River Trading. Latest Preprints Cobble: Compiling Block Encodings for Quantum Computational Linear Algebra. Charles Yuan. Preprint, 2025. (arXiv) Highlight How do we practically implement quantum algorithms for linear algebra given that they cannot efficiently store large datasets in memory? We present a language to express and manipulate quantum representations of matrices as high-level programs, compile them to correct circuits, and estimate and optimize their resource usage. Quantum Assertion Testing Without Mid-Circuit Measurement: Strategies and Lower Bounds. Shengyuan Yang, Charles Yuan. Extended abstract, 2025. (paper) Foundational Abstractions for Quantum Programming. Charles Yuan. Ph.D. thesis, 2025. (paper) Selected Publications The T-Complexity Costs of Error Correction for Control Flow in Quantum Computation. Charles Yuan, Michael Carbin. Appeared in PLDI 2024. (arXiv) (BibTeX) (video) Highlight What limits how fast a program can run on a quantum computer that uses an error-correcting code as needed in practice? We show how the quantum version of an if-statement can introduce an asymptotic slowdown that diminishes the speedup of an algorithm, and present an optimizing compiler that recovers efficient programs. Quantum Control Machine: The Limits of Control Flow in Quantum Programming. Charles Yuan, Agnes Villanyi, Michael Carbin. Appeared in OOPSLA 2024. (arXiv) (BibTeX) (video) (press) Highlight Can we program a quantum computer using the same abstractions for control flow, such as conditional branches and loops, as on a classical computer? We prove that the answer is no – this would destroy the speedup of the quantum algorithm – and present a new instruction set for correctly realizing control flow in quantum algorithms. Tower: Data Structures in Quantum Superposition. Charles Yuan, Michael Carbin. Appeared in OOPSLA 2022. (arXiv) (BibTeX) (video) Distinguished Artifact Award. Highlight How do we implement a data structure, such as a list, set, or dictionary, on a quantum computer? We present a programming language for working with pointers stored in the states of qubits in superposition. Using it, we build a quantum library of data structures that developers can invoke to realize quantum algorithms that rely on them. Twist: Sound Reasoning for Purity and Entanglement in Quantum Programs. Charles Yuan, Chris McNally, Michael Carbin. Appeared in POPL 2022. (arXiv) (BibTeX) (video) (press) Highlight How do we reason about the impact of entanglement, or “spooky action at a distance,” on the correctness of a quantum program? We present a language and type system for a concept of purity that identifies unintuitive behavior caused by entangled quantum data, and illustrate how this system can catch bugs in quantum programs. Additional Publications Codesign of Error-Correcting Codes and Modular Chiplets in the Presence of Defects. Sophia Lin, Joshua Viszlai, Kaitlin Smith, Gokul Ravi, Charles Yuan, Frederic Chong, Benjamin Brown. Appeared in ASPLOS 2024. (arXiv) Semi-Symbolic Inference for Efficient Streaming Probabilistic Programming. Eric Atkinson, Charles Yuan, Guillaume Baudart, Louis Mandel, Michael Carbin. Appeared in OOPSLA 2022. (arXiv) Statically Bounded-Memory Delayed Sampling for Probabilistic Streams. Eric Atkinson, Guillaume Baudart, Louis Mandel, Charles Yuan, Michael Carbin. Appeared in OOPSLA 2021. (arXiv) Preprints and Peer-Reviewed Workshop Papers Expressing and Analyzing Quantum Algorithms with Qualtran. Matthew Harrigan, Tanuj Khattar, Charles Yuan, Anurudh Peduri, Noureldin Yosri, Fionn Malone, Ryan Babbush, Nicholas Rubin. Preprint, 2024. (arXiv) Analyzing Quantum Programs Using the Power of Interaction. Agnes Villanyi, Charles Yuan, Chris McNally. Appeared at PLanQC at ICFP 2022. (paper) (video) Probabilistic Inference for Quantum Programs. Charles Yuan, Yipeng Huang, Michael Carbin. Appeared at I2Q at ISCA 2021. (paper) BLT: Exact Bayesian Inference with Distribution Transformers. Charles Yuan, Jan Hoffmann. B.S. thesis, 2019. (paper) Allen Newell Award (Best Undergraduate Thesis). â Back to top",
  "content_length": 5558,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:36"
}