{
  "name": "Chebiyyam Siva Ram Murthy",
  "homepage": "http://www.cse.iitm.ac.in/~murthy",
  "status": "success",
  "content": "C. Siva Ram Murthy's Homepage C.Siva Ram Murthy  (Currently, Visiting Professor of Computer Science at IIT Hyderabad) Fellow of  INAE, NASI, INSA, TWAS, IEEE Richard Karp Institute Chair Professor Department of Computer Science and Engineering IIT Madras, Chennai 600036, India Tel: +91-44-22574361        Fax: +91-44-22574352 Email: murthyαiitmβacβin (where α = @ and β = .) Biographical Sketch C.Siva Ram Murthy earned his B.Tech. degree in Electronics and Communication Engineering from Regional Engineering College (now National Institute of Technology), Warangal in 1982, M.Tech. degree in Computer Engineering from the Indian Institute of Technology (IIT), Kharagpur in 1984, and Ph.D. degree in Computer Science from the Indian Institute of Science, Bangalore in 1988. Since September 1988, he has been with the Department of Computer Science and Engineering at IIT Madras where he is currently the Richard Karp Institute Chair Professor (2016-2025). He has served as Head (Chairman) of the Department from 2010 to 2013 and held the Indian National Academy of Engineering (INAE) Chair Professorship (2012-2014). He is a co-author of the textbooks Resource Management in Real-time Systems and Networks (MIT Press, USA), Ad Hoc Wireless Networks: Architectures and Protocols (Prentice Hall, USA), WDM Optical Networks: Concepts, Design, and Algorithms (Prentice Hall, USA), An Analytical Approach to Optical Burst Switched Networks (Springer, USA), Parallel Computers: Architecture and Programming (Prentice-Hall of India), and New Parallel Algorithms for Direct Solution of Linear Equations (John Wiley & Sons, USA). His research interests include wireless networks, lightwave networks, real-time systems, and parallel and distributed computing. He has published a number of research papers in peer-reviewed international journals and refereed international conference proceedings in these areas. Prof.Murthy is a co-recipient of Best Paper Awards from the 5th IEEE International Workshop on Parallel and Distributed Real-Time Systems (WPDRTS), 6th and also 11th IEEE Annual International Conference on High Performance Computing (HiPC), and 14th and also 19th IEEE International Conference on Networks (ICON). He has served as an Associate Editor of the IEEE Transactions on Computers and IEEE Transactions on Mobile Computing, and as a Subject Area Editor for the Journal of Parallel and Distributed Computing (JPDC) and INAE Letters (now Transactions of the Indian National Academy of Engineering). He is currently an Area Editor of Computer Networks (COMNET) Journal. He is a recipient of Best Ph.D. Thesis Award from the Indian Institute of Science, INSA Medal for Young Scientists, Dr.Vikram Sarabhai Research Award, Sir JC Bose (The Real Inventor of Marconi's Wireless Receiver) Fellowship (2016-2026), Erasmus Mundus Faculty Research Fellowship, and IBM (USA) Real-Time Innovation Award. He is an elected Fellow of Indian National Academy of Engineering (INAE), National Academy of Sciences (NASI), Indian National Science Academy (INSA), The World Academy of Sciences for the advancement of science in developing countries (TWAS, Italy), and Institute of Electrical and Electronics Engineers (IEEE, USA). Select Recent Publications: Chigullapally Sriharsha and C. Siva Ram Murthy, \"UAV-Enabled Cellular User Offloading with SIC Based Interference Handling\", to appear in IEEE Trans. on Wireless Communications, 2025. Vipin N Sathi and C. Siva Ram Murthy, \"Boost Your Immunity: VACCINE for Preventing a Novel Stealthy Slice Selection Attack in 5G and Beyond\", ACM Trans. on Privacy and Security, vol. 27, no. 4, pp. 1-29, 2024. Chigullapally Sriharsha and C. Siva Ram Murthy, \"A Novel Cellular User Offloading via UAV-Borne IRS\", IEEE Wireless Communications Letters, vol. 12, no. 10, pp. 1736-1740, 2023. Kaliyammal Thiruvasagam Prabhu, Vijeth J Kotagi, and C. Siva Ram Murthy, \"A Reliability-Aware, Delay Guaranteed, and Resource Efficient Placement of Service Function Chains in Softwarized 5G Networks\", IEEE Trans. on Cloud Computing, vol. 10, no. 3, pp. 1515-1531, 2022. Revathy Narayanan, Swarun Kumar, and C. Siva Ram Murthy, \"Cross Technology Distributed MIMO for Low Power IoT\", IEEE Trans. on Mobile Computing, vol. 21, no. 5, pp. 1609-1624, 2022. Vipin N Sathi, Manikantan Srinivasan, Kaliyammal Thiruvasagam Prabhu, and C. Siva Ram Murthy, \"Novel Protocols to Mitigate Network Slice Topology Learning Attacks and Protect Privacy of Users' Service Access Behavior in Softwarized 5G Networks\", IEEE Trans. on Dependable and Secure Computing, vol. 18, no. 6, pp. 2888-2906, 2021. Manikantan Srinivasan and C. Siva Ram Murthy, \"Efficient Spectrum Slicing in 5G Networks: An Overlapping Coalition Formation Approach\", IEEE Trans. on Mobile Computing, vol. 19, no. 6, pp. 1299-1316, 2020.",
  "content_length": 4809,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:41"
}