{
  "name": "Chelsea Finn",
  "homepage": "http://ai.stanford.edu/~cbfinn",
  "status": "success",
  "content": "Chelsea Finn, Stanford University Chelsea Finn cbfinn at cs dot stanford dot edu I am an Assistant Professor in Computer Science and Electrical Engineering at Stanford University and co-founder of Pi. My lab, IRIS, studies intelligence through robotic interaction at scale, and is affiliated with SAIL and the ML Group. I am interested in the capability of robots and other agents to develop broadly intelligent behavior through learning and interaction. Previously, I completed my Ph.D. in computer science at UC Berkeley and my B.S. in electrical engineering and computer science at MIT. I also spent time at Google as part of the Google Brain team. Prospective students and post-docs, please see this page. CV  / Bio  / PhD Thesis  / Google Scholar  / Twitter  / IRIS Lab News See our lab website for up-to-date news. Our work on meta-learning for giving feedback to students was featured in the New York Times. See the blog post, paper, and slides for more information. I am honored to have received Intel's Rising Star Faculty Award and the Microsoft Faculty Fellowship award. In Fall 2019, I taught a new course on deep multi-task and meta learning. Lecture videos are available here. I am honored and thrilled to have received the ACM 2018 Doctoral Dissertation Award for my thesis, Learning to Learn with Gradients. Our work on enabling robots to use objects as tools was featured in an article by MIT Technology Review I am honored to have received the MIT TR35 pioneer award. In August 2018, I completed my PhD! show more Some of my research was featured in a TechCrunch article. At NIPS 2017, we showcased our research on meta-imitation learning and visual foresight in a live robot demo! For more information and a video, see this page. In summer 2017, I co-organized BAIR camp, a 2-day summer camp on human-centered AI for high-school students from low income backgrounds. We are organizing a second camp in August 2018. In Spring 2017, I helped develop and co-taught a course on deep reinforcement learning. I co-organized a workshop at NIPS 2016 on Deep Learning for Action and Interaction (videos here). My colleagues and I have released the robotic grasping and pushing data used in Levine et al. '16 (ISER) and Finn et al. '16 (NIPS): Google Brain Robotics Data. Recent Talks Robotics Focused Talk (November 2022) Machine Learning Focused Talk (June 2022) Students and Post-Docs See this page for a list of lab members. Teaching Stanford CS224R: Deep Reinforcement Learning - Spring 2023 Stanford CS330: Deep Multi-Task and Meta Learning - Fall 2019, Fall 2020, Fall 2021, Fall 2022 Stanford CS221: Artificial Intelligence: Principles and Techniques - Spring 2020, Spring 2021 UCB CS294-112: Deep Reinforcement Learning - Spring 2017 Tutorials and Lectures Lecture videos for the Fall 2021 edition of CS330 are available online here. In Fall 2019, I taught a new course on deep multi-task and meta learning. Lecture videos are available here. At ICML 2019 and CVPR 2019, I gave an invited tutorial on Meta-Learning: from Few-Shot Learning to Rapid Reinforcement Learning. Slides, video, and references are linked here. In December 2018, I gave a tutorial on model-based reinforcement learning at the CIFAR LMB program meeting (slides here). At ICML 2017, I gave a tutorial with Sergey Levine on Deep Reinforcement Learning, Decision Making, and Control (slides here, video here). In August 2017, I gave guest lectures on model-based reinforcement learning and inverse reinforcement learning at the Deep RL Bootcamp (slides here and here, videos here and here). In Spring 2017, I co-taught a course on deep reinforcement learning at UC Berkeley. All lecture video and slides are available here. This guy makes a nice webpage.",
  "content_length": 3742,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:16"
}