{
  "name": "Chenshu Wu",
  "homepage": "https://cswu.me",
  "status": "success",
  "content": "Chenshu Wu - AIoT Research at HKU Chenshu Wu | 吳陳沭 HKU AIoT (Artificial Intelligence of Things) Lab Assistant Professor, Department of Computer Science Associate Head, Department of Computer Science The University of Hong Kong Office: 315B, Chow Yei Ching Building Email: chenshu [at] cs [dot] hku [dot] hk Home | Biography | Publications | Teaching | Research | Awards News I am actively looking for highly self-motivated PhD students to work on AIoT systems, with potential HKPF and HKU-PS scholarships. If you are interested, please drop me an email. Multiple PhD, postdoc, and RA positions are available. Check out more details here: Prospective Students Are you still using Wi-Fi for the Internet only? You are missing a lot! Check out our recent article \"Wi-Fi Can Do More: Towards Ubiquitous Wireless Sensing\" on IEEE Communications Standards Magazine! Check out HKU AIoT Lab website for more updates! 2025/10, invited to serve on the TPC of ACM MobiSys 2026. 2025/09, OctoNet accepted to NeurIPS 2025 Datasets and Benchmarks Track! Congrats! 2025/08, received the 2025 IEEE Communications Society Fred W. Ellersick Prize. 2025/05, 🔥 Check out HotSense @ MobiCom 2025 — the first ACM workshop on thermal sensing and computing! 2025/04, one paper from our group accepted to OSDI 2025 and two papers to IMWUT/UbiComp 2025! 2025/03, invited to serve as the Journal Track Co-Chair for EWSN 2025 in Leuven. Please consider submitting! 2024/12, invited to serve on the TPC of ACM MobiHoc 2025 in Houston. 2024/11, RF-Diffusion received the ACM MobiCom 2024 Best Artifact Award! 2024/11, invited to serve on the TPC of ACM SenSys 2025 in Irvine. 2024/10, awarded the 2024 NAM Healthy Longevity Catalyst Awards (Hong Kong)! 2024/10, invited to serve on the TPC of ACM MobiSys 2025 in California. 2024/10, invited to serve on the TPC of IEEE DySPAN 2025 in London. 2024/09, invited to serve on the TPC of IEEE ICDCS 2025 (IoT and CPS track), Glasgow, Scotland. 2024/08, delivered my first ever lecture for middle/high school students through the HKU AI Academy for the Talented program! 2024/08, Co-Chairing The 1st International Workshop on RF Computing (RFCOM, co-located with SenSys), Hangzhou, China, 2024. 2024/06, our research on statistical acoustic sensing was funded by RGC/GRF! 2024/06, invited to serve as an Associate Editor for ACM Transactions on Internet of Things. 2024/04, co-chairing the TPC of IEEE ICPADS 2024 in Belgrade, Serbia (the first time in Europe!). Please consider submitting! 2024/04, invited to serve on the TPC of IEEE WoWMoM 2024 - PhD Forum in Perth, Western Australia. 2024/03, invited to serve on the TPC of ACM SenSys 2024 in Hangzhou. 2024/02, invited to serve on the editorial board as an Associate Editor of ACM IMWUT. About Me I'm currently an Assistant Professor in the Department of Computer Science, The University of Hong Kong, where I lead the AIoT Lab. I was an Assistant Research Scientist in the Department of Electrical and Computer Engineering, University of Maryland, College Park and the Chief Scientist at Origin AI (a startup commercializing WiFi sensing technologies), working with Prof. K. J. Ray Liu, after working as a research associate in the Department of Computer Science, Princeton University and the School of Software, Tsinghua University. I received my Ph.D. degree in the Department of Computer Science and Technology, Tsinghua University, under supervision of Prof. Yunhao Liu. During my Ph.D., I was lucky to work with Prof. Mingyan Liu in the Department of EECS, University of Michigan and Prof. Jiannong Cao in the Department of Computing, HKPU. I received my B.E. degree from the School of Software, Tsinghua University. Research Interests Can machines sense without sensors? Can they \"see\" without cameras, in the dark, and through the walls? My research is driven by the vision of shaping \"Wireless AI Perception\" to advance machine intelligence beyond traditional vision. We focus on pioneering sensing AI technologies that transform \"Homecare\" to \"Home Cares\" and bring healthcare from \"Benchside\" to \"Bedside\". The field of wireless sensing has experienced tremendous growth in the past 15 years, and I'm fortunate to have my research in this area translated into award-winning products that are deployed in millions of devices worldwide. Currently, my lab is dedicated to designing cutting-edge sensing solutions as well as building commercialized applications for a smarter, more connected life. Our current research interests include: Sensing AI for Homecare, Healthcare, Eldercare Localization for Mobiles, Robots, Drones AI for Healthcare Automotive In-Cabin Sensing Research Projects Highlights on Industrial Impacts: + Our sleep monitoring work has been commercialized by Origin Wireless as Origin Health - Remote Patient Monitoring, which won the CES 2021 Best of Innovation Award! + Our works on wireless indoor tracking, gait recognition, fall detection are being commercialized by Origin Wireless Inc. Stay tuned! + Authored 60+ US/international patents and 20+ China patents. Checkout more research projects HERE, and RIM, EasiTrack, Widar, ChromaCode. RF-based Inertial Measurement Wireless, Contactless, Sensorless Sensing Hidden Screen-Camera Communication Systems Wireless Indoor Localization via Mobile Crowdsourcing Selected Publications For a complete list, see HERE or my Google Scholar Profile. According to Google Scholar, my papers have more than 5,400 citations, with an h-index of 32. Books Smart Wireless Sensing: From IoT to AIoT Zheng Yang, Kun Qian, Chenshu Wu, Yi Zhang Springer, 2021. ISBN: 978-981-16-5658-3. [Front Matter] [Read Online] Wireless Indoor Localization: A Crowdsourcing Approach Chenshu Wu, Zheng Yang, Yunhao Liu Springer, 2018. ISBN: 978-981-13-0355-5. [Book Flyer] [Read Online] Location-based Computing: Localization and Localizability of Wireless Networks (位置计算：无线网络定位与可定位性) Zheng Yang, Chenshu Wu, Yunhao Liu Tsinghua University Press, Jan. 2014. ISBN: 978-7-302-35113-9 Excellent Academic Monograph (Second Class) of Chinese University Press Book Award (获第四届中国大学出版社图书奖优秀学术著作二等奖) Selected Conferences Selected Journals Honors and Awards 2024, ACM MobiCom 2024 Best Artifact Award 2024, Healthy Longevity Catalyst Awards (Hong Kong), National Academy of Medicine (NAM) 2022, 2023, 2024, The World's Top 2% Scientists List by Stanford University 2022, 2023, 2024, Top 1% Scholar Worldwide by Citations, Clarivate Analytics Essential Science Indicators (ESI) 2022, NSFC National Excellent Young Scientists Fund (HK&Macau) (國家優秀青年科學家基金項目（港澳）) 2022, Healthy Longevity Catalyst Awards (Hong Kong), National Academy of Medicine (NAM) 2022, Best Paper Award, ACM IASA 2022 2021, Best Student Paper Award, IEEE WF-IoT 2021 2019, Postdoc Research Symposium Winner (#1 in Engineering School), University of Maryland 2017, Best Paper Honorable Mention Award, ACM CHI 2017 2017, Best Paper Award of the Year 2016, Tsinghua Science and Technology 2016, China Computer Federation (CCF) Excellent Doctoral Dissertation Award (中国计算机学会优秀博士学位论文奖) 2015, The Committee of 100's Leadership Scholarship Program Award 2015, Excellent PhD Graduate of Beijing 2015, Excellent PhD Graduate of Tsinghua University 2015, Excellent Doctoral Dissertation, Tsinghua University (rank 1st in Dept. of CS) 2015, Academic Rising Star of Tsinghua University (清华大学学术新秀) (10 graduates per year) 2014, Tsinghua Top Grade Scholarship (清华大学特等奖学金) (10 graduates per year) 2014, Best Paper Candidate Award, IEEE ICPADS 2014 2012, 2013, 2014, National Graduate Scholarship 2013, Tsinghua Lin Feng Counsellor Prize (清华大学林枫辅导员奖) Professional Services Editorship - Associate Editor, PACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, 2024 - now - Associate Editor, ACM Transactions on Internet of Things, 2024 - now - Associate Editor, IEEE ACCESS, 2020 - 2024 - Guest Editor, Special Issue on “Resource Management at the Edge for Future Web, Mobile and IoT Applications”, World Wide Web Journal, 2021 - Guest Editor, Special Issue on \"Cloud Computing-based Big Data Processing and Intelligent Analytics\", Concurrency and Computation: Practice and Experience, November 2019. Conference and Workshop Organizer for - TPC Co-Chair, IEEE ICPADS 2024, Belgrade, Serbia - Co-Chair, The 1st International Workshop on RF Computing (Co-located with SenSys), Hangzhou, China, 2024 - Local Arrangement Chair, TAAC FFSE (The 4th Forum on Frontiers of Science and Engineering) 2024, Hong Kong - Social Media Chair, IEEE CPS-IoT Week 2024, Hong Kong - Publicity Co-Chair, ACM SenSys 2023, Istanbul, Turkiye - Co-Organizer, Wireless AI Perception Workshop at CVPR 2022 - General Co-Chair, ACM Ubicomp Workshop on Combining Physical and Data-Driven Knowledge in Ubiquitous Computing (CPD), 2021 - Publicity Co-Chair, ACM SIGOPS Asia-Pacific Workshop on Systems (APSys), 2021 - Special Session Organizer on “Contactless and Wireless Sensing for Smart Environments”, IEEE ICASSP, 2021 Technical Program Committee Member for - 2025: ACM MobiSys, IEEE IDCDS - 2024: ACM SenSys, IEEE ICDCS, ACM/IEEE IPSN, CSCAIoTSys@CPS-IoT Week, IEEE WoWMoM - PhD Forum, IEEE MSN - 2023: ACM SenSys, IEEE DySPAN, IEEE MSN, EAI MobiQuitous - 2022: ACM SenSys, ACM/IEEE IoTDI, IEEE ICPADS, EAI MobiQuitous, IEEE ICCCN - 2021: IEEE DySPAN, UbiSec - 2020: IEEE TrustCom, IEEE MIPR - 2019: IEEE DySPAN, IEEE ICPADS, IEEE MIPR - 2018: IEEE UIC, IEEE ICCCN - 2017: IEEE INFOCOM, IEEE ICDCS, IEEE UIC - 2016: IEEE UIC Journal Reviewers for 1) IEEE/ACM Transactions on Networking (TON); 2) IEEE Transactions on Mobile Computing (TMC); 3) PACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT/UbiComp); 4) IEEE Transactions on Parallel and Distributed Systems (TPDS); 5) IEEE Journal on Selected Areas in Communications (JSAC); 6) IEEE Transactions on Wireless Communications (TWC); 7) IEEE Transactions on Signal Processing (TSP); 8) ACM Transactions on Sensor Networks (TOSN); 9) ACM Transactions on Intelligent Systems and Tech",
  "content_length": 14614,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:02"
}