{
  "name": "Chen Chen 0042",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/chen-chen",
  "status": "success",
  "content": "Dr Chen Chen | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Chen Chen School of Computer Science Lecturer in Computer Vision Outreach Support Open staff member portrait in a modal window chen.chen2@sheffield.ac.uk +44 114 215 8560 Regent Court (DCS) Full contact details Dr Chen Chen School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0002-3525-9755 Google Scholar Profile Dr Chen (Cherise) Chen obtained her MSc and Ph.D. degree in Advanced Computing from Imperial College London, in 2016 and 2022, respectively. From 2022, she worked as a research associate at Imperial College London. During the time at Imperial, she worked closely with Prof. Daniel Rueckert and Dr. Wenjia Bai, on numerous projects with cardiac imaging. She was also a research scientist at HeartFlow. After that, she joined Oxford BioMedIA group, University of Oxford in 2023, working closely with Prof. Vicente Grau. She has engaged in a variety of projects that apply artificial intelligence to cardiac, brain, and prostate imaging. Research interests Dr. Chen's research primarily revolves around the intersection of artificial intelligence (AI) and healthcare. Her focus is particularly strong in the domains of medical multi-modal data analysis (e.g, image, signal, text) with machine learning. Her work aims to develop and validate robust, data-efficient, and reliable machine learning algorithms that can enhance the scalability of AI-driven medical data analysis in practical applications. Please visit her personal website for more information. Publications Show: Featured publications All publications Featured publications Journal articles Ouyang C, Chen C, Li S, Li Z, Qin C, Bai W & Rueckert D (2023) Causality-Inspired Single-Source Domain Generalization for Medical Image Segmentation. IEEE Transactions on Medical Imaging, 42(4), 1095-1106. Chen C, Qin C, Ouyang C, Li Z, Wang S, Qiu H, Chen L, Tarroni G, Bai W & Rueckert D (2022) Enhancing MR image segmentation with realistic adversarial data augmentation. Medical Image Analysis, 82, 102597-102597. Chen C, Qin C, Qiu H, Tarroni G, Duan J, Bai W & Rueckert D () Deep Learning for Cardiac Image Segmentation: A Review. Frontiers in Cardiovascular Medicine, 7. Preprints Liu C, Cheng S, Chen C, Qiao M, Zhang W, Shah A, Bai W & Arcucci R (2023) M-FLAG: Medical Vision-Language Pre-training with Frozen Language Models and Latent Space Geometry Optimization. All publications Books (2024) Data Augmentation, Labelling, and Imperfections: Third MICCAI Workshop, DALI 2023, Held in Conjunction with MICCAI 2023, Vancouver, BC, Canada, October 12, 2023, Proceedings. Springer Nature Switzerland. View this article in WRRO Journal articles Chen C, Li L, Beetz M, Banerjee A, Gupta R & Grau V (2025) Large Language Model-Informed ECG Dual Attention Network for Heart Failure Risk Prediction. IEEE Transactions on Big Data, 11(3), 948-960. Payette K, Steger C, Licandro R, Dumast PD, Li HB, Barkovich M, Li L, Dannecker M, Chen C, Ouyang C , McConnell N et al (2025) Multi-center fetal brain tissue annotation (FeTA) challenge 2022 results. IEEE Transactions on Medical Imaging, 44(3), 1257-1272. View this article in WRRO Kreitner L, Paetzold JC, Rauch N, Chen C, Hagag AM, Fayed AE, Sivaprasad S, Rausch S, Weichsel J, Menze BH , Harders M et al (2024) Synthetic Optical Coherence Tomography Angiographs for Detailed Retinal Vessel Segmentation Without Human Annotations. IEEE Transactions on Medical Imaging, 43(6), 2061-2073. Li Z, Kamnitsas K, Ouyang C, Chen C & Glocker B (2023) Context Label Learning: Improving Background Class Representations in Semantic Segmentation. IEEE Transactions on Medical Imaging, 42(6), 1885-1896. Dawood T, Chen C, Sidhu BS, Ruijsink B, Gould J, Porter B, Elliott MK, Mehta V, Rinaldi CA, Puyol-Antón E , Razavi R et al (2023) Uncertainty aware training to improve deep learning model calibration for classification of cardiac MR images. Medical Image Analysis, 88, 102861-102861. Ouyang C, Chen C, Li S, Li Z, Qin C, Bai W & Rueckert D (2023) Causality-Inspired Single-Source Domain Generalization for Medical Image Segmentation. IEEE Transactions on Medical Imaging, 42(4), 1095-1106. Qin C, Wang S, Chen C, Bai W & Rueckert D (2023) Generative myocardial motion tracking via latent space exploration with biomechanics-informed prior. Medical Image Analysis, 83, 102682-102682. Chen C, Qin C, Ouyang C, Li Z, Wang S, Qiu H, Chen L, Tarroni G, Bai W & Rueckert D (2022) Enhancing MR image segmentation with realistic adversarial data augmentation. Medical Image Analysis, 82, 102597-102597. Zhuang X, Xu J, Luo X, Chen C, Ouyang C, Rueckert D, Campello VM, Lekadir K, Vesal S, RaviKumar N , Liu Y et al (2022) Cardiac segmentation on late gadolinium enhancement MRI: A benchmark study from multi-sequence cardiac MR segmentation challenge. Medical Image Analysis, 81, 102528-102528. Ouyang C, Biffi C, Chen C, Kart T, Qiu H & Rueckert D (2022) Self-Supervised Learning for Few-Shot Medical Image Segmentation. IEEE Transactions on Medical Imaging, 41(7), 1837-1848. Xiong Z, Xia Q, Hu Z, Huang N, Bian C, Zheng Y, Vesal S, Ravikumar N, Maier A, Yang X , Heng P-A et al (2021) A global benchmark of algorithms for segmenting the left atrium from late gadolinium-enhanced cardiac magnetic resonance imaging. Medical Image Analysis, 67, 101832-101832. Le EPV, Evans NR, Tarkin JM, Chowdhury MM, Zaccagna F, Wall C, Huang Y, Weir-Mccall JR, Chen C, Warburton EA , Schonlieb CB et al (2020) Contrast CT classification of asymptomatic and symptomatic carotids in stroke and transient ischaemic attack with deep learning and interpretability. European Heart Journal, 41(Supplement_2). Li Z, Hou Z, Chen C, Hao Z, An Y, Liang S & Lu B (2019) Automatic Cardiothoracic Ratio Calculation With Deep Learning. IEEE Access, 7, 37749-37756. Chen C, Bai W, Davies RH, Bhuva AN, Manisty CH, Augusto JB, Moon JC, Aung N, Lee AM, Sanghvi MM , Fung K et al () Improving the Generalizability of Convolutional Neural Network-Based Segmentation on CMR Images. Frontiers in Cardiovascular Medicine, 7. Chen C, Qin C, Qiu H, Tarroni G, Duan J, Bai W & Rueckert D () Deep Learning for Cardiac Image Segmentation: A Review. Frontiers in Cardiovascular Medicine, 7. Book chapters Fan W, Rizky LMR, Zhang J, Chen C, Lu H, Teh K, Selvarajah D & Zhou S (2026) Foundation-Model-Boosted Multimodal Learning for fMRI-Based Neuropathic Pain Drug Response Prediction, Lecture Notes in Computer Science (pp. 238-248). Springer Nature Switzerland Ramzan F, Kiberu Y, Jathanna N, Jamil-Copley S, Clayton RH & Chen C (2025) CLAIM: Clinically-guided LGE augmentation for realistic and diverse myocardial scar synthesis and segmentation In Cafolla D, Rittman T & Ni H (Ed.), Lecture Notes in Computer Science (pp. 279-292). Springer Cham View this article in WRRO Zhang Y, Chen C, Shit S, Starck S, Rueckert D & Pan J (2024) Whole heart 3D+T representation learning through sparse 2D cardiac MR images In Linguraru MG, Dou Q, Feragen A, Giannarou S, Glocker B, Lekadir K & Schnabel JA (Ed.), Lecture Notes in Computer Science (pp. 359-369). Springer Nature Switzerland View this article in WRRO Suvon MNI, Tripathi PC, Fan W, Zhou S, Liu X, Alabed S, Osmani V, Swift AJ, Chen C & Lu H (2024) Multimodal Variational Autoencoder for Low-Cost Cardiac Hemodynamics Instability Detection, Lecture Notes in Computer Science (pp. 296-306). Springer Nature Switzerland Conference proceedings Qiu H, Hammernik K, Qin C, Chen C & Rueckert D (2022) Embedding Gradient-Based Optimization in Image Registration Networks (pp 56-65) Li Z, Kamnitsas K, Islam M, Chen C & Glocker B (2022) Estimating Model Performance Under Domain Shifts with Class-Specific Confidence Scores (pp 693-703) Chen C, Li Z, Ouyang C, Sinclair M, Bai W & Rueckert D (2022) MaxStyle: Adversarial Style Composition for Robust Medical Image Segmentation (pp 151-161) Ouyang C, Wang S, Chen C, Li Z, Bai W, Kainz B & Rueckert D (2022) Improved Post-hoc Probability Calibration for Out-of-Domain MRI Segmentation (pp 59-69) Dawood T, Chen C, Andlauer R, Sidhu BS, Ruijsink B, Gould J, Porter B, Elliott M, Mehta V, Rinaldi CA , Puyol-Antón E et al (2022) Uncertainty-Aware Training for Cardiac Resynchronisation Therapy Response Prediction (pp 189-198) Wang S, Qin C, Savioli N, Chen C, O’Regan DP, Cook S, Guo Y, Rueckert D & Bai W (2021) Joint Motion Correction and Super Resolution for Cardiac Segmentation via Latent Optimisation (pp 14-24) Chen C, Hammernik K, Ouyang C, Qin C, Bai W & Rueckert D (2021) Cooperative Training and Latent Space Data Augmentation for Robust Medical Image Segmentation (pp 149-159) Ouyang C, Biffi C, Chen C, Kart T, Qiu H & Rueckert D (2020) Self-supervision with Superpixels: Training Few-Shot Medical Image Segmentation Without Annotation (pp 762-780) Qin C, Wang S, Chen C, Qiu H, Bai W & Rueckert D (2020) Biomechanics-Informed Neural Networks for Myocardial Motion Tracking in MRI (pp 296-306) Chen C, Qin C, Qiu H, Ouyang C, Wang S, Chen L, Tarroni G, Bai W & Rueckert D (2020) Realistic Adversarial Data Augmentation for MR Image Segmentation (pp 667-677) Puyol-Antón E, Chen C, Clough JR, Ruijsink B, Sidhu BS, Gould J, Porter B, Elliott M, Mehta V, Rueckert D , Rinaldi CA et al (2020) Interpretable Deep Models for Cardiac Resynchronisation Therapy Response Prediction (pp 284-293) Wang S, Tarroni G, Qin C, Mo Y, Dai C, Chen C, Glocker B, Guo Y, Rueckert D & Bai W (2020) Deep Generative Model-Based Quality Control for Cardiac MRI Segmentation (pp 88-97) Chen C, Ouyang C, Tarroni G, Schlemper J, Qiu H, Bai W & Rueckert D (2020) Unsupervised Multi-modal Style Transfer for Cardiac MR Segmentation (pp 209-219) Bai W, Chen C, Tarroni G, Duan J, Guitton F, Petersen SE, Guo Y, Matthews PM & Rueckert D (2019) Self-Supervised Learning for Cardiac MR Image Segmentation by Anatomical Position Prediction (pp ",
  "content_length": 13944,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:47"
}