{
  "name": "Chen Chen 0067",
  "homepage": "https://jhc.sjtu.edu.cn/~chen-chen",
  "status": "success",
  "content": "Chen Chen's Homepage Chen Chen (陈晨) Tenure-track Associate Professor, Ph.D. Advisor John Hopcroft Center for Computer Science School of Electronic Information and Electrical Engineering Shanghai Jiao Tong University Email: chen-chen AT sjtu DOT edu DOT cn Office: SEIEE Building 3-301B Short Bio Chen Chen is currently a tenure-track associate professor at John Hopcroft Center for Computer Science, Shanghai Jiao Tong University, where he is also a member of the Emerging Parallel Computing Center. Prior to that, he worked as a Researcher at Huawei Hong Kong Research Center. In 2018, he obtained the Ph.D. degree in Computer Science from Hong Kong University of Science and Technology, under the supervision of Prof. Bo Li and Prof. Wei Wang. During his Ph.D. study, he visited University of Toronto for one semester (hosted by Prof. Baochun Li). He obtained the Bachelor degree in 2014 from Department of Automation, Tsinghua Univerity. Research Interests Distributed Machine Learning, LLM Inference, Cloud Scheduling, Cache Management Openings I am looking for self-motivated undergraduate, Master and PhD students to work with me. Feel free to drop me an email if you are interested. Teaching CS7331, Advanced Computer Architecture (in English), 2022-2023 Spring. SE3357, Operating System (John Class), 2022-2023 Spring. CS7331, Advanced Computer Architecture, 2023-2024 Fall. SE3357, Operating System (John Class), 2023-2024 Spring. Publications [ICPP 2024] FedCA: Efficient Federated Learning with Client Autonomy Na Lv, Zhi Shen, Chen Chen, Zhifeng Jiang, Jiayi Zhang, Quan Chen and Minyi Guo, accepted to appear in International Conference on Parallel Processing Proceedings. [IWQoS 2024] PAS: Towards Accurate and Efficient Federated Learning with Parameter-Adaptive Synchronization Zuo Gan, Chen Chen, Jiayi Zhang, Gaoxiong Zeng, Yifei Zhu, Jieru Zhao, Quan Chen and Minyi Guo, accepted to appear in IEEE/ACM International Symposium on Quality of Service. [OSDI 2024] Parrot: Efficient Serving of LLM-based Applications with Semantic Variable Chaofan Lin, Zhenhua Han, Chengruidong Zhang, Yuqing Yang, Fan Yang, Chen Chen, Lili Qiu, accepted to appear in USENIX Symposium on Operating Systems Design and Implementation. [INFOCOM 2024] DPBalance: Efficient and Fair Privacy Budget Scheduling for Federated Learning as a Service Yu Liu, Zibo Wang, Yifei Zhu, Chen Chen, in IEEE International Conference on Computer Communications. [HPCA 2024] An Optimizing Framework on MLIR for Efficient FPGA-based Accelerator Generation Weichuang Zhang, Jieru Zhao, Guan Shen, Quan Chen, Chen Chen, Minyi Guo, in IEEE International Symposium on High-Performance Computer Architecture. [ASPLOS 2024] DataFlower: Exploiting the Data-flow Paradigm for Serverless Workflows Zijun Li, Chuhao Xu, Quan Chen, Jieru Zhao, Chen Chen, Minyi Guo, accepted to appear in ACM Conference on Architectural Support for Programming Languages and Operating Systems. [ICCD 2023] STAG: Enabling Low Latency and Low Staleness of GNN-based Services with Dynamic Graphs [Paper] Jiawen Wang, Quan Chen, Deze Zeng, Zhuo Song, Chen Chen, Minyi Guo, in IEEE International Conference on Computer Design, Washington DC, USA, Nov 2023. [ICPP 2023] ASFL: Adaptive Semi-asynchronous Federated Learning for Balancing Model Accuracy and Total Latency in Mobile Edge Networks [Paper] Jieling Yu, Ruiting Zhou, Chen Chen, Bo Li, Fang Dong, in ACM International Conference on Parallel Processing, Salt Lake City, UT, USA, Aug. 2023. [TPDS 2023] Synchronize Only the Immature Parameters: Communication-Efficient Federated Learning By Freezing Parameters Adaptively [Paper] Chen Chen, Hong Xu, Wei Wang, Baochun Li, Bo Li, Li Chen, Gong Zhang, accepted to appear in IEEE Transactions on Parallel and Distributed Systems. [JSAC 2023] GIFT: Towards Accurate and Efficient Federated Learning with Gradient-Instructed Frequency Tuning [Paper] Chen Chen, Hong Xu, Wei Wang, Baochun Li, Bo Li, Li Chen, Gong Zhang, in IEEE Journal on Selected Areas in Communications (special issue on Communication-Efficient Distributed Learning over Networks), Volume: 41, Issue: 4, April 2023. [SoCC 2022] Characterizing and Orchestrating VM Reservation in Geo-distributed Clouds to Improve the Resource Efficiency [Paper] Jiuchen Shi, Kaihua Fu, Quan Chen, Changpeng Yang, Pengfei Huang, Mosong Zhou, Jieru Zhao, Chen Chen, Minyi Guo, in ACM Symposium on Cloud Computing, San Francisco, CA, November 2022. [TCC 2021] Accelerating Distributed Learning in Non-Dedicated Environments [Paper] Chen Chen, Qizhen Weng, Wei Wang, Baochun Li, and Bo Li, in IEEE Transactions on Cloud Computing, Volume: 11, Issue: 1, 01 Jan.-March 2023. [IJCNN 2021] Two-Dimensional Learning Rate Decay: Towards Accurate Federated Learning with Non-IID Data [Paper] Kaiwei Mo, Chen Chen, Jiamin Li, Hong Xu, and Chun Jason Xue, in International Joint Conference on Neural Networks, Virtual Conference, July 2021. [ICDCS 2021] Communication-Efficient Federated Learning with Adaptive Parameter Freezing [Paper] Chen Chen, Hong Xu, Wei Wang, Baochun Li, Bo Li, Li Chen, Gong Zhang, in IEEE International Conference on Distributed Computing Systems, Virtual Conference, July 2021. [SC 2020] Metis: Learning to Schedule Long-Running Applications in Shared Container Clusters at Scale [Paper] Luping Wang, Qizhen Weng, Wei Wang, Chen Chen, Bo Li, in IEEE/ACM International Conference for High Performance Computing, Networking, Storage, and Analysis, Virtual Conference, November 2020. [SoCC 2020] Semi-Dynamic Load Balancing: Efficient Distributed Learning in Non-Dedicated Environments [Paper] Chen Chen, Qizhen Weng, Wei Wang, Baochun Li, Bo Li, in ACM Symposium on Cloud Computing, Virtual Conference, October 2020. [INFOCOM 2019] Round-Robin Synchronization: Mitigating Communication Bottlenecks in Parameter Servers [Paper] Chen Chen, Wei Wang, Bo Li, in IEEE International Conference on Computer Communications, Paris, France, April 2019. (Best-in-Session-Presentation Award) [SoCC 2018 Poster] Fast Distributed Deep Learning via Worker-adaptive Batch Sizing [Paper] Chen Chen, Qizhen Weng, Wei Wang, Baochun Li, Bo Li, in ACM Symposium on Cloud Computing, Poster Session, Carlsbad, CA, October 2018. [INFOCOM 2018] Performance-Aware Fair Scheduling: Exploiting Demand Elasticity of Data Analytics Jobs [Paper] Chen Chen, Wei Wang, Bo Li, in IEEE International Conference on Computer Communications, Honolulu, HI, April 2018. [ICDCS 2017] Speculative Slot Reservation: Enforcing Service Isolation for Dependent Data-Parallel Computations [Paper] Chen Chen, Wei Wang, Bo Li, in IEEE International Conference on Distributed Computing Systems, Atlanta, GA, June 2017. [INFOCOM 2017] Cluster Fair Queueing: Speeding up Data-Parallel Jobs with Delay Guarantees [Paper] Chen Chen, Shengkai Zhang, Wei Wang, Bo Li, in IEEE International Conference on Computer Communications, Atlanta, GA, May 2017. (Best-in-Session-Presentation Award) [ICC 2016] Software-Defined Inter-Domain Routing Revisited [Paper] Chen Chen, Bo Li, Dong Lin, Baochun Li, in IEEE International Conference on Communications, Kuala Lumpur, Malaysia, May 2016. Last updated on April 2024.",
  "content_length": 7167,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:45"
}