{
  "name": "Chen-Yu Wei",
  "homepage": "https://bahh723.github.io",
  "status": "success",
  "content": "I am an Assistant Professor in the Computer Science department at the University of Virginia. Before, I was a Postdoctoral Associate at MIT working with Prof. Alexander (Sasha) Rakhlin, and a Research Fellow at the Simons Institute for the Theory of Computing. I obtained my Ph.D. in Computer Science from the University of Southern California, where I was fortunate to be advised by Prof. Haipeng Luo, and received my Master’s and Bachelor’s degrees in Electrical Engineering from National Taiwan University. Please find my CV here. Email: chenyu.wei@virginia.edu Office: Rice Hall 409 Research I am broadly interested in the field of interactive machine learning. My work is centered around the following topics: Robust and adaptive learning algorithms for non-stationary or adversarial environments; Sample-efficient reinforcement learning algorithms with strategic exploration; Decentralized multi-agent learning algorithms with efficient communication and coordination. I am actively seeking collaborative opportunities, particularly those with a strong potential for practical application. I co-organize and attend RL Meetup and Theory Seminar at UVA. Teaching Fall 2025:   CS 6771 Reinforcement Learning Spring 2025:   CS 6501 Reinforcement Learning Fall 2024:   CS 4710 Artificial Intelligence Spring 2024:   CS 6501 Reinforcement Learning Spring 2024:   CS 4501 Introduction to Algorithmic Economics (co-teaching with Prof. Denis Nekipelov) Research Group Members Haolin Liu (PhD student, Spring 2023-) Braham Snyder (PhD student, Fall 2024-) Kingsley Kim (Undergraduate student, Spring 2024-) Rishik Balerao (Undergraduate student, Summer 2024-) Alumni Yufeng Gao (PhD student, Fall 2023; now continuing PhD at UVA) Clarence Chen (Undergraduate student, Fall 2023-Fall 2024; joining MSCF at CMU)",
  "content_length": 1805,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:51"
}