{
  "name": "Chen Chen 0001",
  "homepage": "https://www.crcv.ucf.edu/chenchen",
  "status": "success",
  "content": "Dr. Chen ChenChen ChenPh.D., Associate ProfessorIEEE Senior MemberACM Member Institute of Artificial Intelligence (IAI)Center for Research in Computer Vision (CRCV)Department of Computer ScienceUniversity of Central FloridaOffice: UCF Global 226Address: 4356 Scorpius St, Orlando, FL 32816407-823-1047 chen.chen@ucf.eduCurriculum VitaeGoogle ScholarLinkedInProspective StudentsI am always looking for highly motivated students for research. Please read this Ph.D. opening document for detailed research topics and requirements. How to apply: please visit the \"Join Us\" page for more information.Research InterestsComputer VisionGenerative AIImage and Video ProcessingNewsLatest updates and achievements11/2025I gave a keynote talk at the AIMed Conference 2025.11/20252 paper accepted by WACV 2026, and 1 paper accepted by AAAI 2026.10/2025Our paper “SciVideoBench: Benchmarking Scientific Video Reasoning in Large Multimodal Models” received the Best Paper Award (Benchmark Track) at the KnowledgeMR Workshop, ICCV 2025.[Link]09/20252 paper accepted by NeurIPS 2025.09/2025Our 'TransBTS: Multimodal Brain Tumor Segmentation Using Transformer' paper was selected as a Young Scientist Publication Impact Award FINALIST again at MICCAI 2025.[Link]07/20251 paper accepted by ACM Multimedia 2025.06/20254 papers accepted by ICCV 2025.05/20252 papers accepted by ACL 2025 (Main Track).Read More (19 more items)Awards and HonorsRecognition and achievements in academic career2025Best Paper Award (Benchmark Track) at the KnowledgeMR Workshop, ICCV 2025ICCV-2025 Conference2025Finalist for the MICCAI Young Scientist Publication Impact AwardMICCAI Conference2025ICCV Best Paper Finalists🏆 Best Paper NomineeIEEE/CVF Conference2025Excellence in Faculty Academic Advising AwardUniversity of Central Florida2024Rising Stars AwardAcademy of Science, Engineering and Medicine of Florida (ASEMFL)2022-2024World's top 2% scientistsStanford University/Elsevier2023Winner of the Affordance-Centric Question-driven Task Completion Challenge🏆 WinnerCVPR 2023 Long-form Video Understanding and Generation Workshop2023Finalist for the MICCAI Young Scientist Publication Impact AwardMICCAI Conference2022CVPR Best Paper Finalists🏆 Best Paper NomineeIEEE/CVF Conference2019UNC-Charlotte Faculty Research AwardUniversity of North Carolina at Charlotte2019ACM Multimedia Travel GrantACM Multimedia Conference2016David Daniel Fellowship Award (Best Doctoral Dissertation Award)University of Texas at Dallas2015Graduate Research Travel AwardUniversity of Texas at Dallas",
  "content_length": 2556,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:45"
}