{
  "name": "Chenxi Zhang 0003",
  "homepage": "http://faculty.xidian.edu.cn/zhangchenxi/zh_CN/index.htm",
  "status": "success",
  "content": "西安电子科技大学主页平台管理系统 张晨曦 首页 中文主页 登录 西安电子科技大学 English hg8qywFLGGFFXStCERHTHGn1KI3WOO0Yvc6DNIuc9r6rbcTb6e10Pk18m8d0 首页 科学研究 研究领域 论文成果 专利 著作成果 科研项目 科研团队 教学研究 教学资源 授课信息 教学成果 获奖信息 招生信息 学生信息 教师博客 我的相册 张晨曦 个人信息Personal Information 副教授 性别：男 毕业院校：复旦大学 学历：博士研究生毕业 学位：博士研究生毕业 在职信息：在岗 所在单位：计算机科学与技术学院 办公地点：南校区网安大楼A1-526 电子邮箱：be3e68fd2092f7ffca8a8cc149a47c10234fbcab77eb0ed15906d02785406b651b1dbceb73f7684bba7408da6fbb978fdc631e1cefbc86d553b659934abe695f9d100ff209ef8b8ffdd99ae8e434e2982fdc198c0e46a7bbfc295f5ee915a029cf9601d63b7d7729ed979831f99b97ad845070d56170d33aa68fe9a2dd72fa50 扫描关注 个人简介Personal Profile 张晨曦，西安电子科技大学计算机科学与技术学院，副教授，工学博士，校华山人才系列“菁英副教授”。于复旦大学获工学博士学位，曾在华为公司从事云计算软件开发工作，曾在微软亚洲研究院进行学术实习。 主要研究方向包括智能化运维、云原生、微服务、软件测试等。近年来在ICSE、FSE、ASE、ISSRE等软件工程国际旗舰会议发表论文10余篇。担任TOSEM、EMSE、JSS、软件学报等期刊审稿人，ISSTA、ICSE、ISSRE、SANER、ICPE等国际会议程序委员会委员。主持和参与绿盟科技、中科院软件所、陕西省科技计划、阿里巴巴、华为、微软亚洲研究院、字节跳动、腾讯等多项科研项目，部分成果得到实际应用。 个人主页：https://zchenxi.github.io/ 招生信息： 团队常年招收软件工程、电子信息等方向博士生、硕士生，同时欢迎本科生加入实验室参与科研项目及相关竞赛。团队与复旦大学、阿里巴巴、华为等科研单位保持长期学术合作关系，可提供实习、合作研究及深造机会。参与应用项目研发、发表高水平论文都将给予丰厚津贴，并支持参与国际国内会议交流。团队欢迎具有探索精神的学生加入，一起合作发表顶会、顶刊论文，同时产出具有工业界影响的学术成果。 代表性论文： [1] Chenxi Zhang, Zhen Dong, Xin Peng, Bicheng Zhang, and Miao Chen. Trace-based Multi-Dimensional Root Cause Localization of Performance Issues in Microservice Systems. 46th IEEE/ACM International Conference on Software Engineering (ICSE 2024), CCF-A类会议, 2024. [2] Chenxi Zhang, Xin Peng, Chaofeng Sha, Ke Zhang, Zhenqing Fu, Xiya Wu, Qingwei Lin, and Dongmei Zhang. DeepTraLog: Trace-Log Combined Microservice Anomaly Detection through Graph-based Deep Learning.  44th IEEE/ACM International Conference on Software Engineering (ICSE 2022), CCF-A类会议, 2022. [3] Chenxi Zhang, Xin Peng, Tong Zhou, Chaofeng Sha, Zhenghui Yan, Yiru Chen, and Hong Yang. TraceCRL: contrastive representation learning for microservice trace analysis. 30th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2022), CCF-A类会议, 2022. [4] Yiru Chen*, Chenxi Zhang*, Zhen Dong, Dingyu Yang, Xin Peng, Jiayu Ou, Hong Yang, Zheshun Wu, Xiaojun Qu, and Wei Li. Dynamic Graph Neural Networks-based Alert Link Prediction for Online Service Systems. 38th IEEE/ACM International Conference on Automated Software Engineering (ASE 2023), CCF-A类会议, 共同第一作者, 2023. [5] Xin Peng, Chenxi Zhang, Zhongyuan Zhao, Akasaka Isami, Xiaofeng Guo, and Yunna Cui. Trace analysis based microservice architecture measurement. 30th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2022), CCF-A类会议, 2022. [6] 王尚, 张晨曦#, 彭鑫. 基于神经网络的分布式追踪数据压缩和查询方法. 软件学报，CCF-A类中文期刊, 2024. [7] 张添翼, 周彤, 张晨曦#, 彭鑫. 基于大语言模型的软件多配置约束提取方法. 软件学报，CCF-A类中文期刊, 2025. [8] Tong Zhou, Chenxi Zhang, Xin Peng, Zhenghui Yan, Pairui Li, Jianming Liang, Haibing Zheng, Wujie Zheng, and Yuetang Deng. TraceStream: Abnormal Service Localization based on Trace Data Stream Clustering with Online Feedback. 34th IEEE International Symposium on Software Reliability Engineering (ISSRE 2023), CCF-B类会议, 2023. [9] Ke Zhang, Chenxi Zhang, Xin Peng, and Chaofeng Sha. PUTraceAD: Trace Anomaly Detection with Partial Labels based on GNN and PU Learning. 33rd IEEE International Symposium on Software Reliability Engineering (ISSRE 2022), CCF-B类会议, 2022. [10] Dewei Liu, Chuan He, Xin Peng, Fan Lin, Chenxi Zhang, Shengfang Gong, Ziang Li, Jiayu Ou, and Zheshun Wu. MicroHECL: High-Efficient Root Cause Localization in Large-Scale Microservice Systems.  43rd IEEE/ACM International Conference on Software Engineering: Software Engineering in Practice (ICSE (SEIP) 2021), CCF-A类会议,  2021. 荣誉奖项： ● 2024 CCF 软件工程专业委员会博士学位论文激励计划提名奖 ● 2024 ISSRE 2024 Artifact Distinguished Reviewer 学术服务： ● 期刊审稿人 ● ACM Transactions on Software Engineering and Methodology ● Empirical Software Engineering ● Journal of Software: Evolution and Process ● Journal of Systems and Software ● 软件学报 ● Transactions on Network Science and Engineering ● 会议程序委员会委员 ● Research Track, SANER 2025 ● Artifact Evaluation Track, ICSE 2025 ● Junior PC-Track, MSR 2025 ● Cloud Intelligence / AIOps 2025 ● AI IDE 2025 ● Artifact Evaluation Track, ISSRE 2024 ● Data Challenge Track, ICPE 2024 ● Tool Demo Track, ISSTA 2023 谷歌学术：https://scholar.google.com.hk/citations?hl=zh-CN&user=Ds3dvEMAAAAJ 教育经历Education Background 工作经历Work Experience 2020.09 2024.06 复旦大学 软件工程 博士研究生毕业 工学博士学位 2015.09 2018.06 西安交通大学 信息与通信工程 硕士研究生毕业 工学硕士学位 2011.09 2015.06 华南理工大学 信息工程 大学本科毕业 工学学士学位 2024.06 至今 西安电子科技大学 华山菁英副教授 2023.08 2024.04 微软亚洲研究院 2018.08 2020.08 华为技术有限公司 研究方向Research Focus 社会兼职Social Affiliations 暂无内容 阿里云龙蜥社区系统运维联盟委员会委员 版权所有：西安电子科技大学　陕ICP备05016463号 手机版 访问量：次 最后更新时间： ..",
  "content_length": 4674,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:01"
}