{
  "name": "Chenfanfu Jiang",
  "homepage": "https://www.math.ucla.edu/~cffjiang",
  "status": "success",
  "content": "Chenfanfu Jiang Chenfanfu Jiang ProfessorDepartment of Mathematics University of California, Los Angeles Lab: Slichter Hall 3860 Office: MS 7619E chenfanfu.jiang-at-gmail.com UCLA Artificial intelligence & Visual Computing Laboratory Research interest: visual computing, physical AI, 3D generative AI, embodied AI, robotics. Publications | CV | Google Scholar | Physics-Based Simulation (Book) My current research centers on the intersection of physical AI and visual computing. My group builds the algorithms, simulators, and learning systems that let intelligent agents perceive, reason, and act in the physical world. We extend generative AI with spatial, temporal, and physical understanding, so models handle contact and deformation, obey physical constraints, and transfer to real embodied systems. Simulation. Robust, accurate, and scalable 3D dynamics—contact, deformation, fracture, grains—on GPUs; differentiable pipelines and digitalâtwin environments. IPC · Embedded IPC · JGS2 · ABD · MLSâMPM · AnisoMPM · MultiâGPU MPM · XPBI Generation. Multimodal generative models, neural rendering, and physically grounded world models that produce largeâscale 3D/4D synthetic data for training and evaluation. Painting · Dressâ1âtoâ3 · ARM · PhysGaussian · Atlas3D · VRâGS · PhysAnimator · ElastoGen · PhysMotion Robot Learning. Training and validation stacks for contactâ and tactileârich robot policies, with principled simâtoâreal transfer and closedâloop benchmarks. Taccel · GRIP · RightâSideâOut · Data Glove · Mirroring · BAT UAV · Pouring · VR Platform Goal: close the loop between pixels, physics, and policy. Bio: Chenfanfu Jiang is a Professor of Mathematics and the director of the Artificial Intelligence and Visual Computing (AIVC) Lab at UCLA. He primarily works on 3D visual computing, physical AI, 3D generative AI and embodied AI. He has developed well-known physics simulators such as APIC, MLS-MPM, and IPC. His research has been supported by NSF, DOE, Toyota, Amazon, Style3D, Sony, Adobe, and Snap. He has received Ph.D. dissertation award from UCLA, CAREER award from NSF, faculty awards from Amazon, Style3D, and Sony, as well as best paper awards/honorable mentions at SIGGRAPH, SCA, MIG, ICRA, and IROS. He received his Ph.D. from UCLA in 2015, co-advised by Demetri Terzopoulos and Joseph Teran. He was an Assistant Professor of CIS at UPenn from 2017 to 2021.",
  "content_length": 2419,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:53"
}