{
  "name": "Chen Ma 0001",
  "homepage": "https://allenjack.github.io",
  "status": "success",
  "content": "About - Chen's Homepage About | Chen’s Homepage Link Search Menu Expand Document Chen's Homepage Welcome to Chen Ma’s Homepage Chen Ma (马辰) Assistant Professor Data Intelligence Lab Department of Computer Science City University of Hong Kong (CityU)Hong Kong SAR Email: /chenma/ [at] cityu [dot] edu [dot] hk Google Scholar, Linkedin, Github News [11/2025]: Two papers about Vision Models Interpretability and Protein Virtual Screening are accepted by AAAI 2026. [11/2025]: Bowei successfully passed the PhD Oral Defense! [10/2025]: One paper about Collaborative Information Understanding is accepted by WSDM 2026. [10/2025]: One paper about Graph Neural Network Pretraining is accepted by TKDD. [10/2025]: One paper about Multimodal Graph Completion is accepted by TOMM. [09/2025]: Two papers about LLM Data Curation and Semantic Retrieval Recommendation are accepted by NeurIPS 2025. [08/2025]: One paper about LLM Consistency Alignment is accepted by EMNLP 2025. [08/2025]: One paper about Causality-aware Recommendation is accepted by CIKM 2025. [05/2025]: One paper about LLM-as-a-judge is accepted by ACL 2025. Past News [02/2025]: One paper about Composed Image Retrieval is accepted by IEEE TMM. [02/2025]: One paper about CNN-based Map Matching is accepted by IEEE TMC. [01/2025]: One paper about LLM for Graph is accepted by DASFAA 2025. [01/2025]: Three papers about LLM are accepted by ICLR 2025. [12/2024]: One paper about Item Valuation for Recommendation is accepted by SDM 2025. [12/2024]: One paper about Graph Molecular Representation is accepted by AAAI 2025. [11/2024]: One paper about Causal Effect Estimation is accepted by IEEE TKDE. [11/2024]: One paper about Robust Uplifting is accepted by SIGKDD 2025. [10/2024]: One paper about Click-through Rate Prediction is accepted by WSDM 2025. [09/2024]: Papers about LLM Performance Prediction and Model Editing are accepted by EMNLP 2024. [07/2024]: Papers about Triplet Shapley and Generative Recommendation are accepted by CIKM 2024. [07/2024]: Received the General Research Fund (GRF) grant from Research Grants Council HK. [05/2024]: One paper about Knowledge-aware Recommendation is accepted by ECML-PKDD 2024. [05/2024]: One paper about Uplift Modeling is accepted by SIGKDD 2024. [03/2024]: One survey paper about Recommendation Diversification is accepted by IEEE TKDE. [01/2024]: One paper about Knowledge Distillation is accepted by ICLR 2024. [12/2023]: One paper about Causal Effect Estimation is accepted by SDM 2024. [09/2023]: Two papers about Uplift Modeling and CTR Prediction are accepted by NeurIPS 2023. [09/2023]: One paper about Uplift Modeling is accepted by ICDM 2023. [08/2023]: Papers about Embedding Size Search and Long-tail Recommendation are accepted by CIKM 2023. [07/2023]: Received the Early Career Scheme (ECS) grant from Research Grants Council HK. [05/2023]: One paper about Multi-mention Entity Linking is accepted by UAI 2023. [05/2023]: One paper about Tag Recommendation is accepted by SIGKDD 2023. [04/2023]: One short paper about User Segmentation is accepted by SIGIR 2023. [03/2023]: One paper about Edge Caching is accepted by IEEE ICME 2023. [02/2023]: One paper about Few-shot Triple Extraction is accepted by IEEE ICASSP 2023. [02/2023]: One paper about Recommender Simulator is accepted by IEEE ICDE 2023. [01/2023]: Papers about Streaming Recommendation and Controllable Fairness are accepted by TheWebConf 2023. [11/2022]: One paper about Continual Recommendation is accepted by AAAI 2023. [11/2022]: One paper about Tag-enhanced Recommendation is accepted by IEEE ICDE 2023. [11/2022]: One paper about Meta Auxiliary Learning is accepted by IEEE TKDE. [10/2022]: One paper about Continual Learning is accepted by Neural Computation. [10/2022]: One paper about Quantization is accepted by WACV 2023. [08/2022]: One paper about answering coding questions is accepted by COLING 2022. [08/2022]: One paper about Multi-objective Fair Recommendation is accepted by ACM TOIS. [08/2022]: One paper about the Weighted BPR Loss is accepted by CIKM 2022. [05/2022]: One paper about Quantization for Recommendation is accepted by SIGKDD 2022. [04/2022]: Congratulations to Shengyin for receiving the HKPFS award! [03/2022]: One paper about Multisided Fairness for Recommendation is accepted by SIGIR 2022. Research Interests Chen’s research lies in the theory of Data Mining, Data-Driven AI, Data Valuation, and their applications in Recommender Systems Knowledge Graphs Natural Language Processing Social Computing/Social Good Opening: I am looking for self-motivated PostDoc and PhD students who are interested in pursuing data mining and machine learning research in recommender systems, knowledge graphs, natural language processing, or social computing. Feel free to shoot me an email (allenmc1230@gmail.com), with your CV, transcript, and publication. A Chinese version about openings. Note: I am open to any kind of collaboration, feel free to shoot me an email if you have any ideas. Biography Chen is an Assistant Professor in the Department of Computer Science, at the City University of Hong Kong since August 2021. Before that, Chen got his PhD from the School of Computer Science, McGill University, supervised by Prof. Xue (Steve) Liu. In the meantime, he also closely worked with Prof. Mark Coates. Before joining McGill, he received his MS and BS degrees in Software Engineering from Beijing Institute of Technology. He is also a core developer of a Java open-source library on recommender systems–LibRec. Education PhD, School of Computer Science, McGill University, Canada, Sep. 2015 ~ Jul. 2021 Master, School of Software Engineering, Beijing Institue of Technology, Sep. 2013 ~ Jun. 2015 Bachelor, School of Software Engineering, Beijing Institue of Technology, Sep. 2009 ~ Jun. 2013 Industry Experience Research Intern, Huawei Noah’s Ark Lab Montreal Research Center, Apr. 2019 ~ Aug. 2021 Mentors: Yingxue Zhang, Dr. Ruiming Tang, Dr. Wulong Liu, and Dr. Yanhui Geng Proposal Collaborator, Microsoft Research Montreal, Dec. 2019 ~ Dec. 2021 Mentors: Dr. Fernando Diaz and Dr. Bhaskar Mitra Awards Excellent Research Intern of Huawei Noah’s Ark Lab, 2020 Excellent Graduate Scholarship of McGill, School of Computer Science, From 2015 to 2019 National Scholarship for Graduate Students, Ministry of Education of China, 2014 Champion, RoboCup Soccer Middle Size League Competition, RoboCup China Open, 2013 (Media Press) 4-th Place, RoboCup Soccer Middle Size League Competition, RoboCup Eindhoven World Final, 2013 (Media Press) Teli Xu Scholarship, 2012 (The most prestigious scholarship in Beijing Institute of Technology, and the annual selection ratio is 12/12000 among undergraduates) Acknowledgement This site uses Just the Docs, a documentation theme for Jekyll. Many thanks for the contribution.",
  "content_length": 6834,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:49"
}