{
  "name": "Chengjun Liu",
  "homepage": "http://cs.njit.edu/liu",
  "status": "success",
  "content": "Chengjun Liu's Home Page Chengjun Liu (CV) Professor Department of Computer Science New Jersey Institute of Technology Newark, NJ 07102 Email: chengjun.liu@njit.edu Phone: 973-596-5280 Office: GITC 4306 Research Interests Pattern Recognition (Face/Iris Recognition, Color Image Feature Extraction and Classification, Classifier Fusion) Machine Learning (Statistical Learning, Kernel Methods, Innovative Kernel Functions/Models, Similarity Measures) Computer Vision (Object/Face/Iris/Eye Detection, Motion Analysis and Video Processing) Image and Video Analysis (Image Search and Retrieval, Image Category Classification, Color Image Analysis, New Color Spaces, Gabor Image Representation) Security (Biometrics) Patents C. Liu: \"Face Detection Method and Apparatus\", United States Patent 7,162,076, January 9, 2007. C. Liu and H. Wechsler: \"Feature Based Classification\", United States Patent 6,826,300, November 30, 2004. The Open AI Team AI/ML for Smart Energy AI/ML for Smart Health Video Analytics for Improving Traffic Safety, Home Security, Smart UAS/Drones, and Autonomous Driving Facial Recognition for Enhancing Security and Public Safety Face Recognition and Video Processing Lab Publications (by category) (by year) (citation in SCOPUS) (citation in Google Scholar) Teaching Artificial Intelligence (undergraduate) Artificial Intelligence (graduate) Pattern Recognition and Applications Computer Vision Face Recognition and Video Processing Image Processing Computer Programming and Problem Solving Recent Research AI/ML for Smart Energy -- We apply our award-winning Computer Vision, Video Analytics, Smart UAS/Drones, Edge Computing, and 5G technologies for the following example projects: Machine Learning and AI for Optimizing and Safeguarding Energy Transmission in Storms by Automatic Inspection of Electrical Wires Preventing Wildfires in Energy Transmission by Automatic Power Line Defects Detection Using Machine Learning and AI Twin Wire Crawlers for Power Line and Infrastructure Inspection and Critical Data Collection Advanced Image and Video Analytics for Detecting Power Line Defects and Infrastructure Failures Smart Energy using Innovative Computer Vision, Video Analytics, Smart UAS/Drones, Edge Computing, and 5G technologies AI/ML for Smart Health -- We apply our Innovative AI, Statistical Learning and Deep Learning Methodologies for the following example projects: AI Doctor & Digital Assistant by Capitalizing on a Mixture of AI Medical Systems for Providing the Best Care for Anyone, Anywhere, and Anytime Innovative AI Model for Accurately Predicting Margin Positivity from Intraoperative Digital Specimen Mammograms to Guide Surgical Decision-making and Reduce Re-excision Rates Innovative AI for Rosacea Detection and Innovating Interpretability of AI Models for Enhancing Trust and Adoptability Robust Parkinsons Disease Early Detection Using Advanced Open and Scalable AI with the Optimal Feature Extraction and the Bayes Classifier Deep Learning Based Prediction of Alzheimers Disease Conversion From Mild Cognitive Impairment Using Structural MRI: Toward an Early-Detection AI Doctor ASHVINI: AI Surgical Histopathology Visualization & Interpretable Network Intelligence for Glioma Detection Innovative Artificial Intelligence Framework for Medical Data Security in Large Language Models. Electronic Health Records Prediction, Laparoscopic Image Desmoking and Enhancement for Improving Surgical Visualization, Brain Trauma Detection, Automatic Liver Tumor Detection, Automatic Prostate Tumor Detection, Automatic Skin Tumor Detection, Automatic Gastric Tumor Detection Video Analytics -- Intelligent Traffic Monitoring and Control, Video Surveillance, Video Incident Detection, Video Scene Analysis, Video Object Recognition, Video Analytics for Improving Traffic Safety, Home Security, Smart UAS/Drones, and Autonomous Driving. Pattern Recognition, Machine Learning, and Image Processing -- We develop new color models, advanced pattern recognition and machine learning methods, and fuse them to address large-scale and grand-challenge problems, such as the face recognition grand challenge (FRGC) problem and the Caltech 256 image categories image search and classification problem. By fusing our new kernel methods (kernel Fisher analysis, kernel PCA with fractional power polynomial models), new color models, new similarity measures, we achieve the best face verification performance for the government organized FRGC competition. By fusing new color models with popular image descriptors, such as the scale-invariant feature transform (SIFT) and the local binary patterns (LBP), we are able to develop new image descriptors with improved image search and image category classification performance. Computer Vision -- We develop new statistical methods for more accurate and efficient target detection from image and video. One example is an efficient support vector machine (eSVM).  The eSVM, which introduces a single value for all the slack variables corresponding to the training samples on the wrong side of their margin, defines a much smaller set of support vectors and hence improves computational efficiency without sacrificing generalization performance. Another example is feature local binary patterns (FLBP).  The FLBP method, which encodes both local and feature information, improves upon the popular LBP approach for texture description and pattern recognition. Yet another example is the Bayesian discriminating features (BDF) method.  The BDF method, when trained on images from only one database yet works on test images from diverse sources, displays robust generalization performance for face detection. The eSVM, FLBP, and BDF methods have been successfully applied to automatic target detection on large-scale and challenging databases, such as eye detection and face detection. Biometrics and Security -- We have developed advanced face recognition, face detection, iris detection and recognition, image search, and image category classification technologies for homeland security, justice and law enforcement, and business applications.",
  "content_length": 6110,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:00"
}