{
  "name": "Chen Yuan 0003",
  "homepage": "https://infosec.sjtu.edu.cn/DirectoryDetail.aspx?id=161",
  "status": "success",
  "content": "袁晨-上海交通大学网络空间安全学院 简体中文 | English 首 页 学院概况 欢迎辞 学院介绍 组织结构 学院领导 历任领导 学院办公室 联系我们 师资队伍 教师名录 两院院士 会士 国家级人才计划 国家网络安全奖 其他人才计划 学院新闻 科学研究 科研方向 科研基地 科研团队 科研成果 人才培养 三全育人 本科生 硕士研究生 博士研究生 工程硕士生 国际联合培养项目 教学研究室 党建工作 党建动态 学习园地 招聘专栏 教职招聘 博士后招聘 通知通告 通知通告 信息公开 师资队伍 教师名录 两院院士 会士 国家级人才计划 国家网络安全奖 其他人才计划 首页 » 师资队伍 » 教师名录 chen_yuan@sjtu.edu.cn 闵行校区软件大楼5209室 个人主页 袁晨 副院长，长聘教轨副教授 2008年6月毕业于复旦大学数学科学学院，获数学学士学位。2013年6月毕业于复旦大学计算机学院，获计算机软件与理论博士学位，2017年6月毕业于新加坡南洋理工大学，获数学博士学位，博士论文获得新加坡数学协会优秀博士论文奖章。2018年至2020年期间，在荷兰国家数学计算机中心CWI密码组从事博士后研究，2021年1月加入上海交通大学网络空间安全学院。主要研究方向为安全多方计算，秘密分享，代数编码，局部可修复码，列表译码等。论文发表于Crypto，Eurocrypt，SODA，Asiacrypt，TCC，ICALP，RANDOM，IEEE transactions on Information Theory，Transactions of AMS等重要学术会议和期刊上。 研究兴趣 教育背景 工作经验 教授课程 论文发表 项目资助 获奖信息 学术服务 安全多方计算，秘密分享，代数编码，局部可修复码，列表译码等 1. Chaoping Xing, Chen Yuan, Beating the probabilistic lower bound on perfect hashing. SODA 2021 （CCF A 类会议） 2. Serge Fehr, Chen Yuan, Robust Secret Sharing with Almost Optimal Share Size and Security Against Rushing Adversaries. TCC (3) 2020: 470-498. （CCF B类会议） 3. Ronald Cramer, Chaoping Xing, Chen Yuan, On the Complexity of Arithmetic Secret Sharing. TCC (3) 2020: 444-469. （CCF B类会议） 4. Mark Abspoel, Ronald Cramer, Ivan Damgard, Daniel Escudero, Matthieu Rambaud, Chaoping Xing, Chen Yuan, Asymptotically Good Multiplicative LSSS over Galois Rings and Applications to MPC over Z/pkZ. ASIACRYPT (3) 2020: 151-180. （亚密 CCF B类会议） 5. Mark Abspoel, Ronald Cramer, Ivan Damgard, Daniel Escudero, Chen Yuan, Efficient Information-Theoretic Secure Multiparty Computation over Z/pkZ via Galois Rings. TCC (1) 2019: 471-501. （CCF B类会议） 6. Chaoping Xing, Chen Yuan, Construction of optimal locally recoverable codes and connection with hypergraph. ICALP 2019: 98:1-98:13. （CCF B类会议） 7. Serge Fehr, Chen Yuan, Towards Optimal Robust Secret Sharing with Security Against a Rushing Adversary. EUROCRYPT(3) 2019: 472-499. （欧密 CCF A类会议） 8. Ignacio Cascudo, Ronald Cramer, Chaoping Xing, Chen Yuan, Amortized Complexity of Information-Theoretically Secure MPC Revisited. CRYPTO (3) 2018: 395-426. （美密 CCF A类会议） 9. Ronald Cramer, Ivan Damgard, Chaoping Xing, Chen Yuan, Amortized Complexity of Zero-Knowledge Proofs Revisited: Achieving Linear Soundness Slack. EUROCRYPT 2017: 479-500. （欧密 CCF A类会议） 10. Venkatesan Guruswami, Chaoping Xing, Chen Yuan, \"Subspace Designs Based on Algebraic Function Fields.\" ICALP 2017: 86:1-86:10. Journal version Trans. Amer. Math. Soc. 370 (2018), 8757-8775.  （CCF B类会议） 学院概况 优秀的师资团队，丰富的校园生活，温馨如家的环境，积极的学习氛围 科学研究 学院先后承担多项国家军事科研项目、国家信息安全应用示范工程等40余项 人才培养 国家教育部、科技部、上海市人民政府共同发起的国内首家信息安全专业人才培养基地 友情链接： 上海交通大学电子信息与电气工程学院 上海交通大学 Copyright © 2017 - 2019 上海交通大学网络空间安全学院 沪ICP备05052060号",
  "content_length": 2665,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:50"
}