{
  "name": "Chengqing Zong",
  "homepage": "http://www.nlpr.ia.ac.cn/cip/english/zong.htm",
  "status": "success",
  "content": "个人主页 Homepage Today is ： Chengqing Zong,   Research Fellow (Professor) National Laboratory of Pattern Recognition Institute of Automation, Chinese Academy of Sciences No.95, Zhong Guan Cun East Road Beijing 100190, China E-mail: cqzong(at)nlpr.ia.ac.cn Tel. +86-10-8254 4688 Fax +86-10-6264 7517 Bio Chengqing Zong received his Ph.D. from the Institute of Computing Technology, Chinese Academy of Sciences (CAS), in March 1998. From May 1998 to April 2000, he worked as a postdoctoral research fellow at the National Laboratory of Pattern Recognition (NLPR), Institute of Automation, CAS. After completing his postdoctoral program, he has continued his work at NLPR to the present. He is currently a professor at the Institute of Automation, CAS. He is an IEEE Fellow, a foreign member of the Academia Europaea, an ACL Fellow, a CAAI Fellow, and a CCF Fellow. His research interests include fundamental research and development in natural language processing and cognitive language computing. As a principal investigator, he has led more than 10 projects supported by the Natural Science Foundation of China, the National Key Research and Development Program of China, and others. He has authored or co-authored six books and more than 200 journal and conference papers. In 2025, he is serving as the President of the Association for Computational Linguistics. He previously served as the President of the Asian Federation of Natural Language Processing from 2019 to 2021. He also served as Program Committee Co-Chair for top-tier international conferences such as ACL 2015 and COLING 2020, and as General Conference Chair for ACL 2021. He has received numerous awards, including the Second Prize of the National Scientific and Technological Progress Award of China in 2015, one of the country's most prestigious and influential honors. Education Professional Experience Selected Publications Professional Activities Awards and Honours Invited Presentations Teaching Courses Education March, 1995 – March, 1998: Ph.D. in Computer Science and Application, Institute of Computing Technology, Chinese Academy of Sciences. September, 1987 – July, 1990:  M.S. in Computer Engineering, Department of Computer Engineering, Shandong University of Technology September, 1983 – July, 1987: B.Sc. in Computer Engineering, Department of Computer Engineering, Shandong University of Technology Professional Experience April, 2000 – present: Researcher, National Laboratory of Pattern Recognition (NLPR), Institute of Automation, Chinese Academy of Sciences ◊  Research Fellow (Professor),  June, 2004 to present ◊  Deputy Director of NLPR, October, 2006 – January, 2014 ◊  October, 2004 – January, 2005: Visiting Scholar, GETA, CLIPS-IMAG, France ◊  April, 2001 – September, 2001: Guest Researcher, SLT-ATR, Japan ◊  May, 1999 – August, 1999: Guest Researcher, SLT-ATR, Japan May, 1998 – April, 2000: Post-Doctoral Research Fellow, NLPR, Institute of Automation, Chinese Academy of Sciences July, 1990 – March, 1995: Teacher, Department of Computer Engineering, Shandong University of Technology <<<  Top Selected Publications ◆ Books Chengqing Zong, Yang Zhao and Baidu Feijiang, Foundations of Natural Language Processing and Large Models - Cases and Practice (in Chinese) (in Chinese), Tsinghua University Press, January 2024. ISBN 978-7-302-65155-0 Lecture video (open source) Resource library (for teachers) Chengqing Zong, Rui Xia, Jiajun Zhang. Text Data Mining(in English), Tsinghua University Press and Springer, 2021. ISBN 978-981-16-0100-2【 https://www.springer.com/gp/book/9789811600999】 Chengqing Zong, Rui Xia and Jiajun Zhang, Text Data Mining (in Chinese), Tsinghua University Press, December 2022 (2nd Edition) Chengqing Zong, Rui Xia and Jiajun Zhang, Text Data Mining (in Chinese), Tsinghua University Press, May 2019 Chengqing Zong. Statistical Natural Language Processing (in Chinese), Tsinghua University Press, August 2013 (2nd Edition) (The 1st edition was printed in May 2008). [Outline of the 2nd edition] (The second edition has been printed for seventeen times.) ◆ International Journal Papers Zhiyang Zhang, Yaping Zhang, Yupu Liang, Cong Ma, Lu Xiang, Yang Zhao, Yu Zhou, and Chengqing Zong. Understand Layout and Translate Text: Unified Feature-Conductive End-to-End Document Image Translation. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI). Accepted. https://doi.org/10.1109/TPAMI.2025.3530998 Xiangyu Wang and Chengqing Zong. Learning Emotion Category Representation to Detect Emotion Relations across Languages. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI). https://doi.org/10.1109/TPAMI.2025.3545447 Zhiyang Zhang, Yaping Zhang, Yupu Liang, Cong Ma, Lu Xiang, Yang Zhao, Yu Zhou, and Chengqing Zong, Fellow, IEEE. Reading when Translating: Multi-Modal Document Image Machine Translation with Reading Flow Prediction. IEEE Transactions on Audio, Speech and Language Processing (TASLP). https://doi.org/10.1109/TASLPRO.2025.3578754 Yunhao Zhang, Shaonan Wang, Nan Lin, Lingzhong Fan, Chengqing Zong. A simple clustering approach to map the human brain's cortical semantic network organization during task. NeuroImage, Feb. 2025. https://doi.org/10.1016/j.neuroimage.2025.121096 Yunhao Zhang, Xiaohan Zhang, Chong Li, Shaonan Wang, Chengqing Zong. MulCogBench: A Multi-modal Cognitive Benchmark Dataset for Evaluating Chinese and English Computational Language Models. Language Resource and Evaluation (LRE), accepted. Zirui Zhang, Yaping Zhang, Lu Xiang, Yang Zhao, Feifei Zhai, Yu Zhou, and Chengqing Zong, Fellow, IEEE. PromptDLA: A Domain-aware Prompt Document Layout Analysis Framework with Descriptive Knowledge as a Cue. IEEE Transactions on Multimedia (TMM), accepted. Lu Xiang, Yang Zhao, Yaping Zhang, Chengqing Zong. A Survey of Large Language Models in Discipline-specific Research: Challenges, Methods and Opportunities. Studies in Informatics and Control, ISSN 1220-1766, vol. 34(1), pp. 5-24, 2025. https://doi.org/10.24846/v34i1y202501 Cong Ma, Xu Han, Linghui Wu, Yaping Zhang, Yang Zhao, Yu Zhou, and Chengqing Zong. Modal Contrastive Learning based End-to-End Text Image Machine Translation. IEEE/ACM Transactions on Audio, Speech, and Language Processing (IEEE/ACM TASLP), vol. 32, pp. 2153-2165, 2024, https://doi.org/10.1109/TASLP.2023.3324540. Haitao Lin, Junnan Zhu, Lu Xiang, Yu Zhou, Jiajun Zhang, and Chengqing Zong. Topic-Oriented Dialogue Summarization. IEEE/ACM Transactions on Audio, Speech and Language Processing (TASLP), vol. 31, pp. 1797-1810, https://doi.org/10.1109/TASLP.2023.3271118. Shaonan Wang, Yunhao Zhang, Weiting Shi, Guangyao Zhang, Jiajun Zhang, Nan Lin, and Chengqing Zong. A large dataset of semantic ratings and its computational extension. Scientific Data, (2023) 10: 106,https://doi.org/10.1038/s41597-023-01995-6. Xiangyu Wang, Chengqing Zong. Learning Category Distribution for Text Classification. ACM Transactions on Asian and Low-Resource Language Information Processing (TALLIP), 22(4), 1-13, https://doi.acm.org?doi=3585279. Feihu Jin, Jinliang Lu, Jiajun Zhang, Chengqing Zong. Instance-aware Prompt Learning for Language Understanding and Generation. ACM Transactions on Asian and Low-Resource Language Information Processing (TALLIP), 22(7), 1–18. Jinghui Yan, Chengqing Zong, Jinan Xu. Combination of Loss-Based Active Learning and Semi-Supervised learning for Recognizing Entities in Chinese Electronic Medical Records. ACM Transactions on Asian and Low-Resource Language Information Processing (TALLIP), 22(5), 1-19, https://doi.acm.org?doi=3588314 Yang Zhao, Jiajun Zhang, Chengqing Zong. Transformer: A General Framework from Machine Translation to Others. Machine Intelligence Research, pp.1-25, http://doi.org/10.1007/s11633-022-1393-5 Shaonan Wang, Yunhao Zhang, Xiaohan Zhang, Jingyuan Sun, Nan Lin, Jiajun Zhang, and Chengqing Zong. An fMRI Dataset for Concept Representation with Semantic Feature Annotations. Nature- Scientific Data, (2022) 9: 721, https://doi.org/10.1038/s41597-022-01840-2 Shaonan Wang, Xiaohan Zhang, Jiajun Zhang, and Chengqing Zong. A synchronized multimodal neuroimaging dataset for studying brain language processing. Scientific Data, (2022) 9: 590. Qian Wang, Jiajun Zhang, Chengqing Zong. Synchronous Inference for Multilingual Neural Machine Translation[J]. IEEE/ACM Transactions on Audio, Speech, and Language Processing, 2022, 30:1827-1839 Yu Lu, Jiajun Zhang, Jiali Zeng, Shuangzhi Wu and Chengqing Zong. Attention Analysis and Calibration for Transformer in Natural Language Generation. IEEE/ACM Transactions on Audio, Speech, and Language Processing, 2022, 30:1927-1938. Lu Xiang, Yang Zhao, Junnan Zhu, Yu Zhou, Chengqing Zong. Zero-Shot Language Extension for Dialogue State Tracking via Pre-Trained Models and Multi-Auxiliary-Tasks Fine-tuning. Knowledge-Based Systems, 259 (2023) 110015 (https://doi.org/10.1016/j.knosys.2022.110015) Sancheng Peng, Rong Zeng, Lihong Cao, Aimin Yang, Jianwei Niu, Chengqing Zong, Guodong Zhou. Multi-source domain adaptation method for textual emotion classification using deep and broad learning. Knowledge-Based Systems, 6 December 2022, https://doi.org/10.1016/j.knosys.2022.110173 Rong Zeng, Hongzhan Liu, Sancheng Peng, Lihong Cao, Aimin Yang, Chengqing Zong, Guodong Zhou. CNN-Based Broad Learning for Cross-Domain Emotion Classification. TSINGHUA SCIENCE AND TECHNOLOGY, 12/15, 2022, pp360–369.https://doi.org/10.26599/TST.2022.9010007. Xiaomian Kang, Yang Zhao, Jiajun Zhang, Chengqing Zong. Enhancing Lexical Translation Consistency for Document-Level Neural Machine Translation. ACM Transactions on Asian and Low-Resource Language Information Processing (TALLIP), Vol.21, No.3, Article 59, pp 1–21, May 2022. Mei Li, Lu Xiang, Jiajun Zhang and Chengqing Zong. Dual-View Conditional Variational Auto-Encoder for Emotional Dialogue Generation. ACM Transactions on Asian and Low-Resource Language Information Processing (TALLIP), Vol.21, No.3, Article 46, pp 1–18, May 2022. Jian",
  "content_length": 68926,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:58"
}