{
  "name": "Chen-Nee Chuah",
  "homepage": "https://www.ece.ucdavis.edu/~chuah/rubinet/people/chuah/bio.html",
  "status": "success",
  "content": "RUbiNet - People - Chen-Nee Chuah - Biography Robust and Ubiquitous Networking Research Publications Sponsors Announcements People Contact Skip to Content | UC Davis | Electrical and Computer Engineering Rubinet Group Chen-Nee Chuah, Ph.D. Biography Curriculum Vitae Teaching Professional Service Photos Contact Directions & Parking Chen-Nee Chuah, Ph.D. AAAS & IEEE Fellow, ACM Distinguished Scientist Child Family Professor in Engineering Department of Electrical & Computer Engineering University of California, Davis One Shields Avenue, Davis, CA 95616 Brief Biography Chen-Nee Chuah is a Professor in the Department of Electrical and Computer Engineering at University of California, Davis. Chuah received her B. S. in Electrical Engineering from Rutgers University in 1995, and her M. S. and Ph.D. in Electrical Engineering and Computer Sciences from U. C. Berkeley in 1997 and 2001, respectively. From 2001 to 2002, she was a visiting researcher of the IP-Group at Sprint Advanced Technology Laboratories in Burlingame, CA. She joined UC Davis as a full-time Assistant Professor in July 2002, and currently leads the Robust and Ubiquitous Networking (RUBINET) Research Group. Chuah's research interests lie broadly in communications and computer networks, and wireless/mobile computing, with emphasis on Internet measurements and analysis, anomaly detection, architecture of the future Internet, network management, and big data applied to online social networks, intelligent transportation systems, and health informatics. Chuah is a Fellow of the AAAS and IEEE, and an ACM Distinguished Scientist. She received the National Science Foundation CAREER Award in 2003 for her research on Robust, Stable, and Secure Routing. She received the UC Davis College of Engineering Outstanding Junior Faculty Award in 2004. She was named a UC Davis Chancellor's Fellow (2008-13) and was honored with the ADVANCE Scholar award (2020). She was appointed as the College of Engineering Child Family Professor in Engineering in 2020. In 2021, she earned the Outstanding Instructor Award from the IEEE UC Davis branch. Chuah has served on the technical program committee of several ACM and IEEE conferences and workshops (including SIGCOMM, INFOCOM, IMC, MOBICOM, and SECON). She received the ACM Recognition Award for co-organizing the First Workshop on Vehicular Ad Hoc Network (VANET) in 2004. She was the TPC vice-chair of IEEE GLOBECOM 2006 and the co-Chair of IEEE IWQoS 2007. She has served as the Associate Editor of IEEE/ACM Transactions on Networking (2008-2013) and Associate Editor of IEEE Transactions on Mobile Computing (2016-2020). She is currently an Associate Editor of IEEE Internet of Things Journal. Research Interests Computer networks and Distributed Systems Internet Measurements Security and Privacy AI-driven IoTs ML/AI in Smart Health Intelligent Transportation Systems Department of Electrical and Computer Engineering :: University of California Davis :: One Shields Avenue :: Davis, CA 95616 Page Updated June 04, 2024, 4:48 PM Copyright © UC Regents, Davis Campus. All Rights Reserved.",
  "content_length": 3106,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:51"
}