{
  "name": "Chengqi Zhang",
  "homepage": "https://chengqi-zhang.github.io",
  "status": "success",
  "content": "Chengqi ZHANG （张成奇） Chair Professor of AI （人工智能讲座教授） Director of PolyU Shenzhen Research Institute （香港理工大学深圳研究院 院长) BSc (Fudan U), MSc (Jilin U), PhD (Queensland U) DSc（Deakin U） Research Areas: Distributed Artificial Intelligence and Data Mining Employment: Prof Chengqi Zhang had joined the Department of Data Science and Artificial Intelligence at The Hong Kong Polytechnic University (PolyU) as a Chair Professor of Artificial Intelligence in September 2024.  He had been appointed as the Director of PolyU Shenzhen Research Institute from 1 January 2025. He had been appointed as a Pro Vice-Chancellor (China Enterprise) on 1 December 2017 till 30 November 2025 at the University of Technology Sydney (UTS), a Distinguished Professor on 27 February 2017 till 2027 at UTS, and a Research Professor of Information Technology from 14 December 2001 at UTS.  Before 2001, he was an Associate Professor from January 1999 to December 2001 at Deakin University, an Associate Professor from January 1998 to January 1999 at the University of New England (UNE), a Senior Lecturer from January 1994 to January 1998 at UNE, and a Lecturer from January 1990 to January 1994 at UNE. In addition, he had been appointed as an Adjunct Professor from 20 March 2017 till 20 March 2020 at University of New South Wales (UNSW) and as a Honorary Professor from 1 March 2015 to 31 December 2017 at University of Queensland (UQ). Education: Prof. Zhang obtained his Bachelor's degree from Fudan University in March 1982 in Computer Science, Master's degree by research from Jilin University in March 1985 in Artificial Intelligence, PhD degree from The University of Queensland in October 1991 in Artificial Intelligence, followed by a Doctor of Science (DSc – Higher Doctorate) from Deakin University in October 2002 in Artificial Intelligence. Achievements: He has achieved outstanding research results and provided excellent leadership during his academic career. His research interests mainly focus on Distributed Artificial Intelligence and Data Mining. A prolific contributor to his field, Professor Zhang has published over 396 scholarly articles, including a number of papers in first-class international journals, such as Artificial Intelligence, IEEE, and ACM Transactions. As per Google Scholar, his body of work has attracted more than 38,800+ citations, in which the citations of one paper is more than 10,000 (11,704), and an H-index of 73 (on 06/04/2025). He has supervised 39 PhD students as the principal supervisor, a notable 10 of whom have ascended to full professorships. He has been a sought-after keynote speaker at 37 international conferences. His dedication earned him the NSW Science and Engineering Award (2011) and the Vice-Chancellor's Award for Outstanding Research in Leadership at UTS (2011). He was also awarded the 2021 IEEE International Conference on Data Mining (ICDM) Outstanding Service Award. Leaderships: On 16 April 2008, he accepted a position as the founding Director of the UTS Priority Research Centre for Quantum Computation & Intelligent Systems (QCIS) till 2 January 2017.  Under his leadership, the Centre has attracted research funding in excess of $16.9 million from the Australian Research Council (ARC) and industries and attracted ten ARC Future Fellowships and five ARC DECRAs awards.  QCIS has become the strongest IT research centre among Australian Universities. In consequence, QCIS has helped UTS Computer Science to be ranked among the top 100 universities by QS 2021, and No. 17 worldwide based on Shanghai JiaoTong University’s academic rankings in 2021. QCIS has established five joint research centres with Tsinghua University, Shanghai JiaoTong University, Huazhong University of Science and Technology, Beijing Institute of Technology, and the Chinese Academy of Sciences. QCIS has spin-off into two new research centres in 2017 as Centre for Quantum Software and Information (CQSI) and the Centre for Artificial Intelligence (CAI). Professor Zhang has been recently appointed as the Director of HK PolyU Shenzhen Research Institute.  He will play the important role as a leader. Professional: Prof. Zhang is a Fellow of the Australian Computer Society (ACS) and a Senior Member of the IEEE Computer Society (IEEE). Additionally, he served in the ARC College of Experts from 2012 to 2014. He had been elected as the founding Chair of the Steering Committee of the International Conference on Knowledge Science, Engineering, and Management between 2006 and 2014. He has been serving as an Associate Editor for international journals, including IEEE Transactions on Knowledge and Data Engineering from 2005 to 2008; and he served as General Chair for a number of international Conferences including ICDM 2010, KDD 2015 and IJCAI 2024. He was appointed as the first IJCAI Sponsorship Officer from 2018 to 2023. In addition, he has been elected as the Chairman of the Australian Computer Society National Committee for Artificial Intelligence since November in 2005, and he has been elected as the Chairman of IEEE Computer Society Technical Committee of Intelligent Informatics (TCII) from June 2014 to June 2018. Furthermore, he has been invited to be the judge of IJCAI award committee from 2021 to 2023 and the judge of MIT Technology Review Innovators Under 35 – TR35 from 2021 to 2024 for China and Asia-Pacific regions. Selective Publications and Citations: Publications from the DBLP link Citations from Google Scholar PhD opportunities: If you believe that you are an excellent PhD candidate in AI related research area, and you are interested in to pursuit PhD study under my supervision, please feel free to send me your CV and research proposal. Hobbies: Professor Zhang spent over 50 years developing the unique method of \"Magic Multiplication\" and authored the book of the same name. This book revolutionizes traditional methods of squaring, multiplication, and square root calculations. The Chinese edition 《魔数乘法》has been published in two editions, and the English edition has been published once. Academician Lu Ruqian refers to it as the \"Zhang Chengqi Speed Calculation Algorithm\" or \"Zhang Chengqi Thinking Training Method.\" Academician Tang Tao believes that \"Magic Multiplication\" can cultivate interest in primary and secondary school students, driving them through hobbies to naturally become close to numbers and enjoy mathematics. This book is expected to have a significant impact on mathematics education in Chinese primary and secondary schools. Contact information: Room GH805 Department of Data Science and Artificial Intelligence The Hong Kong Polytechnic University, Hung Hom, Kowloon Hong Kong, CHINA Chengqi.zhang@polyu.edu.hk",
  "content_length": 6705,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:58"
}