{
  "name": "Chenlei Lv",
  "homepage": "https://aliexken.github.io/index.html",
  "status": "success",
  "content": "Chenlei Lv | Home Chenlei Lv/吕辰雷 Researchgate Link Email: aliexken at 163 dot com I am currently an Assistant Professor in the VCC Lab at Shenzhen University. Before that, I got my Phd from Beijing Normal University (2019), supervised by A.P. Xin Zheng and Prof. Zhongke Wu. Then, I began my postdoctoral research work (2019~2022) at Nanyang Technological University, supervised by Prof. Weisi Lin (IEEE Fellow). My interests include Geometric Analysis of Mathmatic, Computer Graphic, 3D Vision, etc. I have published several papers for face recognition, face classification, face modeling, shape analsyis, 3D point cloud and mesh processing. Recently, I am working for point cloud-based semantic analysis and urban scene reconstruction. 常年招收硕士研究生，欢迎来信咨询。 查看详情... News [News] Aug, 2025 - The accepted 2025 CCF CAD/CG paper is honored with the Best Paper Award. [News] Aug, 2025 - One paper, \"PKSS-Align\" is accepted by IEEE TVCG. More... Funding Programs（基金项目） 国家自然科学基金面上项目: 城市场景复杂单体建模, 2026-2029（主持） 深圳市自然科学基金面上项目, 2025-2028（主持） 国家重点研发项目子课题: 语义化建模, 2025-2028（主持） 深圳市鹏城孔雀计划新引进高精尖缺人才科研项目, 2024-2027（主持） 广东省青年拔尖人才项目: 城市数据语义解析研究, 2024-2027（主持） 国家海外博士后人才引进项目: 深度内蕴网络理论研究，2024-2027（主持） 广东省粤深联合青年基金项目: 城市三维场景重建, 2023-2026（主持） 国家自然科学基金面上项目: 颅骨身份认证, 2022-2025（参与） 新加坡教育部Tier1项目: LiDAR Depth Map Quality Assessment, 2021-2023（参与） 新加坡教育部Tier2项目: 3D Point Cloud Compression and Management, 2016-2020（参与） 国家重点研发项目子课题: 复杂场景高效编辑, 2017-2021（参与） 国家重点研发国际合作专项: 大规模医学影像处理, 2017-2020（参与） 北京市自然科学基金面上项目: 人群脑血管分割研究, 2017-2019（参与） Academic Services（学术服务） Reviewer ACM Trans. on Graphics/SIGGRAGH/SIGGRAGH Asia IEEE Trans. on Pattern Analysis and Machine Intelligence Computer Vision and Pattern Recognition Conference (CVPR) IEEE Trans. on Visualization and Computer Graphics IEEE Trans. on Multimedia IEEE Trans. on Circuits and Systems for Video Technology Computer-Aided Design Pattern Recognition The Visual Computing Neurocomputing Knowledge-based System Computers & Graphics-UK Geometric Modeling and Processing International Conference on Multimedia and Expo (ICME) Learning on Graphs Conference Program Committees 2025 AAAI Program Committee (程序委员) 2025 CCF CAD/CG专委会启明星图形学夏令营 (组织主席) 2025 CSIG智能图形前沿讨论会 (学生论坛主席) 2025 CCF CAD/CG全国计算机辅助设计与图形学学术会议 (程序委员) 2023 Int. Conf. on Multimedia and Expo (ICME Area Chair) 2023 Int. Conf. on Computational Visual Media (CVM Session Chair) Professional Societies Editorial board member of The Visual Computing CCF CAD/CG Committee Member CSIG (China Society of Image and Graphics) Member CSIG Intelligent Graphics Committee Member IEEE Member ACM Member AG (AsiaGraphics) Member Lessons Cooperates Welcome to contact me. I am looking for cooperation in the following areas. 3D Shape Retrival in a large 3D model databases. (Rigid or Non-rigid) 3D Face Recognition, Classification, Expression Analsyis, and Face Modeling. Automatically Indoor Modeling System by Multimodal Input. (Voice, Sketch, or Hand Touch) Point Cloud Processing for single object or large scale data Any challaging research works in the fields of CG, CV or AI. The template of the website reference Angel",
  "content_length": 3096,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:00"
}