{
  "name": "Chengqing Li",
  "homepage": "http://www.chengqingli.com",
  "status": "success",
  "content": "Homepage of Chengqing Li Prof. Chengqing Li, FIET M.Sc. ZJU, Ph.D. CityU School of Computer Science, Xiangtan University, Xiangtan 411105, China Email: ChengqinggATgmail.com lichengqingAThnu.edu.cn¡¡ Chinese Homepage Research Interests Multimedia security: multimedia privacy protection, design and analysis of image/video encryption scheme Security-oriented signal processing and network analysis; Analytic number theory Complex networks: network analysis, digital chaotic dynamics Scientometrics 0000-0002-5385-7644 AuthID.Scopus.Elsevier h-index: 38 Citations.Google h-index: 41 Refereed Journals The list of reviewed publications (Verified reviews via WoS) IEEE Transactions on Information Forensics & Security (Score Sheet) Representative Papers Author's page in IEEEXplore C. Li, X. Lu, K. Tan, G. Chen ¡°The graph structure of Chebyshev permutation polynomials over ring Z_{p^k},¡± IEEE Transactions on Information Theory, vol. 71, no. 2, pp. 1419-1433, 2025 doi C. Li, K. Tan ¡°The graph structure of Baker's maps implemented on a computer,¡± IEEE Transactions on Computers, vol. 74, no. 5, pp. 1524-1537, 2025 doi C. Li, K. Tan, B. Feng, J. L¨¹ ¡°The graph structure of the generalized discrete Arnold's Cat map¡±, IEEE Transactions on Computers, vol. 71, no. 2, pp. 364-377, 2022 doi Latex Source Files ESI Highly Cited Paper H. Zhu, Z. Gao, J. Wang, Y. Zhou, C. Li* ¡°Few-shot fine-grained image classification via multi-frequency neighborhood and double-cross modulation,¡± IEEE Transactions on Multimedia, vol. 28, pp. 10264-10278, 2024 doi S. Zhou, X. Deng, C. Li*, Y. Liu, H. Jiang ¡°Recognition-oriented image compressive sensing with deep learning,¡± IEEE Transactions on Multimedia, vol. 25, pp. 2022-2032, 2023 doi S. Zhou, Y. He, Y. Liu, C. Li, J. Zhang ¡°Multi-channel deep networks for block-based image compressive sensing,¡± IEEE Transactions on Multimedia, vol. 23, pp. 2627-2640, 2021 doi Latex Source Files Codes C. Li, B. Feng, S. Li, J. Kurths, G. Chen ¡°Dynamic analysis of digital chaotic maps via state-mapping networks,¡± IEEE Transactions on Circuits and Systems I: Regular Papers, vol. 66, no. 6, pp. 2322-2335, 2019 doi Latex Source Files Codes 2022 IEEE Guillemin-Cauer Best Paper Certificate X. Peng, C. Li*, Y. Zeng, C.-L. Li ¡°Adjusting dynamics of Hopfield Neural Network via time-variant stimulus,¡± IEEE Transactions on Circuits and Systems I: Regular Papers, vol. 71, no. 8, pp. 3242-3255, 2024 doi Latex Source Files Codes N. Wang, C. Li, H. Bao, M. Chen, B. Bao ¡°Generating multi-scroll Chua¡¯s attractors via simplified piecewise-linear Chua¡¯s diode,¡± IEEE Transactions on Circuits and Systems I: Regular Papers, vol. 66, no. 22, pp. 4767-4779, 2019 doi Latex Source Files C. Li, X. Shen, S. Liu ¡°Cryptanalyzing an image encryption algorithm underpinned by 2D lag-complex Logistic map,¡± IEEE MultiMedia, vol, 30, no. 1, pp. 99-109, 2024 doi C. Li, D. Lin, J. L¨¹, F. Hao ¡°Cryptanalyzing an image encryption algorithm based on autoblocking and electrocardiography,¡± IEEE MultiMedia, vol. 25, no. 4, pp. 46-56, 2018 doi Latex Source Files Codes L. Chen, C. Li*, C. Li ¡°Security measurement of a medical image communication scheme based on chaos and DNA coding,¡± Journal of Visual Communication and Image Representation, vol. 83, no. 103424, 2022 Latex Source Files 2023 JVCI Best Paper Runner-Up Certificate Editorship 2019.03-2024.12 Associate editor, Signal Processing, Elsevier 2015.01-2024.12 Associate editor, International Journal of Bifurcation and Chaos, World Scientific Work/Visit Experiences Dec 2017-Aug 2020, College of Computer Science and Electronic Engineering, Hunan University, China Jun 2017-Dec 2017, Humboldt University of Berlin, Germany Dec 2016-Jun 2017, School of Computing Science, Newcastle University, England Apr 2013-Jul 2014, Dept of Computer Science, Konstanz University, Germany Oct 2008-Mar 2011, Dept of Electronic and Information Engineering, The Hong Kong Polytechnic University Awards 2022 IEEE Transactions on Circuits and Systems Guillemin-Cauer Best Paper Certificate 2017 DAAD-K.C.Wong Fellowships, German Academic Exchange Service (DAAD), Germany 2012 Humboldt Research Fellowship, Alexander von Humboldt Foundation, Germany 2009 The Hong Kong Polytechnic University's Postdoctoral Fellowship, Hong Kong Research Grants PI, ¡°Structure identification and optimization of industrial internet via cyberspace surveying,¡± Jan 2023-Dec 2025 Preliminary Program of the Major Research Plan of the National Natural Science Foundation of China (no. 92267102) PI, ¡°Data-driven security analysis and design of image privacy protection schemes,¡± Jan 2018-Dec 2021 General program of National Natural Science Foundation of China (no. 61772447) PI, ¡°Dynamical degradation of chaotic systems in digital domain,¡± Apr 2012-Mar 2014 Joint program of National Natural Science Foundation of China and Royal Society, UK Membership 2013- Senior Member, Institute of Electrical and Electronics Engineers (IEEE) 2023- Fellow, Institution of Engineering and Technology (IET) Miscellaneous Records My articles at arXiv, DBLP Miscellaneous Resources on Doing Research Chinese Resources on Doing Research Blogs for Chinese Research Students Updated on Apr 9, 2025 ¡¡",
  "content_length": 5240,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:58"
}