{
  "name": "Chen Tian 0001",
  "homepage": "https://cs.nju.edu.cn/tianchen",
  "status": "success",
  "content": "Chen Tian ( NJU ) Home Publications Students Services Biography CitationMaster Chen Tian Professor Ph.D Advisor 国家杰出青年基金获得者 State Key Laboratory for Novel Software Technology, School of Computer Science, Nanjing University. Email: tianchen AT nju DOT edu DOT cn Mailing address: Mailbox H008, School of Computer Science, Nanjing University, No.163 Xianlin Avenue, Nanjing, China, 210023 Current Research Interests Datacenter networking Distributed systems (especially machine learning systems and graph processing systems) Digital twins of digital systems Internet protocols Prospective Students I am looking for organized, motivated Students to work on a variety of exciting topics. We welcome candidates with solid background and strong interests in distributed systems. Capability of mathematical modeling/analysis and solid programming skills are even better. Please contact me by email with your CV. **News** [2025.07] Paper: BIAN accepted by SIGCOMM 2025. [2025.06] Paper: Sectric accepted by VLDB 2025. [2025.05] Paper: HotPrefix accepted by SIGMOD 2026. [2025.04] Paper: Astral accepted by SIGCOMM 2025. [2025.04] Paper: Hermes accepted by ATC 2025. [2025.04] Award: PrioPlus was named “best student paper” of EUROSYS 2025. [2025.02] Paper: Courier accepted by TPDS. [2025.02] Paper: Chengyuan's Troubleshooting Programmable Data Planes accepted by TPDS. [2025.02] Paper: Yuhang's component-based roofline model for Ascend accepted by ASPLOS 2025. [2025.01] Paper: PrioPlus, Marlin and BINGO accepted by EUROSYS 2025. [2024.12] Paper: One paper accepted by INFOCOM 2025. [2024.11] Paper: Zibo's fine-grained DVFS accepted by ASPLOS 2025. [2024.11] Paper: Louvain accepted by PPoPP 2025. [2024.10] Paper: TCC accepted by TON. [2024.08] Paper: BifrostX accepted by TON. [2024.07] Paper: Pyrrha and P4RTC accepted by NSDI 2025. [2024.05] Paper: μMon accepted by SIGCOMM 2024. [2024.04] Paper: Butterfly Counting accepted by VLDBJ. [2023.12] Service: I serve as the general chair of APNet 2024. [2023.09] Paper: Unison accepted by Eurosys 2024. [2023.08] Award: SMOG wins the champion of IEEE HPEC Graph Challenge. [2023.07] Paper: Bifrost and MC-RDMA accepted by ICNP 2023. [2023.04] Paper: GLogS accepted by ATC 2023. [2023.03] Paper: Flor accepted by OSDI 2023. [2022.12] Paper: Norma accepted by NSDI 2023. [2022.12] Paper: Gemini and CLIP accepted by INFOCOM 2023. [2022.10] Paper: SWING accepted by TPDS. [2022.08] Paper: Zhibin's butterfly counting paper accepted by SIGMOD 2023. [2022.08] Paper: PayDebt accepted by TPDS. [2022.06] Paper: PushBox accepted by TPDS. [2022.06] Paper: One WSN paper accepted by JCST. [2022.05] Paper: FlyMon accepted by SIGCOMM 2022. [2022.04] Paper: SMART accepted by JCST. [2022.04] Paper: Lilac accepted by ISCC. [2022.03] Paper: MEET accepted by TPDS. [2022.02] Paper: One RDMA paper accepted by JCST. [2021.12] Paper: WAN Redundancy Elimination work accepted by INFOCOM 2022. [2021.10] Paper: Floodgate accepted by CoNEXT 2021. [2021.08] Paper: A survey of network measurement accepted by TSC. [2021.06] Award: I am nominated as \"华为中央研究院2020年度最佳合作教授\". [2021.05] Paper: Aquila accepted by SIGCOMM 2021. [2021.04] Paper: CLEAN accepted by IWQoS 2021 as a short paper. [2021.02] Paper: TRUST accepted by TPDS. [2021.01] Paper: Papers accepted by TC/JPDC. [2020.12] Paper: Papers accepted by TON/TMC. [2020.11] Award: I am awarded \"2020年度CCF分布式计算与系统专委会青年创新奖\", only 2 winners each year. [2020.07] Student: Bingchuan is awarded \"Person of the year 2019\" (南京大学学生年度人物), only 10 winners in Nanjing University each year. [2020.07] Paper: Our RDMA practise paper with Pangu team of Alibaba accepted by NSDI 2021. [2020.05] Student: Congratulation to Changrong's UCLA PhD offer! [2020.05] Student: Congratulation to Yuanqing's PSU PhD offer! [2020.04] Paper: Proteus accepted by IWQoS 2020. [2020.01] Service: I serve as a TPC member of ICNP/APNet/ICCCN 2020 committee. [2020.01] Paper: P-PFC accepted by TPDS. [2019.12] Paper: TOP accepted by TPDS. [2019.11] Paper: One Paper accepted by JSAC. [2019.10] Paper: One Paper accepted by TMC. [2019.08] Service: I was intived to do Topic Preview for SIGCOMM 2019. [2019.06] Paper: Two papers accepted by ICCCN 2019. [2019.05] Paper: Jinjing accepted by SIGCOMM 2019. [2019.04] Paper: Plutus accepted by IWQoS 2019. [2019.03] Paper: Chronicle accepted by JSAC. [2018.12] Service: I serve as a TPC member of 2nd NetAI Workshop of SIGCOMM 2019. [2018.12] Service: I serve as the sponsorship co-chair of APNet 2019 committee. [2018.11] Paper: Trinity accepted by TCC. [2018.11] Paper: CHASE accepted by TMC. [2018.07] Paper: Three papers accepted by ICNP 2018. [2018.07] Paper: One paper accepted by Ubicomp 2018. [2018.06] Paper: A short version of Macroflow would appear in APNET 2018. [2018.04] Paper: OpenFunction accepted by IEEE/ACM Transactions on Networking (TON). [2018.04] Paper: FPGA-Pooling accepted by IEEE Transactions on Parallel and Distributed Systems (TPDS). [2018.04] Student: Congratulation to Yuchen's Brown PhD offer! [2018.03] Paper: Two papers accepted by ICDCS 2018. [2018.01] Paper: UKSM accepted by FAST 2018, first from NJU. [2017.12] Service: I serve as the PC co-chair for the NetAI Workshop of SIGCOMM 2018, submit your work please! [2017.11] Paper: Two papers accepted by IEEE INFOCOM 2018. [2017.11] Service: I serve as the sponsorship co-chair of APNet 2018 committee. [2017.10] Paper: CoolConferencing accepted by IEEE Access. [2017.09] Paper: IBCube accepted by IJWSR. [2017.08] Funding: One NSFC project for datacenter network slicing approved. [2017.06] Funding: One national project for 5G network slicing approved. [2017.05] Award: Best-in-session presentation award in IEEE INFOCOM 2017. [2017.05] Paper: Container networking measurement accepted by HotConNet 2017. [2017.04] Paper: Xu' paper accepted by Transactions on Multimedia (TMM). [2017.03] Paper: Jun' paper accepted by IEEE Transactions on Intelligent Transportation Systems (TITS). [2017.03] Paper: Yi's NDN paper accepted by SIGCOMM China Symposium 2017. [2017.03] Paper: Zhiyong's paper accepted by IEEE BigDataService 2017. [2017.03] Paper: Marlin accepted by IEEE Transactions on Parallel and Distributed Systems (TPDS). [2017.02] Service: I will serve as one of the co-chairs of APNet 2017 Poster committee. [2017.01] Paper: PIAS accepted by IEEE/ACM Transactions on Networking (TON). [2016.11] Paper: MT-MO accepted by IEEE INFOCOM 2017. [2016.08] Paper: Tentacle accepted by IEEE Transactions on Parallel and Distributed Systems (TPDS). [2016.07] Paper: OpenFunction and Macroflow accepted by IEEE ICNP 2016 as posters. [2016.07] Paper: Amoeba accepted by IEEE/ACM Transactions on Networking (TON). [2016.06] Paper: A metro system big data paper accepted by IEEE Transactions on Intelligent Transportation Systems (TITS). [2016.04] Student: Congratulation to Junhua's UNC PhD offer! [2016.04] Student: Congratulation to Yingtong's UCI PhD offer! [2016.03] Paper: An electronic vehicle big data paper accepted by IEEE Transactions on Intelligent Transportation Systems (TITS). [2016.02] Career: I have moved to Nanjing University. [2015.11] Paper: Trinity accepted by IEEE INFOCOM 2016. [2015.08] Paper: A P2P bandwidth allocation paper accepted by Computer Networks. [2015.04] Student: Congratulation to Hanzi's TAMU PhD offer! [2015.03] Paper: A clouded VoD paper accepted by IEEE Transactions on Services Computing (TSC). [2015.02] Paper: A metro big data paper accepted by IEEE Transactions on Vehicular Technology (TVT). [2015.01] Paper: Amoeba accepted by ACM EuroSys 2015. [2014.12] Paper: PIAS accepted by USENIX NSDI 2015. [2014.11] Paper: RAPIER accepted by IEEE INFOCOM 2015. [2014.10] Paper: 2 Papers accepted by IEEE UIC and its workshop USDE. [2014.09] Paper: PIAS accepted by ACM Hotnets 2014. [2014.08] Paper: 2 Papers accepted by International Journal of Web Service Research. [2014.07] Paper: 5 Papers accepted by IEEE ITSC 2014. [2014.06] Paper: 1 paper accepted by Internet Conference of China (CCF ICoC 2014). [2014.02] Student: Congratulation to Tianlong's CMU PhD offer! [2013.08] Misc: First version of new homepage online.",
  "content_length": 8132,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:49"
}