{
  "name": "Chentao Wu",
  "homepage": "http://www.cs.sjtu.edu.cn/~wuct",
  "status": "success",
  "content": "﻿ Chentao Wu's Home Page Contact Address: Room 513, SEIEE-3 Building, 800 Dongchuan Road, Minhang District, Shanghai, China 200240 Telephone: (+86)21-34208230 Email: wuct@cs.sjtu.edu.cn or wuct@sjtu.edu.cn I am looking for self-motivated Undergraduate, Master, Ph.D. students and PostDocs. If you are interested in Data Storage Systems (Cloud Storage, Big Data Storage, Intelligent Storage, etc.), please feel free to contact me. Biography Chentao Wu is currently a full professor in the School of Computer Science, Shanghai Jiao Tong University, China. His research interests include data storage systems, particularly in reliable storage devices, data management in file sytems, cloud storage, intelligent storage, etc. He got his Ph.D degree from Virginia Commonwealth University (also referred to as Virginia State University) in 2012 and his advisor is Prof. Xubin (Ben) He. Prior to that, He got his Bachelor/Master/Ph.D. degrees all from Huazhong University of Science and Technology, under the supervision of Prof. Changsheng Xie, in 2004, 2006 and 2010, respectively. Education Experience Ph.D. Electrical & Computer Engineering, Virginia Commonwealth University （Virginia State University） 2012 Ph.D. Computer Architecture, Huazhong University of Science and Technology 2010 M.S. Software Engineering, Huazhong University of Science and Technology 2006 B.S. Computer Science & Technology, Huazhong University of Science and Technology 2004 Work Experience Professor School of Computer Science (Dept. of Computer Science & Engineering), Shanghai Jiao Tong University 2019 - present Associate Professor Dept. of Computer Science & Engineering, Shanghai Jiao Tong University 2014 - 2019 Assistant Professor Dept. of Computer Science & Engineering, Shanghai Jiao Tong University 2012 - 2014 Research Assistant Dept. of Electrical & Computer Engineering, Virginia Commonwealth University 2010 - 2012 Research Interest Data Storage Systems (Cloud Storage Systems, Big Data Storage Systems, etc.) Data Management (e.g., buffer cache, I/O scheduling) Reliable Storage Devices (e.g., disk arrays, erasure coding) Non-Volatile Memory Technologies (e.g., Flash/SSD, persistent memory) Intelligent Storage (e.g., approximate storage, AI optimization for storage systems) Teaching Undergraduate Courses CS2310:Operating Systems (Spring 2016-2024) CS2303:Operating Systems Curriculum Design (Spring 2016-2024) EI338:Computer Systems Engineering (Fall 2013-2019) CS353:Linux Kernel (Spring 2013-2016) CS080:Data Storage and Management (Summer 2016) Graduate Courses MY26005:Big Data and Internet Thinking (Fall 2019-2023, Spring 2024) CS28007:Big Data Processing Technologies (Spring 2016-2022) X033537:Parallel Computing & Parallel Programming (Spring 2014-2022) E033506: Distributed Computing (Fall 2015) Publications Selected Journal Papers [TMC'25] Xinyu Lu, Jiong Lou, Jie Li, Runhui Xu, Chentao Wu, Zhi Liu, Yuan Luo, Yang Yang. Towards Bi-level Supply/Demand Balanced Charging Systems via Online Power Scheduling. IEEE Transactions on Mobile Computing (TMC), 24(9): 8405-8422, 2025. [TDSC'25] Honghong Zeng, Jiong Lou, Kailai Li, Chentao Wu, Guangtao Xue, Yuan Luo, Fan Cheng, Wei Zhao, Jie Li. ESFL: Accelerating Poisonous Model Detection in Privacy-Preserving Federated Learning. IEEE Transactions on Dependable and Secure Computing (TDSC), 22(4): 3780-3794, 2025. [TDSC'25] Bowen Li, Hanlin Gu, Ruoxin Chen, Jie Li, Chentao Wu, Na Ruan, Xueming Si, Lixin Fan. Temporal Gradient Inversion Attacks with Robust Optimization. IEEE Transactions on Dependable and Secure Computing (TDSC), 22(4): 3383-3397, 2025. [ComNet'25] Hongze Liu, Junzhe Liu, Zhaojiacheng Zhou, Shijing Yuan, Jiong Lou, Chentao Wu, Jie Li. A stochastic learning algorithm for multi-agent game in mobile network: A Cross-Silo federated learning perspective. Computer Networks, 269: 11158, 2025. [TC'25] Shijing Yuan, Beiyu Dong, Jie Li, Song Guo, Hongyang Chen, Chentao Wu, Jie Wu, Wei Zhao. Adaptive Incentivize for Federated Learning with Cloud-Edge Collaboration under Multi-level Information Sharing. IEEE Transactions on Computers (TC), 74(7): 2445-2460, 2025. [TCC'25] Shijing Yuan, Yuxin Liu, Song Guo, Jie Li, Hongyang Chen, Chentao Wu, Yang, Yang. Efficient Online Computing Offloading for Budget-Constrained Cloud-Edge Collaborative Video Streaming Systems. IEEE Transactions on Cloud Computing (TCC), 13(1): 273-287, 2025. [TITS'25] Xinyu Lu, Jiawei Sun, Jiong Lou, Yusheng Ji, Chentao Wu, Wei Zhao, Guangtao Xue, Yuan Luo, Fan Cheng, Jie Li. V2PCP: Toward Online Booking Mechanism for Private Charging Piles. IEEE Transactions on Intelligent Transportation Systems (TITS), 26(2): 2514-2529, 2025. [TMC'25] Shijing Yuan, Qingshi Zhou, Jie Li, Song Guo, Hongyang Chen, Chentao Wu, Yang Yang. Adaptive Incentive and Resource Allocation for Blockchain-Supported Edge Video Streaming Systems: A Cooperative Learning Approach. IEEE Transactions on Mobile Computing (TMC), 24(2): 539-556, 2025. [NN'25] Jiawei Sun, Ruoxin Chen, Jie Li,, Yue Ding, Chentao Wu, Zhi Liu, Junchi Yan. Understanding and mitigating dimensional collapse of Graph Contrastive Learning: A non-maximum removal approach. Neural Networks (NN), 181: 106652, 2025. [FCS'25] Mizhipeng Zhang, *Chentao Wu, Jie Li, and Minyi Guo. Dynamic-EC: An Efficient Dynamic Erasure Coding Method for Permissioned Blockchain Systems. Frontiers of Computer Science (FCS), 19(1):191101, 2025. [TC'24] Honghong Zeng, Jie Li, Jiong Lou, Shijing Yuan, Chentao Wu, Wei Zhao, and Sijin Wu. BSR-FL: An Efficient Byzantine-Robust Privacy-Preserving Federated Learning Framework. IEEE Transactions on Computers (TC), 73(8):2096-2110, 2024. [TC'24] Yunfei Gu, Linhui Liu, *Chentao Wu, Jie Li, and Minyi Guo. Ada-WL: An Adaptive Wear Leveling Aware Data Migration Approach for Flexible SSD Array Scaling in Clusters. IEEE Transactions on Computers (TC), 73(8):1967-1982, 2024. [IoTJ'24] Shijing Yuan, Beiyu Dong, Hongtao Lv, Hongze Liu, Hongyang Chen, Chentao Wu, Song Guo, Yue Ding, and Jie Li. Adaptive Incentivize for Cross-Silo Federated Learning in IIoT: A Multi-agent Reinforcement Learning Approach. IEEE Internet of Things Journal (IoTJ), 11(9): 15048-15058, 2024. [TITS'24] Xinyu Lu, Jie Li, Shijing Yuan, Haiming Jin, Chentao Wu, and Zhan Xu. Towards Real-Time Pricing and Allocation for Surplus Resources in Electric Bus Charging Stations. IEEE Transactions on Intelligent Transportation Systems (TITS), 25(2):2101-2115, 2024. [TWC'23] Shijing Yuan, Jie Li, Hongyang Chen, Zhu Han, Chentao Wu, Yongbing Zhang. JIRA: Joint Incentive Design and Resource Allocation for Edge-based Real-time Video Streaming Systems. IEEE Transactions on Wireless Communications (TWC), 22(5): 2901-2916, 2023. [JSA'22] Shijing Yuan, Jie Li, and Chentao Wu. JORA: An Efficient Joint Computing Offloading and Resource Allocation Method in Blockchain-supported Edge Video Streaming Systems. Journal of Systems Architecture (JSA), 133:102740, 2022. [IoTJ'22] Xinyu Lu, Jie Li, Chentao Wu, Jinsong Wu, and Mahmoud Daneshmand. Measuring Similarity between Any Pair of Passengers Using Smart Card Usage Data. IEEE Internet of Things Journal (IoTJ), 9(2): 1458-1468, 2022. [IEEE Computer'20] Dongliang Xue, Chao Li, Linpeng Huang, and Chentao Wu. Dapper: An Adaptive Manager for Large-Capacity DRAM-Comparable Persistent Memory. IEEE Computer, 53(3):11-13, 2020. (spotlight on our TC'19 paper) [FGCS'20] Dongliang Xue, Linpeng Huang, and Chentao Wu. A Pure Hardware-Driven Scheduler for Enhancing Bank-Level Parallism in a Persistent Memory Controller. Future Generation Computer Systems (FGCS), 107: 383-393, 2020. [THPC'20] Zhehan Lin, Hanchen Guo, and *Chentao Wu. AIR: An Approximate Intelligent Redistribution Approach to Accelerate RAID Scaling. CCF Transactions on High Performance Computing (THPC), 2(1): 50-66, 2020. [TC'19] Dongliang Xue, Chao Li, Linpeng Huang, and Chentao Wu. Dapper: An Adaptive Manager for Large-Capacity DRAM-Comparable Persistent Memory. IEEE Transactions on Computers (TC), 68(7): 1019-1034, 2019. [FCS'19] Xiaodong Meng, *Chentao Wu, Minyi Guo, Jie Li, Xiaoyao Liang, and Long Zheng. PAM: An Efficient Power-Aware Multi-level Cache Policy to Reduce Energy Consumption of Storage Systems. Frontiers of Computer Science (FCS) ,13(4): 850-863, 2019. [FCS'18] Jingyu Zhang, Chentao Wu, Dingyu Yang, Yuanyi Chen, Xiaodong Meng, Liting Xu, and Minyi Guo. HSCS: a hybrid shared cache scheduling scheme for multi-programmed workloads. Frontiers of Computer Science (FCS), 12(6): 1090-1104, 2018. [SCIS'18] Jingyu Zhang, Minyi Guo, Chentao Wu, and Yuanyi Chen. Toward Multi-programmed Workloads with Different Memory Footprints: A Self-Adaptive Last Level Cache Scheduling Scheme. SCIENCE CHINA Information Sciences, 61(1): 012105, 2018. [JCST'17] Xiaodong Meng, *Chentao Wu, Minyi Guo, Jie Li, Xiaoyao Liang, Long Zheng, and Bin Yao. A Hint Frequency-based Approach to Enhance the I/O Performance of Multi-level Cache Storage Systems. Journal of Computer Science and Technology (JCST), 32(2): 312-328, 2017. [DPDB'14] Xing Ge, Bin Yao, Minyi Guo, Changliang Xu, Jingyu Zhou, Chentao Wu, and Guangtao Xue. LSShare: an efficient multiple query optimization system in the cloud. Distributed and Parallel Databases, 32(4): 583-605, 2014. [TPDS'14] Chentao Wu, Xubin He, Qiang Cao, Changsheng Xie, and Shenggang Wan. Hint-K: An Efficient Multi-level Cache Using K-step Hints. IEEE Transactions on Parallel and Distributed Systems (TPDS), 25(3):653-662, 2014. Selected Conference Papers [VLDB'26] Chi Zhang, Shihao Zhang, Yunfei Gu, *Chentao Wu, Jie Li, Qin Zhang, Xusheng Chen, Jie Meng. FlatStor: An Efficient Embedded-Index Based Columnar Data Layout for Multimodal Data Workloads. In: Proceedings of the 52nd International Conference on Very Large Data Bases (VLDB 2026), August 31-September 2, 2026, Boston, USA. [Cluster'25] Ranhao Jia, *Yunfei Gu, *Chentao Wu, Jie Li, Minyi Guo, Liqiang Zhang, Zaigui Zhang, Haijun Zhang. FIFO-MEP: An Efficient Multi-Eviction-Point",
  "content_length": 40043,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:01"
}