{
  "name": "Cheng Tan 0005",
  "homepage": "https://naizhengtan.github.io",
  "status": "success",
  "content": "Cheng Tan | Cheng Tan’s homepage Cheng Tan I am an assistant professor of Khoury College of Computer Sciences at Northeastern University. I’m part of Systems Research Group at Northeastern University. I’m broadly interested in computer systems. I build systems that enable users to verify their outsourced services. In particular, my recent research includes: verifying ML systems, verifying consistency models of concurrent systems, verifying the execution of applications on untrusted servers. If you are interested in building systems, we should talk [c.tan (at) northeastern.edu]. Publications TrainVerify: Equivalence-Based Verification for Distributed LLM Training Yunchi Lu, Youshan Miao, Cheng Tan, Peng Huang, Yi Zhu, Xian Zhang, and Fan Yang SOSP 2025, Seoul, Republic of Korea, October 2025. [pdf, code, arxiv] PipeLLM: Fast and Confidential Large Language Model Services with Speculative Pipelined Encryption Yifan Tan, Cheng Tan, Zeyu Mi, and Haibo Chen ASPLOS 2025, Rotterdam, The Netherlands, March 2025. [pdf, code, arxiv] NN4SysBench: Characterizing Neural Network Verification for Computer Systems Shuyi Lin, Haoyu He, Tianhao Wei, Kaidi Xu, Huan Zhang, Gagandeep Singh, Changliu Liu, and Cheng Tan NeurIPS 2024, Datasets and Benchmarks Track, Vancouver, Canada, December 2024. [pdf, code, website ] Dropout Attacks Andrew Yuan, Alina Oprea, and Cheng Tan S&P 2024, San Francisco, CA, May 2024. [pdf, code, arxiv] Encrypted Databases Made Secure Yet Maintainable Mingyu Li, Xuyang Zhao, Le Chen, Cheng Tan, Huorong Li, Sheng Wang, Zeyu Mi, Yubin Xia, Feifei Li, and Haibo Chen OSDI 2023, Boston, MA, July 2023. [pdf, code] Building Verified Neural Networks for Computer Systems with Ouroboros Tianhao Wei, Zhihao Jia, Changliu Liu, and Cheng Tan MLSys 2023, Miami, FL, June 2023. [pdf, code] Viper: A Fast Snapshot Isolation Checker Jian Zhang, Ye Ji, Shuai Mu, and Cheng Tan EuroSys 2023, Rome, Italy, May 2023. [pdf, code] NNSmith: Generating Diverse and Valid Test Cases for Deep Learning Compilers Jiawei Liu, Jinkun Lin, Fabian Ruffy, Cheng Tan, Jinyang Li, Aurojit Panda, and Lingming Zhang ASPLOS 2023, Vancouver, Canada, March 2023. [pdf, code, arxiv] Distinguished Artifact Award Bringing Decentralized Search to Decentralized Services Mingyu Li, Jinhao Zhu, Tianxu Zhang, Cheng Tan, Yubin Xia, Sebastian Angel, and Haibo Chen OSDI 2021, July 2021. [pdf, code] Cobra: Making Transactional Key-Value Stores Verifiably Serializable Cheng Tan, Changgeng Zhao, Shuai Mu, and Michael Walfish OSDI 2020, November 2020. [pdf, slides, talk, code] Auditing Outsourced Services Cheng Tan Ph.D. Dissertation, August 2020. [pdf] Janet Fabri Prize in Courant Institute NetBouncer: Active Device and Link Failure Localization in Data Center Networks Cheng Tan, Ze Jin, Chuanxiong Guo, Tianrong Zhang, Haitao Wu, Karl Deng, Dongming Bi, and Dong Xiang NSDI 2019, Boston, MA, February 2019. [pdf, slides, talk] The Efficient Server Audit Problem, Deduplicated Re-execution, and the Web Cheng Tan, Lingfan Yu, Joshua B. Leners, and Michael Walfish SOSP 2017, Shanghai, China, October 2017. [pdf, slides, talk, extended report, code] Best paper award TinMan: Eliminating Confidential Mobile Data Exposure with Security-oriented Offloading Yubin Xia, Yutao Liu, Cheng Tan, and Mingyang Ma, Haibing Guan, Binyu Zang, and Haibo Chen. EuroSys 2015, Bordeaux, France, April 2015. (see all papers) Recent workshop papers Can LLMs Replace Time-Tested System Policies? Perhaps Yibo Zhao and Cheng Tan ApSys’25, Seoul, Korea, October 2025. Specification Generation for Neural Networks in Networking Systems Isha Chaudhary, Shuyi Lin, Cheng Tan, and Gagandeep Singh ML4Wireless@ICML’25, Vancouver, Canada, July 2025. Teaching Fall 2025: LLM systems (CS7670) Operating Systems Implementation (CS6640): 25sp, 23fa Computer Systems, Undergrad (CS3650): 24sp Computer Systems (CS5600): 23sp, 22sp, 21fa Computer Systems Seminar (CS7670): NN4Sys (22fa) Students Jian Zhang (PhD) Brent Zhao (PhD, co-advised with Pete Manolios) Shuyi Lin (PhD) Zikai Wang (PhD) (see Alumni) Program committee EuroSys 2026, MLSys 2026 OSDI 2025, EuroSys 2025, ATC 2025, MLSys 2025 MLSys 2024, AAAI SRRAI 2024 ATC 2023, ICDCS 2023, SoCC 2022, VEE 2022, CoNEXT 2021 Honors and Awards MSR Asia StarTrack Scholar, 2024 ASPLOS Distinguished Artifact Award, 2023 NSF CAREER Award, 2023 NYU Janet Fabri Prize, 2021 SOSP Best Paper Award, 2017 About me Before joining Northeastern, I worked as a research scientist at ByteDance AI Lab for a year. Before that, I got my Ph.D. from Courant Institute NYU advised by Michael Walfish, and my M.S. and B.E. from Fudan University and Nanjing University, respectively. I was a student at NYU Systems Group. Before that, I was at IPADS advised by Binyu Zang and Haibo Chen, where I did research on mobile systems and system virtualization.",
  "content_length": 4847,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:53"
}