{
  "name": "Cheng Huang 0003",
  "homepage": "https://chenghuang.org",
  "status": "success",
  "content": "Cheng Huang Cheng Huang Home Publications Research Teaching Students Activities Lab: No.24 South Section 1, Yihuan Road, Chengdu, China 610064 Email: codesec [AT] scu.edu.cn NEWS 30 Sept. 2025 Paper accepted by IEEE Transactions on Software Engineering (CCF A) with Zhao. 20 Sept. 2025 Paper accepted by Cybersecurity (CCF T1) with Huang. 13 Aug. 2025 Paper accepted by IEEE Transactions on Software Engineering (CCF A) with Zeng. 2 Dec. 2024 Paper accepted by Future Generation Computer Systems (Q1) with Hou. 20 Sept. 2024 Paper accepted by IEEE Transactions on Reliability (Q1) with Jiang. 24 July. 2024 Paper accepted by Computers & Security (CCF B) with Han. 10 July. 2024 Paper accepted by Software Quality Journal (Q2) with Han. 20 May. 2024 Paper accepted by Expert Systems With Applications (Q1) with Wang. 2 Apr. 2024 Paper accepted by Applied Soft Computing (Q1) with Xu. 14 Mar. 2024 Paper accepted by Computers & Security (CCF B) with Li. 4 Mar. 2024 Paper accepted by Empirical Software Engineering (CCF B) with Chen. 1 Mar. 2024 Paper accepted by USENIX Security'24 (CCF A) with Wang. 10 Oct. 2023 Paper accepted by ä¿¡æ¯å®å ¨å­¦æ¥ (CCF B) with Luo. 15 Aug. 2023 Paper accepted by SecureComm (CCF C) with Huang. 31 Jul. 2023 Paper accepted by IJIS (Q1) with Sun. 18 Jul. 2023 Paper accepted by ASE 2023 (CCF A) with Guo. 21 Jun. 2023 Paper accepted by Computers & Security (CCF B) with Guo. 1 Jun. 2023 Paper accepted by KSEM 2023(CCF C) with Yang. 12 May. 2023 Outstanding Contribution in Reviewing CJNIS. 22 Feb. 2023 Paper accepted by Automated Software Engineering with Han. 1 Feb. 2023 Join the TPC of CSCWD 2023 and KSEM 2023. 16 Nov. 2022 Paper accepted by Computers & Security (CCF B) with Liu. 15 Oct. 2022 Paper accepted by Knowledge-Based Systems (JCR Q1) with Zhao. 4 Oct. 2022 Paper accepted by ICDF2C 2022 (CCF C) with Zeng. 14 Sept. 2022 Paper accepted by Applied Intelligence (JCR Q2) with Du. 28 Aug. 2022 Paper accepted by SecureComm (CCF C) with Liu. 26 Aug. 2022 Paper accepted by Information Sciences (JCR Q1) with Xu. 25 Aug. 2022 Congrats to 0x401 team on the NCSISC 2022 contest. 22 Aug. 2022 Congrats to first prize on the NCSISC 2022 contest. Links å®å ¨å­¦æ¯å SecWiki Research Materials I am an Associate Professor in the School of Cyber Science and Engineering, Sichuan University, China. I am broadly interested in all aspects of network and system issues. My work follows a measurement and data driven approach to characterize and detect critical attack issues in large-scale systems. My current research focuses on detection model, underground economics, cyber threat intelligence, source code and supply chain detection. I obtained my Ph.D. in Computer Science at the Sichuan University, and I did a Joint PhD student at University of California, Santa Barbara, under the supervision of Prof. Giovanni Vigna. Looking for bright students I am looking for self-motivated Master/Undergraduate students, and (Visiting) research students who have strong interests in cyber science and engineering research. If you are interested, feel free to send me an email. *é¿æææ¶ç½ç»å®å ¨(ç¥è¯å¾è°±ãæ£æµä¸æº¯æº)ãè½¯ä»¶å®å ¨(è§£éæ§ä»£ç ãä¾åºé¾ãæ¼æ´æ²»ç)ãåºç¨å®å ¨(å ¬å®³æ²»çãæç½è¿½è¸ª)ç­æ¹åçæ¬ç§çãç¡å£«(ä¿ç /èç )ãåå£«(ç´åãç¡åè¿è¯»ãç³è¯·èæ ¸å¶)ãåå£«åï¼* æ¬¢è¿ææµåå ´è¶£ãå¼ºçèªæåå±è¯æ±çåå­¦ãèå¸å å ¥ï¼å¯æä¾å¹¿éçå­¦ä¸åèä¸åå±ç©ºé´ï¼æå¯¼å­¦çå°±ä¸å»åè¯å¥½ï¼ CFP for Journal/Conference ä¸é¢å¾æ | Cyberspace Security Technology in Computer Science Applied Sciences 20 August 2026 æå è±æ SCI(IF:2.5) ä¸é¢å¾æ | æç½æå¶åæ²¿è¿å± åå·å¤§å­¦å­¦æ¥(èªç¶ç§å­¦ç) 2025å¹´1æ-2026å¹´3æ æå ä¸­æ åå¤§æ ¸å¿ Selected Publications (Full List) Donapi: Malicious NPM Packages Detector using Behavior Sequence Knowledge Mapping Cheng Huang, Nannan Wang*, Ziyan Wang, Siqi Sun, Lingzi Li, Junren Chen, Qianchong Zhao, Jiaxuan Han, Zhen Yang and Lei Shi The 33rd USENIX Security Symposium (USENIX Security '24), 2024 C DOI Demo PDF CCF A Bib Towards Secure Code Generation With LLMs: A Study on Common Weakness Enumeration Jianguo Zhao, Yuqiang Sun*, Cheng Huang*, Chengwei Liu, YaoHui Guan, Yutong Zeng, Yang Liu IEEE Transactions on Software Engineering, 2025 J DOI PDF CCF A Bib Wolf in Sheepâs Clothing Shearing the Camouflage of Malicious Java Components in Maven Yutong Zeng, Cheng Huang*, Jiaxuan Han, Jianguo Zhao, Nannan Wang, Genpei Liang, and Shuyi Jiang IEEE Transactions on Software Engineering, 2025 J DOI PDF CCF A Bib CoExpMiner: An AHIN-based Vulnerability Co-exploitation Mining Framework Shuyi Jiang, Cheng Huang*, Jiaxuan Han IEEE Transactions on Reliability, 2024 J DOI PDF Q1 Bib An Empirical Study of Malicious Code In PyPI Ecosystem Wenbo Guo, Zhengzi Xu*, Chengwei Liu, Cheng Huang, Yong Fang*, Yang Liu The 38th IEEE/ACM International Conference on Automated Software Engineering (ASE 2023), 2023:166-177 C DOI CCF A Bib Viopolicy-Detector: An Automated Approach to Detecting GDPR Compliance Violations in Websites Haoran Ou, Yong Fang, Wenbo Guo, Yongyan Guo, Cheng Huang* The 25th International Symposium on Research in Attacks, Intrusions and Defenses (RAID 2022), 2022:409â430 C DOI CCF B Bib Automated Discovery and Mapping ATT&CK Tactics and Techniques for Unstructured Cyber Threat Intelligence Lingzi Li, Cheng Huang*, Junren Chen Computers & Security, 2024 J DOI Code Data PDF CCF B Bib bjCnet: A Contrastive Learning-Based Framework for Software Defect Prediction Jiaxuan Han, Cheng Huang*, Jiayong Liu Computers & Security, 2024, 104024 J DOI Data PDF CCF B Bib SecTKG: A Knowledge Graph for Open Source Security Tools Siqi Sun, Cheng Huang*, Tiejun Wu and Yi Shen International Journal of Intelligent Systems, 2023 J DOI Code PDF Q1 Bib ExpSeeker: Extract Public Exploit Code Information from Social Media Yutong Du, Cheng Huang*, Genpei Liang, Zhihao Fu, Dunhan Li, Yong Ding Applied Intelligence, 2023(53):15772â15786 J DOI JCR Q1 Bib VULDEFF: Vulnerability Detection Method Based on Function Fingerprints and Code Differences Qianchong Zhao, Cheng Huang*, and Liuhu Dai Knowledge-based Systems, 2023(260), 110139 J DOI Data JCR Q1 Bib GraphXSS: An Efficient XSS Payload Detection Approach Based on Graph Convolutional Network Zhonglin Liu, Yong Fang, Cheng Huang*, Jiaxuan Han Computers & Security, 2022(114):102597 J DOI CCF B Bib JStrong: Malicious JavaScript Detection Based on Code Semantic Representation and Graph Neural Network Yong Fang, Chaoyi Huang, Minchuan Zeng, Zhiying Zhao, Cheng Huang* Computers & Security, 2022(118),102715 J DOI CCF B Bib æºä»£ç æ¼æ´éæåæææ¯ ååå, é©å®¶ç, é»è¯* ä¿¡æ¯å®å ¨å­¦æ¥, 2022,7(4):100-113. J DOI PDF CCF B Bib CyberRel: Joint Entity and Relation Extraction for Cybersecurity Concepts Yongyan Guo, Zhengyu Liu, Cheng Huang*, Jiayong Liu, Wangyuan Jing, Ziwang Wang, Yanghao Wang International Conference on Information and Communications Security (ICICS), Springer, Cham, 2021:447-463. C DOI PDF Best Student Paper CCF C Bib LMTracker: Lateral Movement Path Detection based on Heterogeneous Graph Embedding Yong Fang, Congshuang Wang, Zhiyang Fang, Cheng Huang* Neurocomputing, 2022(474):37-47. J DOI JCR 2 Bib ExSense: Extract Sensitive Information from Unstructured Data Yongyan Guo, Jiayong Liu, Wenwu Tang and Cheng Huang* Computers & Security, 2021(102): 102156. J DOI PDF CCF B Bib NEDetector: Automatically Extracting Cybersecurity Neologisms from Hacker Forums Ying Li, Jiaxing Cheng, Cheng Huang*, etc. Journal of Information Security and Applications, 2021(58):102784. J DOI CCF C Bib A Study on Web Security Incidents in China by Analyzing Vulnerability Disclosure Platforms Cheng Huang, JiaYong Liu*, Yong Fang, Zheng Zuo Computers & Security, 2016(58): 47-62 J DOI CCF B Bib Gossip: Automatically Identifying Malicious Domains from Mailing List Discussions Cheng Huang, Shuang Hao, Luca Invernizzi, JiaYong Liu, Yong Fang, Christopher Kruegel, Giovanni Vigna Proceedings of the 2017 ACM on Asia Conference on Computer and Communications Security (ASIA CCS) Abu Dhabi, United Arab Emirates, April 2017. C DOI PDF CCF C",
  "content_length": 8249,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:53"
}