{
  "name": "Chen Zhao 0010",
  "homepage": "https://charliezhaoyinpeng.github.io/homepage",
  "status": "success",
  "content": "Chen Zhao Chen Zhao (赵辰) Assistant Professor Department of Computer Science School of Engineering and Computer Science Baylor University One Bear Place #97141, Waco, Texas 76798, United States Adjunct Professor Department of Information Sciences and Technology College of Emergency Preparedness, Homeland Security & Cybersecurity The State University of New York at Albany 1400 Washington Ave, Albany, New York 12222, United States Email: chen_zhao [at] baylor [dot] edu Call for papers: Frontiers in Big Data, Frontiers Media SA, Special Issue: Ethical Artificial Intelligence: Methods and Applications. Call for papers: Mathematics, MDPI, Special Issue: Advances in Trustworthy and Robust Artificial Intelligence. News [] [11/2025] I will serve as the Poster Chair for ICDM 2026. [11/2025] I will give a keynote talk and a guest lecture at the ICDM 2025 workshop and UT Dallas. [11/2025] One paper is accepted by TMLR. [11/2025] Five papers are accepted by AAAI 2026, 4 in the main track and 1 student abstract. [10/2025] Two papers are accepted by IEEE BigData 2025. [09/2025] I will serve as a Senior PC (SPC) member for PAKDD 2026. [09/2025] Six papers are accepted by NeurIPS 2025 workshops. [09/2025] One paper is accepted by NeurIPS 2025. [09/2025] One tutorial is accepted by AAAI 2026. [09/2025] I will serve as a reviewer for ICLR 2026. [09/2025] I will serve as a PC member for WWW 2026. [08/2025] I will serve as a PC member for AISTATS 2026. [08/2025] An NSF grant is awarded. [07/2025] I will serve as a PC member for AAAI 2026. [07/2025] I will serve as a PC member for KDD 2026 (August cycle). [05/2025] I will serve as a panelist for NSF. [05/2025] I received a Gift Fund from NEC Laboratories America. [05/2025] I will serve as a panelist for DOE [05/2025] Two papers are accepted by ACL 2025. [05/2025] I will serve as a program committee member for ICDM 2025. [05/2025] I will serve as a workshop chair for ARRL @ ICDM 2025. [04/2025] I am invited to give a keynote talk at the workshop on Foundational AI for Pervasive Computing at PAKDD 2025. [04/2025] Two papers are accepted by IJCAI 2025. [04/2025] Two tutorials are accepted by IJCAI 2025. [04/2025] One paper is accepted by KBS. [04/2025] I will serve as a reviewer for MM 2025. [04/2025] I will serve as a program committee member for ECAI 2025. [03/2025] One paper is accepted by ICDE 2025. [03/2025] I will serve as a program committee member for IEEE BigData 2025. [03/2025] I will serve as a program committee member for CIKM 2025. [03/2025] Our survey on Multi-Modal Foundation Models for Computational Pathology is available online (arXiv preprint, 2503.09091). [03/2025] Two workshops (EAI and UDM) have been accepted by KDD 2025. [03/2025] I will serve as a reviewer for ACML 2025. [03/2025] I will serve as a panelist for NSF. [02/2025] I will serve as a reviewer for NeurIPS 2025. [02/2025] I will serve as the Workshop Chair for IEEE BigData 2025. [01/2025] Our survey on Computational Pathology Foundation Models is available online (arXiv preprint, 2501.15724). [01/2025] I am invited to give a talk at the AAAI 2025 Bridge. [01/2025] I am nominated as an outstanding reviewer for KDD 2025. [01/2025] One paper is accepted by DASFAA 2025. [01/2025] One workshop ARRML'25 is accepted by SDM 2025. [01/2025] One tutorial is accepted by SDM 2025. [01/2025] I will serve as the Tutorial Chair for ICDM 2025. [01/2025] I will serve as a reviewer for KDD 2025 (February cycle). [01/2025] I will serve as a reviewer for TKDD. [01/2025] I will serve as a reviewer for the Journal of Pattern Recognition. Biography I am an Assistant Professor in the Department of Computer Science at Baylor University. Prior to joining Baylor, I was a senior R&D computer vision engineer at Kitware Inc. I earned my Ph.D. degree in Computer Science from the University of Texas at Dallas (UTD) in 2021, advised by Feng Chen. I received dual M.S. degrees in Computer Science and Biomedical Science from the State University of New York at Albany (UAlbany), and Albany Medical College in 2016. My publications have appeared in prestigious conferences and journals, including KDD, CVPR, WWW, AAAI, IJCAI, ACL, TKDD, etc. I have served as a PC member for several international conferences and workshops, such as NeurIPS, KDD, AAAI, IJCAI, ICML, ICLR, etc. Education Ph.D. (Computer Science), The University of Texas at Dallas, 2021. M.S. (Computer Science), The State University of New York at Albany, 2016. M.S. (Biomedical Science), Albany Medical College, 2016. Selected Publications For a full list of publications, see Publications. [AAAI'26] SkillGen: Learning Domain Skills for In-Context Sequential Decision Making. Ruomeng Ding, Wei Cheng, Minglai Shao, Chen Zhao In Proceedings of the AAAI Conference on Artificial Intelligence (Oral), 2026 [AAAI'26] Out-of-Distribution Detection with Positive and Negative Prompt Supervision Using Large Language Models. Zhixia He, Chen Zhao, Minglai Shao, Xintao Wu, Xujiang Zhao, Dong Li, Qin Tian, Linlin Yu In Proceedings of the AAAI Conference on Artificial Intelligence (Poster), 2026 [AAAI'26] MARLIN: Multi-Agent Reinforcement Learning for Incremental DAG Discovery. Dong Li, Zhengzhang Chen, Xujiang Zhao, Linlin Yu, Zhong Chen, Yi He, Haifeng Chen, Chen Zhao In Proceedings of the AAAI Conference on Artificial Intelligence (Poster), 2026 [AAAI'26] LLM-Enhanced Energy Contrastive Learning for Out-of-Distribution Detection in Text-Attributed Graphs. Xiaoxu Ma, Dong Li, Minglai Shao, Xintao Wu, Chen Zhao In Proceedings of the AAAI Conference on Artificial Intelligence (Poster), 2026 [NeurIPS'25] SolverLLM: Leveraging Test-Time Scaling for Optimization Problem via LLM-Guided Search. Dong Li, Xujiang Zhao, Linlin Yu, Yanchi Liu, Wei Cheng, Zhengzhang Chen, Zhong Chen, Feng Chen, Chen Zhao, Haifeng Chen. In Proceedings of the 39th Annual Conference on Neural Information Processing Systems, 2025 [ACL'25] Uncertainty Propagation on LLM Agent. Qiwei Zhao*, Dong Li*, Yanchi Liu, Wei Cheng, Yiyou Sun, Mika Oishi, Takao Osaki, Katsushi Matsuda, Huaxiu Yao, Chen Zhao, Haifeng Chen, Xujiang Zhao. In Proceedings of the 63rd Annual Meeting of the Association for Computational Linguistics, 2025 [IJCAI'25] FADE: Towards Fairness-aware Data Generation for Domain Generalization via Classifier-Guided Score-based Diffusion Models. Yujie Lin*, Dong Li*, Minglai Shao, Guihong Wan, Chen Zhao. In Proceedings of the 34th International Joint Conference on Artificial Intelligence, 2025 [IJCAI'25] A Novel Sparse Active Online Learning Framework for Streaming Anomaly Detection in Open Feature Spaces. Zhong Chen, Yi He, Di Wu, Chen Zhao, Meikang Qiu. In Proceedings of the 34th International Joint Conference on Artificial Intelligence, 2025 [ICDE'25] Fairness-aware Active Online Learning with Changing Environments. Sadaf Md Halim, Chen Zhao, Xintao Wu, Latifur Khan, Christan Grant, Feng Chen. In Proceedings of the IEEE International Conference on Data Engineering, 2025 [AAAI'25] Metric-Agnostic Continual Learning for Sustainable Group Fairness. Heng Lian, Chen Zhao, Zhong Chen, Xingquan Zhu, My T. Thai, Yi He In Proceedings of the AAAI Conference on Artificial Intelligence, 2025 [AAAI'25] Multi-View Unsupervised Column Subset Selection via Combinatorial Search. Guihong Wan, Ninghui Hao, Crystal Maung, Haim Schweitzer, Chen Zhao, Kun-Hsing Yu, Yevgeniy Semenov In Proceedings of the AAAI Conference on Artificial Intelligence, 2025 [KDD'25] MLDGG: Meta-Learning for Domain Generalization on Graphs. Qin Tian, Chen Zhao, Minglai Shao, Wenjun Wang, Yujie Lin, Dong Li In Proceedings of the ACM SIGKDD Conference on Knowledge Discovery and Data Mining, 2025 [KDD'24] Algorithmic Fairness Generalization under Covariate and Dependence Shifts Simultaneously. Chen Zhao*, Kai Jiang*, Xintao Wu, Haoliang Wang, Latifur Khan, Christan Earl Grant, Feng Chen. In Proceedings of the ACM SIGKDD Conference on Knowledge Discovery and Data Mining, 2024 [IJCAI'24] Supervised Algorithmic Fairness in Distribution Shifts: A Survey. Minglai Shao*, Dong Li*, Chen Zhao*, Xintao Wu, Yujie Lin, Qin Tian. In Proceedings of the 33rd International Joint Conference on Artificial Intelligence, 2024 [IJCAI'24] Towards Counterfactual Fairness-aware Domain Generalization in Changing Environments. Yujie Lin, Chen Zhao, Minglai Shao, Baoluo Meng, Xujiang Zhao, Haifeng Chen. In Proceedings of the 33rd International Joint Conference on Artificial Intelligence, 2024 [KDD'23] Towards Fair Disentangled Online Learning for Changing Environments. Chen Zhao*, Feng Mi*, Xintao Wu, Kai Jiang, Latifur Khan, Christan Earl Grant, Feng Chen. In Proceedings of the ACM SIGKDD Conference on Knowledge Discovery and Data Mining, 2023 [CVPR'23] Open Set Action Recognition via Multi-Label Evidential Learning. Chen Zhao, Dawei Du, Anthony Hoogs, Christopher Funk. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, 2023 [KDD'22] Adaptive Fairness-Aware Online Meta-Learning for Changing Environments. Chen Zhao*, Feng Mi*, Xintao Wu, Kai Jiang, Latifur Khan, Feng Chen. In Proceedings of the ACM SIGKDD Conference on Knowledge Discovery and Data Mining, 2022 [AAAI'22] A Nested Bi-level Optimization Framework for Robust Few-Shot Learning. Krishnateja Killamsetty, Changbin Li, Chen Zhao, Rishabh Krishnan Iyer, Feng Chen. In Proceedings of the AAAI Conference on Artificial Intelligence, 2022 [KDD'21] Fairness-Aware Online Meta-learning. Chen Zhao, Feng Chen, Bhavani Thuraisingham. In Proceedings of the ACM SIGKDD Conference on Knowledge Discovery and Data Mining, 2021 [WWW'21] CLEAR: Contrastive-Prototype Learning with Drift Estimation for Resource Constrained Stream Mining. Zhuoyi Wang, Yuqiao Chen, Chen Zhao, Hemeng Tao, Yu Lin, Xujiang Zhao, Yigong Wang and Latifur Khan. In Proceedings of the ACM International World Wide Web Conference, 2021 Research I am generally interested in machine learning, data mining, and trustworthy AI, with a primary focus on Fairness",
  "content_length": 10893,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:51"
}