{
  "name": "Cheng Han 0001",
  "homepage": "https://chenghan111.github.io",
  "status": "success",
  "content": "Cheng Han Cheng Han Assistant Professor chk9k (at) umsystem.edu University of Missouri -- Kansas City, USA Biography I am a Tenure-track Assistant Professor at the School of Science and Engineering, University of Missouri -- Kansas City, USA. My research interests include adaptable and sustainable intelligence, where I design, implement, deploy, and evaluate AI systems that empower communities. I am continuously interested in recruiting Ph.D. students with a strong background in AI agents and systemic efficiency. News (09/27/2025): Website updated for new papers published in NeurIPS. Congrats to Runjia and Yiyang! News (08/21/2025): Website updated for new paper published in EMNLP. Congrats to Runjia! News (08/15/2025): Our lab website is online! While it is still under construction, please feel free to check! News (06/29/2025): Website updated for new paper published in ICCV. Congrats to Taowen! News (03/14/2025): Website updated for new papers published in EMNLP and ICLR. Congrats to Taowen and Yiyang! Table of Content Selected Publications Services Talks and Presentation Teaching Selected Publications Visual Recognition with Deep Nearest Centriods [pdf(arxiv)][code]. W. Wang*†, C. Han*, T. Zhou*, D. Liu†, International Conference on Learning Representations (ICLR), 2023 (Spotlight). *Equal Contribution Prompt Learns Prompt: Exploring Knowledge-Aware Generative Prompt Collaboration For Video Captioning [pdf(IJCAI)]. L. Yan*, C. Han*, Z. Xu, D. Liu†, Q. Wang, International Joint Conferences on Artificial Intelligence (IJCAI), 2023. *Equal Contribution E^2VPT: An Effective and Efficient Approach for Visual Prompt Tuning [pdf(arxiv)][code]. C. Han*, Q. Wang, Y. Cui, Z. Cao, W. Wang, S. Qi, D. Liu†. International Conference on Computer Vision (ICCV), 2023. Unified 3D Segmenter As Prototypical Classifiers [pdf(Openreview)][code]. Z. Qin*, C. Han*, X. Lu, Q. Wang, X, Nie, Y, Yin†. Conference on Neural Information Processing Systems (NeurIPS), 2023. *Equal Contribution CML-MOTS: Collaborative Multi-task Learning for Multi-Object Tracking and Segmentation [pdf(arxiv)]. Y. Cui, C. Han, D. Liu†. ACM Journal on Autonomous Transportation Systems (JATS), 2023. Facing the Elephant in the Room: Visual Prompt Tuning or Full Finetuning? C. Han*, Q. Wang, Y. Cui, W. Wang, L. Huang, S. Qi, D. Liu†. International Conference on Learning Representations (ICLR), 2024 [pdf(Openreview)][code]. Image Translation as Diffusion Visual Programmers. C. Han, J. C. Liang, Q. Wang, M. Rabbani, S. Dianat, R. Rao, Y. N. Wu, D. Liu†. International Conference on Learning Representations (ICLR), 2024. [pdf(Openreview)][Website]. ProMotion: Prototypes As Motion Learners. Y. Lu, D. Liu, Q., C. Han, Y. Cui, Z. Cao, X. Zhang, Y. V. Chen, H. Fan†. IEEE / CVF Computer Vision and Pattern Recognition Conference (CVPR), 2024. [pdf] SSGA-Net: Stepwise Spatial Global-local Aggregation Networks for for Autonomous Driving. Y. Cui, C. Han, D. Liu†. [pdf] Prototypical Transformer as Unified Motion Learners. C. Han*, Y. Lu*, G. Sun, J. C. Liang, Z. Cao, Q. Wang, Q. Guan, S. A. Dianat, R. M. Rao, T. Geng, Z. Tao†, D. Liu†. International Conference on Machine Learning (ICML), 2024. [pdf] Self-supervised Adversarial Training of Monocular Depth Estimation against Physical-World Attacks. Z. Cheng, C. Han, J. C. Liang, Q. Wang, X. Zhang, D. Liu†. IEEE Transactions on Pattern Analysis and Machine Intelligence (IEEE TPAMI), 2024. [pdf] Optical Flow as Spatial-Temporal Attention Learners. Y. Lu*, C. Han*, Q. Wang, H. Fan, Z. Kong, D. Liu, Y. Chen. IEEE Transactions on Pattern Analysis and Machine Intelligence (IEEE TPAMI), 2024. AMD: Automatic Multi-step Distillation of Large-scale Vision Models. C. Han, Q. Wang, S. A Dianat, M. Rabbani, R. M Rao, Y. Fang, Q. Guan, L. Huang, D. Liu†. The European Conference on Computer Vision (ECCV), 2024. [pdf] M^2PT: Multimodal Prompt Tuning for Zero-shot Instruction Learning. T. Wang, Y. Liu, J. C. Liang, J. Zhao, Y. Cui, Y. Mao, S. Nie, J. Liu, F. Feng, Z. Xu, C. Han, L. Huang, Q. Wang, D. Liu. The Conference on Empirical Methods in Natural Language Processing (EMNLP), 2024. [pdf] Visual Fourier Prompt Tuning. R. Zeng*, C. Han*, Q Wang, C. Wu, T. Geng, L. Rao, L. Huang, Y. N. Wu, D. Liu. The Conference on Neural Information Processing Systems (NeurIPS), 2024. [pdf] Re-Imagining Multimodal Instruction Tuning: A Representation View. Y. Liu, J. C. Liang, R. Tang, Y. Lee, M. Rabbani, S. A Dianat, R. Rao, L. Huang, D. Liu, Q. Wang, C. Han†. The International Conference on Learning Representations (ICLR), 2025. [pdf] Exploring the Adversarial Vulnerabilities of Vision-Language-Action Models in Robotics. T. Wang*, C. Han*, J. C. Liang*, W. Yang, D. Liu, L. X. Zhang, Q. Wang, J. Luo, R. Tang. International Conference on Computer Vision (ICCV), 2025. [pdf][code] MEPT: Mixture of Expert Prompt Tuning as a Manifold Mapper. R. Zeng*, G. Sun*, Q Wang, T. Geng, S. A Dianat, X. Han, R. Rao, X. Zhang, C. Han, L. Huang, D. Liu. The Conference on Empirical Methods in Natural Language Processing (EMNLP), 2025. Probabilistic Token Alignment for Large Language Model Fusion. R. Zeng, J. C. Liang, C. Han, Z. Cao, J. Liu, X. Quan, Q. Wang, T. Geng, D. Liu. The Conference on Neural Information Processing Systems (NeurIPS), 2025. All You Need is One: Capsule Prompt Tuning with a Single Vector. Y. Liu, J. C. Liang, H. Fang, W. Yang, Y. Cui, X. Han, L. Huang, D. Liu, Q. Wang, C. Han. The Conference on Neural Information Processing Systems (NeurIPS), 2025. Services Faculty Search Committee at the University of Missouri – Kansas City, 2024 Graduate Committee at the University of Missouri – Kansas City, 2024 Doctoral Consortium Chair at the ACM/IEEE Joint Conference on Digital Libraries (JCDL), 2025 Program Committee, The Association for the Advancement of Artificial Intelligence (AAAI), 2023 -- Now. Program Committee, SIAM International Conference on Data Mining (SDM), 2024. Reviewer, The Annual Conference on Neural Information Processing Systems (NeurIPS), 2024. Reviewer, The International Conference on Learning Representations (ICLR), 2024. Reviewer, The Conference on Computer Vision and Pattern Recognition (CVPR), 2022 -- Now. Reviewer, IEEE Transactions on Circuits and Systems for Video Technology (IEEE TCSVT), 2022 -- Now. Reviewer, Association for Computational Linguistics Rolling Review (ARR), 2023 -- Now. Reviewer, The International World Wide Web Conference (WWW), 2024. Reviewer, The Annual Conference on Neural Information Processing Systems (NeurIPS), 2024 - now Reviewer, The International Conference on Learning Representations (ICLR), 2023 – now Reviewer, The International Conference on Machine Learning (ICML), 2023 – now Reviewer, International Journal of Computer Vision (IJCV), 2024 Reviewer, Transactions on Machine Learning Research (TMLR), 2024 - now Reviewer, IEEE Transactions on Pattern Analysis and Machine Intelligence (IEEE TPAMI), 2024 - now Reviewer, IEEE Transactions on Artificial Intelligence (IEEE TAI), 2025. Reviewer, Neurocomputing, 2024. Reviewer, The International Conference on Computer Vision (ICCV), 2025. Reviewer, The Winter Conference on Applications of Computer Vision (WACV), 2026. Talks and Presentation ICLR 2023 Spotlight Presentation, Visual Recognition with Deep Nearest Centriods [YouTube]. ICCV 2023 Presentation, E^2VPT: An Effective and Efficient Approach for Visual Prompt Tuning [YouTube]. NeurIPS 2023 Presentation, Unified 3D Segmenter as Prototypical Classifiers. New Orleans, USA. ICLR 2024 Presentation, Facing the Elephant in the Room: Visual Prompt Tuning or Full Finetuning? ICLR 2024 Presentation, Image Translation as Diffusion Visual Programmers. NSF REU SITE: AI-empowered Cybersecurity Seminar Series (07/12/2024): Prompts as Sustainable Learners. EMNLP 2024 Presentation, M^2PT: Multimodal Prompt Tuning for Zero-shot Instruction Learning (11/14/2024). Naval Research Laboratory Machine Learning Seminar (12/04/2024): Parameter Efficient Finetuning in Large-scale AI Models. NSF LEVEL UP AI Roundtable (04/25/2025): Principles and Resources for AI Education for All. The Computing Community Consortium (CCC) Computing Futures Symposium (05/15/2025-05/16/2025): Re-Imagining Multimodal Instruction Tuning from a Parameter-efficient Representation Perspective. NSF REU SITE: AI-empowered Cybersecurity Seminar Series (06/30/2025): Efficient Fine-Tuning for X. Teaching UMKC COMP-SCI 5567-0001: Deep Learning Spring, 2025. UMKC COMP-SCI 5567-0002: Deep Learning Fall, 2025.",
  "content_length": 8511,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:52"
}