{
  "name": "Chenren Xu",
  "homepage": "http://soar.group/chenren",
  "status": "success",
  "content": "Chenren Xu I am looking for highly self-motivated Postdoc, Ph.D. students and undergrads to work on the design, implementation and evaluation of wireless and IoT/XG networking systems for mobile and ubiquitous computing in the smart transportation, logistics, manufacturing and health domains. Office Hours is by appointment. News! 08/2025: Invited to serve as TPC for MobiCom'26, please consider submitting! 06/2025: SynCheck is awarded MobiSys'25 Best Paper! 06/2025: RF-Rock is accepted to MobiCom'25! 05/2025: Invited to serve as TPC for SenSys'26, please consider submitting! 04/2025: Two papers on Rust-based OS kernel and space computing network emulator are accepted to ATC'25! 04/2025: SynCheck is accepted to MobiSys'25! 01/2025: RetroLiDAR is accepted to SenSys'25! 01/2025: EchoSight is accepted to CHI'25! 07/2024: Invited to serve as TPC for MobiCom'25, please consider submitting! 05/2024: Invited to serve as General Chair for MobiSys'25, please consider submitting! 05/2024: Invited to serve as TPC Chair for UbiComp'25, please consider submitting! 05/2024: Traffic Load Properties Verification is accepted to SIGCOMM'24! 12/2023: Three papers on high throughput WiFi Direct, low latency congestion control and network traffic verification accepted to NSDI'24! 10/2023: Invited to serve as TPC for SIGCOMM'24, please consider submitting! 07/2023: Low-latency Multipath transport AUGUR is accepted to NSDI'24! 06/2023: High-throughput Large-Capacity 5G UPF X-Plane is accepted to MobiCom'23! 05/2023: Reliable Multi-Carrier Multipath QUIC CellFusion is accepted to SIGCOMM'23! 05/2023: Invited to serve as TPC for Security'24, please consider submitting! 05/2023: Our Multi-user Acoustic Sensing work is accepted to MobiSys'23! 04/2023: Invited to serve as TPC for NSDI'24, please consider submitting! 03/2023: Our 3-year Mobile Mutipath Transport Deployment work is accepted to MobiCom'23! 03/2023: RFSifter: Layer-0.5 Ubiquitous IoT Anti-Interference is accepted to MobiCom'23! 02/2023: Invited to serve as TPC Chair for HotMobile'24, please consider submitting! 12/2022: Invited to serve as Associate Editor for CCF TPCI! 11/2022: Invited to serve as TPC for CoNEXT'23, please consider submitting! 10/2022: Invited to serve as Editor for ACM IMWUT (UbiComp)! 10/2022: Invited to serve as TPC for MobiSys'23, please consider submitting! 09/2022: MiVital is awarded CCF TPCI Best Paper Award 2022! 09/2022: RetroMUMIMO is accepted to SenSys'22! 08/2022: Invited to serve as TPC for IPSN'23, please consider submitting! 07/2022: High-performance Multipath Networking Middleware for High-speed Railway is accepted to NSDI'23! 07/2022: High-performance RFID Localization for Logistic Networks is accepted to NSDI'23! 07/2022: Long Range Accoustic Sensing is accepted to UbiComp'22! 06/2022: Affiliated with Artificial Intelligence Innovation Center (AIIC) at Peking University! 02/2022: Invited to serve as TPC for SenSys'22, please consider submitting! 01/2022: SalientVR: Saliency-driven Mobile 360-degree Video Streaming is accepted to MobiCom'22! 12/2021: High-speed Railway 5G Measurement work is accepted to SIGMETRICS'22! 10/2021: Invited to serve as Associate Editor for《电子学报》and Chinese Journal of Electronics! 10/2021: Invited to serve as TPC for MobiSys'22, please consider submitting! 09/2021: FDD MIMO is accepted to MobiCom'21! 08/2021: Invited to serve as TPC for IPSN'22, please consider submitting! 08/2021: (Early) tenured! 08/2021: Appointed as Information Director of ACM SIGMOBILE! 08/2021: Appointed as Cross-SIG Activities Director of ACM SIGBED! 07/2021: Congratulations to Purui for winning the PKU EECS Rising Star Award (1/336)! 06/2021: Invited to serve as TPC for MobiCom'22, please consider submitting! 05/2021: Named as World's Top 2% Scientists 2020 by Stanford University! 04/2021: Invited to serve as Associate Editor for Communications of the CCF《中国计算机学会通讯》! 04/2021: Awarded CIE Outstanding Scientific and Technological Worker (中国电子学会优秀科技工作者)! 01/2021: Appointed as Secretary General of ACM SIGBED China! 01/2021: Invited to serve as TPC for SenSys'21, please consider submitting! 12/2020: Invited to co-chair the Poster/Demo session for UbiComp'21, please consider submitting! 12/2020: Awarded ACM SIGCOMM China Rising Star! 11/2020: Gave a keynote speech in SenSys'20 Ph.D. Forum! 09/2020: Awarded NSFC Excellent Young Scientists Fund (a.k.a. Chinese NSF CAREER Award)! 09/2020: Gave a keynote speech in UbiComp'20 CPD Workshop! 07/2020: Invited to serve TPC for INFOCOM'21 and Publication Chair for SIGCOMM'21! 05/2020: RetroTurbo (VLC backscatter) and NFC+ (Magnetic Backscatter) systems are accepted to SIGCOMM'20! 05/2020: LTE disconnection taxonomy and HSR TCP-LTE measurement study is accepted to JSAC'20! 05/2020: FPGA-based Edge Computing System is accepted to TMC'20! 01/2020: Invited to serve as TPC, Vice General Chair and Student Travel Grant Chair for SenSys'20! 01/2020: VLC Backscatter System for Infrastructure-to-Vehicle Networking is accepted to MobiCom'20! 12/2019: FPGA-powered Dynamic DNN Reconfigurable Continuous Mobile Vision System is accepted to INFOCOM'20! 12/2019: Gave a keynote speech in Embedded AI Summit in Shenzhen, China! 10/2019: PQAM for VLC Backscatter won MobiCom'19 Student Research Competition Gold Medal! 07/2019: Invited to serve as TPC for IPSN'20 and Publicity Chair for CPS-IoT Week'20! 07/2019: SGX-based Privacy-perserving Edge Computing System is accepted to MobiCom'19! 06/2019: Co-chaired ACM MobiSys'19 Rising Stars Forum in Seoul, Korea! 05/2019: Gave a keynote speech in Rising Star Forum of ACM Turing Celebration Conference - China (ACM China未来新星论坛)! 03/2019: Gave a seminar talk on VLC Backscatter work in MIT CSAIL! 03/2019: Backscatter opensource platform tutorial paper is featured in GetMobile Magazine! 02/2019: Invited to serve as Workshop Chair of SenSys'19! 01/2019: Invited to serve as Associate Editor of ACM IMWUT/UbiComp! 11/2018: Gave an invited talk on VLC Backscatter work in Future Internet Summit in Seoul, Korea! 11/2018: VLC Backscatter System for V2X communications is awarded SenSys'18 Best Demo! 10/2018: High-speed Rails TCP is accepted to MobiCom'19! 09/2018: Awarded Alibaba DAMO Academy Young Fellow of class 2018! 09/2018: Backscatter tutorial paper was featured in IEEE Signal Processing Magazine Special Issue on IoT! 06/2018: Invited to serve as Web Chair for SIGCOMM'19 and TPC for IPSN'19! 02/2018: Invited to serve as TPC for SenSys'18! 10/2017: Awarded MSRA StarTrack Visiting Scholarship of class 2018! 10/2017: Awarded CCF-Intel Young Faculty of class 2017! 10/2017: Gave seminar talks on VLC Backscatter work in TUM, Oxford and Cambridge! 10/2017: Software-defined Charging and VLC Backsatter won MobiCom'17 Student Research Competition Silver and Bronze Medals! 10/2017: Invited to co-chair the Poster/Demo session for UbiComp'18! 07/2017: On-bed Vital Sign Sensing work is accepted to SenSys'17! 07/2017: Invited to attend the NSF Extreme Wireless Visioning Workshop held in Salt Lake City! 06/2017: VLC Backscatter for Battery-free IoT is accepted to MobiCom'17! Chenren Xu 518S Science Building No.5 5 Yiheyuan Road Beijing, China, 100871 Tel: +86(0)10-6276-7874 Fax: +86(0)10-6275-8746 Email: chenren AT pku.edu.cn",
  "content_length": 7265,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:01"
}