{
  "name": "Cheng Long 0001",
  "homepage": "https://personal.ntu.edu.sg/c.long/index.html",
  "status": "success",
  "content": "Cheng LONG's Homepage Cheng LONG Associate Professor VectorDB @NTU Data Management @Nanyang Tech College of Computing and Data Science Nanyang Technological University Email: c.long@ntu.edu.sg Office: N4-2c-94 Address: 50 Nanyang Avenue, Singapore, 639798 Telephone: +65 6790 6822 DBLP profileGoogle Scholar profile Biography: Cheng LONG is currently an Associate Professor at the College of Computing and Data Science (CCDS), Nanyang Technological University (NTU), Singapore. From 2016 to 2018, he was a lecturer at Queen's University Belfast, UK. He received his PhD degree from the Hong Kong University of Science and Technology, Hong Kong, in 2015, and his BEng degree from South China University of Technology, China, in 2010. Research Interests: He has research interests broadly in databases and machine learning. He is recently working on vector databases (and its applications in large models such as retrieval-augmented generative AI), machine learning (on spatial data, time series, graphs, etc.). For more details about his research, please check VectorDB @NTU and Publications. Recent News: 04/06/2025 - We released the RaBitQ Library - a new open-source library for advanced quantization algorithm RaBitQ and high-accuracy, low-memory vector search. Selected Talks: High-Dimensional Vector Quantization: General Framework, Recent Advances, and Future Directions, International Workshop on Frontiers of Data Engineering and AI (2025) RaBitQ: Quantizing High-Dimensional Vectors with a Theoretical Error Bound for Approximate Nearest Neighbor Search, Huawei Singapore Harmony Software Technology Workshop (2024), Huawei Global Software Technology Summit & Sentosa Summit (2024) Nearest Neighbor Search on High-Dimensional Vector Data, Huawei Sentosa Software Technology Summit (2023), TheWebConf’24 Workshop (keynote) RL4SpatialDB: On Leveraging Reinforcement Learning for Spatial Data Management, MCSCT 2023 (Macau), Microsoft Research Lab - Redmond (2023); MUST 2023 (keynote), Southeast U (2023) Dense Subgraph Mining: Applications, Problems, and Algorithms, KDD.SG (2023); Nanjing UST (2023); WeBank (2022)",
  "content_length": 2125,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:53"
}