{
  "name": "Chenliang Li",
  "homepage": "http://www.lichenliang.net/index.html",
  "status": "success",
  "content": "Chenliang LI - Wuhan University ä¸­æç Chenliang Li Professor Data Intelligence Laboratory (Dance Lab) School of Cyber Science and Engineering Wuhan University, China Email: cllee [at] whu [dot] edu [dot] cn One KDD ADS paper has been accepted! One research paper has been accepted by TPAMI! One research paper has been accepted by ACM TOIS! RESEARCH INTERESTS Information Retrieval Natural Language Processing Statistics Learning Data Mining Social Media Analysis and Mining We have set up a Github account, WHUIR, for releasing the implementations relevant to our reseach works PROFESSIONAL ACTIVITIES Editorial Board Member ACM Transactions on Information Systems (TOIS) - Associate Editor ACM Transactions on Asian and Low-Resource Language Information Processing (TALLIP) - Associate Editor Information Processing and Management (IPM) Journal of the Association for Information Science and Technology (JASIST) Data Analysis and Knowledge Discovery (A Chinese Core Journal, CCF-C Rank) Conference Organization YSSNLP 2021 PC co-chair, ICDM 2021 Panel co-chair, ASIS&T AP 2020 Sponsorship co-chair, CIKM 2017 Demo track co-chair, CIKM 2017 Session chair (Text Analysis), ADMA 2017 Proceedings co-chair, SMP 2017 Publicity chair, CCIR 2018 Proceedings & Publicity chair, CCL 2019 Publicity co-chair, CCAC 2022 Student Panel co-chair, CCAC 2023 Sponsorship co-chair, YSSNLP 2023 Sponsorship co-chair, WSDM 2023 Session chair (Recommender Systems), CCIR 2024 Local Chair, ADMA 2024 Encore Track Chair Program Committee Member WWW 2026 (SPC); CVPR 2026; ICLR 2026; WSDM 2026; EMNLP 2025 (AC); SIGIR-AP 2025 (SPC); RecSys 2025 (SPC); AAAI 2025 (SPC); CIKM 2025 (SPC); SIGIR 2025ï¼AC); WSDM 2025; WWW 2025 (AC); CIKM 2024 (SPC); RecSys 2024 (SPC); KDD 2024; SIGIR 2024 (SPC); IJCAI 2024 (SPC); UMAP 2024; WWW 2024 (AC); WSDM 2024; RecSys 2023 (SPC); KDD 2023; SIGIR 2023 (SPC); IJCAI 2023 (SPC); WWW 2023; AAAI 2023; WSDM 2022; EMNLP 2022; COLING 2022 (AC); CIKM 2022; SIGIR 2022; KDD 2022; ACL 2022; IJCAI 2022; AAAI 2022 (SPC); WWW 2022; WSDM 2022; CIKM 2021; EMNLP 2021; ACL 2021; SIGIR 2021; IJCAI 2021 (SPC); NAACL 2021; WSDM 2021; AAAI 2021; EMNLP 2020; AACL 2020; CIKM 2020; SIGIR 2020; JCDL 2020; ACL 2020; IJCAI 2020; AAAI 2020; WSDM 2020; EMNLP 2019; CIKM 2019 (SPC); ACL 2019; IJCAI 2019; SIGIR 2019; NAACL-HLT 2019; AAAI 2019; EMNLP 2018; SIGIR 2018; ACL 2018; IJCAI 2018; WWW 2018; IJCNLP 2017; CIKM 17-18; ACL 2017; SIGIR 2017(Full&Short, Outstanding Reviewer Award); Journal Reviewer IEEE TPAMI; ACM TIST; ACM TKDD; ACM TWEB; ACM TOIS; ACM CSUR; IEEE TKDE; IEEE TMM; IEEE TNNLS; IEEE TIFS; ACM TALLIP; ACM TDS; IEEE TOII; JASIST; Information Processing & Management (IPM, 2018/2019 Best Reviewer); JCST; Neurocomputing; SCIENCE CHINA Information Sciences; Information Sciences; Information Systems; WWWJ; Cognitive Computation (COGN); Neural Networks; Frontiers of Computer Science; Social Network Analysis and Mining (SNAM); Aslib Journal of Information Management (AJIM); IJPRAI; Information Processing Letters (IPL); FCS Others Principal Investigator of CAAI-Ant Research Project for Big Model (Sep 2024 ~ Sep 2025) Principal Investigator of Tencent RhionBird for WeChat Big Model Research Project (Aug 2024 ~ Aug 2025) Principal Investigator of CCF-Ant Research Project for Green Computing (Feb 2023 ~ Jan 2024) Principal Investigator of Alibaba Collaboration Project (Ads BU, Sep 2022 ~ Sep 2023) Principal Investigator of Antgroup Collaboration Project (Search BU, Aug 2021 ~ Aug 2022) Principal Investigator of Kuaishou Collaboration Project (Recommendation Algorithm Team, Oct 2020 ~ Oct 2021) Principal Investigator of XiaoMi Collaboration Project (AI Lab, Oct 2020 ~ Oct 2021) Principal Investigator of Alibaba AIR Project (Search BU, Aug 2019 ~ Aug 2020) Visiting Scholar of Alibaba Group (NewRetail BU, Aug 2018 ~ Dec 2018) Visiting Scholar of Alibaba Group (AliMe Team, Nov 2017 ~ Feb 2018) Member of ACM & ACL Member of China Computer Federation Member of ACM SIGIR Beijing Chapter Member of Technical Committee on Social Media Processing, Chinese Information Processing Society of China Executive Member of Technical Committee on Information Retrieval, Chinese Information Processing Society of China Member of Youth Working Committee, Chinese Information Processing Society of China Executive Board Member of Technical Committee on Affect Computing, Chinese Information Processing Society of China Research Intern at HP Labs, Singapore. Sept 1st, 2011 ~ Jan 31st, 2012. Visiting Scholar (invited by Prof.Adam Wierzbicki) at the Polish-Japanese Institute of Information Technology (PJIIT), Warsaw, Poland. Sept 13th, 2010 ~ Sept 25th, 2010. Research Team Mr. Xinran Yang, Master 2025.09 Miss. Jingge Song, Master 2025.09 Miss. Lijun Yan, Master 2025.09 Mr. Yiheng Yan, Master 2025.09 Mr. Hanchun Hu, Phd 2025.09 Mr. Xuyan Yin, Master 2024.09 Mr. Mingming Zhang, Master 2024.09 Mr. Chaohui Wang, Master 2024.09 Miss. Jiawen Yu, Master 2024.09 Miss.Yuanchen Cao, Master 2024.09 Mr. Ruilin Li, Phd 2024.09 Mr. Zuoli Tang, PhD 2021.09 Mr. Xuekong Xu, Phd 2024.09 Mr. Zihao Li, PhD 2022.09 Mr. Kui Liu, Master 2023.09 Mr. Jiahua Zhang, Master 2023.09 Miss. Na Li, Master 2023.09 Mr. Yuqing Yu, PhD 2023.09 Alumni Mr. Haoran Wang, Master 2017 (JD) Mr. Jian Xing, Master 2017 (NetEase Inc.) Mr. Zhiyong Wu, Bachelor 2017 (PhD at HKU) Mr. Zha Daochen, Bachelor 2018 (PhD at TAMU) Mr. Yile Chen, Bachelor 2018 (PhD at NTU) Mr. Jiahui Ding, Bachelor 2018 (MS at USC) Mr. Zhiqian Zhang, Master 2018 (JD.com) Mr. Jiaxin Pei, Bachelor 2019 (PhD at UMich) Miss. Runnan Cao, Bachelor 2019 (MS at CAS) Miss. Shiqian Chen, Master 2019 (Alibaba) Mr. Yu Duan, Master 2019 (Alibaba) Mr. Jiangsheng Xu, Master 2019 (Opera Software) Mr. Jiahui Liang, Master 2019 (JD.com) Mr. Zesheng Jin, Master 2019 (China Mobile) Miss. Yan Qi, Master 2020 (JD.com) Mr. Bulou Liu, Bachelor 2020 (PhD at Tsinghua) Mr. Canwen Xu, Bachelor 2020 (PhD at UCSD) Mr. Feiyang Wang, Bachelor 2020 (MS at CMU) Mr. Cong Quan, PhD 2020 (Huawei) Mr. Junhui Long, Master 2021 (Bank of China) Miss. Qian Liu, Master 2022 (The Red Book) Miss. Yiyu Liu, Master 2022 Mr. HongTao Wu, Master 2022 (ByteDance) Mr. Xudong Ren, Master 2022 (JD) Mr. Tao Zhou, Master 2022 (PDD) Mr. Siqi Lai, Bachelor 2022 (PhD at HKUST) Mr. Ziyi Chen, Bachelor 2022 (Master at UIUC) Mr. Yanchong Zheng, Bachelor 2022 (Master at Rice) Mr. Yuhao Yang, Bachelor 2022 (PhD at HKU) Mr. Xinyu Zou, Master 2023 (AntGroup) Miss. Rui Zhu, Master 2023 (JD) Mr. Zitong Wang, Master 2024 Mr. Yu Tian, Master 2024 (TripGroup) Miss. Yihua Wen, Master 2024 (AntGroup) Miss. Lijin Wang, Master 2025 (China Power) Miss. Shirui Hu, Master 2025 (ByteDance) PUBLICATIONS: (*=corresponding author, †=Equal Contribution) Q-Regularized Generative Auto-Bidding: From Suboptimal Trajectories to Optimal Policies. Mingming Zhang, Na Li, Feiqing Zhuang, Hongyang Zheng, Jiangbing Zhou, Wuyin Wang, Sheng-jie Sun, Xiaowei Chen, Junxiong Zhu, Lixin Zou Chenliang Li*. The 32nd SIGKDD Conference on Knowledge Discovery and Data Mining (KDD'26). Jeju, Korea. August 2026 [ADS Track] Learning Discrete Identifiers and Dense Vectors for Generative Retrieval . Yunfan Xie, Lixin Zou*, Xiangyang Luo*, Hengyi Cai, Chaoran Zhang, Liming Dong, Xixun Lin, Chenliang Li ACM Transactions on Information Systems (TOIS) 2025 [In Press] Generative Causality-driven Network for Graph Multi-task Learning. Xixun Lin, Qing Yu, Yanan Cao, Lixin Zou, Chuan Zhou, Jia Wu, Chenliang Li, Peng Zhang, Shirui Pan. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI). 2025 [In Press] CharacterCraft: Bridging the Literature-Reality Dialogue Gap for Practical Role-Playing Agents. Xuyan Yin, Xinran Yang, Zihao Li, Lixin Zou*, Chenliang Li*. The 2025 Conference on Empirical Methods on Natural Language Processing (EMNLP'25). Suzhou, China. Nov 2025 [Findings] Flow Matching based Sequential Recommender Model. Feng Liu, Lixin Zou*, Xiangyu Zhao, Min Tang, Liming Dong, Dan Luo, Xiangyang Luo*, Chenliang Li. The 34th International Joint Conference on Artificial Intelligence (IJCAI'25) 2025 Bridging the Gap: Consistent Image Outpainting via Training-Free Noise Optimization. Na Li, Zihao Li, Zuoli Tang, Yuqing Yu, Lixin Zou*, Chenliang Li*. The 33rd ACM Conference on Multimedia (MM'25). Oct, 2025 [Full paper] Data4RACTC. Xuan Ma, Zepeng Bao, Ming Zhong, Yuanyuan Zhu, Chenliang Li, Jiawei Jiang, Qing Li, Tieyun Qian. IEEE DataPort 2025 A Survey on Side Information-Driven Session-Based Recommendation: From a Data-Centric Perspective. Xiaokun Zhang, Bo Xu, Chenliang Li, Bowei He, Hongfei Lin, Chen Ma, Fenglong Ma. IEEE Transactions on Knowledge and Data Engineering (TKDE) 37(8), 2025 Token-level Preference Self-Alignment Optimization for Multi-style Outline Controllable Generation. Zihao Li, Xuekong Xu, Ziyao Chen, Lixin Zou, Ethanhj Wu, Qiang Chen, Chenliang Li*. The Findings of ACL 2025 (ACL'25). August, 2025 [Full paper] AIGuard: A Benchmark and Lightweight Detection for E-commerce AIGC Risks. Wenhua Zhang, Weicheng Li, Xuanrong Rao, Lixin Zou*, Xiangyang Luo, Chubin Zhuang, Yongjie Hong, Zhen Qin, Hengyun Chang, Chenliang Li, Bo Zheng. The Findings of ACL 2025 (ACL'25). August, 2025 [Full paper] Weak-to-Strong Honesty Alignment via Learning-to-Rank Supervision. Yunfan Xie, Lixin Zou*, Dan Luo, Min Tang, Chenliang Li. The Findings of ACL 2025 (ACL'25). August, 2025 [Full paper] Efficient and Explainable Sequential Recommendation with Language Model. Zihao Li, Lixin Zou, Chao Ma, Chenliang Li*. Information Processing and Management (IPM). 2025 [In Press] Retrieval Augmentation for Text-to-Table Generation. Jiahua Zhang, Meijuan Tan, Jing Zhang, Xiaolu Zhang, Jun Zhou, Chenliang Li*. Information Processing and Management (IPM). 2025 [In Press] Towards Accurate Social User Geolocation: MeanShift, Incremental Learning and Graph Convolutional Networks. Yaqiong Qiao, Aobo Jiao, Xiangyang Luo, Chenliang Li, Jiangtao Ma, Chenkai Guo. The 48th Annual Int",
  "content_length": 40034,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:00"
}