{
  "name": "ChengXiang Zhai",
  "homepage": "http://czhai.cs.illinois.edu",
  "status": "success",
  "content": "ChengXiang Zhai - Home Page ChengXiang (\"Cheng\") Zhai ( Short Biography) Donald Biggar Willett Professor in Engineering Department of Computer Science (Also affiliated with Carl R. Woese Institute for Genomic Biology, Statistics , School of Information Sciences , and Personalized Nutrition Initiative) University of Illinois at Urbana-Champaign, 201 N. Goodwin Ave, Urbana, IL 61801 Office: 2116 Siebel Center (directions) Phone: +1-217-244-4943 Fax: +1-217-265-6494 Email: czhai AT illinois DOT edu Assistant: Salome Liebenberg (salomel AT illinois DOT edu, +1-217-300-6487, 4301 SC) Research Interests: My general interests are in developing all kinds of novel Intelligent Information Systems (e.g., intelligent search engines, recommender systems, text analysis engines, Chatbots, and intelligent task agents) to help people manage and exploit large amounts of data (i.e., \"big data\"), especially natural language text data, to augment human intelligence. I am especially interested in developing general models, theoretically sound algorithms, and systems for analyzing large amounts of data to discover latent knowledge and derive new insights from the data, and applying such general techniques to build innovative applications in specific domains such as healthcare, education, and scientific discovery, to support all kinds of user tasks. To optimize human-AI collaboration and maximize the combined intelligence of humans and AI systems, I study how to mathematically model and simulate users, how to optimize sequential decisions for an intelligent agent to interact with users to support their tasks in a personalized manner while minimizing a user's overall effort, and how to support explainable AI using human-like natural language processing. read more... Research Group: TIMAN, DAIS Publications & Selected Talks (Google Scholar Profile, DBLP Profile) The Book Text Data Management: A Practical Introduction to Information Retrieval and Text Mining, ChengXiang Zhai and Sean Massung, ACM and Morgan & Claypool Publishers, July 2016. has now been translated into Chinese (see the Chinese version). The book is the main reference book for two MOOCs on Coursera that I'm teaching: (1) Text Retrieval and Search Engines ; (2) Text Mining and Analytics. Selected Honors and Awards ACM SIGIR Gerard Salton Award (2021) ACM SIGIR Academy (2021); ACM Fellow (2017); ACM Distinguished Scientist (2009) Presidential Early Career Award for Scientists and Engineers (PECASE) (2004, Nominated by NSF based on NSF Career Award) Alfred P. Sloan Research Fellowship Award (2008) ACM SIGIR Test of Time Paper Award (three times, for work on Subtopic Retrieval and Diversity in IR (SIGIR 2003 paper), Smoothing Methods for IR (SIGIR 2002 paper), and Bayesian decision-theoretic framework for IR (SIGIR 2002 paper)). Rose Award for Teaching Excellence (2010, College of Engineering, UIUC) UIUC Campus Award for Excellence in Graduate Mentoring (2016) UIUC List of Teachers Ranked as Excellent by Their Students ( Fall 2002, Spring 2005, Fall 2006, Spring 2009, Fall 2010, Fall 2011, Fall 2012, Fall 2014, Fall 2016, Spring 2018, Fall 2018) IBM Faculty Award (2009) HP Innovation Research Award (2011-2012) Selected Services Editor (Americas)}, Information Retrieval Book Series, Springer (June 2014- present); Associate Editor, BMC Medical Informatics and Decision Making (March 2016 - present); Associate Editor, ACM Transactions on Knowledge Discovery from Data (Oct. 2017-). Previously, Associate Editor, ACM Transactions on Information Systems (2006-2014), Information Processing and Management (2010-2016); Editorial Board, Information Retrieval Program Co-Chair: WWW 2015, ACM SIGIR 2009, NAACL HLT 2007, ACM CIKM 2004 Conference Co-Chair: ACM WSDM 2018, ACM CIKM 2016 Teaching CS591BAI Biologically Plausible Artificial Intelligence ( Fall 2024) CS410DSO Text Information Systems (Online) (Fall 2024) MOOC: Text Retrieval and Search Engines (part of data mining specialization on Coursera, offered since 2015) MOOC: Text Mining and Analytics (part of data mining specialization on Coursera, offered since 2015) CS510 Advanced Information Retrieval ( Spring 2024) List of courses taught between 2016-2023 List of courses taught before 2016 Links DCS Advisors Handbook Merriam-Webster Online R& D Resources Postscript, PDF, and Word Viewers DL",
  "content_length": 4346,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:56"
}