{
  "name": "Chenghua Lin",
  "homepage": "https://research.manchester.ac.uk/en/persons/chenghua-lin",
  "status": "success",
  "content": "Chenghua Lin - Research Explorer The University of Manchester X Chenghua Lin Professor Professor of Natural Language Processing, Natural Language Processing and Text Mining https://orcid.org/0000-0003-3454-2468 Accepting PhD Students Personal profile BiographyI am Professor of Natural Language Processing in the Department of Computer Science, University of Manchester. Before joining Manchester, I was a Senior Lecturer (Associate Professor) in Natural Language Processing in the Department of Computer Science, University of Sheffield, where I also held the role of Deputy Director of Research and REF Lead for UoA11. Prior to Sheffield, I was a SICSA Senior Lecturer at the University of Aberdeen. Research interestsMy research is centred around natural language processing and generation, machine learning, and the intersection between them. Specific interests include developing probabilistic generative and deep learning models for data-to-text generation, dialogue systems, text summarisation, metaphor processing, as well as representation learning for music and speech. For more info, please visit my group page.Memberships of committees and professional bodiesSecretary and Board member of ACL SIGGENCommittee Member of the IEEE Speech and Language Processing Technical CommitteeAssociate Editor for Computer Speech and Language (2023 - )Associate Editor for Neurocomputing (2019 – )Action Editor for ACL Rolling Review (ARR) (2023 - )Standing Reviewer for Computational Linguistics (2020 – )Standing Reviewer for TACL (2021 – ) Fingerprint Dive into the research topics where Chenghua Lin is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Large Language Model Computer Science 100% Experimental Result Computer Science 35% Representation Learning Computer Science 30% Dialog System Computer Science 30% Natural Language Processing Computer Science 29% Multimodal Information Computer Science 25% Benchmarking Computer Science 25% Graph Representation Computer Science 25% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 10 Preprint 3 Conference contribution 1 Paper 1 Poster 2 More 1 Article 1 Other contribution Research output per year Research output per year Does Table Source Matter? Benchmarking and Improving Multimodal Scientific Table Understanding and ReasoningYang, B., Zhang, Y., Liu, D., Freitas, A. & Lin, C., 22 Jan 2025, arXiv, 17 p.Research output: Preprint/Working paper › Preprint File Instruction Tuning 100% 5 Downloads (Pure) LVPruning: An Effective yet Simple Language-Guided Vision Token Pruning Approach for Multi-modal Large Language ModelsSun, J., Sun, Y., Batista-Navarro, R. T., Lin, C., Li, H. & Xin, Y., 2025, 2024 Annual Conference of the North American Chapter of the Association for Computational Linguistics.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open Access Large Language Model 100% Multimodal LLM 100% Constrained Environment 50% Performance Model 50% Average Performance 50% 1 Downloads (Pure) Train & Constrain: Phonologically Informed Tongue-Twister Generation from Topics and ParaphrasesLin, C., Loakman, T. & Tang, C., 2025, In: Computational Linguistics.Research output: Contribution to journal › Article › peer-review CAST: Corpus-Aware Self-similarity Enhanced Topic modellingMa, Y., Xiao, C., Yuan, C., van der Veer, S., Hassan, L., Lin, C. & Nenadic, G., 19 Oct 2024, arXiv, p. 1-14, 14 p.Research output: Preprint/Working paper › Preprint Topic Modeling 100% Contextual Information 20% Machine Learning Technique 20% Contrastive Learning 20% Word Embedding 20% Crafting Customisable Characters with LLMs: Introducing SimsChat, a Persona-Driven Role-Playing Agent FrameworkYang, B., Liu, D., Xiao, C., Zhao, K., Li, C., Yuan, L., Yang, G., Huang, L. & Lin, C., 25 Jun 2024, arXiv, 25 p.Research output: Preprint/Working paper › Preprint File Driven Persona 100% Basic Behavior 33% 68 Downloads (Pure) View all 17 research outputs",
  "content_length": 4376,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:58"
}