{
  "name": "Chen Feng",
  "homepage": "https://pure.qub.ac.uk/en/persons/chen-feng",
  "status": "success",
  "content": "Chen Feng - Queen's University Belfast View Scopus Profile Chen Feng Dr https://orcid.org/0000-0001-9199-559X Emailc.fengqub.acuk Accepting PhD StudentsPhD projectsPlease email me your specific research interests. I am broadly interested in topics related to Machine Learning and Computer Vision. 20222025 Research activity per year Personal profile ParticularsI am a Lecturer (Assistant Professor) in Machine Learning at Queen's University Belfast since September, 2024. Previously, I was a Postdoctoral Research Associate in Information, Inference and Machine Learning Group at University College London. I earned my PhD from Queen Mary University of London under the guidance of Prof. Ioannis Patras. I also spent time as an AI4Media Junior Exchange Fellow at University of Trento, collaborating with Prof. Nicu Sebe. I hold a master’s degree from Tsinghua University, where I conducted bioinformatics research supervised by Prof. Jin Gu. I completed my bachelor’s degree at Nankai University. Research InterestsMy research explores machine learning under imperfect information, spanning self-supervised learning, semi-supervised learning, and learning with noisy or coarse labels. I am also focused on assessing and improving the safety of imperfect models, such as large language models (LLMs). I'm happy to connect on these topics or potential collaborations—please feel free to email me. Fingerprint Dive into the research topics where Chen Feng is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 2 Similar Profiles Contrastive Learning Computer Science 100% Semisupervised Learning Computer Science 100% Self-Supervised Learning Computer Science 70% Large Language Model Computer Science 60% Annotation Computer Science 53% Learning System Computer Science 50% Machine Learning Computer Science 50% Potential Solution Computer Science 50% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2022 2022 2024 2025 2025 9 Conference contribution 1 Article 1 Other contribution Research output per year Research output per year Gen4Track: a tuning-free data augmentation framework via self-correcting diffusion model for vision-language trackingGe, J., Zhang, X., Gao, Q., Zhu, X., Liu, W., Cao, B., Wang, K., Liu, C., Liu, B., Feng, C. & Patras, I., 27 Oct 2025, Proceedings of the 33rd ACM International Conference on Multimedia (MM ’25). Association for Computing Machinery, p. 3037-3046 10 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Data Augmentation 100% Diffusion Model 100% Annotation 40% Cost Saving 20% Target Location 20% PROSAC: Provably Safe Certification for Machine Learning Models under Adversarial AttacksFeng, C., Liu, Z., Zhi, Z., Bogunovic, I., Gerner-Beuerle, C. & Rodrigues, M., 28 Feb 2025, The 39th Annual AAAI Conference on Artificial Intelligence: Proceedings. 9 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Risk Population 100% Testing Procedure 49% TFAR: a training-free framework for autonomous reliable reasoning in visual question answeringZhi, Z., Feng, C., Daneshmend, A., Orlu, M., Demosthenous, A., Yin, L., Li, D., Liu, Z. & Rodrigues, M., 28 Aug 2025, 28 p.Research output: Other contribution Open AccessFile Visual Question Answering 100% Multimodal Large Language Models 100% Chain-of-Thought 66% Annotation 33% Enhance Performance 16% 48 Downloads (Pure) Unveiling open-set noise: theoretical insights into label noiseFeng, C., Sebe, N., Tzimiropoulos, G., Rodrigues, M. & Patras, I., 27 Oct 2025, Proceedings of the 33rd ACM International Conference on Multimedia (MM ’25). Association for Computing Machinery, p. 3290-3299 10 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Potential Solution 100% Detection Method 100% Classification Accuracy 100% Out-of-Distribution Detection 100% Stronger Semantics 100% 1 Downloads (Pure) CLIPCleaner: cleaning noisy labels with CLIPFeng, C., Tzimiropoulos, G. & Patras, I., 28 Oct 2024, MM '24: Proceedings of the 32nd ACM International Conference on Multimedia. Association for Computing Machinery, p. 876 - 885 Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Learning Community 100% Confirmation Bias 100% CLIP 100% Zero-Shot Learning 33% 6 Citations (Scopus) View all 11 research outputs Prizes EU Horizon (AI4Media) Junior Exchange FellowshipFeng, C. (Recipient), 2023Prize: Fellowship awarded competitively ICML‘22 Outstanding ReviewerFeng, C. (Recipient), 2022Prize: Prize (including medals and awards) Activities Activities per year 2022 2024 2025 6 Publication peer-review 1 Participation in workshop, seminar, course Activities per year BMVA Symposium on AI SecurityFeng, C. (Chair)16 Jul 2025Activity: Participating in or organising an event types › Participation in workshop, seminar, course International Journal of Computer Vision (Journal)Feng, C. (Peer reviewer)2024 → …Activity: Publication peer-review and editorial work types › Publication peer-review Image and Vision Computing (Journal)Feng, C. (Peer reviewer)2024 → …Activity: Publication peer-review and editorial work types › Publication peer-review IEEE Transactions on Circuits and Systems for Video Technology (Journal)Feng, C. (Peer reviewer)2024 → …Activity: Publication peer-review and editorial work types › Publication peer-review IEEE Transactions on Pattern Analysis and Machine Intelligence (Journal)Feng, C. (Peer reviewer)2024 → …Activity: Publication peer-review and editorial work types › Publication peer-review View all 7 activities",
  "content_length": 6042,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:47"
}