{
  "name": "Cheng Yang 0002",
  "homepage": "http://nlp.csai.tsinghua.edu.cn/~yangcheng",
  "status": "success",
  "content": "Cheng Yang's Homepage Cheng Yang Assistant Professor Data Mining and Machine Learning Group (DMGroup), School of Computer Science, Beijing University of Posts and Telecommunications, Beijing, China. Email: albertyang33 [at] gmail.com Research Interests: social computing, network representation learning Education and Experience | Publications Publications [Google Scholar] Invited Talks I gave an introduction about \"Graph Neural Networks based NLP Applications\" (in Chinese) at SMP 2019 conference [slides][review paper]. Thesis I passed my thesis defense on May 30th, 2019. Here's my thesis paper (in Chinese). Journal and Conference Papers 2019 Cheng Yang, Maosong Sun, Haoran Liu, Shiyi Han, Zhiyuan Liu, Huanbo Luan. Neural Diffusion Model for Microscopic Cascade Study. IEEE Transactions on Knowledge and Data Engineering (IEEE TKDE), 2019 [pdf][codes]. Cheng Yang, Jian Tang, Maosong Sun , Ganqu Cui, Zhiyuan Liu. Multi-scale Information Diffusion Prediction with Reinforced Recurrent Networks. International Joint Conference on Artificial Intelligence (IJCAI 2019). International Joint Conference on Artificial Intelligence (IJCAI 2019)[pdf][codes]. Huimin Chen, Xiaoyuan Yi, Wenhao Li, Cheng Yang, Zhipeng Guo, Maosong Sun. Sentiment-Controllable Chinese Poetry Generation. International Joint Conference on Artificial Intelligence (IJCAI 2019)[pdf]. Jie Zhou, Xu Han, Cheng Yang, Zhiyuan Liu, Lifeng Wang, Changcheng Li, Maosong Sun. GEAR: Graph-based Evidence Aggregating and Reasoning for Fact Verification. The 57th Annual Meeting of the Association for Computational Linguistics (ACL 2019)[pdf]. Zhipeng Guo, Xiaoyuan Yi, Maosong Sun, Wenhao Li, Cheng Yang, Jiannan Liang, Huimin Chen, Yuhui Zhang, Ruoyu Li. Jiuge: A Human-Machine Collaborative Chinese Classical Poetry. The Annual Meeting of the Association for Computational Linguistics (ACL 2019)[pdf]. 2018 Cheng Yang, Maosong Sun, Xiaoyuan Yi, Wenhao Li. Stylistic Chinese Poetry Generation via Unsupervised Style Disentanglement. Conference on Empirical Methods in Natural Language Processing (EMNLP 2018)[pdf]. Ayana, Shiqi Shen, Yun Chen, Cheng Yang, Zhiyuan Liu, Maosong Sun. Zero-shot Cross-Lingual Neural Headline Generation. IEEE Transactions on Audio, Speech and Language Processing (IEEE TASLP). Xiangkai Zeng, Cheng Yang, Cunchao Tu, Zhiyuan Liu, Maosong Sun. Chinese LIWC Lexicon Expansion via Hierarchical Classification of Word Embeddings with Sememe Attention. Association for the Advancement of Artificial Intelligence (AAAI 2018)[pdf][codes]. 2017 Cheng Yang, Maosong Sun, Zhiyuan Liu, Cunchao Tu. Fast Network Embedding Enhancement via High Order Proximity Approximation. International Joint Conference on Artificial Intelligence (IJCAI 2017)[pdf][codes]. Cheng Yang, Maosong Sun, Wayne Xin Zhao, Zhiyuan Liu, Edward Chang. A Neural Network Approach to Joint Modeling Social Networks and Mobile Trajectories. ACM Transactions on Information Systems (ACM TOIS)[pdf]. Cunchao Tu*, Cheng Yang*, Zhiyuan Liu, Maosong Sun. Network representation learning: an overview. SCIENTIA SINICA Informationis 47 (8), 980-996[html] (* indicates equal contribution). 2016 Wei Chen*, Tian Lin*, Cheng Yang*. Real-time Topic-aware Influence Maximization Using Preprocessing. Computational Social Networks Vol. 3 (1), 8. [pdf] (* indicates equal contribution) 2015 Cheng Yang, Zhiyuan Liu, Deli Zhao, Maosong Sun, Edward Chang. Network Representation Learning with Rich Text Information. International Joint Conference on Artificial Intelligence (IJCAI 2015)[pdf][codes] Education and Experience Aug, 2014 - Jul, 2019. Ph.D, Dept. of Computer Science and Technology, Tsinghua University, Beijing. Supervised by Prof. Maosong Sun. Sep, 2010 - Jul, 2014. Undergraduate, Institute for Interdisciplinary Information Sciences, Tsinghua University, Beijing. (Yao Class) Sep, 2007 - Jul, 2010. Tianjin Nankai Middle School, Tianjin. Internship Mar, 2014 - May, 2016. HTC Beijing Research. July, 2013 - Feb, 2014. Microsoft Research Asia.",
  "content_length": 3998,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:53"
}