{
  "name": "Chenguang Wang 0001",
  "homepage": "https://cgraywang.github.io",
  "status": "success",
  "content": "Chenguang Wang Chenguang Wang Follow Email LinkedIn Github Google Scholar I am an Assistant Professor in the Department of Computer Science and Engineering at UC Santa Cruz. I am also an affiliate faculty of the UCSC NLP Group and the Generative AI Center.Previously, I was an assistant professor in the CSE department at WashU and a postdoc in computer science at UC Berkeley. I was also a research scientist at Amazon AI and a research staff member at IBM Research-Almaden. I completed my Ph.D. at Peking University, and was a visiting Ph.D. student at UIUC.Research Interests: Natural language processing, machine learning, and security.Prospective Postdocs and Students: We are recruiting both postdocs and PhD students. If you are interested in applying for a position, please fill out the form here and then send an email to chenguangwang.job@gmail.com with the subject line: [postdoc/PhD/master/undergraduate/visiting] - Your School - Name. For PhD interest, please also apply through the CSE PhD program and mention my name in your application.Selected AwardsGoogle Research Scholar AwardX-Camp Academy Research AwardACM China Doctoral Dissertation Award Honorable Mention (one of two national finalists)Qualcomm Fellowship Honorable MentionBaidu Fellowship Honorable Mention (one of the twenty worldwide finalists)Sohu FellowshipProjectsAdvisor, rLLM, reinforcement learning for language agentsAdvisor, MassGen, multi-agent scaling system for GenAICreator, AutoGluon, an AutoML toolkit for deep learningCo-creator, GluonNLP, a deep learning for NLP toolkitNewsNov, 2025: I will serve as Area Chair for ICML 2026.Nov, 2025: 2 papers are accepted to NeurIPS 2025 ResponsibleFM workshop.Oct, 2025: We released multiple preprints/blog on test-time scaling, LLM interpretability, agent posttraining, and scaling law.Oct, 2025: I will serve as Area Chair for ARR.Oct, 2025: Presented briefly on MassGen and rLLM at SF Tech Week.Sep, 2025: Our lab has moved to UCSC.Sep, 2025: 2 papers are accepted to NeurIPS 2025 workshops.Sep, 2025: 1 paper is accepted to NeurIPS 2025.Sep, 2025: We released 2 preprints on LLM interpretability.Aug, 2025: 1 paper is accepted to EMNLP 2025.Jul, 2025: I will serve as Senior Program Committee for AAAI 2026.Jul, 2025: We released a blog on posttraining agents.Jun, 2025: 3 papers are accepted to ACL 2025 workshop.Jun, 2025: I will serve as a panelist for NSF.May, 2025: 1 paper is accepted to ACL 2025.May, 2025: We released a preprint on redteaming AI agents.Mar, 2025: Congrats Sam Pan on receiving CSE Research Excellence Award.Feb, 2025: I will serve as Area Chair for ACL 2025.Jan, 2025: We released a preprint on Humanity’s Last Exam covered by The New York Times and Reuters.Jan, 2025: JudgeBench is accepted to ICLR 2025.Dec, 2024: Congrats to Sizhe and Zaid on their successful defenses!Nov, 2024: We released a preprint on language instruction tuning for MLLMs.Nov, 2024: Invited talks at Google DeepMind and Adobe.Nov, 2024: Glad to receive the X-Camp Academy Research Award.Oct, 2024: We released a preprint on evaluating LLM-based judges.Oct, 2024: Invited talk at Department of Genetics of Washington University School of Medicine.Sep, 2024: Our research is the top story in WashU Record! Congrats to Nick and Kyle.Sep, 2024: One paper is accepted to IEEE S&P 2025. [Paper]Sep, 2024: Our research was covered by WashU RECORD.Aug, 2024: Re-Tuning is out! [Paper] [Code] [Slides] [Poster].May, 2024: Social is now released! [Paper] [Dataset] [Code] [Slides] [Poster].May, 2024: Re-Tuning is accepted to ACL 2024.May, 2024: AgentInstruct is accepted to ICML 2024.Apr, 2024: Take a look at the recent interview with MIT Technology Review China (DeepTech) talking about our recent research on STEM and others [Orginally in Chinese] [Google Translate]!Apr, 2024: Congrats to Kyle on his successful defense!Apr, 2024: STEM is now released, try it out to understand your foundation models better! [Paper] [Leaderboard] [Dataset] [Code] [Slides] [Poster].Apr, 2024: Congrats to David on receiving WashU Summer Undergraduate Research Award!Apr, 2024: Thrilled to receive the Google Research Scholar Award!Apr, 2024: Social paper is out. Stay tuned for our code and datasets!Apr, 2024: Congrats to David and Josh on receiving WashU CSE Awards!Mar, 2024: \"Enhancing Global Estimation of Fine Particulate Matter Concentrations by Including Geophysical a Priori Information in Deep Learning\" is accepted to ACS ES&T Air 2024.Mar, 2024: RoZ benchmark is accepted to CVPR 2024 workshop.Mar, 2024: \"Measuring Social Norms of Large Language Models\" is accepted to NAACL 2024.Mar, 2024: \"Benchmarking Zero-Shot Robustness of Multimodal Foundation Models: A Pilot Study\" is released. 📃 [Paper] 💻 [Github].Mar, 2024: \"Agent Instructs Large Language Models to be General Zero-Shot Reasoners\" is accepted to ICLR 2024 workshop.Mar, 2024: \"Evaluating Large Language Models in an Emerging Domain: A Pilot Study in Decentralized Finance\" is accepted to ICLR 2024 workshop.Feb, 2024: STEM paper is out. Stay tuned for our code and datasets release!Feb, 2024: \"Preference Poisoning Attacks on Reward Model Learning\" is released.Jan, 2024: \"Measuring Vision-Language STEM Skills of Neural Models\" is accepted to ICLR 2024.Nov, 2023: AgentInstruct code is out! 📃 [Paper] 💻 [Github] 🤗 [HuggingFace] 📌 [Blog] 📽 [Slides] 📋 [Poster].Oct, 2023: \"Agent Instructs Large Language Models to be General Zero-Shot Reasoners\" is released.Sep, 2023: I will serve as PC for ICLR 2024.Jul, 2023: \"Practical Membership Inference Attacks Against Large-Scale Multi-Modal Models: A Pilot Study\" is accepted to ICCV 2023.Apr, 2023: \"CodeIPPrompt: Intellectual Property Infringement Assessment of Code Language Models\" is accepted to ICML 2023.Oct, 2022: 4 papers are accepted to EMNLP 2022.Oct, 2022: The WashU NLP Group is launched.Preprints rLLM v0.2: RL Training over General Agentic ProgramsSijun Tan, Kyle Montgomery, the rLLM Team.In rLLM blog 2025.paper code linkedin x rLLM: A Framework for Post-Training Language AgentsSijun Tan, Michael Luo, Colin Cai, Tarun Venkat, Kyle Montgomery, Aaron Hao, Tianhao Wu, Arnav Balyan, Manan Roongta, Chenguang Wang, Li Erran Li, Raluca Ada Popa, Ion Stoica.In Notion 2025.paper code x Humanity’s Last ExamLong Phan, Wenjin Zhang, Nick Crispino, Chenguang Wang, Daofeng Li, Jiawei Shen, Kyle Montgomery, Hannah Szlyk, Ting Wang, Summer Yue, Alexandr Wang, Dan Hendrycks, many others.In arXiv preprint 2025.paper code data news Publications VMDT: Decoding the Trustworthiness of Video Foundation ModelsYujin Potter, Zhun Wang, Nicholas Crispino, Kyle Montgomery, Alexander Xiong, Ethan Y. Chang, Francesco Pinto, Yuqi Chen, Rahul Gupta, Morteza Ziyadi, Christos Christodoulopoulos, Bo Li, Chenguang Wang, Dawn Song.In The Annual Conference on Neural Information Processing Systems (NeurIPS 2025).paper Budget-aware Test-time Scaling via Discriminative VerificationKyle Montgomery, Sijun Tan, Yuqi Chen, Siyuan Zhuang, Tianjun Zhang, Raluca Ada Popa, Chenguang Wang.In The Annual Conference on Neural Information Processing Systems (NeurIPS 2025 Workshop on Efficient Reasoning).paper code huggingface linkedin x blog SteeringSafety: A Systematic Safety Evaluation Framework of Representation Steering in LLMsVincent Siu, Nicholas Crispino, David Park, Nathan W Henry, Zhun Wang, Yang Liu, Dawn Song, Chenguang Wang.In The Annual Conference on Neural Information Processing Systems (NeurIPS 2025 Workshop on Socially Responsible and Trustworthy Foundation Models).paper code huggingface linkedin x LLM CHESS: Benchmarking Reasoning and Instruction-Following in LLMs through ChessSai Kolasani, Maxim Saplin, Nicholas Crispino, Kyle Montgomery, Jared Quincy Davis, Matei Zaharia, Chi Wang, Chenguang Wang.In The Annual Conference on Neural Information Processing Systems (NeurIPS 2025 Workshop on Foundations of Reasoning).paper leaderboard code blog RepIt: Steering Language Models with Concept-Specific Refusal VectorsVincent Siu, Nathan W Henry, Nicholas Crispino, Yang Liu, Dawn Song, Chenguang Wang.In The Annual Conference on Neural Information Processing Systems (NeurIPS 2025 Workshop on Socially Responsible and Trustworthy Foundation Models).paper code AGENTVIGIL: Generic Black-Box Red-teaming for Indirect Prompt Injection against LLM AgentsZhun Wang, Vincent Siu, Zhe Ye, Tianneng Shi, Yuzhou Nie, Xuandong Zhao, Chenguang Wang, Wenbo Guo, Dawn Song.In Proc. 2025 Conf. on Empirical Methods on Natural Language Processing (EMNLP 2025).paper COSMIC: Generalized Refusal Direction Identification in LLM ActivationsVincent Siu, Nicholas Crispino, Zihao Yu, Sam Pan, Zhun Wang, Yang Liu, Dawn Song, Chenguang Wang.In The Annual Meeting of the Association for Computational Linguistics (ACL 2025).paper code x Predicting Task Performance with Context-aware Scaling LawsKyle Montgomery, David Park, Jianhong Tu, Michael Bendersky, Beliz Gunel, Dawn Song, Chenguang Wang.In The Annual Meeting of the Association for Computational Linguistics (ACL 2025 Workshop on Towards Knowledgeable Foundation Models).paper code huggingface x MLAN: Language-Based Instruction Tuning Improves Zero-Shot Generalization of Multimodal Large Language ModelsJianhong Tu*, Zhuohao Ni*, Nicholas Crispino, Zihao Yu, Michael Bendersky, Beliz Gunel, Ruoxi Jia, Xin Liu, Lingjuan Lyu, Dawn Song, Chenguang Wang.In The Annual Meeting of the Association for Computational Linguistics (ACL 2025 Workshop on Towards Knowledgeable Foundation Models).paper code huggingface x JudgeBench: A Benchmark for Evaluating LLM-based JudgesSijun Tan*, Siyuan Zhuang*, Kyle Montgomery*, William Y. Tang, Alejandro Cuadron, Chenguang Wang, Raluca Ada Popa, Ion Stoica.In The International Conf. on Learning Representations (ICLR 2025).paper leaderboard code data x Preference Poisoning Attacks on Reward Model LearningJunlin Wu, Jiongxiao Wang, Chaowei Xiao, Chenguang Wang, Ning Zhang, Yevgeniy Vorobeychik.In IEEE Symposium on Security and Privacy (IEEE S&P 2025).paper Re-Tuning: Overcomin",
  "content_length": 20718,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:58"
}