{
  "name": "Cheng Zhang 0017",
  "homepage": "https://cs.pku.edu.cn/info/1233/2050.htm",
  "status": "success",
  "content": "ï»¿ Zhang, Cheng-åäº¬å¤§å­¦è®¡ç®æºå­¦é¢ Peking University | Meeting Room Reservation | ä¸­æ Current Location: Home Â» People Â» Faculty Â» By Last Name Â» Z Â» Content People Academician Faculty Research Scientist POSTDOC STAFF People Academician Faculty Research Scientist POSTDOC STAFF Z Zhang, Cheng Title:Associate Professor with Tenure Institute:Institute of Software Research Interests:Molecular computing and programming, nano information processing, molecular design and engineering E-mail:zhangcheng369pku.edu.cn Zhang, Cheng is an associate professor with Tenure in the School of Computer Science, Peking University. He obtained his B.Sc. from Shannxi Normal University in 2003 and Ph.D in 2010 in Peking university. In 2010 and 2014, he worked at Purdue university and Arizona state university respectively for more than 1 year as a visiting researcher. In recent years, he focused on the frontier area of molecular computing and programming, nano information processing, molecular design and engineering, and nano information processing. The goal of his research is utilizing molecular programming and computing to systematically manipulate the matter at the molecular scale, for applications in nano-computing, nano-engineering, nanotechnology and biomedicine. For instance, design and establish molecular logic circuits, chemical reaction networks for computation and DNA origami based nano-devices. As the first author and corresponding author, Dr. Zhang published over 30 high quality research papers in top journals, such as Nano Letters (IF: 13.8), ACS Appl. Mater. Interfaces (IF: 7.1), Chemical Communications (IF: 6.6), Analytical Chemistry (IF: 5.9), Langmuir (IF: 4.0), Information Science (IF: 3.4), Applied Physics Letters (IF: 3.1), Journal of Colloid and Interface Science (IF: 3.8), Current Nanoscience, Science in China F, Science in China C, Chinese Science Bulletin, Chinese Journal of Computers. The total SCI citations of him are 141 (2017, from researchgate). He has served in various international conferences including DNA16, DNA23, BIC-ta (2008-2014). Moreover, He was awarded Natural Science Award of the Ministry of Education in China in 2013. Dr. Zhang is supported by more than ten research projects from National Natural Science Foundation of China, Force Office of Scientific Research foundation, China Postdoctoral Science Foundation etc. His main interests are in Molecular Computing and Programming, Nano Information Processing, Molecular Design and Engineering. (1) Control DNA Self-Assembly by Logic Computation A major goal of DNA-based programming and computing is to logically control DNA self-assembly processes, which could fifacilitate the hierarchical engineering of complex nanosystems. In 2015, Dr. Zhang proposed a logic gate system for nanopattern engineering. This method is, for the first time, to enable transduction of the structural change information into detectable optical signals. The study was published in the top journal Nano Letters (2015, IF: 13.8). It is demonstrated that the approach here can be used to program cascading DNA logic operations and achieve complex nano-information delivery. (2) Sequential DNA Logic Computation Most of previous DNA logic computing models have been based on combinational logic operations. However, the real gene networks may be transcribed sequentially in specific chronological sequences. Therefore, it is advantageous to develop a DNA sequential logic computation to detect the gene circuits. In 2016, Dr. Zhang developed a âloop-openâ logic gate, in which the âsequential effectsâ were recognized by comparing specific output signals. This is, for the first time, to perform sequential DNA logic operation in biochemistry experiment. The resulting sequential logic gate will have further potential applications in the fields of molecular programming, natural computation and gene analysis. (3) Logically Programming Gold Nanoparticle Assembly In molecular computing and programming, it is essential that a precise number and kind of DNA strands per AuNP should be selectively controlled. In 2013, Dr. Zhang proposed a new method to program gold nanoparticles assembly in a logic operation way. By designing unique DNA recognizing interactions and logic operations, complex AuNPs clusters with well-defined arrangements were produced. This method has been recently employed in the work of Edwardson et al. and cited in Nature Chemistry (2016). It is expected that the strategy could be extended to establish programmable nanostructures, complex DNA computing circuits and spatial logics, which may lead to a current interest in system biology and stochastic systems.",
  "content_length": 4692,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:53"
}