{
  "name": "Chenhan Xu",
  "homepage": "https://chenhanxu.github.io",
  "status": "success",
  "content": "Chenhan Xu (许陈汉) Home News Publication Teaching SSCS Lab Chenhan Xu Assistant Professor Department of Computer Science North Carolina State University 2268 Engineering Building II, Raleigh, NC 27606 chenhanxu (AT) ncsu (DOT) edu Google Scholar 「君子不器」 — Confucius (551 BC - 479 BC) Openings I am actively looking for self-motivated Ph.D. students/interns to work on Wireless and Mobile Sensing. Feel free to send me an email with your CV. Dr. Chenhan Xu is an Assistant Professor of Department of Computer Science in the North Carolina State University. His research focuses on the convergence of Internet of Things (IoT), Physiological Science, and Smart Health. Chenhan is the receipient of Best Student Paper Award at ICHI 2022, Best Paper Award at MobiSys 2020, Best Paper Award at SenSys 2019, Best Paper Award at ICC 2019, Best Paper Award at GlobeCom 2016, and Best Paper Nominee at ACM SenSys 2022. Chenhan and his group explore advanced embedded sensing and computing systems to enable high-impact real-world IoT applications. The research involves pioneering advancements in sensing and computing system paradigm, data analytics, signal processing, algorithm, and hardware innovations for Internet of Human-Centric Things by Precision Sensing that arguments IoT “resolution”: exploring new wireless and wearable sensing technologies to precisely, securely, and robustly interrogate human physiological information, including noise-immune voice tone [MobiSys'19] and resilient voice biometrics [SenSys'20] , fine-grained heart activities [UbiComp'21] , anti-spoofing fingerprint [NDSS’22] and wearable fine-grained finger tracking [CHI'23] , and authentic body inertia [ICHI’22] . Novel Human-IoT Interface that enables extra “bandwidth”: investigating new interfaces between human and IoT through broad-spectrum wireless modalities of human physiological activities (e.g., IoT-heart interface via voice [SenSys'22] and mmWave [UbiComp'21] ). Pervasive and Privary-preserving mobile health that have extended “coverage”: exploring effortless, accurate, and secure health monitoring and disease prevention through IoT devices and facilities, including passive medication adherence management of Parkinson’s disease (PD) [UbiComp'19] and privacy-preserving early detection of PD [MobiCom'19] . News Award Our work on RF-based wound sensing instrument is selected as the Best Paper Candidate in International Workshop on Human-Centered Sensing, Modeling, and Intelligent Systems (HumanSys'25). Congrats to the team! (2025/05) Service We are organizing the Sensing and Computing for Smart and Connected Health workshop in conjunction with IEEE/ACM CHASE 2025. Please consider submitting your work! (2024/12) Grant We got seed funding from N.C. PSI to support our project on improving labor efficiency in horticultural crop production. (2024/12) Service Chenhan serves as an Associate Editor of Elsevier Smart Health Journal. (2024/11) Service Chenhan serves as a Technical Program Committee Member of SenSys'25. (2024/11) Publication One papge is accepted by IEEE Journal on Selected Areas in Communications (JSAC). (2024/11) Grant We got an Educational and Technology Fund from NCSU to support our wireless sensing project. (2024/10) Activity Chenhan completed the NIH mHealth Training Institute (mHTI) at UCLA. (2024/08) More News Selected Publications Chenhan Xu, Bing Zhou, Gurunandan Krishnan, Shree Nayar, “AO-Finger: Hands-free Fine-grained Finger Gesture Recognition via Acoustic-Optic Sensor Fusing”, Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems (CHI'23), Hamburg, Germany, Apr. 2023. ( Acceptace rate: 28.39%, 880 out of 3182 ) PDF Chenhan Xu, Tianyu Chen*, Huining Li, Alexander Gherardi*, Michelle Weng*, Zhengxiong Li, Wenyao Xu, “Hearing Heartbeat from Voice: Towards Next Generation Voice-User Interfaces with Cardiac Sensing Function”, ACM Conference on Embedded Networked Sensor Systems (SenSys'22), Boston, MA, Nov. 2022. ( Acceptance Rate: 24.8%, 52 out of 209 , Best Paper Award Candidate, 7 out of 209 ) PDF Chenhan Xu, Huining Li, Zhengxiong Li, Xingyu Chen*, Aditya Singh Rathore, Hanbin Zhang, Kun Wang, Wenyao Xu, “The Visual Accelerometer: A High-fidelity Optic-to-Inertial Transformation Framework for Wearable Health Computing”, IEEE International Conference on Health Informatics (ICHI'22), Rochester, MN, June 2022. ( Best Student Paper Award, 2 out of 109 ) PDF Chenhan Xu, Huining Li, Zhengxiong Li, Hanbin Zhang, Aditya Singh Rathore, Xingyu Chen, Kun Wang, Ming-Chun Huang, Wenyao Xu, “CardiacWave: A mmWave-based Scheme of Non-Contact and High-Definition Heart Activity Computing”, Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (UbiComp/IMWUT'21), Volume 5, Issue 3, Sept. 2021, Pages 1 - 26. ( R1 Initial Acceptance Rate in May: 2.14%, 3 out of 140, overall AR: 25% ) PDF Huining Li, Chenhan Xu, Aditya Singh Rathore, Zhengxiong Li, Hanbin Zhang, Chen Song, Kun Wang, Lu Su, Feng Lin, Kui Ren, Wenyao Xu, “VocalPrint: Exploring A Resilient and Secure Voice Authentication via mmWave Biometric Interrogation”, ACM Conference on Embedded Networked Sensor Systems (SenSys'20), Yokohama, Japan, Nov. 2020. ( Acceptance Rate: 20.6%, 44 out of 213 ) PDF Chenhan Xu, Zhengxiong Li, Hanbin Zhang, Aditya Singh Rathore, Huining Li, Chen Song, Kun Wang, Wenyao Xu, “WaveEar: Exploring a mmWave-based Noise-resistant Speech Sensing for Voice-User Interface”, ACM International Conference on Mobile Systems, Applications, and Services (MobiSys'19), Seoul, South Korea, June 2019. ( Acceptance Rate: 23.2%, 40 out of 172 ) PDF All Publications Professional Activities Program Committee ACM Conference on Embedded Networked Sensor Systems (SenSys) [2025] International Conference on Computer Communications and Networks (ICCCN) [2024] IEEE International Performance Computing and Communications Conference (IPCCC) [2023] IEEE-EMBS International Conference on Body Sensor Networks: Sensor and Systems for Digital Health (BSN) [2023, 2024] International Conference on Algorithms and Architectures for Parallel Processing (ICA3PP) [2023] ACM Conference on Embedded Networked Sensor Systems (SenSys) Shadow PC [2022] IEEE International Conference on Communications (ICC) [2018, 2019, 2020] Editorial Board Elsevier Smart Health Journal Reviewer ACM CHI conference on Human Factors in Computing Systems (CHI) Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT) ACM Symposium on User Interface Software and Technology (UIST) ACM Transactions on Design Automation of Electronic Systems (TODAES) Nature Scientific Data ACM Transactions on Sensor Networks (TOSN) ACM Transactions on Mobile Computing (TMC) IEEE Internet of Things Journal (IOTJ) IEEE International Conference on Computer Communications (INFOCOM) IEEE/ACM international conference on Connected Health: Applications, Systems and Engineering Technologies (CHASE) IEEE-EMBS International Conference on Biomedical and Health Informatics (BHI) IEEE Transactions on Services Computing IEEE Transactions on Parallel and Distributed Systems (TPDS) IEEE Communications Magazine IEEE Network Magazine IEEE Transactions on Vehicular Technology (TVT) IEEE Transactions on Emerging Topics in Computing International Conference on Wireless Communications and Signal Processing",
  "content_length": 7354,
  "method": "requests",
  "crawl_time": "2025-12-01 12:50:59"
}