{
  "name": "Cheryl Pope",
  "homepage": "http://www.adelaide.edu.au/directory/cheryl.pope",
  "status": "success",
  "content": "Staff Directory | Dr Cheryl Pope × Search University staff directory Login Dr Cheryl Pope Position Senior Lecturer Org Unit Computer Science Email cheryl@cs.adelaide.edu.au Telephone 831 35833 Location Floor/Room 4 , Ingkarni Wardli , North Terrace View My Researcher Profile Biography/ Background 1997-present Lecturer, School of Computer Science, University of Adelaide 1996-2001 Director, Centre for Computer Systems and Software Engineering 1993 Software Engineer, Defence Science and Technology Organisation 1989-1992 Computer Systems Engineer, Rome Laboratory Qualifications PhD (Engineering), School of Computer Science, University of Adelaide B.Sc. (Computer Science and Engineering), Massachusetts Institute of Technology (MIT) Graduate Certificate in Higher Education (Online Learning) CCNA Awards & Achievements 2008 Executive Dean's Award for Excellence in Teaching 2008 Faculty Award for Excellence in Teaching Teaching Interests I teach a range of courses and levels within Computer Science with a focus on Computer Networks. Research Interests I am a member of the ACROSS research group.  My research interests are in performance affects of misbehaviour (malicious or unintentional) in mobile ad-hoc networks, efficient routing algorithms in wireless networks (sensor and ad-hoc), the use of sensor and ad-hoc networks in supporting emergency services, QoS support for IP based networks, real-time scheduling theory, real-time communication in WANs especially multi-media, fault-tolerance for real-time systems and Internet protocols. I am also interested in educational research related to pedagogy, Computer Science curriculum (particularly in the area of computer networks), and the use of online technology to support student learning. The information in this directory is provided to support the academic, administrative and business activities of the University of Adelaide. To facilitate these activities, entries in the University Phone Directory are not limited to University employees. The use of information provided here for any other purpose, including the sending of unsolicited commercial material via email or any other electronic format, is strictly prohibited. The University reserves the right to recover all costs incurred in the event of breach of this policy. Entry last updated: Thursday, 15 Dec 2022 To link to this page, please use the following URL: https://www.adelaide.edu.au/directory/cheryl.pope",
  "content_length": 2440,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:07"
}