{
  "name": "Cherif Salama",
  "homepage": "https://www.aucegypt.edu/fac/cherif",
  "status": "success",
  "content": "Cherif Salama | The American University in Cairo Skip to main content Cherif Salama Position: Associate Professor and Associate Chair Department: Department of Computer Science and Engineering Email: cherif.salama@aucegypt.edu Brief Biography Cherif Salama joined the Department of Computer Science and Engineering at The American University in Cairo (AUC) as an assistant professor in the fall 2018 semester. He received his BSc and MSc degrees in electrical engineering from the computer and systems engineering department of Ain Shams University in 2001 and 2006 respectively. He received his PhD degree in computer science from Rice University, Houston, Texas in 2010.From 2001 to 2006, Salama worked as a teaching and research assistant at Ain Shams University and from 2006 to 2010, he held the same position at Rice University until he was awarded a PhD degree. As a graduate student at Rice University, he was awarded a full fellowship. During his studies in the United States of America, he was the key person in the design and development of the Verilog Preprocessor, which was funded by Intel Corporation through the Semiconductor Research Corporation. He also worked in IBM Austin Research Labs during the same period. Since 2010, he has been an assistant professor in the Computer and Systems Engineering Department of the faculty of engineering of Ain Shams University. Salama has a wide teaching experience delivering several courses in various universities like the Egyptian E-Learning University (EELU), the Misr International University (MIU) and the German University in Cairo (GUC) where he worked for four academic years as a part-time lecturer. He was also appointed as the Unit Head of the Computer Engineering and Software Systems program at Ain Shams University from 2015 to 2018.In addition to his participation in and supervision of various research projects, his research interests and publications span a relatively wide spectrum that includes computer architecture, computer-aided-design, hardware description languages, programming languages, parallel computing, artificial intelligence and more. Research Interest Computer ArchitectureComputer-Aided DesignHardware Description LanguagesProgramming LanguagesGPU ComputingArtificial Intelligence and its applications Education PhD, Computer Science, Rice University, Houston, TX, USA, May 2010MSc, Electrical Engineering, Department of Computer and Systems Engineering, Faculty of Engineering, Ain Shams University, June 2006BSc, Electrical Engineering, Department of Computer and Systems Engineering, Faculty of Engineering, Ain Shams University, June 2001",
  "content_length": 2637,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:04"
}