{
  "name": "Chester Rebeiro",
  "homepage": "http://www.cse.iitm.ac.in/~chester",
  "status": "success",
  "content": "Chester Rebeiro's Home Page Chester Rebeiro Associate Professor Department of Computer Science and Engineering Indian Institute of Technology Madras chester[at]cse.iitm.ac.in www.cse.iitm.ac.in/~chester Research Interests hardware security, applied cryptography, side channel analysis , operating system security, Select Recent Publications Books Timing Channels in Cryptography (Springer) [link] Journals TESLA: Trusted Execution Support for Legacy Applications (IACR TCHES, 2025) [link] Systematic Analysis of Moving Target Defenses for Branch Prediction Attacks (IEEE TDSC 2025) [link] SUNDEW: A Case-Sensitive Detection Engine to Counter Malware Diversity (IEEE TDSC 2024) [link] FortiFix: A Fault Attack Aware Compiler Framework for Crypto Implementations (ACM TODAES 2024) [link] PROMISE: A Programmable Hardware Monitor for Secure Execution in Zero Trust Networks (IEEE Embedded Systems Letters, 2024) [link] FaultMeter: Quantitative Fault Attack Assessment of Block Cipher Software (IACR TCHES, 2023) [link] SIGNED: A Challenge-Response Scheme for Electronic Hardware Watermarking (IEEE TComp, 2022) [link] A Formal Analysis of Prefetching in Profiled Cache-Timing Attacks on Block Ciphers (Journal of Cryptology, 2021) [link] PERI: a Posit enabled RISC-V core (ACM TACO, 2021) [link] FEDS: Comprehensive Fault Attack Exploitability Detection for Software Implementations of Block Ciphers (IACR TCHES, 2020) [link] BRUTUS: Refuting the Security Claims of the Cache Timing Randomization Countermeasure proposed in CEASER (IEEE Computer Architecture Letters, 2020) [link] Conferences Valkyrie: A Response Framework to Augment Runtime Detection of Time-Progressive Attacks (DSN, 2025) [link] GLiTCH : GLiTCH induced Transitions for Secure Crypto-Hardware (DAC, 2025) [link] WhisperFuzz: White-Box Fuzzing for Detecting and Locating Timing Vulnerabilities in Processors (USENIX Security, 2024) [link] (Distinguished Paper Award) Kryptonite: Worst-Case Program Interference Estimation on Multi-Core Embedded Systems (EMSOFT, 2023) [link] YODA: Covert Communication Channel over Public DNS Resolvers (DSN, 2023) [link] Timed Speculative Attacks exploiting Store to Load Forwarding bypassing Cache-based Countermeasures [link] (DAC, 2022) FORTIFY: Analytical Pre-Silicon Side-Channel Characterization of Digital Designs (IEEE ASPDAC 2022) [link] PARAM: A Microprocessor Hardened for Power Side-Channel Attack Resistance (IEEE HOST, 2020) [link] (Best Paper Award) SOLOMON: An Automated Framework for Detecting Fault Attack Vulnerabilities in Hardware (DATE, 2020) [link] D-TIME: Distributed Threadless Independent Malware Execution for Runtime Obfuscation (WOOT@USENIX Security 2019) [link] Karna: A Gate-Sizing based Security aware EDA Flow for Improved Power Side-Channel Attack Protection (ICCAD 2019) [link] dblp, Google Scholar Teaching Operating Systems (CS3500) (Aug-Nov 2025) Secure Systems Engineering (CS65700) (Jan-Apr 2025) Secure Processor Microarchitecture (CS6630) (Aug-Nov 2024) Computer Organization and Architecture and Lab (CS2600 and CS2610) (Jan-May 2024) full list Students PostDocs Deepanjali S. Annapurna Valiveti Aditi Roy PhD Reetwik Das Sai Venkata Krishnan (co-guided Dr. KC Sivaramakrishnan) Saltanat Firdous Pallavi Borkar Raghavendra Patil (External) (co-guided with Dr. Santanu Sarkar) Abdun Nihaal (co-guided by Dr. Madhu Mutyam) Rohin Menon (co-guided by Dr. Janakiraman V) Akshay Kumar MS by Research Mahesh G Ritwik Badola Samyuktha M. Rohit Srinivas R G Meishty Pande Karthikeyan R. Arpit Goyal alumni Professional Activities Editorial Journal of Hardware and Systems Security (HASS), Springer (Associate Editor 2021-2024) Conferences/Workshops Conducted ATS 2024 (Program CoChair) SPACE 2024 (General CoChair) INDOCRYPT 2023 (Program CoChair) Organizer e-CTF Embedded Capture The Flag NPTEL+ Online Workshop[, Theory and Practice of Side Channel Attacks in Cryptography, July 2022 previous committees Invited Talks, Posters, and Workshops Downloads AES SBox Composite Field Implementations for FPGAs [code] Tools for Automated Fault Attack Evaluation Aleph One's Stack Smashing for Fun and Profit code for Ubuntu 10.04 (32 bit) (download) Elliptic Curve Crypto Processor for FPGA Platforms PSEC-KEM in Hardware and Software Platforms Contact Room Number SSB 303 Department of Computer Science and Engineering Indian Institute of Technology Madras Chennai 600036 Tel : +914422574355",
  "content_length": 4420,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:04"
}