{
  "name": "Chetan Arora 0002",
  "homepage": "https://research.monash.edu/en/persons/chetan-arora",
  "status": "success",
  "content": "Chetan Arora - Monash University View Scopus Profile Chetan Arora Dr Senior Lecturer, Department of Software Systems & CybersecurityImpact Labs https://orcid.org/0000-0003-1466-7386 EmailChetan.Aroramonashedu Accepting PhD StudentsPhD projectsIn Requirements Engineering and Testing of AI Systems 20132025 Research activity per year Personal profile BiographyDr Chetan Arora is a Senior Lecturer in Software Engineering (SE), focusing on applied Artificial Intelligence in SE and other fields. He received his PhD degree from the University of Luxembourg (Luxembourg) with Prof. Lionel Briand, Masters degree in SE from the Technische Universität Kaiserslautern (Germany), and Bachelors in Engineering (CS) degree from Thapar University (India). He is the recipient of the best PhD thesis award in the ICT domain at Uni Luxembourg. Chetan also currently serves as the Director of Education (SSC) at the Faculty of IT at Monash. Prior to joining Monash University, he worked at SES Satellites (Luxembourg) in the department of Innovation Programs on applied AI for IoT and satellite communications (critical infrastructure protection & resilience). He has worked in industry and industry-collaboration research for several years. In his career, he has received above $1.1m in grants as the lead CI. His main areas of research interest are applied AI (ML and NLP), SatCom, and software engineering with an emphasis on requirements management and software trustworthiness. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Master, Technische Universität Kaiserslautern (Technical University of Kaiserslautern)Computer Science, PhD, Université du Luxembourg (University of Luxembourg) Research area keywordsSoftware engineeringRequirements EngineeringSatellite CommunicationSoftware Quality AssuranceInternet of Things (IoT) Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2023 2025 2027 5 Active Projects per year ACM SIGSOFT: ACM SIGSOFT Indian Winter School on AI-Infused Software Engineering (AISE) - Research and PracticeArora, C. (Primary Chief Investigator (PCI)), Tiwari, S. (Chief Investigator (CI)), Rathore, S. S. (Chief Investigator (CI)), Chimalakonda, S. (Chief Investigator (CI)), D'Souza, M. (Chief Investigator (CI)) & Dutta, S. (Chief Investigator (CI))1/08/25 → 31/08/26Project: Research Australian Summer School in Software Engineering (OzSE) 2026Tantithamthavorn, K. (Primary Chief Investigator (PCI)), Arora, C. (Chief Investigator (CI)), Thongtanunam, P. (Chief Investigator (CI)), Bi, T. (Chief Investigator (CI)) & Fu, M. (Chief Investigator (CI))1/07/25 → 31/12/26Project: Research ICT: Integrating Equity, Diversity, and Inclusion (EDI) into ICT Education: A GenAI-Powered Approach to Curriculum DevelopmentCheema, A. (Primary Chief Investigator (PCI)), Cosmos, A. (Chief Investigator (CI)), Arora, C. (Chief Investigator (CI)), Du, G. (Chief Investigator (CI)), Nawaz, S. (Chief Investigator (CI)), Rahayu, D. (Chief Investigator (CI)), Sakzad, A. (Chief Investigator (CI)), Siddiqui, I. F. (Chief Investigator (CI)), Janjua, N. K. (Chief Investigator (CI)), Raza Khan, U. (Chief Investigator (CI)), Shibani, A. (Chief Investigator (CI)), Shah, S. A. A. (Chief Investigator (CI)) & Ulhaq, A. (Chief Investigator (CI))Australian Council of Deans of Information and Communications Technology (ACDICT)15/02/25 → 31/12/25Project: Research CSIRO Next Generation Graduates Program: Automated Testing of Large Language Models (LLMs) in MLOpsTantithamthavorn, K. (Primary Chief Investigator (PCI)), Chua, J. (Chief Investigator (CI)), Yang, R. (Chief Investigator (CI)) & Arora, C. (Chief Investigator (CI))CSIRO - Commonwealth Scientific and Industrial Research Organisation, Transurban Limited (trading as Transurban Linkt)15/04/24 → 15/10/27Project: Research RAISE: RAISE: Creating Responsible AI Software Engineering CapabilityTantithamthavorn, K. (Primary Chief Investigator (PCI)), Grundy, J. (Chief Investigator (CI)), Abdelrazek, M. A. (Chief Investigator (CI)), Thongtanunam, P. (Chief Investigator (CI)), Aleti, A. (Chief Investigator (CI)), Nakisa, B. (Chief Investigator (CI)), Treude, C. (Associate Investigator (AI)), Zahedi, M. (Associate Investigator (AI)), Arora, C. (Associate Investigator (AI)), Hoda, R. (Associate Investigator (AI)), Chen, C. (Associate Investigator (AI)), Chen , J. (Associate Investigator (AI)), Cooray, M. (Associate Investigator (AI)), Bigdeli, A. (Associate Investigator (AI)), Uzunov, A. (Associate Investigator (AI)), Hurse, M. (Associate Investigator (AI)) & Saunders, S. (Associate Investigator (AI))Episoft Pty Ltd, Swordfish Computing Pty Ltd1/01/23 → 31/12/27Project: Research Research output Research output per year 2013 2021 2022 2023 2024 2025 2025 50 Conference Paper 15 Article 3 Review Article 2 Chapter (Book) 2 More 2 Foreword / Postscript Research output per year Research output per year Efficient Shortest Path Computation for Electric Vehicles in Time-Dependent NetworksAlam, F., Shen, B., Cheema, M. A. & Arora, C., 2025, Databases Theory and Applications - 35th Australasian Database Conference, ADC 2024 Gold Coast, QLD, Australia, and Tokyo, Japan, December 16–18, 2024 Proceedings. Chen, T., Cao, Y., Nguyen, Q. V. H. & Nguyen, T. T. (eds.). Singapore Singapore: Springer, p. 195-208 14 p. (Lecture Notes in Computer Science; vol. 15449).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research Enhancing large language models for text-to-testcase generationAlagarsamy, S., Tantithamthavorn, C., Takerngsaksiri, W., Arora, C. & Aleti, A., Dec 2025, In: Journal of Systems and Software. 230, 14 p., 112531.Research output: Contribution to journal › Article › Research › peer-review 2 Citations (Scopus) Fairness Concerns in App Reviews: A Study on AI-Based Mobile AppsRezaei Nasab, A., Dashti, M., Shahin, M., Zahedi, M., Khalajzadeh, H., Arora, C. & Liang, P., 25 Jan 2025, In: ACM Transactions on Software Engineering and Methodology. 34, 2, 30 p., 51.Research output: Contribution to journal › Article › Research › peer-review 4 Citations (Scopus) Foreword to the 2nd Workshop on Multi-disciplinary, Open, and IntegRatEd Requirements Engineering (MO2RE’25)Abualhaija, S., Amyot, D., Arora, C., Ferrari, A., Fucci, D. & Spoletini, P., 2025, 2025 IEEE/ACM Workshop on Multi-disciplinary, Open, and RElevant Requirements Engineering, MO2RE 2025. Abualhaija, S., Amyot, D., Arora, C., Ferrari, A., Fucci, D. & Spoletini, P. (eds.). Piscatraway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, p. VI-VII 2 p.Research output: Chapter in Book/Report/Conference proceeding › Foreword / Postscript › Other Generative Artificial Intelligence for Software Engineering—A Research AgendaNguyen-Duc, A., Cabrero-Daniel, B., Przybylek, A., Arora, C., Khanna, D., Herda, T., Rafiq, U., Melegati, J., Guerra, E., Kemell, K. K., Saari, M., Zhang, Z., Le, H., Quan, T. & Abrahamsson, P., Nov 2025, In: Software - Practice and Experience. 55, 11, p. 1806-1843 38 p.Research output: Contribution to journal › Article › Research › peer-review 2 Citations (Scopus) View all 72 research outputs Prizes ACM SIGSOFT Distinguished Paper Award - 9th IEEE/ACM International Conference on Mobile Software Engineering and Systems (MobileSoft@ICSE'22)Arora, C. (Recipient), 2022Prize: Prize (including medals and awards) Best Computer Science and Communications PhD Thesis at University of LuxembourgArora, C. (Recipient), 2016Prize: Prize (including medals and awards) Best Demo Award - 23rd IEEE International Conference on Mobile Data Management Conference (MDM'22)Arora, C. (Recipient), 2022Prize: Prize (including medals and awards) Best Paper Award at 27th IEEE International Requirements Engineering Conference (RE'19)Arora, C. (Recipient), 2019Prize: Prize (including medals and awards) Best Paper Award at IEEE/ACM 15th International Symposium on Software Engineering for Adaptive and Self-Managing Systems (SEAMS'20)Arora, C. (Recipient), 2020Prize: Prize (including medals and awards) View all 10 prizes Activities Activities per year 2024 2024 2024 1 Membership of an advisory panel/policy group/ board Activities per year International Requirements Engineering Board (IREB) (External organisation)Arora, C. (Member)2024 → …Activity: Industry, Government and Philanthropy Engagement and Partnerships › Membership of an advisory panel/policy group/ board",
  "content_length": 8977,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:05"
}