{
  "name": "Chetan Arora 0001",
  "homepage": "https://www.cse.iitd.ac.in/~chetan",
  "status": "success",
  "content": "Chetan Arora: Home Chetan Arora Indian Institute of Technology Delhi (IIT Delhi) Hauz Khas, New Delhi, INDIA 110016 Office: Room 116, School of Information Technology (SIT) Building E-mail: chetan at cse dot iitd dot ac dot in Phone: +91-11-26591279 Publications My Group I am a Professor in the Department of Computer Science and Engineering at IIT Delhi and a joint faculty with Yardi School of AI and ANSK School of Information Technology. In my lab we are working on the following research topics: Trusworthy AI: We work on making modern computer vision systems using machine learning techniques trustworthy. Specific topics of interest include Adversarial attack and defence techniques, Reliability, and Fairness. Cancer Detection: Computer aided detection models for detecting cancer, and trained on western population are not successful for Indian population. We develop models specifically for Indian population. Our current focus is on automated detection of Breast, and Gall Bladder cancer. Mobility: We work on developing computer vision techniques for driving assistance and autonomous driving systems in the Indian context. The topics of interest include Active Learning, Domain Adaptation, and Domain Generalization. Egocentric Vision: We also work on computer vision applications arising out of body worn egocentric cameras. We are specifically interested in developing techniques to understand the wearer attributes, and his/her social life from daylong egocentric videos. Problems with Social Impact: We also work on solving problems with social impact. The current interests include developing camera based wearable device as mobility assistant for visually impaired, and recovering text from document images in real life scenarios for e-governance. Plaese look at my recent interview with IEEE Signal Processing Society to undertand my current research program and future research directions in more detail. Research Assistant Positions I have few research assistant positions vacant in a couple of projects. Students who have completed their bachelor's degree, or in their final year, and are looking for a one year or longer paid assistant-ship can write to me with their resume, and transcripts. Please note that the positions are for full time only, and you will need to be physically present in the IITD campus for this. You must have a strong understanding of computer vision as well as machine learning for these positions. PhD and MSR Positions I am looking for technically strong, and committed students interested to do a PhD or MSR in computer vision and machine learning, in any of the topics listed above. Interested students may look at my publications page to get a glimpse of my past work, or Google Scholar page (more frequently updated) for our recent work. For IIT Delhi Undergraduate Students IIT Delhi students with a 8+ CGPA may contact me for a minor project, BTP or an MTP. I do not work with IIT students without a credited course. I will be offering following projects for second semester 2025-26. You may approach if you are looking for COD310, COS310, COD891, COD892, COD893, COS799 etc. Calibrating multilabel, long tailed classifiers for medical imaging tasks with application to Chest X Ray analysis Domain generalization for fine grained classification tasks in medical imaging with application to Diabetic Retinopathy Adapting Multimodal Foundational Models for Mammography Improving localization ability of multimodal foundational models for dense document analysis Task incremental learning in foundational models Small and Camouflagged object detection Domain generalization for all weather semantic segmentation Person foundation model for recognition and reidentification in the wild",
  "content_length": 3740,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:04"
}