{
  "name": "Chi-Wing Fu",
  "homepage": "http://www.cse.cuhk.edu.hk/~cwfu",
  "status": "success",
  "content": "Chi-Wing FU's Homepage Chi-Wing FU (Philip) Department of Computer Science and Engineering The Chinese University of Hong Kong Email: cwfu [at] cse [dot] cuhk [dot] edu [dot] hk        or philip [dot] chiwing [dot] fu [at] gmail [dot] com Fax: +852 26035024 Office: Rm #928, Ho Sin-Hang Engineering Building The Chinese University of Hong Kong, Shatin, Hong Kong Now Looking for!!! - New in 2025: Note: looking for PhD students passionate in research, hardworking, creative, and well-motivated (computational design)! News!!! [details here] Project webpage for LEGO Maker: Autoregressive Image-Conditioned LEGO Model Creation a new learning-based generative model that can effectively consider over 100 unique brick types and rapidly generate hundreds of bricks to create LEGO models conditioned on images Congrats to Zhengzhe for \"Outstanding PhD Thesis Awards of Faculty of Engineering CUHK 2024\" Three papers accepted to SIGGRAPH Asia 2025. Congraulations to Jiahao, Mingjun, Hanyou, Keyu, Jingyu, and Rulin: LEGO Maker: Autoregressive Image-Conditioned LEGO Model Creation Inverse Tiling of 2D Finite Domains Hierarchical Neural Semantic Representation for 3D Semantic Correspondence Handbooster+ accepted to IEEE PAMI. Congraulations to XU Hao and Yinqiao. Two papers accepted to NeurIPS 2025. Congraulations to Runsong and CHEN Hao. Two papers to present in SIGGRAPH 2025. Congraulations to XU Hao, Yinqiao, and Jinbo. Hand-Shadow Poser MotionCanvas Working on the SIGGRAPH 2025 Technical Papers Committee Four papers accepted to CVPR. Congraulations to Yinqiao and XU Hao (a unified model for 3D hand-object pose estimation: hand-only and hand-object), Zhenghao (a new approach that simultaneously considers audio and visual for traffic anomaly understanding), Tianyu (a unified model on shadow detection, removal, and synthesis), and Runsong (an object-aware method for lifting multi-view 2D instance segmentations). Congrats to Edward for the paper accepted to ICLR 2025 on optimal transport flows for 3D generation Congrats to Weiliang for the paper accepted to ICRA 2025 on embodiment-agnostic action planning One technical paper on generative LEGO creation presented in SIGGRAPH ASIA 2024 (Congrats to Jiahao and Mingjun) Three papers accepted to ECCV 2024 (Congrats to Runsong, XU Hao, Jiaqi, and Mengyang) Congrats to Zhengzhe for obtaining the Postgraduate Research Output Award 2023 Three papers accepted to SIGGRAPH 2024 (Congrats to Jiahao, Mingjun, Zhengzhe, Jingyu, and Edward) Make-A-Shape: a Ten-Million-scale 3D Shape Model accepted to ICML 2024 (Congrats to Edward and Aditya; in collaboration with Autodesk; see news) Congrats to Jiahui and Cao Rui for the robotic bin packing and grasping papers accepted to RAL (to present in ICRA@40) Congrats to XU Hao and Yinqiao for the 3D hand reconstruction paper accepted to CVPR 2024 Received Adobe Research Gift Received the CCF CAD/CG 2023 Outstanding Reviewer Award Congrats to Yinqiao and XU Hao for your paper accepted to AAAI on 3D Hand-Mesh Reconstruction Congrats to Jingyu and Edward for your paper accepted to ACM TOG (see here) Congrats to Zhengzhe for your DreamStone paper accepted to IEEE PAMI (see here) Three papers accepted to SIGGRAPH Asia 2023 (Congrats to Mingjun, Zhengzhe, Jingyu, and Edward)- Two on shape generation (EXIM and CLIPXPlore) and the third on computational design of simple LEGO Sketches Congrats to Weiliang, Biqi, and Ruihang for your papers accepted to NIPS on 3D Few-shot Object Detection and Generative 3D Shape Completion Upcoming CG&A issue: The Big 50: Celebrating the 50th ACM SIGGRAPH Conference (IEEE CGA Jul/Aug issue) Congrats to XU Hao, YANG Han, Tianyu, and Fanbin for your papers accepted to ICCV 2023 Congrats to Jiahui for the paper accepted to IROS 2023 Congrats to XU Hao and Ruihang for the papers accepted to CVPR 2023 Congrats to Zhengzhe for a paper accepted to ICLR 2023 as Spotlight (about text-guided 3D shape generation) - ISS: Image as Stepping Stone for Text-Guided 3D Shape Generation (arxiv) Congrats to Biqi, Xianzhi, and Xiaojie for a paper accepted to ICRA 2023 Serve as Associate EIC (regular submissions) of IEEE Computer Graphics and Applications (CG&A) from Dec 2022 Congrats to Zhengzhe for receiving the MSRA Fellowship Nomination Award 2022 Two papers accepted to SIGGRAPH Asia 2022 (Congrats to Edward Hui and Yilin) A paper on \"contact-aware real-time hand interaction with virtual AR objects\" accepted to IMWUT (Ubicomp 2023) (Congrats to TANG Xiao) Invited to join the SIGGRAPH 2023 Technical Papers Committee ...... Biography Chi-Wing Fu (Philip) is a professor in the Department of Computer Science and Engineering at the Chinese University of Hong Kong (CUHK). He received his B.Sc. (1st hon.) and M.Phil. degrees in Computer Science and Engineering from the CUHK and his PhD from Indiana University, Bloomington. His research lies broadly in computer graphics, vision, and HCI, with specific interests in computation design, 3D vision/generation/editing, and user interaction. He has published over 100 papers, including 35+ articles in SIGGRAPH (+Asia) and ACM Transactions on Graphics (TOG), and 40+ articles in CVPR/ICCV/ECCV. He served in the technical program committee of various conferences such as SIGGRAPH, IEEE Visualization, etc., and co-chaired the technical brief and poster session in SIGGRAPH Asia. At present, he is the Associate Editor-in-Chief (regular submissions) of IEEE Computer Graphics and Applications. Professional services: Associate Editor-in-Chief (regular submissions) of IEEE Computer Graphics and Applications Program co-chair: ACM Multimedia 2024 Technical Video and Demo Program co-chair: SIGGRAPH Asia 2016 Technical Brief and Poster Associate Editor: Computer Graphics Forum (CGF), IEEE Computer Graphics & Applications (CG&A) Panel: SIGGRAPH 2019 Doctoral Consortium Programme Committee: ACM SIGGRAPH Technical Paper ACM SIGGRAPH Asia: Emerging Tech., Technical Brief, Poster, and Course CVPR AAAI (PC and SPC) IEEE Visualization (SciVis), 2014-2017 IEEE Virtual Reality (IEEE VR) IEEE Pacific Visualization (PacificVis) CHI Work-in-progress (CHI WIP) Pacific Graphics (PG) ACM Symp. on Virtual Reality Software and Technology (VRST) Shape Modeling International (SMI) Geometric Modeling and Processing (GMP) Advances in Architectural Geometry (AAG) CAD/Graphics, etc. Reviewer: SIGGRAPH, SIGGRAPH ASIA, ACM CHI, Eurographics, IEEE TVCG, IEEE VR, IEEE CG&A, CGF, CVPR, ICCV, NIPS, etc. The Bible (Chinese) My Publications: (full list or selected) Research Students and Staff My Dedicated students: Zheng Hanyou, PhD (2025- ) CHEN Hao, PhD (2024- ) (co-supervisor) GAO Jialin, PhD (2024- ) (co-supervisor) ZHOU Donghao, PhD (2024- ) (co-supervisor) WANG Yihan, PhD (2024- ) (co-supervisor) YAN Qiao, PhD (2024- ) (co-supervisor) GE Jiahao, PhD (2023- ) WANG Yinqiao, PhD (2023- ) QIU Yue, PhD (2023- ) (co-supervisor) LIU Qixuan, PhD (2023- ) (co-supervisor) XING Zhenghao, PhD (2023- ) (co-supervisor) (now, intern at Alibaba) XU Hao, Stephen, PhD (2022- ) (now, visiting UCL) ZHU Runsong, PhD (2022- ) LIU Yuxin, PhD (2022- ) (co-supervisor) PAN Jia-Hui, PhD (2021- ) ZHOU Mingjun, PhD (2021- ) TANG Weiliang, PhD (2021- ) LU Fanbin, PhD (2021- ) (co-supervisor) SHEN Tiancheng, PhD (2020- ) (co-supervisor) XING Jinbo, PhD (graduated, 2025) (co-supervisor) (now, with Alibaba Tongyi Lab) WU Mengyang, PhD (graduated, 2025) (now, with Huawei) HUI Ka-Hei, PhD (graduated, 2024) (now, with Autodesk (Canada)) HU Jingyu, PhD (graduated, 2024) (now, with Huawei) LIU Zhengzhe, PhD (graduated, 2024) (now, Asst. Prof. in Lingnan U.) CHU Ruihang, PhD (graduated, 2024) (co-supervisor) (now, with Alibaba Tongyi Lab) WANG Tianyu, PhD (graduated, 2024) (now, with Adobe) YANG Biqi, PhD (graduated, 2024) (co-supervisor) ZHENG Wu, PhD (graduated, 2023) (now, in an autonomous driving company) TANG Xiao, PhD (graduated, 2022) (now, with Huawei) XU Hao, PhD (graduated, 2021) (now, start-up: BrickStudio) LI Ruihui, PhD (graduated, 2021) (now, Prof. in Hunan U.) WANG Ruixing, PhD (graduated, 2021) (co-supervisor) (now, with DJI) JIANG Li, PhD (graduated, 2021) (co-supervisor) (now, Asst. Prof. in CUHK(SZ)) WANG Shujun, PhD (graduated, 2021) (co-supervisor) (now, Asst. Prof. in Poly U., HK) ZENG Zhiliang, PhD (graduated, 2021) LI Xianzhi, PhD (graduated, 2020) (co-supervisor) (now, Assoc. Prof. in HUST) HU Xiaowei, PhD (graduated, 2020) (co-supervisor) (now, Prof., SCUT) TIAN Yang, PhD (graduated, 2020) (co-supervisor) (now, Asst. Prof. in Guangxi U.) JIN Yueming, PhD (graduated, 2019) (co-supervisor) (now, Asst. Prof. in NUS) LI Xiaomeng, PhD (graduated, 2019) (co-supervisor) (now, Asst. Prof. in HKUST) YU Lequan, PhD (graduated, 2019) (co-supervisor) (now, Asst. Prof. in HKU) LEUNG Ho Man, Colman, M.Phil (graduated, 2018) (co-supervisor) (now, PhD in Dartmouth College) ZHU Lei, PhD (graduated, 2017) (co-supervisor) (now, Asst. Prof. in HKUST (Guangzhou)) KUMAR Pradeep, PhD (graduated, 2017) (NTU) (co-supervisor, main) (now, Autodesk (Canada)) LAI Chi-Fu, PhD (graduated, 2016) (NTU) (now, Asst. Prof. in HK Metropolitan U.) YAN Xiaoqi, PhD (graduated, 2015) (previously with ST Engineering and now with ByteDance, Singapore) ZENG Wei, PhD (graduated, 2015) (now, Asst. Prof. in HKUST (Guangzhou)) TANG Peng, PhD (graduated, 2015) (co-supervisor) SONG Peng, PhD (graduated, 2013) (Asst. Prof. in SUTD, Singapore) LI Hongwei, PhD (graduated, 2010) (previously with AMD and NVidia; now, with Tencent) LO Kui Yip, Felix, M.Phil (graduated) (now, study in U. of Victoria) LEUNG Man Kang, Raymond, M.Phil (graduated) My Dedicated post-doc., research assistants, summer interns, and student helpers: YUAN Shaoxuan (May 2024 - ) XIONG Meini (May 2025 - Aug 2025) WANG Zixin (May 2024 - Apr 2025) LI, Caizi (Oct 2023 - Mar 2025) (postdoc) ZENG, Zhiliang (Jul. 2022 - May 2024) (postdoc) BAO Wenrui (May 2023 - Apr. 2024) ZHANG Xue (May 2023 - Apr. 2024) TANG, Wai Lun (May 2022 - Oct 2023) DONG Yi (May 202",
  "content_length": 14245,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:06"
}