{
  "name": "Chi Jin 0001",
  "homepage": "https://sites.google.com/view/cjin/home",
  "status": "success",
  "content": "Chi JinSearch this siteEmbedded FilesSkip to main contentSkip to navigationChi Jin (金驰)Associate Professor of Electrical and Computer EngineeringAssociated Faculty Member of Computer SciencePrinceton UniversityResearch InterestsLLM Reasoning & AgentsReinforcement LearningGame Theory & Multiagent LearningStatistical Learning TheoryOptimizationEducationPh.D. in Computer Science, 2013 - 2019 University of California, Berkeley.Advisor: Michael I. Jordan  BSc in Physics, 2008 - 2012            Peking University.   I am an Assistant Professor at Princeton University, where my research centers on the decision-making aspects of machine learning. My group develops intelligent agents capable of advanced reasoning, strategic planning, and tackling complex tasks. We have contributed to the theoretical foundations of ML---spanning reinforcement learning, multi-agent learning, game theory, statistical learning theory, and optimization---and are now extending this work to AI for mathematics, games and other decision making tasks, with a focus on building grounded and verifiable AI systems.*I am recruiting undergraduate research interns, PhD students, and Postdoctoral researchers*. To apply, please email me with your CV attached. PhD applicants should also mention my name as a faculty member of interest in their statement of purpose. Due to the high volume of inquiries, I may not be able to respond until the hiring process begins. NewsOur Goedel-prover project is featured on the front page of the Princeton AI lab news!We have released Goedel-Prover-V2---the strongest open-source theorem prover to date!I'm very excited to announce our project on LLM automatic theorem proving---Goedel-prover, which achieves SOTA performance on miniF2F,  PutnamBench, and Lean-workbook!I have been recently giving talks on beyond equilibrium learning in game theory. See also my Princeton course on foundations of reinforcement learning here, and my tutorial on multiagent reinforcement learning at Simons institute here.My Princeton course on Foundations of Reinforcement Learning is now available on YouTube!AwardsPrinceton AI Lab Seed Grant funding, 2025Sloan Research Fellowship, 2024E. Lawrence Keyes, Jr./Emerson Electric Co. Faculty Advancement Award, 2023NSF CAREER Award, Division of Information and Intelligent Systems, 2023Princeton Commendation for Outstanding Teaching for ECE 524, 2022 & 2024Princeton Commendation for Outstanding Teaching for ECE 539, 2021 & 2023Princeton School of Engineering and Applied Science (SEAS) Innovation Award, 2022Best Paper Award in ICLR 2022 workshop “Gamification and Multiagent Solutions”.Best Paper Award in ICML 2018 workshop “Exploration in Reinforcement Learning”.Selected PaperGoedel-Prover-V2: Scaling Formal Theorem Proving with Scaffolded Data Synthesis and Self-Correction [arXiv]Yong Lin, Shange Tang, Bohan Lyu, Ziran Yang, Jui-Hui Chung, Haoyu Zhao, Lai Jiang, Yihan Geng, Jiawei Ge, Jingruo Sun, Jiayun Wu, Jiri Gesi, Ximing Lu, David Acuna, Kaiyu Yang, Hongzhou Lin, Yejin Choi, Danqi Chen, Sanjeev Arora, Chi JinArXiv PreprintGoedel-Prover: A Frontier Model for Open-Source Automated Theorem Proving [arXiv]Yong Lin, Shange Tang, Bohan Lyu, Jiayun Wu, Hongzhou Lin, Kaiyu Yang, Jia Li, Mengzhou Xia, Danqi Chen, Sanjeev Arora, Chi JinConference on Language Modeling (COLM) 2025Securing Equal Share: A Principled Approach for Learning Multiplayer Symmetric Games [arXiv]Jiawei Ge*, Yuanhao Wang*, Wenzhe Li, Chi JinInternational Conference on Machine Learning (ICML) 2025Maximum Likelihood Estimation is All You Need for Well-Specified Covariate Shift [arXiv]Jiawei Ge*, Shange Tang*, Jianqing Fan, Cong Ma, Chi JinInternational Conference on Learning Representations (ICLR) 2024Optimistic MLE -- A Generic Model-based Algorithm for Partially Observable Sequential Decision Making [arXiv]Qinghua Liu, Praneeth Netrapalli, Csaba Szepesvari, Chi JinSymposium on Theory of Computing (STOC) 2023When Is Partially Observable Reinforcement Learning Not Scary? [arXiv]Qinghua Liu, Alan Chung, Csaba Szepesvári, Chi JinConference of Learning Theory (COLT) 2022.Near-Optimal Learning of Extensive-Form Games with Imperfect Information. [arXiv](α-β order) Yu Bai, Chi Jin, Song Mei, Tiancheng YuInternational Conference on Machine Learning (ICML) 2022.V-Learning -- A Simple, Efficient, Decentralized Algorithm for Multiagent RL [arXiv](α-β order) Chi Jin, Qinghua Liu, Yuanhao Wang, Tiancheng YuMathematics of Operation Research (MOR) 2023Best Paper in ICLR 2022 workshop “Gamification and Multiagent Solutions”Bellman Eluder Dimension: New Rich Classes of RL Problems, and Sample-Efficient Algorithms [arXiv](α-β order) Chi Jin, Qinghua Liu, Sobhan Miryoosefi Neural Information Processing Systems (NIPS) 2021.Near-Optimal Algorithms for Minimax Optimization [arXiv]Tianyi Lin, Chi Jin, Michael. I. JordanConference of Learning Theory (COLT) 2020Provably Efficient Reinforcement Learning with Linear Function Approximation [arXiv]Chi Jin, Zhuoran Yang, Zhaoran Wang, Michael I. JordanConference of Learning Theory (COLT) 2020Is Q-learning Provably Efficient? [arXiv]Chi Jin*, Zeyuan Allen-Zhu*, Sebastien Bubeck, Michael I. JordanNeural Information Processing Systems (NIPS) 2018. Best Paper in ICML 2018 workshop \"Exploration in RL\"Accelerated Gradient Descent Escapes Saddle Points Faster than Gradient Descent [arXiv]Chi Jin, Praneeth Netrapalli, Michael I. JordanConference of Learning Theory (COLT) 2018How to Escape Saddle Points Efficiently [arXiv] [blog]Chi Jin, Rong Ge, Praneeth Netrapalli, Sham M. Kakade, Michael I. JordanInternational Conference on Machine Learning (ICML) 2017.Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 5688,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:05"
}