{
  "name": "Chia-Fang Chung",
  "homepage": "https://people.ucsc.edu/~cfchung",
  "status": "success",
  "content": "Christina Chung Chia-Fang (Christina) Chung Associate Professor in Computational Media University California, Santa Cruz Curriculum Vitae Google Scholar I have the privilege to work with many wonderful collaborators, including PhD student collaborators: Seung Wan Ha, Chun Han (Ariel) Wang, and Yu-Ling (Ruby) Chou and alumni: Yuxing Wu, Aswati (Ash) Panicker, and Long-Jing (Claire) Hsu About I am Christina Chung, an Associate Professor in Computational Media at University of California, Santa Cruz. My research focuses on the intersection of Human-Computer Interaction and Health/Well-being. Specifically, I conduct research on how ubiquitous computing and personal informatics technology can be designed to enhance relationships, to motivate health behavior, and to support clinical care. Previously, I was an Assistant Professor in Informatics at Indiana University Bloomington. I completed my Ph.D. in Human-Centered Design and Engineering from the University of Washington. I was advised by Sean Munson and was a member of the DUB group. I hold a M.B.A and B.B.A in Information Management from the National Taiwan University, where I conducted research on designing embedded intrusion detection systems. In my previous life, I also worked as a software engineer in IBM Greater China Development Lab, Taipei, Taiwan to design industrial solutions that integrate novel technologies and complex enteprise systems, and in IBM Research Collaboratory Taiwan to conduct service innovation research in health and wellness. Research Supporting Healthy Eating in Families Eating and food preparation are social for many families. Collocated families use these opportunities to build shared experience. Family members living apart use these convesations to maintain connectedness, reminisce, and provide care. However, conversations about healthy eating can be challenging. In a series of project, we seek to understand how family members communicate about eating and preparation experience and practices, how they cordinate eating and preparation, what challenges and tensions they encounter, and how they cope with these challenges. This project is partly supported by NSF. [CSCW2020 - Paper]· [CSCW2020 - Medium Article]· [CSCW2020 - Video]· [CSCW2024 - Paper]· Sharing lifelog data with healthcare experts Consumer self-monitoring apps have been widely studied and used to promote healthy behavior change. People increasingly turn to these apps and wearable devices for health management. Datasets collected through these apps may potentially enrich clinical care without adding new user burdens. In this project, we sought to understand provider goal, needs, and their experience of use and non-use of lifelog data in chronic disease/symptoms management to support future design of personal informatic tools. This project is funded by AHRQ. [JMIR 2015] · [CSCW 2016] · [CSCW 2017]· [Medium Article - Fitbit in Doctor's office]· [IMWUT 2019]· [Medium Article - Redesigning Food Diaries]· [Foodprint Use Cases designed with Reos Partners and Robert Wood Johnson Foundation] Adoption of blood pressure kiosks in clinic settings In this project, we partnered with UW Medicine, Group Health Research Institute, and Family Medicine of Yakima to understand the adoption of two blood pressure kiosks in clinic settings and how it might affect the clinic workflow. We employed a series of mixed approches, including observations in staff meetings and the waiting room before and after the kiosks were introduced, focus groups with providers and staff, and patient surveys before and after the kiosks launched. [JABFM 2016;29(5)] Do you always need a backup goal? One vs. Two Goals Goal setting theory has been studied and adopted in a variety of domains such as game, education, and health behavior change. In this project, we sought to examine whether having two goals – a primary goal and a backup goal – rather than one might affect people’s goal-setting behavior, which suggested but not further studied in previous literature. We designed three studies - a lab experiment, an online experiment, and a field experiment - to understand how different goal-setting scenarios predict performance. [IJHCS 2017] · [Medium Article] Sharing Temperature to Support Relationships Temperature information is seen as intimate and reflective of health and comfort, and so sharing it between people in remote relationships may be particularly valuable for supporting those relationships. In this project, we probed how people in remote relationship might react to the information and what their concerns might be. We are also planning on future home deployment study to understand how people would actually use such information and to validate our preliminary findings. [PDF] [Poster] Workflow-based design for health IT systems We conducted contextual inquiries in a Multiple Sclerosis (MS) clinic with over 300 MS patients. MS is a chronic, progressive disease and case manageers (CM) played a critical role to manage the complex symptoms. Results from interviews and observations indicated inadequate information resources and systems led to higher effort and stress to manage individual's cases and orders. Based on the results, we developed a conceptual workflow model to serve as an information source architecture and a reference model of user interface design. [WISH 2013] Previous Projects Publications Journal Articles Mediated Human-Food Interaction for Remote Presence in Adult Family Relationships: A Social Practice Theory Approach Aswati Panicker, Kavya Basu, and Chia-Fang Chung Computer Supported Cooperative Work (2025) · PUBLISHER · PDF Opportunities to design better computer vison-assisted food diaries to support individuals and experts in dietary assessment: An observation and interview study with nutrition experts Chia-Fang Chung, Pei-Ni Chiang, Connie Ann Tan, Chien-Chun Wu, Haley Schmidt, Aric Kotarski, and David Guise PLOS Digital Health 3(11): e0000665 · PUBLISHER · PDF \"The struggle is a part of the experience”: Engaging Discontents in the Design of Family Meal Technologies Yuxing Wu, Andrew D Miller, Chia-Fang Chung, and Elizabeth Kaziunas PACM Human-Computer Interaction 2024; 8(CSCW2) · PDF From Viral Content to Real-Life Cuisine and Beyond: Examining Teenagers’ Interactions with TikTok Food Videos and the Influence on Their Food Practices Chun-Han Ariel Wang, Stephen Tsung-Han Sher, and Chia-Fang Chung PACM Human-Computer Interaction 2024; 8(CSCW2) · PDF · Medium Article Early pregnancy associations with Gestational Diabetes: methods and cohort results of the Hoosier Moms Cohort David Haas,Hani Faysal, MItchell Grecu, Kathleen M Flannery, Haley Schmidt, Maha Aamir, Rafael Guerrero, Chia-Fang Chung, Constantine Scordalakes, Brennan Fitzpatrick, Shelley Dowden,Shannon Barnes, David Guise, Aric J Kotarski,Chandan Saha, Predrag Radivojac, Christina Scifres, Katherine Connelly North American Proceedings in Gynecology & Obstetrics · PUBLISHER · PDF “It’s like living a different life, going to the moon”: Rethinking Space and Activity in the Context of COVID-19 Novia Nurain, Chia-Fang Chung, Clara Caldeira, and Kay Connelly Computer Supported Cooperative Work (2024) · PUBLISHER ·PDF Survey on the Past Decade of Technology in Animal Enrichment: A Scoping Review Cassie K. Kresnye, Chia-Fang Chung, Christopher Flynn Martin, and Patrick C. Shih Animals 12, no. 14 (2022): 1792 · PUBLISHER ·PDF Hugging with a Shower Curtain: Older Adults’ Social Support Realities During the COVID-19 Pandemic Novia Nurain, Chia-Fang Chung, Clara Caldeira, and Kay Connelly PACM Human-Computer Interaction 2021; 5(CSCW2) · Impact Recognition · PDF · Medium Article · Video Not Another Medication Adherence App: Critical Reflections on Addressing Public HIV-related Stigma Through Design Juan F. Maestre, Patrycja Zdziarska, Aehong Min, Anna Baglione, Chia-Fang Chung, and Patrick C. Shih PACM Human-Computer Interaction 2020; 4(CSCW3) · PDF · Medium Article · Video The Importance of Starting with Goals in N-of-1 Studies Sean A Munson, Jessica Schroeder, Ravi Karkar, Julie A Kientz, Chia-Fang Chung, James Fogarty Frontiers in Digital Health 2, 3 · PUBLISHER · PDF Changing Roles and Contexts: Symbolic Interactionism in the Sharing of Food and Eating Practices between Remote, Intergenerational Family Members Aswati Panicker, Kavya Basu, and Chia-Fang Chung PACM Human-Computer Interaction 2020; 4(CSCW1) · PDF · Medium Article · Video Identifying and Planning for Individualized Change: Patient Provider Collaboration Using Lightweight Food Diaries in Healthy Eating and Irritable Bowel Syndrome Chia-Fang Chung, Qiaosi Wang, Jessica Schroeder, Allison Cole, Jasmine Zia, James Fogarty, and Sean A. Munson PACM Interactive, Mobile, Wearable and Ubiquitous Technologies 2019; 3(1) · PDF · Medium Article · Use Cases designed with Reos Partners and Robert Wood Johnson Foundation Inter-Rater Reliability of Provider Interpretations of Irritable Bowel Syndrome Food and Symptom Journals Jasmine Zia, Chia-Fang Chung, Kaiyuan Xu, Yi Dong, Jeanette M Schenk, Kevin Cain, Sean Munson, Margaret M HeitkemperJournal of Clinical Medicine; 6(11):105 · PUBLISHER · PDF Should you always have a backup? One vs. Two Goals in Games Chia-Fang Chung, Sean MunsonInternational Journal of Human-Computer Studies;108:32-40 · PUBLISHER· PDF · Medium Article The Feasibility, Usability, and Perceived Clinical Utility of Traditional Paper Food and Symptom Journals for Patients with Irritable Bowel Syndrome Jasmine Zia, Chia-Fang Chung, Jessica Schroeder, Sean Munson, Julie Kientz, James Fogarty, Elizabeth Bales, Jeanette Schenk, Margaret Heitkemper Neurogastroenterology and Motility; 28:25-26 · PUBLISHER · PDF Implementation of a New Kiosk Technology for Blood Pressure Management in a Family Medicine Clinic: from the WWAMI region Practice and Research Network Chia-Fang Chung, Sean Munson, Matthew Thompson, Laura-Mae Baldwin, Jeffrey Kaplan, Randall Cline, Beverly Green Journal of the Ame",
  "content_length": 23802,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:08"
}