{
  "name": "Chiew-Lan Tai",
  "homepage": "https://www.cse.ust.hk/~taicl",
  "status": "success",
  "content": "Chiew-Lan Tai's Home Page Chiew-Lan Tai Professor Department of Computer Science and Engineering Hong Kong University of Science and Technology Clear Water Bay Hong Kong Office: Room 3515 Email: Chiew-Lan Tai is a Professor at the Hong Kong University of Science & Technology. She received her B.Sc. and M.Sc. in Mathematics from the University of Malaya, M.Sc. in Computer and Information Sciences from the National University of Singapore, and D.Sc. in Information Science from the University of Tokyo. Her research interests include geometric processing, computer graphics, human computer interaction, and computer vision. [Publications] Courses Taught COMP2711 Discrete Mathematics for Computer Science COMP3711 Design and Analysis of Algorithms COMP171 Data Structures and their Algorithms COMP3721 Theory of Computation COMP4411 Computer Graphics COMP5411 Advanced Computer Graphics COMP641G Topics in Graphics: Geometric Modeling & Processing Graduated Students Graduated PhD students Zeyu Hu - LightSpeed Studios, Singapore Jingyuan Liu - Postdoc, University of Tokyo Xuyang Bai - Software Engineer, Altizure Craig Lei Li - Postdoc, Technical University of Munich, Germany Qingkun Su - Alibaba AI Lab Jingbo Liu - First placement: Software Engineer, Altizure Pengfei Xu (co-supervised with Hongbo Fu) - Associate Professor, Shenzhen University Youyi Zheng - Researcher, Zhejiang University Hongbo Fu - Professor and Acting Head, Academy of Interdisciplinary Studies, Hong Kong University of Science & Technology Oscar Kin-Chung AU - First placement: Assistant Professor, School of Creative Media, City University of Hong Kong. Nelson Siu-Hang CHU - Founder, Expresii PhD Interns Jiyuan Zhang (Peking University, July 2014-Jan 2015) Hao Wang (Nanjing University, Mar-Aug 2012) Yirui Wu (Nanjing University, Mar-Aug 2012, Aug 2014-Jan 2015). Yu-Shuen Wang (National Cheng Kung University, Taiwan, Sep 2007-Jan 2008). James, Hung-Kuo Chu (National Cheng Kung University, Taiwan, Sep 2007-Jan 2008). Tong Lu (Nanjing University). Graduated MPhil students Shenlai Gao Jianhui Zhang Xuren Zhou Sisi Wu Lu (Arthur) Chen Tian HAN Pengfei Xu Jackson YUEN Hengli YIN Menglin CHEN Jianwei LE Alan Hui ZHAO Oscar Au Kin-Chung Jacky Chun-Kin FONG Nelson Siu-Hang Chu Janice Yim-Hung CHAN",
  "content_length": 2282,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:13"
}