{
  "name": "Chien-Ju Ho",
  "homepage": "http://chienjuho.com",
  "status": "success",
  "content": "Chien-Ju Ho Chien-Ju Ho Chien-Ju Ho About Me I am an Associate Professor in the Department of Computer Science & Engineering at Washington University in St. Louis. Previously, I was a Postdoctoral Associate at Cornell University working with Arpita Ghosh. In October 2015, I completed my Ph.D. in Computer Science at UCLA, where I am fortunate to be advised by Jenn Wortman Vaughan. I also spent three wonderful years from 2012 to 2015 visiting the EconCS Group at Harvard University, where I was hosted by Yiling Chen. My research broadly connects to the fields of machine learning, optimization, behavioral sciences, and algorithmic economics. I am interested in investigating the interactions between humans and AI, including enabling AI algorithms to learn from humans (e.g., in the context of crowdsourcing) and designing AI algorithms to assist human decision-making (e.g., through information design and environment design). For more information, please see my CV and Google Scholar page. You can also reach me via [chienju.ho at wustl dot edu]. Ph.D. Students Current students: Saumik Narayanan (01/2021-present, CSE) Lauren Treiman (09/2022-present, DCDS, co-advised with Wouter Kool) Alex DiChristofano (01/2023-present, DCDS, co-advised with Patrick Fowler) Robert Kasumba (01/2023-present, DCDS, co-advised with Dennis Barbour) Tory Farmer (01/2024-present, CSE) Alumni: Wei Tang (01/2018-08/2022, CSE Ph.D.) → Postdoc at Columbia University → Assistant professor at CUHK Business School Guanghui Yu (01/2020-08/2024, CSE Ph.D.) → Microsoft Publications In most cases, my collaborators and I choose to have students as first authors and then determine the authorship of non-student authors alphabetically. Goal Recognition Design for General Behavioral Agents using Machine Learning (Coming Soon) Robert Kasumba, Guanghui Yu, Chien-Ju Ho, Sarah Keren, William Yeoh In Transactions on Machine Learning Research (TMLR), 2025 Do People Think Fast or Slow When Training AI? Lauren Treiman, Chien-Ju Ho, Wouter Kool ACM Conference on Fairness, Accountability, and Transparency (FAccT), 2025 Examining Interactions Between User Characteristics and Explanation Modalities on Inducing Complementarity Torrence Farmer and Chien-Ju Ho In the Late-Breaking Work Track in ACM CHI conference on Human Factors in Computing Systems (CHI), 2025 Exploring the Cost-Effectiveness of Perspective Taking in Crowdsourcing Subjective Assessment: A Case Study of Toxicity Detection Xiaoni Duan, Zhuoyan Li, Chien-Ju Ho, and Ming Yin In the Annual Conference of the Nations of the Americas Chapter of the Association for Computational Linguistics (NAACL), 2025 The Consequences of AI Training on Human Decision Making Lauren Treiman, Chien-Ju Ho, Wouter Kool Proceedings of the National Academy of Sciences (PNAS), 2024 Adaptive Resource Allocation to Improve Cohort Representativeness in Participatory Biomedical Datasets Victor Borza, Andrew Estornell, Ellen Wright Clayton, Chien-Ju Ho, Russell L. Rothman, Yevgeniy Vorobeychik, Bradley A. Malin American Medical Informatics Association Annual Symposium, 2024 Performative Prediction with Bandit Feedback: Learning through Reparameterization Yatong Chen, Wei Tang, Chien-Ju Ho, and Yang Liu In the 41st International Conference on Machine Learning (ICML), 2024 The Impact of Features Used by Algorithms on Perceptions of Fairness Andrew Estornell, Tina Zhang, Sanmay Das, Chien-Ju Ho, Brendan Juba, and Yevgeniy Vorobeychik In the 33rd International Joint Conference on Artificial Intelligence (IJCAI), 2024 Examining the Effects of Explainable Hints in AI-Driven Training (Extended Abstract) Torrence Farmer and Chien-Ju Ho In the ACM Collective Intelligence Conference (CI), 2024. Rationality-Robust Information Design: Bayesian Persuasion under Quantal Response (α-β) Yiding Feng, Chien-Ju Ho, and Wei Tang In the ACM-SIAM Symposium on Discrete Algorithms (SODA), 2024 Encoding Human Behavior in Information Design through Deep Learning Guanghui Yu, Wei Tang, Saumik Narayanan, and Chien-Ju Ho In the 37th Conference on Neural Information Processing Systems (NeurIPS), 2023 Humans Forgo Reward to Instill Fairness into AI Lauren Treiman, Chien-Ju Ho, and Wouter Kool In the 11th AAAI Conference on Human Computation and Crowdsourcing (HCOMP), 2023 How Does Value Similarity Affect Human Reliance in AI-Assisted Ethical Decision Making? Saumik Narayanan, Guanghui Yu, Chien-Ju Ho, and Ming Yin In the 6th AAAI/ACM Conference on AI, Ethics, and Society (AIES), 2023 Competitive Information Design for Pandora's Box (α-β) Bolin Ding, Yiding Feng, Chien-Ju Ho, Wei Tang, and Haifeng Xu In the ACM-SIAM Symposium on Discrete Algorithms (SODA), 2023 Environment Design for Biased Decision Makers Guanghui Yu and Chien-Ju Ho In the 31st International Joint Conference on Artificial Intelligence (IJCAI), 2022 How Does Predictive Information Affect Human Ethical Preferences? Saumik Narayanan, Guanghui Yu, Wei Tang, Chien-Ju Ho, and Ming Yin In the 5th AAAI/ACM Conference on AI, Ethics, and Society (AIES), 2022 The Influences of Task Design on Crowdsourced Judgement: A Case Study of Recidivism Risk Evaluation Xiaoni Duan, Chien-Ju Ho, and Ming Yin In the Web Conference (WWW), 2022 Bandit Learning with Delayed Impact of Actions Wei Tang, Chien-Ju Ho, and Yang Liu In the 35th Conference on Neural Information Processing Systems (NeurIPS), 2021 On the Bayesian Rational Assumption in Information Design Wei Tang and Chien-Ju Ho In the 9th AAAI Conference on Human Computation and Crowdsourcing (HCOMP), 2021 Best Paper Honorable Mention Designing and Optimizing Cognitive Debiasing Strategies for Crowdsourcing Annotation (Position Paper) Chien-Ju Ho and Ming Yin In the CSCW Workshop on Investigating and Mitigating Biases in Crowdsourced Data (BCD), 2021 Linear Models are Robust Optimal Under Strategic Behavior Wei Tang, Chien-Ju Ho, and Yang Liu In the 24th International Conference on Artificial Intelligence and Statistics (AISTATS), 2021 Efficient Nonmyopic Online Allocation of Scarce Reusable Resources Zehao Dong, Sanmay Das, Patrick Fowler, and Chien-Ju Ho In the 20th International Conference on Autonomous Agents and Multiagent Systems (AAMAS), 2021 Optimal Query Complexity of Secure Stochastic Convex Optimization Wei Tang, Chien-Ju Ho, and Yang Liu In the 34th Conference on Neural Information Processing Systems (NeurIPS), 2020 Does Exposure to Diverse Perspectives Mitigate Biases in Crowdwork? An Explorative Study (Short Paper) Xiaoni Duan, Chien-Ju Ho, and Ming Yin In the 8th AAAI Conference on Human Computation and Crowdsourcing (HCOMP), 2020 Differentially Private Contextual Dynamic Pricing Wei Tang, Chien-Ju Ho, and Yang Liu In the 19th International Conference on Autonomous Agents and Multiagent Systems (AAMAS), 2020 Incorporating Compatible Pairs in Kidney Exchange: A Dynamic Weighted Matching Model Zhuoshu Li, Kelsey Lieberman, William Macke, Sofia Carrillo, Chien-Ju Ho, Jason Wellen, and Sanmay Das In the 20th ACM conference on Economics and Computation (EC), 2019 Leveraging Peer Communication to Enhance Crowdsourcing Wei Tang, Chien-Ju Ho, and Ming Yin In the Web Conference (WWW), 2019 Bandit Learning with Biased Human Feedback Wei Tang and Chien-Ju Ho In the 18th International Conference on Autonomous Agents and Multiagent Systems (AAMAS), 2019 Incentivizing High Quality User Contributions: New Arm Generation in Bandit Learning Yang Liu and Chien-Ju Ho In the 32nd AAAI Conference on Artificial Intelligence (AAAI), 2018 Eliciting Categorical Data for Optimal Aggregation Chien-Ju Ho, Rafael Frongillo, and Yiling Chen In the 30th Annual Conference on Neural Information Processing Systems (NIPS), 2016 Adaptive Contract Design for Crowdsourcing Markets:Bandit Algorithms for Repeated Principal-Agent Problems Chien-Ju Ho, Aleksandrs Slivkins, and Jennifer Wortman Vaughan Journal of Artificial Intelligence Research, Volume 55, pages 317-359, 2016 (Supersedes the EC'14 paper) Low-Cost Learning via Active Data Procurement Jacob Abernethy, Yiling Chen, Chien-Ju Ho, and Bo Waggoner In the 16th ACM Conference on Economics and Computation (EC), 2015 Incentivizing High Quality Crowdwork Chien-Ju Ho, Aleksandrs Slivkins, Siddharth Suri, and Jennifer Wortman Vaughan In the 24th International World Wide Web Conference (WWW), 2015 Nominee for Best Paper Award Adaptive Contract Design for Crowdsourcing Markets:Bandit Algorithms for Repeated Principal-Agent Problems Chien-Ju Ho, Aleksandrs Slivkins, and Jennifer Wortman Vaughan In the 15th ACM Conference on Economics and Computation (EC), 2014 Adaptive Task Assignment for Crowdsourced Classification Chien-Ju Ho, Shahin Jabbari, and Jennifer Wortman Vaughan In the 30th International Conference on Machine Learning (ICML), 2013 Online Task Assignment in Crowdsourcing Markets Chien-Ju Ho and Jennifer Wortman Vaughan In the 26th Conference on Artificial Intelligence (AAAI), 2012 Towards Social Norm Design for Crowdsourcing Markets Chien-Ju Ho, Yu Zhang, Jennifer Wortman Vaughan, and Mihaela van der Schaar In the 4th Human Computation Workshop (HCOMP), 2012 DevilTyper: A Game for CAPTCHA Usability Evaluation Chien-Ju Ho, Chen-Chi Wu, Kuan-Ta Chen, Chin-Laung Lei In ACM Computers in Entertainment, 2011 KissKissBan: A Competitive Human Computation Game for Image Annotation (Short Paper) Chien-Ju Ho, Tao-Hsuan Chang, Jong-Chuan Lee, Jane Yung-jen Hsu, Kuan-Ta Chen In the ACM SIGKDD Workshop on Human Computation (HCOMP), 2009 Also appeared in ACM SIGKDD Explorations Newsletter: Volume 12 Issue 1, June 2010 On Formal Models for Social Verification Chien-Ju Ho, Kuan-Ta Chen In the ACM SIGKDD Workshop on Human Computation (HCOMP), 2009 PhotoSlap: A Multi-player Online Game for Semantic Annotation Chien-Ju Ho, Tsung-Hsiang Chang, Jane Yung-jen Hsu In the 22nd Conference on Artificial Intelligence (AAAI), 2007 The PhotoSlap Game: Play to Annotate (Intelligent System Demo) Tsung-Hsiang Chang, Chien-Ju Ho, Jane Yung-jen Hsu In the 22nd Conference ",
  "content_length": 12344,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:12"
}