{
  "name": "Chien-Chung Shen",
  "homepage": "https://www.eecis.udel.edu/~cshen",
  "status": "success",
  "content": "Chien-Chung Shen's Home Page Chien-Chung Shen Professor and Associate Chair of Undergraduate Studies Dept. of Computer and Information Sciences University of Delaware 450 Smith Hall Newark, DE 19716-2553 (302) 831-1951 (office) (302) 831-8458 (fax) cshen [at] udel [dot] edu Education PhD, Computer Science, UCLA MS and BS, Computer Science, National Chiao Tung University, Taiwan Experience Research Scientist, Bellcore (Applied Research), New Jersey Teaching Activities CISC 106: General Computer Science for Engineers CISC 220: Honors:Data Structures CISC 250: Business Telecommunication Networks CISC 361: Operating Systems CISC/CPEG 367: Simulation-Based Cybersecurity CISC/MISY 367: Mobile Cloud Computing CISC 450/CPEG 419: Computer Networks I (Fall 2025) CISC 459/659: The Power of Networks CISC 650/ELEG 651/CPEG 651: Computer Networks II CISC 855: Distributed Computing with CORBA, Java/RMI, Jini/JavaSpace, and Jxta CISC 859: Distributed Ledger Technology (Blockchain) CISC 859: Mobile Cloud Computing CISC 859: Software-Defined and Virtualized Networks CISC 861: Wireless Networks and Mobile Computing CISC 890-010: SIGNET Research Activities publications Research Sponsors National Science Foundation SaTC-EDU:EAGER: Educating Security and Privacy of Metaverse in Metaverse to Teenagers ITEST-EDT: Mixed Reality Based Interactive Cybersecurity Education for Middle School Students SaTC-EDU: Cybersecurity Education Using Interactive Storytelling with Social Robots NeTS: In-Band Full-Duplex Underwater Acoustic Networks DUE: Regional Cybersecurity Education Initiative NeTS: Learning to help: Trading spectrum ownership for performance NetSE: Autonomous Wireless Swarms: Integrating Science and Engineering EMT: Biology Inspired Autonomic Networking Protocols NeTS: Toward High-Performance Mesh Networks NRT: Scalable Testbed for Next-Generation Mobile Wireless Networking Technologies CAREER: Survivable Hybrid Networks NR: Ad hoc Networking with Swarm Intelligence Army Research Lab CTA: Ad hoc Network Mangement and Ad hoc Networking with Directional Antenna ATIRP: Battlefield Network Management Army SBIR with Transtech Networks: Optical Switching Networks Army SBIR with Scalable Network Technologies: Bio-Inspired Protocols for Tactical Wireless Networks Army STTR with Scalable Network Technologies: Cyber Situational Awareness Bellcore (Telcordia Technologies): Active and Intelligent Network Control and Management Cisco: Coexistence of WiFi and LAA; Uplink OFDMA with Wi-Fi 6 MITRE: Controlling Information with Attribute-Based Encryption and Blockchain NASA Goddard Space Flight Center: The Space Information Networking Architecture for Future Science Missions Navy SBIR with Scalable Network Technologies: Topology Management for Directional Antenna-based Networks Navy STTR with Scalable Network Technologies: Degraded Synthetic Training NIST: A Software-Defined Radio Based Performance Measurement Platform for Wireless Networks RAND: Network Capacity Study of JTRS Scalable Network Technologies: Designing Simulation Models and Exercises in QualNet PhD Students Ehsan Memary Hang Chen Syed Ali Asif Yang Wu Former Students Abdullah Alnajim (PhD, 2024, King Saud University, Riyadh, Saudi Ariba) Yan-Ming Chiou (PhD, 2022, Samsung, San Jose, CA) Hao Guo (PhD, 2020, Northwestern Polytechnical University, Taicang Campus, China) Seyedmohammad Salehi (PhD, 2020, Voleon, Berkeley, CA) Marcos Portnoi (PhD, 2017, @sec, Austin, TX) Joshua Kirby (PhD, 2017, Microsoft, Redmond, WA) Wei Chen (PhD, 2017, Kwai (Kuaishou Technology), San Diego, CA) Zequn Huang (PhD, 2015, Meta, Menlo Park, CA) Varun Sharma (MS, 2015, EY, New York, NY) Hao Luan (MS, 2015, Qualtrics, Seattle, WA) Yang Guan (PhD, 2014, Google, Mountain View, CA) Ke Li (PhD, 2011, Akamai, Pasadena, CA) Narasimhan Ragavendran (MS, 2011, J.P. Morgan, New York, NY) Ilknur Aydin (PhD, 2010, Farmingdale State College, Long Island, NY) Justin Yackoski (PhD, 2009, BlueHalo, Rockville, MD) Xiaofeng Han (PhD, 2008, Roblox, San Mateo, CA) Xiang Cao (MS, 2007, Google, Venice, CA) Naveen Manicka (MS, 2007, Amazon, CA) Sonny Rajagopalan (PhD, 2006, Fidelity Investments, Waltham, MA) Ozcan Koc (MS, 2005, Turkey) Zhuochuan Huang (PhD, 2005, Coupang, Mountain View, CA) Chaiporn Jaikaeo (PhD, 2004, Kasetsart University, Thailand) Chavalit Srisathapornphat (PhD, 2004, Kasetsart University, Thailand) Girish Borkar (MS, Microsoft, WA) Weihua Wang (MS) Yusong Liu (MS) Yue Zhu (MS) Visitors Prof. Dong-Jun Lee, Korea Aerospace University, South Korea Prof. Ki-Il Kim, Gyeongsang National University, South Korea Prof. Yang Liu, Guangdong University of Technology, China Prof. Yongan Shu, Anhui University, China Prof. Shengxing Liu, Xiamen University, China Mr. Yan-ming Chiou, National Chung Cheng University, Taiwan Prof. Kuo-Feng Ssu, National Cheng Kung University, Taiwan Prof. Hewijin Jiau, National Cheng Kung University, Taiwan Dr. I-Chun Chao, National Taiwan University, Taiwan Prof. HyunGon Kim, Mokpo National University, South Korea Prof. Il-Soon Roh, Eulji University, South Korea Prof. You-Chiun Wang, National Sun Yat-Sen University, Taiwan Prof. Kihyun Pyun, Chonbuk National University, South Korea Prof. Yuh-Chung Lin, Tajen University, Taiwan Dr. De-Kai Liu, Quanta Computer, Taiwan Prof. Gihwan Cho, Chonbuk National University, South Korea Department of Computer and Information Sciences 101 Smith Hall  •  Newark, DE 19716  •  USA General: (302) 831-2712 Comments Legal Notices Accessibility Notice",
  "content_length": 5500,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:14"
}