{
  "name": "Chien-Ming Huang 0001",
  "homepage": "https://www.cs.jhu.edu/~cmhuang",
  "status": "success",
  "content": "Chien-Ming Huang's Website Chien-Ming Huang   黃健鳴 John C. Malone Assistant Professor Intuitive Computing Laboratory HCI@Hopkins | Robotics@Hopkins | AI@Hopkins Malone Center for Engineering in Healthcare Dept. of Computer Science, Johns Hopkins University chienming.huang @jhu.edu 410-516-4537 (unlikely to reach me) I am co-chairing the 2025 Johns Hopkins Research Symposium on Engineering in Healthcare: Human + AI: Redefining the Standard of Care in Medicine. Join us! I am recruiting PhD students to join my research group. In an effort to maintain a sustainable and fulfilling academic career, I prioritize student mentoring, teaching, and scientific inquiry when time conflicts occur. Prospective students interested in joining my group please read the notes at the end of this page. About Curriculum Vitae | Google Scholar | ORCiD My scientific work contributes to the fields of human-robot interaction (HRI), human-computer interaction (HCI), and robotics. The research directions I am currently pursuing include: Making robotic technology more accessible to people with diverse backgrounds. Understanding the long-term effects of human-robot interactions in real-world settings. Improving the quality of life for older adults using technology. Designing effective interaction strategies for AI systems to assist people. My research has been supported by NSF, NIH, NIST, Johns Hopkins Institute for Assured Autonomy (IAA), Applied Physics Laboratory, and Malone Center for Engineering in Healthcare. Advisees (PhD and Postdoc) 2021–nowKaitlynn Pineda (CS PhD) | CS Department fellow 2021–nowVictor Nikhil Antony (CS PhD) | 2025 HRI Pioneer 2022–nowShiye Cao (CS PhD) | 2022 CRA Outstanding Undergraduate Researcher Finalist | Co-advised by Anqi Liu 2025–nowLaura Fleig (CS PhD) | Percy Pierre fellow | Co-advised by Mathias Unberath 2025–nowJie Gao (Postdoc) | John C. Malone Postdoctoral Fellow | Co-advised by Ziang Xiao and Mark Dredze 2025-nowAmama Mahmood (Postdoc) | John C. Malone Postdoctoral Fellow | Co-advised by Ziang Xiao and Paul Yi 2023–2025 Tsung-Chi Lin (Postdoc) | John C. Malone Postdoctoral Fellow Now: New Jersey Institute of Technology 2020–2025 Amama Mahmood (CS PhD) | CS Department fellow Now: Johns Hopkins Malone Center for Engineering in Healthcare 2019–2024 Maia Stiber (CS PhD) | CS Department fellow | 2024 HRI Pioneer | Co-advised by Russ Taylor Now: Microsoft Research 2018–2023 Gopika Ajaykumar (CS PhD) | NSF GRFP | JHU Engineering/Nursing fellow | 2023 HRI Pioneer Now: Southwest Research Institute Publications I mainly publish at HRI, HCI (CHI, CSCW, IUI), and Robotics (ICRA, IROS, RSS) venues. My full publication list is available on Google Scholar. Here are some highlights: RSS'25Interruption Handling for Conversational Robots | pdf HRI'25\"See You Later, Alligator\": Impacts of Robot Small Talk on Task, Rapport, and Interaction Dynamics in Human-Robot Collaboration | pdf | Best paper award honorable mention CHI'25Voice Assistants for Health Self-Management: Designing for and with Older Adults | pdf RadiologyCare to Explain? AI Explanation Types Differentially Impact Physician Diagnostic Performance and Trust in AI | pdf IJHCSUser Interaction Patterns and Breakdowns in Conversing with LLM-Powered Voice Assistants | pdf IROS'22Modeling Human Response to Robot Errors for Timely Error Detection | pdf [More] Human-Robot Collaboration ArXivRobot Error Awareness Through Human Reactions: Implementation, Evaluation, and Recommendations | pdf HRI'25\"See You Later, Alligator\": Impacts of Robot Small Talk on Task, Rapport, and Interaction Dynamics in Human-Robot Collaboration | pdf | Best paper award honorable mention ArXiv\"You Might Like It\": How People Respond to Small Talk During Human-Robot Collaboration | pdf ACM THRIForging Productive Human-Robot Partnerships Through Task Training | pdf HRI'23\"What If It Is Wrong\": Effects of Power Dynamics and Trust Repair Strategy on Trust and Compliance in HRI | pdf HRI'23On Using Social Signals to Enable Flexible Error-Aware HRI | pdf IROS'22Modeling Human Response to Robot Errors for Timely Error Detection | pdf HRI'20See What I See: Enabling User-Centric Robotic Assistance Using First-Person Demonstrations | pdf HRI'16Anticipatory Robot Control for Efficient Human-Robot Collaboration | pdf Frontiers in PsychologyUsing Gaze Patterns to Predict Task Intent in Collaboration | pdf RSS'15Adaptive Coordination Strategies for Human-Robot Handovers | pdf Social Robots RSS'25Interruption Handling for Conversational Robots | pdf HRI'25Xpress: Generating Dynamic, Context-Aware Robot Facial Expressions Using Language Models | pdf IJSRSocial Robots for Sleep Health: A Scoping Review | pdf HRI'23Co-Designing with Older Adults, for Older Adults: Robots to Promote Physical Activity | pdf Science RoboticsImproving Social Skills in Children with ASD Using a Long-Term, In-Home Social Robot | pdf HRI'18Thinking Aloud with a Tutoring Robot to Enhance Learning | pdf HRI'17Give Me a Break! Personalized Timing Strategies to Promote Learning in Robot-Child Tutoring | pdf RSS'13Modeling and Evaluating Narrative Gestures for Humanlike Robots | pdf | Best paper award runner-up End-User Robot Programming HRI'24Alchemist: LLM-Aided End-User Development of Robot Applications | pdf IJHCSOlder Adults' Expectations, Experiences, and Preferences in Programming Physical Robot Assistance | pdf ACM Computing SurveyA Survey on End-User Robot Programming | pdf Robotics and Autonomous SystemsDesigning User-Centric Programming Aids for Kinesthetic Teaching of Collaborative Robots | pdf IUI'19PATI: A Projection-Based Augmented Table-Top Interface for Robot Programming | pdf Socially Aware Robot Navigation IROS'22Learning a Group-Aware Policy for Robot Navigation | pdf Frontiers in Robotics and AIEvaluation of Socially-Aware Robot Navigation | pdf | 2022 Outstanding Article, Editor's Picks ICRA'20Intent-Aware Pedestrian Prediction for Adaptive Crowd Navigation | pdf Human-AI Interaction RadiologyCare to Explain? AI Explanation Types Differentially Impact Physician Diagnostic Performance and Trust in AI | pdf ACM TiiSID.8: Co-Creating Visual Stories with Generative AI | pdf CSCW'24Designing for Appropriate Reliance: The Roles of AI Uncertainty Presentation, Initial User Decision, and User Demographics in AI-Assisted Decision-Making | pdf CSCW'23How Time Pressure from Different Phases of Decision-Making Influences Human-AI Collaboration | pdf IJHCSMitigating Knowledge Imbalance in AI-Advised Decision-Making Through Collaborative User Involvement | pdf CSCW'22Understanding User Reliance on AI in Assisted Decision-Making | pdf CHI'22Owning Mistakes Sincerely: Strategies for Mitigating AI Errors | pdf npj Digital MedicineExplainable Medical Imaging AI Needs Human-Centered Design: Guidelines and Evidence from a Systematic Review | pdf Conversational Voice Assistants CHI'25Voice Assistants for Health Self-Management: Designing for and with Older Adults | pdf IJHCSUser Interaction Patterns and Breakdowns in Conversing with LLM-Powered Voice Assistants | pdf ArXivSituated Understanding of Older Adults' Interactions with Voice Assistants: A Month-long In-home Study | pdf CSCW'24Gender Biases in Error Mitigation by Voice Assistants | pdf Exploratory Projects HRI'25The Design of On-Body Robots for Older Adults | pdf IROS'24Reducing Performance Variability and Overcoming Limited Spatial Ability: Targeted Training for Remote Robot Teleoperation ArXivAn Introduction to Causal Inference Methods for Observational Human-Robot Interaction Research | pdf ISMAR'23Active Engagement with Virtual Reality Reduces Stress and Increases Positive Emotions IUI'22Crowdsourcing Thumbnail Captions Using Time-Constrained Methods | pdf Teaching EN.601.493/693 Accessible Computing Fall 2025 EN.601.491/691 Human-Robot Interaction Spring 2022, Spring 2021, Spring 2020, Spring 2019, Spring 2018 EN.601.490/690 Introduction to Human-Computer Interaction Fall 2023, Fall 2022, Fall 2021, Fall 2020, Fall 2019, Fall 2018 Updates 09.25 Research award – New NIST project in collaboration with Tinglong Dai and Michael Oberst to investigate \"Evaluation of AI Benefits for Informed AI Adoption at Scale\" 07.25 I am co-editing a special issue on Understanding, Detecting and Repairing Errors and Failures in Human-Robot Interactions for the ACM Transactions on Human-Robot Interaction 03.25 I am co-organizing the ERR@HRI 2.0 Challenge on Multimodal Detection of Errors and Failures in Human-Robot Conversations 05.24 I am co-organizing the ERR@HRI 2024 ICMI Challenge on \"Multimodal Detection of Errors and Failures in Human-Robot Interactions\" 11.23 I am co-organizing an HRI'24 workshop on \"Social Signal Modeling in Human-Robot Interaction\" 11.23 Research award – New NIH P30 project in collaboration with Hao Su and Junxin Li to investigate \"Improving Mobility for Dementia Alleviation in Older Adults via AI-Powered Affordable Exosuits\" [Before 2023] 12.22 I am co-organizing a AAAI spring symposium on \"HRI in Academia and Industry: Bridging the Gap\" 06.22Research award – New NSF project in collaboration with Greg Hager to investigate \"Modeling Ad Hoc Collaboration on Complex Manipulation Tasks for Human-Robot Teams\" 02.22Research award – I received an NSF CAREER award to investigate end-user robot programming systems for everyday people, especially older adults who want to live independently at home. 10.21Research award – New NIH project in collaboration with Shameema Sikder (PI), Swaroop Vedula, and Greg Hager to investigate \"Artificial Intelligence Driven Tools for Objective Surgical Performance Improvement\" 05.20Humbled to receive Professor Joel Dean Excellence in Teaching Award 02.20Research award – New project in collaboration with I-Jeng Wang and Kapil Katyal to investigate \"Human-Centered Assured Autonomy\" supported by the JHU Institute for Assured Autonomy 02.19Rsearch award – New project to investigate \"Human-Robot Co-Navigation\" supported by APL 12.18Joined the editori",
  "content_length": 11775,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:13"
}