{
  "name": "Chih-Hao Luke Ong",
  "homepage": "https://www.cs.ox.ac.uk/luke.ong",
  "status": "success",
  "content": "Luke Ong | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyLuke OngLuke Ong Professor Luke Ong Professor of Computer ScienceLeaving date: 28th February 2024Themes:Programming LanguagesQuantumAutomated VerificationCompleted Projects:Pushdown Automata and Game Semanticsmore…See Also:Home pageInterestsMy research has mainly been in Semantics of Computation, which is concerned with the development and analysis of mathematical structures that model computation using ideas and tools from Mathematical Logic. More recently my research has tended to be motivated by problems of an algorithmic nature. Here is a summary in HTML.Selected PublicationsView AllManage publications Verifying Higher−Order Functional Programs with Pattern Matching Algebraic Data Types C.−H. Luke Ong and Steven J. Ramsay In Proceedings of the 38th ACM SIGACT−SIGPLAN Symposium on the Principles of Programming Languages (POPL '11). 2011. Details about Verifying Higher−Order Functional Programs with Pattern Matching Algebraic Data Types | BibTeX data for Verifying Higher−Order Functional Programs with Pattern Matching Algebraic Data Types | Download (pdf) of Verifying Higher−Order Functional Programs with Pattern Matching Algebraic Data Types The Safe Lambda Calculus William Blum and C.−H. Luke Ong In Logic Methods in Computer Science. Vol. 5. No. 1. 2009. Details about The Safe Lambda Calculus | BibTeX data for The Safe Lambda Calculus | DOI (10.2168/LMCS-5(1:3)2009) | Link to The Safe Lambda Calculus Symbolic Backwards Reachability Analysis for Higher−Order Pushdown Systems M. Hague and C.−H. L. Ong In FoSSaCS. 2007. Long Version (pdf) Details about Symbolic Backwards Reachability Analysis for Higher−Order Pushdown Systems | BibTeX data for Symbolic Backwards Reachability Analysis for Higher−Order Pushdown Systems | Download (pdf) of Symbolic Backwards Reachability Analysis for Higher−Order Pushdown Systems ActivitiesGame SemanticsDifferentiable and Probabilistic ProgrammingFoundations of Programming LanguagesHardware VerificationModel CheckingCompleted ProjectsPushdown Automata and Game SemanticsGAMESVerifying Properties of the ML Family of LanguagesEffective Validation of FirmwareMetacomputationHigher-order Constrained Horn ClausesPast StudentsMario Alvarez-PicalloToby Cathcart BurnYuanliang ChenNathan CorbynConrad Cotton-BarrattMaria  CraciunEmanuele D'OsualdoOliver GoldsteinDavid HopkinsAlex HornEgor IanovskiJerome JochemsAndrew Kenyon-RobertsJonathan KochemsDavid LandsbergGuanyan LiLihao LiangCarol MakThomas MattinsonRolf MorelRobin NeatherwayTim ReicheltDiptarko RoyMarcelo SousaAngus TaylerDominik WagnerYong XieChang YanHaoxuan  YinFabian ZaiserAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 2959,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:14"
}