{
  "name": "Chih-Jen Lin",
  "homepage": "https://www.csie.ntu.edu.tw/~cjlin",
  "status": "success",
  "content": "Welcome to Chih-Jen Lin's Home Page Welcome to Chih-Jen Lin's Home Page We are recruiting new students. Research Machine Learning: Algorithms and software for machine learning. Operations Research: Large-scale Nonlinear Optimization. We always welcome new students to join our lab. Software and research projects LIBSVM: a simple and easy-to-use support vector machines tool for classification (C-SVC, nu-SVC), regression (epsilon-SVR, nu-SVR), and distribution estimation. It includes a GUI for both classification and regression. Version 1.0 released in April 2000. Current Version: 3.36, May 2025. See software document published in ACM TIST: pdf, ps.gz, ACM digital lib. LIBLINEAR: a library for large linear classification. It is very suitable for document classification. Version 1.0 released in April 2007. Current Version: 2.49, May 2025. sparsekmeans: efficient kmeans implementations for clustering large-scale sparse data. Initial release: June 2025. See latest release via the link. LibMultiLabel: a library for multi-label classification. Initial release: April 2021. See latest release via the link. LIBMF: LIBMF: A matrix-factorization library for recommender systems. Version 1.0 released in September 2013. Current Version: 2.01, February 2015. LIBFFM: LIBFFM: A library for field-aware factorization machines. Version 1.0 released in Febryary 2015 Current Version: 1.0, February 2015. BSVM : a simple decomposition method for support vector machines for large classification. It has faster convergence in difficult cases. Version 1.0 released in January 2000. Current Version: 2.09, December 2018. NMF : a simple and easy-to-use MATLAB/Python code for Nonnegative Matrix Factorization. Version 1.0 released in October 2005. Current Version: 1.01, December 2005. TRON: Trust region Newton Method for large bound-constrained optimization, released June 1999. Other miscellaneous software Courses Deep learning algorithms and implementations, Fall 2025 Introduction to the theory of computation, Fall 2025 Numerical methods, Spring 2023 Optimization methods for deep learning, Spring 2023 Recent Papers Recent Talks Recent Awards and Recognition Research Group (FAQ for potential students) Experience and Education (Short CV, Full CV and publication list) Distinguished Professor, Department of Computer Science and and Information Engineering, National Taiwan University. August 2011-- (Assistant Professor, August 1998--2002, Associate Professor, 2002--2006, Professor, 2006--) Affiliated professor, MBZUAI, Abu Dhabi, UAE, December 2022-- Adjunct Professor, Graduate Institute of Networking and Multimedia ,  National Taiwan University. August 2006-- Ph.D., Department of Industrial and Operations Engineering , University of Michigan, September 1995--May 1998. M.S.E., Department of Industrial and Operations Engineering , University of Michigan, September 1995--December 1996. B.S. Department of Mathematics, National Taiwan University, October 1989--June 1993. Room 413, Department of Computer Science National Taiwan University Taipei, Taiwan, 106 Tel: (886) 2-3366-4923 Fax: (886) 2-2362-8167 cjlin@csie.ntu.edu.tw",
  "content_length": 3137,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:13"
}