{
  "name": "Chinya V. Ravishankar",
  "homepage": "http://www.cs.ucr.edu/~ravi",
  "status": "success",
  "content": "Chinya V. Ravishankar Professor Computer Science & Engineering Department 326 EBU-II Marlan & Rosemary Bourns College of Engineering University of California, Riverside, CA 92521 ravi@cs.ucr.edu Research My work has been in the areas of Databases, Networking, Security, and Distributed Systems. More recently, I have worked in the area of Intellectual History Work Experience Professor, Computer Science and Engineering, UC Riverside, 1999 to present Associate Dean, Bourns College of Engineering, UC Riverside, 2004 to 2021 Associate Dean for Graduate Education and Research, 2015 to 2021 Associate Dean, Undergraduate Education, 2004 - 2015 Research Professor, EECS Department, University of Michigan - Ann Arbor (prior to 1999) Selected Publications Publications Sorted (roughly) by Area Lab Affiliations The Database Laboratory Visualization and Intelligent Systems Lab The Networks and Communications Laboratory Ph.D. Students Graduated Payas Rajan (Databases, UCR) Yordanos Beyene (Networks, UCR) Reaz Uddin (Databases, UCR) Jonathan Dautrich (Databases, Security, UCR) Peng Wang (Databases, Networking, Security, UCR) Sandeep Gupta (Databases, UCR) Jinfeng Ni (Databases, UCR) Li Zhou (Security, UCR) Shanzhong Zhu (Databases, UCR) Saugat Manumdar (Security, UCR) Wei Wang (Networking, UCR) Dhananjay Kulkarni (Databases, UCR) David Thaler (Networking, U-Michigan) Nigel Hinds (Distributed Systems, U-Michigan) Ming-Ling Lo (Database Systems, U-Michigan) Wee-Keong Ng (Database Systems, U-Michigan) Yen-Min Huang (Distributed Systems, U-Michigan) Yilin Zhao (Distributed Systems, U-Michigan) Rong N. Chang (Distributed Systems, U-Michigan) Other Stuff I've Done First Paper on \"Snoopy\" Caching I co-authored the first paper to describe the \"write-once\" multiprocessor cache management technique which later became known as snooping. I developed this idea jointly with Jim Goodman in 1981/1982, and implemented it as a class project for a VLSI course in Winter'82 that Randy Katz taught at Wisconsin as an Assistant Professor. Subsequently, Jim Goodman and I wrote a paper which appeared in COMPCON, February 1983 describing the idea and its implementation. Rendezvous Hashing (alternative to Consistent Hashing) David Thaler and I invented the Rendezvous Hashing technique for distributed k-agreement. This method subsumes the goals of consistent hashing, as a special case for k = 1. This work is also earlier than consistent hashing, is a much simpler algorithm, and balances loads much better when failures are common. Intellectual History of Sanskrit Scholarship in 19th Century India I recently completed a book with the title \"Sons of Sarasvati: Late exemplars of the Indian Intellectual Tradition\", which makes a contribution to the intellectual history of India, using as backdrop the scholarly and professional lives of several extraordinary scholars from 19-century Mysore. It was published by SUNY Press, having already appeared in the Hedgehog and Fox Academic Series, published in India by Permanent Black and Ashoka University. I was elected an Associate Fellow of the Royal Historical Society. Other Information Curriculum Vitae (probably old) Teaching Current quarter: Advanced Databases (CS 236) Click here for the course web page This page is currently under construction",
  "content_length": 3296,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:22"
}