{
  "name": "Chin-Yu Huang",
  "homepage": "http://www.cs.nthu.edu.tw/~cyhuang",
  "status": "success",
  "content": "Chin-Yu Huang Chin-Yu Huang (é»æ ¶è²) [ Expertise ] [ Publications ] [ Teaching ] [ Students ] [ Other Links ] ã ã Dr. Chin-Yu Huang, born in Changhua, Taiwan, is currently a Professor in the Department of Computer Science at National Tsing Hua University, Hsinchu, Taiwan. He passed the National High Examination given by the Ministry of Examination for civil service in the category of computer engineer and the National High Examination given by the Ministry of Examination for professionals and technologists in the category of computer engineer. Additionally, he was also certified as an Information Processing Engineer by the Industry Development Bureau, Ministry of Economic Affairs, Executive Yuan. He enrolled in the Chinese Army as a second lieutenant for the mandatory military service (two years). He received the MS (1994) and the Ph.D. (2000) in Electrical Engineering from National Taiwan University, Taipei. He had worked in the industry for more than 12 years and has extensive experience in commercial software development and financial payment-system design. From 1990 to 1999, he worked at Taiwan power company, Bureau of Standards, Metrology & Inspection (formerly National Bureau of Standards), and Bank of Taiwan. He was a senior software engineer at Taiwan Semiconductor Manufacturing Company (tsmc) from 1999 to 2000. Before joining National Tsing Hua University in 2003, he was a division chief of the Central Bank of the Republic of China (Taiwan). His research and development interests include software engineering (particularly in software reliability, software testing, and software metrics), software project management, software testability, fault tree analysis, Markov analysis, etc. He was included in the 2007 and 2009 Editions of Marquis Whoâs Who in the World. Dr. Huang received the Ta-You Wu Memorial Award from the National Science Council of Taiwan in 2008. He received an Honorable Mention Best Paper Award at the 2010 IEEE International Conference on Industrial Engineering and Engineering Management (IEEM 2010). In 2009, Dr. Huang was ranked at the 14th place of top scholars in Systems and Software Engineering worldwide between 2002 and 2006 by the Journal of Systems and Software based on his research on software reliability, software testing, and software metrics. In 2010, he was evaluated and ranked at the 7th place in 2004-2008 and the 8th place in 2003-2007. He was a Lead Guest Editor for Journal of Applied Mathematics Special Issue in 2013 and for Advances in Software Engineering Special Issue in 2012. Dr. Huang has been on the editorial board of Scientific Programming (Science Citation Index Expanded) since 2017 and the editorial board of Journal of Information Science and Engineering (Science Citation Index Expanded) since 2016. He is currently serving as an associate editor for the IEEE Transactions on Reliability and Journal of Information Science and Engineering. é»æ ¶è²åå£«ï¼åºçæ¼å°ç£å½°åç¸£ï¼æ¾æå ¨åæ§å ¬åäººå¡é«ç­èè©¦é»å­å·¥ç¨è·ç³»è¨ç®æ©å·¥ç¨ç§èè©¦åæ ¼èå°éè·æ¥­æ¨æè¡äººå¡é«ç­èè©¦è³è¨æå¸«èè©¦åæ ¼ï¼é æç¶æ¿é¨å·¥æ¥­å±æé ç¼ä¹è³è¨æå¸«å·ç §ãä»å¨å°ç£æäºå¹´ç¾©åå½¹ é å®æ¼å®è­éå ­çµï¼æ­·ç¶é¸è»å°å°éä¿¡æé·ãæç·é»éä¿¡å®ç­è·åãä»å¤§å­¸æå°±è®æ¼æ°ç«¹çåç«äº¤éå¤§å­¸ï¼ç¾å¾èªåç«å°ç£å¤§å­¸é»æ©å·¥ç¨å­¸ç ç©¶æ(è¨ç®æ©ç§å­¸çµ)ç²å¾ç¢©å£«(1992~1994)ååå£«(1995~2000)å­¸ä½ãé»åå£«å¨1990å¹´è³2003å¹´éæ¾ æåæ¼å°ç£é»åå ¬å¸ãå°ç£éè¡ç¸½è¡è³è¨å®¤ãå°ç© é»ãä¸­å¤®éè¡è³è¨å®¤(è¦ååè¨­è¨ç§ç§é·)ç­ç­ãä»å¨å¤®è¡æåæéï¼æ¾å¨2001å¹´å¥æ´¾åå æ±åäºåå®¶ä¸­å¤®éè¡ç¸½è£è¯åæ(SEACEN)èåéæ¸ ç®éè¡(BIS)æ¯ä»æ¸ ç®ç³»çµ±å§å¡æ(CPSS)æ¼å°å°¼å·´éå³¶æèè¾¦ä¹éè¦æ¯ä»ç³»çµ±æ ¸å¿æºå(SIPS)å®æ¹æè­°ãé»åå£«æ¼2003å¹´2æé²å ¥åç«æ¸ è¯å¤§å­¸è³è¨å·¥ç¨å­¸ç³»ï¼ç®åæ¯è©²ç³»å°ä»»ææï¼ä»çç ç©¶é åå æ¬äºæç¨æ·±åº¦å­¸ç¿æ¼è»é«å·¥ç¨ä¹çè«èæç¨(ç¹å¥å¨è»é«å¯é åº¦ãè»é«æ¸¬è©¦ãè»é«åº¦é)ãè»é«å°æ¡ç®¡çãè»é«å¯æ¸¬æ§ãæ éæ¨¹åæèé¦¬å¯å¤«åæç­ãé»åå£« æ¾å¨2008å¹´ç²å¾åç§æå³å¤§ç·å çç´å¿µçèå¨IEEM 2010åéæè­°ä¸ç²å¾æä½³è«æçä½³ä½ãé»åå£«æ¼2009å¹´ç²Elsevieræåºçä¹Journal of Systems and Softwareåéæåè©é¸çº2002-2006å¹´éç³»çµ±èè»é«å·¥ç¨é å ç¬¬åååä¸çé å°å­¸è ãé»åå£«æ¼2010å¹´ååº¦ç²Journal of Systems and Softwareåéæåè©é¸çºæ¼2003-2007å¹´é ååç¬¬å «åï¼è2004-2008å¹´éååç¬¬ä¸åä¹ä¸çé å°å­¸è ãé»åå£«ç®åæ¯IEEE Transactions on ReliabilityèJournal of Information Science and Engineeringåéæåä¹å¯ä¸»ç·¨ã Contact informationï¼ Department of Computer Science,  National Tsing Hua University, No. 101, Section 2, Kuang Fu Road, Hsinchu, Taiwan 30013. Tel.ï¼886-3-5742972, Faxï¼886-3-5731201, E-mailï¼cyhuang@cs.nthu.edu.tw 30013æ°ç«¹å¸å å¾©è·¯äºæ®µ101è åç«æ¸ è¯å¤§å­¸è³è¨å·¥ç¨å­¸ç³»(å°éé¤¨634å®¤) æ¸ è¯å¤§å­¸è»é«å·¥ç¨å¯¦é©å®¤æ­¡è¿æèè¶£æ¼ï¼Deep Learning in Software Reliability Engineering, Software Quality Assurance, and Software TestingãService-Oriented Architecture and Designç­ç ç©¶é åä¹å¤¥ä¼´å å ¥ã",
  "content_length": 5349,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:16"
}