{
  "name": "Ching-Kuang Shene",
  "homepage": "https://www.mtu.edu/cs/department/faculty-staff/faculty/shene",
  "status": "success",
  "content": "Ching-Kuang Shene | Computer Science | Michigan Tech Skip to page content Skip to footer navigation Computer Science Michigan Tech Computing Computer Science Faculty Directory Ching-Kuang Shene Ching-Kuang Shene Contact Ching-Kuang Shene shene@mtu.edu Download CV Professor Emeritus, Computer Science PhD, Computer Science, John Hopkins University, 1992 Links of Interest Faculty Webpage Computer Graphics, Visualization and Geometric Com Concurrent Computing Research Group Area of Expertise Geometric/solid Modeling Computer-aided Design Computer Graphics Computational Geometry Recent Publications Hongfeng Yu, Chaoli Wang, Ching-Kuang Shene, and Jacqueline H. Chen, \"Hierarchical Streamline Bundles for Visualizing 2D Flow Fields\", IEEE VisWeek Posters 2010, Salt Lake City, UT, Oct 2010. Ching-Kuang Shene, \"Selected Well-Known Problems\", third revised edition, Scholars Book Co., Taipei, Taiwan, 2010. Miklo Lysenko, Roshan D'Souza and Ching-Kuang Shene, \"Improved Binary Space Partition Merging\", CAD, Vol. 40 (2009), No. 12 (December), pp. 1113-1120. Tin-Tin Yu, John Lowther and Ching-Kuang Shene, \"A Tool for Demonstrating the Interaction among Lighting/Material Parameters and Potential Problems in Polygon-Based Rendering\", Journal of Computing Sciences in Colleges, Vol. 23 (2007), No. 1, pp. 45-53. Bryan Neperud, John Lowther and Ching-Kuang Shene, \"Visualizing and Animating the Winged-Edge Data Structure\", Computers & Graphics, Vol. 31 (2007), No. 6 (December), pp. 877-886. Ching-Kuang Shene, \"Digital Cameras: Concepts, Techniques, and Theory\", Scholars Book, Co., Taipei, Taiwan, May, 2007 (766 pages). Tin-Tin Yu, John Lowther and Ching-Kuang Shene, \"Photon Mapping Made Easy\", ACM 36th Annual SIGCSE Technical Symposium, St. Louis, Missouri, February 23-27, 2005, pp. 201-205. ©",
  "content_length": 1801,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:21"
}