{
  "name": "Chinmaya Misra",
  "homepage": "https://ksca.kiit.ac.in/profiles/chinmaya-misra",
  "status": "success",
  "content": "Chinmaya Misra – School of Computer Applications Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Chinmaya Misra Chinmaya Misra Chinmaya Misra Associate ProfessorDr Chinmaya Misra. He is a Life Member of the Indian Science Congress. He is the Associate Professor in the School Of Computer Applications, KIIT Deem to be University, Bhubaneswar, India. He is working in Energy Saving Mechanism in WiMaX and Image Processing and Queuing System, Cloud Computing and Social Networking. He has completed his MCA from North Bengal University in 1999 and received his MS degree from School of Information Technology, IIT Kharagpur in [2008]. He completed his PhD from KIIT Deemed to be University from School of Computer Science and Enginneringin in [2014]. In [1999] he started his professional career as [Programming Assistant] in IIT Kharagpur and joined as lecturer in KIIT Deemed to be university as [Lecturer] in 2008. He has published many research works in reputed journals and conferences. Profile LinksEmail :[email protected]Scopus Id :35753675600Google Scholar :https://scholar.google.com/citations?user=_mmOoQIAAAAJ&hl=en Social LinksProfileRecent PublicationsProfileEducational QualificationPhDMembershipsIndian Science CongressRecent PublicationsJournals/Conferences :1.Pani, L., Misra, C., Abdullah, A. A., & Dash, S. R. (2019, November). Energy saving mechanism in fog assisted IoT enabled health monitoring framework. In Journal of Physics: Conference Series (Vol. 1372, No. 1, p. 012050). IOP Publishing. 2.Barik, R. K., Dubey, H., Mankodiya, K., Sasane, S. A., & Misra, C. (2019). GeoFog4Health: a fog-based SDI framework for geospatial health big data analysis. Journal of Ambient Intelligence and Humanized Computing, 10(2), 551-567. 3. Barik, R. K., Misra, C., Lenka, R. K., Dubey, H., & Mankodiya, K. (2019). Hybrid mist-cloud systems for large scale geospatial big data analytics and processing: opportunities and challenges. Arabian Journal of Geosciences, 12(2), 32. 4.Dash, S. R., Sen, A., Hassan, S. S., Roy, R., Misra, C., & Singh, K. N. (2018). Steganography Technique to Prevent Data Loss by Using Boolean Functions. In Artificial Intelligence and Evolutionary Computations in Engineering Systems (pp. 263-270). Springer, Singapore. 5.Barik, R., Dubey, H., Sasane, S., Misra, C., Constant, N., & Mankodiya, K. (2017, July). Fog2fog: augmenting scalability in fog computing for health GIS systems. In 2017 IEEE/ACM International Conference on Connected Health: Applications, Systems and Engineering Technologies (CHASE) (pp. 241-242). IEEE. 6. Misra, C., & Goswami, V. (2015). Analysis of power saving class II traffic in IEEE 802.16 E with multiple sleep state and balking. Foundations of computing and decision sciences, 40(1), 53-66. 7. Goswami, V., & Misra, C. (2013). Discrete-time modelling for performance analysis and optimisation of uplink traffic in IEEE 802.16 networks. International Journal of Communication Networks and Distributed Systems, 10(3), 243-257. 8. Misra, C., & Swain, P. K. (2011, February). An automated HSV based text tracking system from complex color video. In International Conference on Distributed Computing and Internet Technology (pp. 255-266). Springer, Berlin, Heidelberg. 9.Misra, C., & Swain, P. K. (2010, February). Performance analysis of finite buffer queueing system with multiple heterogeneous servers. In International Conference on Distributed Computing and Internet Technology (pp. 180-183). Springer, Berlin, Heidelberg. 10.Misra, C., & Sural, S. (2006, January). Content based image and video retrieval using embedded text. In Asian Conference on Computer Vision (pp. 111-120). Springer, Berlin, Heidelberg. sachi2020-05-11T15:23:07+05:30 Page load link Go to Top",
  "content_length": 3794,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:24"
}