{
  "name": "Chirag Shah 0001",
  "homepage": "https://chiragshah.org",
  "status": "success",
  "content": "Dr. Chirag Shah --> I'm Professor in Information School, Adjunct Professor in Paul G. Allen School of Computer Science & Engineering, and Adjunct Professor in Human Centered Design & Engineering (HCDE) at University of Washington (UW). I am the Founding Director of InfoSeeking Lab and the Founding Co-Director of RAISE, a Center for Responsible AI. I am a Research Associate, University of Pretoria in South Africa and a Visiting Professor, Peking University in China. I also work closely with industrial research labs on cutting-edge problems, typically as a visiting researcher. The most recent engagements included Amazon, Getty Images, Microsoft Research, and Spotify. I am a Distinguished Member of Association of Computing Machinery (ACM) as well as Association for Information Science & Technology (ASIS&T). My research involves building and studying intelligent information access systems, focusing on task-oriented search, proactive recommendations, and conversational systems. I am deeply engaged in work with Agentic AI, specifically in information access using large language models (LLMs). In addition to creating AI-driven information access systems that provide more personalized reactive and proactive recommendations, I am also focusing on making such systems robust, reliable, and trustworthy. I received my PhD in Information Science from University of North Carolina (UNC) at Chapel Hill. I hold an MTech, Computer Science & Engineering from Indian Institute of Technology (IIT) Madras, India and an MS, Computer Science from University of Massachusetts (UMass) Amherst. I have published and talked extensively on topics related to search and recommendation, fairness in ML, and user-centered AI. I have served as a consultant to the United Nations Data Analytics on various Data Science projects involving social and political issues, peacekeeping, climate change, and energy. I'm on a mission to not only develop and diagnose AI systems, but also educate the world about benefits and harms of AI. In addition to publishing numerous scholarly articles and giving talks around the world, I have developed several systems, datasets, and algorithms for intelligent systems. I have authored several books, including textbooks on Data Science and Machine Learning. I am frequently interviewed by various media sources for comments on issues ranging from search engines and recommender systems to AI and ML advancements and society. I am the Founding Editor-in-Chief for Information Matters. Potential students: Check out InfoSeeking Lab, RAISE, my research themes, currently funded projects, and a list of my current and past students. Read how to communicate with a professor and my advice before sending me a message. For collaboration and consultancy: I value my time (and yours) a lot, so please do your research about what my skills and your needs are to assess the fit. My CV or LinkedIn profile may be good starting points. Published Books",
  "content_length": 2963,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:22"
}