{
  "name": "Chirag Jain",
  "homepage": "https://at-cg.github.io",
  "status": "success",
  "content": "Chirag Jain Chirag JainAssistant Professor HOME NEWS PROJECTS PUBLICATIONS TEACHING SOFTWARE BLOGS TEAM JOIN US Posts Chirag Jain Cancel Chirag Jain Assistant Professor DBT/Wellcome IA Intermediate Fellow Department of Computational and Data Sciences Indian Institute of Science CV My research lab develops efficient computational algorithms for data-intensive problems in biology. In response to challenging computational problems, we design solutions that are provably-good, scalable in practice, and useful for life scientists to draw new insights from high-throughput data. Prior to my appointment at IISc, I was working as a post-doctoral fellow with Adam Phillippy at the National Institutes of Health. In 2019, I received Ph.D. at Georgia Tech, where I was advised by Srinivas Aluru. I did my bachelors in computer science at Indian Institute of Technology Delhi. I'm a recipient of the Pratiksha Trust Young Investigator Award and Georgia Tech College of Computing Dissertation Award. I am looking for bright students and postdocs to join my lab. Interested folks are welcome to contact me. See projects and publications to learn about our work.Research Interests • Bioinformatics / computational biology • Algorithms for genome sequencing • Applied graph / combinatorial / discrete algorithms • Algorithms design and analysis • High performance computingTeaching [2025 January] DS202: Algorithmic Foundations of Big Data Biology [2025 January] NPTEL- Algorithms in Computational Biology and Sequence Analysis [2022 August] DS221: Introduction to Scalable Systems (jointly with Sathish Vadhiyar, Matthew Jacob)Selected Publications Weighted minimizer sampling improves long read mapping C Jain, A Rhie, H Zhang, C Chu, B Walenz, S Koren, A Phillippy. ISMB 2020 On the complexity of sequence to graph alignment C Jain, ⇔ H Zhang, Yu Gao, S Aluru. RECOMB 2019 Strain-level metagenomic assignment and compositional estimation for long reads with MetaMaps A Dilthey, C Jain, S Koren, A Phillippy. Nature Comm. 2019 Accelerating sequence alignment to graphs C Jain, S Misra, H Zhang, A Dilthey, S Aluru. IEEE IPDPS 2019 (GT news) High throughput ANI analysis of 90K prokaryotic genomes reveals clear species boundaries C Jain, L Rodriguez, A Phillippy, K Konstantinidis, S Aluru. Nature Comm. 2018 (GT news) A fast approximate algorithm for mapping long reads to large reference databases C Jain, A Dilthey, S Koren, S Aluru, A Phillippy. RECOMB 2017Selected Awards • IIT Delhi Graduates of Last Decade (GOLD) Award 2024 • India Alliance Intermediate Fellowship Award 2024 • NERSC HPC Achievement Award 2022 • Pratiksha Trust Young Investigator Award 2020 • Georgia Tech College of Computing Dissertation Award 2020 • Best Poster Award RECOMB 2019 • ACM Supercomputing Reproducibility Award 2016 • NVIDIA Award for Best Paper using GPU Technologies IEEE HiPC 2014 Tags Sequence Alignment WGSTagsSequence Alignment WGS",
  "content_length": 2920,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:21"
}