{
  "name": "Cho-Jui Hsieh",
  "homepage": "http://web.cs.ucla.edu/~chohsieh",
  "status": "success",
  "content": "Cho-Jui Hsieh Cho-Jui Hsieh I am an associate professor of Computer Science at UCLA and a research scientist at Google. I was a Ph.D. student at UT Austin working with Prof. Inderjit Dhillon. I received my master degree in National Taiwan University under supervision of Prof. Chih-Jen Lin. Before joining UCLA, I have worked as an Assistant Professor at UC Davis Computer Science and Statistics for three years, and was a visiting scholar in Google since summer 2018. I am interested in developing new algorithms and optimization techniques for large-scale machine learning problems. Currently, I am working on developing new machine learning models as well as improving the model size, training speed, prediction speed, and robustness of popular (deep learning) models. Email: chohsieh@cs.ucla.edu Office: EVI 482 Curriculum Vitae Google Scholar Profile News Check out my book Adversarial Robustness for Machine Learning co-authored with Dr. Pin-Yu Chen. Selected Awards Frontiers of Science Award, 2023 Okawa Research Award, 2021 Outstanding Paper Award, ICLR 2021 Google Research Scholar Award, 2021 NSF Career Award, 2021 Samsung AI Researcher of the Year, 2020 Best paper award honorable mention, Recsys 2020 Best paper award candidate, ICDM 2019 Best student paper award finalist, SC 2019 Best paper award, ICPP 2018 Best paper finalist, AISec 2017 Best paper award, ICDM 2012 Best paper award, KDD 2010 IBM PhD fellowship, 2013-2015 Slides and Tutorials Tutorial on Neural Network Verification [website] Recent Advances in Neural Architecture Search [slides and video] PhD Students Ching-Yuan Bai Justin Cui Chengdi Cao (Co-advised with Jason Cong) Lucas Tecot (Co-advised with Quanquan Gu) Jui-Nan Yen Yuanhao Ban Yunqi Hong (Co-advised with Neil Lin) Sohyun An Ramnath Kumar Yihang Chen Former PhD Students Li-Cheng Lan Zhouxing Shi (Assistant Professor, UC Riverside) Yihan Wang (Mistral AI) Ruochen Wang (OpenAI) Yue Kang (Miscrosoft) Yuanhao Xiong (Meta) Xiangning Chen (Co-founder, Converge Lab -> OpenAI) Huan Zhang (Assistant Professor, UIUC) Patrick H. Chen (Assistant Professor, Binghamton University) Xuanqing Liu (Amazon) Lifeng Wei (Amazon) Qin Ding (Meta) Minhao Cheng (Assistant Professor, Penn State University) Liwei Wu (LinedIn) Yao Li (Assistant Professor, UNC Chapel Hill) Puyudi Yang (Meta) Franco Liang (LinkedIn)",
  "content_length": 2343,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:27"
}