{
  "name": "Chowdhury Farhan Ahmed",
  "homepage": "https://du.ac.bd/body/faculty_details/CSE/1770",
  "status": "success",
  "content": "Faculty Members Details :: University of Dhaka Department of Computer Science and Engineering Faculty Members Details Home Faculty Members Details Dr. Chowdhury Farhan Ahmed (Professor) Department of Computer Science and Engineering Education Experience Research Activities Membership Publication Award Contact Degree Name Group/Major Subject Board/Institute Country Passing Year Ph.D. Computer Engineering Kyung Hee University South Korea 2010 Masters Computer Science University of Dhaka Bangladesh 1999 Bachelor Computer Science University of Dhaka Bangladesh 1998 Title Organization Location From Date To Date Professor University of Dhaka Department of CSE 21, Jun 2016 Currently Working Postdoctoral Research Fellow University of Strasbourg France 21, May 2013 12-05-2015 Associate Professor University of Dhaka Department of CSE 14, Jan 2012 20-06-2016 Assistant Professor University of Dhaka Department of CSE 15, Mar 2007 13-01-2012 Lecturer University of Dhaka Department of CSE 22, Apr 2004 14-03-2007 Lecturer University of Dhaka Institute of Information Technology 23, Mar 2003 21-04-2004 Research Interest Subject Description Research Interest (Goal, Target Indicator) Data Mining Knowledge Discovery Machine Learning Project/Research Supervision Level of Study Title Supervisor Co-Supervisor(s) Name of Student(s) Area of Research Current Completion No project/research supervision is found Project/Research Work Subject Project Name Source of Fund From Date To Date Collaboration No project/research work is found Invited Talk SL Invited Talk No invited talk is found SL Collaboration & Membership Name Type Membership Year Expire Year No Collaboration & Membership is found Journal Article 1 Md Mahmudur Rahman, Chowdhury Farhan Ahmed and Carson Kai-Sang Leung : Mining weighted frequent sequences in uncertain databases., Information Sciences (impact factor:5.524) , vol.479 , no.April 2019 , pp.76-100 , 2019 . View More 2 Sabit Anwar Zahin, Chowdhury Farhan Ahmed and Tahira Alam : An effective method for classification with missing values., Applied Intelligence (impact factor:2.882) , vol.48 , no.Number 1, January 2018 , pp.3209-3230 , 2018 . View More 3 Sayma Akther, Md. Rezaul Karim, Md. Samiullah and Chowdhury Farhan Ahmed : Mining non-redundant closed flexible periodic patterns., Engineering Applications of Artificial Intelligence (impact factor:3.526) , vol.69 , no.March 2018 , pp.1-23 , 2018 . View More 4 Md. Rezaul Karim, Michael Cochez, Oya Deniz Beyan, Chowdhury Farhan Ahmed and Stefan Decker : Mining maximal frequent patterns in transactional databases and dynamic data streams: A spark-based approach., Information Sciences (impact factor:5.524) , vol.432 , no.March 2018 , pp.278-300 , 2018 . View More 5 Tahrima Hashem, Md. Rezaul Karim, Md. Samiullah and Chowdhury Farhan Ahmed : An efficient dynamic superset bit-vector approach for mining frequent closed itemsets and their lattice structure., Expert Systems with Applications (impact factor:4.292) , vol.67 , no.January 2017 , pp.252-271 , 2017 . View More 6 Ashis Kumar Chanda, Chowdhury Farhan Ahmed, Md. Samiullah and Carson K. Leung : A new framework for mining weighted periodic patterns in time series databases., Expert Systems with Applications (impact factor:4.292) , vol.79 , no.August 2017 , pp.207-224 , 2017 . View More 7 José Hernández-Orallo, Adolfo Martínez Usó, Ricardo B. C. Prudêncio, Meelis Kull, Peter A. Flach, Chowdhury Farhan Ahmed and Nicolas Lachiche : Reframing in context: A systematic approach for model reuse in machine learning., AI Communications (impact factor:0.765) , vol.29 , no.5 , pp.551-566 , 2016 . View More 8 Akiz Uddin Ahmed, Chowdhury Farhan Ahmed, Md. Samiullah, Nahim Adnan and Carson Kai-Sang Leung : Mining interesting patterns from uncertain databases., Information Sciences (impact factor:5.524) , vol.354 , no.1 August 2016 , pp.60-85 , 2016 . View More 9 Ashis Kumar Chanda, Swapnil Saha, Manziba Akanda Nishi, Md. Samiullah and Chowdhury Farhan Ahmed : An efficient approach to mine flexible periodic patterns in time series databases., Engineering Applications of Artificial Intelligence (impact factor:3.526) , vol.44 , no.September 2015 , pp.46-63 , 2015 . View More 10 Anna Fariha, Chowdhury Farhan Ahmed, Carson K. Leung, Md. Samiullah, Suraiya Pervin and Longbing Cao : A new framework for mining frequent interaction patterns from meeting databases., Engineering Applications of Artificial Intelligence (impact factor:3.526) , vol.45 , no.October 2015 , pp.103-118 , 2015 . View More 11 Chowdhury Farhan Ahmed, Nicolas Lachiche, Clément Charnay, Soufiane El Jelali and Agnès Braud : Flexible propositionalization of continuous attributes in relational data mining., Expert Systems with Applications (impact factor:4.292) , vol.42 , no.Number 1, January 2015 , pp.7698-7709 , 2015 . View More 12 Md. Samiullah, Chowdhury Farhan Ahmed, Anna Fariha, Md. Rafiqul Islam and Nicolas Lachiche : Mining frequent correlated graphs with a new measure., Expert Systems with Applications (impact factor:4.292) , vol.41 , no.Number 1, January 2014 , pp.1847-1863 , 2014 . View More 13 Tahrima Hashem, Chowdhury Farhan Ahmed, Md. Samiullah, Sayma Akther, Byeong-Soo Jeong and Seokhee Jeon : An efficient approach for mining cross-level closed itemsets and minimal association rules using closed itemset lattices., Expert Systems with Applications (impact factor:4.292) , vol.41 , no.Number 1, January 2014 , pp.2914-2938 , 2014 . View More 14 Manziba Akanda Nishi, Chowdhury Farhan Ahmed, Md. Samiullah and Byeong-Soo Jeong : Effective periodic pattern mining in time series databases., Expert Systems with Applications (impact factor:4.292) , vol.40 , no.Number 1, January 2013 , pp.3015-3027 , 2013 . View More 15 Chowdhury Farhan Ahmed, Syed Khairuzzaman Tanbeer, Byeong-Soo Jeong, Young-Koo Lee and Ho-Jin Choi : Single-pass incremental and interactive mining for weighted frequent patterns., Expert Systems with Applications (impact factor:4.292) , vol.39 , no.Number 1, January 2012 , pp.7976-7994 , 2012 . View More 16 Chowdhury Farhan Ahmed, Syed Khairuzzaman Tanbeer, Byeong-Soo Jeong and Ho-Jin Choi : Interactive mining of high utility patterns over data streams., Expert Systems with Applications (impact factor:4.292) , vol.39 , no.Number 1, January 2012 , pp.11979-11991 , 2012 . View More 17 Chowdhury Farhan Ahmed, Syed Khairuzzaman Tanbeer, Byeong-Soo Jeong and Young-Koo Lee : HUC-Prune: an efficient candidate pruning technique to mine high utility patterns., Applied Intelligence (impact factor:2.882) , vol.34 , no.Number 1, February 2011 , pp.181-198 , 2011 . View More 18 Chowdhury Farhan Ahmed, Syed Khairuzzaman Tanbeer, Byeong-Soo Jeong and Ho-Jin Choi : A framework for mining interesting high utility patterns with a strong frequency affinity., Information Sciences (impact factor:5.524) , vol.181 , no.Number 1, January 2011 , pp.4878-4894 , 2011 . View More 19 Chowdhury Farhan Ahmed, Syed Khairuzzaman Tanbeer, Byeong-Soo Jeong and Young-Koo Lee : An Efficient Algorithm for Sliding Window-Based Weighted Frequent Pattern Mining over Data Streams., IEICE Transactions (impact factor:0.63) , vol.92-D , no.Number 1, January 2009 , pp.1369-1381 , 2009 . View More 20 Syed Khairuzzaman Tanbeer, Chowdhury Farhan Ahmed, Byeong-Soo Jeong and Young-Koo Lee : Efficient single-pass frequent pattern mining using a prefix-tree., Information Sciences (impact factor:5.524) , vol.179 , no.Numbers 1-2, January 2009 , pp.559-583 , 2009 . View More 21 Syed Khairuzzaman Tanbeer, Chowdhury Farhan Ahmed, Byeong-Soo Jeong and Young-Koo Lee : Sliding window-based frequent pattern mining over data streams., Information Sciences (impact factor:5.524) , vol.179 , no.Numbers 1-2, January 2009 , pp.3843-3865 , 2009 . View More 22 Chowdhury Farhan Ahmed, Syed Khairuzzaman Tanbeer, Byeong-Soo Jeong and Young-Koo Lee : Efficient Tree Structures for High Utility Pattern Mining in Incremental Databases., IEEE Transactions on Knowledge and Data Engineering (impact factor:2.775) , vol.21 , no.Number 1, January 2009 , pp.1708-1721 , 2009 . View More 23 Syed Khairuzzaman Tanbeer, Chowdhury Farhan Ahmed, Byeong-Soo Jeong and Young-Koo Lee : Mining Regular Patterns in Transactional Databases., IEICE Transactions (impact factor:0.63) , vol.91-D , no.Number 1, January 2008 , pp.2568-2577 , 2008 . View More 24 Chowdhury Farhan Ahmed, Syed Khairuzzaman Tanbeer, Byeong-Soo Jeong and Young-Koo Lee : Handling Dynamic Weights in Weighted Frequent Pattern Mining., IEICE Transactions (impact factor:0.63) , vol.91-D , no.Number 1, January 2008 , pp.2578-2588 , 2008 . View More Conference Proceedings 1 Sabrina Zaman Ishita, Chowdhury Farhan Ahmed, Carson K. Leung and Calvin H. S. Hoi \"Mining Regular High Utility Sequential Patterns in Static and Dynamic Databases..\" 13th IMCOM 2019 , pp. 897-916. Phuket, Thailand: Springer, 2019 . View More 2 Jesan Ahammed Ovi, Chowdhury Farhan Ahmed, Carson K. Leung and Adam G. M. Pazdor \"Mining Weighted Frequent Patterns from Uncertain Data Streams..\" 13th IMCOM 2019 , pp. 917-936. Phuket, Thailand: Springer, 2019 . View More 3 Fariha Moomtaheen Upoma, Salsabil Ahmed Khan, Chowdhury Farhan Ahmed, Tahira Alam, Sabit Anwar Zahin and Carson K. Leung \"Discovering Correlation in Frequent Subgraphs..\" 13th IMCOM 2019 , pp. 1045-1062. Phuket, Thailand: Springer, 2019 . View More 4 Md Shadman Rafid, Mohammad Mazedul Islam, Md Naimul Hoque and Chowdhury Farhan Ahmed \"Reframing for Non-Linear Dataset Shift..\" 18th EGC 2018 , pp. 131-142. Paris, France: Hermann-Éditions, 2018 . View More 5 Md Mahmudur Rahman, Chowdhury Farhan Ahmed, Carson K. Leung and Adam G. M. Pazdor \"Frequent Sequence Mining with Weight Constraints in Uncertain Databases..\" 12th IMCOM 2018 , pp. 48:1-48:8. Langkawi, Malaysia: ACM, 2018 . View More 6 Mohammad Fahim Arefin, Maliha Tashfia Islam and Chowdhury Farhan Ahmed \"Mining Sequential Correlation with a New Measure..\" 18th Industrial Conference on Data Mining 2018 , pp. 2",
  "content_length": 12957,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:30"
}