{
  "name": "Christophe Dubach",
  "homepage": "https://cdubach.bitbucket.io",
  "status": "success",
  "content": "Christophe Dubach Search Christophe Dubach Associate Professor Canada CIFAR AI Chair, Mila McGill University About I’m an Associate Professor jointly appointed in the department of Electrical and Computer Engineering (ECE) and the school of Computer Science (CS) at McGill University. I also hold a Canada CIFAR AI Chair at Mila. Up until 2019, I was a Reader (Associate Professor) at the University of Edinburgh. My research interests include data-parallel language design and implementation, high-level code generation and optimisation for parallel hardware (e.g. GPU, FPGAs), architecture design space exploration, and the use of machine-learning techniques applied to all these topics. Several reseach positions (PhD, MSc or UG interns) are available in my group at McGill, please make sure to check the openings page. Interests Compilers / Code generation Parallel programming language design Hardware design space exploration Heterogeneous computing Machine learning Education PhD in Informatics, 2009 University of Edinburgh, UK MSc in Computer Science, 2005 EPFL, Switzerland Meet the Team Principal Investigator Christophe Dubach Associate Professor Canada CIFAR AI Chair, Mila Compilers / Code generation, Parallel programming language design, Hardware design space exploration, Heterogeneous computing, Machine learning PhD students Christof Schlaak PhD student (Edinburgh University) High-level sythesis for FPGAs Hamza Javed PhD student (McGill University) High-Level Syntehsis for FPGAs for irregular applications Tzung-Han Juang PhD student (McGill University) High-Level Synthesis for FPGAs Federico Pizzuti PhD student (Edinburgh University) High-level functional abstraction and compilation for sparse data structures Naums Mogers PhD student (Edinburgh University) GPU code generation for neural networks Jonathan Van der Cruysse PhD student (McGill University) Machine Learning applied to compilers MSc students Jacob Peng MSc student (McGill University) Differential Programming, MLIR Shakiba Bolbolian Kha MSc student (McGill University) Compilation, Accelerators Zhitao Lin MSc student (McGill University) High-Performance code generation, Functional IR Interns Archisman Dey Summer 2022 McGill intern (visiting from IIT Guwahati) FFT Hardware design Alumni Alumni Postdocs Lu Li Postdoc 2018-2020 (Edinburgh University) Now Deep learning engineer at Zenseact Michel Steuwer Postdoc 2015-2017 (Edinburgh University) Now Lecturer at Glasgow University Thibaut Lutz Postdoc 2015 (Edinburgh University) Now at Nvidia Alumni PhD Paul-Jules Micolet PhD student 2014-2019 (Edinburgh University) From Software to Hardware: Making Dynamic Multicore Processors Practical Larisa Stoltzfus PhD student (Edinburgh University) Code generation and high-level abstractions for Stencil computations Toomas Remmelg PhD student 2014-2019 (Edinburgh University) Automatic Performance Optimisation of Parallel Programs for GPUs via Rewrite Rules Juan Fumero PhD student 2013-2017 (Edinburgh University) Accelerating Interpreted Programming Languages on GPUs with Just-In-Time Compilation and Runtime Optimisations Alumni MSc Andrej Ivanis MSc student 2018-2019 (Edinburgh University) Optimising Convolutional Neural Networks on FPGAs Adam Harries MSc student 2014-2015 (Edinburgh University) Sparsity and Irregularity in a Dense Skeletal GPU Framework Daniel Hillerstroem MSc student 2015-2016 (Edinburgh University) Compilation of effect handlers and their applications to concurrency Emanuel Martinov MSc student 2015-2017 (Edinburgh University) High-Performance GPU Implementation of Histogram Computation problem Rudi Horn MSc student 2016 (Edinburgh University) Increasing portable machine learning performance by application of rewrite rules on Google Tensorflow data flow graphs Alumni BSc Martin Kristien BSc student 2016-2017 (Edinburgh University) High-level synthesis of functional patterns for reconfigurable logic Alumni Interns Ayan Chakraborty Summer 2021 McGill intern (visiting from IIT Kharagpur) Hardware design / FPGAS Jiaxuan Cai Summer 2021 McGill intern (visiting from Chongqing University) Hardware design / FPGAs Ongoing Projects High-Level Synthesis of Neural Networks on FPGAs Many modern applications that perform classification, prediction or clustering employ Neural Networks (NN) for these tasks. They are often used in datacenters or mobile devices, where high performance and energy-efficiency is crucial. Christophe Dubach, Christof Schlaak, Tzung-Han Juang, Hamza Javed, Ayan Chakraborty, Jiaxuan Cai, Andrej Ivanis, Martin Kristien Lift Computing systems have become increasingly complex with the emergence of heterogeneous hardware combining multicore CPUs and GPUs. These parallel systems exhibit tremendous computational power at the cost of increased programming effort. Christophe Dubach, Michel Steuwer, Lu Li, Thibaut Lutz, Toomas Remmelg, Larisa Stoltzfus, Federico Pizzuti, Naums Mogers, Adam Harries Past Projects Design Space Exploration for Dynamically Reconfigurable Multicore Dynamical reconfigurable multicore processors, such as the E2 architecture, offer the ability to merge simple cores into larger ones in order to increase performance. However, the problem of deciding how to aggregate these cores is non-trivial and is highly dependent on the application. Christophe Dubach, Paul-Jules Micolet Sep 4, 2014 GPU-Acceleration for the Graal VM This project aims at automatically accelerating applications running on top of the Graal VM, an Open source Java VM. To achieve this goal we first define a high-level API inspired by functional programming and data-flow programming concepts. Christophe Dubach, Michel Steuwer, Juan Fumero Sep 1, 2013 Teaching Current courses (McGill University): Code Course Department Website Year Term COMP764/ECSE688 High-level Synthesis of Digital Systems CS/ECE TBC 2023 Winter COMP520 Compiler Design CS TBC 2023 Winter ECSE324 Computer Organization ECE link 2022 Fall Past courses (McGill University): Code Course Department Website Year Term COMP764/ECSE688 High-level Synthesis of Digital Systems CS/ECE myCourses 2022 Winter COMP520 Compiler Design CS link 2022 Winter ECSE324 Computer Organization ECE link 2021 Fall COMP520 Compiler Design CS link 2021 Winter ECSE324 Computer Organization ECE link 2020 Fall ECSE324 Computer Organization ECE link 2020 Winter Past courses (Edinburgh University): Code Course Website Year Semester INFR10053 Compiling Techniques link 2019-20 1 INFR10053 Compiling Techniques link 2018-19 1 INFR10053 Compiling Techniques link 2017-18 1 INFR10053 Compiling Techniques link 2016-17 1 INFR10053 Compiling Techniques link 2015-16 1 INFR10053 Compiling Techniques link 2014-15 2 Recent Publications Naums Mogers, Valentin Radu, Lu Li, Jack Turner, Michael F. P. O'Boyle, Christophe Dubach (2020). Automatic generation of specialized direct convolutions for mobile GPUs. 13th Annual Workshop on General Purpose Processing using Graphics Processing Unit (GPGPU@PPoPP). Cite Federico Pizzuti, Michel Steuwer, Christophe Dubach (2020). Generating fast sparse matrix vector multiplication from a high level generic functional IR. 29th International Conference on Compiler Construction (CC@CGO). Cite Toomas Remmelg, Bastian Hagedorn, Lu Li, Michel Steuwer, Sergei Gorlatch, Christophe Dubach (2020). High-level hardware feature extraction for GPU performance prediction of stencils. 13th Annual Workshop on General Purpose Processing using Graphics Processing Unit (GPGPU@PPoPP). Cite Larisa Stoltzfus, Bastian Hagedorn, Michel Steuwer, Sergei Gorlatch, Christophe Dubach (2020). Tiling Optimizations for Stencil Computations Using Rewrite Rules in Lift. ACM Transactions on Architecture and Code Optimization, ACM TACO. Cite Martin Kristien, Bruno Bodin, Michel Steuwer, Christophe Dubach (2019). High-level synthesis of functional patterns with Lift. Proceedings of ACM SIGPLAN International Workshop on Libraries, Languages, and Compilers for Array Programming (ARRAY@PLDI). Cite See all publications Contact christophe.dubach@mcgill.ca 514-398-8720 3480 University StreetMcConnell Engineering Building - Room 758Montreal, QCH3A 0E9Canada Office hours: Wed 9:00-9:30 & 15:00-15:30 Cite × Copy Download",
  "content_length": 8224,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:58"
}