{
  "name": "Christopher MacLellan",
  "homepage": "https://www.cc.gatech.edu/people/christopher-j-maclellan",
  "status": "success",
  "content": "Christopher J. MacLellan | College of Computing Skip to main navigation Skip to main content Christopher J. MacLellan Assistant Professor cmaclellan3@gatech.edu https://chrismaclellan.com/ Research Areas: \t\t\t\tArtificial Intelligence; Cognitive Systems; Cognitive and Learning Sciences; Human-Computer Interaction; Learning Technology. Biography Chris MacLellan is an Assistant Professor in the School of Interactive Computing at Georgia Institute of Technology, where he leads the Teachable AI Lab (TAIL; https://tail.cc.gatech.edu). His work on cognitive systems aims to advance our understanding of how people teach and learn and to build AI systems that can teach and learn like people do and in ways that are compatible with people. He explores the development of computational models of learning and how these models can support the development of AI technologies, such as intelligent tutoring systems and medical decision support systems, at scale. He also investigates how data collected about how people learn and make decisions can be leveraged to drive the development of better cognitive models and computational learning systems. Chris has been a principal investigator on multiple sponsored project awards with DARPA, the U.S. Army, ONR, and NSF. He has also received external recognition for his work, such as the 2022 EAAI Now and Future AI Educator award as well as being named on the 2021 Technical.ly RealLIST of technologists building Philadelphia’s future. Prior to his position at Georgia Tech, Chris was an Assistant Professor of Information Science and Computer Science (by co-appointment) at Drexel University. Before that, he completed his PhD in Human-Computer Interaction at Carnegie Mellon University's School of Computing, where he was a fellow in the Program for Interdisciplinary Education Research (PIER). The products of his work have immediate implications for AI-powered technology development. For example, through his work with the NSF-funded AI ALOE Institute, Chris is developing tools that let teachers build AI-powered tutors by naturally teaching an AI agent rather than programming. His work also has many broader implications, such as enabling doctors to support the development of AI-powered diagnoses tools where few training examples are available (DARPA-funded POCUS project) and for creating personal assistant agents that can engage in collaborative learning to support more effective human-machine teaming (ARL-funded STRONG project). Affiliations School of Interactive Computing",
  "content_length": 2530,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:24"
}