{
  "name": "Christoph Meinel",
  "homepage": "https://hpi.de/en/meinel/chair.html",
  "status": "success",
  "content": "Chair Chair deen Prof. Dr. Christoph Meinel Navigation aufklappen/zuklappen ChairTeachingKnowledge TechSecurity EngLabs & SystemsPublicationsSuchendeen Prof. Dr. Christoph MeinelTeamTeachingResearchSymposiaWeb Portals & BlogsPatents & PublicationsInterviews & MediaPrevious PagesBiography of Prof. Dr. Christoph MeinelInterviews & MediaChairmanBoards & JurysProgram CommitteesEditor in ChiefBooks & AnthologiesFotogalerienSenior ResearcherPostDocsCurrent PhD-StudentsFormer PhD-StudentsPartnersPhoto Gallery2. Sino-D C-HPC 2012IFIP Trust Mgmt 20121. Sino-D C-HPC 20116th tele-TASK 20125th tele-TASK 20104th tele-TASK 20103rd tele-TASK 20092nd tele-TASK 20082nd SOA-Security 20101st SOA-Security 2008Design and TestLehrstuhl, Uni TrierInstitut für TelematikschließenMOOCsLecturesTele-LecturesBachelor ProjectsMaster ProjectsMaster ThesesPhD StudentsD-School teachingResearch SeminarsArchiveInternet und WWWInternet SecurityInformationssicherheitKomplexitätstheoriemore RecordingsBP2007B2MP2021-DigitalCredentialMP2018-19-SSIBlockchainSemantische Erschließung des tele-TASK-ArchivsGamification für openHPICybersecurity for the MassesHPI Private CloudWS Probing ToolBlog-IntelligenceIDS@FutureSOCMaster Theses: Open TopicsschließenLearning EngineeringMachine Learning & Artifical IntelligenceSocial MediaE-HealthInnovation ResearchFormer TopicsMOOCs & openHPItele-TASKAnalyticsFolksonomienBlog-IntelligenceCollaborative WebTumor DocTele-Board MedOnko-StatTele-BoardPrototypingTele-Board MEDDesign Thinking at ScaleFormer DT ResearchSemanticsschließenSecurity Awareness and EducationSecurity AnalyticsSecure Identity LabFormer Projects and Research AreasFormer Team MembersData-Driven Threat DetectionThreat IntelligenceBehavior-Based AuthenticationDigital CredentialsBlockchainSOA-Security LabSecurity Lab GeneratorCloud SecurityTele-LabNext-Generation Security EngineeringSOA SecurityTrusted CloudschließenopenHPITele-TaskTele-BoardREAMSHPI-VDBTele-Lab IT SecurityWinSENDschließenInterviews & MediaTop TenJournalBook ChaptersConference PapersReports & StudiesWeb Portals & BlogsPatentsAnnual ReportsComplete ListSecurity & TrustMultimedia and Machine LearningWeb-UniversityInnovation ResearchWeb 3.0E-Health(O)BDDsComplexityOthersNotesschließen HOME > Chair ... on the web page of the chair \"Internet Technologies and Systems\" at the HPI.Here you can find information about our teaching offers as well as our research activities. You can find more information about Learning-Tech projects openHPI and tele-TASK, our Web portals, online labs and systems. You can use our web services, and download our publications und lecture notes. The department \"Internet Technologies and Systems\" headed by Dr. Feng Cheng aims to provide an excellent education to the students of the Hasso Plattner Institute and a stimulating and ambitious research environment for Ph.D. students from allover the world, to achieve significant scientific results in IT-systems engineering, particularly in the field of Internet technologies and systems,  worth to be published in internationally leading journals and conferences, and to design innovative IT tools and systems that forward digital transformation and improve daily live in our changing world. The research at the chair focuses on investigation of scientific principles, methodes and technologies to design and implement novel Internet technologies and innovative Internet-based IT-systems [more]. We concentrate on efficient treatment of big data und revealing potentials of Cloud computing and In-Memory technologie. In particular, we are scientifically active in the following application fields:Security and Trust Engineering: Security Awareness; Security Analytics and REAMS, Next-Generation Security Engineering,  ...Machine Learning and Multimedia Analytics: Binary neural networks, LLM compression and acceleration, novel/general class discovery, analysis of handwritings in historical art archives, ...Learning Tech and Knowledge Engineering, in partiular \tWeb-University: eLearning, Teleteaching, digital learning, ....openHPI.de: Largest European MOOC platform with many interactive online courses for digital enlightenment. Developed and powered by us.HPI Schul-Cloud: Digital learning environment with a modern cloud architecture which enables a data-pretection-conform use of digital media in German schools.Design Thinking Research: Tele-Board, collaborativ creativity, prototyping ...  Former research interests from the team aer focused on the theoretical foundations of computer science, in particular on(O)BDD-based data structures and algorithms for the design and formal verification of digital systems and VLSI circuits, and onComputational Complexity. Hasso-Plattner-Institute at University of Potsdam offers a Bachelor, Master, and PhD program on IT-systems engineering. Our chair contributes in math, Internet and Web technologies, basic and advanced IT security, and Design Thinking (...more) At the chair various IT systems have been developed for innovation in university teaching, e.g.the platform openHPI for the presentation of massive open online courses (MOOCs) of HPI professors,the mobile system tele-TASK for recording, streaming and podcasting lectures over the Internet,the web-portal www.tele-task.de with more than 5.000 tele-lectures and  powerful navigation and annotation tools, andtwo interactive tutorial systems Tele-Lab IT-Security and SOA-Lab,the Tele-Board to enabling efficient collaboration in digital design spaces across time and distance. The chair hosts and powers various famous Internet portals (e.g. openHPI and tele-TASK), electronical journals (e.c. ECCC), and blogs (e.g. IT-Gipfelblog). Here you can find all the links. ... to our Research:                Security Engineering - Learning & Knowledge Tech - Design Thinking - former ... to our Teaching:                Tele-Lectures - MOOCs - Labs - Systems  ... to our Publications:                Books - Journals - Conference-Papers - Patents ... and to our Annual Reports. Lehrstuhlvertreter: Dr. Feng Cheng Assistentin: Katrin HeinrichRaum: G2-E.35Tel.: +49 (0)331 5509-222Fax: +49 (0)331 5509-325E-Mail: [email protected] (Prof. Dr. Christoph Meinel has moved to German UDS) Hasso-Plattner-Institut Campus III Rudolf-Breitscheid-Straße 187 14482 PotsdamGetting there",
  "content_length": 6316,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:49"
}