{
  "name": "Christine Cheng",
  "homepage": "http://uwm.academia.edu/ChristineCheng",
  "status": "success",
  "content": "Christine Cheng - University of Wisconsin Milwaukee Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Christine ChengUniversity of Wisconsin Milwaukee, Computer Science, Faculty MemberaddFollowdoneFollowingFollowers23Following7Public ViewsRelated Authors Judith L GreenUniversity of California, Santa Barbara Steven PinkerHarvard University E. Wayne RossUniversity of British Columbia Andrej DujellaUniversity of Zagreb Armando Marques-GuedesUNL - New University of Lisbon Fabio CuzzolinOxford Brookes University Lev ManovichGraduate Center of the City University of New York Florentin SmarandacheUniversity of New Mexico PALIMOTE JUSTICERIVERS STATE POLYTECHNIC Guilherme MoerbeckUniversité du Québec à Trois-RivièresInterests UploadsPapers by Christine ChengOn the Stable Matchings That Can Be Reached When the Agents Go Marching in One By OneSIAM Journal on Discrete Mathematics, 2016The Random Order Mechanism (ROM) can be thought of as a sequential version of Gale and Shapley's ... more The Random Order Mechanism (ROM) can be thought of as a sequential version of Gale and Shapley's deferred-acceptance (DA) algorithm where agents are arriving one at a time, and each newly arrived agent has an opportunity to propose. Like the DA algorithm, ROM can be implemented in polynomial time. Unlike the DA algorithm, it is possible for ROM to output a stable matching that is different from the man-optimal and woman-optimal stable matchings. We say that a stable matching µ is ROM-reachable if ROM can output µ. In this paper, we investigate computational questions related to ROM-reachability. First, we show that there is an efficient algorithm for determining if ROM can reach a non-trivial stable matching -i.e., one different from the man-optimal and woman-optimal stable matchings. However, if we wish to determine if ROM can reach a particular stable matching then the problem becomes NPcomplete. We then study two restricted versions of this problem. In the first version, we consider stable matchings that can be reached by ROM in a \"direct\" manner. We show that they are computationally easy to recognize. In the second version, we restrict the class of stable matchings to what we call extreme stable matchings and prove that computational complexity of determining if they are ROM-reachable depends on the number of unstable partners of the agents.Download The Multi-Spreader Crane Scheduling Problem: Partitions and supersequencesDiscrete Applied Mathematics, 2021In the Multi-Spreader Crane Scheduling Problem (MSCSP), containers with identical dimensions but ... more In the Multi-Spreader Crane Scheduling Problem (MSCSP), containers with identical dimensions but variable weights are arranged along a grid. A multispreader crane is used to lift all the containers. The crane has m > 1 modes. When it is in the pth mode, the crane can remove p adjacent containers along the same row at the same time as long as the total weight of the containers does not exceed the loading capacity κ p. Such a lift takes h p minutes. It also takes c p,q minutes for the crane to switch from mode p to q when p = q. The goal is to find a crane lift sequence so that the total time it takes to lift all the containers is minimized. This paper investigates the computational complexity of MSCSP. First, we establish a connection between greedy crane lift sequences and supersequences. We then prove that MSCSP is NP-hard when the crane has three or more modes by a reduction from a version of the Shortest Common Supersequence problem. Lastly, we investigate two problems that arise naturally when heuristics are used to solve MSCSP. We show that one can be solved using dynamic programming while the other remains computationally hard. We also provide an approximation algorithm that behaves nicely when the changeover times are not much larger than the lifting times of the crane.Download Generating small combinatorial test suites to cover input-output relationshipsThird International Conference on Quality Software, 2003. Proceedings., 2003In this paper, we consider a problem that arises in black box testing: generating small test suit... more In this paper, we consider a problem that arises in black box testing: generating small test suites (i.e., sets of test cases) where the combinations that have to be covered are specified by input-output parameter relationships of a software system. That is, we only consider combinations of input parameters that affect an output parameter. We also do not assume that the input parameters have the same number of values. To solve this problem, we revisit the greedy algorithm for test generation and show that the size of the test suite it generates is within a logarithmic factor of the optimal. Unfortunately, the algorithm's main weaknesses are its time and space requirements for construction. To address this issue, we present a problem reduction technique that makes the greedy algorithm and possibly any other test suite generation method more efficient if the reduction in size is significant.Download The Generalized Median Stable Matchings: Finding Them Is Not That EasyLecture Notes in Computer ScienceLet I be a stable matching instance with N stable matchings. For each man m, order his N stable p... more Let I be a stable matching instance with N stable matchings. For each man m, order his N stable partners from his most preferred to his least preferred. Denote the ith woman in his sorted list as pi(m). Let αi consist of the man-woman pairs where each man m is matched to pi(m). Teo and Sethuraman proved this surprising result: for i = 1 to N , not only is αi a matching, it is also stable. The αi's are called the generalized median stable matchings of I. In this paper, we present a new characterization of these stable matchings that is solely based on I's rotation poset. We then prove the following: when i = O(log n), where n is the number of men, αi can be found efficiently; but when i is a constant fraction of N , finding αi is NPhard. We also consider what it means to approximate the median stable matching of I, and present results for this problem.Download Balanced matching of buyers and sellers in e-marketplaces: The barter trade exchange modelIn this paper, we describe the operation of barter trade exchanges by identifying key techniques ... more In this paper, we describe the operation of barter trade exchanges by identifying key techniques used by trade brokers to stimulate trade and satisfy member needs, and present algorithms to automate some of these techniques. In particular, we develop algorithms that emulate the practice of trade brokers by matching buyers and sellers in such a way that trade volume is maximized while the balance of trade is maintained as much as possible. We show that the buyer/seller matching and trade balance problems can be decoupled, permitting efficient solution as well as numerous options for matching strategies. exchange rule of thumb that maximizing single-period trade volume while maintaining balance of trade helps to maximize trade volume over the long run.Download A unified approach to finding good stable matchings in the hospitals/residents settingTheoretical Computer Science, 2008The hospitals/residents (HR) problem is a many-to-one generalization of the stable marriage (SM) ... more The hospitals/residents (HR) problem is a many-to-one generalization of the stable marriage (SM) problem. Researchers have been interested in variants of stable matchings that either satisfy a set of additional contraints or are optimal with respect to some cost function. In this paper, we show that broad classes of feasibility and optimization stable matching problems in the HR setting can be solved efficiently provided certain tasks (such as checking the feasibility of a stable matching or computing the cost of a stable matching) can also be done efficiently. To prove our results, we make use of an HR instance's meta-rotation poset to explore its stable matchings. An algorithm that can discover all the meta-rotations of the instance serves as a starting point for all our algorithms.Download Improved Approximation Algorithms for the Demand Routing and Slotting Problem with Unit Demands on RingsSIAM Journal on Discrete Mathematics, 2004Download Optimizing ad hoc trade in a commercial barter trade exchangeElectronic Commerce Research and Applications, 2005In this paper, we describe the operation of barter trade exchanges by identifying key techniques ... more In this paper, we describe the operation of barter trade exchanges by identifying key techniques used by trade brokers to stimulate trade and satisfy member needs, and present algorithms to automate some of these techniques. In particular, we develop algorithms that emulate the practice of trade brokers by matching buyers and sellers in such a way that trade volume is maximized while the balance of trade is maintained as much as possible. We model the trade balance problem as a minimum cost circulation problem (MCC) on a network. When the products have uniform cost or when the products can be traded in fractional units, we solve the problem exactly. Otherwise, we present a novel stochastic rounding algorithm that takes the fractional optimal solution to the trade balance problem and produces a valid integer solution. We then make use of a greedy heuristic that attempts to match buyers and sellers so that the average number of suppliers that a buyer must use to satisfy a given product need is minimized. We present results of empirical evaluation of our algorithms on test problems and on simulations built using data from an operating trade exchange.Download On computing the distinguishing and distinguishing chromatic numbers of i",
  "content_length": 23382,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:33"
}