{
  "name": "Christopher Musco",
  "homepage": "https://www.chrismusco.com",
  "status": "success",
  "content": "Christopher Musco Christopher Musco 370 Jay St., Brooklyn, NY • Office 1105 • Zoom Room • cmusco [at] nyu.edu • CV • GitHub • Google Scholar I am an Institute Associate Professor of Computer Science and Engineering at New York University. My students and I are part of NYU's Theoretical Computer Science Group and the VIDA Center. Our research is on the design and analysis of efficient algorithms for problems across science and engineering, and combines ideas from theoretical computer science with tools from computational mathematics. I am also interested in algorithmic aspect of modern machine learning, like fast inference and retrieval. I was previously a Research Instructor at Princeton and completed my PhD at MIT, where I was fortunate to be advised by Jon Kelner. Before MIT I was an engineer at Redfin and I studied Applied Math and Computer Science at Yale. Outside of research, I am involved in organizing the annual MathWorks Math Modeling Challenge for high school students. News and Events I am on sabbatical this year, visiting the Simons Institute for the Theory of Computing at UC Berkeley for the fall semester, and the Institute for Computational and Experimental Research in Mathematics at Brown University in the spring. We are holding NYU's in-person CS Theory Seminar on Thursdays. You can also sign up for the email list to receive announcements about upcoming talks. Teaching Spring 2025: NYU CSCI-GA 3033/CS-GY 9223, Recent Developments in Algorithm Design Fall 2019-2023, Spring 2025: NYU CS-GY 6763, Algorithmic Machine Learning & Data Science Spring 2022, 2023, Fall 2024: NYU CS-GY 6923, Machine Learning Spring 2020: NYU CS-UY 4563, Introduction to Machine Learning Fall 2018: Princeton COS 521 , Advanced Algorithm Design Students and Postdocs Apoorv Singh, Ph.D., 2020 - present. Aarshvi Gajjar, Ph.D. 2021 - present (with Prof. Chinmay Hegde). Majid Daliri, Ph.D., 2022 - present. Noah Amsel, Ph.D., 2022 - present (with Prof. Joan Bruna). Feyza Duman Keles, Ph.D., 2023 - present (with Prof. Chinmay Hegde). Pratyush Avi, Ph.D., 2024 - present. David Persson, Courant Instructor, 2024 - present. Diana Halikias, Courant Instructor, Starting Spring 2026. List of previous students and postdocs. If you are interested in working with me on research, I would encourage you to apply to NYU's PhD program in Computer Science (now a single joint program between Tandon + Courant). If you are a current undergraduate or masters student at NYU, the best way to start a collaboration or to obtain a TA position is to first complete my algorithms class, CS-GY 6763. More information on working with my group can be found here. Research All Numerical Linear Algebra Sketching and Streaming Sample Efficient Learning Graphs Algorithms Social Networks and Opinion Dynamics Miscellaneous An Exact Algorithm for the Unanimous Vote Problem Feyza Duman Keles, Lisa Hellerstein, Kunal Marwaha, Christopher Musco, Xinchen Yang SIAM Symposium on Simplicity in Algorithms (SOSA 2026). Efficiently Constructing Sparse Navigable Graphs Alex Conway, Laxman Dhulipala, Martin Farach-Colton, Rob Johnson, Ben Landrum, Christopher Musco, Yarin Shechter, Torsten Suel, Richard Wen ACM-SIAM Symposium on Discrete Algorithms (SODA 2026). Does Block Size Matter in Randomized Block Krylov Low-rank Approximation? Tyler Chen, Ethan N. Epperly, Raphael A. Meyer, Christopher Musco, Akash Rao ACM-SIAM Symposium on Discrete Algorithms (SODA 2026). Fixed-Sparsity Matrix Approximation from Matrix-Vector Products Noah Amsel, Tyler Chen, Diana Halikias, Feyza Duman Keles, Cameron Musco, Christopher Musco SIAM Journal on Matrix Analysis and Applications (SIMAX 2026). Distance Adaptive Beam Search for Provably Accurate Graph-Based Nearest Neighbor Search Yousef Al-Jazzazi, Haya Diwan, Jinrui Gou, Cameron Musco, Christopher Musco, Torsten Suel Advances in Neural Information Processing Systems (NeurIPS 2025). Slides: 60 Minutes. Regression-adjusted Monte Carlo Estimators for Shapley Values and Probabilistic Values R. Teal Witter, Yurong Liu, Christopher Musco Advances in Neural Information Processing Systems (NeurIPS 2025). Query Efficient Structured Matrix Learning Noah Amsel, Pratyush Avi, Tyler Chen, Feyza Duman Keles, Chinmay Hegde, Cameron Musco, Christopher Musco, David Persson Preprint. Preliminary version in Theory of AI for Scientific Computing Workshop at COLT 2025. Quasi-Optimal Hierarchically Semi-Separable Matrix Approximation Noah Amsel, Tyler Chen, Feyza Duman Keles, Diana Halikias, Cameron Musco, Christopher Musco, David Persson Preprint. The Polar Express: Optimal Matrix Sign Methods and Their Application to the Muon Algorithm Noah Amsel, David Persson, Christopher Musco, Robert Gower Preprint. Sharper Bounds for Chebyshev Moment Matching with Applications to Differential Privacy and Beyond Cameron Musco, Christopher Musco, Lucas Rosenblatt, Apoorv Vikram Singh Conference on Learning Theory (COLT 2025). Preliminary version in Theory and Practice of Differential Privacy. Coupling without Communication and Drafter-Invariant Speculative Decoding Majid Daliri, Christopher Musco, Ananda Theertha Suresh International Symposium on Information Theory (ISIT 2025). Randomized Block-Krylov Subspace Methods for Low-rank Approximation of Matrix Functions David Persson, Tyler Chen, Christopher Musco Preprint. Provably Accurate Shapley Value Estimation via Leverage Score Sampling Christopher Musco, R. Teal Witter International Conference on Learning Representations (ICLR 2025). Selected as spotlight paper. Matrix Product Sketching via Coordinated Sampling Majid Daliri, Juliana Freire, Danrong Li, Christopher Musco International Conference on Learning Representations (ICLR 2025). Near-Optimal Hierarchical Matrix Approximation from Matrix-Vector Products Tyler Chen, Feyza Duman Keles, Diana Halikias, Cameron Musco, Christopher Musco, David Persson ACM-SIAM Symposium on Discrete Algorithms (SODA 2025). Slides: 60 Minutes. Faster Linear Systems and Matrix Norm Approximation via Multi-level Sketched Preconditioning Michał Dereziński, Christopher Musco, Jiaming Yang ACM-SIAM Symposium on Discrete Algorithms (SODA 2025). Improved Spectral Density Estimation via Explicit and Implicit Deflation Rajarshi Bhattacharjee, Rajesh Jayaram, Cameron Musco, Christopher Musco, Archan Ray ACM-SIAM Symposium on Discrete Algorithms (SODA 2025). Algorithm-agnostic Low-rank Approximation of Operator Monotone Matrix Functions David Persson, Raphael A. Meyer, Christopher Musco SIAM Journal on Matrix Analysis and Applications (SIMAX 2025). Navigable Graphs for High-Dimensional Nearest Neighbor Search: Constructions and Limits Haya Diwan, Jinrui Gou, Cameron Musco, Christopher Musco, Torsten Suel Advances in Neural Information Processing Systems (NeurIPS 2024). Slides: 60 Minutes. Near-Optimal Approximation of Matrix Functions by the Lanczos Method Noah Amsel, Tyler Chen, Anne Greenbaum, Cameron Musco, Christopher Musco Advances in Neural Information Processing Systems (NeurIPS 2024). Selected as spotlight paper Slides: 60 Minutes. Benchmarking Estimators for Natural Experiments: A Novel Dataset and a Doubly Robust Algorithm R. Teal Witter, Christopher Musco Advances in Neural Information Processing Systems, Datasets and Benchmarks Track (NeurIPS 2024). Faster Spectral Density Estimation and Sparsification in the Nuclear Norm Yujia Jin, Ishani Karmarkar, Christopher Musco, Apoorv Vikram Singh, Aaron Sidford Conference on Learning Theory (COLT 2024). Agnostic Active Learning of Single Index Models with Linear Sample Complexity Aarshvi Gajjar, Wai Ming Tai, Xingyu Xu, Chinmay Hegde, Christopher Musco, Yi Li Conference on Learning Theory (COLT 2024). Preliminary version at NeurIPS 2023 Workshop on Adaptive Experimental Design and Active Learning in the Real World. Sampling Methods for Inner Product Sketching Majid Daliri, Juliana Freire, Christopher Musco, Aécio Santos, Haoxiang Zhang Proceedings of the VLDB Endowment (VLDB 2024). Slides: 60 Minutes. Improved Active Learning via Dependent Leverage Score Sampling Atsushi Shimizu, Xiaoou Cheng, Christopher Musco, Jonathan Weare International Conference on Learning Representations (ICLR 2024). Invited for oral presentation. A Simple and Practical Method for Reducing the Disparate Impact of Differential Privacy Lucas Rosenblatt, Julia Stoyanovich, Christopher Musco AAAI Conference on Artificial Intelligence (AAAI 2024). On the Unreasonable Effectiveness of Single Vector Krylov Methods for Low-Rank Approximation Raphael A. Meyer, Cameron Musco, Christopher Musco ACM-SIAM Symposium on Discrete Algorithms (SODA 2024). Slides: 30 Minutes. Raphael's Julia Code. Simple Analysis of Priority Sampling Majid Daliri, Juliana Freire, Christopher Musco, Aécio Santos, Haoxiang Zhang SIAM Symposium on Simplicity in Algorithms (SOSA 2024). Structured Semidefinite Programming for Recovering Structured Preconditioners Arun Jambulapati, Jerry Li, Christopher Musco, Aaron Sidford, Kirankumar Shiragur, Kevin Tian Advances in Neural Information Processing Systems (NeurIPS 2023). Moments, Random Walks, and Limits for Spectrum Approximation Yujia Jin, Christopher Musco, Apoorv Vikram Singh, Aaron Sidford Conference on Learning Theory (COLT 2023). Efficient Block Approximate Matrix Multiplication Chuhan Yang, Christopher Musco. European Symposium on Algorithms (ESA 2023). Dimensionality Reduction for General KDE Mode Finding Xinyu Luo, Christopher Musco, Cas Widdershoven International Conference on Machine Learning (ICML 2023). Weighted Minwise Hashing Beats Linear Sketching for Inner Product Estimation Aline Bessa, Majid Daliri, Juliana Freire, Cameron Musco, Christopher Musco, Aécio Santos, Haoxiang Zhang ACM Symposium on Principles of Database Systems (PODS 2023). Low-memory Krylov subspace methods for optimal rational matrix function approximation Tyler Chen, Anne Greenbaum, Cameron Musco, Christopher Musco SIAM Journal on Matrix Analysis and Applications (SIMAX 2023). Tyler's",
  "content_length": 19698,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:26"
}