{
  "name": "Christos Xenakis",
  "homepage": "https://www.ds.unipi.gr/en/faculty/xenakis-en",
  "status": "success",
  "content": "Christos Xenakis - Department of Digital Systems Skip to content Christos Xenakis Phone +30 210-4142772 Email xenakis@unipi.gr Title Professor Office Hours Monday - Thursday 15.00 - 17.00 Links http://cgi.di.uoa.gr/~xenakis/ Office 301 (150, Androutsou Str, Piraeus, 18532) Courses Network Security — 5th semester Mobile and Wireless Communications Security — 8th semester Cryptography — 7th semester Privacy on the Internet — 8th semester Brief CV Prof. Christos Xenakis received his B.Sc degree in computer science in 1993 and his M.Sc degree in telecommunication and computer networks in 1996, both from the Department of Informatics and Telecommunications, University of Athens, Greece. In 2004 he received his Ph.D. from the University of Athens (Department of Informatics and Telecommunications). From 1998 – 2001 he was with a Greek telecoms system development firm, where he was involved in the design and development of advanced telecommunications subsystems. From 1996 – 2007 he was a member of the Communication Networks Laboratory of the University of Athens. Since 2007 he is a faculty member of the Department of Digital Systems of the University of Piraeus, Greece, where currently is a Professor, a member of the Systems Security Laboratory and the director of the Postgraduate Degree Programme, on “Digital Systems Security”. He has participated in numerous projects realized in the context of EU Programs (ACTS, ESPRIT, IST, AAL, DGHOME, Marie Curie, Horizon2020) as well as National Programs (Greek). He is the project manager the CUREX, SECONDO, INCOGNITO and SealedGRID projects, funded by Horizon2020, while he was the project manager of the ReCRED project funded by Horizon 2020 and the technical manager of the UINFC2 project funded by DGHOME/ISEC. He is also a steering committee member of the European Cyber Security Challenge (ECSC) and the leader of the Hellenic Cyber Security Team. He is a member of the editorial board of three Thomson Reuters indexed journals: a) Computers & Security Journal of the Elsevier publishing, b) Computer Communications Journal of the Elsevier publishing, and c) IET Information Security of the Institute of Engineering and Technology. His research interests are in the field of systems, networks and applications security. He has authored more than 90 papers in peer-reviewed journals and international conferences. Publications Publications 2014 – 2019 I) JOURNALS A. Angelogianni, I. Politis, F. Mohammadi and C. Xenakis, “On identifying threats and quantifying cybersecurity risks of MNOs deploying heterogeneous RATs,” in IEEE Access, doi: 10.1109/ACCESS.2020.3045322. Konstantinos Vavousis, Marinos Papadopoulos, John Polley, Christos Xenakis, ” A compliant and secure IT infrastructure for the National Library of Greece in consideration of internet security and GDPR,” Qualitative and Quantitative Methods in Libraries (QQML), Vol 9, No. 2, June 2020. Vaios Bolgouras, Christoforos Ntantogian, Emmanouil Panaousis, Christos Xenakis, ” Distributed Key Management in Microgrids.” IEEE Transactions on Industrial Informatics, 2019 (accepted). (PDF) Christoforos Ntantogian, Eleni Veroni, Georgios Karopoulos, Christos Xenakis, “ A survey of voice and communication protection solutions against wiretapping,” Computers & Electrical Engineering, Elsevier Science, Vol. 77, pp:163-178, July, 2019. (PDF) Christoforos Ntantogian, Stefanos Malliaros, Christos Xenakis, “ Evaluation of password hashing schemes in open source web platforms,” Computers & Security, Elsevier Science, Vol. 84, pp:206-224, July 2019. (PDF) Christoforos Ntantogian, George Poulios, George Karopoulos, Christos Xenakis, “ Transforming Malicious Code to ROP Gadgets for Antivirus Evasion,” IET Information Security, March 2019. (PDF) Anastasios Stanisopoulos, Christoforos Ntantogian, Christos Xenakis, “Commix: Automating Evaluation and Exploitation of Command Injection Vulnerabilities in Web Applications,” International Journal for Information Security, Springer, Vol.18, Issue 1, pp 49–72, February 2019. (PDF) Georgios Karopoulos, Christoforos Ntantogian, Christos Xenakis, «MASKER: Masking for privacy-preserving aggregation in the smart grid ecosystem,» Computers & Security, Elsevier Science, Vol. 73, Issue 1, pp:307-325, March, 2018. (PDF) Anastasios Stanisopoulos, Christoforos Ntantogian, Christos Xenakis, «Commix: Automating Evaluation and Exploitation of Command Injection Vulnerabilities in Web Applications,» International Journal for Information Security, Springer, February 2018.  (PDF) Christoforos Panos, Christoforos Ntantogian, Stefanos Malliaros, Christos Xenakis, «Analyzing, quantifying, and detecting the blackhole attack in infrastructure-less networks,» Computer Networks, Elsevier Science, Vol. 113, Issue 1, pp: 94-110, February 2017. (PDF) Christos Xenakis, Christoforos Ntantogian, Orestis Panos, «(U)SimMonitor: a mobile application for security evaluation of cellular networks,» Computers & Security, Elsevier Science, Vol. 60, Issue 1, pp: 62-70, July 2016. (PDF) Christoforos Ntantogian, Stefanos Malliaros, Christos Xenakis, «Gaithashing: a two-factor authentication scheme based on gait features,» Computers & Security, Elsevier Science, Vol. 52, Issue 1, pp: 17-32, July. 2015. (PDF) Christoforos Panos, Christos Xenakis, Platon Kotzias, Ioannis Stavrakakis, «A specification-based intrusion detection engine for infrastructure-less networks,» Computer Communications, Elsevier Science, Vol. 54, pp: 67-83, Dec. 2014. (PDF) Christoforos Ntantogian, Dimitris Apostolopoulos, Giannis Marinakis, Christos Xenakis, «Evaluating the privacy of Android mobile applications under forensic analysis,» Computers & Security, Elsevier Science, Vol. 42, pp:66-76, May 2014. (PDF) Christos Xenakis, Christoforos Ntantogian, «An advanced persistent threat in 3G networks: Attacking the home network from roaming networks,» Computers & Security, Elsevier Science, Vol. 40, Issue 1, pp:84-94, February 2014. (PDF) II) CONFERENCES Aristeidis Farao, Sakshyam Panda, Sofia Anna Menesidou, Entso Veliou, Nikolaos Episkopos, George Kalatzantonakis, Farnaz Mohammadi, Nikolaos Georgopoulos, Michael Sirivianos, Nikos Salamanos, Spyros Loizou, Michalis Pingos, John Polley, Andrew Fielder, Emmanouil Panaousis, and Christos Xenakis, “SECONDO: A Platform for Cybersecurity Investments and Cyber Insurance Decisions,” In Proc. 17th International Conference on Trust, Privacy & Security in Digital Business, (TrustBus 2020), Bratislava, Slovakia, September 14-17, 2020. George Suciu, Cristiana Istrate, Mari-Anais Sachian, Alexandru Vulpe, Marius Vochin, Aristeidis Farao, Christos Xenakis, “FI-WARE Authorization in a Smart Grid Scenario. “ In Proc. 2020 Global Internet of Things Summit (GIoTS), Virtual Event, June 2020. Nikolaos Koutroumpouchos, Georgios Lavdanis, Eleni Veroni, Christoforos Ntantogian, Christos Xenakis , “ObjectMap: Detecting Insecure Object Deserialization. ” In Proc. 23rd Pan-Hellenic Conference on Informatics (PCI 2019), Nicosia, Cyprus, Nov. 2019. Farnaz Mohammadi, Angeliki Panou, Christoforos Ntantogian, Eirini Karapistoli, Emmanouil Panaousis, Christos Xenakis, ” CUREX: seCUre and pRivate hEalth data eXchange.”  In Proc. Web Intelligence 2019, Thessaloniki, Greece, Oct. 2019. Michail Bampatsikos, Christoforos Ntantogian, Christos Xenakis, Stelios C.A. Thomopoulos, ” BARRETT BlockchAin Regulated REmote aTTestation.” In Proc. Web Intelligence 2019, Thessaloniki, Greece, Oct. 2019. Aristeidis Farao, Juan Enrique Rubio, Cristina Alcaraz, Christoforos Ntantogian, Christos Xenakis and Javier Lopez, “SealedGRID: A Secure Interconnection Technologies for Smart Grid Applications ” In Proc. 14th International Conference on Critical Information Infrastructures Security, CRITIS 2019, Linköping, Sweden, Sept. 2019. George Suciu, Cristiana-Ioana Istrate, Alexandru Vulpe, Mari-Anais Sachian, Marius Vochin, Aristeidis Farao, Christos Xenakis, “Attribute-based Access Control for Secure and Resilient Smart Grids, ” In Proc. Industrial Control System- Cyber Security Research (ICS-CSR) 2019, Athens, Greece, Sept. 2019. Aristeidis Farao, Christoforos Ntantogian, Cristiana Istrate, George Suciu, Christos Xenakis, “ SealedGRID: Scalable, trustEd, and interoperAble pLatform for sEcureD smartGRID, ” In Proc. Industrial Control System- Cyber Security Research (ICS-CSR) 2019, Athens, Greece, Sept. 2019. Nikos Koutroumpouchos, Christoforos Ntantogian, Sofia-Anna Menesidou, Kaitai Liang, Panagiotis Gouvas, Christos Xenakis, Thanassis Giannetsos, “Secure Edge Computing with Lightweight Control-Flow Property-based Attestation, “In Proc. 1st International Workshop on Cyber-Security Threats, Trust and Privacy Management in Software-defined and Virtualized Infrastructures co-located with IEEE NetSoft 2019, Paris, France, June 2019. Ioanna Kitsaki, Anna Angelogianni, Christoforos Ntantogian, Christos Xenakis, “ A Forensic Investigation of Android Mobile Applications, ” In Proc. 22st Pan-Hellenic Conference on Informatics (PCI 2018), Athens, Greece, Nov. 2018. Christoforos Panos, Stefanos Malliaros, Christoforos Ntantogian, Angeliki Panou, Christos Xenakis, « A Security Evaluation of FIDO’s UAF Protocol in Mobile and Embedded Devices, » In Proc. Towards a Smart and Secure Future Internet: 28th International Tyrrhenian Workshop (TIWDC), Palermo, Italy, Sept. 2017. Angeliki Panou, Christoforos Ntantogian, Christos Xenakis, « RiSKi: A Framework for Modeling Cyber Threats to Estimate Risk for Data Breach Insurance, » In Proc. 21st Pan-Hellenic Conference on Informatics (PCI), Larisa, Greece, Sept. 2017. Georgios Karopoulos, Christos Xenakis, Stefano Tennina, Stefanos Evangelopoulos, « Towards trusted metering in the smart grid, » In Proc. 22nd IEEE International Workshop on Computer Aided Modeling and Design of Communication Links and Networks (CAMAD 2017), Lund, Sweden, June 2017. Stefanos Malliaros, Christoforos Ntantogian, Christos Xenakis, « Protecting sensitive information in the volatile memory",
  "content_length": 13634,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:45"
}