{
  "name": "Christophe Alias",
  "homepage": "http://perso.ens-lyon.fr/christophe.alias",
  "status": "success",
  "content": "Christophe Alias home page Christophe Alias [English version] Position Chargé de recherche HDR à l'INRIA Co-fondateur et conseiller scientifique de la start-up XtremLogic Equipe-projet Cash, Laboratoire de l'Informatique du Parallélisme, ENS-Lyon Habilitation à diriger des recherches Thèmes de recherche Parallélisation automatique Synthèse de circuits haut-niveau pour FPGAs Compilation polyédrique et extensions Outils pour la compilation polyédrique Offres de postdocs/thèses/stages Publications Animation de la communauté Program Committee PPoPP 2023 COMPAS (French Conférence d'informatique en Parallélisme, Architecture et Système): 2019, 2020 (PC track chair), 2021, 2024. HIP3ES (Workshop on High Performance Energy Efficient Embedded Systems): 2018, 2019. IMPACT: 2011, 2012, 2013, 2014, 2016, 2018. ODES (Workshop on Optimizations for DSP and Embedded Systems): 2013. Steering Committee IMPACT (Workshop on Polyhedral Compilation Techniques): 2011, 2012, 2013. Co-founder. Direction de thèses Grégoire Aubertin, \"Détection de schémas de programmes réguliers par intelligence artificielle\", démarrée en 2025, avec Sid Touati (Université Côte d'Azur). Vincent Mastain, \"Scalable Translation Validation for High-Performance Computing and Machine Learning\", démarrée en 2025, avec Ali Jannesari (Iowa State University, USA). Alec Sadler, \"Automatic Parallelization of Sparse Computations\", démarrée en 2023, avec Philippe Clauss (Université de Strasbourg), Thierry Gautier (Inria Lyon) et Xavier Rival (Inria Paris). Hugo Thievenaz, \"Scalable Trace-based Array Contraction\", avec Prof. Keiji Kimura (Waseda University, Japon), manuscrit. Guillaume Iooss, \"Detection of Linear Algebra Operations in Polyhedral Programs\", avec Alain Darte (ENS Lyon) et Sanjay Rajopadhye (Colorado State University, USA), manuscrit. Alexandru Plesco, \"Program Transformations and Memory Architecture Optimizations for High-Level Synthesis of Hardware Accelerators\", avec Alain Darte (ENS Lyon) et Tanguy Risset (INSA Lyon), manuscrit. Enseignement Logiciels transférés dans l'industrie Bee. Contraction de tableaux sous contrainte d'ordonnancement. Dcc. Dérivation de réseaux de processus DPN à partir d'un programme C annoté. [brevet]. PoCo. Framework de compilation polyédrique. Autres logiciels fkcc. Langage de prototypage de transformations polyédriques basées sur le lemme de Farkas. MPP. Tuilage monoparamétrique de polyèdres convexes et de fonctions affines. Voir la thèse de G. Iooss. mppcodegen. Générateur de code polyédrique, avec tuilage monoparamétrique (parallélépipèdes, hexagones, diamants). mppcheck. Vérification d'une transformation de programme polyédrique, avec tuilage monopararamétrique (idem). kut. Compilateur source-à-source pour guider l'ordonnancement en ligne (prototype). Chuba. Compilation des accès à la mémoire externe pour l'outil de synthèse C2H d'Altera. Voir la thèse d'A. Plesco. Rank. Terminaison de programmes et calcul symbolique de la complexité au pire. Contact Address LIP, ENS Lyon 46, Allee d'Italie 69364 Lyon Cedex 07, France Phone +33/0 4 72 72 85 03 Fax +33/0 4 72 72 80 80 E-Mail Christophe(dot)Alias( - a t - )ens-lyon(dot)fr",
  "content_length": 3223,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:57"
}