{
  "name": "Christian Gagné 0001",
  "homepage": "https://chgagne.github.io",
  "status": "success",
  "content": "Christian Gagné - Site Web de Christian Gagné Christian Gagné Chaire Canada-CIFAR en intelligence artificielle, Mila Directeur de l’Institut intelligence et données (IID) Professeur à l’Université Laval Follow Québec, Québec, Canada christian.gagne@gel.ulaval.ca Publications (Scholar) CV académique Bluesky LinkedIn GitHub Projets de doctorat disponibles dans mon équipe : Méthodes pour l’apprentissage de modèles profonds interprétables, fiables et robustes Apprentissage de modèles de transport basés sur des données pour évaluer les effets des nouvelles infrastructures et d’événements rares Directeur de l’Institut intelligence et données (IID) Chaire en intelligence artificielle Canada-CIFAR, membre académique associé à Mila Membre du LVSN / CeRVIM / CRDM / REPARTI / UNIQUE / VITAM / OBVIA Professeur titulaire au département de génie électrique et de génie informatique de l’Université Laval Adresse : Département de génie électrique et de génie informatique Pavillon Adrien-Pouliot Université Laval Québec (Québec)  G1V 0A6 Canada Bureau : PLT-1138-F Courriel : christian.gagne@gel.ulaval.ca Téléphone : utilisez le courriel Biographie courte Christian Gagné est professeur au département de génie électrique et de génie informatique de l’Université Laval depuis 2008. Il est directeur fondateur de l’Institut intelligence et données (IID). Il détient une Chaire en intelligence artificielle Canada-CIFAR et est membre académique associé à Mila. Il est également membre du Laboratoire de vision et systèmes numériques (LVSN), une composante du Centre de recherche en robotique, vision et intelligence machine (CeRVIM) ainsi que du Centre de recherche en données massives (CRDM) de l’Université Laval. Il fait partie des regroupements stratégiques REPARTI et UNIQUE du FRQNT, du centre VITAM du FRQS et de l’Observatoire international sur les impacts sociétaux de l’IA et du numérique (OBVIA). Il a complété un doctorat en génie électrique (Université Laval) en 2005 pour ensuite effectuer un stage postdoctoral conjointement à l’INRIA Saclay (France) et l’Université de Lausanne (Suisse) en 2005-2006. Il a œuvré comme associé de recherche en milieu industriel entre 2006 et 2008. Ses intérêts de recherche portent sur l’apprentissage profond et l’optimisation stochastique. En particulier, il s’intéresse à la robustesse et à la généralisation des réseaux de neurones profonds, les approches neuro-symboliques pour en favoriser l’interprétabilité, et le développement de modèles fondationels multimodaux. Une part importante de ses travaux porte également sur la mise en pratique de ces techniques dans des domaines comme la vision numérique, la microscopie à super-resolution, la santé, les transports, et l’énergie. Pour plus de détails, consultez le CV.",
  "content_length": 2768,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:03"
}