{
  "name": "Christopher Morris 0001",
  "homepage": "https://chrsmrrs.github.io",
  "status": "success",
  "content": "Christopher Morris Christopher Morris I am a tenure-track assistant professor and DFG Emmy Noether fellow at RWTH Aachen University, where I lead the Learning on Graphs (LoG) group. Before joining RWTH, I was a postdoc at the Mila - Quebec AI Institute and McGill University in the group of Siamak Ravanbakhsh and a postdoc at Polytechnique Montréal in the group of Andrea Lodi. Before my Montréal stint, I was a PhD student at TU Dortmund University advised by Petra Mutzel and Kristian Kersting. In Aachen, I supervise six great PhD students Luis Müller, Chendi Qian, Antoine Siraudin, Antonis Vasileiou, Timo Stoll, and Solveig Wittig. We develop machine learning methods for (graph-)structured data. Our research combines techniques from machine learning, TCS, and (discrete) mathematics and revolves around the following questions: How do we effectively capture (graph-)structured data in a data-driven manner? How can we ensure such methods generalize to unseen data? How can such methods make combinatorial algorithms faster in a data-driven manner? For more details, please see my CV. You can also find me on X, Bluesky, and GitHub. Fun Fact: My Erdős number is at most 3 (via Petra Mutzel → Bojan Mohar → P. Erdős). Email: morris[ät]cs.rwth-aachen[dot]de Currently, we do not accept interns. Selected Publications (All) Covered Forest: Fine-grained generalization analysis of graph neural networks Antonis Vasileiou, Ben Finkelshtein, Floris Geerts, Ron Levie, Christopher Morris, International Conference on Machine Learning (ICML) 2025. Towards Principled Graph Transformers Luis Müller, Daniel Kusuma, Blai Bonet, Christopher Morris, Neural Information Processing Systems (NeurIPS) 2024. Weisfeiler-Leman at the margin: When more expressivity matters Billy J. Franks, Christopher Morris, Ameya Velingker, Floris Geerts, International Conference on Machine Learning (ICML) 2024. Exploring the Power of Graph Neural Networks in Solving Linear Optimization Problems Chendi Qian, Didier Chételat, Christopher Morris, International Conference on Artificial Intelligence and Statistics (AISTATS) 2024. Fine-grained Expressivity of Graph Neural Networks Jan Böker, Ron Levie, Ningyuan Huang, Soledad Villar, Christopher Morris, Neural Information Processing Systems (NeurIPS) 2023. Combinatorial optimization and reasoning with graph neural networks Quentin Cappart, Didier Chételat, Elias B. Khalil, Andrea Lodi, Christopher Morris, Petar Velickovic, Journal of Machine Learning Research, 2023. WL meet VC Christopher Morris, Floris Geerts, Jan Tönshoff, Martin Grohe, International Conference on Machine Learning (ICML) 2023. Ordered Subgraph Aggregation Networks Chendi Qian, Gaurav Rattan, Floris Geerts, Christopher Morris, Mathias Niepert, Neural Information Processing Systems (NeurIPS) 2022. Weisfeiler and Leman go sparse: Towards scalable higher-order graph embeddings Christopher Morris, Gaurav Rattan, Petra Mutzel, Neural Information Processing Systems (NeurIPS) 2020. Weisfeiler and Leman Go Neural: Higher-order Graph Neural Networks Christopher Morris, Martin Ritzert, Matthias Fey, William L. Hamilton, Jan Eric Lenssen, Gaurav Rattan, Martin Grohe, AAAI Conference on Artificial Intelligence (AAAI) 2019. Teaching Semester WS 25/26 Class (Bachelor+Master): Foundations and Applications of Machine Learning on Graphs Seminar (Master): Machine Learning for Combinatorial Optimization Seminar (Master): Theory of Machine Learning on Graphs SS 25 Class (Master): Algorithmic Foundations of Data Science Seminar (Master): Theory of Machine Learning on Graphs WS 24/25 Seminar (Master): Transformer on Graphs Seminar (Bachelor): Maschinelles Lernen mit Graphen SS 24 Class (Bachelor+Master): Foundations and Applications of Machine Learning with Graphs WS 23/24 Seminar (Master): Foundations of Supervised Machine Learning with Graphs Seminar (Bachelor): Maschinelles Lernen mit Graphen SS 23 Class (Master): Foundations and Applications of Machine Learning with Graphs Seminar (Bachelor): Maschinelles Lernen mit Graphen WS 22/23 Seminar (Master): Foundations of Supervised Machine Learning with Graphs Seminar (Master): Machine Learning for Combinatorial Optimization",
  "content_length": 4186,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:25"
}