{
  "name": "Chris Chitty",
  "homepage": "http://www.massey.ac.nz/massey/expertise/profile.cfm?stref=106050",
  "status": "success",
  "content": "Chris Chitty - Research Laboratory Technical Manager - Massey University Skip to Content BackMassey expertise searchMassey expertise searchMassey expertise searchDoctoral student profilesSearch for output by keyword/authorExpertise search Show search form Expertise search People search (Filtering) Expertise search College All Colleges College of Creative Arts College of Health College of Humanities and Social Sciences College of Sciences DVC Maori Governance and Assurance Massey Business School Massey University Foundation Office of the Provost Strategy Planning and Analytics Students and Global Engagement University Services Department All Departments Academic Business Development Ag and Hort Enterprises Ako Aotearoa Centre for Public Health Research CoCA - Partnerships and Projects CoCA - Professional Administration CoCA - Technical Services CoCA -Teaching and Learning CoCA Maori and Pacific Arts - Te Ranga Tai Kura CoH - Professional Administration CoHSS - Academic Programme CoHSS - Business Manager CoHSS - Professional Administration CoHSS - Teaching and Learning CoS - Professional Administration College Office - Albany College Office - Wellington College of Creative Arts College of Health College of Humanities and Social Sciences College of Sciences DVC Maori DVC Maori - Business Services DVC Maori - Oteha Enterprise Estates Management Finance FoodPilot Funding and Forecast Global Engagement Global Partnership Graduate Research School and Ethics Health Safety and Wellbeing IT Group Information Technology Services Institute of Education Institutional Research Library MBS - Professional Administration MBS - Research MU Foundation Manawatu Microscopy and Imaging Centre Maori Student Success Marketing Student Recruitment and Alumni Massey Business School Massey Business School - Deputy PVC's Office Massey Genome Service Massey University Press Mediation Service NZ Food Safety Science Research Centre New Zealand Institute for Advanced Study Nutrition Lab Office of the DVC Students and Global Engagement Pacific Student Success People and Culture Planning and Performance Provost - Business Services Provost Advisory Research Centre for Maori Health and Development Research Operations Riddet Institute SFAT - Technical Services Manager (MAN) SHORE Centre School of Accountancy Economics and Finance School of Agriculture and Environment School of Art School of Aviation School of Built Environment School of Design School of Food Technology and Natural Sciences School of Health Sciences School of Humanities Media and Creative Comm School of Management and Marketing School of Mathematical and Computational Sciences School of Music and Screen Arts School of Nursing School of People Environment and Planning School of Psychology School of Social Work School of Sport Exercise and Nutrition School of Veterinary Science Student Experience Student Registry Students and Global Engagement - Business Services Te Mata o Te Tau Te Putahi-a-Toi Te Tumu Whakatipu The Centre for Education Transformation University Services - Business Services Whariki Research Centre Keywords Name Search Add criteria Position / Job Title College Department Reset Expertise search - Show advanced search Thematic All 21st Century Citizenship Design – for Commerce, Community and Culture Future Food Systems Health and Well-being Resource Development and Management Keywords Name Academic expert All staff General staff Reset Contact details +6492136566 Chris Chitty Research Laboratory Technical Manager School of Built Environment Chris is highly regarded as an innovator, and has excellent relationships with end-users. His reputation as a technology-focussed innovator with an unusual approach to solutions means he is often approached by individuals and companies seeking advice on products or technologies. Through his work with the “Let’s Get Inventing” TV show he was further able to inspire, advise and assist young inventers to create and patent their dreams. Chris has vast professional experience in the robotics and patient simulation, and is presently researching the unintended effects of modern lighting on humans and other biological lifeforms. Professional Contact details Ph: DD = 64 9 213 6566Location: AV 2.18, Albany Village level 2Campus: Albany Village, Auckland Research Expertise Thematics Health and Well-being Area of Expertise Field of research codes Biological Adaptation (060303): Biological Sciences (060000): Evolutionary Biology (060300): Medical And Health Sciences (110000): Neurosciences (110900): Ophthalmology and Optometry (111300): Other Technology (109900): Sensory Systems (110906): Technology (100000): Technology not elsewhere classified (109999): Vision Science (111303) Research Outputs Journal Request Academic Output Mander, S., & Chitty, C. (2019). The measurement blues. IEEE Instrumentation and Measurement Magazine. 22(2), 17-20[Journal article]Authored by: Chitty, C., Mander, S.Read Online: Read Abstract: 51 Report Mander, SM., & Chitty, C.(2017). Lighting assessment of Ward 7, North Shore Hospital. : Massey University[Technical Report]Authored by: Chitty, C., Mander, S. Mander, SM., & Chitty, C.(2015). Confidential Report. Massey University[Technical Report]Authored by: Chitty, C. Conference Mander, S., & Chitty, C. (2019, May). Measuring Flicker of Artificial Light Sources in the Home. Presented at I2MTC 2019 IEEE International Instrumentation & Measurement Technology Conference [Conference Oral Presentation]Authored by: Chitty, C., Mander, S. Boulic, M., Wang, Y., Phipps, R., Chitty, C., Cunningham, C., Moses, A., . . . Palfroy, C. (2018). A breath of fresh air: Engaging school-aged students with air quality science in New Zealand schools. 15th Conference of the International Society of Indoor Air Quality and Climate Indoor AIR 2018. [Conference Paper in Published Proceedings]Authored by: Boulic, M., Chitty, C., Cunningham, C., Page, W.Read Abstract: 1 Wang, Y., Jang-Jaccard, J., Boulic, M., Phipps, R., Chitty, C., Weyers, R., . . . Cunningham, C. (2018). Deployment Issues for Integrated Open-Source-ased Indoor Air Quality School Monitoring Box (SKOMOBO). 2018 IEEE Sensors Applications Symposium (SAS). (pp. 1 - 4). : IEEE Sensors Applications Symposium (SAS)[Conference Paper in Published Proceedings]Authored by: Boulic, M., Chitty, C., Cunningham, C. Wang, Y., Jang-Jaccard, J., Boulic, M., Phipps, R., Chitty, C., Weyers, R., . . . Cunningham, C. (2018). Deployment issues for integrated open-source-Based indoor air quality school Monitoring Box (SKOMOBO). 2018 IEEE Sensors Applications Symposium Sas 2018 Proceedings. Vol. 2018-January (pp. 1 - 4). [Conference Paper in Published Proceedings]Authored by: Boulic, M., Chitty, C., Cunningham, C.Read Online: Read Abstract: 13 Boulic, M., Wang, Y., Phipps, R., Chitty, C., Cunningham, C., Moses, A., . . . Ponder-Sutton, A. (2018). A breath of fresh air: engaging school-aged students with air quality science in New Zealand schools.. In IA 2018 Proceedings, Indoor Air 2018 Chantilly, United States of America: International Society of Indoor Air Quality and Climate[Conference Abstract]Authored by: Boulic, M., Chitty, C., Cunningham, C.Read Abstract: view more... Weyers, R., Jang-Jaccard, J., Moses, A., Wang, Y., Boulic, M., Chitty, C., . . . Cunningham, C. (2017). Low-cost Indoor Air Quality (IAQ) Platform for Healthier Classrooms in New Zealand: Engineering Issues. Proceedings 2017 4th Asia Pacific World Congress on Computer Science and Engineering Apwc on Cse 2017. (pp. 208 - 215). [Conference Paper in Published Proceedings]Authored by: Boulic, M., Chitty, C., Cunningham, C.Read Abstract: 267 Mander, SM., & Chitty, C.(2017). Photometric testing: The value of observations. . Brisbane, Australia[Conference Paper]Authored by: Chitty, C., Mander, S. Carnegie, DA., McVay, J., Molyneaux, L., & Chitty, C.An affordable, robust mining inspection robot. Proceedings of the 2015 7th IEEE International Conference on Cybernetics and Intelligent Systems Cis 2015 and Robotics Automation and Mechatronics Ram 2015. (pp. 143 - 148). [Conference]Authored by: Chitty, C.Read Online: Read Abstract: 21 Almanji, A., Moir, TJ., Chitty, C., & Chang, J. (2010). Vision tracking and voice-controlled foyer service robot. 20th Annual American Society of Mechanical Engineers (ASME) Conference on Information Storage & Processing Systems ISPS' 2010. (pp. 150 - 152). [Conference Paper in Published Proceedings]Authored by: Chitty, C.Read Abstract: view less... Other Mander, S., & Chitty, C. (2021). Feeling sick from LED lighting?. (pp. 84 - 85). BRANZ Ltd[Other]Authored by: Chitty, C., Mander, S. Mander, S., & Chitty, C. (2019, July). Flicker. In 2019 IESANZ (NZ Chapter) Annual Chapter Meeting. [Oral Presentation]Authored by: Chitty, C., Mander, S.",
  "content_length": 8798,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:34"
}