{
  "name": "Chris Pal",
  "homepage": "https://sites.google.com/view/christopher-pal",
  "status": "success",
  "content": "Christopher PalSearch this siteEmbedded FilesSkip to main contentSkip to navigationFull Professor / Professeur TitulairePolytechnique Montréal & MilaAdjunct Professor, UdeM DIROCanada CIFAR AI Chair,Distinguished Scientist, ServiceNow ResearchGoogle Scholar | Mila | Polytechnique   Select PublicationsShubham Agarwal, Gaurav Sahu, Abhay Puri, Issam H. Laradji, Krishnamurthy DJ Dvijotham, Jason Stanley, Laurent Charlin, Christopher Pal. \"LitLLMs, LLMs for Literature Review: Are we there yet?\",  TMLR 2025.Project page: https://litllm.github.io/Aditya Sharma, Aman Dalmia, Mehran Kazemi, Amal Zouaq, Christopher J. Pal (2025) \"GeoCoder: Solving Geometry Problems by Generating Modular Code through Vision-Language Models\",  NAACL Findings 2025.Ge Ya Luo, Zhi Hao Luo, Anthony Gosselin, Alexia Jolicoeur-Martineau, Christopher Pal \"Ctrl-V: Higher Fidelity Autonomous Vehicle Video Generation with Bounding-Box Controlled Object Motion\",  TMLR 2025.Project page: https://github.com/oooolga/Ctrl-VGe Ya (Olga) Luo, Gian Favero, Zhi Hao Luo, Alexia Jolicoeur-Martineau, Christopher Pal. \"Beyond FVD: Enhanced Evaluation Metrics for Video Generation Quality\",  ICLR 2025.Project page: https://oooolga.github.io/JEDi.github.io/Matthew Fortier, Mats L. Richter, Oliver Sonnentag, Chris Pal \"CarbonSense: A Multimodal Dataset and Baseline for Carbon Flux Modelling\",  ICLR 2025.Md Rifat Arefin, Gopeshh Subbaraj, Nicolas Gontier, Yann LeCun, Irina Rish, Ravid Shwartz-Ziv, Christopher Pal.  \"Seq-VCR: Preventing Collapse in Intermediate Transformer Representations for Enhanced Reasoning\",  ICLR 2025.Ye Yuan, Can Chen, Christopher Pal, Xue Liu. \"ParetoFlow: Guided Flows in Multi-Objective Optimization\",  ICLR 2025.Gaurav Sahu, Abhay Puri, Juan Rodriguez, Amirhossein Abaskohi, Mohammad Chegini, Alexandre Drouin, Perouz Taslakian, Valentina Zantedeschi, Alexandre Lacoste, David Vazquez, Nicolas Chapados, Christopher Pal, Sai Rajeswar Mudumba, Issam Hadj Laradji.  \"InsightBench: Evaluating Business Analytics Agents Through Multi-Step Insight Generation\",  ICLR 2025.Juan A. Rodriguez, Abhay Puri, Shubham Agarwal, Issam H. Laradji, Pau Rodriguez, Sai Rajeswar, David Vazquez, Christopher Pal, Marco Pedersoli. \"StarVector: Generating Scalable Vector Graphics Code from Images and Text\",  CVPR 2025.Project page: https://starvector.github.io/Luke Rowe, Roger Girgis, Anthony Gosselin, Liam Paull, Christopher Pal, Felix Heide \"Scenario Dreamer: Vectorized Latent Diffusion for Generating Driving Simulation Environments\",  CVPR 2025.Project page: https://github.com/princeton-computational-imaging/scenario-dreamerVikram Voleti, Chris Finlay, Adam Oberman, Christopher Pal. (2024). Multi-Resolution Continuous Normalizing Flows. Annals of Mathematics and Artificial Intelligence & arXiv preprint arXiv: 2106.08462Martin Weiss, Nasim Rahaman, Manuel Wuthrich, Yoshua Bengio, Li Erran Li, Bernhard Schölkopf, Christopher Pal. Redesigning Information Markets in the Era of Language Models. Conference on Language Models (COLM 2024)Simon Chamorro, Victor Klemm, Miguel de la Iglesia Valls, Christopher Pal, Roland Siegwart. (2024) Reinforcement Learning for Blind Stair Climbing with Legged and Wheeled-Legged Robots. ICRA 2024.Hattami, A.E., Raimondo, S., Laradji, I., Vazquez, D., Rodriguez, P. and Pal, C., (2023). Workflow Discovery from Dialogues in the Low Data Regime. Transactions on Machine Learning Research (TMLR), Feb. 2023 & arXiv preprint arXiv:2205.11690.Glen Berseth, Florian Golemo, Christopher Pal (2023) Towards Learning to Imitate from a Single Video Demonstration.  Journal of Machine Learning Research (JMLR); 24(78):1−26.Beckham, C., Weiss, M., Golemo, F., Honari, S., Nowrouzezahrai, D. and Pal, C. (2023). Visual question answering from another perspective: CLEVR mental rotation tests. Pattern Recognition, vol. 136, p.109209 & arXiv preprint arXiv:2212.01639.Roger Girgis, Florian Golemo, Felipe Codevilla, Jim Aldon D'Souza, Martin Weiss, Samira Ebrahimi Kahou, Felix Heide, and Christopher Pal.  \"Latent Variable Sequential Set Transformers For Joint Multi-Agent Motion Prediction.\" arXiv preprint arXiv:2104.00563 (V1 Feb. 2021, V3 Feb. 2022) & ICLR 2022.Project page: https://fgolemo.github.io/autobots/Top row (real frames), bottom row (prediction)Vikram Voleti, Alexia Jolicoeur-Martineau, Christopher Pal.  \"MCVD: Masked Conditional Video Diffusion for Prediction, Generation, and Interpolation\" NeurIPS 2022, arXiv preprint  arXiv:2205.09853.Project page: https://mask-cond-video-diffusion.github.io/Martin Weiss, Nasim Rahaman, Francesco Locatello, Chris Pal, Yoshua Bengio, Nicolas Ballas, Erran Li \"Neural Attentive Circuits\" NeurIPS 2022,  arXiv preprint arXiv:2210.08031. M Tesfaldet, D Nowrouzezahrai, C Pal \"Attention-based Neural Cellular Automata\" NeurIPS 2022, arXiv preprint arXiv:2211.01233.Paul Barde, Tristan Karch, Derek Nowrouzezahrai, Clément Moulin-Frier, Christopher Pal, Pierre-Yves Oudeyer \"Learning to Guide and to Be Guided in the Architect-Builder Problem.\" arXiv preprint arXiv:2112.07342 & ICLR 2022.Nan Rosemary Ke, Aniket Didolkar, Sarthak Mittal, Anirudh Goyal, Guillaume Lajoie, Stefan Bauer, Danilo Rezende, Yoshua Bengio, Christopher Pal, Michael Mozer. Systematic Evaluation of Causal Discovery in Visual Model Based Reinforcement Learning. NeurIPS 2021 (Datasets and Benchmarks Track)Jonathan Pilault*, Amine El hattami*, Chris Pal.  Conditionally Adaptive Multi-Task Learning: Improving Transfer Learning in NLP Using Fewer Parameters & Less Data. ICLR 2021 (*Joint first authors)Delay Correcting  ϟ  Actor CriticYann Bouteiller*, Simon Ramstedt*, Giovanni Beltrame, Chris Pal, Jonathan Binas.  Reinforcement Learning with Random Delays. ICLR 2021 (*Equal contributions)Yoshua Bengio*, Prateek Gupta*, Tegan Maharaj*, Nasim Rahaman*, Martin Weiss*, Tristan Deleu, Eilif Muller, Meng Qu, Victor Schmidt, Pierre-Luc St-Charles, Hannah Alsdurf, Olexa Bilanuik, David Buckeridge, Gáetan Marceau Caron, Pierre-Luc Carrier, Joumana Ghosn, Satya Ortiz-Gagne, Chris Pal, Irina Rish, Bernhard Schölkopf, Abhinav Sharma, Jian Tang, Andrew Williams Predicting Infectiousness for Proactive Contact Tracing. ICLR 2021 (*Lead authors)Torsten Scholak*, Raymond Li*, Dzmitry Bahdanau, Harm de Vries, Chris Pal.  DuoRAT: Towards Simpler Text-to-SQL Models. NAACL 2021. (*Equal contributions)Jonathan Pilault, Raymond Li, Sandeep Subramanian and Chris Pal.  On Extractive and Abstractive Neural Document Summarization with Transformer Language Models. EMNLP 2020. (BibTeX)Nicolas Gontier, Koustuv Sinha, Siva Reddy, Christopher Pal. Measuring Systematic Generalization in Neural Proof Generation with Transformers. NeurIPS 2020.Julien Roy, Paul Barde, Félix G. Harvey, Derek Nowrouzezahrai, Christopher Pal. Promoting Coordination through Policy Regularization in Multi-Agent Deep Reinforcement Learning. NeurIPS 2020.Barde, P., Roy, J., Jeon, W., Pineau, J., Pal, C. and Nowrouzezahrai, D., 2020. Adversarial Soft Advantage Fitting: Imitation Learning without Policy Optimization. NeurIPS 2020.Rupprecht, Christian, Cyril Ibrahim, and Christopher J. Pal. \"Finding and Visualizing Weaknesses of Deep Reinforcement Learning Agents.\" ICLR 2020.A Casanova, PO Pinheiro, N Rostamzadeh, CJ Pal \"Reinforced active learning for image segmentation\". Project Github, ICLR 2020.Bengio, Y., Deleu, T., Rahaman, N., Ke, R., Lachapelle, S., Bilaniuk, O., Goyal, A. and Pal, C. (2020). A meta-transfer objective for learning to disentangle causal mechanisms. ICLR 2020.Code on GitHub: https://github.com/authors-1901-10912/A-Meta-Transfer-Objective-For-Learning-To-Disentangle-Causal-MechanismsFélix G Harvey, Mike Yurick, Derek Nowrouzezahrai, Christopher Pal. \"Robust motion in-betweening\". SIGGRAPH 2020, ACM Transactions on Computer Graphics.Beckham, Christopher, Sina Honari, Vikas Verma, Alex M. Lamb, Farnoosh Ghadiri, R. Devon Hjelm, Yoshua Bengio, and Chris Pal. \"On Adversarial Mixup Resynthesis.\" NeurIPS 2019.Project page and code on GitHub: https://github.com/christopher-beckham/amrRamstedt, Simon, and Chris Pal. \"Real-Time Reinforcement Learning.\" NeurIPS 2019.Project page and code on GitHub: https://github.com/rmst/rtrlLim, J.H., Pinheiro, P.O., Rostamzadeh, N., Pal, C., Ahn, S. Neural Multisensory Scene Inference. NeurIPS 2019.Mehta, Bhairav, Manfred Diaz, Florian Golemo, Christopher J. Pal, and Liam Paull. \"Active domain randomization.\" In the Conference on Robot Learning (CoRL). arXiv preprint arXiv:1904.04762 (2019).Project page and code on GitHub: https://github.com/montrealrobotics/active-domainrandWeiss, Martin, Simon Chamorro, Roger Girgis, Margaux Luck, Samira E. Kahou, Joseph P. Cohen, Derek Nowrouzezahrai, Doina Precup, Florian Golemo, and Chris Pal. \"Navigation Agents for the Visually Impaired: A Sidewalk Simulator and Experiments.\" In the Conference on Robot Learning (CoRL).  arXiv preprint arXiv:1910.13249 (2019).Project page: https://mweiss17.github.io/SEVN/Piche, A., Thomas, V., Ibrahim, C., Bengio, Y., & Pal, C. (2019). Probabilistic Planning with Sequential Monte Carlo methods. In the proceedings of the International Conference on Learning Representations (ICLR).Rostamzadeh, N., Hosseini, S., Boquet, T., Stokowiec, W., Zhang, Y., Jauvin, C. and Pal, C., 2018. Fashion-gen: The generative fashion dataset and challenge. arXiv preprint arXiv:1806.08317.The FashionGen Challenge website: https://sites.google.com/view/cvcreative/fashion-genLi, Raymond, Samira Ebrahimi Kahou, Hannes Schulz, Vincent Michalski, Laurent Charlin, and Chris Pal. \"Towards deep conversational recommendations.\" In Advances in neural information processing systems, pp. 9725-9735. 2018.Project page: https://redialdata.github.io/website/Subramanian, Sandeep, Sai Rajeswar Mudumba, Alessandro Sordoni, Adam Trischler, Aaron C. Courville, and Chris Pal. \"Towards text generation with adversarially learned neural outlines.\" In Advances in Neural Information Processing Systems (NeurIPS), pp. 7551-7563. 2018.See also: Subramanian, S., Raj",
  "content_length": 14720,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:44"
}