{
  "name": "Chris Fermüller",
  "homepage": "https://www.logic.at/staffpages/chrisf",
  "status": "success",
  "content": "Chris Fermüller<br/><h3>ao. Prof., Dipl.Ing. Dr.techn.</h3> | Theory and Logic Room: HB 0316 Tel: +43 1 58801 18543 Fax: +43 1 58801 18597 Available: Monday, 11.00-12.30 (during lecture period, if not announced otherwise below) Mail: chrisf@logic.at Function: Associate Professor Office Hours: Monday, 11.00-12.30, only during lecture period, otherwise by appointment via email. Note: Please contact me by email: chrisf@logic.at Teaching I am regularly in charge of the following courses: Theoretische Informatik und Logik (VU) (jointly with Marion Oswald) Logic and Computability (Lectures with integrated exercise part) Nonclassical Logics (Lectures with integrated exercise part) Seminar in Artificial Intelligence Seminar in Logic Formal Semantics of Natural Language (I also participate in a number of other courses) Documents, Publications, Links The Logic Algebra and Truth Degrees (LATD) conference 2023 Some of my publications (DB&LP Bibliography Server). A more complete (but hardly ever up-to-date) list of my scientific publications in [PDF format] SPECIFICALLY: For selected publications on logical games and connections to proof theory click here Lecture slides on 'Games and Analytic Systems' from a short course at the Sommer School for Proof Theory in First-Order Logic in Funchal, Madeira, 22.-27.08.2017: Part I, Part II I am a fan of Bob Brandom's approach to logic. However, I think there is a deep trouble with one of Brandom's central claims about `holistic, yet recursive semantics'. I'd be glad to receive comments on a corresponding paper: Some Critical Remarks on Incompatibility Semantics (appeared in: The Logica Yearbook 2009, College Publications 2010). Link to research projects of the group. Education The wrong one .... (... although I enjoyed, e.g., Hermann Fillitz's lectures on the history of medieval art) Current Fields of Research Formal Models of Reasoning Under Vagueness Proof Theory and Proof Search in Non-Classical Logics Automated Deduction Mathematical Fuzzy Logic Logical Methods in Philosophy Cambodian cuisine, language and culture ;-) Membership in current and past projects (Selection) li>Project Title: MoVaQu-MFL - Modeling Vague Quantifiers in Mathematical Fuzzy Logic FWF [Austrian Science Foundation] Project no. I1897-N25 Head: C. Fermüller Project Title: LOGFRADIG - A Logical Framework for Dialogue Games FWF [Austrian Science Foundation] Project no. P125417-G15 Head: C. Fermüller Project Title: Game theoretic approaches to many valued logics Bilateral Co-operation Agreement with the Academy of Sciences of the Czech Republic (OeAD-WTZ), Head (of the Austrian team): C. Fermüller Project Title: STRUCTURAL - Structural and computational proof theory Joint project between TU Vienna, University of Innsbruck, Universite Paris Diderotis, INRIA Saclay/Ile-de-France FWF [Austrian Science Foundation] Project no. I-603-N18 Project Coordinators: Georg Moser, Michel Parigot Project Title: LoMoReVI Logical Models of Reasoning with Vague Information ESF-LogICCC Project (Austria, Czech Republic, Spain) Head (`Principal Leader'): C. Fermüller Project Title: Contextualism, supervaluation, and fuzzy logic Subproject of LoMoReVI (see above) FWF [Austrian Science Foundation] Project no. I143-G15 Head (`Principal Investigator'): C. Fermüller Project Title: Constraint Satisfaction Problems and Many-valued Logics Bilateral Co-operation Agreement with Spain ( Accion Integrada ) Head: G. Salzer Project Title: Analytic Systems and Dialogue Games as Semantics of Fuzzy Logics FWF [Austrian Science Foundation] Project no. P16563-N14 Head: C. Fermüller Project Title: Algebraic Foundations and Dialogue Game Semantics for Fuzzy Logics Bilateral Co-operation Agreement with Spain (OeAD-WTZ Accion Integrada) Head (of the Austrian team): C. Fermüller About Us Staff Members | Address and Contact Information Research Research Fields | Projects | Publications & Software Datenschutzerklärung",
  "content_length": 3942,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:35"
}