{
  "name": "Christopher Frances Batten",
  "homepage": "http://www.csl.cornell.edu/~cbatten",
  "status": "success",
  "content": "laur Christopher Batten Christopher Batten Home News Publications Teaching Outreach Lab Photos Christopher Batten Professor Computer Systems Laboratory School of Electrical and Computer Engineering College of Engineering Cornell University office: 323 Rhodes Hall, Ithaca, NY 14853 phone: (607) 255-2672 email: cbatten cornell edu I am a Professor of Electrical and Computer Engineering and a graduate field member of Computer Science at Cornell University. My research group is part of the Computer Systems Laboratory, and we largely work at the intersection of computer architecture, electronic design automation, and digital VLSI including projects on parallel programming frameworks, programmable accelerator design, interconnection networks, productive VLSI chip design methodologies, and architectures for future emerging technologies. Building prototype systems is an integral part of my research, as this is one of the best ways to validate assumptions, gain intuition about physical design issues, and provide platforms for future software research. My research has been recognized with several awards including the ACM/IEEE MICRO Hall of Fame, a Cornell Engineering Research Excellence Award, an AFOSR Young Investigator Program award, an Intel Early Career Faculty Honor Program award, an NSF CAREER award, a DARPA Young Faculty Award, an IEEE Micro Top Picks selection, and MLCAD Best Artifact Award. My teaching has been recognized with the Ruth and Joel Spira Award for Excellence in Teaching, a Kenneth A. Goldman '71 Teaching Award, two Michael Tien '72 Excellence in Teaching Awards, Canaan Family Award for Excellence in Academic Advising, a James M. and Marsha D. McCormick Award for Outstanding Advising of First-Year Engineering Students, and twice as the most influential college educator of a Merrill Presidential Scholar (Courtney Golden BS'23 and Aidan McNay BS'24). In 2023–2024, I was a Visiting Scholar at the University of California, Berkeley working in the SLICE Lab and a Visiting Professor at NVIDIA working in the Accelerator & VLSI Research Group. In 2018, I was a Visiting Scholar at the Computer Laboratory at the University of Cambridge and a Visiting Fellow at Clare Hall in Cambridge, UK. Prior to joining Cornell University, I received my Ph.D. in Electrical Engineering and Computer Science from the Massachusetts Institute of Technology. I received an M.Phil. in Engineering as a Churchill Scholar at the University of Cambridge in 2000, and received a B.S. in Electrical Engineering as a Jefferson Scholar at the University of Virginia in 1999. Recent News Oct 2025: Completely redesigned version of ECE 6475 Complex Digital ASIC Design to be offered in Spring 2026. This will the first tape-out course offered at Cornell in 20 years. The course is structured around three projects focused on digital chip design each of which is 4â5 weeks long and completed in groups of 2â3 students. The course is supported through the College of Engineering, the Center for Education of Microchip Designers, and the Taiwan Semiconductor Manufacturing Company and will also included engagement with current digital design and verification engineers at Apple. See flyer for more information. Oct 2025: Paper revisiting VerilogEval (in collaboration with our colleagues at NVIDIA) published in ACM ACM Transactions on Design Automation of Electronic Systems (TODAES) Oct 2025: Elton Shih presented our work on edge algorithm-hardware co-design framework for adaptive sampling at the 1st Workshop on Architecture for Health (Arch4Health'25) held in conjunction with MICRO in Seoul, South Korea Oct 2025: Derin Ozturk presented our work on a new benchmark suite and evaluation framework for insect-scale robotics at the IEEE Int'l Symp. on Workload Characterization (IISWC'25) in Irvine, CA Sep 2025: Paper on an edge algorithm-hardware co-design framework for adaptive sampling (in collaboration with our colleagues at the University of New South Wales, Australia) is accepted to the 1st Workshop on Architecture for Health (Arch4Health'25) to be held in conjunction with MICRO-58 Sep 2025: Received the Canaan Family Award for Excellence in Academic Advising (one of the highest awards for advising in the College of Engineering at Cornell University) Aug 2025: Course website for ECE 2300 Digital Logic and Computer Organization now online Aug 2025: Zhantong Qiu from the University of California, Davis joins the Batten Reseach Group as a visiting scholar – Welcome! Aug 2025: Paper on a new benchmark suite and characterization of computational pangenomics (in collaboration with Prof. Reetu Das at the University of Michigan) accepted to the IEEE Int'l Symp. on Workload Characterization (IISWC'25) Aug 2025: Paper on a new benchmark suite and evaluation framework for insect-scale robotics (in collaboration with Prof. Farrell Helbling) accepted to the IEEE Int'l Symp. on Workload Characterization (IISWC'25) Jul 2025: Paper on a new heterogeneous architecture for universal sequence alignment acceleration (in collaboration with our colleagues at the Universitat Politecnica de Catalunya and Barcelona Supercomputing Center) accepted to the 58th ACM/IEEE Int'l Symp. on Microarchitecture (MICRO'25) Jul 2025: Paper on characterizing and optimizing realistic workloads on a commercial compute-in-SRAM device (in collaboration with Prof. Zhiru Zhang and Dan Ilan at GSI Technologies) accepted to the 58th ACM/IEEE Int'l Symp. on Microarchitecture (MICRO'25) Jun 2025: Presented ideas on experiential learning for semiconductor chip design through student-led project teams at the NORDTECH Lunch & Learn series May 2025: Cornell College of Engineering proposal to explore custom system-on-chip design for insect-scale robots (in collaboration with E. Farrell Helbling) is funded as part of the Support for Promising Research Opportunities and Unconventional Team (SPROUT) program May 2025: Austin Rovinski presented our work on using hybrid 2.5D/3D integration to scale co-packaged optical interconnects at the IEEE Int'l Symp. on Circuits and Systems (ISCAS'25) in London, UK May 2025: Aidan McNay, Jikai Wang, Weixuan Sun, Zhangxiao Huang, and Lawrence Atienza completed their MEng design projects. Aidan is graduating and heading to NVIDIA; Weixuan is also graduating and heading to VeriSilicon – Congratulations! May 2025: Derin Ozturk presented a poster on EntoBench, a benchmark suite and evaluation framework for insect-scale robotics, at the Workshop on Robotics Acceleration with Computing Hardware (RoboARCH) held in conjunction with ICRA in Atlanta, GA May 2025: Invited to present work on PyMTL3 at Jane Street Xcelerator Colloquium held in NYC May 2025: ECE 6745 students presented 20 design projects including interactive demonstrations of their testing strategy and evaluation along with post-place-and-route ASIC results for performance, energy, and area; projects included an HLS-based singular value decomposition accelerator, graphics rasterization accelerator, integrated RISC-V vector engine, decoupled SIMT processor, Snappy decompression accelerator, multi-layer perceptron accelerator, random tree traversal accelerator, Smith Waterman alignment accelerator, SHA256 accelerator, cache with hardware compression, snoopy cache coherent memory system, and low-power floating-point unit; six projects were selected for presentation to 12 Apple engineers for technical feedback. May 2025: Attended MemPanG25, a hands-on course on computational pangenomics held at the University of Tennessee Health Science Center in Memphis, TN May 2025: Attended the 2025 Computer Systems Laboratory Retreat at the Tata Innovation Center, Cornell Tech, NYC with over 75 attendees (including industry vistors from IBM, DE Shaw, and Meta), two distinguished keynote speakers, student research talks, and a poster session (group photo) May 2025: Aidan McNay's MEng design project titled \"BLIMP: BRG's Latency Insensitive Modular Processor\" won first place during the annual ECE MEng poster session – Congratulations! May 2025: Last fall we taped out BRGTC6, our sixth computer architecture test chip: a 1x1mm chip in TSMC 65nm intended to test our new open-source chip-to-chip source-synchronous interface (die photo,report). We developed a custom chip test board that enables testing this interface between two identical packaged chips; test chips returned from packaging this spring and were fully functional with the chip-to-chip interface operational up to 200MHz. The chip was designed, implemented, and tested by Barry Lyu, Vayun Tiwari, and Parker Schless. Apr 2025: Angela Cui was selected as a National Science Foundation (NSF) Graduate Research Fellow – Congratulations! Mar 2025: Paper on optically connected multi-stack HBM modules for large language model training and inference published in IEEE Computer Architecture Letters Feb 2025: Paper describing our work using hybrid 2.5D/3D integration to scale co-packaged optical interconnects (with our collaborators Al Molnar at Cornell and Keren Bergman at Columbia) accepted to the IEEE Int'l Symp. on Circuits and Systems (ISCAS'25) Jan 2025: Course website for ECE 6745 Complex Digital ASIC Design now online Dec 2024: NORDTECH Microelectronics Commons proposal to support the Cornell Custom Silicon Systems (C2S2) project team is funded. C2S2 has now taped out four chips on SkyWater 130nm over two years. In the first year, they taped out an analog chip with two operational amplifiers and a digital chip with an FFT accelerator. In the second year, they taped out an analog chip with a flash ADC and a delta-sigma modulator and a digital chip with a much more efficient FFT accelerator and a specialized Scrub Jay bird call classifier. C2S2's end-of-semester presentations covered their recent work on dynamic and formal verification methodologies, mixed-signal design flows, FPGA emulation frameworks, RF transciever components, custom board design, fundraising, and a great video where members ",
  "content_length": 12428,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:14"
}