{
  "name": "Christoph Berkholz",
  "homepage": "https://www.informatik.hu-berlin.de/de/forschung/gebiete/loginf/luk/berkholz/berkholz-page",
  "status": "success",
  "content": "Prof. Dr. Christoph Berkholz — Logik in der InformatikMehr KontrastWeniger Kontrast Direkt zum InhaltDirekt zur SucheDirekt zur Navigation Mathematisch-Naturwissenschaftliche Fakultät Institut für Informatik Logik in der Informatik Mathematisch-Naturwissenschaftliche Fakultät Institut für Informatik Logik in der Informatik Navigation « Dezember 2025 » month-12 Mo Di Mi Do Fr Sa So 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 1 2 3 4 Termine Promotionsvortrag: Niklas Giesa 01.12.2025 Disputation: Frau Parmida Geranmayeh, M.Sc. 10.12.2025 Disputation: Herr Pascal Sebastian Kunz, M.Sc. 12.12.2025 Promotionsvortrag Fabian Lehmann 18.12.2025 Termine - More… Impressum Für Studieninteressierte Für Studierende Für Promovierende Frauenförderung Für Beschäftigte Mitarbeiter:innen Frauenförderung Berufliche Weiterbildung FAQs E-Mails HUMBOLDT INTERN Humboldt-Universität zu Berlin - Mathematisch-Naturwissenschaftliche Fakultät - Logik in der Informatik Seit 01.08.2022 leite ich das Fachgebiet Algorithmik am Institut für Theoretische Informatik der TU Ilmenau. Zur Zeit befindet sich die neue Arbeitsgruppe im Aufbau und ich werde demnächst mehrere Mitarbeiterstellen besetzen. Bei Interesse an einer Doktoranden- oder Postdoc-Stelle in meinem Fachgebiet in Ilmenau, schreiben Sie mir am besten eine E-Mail. Meine neuen Kontaktdaten sind: Tel: +49 3677 69-2783Fax: +49 3677 69-1237Email: christoph.berkholz (at) tu-ilmenau.deUrl: https://www.tu-ilmenau.de/algoPostanschrift:Technische Universität IlmenauFachgebiet AlgorithmikPostfach 10 05 6598684 IlmenauGermany Diese Seite wird nicht länger aktualisiert (Stand 07/2022). Juniorprofessor für Logik und Komplexität This page in English Adresse: Institut für InformatikHumboldt-Universität zu BerlinUnter den Linden 6D-10099 Berlin Sitz: Johann-von-Neumann-HausRudower Chaussee 25, Raum III.424D-12489 Berlin-Adlershof Telefon: +49 30 2093 41130 E-Mail: berkholz (at) informatik.hu-berlin.de URL: www.informatik.hu-berlin.de/~berkhoch Sprechzeiten: nach Vereinbarung Über mich Ich bin seit Oktober 2019 Juniorprofessor am Institut für Informatik und Leiter der DFG-geförderten Emmy Noether-Nachwuchsgruppe Representation Complexity of Enumeration and Counting Algorithms. Darüber hinaus bin ich Mitglied der Junior Faculty im Graduiertenkolleg Facets of Complexity. Meine Forschungsinteressen beinhalten: Logik und Datenbanktheorie Beweiskomplexität und Grundlagen des SAT-Solvings Knowledge Compilation Constraint Satisfaction Aktivitäten Mitorganisation des Dagstuhl Seminars Finite and Algorithmic Model Theory (30.01. – 04.02.2022) Mitwirkung in Programmkomitees 20. Fachtagung für Datenbanksysteme für Business, Technologie und Web (BTW 2023) 47th International Symposium on Mathematical Foundations of Computer Science (MFCS 2022) 31st International Joint Conference on Artificial Intelligence and the 25th European Conference on Artificial Intelligence (IJCAI-ECAI 2022) 30th International Joint Conference on Artificial Intelligence (IJCAI-21) 36th Annual ACM/IEEE Symposium on Logic in Computer Science (LICS 2021) 29th International Joint Conference on Artificial Intelligence and 17th Pacific Rim International Conference on Artificial Intelligence (IJCAI-PRICAI2020) 23rd International Conference on Database Theory (ICDT 2020) 36th International Symposium on Theoretical Aspekts of Computer Science (STACS 2019) Lehre Unter Lehre findet sich eine Übersicht aktueller und früherer Lehrveranstaltungen der Arbeitsgruppen. Eigene Lehrveranstaltungen: SoSe 2022 Seminar Probabilistische Datenbanken WS 2021/22 Vorlesung und Übung Constraint Satisfaction: Algorithms and Complexity Seminar Komplexität boolescher Funktionen SoSe 2021 Vorlesung und Übung Einführung in die formale Logik für IMP (Moodle-Link) WS 2020/21 Seminar Kommunikationskomplexität SoSe 2020 Vorlesung und Übung Einführung in die Beweiskomplexität Seminar Beweiskomplexität WS 2019/20 Seminar Aktuelle Themen der Theoretischen Informatik WS 2018/19 Vorlesung Logik in der Informatik SoSe 2018 Seminar Aktuelle Themen der Theoretischen Informatik SoSe 2017 Vorlesung und Übung Einführung in die Beweiskomplexität SoSe 2016 Übung Ausgewählte Kapitel der Logik WS 2015/16 Seminar Aktuelle Themen in Logik und Komplexität WS 2014/15 Übung Foundations of Data Science (RWTH Aachen) Seminar Probabilistische Datenbanken (RWTH Aachen) SoSe 2014 Seminar Aktuelle Themen der Theoretischen Informatik (RWTH Aachen) Projektpraktikum Informatik-Praktikum für Mathematiker (RWTH Aachen) WS 2013/14 Seminar Berechnungsmodelle für \"Big Data\" (RWTH Aachen) SoSe 2013 Übung Theory of Constraint Satisfaction Problems (RWTH Aachen) WS 2012/13 Seminar Logik und Komplexität (RWTH Aachen) SoSe 2012 Seminar Logik und Komplexität WS 2011/12 Übung Logik in der Informatik Publikationen und Preprints Für eine aktuelle Liste von Veröffentlichungen siehe dblp. Unter Publikationen finden sich zusätzlich Preprints, Poster, etc. Sonstiges Meine Erdős-Bacon-Zahl ist ≤7 (Erdős-Zahl 3 via Oleg Verbitsky + Bacon-Zahl ≤4 via Detlev Buck). Mein ha-index ist 87. DE EN Mehr KontrastMehr Kontrast Weniger KontrastWeniger Kontrast Humboldt-Universität zu Berlin Institut für Informatik Rudower Chaussee 25 12489 Berlin-Adlershof Die Humboldt-Universität bei Facebook Die Humboldt-Universität bei BlueSky Die Humboldt-Universität bei Instagram Die Humboldt-Universität bei YouTube Die Humboldt-Universität bei LinkedIn Die RSS-Feeds der Humboldt-Universität Seite bearbeiten Barrierefreiheit Datenschutz Impressum",
  "content_length": 5551,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:44"
}