{
  "name": "Christian J. Darken",
  "homepage": "http://faculty.nps.edu/cjdarken",
  "status": "success",
  "content": "Christian J. Darken Christian J. Darken Associate Professor Department of Computer Science Naval Postgraduate School Monterey, CA 93943 Office: WA 382 Lab: WA 210 Phone: 831-656-2095 Fax: 831-656-7599 Courses Taught MV-3025 AI for Simulation MV-4025 Cognitive and Behavioral Modeling Selected Publications Boron, J and Darken, C. \"Developing Combat Behavior through Reinforcement Learning in Wargames and Simulations\", IEEE Conference on Games (CoG) 2020. Maroon, K and Darken, C. \"Predicting Enemy Squad Positions Based on Environmental Data, Unit Objectives, Tactics, and Observed Entities\", Proceedings of International Conference on Social Computing, Behavioral-Cultural Modeling, Prediction and Behavior Representation in Modeling and Simulation (SBP-BRiMS) 2019. Harder, B., Balogh, I., and Darken, C. \"Implementation of an Automated Fire Support Planner\", Proceedings of Artificial Intelligence for Interactive Digital Entertainment (AIIDE) 2016. Harder, B. and Darken, C. \"Automated Fire Support Planning for Combat Simulations\", Proceedings of International Conference on Social Computing, Behavioral-Cultural Modeling, & Prediction and Behavior Representation in Modeling and Simulation (SBP-BRiMS) 2016. Baez, F. and Darken, C. \"Threat Density Map Modeling for Combat Simulations\", Proceedings of Behavior Representation in Modeling and Simulation (BRIMS) 2014. Tan, T. and Darken, C. \"Learning and Prediction of Relational Time Series\", Computational and Mathematical Organization Theory, Vol. 21, No. 2, June 2015. Tan, T. and Darken, C. \"Faster conceptual blending predictors on relational time series\", Proceedings of the 15th International Conference on Information Fusion 2012, IEEE. Tan, T. and Darken, C. \"Learning and Prediction in Relational Time Series\", Proceedings of Behavior Representation in Modeling and Simulation (BRIMS) 2012. pdf Jungkunz, P. and Darken, C. A computational model for human eye-movements in military simulations, Computational and Mathematical Organization Theory, Vol. 17, No. 3, Dec. 2011. pdf (late draft) Evangelista, P., Darken, C., and Jungkunz, P. Modeling and integration of situational awareness and soldier target search, Journal of Defense Modeling and Simulation, Sep. 2011. pdf Alt, J. K., Baez, F., & Darken, C. (2011, February). A practical situation based agent architecture for social simulations. In M. K. M. Jakobson Gabriel; Endsley (Ed.), 2011 IEEE First International Multi-Disciplinary Conference on Cognitive Methods in Situation Awareness and Decision Support (CogSIMA). Ozcan, O., Alt, J., & Darken, C. Balancing Exploration and Exploitation in Agent Learning, In J. Salerno (Ed.), Social Computing, Behavioral-Cultural Modeling and Prediction, Vol. 6589, pp. 301-308. Berlin: Springer. Pollock, S., Alt, J. and Darken, C. Representing Trust in cognitive social simulations, Proceedings of the 4th International Conference on Social Computing, Behavioral-Cultural Modeling and Prediction (SBP'11), 2011. Darken, C., McCue, D., and Guerrero, M. \"Realistic Fireteam Movement in Urban Environments\", Proceedings of AIIDE 2010. Best Paper award. pdf Jungkunz, P. and Darken, C. \"Modeling Human Eye Movements for Military Simulations\", Proceedings of Behavior Representation in Modeling and Simulation (BRIMS) 2010. Recommended reading list award. pdf Ong, A., Wong, A., Darken, C. and Buss, A. \"Plans Validation using DES and Agent-Based Simulation\", Proceedings of the 15th International Command and Control Research and Technology Symposium (ICCRTS) 2010. pdf Alt, J. and Darken, C. A Reference Model of Soldier Attention and Behavior, Proceedings of Behavior Representation in Modeling and Simulation (BRIMS) 2008.pdf Stoykov, S. and Darken, C. Using a Competitive Approach to Improve Military Simulation Artificial Intelligence Design, NATO Modeling and Simulation Group (NMSG) Conference, Vancouver, Canada, 7-8 October 2008. pdf Guerrero, M. and Darken, C. Blended Inverse Kinematics: Delta3D System Utilization, Proceedings of the Interservice/Industry Training, Simulation, and Education Conference (I/ITSEC) 2008.pdf Darken, C. and Anderegg, B. \"Particle Filters and Simulacra for More Realistic Opponent Tracking\", Game AI Programming Wisdom 4, Charles River, S. Rabin editor, 2008. abstract Darken, C. and Kelly, J. \"Individualized NPC Attitudes with Social Networks\", Game AI Programming Wisdom 4, Charles River, S. Rabin editor, 2008. abstract Schaub, E. and Darken, C. Utilizing Biological Models to Determine the Recruitment of the Irish Republican Army, International Journal of Human and Social Sciences, Vol. 1, No. 3, Summer 2007. pdf Darken, C. and Jones, B. \"Computer Graphics-Based Target Detection for Synthetic Soldiers\", Proceedings of BRIMS 2007. (Outstanding paper award) pdf Darken, C., Anderegg, B. and McDowell, P. \"Game AI in Delta3D\", Proceedings of CIG 2007. pdf Darken, C. \"Level Annotation and Test by Autonomous Exploration\", Proceedings of AIIDE 2007. As accepted pdf. As abbreviated for the proceedings pdf. Kunde, D. and Darken, C. \"A Mental Simulation-Based Decision-Making Architecture Applied to Ground Combat\", Proceedings of BRIMS 2006. (Outstanding paper award) pdf Darken, C. and Paull, G. \"Finding Cover in Dynamic Environments\", Game AI Programming Wisdom 3, Charles River, S. Rabin editor, 2006. abstract Wells, D. and Darken, C. \"Generating Enhanced Natural Environments and Terrain for Interactive Combat Simulations (GENETICS)\", Proceedings of IMAGE 2005. pdf Darken, C. \"Heuristic Speed-Ups for Learning in Complex Stochastic Environments\", Proceedings of IJCAI 2005 Workshop on Planning and Learning in A Priori Unknown or Uncertain Domains. pdf Darken, C. \"Towards Learned Anticipation in Complex Stochastic Environments\", Proceedings of AIIDE 2005. pdf Kunde, D., and Darken, C. \"Event Prediction for Modeling Mental Simulation in Naturalistic Decision Making\", Proceedings of BRIMS 2005. pdf Paull, G., and Darken, C. \"Integrated On- and Off-Line Cover Finding and Exploitation\", Proceedings of GAME-ON 2004. pdf Darken, C., Pursel, E., and Correia, J. \"AI on the GPU\", Extended abstract for poster presentation at the ACM Workshop on General Purpose Computing on Graphics Processors and SIGGRAPH, 2004. pdf Darken, C., Morgan, D., and Paull, G. \"Efficient and Dynamic Response to Fire\", Proceedings of the AAAI Workshop on Challenges in Game AI, 2004. pdf Darken, C. \"Visibility and Concealment Algorithms for 3D Simulations\", Proceedings of Behavior Representation in Modeling and Simulation (BRIMS) 2004. pdf Burgess, R. and Darken, C. \"Realistic Human Path Planning using Fluid Simulation\", Proceedings of Behavior Representation in Modeling and Simulation (BRIMS) 2004. pdf Loecher, M. and Darken, C. \"Concurrent estimation of time-to-failure and effective wear\", Proceedings of the Maintenance and Reliability Conference (MARCON) 2003. pdf Graduated Students Ibarra, Jorge, Master's 2025 Neural Oracle Algorithms for Heuristic Strategy Development in Large Zero-Sum Games Aktas, Bunyamin, Master's 2025 Neural Network Architecture Design for Military Decision-Making Under Fog of War Smith, Timothy, Master's 2025 Adversarial Experimentation in Atlatl: Leveraging Sensitivity Analysis, Neighborhood Search Heuristics, and Probabilistic Scenario Generation to Expose AI Weaknesses Schnitzler, Simon, Master's 2025 Utilizing a Faction Disposition Particle Filter (FDPF) for Tracking Opposing Forces (OPFOR) Entity Positions in Land-Based Military Simulations with Partial Observability DeMeo, Pascal, Master's 2024 Depth-Limited Search with Neural Network Evaluation Functions for Military Simulations Tran, Luan, Master's 2024 Optimizing the STOMp Algorithm for Military Simulation Black, Scotty, PhD 2024 Mastering the Digital Art of War: Developing Intelligent Combat Simulation Agents Using Hierarchical Reinforcement Learning Fredrickson, John, Master's 2024 Evaluating the Merits of Sub-Ply Search Algorithms in Combat Models Islas, Sean, Master's 2024 An Analysis of Artificial Intelligence Performance and Behavior Within the Model of Expeditionary Advanced Base Operations Jung, Hyokwon, Master's 2024 Probaility Densities for Military Simulation AI: Functionality and Impact in Fog of War Scenarios Tidwell, Timothy, Master's 2024 Leveraging RL Multi-Models for Wargaming AI Coble, Joseph, Master's 2023 Optimal Naval Movement Simulation with Reinforcement Learning AI Agents Finley, Matthew, Master's 2023 Applied Reinforcement Learning Wargaming with Parallelism, Cloud Integration and AI Uncertainty Allen, John, Master's 2022 Enlisting AI in Course of Action Analysis as Applied to Naval Freedom of Navigation Operations Rood, Patrick, Master's 2022 Scaling Reinforcement Learning through Feudal Multi-Agent Hierarchy Christopher Cannon and Stefan Goericke, Master's 2021 Using Convolution Neural Networks to Develop Robust Combat Behaviors Through Reinforcement Learning Kenneth Maroon, PhD 2020 Predicting Opponent Position and Modeling Uncertainty Jonathan Boron, Master's 2020 Developing Combat Behavior with Reinforcement Learning Weiwen Mervyn Lian, Master's 2019 Using Neural Networks to Determine Course of Action for a Land-Based Constructive Simulation Byron Harder, PhD 2017 Automated Battle Planning for Combat Models with Maneuver and Fire Support Yusuf Temiz, Master's 2016 Artillery Survivability Model Ricardo Bastos, Master's 2014 Development of a Web-Based Periscope Simulator for Submarine Officer Training Chen-Fu Hsiao, Master's 2014 Development of a Web-Based Distributed Interactive Simulation (DIS) Environment Using JavaScript Michael Pavek and Austin Starken, Master's 2014 Web-Based Army Repeatable Lesson in Operational Combat (WARLOC) Kian Moh Terence Tan, PhD 2013 Learning and Prediction of Relational Time Series Justin Ross, Master's 2012 Automation of P-3 Simulations to Improve Operator Workload Chin Chuan Ong, Master's 2012 Analysis of Cognitive Architecture in the Cultural Geography Model Farn Wei Jas",
  "content_length": 13352,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:08"
}