{
  "name": "Chris Xiaoxuan Lu",
  "homepage": "https://christopherlu.github.io",
  "status": "success",
  "content": "Chris Xiaoxuan Lu I am an Associate Professor in Robotics and AI at the Department of Computer Science, University College London (UCL). I am directing the RoMA lab (Robotics and Multimodal AI laboratory), and our research centers on Scaling Foundation Models for Embodied AI, leveraging recent advancements in AI and machine learning to adapt foundation models for real-world applications. These models offer unparalleled context-awareness in a zero-shot manner, enabling intelligent behavior without task-specific training. My work addresses the significant challenges of deploying these foundation models in diverse and unpredictable environments, focusing on three key areas: Generalization Across Modalities – Ensuring robust performance of AI models across various sensors used by different agents. Computational Efficiency – Optimizing foundation models to run effectively on limited hardware resources. Human-Machine Interaction – Facilitating seamless and intuitive interactions between AI systems, human users, and other machines. At the core of my research is the mission to enable embodied AI systems to operate reliably in real-world settings. Discover more about my research projects on my research page. Before coming to UCL, I was a faculty member at the University of Edinburgh and University of Liverpool. I did both my PhD study and post-doctoral in the Department of Computer Science, University of Oxford. Even earlier, I received my M.Eng degree from Nanyang Technological University (NTU). news Sep 29, 2025 🎉 New group website of RoMA lab launched! Check it out group website for the latest information about our research, team, and activities. Apr 21, 2025 🎉 Congratulations to my PhD student Fangqiang Ding on being selected as one of the 33 RSS Pioneers in 2025 from 226 senior PhD applicants. Feb 28, 2025 🔍 We have an PhD studentship (Home Student Rate) in the EPSRC CDT in Cyber-physical risk. The topic is ‘Cyber-physical security in Vision-Language-Action Models for autonomous systems’. Find more details in the CDT page. Sep 26, 2024 🎉 One papers accepted to NeurIPS-2024. Stay tuned for the code and video release. See you in Vancouver, Canada. Jul 2, 2024 🎉 Two papers accepted to ECCV-2024 and one paper accepted to IROS-2024. Stay tuned for the code and video release. See you at Milano and Abu Dhabi. selected publications NeurIPS’24 RadarOcc: Robust 3D Occupancy Prediction with 4D Imaging Radar Fangqiang Ding, Xiangyu Wen, Yunzhou Zhu, Yiming Li, and Chris Xiaoxuan Lu In The Thirty-eighth Conference on Neural Information Processing Systems 2024 arXiv Video Code Website ECCV’24 Self-Adapting Large Visual-Language Models to Edge Devices across Visual Modalities Kaiwen Cai, Zhekai Duan, Gaowen Liu, Charles Fleming, and Chris Xiaoxuan Lu In The European Conference on Computer Vision 2024 arXiv Video Code ICRA’24 Moving Object Detection and Tracking with 4D Radar Point Cloud Zhijun Pan, Fangqiang Ding, Hantao Zhong, and Chris Xiaoxuan Lu In IEEE International Conference on Robotics and Automation 2024 arXiv Video Code IROS’24 Click to Grasp: Zero-Shot Precise Manipulation via Visual Diffusion Descriptors Nikolaos Tsagkas, Jack Rome, Subramanian Ramamoorthy, Oisin Mac Aodha, and Chris Xiaoxuan Lu In IEEE/RSJ International Conference on Intelligent Robots and Systems 2024 arXiv Website CVPR’23 Hidden Gems: 4D Radar Scene Flow Learning Using Cross-Modal Supervision Fangqiang Ding, Andras Palffy, Dariu M. Gavrila, and Chris Xiaoxuan Lu In IEEE Conference on Computer Vision and Pattern Recognition 2023 CVPR’23 Highlight arXiv Video Code Website T-RO Graph-Based Thermal–Inertial SLAM With Probabilistic Neural Networks Muhamad Risqi U. Saputra, Chris Xiaoxuan Lu, Pedro Porto B. Gusmao, Bing Wang, Andrew Markham, and Niki Trigoni IEEE Transactions on Robotics 2022 arXiv Video Code ICRA’22 AutoPlace: Robust Place Recognition with Single-chip Automotive Radar Kaiwen Cai, Bing Wang, and Chris Xiaoxuan Lu In International Conference on Robotics and Automation (ICRA) 2022 arXiv Video Code Website MobiSys’20 See through smoke: robust indoor mapping with low-cost mmWave radar Chris Xiaoxuan Lu, Stefano Rosa, Peijun Zhao, Bing Wang, Changhao Chen, John A. Stankovic, Niki Trigoni, and Andrew Markham In The 18th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys) 2020 arXiv HTML Video Code SenSys’20 milliEgo: single-chip mmWave radar aided egomotion estimation via deep sensor fusion Chris Xiaoxuan Lu, Muhamad Risqi U. Saputra, Peijun Zhao, Yasin Almalioglu, Pedro P. B. Gusmao, Changhao Chen, Ke Sun, Niki Trigoni, and Andrew Markham In The 18th ACM Conference on Embedded Networked Sensor Systems (SenSys) 2020 arXiv HTML Video Code AAAI’18 IONet: Learning to Cure the Curse of Drift in Inertial Odometry Changhao Chen, Chris Xiaoxuan Lu, Andrew Markham, and Niki Trigoni In The Thirty-Second AAAI Conference on Artificial Intelligence (AAAI) 2018 arXiv HTML Video You can even add a little note about which of these is the best way to reach you.",
  "content_length": 5042,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:52"
}