{
  "name": "Christina Pöpper",
  "homepage": "https://poepper.net",
  "status": "success",
  "content": "Christina Pöpper | Faculty. Cyber and Communication Security. NYUAD. Christina PöpperAssociate Professor of Computer ScienceCyber Security & Privacy Lab (CSP-lab)New York University Abu Dhabi (NYUAD)P.0. Box 129188Abu Dhabi, UAE E-Mail: christina.poepper@nyu.edu, christina@poepper.netTel: +971 2 6284360PGP-Key: 0x7A939D38DBLP | Google Scholar | Semantic Scholar | NYU Scholars Recent News 9/2025: Paper accepted and presented at AIAA DATC/IEEE Digital Avionics Systems Conference (DASC’25): Placement Synergy: Bridging ADS-B Ground and Space Sensors for Secure Wide-Area Multilateration [PDF]. Congratulations, Ala’ Darabseh! 8/2025: My appointment as CS Program Head comes to an end. I am handing over the baton to Djellel Difallah. 6/2025: Sanjana Nambiar has presented the paper JailFact-Bench: A Comprehensive Analysis of Jailbreak Attacks vs. Hallucinations in LLM [PDF, Dataset on Zenodo] at the 7th ACNS Workshop on Security in Machine Learning and its Applications (SiMLA 2025), co-located with ACNS’25. Always a pleasure to see (former) Capstone students present their first research paper! Congratulations! 4/2025: Two papers accepted and to be presented this summer: Exposing the Guardrails: Reverse-Engineering and Jailbreaking Safety Filters in DALL·E Text-to-Image Pipelines [PDF] at USENIX Security’25 and GridNet: Vision-based Mitigation of GPS Attacks for Aerial Vehicles [PDF] at IJCNN’25. Congratulations to my co-authors: Corban Villa and Shujaat Mirza as well as Nian Xue, Zhen Li, and Xianbin Hong. 3/2025: Dr. Michele Guerra joined as Postdoctoral Associate – Welcome Michele! 2/2025: NDSS’25 is happening. 211 paper presentations in 56 sessions and 4 parallel tracks (program), 2 keynote talks. Opening Remarks from the TPC Chairs (PDF). Full Statistics from the TPC (PDF). 12/2024: The NDSS’25 program is forming. We’ll have a new record number of paper presentations (>200). Excited to share details soon. 9/2024: Zacharia Kornas joined as Ph.D. student – Welcome Zacharia! 8/2024: In collaboration with Damon McCoy, I had the pleasure of co-hosting an exciting workshop on “Fairness, Bias, and Factuality in LLMs” at NYU Tandon. Thank you to the participants for their amazing contributions and participation in discussions. 8/2024: Shujaat Mirza defended his Ph.D. thesis entitled “Towards Responsible AI: Safeguarding Privacy, Integrity, and Fairness”  at NYU Courant – Congratulations! 7/2024: Paper published at the 24th Privacy Enhancing Technologies Symposium (PETS 2024): Media talks Privacy: Unraveling a Decade of Privacy Discourse around the World [PDF]. Congratulations, Shujaat & Corban! This paper was a runner-up (out of 4) for the Andreas Pfitzmann Best Student Paper Award. 5/2024: Paper published at WiSec’24: ASTRA-5G: Automated Over-the-Air Security Testing and Research Architecture for 5G SA Devices [PDF] [code]. Congratulations, Syed and the whole team! News Archival About Christina Pöpper is a tenured faculty member of Computer Science at New York University Abu Dhabi (NYUAD). She is the Co-PI of Research at the Center for Cyber Security (CCSAD) at NYUAD, and a Global Network Associate Professor of Computer Science at the Courant Institute of Mathematical Sciences at New York University. At NYUAD, she is heading the Cyber Security & Privacy (CSP-) Lab. She served as the Program Head of Computer Science at NYUAD from 2023-2025. Christina’s research interest is cyber security and privacy. Focus areas are wireless and communication security, including cellular/mobile network security (5G, nextG), secure localization, and aerial cyber security, as well as privacy and anonymity in networks and systems. The research work of her group has been recognized by the Coordinated Vulnerability Disclosure program of GSMA, the GSM Association. Christina was co-chairing the TPCs of NDSS’25, NDSS’24, and ACNS’24. From 2021 to 2025, she was a member of the Executive Committee of ACM SIGSAC. She has been a member of the Steering Committee of NDSS (Network and Distributed System Security Symposium) since 2025 and of ACM WiSec (ACM Conference on Security and Privacy in Wireless and Mobile Networks) since 2018. She was ACM WiSec TPC Co-Chair in 2018 and General Chair in 2021. Until August 2022, Christina was affiliated as a visiting professor with Ruhr-University Bochum, Germany, where she headed the Information Security Group as part of the Horst-Görtz-Institute for IT-Security (HGI). Christina holds a Ph.D. and a graduate degree in Computer Science from ETH Zurich, Switzerland. In her diploma thesis, she worked on information flow analysis and the automatic detection of information leaks during program execution. Before embarking on the academic career track, Christina worked at the European Space Agency in Paris; space rocks.",
  "content_length": 4796,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:31"
}