{
  "name": "Chris Gill 0001",
  "homepage": "https://www.cse.wustl.edu/~cdgill",
  "status": "success",
  "content": "Christopher D. Gill Christopher D. Gill Professor of Computer Science and Engineering McKelvey School of Engineering Washington University in St. Louis CV/Resume and Google Scholar Profile and Publications Fall 2025 Schedule E81 CSE 5402: Concurrency and Memory Safe System Software Development (Fall 2025) CSE 7960 Section 1: Concurrent and Parallel Embedded Systems Seminar (Fall 2025) IEEE Technical Community on Real-Time Systems (TCRTS) The 46th IEEE Real-Time Systems Symposium (RTSS 2025) will be held December 2-5, 2025, in Boston, MA, USA. The 32nd IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS 2026) and the 17th ACM/IEEE International Conference on Cyber-Physical Systems (ICCPS 2026) will be held as part of CPS-IoT Week, May 11-14 2026, in St. Malo, France (FIRM paper submission deadline: November 13, 2025). Professional Interests: Research: Elastic and Mixed-Criticality Real-Time, Embedded, and Cyber-Physical Systems Real-Time Control and Scheduling Co-Design Real-Time Concurrency Platforms, Operating Systems, Virtualization, and Middleware Parallel Real-Time Computing atop multicores, GPUs, and FPGAs Teaching: Concurrency and Memory Safe System Software Development Operating Systems and Advanced Operating Systems Multi-Paradigm Programming in C++ Concurrent and Distributed System Software Programming Systems and Languages Procedural, Object-Oriented and Generic Programming in C++ Professional Organizations: IEEE Computer Society Technical Community on Real-Time Systems (TCRTS) ACM Special Interest Group on Embedded Systems (SIGBED) Other Interests: When I make the time for it, I greatly enjoy fly fishing, especially during the Missouri State Parks' winter catch-and-release season. I also enjoy fly tying, thanks to the good folks at Feather-Craft Fly Fishing in St. Louis, who taught me. The following may be the most apt description of the current state of fly fishing (and much of the modern world) that I've seen: \"And fly fishermen, now more skilled and knowledgeable than they've ever been, seldom keep any of the fish they go to such pains to catch. [...] We decided we were frontier subsistence journalists, living off the land in one of the few ways that's still possible, that is by gathering food, putting most of it back, and then writing about it for money.\" -- John Gierach, \"Spring Snow\", from Even Brook Trout Get The Blues. Ways to contact me: e-mail: cdgill@wustl.edu s-mail: Department of Computer Science and Engineering, MSC: 1045-213-1010J James McKelvey School of Engineering, Washington University in St. Louis 1 Brookings Drive, St. Louis, MO 63130-4899 phone: +1 (314) 935-7538 Last modified 07:36 CDT 11 Aug 2025",
  "content_length": 2698,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:39"
}