{
  "name": "Christian Biemann",
  "homepage": "https://www.inf.uni-hamburg.de/en/inst/ab/lt/people/chris-biemann",
  "status": "success",
  "content": "Chris Biemann : Language Technology Group (LT) : University of Hamburg Zur MetanavigationZur HauptnavigationZur SucheZum InhaltZur SubnavigationZum SeitenfußPhoto: alt leftLanguage TechnologyChris Biemann Name: Prof. Dr. Chris Biemann Position: Professor for Language Technology Email: biemann\"AT\"informatik.uni-hamburg.de Phone: +49 (40) 2395-20386 Office: F-429 Address: Informatikum Vogt-Kölln-Straße 30 22527 Hamburg Publications Scientific Activities Invited Talks About Me I am the head of the Language Technology group at Universität Hamburg. My PhD research was focused on unsupervised knowledge-free methods in language processing: how much structure can computers detect on their own in text data? After, I widened my scope and concentrate mainly on lexical semantics, as well as NLP applications including speech. As a group, we have deep expertise in semantic modelling of natural language text and hands-on expertise with most NLP technologies. I believe publicly funded research should be available for anyone interested in it, which is why I strive to make publications and software available in open access and open source under lenient licenses. Work Information Professor for Language Technology, Computer Science Dept., MIN Faculty, University of Hamburg. My research interests are statistical, unsupervised and knowledge-free natural language processing in the structure discovery paradigm, in particular statistical semantics. Further, I am interested in leveraging crowdsourcing as a source for linguistic annotations and in the development of Cognitive Computing applications. Bibliographical Information I hold a Dr. rer. nat degree and a Diploma in computer science from the University of Leipzig. I joined the Internet-startup Powerset in San Francisco, which was acquired by Microsoft to become part of Bing.com, where I worked for 2 years in software development. From 2011 to 2016, I was head of FG Language Technology, Computer Science Dept. TU Darmstadt. In October 2016, I joined the Computer Science Dept. of the University of Hamburg as the head of AG Language Technology. Personal Interests travelling, cooking, art projects that move, garden, playing the lazerkasoo NewsLT|4 September 2025EMNLP 2025 accepts 4 papers from LT membersWe are joyfully announcing that EMNLP 2025 has accepted four papers from LT members. Tadesse...LT|3 June 2025ACL 2025 accepts 12 papers from LT membersWe are blown away by the fact that ACL 2025 has accepted 12 papers from  LT members: Tadesse Destaw...LT|6 March 2025NAACL 2025 accepts 2 papers from LT membersWe are delighted to announce that NAACL 2025 has accepted one paper from  LT members. Fischer, T.,...LT|2 December 2024COLING 2025 accepts 3 papers from LT membersWe are delighted to announce that COLING 2025 has accepted a total of three papers from members of...LT|23 September 2024EMNLP 2024 accepts 4 papers from LT membersWe are delighted to announce that EMNLP 2024 has accepted a total of four papers from members of our...LT|16 May 2024ACL 2024 accepts 3 papers from LT membersThe ACL 2024 accepts 3 papers from LT members: Viktor Moskvoretskii, Ekaterina Neminova, Alina...LT|22 February 2024LREC-COLING 2024 accepts 7 papers from LT membersThe LREC 2024 Conference has accepted 7 papers  co-authored by LT members Ahmad Shallouf, Hanna...Veranstaltung|26 October 2023Participation in ERC Synergy Grant CultCryoWhether in logistics, science or air conditioning in the home - the possibility of artificial...Publication|23 October 2023Paper Accepted in Language Resources and Evaluation (LREV)The following paper has been accepted and available online in Language Resources & Evaluation:...LT|21 September 2023GSCL master's thesis award 2023 goes to Florian Schneider Every two years the German Society for Language Technology and Computational Linguistics (GSCL)...Archive of current newsChris BiemannProf. Dr. rer. nat. Chris BiemannLanguage Technology GroupInformatikum, Vogt-Kölln-Straße 3022527, HamburgTel: +49 40 42883 2386Fax: +49 40 42883 2386Email: biemann\"AT\"informatik.uni-hamburg.de",
  "content_length": 4082,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:57"
}