{
  "name": "Christian Cuba Samaniego",
  "homepage": "https://christiansami.wixsite.com/cecubasamaniego",
  "status": "success",
  "content": "About me | cecubasamaniego top of page This website was built on Wix. Create yours today.Get Started I received my BS degree in Mecatronic Eng. from National University of Engineering (UNI-Peru) I obtained my PhD in Mechanical Engineering from the University of California Riverside (UCR) under the supervision of Elisa Franco in 2017 [my CV, and google scholar for publications]. I held a postdoctoral scholar with Ron Weiss at MIT (2017), Elisa Franco at UCLA (2019), Ming-Ru Wu at Harvard/DFCI (2023). In 2025, I joined the Computational Biology Department at Carnegie Mellon University. I am recruiting PhD students and postdoctoral scholars. To create a community that connects mathematical theories, models, and biomolecular experiments, I organize a Seminar on Biological Control Systems. it focuses on applications of mathematical modeling and control systems to biology. We host monthly talks featuring our members and invited guests. I work at the intersection among Control Theory, Systems Biology and Synthetic Biology. I am specially interested in the design, analysis and applications of biomolecular feedback control systems and molecular neural networks  for decision-making (molecular pattern recognition) in living cells (see SynBYSS talk). To explore collaboration opportunities, contact me, ccubasam at andrew.cmu,edu Recent News​​ Our paper was accepted in iScience Our paper was accepted in CDC22 Our paper appeared in ACS Synthetic Biology Our paper appeared in Cell Systems Two papers were accepted in ACC21 Our paper was accepted in CDC20 Five papers were accepted in CDC19, ECC19, and L-CSS Our paper was accepted in CDC18 Three papers appeared at ACS Synthetic Biology Four papers were accepted in CDC17, CCTA17, IFAC17 Our paper appeared in IEEE TCNS Our paper appeared in Journal of Biological Dynamics ThinkSwiss Research Scholarship for ETHz Our paper appeared in ACS Synthetic Biology Our paper appeared in Journal of Mathematical Biology Three papers were accepted in CDC15, and ACC5 Our paper appeared in Syst Synth Biol Our paper was accepted in CDC14 Events and Travels CSHL SynBio 22, New York, USA  26 Jul - 8 Aug 22 ACC, New Orleans, USA 25-28 May 21 mSBW 5.0, Virtual, 7-8 Dec 20 CSHL SynBio 19, New York, USA  23 Jul - 5 Aug 19 SEED 19, New York,, USA, 23-27 June 19 CSHL SynBio 18, New York, USA  24 Jul - 6 Aug 18 mSBW 5.0, Boston, USA, 5-6 May 18 EBRC, Seattle, USA, 23-24 Mar 18 CDC, Melbourne, Australia, 12-15 Dec 17 CCTA, Kohala Coast, Hawaii, USA 27-30 Aug 17 CSHL SynBio 17, New York, USA  25 Jul - 7 Aug 17 SynBioControl 17, London, England  17-18 Jul 17 IFAC 17, Toulouse, France  9-14 Jul 17 SCCW, Pasadena, CA  28 Apr 17 CDC, Las Vegas, NV 12-14 Dec 16 CDC, Osaka, Japan 15-18 Dec 15 q-bio Summer School at UCSD, CA 13-28 Jul 15 ACC, Chicago, IL 1-3 Jul 15 SCCW, Los Angeles, CA 8 May 15 CDC, Los Angeles, CA 15-17 Dec 14 SCCW, Riverside, CA 7 Nov 14 BIOMOD, Cambridge, MA 31 Oct 14 bottom of page",
  "content_length": 2951,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:58"
}