{
  "name": "Christof Weiss",
  "homepage": "https://www.informatik.uni-wuerzburg.de/ch/team",
  "status": "success",
  "content": "Team - Computational Humanities Intern Animation stoppen Computational Humanities Prof. Dr.-Ing. Christof Weiß Professor Computational Humanities Universität Würzburg Hubland Nord (ZPD) Emil-Hilb-Weg 23 97074 Würzburg Germany Gebäude: ZPD Raum: 02.006 Telefon: +49 931 31 80528 E-Mail: christof.weiss@uni-wuerzburg.de ORCID: https://orcid.org/0000-0003-2143-4679 Link: Christof Weiß M.A. Natalia Fahmer Secretary Computational Humanities Universität Würzburg Hubland Nord (ZPD) Emil-Hilb-Weg 23 97074 Würzburg Germany Gebäude: ZPD Raum: 02.005 Telefon: +49 931 31 86224 E-Mail: natalia.fahmer@uni-wuerzburg.de M.Sc. Lele Liu Research Assistant / PostDoc Computational Humanities Universität Würzburg Hubland Nord (ZPD) Emil-Hilb-Weg 23 97074 Würzburg Germany Gebäude: ZPD Raum: 02.007 E-Mail: lele.liu@uni-wuerzburg.de M.Sc. Yiwei Ding Research Assistant / PhD Student Computational Humanities Universität Würzburg Hubland Nord (ZPD) Emil-Hilb-Weg 23 97074 Würzburg Germany Gebäude: ZPD Raum: 02.007 E-Mail: yiwei.ding@uni-wuerzburg.de M.Ed. Yannik Venohr Research Assistant / PhD Student Computational Humanities Universität Würzburg Hubland Nord (ZPD) Emil-Hilb-Weg 23 97074 Würzburg Germany Gebäude: ZPD Raum: 02.008 E-Mail: yannik.venohr@uni-wuerzburg.de M.A. Benjamin Henzel Research Assistant / PhD Student Computational Humanities Universität Würzburg Hubland Nord (ZPD) Emil-Hilb-Weg 23 97074 Würzburg Germany Gebäude: ZPD Raum: 02.008 E-Mail: benjamin.henzel@uni-wuerzburg.de M.Sc. Michael Kohl Research Associate with MA Lighting Technology Universität Würzburg Hubland Nord (ZPD) Emil-Hilb-Weg 23 97074 Würzburg Germany Gebäude: ZPD Raum: 02.004 E-Mail: michael.kohl@uni-wuerzburg.de M.Sc. M.A. Yaozhong Zhang PhD Student Graduate School for Science and Technology (GSST) Universität Würzburg Hubland Nord (ZPD) Emil-Hilb-Weg 23 97074 Würzburg Germany Gebäude: ZPD Raum: 02.004 E-Mail: yaozhong.zhang@stud-mail.uni-wuerzburg.de M.A. Lucas Hofmann PhD Student Graduate School of the Humanities (GSH) Universität Würzburg Hubland Nord (ZPD) Emil-Hilb-Weg 23 97074 Würzburg Germany Gebäude: ZPD Raum: 02.004 E-Mail: lucas.hofmann@uni-wuerzburg.de B.Sc. Leonie Schafferhans Student Assistant Computational Humanities Universität Würzburg Hubland Nord (ZPD) Emil-Hilb-Weg 23 97074 Würzburg Germany E-Mail: leonie.schafferhans@stud-mail.uni-wuerzburg.de B.Sc. Andreas Maier Student assistant Computational Humanities Universität Würzburg Hubland Nord (ZPD) Emil-Hilb-Weg 23 97074 Würzburg Germany E-Mail: hannes.aulbach@stud-mail.uni-wuerzburg.de Computational HumanitiesTeamChristof WeißLele LiuYiwei DingYannik VenohrBenjamin HenzelYaozhong Zhang Kontakt Professur für Informatik (Computational Humanities) Campus Hubland Nord Emil-Hilb-Weg 23 97074 Würzburg E-Mail Suche Ansprechperson Hubland Nord, Geb. 23 HomeThe UniversityStudying at JMUResearchTeachingInstitutionsInternationalThe UniversityNewsEventsDates and DeadlinesDegree Programmes and SubjectsVacanciesStaff MembersGlossary of Administrative TermsServicesUniversity LibraryIT ServicesUniversity SportAcademic Advisory ServiceExamination OfficeStudent AffairsStudent RepresentationCareer CentreYour JMUWueStudyWueCampusClass ScheduleOnline-EnrolmentLibrary CatalogueContactPhone and Address DirectoryHow to Find UsPressAcademic Advisory ServiceTechnical Maintenance ServiceNeed help quickly? Seitenoptionen Sitemap Bildnachweise Nach oben Letzte Änderung: 04.11.2025 Seite: 250290/1015 Bildnachweise ImpressumDatenschutzBarrierefreiheit",
  "content_length": 3505,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:43"
}