{
  "name": "Christian Richardt",
  "homepage": "http://richardt.name",
  "status": "success",
  "content": "Christian Richardt Dr. Christian Richardt Christian Richardt is a Research Scientist at Meta Reality Labs in Zurich, Switzerland, and previously at the Codec Avatars Lab in Pittsburgh, USA. He was previously a Reader (=Associate Professor) and EPSRC-UKRI Innovation Fellow in the Visual Computing Group and the CAMERA Centre at the University of Bath. His research interests cover the fields of image processing, computer graphics and computer vision, and his research combines insights from vision, graphics and perception to reconstruct visual information from images and videos, to create high-quality visual experiences with a focus on novel-view synthesis. Christian was previously a postdoctoral researcher working on user-centric video processing and motion capture with Christian Theobalt at the Intel Visual Computing Institute at Saarland University and also in the Graphics, Vision and Video group at Max-Planck-Institut für Informatik in Saarbrücken, Germany. Previously, he was a postdoc in the REVES team at Inria Sophia Antipolis, France, working with George Drettakis and Adrien Bousseau, and he interned with Alexander Sorkine-Hornung at Disney Research Zurich where he worked on Megastereo panoramas. Christian graduated with a PhD and BA from the University of Cambridge in 2012 and 2007, respectively. His PhD in the Computer Laboratory’s Rainbow Group was supervised by Neil Dodgson. His doctoral research investigated the full life cycle of videos with depth (RGBZ videos): from their acquisition, via filtering and processing, to the evaluation of stereoscopic display. News May 2025 We will present five papers by our outstanding interns and collaborators at CVPR 2025 in Nashville: Time of the Flight of the Gaussians (oral), SoundsVista (highlight), IRIS, Geometry-guided Online 3D Video, and Volumetric Surfaces. I will also be presenting at the CVPR Tutorial on Volumetric Video in the Real World and the 2nd CVPR Workshop on Neural Fields Beyond Conventional Cameras. Come say hi! :) Feb 2025 My PhD student Manuel Rey-Area will present his final PhD paper 360° 3D Photos from a Single 360° Input Image at IEEE VR 2025 in Saint-Malo, France. Dec 2024 We presented URAvatar at SIGGRAPH Asia 2024 in Tokyo. Oct 2024 We presented Flowed Time of Flight Radiance Fields (F-TöRF) at ECCV 2024 in Milan. June 2024 We presented five papers by our outstanding interns at CVPR 2024 in Seattle: PlatoNeRF, HybridNeRF, SpecNeRF, Real Acoustic Fields, and ViewDiff. My PhD student Jundan Luo has two papers accepted: IntrinsicDiffusion (SIGGRAPH 2024) and CRefNet (TVCG 2024). November 2023 Three papers accepted: 1. Neural Feature Filtering for Faster Structure-from-Motion Localisation (BMVC 2023 in Aberdeen), 2. PyNeRF: Pyramidal Neural Radiance Fields (NeurIPS 2023 in New Orleans), and 3. VR-NeRF: High-Fidelity Virtualized Walkable Spaces (SIGGRAPH Asia 2023 in Sydney). Check out our new Eyeful Tower dataset, the highest-resolution, highest-quality, high-dynamic range, multi-view indoor scene dataset powering VR-NeRF. October 2023 We presented one paper on Neural Fields for Structured Lighting at ICCV 2023 in Paris. June 2023 We held DynaVis, the Fourth International Workshop on Dynamic Scene Reconstruction at CVPR 2023 in Vancouver (afternoon of Monday 19 June). We presented two papers at CVPR 2023 in Vancouver: HyperReel and Neural Duplex Radiance Fields for high-fidelity and real-time view synthesis, respectively. March 2023 I will be serving as an Area Chair for ICCV 2023. June 2022 We presented our work on high-resolution 360° monocular depth estimation (360MonoDepth) at CVPR 2022 in New Orleans. April 2022 I’m excited to join Reality Labs Research in Pittsburgh as a Research Scientist Lead. Selected publications Time of the Flight of the Gaussians: Optimizing Depth Indirectly in Dynamic Radiance Fields Runfeng Li, Mikhail Okunev, Zixuan Guo, Anh Ha Duong, Christian Richardt, Matthew O’Toole and James Tompkin CVPR 2025 (oral, 0.7% acceptance rate) project page paper and supplement (arXiv) video (YouTube) 360° 3D Photos from a Single 360° Input Image Manuel Rey-Area and Christian Richardt IEEE Transactions on Visualization and Computer Graphics (IEEE VR 2025) project page paper source code DOI IntrinsicDiffusion: Joint Intrinsic Layers from Latent Diffusion Models Jundan Luo, Duygu Ceylan, Jae Shin Yoon, Nanxuan Zhao, Julien Philip, Anna Frühstück, Wenbin Li, Christian Richardt and Tuanfeng Y. Wang SIGGRAPH 2024 project page paper supplemental document DOI PlatoNeRF: 3D Reconstruction in Plato’s Cave via Single-View Two-Bounce Lidar Tzofi Klinghoffer, Xiaoyu Xiang, Siddharth Somasundaram, Yuchen Fan, Christian Richardt, Ramesh Raskar and Rakesh Ranjan CVPR 2024 (oral/award candidate, 0.8%/0.2% acceptance rate) project page paper and supplement (arXiv) video (YouTube) source code dataset HybridNeRF: Efficient Neural Rendering via Adaptive Volumetric Surfaces Haithem Turki, Vasu Agrawal, Samuel Rota Bulò, Lorenzo Porzi, Peter Kontschieder, Deva Ramanan, Michael Zollhöfer and Christian Richardt CVPR 2024 (highlight, 2.8% acceptance rate) project page paper and supplement (arXiv) SpecNeRF: Gaussian Directional Encoding for Specular Reflections Li Ma, Vasu Agrawal, Haithem Turki, Changil Kim, Chen Gao, Pedro V. Sander, Michael Zollhöfer and Christian Richardt CVPR 2024 (highlight, 2.8% acceptance rate) project page paper and supplement (arXiv) video (YouTube) VR-NeRF: High-Fidelity Virtualized Walkable Spaces Linning Xu, Vasu Agrawal, William Laney, Tony Garcia, Aayush Bansal, Changil Kim, Samuel Rota Bulò, Lorenzo Porzi, Peter Kontschieder, Aljaž Božič, Dahua Lin, Michael Zollhöfer and Christian Richardt SIGGRAPH Asia 2023 project page paper and supplement (arXiv) video (YouTube) dataset DOI HyperReel: High-Fidelity 6-DoF Video with Ray-Conditioned Sampling Benjamin Attal, Jia-Bin Huang, Christian Richardt, Michael Zollhöfer, Johannes Kopf, Matthew O’Toole and Changil Kim CVPR 2023 (highlight, 2.6% acceptance rate) project page paper and supplement (arXiv) supplemental results teaser video source code 360MonoDepth: High-Resolution 360° Monocular Depth Estimation Manuel Rey-Area*, Mingze Yuan* and Christian Richardt Conference on Computer Vision and Pattern Recognition (CVPR) 2022 project page paper (arXiv) supplement results website TöRF: Time-of-Flight Radiance Fields for Dynamic Scene View Synthesis Benjamin Attal, Eliot Laidlaw, Aaron Gokaslan, Changil Kim, Christian Richardt, James Tompkin and Matthew O’Toole Advances in Neural Information Processing Systems (NeurIPS) 2021 project page paper (arXiv) presentation video OmniPhotos: Casual 360° VR Photography Tobias Bertel, Mingze Yuan, Reuben Lindroos and Christian Richardt ACM Transactions on Graphics (Proceedings of SIGGRAPH Asia 2020) project page paper video (vimeo) DOI BlockGAN: Learning 3D Object-aware Scene Representations from Unlabelled Images Thu Nguyen-Phuoc, Christian Richardt, Long Mai, Yong-Liang Yang and Niloy Mitra Advances in Neural Information Processing Systems (NeurIPS) 2020 project page paper + supplement (arXiv) video Capture, Reconstruction, and Representation of the Visual Real World for Virtual Reality Christian Richardt, James Tompkin and Gordon Wetzstein Book chapter in Real VR – Immersive Digital Reality, Springer 2020 preprint DOI HoloGAN: Unsupervised learning of 3D representations from natural images Thu Nguyen-Phuoc, Chuan Li, Lucas Theis, Christian Richardt and Yong-Liang Yang International Conference on Computer Vision (ICCV) 2019 project page video paper (arXiv) Capture4VR: From VR Photography to VR Video Christian Richardt, Peter Hedman, Ryan S. Overbeck, Brian Cabral, Robert Konrad and Steve Sullivan Course at SIGGRAPH 2019 course page course abstract Near-Eye Display and Tracking Technologies for Virtual and Augmented Reality George Koulieris, Kaan Akşit, Michael Stengel, Rafał K. Mantiuk, Katerina Mania and Christian Richardt Computer Graphics Forum (Eurographics 2019 State-of-the-Art Report) project page STAR preprint Megastereo: Constructing High-Resolution Stereo Panoramas Christian Richardt, Yael Pritch, Henning Zimmer and Alexander Sorkine-Hornung Proceedings of CVPR 2013 (oral presentation, 3.3% acceptance rate) project page paper video poster DOI Contact info Email christian [at] richardt [dot] name Skype christianrichardt Tweets by @c_richardt Recent Posts Setting up IPython Notebook on Windows Moving a Qt installation directory OpenCV with C++11 on OS X 10.8",
  "content_length": 8490,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:19"
}