{
  "name": "Christian Dietrich 0001",
  "homepage": "https://ibr.cs.tu-bs.de/vss/People/dietrich",
  "status": "success",
  "content": "Christian Dietrich Menü Suche IBR LoginInstitut für Betriebssysteme und Rechnerverbund News Wir über uns Gesamtes Team Anreise Raumplan Projekte Veröffentlichungen Software News Archiv Connected and Mobile Systems Team Lehrveranstaltungen Abschlussarbeiten Projekte Veröffentlichungen Software Datensätze Verlässliche Systemsoftware Übersicht Team Lehre Arbeiten & Jobs Forschung Publikationen Algorithmik Team Lehrveranstaltungen Abschlussarbeiten Projekte Veröffentlichungen Mikroprozessorlabor Studium Wintersemester 2025/2026 Sommersemester 2025 Abschlussarbeiten Service Bibliothek Mailinglisten Webmail Knowledgebase Wiki Account Management Service-Status Spin-Offs Docoloc bliq (formerly AIPARK) Confidential Technologies Forschungsverbünde IST.hub Prof. Dr.-Ing. Christian Mengert-DietrichAbteilungsleiterTechnische Universität BraunschweigInstitut für Betriebssysteme und RechnerverbundVerlässliche Systemsoftware (Prof. Dietrich)Distributed Systems (Prof. Kapitza)Mühlenpfordtstraße 23, 1. OG38106 BraunschweigRaum 135+49 531 3913294+49 531 3913109dietrich[[at]]ibr.cs.tu-bs.deORCID: https://orcid.org/0000-0001-9258-0513 Professor for Reliable Distributed Systems at TU Braunschweig since 2024. Head of the Reliable System Software reserch group.Projects ParPerOS Parallel Persistency OS (DFG: DI 2840/2-1) New abstractions for unified but efficient and optionally crash-consistent low-level memory management primitives. ATLAS Adaptable Thread-Level Address Spaces (DFG: DI 2840/1-1) In the ATLAS project, we investigate dynamic specialization and containment by means of thread-level address-space variations. Associated Projects AHA Automated Hardware Abstraction in Operating-System Engineering Our goal with AHA (Automated Hardware Abstraction in Operating System Design) is to improve nonfunctional properties of system software by a very deep, but fully automated specialization of the application-hardware bridge represented by the operating system. We want to investigate, how more directly mapped implementation variants of the same OS functionality – which are semantically equivalent (only) for a particular application – can be generated fully automatically from analyzing this application and its specific interactions with the operating system. CADOS Configurability-Aware Development of Operating Systems In the CADOS project, we investigate scalable methods and tools to grasp the variability on every layer within the configuration and implementation space, visualize and analyze it and, if possible, adjust it while maintaining a holistic view on variability. Past Projects VAMOS Variability Management in Operating Systems (DFG SCHR 603/7) In the VAMOS project, we pioneered the issue of variability-induced issues in Linux and investigated methods and tools to mitigate the problem. Our findings have led to more than 100 accepted patches in the Linux mainline kernel. danceOS dependability aspects in embedded Operating Systems (DFG: SPP 1500) Future hardware designs for embedded systems are expected to exhibit an increasing rate of intermittent and permanent errors in exchange for smaller device sizes and lower energy consumption. The DanceOS project aims at providing dependability by the fine-grained and tailorable application of software-based fault-tolerance techniques. Teaching and Courses Betriebssystembau 1 Programmiersprachen und Übersetzer Bachelor-Seminar System-Call-Advent Calendar Betriebssysteme BSB2 P_PER SEP: BusyBox in Rust Awards und Grants 2024: Wissenschaftspreis Hannover 2020, Leibniz Universitätsgesellschaft Hannover e.V., (aufgrund von Corona verzögert verliehen) 2023: USENIX ATC Distinguished Artifact Award for LLFree: Scalable and Optionally-Persistent Page-Frame Allocation 2023: RTAS Best Reviewer Award 2022: ISORC Outstanding Paper for PSIC: Priority-Strict Multi-Core IRQ Processing 2022: ICSOFT Best Sutdent Paper Award for TASTING: Reuse Test-case Execution by Global AST Hashing 2021: Promotionspreis 2021, GI/ITG Fachgruppe Betriebssysteme 2019: Promotion mit Auszeichnung, Leibniz Universität Hannover ECRTS 2018: Outstanding Paper for Whole-System Worst-Case Energy-Consumption Analysis for Energy-Constrained Real-Time Systems OSPERT Workshop 2018: Best Paper for Levels of Specialization in Real-Time Operating Systems USENIX ATC 2017: Best Paper for cHash: Detection of Redundant Compilations via AST Hashing RTAS 2017: Outstanding Paper for SysWCET: Whole-System Response-Time Analysis for Fixed-Priority Real-Time Systems, Student Travel Grant by ACM 2015: Teaching Evaluation: 1st Place for the \"Operating System Exercises\" at FAU 2015: Preis für beste Abschlussarbeit der Fachgruppe Betriebssysteme RTAS 2015: Best Paper for dOSEK: The Design and Implementation of a Dependability-Oriented Static Embedded Kernel 2012: Preis für beste Bachelorarbeit in der Informatik an der Universität Erlangen-Nürnberg Publications Related to PhD Thesis (2019) 2025 USENIX Conference A IRHash: Efficient Multi-Language Compiler Caching by IR-Level Hashing Tobias Landsberg, Johannes Grunenberg, Christian Dietrich, Daniel LohmannProceedings of the 2025 USENIX Annual Technical Conference (USENIX ATC '25)USENIX Association2025. PDF [BibTex] 🗙 BibTex Entry @inproceedings{landsberg:25:usenix, author = {Tobias Landsberg and Johannes Grunenberg and Christian Dietrich and Daniel Lohmann}, booktitle = {Proceedings of the 2025 USENIX Annual Technical Conference (USENIX ATC '25)}, entrysubtype = {Conference}, isbn = {978-1-939133-48-9}, month = {July}, pages = {1467-1479}, publisher = {USENIX Association}, title = {IRHash: Efficient Multi-Language Compiler Caching by IR-Level Hashing}, venue = {Boston, MA, USA}, year = {2025}, } Close DATE Conference B Accurate and Extensible Symbolic Execution of Binary Code based on Formal ISA Semantics Sören Tempel, Tobias Brandt, Christoph Lüth, Christian Dietrich, Rolf DrechslerProceedings of the Design, Automation and Test in Europe Conference and Exhibition (DATE)IEEE2025. PDF Slides Poster Video Raw Data 10.23919/DATE64628.2025.10993257 [BibTex] 🗙 BibTex Entry @inproceedings{tempel:25:date, location = {Lyon, France}, author = {Sören Tempel and Tobias Brandt and Christoph Lüth and Christian Dietrich and Rolf Drechsler}, booktitle = {Proceedings of the Design, Automation and Test in Europe Conference and Exhibition (DATE)}, doi = {10.23919/DATE64628.2025.10993257}, entrysubtype = {Conference}, month = {March}, publisher = {IEEE}, series = {DATE}, title = {Accurate and Extensible Symbolic Execution of Binary Code based on Formal ISA Semantics}, year = {2025}, } Close EuroSys Conference A HyperAlloc: Efficient VM Memory De/Inflation via Hypervisor-Shared Page-Frame Allocators Lars Wrenger, Kenny Albes, Marco Wurps, Christian Dietrich, Daniel LohmannProceedings of the Twentieth European Conference on Computer SystemsACM2025. PDF Details 10.1145/3689031.3717484 [BibTex] 🗙 BibTex Entry @inproceedings{wrenger:25:eurosys, location = {New York, NY, USA}, author = {Lars Wrenger and Kenny Albes and Marco Wurps and Christian Dietrich and Daniel Lohmann}, booktitle = {Proceedings of the Twentieth European Conference on Computer Systems}, doi = {10.1145/3689031.3717484}, entrysubtype = {Conference}, isbn = {9798400711961}, keywords = {Allocators, Ballooning, Overcommitment, Virtual Machines}, location = {Rotterdam, Netherlands}, numpages = {18}, organization = {Association for Computing Machinery}, pages = {702–719}, publisher = {ACM}, series = {EuroSys '25}, title = {HyperAlloc: Efficient VM Memory De/Inflation via Hypervisor-Shared Page-Frame Allocators}, url = {https://doi.org/10.1145/3689031.3717484}, year = {2025}, } Close 2024 VLDB Conference A* Cloud-Native Database Systems and Unikernels: Reimagining OS Abstractions for Modern Hardware [Vision] Viktor Leis, Christian DietrichProceedings of the 50th International Conference on Very Large Data BasesVLDB Endowment2024Vision Paper. PDF Slides Raw Data 10.14778/3659437.3659462 [BibTex] 🗙 BibTex Entry @inproceedings{leis:24:vldb-vision, location = {Guangzhou, China}, author = {Leis, Viktor and Dietrich, Christian}, booktitle = {Proceedings of the 50th International Conference on Very Large Data Bases}, doi = {10.14778/3659437.3659462}, entrysubtype = {Conference}, month = {August}, note = {Vision Paper}, publisher = {VLDB Endowment}, title = {{Cloud-Native Database Systems and Unikernels: Reimagining OS Abstractions for Modern Hardware [Vision]}}, year = {2024}, } Close SPLC Conference B Should I Bother? Fast Patch Filtering for Statically-Configured Software Variants Tobias Landsberg, Christian Dietrich, Daniel LohmannProceedings of the 28th ACM International Systems and Software Product Line ConferenceAssociation for Computing Machinery2024. PDF 10.1145/3646548.3672585 [BibTex] 🗙 BibTex Entry @inproceedings{landsberg:24:splc, location = {New York, NY, USA}, author = {Landsberg, Tobias and Dietrich, Christian and Lohmann, Daniel}, booktitle = {Proceedings of the 28th ACM International Systems and Software Product Line Conference}, doi = {10.1145/3646548.3672585}, entrysubtype = {Conference}, isbn = {979-8-4007-0593-9}, keywords = {Patch Filtering, Software Evolution, Software Product Lines}, location = {Dommeldange, Luxembourg}, numpages = {12}, pages = {12–23}, publisher = {Association for Computing Machinery}, series = {SPLC '24}, title = {Should I Bother? Fast Patch Filtering for Statically-Configured Software Variants}, year = {2024}, } Close DIMES Workshop Best Paper Award The New Costs of Physical Memory Fragmentation Alexander Halbuer, Illia Ostapyshyn, Lukas Steiner, Lars Wrenger, Matthias Jung, Christian Dietrich, Daniel LohmannProceedings of the 2nd Workshop on Disruptive Memory Systems (SOSP-DIMES '24)Association for Computing Machinery2024Best Paper Award. PDF 10.1145/3698783.3699378 [BibTex] 🗙 BibTex Entry @inproceedings{halbuer:24:dimes, author = {Alexander Halbuer and Illia Ostapyshyn and Lukas Steiner and Lars Wrenger and Matthias Jung and Chri",
  "content_length": 63123,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:04"
}