{
  "name": "Christian Hardmeier",
  "homepage": "https://pure.itu.dk/portal/en/persons/christian-hardmeier(9504265d-0046-4e58-b529-256a656c012d).html",
  "status": "success",
  "content": "Christian Hardmeier - IT-University of Copenhagen Christian Hardmeier Associate Professor, Data ScienceNLPnorth https://orcid.org/0000-0002-6103-7275 Emailchrhaitudk 20092025 Research activity per year Personal profile KeywordsMachine translationMultilingual NLPBias and fairness in NLPReference in language Fingerprint Dive into the research topics where Christian Hardmeier is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Pronouns Keyphrases 100% Machine Translation Computer Science 90% Statistical Machine Translation Computer Science 59% Cross-lingual Keyphrases 49% Annotation Computer Science 38% Shared Task Keyphrases 35% Coreference Keyphrases 35% Anaphora Resolution Computer Science 35% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2009 2013 2015 2016 2017 2018 2021 2022 2023 2025 56 Article in proceedings 8 Journal article 3 Anthology 2 Paper 7 More 2 Other contribution 2 Preprint 1 Comment 1 Conference abstract for conference 1 Review Research output per year Research output per year Code Like Humans: A Multi-Agent Solution for Medical CodingMotzfeldt, A. G., Edin, J., Christensen, C. L., Hardmeier, C., Maaløe, L. & Rogers, A., 1 Nov 2025, Findings of the Association for Computational Linguistics: EMNLP 2025. Christodoulopoulos, C., Chakraborty, T., Rose, C. & Peng, V. (eds.). Suzhou, China: Association for Computational Linguistics, p. 22612-22627 16 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Medical Coding 100% Systems Performance 100% multi agent 100% Large Language Model 100% Diagnosis Code 100% Efficient Elicitation of Fictitious Nursing Notes from Volunteer Healthcare ProfessionalsBornerup, J. V. & Hardmeier, C., Mar 2025, Proceedings of the Joint 25th Nordic Conference on Computational Linguistics and 11th Baltic Conference on Human Language Technologies (NoDaLiDa/Baltic-HLT). University of Tartu Library, p. 739-754 15 p. 57Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Nursing Notes 100% Health Care Personnel 100% Volunteer 100% Structured Documentation 50% Named Entity Tagging 50% Formant-Based Vowel Categorization for Cross-Lingual Phone RecognitionStepanovic, M., Hardmeier, C. & Scharenborg, O., 27 Mar 2025, In: Journal of the Acoustical Society of America. 157, 3, p. 2248-2262 15 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Cross-lingual 100% Phone Recognition 100% Vowel Categorization 100% Formants 100% Multilingualism 100% Multimodal Extraction and Recognition of Arabic Implicit Discourse RelationsRuby, A., Hardmeier, C. & Stymne, S., Jan 2025, Proceedings of the 31st International Conference on Computational Linguistics (COLING). Association for Computational Linguistics, p. 5425-5429 4 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Implicit Discourse Relation 100% Discourse relations 100% Discourse 100% Written Language 100% Audio Data 25% A Dataset for the Detection of Dehumanizing LanguageTrolle, P. B., Hardmeier, C. & Engelmann, P., 2024, 7 p.Research output: Other contribution › Research Political Dialogue 100% Dehumanizing Language 100% Ill-treatment 100% Mental Processes 100% Movie Subtitles 100% View all 76 research outputs Projects Projects per year 2020 2020 2021 2023 2034 1 Active 2 Finished Projects per year SafeNetDerczynski, L. (PI), Hardmeier, C. (CoI) & Rossi, L. (CoI)European Commission01/01/2023 → 31/12/2024Project: Research Online Hate 100% Content Moderation 75% Domestic Legislation 75% Content Recognition 75% Out of the Loop 75% GOOGLELOWNLP: Probing sound for better low-resource NLPHardmeier, C. (CoI), Schluter, N. (PI), Sasu, D. (CoI) & Ulmer, D. T. (CoI)Google Inc.01/01/2020 → 14/08/2025Project: Other P1: Pioneer Centre for Artificial IntelligenceSestoft, P. (PI), Plank, B. (CoI), Hansen, D. W. (CoI), Larsen, A. W. (CoI), Bogers, T. (CoI), Madsen, I. J. W. (CoI), Dixen, L. (CoI), Trinhammer, M. L. (CoI), Iarygina, O. (CoI), Grasshof, S. (CoI), Mottelson, A. (CoI), Burelli, P. (CoI), Risi, S. (CoI), Rogers, A. (CoI), Goot, R. V. D. (CoI), Coscia, M. (CoI), Hardmeier, C. (CoI), Heinrich, S. (Collaborator) & Güven, A. B. (Collaborator)Danish National Research Foundation01/07/2021 → 30/06/2034Project: Research Pre-registered Replication 100% Registered Report 100% Body Attitude 100% Body Perception 100% Experimental Psychology 100% Prizes Outstanding Paper Award ML Evaluation Standards Workshop 2022Ulmer, D. T. (Recipient), Bassignana, E. (Recipient), Müller-Eberstein, M. (Recipient), Varab, D. (Recipient), Zhang, M. (Recipient), Hardmeier, C. (Recipient) & Plank, B. (Recipient), 28 Apr 2022Prize: Prizes, scholarships, distinctions Activities Activities per year 2023 2023 2023 1 Membership in review committee Activities per year Hiring committee for recruitment of assistant/associate professorships in Natural Language Processing (Event)Sestoft, P. (Chair), Hardmeier, C. (Member) & Kulyk, O. (Member)26 Nov 2023 → 1 Mar 2024Activity: Membership types › Membership in review committee",
  "content_length": 5720,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:06"
}