{
  "name": "Christoph Johann Stettina",
  "homepage": "https://www.universiteitleiden.nl/en/staffmembers/christoph-johann-stettina#tab-2",
  "status": "success",
  "content": "Christoph Johann Stettina - Leiden University Skip to main content Christoph Johann Stettina Assistant professor Name Dr. C.J. Stettina MSc Telephone +31 71 527 4799 E-mail c.j.stettina@liacs.leidenuniv.nl ORCID iD 0000-0002-7176-4521 Christoph Johann Stettina is the founder of the Agile for Excellence initiative at the Centre for Innovation at Leiden University. Agile for Excellence helps organizations to excel in research and innovation with agile team based project management methods, through research, advice and education. More information about Christoph Johann Stettina PhD candidates Tyron Offerman Postdoc / guest News 12 August 2013 Best Paper Award for Stettina et al Christoph Johann Stettina is the founder of the Agile for Excellence initiative at the Centre for Innovation at Leiden University. Agile for Excellence helps organizations to excel in research and innovation with agile team based project management methods, through research, advice and education. Christoph serves as consultant at the Centre for Innovation, providing access to knowledge on ways of working and technology. Christoph began his professional career in 2004 at Nokia where he worked on mobile phone and automotive connectivity related software systems in Bochum, Germany. After finishing his master’s degree in Trondheim, Norway he moved to The Hague, where he worked as a project officer and research associate at the Center for Technology and Innovation Management. With education in management and computer engineering Christoph has a wide range of experience in management of research and innovation projects with a passion for challenges and technology. Christoph earned a master's degree (German: Diplom-Informatker, MSc) in Computer Engineering at FH Dortmund, as well as a master's degree (MA) in Project Management completed at the Norwegian University of Science and Technology (NTNU). He is closely following developments in agile and iterative methodologies and the human aspects of innovation project management. Assistant professor Faculty of Science Leiden Inst of Advanced Computer Science Work address Gorlaeus Building Einsteinweg 55 2333 CC Leiden Contact +31 71 527 4799 c.j.stettina@liacs.leidenuniv.nl Publications Aegnite and Business Agility Games Owner / Principal Consultant Share on Facebook Share by Bluesky Share on LinkedIn Share by WhatsApp Share by Mastodon Organisation Science Leiden Institute of Advanced Computer Science (LIACS) Software and AI in Business This website uses cookies. More information. Accept cookies Reject cookies",
  "content_length": 2565,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:46"
}