{
  "name": "Chris Baber",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/baber-chris.aspx",
  "status": "success",
  "content": "Professor Chris Baber - School of Computer Science - University of Birmingham Professor Chris Baber PhD FBCS FCIEHF School of Computer ScienceChair of Pervasive and Ubiquitous Computing Contact details Telephone+44 (0) 121 414 4778Emailc.baber@bham.ac.uk View my research portal AddressSchool of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Chris Baber is Chair of Pervasive and Ubiquitous Computing. He joined the University of Birmingham in 1990 and, after working in several Engineering schools, joined the School of Computer Science in 2018. His research concerns human interaction with technology – specifically, in terms of human people form teams with intelligent technology, and in terms of sensor-based human-technology interaction.  He has published over 100 papers in international journals, as well as over 400 conference contributions and half a dozen books.  His research has been funded by the UK Ministry of Defence, RCUK, European Union and various industries. He has supervised around 30 students to the completion of their PhD. • PhD Human Factors of Speech Technology in 1990 • BA (Psychology / English) in 1987 Fellowships Fellow of the British Computer Society Fellow of the Chartered Institute of Ergonomics and Human Factors Chris graduated from Keele University with a BA (Hons) in Psychology and English Literature. He decided to pursue a PhD and joined Aston University’s Applied Psychology Unit to research speech technology.  He joined the University of Birmingham in 1990 to lecture on the MSc Work Design and Ergonomics programme (initially in the School of Production Engineering before it moved to the School of Manufacturing and Mechanical Engineering). In 2002 he moved to the School of Electronic, Electrical and Computer Engineering, partly to continue his research on wearable computers and partly to deliver courses on the MSc Human-Centred Systems. He was promoted to Senior Lecturer, Reader and Professor before becoming Head of School in 2013. In 2019 he moved to the School of Computer Science, in connection with work on human-machine teaming. Small Embedded Systems (in the School of Engineering) Evaluation Methods and Statistics Chris has supervised around 30 students to completion of their PhDs. His PhD concerned the application of speech technology (still quite a novel thing back in the late 1980s, where he worked with a Marconi Macrospeak speech recogniser, learning the rudiments of Unix to get the thing working), which was part-sponsored by a National electricity distribution company. So, he spent time visiting power stations and distribution centres to get an idea of how people did their work. During his PhD, he became interested in supporting speech recognition for mobile workers – which resulted in a large laptop, running the speech recogniser, in a rucksack, together with GPS antenna, and a small head-mounted, monocular television display, to read the words that had been recognised. Naturally, this led to working on wearable computers. Since then, he has shifted the sensors from the person onto everyday tools and objects in order to study the development and retention of human skill. Related to the wearable computers work, he developed technology for crime scene examination – which led to work on sense-making (that is, how crime scene examiners interpret a crime scene and select evidence), which led to work with Police and Intelligence analysts. This has led to work on how human decision making is supported by Artificial Intelligence, and to the study of human-machine teams. In all of this work, he combines an interest in studying human behaviour ‘in the field’ with the design and making of gadgets to measure or support activity. • Panel Chair for EPSRC and Member of EPSRC College • External Examiner for Loughborough University Recent publications Article Baber, C & Cassenti, DN 2025, 'Comparing Static and Dynamic Decision Tasks Using Pupillometry: Expected Loss is More Important than Defined Reward', Proceedings of the Human Factors and Ergonomics Society Annual Meeting, vol. 69, no. 1, pp. 1738-1741. https://doi.org/10.1177/10711813251370728 Baber, C, Kandola, P, Apperly, I & McCormick, E 2025, 'Human-centred explanations for artificial intelligence systems', Ergonomics, vol. 68, no. 3, pp. 391-405. https://doi.org/10.1080/00140139.2024.2334427 Read, GJM, McLean, S, Thompson, J, Stanton, NA, Baber, C, Carden, T & Salmon, PM 2024, 'Managing the risks associated with technological disruption in the road transport system: a control structure modelling approach', Ergonomics, vol. 67, no. 4, pp. 498-514. https://doi.org/10.1080/00140139.2023.2226850 Salmon, PM, McLean, S, Carden, T, King, BJ, Thompson, J, Baber, C, Stanton, NA & Read, GJM 2024, 'When tomorrow comes: A prospective risk assessment of a future artificial general intelligence-based uncrewed combat aerial vehicle system', Applied Ergonomics, vol. 117, 104245. https://doi.org/10.1016/j.apergo.2024.104245 McLean, S, King, BJ, Thompson, J, Carden, T, Stanton, NA, Baber, C, Read, GJM & Salmon, PM 2023, 'Forecasting emergent risks in advanced AI systems: an analysis of a future road transport management system', Ergonomics, vol. 66, no. 11, pp. 1750-1767. https://doi.org/10.1080/00140139.2023.2286907 Salmon, PM, Baber, C, Burns, C, Carden, T, Cooke, N, Cummings, M, Hancock, P, McLean, S, Read, GJM & Stanton, NA 2023, 'Managing the risks of artificial general intelligence: A human factors and ergonomics perspective', Human Factors and Ergonomics in Manufacturing & Service Industries. https://doi.org/10.1002/hfm.20996 Posselt, BN, Seemiller, E, Winterbottom, M, Baber, C & Hadley, S 2022, 'A Digital Alternative to the TNO Stereo Test to Qualify Military Aircrew', Aerospace Medicine and Human Performance, vol. 93, no. 12, pp. 846-854. https://doi.org/10.3357/AMHP.6111.2022 Yusuf, SM & Baber, C 2022, 'DIMASS: A Delaunay-Inspired, Hybrid Approach to a Team of Agents Search Strategy', Frontiers in Robotics and AI, vol. 9, 851846. https://doi.org/10.3389/frobt.2022.851846 Chapter Baber, C 2023, Tool Use and Creativity. in LJ Ball & F Vallée-Tourangeau (eds), The Routledge International Handbook of Creative Cognition. 1 edn, Taylor and Francis, pp. 570-584. https://doi.org/10.4324/9781003009351-36 Conference article Baber, C, Mustafa, R, Leggett, A, Attfield, S, Gibson, WH, Raywood-Burke, G, Roberts, HV & Amey, D 2024, 'Automating the Analysis of Speech Acts in Teams to Understand Distributed Sensemaking', Proceedings of the Human Factors and Ergonomics Society, vol. 68, no. 1, pp. 130-136. https://doi.org/10.1177/10711813241264501 Baber, C, Acharya, A, Howes, A, Cassenti, D & Yu, A 2024, 'How can Artificial Intelligence Teammates Know What Humans Want? Using Eye-Tracking Data to Infer Human Preferences in Game-Theoretic Decision Tasks', Proceedings of the Human Factors and Ergonomics Society, vol. 68, no. 1, pp. 1542-1548. https://doi.org/10.1177/10711813241266833 Baber, C & Taal, A 2023, 'Using Knowledge Graphs to Explore Perspective Taking in Multi-Person Discussion', Proceedings of the Human Factors and Ergonomics Society, vol. 67, no. 1, pp. 2024-2029. https://doi.org/10.1177/21695067231192572 Conference contribution Yusuf, S, Baber, C & Ofek, E 2025, Handling Uncertainty in UAV Sensor Information using Bayesian Belief Network and Large Language Model. in SY Yurish (ed.), Drones and Unmanned Systems: Proceedings of the 1st International Conference on Drones and Unmanned Systems (DAUS' 2025) 19-21 February 2025, Granada, Spain. vol. 1, ARC Conference Proceedings, IFSA, pp. 58-61, 1st International Conference on Drones and Unmanned Systems, Granada, Spain, 19/02/25. https://doi.org/10.13140/RG.2.2.18747.94240 Aljammaz, K, Baber, C & Kim, H 2024, Evaluating novel technologies through the notion of affording situations. in Contemporary Ergonomics and Human Factors 2024. Chartered Institute of Ergonomics & Human Factors, Ergonomics & Human Factors 2024, Kenilworth, United Kingdom, 22/04/24. <https://publications.ergonomics.org.uk/uploads/Evaluating-novel-technologies-through-the-notion-of-affording-situations.pdf> Milivojevic, S, Sobhani, M, Webb, N, Madin, Z, Ward, J, Yusuf, S, Baber, C & Hunt, ER 2024, Swift Trust in Mobile Ad Hoc Human-Robot Teams. in TAS 2024 - Proceedings of the 2nd International Symposium on Trustworthy Autonomous Systems., 16, ACM International Conference Proceeding Series, Association for Computing Machinery , pp. 1-10, 2nd International Symposium on Trustworthy Autonomous Systems, TAS 2024, Austin, United States, 15/09/24. https://doi.org/10.1145/3686038.3686057 View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 8803,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:32"
}