{
  "name": "Christian Wolff 0001",
  "homepage": "https://www.uni-regensburg.de/sprache-literatur-kultur/medieninformatik/sekretariat-team/christian-wolff/index.html",
  "status": "success",
  "content": "Prof. Dr. Christian Wolff - Fakultät für Informatik und Data Science - Universität Regensburg Direkt zum Inhalt Prof. Dr. Christian Wolff Lehrstuhlinhaber E-Mail Adresse: christian.wolff​(at)​ur.de (öffnet Ihr E-Mail-Programm) Tel: +49 941 943 3386 (startet einen Telefonanruf, wenn Ihr Gerät dies zulässt) Standort: PT, PT 3.0.60F Wichtige Informationen: Sprechstunde: Mo 16–17 u.n.V. mit Anmeldung: Sprechstundenanmeldung Universitätsprofessor Dr. phil. habil. Christian Wolff, M. A. Lehrstuhl für Medieninformatik am Institut für Information und Medien, Sprache und Kultur der Universität Regensburg. Seit Oktober 2003 ist Christian Wolff Professor für Medieninformatik an der Fakultät für Sprach-, Literatur- und Kulturwissenschaften (SLK). Anfang 2010 wurde er auf den neugeschaffenen Lehrstuhl für Medieninformatik an dieser Fakultät berufen, den er seit April 2010 innehat. Anfang 2022 ist er in die neue Fakultät für Informatik und Data Science (FIDS) gewechselt, bleibt aber Zweitmitglied in der Fakultät SLK. Werdegang Christian Wolff wurde 1966 in München geboren und wuchs in Regensburg auf. Nach dem Abitur am Regensburger Goethe-Gymnasium studierte er Linguistische Informationswissenschaft, Geschichte, Allgemeine Sprachwissenschaft und Anglistik an den Universitäten Regensburg und Bielefeld und erhielt Stipendien der Studienstiftung des deutschen Volkes sowie nach dem bayerischen Begabtenförderungsgesetz. Nach seinem Magisterexamen (1990) arbeitete er an der Universität Regensburg in einem informationswissenschaftlichen Forschungsprojekt bei Prof. Jürgen Krause. Dort entstand auch seine Dissertation (1994) über \"Graphisches Faktenretrieval\", die im Schnittfeld von Informationswissenschaft, Informatik und Kognitionswissenschaft angesiedelt ist. Sie wurde mit dem Kulturpreis Ostbayern ausgezeichnet, dem Promotionspreis der Universität Regensburg. Ab 1994 arbeitete Christian Wolff als Assistent bei Prof. Gerhard Heyer in der Abteilung für automatische Sprachverarbeitung am Institut für Informatik der Universität Leipzig. Gemeinsam mit Kollegen entstanden dort erste Arbeiten auf dem damals noch jungen Gebiet des Text Mining. In Leipzig erfolgte im Jahr 2000 auch seine Habilitation im Fach Informatik mit einer Arbeit über dynamische elektronische Bücher. 2001 und 2002 nahm er Vertretungsprofessuren für Medieninformatik in Chemnitz und Regensburg wahr. 2002 folgte er einem Ruf auf die Professur für Medieninformatik an der Fakultät für Informatik der Technischen Universität Chemnitz und wechselte 2003 auf die neue Professur für Medieninformatik an der Universität Regensburg. Einen Ruf auf eine C4-Professur für Medieninformatik an der PH Schwäbisch Gmünd hat er 2004 abgelehnt. Im Jahr 2009 erhielt er einen Ruf auf die Position des Direktors der Stiftung Deutsche Zentralbibliothek für Wirtschaftswissenschaften (Leibniz-Informationszentrum Wirtschaft), Kiel und Hamburg, in Verbindung mit einer W3-Professur für Medieninformatik an der technischen Fakultät der Christian-Albrechts-Universität Kiel (abgelehnt im November 2009). Zu seinen Forschungsgebieten zählen die Modellierung und Entwicklung multimedialer und multimodaler Informationssysteme, das elektronische Publizieren und die Texttechnologie, insbesondere Text Mining. Neben seinen Forschungsarbeiten hat er ein Lehrbuch der objektorientierten Programmierung vorgelegt und mehrere Sammelbände herausgegeben. Zusammen mit Kollegen der Universität Leipzig gründete er 2000 die Softwarefirma TextTech GmbH, die sich mit dem Transfer von Forschungsergebnissen auf den Gebieten Texttechnologie und Wissensmanagement befasst, und war bis Anfang 2003 ihr geschäftsführender Gesellschafter. Ämter und Mitgliedschaften Christian Wolff ist Mitglied zahlreicher nationaler und internationaler Fachgesellschaften (u. a. Association for Computing Machinery (ACM), IEEE Computer Society, Gesellschaft für Informatik). Von April 2009 bis Anfang 2020 war er Vorsitzender des Hochschulverbands Informationswissenschaft. Daneben ist er Mitglied des Beirats der Gesellschaft für interdisziplinäre Bildwissenschaft, und (kommissarischer) Sprecher der Regionalgruppe Ostbayern der Gesellschaft für Informatik. 2008 bis 2011 gehörte er dem Vorstand von vascoda e.V. an, dem Trägerverein des deutschen Wissenschaftsportals vascoda. Von 2010 bis 2015 war er externes Mitglied des Senatsausschusses Wettbewerb (SAW) der Leibniz-Gemeinschaft und ist seit 2017 Mitglied des wissenschaftlichen Beirats des Leibniz-Instituts für Bildungsforschung und Bildungsinformation (DIPF) in Frankfurt am Main und Berlin. Seit 2018 ist er Mitglied des Beirats des Hauses der bayerischen Geschichte. Er ist Mitglied des Steuerkreises von INDIGO - Internet und Digitalisierung Ostbayern - und TRIO, dem BMBF-geförderten Verbundprojekt für Transfer und Innovation in Ostbayern im Rahmen des Förderprogramms innovative Hochschule (IHS, 2017-2022). Von 2005 bis 2007 und von 2009 bis 2011 war er Prodekan der Fakultät für Sprach-, Literatur- und Kulturwissenschaften und von 2005 bis 2011 Forschungsdekan dieser Fakultät und Mitglied des Forschungsrates der Universität Regensburg.  Von Oktober 2011 bis September 2013 war er Dekan der der Fakultät für Sprach-, Literatur- und Kulturwissenschaften und von 2013 bis 2015 Mitglied des akademischen Senats und des Hochschulrats der Universität Regensburg. 2016/2017 war er erneut Prodekan der Fakultät für Sprach-, Literatur- und Kulturwissenschaften. Von 2011 bis 2018 war er Vorsitzender der IuK-Kommission der Universität Regensburg und von 2014 bis 2018 Mitglied der Präsidialkommission E-Governance der Universität Regensburg. Von 2019 bis 2021 war er Mitglied der Gründungskommission für die neue Fakultät für Informatik und Data Science der Universität Regensburg. Hier hatte er die Aufgaben eines Studiendekans übernommen (acting dean of studies). Seit April 2022 ist er (Gründungs-) Dekan der Fakultät für Informatik und Data Science der Universität Regensburg. Publikationen alle ausklappenalle einklappen Aufsätze Aufsätze 2025 Achmann-Denkler, M., Haim, M., & Wolff, C. (2025). GPT-4o for Visual Political Communication: Toward Automated Image Type Analysis Proceedings of the 17th ACM Web Science Conference 2025,  https://doi.org/10.1145/3717867.3717881 (externer Link, öffnet neues Fenster) Auch, M., Balluff, M., Mandl, P., & Wolff, C. (2025). Is It Professional or Exploratory? Classifying Repositories Through README Analysis Proceedings of the 20th International Conference on Evaluation of Novel Approaches to Software Engineering (ENASE 2025), Porto. DOI: https://doi.org/10.5220/0013272500003928 (externer Link, öffnet neues Fenster) Bogon, J., Hößl, S., Wolff, C., Henze, N., & Halbhuber, D. (2025). Cognitive Integration of Delays: Anticipated System Delays Slow Down User Actions Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems,  https://doi.org/10.1145/3706598.3713475 (externer Link, öffnet neues Fenster) Hellwig, N. C., Fehle, J., Kruschwitz, U., & Wolff, C. (2025). Do we still need Human Annotators? Prompting Large Language Models for Aspect Sentiment Quad Prediction. arXiv e-prints, arXiv: 2502.13044. DOI:https://doi.org/10.48550/arXiv.2502.13044 (externer Link, öffnet neues Fenster) Hellwig, N. C., Fehle, J., & Wolff, C. (2025). Exploring large language models for the generation of synthetic training samples for aspect-based sentiment analysis in low resource settings. Expert Systems with Applications, 261, 125514. https://doi.org/https://doi.org/10.1016/j.eswa.2024.125514 (externer Link, öffnet neues Fenster) Mielke, B., & Wolff, C. (2025). Das digitale Basisdokument. Ergebnisse aus dem Deutschlandweit ersten Reallabor im Rechtswesen. Paper presented at the Der Mensch im Zentrum - KI, Ethik & Recht / Human-Centred AI for Good - AI, Ethics & Law. Proceedings des 28. Internationalen Rechtsinformatiksymposions IRIS 2025, Wien. Mielke, B., & Wolff, C. (2025). „KI, lös‘ mir den Fall!“ Zur Evaluierung grosser Sprachmodelle für Anwendungen im deutschsprachigen Rechtswesen. Paper presented at the Der Mensch im Zentrum - KI, Ethik & Recht / Human-Centred AI for Good - AI, Ethics & Law. Proceedings des 28. Internationalen Rechtsinformatiksymposions IRIS 2025, Wien. https://jusletter-it.weblaw.ch/issues/2025/20-Februar-2025/-ki_-los--mir-den-fa_599a01672b.html (externer Link, öffnet neues Fenster) Reichert, E. S., Babl, A.-L., Kim, K., Achmann-Denkler, M., & Wolff, C. (2025, 3. 3. 2025). Aspektbasierte Sentimentanalyse von Bookstagram-Posts DHd 2025: Under Construction. 11. Jahrestagung des Verbands Digital Humanities im deutschsprachigen Raum e.V., Bielefeld. DOI: https://doi.org/10.5281/zenodo.14887461 (externer Link, öffnet neues Fenster) Sautmann, M., & Wolff, C. (2025). Reallabore evaluieren: Erfahrungen aus einem Digitalisierungsprojekt im Rechtswesen. In M. Eibl (Ed.), Datenströme und Kulturoasen — Die Informationswissenschaft als Bindeglied zwischen den Informationswelten. Proceedings des 18. Internationalen Symposiums für Informationswissenschaft (ISI 2025), Chemnitz, Deutschland, 18.—20. März 2025 (pp. 122-149). Verlag Werner Hülsbusch. https://doi.org/https://doi.org/10.5281/zenodo.14925608 (externer Link, öffnet neues Fenster) 2024 Achmann-Denkler, M., & Wolff, C. (2024). Preserving the Ephemeral: Instagram Story Archiving with the Tidal Tales Plugin. arXiv / ACM Computing Research Repository (CoRR). https://doi.org/10.48550/arXiv.2409.01880 (externer Link, öffnet neues Fenster) Achmann-Denkler, M., Fehle, J., Haim, M., & Wolff, C. (2024). Detecting Calls to Action in Multimodal Content: Analysis of the 2021 German Federal Election Campaign on Instagram. arXiv / ACM Computing Research Repository (CoRR). https://doi.org/10.48550/arXiv.2409.02690 (externer Link, öffnet neues Fenster) Auch, M., Balluff, M., Mandl, P., & Wolff, C. (2024). Towards an Automated Classification of Software Libraries. SN Computer Science, 5(4), 339. https://doi.org/10.1007/s42979-024-02654-2 (externer L",
  "content_length": 115115,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:26"
}