{
  "name": "Christopher D. Carothers",
  "homepage": "http://www.cs.rpi.edu/~chrisc",
  "status": "success",
  "content": "Christopher D. Carothers Christopher D. Carothers -- Research and Education Program @ RPI Contact Information   | Biography   | Research Projects   | Publications   | Course Information   | Prospective Students   | Contact Information Christopher D. Carothers Director, Center for Computational Innovations Professor Department of Computer Science Rensselaer Polytechnic Institute 110 8th Street Troy, New York 12180 (518) 276-2930 chris.carothers@gmail.com Office Hours: Please see your course syllabus Current CV Download PDF Biography Professor Chris Carothers is a faculty member in the Computer Science Department at Rensselaer Polytechnic Institute. He received the Ph.D., M.S., and B.S. from Georgia Institute of Technology in 1997, 1996, and 1991, respectively. Prior to joining RPI in 1998, he was a research scientist at the Georgia Institute of Technology. His research interests are focused on massively parallel computing which involve the creation of high-fidelity models of extreme-scale networks and computer systems. These models have executed using nearly 2,000,000 processing cores on the largest leadership class supercomputers in the world. Professor Carothers is an NSF CAREER Award winner as well as Best Paper award winner at the ACM-SIGSIM PADS Conference for 1999, 2003 and 2009. Since joining Rensselaer, he has developed a world-class research portfolio which includes funding from the NSF, the U.S. Department of Energy, Army Research Laboratory, Air Force Research Laboratory, as well as several companies, including IBM, General Electric, and AT&T. Additionally, Professor Carothers serves as the Director for the Rensselaer Center for Computational Innovations (CCI). CCI is a partnership between Rensselaer and IBM. The center provides computation and storage resources to diverse network of researchers, faculty, and students from Renssleaer, government laboratories, and companies across a number of science and engineering disciplines. The flagship supercomputer, named \"AiMOS\", is an 8 petaFLOP IBM hybrid CPU/GPU system with 126 terabytes of memory and over 8 petabytes of center-wide, disk storage. Research Projects Project Name Funding/Hosting OrganizationTitleWeb Link AIHWC IBM/New York State IBM/NYS AI Hardware Center Web Page CODES Department of Energy Co-design of Exascale Storage and Data Facilities Web Page MN-BRIC Air Force Research Lab Doryta: Parallel Simulation of Magnetic Nanoelectronics for Brain-Inspired Computing Web Page NSF CAREERS NSF CC* Program Cyberteam to Advance Research and Education in Eastern Regional Schools Web Page Panorama Department of Energy Predictive Modeling and Diagnostic Monitoring of Extreme Science Workflows Web Page ROSS GIT-Hub ROSS Engine, Tools and Models Source Code Repo Web Page For publications, please see my latest CV here Please email me if you would like an electronic copy Course Information All course information is posted on Submitty Course Management System Message To Prospective Graduate Students My research program is very software intensive, focusing largely in the area of parallel and distributing computing, networking and modeling and computer simulation, as well as computer architecture as it applies to these areas. If you wish to be apart of my research program, please consider the following in addition to your having an excellent scholastic achievements and standardize test scores (GRE): You should possess strong programming skills in either C or C++ and an equally strong desire to work with software very intensely as part of your PhD research program. You should have been exposed to low level assembly language programming like x86 or MIPS, ARM or other. You should be fluent in working with Linux, FreeBSD or other variants of Unix (once you know one variant, working with the others is easy). If you are only fluent with Windows, unfortunately, those skills while valuable are not needed in my research program and you'll have a tough time getting started. Exposure to parallel programming frameworks like Pthreads and MPI on Linux/Unix clusters or better yet state-of-the-art supercomputers like IBM Blue Gene. If you possess these skills and you want an exciting research program in parallel computing systems, please send me e-mail that includes: Your research interest within my program. A sample of Linux/Unix software you've written (the whole tarball is fine). A code sample using either Pthreads or MPI is preferred but not required. A description of what the code sample does. I look forward to hearing from you!!. Regards, Dr. C.",
  "content_length": 4569,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:07"
}