{
  "name": "Christian Robert Huyck",
  "homepage": "http://www.cwa.mdx.ac.uk/chris/chrisroot.html",
  "status": "success",
  "content": "Chris Huyck's Home Page Chris Huyck's Home Page I am the Professor of Artificial Intelligence at Middlesex University in the School of Science and Technology. Here's our departmental web page. Here's my school web page. You may be interested in Chris, or Dr. Christian R. Huyck, for several reasons. My email address is c.huyck@mdx.ac.uk, my office phone number is 44-020-8411-5412, but that goes to teams my office hours for Autumn 2025/26 are Tuesdays from 2:30-3:30, and you can email me for an appointment. My address is T127 in the Town Hall Middlesex University The Burroughs, Hendon London NW4 4BT UK Courses Taught I have run CST 3170 Developing Artificial Intelligence since 2019. I am currenty the Progamme Leader for the BSc in Artificial Intelligence and Data Science. I ran CST 4157 Computational Neural Modelling starting in January 2023. I ran CSD 3939 Developing Artificial Intelligence since 2015. Here are some PhD theses I'm interested in supervising . Here are some theses I'm interested in supervising . I ran CMT 3325 Advanced Topics in Games Development from 2009 to 2015. I ran the AI part of CSD 4040 Advanced Topics in Computer Science , in 2013-2014. I ran BIS 4430 Web-based Information Systems Management with Geetha Abeysinghe, in 2011-2012. I ran BIS 4407 Research Methods in Knowledge Management in the winter 2009/2010. I was the programme leader for the MSc in Knowlege Management. I have taught Knowledge Based Systems for Business, Research Topics in Knowledge Management, Commercial Web Development, Graduate Artificial Intelligence, Artificial Intelligence, Natural Language Processing, C++, C and second semester programming. I was a teaching assistant for Compiler Theory, Theory of Computation, Interactive Computer Graphics, and first and second semester programming. I have supervised several hundred BSc and MSc theses, and am currently supervising two PhD students. Here's a class I gave in March 2025 to potential BSc AI and Data Science, CS, and IT students a BSc in AI and Data Science, Computer Science, or IT at Middlesex. Here's a class I gave in November 2023 to potential BSc CS students BSc in Computer Science at Middlesex. Here's a talk I gave in October 2023 to the Psychology BSc students on Artificial Intelligence. Here's a lecture I gave with Dan Diaper as the CS Departmental Colloquium in January 2021 on Cell Assembly Based Task Analysis. Here's a lecture I gave to the foundation neuroscience students in March 2020 A Very Basic Introduction to Computational Neuroscience. Here's a talk I gave to CS School Research Team on grants in January 2020 Stuff About Grants. Here's a lecture I gave for 6th formers at Woodhouse College in December 2018 AI in games . Here's a lecture I gave for First Year Computer Scientists at Middlesex I ran in November 2020. Here are some notes for the Departmental Research Team meeting September 2018 Notes . Here's a lecture I gave at the Crick in July 2017 entitled Deep Nets, Middlesex AI, and Paying for your Lunch . Here's a talk entitled Natural Language Processing with Neurons that I gave to the Sheffield NLP group in October 2015. Here's a lecture I gave Product Design and Engineering course at Middlesex I ran in October 2014. Here's a lecture I gave for a Data Mining mini-course at Middlesex I ran in June 2013. Here's a workshop I ran for EIS PhD students on Theory in Theses I ran in June 2011. Here's an outreach class on Rule Based Games Agents I ran in May 2010. Here's a talk I did on The AI Group and Software Engineering at EIS's Software Engineering Sandpit in April 2010. Here's a talk I did on Why Model the Mind at Middlesex in November 2009, and here's a talk on Data Mining at Cranfield in March 2007, and here's a talk on simple search for the CMT 1314 introductory programming module in January 2008. Research My main research area is neural processing. I'm particularly interested in cell assemblies, and here is a gentle introduction to cell assemblies. We had some grants on Neuromorphic Embodied Agents that Learn as part of the Human Brain Project. My second research focus is in Natural Language Processing. I am an expert in Natural Language Parsing I am particularly interested in how people process language. With this in mind, I have another interest in Hebbian Connectionist systems. I think that this mechanism gives a reasonable (though of course incomplete)explanation on how people think. Natural Language Processing is a sub-field of Artificial Intelligence, and I take a wide interest in other areas of AI, particularly where they apply to Natural Language. We ran a working group on Neuromorphic Natural Language Processing at the Neuromorphic Workshop in Telluride in the summer of 2015. I used to manage the EIS School Research Seminars , a version on this server, and a draft of the 2012-2013 Science and Technology seminar series. I used to run the AI research group ( old page). Here is a link for my current AI group stuff. I'm managing the seminar series this year. I'm a member of the AI reading group, and, aside from 2009-2010, have run it since 1998. You can see some of my papers. I'm helping with Middlesex's Annual Research Student Summer Conference. Recreational Activities and other I've got some pictures of my son Jody, of my daughter Harmony, and of my daughter Eden. My brother George Anthony has a site at G.A. George. I play Ultimate Frisbee. I play a little sloppy rhythm guitar. Links to things not closesly related to teaching or research. Please send mail to: c.huyck@mdx.ac.uk Page last modified",
  "content_length": 5567,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:18"
}