{
  "name": "Christian Urban",
  "homepage": "https://www.kcl.ac.uk/people/christian-urban",
  "status": "success",
  "content": "Christian Urban | King's College London Skip to main contentDr Christian Urban Lecturer in Computer ScienceMSc Programme Board ChairEmmy-Noether Fellow of the German Research CouncilResearch interestsComputer scienceContact details+44 020 7848 2584christian.urban@kcl.ac.ukBiographyChristian Urban is a Lecturer in Computer Science, in the department of Informatics at King's College London. He received his Master's degree from the University of St Andrews and completed his PhD at Cambridge University, funded by two scholarships from the German Academic Exchange Service (DAAD). Before joining King's, he was awarded a Junior Research Fellowship at Corpus Christi College in Cambridge, and a five-year Emmy-Noether fellowship, which he held at the TU Munich, Germany. His research was awarded a Thoralf Skolem Award, a ten-year test-of-time award from CADE.Research interests Theorem provers Programming languages Compilers Type systems Functional programming Further information Research Profile Research Funding Personal Website PublicationsResearchResearchTrusted Autonomous Systems HubThe Trusted Autonomous Systems Hub develops the trustable autonomous systems of tomorrow. King's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.Security HubThe Security Hub consolidates the research related to securitySoftware SystemsThe group studies design, modelling and engineering of software systems.NewsNews09 December 2021Simplifying software verification techniquesResearchers at King’s and the University of Illinois at Urbana-Champaign (UIUC) are collaborating to develop techniques to enhance software verification...Technology & SciencePublicationsResearchNewsResearchTrusted Autonomous Systems HubThe Trusted Autonomous Systems Hub develops the trustable autonomous systems of tomorrow. King's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.Security HubThe Security Hub consolidates the research related to securitySoftware SystemsThe group studies design, modelling and engineering of software systems.News09 December 2021Simplifying software verification techniquesResearchers at King’s and the University of Illinois at Urbana-Champaign (UIUC) are collaborating to develop techniques to enhance software verification...Technology & Science(N)7.07Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering Sciences",
  "content_length": 2824,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:23"
}