{
  "name": "Christian Ø. Madsen",
  "homepage": "https://pure.itu.dk/portal/en/persons/christian-oestergaard-madsen(74a08deb-18e1-48d0-a86e-ed6675da92ab).html",
  "status": "success",
  "content": "Christian Østergaard Madsen - IT-University of Copenhagen Christian Østergaard Madsen Associate Professor, Software EngineeringDanish Institute for IT Program ManagementResearch Centre for Government IT https://orcid.org/0000-0002-5984-561X Emailchrmitudk 20052024 Research activity per year Personal profile KeywordsPublic IT projectsDigital governanceMultichannel managementService designAction researchLiterature reviews Fingerprint Dive into the research topics where Christian Østergaard Madsen is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Public Sector Keyphrases 100% Digitalization Social Sciences 98% Self-Service Social Sciences 95% e-government Computer Science 94% Public Services Keyphrases 88% Public Utilities Social Sciences 81% Electronic Government Keyphrases 80% e-Government Social Sciences 79% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2005 2019 2020 2021 2022 2024 17 Article in proceedings 10 Journal article 6 Conference abstract for conference 2 Book chapter 4 More 2 Conference article 1 Report 1 PhD thesis Research output per year Research output per year Digitalisering og administrative byrderTranslated title of the contribution: Digitalization and administrative burdensØstergaard Madsen, C. & Hjelholt, M., 29 Nov 2024, In: Politica - Tidsskrift for politisk videnskab. 56, 4, p. 296 317 p., 1.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Denmark 100% Digitalization 100% Administrative Burden 100% Self-Service 80% Digital Self-service 42% Five Bureaucratic Roles in the Age of Digital Transformation: – Insights from Scandinavian Public OrganizationsMelin, U., Østergaard Madsen, C. & Larsson, K. K., 20 Aug 2024, Electronic Government: 23rd IFIP WG 8.5 International Conference, EGOV 2024, Ghent-Leuven, Belgium, September 3–5, 2024, Proceedings. Marijn, J. (ed.). Springer, p. 99-115 17 p. (Lecture Notes in Computer Science, Vol. 14841).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review File Public Organizations 100% Digital Transformation 100% Scandinavian 100% Street-level Bureaucrats 100% Public Organization 100% What Public Services are Suitable for Digitalization? - A Classification of Public Service CharacteristicsLindgren, I., Østergaard Madsen, C., Höglund Rýden, H., Heggertveit, I., Hofmann, S. & Sæbø, Ø., 20 Aug 2024, Electronic Government: 23rd IFIP WG 8.5 International Conference, EGOV 2024, Ghent-Leuven, Belgium, September 3–5, 2024, Proceedings. Springer, p. 201-217 17 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Public Services 100% Service Characteristics 100% Welfare Benefits 100% Digitalization 100% Welfare 100% Administrative Burden in Digital Self-Service: An Empirical Study About Citizens in Need of Financial AssistanceHeggertveit, I., Lindgren, I., Østergaard Madsen, C. & Hofmann, S., 2022, Electronic Participation: Lecture Notes in Computer Science. Krimmer, R. (ed.). Springer, Vol. 13392. p. 173-187 15 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Digital Self-service 100% Administrative Burden 100% Self-Service 100% Financial Aid 100% Application Process 40% Explanations for budget and schedule overrun revisited – a configurational perspective on IT projectsKrancher, O., Østergaard Madsen, C., Alami, A. & Petersson, C., 2022, In: Proceedings / International Conference on Information Systems (ICIS). 17 p.Research output: Journal Article or Conference Article in Journal › Conference article › Research › peer-review Open AccessFile IT Project 100% Schedule Overrun 100% Configurational Perspective 100% Budget Overruns 100% Schedule Adherence 100% View all 39 research outputs Projects Projects per year 2012 2012 2016 2018 2021 2022 2027 2 Active 4 Finished Projects per year What public services should be digitalised? A citizen-centred analysis of what public services are suitable for digital channelsØstergaard Madsen, C. (PI) & Petersson, C. (CoI)Det Norske arbeids- og velferdsdirektoratet 01/03/2021 → 30/04/2024Project: Other Public Services 100% Telephone 56% Channel Activity 50% Service Designer 50% Analytical Tool 50% 4til80: Fra fire til firs procent? Diffusion og Domesticering af webbaserede selvbetjeningsløsninger til offentlige ydelser.Kræmmergaard, P. (PI), Ling, R. (CoI) & Østergaard Madsen, C. (CoI)Danish Council for Strategic Research01/08/2012 → 23/11/2015Project: Research e-government 100% Electronic Government 97% Cross-organizational Collaboration 50% Multi-channel Management 50% Channel Choice 50% Villum Kann Rasmussen ProfessorshipSchmidt, J. (PI), Flyvbjerg, B. (PI), Madsen, C. Ø. (CoI), Pfeiffer, H. (CoI), Lithén, J. C. L. (Admin), Gandrup, N. (Collaborator), Petersson, C. (Collaborator), Aaen, J. (CoI), Ouriques, R. A. B. (CoI) & Ajazi, F. (CoI)Villum Foundation01/01/2022 → 31/12/2027Project: Research Professorship 100% IT Project Management 50% Bent Flyvbjerg 50% Program Management 50% IT Program 50% What public services should be digitalised? Citizens' and public organisations' perspectives on digital welfare services in ScandinaviaØstergaard Madsen, C. (PI) & Petersson, C. (CoI)The Research Council of Norway01/01/2021 → 31/12/2025Project: Other Public Services 100% Public Organization 93% Public Organizations 91% Channel Activity 83% Digitalization 83% FCOIT: Research Centre for Government ITSchmidt, J. (PI), Dupont, C. (CoI), Østergaard Madsen, C. (CoI), Pfeiffer, H. (CoI), Skaarup, S. (Collaborator), Kjærsgaard Hansen, M. E. (Collaborator) & Alami, A. (Collaborator)Digitaliseringsstyrelsen01/01/2018 → 31/12/2021Project: Research Research Centre 100% Government IT 100% View all 6 projects Press/Media Digitalisering gir ikke nødvendigvis bedre tjenester til innbyggerneØstergaard Madsen, C.02/12/20211 Media contributionPress/Media: Press / Media Deutschland im digitalen KomaØstergaard Madsen, C.21/11/20211 Media contributionPress/Media: Press / Media Webinar: ITU ESPRESSO: Offentlig digitalisering - hvorfor ringer borgerne stadig?Østergaard Madsen, C.11/10/20211 Media contributionPress/Media: Press / Media Danskerne er vilde med digitalisering, men er andelsboligforeningerne?Østergaard Madsen, C.09/12/20191 Media contributionPress/Media: Press / Media Digitale fadæser skader vores tillid til det offentligeØstergaard Madsen, C.21/11/20191 Media contributionPress/Media: Press / Media View all 18 press/media Activities Activities per year 2022 2022 2023 2024 2024 13 Lecture and oral contribution 1 Organisation and participation in workshop, seminar, course Activities per year Bedre end forventet? Budget og tidsoverskridelser i statslige it-projekterØstergaard Madsen, C. (Speaker) & Krancher, O. (Speaker)9 Oct 2023Activity: Talk or presentation types › Lecture and oral contribution Budget og tidsoverskridelser i statslige it-projekterØstergaard Madsen, C. (Speaker) & Schmidt, J. (Speaker)22 Jun 2022Activity: Talk or presentation types › Lecture and oral contribution Budget og tidsoverskridelser i statslige it-projekterØstergaard Madsen, C. (Speaker)22 Mar 2022Activity: Talk or presentation types › Lecture and oral contribution Budget- og tidsoverskridelser i statslige it-projekterØstergaard Madsen, C. (Speaker) & Schmidt, J. (Speaker)14 Jun 2022Activity: Talk or presentation types › Lecture and oral contribution Danske erfaringer med offentlig digitaliseringØstergaard Madsen, C. (Speaker)24 Aug 2023Activity: Talk or presentation types › Lecture and oral contribution View all 14 activities",
  "content_length": 8161,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:26"
}