{
  "name": "Christian Rossow",
  "homepage": "https://christian-rossow.de",
  "status": "success",
  "content": "c-r.de: Christian Rossow Apply for a PostDoc/PhD position in my research group at CISPA in Dortmund, Germany. https://www.christian-rossow.de If you can't explain it simply, you don't understand it well enough. Christian Rossow Faculty at CISPA – Helmholtz Center for Information Security (dblp, Google Scholar, publications) mail: rossow [at] cispa . de (remove spaces) PGP key: FC5F D8C7 2B6A 3175 BA6B 4983 8FD7 468D 4C07 4C1D About me: I am Faculty at the Helmholtz Center for Information Security (CISPA), leading the System Security research group in Dortmund, Germany. At the same time, I am full professor at the CompSci faculty at TU Dortmund. I obtained my PhD from VU Amsterdam in 2013 and was professor at Saarland University until 2025. The primary interests of my research group centers on these areas: Software Security (e.g., exploitation, defenses) Network Security and Privacy Denial-of-Service Attacks and Defenses Community Services: I regularly act as reviewer for the most impactful venues in the cybersecurity context. Find below an incomplete subset of conferences I was involved in. Note that I generally decline invitations to review for journals given their lower impact/visibility in cybersecurity research. Track Chair (Network Security) at ACM CCS 2026. PC Chair at RAID 2022 and 2023 PC Chair at USENIX WOOT 2018 Publication Chair at EuroSys 2014 Publicity Chair at RAID 2014 Publicity Chair at IEEE EuroS&P 2017 PC member at ACM CCS (2017, 2022) PC member at ACM EuroSec (2014, 2015, 2016, 2018) PC member at ACSAC (2016, 2017) PC member at DIMVA (2015, 2016, 2017, 2018, 2019, 2021) PC member at IEEE EuroS&P (2016, 2019) PC member at IEEE S&P (2020, 2021, 2022) PC member at RAID (2014, 2015, 2016, 2019) PC member at USENIX Security (2023, 2024, 2025, 2026) PC member at USENIX WOOT (2015, 2016, 2021) ___\"The wisest men follow their own direction.\" - Euripides » CISPA Helmholtz Center for Information Security » SysSec Research Group » Solarpark » Legal Notice / Data Protection",
  "content_length": 2015,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:17"
}