{
  "name": "Christopher J. MacLellan",
  "homepage": "https://chrismaclellan.com",
  "status": "success",
  "content": "Christopher J. MacLellan | Personal website for Christopher J. MacLellan and blog about HCI, AI, ML, and Educational Technology. Christopher J. MacLellan Assistant Professor School of Interactive Computing College of Computing Georgia Institute of Technology cmaclell@gatech.edu Curriculum Vitae Research & Teaching Statement Who I Am I am an assistant professor in the School of Interactive Computing at Georgia Institute of Technology where I run the Teachable AI Lab (TAIL). My work aims to improve our understanding of how people teach and learn and to build AI systems that can teach and learn like people do. I explore the development of computational models of human learning and how these models can support the development of effective learning technologies at scale. Prior to my work at Georgia Tech, I was an assistant professor at Drexel University in the Information Sciences Department with a co-appointment in the Computer Science Department. I also used to be a lead scientist at Soar Technology, Inc. where I developed novel Artificial Intelligence and Machine Learning technologies to support end users in making better decisions and learning more effectively. I got my PhD from the Human Computer Interaction Institute at Carnegie Mellon University where I was advised by Ken Koedinger and was a fellow in the Program for Interdisciplinary Education Research (PIER). Before coming to CMU, I was a graduate student in Computer Science at Arizona State University where I worked with Pat Langley and Jami Shah. I also completed my bachelor degree in Computer Science and Mathematics at the University of Wyoming where I did work with Ruben Gamboa and Siguna Mueller What I do I use artificial intelligence and machine learning to model how humans teach, learn, and solve problems. I use these models to better understand human teaching and learning, and to facilitate and guide the design of new technologies. My recent work explores the development of computational models that can learn like people do. I am investigating how end-users can leverage these models to teach cognitive systems new capabilities, similar to how they would teach another person. I am also interested in how computational models can be used in other areas, such as supporting designers in being more creative and helping people to better understand and improve their personal fitness.",
  "content_length": 2378,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:16"
}