{
  "name": "Christoph Haase",
  "homepage": "https://www.cs.ox.ac.uk/people/christoph.haase",
  "status": "success",
  "content": "Christoph Haase | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyChristoph HaaseChristoph Haase Professor Christoph Haase Associate Professor of Computer ScienceTutorial Fellow, St Catherine's CollegeE: christoph.haase@cs.ox.ac.ukThemes:Automated VerificationCompleted Projects:ARiATInterestsFor further information, see my personal webpage.See alsoPersonal webpageSelected PublicationsView AllManage publications Directed Reachability for Infinite−State Systems Michael Blondin‚ Christoph Haase and Philip Offtermatt In Tools and Algorithms for the Construction and Analysis of Systems‚ TACAS. Springer. 2021. To appear Details about Directed Reachability for Infinite−State Systems | BibTeX data for Directed Reachability for Infinite−State Systems On the Expressiveness of Büchi Arithmetic Christoph Haase and Jakub Różycki In Foundations of Software Science and Computation Structures‚ FOSSACS. Springer. 2021. To appear Details about On the Expressiveness of Büchi Arithmetic | BibTeX data for On the Expressiveness of Büchi Arithmetic Approaching Arithmetic Theories with Finite−State Automata Christoph Haase In Language and Automata Theory and Applications‚ LATA. Vol. 12038 of Lect. Notes Comp. Sci.. Pages 1–11. Springer. 2020. Details about Approaching Arithmetic Theories with Finite−State Automata | BibTeX data for Approaching Arithmetic Theories with Finite−State Automata | DOI (10.1007/978-3-030-40608-0_3) ActivitiesQuantitative Analysis and Verification Past Students Ruiwen DongJonathan Tanner Past Researcher Andrew RyzhikovAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 1845,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:45"
}