{
  "name": "Christof Monz",
  "homepage": "https://staff.science.uva.nl/c.monz",
  "status": "success",
  "content": "Christof Monz - Home Page Christof Monz Chair of Language Technology Informatics Institute Language Technology Lab University of Amsterdam Visiting address: Office L6.06, Lab42 Science Park 900 1098 XH Amsterdam The Netherlands Mailing address: P.O. Box 94323 1090 GH Amsterdam The Netherlands E-mail: \"initial of first name\" . \"last name\" at uva.nl Phone: +31 (0)20-525-8676 Fax: +31 (0)20-525-7490 Home Projects Research Publications Teaching Activities Software Other Stuff Bio My research focuses on automated information access, in particular access across languages. Topics of interest to me are: Statistical Machine Translation Cross-Language Information Retrieval Data Mining for Natural Language Processing For more detailed information check out my Research, Projects and Publications pages. PhD Students Kata Naszadi (2021-) David Stap (2019-) Ali Araabi (2019-) Amir Soleimani (2018-) co-supervised with Marcel Worring Shaojie Jiang (2018-) co-supervised with Maarten de Rijke Yangjun Zhang (2018-) co-supervised with Maarten de Rijke Marzieh Fadaee (2014-2020) [ PhD thesis ] Hamidreza Ghader (2014-2020) [ PhD thesis ] Praveen Dakwale (2014-2020) [ PhD thesis ] Ke Tran (2013-2018) [ PhD thesis ] Marlies van der Wees (2013-2017) [ PhD thesis ] Katya Garmash (2013-2017) [ PhD thesis ] Spyros Martzoukos (2010-2016) [ PhD thesis ] Simon Carter (2009-2012) [ PhD thesis ] Sirvan Yahyaei (2007-2011) [ PhD thesis ] Post-Docs Arianna Bisazza (2013-2017) Ivan Zapreev (2015-2018) Bogomil Kovachev (2010-2012) Christophe Costa Florencio (2011-2013) Scientific Programmers Amit Bronner (2010-2013) Jeroen Kools (2012-2013) So, you want to do a PhD... ... here are my survival tips to get through this without being traumatized for life. Workshop on Statistical Machine Translation Series I've been involved in this series for seven years now and it is organized together with colleagues from Edinburgh University, Johns Hopkins University, CELCT Italy, National Research Council Canada, University of Minnesota, University of Sheffield, SDL Language Waver, Google, and University of North Texas. Check here for the online proceedings: [ 2019 ] [ 2018 ] [ 2017 ] [ 2016 ] [ 2015 ] [ 2014 ] [ 2013 ] [ 2012 ] [ 2011 ] [ 2010 ] [ 2009 ] [ 2008 ] [ 2007 ] [ 2006 ] [ 2005 ]",
  "content_length": 2277,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:41"
}