{
  "name": "Christoph F. Eick",
  "homepage": "http://www2.cs.uh.edu/~ceick",
  "status": "success",
  "content": "CHRISTOPH F. EICK last updated: August 25, 2025 Paintings below: 1. Pablo Picasso: Femme au beret et a la robe quadrillee, 1937; 2. Max Ernst: Le chant de la grenouilles, 1957; 3. Anselm Kiefer: Rorate Caeli Desuper, 2016; 4. Wols: Oiseau, 1949; 5. Wassily Kandinsky: Rot-Gelb-Blau, 1925; 6. Roberto Matta: Angoisse, 1942. CHRISTOPH F. EICK (Ph.D., Karlsruhe) Associate Professor, and Director UH Data Analysis and Intelligent Systems Lab (UH-DAIS) Department of Computer Science University of Houston, Houston, TX 77204-3010. Office: 573 Philip G. Hoffman (PGH) Phone: (713) 743-3345 (leave message) Fax: (713) 743-3335 WWW: http://www.cs.uh.edu/~ceick/ceick.html Email: ceick at uh dot edu Office Hours Fall 2025: TU 8:45-10a TH 4-4:45p (August 26-December 2) Exceptions: no office hour October 7 and October 20! Research Areas of Expertise: Knowledge Discovery and Data Mining Evolutionary Computing Data Science Geographical Information Systems (GIS) Artificial Intelligence Recent and Planned Research Projects: Spatial and Spatio-temporal Data Analysis Frameworks Collocation Mining Supervised and Density-based Clustering Algorithms Threshold-based Association Analysis for Continuous Variable Disaster Computing Frameworks for Landscape Generation Students I have or had the privilege of conducting research with the following students in the last 3 years: PhD Students: Steve Aigbe, Karima Elgarroussi, Md. Mahin, Raunak Sarbajna, and Janet Anagli. Master Students Aparna Budhavarapu, Jennifer A. Csicsery-Ronay, Anjana Kummari, Anusha Nemilidinne, Parth Sanghani, Akhil Talari and Hoang Vo. Undergraduate Students:Mohamed Amr Abdelgalil Max Broekhuis, Max Deniz Burduroglu, Tuyen Cao, Lingwei Kong, Ashish Nare, Adam Nelson-Archer and Aleia Sen. Contributing Alumni: Sujing Wang and Paul Amalaman. Teaching Websites for Courses I teach: Graduate Articial Intelligence (COSC 6368) Undergraduate Articial Intelligence (COSC 4368; updated on January 15, 2024) Data Science I (COSC 3337) Undergraduate Data Mining (COSC 4335) Graduate Data Mining (COSC 6335) Graduate Machine Learning (COSC 6342) Advanced Machine Learning (COSC 7362) Evolutionary Programming (COSC 6367) Recent and Current Service 2011-2013, I served as the Associate Chairman for the Department of Computer Science. I served on the Faculty Search Committee 2005-2006 and 2007-2010, 2014-16 and 2021-2023. I also served as the Director of Graduate Studies for the Computer Science Department from September 2001 to November 2004. In recent years I served on the program committee for the IEEE International Conference on Data Mining 2006-2013 and 2016-2023 (ICDM), for the International Symposium on Methodologies for Intelligent Systems (ISMIS), the Transdisciplinary AI Conference and AAAI 2019 (took place in Honolulu, Hawaii end of January 2019). 2024/2025 Travel 2024/2025 UH-DAIS Research \"Supervised Clustering\" Talk at HPE Data Science Institute, Houston, March 2022 \"Threshold Correlation\" Talk at ACM SIGSPATIAL GeoAI, Hamburg, November 2023 \"Continuous Variable Co-Location Mining\" Talk at IEEE ICDM SSTDM, Abu Dhabi, December 2024 Md Mahin's \"Continuous Spatial Variable Threshold Association Mining\" Talk at IEEE BigData, Washington D.C., December 2024",
  "content_length": 3239,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:45"
}