{
  "name": "Christian Wressnegger",
  "homepage": "https://intellisec.de/chris",
  "status": "success",
  "content": "Artificial Intelligence and Security Prof. Dr. Christian Wressnegger Email Bluesky @chwress.bsky.social Telephone +49 721 608-43929 Room 150 Address Karlsruhe Institute of Technology Institute of Information Security and Dependability Am Fasanengarten 5, Geb. 50.34 76131 Karlsruhe, Germany Chair of the \"Artificial Intelligence and Security\" research group About me I am a Professor of Computer Science at Karlsruhe Institute of Technology (KIT) heading the \"Artificial Intelligence and Security\" research group. I am holding a PhD from TU Braunschweig and graduated from Graz University of Technology where I majored in Computer Science. Moreover, I serve as the spokesperson for the \"KIT Graduate School Cyber Security,\" is co-director of the \"KASTEL Security Research Labs,\" one of three competence centers for cybersecurity in Germany, and has recently been appointed Junior Fellow of the Berlin Institute for the Foundations of Learning and Data (BIFOLD). My research revolves around combining machine learning (or AI in the broader scope) and computer security. I develop methods in the area of system security and application security, for instance, approaches for attack detection or vulnerability discovery in software. Moreover, I research the robustness of machine learning against attacks striving for \"secure AI.\" In this context, I am particularly interested in the Security of XAI. Publications A complete list of my publications is available here. Awards NDSS Distinguished Paper Award 2025 AISEC Top Reviewer Award 2025 ACSAC Best Paper Award Runner-Up 2024 ACSAC Top Reviewer Award 2023 USENIX Security Distinguished Reviewer 2023 SatML Notable Reviewer 2023 USENIX Security Distinguished Paper Award 2022 WWW Honorable Mentioned PC Member 2022 WWW Best Paper Award 2022 (Runner-up) Best CS Lecture at KIT 2021 (Summer Term) ARES Best Reviewer Award 2021 CVPR-SAIAD Best Paper Award 2021 (Runner-up) WWW Best PC Member 2021 DIMVA Best Paper Award 2019 (Runner-up) ARES Best Paper Award 2019 (Runner-up) Best Lecture at TU Braunschweig 2019 Best Practical Course at TU Braunschweig 2019 CAST/GI Dissertation Award for IT-Security 2019 (Runner-up) DIMVA Best Paper Award 2016 German Prize for IT-Security 2016 (2nd Place) Conference and Workshop Organization Artifact evaluation chair: USENIX Security Symposium (SEC) 2026 Workshop chair: IEEE European Symposium on Security and Privacy (EuroS&P) 2024, 2025 PC chair: GI Sicherheit 2024 General and PC chair: GI Sicherheit 2022 PC chair: International Conference on Availability, Reliability, and Security 2020 Publication chair: EuroSec Workshop 2021 Publicity chair: EuroSec Workshop 2018, 2019, 2020 Web chair: Deep Learning and Security Workshop 2019 General chair: myPhD Workshop 2016 Program Committee Memberships IEEE Symposium on Security and Privacy (\"Oakland\") 2022, 2023, 2024, 2026 Network and Distributed System Security (NDSS) Symposium 2026 IEEE Conference on Secure and Trustworthy Machine Learning (SatML) 2023, 2024, 2025, 2026 USENIX Security Symposium (SEC) 2021, 2022, 2023, 2024, 2025 IEEE European Symposium on Security and Privacy (EuroS&P) 2024, 2025 Annual Computer Security Applications Conference (ACSAC) 2022, 2023, 2024, 2025 Workshop on Artificial Intelligence and Security (AISEC) 2021, 2022, 2023, 2024, 2025 ACM SIGSAC Conference on Computer and Communications Security (CCS) 2023, 2024 Deep Learning and Security Workshop (DLS) 2020, 2021, 2022, 2023, 2024 GI Sicherheit 2020, 2022, 2024 Conference on Detection of Intrusions and Malware & Vulnerability Assessment (DIMVA) 2021, 2022, 2023 European Workshop on Systems Security (EuroSec) 2019, 2020, 2021, 2022, 2023ACM Workshop on Robust Malware Analysis (WoRMA) 2022, 2023 The Web Conference (WWW; International World Wide Web Conference) 2020, 2021, 2022 International Conference on Availability, Reliability, and Security (ARES) 2020, 2021, 2022 ACM International Systems and Storage Conference (SYSTOR) 2022 International Conference on Applied Cryptography and Network Security (ACNS) 2021 International Conference on Internet Monitoring and Protection (ICIMP) 2020 NIPS Workshop \"Machine Learning Open Source Software\" 2018 IEEE Symposium on Security and Privacy (\"Oakland\") Student PC 2018 Artifact Evaluation Committee Memberships USENIX Security Symposium (SEC) 2020, 2021 Privacy Enhancing Technologies Symposium (PoPETs/PETS) 2020, 2021 USENIX Workshop on Offensive Technologies (WOOT) 2019 Annual Computer Security Applications Conference (ACSAC) 2017, 2018, 2019 Sub-Reviewing for Conferences & Workshops 2020: IEEE S&P, NDSS, SAC 2019: IEEE S&P, EuroS&P, USENIX Security, ACSAC, ECML/PKDD, RAID, SAC 2018: ACSAC, SAC, AsiaCCS, DIMVA, DLS 2017: ACSAC, AsiaCCS, DIMVA, AISEC 2016: ACSAC, EuroS&P, RAID, DIMVA, IFIP SEC, AISEC, ARES 2015: CCS, ACSAC, RAID, ESSoS, WWW, IFIP SEC, AISEC, ARES 2014: CCS, DIMVA, WOOT, EUROSEC, ICML/LSP, AISEC, ARES, SICHERHEIT 2013: DIMVA, AISEC, ARES 2012: DIMVA, AISEC, ARES Reviewing for Journals ACM Computing Surveys (CSUR) ACM Transactions on Privacy and Security (TOPS) IEEE Transactions on Dependable and Secure Computing (TDSC) IEEE Transactions on Information Forensics and Security (TIFS) IEEE Transactions on Software Engineering (TSE) IEEE Transactions on Parallel and Distributed Systems (TPDS) IEEE Transactions on Neural Networks and Learning Systems (TNNLS) EURASIP Journal on Information Security (JIS) Journal of Machine Learning Research: MLOSS Track (JMLR/MLOSS) Journal of Information Security and Applications (JISA) International Journal of Information Security (IJIS) Computers & Security (COSE) Computer Communications (COMCOM) Software I do love open-source software and I enjoy writing code as well which I glady make public. Some of the tools I've contributed to in the course of my research are: Harry, Sally and Salad",
  "content_length": 5842,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:24"
}