{
  "name": "Christoph Ruland",
  "homepage": "https://www.eti.uni-siegen.de/dcs/mitarbeiter/professoren/ruland/?lang=de",
  "status": "success",
  "content": "Univ.-Prof. Dr. rer. nat. Christoph Ruland | Lehrstuhl für Digitale KommunikationssystemeSkip to the navigation.Skip to the content. Fakultät IV Lehrstuhl für digitale KommunikationssystemeÜber unsMitarbeiterProfessorenChristoph RulandNatasa ZivicChristoph RulandNatasa ZivicWissenschaftliche MitarbeiterGastwissenschaftlerAsmaa TellabiEhemalige MitarbeiterLehreVeröffentlichungenArbeitenForschungProjektePräsentation des LehrstuhlsFlyer des LehrstuhlsPreisträger und AuszeichnungentestMailunisonoFormulareSucheWir verwenden Google für unsere Suche. Mit Klick auf diesen Button aktivieren Sie das Suchfenster und akzeptieren die Nutzungsbedingungen.Hinweise zum Einsatz der Google SucheErweiterte SuchePersonensuchezur unisono PersonensucheVeranstaltungssuchezur unisono VeranstaltungssucheKatalog plus  / dcs / mitarbeiter / professoren / ruland /  Univ.-Prof. Dr. rer. nat. Christoph Ruland Univ.-Prof. Dr. rer. nat. Karl Christoph Ruland christoph.ruland@uni-siegen.de S/MIME Zertifikat / Mein PGP-Key Lehrstuhl für Nachrichtentechnik, insbesondere Nachrichtenübermittlungstechnik Leiter des Lehrstuhls für Digitale Kommunikationssysteme „Kommissarischer Leiter des Lehrstuhls Communications Engineering & Security“ Telefon +49 (0) 271/ 740 - 2522 Telefax +49 (0) 271/ 740 - 2536 Raum H-E 206 Sekretariat Sabine Leukel Raum H-E 205 Tel.: +49 (0) 271/ 740 - 2521 Mail: sabine.leukel@uni-siegen.de . Mitarbeit in nationalen / internationalen Standardisierungsgremien: ISO/IEC JTC1 SC 27 WG 2 - Information Security, Cyber Security and Data Protection - Cryptographic Techniqus IEC TC 57 WG 15 - Power Systems Management and Associated Information Exchange - Data and Communication Security ISO/IEC JTC1 SC 42 WG 3 und WG 4 - Artificial Intelligence - Trustworthiness und Use Cases Sonstiges Fulbright-Vertrauensdozent Beruflicher Werdegang 1970 - 1973 Funkoffizier bei der Handelsschifffahrt (zeitweise) 1970 - 1974 Mathematik-/ Physik-/ Informatik-Studium an der Universität Bonn Stipendiat der Studienförderng Cusanuswerk 1974 Diplom in Mathematik 1974 - 1976 wissenschaftlicher Mitarbeiter an der mathematischen Fakultät der Universität Bonn 1976 Promotion zum Dr. rer. nat. mit einer Dissertation aus dem numerischen Bereich der Partiellen Differentialgleichungen 1976 - 1978 AEG - Telefunken, Konstanz, Geschäftsbereich Prozessrechner 1979 Tandem Computer, Hamburg 1980 - 1982 AEG - Telefunken, Konstanz, Geschäftsbereich Informatik 1982 - 1992 Professor für Datennetze und Datenfernübertragung, Fachhochschule Aachen 1988 Gründung der KryptoKom Gesellschaft für kryptographische Informationssicherheit und Kommunikationstechnologie mbH, Aachen 1988 - 1998 Geschäftsführer der KryptoKom, Aachen seit 1.9.1992 Universitätsprofessor für Nachrichtentechnik mit Schwerpunkt Nachrichtenübermittlungstechnik an der Universität Siegen, Naturwissenschaftlich-Technische Fakultät, Department Elektrotechnik und Informatik Publikationsliste Patente Patente und Zusammenfassungen der Patentfamilien von Professor Ruland [Link] Bücher Ein Verfahren zur Berechnung der Lösung des Dirichlet ́schen Außenraumproblems zur Helmholtz ́schen Schwingungsgleichung bei stückweise glatten Rändern (Dissertation), Bonner Mathematische Schriften Nr. 88, 1976. Datenschutz in Kommunikations-Systemen datacom Verlag, Pulheim 1987, ISBN 978-3-8923-8004-7. [Link] Informationssicherheit in Datennetzen datacom Verlag, Bergheim 1993, ISBN 978-3-8923-8081-8. [Link] Wissenschaftliches Kommunikations- und Sicherheitskolloquium 2009 Universität Siegen, Forschungsberichte des Instituts für Digitale Kommunikationssysteme, Band 25, Shaker-Verlag, ISBN 978-3-8322-8143-4. [Link] Herausgeber der Forschungsberichte des Instituts für Digitale Kommunikationssysteme der Universität Siegen, Band 1 - 28, Shaker (27 Dissertationen + Band 25, s.o.). 8th International ITG Conference on Source and Channel Coding (SCC ́10), January 18 – 21, 2010 in Siegen/Germany, ITG Fachbericht 219, Editors: Rudolf Mathar/Christoph Ruland. [Link] Buchbeiträge C. Ruland, J. Sassmannshausen, Non-repudiation Services for the MMS Protocol of IEC 61850, Security Standardisation Research, L. Chen and S. Matsuo (Eds.), vol. 9497, LNCS, pp. 70-85, Springer International Publishing, Switzerland, Dec 2015. [Link] J. Shin and C. Ruland: Perceptual Image Hashing Technique for Image Authentication in WMSNs, N. Zivic (Ed.): Robust Image Authentication in the Presence of Noise, pp. 75-104, Springer, New York, 2015, ISBN: 978-3-319-13156-6. [Link] R. Fay and C. Ruland: Robustness of Biometrics by Image Processing Technology, N. Zivic (Ed.): Robust Image Authentication in the Presence of Noise, pp. 155-187, Springer, New York, 2015, ISBN: 978-3-319-13156-6. [Link] C. Ruland: Secure Online Metering for a Liberalized Energy Market, in: Secure eGovernment Web Services, Chapter VI, Idea Group Publication, Hershey, PA, USA, Juli 2006, p. 97-110, ISBN: 1-59904-138-3. [Link] N. Oikonomidis, S. Tcaciuc, C. Ruland: Deployment of E-Government Municipal Services: Enforcement of Security Polices, in: Secure eGovernment Web Services, Chapter VII, Idea Group Publication, Hershey, PA, USA, Juli 2006. [Link] O. Jung, C. Ruland: Encryption with Statistical Self-Synchronization in Synchronous Broadband Networks, C. K. Koc and C. Paar (Eds.): Cryptographic Hardware and Embedded Systems, LNCS 1717, Springer-Verlag Berlin, pp. 340-352, 1999. [Link] O. Jung, S. Kuhn, C. Ruland, Kai Wollenweber: Enhanced Modes of Operation for the Encryption in High-Speed Networks and Their Impact on QoS, V. Varadharajan and Y. Mu (Eds.): Information Security and Privacy, LNCS 2119, pp. 344-359, 2001. [Link] N. Oikonomidis, S. Tcaciuc, C. Ruland: An Architecture for Secure Policy Enforcement in E-Government Services Deployment, J. Dittmann, S. Katzenbeisser, and A. Uhl (Eds.): Communications and Multimedia Security, LNCS 3677, pp. 284-285. [Link] K. Hong, S. Jung, L. L. Iacono, Christoph Ruland: Impacts of Security Protocols on Real-Time Multimedia Communications, C. H. Lim and M. Yung (Eds): Information Security Applications, LNCS 3325, pp. 1-13, 2004. [Link] Schriften 2024 Yatagha, R., Nebebem B., Waedt. K., Ruland, C.: Towards a Zero-Day Anomaly Detector in Cyber Physical Systems Using a Hybrid VAE-LSTM-OCSVM Model CIKM '24: Proceedings of the 33rd ACM International Conference on Information and Knowledge Management Pages 5038 – 5045. Mejri, O., Waedt, K., Yatagha, R., Ruland, C., Zeddini, O.: Using Knowledge Representation to achieve reliable and trustworthy AI in Sensitive Infrastructure 8th International Symposium on Future Instrumentation and Control for Nuclear Power Plants, (ISOFIC 2024), December, 2024, Jeju, Korea C. Ruland et. Alt.: A Comparative Study on the Disparities and Performance Metrics between NoSQL Graph and Relational Databases, International Conference on Electrical and Computer Engineering Researches (ICECER), 4.-6- December, Gaborone, Botswana C. Ruland: ML-based Synthetic OPC UA Traffic Generation For Covert Channel Transmission, International Conference on Electrical and Computer Engineering Researches (ICECER), 4.-6- December, Gaborone, Botswana 2022 Catovic, E. Kadusic, N. Zivic, N. Hadzajlic, C. Ruland: AIR POLLUTION PREDICTION AND WARNING SYSTEM USING IOT AND MACHINE LEARNING, 2022 International Conference on Electrical, Computer, Communications and Mechatronics Engineering (ICECCME), 16-18 November 2022, Maldives, Maldives, Publisher: IEEE - DOI: 10.1109/ICECCME55909.2022.9987957 E. Kadusic, N. Hadzajlic, C. Ruland, N. Zivic: THE FACTORS FOR CHOOSING AMONG NB-IOT, LORAWAN, AND SIGFOX RADIO COMMUNICATION TECHNOLOGIES FOR IOT NETWORKING, 2022 International Conference on Connected Systems & Intelligence (CSI), 31 August 2022 - 02 September 2022, Trivandrum, India, Publisher: IEEE - DOI: 10.1109/CSI54720.2022.9923999 E. Kadusic, N. Zivic, N. Hadzajlic, C. Ruland: THE TRANSITIONAL PHASE OF BOOST.ASIO AND POCO C++ NETWORKING LIBRARIES TOWARDS IPV6 AND IOT NETWORKING SECURITY, 2022 IEEE International Conference on Smart Internet of Things (SmartIoT), 19-21 August 2022, Suzhou, China, Publisher: IEEE - DOI: 10.1109/SmartIoT55134.2022.00022 E. Kadusic, N. Zivic, N. Hadzajlic, C. Ruland: A SMART PARKING SOLUTION BY INTEGRATING NB-IOT RADIO COMMUNICATION TECHNOLOGY INTO THE CORE IOT PLATFORM, Future Internet 2022, 14(8), 219; https://doi.org/10.3390/fi14080219, Published: 25 July 2022. 2020 C. Ruland (Hrsg): Jochen Saßmannshausen: Attribute-based access control for smart grids and industrial automation and control systems. In: Forschungsberichte / Universität Siegen, Institut für Digitale Kommunikationssysteme Band 40. Düren: Shaker Verlag, 2020. -  ISBN 978-3-8440-7507-6 2019 E. Kadusic, N. Zivic, A. Masovic, C. Ruland: “Implementation of MQTT Native Application for Tizen-based Smartwatches”, 6th Annual Conference on Computational Science and Computational Intelligence, December 5-7, Las Vegas, Nevada, USA A. Tellabi, M. Parekh, C. Ruland, M. Ezziyyani , “A case study of virtualization used in Mixed Criticality Systems,” Advanced Intelligent Systems for Sustainable Development (AI2SD), Marrakech, Morocco, 2019 J. Fehmi, A. Tellabi, S. AbdelBast, C. Ruland, “On the Analysis of the Impact of Scheduling Plans in Safety Critical Requirements in Virtualization,” International Conference on Cybersecurity (ICOCSec), Malaysia, 2019 A. Tellabi, C. Ruland, K. Waedt, A. Sabri, “Self-Diagnostics and Isolation mechanisms for Mixed Criticality Systems,”. In Journal of Communications Software and Systems (JCOMSS), 2019. DOI: http://dx.doi.org/10.24138/jcomss.v15i4.810 A. Tellabi, C. Ruland, \"Empirical Study of Real-Time Hypervisors for Industrial Systems,\" 2019 International Conference on Computational Science and Computational Intelligence (CSCI), 2019, pp. 208-213, doi: 10.1109/CSCI49370.2019.00042 N. Zivic, C. Ruland and O. Ur-Rehman, \"Addressing Byzantine Fault Tolerance in Blockchain Technology,\" 2019 8th International Conference on Modeling Simulation and Applied Optimiza",
  "content_length": 45544,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:52"
}