{
  "name": "Christian Dondrup",
  "homepage": "https://researchportal.hw.ac.uk/en/persons/christian-dondrup",
  "status": "success",
  "content": "Christian Dondrup - Heriot-Watt Research Portal View Scopus Profile Christian Dondrup Dr, Mr Associate Professor, School of Mathematical & Computer SciencesAssociate Professor, School of Mathematical & Computer Sciences, Computer Science EmailC.Dondruphw.acuk EH14 4ASUnited Kingdom 20142025 Research activity per year Fingerprint Dive into the research topics where Christian Dondrup is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles robots INIS 100% humans INIS 57% interactions INIS 44% Robot Computer Science 37% Human Robot Interaction Computer Science 33% environment INIS 21% Artificial Intelligence Computer Science 20% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2014 2017 2020 2021 2023 2024 2025 27 Conference contribution 5 Article 4 Chapter (peer-reviewed) 3 Paper Research output per year Research output per year Multimodal Engagement Prediction in Human-Robot Interaction Using Transformer Neural NetworksLim, J. Y., See, J. & Dondrup, C., 1 Jan 2025, MultiMedia Modeling. MMM 2025. Springer, p. 3-17 15 p. (Lecture Notes in Computer Science; vol. 15524).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution prediction 100% interactions 100% neural networks 100% robots 100% transformers 100% Socially Pertinent Robots in Gerontological HealthcareAlameda-Pineda, X., Addlesee, A., García, D. H., Reinke, C., Arias, S., Arrigoni, F., Auternaud, A., Blavette, L., Beyan, C., Camara, L. G., Cohen, O., Conti, A., Dacunha, S., Dondrup, C., Ellinson, Y., Ferro, F., Gannot, S., Gras, F., Gunson, N. & Horaud, R. & 24 others, D'Incà, M., Kimouche, I., Lemaignan, S., Lemon, O., Liotard, C., Marchionni, L., Moradi, M., Pajdla, T., Pino, M., Polic, M., Py, M., Rado, A., Ren, B., Ricci, E., Rigaud, A.-S., Rota, P., Romeo, M., Sebe, N., Sieińska, W., Tandeitnik, P., Tonini, F., Turro, N., Wintz, T. & Yu, Y., 1 Nov 2025, (E-pub ahead of print) In: International Journal of Social Robotics.Research output: Contribution to journal › Article › peer-review Open Access Robot 100% robots 100% Software Architecture 50% Conversational Interaction 50% Humanoid Robots 50% 25 Downloads (Pure) A Holistic Evaluation Methodology for Multi-Party Spoken Conversational AgentsGunson, N., Addlesee, A., Hernandez Garcia, D., Romeo, M., Dondrup, C. & Lemon, O., 26 Dec 2024, IVA '24: Proceedings of the 24th ACM International Conference on Intelligent Virtual Agents. Association for Computing Machinery, 24Research output: Chapter in Book/Report/Conference proceeding › Chapter (peer-reviewed) › peer-review Open AccessFile Conversational Agent 100% Evaluation Methodology 100% evaluation 100% performance 66% Systems Performance 50% 62 Downloads (Pure) A Learning-based Co-Speech Gesture Generation System for Social RobotsLi, X. & Dondrup, C., 24 Nov 2024, HAI '24: Proceedings of the 12th International Conference on Human-Agent Interaction. Association for Computing Machinery, p. 453-455 3 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Driven Approach 100% Social Robot 100% Generation System 100% learning 100% robots 100% A Multi-party Conversational Social Robot Using LLMsAddlesee, A., Cherakara, N., Nelson, N., García, D. H., Gunson, N., Sieińska, W., Romeo, M., Dondrup, C. & Lemon, O., 11 Mar 2024, HRI '24: Companion of the 2024 ACM/IEEE International Conference on Human-Robot Interaction. Association for Computing Machinery, p. 1273-1275 3 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open Access robots 100% Social Robot 100% Large Language Model 100% patients 50% humans 50% 17 Citations (Scopus) View all 39 research outputs Prizes Best HRI StudyDondrup, C. (Recipient), 2016Prize: Prize (including medals and awards) prices 100% conferences 100% tracks 100% Price 100% RO-MAN 2023 - Honourable Mention as a Finalist in the KROS Interdisciplinary Research Award in Social Human-Robot Interaction (2023)Moujahid, M. (Recipient), Robb, D. (Recipient), Dondrup, C. (Recipient) & Hastie, H. (Recipient), 31 Aug 2023Prize: Prize (including medals and awards) File interactions 100% humans 100% robots 100% awards 100% Interdisciplinary Research 100% Spirit of Heriot-Watt Awards 2017, Outward LookingLane, D. M. (Recipient), Lohan, K. S. (Recipient), Vargas, P. A. (Recipient), Hastie, H. (Recipient), Broz, F. (Recipient), Vijayakumar, S. (Recipient), Hermann, M. (Recipient), Foster, M. E. (Recipient), Hauert, S. (Recipient), Couceiro, M. S. (Recipient), Baillie, L. (Recipient), Erden, M. S. (Recipient), McEwen, I. J. (Recipient), McConnell, A. C. (Recipient), Goodfellow, R. (Recipient), Dragone, M. (Recipient), Mastrogiovanni, F. (Recipient), Dondrup, C. (Recipient), Lim, M. Y. (Recipient), Murphy, S. A. (Recipient), Vallejo, M. (Recipient), Duncan, S. (Recipient) & Hassan, M. K. A. (Recipient), 1 Jul 2017Prize: Prize (including medals and awards) awards 100% Alcoholic Beverages 100% organizing 33% Press/Media Native Scientist 2017Lohan, K. S., Dondrup, C. & Saemann, C.4/11/171 Media contributionPress/Media: Research BBC 2 TimelineLohan, K. S. & Dondrup, C.28/09/171 Media contributionPress/Media: Research",
  "content_length": 5618,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:02"
}