{
  "name": "Christopher A. Metzler",
  "homepage": "https://www.cs.umd.edu/users/metzler",
  "status": "success",
  "content": "Christopher Metzler Assistant Professor of Computer Science University of Maryland Linkedin Graduation-cap Biography Chris is an Assistant Professor in the Department of Computer Science at UMD, where he leads the UMD Intelligent Sensing Laboratory. He is a member of UMIACS and has a courtesy appointment in the Electrical and Computer Engineering Department. His research develops new systems and algorithms for solving problems in computational imaging and sensing, machine learning, and wireless communications. His work has received multiple best paper awards; he recently received NSF CAREER, AFOSR Young Investigator Program, and ARO Early Career Program awards; and he was an Intelligence Community Postdoctoral Research Fellow, an NSF Graduate Research Fellow, a DoD NDSEG Fellow, and a NASA Texas Space Grant Consortium Fellow. Prospective Students: Students interested in working with me should apply to the UMD CS PhD program and mention my name in their research statement. I'm especially interested in working with students who want to apply machine learning to real-world optical and RF hardware. Prospective Postdocs: My group is recruiting postdocs for research in applied optics and machine learning. Contact me if you are interested in a potential position. Contact: metzler at umd.edu. Download my CV. Interests Experience & Education Computational Imaging Machine Learning Statistical Signal Processing Â Assistant Professor, Computer Science, 2021University of Maryland PostDoc, Electrical Engineering, 2020Stanford University PhD, Electrical and Computer Engineering, 2019Rice University MS, Electrical and Computer Engineering, 2014Rice University BS, Electrical and Computer Engineering, 2013Rice University Select Publications Fourier ptychographic microscopy image stack reconstruction using implicit neural representations H. Zhou, B. Feng, H. Guo, S. Lin, M. Liang, C. Metzler, and C. Yang Optica 2023. NeuWS: Neural wavefront shaping for guidestar-free imaging through static and dynamic scattering media B. Feng, H. Guo, M. Xie, V. Boominathan, M. Sharma, A. Veeraraghavan, and C. Metzler. Science Advances 2023. TurbuGAN: An Adversarial Learning Approach to Spatially-Varying Multiframe Blind Deconvolution with Applications to Imaging Through Turbulence B. Feng, M. Xie, and C. Metzler. IEEE Journal on Selected Areas in Information Theory 2023. Transformers for Robust Radar Waveform Classification M. Ziemann and C. Metzler. Asilomar 2022. Denoising generalized expectation-consistent approximation for MR image recovery S. Shastri, R. Ahmad, C. Metzler, and P. Schniter IEEE Journal on Selected Areas in Information Theory 2022. D-VDAMP: Denoising-Based Approximate Message Passing for Compressive MRI C. Metzler and G. Wetzstein. ICASSP 2021. Depth from Defocus with Learned Optics for Imaging and Occlusion-aware Depth Estimation H. Ikoma, C. Nguyen, C. Metzler, Y. Peng, G. Wetzstein. ICCP 2021. Keyhole Imaging: Non-Line-of-Sight Imaging and Tracking of Moving Objects Along a Single Optical Path C. Metzler, D. Lindell, G. Wetzstein. IEEE Transactions on Computational Imaging 2021. Deep Learning Techniques for Inverse Problems in Imaging G. Ongie, A. Jalal, C. Metzler, R. Baraniuk, A. Dimakis, R. Willett. IEEE Journal on Selected Areas in Information Theory 2020. Deep-inverse Correlography: Towards Real-Time High-Resolution Non-Line-of-Sight Imaging C. Metzler, F. Heide, P. Rangarajan, M. Balaji, A. Viswanath, A. Veeraraghavan, and R. Baraniuk. Optica 2020. Deep Optics for Single-shot High-dynamic-range Imaging C. Metzler, H. Ikoma, Y. Peng, and G. Wetzstein. CVPR 2020 (Oral). Disambiguating monocular depth estimation with a single transient M. Nishimura, D. Lindell, C. Metzler, and G. Wetzstein. ECCV 2020. Inverse scattering via transmission matrices: Broadband illumination and fast phase retrieval algorithms M. Sharma*, C. Metzler*, S. Nagesh, R. Baraniuk, O. Cossairt, A. Veeraraghavan. IEEE Transactions on Computational Imaging 2019. prDeep: Robust Phase Retrieval with a Flexible Deep Network C. Metzler, P. Schniter, A. Veeraraghavan, R. Baraniuk. ICML 2019. Unsupervised learning with Stein's unbiased risk estimator C. Metzler, A. Mousavi, R. Heckel, R. Baraniuk. BASP Frontiers (Best Contribution Award) 2019. Imaging through extreme scattering in extended dynamic media D. Gardner, A. Kanaev, A. Watnik, C. Metzler, K. Judd, P. Lebow, K. Novak, J. Lindle. Optics Letters (NRL Alan Berman Research Publication Award) 2018. Coherent inverse scattering via transmission matrices: Efficient phase retrieval algorithms and a public dataset C. Metzler*, M. Sharma*, S. Nagesh, R. Baraniuk, O. Cossairt, A. Veeraraghavan. ICCP (Honorable Mention Award) 2017. Learned D-AMP: Principled Neural Network Based Compressive Image Recovery C Metzler, A Mousavi, R Baraniuk. NeurIPS 2017. From denoising to compressed sensing C Metzler, A Maleki, R Baraniuk. IEEE Transactions on Information Theory 2016. Press A Single Laser Fired Through a Keyhole Can Expose Everything Inside a Room Gizmodo, September 2021. Seeing Around Corners with Lasers—and Speckle IEEE Spectrum, January 2020. Also Times of London and The Telegraph. Software and Datasets Neural Wavefront Shaping: Code and data demonstrating neural wavefront shaping through scattering media. Learned D-AMP, D-AMP, & D-prGAMP Toolbox: Neural networks and algorithms for compressive sensing and compressive phase retrieval. Includes code to train with SURE loss, instead of MSE. Keyhole Imaging: Code and data demonstrating non-line-of-sight imaging along a single optical path. D-VDAMP: Variable-density sampled compressive MRI reconstruction code. Transmission Matrix Dataset: A public dataset for testing phase retrieval algorithms. Deep Simultaneous Source Separation and Phase Retrieval: Code to solve S3PR using deep generative models. Deep-Inverse Correlography: Neural networks for imaging around corners using phase retrieval. Deep Optics for Single-shot HDR: Code and data demonstrating single-shot HDR with learned optics. Depth from Defocus with Learned Optics: Code and data demonstrating monocular depth estimation with learned optics. prDeep: A neural-network-based noise-robust phase retreival algorithm.",
  "content_length": 6232,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:02"
}