{
  "name": "Christian Frisson",
  "homepage": "https://profiles.ucalgary.ca/christian-frisson",
  "status": "success",
  "content": "Christian Frisson | UCalgary Profiles | University of Calgary Skip to main content Christian Frisson PhD Pronouns: he/him/his Are you the profile owner? Login to edit. Positions Assistant Professor Faculty of Science, Department of Computer Science Contact information Email christian.frisson@ucalgary.ca Web presence Shivers Group Interactions Lab For media enquiries, contact christian.frisson@ucalgary.ca Preferred method of communication christian.frisson@ucalgary.ca Background Educational Background PhD (Engineering: Human-Computer Interaction, Multimedia), University of Mons, numediart Institute, Belgium, 2015 MSc (Art, Science, Technology), Grenoble INP (Institut National Polytechnique), France, 2006 MEng (Acoustics, Metrology), ENSIM (Ecole d’Ingénieurs Le Mans Université), France, 2005 Biography Christian Frisson is an assistant professor at the University of Calgary with the Interactions Lab leading the Shivers Group (2025-present). Christian has industry experience as Senior R&D Engineer at Ansys (part of Synopsys), Fluids Business Unit (2023-2025), and as Researcher/Developer at the Society for Arts and Technology (SAT), Metalab (2021-2023). Christian was postdoctoral researcher: 1) at McGill University with the Input Devices and Music Interaction Lab (IDMIL) funded by his Mitacs Elevate fellowship with Haply including a collaboration with the National Research Council Canada (NRC) on optimizing open-source haptic systems (2019-2020), 2) at the University of Calgary with the Interactions Lab collaborating with the Canada Energy Regulator (CER) and VizworX on designing energy data visualizations (2017-2018) and 3) at Inria in France with the Mjolnir team collaborating on a European Horizon 2020 project including with the French Alternative Energies and Atomic Energy Commission (CEA) on designing interaction for printed haptic surfaces (2016-2017). Christian obtained his PhD at the University of Mons, numediart Institute, in Belgium (2015); and his Master in Science in “Art, Science, Technology” from Institut National Polytechnique de Grenoble with the Association for the Creation and Research on Expression Tools (ACROE), in France (2006), and his Master in Engineering in Acoustics and Metrology from Ecole d'Ingénieurs - Le Mans Université (ENSIM), in France (2005). Research Areas of Research Haptics Robotics for Human-Computer Interaction Human-Computer Interaction Information Visualization Immersive Arts Participation in university strategic initiatives Human Dynamics in a Changing World (2015-2021) Transdisciplinary Research Digital Worlds Courses Course number Course title Semester CPSC 481 Human-Computer Interaction I Winter 2026 CPSC 573 Visualization and Analytics Winter 2026 Publications Google Scholar Are you the profile owner? Login to edit.",
  "content_length": 2807,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:02"
}