{
  "name": "Christos Kotselidis",
  "homepage": "https://www.research.manchester.ac.uk/portal/christos.kotselidis.html",
  "status": "success",
  "content": "Christos-Efthymios Kotselidis - Research Explorer The University of Manchester Christos-Efthymios Kotselidis Dr Reader in Computer Science, Advanced Processor Technology https://orcid.org/0000-0002-8146-3503 Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research Beacons, Institutes and PlatformsDigital Futures Fingerprint Dive into the research topics where Christos-Efthymios Kotselidis is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 8 Similar Profiles runtime system Computer Science 100% OpenCL Computer Science 86% Virtual Machine Computer Science 71% Runtime Environment Computer Science 64% Hardware Accelerator Computer Science 63% Transactional Memory Computer Science 60% Energy Efficiency Computer Science 49% Big Data Computer Science 48% View full fingerprint Research output 23 Conference contribution 21 Paper 5 Article 1 Book 1 More 1 Abstract Research output per year Research output per year Dynamic and Static Code Analysis for Java Programs on Heterogeneous HardwareStratikopoulos, A., Zuo, T., Harbalioglu, U. S., Fumero Alfonso, J., Papadimitriou, M., Papadakis, O., Xekalaki, M. & Kotselidis, C.-E., 14 Oct 2025.Research output: Contribution to conference › Paper › peer-review Dynamic Code Analysis 100% Static Code Analysis 100% Managed Memory 50% Leveraging RISC-V Vectorization: Accelerating Java Programs with TornadoVM and OCKFumero Alfonso, J., Stratikopoulos, A., Davidson, C., van Dijk, H., Dolinsky, U., Papadimitriou, M., Xekalaki, M. & Kotselidis, C.-E., 12 May 2025, (Accepted/In press) p. 1-2. 2 p.Research output: Contribution to conference › Paper › peer-review Open AccessFile Vectorization 100% OpenCL 100% Open Source 50% Programming Framework 50% Java Application 50% 256 Downloads (Pure) Offloading Key Switching on GPUs: A Path towards Seamless Acceleration of FHEPapadakis, O., Papadimitriou, M., Stratikopoulos, A., Xekalaki, M., Fumero Alfonso, J. & Kotselidis, C.-E., 7 Apr 2025, (Accepted/In press). 6 p.Research output: Contribution to conference › Paper › peer-review Open AccessFile Privacy Preserving Machine Learning 100% 92 Downloads (Pure) TornadoViz: Visualizing Heterogeneous Execution Patterns in Modern Managed Runtime SystemsPapadimitriou, M., Xekalaki, M., Stratikopoulos, A., Papadakis, O., Fumero Alfonso, J. & Kotselidis, C.-E., 14 Oct 2025, MPLR '25: : Proceedings of the 22nd ACM SIGPLAN International Conference on Managed Programming Languages and Runtimes. Association for Computing Machinery, p. 31-37 6 p.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open Access Bytecode 100% Runtime Systems 100% Heterogeneous Computation 66% Interactive 66% Dashboards 33% Programming Heterogeneous Hardware via Managed Runtime SystemsFumero Alfonso, J., Stratikopoulos, A. & Kotselidis, C.-E., 11 Apr 2024, Springer Nature. (SpringerBriefs in Computer Science)Research output: Book/Report › Book Runtime Environment 100% runtime system 100% Machine Learning 50% Affect Performance 50% Artificial Intelligence 50% View all 51 research outputs Projects 1 Active Projects per year Centre for Digital Trust and SocietyBarrett, E. (PI), Allmendinger, R. (Researcher), Elliot, M. (Researcher), Lord, N. (Researcher), Cordeiro, L. (Researcher), Gibson, R. (Researcher), Papamarkou, T. (Researcher), Dresner, D. (Researcher), Aldridge, J. (Researcher), Duncan, P. (Researcher), Banach, R. (Researcher), Brown, G. (Researcher), Dennis, L. (Researcher), Fisher, M. (Researcher), Korovin, K. (Researcher), Kotselidis, C.-E. (Researcher), Luján, M. (Researcher), Mustafa, M. (Researcher), Olivier, P. (Researcher), Reger, G. (Researcher), Zhang, N. (Researcher), Hodgkinson, G. (Researcher), Gulati, S. (Researcher), Ainsworth, J. (Researcher), Chen, Y.-W. (Researcher), Green, B. (Researcher), Healey, M. (Researcher), Uyarra, E. (Researcher), Zachariadis, M. (Researcher), Little, C. (Researcher), Mackey, E. (Researcher), Nenadic, G. (Researcher), Keane, J. (Researcher), Shlomo, N. (Researcher), Graff, N. (Researcher), Jarwar, M. A. (Researcher), Shariati Samani, S. (Researcher), Smith, D. (Researcher), Kambites, M. (Researcher), Thorpe, M. (Researcher), Rowley, P. (Researcher), Flynn, S. (Researcher), Turner, P. (Researcher), Wainwright, V. (Researcher), Czerwinsky, A. (PGR student), Nini, A. (Researcher), Broad, R. (Researcher), Shute, J. (Researcher), Deakin, J. (Researcher), Taboada, P. (PGR student), Knight, P. (Researcher), Hutchings, S. (Researcher), Whyte, J. (Researcher), Tolz-Zilitinkevic, V. (Researcher), Pilkington, H. (Researcher), Guharoy, S. (Researcher), Nicolo, A. (Researcher), Reggiani, C. (Researcher), Garcia Oliva, J. (Researcher), Van Someren, A. (Researcher), Bon, E. (Researcher), Cantijoch Cunill, M. (Researcher), Koch, D. (Researcher) & Chen, Y.-W. (Researcher)11/05/21 → …Project: Other Social Statistics 100% Computer Science 100% Interdisciplinary Research 100% Social Research 100% Business School 100% Prizes Best Paper AwardRodchenko, A. (Recipient), Pop, A. (Recipient), Nisbet, A. (Recipient), Kotseldis, C.-E. (Recipient) & Lujan, M. (Recipient), 2017Prize: Prize (including medals and awards) Datasets Datasets for TACO - JIT Compilation on ARMHartley, T. (Creator), Zakkak, F. S. (Contributor), Nisbet, A. (Contributor), Kotselidis, C. (Contributor) & Luján, M. (Contributor), University of Manchester Figshare, 26 Jul 2022DOI: 10.48420/20372304.v1, https://figshare.manchester.ac.uk/articles/dataset/Datasets_for_TACO_-_JIT_Compilation_on_ARM/20372304/1Dataset Thesis Exploiting Distributed Software Transactional MemoryKotselidis, C.-E. (Author), Kirkham, C. (Supervisor) & Furber, S. (Supervisor), 30 May 2011Student thesis: Phd File",
  "content_length": 5983,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:41"
}