{
  "name": "Chris Preist",
  "homepage": "https://research-information.bris.ac.uk/en/persons/chris-w-preist",
  "status": "success",
  "content": "Chris W Preist - University of Bristol View Scopus Profile Professor Chris W Preist BSc, MSc Professor of Sustainability & Computer Systems, School of Computer ScienceBristol Poverty InstituteCabot Institute for the EnvironmentSystems Centre https://orcid.org/0000-0002-5094-5294 EmailChris.Preistbristol.acuk BS8 1UHBS8 1SSUnited Kingdom Personal profile Research interestsThe main focus of my research currently is on the following: Environmental impact of digital technology, and more broadly consumer electronic goods. Particularly the understanding of user behaviour and how this affects such impacts. The role of interface design on influencing user behaviour with regard to environmental impacts.Life Cycle Assessment techniques applied to end-to-end digital products and services. Representation of uncertainty within such analyses, particularly with regard to user choices and behaviour in the system.The integration of life cycle analysis and carbon footprinting techniques into broader systemic models of sustainability impact.Agent-based simulation of socio-economic systems, particularly those with environmental implications, (For example, tragedy-of-the-commons problems) and exploration of the impact of alternative social and economic interventions in such systems.The role of computer technology within the wider socio-technical systems emerging to address climate change and other sustainability issues.The interplay between technology innovation, business models and sustainability impacts, particularly in the digital media sector. My secondary interests are: Education for Sustainable Development pedagogies and practices in Higher Education.The application of digital technology (particularly social computing and mobile technology) to engage communities around environmental and social sustainability.The role of gamification techniques and social norm theories in such engagement (and, more broadly, in crowdsourcing and citizen science), and the analysis of the interaction between competitive and contributional motivations of participants. Research Groups and ThemesInternational DevelopmentCabot Institute City Futures ResearchCabot Institute Low Carbon Energy ResearchBristol Interaction Group Fingerprint Dive into the research topics where Chris W Preist is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Energy Engineering Engineering 100% Energy Consumption Computer Science 68% Life Cycle Assessment Engineering 51% UK Social Sciences 50% Greenhouse Gas Engineering 47% Digital Service Computer Science 47% Retro-Fitting Engineering 45% Environmental Impact Engineering 42% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 32 Conference Contribution (Conference Proceeding) 17 Article (Academic Journal) 6 Conference Paper 4 Commissioned report 9 More 3 Chapter in a book 1 Other report 1 Conference Poster 1 Comment/debate (Academic Journal) 1 Artefact 1 Other contribution 1 Discussion paper Research output per year Research output per year Using Crowdsourcing to Support Pro-Environmental Community ActivismMassung, E., Coyle, D., Cater, K. F., Jay, M. & Preist, C. W., 27 Apr 2013, Proceedings of the SIGCHI conference on Human Factors in Computing Systems 2013. Association for Computing Machinery (ACM), p. 371-380 10 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Human-Computer Interaction 100% Motivational Factor 100% Financial Incentive 100% Environmental Data 100% Intrinsic Motivation 100% 137 Citations (Scopus) Normification: Using Crowdsourced Data to Affect Third-Party ChangeMassung, E. & Preist, C. W., 27 Apr 2013, Proceeding CHI EA '13 CHI '13 Extended Abstracts on Human Factors in Computing Systems. New York: Association for Computing Machinery (ACM), p. 1449-1454 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) File Community Support 100% Collected Data 100% Theoretical Framework 100% Smartphone Application 100% Social Norms 100% 1 Citation (Scopus) 480 Downloads (Pure) Modeling and Assessing Variability in Energy Consumption During the Use Stage of Online Multimedia ServicesSchien, D., Shabajee, P., Yearworth, M. & Preist, C., 8 Nov 2013, In: Journal of Industrial Ecology. 17, 6, p. 800-813Research output: Contribution to journal › Article (Academic Journal) › peer-review Open AccessFile Multimedia Service 100% Access Network 100% Energy Consumption 100% Mobile Network 66% Data Center 66% 46 Citations (Scopus) 365 Downloads (Pure) View all 68 research outputs Projects 1 Active 13 Finished Projects per year Digital Green DoorsPreist, C. W. (Principal Investigator)1/02/13 → 1/02/15Project: Research Qualitative Interview 100% Systematic Review 100% Social Norms 100% Citizen Science 100% Competitive Strategy 50% Digital Epiphanies Final (UCL Project Lead)Preist, C. W. (Principal Investigator)1/02/13 → 1/10/14Project: Research Digitization 100% Work-Family Conflict 100% Digital 50% Affordances 50% CenSoF: ESRC Centre for Sociodigital FuturesHalford, S. (Principal Investigator), Southerton, D. (Co-Investigator), Manchester, H. (Co-Investigator), Evans, D. M. (Co-Investigator), Watson, D. L. (Co-Investigator), Anderson, B. (Co-Investigator), Cater, K. F. (Co-Investigator), Carver, N. (Co-Investigator), Clarke, P. H. (Co-Investigator), Dermott, E. (Co-Investigator), Facer, K. (Co-Investigator), Hauert, S. (Co-Investigator), Liu, W. (Co-Investigator), Liveley, G. (Co-Investigator), McQuillan, D. (Co-Investigator), O'Kane, A. A. (Co-Investigator), Owen, R. (Co-Investigator), Parker, M. (Co-Investigator), Preist, C. W. (Co-Investigator), Schien, D. (Co-Investigator), Sriprakash, A. (Co-Investigator), Milivojevic, S. (Co-Investigator), Hussain, R. (Co-Investigator), Gutierrez Lopez, M. (Researcher), Cheilan, L. (Researcher), Thomas, L. M. (Researcher), Van Isacker, T. (Researcher), Valladares Celis, C. (Researcher), Atkins, E. (Student), Knight, E. W. (Student), Pykett, J. (Co-Investigator), Pitts, H. (Co-Investigator), Williamson, B. (Co-Investigator), Lagedamont, M. (Co-Investigator), Dowse, M. (Researcher), Brand, J. F. (Student), James, R. (Student), Okafo, D. (Student), Horsley, N. (Researcher), Jansen, A. H. (Administrator), Stevenson, T. P. (Other ), Hill, J. M. (Manager), Abu-Aisheh, R. (Researcher), Bo, H. (Researcher), Hemming, R. (Researcher), Huang, L. (Researcher) & Ward, K. J. (Other )1/05/22 → 30/04/27Project: Research, Parent Sociology 100% Justice 100% Social Practice 100% Temporal 100% Climate Change 83% View all 14 projects Datasets Supplementary Data to \"Designing with Digital Waste in Mind: A Typological Analysis to support Sustainable Interaction Design of Digital Services\"Preist, C. (Creator), Widdicks, K. (Creator), Hazas, M. (Creator), Remy, C. (Creator), Rivera, M. B. (Creator), Rigby, J. M. (Creator), Shabajee, P. (Creator) & Schien, D. (Creator), Zenodo, 2023DOI: 10.5281/zenodo.8385852, https://zenodo.org/record/8385852Dataset",
  "content_length": 7429,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:46"
}