{
  "name": "Christof van Nimwegen",
  "homepage": "https://www.uu.nl/medewerkers/CvanNimwegen",
  "status": "success",
  "content": "Dr. C. (Christof) van Nimwegen - Universiteit Utrecht search English Bewerken search EN Dr. C. (Christof) van Nimwegen Universitair hoofddocent Bètawetenschappen Informatica Interaction Human-Centered Computing Human-Centered Computing 030 253 7443 c.vannimwegen@uu.nl Buys Ballotgebouw Princetonplein 5 Kamer 4.18 3584 CC Utrecht Dr. C. (Christof) van Nimwegen Universitair hoofddocent Human-Centered Computing 030 253 7443 c.vannimwegen@uu.nl Profiel Publicaties Activiteiten Onderzoek Onderwijs Contact Profiel Publicaties Activiteiten Onderzoek Onderwijs Contact Vaardigheden Spaans Duits Engels Christof has a background in Interaction Design, Human Computer Interaction and Cognitive Ergonomics, in which he holds a master degree from Utrecht University. After that he worked as a usability engineer in industry in the Netherlands and abroad, until he enrolled his Ph.D. project at the faculty of Science at the Department Information and Computing Sciences of Utrecht University (2003â2008). Thereafter, until 2010 he worked as a Senior Researcher at the Centre for User Experience Research (now Mintlab), Catholic University of Leuven, Belgium. Since 2010 Christof has position at the Interaction group of the Faculty of Science, Utrecht University (Associate Professor since 2024). His interests are HCI and representations in interfaces in general, novel interfaces, safety-critical HCI, and Ephemerality in (social) media. During the recent years he focused on Dark Patterns, how they are perceived, their effects, and  Dark pattern Blindness in particular. Footer menu (NL) Direct naar Een studie kiezen Studenteninformatie Onderzoeksgebieden Vacatures Doneren Diensten Studentenportal Alumni-portal Intranet voor medewerkers Cursusplanner My Timetable Over de UU Contact Plattegrond Adresboek Disclaimer",
  "content_length": 1818,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:41"
}