{
  "name": "Christopher Thomas Freeman",
  "homepage": "https://www.ecs.soton.ac.uk/people/ctf1",
  "status": "success",
  "content": "Professor Chris Freeman | University of Southampton Skip to main content Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Subjects PhDs and research degrees Create your own research project Find a PhD project Funding your research degree How to apply for a PhD or research degree How to make a PhD enquiry Support while studying your PhD or research degree Exchanges and studying abroad Undergraduate study Undergraduate degree courses Foundation year programmes Undergraduate tuition fees Customise your degree Funding undergraduate studies How to apply Application advice and resources - Tuition fees, funding and scholarships - - Short courses - - Lunchtime evening and weekend courses - - Clearing - - Summer schools - - Get a prospectus Student life Accommodation Choose your halls of residence Your accommodation options Apply for accommodation Our accommodation guarantee Fees and contracts Our cities Southampton Winchester Malaysia Sports and gyms Sports facilities Sports clubs Watersports centres Our campuses Avenue Campus Boldrewood Innovation Campus City Centre Campus Highfield Campus University Hospital Southampton Waterfront Campus Winchester Campus Join our student community What's on Clubs and societies Sports teams SUSU places Representing you SUSU support and advice Support and money Living costs Academic and mental health support Inclusion and respectful behaviour policy Support for disabled students Part-time work Health services Research Our impact Research projects Research areas Research facilities Collaborate with us Institutes, centres and groups Support for researchers Faculties, schools and departments Interdisciplinary research Find people and expertise - Research jobs Business Develop your organisation Access start-up support Invest in our start-ups Become a research partner License our technology Knowledge Transfer Partnerships Hire our facilities Academic consultants Specialist consultancies Research studentships Develop your workforce Continuing professional development Set up a staff secondment Host a placement student Collaborate on a short term student project Advertise graduate jobs and internships Become a supplier - - Find people and expertise Global International students Visiting delegations University of Southampton Delhi International Office Visiting fellowships University of Southampton Malaysia - Partnerships and initiatives Online master's degrees View all staff Professor Chris Freeman PhD, BEng, BSc, CEng, FIET Professor Research interests Iterative learning and repetitive control theory and their experimental application to indust… Biomechanics Motor learning and control More research Accepting applications from PhD students. Connect with Chris Email: cf@ecs.soton.ac.uk Tel: +44 23 8059 3486 ORCID On this page About Research Publications About Research Publications About Deputy Head of School (Equity, Diversity and Inclusion) Chair of ECS Belonging, Inclusion, Diversity and Equity (BIDE) Committee Chris Freeman is Professor of Robotics and Control within Electronics and Computer Science. He has led the engineering component on large UK government funded grants which have developed a range of upper limb systems using robotics and functional electrical stimulation (FES) technology that have each been trialled clinically with stroke patients. He has also led international grants focussing on robotics and learning control for industrial automation tasks. His current focus is on biomechanics, motor learning and control, biomedical systems modelling, non-contact sensing, electrode-array based FES, wearables and touch-table technology. Research Research groups Member of: Digital Health and Biomedical Engineering Institute for Life Sciences Centre for Health Technologies Centre for Robotics Research interests Iterative learning and repetitive control theory and their experimental application to industrial systems and biomedical engineering Biomechanics Motor learning and control Non-contact sensing Electrode-array based FES and touch-table technology Research projects Active projects Towards intelligent, pervasive, high performance control system architectures: A learning based approach Researchers: Professor Bing Chu Professor Chris Freeman Sponsor: Zhengzhou University Completed projects Objective ILC Researchers: Professor Chris Freeman Sponsor: EPSRC Freeman. EPSRC. SANDPIT - Wearable Soft Robotics for Independent Living Researchers: Professor Chris Freeman Sponsor: EPSRC Low-cost personalised instrumented clothing with integrated FES electrodes Researchers: Professor Kai Yang Professor Chris Freeman , Doctor John Tudor , Professor Stephen Beeby , Doctor Ann-Marie Hughes Wrist Hand ILC (Restoration of Reach & Grasp in Stroke Patients Using Electrical Stimulation & Haptic Feedback) Researchers: Professor Eric Rogers Professor Chris Freeman Sponsor: EPSRC HEIF 2018/19 Hughes Researchers: Doctor Ann-Marie Hughes Professor Chris Freeman , Professor Kai Yang , Doctor John Tudor A-M Hughes, WMR - Open Hand for Stroke Researchers: Doctor Ann-Marie Hughes Professor Chris Freeman Sponsor: Wessex Medical Research A Hughes: Using functional electrical stimulation mediated by iterative learning control and robotics to improve arm movement for people with MS - CLOSED Researchers: Doctor Ann-Marie Hughes Professor Sara Demain , Professor Chris Freeman Sponsor: Multiple Sclerosis Society Elder Athletes: building incidental interaction at home for thriving at home, in home and on the go Researchers: Professor m.c. Schraefel Professor Chris Freeman , Doctor Martin Warner Sponsor: EPSRC Publications Non-linear multiple model switched iterative learning control Lucy Hodgins, Chris Freeman & Zehor Belkhatir, 2025 Type: conference Artificial Neural Network based Iterative Learning Control for Stroke Rehabilitation Xiaoru Sun & Chris Freeman, 2025, European Journal of Control Type: article Evaluating the feasibility of chaos-based guidance systems in swarm projectiles Mustafa Çağrı KUTLU & Chris Freeman, 2025 Type: conference Multiple model switched repetitive control for tremor suppression Tingze Fang & Christopher T. Freeman, 2025, Mechatronics, 110, 103392 DOI: 10.1016/j.mechatronics.2025.103392 Type: article Iterative impedance learning control with explainable AI Shekhar Mahmud, Mustafa Kutlu & Chris Freeman, 2025 Type: conference Iterative learning control of minimum energy path following tasks for second-order MIMO systems: an indirect reference update framework Yiyang Chen, Yiming Wang & Christopher T. Freeman, 2025, IEEE Transactions on Cybernetics, 55(7), 3403-3416 DOI: 10.1109/TCYB.2025.3556703 Type: article Robust iterative learning control for unstable MIMO systems Lucy Hodgins & Chris T. Freeman, 2025, International Journal of Control DOI: 10.1080/00207179.2025.2513674 Type: article Model predictive valve control to assist lung pressure profile tracking M. Thompson, Chris Freeman, Neil O'Brien, Ann-Marie Hughes, Robert J. Marchbanks & Tony Birch, 2025, IEEE Transactions on Control Systems Technology, 33(5), 1509-1520 DOI: 10.1109/TCST.2025.3542215 Type: article Optimal algorithms for improving pressure-sensitive mat centre of pressure measurements Alexander Dawid Bincalar, Chris Freeman & m.c. schraefel, 2025, Sensors, 25(5) DOI: 10.3390/s25051283 Type: article Multiple model iterative learning control of FES electrode arrays Lucy Hodgins, Chris T. Freeman & Zehor Belkhatir, 2024 DOI: 10.5220/0012892900003822 Type: conference Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Pre-sessional English courses Course modules Assessment Subjects Acoustical engineering Aeronautical and astronautical engineering Ageing and gerontology Archaeology Art, design and fashion Audiology Biological sciences Biomedical and medical engineering Business, accounting, finance and marketing Chemistry Civil engineering Computer science and software engineering Economics Education Electrical and electronic engineering English Film studies French Geography and environmental science History Languages and linguistics Law Maritime engineering Mathematical sciences Mechanical engineering Medicine Music Nursing, midwifery and healthcare Ocean and Earth science Philosophy Photonics and optoelectronics Physics and astronomy Politics and international relations Psychology Social statistics and demography Sociology, social policy and criminology PhDs and research degrees Create your own research project Find a PhD project A missing link between continental shelves and the deep sea: Have we underestimated the importance of land-detached canyons? A study of rolling contact fatigue in electric vehicles (EVs) Acoustic monitoring of forest exploitation to establish community perspectives of sustainable hunting Acoustic sensing and characterisation of soil organic matter Advancing intersectional geographies of diaspora-led development in times of multiple crises Aero engine fan wake turbulence – Simulation and wind tunnel experiments Against Climate Change (DACC): improving the estimates of forest fire smoke emissions All-in-one Mars in-situ resource utilisation (ISRU) system and life-supporting using non-thermal plasma An electromagnetic study of the continent-ocean transition southwest of the UK An investigation of the relationship between health, home and law in the context of poor and precarious housing, and complex and advanced illn",
  "content_length": 28903,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:34"
}