{
  "name": "Christoph Reichenbach",
  "homepage": "https://creichen.net",
  "status": "success",
  "content": "Christoph Reichenbach Index Projects Courses Publications Miscellany Contact About me Welcome! I am a Senior Lecturer at Lund University, specialising in Software Technology. My university home page is here. Most of my current research is funded by the Wallenberg AI, Autonomous Systems, and Software Project (WASP). My current research interests include: (Static) program analysis High-level domain-specific languages (specifically declarative languages) Interactive program transformation tools Automation in software engineering New approaches to program synthesis and re-engineering Current PhD students Momina Rizwan Joel Nyholm (Halmstad University) (as secondary supervisor) Erik Präntare Graduated PhD students Krishna Narasimhan, received his PhD from Goethe University in 2017. Noric Couderc, received his PhD from Lund University in 2023. Now full-time lecturer at the Department of Computer Science, Lund University. Idriss Riouak (as secondary supervisor), received his PhD from Lund University in 2024, Now at GitHub. Alexandru Dura, received his PhD from Lund University in 2025. History Previously I served as junior professor for Software Engineering and Programming Languages at Goethe University Frankfurt. Before that, I worked in the software industry at Google, and in research, both at the University of Massachusetts, Amherst, on parallelisable query languages for Java, as a postdoctoral fellow with Yannis Smaragdakis. I completed my PhD on program metamorphosis at the University of Colorado at Boulder in 2010. Program metamorphosis is a novel technique for interactive multi-step program transformation with strong behaviour preservation guarantees and described in more detail here. My PhD supervisor was Amer Diwan (now at Google). This page is Copyright © 2004-2021 Christoph Reichenbach. Re-use in whole or in parts is allowed without restriction.",
  "content_length": 1880,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:50"
}