{
  "name": "Christopher Wardlaw Fletcher",
  "homepage": "http://cwfletcher.net",
  "status": "success",
  "content": "Home Toggle navigation Christopher W. Fletcher Home Research Group Teaching Misc In Brief Hi there! My name is Chris Fletcher (a.k.a. 'C Fletch', or just 'Fletch', or just 'C F'). I am an Associate Professor at the University of California, Berkeley. Before that I spent six wonderful years at UIUC as an Assistant Professor, took a year as a research post-doc at NVIDIA, got a Ph.D. at MIT and, finally, a B.S. also at Berkeley. I am always looking for talented PhD students. If you are interested in joining my group, please make sure to apply to Berkeley in December, and list me under 'Faculty Interest'. Please do not email directly me about PhD supervision before you have been admitted (unless we have met in some professional context). Hi there! My name is Chris Fletcher (a.k.a. 'C Fletch', or just 'Fletch', or just 'C F'). I am an Associate Professor at the University of California, Berkeley. Before that I spent six wonderful years at UIUC as an Assistant Professor, took a year as a research post-doc at NVIDIA, got a Ph.D. at MIT and, finally, a B.S. also at Berkeley. I am always looking for talented PhD students. If you are interested in joining my group, please make sure to apply to Berkeley in December, and list me under 'Faculty Interest'. Please do not email directly me about PhD supervision before you have been admitted (unless we have met in some professional context). Contact information If you would like to get into contact with me, start with email. Please try again if I don’t respond! I often have too much email to go through, but repeated emails help a lot. Handles: Email 1: cwfletcher [at] berkeley [dot] edu Email 2: chris [dot] w [dot] fletcher [at] gmail [dot] com github All of my accounts have a different iguana avatar. If it ain’t a vegetarian lizard, don’t trust it. Iguanas look something like this: © 2023 Christopher W. Fletcher",
  "content_length": 1878,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:34"
}