{
  "name": "Christian Plessl",
  "homepage": "https://cs.uni-paderborn.de/hit/team/plessl",
  "status": "success",
  "content": "Christian Plessl - High-Performance Computing | Paderborn University Christian Plessl is professor (W3) for High-Performance Computing at the department of Computer Science at Paderborn University. He is also managing director of the Paderborn Center for Parallel Computing, which is a central scientific institute of Paderborn University and a National High-Performance Computing center in the NHR alliance. He is a member of the board of directors of the NHR association. Dr. Plessl earned a PhD degree (Dr. sc. ETH) in Computer Engineering from ETH Zurich in 2006, and a MSc degree in Electrical Engineering in 2001, also from ETH Zurich. He has been a principal investigator in numerous national and transnational research projects funded by the German Research Foundation (DFG), the German Ministry of Education and Research (BMBF), the State of North Rhine-Westfalia, and the European Commission. His research has also received support from industry, for example, by grants from AMD/Xilinx, Intel/Altera, Fujitsu, and others. Dr. Plessl has authored and co-authored more than 100 peer-reviewed publications and his research has been honored with several awards, e.g., the significant paper award 2015 of FPL conference, the best paper awards at HEART 2023, ReConFig 2014 and 2012, the Paderborn University Research Award 2018 and 2009, and the SEW-EURODRIVE Studienpreis award in 2001. He is a senior member of the IEEE, member of the ACM, Gesellschaft für Infromatik (GI), and the HiPEAC Network of Excellence. He is a regular reviewer for scientific journals and serves on the program committee of major international conferences. His research interests include architecture and tools for high-performance parallel and reconfigurable computing, scientific computing, and adaptive computing systems. FINN-HPC: Closing the Gap for Energy-Efficient Neural Network Inference on FPGAs in HPC L. Jungemann, B. Wintermann, H. Riebler, C. Plessl, in: Proceedings of the 15th International Symposium on Highly Efficient Accelerators and Reconfigurable Technologies, ACM, New York City, 2025. DOI AuroraFlow, an Easy-to-Use, Low-Latency FPGA Communication Solution Demonstrated on Multi-FPGA Neural Network Inference G. Pape, B. Wintermann, L. Jungemann, M. Lass, M. Meyer, H. Riebler, C. Plessl, in: Proceedings of the 15th International Symposium on Highly Efficient Accelerators and Reconfigurable Technologies, 2025. DOI PHOENIX – Paderborn highly optimized and energy efficient solver for two-dimensional nonlinear Schrödinger equations with integrated extensions J. Wingenbach, D. Bauch, X. Ma, R. Schade, C. Plessl, S. Schumacher, Computer Physics Communications 315 (2025). DOI Analyzing performance portability for a SYCL implementation of the 2D shallow water equations M. Büttner, C. Alt, T. Kenter, H. Köstler, C. Plessl, V. Aizinger, The Journal of Supercomputing 81 (2025). DOI Evaluating oneAPI I/O Pipes in a Case Study of Scaling a SYCL Jacobi Solver to multiple FPGAs C. Alt, C. Plessl, T. Kenter, in: Proceedings of the 13th International Workshop on OpenCL and SYCL, Association for Computing Machinery, New York, NY, USA, 2025. DOI Characterizing Microheterogeneity in Liquid Mixtures via Local Density Fluctuations M. Lass, T. Kenter, C. Plessl, M. Brehm, Entropy 26 (2024). DOI Noctua 2 Supercomputer C. Bauer, T. Kenter, M. Lass, L. Mazur, M. Meyer, H. Nitsche, H. Riebler, R. Schade, M. Schwarz, N. Winnwa, A. Wiens, X. Wu, C. Plessl, J. Simon, Journal of Large-Scale Research Facilities 9 (2024). DOI PDF StencilStream: A SYCL-based Stencil Simulation Framework Targeting FPGAs J.-O. Opdenhövel, C. Alt, C. Plessl, T. Kenter, in: 2024 34th International Conference on Field-Programmable Logic and Applications (FPL), IEEE, 2024. DOI HiHiSpMV: Sparse Matrix Vector Multiplication with Hierarchical Row Reductions on FPGAs with High Bandwidth Memory A.R. Tareen, M. Meyer, C. Plessl, T. Kenter, in: 2024 IEEE 32nd Annual International Symposium on Field-Programmable Custom Computing Machines (FCCM), IEEE, 2024. DOI SERI: High-Throughput Streaming Acceleration of Electron Repulsion Integral Computation in Quantum Chemistry using HBM-based FPGAs P. Stachura, G. Li, X. Wu, C. Plessl, Z. Fang, in: 2024 34th International Conference on Field-Programmable Logic and Applications (FPL), IEEE, 2024, pp. 60–68. DOI Show all publications Prof. Dr. Christian Plessl High-Performance Computing Room X1.101 Paderborn University Mersinweg 5 33100 Paderborn +49 5251 60-5399 05251/60-1735 Send E-Mail Directions How to find the room X1.101",
  "content_length": 4553,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:15"
}