{
  "name": "Christophe Crespelle",
  "homepage": "https://perso.ens-lyon.fr/christophe.crespelle",
  "status": "success",
  "content": "Christophe Crespelle - Homepage Christophe Crespelle's Homepage Current Position Professor at Université Côte d'Azur (UCA). Member of the MDSC team of the I3S laboratory. E-mail: christophe tod crespelle wat univ-cotedazur odt fr (replace the three-letter words with . @ .) Past Visiting Positions 2018 - 2020 University of Bergen, in the Algorithms group. Marie Sklodowska-Curie action of the European Union, PROXNET project. Bergen, Norway. 2014 - 2016 Institute of Mathematics, Vietnam Academy of Science and Technology. Temporary assignment at CNRS. Hanoi, Vietnam. Research Interests Complex networks Dynamic networks Internet metrology Diffusion phenomena Random generation Algorithms and graphs Dynamic algorithms Graph editing problems Graph decompositions Data structure For companies The goal of my research is to understand the structure and the dynamics of huge datasets coming from various contexts and that are organised as networks. I use both formal and empirical approaches in order to unveil some relevant information about this data in the context it comes from. One of the challenges is the efficiency of the algorithms and the data-structures used, which is made crucial by the huge size of the data. Companies, if you have some question you want to answer about some data, I can help you. Whether it is about exploiting, or managing or collecting this data, I can help you improve the performance of the processes you use, improve the quality of the results you get from these processes and get some new knowledge about your data that is profitable to your activity. My LinkedIn profile (in French). Habilitation thesis (HDR) \"Structures of Complex Networks and of their Dynamics\" Participation to Program Committees International conferences and workshops MFCS 2019 44th International Symposium on Mathematical Foundations of Computer Science ICGT 2018 10th International Colloquium on Graph Theory WG 2016 42nd International Workshop on Graph-Theoretic Concepts in Computer Science NetSciCom 2015 7th IEEE International Workshop on Network Science for Communication Networks SMF-VMS 2012 Co-chair of the Discrete Mathematics Session of the SMF-VMS Joint Congress organised by the French Mathematical Society and the Vietnam Mathematical Society in Hue, Vietnam, in 2012. National conferences CCS - France 2021 French Regional Conference on Complex Systems In 2021. MARAMI Modèles et Analyse des Réseaux : Approches Mathématiques et Informatiques In 2020, 2019, 2018, 2017 and 2015. AlgoTel Rencontres Francophones sur les Aspects Algorithmiques des Télécommunications In 2019, 2018, 2014 and 2013. Participation to PhD Jurys As a reviewer Maël Dumas Modification et couverture de graphes : Approches paramétrées Orléans University, December 2023. Antoine Huchet Algorithmique de graphes appliquée à la mesure passive de la mobilité dans les réseaux routiers La Rochelle University, December 2023. Thibaud Trolliet Étude des propriétés et modélisation de graphes sociaux complexes University Côte d'Azur, June 2021. Mehdi Djellabi Mesures d'interactions locales pour les noeuds d'un réseau complexe: approches théorique et pratique Toulouse University, January 2021. Léo Rannou Temporal Connectivity and Path Computation for Stream Graph Sorbonne University, November 2020. Nicolas Martin Network partitioning algorithms with scale-free objective Grenoble Alpes University, February 2020. Antoine Roux Etude d’un code correcteur linéaire pour le canal à effacements de paquets et optimisation par comptage de forêts et calcul modulaire Sorbonne university, October 2019. Thibaud Arnoux Prédiction d'interactions dans les flots de liens Sorbonne university, June 2018. Kaoutar Ghazi Heuristiques et Conjectures à propos de la 2-dimension des ordres partiels Clermont Auvergne University, September 2017. Pham Van Trung Properties of stable configurations of the chip-firing game and extended models Vietnam Academy of Science and Technology, November 2014 and September 2015 (NB: there are always two defenses for a PhD in Vietnam). As an examiner François Pitois Recherche de régularités et représentations succinctes de graphes University Bourgogne Franche-Comté, July 2024, President of the jury. Thomas Dissaux Décomposition de graphes: longueur arborescente et jeux de poursuite University Côte d'Azur, September 2023, President of the jury. Mikhail Kamalov Scalable algorithms for graph-based semi-supervised learning with embedding University Côte d'Azur, December 2022, President of the jury. Massoud Seifi Cœurs stables de communautés dans les graphes de terrain University of Paris 6, March 2012. Xiaomin Wang Approche formelle de la mesure d'Internet University of Paris 6, December 2011. Assia Hamzaoui Détection d'évènements dans les dynamiques de graphes de terrain : une approche statistique University of Paris 6, June 2011. Former PhD Students Yannick Léo Deep dive into social network and economic data: a data driven approach for uncovering temporal ties, human mobility, and socioeconomic correlations. Co-supervised with Eric Fleury and Marton Karsai. Defended in December 2016. Lucie Martinet Réseaux dynamiques de terrain : caractérisation et propriétés de diffusion en milieu hospitalier. Co-supervised with Eric Fleury. Defended in September 2015. Elie Rotenberg Une nouvelle approche pour l'estimation fiable des propriétés de la topologie d'Internet Co-supervised with Matthieu Latapy. Defended in January 2015. Enseignements Publications Vitae [pdf]",
  "content_length": 5549,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:02"
}