{
  "name": "Chris J. Taylor 0001",
  "homepage": "https://www.research.manchester.ac.uk/portal/en/researchers/christopher-taylor(f11de136-9c92-4edd-b9ac-d33b8b7a5cfb).html",
  "status": "success",
  "content": "Chris Taylor - Research Explorer The University of Manchester Chris Taylor, FREng, OBE Prof Professor of Medical Biophysics, Division of Informatics, Imaging & Data Sciences (L5)Professor of Computer Science, Machine Learning and RoboticsAssociate Vice-President, Office of the President and Vice Chancellor (L5) https://orcid.org/0000-0001-7867-9533 Phone+44 (0) 161 275 5403Emailchris.taylormanchester.acuk Personal profile BiographyI received my BSc in physics and PhD in computer image analysis from the University of Manchester, in 1967 and 1972 respectively. I currently have University-wide roles as Associate Vice President for Research and Director of Manchester Informatics. My academic appointment is joint between Informatics, Imaging & Data Science in the Faculty of Biology, Medicine and Health, where my research group is based, and the School of Computer Science, in the Faculty of Science and Engineering, where I was Head of School 2004 – 2008. My core research is in computer vision and medical image analysis – with a central interest in developing generic methods to underpin practical applications in medicine, industry, and commerce – but I also have broader interests in informatics, data science and connected health. I have a long history of involvement in technology transfer, establishing long-term partnerships with industry, and spinning out five new companies. I was awarded an OBE in 2000 for contributions to Foresight and Health Informatics and was elected a Distinguished Fellow of the British Machine Vision Association in 2003, Fellow of the International Association for Pattern Recognition in 2004, Fellow of the Royal Academy of Engineering in 2006, Fellow of the (International) Medical Image Computing and Computer Aided Intervention (MICCAI) Society in 2009, and was the 3rd recipient of the MICCAI Enduring Impact Award in 2011.  I am currently chair of the EPSRC Healthcare Technologies Strategic Advisory Team.Research interestsComputer Vision Medical Image Analysis MammographyBone and Joint imaging (OA, RA)Nailfold Capillaroscopy Face Recognition/Analysis Machine Learning Connected Health and mHealth Technology for Mental Health Internet of ThingsMy collaborations Collaborators Dr James Graham Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationDoctor of Philosophy, General Methods of Analysing Biomedical Images, The University of Manchester1 Oct 1967 → 1 Jul 1972Award Date: 1 Jul 1972Bachelor of Science, The University of Manchester1 Sept 1964 → 1 Jul 1967Award Date: 1 Jul 1967 Research Beacons, Institutes and PlatformsDigital FuturesInstitute for Data Science and AIChristabel Pankhurst InstituteCreative Manchester Fingerprint Dive into the research topics where Chris Taylor is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Capillaroscopy Medicine and Dentistry 100% Statistical Model Computer Science 95% Systemic Scleroderma Medicine and Dentistry 91% Capillary Medicine and Dentistry 91% Grey Level Engineering 90% Appearance Model Engineering 83% Model Parameter Engineering 56% nonrigid registration Computer Science 55% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 233 Conference contribution 137 Article 17 Chapter 5 Patent 8 More 3 Book 1 Poster 1 Conference article 1 Letter 1 Review article 1 Doctoral Thesis Research output per year Research output per year Development of a measuring app for systemic sclerosis-related digital ulceration (SALVE: Scleroderma App for Lesion VErification)Davison, A. K., Krishan, A., New, R. P., Murray, A., Dinsdale, G., Manning, J., Hall, F., Pauling, J. D., Vail, A., Kearney, K., Patrick, H., Hughes, M., Dixon, W., Dickinson, M., Taylor, C. & Herrick, A. L., 19 Jul 2024, In: Rheumatology (Oxford, England).Research output: Contribution to journal › Article › peer-review Open Access Systemic Scleroderma 100% Venous Ulcer 100% Scleroderma 100% Ulcer 100% Systemic Sclerosis 100% A deep learning system for quantitative assessment of microvascular abnormalities in nailfold capillary imagesBharathi, P. G., Berks, M., Dinsdale, G., Murray, A., Manning, J., Wilkinson, S., Cutolo, M., Smith, V., Herrick, A. L. & Taylor, C. J., 1 Jun 2023, In: Rheumatology (Oxford, England). 62, 6, p. 2325-2329 5 p.Research output: Contribution to journal › Article › peer-review Open Access Health Care Cost 100% Capillary 100% Morphology 50% Image Analysis 50% Capillaroscopy 50% Nailfold capillaroscopy: a survey of current UK practice and 'next steps' to increase uptake among rheumatologistsEden, M., Wilkinson, S., Murray, A., Bharathi, P. G., Vail, A., Taylor, C. J., Payne, K. & Herrick, A. L., 1 Jan 2023, In: Rheumatology (Print). 62, 1, p. 335-340 6 p.Research output: Contribution to journal › Article › peer-review Open Access Capillaroscopy 100% Diagnosis 10% Health Care Cost 10% Health Service 10% Raynaud Phenomenon 10% Defect Classification and Detection Using a Multitask Deep One-Class CNNDong, X., Taylor, C. & Cootes, T., 1 Jul 2022, In: IEEE Transactions on Automation Science and Engineering. 19, 3, p. 1719-1730 12 p.Research output: Contribution to journal › Article › peer-review Convolutional Neural Network 100% Annotation 33% Multitask Learning 33% Class Classification 33% Autoencoder 33% Photoacoustic imaging is a novel tool to measure finger artery structure and oxygenation in patients with SScWilkinson, S., Cummings, J., Zafar, S., Kozár, M., Manning, J., Dinsdale, G., Berks, M., Taylor, C., Dickinson, M., Herrick, A. & Murray, A., 28 Nov 2022, In: Scientific Reports. 12, 20446.Research output: Contribution to journal › Article › peer-review Open Access Systemic Scleroderma 100% Photoacoustic Imaging 100% Finger 100% Artery 100% Digital Artery 40% View all 400 research outputs Projects 3 Finished Projects per year Internet of Things cities Demonstrator: CityVerveTaylor, C. (PI), Brass, A. (CoI), Cotton, I. (CoI), Georghiou, L. (CoI), Jay, C. (CoI), Keane, J. (CoI), Parisio, A. (CoI), Paton, N. (CoI), Peek, N. (CoI), Topping, D. (CoI) & Van Staa, T. (CoI)1/07/16 → 30/06/18Project: Research Internet 100% Internet-Of-Things 100% Urban Areas 100% Research 50% Agreement 50% Neighbourhoods and Dementia: A Mixed Methods Study.Keady, J. (PI), Burns, A. (CoI), Challis, D. (CoI), Davies, L. (CoI), Leroi, I. (CoI), Nazroo, J. (CoI), Pendleton, N. (CoI), Reeves, D. (CoI), Swarbrick, C. (CoI), Tampubolon, G. (CoI), Taylor, C. (CoI) & Young, A. (CoI)1/01/14 → 31/10/19Project: Research Organization and Methods 100% Lived Experience 72% Mixed Methods 66% UK 57% Sign Language 56% Prevention of Falls Network for Dissemination.Todd, C. (PI), Brown Wilson, C. (CoI), Hawley-Hague, H. (CoI), Horne, M. (CoI), Pilling, M. (CoI), Stanmore, E. (CoI) & Taylor, C. (CoI)1/04/13 → 31/03/15Project: Research Prevention 100% Impacts Active Shape and Appearance ModelsTaylor, C. (Participant), Cootes, T. (Participant), Graham, J. (Participant), Twining, C. (Participant), Edwards, G. (Participant) & Davies, R. (Participant)Impact: Technological, Economic, Health and wellbeing, Society and culture Ground breaking computer vision research revolutionises digital entertainmentTaylor, C. (Participant), Cootes, T. (Participant), Twining, C. (Participant), Christinacce, D. (Participant), Babalola, K. (Participant) & Petrovic, V. (Participant)Impact: Technological, Economic, Society and culture Improving healthcare and animal welfare using statistical shape modelsCootes, T. (Participant), Taylor, C. (Participant), Twining, C. (Participant), Lindner, C. (Participant) & Davies, R. (Participant)Impact: Health and wellbeing, Economic, Technological Press/Media GRAPHIC SPEAK: Cubic Motion makes more than facesCootes, T. & Taylor, C.15/08/181 Media contributionPress/Media: Research THE ACADEMY OF MEDICAL SCIENCES: Transforming healthcare through engineering and technology - 2018 FORUM Annual LectureTaylor, C.19/06/181 Media contributionPress/Media: Expert comment",
  "content_length": 8573,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:44"
}