{
  "name": "Chris J. Mitchell",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/chris-mitchell",
  "status": "success",
  "content": "Chris Mitchell - Royal Holloway Research Portal View Scopus Profile Chris Mitchell Professor Professor of Computer Science, Department of Information Security https://orcid.org/0000-0002-6118-0055 Phone+44 1784 443423EmailC.Mitchellrhul.acukWebsitehttp://www.chrismitchell.net TW20 0EX Personal profile Personal profileChris Mitchell was Head of the Department of Information Security from 2021 to 2023.  He received his BSc and PhD degrees in Mathematics from Westfield College, University of London in 1975 and 1979 respectively.  He was appointed as Professor of Computer Science at Royal Holloway in 1990, having previously worked at Racal Comsec, Salisbury, UK (1979-85) and Hewlett-Packard Laboratories, Bristol, UK (1985-90).  After joining Royal Holloway he co-founded the Information Security Group in 1990, and helped launch the MSc in Information Security in 1992.  His research interests lie within information security, focusing on applications of cryptography.  He is co-editor-in-chief of Designs, Codes and Cryptography, and until 2021 was section editor for Section D of The Computer Journal. Further details of his research, including a complete list of publications, can be found on his personal webpage:  http://www.chrismitchell.net His DBLP page is here, and his Google Scholar profile is here. Education/Academic qualificationMathematics, PhDAward Date: 1 Jul 1979 Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 151 Conference contribution 99 Article 22 Chapter 16 Anthology 32 More 8 Working paper 7 Preprint 4 Book 4 Other report 3 Comment/debate 2 Chapter (peer-reviewed) 2 Paper 1 Poster 1 Editorial Research output per year Research output per year Advancing Ethical Hacking with AI: A Linux-Based Experimental StudyAl-Sinani, H. S., Sahli, N., Mitchell, C. J. & Al-Siyabi, M., 13 May 2025, Proceedings of the Joint National Conference on Cybersecurity (ITASEC & SERICS 2025), Bologna, Italy, February 03-08, 2025. CEUR-WS.org, 7. (CEUR Workshop Proceedings; vol. 3962).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open Access 84 Downloads (Pure) AI-generated Papers and Manipulation of Academic Metrics: A Case StudyAl-Sinani, H. S. & Mitchell, C. J., 6 Nov 2025, Proceedings of the 8th IEEE Congress on Information Science and Technology (CiSt), Marrakech, Morocco, October 2025. IEEE PressResearch output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 3 Downloads (Pure) Introducing PenTest++: an AI-Augmented, Automated, Ethical Hacking SystemAl-Sinani, H. S. & Mitchell, C. J., 6 Nov 2025, Proceedings of the 8th IEEE Congress on Information Science and Technology (CiSt), Marrakech, Morocco, October 2025. IEEE PressResearch output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 3 Downloads (Pure) New orientable sequencesMitchell, C. J. & Wild, P., 3 Jul 2025, (Unpublished) arXiv, 30 p.Research output: Working paper › Preprint File 4 Downloads (Pure) Orientable and negative orientable sequencesMitchell, C. J. & Wild, P., 31 Dec 2025, In: Discrete Applied Mathematics. 377, p. 242-259 18 p.Research output: Contribution to journal › Article › peer-review Open Access 18 Downloads (Pure) View all 320 research outputs Projects 2 Finished Projects per year Trust establishment in mobile distributed computing platformsMitchell, C. (PI)Eng & Phys Sci Res Council EPSRC1/04/06 → 31/03/09Project: Research Open Trusted Computing (Open_TC)Mitchell, C. (PI)European Union1/11/05 → 30/04/07Project: Research Activities 2 Workshop, seminar, course or webinar. 1 Editor of research journal 1 Membership of peer review panel or committee Activities per year 91st ISO/IEC JTC 1/SC 27/WG 2 MeetingWeinert, C. (Participant) & Mitchell, C. (Participant)11 Mar 2025 → 14 Mar 2025Activity: Participating in or organising an event › Workshop, seminar, course or webinar. Security Standardisation Research Conference 2024 (Event)Mitchell, C. (Chair) & Weinert, C. (Participant)23 Jul 2024 → 17 Dec 2024Activity: Membership › Membership of peer review panel or committee 87th ISO/IEC JTC 1/SC 27/WG 2 MeetingMitchell, C. (Organiser), Player, R. (Participant) & Weinert, C. (Participant)8 Apr 2024 → 12 Apr 2024Activity: Participating in or organising an event › Workshop, seminar, course or webinar. Designs, Codes and Cryptography (Journal)Mitchell, C. (Editor)1 Jan 2011 → …Activity: Publication peer-review and editorial work › Editor of research journal",
  "content_length": 4833,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:42"
}