{
  "name": "Chris Thachuk",
  "homepage": "https://thachuk.com",
  "status": "success",
  "content": "Chris ThachukSearchChris ThachukAssistant ProfessorUniversity of WashingtonBiographyI am an Assistant Professor in the Paul G. Allen School of Computer Science & Engineering at the University of Washington. My research focuses on applying principles from computer science and engineering to create programmable matter at the nanoscale with bio-molecules such as DNA. Prior to UW, I was a Senior Postdoctoral Researcher at Caltech, working with Erik Winfree, a postdoc at Oxford Computer Science with Marta Kwiatkowska and a James Martin Fellow at the Institute for the Future of Computing, Oxford. I received my PhD in Computer Science from UBC in 2013, advised by Anne Condon. Much of my computations now happen in a test tube.InterestsDNA computing & molecular programmingSynthetic biologyBioinformaticsAlgorithm & data structure designScientific software developmentEducationPhD in Computer Science, 2013University of British ColumbiaMSc in Computer Science & Bioinformatics, 2007Simon Fraser University & CIHR/MSFHR Bioinformatics Training Program for Health ResearchBCS in Computer Science, 2005University of WindsorAcademic Positions     Assistant ProfessorUniversity of WashingtonAug 2020 – Present Seattle, Washington, USAPaul G. Allen School of Computer Science & Engineering     Senior Postdoctoral FellowCalifornia Institute of TechnologyFeb 2014 – Jul 2020 Pasadena, California, USAComputing + Mathematical Sciences department and an affiliated member of the Center for Mathematics of Information     Postdoctoral Research Assistant & James Martin FellowUniversity OxfordOct 2012 – Jan 2014 Oxford, UKComputer Science department and Institute for the Future of ComputingFeatured PublicationsAshwin Gopinath, Chris Thachuk, Anya Mitskovets, Harry A. Atwater, David Kirkpatrick, Paul W. K. RothemundFebruary 2021 ScienceAbsolute and arbitrary orientation of single-molecule shapesThis work demonstrates that it’s possible to place large numbers of individual molecules precisely and independently on a surface. The idea was to use a DNA origami shape that always correctly aligns itself to a corresponding shape etched on a surface via lithography. This method for precisely placing and orienting DNA-based molecular devices may make it possible to use these molecular devices to power new kinds of chips that integrate molecular biosensors with optics and electronics for applications such as DNA sequencing or measuring the concentrations of thousands of proteins at once.PDF Cite abc Anne Condon, Chris ThachukApril 2019 The Energetics of Computing in Life and MachinesTowards space- and energy-efficient computationsComputation can be space-efficient. It can almost always be energy-efficent as well. This book chapter is a friendly introduction to our work and to that of others showing how this is possible in the context of programming chemical reaction networks.PDF CiteBoya Wang, Chris Thachuk, Andrew D Ellington, Erik Winfree, David SoloveichikJanuary 2018 Proceedings of the National Academy of SciencesEffective design principles for leakless strand displacement systemsThis work experimentally proved that the leakless strand displacement cascades for signal transduction that we previously hypothesized really are fast and robust. The molecular circuit breadboard is building upon this work for implementing arbitrary logic circuits and rate-less chemical reaction networks.PDF CiteChris Thachuk, Erik Winfree, David SoloveichikAugust 2015 International Workshop on DNA Computing and Molecular ProgrammingLeakless DNA strand displacement systemsDNA strand displacement systems (DSD systems) hold promise for sophisticated information processing within chemical or biological environments; however, they are capable of spurious displacement events that lead to leak: incorrect signal production. This work proposes a leakless design motif and formally proves that these systems can, in fact, be made arbitrarily robust. As a bonus, robust DSD circuits can be made into fast DSD circuits.PDF CiteRecent PublicationsPublications marked with abc list authors in alphabetical order, as is common in mathematics and theoretical computer science.Ashwin Gopinath, Chris Thachuk, Anya Mitskovets, Harry A. Atwater, David Kirkpatrick, Paul W. K. Rothemund (2021). Absolute and arbitrary orientation of single-molecule shapes. Science.PDF Cite abc Anne Condon, Chris Thachuk (2019). Towards space- and energy-efficient computations. The Energetics of Computing in Life and Machines.PDF CiteKeenan Breik, Chris Thachuk, Marijn Heule, David Soloveichik (2019). Computing properties of stable configurations of thermodynamic binding networks. Theoretical Computer Science.Ashwin Gopinath, Chris Thachuk, Anya Mitskovets, Harry A Atwater, David Kirkpatrick, Paul WK Rothemund (2018). Absolute and arbitrary orientation of single molecule shapes. arXiv preprint arXiv:1808.04544.Boya Wang, Chris Thachuk, Andrew D Ellington, Erik Winfree, David Soloveichik (2018). Effective design principles for leakless strand displacement systems. Proceedings of the National Academy of Sciences.PDF CiteSee all publications ContactName Email Message SendPaul G. Allen School of Computer Science & Engineering, Box 352355, Seattle, WA 98195-2355Locate the Bill & Melinda Gates Center. My office is CSE2 336. Cite ×Copy Download",
  "content_length": 5323,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:47"
}