{
  "name": "Christopher Crick",
  "homepage": "https://cs.okstate.edu/~chriscrick",
  "status": "success",
  "content": "Christopher Crick Curriculum Vitae Christopher John Crick, PhD Associate Professor Oklahoma State University Computer Science Department 219 MSCS Stillwater OK 74078 (203)907-5734 chriscrick@cs.okstate.edu Research Interests My research agenda is motivated by two overarching, complementary goals: to ground models of developmental psychology and cognitive science in realized, embodied computational systems; and to use models of human cognition and social development to improve robot control and learning, human-robot interaction and artificial intelligence in general. Education Yale University PhD Computer Science, 2009 Dissertation Topic: Inferring Social Roles and Intention from Motion and Interaction Committee: Brian Scassellati, Brian Scholl, Drew McDermott, Benjamin Kuipers MPhil Computer Science MS Computer Science Harvard University MS Computer Science BA History Publications Book Chapters Reza Marzban and Christopher Crick. Deep NLP explainer: Using prediction slope to explain NLP models. Artificial Neural Networks and Machine Learning -- ICANN 2021 (I Farkas, P Masulli, S Otte and S Wermter, eds.), Springer, 2021. PDF Christopher Crick, Graylin Jay, Sarah Osentoski, Benjamin Pitzer and Odest Chadwicke Jenkins. Rosbridge. Tracts in Advanced Robotics: Robotics Research (H Christensen and O Khatib, eds.), chapter 29. Springer, 2016. PDF Ronak Etemadpour, Lars Linsen, Jose Gustavo Paiva, Christopher Crick and Angus Forbes. Choosing visualization techniques for multidimensional data projection tasks: A guideline with examples. Computer Vision, Imaging and Computer Graphics: Theory and Applications (A Ranchordas, J Madeiras Pereira, H J Araujo and J Tavares, eds.), chapter 9. Springer, 2016. PDF Journal Articles Chrisantus Eze and Christopher Crick. Learning by watching: a review of video-based learning approaches for robot manipulation. IEEE Access, vol. 13, 2025. PDF Elham Madjidi and Christopher Crick. A survey on neural text generation and degeneration. International Journal of Computational Linguistics (IJCL), vol. 14, no. 2, pp. 19-35, 2023. PDF Russ Messenger, [12 others, including Christopher Crick], and Sabit Ekin. Real-time traffic end-of-queue detection and tracking in UAV video. International Journal of Intelligent Transportation Systems Research, vol. 21, pp. 493-505, October 2023. PDF Yu Li, Hisham Abuella, Md Zobaer Islam, John O'Hara, Christopher Crick and Sabit Ekin. Hand gesture recognition through reflected infrared light wave signals. IEEE Transactions on Human-Machine Systems, vol. 51, no. 1, pp. 44-55, February 2021. PDF Gijs de Boer, [20 others, including Christopher Crick], and Anders Jensen. Data generated during the 2018 LAPSE-RATE campaign: An introduction and overview. Earth Systems Science Data, vol. 12, 2020. PDF Akash Gupta, Tieming Liu and Christopher Crick. Utilizing time series data embedded in electronic health records to develop continuous mortality risk prediction models using hidden Markov models: A sepsis case study. Statistical Methods in Medical Research, June 2020. PDF Gijs de Boer, [33 others, including Christopher Crick], and Jason T Kelly. Development of community, capabilities, and understanding through unmanned aircraft-based atmospheric research. Bulletin of the American Meteorological Society, vol. 101, pp. 684-699, 2020. PDF Lindsay Barbieri, [31 others, including Christopher Crick], and Gijs de Boer. Intercomparison of small unmanned aircraft system (sUAS) measurements for atmospheric science during the LAPSE-RATE campaign. Sensors, vol. 19, 2019. PDF Romit Maulik, Omer San, Jamey D Jacob and Christopher Crick. Sub-grid scale model classification and blending through deep learning. Journal of Fluid Mechanics, vol. 870, pp. 784-812, July 2019. PDF Carolina Bejarano, Christopher Cushing and Christopher Crick. Does context predict psychological states and activity? An ecological momentary assessment pilot study of adolescents. Psychology of Sport and Exercise, vol. 41, pp. 146-152, March 2019. PDF Emily Kieson, Harshal Maske, Charles Abramson, Girish Chowdhary and Christopher Crick. Robots can train humans using principles of operant conditioning through visual reinforcement tools. Journal of Comparative Psychology, vol. 31, 2018. PDF Christopher Cushing, Carolina Bejarano, Tarrah Mitchell, Amy Noser and Christopher Crick. Individual differences in negative affectivity and physical activity in adolescents: An ecological momentary assessment study. Journal of Child and Family Studies, vol. 27, no. 9, pp. 2772-2779, September 2018. PDF Ye Gu, Weihua Sheng, Christopher Crick and Yongsheng Ou. Automated assembly skill acquisition and implementation through human demonstration. Robotics and Autonomous Systems, vol. 99, pp. 1-16, January 2018. PDF Amy E Frazier, Adam J Mathews, Benjamin L Hemingway, Christopher Crick, Elinor Martin and Suzanne W Smith. Integrating small unmanned aircraft systems (sUAS) into meteorology and atmospheric science: Challenges and opportunities for GIScience. Geoinformatics Forum 2017, vol. 2, pp. 189-199, November 2017. PDF Erin Brannon, Christopher Cushing, Ryan Walters, Christopher Crick, Amy Noser and Larry Mullins. Goal feedback from whom? A physical activity intervention using an N-of-1 RCT. Psychology and Health, vol. 33, no. 6, pp. 701-712, 2017. PDF Christopher Cushing, Tarrah Mitchell, Carolina Bejarano, Ryan Walters, Christopher Crick and Amy Noser. Bidirectional associations between psychological states and physical activity in adolescents: An mHealth pilot study. Journal of Pediatric Psychology, vol. 42, no.5, pp. 559-568, June 2017. Finalist for 2017 outstanding article award. PDF Christopher Cushing, Arwen Marker, Carolina Bejarano, Christopher Crick and Lindsay Huffhines. Latent variable mixture modeling of ecological momentary assessment data: Implications for screening and adolescent mood profiles. Journal of Child and Family Studies, vol. 26, no. 6, pp. 1565-1572, June 2017. PDF Erin Brannon, Christopher Cushing, Christopher Crick and Tarrah Mitchell. The promise of wearable sensors and ecological momentary assessment measures for dynamical systems modeling in adolescents: A feasibility and acceptability study. Translational Behavioral Medicine, vol. 6, no. 4, December 2016, pp. 558-565. PDF Sarah Osentoski, Benjamin Pitzer, Christopher Crick, Graylin Jay, Shuonan Dong, Daniel Grollman, Halit Bener Suay and Odest Chadwicke Jenkins. Remote robotic laboratories for learning from demonstration. International Journal for Social Robotics, vol. 4, no. 4, November 2012, pp. 449-461. PDF Christopher Crick and Brian Scassellati. Controlling a robot with intention derived from motion. Topics in Cognitive Science, vol. 2, Jan. 2010, pp. 114-126. PDF Kevin Gold, Marek Doniec, Christopher Crick and Brian Scassellati. Robotic vocabulary building using extension inference and implicit contrast. Artificial Intelligence, vol. 173, no. 1, Jan. 2009. PDF Brian Scassellati, Christopher Crick, Kevin Gold, Elizabeth Kim, Frederick Shic and Ganghua Sun. Social development. IEEE Computational Intelligence Magazine, Vol. 1, Issue 3, Aug. 2006. PDF Christopher Crick and Willard Miranker. Apoptosis, neurogenesis, and information content in Hebbian networks Biological Cybernetics, vol. 94, no. 1, Jan. 2006. PDF Conference Proceedings Chrisantus Eze and Christopher Crick. A3: Active adversarial alignment for source-free domain adaptation. Proceedings of the 23rd International Conference on Machine Learning and Applications (ICMLA), 2024. PDF Elham Madjidi and Christopher Crick. Toward inclusive reading: A neural text generation framework for dyslexia accessibility. Proceedings of the 11th International Conference on Software Development and Technologies for Enancing Accessibility and Fighting Info-exculsion (DSAI), 2024. PDF Habib Boloorchi Tabrizi and Christopher Crick. Brain-inspired visual odometry: Balancing speed and interpretability through a system of systems approach. Proceedings of the ASCE International Conference on Computational Science and Computational Intelligence (CSCI), 2023. PDF Elham Madjidi and Christopher Crick. Enhancing textual accessibility for readers with dyslexia through transfer learning. Proceedings of the 25th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS), 2023. PDF Chrisantus Eze and Christopher Crick. Enhancing human-robot collaboration by exploring intuitive augmented reality design representations. Proceedings of the 18th ACM/IEEE International Conference on Human-Robot Interaction (HRI), 2023. PDF Avinash Gupta, Joe Cecil, Rittika Shamsuddin, Sheila Kennison and Christopher Crick. An investigation into the role of affordance in the design of extended reality based environments for surgical training. Proceedings of the IEEE International Systems Conference (SysCon), 2022. PDF Kyungho Nam and Christopher Crick. Self-trainable 3D-printed prosthetic hands. Proceedings of the 30th IEEE International Conference on Robotic and Human Interactive Communication (RO-MAN), 2021. PDF Reza Marzban, Johnson Thomas and Christopher Crick. Targeting the most important words across the entire corpus in NLP adversarial attacks. Proceedings of the 20th International Conference on Artificial Intelligence and Soft Computing (ICAISC), 2021. PDF Reza Marzban and Christopher Crick. Interpreting convolutional networks trained on textual data. Proceedings of the 10th International Conference on Pattern Recognition Applications and Methods (ICPRAM), 2021. PDF Reza Marzban and Christopher Crick. Lifting sequence length limitations of NLP models using autoencoders. Proceedings of the 10th International Conference on Pattern Recognition Applications and Methods (ICPRAM), 2021. PDF S M al Mahi, Kyungho Nam and Christopher Crick. Distributed heterogenous robot-human teams. Proceedings of the International Conference on Autonomous Agents and Multiagent Systems (AAMAS), 2019. PDF Sayanti Roy, Emily Kieson, Charles Abr",
  "content_length": 19084,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:06"
}