{
  "name": "Christopher M. Danforth",
  "homepage": "http://www.uvm.edu/~cdanfort",
  "status": "success",
  "content": "Chris Danforth Research Lived Experiences Measured Using Rings Study (LEMURS)Science of Online Corpora, Knowledge, and Stories (SOCKS)Recent funding from NSF for science, MRI for GPUs and RAM, & MassMutual“Inside the lab that’s quantifying happiness”Profile of our research group in Outside MagazineResearch team & group publications \"The war in Ukraine has made Russian social-media users glum\" The Economist“Is Everybody Doing … OK? Let’s Ask Social Media”Story on Hedonometer in New York Times“Has Twitter just had its saddest fortnight ever?”Story on Hedonometer in Nature\"Storywrangler: A massive exploratorium for sociolinguistic, cultural, socioeconomic, and political timelines using Twitter\" Paper in Science Advances“Instagram photos reveal predictive markers of depression”Paper in EPJ Data Science, coverage by New York Times“The emotional arcs of stories are dominated by six basic shapes” Paper in EPJ Data Science, coverage by The Atlantic“Human language reveals a universal positivity bias” Paper in PNAS, coverage by New York Times Hedonometer: a population scale measure of daily happiness StoryWrangler: A visual comparison of phrase popularity in 150 billion tweets Recent Publications 132. Archetypometrics, a Pragmateia: Empirical Determination of the Fundamental Archetypes of Fictional Characters.P. S. Dodds, J. W. Zimmerman, C. G. Beauregard, A. M. Fehr, M. Fudolig, T. Tangherlini, C. M. Danforth.In Review. 2025. [pdf (1.6GB)] [arXiv] 131. Sensitivity analysis of epidemic forecasting and spreading on networks with probability generating functions.M. C. Boudreau, W. H. W. Thompson, C. M. Danforth, J.-G. Young, L. Hébert-DufresneJournal of the Royal Society Interface. In Press. 2025. [pdf] [arXiv] 130. A suite of allotaxonometric tools for the comparison of complex systems using rank-turbulence divergence.J. St-Onge, A. M. A. Fehr, C. Ward, C. G. Beauregard, M. V. Arnold, S. F. Rosenblatt, B. Cooley, C. M. Danforth, P. S. DoddsIn Review. 2025. [pdf] [arXiv] [online appendix] 129. Tokens, the oft-overlooked appetizer: Large language models, the distributional hypothesis, and meaning.J. W. Zimmerman, D. Hudon, K. Cramer, A. J. Ruiz, C. Beauregard, A. Fehr, M. I. Fudolig, B. Demarest, Y. M. Bird, M. Z. Trujillo, C. M. Danforth, P. S. DoddsIn Review. 2025.[pdf] [arXiv] 128. Story and essential meaning dynamics in Bangladesh’s July 2024 Student-People’s Uprising.T. T. Prama, C. M. Danforth, P. S. Dodds.In Review. 2025.[pdf] [arXiv] 127. BanglaMATH: A Bangla benchmark dataset for testing LLM mathematical reasoning at grades 6, 7, and 8.T. T. Prama, C. M. Danforth, P. S. Dodds.In Review. 2025.[pdf] [arXiv] 126. Detecting sub-populations in online health communities: A mixed-methods exploration of breastfeeding messages in BabyCenter Birth Clubs.C. Beauregard, P. Suchdev, A. M. A. Fehr, I. T. Smith, T. T. Prama, J. W. Zimmerman, C. Ward, J. Lovato, C. M. Danforth, P. S. Dodds.In Review. 2025.[pdf] [arXiv] 125. Hollywood’s misrepresentation of death: A comparison of overall and by-gender mortality causes in film and the real world.C. Beauregard, C. M. Danforth, P. S. Dodds.Journal of Medical Internet Research (JMIR) Formative Research. 2025.[pdf] [arXiv] [journal url] 124. Ousiometrics: Essential meaning aligns with aPower–Danger–Structure framework instead of Valence–Arousal–Dominance, and diversecorpora reveal a universal safety bias.P. S. Dodds, T. Alshaabi, M. I. Fudolig, J. W. Zimmerman, J. Lovato, S. Beaulieu, J. R. Minot, M. V. Arnold, A. J. Reagan, C. M. Danforth.In Review. 2025.[pdf] [arXiv] [online appendix] [thread] 123. A quantitative analysis of the affirmative furtherance of fair housing in the Housing Choice Voucher program.Y. M. Bird, A. Fehr, J. W. Zimmerman, M. I. Fudolig, S. E. Grobe, M. V. Arnold, C. M. Danforth, P. S. Dodds.In Review. 2025.[pdf] [arXiv] 122. An assessment of measuring local levels of homelessness through proxy social media signals.Y. M. Bird, S. E. Grobe, M. V. Arnold, S. P. Rogers, M. I. Fudolig, J. W. Zimmerman, C. M. Danforth, P. S. Dodds.International Journal on Homelessness. 2025.[pdf] [arXiv] [journal url] [thread] [press] 121. Aim High, Stay Private: Differentially Private Synthetic Data Enables Public Release of Behavioral Health Information with High Utility.M. Ghasemizade, J. Lovato, C. M. Danforth, P. S. Dodds, L. S. P. Bloomfield, M. Price, Team LEMURS, J. P. Near.In Review. 2025.[pdf] [arXiv] 120. Collective sleep and activity patterns of college students from wearable devices.M. I. Fudolig, L. S. P. Bloomfield, M. Price, Y. M. Bird, J. E. Hidalgo, J. Kim, J. Llorin, J. L. Lovato, E. W. McGinnis, R. S. McGinnis, T. H. Ricketts, K. Stanton, P. S. Dodds, C. M. Danforth.npj Complexity. 2025.[pdf] [arXiv] [journal url] 119. Spatial Patterns and Temporal Trends of Nature Exposure in a College Student Cohort. L. S. P. Bloomfield, S. Lombardo, M. Price, T. H. Ricketts, C. M. Danforth. In Review. 2025.[pdf] [arXiv] 118. Not All Nature Exposure Is Equal: Perceived Nature Engagement Predicts Mental Health Better Than Quantified Nature. L. S. P. Bloomfield, S. Lombardo, M. Price, T. H. Ricketts, C. M. Danforth. In Review. 2025.[pdf] [arXiv] 117. Effects of behavioral interventions on psychological and biometric measures of well-being in young adults: results of a 14-week, four-arm, randomized, controlled trial. L. S. P. Bloomfield, M. I. Fudolig, J. Kim, J. Llorin, J. L. Lovato, E. W. McGinnis, R. S. McGinnis, M. Price, T. H. Ricketts, P. S. Dodds, K. Stanton, C. M. Danforth. In Review. 2025.[pdf] [arXiv] 116. Discovering Digital Biomarkers of Panic Attack Risk in Consumer Wearables Data.E. W. McGinnis, S. Lunna, I. Berman, B. Loftness, S. Bagdon, C. M. Danforth, M. Price, W. E. Copeland, R. S. McGinnis.In Review. 2025.[pdf] [arXiv] 115. A blind spot for large language models: Supradiegetic linguistic information.J. W. Zimmerman, D. Hudon, K. Cramer, J. St. Onge, M. Fudolig, M. V. Arnold, M. Z. Trujillo, C. M. Danforth, P. S. Dodds.Plutonics. 2024.[pdf] [arXiv] [journal url] 114. Expecting the Unexpected: Predicting Panic Attacks from Mood, Twitter, and Apple Watch Data.E. W. McGinnis, S. Lunna, I. Berman, S. Bagdon, G. Lewis, M. V. Arnold, C. M. Danforth, P. S. Dodds, M. Price, W. E. Copeland, R. S. McGinnis.IEEE Open Journal of Engineering in Medicine and Biology. 2024.[pdf] [arXiv] [journal url] [press] [thread] 113. Meeting people where they are: Crowdsourcing goal-specific personalized wellness practices. J. E. Hidalgo, J. Kim, J. Llorin, K. Stanton, J. Cherian, L. Bloomfield, M. Fudolig, M. Price, J. Ha, N. Noble, C. M. Danforth, P. S. Dodds, J. Fanning, R. S. McGinnis, E. W. McGinnis. PLOS Digital Health. 2024.[pdf] [journal url] 112. Predicting stress in college freshmen using sleep data from wearable devices. L. S. P. Bloomfield, M. I. Fudolig, P. S. Dodds, J. Llorin, J. L. Lovato, J. Kim, E. W. McGinnis, R. S. McGinnis, M. Price, T. H. Ricketts, K. Stanton, C. M. Danforth. PLOS Digital Health. 2024.[pdf] [arXiv] [journal url] [press] 111. Predictors of Anxiety Trajectories in First-year College Students.L. S. P. Bloomfield, M. I. Fudolig, J. Kim, J. Llorin, J. L. Lovato, E. W. McGinnis, R. S. McGinnis, M. Price, T. H. Ricketts, P. S. Dodds, K. Stanton, C. M. Danforth.Journal of the American Academy of Child and Adolescent Psychiatry Open (JAACAP Open). 2024.[pdf] [arXiv] [journal url] 110. The two fundamental shapes of sleep heart rate dynamics and their connection to mental health in college students. M. I. Fudolig, L. S. P. Bloomfield, M. Price, Y. M. Bird, J. E. Hidalgo, J. Kim, J. Llorin, J. L. Lovato, E. W. McGinnis, R. S. McGinnis, T. H. Ricketts, K. Stanton, P. S. Dodds, C. M. Danforth.Digital Biomarkers. 2024.[pdf] [arXiv] [journal url] 109. A Large Clinical Trial to Measure Well-Being During the Transition to College Using Wearables: The Lived Experiences Measured Using Rings Study.M. Price, J. E. Hidalgo, Y. Bird, L. S. P. Bloomfield, C. Buck, J. Cerutti, P. S. Dodds, M. I. Fudolig, R. Gehman, M. Hickok, J. Kim, J. Llorin, J. Lovato, E. McGinnis, R. S. McGinnis, R. Norton, V. Ramirez, K. Stanton, T. H. Ricketts, C. M. Danforth.Contemporary Clinical Trials. 2023.[pdf] [journal url] [press] 108. A decomposition of book structure through ousiometric fluctuations in cumulative word-time.M. Fudolig, T. Alshaabi, K. Cramer, C. M. Danforth, P. S. Dodds.Humanities and Social Sciences Communications. 2023.[pdf] [journal url] [arxiv] [thread] 107. Nature Exposure is Associated With Reduced Smartphone Use.K. Minor, K. L. Glavind, A. J. Schwartz, C. M. Danforth, S. Lehmann, A. Bjerre-Nielsen.Environment and Behavior. 2023.[pdf] [journal url] [thread] [press] 106. Say Their Names: Resurgence in the collective attention toward Black victims of fatal police violence following the death of George Floyd.H. H. Wu, R. J. Gallagher, T. Alshaabi, J. L. Adams, J. R. Minot, M. V. Arnold, B. F. Welles, R. Harp, P. S. Dodds, C. M. Danforth.PLOS ONE. 2023.[pdf] [journal url] [arXiv] [thread] 105. Allotaxonometry and rank-turbulence divergence:A universal instrument for comparing complex systems.P. S. Dodds, J. R. Minot, M. V. Arnold, T. Alshaabi, J. L. Adams, D. R. Dewhurst, T. J. Gray, M. R. Frank, A. J. Reagan, C. M. Danforth.EPJ Data Science. 2023.[pdf] [arXiv] [journal url] [online appendix] [code] [thread] 104. Computational Paremiology: Charting the temporal, ecological dynamics of proverb use in books, news articles, and tweets.E. Davis, C. M. Danforth, W. Mieder, P. S. Dodds.Digital Humanities Quarterly. 2023.[pdf] [arXiv] [journal url] 103. Twitter misogyny associated with Hillary Clinton increased throughout the 2016 U.S. election campaign.M. Weaving, T. Alshaabi, M. V. Arnold, K. Blake, C. M. Danforth, P. S. Dodds, N. Haslam, C. Fine.Scientific Reports. 2023.[pdf] [journal url] [thread] 102. Sentiment analysis of medical record notes for lung cancer patients at the Department of Veterans Affairs.D. Elbers, J. La, J. R Minot, R. E. Gramling, M. T. Brophy, N. V. Do, N. Fill",
  "content_length": 12858,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:21"
}