{
  "name": "Christopher Torng",
  "homepage": "https://ctorng.com",
  "status": "success",
  "content": "Christopher Torng Christopher Torng Home Christopher Torng Assistant Professor Department of Electrical and Computer Engineering Department of Computer Science University of Southern California ctorng [at] usc [.] edu [ Google Scholar ] I am an Assistant Professor in the Department of Electrical and Computer Engineering (ECE) and in the Department of Computer Science by courtesy (CS) at USC, where I lead the Acorn Research Group. Previously, I was a postdoctoral researcher at Stanford University working with Mark Horowitz in the Stanford AHA Agile Hardware Project. During my PhD, I was advised by Christopher Batten at Cornell University. Research My research interests are in the area of computer architecture with an emphasis on domain-specific hardware accelerators, software/hardware co-design, agile chip development methodologies, and rapid chip prototyping. You can look at the Acorn Research Group page to see what I am currently working on! Academic Appointments University of Southern California, Los Angeles, CA 2023 - present Assistant Professor of Electrical and Computer Engineering Stanford University, Stanford, CA 2019 - 2022 Postdoctoral Researcher in Electrical Engineering Advisor: Mark Horowitz Education Cornell University, Ithaca, NY 2012 - 2019 PhD in Electrical and Computer Engineering Advisor: Christopher Batten Thesis: Software, Architecture, and VLSI Co-Design for Fine-Grain Voltage and Frequency Scaling Cornell University, Ithaca, NY 2008 - 2012 BS in Electrical and Computer Engineering Teaching USC EE 599: Special Topic on Complex Digital ASIC System Design Fall 2023 Instructor USC EE 557: Computer Systems Architecture Spring 2023 Instructor Stanford EE 272: Design Projects in VLSI Systems Winter 2020 Co-Instructor Cornell ECE 2400 / ENGRD 2140 Computer Systems Programming Fall 2017 Lead Graduate Teaching Assistant Cornell ECE 4750 / CS 4420 Computer Architecture Fall 2014 Lead Graduate Teaching Assistant Cornell CURIE Academy Summer 2014 Lead Graduate Teaching Assistant Educational outreach program for high school girls focusing on exploring STEM fields and taking a deeper dive into computer engineering Cornell ENGRG 1060 Exploration in Engineering Seminar Summer 2013 Graduate Teaching Assistant Educational outreach targeted at introducing high school students to STEM fields through an Arduino-based robotics lab Cornell ECE 4750 / CS 4420 Computer Architecture Fall 2011 Undergraduate Teaching Assistant Tutorials and Workshops Workshop on Democratizing Domain-Specific Accelerators Yufei Ding, Christopher Torng, Po-An Tsai, Hung-Wei Tseng 56th IEEE/ACM International Symposium on Microarchitecture (MICRO), October 2023 Workshop on Democratizing Domain-Specific Accelerators Yufei Ding, Christopher Torng, Po-An Tsai, Hung-Wei Tseng 55th IEEE/ACM International Symposium on Microarchitecture (MICRO), October 2022 PyMTL: A Python-Based Framework for Hardware Generation, Simulation, and Verification Christopher Batten, Shunning Jiang, Christopher Torng, Yanghui Ou, Peitian Pan ACM/IEEE International Symposium on Computer Architecture (ISCA), June 2019 Service Program Committees International Symposium on Computer Architecture (ISCA)2023 - 2024 International Symposium on Microarchitecture (MICRO)2020 - 2023 International Symposium on High-Performance Computer Architecture (HPCA)2024 IEEE Transactions on Computers (TC)2022 ACM Transactions on Architecture and Code Optimization (TACO)2021 IEEE MICRO2020 IEEE Transactions on Circuits and Systems (TCAS)2016 External Review Committees International Symposium on Computer Architecture (ISCA)2022 International Symposium on High-Performance Computer Architecture (HPCA)2021 Organizing Committees Workshop on Democratizing Domain-Specific Accelerators (WDDSA)2023 Co-Organizer, co-located at MICRO Workshop on Democratizing Domain-Specific Accelerators (WDDSA)2022 Co-Organizer, co-located at MICRO © 2023 Christopher Torng. Hosted by GitHub Pages.",
  "content_length": 3963,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:32"
}