{
  "name": "Christoph Csallner",
  "homepage": "http://ranger.uta.edu/~csallner",
  "status": "success",
  "content": "Christoph Csallner Christoph Csallner Professor Computer Science and Engineering Department, University of Texas at Arlington Box 19015, Arlington, TX 76019-0015, USA csallner@uta.edu, ERB 554 (office), ERB 513 (SERC lab) Bio: Christoph Csallner is a Professor in the Computer Science and Engineering Department at the University of Texas at Arlington (UTA). Before joining UTA, Dr. Csallner worked for Google and Microsoft Research. He graduated with a Diplom-Informatiker degree from Universit채t Stuttgart, Germany, and with an M.S. and a Ph.D., both in Computer Science, from Georgia Tech. Dr. Csallner has broad research interests in software engineering and related areas. Currently he is working on problems in program analysis, automated bug finding, and mobile software engineering. Dr. Csallner's work has received several best paper awards and distinguished paper awards, including at the IEEE International Symposium on Software Reliability Engineering (ISSRE) in 2010, at the ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA) in 2006 and 2012, at the Program Protection and Reverse Engineering Workshop (PPREW) in 2014, and at the IEEE/ACM International Conference on Automated Software Engineering (ASE) in 2007 and 2015. Dr. Csallner's research has been funded in part by MathWorks and the National Science Foundation. Service Current: PeerJ CS, ATVA 2025, CheckMATE 2025. Distinguished Referee / Distinguished Reviewer Awards: ASE 2019, TOSEM 2011--2012. Board of Distinguished Reviewers: TOSEM. Publications and citations DBLP and Google Scholar. Best Paper Awards: PPREW-4, ISSRE 2010, ASE 2007. ACM SIGSOFT Distinguished Paper Awards: ASE 2015, ISSTA 2012, ISSTA 2006. Funding Alzheimer's Association; MathWorks; NSF; Texas National Security Network (coverage: Dallas Morning News, NBC DFW, WBAP/KLIF); W. W. Caruth, Jr. Fund. Teaching CSE 3311 Object-Oriented Software Engineering (most recently: Fall 2025) CSE 6324 Advanced Topics in Software Engineering (most recently: Fall 2023) Software JCrasher, Check 'n' Crash, DSD-Crasher, Pex/DySy, Dsc, REMAUI/Pixel to App Current students Tennov Simanjuntak Sabrina Haque Mohammad Rifat Arefin B.S. / M.S. alumni Kyle Henry (Senior Fit project prototype demo), W.E. Kevin Yanogo, Nagendra Prasad Kasaghatta Ramachandra (VCAT project demo: YouTube), S체meyye S체sl체, Shivangi Kulshrestha, Siva Natarajan Balasubramania, Adis Kovacevic, Asheq Hamid, Tuan Anh Nguyen. Ph.D. alumni Sohil L. Shrestha (now: Research Scientist at Meta) Soumik Mohian (now: Senior Software Engineer at BNSF Railway) Shafiul Azam Chowdhury (now: Staff Machine Learning Engineer at Meta) Shabnam Aboughadareh (coverage: KERA, now: Software Engineer at a startup) Tuan Anh Nguyen (now: Senior Staff Software Engineer at Google DeepMind) Mainul Islam (Ex-Software Engineer at Amazon, Google, Intel) Ishtiaque Hussain (now: Senior Software Engineer in Test at Bloomberg) Tuli Nivas (now: Software Engineering Architect at Salesforce) Recent Work Fast deterministic black-box context-free grammar inference. Proc. 46th IEEE/ACM International Conference on Software Engineering (ICSE), 2024. (GitHub, Docker) TreeVada is the first black-box approach that quickly infers a high-quality context-free grammar from sample programs. TreeVada starts with a few given valid sample programs of some language L, where the language may be a programming language that is not widely used. To decide if a program is valid, TreeVada uses a parser (or compiler) for L as a black-box, as the parser may run on a remote machine and cannot be instrumented. D2S2: Drag 'n' drop mobile app screen search. Proc. 31st ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE), Demonstrations Track, 2023. (search engine, GitHub, YouTube) D2S2 (http://pixeltoapp.com/D2S2) is the first interactive drag-and-drop search engine for mobile app screenshots. D2S2 encodes text queries and the location, size, and icon type of the icons a user dragged on D2S2's UI. In a preliminary experiment D2S2 produced significantly more relevant search results than Google Image Search. ScoutSL: An open-source Simulink search engine. Proc. 26th ACM/IEEE International Conference on Model Driven Engineering Languages and Systems (MODELS), Tools and Demonstrations Track, 2023. (search engine, survey responses, source code, YouTube) ScoutSL (http://scoutsl.net) is a web-based Simulink search engine. Users can search via free-form Google-style keywords and via Simulink model and project metrics (such as models' cyclomatic complexity or the number of GitHub pull requests) in 100k open-source Simulink models from 18k GitHub and MATLAB Central projects. EvoSL: A large open-source corpus of changes in Simulink models & projects. Proc. 26th ACM/IEEE International Conference on Model Driven Engineering Languages and Systems (MODELS), 2023. (dataset, tool) EvoSL is the first large redistributable corpus of open-source Simulink models that contains project change histories. EvoSL contains 924 Git repositories from GitHub with their 3k issues, 2k pull requests, 10k comments, and over 100k commits. On a EvoSL subset we replicate a recent Simulink model change study carried out on a closed-source industrial project. Replicability study: Corpora for understanding Simulink models & projects. Proc. 17th ACM/IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM), 2023. (dataset, tool) To address reproducibility issues, we re-collect two corpora of open-source Simulink models and compare them with the largest known corpus (SLNET). On SLNET we replicate earlier studies and find, among others, that cyclomatic complexity of Simulink models does not seem to be strongly correlated with other model metrics. Open-source Simulink Datasets SLNET: A redistributable corpus of 3rd-party Simulink models. Proc. 19th International Conference on Mining Software Repositories (MSR), Data and Tool Showcase Track, 2022. (dataset, metrics tool, mining tool, YouTube) SLNET contains 9,117 third-party Simulink models from 2,837 open-source projects from GitHub and MATLAB Central that are licensed for re-distribution. A curated corpus of Simulink models for model-based empirical studies. Proc. 4th International Workshop on Software Engineering for Smart Cyber-Physical Systems (SEsCPS), 2018. (bib, doi, tool, slides) This paper presents a corpus of over 1,000 freely available MathWorks Simulink models. Mobile Software Engineering PSDoodle: Fast app screen search via partial screen doodle. Proc. 9th IEEE/ACM International Conference on Mobile Software Engineering and Systems (MOBILESoft), 2022. (search engine, GitHub, YouTube: 90 seconds, 15 minutes) Existing screen search tools are either keyword-based (Google Image Search) or require the user to produce a sketch of a complete screen. PSDoodle (http://pixeltoapp.com/PSDoodle) is the first tool to allow interactive screen search via interactive freehand sketching. PSDoodle: Searching for app screens via interactive sketching. Proc. 9th IEEE/ACM International Conference on Mobile Software Engineering and Systems (MOBILESoft), Tool Demos and Mobile Apps Track, 2022. (tool, GitHub, YouTube: 90 seconds, 10 minutes) This paper adds details on PSDoodle's architecture, deployment, and evaluation. Doodle2App: Native app code by freehand UI sketching. Proc. 7th IEEE/ACM International Conference on Mobile Software Engineering and Systems (MOBILESoft), Tool Demos and Mobile Apps Track, 2020. (tool, slides) We trained Doodle2App (http://pixeltoapp.com/doodle) on thousands of (manually created) freehand sketches of 20 common Android UI elements. The resulting website allows users to sketch an Android screen. The website then converts the sketched screen to Android code that is ready to compile and run on stock Android phones. In technical terms: We pre-trained a classifier on 2 million Google \"Quick, Draw!\" sketches and retrained the classifier on thousands of sketches collected via Amazon Mechanical Turk. In some sense the resulting tool is a modern version of SILK (\"Sketching Interfaces Like Krazy\"). SPEjs: A symbolic partial evaluator for JavaScript. Proc. 1st International Workshop on Advances in Mobile App Analysis (A-Mobile), 2018. (bib, doi, tool, slides) The partial evaluator SPEjs implements a symbolic execution engine for JavaScript and uses Z3 to resolve the feasibility of program execution paths. SPEjs removes some dead branches that the state-of-the-art partial evaluator Prepack from Facebook so far cannot remove. P2A: A tool for converting pixels to animated mobile application user interfaces. Proc. 5th IEEE/ACM International Conference on Mobile Software Engineering and Systems (MOBILESoft), 2018. (bib, doi, slides) P2A takes as input a set of screen design bitmaps (e.g., screenshots of an Android or iPhone app) and converts them to native app code (i.e., for Android), complete with inter-screen transitions and in-screen animations. P2A is implemented on top of REMAUI. Reverse engineering mobile application user interfaces with REMAUI. Proc. 30th IEEE/ACM International Conference on Automated Software Engineering (ASE), 2015. (bib, doi, slides, award) When developing a mobile app (e.g., for Android or iOS), a graphic designer typically designs the app's screens and hands them to a programmer, who manually recreates the screen designs in source code. REMAUI is the first technique for automating this process end-to-end, from design drawings or screenshots to working UI code that can be compiled and run on a mobile device. Received an ACM SIGSOFT Distinguished Paper Award. GROPG: A graphical on-phone debugger. Proc. 35th ACM/IEEE International Conference on Software Engineering (ICSE), New Ideas and Emerging Results (NIER) track, 2013. (bib, doi, slides, poster) GROPG is the first graphical on-phone debugger. Developers can use GROPG to debug Android phone applications dir",
  "content_length": 32370,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:45"
}