{
  "name": "Chris Bartone",
  "homepage": "https://www.ohio.edu/engineering/about/people/profiles.cfm?profile=bartone",
  "status": "success",
  "content": "Chris Bartone | Ohio University Skip to main content Chris Bartone Edmund K. Cheng Professor Stocker Center 349 Avionics Engineering Center Electrical Engineering and Computer Science bartone@ohio.edu 740.593.9573 Prior to joining Ohio University as a professor, Chris Bartone worked for the Naval Air Warfare Center-Aircraft Division from 1983-1998, where he performed research, development, test and evaluation on communication, navigation, and surveillance (CNS) systems. He is a member of the Institute of Navigation, the Institute of Electrical and Electronics Engineers, and the Association of Old Crows.Research Interests: electrical engineering and computer science, electronic navigation system, GPS augmentation, electromagnetic wave propagation and antennasAll Degrees Earned: Ph.D., Electrical Engineering, Ohio University, 1998; M.S., Electrical Engineering, Naval Postgraduate School; B.S., Electrical Engineering, Pennsylania State UniversityAwards:Fellow of The Institute of Navigation (ION), awarded on January 31, 2019Recipient of the Captain P.V.H. Weems Award, sponsored by The Institute of Navigation in recognition of continuing contributions to the art and science of navigation, awarded on January 31, 2019Recipient of William E. Jackson Award by the RTCA, “Ranging Airport Pseudolite for Local Area Augmentation Using the Global Positioning System,” awarded on September 30, 1998Professional Engineer (PE), State of Ohio, Registration Number PE 66926, since June 2002 Journal Article, Academic Journal (10)Dickman, J., Zhen, Z., Bartone, C. (2009). Carrier Phase Multipath Error Characterization and Reduction in Single Aircraft Relative Navigation. GPS Solutions Journal, Springer-Verlag.Dickman, J., Bartone, C. (2007). Smoothing GPS carrier phase double differences using inertial measurements for high performance applications. 2. GPS Solutions Journal, Springer-Verlag; 12: 119-133.Zhang, Y., Bartone, C. (2005). A Real-time MET-based Hopfield Troposphere Correction with Integrity Bound for Long Baseline DGPS. 4. GPS Solutions Journal, Springer-Verlag; 9: 256-272.Bartone, C., Zhang, Y. (2005). A General Concept and Algorithm of Projected DGPS for High Accuracy DGPS Based Systems. 4. NAVIGATION Journal of The Institute of Navigation; 51: 293-309.Bartone, C., Kiran, S. (2004). Verification and Mitigation of the Power-Induced Measurement Errors for Airport Pseudolites in LAAS. 4. GPS Solutions Journal, Springer-Verlag; 7: 241-252.Kiran, S., Bartone, C. (2004). Flight-Test Results of an Integrated Wideband-Only Airport Pseudolite For The Category II/III Local Area Augmentation System. 1. Institute of Electrical and Electronics Engineers, Transactions on Aerospace and Electronics Systems; 40: 734-741.Thornberg, D., Thornberg, D., DiBenedetto, M., Braasch, M., Van Graas, F., Bartone, C. (2003). The LAAS Integrated Multipath Limiting Antenna (IMLA). 2. Journal of the Institute of Navigation; 50.Slivinsky, S., Nesbit, C., Bartone, C., Phillips, R., Roxrode, R. (2002). Development and Demonstration of a Ballistic Missile Range Safety Technology System. 2. NAVIGATION Journal of The Institute of Navigation; 49: 91-102.Bartone, C., Kiran, S. (2001). Flight-Test Results of an Integrated Wideband-Only Airport Pseudolite for the Category II/III Local Area Augmentation System. 1. NAVIGATION Journal of The, Institute of Navigation; 48: 35-48.Bartone, C., Van Graas, F. (2000). Airport Pseudolite for Local Area Augmentation. 1. Institute of Electrical and Electronics Engineers, Transactions on Aerospace and Electronics Systems; 36: 278-286.Journal Article, Professional Journal (3)Bartone, C. (2022). Prototype Collision-Avoidance System for Small Multirotor Unmanned Aircraft at Low Altitude. 12. Journal of Aerospace Information Systems (JAIS); 19: https://doi.org/10.2514/1.I011158 .Bartone, C. (2018). High-efficiency Water-loaded Microwave Antenna in Ultra-high Frequency Band. 11. Applied Physics Letters; 112: http://doi.org/10.1063/1.5023237.Bartone, C., Vogelhuber, T., Fleming, G., Moore, L., Haggerty, M., Hanlon, P. (2017). Prize-Winning Ohio University Students Present Their Work on an Antenna for Body Area Networks. 1. IEEE Antenna and Propagation Magazine; 59: 116-126. http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=7839323.Patent (18)Bartone, C., Lele, K. Multi-band and Wideband High Impedance Surface with Wideband Antenna Configuration.Bartone, C., Lele, K. WIDEBAND HIGH IMPEDANCE SUBSTRATE WITH WIDEBAND ANTENNA CONFIGURATION.Bartone, C., Milluzzi, A. System and Method for Detection and Reporting of Targets with Data Links. US 11,531099 B2.Bartone, C. SINGLE ELEMENT ANTENNA BEAM CONTROL. US Patent No. 10,770,794.Bartone, C., Drummond, C., Milluzzi, A. System and Method for Detection and Reporting of Targets with Data Links. PCT/US2018/014877, PCT publication number: WO/2018/136947, July 26, 2018.Bartone, C. A Terrestrial Positioning and Timing System (TPTS)-US. US 9,851,429.Bartone, C. SINGLE ELEMENT ANTENNA BEAM CONTROL. US National State Application from PCT WO2016190907.Bartone, C., Drummond, C. SYSTEM AND METHOD FOR DETECTION AND REPORTING OF TARGETS WITH DATA LINKS. OHI2481-017.Bartone, C. A Terrestrial Positioning and Timing System (TPTS)-US. US 9,429,639 B2.Bartone, C. A Terrestrial Positioning and Timing System (TPTS)-US. PatApp2481-007E.Bartone, C. BROADBAND FLEXIBLE ANTENNA. ProvApp2481-014.Zhu, J., Wilhelm, J., Williams II, R., Uijt de Haag, M., Bartone, C., Liu, J., Chelberg, D., Liu, C., DiBenedetto, M. An Integrated, Scalable All-Weather, All-Terrain, All-Time, Autonomous Perimeter Monitoring and Ground Inspection System, Provisional patent application. OU16018.Bartone, C. SINGLE-ELEMENT PATCH ANTENNA WITH PATTERN CONTROL. PCT-Pub. No.: WO/2016/190907, Publication Date: 01.12.2016, International Application No.: PCT/US2016/014128, International Filing Date: 02.01.2016..Bartone, C. A Terrestrial Positioning and Timing System (TPTS)-PCT. Utility Patent App. 2481-007.Bartone, C. A Terrestrial Positioning and Timing System (TPTS)-US. US 2013/0293421 Al.Bartone, C. A GLOBAL NAVIGATION SATELLITE SYSTEMS ANTENNA. PCT App 2481-006.Bartone, C. 1.\tA Terrestrial Positioning and Timing System (TPTS). Prov. App. OU-12020P.Bartone, C. A Multi-Circular Ring Controlled Receiption Pattern Antenna for Robust GNSS.Book, Textbook (3)Mohinder, G., Angus, A., Bartone, C. (2020). GNSS, Inertial Navigation, and Integration. Fourth. Hoboken, NY: John Wiley & Sons, Inc.; 568. https://www.wiley.com/en-us/Global+Navigation+Satellite+Systems%2C+Inertial+Navigation%2C+and+Integration%2C+4th+Edition-p-9781119547839.Grewal, M., Angus, A., Bartone, C. (2020). GNSS, Inertial Navigation, and Integration. Third. Hoboken, NY: John Wiley & Sons, Inc.; 568. https://www.wiley.com/en-us/Global+Navigation+Satellite+Systems%2C+Inertial+Navigation%2C+and+Integration%2C+4th+Edition-p-9781119547839.Bartone, C. (2016). GNSS, Inertial Navigation, and Integration-Chinese Edition. 3rd Edition. Publishing House of Electronic Industry; 561. http://www.phei.com.cn/module/goods/wssd_content.jsp?bookid=44714.Conference Proceeding (58)Qin, X., Song, S., Brengman, J., Bartone, C., Liu, J. (2024). Robust FOD Detection using Frame Sequence-based DEtection TRansformer (DETR). Singapore : 2024 IEEE Conference on Artificial Intelligence (CAI’24).Lele, K., Bartone, C. (2024). Progressive Ultra-Wideband Circularly Periodic High Impedance Surface Integrated with a Spiral Antenna. Glasgow, United Kingdom/IEEE : Institute of Electrical and Electronic Engineers, 2024 18th European Conference on Antennas and Propagation (EuCAP); 3950-3954.Lele, K., Bartone, C. (2024). Contiguous Broadband Circularly Periodic Progressive High Impedance Surface Integrated with a Spiral Antenna. Glasgow, United Kingdom/IEEE : Institute of Electrical and Electronic Engineers, 2024 18th European Conference on Antennas and Propagation (EuCAP); 598-602.Lele, K., Bartone, C. (2024). Circularly Periodic Progressive Multi-Band High Impedance Surface Integrated with a Wideband Spiral Antenna for GNSS Applications. Long Beach, CA: Institute of Navigation International Technical Conference; 987-997. https://doi.org/10.33012/2024.19552.Song, S., Qin, X., Brengman, J., Bartone, C., Liu, J. (2023). Holistic FOD Detection Via Surface Map and Yolo Networks. 2023 IEEE 33rd International Workshop on Machine Learning for Signal Processing (MLSP); 1-6. https://ieeexplore-ieee-org.proxy.library.ohio.edu/document/10285910 .Parkinson, B., Bartone, C. (2023). Enhancements Enabled by Multi-Element Antennas for GPS Anti-jamming Capabilities in Civil Applications. Proceedings of the 36th International Technical Meeting of the Satellite Division of The Institute of Navigation (ION GNSS+ 2023); 3731 - 3743.Bartone, C., Parkinson, B., Stansell, T. (2023). Multi-Circular Ring CRPA with Robust GNSS Performance for Civil Applications. Proceedings of the 36th International Technical Meeting of the Satellite Division of The Institute of Navigation (ION GNSS+ 2023); 3709 - 3730.Lele, K., Bartone, C. (2023). A Circularly Periodic Multi-band High-Impedance Surface Integrated with a Spiral Antenna. 2023 IEEE International Symposium on Antennas and Propagation and USNC-URSI Radio Science Meeting (USNC-URSI); https://ieeexplore.ieee.org/document/10238084.Hahn, E., Gunawardena, S., Bartone, C. (2023). Live-Sky GNSS Signal Processing Using a Dual-Polarized Antenna Array for Multipath Mitigation. Proceedings of the 2023 International Technical Meeting of The Institute of Navigation; 286-302.Bartone, C., Hahn, E., Gunawardena, S. (2022). GNSS Antenna Array Calibration for Spatial and Polarization Domain Based Multipath Mitigation. Proceedings of the 2022 International Technical Meeting of The Institute of Navigation; 96-111.Hahn, E., Gunawardena, S., Bartone, C. (2021). Simultaneous Exploitation of Time, Spatial, and Polarization Domain Techniques to Mitigate Multipath and Inauthentic Signals for Civilian Satnav Applications. FOUO.Ba",
  "content_length": 22131,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:32"
}