{
  "name": "Christian Thomsen 0001",
  "homepage": "http://personprofil.aau.dk/111293?lang=en",
  "status": "success",
  "content": "Christian Thomsen - Aalborg University's Research Portal Christian Thomsen Undervisningsportfolio View Scopus Profile Christian Thomsen Associate Professor Department of Computer ScienceThe Technical Faculty of IT and DesignSection for DATAData Engineering, Science and Systems (former group)Data Engineering, Science, and Systems Daisy - Center for Data-intensive SystemsArtificial Intelligence and Machine Learning https://orcid.org/0000-0002-0862-0509 Phone+4599408919, 9940 8919, 9940 9798Emailchrcs.aaudk Selma Lagerløfs Vej 300, 3-2-499220 Aalborg ØstDenmarkSelma Lagerløfs Vej 300, 3-2-499220 Aalborg ØDenmarkSelma Lagerlöfs Vej 3009220 Aalborg ØDenmark 20042025 Research activity per year Fingerprint The fingerprint consists of automatically generated concepts related to the associated persons. It is updated automatically, when new content is added. 6 Similar Profiles Data Warehouse Computer Science 100% Business Intelligence Computer Science 48% Map-Reduce Computer Science 48% System Management Computer Science 38% Extract Transform Load Keyphrases 34% Online Analytical Processing Computer Science 27% Open Source Tool Computer Science 27% Programming Framework Computer Science 27% View full fingerprint Collaborations from the last five years Dive into details by clicking on the dots. Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2004 2008 2019 2020 2025 11 Finished Projects per year DEDS: Data Engineering for Data SciencePedersen, T. B. (PI), Torp, K. (CoI) & Thomsen, C. (PI)01/03/2021 → 31/10/2025Project: Research MORE: Managing Real-time Energy DataPedersen, T. B. (PI), Thomsen, C. (CoI) & Jensen, S. K. (CoI)01/10/2020 → 31/12/2023Project: Research domOS: Operating System for Smart Services in BuildingsSkou, A. (CoI), Nielsen, B. (CoI), Pedersen, T. B. (CoI) & Thomsen, C. (PI)Horizon Europe01/09/2020 → 31/08/2023Project: Research Smart Services 100% Operating System 100% Intelligent Buildings 100% Space Heating 100% District Heating 100% SAEF: Self-adaptive, Automated ETL Flow ManagementThomsen, C. (PI)01/01/2020 → 31/12/2023Project: Research Efficiency Improvement 100% Source Efficiency 100% Adaptive Framework 100% Dynamic Adjustment 100% Self-adaptive 100% FED: Flexible Energy DenmarkLarsen, K. G. (CoI), Pedersen, T. B. (CoI), Skou, A. (CoI), Nielsen, B. (CoI) & Thomsen, C. (CoI)Innovation Fund Denmark01/04/2019 → 31/03/2023Project: Research Energy Engineering 100% Denmark 80% Flexible Energy Sources 80% Artificial Intelligence 80% Big Data 53% View all 11 projects Research output Research output per year 2005 2005 2006 2008 2009 2011 2012 2014 2015 2016 2017 2018 2020 2022 2024 2025 2025 35 Article in proceeding 11 Report 8 Journal article 6 Book chapter 16 More 5 Conference article in Journal 2 Conference abstract in proceeding 2 Preprint 1 Anthology 1 Book 1 Comment 1 Report chapter 1 Encyclopedia chapter 1 Paper without publisher/journal 1 PhD thesis Research output per year Research output per year Decentralized AI-Control Framework for Multi-Party Multi-Network 6G DeploymentsDzaferagic, M., Ruffini, M., Slamnik-Krijestorac, N., Santos, J. F., Marquez-Barja, J., Tranoris, C., Denazis, S., Christos Tziavas, G., Kyriakakis, T., Karafotis, P., DaSilva, L. A., Pandey, S. R., Shiraishi, J., Popovski, P., Jensen, S. K., Thomsen, C., Pedersen, T. B., Claussen, H., Du, J. & Zussman, G. & 5 others, Chen, T., Chen, Y., Tirupathi, S., Seskar, I. & Kilper, D., 8 Jun 2025, 2025 IEEE International Conference on Communications Workshops (ICC Workshops). Valenti, M., Reed, D. & Torres, M. (eds.). IEEE (Institute of Electrical and Electronics Engineers), p. 1227-1232 6 p. (IEEE International Conference on Communications Workshops (ICC Workshops)).Research output: Contribution to book/anthology/report/conference proceeding › Article in proceeding › Research › peer-review Control Framework 100% Artificial Intelligence 100% 6G 100% Decentralized Artificial Intelligence 100% Use Case 8% Demonstration of ModelarDB: Model-Based Management of High-Frequency Time Series Across Edge, Cloud, and ClientJensen, S. K., Godiksen, C. S., Thomsen, C. & Pedersen, T. B., 1 Aug 2025, In: Proceedings of the VLDB Endowment. 18, 12, p. 5247-5250 4 p.Research output: Contribution to journal › Conference article in Journal › Research › peer-review Open Access Renewable Energy Source 100% Compressed Air Motors 100% Python 100% Apache Parquet 66% Renewable Conversion 50% 1 Citation (Scopus) Extending the SAREF4ENER Ontology with Flexibility Based on FlexOffersLilliu, F., Laadhar, A., Thomsen, C., Recupero , D. R. & Pedersen, T. B., 18 Apr 2025, arXiv.Research output: Working paper/Preprint › Preprint Energy Flexibility 100% Ontology 100% Electric Vehicle 100% Data Format 100% Renewable Energy 100% SENDAI: A framework for joint reasoning about sensor data acquisition and sensor data analyticsJensen, S. K., Kejser, J., Chiariotti, F., Thomsen, C., Kalør, A. E., Popovski, P., Soret, B. & Pedersen, T. B., Sept 2025, In: Information and Computation. 306, 15 p., 105335.Research output: Contribution to journal › Journal article › Research › peer-review Open AccessFile Use Case 100% Data Analytics 100% Query Workload 100% Smart Meters 100% Critical Infrastructure 100% 19 Downloads (Pure) Creating and Querying Data Cubes in Python using pyCubeVang, S., Thomsen, C. & Pedersen, T. B., 2024, Big Data Analytics and Knowledge Discovery: 26th International Conference, DaWaK 2024, Naples, Italy, August 26–28, 2024, Proceedings. Wrembel, R., Chiusano, S., Kotsis, G., Khalil, I. & Tjoa, A. M. (eds.). Springer, p. 269-283 15 p. (Lecture Notes in Computer Science, Vol. LNCS 14912).Research output: Contribution to book/anthology/report/conference proceeding › Article in proceeding › Research › peer-review Open AccessFile Data Cube 100% Data Scientist 37% Star Schema 25% Graphical User Interface 25% Data Warehouse 12% 98 Downloads (Pure) View all 76 research outputs Activities Activities per year 2006 2006 2006 1 Talks and presentations in private or public companies Activities per year International Design for All ConferenceThomsen, C. (Speaker)13 Sept 2006 → 15 Sept 2006Activity: Talks and presentations › Talks and presentations in private or public companies Press/Media Første data-sø er på pladsPedersen, T. B., Ben Hamadou, H. & Thomsen, C.24/08/20211 item of Media coveragePress/Media: Press / Media Danmarks første data-sø fyldt er en realitetPedersen, T. B., Thomsen, C. & Ben Hamadou, H.24/05/2021 → 26/05/20212 items of Media coveragePress/Media: Press / Media Nyt projekt skal udvikle energismart boligteknologiPedersen, T. B., Thomsen, C., Skou, A. & Nielsen, B.07/12/2020 → 14/12/20203 items of Media coveragePress/Media: Press / Media Danske forskere vil skabe et fælles sprog for intelligente bygningerPedersen, T. B. & Thomsen, C.26/10/20202 items of Media coveragePress/Media: Press / Media Lær mere om Data Science og Big DataThomsen, C.15/04/20156 items of Media coveragePress/Media: Press / Media View all 6 press/media",
  "content_length": 7181,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:23"
}