{
  "name": "Christian Bonnet",
  "homepage": "http://www.eurecom.fr/en/people/bonnet-christian",
  "status": "success",
  "content": "BONNET Christian | EURECOM Skip to main content SEARCH Ok Menu print BONNET Christian Name : BONNET Christian Service : EURECOM - Communication systems Function : Professor Emeritus Email : Christian.Bonnet@eurecom.fr Office : SEARCH Ok About me HomepageBiographyResearchPublications (343) Distinctions Distinctions Best Poster Award for \"Accounting for localization errors in a mixed-vehicle centralized control system\" with Raj Patel & J. Härri during MFTS 2018 (2nd Symposium on Management of Future motorway and urban Traffic Systems) (Ispra, Italy). 3rd Prize Excellent Paper Award for \"IoT device management framework for smart home scenarios\" with T. Perumal and SK Datta during GCCE 2015. Best Paper Award for \"The connectivity control framework: Enabling session continuity in multi-domain environments\" with M. Wetterwald during MOBILITY 2014. Best Demo/Poster Award for \"Modeling and Simulating ITS Applications with iTETRIS\" with J. Härri during ACM MSWIM 2011. Best Paper Award  for the paper \"Multicast and Virtual Road Side Units for Multi Technology Alert Messages Dissemination\", with D. Câmara, M. Wetterwald and N. Nikaein during WIMAPS 2011. Best Technical Paper Award of the VTC Fall 2005, with J. Härri for \"A lower bound for vehicles' trajectory duration\". Profiles Profiles Google Scholar Citations ResearchGate DBLP LinkedIn Orcid Scopus Legal Notice Accueil EURECOM Presentation Virtual campus tour Director's remark International dimension Ranking and recognition Presence in Sophia-Antipolis History Quality approach Gender equality Disabilities management SGVB Prevention Contacts Newsroom Réseaux sociaux Brochures Press releases News EURECOM Research Blog EURECOM on I'MTech Blog Job opportunities Job opportunities EURECOM Appels d'offres Teaching Why EURECOM? Academic Schedule Admission How to Apply Required documents Eligibility Requirements English Proficiency French Proficiency Application Deadlines Tuition Fees Payment Plans Scholarships International Academic partners Incoming mobility Outgoing mobility EURECOM engineering degree Students in Preparatory Classes University Students Cursus 6 - 12 month Tracks Free curriculum Spécial Concours Commun Tracks Data Science Embedded systems Digital Security Internet Of Things Intelligent communication systems Post Master's degree Security in Computer Systems and Communications Master in Computer Science Digital Security track Digital Security track _ DD 18 months Data Science track Data Science track _ DD 18 months Master in Networks and Telecommunication Intelligent Communication Systems track Intelligent communication systems track_ DD 18 months Internet of Things (IoT) track Internet of Things (IoT) track _ DD 18 months European Double Degree Masters Master in Autonomous Systems - EIT DIGITAL Master in Cyber Security - EIT Digital Master in Artificial Intelligence with Affective Computing - EIT DIGITAL Master in Security and Cloud Computing (SECCLO) - ERASMUS MUNDUS Doctoral Program First job & openings Courses Courses selector Technical courses Humanities and Social Sciences FAQ Research Results from Research ERC 3IA Sophia Antipolis Awards Publications Thesis Scientist Visitors Development Start-Ups Tech Forward incubator Data Science Department Directory Publications Seminars Communication System Department Directory Publications Seminars OpenAirInterface Alliance Digital Security Department Directory Publications Seminars Telecom Paris Labs System on chip Usages Research Team Young Researchers Partnerships EURECOM consortium members Academic members Industrial members Members’ news Collaboration types Apprenticeship tax In house training Internship Proposal Meet our students Companies’ Corner EURECOM industry forum Student life Student guide Registration and Health Insurance Visa / Resident permit (NON EU) Housing Library Associations Art activities Student association International Junior of EURECOM (IJE) Sport activities Classes godfathers Alumni Alumni Meeting Classes photos",
  "content_length": 4008,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:59"
}