{
  "name": "Chris Greenhalgh",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/chris.greenhalgh",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Chris GreenhalghProfessor of Computer Science, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsResearchPublications Contact workRoom C05 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKworkn/aChris.Greenhalgh@nottingham.ac.ukhttps://people.cs.nott.ac.uk/pszcmg/ BiographyChris Greenhalgh (ORCiD 0000-0003-3483-2422) is a Professor of Computer Science in the School of Computer Science at the University of Nottingham, where he is a co-leader of the Mixed Reality Laboratory and a member of Horizon Digital Economy Research Institute. He gained a first class BA (with distinction) in Electrical and Information Sciences from Cambridge University in 1991. He then worked in the data communications group at the GEC Hirst Research Centre for two years before moving to Nottingham, where he gained a PhD for his work with large scale collaborative virtual environments in 1997. His thesis was a winner of the 1998 BCS/CPHC Distinguished Dissertations in Computer Science competition. He has been a member of academic staff in the School of Computer Science since 1996. He has served as Senior Tutor and Director of Taught Programmes for the School, and contributed to the University's adoption and use of Moodle, an open-source virtual learning environment.Research SummaryProfessor Greenhalgh's research interests centre on interactive and multi-user applications and the technical platforms and tools that support them. In common with the Mixed Reality Lab as a whole,… read moreRecent Publications MCGARRY, GLENN, TOLMIE, PETER, BENFORD, STEVE, GREENHALGH, CHRIS and CHAMBERLAIN, ALAN, 2017. 'They're all going out to something weird' In: Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17. 995-1008FISCHER, JOEL E., GREENHALGH, CHRIS, JIANG, WENCHAO, RAMCHURN, SARVAPALI D., WU, FENG and RODDEN, TOM, 2017. In-the-loop or on-the-loop? Interactional arrangements to support team coordination with a planning agent Concurrency and Computation: Practice and Experience. e4082-n/aGREENHALGH, CHRIS, BENFORD, STEVE, HAZZARD, ADRIAN and CHAMBERLAIN, ALAN, 2017. Playing Fast and Loose with Music Recognition In: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 4302-4313SPENCE, JOCELYN, HAZZARD, ADRIAN, MCGRATH, SEAN, GREENHALGH, CHRIS and BENFORD, STEVE, 2017. The Rough Mile: Testing a Framework of Immersive Practice In: Proceedings of the 2017 Conference on Designing Interactive Systems. 877-888 View all publications Current ResearchProfessor Greenhalgh's research interests centre on interactive and multi-user applications and the technical platforms and tools that support them. In common with the Mixed Reality Lab as a whole, his focus is on supporting everyday activities and situations (including home, work, leisure and entertainment) with networked, mobile and embedded devices and systems. His particular concern is with software infrastructure, the development of deployable systems and empowering \"ordinary\" people to use and appropriate complicated technologies. He is currently involved in research on managing personal data and interactive music-based experiences.Past ResearchSee ORCiD 0000-0003-3483-2422 for publications & funding. Within the EPSRC-funded FAST IMPACt programme grant Professor Greenhalgh has created the Muzicodes interactive musical control system which underpins Climb!, an interactive multimedia work for Disklavier piano and electronics. He has also supported a number of adaptive mobile music experiences through the daoplayer app. As a co-investigator on the Databox project, he is developing and promoting new approaches to personal data management for research and for mental health. As a co-investigator in the Horizon Digital Economy Research Hub Professor Greenhalgh has worked on Personal Data Stores (PDSs), enhancing travel experiences and urban games. He led the development of the Equator Integrated Platform (EQUIP), the Equator IRC's adaptive software architecture for ubiquitous computing and mobile applications. This was used to support high-profile public events and performances, including collaborations with performance artists Blast Theory (Rider Spoke, Day of the Figurines) and Active Ingredient (Love City, Exploding Places). He was technical director of the Digital Records for e-Social Science node of the National Centre for e-Social Science, with overall responsibility for the Digital Replay System (DRS) analysis tool (formerly known as Replaytool). He was the primary architect of three generations of the MASSIVE Collaborative Virtual Environment system, which underpinned many EPSRC and European projects. He has contributed to the architecture and development of the EPSRC funded myGRID e-science pilot project and to a range of e-science infrastructures that link mobile and ubiquitous devices with underlying grid architectures. MCGARRY, GLENN, TOLMIE, PETER, BENFORD, STEVE, GREENHALGH, CHRIS and CHAMBERLAIN, ALAN, 2017. 'They're all going out to something weird' In: Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17. 995-1008FISCHER, JOEL E., GREENHALGH, CHRIS, JIANG, WENCHAO, RAMCHURN, SARVAPALI D., WU, FENG and RODDEN, TOM, 2017. In-the-loop or on-the-loop? Interactional arrangements to support team coordination with a planning agent Concurrency and Computation: Practice and Experience. e4082-n/aGREENHALGH, CHRIS, BENFORD, STEVE, HAZZARD, ADRIAN and CHAMBERLAIN, ALAN, 2017. Playing Fast and Loose with Music Recognition In: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 4302-4313SPENCE, JOCELYN, HAZZARD, ADRIAN, MCGRATH, SEAN, GREENHALGH, CHRIS and BENFORD, STEVE, 2017. The Rough Mile: Testing a Framework of Immersive Practice In: Proceedings of the 2017 Conference on Designing Interactive Systems. 877-888ANDY CRABTREE, TOM LODGE, JAMES COLLEY, CHRIS GREENHALGH and RICHARD MORTIER, 2017. Accountable IoT?: Outline of the Databox model In: International Symposium on a World of Wireless, Mobile, and Multimedia Networks. 1-6BENFORD, STEVE, KOLEVA, BORIANA, QUINN, ANTHONY, THORN, EMILY-CLARE, GLOVER, KEVIN, PRESTON, WILLIAM, HAZZARD, ADRIAN, RENNICK-EGGLESTONE, STEFAN, GREENHALGH, CHRIS and MORTIER, RICHARD, 2017. Crafting interactive decoration ACM Transactions on Computer-Human Interaction (TOCHI). 24(4), 26BENFORD, STEVE, HAZZARD, ADRIAN, CHAMBERLAIN, ALAN, GLOVER, KEVIN, GREENHALGH, CHRIS, XU, LIMING, HOARE, MICHAELA and DARZENTAS, DIMITRIOS, 2016. Accountable Artefacts: The Case of the Carolan Guitar In: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 1163-1175CHRIS GREENHALGH, STEVE BENFORD and ADRIAN HAZZARD, 2016. ^ muzicode$: composing and performing musical codes In: Audio Mostly 2016. 1-8GREENHALGH, CHRIS, HAZZARD, ADRIAN, MCGRATH, SEAN and BENFORD, STEVE, 2016. GeoTracks: Adaptive Music for Everyday Journeys In: Proceedings of the 2016 ACM on Multimedia Conference. 42-46BENFORD, STEVE, HAZZARD, ADRIAN, CHAMBERLAIN, ALAN, GLOVER, KEVIN, GREENHALGH, CHRIS, XU, LIMING, HOARE, MICHAELA and DARZENTAS, DIMITRIOS, 2016. Experiencing the Carolan Guitar In: Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 3651-3654RICHARD MORTIER, JIANXIN ZHAO, JON CROWCROFT, QI LI, LIANG WANG, HAMED HADDADI, YOUSEF AMAR, ANDY CRABTREE, JAMES COLLEY, TOM LODGE, ANTHONY BROWN, DEREK MCAULEY and CHRIS GREENHALGH, 2016. Personal data management with the Databox: What’s inside the box? In: Proceedings of the ACM Workshop on Cloud-Assisted Networking. 49-54ANDY CRABTREE, TOM LODGE, JAMES COLLEY, CHRIS GREENHALGH, RICHARD MORTIER and HAMED HADDADI, 2016. Enabling the new economic actor: Data protection, the digital economy, and the Databox Personal and Ubiquitous Computing. 20(6), 947-957PRICE, DOMINIC, MCAULEY, DEREK, MORTIER, RICHARD, GREENHALGH, CHRIS, BROWN, MICHAEL and ANGELOPOULOS, SPYROS, 2015. Inter-Social-Networking: Accounting for Multiple Identities. In: MEISELWITZ, GABRIELE, ed., Social Computing and Social Media Springer International Publishing. 242-252ANDY CRABTREE, ALAN CHAMBERLAIN, STELA VALCHOVSKA, MARK DAVIES, KEVIN GLOVER and CHRIS GREENHALGH, 2015. I've Got a Sheep with Three Legs if Anybody Wants It?: Re-visioning the Rural Economy Personal Ubiquitous Computing. 19(8), 1247-1258ADRIAN HAZZARD, STEVE BENFORD, ALAN CHAMBERLAIN and CHRIS GREENHALGH, 2015. Considering Musical Structure in Location-Based Experiences In: 15th International Conference on New Interfaces for Musical Expression (NIME 2015), Louisiana, USA. CHAMBERLAIN, A., RAGHUNANDAN, D., KUMAR, S. and GREENHALGH, C., 2015. Design In Context, from India to Wales: appropriate approaches to the development of socio-technical solutions to support indigenous knowledge. In: At the Intersection of Indigenous and Traditional Knowledge and Technology Design (BOOK) Informing Science Press. 436 pagesBENFORD, STEVE, GREENHALGH, CHRIS, ANDERSON, BOB, JACOBS, RACHEL, GOLEMBEWSKI, MIKE, JIROTKA, MARINA, STAHL, BERND CARSTEN, TIMMERMANS, JOB, GIANNACHI, GABRIELLA, ADAMS, MATT, FARR, JU ROW, TANDAVANITJ, NICK and JENNINGS, KIRSTY, 2015. The Ethical Implications of HCI's Turn to the Cultural ACM Trans. Comput.-Hum. Interact.. 22(5), 24:1-24:37BEDWELL, BEN, SLACK, PETER and GREENHALGH, CHRIS, 2015. Learning from the Experts: Enabling and Studying DIY Development of Location-based Visitor Experiences In: Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Compu",
  "content_length": 37580,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:39"
}