{
  "name": "Christoph Lofi",
  "homepage": "http://www.wis.ewi.tudelft.nl/lofi",
  "status": "success",
  "content": "Lofi Lofi | Web Information Systems Christoph Lofi Associate Professor c.lofi@tudelft.nl About Publications About Associate Professor at the Web Information Systems group of the Faculty of Engineering, Mathematics and Computer Science (EEMCS/EWI), Delft University of Technology. I serve as the Director of Studies for BSc Computer Science and Engineering and in the department management team. My long-term research vision is to develop Semantic-based Data Engineering and Knowledge Engineering Methodologies that enable the development of FAIR (Findable, Accessible, Interoperable, Reusable) Data Management platforms to serve as a foundation of future sustainable societal re-search. I address research questions related to extracting knowledge from unstructured data, generation and handling of meta-data, integrating datasets, enriching datasets, and semantic query processing. As the process of understanding the semantics of data is domain-specific, generic methods and solutions in these fields are typically limited in their effectiveness. Thus, in addition to fundamental contributions, semantic data engineering research needs to be carried out in an application do-main. Aligned with TU Delft’s research vision to strive for “Impact for a better society”, I emphasize interdisciplinary application domains with high societal impact, but which also have a high de-mand for innovative data engineering approaches. The major application domains I target are agri-cultural and botanical sciences, public health, and nutrition and translational sciences. I am teaching a several Data Management courses at TU Delft, and actively work on strengthening data education within and outside TU Delft. Current Projects and Research Lines Plant-XR & Data-XR: Large-scale NWO LTP 10-year programme on developping a new generation of intelligent breeding tools for extra resilient crops. My tream focuses on semantic integration and knowledge provenance management. Education Courses I am currently teaching several courses at TU Delft: BSc CSE1500: Web and Database Technology 5 ETCS, by Christoph Lofi and Ujwal Gadiraju. BSc CSE1505: Information and Data Management 5 ETCS, by Christoph Lofi and Asterios Katsifodimos. MSc IN4252: Web Science & Engineering 5 ECTS, by Christoph Lofi, Geert-Jan Houben and Jie Yang. MSc IN4331: Web-scale Data Management 5 ETCS, by Asterios Katsifodimos and Christoph Lofi. MSc IFEEMCS520100 Fundamentals of Artificial Intelligence Programme, 15 ETCS MOOC AlfE3x Data Management and Data Pipelines, edX, TU Delft Extension School Short CV 2022: Associate Professor Delft University of Technology 2016: Assistant Professor Delft University of Technology 2014-2016: PostDoc at Technische Universität Braunschweig 2012-2014: PostDoc at National Institute of Informatics, Tokyo, Japan 2011-2012: PostDoc at Technische Universität Braunschweig 2011: Defense of Doctoral Thesis at Technische Universität Braunschweig 2008-2011: Ph.D. Researcher at Technische Universität Braunschweig 2006-2008: Ph.D. Researcher at L3S Research Center, Leibniz University Hannover 2005: Diploma Thesis at Collaborative Software Development Laboratory, University of Hawai’i, Honolulu - Manoa, Certificate issued by University Kaiserslautern 2002-2004: Assistant Researcher at Fraunhofer Institute for Experimental Software Engineering, Kaiserslautern 2000-2004: Student at University Kaiserslautern Publications Visiting address: Building 28 Room - 780 West 3rd floor Van Mourik Broekmanweg 6 2628 XE Delft The Netherlands Back to top",
  "content_length": 3543,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:49"
}