{
  "name": "Christina Anne Boucher",
  "homepage": "http://christinaboucher.com",
  "status": "success",
  "content": "Home | The Boucher Lab Skip to content f About the PI Christina Boucher is a Professor in the Department of Computer and Information Science and Engineering at the University of Florida. Her research focuses on the development of algorithms and data structures that enable large-scale biological sequence analysis. Her work bridges the latest sequencing innovations and computational analysis to overcome key challenges in understanding biological data. A central theme of her research is the design of compressed data structures that make large genomic datasets searchable and interpretable at scale, forming the foundation for machine learning models that connect sequence variation to biological function. Two major biological directions recur throughout her work: alignment to pan-genomes—most often human—and understanding how microbial species move and evolve. She is currently a standing member of NIH BDMA study section. Her research lab greatly appreciates the funding that we receive from NSF, NIH, and USDA. Christina Boucher’s Google Scholar. Full Bio recent News current Service Standing Member of NIH BDMA Member of the PC for IPDPS 2026. Member of the PC for IEEE ICHI. Member of HiTSeq Organizing Committee Member of RECOMB SEQ Steering Committee BMC Bioinformatics Associate Editor Bioinformatics and Biology Insights Associate Editor CURRENT funding USDA Subcontract: Development of Multiplex PCR Design Viral Sequencing Project ($300,000; PI: Boucher). NIH U01: Building Tools and Community to Make Pangenomes Accessible ($700,034; PI: Garrison). NIH R01: Triple-enriched metagenomics for robust resistome analysis” ($3,723,531; PI: Noyes). NIH R56: Fully Realizing Pangenomics Alignment ($644,578; PI: Boucher). NSF SCH: Enabling real-time surveillance of antimicrobial resistance ($1,187,778; PI: Boucher). NIH RO1: Developing Computational Methods for Surveillance of Antimicrobial Resistant Agents ($2,139,795; PI: Boucher). NIH R01: Renewal Personal and panel references for improved alignment (PI: Langmead). PREVIOUS funding NIH R01:  Personal and panel references for improved alignment. NSF IIBR: An Efficient Pangenomics Graph Aligner ($700,361, PI: Boucher). NSF EAGER: Solving the Bait Learning Problem ($180,995; PI: Boucher). NSF III: A scaleable and Efficient Optical Map Assembler ($397,461; PI: Boucher). News Dr. Boucher and collaborators (Heng Li at Harvard, William Yu at CMU and Noelle Noyes at UMN) have recently published their RECOMB 2025 paper at Genome Research. Dr. Boucher gave a keynote address at WABI 2025, held at the University of Maryland. Dr. Boucher and long-time collaborator Dr. Langmead will be collaborating on the NIH R01 renewal “Personal and panel references for improved alignment“ Dr. Boucher will be collaborating with Dr. Erik Garrison on a new NIH U01 entitled “Building Tools and Community to Make Pangenomes Accessible“. Bahar Alipanahi at PhD Commencement joining the lab Multiple postdoctoral and graduate fellowship positions are available in the Boucher Lab at the University of Florida (Gainesville, FL). Our group develops algorithms and data structures for large-scale biological sequence analysis, with a focus on compressed data structures, machine learning, and computational genomics. We are particularly interested in candidates with strong foundations in algorithms, mathematics, or computer science who are eager to apply these skills to challenging problems in biology. Current research directions include: Pangenomics: Designing and implementing efficient algorithms for indexing and analyzing thousands of reference genomes (funded by NIH). Antimicrobial Resistance (AMR): Developing scalable computational frameworks to detect and predict resistance mechanisms from shotgun metagenomic data (funded by NIH). Molecular Diagnostics: Creating algorithms for optimized primer design and multiplex PCR assays (funded by USDA). Our lab integrates theory and application. We not only invent new algorithms but also engineer them into scalable, open-source tools that drive real biological discovery. Meet the Current Students",
  "content_length": 4105,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:32"
}