{
  "name": "Christos Nomikos",
  "homepage": "https://cs.uoi.gr/~cnomikos",
  "status": "success",
  "content": "Christos Nomikos Χρήστος Νομικός Αναπληρωτής Καθηγητής Τμήμα Μηχανικών Η/Υ και Πληροφορικής Πανεπιστήμιο Ιωαννίνων Τ.Θ 1186, 45110 Ιωάννινα Τηλ: +30-26510-08815 e-mail: cnomikos@cs.uoi.gr ENG Σπουδές Δίπλωμα Ηλεκτρολόγου Μηχανικού, Εθνικό Μετσόβιο Πολυτεχνείο, 1992 Διδακτορικό Δίπλωμα, Τμήμα Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών, Εθνικό Μετσόβιο Πολυτεχνείο, 1997 Ερευνητικά Ενδιαφέροντα Σχεδίαση και Ανάλυση Αλγορίθμων Υπολογιστική Πολυπλοκότητα Λογικός Προγραμματισμός Τυπικές Γλώσσες Θεωρία Γραφημάτων Μαθήματα Διακριτά Μαθηματικά ΙΙ Αρχές Γλωσσών Προγραμματισμού Υπολογιστική Πολυπλοκότητα Προσεγγιστικοί Αλγόριθμοι Διπλωματικές Εργασίες Ανακοίνωση για τις Διπλωματικές Εργασίες του Χειμερινού Εξαμήνου 2025-26 Δημοσιεύσεις C. D. Koutras, C. Moyzes, C. Nomikos, K. Tsaprounis, Y. Zikos, \"On weak filters and ultrafilters: Set theory from (and for) knowledge representation\", Logic Journal of the IGPL 31(1) (2023), pp 68-95. A. Charalambidis, C. Nomikos, P. Rondogiannis, \"Strong Equivalence of Logic Programs with Ordered Disjunction: A Logical Perspective\", Theory and Practice of Logic Programming 22(5) (2022), pp 708-722. C. D. Koutras, K. Liaskos, C. Moyzes, C. Nomikos and C. Rantsoudis, \"Default Consequence Relations from Topology and Measure Theory\", Annals of Mathematics and Artificial Intelligence 90(4) (2022), pp 397-424. A. Charalambidis, C. Nomikos and P. Rondogiannis, \"The Expressive Power of Higher-Order Datalog'', Theory and Practice of Logic Programming 19 (2019), pp 925-940. C. Galanaki, C. Nomikos and P. Rondogiannis, \"Game Semantics for Non-monotonic Intensional Logic Programming\", Annals of Pure and Applied Logic 168 (2017), pp 234-253. C. D. Koutras, C. Moyzes, C. Nomikos and Y. Zikos, \"On the 'in many cases' Modality: Tableaux, Decidability, Complexity, Variants\", SETN 2014, pp 207-220. C. Galanaki, C. Nomikos and P. Rondogiannis, \"Game Semantics for Non-monotonic Intensional Logic Programming\", LPNMR 2013, pp 329-341. P. Eleftheriou, C. D. Koutras and C. Nomikos, \"Notions of Bisimulation for Heyting-Valued Modal Languages\", Journal of Logic and Computation 22 (2012), pp 213-235. V. Kountouriotis, C. Nomikos and P. Rondogiannis, A Game-Theoretic Characterization of Boolean Grammars, Theoretical Computer Science 412 (2011),  pp 1169-1183. V. Kountouriotis, C. Nomikos and P. Rondogiannis, A Game-Theoretic Characterization of Boolean Grammars, DLT 2009, pp 334-347. V. Kountouriotis, C. Nomikos and P. Rondogiannis, Well-Founded Semantics for Boolean Grammars, Information and Computation 207 (2009), pp 945-967. C. Nomikos, P. Rondogiannis and W. W. Wadge, Strong equivalence of logic programs under the infinite-valued semantics, Information Processing Letters 109 (2009), pp 576-581. C. D. Koutras, C. Nomikos and P. Peppas, On a Simple 3-valued Modal Language and a 3-valued Logic of not-fully-justified Belief, Logic Journal of the IGPL, 16 (2008), pp 591-604. C. Nomikos and P. Rondogiannis, Locally Stratified Boolean Grammars, Information and Computation 206 (2008), pp 1219-1233. C. Nomikos, A. Pagourtzis, and S. Zachos, Randomized and Approximation Algorithms for Blue-Red Matching, MFCS 2007, pp 715-725. V. Kountouriotis, C. Nomikos and P. Rondogiannis, Boolean Grammars and Negation in Logic Programming Proceedings of the 6th Panhellenic Logic Symposium, PLS 2007. V. Kountouriotis, C. Nomikos and P. Rondogiannis, Conjuntive Macro Grammars, Proceedings of the Workshop on Theory and Applications of Language Equations (TALE 2007), pp 67-75. C. Nomikos and P. Rondogiannis, Locally Stratified Boolean Grammars, Proceedings of the 1st International Conference on Language and Automata Theory and Applications (LATA 2007), pp 437-447. C. Nomikos, A. Pagourtzis, K. Potika and S. Zachos, Routing and Wavelength Assignment in Multifiber WDM Networks with Non-Uniform Fiber Cost, Computer Networks 50 (2006), pp 1-14. V. Kountouriotis, C. Nomikos and P. Rondogiannis, Well-Founded Semantics for Boolean Grammars, Proceedings of the 10th International Conference on Developments of Language Theory, 2006, pp 203-214. C. Nomikos, P. Rondogiannis and M. Gergatsoulis, Temporal Stratification Tests for Linear and Branching-Time Deductive Databases, Theoretical Computer Science 342 (2005),  pp 382-415. C. Nomikos, P. Rondogiannis and W. W. Wadge, A Sufficient Condition for Strong Equivalence under the Well-Founded Semantics (poster), Proceedings of the 21st International Conference on Logic Programming (ICLP 2005), pp 414-415. S. Ioannidis, C. Nomikos, A. Pagourtzis, and S. Zachos, Routing and Wavelength Assignment in Generalized WDM Tree Networks of Bounded Degree. Proceedings of the 10th Panhellenic Conference on Informatics (PCI 2005), pp 57-67. S. D. Nikolopoulos, C. Nomikos and P. Rondogiannis, Limit Characterization for the Number of Spanning Trees of Graphs, Information Processing Letters 90 (2004), pp 307-313. M. Gergatsoulis and C. Nomikos, A Proof Procedure for Temporal Logic Programming, International Journal of Foundations of Computer Science 15(2) (2004), pp 417-443. C. Nomikos, A. Pagourtzis, K. Potika and S. Zachos, Fiber Cost Reduction and Wavelength Minimization in Multifiber WDM Networks, Proceedings of NETWORKING 2004, pp 150-161. C. Nomikos, A. Pagourtzis and S. Zachos, Satisfying a Maximum Number of Pre-routed requests in All Optical Rings, Computer Networks 42 (2003), pp 55-63. C. Nomikos, A. Pagourtzis, and S. Zachos, Minimizing Request Blocking in All-Optical Rings, Proceedings of INFOCOM 2003, pp 1771-1780. C. D. Koutras, C. Nomikos and P. Peppas, Canonicity and Completeness Results for Many-Valued Modal Logics, Journal of Applied Νon-Classical Logics 12(1) (2002), pp 7-41. C. Nomikos, A. Pagourtzis and S. Zachos, Routing and Path Multi-Coloring, Information Processing Letters 80 (2001), pp 249-256. C. D. Koutras and C. Nomikos, The Computational Complexity of Satisfiability in Many-Valued Modal Logic, Proceedings of the 3rd Panhellenic Logic Symposium, 2001, 2001. C. Nomikos, P. Rondogiannis and M. Gergatsoulis, A Stratification Test for Temporal Logic Programs, Proceedings of the 3rd Panhellenic Logic Symposium, 2001. C. D. Koutras and C. Nomikos, On the Computational Complexity of Stratified Negation in Linear-Time Temporal Logic Programming, in M.Gergatsoulis, P.Rondogiannis (editors) Intensional Programming II (based on papers at the 12th International Symposium on Languages for Intensional Programming, ISLIP'99), World Scientific, 2000, pp 106-116.",
  "content_length": 6544,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:49"
}