{
  "name": "Chris Bevan",
  "homepage": "http://www.chrisbevan.co.uk",
  "status": "success",
  "content": "Chris Bevan I'm a mixed-methods HCI specialist producing human-centred, cross-disciplinary R&D with partners from academia, industry and the creative sector. I produce award winning research on a range of topics including virtual reality, pervasive computing, social robotics & cybersecurity. I collaborate with many amazing people and institutions including University of the West of England, Pacific Northwest National Laboratory, University of Dundee, University of Bristol, VR City, \tJongsma and O'Neill & Watershed. I teach immersive technologies as part of the Bristol Interaction Group at the University of Bristol's school of Computer Science. I am also an honorary research fellow of the CREATE Laboratory in the University of Bath's department of Psychology. AI in Antiquity Feb 25–Jan 26. AI • Ancient History • Avatars How can we best integrate generative AI within story-led interactive experiences to help students to engage with the ancient past? Game Conscious Dialogue Jul 24–Dec 25. AI • Games What is Game Conscious Dialogue (TM), and what does it mean for the way we design and play video games? On a Quest to Learn: Creating an AI-powered Quest System for Museums to Deliver Increased Visitor Engagement Apr 25–Jun 25. AI • Ancient History Exploring new ways for people to interact with museum content through character driven quests. The Virtual Reality Oracle (VRO): An Immersive Experience of the Ancient Greek Oracle at Dodona Jun 20–May 23. Ancient History • Virtual Reality A virtual reality recreation of divination at the ancient oracle of Zeus at Dodona. Immersive Experiences for Design Fiction – Theatre and Virtual Reality (eVRafter) Jul 21–Jul 22. Design Fiction • Ethics • Virtual Reality What are the ethical dimensions of offering a digital afterlife in virtual reality? Virtual Realities: Immersive Documentary Encounters (VRDocs) Jul 17–Jun 20. Documentary • Virtual Reality Exploring the production, audience and experience of nonfiction virtual reality media. Being There: Humans and Robots in Public Spaces Oct 13–Jan 17. Social Robotics • Teleoperation How can telepresence via socially interactive robots help us to reclaim public space as a forum for good? SID: An Exploration of Super-Identity Nov 11–Mar 15. Digital Biometrics • Identity • Security Identifying and evaluating novel behavioural biometrics to support identity attribution across the physical / digital divide. Plug Back Into Science Mar 10–Feb 11. Datalogging • Education • Visualisation Working with teachers to explore how mobile datalogging can help students to engage with science. Cityware: Urban Design and Pervasive Systems Oct 06–Aug 09. Pervasive Computing • Privacy • Security • Trust Designing & evaluating novel authentication mechanisms for wireless pervasive computing services that are private, secure and trustworthy. Mobile Bristol Jan 02–Jan 05. Games • Location-Based Computing • Mobile Designing & evaluating location-based / contextually-aware digital services for use within public spaces. 2024 Using Narrative 360° Video as a Tool to Promote Breast Self-examination Harry Farmer, Eleanna Skoulikari, Chris Bevan, Stuart Gray, Kirsten Cater & Danaë Stanton Fraser. 2024. Virtual Reality. Springer. 2023 Imagine That! Imaginative Suggestibility Affects Presence in Virtual Reality Crescent Jicol, Christopher Clarke, Emilia Tor, Hiu Lam Yip, Jinha Yoon, Chris Bevan, Hugh Bowden, Elisa Brann, Kirsten Cater, Richard Cole, Quinton Deeley, Esther Eidinow, Eamonn O'Neill, Christof Lutteroth, Michael J Proulx. 2023. CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems. ACM. 2021 Developing Arts Based Methods for Exploring Virtual Reality Technologies: A University - Industry Case Study Stuart Gray, Chris Bevan, Kirsten Cater, Jo Gildersleve, Caroline Garland and Olly Langdon. 2021. Research for All. UCL Press. Evaluating Prototype Augmented and Adaptive guidance system to support Industrial Plant Maintenance Thomas Bale, Chris Bevan, Andrew Calway, Kirsten Cater, Tom Scott and Rob Skilton. 2021. International Conference on Mobile Human-Computer Interaction (MobileHCI '21). ACM. Honorable Mention Award Space Vision: Developing a Game for Vision Screening and Home-Based Monitoring Stuart Gray, Chris Bevan, Kirsten Cater and Stephanie Campbell. 2021. CHI PLAY '21. ACM. 2020 Did you see what I saw?: Comparing attentional synchrony during 360 degree video viewing in head mounted display and tablets Harry Farmer, Chris Bevan, David Green, Mandy Rose, Kirsten Cater and Danaë Stanton Fraser. 2020. Journal of Experimental Psychology: Applied. APA. The Sugargotchi: An Embodied Digital Pet to Raise Children's Awareness of their Dental Health and Free Sugar Consumption Stuart Gray, Tom Metcalfe, Kirsten Cater, Peter Bennett, Chris Bevan. 2020. CHI PLAY '20 Extended Abstracts Proceedings of the 2020 Annual Symposium on Computer-Human Interaction in Play Companion Works In Progress. ACM. 'You wouldn't get that from watching TV!': Exploring audience responses to virtual reality non-fiction in the home David Green, Mandy Rose, Chris Bevan, Harry Farmer, Kirsten Cater, Danaë Stanton Fraser. 2020. Convergence: The International Journal of Research into New Media Technologies. Sage. 2019 Honorable Mention Award Behind The Curtain Of The \"Ultimate Empathy Machine\": On The Composition Of Virtual Reality Nonfiction Experiences Chris Bevan, David Phillip Green, Harry Farmer, Mandy Rose, Kirsten Cater, Danaë Stanton Fraser and Helen Brown. 2019. In CHI Conference on Human Factors in Computing Systems Proceedings (CHI 2019), May 4–9, 2019, Glasgow, Scotland UK. ACM, New York, NY, USA. Use of a Non-Human Robot Audience to Induce Stress Reactivity in Human Participants Julie Turner-Cobb, Mashal Asif, James E. Turner, Chris Bevan and Danaë Stanton Fraser. 2019. Computers in Human Behavior. Elsevier. Did You See What I Saw?: Comparing User Synchrony When Watching 360 Video In HMD Vs Flat Screen Harry Farmer, Chris Bevan, David Philip Green, Mandy Rose, Kirsten Cater and Danaë Stanton Fraser. 2019. 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE. Using Design Fiction to Explore the Ethics of VR 'In the Wild' David Philip Green, Guy Peter Schofield, James Hodge, Mandy Rose, Kirsten Cater, Chris Bevan and Stuart Iain Gray. 2019. Proceedings of the 2019 ACM International Conference on Interactive Experiences for TV and Online Video (TVX19). ACM. What can the first years of VR nonfiction tell us about its future? Looking back on Virtual Reality nonfiction: 2012-2018 Chris Bevan. 2019. Immerse. Dot Connector Studio. 2018 A Mediography Of Virtual Reality Non-Fiction: Insights And Future Directions Chris Bevan and David Green. 2018. In Proceedings of the 2018 ACM International Conference on Interactive Experiences for TV and Online Video (TVX '18). ACM, New York, NY, USA, 161-166. Designing Games For Vision Screening: Lessons Learned From Observing Preschool Video Game Play Stuart Iain Gray, Stephanie Campbell, Kirsten Cater, Chris Bevan, and Iain Gilchrist. 2018. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts (CHI PLAY '18 Extended Abstracts). ACM, New York, NY, USA.. 2017 Investigating Social Evaluative Threat (SET) Using A Robotic Stress Testing Panel Julie M Turner-Cobb, Mashal Asif, Chris Bevan, Danaë Stanton Fraser, and James E. Turner. 2017. Psychosomatic Medicine. American Psychosomatic Society. 2016 Evaluating a mobile spontaneous eye blink tracker for use in tele-presence HRI as a low bandwidth social communicative cue Chris Bevan and Danaë Stanton Fraser. 2016. 25th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN '16). Different strokes for different folks? Revealing the physical characteristics of smartphone users from their swipe gestures Chris Bevan and Danaë Stanton Fraser. 2016. International Journal of Human-Computer Studies. Elsevier. Predicting sex as a soft-biometrics from device interaction swipe gestures Oscar Miguel-Hurtado, Sarah V. Stevenage, Chris Bevan and Richard Guest. 2016. Pattern Recognition Letters. 2015 Best Paper Award Shaking Hands and Cooperation in Tele-present Human-Robot Negotiation Chris Bevan and Danaë Stanton Fraser. 2015. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction (HRI '15). ACM, New York, NY, USA, 247-254. Workshop on Designing and Evaluating Social Robots for Public Settings Chris Bevan, Paul Bremner, Danaë Stanton Fraser and Hatice Gunes. 2015. International Conference on Intelligent Robots and Systems (IROS) 2015. IEEE/RSJ. 2014 Who am I? Representing the self offline and in different online contexts Lia Emanuel, Greg J. Neil, Chris Bevan, Danaë Stanton Fraser, Sarah V. Stevenage, Monica T. Whitty and Sue Jamison-Powell. 2014. Computers in Human Behavior. Elsevier. 2013 What does your profile really say about you?: privacy warning systems and self-disclosure in online social network spaces Lia Emanuel, Chris Bevan and Duncan Hodges. 2013. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 799-804. Factors In The Emergence And Sustainability Of Self-Regulation Chris Bevan, Lia Emanuel, Julian Padget, Juani Swart, John Powell and Shadi Basurra. 2013. AISB Convention. Social Coordination: Principles, Artefacts and Theories. Exeter, UK. Being there: humans and robots in public spaces Paul Bremner, Niki Trigoni, Ian Brown, Hatice Gunes, Chris Bevan, Danaë Stanton Fraser and Mark Levine. 2013. In G. Herrmann, M. J. Pearson, A. Lenz, P. Bremner, A. Spiers, & U. Leonards (Eds.), Social Robotics: 5th International Conference, ICSR 2013, Bristol, UK. Springer. 2011 Influence of User Choice on Perception of Wireless Connection Genuineness and Security Chris Bevan, James Mitchell, Tim Kindberg, Eamonn O'Neill, Jim Grimmett, Danaë Stanton Fraser and Dawn Woodgate. 2011. In Proceed",
  "content_length": 12153,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:33"
}