{
  "name": "Christos Papachristos",
  "homepage": "https://www.unr.edu/cse/people/christos-papachristos",
  "status": "success",
  "content": "Christos Papachristos | Computer Science & Engineering | University of Nevada, Reno Christos Papachristos Associate Professor Phone: (775) 682-8282 Email: cpapachristos@unr.edu Building: WPEB Room: 309 Mail stop: 0171 Website: Christos Papachristos' Google Scholar page Summary Biography Christos Papachristos obtained his Ph.D. in the field of aerial robotics design, control, and autonomy from the University of Patras, Greece in 2015. Subsequently, from the promoted role of Post-Doctoral scholar, he continued his research in relation to the AEROWORKS (EC Horizon 2020) research project, leading the activities of aerial robotic development, control, perception and autonomous path planning. After moving to the United States in 2016 as a senior postdoctoral researcher at the Autonomous Robots Lab of the University of Nevada, Reno, he focused his research on innovative systems and methods that promote autonomy, long-term reliability, and robustness of operation in unknown environments. He has since worked on both the technical side and the organization of several large multi-million dollar research projects on this side of the Atlantic, such as NRI: Multi–Modal Characterization of DOE–EM Facilities. Christos Papachristos is currently a research assistant professor at the University of Nevada, Reno, and his research is dedicated to enabling operational resilience and autonomous exploration, mapping, and characterization of complex GPS-denied degraded visual environments that pose strict robotic requirements for austere navigation, degraded sensing, and severe communication and endurance limitations. In the same context, as a member of team CERBERUS that participates in the DARPA Subterranean Challenge, he is primarily involved with the technical leadership of the Micro Aerial Vehicle autonomy component and the Robotic Integration efforts for the competition. Education Ph.D., University of Patras, Greece, 2015 Diploma of Electrical and Computer Engineering, University of Patras, Greece, 2009 Professional affiliations Member of the Institute of Electrical and Electronics Engineers (IEEE) Society Member of the Technical Chamber of Greece (TEE) as Licensed Electrical and Computer Engineer Prospective graduate students Dr. Papachristos is currently recruiting: Students with a background in FPGA programming / Embedded programming, interested in ultra-lightweight module design for miniaturized robotics applications. Robotics background in perception, state estimation is a plus. Students with a background in lightweight material design and fabrication, interested in miniaturized and/or lighter-than-air, as well as reconfigurable robotics. Multi-body Dynamics and Control background is a plus Learn more about our graduate programs Selected publications C. Papachristos, T. Dang, S. Khattak, F. Mascarich, N. Khedekar, and K. Alexis, \"Modeling, Control, State Estimation and Path Planning Methods for Autonomous Multirotor Aerial Robots\", Foundations and Trends® in Robotics, Now Publishers, Inc., 2018, Vol. 7, No. 3, pp. 180–250, DOI: 10.1007/978-3-319-91590-6_3 C. Papachristos, K. Alexis, and A. Tzes, \"Dual–Authority Control of an Unmanned Tri–TiltRotor employing Model Predictive Control\", Journal of Intelligent and Robotic Systems, Springer, DOI: 10.1007/s10846-015-0231-1 C. Papachristos, S. Khattak, and K. Alexis, \"Uncertainty–Aware Receding Horizon Exploration and Mapping Using Aerial Robots\", IEEE International Conference on Robotics & Automation (ICRA), pp. 4568–4575, May 29–June 3, 2017, Singapore. C. Papachristos, K. Alexis, and A. Tzes, \"Efficient Force Exertion for Aerial Robotic Manipulation: Exploiting the Thrust-Vectoring Authority of a Tri-TiltRotor UAV\", IEEE International Conference on Robotics & Automation (ICRA), pp. 4500–4505, May 31–June 7, 2014, Hong Kong, China. C. Papachristos, D. Tzoumanikas, and A. Tzes, \"Aerial Robotic Tracking of a Generalized Mobile Target employing Visual and Spatio–Temporal Dynamic Subject Perception\", IEEE International Conference on Intelligent Robots & Systems (IROS), pp. 4319–4324, September 28–October 2, 2015, Hamburg, Germany. Courses taught CS-202: Computer Science II, terms: Spring 2017, Fall 2017, Spring 2018, Fall 2018, Spring 2019",
  "content_length": 4244,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:47"
}