{
  "name": "Christian Weinert",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/christian-weinert",
  "status": "success",
  "content": "Christian Weinert - Royal Holloway Research Portal Christian Weinert Dr Lecturer in Information Security, Department of Information Security https://orcid.org/0000-0003-4906-6871 Phone01784917659EmailChristian.Weinertrhul.acuk TW20 0EX Personal profile Personal profileChristian Weinert is a Lecturer (Assistant Professor) in the Department of Information Security at Royal Holloway, University of London. Before, he was a postdoctoral researcher (2021/09 – 2022/02) and doctoral researcher (2016/09 – 2021/08) in the Cryptography and Privacy Engineering Group (ENCRYPTO) at TU Darmstadt. His research area is privacy-enhancing cryptography with a focus on applications such as private set operations, private information retrieval, federated learning, and AI/ML inference. During his bachelor and master studies, he worked in the area of secure long-term archiving. Christian is recognised as a Fellow of the Higher Education Academy (FHEA). Contact [email protected] Administrative Responsibilities Director, Cryptography GroupChair, PGT School Progression and Awards Board (SPAB)Deputy Chair, PGT Departmental Assessment Board (DAB) Teaching IY4500/IY3821 - MSci/BSc Project (Supervisor)IY5500/IY5510 - MSc Project (Supervisor)IY5614 - Advanced Cryptography (Module Leader, from AY26/27)\"Crypto Chats\" - Advanced Cryptography Seminar (Organizer)CYM090 - Information Privacy (Module Leader) PC Memberships Current: SSR 2025, IEEE SaTML 2026, USENIX Security 2026Past:  PETS 2025, ICML 2025, USENIX Security 2025, CAST/GI Dissertation Award IT-Security 2025, NeurIPS 2025, IEEE SaTML 2025, SSR 2024, ICML 2024, TPMPC 2024, ICLR 2024, CAST/GI Dissertation Award IT-Security 2024, CAI 2023, ACM CCS 2023, NeurIPS 2023, USENIX Security 2023 (Noteworthy Reviewer Award), CSCML 2023, CAST/GI Dissertation Award IT-Security 2023, NeurIPS 2022, PrivateNLP @ NAACL 2022, ICML 2022, PPML @ CCS 2021, PrivateNLP @ NAACL 2021, PrivateNLP @ EMNLP 2020 Editor Designs, Codes and Cryptography (DESI) Standardisation Member of BSI committee IST/33/2 (Cryptography and Security Mechanisms), contributing to ISO/IEC JTC 1/SC 27/WG 2 standards PhD Students Sophie Hawkes (Supervisor)Jorele Simons (Co-Supervisor)Katy Lambert (Advisor)Tabitha Ogilvie (Advisor)Simon Pohmann (Advisor) Honors and Awards Runner-up Distinguished Paper Award at IEEE SaTML'24Noteworthy Reviewer Award at USENIX Security 2023Award for the Best Dissertation at the CS Department of TU Darmstadt in 2021 by \"Friends of TU Darmstadt e.V.\"Finalist CAST/GI Dissertation Award IT-Security 2022German IT-Security Award 2020 (2nd prize for \"ContactGuard: Mobile Private Contact Discovery\")Bug bounties from Facebook and PayPal for responsible disclosure of privacy vulnerabilitiesCROSSING Collaboration Award 2017Germany Scholarship (Deutschlandstipendium) Work Experience Since 04/2022 Lecturer in Informartion Security at ISG2021/09 – 2022/02 Postdoctoral Researcher at ENCRYPTO2016/09 – 2021/08 Doctoral Researcher at ENCRYPTO2014/04 – 2016/07 Student Research Assistant at CDC2015/10 – 2016/03 Student Teaching Assistant at GRIS Education 2016-2021 Ph.D. in Computer Science (with distinction), TU Darmstadt, Germany2013-2016 M.Sc. in Computer Science (with honors); Minor: Business Administration, Economics and Law, TU Darmstadt, Germany2010-2013 B.Sc. in Computer Science, TU Darmstadt, Germany Publications CORE A/A* ranked venues marked in bold. 2026 Felix Marx, Thomas Schneider, Ajith Suresh, Tobias Wehrle, Christian Weinert, Hossein Yalame: WW-FL: Secure and Private Large-Scale Federated Learning. In IACR Transactions on Cryptographic Hardware and Embedded Systems (CHES'26). Türkiye, Oct. 2026. CORE Ranking A. 2025 Gowri R Chandran, Thomas Schneider, Maximilian Stillger, Christian Weinert: Concretely Efficient Private Set Union via Circuit-based PSI. In 20. ACM ASIA Conference on Computer and Communications Security (ASIACCS'25). Ha Noi, Vietnam, Aug. 2025. CORE Ranking A.Hiroki Okada, Rachel Player, Simon Pohmann, Christian Weinert: On Algebraic Homomorphic Encryption and its Applications to Doubly-Efficient PIR. In EUROCRYPT 2025 - The 44. Annual International Conference on the Theory and Applications of Cryptographic Techniques. Madrid, Spain, May. 2025. Acceptance rate 20.1%. CORE Ranking A*.Hiroki Okada, Rachel Player, Simon Pohmann, Christian Weinert: On Algebraic Homomorphic Encryption and its Applications to Doubly-Efficient PIR. In 4. Annual FHE.org Conference on Fully Homomorphic Encryption (FHE.org'25). Sofia, Bulgaria, Mar. 2025. Poster. 2024 Sophie Hawkes, Christian Weinert, Teresa Almeida, Maryam Mehrnezhad: Perceptual Hash Inversion Attacks on Image-Based Sexual Abuse Removal Tools. In IEEE Security & Privacy Magazine. 2024. CORE ranking B.Christian Weinert: Unbalanced PSI: Applications, Constructions, and Combinations with PIR. In NIST Workshop on Privacy-Enhancing Cryptography (WPEC'24). Virtual Event, Sep. 2024. Contributed Talk.Yaniv Ben-Itzhak, Helen Möllering, Benny Pinkas, Thomas Schneider, Ajith Suresh, Oleksandr Tkachenko, Shay Vargaftik, Christian Weinert, Hossein Yalame, Avishay Yanai: ScionFL: Secure Quantized Aggregation for Federated Learning. In 2. IEEE Conference on Secure and Trustworthy Machine Learning (SaTML'24). Toronto, Canada, Apr. 2024. Runner-up Distinguished Paper Award.Hiroki Okada, Rachel Player, Simon Pohmann, Christian Weinert: Towards Practical Doubly-Efficient Private Information Retrieval. In 28. International Conference on Financial Cryptography and Data Security (FC'24). Willemstad, Curaçao, Mar. 2024. CORE Ranking A. 2023 Zoltán Ádám Mann, Christian Weinert, Daphnee Chabal, Joppe W. Bos: Towards Practical Secure Neural Network Inference: The Journey So Far and the Road Ahead. In ACM Computing Surveys (CSUR'23), pp. 1-37. CORE ranking A*.Laura Hetz, Thomas Schneider, Christian Weinert: Scaling Mobile Private Contact Discovery to Billions of Users. In 28. European Symposium on Research in Computer Security (ESORICS'23). The Hague, The Netherlands, 2023. CORE ranking A. 2022 Christoph Hagen, Christian Weinert, Christoph Sendner, Alexandra Dmitrienko, Thomas Schneider: Contact Discovery in Mobile Messengers: Low-cost Attacks, Quantitative Analyses, and Efficient Mitigations. In ACM Transactions on Privacy and Security (TOPS'22), pp. 1–44. CORE ranking A. 2021 Alexander Heinrich, Matthias Hollick, Thomas Schneider, Milan Stute, Christian Weinert: Breaking and Fixing Contact Identifier-based Mutual Authentication in Apple AirDrop. In 1. Future of PI: Challenges and Perspectives of Personal Identification EuroS&P Workshop (FoPI@EuroS&P’21). Virtual Event, Sep. 2021. Contributed Talk.Christian Weinert: Practical Private Set Intersection Protocols for Privacy-Preserving Applications. PhD thesis, TU Darmstadt, Germany, August 31, 2021.Alexander Heinrich, Matthias Hollick, Thomas Schneider, Milan Stute, Christian Weinert: PrivateDrop: Practical Privacy-Preserving Authentication for Apple AirDrop. In 30. USENIX Security Symposium (USENIX Security’21). Vancouver, Canada, Aug. 2021, pp. 3577–3594. Acceptance rate 19.0%. CORE ranking A*.Daniel Demmler, Stefan Katzenbeisser, Thomas Schneider, Tom Schuster, Christian Weinert: Improved Circuit Compilation for Hybrid MPC via Compiler Intermediate Representation. In 18. International Conference on Security and Cryptography (SECRYPT’21). Virtual Event, Jul. 2021, pp. 444–451. Short paper. Acceptance rate 28.2%. CORE ranking B.Alexander Heinrich, Matthias Hollick, Thomas Schneider, Milan Stute, Christian Weinert: AirCollect: Efficiently Recovering Hashed Phone Numbers Leaked via Apple AirDrop. In 14. ACM Conference on Security and Privacy in Wireless and Mobile Networks (WiSec’21). Abu Dhabi, UAE, Jun. 2021, pp. 371–373. Demo. Acceptance rate (poster and demonstrator track) 78.6%.Tim Heldmann, Thomas Schneider, Oleksandr Tkachenko, Christian Weinert, Hossein Yalame: LLVM-based Circuit Compilation for Practical Secure Computation. In 19. International Conference on Applied Cryptography and Network Security (ACNS’21). Kamakura, Japan, Jun. 2021, pp. 99–121. Acceptance rate 19.9%. CORE ranking B.Christoph Hagen, Christian Weinert, Christoph Sendner, Alexandra Dmitrienko, Thomas Schneider: All the Numbers are US: Large-scale Abuse of Contact Discovery in Mobile Messengers. In 28. Annual Network and Distributed System Security Symposium (NDSS’21). San Diego, CA, USA, Feb. 2021. Acceptance rate 15.2%. CORE ranking A*. 2020 Heiko Mantel, Lukas Scheidel, Thomas Schneider, Alexandra Weber, Christian Weinert: RiCaSi: Rigorous Cache Side Channel Mitigation via Selective Circuit Compilation. In 19. International Conference on Cryptology And Network Security (CANS’20). Vienna, Austria, Dec. 2020, pp. 505–525. Acceptance rate 25.4%. CORE ranking B.Amos Treiber, Alejandro Molina, Christian Weinert, Thomas Schneider, Kristian Kersting: CryptoSPN: Expanding PPML beyond Neural Networks. In 1. Privacy Preserving Machine Learning in Practice CCS Workshop (PPMLP@CCS’20). Orlando, Florida, USA, Nov. 2020, pp. 9–14.Amos Treiber, Alejandro Molina, Christian Weinert, Thomas Schneider, Kristian Kersting: CryptoSPN: Privacy-preserving Sum-Product Network Inference. In 24. European Conference on Artificial Intelligence (ECAI’20). Santiago de Compostela, Spain, Aug. 2020, pp. 1946–1953. Acceptance rate 26.8%. CORE ranking A.Rosario Cammarota, Matthias Schunter, Anand Rajan, Fabian Boemer, Ágnes Kiss, Amos Treiber, Christian Weinert, Thomas Schneider, Emmanuel Stapf, Ahmad-Reza Sadeghi, Daniel Demmler, Huili Chen, Siam Umar Hussain, Sadegh Riazi, Farinaz Koushanfar, Saransh Gupta, Tajan Simunic Rosing, Kamalika Chaudhuri, Hamid Nejatollahi, Nikil Dutt, Mohsen Imani, Kim Laine, Anuj Dubey, Aydin Aysu, Fateme Sadat Hosseini, Chengmo Yang, Eric Wallace, Pamela Norton: Trustworthy AI Inference Systems: An Industry Research View. arXiv:2008.04449.Sebastian P. Bayerl, Tommaso Frassetto, Patrick Jauernig, Korbinian Riedhammer, Ahmad-Reza Sadeghi, Thomas Schneider, E",
  "content_length": 18448,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:25"
}