{
  "name": "Christopher M. Hoadley",
  "homepage": "https://ed.buffalo.edu/about/directory/faculty/profile.html?uid=tophe",
  "status": "success",
  "content": "Faculty Profile - Graduate School of Education - University at Buffalo University at Buffalo Christopher Hoadley (he/him) Director, UB Institute for Learning Sciences Professor LEARNING AND INSTRUCTION Specialty/Research FocusComputer Science Education; Information Science; Information behavior; Design Experiments; Educational technology; Human Computer Interaction; Learning SciencesContact Information350 Foster Hall, South CampusPhone: 716-645-7787 tophe@buffalo.eduView mapView CV Overview Publications Grants ActivitiesOverview: Professional Summary:Dr. Chris Hoadley is a professor and director of the Institute for Learning Sciences at the University at Buffalo. He has over 45 years experience designing and building educational technology, and has conducted research on the connections between technology, learning, and collaboration for over 30 years. His work focuses on collaborative technologies, computer support for cooperative learning (CSCL), and design-based research methods, a term he coined in the late 1990s. Hoadley is the director of dolcelab, the Laboratory for Design Of Learning, Collaboration & Experience. He is a fellow of the International Society for the Learning Sciences (ISLS) and was an affiliate scholar for the National Academy of Engineering's Center for the Advancement of Scholarship in Engineering Education (CASEE). Hoadley was awarded a Fulbright Fellowship in the South Asia Regional Research program to study educational technologies for sustainability and empowerment in rural Himalayan villages in 2008-2009. From 2011-2013, he was program director of the Educational Technology programs at NYU and founding program director of the Games for Learning program, and on the founding faculty presidium of MAGNET, the NYU Media And Games Network. From 2013-2016, he was on loan to the National Science Foundation as the program director in charge of the Cyberlearning and Future Learning Technologies program in the Directorate of Computer and Information Science and Engineering and the Directorate of Education and Human Resources Division of Research on Learning. Other interests include research on and through design, systems for supporting social capital and distributed intelligence, the role of informatics and digital libraries in education, and science and engineering education. Hoadley previously chaired the American Educational Research Association's Special Interest Group for Education in Science and Technology (now SIG: Learning Sciences), and served as the co-founder and first president of the International Society of the Learning Sciences. He previously taught at Stanford University, Mills College, Penn State University, and New York University in education, computer science, and information sciences, and has authored or co-authored over 100 peer-reviewed publications and presentations.Education and Training:M.S., UC Berkeley, Computer SciencePh.D., UC Berkeley, Science and Math EducationS.B., MIT, Brain and Cognitive SciencesPublications: Recent Publications: Edited Book:Computer Science Educational Justice Collective. (2025). Advancing Educational Equity in Computer Science: A Guide for Educators and Their Allies (First Pressbooks ed.). CS-EJC and SUNY Press. http://aeecs.pressbooks.sunycreate.cloudJournal Article:Hoadley, C., & Vogel, S. (2024). Autocorrect Is Not: People Are Multilingual and Computer Science Should Be Too. Communications of the ACM, 67(2), 16-18. https://doi.org/10.1145/3633585Ince, S., Hoadley, C., & Kirschner, P. A. (2024). Collaborative technology practices in social science early career scholarly research workflows. Journal of Librarianship and Information Science, 56(2), 308-317. https://doi.org/10.1177/09610006221140124:De, S., & Hoadley, C. (2025). Mind Meets Machine- A Cognitive Approach to Artificial Intelligence (AI) Basics. Society for Information Technology & Teacher Education International Conference, Orlando.Paljor, Y., Proctor, C., Honwad, S., Decker, A., & Hoadley, C. (2025). Culturally Sustaining Computing Education for Tibetan Diaspora Youth: Engaging Heritage Identity Through Computing. Proceedings of the 19th International Conference of the Learning Sciences - ICLS 2025, Helsinki.Grants:Activities:Contact Information 350 Foster Hall, South CampusPhone: 716-645-7787 tophe@buffalo.eduView mapView CVLogin to Update Your Profile",
  "content_length": 4366,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:24"
}