{
  "name": "Christian Bizer",
  "homepage": "https://www.uni-mannheim.de/dws/people/professors/prof-dr-christian-bizer",
  "status": "success",
  "content": "Prof. Dr. Christian Bizer | Universität Mannheim Skip to main navigation Skip to page content Skip to footer Chair of Information Systems V: Web-based SystemsUniversität MannheimB6, 26, Room B 1.15D-68159 MannheimEmail:  christian.bizer (at) uni-mannheim.de Phone: +49 621 181 2677ORCID:  0000-0003-2367-0237 Scholar: Christian Bizer OverviewChristian Bizer investigates methods for integrating data from large numbers of data sources in the context of the open Web and in corporate data lakes. His research interests include entity matching, schema matching, table annotation, information extraction, and data discovery. The current focus of his work is leveraging large language models and LLM-based agents for data integration tasks. Christian Bizer co-founded the DBpedia project which derives a comprehensive knowledge graph from Wikipedia. He also initialized the WebDataCommons project which monitors the adoption of schema.org, JSON-LD, Microdata, and Microformats on the Web by analyzing large Web crawls. Christian Bizer is a full professor at the University of Mannheim, where he leads the focus group Web-based Systems within the Data and Web Science Group. Paper on LLM-based Table Annotation presented at ADBIS 2025Keti Korini presented our paper Evaluating Knowledge Generation and Self-refinement Strategies for LLM-Based Column Type Annotation at the 29th European Conference on Advances in Databases and Information Systems in Tampere, Finland.Alexander Brinkmann has successfully defended his PhD ThesisAlexander Brinkmann has successfully defended his PhD thesis titled “Integrating Product Data from the Web using Deep Learning Techniques” today.WebMall Benchmark for Evaluating LLM-Agents ReleasedWe are happy to announce the initial release of the WebMall benchmark for evaluating the capability of LLM-agents to find and compare product offers across multiple e-shops.Paper on fine-tuning LLMs for entity matching presented at DAIS@ICDEAaron Steiner presented our paper Fine-tuning Large Language Models for Entity Matching at the Data-AI Systems (DAIS) workshop at the ICDE 2025 conference in Hong Kong.all news Open Data Publishing ProjectsDBpedia – Querying Wikipedia like a DatabaseWeb Data Commons – Schema.org Dataset SeriesWeb Data Commons – Web Tables Corpus Open Source Software ProjectsMatchGPT – Entity Matching using Large Language ModelsExtractGPT – Attribute Value Extraction using Large Language ModelsWebMall – A Multi-Shop Benchmark for Evaluating Web AgentsPyDI – Python Data Integration Frameworkour projects on github, additional older projects ... Invited TalksThis section links to abstracts and slidesets of recent talks. Additional slidesets from older talks are found at Slideshare. Some of the talks have been recorded and the videos are found on Videolectures.net.  Christian Bizer:  GPT4 Versus BERT: Which Foundation Model Is More Suitable for Web Data Integration? (Slides). Keynote Talk at the 19th International Conference on Web Information Systems and Technologies (WEBIST), Rome, Italy, November 2023.Christian Bizer:  Training Transformer-based Entity Matchers using the Web as Supervision (Slides (PDF, 3 MB)). Invited Talk at SCADS.AI Summer School, Leipzig, Germany, July 2022.Christian Bizer: Integrating Product Data from the Semantic Web using Deep Learning Techniques (Slides (PDF, 3 MB)). Invited Talk at Ingénierie des Connaissances @ FIPA2022, Saint-Étienne, France, June 2022.Christian Bizer: Data Integration using Deep Learning Techniques (PDF, 3 MB). Invited Talk at SAP Inspiration Sessions, online, May 2022.Christian Bizer: Completing Knowledge Graphs using Data from the Open Web (Slides). Keynote talk at 9th Joint International Semantic Technology Conference (JIST 2019), Hangzhou, China, November 2019.Christian Bizer: Schema.org Annotations and Web Tables: Underexploited Semantic Nuggets on the Web?  (Slides). Keynote talk at 2nd Language, Data, Knowledge (LDK 2019), Leipzig, Germany, May 2019.Christian Bizer: Exploiting Semantics Where We Find Them – A Bottom-up Approach to the Semantic Web (PDF, 2 MB). Seminar on Contemporary Challenges in Linked Data Research and Practice. Vrije Universiteit Amsterdam, Netherlands, June 2018.Christian Bizer: Is the Semantic Web what we Expected? Deployment Patterns and Data-driven Challenges (Slides, Video). Keynote talk at 15th International Semantic Web Conference (ISWC 2016), Kobe, Japan, October 2016.Christian Bizer: Exploring the Application Potential of Relational Web Tables (PDF, 103 kB) (Slides (PDF, 869 kB)). Invited talk at Lernen. Wissen. Daten. Analysen (LWDA 2016). Potsdam, Germany, September 2016.Christian Bizer: Data Search and Search Joins (PDF, 8 MB). Invited Talk at the Department of Computational Linguistics, Heidelberg University, November 2015.Christian Bizer: Evolving the Web into a Global Dataspace, Advances and Applications. Keynote talk at the 18th International Conference on Business Information Systems (BIS2015), Poznań, Poland, June 2015. Christian Bizer: Schema.org Annotations in Webpages – Opportunities & Challenges for the Tourism Industry (PDF, 4 MB). Invited talk at the TourismFastForward Conference, Mayrhofen, Austria, April 2015.Oliver Lehmberg, Dominique Ritze, Petar Ristoski, Kai Eckert, Heiko Paulheim and Christian Bizer: Extending Tables with Data from over a Million Websites (PDF, 380 kB) (Slides (PDF, 4 MB)). Semantic Web Challenge 2014, Winner of the Big Data Track, Riva del Garda, Italy, October 2014.Robert Meusel, Sebastiano Vigna, Oliver Lehmberg, Christian Bizer: Graph Structure in the Web — Revisited (PDF, 279 kB) (Slides). 23rd International World Wide Web Conference (WWW2014), Web Science Track, Seoul, Korea, April 2014.Christian Bizer: Search Joins with the Web (PDF) (Slides). Invited Lecture at the 17th International Conference on Database Theory (ICDT2014), Athens, Greece, March 2014.Conference and Workshop OrganizationMining the Web of HTML-embedded Product Data. Benchmark Competition at ISWC2020. November 2020, Online (Co-Chair)Lernern. Wissen. Daten. Analysen (LWDA 2018), August 2018, Mannheim, Germany (Local Chair)10th International Workshop on Linked Data on the Web (LDOW 2017), April 2017, Perth, Australia (Co-Chair)9th International Workshop on Linked Data on the Web (LDOW 2016), April 2016, Montreal, Canada (Co-Chair)8th International Workshop on Linked Data on the Web (LDOW 2015), May 2015, Florence, Italy (Co-Chair)7th International Workshop on Linked Data on the Web (LDOW 2014), April 2014, Seoul, Korea (Co-Chair)6th International Workshop on Linked Data on the Web (LDOW 2013), May 2013, Rio de Janeiro, Brazil (Co-Chair)5th International Workshop on Linked Data on the Web (LDOW 2012), April 2012, Lyon, France (Co-Chair)Semantic Web Challenge at ISWC2011, October 2011, Koblenz, Germany (Co-Chair)4th International Workshop on Linked Data on the Web (LDOW 2011), March 2011,Hyderabad, India (Co-Chair)Semantic Web Challenge at ISWC2010, November 2010, Shanghai, China (Co-Chair)3rd International Workshop on Linked Data on the Web (LDOW 2010), April 2010, Raleigh, U.S.A. (Co-Chair)Semantic Web Challenge at ISWC2009, October 2009, Washington, USA (Co-Chair)2nd International Workshop on Linked Data on the Web (LDOW 2009), April 2009, Madrid, Spain (Co-Chair)7th International Semantic Web Conference (ISWC2008), October 2008, Karlsruhe, Germany (Poster & Demos Co-Chair)Triplification Challenge at I-Semantics 2008, September 2008, Graz, Austria (Organizer)5th European Semantic Web Conference (ESWC 2008), June 2008, Tenerife, Spain (Semantic Web Technologies Coordinator)older workshops and conferences ...Editorial Board Memberships of Scientific JournalsJournal on Data and Information QualityJournal of Web SemanticsTransactions on Graph Data and KnowledgeProgram Committees and Reviewing for Scientific JournalsACM Web Conference (WWW2026), April 2026, Dubai, United Arab Emirates.ACM SIGMOD  (SIGMOD 2026), May 2026, Bengaluru, India.24th International Semantic Web Conference (ISWC 2025), Research Track, November 2025, Nara, Japan.ACM Web Conference (WWW2025), April 2025, Sydney, Australia.Elsevier Expert Systems with Applications18th ACM International Conference on Web Search and Data Mining (WSDM 2024), March 2025, Hannover, Germany.23th International Semantic Web Conference (ISWC 2024), Research Track, November 2024, Baltimore, USA.33rd ACM International Conference on Information and Knowledge Management (CIKM 2024), October 2024, Boise, USA.47th German Conference on Artificial Intelligence (KI 2024), September 2024, Würzburg, Germany.21th Extended Semantic Web Conference (ESWC2024), May 2024, Heraklion, Greece.17th ACM International Conference on Web Search and Data Mining (WSDM 2024), March 2024, Mérida, Mexico.22th International Semantic Web Conference (ISWC 2023), Research Track, November 2023, Athens, Greece.Springer Electronic Commerce ResearchElsevier Information Systems JournalElsevier Information Processing and Management JournalSemantic Web JournalVLDB JournalTransactions on the Web20th European Semantic Web Conference (ESWC2023), May 2023, Heraklion, Greece.ACM Web Conference (WWW2023), April 2023, Austin, Texas, USA.16th International Conference on Web Search and Data Mining (WSDM2023), Februar 2023, Singapore, Singapore.21th International Semantic Web Conference (ISWC 2022), Research Track, October 2022, Hangzhou, China.31st Web Conference (WWW2022), April 2022, Lyon, France.Elsevier Knowledge-based Systems20th International Semantic Web Conference (ISWC 2021), Research Track, October 2021.47th International Conference on Very Large Data Bases (VLDB 2021), August 2021, Copenhagen, Denmark.30th Web Conference (WWW2021), April 2021, Ljubljana, Slovenia.older PC memberships ... Google Scholar gives an idea which of my papers are highly cited.  DBLP and Semantic Scholar maintain further lists of my publications. 2026Korini, K. and Bizer, C. (2026). Evaluating knowledge generation and self-refinement str",
  "content_length": 21958,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:57"
}