{
  "name": "Christian Schaffner",
  "homepage": "https://staff.science.uva.nl/c.schaffner",
  "status": "success",
  "content": "Homepage of Christian Schaffner Personal homepage of Christian Schaffner Home Team & News Publications Talks & Media Bio Archive Position-Based Quantum Crypto Teaching Contact I am Professor in Theoretical Computer Science and group leader of the Theory of Computer Science (TCS) group at the Informatics Institute at the University of Amsterdam, Netherlands. I'm director of QuSoft, the Dutch research center for quantum software, a collaboration of CWI and the University of Amsterdam. My TCS group is part of the large Amsterdam TCS community and is closely connected to the QuSoft research line \"Cryptography in a Quantum World\". In case we are looking for students and postdocs, the positions are announced here. Since September 2020, I am the chairman of Quantum.Amsterdam, an innovation hub for quantum software, technology and applications. I am the chairman of the Talent & Outreach Committee of the Quantum Software Consortium (QSC). With the help of Stacey Jeffery, Ulle Endriss and Wan Fokkink, I have created an overview website of the academic research in theoretical computer science (TCS) carried out in Amsterdam: https://theory.amsterdam. My research interests are Quantum Cryptography, Cryptographic Protocols, and (Quantum) Information Theory. I have obtained various grants from Netherlands Organisation for Scientific Research (NWO), such as VENI, VIDI and a gravitation grant. On Friday, 30 September 2022, I have given my inaugural lecture as professor in theoretical computer science. You can watch back the recording of it, or check out my other media and podcast appearances. From January to July 2020, I was on an academic sabbatical catching the Quantum wave in Computing at Simons institute in Berkeley, California. I did my PhD in the Cryptology Group at BRICS, Computer Science Department of Aarhus University. My PhD advisors were Louis Salvail and Ivan Damgård. Before that, I studied mathematics at ETH Zürich and wrote my Diploma thesis under supervision of Renato Renner and Ueli Maurer. I was co-organizing the 2021 and 2020 online editions of QCrypt. Before that, I have been a member and chair of the steering committee of the annual QCrypt conference. I am chairing the program committee of QCrypt 2023. I was the program committee chair of QCrypt 2023. I have served on various program committees (CRYPTO 2022, QIP 2022, TCC 2021, ITC 2020, EUROCRYPT 2019, AQIS 2018, PKC 18, CRYPTO 2017, TQC 2016, TQC 2015, EUROCRYPT 2015, QCRYPT 2014, SCN 2014, CRYPTO 2013, QCRYPT 2013, ICITS 2012, QIP 2012, QCRYPT 2011, ICITS 2011, WISSEC 2010 and the cryptography track of RSA 09). I have been on review panels of various grant agencies such as NWO, ANR, QuantERA, etc. From March 2018 to March 2022, I served on the editorial board of the Quantum Science and Technology journal, published by IOP. I have been teaching various courses about cryptography and information theory at the University of Amsterdam. Since spring 2016, I have made positive experiences of teaching courses in fully-flipped-classroom style. Check, e.g., this report, or this interview. In my spare time, I enjoy playing Ultimate Frisbee and tennis. Follow me @theoryamsterdam Last update: 4 October 2025",
  "content_length": 3209,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:20"
}