{
  "name": "Christoph Lindemann",
  "homepage": "https://rvs.informatik.uni-leipzig.de/de/mitarbeiter/lindemann",
  "status": "success",
  "content": "Lindemann Universität Leipzig Institut für Informatik StartseiteMitarbeiterForschungLehrePublikationenPromotionenAdresseImpressumBarrierefreiheit Prof. Dr.-Ing. Christoph Lindemann Universität Leipzig Institut für Informatik Lehrstuhl für Rechnernetze und Verteilte Systeme Augustusplatz 10 04109 Leipzig Büro: P435 Telefon: +49 341 97 32271 Telefax: +49 341 97 32289 E-Mail: Senden Christoph Lindemann leitet seit November 2005 den Lehrstuhl für Rechnernetze und Verteilte Systeme an der Universität Leipzig. In der Zeit von März 1998 bis Oktober 2005 war er Professor für praktische Informatik an der Universität Dortmund. Er hat 1988 sein Informatikstudium an der Universität Karlsruhe (TH) abgeschlossen und 1992 an der Technischen Universität Berlin zum Doktor-Ingenieur (Dr.-Ing.) promoviert. Von 1994 bis 1997 war er als Wissenschaftler und Projektleiter am GMD Institut für Rechnerarchitektur und Softwaretechnik, das heutige Fraunhofer Institut FIRST in Berlin, tätig. Im Sommer 1993 und während des akademischen Jahres 1994/1995 war er als Visiting Scientist am IBM Almaden Research Center, San Jose USA beschäftigt. Im Wintersemester 2003/04 war Christoph Lindemann im Rahmen seines Forschungssemesters als Visiting Professor am Computer Science Department der University of Wisconsin beschäftigt. Seine aktuellen Forschungsinteressen liegen in den Bereichen mobile Anwendungen und Protokollunterstützung für drahtlose Multihop-Netze sowie Modellbildung und stochastische Analyse des World Wide Web, insbesondere Computational Advertising. Christoph Lindemann ist Mitglied der IFIP Arbeitsgruppe 7.3 und Senior Member in der IEEE, dem Weltverband der Informations- und Kommunikationstechnologien. Er war Mitherausgeber der internationalen Fachzeitschrift Performance Evaluation von 2005 bis 2010. Er war Mitglied im Executive Board der ACM SIGMETRICS von 2007 bis 2011. Ferner war er Sprecher der GI/ITG Fachgruppe Messung, Modellierung und Bewertung von Rechensystemen und Kommunikationsnetzen von 2005 bis 2008. Im Jahr 2005 war er General Co-chair der internationalen Fachtagung ACM MobiCom. Christoph Lindemann war General Chair der Internationalen Fachtagung Performance 2007 und Co-chair des Programmkommitees der internationalen Fachtagung ACM MobiHoc 2010.",
  "content_length": 2275,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:49"
}