{
  "name": "Christopher Maddison",
  "homepage": "https://www.cs.toronto.edu/~cmaddis",
  "status": "success",
  "content": "Chris J. Maddison Chris J. Maddison Assistant Professor, University of Toronto CIFAR AI Chair, Vector Institute I study algorithms that learn to make good predictions in stubbornly complex settings. At the moment, my group is working on methods for AI in drug discovery, causal inference with natural language data, scaling dynamics of large language models, data preparation. I tend to publish at machine learning conferences (NeurIPS, ICML, ICLR). The success of large language models is driven by the abundance and natural structure of data. What does this tell us about our universe and ourselves? How can we use these insights to advance applications in other domains? I am interested in understanding how the statistical structure of real-world data influences the emergence of capabilities in AIs as they train on vast, heterogeneous datasets. Group Members Prospective trainees, please read this. Margarita Colberg (Postdoc with Matthieu Schapira) Nikita Dhawan (PhD with Roger Grosse) Honghua Dong (PhD with Xujie Si) Haonan Duan (PhD with Nicolas Papernot) Ayoub El Hanchi (PhD with Murat Erdogdu) Chuning Li (PhD) Yujia Ma (PhD with Rahul Krishnan) Yangjun Ruan (PhD) Anvith Thudi (PhD with Nicolas Papernot) Former Group Members Dami Choi (former PhD) Member of Technical Staff at Transluce Leo Cotta (former postdoc) Research Scientist at Ellison Institute of Technology Nishkrit Desai (former undergraduate) at Axiom Yann Dubois (former intern) Member of Technical Staff at OpenAI Mingjian Jiang (former undergraduate) MSc at Stanford Daniel Johnson (former PhD) Member of Technical Staff at Transluce Max Paulus (former PhD) Member of Technical Staff at Magic AI Peter Potaptchik (former undergraduate) DPhil at Oxford Evianne Rovers (former intern) Postdoc at Cambridge Karen Ullrich (former postdoc) Research Scientist at Facebook AI Research Giulia Zarpellon (former staff) Data Scientist at Eurecat Links Publications GitHub Teaching Biography Writing Beliefs Contact",
  "content_length": 1986,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:24"
}