{
  "name": "Christoph W. Borst",
  "homepage": "https://cmix.louisiana.edu/news-events/news/20170103/dr-christoph-borst-named-state-winner-lacue%E2%80%99s-2016-post-secondary-educator",
  "status": "success",
  "content": "Dr. Christoph Borst Named State Winner of LACUE’s 2016 Post-Secondary Educator Award | School of Computing & Informatics Skip to main content You are hereHome » News & Events » News Top Stories Science Day 2024 attracted more than 700 high school students to CMIX On Friday, October 18, 2024, the School of Computing and Informatics (CMIX) hosted the Science Day event. Read More ➝ Congratulations to Dr. Hei and her team for the distinguished paper award Congratulations to Dr. Read More ➝ Spring Fest 2024 at CMIX was a Success Spring Fest 2024 at Oliver Hall was a vibrant celebration that boosted our community spirit. Read More ➝ Dr. Christoph Borst was selected as the 2016 winner of both the Region 4 and the statewide Post-Secondary Educator of the Year awards by the Louisiana Association of Computer Using Educators (LACUE). These competitive awards recognize Borst’s achievements in advancing virtual reality (VR) at UL Lafayette, including developing VR for education at multiple levels. Borst, who holds a Hardy Edmiston Endowed Professorship of Computer Science, established the CACS Virtual Reality Lab at UL in 2003 and began teaching a full course on VR in 2004. Only about 3% of universities worldwide offered such courses at the time, and Borst’s course at UL was the only one of its kind in Louisiana, according to a major global survey. The course is currently taught as \"Game Development and Virtual Reality\" at both the undergraduate and graduate levels in UL's School of Computing and Informatics. At the CACS Virtual Reality Lab, Borst currently leads over $500,000 in active grants and collaborates on additional major interdisciplinary grants with other UL faculty. This funds the lab’s educational and research goals, with support from the National Science Foundation, the Louisiana Board of Regents, and industry members of the Center for Visual and Decision Informatics. Recent lab research addresses topics such as VR technology for workforce training, classroom-deployable VR for K–12 STEM education, and improving computer interfaces for scientists to explore datasets interactively. LACUE, a professional organization promoting technology in education, honors stand-out educators at regional and state levels each year. Awardees were first selected in eight regions across Louisiana, based on nominations open to all educators at schools in Louisiana. State-level winners were then selected from the pool of regional winners with the help of out-of-state evaluators. LACUE announced the award winners at their annual conference in New Orleans on December 8, 2016. The CACS VR lab provides assistantships for graduate researchers, REU traineeships for undergraduates, and a wide range of VR equipment for education and research. More information about the CACS Virtual Reality Lab can be found at http://web.cacs.louisiana.edu/labs/vrlab/ Photo credit: Joe Pons Photography, LLC SHARE THIS |",
  "content_length": 2924,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:54"
}