{
  "name": "Christian Blouin",
  "homepage": "https://www.dal.ca/faculty/computerscience/faculty-staff/christian-blouin.html",
  "status": "success",
  "content": "Dr. Christian Blouin - Faculty of Computer Science - Dalhousie University Support Dal Current Students Faculty & Staff Family & Friends Campuses Agricultural Campus (Truro) Halifax Campuses Directory Campus Maps myDal Dal Online Brightspace OpenDal myDal Directory Maps OpenDal Brightspace Dal Online Students Faculty & Staff Family & Friends Support Dal OpenDal Brightspace Dal Online Students Faculty & Staff Family & Friends Support Dal Dalhousie University Study Admissions Campus Life Libraries Research and Innovation Alumni About Dal Faculty of Computer Science For Current Students For Faculty & Staff Home About Current Students Undergraduate Graduate Research News & Events Dr. Christian Blouin Professor; Associate Dean, Academic Connect with me My website My research cluster: Algorithms & Bioinformatics Faculty of Computer Science Email: cblouin@cs.dal.ca Phone: 902-401-6334 Mailing Address: Location: Room 224Faculty of Computer Science Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada Research Topics: Protein evolution and biophysics Algorithms Phylogenetics High-performance computing Statistical mechanics Molecular modeling Additional Details Education: Ph.D. - Dalhousie University (2001) B.Sc. - Université Laval (1997) Titles & Honours: TULA fellow Funding: NSERC TULA foundation CFI Publications: Published in refereed journals Liu, H., Keselj, V., Blouin, C., Biological Event Extraction using Subgraph Matching, Computational Intelligence, in press. Langelaan DN, Wieczorek M, Blouin C, Rainey JK. Improved helix and kink characterization in membrane proteins allows evaluation of kink sequence predictors., J Chem Inf Model. 2010, 50(12):2213-20. Volkmann G, Murphy PW, Rowland EE, Cronan JE Jr, Liu XQ, Blouin C, Byers DM. Intein-mediated cyclization of bacterial acyl carrier protein stabilizes its folded conformation but does not abolish function. J Biol Chem. 2010 Jan 18 Liu H., Blouin C., Keselj V. Identifying Interaction Sentences from Biological Literature Using Automatically Extracted Patterns. Data \\& Knowledge Engineering, 2010, 69(1), 137-152. Blouin C., Perry S.,Lavell A., Susko E., Roger A.J. Reproducing the manual annotation of multiple sequence alignments using a SVM classifier, Bioinformatics, 23(25): p.3093-8. Parks, D.H., Porter, M., Wang, S., Churcher, S., Whalley, J., Blouin, C., Brooks, S. and Beiko, R.G. GenGIS: A Geospatial Information System for Genomic Data. Genome Research, 2009, 19:1896-1904. Hickey, G., Dehne, F., Rau-Chaplin, A., Blouin, C. SPR distance computations for unrooted trees. Evolutionary Bioinformatics, 2008, 4. 17-27. Jiang, H., Blouin, C. Insertions and the emergence of novel protein structure: a structure-based phylogenetic study of insertions. BMC Bioinformatics. 2007 Nov 15;8:444. Samuels, M.E., Higgins, B., Provost, S., Marcadier, J., Blouin, C., Bowman, S., Dube, M-P. 2007. New Technologies in human genetic analysis., American Biotechnology Laboratory, 25:22-28. Pepke, S.L., Butt, D., Nadeau, I., Roger, A.J. and Blouin C. (2007) Inferring Phylogenies by confidence set optimization., J Mol Evol. 64(1):80-9. Jiang, H., Blouin, C., 2006. Ab Initio Construction of All-atom Loop Conformations. J. Mol. Modeling, 12(2):221-8. Siddiqi, F, Bourque, J., Jiang, H., Gardner, M., St. Maurice, M., Blouin, C., and Bearne S.L., Perturbing the Hydrophobic Pocket of Mandelate Racemase to Probe Phenyl Motion During Catalysis. Biochemistry 44(25):9013-21 Blouin, C., Butt, D., Roger, A.J. 2005. The impact of taxon sampling on the estimatio nof rate of evolution at sites. Mol. Biol. Evol., 22(3): 784-791. Butt, D., Roger, A.J., Blouin, C. 2005. libcov: A C++ bioinformatic library to manipulate protein structures, sequence alignments and phylogeny BMC Bioinformatics, 6: 138. Blouin, C. Butt, D. and Roger, A.J. 2004. Rapid evolution in conformational space: a study of loop regions in a ubiquitous GTP binding domain. Prot. Sci., 13:608-616. Blouin, C., Boucher, Y., and Roger, A.J. 2003. Inferring functional constraints and divergence in protein families using 3D mapping of phylogenetic information. Nucleic Acids Res 31: 790-797. Inagaki, Y., Blouin, C., Susko, E., and Roger, A.J. 2003. Assessing functional divergence in EF-1alpha and its paralogues in eukaryotes and archaebacteria. Nucleic Acids Res 31: 4227-4237. Shan Y, Milios E, Roger AJ, Blouin C and Susko E. 2003. Automatic recognition of regions of intrinsically poor multiple alignment. Proc. IEEE bioinformatics conference, San-Francisco, 482-483. Susko E, Field C, Blouin C and Roger AJ. 2003. Estimation of rate distribution in phylogenetic models., Syst. Biol, 52:594-603. Inagaki, Y., Blouin, C., Doolittle, W.F., and Roger, A.J. 2002. Convergence and constraint in eukaryotic release factor 1 (eRF1) domain 1: the evolution of stop codon specificity. Nucleic Acids Res 30: 532-544. Blouin, C., Guillemette, J.G., and Wallace, C.J. 2002. Probing electrostatic interactions in cytochrome c using site-directed chemical modification. Biochem Cell Biol 80: 197-203. Archibald, J.M., Blouin, C., and Doolittle, W.F. 2001. Gene duplication and the evolution of group II chaperonins: implications for structure and function. J Struct Biol 135: 157-169. Blouin, C., Guillemette, J.G., and Wallace, C.J. 2001. Resolving the individual components of a pH-induced conformational change. Biophys J 81: 2331-2338. Blouin, C., and Wallace, C.J. 2001. Protein matrix and dielectric effect in cytochrome c. J Biol Chem 276: 28814-28818. Bearne, S.L., and Blouin, C. 2000. Inhibition of Escherichia coli glucosamine-6-phosphate synthase by reactive intermediate analogues. The role of the 2-amino function in catalysis. J Biol Chem 275: 135-140. Conference presentations Haibin Liu, Christian Blouin, and Vlado Keselj, Biological Event Extraction using Subgraph Matching, In Proceedings of SMBMÂ´10, Fourth International Symposium on Semantic Mining in Biomedicine, Hinxton, Cambridgeshire, UK, October 2010. Vlado Keselj, Haibin Liu, Norbert Zeh, Christian Blouin, Chris Whidden. Finding optimal parameters for Edit-distance based classification is NP-hard. StReBio'09, Paris, June 2009. Beiko, R., Whalley, J., Wing, S., Clair, H., Smolyn, G., Churcher, S., Porter, M., Blouin, C., Brooks, S. Spatial Analysis and Visualization of Genetic Biodiversity., Proc. for FOSS4G, Cape-town, S. Africa, 2008. p. 316-324. Liu, H, Blouin. C., Keselj, V. 2007. Supervised Method for Extracting Domain-specific Affixes in Biological Hickey, G., Dehne, F., Rau-Chaplin, A., Blouin, C. 2007. The Complexity of Unrooted SPR Distance., DOOM 2007, the New Zealand Phylogenetic Conference. C. Blouin, D. Butt, G. Hickey, A. Rau-Chaplin, 2006. Fast Parallel Maximum Likelihood-based Protein Phylogeny, 18th International Conference on Parallel and Distributed Computing Systems Shan, Y., Milios, E., Roger, A.J., Blouin, C. and Susko, E. 2003. Automatics recognition of regions of intrinsically poor multiple alignment. Proc. IEEE bioinformatics conference, San-Francisco. 482-483. Funding: . Blouin, C., Wallace C.J.A. Charge solvation inside proteins: Proposed rationale for the abnormal pK of heme propionate-6 of mitochondrial cytochrome c, FASEB JOURNAL 13 (7): A1393-A1393 Suppl. Faculty of Computer Science, Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada inquiries@cs.dal.ca Contact the Faculty of Computer Science Campus Directory Campus Map Privacy Statement Terms of Use Media Centre Contact the Faculty of Computer Science Campus Directory Campus Map Faculty of Computer Science, Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada 902-494-2093 inquiries@cs.dal.ca",
  "content_length": 7707,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:56"
}