{
  "name": "Christopher W. Johnson 0001",
  "homepage": "http://www.dcs.gla.ac.uk/~johnson",
  "status": "success",
  "content": "Prof. Chris Johnson FRSE, FRAeS, FBCS, Chris Johnson's Home Page I'm Professor and Head of Computing Science at Glasgow University. I am a Fellow of the Royal Society of Edinburgh, Fellow of the Royal Aeronautical Society and of the British Computing Society. I coordinate Government and Policy consultations for UK Computing Research, (UKCRC). I am also a member of UKRI/EPSRC ICT Strategic Advisory Team. The main focus for my research is at the interface between safety and security - for example, developing techniques so that we can continue to ensure safety while gathering forensic evidence in the aftermath of a cyber-attack. Here are some videos introducing my work. Civil Nuclear: I have worked with the United Nations (UNICRI) on improving the cyber-security of Chemical, Biological, Radiological and Nuclear facilities, including facilities in Africa and Asia, with the US Pacific Northwestern Labs and the UK National Nuclear Laboratory. I help to lead a forensic and cyber security lab on behalf of the UK Civil Nuclear License holders; focussing on SCADA and Industrial Control Systems. Aviation: I am the software specialist on the SESAR scientific board advising the European Commission on the future of Air Traffic Management, comparable to the US NextGen programme. I also work on the cyber security of airport operations with the UK Department for Transport, EUROCONTROL, AdP and Helios. Space: My research improves the resilience of space missions with NASA, the European Space Agency and the US Air Force. I have advised a wide range of companies including EDF (UK), DFS (Germany), Frequentis (Austria), LVNL (Netherlands), Skyguide (Switzerland) and Thales (UK). In my spare time, I am an enthusiastic runner. News: 2020: Keynote for the Joint 30th European Safety and Reliability Conference and 15th Probabilistic Safety Assessment and Management Conference in Venice, Italy. Keynote for the Australian Safety-Critical Systems Association Symposium 2020. Keynote for International Air Transport Association (IATA) Safety and Flight Ops Conference, Baku, Azerbaijan Invited talk for NHS Healthcare Safety Investigation Branch Supporting Foreign and Commonwealth delegation to Oman on cyber security in critical infrastructures. Review of cyber security for Austrian Air Traffic Management. 2019: Keynote for United Nations/ICAO 4th International Accident Investigators Forum, Singapore. Keynote on Aviation Cyber Security for Swedish Government Transportstyrelsen. Invited talks on the NIS Directive and on Socio-Technical Cyber Security at the NCSC CyberUK, Glasgow. Invited talk for the Armee Suisse Cyber Defence Forum. Invited talk to NATO/EUROCONTROL ATM Security Coordinating Group (NEASCOG). Supporting USAF Safety Centre, Kirtland AFB on the use of safety-cases for high assurance applications. Foreign Secretary, Jeremy Hunt visits my lab to speak on Deterence in Cyber Age, BBC coverage, Guardian, Telegraph etc. Appeared at UK Parliamentary Select Committee on Science and Technology Cybersecurity policy and the digital economy. Review of cyber security for Belgian Air Traffic Management. Panelist on the Naked Scientist, part of the Edinburgh Science Festival. Research I am a member of the Systems Section within the School of Computing Science. Full List of Publications, Recent Projects, Invited Talks, Seminars, Awards etc Books: Handbook of Incident and Accident Reporting Military Risk Assessment: From Conventional Conflict to Counter-Insurgency Operations. Selected papers: The Increasing Risks to Risk Assessment: On the Rise of Artificial Intelligence and Non-Determinism in Safety-Critical Systems CyberSafety: Interactions between CyberSecurity and the Software Engineering of Safety-Critical Systems Understanding Failures in International Safety-Critical Infrastructures Hidden Human Factors in Unmanned Aerial Systems Understanding the Failure of Large-Scale Software Procurement for Healthcare Systems I help to edit: Reliability Engineering and System Safety, Cognition, Technology and Work, Safety Science, Journal of Aerospace Operations, Journal of Cognitive Engineering and Decision Making, IMechE's new Journal of Risk and Reliability, I have chaired funding panels, reviewed proposals etc for Canada's WorkSafeBC, Cyprus Research Promotion Foundation, Danish Councils for Independent Research, Danish National Advanced Technology Foundation, Dutch NWO- US Department of Homeland Security-Cyber Security Programme, European Commission (H2020 evaluator, FP7 assessor, SJU, REA), Hong Kong Research Grants Council, Enterprise Ireland, the Latvian Council of Science, New Zealand Ministry of Business, Innovation and Employment, Research Council of Norway and the Foundation for Polish Science. In the UK for EPSRC, GCHQ, MRC, ESRC as well as the US NSF, The Carnegie Trust, L'Oreal-UNESCO Women in Science, the Royal Society. Together with Paul Casely (DSTL), I am technical co-chair for the IET International Conference on System Safety and Cyber Security 2007-present. Teaching I have been a judge for the UK Distinguished Dissertations in Computing Science. I was head of our Teaching Committee and chaired the Board of Studies across our Undergraduate and M.Sc. programmes. I was nominated by my students for one of the Prizes for Excellent Teachers. I am an external examiner, a BCS accreditor and and have taught: Safety Critical Systems Development. Trends in Information Security. Ada programming Distributed Operating Systems CS1P: Programming in Python CS1Q: Intro. to Human Computer Interaction. CS1Q: Intro. to Computer Systems. IS3: Usability of Web-Based Systems. Professional Skills and Issues (4/MSc). Interactive Systems Design. Interface Design using Java. Interface Design for Windows. Social Aspects of Computing. Prof. Chris Johnson, DPhil, MSc, MA, FRSE, FRAeS, FBCS, CEng, CITP, Room S162, School of Computing Science, Univ. of Glasgow, Glasgow, G12 8RZ, Scotland. Tel: +44 141 330 6053, Fax: +44 141 330 4913, christopher.johnson@glasgow.ac.uk",
  "content_length": 6024,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:37"
}