{
  "name": "Christopher Russell 0001",
  "homepage": "https://www.oii.ox.ac.uk/people/profiles/chris-russell",
  "status": "success",
  "content": "OII | Dr Chris Russell Skip down to main content Mobile menu button Mobile search button Search for : Profile Contents About Positions at the OII Contact Research News & Press Teaching About Chris Russell is the Dieter Schwarz Associate Professor, AI, Government and Policy. Dr Russell’s work lies at the intersection of computer vision and responsible AI. His career to date illustrates a commitment to exploring the use of AI for good, alongside responsible governance of algorithms. His recent work on mapping for autonomous driving won the best paper award at the International Conference on Robotics and Automation (ICRA). He has a wide-ranging set of research interests, having worked with the British Antarctic Foundation to forecast arctic melt; as well as creating one of the first causal approaches to algorithmic fairness. His work on explainability with Sandra Wachter and Brent Mittelstadt of the OII is cited in the guidelines to the GDPR and forms part of the TensorFlow “What-if tool”. Dr Russell has been a research affiliate of the OII since 2019 and is a founding member of the Governance of Emerging Technology programme, a research group that spans multiple disciplines and institutions looking at the socio-technical issues arising from new technology and proposing legal, ethical and technical remedies. Their research focuses on the governance and ethical design of algorithms, with an emphasis on accountability, transparency, and explainable AI. Prior to joining the OII, he worked at AWS, and has been a Group Leader in Safe and Ethical AI at the Alan Turing Institute, and a Reader in Computer Vision and Machine Learning at the University of Surrey. Research Interests Algorithmic Fairness, Explainable AI, machine learning, computer vision. Positions at the OII Dieter Schwarz Associate Professor, AI, Government & Policy., September 2023 - Research Associate, December 2019 - August 2024 Contact chris.russell@oii.ox.ac.uk Research Projects Research Programme on AI, Government and Policy This programme supports research on AI, Government and Policy. Active View Project Advancing medical machine learning to predict inflammatory arthritis This project will develop useful and responsible machine learning methods to achieve real-world early detection and personalised disease outcome prediction of inflammatory arthritis. View Project Programme on the Governance of Emerging Technologies This OII research programme investigates legal, ethical, and social aspects of AI, machine learning, and other emerging information technologies. View Project 1 2 Next News & Press Blogs & Press releases Oxford researchers to explore metrics and fairness at NeurIPS 2025 25 November 2025 Researchers from the Oxford Internet Institute at the University of Oxford will be at NeurIPS 2025 in San Diego from 1- 7 December, 2025, contributing to one of the world’s leading AI conferences. Read now Dramatic rise in publicly downloadable deepfake image generators 7 May 2025 New Oxford study uncovers explosion of accessible deepfake AI image generation models intended for the creation of non-consensual, sexualised images of women. PRESS RELEASE Read now Large Language Models pose a risk to society and need tighter regulation, say Oxford researchers 7 August 2024 Leading experts in regulation and ethics at the Oxford Internet Institute, part of the University of Oxford, have identified a new type of harm created by LLMs which they believe poses long-term risks to democratic societies and needs to be addressed PRESS RELEASE Read now Safer Internet Day 2024 – Professor Sandra Wachter shares her insights on the rise of deepfakes and AI-generated online content 5 February 2024 As we mark Safer Internet Day, Professor Sandra Wachter, spoke to us about the online phenomenon known as ‘deepfakes’, how to spot them and the implications of the growing proliferation of deepfakes for internet safety. Read now 1 2 3 Next Press Coverage The Disturbing Reality of AI-Generated Abuse Somewhere on Earth: The Global Tech Podcast, 20 May 2025 A new study reveals nearly 35,000 publicly downloadable AI models capable of generating deepfake pornography—often targeting women and celebrities. Read now University calls for tighter measures to control the rise of AI deep fakes Cherwell, 14 May 2025 A new study from the Oxford Internet Institute (OII) has found a sharp rise in the number of AI tools used to generate deep fake images of identifiable people, primarily targeting women. Read now Oxford University uncovers ‘dramatic rise’ in deepfakes Oxford Mail, 07 May 2025 The lead author of a new Oxford University says there is an 'urgent need' for more controls to tackle the rise of deepfakes. Read now 1 2 3 4 Next Teaching Current Students Jonathan Rystrøm DPhil Student Jonathan is a DPhil student in Social Data Science at the OII. Jonathan's research focus is socio-technical evaluations of multimodal human-AI interactions. View profile Karolina Korgul DPhil Student Karolina is a DPhil student in Social Data Science and a Clarendon Scholar at the OII. Her research focuses on the societal impacts of advanced AI systems. View profile Ryan Brown DPhil Student Ryan is a DPhil student at the Oxford Internet Institute, focused on AI fairness, with research interests in technical fairness methodologies, NLP, and deep learning. View profile Kaivalya Rawal DPhil Student Kaivalya worked on AI explainability and fairness at Oxford. He built upon his work auditing and testing machine learning models in industry and in academia, making AI systems safe and trustworthy. View profile Current Courses Machine Learning This course covers the fundamentals of both supervised and unsupervised learning. We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings. Accept Reject Settings Privacy Overview Strictly Necessary Cookies Google Analytics Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookies moove_gdrp_popup -  a cookie that saves your preferences for cookie settings. Without this cookie, the screen offering you cookie options will appear on every page you visit. This cookie remains on your computer for 365 days, but you can adjust your preferences at any time by clicking on the \"Cookie settings\" link in the website footer. Please note that if you visit the Oxford University website, any cookies you accept there will appear on our site here too, this being a subdomain. To control them, you must change your cookie preferences on the main University website. Enable or Disable Cookies Enabled Disabled Google Analytics This website uses Google Tags and Google Analytics to collect anonymised information such as the number of visitors to the site, and the most popular pages. Keeping these cookies enabled helps the OII improve our website. Enabling this option will allow cookies from: Google Analytics - tracking visits to the ox.ac.uk and oii.ox.ac.uk domains These cookies will remain on your website for 365 days, but you can edit your cookie preferences at any time via the \"Cookie Settings\" button in the website footer. Enable or Disable Cookies Enabled Disabled Enable All Reject All Save Changes Powered by  GDPR Cookie Compliance",
  "content_length": 7583,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:31"
}