{
  "name": "Christian Knauer",
  "homepage": "https://www.ai6.uni-bayreuth.de/de/mitarbeiter/christian-knauer.html",
  "status": "success",
  "content": "Algorithmen und Datenstrukturen - Christian Knauer Institut für Informatik Fakultät für Mathematik, Physik und Informatik Algorithmen und Datenstrukturen(Informatik VI) StartseiteMitarbeiterLehrePublikationenAktuellesMittagsseminarAnfahrt Directory:Home English StartseiteMitarbeiterChristian KnauerBenjamin SchlosserLuise SommerFabian StehnSylvia SteinertLehrePublikationenAktuellesMittagsseminarAnfahrt Christian Knauer Gebäude INF Raum 2.49 Email: (PGP Public Key) Telefon: +49 921557740, +49 921557741 (Sekretariat) Sprechstunde: Nur nach Vereinbarung Publikationen: DBLP, Google Scholar 2019 [69] The geometric dilation of three points (Annette Ebbers-Baumann, Rolf Klein, Christian Knauer, Günter Rote), In Journal of Computational Geometry (JoCG), volume 10, 2019. [bib] [pdf] [doi] [68] Covering Many Points with a Small-Area Box (Mark de Berg, Sergio Cabello, Otfried Cheong, David Eppstein, Christian Knauer), In Journal of Computational Geometry (JoCG), volume 10, 2019. [bib] [pdf] [doi] [67] Fast Algorithms for Diameter-Optimally Augmenting Paths and Trees (Ulrike Große, Christian Knauer, Fabian Stehn, Joachim Gudmundsson, Michiel Smid), In International Journal of Foundations of Computer Science, volume 30, 2019. [bib] [pdf] [doi] 2018 [66] Placing your Coins on a Shelf (Helmut Alt, Kevin Buchin, Steven Chaplick, Otfried Cheong, Philipp Kindermann, Christian Knauer, Fabian Stehn), In Journal of Computational Geometry (JoCG), volume 9, 2018. [bib] [doi] [65] Elastic geometric shape matching for translations under the Manhattan norm (Christian Knauer, Luise Sommer, Fabian Stehn), In Computational Geometry, volume 73, 2018. (Secial Issue on EuroCG2015) [bib] [pdf] [doi] [64] An FPTAS for an Elastic Shape Matching Problem with Cyclic Neighborhoods (Christian Knauer, Luise Sommer, Fabian Stehn), In Computational Science and Its Applications -- ICCSA 2018 (Osvaldo Gervasi, Beniamino Murgante, Sanjay Misra, Elena Stankova, Carmelo M. Torre, Ana Maria A.C. Rocha, David Taniar, Bernady O. Apduhan, Eufemia Tarantino, Yeonseung Ryu, eds.), Springer International Publishing, 2018. (Best paper award) [bib] 2017 [63] Approximating Minimum-Area Rectangular and Convex Containers for Packing Convex Polygons (Helmut Alt, Mark de Berg, Christian Knauer), In JoCG, volume 8, 2017. [bib] [pdf] [62] Top-k Manhattan spatial skyline queries (Wanbin Son, Fabian Stehn, Christian Knauer, Hee-Kap Ahn), In Inf. Process. Lett., volume 123, 2017. [bib] [doi] [61] Minimum Cell Connection in Line Segment Arrangements (Helmut Alt, Sergio Cabello, Panos Giannopoulos, Christian Knauer), In International Journal of Computational Geometry & Applications, volume 27, 2017. [bib] [doi] [60] Placing your Coins on a Shelf (Helmut Alt, Kevin Buchin, Steven Chaplick, Otfried Cheong, Philipp Kindermann, Christian Knauer, Fabian Stehn), In 28th International Symposium on Algorithms and Computation, ISAAC 2017, December 9-12, 2017, Phuket, Thailand (Yoshio Okamoto, Takeshi Tokuyama, eds.), Schloss Dagstuhl - Leibniz-Zentrum fuer Informatik, volume 92, 2017. [bib] [pdf] [doi] 2016 [59] Shortest path to a segment and quickest visibility queries (Valentin Polishchuk, Esther M. Arkin, Alon Efrat, Christian Knauer, Joseph S. B. Mitchell, Günter Rote, Lena Schlipf, Topi Talvitie, Valentin Polishchuk), In JoCG, volume 7, 2016. [bib] [pdf] [58] Guest Editors' Foreword (Christian Knauer, Michiel H. M. Smid), In Int. J. Comput. Geometry Appl., volume 26, 2016. [bib] [doi] [57] Finding largest rectangles in convex polygons (Sergio Cabello, Otfried Cheong, Christian Knauer, Lena Schlipf), In Comput. Geom., volume 51, 2016. [bib] [doi] 2015 [56] Fixed-Parameter Complexity and Approximability of Norm Maximization (Christian Knauer, Stefan König, Daniel Werner), In Discrete & Computational Geometry, 2015. [bib] [doi] [55] Elastic Geometric Shape Matching for Point Sets under Translations (Christian Knauer, Fabian Stehn), In Algorithms and Data Structures - 14th International Symposium, WADS 2015, Victoria, BC, Canada, August 5-7, 2015. Proceedings, 2015. [bib] [doi] [54] Fast Algorithms for Diameter-Optimally Augmenting Paths (Ulrike Große, Joachim Gudmundsson, Christian Knauer, Michiel H. M. Smid, Fabian Stehn), In Automata, Languages, and Programming - 42nd International Colloquium, ICALP 2015, Kyoto, Japan, July 6-10, 2015, Proceedings, Part I, 2015. [bib] [doi] [53] Approximating Minimum-Area Rectangular and Convex Containers for Packing Convex Polygons (Helmut Alt, Mark de Berg, Christian Knauer), In Algorithms - ESA 2015 - 23rd Annual European Symposium, Patras, Greece, September 14-16, 2015, Proceedings, 2015. [bib] [doi] [52] Shortest Path to a Segment and Quickest Visibility Queries (Esther Arkin, Alon Efrat, Christian Knauer, Joseph Mitchell, Valentin Polishchuk, Günter Rote, Lena Schlipf, Topi Talvitie), In 31st International Symposium on Computational Geometry, SoCG 2015, June 22-25, 2015, Eindhoven, The Netherlands, 2015. [bib] [doi] 2014 [51] Convex transversals (Esther Arkin, Claudia Dieckmann, Christian Knauer, Joseph Mitchell, Valentin Polishchuk, Lena Schlipf, Shang Yang), In Comput. Geom., volume 47, 2014. [bib] [doi] [50] Top-k Manhattan Spatial Skyline Queries (Wanbin Son, Fabian Stehn, Christian Knauer, Hee-Kap Ahn), In WALCOM (Sudebkumar Prasant Pal, Kunihiko Sadakane, eds.), Springer, volume 8344, 2014. [bib] [doi] 2013 [49] Fixed-parameter tractability and lower bounds for stabbing problems (Panos Giannopoulos, Christian Knauer, Günter Rote, Daniel Werner), In Comput. Geom., volume 46, 2013. [bib] [doi] [48] Covering and piercing disks with two centers (Hee-Kap Ahn, Sang-Sub Kim, Christian Knauer, Lena Schlipf, Chan-Su Shin, Antoine Vigneron), In Comput. Geom., volume 46, 2013. [bib] [doi] [47] Realistic roofs over a rectilinear polygon (Hee-Kap Ahn, Sang Won Bae, Christian Knauer, Mira Lee, Chan-Su Shin, Antoine Vigneron), In Comput. Geom., volume 46, 2013. [bib] [doi] [46] On the complexity of Erdös-Szekeres and related problems in $\\R^3$ (Panos Giannopoulos, Christian Knauer, Daniel Werner), In ESA (Hans L. Bodlaender, Giuseppe F. Italiano, eds.), Springer, volume 8125, 2013. [bib] [doi] [45] Range-Aggregate Queries for Geometric Extent Problems (Peter Brass, Christian Knauer, Chan-Su Shin, Michiel H. M. Smid), In CATS (Anthony Wirth, ed.), Australian Computer Society, volume 141, 2013. [bib] [44] Advantages and Disadvantages of Training based Object Detection / Classification in SAS Images (Wolfgang Jans, Christian Knauer, Florian Langner, Wolfgang Middelmann), In POMA, volume 17, 2013. [bib] [doi] 2012 [43] Approximating the average stretch factor of geometric graphs (Siu-Wing Cheng, Christian Knauer, Stefan Langerman, Michiel H. M. Smid), In JoCG, volume 3, 2012. [bib] [42] Largest inscribed rectangles in convex polygons (Christian Knauer, Lena Schlipf, Jens M. Schmidt, Hans Raj Tiwary), In J. Discrete Algorithms, volume 13, 2012. [bib] [doi] [41] Hardness of discrepancy computation and eps-net verification in high dimension (Panos Giannopoulos, Christian Knauer, Magnus Wahlström, Daniel Werner), In J. Complexity, volume 28, 2012. [bib] [doi] [40] Computing the Discrete Fréchet Distance with Imprecise Input (Hee-Kap Ahn, Christian Knauer, Marc Scherfenberg, Lena Schlipf, Antoine Vigneron), In Int. J. Comput. Geometry Appl., volume 22, 2012. [bib] [doi] [39] Advantages and Disadvantages of Training based Object Detection / Classification in SAS Images (Wolfgang Jans, Christian Knauer, Florian Langner, Wolfgang Middelmann), In 11th European Conference on Underwater Acoustics, volume 34, 2012. [bib] 2011 [38] The directed Hausdorff distance between imprecise point sets (Christian Knauer, Maarten Löffler, Marc Scherfenberg, Thomas Wolle), In Theor. Comput. Sci., volume 412, 2011. [bib] [doi] [37] Minimizing the weighted directed Hausdorff distance between colored point sets under translations and rigid motions (Christian Knauer, Klaus Kriegel, Fabian Stehn), In Theor. Comput. Sci., volume 412, 2011. [bib] [doi] [36] Geometric clustering: Fixed-parameter tractability and lower bounds with respect to the dimension (Sergio Cabello, Panos Giannopoulos, Christian Knauer, Dániel Marx, Günter Rote), In ACM Transactions on Algorithms, volume 7, 2011. [bib] [doi] [35] A fixed-parameter algorithm for the minimum Manhattan network problem (Christian Knauer, Andreas Spillner), In JoCG, volume 2, 2011. [bib] [34] On graphs and algebraic graphs that do not contain cycles of length 4 (Noga Alon, H. Tracy Hall, Christian Knauer, Rom Pinchasi, Raphael Yuster), In Journal of Graph Theory, volume 68, 2011. [bib] [doi] [33] Approximate Nearest Neighbor Search under Translation Invariant Hausdorff Distance (Christian Knauer, Marc Scherfenberg), In Int. J. Comput. Geometry Appl., volume 21, 2011. [bib] [doi] [32] The Aligned k-Center Problem (Peter Brass, Christian Knauer, Hyeon-Suk Na, Chan-Su Shin, Antoine Vigneron), In Int. J. Comput. Geometry Appl., volume 21, 2011. [bib] [doi] [31] Convex Transversals (Esther Arkin, Claudia Dieckmann, Christian Knauer, Joseph Mitchell, Valentin Polishchuk, Lena Schlipf, Shang Yang), In WADS (Frank Dehne, John Iacono, Jörg-Rüdiger Sack, eds.), Springer, volume 6844, 2011. [bib] [doi] [30] On the computational complexity of Ham-Sandwich cuts, Helly sets, and related problems (Christian Knauer, Hans Raj Tiwary, Daniel Werner), In STACS (Thomas Schwentick, Christoph Dürr, eds.), Schloss Dagstuhl - Leibniz-Zentrum fuer Informatik, volume 9, 2011. [bib] [doi] [29] Covering and Piercing Disks with Two Centers (Hee-Kap Ahn, Sang-Sub Kim, Christian Knauer, Lena Schlipf, Chan-Su Shin, Antoine Vigneron), In ISAAC (Takao Asano, Shin-Ichi Nakano, Yoshio Okamoto, Osamu Watanabe, eds.), Springer, volume 7074, 2011. [bib] [doi] [28] Generating Realistic Roofs over a Rectilinear Polygon (Hee-Kap Ahn, Sang Won Bae, Christian Knauer, Mira Lee, Chan-Su Shin, Antoine Vigneron), In ISAAC (Takao Asano, Shin-Ichi Nakano, Yoshio Okamoto, Osamu Watanabe, ",
  "content_length": 16023,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:09"
}