{
  "name": "Christian Jesús B. Fayomi",
  "homepage": "https://professeurs.uqam.ca/professeur/fayomi.c",
  "status": "success",
  "content": "Christian Jesus B. Fayomi | Répertoire des professeures et professeurs - UQAM Christian Jesus B. Fayomi Professeur Christian Jesus B. Fayomi Professeur Unité : Département d'informatique Courriel : fayomi.c@uqam.ca Téléphone : (514) 987-3000 poste 1955 Langues : Français, Anglais Ce professeur désire s'entretenir avec les médias Domaines d'expertise Capteurs électroniques imprimés Capteurs sans fil Circuits électroniques Circuits électroniques flexibles Circuits électroniques imprimables Circuits microélectroniques Convertisseurs numériques-analogiques Génie électrique Génie électronique Génie microélectronique Microélectronique Microsystèmes Nano-systèmes Nanotechnologies Référence de tension Senseurs électroniques imprimés Traitement du signal Liens d'intérêt Academia.edu Share Research Google Scholar Research Gate Informations générales Cheminement académique Christian J. B. Fayomi a terminé un baccalauréat en ingénierie à l'École Polytechnique de Thiès au Sénégal (spécialité électromécanique) avec la mention \"Major de promotion.\" Il a complété une Maîtrise en Sciences Appliquées en génie électrique l'École Polytechnique de Montréal, avec la mention spéciale du jury. M. Fayomi est également détenteur d'un doctorat en génie électrique (spécialité microélectronique) de l'École Polytechnique de Montréal. Sa thèse a été co-financée par l'Université McGill (Laboratoire MACS) et l'École Polytechnique de Montréal (PolyStim). M. Fayomi a été ingénieur de conception de circuits microélectoniques mixtes chez Goal Semiconductors (Montréal) Canada où il a oeuvré dans la réalisation de divers types de circuits et systèmes microélectroniques analogiques/mixtes. Il a été également assistant de recherche au Microelectronics and Computer Laboratory (MACS - Lab) sous la direction du Professeur Gordon W. Roberts du département de génie électrique de l'Université McGill. M. Fayomi a aussi oeuvré dans la Division Microélectronique de IBM à Essex Junction au Vermont comme conseiller technique travaillant pour le développement de convertisseurs analogiques-numériques dédiés aux applications vidéos. En juillet 2003, il rejoint le département d'informatique de l'Université du Québec à Montréal dans les programme de génie microélectronique et des systèmes informatique et électronique. Fayomi est également professeur associé au département de génie électrique et de génie informatique de l'Université du Québec à Trois-Rivières (UQTR). Ses intérêts de recherche portent sur la conception et la modélisation des circuits/systèmes microélectroniques analogiques/mixtes opérant à basse tension d'alimentation ainsi ques les capteurs biodégradables dédiés aux applications biomédicales. M. Fayomi est membre de l'IEEE, de l'Ordre des Ingénieurs du Québec (OIQ) et du Regroupement Stratégique en Microélectronique du Québec (ResMIQ). Enfin, M. Fayomi a été directeur du IEEE CASSFlexible, un organisme faisant parti de IEEE et dédié à la la promotion puis à l'utilisation des systèmes électroniques imprimables. Les domaines d'application de ces derniers s'étant aux vêtements intelligents, l'automobile, l'agriculture intelligente, les maisons intelligentes, etc. pour ne citer que ceux-là Unités de recherche Centre de recherche sur la conception et la fabrication de dispositifs microélectroniques et microsystèmes (CoFaMic) Regroupement stratégique en microsystèmes du Québec (ReSMIQ) Projets de recherche et/ou de recherche-création en cours Computer aided-design of microelectronic systems Le but visé est de développer des outils informatiques dédiés à la conception automatique de systèmes microélectroniques. Plusieurs méthodes rigoureuses seront proposées. Non-invasive blood glucose détection L'objectif principal du projet est de détecter le niveau du glucose dans le sang en utilisant une approache non-invasive Low-Cost Device for Fall Detection Systems L'accent est mis sur la détection des chutes chez les personnes agées en utilisant des capteurs électronique flexibles et imprimés. Affiliations externes principales Directeur du IEEE CASSFlexible (Ancien) Enseignement Analyse de circuits et projet intégrateur (2025, 2024) Signaux et systèmes (2025, 2024, 2022, 2021) Électronique analogique et numérique (2025, 2023, 2022, 2021) Projet intégrateur thématique (2024, 2023, 2022) Systèmes embarqués (2024, 2023, 2022, 2020) Projet intégrateur 2 (2024, 2023, 2022) Analyse de circuits (2023, 2022, 2021) Introduction aux systèmes embarqués (2021) Projet intégrateur I (2021) Électronique pratique (2020) Services à la collectivité SERVICES À L'EXTÉRIEUR DE L'UQAM Membre du comité éditorial (voir comité de rédaction) de la revue: Trends in Applied Sciences Research de Academic Journal Inc. Ancien Membre du conseil d'administration du Regroupement Stratégique en Microélectronique du Québec. Participation à la campagne de levée de fonds durant les 24 heures vélo Centraide Lanaudière. Examinateur externe dans l'arbitrage d'articles soumis pour publications dans les journaux et comptes rendus de conférences suivants: Journal of Analog Integrated Circuit and Signal Processing, Springer; IEEE Transactions on Very Large Scale Integration Systems; IEEE Transactions on Biomedical Circuits and Systems; International Symposium on Circuits and Systems (IEEE-ISCAS); International Test Conference (ITC); Midwest Symposium on Circuit and Systems (IEEE-MWSCAS); Northeast Workshop on Circuits and Systems (IEEE-NEWCAS). IEEE Sensors Journal Examinateur externe pour les deux volumes suivants: Titre: CMOS Mixed-Signal Circuit design Auteur: R. Jacob Baker Éditeur: Wiley & Sons Inc, 2002. Titre: An Introduction to Mixed-Signal IC Test and Measurement Auteur: Mark Burns et Gordon W. Roberts Éditeur: Oxford University Press, 2001. SERVICES À L'INTÉRIEUR DE L'UQAM Ancien coordonnateur de la section IEEE des étudiants en génie de l'UQAM. Participation à la campagne de levée de fonds pour le financement du projet UQÀM-Nord des étudiants de cycles supérieurs de département de l'environnement. Participation à la campagne de levée de fonds pour le financement du projet Sénégal 2006. Il s'agit d'un stage d'enseignement au Sénégal des étudiants en concentration Mathématiques du programme de baccalauréat en enseignement secondaire de l'UQAM.Ce stage est organisé en collaboration avec avec l'organisme non gouvernemental (ONG) Mer et Monde http://www.monde.ca/. Participation à la campagne de levée de fonds pour le financement du stage Hors Québec https://unites.uqam.ca/sthqc/ des étudiants de l'UQÀM en éducation préscolaire. Participation à la campagne de levée de fonds (deuxième édition) pour les 24 heures de vélo de Centraide Lanaudière du 25 et 26 Août 2007. Directions de thèses et mémoires Mémoires Djanou, Claudel Grégoire. (2008). Conception d'échantillonneurs-bloqueurs dans la technologie MOS submicronique. (Mémoire de maîtrise). Université du Québec à Montréal. Autres directions et supervisions Zebdi, Mohamed (2012). Implémentation en signaux mixtes d'un récepteur en transformation du domaine à séquences directeur pour le standard UWB LAN. (Thèse de doctorat). Université du Québec à Trois-Rivières. Achigui,Huges (2011). Convertisseur analogique-numérique à approximations successives opérant à 1-V dans un procédé CMOS submicronique. (Mémoire de maîtrise). Université du Québec à Trois-Rivières Achigui, Hervé (2005). Récepteur frontal pour systèems de dépistage des crises épileptiques par oxymetrie. (Mémoire de maîtrise). École Polytechnique de Montréal Publications Articles scientifiques El-Zarif, N., Amer, M., Ali, M., Hassan, A., Oukaira, A., Fayomi, C.J.B. et Savaria, Y. (2024). Calibration of Ring Oscillator-Based Integrated Temperature Sensors for Power Management Systems. Sensors, 24(2), article 440. http://dx.doi.org/10.3390/s24020440. Colombo, D.M., Fayomi, C., Nabki, F., Ferreira, L.F., Wirth, G. et Bampi, S. (2011). A design methodology using the inversion coefficient for low-voltage low-power CMOS voltage references. Journal of Integrated Circuits and Systems, 6(1), 7–17. http://dx.doi.org/10.29292/jics.v6i1.333. Achigui, H.J., Fayomi, C., Massicotte, D. et Boukadoum, M. (2011). Low-voltage, high-speed CMOS analog latched voltage comparator using the flipped voltage follower as input stage. Microelectronics Journal, 42(5), 785–789. http://dx.doi.org/10.1016/j.mejo.2011.01.006. Fayomi, C.J.B., Wirth, G.I., Achigui, H.F. et Matsuzawa, A. (2010). Sub 1 V CMOS bandgap reference design techniques: A survey. Analog Integrated Circuits and Signal Processing, 62(2), 141–157. http://dx.doi.org/10.1007/s10470-009-9352-4. Achigui, H.F., Sawan, M. et Fayomi, C.J.B. (2008). A monolithic based NIRS front-end wireless sensor. Microelectronics Journal, 39(10), 1209–1217. http://dx.doi.org/10.1016/j.mejo.2008.01.055. Achigui, H.F., Sawan, M. et Fayomi, C.J.B. (2007). 1 V fully balanced differential amplifiers: Implementation and experimental results. Analog Integrated Circuits and Signal Processing, 53(1), 19–25. http://dx.doi.org/10.1007/s10470-006-9002-z. Achigui, H.F., Fayomi, C.J.B. et Sawan, M. (2006). 1-V DTMOS-based class-AB operational amplifier: Implementation and experimental results. IEEE Journal of Solid-State Circuits, 41(11), 2440–2448. http://dx.doi.org/10.1109/JSSC.2006.883341. Fayomi, C.J.B., Sawan, M. et Roberts, G.W. (2006). Low-voltage analog switch in deep submicron CMOS: Design technique and experimental measurements. IEICE Transactions on Fundamentals of Electronics, Communications and Computer Sciences, E89-A(4), 1076–1086. http://dx.doi.org/10.1093/ietfec/e89-a.4.1076. Fayomi, C.J.B., Sawan, M. et Roberts, G.W. (2004). Reliable Circuit Techniques for Low-Voltage Analog Design in Deep Submicron Standard CMOS: A Tutorial. Analog Integrated Circuits and Signal Processing, 39(1), 21–28. http://dx.doi.org/10.1023/B:ALOG.0000016641.83563.96. Chapitres de livre Fayomi, C., Achigui, H. et Roberts, G.W. (2019). Passive Biosensors for Flexible Hybrid-Printed Electronic Systems. Dans G.",
  "content_length": 21552,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:56"
}