{
  "name": "Christopher A. Le Dantec",
  "homepage": "https://www.khoury.northeastern.edu/people/chris-le-dantec",
  "status": "success",
  "content": "Chris Le Dantec - Khoury College of Computer Sciences All People Chris Le Dantec Professor, Interdisciplinary with the College of Arts, Media and Design, Director of Initiatives in Digital Civics, Jointly Appointed with College of Arts, Media and Design Education Education PhD in Human-centered Computing, Georgia Institute of Technology BS in Computer Engineering, University of Arizona Biography Biography Christopher Le Dantec is a professor and the director of digital civics in the Khoury College of Computer Sciences and the College of Arts, Media and Design at Northeastern University, based in Boston. Le Dantec has always been concerned with how social value systems are reflected in technology, so his digital civics research applies human-centered computing to the intersection of digital democracy and smart cities. In particular, he develops novel computing interfaces and capacities that support collective action through the production and use of civic data. Le Dantec develops prototypes and demonstration systems through collaboration with community partners — including grassroots community organizations and advocacy groups from underrepresented communities — to meet their needs. By exploring how different value systems and priorities are negotiated through data and technology, he reframes research from ideas of command and control (e.g., smart cities) and efficiency and productivity (e.g., the workplace) toward ideas of inclusion, mutual aid, and care. Le Dantec joined Northeastern in 2023 to build out global initiatives in this same vein. Previously, he was an associate professor in Georgia Tech’s School of Interactive Computing, where he directed or co-directed the Human-Centered PhD Program, the MS-HCI Program, and the Public Participation Lab. He regularly publishes in CHI, CSCW, and DIS, and has won “best paper” and “honorable mention” accolades in each. Recent publications Recent publications Published: October 16, 2025 Charismatic Data and Material Traces: Monitoring Bird-Building Collisions through Citizen Science Citation: Ashley Boone, Carl DiSalvo, Christopher A. Le Dantec. (2025). Charismatic Data and Material Traces: Monitoring Bird-Building Collisions through Citizen Science Proc. ACM Hum. Comput. Interact., 9, 1-19. https://doi.org/10.1145/3757402 Published: July 4, 2025 Designing Tools for Data Advocacy Citation: Ashley Boone, Aparna Arul, James Kemerait, Ian Wood, Jaeri Suh, Carl DiSalvo, Christopher A. Le Dantec. (2025). Designing Tools for Data Advocacy Conference on Designing Interactive Systems, 2130-2142. https://doi.org/10.1145/3715336.3735801 Published: April 19, 2025 Demanding Labor: Workplace Conditions in On-Demand Transit Citation: Christopher A. Le Dantec, Meichen Wei. (2025). Demanding Labor: Workplace Conditions in On-Demand Transit ACM Trans. Comput. Hum. Interact., 32, 11:1-11:27. https://doi.org/10.1145/3711921 Published: November 8, 2024 Reimagining Meaningful Data Work through Citizen Science Citation: Ashley Boone, Annabel Rothschild, Xander Koo, Grace Pfohl, Alyssa Sheehan, Betsy DiSalvo, Christopher A. Le Dantec, Carl DiSalvo. (2024). Reimagining Meaningful Data Work through Citizen Science Proc. ACM Hum. Comput. Interact., 8, 1-26. https://doi.org/10.1145/3687049 Published: July 1, 2024 Embodied Traces: Multispecies Entanglement in Urban Spaces Citation: Ashley Boone, Christopher A. Le Dantec, Carl DiSalvo. (2024). Embodied Traces: Multispecies Entanglement in Urban Spaces Conference on Designing Interactive Systems. https://doi.org/10.1145/3643834.3660746 Published: July 1, 2024 Tuning into the World: Designing Community Safety Technologies to Reduce Dysfunctional Fear of Crime Citation: Ishita Chordia, Jaewon Kim, Zhuoyan Liu, Hayley Park, Lesley Garrett, Sheena Erete, Christopher A. Le Dantec, Jason C. Yip , Alexis Hiniker. (2024). Tuning into the World: Designing Community Safety Technologies to Reduce Dysfunctional Fear of Crime Conference on Designing Interactive Systems. https://doi.org/10.1145/3643834.3661578 Published: May 11, 2024 Bitacora: A Toolkit for Supporting NonProfits to Critically Reflect on Social Media Data Use Citation: Adriana Alvarado Garcia, Marisol Wong-Villacres, Benjamín Hernández, Christopher A. Le Dantec. (2024). Bitacora: A Toolkit for Supporting NonProfits to Critically Reflect on Social Media Data Use CHI, 230:1-230:29. https://doi.org/10.1145/3613904.3642673 Individual Details Tenured/Tenure-Track Faculty Campus Boston Area of Interest Human-Centered Computing Contact c.ledantec@northeastern.edu Current PhD students Natalie Castro PhD Student Read bio Locations Close this dialog window Boston",
  "content_length": 4654,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:00"
}