{
  "name": "Christos Doulkeridis",
  "homepage": "https://www.ds.unipi.gr/en/faculty/cdoulk-en",
  "status": "success",
  "content": "Christos Doulkeridis - Department of Digital Systems Skip to content Christos Doulkeridis Phone +30 210-4142545 Email cdoulk@unipi.gr Title Professor Office Hours Monday 11:15-12:45, Friday 11:15-12:45 Office 502 (Gr. Lambraki 126) wp_statistics_words_count 2549 Courses Information Retrieval — 8th semester Data Analytics — 4th semester Data Structures — 3rd semester Big Data Programming — 5th semester Brief CV Christos Doulkeridis is Professor in the department of Digital Systems of University of Piraeus. He has been awarded Marie-Curie and ERCIM “Allain Bensoussan” fellowships for post-doctoral studies at the Norwegian University of Science and Technology in 2011 and 2009 respectively. Prior to this, he received his Ph.D and M.Sc. from the Athens University of Economics and Business in 2007 and 2003 respectively, and an Electrical and Computer Engineer degree from the National Technical University of Athens in 2001. He was the second winner of “Michael Dertouzos” competition on “IT with a human face” in the 14th World Congress on Information Technology (WCIT’04) in 2004. Also, he has received the best paper award at SSTD’21 and EuroVA’19, the best poster runner-up award in SIGSPATIAL’23, and he belonged to the winning team in the SemEval’17/Task4 competition on sentiment analysis on Twitter data. He was the principal investigator of CloudIX (Marie-Curie Post-Doc), RoadRunner (GSRT/ARISTEIA II) and CHOROLOGOS (GSRT/HFRI), and he has participated in several EU research projects (datAcron, Track&Know, BigDataStack, VesselAI, EMERALDS, Green.DAT.AI). Currently, he is the principal investigator of MobiSpaces (Horizon Europe), working on data spaces for mobility data. His research interests include “Big Data”, cloud data management, query processing, data management in peer-to-peer networks, distributed knowledge discovery, web data management, mobile and spatial databases. He has published in top international journals (incl. VLDB J, IEEE TKDE, IEEE J-SAC, ACM TKDD, Elsevier Information Systems, Springer DPD) and conferences (incl. ACM SIGMOD, VLDB, ICDE, EDBT, SSTD, PKDD, SIAM SDM) in the areas of data management, knowledge discovery and distributed systems. Publications Publications 2015 – 2022 I) JOURNALS Georgios M. Santipantakis, Konstantinos I. Kotis, Apostolos Glenis, George A. Vouros, Christos Doulkeridis, Akrivi Vlachou. RDF-Gen: Generating RDF Triples from Big Data Sources. In Knowledge and Information Systems (KAIS) journal, Vol. , Issue , pages , 2022. Panagiotis Nikitopoulos, Akrivi Vlachou, Christos Doulkeridis, George A. Vouros. Parallel and Scalable Processing of Spatio-temporal RDF Queries using Spark. In GeoInformatica (Springer), Vol. 25, Issue , pages 623-653, 2021. Christos Doulkeridis, Akrivi Vlachou, Nikos Pelekis, Yannis Theodoridis. A Survey on Big Data Processing Frameworks for Mobility Analytics. In SIGMOD Record, Vol. 50, Issue 2, pages 18-29, 2021. Nikolaos Koutroumanis, Georgios M. Santipantakis, Apostolos Glenis, Christos Doulkeridis, George A. Vouros. Scalable Enrichment of Mobility Data with Weather Information. In GeoInformatica (Springer), Vol. 25, Issue , pages 291-309, 2021. Panagiotis Nikitopoulos, Georgios A. Sfyris, Akrivi Vlachou, Christos Doulkeridis, Orestis Telelis. Pruning Techniques for Parallel Processing of Reverse Top-k Queries. In Distributed and Parallel Databases, Vol. 39, Issue 1, pages 169-199, March 2021. Georgios M. Santipantakis, Apostolos Glenis, Kostas Patroumpas, Akrivi Vlachou, Christos Doulkeridis, George A. Vouros, Nikos Pelekis, Yannis Theodoridis. SPARTAN: Semantic Integration of Big Spatio-temporal Data from Streaming and Archival Sources. In Future Generation Computer Systems (Springer), Vol. 110, Issue , pages 540-555, September 2020. Panagiotis Tampakis, Christos Doulkeridis, Nikos Pelekis, Yannis Theodoridis. Distributed Subtrajectory Join on Massive Datasets. In ACM Transactions on Spatial Algorithms and Systems, Vol. 6, Issue 2, pages 8:1-8:29, February 2020. Christos Doulkeridis, Qiang Qu, George A. Vouros and João B. Rocha-Junior. Guest Editorial: Special issue on mobility analytics for spatio-temporal and social data. In GeoInformatica (Springer), Vol. 23, Issue 3, pages 323-327, 2019. George A. Vouros, Georgios M. Santipantakis, Christos Doulkeridis, Akrivi Vlachou, Gennady L. Andrienko, Natalia V. Andrienko, Georg Fuchs, Jose Manuel Cordero Garcia, Miguel Garcia Martinez. The datAcron Ontology for the Specification of Semantic Trajectories – Specification of Semantic Trajectories for Data Transformations Supporting Visual Analytics. In Journal on Data Semantics (Springer), Vol. 8, Issue 4, pages 235-262, 2019. Nikos Pelekis, Panagiotis Tampakis, Marios Vodas, Christos Doulkeridis, Yannis Theodoridis. On temporal-constrained sub-trajectory cluster analysis. In Data Mining and Knowledge Discovery, Vol. 31, Issue 5, pages 1294-1330, 2017. Konstantinos Georgoulas, Akrivi Vlachou, Christos Doulkeridis, Yannis Kotidis. User-centric Similarity Search. In IEEE Transactions on Knowledge and Data Engineering (TKDE), Vol. 29, Issue 1, pages 200-213, 2017. Orestis Gkorgkas, Akrivi Vlachou, Christos Doulkeridis and Kjetil Nørvåg. Exploratory Product Search using Top-k Join Queries. In Information Systems, Vol. 64, Issue , pages 75-92, 2017. Dimitris Pertesis, Christos Doulkeridis. Efficient Skyline Query Processing in SpatialHadoop. In Information Systems, Vol. 54, Issue , pages 325-335, 2015. II) CONFERENCES Akrivi Vlachou, Christos Doulkeridis, João B. Rocha-Junior and Kjetil Nørvåg. On Decisive Skyline Queries. In Proceedings of 24th International Conference on Big Data Analytics and Knowledge Discovery (DaWaK’22), Vienna, Austria, August 22-24, 2022. Fragkiskos Gryllakis, Nikos Pelekis, Christos Doulkeridis, Iraklis Varlamis and Yannis Theodoridis. Social Spatio-temporal Keyword Pattern (S2KP) Queries in Multiple Aspect Trajectories Databases. In Proceedings of 34th International Conference on Scientific and Statistical Database Management (SSDBM’22), Copenhagen, Denmark, July 6 – 8, 2022. Nikolaos Koutroumanis, Christos Doulkeridis and Akrivi Vlachou. Tearing Down the Tower of Babel: Unified and Efficient Spatio-temporal Queries for NoSQL Stores. In Proceedings of 23rd International Conference on Mobile Data Management (MDM’22), Paphos, Cyprus (Online), June 6-9, 2022. Panagiotis Tampakis, Dimitris Spyrellis, Christos Doulkeridis, Nikos Pelekis, Christos Kalyvas and Akrivi Vlachou. A Novel Indexing Method for Spatial-Keyword Range Queries. In Proceedings of 17th International Symposium on Spatial and Temporal Databases (SSTD’21), Online, August 23-25, 2021. Best Research Paper Award Nikolaos Koutroumanis, Nikolaos Kousathanas, Christos Doulkeridis, Akrivi Vlachou. Declarative Querying of Heterogeneous NoSQL Stores. In Proceedings of 2nd VLDB Workshop on Search, Exploration, and Analysis in Heterogeneous Datastores (SEA-Data 2021), pp.42-43, Copenhagen, Denmark, August 20, 2021. Nikolaos Koutroumanis, Nikolaos Kousathanas, Christos Doulkeridis, Akrivi Vlachou. A Demonstration of NoDA: Unified Access to NoSQL Stores. In Proceedings of 47th International Conference on Very Large Data Bases (VLDB’21), Copenhagen, Denmark, August 16-20, 2021. Andreas Tritsarolis, Christos Doulkeridis, Nikos Pelekis, Yannis Theodoridis. ST_VISIONS: A Python Library for Interactive Visualization of Spatio-temporal Data. In Proceedings of 22nd International Conference on Mobile Data Management (MDM’21) – demo track, Toronto, Canada (Virtual), June 15-18, 2021. Nikolaos Koutroumanis, Christos Doulkeridis. Scalable Indexing and Querying of Spatio-temporal Data in NoSQL Stores. In Proceedings of 24th International Conference on Extending Database Technology (EDBT’21), Nicosia, Cyprus, March 23-26, 2021. Georgios M. Santipantakis, George A. Vouros, Christos Doulkeridis. Coronis: Towards Integrated and Open COVID-19 Data. In Proceedings of 24th International Conference on Extending Database Technology (EDBT’21) – demo track, Nicosia, Cyprus, March 23-26, 2021. Akrivi Vlachou, Christos Doulkeridis, Nikolaos Koutroumanis, Dimitrios Poulopoulos and Kjetil Nørvåg. The SPADES Framework for Scalable Management of Spatio-textual Data. In Proceedings of 24th Panhellenic Conference on Informatics (PCI’20), Athens, Greece, November 20-22, 2020. Yannis Poulakis, Christos Doulkeridis, Dimosthenis Kyriazis. AutoClust: A Framework for Automated Clustering based on Cluster Validity Indices. In Proceedings of 20th IEEE International Conference on Data Mining (ICDM’20), Sorrento, Italy, November 17-20, 2020. Stella Maropaki, Sean Chester, Christos Doulkeridis and Kjetil Nørvåg. Diversifying Top-k Point-of-Interest Queries via Collective Social Reach. In Proceedings of 29th ACM Conference on Information and Knowledge Management (CIKM’20), , October 19-23, 2020. George A. Vouros, Apostolos Glenis, Christos Doulkeridis. The δ big data architecture for mobility analytics. In Proceedings of 6th IEEE International Conference on Big Data Computing Service and Machine Learning Applications(IEEE BigDataService’20), Keble College, Oxford, United Kingdom, April 13-16, 2020. Panagiotis Tampakis, Nikos Pelekis, Christos Doulkeridis, Yannis Theodoridis. Scalable Distributed Subtrajectory Clustering. In Proceedings of 2019 IEEE International Conference on Big Data (IEEE BigData’19), Los Angeles, CA, USA, December 9-12, 2019. Efthimis Tsilionis, Nikolaos Koutroumanis, Panagiotis Nikitopoulos, Christos Doulkeridis, Alexander Artikis. Online Event Recognition from Moving Vehicles: Application Paper. In Proceedings of 35th International Conference on Logic Programming (ICLP’19), pp.841-856, Las Cruces, New Mexico, USA, September 20-25, 2019. Nikolaos Koutroumanis, Panagiotis Nikitopoulos, Akrivi Vlachou, Christos Doulkeridis, “NoDA: Unified NoSQL Data Access Operators for Mobility Data”, In Proceedings of 16th International Symposium on Spatial and Temporal Databases (SSTD’19), pp.174-177, Vienna, Austria, Aug",
  "content_length": 21593,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:38"
}