{
  "name": "Christopher M. Reardon",
  "homepage": "https://ritchieschool.du.edu/about/people/christopher-m-reardon",
  "status": "success",
  "content": "Ritchie School of Engineering & Computer Science: Best Engineering College in Colorado Skip to Content Driving Ethical Innovation The Ritchie School of Engineering & Computer Science is dedicated to preparing the next generation of innovators to find solutions to some of the world’s most challenging problems. Our students take advantage of a wide variety of opportunities for hands-on, experiential learning and interdisciplinary collaboration. Join us as we take our next steps into the future. Graduate ProgramsUndergraduate Programs World-Class Faculty. Cutting-Edge Research. Culture of Innovation. Research forms the backbone of everything we do in the Ritchie School. The principles of creativity and interdisciplinary collaboration are central to our research, with the goal of improving human lives through the promotion of better technology. Our researchers work to improve social robotics, power system protection, and human movement biomechanics. We impact fields ranging from cardiac health to cybersecurity to robotics.Our labs and facilities bolster the capabilities of our students and researchers. In addition to cutting-edge resources and equipment, we are also the home to the Knoebel Institute of Healthy Aging which promotes collaborative aging research across campus. Learn More Our Small Class Sizes Put Students at the Center of Learning. At the Ritchie School, students are the center of our academic programs. Our small class sizes are steeped in experiential learning on a global scale. As a private university for the public good, students at the Ritchie School also benefit from a well-rounded education and the ability to partner across a rich resource of university departments. Engineering a Better Future Our faculty and staff empower students to use science and technology to promote health, justice, and sustainability locally and globally. The Ritchie School brings innovators from around the world to campus. We foster opportunities to work across university departments, within the community, and alongside industry to create a rich and meaningful educational experience.We believe that diversity of thoughts, backgrounds, and experiences make the fields of science and technology stronger. At the Ritchie School, we are committed to justice, equity, diversity, and inclusion in everything that we do.Experiential Learning Begin Your Journey Search Input Graduate Programs Undergraduate Programs Featured News Faculty/Staff Human Error vs. Technology with Denver7 News: Cybersecurity Faculty Director Nate Evans on Signal Chat Leak Ritchie School's Faculty Director of Cybersecurity, Nate Evans recently spoke to Denver7 News about the recent Signal chat leak. Learn more from cybersecurity experts like Nate Evans in our MS in Cybersecurity program! Research & Scholarship DU Engineering Professor Develops Game-Changing Device for Detecting Cancer Cells The smaller, more affordable spectrometer will allow more researchers, students and entrepreneurs to study cells quickly and accurately. University News Princeton Review Ranks DU No. 1 for ‘Students Love Their College’ The University ranked as the most loved by its students, according to the Princeton Review’s survey of 168,000 college students. The journey to a new discovery begins at the Ritchie School. Ritchie School graduates enter the workforce with excellent career prospects. Our location and connections with Denver’s thriving technology and business communities contribute to many of our students being able to find their ideal careers. Join Us Give Apply Visit Us Start Your Application Undergraduate Applicants The Common App is a universal application that can be sent to many schools, including the University of Denver. Common App First-Year Students Transfer Students Graduate Applicants Go to the graduate admission application to submit your information. For information on admission requirements, visit the graduate academic programs page and locate your program of interest. Apply Now Graduate Application Explore Programs Graduate Academic Programs × Take The First Step Undergraduates Contact Undergraduate Admission Request Info Graduates Request Graduate Program Information Request Info ×",
  "content_length": 4211,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:24"
}