{
  "name": "Christiane Neme Campos",
  "homepage": "http://www.ic.unicamp.br/~campos",
  "status": "success",
  "content": "C. N. Campos homepage C. N. Campos Instituto de Computação Universidade Estadual de Campinas Brasil (2006) Docente Departamento de Teoria da Computação Instituto de Computação - IC   - Universidade Estadual de Campinas - UNICAMP Brasil End: Sala 09 - Instituto de Computação Av. Albert Einstein, 1251 Cidade Universitária 13083-852 - Campinas - SP Tel:   (+55)(19) 3521-5916 (office) Fax: (+55)(19) 3521-5847 Área de interesse em pesquisa: Teoria de Grafos Membro do Laboratório de Otimização e Combinatória - LOCo Divulgação científica: Teoria de Grafos e seus problemas OGRA 2021 - primeira oficina de grafos da Unicamp, ocorrida em 25 e 26 de fevereiro de 2021 Publicações veja o meu CV na Plataforma Lattes Dados públicos ORCID ResearcherID H-7073-2012 Atividades de docência Semestres atual MC878/MO405 - 2s2024. Semestres anteriores (a partir de 2009) CS107 (Pensamento Computacional) - 2s2018. MC032 Estudo Dirigido (apenas instâncias excepcionais) - 1s20221 (com o tema Brasileir@ cuida de brasileir@ - desafio 10x10) MC102 (Algoritmos e programação de computadores), coordenação - 1s2013 - 1s2017 - 2s2017 MC102 (Algoritmos e programação de computadores) -  1s2010 - 1s2012 - 2s2012 - 1s2013 - 2s2016 MC348 (Fundamentos matemáticos da computação) - 1s2010 - 1s2011 MC358 (Fundamentos matemáticos da computação) - 2s2011 - 2s2014 - 2s2018 - 1s2019 - 1s2020 - 2s2020 - 1s2021 - 2s2021 - 1s2023 - 1s2024 MC558 (Projeto e análise de algortimos II) - 2s2013 - 1s2014 - 1s2018 - 2s2019 - 2s2020 - 1s2022 MC878/MO405 (Teoria de Grafos) - 2s2010 - 1s2011 - 1s2013 - 1s2016 - 2s2016 - 1s2018 - 2s2020 - 2s2021 - 2s2022 - 2s2023 MC859 (Projeto em Teoria da Computação)/MO829 (Tópicos em Teoria da Computação) - 2s2022 MC904/MO804 (Tópicos em Teoria de Grafos) - 2s2018 MO203 - 1s2019 Matemática Discreta (UNIFESP) - 1s2009 Teoria de Grafos (UNIFESP) - 1s2009 Atividades de orientação Em andamento (Doutorado) Alessandra Aparecida Pereira Luis Gustavo de Soledade Gonzaga Mayara Omai (coorientado por Atílio Gomes Luiz) (Mestrado) Adilson Luís Jonck Júnior Concluídas (Doutorado) Atílio Gomes Luiz (2018) (Mestrado) João Paulo Castilho (cooorientado por Leandro Zatesko) (2023) Alessandra Aparecida Pereira (2020) Celso Aimbiré Weffort Santos (coorientado por Rafael C. S. Schouery, 2018) Henrique Vieira e Sousa (2015) Atílio Gomes Luiz (coorientadora - orientadora principal: C. P. de Mello, 2014) Kaio Karam Galvão (2013) (Iniciação Científica) João Pedro Vianini de Paula (conclusão em 07/2022) Eduardo Augusto Simão Vasconcellos (conclusão em 07/2021) Letícia Mayumi Araújo Tateishi (conclusão em 07/2021) Raphael de Oliveira Rodrigues Giron (conclusão em 07/2017) Gabriel Militão Vinhas Lopes (conclusão em 07/2015) Raphael de Oliveira Rodrigues Giron (conclusão em 12/2014) Vitor Roberto de Almeida Castro (conclusão em 07/2013) Patrícia Fernanda Hongo (conclusão em 12/2012) Ruan Ramos Monteiro Silva (conclusão em 12/2012) Guilherme Silva de Paula (conclusão em 12/2012) Marco Antônio Lasmar Almada (conclusão em 07/2012) André Rodrigues Oliveira (conclusão em 07/2012) Izumi Oniki Chiquito (conclusão em 07/2009) (Projeto Final de Graduação) Hitalo Cesar Alves (1s2023) Elisa Dell'Arriva (2s2018) Kaio Karam Galvão (1s2018) Victor Seixas Souza (2s2016) Victor Fernando Pompêo Barbosa e Gustavo Rodrigues Basso (2s1016, coorientado por Matheus Souza) Davi Kooji Uezono e Gustavo Fumio Oyakawa (2s2015, coorientado por Fábio Luiz Usberti) Hugo Kooki Kasuya Rosado (1s2015) Raphael de Bianchi Carvalho (2s2013) (Estudo dirigido e afins) Gabriel Francioli Alves (1s2020) Marília Kerr (2s2019) Luiz Fernando (2s2019) João Pedro Vianini de Paula (2019) Maurício de Sousa Araújo (2019) Letícia Mayumi AraújoTateishi (2019) Eduardo Augusto Simão de Vasconcellos (2019) Marcela Medicina Ferreira (2018) Gabriela Vecchini (1s2018) Paulo de Almeida Sachs (1s2017) Victor Seixas Souza (2s2014) Raphael de Oliveira Rodrigues Giron (1s2014) Gabriel Militão Vinhas Lopes (1s2014) Guilherme Silva de Paula (1s2013, 2s2013) Ruan Ramos Monteiro Silva (1s2011) Patrícia Fernanda Hongo (1s2011) Marco Antônio Lasmar Almada (1s2011) Thales Carvalho Cremaschi Baumel (1s2011) Alberto Arruda de Oliveira (1s2011) André Rodrigues Oliveira (1s2011) IMPORTANTE ESCLARECIMENTO SOBRE CARTAS DE RECOMENDAÇÃO Em virtude do grande número de oportunidades para fazer intercâmbio estudantil no exterior, muitos alunos têm solicitado cartas de recomendação. Infelizmente, alguns destes processos solicitam que o próprio aluno a envie, o que significa que o aluno tem acesso ao conteúdo da mesma; algo que sempre considerei inapropriado. Após muito ponderar sobre esta questão, resolvi tornar público que eu não faço cartas de recomendação em aberto. Se o processo do qual você está participando solicita o envio de uma carta em aberto, não a peça para mim, solicite esta carta para um outro professor. Algumas leituras interessantes (sob o meu ponto de vista -- sem atualização há anos) A babárie do especialismo - capítulo (considere isto) do livro \"Rebelião das massas\", Ortega y Gasset, 1926 Elogio ao Ócio - B. Russell, 1935 A última pergunta - I. Asimov, 1956 A essência da universidade - M. Covian, 1978 Slow science - T. Wood Jr., 2012 Pela ampliação da maioridade moral - Eliane Brum, 2013 Tirinha de Bill Watterson, autor do Calvin e Haroldo - 2013 Texto escrito por Washington Araújo, publicado em seu blog Cidadão do Mundo e reproduzido no Diário do Centro do Mundo, 2013. Inclui: Madiba entrou na prisão aos 46 anos, em 1964 e foi libertado aos 73 anos, em 1991. Pronunciou contundente discurso de defesa ante o tribunal que o sentenciara. Naquele último dia de liberdade que somente terminaria 27 anos depois, Madiba disse, punho para o alto, mão cerrada: Eu lutei contra a dominação branca, e lutei contra a dominação negra. Eu cultivei o ideal de uma sociedade democrática e livre, na qual todas as pessoas vivem juntas em harmonia e com oportunidades iguais. Este é um ideal que eu espero viver para alcançar. Mas, se for necessário, é um ideal pelo qual estou preparado para morrer Guardo com muito carinho cada mensagem, cada recordação, enviada por um aluno ou uma aluna. São preciosidades que me foram ofertadas e que representam a troca, sempre mútua, que tivemos. Abaixo, compartilho duas caricaturas carinhosamente feitas dos meus momentos de aula. Interessante que eu não mudei muito o local onde me posiciono para dar aulas no básico ;-), mesmo com tantos anos de diferença entre os dois desenhos. Há uma outra caricatura feita por um aluno da midialogia. Essa, infelizmente, não consegui recuperar. Se conseguir, compartilharei aqui também. Desenho do aluno Pedro Cordeiro de Almeida Bacharelado em Ciência da Computação/2012 Desenho da aluna Camila Porfírio da Silva Pinto Bacharelado em Ciência da Computação/2018",
  "content_length": 6816,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:27"
}