{
  "name": "Chris Martens 0001",
  "homepage": "https://camd.northeastern.edu/people/chris-martens",
  "status": "success",
  "content": "Chris Martens - College of Arts, Media and Design (CAMD) People  •  Art + Design  •  Associate Professor Chris Martens Email[email protected] Dr. Chris Martens is a computer scientist and computational media scholar in the field of digital games and narrative with a joint appointment in College of Arts, Media and Design and Khoury College of Computer Sciences. Their research advances tools for building expressive and playful interactive experiences, building on insights from programming language design, procedural content generation, AI for narrative and social agents, and cognitive models of player- and user interactions. They received their Ph.D. from Carnegie Mellon University in 2015 and held a postdoctoral scholar appointment at the University of California, Santa Cruz, from 2015-2016. For the past five years, they have been an Assistant Professor in Computer Science at North Carolina State University. They direct the Principles of Expressive Machines (POEM) Laboratory in research on digital games and interactive narrative. Martens brings a transdisciplinary perspective to Computational Media, informed by a strong foundation in programming language theory, leading to new insights about how logic programming, modal and linear logics, and type systems can model key properties of virtual worlds, and virtual agent reasoning systems. By examining the relationship between formal structures and their expressive affordances, Martens’ work allows us to better understand how digital tools can mirror and support cognitive processes, in turn leading to stronger tool support for creators and investigators from diverse backgrounds (including storytellers, artists, scientists, philosophers, and sociologists). Martens’ work has been supported by the NSF, the Laboratory for Analytic Sciences, and the Air Force Office of Scientific Research, including an NSF CAREER Award. Their work on mapping the space of interactive affordances across digital, analog, and performance-based storytelling media has been recognized with a Best Paper award at the International Conference on Interactive Digital Storytelling. See More See Less Departments Art + Design Education Ph.D, Computer Science, Carnegie Mellon University Bachelor Degree, Computer Science, Carnegie Mellon University In the News Game Design Holiday gift guide: CAMD professors recommend the latest in gaming December 14, 2022 Art + Design Design professor Chris Martens wants to make it easier to create video games September 1, 2022 Hello Top Searched Undergraduate Faculty Courses Apply International Students Transfer Classes Admissions Quick Links Contact Us Visit / Map and Directions Academic Calendar Course Catalog Resources Current Students Prospective Students Alumni Faculty & Staff",
  "content_length": 2771,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:44"
}