{
  "name": "Chris H. Q. Ding",
  "homepage": "https://sds.cuhk.edu.cn/en/teacher/197",
  "status": "success",
  "content": "DING, Chris H.Q. | School of Data Science SEARCH SDSÂ Portal Search SEARCH CUHK-Shenzhen ç®ä½ä¸­æ About SDS Overview Academic Area Deanâs Message Publications Brochure SchoolÂ Newsletter Annual Report FAQ Contact Us Programmes Introduction Undergraduate Data Science and Big Data Technology Statistics Computer Science and Engineering Financial Engineering 2+2 Double Major Programme Interdisciplinary Data Analytics +Â X Double Major Programme Aerospace Science and Earth InformaticsÂ + X Double Major Programme Columbia University 3+2 Initiative (Columbia Class) Taught Postgraduate M.Sc in Data Science M.Sc in Financial Engineering(Full-time/Part-time) M.Sc in Artificial Intelligence and Robotics M.Sc in Computer Science M.Sc in Statistics M.Sc in Bioinformatics Research Postgraduate M.Phil.-Ph.D. Programme in Data Science M.Phil.-Ph.D. Programme in Computer Science Faculty Faculty Emeritus Faculty Affiliated Appointments Researchers/Visitors Students UG Academic Advisory System Ph.D. Students Student Interviews News & Announcements News Announcements School Events Academic Conferences DDTOR 2025 CSAMSE 2023 RMTA 2023 ICASSP 2022 Mostly OM 2019 Academic Activities SDS Colloquium Series Other Events Research Jobs Faculty Positions Postdoctoral Fellowships Career Graduate Placements International Programmes About SDS Overview Academic Area Deanâs Message Publications Brochure SchoolÂ Newsletter Annual Report FAQ Contact Us Programmes Introduction Undergraduate Data Science and Big Data Technology Statistics Computer Science and Engineering Financial Engineering 2+2 Double Major Programme Interdisciplinary Data Analytics +Â X Double Major Programme Aerospace Science and Earth InformaticsÂ + X Double Major Programme Columbia University 3+2 Initiative (Columbia Class) Taught Postgraduate M.Sc in Data Science M.Sc in Financial Engineering(Full-time/Part-time) M.Sc in Artificial Intelligence and Robotics M.Sc in Computer Science M.Sc in Statistics M.Sc in Bioinformatics Research Postgraduate M.Phil.-Ph.D. Programme in Data Science M.Phil.-Ph.D. Programme in Computer Science Faculty Faculty Emeritus Faculty Affiliated Appointments Researchers/Visitors Students UG Academic Advisory System Ph.D. Students Student Interviews News & Announcements News Announcements School Events Academic Conferences DDTOR 2025 CSAMSE 2023 RMTA 2023 ICASSP 2022 Mostly OM 2019 Academic Activities SDS Colloquium Series Other Events Research Jobs Faculty Positions Postdoctoral Fellowships Career Graduate Placements International Programmes SDSÂ Portal CUHK-Shenzhen ç®ä½ä¸­æ DING, Chris H.Q. Presidential Chair Professor Education Background âââââPh.D. Computer Science, Columbia University, 1984-1987 M.Phil. Computer Science, Columbia University, 1983-1984 M.A. Computer Science, Columbia University, 1981-1983 B.S. Computer Science, Anhui University, 1977-1981 Academic Area Artificial Intelligence, Computer Science, Machine Learning and Artificial Intelligence Research Field Machine Learning, Data Mining, Bioinformatics, Information Retrieval, Web Link Analysis, High Performance Computing Personal Website http://myweb.cuhk.edu.cn/chrisding Email chrisding@cuhk.edu.cn Office Room 601, Daoyuan Building Biography Professor Ding is currently the Presidential Chair Professor at the School of Data Science, CUHK(SZ). Prior to that, Professor Ding held positions at the California Institute of Technology, the University of California, Lawrence Berkeley National Laboratory, and the University of Texas, Arlington. Professor Ding was selected into the CUSPEA program and went to Columbia University for further study and obtained his Ph.D. in theoretical physics and computer science (G2R Ranking). Professor Ding's research interests include machine learning/data mining, bioinformatics, information retrieval, and web link analysis. He and his collaborators work on multi-class protein fold prediction is now standard benchmark for protein 3D structure prediction. Professor Ding and his team discovered that Principal Component Analysis (PCA) provides the solution to K-means clustering. They also proved that nonnegative matrix factorization is equivalent to K-means /spectral clustering. Professor Ding and his co-researcher generalized PCA to 2D Singular Value Decomposition for dimension reduction of a set of 2D matrices. Their MPH technology/software for integrating multi-component executables on distributed memory architectures are adopted in many state-of-art large scale models for predicting the long-term climate. Professor Ding also developed the vacancy tracking algorithm for provably optimal in-place multi-dimensional array index reshuffle . Professor Ding previously worked at California Institute of Technology on Caltech Hypercubes developing parallel algorithms for Materials Science and Computational Biology; at NASA's Jet Propulsion Laboratory on developing algorithms for climate data assimilation, sparse matrix linear solvers and parallel graph partitioning; at the Lawrence Berkeley National Laboratory, working on high performance computing, algorithmic R&D for climate models, application benchmarking, giving tutorials on HPF, MPI, etc., and exploring new frontiers, the magic of matrix for clustering, ordering, ranking, embedding, bipartite graphs for systemic representation of proteins interaction networks, motifs, domains, complexes, functional modules, pathways . Besides, Professor Ding has won four Best Paper Awards for climate data assimilation parallel algorithm and supernova detection using support vector machines, a NASA Group Achievement Award at JPL, and two Outstanding Performance Awards at Lawrence Berkeley National Laboratory. He served in review panels for US National Science Foundation, and as reviewer for research proposals of National Science Foundations of Ireland, Israel, and Research Grants Council of Hong Kong. He also served for Bioinformatics journal, and program committees of leading conferences in data mining, machine learning and bioinformatics. He co-organizes annual workshops on data mining using matrices and tensors. His work was reported by Science (PDF), Nature (PDF), SIAM, and National Research Council Report. Academic Publications 1. Consensus Spectral Clustering. Dijun Luo, Chris Ding, Heng Huang. ICDE 2011, accepted to appear. 2. On the eigenvectors of p-Laplacian. Dijun Luo, Heng Huang, Chris Ding, Feiping Nie. Machine Learning 81(1): 37-51 (2010) 3. Efficient and Robust Feature Selection via Joint L2,1-Norms Minimization, Feiping Nie, Heng Huang, Cai Xiao, Chris Ding. NIPS 2010 4. Towards Structural Sparsity: An Explicit L2/L0 Approach. Dijun Luo, Chris Ding, Heng Huang. ICDM 2010. 5. Multi-Label Linear Discriminant Analysis, Hua Wang, Chris Ding, Heng Huang. The 11th European Conference on Computer Vision (ECCV 2010). 6. Image Categorization Using Directed Graphs. Hua Wang, Heng Huang, Chris Ding. ECCV (3) 2010: 762-775 7. Multi-label Feature Transform for Image Classifications. Hua Wang, Heng Huang, Chris Ding. ECCV (4) 2010: 793-806 8. Discriminant Laplacian Embedding. Hua Wang, Heng Huang, Chris Ding. AAAI 2010 9. Multi-Label Classification: Inconsistency and Class Balanced K-Nearest Neighbor. Hua Wang, Chris Ding, Heng Huang. AAAI 2010 10. Exploiting user interests for collaborative filtering: interests expansion via personalized ranking. Qi Liu, Enhong Chen, Hui Xiong, Chris Ding. CIKM 2010: pp1697-1700. 11. Hierarchical Ensemble Clustering. Li Zheng, Tao Li, and Chris Ding. In Proceedings of 2010 IEEE International Conference on Data Mining (ICDM 2010). 12. Weighted Feature Subset Non-Negative Matrix Factorization and its Applications to Document Understanding. Dingding Wang, Chris Ding, and Tao Li. In Proceedings of 2010 IEEE International Conference on Data Mining (ICDM 2010). 13. Feature subset non-negative matrix factorization and its applications to document understanding. Dingding Wang, Chris Ding, Tao Li. SIGIR 2010, pp:805-806 14. Closed form solution of similarity algorithms. Yuanzhe Cai, Miao Zhang, Chris Ding, Sharma Chakravarthy. SIGIR 2010: 709-710 15. Directed Graph Learning via High-Order Co-linkage Analysis. Hua Wang, Chris Ding, Heng Huang. ECML/PKDD (3) 2010: 451-466. 16. Community Discovery Using Nonnegative Matrix Factorization. Fei Wang, Tao Li, Xin Wang, Shenghuo Zhu, and Chris Ding. Data Mining and Knowledge Discovery, to appear, 2010. 17. Bridging Domains with Words: Opinion Analysis with Matrix Tri-factorizations. Tao Li, Vikas Sindhwani, Chris Ding, Yi Zhang. SDM 2010: 293-302 18. Binary matrix factorization for analyzing gene expression data. Zhongyuan Zhang, Tao Li, Chris Ding, Xian-Wen Ren, Xiangsun Zhang. Data Min. Knowl. Discov. 20(1): 28-52 (2010) 19. Collaborative Filtering: Weighted Nonnegative Matrix Factorization Incorporating User and Item Graphs. Quanquan Gu, Jie Zhou, Chris Ding. SDM 2010: 199-210 20. Convex and Semi-Nonnegative Matrix Factorizations [New variants of NMF with enhanced interpretability], Chris Ding, Tao Li, Michael I. Jordan. IEEE Transactions on Pattern Analysis and Machine Intelligence, 2009. 21. Consensus Group Based Stable Feature Selection, Steven Loscalzo, Lei Yu, and Chris Ding. Proceedings of the 15th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD-09), Paris, France, June, 2009. (Full paper, acceptance rate: 10%) 22. Symmetric Two Dimensional Linear Discriminant Analysis (2DLDA) , Dijun Luo, Chris Ding, Heng Huang. Proceedings of IEEE Conference on Computer Vision and Pattern Recognition (CVPR 2009). 23. Cross-Domain Sentiment Classification. Tao Li, Vikas Sindhwani, Chris Ding. Proceedings of 32st Annual International ACM SIGIR Conference (SIGIR 2009), 2009 ( poster paper). 24. Integrated KL (K-means - Laplacian) Clustering: A New Clustering Approach by Combining Attribute Data and Pairwise Relations. Fei Wang, Chris Ding, Tao Li. Proceedings of SIAM International Conference on Data Mining (SDM 200",
  "content_length": 13645,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:38"
}