{
  "name": "Christine L. Lisetti",
  "homepage": "http://www.cis.fiu.edu/~lisetti",
  "status": "success",
  "content": "Christine Lisetti - Home Christine Lisetti Home Awards Research Publications Teaching HCI - CAP 4104 / CAP 5109 > Syllabus Schedule Homework Projects Resources HCI for IT - 3721 > Syllabus Schedule Contact Welcome to my home page! Short bio I am faculty at Florida International University (FIU) in the Knight Foundation School of Computing and Information Sciences , and the Director of the Virtual Intelligent Social AGEnts (VISAGE) Laboratory. My long-term research goal is to create engaging virtual social agents (VISAGEs) that can help humans in a variety of contexts by interacting with them in innovative ways, through natural expressive multimodal interaction (e.g. in cybertherapy, health counseling, educational games, cyberlearning).I conduct basic research  at the intersection of human-computer interaction (HCI), affective computing (I was on the founding Editorial Board of  the IEEE Transactions on Affective Computing),  human-centered artificial intelligence (AI),  and virtual reality (VR) in order to discover design principles for VISAGESs. I also conduct applied research by applying these principles to different application domains (e.g. healthcare, medicine, education).My research has been funded by federal agencies  in the USA  such as the National Science Foundation (NSF), the US National Institute of Health (NIH), the US Department of Education, NASA Ames, US Army STRICOM, the US Office of Naval Research (ONR); and in Europe by the European Union Commission, EUREKA Information Technology for European Advancement (ITEA), the Provence-Alpes Cote d’Azur (PACA) Regional Research and Development Program; as well as by industry such as Intel, Microsoft, STMicroelectronics, Numedeon Inc., and the Institute for Disabilities Research and Training. Copyright 2021",
  "content_length": 1794,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:36"
}