{
  "name": "Christian Bachmeir",
  "homepage": "https://fiw.thws.de/fakultaet/personen/dozentinnen-und-dozenten/person/prof-dr-christian-bachmeir",
  "status": "success",
  "content": "Dozentinnen und Dozenten :: Technische Hochschule Würzburg-Schweinfurt Zum Inhalt wechseln Zum Hauptmenü wechseln Zum Navigationspfad wechseln Zur Suche wechseln Zur Sprachauswahl wechseln Zur Servicenavigation wechseln Dozentinnen und Dozenten Prof. Dr. Christian Bachmeir Fakultät Informatik und Wirtschaftsinformatik Telefon +49 931 3511-8132 E-Mail christian.bachmeir[at]thws.de Besucheranschrift Sanderheinrichsleitenweg 20 97074 Würzburg Raum I.3.26 Sprechstunden Please schedule a zoom-meeting using the following link:calendly.com/prof-bachmeir/zoom-sprechstunde-thws Aufgabenbereich(e) Please check out my projects below.I am always open to discuss opportunities for collaboration. Projekte Total research grants acquired: 2.450.217 € KI-Inspektionsdrohne                                                  (Luftfahrtforschungsprogramm V) :623.000 €   (only for our team @THWS)Definition und Evaluierung  von 5G-Projektideen   (Consulting Project):40.000 €     (only for our team @THWS)FlowPro                                                                          (mFund):869.024 €   (only for our team @THWS)5G-InnoPlatt-NES                                                          (5G-Innovationswettbewerb (BMVI)): 618.193,00 € (only for our team @THWS)HISÜL                                                                              (BayVFP - Digitalisierung)300.000 € (only for our team @THWS)Bayerisches Staatsministerium für Wirtschaft, Landesentwicklung und EnergieCurrent and Past Industry-Project-Partners:IBM, Lufthansa Technik,  Emqopter GmbH, Flexus AG, ASTI InSystems - InSystems Automation GmbH, Siemens Corporate Technology, Hans Geis GmbH + Co KG,  Siemens AG, PIA Automation Holding GmbH, Fertigungsgerätebau Adolf Steinbach GmbH & Co. KG, Preh GmbH, ullmer GmbH & Co. KG, Götting KGCurrent and Past Public-Project-Partners: Technische Universität München, Helmut-Schmidt-Universität/Universität der Bundeswehr Hamburg, HTW des Saarlandes, Landkreis Rhön-GrabfeldOur Sales Process:We are committed to defining and developing project-ideas, jointly with industry-partners.The project-ideas usually are first of a kind,and cut either costs or deliver new business at our industry-partners.In addition we very much like to focus on building diversified project-consortiums,  that enable us to deliver jointly superb projects, consisting of startups, small and midsize companies and large global enterprises.We are always available to discuss, improve, extend, qualify, develop new ideas/ cutting edge proposals.Our Delivery Process:Work highly integrated with our industry partnersWeekly project management callsContinuous reviewsPrototype Development and EvaluationAnswering applied research questions, that have an impact on our industry-partners business within a reasonable timeline.Bottom line:Result driven; focus is on helping our industry partners to reach their goals.For more and current information, please feel free to check out:www.linkedin.com/in/bachmeir",
  "content_length": 2996,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:57"
}