{
  "name": "Christian Bettstetter",
  "homepage": "https://bettstetter.com",
  "status": "success",
  "content": "Christian Bettstetter – Professor, Institute of Networked and Embedded Systems, Klagenfurt Recent Posts Circular patterns in swarmalator systems Published by Christian Bettstetter We employ the swarmalator model to make a group of entities align in a self-organized way along one or more circles. May 30, 2025 Publications, Videos Self-fulfilling prophecies: What causes a bank to fail? Published by Christian Bettstetter We talk about self-fulfilling prophecies when something we have predicted comes true as a result of our conscious and unconscious actions. Jack Bryson, [a doctoral student and] university assistant... June 27, 2024 Interviews, Projects Graduates receive awards for their work on swarm robotics Published by Christian Bettstetter Judith Wieser and Melisa Midžan were honored for their bachelor and master theses on robot swarms for search and collect missions. December 12, 2023 Videos Interference by drones to ground users Published by Christian Bettstetter Aerial drones connected to cellular networks can affect the throughput of common cell phone users. System-level simulation results were presented at an ACM MobiSys workshop earlier this week. June 23, 2023 Projects, Publications Award for excellence in teaching Published by Christian Bettstetter The University of Klagenfurt has honored exceptional commitment and quality in teaching with its “Lehrepreis.” The award recipients are Nilüfer Aydin, Christian Bettstetter, Andreas Bollin, and Sabrina Gärtner. November 27, 2022 Awards, Teaching Hayat named “rising star” in networking and communications Published by Christian Bettstetter The annual list Rising Stars in Computer Networking and Communications recognizes ten up-and-coming female researchers to honor their great career start. This year’s list features Samira Hayat, doctoral graduate... August 28, 2022 Awards, Career Drones in cellular networks Published by Christian Bettstetter A new project investigates the integration of unmanned aerial vehicles in 5G networks and proposes a hybrid connectivity solution with Wi-Fi. The work is led by Aymen Fakhreddine and... June 8, 2022 Projects Teams of robots that don’t run out of energy Published by Christian Bettstetter Let’s imagine a large region affected by an earthquake that needs to be combed for missing persons. Because buildings remain at risk of collapsing, this is a task that... October 6, 2021 Interviews, Projects About Christian Bettstetter is professor at the Institute of Networked and Embedded Systems at U Klagenfurt and scientific director of Lakeside Labs. (Zur Person) Bettstetter and his team work on wireless communications and self-organization in networks. Ongoing research comprises interference, relaying, and synchronization in wireless systems, robot exploration, and UAV communications. He teaches courses on 'electricity and magnetism' and 'mobile communications and networks.' Overview slides Tool advice Trello is a software tool to manage projects and workflows using Kanban boards. It can greatly support scientists. A primer. Research on Drones Offloading computation to 5G networks: Helping drones to improve their autonomous navigation Published by Christian Bettstetter Commercial drones usually come equipped with modest on-board computing power. Consequently, their speed and agility are somewhat limited when they use their cameras like eyes to navigate in space.... March 19, 2021 Drones, Projects, Publications Drones that sync and swarm Published by Christian Bettstetter Scientists of the doctoral school \"Networked Autonomous Aerial Vehicles\" implemented a self-adaptive swarm of drones and showcased it in Klagenfurt's new drone hall, one of the largest and most... December 5, 2019 Drones, Prototypes, Videos Using cellular networks for drones Published by Christian Bettstetter It might soon become common for drones to transport goods and people, monitor disaster zones, and bring various forms of relief to areas that are difficult to access. Which... September 20, 2019 Drones, Publications Unmanned aerial vehicle communications: Opportunities and challenges Published by Christian Bettstetter Wireless communications is essential for many applications with commercial drones. Omid Semiari interviewed Christian Bettstetter about this exciting topic at the interface of communications and robotics for the latest... December 11, 2018 Drones, In a Nutshell, Interviews, Press Coverage “Drones are here to stay. Get used to it.” Published by Christian Bettstetter This statement was the title of a TIME article, which was included in the magazine’s special report on “The Drone Age”. We asked Christian Bettstetter to tell us what... October 2, 2018 Drones, Interviews, Press Coverage Packages delivered by air: Drones as delivery service Published by Christian Bettstetter What has travelled by road to reach us until now could be delivered by drones in the future. This has many advantages: Poor rural transport infrastructure or persistent congestion... January 12, 2018 Drones, Interviews, Press Coverage Research on Self-Organizing Synchronization Deadlocks in the synchronization of oscillators Published by Christian Bettstetter Certain oscillator networks suffer from deadlocks that prevent them from synchronizing. We derived the likelihood for such constellations in star graphs and found that they also occur in random... December 1, 2020 Publications, Synchronization Robots that sync and swarm: A proof of concept in ROS 2 Published by Christian Bettstetter The swarmalator model for systems in which synchronization and swarming are coupled is implemented and studied for the first time in a technical system. September 20, 2018 Prototypes, Synchronization, Videos One time for all: Synchronizing time in drone swarms Published by Christian Bettstetter Wherever several clocks tick simultaneously, it is tricky to get them all to display precisely the same time. This can be a challenge for drone swarms that are airborne... February 14, 2018 Interviews, Projects, Publications, Synchronization Synchronization with phase rate correction Published by Christian Bettstetter Synchronization algorithms based on the theory of pulse-coupled oscillators are evaluated on programmable radios. It is experimentally demonstrated that the stochastic nature of coupling is a key ingredient for... April 4, 2016 Projects, Publications, Synchronization Research on Wireless Systems Wireless connectivity in airplanes Published by Christian Bettstetter The aviation industry is interested in wireless solutions for in-plane connectivity to improve safety and reduce airplane cost and weight. Ultra-wideband (UWB) seems to be a suitable technology for... April 21, 2021 Projects, Publications, Wireless UWB connectivity in industrial environments Published by Christian Bettstetter The connectivity of ultra-wideband (UWB) devices is studied in an aircraft assembly hangar and a production hall. These measurements are the first ones reported for off-the-shelf UWB devices in... April 2, 2018 Projects, Publications, Wireless Recent Publications Multidrone systems: More than the sum of the parts. IEEE Computer, 2021. Wireless connectivity in airplanes: Challenges and the case for UWB. IEEE Access, 2021. Interference prediction in wireless networks: Stochastic geometry meets recursive filtering. IEEE Trans. Veh. Technol., 2021. Deadlocks in the synchronization of pulse-coupled oscillators on star graphs\". Phys. Rev. E, 2020. Sandsbots: Robots that sync and swarm. IEEE Access, 2020. Autocorrelation and coherence time of interference in Poisson networks. IEEE Trans. Mobile Comput., 2020. On interference dynamics in Matérn networks. IEEE Trans. Mobile Comput., 2020. Interference management for cellular-connected UAVs: a deep reinforcement learning approach. IEEE Trans. on Wireless Commun., 2019. Drone delivery systems: Job assignment and dimensioning. Autonom. Robots, 2019. Drone networks: Communications, coordination, and sensing. Ad Hoc Netw., 2018. Essay Young researchers in the engineering sciences should resist the temptation to do only applied research but rather establish a fruitful interaction between fundamental and applied work. After all, our... Award Award for excellence in teaching by Christian Bettstetter The University of Klagenfurt has honored exceptional commitment and quality in teaching with its “Lehrepreis.” The award recipients are Nilüfer Aydin, Christian Bettstetter, Andreas Bollin, and Sabrina Gärtner. November 27, 2022 Awards, Teaching Outreach The autonomous drone system developed by Lakeside Labs and U Klagenfurt is one of «15 novel ideas for 2015» featured by the WIRED magazine. Max Biederbeck interviewed Samira Hayat,... Keynote Advice October 11, 2019 Workshop on scientific writing The Mobile Systems Group of the University of Klagenfurt held a workshop on scientific writing. They discussed the typical... by Christian Bettstetter April 16, 2017 Questions in professorship hearings “What’s to expect in job interviews for a professorship?” is a commonly raised question by researchers applying for a... by Christian Bettstetter November 27, 2016 Using Trello in academia Trello is a software tool to manage projects and workflows using Kanban boards. It can greatly support scientists. A primer. by Christian Bettstetter May 11, 2016 “What salary can I expect in industry after my PhD?” For many young researchers, the PhD graduation marks the end of an era of standardized salaries. They now have... by Christian Bettstetter April 5, 2016 My first programming experience Read about my first computer and programming experience, share your own experience, and join the discussion about the best-suited... by Christian Bettstetter February 23, 2015 Software for scientists using Mac, iPad My personal experience as a professor with some software tools for the Apple Mac (OS X) and iPad (iOS)... by Christian Bettstetter Research July 18, 2021 “Research and cultural diversity widened my horiz",
  "content_length": 14756,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:56"
}