{
  "name": "Christiana Ijeoma Ezeife",
  "homepage": "http://www.uwindsor.ca/science/computerscience/1062/dr-christie-ezeife",
  "status": "success",
  "content": "Dr. Christie Ezeife | School of Computer Science Skip to main content University of Windsor Search Enter the terms you wish to search for. Search CLOSE QUICK LINKS Current StudentsBrightspaceUWinsite StudentCampus BookstoreFaculty + StaffUWinsite FinanceAlumni + DonorsIndustry + Community Partners Faculty of Science About Academics Research Student Experience News and Events Giving to Science EDI Alumni About About UWindsor Office of the President People, Equity and Inclusion Virtual Tour Visitor Information Campus Maps Parking VIEW Magazine Academics ProgramsUndergraduate Programs Graduate Programs International Programs Co-operative Education Continuing Education SupportOffice of the Registrar Financial Matters Office of the Provost Faculties Arts, Humanities, and Social Sciences Law Education Nursing Engineering Business Graduate Studies Human Kinetics Science Research Research & Innovation Research Partnerships Research Ethics Research Safety Animal Care Research Finance Leddy Library UWill Discover! Student Life About Student Life UWindsor Events SoCA Concerts & Events Lancers Varsity Sports Athletics + Recreation Services Student Accessibility Services Residence Food Services Student Support Back to Top FUTURE STUDENTS ask.UWindsor GIVE TO UWINDSOR MENU FUTURE STUDENTS ask.UWindsor GIVE TO UWINDSOR School of Computer Science School of Computer Science In this section Welcome New to the School of Computer Science? News Events Undergraduate Programs Graduate Programs Experiential Education in Computer Science (Co-op) Research Members of the SchoolFaculty Limited Term Sessional Instructors Adjunct Faculty Members Staff Student Representatives Academic Planning and Resources Technical Resources for Students Financial Resources for Students Contact Us Welcome New to the School of Computer Science? News Events Undergraduate Programs Graduate Programs Experiential Education in Computer Science (Co-op) Research Members of the SchoolFaculty Limited Term Sessional Instructors Adjunct Faculty Members Staff Student Representatives Academic Planning and Resources Technical Resources for Students Financial Resources for Students Contact Us UWindsor Home School of Computer Science Dr. Christie Ezeife Dr. Christie Ezeife Professor 519-253-3000 ext. 3012 cezeife@uwindsor.ca Office: 5103  LT Education: Ph.D., Computer Science, University of Manitoba, 1995; MSc., Computer Science, Simon Fraser University, 1988. Professional Affiliations: Senior ACM professional Member, Association for Computing Machinery ACM) Research Interests: Physical design of database/warehouse systems (eg. data fragmentation) Sequential pattern mining and other mining methods Recommendation systems in domains (eg. Web, E-Commerce, Education) Social network analysis (eg. influence maximization, posts mining) Selected Publications: Ejieh, Chukwuma., Ezeife, C. I.,  Chaturvedi, R. Mining Product Opinions with Most Frequent Clusters of Aspect Terms.  In proceedings of ACM SAC conference 2019, Lymassol Cyprus, April 8 – 12,2019, In press. Ying Xiao, C. I. Ezeife,  E-commerce Product Recommendation Using Historical Purchases and Clickstream Data,  20th  International Conference on Big Data Analytics and Knowledge Discovery - DaWaK 2018, Regensburg, Germany, September 3 - 6, 2018,  Springer’s LNCS 11031, p. 70-82. Ezeife, C.I., Zhang, Dan. (2014). Mining Multiple Related Data Sources Using Object-oriented Model. Springer Verlag’s TLDKS (Large-Scale Data and Knowledge-Centered Systems)  XIII journal, LNCS 8420, pp. 1-29. Ezeife, C.I. and Titas Mutsuddy, Towards Comparative Mining of Web Document Objects with NFA: WebOMiner System, in the IGI’s International Journal of Data Warehousing and Mining (IJDWM), 8(4), pp. 1-21, October-December 2012. Mabroukeh, Nizar and C.I. Ezeife, A Taxonomy of Sequential Pattern Mining Algorithms, ACM Computing Surveys Journal(CSUR), ACM Computing Surveys, Vol. 43, No. 1, Article 3, pp 3:1 – 3:41, November 2010. Ezeife, C.I.  and  Yi  Liu, Fast Incremental Mining of Web Sequential Patterns with PLWAP Tree,  Data Mining and Knowledge Discovery  Journal (DAMI), Vol. 19, pp 376 – 418, Springer Verlag publishers, 2009. Website: Dr. Christie Ezeife Meet Dr. Ezeife! Loading video, please wait... share post share CS Events Fall 2025 Demo Day Fri, 12/05/2025 - 10:00 SCS Demo Day - Looking Forward to Seeing You Fri, 12/05/2025 - 10:00 Accelerating Image Classification with Graph Convolutional Neural Networks using Voronoi Diagrams - PhD Dissertation Proposal by: Mustafa Mohammadi Gharasuie Fri, 12/12/2025 - 13:00 WiCyS Windsor Twitter Tweets by wicyswindsor Computer Science Society Instagram View this post on Instagram A post shared by UWin Computer Science Society (@uwindsorcss) share post share",
  "content_length": 4757,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:26"
}