{
  "name": "Christopher F. Lehnert",
  "homepage": "https://research.qut.edu.au/qcr/people/chris-lehnert",
  "status": "success",
  "content": "Chris Lehnert - QUT Centre for Robotics Skip to content Dr Chris Lehnert Home Our People Dr Chris Lehnert Please enable JavaScript Please enable JavaScript Find Chris Lehnert onChris Lehnert's full profile and contact information are available on: Senior Lecturer, Program Lead Physical Interaction (Robotic Manipulation, Agricultural robotics, Vertical farming) PhD (Queensland University of Technology), Bachelor of Engineering (Honours) (University of Queensland)In my career spanning over a decade, I have specialized in robotic perception and grasping systems, contributing significantly to the advancement of agricultural robotics. My work focuses on automating complex tasks such as crop monitoring and harvesting, demonstrating my commitment to applying robotic solutions to real-world agricultural challenges.In my role, I have led numerous impactful research projects, particularly those targeting regional food precincts and the development of next-generation indoor cropping systems. These projects reflect my dedication to pioneering innovative robotic technologies in agriculture and related fields. My efforts in this domain have not only contributed to the advancement of the field but have also positioned me as a key figure in the integration of robotics into practical, everyday applications. Projects (Chief investigator)Moving to SeeReaching in Clutter using Force and Tactile FeedbackSafe autonomous driving through dense vegetation via interaction ProjectsAmazon Picking Challenge (2016)Autonomous Robotic Platforms for GreenhousesHarvey – The Robotic Capsicum HarvesterMoving to SeeRobotic Vertical Farming Systems Additional information Current Supervisions Utilising cooperation and exploration techniques to solve complex, multi-stage reinforcement learning tasksPhD, Principal Supervisor Other supervisors: Distinguished Emeritus Professor Peter Corke, Professor Niko Suenderhauf NewsDr Fernando Vanegas Alvarez awarded Advanced Queensland Industry Research Fellowship Grant!Posted: September 19, 2024QCR CI Aaron McFadyen Wins 2024 Australian Museum Eureka Prize!Posted: September 8, 2024From PhD to Lecturer: Dr Jasmin Martin's JourneyPosted: August 18, 2024Recent TweetsFollow @QUTRobotics",
  "content_length": 2220,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:13"
}