{
  "name": "Christopher Riesbeck",
  "homepage": "http://www.cs.northwestern.edu/~riesbeck",
  "status": "success",
  "content": "Chris Riesbeck Northwestern University Home Research Publications For Students For Fun Welcome I am an Associate Professor in the Department of Computer Science at Northwestern University. I received my Ph.D. in Computer Science from Stanford University in 1974. My dissertation was on natural language understanding. I have done research on case-based reasoning, memory-based language understanding, and authorable intelligent systems for education. I am a co-director of The Center for Computer Science and Learning Sciences , the director of the MS program in Computer Science, and a Fellow of the American Association for Artificial Intelligence. What is AI? Anyone who works in Artificial Intelligence should be able to define what that means. If you Google \"define:artificial intelligence\", you'll see lots of definitions, mostly oriented around the notion of computers doing things that require intelligence. These definitions are clearly inadequate, for at least three reasons: There are tasks that we think require intelligence when humans do them, that are not AI, e.g., calculating complex sums. Conversely, there are tasks we don't think require intelligence when humans do them, that are AI tasks, e.g., computer vision. And, of course, there are tasks that were called AI until we figured out how to get a computer to do them, e.g., optical character recognition. So here's a definition of AI that gets at the heart of why we study what we do: Artificial Intelligence is the search for the answer to the fundamental question: Why are computers so stupid? It's left as an exercise for the intelligent reader as to why this definition addresses the three weaknesses listed above. My Calendar Getting to My Office Curriculum Vitae Resources CS Department McCormick Engineering Northwestern University Copyright © 2022, Chris Riesbeck, all rights reserved.",
  "content_length": 1866,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:32"
}