{
  "name": "Christopher Peikert",
  "homepage": "http://web.eecs.umich.edu/~cpeikert",
  "status": "success",
  "content": "Chris Peikert Chris Peikert Ph.D. (MIT), 2006 Arthur W. Burks Collegiate Professor Computer Science and Engineering, University of Michigan (Ann Arbor) Email: cpeikert [at] umich [dot] edu, Twitter: @ChrisPeikert, Bluesky: @chrispeikert.bsky.social Office: Beyster 3601 Phone: 734 . 936 . 2974 Jump to: news — teaching — talks — research. In 2006 I received my Ph.D. from the MIT Computer Science and Artificial Intelligence Laboratory. My advisor was the incomparable Silvio Micali. My research interests include cryptography, lattices, coding theory, algorithms, and computational complexity. A particular focus is on cryptographic schemes whose security can be based on the apparent intractability of lattice problems. Further information may be found in my research summary. Program committee member: CFAIL 2025, ASIACRYPT 2024, CFAIL 2024, FOCS 2023, EUROCRYPT 2023, CRYPTO 2021 (program co-chair), CRYPTO 2020, CRYPTO 2019, SAC 2019, TCC 2018, FOCS 2017, EUROCRYPT 2017, TCC 2015, PKC 2015, SCN 2014, CRYPTO 2014, TCC 2014, PKC 2013, CRYPTO 2012, ASIACRYPT 2011, PQC 2011, SCPQ 2011, EUROCRYPT 2011, TCC 2011, STOC 2010, PQC 2010, CRYPTO 2009, TCC 2008. News May 2025: It is a great honor and privilege to be named the Arthur W. Burks Collegiate Professor in Computer Science and Engineering. May 2025: Our Ring-LWE paper received the Test-of-Time Award at Eurocrypt 2025! Apr 2024: Very honored to be selected as an IACR Fellow. Aug 2023: Thrilled to have received the Test-of-Time Award from Crypto 2008! May 2021: Happy to have lost all adjectives, leaving just \"Professor.\" Feb 2019: Finally! Noninteractive Zero Knowledge for all of NP from plain LWE. Nov 2017: Thank you to the TCC community for the great honor of the Test-of-Time Award! Here's our talk. Mar 2017: I've been appointed the Patrick C. Fischer Development Professor of Theoretical Computer Science. Great thanks to the Fischer family and the University for this honor! Aug 2016: Announcing the Ring-LWE Challenges: get cracking! May 2016: Announcing Λ ○ λ (pronounced \"L O L\"), a general-purpose library for lattice-based cryptography! Get the paper or the code. Jan 2016: My survey A Decade of Lattice Cryptography is now available. Sep 2015: After six great years at Georgia Tech, I've moved to the University of Michigan. Go Blue! Thanks to the Google Research Awards program! Thank you to the Alfred P. Sloan Foundation! Teaching \"Good teaching is one-fourth preparation and three-fourths theater.\" — Gail Godwin EECS 376, Foundations of Computer Science (Fall 2024 (x2), Winter 2024, Fall 2019, Fall 2017) EECS 575, Advanced Cryptography (Fall 2025, Fall 2023, Fall 2020, Fall 2019, Fall 2018, Winter 2017, Winter 2016) EECS 475, Introduction to Cryptography (Winter 2019, Fall 2016) EECS 598, Lattices in Cryptography (Fall 2022, Fall 2015) Teaching at Georgia Tech: CS 8803, Lattices in Cryptography (Fall 2013) CS 7560, Theory of Cryptography (Spring 2015, Spring 2013, Spring 2011) CS 4510, Automata and Complexity (Fall 2014) CS 3510/11, Design and Analysis of Algorithms/Honors Algorithms (Spring 2014, Spring 2012, Fall 2011) CS 6260, Applied Cryptography (Fall 2012) CS 4235 / 8803 IIS, Introduction to Information Security, Fall 2010 Expository Lectures on Lattice-Based Cryptography Slides from some recent tutorials on lattice-based crypto. (Talks on specific papers are available below.) Unexpected Applications of Fully Homomorphic Encryption (invited talk at PKC 2023) Post-Quantum Cryptography (invited tutorial at QIP 2022) To Cyclicity and Beyond! (from TCC 2017 Test-of-Time Award) Lattice-Based Cryptography (invited tutorial at QCRYPT 2016) Bootstrapping with Small Error Growth and Cryptography from Rings (from Summer School on Mathematical and Practical Aspects of Fully Homomorphic Encryption and Multilinear Maps) Ideal Lattices and Ring-LWE: Overview and Open Problems (from ICERM Workshop on Mathematics of Lattices and Cybersecurity) Ring Switching and Bootstrapping FHE (from Oberwolfach workshop on cryptography) Lattices: ... to Cryptography (from Visions of Cryptography) Tutorials from crypt@b-it 2013 summer school at Bonn University: Day 1, Day 2, Day 3, Day 4, Day 5 The Geometry of Rings (from the ECRYPT II Summer School on Lattices) Learning With Errors 1 and 2 [Video] Trapdoors for Lattices 1 and 2 [Video] (from the 2nd Bar-Ilan Winter School on Cryptography) Trapdoors for Lattices: Signatures, Identity-Based Encryption, and Beyond (from the ENS Lattice Crypto Day, Paris) Lattices: From Worst-Case, to Average-Case, to Cryptography and Peculiar Properties of Lattice-Based Encryption (from the CWI Workshop, Amsterdam) Some Recent Progress in Lattice-Based Cryptography (from invited tutorial at TCC 2009) Research \"If we knew what it was we were doing, it would not be called research, would it?\" — Albert Einstein (?) List Decoding Reed–Solomon Codes in the Lee, Euclidean, and Other Metrics Chris Peikert, Alexandra Veliche Hostetler. Submitted. Vive Galois! Part 1: Optimal SIMD Packing and Packed Bootstrapping for FHE Chris Peikert, Zachary Pepin. In TCC 2025. High-Throughput Universally Composable Threshold FHE Decryption Guy Zyskind, Doron Zarchy, Max Leibovich, Chris Peikert. In CCS 2025. Distinguished Paper Award. FrodoKEM: A CCA-Secure Learning With Errors Key Encapsulation Mechanism Lewis Glabush, Patrick Longa, Michael Naehrig, Chris Peikert, Douglas Stebila, Fernando Virdia. In IACR Communications in Cryptology, 2025. Cryptanalysis of Lattice-Based Sequentiality Assumptions and Proofs of Sequential Work Chris Peikert, Yi Tang. In CRYPTO 2024. Functional Commitments for All Functions, with Transparent Setup and from SIS Leo de Castro, Chris Peikert. In EUROCRYPT 2023. Classical and Quantum Security of Elliptic Curve VRF, via Relative Indifferentiability Chris Peikert, Jiayu Xu. In CT-RSA 2023. Hardness of the (Approximate) Shortest Vector Problem: A Simple Proof via Reed-Solomon Codes Huck Bennett, Chris Peikert. In RANDOM-APPROX 2023. Improved Hardness of BDD and SVP Under Gap-(S)ETH Huck Bennett, Chris Peikert, Yi Tang. In ITCS 2022. Lattice (List) Decoding Near Minkowski's Inequality Ethan Mook, Chris Peikert. IEEE Transactions on Information Theory, 68(2):863-870. Vector and Functional Commitments from Lattices Chris Peikert, Zachary Pepin, Chad Sharp. In TCC 2021. F1: A Fast and Programmable Accelerator for Fully Homomorphic Encryption Axel Feldmann, Nikola Samardzic, Aleksandar Krastev, Srini Devadas, Ron Dreslinski, Karim Eldefrawy, Nicholas Genise, Chris Peikert, Daniel Sanchez. In MICRO 2021. Selected as a MICRO'21 Top Pick. Hardness of Bounded Distance Decoding on Lattices in ell_p Norms Huck Bennett, Chris Peikert. In CCC 2020. Improved Discrete Gaussian and Subgaussian Analysis for Lattice Cryptography Nicholas Genise, Daniele Micciancio, Chris Peikert, Michael Walter. In PKC 2020. He Gives C-Sieves on the CSIDH [Slides, Video] Chris Peikert. In EUROCRYPT 2020. Algebraically Structured LWE, Revisited [Slides] Chris Peikert, Zachary Pepin. In TCC 2019. Noninteractive Zero Knowledge for NP from (Plain) Learning With Errors [Slides, TCS+ video] Chris Peikert, Sina Shiehian. In CRYPTO 2019. ALCHEMY: A Language and Compiler for Homomorphic Encryption Made easY Eric Crockett, Chris Peikert, Chad Sharp. In CCS 2018. More Efficient Commitments from Structured Lattice Assumptions Carsten Baum, Ivan Damgård, Vadim Lyubashevsky, Sabine Oechsner, Chris Peikert. In SCN 2018. New (and Old) Proof Systems for Lattice Problems [Slides] Navid Alamati, Chris Peikert, Noah Stephens-Davidowitz. In PKC 2018. Privately Constraining and Programming PRFs, the LWE Way [Slides] Chris Peikert, Sina Shiehian. In PKC 2018. Pseudorandomness of Ring-LWE for Any Ring and Modulus [Slides] Chris Peikert, Oded Regev, Noah Stephens-Davidowitz. In STOC 2017. Challenges for Ring-LWE [website] Eric Crockett, Chris Peikert. Manuscript. Multi-Key FHE from LWE, Revisited Chris Peikert, Sina Shiehian. In TCC 2016-B. Λ ○ λ: Functional Lattice Cryptography [code] Eric Crockett, Chris Peikert. In CCS 2016. How (Not) to Instantiate Ring-LWE [Slides] Chris Peikert. In SCN 2016. Three's Compromised Too: Circular Insecurity for Any Cycle Length from (Ring-)LWE Navid Alamati, Chris Peikert. In CRYPTO 2016. A Decade of Lattice Cryptography Chris Peikert. Monograph, September 2015 (updated February 2016). Recovering Short Generators of Principal Ideals in Cyclotomic Rings Ronald Cramer, Léo Ducas, Chris Peikert, Oded Regev. In Eurocrypt 2016. Key-Homomorphic Constrained Pseudorandom Functions Abhishek Banerjee, Georg Fuchsbauer, Chris Peikert, Krzysztof Pietrzak, Sophie Stevens. In TCC 2015. Lattice Cryptography for the Internet [Slides] Chris Peikert. In PQCrypto 2014. Faster Bootstrapping with Polynomial Error [Slides] Jacob Alperin-Sheriff, Chris Peikert. In CRYPTO 2014. New and Improved Key-Homomorphic Pseudorandom Functions [Slides] Abhishek Banerjee, Chris Peikert. In CRYPTO 2014. Using Fully Homomorphic Hybrid Encryption to Minimize Non-interactive Zero-Knowledge Proofs Craig Gentry, Jens Groth, Yuval Ishai, Chris Peikert, Amit Sahai, Adam Smith. Journal of Cryptology, 28(4):820-843. SPRING: Fast Pseudorandom Functions from Rounded Ring Products Abhishek Banerjee, Hai Brenner, Gaëtan Leurent, Chris Peikert, Alon Rosen. In FSE 2014. Practical Bootstrapping in Quasilinear Time [Slides] Jacob Alperin-Sheriff, Chris Peikert. In CRYPTO 2013. Invited to Journal of Cryptology. Hardness of SIS and LWE with Small Parameters Daniele Micciancio, Chris Peikert. In CRYPTO 2013. Invited to Journal of Cryptology. How to Share a Lattice Trapdoor: Threshold Protocols for Signatures and (H)IBE Rikke Bendlin, Sara Krehbiel, Chris Peikert. In ACNS 2013. On the Lattice Smoothing Parameter Problem Kai-Min Chung, Daniel Dadush, Feng-Hao Liu, Chris Peikert. In CCC 2013. Classical Hardness of Learning with Errors Zvika Brakersi, Adeline Langlois, Chris Peikert, Oded Regev, Damien Stehlé. In STOC 2013. A Toolkit for Ring-LW",
  "content_length": 14792,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:27"
}