{
  "name": "Christos Faloutsos",
  "homepage": "http://www.cs.cmu.edu/~christos",
  "status": "success",
  "content": "Christos Faloutsos [Publications/patents] [Software] [Talks/tutorials] [Courses] [Service] [Misc.] medium-res and high-res photo U.S. mail address: Christos Faloutsos Dept. of Computer Science , GHC 7003 Carnegie Mellon University 5000 Forbes Avenue Pittsburgh, PA 15213-3891 Admin: Oliver Moss email: christos-admin-support AT cs DOT cmu DOT edu If interested in grad studies, postdoc, summer internship, etc: Thank you for your interest! Please see this first. Christos Faloutsos Current Position: Fredkin Professor of Computer Science. Courtesy appointment: Electrical and Computer Engineering, CMU Academic Degrees: Ph.D. and M.Sc. (University of Toronto.); B.Sc. (Nat. Tech. U. Athens) Short bio and full CV in pdf; customized for funding agencies, 2-page versions . Up-to-date calendar: here Other affiliations: Database group at CMU Machine Learning Department PDL (Parallel Data Lab) Past affiliations: Informedia (1997-2007) Computational Biology Department(2003-2015) Research Interests: Data Mining for graphs and streams Fractals, self-similarity and power laws Indexing and data mining for video, biological and medical databases Data base performance evaluation (data placement, workload characterization) Projects Older Stream mining (SPIRIT) Graph Mining (NSF Grant No. IIS-0534205; additional support from IBM and PITA) Mining Biomedical and Network Data Using Tensors (NSF Grants No. IIS-0705359 and IIS-0705215). Drosophila embryo image mining (with Prof. Eric Xing) (NSF Grant No. DBI-0640543). Motion capture indexing and mining (with Profs. Jessica Hodgins, Nancy Pollard, Randy Pausch; and Amy Bruckman (GA Tech)) Robust Inter-Domain Routing with Prof. Michalis Faloutsos (UCR) - NSF Grant No. CNS-0721736. III-CXT-Large: Collaborative Research: Interactive and Intelligent searching of biological images by query and network navigation with learning capabilities NSF Grant No. IIS-0808661 Influence and Virus Propagation in Large Graphs NSF Grant No. IIS-1017415 Ongoing HCI:Small: Making Sense out of Large Graphs: Bridging HCI with Data Mining NSF Grant No. IIS-1217559 PEGASUS project for Peta-Scale graph mining. BIGDATA:Mid-Scale:DA:Collaborative research:Big Tensor Mining: Theory, Scalable Algorithms and Applications. NSF Grant No. IIS-1247489. TWC: Medium: Collaborative: Know Thy Enemy: Data Mining Meets Networks for Understanding Web-Based Malware Dissemination NSF Grant No. CNS-1314632. III: Medium: Collaborative Research: Collective Opinion Fraud Detection: Identifying and Integrating Cues from Language, Behavior, and Networks NSF Award No. IIS-1408924. In the news: Oct. 2004: Ranked among the top 50 nurturers in information technology by a study at the Indian Institute of Science. Nov. 2005: Mentioned in the Greek newspaper 'To Vima' (full article, in Greek ) Dec. 2005: Interview in the Dec. 2005 ACM SIGMOD record (Distinguished Database Profiles) Dec. 2006: CMU press release about the NetProbe project for auction fraud detection - joint work with Polo Chau, Shashank Pandit and Sam Wang. Also in Wall Street Journal, USA Today, Washington Post, Los Angeles Times, KDKA TV (CBS), INC.com Jan. 2009: (in Greek) Interview in the first student newsletter, (pp. 9-11) of the Athens University of Economics and Business. Also, coverage of NetProbe (pp. 12-13) . For more details, see the home page of the .mag newsletter. Oct. 2012: NSF press release 12-187 on BIG DATA grants Fall 2016: 'Fraudar' paper Detection of fake twitter followers, fake yelp reviews etc. Joint work with Bryan Hooi, Hyun Ah Song, Alex Beutel, Neil Shah, Kijung Shin. Announcement of KDD'16 best paper award ; CMU news (and local copy); YouTube . NSF news (and local copy) NPR/WESA Pittsburgh news (and local copy) Digital trends (and local copy) FossBytes (and local copy) upGruv (and local copy) TrendHunter (and local copy) May 2021: 'InfoShield' for Human Trafficking Detection. CMU news article and local copy WPXI article and local copy of video clip Oct. 2022: 'TrafficVis' visualization for Human Trafficking Detection. CMU news article and local copy Local news Pittsburgh and fracking: KDQA, Sept. 3: Large-Scale Marcellus Drilling May Be Coming To East Suburbs Of Allegheny Co. Information about fracking, from U.S. Government web sites New (March 2023): MetaPaper list of presentation suggestions MetaPaper a.k.a. 'Lessons learned from 1000 research paper rejections' is out - tar-file and presentation are here. [ Publications/patents ] [ Software] [ Talks/tutorials] [ Courses] [ Service] [ Misc.] Last updated: March 17, 2023, by Christos Faloutsos",
  "content_length": 4584,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:37"
}