{
  "name": "Christoph Koch 0001",
  "homepage": "https://people.epfl.ch/christoph.koch",
  "status": "success",
  "content": "Christoph Koch — People - EPFL Christoph Koch Edit profile Full Professor christoph.koch@epfl.ch +41 21 693 75 47 Publications My publications in Google ScholarMy publications in DBLPMy papers on EPFL's publications server (InfoScience)Prospective PhD students and postdocs please read this before contacting me. Full Professor, Data Analysis Theory and Applications Laboratory EPFL IC IINFCOM DATA BC 260 (Bâtiment BC) Station 14 1015 Lausanne +41 21 693 75 47 Office: BC 260 EPFL > IC > IINFCOM > DATA Web site: Web site: https://data.epfl.ch Member, EPFL Committee of Academic Evaluation EPFL > VPA > VPA-FAC > CEAE vCard Données administratives Fields of expertise knows everything ;-) Biography Christoph Koch is a professor of Computer Science at EPFL, specializing in data management. Until 2010, he was an Associate Professor in the Department of Computer Science at Cornell University. Previously to this, from 2005 to 2007, he was an Associate Professor of Computer Science at Saarland University. Earlier, he obtained his PhD in Artificial Intelligence from TU Vienna and CERN (2001), was a postdoctoral researcher at TU Vienna and the University of Edinburgh (2001-2003), and an assistant professor at TU Vienna (2003-2005). He obtained his Habilitation degree in 2004.  He has won Best Paper Awards at PODS 2002, ICALP 2005, SIGMOD 2011, VLDB 2014, and GPCE 2017, an Outrageous Ideas and Vision Paper Award at CIDR 2013, a Google Research Award (in 2009), and an ERC Grant (in 2011). He (co-)chaired the program committees of DBPL 2005, WebDB 2008, ICDE 2011, VLDB 2013, and PODS 2019, and was PC vice-chair of ICDE 2008 and ICDE 2009. He has served on the editorial board of ACM Transactions on Internet Technology and as Editor-in-Chief of PVLDB. Show more Awards 2002 : 21st ACM SIGMOD-SIGACT-SIGART Symposium on Principles of Database Systems (PODS) 2002 Best Paper Award : Georg Gottlob, Christoph Koch: \"Monadic Datalog and the Expressive Power of Languages for Web Information Extraction\" 2005 : 32nd International Colloquium on Automata, Languages and Programming (ICALP) 2005 Best Paper Award : Martin Grohe, Christoph Koch, Nicole Schweikardt: \"Tight Lower Bounds for Query Processing on Streaming and External Memory Data\" 2009 : Google Research Award : Category: Structured Data 2011 : ERC Grant : Foundations of Algebraic and Dynamic Data Management Systems 2011 : SIGMOD International Conference on Management of Data 2011 Best Paper Award : Nitin Gupta, Lucja Kot, Sudip Roy, Gabriel Bender, Johannes Gehrke, Christoph Koch: \"Entangled Queries: Enabling Declarative Data-Driven Coordination\" 2013 : Conference on Innovative Data Systems Research (CIDR) 2013 Outrageous Ideas and Vision Paper Award : Christoph Koch: \"Abstraction without regret in data management systems\" 2014 : 40th International Conference on Very Large Databases (VLDB) 2014 Best Paper Award : Yannis Klonatos, Christoph Koch, Tiark Rompf, Hassan Chafi: \"Building Efficient Query Engines in a High-Level Language\" 2017 : 16th International Conference on Generative Programming: Concepts & Experience (GPCE) 2017 Best Paper Award : Lionel Parreaux, Amir Shaikhha, Christoph Koch: \"Quoted Staged Rewriting: A Practical Approach to Library-Defined Optimizations\" 2019 : Member, Academia Europea : since 2021 : ACM SIGLOG/EATCS/EACSL/KGS Alonzo Church Award : \"For fundamental work on logic-based web data extraction and querying tree-structured data\" Research Alumni Dan Olteanu (Postdoc, Apr. 2005-June 2007). Now: Full Professor, Department of Computer Science, University of Zurich, Switzerland. Stefanie Scherzinger (PhD Saarland University, Jan. 2008). Now: Full Professor, University of Passau, Germany.Lyublena Antova (PhD Cornell University, Jan. 2010). Now: Research Scientist, Datometry, Inc., USALucja Kot (PhD Cornell University, Jan. 2010). Now: Grammatech, Inc., USAYanif Ahmad (Postdoc, Jan. 2009-July 2010). First employment: Assistant Professor, Department of Computer Science, Johns Hopkins University. Now: Senior Staff Software Engineer, Google, Inc., USAOliver Kennedy (PhD Cornell University, May 2011; Postdoc at EPFL until August 2012). Now: Associate Professor, Department of Computer Science and Engineering, SUNY Buffalo, USA. Immanuel Trummer (PhD EPFL, June 2016). Now: Assistant Professor, Department of Computer Science, Cornell University, USA. Milos Nikolic (PhD EPFL, Aug. 2016). Now: Lecturer, School of Informatics, University of Edinburgh, UK.Aleksandar Vitorovic (PhD EPFL, Nov. 2016). Now: Swisscom, Inc., Switzerland.Mohammed ElSeidy (PhD EPFL, Oct. 2017). Now: RelationalAI, Inc., Canada.Mohammad Dashti  (PhD EPFL, Oct. 2017). Now: Staff Engineer, MongoDB, Inc., USA.Yannis Klonatos (PhD EPFL, Jan. 2017). Now: Swisscom, Inc., Switzerland.Daniel Lupei (PhD EPFL, Oct. 2017). Now: Google, Inc., Switzerland.Amir Shaikhha (PhD EPFL, Aug. 2018). Now: Lecturer, School of Informatics, University of Edinburgh, UK.Lionel Parreaux (PhD EPFL, Nov. 2020). Now: Assistant Professor, Hong Kong University of Science and Technology, Hong Kong S.A.R.Bas Ketsman (Postdoc, Apr. 2018 - Sept. 2019). Now: Assistant Professor, Department of Computer Science, Vrije Universiteit Brussel, Belgium. Show more Teaching & PhD Teaching Computer Science Communication Systems PhD Students Jiang Zhekai, Lee Hanbit, Léchot Léonard, Past EPFL PhD Students Basil John Sachin , Dashti Rahmat Abadi Mohammad , El Seidy Mohamed Elsayed Mohamed Ahmed , Klonatos Ioannis , Lupei Daniel , Nikolic Milos , Parreaux Lionel Emile Vincent , Shaikhha Amir , Tian Zilu , Trummer Immanuel , Vitorovic Aleksandar , close All postal addresses and positions EPFL IC IINFCOM DATA Full Professor Status: Personnel EPFL IC IINFCOM DATA BC 260 (Bâtiment BC) Station 14 1015 Lausanne +41 21 693 75 47 Office: BC 260 EPFL > IC > IINFCOM > DATA EPFL IC IC-SIN SIN-ENS Full Professor Status: Personnel EPFL > IC > IC-SIN > SIN-ENS EPFL IC IC-SSC SSC-ENS Full Professor Status: Personnel EPFL > IC > IC-SSC > SSC-ENS EPFL VPA VPA-FAC CEAE Member Status: Personnel EPFL > VPA > VPA-FAC > CEAE",
  "content_length": 6077,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:04"
}