{
  "name": "Christina Brzuska",
  "homepage": "http://chrisbrzuska.de",
  "status": "success",
  "content": "Prof. Dr. Christopher Brzuska Christopher Brzuska Office: Room C210 (CS Building) Aalto University Postal Address: Aalto University, School of Science P. O. Box 15400 FIN-00076 AALTO Welcome to the homepage of Chris Brzuska. I am a faculty member of the departments computer science as well as mathematics and systems analysis at Aalto University in Finland. My research area is cryptography and its connections to related areas such as IT security, verification and complexity theory. Contact The best way to contact me is usually via eMail chris dot brzuska at aalto dot fi. You can also try to call me, but usually, the attempt to call me is less likely to be successful, since I am strictly offline during research activity, teaching interactions and other personal interactions. Cryptography at Aalto You can find more information about cryptography at Aalto here. Research Resources I maintain a list of research resources here. Queer Resources I maintain a list of queer resources here. Teaching In our cryptography courses, we often use the crypto companion. The writing is due to Valtteri Lipiäinen and myself, and it is inspired my numerous doctoral and master students, with very special thanks to Osama Abuzaid for developing and sharing his insights during his internship in 2019. Below, I list past and future courses. Winter Term 2025/26 (Teaching period I and II) Cryptography Winter Term 2025/26 (Teaching period I and II) Special Course: Advanced Cryptography (You can take this course in parallel with \"Cryptography\".) Winter Term 2025/26 (Teaching period II) Matrix Algebra Winter Term 2024/25 (Teaching period I and II) Cryptography Spring Term 2024 (Teaching period III and IV) Course Advanced Topics in Cryptography Winter Term 2023/24 (Teaching period II) Matrix Algebra Winter Term 2023/24 (Teaching period I and II) Course Cryptography *(co-taught by Russell W. Lai)* Spring Term 2023 (Teaching period III and IV) Course Advanced Topics in Cryptography This edition of the course was taught by Russell W. Lai and covered lattice-based cryptography. Winter Term 2022/23 (Teaching period I and II) Course Cryptography *(co-taught by Russell W. Lai)* Spring Term 2022 (Teaching period III and IV) Course Advanced Topics in Cryptography Winter Term 2021/22 (Teaching period I and II) Course Cryptography Spring Term 2021 (Teaching period III and IV) Course Advanced Topics in Cryptography Winter Term 2020/21 (Teaching period I and II) Course Cryptography Spring Term 2020 (Teaching period III and IV) Course Advanced Topics in Cryptography Winter Term 2019/20 (Teaching period I and II) Course Cryptography and Data Security *(co-taught by Kaisa Nyberg)* Spring Term 2019 (Teaching period III and IV) Course Advanced Topics in Cryptography Winter Term 2018/19 (Teaching period I and II) Course Cryptography and Data Security Winter Term 2017/18 Course Introduction to Security *(co-taught by Dieter Gollmann)* Summer Term 2017 Course Cryptography Seminar on Real-Life Security of Cryptography: TLS, AES & Elliptic Curves - Standards, Implementations and Attacks Winter Term 2016/17 Course Introduction to Security *(co-taught by Dieter Gollmann)* Seminar on Secure Messaging Seminar on SAT Algorithms Summer Term 2016 Course Cryptography Winter Term 2015/16 Course Introduction to Security Publications For full references, see DBLP. Journals Towards Fine-Grained One-Way Functions from Strong Average-Case Hardness C. Brzuska, G. Couteau Journal of Cryptology 2025 ePrint Relations among new CCA security notions for approximate FHE C. Brzuska, S. Canard, C. Fontaine, D. H. Phan, D. Pointcheval, M. Renaud, R. Sirdey CiC 2025 ePrint Falsifiability, Composability, and Comparability of Game-based Security Models for Key Exchange Protocols C. Brzuska, C. Cremers, H. Jacobsen, D. Stebila, W. Warinschi Celebrating the Life and Work of Ed Dawson, LNCS, Springer 2025 ePrint Simple Watermarking Pseudorandom Functions from Extractable Pseudorandom Generators E. Alpirez Bock, C. Brzuska, R. W. F. Lai CiC 2024 On Provable White-Box Security in the Strong Incompressibility Model E. Alpirez Bock, C. Brzuska, R. W. F. Lai TCHES 2023 ePrint On the Security Goals of White-Box Cryptography E. Alpirez Bock, A. Amadori, C. Brzuska, W. Michiels TCHES 2020 ePrint White-Box Cryptography: Don't Forget About Grey Box Attacks E. Alpirez Bock, J. W. Bos, C. Brzuska, C. Hubain, W. Michiels, C. Mune, E. Sanfelix Gonzalez, P. Teuwen, A. Treff Journal of Cryptology 2019 ePrint Arithmetic Cryptography B. Applebaum, J. Avron, C. Brzuska Journal of the ACM 2017 ECCC Less is More: Relaxed yet Composable Security Notions for Key Exchange C. Brzuska, M. Fischlin, N. P. Smart, B. Warinschi, S. C. Williams International Journal of Information Security 2013. Full Version Conferences Succinct PPRFs via Memory-Tight Reductions J. Alwen, C. Brzuska, G. Govinden, P. Harasser, S. Tessaro CRYPTO 2025 Camera-ready version Evasive LWE Assumptions: Definitions, Classes, and Counterexamples C. Brzuska, I. Woo, A. Ünal Asiacrypt 2024 ePrint On Bounded Storage Key Agreement and One-Way Functions C. Brzuska, G. Couteau, C. Egger, W. Quach TCC 2024 Instantiating the Hash-Then-Evaluate Paradigm: Strengthening PRFs, PCFs, and OPRFs C. Brzuska, G. Couteau, C. Egger, P. Karanko, P. Meyer SCN 2024 ePrint Breaking DPA-Protected Kyber via the Pair-Pointwise Multiplication E. Alpirez Bock, G. Banegas, C. Brzuska, L. Chmielewski, K. Puniamurthy, M. Sorf ACNS 2024 ePrint CryptoZoo: A Viewer for Cryptographic Reduction Proofs C. Brzuska, C. Egger, K. Puniamurthy ACNS 2024 ePrint A Adaptive Distributional Security for Garbling Schemes with O(|x|) online complexity E. Alpirez Bock, C. Brzuska, P. Karanko, S. Oechsner, K. Puniamurthy Asiacrypt 2023 ePrint A State-Separating Proof for Yao's Garbling Scheme C. Brzuska, S. Oechsner CSF 2023 ePrint Key-schedule Security for the TLS 1.3 Standard C. Brzuska, A. Delignat-Lavaud, C. Egger, C. Fournet, K. Kohbrok, M. Kohlweiss Asiacrypt 2022 ePrint (long version, 119 pages) short version (40 pages and contains everything except for reductions from modular to standard assumptions, very nice version :-)) 5-minutes talk by Chris on protocol insights 20-minutes talk by Christoph on the proof Towards Fine-Grained One-Way Functions from Strong Average-Case Hardness C. Brzuska, G. Couteau Eurocrypt 2022 ePrint Security Analysis of the MLS Key Derivation C. Brzuska, E. Cornelissen, K. Kohbrok Security and Privacy 2022. ePrint 1-minute talk by Chris 15-minutes talk by Eric On derandomizing Yao's Weak-to-Strong OWF Comstruction C. Brzuska, G. Couteau, P. Karanko, F. Rohrbach TCC 2021 ePrint Security Reductions for White-Box Key-Storage in Mobile Payments E. Alpirez Bock, C. Brzuska, M. Fischlin, C. Janson, W. Michiels ASIACRYPT 2020 ePrint Doubly half-injective PRGs for incompressible white-box cryptography E. Alpirez Bock, A. Amadori, J. W. Bos, C. Brzuska, W. Michiels CT-RSA 2019 ePrint State Separation for Code-Based Game-Playing Proofs C. Brzuska, A. Delignat-Lavaud, C. Fournet, K. Kohbrok, M. Kohlweiss ePrint (last updated on Dec 05, 2018) ASIACRYPT 2018 On the Ineffectiveness of Internal Encodings - Revisiting the DCA Attack on White-Box Cryptography E. Alpirez Bock, C. Brzuska, W. Michiels, A. Treff ePrint ACNS 2018 A Modular Security Analysis of EAP and IEEE 802.11 C. Brzuska, H. Jacobsen ePrint PKC 2017 On Statistically Secure Obfuscation with Approximate Correctness ePrint Z. Brakerski, C. Brzuska, N. Fleischhacker CRYPTO 2016 Downgrade Resilience in Key-Exchange Protocols ePrint K. Bhargavan, C. Brzuska, C. Fournet, M. Green, M. Kohlweiss, S. Zanella-Beguelin Security and Privacy 2016. Safely Exporting Keys from Secure Channels - On the Security of EAP-TLS and TLS Key Exporters C. Brzuska, H. Jacobsen, D. Stebila ePrint EUROCRYPT 2016. Random Oracle Uninstantiability from Indistinguishability Obfuscation ePrint C. Brzuska, P. Farshim, A. Mittelbach TCC 2015. On Basing Size-Verifiable One-Way Functions on NP-Hardness ECCC A. Bogdanov, C. Brzuska See also O. Goldreich's comments. TCC 2015. Arithmetic Cryptography B. Applebaum, J. Avron, C. Brzuska ECCC See also O. Goldreich's comments. ITCS 2015. Indistinguishability Obfuscation versus Multi-Bit Point Obfuscation with Auxiliary Input ePrint C. Brzuska, A. Mittelbach ASIACRYPT 2014. Using Indistinguishability Obfuscation via UCEs ePrint C. Brzuska, A. Mittelbach ASIACRYPT 2014. Indistinguishability Obfuscation and UCEs: The Case of Computationally Unpredictable Sources ePrint C. Brzuska, P. Farshim, A. Mittelbach CRYPTO 2014. Notions of Black-Box Reductions, Revisited Full Version P. Baecher, C. Brzuska, M. Fischlin ASIACRYPT 2013. Reset Indifferentiability and its Consequences Full Version P. Baecher, C. Brzuska, A. Mittelbach ASIACRYPT 2013. An Analysis of the EMV Channel Establishment Protocol Full Version C. Brzuska, N. P. Smart, B. Warinschi, G. J. Watson. CCS 2013. Efficient and Perfectly Unlinkable Sanitizable Signatures without Group Signatures C. Brzuska, H. C. Pöhls, K. Samelin EuroPKI 2013. Non-Interactive Public Accountability for Sanitizable Signatures C. Brzuska, H. C. Pöhls, K. Samelin EuroPKI 2012. TLS, PACE, and EAC:A Cryptographic View at Modern Key Exchange Protocols C. Brzuska, Ö. Dagdelen, M. Fischlin Sicherheit 2012. Composability of Bellare-Rogaway Key Exchange Protocols C. Brzuska, M. Fischlin, Bogdan Warinschi, S. C. Williams CCS 2011. Physically Uncloneable Functions in the Universal Composition Framework Full Version C. Brzuska, M. Fischlin, H. Schröder, S. Katzenbeisser CRYPTO 2011. Redactable Signatures for Tree-Structured Data: Definitions and Constructions C. Brzuska, H. Busch, Ö. Dagdelen, M. Fischlin, M. Franz, S. Katzenbeisser, M. Manulis, C. Onete, A. Peter, B. Poettering, D. Schröder ACNS 2010. Unlinkability of Sanitizable Signatures Full Version C. Brzuska, M. Fischlin, A. Lehmann, D. Schröder PKC 2010. Sanitizable Signatures: How to Partially Delegate Control for Authenticated Data C. Brzus",
  "content_length": 14849,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:29"
}