{
  "name": "Christoph Garth",
  "homepage": "https://vis.uni-kl.de/people/garth",
  "status": "success",
  "content": "Visualization & HCI Visualization & HCI Team Christoph Garth Prof. Dr. Christoph Garth Chair, Scientific Visualization Lab Office 36-226 (by appointment) Tel. +49 631 205-3800 Email garth@rptu.de Biography Christoph Garth is a full professor in the Department of Computer Science at the University of Kaiserslautern, Germany, and leads the Scientific Visualization Lab there. After studying Mathematics and Computer Science at the University of Kaiserslautern and obtaining a Ph.D. in Computer Science in 2007, Christoph was a postdoctoral researcher at the Institute for Data Analysis and Visualization at the University of California, Davis. Since 2011, he has been an assistant professor in Computer Science at the University of Kaiserslautern, and became a full professor in 2017. Christoph’s research agenda encompasses large-scale data analysis and visualization, in-situ visualization, topology-based methods in visualization, and interdisciplinary applications of visualization. His goal is to develop theoretical insights into relevant and practical visualization techniques. He has helped pioneer Lagrangian techniques in flow visualization and demonstrate their utility in in situ scenarios. Christoph has received an Award for Excellence in Postdoctoral Research, multiple best paper awards. Over the past ten years, he has been a frequent reviewer for leading international journals (IEEE TVCG, IEEE CG&A, Computer Graphics Forum, etc.) and conferences (IEEE Visualization, ACM Supercomputing, etc.). Christoph has served as general chair and paper chair of TopoInVis, and is a member of the TopoInVis workshop series steering committee. He currently serves as a co-chair for the IEEE Symposium on Large Data Analysis and Visualization. Research Interests Lagrangian and topological analysis of vector and tensor fields Visual exploration and analysis of large-scale data Parallel and scalable visualization algorithms Feature extraction in Computational Fluid Dynamics problems Topological methods in visualization Query-Driven Visualization Material interface reconstruction Scientific Visualization Computer Graphics Education 10 / 2007 Dr. rer. nat. (Ph. D.) in Computer Science (summa cum laude), Technische Universität Kaiserslautern 01 / 2003 Diplom (M. Sc.), Mathemathics & Computer Science, Technische Universität Kaiserslautern Professional Experience since 2017 Full Professor (W3) for Scientific Visualization, Technische Universität Kaiserslautern 2011-2017 Juniorprofessor (W1, tenure track) for Computational Topology, Technische Universität Kaiserslautern 2007–2011 Postdoctoral Researcher, Institute for Data Analysis and Visualization, University of California, Davis 2003–2007 Research Assistant, Department of Computer Science, Technische Universität Kaiserslautern Awards 2022 Test-of-Time Award (15 years), IEEE Scientific Visualization 2019 Best Paper, IEEE Symposium on Visualization for Cyber Security 2018 Best Paper, Eurographics Symposium on Parallel Graphics and Visualization 2018 Best Paper, IEEE Symposium on Large Data Analysis and Visualization 2017 Student's Teaching Award, Dept. of Computer Science, TU Kaiserslautern 2017 Best Paper, EuroVis – 20th EG/VGTC Conference on Visualization 2014 Best Paper, IEEE Symposium on Large Data Analysis and Visualization 2013 Best Paper, 2013 AIAA/AAS Astrodynamics Specialist Conference 2013 Best Paper, IEEE Scientific Visualization Conference 2013 Student's Teaching Award, Dept. of Computer Science, TU Kaiserslautern 2011 Cover Image Contest, Computer Graphics Forum 2010 Award for Excellence in Postdoctoral Research, University of California, Davis Publications 2025 F. Wetzels, H. Leitte, and C. Garth. Accelerating Computation of Stable Merge Tree Edit Distances Using Parameterized Heuristics. IEEE Transactions on Visualization and Computer Graphics, vol. 31, no. 6, pp. 3706–3718, 2025. 10.1109/TVCG.2025.3567120 @article{10988931, author = {Wetzels, Florian and Leitte, Heike and Garth, Christoph}, journal = {IEEE Transactions on Visualization and Computer Graphics}, title = {Accelerating Computation of Stable Merge Tree Edit Distances Using Parameterized Heuristics}, year = {2025}, volume = {31}, number = {6}, pages = {3706-3718}, keywords = {Runtime;Heuristic algorithms;Costs;Surveys;Polynomials;Visualization;Transforms;Stability criteria;Perturbation methods;Image edge detection;Scalar data;topological data analysis;merge trees;edit distance}, doi = {10.1109/TVCG.2025.3567120} } 2024 J. Lukasczyk, M. Will, F. Wetzels, G. H. Weber, and C. Garth. ExTreeM: Scalable Augmented Merge Tree Computation via Extremum Graphs. IEEE Transactions on Visualization and Computer Graphics, vol. 30, no. 1, pp. 1085–1094, 2024. 10.1109/TVCG.2023.3326526 @article{10290925, author = {Lukasczyk, Jonas and Will, Michael and Wetzels, Florian and Weber, Gunther H. and Garth, Christoph}, journal = {IEEE Transactions on Visualization and Computer Graphics}, title = {ExTreeM: Scalable Augmented Merge Tree Computation via Extremum Graphs}, year = {2024}, volume = {30}, number = {1}, pages = {1085-1094}, keywords = {Topology;Manifolds;Task analysis;Memory management;Data visualization;Classification algorithms;Data analysis;Scalar field topology;merge trees;persistence pairs;high performance computing}, doi = {10.1109/TVCG.2023.3326526} } F. Wetzels, T. B. Masood, N. H. List, I. Hotz, and C. Garth. Exploring Electron Density Evolution using Merge Tree Mappings. In EuroVis 2024 - Short Papers, 2024. 10.2312/evs.20241069 @inproceedings{10.2312:evs.20241069, booktitle = {EuroVis 2024 - Short Papers}, editor = {Tominski, Christian and Waldner, Manuela and Wang, Bei}, title = {{Exploring Electron Density Evolution using Merge Tree Mappings}}, author = {Wetzels, Florian and Masood, Talha Bin and List, Nanna Holmgaard and Hotz, Ingrid and Garth, Christoph}, year = {2024}, publisher = {The Eurographics Association}, isbn = {978-3-03868-251-6}, doi = {10.2312/evs.20241069} } F. Wetzels, M. Pont, J. Tierny, and C. Garth. Merge Tree Geodesics and Barycenters with Path Mappings. IEEE Transactions on Visualization and Computer Graphics, vol. 30, no. 1, pp. 1095–1105, 2024. 10.1109/TVCG.2023.3326601 @article{10296528, author = {Wetzels, Florian and Pont, Mathieu and Tierny, Julien and Garth, Christoph}, journal = {IEEE Transactions on Visualization and Computer Graphics}, title = {Merge Tree Geodesics and Barycenters with Path Mappings}, year = {2024}, volume = {30}, number = {1}, pages = {1095-1105}, keywords = {Time series analysis;Data visualization;Level measurement;Task analysis;Layout;Surveys;Interpolation;Topological data analysis;merge trees;scalar data;ensemble data}, doi = {10.1109/TVCG.2023.3326601} } 2023 R. G. C. Maack, J. Lukasczyk, J. Tierny, H. Hagen, R. Maciejewski, and C. Garth. Parallel Computation of Piecewise Linear Morse-Smale Segmentations. IEEE Transactions on Visualization and Computer Graphics, pp. 1–14, 2023. 10.1109/TVCG.2023.3261981 @article{10081444, author = {Maack, Robin G. C. and Lukasczyk, Jonas and Tierny, Julien and Hagen, Hans and Maciejewski, Ross and Garth, Christoph}, journal = {IEEE Transactions on Visualization and Computer Graphics}, title = {Parallel Computation of Piecewise Linear Morse-Smale Segmentations}, year = {2023}, volume = {}, number = {}, pages = {1-14}, doi = {10.1109/TVCG.2023.3261981} } J.-T. Sohns, C. Garth, and H. Leitte. Decision Boundary Visualization for Counterfactual Reasoning. Comput. Graph. Forum, vol. 42, no. 1, pp. 7–20, 2023. 10.1111/cgf.14650 @article{DBLP:journals/cgf/SohnsGL23, author = {Sohns, Jan{-}Tobias and Garth, Christoph and Leitte, Heike}, title = {Decision Boundary Visualization for Counterfactual Reasoning}, journal = {Comput. Graph. Forum}, volume = {42}, number = {1}, pages = {7--20}, year = {2023}, url = {https://doi.org/10.1111/cgf.14650}, doi = {10.1111/cgf.14650} } E. Nilsson, J. Lukasczyk, T. B. Masood, C. Garth, and I. Hotz. Probabilistic Gradient-Based Extrema Tracking. CoRR, vol. abs/2308.08956, 2023. 10.48550/arXiv.2308.08956 @article{DBLP:journals/corr/abs-2308-08956, author = {Nilsson, Emma and Lukasczyk, Jonas and Masood, Talha Bin and Garth, Christoph and Hotz, Ingrid}, title = {Probabilistic Gradient-Based Extrema Tracking}, journal = {CoRR}, volume = {abs/2308.08956}, year = {2023}, url = {https://doi.org/10.48550/arXiv.2308.08956}, doi = {10.48550/arXiv.2308.08956}, eprinttype = {arXiv}, eprint = {2308.08956} } E. Kinner, M. Glatt, J. C. Aurich, and C. Garth. Visual Analysis and Anomaly Detection of Material Flow in Manufacturing. In Proceedings of the 3rd Conference on Physical Modeling for Virtual Manufacturing Systems and Processes, Cham, 2023, pp. 281–293. @inproceedings{10.1007/978-3-031-35779-4_15, author = {Kinner, E. and Glatt, M. and Aurich, J. C. and Garth, C.}, editor = {Aurich, Jan C. and Garth, Christoph and Linke, Barbara S.}, title = {Visual Analysis and Anomaly Detection of Material Flow in Manufacturing}, booktitle = {Proceedings of the 3rd Conference on Physical Modeling for Virtual Manufacturing Systems and Processes}, year = {2023}, publisher = {Springer International Publishing}, address = {Cham}, pages = {281--293}, isbn = {978-3-031-35779-4} } Abstract: The automated tracking of objects in factories via real-time locating systems (RTLS) is gaining increased attention due to its improved availability, technical sophistication, and most of all, its plethora of applications. The tracking of workpieces through their production process, for example, unlocks a detailed understanding of timings, patterns, and bottlenecks. While research mostly focuses on technological advancements, the analysis of the generated data is often left unclear. We propose a visual analysis framework based on ultra-wide-band (UWB) RTLS tracking data of material flow for this purpose. With this, we present an analysis and define a practical approach for how factory-level data can be analyzed. Advanced algori",
  "content_length": 126601,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:04"
}