{
  "name": "Chris R. Johnson 0001",
  "homepage": "http://www.cs.utah.edu/~crj",
  "status": "success",
  "content": "Christopher Johnson Alternate Photos Christopher R. Johnson Faculty Member and Founding Director, Scientific Computing and Imaging Institute (SCI). Co-Director, Center for Integrative Biomedical Computing (CIBC). Distinguished Professor of Computer Science. Research Professor of Bioengineering. Adjunct Professor of Physics. History of the SCI Institute. Co-Editor, The Visualization Handbook (Description on Wikipedia). Chris Johnson is a faculty member within and founding director of the Scientific Computing and Imaging (SCI) Institute at the University of Utah where he is a Distinguished Professor of Computer Science and holds faculty appointments in the Departments of Physics and Bioengineering. His research interests are in the areas of scientific computing and scientific visualization. With Professor Rob MacLeod, Dr. Johnson founded the SCI research group in 1992, which has since grown to become the SCI Institute employing over 200 faculty, staff and students. Professor Johnson directed SCI until 2018. Professor Johnson serves on several international journal editorial boards, as well as on advisory boards to several national and international research centers. Professor Johnson was awarded a Young Investigator's (FIRST) Award from the NIH in 1992, the NSF National Young Investigator (NYI) Award in 1994, and the NSF Presidential Faculty Fellow (PFF) award from President Clinton in 1995. In 1996 he received a DOE Computational Science Award and in 1997 received the Par Excellence Award from the University of Utah Alumni Association and the Presidential Teaching Scholar Award. In 1999, Professor Johnson was Awarded the Governor's Medal for Science and Technology from Governor Michael Leavitt. In 2003 he received the Distinguished Professor Award from the University of Utah. In 2004 he was elected a Fellow of the American Institute for Medical and Biological Engineering, 2005 he was elected a Fellow of the American Association for the Advancement of Science, in 2009 he was elected a Fellow of the Society for Industrial and Applied Mathematics (SIAM) and received the Utah Cyber Pioneer Award. In 2010 Professor Johnson received the Rosenblatt Award from the University of Utah and the IEEE Visualization Career Award. In 2012 Professor Johnson received the IEEE CS Charles Babbage Award and in 2013 Professor Johnson received the IEEE Sidney Fernbach Award. In 2014, Professor Johnson was elected an IEEE Fellow and in 2019 he was inducted into the IEEE Visualization Academy. In 2020, Professor Johnson received the Leonardo Award. Courses I Teach: Scientific Computation - CS 3200 - Fall 2025 Visualization for Scientific Data - CS 6635 - Spring 2026 Computational Inverse Problems - CS 6962 Fall 2024 Decomposition Techniques for Data and Computational Science - CS 6962 - Fall 2023 Advanced Scientific Computing I - CS 6210 - Fall 2014 Advanced Methods in Scientific Computing II Current Areas of Research: Scientific Visualization Scientific Computing Image Analysis | Video and Image Gallery | Publications | Software | Collaborators and Funding Agencies | Quotes | Contact: Chris Johnson Scientific Computing and Imaging Institute Warnock Engineering Building 72 South Central Campus Drive., Room 4692 University of Utah Salt Lake City, Utah 84112-9205 Email: crj@sci.utah.edu Phone: (801) 587-7875 ( Deb Zemek , Assistant) Fax: (801) 585-6513",
  "content_length": 3386,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:46"
}