{
  "name": "Christos Xenofontas A. Dimitropoulos",
  "homepage": "http://www.inspire.edu.gr/~fontas",
  "status": "success",
  "content": "Xenofontas Dimitropoulos - Personal Website Xenofontas Dimitropoulos University of Crete & Foundation for Research and Technology - Hellas About Me Research Publications Teaching Contact & Meet Me Download CV INSPIRE Group - Xenofontas Dimitropoulos INSPIRE Group University of Crete FORTH-ICS / TNL Lab Bio Xenofontas Dimitropoulos is an Associate Professor at the University of Crete and Affiliated Researcher to the Foundation for Research and Technology Hellas (FORTH), where he leads the Internet Security, Privacy, and Intelligence Research (INSPIRE) Group. He received a PhD degree from the Georgia Institute of Technology. His research focuses on software defined networks and Internet measurements. He has received grants from the European Research Council, the Marie Skłodowska-Curie action, and the Fulbright Institute. He has served in the organizing committee of ACM SIGCOMM and has won two best paper awards. Academic Positions Present 2019 Associate Professor University of Crete (UoC), Computer Science Department, Heraklion, Greece 2019 2014 Assistant Professor University of Crete (UoC), Computer Science Department, Heraklion, Greece Present 2014 Affiliated Researcher and Group Leader Foundation for Research and Technology – Hellas (FORTH), Institute of Computer Science, Heraklion, Greece 2015 2014 Academic Visitor ETH Zürich, Zürich, Switzerland 2013 2008 Senior Researcher and Lecturer ETH Zürich, Zürich, Switzerland 2011 2008 Lecturer Open University of Cyprus (OUC), Nicosia, Cyprus Education & Training Ph.D. 2002 – 2006 PhD, Electrical and Computer Engineering Georgia Institute of Technology, Atlanta M.Sc.2001 - 2002 MSc, Electrical and Computer Engineering Georgia Institute of Technology, Atlanta B.S.1997 – 2001 BS, Physics Aristotle University of Thessaloniki, Greece. Honors, Awards and Grants Research Summary My research has focused on Internet routing, software defined networks, Internet topology, network monitoring, network security, privacy, and network simulation. I use network measurements, like routing data and traffic traces, to understand how complex systems work in practice, which then helps drive my research to building prudent solutions that address key deficiencies. I try to distill complex real-world problems into clear formulations and to investigate suitable solutions leveraging when possible on established theory, like data mining and graph theory. In addition, my research often involves designing and building a system. Finally, I consider important and I try to make software as well as useful measurement data available to the community. Interests Internet Routing Software Defined Networks Network Security & Privacy Internet Measurements Network Management Research Projects Selected Publications Filter by type: All types Conference Long Papers Conference Short Papers Journal Papers Patents Sort by year: Teaching Currrent Teaching Teaching History Contact & Meet Me office: (+30) 2810 3913 87 fontas (at) ics.forth.gr #fontasnet XenofontasDimitropoulos At Foundation for Research and Technology - Hellas You can find me in FORTH typically in the days without teaching duties at the University of Crete. My office is Γ172 in the Telecommunications and Networks Laboratory (TNL) of the Institute of Computer Science (ICS) of FORTH. The office is in the main building of the campus. Institute of Computer Science, Telecommunications and Networks Laboratory, Leoforos Plastira 100, GR-700 13 Heraklion, Crete, Greece. At University of Crete You can find me in my office in the University of Crete the days I am teaching. My office is B317 in the 3rd floor of the Computer Science Department of the University of Crete. University of Crete, Department of Computer Science. Office B-317, Heraklion Voutes Campus GR-700 13 Heraklion, Crete, Greece.",
  "content_length": 3819,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:46"
}