{
  "name": "Christian Wagner 0002",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/christian.wagner",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Christian WagnerProfessor of Computer Science, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsPublications Contact workRoom B32 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKwork0115 74 84023Christian.Wagner@nottingham.ac.ukhttp://christian.lucidresearch.org BiographyChristian Wagner completed his BSc in Computer Science and MSc in Robotics and Embedded Systems at the University of Essex, UK in 2004 and 2005 respectively, before being awarded his PhD in Computer Science in 2009. He has been a visiting professor at the Institute of Computing and Cybersystems at Michigan Tech, and the Department of Social and Decision Sciences, Carnegie Mellon University, USA. Christian is currently a Professor of Computer Science at the University of Nottingham, UK, co-lead of the Intelligent Modelling and Analysis (IMA) group, and founding director of the Lab for Uncertainty in Data and Decision Making (LUCID). His research focuses on modelling & handling of uncertain data arising from heterogeneous data sources including domain experts and other stakeholders, with a particular emphasis on designing interpretable and interactive AI based decision support systems. In 2017, he was recognised as a RISE (Recognising Inspirational Scientists and Engineers) Connector by the UK Engineering and Physical Sciences Research Council. Much of his work straddles disciplines from social science to Psychology, with applications of his work ranging from decision support in cyber security and environmental management to product design and control in manufacturing. Together with his team, he has developed multiple open source software frameworks, making research accessible both to peer researchers as well as to different research communities beyond computer science. Christian is an Associate Editor of the IEEE Transactions on Artificial Intelligence, elected member-at-large of the IEEE Computational Intelligence Society (CIS)'s board of directors (AdCom), Vice President for Technical Activities of IEEE CIS 2024-2025, and IEEE CIS climate lead. He was General Co-Chair of the international Fuzz-IEEE 2021 conference in Luxembourg (held virtually due to COVID) and has previously served as Vice-Chair of the IEEE CIS Task Forces on Cyber Security and Affective Computing; as chair in a variety of conferences and conference program committees including WCCI, IJCAI, and AAAI.Recent Publications FU C, SARABAKHA A, KAYACAN E, WAGNER C, JOHN R and GARIBALDI J, 2018. Input Uncertainty Sensitivity Enhanced Non-Singleton Fuzzy Logic Controllers for Long-Term Navigation of Quadrotor UAVs IEEE/ASME Transactions on Mechatronics. (In Press.)FU, CHANGHONG, SARABAKHA, ANDRIY, KAYACAN, ERDAL, WAGNER, CHRISTIAN, JOHN, ROBERT and GARIBALDI, JONATHAN M, 2017. Similarity-based non-singleton fuzzy logic control for improved performance in UAVs In: Fuzzy Systems (FUZZ-IEEE), 2017 IEEE International Conference on. 1-6HAVENS, TIMOTHY C, WAGNER, CHRISTIAN and ANDERSON, DEREK T, 2017. Efficient modeling and representation of agreement in interval-valued data In: Fuzzy Systems (FUZZ-IEEE), 2017 IEEE International Conference on. 1-6MADI, ELISSA NADIA, GARIBALDI, JONATHAN M and WAGNER, CHRISTIAN, 2017. Exploring the use of type-2 fuzzy sets in multi-criteria decision making based on TOPSIS In: Fuzzy Systems (FUZZ-IEEE), 2017 IEEE International Conference on. 1-6 View all publications FU C, SARABAKHA A, KAYACAN E, WAGNER C, JOHN R and GARIBALDI J, 2018. Input Uncertainty Sensitivity Enhanced Non-Singleton Fuzzy Logic Controllers for Long-Term Navigation of Quadrotor UAVs IEEE/ASME Transactions on Mechatronics. (In Press.)FU, CHANGHONG, SARABAKHA, ANDRIY, KAYACAN, ERDAL, WAGNER, CHRISTIAN, JOHN, ROBERT and GARIBALDI, JONATHAN M, 2017. Similarity-based non-singleton fuzzy logic control for improved performance in UAVs In: Fuzzy Systems (FUZZ-IEEE), 2017 IEEE International Conference on. 1-6HAVENS, TIMOTHY C, WAGNER, CHRISTIAN and ANDERSON, DEREK T, 2017. Efficient modeling and representation of agreement in interval-valued data In: Fuzzy Systems (FUZZ-IEEE), 2017 IEEE International Conference on. 1-6MADI, ELISSA NADIA, GARIBALDI, JONATHAN M and WAGNER, CHRISTIAN, 2017. Exploring the use of type-2 fuzzy sets in multi-criteria decision making based on TOPSIS In: Fuzzy Systems (FUZZ-IEEE), 2017 IEEE International Conference on. 1-6WAGNER, CHRISTIAN, HAVENS, TIMOTHY C and ANDERSON, DEREK T, 2017. The arithmetic recursive average as an instance of the recursive weighted power mean In: Fuzzy Systems (FUZZ-IEEE), 2017 IEEE International Conference on. ISAEV, SVETLIN, JREISSAT, MOHANNAD, MAKATSORIS, CHARALAMPOS, BACHOUR, KHALED, MCCULLOCH, JOSIE and WAGNER, CHRISTIAN, 2017. Interval-valued sensory evaluation for customized beverage product formulation and continuous manufacturing In: Fuzzy Systems (FUZZ-IEEE), 2017 IEEE International Conference on. 1-6FU, CHANGHONG, SARABAKHA, ANDRIY, KAYACAN, ERDAL, WAGNER, CHRISTIAN, JOHN, ROBERT and GARIBALDI, JONATHAN M, 2017. Novel, similarity-based non-singleton fuzzy logic control for improved uncertainty handling in quadrotor UAVs In: Fuzzy Systems (FUZZ-IEEE), 2017 IEEE International Conference on. RAZAK, TR, GARIBALDI, JONATHAN M, WAGNER, CHRISTIAN, POURABDOLLAH, AMIR and SORIA, DANIELE, 2017. Interpretability indices for hierarchical fuzzy systems In: Fuzzy Systems (FUZZ-IEEE), 2017 IEEE International Conference on. A. POURABDOLLAH, C. WAGNER, J. ALADI and J. GARIBALDI, 2016. Improved Uncertainty Capture for Non-Singleton Fuzzy Systems IEEE Transactions on Fuzzy Systems. 24(6), 1513-1524JAVIER NAVARRO, CHRISTIAN WAGNER, UWE AICKELIN, L GREEN L and R ASHFORD, 2016. Measuring agreement on linguistic expressions in medical treatment scenarios In: 2016 IEEE Symposium Series on Computational Intelligence (SSCI). 1-8WAGNER, CHRISTIAN, POURABDOLLAH, AMIR, MCCULLOCH, JOSIE, JOHN, ROBERT and GARIBALDI, JONATHAN M, 2016. A similarity-based inference engine for non-singleton fuzzy logic systems In: Fuzzy Systems (FUZZ-IEEE), 2016 IEEE International Conference on. 316-323MCCULLOCH, JOSIE and WAGNER, CHRISTIAN, 2016. Measuring the similarity between zSlices general type-2 fuzzy sets with non-normal secondary membership functions In: Fuzzy Systems (FUZZ-IEEE), 2016 IEEE International Conference on. 461-468MILLER, SIMON, WAGNER, CHRISTIAN and GARIBALDI, JONATHAN, 2016. Applications of Computational Intelligence to Decision-Making: Modeling Human Reasoning/Agreement. In: HANDBOOK ON COMPUTATIONAL INTELLIGENCE: Volume 2: Evolutionary Computation, Hybrid Systems, and Applications 775-800WALLACE, KEN J, WAGNER, CHRISTIAN and SMITH, MICHAEL J, 2016. Eliciting human values for conservation planning and decisions: a global issue Journal of environmental management. 170, 160-168BILGIN, AYSENUR, HAGRAS, HANI and WAGNER, CHRISTIAN, 2016. Novel Approaches to Artefact Adaptation in Ambient Intelligent Environments. In: Next Generation Intelligent Environments Springer International Publishing. 165-219AGRAWAL, UTKARSH, SORIA, DANIELE and WAGNER, CHRISTIAN, 2016. Cancer subtype identification pipeline: A classifusion approach In: Evolutionary Computation (CEC), 2016 IEEE Congress on. 2858-2865MADI, ELISSA NADIA, GARIBALDI, JONATHAN M and WAGNER, CHRISTIAN, 2016. An exploration of issues and limitations in current methods of TOPSIS and fuzzy TOPSIS In: Fuzzy Systems (FUZZ-IEEE), 2016 IEEE International Conference on. 2098-2105ISAEV, SVETLIN, MAKATSORIS, CHRALAMPOS, JRESSIAT, MOHANNAD and WAGNER, CHRISTIAN, 2016. Linking human and machine-towards consumer-driven automated manufacturing In: Fuzzy Systems (FUZZ-IEEE), 2016 IEEE International Conference on. 1789-1796ALADI, JABRAN HUSSAIN, WAGNER, CHRISTIAN, POURABDOLLAH, AMIR and GARIBALDI, JONATHAN M, 2016. Contrasting singleton type-1 and interval type-2 non-singleton type-1 fuzzy logic systems In: Fuzzy Systems (FUZZ-IEEE), 2016 IEEE International Conference on. 2043-2050MARCHAL, P CANO, WAGNER, CHRISTIAN, GARCIA, J GAMEZ and ORTEGA, J GOMEZ, 2016. Modelling uncertainty in production processes using non-singleton fuzzification and fuzzy cognitive maps-a virgin olive oil case study In: Fuzzy Systems (FUZZ-IEEE), 2016 IEEE International Conference on. 1173-1180NAVARRO, JAVIER, WAGNER, CHRISTIAN, AICKELIN, UWE, GREEN, LYNSEY and ASHFORD, ROBERT, 2016. Measuring agreement on linguistic expressions in medical treatment scenarios In: Computational Intelligence (SSCI), 2016 IEEE Symposium Series on. 1-8HIBSHI, HANAN, BREAUX, TRAVIS D and WAGNER, CHRISTIAN, 2016. Improving security requirements adequacy In: Computational Intelligence (SSCI), 2016 IEEE Symposium Series on. 1-8FU, CHANGHONG, SARABAKHA, ANDRIY, KAYACAN, ERDAL, WAGNER, CHRISTIAN, JOHN, ROBERT and GARIBALDI, JONATHAN M, 2016. A comparative study on the control of quadcopter UAVs by using singleton and non-singleton fuzzy logic controllers In: Fuzzy Systems (FUZZ-IEEE), 2016 IEEE International Conference on. 1023-1030T. C. HAVENS, D. T. ANDERSON and C. WAGNER, 2015. Data-Informed Fuzzy Measures for Fuzzy Integration of Intervals and Fuzzy Numbers IEEE Transactions on Fuzzy Systems. 23(5), 1861-1875C. WAGNER, S. MILLER, J. M. GARIBALDI, D. T. ANDERSON and T. C. HAVENS, 2015. From Interval-Valued Data to General Type-2 Fuzzy Sets IEEE Transactions on Fuzzy Systems. 23(2), 248-269PRICE, STANTON R, ANDERSON, DEREK T, WAGNER, CHRISTIAN, HAVENS, TIMOTHY C and KELLER, JAMES M, 2014. Indices for Introspection on the Choquet Integral. In: Advance Trends in Soft Computing Springer International Publishing. 261-271POURABDOLLAH, AMIR, WAGNER, C",
  "content_length": 21610,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:23"
}