{
  "name": "Christopher Batty",
  "homepage": "https://cs.uwaterloo.ca/~c2batty",
  "status": "success",
  "content": "Christopher Batty Christopher Batty Associate Professor Scientific Computation Group and Computer Graphics Lab David R. Cheriton School of Computer Science, University of Waterloo E-mail: christopher.batty@uwaterloo.ca Office: 3605 Davis Centre (DC3605) Brief Bio Google Scholar DBLP Mastodon Consider joining the Computational Motion Group at Waterloo! I plan to accept new students to start in September 2026 -- the application deadline is December 1, 2025. As of Sept, 2025, CSRankings currently puts UWaterloo at #8 for Computer Graphics in North America over the last 6 years (2020-2025), if you're into that kind of thing; we're also a friendly group of people doing exciting research! News: PhD student Joel Wretborn's best paper-winning Eurographics 2025 paper on immersed bubble simulation was highlighted by the popular YouTube series \"Two Minute Papers\". Hold onto your papers, and go check it out! (October 30, 2025) Check out our latest paper with collaborator Tetsuya Takahashi on inverse design of equilibrium elastic rod shapes in IEEE TVCG. (October 16, 2025) Similarly huge congratulations to PhD student Ryusuke Sugimoto who successfully defended his PhD dissertation, \"Toward General-Purpose Monte Carlo PDE Solvers for Graphics Applications\". His work explored the Walk-On-Boundary method, as a ray-tracing-like alternative Monte Carlo to Walk-On-Spheres/-Stars, for solving various boundary value problems, as well as applications of Monte Carlo techniques to fluid solvers and surfaces PDEs. (Sept 17, 2025) Huge congratulations to PhD student Nathan King who successfully defended his PhD dissertation, Closest Point Geometry Processing: Extensions and Applications of the Closest Point Method for Geometric Problems in Computer Graphics\". CPM is a powerful method to easily solve a wide range of PDEs on surfaces by embedding the problem into a Cartesian grid; Nathan's thesis generalized and extended CPM in several useful directions. If you are CPM-curious, drop Nathan a line, check out his upcoming presentation at SIGGRAPH North America 2025, and/or check out his CPM codebase. (May 16, 2025) Joel Wretborn's bubble simulation paper at Eurographics received the Günter Enderle Award for Best Paper! Way to go Joel! (May 16, 2025) Animations: A small sampling of animations generated through our past research. Chocolate Bunny Octree Viscosity Paint Brush Splash Water on Cloth Coiling Honey Fluid Chains Milk Crown Splash Detailed Splash Soap Bubbles Melting Penguins Multimaterial Bunnies Colliding Droplets Curvature Flow Chocolate Enrobing Research: My lab, the Computational Motion Group, studies Physics-Based Animation, which integrates computer graphics and computational physics to address applications in visual computing, especially visual effects, animated films, and game development. We often focus on the simulation of liquids and gases, but have broad interests in physical simulation as a tool for generating, controlling, and predicting motion of all kinds. We strive to design algorithms that are supported by sound physical, mathematical, and geometric principles, while being amenable to efficient and robust practical implementation. Topics we have explored include... interactions between fluids and diverse dynamic objects (e.g., hair, cloth, elastic bodies, rigid bodies) viscous flows, non-Newtonian liquids, and granular flows which exhibit intriguing behaviours like buckling, coiling, bouncing, and friction effects. surface tension-driven phenomena, including small-scale liquid droplets, bubbles, films, and foams dynamic surface representations for evolving multimaterial flows and geometries (e.g., level set methods, triangle meshes, particles) solving PDEs using Monte Carlo techniques, boundary element methods, and spatially adaptive finite volume schemes (e.g., tetrahedral meshes, octrees). embedded methods for boundary conditions (cut-cell techniques, the closest point method) that enable solving PDEs in complex domains or on complex shapes The computer animation and visual effects industries inspire much of our work. My students and I have worked with SideFX Software and Wētā Digital, among other companies. Ideas and techniques we originally developed have made their way into major fluid animation software packages such as SideFX's Houdini (FLIP Fluid solver), Blender (3rd party FlipFluids Addon), JangaFX's LiquiGen, and Autodesk Maya (Bifröst Fluids), and thus have contributed to dozens of movies from major studios. I maintain the Physics-Based Animation blog, which catalogues papers, people, and software in this area. I maintain a list of computer graphics academics and researchers on Mastodon. Consider ditching corporate social media and joining us there instead. :-) I have collected a few links to pieces of advice for students. I wrote a little piece arguing that we (SIGGRAPH PC members) should try to write better SIGGRAPH review summaries for authors. I have occasionally been interviewed about the role of physics simulation in visual effects and computer animation. e.g., by the American Physical Society and Vice / Motherboard. Team: The Computational Motion Group is composed of myself and a team of skilled and dedicated graduate and undergraduate students. (Join us!) Leo Hanxu (CS PhD program) Joel Wretborn (CS PhD program) Liang Cui (CS MMath program) Brooke Dolny (CS MMath program) Rikin Gurditta (CS MMath program) Publications: Journal/conference papers: Optimizing Parameters for Static Equilibrium of Discrete Elastic Rods with Active-Set Cholesky T. Takahashi & C. Batty. IEEE Transactions on Visualization and Computer Graphics. A new augmented Lagrangian-based approach to inverse design of elastic rod shapes that simultaneously optimizes rest shape and material parameters while satisfying box constraints on those parameters. [Project] [Journal] [Paper (PDF)] [Supplementary Document (PDF)] [Video (210 MB)] [Compressed Video (91 MB)] [YouTube] A unified multi-scale method for simulating immersed bubbles J. Wretborn, A. Stomakhin, & C. Batty. Eurographics 2025 (Computer Graphics Forum). A unified, hybrid particle/grid mixture-theory based model for simulating underwater bubbles with surface tension effects across a wide range of scales. Winner of the Eurographics Günter Enderle Best Paper Award! [Paper (PDF, 20MB)] [Journal] [Project] [Two Minute Papers episode] [Video (TBA)] Rest Shape Optimization for Sag-Free Discrete Elastic Rods T. Takahashi & C. Batty. Eurographics 2025 (Computer Graphics Forum). An effective strategy based on minimizing kinetic energy to solve for rest shape parameters of the Discrete Elastic Rod model, in order to achieve a prescribed rest shape under gravity. [Project] [Journal] [Paper (PDF, 50MB)] [Video (221 MB)] [YouTube] Projected Walk on Spheres: A Monte Carlo Closest Point Method for Surface PDEs R. Sugimoto, N. King, T. Hachisuka, & C. Batty. ACM SIGGRAPH Asia 2024. A Monte Carlo technique for solving various PDEs on general surfaces, by combining closest point projections (à la the Closest Point Method) with the Monte Carlo Walk on Spheres algorithm for volumetric PDEs. [Project] [Paper (PDF, 16MB)] [Supplemental (PDF, 400K)] [Houdini code (87MB)] A Closest Point Method for PDEs on Manifolds with Interior Boundary Conditions for Geometry Processing N King, H. Su, M. Aanjaneya, S. Ruuth, & C. Batty. ACM Transactions on Graphics, 43(5), 2025. A method to solve PDEs on surfaces or curves with interior boundary curves or points, given a blackbox closest point function for the surface (e.g., point cloud, mesh, distance field, parametric surface, etc.) We demonstrate diffusion curves, tangent vector fields, harmonic maps, geodesic distances, and more. [Project] [Paper (PDF, 11MB)] [Journal] Reach for the Arcs: Reconstructing Surfaces from SDFs via Tangent Points S. Sellán, Y. Ren, C. Batty, & O. Stein. ACM SIGGRAPH North America 2024. We accurately reconstruct triangle meshes from discrete signed distance field (SDF) data having arbitrary genus, even in strongly under-resolved scenarios. Our approach predicts and refines the surface tangent point that generates each SDF sample, by exploiting a connection to oriented point clouds. [Project] [Paper (PDF, 19MB)] Velocity-based Monte Carlo Fluids R. Sugimoto, C. Batty, & T. Hachisuka. ACM SIGGRAPH North America 2024. We show how a velocity-based smoke simulator can be implemented using Monte Carlo techniques, in contrast to our earlier vorticity-based MC fluid solver. [Project] [Paper (PDF, 15MB)] [Video (MP4, 11MB)] [YouTube] The Impulse Particle-In-Cell Method S. Sancho, J. Tang, C. Batty, & V. Azevedo. Eurographics 2024 (Computer Graphics Forum). A new fluid animation scheme that adapts ideas from covector fluids and impulse methods to particle-in-cell methods to better preserve vorticity, along with a useful heuristic to improve stability. Winner of an Honorable Mention for the Günter Enderle Best Paper Award! [Project] [Paper (PDF, 37MB)] [Video (MP4, 40MB)] [YouTube] A Primal-Dual Box-Constrained QP Pressure Poisson Solver with Topology-Aware Geometry-Inspired Aggregation AMG T. Takahashi & C. Batty. IEEE Transactions on Visualization and Computer Graphics. A fast solver for box-constrained convex quadratic programs (e.g., for liquids with wall-separating boundary behavior), that employs an interior point method with barrier-based constraint enforcement and a topology-aware aggregation algebraic multigrid preconditioner for inner solves. [Project] [Paper (PDF, 25MB)] [Supplemental Document (PDF)] [Video (MP4, 114MB)] Reach for the Spheres: Tangency-Aware Surface Reconstruction of SDFs S. Sellán, C. Batty, & O. Stein. ACM SIGGRAPH Asia 2023. An improved algorithm for isosurfacing of discrete signed distance fields (SDFs) that explicitly interprets each sample point as a sphere to which the surface must lie tangent. Especially at low grid resolutions, it can recover significantly more detail than marching cubes and Neural Dual",
  "content_length": 38819,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:08"
}