{
  "name": "Christos Anagnostopoulos 0001",
  "homepage": "http://www.gla.ac.uk/schools/computing/staff/christosanagnostopoulos",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Dr Christos Anagnostopoulos Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffDr Christos AnagnostopoulosSelected Publications Dr Christos Anagnostopoulos Reader (Computing Science) telephone: 01413307252 email: Christos.Anagnostopoulos@glasgow.ac.uk pronouns: He/him/his Office S114, School of Computing Science, Sir Alwyn Williams Building, University of Glasgow, G12 8QQ Import to contacts https://orcid.org/0000-0003-1517-6757 Biography I am an Associate Professor (Reader) in Distributed Computing & Data Engineering Systems at the School of Computing Science, University of Glasgow. My research expertise lies at the intersection of large-scale distributed computing, distributed AI/ML, and data-centric AI. I have secured research funding from the European Commission (H2020, Horizon Europe), UK EPSRC, and industry partners including BMW. I am an author of over 200 scientific publications in journals and conferences [Google scholar]. I lead the Knowledge and Data Engineering Systems Group and serve as Editor-in-Chief of Open Computer Science (De Gruyter) as well as Associate Editor of IEEE Access. I have served as the General Chair of IEEE ICDCS 2025. Currently, I am the Principal Investigator and Technical Coordinator of multiple EU Horizon projects including INNOVATE, TRACE, COIN-3D, ELLIE, and TERRA. I am an Associate Fellow of the Higher Education Academy and a professional member of ACM, IEEE, IEEE TCDP, and IEEE STC. Prior to joining Glasgow, I held faculty positions as Assistant Professor (Lecturer) at Ionian University and the University of Athens. From 2015 to 2018, I held a Research Fellowship at University of Glasgow. I had been a MSCA Fellowship Supervisor in University of Glasgow from 2018 to 2020, focusing on large-scale machine learning systems. I hold a BSc (Hons, Valedictorian) in Computer Science & Telecommunications, an MSc (Distinction) in Advanced Computing Systems, and a PhD in Computing Science from the University of Athens (2008). For more information, please visit the Knowledge and Data Engineering Systems Group (KDES) page. Research interests Research Statement My interests and contributions are at the intersection of large-scale distributed computing, distributed AI/ML, and data-centric AI (KDES Group). Throughout my career, I have been conducting research in Distributed Computing for Machine Learning, Federated Learning, in-network Data Management, on-line Stochastic Optimization, and Decentralized Predictive Analytics. Currently, I have established theorerical and analytical models & algorithms for distributed ML/AI. I have published extensively in top journals (including IEEE TNNLS, ACM TKDD, ACM TIST, ACM TOIT, ACM TOSN, ACM Comput. Surv., IEEE TMC, IEEE TKDE) and conferences in the above areas (including NeurIPS, ECAI, KDD, ICDE, ICDCS, ICDM, ECML/PKDD, ECAI, ACML, BigData). I am an associate fellow of the HEA, member of ACM and IEEE member of IEEE Special Technical Community (Smart and Circular Cities) and IEEE Technical Community of Distributed Processing (TCDP). I am Editor in Chief of the Open Computer Science (De Gruyter) and Associate Editor of IEEE Access. I serve as the General Chair of the IEEE ICDCS 2025. Google Scholar: [citations]; DBLP [link]; ORCID [link]; ResearchGate [link] Research Group KDES Group: Knowledge & Data Engineering Systems. Funded Projects [*] EU Horizon: An Intelligent platform for integrating climate services (TERRA); 2025-2028, PI: Dr C Anagnostopoulos, Co-Is: Dr Z Gao, Dr M Hurst According to Water Europe statistics, 90% of the global economy and 75% of jobs depend on water, while water-related risks are among the top 5 risks. Τhe term “water” includes both drinkable water (with respect to pollution) and hydrology water modelling (with respect to floods and sea level rise). As a result, the significance of modelling techniques, especially regarding water pollution, coastline management, flood prediction and sea level rise assessment cannot be overstated. TERRA envisions the creation of services and product chains that fuse Copernicus services with Digital Twins and AI technologies to provide solutions for coastline detection, coastline erosion prediction, flood risk assessment and mitigation, water pollution assessment and coastline modelling. TERRA provides the framework to promote its outcomes through the Global Earth Observation System of Systems (GEOSS). [*] EU Horizon: On the use of Internet of Senses for the Cultural Heritage (ELLIE); 2025-2028, PI: Dr C Anagnostopoulos. ELLIE research examines the impact of emerging technologies on creative processes, particularly in terms of technological advancements and innovation. Artificial Intelligence (AI), Generative AI, Internet of Senses and Digital Twins (DTs) are key technologies frequently explored in this context. ELLIE leverages these technologies within a virtual immersive world creating an innovative platform that opens up opportunities for novel services in the Cultural and Creative Industries (CCIs) domain. [*] EU Horizon: Collaborative Innovation in 3D VLSI Reliability (COIN-3D); 2024-2027. PI: Dr C Anagnostopoulos. COIN-3D fosters strategic networking and knowledge exchange between leading European research institutions to enhance research management and commercialization capacities in the area of 2.5/3D chiplet architectures. The main target of the COIN-3D project is to enhance the AI research capacity of an entity being active in a widening country with the assistance of more developed countries trying to expose the pathways for innovation and research excellence. [*] EU Horizon: Integration and Harmonization of Logistics Operations (TRACE); 2023-2026. PI: Dr C Anagnostopoulos TRACE targets to an AI-driven universal platform related to planning, scheduling, optimization and events management as well as the use of blockchain technology to facilitate the real time conclusion of smart contracts and financial operations, thus, becoming one of the first attempts to provide an ‘intelligent cover’ upon the current logistics frameworks. TRACE will perform studies related to the barriers towards the new logistics era, the new business opportunities, the requirements for the legislation and regulatory frameworks and expose the benefits of the proposed approach in terms of the reduction for energy demand and emissions while limiting the operational costs for logistics stakeholders. [*] EU H2020 Marie Skłodowska-Curie IF (MSCA): Intelligent Applications over Large Scale Data Streams (INNOVATE); 2018-2020. PI: Dr C Anagnostopoulos INNOVATE proposes novel methodologies and solutions adopting a pool of computational intelligence schemes and ensemble learning models for fusing local pieces of knowledge in a timely and efficient way. Distributed stochastic optimization techniques will be developed to provide efficient solutions that can support large-scale data steam-based predictive analytics. [*] EU H2020 FIRE+: Glasgow Network Functions for Unmanned Vehicles (GNFUV) 2018-2019. PI: Dr C Anagnostopoulos Glasgow Network Functions for Unmanned Vehicles (GNFUV) is an extension of the Glasgow Network Functions (GNF) framework that operates over UxV infrastructures being particularly well-suited for operating over resourced-constrained and mobile Internet of Things (IoT) environments. GNFUV aims to showcase the capabilities of UxVs as hosting platforms for (virtualised) tasks, ranging from always-on monitoring and network topology self-management, to in-network, contextual information processing algorithms for edge-computing predictive analytics. [*] UK EPSRC: Closed-Loop Data Science for Complex, Computationally- and Data-Intensive Analytics (CLDS) 2018-2023. co-PI: Dr C Anagnostopoulos; PI: Prof R Murray-Smith. Progress in sensing, computational power, storage and analytic tools has given us access to enormous amounts of complex data, which can inform us of better ways to manage our cities, run our companies or develop new medicines. However, the 'elephant in the room' is that when we act on that data we change the world, potentially invalidating the older data. In this project we will look at the overlap between the challenge someone faces when coping with all the choices associated with booking a flight for a weekend away, and an expert running complex experiments in a laboratory. [*] EU Erasmus+ KA2: Personalised Recommendations and Internationalisation for MOOCs in European Schools (PRIMES), 2016-2019. co-PI: Dr C Anagnostopoulos PRIMES aims to produce a novel e-learning platform, combining the wide reach and popularity of MOOCs with advanced artificial intelligence and data summarisation algorithms, to provide a truly personalised learning experience, fitted to the needs and characteristics of teenager (secondary school) students. [*] BMW Research Group: Advanced Federated Learning in Vehicle Networks, 2019-2027. PI: Dr C Anagnostopoulos [*] NXP Research: In-vehicle Edge Data Analytics, 2020-2021. co-PI: Dr C Anagnostopoulos [*] NHS Golden Jubilee: Risk Prediction Models in Congenital Diseases, 2021. (PIs: Dr C Anagnostopoulos; Dr F Deligianni) [*] Turing Network Development (Alan Turing Institute and EPSRC IAA) Turing Network for AI in offshore wind geot",
  "content_length": 174856,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:38"
}