{
  "name": "Christian Scheideler",
  "homepage": "http://cs.uni-paderborn.de/ti/personal/prof-dr-rer-nat-christian-scheideler",
  "status": "success",
  "content": "Prof. Dr. rer. nat. Christian Scheideler - Theorie verteilter Systeme | Universität Paderborn Prof. Dr. Christian Scheideler Theorie verteilter Systeme E-Mail schreiben +49 5251 60-6728 Mehr zur Person Nach Vereinbarung. Bitte kontaktieren Sie das Sekretariat. Bitte wenden Sie sich zur Absprache von Prüfungsterminen an das Sekretariat. Verteilte Algorithmen und DatenstrukturenSicherheit in verteilten SystemenRandomisierte Algorithmen und stochastische ProzesseNetzwerktheorie(insbesondere P2P Systeme, mobile ad-hoc Netzwerke und Sensor-Netzwerke)Diskrete Mathematik Leiter des Instituts für InformatikAdvisory Committee der SPAAAssociate Editor des Journal of the ACMAssociate Editor des Journal of Computer and System SciencesManaging Editor des Journal of Interconnection NetworksSteering Committee der DISCSteering Committee der SIROCCOSteering Committee der ALGOSENSORSSprecher des Fachbereichs „Grundlagen der Informatik“ in der Gesellschaft für InformatikPC Mitglied von SOFSEM 23, UCNC 23, Euro-Par 23Local Arrangements Co-Chair der ICALP 2023Mitglied des „PODC Doctoral Dissertation Award“ Komitees 2023Co-Organisator des „Special Models of Computation” Workshops der SIROCCO 2023 Informationen zur Beantragung von BAföG finden Sie hier Antragsformular als Download 50th EATCS International Colloquium on Automata,Languages and Programming, ICALP 2023 Paderborn - GermanyJuly 10 - July 14, 2023 Secretary der SPAA 2004-2015Steering Committee Member der SPAA 2019-2020General Chair SSS 2014 und SPAA 2015-2020Organisator des “NSF Workshop on Self-organizing Particle Systems” (SOPS 2014)Co-Organisator des Workshop\"Foundations of Network Science” (ICALP 2013)Co-Organisator der Dagstuhl Seminare 14051, 16271 und 18331, der Bertinoro Workshops in 2007, 2009, 2019 und 2022 und eines NSF Workshop co-located mit der SODA 2014Co-Organisator des Workshops Rapid Reconfiguration of Programmable Matter (co-located UCNC 2021)Leiter des internationalen Dijkstra Preis Komitees 2022Local arrangements chair: SIROCCO 2022 (chair), SIROCCO 2020 (chair), SSS 2014 (chair), INFORMATIK 2008 (co-chair), SPAA 2008 (chair), STOC 2005 (chair), ICALP 1998 (member)PC Chair von DISC 2022, SIROCCO 2015 + 2020, ALGOSENSORS 2010 + 2019, SSS 2012 + 2013 + 2021, IPDPS 2009, SPAA 2007, DCOSS 2007Co-PC Chair der SSS 2021PC Mitglied vonALGOSENSORS 2020, 2016, 2012, 2008, 2007APoCS 2020CAAN 2006CDCS 2022DCOSS 2017, 2014, 2013, 2012, 2008, 2006, 2005DISC 2020, 2017DIAL-M 2004, 2003ESA 2018, 2004Euro-Par 2016FOMC 2014, 2013Gekko 2009Globecom 2007HiPC 2005, 2004, 2003ICALP 2020, 2018, 2017, 2014, 2013, 2011, 2010, 2008ICDCN 2017, 2016, 2012ICDCS 2022, 2021, 2010, 2004ICPADS 2009, 2006IPDPS 2020, 2019, 2018, 2017, 2015, 2010, 2006IPSN 2008IPTPS 2007I-SPAN 2005IZS 2004MFCS 2018, 2014, 2011, 2006NetSciCom 2014, 2013, 2012, 2011, 2010, 2009NetEcon 2006OPODIS 2019, 2017, 2011P2P 2014PASA 2006PDCN 2005, 2004PODC 2021, 2019, 2015, 2012, 2006RC-Education 2006SAGA 2007, 2005, 2003, 2001SAND 2022SEA 2012SIROCCO 2021, 2011SODA 2015SOFSEM 2006SPAA 2014, 2006, 2003SSS 2020, 2019, 2018, 2017, 2016, 2015, 2009STACS 2022, 2007UCNC 2021 2025 Supervised Distributed Computing J. Augustine, C. Scheideler, J. Werthmann, in: Lecture Notes in Computer Science, Springer Nature Switzerland, Cham, 2025. DOI Distributed and Parallel Low-Diameter Decompositions for Arbitrary and Restricted Graphs J. Dou, T. Götte, H. Hillebrandt, C. Scheideler, J. Werthmann, in: R. Meka (Ed.), 16th Innovations in Theoretical Computer Science Conference (ITCS 2025), Schloss Dagstuhl – Leibniz-Zentrum für Informatik, Dagstuhl, Germany, 2025, p. 45:1–45:26. DOI Efficient shape formation by 3D hybrid programmable matter: An algorithm for low diameter intermediate structures K. Hinnenthal, D.J. Liedtke, C. Scheideler, Theoretical Computer Science 1057 (2025). DOI Invited Paper: Distributed Rhombus Formation of Sliding Squares I. Kostitsyna, D.J. Liedtke, C. Scheideler, in: S. Bonomi, P.S. Mandal, P. Robinson, G. Sharma, S. Tixeuil (Eds.), Stabilization, Safety, and Security of Distributed Systems, Springer Nature Switzerland, Cham, 2025, pp. 325–342. DOI 2024 Efficient Shape Formation by 3D Hybrid Programmable Matter: An Algorithm for Low Diameter Intermediate Structures K. Hinnenthal, D.J. Liedtke, C. Scheideler, in: A. Casteigts, F. Kuhn (Eds.), 3rd Symposium on Algorithmic Foundations of Dynamic Networks (SAND 2024), Schloss Dagstuhl – Leibniz-Zentrum für Informatik, Dagstuhl, Germany, 2024, p. 15:1–15:20. DOI Universal Coating by 3D Hybrid Programmable Matter I. Kostitsyna, D.J. Liedtke, C. Scheideler, in: Y. Emek (Ed.), Structural Information and Communication Complexity, Springer Nature Switzerland, Cham, 2024. DOI The structural power of reconfigurable circuits in the amoebot model A. Padalkin, C. Scheideler, D. Warner, Natural Computing (2024). DOI Reconfiguration and Locomotion with Joint Movements in the Amoebot Model A. Padalkin, M. Kumar, C. Scheideler, in: A. Casteigts, F. Kuhn (Eds.), 3rd Symposium on Algorithmic Foundations of Dynamic Networks, SAND 2024, June 5-7, 2024, Patras, Greece, Schloss Dagstuhl - Leibniz-Zentrum für Informatik, 2024, p. 18:1–18:20. DOI Polylogarithmic Time Algorithms for Shortest Path Forests in Programmable Matter A. Padalkin, C. Scheideler, in: Proceedings of the 43rd ACM Symposium on Principles of Distributed Computing, ACM, 2024. DOI Invited Paper: Blockchains made Lightweight: A Median Rule for State Machine Replication J. Dou, C. Scheideler, in: Proceedings of the 2024 Workshop on Advanced Tools, Programming Languages, and PLatforms for Implementing and Evaluating Algorithms for Distributed Systems, ACM, 2024. DOI Routing Schemes for Hybrid Communication Networks S. Coy, A. Czumaj, C. Scheideler, P. Schneider, J. Werthmann, Theoretical Computer Science 985 (2024). DOI 2023 The canonical amoebot model: algorithms and concurrency control J.J. Daymude, A.W. Richa, C. Scheideler, Distributed Comput. 36 (2023) 159–192. DOI Beep-and-Sleep: Message and Energy Efficient Set Cover T. Götte, C. Kolb, C. Scheideler, J. Werthmann, Theor. Comput. Sci. 950 (2023) 113756. DOI Routing Schemes for Hybrid Communication Networks J. Werthmann, C. Scheideler, S. Coy, A. Czumaj, P. Schneider, in: 2023. DOI Time-Optimal Construction of Overlays T. Götte, K. Hinnenthal, C. Scheideler, J. Werthmann, Distributed Computing (2023). DOI Capabilities and Limitations of Local Strategies in Dynamic Networks T. Götte, T. Knollmann, F. Meyer auf der Heide, C. Scheideler, J. Werthmann, in: C.-J. Haake, F. Meyer auf der Heide, M. Platzner, H. Wachsmuth, H. Wehrheim (Eds.), On-The-Fly Computing -- Individualized IT-Services in Dynamic Markets, Heinz Nixdorf Institut, Universität Paderborn, Paderborn, 2023, pp. 1--20. DOI PDF Robustness and Security J. Blömer, F. Eidens, T. Jager, D. Niehues, C. Scheideler, in: C.-J. Haake, F. Meyer auf der Heide, M. Platzner, H. Wachsmuth, H. Wehrheim (Eds.), On-The-Fly Computing -- Individualized IT-Services in Dynamic Markets, Heinz Nixdorf Institut, Universität Paderborn, Paderborn, 2023, pp. 145–164. DOI PDF Brief Announcement: Distributed Construction of Near-Optimal Compact Routing Schemes for Planar Graphs J. Dou, T. Götte, H. Hillebrandt, C. Scheideler, J. Werthmann, in: Proc. of the 42nd ACM Symposium on Principles of Distributed Computing (PODC ’23), 2023. 2022 Coordinating Amoebots via Reconfigurable Circuits M. Feldmann, A. Padalkin, C. Scheideler, S. Dolev, J. Comput. Biol. 29 (2022) 317–343. DOI The Structural Power of Reconfigurable Circuits in the Amoebot Model A. Padalkin, C. Scheideler, D. Warner, in: T.E. Ouldridge, S.F.J. Wickham (Eds.), 28th International Conference on DNA Computing and Molecular Programming (DNA 28), Schloss Dagstuhl – Leibniz-Zentrum für Informatik, Dagstuhl, Germany, 2022, p. 8:1–8:22. DOI Fault-Tolerant Shape Formation in the Amoebot Model I. Kostitsyna, C. Scheideler, D. Warner, in: T.E. Ouldridge, S.F.J. Wickham (Eds.), 28th International Conference on DNA Computing and Molecular Programming (DNA 28), Schloss Dagstuhl – Leibniz-Zentrum für Informatik, Dagstuhl, Germany, 2022, p. 9:1–9:22. DOI Local Mutual Exclusion for Dynamic, Anonymous, Bounded Memory Message Passing Systems J.J. Daymude, A.W. Richa, C. Scheideler, in: J. Aspnes, O. Michail (Eds.), 1st Symposium on Algorithmic Foundations of Dynamic Networks, SAND 2022, March 28-30, 2022, Virtual Conference, Schloss Dagstuhl - Leibniz-Zentrum für Informatik, 2022, p. 12:1–12:19. DOI Brief Announcement: The (Limited) Power of Multiple Identities: Asynchronous Byzantine Reliable Broadcast with Improved Resilience through Collusion T. Götte, C. Scheideler, in: K. Agrawal, I.-T.A. Lee (Eds.), SPAA ’22: 34th ACM Symposium on Parallelism in Algorithms and Architectures, Philadelphia, PA, USA, July 11 - 14, 2022, ACM, 2022, pp. 99–101. DOI Brief Announcement: Fault-Tolerant Shape Formation in the Amoebot Model I. Kostitsyna, C. Scheideler, D. Warner, in: J. Aspnes, O. Michail (Eds.), 1st Symposium on Algorithmic Foundations of Dynamic Networks (SAND 2022), Schloss Dagstuhl – Leibniz-Zentrum für Informatik, Dagstuhl, Germany, 2022, p. 23:1–23:3. DOI 2022 Edsger W. Dijkstra Prize in Distributed Computing M. Aguiliera, A.W. Richa, A.A. Schwarzmann, A. Panconesi, C. Scheideler, P. Woelfel, in: A. Milani, P. Woelfel (Eds.), PODC ’22: ACM Symposium on Principles of Distributed Computing, Salerno, Italy, July 25 - 29, 2022, ACM, 2022, p. 1. DOI 36th International Symposium on Distributed Computing, DISC 2022, October 25-27, 2022, Augusta, Georgia, USA C. Scheideler, ed., 36th International Symposium on Distributed Computing, DISC 2022, October 25-27, 2022, Augusta, Georgia, USA, Schloss Dagstuhl - Leibniz-Zentrum für Informatik, 2022. A self-stabilizing Hashed Patricia Trie T. Knollmann, C. Scheideler, Information and Computation (2022). DOI 2021 Logarithmic Time MIMO Based Self-Stabilizing Clock Synchronization S. Dolev, R. Prasadh Narayanan, C. Scheideler, C. Schindelhauer, in: L. Gallu",
  "content_length": 49152,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:21"
}