{
  "name": "Christopher Gad",
  "homepage": "https://pure.itu.dk/portal/en/persons/christopher-gad(d55dab65-fffe-4da4-a383-cfcf5ee3a8cd).html",
  "status": "success",
  "content": "Christopher Gad - IT-University of Copenhagen Christopher Gad Head of section Associate Professor, Technologies in PracticeCenter for Information Security and Trust https://orcid.org/0000-0002-1631-5483 Emailchgaitudk 20052024 Research activity per year Personal profile CurriculumChristopher Gad is a researcher and lecturer within the area of Science & Technology studies with special attention to digitatlization and information technologies. He is interested in understanding the complex and surprising ways in which human beings and technologies relate. He has lectured mostly within the areas of science and technology studies & organizational theory. Link to CVResearch areasScience & Technology Studies. (Post-)Actor-Network Theory. Lateral thinking. Ontological multiplicity and complexity. The promises, aspirations and challenges related to information technologies, digitalization and computational thinking in theory and practice. Ethnographic, virtual, micro-sociological, mixed, and non-foundationalist approaches. Democracy, elections and disability. Bureaucracy and organizational theory. Fisheries inspection & surveillance. KeywordsOntotologiesScience and technology studies (STS)SurveillanceBureaucracyEthnographyLateral thinkingDigitalizationComputational thinkingPratice thinkingConceptions of techologyChanging relations between human beings and technology Fingerprint Dive into the research topics where Christopher Gad is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Technology Studies Keyphrases 100% Science Studies Keyphrases 100% Danish Social Sciences 91% Denmark Social Sciences 90% Democracy Social Sciences 66% Conceptual Arts and Humanities 65% Infra Keyphrases 60% Electoral Process Keyphrases 55% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2005 2009 2010 2012 2013 2014 2015 2016 2022 2023 2024 25 Journal article 21 Conference abstract for conference 12 Book chapter 3 Paper 9 More 1 Anthology 1 Book 1 Article in proceedings 1 Conference article 1 Contribution to newspaper - Newspaper article 1 Editorial 1 Net publication - Internet publication 1 PhD thesis 1 Working paper Research output per year Research output per year Digtial care for the SoulGad, C. & Schyberg, K. A., 6 Jun 2024.Research output: Contribution to conference - NOT published in proceeding or journal › Conference abstract for conference › Research › peer-review Prototypes all the way down: Prototyping in the teaching and development of technology ComprehensionGahoonia, S. K. & Gad, C., 2024, In: STS Encounters. 16, 1, p. 3-18 15 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Social Knowledge 100% Practical Knowledge 50% school subjects 33% Rehearsal 33% Impossibility 33% UDREDNING: an Extended Reality Artwork for Affectively Engaging with Diagnosing ProcessesGad, C. & Fritsch, J., 2024, NordiCHI '24: Adjunct Proceedings of the 2024 Nordic Conference on Human-Computer Interaction. p. 1-9 67Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Authors 100% Public Service 100% Orphan Disorder 100% Extended Reality 100% Lived Experience 100% Curating Complexities in Art, Science, and Medicine: Art, Science, and Technology Studies (ASTS) in Public PracticeRogers, H. S., Gad, C., Hussey, K. D., Whiteley, L., Bencard, A. & Abrantes, E., 2023, In: STS Encounters. 15, 2, p. 1-15 15 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Science Studies 100% Technology Studies 100% Art-science 100% Art Technology 100% Public Practice 100% Digitalization becoming a matter of securityGad, C., 9 Jun 2023.Research output: Contribution to conference - NOT published in proceeding or journal › Conference abstract for conference › Research › peer-review View all 70 research outputs Projects Projects per year 2010 2010 2011 2016 2020 2023 4 Finished Projects per year DemTech: Trustworthy Democratic TechnologySchürmann, C. (PI), Boulus-Rødje, N. (CoI), Gad, C. (CoI), Kiniry, J. R. (CoI), Markussen, R. (CoI), Gustafsson, D. (CoI), Wang, J. (CoI), Vadgaard, A. K. P. (CoI), Murawska, A. A. (CoI) & Bock, P. B. (CoI)Innovation Fund Denmark01/07/2011 → 31/01/2018Project: Research Denmark 100% Electoral Process 93% Democracy 86% Elections 72% Danish 69% DaR: Data as Relation: Governance in the age of big dataWinthereik, B. R. (PI), Gad, C. (PI), Elam, M. (CoI), Cohn, M. (CoI), Hjelholt, M. (CoI), Douglas-Jones, R. (CoI), Rossi, L. (CoI), Neumayer, C. (CoI), Jørgensen, B. (CoI), Schou, J. (CoI), Burnett, J. M. (CoI), Hockenhull, M. (CoI), Maguire, J. (CoI), Pedersen, L. R. (CoI), Papazu, I. (CoI), Salling, C. A. (CoI), Gahoonia, S. K. (CoI), Ojala, M. (CoI) & Enslev, L. (CoI)Velux Foundation11/03/2016 → 10/03/2021Project: Research Digital 100% Data Double 75% Hype 75% Data Aggregate 50% State Space 50% Surveillance in DenmarkGad, C. (PI)Independent Research Fund Denmark01/09/2010 → 31/08/2013Project: Research Denmark 100% Technology Studies 100% Housing Community 100% Police Work 100% COST Action 100% WaD : Welfare after DigitalizationGalis, V. (PI), Ferreira, P. (CoI), Cohn, M. (CoI), Finken, S. (CoI), Winthereik, B. R. (CoI), Maguire, J. (CoI), Gad, C. (CoI), Vlassis, V.-S. (CoI), Laursen, C. S. (CoI), Salling, C. A. (CoI) & Gahoonia, S. K. (CoI)Velux Foundation01/04/2020 → 31/12/2023Project: Research Science and Technology Studies 100% Digitalization 100% Video Consultation 88% Digital 88% Public Education 77% Press/Media Welcome to a new board of DASTSGahoonia, S. K. & Gad, C.04/03/20251 Media contributionPress/Media: Press / Media Syv tips til at beskytte dit privatliv onlineGad, C.20/01/20251 Media contributionPress/Media: Press / Media Monopol-sager og privacy-kritik sender Apple i strid modvind: »Går efter hjertet i deres forretningsmodel«Gad, C.23/04/20241 Media contributionPress/Media: Press / Media UDREDNING - en audiovisuel event af Mogens Jacobsen og Jonas FritschFritsch, J. & Gad, C.26/03/20241 Media contributionPress/Media: Press / Media AFGØRELSE: ITU krævede tavshed i strid med reglerneGad, C.16/02/20241 Media contributionPress/Media: Press / Media View all 19 press/media Activities Activities per year 2007 2010 2011 2015 2022 2023 14 Lecture and oral contribution 5 Organisation and participation in workshop, seminar, course 3 Organisation and participation in conference 2 Membership in review committee 1 More 1 Editor of Research journal Activities per year 6th Nordic STS Conference 2023Gad, C. (Workshop Chair) & Gad, C. (Conference Chair)2023Activity: Participating in or organising an event types › Organisation and participation in conference Aarhus University (External organisation)Gad, C. (Member)18 Aug 2015Activity: Membership types › Membership in review committee Aarhus University (External organisation)Gad, C. (Member)14 Aug 2015Activity: Membership types › Membership in review committee A Bestiary of Digital MonstersDouglas-Jones, R. (Speaker), Gad, C. (Speaker) & Hockenhull, M. (Speaker)11 Dec 2018Activity: Talk or presentation types › Lecture and oral contribution Binary TensionsGad, C. (Speaker)2018Activity: Talk or presentation types › Lecture and oral contribution View all 25 activities",
  "content_length": 7768,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:15"
}