{
  "name": "Chris Watkins",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/chris-watkins_09225e27-7a15-4edc-a087-69efb68c65c0.html",
  "status": "success",
  "content": "Chris Watkins - Royal Holloway Research Portal View Scopus Profile Chris Watkins Professor Professor in Computer Science, Department of Computer ScienceBioinformaticsCentre for Machine LearningDigital Organisation and Society Research Centre Centre for Intelligent SystemsCentre for Reliable Machine Learning Phone+44 1784 443419EmailC.J.Watkinsrhul.acukWebsitehttp://www.cs.rhul.ac.uk/home/chrisw/ TW20 0EX Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 28 Article 10 Conference contribution 8 Chapter 2 Chapter (peer-reviewed) 9 More 2 Other 2 Paper 2 Patent 1 Entry for encyclopedia/dictionary 1 Other contribution 1 Working paper Research output per year Research output per year Dual representations: A novel variant of Self-Supervised Audio Spectrogram Transformer with multi-layer feature fusion and pooling combinations for sound classificationChoi, H., Zhang, L. & Watkins, C., 28 Mar 2025, In: Neurocomputing. 623, 15 p., 129415.Research output: Contribution to journal › Article › peer-review Open Access 1 Downloads (Pure) Evolution with recombination as Gibbs samplingPoulton, J. M., Altenberg, L. & Watkins, C., Jun 2023, In: Theoretical Population Biology. 151, p. 28-43 16 p.Research output: Contribution to journal › Article › peer-review Open Access A Hybrid Data-Driven Online Solar Energy Disaggregation System from the Grid Supply PointZhang, X., Kuenzel, S., Guo, P., Yin, L. & Watkins, C., 23 Sept 2022, In: Complex & Intelligent Systems.Research output: Contribution to journal › Article › peer-review Open Access Bring Something to the Potluck: A System for Inclusive and Reciprocal Online DiscussionLieu, E., Cole, J. & Watkins, C., Jul 2022, British Computer Society: BCS Human-Computer Interaction Conference 2022. HCI2022 ed. Keele, UK: British Computer Society (BCS), Vol. 35th International HCI Conference. p. 1-6 6 p. HCI2022.4Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open Access Hybrid Short-Term Load Forecasting Method Based on Empirical Wavelet Transform and Bidirectional Long Short-Term Memory Neural NetworksZhang, X., Kuenzel, S., Colombo, N. & Watkins, C., 9 Aug 2022, (E-pub ahead of print) In: Journal of Modern Power Systems and Clean Energy. 10, 5, p. 1216-1228 13 p.Research output: Contribution to journal › Article › peer-review Open AccessFile 189 Downloads (Pure) View all 57 research outputs Projects 5 Finished Projects per year Intelligence in ContextWatkins, C. (PI)1/01/20 → 15/08/21Project: Research Transatlantic Perspectives on the Use of Data Science in Museums and HeritagePlatts, H. (PI), Dalton, P. (CoI), Howard, D. (CoI) & Watkins, C. (CoI)Arts & Humanities Research Council AHRC1/02/19 → 30/06/20Project: Research Impact of the large scale roll-out of smart meters on freedom of choice and privacy Zhang, X. (PI), Kuenzel, S. (PI), Córdoba-Pachón, J.-R. (PI) & Watkins, C. (PI)1/01/18 → 31/12/21Project: Research The Female Experiences in a Male-dominated Learning EnvironmentFerreira, M. C. (CoI) & Watkins, C. (CoI)11/02/14 → 2/12/14Project: Research Composing Learning for Artificial Cognitive SystemsWatkins, C. (PI)European Union1/03/11 → 28/02/15Project: Research Activities 1 Membership of peer review panel or committee Activities per year EPSRC College (External organisation)Watkins, C. (Participant)2010 → …Activity: Membership › Membership of peer review panel or committee",
  "content_length": 4011,
  "method": "requests",
  "crawl_time": "2025-12-01 12:51:52"
}