{
  "name": "Christina Garman",
  "homepage": "https://www.cs.purdue.edu/people/faculty/clg",
  "status": "success",
  "content": "Christina L. Garman - Department of Computer Science - Purdue University Skip to content Home People Faculty Christina L. Garman Faculty & Lecturers Staff Offices Christina Garman Assistant Professor of Computer Science Christina Garman is an assistant professor in the Department of Computer Science at Purdue University. Her research interests focus largely on practical and applied cryptography, namely the design and analysis of real world cryptographic systems. She aims to make it easier to design and securely deploy new and complex cryptographic systems while preventing insecurities from occurring in such systems. As part of this, her work thus far has been on both buil… ↓More Joined department: Spring 2018 Research Areas Information Security and Assurance Education Bachelor of Science, Bucknell University, Computer Science and Engineering (2011) Bachelor of Arts, Bucknell University, Mathematics (2011) Master of Science in Engineering, Johns Hopkins University, Computer Science (2013) Doctor of Philosophy, Johns Hopkins University, Computer Science (2017) Christina Garman is an assistant professor in the Department of Computer Science at Purdue University. Her research interests focus largely on practical and applied cryptography, namely the design and analysis of real world cryptographic systems. She aims to make it easier to design and securely deploy new and complex cryptographic systems while preventing insecurities from occurring in such systems. As part of this, her work thus far has been on both building and deploying secure cryptographic systems, as well as analyzing existing systems. This includes past work on cryptographic automation and building \"keyless CDNs\", as well as exploring the weaknesses of RC4 in TLS and discovering flaws in Apple's iMessage, and her current work focusing on removing the \"human element\" from the deployment and analysis of cryptographic systems through the use of cryptographic automation and the development of tools. She received an NSF CAREER Award in 2021, and her work has received a best paper award at ACM CCS and been featured in numerous media, including The Washington Post, The New York Times, Wired, and The Economist. She is also one of the co-founders of Zcash, a privacy preserving cryptocurrency based on her work on Zerocash (which received an IEEE Test of Time Award in 2024). She received her MS and Ph.D. from Johns Hopkins University in Computer Science in 2013 and 2017 respectively, and a BS in Computer Science Engineering and a BA Mathematics, with a minor in Physics, from Bucknell University in 2011. Contact Info clg@cs.purdue.edu LWSN 1185 Websites My Homepage",
  "content_length": 2665,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:30"
}