{
  "name": "Christian Guckelsberger",
  "homepage": "https://www.aalto.fi/en/people/christian-guckelsberger",
  "status": "success",
  "content": "Christian Guckelsberger | Aalto University People Christian Guckelsberger I'm a Computer Scientist, Art Historian and Assistant Professor in Creative Technologies at Aalto University, where I lead the Autotelic Interaction Research (AIR) group. My goal is to engineer artificial systems that are creative in their own right and in interaction with people. Moreover, I am interested in how creative AI is perceived by its users and the general public, and how we can support its sustainable adoption in the workplace and in society. I conduct interdisciplinary, theoretical work as well as applied qualitative and quantitative research in various creative domains such as videogames, fine art and design, bridging between AI, HCI, Psychology, Philosophy & Creative Practice. Inspired by its central role in human and animal creativity, I advocate intrinsic motivation as a key to unleashing creativity in artificial systems. I contribute to the comparison of existing and the development of new, psychologically plausible models of computational intrinsic motivation with a focus on multi-agent interaction, and I apply my findings to shape the next generation of transformative videogame AI. I promote games as a domain for computational creativity research because they allow us to study and foster both, human and AI creativity, in play and in game design, across different types of content, with societal, cultural and economic impact. I am also a visiting scholar at the School of Electronical Engineering and Computer Science at Queen Mary University of London, a PI in the Finnish Center for Artificial Intelligence (FCAI), and a member of the European Laboratory for Learning and Intelligent Systems (ELLIS). The list below is a selection of recent publications. You can find the complete list on Google Scholar and my academic CV here. Also, here's a recorded talk with an overview of six recent research projects on creative AI. You can best contact me via email. I occasionally post news on LinkedIn, or as @CreativeEndvs on Bluesky and Mastodon. I'm always interested in meeting curious, smart and ambitious people to work with. If you would like to do a Research Visit/Postdoc/PhD or your MSc thesis with me, please check out the application instructions on our group's website. Unfortunately, I do not have time to respond to requests that do not follow these instructions. Full researcher profile https://research.aalto.fi/... Email christian.guckelsberger@aalto.fi Postal address Konemiehentie 2 02150 Espoo Finland Areas of expertise Computational Creativity, Artificial Intelligence, Human-Computer Interaction, Intrinsic Motivation, Videogames, Design Honors and awards Honorable Mention (CHI PLAY 2023) Awarded for V. Vimpari, A. Kultima, P. Hämäläinen and C. Guckelsberger: \"An Adapt-or-Die Type of Situation\": Perception, Adoption, and Use of Text-To-Image-Generation AI by Game Industry Professionals. In: Proceedings of the ACM on Human-Computer Interaction 7, CHI PLAY, p. 131–164, 379. Award or honor granted for a specific work Department of Computer Science Jan 2023 Finalist in “AI Game Dev” Competition Europe’s first research-driven competition to enhance game technology. Entered with our work published in S. Roohi, C. Guckelsberger, A. Relas, H. Heiskanen, J. Takatalo, and P. Hämäläinen. Predicting Game Engagement and Difficulty Using AI Players. Proc. of the ACM on Human-Computer Interaction, 5(CHI Play):1–18, 2021. Invitation or ranking in competition Department of Computer Science Dec 2021 Best Paper Award (International Conference on Computational Creativity) Awarded for S. Colton, A. Pease, C. Guckelsberger, J. McCormack, and M. T. Llano. On the Machine Condition and its Creative Expression. In Proc. Int. Conference on Computational Creativity (ICCC), pages 342–349, 2020. Award or honor granted for a specific work Department of Computer Science Sep 2020 Best Paper Award (IEEE Conference on Computational Intelligence and Games) Awarded for C. Guckelsberger, C. Salge, and J. Togelius. New And Surprising Ways to be Mean: Adversarial NPCs with Coupled Empowerment Minimisation. In Proc. Conference on Computational Intelligence and Games (CIG), pages 1–8. IEEE, 2018. Award or honor granted for a specific work Department of Computer Science Aug 2018 Finalist in “Creative Computing for the Digital Economy” Competition A category in the UK-wide “Connected Nations Pioneers” competition, hosted by the EPSRC to recognise exceptional postgraduate research contributions. Awarded for my work on intrinsically motivated NPCs for next-generation game AI. Invitation or ranking in competition Department of Computer Science Oct 2018 Best Paper Honourable Mention (CHI Play) Awarded for C. Guckelsberger, C. Salge, J. Gow, and P. A. Cairns. Predicting Player Experience Without the Player. An Exploratory Study. In Proc. SIGCHI Annual Symposium on Computer-Human Interaction in Play (CHI Play), pages 305–315. ACM, 2017. Honourable mentions are given to the top 5 papers in the competition. Award or honor granted for a specific work Department of Computer Science Oct 2017 Publications Advancing Self-Determination Theory via computational modelling: the case of competence and optimal challenge Sebastian Deterding, Christian Guckelsberger, Erik Lintunen, Nadia Ady 2025 Motivation and Emotion Towards a Formal Specification of the Need for Competence Erik Lintunen, Nadia Ady, Sebastian Deterding, Christian Guckelsberger 2025 Towards a Formal Theory of the Need for Competence via Computational Intrinsic Motivation Erik M. Lintunen, Nadia M. Ady, Sebastian Deterding, Christian Guckelsberger 2025 Proceedings of the 47th Annual Conference of the Cognitive Science Society What To Practise Next? Using Diversity Progress To Select From Discriminability-Motivated Goals Erik Lintunen, Nadia Ady, Christian Guckelsberger 2025 From Product to Producer: The Impact of Perceptual Evidence and Robot Embodiment on the Human Assessment of AI Creativity Niki Pennanen, Simo Linkola, Anna Kantosalo, Nicolas Hiillos, Tomi Männistö, Christian Guckelsberger 2025 ACM Transactions on Computer-Human Interaction Untapped Potential in Self-Optimization of Hopfield Networks: The Creativity of Unsupervised Learning Natalya Weber, Christian Guckelsberger, Tom Froese 2025 Artificial Life Not All the Same: Understanding and Informing Similarity Estimation in Tile-Based Video Games Sebastian Berns, Vanessa Volz, Laurissa Tokarchuk, Sam Snodgrass, Christian Guckelsberger 2024 CHI '24: Proceedings of the 2024 CHI Conference on Human Factors in Computing Systems Why Self-Determination Theory Needs Formal Modelling: The Case of Competence and Balanced Challenge Sebastian Deterding, Erik Matias Lintunen, Christian Guckelsberger, Nadia M. Ady 2024 Creativity and Markov Decision Processes Joonas Lahikainen, Nadia M. Ady, Christian Guckelsberger 2024 Proceedings of the 15th International Conference on Computational Creativity (ICCC 2024) Diversity Progress for Goal Selection in Discriminability-Motivated RL Erik Lintunen, Nadia Ady, Christian Guckelsberger 2024",
  "content_length": 7099,
  "method": "requests",
  "crawl_time": "2025-12-01 12:52:05"
}