{
  "name": "Chu Kiong Loo",
  "homepage": "https://umexpert.um.edu.my/ckloo-um",
  "status": "success",
  "content": "UMEXPERT - PROF. DR. LOO CHU KIONG PROF. DR. LOO CHU KIONG Department of Artificial Intelligence Faculty of Computer Science and Information Technology ckloo.umum.edu.my View CV View 1-Page CV Publons Scopus Link Biography Prof. Dr. Loo has conducted fascinating research over the 12 years in The University of Malaya, particularly in Lifelong Machine Learning, Explainable Robotics, Explainable AI and recently in Trustworth & Sustainable AI. His numerous publications on the topic have been well-received and have made a substantial contribution to the Continual Machine Intelligence.  He has published more than 200 peer-reviewed journal and conference papers on neurorobotics and machine intelligence. In high-impact journals such as IEEE Transactions on Neural Networks and Learning Systems, Neural Networks, Journal of Neural Systems, IEEE Transactions on Cognitive and Developmental Systems, IEEE Transactions on Cybernetics, to name a few. Prof. Loo is also the recipient of JSPS fellowship award from Japan and the Georg Forster Fellowship award from the Humboldt Foundation, Germany, Belt and Road Academic Fellowship Scheme, China, and the Fulbright Fellowship from US. He has been the visiting professor of Osaka Metropolitan University, Japan, and King Mongkut's Institute of Technology Ladkrabang, Thailand and Adjunct Professor in The Harry Butler Institute, Murdoc University. He has applied the developed theory to medical diagnosis, prognosis, and brain-inspired Machine Intelligence, and the potential of his research findings has been successfully demonstrated in various domains, including digital healthcare and cognitive robotics. Chu Kiong has been recognized for his excellence in applied research that has commercial potential based on the 10 patents filed. He is one of the founders of UM spin-off company, UMCH Sdn. Bhd. specializing in AI-enabled connected healthcare solutions.   Moreover, he is honoured Malaysia’s Research Star Award 2019 - Research and Innovation Excellence Awards, from the Ministry of Education as one of the most influential researchers in Malaysia. He received the Top Research Scientist Malaysia (TRSM) award 2020 from the Academy of Science Malaysia. Hide Collaborator aznulqalid niksherina ngcj plai zati angtf cswoo tchaw chiayc isyraf jamuna nazean azzyaty faizahn jhchuah siewcng tkchiew unaizah einly_lim rahasaaid View all collaborators Statistics Publication Annual Publications by Category Publication WoS Indexed SCOPUS Indexed Book Chapter in Book Summary of Budget vs Expenditure per vote for all research grants Finance Budget Expenditure Latest Publications View All Article in Academic Journals Book Chapter in book 2025 Enhancing Small-for-Gestational-Age Prediction: Multi-Country Validation of Nuchal Thickness, Estimated Fetal Weight, and Machine Learning Models 2025 Smart Swimming Training: Wearable Body Sensor Networks Empower Technical Evaluation of Competitive Swimming 2025 A Reconstructed UNet Model With Hybrid Fuzzy Pooling for Gastric Cancer Segmentation in Tissue Pathology Images 2025 Research on Enhanced Gait Phase Segmentation Based on Multimodal Spatiotemporal Information Fusion 2018 Transforming Classroom Practice through Robotics Education. 2014 Neural Information Processing, 21st International Conference, ICONIP 2014, Kuching, Malaysia, November 3-6, 2014. Proceedings, Part II 2014 Neural Information Processing, 21st International Conference, ICONIP 2014, Kuching, Malaysia, November 3-6, 2014. Proceedings, Part III. 2014 Neural Information Processing, 21st International Conference, ICONIP 2014, Kuching, Malaysia, November 3-6, 2014. Proceedings, Part I. 2022 An Episodic-Procedural Semantic Memory Model for Continuous Topological Sensorimotor Map Building 2013 Classification Using Optimized Synergetic Neural Network 2013 Omnidirectional Human Intrusion Detection System Using Computer Vision Techniques 2010 Quaternion Based Machine Condition Monitoring System.",
  "content_length": 3968,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:44"
}