{
  "name": "Chuanyi Ji",
  "homepage": "https://jic.ece.gatech.edu",
  "status": "success",
  "content": "Network and Learning Group In the news Skip to primary navigation Skip to content Skip to primary sidebar Our research is on large-scale data analytics and machine learning for networks. Our research seeks real-world applications important to our society. These problems motivate new methodologies on data analytics and learning in a networked setting. Recent work includes Resilient energy networks and impact on people, Spatial temporal models for learning from micro data at scale. In collaboration with colleagues, service providers and policy makers, our research uses field data from large geographical regions in the United States. We welcome collaboration. Recent news Positions: Ph.D student(s) or one postdoc available for developing novel methodology on large-scale data analytics, modeling, and learning algorithms. The methodology will be applied to decision making for energy networks and communities. We are looking for applicants with aspiration for innovative research, a strong academic background and computational skill (or desire to develop one). Contact: jichuanyi@gatech.edu If you are already admitted by a Ph.D program at Georgia Tech, we will be happy to discuss your research interest with you. (Sorry – funding is unavailable to MS students.) Recent publication: Xu, L., Feng, K., Lin, N. et al. Resilience of renewable power systems under climate risks. Nature Review Electrical Engineering 1, 53–66 (2024). https://doi.org/10.1038/s44287-023-00003-8 S.C. Ganz, C. Duan, C. Ji, “Socioeconomic vulnerability and differential impact of severe weather-induced outages,” PNAS Nexus, Volume 2, Issue 10, October 2023, pgad295,  https://doi.org/10.1093/pnasnexus/pgad295 (News report from Georgia Tech News, Phys.org, EurekAlert!, Georgia Public Broadcasting (GPB), The Conversation, … ) IEEE PES Task Force, AM Stanković, KL Tomsovic, F De Caro, M Braun, JH Chow, N Äukalevski, I Dobson, J Eto, B Fink, C Hachmann, D Hill, C Ji, JA Kavicky, V Levi, CC Liu, L Mili, R Moreno, M Panteli, FD Petit, G Sansavini, C Singh, AK Srivastava, K Strunz, H Sun, Y Xu, S Zhao, “Methods for Analysis and Quantification of Power System Resilience,” IEEE Transactions on Power Systems, P1-14, Oct. 2022 [PDF] (IEEE PES Society Prize Paper Award 2025) A.H. Afsharinejad, C. Ji and R. Wilcox, “Large-scale data analytics for resilient recovery services from power failure,” Joule – Cell Press, Volume 5, Issue 9, P2504-2520, Sept.  2021 (featured article) [PDF] (Georgia Tech News from CoE, ECE, Research Horizon) A recent feature article by the editors at Nature Energy 2021 selects our paper 2016 as one of the eight favorites published at Nature Energy in the past five years. (ECE Gatech News.) Primary Sidebar Chuanyi Ji ECE, Georgia Tech Associate Professor Ph.D, California Institute Technology 92 M.S. Univ. of Pennsylvania 86 B.S. (Honor) Tsinghua Univ. 83 Contact: Chuanyi Ji School of ECE Georgia Institute Technology Atlanta 30332 jichuanyi@gatech.edu Tel: 404 894 2393 Fax: 404 894 7883 Office: Centergy 5165 Lab: Centergy 5125 Google Scholar CV",
  "content_length": 3064,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:48"
}