{
  "name": "Chuang Gan 0001",
  "homepage": "http://people.csail.mit.edu/ganchuang",
  "status": "success",
  "content": "Chuang Gan Chuang Gan I am a faculty member at UMass Amherst and a research manager at MIT-IBM Watson AI Lab. I was a postdoc at MIT, working with Prof. Antonio Torralba, Prof. Daniela Rus, and Prof. Josh Tenenbaum. Before that, I completed my PhD with the highest honor at Tsinghua University, where I was supervised by Prof. Andrew Chi-Chih Yao. My research lies at the intersection of computer vision, AI, cognitive science, and robotics. The overarching goal of my research is to build a human-like autonomous agents that is capable of sensing, reasoning, and acting in the physical world. My works have been recognized by Microsoft Fellowship, Baidu Fellowship, and media coverage from CNN, BBC, The New York Times, WIRED, Forbes, and MIT Tech Review. Google Scholar | Contact | News | Publications | Competitions | Software | Honors | Accessibility Contact Email: ganchuang [at] csail (dot) mit (dot) edu News RoboGen: a generative robotic agent that automatically learns diverse robotic skills at scale via generative physical simulation. 3D-LLM: General-purpose 3D vision and language foundation models. Dromedary: an open-sourced helpful, ethical, and reliable LLM. I am serving as an Area Chair for ICLR 2023, CVPR 2023, NeurIPS 2023, ICML 2023, ICCV 2023, ECCV 2022, and ACL 2021. Code and dataset of FluidLab, PAC-NeRF, Soft-Zoo, and Code Tree Search have been released. Code and dataset of Foley Music have been released. Code, dataset and evaluation server of Video CLEVRER have been released. Research Highlight ThreeDWorld (TDW) A Multi-Modal Interactive Physical Simulation Platform for Computer Vision, Robotics and Cognitive Science Transport Challenge for Visually Guided Task and Motion Planing Agent Benchmark for Psychological Reasoning Fallen Object Benchmark for Multi-Modal Physical Reasoning ThreeDWorld Website Publications(by date / by topic) 2023 RoboGen: Towards Unleashing Infinite Data for Automated Robot Learning via Generative Simulation Yufei Wang, Zhou Xian, Feng Chen, Tsun-Hsuan Wang, Yian Wang, Zackory Erickson, David Held, Chuang Gan arXiv:2311.0145 DiffuseBot: Breeding Soft Robots With Physics-Augmented Generative Diffusion Models Tsun-Hsuan Wang, Juntian Zheng, Pingchuan Ma, Yilun Du, Byungchul Kim, Andrew Spielberg, Joshua Tenenbaum,Chuang Gan†, Daniela Rus† NeurIPS 2023 (Oral) 3D-LLM: Injecting the 3D World into Large Language Models Yining Hong, Haoyu Zhen, Peihao Chen, Shuhong Zheng, Yilun Du, Zhenfang Chen, Chuang Gan NeurIPS 2023 (Spotlight) Principle-Driven Self-Alignment of Language Models from Scratch with Minimal Human Supervision Zhiqing Sun, Yikang Shen, Qinhong Zhou, Hongxin Zhang, Zhenfang Chen, David Cox, Yiming Yang, Chuang Gan NeurIPS 2023 (Spotlight) DiffVL: Scaling Up Soft Body Manipulation using Vision-Language Driven Differentiable Physics Zhiao Huang, Feng Chen, Yewen Pu, Chunru Lin, Hao Su, Chuang Gan NeurIPS 2023 Adaptive Online Replanning with Diffusion Models Siyuan Zhou, Yilun Du, Shun Zhang, Mengdi Xu, Yikang Shen, Wei Xiao, Dit-Yan Yeung, Chuang Gan NeurIPS 2023 Physion++: Evaluating Physical Scene Understanding that Requires Online Inference of Different Physical Properties Hsiao-Yu Tung, Mingyu Ding, Zhenfang Chen, Daniel Bear, Chuang Gan, Joshua B. Tenenbaum, Daniel LK Yamins, Judith E Fan, Kevin A. Smith NeurIPS 2023 Dataset Track TextPSG: Panoptic Scene Graph Generation from Textual Descriptions Chengyang Zhao, Yikang Shen, Zhenfang Chen, Mingyu Ding, Chuang Gan ICCV 2023 EfficientViT: Multi-Scale Linear Attention for High-Resolution Dense Prediction CHan Cai, Junyan Li, Muyan Hu, Chuang Gan, Song Han ICCV 2023 Learning Vision-and-Language Navigation from YouTube Videos Kunyang Lin, Peihao Chen, Diwei Huang, Thomas H Li, Mingkui Tan, Chuang Gan ICCV 2023 Sparse Universal Transformer Shawn Tan, Yikang Shen, Zhenfang Chen, Aaron Courville, Chuang Gan EMNLP 2023 ModuleFormer: Learning Modular Large Language Models From Uncurated Data Yikang Shen, Zheyu Zhang, Tianyou Cao, Shawn Tan, Zhenfang Chen, Chuang Gan Pre-print 2023 Building Cooperative Embodied Agents Modularly with Large Language Models Hongxin Zhang, Weihua Du, Jiaming Shan, Qinhong Zhou, Yilun Du, Joshua B. Tenenbaum, Tianmin Shu, Chuang Gan Pre-print 2023 Learning Neural Constitutive Laws from Motion Observations for Generalizable PDE Dynamics Pingchuan Ma, Peter Yichen Chen, Bolei Deng, Joshua B. Tenenbaum, Tao Du, Chuang Gan, Wojciech Matusik ICML 2023 Reparameterized Policy Learning for Multimodal Trajectory Optimization Zhiao Huang, Litian Liang, Zhan Ling, Xuanlin Li, Chuang Gan, Hao Su ICML 2023 (Oral) On the Forward Invariance of Neural ODEs Wei Xiao, Tsun-Hsuan Wang, Ramin Hasani, Mathias Lechner, Yutong Ban, Chuang Gan, Daniela Rus ICML 2023 Roboninja: Learning an Adaptive Cutting Policy for Multi-material Objects Zhenjia Xu, Zhou Xian, Xingyu Lin, Cheng Chi, Zhiao Huang, Chuang Gan†, Shuran Song† RSS 2023 JECC: Commonsense Reasoning Tasks Derived from Interactive Fictions Mo Yu, Yi Gu, Xiaoxiao Guo, Yufei Feng, Xiaodan Zhu, Michael Greenspan, Murray Campbell, Chuang Gan ACL 2023 (Findings) Mod-Squad: Designing Mixture of Experts As Modular Multi-Task Learners Zitian Chen, Yikang Shen, Mingyu Ding, Zhenfang Chen, Hengshuang Zhao, Erik Learned-Miller, Chuang Gan CVPR 2023 3D Concept Learning and Reasoning from Multi-View Images Yining Hong, Chunru Lin, Yilun Du, Zhenfang Chen, Joshua B Tenenbaum, Chuang Gan CVPR 2023 EC^ 2: Emergent Communication for Embodied Control Yao Mu, Shunyu Yao, Mingyu Ding, Ping Luo, Chuang Gan CVPR 2023 Physics-Driven Diffusion Models for Impact Sound Synthesis from Videos Kun Su, Kaizhi Qian, Eli Shlizerman, Antonio Torralba, Chuang Gan CVPR 2023 Visual Dependency Transformers: Dependency Tree Emerges from Reversed Attention Mingyu Ding, Yikang Shen, Lijie Fan, Zhenfang Chen, Zitian Chen, Ping Luo, Joshua B Tenenbaum, Chuang Gan CVPR 2023 Masked Motion Encoding for Self-Supervised Video Representation Learning Xinyu Sun, Peihao Chen, Liangwei Chen, Changhao Li, Thomas H Li, Mingkui Tan, Chuang Gan CVPR 2023 FluidLab: A Differentiable Environment for Benchmarking Complex Fluid Manipulation Zhou Xian, Bo Zhu, Zhenjia Xu, Hsiao-Yu Tung, Antonio Torralba, Katerina Fragkiadaki, Chuang Gan ICLR 2023 (Spotlight) PAC-NeRF: Physics Augmented Continuum Neural Radiance Fields for Geometry-Agnostic System Identification Xuan Li, Yi-Ling Qiao, Peter Yichen Chen, Krishna Murthy Jatavallabhula, Ming Lin, Chenfanfu Jiang, Chuang Gan ICLR 2023 (Spotlight) SoftZoo: A Soft Robot Co-design Benchmark For Locomotion In Diverse Environments Tsun-Hsuan Wang, Pingchuan Ma, Andrew Everett Spielberg, Zhou Xian, Hao Zhang, Joshua B Tenenbaum, Daniela Rus, Chuang Gan ICLR 2023 Planning with Large Language Models for Code Generation Shun Zhang, Zhenfang Chen, Yikang Shen, Mingyu Ding, Joshua B Tenenbaum, Chuang Gan ICLR 2023 DexDeform: Dexterous Deformable Object Manipulation with Human Demonstrations and Differentiable Physics Sizhe Li*, Zhiao Huang*, Tao Chen, Tao Du, Hao Su, Joshua B Tenenbaum, Chuang Gan ICLR 2023 Hyper-Decision Transformer for Efficient Online Policy Adaptation Mengdi Xu, Yuchen Lu, Yikang Shen, Shun Zhang, Ding Zhao, Chuang Gan ICLR 2023 2022 Learning Neural Acoustic Fields Andrew Luo, Yilun Du, Michael J. Tarr, Joshua B. Tenenbaum, Antonio Torralba, Chuang Gan NeurIPS 2022 Learning Physical Dynamics with Subequivariant Graph Neural Networks Jiaqi Han, Wenbing Huang, Hengbo Ma, Jiachen Li, Joshua B. Tenenbaum, Chuang Gan NeurIPS 2022 (Spotlight) 3D Concept Grounding on Neural Fields Yining Hong, Yilun Du, Chunru Lin, Joshua B. Tenenbaum, Chuang Gan NeurIPS 2022 Learning Active Camera for Multi-Object Navigation Peihao Chen, Dongyu Ji, Kunyang Lin, Weiwen Hu, Wenbing Huang, Thomas H Li, Mingkui Tan, Chuang Gan NeurIPS 2022 (Spotlight) Weakly-supervised Multi-granularity Map Learning for Vision-and-Language Navigation Peihao Chen, Dongyu Ji, Kunyang Lin, Runhao Zeng, Thomas H Li, Mingkui Tan, Chuang Gan NeurIPS 2022 (Spotlight) On-Device Training Under 256KB Memory Ji Lin*, Ligeng Zhu*, Wei-Ming Chen, Wei-Chen Wang, Chuang Gan, Song Han NeurIPS 2022 SNAKE: Shape-aware Neural 3D Keypoint Field Chengliang Zhong, Peixing You, Xiaoxue Chen, Hao Zhao, Fuchun Sun, Guyue Zhou, Xiaodong Mu, Chuang Gan, Wenbing Huang NeurIPS 2022 (Spotlight) Noisy Agents: Self-supervised Exploration by Predicting Auditory Events Chuang Gan*, Xiaoyu Chen*, Phillip Isola, Antonio Torralba, Joshua B. Tenenbaum IROS 2022 Embodied Concept Learner: Self-supervised Learning of Concepts and Mapping through Instruction Following Mingyu Ding, Yan Xu, Zhenfang Chen, David Cox, Ping Luo, Joshua B. Tenenbaum, Chuang Gan CORL 2022 Planning with Spatial-Temporal Abstraction from Point Clouds for Deformable Object Manipulation Xingyu Lin*, Carl Qi*, Yunchu Zhang, Zhiao Huang, Katerina Fragkiadaki, Yunzhu Li, Chuang Gan, David Held CORL 2022 Weakly Supervised Grounding for VQA in Vision-Language Transformers Aisha Urooj Khan, Hilde Kuehne, Chuang Gan, Niels Da Vitoria Lobo, Mubarak Shah ECCV 2022 (Oral) Prompting Decision Transformer for Few-shot Policy Generalization Mengdi Xu, Yikang Shen, Shun Zhang, Yuchen Lu, Ding Zhao, Joshua B. Tenenbaum, Chuang Gan ICML 2022 Finding Fallen Objects Via Asynchronous Audio-Visual Integration Chuang Gan*, Yi Gu*, Siyuan Zhou, Jeremy Schwartz, Seth Alter, James Traer, Dan Gutfreund, Joshua B. Tenenbaum, Josh McDermott*, Antonio Torralba* CVPR 2022 Fixing Malfunctional Objects With Learned Physical Simulation and Functional Prediction Yining Hong, Kaichun Mo, Li Yi, Leonidas J. Guibas, Antonio Torralba, Joshua B. Tenenbaum, Chuang Gan CVPR 2022 The ThreeDWorld Transport Challenge: A Visually Guided Task-and-Motion Planning Benchmark Towards Physically Realistic Embodied AI Chuang Gan, Siyuan Zhou, Jeremy Schwartz, Seth Alter, Abhishek Bhandwaldar, Dan Gutfreund, Daniel L.K. Yamins, James J DiCarlo, Josh McDermott, Antonio Torralba, Joshua B. Tenenbaum ICRA 2022 RISP: Rendering-Invariant S",
  "content_length": 32624,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:49"
}