{
  "name": "Chuan Yue",
  "homepage": "https://inside.mines.edu/~chuanyue",
  "status": "success",
  "content": "Chuan Yue | Colorado School of Mines Chuan Yue Chuan Yue ProfessorDepartment of Computer Science About Chuan Yue is a Professor of Computer Science at the Colorado School of Mines (Mines). His current research focuses on Cybersecurity, especially on (1) Web, Mobile, Cloud, CPS/IoT, and AI systems security, (2) usable security and privacy, (3) vulnerability measurement and analysis, and (4) cybersecurity education. His broad research interests include Security and Privacy, Web-based Systems, Human-Computer Interaction, Collaborative Computing, Distributed and Parallel Computing, Cloud Computing, and Mobile Computing. His research and educational activities have been supported by NSF, DOD, and Meta (big thanks!). He is the founder and current point of contact (POC) of the Center for Cyber Security and Privacy (CCSP) at Mines. He is a Daniels Fund Faculty Fellow from 2016 to 2019 (on incorporating ethics instruction into security and privacy courses). He received his B.E. and M.E. degrees in Computer Science from the Xidian University, China, in 1996 and 1999, respectively, and his Ph.D. in Computer Science from the College of William and Mary in 2010. He worked as a Member of Technical Staff at Bell Labs China, Lucent Technologies for four years from 1999 to 2003, mainly on the design and development of the Web-based Distributed Service Management System for Intelligent Network. He worked as an Assistant Professor of Computer Science at the University of Colorado Colorado Springs (UCCS) for five years (and commuted between Denver and Colorado Springs for four years) before joining Mines. Education B.E. in Computer Science, Xidian University, 1996 M.E. in Computer Science, Xidian University, 1999 PhD in Computer Science, College of William and Mary, 2010 Research Cybersecurity Web, Mobile, Cloud, CPS/IoT, and AI Systems Security Usable Security and Privacy Vulnerability Measurement and Analysis Cybersecurity Education Teaching Teaching at Colorado School of Mines (Mines) CSCI 585: Information Security and Privacy, Fall 2020, Fall 2022~2024 CSCI 474/574: Introduction to Cryptography/Theory of Cryptography, Spring 2018~2021, Spring 2023~2025 CSCI 475/585: Information Security and Privacy, Fall 2018~2019 CSCI 585 Online: Information Security and Privacy, Fall 2019 CSCI 474/598: Introduction to Cryptography, Spring 2016~2017 CSCI 475/598: Information Security and Privacy, Fall 2016~2017 CSCI 598: Security & Privacy in Systems, Fall 2015 Previous Teaching at UCCS: 6 courses, 18 times, and an award. Students PhD Students Current PhD Students:  Anhao Xiang, Shane McFly, Jordan Peterson, Thien Ngo Le (co-advising with Dr. Guannan Liu) Graduated PhD Students: Rui Zhao (December 2016; decided to pursue a career in academia.)(Recipient of the 2016 university-level Rath Award for the Best PhD Thesis with the Potential for the Greatest Societal Impact.)(Recipient of the 2015 Outstanding CS PhD Student Award at UCCS.) Matthew Sanders (May 2019; pursued his PhD degree while working full-time in industry, and completed his PhD thesis with high quality.) Yi Qin (May 2021; decided to pursue a career in industry.) Zhiju Yang (August 2021; decided to pursue a career in academia.) Ahmed Alshehri (August 2022; decided to pursue a career in industry.) Weiping Pei (August 2022; decided to pursue a career in academia.)(Recipient of the 2021 Outstanding CS PhD Student Award at Mines.)(Distinguished Nominee of the 2022 university-level Rath Award for the Best PhD Thesis with the Potential for the Greatest Societal Impact.) Mengxia Ren (May 2024; decided to pursue a career in academia in the home country.) Khalid Alkhattabi (August 2024; decided to pursue a career in academia in the home country.) Visiting Scholars Prof. Tao Feng at the Yunnan University of Finance and Economics (July 2017 ~ May 2018) Master Students Current Master Students: TBD Graduated Master Students (at Mines): Kento Okamoto, Ryan Hunt, Michael Hughes, Yanina Likhtenshteyn, Riley Miller, Johnny Zeng,Thien Ngo Le, Leo Chely, Vincent Morgan (co-advised with Dr. Phil Romig), Jaren Peckham (co-advised with Dr. Phil Romig) Graduated Master Students (at UCCS): Jeff Hinson, Christopher Shuster, Derrick Erickson, Anitha Tadimalla, Alex Renger, Xiang Tan, Robert Lancaster Undergraduate Research Assistants (my PhD students help or helped advise most of them.) Sponsoring or Advising Undergraduate Research Assistants in 2024~2025: Isabella Fernandes de Oliveira, Andrew Plute, Madelyn Swelstad, Bethany Boehmer, Miguel Wills, Sam Wells Sponsored or Advised Undergraduate Research Assistants in 2022~2023: Joshua Josey, Austin Getz, Brooke Bowcutt, Lucas Bowar, Hayden Cooreman, Ryan Miller, Tyler Wright Sponsored or Advised Undergraduate Research Assistants in 2021~2022: Joshua Josey, Eugin Pahk, Joseph Spielman, Jacob Parker, Kai Miller, Davita Bird, Christopher Engel, Amiya Prasad Sponsored or Advised Undergraduate Research Assistants in Summer 2021: Luke Beukelman, Leon Wan, Ethan Maestas Sponsored or Advised Undergraduate Research Assistants in 2020~2021: Jhonathan Malagon, Sophia Collins, Max Gawason, James Singleton,Amiya Prasad, Joseph Spielman, Nathan Gavelek, Benjamin Breisch, Christopher Engel, Michelle Torres-Ortiz, Jacob Parker, Eugin Phak, Kai Miller, Davita Bird Sponsored or Advised Undergraduate Research Assistants in Summer 2020: Cole Smith, John Simpson, Elizabeth Holter, Ethan Maestas Sponsored or Advised Undergraduate Research Assistants in 2019~2020: Leo Chely, Andrew Harelson, Kaylynn Tu, Gazi Mahbub-Morshed, Matthew Lynn-goin Sponsored or Advised Undergraduate Research Assistants in 2018~2019: Riley Miller, Jacob Granley, Arthur Mayer, Kaylynn Tu, Andrew Harelson, Nicholas Redhorse, Fisher Darling Sponsored or Advised Undergraduate Research Assistants in 2017~2018: Grant Schmaedick, Riley Miller, Jacob Granley, Jordan Vickers, Arthur Mayer Sponsored or Advised Undergraduate Research Assistants in 2016~2017: Bernardo Trindade, Marcus Tonsmann, John Galbavy, Xiaoyang Liu, Anthony Roebuck Previously Sponsored Undergraduate Research Assistants at UCCS: Stacy Karas, Daniel Six, Aaron Batilo, Christopher Varga, Michael Pease, Joanne Wood High School Research Assistants Advised High School Research Assistants in Summer 2023: Matthew Hu, Aryamann Sheoran, Emilio Leyva (Mengxia Ren helped advise them.) Advised a group of high schoolers including Andrew Plute, Vincent Nguyen, Alexander Bieniek, etc.in our DoD CySP Cyber-REACH 2022 Summer Research Camp (Anhao Xiang, Mengxia Ren, and Weiping Pei helped advise them.) Advised a group of high schoolers including Leah Jo Maloney, Nabil Djaber, John Pumayalli, Abhinav Vemulapalli, Caleb Cox, and Jennifer Lalonein our DoD CySP Cyber-REACH 2021 Summer Research Camp (Mengxia Ren helped advise them.) Advised High School Research Assistants in Summer 2020: Kai Hoshijo, Ava Ward, Dylan Knudsen (Weiping Pei helped advise them.) Advised High School Research Assistants in 2019~2020: Cailean Albert (Ahmed Alshehri helped advise Cailean.) Advised High School Research Assistants in 2017~2018: Sonia Chu (Yi Qin helped advise Sonia.) Selected Publications (full list) Analyzing the Feasibility of Adopting Google’s Nonce-Based CSP Solutions on Websites.By Mengxia Ren, Anhao Xiang, and Chuan Yue. To appear in proceedings of the IEEE/ACM International Conference on Software Engineering (ICSE), 2025. PolicyChecker: Analyzing the GDPR Completeness of Mobile Apps’ Privacy Policies.[pdf]By Anhao Xiang, Weiping Pei, and Chuan Yue. In proceedings of the ACM Conference on Computer and Communications Security (CCS), 2023. A Tale of Two Communities: Privacy of Third Party App Users in Crowdsourcing – The Case of Receipt Transcription.[pdf]By Weiping Pei, Yanina Likhtenshteyn, and Chuan Yue. In proceedings of the ACM on Human-Computer Interaction:ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW), 2023. Coverage and Secure Use Analysis of Content Security Policies via Clustering.[pdf]By Mengxia Ren and Chuan Yue. In proceedings of the IEEE European Symposium on Security and Privacy (Euro S&P), 2023 Exploring the Negotiation Behaviors of Owners and Bystanders over Data Practices of Smart Home Devices.[pdf]By Ahmed Alshehri, Eugin Pahk, Joseph Spielman, Jacob Parker, Benjamin Gilbert, and Chuan Yue.In proceedings of the ACM CHI Conference on Human Factors in Computing Systems (CHI), 2023 Generating Content-Preserving and Semantics-Flipping Adversarial Text.[pdf]By Weiping Pei and Chuan Yue. In proceedings of the ACM ASIA Conference on Computer and Communications Security (AsiaCCS), 2022 Exploring the Privacy Concerns of Bystanders in Smart Homes from the Perspectives of both Owners and Bystanders.[pdf]By Ahmed Alshehri, Joseph Spielman, Amiya Prasad, and Chuan Yue. In proceedings of the Privacy Enhancing Technologies Symposium (PETS), 2022. Fuzzing-Based Hard-Label Black-Box Attacks Against Machine Learning Models.[pdf]By Yi Qin and Chuan Yue. In Journal of Computers & Security (COMPSEC), Elsevier, 117: 102694, 2022. WtaGraph: Web Tracking and Advertising Detection using Graph Neural Networks.[pdf]By Zhiju Yang, Weiping Pei, Monchu Chen, and Chuan Yue. In proceedings of the IEEE Symposium on Security and Privacy (S&P), 2022. Quality Control in Crowdsourcing based on Fine-Grained Behavioral Features.[pdf]By Weiping Pei, Zhiju Yang, Monchu Chen, and Chuan Yue. In proceedings of the ACM on Human-Computer Interaction:ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW), 2021. Attention Please: Your Attention Check Questions in Survey Studies Can Be Automatically Answered.[pdf]By Weiping Pei, Arthur Mayer, Kaylynn Tu, and Chuan Yue. In proceedings of The Web Conference (formerly known as The WWW Conference), 2020. A Comparative Measurement Study of Web Tracking on Mobile and Desktop Environments.[pdf]By Zhiju Yang and Chuan Yue. In proceedings of the Privacy Enhancing Technologies Symposium (PETS), 2020. ",
  "content_length": 16987,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:48"
}