{
  "name": "Chuan Luo 0002",
  "homepage": "https://shi.buaa.edu.cn/chuanluo/en/index.htm",
  "status": "success",
  "content": "åäº¬èªç©ºèªå¤©å¤§å­¦ä¸»é¡µå¹³å°ç³»ç» Chuan Luo--Home--Home LOGIN ä¸­æ Home Research Field Open Course Research Project Paper Honor and Reward Student Information Enrolment Information Chuan Luo Personal InformationMore  >> Associate Professor Main positions:Doctoral Supervisor Profile Chuan Luo is an associate professor and doctoral supervisor at Beihang University. His research interest focuses on constraint solving and he has conducted a series of innovative research work around constraint solving. He has been selected for the Young Elite Scientist Sponsorship Program by China Association for Science and Technology (CAST). He has published more than 50 CCF-A papers. As the principal investigator, he has led multiple research projects, including the project supported by the National Key Research and Development Program of China, the project supported by the National Natural Science Foundation of China, etc. He has won a total of 18 champions in internationally renowned constraint solving competitions (international SAT competition, international SMT competition and international MaxSAT evaluation), including the first championship achieved by participants from Asia. His proposed techniques have been practically utilized by internationally renowned scholars, including a Nobel Prize winner. His research achievements have been applied by leading technology companies, including the State Grid Corporation of China, China Aerospace Science and Industry Corporation Limited, Huawei, and Microsoft, effectively enhancing the performance and reliability of critical system software. Personal Homepage: https://chuanluocs.github.io/ Educational Experience Work Experience Social Affiliations Research Focus Copyright Â© 2022 Beihang University. All rights reserved.Address: 37 Xueyuan Road, Haidian District, Beijing, P.R. China, 100191.Tel: +86-10-82317114Click : times MOBILE Version Open time:.. The Last Update Time:.. Mobile phone sweep",
  "content_length": 1964,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:45"
}