{
  "name": "Chuan Wu 0001",
  "homepage": "https://i.cs.hku.hk/~cwu",
  "status": "success",
  "content": "Chuan Wu: Home Navigation Home Research Publications Teaching Bio & CV Our Team Professor BEng, MEng (Tsinghua); PhD (Toronto) IEEE Fellow ACM Distinguished Member Department of Computer Science The University of Hong Kong I am a Professor in the Department of Computer Science, School of Computing and Data Science, at The University of Hong Kong. I received my Ph.D. degree from the Department of Electrical and Computer Engineering in the University of Toronto, Canada, and both my M.Engr. and B.Engr. degrees from the Department of Computer Science and Technology in Tsinghua University, China. Research Interest My current research interests span cloud computing, distributed machine learning systems, distributed learning algorithms, and intelligent technologies for elderly care. My research features performance modeling and algorithm design for various network systems using optimization and machine learning methods, as well as the design and implementation of various systems based on relevant methods. Please see my research projects and publications for more details. Contact Email: cwu@cs.hku.hk Phone: (852) 2857 8459 Fax: (852) 2559 8447 Office: Room 427, Chow Yei Ching Building Mailing address: Department of Computer Science The University of Hong Kong Pokfulam Road Hong Kong News **I am looking for self-organized, well-motivated PhD students, postdoc researchers and RAs (anytime) to work on a variety of topics in distributed machine learning algorithms and systems, and NLP/LLM for cognitive stimulation and psychotherapy. Candidates with solid background and/or strong interest in mathematical modeling/analysis, and candidates with solid programming skills and/or strong interest in building systems and innovation/entrepreneurship are all very welcome. Please contact me by email with your CV (please include your GPA and rank). ** [July 12, 2025] Two papers first-authored by Chenyu and Borui, respectively, are accepted to SOSP 2025. Congratulations! [May 1, 2025] Junwei's two papers are accepted to ICML 2025. Congratulations! [March 27, 2025] Guicheng's first paper \"ECCheck: Enhancing In-Memory Checkpoint with Erasure Coding in Distributed DNN Training\" is accepted to IEEE ICDCS 2025. Congratulations! [January 13, 2025] Sheng's paper \"MoS: Unleashing Parameter Efficiency of Low-Rank Adaptation with Mixture of Shards\" is accepted to ICLR 2025. Congratulations! [December 12, 2024] Borui's paper \"A Unified Checkpointing System for Large Foundation Model Development\" is accepted to NSDI 2025. Congratulations! [December 6, 2024] Mengfan's paper \"Optimizing Distributed Deployment of Mixture-of-Experts Model Inference in Serverless Computing\" is accepted to INFOCOM 2025. Congratulations! [September 26, 2024] Xiaoyang's paper \"FaPES: Enabling Efficient Elastic Scaling for Serverless Machine Learning Platforms\" is accepted to ACM SOCC 2024. Congratulations! [August 21, 2024] Guangming's paper \"HybridFlow: A Flexible and Efficient RLHF Framework\" is accepted to EuroSys 2025. Congratulations! [May 16, 2024] Sheng's two papers are accepted to ACL 2024. Congratulations! [Apr 13, 2024] Xiaoyang's paper \"AdapCC: Making Collective Com- munication in Distributed Machine Learning Adaptive\" is accepted to IEEE ICDCS 2024. Congratulations! [Feb 24, 2024] Two papers from our group are accepted to MLSys 2024! [Jan 16, 2023] Junwei's paper \"PRES: Toward Scalable Memory-Based Dynamic Graph Neural Networks\" has been accepted to ICLR 2024. Congratulations! [Sep 12, 2023] Three papers from our group are accepted to EuroSys 2024! [April 25, 2023] Junwei's paper \"Towards Robust Graph Incremental Learning on Evolving Graphs\" has been accepted to ICML 2023. Congratulations! [February 18, 2023] Borui and Juntao's paper \"Adaptive Message Quantization and Parallelization for Distributed Full-graph GNN Training\" has been accepted to MLSys 2023. Congratulations! [December 2, 2022] Zhe and Ziyue's paper \"Two-level Graph Caching for Expediting Distributed GNN Training\" has been accepted to IEEE INFOCOM 2023. Congratulations! [October, 2022] Ziyue Luo has graduated with Ph.D. and joined Ohio State University as a postdoc researcher. Congratulations! [Sep 15, 2022] Yangrui's paper \"SAPipe: Staleness-Aware Pipeline for Data Parallel DNN Training\" has been accepted to NeurIPS 2022. Congratulations! [Sep 6, 2022] Shiwei's paper \"Accelerating Large-Scale Distributed Neural Network Training with SPMD Parallelism\" has been accepted to ACM SOCC 2022. Congratulations! [September, 2022] Bingqian Du has graduated with Ph.D. and joined Huazhong University of Science and Technology as an assistant professor. Congratulations! [Jul 9, 2022] Yangrui's paper \"BGL: GPU-Efficient GNN Training by Optimizing Graph Data I/O and Preprocessing\" (co-first-authored with Tsinghua collaborator) has been accepted to USENIX NSDI 2023. Congratulations! [Jan 15, 2022] Hanpeng, Yuchen and Chenyu's paper \"A Generic Performance Diagnosis and Optimization Toolkit for Expediting Distributed DNN Training\" has been accepted to MLSys 2022. Congratulations! [December 4, 2021] Ziyue's two papers have been accepted to IEEE INFOCOM 2022. Congratulations! [August, 2021] Xiaodong Yi has graduated with Ph.D. and joined Tencent in Shenzhen as an AI technology researcher. Congratulations! [March 25, 2021] I received an Amazon Research Award for carrying out research on compilation optimization in distributed DNN training 😃 [December 5, 2020] Zhe's first paper \"Near-Optimal Topology-adaptive Parameter Synchronization in Distributed DNN Training\" has been accepted to IEEE INFOCOM 2021. Congratulations! [November 16, 2020] Yixin Bao has graduated with Ph.D. and joined Facebook at Seattle, U.S., as a research scientist. Congratulations! [October 28, 2020] Xiaodong, Shiwei and Ziyue's paper \"Optimizing Distributed Training Deployment in Heterogeneous GPU Clusters\" has been accepted to ACM CoNEXT 2020. Congratulations! [August 28, 2020] Xiaodong and Ziyue's paper \"Fast Training of Deep Learning Models over Multiple GPUs\" has been accepted to ACM/IFIP Middleware 2020. Congratulations! [August 9, 2020] Yangrui, Yanghua and Yixin's paper \"Elastic Parameter Server Load Distribution in Deep Learning Clusters\" has been accepted to ACM SOCC'20. Congratulations! © 2007-2025 Chuan Wu. Last updated July 2025.",
  "content_length": 6322,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:45"
}