{
  "name": "Chuan Lu",
  "homepage": "https://www.aber.ac.uk/en/cs/staff-profiles/listing/profile/cul",
  "status": "success",
  "content": "Staff profiles  :\t\tDepartment of Computer Science ,\t\tAberystwyth UniversityDr Chuan Lu BEng (Tianjin, China), MSc (Leuven, Belgium), PhD(Leuven) Senior Lecturer in Bioinformatics Department of Computer Science Contact Details Email: cul@aber.ac.uk ORCID: 0000-0002-4898-6679 Office: E43, Llandinam Building Phone: +44 (0) 1970 628405 Google Scholar: https://scholar.google.co.uk/citations?user=tvY6seQAAAAJ Research Portal Profile Teaching Module Coordinator CS27020 - Modelling Persistent Data CC27020 - Modelu Data Parhaus Lecturer CSM9060 - Dissertation CS39440 - Major Project CS27020 - Modelling Persistent Data CHM9360 - MSC Project Moderator CSM6720 - Advanced Data Analytics CS10720 - Problems and Solutions Coordinator CS27020 - Modelling Persistent Data CC27020 - Modelu Data Parhaus Research Groups Bioinformatics and Computational Biology Group Publications van Vliet, LJJ, Atkins, K, Kurup, S, Siles, L, Hepworth, J, Corke, FMK, Doonan, JH & Lu, C 2025, 'DeepCanola: Phenotyping brassica pods using semi-synthetic data and active learning', Computers and Electronics in Agriculture, vol. 237, 110470. 10.1016/j.compag.2025.110470Atkins, K, Garzon-Martinez, GA, Lloyd, A, Doonan, JH & Lu, C 2025, 'Unlocking the power of AI for phenotyping fruit morphology in Arabidopsis', GigaScience, vol. 14, giae123. 10.1093/gigascience/giae123Msonda, J, He, Z & Lu, C 2023, 'Graph Attention Based Spatial Temporal Network for EEG Signal Representation', Paper presented at The 22nd UK Workshop on Computational Intelligence, Birmingham, United Kingdom of Great Britain and Northern Ireland, 06 Sept 2023 - 08 Sept 2023.Bloor, D, Ugwuoke, NV, Taylor, D, Lewis, K, Mur, L & Lu, C 2023, 'Towards a Personal Health Knowledge Graph Framework for Patient Monitoring', Paper presented at CONFERENCE ON COMPUTATIONAL INTELLIGENCE METHODS FOR BIOINFORMATICS & BIOSTATISTICS, Padova, Italy, 06 Sept 2023 - 08 Sept 2023.Xu, Y, Liu, X, Cao, X, Huang, C, Liu, E, Qian, S, Liu, X, Wu, Y, Dong, F, Qiu, CW, Qiu, J, Hua, K, Su, W, Wu, J, Xu, H, Han, Y, Fu, C, Yin, Z, Liu, M, Roepman, R, Dietmann, S, Virta, M, Kengara, F, Zhang, Z, Zhang, L, Zhao, T, Dai, J, Yang, J, Lan, L, Luo, M, Liu, Z, An, T, Zhang, B, He, X, Cong, S, Liu, X, Zhang, W, Lewis, JP, Tiedje, JM, Wang, Q, An, Z, Wang, F, Zhang, L, Huang, T, Lu, C, Cai, Z, Wang, F & Zhang, J 2021, 'Artificial intelligence: A powerful paradigm for scientific research', The Innovation, vol. 2, no. 4, 100179. 10.1016/j.xinn.2021.100179, 10.1016/j.xinn.2021.100179More publications on the Research Portal",
  "content_length": 2542,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:46"
}