{
  "name": "Chuan Xiao 0001",
  "homepage": "https://sites.google.com/site/chuanxiao1983",
  "status": "success",
  "content": "Chuan XiaoSearch this siteEmbedded FilesSkip to main contentSkip to navigationChuan XIAO Associate ProfessorOsaka University / Nagoya UniversityEmail: chuanx [at] nagoya-u.jpPhone: +81-6-6105-6502 Address:Graduate School of Information Science and TechnologyOsaka University1-5, Yamadaoka, Suita, Osaka 565-0871Japan[DBLP Entry] [Google Scholar]NewsLFP: We introduced the task of legal fact prediction and constructed a dataset for 657 litigation cases in China, covering 10 representative types of civil cases. The paper is to appear at EMNLP 2025. [benchmark] SAS: We are excited to announce the launch of SAS (Smart Agent Survey), a software designed for automated surveys utilizing LLM agents. Users can upload their questionnaires in various formats (DOCX, PDF, etc.). The software employs LLM agents to simulate respondent answers, making it a valuable tool for marketing strategies and policy-making. We argue that LLM-based social simulations need clear boundaries to meaningfully contribute to social science research.We analyze 7 security challenges that must be solved in cross-domain multi-agent LLM systems.We study the probabilistic kernel functions for fast angle testing and use them for MIPS and ANNS.ESG: We propose a solution to range-filtering ANNS.VLM & LLM fusion: We are excited to share some fascinating discoveries on combining Vision-Language Models (VLMs) with large language models (LLMs).Truth-Shapley: We investigated data overvaluation attack in federated learning and proposed a data valuation metric as a solution to truthful data valuation.Short BiographyI am an associate professor with the Big Data Engineering Laboratory at Osaka University and a guest associate professor with the Database Laboratory at Nagoya University.  I graduated from the University of New South Wales in 2010, under the supervision of Xuemin Lin and Wei Wang. ResearchMy research interests focus on AI, NLP, computer simulation, data science, and data management. In detail, I explore the following research fields: Agent-based modelingComputational social scienceLegal AIEmergent languageData lakesGoogle SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2159,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:45"
}