{
  "name": "Chuan Shi 0001",
  "homepage": "http://www.shichuan.org",
  "status": "success",
  "content": "ShiChuan @ BUPT Brief Bio I'm the professor and PhD supervisor in School of Computer Sciences of Beijing University of Posts and Telecommunications, deputy director of Beijing Key Lab of Intelligent Telecommunication Software and Multimedia. The main research interests include data mining, machine learning, artificial intelligence and big data analysis. I have published more than 100 refereed papers, including top journals and conferences in data mining and machine learning, such as IEEE TKDE, ACM TKDD, KDD, WWW, NeurIPS, AAAI and IJCAI. I have been honored as the best paper award in ADMA 2011/ADMA 2018 and the best paper nomination in the WebConf 2021. I also won several awards, such as the second prize of Natural Science of Beijing/CCF (1st), the first prize of artificial intelligence science and technology progress of Wu Wenjun (3rd) and the first prize of science and technology progress of the Chinese Institute of Electronics (1st). Research Interests Data mining and machine learning, especially focusing on graph data, including: Heterogeneous information network analysis Graph neural network Recommender system Knowledge graph Multi-objective machine learning Education Department of Computer Sciences, University of Illinois at Chicago Oct. 2010 - Oct. 2011 Post-doctor in Data Mining;    Advisor: Prof. Philip S. Yu Institute of Computing Technology, Chinese Academy of Sciences Sep. 2004 - Jun. 2007 Ph.D in Computer Software and Theory;    Advisor: Prof. Zhongzhi Shi School of Computer Sciences, Wuhan University Sep. 2001 - Jun. 2004 M.Sc in Computer Software and Theory;    Advisor: Prof. Lishan Kang School of Computer Sciences, Jilin University Sep. 1997 - Jun. 2001 B.S in Computer Science and Technology Academic Experience Professor School of Computer Sciences, Beijing University of Posts and Telecommunications, Beijing, China Nov. 2014 â Present Associate Professor School of Computer Sciences, Beijing University of Posts and Telecommunications, Beijing, China Nov. 2009 â Nov. 2014 Assistant Professor School of Computer Sciences, Beijing University of Posts and Telecommunications, Beijing, China Jun. 2007 â Nov. 2009 Services and Talking Talks WWW24_Tutorial: Towards Graph Foundation Models [Part I] [Part II] [Part III] Graph Structure Learning [pdf] å¾ç¥ç»ç½ç»çè®¾è®¡ç©ºé´ä¸å¼æºå®è·µ [pdf] å¼æ¾ç¯å¢ä¸å¾ç¥ç»ç½ç»ä¸åºç¨ [pdf] Graph Pre-training [pdf] Learning Mechanism of Graph Neural Network [pdf] ADL22-å¼è´¨å¾ç¥ç»ç½ç»: æ¨¡åãé¢è®­ç»ä¸åºç¨ [Introduction] [Model] [Pretraining] [Application] [Conclusion] KDD21_Tutorial: Heterogeneous Graph Neural Network Concepts, Models and Applications [pdf] CIKM19_Tutorial: Recent Developments of Deep Heterogeneous Information Network Analysis [Part I] [Part II] [Part III] [Part IV] [Part V] åºäºå¼è´¨ä¿¡æ¯ç½ç»çæ¨èè®²ä¹ æ¥å: Heterogeneous Information Network based Recommendation [pdf] Services Organizer of a serial of HENA workshops (\"Heterogeneous information network analysis and applications\") held by KDD21, CIKM19 et al. Organizer of a serial of MuNFA workshops (âMulti-view Network Fusion and Analysisâ) held by IEEE DSC. Organizer of a serial of Social Network Analysis and Mining workshops held by CCDM and CCFAI. PC Chair of SMP2021, Area Chair of SMP2017 and CCKS19. Workshop in Netscix 2018: Invited talk: Heterogeneous information network based recommendation. CCF ADL 2017: Invited talk: Heterogeneous Information Network Modelling and Analysis. Social Computing Submit 2016: Keynote speech \"Heterogeneous Information Network Analysis and Applications\". ECOLE 2015: Keynote speech \"Evolutionary Multi-objective Machine Learning\". IEEE / ACM Member, Member of China Computer Federation; Senior Member of Chinese Association for Artificial Intelligence. Youth AE of SCI journal \"Frontiers of Computer Science\", Initial Editor of ãAnnual Review of Artificial Intelligenceã. Reviewer of international journals including IEEE TPAMIï¼IEEE TKDE, IEEE TKDD, IEEE TPDS, ACM TIST, PLOS et al.; (senior) PC Member of conferences including KDD, WWW, ACL, AAAI, IJCAI et al.; Reviewer of NFSC proposals. Open-source Projects All open-source code for publications [website] OpenHGNN: OpenHGNN is an open source heterogeneous graph neural network toolkit based on Deep Graph Library (DGL) and PyTorch, which integrates SOTA models for heterogeneous graphs. OpenHGNN provides easy-to-use and extensible APIs, helping researchers and engineers to conduct research and applications on heterogeneous graphs fast. [website] GammaGL: GammaGL is a multi-backend library for Graph Neural Networks, which supports TensorFlow, PyTorch, PaddlePaddle and MindSpore. Users can run the same code on different deep learning backends and use tensor-centric programming style like Pytorch Geometric (PyG). [website] Selected Publications [Sort by Topic] Books ç³å·, çå¸, Philip S. Yu. å¼è´¨å¾è¡¨ç¤ºå­¦ä¹ ä¸åºç¨. æºæ¢°å·¥ä¸åºçç¤¾. ISBN 9787111711384. 2022. ç³å·, æ¨æï¼è¯ï¼. ç¥ç»ç½ç»ä¸æ·±åº¦å­¦ä¹ . æºæ¢°å·¥ä¸åºçç¤¾. ISBN 978711686859. 2021. Chuan Shi, Xiao Wang, Cheng Yang. Advances in Graph Neural Networks. Springer. 978-3-031-16173-5. 2022. Preprint. [preface] [ch1] [ch2] [ch3] [ch4] [ch5] [ch6] [ch7] [ch8] [ch9] Chuan Shi, Xiao Wang, Philip S. Yu. Heterogeneous Graph Representation Learning and Applications. Springer. 978-981-16-6166-2. 2022. Preprint. [preface] [ch1] [ch2] [ch3] [ch4] [ch5] [ch6] [ch7] [ch8] [ch9] [ch10] [ch11] Chuan Shi, Philip S. Yu. Heterogeneous Information Network Analysis and Applications. Springer. ISBN 978-3-319-56211-7. 2017. [preface] [ch1] [ch2] [ch3] [ch4] [ch5] [ch6] [ch7] [ch8] [ch9] Cheng Yangï¼Zhiyuan Liuï¼Cunchao Tuï¼Chuan Shiï¼Maosong Sun. Network Embedding: Theories, Methods, and Applications. Morgan & Claypool Publishers. ISBN-13:â 978-1636390444. 2021.3. è¡ç³æ¢ ï¼ç³å·ï¼è¯ï¼. å¼è´¨ä¿¡æ¯ç½ç»åæä¸åºç¨. æºæ¢°å·¥ä¸åºçç¤¾. 2021.3. ææºç¾¤ï¼éæ¾æï¼ç³å·è. å¤§è§æ¨¡ç¤¾ä¼ç½ç»ç¤¾åºåç°å¹¶è¡è®¡ç®çè®ºä¸æ¹æ³. å µå¨å·¥ä¸åºçç¤¾. 2021.7. ç³å·ï¼çå¸ï¼è¡ç³æ¢ ç¼è. æ°æ®ç§å­¦å¯¼è®º. æ¸ åå¤§å­¦åºçç¤¾. 2021.4. æ¨å¨, ç³å·, çæ. å½¢å¼è¯­è¨ä¸èªå¨æº(ç¬¬äºç). åäº¬é®çµå¤§å­¦åºçç¤¾. ISBN 978-7-5635-4997-9. 2017. çæ¸©ä½³, ååå¼º, ç³å·. ç¨æ·ç½ç»è¡ä¸ºç»å. ä¸­å½å·¥ä¿¡åºçéå¢ & çµå­å·¥ä¸åºçç¤¾. ISBN 978-7-121-28070-2. 2016. Book Chapters Chuan Shi. Heterogeneous graph neural network, book chapter in âGraph Neural Networks: Foundations, Frontiers, and Applicationsâ. Springer. ISBN: 978-981-16-6054-2. 2022. [Chapter16] Chuan Shi. Chapter 24: Evolutionary Multi-Objective Optimization for Supervised Learning. In: Ying Tan. Swarm Intelligence - From Concepts to Applications. IET. ISBN 978-1-78561-313-5. 2017. [book info] Papers[Google Scholar][DBLP] Yufei Peng, Cheng Yang, Zhengjie Fan, Chuan Shi. Data-centric Prompt Tuning for Dynamic Graphs. CIKM 2025 Best paper award [pdf] [code & data] Yujie Xing, Xiao Wang, Bin Wu, Hai Huang, Chuan Sh. Unifying and Enhancing Graph Transformers via a Hierarchical Mask Framework. NeurIPS 2025 [pdf] [code & data] Boyu Chen, Zirui Guo, Zidan Yang, Yuluo Chen, Junze Chen, Zhenghao Liu, Chuan Shi, Cheng Yang. PathRAG: Pruning Graph-Based Retrieval Augmented Generation with Relational Paths. AAAI 2026 [pdf] [code & data] Junze Chen, Xinjie Yang, Cheng Yang, Junfei Bao, Zeyuan Guo, Yawen Li, Chuan Shi. CORONA: A Coarse-to-Fine Framework for Graph-based Recommendation with Large Language Models. SIGIR 2025 [pdf] [code & data] Ting Bai, Le Huang, Yue Yu, Cheng Yang, Cheng Hou, Zhe Zhao, Chuan Shi. Efficient Multi-task Prompt Tuning for Recommendation. TOIS 2025 [pdf] [code & data] Mingyu Zhao, Jiawei Liu, Jianwang Zhai, Chuan Shi. MILS: Modality Interaction Driven Learning for Logic Synthesis. GLSVLSI 2025 [pdf] [code & data] Yang Liu, Deyu Bo, Wenxuan Cao, Yuan Fang, Yawen Li, Chuan Shi. Graph Positional Autoencoders as Self-supervised Learners. KDD 2025 [pdf] [code & data] Yibo Li, Yuan Fang, Mengmei Zhang, Chuan Shi. Advancing Molecular Graph-Text Pre-training via Fine-grained Alignment. KDD 2025 [pdf] [code & data] Junze Chen, Cheng Yang, Shujie Li, Zhiqiang Zhang, Yawen Li, Junping Du, Chuan Shi. GraphLAMA: Enabling Efficient Adaptation of Graph Language Models with Limited Annotations. KDD 2025 [pdf] [code & data] Chengdong Yang, Hongrui Liu, Daixin Wang, Zhiqiang Zhang, Cheng Yang, Chuan Shi. FLAG: Fraud Detection with LLM-enhanced Graph Neural Network KDD 2025 [pdf] [code & data] Jinyu Yang, Liangwei Yang, Zeyuan Guo, Jiayi Gao, Jing Wu, Tianhao Chai, Hai Huang, Cheng Yang, Chuan Shi. Benchmarking Graph Foundation Models. KDD 2025 [pdf] [code & data] Ting Bai, Weijie Chen, Cheng Yang and Chuan Shi. Invariant Debiasing Learning for Recommendation via Biased Imputation. IPM 2025 [pdf] Weijie Chen, Ting Bai, Jinbo Su, Jian Luan, Wei Liu, Chuan Shi. KG-Retriever: Efficient Knowledge Indexing for Retrieval-Augmented Large Language Models. arXiv 2025 [pdf] Jiawei Liu, Cheng Yang, Zhiyuan Lu, Junze Chen, Yibo Li, Mengmei Zhang, Ting Bai, Yuan Fang, Lichao Sun, Philip S. Yu, and Chuan Shi. Graph Foundation Models: Concepts, Opportunities and Challenges. TPAMI 2025 [pdf] Jiawei Liu, Zhiyan Liu, Xun He, Jianwang Zhai, Zhengyuan Shi, Qiang Xu, Bei Yu, Chuan Shi. WideGate: Beyond Directed Acyclic Graph Learning in Subcircuit Boundary Prediction. DATE 2025 [pdf] [code & data] Jinyu Yang, Ruijia Wang, Cheng Yang, Bo Yan, Qimin Zhou, Yang Juan, Chuan Shi. Harnessing Language Model for Cross-Heterogeneity Graph Knowledge Transfer. AAAI 2025 [pdf] [code & data] Feng Guo, Yueyue Xi, Jianwang Zhai, Jingyu Jia, Jiawei Liu, Kang Zhao, Chuan Shi. IRGNN: A Graph-based Framework Integrating Numerical Solution and Point Cloud for Static IR Drop Prediction. DAC 2025 [pdf] [code & data] Yuxia Wu, Shujie Li, Yuan Fang, Chuan Shi. Exploring the Potential of Large Language Models for Heterophilic Gr",
  "content_length": 46782,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:45"
}