{
  "name": "Chul-Ho Lee",
  "homepage": "https://sites.google.com/site/chulholeesite",
  "status": "success",
  "content": "Chul-Ho Lee's HomepageSearch this siteEmbedded FilesSkip to main contentSkip to navigation    Chul-Ho Lee    Department of Computer Science    Texas State University    Comal 311G    601 University Drive, San Marcos, Texas 78666    Phone: (512) 245-6580    Email: chulho_dot_lee_at_txstate_dot_eduI am currently an Associate Professor in the Department of Computer Science at Texas State University, San Marcos, TX. Prior to joining Texas State, I was an Assistant Professor in the Department of Computer Engineering and Sciences (now the Department of Electrical Engineering and Computer Science) at the Florida Institute of Technology, Melbourne, FL, and a Senior Research Engineer at Samsung Electronics DMC R&D Center (now Samsung Research), South Korea. I received my Ph.D. degree in Computer Engineering from North Carolina State University, Raleigh, NC. My research interests are in network/data science, machine learning, networking, and systems. My recent research focuses on (1) developing efficient algorithms and computational tools for large-scale graph mining and network analysis, and (2) leveraging and advancing machine learning techniques for mobile, IoT and other applications. My research has been supported by funding agencies and industry partners including the National Science Foundation, NVIDIA, and SK Hynix America.TeachingCS 5329 Algorithm Design and AnalysisCS 7315 Network ScienceSelected/Recent Publications (Recent preprints and other papers can be found in DBLP or Google Scholar)Graph/Deep Neural Networks: Efficiency, Training, and Inference[NeurIPS]  TAMI: Taming Heterogeneity in Temporal Interactions for Temporal Graph Link PredictionZhongyi Yu, Jianqiu Wu, Zhenghao Wu, Shuhan Zhong, Weifeng Su, Chul-Ho Lee, Weipeng Zhuo39th Annual Conference on Neural Information Processing Systems (NeurIPS), 2025. (Acceptance rate: 5290/21575 = 24.52%)[BigData]  SDT-GNN: Streaming-based Distributed Training Framework for Graph Neural NetworksXin Huang, Weipeng Zhuo, Minh Phu Vuong, Shiju Li, Jongryool Kim, Brad Rees, Chul-Ho Lee13th IEEE International Conference on Big Data (BigData), 2025. (Acceptance rate: 140/746 = 18.7%)* This is an extension of the work in arXiv:2404.02300.[ICDCS]  Demystifying Distributed Training of Graph Neural Networks for Link PredictionXin Huang, Chul-Ho Lee45th IEEE International Conference on Distributed Computing Systems (ICDCS), 2025. (Acceptance rate: 104/529 = 19.66%)[CVPR]  Run, Don't Walk: Chasing Higher FLOPS for Faster Neural NetworksJierun Chen, Shiu-hong Kao, Hao He, Weipeng Zhuo, Song Wen, Chul-Ho Lee, S.-H. Gary ChanIEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2023. (Acceptance rate: 2360/9155 = 25.78%)*One of the top-100 most cited AI papers in 2023[Euro-Par]  Computational Storage for an Energy-Efficient Deep Neural Network Training SystemShiju Li, Kevin Tang, Jin Lim, Chul-Ho Lee, Jongryool Kim29th International European Conference on Parallel and Distributed Computing (Euro-Par), 2023. (Acceptance rate: 49/164 = 29.87%)[IISWC]  Characterizing the Efficiency of Graph Neural Network Frameworks with a Magnifying GlassXin Huang, Jongryool Kim, Brad Rees, Chul-Ho LeeIEEE International Symposium on Workload Characterization (IISWC), 2022.Graph/Deep Neural Networks for Mobile/IoT/Other Applications[IMWUT/UbiComp]  Graph-based Fingerprint Update Using Unlabelled WiFi SignalsKa Ho Chiu, Handi Yin, Weipeng Zhuo, Chul-Ho Lee, S.-H. Gary Chan Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT), Vol. 9, No. 1, Article 3, March 2025;ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp), 2025.M3-Impute: Mask-guided Representation Learning for Missing Value ImputationZhongyi Yu, Zhenghao Wu, Shuhan Zhong, Weifeng Su, S.-H. Gary Chan, Chul-Ho Lee, Weipeng Zhuo arXiv preprint, 2024.[TMC]  Online Path Description Learning based on IMU Signals from IoT DevicesWeipeng Zhuo, Shiju Li, Tianlang He, Mengyun Liu,  S.-H. Gary Chan, Sangtae Ha, Chul-Ho LeeIEEE Transactions on Mobile Computing (TMC), Vol. 23, No. 12, pp. 11889-11906, Dec. 2024.[ICDE]  Semi-supervised Learning with Network Embedding on Ambient RF Signals for Geofencing ServicesWeipeng Zhuo, Ka Ho Chiu, Jierun Chen, Jiajie Tan, Edmund Sumpena, S.-H. Gary Chan, Sangtae Ha, Chul-Ho Lee39th IEEE International Conference on Data Engineering (ICDE), 2023.[Technical Report][ICDCS]  FIS-ONE: Floor Identification System with One Label for Crowdsourced RF SignalsWeipeng Zhuo, Ka Ho Chiu, Jierun Chen, Ziqi Zhao, S.-H. Gary Chan, Sangtae Ha, Chul-Ho Lee43rd IEEE International Conference on Distributed Computing Systems (ICDCS), 2023. (Acceptance rate: 83/439 = 18.9%)[ICDCS]  GRAFICS: Graph Embedding-based Floor Identification Using Crowdsourced RF SignalsWeipeng Zhuo, Ziqi Zhao, Ka Ho Chiu, Shiju Li, Sangtae Ha, Chul-Ho Lee, S.-H. Gary Chan42nd IEEE International Conference on Distributed Computing Systems (ICDCS), 2022. (Acceptance rate: 114/573 = 19.9%)[KDD]  CrowdQuake: A Networked System of Low-Cost Sensors for Earthquake Detection via Deep LearningXin Huang*, Jangsoo Lee*, Young-Woo Kwon, Chul-Ho Lee26th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD), 2020. (Acceptance rate: 121/756 = 16%)Graph Mining and Network Analysis[WSDM]  Efficient Monte Carlo Algorithms for Approximating Katz Centrality on Large Graphs Garrett Cornett, Minh Phu Vuong, Chul-Ho Lee19th ACM International Conference on Web Search and Data Mining (WSDM), Short Paper Track, 2026.  (Acceptance rate: 47/132 = 35%)[IA3]  eIM: GPU-Accelerated Efficient Influence Maximization in Large-Scale Social NetworksJacob Doney, Xin Huang, Chul-Ho Lee15th Workshop on Irregular Applications: Architectures and Algorithms (IA3), 2025, in conjunction with SC25.[CIKM]  FairAD: Computationally Efficient Fair Graph Clustering via Algebraic Distance Minh Phu Vuong, Young-Ju Lee, Iván Ojeda-Ruiz, Chul-Ho Lee34th ACM International Conference on Information and Knowledge Management (CIKM), 2025. (Acceptance rate: 443/1627 = 27.2%)[MASS]  Effective Delayed Patching for Transient Malware Control on Networks Minh Phu Vuong, Chul-Ho Lee, Do Young Eun22nd IEEE International Conference on Mobile Ad Hoc and Smart Systems (MASS), 2025. (Acceptance rate: 29.6%)[Networking]  Controlling Epidemic Spread Under Immunization Delay Constraints Shiju Li, Xin Huang, Chul-Ho Lee, Do Young Eun22nd IFIP International Conference on Networking (Networking), 2023. (Acceptance rate: 53/190 = 27.89%)[KDD]  An Efficient and Scalable Algorithm for Estimating Kemeny's Constant of a Markov Chain on Large GraphsShiju Li*, Xin Huang*, Chul-Ho Lee27th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD), 2021. (Acceptance rate: 238/1541 = 15.44%)[Networking]  Estimating Distributions of Large Graphs from Incomplete Sampled DataShiju Li, Xin Huang, Chul-Ho Lee20th IFIP International Conference on Networking (Networking), 2021. (Acceptance rate: 41/158 = 25.9%)[Technical Report][CIKM]  Trapping Malicious Crawlers in Social NetworksShiju Li, Chul-Ho Lee, Do Young Eun29th ACM International Conference on Information and Knowledge Management (CIKM), 2020. (Acceptance rate: 193/920 = 20.97%)[Technical Report][MobiHoc]  Transient Dynamics of Epidemic Spreading and Its Mitigation on Large NetworksChul-Ho Lee, Srinivas Tenneti, Do Young Eun20th ACM International Symposium on Mobile Ad Hoc Networking and Computing (MobiHoc), 2019. (Acceptance rate: 37/156 = 23.71%)Best Paper Award Finalist[Technical Report][POMACS/SIGMETRICS]  Non-Markovian Monte Carlo on Directed GraphsChul-Ho Lee, Min Kang, Do Young EunProceedings of the ACM on Measurement and Analysis of Computing Systems (POMACS), Vol. 3, No. 1, Article 15, March 2019;ACM SIGMETRICS International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), 2019. (Acceptance rate: 50/317 = 15.77%)[INFOCOM]  On the Rao-Blackwellization and Its Application for Graph Sampling via Neighborhood ExplorationChul-Ho Lee, Xin Xu, Do Young Eun36th IEEE International Conference on Computer Communications (INFOCOM), 2017. (Acceptance rate: 292/1395 = 20.93%)[Technical Report][INFOCOM]  Challenging the Limits: Sampling Online Social Networks with Cost ConstraintsXin Xu, Chul-Ho Lee, Do Young Eun36th IEEE International Conference on Computer Communications (INFOCOM), 2017. (Acceptance rate: 292/1395 = 20.93%)[Technical Report][INFOCOM]  On the Efficiency-Optimal Markov Chains for Distributed Networking ApplicationsChul-Ho Lee, Do Young Eun34th IEEE International Conference on Computer Communications (INFOCOM), 2015. (Acceptance rate: 316/1640 = 19.3%)[INFOCOM]  A General Framework of Hybrid Graph Sampling for Complex Network AnalysisXin Xu, Chul-Ho Lee, Do Young Eun33rd IEEE International Conference on Computer Communications (INFOCOM), 2014. (Acceptance rate: 320/1645 = 19.45%)[SIGMETRICS]  Beyond Random Walk and Metropolis-Hastings Samplers: Why You Should Not Backtrack for Unbiased Graph SamplingChul-Ho Lee, Xin Xu, Do Young EunACM SIGMETRICS International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS), 2012. (Acceptance rate: 31/203 = 15.27%)[Technical Report]Wireless and Mobile Networking[ToN]  A High-Order Markov-Chain-Based Scheduling Algorithm for Low Delay in CSMA NetworksJaewook Kwak, Chul-Ho Lee, Do Young EunIEEE/ACM Transactions on Networking (ToN), Vol. 24, No. 4, pp. 2278-2290, Aug. 2016.[TPDS]  Towards Distributed Optimal Movement Strategy for Data Gathering in Wireless Sensor NetworksChul-Ho Lee, Jaewook Kwak, Do Young EunIEEE Transactions on Parallel and Distributed Systems (TPDS), Vol. 27, No. 2, pp. 574-584, Feb. 2016.[TMC]  Exploiting Heterogeneity for Improving Forwarding Performance in Mobile Opportunistic Networks: An Analytic ApproachChul-Ho Lee, Do Young EunIEEE Transactions on Mobile Computing (TMC), Vol. 15, No. 1, pp. 150-162, Jan. 2016.[INFOCOM]  A High-order Markov Chain Based Scheduling Algorithm for Low",
  "content_length": 16938,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:49"
}