{
  "name": "Chun-Feng Wu",
  "homepage": "https://cfwu417.github.io",
  "status": "success",
  "content": "Chun-Feng Wu Chun-Feng Wu(吳俊峯) Assistant Professor National Yang Ming Chiao Tung University © Copyright © All rights reserved | This template is made with by Colorlib Hi! I'm Chun-Feng Assistant ProfessorNational Yang Ming Chiao Tung University Download CV Hi! I'm Chun-Feng Assistant Professor National Yang Ming Chiao Tung University Download CV Hi! I'm Chun-Feng Assistant ProfessorNational Yang Ming Chiao Tung University Download CV Hi! I'm Chun-Feng Assistant ProfessorNational Yang Ming Chiao Tung University Download CV Hi! I'm Chun-Feng Assistant ProfessorNational Yang Ming Chiao Tung University Download CV Hi! I'm Chun-Feng Assistant ProfessorNational Yang Ming Chiao Tung University Download CV Hi! I'm Chun-Feng Assistant ProfessorNational Yang Ming Chiao Tung University Download CV Hi! I'm Chun-Feng Assistant ProfessorNational Yang Ming Chiao Tung University Download CV Biobraphy May News: Check out the new look of the OSCAR Lab webpage Chun-Feng Wu(吳俊峯) is an assistant professor at National Yang Ming Chiao Tung University. He was a postdoctoral scholar in Department of Computer Science, Harvard University from 2021 to 2022. During his postdoc, he worked with Meta and Samsung on the topics of deep recommendation systems and computation-in-memory, respectively. He received his M.S. and Ph.D. degree in Department of Computer Science from National Tsing Hua University, Hsinchu, Taiwan, in 2016 and in Department of Computer Science and Information Engineering from National Taiwan University, Taipei, Taiwan, in 2021 respectively. He served in R&D alternative service at Institute of Information Science, Academia Sinica, Taipei, Taiwan. His primary research interests include memory/storage systems, embedded systems, operating systems and the next-generation memory/storage architecture. Received Awards: Yushan Young Fellow (教育部玉山青年學者), 2030 Emerging Young Scholars (國科會新秀學者), K. T. Li Young Researcher Award (2024 李國鼎青年研究獎), Semiconductor Award (2025 台灣半導體產業協會半導體獎), Macronix Scholar Award(旺宏電子學者) Hi, I am looking for motivated B.S., M.S. and Ph.D. students, also welcome PostDoc. Our research topic will focus on memory/storage co-design (including Processing-in-Memory and Photonic Accelerators) with a variety of popular applications (e.g., LLM systems, recommendataion systems, graph processing systems, key-value databases, and various machine learning systems). Our lab will work closely with Harvard University, Academia Sinica, The Chinese University of Hong Kong, National Taiwan University, National Cheng Kung University and National Tsing Hua University. If you are interested in my research or plan to study abroad, please do not hesitate to email (cfwu417@cs.nycu.edu.tw) me with a copy of your CV to start a conversation. 五月快訊:OSCAR Lab網頁翻新! 嗨，我們實驗室致力於整合應用程式與記憶體/儲存裝置以打造次世代運算系統，歡迎喜愛挑戰、樂於貢獻開源社群的同學加入，無論是碩士、專題、博士生、博士後都非常歡迎來聊聊。 底下三個是我比較熟悉的研究方向，也很歡迎其他不同的想法一起來Brainstorm新的方向。 應用程式與記憶體/儲存裝置整合設計：探索不同應用程式設計(e.g., 神經網路、深度推薦系統、圖形處理系統、Key-Value資料庫、機器學習系統及Tiny ML系統設計)，如何有效操作記憶體及儲存裝置。 次世代計算機架構：許多新的記憶體與儲存裝置開始支援在裝置內部做運算。探索有哪些運算又或者應用適合在裝置裡面做運算，該如何利用這樣新型的裝置加速應用程式。(除了模擬平台外，這個主題也可以跑在真實系統上。如果想玩玩看這種新的裝置，歡迎一起來研究)(此研究方向將與哈佛大學Harvard Architecture, Circuits, and Compilers團隊共同研究從應用、系統至晶片之垂直整合) 作業系統的挑戰：隨著儲存裝置效能不斷提升，記憶體與儲存裝置的速度差異逐漸拉近。在這樣的趨勢下，檔案系統與記憶體管理也漸漸面臨改變的需要。我們將一起探討現在的作業系統有哪些不合時宜的地方，以及可以如何優化現今作業系統以符合未來硬體與應用程式的發展趨勢。(此研究可以提升對於作業系統的理解，很適合未來想去發哥、螃蟹發展的同學) 基本上大部分題目的實驗，只要Python or C++擇一就能完成！另外，實驗室會與哈佛大學、中研院、香港中文大學、國立臺灣大學、國立成功大學及國立清華大學有許多合作。 最後，如果未來有任何規劃(e.g.,出國留學或交換)，也都非常歡迎一起討論! Operating System & Applications Memory System1. ReRAM2. SCM3. Optane DIMM Storage System1. Flash SSDs2. SMR Drives3. ULL devices NextGen System1. Near Data Computing2. Unified Mem Publications Journal Papers Wen-Yi Wang, Chun-Feng Wu, Yun-Chih Chen, Tei-Wei Kuo and Yuan-Hao Chang, \"GEAR: Graph-Evolving Aware Data ArrangeR to Enhance the Performance of Traversing Evolving Graphs on SCM,\" IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), vol. 43, no. 11, pp. 3674-3684, Nov. 2024. (Integrated with ACM/IEEE CODES+ISSS'24) Yu-Pang Wang, Wei-Chen Wang, Yuan-Hao Chang, Chieh-Lin Tsai, Tei-Wei Kuo, Chun-Feng Wu, Chien-Chung Ho, and Han-Wen Hu, \"TCAM-GNN: A TCAM-based Data Processing Strategy for GNN over Sparse Graphs,\" IEEE Transactions on Emerging Topics in Computing (TETC), vol. 12, no. 3, pp. 891-904, Jul. 2024. Yun-Chih Chen, Chun-Feng Wu, Yuan-Hao Chang, and Tei-Wei Kuo, \"ZoneLife: How to Utilize Data Lifetime Semantics to Make SSDs Smarter,\" IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), vol. 42, no. 8, pp. 2488-2499, Aug. 2023. Camelia Slimani, Chun-Feng Wu, Stephane Rubini, Yuan-Hao Chang, and Jalil Boukhobza, \"Accelerating Random Forest on Memory-Constrained Devices through Data Storage Optimization,\" IEEE Transactions on Computers (TC), vol. 72, no. 6, pp. 1595-1609, Jun. 2023. Yi-Shen Chen, Chun-Feng Wu, Yuan-Hao Chang, and Tei-Wei Kuo, \"Energy Efficiency Enhancement of SCM-based Systems: A Write-friendly Coding,\" IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), vol. 42, no. 5, pp. 1425-1437, May 2023. Gaddisa Olani Ganfure, Chun-Feng Wu, Yuan-Hao Chang, and Wei-Kuan Shih, \"DeepWare: Imaging Performance Counters with Deep Learning to Detect Ransomware,\" IEEE Transactions on Computers (TC), vol. 72, no. 3, pp. 600-613, Mar. 2023. Gaddisa Olani Ganfure, Chun-Feng Wu, Yuan-Hao Chang, and Wei-Kuan Shih, \"RTrap: Trapping and Containing Ransomware with Machine Learning,\" IEEE Transactions on Information Forensics and Security (TIFS), vol. 18, pp. 1433-1448, Jan. 2023. Yin-Chiuan Chen, Chun-Feng Wu, Yuan-Hao Chang, and Tei-Wei Kuo, \"Exploring Synchronous Page Fault Handling,\" IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), vol. 41, no. 11, pp. 3791-3802, Nov. 2022. (Integrated with ACM/IEEE CODES+ISSS'22) Chun-Feng Wu, Martin Kuo, Ming-Chang Yang, and Yuan-Hao Chang, \"Performance Enhancement of SMR-based Deduplication Systems,\" IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), vol. 41, no. 9, pp. 1835-2848, Sep. 2022. Shuo-Han Chen, Chun-Feng Wu, Ming-Chang Yang, and Yuan-Hao Chang, \"A File-Oriented Fast Secure Deletion Strategy for Shingled Magnetic Recording Drives,\" IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), vol. 41, no. 8, pp. 2463-2476, Aug. 2022. Tse-Yuan Wang, Chun-Feng Wu, Che-Wei Tsao, Yuan-Hao Chang, Tei-Wei Kuo, and Xue Liu, \"Rethinking the Interactivity of OS and Device Layers in Memory Management,\" ACM Transactions on Embedded Computing Systems (TECS), vol. 21, no. 4, pp. 42:1-42:21, Jul. 2022. Che-Wei Chang, Chun-Feng Wu, Yuan-Hao Chang, Ming-Chang Yang, and Chieh-Fu Chang, \"Leveraging Write Heterogeneity of Phase Change Memory on Supporting Self-balancing Binary Tree,\" IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), vol. 41, no. 6, pp. 1757-1770, Jun. 2022. Dharamjeet, Tseng-Yi Chen, Yuan-Hao Chang, Chun-Feng Wu, Chi-Heng Lee, Wei-Kuan Shih, \"Beyond Write-reduction Consideration: A Wear-leveling-enabled B+-tree Indexing Scheme over an NVRAM-based Architecture,\" IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), vol. 40, no. 12, pp. 2455-2466, Dec. 2021. Wen Sheng Lim, Chia-Heng Tu, Chun-Feng Wu, and Yuan-Hao Chang, \"iCheck: Progressive Checkpointing for Intermittent Systems,\" IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), vol. 40, no. 11, pp. 2224-2236, Nov. 2021. Ming-Chang Yang, Chun-Feng Wu, Shuo-Han Chen, Yi-Ling Lin, Che-Wei Chang, and Yuan-Hao Chang, \"On Minimizing Internal Data Migrations of Flash Devices via Lifetime-Retention Harmonization,\" IEEE Transactions on Computers (TC), vol. 70, no. 3, pp. 428-439, Mar. 2021. Chun-Feng Wu, Yuan-Hao Chang, Ming-Chang Yang, and Tei-Wei Kuo, \"When Storage Response Time Catches Up with Overall Context Switch Overhead, What is Next?,\" IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), vol. 39, no. 11, pp. 4266-4277, Nov. 2020. (Integrated with ACM/IEEE CODES+ISSS'20). Yao-Wen Kang, Chun-Feng Wu, Yuan-Hao Chang, Tei-Wei Kuo and Shu-Yin Ho, \"On Minimizing Analog Variation Errors to Resolve the Scalability Issue of ReRAM-based Crossbar Accelerator,\" IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), vol. 39, no. 11, pp. 3856-3867, Nov. 2020. (Integrated with ACM/IEEE EMSOFT'20). Gaddisa Olani Ganfure, Chun-Feng Wu, Yuan-Hao Chang, and Wei-Kuan Shih, \"DeepPrefetcher: A Deep Learning Framework for Data Prefetching in Flash Storage Devices,\" IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), vol. 39, no. 11, pp. 3311-3322, Nov. 2020. (Integrated with ACM/IEEE CASES'20). Ming-Chang Yang, Yuan-Hao Chang, Tei-Wei Kuo, and Chun-Feng Wu, \"Request Flow Coordination for Growing-Scale Solid-State Drives,\" IEEE Transactions on Computers (TC), vol. 69, no. 6, pp. 832-843, Jun. 2020. Chun-Feng Wu, Yuan-Hao Chang, Ming-Chang Yang, and Tei-Wei Kuo, \"Joint Management of CPU and NVDIMM for Breaking Down the Great Memory Wall,\" IEEE Transactions on Computers (TC), vol. 69, no. 5, pp. 722-733, May. 2020. Chun-Feng Wu, Ming-Chang Yang, Yuan-Hao Chang, and Tei-Wei Kuo, \"Hot-Spot Suppression for Resource-Constrained Image Recognition Devices with Non-Volatile Memory,\" IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), vol. 37, no. 11, pp. 2567-2577, Nov. 2018. (Integrated with ACM/IEEE EMSOFT 2018) Conference Papers Junliang Hu, Zhisheng Hu, Chun-Feng Wu, and Ming-Chang Yang, \"Demeter: A Scalable and Elastic Tiered Memory Solution for Virtualized Cloud via Guest Delegation,\" ACM Symposium on Operating Systems Principles (SOSP), Seoul, Republic of Korea, October 13–16, 2025. Top-Conference Acceptance rate: 17.6% (65/368) Hung-Yuan Cheng, Chun-Feng Wu, Yuan-Hao Chang, and",
  "content_length": 22580,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:51"
}