{
  "name": "Chung-Hsing Yeh",
  "homepage": "https://research.monash.edu/en/persons/chung-hsing-yeh",
  "status": "success",
  "content": "Chung-Hsing Yeh - Monash University Chung-Hsing Yeh public CV View Scopus Profile Chung-Hsing Yeh Assoc Professor Associate Professor, Department of Data Science & AI https://orcid.org/0000-0002-2938-1455 Emailchunghsing.yehmonashedu 1990 …2025 Research activity per year Personal profile BiographyChung-Hsing Yeh graduated from the National Cheng Kung University, Taiwan with a Bachelor of Science (Engineering) (top grade) and a Master of Management Science (topping the class). After graduation, he took up a number of appointments in Taiwan's public and private sectors, including teaching officer at Army Engineering School (military service), assistant engineer at Nan Ya Plastic Corporation, research fellow at Transportation Planning Board, and senior operations officer at Yangming Marine Transport Corporation. He passed Taiwan's national higher examinations in general management and in water transport management. He joined Monash University to undertake research in computer based production scheduling and completed his PhD study in record time with the best result possible. His research in the development of manufacturing management software systems has yielded a number of key algorithms which incorporate Just-in-Time concepts to achieve practical, effective production scheduling. He has taken up a number of academic positions at Monash, including research assistant, tutor, lecturer, senior lecturer, and associate professor. His research activities at Monash have been extended to include consulting services to governments and industries in Australia, China and Taiwan. In particular, he has appeared in the Federal Court of Australia as an expert witness for a legal case on software intellectual property. He has been undertaking collaborative research projects at the National Cheng Kung University (where he holds a visiting professor position), funded by the National Science Council (now Ministry of Science and Technology) of Taiwan.  He has published extensively in the areas of multicriteria decision analysis, applied artificial intelligence, information processing, operations and production management, and transport research. He has been a regular reviewer for a number of highly regarded scholarly journals. He is listed in Marquis Who's Who in the World, Who's Who in Finance and Industry, and Who's Who in Science and Engineering. Homepage: http://users.monash.edu.au/~chyeh/ Google Scholar Citations http://scholar.google.com/citations?user=ExgNJZQAAAAJ Research interestsMulticriteria Decision Analysis.Applied artificial intelligence.Intelligent Decision Support Systems.Fuzzy Logic and Neural Network Applications.Computer Vision and Image ProcessingOptimisation Modelling.Performance Evaluation.Transport research.Recycling operations and Production Planning and Management.Supply Chain Management.Monash teaching commitmentAssociate Professor Chung-Hsing Yeh has experience as the Chief Examiner for the following units in the Faculty of IT: FIT5047 Fundamentals of Artificial Intelligence FIT5186 Intelligent systems FIT5190 Introduction to IT research methods FIT3104/FIT9058 Chinese Language Information Technology BUS3010/BUS4410 Advanced Programming for Database Applications BUS4520 Computer Information Systems BUS5650 Business Applications of Neural Networks IS250 Introductory Computing for Business Applications IS301 Advanced Programming IS452 Computer Information Systems IS453 Software Systems Design and Development MBA5560 Management Information Systems Chung-Hsing has experience as the Lecturer for the following units in the Faculty of IT: FIT5047 Fundamentals of Artificial Intelligence FIT5186 Intelligent systems FIT5190 Introduction to IT research methods FIT2002/FIT3086 Project Management FIT3104/FIT9058 Chinese Language Information Technology FIT5097 Business Intelligence Modelling BUS3010/BUS4410 Advanced Programming for Database Applications BUS4520 Computer Information Systems BUS5650 Business Applications of Neural Networks IS250 Introductory Computing for Business Applications IS301 Advanced Programming IS452 Computer Information Systems IS453 Software Systems Design and Development MBA5560 Management Information Systems Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationOperations Research / Information Systems, Doctor of Philosophy, Monash UniversityAward Date: 8 Dec 1988Management Science, Master of Science, National Cheng Kung UniversityAward Date: 11 Jun 1982Industrial Design / Engineering, Bachelor of Science (Engineering), National Cheng Kung UniversityAward Date: 10 Jun 1977 Research area keywordsArtificial IntelligenceDecision Support SystemsIntelligent SystemsFuzzy LogicNeural NetworksDecision AnalysisComputer Vision and Image ProcessingTransportationOptimisationBusiness IntelligenceRecyclingSupply Chain ManagementOperations Management and Production PlanningOperations ResearchMulticriteria decision makingErgonomics Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2004 2004 2007 2012 2018 2019 2021 2021 6 Finished Projects per year Modelling the impacts of economic conditions on business modelsYeh, C.-H. (Primary Chief Investigator (PCI))Aurecon Australasia Pty Ltd 15/03/21 → 14/06/21Project: Research Maximising the Profitability of E-waste Recycling OperationsYeh, C.-H. (Primary Chief Investigator (PCI)), Kuo, Y.-L. (Associate Investigator (AI)) & LeMessurier, W. (Partner Investigator (PI))1/07/19 → 30/06/20Project: Research INT-0447 Market IntelligenceDuan, Y. (Primary Chief Investigator (PCI)) & Yeh, C.-H. (Supervisor)5/11/18 → 19/07/19Project: Research Rationalising and optimising e-waste recycling decisionsYeh, C.-H. (Primary Chief Investigator (PCI))Department of Industry, Science and Resources (Australia), MRI (AUST) Pty Ltd (trading as E-Waste)18/04/12 → 27/03/13Project: Research Maximising the Effectiveness of Public Health Policies: The Case of Smoke-Free PoliciesPetrovic-Lazarevic, S. (Primary Chief Investigator (PCI)), Bedingfield, S. (Chief Investigator (CI)), Coghill, K. (Chief Investigator (CI)), Yeh, C.-H. (Chief Investigator (CI)) & Borland, R. (Partner Investigator (PI))ARC - Australian Research Council, Cancer Council Victoria 2/01/07 → 30/06/10Project: Research View all 6 projects Research output Research output per year 1990 1997 1998 1999 2001 2003 2004 2005 2006 2007 2008 2009 2010 2025 104 Conference Paper 87 Article 20 Chapter (Book) 10 Abstract 12 More 10 Other 1 Paper 1 Review Article Research output per year Research output per year Developing effective intervention strategies to improve public participation in household waste recycling program: A data-driven agent-based behavior analysis approachXu, Y., Wu, X., Tang, M., Yeh, C.-H. & Zhang, L., 1 Jun 2025, In: Sustainable Cities and Society. 127, 19 p., 106447.Research output: Contribution to journal › Article › Research › peer-review 1 Citation (Scopus) Intelligent forecasting and distribution in cross-border e-commerce import trade: A deep-learning-based iterative optimization approachChen, X., He, Y., Hooshmand Pakdel, G. & Yeh, C. H., Jun 2025, In: Omega (United Kingdom). 133, 15 p., 103277.Research output: Contribution to journal › Article › Research › peer-review 1 Citation (Scopus) REHRSeg: Unleashing the power of self-supervised super-resolution for resource-efficient 3D MRI segmentationSong, Z., Zhao, Y., Li, X., Fei, M., Zhao, X., Liu, M., Chen, C., Yeh, C. H., Wang, Q., Zheng, G., Ai, S. & Zhang, L., 1 Apr 2025, In: Neurocomputing. 624, 12 p., 129425.Research output: Contribution to journal › Article › Research › peer-review A novel capacity-based approach for measuring alternative interactions in multicriteria decision analysisLi, C., Zhang, L., Xu, Y., Yeh, C.-H. & Zhou, D., 2024, In: Journal of the Operational Research Society. 75, 5, p. 942-954 13 p.Research output: Contribution to journal › Article › Research › peer-review How to cooperate in a three-tier food delivery service supply chainMa, S., He, Y., Gu, R. & Yeh, C.-H., Jul 2024, In: Journal of Retailing and Consumer Services. 79, 103828, 17 p., 103828.Research output: Contribution to journal › Article › Research › peer-review 8 Citations (Scopus) View all 233 research outputs Activities Activities per year 1990 2007 2017 2021 5 Grant review responsibilities 2 External research organisation, centre or institute 2 Editorial responsibility 2 Membership of an advisory panel/policy group/ board 4 More 1 Contribution to conference 1 Committees and working groups 1 Professional association or peak discipline body 1 Appointments or secondments to industry Activities per year Detailed Assessor – ARC - National Intelligence and Security Discovery Research Grants (NISDRG).Yeh, C.-H. (Reviewer)Jan 2021 → …Activity: External Academic Engagement › Grant review responsibilities Detailed Assessor - ARC's National Competitive Grants Program (NCGP)Yeh, C.-H. (Reviewer)1 Jan 2017 → …Activity: External Academic Engagement › Grant review responsibilities Member - FIT Graduate Program Committee - Faculty of Information Technology, Monash UniversityYeh, C.-H. (Member)1 Jan 2017 → …Activity: External Academic Engagement › Committees and working groups Assessor - The Netherlands Organisation for Scientific Research (NWO)Yeh, C.-H. (Reviewer)Dec 2017 → …Activity: External Academic Engagement › Grant review responsibilities Member - FIT Graduate Research Committee - Faculty of Information Tech",
  "content_length": 10170,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:56"
}