{
  "name": "Chun Yu",
  "homepage": "http://pi.cs.tsinghua.edu.cn/lab/people/ChunYu",
  "status": "success",
  "content": "Chun Yu's Research Homepage Chun Yu Associate Professor Pervasive Interaction LabInstitute of HCI and Media IntegrationDepartment of Computer Science and TechnologyTsinghua University Address: Room 3-526, Building FIT, Tsinghua University, Beijing 100084Email: chunyu at tsinghua dot edu dot cn [ Biography | Research Interests | Publications | Selected Honors and Awards | Teaching |Professional Services | Students and Mentoring | Invited Talks ] Biography 2017-2024, Associate Professor, Computer Science & Tech, Tsinghua University. 2014-2016, Assistant Professor, Computer Science & Tech, Tsinghua University. 2012-2014, Postdoc Fellow, Computer Science & Tech, Tsinghua University. 2006-2012, Ph.D. in Computer Science, Tsinghua University. 2002-2006, B.S. in Computer Science, Beijing University of Posts and Telecommunications. Research Interests My research centers on enhancing human-computer interaction (HCI) to facilitate more intuitive and efficient interaction between people and computers. I'm committed to creating significant HCI advancements through the integration of software, hardware, and AI, deeply informed by the human experience. This work has led to more than 80 publications in premier HCI forums, including ACM CHI, UIST and Ubicomp, and has garnered 14 awards for Best Paper or Honorable Mention. The practical applications of my research have been adopted by industry leaders and incorporated into widely-used commercial products, reaching over 600 million users. Publications Conference papers [1]Ubicomp 2023 Xiaoyi Liu, Yingtian Shi, Chun Yu, Cheng Gao, Tianao Yang, Chen Liang, Yuanchun Shi: Understanding In-Situ Programming for Smart Home Automation. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 7(2): 66:1-66:31 (2023) [2]Ubicomp 2023 Tian Huang, Chun Yu, Weinan Shi, Bowen Wang, David Yang, Yihao Zhu, Zhaoheng Li, Yuanchun Shi: Interaction Proxy Manager: Semantic Model Generation and Run-time Support for Reconstructing Ubiquitous User Interfaces of Mobile Services. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 7(3): 99:1-99:39 (2023) [3]Ubicomp 2023 Xin Yi, Chen Liang, Haozhan Chen, Jiuxu Song, Chun Yu, Hewu Li, Yuanchun Shi: From 2D to 3D: Facilitating Single-Finger Mid-Air Typing on QWERTY Keyboards with Probabilistic Touch Modeling. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 7(1): 38:1-38:25 (2023) [4]CHI 2023 Zisu Li, Chen Liang, Yuntao Wang, Yue Qin, Chun Yu, Yukang Yan, Mingming Fan, Yuanchun Shi: Enabling Voice-Accompanying Hand-to-Face Gesture Recognition with Cross-Device Sensing. CHI 2023: 313:1-313:17 (Honorable Mention Award) [5]CHI 2023 Lihang Pan, Chun Yu, Zhe He, Yuanchun Shi: A Human-Computer Collaborative Editing Tool for Conceptual Diagrams. CHI 2023: 360:1-360:29 [6]CHI 2023 Yue Qin, Chun Yu, Wentao Yao, Jiachen Yao, Chen Liang, Yueting Weng, Yukang Yan, Yuanchun Shi: Selecting Real-World Objects via User-Perspective Phone Occlusion. CHI 2023: 531:1-531:13 [7]CHI 2023 Zhuojun Li, Chun Yu, Yizheng Gu, Yuanchun Shi: ResType: Invisible and Adaptive Tablet Keyboard Leveraging Resting Fingers. CHI 2023: 722:1-722:14 [8]CHI 2023 Yuntao Wang, Zirui Cheng, Xin Yi, Yan Kong, Xueyang Wang, Xuhai Xu, Yukang Yan, Chun Yu, Shwetak N. Patel, Yuanchun Shi: Modeling the Trade-off of Privacy Preservation and Activity Recognition on Low-Resolution Images. CHI 2023: 589:1-589:15 [9]IUI 2023 Xiaozhu Hu, Yanwen Huang, Bo Liu, Ruolan Wu, Yongquan Hu, Aaron J. Quigley, Mingming Fan, Chun Yu, Yuanchun Shi: SmartRecorder: An IMU-based Video Tutorial Creation by Demonstration System for Smartphone Interaction Tasks. IUI 2023: 278-293 [10]UIST 2023 Chen Liang, Xutong Wang, Zisu Li, Chi Hsia, Mingming Fan, Chun Yu, Yuanchun Shi: ShadowTouch: Enabling Free-Form Touch-Based Hand-to-Surface Interaction with Wrist-Mounted Illuminant by Shadow Projection. UIST 2023: 27:1-27:14 [11]UIST 2023 Weihao Chen, Chun Yu, Huadong Wang, Zheng Wang, Lichen Yang, Yukun Wang, Weinan Shi, Yuanchun Shi: From Gap to Synergy: Enhancing Contextual Understanding through Human-Machine Collaboration in Personalized Systems. UIST 2023: 110:1-110:15 [12]Ubicomp 2022 Xiyuan Shen, Yukang Yan, Chun Yu, Yuanchun Shi: ClenchClick: Hands-Free Target Selection Method Leveraging Teeth-Clench for Augmented Reality. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 6(3): 139:1-139:26 (2022) [13]Ubicomp 2022 Zhichun Li, Yu Jiang, Xiaochen Liu, Yuhang Zhao, Chun Yu, Yuanchun Shi: Enhancing Revisitation in Touchscreen Reading for Visually Impaired People with Semantic Navigation Design. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 6(3): 126:1-126:22 (2022) [14]Ubicomp 2022 Chen Liang, Chi Hsia, Chun Yu, Yukang Yan, Yuntao Wang, Yuanchun Shi: DRG-Keyboard: Enabling Subtle Gesture Typing on the Fingertip with Dual IMU Rings. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 6(4): 170:1-170:30 (2022) [15]Ubicomp 2022 Jiayu Li, Zhiyu He, Yumeng Cui, Chenyang Wang, Chong Chen, Chun Yu, Min Zhang, Yiqun Liu, Shaoping Ma: Towards Ubiquitous Personalized Music Recommendation with Smart Bracelets. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 6(3): 125:1-125:34 (2022) [16]UIST 2022 Hang Zhao, Sophia Gu, Chun Yu, Xiaojun Bi: Bayesian Hierarchical Pointing Models. UIST 2022: 87:1-87:13 [17]CHI 2022 Lihang Pan, Chun Yu, Jiahui Li, Tian Huang, Xiaojun Bi, Yuanchun Shi: Automatically Generating and Improving Voice Command Interface from Operation Sequences on Smartphones. CHI 2022: 208:1-208:21 [18]Ubicomp 2021 Ciyuan Yang, Shuchang Xu, Tianyu Yu, Guanhong Liu, Chun Yu, Yuanchun Shi: LightGuide: Directing Visually Impaired People along a Path Using Light Cues. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 5(2): 84:1-84:27 (2021) [19]Ubicomp 2021 Chen Liang, Chun Yu, Yue Qin, Yuntao Wang, Yuanchun Shi: DualRing: Enabling Subtle and Expressive Hand Interaction with Dual IMU Rings. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 5(3): 115:1-115:27 (2021) [20]CHI 2021 Chen Liang, Chun Yu, Xiaoying Wei, Xuhai Xu, Yongquan Hu, Yuntao Wang, Yuanchun Shi: Auth+Track: Enabling Authentication Free Interaction on Smartphone by Continuous User Tracking. CHI 2021: 2:1-2:16 [21]CHI 2021 Yue Qin, Chun Yu, Zhaoheng Li, Mingyuan Zhong, Yukang Yan, Yuanchun Shi: ProxiMic: Convenient Voice Activation via Close-to-Mic Speech Detected by a Single Microphone. CHI 2021: 8:1-8:12 [22]CHI 2021 Yueting Weng, Chun Yu, Yingtian Shi, Yuhang Zhao, Yukang Yan, Yuanchun Shi: FaceSight: Enabling Hand-to-Face Gesture Interaction on AR Glasses with a Downward-Facing Camera Vision. CHI 2021: 10:1-10:14 [23]CHI 2021 Guanhong Liu, Tianyu Yu, Chun Yu, Haiqing Xu, Shuchang Xu, Ciyuan Yang, Feng Wang, Haipeng Mi, Yuanchun Shi: Tactile Compass: Enabling Visually Impaired People to Follow a Path with Continuous Directional Feedback. CHI 2021: 28:1-28:13 [24]CHI 2021 Zihan Wu, Chun Yu, Xuhai Xu, Tong Wei, Tianyuan Zou, Ruolin Wang, Yuanchun Shi: LightWrite: Teach Handwriting to The Visually Impaired with A Smartphone. CHI 2021: 32:1-32:15 [25]CHI 2021 Minjing Yu, Meng Zhang, Chun Yu, Xiaoguang Ma, Xing-Dong Yang, Jiawan Zhang: We Can Do More to Save Guqin: Design and Evaluate Interactive Systems to Make Guqin More Accessible to the General Public. CHI 2021: 294:1-294:12 [26]CHI 2021 Ruolin Wang, Zixuan Chen, Mingrui Ray Zhang, Zhaoheng Li, Zhixiu Liu, Zihan Dang, Chun Yu, Xiang 'Anthony' Chen: Revamp: Enhancing Accessible Information Seeking Experience of Online Shopping for Blind or Low Vision Users. CHI 2021: 494:1-494:14 [27]UIST 2021 Yizheng Gu, Chun Yu, Xuanzhong Chen, Zhuojun Li, Yuanchun Shi: TypeBoard: Identifying Unintentional Touch on Pressure-Sensitive Touchscreen Keyboards. UIST 2021: 568-581 [28]UIST 2021 Jiayue Fan, Chenning Xu, Chun Yu, Yuanchun Shi: Just Speak It: Minimize Cognitive Load for Eyes-Free Text Editing with a Smart Voice Assistant. UIST 2021: 910-921 [29]Ubicomp 2020 Yiqin Lu, Bingjian Huang, Chun Yu, Guahong Liu, Yuanchun Shi: Designing and Evaluating Hand-to-Hand Gestures with Dual Commodity Wrist-Worn Devices. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4(1): 20:1-20:27 (2020) [30]Ubicomp 2020 Xuhai Xu, Chun Yu, Yuntao Wang, Yuanchun Shi: Recognizing Unintentional Touch on Interactive Tabletop. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4(1): 33:1-33:24 (2020) [31]Ubicomp 2020 Yukang Yan, Yingtian Shi, Chun Yu, Yuanchun Shi: HeadCross: Exploring Head-Based Crossing Selection on Head-Mounted Displays. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4(1): 35:1-35:22 (2020) [32]Ubicomp 2020 Guanhong Liu, Yizheng Gu, Yiwen Yin, Chun Yu, Yuntao Wang, Haipeng Mi, Yuanchun Shi: Keep the Phone in Your Pocket: Enabling Smartphone Operation with an IMU Ring for Visually Impaired People. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4(2): 58:1-58:23 (2020) [33]Ubicomp 2020 Shuchang Xu, Ciyuan Yang, Wenhao Ge, Chun Yu, Yuanchun Shi: Virtual Paving: Rendering a Smooth Path for People with Visual Impairment through Vibrotactile and Audio Feedback. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4(3): 99:1-99:25 (2020) [34]Ubicomp 2020 Yizheng Gu, Chun Yu, Zhipeng Li, Zhaoheng Li, Xiaoying Wei, Yuanchun Shi: QwertyRing: Text Entry on Physical Surfaces Using a Ring. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4(4): 128:1-128:29 (2020) [35]CHI 2020 Yukang Yan, Chun Yu, Wengrui Zheng, Ruining Tang, Xuhai Xu, Yuanchun Shi: FrownOnError: Interrupting Responses from Smart Speakers by Facial Expressions. CHI 2020: 1-14 (Honorable Mention Award) [36]CHI 2020 Yuntao Wang, Zichao (Tyson) Chen, Hanchuan Li, Zhengyi Cao, Huiyi Luo, Tengxiang Zhang, Ke Ou, John Raiti, Chun Yu, Shwetak N. Patel, Yuanchun Shi: MoveVR: Enabling Multiform Force Feedback in Virtual Reality using Household Cleaning Robot. CHI 2020: 1-12 [37]VR 2020 Yiqin Lu, Chun Yu, Yuanchun Shi: Investigating Bubble Mechanism for Ray-Casting to Improve 3D Target Acquisition in Virtual Reality. VR 2020: 35-43 (Best Paper Nomin",
  "content_length": 27870,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:50"
}