{
  "name": "Chun Tung Chou",
  "homepage": "http://www.cse.unsw.edu.au/~ctchou",
  "status": "success",
  "content": "Chun Tung Chou's CSE home page Chun Tung Chou School of Computer Science and Engineering University of New South Wales Home Research Publications Students Professional activities Teaching Contact Welcome Welcome to my web pages! I'm an Associate Professor at the School of Computer Science and Engineering, University of New South Wales, Sydney, Australia. I received my BA in Engineering Science from the University of Oxford and my PhD in Systems and Control Engineering from the University of Cambridge. My broad research interests are in networks, optimisation, pervasive computing, and signals and systems. Currently, I am working in the following research topics: compressive sensing in wireless sensor networks, molecular communication and nano wireless sensor networks. See below for brief description and key recent papers. I've published more than 100 journal and conference articles in various research topics, you can have a look in my publication page. You can also check out my Google Scholar Citations page . Postgraduate study with me: I am always looking for good students to work with me in my research. If you are interested, please read this (link to prospective students page) before you email me. Fun stuff: My Erdos number is 5. A path is Chun Tung Chou - Bernard Hanzon - Martine Olivi - Laurent Baratchart - Vilmos Totik - Paul Erdos. Current research areas Compressive sensing for wireless sensor networks The aim of the research is to use compressive sensing to improve the performance of wireless sensor networks. Recent work includes: B. Wei, W. Hu, M. Yang, C.T. Chou. Radio-based Device-free Activity Recognition with Radio Frequency Interference. Accepted by ACM/IEEE International Conference on Information Processing in Sensor Networks (IPSN ‘15), 2015. Y. Shen, W. Hu, M. Yang, B. Wei, S. Lucey and C.T. Chou. Robust and Efficient Face Recognition on Smartphones. In Proceedings of the 14th ACM/IEEE conference on Information Processing in Sensor Networks (IPSN), pages 237-248, 2014. Real-time Classification via Sparse Representation in Acoustic Sensor Networks. Accepted in ACM Sensys 2013. Efficient Background Subtraction for Real-time Tracking in Embedded Camera Networks. In Sensys 2012. (pdf) Efficient computation of robust average of compressive sensing data in wireless sensor networks in the presence of sensor faults. IEEE Trans Parallel and Distributed Systems, 2013. (pdf) Nano molecular communication The aim is to understand the performance of molecular communication. Recent work include C.T. Chou. A Markovian Approach to the Optimal Demodulation of Diffusion-based Molecular Communication Networks. IEEE Transactions on Communications. 63(10):3728-3743, 2015 C.T. Chou. Maximum a-posteriori decoding for diffusion-based molecular communication using analog filters. IEEE Transactions on Nanotechnology. 14(6):1054-1067, 2015 C.T. Chou. Impact of receiver reaction mechanisms on the performance of molecular communication networks. IEEE Transactions on Nanotechnology. 14(2):304-317, 2015 Molecular communication networks with general molecular circuit receivers. ACM The First Annual International Conference on Nanoscale Computing and Communication (2014) (pdf) Extended master equation models for molecular communication networks. IEEE Transactions on Nanobioscience, 2013. (pdf) Noise properties of linear molecular communication networks. Nano Communication Networks, 2013. (pdf) Nano wireless sensor networks The aim is to understand how to architect nano wireless sensor netorks Innovative Approach to Improving Gas-to-Liquid Fuel Catalysis via Nanosensor Network Modulation. Ind Eng Chem Res (Publisher website) Power Optimization in Nano Sensor Networks for Chemical Reactors. ACM The First Annual International Conference on Nanoscale Computing and Communication (2014) (pdf) Nano-scale Sensor Networks for Chemical Catalysis. The 13th IEEE International Conference on Nanotechnology (IEEE-Nano), 2013. Technical Report (pdf) News: - Nano-networking summit 2011 - Partipatory sensing for consumer pricing ... Recent papers: - IEEE TMC 2015 - IEEE TNano 2015 - IPSN 2015 #1 - IPSN 2015 #2 - IEEE Sensors 2015 #1 - IEEE Sensors 2015 #2 - IPSN 2014 - ACM Nanocom 2014 #1 - ACM Nanocom 2014 #2 Designed by Chun Tung Chou; Last updated on 29 Mar 2016.",
  "content_length": 4312,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:51"
}