{
  "name": "Chunjie Zhang",
  "homepage": "http://faculty.bjtu.edu.cn/9371",
  "status": "success",
  "content": "北京交通大学教师名录 张淳杰 博士 、教授 基本信息 办公电话： 电子邮件： cjzhang@bjtu.edu.cn 通讯地址：北京交通大学信息科学研究所 邮编：100044 教育背景 2011年博士毕业于中国科学院自动化所模式识别国家重点实验室， 研究方向包括图像处理与理解、计算机视觉、多媒体数据处理与分析等方面；在The Innovation、IEEE TPAMI/TIP、CVPR/ICCV等刊物上发表论文百余篇；主持包括北京市杰出青年基金项目、国自然科面上项目等；获2023年北京市科学技术奖自然科学奖二等奖、2022年福建省科学技术奖科学技术进步奖二等奖、2018年度中国图象图形学学会科学技术奖二等奖，2020年度北京交通大学詹天佑专项奖（科技奖）；中国计算机学会杰出会员、中国电子学会/中国图象图形学学会/中国人工智能学会高级会员、IEEE Senior Member。 申请考核博士、硕博连读博士、直博生招生计划：2-3名 招生要求：对科研工作真正怀有兴趣，具有较强的自我驱动能力和具备较好的编程能力和数学基础，有学术竞赛经验者优先。 招生专业：详见学校研究生院导师在线系统：https://aa.bjtu.edu.cn/discipline/college_show/ 工作经历 2019~至今       北京交通大学  计算机与信息技术学院 教授 2017~2019    中国科学院自动化研究所  助理研究员、副研究员 2012~2017    中国科学院大学 计算机与控制学院 博士后、讲师 2011~2012    国家电网河南省电力公司电力科学研究院   工程师 研究方向 数字媒体信息处理与智能分析 新一代电子信息技术 软件工程 人工智能 大数据技术与工程 机器学习与认知计算 计算机技术 招生专业 计算机科学与技术博士 新一代电子信息技术（含量子技术等）博士 人工智能博士 软件工程博士 计算机技术博士 新一代电子信息技术（含量子技术等）硕士 软件工程硕士 人工智能硕士 大数据技术与工程硕士 计算机科学与技术硕士 计算机技术硕士 科研项目 主持/参与国自然基金、北自然基金等。 教学工作 深度学习 论文/期刊 Dong Yu, Yepeng Tang, Chunjie Zhang, et al.,IA2GNN: Imbalance-Aware Adaptive Graph Construction for Multi-Modal Image Fusion, IEEE T-MM, accepted. Shaohua Duan, Chunjie Zhang, Xiaolong Zheng, et.al., 24-h Lane Line Detection via Parallel Scene Information Collaboration, IEEE TRANSACTIONS ON INTELLIGENT TRANSPORTATION SYSTEMS, accepted. Ping Cao, Yepeng Tang, Chunjie Zhang, Xiaolong Zheng, Chao Liang, Yunchao Wei, Yao Zhao. Visual Relation Diffusion for Human-Object Interaction Detection. ICCV, 2025. Chunjie Zhang, Chuankai Liu, Shaohua Duan, Xiaolong Zheng et al.  Embodied cognitive intelligence guided Moon sample collection, . The Innovation 6(7), 100939. Man Liu, Huihui Bai, Feng Li, Chunjie Zhang, Yunchao Wei, Meng Wang, Tat-Seng Chua, Yao Zhao: PSVMA+: Exploring Multi-Granularity Semantic-Visual Adaption for Generalized Zero-Shot Learning. IEEE Trans. Pattern Anal. Mach. Intell. 47(1): 51-66 (2025) Man Liu, Huihui Bai, Feng Li, Chunjie Zhang, Yunchao Wei, Tat-Seng Chua, Yao Zhao: Attend and Enrich: Enhanced Visual Prompt for Zero-Shot Learning. AAAI 2025: 5504-5512 Guoguang Zhang, Yepeng Tang, Chunjie Zhang, Xiaolong Zheng, Yao Zhao: Entity Dependency Learning Network With Relation Prediction for Video Visual Relation Detection. IEEE Trans. Circuits Syst. Video Technol. 34(12): 12425-12436 (2024) Man Liu, Chunjie Zhang, Huihui Bai, Yao Zhao: Part-Object Progressive Refinement Network for Zero-Shot Learning. IEEE Trans. Image Process. 33: 2032-2043 (2024) Yepeng Tang, Weining Wang, Chunjie Zhang, Jing Liu, Yao Zhao: Learnable Feature Augmentation Framework for Temporal Action Localization. IEEE Trans. Image Process. 33: 4002-4015 (2024) Yepeng Tang, Weining Wang, Chunjie Zhang, Jing Liu, Yao Zhao:Temporal Action Proposal Generation With Action Frequency Adaptive Network. IEEE Trans. Multim. 26: 2340-2353 (2024) Yepeng Tang, Weining Wang, Yanwu Yang, Chunjie Zhang, et. al., Anchor-free temporal action localization via Progressive Boundary-aware Boosting, Inf. Process. Manag., 60(1): 103141 (2023). Hongguang Zhu, Chunjie Zhang, Yunchao Wei, Shujuan Huang, and Yao Zhao, ESA: External space attention aggregation for image-text retrieval, IEEE Transactions on Circuits and Systems for Video Technology, 33(10):6131-6143, 2023. Man Liu, Feng Li, Chunjie Zhang, Yunchao Wei, Huihui Bai, and Yao Zhao, Progressive Semantic-Visual Mutual Adaption for Generalized Zero-Shot Learning, CVPR, pp.15337-15346, 2023. （highlight paper） Changkai Xu, Chunjie Zhang, et. al., Accelerate adversarial training with loss guided propagation for robust image classification, Inf. Process. Manag., 60(1): 103143 (2023). Weijia Li, Saihui Hou, Chunjie Zhang, et. al., An In-Depth Exploration of Person Re-Identification and Gait Recognition in Cloth-Changing Conditions, CVPR, pp.13824-13833, 2023. Shangrong Yang, Chunyu Lin, Kang Liao, Chunjie Zhang, Yao Zhao, Progressively complementary network for fisheye image rectification using appearance flow, CVPR, pp.6348-6357, 2021. Lingzhi He, Hongguang Zhu, Feng Li, Huihui Bai, Runmin Cong, Chunjie Zhang, Chunyu Lin, Meiqin Liu, Yao Zhao, Towards fast and accurate real-world depth super-resolution: Benchmark dataset and baseline, CVPR, pp.9229-9238, 2021. Chunjie Zhang, et al, Fine-grained image classification by class and image-specific decomposition with multiple views, IEEE Transactions on Multimedia, vol.25, pp.6756-6766, 2023. Chunjie Zhang, et. al., Exemplar-based, semantic guided zero-shot visual recognition, IEEE Transactions on Image Processing, vol.31, pp.3056-3065, 2022. Man Liu, Chunjie Zhang, Huihui Bai, Riquan Zhang, Yao Zhao: Cross-Part Learning for Fine-Grained Image Classification. IEEE Transactions on Image Processing, 31: 748-758 (2022) Chunjie Zhang, et. al., Multi-view image classification with visual, semantic and view consistency, IEEE Transactions on Image Processing, 29(1):617-627, 2020. Chunjie Zhang, et. al., Beyond explicit codebook generation: Visual representation using implicitly transferred codebooks, IEEE Transactions on Image Processing, 24(12):5777-5788, Dec. 2015. Chunjie Zhang, et. al., Structured weak semantic space construction for visual categorization, IEEE Transactions on Neural Network and Learning Systems, 29(8):3442-3451, 2018. Chunjie Zhang, et. al., Image-specific classification with local and global discriminations, IEEE Transactions on Neural Network and Learning Systems, 29(9):4479-4486, 2018. Chunjie Zhang, et. al., Object categorization using class-specific representation, IEEE Transactions on Neural Network and Learning Systems, 29(9):4528-4534, 2018. Chunjie Zhang, et. al., Semantically modeling of object And context for categorization, IEEE Transactions on Neural Network and Learning Systems, 30(4):1013-1024, 2019. Chunjie Zhang, et. al., Incremental codebook adaptation for visual representation and categorization, IEEE Transactions on Cybernetics, 48(7):2012-2023, 2018. Chunjie Zhang, et. al., Multi-view, few-labeled object categorization by predicting labels with view consistency, IEEE Transactions on Cybernetics, 49(11):3834-3843, 2019. Chunjie Zhang, et. al., Multiview semantic representation for visual recognition, IEEE Transactions on Cybernetics, 50(5): 2038-2049, 2020. Chunjie Zhang, et. al., Multi-view label sharing for visual representations And Classifications, IEEE Transactions on Multimedia, 20(4):903-913, 2018. Chunjie Zhang, et. al., Unsupervised and semi-supervised image classification with weak semantic consistency, IEEE Transactions on Multimedia, 21(10):2482-2491, 2019. Chunjie Zhang, et. al., Contextual exemplar classifier-based image representation for classification, IEEE Transactions on Circuits and Systems for Video Technology, 27(8):1691-1699, 2017. Chunjie Zhang, et. al., Image class prediction by joint object, context and background modeling, IEEE Transactions on Circuits and Systems for Video Technology, 28(2):428-438, 2018. Chunjie Zhang, et. al., Bundled local features for image representation, IEEE Transactions on Circuits and Systems for Video Technology, 28(8):1719-1726, 2018. Chunjie Zhang, et. al., Few-shot visual classification using image pairs with binary transformation, IEEE Transactions on Circuits and Systems for Video Technology, 30(9): 2867-2871, 2020. Congqi Cao, Yifan Zhang, Chunjie Zhang, and Hanqing Lu, Body Joint guided 3D Deep Convolutional Descriptors for Action Recognition, IEEE Transactions on Cybernetics, 48(3):1095-1108, 2018. Chenggang Yan, Liang, Li, Chunjie Zhang, Bingtao Liu, Yongdong Zhang, Qionghai Dai, Cross-modality bridging and knowledge transferring for image understanding, IEEE Transactions on Multimedia, 21(10):2675-2685, 2019. 专著/译著 专利 软件著作权 获奖与荣誉 2023年北京市科学技术奖自然科学奖二等奖 2022年福建省科学技术奖科学技术进步奖二等奖 2018年度中国图象图形学学会科学技术奖二等奖 2020年度北京交通大学詹天佑专项奖（科技奖） 社会兼职 IEEE Senior Member 中国计算机学会  杰出会员 中国电子学会  高级会员 中国图象图形学学会  高级会员 中国人工智能学会   高级会员 中国科学院青年创新促进会 会员 版权所有：北京交通大学研究生院",
  "content_length": 7836,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:56"
}