{
  "name": "Chunwei Liu",
  "homepage": "https://www.cs.purdue.edu/people/faculty/chunwei.html",
  "status": "success",
  "content": "Chunwei Liu - Department of Computer Science - Purdue University Skip to content Home People Faculty Chunwei Liu Faculty & Lecturers Staff Offices Chunwei Liu Assistant Professor of Computer Science Chunwei Liu is an Assistant Professor of the Computer Science Department. His research interests span compound AI systems, database systems, cloud/edge computing, and database benchmarking. He focuses on optimizing data systems for both conventional data analytics and emerging AI-powered pipelines. Chunwei develops privacy-preserving workload generation techniques for evaluating cloud database systems, collaborating with major cloud vendors such as Microso… ↓More Joined department: Fall 2025 Research Areas Artificial Intelligence, Machine Learning, and Natural Language Processing Databases and Data Mining Distributed Systems Chunwei Liu is an Assistant Professor of the Computer Science Department. His research interests span compound AI systems, database systems, cloud/edge computing, and database benchmarking. He focuses on optimizing data systems for both conventional data analytics and emerging AI-powered pipelines. Chunwei develops privacy-preserving workload generation techniques for evaluating cloud database systems, collaborating with major cloud vendors such as Microsoft, Amazon, Intel, Meta, and Google. Additionally, he explores novel data compression methods for data systems and implements adaptive compression selection in both conventional and resource-constrained databases and machine learning systems. Furthermore, he is engaged in high-dimensional data analysis, with a particular emphasis on time series applications. He was a Postdoctoral Associate in DSG at MIT CSAIL. He got his Ph.D. from the Department of Computer Science at the University of Chicago, where he worked in the ChiData group. Chunwei has several Ph.D. positions available for the upcoming fall. If you are interested, please feel free to contact him directly or list him as a potential advisor in your application. Selected Publications Optimizing AI Powered Data Pipelines: Palimpzest, PalimpChat [Project Site] Query Friendly Compression: MOP, BUFF, PIDS Adaptive Data Framework: AdaEdge, CodecDB, VergeDB Benchmarking Data Systems: DeepDive, DataFormats, EBI, PBench Scheduling, Time Series and Causal Analysis: IconqSched, Trail, Debunk, VAQ, LOGos Contact Info chunwei@purdue.edu LWSN 2142D Websites My Homepage Google Scholar dblp LinkedIn",
  "content_length": 2459,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:59"
}