{
  "name": "Chunyi Peng 0001",
  "homepage": "https://www.cs.purdue.edu/homes/chunyi",
  "status": "success",
  "content": "Chunyi Peng Home Team Research Publication Teaching Service Personal Chunyi Peng Purdue University Chunyi Peng Associate Professor Department of Computer Science Purdue University Office: DSAI 2142E Mailing Address: (Map) 475 Stadium Mall Drive, West Lafayette, IN 47907 Email: chunyi at purdue dot edu I am an Associate Professor in Dept. of Computer Science at Purdue University. Previously, I was an Assistant Professor in the Dept. of Computer Science and Engineering at the Ohio State University after I received my Ph.D. in Computer Science at University of California, Los Angeles. Prior to UCLA, I worked as an Associate/Assistant Researcher at Wireless Networking Group at Microsoft Research Asia. I received a M.Eng and B.Eng in Automation from Tsinghua University, both with highest honors. In the past, I held internships at IBM TJ Watson Research Center, Microsoft Research Redmond and Microsoft Research Asia. I am an ACM Distinguished Member. My current research interests are in the broad areas of mobile networking, system and security, with a recent focus on renovating 5G6G radio access technologies, AI for networks, 5GIoT security, mobile edge computing (mainly for AI-empowered drone/robot autonomy). Curriculum Vitae What is NEW? To students at Purdue: There are R&D openings in my lab, through REU programs (undergrad), independent studies (undergrad and MS) and thesis options (MS and PhD). There are several ongoing projects in Physical AI (mainly through computer vision and robotics control techniques). See AirLab as one example project. 5G/xG radio access: measurement, testing, troubleshooting and design, likely over our experimentation platform MI-Lab. Mobile network security. If you are interested in working with me, I would like you to have a quick look at my active research and recent publications first. Please also read the note to students (here) and then email me with your resume if you want to work with me. 09/2025 One IMC’25 paper accepted. Congratulations to Yanbing and Jingqi! 08/2025 Sign-to-Speech over smart glasses awarded by FCAT. Congratulations to Chen! 07/2025 Jingqi passed her PhD defense! Congratulations, Dr. Huang! 06/2025 SiHear (Sign-to-Hear) won Best Poster Award at MobiSys’25 N2Women workshop! Congratulations to Chen and Jiaxin! 06/2025 RSSS (Robust Structural Semantic Segmentation) accepted at IROS’25. Congratulations to Shengqing and Jiaxin! 02/2025 Prof. Peng named as ACM Distinguished Member (2024). 01/2025 Prof. Peng gave a keynote at CCWC’25, Las Vegas. 12/2024 AirLab is launched! 10/2024 AirPatrol won the best poster award at MobiCom’24! Congratulations to Jiaxin! 10/2024 Junpeng passed his PhD defense! Congratulations, Dr. Guo! More news Current Teaching CS422: Computer Networks, Fall 2025 (Brightspace Campuswire Gradescope) CS592-Drone: Autonomous Drones for Your Use, Spring 2026 (Brightspace) More courses in the past Research Active projects: iTest4ORAN: Diagnostic Testing of Next-Generation Radio Access Network (CNS-2403048) Evolving Mobile Network Security (Cellular-911 Security:CNS-2246051) AI-EDGE: AI for Networks: New Mobility and AI for 5G (part of CNS-2112471) MI-LAB: Harnessing network data to spur operational mobile network research (a follow-up of our prior project MobileInsight) AirLab: Towards fully autonomous drones in our daily life Demo: drone deliver to door (Best Demo Award at HotMobile’24) AirPatrol (Best Poster Award at MobiCom’24) More on past and ongoing projects: here. Tutorial on AIM, MobileInsight and beyond This is a brief summary of high-level position talk to the public. It has basic idea, approaches and main results, by skipping all technical details of each research problem under this umbrella project: (pps), (PDF). This is a tutorial of L2/L1 latency analysis enabled by MobileInsight. It was originally used for Hackathon, co-located at ACM SIGCOMM on Aug 25, 2018, and then was reorganized and substantially enhanced for public distribution (step-by-step learning and practice). The used codes and sample logs can be found here. You can find the codes developed by the hackathon team (Quentin, Maryam, Syed and Ensar) at github. This is an 3-hr tutorial on GlobeCom’17 on Dec 8, 2017. It introduces how to step-by-step verify mobile network operations on your phones via MobileInsight. Here is the tutorial slide (pdf) (ppsx). For more up-to-date information, please check our MobileInsight website. Selected Recent Papers (a full list at here or Google Scholar) MobiCom’23: CA++: Enhancing Carrier Aggregation Beyond 5G INFOCOM’23: A Close Look at 5G in the Wild: Unrealized Potentials and Implications MobiCom’22: Uncovering Insecure Designs of Cellular Emergency Services (911), Best Community Paper Runner-up MobiCom’21: Insecurity of Operational Cellular IoT Service: New Vulnerabilities, Attacks, and Countermeasures MobiCom’21: Experience: A Five-Year Retrospective of MobileInsight MobiCom’20 iCellSpeed: Increasing Cellular Data Speed with Device-Assisted Cell Selection (5-min pitch)(20-min presentation) MobiCom’20 Experience: Towards Automated Customer Issue Resolution in Cellular Networks IMC’18 Mobility Support in Cellular Networks: A Measurement Study on Its Configurations and Implications MobiCom’18 CEIVE: Combating Caller ID Spoofing on 4G Mobile Phones Via Callee-Only Inference and Verification MobiCom’18 Resolving Policy Conflicts in Multi-Carrier Cellular Access MobiCom’18 ChromaCode: A Fully Imperceptible Screen-Camera Communication System SIGCOMM’18 A Measurement Study on Multi-path TCP with Multiple Cellular Carriers on High-speed Rails Mobicom’17 A Control-Plane Perspective on Reducing Data Access Latency in LTE Networks Mobicom’17 The Tick Programmable Low-Latency SDR System, Best Community Paper Award MobiCom’16 MobileInsight: Extracting and Analyzing Cellular Network Information on Smartphone, Best Community Paper Award SIGMETRICS’16 Instability in Distributed Mobility Management: Revisiting Configuration Management in 3G/4G Mobile Networks NSDI’16 iCellular: Define Your Own Cellular Network Access on Commodity Smartphones CCS’16 New Security Threats Caused by IMS-based SMS Service in 4G LTE Networks CCS’15 Insecurity of Voice Solution VoLTE in LTE Mobile Networks MobiSys’15 InFrame: Achieve Simultaneous Screen-Human Viewing and Hidden Screen-Camera Communication CCS’14 Real Threats to Your Data Bills: Security Loopholes and Defense in Mobile Data Charging NSDI’14 Epsilon: A Visible Light Based Positioning System MobiCom’14 Enhancing Reliability to Boost the Throughput over Screen-Camera Links SIGCOMM’14 Control-Plane Protocol Interactions in Cellular Networks Page generated 2025-11-25 12:39:06 EST, by jemdoc.",
  "content_length": 6707,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:59"
}