{
  "name": "Chunlei Li",
  "homepage": "https://www.uib.no/en/persons/Chunlei.Li",
  "status": "success",
  "content": "Chunlei Li | UiB Skip to main content Edit Photo: Randi Heggernes Eilertsen Chunlei Li Position Professor, Coding Theory and Cryptography Affiliation Department of Informatics E-mail chunlei.li@uib.no Phone number +47 55584013 Visitor address Institution of Informatics, University of Bergen5020 Bergen Room: 204N1 Postal address P.O. Box 7803 NO-5020 Bergen Norway Follow me Homepage Google Scholar Dblp Chunlei Li Position Professor, Coding Theory and Cryptography Affiliation Department of Informatics Research My research lies in the ICT field with primary focuses on sinal design, error-correcting codes, cryptography, and security (short introductory videos for error-correcting codes, cryptography, and cybersecurity). More specifically, my research interests includesignal design: signals/waveforms with desirable correlation, peak-to-average power ratio (PAPR), ambiguity for reliable and efficient wireless communications coding theory: error-correction codes in Hamming metric and rank metric, and their applications for reliable data communication and storagecryptography: symmetric cryptographic primitives, homomorphic encryptions, searchable encryptions, code-based cryptographysecurity: intrusion detection and secure authenticationblockchain: design and applications of blockchaindiscrete mathematics: permutations polynomials, sequences, cryptographically strong functions and interplay among themSelected Recent publications (Full List at DBLP)Chunlei Li: A Survey on Complexity Measures for Pseudo-Random Sequences. Cryptogr. 8(2): 25 (2024)Ermes Franch, Philippe Gaborit, Chunlei Li: Generalized Low-Rank Parity-Check Codes. IEEE Trans. Inf. Theory 70(8): 5589-5605 (2024)Qin Yuan, Chunlei Li, Xiangyong Zeng, Tor Helleseth, Debiao He:Further Investigations on Nonlinear Complexity of Periodic Binary Sequences. IEEE Trans. Inf. Theory 70(7): 5376-5391 (2024)Palash Sarkar, Chunlei Li, Sudhan Majhi, Zilong Liu: New Correlation Bound and Construction of Quasi-Complementary Sequence Sets. IEEE Trans. Inf. Theory 70(3): 2201-2223 (2024)Kangquan Li, Chunlei Li, Tor Helleseth, Longjiang Qu: Further investigations on permutation-based constructions of bent functions. J. Comb. Theory A 199: 105779 (2023)Guang Yang, Chunlei Li, Kjell E. Marstein: A blockchain-based architecture for securing electronic health record systems. Concurr. Comput. Pract. Exp. 33(14) (2021)Tor Helleseth, Daniel J. Katz, Chunlei Li: The Resolution of Niho's Last Conjecture Concerning Sequences, Codes, and Boolean Functions. IEEE Trans. Inf. Theory 67(10): 6952-6962 (2021) Outreach Norwegian: B2English: FluentChinese: Mother Tongue Teaching My teaching activities can be found at this linkINF243-Algebraic Coding, University of Bergen (2024,2023,2022 Spring)INF140-Introduction to Cyber Security, University of Bergen (2023,2022,2021,2020 Autumn)INF143A-Applied Cryptography, University of Bergen (2021 Spring)INF142-Compute Networks, University of Bergen (2019 Spring)INF240-Basic Codes, University of Bergen (2018 Spring)DAT510-Security and Vulnerability in Network, University of Stavanger (2015, 2016 Autumn) Publications 2025 Li, Chen; Li, Chunlei; Zeng, Xiangyong et al. (2025). Constructions of Optimal Frequency-Hopping Sequences with Controlled Minimum Gaps. (external link) Bao, Furong; Xia, Yongbo; Chen, Shaoping et al. (2025). THE DIFFERENTIAL SPECTRUM OF A POWER PERMUTATION. (external link) Franch, Ermes; Li, Chunlei (2025). Bounded-Degree Low-Rank Parity-Check Codes. (external link) 2024 Franch, Ermes; Gaborit, Philippe; Li, Chunlei (2024). Generalized Low-Rank Parity-Check Codes. (external link) Li, Chunlei; Riera, Constanza Susana; Stanica, Pantelimon et al. (2024). On the codebook design for NOMA schemes from bent functions.. (external link) Li, Chunlei (2024). A Survey on Complexity Measures for Pseudo-Random Sequences. (external link) Wu, Yanan; Stănică, Pantelimon; Li, Chunlei et al. (2024). Bivariate functions with low c-differential uniformity. (external link) Helleseth, Tor; Li, Chunlei; Xia, Yongbo (2024). Investigation of the permutation and linear codes from the Welch APN function. (external link) Xia, Yongbo; Li, Chunlei; Bao, Furong et al. (2024). Further investigation on differential properties of the generalized Ness–Helleseth function. (external link) Gui, Yiming; Liu, Zilong; Yu, Lisu et al. (2024). Novel Power-Imbalanced Dense Codebooks for Reliable Multiplexing in Nakagami Channels. (external link) Sarkar, Palash; Li, Chunlei; Majhi, Sudhan et al. (2024). New Correlation Bound and Construction of Quasi-Complementary Sequence Sets. (external link) Xia, Yongbo; Bao, Furong; Chen, Shaoping et al. (2024). More Differential Properties of the Ness-Helleseth Function. (external link) Yuan, Qin; Li, Chunlei; Zeng, Xiangyong et al. (2024). Further Investigations on Nonlinear Complexity of Periodic Binary Sequences. (external link) 2023 Franch, Ermes; Li, Chunlei; Gaborit, Philippe (2023). Generalized low rank parity check codes. (external link) Li, Kangquan; Li, Chunlei; Helleseth, Tor et al. (2023). Further investigations on permutation based constructions of bent functions. (external link) Pai, Cheng-Yu; Liu, Zilong; Li, Chunlei et al. (2023). Sparse Complementary Pairs with Additional Aperiodic ZCZ Property. (external link) Franch, Ermes; Li, Chunlei (2023). Two new algorithms for error support recovery of low rank parity check codes. (external link) 2022 Yan, Haode; Xia, Yongbo; Li, Chunlei et al. (2022). The Differential Spectrum of the Power Mapping x<sup>p</sup>n<sup>-3</sup>. (external link) Kadir, Wrya Karim Kadir; Li, Chunlei; Zullo, Ferdinando (2022). Encoding and decoding of several optimal rank metric codes. (external link) Li, Kangquan; Zhou, Yue; Li, Chunlei et al. (2022). Two New Families of Quadratic APN Functions. (external link) Li, Chunlei; Riera, Constanza Susana; Stanica, Pantelimon (2022). Dillon's switching method generalized to c-differentials. (external link) Man, Yuying; Xia, Yongbo; Li, Chunlei et al. (2022). On the differential properties of the power mapping x^{p^m+2}. (external link) 2021 Li, Kangquan; Li, Chunlei; Helleseth, Tor et al. (2021). Binary Linear Codes With Few Weights From Two-to-One Functions. (external link) Helleseth, Tor; Katz, Daniel J.; Li, Chunlei (2021). The Resolution of Niho's Last Conjecture Concerning Sequences, Codes, and Boolean Functions. (external link) Canteaut, Anne; Kölsch, Lukas; Li, Chao et al. (2021). Autocorrelations of Vectorial Boolean Functions. (external link) Kadir, Wrya Karim Kadir; Li, Chunlei; Zullo, Ferdinando (2021). On interpolation-based decoding of a class of maximum rank distance codes. (external link) Li, Kangquan; Li, Chunlei; Helleseth, Tor et al. (2021). Cryptographically strong permutations from the butterfly structure. (external link) Helleseth, Tor; Li, Chunlei (2021). Pseudo-Noise Sequences. (external link) Kadir, Wrya Karim Kadir; Li, Chunlei; Zullo, Ferdinando (2021). Decoding a class of maximum Hermitian rank metric codes. (external link) Li, Kangquan; Li, Chunlei; Helleseth, Tor et al. (2021). A Complete Characterization of the APN Property of a Class of Quadrinomials. (external link) See a complete overview of publications in Cristin. My publications in the aforementioned areas can be found at this link. Below are the most recent ones Projects ForestWeb3.0, funded by the Biodiversa+ (Partner)SEquences and Their Applications, funded by the Research Council of Norway (Principle Investigator)Secure E-Healthcare Data Sharing by Blockchain Technology, funded by the Uni-Nett Vest",
  "content_length": 7575,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:00"
}