{
  "name": "Chunyang Chen 0001",
  "homepage": "https://chunyang-chen.github.io",
  "status": "success",
  "content": "Chunyang Chen's page | Technical University of Munich I am a full professor (Chair for Software Engineering & AI) in Department of Computer Science, Technical University of Munich, Heilbronn, Germany, core member of Munich Data Science Institute, board member of Heilbronn Data Science Center, Fellow in Fortiss and also an adjunct professor in Monash University, Australia. I obtained my PhD from Nanyang Technological University (NTU), Singapore. When pronouncing my first name, \"Chunyang\" sounds like \"train young\" which is exactly my job in the university. My research focuses on Software Engineering, Deep Learning and Human-Computer Interaction. Specifically, I apply AI/ML, NLP and light-weight program analysis technology in the following directions: AI(LLM)-assisted automated mobile app development including requirement elicitation [ICSE'19a, TOSEM'21, TSE'22], UI design [CSCW'19, CSCW'20, ICSE'21a], UI code generation [ICSE'18, TOSEM'20, FSE'20], app GUI testing [CHI'22, ICSE'23a, ICSE'23b], usability [ICSE'20a, ASE'20, ASE'22], accessibility testing [ICSE'20b, TSE'21], and bug replay [ICSE'22, ICSE'23, ICSE'24]. AI-empowered mining software repository including library/API migration [ASE'18a, TSE'19a], collaborative editing [CSCW'17, CSCW'18, CSCW'21], query reformulation [ASE'16, ICSE'21c], and thesaurus construction[ICSE'17, TSE'19]. Robustness and security of deep learning and mobile apps including on-device model attack [ICSE'21-SEIP, TIFS'22], backdoor attack [ICSE'21d], phishing attack [TDSC'19] and deep learning defence [ASE'18, ISSTA'23]. Large-Languagel Model (LLM) for software engineering and HCI including software testing [ICSE'23, ICSE'24a, ICSE'24b, TSE'24], bug replay [ISSTA'24, ICSE'24c, ICSE'24d], software accessibility [CHI'24], smart assistant development [UIST'24] and dataset construction [CHI'24] with all our LLM-relevant works in this page. News 2025 May, please submit your paper to the special issue \"When Software Security Meets Large Language Models: Opportunities and Challenges\" in EMSE by August 15, 2025. 2024 May, We received the Best Paper Honorable Mention in CHI 2024. 2024 Feb, I moved from Monash University, Australia to TUM, Germany. I am now recruiting staff to join our team. I am always looking for self-motivated PhD students with full scholarship Open Position, and long-term visting scholars/students. For master and bachelor students in TUM, we provide a list of thesis projects and please follow instructions there. Awards Best Paper Honorable Mention in CHI 2024 Discovery Early Career Researcher Award (DECRA) from Australian Research Council ACM SIGSOFT Early Career Researcher Award 2023 ACM SIGSOFT Distinguished Paper Award in ICSE 2023 ACM SIGSOFT Distinguished Paper Award in ICSE 2021 Dean's Award for Research Impact (Economic and Social Impact) in Faculty of IT, Monash University. Facebook Research Award in Probability and Programming 2020 ACM SIGSOFT Distinguished Paper Award in ICSE 2020 ACM SIGSOFT Distinguished Paper Award in ASE 2018 Best Paper Award in SANER 2016 Best Tool Demo in ASE 2016 Selected recent publications [ACL-25-Finding] A Semantic-Aware Layer-Freezing Approach to Computation-Efficient Fine-Tuning of Language Models The 63rd Annual Meeting of the Association for Computational Linguistics Jian Gu, Aldeida Aleti, Chunyang Chen, Hongyu Zhang PDF [FSE-25-Industry] From Prompts to Templates: A Systematic Prompt Template Analysis for Real-world LLMapps ACM International Conference on the Foundations of Software Engineering Yuetian Mao, Junjie He, Chunyang Chen PDF · Acceptance rate: 11.4% (70/612) · Code [FSE-25] Automated Soap Opera Testing Directed by LLMs and Scenario Knowledge: Feasibility, Challenges, and Road Ahead ACM International Conference on the Foundations of Software Engineering Yanqi Su, Zhenchang Xing, Chong Wang, Chunyang Chen, Xiwei Xu, Qinghua Lu, Liming Zhu PDF · Acceptance rate: 11.4% (70/612) [FSE-25] Standing on the Shoulders of Giants: Bug-Aware Automated GUI Testing via Retrieval Augmentation ACM International Conference on the Foundations of Software Engineering Mengzhuo Chen, Zhe Liu, Chunyang Chen, Junjie Wang, Boyu Wu, Jun Hu, Qing Wang To appear · Acceptance rate: 11.4% (70/612) [ICSE-25-Industry] Agent for User: Testing Multi-User Interactive Features in TikTok ACM CHI conference on Human Factors in Computing Systems Sidong Feng, Changhao Du, Huaxiao Liu, Qingnan Wang, Zhengwei Lv, Gang Huo, Xu Yang, Chunyang Chen PDF [USENIX-25] THEMIS: Towards Practical Intellectual Property Protection for Post-Deployment On-Device Deep Learning Models The 34th USENIX Security Symposium Yujin Huang, Zhi Zhang, Qingchuan Zhao, Xingliang Yuan, Chunyang Chen PDF · Code [TOSEM-25] An Empirical Study on Challenges for LLM Developers ACM Transactions on Software Engineering and Methodology Xiang Chen, Chaoyang Gao, Chunyang Chen, Guangbei Zhang, Yong Liu PDF [TSE-24] Software Testing with Large Language Model: Survey, Landscape, and Vision IEEE Transactions on Software Engineering Junjie Wang, Yuchao Huang, Chunyang Chen, Zhe Liu, Song Wang, Qing Wang PDF See more papers in the full list, and our recently works about LLM can be seen in the seperate page. Supervision Postdoc Shengcheng Yu (Feb.2025-), Technical University of Munich Yanqi Su (Sep.2024-), Technical University of Munich Mark Huasong Meng (Sep.2024-), Technical University of Munich Wenchao Gu (Jun.2024-), Technical University of Munich PhD Zhen Tao (Feb.2025-), Technical University of Munich Zixu Wang (Dec.2024-), Technical University of Munich (with Infineon) Ezgi Sarıkayak (Nov.2024-), Technical University of Munich (with Siemens) Kai Huang (Nov.2024-), Technical University of Munich DAAD IFI Scholarship Shen Hu (Nov.2024-), Technical University of Munich Bavarian Research Institute for Digital Transformation (BIDT) Scholarship Yuetian Mao (Jun.2024-), Technical University of Munich Ludwig Felder (Jun.2024-), Technical University of Munich Software Campus Funds Sidong Feng (May.2023-), Monash University Chinese Government Award for Outstanding Self-financed Students Abroad 2024 ACM SIGSOFT Distinguished Paper Award at ICSE 2023 Yujin Huang (Dec.2022-), Monash University --> University of Melbourne (Co-supervised with Xingliang Yuan) Dean's Award for Excellence by a Graduate Research Student at Department of Software Systems & Cybersecurity, 2023, Monash University Jian Gu (Nov.2022-), Monash University (Co-supervised with Aldeida Aleti) Han Wang (May.2021-Nov.2024), Monash University First job: Software Engineer in InvestorHub. Dean's Award for Excellence by a Graduate Research Student at Department of Software Systems & Cybersecurity, 2022, Monash University Han Hu (Jan.2021-Jul.2024), Monash University Suyu Ma (Mar.2020-Aug.2024), Monash University (Co-supervised with John Grundy) First job: Research Scientist in Data61, CSIRO. Jieshan Chen (Aug.2018- Feb.2022), Australian National University (Co-supervised with Zhenchang Xing) First job: Research Scientist in Data61, CSIRO. ACM SIGSOFT Distinguished Paper Award at ICSE 2020 Visiting/Remote students Zhe Liu (Jan.2020- Jun.2023), Chinese Academy of Sciences First job: Assistant Prof in Institute of Software, Chinese Academy of Sciences. Best Paper Honorable Mention in CHI 2024 ACM Student Research Competition Grand Finals Winner, 2023 Yuhui Su (Jul.2020-Aug.2022), Chinese Academy of Sciences Tianming Zhao (Jan.2019-Dec.2020), Jilin University Kaibo Cao (Jul.2019-Dec.2020), Nanjing University ACM SIGSOFT Distinguished Paper Award at ICSE 2021 Zhidan Yuan (Sep.2019-Dec.2019), Nantong University Dun Zhang (Jan.2019-Apr.2019), Nantong University Master/Bachelor 2022 (Monash) Dustin Minh Duc Vu [project], Jason Siu [project] 2021 (Monash) Ruiqi Dong [project], Minh Nguyen [project], An-Chieh Chang [project] 2020-2021 (Monash) Chao Wu [project], Yujin Huang [project], \tIshan Joshi [project], Xinyan Li [project] 2018~2019 (ANU) Chen Xi [project], Kai Xi [project], Wang Ruiqi [project], Wang Yuyang [project], Feng Sidong [project] 2018 (ANU) Wang Xu [project], Qiu Zhuoqi [project], Huang Yi [project], Yang Renfei [project], Li Yuchen [project], Li Zhiheng [project] 2017~2018 (NTU) Chow Wei Jun Bernard [project], Koh Hong Da [project], Lin Tian [project] 2017 (ANU) Wang Qiancheng [project], Cao Jixuan [project], Yuan Tonghui [project] 2016~2017 (NTU) Kent Ong Long Xiong [project], Tee Li Yin [project], Toh Gao Han [project], Linus Lim Ji Wei [project] 2015~2016 (NTU) Teong Ke Ming [project], Lee Yong Ming Leon [project], Wang Ximing [project] Teaching 2025 Summer | Lecturer | CITHN2014-Foundations and Application of Generative AI 2024 Winter | Lecturer | CITHN3003-Advanced Topics on Software Engineering 2024 Winter | Lecturer | CITHN2014-Foundations and Application of Generative AI 2024 Summer | Lecturer | CITHN4004-Foundations and Application of Generative AI 2024 Summer | Lecturer | INHN0015-Seminar Automated Mobile App Testing 2023 S1 | Lecturer & Chief examiner | FIT3170-Software Engineering Practice 2022 FY | Lecturer & Chief examiner | FIT3170-Software Engineering Practice 2021 FY | Lecturer & Chief examiner | FIT3170-Software Engineering Practice 2020 S1 | Lecturer & Chief examiner | FIT9136-Algorithms and Programming Foundations in Python 2019 S1 | Lecturer & Chief examiner | FIT9133-Programming Foundations in Python 2017 Fall | Tutorial advisor | CZ3003-Software Systems Analysis & Design 2017 Spring | Lab assistant | CZ3003-Software Systems Analysis & Design 2016 Fall | Lab assistant | CE2006-Software Engineering 2016 Spring | Lab assistant | CZ2002-Objective Oriented Design & Programming 2015 Fall | Lab assistant | CZ3003-Software System Analysis & Design Service Organisation Guest Editor, Special Issue on When Software Security Meets Large Language Models: Opportunities and Challenges, Springer Empirical Software Engineering Schedule Co-Chair: 45th International Conference on Software Engineering (ICSE-23) Volunteer Co-Chair: IEEE/",
  "content_length": 12938,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:58"
}