{
  "name": "Chung-Kil Hur",
  "homepage": "http://sf.snu.ac.kr/gil.hur",
  "status": "success",
  "content": "Chung-Kil Hur Professor, Department of Computer Science and Engineering Adjunct Professor, Department of Mathematical Sciences Address Department of Computer Science and Engineering Seoul National University 1 Gwanak-ro, Gwanak-gu, Seoul 08826, Republic of Korea Email: gil.hur#sf:snu:ac:kr where # is @ and : is . Tel: +82 (0)2 880 1844 Research Interests Programming Languages in general. Specifically: Software Verification (Program Logic & Compiler Correctness) Relaxed Memory Concurrency Semantics of Low-level Languages (LLVM, C/C++, Rust) Interactive Theorem Proving Probabilistic Programs & Bayesian Inference Category Theory Education 10.2004 ~ 10.2009 : Ph.D. in Computer Science at University of Cambridge (Supervisor: Marcelo Fiore). 03.1995 ~ 02.2000 : B.S. in Mathematics and Computer Science at KAIST. Research Experience 09.2022 ~ present : Professor in the Department of Computer Science and Engineering at Seoul National University. 09.2017 ~ 08.2022 : Associate professor in the Department of Computer Science and Engineering at Seoul National University. 03.2016 ~ present : Adjunct professor in the Department of Mathematical Sciences at Seoul National University. 09.2013 ~ 08.2017 : Assistant professor in the Department of Computer Science and Engineering at Seoul National University. 09.2012 ~ 08.2013 : Post-doctoral researcher in the Programming Principles and Tools Group at Microsoft Research Cambridge. 10.2010 ~ 08.2012 : Post-doctoral researcher in the Foundations of Programming Group at Max Planck Institute for Software Systems (MPI-SWS). 11.2009 ~ 09.2010 : Post-doctoral researcher at Laboratoire Preuves, Programmes et Systèmes (PPS), CNRS & Université Paris Diderot. 11.2008 ~ 01.2009 : Research intern in the Programming Principles and Tools Group at Microsoft Research Cambridge. 07.2003 ~ 02.2004 : Research Assistant in the Advanced Information Technology Research Center (AITrc) at KAIST. Honors and Awards PLDI 2021 Distinguished Paper Award. POPL 2020 Distinguished Paper Award. PLDI 2017 Distinguished Paper Award. Samsung Scholarship (formerly known as Samsung LeeKunHee Scholarship), 2003. Bronze medal in the 35th International Mathematical Olympiad (IMO), 1994. Bronze medal in the 6th Asian Pacific Mathematics Olympiad (APMO), 1994. Professional Activities Organizing committee member PLDI 2025 (General chair) Program committee (PC) member CPP 2026, APLAS 2023 (PC chair), ICFP 2023, PLDI 2023, OOPSLA 2022, CoqPL 2022, PriSC 2021, CPP 2021, POPL 2020, PLDI 2019, PriSC 2019, APLAS 2018, PPDP 2018, ITP 2018, ICFP 2017, PPS 2016, POPL 2016, APLAS 2015, LOLA 2015, CPP 2015, HOPE 2013, PLPV 2013, APLAS 2012, Coq 2012 External review committee (ERC) member ICFP 2019, POPL 2017, POPL 2015 Invited speaker/lecturer The 14th ACM SIGPLAN International Conference on Certified Programs and Proofs (CPP 2025) Deepspec Workshop 2019 Joint Special Session on Coinduction for Verification and Certification of CALCO 2019 and MFPS 2019 (CALCO-MFPS-2019) Deepspec Workshop 2018 Shonan School on Semantics of Effects, Resources and Applications (NII Shonan Meeting Seminar 103), 2017 The Second International Workshop on Coq for PL (CoqPL 2016) Deepspec Workshop 2016 Programming and Programming Language Workshop (PPL 2015) Invited participant Dagstuhl Seminar on Secure Compilation (Dagstuhl 21481), 2021 Dagstuhl Seminar on Secure Compilation (Dagstuhl 18201), 2018 Dagstuhl Seminar on Compositional Verification Methods for Next-Generation Concurrency (Dagstuhl 15191), 2015 Dagstuhl Seminar on Challenges and Trends in Probabilistic Programming (Dagstuhl 15181), 2015 Dagstuhl Seminar on Modelling, Controlling and Reasoning About State (Dagstuhl 10351), 2010 Software Heq A Coq library to support reasoning about Heterogeneous Equality. Hpattern A generalized version of the tactic ‘pattern’ in Coq. Paco A Coq library for parameterized coinduction. R2 Project Bayesian inference system for probabilistic programs. SepCompCert Verification of separate compilation of CompCert Teaching See Courses. Research Advisees See People. Publications See Publications. Talks Not updated since 2013. The power of parameterization in coinductive proof. Chocola Seminar, Lyon, France, 14 Mar 2013. POPL 2013, Rome, Italy, 23 Jan 2013. [slides: pdf] Compositional inter-language relational verification (using interactive theorem prover). Seoul National University, Seoul, Korea, 10 Dec 2012. The power of parameterization in coinductive proof. Semantics Lunch Seminar, University of Cambridge, Cambridge, UK, 22 Oct 2012. Compositional inter-language relational verification. Yale University, New Haven, USA, 14 May 2012. KAIST, Daejeon, Korea, 23 Apr 2012. University of Colorado at Boulder, Boulder, USA, 13 Apr 2012. Microsoft Research Cambridge, Cambridge, UK, 30 Mar 2012. Compositional software verification. Seoul National University, Seoul, Korea, 16 Dec 2011. The marriage of bisimulations and Kripke logical relations. ROPAS Weekly Show & Tell, Seoul National University, Seoul, Korea, 9 Sep 2011. A Kripke logical relation between ML and assembly. PL/Verification Seminar, MPI-SWS, Saarbrücken, Germany, 25 Feb 2011. POPL 2011, Austin, USA, 26 Jan 2011. [abstract: txt] [slides: pptx (powerpoint 2010)] A Kripke logical relation between ML and assembly. Dagstuhl Seminar: Modelling, Controlling and Reasoning About State, Schloss Dagstuhl, Germany, 1 Sep 2010. [abstract: txt] [slides: pdf] Heq: a Coq library for heterogeneous equality. Coq Workshop 2010, Edinburgh, U.K., 9 Jul 2010. [abstract: txt] [slides: pdf] Program equivalence and compositional compiler correctness. Max Planck Institute for Software Systems (MPI-SWS), Saarbrücken, Germany, 22 Mar 2010. [abstract: txt] [slides: pdf] Observational equivalence on low-level programs and compositional compiler correctness. Type theory and realizability, PPS, Paris, France, 2 Dec 2009. [abstract: txt] [slides: pdf] Logical relations and compositional compiler correctness. ROSAEC Center Seminar, Seoul National University, Seoul, Korea, 14 Oct 2009. Programming Languages Laboratory Seminar, KAIST, Daejeon, Korea, 21 Oct 2009. [abstract: txt] [slides: pdf] Biorthogonality, step-indexing and compiler correctness. ICFP 2009, Royall College of Physicians, Edinburgh, UK, 31 Aug 2009. [abstract: txt] [slides: pdf] Compiler correctness and observational equivalence on machine code. Semantics Lunch, Computer Laboratory, Cambridge, UK, 16 Mar 2009. [abstract: txt] [slides: pdf] Categorical equational systems. PhD Seminar, University of Leicester, Leicester, UK, 02 Dec 2008. [abstract: txt] [slides: pdf] Term equational systems and logics. KAIST Discrete Math Seminar, KAIST, Daejeon, Korea, 11 Aug 2008. Programming Languages Laboratory Seminar, KAIST, Daejeon, Korea, 12 Aug 2008. [abstract: txt] [slides: pdf] Term equational systems and logics. MFPS 2008, University of Pennsylvania, Philadelphia, USA, 24 May 2008. [abstract: txt] [slides: pdf] Term equational rewrite systems and logics. Semantics Lunch, Computer Laboratory, Cambridge, UK, 11 Feb 2008. [abstract: txt] [slides: pdf] Applications of equational systems: nominal equational logic. Computational Applications of Nominal Sets (CANS) Meeting, Computer Laboratory, Cambridge, UK, 25 Oct 2007. [slides: pdf] Equational systems and free constructions. ICALP 2007, University of Wroclaw, Poland, 12 Jul 2007. [abstract: txt] [slides: pdf] Equational systems and free constructions. Extreme Theory Meeting, Computer Laboratory, Cambridge, UK, 28 Jun 2007. Algebraic theories in the presence of binding operators, substitution, etc. Semantics Lunch, Computer Laboratory, Cambridge, UK, 20 Mar 2006. [abstract: txt] [slides: pdf] Abstract models for structural data and its substitution. Extreme Theory Meeting, Computer Laboratory, Cambridge, UK, 19 Oct 2005.",
  "content_length": 7830,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:56"
}