{
  "name": "Chun Kit Chui",
  "homepage": "https://www.cs.hku.hk/index.php/people/academic-staff/ckchui",
  "status": "success",
  "content": "Chui, C.K. The School of Computing and Data Science (https://www.cds.hku.hk/) was established by the University of Hong Kong on 1 July 2024, comprising the Department of Computer Science and Department of Statistics and Actuarial Science and Department of AI and Data Science. HomeAbout UsMessage to StudentsOur HistoryDept VideosComputing FacilitiesHow to Get Here & Where to StayLocation MapContact InformationPeopleAcademic StaffAdministrative StaffResearch StudentJob OpeningsTeaching & LearningUndergraduateBEng (Computer Science)AdmissionCurriculumAcademic AdvisingProg Objectives & Learning OutcomesCourse DescriptionsCareer ProspectsBASc(FinTech)OverviewAdmissionCurriculumAcademic AdvisingProgramme Learning OutcomesCareer Prospects2nd Major in CSMinor in Computer Science BBA(IS)/BEng(CompSc)Course OfferedFinal Year ProjectsFinal Year Project ExhibitionFinal Year Project CompetitionIndustry-based ProjectsDownload AreaPostgraduateResearch BasedMPhil/PhDProgramme StructureAdmissionFurther InquiriesStudent Conference Travel SupportCourse Offered and Seminar RequirementsTaught BasedMSc(CompSc)MSc(ECom&IComp)MSc(FTDA) MDASCMSc(AI)ResearchResearch Groups & LaboratoriesInnovation & Technology ProjectsResearch ProjectsResearch HighlightsMajor FacilitiesCS Past ThesesCS Technical ReportsCS Research InternshipNews & EventsIn the MediaPhoto GallerySeminars and EventsNews and AnnouncementsCompetitionsAbout the StudentsStudent Bodies Hiring StudentsInformation for EmployersHKUCS Job Portal MENU HomeAbout UsMessage to StudentsOur HistoryDept VideosComputing FacilitiesHow to Get Here & Where to StayLocation MapContact InformationPeopleAcademic StaffAdministrative StaffResearch StudentJob OpeningsTeaching & LearningUndergraduateBEng (Computer Science)AdmissionCurriculumAcademic AdvisingProg Objectives & Learning OutcomesCourse DescriptionsCareer ProspectsBASc(FinTech)OverviewAdmissionCurriculumAcademic AdvisingProgramme Learning OutcomesCareer Prospects2nd Major in CSMinor in Computer Science BBA(IS)/BEng(CompSc)Course OfferedFinal Year ProjectsFinal Year Project ExhibitionFinal Year Project CompetitionIndustry-based ProjectsDownload AreaPostgraduateResearch BasedMPhil/PhDProgramme StructureAdmissionFurther InquiriesStudent Conference Travel SupportCourse Offered and Seminar RequirementsTaught BasedMSc(CompSc)MSc(ECom&IComp)MSc(FTDA) MDASCMSc(AI)ResearchResearch Groups & LaboratoriesInnovation & Technology ProjectsResearch ProjectsResearch HighlightsMajor FacilitiesCS Past ThesesCS Technical ReportsCS Research InternshipNews & EventsIn the MediaPhoto GallerySeminars and EventsNews and AnnouncementsCompetitionsAbout the StudentsStudent Bodies Hiring StudentsInformation for EmployersHKUCS Job Portal Home People Academic Staff Chui, C.K. Professor Chui, Chun Kit BSc HK; M.Phil, PhD HKU Distinguished Teaching Fellow 2026-2027Assistant Dean (Teaching and Learning - UG), Faculty of EngineeringPrincipal Lecturer (Associate Professor of Teaching), Faculty of EngineeringDirector of Tam Wing Fan Innovation Wing Part-time lecturer in Computer Science division, School of Computing & Data Science Tel: (+852) 3910 2399Email: ckchui@cs.hku.hk Professor Chun Kit Chui is a Principal Lecturer (Associate Professor of Teaching) and Assistant Dean (Teaching and Learning - UG) in the Faculty of Engineering at the University of Hong Kong (HKU). He also holds the position of Director at the Tam Wing Fan Innovation Wing within the Faculty of Engineering. With over 13 years of teaching experience (2011-2024) as a lecturer / senior lecturer in the Computer Science department, Prof. Chui's research / educational interests include database and data mining, as well as pedagogical research in computing and engineering education. He has received recognition for his contribution to tertiary education, including the University Distinguished Teaching Award 2024, and the University Outstanding Teaching Award (Individual Award) at the University of Hong Kong for the 2015-16 academic year and the Faculty Outstanding Teaching Award (Individual Award) in the Faculty of Engineering for the 2023-24 and 2012-13 academic years. Recognized for his teaching excellence, Prof. Chui has been honoured with the Teaching Excellence Award in the Department of Computer Science for the academic years 2011-12, 2012-13, 2013-14, 2014-15, and 2015-16. Moreover, he was a finalist for the UGC Teaching Award (Early Career Faculty Member). Prof. Chui is deeply committed to a teaching career, with a philosophy centered on empowering students to \"Dream Big, Start Small, and Learn Fast!\". As a Computer Science educator, his approach emphasizes pedagogical innovation, focusing on hands-on and self-directed learning in technology to facilitate rapid skill acquisition. As the Director of the HKU Innovation Wing project, Prof. Chui has led its design, construction, and operation, providing students with opportunities to transform their innovative ideas into reality through hands-on prototyping. He actively engages with students and educators across disciplines at HKU, fostering a culture of student-initiated interest groups. These groups promote cross-disciplinary learning and enable students to explore their aspirations in computing and engineering technology innovation alongside their peers. Academic Interests Computing Education, Engineering Education, Database and Data Mining, AI education, Infrastructure and facility development for Teaching & Learning Selected Publications Chun-Kit Chui, Match Ko, Ryan Chan, et. al, Overseas Team Building for Student Leaders in Academic Makerspaces. The annual conference and exposition of the American Society for Engineering Education (ASEE 2025). Lei Yang, Chun-Kit Chui, et. al, Equipping Academic Makerspaces with Artificial Intelligence Elements. The annual conference and exposition of the American Society for Engineering Education (ASEE 2025). Lei Yang, Chun-Kit Chui, et. al, An Experiential Learning Framework to Harvest Synergy from College and Industry Partnership. The annual conference and exposition of the American Society for Engineering Education (ASEE 2025). Chun-Kit Chui, Norman N.C. Tien. The Journey of Establishing and Operating an Innovation Center to Nurture Future Engineering Innovators. The annual conference and exposition of the American Society for Engineering Education (ASEE 2024). Chun-Kit Chui, Lei Yang, Ben Kao. A Framework for Developing Hands-on Competency in Generative AI with Ethical Considerations. The annual conference and exposition of the American Society for Engineering Education (ASEE 2024). Match Ko, Fu Zhang, Chun-Kit Chui. Nurturing Student Innovation and Leadership through Student-Initiated Interest Groups. The annual conference and exposition of the American Society for Engineering Education (ASEE 2024). Ryan Chan, HH Cheung, Match Ko, Chun-Kit Chui, Lei Yang. Preparing Students for Successful Industrial Collaborations in Engineering. The annual conference and exposition of the American Society for Engineering Education (ASEE 2024). Natalie Chan, Chun-Kit Chui. Embrace Diversity and Inclusion in Academic Makerspaces with a Network of Tutors. The annual conference and exposition of the American Society for Engineering Education (ASEE 2024). Vincent Tam, Chun-Kit Chui, Hayden Kwok-Hay So, Nyein Thwe Khaing, Chung To Kong, and Subhayan Roy. Urban Farming in Myanmar: An Experiential Learning Project for Engineering and Science Students from Hong Kong and Myanmar. IEEE International Conference on Teaching, Assessment, and Learning for Engineering (TALE 2018). Chun-Kit Chui, Hayden Kwok-Hay So and Nyein Thwe Khaing, Wastewater Treatment in Myanmar: A Multidisciplinary Learning Experience for Engineering and Science Students from Two Countries., The 124th annual conference and exposition of the American Society for Engineering Education (ASEE 2017) Kevin Y. Yip, Xinjie Zhu, Ben Kao, Chun-Kit Chui and Sau Dan Lee, Mining Order-Preserving Submatrices from Data with Repeated Measurements, IEEE Transactions on Knowledge and Data Engineering (IEEE TKDE 2013) Chun-Kit Chui, Ben Kao, Eric Lo, Reynold Cheung, I/O Efficient Algorithms for Evaluating Pattern-Based Aggregate Queries in a Sequence OLAP System, The 20th ACM Conference on Information and Knowledge Management (CIKM 2011) Chun-Kit Chui, Ben Kao, Eric Lo and David Cheung, S-OLAP: an OLAP system for analyzing sequence data, ACM SIGMOD International Conference on Management of Data (SIGMOD 2010) Chun-Kit Chui, Eric Lo, Ben Kao and Wai-Shing Ho, Supporting Ranking Pattern-Based Aggregate Queries in Sequence Data Cubes, The 18th ACM Conference on Information and Knowledge Management (CIKM 2009) Eric Lo, Ben Kao, Wai-Shing Ho, Sau-Dan Lee, Chun-Kit Chui and David W. Cheung, OLAP on Sequence Data, ACM SIGMOD International Conference on Management of Data (SIGMOD 2008) Chun-Kit Chui, Ben Kao, Kevin Y. Yip, and Sau Dan Lee, Mining Order-Preserving Submatrices from Data with Repeated Measurements, The 2008 IEEE International Conference on Data Mining (ICDM 2008) Wang Kay Ngai, Ben Kao, Chun-Kit Chui, Reynold Cheng, Michael Chau and Kevin Y. Yip, Efficient Clustering of Uncertain Data, The 2006 IEEE International Conference on Data Mining (ICDM 2006) Awards Distinguished Teaching Fellow 2026-2027, the University of Hong Kong. Recipient of the University Distinguished Teaching Award 2024, the University of Hong Kong. Recipient of the Faculty Outstanding Teaching Award (Individual Award) 2023-24, Faculty of Engineering, the University of Hong Kong. Recipient of the Most Influential Paper Award 2015. The 21st Pacific-Asia Conference on Knowledge Discovery and Data Mining. Finalist of the UGC Teaching Award (Early Career Faculty Members Individual Award) 2016, University Grants Committee. Nominated by the University of Hong Kong. Recipient of the HKU Outstanding Teaching Award (Individual Award), Teaching Excellence Award Scheme 2015-16, the University of Hong Kong. Recipient of the Facu",
  "content_length": 11633,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:49"
}