{
  "name": "Chunyu Lin",
  "homepage": "http://faculty.bjtu.edu.cn/8549",
  "status": "success",
  "content": "北京交通大学教师名录 林春雨 博士 、教授 、信息所党支书兼任信息所副所长 基本信息 办公电话：010-5168616 电子邮件： cylin@bjtu.edu.cn 通讯地址：北京交通大学信息科学研究所9教北618 邮编：100044 个人简介 北京交通大学优秀教师。长期从事图像处理、三维视觉、自动驾驶感知方面的研究，在CVPR ICCV ECCV等顶会以及IEEE TPAMI TIP等TRANS期刊发表论文40余篇。一直在一线科研及教学，担任本硕博导师，指导本科毕设40余次，10人次获优秀，3人次获校级优秀本科毕业设计，1名同学获北京市优秀本科毕业设计，指导本科生各类竞赛，获国家级一等奖及二等奖各1项，省部级奖项7项。指导研究生中，获北京市优秀毕业研究生4人，获校级优秀研究生毕业生5人，校级优秀研究生毕业论文7人，校级优秀博士毕业论文1人，知行奖1人，电子学会优博论文1人。指导大创项目40余项项，其中10项获得国家级，7项获得北京市级。担任“英才计划”导师指导初高中生共6名，为中小学生进行科普报告。指导研究生获国际竞赛获CVPR-MLV挑战赛冠军1项，获中国研究生人工智能大赛国家级一等奖1项，二等奖2项。7次担任本硕博班班主任，获评优秀班主任多次。先后主持国家重点研发计划任务、国家自然科学基金、北京市自然科学基金、高等学校博士点基金等纵向项目，主持中车四方车辆研究所、中国移动研究院、毫末智行科技有限公司、京天威科技有限公司等横向项目。授权发明专利20余件。获教育部、北京市等省部级科学技术奖励2项，中国图象图形学会科学技术奖励1项。 研究领域细化 三维视觉（图像点云标定融合，双目深度估计，RGB-D数据处理，基于深度学习的3D点云目标检测，基于深度学习的三维物体尺寸感知，三维重建，虚拟视点生成） 图像视频编解码（图像编解码，3D视频编解码，基于深度学习的全景图像视频编码，HEVC/H.265，容错视频编解码，流媒体传输等） 基于视觉的ADAS及自动驾驶（3D环视辅助驾驶、机器人导航定位及路径规划（强化学习）、三维障碍物检测、多传感器融合、行人检测及姿态估计，车道线检测，停车位检测等，虚拟数据到真实数据迁移算法，自动驾驶场景物体自动标注） 虚拟现实及增强现实中的视觉算法研究（虚拟现实相机，全景图像拼接，增强现实中的平面检测，虚拟视角合成，神经网络辐射场NERF等） 2026年度硕士招生：已满（要求有内驱力，热爱课题组的研究方向） 2026年度博士招生：仍有名额（要求有内驱力，心理素质过硬，热爱课题组的研究方向） 招生专业 新一代电子信息技术（含量子技术等）硕士 软件工程硕士 人工智能硕士 大数据技术与工程硕士 新一代电子信息技术（含量子技术等）博士 人工智能博士 计算机科学与技术硕士 计算机技术博士 计算机技术硕士 低空技术与工程硕士 计算机科学与技术博士 软件工程博士 科研项目 重点资助项目: 自动驾驶场景的多传感器联合自动标定研究, 2023-2026 自然科学横向项目: 2023年“英才计划”北京交通大学组织实施工作, 2023-2023 自然科学横向项目: 智能驾驶场景下的自动标注关键技术研发, 2022-2025 自然科学横向项目: 图像与毫米波雷达数据融合采集及标注, 2022-2024 国家自然科学基金“面上”: 鱼眼图像处理的关键技术研究, 2022-2025 自然科学横向项目: 基于RGBD的静态物体云端三维重建原型系统开发, 2021-2022 自然科学横向项目: 多源信息融合障碍物检测系统, 2019-2025 国家自然科学基金“面上”: 深度神经网络辅助的交互式多视点视频技术研究, 2019-2022 自然科学横向项目: TOF超分和边缘优化技术合作项目, 2019-2020 其它: 虚拟现实视频的获取及编码算法, 2019-2021 国家重点研发计划-任务: 公共路权运行环境下行人运动状态感知、态势分析、风险辨识及预警技术, 2018-2020 自然科学横向项目: 中兴产学研项目-神经网络压缩算法FPGA实现, 2018-2020 基础研究项目: VR视频的高效模型表示及流式传输, 2018-2020 重大资助项目: 基于人工智能的轨道交通安全, 2018-2024 国家自然科学基金“面上”: 沉浸式3D全景视频的表示编码及传输, 2018-2021 重点资助项目: 面向轨道交通的跨视域多场景视频内容分析与安全, 2017-2019 教育部: 多媒体数字取证技术与语义实时处理技术在新型不良信息治理中的应用, 2017-2020 自然科学横向项目: 环视3D全景辅助汽车驾驶系统, 2016-2017 自然科学横向项目: 汽车全自动泊车系统, 2016-2017 自然科学横向项目: 汽车高级驾驶辅助系统（ADAS） , 2016-2022 国家自然科学基金: 基于DASH的交互式三维视频系统建模, 2016-2018 基础研究项目: MPTCP框架下多视点视频的可靠编码, 2015-2017 国家自然科学基金\"青年基金\": 三维视频显著对象编码及可靠传输, 2015-2017 博士点基金: 结合深度图特性的3D视频的鲁棒编码, 2014-2016 国家重点实验室: 面向交通安全监控的3D视频编码, 2013-2014 自然科学类人才基金项目: 立体视频中深度信息的提取及其鲁棒编解码, 2012-2014 国家自然科学基金“重大”（课题）: 基于对象和MacroCube 的三维视频的编码和理解, 2013-2017 教学工作 本科课程 C语言程序设计 本科课程 专业实践与训练 研究生课程 数字视频处理 研究生课程 计算机视觉中的多视几何 论文/期刊 近年来，课题组围绕图像视频处理，三维视觉处理，自动驾驶和辅助驾驶以及虚拟现实等领域在IEEE TPAMI、TIP、TITS、TCSVT、TMM等著名国际期刊以及CVPR、ICCV、ECCV、AAAI、ACMMM、ICRA等著名国际会议上发表论文，部分论文列表如下： DBLP查看最新论文列表 期刊论文： 1. L. Nie, C. Lin*, K. Liao, Y. Zhang, S. Liu and Y. Zhao, \"StabStitch++: Unsupervised Online Video Stitching with Spatiotemporal Bidirectional Warps,\" in IEEE Transactions on Pattern Analysis and Machine Intelligence, doi: 10.1109/TPAMI.2025.3568829. 2. Junsong Zhang, Zisong Chen, Chunyu Lin*,  Zhijie Shen, Lang Nie, Kang Liao and Yao Zhao, \"SGFormer: Spherical Geometry Transformer for 360° Depth Estimation,\" in IEEE Transactions on Circuits and Systems for Video Technology, 2025. 3. S. Liu, M. Hong, Y. Lu, N. Ye, C. Lin and B. Zeng, \"Unsupervised Global and Local Homography Estimation With Coplanarity-Aware GAN,\" in IEEE Transactions on Pattern Analysis and Machine Intelligence, vol. 47, no. 3, pp. 1863-1876, March 2025. 4. Jialin Yang, Chunyu Lin*, Lang Nie, Zisen Kong, Jiapeng Wang, Yao Zhao, Toward Oriented Fisheye Object Detection: Dataset and Baseline, ACM Transactions on Multimedia Computing, Communications and Applications, 21, 1, Article 17 (January 2025), 19 pages. 5. Zhijie Shen, Chunyu Lin*, Junsong Zhang, Lang Nie, Kang Liao, Yao Zhao, “360 Layout Estimation via Orthogonal Planes Disentanglement and Multi-view Geometric Consistency Perception”, in Transactions on Pattern Analysis and Machine Intelligence, vol.46, no.12, pp.10486-10498, Dec., 2024. 6. Lang Nie, Chunyu Lin*, Kang Liao, Shuaicheng Liu, Yao Zhao, “Semi-Supervised Coupled Thin-Plate Spline Model for Rotation Correction and Beyond,\" in Transactions on Pattern Analysis and Machine Intelligence, vol. 46, no. 12, pp.9192-9204, Dec. 2024, 2024. 7. K. Liao, X. Xu, C. Lin*, W. Ren, Y. Wei, and Y. Zhao, “Cylin-Painting: Seamless 360° Panoramic Image Outpainting and Beyond,\" in IEEE Transactions on Image Processing, vol. 33, pp. 382-394, 2024. 8. L. Nie, C. Lin*, K. Liao, S. Liu and Y. Zhao, \"Deep Rotation Correction Without Angle Prior,\" in IEEE Transactions on Image Processing, vol. 32, pp. 2879-2888, 2023. 9. C. Zhang, C. Lin*, K. Liao, Lang Nie, Yao Zhao, As-Deformable-As-Possible Single-image-based View Synthesis without Depth Prior[J]. IEEE Transactions on Circuits and Systems for Video Technology, vol. 33, no. 8, pp. 3989-4001, Aug. 2023. 10. Haojie Liu, Kang Liao, Chunyu Lin*, Yao Zhao, Yulan Guo, Pseudo-lidar point cloud interpolation based on 3d motion representation and spatial supervision, IEEE Transactions on Intelligent Transportation Systems, vol. 23, no. 7, pp. 6379-6389, 2022. 11. M. Liu, S. Jin, C. Yao, C. Lin, Y. Zhao. Temporal Consistency Learning of Inter-Frames for Video Super-Resolution[J]. IEEE Transactions on Circuits and Systems for Video Technology, 2022. 12. Z. Shen, C. Lin*, L. Nie, et al. Neural Contourlet Network for Monocular 360 Depth Estimation[J]. IEEE Transactions on Circuits and Systems for Video Technology, 2022, 32(12): 8574-8585. 13. C. Zhang, C. Lin*, K. Liao, S. Huang and Y. Zhao, \"Monocular Pseudo-LiDAR Point Cloud Extrapolation Based on Iterative Hybrid Rendering,\" in IEEE Transactions on Intelligent Transportation Systems, vol. 24, no. 3, pp. 2814-2826, March 2023. 14. Z. Zheng, C. Lin*, L. Nie, et al. Bi-Projection for 360° Image Object Detection Bridged by RoI Searcher[J]. Journal of Visual Communication and Image Representation, 2022, 89: 103660. 15. L. Nie, C. Lin*, K. Liao, et al. Learning Edge-preserved Image Stitching from Multi-scale Deep Homography[J]. Neurocomputing, 2022, 491: 533-543. 16. L. Nie, C. Lin*, K. Liao, et al. Depth-Aware Multi-Grid Deep Homography Estimation with Contextual Correlation[J]. IEEE Transactions on Circuits and Systems for Video Technology, 2021, 32(7): 4460-4472. 17. Keyao Zhao, Chunyu Lin*, Kang Liao, Shangrong Yang, Yao Zhao, Revisiting Radial Distortion Rectification in Polar-coordinates: A New and Efficient Learning Perspective, IEEE Transactions on Circuits and Systems for Video Technology, 2021. 18. Lang Nie, Chunyu Lin*, Kang Liao, Shuaicheng Liu, and Yao Zhao, Unsupervised deep image stitching: reconstructing stitched features to images, IEEE Transactions on Image Processing, vol. 30, pp. 6184-6197, 2021. 19. Kang Liao, Chunyu Lin*, Yao Zhao, and Moncef Gabbouj, Distortion rectification from static to dynamic: A distortion sequence construction perspective, IEEE Transactions on Circuits and Systems for Video Technology, vol. 30, no. 11, pp. 3870-3882, 2021. 20. Xue Zhang, Gene Cheung, Yao Zhao, Patrick Le Callet, Chunyu Lin, Jack Z. G. Tan, Graph Learning Based Head Movement Prediction for Interactive 360 Video Streaming. IEEE Trans. Image Process. 30: 4622-4636, 2021. 21. Keyao Zhao, Kang Liao, Chunyu Lin*, Meiqin Liu, and Yao Zhao, “Joint distortion rectification and super-resolution for self-driving scene perception,” Neurocomputing, vol. 435, pp. 176–185, 2021. 22. Kang Liao, Chunyu Lin*, and Yao Zhao, “A deep ordinal distortion estimation approach for distortion rectification,” IEEE Trans. Image Process., vol. 30, pp. 3362–3375, 2021. 23. Chunlan Zhang, Kang Liao, Chunyu Lin*, and Yao Zhao, “Pseudo-lidar point cloud magnification,” Neurocomputing, vol. 422, pp. 129–138, 2021. 24. Ning Yu, Chunyu Lin*, Yao Zhao, Meiqin Liu, and Xue Zhang, “360 video compression based on sphere-rotated frame prediction,” IET Image Process., vol. 14, no. 12, pp. 2711–2718, 2020. 25. Lang Nie, Chunyu Lin*, Kang Liao, Meiqin Liu, and Yao Zhao, “A view-free image stitching network based on global homography,” J. Vis. Commun. Image Represent., vol. 73, pp. 102950, 2020. 26. Kang Liao, Chunyu Lin*, Yao Zhao, Moncef Gabbouj, Yang Zheng, OIDC-Net: Omnidirectional Image Distortion Correction via Coarse-to-Fine Region Attention. J. Sel. Topics Signal Processing 14(1): 222-231 (2020). 27. Shangrong Yang, Chunyu Lin*, Kang Liao, Yao Zhao, Meiqin Liu, Unsupervised fisheye image correction through bidirectional loss with geometric prior. J. Vis. Commun. Image Represent. 66: 102692 (2020). 28. Haojie Liu, Kang Liao, Chunyu Lin*, Yao Zhao, Meiqin Liu, PLIN: A Network for Pseudo-LiDAR Point Cloud Interpolation. Sensors 20(6): 1573 (2020). 29. Kang Liao, Chunyu Lin*, Yao Zhao, Moncef Gabbouj, DR-GAN: Automatic Radial Distortion Rectification Using Conditional GAN in Real-Time. IEEE Trans. Circuits Syst. Video Techn. 30(3): 725-733 (2020). 30. Kang Liao, Chunyu Lin*, Yao Zhao, Mai Xu, Model-Free Distortion Rectification Framework Bridged by Distortion Distribution Map. IEEE Trans. Image Process. 29: 3707-3718 (2020). 31. Jian Jin, Jie Liang, Yao Zhao, Chunyu Lin, Chao Yao, Lili Meng, Pixel-Level View Synthesis Distortion Estimation for 3D Video Coding. IEEE Trans. Circuits Syst. Video Technol. 30(7): 2229-2239 (2020) 32. Xue Zhang, Laura Toni, Pascal Frossard, Yao Zhao, Chunyu Lin, Adaptive Streaming in Interactive Multiview Video Systems. IEEE Trans. Circuits Syst. Video Techn. 29(4): 1130-1144 (2019). 33. Jian Jin, Jie Liang, Yao Zhao, Chunyu Lin, Chao Yao, Anhong Wang, A Depth-Bin-Based Graphical Model for Fast View Synthesis Distortion Estimation. IEEE Trans. Circuits Syst. Video Technol. 29(6): 1754-1766 (2019) 34. C. Lin, Y. Zhao, J. Xiao and T. Tillo, \"Region-based multiple description coding for multiview video plus depth video,\" in IEEE Transactions on Multimedia, vol.20, no.5, pp.1209-1223, 2018. 35. Y. Gao, C. Lin*, Y. Zhao, X. Wang, S. Wei and Q. Huang, \"3-D Surround View for Advanced Driver Assistance Systems,\" in IEEE Transactions on Intelligent Transportation Systems, vol. 19, no. 1, pp. 320-328, Jan. 2018. 36. Qian Li, Chunyu Lin*, Yao Zhao, Geometric Features-Based Parking Slot Detection.",
  "content_length": 18643,
  "method": "requests",
  "crawl_time": "2025-12-01 12:53:58"
}