{
  "name": "Ciara Rafferty",
  "homepage": "https://pure.qub.ac.uk/en/persons/ciara-rafferty",
  "status": "success",
  "content": "Ciara Rafferty - Queen's University Belfast View Scopus Profile Ciara Rafferty Dr Senior Lecturer, School of Electronics, Electrical Engineering and Computer ScienceInstitute of Electronics, Communications & Information Technology Phone+44 (0)28 9097 1768Emailc.m.raffertyqub.acuk Room 0G.015 - Queens Titanic Quarter (QTQ)United Kingdom Accepting PhD StudentsPhD projects- Homomorphic encryption and other privacy preserving technologies- Hardware acceleration of cryptographic primitives- Post-quantum cryptography- Advanced cryptographic techniques, such as attribute-based encryption or identity-based encryption 20132025 Research activity per year Personal profile Research InterestsDr Ciara Rafferty is a Senior Lecturer at the Centre for Secure information Technologies, where she leads research into advanced cryptography and data security.  She was a post-doctoral Research Fellow in the H2020 SAFEcrypto project on quantum-safe cryptography.  She is Assistant Director, Co-I and QUB lead on the UK Integrated Quantum Networks (IQN) Hub.  She is Co-I of She was Co-I and QUB lead on Phase 2 of the UK Quantum Communications Hub (2019-2024) and Co-I on the Innovate UK AQuASeC project led by Toshiba Europe Limited (Nov 2018- Sept 2020) and the Rolls Royce funded project SEQURED (Nov 21-Nov 22). She is a senior member of IEEE and an EPSRC SPRITE+ Expert Fellow. Her research interests include homomorphic encryption, post-quantum cryptography, privacy-preserving technologies and hardware acceleration and optimisation of cryptosystems.TeachingCurrently co-teaching the EEECS stage 2 UG module CSC2056 - Systems Security and Cryptography (20CATS) Fingerprint Dive into the research topics where Ciara Rafferty is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Encryption Computer Science 100% Cryptography Computer Science 63% Hardware Computer Science 46% Design Computer Science 42% Fully Homomorphic Encryption Computer Science 41% Encryption Scheme Computer Science 40% Homomorphic Encryption Computer Science 34% Quantum Cryptography Computer Science 33% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2017 2017 2019 2019 2 Active Projects per year R1081ECI: Phase 2 Quantum Technologies Hub proposalRafferty, C. (PI), Khalid, A. (CoI) & O'Neill, M. (CoI)10/07/2019 → …Project: Research R3924ECI: CSIT Phase 2O'Neill, M. (PI), Martinez-del-Rincon, J. (CoI), McCanny, J. V. (CoI), McLaughlin, K. (CoI), Miller, P. (CoI), O'Kane, P. (CoI), O'Sullivan, E. (CoI), Rafferty, C. (CoI), Scott-Hayward, S. (CoI), Sezer, S. (CoI) & Zhou, H. (CoI)03/05/2017 → …Project: Research Research output Research output per year 2013 2014 2016 2017 2019 2023 2024 2025 2025 23 Conference contribution 6 Article 1 Commissioned report 1 Poster 1 More 1 Letter Research output per year Research output per year An enhanced two-step CPA Side-channel analysis attack on ML-KEMKennaway, M., Hoang, A.-T., Khalid, A., Rafferty, C. & O'Neill, M., 13 Jun 2025, Proceedings of the 22nd International Conference on Security and Cryptography. De Capitani Di Vimercati , S. & Samarati, P. (eds.). SciTePress, p. 263 - 274 12 p. (Proceedings of the 22nd International Conference on Security and Cryptography).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Side Channel Attack 100% One Step 100% Initial Stage 100% Secret Key 100% Sample Point 100% 26 Downloads (Pure) Evaluating area-time-power trade-offs in NTT accelerators for post-quantum cryptographyImran, M., Khalid, A., Rafferty, C., Rashid, M. & O'Neill, M., 16 Jul 2025, (Accepted) 2025 IEEE International System-on-Chip Conference (SOCC): Proceedings. Institute of Electrical and Electronics Engineers Inc., 6 p. (IEEE International System-on-Chip Conference (SOCC): Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Quantum Cryptography 100% Post-quantum Cryptography 100% Field Programmable Gate Arrays 66% High Throughput 33% Power Efficiency 33% Improving student engagement through gamification in a systems security and cryptography courseBrowning, J., Rafferty, C. & Anderson, N., 01 Jun 2025, (Accepted) 2025 IEEE Frontiers in Education Conference (FIE): Proceedings. Institute of Electrical and Electronics Engineers Inc., 7 p. (IEEE Frontiers in Education Conference (FIE): Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Student Engagement 100% System Security 100% Gamification 100% Cybersecurity 50% Academic Outcome 50% Privacy Enhancing Technologies (PETs) for Regulated Data Access. Deliverable D2.2. of the Shaping the Metaverse (Phase II) projectObafemi, F., Rafferty, C., McWilliams, G., McEvoy, B. & Martinez-del-Rincon, J., 01 Sept 2025, (Accepted) 53 p.Research output: Book/Report › Commissioned report Data Access 100% Enhancing Technology 100% Digital Service 100% Regulated Data 100% End-Users 100% RejSCore: rejection sampling core for multivariate-based public key cryptographyImran, M., Khan, S., Ul Abideen, Z., Rafferty, C., Khalid, A., Rashid, M. & O'Neill, M., 16 Sept 2025, (Accepted) Asian Hardware Oriented Security and Trust Symposium (AsianHOST 2025). IEEE Xplore, 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Public-Key Cryptography 100% Public Key Cryptography 100% Clock Cycle 33% Digital Signature 33% Hardware Accelerator 33% View all 32 research outputs Activities Activities per year 2016 2018 2019 2022 2024 2025 10 Invited talk 9 Participation in workshop, seminar, course 4 Publication peer-review 3 Participation in conference 18 More 3 PhD external examination 3 Public lecture/debate/seminar 2 Participation in Festival/Exhibition 2 Membership of peer review panel or committee 2 Membership of network 2 Hosting a school group or open day 1 Contribution to the work of national or international committees and working groups 1 Other 1 Oral presentation 1 Visiting a School Activities per year Privacy Enhancing Technologies (PETs) for Metaverse Regulated Data AccessRafferty, C. (Advisor)20 Jun 2025Activity: Talk or presentation types › Oral presentation PhD External ExaminerRafferty, C. (Examiner)12 Jun 2025Activity: Examination types › PhD external examination Danske Bank x NI Cyber Resilient Women Accelerating Action. Panel discussion.Rafferty, C. (Advisor)07 Mar 2025Activity: Talk or presentation types › Public lecture/debate/seminar Distributed Ledger Technology Policy and QUB’s Blockchain initiativeSharma, V. (Chair), Sandjaja, F. R. (Organiser), Abdullah, A. (Organiser), Abdul Majeed, A. (Organiser), Megarry, M. (Organiser), Wickremasinghe, G. (Organiser), Davis, M. (Organiser), Frost, S. (Organiser), Forde, T. (Organiser), Kerr, N. (Organiser), Fleming, B. (Organiser), Martinez-del-Rincon, J. (Member of programme committee), McWilliams, G. (Member of programme committee) & Rafferty, C. (Member of programme committee)14 Feb 2025Activity: Participating in or organising an event types › Participation in workshop, seminar, course External examiner for PhD studentRafferty, C. (Examiner)07 Nov 2024Activity: Examination types › PhD external examination View all 44 activities Press/Media An interview with a post-quantum cryptographerRafferty, C.19/04/20211 Media contributionPress/Media: Public Engagement Activities EEECS Podcast - The Secret to CryptographyRafferty, C.09/07/20201 Media contributionPress/Media: Public Engagement Activities Security flaws in a doll sparks concern over Smart ToysRafferty, C.18/12/20181 Media contributionPress/Media: Public Engagement Activities Optimised Multiplication Architectures for Accelerating Fully Homomorphic EncryptionRafferty, C.28/07/20161 Media contributionPress/Media: Public Engagement Activities",
  "content_length": 8217,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:01"
}