{
  "name": "Ciaran Moore",
  "homepage": "http://ecs.victoria.ac.nz/Main/CiaranMoore",
  "status": "success",
  "content": "Ciaran Moore | Te Kura Mātai Pūkaha, Pūrorohiko / School of Engineering and Computer Science | Te Herenga Waka—Victoria University of Wellington Ciaran Moore Please Note This person can no longer be contacted through the School of Engineering and Computer Science at Victoria University of Wellington Qualifications Skype: ciaran.p.moore Office hour: Friday 12-1 pm. Availability at other times depends on my calendar. Research Interests I am interested in the nature and application of physical phenomena that take place on the micro- and nano-scale. This interest spans diverse topics such as lithograpy, plasmonics, microscopy, micro-electrical mechanical systems (MEMS), and bioelectrical sensors. Interesting Reading J. B. Pendry, Negative refraction makes a perfect lens, Phys. Rev. Lett. 85 (2000). A seminal paper detailing how super-resolving lenses may be realised at near-optical wavelengths. Z. Liu et al., Far-field optical superlens, Nano Lett. 7﻿ (2007). A team led by Xiang Zhang at UC Berkley coupled a superlens to a diffraction grating. This extended the sub-wavelength performance of the superlens into the optical far-field, greatly reducing the restrictions on the successful retrieval of super-resolved images. D. J. Lipomi et al., Skin-like pressure and strain sensors based on transparent elastic films of carbon nanotubes, Nature Nanotech. 6 (2011). Using the remarkable mechanical and electrical properties of carbon nanotubes, flexible sensors were built. Such sensors are hugely important in the field of soft robotics, where traditional, rigid sensors currently limit the number of applications. Publications My Google scholar profile is available here. Current Students Hamish Colenso PhD Surface plasmonics for imaging and sensing Raghavender Deshagoni PhD Lightning protection systems for wind turbines Farzaneh Fadakar PhD Optical omniscope design and fabrication Roshni Babu PhD SPR aptasensors for pesticide detection Grayson Hughes BE(Hons) Portable impedance analyser Zihao Pan BE(Hons) Portable eye movement tracker Jonathan Elliot BE(Hons) Linear magnetic drive Shaika Khan BE(Hons) Smart electric blanket Robert Theron BE(Hons) Modelling the electrical properties of sea ice Aran Warren BE(Hons) Optically compatible capping layers for silver-based plasmonic sensors Opportunities for Students Sensing and Actuation Systems for Soft Robotics Historically there has been a clear divide between our soft, biological, human world and the world of robotics, which is typically rigid and inflexible. Recent progress has, however, allowed the development of \"soft\" robotics systems that can more naturally integrate with the biological world. This has led to more efficient robotics designs as a result of bio-mimicry but has also benefited humans, for example through the fabrication of orthotics that gently conform to their user while aiding strength and dexterity. Possible Masters or PhD topics in this area include: The development of soft sensors to replicate the human sense of touch. Design and fabrication of soft orthotics to strengthen tetraplegic key grip. Design and development of soft actuators driven by electrical, mechanical, and pneumatic systems. Additionally, '489 Honours projects for final year students are listed at https://ecs.victoria.ac.nz/apps/projectselection/. Other Projects Applications for postgraduate study at Masters and PhD level are always welcome. If you've got The Knack and are interested in pursuing a project in line with my research and/or teaching areas as listed above, then I would love to hear from you. Contact me in the first instance at ciaran.moore@vuw.ac.nz. Print version | Backlinks |",
  "content_length": 3676,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:03"
}