{
  "name": "Ciarán Mc Goldrick",
  "homepage": "https://www.scss.tcd.ie/Ciaran.McGoldrick",
  "status": "success",
  "content": "Dr. Ciaran Mc Goldrick > Dr. Ciáran Mc Goldrick Associate Professor School of Computer Science and Statistics Trinity College Dublin School of Computer Science and Statistics O'Reilly Institute, Trinity College Dublin Dublin 2, Ireland Room 1.10a, Lloyd Institute map +353 1 896 3626 @ Appointments Appointments are only available by E-mail and in advance. Usually Mondays 12-1pm Teaching Current: CS3D3 - Computer Networks (S2 2018/19) CS7NS1 - Scalable Computing (S1 2018/19) Past: CS3D3 - Computer Networks (S2 2017/18) CS3013 - Software Engineering Group Project (S2 2017/18) Carers Leave (2016/17) EE2E10 - Engineering Science IV (S2 2015/16) EE2E10 - Engineering Science IV (S2 2014/15) EE2E10 - Engineering Science IV (S1 2013/14) EE2E10 - Engineering Science IV (S1 2012/13) more Course Director: I was Course Director for our one year, full-time M.Sc. in Computer Science (Mobile and Ubiquitous Computing) through to 2016. Details on the course were available here. Select Publications Recent: Pervasive and Mobile Computing 2017: Routing in wireless sensor networks for wind turbine monitoring Wireless On-demand Network Systems and Services (WONS) 2017: Ensuring quality services on WiFi networks for offloaded cellular traffic International Journal of Applied Cryptography 2017: Attribute-based fully homomorphic encryption with a bounded number of inputs Wireless On-demand Network Systems and Services (WONS) 2017: An SDN architecture for under water search and surveillance ASEE 2016: Experiences of Integrating UAVs into the Curriculum through Multidisciplinary Engineering Projects WUWNet 2016: WaterCom: Connecting Research Configurations with Practical Deployments Progress in Cryptology 2016: Attribute-Based Fully Homomorphic Encryption with a Bounded Number of Inputs SDESS 2016: Mobile Privacy-Preserving Crowdsourced Data Collection in the Smart City MILCOM 2016: A SDN-Controlled Underwater MAC and Routing Testbed ICNC 2016: Evaluation of a Time Radio Signal as Wireless Sensor Synchronization Beacon SIGCSE 2016: Droning On: Reflections on Integrating UAV Technology into a Computer Engineering Design Laboratory all publications Research In June 2017 I was recognised as one of \"Irelandâs Champions of EU Research\" for exhibiting outstanding leadership through the MSCA ICONN project funded under Horizon 2020 programme. Challenged Communications: I am primarily concerned with future concepts for the collection and understanding through to delivery of data in ultra low-power, deeply embedded constrained systems, in emerging and challenging communications scenarios, and in practical, physical deployments of these solutions. This embraces all aspects of these systems - hardware, software and applications, and targets innovative, practical, reliable solutions. We are presently active in the renewables domain, with activity in both wind and wave energy projects, and in the (so-called) Smart Systems space e.g. Smart Cities, Smart Vehicles, Smart Health, etc. I am also active in the security space - with a particular focus on future security concepts, paradigms and approaches that scale in an Internet of Things context. Computer Science and Engineering Education: The fields of computer science and engineering education seek to bridge the gap between the academic in the classroom and the more formal field of educational research. My early contributions in this field took the form of research-led innovations in teaching practice that emanated from of my research in wireless networking. Thereafter, I moved from the positivist paradigm that forms the bedrock of quantitative scientific research, to a more constructivist view of world where each individualâs experiences, and their interpretation of these experiences, are what give meaning to phenomena. Our recent work aims to formulate theories or hypotheses based on field data. While these approaches can seem very different, they often reinforce each other in education, where quantitative and qualitative data are readily available.They also provide compelling evidence of the tight integration and synthesis of my ongoing research within my teaching and academic practice. Recent Projects and Proposals ICONN 2015 (European Industrial DoCtorate on Offshore WiNd and Wave ENergy):H2020 MSCA EID:Coordinator:93.8%. Funded. TrainNOWW 2015 (A Training Network in Offshore Wind and Wave Energy):H2020 MSCA ETN:Coordinator:86.2% LEEF 2014 (Lifelong-learning Engineering Education for the Future):H2020 SEAC:Partner:Unsuccessful TrainNOWW 2013/14 (A Training Network in Offshore Wind and Wave Energy):FP7 MC ITN:Coordinator:88.6% ProWind 2012/13 (Performance, Monitoring and Prognostics for Offshore Wind Energy Farms):FP7 MC ITN:Coordinator:89.4% SYSWind 2009/13 (Training future mechanical, civil, electronic engineers and computer scientists in SYStem Identification, Condition & Health Monitoring for a New Generation of WIND Turbines):Partner/Research Strand Leader:94% Researchers Current: I have just returned from a period of Carers Leave, and am resuming supervisions Recent: Michael Clear (April 2016) Jeff Warren (September 2014) Esther Simon (September 2014) Frederick Wetterling (October 2013) Conferences & Workshops You might consider submitting to some of the following conferences that I am involved with this year: ASEE Annual Conference and Exposition 2017 Sensornets 2017 Frontiers in Education (FIE 2017) Miscellanea Academic CV - August 2014 version (temporarily offline) Teaching Philosophy - March 2012 (partially updated in July 2014) (temporarily offline) Publications - December 2017. News April 2019 - Dissertation Projects. I'm happy to consider compelling project proposals that involve hardware, networking, security or wireless technologies. Ideally they will be well aligned with my research interests. I envisage 2 projects in blockchain and the Flare platform; 1 further projects in Vehicular Networking, 1 in Distributed online control, and 1 in Quantum Communication protocols. Applicants should have very strong programming and theoretical capabilities, and and be interested in working with some hardware and simulation systems. Projects may include the opportunity for collaboration with UCLA or INOX Labs. Please contact me by Email and we can then meet to discuss it further. 2016-17 - On Carers Leave. No Projects Last modified at April 14, 2019 - 16:26:53",
  "content_length": 6396,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:35"
}