{
  "name": "Cicek Cavdar",
  "homepage": "https://www.kth.se/profile/cavdar",
  "status": "success",
  "content": "KTH | Cicek Cavdar Skip to main content Cicek CavdarProfessorKungliga Tekniska Högskolanhttps://www.kth.se/profile/cavdarDetailsWorks for Division of Communication SystemsTelephone +46 8 790 43 30Unit address Malvinas Väg 10E-mail cavdar@kth.seResearcherResearcher IDORCID IDAbout meCicek Cavdar is an Associate Professor, leading a research group on Intelligent Network Systems at the School of EECS at KTH Royal Institute of Technology in Sweden. She finished her Ph.D studies in Computer Science, University of California, Davis and in Istanbul Technical University, Turkey in 2009. After her PhD, she worked as an Assistant Professor in Computer Engineering Department, Istanbul Technical University. She served as symposium chair of IEEE ICC 2017 (GCSN),  held in Paris. She has chaired several workshops on green mobile broadband technologies and Green Mobile Networks last ten years co-located with IEEE ICC and Globecom.  She had leading roles in several European projects in the areas of aerial communications and green networks such as EU EIT Digital projects \"5GrEEn: Towards Green 5G Mobile Networks\" and \"Seamless Direct Air to Ground Communications (DA2GC) in Europe- ICARO-EU\". 2015-2018, she served as the leader of Swedish cluster for the EU Celtic Plus project SooGREEN \"Service Oriented Optimization of Green Mobile Networks“, and from 2018 she has the same role in the EU Celtic Plus project AI4Green “Artificial Intelligence for Green Mobile Networks”. Her research interests include design and analysis of telecommunication networks with focus on beyond 5G mobile networks,  edge/cloud computing, big data in the network, URLLC, energy efficiency, and AI assisted mobile networks. She is the technical coordinator of EU Celtic-Next 6G-SKY - 6G for Connected Sky project which has started recently. CoursesDegree Project in Computer Science and Engineering, specialising in Communication Systems, Second Cycle (DA246X), examinerDegree Project in Computer Science and Engineering, specialising in ICT Innovation, Second Cycle (DA258X), examinerDegree Project in Computer Science and Engineering, specialising in ICT Innovation, Second Cycle (DA256X), examinerDegree Project in Computer Science and Engineering, specializing in Industrial Management, Second Cycle (DA235X), examinerDegree Project in Computer Science and Engineering, specializing in Machine Learning, Second Cycle (DA233X), examinerDegree Project in Computer Science and Engineering, specializing in Software Engineering for Distributed Systems, Second Cycle (DA240X), examinerDegree Project in Electrical Engineering, Second Cycle (EA250X), examinerDegree Project in Electrical Engineering, Second Cycle (EA238X), examinerDegree Project in Electrical Engineering, specialising in ICT Innovation, Second Cycle (EA258X), examinerDegree Project in Electrical Engineering, specialising in ICT Innovation, Second Cycle (EA256X), examinerDegree Project in Electrical Engineering, specializing in Communication Systems, Second Cycle (EA246X), examinerDegree Project in Electrical Engineering, specializing in Information and Network Engineering, Second Cycle (EA260X), examinerDegree Project in Information and Communication Technology, First Cycle (IA150X), examinerDegree Project in Information and Communication Technology, First Cycle (II143X), examinerDegree Project in Information and Communication Technology, Second Cycle (IA250X), examinerMobile Networks and Services (IK2560), teacherWireless Networks (IK2510), teacher, course responsible, examinerPortfolio5GrEEn summer schoolMaster Thesis TopicsLinksIEEE Globecom Green Broadband Access5GrEEn - Towards Green 5G Mobile Networks",
  "content_length": 3670,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:04"
}