{
  "name": "Cigdem Sengul",
  "homepage": "https://www.brunel.ac.uk/people/cigdem-sengul",
  "status": "success",
  "content": "Dr Cigdem Sengul | Introduction | Brunel University London Skip to Content Home People Dr Cigdem Sengul Dr Cigdem SengulReader in Computer Science Wilfred Brown Building 114 Email: cigdem.sengul@brunel.ac.uk Tel: +44 (0)1895 267879 Web Page Computer Science College of Engineering, Design and Physical Sciences Summary Cigdem has more than ten years of experience in research and development in mobile and wireless networks in both academia and industry. She has been working on standards for building privacy and trust in the Internet of Things during her time at Nominet as a Senior Researcher (2015-2019).  Between 2012-2015, she worked as a Senior Lecturer at Oxford Brookes University, where she lectured and conducted research on wireless and mobile networks, with a particular focus on energy and interference efficiency, and Internet of Robotic Things. From 2008-2012, she was with Telekom Innovation Labs (the main research unit of Deutsche Telekom) as a Senior Research Scientist leading projects on Wireless Mesh Networks. Her work has been published in more than 50 journal and conference publications.  She is a Fulbright, Department of Computer Science, UIUC and Vodafone fellow. Cigdem is a passionate advocate of increasing diversity awareness in computing. She is the Communication Co-Chair of ACM Women. Between 2019-2022, she was the Communication and Outreach Chair of ACM Women-Europe. She collaborates with the Micro:bit Educational Foundation to support their mission of teaching coding to school children. She is the co-author of the Networking with the Micro:bit book. Qualifications MSc in Computer Science, University of Illinois at Urbana-Champaign (2003) PhD in Computer Science, University of Illinois at Urbana-Champaign (2007) Fellow of Higher Education Academy Responsibility Athena SWAN SAT Lead; Equality, Diversity, Inclusion Champion (College-level) Newest selected publications Renaud, K., Sengul, C., Coopamootoo, K., Clift, B., Taylor, J., Springett, M. and Morrison, B. et al. (2024) 'We’re not that Gullible!’ — Revealing Dark Pattern Mental Models of 11-12 Year-Old Scottish Children'. ACM Transactions on Computer - Human Interaction, 31 (3). pp. 1 - 41. ISSN: 1073-0516 Open Access Link Journal article Sengul, C., Neykova, R. and Destefanis, G. (2024) 'Software engineering education in the era of conversational AI: current trends and future directions'. Frontiers in Artificial Intelligence, 7. pp. 1 - 23. ISSN: 2624-8212 Open Access Link Journal article Manohar, A., Sengul, C. and Chen, J. (2023) 'Inclusive Privacy Control at Home for Smart Health', in Hayes, S., Jopling, M., Connor, S. and Johnson, M. (eds.) Human Data Interaction, Disadvantage and Skills in the Community: Enabling Cross-Sector Environments for Postdigital Inclusion. Cham, Switzerland : Springer. , Part F3831. pp. 151 - 176. ISBN 10: 3-031-31875-7. ISBN 13: 978-3-031-31874-0. Open Access Link Book chapter Michaelides, M., Sengul, C. and Patras, P. (2021) 'An Experimental Evaluation of MQTT Authentication and Authorization in IoT'.WiNTECH '21: 15th ACM Workshop on Wireless Network Testbeds. New Orleans, LA, USA. 25 - 4 February. ACM. pp. 69 - 76.Open Access Link Conference paper Manohar, A., Sengul, C. and Chen, J. (2021) 'Trust in Home: Rethinking Interface Design in IoT'.33rd conference on British Human Computer Interaction 2021. Open Access Link Conference paper More publications(15)",
  "content_length": 3421,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:05"
}