{
  "name": "Cihan Tunc",
  "homepage": "https://computerscience.engineering.unt.edu/people/faculty/cihan-tunc",
  "status": "success",
  "content": "Cihan Tunc | University of North Texas Cihan Tunc Computer Science and Engineering Assistant Professor Discovery Park F230 Office Hours:Wed 2:00 - 4:00 pm Cihan.Tunc@unt.edu About Faculty Info | Research Profile | Google Scholar | Education PhD, University of Arizona, 2015Electrical & Computer Engineering MS, Northeastern University, 2010Electrical & Computer Engineering BS, Bahcesehir University, 2008Electrical & Electronics Engineering (with a minor in Computer Engineering) Research Research Interests Cybersecurity, cloud computing, Internet of Things (IoT), autonomous vehicle security, and social media analysis for cybersecurity. Looking for PhD Students Hardworking and highly motivated prospective PhD students are encouraged to apply to work with me on cybersecurity, distributed computing, cloud computing, IoT, social media analysis, etc. For communication, please use the following link to fill out the form: URL Publications Please visit Faculty Info page and click \"Publications\" tab. Professional Experience Journal Associate Editor Associate Editor for Springer Cluster Computing Journal Reviewer Springer Cluster Computing IEEE Transactions on Cloud Computing IEEE Pervasive Computing ACM Transactions on Management Information Systems Elsevier Computer Standards & Interfaces Elsevier Future Generation Computer Systems Elsevier Computers and Electrical Engineering Elsevier Computers & Security IEEE Transactions on Sustainable Computing Conference Program Chair & Co-Chair Program Co-Chair, The IEEE Workshop on Automation of Cloud Configuration and Operations (ACCO 2019, co-located with AICCSA 2019), Abu Dhabi, AUE, 2019 Program Co-Chair, The IEEE Workshop on Automation of Cloud Configuration and Operations (ACCO 2018, co-located with AICCSA 2018), Aqaba, Jordan, 2018 Program Co-Chair, The IEEE Workshop on Automation of Cloud Configuration and Operations (ACCO 2017, co-located with ICCAC 2017), Tucson, AZ, USA, 2017 Program Co-Chair, IEEE International Workshop on Big Data Analytics for Cybersecurity Computing (BDAC 2016, co-located with Intelligence and Security Informatics (ISI 2016)), Tucson, AZ, USA, 2016 Conference Chair Publicity Chair, The IEEE International Conference on Autonomic Computing and Self-Organizing Systems (ACSOS), Washington DC, 2020 Registration, Finance, and Publication Chair, 16th ACS/IEEE International Conference on Computer Systems and Applications (AICCSA 2019), Abu Dhabi, UAE, 2019 Proceedings Chair, The International Conference on Big Data & Cybersecurity Intelligence (BDCSIntell’2018), Beirut, Lebanon, 2018 Registration, Finance, and Publication Chair, 15th ACS/IEEE International Conference on Computer Systems and Applications (AICCSA 2018), Aqaba, Jordan, 2018 Registration, Finance, and Publication Chair, 14th ACS/IEEE International Conference on Computer Systems and Applications (AICCSA 2017), Hammamet, Tunisia, 2017 Registration, Finance, and Publication Chair, IEEE International Conference on Cloud and Autonomic Computing (ICCAC 2017), Tucson, AZ, USA, 2017 Registration, Finance, and Publication Chair, 13th ACS/IEEE International Conference on Computer Systems and Applications (AICCSA 2016), Agadir, Morocco, 2016 Publication Chair, IEEE International Conference on Cloud and Autonomic Computing (ICCAC 2016), Augsburg, Germany, 2016 Registration and Finance Chair, 12th ACS/IEEE International Conference on Computer Systems and Applications (AICCSA 2015), Marrakech, Morocco, 2015 Registration and Publication Chair, IEEE International Conference on Cloud and Autonomic Computing (ICCAC 2015), Boston, MA, USA, 2015 Conference Technical Program Committee member The 11th IEEE International Conference on Cloud Computing Technology and Science (CloudCom’19), Sydney, Australia, 2019 2018 Artificial Intelligence and Cloud Computing Conference (AICCC 2018), Tokyo, Japan, 2018 IEEE Global Communications Conference 2018, UAE, 2018 Foundation and Applications of Self* Systems (FAS* 2018) Posters and Demos Session, Trento, Italy, 2018 6th International Conference on Control Engineering & Information Technology (CEI’18), Istanbul, Turkey, 2018 International Workshop on Architectures for Future Mobile Computing and Internet of Things (FMCIoT’2018), Tangier, Morocco, 2018 10th IEEE International Conference on Cloud Computing Technology and Science (CloudCom’18), Cyprus, 2018 9th IEEE International Conference on Cloud Computing Technology and Science (CloudCom’17), Hong Kong, 2017 IEEE International Conference on Cloud and Autonomic Computing (ICCAC 2017), Tucson, AZ, USA, 2017 IEEE International Workshop on Autonomic Cloud Cybersecurity (ACC 2015, co-located with ICCAC 2015), Boston, MA, USA, 2015 Honors and Awards Best poster award in CAC 2014 – F. Fargo, C. Tunc, Y. Al-Nashif, A. Akoglu, and S. Hariri, “Autonomic Management of Cloud Resources and Services Framework, ”IEEE International Conference on Cloud and Autonomic Computing (CAC 2014), London, UK., Sep. 2014 Graduate Research Assistantship in the Department of Electrical and Computer Engineering of the University of Arizona (Fall 2011 – Fall 2014) Graduate Research/Teaching Assistantship in the Department of Electrical and Computer Engineering at Northeastern University (Fall 2008 – Spring 2010) Outstanding paper award (F. Ugurdag, O. Keskin, C. Tunc, F. Temizkan, G. Fici, and S. Dedeoglu, “RoCoCo: Row and Column Compression for High-Performance Multiplication on FPGAs, ”East-West Design & Test Symposium, Sevastopol, Ukraine, Sep. 2011) ©",
  "content_length": 5511,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:08"
}