{
  "name": "Cindy Ya Xiong",
  "homepage": "http://cyxiong.com",
  "status": "success",
  "content": "Cindy Xiong Bearfield – Computer Scientist + Cognitive Psychologist Studying Data Visualizations Skip to content I am an Assistant Professor in the School of Interactive Computing at Georgia Tech. I received my Ph.D. in Cognitive Psychology from Northwestern University and my undergraduate degrees in Applied Mathematics and Psychology from UCLA. My research program combines visual perception, cognition, and data visualization. By investigating how humans perceive, interpret, and make decisions from visualized data, I answer questions such as \"what are the underlying perceptual and cognitive processes when people make sense of data visualizations?\", and \"how can we design an effective visualization or tell a good story with data?\". My research has been recognized with an NSF CAREER award, as well as paper awards at premier psychology and data visualization venues, including ACM CHI, IEEE PacificVis, IEEE Computer Graphics and Applications, Psychonomics, and IEEE VIS. I'm also one of the founding leaders of VISxVISION (visxvision.com), an initiative dedicated to increasing collaboration between visualization researchers and perceptual + cognitive psychologists. As to how to pronounce my last name...The 'X' makes a \"sh\" sound so you can pronounce it as \"shown,\" as in \"they have shown an eager desire to work with Cindy because her research sounds so interesting.\" Best Paper at IEEE PacificVis 2024 After 6 years of rejections and revisions, our paper on the ambiguous nature of data visualization is out! We demonstrate that two people looking at the same data can come to different decisions. Visual annotations can shift those decisions. Read it here. Behind the cute figures, it's all tears (jk). 3 Papers at IEEE VIS 2024 + 2 TVCG Papers!LLMs struggle to come up with chart takeaways. (read) (w/ Will Wang, Jane Hoffswell, Victor Bursztyn, and Yuki Thane) Motion-based visual encoding helps you do perceptual tasks. (read) (w/ Songwen Hu, Ouxun Jiang, and Jeff Riedmiller from Dolby) Sine Illusion? Mitigate by showing gridlines on your charts! (read) (w/ Clayton Knittel, Jane Awuah, and Steve Franconeri) Textual annotations can make your charts look more biased. (read) (w/ Chase Stokes and Marti Hearst) Grouping Cues Guide Viewer Comparisons and Conclusions in Bar Charts. (read) (w/ Andrew Lovett, Chase Stokes, and Steve Franconeri) OLDER NEWS 2024 IEEE PacificVis Best Paper My first non-runner-up Best Paper award! Read here. It's on the power of visualizations to elicit competing interpretations from data. 2024 Moved to Georgia Tech! They asked me some questions and I answered. 2024 NSF Medium Award (IIS-HCC, $1,198,084) I got an NSF award to support visual analytic decision-making through mitigating confirmation bias 2023 NSF CAREER Award (IIS-HCC) I got the CAREER award to research designs that support critical thinking and calibrated trust. Read more about it here. 2023 Joined the Human Factors Task Group at NIST I help evaluate and improve standards proposed by forensic labs. 2022 IEEE CG&A Best Paper Runner-Up VisHikers’ Guide to Evaluation: Read here. 2022 IEEE VIS Best Poster Honorable Mention Led by student Hamza Elhamdadi on measuring trust in visual data communication using perceptual fluency. And related work on measuring trust in human-data interaction presented at IEEE VIS Beliv 2022. 2022 VGTC Visualization Dissertation Award Honorable Mention Read my dissertation here. Or read this, it's more interesting. Teaching A Brand-New UX Research Course at UMass Amherst I designed a course for undergraduate CS and Informatics students to learn about user experience design and research. More info can be found here. 2022 CHI Research Paper Honorable Mention Icon arrays and perceptual bias. With the mid-term election coming up, it's important to be aware of the perceptual biases that may exist when making sense of probabilistic information. Paper is here and video is here. 2020 IEEE VIS Best Paper Honorable Mention We introduce a design space of experimental methods for empirically investigating the perceptual processes involved with viewing data visualizations to inform visualization design guidelines.",
  "content_length": 4172,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:11"
}