{
  "name": "Cindy L. Bethel",
  "homepage": "http://www.cavs.msstate.edu/directory/information.php?d=2258",
  "status": "success",
  "content": "Directory Listing - Cindy Bethel | CAVS Skip to: Skip to content Skip to navigation CAVS / People / Profile Directory at CAVS Emailcbethel@cavs.msstate.edu OfficeCAVS 2137 Phone(662) 325-9252 Alt. Phone(813) 316-8136 Cindy L. (Cindy) BethelFacultyCurriculum Vitae not Provided Emailcbethel@cavs.msstate.eduOfficeCAVS 2137Phone(662) 325-9252Alt. Phone(813) 316-8136 Biography Cindy is an Associate Professor in the Computer Science and Engineering Department and the Billie J. Ball Endowed Professor in Engineering at Mississippi State University. She is the Director of the Social, Therapeutic, and Robotic Systems (STaRS) Lab, a Research Fellow with the Center for Advanced Vehicular Systems (CAVS) in the Human Factors Group, and a Research Fellow with the Social Science Research Center. Cindy was an NSF/CCC/CRA Computing Innovation Postdoctoral Fellow (CIFellow) in the Social Robotics Laboratory in the Computer Science Department at Yale University from 2009-2011. She was a National Science Foundation Graduate Research Fellow and the recipient of the 2008 IEEE Robotics and Automation Society Graduate Fellowship. She graduated in 2009 with her Ph.D. in Computer Science and Engineering from the University of South Florida. She graduated with a B.S. in Computer Science Summa Cum Laude from the University of South Florida. She was awarded the King O'Neal Scholar Award, the Computer Science and Engineering Outstanding Graduate Award, and the Engineering Alumni Society Outstanding Senior of the Year Award. Research Interest Human-Robot Interaction, Robotics, Robot-Assisted Therapy, Human-Computer Interaction and Interface Design, Human-Machine Interface and Systems, Affective Computing, Search and Rescue, Military, and Law Enforcement, Therapy applications, Artificial Intelligence, Human Factors, Psychophysiology, Experimental Design, Psychology, and Applied Statistics. Hobbies Walking, hiking, swing dancing, arts & crafts, nature, and much more. Selected PublicationsTotal Publications:  58 Cossitt, J. E., Patel, V., Carruth, D. W., & Bethel, C. L. (2022). Modeling Operator Performance Considering Autonomy Level in Partially Autonomous Vehicles. 2022 Interservice/Industry Training, Simulation and Education Conference (I/ITSEC 2022). Orlando, FL, USA. Hudson, C. R., Bethel, C. L., Carruth, D. W., Pleva, M., Ondas, S., & Juhar, J. (2018). Implementation of a Speech Enabled Virtual Reality Training Tool for Human-Robot Interaction. 2018 World Symposium on Digital Intelligence for Systems and Machines (DISA). Košice, Slovakia: IEEE. DOI:10.1109/DISA.2018.8490615. [Abstract] [Document Site] Louine, J. L., May, D., Carruth, D. W., Bethel, C. L., Strawderman, L., & Usher, J. (2018). Are Black Robots Like Black People? Examining How Negative Stigmas about Race Are Applied to Robots. Sociological Inquiry. Wiley Online Publishers. 88(4), 626-648. DOI:10.1111/soin.12230. [Abstract] [Document Site] Davis, M., Cagle, L. D., Morgan, C., Hudson, C. R., Ball, J. E., Anderson, D., Bethel, C. L., Liu, Y., Gafford, J., & LeClair, A. M. (2018). Hydra: A Modular, Universal Multisensory Data Collection System. SPIE DCS Defense and Security Program and Symposium. Orlando, FL. Durst, P. J., Goodin, C., Anderson, D., & Bethel, C. L. (2017). A Reference Autonomous Mobility Model. 50th Winter Simulation Conference (WSC 2017). Las Vegas, NV.",
  "content_length": 3362,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:13"
}