{
  "name": "Cindy Grimm",
  "homepage": "http://web.engr.oregonstate.edu/~grimmc",
  "status": "success",
  "content": "Cindy Grimm: Home Welcome to my web pages. I am a Professor in the School of MIME. I am affiliated with the Collaborative Robotics and Intelligent Systems (CORiS) group, Human-Centered computing, and Graphics and Visualization. Previously, I was an Associate Professor in the Department of Computer Science and Engineering at Washington University in St. Louis. If there's something that you're interested in, or want to know, and it's not on these pages, then send me email and ask. My CV. 12/1/2020 We are currently hiring: for a post-doc position in robotics OR graphics/visualization to work on a CISE NSF Infrastructure grant for benchmarking grasping and manipulation. I'm looking for a graphics/visualization person interested in learning more robotics OR a robotics grasping/manipulation person looking to learn more about HCI and Visualization. More information here, including the formal link to apply. Please feel free to contact me directly to find out more about the position before formally applying. My background is in computer science, specifically computer graphics and surface modeling. However, over the years I've delved into human computer interfaces, surface modeling for biological applications, bat sonar, art-based rendering, 3D sketching, and understanding how people perform 3D segmentation of volumetric data. Currently, I have active research projects in the following areas: Robot grasping: Robots are terrible at picking things up, humans do a pretty good job of it, but can't tell us how they do it. We are applying human-factors style analysis techniques in order to understand what mental models and local decision making process people use when performing grasping. In a practical sense, we bring people in and ask them to do grasping with a physical robot hand, then ask them questions (in the form of physical tasks) in order to get them to demonstrate their decision-making. We then transition this to a reinforcement learning algorithm which uses the sensing capabilities of the robot to determine how to mimic what the humans did. Ravi Balasubramanian Privacy in robotics: As robots move into our offices and homes (both autonomous and tele-operated), what social conventions should they follow? What are our privacy expectations? If a plumber tele-operates a robot around your house to fix your sink, would it be weird if it went into the bedroom? Would you clean up the house before they robot \"came over\"? Or would you want the robot to filter the video feed so that the mess was hidden? Our goal is to understand privacy and social conventions *before* robots become ubiquitous, so that we can adapt the technology to fit what people want. Bill Smart, Frank Bernieri, Ross Sowell, Margot Kaminski, Matt Rueben, Averting Robot Eyes Meaningful human control for autonomous systems through a law lens: This work grew out of a couple days spent discussing meaningful human control for autonomous weapons with people from a wide-variety of fields, the Navy, Air force, law, Public policy, United Nations Conventional Weapons group... Autonomous and semi-autonomous systems have the ability to learn, respond to data, make decisions - all in ways that are difficult to predict. How do we, as humans, harness the strength of these techniques while showing a good-faith effort at minimizing their harm? We approach this through a mix of education (eg, clearly defining how human-level concepts like \"find the person\" get translated to sensors and algorithms), software testing via data sets (eg, providing explicit information on the range of expected values and how the data sets map to human concepts) and software engineering (bottom up unit testing). Bill Smart, Woody Hartzog, Ross Sowell, Ruth West, Paper at We Robot 2017, An Education Theory of Fault for Autonomous Systems Manipulation for Agriculture Agricultural requires a great deal of manual labor - pruning, thinning, fruit picking, fertilization. Robotics has the potential to free workers from the most dangerous, repetitive manual tasks, freeing up that labor to provide more nuanced, precise management of resources such as water and fertilizer. We are specifically looking at teaching robots to pick apples and prune trees. Joe Davidson Interested? It's that time of year again, when I receive many emails asking if I have space in my research group, a PhD position, or will you please read my CV. I do not answer these emails. All applicants must go through the admissions process; I do not make individual hiring decisions. Your application will be reviewed and ranked by a group of faculty, at which point the top applicants will be selected. If you have a specific question about the kinds of research I do, please feel free to ask; put RQ: in the subject line. If you are an undergraduate or graduate student at OSU, please feel free to make an appointment to come talk to me. I have many projects that are suitable for undergradautes. What's New?",
  "content_length": 4959,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:08"
}