{
  "name": "Clark D. Thompson",
  "homepage": "https://www.cs.auckland.ac.nz/~cthombor",
  "status": "success",
  "content": "Clark Thomborson Clark Thomborson Professor Research Interests The specification of secure systems, particularly for identity management and privacy protection. Algorithms and applications for software watermarking and obfuscation. My inactive/former areas of interest include software performance engineering and R&D policy. Teaching (S2 2019) CompSci 725: System Security. Lectures (as at 15 Jul 2019, subject to change): Mo 12-1 OGGB 040B, Tu 11-12 Architecture-West 201, Th 3-4 Arts 1 rm 201. Tutorial sessions are held during weeks 4-11: Th 11-12 OGGB 307, Fr 11-12 OGGB 307. My office hours during S2 2019 are by appointment only. Urgent queries should be directed to the departmental front office 303S.384, phone (09) 3737 599 x85857. Current Students I am retiring as at 1 March 2020, and will not be starting any new research supervisions. Former students and visitors. Recent Publications and Lectures Chinese Hackers and the Trade War, interview on Larry Williams Drive, Newstalk ZB, 21 December 2018 from 15.05pm to 15.13pm. Stegogames, by Clark Thomborson and Marc Jeanmougin, Information Security and Privacy (22nd Australasian Conference on Information Security and Privacy, ACISP 2017, Auckland NZ), LNCS 10343, Springer, 2017. Author's preprint. Five Decades of Software Obfuscation: A Retrospective, keynote address at the International Conference on Applications and Techniques in Information Security (ATIS 2017), Massey University, Auckland, New Zealand / 6-7 July 2017. Contextual Privacy, Jennifer Seberry Invited Lecture at the 22nd Australasian Conference on Information Security and Privacy (ACISP), Auckland, New Zealand, 3-5 July 2017. Privacy Patterns, by Clark Thomborson, 2016 14th Annual Conference on Privacy, Security, and Trust (PST 2016, Auckland, 12-14 December 2016), pp. 656-663, 2017. A preliminary version of this article is available as arXiv:1612.01553, 5 December 2016. Slideshow: pptx, pdf. Full list of publications. Google Scholar listing. Vita Brevis 1975 B.S. (honors) Chemistry, Stanford University 1975 M.S., Computer Science / Computer Engineering, Stanford University 1980 Ph.D., Computer Science, Carnegie-Mellon University 1979-86 Assistant Professor of EECS at UC Berkeley 1983 married Barbara Borske 1983 Barbara and I transformed our surnames by \"gene-swapping\": Thompson+Borske = Thomborson (but not Thomborsonske, nor Borthomp). 1986-94 Professor of CS at U Minnesota-Duluth 1992-3 Visiting Professor of EECS at MIT 1995 Principal Programmer, LaserMaster Corp of Minnesota 1996 emigrated to New Zealand Full vita. Contact Information E-mail: cthombor@cs.auckland.ac.nz Mail: Clark Thomborson School of Computer Science University of Auckland Private Bag 92019, Auckland 1142 New Zealand Phone: +(64 9) 3737-599 x85753 (office) +(64 9) 817-1234 (home voice) +(64 21) 2466-034 (cellphone)",
  "content_length": 2846,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:17"
}