{
  "name": "Claus Brabrand",
  "homepage": "http://itu.dk/people/brabrand",
  "status": "success",
  "content": "Claus Brabrand ((( CLAUS BRABRAND ))) Claus Brabrand, Ph.D. Full Professor Head of Center for Computing Education Research (CCER) Department of Computer Science IT University of Copenhagen ((( CV | LinkedIn | Google Scholar | DBLP | IMDb | VBDb ))) SHORT-FILM Writer, director, producer, and co-editor of the 19-minute award-winning short-film on University teaching: ((( \"Teaching Teaching & Understanding Understanding\" ))) \"Teaching Teaching & Understanding Understanding\" is a 20-minute award-winning short-film about teaching at university and higher-level educational institutions. It is based on the Theory of Constructive Alignment and The SOLO Taxonomy developed by Professor John Biggs. The film provides a foundation for understanding what a teacher needs to do in order to make sure all types of students actually learn what the teacher intends. PUBLICATIONS Research Interests: Computing Education Research (2020s exclusively) Variability & Product Lines (2010s predominantly) Programming Languages (2000s predominantly) 2020s: Computing Education Research (exclusively) “Andy’s Axe” as a Guiding Principle for our Stance on AI-in-Education (for Computing) (Ibrahim Albluwi, Dennis Bouvier, Claus Brabrand, Michelle Craig, Rodrigo Duran, Chris Hundhausen, Kevin Lin, Leo Porter, Karen Reid, Andrew Luxton-Reilly, David H. Smith IV, Claudia Szabo, Shubbhi Taneja, Michel Wermelinger, Titus Winters, Daniel Zingaro)) Proc. of Dagstuhl Seminar 25311 on Generative AI for Programming Education (2025). What Does It Mean to Program in the Age of AI? (Claus Brabrand Sebastian Nicolajsen) Proc. of Dagstuhl Seminar 25311 on Generative AI for Programming Education (2025). Prompt First, Precision Later (Brent Reeves, James Prather, Paul Denny, Juho Leinonen, Andrew Luxton-Reilly, Stephen MacNeil, Sebastian Mateos Nicolajsen, Claus Brabrand) Proc. 25th Koli Calling Int’l Conf on Computing Education Research, Koli Calling 2025. (2025). Temporal Correlation between Women studying Computing & Human Development Index (30 years of data) (Louise Meier Carlsen, Maria Stisen Flyger, Josefine Marie Andersen, Nanna Inie, Claus Brabrand) To appear, Proc. 55th Frontiers in Education Conference, FIE 2025. (2025). What is Programming? ...and What is Programming in the Age of AI? (Sebastian Mateos Nicolajsen, Claus Brabrand) Communications of the ACM (CACM). (2025). Circle of Life: Microworld Project at the end of CS1 (Sebastian Mateos Nicolajsen, Michael Caspersen, Claus Brabrand) SIGCSE Technical Symposium, SIGCSE-TS 2025. (2025). Programming Education across Disciplines: a Nationwide Study of Danish Higher Education (Sebastian Mateos Nicolajsen, Sofie Kramshøi Nielsen, Louise Meier Carlsen, Claus Brabrand) Higher Education. (2024). Visualizing the Conceptual Framework of Object Orientation for Novice Programmers (Jakob Staugaard, Jens Bennedsen, Christoph Seidl, Sebastian Nicolajsen, Mathias Fink, Claus Brabrand) Proc. 54th Frontiers in Education Conference, FIE 2024. (2024). Invisible Women in IT: Examining Gender Representation in K-12 ICT Teaching Materials (Ingrid Maria Christensen, Melissa Høegh Marcher, Nanna Inie, Claus Brabrand) ACM Conference on International Computing Education Research, ICER 2024. Programming under the Influence: On the Effect of Heat, Noise, and Alcohol on Programmers (Claus Brabrand, Nanna Inie, Paolo Tell) Journal of Systems & Software 2024. Feedback on Student Programming Exercises: Teaching Assistants vs Automated Assessment Tool (Nynne Grauslund Kristiansen, Sebastian Mateos Nicolajsen, Claus Brabrand) Proc. 22nd Koli Calling Int’l Conf on Computing Education Research, Koli Calling 2023. (2023). Gender Differences in the Group Dynamics of Smaller CS1 Project Groups (Bjørn Hjorth Westh, Nanna Inie, Louise Barkhuus, Claus Brabrand) Proc. 53rd Frontiers in Education Conference, FIE 2023. (2023). On the Effect of Onboarding Computing Students without Programming-Confidence or -Experience (Pawel Grabarczyk, Sebastian Mateos Nicolajsen, Claus Brabrand) Proc. 21st Koli Calling Int’l Conf on Computing Education Research, Koli Calling 2022. (2022). Student Perspectives on On-site versus Online Teaching throughout the Covid-19 Pandemic (Björn Thór Jónsson, Magda Pischetola, Nanna Inie, Mats Daniels, Claus Brabrand) Proc. 52nd Frontiers in Education Conference, FIE 2022. (2022). Computing Educational Programmes with more Women are more about PEOPLE & less about THINGS (Pawel Grabarczyk, Alma Freiesleben, Amanda Bastrup, Claus Brabrand) Proc. 27th ACM Conf. on Inno. & Tech. in Computer Science Education, ITiCSE. (2022). Computing Educational Activities Involving People Rather Than Things Appeal More to Women (CS1 Appeal Perspective) (Melissa Høegh Marcher, Ingrid Maria Christensen, Pawel Grabarczyk, Therese Graversen, Claus Brabrand) ACM Conference on International Computing Education Research, ICER 2021: 145-156. (2021). Computing Educational Activities Involving People Rather Than Things Appeal More to Women (Recruitment Perspective) (Ingrid Maria Christensen, Melissa Høegh Marcher, Pawel Grabarczyk, Therese Graversen, Claus Brabrand) ACM Conference on International Computing Education Research, ICER 2021: 127-144. (2021). How Interaction Influences Academic Reading: A Comparison of Paper and Laptop (Nanna Inie, Louise Barkhuus, Claus Brabrand) Social Sciences & Humanities Open. 21pp. (2021). Three +1 Perspectives on Computational Thinking (Sebastian Mateos Nicolajsen, Magda Pischetola, Pawel Grabarczyk, Claus Brabrand) Proc. 21st Koli Calling International Conference on Computing Education Research, Koli Calling 2021: 2:1-2:11. (2021). 2010s: Variability & Software Product Lines (predominantly) Finding Suitable Variability Abstractions for Lifted Analysis (Aleksandar S. Dimovski, Claus Brabrand, Andrzej Wasowski) Formal Aspects of Computing 31(2): 231-259 (2019). Variability Abstractions for Lifted Analyses (Aleksandar S. Dimovski, Claus Brabrand, Andrzej Wasowski) Science of Computer Programming, SCP. 159: 1-27 (2018). Variability Bugs in Highly Configurable Systems: A Qualitative Analysis (Iago Abal, Jean Melo, Stefan Stanciulescu, Claus Brabrand, Márcio Ribeiro, Andrzej Wasowski) ACM Transactions on Software Engineering and Methodology, TOSEM. 26(3): 10:1-10:34 (2018). Effective Analysis of C Programs by Rewriting Variability (Alexandru Florin Iosif-Lazar, Jean Melo, Aleksandar S. Dimovski, Claus Brabrand, Andrzej Wasowski) The Art, Science, and Engineering of Programming. 1(1): 1 (2017). Efficient Family-Based Model Checking via Variability Abstractions (Aleksandar S. Dimovski, Ahmad Salim Al-Sibahi, Claus Brabrand, Andrzej Wasowski) International Journal on Software Tools for Technology Transfer. 19(5): 585-603 (2017). Variability through the Eyes of the Programmer (Jean Melo, Fabricio Batista Narcizo, Dan Witzner Hansen, Claus Brabrand, Andrzej Wasowski) Proc. of the 25th International Conference on Program Comprehension, ICPC 2017: 34-44. (2017). Effective Bug Finding in C Programs with Shape and Effect Abstractions (Iago Abal, Claus Brabrand, Andrzej Wasowski) Proc. of the 18th International Conference on Verification, Model Checking, and Abstract Interpretation, VMCAI 2017: 34-54. (2017). Finding Suitable Variability Abstractions for Family-Based Analysis (Aleksandar S. Dimovski, Claus Brabrand, Andrzej Wasowski) Proc. of the 21st International Symposium on Formal Methods, FM 2016: 217-234. (2016). How does the Degree of Variability affect Bug Finding? (Jean Melo, Claus Brabrand, Andrzej Wasowski) Proc. of the 38th International Conference on Software Engineering, ICSE 2016: 679-690. (2016). A Quantitative Analysis of Variability Warnings in Linux (Jean Melo, Elvis Flesborg, Claus Brabrand, Andrzej Wasowski) Proc. 10th International Workshop on Variability Modelling of Software-intensive Systems, VaMoS 2016: 3-8. (2016). Systematic Derivation of Correct Variability-Aware Program Analyses (Jan Midtgaard, Aleksandar S. Dimovski, Claus Brabrand, Andrzej Wasowski) Science of Computer Programming, SCP 105: 145-170 (2015). Variability Abstractions: Trading Precision for Speed in Family-Based Analyses (Aleksandar S. Dimovski, Claus Brabrand, Andrzej Wasowski) 29th European Conference on Object-Oriented Programming, ECOOP 2015: 247-270. (2015). Family-Based Model Checking Without a Family-Based Model Checker (Aleksandar S. Dimovski, Ahmad Salim Al-Sibahi, Claus Brabrand, Andrzej Wasowski) 22nd International Symposium on Model Checking Software, SPIN 2015: 282-299. (2015). Family-Based Model Checking using Off-the-Shelf Model Checkers (Aleksandar S. Dimovski, Ahmad Salim Al-Sibahi, Claus Brabrand, Andrzej Wasowski) Proc. 19th International Conference on Software Product Line, Model Checking Software, SPLC: 397. (2015). Emergent Interfaces for Feature Modularization (Márcio Ribeiro, Paulo Borba, Claus Brabrand) Springer Briefs in Computer Science, Springer 2014, ISBN 978-3-319-11492-7, pp. 1-84. (2014). Preface to the Special Section on Language Descriptions, Tools, and Applications (LDTA 2011) (Claus Brabrand, Eric Van Wyk) Science of Computer Programming, SCP. 87: 1 (2014). 42 Variability Bugs in the Linux Kernel: A Qualitative Study (Iago Abal, Claus Brabrand, Andrzej Wasowski) Proc. 29th IEEE/ACM International Conference on Automated Software Engineering (ASE), pp. 421-432. (2014). Systematic Derivation of Static Analyses for Software Product Lines (Jan Midtgaard, Claus Brabrand, Andrzej Wasowski) Proc. 13th International Conference on MODULARITY 2014, p. 181-192. (2014). SPLLIFT: Statically Analyzing Software Product Lines in Minutes Instead of Years (Eric Bodden, Tarsis Toledo, Marcio Ribeiro, Claus Brabrand, Paulo Borba, Mira Mezini) Software Engineering 2014: 81-82. (2014). Banana Algebra: Compositional Syntactic Language Extension (Jacob Andersen, Claus Brabrand, David R. Christensen) Science of Computer Programming, Vol. 78(10), p. 1845-1870, Elsevier. (2013). SPLLIFT: Statically Analyzing",
  "content_length": 20086,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:48"
}