{
  "name": "Claudio Orlandi",
  "homepage": "https://cs.au.dk/~orlandi",
  "status": "success",
  "content": "Homepage of Claudio Orlandi Homepage of Claudio Orlandi About me Photo by Sebastian Krog Knudsen for Partisia. (Professional) Bio I am a professor in the Crypto Group at Aarhus University. Previously I worked as associate professor (2014-2023) and postdoc (2012-2014) at Aarhus University. Before that, I worked as postdoc at Bar-Ilan University with Yehuda Lindell (2011-2012). I got my PhD in 2011 at Aarhus Univeristy with Ivan Damgård and Jesper Buus Nielsen as my advisors. Numbers My profile on Google Scholar. My Erdős number is 3 via Erdős - Pomerance - Damgård - Me. Unfortunately, my Bacon number is still undefined! ORCID: 0000-0003-4992-0249 Contact Info Address: Department of Computer Science, Aabogade 34, 8200 Aarhus, Denmark Office: Nygaard 283 Email: orlandi at cs.au.dk Phone: (+45) 21433249 Twitter: @claudiorlandi Web: orlandi.dk Research Projects, Centers, etc. DECRYPSYS - \"Decentralized Cryptographic Systemsn\" (ERC Consolidator Grant 2023) DIREC (Danish National Centre for Research in Digital Technologies) - Workstream Leader for \"Cybersecurity and Blockchains\". Past Projects, Centers, etc. SPEC - \"Secure, Private, Efficient Multiparty Computation\" (ERC Starting Grant 2018) Concordium Blockcahin Research Center Aarhus - WP Lead Cryptography BCM - WP Leader for \"Center for Blockchains and Electronic Markets\" (Carlsberg Foundation Semper Ardens 2019) FoCC - \"Foundations of Cryptographic Computing\" (DFF-FNU Sapere Aude Starting Grant 2016) CryptoAction - Chair of \"Cryptography for Secure Digital Interaction\" (COST Action IC 1306) SODA - WP Leader for \"Scalable Oblivious Data Analytics\" (H2020 ICT-18-2016) DIGIT - CyberSecurity WP Leader for \"Aarhus University Centre for Digitalisation, Big Data and Data Analytics\". PRACTICE - \"Privacy-Preserving Computation in the Cloud\" (FP7 ICT-2013-10) CTIC - Cryptography WP Leader for \"Center for the Theory of Interactive Computation\". CryPSCo - \"Cryptographic Protocols For Secure Computation\" (DFF-FTP Individual Postdoc Grant 2011) Manuscripts OneTwoPAKE: Two-Round Strong Asymmetric PAKE with Ideal Security Yashvanth Kondi, Ian McQuoid, Kelsey Melissaris, Claudio Orlandi, Lawrence Roy, LaKyah Tyner Manuscript. [ePrint]. Peer-Reviewed Publications I believe that all scientific publications should be freely available online, given that researchers and peer-reviewers are largely supported by public funding. Therefore I am committed to make all my papers availabe to the general public. If there is a paper of mine you would like to read but do not have access to, please write me and I will be happy to share a copy with you. Following the Hardy-Littlewood rule, the list of authors in most of my publications is sorted alphabetically, and not by contribution (exceptions: 1-4, 43; 14 is a mistake, as the last author should have been indexed by the \"B\" of Burra instead of S of \"Sheshank\". 58 corrects this mistake.). 83. Privately Constrained PRFs from DCR: Puncturing and Bounded Waring Rank Amik Raj Behera, Pierre Meyer, Claudio Orlandi, Lawrence Roy, Peter Scholl TCC 2025. [ePrint]. 82. Silent Circuit Relinearisation: Sublinear-Size (Boolean and Arithmetic) Garbled Circuits from DCR Pierre Meyer, Claudio Orlandi, Lawrence Roy, Peter Scholl CRYPTO 2025. [ePrint]. 81. Distributed Differentially Private Data Analytics via Secure Sketching Jakob Burkhardt, Hannah Keller, Claudio Orlandi, Chris Schwiegelshohn ICML 2025. [ePrint], [arXiv]. 80. Securely Computing One-Sided Matching Markets James Hsin-Yu Chiang, Ivan Damgård, Claudio Orlandi, Mahak Pancholi, Mark Simkin Financial Cryptography 2025. [ePrint]. 79. Fiat-Shamir Bulletproofs are Non-Malleable (in the Random Oracle Model) Chaya Ganesh, Claudio Orlandi, Mahak Pancholi, Akira Takahashi, Daniel Tschudi Journal of Cryptology, 2024. [ePrint]. (Full version of 64 with additional and improved results.) 78. Rate-1 Arithmetic Garbling from Homomorphic Secret-Sharing Pierre Meyer, Claudio Orlandi, Lawrence Roy, Peter Scholl TCC 2024. [ePrint]. 77. An Improved Threshold Homomorphic Cryptosystem Based on Class Groups Lennart Braun, Guilhem Castagnos, Ivan Damgård, Fabien Laguillaumie, Kelsey Melissaris, Claudio Orlandi, Ida Tucker SCN 2024. [ePrint]. 76. Differentially Private Selection from Secure Distributed Computing Ivan Damgård, Hannah Keller, Boel Nelson, Claudio Orlandi, Rasmus Pagh WWW 2024. [ePrint], [arXiv]. 75. Improved Distributed RSA Key Generation Using the Miller-Rabin Test Jakob Burkhardt, Ivan Damgård, Tore Frederiksen, Satrajit Ghosh, Claudio Orlandi CCS 2023. [ePrint]. 74. Two-Round Stateless Deterministic Two-Party Schnorr Signatures From Pseudorandom Correlation Functions Yashvanth Kondi, Claudio Orlandi, Lawrence Roy CRYPTO 2023. [ePrint]. 73. Secure Multiparty Computation from Threshold Encryption based on Class Groups Lennart Braun, Ivan Damgård, Claudio Orlandi CRYPTO 2023. [ePrint]. 72. MPC with Low Bottleneck-Complexity: Information-Theoretic Security and More Hannah Keller, Claudio Orlandi, Anat Paskin-Cherniavsky, Divya Ravi ITC 2023. [ePrint]. 71. Witness-Succinct Universally-Composable SNARKs Chaya Ganesh, Yashvanth Kondi, Claudio Orlandi, Mahak Pancholi, Akira Takahashi, Daniel Tschudi EUROCRYPT 2023. [ePrint]. 70. Structure-Preserving Compilers from New Notions of Obfuscations Matteo Campanelli, Danilo Francati, Claudio Orlandi PKC 2023. [ePrint]. 69. Laconic Private Set-Intersection From Pairings Diego Aranha, Chuanwei Lin, Claudio Orlandi, Mark Simkin CCS 2022. [ePrint]. 68. Zero-Knowledge for Homomorphic Key-Value Commitments with Applications to Privacy-Preserving Ledgers Matteo Campanelli, Felix Engelmann, Claudio Orlandi SCN 2022. [ePrint]. 67. On Access Control Encryption without Sanitization Cecilia Boschini, Ivan Damgård, Claudio Orlandi SCN 2022. [ePrint]. 66. An Algebraic Framework for Silent Preprocessing with Trustless Setup and Active Security Damiano Abram, Ivan Damgård, Claudio Orlandi, Peter Scholl CRYPTO 2022. [ePrint]. 65. Low-Bandwidth Threshold ECDSA via Pseudorandom Correlation Generators Damiano Abram, Ariel Nof, Claudio Orlandi, Peter Scholl, Omer Shlomovits IEEE Symposium on Security and Privacy 2022. [ePrint]. 64. Fiat-Shamir Bulletproofs are Non-Malleable (in the Algebraic Group Model) Chaya Ganesh, Claudio Orlandi, Mahak Pancholi, Akira Takahashi, Daniel Tschudi EUROCRYPT 2022. [ePrint]. 63. ECLIPSE: Enhanced Compiling method for Pedersen-committed zkSNARK Engines Diego F. Aranha, Emil Madsen Bennedsen, Matteo Campanelli, Chaya Ganesh, Claudio Orlandi, Akira Takahashi PKC 2022. [ePrint]. 62. On the Bottleneck Complexity of MPC with Correlated Randomness Claudio Orlandi, Peter Scholl, Divya Ravi PKC 2022. [ePrint]. 61. Virtual ASICs: Generalized Proof-of-Stake Mining in Cryptocurrencies Chaya Ganesh, Claudio Orlandi, Daniel Tschudi, Aviv Zohar CBT 2021. [ePrint]. [Video (short)], [Video (long)]. 60. Improved Threshold Signatures, Proactive Secret Sharing and Input Certification from LSS Isomorphisms Diego Aranha, Anders Dalskov, Daniel Escudero, Claudio Orlandi LATINCRYPT 2021. [ePrint]. 59. Stronger Notions and a More Efficient Construction of Threshold Ring Signatures Alexander Munch-Hansen, Claudio Orlandi, Sophia Yakoubov LATINCRYPT 2021. [ePrint]. 58. High Performance Multi-Party Computation for Binary Circuits Based on Oblivious Transfer Sai Sheshank Burra, Enrique Larraia, Jesper Buus Nielsen, Peter Sebastian Nordholt, Claudio Orlandi, Emmanuela Orsini, Peter Scholl, Nigel P. Smart Journal of Cryptology, 2021. [ePrint]. 57. Balancing Privacy and Accountability in Blockchain Identity Management Ivan Damgård, Chaya Ganesh, Hamidreza Khoshakhlagh, Claudio Orlandi, Luisa Siniscalchi CT-RSA 2021. [ePrint]. 56. Two-round n-out-of-n and Multi-Signatures and Trapdoor Commitment from Lattices Ivan Damgård, Claudio Orlandi, Akira Takahashi, Mehdi Tibouchi PKC 2021 and Invited to Journal of Cryptology, 2022. [ePrint]. [Video]. 55. The Rise of Paillier: Homomorphic Secret Sharing and Public-Key Silent OT Claudio Orlandi, Peter Scholl, Sophia Yakoubov. EUROCRYPT 2021. [ePrint]. 54. Refresh When You Wake Up: Proactive Threshold Wallets with Offline Devices Yashvanth Kondi, Bernardo Magri, Claudio Orlandi, Omer Shlomovits IEEE Symposium on Security and Privacy 2021. [ePrint], [Video] 53. Stronger Security and Constructions of Multi-Designated Verifier Signatures Ivan Damgård, Helene Haagh, Rebekah Mercer, Anca Nițulescu, Claudio Orlandi, Sophia Yakoubov TCC 2020. [ePrint]. 52. Securing DNSSEC Keys via Threshold ECDSA From Generic MPC Anders Dalskov, Marcel Keller, Claudio Orlandi, Kris Shrishak, Haya Shulman ESORICS 2020. [ePrint]. [Video]. 51. Secure Generalized Deduplication via Multi-Key Revealing Encryption Daniel Lucani, Lars Nielsen, Claudio Orlandi, Elena Pagnin, Rasmus Vestergaard SCN 2020. [ePrint].[Video]. 50. Black-Box Transformations from Passive to Covert Security with Public Verifiability Ivan Damgård, Claudio Orlandi, Mark Simkin CRYPTO 2020. [ePrint], [Video]. 49. Optimal Transport Layer for Secure Computation Markus Brandt, Claudio Orlandi, Kris Shrishak, Haya Shulman SECRYPT 2020. [ePrint]. 48. Use your Brain! Arithmetic 3PC For Any Modulus with Active Security (New version!) Hendrik Eerikson, Marcel Keller, Claudio Orlandi, Pille Pullonen, Joonas Puura, Mark Simkin Information-Theoretic Cryptography (ITC) 2020. [ePrint], [Video]. 47. Security of Hedged Fiat-Shamir Signatures under Fault Attacks Diego F. Aranha, Claudio Orlandi, Akira Takahashi, Greg Zaverucha EUROCRYPT 2020. [ePrint], [Video]. 46. Commodity-Based 2PC for Arithmetic Circuits Ivan Damgård, Helene Haagh, Michael Nielsen, Claudio Orlandi IMA Cryptography and Coding 2019. [ePrint], [code]. 45. QuisQuis: A New Design for Anonymous Cryptocurrencies Prastudy Fauzi, Sarah Meiklejohn, Rebekah Mercer, Claudio Orlandi ASIACRYPT 2019. [ePrint]. 44. Sharing Information with Competitors Simina Brânzei, Claudio Orlandi, Guang Yang SAGT 2019. [arXiv]. 43. TOPPool: Time-aware Optimized Privacy-Preserving Ridesha",
  "content_length": 20455,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:36"
}