{
  "name": "Claudia Müller 0002",
  "homepage": "https://italg.wineme.uni-siegen.de/team/claudia-mueller",
  "status": "success",
  "content": "» Claudia Müller – Professorin der Kalaidos Fachhochschule Skip to the navigation.Skip to the content. Fakultät III IT für die alternde Gesellschaft Aktuelles Stellenausschreibungen Team Prof. Dr. Claudia Müller Dr. Stephan Krayter M.A. Claudius Cluever Dipl.-Soz.-Wiss. Dennis Kirschsieper Enzo Frenker-Hackfort M.Sc. Gloria Basoeki Hussain Abid Syed M.Sc. Julia Renardias M.Sc. Kyra Dunkel M.Sc. Marios Mouratidis Nino Bohn M.Sc. Philipp Rutz M.Sc. Sourav Bhattacharjee Dipl.-Wirt.Inform. Sven Bittenbinder M.A. Tanja Aal M.Sc. Tim Weiler Alumni Studentische Hilfskräfte Projekte Publikationen Alle nach Jahr Alle nach Typ Proceeding Journal Lehre Abschluss- und Projektarbeiten Technikentwicklung im Gesundheitsbereich Telemedizin Barrierefreiheit in der Praxis Digitale Medien und eHealth in Communities Digitale soziale Dienste & Inklusion Unterstützung Forschungspartner*in werden Kontakt Webmail Unisono Formulare Sprachen Deutsch English Suche nach: Aktuelles READY? – Das Reflexionstool für den potenziellen Einsatz von Robotik für die Pflege Kinder präsentierten Innovatives aus dem Fab Lab Dr. Richard Paluch zum neuen Co-Sprecher des Fachausschusses Alter und Technik gewählt Informations- und Diskussionsveranstaltung zur elektronischen Patientenakte (ePA) Erste Absolventinnen und Absolventen des Zertifikats „Barrierefrei lehren“ in Siegen / cscw / home / 28. März 2019 Claudia Müller – Professorin der Kalaidos Fachhochschule Der Fachhochschulrat der Kalaidos Fachhochschule hat Claudia Müller den Titel «Professorin der Kalaidos Fachhochschule» verliehen. Prof. Dr. Müller verstärkt seit Oktober 2018 das Forschungsteam Ageing at Home an der Careum Hochschule Gesundheit in Zürich. Weitere Infos zu Claudia Müller – Professorin der Kalaidos Fachhochschule © Universität Siegen | Datenschutzerklärung | Aktualisiert via WordPress Die mit (*) gekennzeichneten Felder müssen ausgefüllt werden * Name, Vorname * E-Mail WWW Bemerkungen Um E-Mail-Spam zu verhindern, bitten wir Sie, das Ergebnis der Rechnung in das Feld einzutragen: 6 + 1 =",
  "content_length": 2052,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:27"
}