{
  "name": "Claudia Bauzer Medeiros",
  "homepage": "http://www.ic.unicamp.br/~cmbm",
  "status": "success",
  "content": "Claudia Bauzer Medeiros Web Page CLAUDIA BAUZER MEDEIROS Home Ongoing Projects Publications Students Supervised Previous Projects Pictures Additional Information Address at the University: Institute of Computing (IC) - University of Campinas (IC - UNICAMP) Av Albert Einstein 1251 13083-852 Campinas, SP - Brazil Phones: (55)(19) 3521-5855 (office) (55)(19) 3521-5840 (secretary) (55)(19) 3521-5847 (fax) E-mail: cmbm at ic dot unicamp dot br Activities: Full professor, teaching undergraduate and graduate courses at (IC - UNICAMP) Founder of the Laboratory of Information Systems ( LIS ) at the Institute of Computing, UNICAMP The Laboratory`s site contains all details about research activity -- Publications, Students supervised, Past Projects and Current Projects Short cv: Claudia Bauzer Medeiros is full professor of databases at the Institute of Computing, University of Campinas (Unicamp), Brazil. She holds a degree in Electrical Engineering (1976) and an MSc degree in Computer Science (1979) from PUC-Rio, Brazil and a PhD in Computer Science from the University of Waterloo, Canada (1985). For the past 20 years, she has been working as a visiting professor at the University Paris-Dauphine, France. She has received Brazilian and international awards for research, teaching, and also for her work in fostering the participation of women in IT-related activities. Her research is centered on the design and development of scientific databases. Her main interests lie in facing the challenges posed by large, real world applications, which require handling distributed and very heterogeneous data sources. In particular, she has coordinated large multidisciplinary projects, in Brazil, involving applications in agro-environmental planning and biodiversity. Data to be handled include, among others, sensor data streams, satellite images, photos, videos, sound and all kinds of textual sources. She has also coordinated research projects in scientific data management, workflow systems and geographic information, in cooperation with universities and research labs in Brazil, Germany and France. She is a Commander of the Brazilian Order of Scientific Merit, Dr. Honoris Causa from the University Antenor Orrego, Peru (2007), and Dr. Honoris Causa from the University Paris-Dauphine, France (2015). In 2018, elected for the Council of the Research Data Alliance, and as Member at Large of the Council of the ACM. In 2018, elected as a Member of the Brazilian Academy of Sciences. In 2020, elected member of the WDS Council. In 2021, elected member of the TWAS (World Academy of Sciences). Link to the LATTES CV Member of the World Academy of Sciences - TWAS Member of the Brazilian Academy of Sciences - ABC Member of the Council of the Research Data Alliance - RDA Member at Large of the ACM Council. Co-coordinator of the eScience and Data Science program at FAPESP -- Fundacao de Amparo a Pesquisa do Estado de Sao Paulo Former member of ACM Distinguished Speakers Program ACM DSP - see my link at My DSP link Ex-Ambassador for ACM's Committee on Women in Computing ACM-W Ex- President of the Brazilian Computer Society (SBC) (2003-2007) and member of its Governing Council - 2007-- 2011 Teaching activities - 18 month period First semester 2021 - MC536 Second semester 2020 - MO903 and MC009 First semester 2020 - MC536 Second semester 2019 - MO812 Tips for students -- How to write reports, projects etc --> Last updated on July 12, 2019 Disclaimer: This is a personal page, and not an official UNICAMP's page. Its contents are of entire responsibility of Claudia Bauzer Medeiros. Esta página não é uma publicação oficial da UNICAMP, seu conteúdo não foi examinado e/ou editado por esta instituição. A responsabilidade por seu conteúdo é exclusivamente do autor",
  "content_length": 3789,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:40"
}