{
  "name": "Claudia Cavallaro",
  "homepage": "https://web.dmi.unict.it/docenti/claudia.cavallaro",
  "status": "success",
  "content": "Claudia CAVALLARO | Dipartimento di Matematica e Informatica Vai al contenuto principaleVai al menu di navigazione Vai ai contenuti correlati Claudia CAVALLARO Ricercatrice t.d. (art. 24 c.3-a L. 240/10) di Informatica [INFO-01/A] Contatti Email: claudia.cavallaro@unict.itTelefono: 095 7383054 Orario di ricevimento Martedì dalle 14:30 alle 16:30 Ricevimento tramite piattaforma Teams ENGLISH VERSIONSTUDIUMAREA RISERVATA CURRICULUMPUBBLICAZIONIINSEGNAMENTIAVVISI Dall'1 Gennaio 2022 è Ricercatrice di tipo A nel settore INF/01, su progetto REACT-EU il cui referente scientifico è il Professore Vincenzo Cutello. Membro del Complex Intelligent Systems Research Group. Dottore di Ricerca in Informatica, con tesi dal titolo “Analysis of large GPS trajectories datasets via multi-agent techniques”, supervisori Professore Orazio Muscato e Professore Emiliano Tramontana. Precedentemente è stata: · Assegnista di Ricerca presso il CNAF-INFN di Bologna su tematiche informatiche (1 Novembre 2020 - 31 Dicembre 2021) · Docente a contratto presso l’Università di Torino per Informatica (A.A. 2021/22) · Visiting presso il Dipartimento di Informatica – Scienza e Ingegneria dell’Alma Mater Studiorum – Università di Bologna (56 giorni, 1 Settembre 2020-31 Ottobre 2020), referente Professore Paolo Bellavista e presso il Departament de Matemàtiques i Informàtica dell’Universitat de Barcelona (190 giorni, 18 Settembre 2018-26 Marzo 2019), referente Professore Jordi Vitrià. · Docente a contratto, docente di didattica integrativa e tutor per i Corsi di Laurea in: Ingegneria Informatica -  Ingegneria Elettronica, Chimica Industriale, Scienze Ambientali e Naturali, Informatica, Ingegneria Civile e Ambientale, Fisica, Economia, Economia Aziendale, Scienze Biologiche, Chimica, Scienze del Servizio Sociale e Sociologia dell’Università di Catania, dall’A.A. 2013-14 all'A.A. 2019-20. VISUALIZZA LE PUBBLICAZIONI N.B. l'elevato numero di pubblicazioni può incidere sul tempo di caricamento della pagina VISUALIZZA GLI INSEGNAMENTI DALL'A.A. 2022/2023 AD OGGI Anno accademico 2021/2022 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 2° annoWEB REASONING E LABORATORIO DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 3° annoINTERNET SECURITY Anno accademico 2016/2017 DIPARTIMENTO DI INGEGNERIA ELETTRICA ELETTRONICA E INFORMATICACorso di laurea in Ingegneria informatica - 1° annoANALISI MATEMATICA I - canale 4 VISUALIZZA GLI INSEGNAMENTI PRECEDENTI ARCHIVIO Condividi Facebook Twitter Whatsapp Telegram Email Storia del DMI Regolamenti Organi e Commissioni Personale del DMI Docenti Personale Tecnico/Amministrativo Assegnisti di ricerca Dottorandi Coordinamento dipartimentale Amministrazione, Uffici e Servizi Guide Procedure e moduli Assicurazione della Qualità DMI sui social Aule Link utili Cerca nel sito Termini da ricercare",
  "content_length": 2888,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:22"
}