{
  "name": "Claudia Neuhauser",
  "homepage": "http://cbs.umn.edu/contacts/claudia-neuhauser",
  "status": "success",
  "content": "Claudia Neuhauser | College of Biological Sciences Skip to main content COLLEGE of BIOLOGICAL SCIENCES Phone Numbers 612-625-9258 612-626-7431 [email protected] Office Address 101 Pleasant St SE Minneapolis, MN 55455 United States Claudia Neuhauser Professor Emeritus Ecology, Evolution, and Behavior Selected publications Selected publications Shulan Tian; Huihuang Yan; Claudia Neuhauser; Susan Slager. A framework for accurate variant discovery in highly divergent regions. 2016. BMC Genomic 17:703. S.E.P. Smith, S.C. Neier, B.K. Reed, R.R, Davis, D. Gil, J.P, Sinnwell, J.E. Eckel-Passow, G.F. Sciallis, C.N. Wieland, R.R. Torgerson, Z.Chen, J.McClusky, S.R. Burrows, C. Neuhauser, A.G.  Schrum. Multiplex matrix network analysis of physiologic protein complexes in the human TCR signalosome. 2016. Science Signaling 439 rs7 (DOI: 10.1126/scisignal.aad7279) J.D. Cooper, C. Neuhauser, T. Dean, and B. Kerr. 2015. Tipping the mutation-selection balance: Limited migration increases the frequency of deleterious mutants. Journal of Theoretical Biology, 380: 123-133. Cradic, Kendall; Murphy, Stephen; Sikkink, Robert; Neuhauser, Claudia; Vasmatzis, George; Grebe, Stefan. 2015.  Clinical Validation of a Haplotyping Method with Next Generation Sequencing.  Clinical Chemistry 61:2, 430-431. Cradic, Kendall; Murphy, Stephen; Drucker, Travis; Sikkink, Robert; Eberhardt, Norman; Neuhauser, Claudia; Vasmatzis, George; Grebe, Stefan. 2014.  A simple method for gene phasing using mate pair sequencing.  BMC Medical Genetics 15:19 N. Beckman, C. Neuhauser, and H.C. Muller-Landau. 2012. The interacting effects of clumped seed dispersal and distance- and density-dependent natural enemy attack on seedling recruitment patterns.  Journal of Ecology 100(4): 862-873. N. Lanchier and C. Neuhauser. 2007. Voter model and biased voter model in heterogeneous environment. Journal of Applied Probability 44: 770-787.\" C. Neuhauser, D.A. Andow, G. Heimpel, G. May, R. Shaw, and S. Wagenius 2003. Community Genetics - A Synthesis of Community Ecology and Population Genetics. Ecology 84: 545-558. P. Chesson, S. Pacala, and C. Neuhauser 2002. Environmental niches and ecosystem functioning. In Biodiversity and Ecosystem Functioning. Pp. 213-245. Princeton. C. Neuhauser and S. Pacala 1999. An explicitly spatial version of the Lotka-Volterra model with interspecific competition. Annals of Applied Probability 9:1226-1259 C. Neuhauser and S. Krone 1997. The Genealogy of Samples in Models with Selection. Genetics 145:519-534. Future Students Undergraduates About CBS Majors and minors Schedule a tour of campus Apply for admission Transfer to CBS Scholarships for incoming students Information for admitted students Graduate students Graduate programs Graduate School admissions Funding for graduate students Current Students Undergraduates Academic advising Career readiness Student engagement Learning abroad Research opportunities Field courses Scholarships Dean's list Graduation and commencement Graduate students Funding for graduate students Graduate student governance Policies, forms, and resources Graduate commencement Graduate program contacts Academics Majors and minors Graduate programs Departments Biochemistry, Molecular Biology, and Biophysics Biology Teaching and Learning Ecology, Evolution, and Behavior Genetics, Cell Biology and Development Plant and Microbial Biology Faculty directory Research Research at CBS Undergraduate research Field stations Cedar Creek Ecosystem Science Reserve Itasca Biological Station and Laboratories Seminars Centers and institutes Facilities, resources and programs About About CBS College leadership CBS directory News and events Offices and services Dean's office directory Advancement Facilities Human resources Marketing and communications Research & Learning Technologies Student Services BioGen administrative center St. Paul Administrative Cluster Instructional labs Diversity, equity, and inclusion Outreach and engagement Award-winning faculty and staff Resources for faculty and staff Resources for postdocs Alumni Opportunities to engage Alumni awards and recognition News for alumni and friends Update your contact info Give Giving to CBS Ways to give Donor impact",
  "content_length": 4224,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:29"
}