{
  "name": "Claudia Müller 0001",
  "homepage": "https://www.mi.fu-berlin.de/en/inf/groups/hcc/members/professor/mueller-birn.html",
  "status": "success",
  "content": "Claudia Müller-Birn • Human-Centered Computing • Department of Mathematics and Computer Science Springe direkt zu Inhalt Department of Mathematics and Computer Science/Computer Science/Human-Centered Computing Path NavigationHomepageComputer ScienceWork GroupsHuman-Centered ComputingTeamProfessorClaudia Müller-BirnProf. Dr. Claudia Müller-Birn ContactPersonal ProfileTeachingPublicationsInstitute of Computer ScienceProfessor for Human-Centered Computing (HCC)AddressKönigin-Luise-Str. 24/26Room 11914195 BerlinOfficeSylvia DeterTelephone+49 30 838 75256Fax+49 30 838 75220Emailclmb[at]inf.fu-berlin.deHomepageNews on Personal Academic webseiteOffice hoursMy consultation time (\"Sprechstunde\") is, if not stated otherwise, each Thursday between 1 to 2 PM. Please select an available slot on Whiteboard. If you are interested in writing your BSc. or MSc. thesis in my group, please check out the currently available topics. I outlined the general process of writing a thesis at the HCC.lab. Since October 2019, I have been the Head of the Examination Committee and the Program Master of Computer Science at the Institute of Computer Science at the Freie Universität Berlin. Please check out the very useful information regarding various typical questions during your master's study on the Wiki.Prof. Müller-Birn is the head of the research group Human-Centered Computing at the Institute of Computer Science at the Freie Universität of Berlin. She is also a principal investigator at the Cluster of Excellence Cluster of Excellence Matters of Activity «Image Space Material» (MoA) at the Humboldt-Universität zu Berlin. Prior to her appointment at Freie Universität Berlin, she undertook a post-doc at the Carnegie Mellon University based on a Feodor Lynen Research Fellowship of the Alexander von Humboldt-Foundation. In my research, I strive to advance our understanding of effective, human-centered design for AI interfaces in healthcare by developing and evaluating targeted design interventions in the area of human-computer interaction in healthcare. My primary focus is on how AI can support human decision-making processes. In particular, I investigate the impact of different levels of automation, the role of friction in interface design, and the assessment of decision aids. Additionally, I am committed to developing diverse methodological approaches for the participatory design of AI systems, ensuring that the perspectives and needs of various societal groups are thoughtfully integrated. An overview of all funded research projects is on my group website. Moreover, I advocate the use and development of open-source software, the principles of open science in my research work, and open access to scholarly knowledge. Scientific Career Path Since 2019 Associate Professor (tenured) Human-Centered Computing (HCC), FU Berlin. 2012 – Assistant Professor Human-Centered Computing (HCC), Freie Universität Berlin (before visting professor). 2010 – Post-doctoral Researcher, Carnegie Mellon University (US). 2008 – Dissertation (Dr. rer. nat.) in Business Informatics, University of Potsdam. 2004 – Diploma (Dipl.-Ing.) in Industrial Engineering., Technical University of Berlin. Awards and Prizes 2024 Award as one of the “100 minds of science in the capital city 2024”, Der Tagesspiegel. 2024 Max Rubner-Preis 2024, Endowed Award at Charité - Universitätsmedizin Berlin. 2019 Honorable Mention Award (best 5%), 25th ACM Conference on Computer Supported Cooperative Work. 2014 Ted Nelson Newcomer Award, 25th ACM Conference on Hypertext and Social Media. 2009 Feodor Lynen Research Fellowship, Alexander von Humboldt Foundation. 2009 Mini Challenge Award: Good Tool Flexibility, IEEE Symposium on Visual Analytics Science and Technology. Teaching Summer Term 2025 Lecture with Exercise: Mensch-Computer Interaktion Lecture with Exercise: Human-Centered Data Science Lecture Scientific Work in Computer Science Research Seminar: Human-Centered Computing Winter Term 2024/25 No teaching - sabbatical. Summer Term 2024 Research Seminar: Human-Centered Computing Lecture with Exercise: Human-Centered Data Science Lecture with Exercise: Mensch-Computer Interaktion Proseminar: Interactive Intelligent Systems - A Human-Centered Perspective Lecture with Exercise: NPVP - Nebenläufige, Parallele und Verteilte Programmierung Winter Term 2023/24 Research Seminar: Human-Centered Computing Software Project: Coding IxD Lecture with Exercise: Data Visualization Summer Term 2023 Lecture with Exercise: ALP IV: Nichtsequentielle und verteilte Programmierung Lecture with Exercise: Human Computer Interaction I Lecture with Exercise: Human-Centered Data Science Research Seminar: Human-Centered Computing Winter Term 2022/23 Lecture with Exercise: Data Visualization Lecture: Doing Research in Computer Science Software Project: Coding IxD Research Seminar: Human-Centered Computing Summer Term 2022 Lecture with Exercise: ALP IV: Nichtsequentielle und verteilte Programmierung Lecture with Exercise: Human Computer Interaction I Lecture with Exercise: Human-Centered Data Science Software Project: Coding Openness Seminar: Research Topics in HCI Research Seminar: Human-Centered Computing Winter Term 2021/22 Lecture with Exercise: Data Visualization Software Project: Coding IxD Research Seminar: Human-Centered Computing Summer Term 2021 No teaching - sabbatical. Winter Term 2020/21 Lecture with Exercise: Human-Centered Data Science Lecture with Exercise: Data Visualization Research Seminar: Human-Centered Computing Summer Term 2020 Lecture with Exercise: Human Computer Interaction (I) Lecture with Exercise: ALP IV: Nichtsequentielle und verteilte Programmierung Seminar: Human-Centered Machine Learning Software Project: Coding Openness Research Seminar: Human-Centered Computing Winter Term 2019/20 Lecture with Exercise: Data Visualization Seminar: Human-Centered Machine Learning Proseminar: Interactive Intelligent Systems Software Project: Coding IxD Research Seminar: Human-Centered Computing Summer Term 2019 Lecture with Exercise: ALP IV: Nichtsequentielle und verteilte Programmierung Lecture with Exercise: User-Centered Design Software Project: Coding Openness Research Seminar: Human-Centered Computing Please enable JavaScript in Your browser. NewsPlease enable JavaScript.overview Open PositionsCurrent CoursesResearch Seminar: Human-Centered Computing Data Visualization (Lecture with Exercise) NPVP: Nebenläufige, parallele und verteilte Programmierung (Lecture with Exercise) Applying LLMs in Healthcare (Software Project) Doing Research in Computer Science (Lecture)",
  "content_length": 6596,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:26"
}