{
  "name": "Claudia Díaz",
  "homepage": "https://homes.esat.kuleuven.be/~cdiaz",
  "status": "success",
  "content": "Claudia Diaz - Homepage Personal Homepage of Claudia Diaz (Part-Time) Associate Professor at COSIC KU Leuven Department of Electrical Engineering (ESAT) Address: Kasteelpark Arenberg 10, B-3001 Leuven (Belgium) Office:   B01.28 Phone:  +32 (0)16  32 18 14 Email:  claudia.diaz (at) esat.kuleuven.be Short Bio I am a part-time Associate Professor at the COSIC research group of the Department of Electrical Engineering (ESAT) at the KU Leuven, working on Privacy Technologies. I hold a Master's degree in Telecommunications Engineering from the University of Vigo (2000) and a Ph.D. in Engineering from the KU Leuven (doctoral dissertation on Anonymity and Privacy in Electronic Services, 2005). I was supported by a postdoctoral fellowship from the National Fund for Scientific Research in Flanders (FWO) between 2009 and 2012. I was a full-time faculty member from 2010 to 2022, working part-time since 2022. Since 2019 I am Chief Scientist at Nym Technologies SA. My research is focused on the design, analysis, and applications of technologies to protect online privacy, and in particular technologies that offer protection for metadata to prevent surveillance, traffic analysis, tracking, localization and profiling. Below you can find all the details of my research, teaching, and academic service activities. Note: I am only working part-time (10%) at KU Leuven, with the consequent reduction in academic activities. I am not taking any new students. If you want to apply to COSIC, please check out the group's vacancies as my colleagues may have open positions. Applications sent to me will be ignored. Publications   Awards   Committees   Teaching Team   Projects   Events   Talks Links Publications Google Scholar page Peer-Reviewed Publications LAMP: Lightweight Approaches for Latency Minimization in Mixnets with Practical Deployment Considerations. Mahdi Rahimi, Piyush Kumar Sharma, Claudia Diaz. Network and Distributed System Security Symposium (NDSS'25), 19 pages, 2025. MixMatch: Flow Matching for Mixnet Traffic.  Lennart Oldenburg, Marc Juarez, Enrique Argones Rua, Claudia Diaz. Proceedings on Privacy Enhancing Technologies (PoPETs) 2024.2, 19 pages, 2024. Blending Different Latency Traffic With Beta Mixing. Iness Ben Guirat, Debajyoti Das, Claudia Diaz. Proceedings on Privacy Enhancing Technologies (PoPETs) 2024.2, 15 pages, 2024. LARMix: Latency-Aware Routing in Mix Networks. Mahdi Rahimi, Piyush Kumar Sharma, Claudia Diaz. Network and Distributed System Security Symposium (NDSS'24), 18 pages, 2024. Are continuous stop-and-go mixnets provably secure? Debajyoti Das, Claudia Diaz, Aggelos Kiayias and Thomas Zacharias. Proceedings on Privacy Enhancing Technologies (PoPETs) 2024.4, 19 pages, 2024. Mixnet Traffic Analysis by Adversaries with Partial Visibility. Iness Ben Guirat, Claudia Diaz, Karim Eldefrawy, and Hadas Zeilberger. In European Symposium on Research in Computer Security (ESORICS 2023), Lecture Notes in Computer Science, Springer-Verlag, 16 pages, 2023. On the Anonymity of Peer-To-Peer Network Anonymity Schemes Used by Cryptocurrencies. Piyush Kumar Sharma, Devashish Gosain, Claudia Diaz. Network and Distributed System Security Symposium (NDSS'23), 18 pages, 2023. Reward Sharing for Mixnets. Claudia Diaz, Harry Halpin, Aggelos Kiayias. Journal of Cryptoeconomic Systems, Volume 2, Issue 1. June 13, 2022. VerLoc: Verifiable Localization in Decentralized Systems. Katharina Kohls, Claudia Diaz. Usenix Security Symposium (USENIX'22), 18 pages, 2022. Mixnet optimization methods. Iness Ben Guirat, Claudia Diaz. Proceedings on Privacy Enhancing Technologies (PoPETs) 2022.3, 22 pages, 2022. From \"Onion Not Found\" to Guard Discovery. Lennart Oldenburg, Gunes Acar, Claudia Diaz. Proceedings on Privacy Enhancing Technologies (PoPETs) 2022.1, 22 pages, 2022. Mix Networks. Claudia Diaz. Encyclopedia of Cryptography, Security and Privacy. Sushil Jajodia, Pierangela Samarati, Moti Yung (Eds), Springer, Berlin, Heidelberg, 5 pages, April 2022. MiXiM: Mixnet Design Decisions and Empirical Evaluation. Iness Ben Guirat, Devashish Gosain, Claudia Diaz. 20th ACM Workshop on Privacy in the Electronic Society (WPES 2021), ACM, 5 pages, 2021. Less is More: A privacy-respecting Android malware classifier using Federated Learning. Rafa Galvez, Veelasha Moonsamy, Claudia Diaz. Proceedings on Privacy Enhancing Technologies (PoPETs) 2021.4, 20 pages, 2021. Encrypted DNS ⇒ Privacy? A Traffic Analysis Perspective. Sandra Siby, Marc Juarez, Claudia Diaz, Narseo Vallina-Rodriguez, Carmela Troncoso. In Network and Distributed System Security Symposium (NDSS'20), IEEE Internet Society, 18 pages, 2020. Inside Job: Applying Traffic Analysis to Measure Tor from Within. Rob Jansen, Marc Juarez, Rafael Galvez, Tariq Elahi, and Claudia Diaz.  In Network and Distributed System Security Symposium (NDSS'18), IEEE Internet Society, 16 pages, 2018. A Survey on Routing in Anonymous Communication Protocols. Fatemeh Shirazi, Milivoj Simeonovski, Rizwan Asghar, Michael Backes, and Claudia Diaz. In ACM Computing Surveys (CSUR), vol. 51(3), article 51, 39 pages, 2018. How Unique is Your. onion? An Analysis of the Fingerprintability of Tor Onion Services. Rebekah Overdorf, Mark Juarez, Gunes Acar, Rachel Greenstadt, Claudia Diaz. In ACM Conference on Computer and Communications Security (CCS'17), pp. 2021-2036, 2017. Towards inferring communication patterns in online social networks. Ero Balsa, Cristina Perez-Sola, Claudia Diaz. ACM Transactions on Internet Technology (TOIT) 17(3), Article 32, 21 pages, 2017. Toward an Efficient Website Fingerprinting Defense. Marc Juarez, Mohsen Imani, Mike Perry, Claudia Diaz, Matthew Wright. European Symposium on Research in Computer Security (ESORICS), Springer LNCS 9878, pp. 27-46, 2016. Privacy in Location-Based Services: An Interdisciplinary Approach. Michael Herrmann, Mireille Hildebrandt, Laura Tielemans, Claudia Diaz. SCRIPTed - A Journal of Law, Technology & Society 13(2):144-170, 2016. Profiling Tor Users with Unsupervised Learning Techniques. Rafael Galvez, Marc Juarez, Claudia Diaz. International Workshop on Inference and Privacy in a Hyperconnected World (INFER). De Gruyter, 16p., 2016. Leaky birds: exploiting mobile application traffic for surveillance. Eline Vanrykel, Gunes Acar, Michael Herrmann, Claudia Diaz. International Conference on Financial Cryptography and Data Security, Springer LNCS 9603, pp. 367-384, 2016. Engineering Privacy by Design Reloaded. Seda Gurses, Carmela Troncoso, Claudia Diaz. Amsterdam Privacy Conference (APC), 21p., 2015. The leaking battery: A privacy analysis of the HTML5 Battery Status API. Lukasz Olejnik, Gunes Acar, Claude Castelluccia, Claudia Diaz. International Workshop on Data Privacy Management, Springer LNCS 9481, 8p., 2015 Towards Measuring Resilience in Anonymous Communication Networks.  Fatemeh Shirazi, Claudia Diaz, and Joss Wright. Proceedings of the 14th ACM Workshop on Privacy in the Electronic Society (WPES 2015), ACM, pp. 95-99, 2015. Tor Experimentation Tools. Fatemeh Shirazi, Matthias Gohring, and Claudia Diaz. In Proceedings of IEEE Security and Privacy Workshops (SPW), International Workshop on Privacy Engineering (IWPE), IEEE, pp. 206 - 213, 2015. The Web never forgets: Persistent tracking mechanisms in the wild. Gunes Acar, Christian Eubank, Steven Englehardt, Marc Juarez, Arvind Narayanan, and Claudia Diaz. In ACM Conference on Computer and Communications Security (ACM CCS 2014), ACM, pp. 674-689, 2014. [Acceptance rate 19%, 114/585] A Critical Evaluation of Website Fingerprinting Attacks. Marc Juarez, Sadia Afroz, Gunes Acar, Claudia Diaz, and Rachel Greenstadt, In ACM Conference on Computer and Communications Security (ACM CCS 2014), ACM, pp. 263-274, 2014. [Acceptance rate 19%, 114/585] Censorship-Resistant and Privacy-Preserving Distributed Web Search. Michael Herrmann, Ren Zhang, Kai-Chun Ning, Claudia Diaz, and Bart Preneel, In 14th IEEE International Conference on Peer-to-Peer Computing (P2P 2014) IEEE, pp. 1-10, 2014. Practical Privacy-Preserving Location-Sharing Based Services with Aggregate Statistics. Michael Herrmann, Alfredo Rial, Claudia Diaz, and Bart Preneel. In Proceedings of the 7th ACM Conference on Security and Privacy in Wireless and Mobile Networks (WiSec 2014), ACM, 12 pages, 2014. Optimizing the design parameters of threshold pool mixes for anonymity and delay. David Rebollo-Monedero, Javier Parra-Arnau, Jordi Forne, and Claudia Diaz. In Computer Networks vol. 67, pp. 180-200, 2014. Spiny CACTOS: OSN users attitudes and perceptions towards cryptographic access control tools. Ero Balsa, Laura Brandimarte, Alessandro Acquisti, Claudia Diaz and Seda Gurses. In Proceedings of Workshop on Usable Security (USEC 2014), 10 pages, 2014. FPDetective: Dusting the web for fingerprinters. Gunes Acar, Marc Juarez, Nick Nikiforakis, Claudia Diaz, Seda Gurses, Frank Piessens, and Bart Preneel. To appear in Proceedings of the 20th ACM Conference on Computer and Communications Security (ACM CCS 2013), ACM, 12 pages, 2013. [Acceptance rate 19%, 105/530] Optimal Sporadic Location Privacy Preserving Systems in Presence of Bandwidth Constraints. Michael Herrmann, Carmela Troncoso, Claudia Diaz, and Bart Preneel. In Proceedings of the 12th ACM Workshop on Privacy in the Electronic Society (WPES 2013), ACM, 12 pages, 2013. [Acceptance rate (full papers) 19%, 20/103] Two tales of privacy in online social networks. Seda Gurses and Claudia Diaz. In IEEE Security & Privacy Magazine Vol. 11(3):29-37, Special Issue on Social Networks, May/June 2013. Hero or Villain: The Data Controller in Privacy Law and Technologies. Claudia Diaz, Omer Tene, and Seda Gürses. Ohio State Law Journal 74(6):923-964, 2013. On the Measurement of Privacy as an Attacker's Estimation Error. David Rebollo-Monedero, Javier Parra-Arnau, Claudia Diaz, and Jordi Forne. In International Journal of Information Security (IJIS), volume 12, number 2, pages 129-149, 2013. OB-PWS: Obfuscation-Based Privat",
  "content_length": 71447,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:24"
}