{
  "name": "Claudia Jiménez-Guarín",
  "homepage": "https://profesores.virtual.uniandes.edu.co/cjimenez/es/inicio",
  "status": "success",
  "content": "Claudia Lucía Jiménez Guarín Claudia Lucía Jiménez Guarín Profesor Asociado - Coordinadora Maestría en Ingeniería de Información MINE Grupo:: Research Group: COMIT-Comunicaciones y Tecnología de Información Contacto: Oficina: Office: ML 772 Correo: Email: Extensión: Extension: 2865 Información general Formación Currículo Docencia Investigación Publicaciones Sobre Big Data Analytics Sobre estilo y redacción Proyectos Actualmente soy Coordinadora del programa de Maestría en Ingeniería de Información – MINE, de la Escuela de Posgrado del Departamento de Ingeniería de Sistemas y Computación. Mi interés actual se centra en temas de análisis de Big Data, Pervasive Computing, sistemas de recomendación y ambientes activos. Los proyectos en curso se enfocan en la construcción de soluciones computacionales basadas en gestión de información altamente escalable  y semánticamente personalizable, para su utilización en aplicaciones sensibles al contexto, al ambiente, al dispositivo, al usuario y a la localización. En particular, me interesan las soluciones que permiten, a partir del análisis del contexto, ofrecer mejoras en la calidad de vida, comprensión del entorno y en la toma de decisiones. Soy experta en temas de ingeniería de información, Big Data, diseño de bases de datos, orientación por objetos, información multimedia, gestión de información semi-estructurada y no estructurada. He trabajado en temas de Grid Computing y Cloud Computing desde el punto de vista de la información. Además, participo en los cursos fundamentales de programación bajo el esquema académico CuPi2, construcción de soluciones sobre infraestructuras móviles y en cursos de sistemas transaccionales. ORCID ID Scopus Author Site Información de contacto: Carrera 1 Este N° 19A-40 of. ML 772 Universidad de los Andes 111711, Bogotá Colombia, South America Teléfono: (57.1) 339.49.49 ext 2865, 2860 (57.1) 332.43.26 Ph.D. en Informatique, Institut National Polytechnique de Grenoble, Francia D.E.A en informática, Institut National Polytechnique de Grenoble, Francia Ingeniero de Sistemas y Computación, Universidad de los Andes, Colombia Actualmente soy profesora asociada del Departamento y coordinadora de la Maestría en Ingeniería de Información, MINE. Soy miembro activo del Centro de Excelencia y Apropiación en Big Data y Data Analytics, CAOBA. Anteriormente fui Directora del Departamento, coordinadora del programa de Especialización en Construcción de Software – ECOS, coordinadora de laboratorios  y coordinadora de pregrado. He sido profesora de los siguientes programas académicos: Pregrado en Ingeniería de Sistemas y Computación Maestría en Ingeniería de Sistemas y Computación – MISIS Maestría en Ingeniería de Información – MINE Especialización en Sistemas de Información en las Organizaciones – ESIO Especialización en Construcción de Software – ECOS Especialización en Redes de Computadores – ESORED Especialización en Creación Multimedia Programa de Gestión Estratégica Informática – GEI Además he sido profesora en múltiples cursos de educación continuada abierta y corporativa, en temas de ingeniería de información. Dirijo con regularidad proyectos de grado, tesis de maestría y tesis doctorales. He sido jurado externo de tesis de maestría y de doctorado en varias universidades colombianas. Soy par evaluador del Ministerio de Educación Nacional y de Colciencias, en ámbitos de acreditación de programas de pregrado y maestrías y en evaluación de proyectos de investigación. Participo activamente en la evaluación de artículos sometidos a varios Journals de investigación arbitrados, registrados en bases de datos Scopus e ISI. He participado en proyectos de investigación y consultoría para instituciones públicas y privadas y he sido Co-chair, Chair de sesión y miembro de Comité de Programa en conferencias nacionales e internacionales. He sido conferencista invitada en múltiples eventos y artículos de divulgación relacionados con la Ingeniería de Información. Fui ingeniera de investigación en la Université Joseph Fourier de Grenoble, Francia y analista en la ETB. Adicionalmente tengo formación musical del Conservatorio Nacional. Enlace a CVLAC 2015 2015-10 CONSTR. APLICACIONES MÓVILES SISTEMAS DE RECOMEDACIÓN 2015-20 ANÁL DE INFORM SOBRE BIG DATA CONSTR. APLICACIONES MÓVILES ALGORITMICA Y PROGR. OBJ. I 2016 2016-10 ANÁL DE INFORM SOBRE BIG DATA CONSTR. APLICACIONES MÓVILES INFORMAC. ACTIVO DEL SIGLO XXI 2016-20 LAB. CONSTR. APLICAC. MOVILES INFORMAC. ACTIVO DEL SIGLO XXI ANALISIS INFORM SOBRE BIG DATA CONSTR. APLICACIONES MÓVILES 2017 2017-10 LAB. CONSTR. APLICAC. MOVILES CONSTR. APLICACIONES MÓVILES ANALISIS INFORM SOBRE BIG DATA SISTEMAS DE RECOMENDACIÓN SISTEMAS TRANSACCIONALES 2017-20 ANALISIS INFORM SOBRE BIG DATA SISTEMAS TRANSACCIONALES 2018 2018-10 PROYECTO FINAL SISTEMAS TRANSACCIONALES ANALISIS INFORM SOBRE BIG DATA 2018-18 KNOWLEDGE DISCOVERY FROM SOCIA 2018-20 PROYECTO FINAL SISTEMAS TRANSACCIONALES ANALISIS INFORM SOBRE BIG DATA 2019 2019-10 SISTEMAS TRANSACCIONALES PROYECTO FINAL ANALISIS INFORM SOBRE BIG DATA 2019-20 SISTEMAS TRANSACCIONALES ANALISIS INFORM SOBRE BIG DATA PROYECTO FINAL 2020 2020-10 SISTEMAS TRANSACCIONALES ANÁLISIS INFORM SOBRE BIG DATA 2020-20 PROYECTO FINAL SISTEMAS TRANSACCIONALES ANÁLISIS INFORM SOBRE BIG DATA 2021 2021-10 SISTEMAS TRANSACCIONALES PROYECTO FINAL ANÁLISIS INFORM SOBRE BIG DATA 2021-20 ANÁLISIS INFORM SOBRE BIG DATA SISTEMAS TRANSACCIONALES 2022 2022-10 SISTEMAS TRANSACCIONALES ANÁLISIS INFORM SOBRE BIG DATA PROYECTO FINAL PROYECTO DE GRADO 2022-15 DESPLIEGUE SLNES. ANALÍTICAS 2022-20 PROYECTO DE GRADO PROYECTO FINAL SISTEMAS TRANSACCIONALES ANÁLISIS INFORM SOBRE BIG DATA 2023 2023-10 SISTEMAS TRANSACCIONALES ANÁLISIS INFORM SOBRE BIG DATA PROYECTO FINAL Intereses y líneas de Investigación: Sistemas Pervasive y adaptación al contexto Big Data y Web 3.0 Computación móvil Grupo:: Research Group: COMIT-Comunicaciones y Tecnología de Información La información detallada de los proyectos de investigación a mi cargo la encuentra en la pestaña Proyectos. Filtrar Tipo de publicación: Todos los tipos Software Patente y Solicitud de Patente Otro Propuesta a Colciencias (o entidades afines) Evento Propuesta internacional de investigación Artículo Libro Capítulo de libro Capítulo en Memoria Caso de Estudio Otra Producción Bibliográfica Columna de Opinión Tesis A partir de: 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023 2024 2025 Filtrar Limpiar PensumConfig: Una aplicación web para la planeación y configuración de programas académicos Tesis 2022 .(2022). PensumConfig: Una aplicación web para la planeación y configuración de programas académicos.Trabajo Dirigido por: Claudia Jiménez-Guarín - 2022 Learning and Managing Context Enriched Behavior Patterns in Smart Homes Artículo 2019 Lago P, Roncancio C, Claudia Jiménez-Guarín. (2019) Learning and Managing Context Enriched Behavior Patterns in Smart Homes. Future Generation Computer Systems (ISSN 0167-739X) 91 (-), pp. 191-205. - 2019 ACTIVISM: Plataforma para el análisis de información sobre de flujos de texto en redes sociales Tesis 2019 Carvajal C .(2019). ACTIVISM: Plataforma para el análisis de información sobre de flujos de texto en redes sociales.Trabajo Dirigido por: Claudia Jiménez-Guarín - 2019 ALAs: Sistema de notificación inteligente de anomalías basado en patrones de comportamiento de actividades de la vida diaria Tesis 2019 Mojica A .(2019). ALAs: Sistema de notificación inteligente de anomalías basado en patrones de comportamiento de actividades de la vida diaria.Trabajo Dirigido por: Claudia Jiménez-Guarín - 2019 Learning and managing context enriched behavior patterns in smart homes Artículo 2019 Lago P, Roncancio C, Claudia Jiménez-Guarín. (2019) Learning and managing context enriched behavior patterns in smart homes. Future Generation Computer Systems (ISSN 0167-739X) 91 (-), pp. 191-205. - 2019 SEAbIRD: Adaptable Daily Living Activity Identification from Sensor Data Streams Artículo 2018 Molano J, Claudia Jiménez-Guarín. (2018) SEAbIRD: Adaptable Daily Living Activity Identification from Sensor Data Streams. Procedia Computer Science (ISSN 1877-0509) 130 (-), pp. 939-946. - 2018 BiDArch: BigData Architect, Generator of Big Data Solution Architectures Capítulo de libro 2017 Sosa J, Claudia Jiménez-Guarín. (2017) BiDArch: BigData Architect, Generator of Big Data Solution Architectures. Advances in Computing 12th Colombian Conference, CCC 2017, Cali, Colombia, September 19-22, 2017, Proceedings (ISBN 978-3-319-66562-7) pp. 17-31. Springer International Publishing - 2017 Content In-context: Automatic News Contextualization Capítulo de libro 2017 Restrepo C, Claudia Jiménez-Guarín. (2017) Content In-context: Automatic News Contextualization. Advances in Computing 12th Colombian Conference, CCC 2017, Cali, Colombia, September 19-22, 2017, Proceedings (ISBN 978-3-319-66562-7) pp. 184-198. Springer International Publishing - 2017 Contextualized behavior patterns for change reasoning in Ambient Assisted Living: A formal model Artículo 2017 Lago P, Claudia Jiménez-Guarín, Roncancio C. (2017) Contextualized behavior patterns for change reasoning in Ambient Assisted Living: A formal model. Expert Systems (ISSN 1468-0394) 34 (-), pp. --n/a. - 2017 Generador de arquitecturas de solución sobre el ecosistema Hadoop para problemas de Big Data Tesis 2017 Sosa J .(2017). Generador de arquitecturas de solución sobre el ecosistema Hadoop para problemas de Big Data.Trabajo Dirigido por: Claudia Jiménez-Guarín - 2017 Modeling and Learning Context Enriched Behavior Patterns in Ambient Assisted Living Tesis 2017 Lago P .(2017). Modeling and Learning Context Enriched Behavior Patterns in Ambient Assisted Living.Trabajo Dirigido por: Claudia Jiménez-Guarín - 2017 Rep",
  "content_length": 21351,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:29"
}