{
  "name": "Claudia Wagner 0001",
  "homepage": "http://claudiawagner.info",
  "status": "success",
  "content": "Claudia Wagner - Researcher Claudia Wagner Chair for Applied Computational Social Sciences at RWTH Aachen University Head of Computational Social Science Department at GESIS - Leibniz Institute for Social Sciences Twitter:@clauwa, Github:@clauwag Email: claudia dot wagner at gesis dot org About me I am a full professor (W3) for Applied Computational Social Sciences at RWTH Aachen, the Scientific Director of the department Computational Social Science at GESIS - Leibniz Institute for the Social Sciences and an external faculty member of the Complexity Science Hub Vienna. My research focuses on understanding how societies are impacted by online platforms and Artificial Intelligence. I am also passionate about methodological challenges that arise when using digital behavioral data to study individual behavior, attitudes and group dynamics. In the past I was organizing interdisciplinary training events for early career researchers (e.g. the CSS methods Summer School). I am a Board Member of the International Society for Computational Social Science, an associate editor of EPJ Data Science and a Steering Committee Member of the International AAAI Conference on Web and Social Media . Curriculum Vitae Download CV Publications You can find my publications on google scholar. Selected Papers (1) Position Papers: Claudia Wagner, Markus Strohmaier, Alexandra Olteanu, Emre Kıcıman, Noshir Contractor, Tina Eliassi-Rad; Measuring Algorithmically Infused Societies, Nature 595, 197–204, 2021. (pdf) David Lazer, Alex Pentland, Duncan J.Watts, Sinan Aral, Susan Athey, Noshir Contractor, Deen Freelon, Sandra Gonzalez-Bailon, Gary King, Helen Margetts, Alondra Nelson, Matthew Salganik, Markus Strohmaier, Alessandro Vespignan, and Claudia Wagner; Computational social science: Obstacles and opportunities, Science, 369 (6507), 1060-1062, 2019 (pdf) (2) Papers on methodological issues of digital behavioral data: Indira Sen, Fabian Flöck, Katrin Weller, Bernd Weiß, and Claudia Wagner. A Total Error Framework for Digital Traces of Human Behavior on Online Platforms. Public Opinion Quarterly 85 (S1): 399–422. 2021. (pdf) Indira Sen, Fabian Flöck and Claudia Wagner. On the Reliability and Validity of Detecting Approval of Political Actors in Tweets, in Proceedings of Empirical Methods in Natural Language Processing (EMNLP), Nov 2021. (pdf) Mattia Samory, Indira Sen, Julian Kohne, Fabian Flöck and Claudia Wagner. Call me sexist, but...: Revisiting Sexism Detection Using Psychological Scales and Adversarial Samples, in Proceedings of International Conference on Weblogs and Social Media (ICWSM), June 2021, Venice, Italy. (pdf) Claudia Wagner, Philipp Singer, Fariba Karimi, Jürgen Pfeffer and Markus Strohmaier. Sampling from Social Networks with Attributes, 26th International Word Wide Web Conference (WWW 2017), April 2017, Perth, Australia. (pdf) (3) Papers on inequalities, bias and harms: Lisette Espín-Noboa, Fariba Karimi, Bruno Ribeiro, Kristina Lerman and Claudia Wagner. Explaining classification performance and bias via network structure and sampling technique. Appl Netw Sci 6, 78 (2021). https://doi.org/10.1007/s41109-021-00394-3 Eirini Ntoutsi et al.Bias in data-driven artificial intelligence systems—An introductory survey, WIREs Data Mining and Knowledge Discovery, 2020. Claudia Wagner, David Garcia, Mohsen Jadidi and Markus Strohmaier. It's a Man's Wikipedia? Assessing Gender Inequality in an Online Encyclopedia, The International AAAI Conference on Web and Social Media (ICWSM2015), May 2015, Oxford, UK. (pdf) (Press) Aniko Hannak, Claudia Wagner, David Garcia, Alan Mislov, Markus Strohmaier and Christo Wilson. Bias in Online Freelance Marketplaces: Evidence from TaskRabbit and Fiverr, The 20th ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW2017), Feb 2017, Portland, Oregon, USA. (pdf) Mohsen Jadid, Fariba Karimi, Haiko Lietz and Claudia Wagner; Gender Disparities in Science? Dropout, Productivity, Collaborations and Success of Male and Female Computer Scientists, Advances in Complex Systems, 20(0), 2017 (pdf) Teaching Applied Computational Social Sciences, at RWTH Aachen University, WS 2021/22, WS 2022/23, WS 2023/24 Seminar Current Topics in Computational Social Sciences, at RWTH Aachen University, SS 2020/21, SS 2022/23, SS 2023/24 Data Science, at the University of Koblenz, WS 2018/19 (slides) Data Science Seminar: Storytelling with Data, at the University of Koblenz, WS 2016/17 (slides) Introduction to Data Science, at 6th ESWC Summer School, September 2016, Dubrovnik, Croatia. Tutorial on Computational Social Science, at the WebScience Summer School, July 2016, Koblenz, Germany. Computational Social Science for the World Wide Web, Tutorial at WWW 2016, April 2016, Montreal, Canada. Data Science at the University of Koblenz, SS 2016, SS 2017 (slides) Computational Social Science at the University of Koblenz, SS 2014/15, SS 2016, SS 2017, SS 2018 (slides) Selected Talks Leibniz Lecture on Measuring social phenomena with digital behavioral data (online) March 2022. Keynote at the Conference on Complex Systems (CCS) in Singapore, October 2019. Keynote at the 2nd Conference on Digital Societies in Konstanz, September 2019. Keynote at the Fifth International Conference on Computational Social Science (IC2S2) in Amsterdam, July 2019. Video can be watched here. Keynote at the first Knowledge Base Construction Conference (AKBC) at University of Massachusetts Amherst, USA, May 2019. Video can be watched here. Inequalities in Social Networks and Socio-technical Systems, Keynote at the Fifth International Conference on Social Networks Analysis, Management and Security (SNAMS) in Valencia, October 2018. Inequalities in Science, Data Science Summit 2018 in Passau, October 2018. Inequality in Social Networks, 5th European Conference on Data Analysis in Paderborn, July 2018. Inequality in Social Networks, Netsci 2018 in Paris, June 2018. PhD Students: Zehui Yu, Dehumanization Measurements, Exposure and Effects, 2021 - present. Lukas Birkenmaier, Validation Approaches for Text as Data , 2021 - present. Leon Fröhling, Measuring and Improving Quality of Digital Behavioral Data Collections, 2021 - present. Antonio Ferrara, Bias in Algorithmic Rankings, 2020 - present. Indira Sen, On the Quality of Digital-Behavioral-Data-based Measurements in the Social Sciences, 2018 - present. Mohsen Jadidi, Inequality and success in social systems, 2015 - present. Lisette Espin Noboa, Explaining links and attributes in networks, 2015 - present. Olga Zagovora, Altmetrics: Alternative impact measures for scientific work, 2017 - present. Dimitar Dimitrov, Modelling navigation in information networks, completed 2018.",
  "content_length": 6737,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:30"
}