{
  "name": "Claudia Szabo",
  "homepage": "http://www.adelaide.edu.au/directory/claudia.szabo",
  "status": "success",
  "content": "Staff Directory | A/Prof Claudia Szabo × Search University staff directory Login A/Prof Claudia Szabo Position Associate Prof/Reader Org Unit Computer Science Email claudia.szabo@adelaide.edu.au Telephone 831 36744 Location Floor/Room 4 , Ingkarni Wardli , North Terrace View My Researcher Profile Biography/ Background Associate Professor, School of Computer and Mathematical Sciences, The University of Adelaide Awards & Achievements 2025 - AAUT Teaching Excellence Award 2024 - University of Adelaide Excellence Award for A Connected and Enriched Community 2024 - SET Service Excellence Award 2021 - ECMS Faculty Excellence Teaching Award 2018 - Stephen Cole the Elder Award for Teaching Excellence, The University of Adelaide 2018 - Women's Research Excellence Award, The University of Adelaide 2017 - SA Science Excellence Awards STEM Educator of the Year (tertiary education) 2015 - Office for Learning and Teaching Citation for Outstanding Contributions to Student Learning 2014 - The University of Adelaide Commendation for Excellence in Support of the Student Experience 2014 - Visiting Fellowship, School of Computer Science, National University of Singapore 2014 - CORE Award for Outstanding Contributions to Teaching 2013 - ECMS Faculty Award for Excellence in Teaching 2013 - Visiting Fellowship, School of Computer Science, National University of Singapore 2012 - Visiting Fellowship, School of Computer Science, National University of Singapore 2012 - Learning & Teaching Award, Rising Star in 2011, School of Computer Science, The University of Adelaide 2011 - Visiting Fellowship, School of Computer Science, National University of Singapore Research Interests My main research interests lie in the area of artificial intelligence for distributed decision making in complex adaptive systems. I am interested in model driven engineering, distributed and cloud computing, verification and validation of distributed systems, and exploring issues in real, deployed, complex systems. I lead the Complex Systems program within the Centre for Distributed and Intelligent Technologies. My education research interests lie in the areas of curriculum design, cognitive load theories, and software engineering best practices. Centre for Distributed and Intelligent Technologies My discipline research is in the area of systems, where I am interested in modeling and understanding the performance and behavior of large-scale distributed and complex systems. I lead the Complex Systems Program in the Centre for Distributed and Intelligent Technologies. If you are interested in a PhD or a Masters by research project, please visit the relevant websites for ideas about projects or proposals. Computer Science Education Research My education reserach interests include understanding and improving student programming strategies, identifying at-risk students, improving the teaching of software engineering, and designing computer science curricula that is engaging and actual. Research Funding Selected grants and research contracts can be found here. Publications University Research Profile or dblp. Files NextGen-Code - nextgen-code.zip [1.1MB] (application/zip) The information in this directory is provided to support the academic, administrative and business activities of the University of Adelaide. To facilitate these activities, entries in the University Phone Directory are not limited to University employees. The use of information provided here for any other purpose, including the sending of unsolicited commercial material via email or any other electronic format, is strictly prohibited. The University reserves the right to recover all costs incurred in the event of breach of this policy. Entry last updated: Tuesday, 26 Aug 2025 To link to this page, please use the following URL: https://www.adelaide.edu.au/directory/claudia.szabo",
  "content_length": 3856,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:32"
}