{
  "name": "Clemens H. Cap",
  "homepage": "https://iuk.uni-rostock.de/mitarbeiter/prof-dr-rernat-clemens-h-cap",
  "status": "success",
  "content": "Prof. Dr. rer.nat. Clemens H. Cap - IuK - Universität Rostock Zum Hauptinhalt Zum Footer Anmelden Für Studierende Themen für studentische Abschlussarbeiten Mitarbeiter Johann BauerClemens CapThomas Mundt Suche Absenden Informatik IuKMitarbeiter Prof. Dr. rer. nat. Clemens H. Cap WebsitesMy Google Scholar ProfileMy Research Gate Profile My DBLP PageMy XING ProfileMy Professional Twitter Account (used for communication with my students)Full professor (with tenure) and Chair for Information and Communication Services, University of Rostock, Germany.Curriculum Vitae1965 Born in Innsbruck, Austria1982 – 1988 Studies of Mathematics, Computer Science and Physics, University of Innsbruck, Austria1984 – 1987 Positions as teaching and research assistant, University of Innsbruck, Austria1986Mag. rer. nat. (Masters, ie. Diplom) in Applied Mathematics1988 Dr. rer. nat. (PhD) in Applied Mathematics1989 Honorary conferral of the doctoral degree \"sub auspiciis praesidentis\" by the Austrian president for excellency during university studies1990 Postdoc, University of Zurich, Switzerland1992 Assistant Professor for Formal Methods in Computer Science, University of Zurich1994 Temporary position as Associate Professor, University of Mannheim1995 Habilitation (venia legendi, lecturership) in Computer Science, University of Zurich, Switzerland1997 Full Professor (with tenure), Heinz Nixdorf Chair for Information and Communication Services, University of Rostock2004 Titularprofessur (Adjunct Professor) University of Zurich, Switzerland, aufrecht bis Juni 2023LebenslaufClemens Cap wurde 1965 in Innsbruck, Österreich geboren. Nach einem Studium der Mathematik, Informatik und Physik an der Universität Innsbruck erwarb er 1988 das Doktorat in Mathematik. Nach einer Zeit als Postdoc und Assistenzprofessor an der Universität Zürich habilitierte er sich 1995 in Informatik. Seit 1997 ist er Professor für Informations- und Kommunikationssysteme an der Universität Rostock. Seine Forschungsinteressen umfassen verteilte Systeme, Systemsicherheit, Internet-Anwendungen und soziale Probleme der Informatik. Er hat eine Reihe von Forschungsprojekten unter Förderung der DFG, des BMBF und der EU durchgeführt. Er hält regelmäßig Gastvorlesungen im Baltikum und in der Schweiz.ResearchClemens Cap leads the group for Information and Communication services at the University of Rostock.  His research interests encompass system architecture for distributed and ubiquitous applications, Internet applications and services, system security and applications of formal specification techniques. He has conducted a number of research projects with national, international and industrial funding including DFG and BMBF and has participated in the European Fifth Framework Research Program.TeachingThe teaching portfolio of Clemens Cap presently consists ofComputer Networking (Entry level course)Data Security (Entry level course)Architecture, specification and implementation of network and communication services (Intermediate course)Methodology of Scientific Research (Intermediate course)Software Development ProjectDistributed Systems (Advanced course)Research Topics in Internet Technology: Web 2.0, Ajax (Advanced course)Computer Science and Society (Intermediate course)Social Impact of IT (Advanced course)Research Seminar in Information- and Communication ServicesVarious advanced courses on research topicsThe corresponding modules are part of various study courses at the University of Rostock and are offered as part of summer schools and international cooperations (BaSoTI) and the adjunct professorship of Clemens Cap at the University of Zurich. The modules and seminars are available for continuous education programs and inhouse seminars for companies as well. Teaching languages are German and English.PublicationsList of PublicationsAdministrationProf. Cap is active in the following fields of academic self-administration:Member of the board of the interdisciplinary research department \"Wissen - Kultur - Transformation\"Head of the IuK Science ConfederationMember of various on demand committees Nach oben",
  "content_length": 4116,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:41"
}