{
  "name": "Clemens Heitzinger",
  "homepage": "http://www.heitzinger.info",
  "status": "success",
  "content": "Clemens Heitzinger's Homepage News Curriculum Vitae Book Reinforcement Learning Book Algorithms with Julia CAIML Research START Project Publications: Journals Publications: Conferences Invited Presentations Teaching Welcome toClemens Heitzinger'shomepage! 1 AI Health Vienna 2025 (13–14 November 2025) AI Health Vienna 2025 gathered experts from medicine, AI research, law, industry, and policy to explore how artificial intelligence is transforming healthcare. AI Health Vienna 2025 was organized by (in alphabetical order) myself (TU Wien), Oliver Kimberger (MU Wien), Maria Kletecka-Pulker (Universität Wien), Georg Langs (MU Wien), and Georg Wildhalm (MU Wien). The first day centered on the balance between innovation and regulation, with sessions addressing the ethics of medical AI, digital therapeutics, and start-up ecosystems, as well as the structural challenges of implementing innovations in healthcare. The day ended with a panel debating whether current legal frameworks sufficiently support AI driven innovation. The second day highlighted concrete clinical applications of AI, featuring talks on imaging, dermatology, emergency medicine, and ophthalmology. Keynotes examined the strategic role of digitalization in healthcare (by Markus Müller, Rector, MU Wien) and the neurobiology of artificial intelligence (by Peter Robin Hiesinger, FU Berlin). A final panel discussion reflected on how humans, machines, and medicine will jointly shape the coming era of AI enabled care. 1.1 Panel on Day 1 (13 November 2025) Topic: Are the legal regulations for the use of AI in healthcare sufficient, or are there already too many for innovation? Moderator: Bianca Schwarzjirg (moderator) Panelists in alphabetical order: Gerhard Aigner (Institute for Ethics and Law in Medicine, Universität Wien) Markus Egger (CODE Consulting, CODE Magazine, and reTECH Europe) Birgit Hofreiter (Innovation Incubation Center, TU Wien) Tanja Spennlingwimmer (Austria Wirtschaftsservice (AWS)) Gerhard Zotter (Federal Procurement Agency (Bundesbeschaffung GmbH)) 1.2 Panel on Day 2 (14 November 2025) Topic: Human, Machine, Medicine – Entering the Age of AI Moderator: Isabelle Daniel (journalist) Panelists in alphabetical order: Gernot Blümel (Mare TechnoPark) Eva Dichand (Chair of the University Council, MU Wien) Markus Egger (CODE Consulting, CODE Magazine, and reTECH Europe) Harald Kittler (dermatology, MU Wien) Siegfried Meryn (Future Health Lab) 1.3 The Program 2 Dreiländertreffen Herzinsuffizienz (12–14 October 2025) I will give a talk at the Dreiländertreffen Herzinsuffizienz, organized by the Austrian Society for Cardiology, in Salzburg. 3 Keynote at the International Conference on Complex Acute Illness (20 September 2025) The International Conference on Complex Acute Illness (ICCAI 2025), organized by the Society for Complex Acute Illness (SCAI), took place from 18 till 20 September 2025 at the Medical University of Vienna. I was honored to give a keynote on “Optimal Treatment Policies and their Evaluation” and talked how reinforcement learning can be used to make use of data collected in intensive-care units. 4 Report on AI Health Vienna 2024 (16 January 2025) Our department published a summary of AI Health Vienna 2024 here. 5 AI Health Vienna 2024 (25–26 November 2024) AI Health Vienna 2024, held on 25–26 November at the Van Swieten Hall of the Medical University of Vienna, gathered approximately 300 participants to discuss the transformative impact of artificial intelligence in healthcare. The event featured keynote speeches and sessions covering topics such as secondary data use, lifestyle and medical apps, challenges in AI integration, and the European Health Data Space. Prominent speakers included Julian Hadschieff, Meinhild Hausreither, Philipp Kellmeyer, Georg Langs, Klaus Marksteller, Bruno K. Podesser, Matthias Samwald, and Karl Stöger (in alphabetical order), who provided insights into AI’s applications, ethical considerations, and regulatory frameworks in the medical field. The conference served as a platform for interdisciplinary dialogue, highlighting the potential of AI to revolutionize healthcare delivery and patient outcomes. AI Health Vienna is organized by Oliver Kimberger, Maria Kletečka-Pulker, and myself. 6 Books on Digital Humanism Accessed More Than One Million Times (18 November 2024) A great success for the Austrian digital-humanism community: the two books Introduction to Digital Humanism (for which I co-authored a chapter) and Perspectives on Digital Humanism have been accessed over one million times in total. You can find more information in this article. 7 ORF Upper Austria Reports on AI in Hospitals (23 October 2024) On 23 Oct 2024, ORF Upper Austria reported in its program Bundesland heute (at minute 14:58) on a congress about AI in hospitals that took place at the Design Center in Linz on the same day. The 22nd Congress of the Upper Austrian Hospitals Affiliated with Religious Orders (22. internationaler Kongress der oö. Ordensspitäler) was opened by Mother Superior (Generaloberin) Sr. M. Barbara Lehner (Elisabethinen Linz–Wien), Episcopal Vicar (Bischofsvikar) Dr. Adi Trawöger, and Deputy Governor (Landeshauptmann-Stellvertreterin) Mag. Christine Haberlander. The location was packed with more than 500 participants (excluding online participants), showing the great interest of health-care practitioners in AI topics. The program included a presentation by myself about current applications of machine learning in oncology and intensive-care medicine. 8 Euronews Video Segment (4 October 2024) On a recent Euronews Witness broadcast (and article) by Julian Gomez, my work on AI solutions, for example for optimizing intensive care units, was highlighted at minute 6:34. In the segment, I discuss the role of recent developments in artificial intelligence, emphasizing how modern AI systems, with their generative capabilities, are now more integrated into everyday technologies like phones and computers. I stress the importance of ensuring these systems function reliably to solve the problems they are designed for. Throughout history, humanity has continually developed tools to make life easier, and AI represents the next frontier in that tradition – especially when applied to safety critical settings. 9 Expert Panel on Digital Future Projects for the Job Market of the Public Employment Service (AMS) Austria (3 September 2024) I am pleased to serve on the expert panel advising the Public Employment Service (AMS) in Austria on digital future projects for the job market. The first meeting of the panel took place on 3 September, where we discussed key strategies and innovative approaches to address the evolving demands of the labor market in a digital age. I look forward to contributing to the panel’s important work in shaping the future of employment in Austria. 10 Article in ORF Topos (30 July 2024) ORF (Austrian Broadcasting Corporation) Topos published the article Eigene Daten als „Achillesferse“ der KI (Own Data as the “Achilles Heel” of AI) by Mona Harfmann including comments by my colleagues Ivona Brandic and Radu Grosu at the Department for Informatics (Computer Science), TU Wien, and myself. The article also includes an excellent introductory video about large language models such as ChatGPT. 11 Department of Informatics Homepage Features our Reinforcement Learning Work in the RELY Research Project (27 June 2024) The Department of Informatics (Computer Science) at TU Wien published an article about our FFG research project RELY. We develop and test reinforcement-learning algorithms for the optimal control of pump turbines. Pump turbines are crucial parts of our power grid, since they generate electricity (to meet energy demands) or store energy (when there is an oversupply). They also play a role in regulating the power grid. Reinforcement learning makes it possible to shape the landscape of future energy systems, making them more efficient and resilient while transitioning to renewable energies. 12 TU Wien Homepage Features our Reinforcement Learning Work on Cryogenic Sensors (19 June 2024) Felix Wagner, one of my MSc students, did a great job in developing a reinforcement-learning system to control cryogenic sensors in the search for dark matter. The system is in use at the CRESST experiment in the Gran Sasso deep underground laboratory in Italy. TU Wien published the article The World’s Most Sensitive Experiment is Controled by AI on the university home page. 13 Panel Discussion at Vienna Arbitration Days (7 June 2024) The Vienna Arbitration Days 2024 are Austria’s leading arbitration conference and bring together the international dispute resolution community. This year, they took place from 7 to 8 June 2024 at the beautiful Palais Niederösterreich in the center of Vienna. In the panel discussion Out of the Dark – into the Digital World, I was happy to discuss the impact of artificial intelligence and large language models in particular on law and arbitration. Monica Crespo, Jus Mundi, Paris Clemens Heitzinger, Technical University of Vienna, Vienna Christian Koller, University of Vienna, Vienna Anna Kozmenko, Curtis, Geneva Takashi Takashima, UNCITRAL, Vienna (Moderation) 14 Paper at ICRA 2024 (13 May 2024) The video accompanying our paper Adapting to the “Open World”: the Utility of Hybrid Hierarchical Reinforcement Learning and Symbolic Planning at the 2024 IEEE International Conference on Robotics and Automation (ICRA 2024) is available now. It is also available here. Adapting to the “Open World”: the Utility of Hybrid Hierarchical Reinforcement Learning and Symbolic Planning 15 Article in Kronen-Zeitung about AI and Oncology (11 May 2024) On 11 May 2024, Kronen-Zeitung, Austria’s largest newspaper, published an article by Eva Greil-Schähs about oncology and the use of artificial intelligence to help patients. The article includes comments by the president of the Austrian Society for Hematology and Medical Oncolog",
  "content_length": 39621,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:41"
}