{
  "name": "Clement H. C. Leung",
  "homepage": "https://sse.cuhk.edu.cn/en/faculty/clementleung",
  "status": "success",
  "content": "LEUNG, Clement | School of Science and Engineering Search Search SEARCH CUHK-Shenzhen ç®ä½ä¸­æ About the School Introduction of SSE Deanâs message Annual Undergraduate Prospectus School Video Contact us News SSE News SSE Newsletter Interviews with SSE Faculty Members Announcement Programmes Undergraduate Programmes Mathematics and Applied Mathematics Physics Chemistry Materials Science and Engineering New Energy Science and Engineering Electrical and Computer Engineering Financial Engineering(offered jointly with the SME and the SDS) CUHK Special Exchange Programme Double Major Programmes Columbia University 3+2 Initiative (Columbia Class) Long Feng Class Bachelor-Master Scheme Bachelor-PhD Class Q&A on Registry Matters Master of Science Programmes Master of Science in Communications Engineering Master of Science in Computer and Information Engineering Master of Science in Integrated Circuits and Systems Master of Science in Financial Mathematics Master of Science in Artificial Intelligence for Science Master of Science in Artificial Intelligence and Robotics Executive Master of Science in Supply Chain and Logistics Management (Part-time master programme) Research Postgraduate Programmes Mathematics Physics Chemistry Materials Science and Engineering Energy Science and Engineering Computer and Information Engineering Biomedical Engineering Faculty Academic Staff Research Fellow Academic Research Research Field Laboratories Research News Academic Activities Long Feng Science Forum SSE Upcoming Events SSE Events Review Materials Characterization and Preparation Center Students Studentsâ Activities Studentsâ Achievements Student Sharing Student Associations Maker Lab About us Tools & Equipment Project Ideas Career About us Career Handbook International Co Exchange & Visiting Programs Collaborative Degree Program Further Education and Employment Latest News Industrial Talks Employment Workshop Further Study Workshop Counselling Alumni Cooperation Recruitments About the School Introduction of SSE Deanâs message Annual Undergraduate Prospectus School Video Contact us News SSE News SSE Newsletter Interviews with SSE Faculty Members Announcement Programmes Undergraduate Programmes Mathematics and Applied Mathematics Physics Chemistry Materials Science and Engineering New Energy Science and Engineering Electrical and Computer Engineering Financial Engineering(offered jointly with the SME and the SDS) CUHK Special Exchange Programme Double Major Programmes Columbia University 3+2 Initiative (Columbia Class) Long Feng Class Bachelor-Master Scheme Bachelor-PhD Class Q&A on Registry Matters Master of Science Programmes Master of Science in Communications Engineering Master of Science in Computer and Information Engineering Master of Science in Integrated Circuits and Systems Master of Science in Financial Mathematics Master of Science in Artificial Intelligence for Science Master of Science in Artificial Intelligence and Robotics Executive Master of Science in Supply Chain and Logistics Management (Part-time master programme) Research Postgraduate Programmes Mathematics Physics Chemistry Materials Science and Engineering Energy Science and Engineering Computer and Information Engineering Biomedical Engineering Faculty Academic Staff Research Fellow Academic Research Research Field Laboratories Research News Academic Activities Long Feng Science Forum SSE Upcoming Events SSE Events Review Materials Characterization and Preparation Center Students Studentsâ Activities Studentsâ Achievements Student Sharing Student Associations Maker Lab About us Tools & Equipment Project Ideas Career About us Career Handbook International Co Exchange & Visiting Programs Collaborative Degree Program Further Education and Employment Latest News Industrial Talks Employment Workshop Further Study Workshop Counselling Alumni Cooperation Recruitments CUHK-Shenzhen ç®ä½ä¸­æ LEUNG, Clement Professor FBCS, FRSA Education Background PhD (University College London)Master (Oxford University)Bachelor (McGill University) Research Field Self-learning media search engines, bandit problems in reinforcement learning, performance of multiple sequential classifiers Academic Area Computer Engineering, Artificial Intelligence and Robotics, Mathematics and Applied Mathematics Personal Website (CUHK-Shenzhen) https://myweb.cuhk.edu.cn/clementleung Email clementleung@cuhk.edu.cn Biography Clement Leung obtained his BSc (Hons) in Mathematics from McGill University, Canada, his MSc in Mathematics from Oxford University, and his PhD in Computer Science from University College London. He has held several academic appointments in Europe, including an Established Chair and Head of Department at the University of London. His Australasian academic appointments include the Foundation Chair in Computer Science at Australiaâs Victoria University, as well as full professorships at the National University of Singapore and Hong Kong Baptist University. He holds two US patents, and his publications include five books and over 150 research articles. His services to the research community include serving as Program Chair, Program Co-Chair, Keynote Speaker, Panel Expert, and on the Program Committee and Steering Committee of major International Conferences. In addition to contributing to the editorship of ten international journals, he has served as Chairman of the International Association for Pattern Recognition Technical Committee on Multimedia and Visual Information Systems, as well as well as on the International Standards (ISO) MPEG-7 Committee responsible for generating standards for digital multimedia, where he played an active role in shaping the influential MPEG-7 International Standard. He is listed in Who's Who in the World, Great Minds of the 21st Century, Who's Who in Australia, Dictionary of International Biography, and Who's Who in Australasia & Pacific Nations. He is a Fellow of the British Computer Society, a Fellow of the Royal Society of Arts, Manufactures and Commerce, and a Chartered Engineer. Academic Publications Five books and well over 150 research articles.Among the publications outlets are:  IEEE Transactions on Pattern Analysis and Machine Intelligence, ACM Transactions on Interactive Intelligent Systems, IEEE Transactions on Knowledge and Data Engineering, ACM Journal of Multimedia, IEEE Transactions on Communications, The Computer Journal, ACM Transactions on Intelligent Systems and Technology, Journal of Visual Communication and Image Representation, IEEE Transactions on Software Engineering, Journal of Database Technology, Information Processing Letters, Acta Informatica, IEEE  Transactions on Affective Computing, Computer Networks and ISDN Systems, Journal of Computer Systems Science and Engineering, Journal of Information Science, and IEEE Multimedia. Follow us Get In Touch Campus Map Contact Us Join us Explore More Admissions Office Registry Office Office of Academic Links Research Administration Office Library Media School News Copyright Â© CUHK-Shenzhen All Rights Reserved.",
  "content_length": 7093,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:40"
}