{
  "name": "Cliff C. Zou",
  "homepage": "http://www.cs.ucf.edu/~czou",
  "status": "success",
  "content": "Homepage of Cliff Zou (Changchun Zou) Home Research Personal  activity Cliff C. Zou  (Changchun Zou) Professor Program Coordinator of Master Degree in Digital Forensics Program Coordinator of Master Degree in Cyber Security and Privacy Member, UCF Cybersecurity and Privacy Cluster Point-of-Contact for UCF CAE-CD and CAE-R designation Data Systems Group Department of Computer Science University of Central Florida 4328 Scorpius St, Orlando, FL 32816-2362 Email: changchun.zou@ucf.edu Tel: 407-823-5015 Certification: CompTIA Casp+ (2024-2027) Curricula Vitae Fall 2025 Office Hours: every Tuesday/Thursday 12pm - 1:30pm, join office hour Zoom meeting: https://ucf.zoom.us/j/4074302761, or call my office phone (407-823-5015) Research Interests Computer and network security Computer networking Network modeling and performance evaluation Education Ph.D (2005)  Dept. Electrical & Computer Engineering, Univ. Massachusetts, Amherst M.S  (1999)  Dept. of Automation, University of Science & Technology of China (USTC) B.S  (1996)  Dept. of Automation, University of Science & Technology of China (USTC) News Nov. 2025: Our paper in IEEE IEMCON conference got the Best Paper Award in the track of Cybersecurity and Blockchain for ICT Systems. Jun. 2025: Our paper published in Journal of Applied Sciences in 2023 got the Best Paper Award. May 2025: I was interviewed to comment on credit card security and card fraud by WalletHub.com (story). April 2024: I was awarded with UCF Teaching Incentive Program (TIP) award. Feb.2024: UCF Master's degree in Digital Forensics (online) program is ranked by U.S. News as \"No. 23 for best online graduate computer information technology programs\". (CECS News) Aug. 2023: I was awarded with the NSF educational grant to develop advanced teaching modules on memory corruption attack and defense for the latest Windows systems (DGE-2325452, $70,000, in collaboration with Dr. Xinwen Fu from UML). Dec. 21st, 2022: I was interviewed by cybersecurity guide. The podcast of this interview is here. Nov. 22nd, 2022: I was interviewed by reporter Michelle Meredith from WESH 2 News on online shopping safety (WESH news story). Oct. 2022: I got promoted to Full Professor. Feb. 2021: UCF was awarded with NSF Scholarship-For-Service (SFS) grant (DGE-2042996) of $2,885,353 for the next five years (reported in UCF Today). July 2019: Dr. Xinwen Fu, Yan Solihin and I have been awarded with an NSF education grant on building low-cost IoT Security Hands-on Laboratory (DGE-1915780). July. 2019: Thanks to my former student Jim Bardgett's persistent effort, our 2016 filed patent \"System and Method for Routing Network Frames Between Virtual Machines\" (US 10,341,263) finally got granted. Aug. 2017: Dr. Yier Jin from UF and I have been awarded with an NSF education grant on online digital forensics courses/labs (DGE-1723587). Under this funding support, we constuct a FREE educational website (http://cyberforensic.net/) on courses and labs for cybersecurity and digital forensics. Nov. 2013: I was interviewed by Local 6 News about hacked baby monitor and how to defend against it (aired news). May  2013: I received UCF Teaching Incentive Program (UCF-TIP) Award. May  2012: Baber Aslam is my second PhD graduated and becomes an Assistant Professor at National University of Sciences and Technology, Pakistan. Congratulation! Jun. 2011: I got my tenure and was promoted to Associate Professor. Dec. 2010: Ping Wang is the first PhD in my group graduated and will work in Symantec Inc. in Lake Mary, FL. Congratulation! Mar. 2010: Undergraduate research project \"Personal Medication Monitor\" won the first price in the first annual UCF Inventing Entrepreneurs Innovation Competition (UCF News). Mar. 2010: The Register and EurekAlert! News Service reported our honeypot detection research, respectively. Mar. 2010: I provided comments about botnet attack on WDBO-AM Radio news broadcasted on 03/02/2010. Here is the audio. Sep. 2009: My Internship research work in AT&T finally got US Patent 7587761. Oct. 2009: Paper in Milcom'09 was reported by conference preview article published in IEEE communication magazine, October 2009, page 22. May  2008: The SMM rootkit work (paper published in Securecomm'08) was reported by PCWorld (05/09/2008). Dec. 2007: Best Student Paper Award in conference ACSAC 2007. Mar. 2006: The research work in conference NDSS'06 paper \"Modeling Botnet Propagation Using Time Zones\" was reported by the New Scientist Magazine, Mar. 4, 2006 189(2541), pg. 32. Teaching CIS 6395: Incident Response Technologies (Fall 2016, Fall 2017, Fall 2018, Fall 2019, Fall 2020, Fall 2021, Fall 2022, Fall 2023, Fall 2024, Fall 2025) CNT 5410L: Cyber Operation Lab (Spring 2016, Spring 2017, Spring 2018, Spring 2019, Spring 2020, Spring 2021, Spring 2022, Spring 2023, Spring 2024, Spring 2025 ) CAP 6135: Malware and Software Vulnerability Analysis (Spring 2009, Spring 2010, Spring 2011, Spring 2012, Spring 2013, Spring 2014, Spring 2015, Spring 2016, Spring 2017, Spring 2018, Spring 2019, Spring 2020, Spring 2021, Spring 2022, Spring 2023, Spring 2024, Spring 2025) CDA 6530: Performance Models of Computers and Networks (Fall 2010, Fall 2011, Fall 2012, Fall 2013, Fall 2014, Fall 2015) CNT 4704: Analysis of Computer Communication Networks (Fall 2005, Fall 2006, Fall 2007, Fall 2008, Fall 2009, Fall 2010, Fall 2011, Fall 2012, Fall 2013, Fall 2014, Fall 2015) COT 5405: Design and Analysis of Algorithms (Spring 2015) CNT 3004: Computer Network Concept (Spring 2011, Summer 2012) CIS 3360: Security in Computing (Spring 2012) CDA 5530: Performance Models of Computers and Networks (Fall 2008, Fall 2009) CAP 6133: Advanced Topics in Computer Security and Forensics (Spring, 2008) CDA 6938: Special topic - Research in Computer and Network Security (Spring 2006, Spring 2007) Funding Department of Defense: \"University of Central Florida DoD Cyber Service Academy Recruitment Scholarship\", $80,681, 8/15/2025 - 8/14/2026. (PI: Cliff Zou, 34% share, Co-PIs: Yao Li, Sean Mondesire) NSF DGE-2325452: Collaborative Research: SaTC: EDU: Creating Windows Advanced Memory Corruption Attack and Defense Teaching Modules ($70,000, PI, 100% share, 10/01/2023 to 09/30/2026, in collaboration with Dr. Xinwen Fu from UML) Millenium Cooperation, Incremental Fund. $100,910 (PI: Sean Mondesire, co-PI: Cliff Zou, 5/31/2022 to 05/01/2023) NSF DGE-2042996 supplemental fund ($563,697, PI, 38% share, 2/15/2022 to 1/31/2026) Millennium Cooperation: \"Threat Systems Management Office (TSMO) Threat Cyberspace Operations Team (TCOT)\" ($76,702, Co-PI, my share $38,351, 02/02/21 to 08/02/23) NSF DGE-2042996: \"CyberCorps Scholarship for Service: Workforce Training and Preparation in Cybersecurity and Privacy\" ($2,885,353, PI, 38% share,02/2021 - 01/2026) US Army PEO STRI: \"Supporting the Development of the PCTE\" ($763,911, Co-PI, 10% share, 09/2019 to 09/2020) NSF DGE-1915780: \"SaTC: EDU: Collaborative: Building a Low-cost and State-of-the-art IoT Security Hands-on Laboratory\", ($340,175, PI, 20% share, 10/2019-09/2022) US Army PEO STRI: \"Enhancing the Persistent Cyber Training Environment\" ($744,733, Co-PI, 10% share, 09/2018 to 09/2019 ) REU supplement for NSF DGE-1723587 ($16,000, Co-PI, 50% share, 09/2018 ~ 08/2019) NSF DGE-1723587: \"SaTC: EDU: Online Digital Forensics Courses and Labs for Students and Professionals\", ($298,955,  Co-PI, 50% share, 09/2017 ~ 08/2019) Florida Center for Cybersecurity (FC2) seed grant: \"Renewal: Smart Grid Security Protection through Cross Layer Approaches\" (co-PI, my share: $15,000, 03/2016-05/2017) Florida Center for Cybersecurity (FC2) seed grant: \"Smart Grid Security Protection through Cross Layer Approaches\" (co-PI, my share: $16,666, 03/2015-05/2016) NSF REU supplement for CNS-0627318 ($16,000, 09/2009-08/2010). NSF Cyber Trust CNS-0627318: \"Collaborative Research: CT-ISG: Modeling and Measuring Botnets\" (PI, 100% share, 2006-2009, $175,000, in collaboration with Dr. Wenke Lee from Georgia Tech). Intel Research Fund on vulnerability analysis and hardware validation (PI, 100% share, 08/2007-08/2010, $53,465). UCF in-house grant (PI, 100% share, 05/2006-04/2007, $7,500). Publications (Google Scholar Citation) Book Chapter Zhen Ling, Yiling Xu, Yier Jin, Cliff Zou and Xinwen Fu, New Variants of Mirai and Analysis, In: Shen X., Lin X., Zhang K. (eds) Encyclopedia of Wireless Networks, Springer, First Online: 10 April 2020, DOI: https://doi.org/10.1007/978-3-319-32903-1_174-1. Baber Aslam, Ping Wang, Cliff C. Zou, \"An Economical, Deployable and Secure Architecture for the Initial Deployment Stage of Vehicular Ad-Hoc Network\", Chang, Chip-Hong, Potkonjak, Miodrag (Eds.): Secure System Design and Trustable Computing, Springer, ISBN 978-3-319-14971-4, 2016. Ping Wang, Lei Wu, Baber Aslam and Cliff C. Zou, \"Analysis of Peer-to-Peer Botnet Attacks and Defenses\", to appear in Dariusz Krol, Damien Fay, Bogdan Gabrys (Ed): Propagation Phenomena in Real World Networks, Springer, ISSN: 1868-4394. Steven Zittrower and Cliff C. Zou, \"Encrypted Ranked Proximity and Phrase Searching in the Cloud\", Al-Sakib Khan Pathan (Ed): The State of the Art in Intrusion Prevention and Detection, CRC Press, Taylor & Francis Group, USA, January 2014.ISBN 9781482203516. Park, S., C. Zou, and D. Turgut, \"Reliable Traffic Information Propagation in Vehicular Ad hoc Networks,\" in R. Beyah, J. McNair, and C. Corbett (Eds): Security in Ad-hoc and Sensor Networks, Chapter 9, World Scientific Press, 2009, pp. 261-291. Ping Wang, Baber Aslam, Cliff C. Zou, \"Peer-to-Peer Botnets\", in Stavroulakis, Peter; Stamp, Mark (Eds): Handbook of Information and Communication Security, Chapter 18, Springer Press, 2010, pp. 335-350. Sherri Sparks, Shawn Embleton, Cliff C. Zou. \"Windows Rootkits - a Game of 'Hide and Seek',\" in Y. Xiao, F.H. Li, and H. Chen (Eds): Handbook of Security and Networks, Chapter 14, pp.345-369, World Scientific Publishing Co., ISBN-10: 9814273031, ISBN-13: 978-9814273039, 2011. Referred Jo",
  "content_length": 47994,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:42"
}