{
  "name": "Clio Andris",
  "homepage": "https://friendlycities.gatech.edu",
  "status": "success",
  "content": "Friendly Cities Lab – The Friendly Cities Lab is an active research group within the School of City & Regional Planning and School of Interactive Computing at Georgia Tech Skip to content We are a research group within the School of City & Regional Planning and School of Interactive Computing at Georgia Tech. We are working on a new field of study: interpersonal relationships and social networks in geographic space. Keywords: geographic information systems / science (GIS), social networks, urban planning, geovisualization. Research Themes SPATIAL SOCIAL NETWORK (SSN) ANALYSISWe analyze traditional, small social networks within a GIS environment. We develop metrics to show how relationships are hindered or helped by the built environment, and how powerful individuals benefit from the surrounding environment. (see Foundational Paper, Syrian Refugee Project, Facebook Project, and Mafia Project) The Social Network Mapping Nexus (SNOMAN) project has resources for Spatial Social Network Analysis.URBAN PLANNING FOR RELATIONSHIPS AND JUSTICE IN THE CITYWe help urban planners plan better cities by finding the amenities (parks, bars, Tinder, kayaking?) that best support personal relationships. (See Yelp Project and Romance in-State College Paper, No Dates at the HippoHop) Check out the Savannah Social project (2020-2024), where we worked with the City of Savannah and Prof. Lin. GEOVISUALIZATION + INFORMATION VISUALIZATIONWe create interactive visualizations and tools for exploratory spatial data analysis (ESDA) (see Data and Interactive Page) Check out free online tool SNoMaN here. Retired topic: NETWORK ANALYSIS We measure how ‘connected’ places are and how this correlates with culture, diversity, and flows in a city. We created a new measure of social distance: the strength of social flows between places. Social distance is driven by connecting over political/administrative, natural, and infrastructural boundaries, through institutions (universities, military bases, etc.), social ties, and shared culture. (see Foundational Paper, COVID-19 Regions PrePrint, Big Brothers Big Sisters Project, and NCAA Athletes Project). Upcoming Events 2025!! We had a great spring and summer–check out the SNOMAN page to see the updated spatial social network analysis software, teaching materials and workshop info. We’ll be back later in the fall to share some of our fun projects with legislative-geographic congruence, mapping science cuts, cartography and choropleth mapping, Social Life in Savannah, cartography and policing, and more~~. October 2024: IEEE VIS was cancelled but Sichen Jin is slated to give two workshop talks virtually. Clio will present a poster. We will be at SIGSPATIAL!GT Students can take a new seminar in Geovisualization and Geovisual Analytics this fall. September 2024: We had a great time in Quebec for COSIT 2024! Thanks to Grant for organizing the whole conference. We presented: The Senators Problem: A Design Space of Node Placement Methods for Geospatial Network Visualization (Short Paper)March 2024: We’ll see you at Cornell University for the 2024 CITY & REGIONAL PLANNING COLLOQUIUM March 8, 2024, 12:20 PM in Milstein Auditorium.Drop into MS-GIST info office hours, Wed. 3-4 PM (through March 13, 2024). More info here and here or join the Feb 14 Info Session. <3 <3 <3 Savannah: The Savannah Social project team is heading back to Savannah on April 8, 2023 9-2 for round 2 of our survey! If you’re in Forsyth Park come check us out and meet our Easter bunny!",
  "content_length": 3514,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:46"
}