{
  "name": "Cláudio Fernando Resin Geyer",
  "homepage": "http://www.inf.ufrgs.br/site/docente/claudio-fernando-resin-geyer",
  "status": "success",
  "content": "Claudio Fernando Resin Geyer - Instituto de Informática - UFRGS Contato Links úteisCiência da ComputaçãoEngenharia de ComputaçãoContatoLocalizaçãoWebmail Voltar para lista de docentes Claudio Fernando Resin Geyer Professor Aposentado Página Pessoal → CV LATTES → E-mail: *protected email* Telefone: +55 51 3308-6802 Prédio: 43424 Sala: 221 Qualificações Doutorado em Informática (Université Joseph Fourier, Grenoble, França, 1991) 1983-1986 Mestrado em Computação 1986-1991 Doutorado em Informatica 1995-1996 Pós-doutorado em Université Joseph Fourier - Grenoble I Áreas de Interesse Paralelismo Distributed Systems Big Data: Frameworks and Applications Ubicomp and IoT Smart Cities Cloud, FOG, EDGE Minibiografia Prof. Geyer iniciou sua carreira docente como horista em 1980, junto à Divisão Acadêmica do Centro de Processamento de Dados da Universidade Federal do Rio Grande do Sul, onde ministrava a disciplina de Linguagens de Programação, no Curso de Tecnólogo em Processamento de Dados. Entretanto, sua trajetória na UFRGS começou antes, como aluno, pois cursou a graduação em Engenharia Mecânica também na UFRGS, tendo se graduado em 1978. Anteriormente à sua experiência como docente, Geyer atuou na indústria, nas empresas Direção (1970-1978) e Edisa (1978-1981), de onde se afastou para ingressar como docente efetivo, em 1981. Já como docente, cursou o mestrado em Ciência da Computação no PPGC, concluído em 1986 e realizou o doutorado em Informática, na Université de Grenoble I (Joseph Fourier), concluído em 1991. Retornou a essa mesma universidade para um estágio de pós-doutorado de 1995 a 1996. Sua principal área de atuação tem sido Sistemas de Computação, focando principalmente nos seguintes temas: computação pervasiva (ubíqua), computação em grade, nas nuvens e voluntária, ferramentas para aplicações de Big Data e suporte a jogos multijogadores, com ênfase na construção de middleware para essas áreas da Computação, e programação paralela e distribuída. Participou e coordenou diversos projetos de pesquisa, muitos financiados pela FAPERGS. Ao longo de sua carreira como docente, orientou 56 dissertações de mestrado, 17 teses de doutorado e diversos trabalhos de conclusão de graduação. Atualmente, orienta 9 dissertações de mestrado. Suas publicações em periódicos, conferências e capítulo de livros ultrapassam a expressiva marca de 250 artigos científicos. Essa trajetória bem sucedida resultou na sua promoção a Professor Titular em 29 de setembro de 2015. No dia 02 de agosto de 2023 foi publicada no D.O.U. a portaria de aposentadoria do professor Cláudio Fernando Resin Geyer.",
  "content_length": 2610,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:55"
}