{
  "name": "Cláudio T. Silva",
  "homepage": "https://ctsilva.github.io",
  "status": "success",
  "content": "Applying to NYU for a PhD - Claudio Silva Claudio SilvaInstitute Professor, New York University Follow New York, NY Email Twitter LinkedIn Github Google Scholar ORCIDApplying to NYU for a PhDIf you’re interested in pursuing a PhD at NYU, here are the programs I am affiliated with:PhD in computer sciencePhD in data scienceAbout MeI am Institute Professor of Computer Science and Data Science at New York University.My research interests are broad and inherently interdisciplinary. Within computer science, I focus on visualization, visual analytics, machine learning, reproducibility and provenance, geometric computing, urban computing, computer graphics, and computer vision. I particularly enjoy working at the intersection of different fields, recently collaborating with paleontologists, urban scientists, and sports scientists. I enjoy building tools that others can use to advance their own research and solve real-world problems.Academic BackgroundI received my BS in Mathematics from the Universidade Federal do Ceará (Brazil) in 1990, and my MS and PhD in Computer Science from the State University of New York at Stony Brook in 1996. Prior to joining NYU in 2011, I was with the Scientific Computing and Imaging (SCI) Institute at the University of Utah.Leadership and ImpactI was a co-founder of NYU’s Center for Data Science (CDS) and the Center for Urban Science and Progress (CUSP). Currently, I serve as Co-Director of the Visualization, Imaging and Data Analysis (VIDA) Center, located on the 11th floor of 370 Jay Street in Brooklyn, NY. I am also part of ai@nyu.A significant part of my career has been dedicated to mentoring the next generation of researchers through advising doctoral and masters students, post-doctoral associates, and departmental fellows.Recognition and ServiceI am a Fellow of the ACM (2024) and IEEE (2013), and have received the IEEE Visualization Technical Achievement Award (2014). I served as the elected Chair of the IEEE Technical Committee on Visualization and Computer Graphics from 2015–2018.From 2012-2017, I was the senior technology consultant for MLB Advanced Media’s Statcast player tracking system, which received a 2018 Technology & Engineering Emmy Award from the National Academy of Television Arts & Sciences (NATAS).Our lab’s work has been featured in major media outlets including The New York Times, The Economist, Smithsonian Magazine, and ESPN. Recent highlights include PaleoScan fossil scanning (Smithsonian 2024), Statcast at 10 years (NYT Athletic 2024), NYC shadow mapping (NYT 2016), and the SONYC urban noise project (NYT 2017). See media coverage.FundingMy research has been generously supported by the National Science Foundation (NSF), DARPA, Advanced Research Projects Agency for Health (ARPA-H), National Institutes of Health (NIH), NASA, U.S. Department of Energy, U.S. Department of Defense, the Moore-Sloan Data Science Environment at NYU, Capital One, MLB Advanced Media, C2SMART US DOT Tier-1 University Transportation Center, NVIDIA, IBM, Adobe, ExxonMobil, Kitware, McGraw-Hill Education, and NEC Research.Research ProjectsCurrent ProjectsOpenSpace: Interactive Visualization of the Known Universe NASA Science Mission Directorate (2017-2025, $10M+) [Project Website] [GitHub] [NASA Science] Open-source interactive data visualization software for space exploration, deployed in 17+ planetariums worldwide. Enables real-time visualization of NASA missions, astronomical data, and simulations for research and public education. Collaboration with American Museum of Natural History, Linköping University, and University of Utah.OSCUR: Open-Source Cyberinfrastructure for Urban Computing National Science Foundation (2024-2029, $5M) [Project Website] [Hugging Face] [Urban Toolkit] [Press] Developing comprehensive tools for urban data collection and analysis, addressing climate change, walkability, bikeability, and urban accessibility. Collaboration with University of Washington and University of Illinois Chicago.ARPA-H Biomedical Data Fabric (BDF) Toolbox Advanced Research Projects Agency for Health (2023-Present, $2.5M) [ARPA-H Program] [NCI Partnership] [CBIIT Overview] Building unified software tools for biomedical research data integration, providing interoperable data services across disciplines with focus on cancer research visualization.Recent ProjectsDARPA Perceptually-enabled Task Guidance (PTG) Defense Advanced Research Projects Agency (2021-2024, $5M) [DARPA Program] [NYU Press] [ARGUS Paper] [TIM Paper] Developing AI-powered augmented reality assistants for complex task guidance using Microsoft HoloLens 2. Created ARGUS visual analytics system and TIM AR personal assistant for AR development.Sounds of New York City (SONYC) National Science Foundation (2016-2023, $4.6M) [Project Website] [NSF Award] [CACM Article] Comprehensive urban noise pollution monitoring system deploying low-cost acoustic sensor networks and machine learning software for real-time sound source identification. Includes citizen science mobile apps and data visualization tools to help urban residents and city agencies address noise pollution.Explainable AI Capital One Center for Machine Learning (2019-2023) Developing interpretable machine learning methods for financial decision-making systems in collaboration with Capital One’s research team.Sports AnalyticsMLB Advanced Media Statcast System Senior Technology Consultant (2012-2017) [2018 Technology Emmy Award] Pioneered player tracking and visualization systems for Major League Baseball, now deployed in all 30 MLB stadiums. My work and interests in the area of sports analytics expanded to include other sports analytics research over time.ContactThe best way to reach me is via email at csilva@nyu.edu.",
  "content_length": 5756,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:51"
}