{
  "name": "Cody Dunne",
  "homepage": "https://cody.khoury.northeastern.edu",
  "status": "success",
  "content": "Cody DunneYou need to enable JavaScript to run this app.Associate Professor, Khoury College of Computer Sciences, Northeastern University Group Page College Bio Page ORCID OSF Google Scholar DBLP GitHub Lab GitHub Observable LinkedIn Mastodon Twitter Email CVBioI am an Associate Professor in the Khoury Vis Lab, part of the Khoury College of Computer Sciences at Northeastern University. I create readable visualizations of network relationships that help users understand complex data. I mainly address visualizing layered networks, in which the nodes in the network are constrained to lie on parallel layers. My research leverages the algorithmic aspects of computer science to build and assess new visualization techniques and tools, as well as human-computer interaction (HCI) methodologies to understand the perceptual abilities, goals, tasks, and processes of users and validate visualization designs. This work has led to my contributing new HCI research methods and novel visualization and HCI theory that can guide future researchers and practitioners. I often use applied research across various domains to help generate novel basic research contributions. These cross-disciplinary collaborations provide me with new questions, data sets, case studies, and invested users whose work benefits from our partnerships.Areas of investigation: Data Visualization + ...Graph and network dataMultidimensional dataGeospatial dataTemporal event sequencesEvaluation methodologiesLayout algorithmsExploratory data analysisUser interface designInteraction designPerception and cognitionAnalytic provenanceVirtual and extended reality (VR & XR)Specific domains of interest:Computer Science and Engineering, including work in databases, machine learning / explainable AI, programming languages, natural language processing, systems, and hardware simulationCybersecurity and Computer Networks, including unmanned autonomous system analysis and improving network resilienceHealthcare diagnostic and treatment decision support, including diabetes & neurologyDigital humanities, including networks of concepts in humanities texts as well as text and timeline visualizationsEpidemiology, including the spread of infectious diseaseRecent News2024-05-16: Welcome to my new PhD student Calvin Yu!2024-05-09: Khoury will have 28 contributions at CHI 2023, including 5 papers and 2 best paper honorable mentions from our group! See our schedule of presentations and the program for details.2023-11-16: Congratulations to Justin Raynor for passing his dissertation defense!2023-08-08: A bunch of work from our group will appear at VIS 2023, including my papers on an immersive analytics systematic review, a tool for conducting such reviews, and my TVCG paper on differential privacy's effect on scatterplot utility.2023-07-30: Congratulations to Sara Di Bartolomeo and David Saffo for passing their dissertation defenses! They are my first graduating PhD students!2022-04-15: Welcome my new PhD students Eduardo Puerta and Connor Wilson!2022-04-08: 38 authors from Northeastern were represented at CHI 2022 and there were 11 contributions from Khoury! Our group contributed two different papers (this one is mine), a late-breaking work, and a case study.2022-04-06: My PhD student Sara Di Bartolomeo was recognized by the university as a Huntington 100 scholar for her outstanding academic achievements!News ArchivePrinciples of Query VisualizationThrough their eyes and in their shoes: providing group awareness during collaboration across VR and desktop platformsSix methods for transforming layered hypergraphs to apply layered graph layout algorithmsInvestigating the visual utility of differentially private scatterplotsThe state of the art in BGP visualization tools: A mapping of visualization techniques to cyberattack typesPreviousNextRecent PublicationsSee also my full list of publications.On the reasonable effectiveness of Relational Diagrams: explaining relational query patterns and the pattern expressiveness of relational languagesWolfgang Gatterbauer and Cody Dunne. Proc. ACM on Management of Data—SIGMOD/PACMMOD. 2024.PDF | Preprint | DOI | Supplement | Preregistration | Homepage | BibTeX | SIGMOD 2024 Best Paper Honorable Mention (1/3)!The effect of orientation on the readability and comfort of 3D-printed brailleEduardo Puerta, Tarik Crnovrsanin, Laura South, and Cody Dunne. Proc. CHI Conference on Human Factors in Computing Systems—CHI. 2024.PDF | Preprint | Supplement | Preregistration | BibTeXA collection of benchmark datasets for evaluating graph layout algorithmsSara Di Bartolomeo, Eduardo Puerta, Connor Wilson, Tarik Crnovrsanin, and Cody Dunne. Poster at Graph Drawing and Network Visualization—GD Posters. 2023.PDF | Preprint | Supplement | Code | Homepage | BibTeX | GD 2023 best poster honorable mention!Unraveling the design space of immersive analytics: a systematic reviewDavid Saffo, Sara Di Bartolomeo, Tarik Crnovrsanin, Laura South, Justin Raynor, Caglar Yildirim, and Cody Dunne. IEEE Transactions on Visualization and Computer Graphics—VIS/TVCG. 2023.PDF | Preprint | Supplement | Code | Homepage | BibTeXIndy Survey Tool: A framework to unearth correlations in survey dataTarik Crnovrsanin, Sara Di Bartolomeo, Connor Wilson, and Cody Dunne. Proc. IEEE Visualization Conference—VIS. 2023.PDF | Preprint | Supplement | Code | BibTeXInvestigating the visual utility of differentially private scatterplotsLiudas Panavas, Tarik Crnovrsanin, Jane Lydia Adams, Jonathan Ullman, Ali Sargavad, Melanie Tory, and Cody Dunne. IEEE Transactions on Visualization and Computer Graphics—TVCG. 2023.PDF | Preprint | DOI | Supplement | Preregistration | Code | BibTeXThrough their eyes and in their shoes: providing group awareness during collaboration across virtual reality and desktop platformsDavid Saffo, Andrea Batch, Cody Dunne, and Niklas Elmqvist. Proc. CHI Conference on Human Factors in Computing Systems—CHI. 2023.PDF | Preprint | DOI | Supplement | Preregistration | BibTeXProcess and pitfalls of online teaching and learning with Design Study 'Lite' Methodology: A retrospective analysisUzma Haque Syeda, Cody Dunne, and Michelle A. Borkin. Computer Graphics Forum—EuroVis/CGF. 2023.PDF | Preprint | Supplement | DOI | BibTeXCody Dunne, Vis Lab — Northeastern UniversityWest Village H, Room 302F440 Huntington Ave, Boston, MA 02115, USA",
  "content_length": 6371,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:58"
}