{
  "name": "Colin Potts",
  "homepage": "http://oue.gatech.edu/content/colin-potts",
  "status": "success",
  "content": "Office of Undergraduate Education & Student Success Skip to main navigation Skip to content Now in main content Office of Undergraduate Education & Student Success The Office of Undergraduate Education & Student Success (OUESS), a unit of the Office of the Provost, strives to enrich undergraduate education and empower students to succeed as leaders in progress and service. Our programs support undergraduate students to become accomplished learners who are able to make meaningful connections across work, study, and community. We connect curricular and co-curricular offerings to assist students in developing a strong foundation for success, during and after college. Featured News GT 1000: Celebrating 20 Years of Driving Student Success GT 1000 is more than a first-year seminar. Officially named in 2004 but with a history dating back to the 1980s, the course serves as a close-knit community of peers, a launchpad for life and learning at Georgia Tech, and a living example of the Institute’s commitment to student success. The program’s growth and longevity reflect a shared commitment from dedicated instructors, team leaders, and staff who believe that belonging and support should be part of every student’s Georgia Tech experience. READ MORE Latest News Julie Sonnenberg-Klein Joins OUESS as Director of Experiential Learning Strategic Initiatives Nov 24, 2025We are pleased to announce that Dr. Julia “Julie” Sonnenberg-Klein, executive director of the Vertically Integrated Projects (VIP) Program, has joined the Office of Undergraduate Education and Student Success (OUESS) in a joint appointment as director of Experiential Learning Strategic Initiatives. read more Emily Wong Joins OUESS as Senior Director of Development, Student Experience Nov 12, 2025We are pleased to announce that Emily Wong will be joining the Office of Undergraduate Education and Student Success (OUESS), as part of her new role in the Office of Development as Senior Director of Development, Student Experience. In this newly created role, Emily will lead a coordinated fundraising strategy that brings together OUESS, Student Engagement and Well-Being (SEWB), and the Georgia Tech Libraries. read more View All News Follow Us On Social Media View this profile on InstagramOffice of Undergraduate Education and Student Success (@gtoue) • Instagram photos and videos FollowFollowFollowFollowFollow Popular Resources For Students Tutoring Tutoring provides academic resources to help you achieve your goals at Tech. Learn More About Tutoring Ignite Students admitted for the late short summer session begin their Georgia Tech journey by joining in the Ignite Summer Launch Program. Learn More About Ignite First-Year Semester Abroad Accelerate your journey to global citizenship with Georgia Tech’s First-Year Semester Abroad (FYSA) Program! Learn More About First Year Semester Abroad Distinguish Yourself Leaders in Progress and Service will deliver a program available to all undergraduates that is designed for transformative impact. Learn More About Leaders in Progress and Service Popular Resources For Faculty & Staff Employee Directory Learn more about the amazing people who work for OUESS! View our leadership and departments. View Employee Directory OUESS Careers If you’d like to explore a career with OUESS, view the current openings below and follow the link to apply. View Open Positions Georgia Legislative Requirements All Georgia Tech undergraduate students must satisfy four “Georgia Legislative Requirements” (GLRs). View Georgia Legislative Requirements Core IMPACTS The Core IMPACTS curriculum is distributed across seven Areas, with curricular pathways and required hours. View Core IMPACTS We’re here when you need help.Need something else? Please get in touch and we’ll be happy to help! Contact Us Back to top",
  "content_length": 3828,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:03"
}