{
  "name": "Colin J. Dalton",
  "homepage": "https://research-information.bris.ac.uk/en/persons/colin-j-dalton",
  "status": "success",
  "content": "Colin J Dalton - University of Bristol View Scopus Profile Mr Colin J Dalton B.A.(W.England) Senior Academic Fellow, School of Computer ScienceVisual Information Laboratory EmailColin.Daltonbristol.acuk BS8 1UB Personal profile Research interestsColin Dalton is a Senior Lecturer in the Department of Computer Science specialising in visual effects and animation production. Colin is an active researcher in the Visual Information Laboratory where he collaborates with Computer Vision researchers to explore the capture and representation of motion. Colin is the Undergraduate Programme Director and as a pedagogical researcher he is passionate about the creative design process and its application in science and engineering. This is reflected directly in his lectures, which introduce pipelines for animation and games production; from artistic concept to final render. Beyond the Department Colin has lectured and presented nationally and internationally at; the Animated Encounters Festival, IBM, SSST Sarajevo, Brno University, Buckingham University, Warwick University, the Watershed Media Centre, the BBC and at local schools and colleges. In 2011 Colin was awarded the University Teaching and Learning Award for excellence in education. Expertise I am currently a Lecturer in the Computer Science department and teach at both undergraduate and postgraduate level in computer graphics and animation. My research interests centre around the development of techniques to aid the rapid production of animation and digital content. Current content production techniques are expensive and require a high level of skilled input. These new techniques aim to free up creative time and undertake much of the tedious manual work that is currently required, automatically. Keywords GraphicsInteraction and GraphicsVisual Information LaboratoryBRL Bristol Robotics Laboratory Research Groups and ThemesEngineering Education Research Group Fingerprint Dive into the research topics where Colin J Dalton is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 3 Similar Profiles Autoregressive Model Mathematics 100% Motion Characteristic Computer Science 70% Tracking Technique Computer Science 60% Generating Point Computer Science 60% Integrated System Computer Science 60% Principal Components Computer Science 60% Component Analysis Computer Science 60% Optimal Path Engineering 60% View full fingerprint Research output 14 Conference Contribution (Conference Proceeding) 5 Article (Academic Journal) 1 Digital or Visual Products Research output per year Research output per year Facial movement based recognitionDavies, A., Ek, C. H., Dalton, C. & Campbell, N., 2011, Proceedings of the 5th international conference on Computer vision/computer graphics collaboration techniques. Berlin, Heidelberg: Springer Verlag, p. 51-62 12 p. (MIRAGE'11).Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) 1 Citation (Scopus) A System for the Capture and Synthesis of Insect MotionGibson, D., Oziem, D., Dalton, C. & Campbell, N., 2007, In: Graphical Models and Image Processing. 69(5), 231-245.Research output: Contribution to journal › Article (Academic Journal) › peer-review Metrics 100% Limited Number 100% Scale Dynamic 100% Optimal Path 100% Integrated System 100% A system for the capture and synthesis of insect motionGibson, D., Oziem, D., Dalton, C. & Campbell, N., Nov 2006, In: Graphical Models. 69 (5-6), p. 231 - 245 15 p.Research output: Contribution to journal › Article (Academic Journal) › peer-review Metrics 100% Limited Number 100% Scale Dynamic 100% Optimal Path 100% Integrated System 100% 9 Citations (Scopus) View all 20 research outputs",
  "content_length": 3762,
  "method": "requests",
  "crawl_time": "2025-12-01 12:54:58"
}