{
  "name": "Colin S. Gordon",
  "homepage": "https://www.cs.drexel.edu/~csgordon",
  "status": "success",
  "content": "Colin S. Gordon | Associate Professor of Computer Science, Drexel University Biography I am an Associate Professor in the Computer Science Department of Drexel University's College of Computing and Informatics. I am interested in finding new ways to improve software reliability, especially providing strong static guarantees about program behavior, for concurrent and systems-level code. My work has focused on formal verification of concurrent programs using static reference capabilities and effect systems, though I'm also interested in other levels of formal assurance, programming models, distributed computing, and even testing. Right now I'm working on effect systems to reason about partial program correctlness, full formal verification for operating systems kernels, and tools to connect natural language to machine language (code and formal specifications). See my publications page for more details. If you are interested in working with my on research, please see my advice for prospective students page, which describes how what I look for in PhD students, as well as how undergraduate or MS students already at Drexel can get involved in research with me. Previously I've been a Senior Research Engineer at Samsung Research, a PhD student at the University of Washington, a software developer in Microsoft's Midori operating system kernel group (later doing compiler work with the team), and much longer ago an undergraduate at Brown University, an intern in the Solaris Kernel Group at Sun Microsystems, and an intern in one of the filesystem groups at NetApp. Mastodon Mastodon Interests Programming Languages Software Engineering Type Theory Program Logics Operating Systems Formal (Theoretical) Linguistics Education PhD, 2014 University of Washington MS, 2011 University of Washington ScB, 2008 Brown University Recent Publications Gordon, Colin S. The Linguistics of Programming Onward! Essays, October 2024, doi: 10.1145/3689492.3689806 Research in programming languages and software engineering are broadly concerned with the study of aspects of computer programs: their syntactic structure, the relationship between form and meaning (semantics), empirical properties of how they are c… Gordon, Colin S. Mocking Temporal Logic SPLASH-E, October 2024, doi: 10.1145/3689493.3689980 Temporal logics cover important classes of system specifications dealing with system behavior over time. Despite the prevalence of long-running systems that accept repeated input and output, and thus the clear relevance of temporal specifications to … ...",
  "content_length": 2563,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:01"
}