{
  "name": "Concepción Vidal",
  "homepage": "https://pdi.udc.es/en/File/Pdi/TD3AF",
  "status": "success",
  "content": "Concepción Vidal Martín File. Department Computer Science and Information Technologies Knowledgment area Algebra Research Research group Information Retrieval Lab Research lines Representación Lógica del Conocimiento. Programación Lógica. Razonamiento no monótono Keywords Answer Set Programming, equilibrium model, Teaching merits evaluation 6 five years period(s) Research merits evaluation 4 six years period(s) Contacto UDC directory Orcid id0000-0002-5561-6406 ResearcherIDABD-9547-2021 Scopus7101664033 Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Algebra Degree in Computer Engineering Core 0 43 Discrete Mathematics Degree in Computer Engineering Programa de Simultaneidad del Grado en Ingeniería Informática y Grado en Ciencia e Ingeniería de Datos Core 0 30 Discrete Mathematics Degree in Data Science and Engineering Core 0 60 Discrete Mathematics Degree in Artificial Intelligence Core 0 30 Logic Degree in Artificial Intelligence Core 0 5 Work Placement Degree in Computer Engineering Optional 0 12 Subject and involved studies Type Distance hours Total hours Algebra Degree in Computer Engineering Core 0 30 Discrete Mathematics Degree in Computer Engineering Core 0 30 Discrete Mathematics Degree in Data Science and Engineering Core 0 60 Discrete Mathematics Degree in Artificial Intelligence Core 0 8 Logic Degree in Artificial Intelligence Core 0 5 Work Placement Degree in Computer Engineering Optional 0 0 Work Placement Degree in Computer Engineering Optional 0 12 Subject and involved studies Type Distance hours Total hours Algebra Degree in Computer Engineering Core 0 17 Algebra Degree in Artificial Intelligence Core 0 20 Algorithms Degree in Computer Engineering Compulsory 0 10 Discrete Mathematics Degree in Computer Engineering Core 0 53 Discrete Mathematics Degree in Data Science and Engineering Core 0 60 Discrete Mathematics Degree in Artificial Intelligence Core 0 15 Logic Degree in Artificial Intelligence Core 0 5 Work Placement Degree in Computer Engineering Optional 0 0 Work Placement Degree in Computer Engineering Optional 0 10 Subject and involved studies Type Distance hours Total hours Algebra Degree in Computer Engineering Core 0 11.5 Algorithms Degree in Computer Engineering Compulsory 0 14 Discrete Mathematics Degree in Computer Engineering Core 0 30 Discrete Mathematics Degree in Data Science and Engineering Core 0 60 Discrete Mathematics Degree in Artificial Intelligence Core 0 15 Logic Degree in Artificial Intelligence Core 0 5 Work Placement Degree in Computer Engineering Optional 0 10 Subject and involved studies Type Distance hours Total hours Algebra Degree in Computer Engineering Core 0 30 Algorithms Degree in Computer Engineering Compulsory 0 10 Discrete Mathematics Degree in Computer Engineering Core 0 33 Discrete Mathematics Degree in Data Science and Engineering Core 0 60 Work Placement Degree in Computer Engineering Optional 0 10 Subject and involved studies Type Distance hours Total hours Algebra Degree in Computer Engineering Core 0 60 Algorithms Degree in Computer Engineering Compulsory 0 12 Discrete Mathematics Degree in Computer Engineering Core 0 20 Discrete Mathematics Degree in Data Science and Engineering Core 0 60 Tutoring 2025/2026 Defined tutoring by teacher for 2025/2026 academic course. Faculty of Computer Science Quarter Day Site 1st quarter Tuesday 17:00 a 19:00 TEAMS o Despacho 4.10 (previo e-mail a concepcion.vidalm@udc.es) 1st quarter Wednesday 10:30 a 12:30 Teams o Despacho 4.10 (previo e-mail a concepcion.vidalm@udc.es) 1st quarter Thursday 10:30 a 12:30 Teams o Despacho 4.10 (previo e-mail a concepcion.vidalm@udc.es) 2nd quarter Tuesday 17:00 a 18:30 TEAMS o Despacho 4.10 (previo e-mail) 2nd quarter Thursday 12:30 a 14:00 TEAMS o Despacho 4.10 (previo e-mail) 2nd chance Tuesday 10:30 a 12:30 TEAMS o Despacho 4.10 (previo e-mail) EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2018/2019 Solving Temporal Logic Programs with AI Planners Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Papers in research journals Complete books Book chapters PhD theses directed Conference papers 2024 2022 2021 2019 2018 ... 2017 2016 2014 2013 2012 2010 2008 2003 2002 2000 1998 1996 Funding entity AEI, Agencia Estatal de Investigación Main researches Cabalar Fernández, José Pedro (IP1)/ Santos Reyes, José (IP2) Type Proyecto Programas Nacionales Dates From 01/09/2024 to 31/08/2028 Funding entity Consellería de Educación Main researches Álvaro Barreiro García Type Proyecto Programas Autonomicos Dates From 01/01/2022 to 20/11/2024 Funding entity Ministerio de Ciencia e Innovación Main researches Pedro Cabalar Fernández/ José Santos Reyes Type Proyecto Programas Nacionales Dates From 01/09/2021 to 31/08/2024 Funding entity CONSELLERIA DE EDUCACIÓN, UNIVERSIDADE E FORMACIÓN PROFESIONAL Main researches ÁLVARO BARREIRO GARCÍA Type Proyecto Programas Autonomicos Dates From 01/01/2019 to 20/11/2021 Funding entity Ministerio de Economía y Competitividad (MINECO) Main researches Pedro Cabalar Fernández Type Proyecto Programas Nacionales Dates From 01/01/2018 to 31/12/2020 Funding entity Xunta de Galicia Main researches Juan José Nieto Roig Type Proyecto Programas Autonomicos Dates From 01/01/2017 to 31/12/2018 Funding entity Xunta de Galicia Main researches Álvaro Barreiro García Type Proyecto Programas Autonomicos Dates From 01/01/2017 to 31/12/2018 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Manuel F. González Penedo Type Proyecto Programas Autonomicos Dates From 01/01/2016 to 30/11/2019 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Juan José Nieto Roig Type Proyecto Programas Autonomicos Dates From 01/01/2014 to 31/12/2015 Funding entity Ministerio de Economía y Competitividad (MINECO) Main researches José Pedro Cabalar Fernández Type Proyecto Programas Nacionales Dates From 01/01/2014 to 31/12/2016 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Alvaro Barreiro García Type Proyecto Programas Autonomicos Dates From 01/01/2013 to 31/12/2015 Funding entity Xunta de Galicia Main researches Juan José Nieto Roig Type Proyecto Programas Autonomicos Dates From 01/01/2012 to 30/11/2013 Funding entity Ministerio de Economía y Competitividad Main researches José Pedro Cabalar Fernández Type Proyecto Otros Programas Dates From 01/01/2010 to 31/12/2013 Funding entity Dirección Xeral de Investigación, Desenvolvemento e Innovación Type Proyecto Otros Programas Dates From 01/01/2008 to 31/10/2011 Funding entity Secretaria Xeral de Investigación e Desenvolvemento Tecnolóxico Type Proyecto Otros Programas Dates From 15/07/2003 to 14/07/2005 Funding entity Ministerio de Ciencia y Tecnología Main researches Víctor M. Gulías Fernández Type Proyecto Programas Nacionales Dates From 05/11/2002 to 05/11/2005 Funding entity Secretaria Xeral de Investigación e Desenvolvemento Tecnolóxico Type Proyecto Otros Programas Dates From 28/09/2002 to 27/09/2004 Funding entity Secretaria Xeral de Investigación e Desenvolvemento Tecnolóxico Type Proyecto Otros Programas Dates From 26/08/2000 to 26/08/2002 Type Proyecto Otros Programas Dates From 28/04/1998 to 28/04/1999 Type Proyecto Otros Programas Dates From 01/01/1996 to 01/01/1996 2023 2022 2019 2017 2015 ... 2013 2011 2008 2007 2006 2005 2001 1999 1998 1995 Authors Felicidad Aguado, Pedro Cabalar, Martín Diéguez Lodeiro, Gilberto Pérez, Torsten Schaub, Anna Schuhmann, Concepción Vidal Journal THEORY AND PRACTICE OF LOGIC PROGRAMMING Vol. 23 (pages 2 to 56) DOI https://doi.org/10.1017/s1471068421000557 Authors Felicidad Aguado, Pedro Cabalar, Jorge Fandinno, David Pearce, Gilberto Pérez, Concepción Vidal Journal Artificial Intelligence Vol. 308 (pages 1 to 14) DOI https://doi.org/10.1016/j.artint.2022.103712 Authors Concepción Vidal, Jorge Fandinno, David Pearce, Stefan Woltran Journal Algorithms Vol. 15(6) (pages 1 to 20) DOI https://doi.org/10.3390/a15060201 Authors Felicidad Aguado, Pedro Cabalar, Jorge Fandinno, David Pearce, Gilberto Pérez, Concepción Vidal Journal Artificial Intelligence Vol. 275 (pages 575 to 601) Authors Pedro Cabalar, Concepción Vidal Journal LECTURE NOTES IN COMPUTER SCIENCE Vol. 11805 Num. 2 (pages 520 to 524) DOI https://doi.org/10.1007/978-3-030-30244-3_43 Authors Felicidad Aguado, Pedro Cabalar, Jorge Fandinno, David Pearce, Gilberto Pérez, Concepción Vidal Journal THEORY AND PRACTICE OF LOGIC PROGRAMMING Vol. 19 Num. 5-6 (pages 908 to 924) DOI https://doi.org/10.1017/s1471068419000267 Authors Felicidad Aguado, Pablo Fernández Ascariz, Pedro Cabalar, Gilberto Pérez, Concepción Vidal Journal LOGIC JOURNAL OF THE IGPL Vol. 25 Num. 2 (pages 195 to 213) DOI https://doi.org/10.1093/jigpal/jzw060 Authors Felicidad Aguado, Pedro Cabalar, Martín Diéguez Lodeiro, Gilberto Pérez, Concepción Vidal Journal THEORY AND PRACTICE OF LOGIC PROGRAMMING Vol. 17 Num. 2 (pages 226 to 243) DOI https://doi.org/10.1017/s1471068416000570 Authors Felicidad Aguado, Pedro Cabalar, Martín Diéguez Lodeiro, Gilberto Pérez, Concepción Vidal Journal Journal of Applied Non-Classical Logics Vol. 27 Num. 3-4 (pages 161 to 177) DOI https://doi.org/10.1080/11663081.2018.1427987 Authors Pedro Cabalar, Concepción Vidal, Martin Diéguez Lodeiro Journal THEORY AND PRACTICE OF LOGIC PROGRAMMING Vol. 15 Num. 4-5 (pages 666 to 680) Authors Felicidad Aguado, Pedro Cabalar, Gilberto Pérez, Concepción Vidal, David Pearce Journal THEORY AND PRACTICE OF LOGIC PROGRAMMING Vol. 15 Num. 4-5 (pages 620 to 634) DOI https://doi.org/10.1017/s1471068415000277 Authors Felicidad Aguado, Pedro Cabalar, Gilberto Pérez, Concepción Vidal, Martín Diéguez Lodeiro Journal Journal of App",
  "content_length": 16945,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:03"
}