{
  "name": "Cong Liu 0005",
  "homepage": "https://intra.ece.ucr.edu/~cong/index.html",
  "status": "success",
  "content": "Homepage of Cong Liu at UC Riverside Cong Liu Professor, Electrical and Computer Engineering Cooperating Faculty, Computer Science and Engineering University of California, Riverside Office: 414 Winston Chung hall, 900 University Avenue, Riverside, CA 92521 Email: congl at ucr.edu I am passionate about designing and implementing timing-predictable, resource-efficient, and robust autonomous embedded and real-time systems, with robotics and autonomous vehicles being the currently focused application domains. Our recent projects conduct highly inter-disciplinary research intersecting systems, machine learning, and robotics. I am interested in working with self-motivated students who strive for research excellence. In the past, students in our group have had excellent academic and industry job placements. If you are interested in my research and working with me, please include some samples of your work (e.g., major projects, open source contributions, etc.) when contacting me directly. For current UCR students who are interested in working with me, please stop by my office so that we can discuss and see if there is a good match. Home Students Publications Teaching News » Simin Chen has graduated in Summer 2024 and joined Columbia University as a post-doc research scientist. Congratulations, Simin! » Multiple papers on enabling and optimizing autonomous robotic systems driven by reinforcement learning and LLM have been accepted by RTSS/IROS/CoLLAs/arXiv..Congratulations to Aritra, Yufei, and Zexin! » A recent (2023) set of research works on understanding and enhancing robustness of machine learning-driven autonomous systems have been accepted by CVPR/ECCV/ACL/ICLR/ISSTA » Junfeng Guo has graduated in Summer 2023 and joined University of Maryland at College Park as a post-doc research scientist. Congratulations, Junfeng! » A recent (2022) set of research works on optimizing and/or testing machine learning-driven autonomous embedded and real-time systems have been accepted by RTSS/ICSE/FSE/ASE/ICLR/CVPR/ECCV! » Very excited to join and start another journey at UCR! » Soroush Bateni has graduated in Spring 2022 and joined UC Berkeley as a post-doc research scientist. Congratulations, Soroush! » Our NeuOS paper has been accepted to USENIX ATC'20! » Two papers on generating realistic adversarial examples for misleading autonomous steering and adaptive neural nets, respectively, have been accepted to CVPR 2020! » I will be working at ETH Zurich as a visiting professor in 2020-2021. » Two papers on physical-world testing of autonomous driving systems and detecting GPGPU CUDA synchronization bugs, respectively, have been accepted to ICSE 2020! » Zheng Dong has graduated and joined Wayne State University Computer Science Department as a tenure-track assistant professor. Congratulations, Zheng! » Thanks to NVIDIA for a gift including the Drive PX2 SoC, which provides a very timely hardware support for our ongoing research on enhancing the predictability and robustness of autonomous driving systems! » Our paper titled \"PIFA: An Intelligent Phase Identification and Frequency Adjustment Framework for Time-Sensitive Mobile Computing\" has been accepted to the 25th RTAS (RTAS 2019) » I have graduated my second PhD student, Husheng Zhou. Congratulations, Husheng! » Our paper titled \"Diagnosing Vehicles with Automotive Batteries\" has been accepted to the 25th MobiCom (MobiCom 2019) » Two papers have been accepted to the 39th RTSS (RTSS 2018): ApNet (exploring approximation potential of DNN for timing predictability), and PredJoule (a timing-predictable energy optimization framework for DNN-driven autonomous systems). Congrats to Soroush Bateni for getting two first-authored papers accetped by RTSS 2018! » Our paper ''DeepRoad: GAN-based Metamorphic Testing and Input Validation Framework for Autonomous Driving Systems'' has been accepted to the 33rd IEEE/ACM International Conference on Automated Software Engineering (ASE 2018) » I have graduated my first PhD student (co-advised with Dr. Ding-Zhu Du), Guangmo (Amo) Tong, who will join the University of Delaware as a tenure-track assistant professor. Congratulations, Amo! » Our paper \"S^3DNN: Supervised Streaming and Scheduling for GPU-accelerated Real-Time DNN Workloads\" received the Best Paper Award at RTAS 2018 (CPSWeek@Porto). Congrats to Husheng and Soroush! » Our paper on \"Exploring Computation and Data Redundancy via Partial GPU Computing Result Reuse\" has been accepted to the 32nd ACM International Conference on Supercomputing (ICS 2018). » I received the NSF CAREER award. Thanks to NSF for support! » Our papers on \"predictable processing of GPU-accelerated DNN workloads\" and \"shared-resource-centric multicore scheduling\" have been accepted to the 24th RTAS (RTAS 2018). » Our paper titled \"Analysis techniques for supporting hard real-time sporadic gang task systems\" has been accepted to the 38th RTSS (RTSS 2017). This paper received the Outstanding Paper Award! Congrats to Zheng! » Our paper titled \"Rec: Predictable charging scheduling for electric taxi fleets\" has been accepted to the 38th RTSS (RTSS 2017). » Our paper titled \"ATHOME: Automatic Tunable Wireless Charging for Smart Homes\" has been accepted to the 2nd IoTDI (IoTDI 2017). » Served on the External Review Committee at ASPLOS 2018. » Served on the External Review Committee at ASPLOS 2017. » Served on the TPC at RTSS 2017. News Archive Short Bio I am a professor in the Department of Electrical and Computer Engineering at University of California, Riverside. I was an associate professor at UT-Dallas and a visiting professor at ETH Zurich. I received my Ph.D. in Computer Science from the University of North Carolina at Chapel Hill with Prof. Jim Anderson in 2013. Current Focused Research Directions: System-level Optimization in Autonomous Embedded Systems Robustness Testing of DNN-driven Robots Real-Time Scheduling Theory This site last updated August 2013",
  "content_length": 5958,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:03"
}