{
  "name": "Congyan Lang",
  "homepage": "https://faculty.bjtu.edu.cn/7968",
  "status": "success",
  "content": "北京交通大学教师名录 郎丛妍 博士 、教授 、多媒体大数据分析与安全团队负责人 基本信息 办公电话：010-51688566 电子邮件： cylang@bjtu.edu.cn 通讯地址：北京交通大学计算机与信息技术学院九号教学楼北524 邮编：100044 个人简介 多媒体大数据分析与安全研究团队负责人，北京交通大学计算机与信息技术学院教授，博士生导师，入选首批北京交通大学青年英才培育计划，入选微软亚洲研究院铸星计划。主要研究方向：计算机视觉、机器学习以及跨模态检索。围绕研究方向，主持国家科技创新2030-“新一代人工智能”重大项目课题、多项国家自然科学基金面、北京市自然科学基金面、教育部中国移动基金等科研项目。在包括 IEEE Trans. on Pattern Analysis and Machine Intelligence, IEEE Trans. on Image Processing, IEEE Trans. on Knowledge and Data Engineering,  IEEE Trans. on Multimedia, 等知名学术期刊以及国际会议上累计发表各类研究论文近百篇。受国家留学基金委资助，分别于2011年及2014年在新加坡国立大学和美国罗彻斯特大学任国家公派访问学者。CCF多媒体技术专委会执委，中国图形图像学多媒体计算专委会委员。近年来培养的博士/硕士研究生多次获得校级优秀博士/硕士论文、国际学术会议最佳学术论文奖以及最佳论文提名奖； 常年招收硕士研究生(学术型：每年 4 名；专业型：每年1-2名)！欢迎数学/信息与计算科学/计算机科学与技术等相关专业的同学报考！ 简历请发邮箱：cylang@bjtu.edu.cn ; 工作经历 2013.10-至今              北京交通大学 计算机与信息技术学院，教授， 博士生导师; 2014.07-2015.06        罗彻斯特大学   计算机科学系， 访问教授，  合作教授：Prof. Jiebo Luo 2013.02-2013.08        微软亚洲研究院  多媒体计算组   访问研究员,  合作研究员：王井东 2014.03-2014.06        中科院自动化所模式识别实验室  访问研究员，合作研究员：胡卫明 2009.10-2013.09        北京交通大学 计算机与信息技术学院 副教授，博士生导师; 2010.11-2011.11        新加坡国立大学，电子与计算机工程系，访问学者，合作教授：Prof . Yan shuicheng 2006.07-2009.09        北京交通大学， 计算机与信息技术学院，讲师， 硕士生导师 教育背景 2003.09-2006.07          北京交通大学，    计算机与信息技术学院， 博士研究生 2001.09-2003.07          北京交通大学，    计算机与信息技术学院， 硕士研究生 1997.09-2001.07          内蒙古大学，       计算机科学与技术学院，    本科 研究方向 机器学习与认知计算 计算机技术 软件工程 人工智能 大数据技术与工程 智能感知与具身智能 低空航行安全保障 新一代电子信息技术 招生专业 计算机科学与技术硕士 计算机技术硕士 软件工程硕士 人工智能硕士 大数据技术与工程硕士 计算机科学与技术博士 人工智能博士 新一代电子信息技术（含量子技术等）硕士 软件工程博士 计算机技术博士 新一代电子信息技术（含量子技术等）博士 低空技术与工程硕士 研究生招生 致报考学生： 团队研究定位是针对行业领域以及实际应用中的技术难题，凝练科学问题进行研究，在解决问题的过程中，探索新发现。招收致力于多模态数据分析、计算机视觉以及机器学习领域理论研究和关键技术突破的研究生， 具有踏实肯干的精神和乐观积极的心态，以及善于沟通与交流的能力。 NEWS: 欢迎参加2023年计算机学院全国优秀大学生暑期夏令营的同学们提前邮件联系！ (A) 本人常年招收博士研究生(直博/硕博连读：每年2名，申请考核：每年1名 ）欢迎数学 / 信息与计算科学 / 计算机科学与技术等专业同学咨询； (B) 本人常年招收硕士研究生(每年 5 名)，欢迎 数学 / 信息与计算科学 / 计算机科学与技术相关专业的同学报考； 科研项目 主持国家科技部、国家自然科学基金项目、北京市自然科学基金项目、 教育部-中国移动科研基金、 基本科研业务费重点项目等多项科研基金项目； 主要科研项目列表如下： “数据-模型-知识”增强的多模态基础模型学习与压缩关键技术       科技创新2030-“新一代人工智能”重大项目课题     主持（在研） 北京市自然科学-小米创新联合基金 重点项目 基于VLA及强化学习后训练的闭环端到端自动驾驶研究， 主持课题，在研； 弱监督学习框架下图像视觉显著性分析与语义分割关键技术研究    国家自然基金面上项目    主持 （在研） 隧道衬砌病害分割模型优化  自然科学横向课题  主持 （在研） 轨道交通智能运维大数据挖掘关键算法研究 自然科学横向课题  主持  （ 在研） 弱监督学习框架下图像显著性检测与分割关键技术研究  北京市自然科学基金面上项目  主持 （已结题） 跨视域特定场景火灾烟雾识别与关联性预测   高等学校基本科研项目专题项目    主持   （已结题） 智能安防中的视频数据保护及跨时空跨媒体信息关联技术研究  教育部-中国移动科研基金项目  主持   （已结题） 基于内容的图像与文本安全识别     教育部-中国移动科研基金项目 主持 （已结题） 红果园：复杂网络交互环境高速数据录取与智能分析系统，2013-11-30--2016-12-31，120.0万元，参加 （已结题） 国家自然科学基金“面上”：基于上下文感知的互联网社群图像语义理解，2013-01-01--2016-12-31，80.0万元，主持 （已结题） 基本科研业务费：基于组合地图的图像匹配与检索算法研究，2012-03-01--2014-02-28，8.0万元，参加 （已结题） 其它部市：基于视觉感知的3D内容视觉显著对象提取，2012-01-01--2013-12-31，3.0万元，主持 （已结题） 其它：基于多示例多标记学习的图像自动标注及分类算法研究，2012-01-01--2013-12-31，5.0万元，参加 （已结题） 基本科研业务费：基于视觉注意力机制的3D视觉搜索模型研究，2011-07-01--2014-06-30，7.0万元，主持 （已结题） 基本科研业务费：海量图像语义标注及情感分类算法研究，2011-07-01--2014-06-30，7.0万元，参加 （已结题） 国家自然科学基金“重点”：基于认知模型的图像不变特征理论和关键技术，2011-01-01--2014-12-31，90.0万元，参加 （已结题） 国家自然科学基金“面上”：基于视觉感知的中国书画图像语义自动分类研究，2010-01-01--2012-12-31，7.5万元，参加 （已结题） 基本科研业务费：基于视知觉的图像层次化语义标注算法研究，2009-12-01--2012-12-31，6.0万元，参加 （已结题） 国家自然科学基金“面上”：基于相似性的认知模型与图像分析中的关键问题研究，2009-01-01--2011-12-31，50.0万元，参加 （已结题） 北京交通大学：基于语义网络的数字博物馆分布式体系架构研究，2009-01-01--2010-12-31，20.0万元，参加 （已结题） 国家自然科学基金“面上”：基于颜色不变性描述的图像自动语义标注研究，2009-01-01--2011-12-31，19.0万元，主持 （已结题） 校科技基金：基于颜色不变描述的图像语义标注研究，2007-12-01--2009-12-31，2.0万元，主持 （已结题） 科技部“863”：基于视觉感知的智能计算模型及其关键技术研究，2007-07-12--2009-12-31，86.0万元，参加 （已结题） 教学工作 本科生教学工作： 计算机主干课程《C语言程序设计》 本科生课程《计算机视觉基础》 研究生教学工作： 博士研究生课程《视觉认知与视觉媒体计算》课程负责人 硕士研究生课程《机器视觉基础》课程负责人 论文/期刊 Ziyu Feng, Bing Li, Congyan Lang*, Zheming Xu, Haina Qin, Juan Wang, Weihua Xiong. Accelerated Self-Supervised Multi-Illumination Color Constancy with Hybrid Knowledge Distillation[C]// IEEE Transactions on Pattern Analysis and Machine Intelligence. T-PAMI 2025. (CCF A) Lili Wei, Congyan Lang*， Ziyi Chen, Tao Wang, Yidong Li, Jun Liu. Generated and Pseudo Content guided Prototype Refinement for Few-shot Point Cloud Segmentation[J]. Advances in Neural Information Processing Systems. NeurIPS 2024. (CCF A) Zheming Xu, He Liu, Congyan Lang*, Tao Wang, Yidong Li, Michael Kampffmeyer. A Hubness Perspective on Representation Learning for Graph-Based Multi-View Clustering[C]//Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. CVPR 2025. (CCF A) Xinyu Sun, Zhikun Zhao, Congyan Lang*, Bing Li, Juan Wang. Multimodal Large Language Model-Guided ISP Hyperparameter Optimization with Dynamic Preference Learning [C]//Proceedings of the IEEE/CVF International Conference on Computer Vision. ICCV 2025. (CCF A) Xuechao Zou, Yue Li, Shun Zhang, Kai Li, Shiying Wang, Pin Tao, Junliang Xing, Congyan Lang*. Dynamic Dictionary Learning for Remote Sensing Image Segmentation[C]//Proceedings of the IEEE/CVF International Conference on Computer Vision. ICCV 2025. (CCF A) Xinyu Sun, Zhikun Zhao, Lili Wei,  Congyan Lang*, Mingxuan Cai, Longfei Han, Juan Wang, Bing Li, Yuxuan Guo:RL-SeqISP: Reinforcement Learning-Based Sequential Optimization for Image Signal Processing. AAAI 2024: 5025-5033  (CCF A类) Ziyu Feng, Zheming Xu, Haina Qin,  Congyan Lang*, Bing Li, Weihua Xiong: SMM: Self-supervised Multi-Illumination Color Constancy Model with Multiple Pretext Tasks. ACM Multimedia 2023: 8653-8661 (CCF A类) Yutong Gao, Liqian Liang,  Congyan Lang*, et al. Clicking Matters: Towards Interactive Human Parsing. IEEE Transactions on Multimedia (TMM), 2023，25:3190-3203. (Q1) Yutong Gao,  Congyan Lang*, et al. Dynamic Interaction Dilation for Interactive Human Parsing. IEEE Transactions on Multimedia (TMM), 2023,1-12.(Q1) Ziyi Chen, Yutong Gao,  Congyan Lang*, Lili Wei, Yidong Li, Hongzhe Liu, Fayao Liu: Integrating topology beyond descriptions for zero-shot learning. Pattern Recognit. 143: 109738 (2023) (Q1) Zheming Xu, Lili Wei, Congyan Lang*, Songhe Feng, Tao Wang,  SSR-Net: A Spatial Structural Relation Network for Vehicle Re-identification. ACM Trans. Multim. Comput. Commun. Appl. 19(6): 216:1-216:22 (2023) Yutong Gao, Congyan Lang*, Liqian Liang, Yunchao Wei, Yidong Li.  Clicking Matters: Towards Interactive Human Parsing. IEEE Trans. on Multimedia, 2022. (CCF B类, Early Access) Zun Li, Congyan Lang*, Jun Hao Liew, Yidong Li, Qibin Hou, Jiashi Feng:Cross-Layer Feature Pyramid Network for Salient Object Detection. IEEE Trans. On Image Process. 30: 4587-4598 (2021) (CCF A类) Liqian Liang, Congyan Lang*, Yidong Li, Songhe Feng, Jian Zhao. Fine-Grained Facial Expression Recognition in the Wild. IEEE Trans. on Information Forensics and Security, 16(1), pp. 482-494, 2021. (CCF A类) Zun Li, Congyan Lang*, Liqian Liang, Jian Zhao, Songhe Feng, Qibin Hou, Jiashi Feng. Dense Attentive Feature Enhancement for Salient Object Detection. IEEE Trans. on Circuits and Systems for Video Technology, 2021. (CCF B类, Early Access) Min Wang, Congyan Lang*, Liqian Liang, Songhe Feng, Tao Wang, Yutong Gao. Fine-Grained Semantic Image Synthesis with Object Attention Generative Adversarial Network. ACM Trans. on Intelligent Systems and Technology, 12(5), pp. 1-18, 2021. Min Wang, Congyan Lang*, Liqian Liang, Yutong Gao, Songhe Feng, Tao Wang. End-to-End Text-to-Image Synthesis with Spatial Constraints. ACM Trans. on Intelligent Systems and Technology, 11(4): 47:1-47:19, 2020. Min Wang, Congyan Lang*, Songhe Feng, Tao Wang, Yi Jin, Yidong Li. Text to Photo-Realistic Image Synthesis via Chained Deep Recurrent Generative Adversarial Network. Journal of Visual Communication ans Image Representation, 74(1), 2021. (CCF C类) Gengyu Lyu^, Songhe Feng, Tao Wang, Congyan Lang,, Yidong Li. GM-PLL: Graph Matching based Partial Label Learning.  IEEE Trans. on Knowledge and Data Engineering, 33(2), pp. 521-535, 2021. (CCF A类) Gengyu Lyu^, Songhe Feng, Yi Jin, Tao Wang, Congyan Lang,, Yidong Li. Prior Knowledge Regularized Self-Representation Model for Partial Multi-Label Learning. IEEE Trans. on Cybernetics, 2021. (CCF B类, Early Access) Lijuan Sun^, Songhe Feng, Jun Liu, Gengyu Lyu, Congyan Lang,. Global-Local Label Correlation for Partial Multi-Label Learning. IEEE Trans. on Multimedia, 2021. (CCF B类, Early Access) Zun Li, Congyan Lang*,Jiashi Feng, Yidong Li, Tao Wang, Songhe Feng. Co-Saliency Detection with Graph Matching. ACM Trans. on Intelligent System and Technology, 10(3), 22:1-22:22, 2019. Min Wang, Congyan Lang*, Songhe Feng, Tao Wang, Yi Jin, Yidong Li. Text to Photo-Realistic Image Synthesis via Chained Deep Recurrent Generative Adversarial Network. Journal of Visual Communication ans Image Representation, 74(1), 2021. (CCF C类) Min Wang, Congyan Lang*, Liqian Liang, Gengyu Lyu, Songhe Feng, Tao Wang. Class-balanced Text to Image Synthesis with Attentive Generative Adversarial Network. IEEE Multimedia, 28(3), pp. 21-31, 2021. Tao Wang, Haibin Ling, Congyan Lang, Songhe Feng. Graph Matching with Adaptive and Branching Path Following.  IEEE Trans. on Pattern Analysis and Machine Intelligence, 40(12), pp. 2853-2867, 2018. (CCF A类) Jianshu Li, Jian Zhao, Congyan Lang, Yidong Li, Yunchao Wei, Guodong Guo, Terence Sim, Shuicheng Yan, Jiashi Feng:Multi-human Parsing with a Graph-based Generative Adversarial Model. ACM Trans. Multim. Comput. Commun. Appl. 17(1): 29:1-29:21 (2021) Yanan Dong, Congyan Lang, Songhe Feng:General structured sparse learning for human facial age estimation. Multimedia Syst. 25(1): 49-57 (2019) Lijuan Sun, Songhe Feng, Tao Wang, Congyan Lang, Yi Jin. Partial Multi-Label Learning by Low-Rank and Sparse Decomposition. AAAI, 2019. (CCF A类) Tao Wang, Haibin Ling, Congyan Lang, Songhe Feng. Graph Matching with Adaptive and Branching Path Following.  IEEE Trans. on Pattern Analysis and Machine Intelligence, 40(12), pp. 2853-2867, 2018. (CCF A类) Tao Wang, Haibin Ling, Congyan Lang. Path Following with Adaptive Path Estimation for Graph Matching. AAAI, pp. 3625-3631, 2016. (CCF A类) 专著/译著 郎丛妍.The Use of Fuzzy information Granular for Content Representation of Video Sequences[M]。，Springer Verlag，Heidelberg，Germany，2007-02 专利 1. 郎丛妍、何伟名、于兆鹏、冯松鹤，基于低秩矩阵分解的文章话题关键词提取方法和装置 专利权人：北京交通大学 专利号：201610218407",
  "content_length": 11489,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:02"
}