{
  "name": "Congming Gao",
  "homepage": "https://gaocm.github.io",
  "status": "success",
  "content": "Congming Gao - Xiamen University Welcome to Congming Gao's Homepage! Congming Gao Ph.D., Associate Professor School of Information Science, Institute of Artificial Intelligence, Xiamen University Contact Information: Email: gaocm@xmu.edu.cn; gaocm92@gmail.com Address: Room 227, Building #3, School of Informatics, Xiang'an Campus, Xiamen University, 361102. News [2025/08]We won the Best Paper Award of IEEE NVMSA 2025 [2025/01]I have been selected for the 10th Young Elite Scientists Sponsorship Program by CAST [2024/12]One paper has been accepted to FAST 2025 [2024/08]One paper has been accepted to ACM TACO [2024/08]We won the Best Paper Award of IEEE NVMSA 2024 [2024/07]One paper has been accepted to MICRO 2024 [2024/07]One paper has been accepted to ACM TOS [2024/04]One paper has been accepted to Springer JSA [2024/03]One paper has been accepted to ACM TOS [2023/12]One paper has been accepted to ACM TACO [2023/11]One paper has been accepted to DATE 2024 [2023/10]One paper has been accepted to HPCA 2024 [2023/10]One paper has been accepted to ISPA 2023 [2023/09]One paper has been accepted to ASP-DAC 2024 [2023/02]One paper has been accepted to DAC 2023 [2022/11]One paper has been accepted to DATE 2023 (Extended Abstract) [2022/10]One paper has been accepted to HPCA 2023 [2022/09]One paper has been accepted to IEEE TCAD [2021/08]One proposal is funded by National Natural Science Foundation of China (Youth Program) [2021/08]One paper has been accepted to ACM TOS [2021/07]One paper has been accepted to MICRO 2021 [2021/06]One proposal is funded by China Postdoctoral Science Foundation (Special Program) [2020/12]One paper has been accepted to FAST 2021 [2020/10]One proposal is funded by China Postdoctoral Science Foundation (General Program) [2020/09]One paper has been accepted to Journal of Computer Research and Development [Biography] [Research] [Publications] [Awards] [Activities] [Visitors] Biography Congming GAO is currently an Associate Professor with the School of Information Science, Xiamen University, Xiamen, China. He was a Postdoctoral Researcher with the Department of Computer Science and Technology, Tsinghua University. He received the Ph.D. degree in Computer Science with the College of Computer Science, Chongqing University, Chongqing, China. He was a Research Assistant with the Department of Computer Science, City University of Hong Kong (CityU), Kowloon, Hong Kong. He was a Visiting Researcher with the Department of Electrical and Computer Engineering, University of Pittsburgh (PITT), Pittsburgh, PA, USA. Research My research topics include Flash Memory, Embedded System and Emerging Non-volatile Memory. Publications (*:Corresponding Author) Conference Papers: (C27) Dingcui Yu, Zonghuan Yan, Yunpeng Song, Yanyun, Wang, Xinghui, Duan, Congming Gao, Yina Lv, Liang Shi. \"ZoneFit: Enabling Zoned Flash Benefits via Granularity-Matched SLC Management\" (The 14th IEEE Non-Volatile Memory Systems and Applications Symposium, NVMSA'25, August 2025.) (Best Paper Award) (C26) Chao Wu, Cheng Ji*, Congming Gao*, Zongwei Zhu, Weichao Guo, Chao Yu, Li-Pin Chang and Yanzhi Wang. \"MedFS: Pursuing Low Update Overhead via Metadata-Enabled Delta Compression for Log-structured File System on Mobile Device\" (The 23rd USENIX Conference on File and Storage Technologies, FAST'25, February 2025.) (CCF-A) (C25) Xufeng Yang, Jiancong Zheng and Congming Gao*. \"In-place Switch: Reprogramming based SLC Cache Design for Hybrid 3D SSDs\" (The 17th International Conference on Networking, Architecture, and Storage, NAS'24, November 2024.) (C24) Jian Chen, Congming Gao*, Youyou Lu, Yuhao Zhang and Jiwu Shu*. \"Ares-Flash: Efficient Parallel Integer Arithmetic Operations Using NAND Flash Memory\" (The 57th IEEE/ACM International Symposium on Microarchitecture, MICRO'24, November 2024.) (CCF-A) (C23) Yumiao Zhao, Jiancong Zheng, Gangyong Jia, Liang Shi and Congming Gao*. \"Hook: A Pattern Locality Guided Prefetch with Enhanced Read Performance for Hybrid SSDs\" (The 13th IEEE Non-Volatile Memory Systems and Applications Symposium, NVMSA'24, August 2024.) (Best Paper Award) (C22) Zhenhua Tan, Linbo Long, Jingcheng Shen, Congming Gao, Renping Liu and Yi Jiang. \"Para-ZNS: Improving Small-zone ZNS SSDs Parallelism through Dynamic Zone Mapping\" (The Design, Automation & Test in Europe Conference & Exhibition, DATE'24, March 2024.) (C21) Qiao Li, Hongyang Dang, Zheng Wan, Congming Gao*, Min Ye, Jie Zhang, Tei-Wei Kuo and Chun Jason Xue. \"Midas Touch: Invalid-Data Assisted Reliability and Performance Boost for 3D High-Density Flash\" (The IEEE International Symposium on High-Performance Computer Architecture, HPCA'24, March 2024.) (CCF-A) (C20) Tianmeng Zhang, Renhui Chen, Congming Gao*, Youtao Zhang, Jun Yang and Jiwu Shu. \"Libra: A Space-Efficient, High-Performance Inline Deduplication for Emerging Hybrid Storage System\" (The IEEE International Symposium on Parallel & Distributed Processing with Applications, ISPA'23, December 2023.) (C19) Jingcheng Shen, Lang Yang, Linbo Long, Renping Liu, Zhenhua Tan, Congming Gao and Yi Jiang. \"Overlapping Aware Zone Allocation for LSM Tree-Based Store on ZNS SSDs\" (The Asia and South Pacific Design Automation Conference, ASP-DAC'24, January 2024.) (C18) Mengquan Li, Chao Wu, Congming Gao, Cheng Ji and Kenli Li. \"RLAlloc: A Deep Reinforcement Learning-Assisted Resource Allocation Framework for Enhanced Both I/O Throughput and QoS Performance of Multi-Streamed SSDs\" (The Design Automation Conference, DAC'23, July 2023.) (CCF-A) (C17) Zhenhua Tan, Linbo Long, Renping Liu, Congming Gao, Yi Jiang and Yan Liu. \"Optimizing Data Migration for Garbage Collection in ZNS SSDs\" (The Design, Automation & Test in Europe Conference & Exhibition, DATE'23, April 2023.) (C16) Yina Lv, Liang Shi, Qiao Li, Congming Gao, Yunpeng Song, Longfei Luo, Youtao Zhang. \"MGC: Multiple-Gray-Code for 3D NAND Flash based High-Density SSDs\" (The 29th IEEE International Symposium on High-Performance Computer Architecture, HPCA'23, March 2023.) (CCF-A) (C15) Congming Gao, Xin Xin, Youyou Lu, Youtao Zhang, Jun Yang and Jiwu Shu. \"ParaBit: Processing Parallel Bitwise Operations in NAND Flash Memory based SSDs\" (The 54st Annual IEEE/ACM International Symposium on Microarchitecture, MICRO'21, October 2021.) (CCF-A) (C14) Cheng Ji, Li-Pin Chang, Riwei Pan, Chao Wu, Congming Gao, Liang Shi, Tei-Wei Kuo and Chun Jason Xue. \"Pattern-Guided File Compression with User-Experience Enhancement for Log-Structured File System on Mobile Devices\" (The 19th USENIX Conference on File and Storage Technologies, FAST'21, February 2021.) (CCF-A) (C13) Congming Gao, Min Ye, Qiao Li, Chun Jason Xue, Youtao Zhang, Liang Shi and Jun Yang. \"Constructing Large, Durable and Fast SSD System via Reprogramming 3D TLC Flash Memory\" (The 52nd IEEE/ACM International Symposium on Microarchitecture, MICRO'19, October 2019.) (Alibaba Cloud-CCF Storage Committee Outstanding Paper Award, CCF-A) (C12) Cheng Ji, Lun Wang, Qiao Li, Congming Gao, Liang Shi, Chia-Lin Yang and Chun Jason Xue. “Fair Down to the Device: A GC-Aware Fair Scheduler for SSD”. (The 8th IEEE Non-Volatile Memory Systems and Applications Symposium, NVMSA’19, August 2019.) (C11) Yina Lv, Liang Shi, Qiao Li, Congming Gao, Chun Jason Xue and Edwin Sha. “Optimizing Tail Latency of LDPC based Flash Memory Storage Systems Via Smart Refresh”. (The 14th International Conference on Networking, Architecture, and Storage, NAS’19, August 2019.) (C10) Congming Gao,Liang Shi, Chun Jason Xue, Jun Yang and Youtao Zhang. “Parallel all the time: Plane Level Parallelism Exploration for High Performance SSDs”. (The 35th International Conference on Massive Storage Systems and Technology, MSST’19, May 2019.) (Alibaba Cloud-CCF Storage Committee Outstanding Paper Award) (C9) Qi Li, Aosong Deng, Congming Gao, Yu Liang, Liang Shi and Edwin Sha. “Optimizing Fragmentation and Segment Cleaning for CPS based Storage Devices”. (The 34th ACM/SIGAPP Symposium On Applied Computing SAC'19, April, 2019.) (C8) Congming Gao, Yejia Di, Aosong Deng, Duo Liu, Cheng Ji, Chun Jason Xue and Liang Shi. “Flash Friendly File System Aware Mapping Cache Design on Solid State Drives”. (The 7th IEEE Non-Volatile Memory Systems and Applications Symposium NVMSA'18, August, 2018.) (C7) Yejia Di, Liang Shi, Congming Gao, Qiao Li and Chun Jason Xue. “Revisiting Wear Leveling Design on Compression Applied 3D NAND Flash Memory: work-in-progress”, (The 2018 International Conference on Hardware/Software Codesign and System Synthesis (CODES+ISSS)'18, October, 2018.) (C6) Congming Gao, Liang Shi, Yejia Di, Qiao Li, Chun Jason Xue and Edwin H.-M. Sha. \"An Efficient Cache Management Scheme for Capacitor Equipped Solid State Drives\". (The 2018 Great Lakes Symposium on VLSI, GLSVLSI’18, May 2018.) (C5) Yejia Di, Liang Shi, Congming Gao, Qiao Li, Kaijie Wu and Chun Jason Xue. \"Loss is Gain: Shortening Data for Lifetime Improvement on Low-Cost ECC Enabled Consumer-Level Flash Memory\". (The 2018 Great Lakes Symposium on VLSI, GLSVLSI’18, May 2018.) (C4) Yejia Di, Liang Shi, Congming Gao, Kaijie Wu, Chun Jason Xue and Edwin H.-M. Sha. \"Minimizing cell-to-cell interference by exploiting differential bit impact characteristics of scaled MLC NAND flash memories\". (The 5th Non-Volatile Memory Systems and Applications Symposium, NVMSA’16, June 2016.) (C3) Qiao Li, Liang Shi, Congming Gao, Kaijie Wu, Jason Chun Xue, Qingfeng Zhuge and H.-M. Edwin Sha. \"Maximizing IO Performance via Conflict Reduction for Flash Memory Storage Systems\". (The 2015 Design, Automation & Test in Europe Conference, DATE’15, March 2015.) (C2) Congming Gao, Liang Shi, Kaijie Wu, Chun Jason Xue, and Edwin H.-M. Sha. \"Exploit Asymmetric Error Rates of Cell States to Improve the Performance of Flash Memory Storage Systems\". (The 32nd IEEE International Conference on Computer Design, ICCD’14, October 2014.) (C1) Congming Gao, Liang Shi, Mengying Zhao, Chun Jason Xue, Kaijie Wu, and Edwin Sha. \"Exploiting Parallelism in IO",
  "content_length": 16470,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:03"
}