{
  "name": "Cong Wang 0001",
  "homepage": "https://www.cs.cityu.edu.hk/~congwang",
  "status": "success",
  "content": "Cong WANG Cong WANG Professor, Fellow of the IEEE Department of Computer Science City University of Hong Kong Office: Y6313, Yeung Kin Man Academic Building (AC1) Phone: +852 3442 2010 Fax: +852 3442 0503 Email: congwang at cityu.edu.hk Overview I am interested in developing secure software systems with theoretical security / privacy guarantee and practical performance. My recent work has focused on data security (e.g., encrypted databases, multi-party encrypted analytics, proofs of remote storage, etc.), AI systems and security (e.g., red teaming for LLM, federated (un)learning, robust reinforcement learning, etc.), privacy-enhancing technologies (e.g., encrypted messaging and metadata privacy, anonymous communications, encrypted network middleboxes, etc.), blockchain and decentralised applications (e.g., decentralized storage auditing, on-chain/off-chain interoperability, consensus designs, etc.), and software security and systems (e.g., hardware-assisted security, anti-fuzzing techniques, boosting performance of deep learning clusters, etc.). Please refer to the following links and the group website for more details. Google Scholar | ORCID | Scopus | CityU Scholar Selected Publications (Full List) Data security and privacy ESORICS'24 Nemesis: Combating Abusive Information in Encrypted Messaging with Private Reporting. The 29th European Symposium on Research in Computer Security (ESORICS'24), Bydgoszcz, 16 September-20 September, 2024. Rui Lian, Yulong Ming, Chengjun Cai, Yifeng Zheng, Cong Wang, and Xiaohua Jia. VLDB'24 SWAT: A System-Wide Approach to Tunable Leakage Mitigation in Encrypted Data Stores. 50th International Conference on Very Large Databases (VLDB'24), Guangzhou, China, August 26-30, 2024. Leqian Zheng, Lei Xu, Cong Wang, Sheng Wang, Yuke Hu, Zhan Qin, Feifei Li, and Kui Ren. ICDCS'24 HiddenTor: Toward a User-Centric and Private Query System for Tor BridgeDB. The 44th IEEE International Conference on Distributed Computing Systems (ICDCS'24), Jersey City, New Jersey, 23-26 July, 2024. Yichen Zang, Chengjun Cai, Wentao Dong, Lei Xu, and Cong Wang. CCS'23 Leakage-Abuse Attacks Against Forward and Backward Private Searchable Symmetric Encryption. The 30th ACM Conference on Computer and Communications Security (CCS'23), Copenhagen, Denmark, November 26-30, 2023. Lei Xu, Leqian Zheng, Chengzhi XU, Xinliang Yuan, and Cong Wang. NSDI'23 Boomerang: Metadata-Private Messaging under Hardware Trust. The 20th USENIX Symposium on Networked Systems Design and Implementation (NSDI'23), Boston, Ma, April 17-19, 2023. Peipei Jiang, Wang Qian, Jianhao Chen, Cong Wang, Lei Xu, Xinyu Wang, Yihao Wu, Xiaoyuan Li, and Kui Ren. TDSC Aggregation Service for Federated Learning: An Efficient, Secure, and More Resilient Realization. IEEE Transactions on Dependable and Secure Computing (TDSC), vol. 20, no. 2, pp. 988–1001, March–April, 2023. Yifeng Zheng, Shangqi Lai, Yi Liu, Xingliang Yuan, Xun Yi, and Cong Wang. CCS'22 Vizard: A Metadata-hiding Data Analytics System with End-to-End Policy Controls. The 29th ACM Conference on Computer and Communications Security (CCS'22), Los Angeles, USA, November 7-12, 2022. Chengjun Cai, Yichen Zang, Cong Wang, Xiaohua Jia, and Qian Wang. CCS'19 LightBox: Full- stack Protected Stateful Middlebox at Lightning Speed. The 26th ACM Conference on Computer and Communications Security (CCS'19), London, UK, November 11-15, 2019. Huayi Duan, Cong Wang, Xingliang Yuan, Yajin Zhou, Qian Wang, and Kui Ren. TC Privacy-Preserving Public Auditing for Secure Cloud Storage. IEEE Transactions on Computers (TC), vol. 62, no. 2, pp. 362–375, February, 2013. Cong Wang, Sherman S.M. Chow, Qian Wang, Kui Ren, and Wenjing Lou. AI security KDD'24 BadSampler: Harnessing the Power of Catastrophic Forgetting to Poison Byzantine-robust Federated Learning. ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD'24), Barcelona, 25-29 August, 2024. Yi Liu, Xingliang Yuan, and Cong Wang. MM'24 Arondight: Red Teaming Large Vision Language Models with Auto-generated Multi-modal Jailbreak Prompts. The 32nd ACM International Conference on Multimedia(MM'24), Melbourne, 28 October.-1 November, 2024. Yi Liu, Chengjun Cai, Xiaoli Zhang, Xingliang Yuan, and Cong Wang. IJCAI'24 Constrained Intrinsic Motivation for Reinforcement Learning. The 33rd International Joint Conference on Artificial Intelligence (IJCAI'24), Jeju, Korea, Aug 03-09, 2024. Xiang Zheng, Xinjun Ma, Shengjie Wang, Xinyu Wang, Chao Shen, and Cong Wang. DSN'24 Toward Evaluating Robustness of Reinforcement Learning with Adversarial Policy. The 54th Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN'24), Brisbane, Australia, June 24-27, 2024. Xiang Zheng, Xinjun Ma, Chao Shen, and Cong Wang. USENIX Security'24 More Simplicity for Trainers, More Opportunity for Attackers: Black-Box Attacks on Speaker Recognition Systems by Inferring Feature Extractor. The 33rd USENIX Security Symposium (USENIX Security’24), Philadephia, PA, August 14-16, 2024. Yunjie Ge, Pinji Chen, Qian Wang, Lingchen Zhao, Ningping Mou, Peipei Jiang, Cong Wang, Qi Li, and Chao Shen. TIFS Proof of Unlearning: Definitions and Instantiation. IEEE Transactions on Information Forensics and Security (TIFS), vol. 19, pp.3309–3323, January, 2024. Jia-Si Weng, Shenglong Yao, Yuefeng Du, Junjie Huang, Jian Weng, and Cong Wang. SIGIR'23 Poisoning Self-supervised Learning Based Sequential Recommendations. Proceedings of the 46th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR'23), pp. 300-310, Taipei, July 23-27, 2023. Yanling Wang, Yuchen Liu, Qian Wang, Cong Wang, and Chenliang Li. ICLR'23 Bayes-MIL: A New Probabilistic Perspective on Attention-based Multiple Instance Learning for Whole Slide Images. The 11th International Conference on Learning Representations (ICLR’23), Kigali Rwanda, May 1-5, 2023. Yufei Cui, Ziquan Liu, Xiangyu Liu, Xue Liu, Cong Wang, Tei-Wei Kuo, Jason Xue Chun, and Antoni B. Chan. WWW'23 NetGuard: Protecting Commercial Web APIs from Model Inversion Attacks using GAN-generated Fake Samples. The Web Conference (WWW’23), Texas, TX, April 30-May 4, 2023. Xueluan Gong, Ziyao Wang, Yanjiao Chen, Qian Wang, and Cong Wang. NeurIPS'22 Amplifying Membership Exposure via Data Poisoning. The 36th Conference on Neural Information Processing Systems (NeurIPS), 29 Nov - 1 Dec, Vitual, 2022. Yufei Chen, Chao Shen, Cong Wang, and Yang Zhang. USENIX Security'22 Teacher Model Fingerprinting Attacks Against Transfer Learning. The 31st USENIX Security Symposium (USENIX Security'22), Boston, MA, USA, August 10-12, 2022. Yufei Chen, Chao Shen, Cong Wang, and Yang Zhang. INFOCOM'22 The Right to be Forgotten in Federated Learning: An Efficient Realization with Rapid Retraining. The 41st IEEE Conference on Computer Communications (INFOCOM'22), Virtual, May 2-5, 2022. Yi Liu, Lei Xu, Xingliang Yuan, Cong Wang, and Bo Li. CCS'21 Black-box Adversarial Attacks on Commercial Speech Platforms with Minimal Information. The 28th ACM Conference on Computer and Communications Security (CCS'21), Republic of Korea, November 15-19, 2021. Baolin Zheng, Peipei Jiang, Qian Wang, Qi Li, Chao Shen, Cong Wang, Yunjie Ge, Qingyang Teng, and Shenyi Zhang. ICML'21 CARTL: Cooperative Adversarially-Robust Transfer Learning. The 38th International Conference on Machine Learning (ICML'21), Virtual, July 18-24, 2021. Dian Chen, Hongxin Hu, Qian Wang, Yinli Li, Cong Wang, Chao Shen, and Qi Li. PIEEE The Security of Autonomous Driving: Threats, Defenses, and Future Directions. Proceedings of the IEEE, vol. 108, no. 2, pp. 357–372, February, 2020. Kui Ren, Qian Wang, Cong Wang, Zhan Qin, and Xiaodong Lin. Software security and systems OJCS ShadowBug: Enhanced Synthetic Fuzzing Benchmark Generation. IEEE Open Journal of the Computer Society (OJCS), vol.5, pp. 95 – 106, March, 2024. Zhengxiang Zhou and Cong Wang. EMNLP'23 Adaptive Gating in Mixture-of-Experts based Language Models. The 2023 Conference on Empirical Methods in Natural Language Processing (EMNLP'23), Singapore, 6-10 December, 2023. Jiamin Li, Qiang Su, Yitao Yang, Yimin Jiang, Cong Wang, and Hong Xu. USENIX Security'23 MorFuzz: Fuzzing Processor via Runtime Instruction Morphing enhanced Synchronizable Co-simulation. The 32nd USENIX Security Symposium (USENIX Security 2023), Anaheim, CA, August 9-11, 2023. Jinyan Xu, Yiyuan Liu, Sirui He, Haoran Lin, Yajin Zhou, and Cong Wang. USENIX ATC'23 Accelerating Distributed MoE Training and Inference with Lina. The 2023 USENIX Annual Technical Conference (USENIX ATC'23), pp. 945-959, Boston, 10–12 July, 2023. Jiamin Li, Yimin Jiang, Yibo Zhu, Cong Wang, and Hong Xu. EuroSys'23 Lyra: Elastic Scheduling for Deep Learning Clusters. The 18th European Conference on Computer Systems (EuroSys), pp. 835-850, Rome, May 8-12, 2023. Jiamin Li, Yimin Jiang, Yibo Zhu, Cong Wang, and Hong Xu. OJCS Practical Anti-Fuzzing Techniques With Performance Optimization. IEEE Open Journal of the Computer Society (OJCS), vol. 4, pp. 206–217, August, 2023. Zhengxiang Zhou and Cong Wang. USENIX Security'22 SGXLock: Towards Efficiently Establishing Mutual Distrust Between Host Application and Enclave for SGX. The 31st USENIX Security Symposium (USENIX Security'22), Boston, MA, USA, August 10-12, 2022. Yuan Chen, Jiaqi Li, Guorui Xu, Yajin Zhou*, Zhi Wang, Cong Wang, and Kui Ren. TOSEM Time-Travel Investigation: Towards Building A Scalable Attack Detection Framework on Ethereum. ACM Transactions on Software Engineering and Methodology (TOSEM), vol. 31, no. 3, pp. 54:1– 54:33, September 2022. Siwei Wu, Lei Wu, Yajin Zhou, Runhuai Li, Zhi Wang, Xiapu Luo, Cong Wang, Kui Ren. TDSC WebEnclave: Protect Web Secrets from Browser Extensions with Software Enclave. IEEE Transactions on Dependable and Secure Computing (TDSC), vol. 19, no. 5, pp. 3055-3070, September–October, 2022. Xinyu Wang, Yuefeng Du, Cong Wang, Qian Wang, and Liming Fang. ICPADS'18 Towards Privacy-Pr",
  "content_length": 20018,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:02"
}