{
  "name": "Constantinos Daskalakis",
  "homepage": "http://people.csail.mit.edu/costis",
  "status": "success",
  "content": "Constantinos Daskalakis Homepage Constantinos Daskalakis Avanessians Professor of Computer Science, EECS and CSAIL, MIT main academic work contact (image credits: Sarah A. King for this article) I am the Avanessians Professor of Computer Science at MIT's Electrical Engineering and Computer Science department of the Schwarzmann College of Computing. I am a member of CSAIL, and affiliated with LIDS and ORC. I am also an investigator in the NSF-funded Foundations of Data Science Institute. I am a co-founder and chief scientist of Archimedes AI research center. [Short Bio] [Honors and Awards] Constantinos (aka \"Costis\" with an accent on 'i') Daskalakis is the Avanessians Professor of Electrical Engineering and Computer Science at MIT. He holds a Diploma in Electrical and Computer Engineering from the National Technical University of Athens, and a PhD in Electrical Engineering and Computer Science from UC Berkeley. He works on Computation Theory and its interface with Game Theory, Economics, Probability Theory, Machine Learning and Statistics. He has resolved long-standing open problems about the computational complexity of Nash equilibrium, and the mathematical structure and computational complexity of multi-item auctions. His current work focuses on multi-agent learning, high-dimensional statistics, learning from biased and dependent data, causal inference and econometrics. He has been honored with the ACM Doctoral Dissertation Award, the Kalai Prize from the Game Theory Society, the Sloan Fellowship in Computer Science, the SIAM Outstanding Paper Prize, the Microsoft Research Faculty Fellowship, the Simons Investigator Award, the Rolf Nevanlinna Prize from the International Mathematical Union, the ACM Grace Murray Hopper Award, the Bodossaki Foundation Distinguished Young Scientists Award, the ACM SIGECOM Test of Time Award, and the FOCS 2022 Test of Time Award. He is an ACM fellow, holds honorary doctorates from the University of Patras and the University of Piraeus, and was awarded the Golden Cross of the Order of the Redeemer by the Greek Presidency. He has served in the scientific and advisory board of the Simons Institute for the Theory of Computing (2018-2020), and as the head of the theory of computation group at MIT (2018-2022). He is a co-founder of Archimedes AI research center where he maintains the role of chief scientist. He chaired the AI strategy committee for the Greek Prime Minister. 2024 Honorary Doctorate University of Piraeus 2023 Honorary Doctorate University of Patras 2023 ACM Fellow 2022 Golden Cross of the Order of the Redeemer by the Greek Presidency 2022 FOCS Test of Time Award 2022 ACM SIGECOM Test of Time Award 2022 Avanessians Chair of the MIT Schwarzmann College of Computing 2020 Kanellakis Lecture at Brown 2019 Bodossaki Foundation Distinguished Young Scientists Award 2019 MIT EECS Frank Quick Faculty Research Innovation Fellowship 2018 ACM Grace Murray Hopper Award 2018 Rolf Nevanlinna Prize 2018 Simons Investigator Award 2017 Google Faculty Research Award 2015 Research and Development Award by the Giuseppe Sciacca Foundation 2013 Best Paper and Best Student Paper Award in the 14th Conference on Electronic Commerce 2012 Microsoft Research Faculty Fellowship 2012 Best Student Paper Award in the 13th Conference on Electronic Commerce 2011 X-Window Consortium Associate Professor Chair (from MIT) 2011 Ruth and Joel Spira Award for Distinguished Teaching (from MIT) 2011 SIAM Outstanding Paper Prize 2010 Sloan Research Fellowship in Computer Science 2009 NSF Career Award 2008 ACM Doctoral Dissertation Award 2008 Kalai Prize, awarded by the Game Theory Society 2007 Microsoft Research Ph.D. Fellowship 2006 Best Paper Award in the 7th Conference on Electronic Commerce Research Interests: Theory of Computation, and its interface with Economics, Game Theory, Machine Learning, Statistics and Probability Theory teaching 6.S982: Diffusion Models: From Theory to Practice, Spring 2025 6.1220/18.410: Design and Analysis of Algorithms, Fall 2024 6.S896: Algorithmic Statistics, Fall 2023 6.S890: Topics in Multi-Agent Learning, Fall 2023 6.S967: Online Decision Making: Optimization, Control and Games, Spring 2022 6.046/18.410: Design and Analysis of Algorithms, Fall 2021 6.853: Topics in Algorithmic Game Theory: AGT and Data Science, Spring 2021 6.867: Machine Learning, Fall 2020 6.046/18.410: Design and Analysis of Algorithms, Fall 2019 6.890: Learning-Augmented Algorithms, Spring 2019 6.853: Topics in Algorithmic Game Theory: Algorithmic Game Theory and Data Science, Spring 2019 6.046/18.410: Design and Analysis of Algorithms, Fall 2018 6.883: Science of Deep Learning: Bridging Theory and Practice, Spring 2018 6.853: Topics in Algorithmic Game Theory: Algorithmic Game Theory and Data Science, Spring 2017 6.006: Introduction to Algorithms, Spring 2017 6.046/18.410: Design and Analysis of Algorithms, Spring 2016 6.891: Games, Decision, and Computation, Spring 2015 6.046/18.410: Design and Analysis of Algorithms, Fall 2014 6.S080: Introduction to Inference, Spring 2014 6.891: Games, Decision, and Computation, Fall 2013 6.046/18.410: Design and Analysis of Algorithms, Spring 2013 6.006: Introduction to Algorithms, Spring 2012 6.853: Topics in Algorithmic Game Theory, Fall 2011 6.896: Probability and Computation, Spring 2011 6.006: Introduction to Algorithms, Fall 2010 6.896: Topics in Algorithmic Game Theory, Spring 2010 6.006: Introduction to Algorithms, Fall 2009 my students Current PHD students: Fan Chen, Max Fishelson, Charis Pipis, Rui Yao Current and Former Undergraduate/MEng researchers: Angelos Assos, Enrico Micali, Dhruv Rohatgi, Patroklos Stefanou, Rui Yao Graduated students (in order of graduation): Yang Cai (Yale CS and Economics Associate Professor) Matt Weinberg (Princeton CS Assistant Professor) Alan Deckelbaum (Renaissance Technologies) Christos Tzamos (University of Athens Associate Professor of CS) Gautam Kamath (University of Waterloo CS Assistant Professor) Nishanth Dikkala (Google SVC) Manolis Zampetakis (Yale CS Assistant Professor) Yuval Dagan (Tel Aviv University, CS, Assistant Professor) Andrew Ilyas (Postdoc Stanford University → CMU Assistant Professor) Noah Golowich (Postdoc Microsoft Research → Assistant Professor, UT Austin) Vardis Kandiros (Postdoc Columbia University) Postdocs (chronological order): Nick Gravin (Associate Professor, Shanghai University of Finance and Economics) Nima Haghpanah (Assistant Professor, Penn State Economics) Ioannis Panageas (Assistant Professor, University of California, Irvine) Kaiqing Zhang (Assistant Professor, University of Maryland) Chris Harshaw (Assistant Professor, Statistics, Columbia University) Yeshwanth Cherapanamjeri Maria Skoularidou Giannis Daras Brian Zhang service & outreach NPR Planet Money Episodes: Editorial Editorial Board, International Journal of Game Theory (IJGT), 2012-2018 Advisory Editor, Games and Economic Behavior (GEB) Special Issue Editor, Games and Economic Behavior (GEB) special issue for STOC, FOCS, SODA 2013 Special Issue Editor, SIAM Journal on Computing (SICOMP) special issue of STOC 2015 Conference Program Committees: SODA 2008, EC 2009, SAGT 2009, WAOA 2009, STOC 2010, ICALP 2010, EC 2011, EC 2012, EC 2013, STOC 2013, ITCS 2014, EC 2014, ITCS 2015, STOC 2015, EC 2015, EC 2016, EC 2017 (general chair), ICML 2018, COLT 2020, EC 2020, NeurIPS 2020, NeurIPS 2021 (area chair), FOCS 2023, FOCS 2025 Organization Organizer of semesters on Economics and Computation (Fall'15), Causality (Spring'22), and Learning and Games (Spring'22) at the Simons Institute for Theory of Computation, UC Berkeley ACM EC 14, tutorial on Multi-Dimensional Mechanism Design (with SLIDES) FOCS 2012 Workshop on Bayesian Mechanism Design (with SLIDES) Greece Economic and Algorithmic Theory (GREAT) Week: part 1, part 2, and part 3 (to be clear \"GREAT week\" is a pun on \"NYCE day\") Cambridge Area Economics and Computation (CAEC) Day Scientific Advisory Board, Simons Insitute for Theory of Computation, 2018-2020 MIT Primes Program Supervisor I co-developed the MIT undergraduate major: Computer Science, Economics, and Data Science, Course 6-14 Disability in AI NeurIPS'19 panelist Chair of AI Strategic Planning Committee for Greece under the Greek PM Complete Publications Recent Publications/Preprints Giannis Daras, Adrian Rodriguez-Munoz, Adam Klivans, Antonio Torralba, Constantinos Daskalakis: Ambient Diffusion Omni: Training Good Models with Bad Data. In the 39th Annual Conference on Neural Information Processing Systems (NeurIPS), NeurIPS 2025. Spotlight. arXiv. Giannis Daras, Jeffrey Ouyang-Zhang, Krithika Ravishankar, William Daspit, Costis Daskalakis, Qiang Liu, Adam Klivans, Daniel J. Diaz: Ambient Proteins: Training Diffusion Models on Low Quality Structures. In the 39th Annual Conference on Neural Information Processing Systems (NeurIPS), NeurIPS 2025. Spotlight. bioarXiv. Vardis Kandiros, Charilaos Pipis, Constantinos Daskalakis, Christopher Harshaw: The Conflict Graph Design: Estimating Causal Effects under Arbitrary Neighborhood Interference. Under Submission, 2024. arXiv. Constantinos Daskalakis, Vardis Kandiros, Rui Yao: Learning Gaussian DAG Models without Condition Number Bounds. In the 42nd International Conference on Machine Learning, ICML 2025. PDF. Yuval Dagan, Constantinos Daskalakis, Maxwell Fishelson, Noah Golowich, Robert Kleinberg, Princewill Okoroafor: Breaking the T^2/3 Barrier for Sequential Calibration. In the 57th ACM Symposium on Theory of Computing, STOC 2025. arXiv. Invited to the Special Issue. Constantinos Daskalakis, Gabriele Farina, Maxwell Fishelson, Charilaos Pipis, Jon Schneider: Efficient Learning and Computation of Linear Correlated Equilibrium in General Convex Games. In the 57th ACM Symposium on Theory of Computing, STOC 2025. arXiv. Giannis Daras, Yeshwanth Cherapanamjeri, Constantinos Daskalakis: How much is a noisy image worth? Data Scaling Laws for Ambient Diffusion. In the 13th International Co",
  "content_length": 67845,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:09"
}