{
  "name": "Constandinos X. Mavromoustakis",
  "homepage": "https://www.unic.ac.cy/mavromoustakis-constandinos",
  "status": "success",
  "content": "Professor Constandinos Mavromoustakis - University of Nicosia Skip to content APPLY Professor Constandinos Mavromoustakis Professor Constandinos Mavromoustakis Professor School of Sciences and Engineering Department of Computer Science 22841730 [email protected] Central Building›2nd Floor›B217 Brief CV https://orcid.org/0000-0003-0333-8034 Constandinos X. Mavromoustakis (male, Prof., PhD. since 2006) is currently a Professor at the Department of Computer Science at the University of Nicosia, Cyprus. He received a five-year dipl.Eng (BSc, BEng, Meng/KISATS approved/accredited) in Electronic and Computer Engineering from Technical University of Crete, Greece, MSc in Telecommunications from University College of London, UK, and his PhD from the department of Informatics at Aristotle University of Thessaloniki, Greece. Professor Mavromoustakis is leading the Mobile Systems Lab. (MOSys Lab., https://www.mosys.unic.ac.cy/) at the Department of Computer Science at the University of Nicosia and he is an active member (vice-chair) of IEEE/ R8 regional Cyprus section since Jan. 2016, and since May 2009 he serves as the Chair of C16 Computer Society Chapter of the Cyprus IEEE section. Prof. Mavromoustakis has a dense research work outcome in Mobile and Wearable computing systems and the Internet-of-Things (IoT), consisting of numerous refereed publications (>230) including several Books (IDEA/IGI, Springer and Elsevier). He has served as a consultant to many industrial bodies (including Intel Corporation LLC (www.intel.com)), and he is a management member of IEEE Communications Society (ComSoc) Radio Communications Committee (RCC) and a board member the IEEE-SA Standards IEEE SCC42 WG2040. He has participated in several FP7/H2020/Eureka and National projects. UNIC NICOSIA46 Makedonitissas Avenue, CY-2417P.O. Box 24005, CY-1700Nicosia, CyprusPhone.: +357 22 841500Email: [email protected] UNIC ATHENSNo. 17, 29th StreetElliniko 167 77Athens, GreecePhone:  +30 210 6748293Email: [email protected] USEFUL LINKSAll Academic ProgrammesUNIC Brand CentreUNIC in the NewsVerify a CertificateCareers at UNIC CONNECT WITH UNICSubscribe to NewslettersCopyright © University of Nicosia. All Rights Reserved | Privacy Policy | Terms & Conditions Page load link Live chat is available. Activate it by agreeing to the use of marketing cookies here. Please refresh the page after activation. × Go to Top",
  "content_length": 2408,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:08"
}