{
  "name": "Constantine Stephanidis",
  "homepage": "https://www.csd.uoc.gr/index.jsp?custom=constantine_stephanidis",
  "status": "success",
  "content": "Κωνσταντίνος Στεφανίδης | Τμήμα Επιστήμης Υπολογιστών - Πανεπιστήμιο Κρήτης Επικοινωνία Ανακοινώσεις | Νέα Τρίπτυχο του Τμήματος GR EN webmailelearneduportal Αρχική Σελίδα Άνθρωποι Ακαδημαϊκό Προσωπικό Κωνσταντίνος Στεφανίδης Κωνσταντίνος Στεφανίδης A+ A- Professor of Computer Science, University of Crete University of Crete Department of Computer Science P.O.Box 2208 Knossou Avenue GR-71409 Heraklion Crete, GREECE Director Institute of Computer Science (ICS) Foundation for Research and Technology - Hellas (FORTH) Nikolaou Plastira 100, Vassilika Vouton P.O Box 1385 GR-70013 Heraklion, Crete, Greece Phone: +30 2810 391741 Fax: +30 2810 391799 E-mail: cs@ics.forth.gr Constantine Stephanidis, Professor at the Department of Computer Science of the University of Crete, is the Director of the Institute of Computer Science, Foundation for Research and Technology - Hellas, Head of the Human - Computer Interaction Laboratory, and of the Centre for Universal Access and Assistive Technologies, and Head of the Ambient Intelligence Programme of ICS-FORTH. Research Interests Human - Computer Interaction: Design for All. New methodologies, techniques and tools for the design, development and evaluation of applications and services that exhibit automatic adaptation, personalization and intelligent interface behavior. Human - Computer Interaction in Ambient Intelligence environments Participation in Research Projects Over the past 25 years, Prof. Stephanidis has been engaged as the Scientific Responsible in more than 50 National and European Commission funded projects in the fields of Human-Computer Interaction, Universal Access and Assistive Technologies. Short CV Constantine Stephanidis, Professor at the Department of Computer Science of the University of Crete, is the Director of the Institute of Computer Science, Foundation for Research and Technology - Hellas, Head of the Human - Computer Interaction Laboratory, and of the Centre for Universal Access and Assistive Technologies, and Head of the Ambient Intelligence Programme of ICS-FORTH. Over the past 25 years, Prof. Stephanidis has been engaged as the Scientific Responsible in more than 50 National and European Commission funded projects in the fields of Human-Computer Interaction, Universal Access and Assistive Technologies. In the beginning of the '90s he introduced the concept and principles of Design for All in Human-Machine Interaction and for Universal Access in the evolving Information Society. He has published more than 550 technical papers in scientific archival journals, proceedings of international conferences and workshops related to his fields of expertise. He is the Editor-in-Chief of the Springer international journal \"Universal Access in the Information Society\". He is the Editor and (co-)author of 14 out of the 30 chapters of the book \" User Interfaces for All - concepts, methods and tools\" published by Lawrence Erlbaum Associates (2001). He is also Editor and (co-)author of many chapters of “The Universal Access Handbook” that was published in June 2009 by CRC Press Taylor & Francis Group. During the period 1995 - 2006, he was the Founding Chair of the ERCIM Working Group \"User Interfaces for All\" and General Chair of its 9 international Workshops. During the period 1997 - 2000, he was the Founding Chair of the International Scientific Forum \"Towards an Information Society for All\", in the context of which he edited White Papers concerning the roadmap and R&D agenda towards an Information Society for All. Since 2001 he is the Founding Chair of the International Conference \"Universal Access in Human - Computer Interaction\". Since 2007 he is the General Chair of the HCI International Conference, that takes place every two years with around 2,000 participants. Since the 80s, Prof. Stephanidis has been actively involved in activities contributing to the European Commission R&D Policy on Information Society. During the period 2002 - 2006, he was member of the Management Committee of the Information Society Technologies Programme of the 6th Framework Programme of the European Commission. During the period 2002 - 2005, he was member of the EC eAccessibility Expert Group, and from 2006 to 2010 he was member of the eInclusion Group of the i2010 Initiative. Since 2006, he is also member of the Management Board of the European Network and Information Security Agency (ENISA), having worked constantly for the hosting of the European Agency in Heraklion since 2002. During the period 2002 – 2004, he was the Coordinator of the Task Force on “Universal Access and Usability in the Information Society by all citizens, including people with disabilities and other disadvantaged groups”(Secretariat for the Information Society, Hellenic Ministry of Economy and Finance). He is one of the co-founders of the European Design for All e-Accessibility Network (EDeAN) and founder of the GR-DeAN the corresponding National Network. He is also the senior editor of the EDeAN White Paper, outlining a roadmap for future European initiatives in Design for All, e-Accessibility and e-Inclusion, published in 2006. Prof. Stephanidis was the Scientific Coordinator of the European Commission Coordination Action InterLink (2006-2009), which addressed world-scale, basic research problems in 'software intensive systems and new computing paradigms', 'ambient computing and communication environments' and 'intelligent and cognitive systems', under a human-centred perspective, and defined joint basic research agendas for world-wide cooperation in these domains. Since 2004, as Head of the Ambient Intelligence (AmI) Programme of ICS-FORTH, he is coordinating multidisciplinary activities involving various ICS-FORTH laboratories with the aim of conceptualizing, designing and developing in vitro, and deploying in vivo, pioneering, innovative technologies and applications for Smart Environments, capable of “understanding” and proactively addressing individual human needs, following a human-centred approach. In 2010, Prof. Stephanidis was elected member of the Informatics Section of the Academia Europaea, a functioning European Academy of Humanities, Letters and Sciences. Copyright © 2025, Τμήμα Επιστήμης Υπολογιστών - Συντελεστές - Σχόλια για Ιστότοπο",
  "content_length": 6271,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:08"
}