{
  "name": "Constantin Orasan",
  "homepage": "https://www.surrey.ac.uk/people/constantin-orasan",
  "status": "success",
  "content": "Prof Constantin Orasan | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all LinkedIn Twitter ORCID ResearchGate Professor Constantin Orasan Professor of Language and Translation Technologies PhD in Computational Linguistics +441483 684115 c.orasan@surrey.ac.uk Personal page06 LC 03Mondays 10-11am, Fridays 4-5pmAcademic and research departments Literature and Languages, Centre for Translation Studies. AboutBiographyI am Professor of Language and Translation Technologies at the Centre of Translation Studies, University of Surrey. Before starting this role, I was Reader in Computational Linguistics at the University of Wolverhampton, UK, and the deputy head of the Research Group in Computational Linguistics at the same university. I have received my BSc in computer science at Babeș-Bolyai University, Cluj-Napoca, Romania and was awarded my PhD from the University of Wolverhampton.I have over 20 years experience of working in the fields of (applied) Natural Language Processing (NLP), Artificial Intelligence and Machine Learning for language processing. My research interests are largely focused on facilitating information access and include translation technology, sentiment analysis, question answering, text summarisation, anaphora and coreference resolution, building, annotation and exploitation of corpora.I recently coordinated the EXPERT project, an extremely successful Initial Training Network (ITN) funded under the People Programme of the Seventh Framework Programme (FP7) of the European Community which trained the next generation of world-class researchers in the field of data-driven translation technology. In addition to coordinating this project between nine partners across both academia and industry, I was actively involved in the training of the Early Stage Researchers (ESRs) appointed in the project and, in collaboration with these ESRs, I carried out research on translation memories and quality estimation for machine translation. I continue researching these topics. I was also the deputy coordinator of the FIRST project, a project which developed language technologies for making texts more accessible to people with autism. In addition to managing a consortium of nine partners from academia, industry and heath care organisations, I also carried out research on text simplification and contributed to the development of a powerful editor which can be used by carers of people with autism to make texts more accessible for these people.In the past In the past, I was the Local Course Coordinator of the Erasmus Mundus programme on Technology for Translation and Interpretation and the Erasmus Mundus International Masters in Natural Language Processing and Human Language Technology, and the scientist in charge for the University of Wolverhampton in two European projects QALL-ME and MESSAGE. I also worked as a research fellow on the CAST project. I love programming and in my spare time I contribute to some open source projects and have my own GitHub repository. Expand biography Areas of specialism Natural language processing; Translation technology; Sentiment analysis and opinion mining; Question answering; Text summarisation and text simplification; Anaphora and coreference resolution; Building, annotation and exploitation of corpora; Machine learning and deep learning for natural language processing; Artificial intelligence My qualifications 2006 PhD in computational linguistics University of Wolverhampton, UK 1998 BSc in Computer Science Babeș-Bolyai University, Cluj-Napoca, RomaniaNews 16 SEP 2025Justice is being lost in translation – Surrey researchers build AI to fix this problem 22 MAY 2025Interpreting and AI CPD Course 29 APR 2025Translation and AI CPD Course 15 JUL 2024Exploring AI Integration in Translation Studies – Collaborative workshops with students at the Centre for Translation Studies 03 MAR 2024Human and machine in harmony? Centre for Translation Studies (CTS) kick-start activities of Faculty-funded learning and teaching project to explore GenAI use by students 04 JUL 2022CTS research presented at LREC 2022 28 MAR 2022Using Natural Language Processing to help people access justice 21 FEB 2022CTS announces recruitment process for a post-doctoral researcher in NLP for legal documents Show all articlesSupervisionPostgraduate research supervisionFirst supervisor of Eleanor Taylor-Stilgoe's PhD Thesis on A study of healthcare staff awareness of potential risk posed by machine translationSecond supervisor of Maria Andreea Deleanu's PhD thesis entitled (Narrative) E2U Audio Cues for neurodiverse end-usersSecond supervisor of Wangyi Tang’s PdD thesis on Disrupter or enabler? Assessing the impact of using automatic speech recognition technology in interpreter-mediated legal proceedingsSecond supervisor of Archchana Sindhujan’s PhD thesis on Document level quality estimationSecond supervisor of Shiyi Tan's PhD thesis on ASR Support: A Solution for Cognitive Load and Interpreting Quality?First supervisor of Najat Alhuthali's PhD thesis on Using MT in Translating Saudi Laws and RegulationsFirst supervisor of Anastasiia Bezobrazova's PhD thesis on An investigation of prompting techniques for improving text accessibilityFirst supervisor of Daria Sokova’s PhD thesis on LLM-based Assessment of Web Content AccessibilitySecond supervisor of Charlotte Bonneau’s PhD thesis on AI-mediated comics: a critical phenomenology of access Expand Completed postgraduate research projects I have supervisedFirst supervisor of Shenbin Qian's PhD thesis on Evaluating Machine Translation of Emotion-loaded Chinese User-generated Content, University of Surrey, UK, 2025, (pdf)Second supervisor of Gökhan Firat's PhD thesis on Translation Work in the Digital Economy: Working Conditions of Translators on Platforms and in Cooperatives, University of Surrey, UK, 2024, (pdf)Second supervisor of Alistair Plum’s PhD thesis on Biographical information extraction: A language-agnostic methodology for datasets and models, University of Wolverhampton, UK, 2023 (pdf).Second supervisor of Hadeel Saadany’s PhD thesis entitled A Study of the translation of sentiment in user-generated text, University of Wolverhampton, UK, 2023 (pdf)Second supervisor of Tharindu Ranasinghe’ PhD thesis on Deep learning based semantic textual similarity for applications in translation technology, University of Wolverhampton, UK, 2021 (pdf)Second supervisor of Reshmi Gopalakrishna Pillai’s PhD thesis on Expressions of psychological stress on Twitter: detection and characterisation, University of Wolverhampton, UK, 2021 (pdf)First supervisor of Richard Evans' PhD thesis entitled Sentence simplification for text processing, University of Wolverhampton, UK, 2020First supervisor of Hanna Bechara' PhD thesis entitled A Semantic Textual Similarity Enhanced Quality Estimation Method and its Applications to Natural Language Processing Task, University of Wolverhampton, UK, 2020First supervisor of Rohit Gupta's PhD thesis on Use of language technology to improve matching and retrieval in translation memories, University of Wolverhampton, UK, 2016Second supervisor of Sanja Stajner's PhD thesis on New Data-Driven Approaches to Text Simplification, University of Wolverhampton, 2015 (pdf)Second supervisor of Natalia Konstantinova's PhD thesis on Knowledge acquisition from user reviews for Interactive Question Answering, University of Wolverhampton, UK, 2013 (pdf)First supervisor of Iustin Dornescu's PhD thesis on Encyclopedic question answering, University of Wolverhampton, UK, 2012 (pdf)Second supervisor of Georgiana Marsic's PhD thesis on Temporal Processing of News: Annotation of Temporal Expressions, Verbal Events and Temporal Relations, University of Wolverhampton, UK, 2011 (pdf)Second supervisor of Laura Hasler's PhD thesis entitled From extracts to abstracts: Human summary production operations for computer-aided summarisation, University of Wolverhampton, UK, 2007 (pdf) Expand TeachingMODULES TAUGHT THIS ACADEMIC YEARTRAM500: Introduction to computational thinking for translators (module leader)The purpose of this module is to enable students to acquire basic and intermediate concepts of computer science and programming, and to learn how to apply them to problems related to translation-related tasks such as glossary creation, error analysis, automatic substitution. The programming language used in the class is Python.TRAM502: Smart technologies for translators (module leader)The module explores the main theoretical and practical aspects of smart technologies for translation, with emphasis on how to use methods from Natural Language Processing and Corpus Linguistics to help translators. The pu",
  "content_length": 10959,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:06"
}