{
  "name": "Constantin A. Rothkopf",
  "homepage": "https://www.pip.tu-darmstadt.de/members_pip/publications.en.jsp",
  "status": "success",
  "content": "Constantin A. Rothkopf – Psychology of Information Processing Lab – TU Darmstadt Prof. Constantin A. Rothkopf, PhD Contact Prof. Constantin A. Rothkopf, Ph.D. Psychology of Information Processing Contact rothkopf@psychologie.tu-... work +49 6151 16-23367 Work S1|15 246 Alexanderstr. 10 64283 Darmstadt Bio Constantin Rothkopf is a full professor (W3) at the Institute for Psychology in the Department of Human Sciences with a secondary appointment in the Department of Computer Science at the Technical University of Darmstadt. He is the founding director of the Center for Cognitive Science and a founding member as well as a member of the executive board of the Hessian Center for Artificial Intelligence (hessian.AI). He is also a member of the board of directors of the Center for Mind, Brain and Behavior (CMBB). He is a member of the European Laboratory for Learning and Intelligent Systems (ELLIS), a faculty member of the ELLIS Unit Darmstadt, and a member of the DAAD Konrad Zuse Schools of Excellence in Artificial Intelligence (ELIZA). He is currently a co-speaker of the collaborative projects The Adaptive Mind and Whitebox. After obtaining a joint PhD in Brain & Cognitive Sciences and Computer Science at the Center for Visual Science at the University of Rochester, NY in 2009, he started a postdoc at the Frankfurt Institute for Advanced Studies (FIAS) working in the theoretical neuroscience group. In 2009 he started as a lecturer at the Goethe University, Frankfurt and from 2010 to 2012 he was the principal investigator of the “beliefs, representations, and actions group” at FIAS. After a year as a substitute professor at the Institute of Cognitive Science at the University Osnabrück, he started as an associate professor for “psychology of information processing” at the Institute for Psychology at the Technical University of Darmstadt in 2013. During the winter semester 2017 he was a visiting professor at the Department of Cognitive Science at the Central European University, Budapest. In 2022 he received an ERC Consolidator Grant from the European Research Council for his project 'ACTOR'. During the summer semester 2023 he was a visiting professor at the Zuckerman Institute, Columbia University, New York, USA. In 2025 the collaborative project 'Simons Collaboration on Ecological Neuroscience' and the two DFG Excellence Clusters “Reasonable Aritificial Intelligence” (RAI) and “The Adaptive Mind” (TAM), for which he is the TU Darmstadt speaker, have been approved for funding. Research Interests Constantin Rothkopf's research interests revolve around the distinction between 'looking' and 'seeing' and how this distinction relates to vision in goal directed behavior in an ambiguous, uncertain, and variable world. The aim is to better understand the interrelationship between perception and action in humans, i.e. how we use our perceptual systems actively during natural extended behavior to guide decisions and actions with our bodies. This leads to the study of how we use sensory input, specifically vision, form beliefs about the world by carrying out computations on the basis of our cognitive representations, and then employ decision making processes to act in goal directed behavior. To achieve this goal he uses experimental studies in humans as well as computational modeling involving methods from statistical and machine learning. His current focus is on: behavioral studies involving eye tracking of human eye movements during complex naturalistic tasks in natural and virtual environments,developing inverse optimal control and inverse optimal decision-making models that allow recovering individual subjects' subjective beliefs, intrinsic costs, and internal models, building computational models of tasks and developing algorithms that learn how to solve these tasks in virtual agents,developing models for the representation and quantification of extended sequential human behavior,simulation of learning algorithms in naturalistic virtual environments,developing learning algorithms with an emphasis on the learning of sensory representations for actions. Selected Publications F. Kessler, J. Frankenstein, C. A Rothkopf. Human navigation strategies, their errors and variability result from dynamic interactions of spatial uncertainties, Nature Communications, 15(1): 1-19, 2024, [https://doi.org/10.1038/s41467-024-49722-y]T. Thomas, D. Straub, F. Tatai, M. Shene, T. Tosik, K. Kersting & C. A. Rothkopf. Modelling dataset bias in machine-learned theories of economic decision-making. Nature Human Behaviour, 2024, [https://doi.org/10.1038/s41562-023-01784-6]D. Straub*, M. Schultheis*, H. Koeppl, C. A. Rothkopf. Probabilistic inverse optimal control for non-linear partially observable systems disentangles perceptual uncertainty and behavioral costs. Advances in neural information processing systems (NeurIPS), 2023, [https://proceedings.neurips.cc/paper_files/paper/2023/hash/16347f6e665376fd9a9a290dbfe0db5b-Abstract-Conference.html]D. Straub, C. A. Rothkopf. Putting perception into action with inverse optimal control for continuous psychophysics, eLife, 11:e76635, 2022, [https://doi.org/10.7554/eLife.76635]M. Schultheis*, D. Straub*, C. A. Rothkopf. Inverse stochastic optimal control adapted to the noise characteristics of the sensorimotor system. Advances in neural information processing systems (NeurIPS), 2021, [https://proceedings.neurips.cc/paper/2021/hash/4e55139e019a58e0084f194f758ffdea-Abstract.html]D. Hoppe, C. A Rothkopf. Multi-step planning of eye movements in visual search. Scientific Reports, 9(1):144, 2019, [https://doi.org/10.1038/s41598-018-37536-0]D. Hoppe, S. Helfmann, C. A. Rothkopf. Humans quickly learn to blink strategically in response to environmental task demands. Proceedings of the National Academy of Sciences (PNAS), 2018, [https://doi.org/10.1073/pnas.1714220115]B. Belousov, G. Neumann, C. A. Rothkopf, J. Peters. Catching heuristics are optimal control policies. Proceedings of the Annual Conference on Neural Information Processing Systems (NIPS), 2016, [https://proceedings.neurips.cc/paper/2016/hash/43fa7f58b7eac7ac872209342e62e8f1-Abstract.html]D. Hoppe, C. A. Rothkopf. Learning rational temporal eye movement strategies. Proceedings of the National Academy of Sciences (PNAS), 113(29), 8332-8337, 2016, [https://doi.org/10.1073/pnas.1601305113]C. A. Rothkopf, D. H. Ballard. Modular inverse reinforcement learning for visuomotor behavior. Biological Cybernetics, 107(4), 477-490, 2013, [https://doi.org/10.1007/s00422-013-0562-6]C. Dimitrakakis, C. A. Rothkopf. Bayesian multitask inverse reinforcement learning. European Workshop on Reinforcemnt Learning (EWRL), September 9–11, 2011, [https://doi.org/10.1007/978-3-642-29946-9_27]M. M. Hayhoe, C. A. Rothkopf. Vision in the natural world. Wiley Interdisciplinary Reviews: Cognitive Science, Wiley, 2010, [https://doi.org/10.1002/wcs.113]C. A. Rothkopf, D. H. Ballard, M.M. Hayhoe. Task and context determine where you look. Journal of Vision, 7(14):16, 1-20, 2007, [https://doi.org/10.1167/7.14.16] Contact Go to top Contact Prof. Constantin A. Rothkopf, Ph.D. rothkopf@psychologie.tu-... work +49 6151 16-23367 Work S1|15 246 Alexanderstr. 10 64283 Darmstadt Consultation by appointment Inge Galinski Work S1|15 242 Alexanderstraße 10 64283 Darmstadt We would like to customise the information and usability of this website to your preferences and needs. To this end, we use so-called cookies. Please choose which cookies you would like to enable when visiting our webpages. Some of these cookies are required to load and correctly display this website on your device. These are strictly necessary or essential cookies and cannot be deselected. The preferences cookie saves your language setting, while the statistics cookie regulates how the open-source statistical software “Matomo” analyses your visits to and activities on our website. For more information about cookies we use, please refer to our privacy policy. Strictly necessary only Preferences Statistics Accept all Save & close Legal note",
  "content_length": 8074,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:06"
}