{
  "name": "Constantinos Constantinides",
  "homepage": "https://users.encs.concordia.ca/~cc",
  "status": "success",
  "content": "Dr. Constantinos Constantinides, P.Eng.Associate Professor Department of Computer Science and Software Engineering Concordia University 1455 De Maisonneuve Blvd West, Montreal, QC H3G 1M8 CANADA Email: constantinos[dot]constantinides[at]concordia[dot]ca Tel: 514 - 848 2424 Ext. 5374 Fax: 514 - 848 2830 Biographical note I am an Associate Professor in the Department of Computer Science and Software Engineering at Concordia University. I received tenure at Concordia in 2009, after I joined the University in 2004 as a tenure-track Assistant Professor. Prior to coming to Concordia I was a Lecturer in the School of Computer Science and Information Systems at Birkbeck, University of London (2001 - 2004), and a Visiting Assistant Professor in the Department of Mathematical and Computer Sciences (currently: the Department of Computer Science) at Loyola University Chicago (2000 - 2001). While completing my doctoral studies, I worked as a part-time instructor at Roosevelt University, Illinois Institute of Technology, and Loyola University Chicago. I hold a Professional Engineer designation from Professional Engineers Ontario (2009), and a Certificate in Teaching and Learning in Higher Education from the Institute of Education, University of London (2003) (currently part of University College London). I received my Ph.D. in Computer Science from Illinois Institute of Technology (2000), under the supervision of Dr. Tzilla Elrad. I hold a Master of Science degree in Computer Science from New York Institute of Technology (1995), a Postgraduate Certificate in Engineering from City University (1992), (currently: City, University of London), and a Bachelor of Science degree in Electronics from Keele University (1991). Research: I am interested in the intersection of formal methods and software engineering with the objective of building reliable software systems. Some of my publications can be found at DBLP here and here. Some more are available at the ACM Digital Library here. Recent publications Hosna Habibi Baghi, Ali Jannatpour and Constantinos Constantinides, Verification of Linear Temporal Properties over Timed Events. In Proceedings of the 7th International Conference on Software Engineering and Development, Bangkok, Thailand, October 29-31, 2025. paper Cleopatr-Aliak Manoukian, Ali Jannatpour and Constantinos Constantinides, A declarative platform for the model transformation and behavioral analysis of UML activity diagrams. In Proceedings of the 7th International Applied Mathematics, Modelling and Simulation Conference (AMMS 2025), September 24-26, 2025, Athens, Greece. paper Constantinos Constantinides and Ali Jannatpour, Introducing a variant history protocol in the presence of state behavior in UML state machines. In Proceedings of the 17th International Conference on Computer Modeling and Simulation, Zhuhai, China, June 10-12, 2025. paper Ali Jannatpour and Constantinos Constantinides, A Common Declarative Language for UML State Machine Representation, Model Transformation, and Interoperability of Visualization Tools. In Proceedings of the First International Symposium on Software Fault Prevention, Verification and Validation, 2-3 December 2024, Hiroshima, Japan. Lecture Notes in Computer Science, Volume 15393, Springer, 2025. paper | presentation Zohreh Mehrafrooz, Ali Jannatpour, and Constantinos Constantinides, Declarative Representation of UML State Machines for Querying and Simulation. In proceedings of the 7th International Workshop on Formal Approaches for Advanced Computing Systems (FAACS 2023), 18 - 19 September, 2023, Istanbul, Turkey. Lecture Notes in Computer Science, vol 14590, pp. 133 - 150, Springer, 2024. paper | presentation My academic genealogy: me → Tzilla Elrad → Nissim Francez → Amir Pnueli → Chaim Leib Pekeris → Carl-Gustaf Arvid Rossby → Erik Ivar Fredholm → ... The complete path can be viewed from the Mathematics Genealogy Project. Erdös number: 4. (Paul Erdos ← Shmuel Zaks ← Nissim Francez ← Tzilla Elrad ← me) Teaching: Winter 2026: SOEN 331: \"Introduction to Formal Methods for Software Engineering\" Fall 2025: SOEN 331: \"Introduction to Formal Methods for Software Engineering\" SOEN 342: \"Software Requirements and Deployment\" \"I think it wise, and only honest, to warn you that my goal is immodest. It is not my purpose to \"transfer knowledge\" to you that, subsequently, you can forget again. My purpose is no less than to effectuate in each of you a noticeable, irreversable change. I want you to see and absorb calculational arguments so effective that you will never be able to forget that exposure. I want you to gain, for the rest of your lives, the insight that beautiful proofs are not \"found\" by trial and error but are the result of a consciously applied design discipline. I want to inspire you to raise your quality standards. I mean, if 10 years from now, when you are doing something quick and dirty, you suddenly visualize that I am looking over your shoulders and say to yourself \"Dijkstra would not have liked this.\", well, that would be enough immortality for me. \" prof.dr. Edsger W. Dijkstra, \"Introducing a course on calculi\", Austin, August 1995.",
  "content_length": 5165,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:07"
}