{
  "name": "Corina Sas",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/corina-sas",
  "status": "success",
  "content": "Corina Sas - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Professor Corina Sas Professor Research Overview Research interests include human-computer interaction, with a specific focus on designing and evaluating technologies for wellbeing, mental health, memory support, creative and reflective thinking in design, as well as novel tools for designing such technologies. My work explores and integrates wearable bio sensors, mobile and lifelogging technologies. My research was supported by grants totalling over £15.1 million, and I was Coordinator of two prestigious EC-funded Innovative Training Networks. I have spent sabbaticals as Visiting Professor at Stanford University, Carnegie Mellon University, Royal Institute of Technology (KTH), University of California Irvine, and University of California Santa Cruz. My research received extensive media coverage as well as 5 Best Paper and Honourable Mention Awards at flagship ACM CHI and DIS conferences. I have also received the AI 2000 Most Influential Scholar Honorable Mention in Human-Computer Interaction (2022, 2023), Digital Female Leader Award for Science (2019) from Global Digital Women, Lancaster University Outstanding Contribution Staff Award (2019), and Highly Commended Nomination for Researcher of the Year Dean’s Award (2019). In 2022 I was made Principal Fellow of the Higher Education Academy (PFHEA) for strategic international leadership of interdisciplinary large scale doctoral training programmes. I am interested in supervising PhD projects in HCI and digital health. I have supervised to completion 16 PhD students, and in 2021 I was shortlisted by the UK Times Higher Education for the Outstanding Research Supervisor of the Year Award. Show more… Profile Corina leads award-winning research in Human Computer Interaction (HCI), playing a key role in shaping the School’s growing research agenda in digital health. Her publication track includes top journals such as the flagship ACM Transactions on Computer Human Interactions (TOCHI), Taylor and Francis Human-Computer Interaction, ACM CHI and DIS conferences. Corina has outstanding track record in earning research income and managing large scale interdisciplinary networks (over £15.1 million, with over £6 million as Principal Investigator). She regulary acted as Associate Chair for both the ACM CHI and DIS conferences, and is member of the Editorial Boards of the ACM Transactions in Human-Computer Interaction Journal, and Taylor and Francis Human-Computer Interaction Journal. Corina started her academic career at Lancaster as lecturer in 2004, and senior lecturer in 2010, to become in 2017 the first female Professor in the School of Computing and Communication. Prior to joining Computing Department she was a scholar reading for a PhD in Computer Science at the University College Dublin, Ireland. Her previous studies include a MA in Industrial and Organisational Psychology from the Babes-Bolyai University of Cluj-Napoca, Romania, a BSc in Mathematics and Computer Science, and a BA in Psychology, from the \"Lucian Blaga\" University of Sibiu, Romania, where she also worked as Assistant Professor. Research Grants AffecTech: Personal Technologies for Affective Health, a Marie Sklodowska-Curie Innovative Training Network (€3,888,273). European Commission Role: Prinicipal InvestigatorDates: 2017 – 2021Website: http://www.affectech.org/ Digital threads: Towards personalised craft production in Malay cottage industry through distributed ledger technologies and demand chain management (£117,558). AHRC. Role: Prinicipal InvestigatorDates: 2017 – 2019Website: https://www.digitalthreads.co.uk Designing Multisensory Interactions: Emotional User Experience of 3D Printed-Food Consumption. (£100,000) EPSRC CASE Studentship Role: Principal InvestigatorDates: 2016 – 2020 PACTMAN: Trust, Privacy and Consent in Future Pervasive Environments (£1,008,820) EPSRC Role: Co-InvestigatorDates: 2016 – 2018Website: http://pactman.uk/ RECALL: Rethinking and redefining memory augmentation (>£1.5m) European Commission Role: Co-InvestigatorDates: 2013 – 2016Website: http://recall-fet.eu/ CaTalyST - Citizens Transforming Society: Tools for Change (>£1.45m) EPSRC Role: Co-InvestigatorDates: 01/11/2011 – 31/10/2014Website: http://www.catalystproject.org.uk/ Sav-e - Sustainable Added Value e-chain (>£589K) Technology Strategy Board Role: Co-InvestigatorDates: 01/11/2011 – 31/10/2014 Mobile Technologies for Supporting Reflective Design Practices (>£22K) VINNOVA Role: Principal InvestigatorDates: 1.09.2012– 31.08.2013 DESIRE - Creative Design for Innovation in Science and Technology (> €3.24m) European Commission Role: Principal InvestigatorDates: 01/09/2009 – 31/08/2012Website: http://www.desirenetwork.eu/ External Roles Member of the Executive Committee of the British HCI group for British Computer Society: promoting the education and practice of HCI and supporting HCI people in industry and academia, contributing to the development of programme of events, overseeing the group budget and liaising with the BCS financial officer. Career Details Academic qualifications Ph.D. Computer Science, 2004 Executive MBA, 2018 (Distinction) B.Sc. Mathematics and Computer Science, 1998 (1st Class Hons) M.A. Industrial and Organisational Psychology, 1997 B.Sc. Psychology, 1996 (1st Class Hons) Employment Professor in HCI and Digital Health, School of Computing and Communications, Lancaster University, 2017 - present Senior Lecturer in HCI, School of Computing and Communications, Lancaster University, 2010 - 2017 Lecturer in HCI, School of Computing and Communications, Lancaster University, 2004-2010 RA/PhD student, Department of Computer Science, University College Dublin, 2000-2004 Teaching Assistant, Department of Informatics/Department of Psychology, Lucian Blaga University, 1996 – 2000 Current Teaching SCC120 Fundamentals of CS Research Interests My research interests include human-computer interaction, with a specific focus on designing and evaluating technologies for wellbeing, mental health, memory support, creative and reflective thinking in design, as well as novel tools for designing such technologies. My work explores and integrates wearable bio sensors, mobile and lifelogging technologies. My research focuses on technologies which aim to make a difference in people’s lives. I see technology as a means to an end, either for studying and understanding human behaviour, or as a tool for supporting people to reach their potential. My Role Assistant Dean for Research Enhancement Faculty of Science and Technology, Lancaster University, UK Director of HighWire Doctoral Training Centre on Digital Economy, Lancaster University, UK Pervasive Systems - Group Lead, School of Computing and Communications Professional Role Editorial board member of ACM Transactions in Human-Computer Interaction Journal (ToCHI) Editorial board member of Taylor and Francis Human-Computer Interaction Journal Technical Program Co-Chair (TPC) for the ACM CHI Conference on Human Factors in Computing Systems (2024) Co-Chair of the ACM Creativity and Cognition Conference (2021, 2022) Associated Chair: ACM CHI, ACM DIS (since 2014) Co-Chair of the British HCI conference (2007) PhD Supervision Interests I am interested in supervising PhD projects in HCI-related areas, particularly those pertaining to my research interests. Show less Publications Projects Activities PhD Students Research Groups Digital Health: Innovative engineering technologies to improve the understanding and management of fatigue (FATIGUE) 10/01/2022 → 20/12/2024 Research Future Places: A Digital Economy Centre on Understanding Place Through Pervasive Computing 01/10/2020 → 28/02/2026 Research Digital Threads : Towards Personalised Craft Production in Malay Cottage Industries 14/02/2017 → 13/02/2019 Research Digital Threads:Towards a Personalised Craft Production in Malay Cottage Industries 14/02/2017 → 13/02/2019 Research H2020: AffecTech - Personal Technologies for Affective Health 01/01/2017 → 31/03/2021 Research PACTMAN: Trust and Consent in Future Pervasive Environments (DSI) 01/09/2016 → 28/02/2020 Research RECALL: Enchanced Human Memory Recall 01/11/2013 → 31/10/2016 Research Mobile Technologies for Supporting Reflective Design Practices VINNOVA 02/04/2012 → 30/09/2013 Other SAV-e (Sustainable Added Value e-Chain) 01/04/2012 → 30/09/2013 Research Citizens Transforming Society: Tools for Change 01/11/2011 → 30/04/2015 Research FP7: DESIRE (Researchers linked to CSD7831) 01/09/2008 → … Research Workshop at the British Computer Society’s Special Interest Group in Human Computer Interaction Conference (BCS HCI 2025) Participation in workshop, seminar, course Workshop at the British Computer Society’s Special Interest Group in Human Computer Interaction Conference (BCS HCI 2025) Participation in workshop, seminar, course 1st FST Fellowships Masterclass Participation in workshop, seminar, course Invited talk: Ethical design for wellbeing and mental health. UCLIC Research Seminar Series Public Lecture/ Debate/Seminar Designing (with) AI for Wellbeing Workshop at CHI 2024 Participation in workshop, seminar, course Doctoral Consortium at ACM Designing Interactive Systems Conference 2023 Symposium Keynote: Ethical design for wellbeing and affective health Invited talk Invited talk: Ethical Design for Wellbeing and Affective Health; Technological Center for Research, Development and Innovation in Information and Communication Technologies (ICT) Spain Invited talk Smell, Taste, and Temperature Interfaces Workshop at CHI 2023 Participation in workshop, seminar, course Invitd talk: Reflecting on the value of food for human -food interaction research. University of Leicester Semi",
  "content_length": 16123,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:09"
}