{
  "name": "Cornelia Caragea",
  "homepage": "https://www.cs.uic.edu/~cornelia",
  "status": "success",
  "content": "Cornelia Caragea Home | Research | Publications | Teaching | Curriculum Vitae | Links Cornelia Caragea Robert V. Kenyon Professor of Computer Science Science and Engineering Offices Computer Science University of Illinois at Chicago Chicago, IL 60607, USA ude.ciu@ailenroc My research interests are in natural language processing, artificial intelligence, deep learning, and information retrieval. Here's what I follow on productivity. News Several Research Assistantships Available: I am currently looking for smart and highly motivated PhD students. If you are a student interested in Natural Language Processing, Information Retrieval, and Machine Learning, and would like to work as a research assistant with me, please send me an email at ude.ciu@ailenroc. Check out our 6 papers accepted at ACL and ACL-Findings 2024! Congratulations to my wonderful students and collaborators! Check out our 4 papers accepted at EMNLP and EMNLP-Findings 2024! Congratulations to my wonderful students and collaborators! Check out our NeurIPS 2023 papers on \"Efficient Beam Tree Recursion.\" and \"Recursion in Recursion: Two-Level Nested Recursion for Length Generalization with Scalability.\" Congratulations, Jishnu! Check out our ICML 2023 papers on \"Beam Tree Recursive Cells\" and \"Monotonic Location Attention for Length Generalization\" Congratulations, Jishnu! Check out our CVPR 2023 paper on \"MarginMatch: Improving Semi-Supervised Learning with Pseudo-Margins.\" Congratulations, Tiberiu! Check out our EMNLP 2023 papers on \"JointMatch: A Unified Approach for Diverse and Collaborative Pseudo-Labeling to Semi-Supervised Text Classification.\" and \"Multi-Task Knowledge Distillation with Embedding Constraints for Scholarly Keyphrase Boundary Classification.\" Congratulations, Henry and Seo Yeon! Check out our 7 papers accepted at ACL and ACL-Findings 2023! Congratulations to my wonderful students! Check out our 7 papers accepted at EMNLP and EMNLP-Findings 2022! Congratulations to my wonderful students! Also check us on csrankings.org. Selected Publications Seo Yeon Park, Cornelia Caragea (2024). \"VerifyMatch: A Semi-Supervised Learning Paradigm for Natural Language Inference with Confidence-Aware MixUp.\" In: Proceedings of the 2024 Conference on Empirical Methods in Natural Language Processing (EMNLP 2024). Miami, Florida, USA. [pdf] Krishna Garg, Cornelia Caragea (2024). \"Stanceformer: Target-Aware Transformer for Stance Detection.\" In: Proceedings of the 2024 Conference on Empirical Methods in Natural Language Processing: Findings (EMNLP-Findings 2024). Miami, Florida, USA. [pdf] Qi Zhang, Zhijia Chen, Huitong Pan, Cornelia Caragea, Longin Jan Latecki, Eduard Dragut (2024). \"SciER: An Entity and Relation Extraction Dataset for Datasets, Methods, and Tasks in Scientific Documents.\" In: Proceedings of the 2024 Conference on Empirical Methods in Natural Language Processing (EMNLP 2024). Miami, Florida, USA. [pdf] Adrian Cosma, Stefan Ruseti, Mihai Dascalu, Cornelia Caragea (2024). \"How Hard is this Test Set? NLI Characterization by Exploiting Training Dynamics.\" In: Proceedings of the 2024 Conference on Empirical Methods in Natural Language Processing (EMNLP 2024). Miami, Florida, USA. [pdf] Chenye Zhao, Cornelia Caragea (2024). \"EZ-STANCE: A Large Dataset for English Zero-Shot Stance Detection.\" In: Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (ACL 2024). [pdf] Nikesh Gyawali, Iustin Sirbu, Tiberiu Sosea, Sarthak Khanal, Doina Caragea, Traian Rebedea, Cornelia Caragea (2024). \"GunStance: Stance Detection for Gun Control and Gun Regulation.\" In: Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (ACL 2024). [pdf] Mobashir Sadat, Cornelia Caragea (2024). \"Co-training for Low Resource Scientific Natural Language Inference.\" In: Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (ACL 2024). [pdf] Eduard Poesina, Cornelia Caragea, Radu Ionescu (2024). \"A Novel Cartography-Based Curriculum Learning Method Applied on RoNLI: The First Romanian Natural Language Inference Corpus.\" In: Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (ACL 2024). [pdf] Mobashir Sadat and Cornelia Caragea (2024). \"MSciNLI: A Diverse Benchmark for Scientific Natural Language Inference.\" In: Proceedings of the 2024 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (NAACL 2024). [pdf] Jishnu Ray Chowdhury and Cornelia Caragea (2023). \"Efficient Beam Tree Recursion.\" In: Proceedings of the 37th Conference on Neural Information Processing Systems (NeurIPS 2023). New Orleans, Louisiana. [pdf] Jishnu Ray Chowdhury and Cornelia Caragea (2023). \"Recursion in Recursion: Two-Level Nested Recursion for Length Generalization with Scalability.\" In: Proceedings of the 37th Conference on Neural Information Processing Systems (NeurIPS 2023). New Orleans, Louisiana. [pdf] Henry Peng Zou and Cornelia Caragea (2023). \"JointMatch: A Unified Approach for Diverse and Collaborative Pseudo-Labeling to Semi-Supervised Text Classification.\" In: Proceedings of the 2023 Conference on Empirical Methods in Natural Language Processing (EMNLP 2023). Singapore. [pdf] Seo Yeon Park and Cornelia Caragea (2023). \"Multi-Task Knowledge Distillation with Embedding Constraints for Scholarly Keyphrase Boundary Classification.\" In: Proceedings of the 2023 Conference on Empirical Methods in Natural Language Processing (EMNLP 2023). Singapore. [pdf] Henry Peng Zou, Yue Zhou, Weizhi Zhang, and Cornelia Caragea (2023). \"DeCrisisMB: Debiased Semi-Supervised Learning for Crisis Tweet Classification via Memory Bank.\" In: Proceedings of the 2023 Conference on Empirical Methods in Natural Language Processing: Findings (EMNLP-Findings 2023). Singapore. [pdf] Jishnu Ray Chowdhury and Cornelia Caragea (2023). \"Beam Tree Recursive Cells.\" In: Proceedings of the 40th International Conference on Machine Learning (ICML 2023). Honolulu, Hawaii. [pdf] Jishnu Ray Chowdhury and Cornelia Caragea (2023). \"Monotonic Location Attention for Length Generalization.\" In: Proceedings of the 40th International Conference on Machine Learning (ICML 2023). Honolulu, Hawaii. [pdf] Tiberiu Sosea and Cornelia Caragea. (2023) \"MarginMatch: Improving Semi-Supervised Learning with Pseudo-Margins.\" In: Proceedings of The IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR 2023), Vancouver, Canada. [pdf] Chenye Zhao, Yingjie Li, and Cornelia Caragea. (2023). \"C-STANCE: A Large Dataset for Chinese Zero-Shot Stance Detection.\" In: Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (ACL 2023). Toronto, Canada. Yingjie Li, Krishna Garg, and Cornelia Caragea. (2023). \"A New Direction in Stance Detection: Target-Stance Extraction in the Wild.\" In: Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (ACL 2023). Toronto, Canada. Shweta Yadav, Cornelia Caragea, Chenye Zhao, Naincy Kumari, Marvin Solberg, Tanmay Sharma. (2023). \"Towards Identifying Fine-Grained Depression Symptoms from Memes.\" In: Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (ACL 2023). Toronto, Canada. Tiberiu Sosea, Hongli Zhan, Jessy Junyi Li, and Cornelia Caragea. \"Unsupervised Summarization of Emotion Triggers Using Emotion-Biased PageRank.\" In: Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (ACL 2023). Toronto, Canada. Krishna Garg, Jishnu Ray Chowdhury, and Cornelia Caragea (2023). \"Data Augmentation for Low-Resource Keyphrase Generation.\" In: Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics: Findings (ACL-Findings 2023). Toronto, Canada. Mahshid Hosseini and Cornelia Caragea. (2023). \"Semi-supervised Domain Adaptation for Emotion-related Tasks.\" In: Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics: Findings (ACL-Findings 2023). Toronto, Canada. Yingjie Li and Cornelia Caragea. (2023). \"Distilling Calibrated Knowledge for Stance Detection.\" In: Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics: Findings (ACL-Findings 2023). Toronto, Canada. Yingjie Li, Chenye Zhao and Cornelia Caragea. (2023) \"TTS: A Target-based Teacher-Student Framework for Zero-Shot Stance Detection.\" In: Proceedings of The Web Conference (WWW 2023), Austin, TX. Mahshid Hosseini and Cornelia Caragea. (2023). Feature Normalization and Cartography-based Demonstrations for Prompt-based Fine-tuning on Emotion-related Tasks. In: Proceedings of The Association for the Advancement of Artificial Intelligence (AAAI 2023), Washington, DC. Mobashir Sadat and Cornelia Caragea. (2022). “Hierarchical Multi-Label Classification of Scientific Documents.” In: Proceedings of The 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP 2022), Abu Dhabi. Mahshid Hosseini and Cornelia Caragea. (2022). “Calibrating Student Models for Emotion-related Tasks.” In: Proceedings of The 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP 2022), Abu Dhabi. Hongli Zhan, Tiberiu Sosea, Cornelia Caragea, and Junyi Jessy Li. (2022) “Why Do You Feel This Way? Summarizing Triggers of Emotions in Social Media Posts.” In: Proceedings of The 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP 2022), Abu Dhabi. Mobashir Sadat and Cornelia Caragea. (2022). “Learning to Infer from Unlabeled Data: A Semi-supervised Learning Approach for Robust Natural Language Inference.” In: Proceedings of The 2022 Conference on Empirical Methods in Natural Language Processing: Findings (EMNLP Findings 2022), Abu Dhabi. Tiberiu Sosea and Cornelia Caragea. (2022). “Leveraging Training Dynamics and Self-Training for Text Classification.” In: Proceedings of The 2022 Conference on Empirical Metho",
  "content_length": 14456,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:11"
}