{
  "name": "Coskun Bayrak",
  "homepage": "http://ualr.academia.edu/CoskunBayrak",
  "status": "success",
  "content": "Coskun Bayrak - University of Arkansas at Little Rock Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Coskun BayrakUniversity of Arkansas at Little Rock, Computer Science, Faculty MemberaddFollowdoneFollowingFollowers159Following18Co-authors20Public ViewsDr. Coskun Bayrak is a professor in the department of Computer Science at the University of Arkansas at Little Rock (UALR). Also, at UALR, he has been serving on the Faculty of Bioinformatics since 2000. His primary research is in the intersection of software engineering, component based development, data mining, and Biomedical Engineering. However, he also has interest in modeling and simulation, cellular automata, mobile application development, health care application development, and monitoring and process control in health care. Dr. Bayrak has published over two hundred research articles in scientific conferences and journals, given tutorials at major conferences, and served on program committees for numerous international conferences and symposiums. Currently, he is serving as an Associate Editor for the special issue of Soft Computing in Software Engineering, a journal part of Applied Soft Computing, Elsevier (SCI).  He is a member of IEEE and ACM. Dr. Bayrak holds a BS from Slippery Rock University of Pennsylvania, and a MS from Texas Tech University, and Ph.D. from Southern Methodist University in Computer Science.Phone: 5015698137Address: Computer Science Department, College of Engineering and Information Technologies, Room, 5772801 S. University Ave.Little Rock, AR 72204lessRelated Authors Bijan HashemiTarbiat Modares University Don RossUniversity College Cork Siddhartha SikdarGeorge Mason University W. Clem KarlBoston University Cristiana FacchiniUniversità di Bologna Maurizio ForteDuke University Vittorio GalleseUniversità degli Studi di Parma (Italy) Fabio CuzzolinOxford Brookes University Aida KhairuddinUniversiti Teknologi Malaysia - UTM Carlo SemenzaUniversità degli Studi di PadovaInterests CVUploadsall118 Papers1 inproceedingsPapers by Coskun BayrakGenerative Anatomy Modelling Language (GAMLby Coskun Bayrak and Doga DemirelBackground This paper presents the Generative Anatomy Modeling Language (GAML) for generating var... more Background This paper presents the Generative Anatomy Modeling Language (GAML) for generating variation of 3D virtual human anatomy in real‐time. This framework provides a set of operators for modification of a reference base 3D anatomy. The perturbation of the 3D modelsis satisfied with nonlinear geometry constraints to create an authentic human anatomy.Methods GAML was used to create 3D difficult anatomical scenarios for virtual simulation of airway management techniques such as Endotracheal Intubation (ETI) and Cricothyroidotomy(CCT). Difficult scenarios for each technique were defined and the model variations procedurally created with GAML.Conclusion This study presents details of the GAML design, set of operators, types of constraints.Cases of CCT and ETI difficulty were generated and confirmed by expert surgeons. Execution performance pertaining to an increasing complexity of constraints using nonlinear programming was in real‐time execution.Download Modeling the Antipodal Connectivity Structure of Neural Communitiesby Bayazit Karaman and Coskun BayrakRecent studies support the theory that the brain is composed of modules and certain nodes establi... more Recent studies support the theory that the brain is composed of modules and certain nodes establish connections between the modules (Chen et al. , 2008; Ferri et al. , 2008; Meunier et al. , 2009). We provide a new mathematical model for exchange of information between the neural modules at the highest spatial and hierarchical level of bottom-up processes using EEG (ElectroEncephaloGraphy) (Niedermeyer & da Silva , 2005). Borsuk-Ulam's antipodal symmetry theorem is adapted to establish the mathematical model and a comprehensive algorithm called PNT (Transformation, Normaliza-tion, Projection) was developed. EEG data collected from a total of 49 experiments with the participation of 18 different test subjects was used to validate the effectiveness and accuracy of PNT method. Antipodal Con-nector Nodes (ACNs) were defined and compared for resting and active stages of the brain based on the PNT method.Download IntelliMatch: A SME-Driven Trainable Matching Engineby Hassan Elsalloukh and Coskun BayrakData matching rules are normally the result of collective experiences and judgments of subject ma... more Data matching rules are normally the result of collective experiences and judgments of subject matter experts (SMEs). Data matching requires a clearly defined set of rules to both determine a match as well as provide a &quot;usable&quot; ranking between potential matches. The main objectives here are to determine the feasibility of building a trainable matching engine that can help mimic SME behaviors and to assess alternate approaches in terms of ease-of-use, accuracy, and performance. This research attempts to minimize the effort required to develop and test SME-developed rules, thereby eliminating the implementation costs associated with developing products for newer markets.Download MEKTEP: a next generation course management systemInformation Technology Based Higher Education and Training, 2004Course management systems (CMS) are an increasingly important part of academic systems in higher ... more Course management systems (CMS) are an increasingly important part of academic systems in higher education. However, they introduce challenges in their deployment especially when the budgets are constrained, and their use becomes more confusing as the numbers of users increases rapidly. Due to the inherent difficulties, these tools, which were once considered to be the promising environments, are entering a Globus security model for grid environmentby Nitin Kanaskar and Coskun BayrakACM SIGSOFT Software Engineering Notes, 2005Grid technology is increasingly being looked upon as a natural extension of the internet for enga... more Grid technology is increasingly being looked upon as a natural extension of the internet for engaging in complex data processing tasks over resources which are distributed across the world. Architects and developers employing grid systems must take into consideration security implications. Dynamic generation of virtual organizations leads to a synergistic picture which has to address security requirements never encountered before. Globus toolkit has devised a framework for making secure use of grid resource components which has been proved to be a feasible solution by a number of academic and scientific organizations. This paper is an attempt to identify and discern mechanisms proposed by Globus security model with certain test scenarios [1] .Download The Relationship between DISTRIBUTED SYSTEMS and OPEN SOFTWARE DEVELOPMENTOpen source development (OSD) is a revolutionary new model for software development. Or at least ... more Open source development (OSD) is a revolutionarynew model for software development. Or at leastthat’s what many people want us to think. Most ofthe growing open source community, which now boasts several corporate sponsored projects such as Netscape’s Mozilla, cites Linux operating system developer Linus Torvaldsas the messiah of this new model. Eric Raymond, in his important paper, “The Cathedral and the Bazaar,” claims that Torvalds’ cleverest and most consequential hack was not the construction of the Linux kernel itself, but rather his quasi-guidance of the Linux development model—a best practiceextraordinaire of OSD [7]. But what is this modeland why does it work? Here, we explore thesequestions by examining the OSD model as a classicallydefined distributed system.Download Open Source Development and the World Wide Web: A Certain TensionThe development of the World Wide Web over the course of the past ten years has run rampant. The ... more The development of the World Wide Web over the course of thepast ten years has run rampant. The course it has taken has beenboth swift and unpredictable. The largest distributed system in theworld began as a utopian notion of an interconnected and openweb of information, the dream of the academic and intellectualalike. Today it is indeed a massive interconnected web ofcommunication and content, but the content, largely on the morepopular, if not pornographic, end of the mass media spectrum, isnot what the founders intended.Coinciding with the rapid growth of the web has been the equallyspeedy rise of the open source development community, whichcan best be understood as a distributed system in its own right.Indeed, the development of the web has been, outside of the Linuxproject, the largest arena for open source development. Andcurrent trends, witnessed by such significant open source projectsas Mozilla and Apache, seem to suggest that the open source wayof doing things is quickly becoming the web way of doing things.However, there is a certain tension growing between those whowould like to control, for economic profit or for the gratification ofcontrol itself, the direction of the web's development and thoseopen source developers who are responsible for a large portion ofthat growth. This paper explores the natural relationship, as wellas the growing tension within this relationship, between the opensource development community and the World Wide Web.Download Hilbert–Huang transform in detecting and analyzing the uterine contraction activitiesObjective: The diagnosis of labor is currently one of the most difficult problems encountered by ... more Objective: The diagnosis of labor is currently one of the most difficult problems encountere",
  "content_length": 27063,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:14"
}