{
  "name": "Cosmin Munteanu",
  "homepage": "http://www.cs.utoronto.ca/~mcosmin",
  "status": "success",
  "content": "﻿ Cosmin Munteanu Cosmin Munteanu Home Events Research Publications Students Service Teaching Contact Dr. Cosmin Munteanu Associate Professor Institute of Communication, Culture, Information and Technology, University of Toronto Mississauga Director Technologies for Ageing Gracefully Lab, University of Toronto Associate Professor Faculty of Information, University of Toronto Associate Professor (Cross-appointed) Department of Computer Science, University of Toronto Bio I am a Human-Computer Interaction scholar, conducting sociotechnical research at the intersection of user experience design, digital inclusion, aging, natural language processing, and ethics. I take a primarily ethnomethodology approach to study how voice- and language-enabled interactive technology and media interfaces should be designed in a safe, effective, inclusive, and ethical manner, in order to empower digitally underrepresented groups such as older adults. My area of expertise is at the intersection of Human-Computer Interaction, Automatic Speech Recognition, Natural User Interfaces, Mobile Computing, Ethics, and Assistive Technologies, having dedicated the past almost three decades to investigating the human factors of interacting with information-rich media and intelligent technologies. My main research goals are to facilitate natural, meaningful, and safe interactions between people and digital media and devices. My multidisciplinary interests include designing intelligent applications that improve access to information, support learning, and reduce digital marginalization, such as for older adults whose enjoyment of life and participation in society could be better supported by advances in interactive assistive technologies. Acknowledgement The sacred lands on which the University of Toronto and the University of Toronto Mississauga operate have been sites of human activity for 15,000 years. These lands are the traditional territories of the Huron-Wendat and Petun First Nations, the Seneca, the Haudenosaunee, and most recently, the Mississaugas of the Credit River. The territories were the subject of the Dish With One Spoon Wampum Belt Covenant, an agreement between the Iroquois Confederacy and Confederacy of the Ojibwe and allied nations to peaceably share and care for the resources around the Great Lakes. Today, the meeting place of Tkaronto (Toronto) is still the home to many Indigenous people from across Turtle Island, and I am grateful to have the opportunity to work in the community, on this territory. http://guides.library.utoronto.ca/aboriginal Home | Events | Research | Publications | Students | Service | Teaching | Contact",
  "content_length": 2659,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:15"
}