{
  "name": "Costas Tsatsoulis",
  "homepage": "https://www.linkedin.com/in/costas-tsatsoulis-b276954b",
  "status": "success",
  "content": "Costas Tsatsoulis - Southern Illinois University, Carbondale | LinkedIn Skip to main content Sign in to view Costas’ full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. Costas Tsatsoulis Sign in to view Costas’ full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. Carbondale, Illinois, United States Contact Info Sign in to view Costas’ full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. 585 followers 500+ connections See your mutual connections View mutual connections with Costas Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. Join to view profile Message Sign in to view Costas’ full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. Southern Illinois University, Carbondale Purdue University Report this profile Activity Follow Sign in to view Costas’ full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. 👩‍🏫👨‍🏫 Are you a Graduate Teaching Assistant at S&T? Check out these sessions held later this week by Missouri S&T's Center for Advancing Faculty… 👩‍🏫👨‍🏫 Are you a Graduate Teaching Assistant at S&T? Check out these sessions held later this week by Missouri S&T's Center for Advancing Faculty… Liked by Costas Tsatsoulis Join our workshop on August 12th at 5:00pm for help preparing your application for the NSF GRFP Fellowship. Contact Lphr29@mst.edu with questions and… Join our workshop on August 12th at 5:00pm for help preparing your application for the NSF GRFP Fellowship. Contact Lphr29@mst.edu with questions and… Liked by Costas Tsatsoulis Congratulations Dr. Borrok. Congratulations Dr. Borrok. Liked by Costas Tsatsoulis Join now to see all activity Experience & Education Southern Illinois University, Carbondale **** ********** *** ******** *** **** ** *** ******** ****** ******** ********** ** ******* *** ********** **** ******* ** ******** ********* ********** ** ***** ***** ********* **** ********* *** ************* ******** ************ ****** ********** ******** ** ******* * ** ********** *** *********** *********** undefined 1979 - 1983 ****** ********** ****** ** ******* * ** ********** *** *********** *********** View Costas’s full experience See their title, tenure and more. Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. Recommendations received Nicholas Ricco “ Dr Costas Tsatsoulis is a unique academic with applied insights to peripheral concepts available to but under utilized by most his peers. He takes his obligations for student academic enhancements to their zenith thereby creating THE BEGINNING of intellectualism at UNT which has been none existent in the 55 years I have been associated with this School. They are about 125 years behind in enhancement of intellectual thought processes. Debates are none existent, other than for competition; Ethics discussions misdirected or worse, permitted at grade school level! Costas Tsatsoulis is the only Dean who reviewed ethical discussions by students and refused to submit student sub par discussions for financial awards! ” 1 person has recommended Costas Join now to view More activity by Costas On July 10th, S&T's Rocket Design Team successfully launched Killer Queen Remastered up to a height of 12,080 feet! Fantastic work to all involved! On July 10th, S&T's Rocket Design Team successfully launched Killer Queen Remastered up to a height of 12,080 feet! Fantastic work to all involved! Liked by Costas Tsatsoulis Graduate Students, if you are planning to apply for the NSF GRFP Fellowship, please sign up to attend the workshop that the Office of Graduate… Graduate Students, if you are planning to apply for the NSF GRFP Fellowship, please sign up to attend the workshop that the Office of Graduate… Liked by Costas Tsatsoulis Missouri S&T strongly encourages all students, faculty and staff to get fully vaccinated before returning to campus for the fall semester. Vaccines… Missouri S&T strongly encourages all students, faculty and staff to get fully vaccinated before returning to campus for the fall semester. Vaccines… Liked by Costas Tsatsoulis S&T welcomes you! Are you interested in learning more about campus and what it’s like to be a Miner? Join us this summer for in-person and virtual… S&T welcomes you! Are you interested in learning more about campus and what it’s like to be a Miner? Join us this summer for in-person and virtual… Liked by Costas Tsatsoulis Check out Missouri University of Science and Technology's newest MS degree. The WSE program is an interdisciplinary graduate degree that combines… Check out Missouri University of Science and Technology's newest MS degree. The WSE program is an interdisciplinary graduate degree that combines… Liked by Costas Tsatsoulis Graduate Students, today marks the beginning of the summer semester. Please do not hesitate to reach out to us if you have a question or need… Graduate Students, today marks the beginning of the summer semester. Please do not hesitate to reach out to us if you have a question or need… Liked by Costas Tsatsoulis Congratulations to Matthew Luebbe for winning 3rd place in the 12th Annual Graduate Fellows Research Poster Session! Congratulations to Matthew Luebbe for winning 3rd place in the 12th Annual Graduate Fellows Research Poster Session! Liked by Costas Tsatsoulis View Costas’ full profile See who you know in common Get introduced Contact Costas directly Join to view full profile Other similar profiles Joseph C. Hoffman Joseph C. Hoffman Bronx, NY Connect Jeffrey Vitter Jeffrey Vitter United States Connect Barry Dunn Barry Dunn Brookings, SD Connect Mohammad Karim Mohammad Karim New Bedford, MA Connect Kristen Campbell Eichhorn Kristen Campbell Eichhorn Pennellville, NY Connect Kelly Clifton Kelly Clifton Vancouver, BC Connect Dr. Robert Nobles Dr. Robert Nobles Decatur, GA Connect Mark McLellan Mark McLellan Denton, TX Connect H. Dele Davies H. Dele Davies Omaha, NE Connect Jeff Lorber Jeff Lorber Springfield, IL Connect Scott Bellamy Scott Bellamy Spartanburg, SC Connect Angela Amar Angela Amar New York City Metropolitan Area Connect Terri Camesano Terri Camesano Newton Highlands, MA Connect Julie A Adams Julie A Adams Corvallis, OR Connect Craig H. Benson Craig H. Benson Verona, WI Connect Alison Morrison-Shetlar Alison Morrison-Shetlar Greater Lynchburg Area Connect Jim Strode Jim Strode Parkersburg, WV Connect Paul Rosenbloom Paul Rosenbloom Los Angeles, CA Connect Bob Kolvoord Bob Kolvoord Harrisonburg, VA Connect Tom Moliterno Tom Moliterno Amsterdam Area Connect Show more profiles Show fewer profiles Explore more posts David Umulis Purdue is proud to launch the nation’s first graduate degree directly focused on radiopharmaceutical manufacturing, preparing students to lead in a fast-growing field that unites cancer diagnosis and treatment. The hybrid-format program, led by Kara Weatherman, will combine hands-on lab training and a required in-person capstone. Through a valued partnership with SpectronRx, Purdue will also establish a dedicated training facility in Indianapolis to support student learning and industry collaboration. This program reflects Purdue’s commitment to working with Indianapolis-based partners to provide real-world experiences and advanced training — equipping graduates for a wide range of careers across pharmacy, chemistry, engineering, physics, health care, and more. It's a meaningful step forward in strengthening the talent pipeline for this critical and fast-evolving sector in Indianapolis and across the State of Indiana. https://lnkd.in/g2JnXTSP 167 10 Comments Purdue Polytechnic Purdue Polytechnic professor leads team awarded nearly $2 million NSF grant to bring microelectronics into K-12 classrooms. A new initiative led by Greg Strimel will recruit and prepare teachers in high-need districts to integrate microelectronics into STEM education: https://lnkd.in/gfGgb",
  "content_length": 14932,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:19"
}