{
  "name": "Craig A. Shue",
  "homepage": "http://www.cs.wpi.edu/~cshue",
  "status": "success",
  "content": "Craig A. Shue Main Page Projects Publications Teaching Resources Contact Brief Biography Dr. Craig Shue is a Professor and the Department Head of the Computer Science Department at the Worcester Polytechnic Institute. Shue is part of the WPI Cyber Security Program. His research in enterprise and residential network security has resulted in a range of government and private-sector funding, including a 2017 NSF CAREER Award. Shue directs WPI's Scholarship for Service Program and WPI's DoD Cyber Scholarship Program, both of which fund cyber security students in return for serving as government employees upon graduation. Shue joined the faculty at WPI in 2011 an an Assistant Professor. In 2017, he was awarded tenure and was promoted to an Associate Professor. He was promoted to the full Professor rank in 2023. He served as the Computer Science Department's Graduate Coordinator from 2018 through 2021. He became the Head of WPI's Department of Computer Science in 2022. Prior to joining WPI, Shue worked as a Cyber Security Research Scientist in the Cyber and Information Security Research Group at the Oak Ridge National Laboratory. He earned his B.S. in Computer Science from Ohio University and his M.S. and Ph.D. in Computer Science from Indiana University. Teaching Activities I was honored to receive the Romeo L. Moruzzi Young Faculty Award for Innovation in Undergraduate Education for my work in the undergraduate network security course. I am proud to teach at a university that recognizes and is committed to providing a high quality education. The course web pages and syllabi for my current and previous courses are available on my teaching web page. Research and Projects I am particularly interested in research and technologies that can have a practical impact. As an example, two of the projects I have led, Choreographer and USB-ARM, were among the 8 initial projects selected by the Department of Homeland Security's Transition to Practice Program. According to the DHS, these projects represent \"mature technologies that address an existing or imminent cyber security gap in public or private systems that impact national security.\" I am always looking for additional research efforts that can have high impact. My projects page describes my ongoing and recent research projects. I am happy to advise graduate students and undergraduate MQP projects that fit in the networking, security, or systems areas. I am an active member of the Cake Lab research group, which is open to everyone. Current Graduate Students I recruit talented students interested in networking, security and systems. I have the privilege of advising two graduate students currently: Adam Beauchaine (PhD) Shuwen Liu (PhD) Past Students The following students have previously worked with me and have since graduated. Their first position upon graduation is listed: Nicholas Brown (MS), MITRE Corporation Zorigtbaatar Chuluundorj (MS), MathWorks Heric Flores-Huerta (MS, co-advised with Lane Harrison) Anthony Chenard (MS), US Government Evan Frenn (MS), Veracode, Inc. Julian Lanson (MS), MITRE Corporation Yunsen Lei (PhD), George Washington University Yu Liu (PhD), Meta (formerly known as Facebook) Douglas MacFarland (MS), US Government Mohamed Najd (MS), Citrix Systems Joseph Petitti (MS), Solid State Scientific Corporation Joshua Pritchett (MS), MITRE Corporation Matthew Puentes (MS), MITRE Corporation Fredric Silberberg (MS), Microsoft Corporation Doran Smestad (MS), Carbon Black, Inc. Curtis Taylor (PhD), Oak Ridge National Laboratory Joseph Turcotte (MS), US Government MaryAnn VanValkenburg (MS, co-advised with Daniel Dougherty), MITRE Corporation Freddy Veloz Baez (MS, co-advised with Daniel Dougherty) Roger Wirkala (MS), US Government Media Coverage I have been featured as a quoted source for several media outlets, including Bloomberg BNA, Boston's CBS affiliate (WBZ), Boston's NPR affiliate (WBUR), Indianapolis's NBC affiliate (WTHR), the New York Times, the Wall Street Journal, and the Washington Post. WPI's media relations team maintains an updated list of my recent media coverage. I am happy to speak to members of the media on technology topics related to computer security, particularly in the enterprise or residential space. Professional Service and Outreach I currently serve as the Department Head of Computer Science and the Graduate Coordinator for the Cyber Security Program at WPI. I have formerly served as the Graduate Coordinator for the Computer Science Department at WPI. If you have questions about admission to our graduate programs, please feel free to contact me. I am the author of the InstructAssist system that is gaining adoption at WPI as an alternative for the Blackboard course management system. I have previously served as the coach for the WPI Cyber Defense Competition team, an extra-curricular activity to help students learn more about cyber security issues. The team competed at the 2012 and 2013 Northeast Collegiate Cyber Defense Competition (NECCDC) events. In 2012, WPI placed 9th. In 2013, WPI placed third. In 2014, WPI again placed third. A team from WPI participated in the 2013 MIT/LL Capture the Flag. Out of 23 teams, WPI placed 4th. For five years, I served as the faculty advisor for the WPI Cyber Security Club, a student group that provides demonstrations, activities, and other events to help students learn both about security defense and offense. Students interested in joining the club should complete the ethical hacking agreement form. Once the form is completed, the club officers will be automatically notified of the new membership request and will add the requestor. Cyber Security Program Computer Science Department Worcester Polytechnic Institute",
  "content_length": 5738,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:22"
}