{
  "name": "Craig Macdonald",
  "homepage": "http://www.dcs.gla.ac.uk/~craigm",
  "status": "success",
  "content": "Craig Macdonald - Professor of Information Retrieval Name:Prof Craig Macdonald Occupation: Professor of Information Retrieval in the School of Computing Science, University of Glasgow Research Interests: Expert Search; Blog, Web & Enterprise Information Retrieval Follow @craig_macdonald Home Contact Publications Thesis Software About Me I am a Processor in Information Retrieval, within the School of Computing Science at the University of Glasgow. I am interested in information retrieval (IR) in general, for instance in settings such as Web, Enterprise, social media and Smart cities, building upon observations from sensor). I regularly participate in TREC, and jointly co-ordinated the TREC Blog track from 2006-2010, the Microblog track (from 2011-2012), and the Web track (2014-). My thesis addressed access to expertise in enterprise environments, and was titled The Voting Model for People Search. I have since deployed an expert search system for the SICSA alliance of Scottish computing science schools. You may know of me as being involved in Terrier. Indeed, I am a lead developer for the Terrier IR platform, and also use Terrier in my research publications. The TerrierTeam and I also blog over at the TerrierTeam@Blogspot, and occasionally chat about IR on Twitter @craig_macdonald. Together with my colleagues Iadh Ounis and Dyaa Albakour, I am involved in the SMART FP7 project (Search engine for multimedia environment generated content), which aims to build a search engine for content from sensor networks, combined with recent local updates from social networks such as Twitter. The SMART project received much press coverage, including from the BBC, the Telegraph, the Wall Street Journal, and the Scotsman. You can try out our venue suggestion demo built as part of the SMART project. I was co-chair and Workshop chair of CIKM 2011, which was recently held in Glasgow (October 2011). In the more distant past, I have been involved in the organisation ESSIR 2007, and chaired the industry day for ECIR 2008, both of which were also held in Glasgow. I am also a member of BCS IRSG and ACM SIGIR.",
  "content_length": 2119,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:27"
}