{
  "name": "Cristian Ruz",
  "homepage": "https://www.ing.uc.cl/academicos-e-investigadores/cristian-daniel-ruz-ruz",
  "status": "success",
  "content": "CRISTIAN DANIEL RUZ RUZ | Ingeniería UC Inicio Nuestra Escuela Sobre Ingeniería UC Internacionalización Retribuye Proyecto Ingeniería 2030 Código de Honor Consejo Asesor Autoridades y equipos Programas de Estudio Admisión Pregrado Postgrado Educación Profesional Acreditaciones Académicos e Investigación Académicos Ingeniería UC Publicaciones Investigación en pregrado Proyectos de investigación Concursos postdoctorales Libro de Investigación Divulgación Científica y Tecnológica Innovación y Emprendimiento Ecosistema de emprendimiento Formación académica Programas extracurriculares Emprendimiento Social Apoyo al emprendimiento Alumnos emprendedores Vida Universitaria Deporte Cultura Centro de Alumnos de Ingeniería Proyectos de Alumnos Mujeres Ingeniería UC Cuerpo de Tutores Pastoral Vinculación con el Medio Transferencia Alumni Ingeniería UC Preingeniería Atracción y desarrollo de talento Plataforma de Colocaciones Responsabilidad Social Oficina de Vinculación con la Industria Contacto Departamentos y áreas académicas SIDING English Home » Académicos e Investigadores » CRISTIAN DANIEL RUZ RUZ Académicos Ingeniería UC CRISTIÁN RUZ Profesor Docente Asistente Especialidad: Computación de alto rendimiento, high performance computing Departamento de Ciencia de la Computación Director Asociado, Dirección de Pregrado cruz@uc.cl +562 2354 7048 Líneas de Investigación Publicaciones Biografía Educación Noticias Relacionadas Líneas de Investigación Computación de alto rendimiento (HPC), Sistemas Distribuidos, Paralelismo, Programación de GPU, Docencia en programación. Publicaciones Piña, M. A., & Hilliger, I., & Baier, J. A., & Melian, C., & Ruz, C., & González, T. A. (2021, July), A Protocol to Follow-up with Students in Large-enrollment Courses Paper presented at 2021 ASEE Virtual Annual Conference Content Access, Virtual Conference. 10.18260/1-2--36603 (2021) A Protocol to Follow-up with Students in Large-enrollment Courses ASEE Peer Ibáñez M., Ruz C., Henrio L. and Bustos-Jiménez J. (2016) Reconfigurable Applications Using GCMScript IEEE Cloud Computing 3 3 30-39 Aubonnet T., Henrio L., Kessal S., Kulankhina O., Lemoine F., Madelaine E., Ruz C. and Simoni N. (2015) Management of service compositionbased on self-controlled components Journal of Internet Services and Applications 6 15 17pp Baude F., Henrio L. and Ruz C. (2015) Programming Distributed and Adaptable Autonomous Components - the GCM/ProActive framework Software-Practice and Experience 45 9 1189-1227 Biografía 2 publicaciones ISI, año 2015. 5 cursos dictados año 2015: Sistemas Operativos y Redes (semestres I y II), Compiladores (Semestre I), Sistemas Distribuidos (Semestre II), Introducción a la Programación (Semestre II). Educación Magister en Ciencias de la Ingeniería, Pontificia Universidad Católica de ChileIngeniero Civil en Computación, Pontificia Universidad Católica de ChileDocteur, Université Nice Sophia Antipolis Noticias Relacionadas 238 ESTUDIANTES RECIBIERON SUS DIPLOMAS DE LICENCIATURA EN EMOTIVA CEREMONIADecana Loreto Valenzuela recibe a estudiantes que participaron en concurso de programación más importante392 Estudiantes recibieron sus diplomas de Licenciatura en emotiva ceremonia47 estudiantes de Ingeniería UC obtuvieron Matrícula de Honor este 2023Escolares participan en VisitING virtual para conocer más sobre Ingeniería UCPresentan la nueva Unidad de Bienestar de la Escuela de Ingeniería UCSe realizan las primeras reuniones virtuales del Plan de Mentoring de PregradoAnuncian vicedecana interina y nuevo director asociado de pregrado desde marzoSe cuadruplican las inscripciones de MOOCs durante el primer semestre de este añoEstudiantes de Ingeniería UC realizan taller de videojuegos para escolaresProfesores son reconocidos por su participación en Cursos Abiertos Masivos en Línea CONÉCTATE CON INGENIERÍA UC Contáctate con nosotros Información sobre las distintas áreas de Ingeniería UC. Contáctanos Postula a Ingeniería UC Conoce la información relevante para postular a la carrera. Postula Concursos de Postdoctorado Descubre las ofertas de postdoctorado Postula Mapa Campus San Joaquín Retribuye a Ingeniería UC Trabaja con nosotros Error: Formulario de contacto no encontrado. Email Todo Noticias Contenido Institucional",
  "content_length": 4261,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:33"
}