{
  "name": "Cristina Conati",
  "homepage": "http://www.cs.ubc.ca/~conati",
  "status": "success",
  "content": "Cristina Conati | Computer Science at UBC Skip to main content Search Faculty of Science Computer Science Menu MyCS Cristina Conati Professor Email conati@cs.ubc.ca Office ICCS 107 Webpages Human-AI Interaction Lab Publications Google Scholar Academic Information M.Sc. (Honors), University of Milan (1988); Research Fellow, I.R.S.T. Istituto per la Ricerca Scientifica e Tecnologica (1989-1991); Research Programmer Carnegie Mellon University (1992); M.Sc., University of Pittsburgh (1995); Ph.D., University of Pittsburgh (1999); Assistant Professor, University of British Columbia (1999-2005), Associate Professor, University of British Columbia (2006 - 2016), Professor (2016); Distinguished Scholar, Sauder School of Business (2020 - 2023); Humboldt Research Fellow (October 2024) Research Areas Artificial Intelligence & Machine Learning Human-Computer Interaction Human‐AI Interaction Research Groups Artificial Intelligence Human-AI Interaction Machine Learning Research Centres AMLTN CAIDA DSI DFP Interests Cristina's research is at is at the intersection of Artificial Intelligence (AI), Human-Computer Interaction (HCI), and Cognitive Science, with the goal  to create AI systems that can both perform useful tasks and be well accepted by their users. A key aspect of this endeavor is enabling AI systems to predict and monitor relevant properties of their users (e.g., states, skills, needs, emotions) and personalize the interaction accordingly, in a manner that maximizes both task performance as well user satisfaction. Toward this goal, Cristina is especially interested in investigating how to enable AI technology to strike the right balance between providing accurate predictions and decision-making while maintaining transparency, user control, and trust. For more details on current and past projects, see https://hai.cs.ubc.ca/ Awards AAAI Fellow Killam Research Prize in Science 2022 Educational Data Mining Test of Time award ACM Distinguished Member Best Student Paper Award IJCAI 2019 Workshop Best Paper Award AAAI Senior Member IVA Best Paper Award ACM TiiS Best Paper Award International Conference on User Modeling, Adaptation and Personalization Best Paper Award UMAP Best Paper Award UBC Killam Research Fellowship NSERC Strategic Grant International Conference Intelligent User Interfaces IUI Best Paper Award Courses 2025 Winter CPSC_V 554C - Term 2 - Topics in Human-Computer Interaction - HUMAN-CENTRED AI CPSC_V 532C - Term 2 - Topics in Artificial Intelligence - HUMAN-CENTRED AI COGS_V 303 - Term 2 - Research Methods in Cognitive Systems 2024 Winter COGS_V 303 - Term 2 - Research Methods in Cognitive Systems COGS_V 303 - Term 1 - Research Methods in Cognitive Systems 2023 Winter CPSC_V 554C - Term 2 - Topics in Human-Computer Interaction - HUMAN-CENTRED AI CPSC_V 532C - Term 2 - Topics in Artificial Intelligence - HUMAN-CENTRED AI 2022 Winter CPSC_V 554C - Term 2 - Topics in Human-Computer Interaction - HUMAN-CENTRED AI CPSC_V 532C - Term 2 - Topics in Artificial Intelligence - HUMAN-CENTRED AI 2021 Winter CPSC_V 532C - Term 2 - Topics in Artificial Intelligence - HUMAN-CENTRED AI CPSC_V 554C - Term 2 - Topics in Human-Computer Interaction - HUMAN-CENTRED AI 2020 Winter CPSC_V 322 - Term 2 - Introduction to Artificial Intelligence CPSC_V 322 - Term 1 - Introduction to Artificial Intelligence 2019 Winter CPSC_V 554C - Term 1 - Topics in Human-Computer Interaction - HUMAN-CENTRED AI CPSC_V 532C - Term 1 - Topics in Artificial Intelligence - HUMAN-CENTRED AI 2017 Winter CPSC_V 322 - Term 1 - Introduction to Artificial Intelligence 2016 Winter CPSC_V 322 - Term 2 - Introduction to Artificial Intelligence 2015 Winter CPSC_V 322 - Term 2 - Introduction to Artificial Intelligence CPSC_V 502 - Term 1 - Artificial Intelligence I 2014 Winter CPSC_V 322 - Term 2 - Introduction to Artificial Intelligence 2014 Summer CPSC_V 322 - Term 1 - Introduction to Artificial Intelligence",
  "content_length": 3932,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:37"
}