{
  "name": "Cristiano Giuffrida",
  "homepage": "https://www.vusec.net/people/cristiano-giuffrida",
  "status": "success",
  "content": "Cristiano Giuffrida - vusec Skip to content Full Professor Contact Details Email address *protected email* PGP key *protected email* Twitter *protected email* Phone +31 20 598 4259 Office 11A-27 Directions https://www.vusec.net/directions Mailing address Cristiano GiuffridaDept of Computer ScienceNU building, Vrije Universiteit AmsterdamDe Boelelaan 11111081 HV, AmsterdamThe Netherlands Research I am Full Professor and Chair of “Hardware Security” at VU Amsterdam. I co-lead VUSec. I received a Ph.D. cum laude from VU Amsterdam in 2014, advised by Prof. Andrew S. Tanenbaum. I was awarded the Roger Needham Award at EuroSys for the best PhD thesis in Computer Systems in Europe and the Dennis M. Ritchie Award at SOSP for the best PhD thesis in Computer Systems worldwide in 2015, a VENI grant (the Dutch Equivalent of a NSF CAREER Award, PhD+3) in 2017, a VMWare Early Career Faculty Award in 2020, a EuroSys Jochen Liedtke Young Researcher Award in 2022, and the Dutch Prize for ICT Research in 2023. My research spans across several aspects of computer systems, with a focus on systems security. Selected Publications See here for the full list of publications. Teaching Advanced Operating Systems, MSc. Hardware Security, MSc. Compiler Construction, MSc/BSc. Service Chapter Chair EuroSys Vice-chair Program Chair DIMVA EuroSec Artifact Evaluation Chair USENIX Security EuroSys PC Member SOSP OSDI EuroSys USENIX ATC S&P USENIX Security CCS NDSS EuroS&P RAID DIMVA Profiles Google Scholar ResearchGate LinkedIn Book me for a meeting News Feb, 2023 I was awarded the Dutch Prize for ICT Research [Link | Link]. February 9, 2023, The Netherlands. Apr, 2022 During EuroSys, I was awarded the EuroSys Jochen Liedtke Young Researcher Award [Link]. April 7, 2022, Rennes, FR. Mar, 2022 Our USENIX SEC “BHI / Spectre-BHB” paper hit the news [Link]. Aug, 2021 Our “Rage Against the Machine Clear” paper won the Distinguished Paper Award at the USENIX Security Symposium [Link]. Aug, 2021 Our CCS “BlindSide” paper won the Pwnie Award for Most Innovative Research at Black Hat USA [Link]. Apr, 2021 Our ASPLOS “Debug^2” paper won the Distinguished Paper Award [Link]. Apr, 2021 Our USENIX SEC “SMASH” paper hit the news [Link]. Jan, 2021 Our S&P “TRRespass” paper received a IEEE Micro Top Picks Honorable Mention. Dec, 2020 Our S&P “TRRespass” paper won the Pwnie Award for Most Innovative Research at Black Hat USA [Link]. Sep, 2020 Our S&P “RIDL” paper won the Dutch Cyber Security Research Award [Link]. Sep, 2020 Our CCS “BlindSide” paper hit the news [Link]. Jun, 2020 Our S&P “CrossTalk” paper hit the news [Link]. May, 2020 Our S&P paper “TRRespass: Exploiting the Many Sides of Target Row Refresh” won the Best Paper Award [Link]. Mar, 2020 I have been awarded a VMware Early Career Faculty Award. Mar, 2020 Our S&P “TRRespass” paper hit the news [Link]. Sep, 2019 Our S&P “NetCAT” paper hit the news [Link]. May, 2019 Our S&P paper “RIDL: Rogue In-flight Data Load” hit the news [Link]. May, 2019 Our S&P paper “Exploiting Correcting Codes: On the Effectiveness of ECC Memory Against Rowhammer Attacks” won the Best Practical Paper Award [Link]. September, 2018 Our RAID paper “Defeating Software Mitigations against Rowhammer: A Surgical Precision Hammer” won the Best Paper Award [Link]. May, 2018 Our S&P paper “Grand Pwning Unit: Accelerating Microarchitectural Attacks with the GPU” hit the news [Link]. March, 2018 Our NDSS paper “ASLR on the Line: Practical Cache Attacks on the MMU” won the Dutch Cyber Security Research Award [Link]. November, 2017 Our CCS paper “Drammer: Deterministic Rowhammer Attacks on Mobile Platforms” won the CSAW Applied Research Best Paper Award [Link]. August, 2017 Our NDSS paper “ASLR on the Line: Practical Cache Attacks on the MMU” and our CCS paper “Drammer: Deterministic Rowhammer Attacks on Mobile Platforms” won 2 Pwnie Awards at Black Hat USA (Most Innovative Research, Best Privilege Escalation Bug) [Links: 1 | 2]. July, 2017 I have been awarded a VENI grant (the Dutch equivalent of a NSF CAREER award in the US, PhD+3) for my PantaRhei project proposal [Link]. April, 2017 Our CCS paper “Drammer: Deterministic Rowhammer Attacks on Mobile Platforms” won the Dutch Cyber Security Research Award [Link]. February, 2017 Our NDSS paper “ASLR on the Line: Practical Cache Attacks on the MMU” hit the news [Link]. October, 2016 Our S&P paper “Dedup Est Machina: Memory Deduplication as an Advanced Exploitation Vector”, our USENIX Security paper “Flip Feng Shui: Hammering a Needle in the Software Stack”, and our CCS paper “Drammer: Deterministic Rowhammer Attacks on Mobile Platforms” hit the news [Links: 1 | 2 | 3]. August, 2016 Our S&P paper “Dedup Est Machina: Memory Deduplication as an Advanced Exploitation Vector” won the Pwnie Award for Most Innovative Research at Black Hat USA [Links: 1 | 2 | 3]. August 3, 2016, Las Vegas, NV, USA. June, 2016 Our paper “OSIRIS: Efficient and Consistent Recovery of Compartmentalized Operating Systems” was selected for the Best paper session at DSN. June 28-July 1, 2016, Toulouse, France. October, 2015 During SOSP, I was awarded the Dennis M. Ritchie Award for the best PhD thesis in Computer Systems worldwide[Links: 1 | 2 | 3 | 4 | 5 | 6 | 7]. October 5, 2015, Monterey, CA, USA. April, 2015 During EuroSys, I was awarded the Roger Needham Award for the best PhD thesis in Computer Systems in Europe[Links: 1 | 2 | 3 | 4 | 5 | 6]. April 22, 2015, Bordeaux, FR. June, 2014 Invited talk at USENIX ATC 2014: “Back to the Future: Fault-tolerant Live Update with Time-traveling State Transfer” [Talk]. June 19-20, 2014, Philadelphia, PA, USA. January, 2014 Our paper “Evaluating Distortion in Fault Injection Experiments” awarded Best paper at HASE. January 9-11, 2014, Miami, FL, USA. November, 2013 Our paper “Back to the Future: Fault-tolerant Live Update with Time-traveling State Transfer” awarded Best student paper at LISA. November 3, 2013, Washington, D.C., USA. June, 2012 Summer intership in the Linux kernel memory team at Google, Mountain View, CA, USA. Systems and Network Security Group at VU Amsterdam Recent Tweets Recent Posts Archives",
  "content_length": 6155,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:34"
}