{
  "name": "Cristina Barrado",
  "homepage": "http://personals.ac.upc.edu/cristina",
  "status": "success",
  "content": "Curriculum Vitae (Research) Last Update 31/Oct/2007 Index Personal Data Current Possition Contact Address Graduated Studies Languages Contracts for R&D Projects Research Publications Committees Participation Administrative Positions Other Information Personal Data Name: Cristina Barrado Date of birth: 29/Mar/1965 Place of birth: Barcelona, Spain Current Possition University Lecturer / Assistant Professor Research on ICARUS group Computer Architecture Department Castelldefels School of Technology Technical University of Catalonia Contact addresses Av. Canal Olimipic, PMT-C4-013 08600 Castelldefels, Spain e-mail: cristina <dot> barrado <at> upc <dot> edu tel: +34 93 413 72 08 Graduated Studies Comuter Science Engineer,Barcelona School of Informatics, 1989 Ph. D. on Computer Sciences, Technical University of Catalonia, 1997 Languages Language Read Writen Spoken English Good Good Good Spanish Native Native Native French Good Medium Low Catalan Native Native Native Contracts for R&D Projects Ministry of Education of Spain ICARUS (Intelligent Communications and Avionics for Robust Unammed aerial Systems). MEC-TIN-2007-63927. From 2007 to 2010. Main researcher Enric Pastor. Spanish UAV technologic participation in European Platforms. MEC-PCI-2005-A6-0374. From 2005 to 2007. Main researcher Enric Pastor. High Performance Computing IV: Architectures, Compilers, Operating Systems, Tools And Applications. MEC-TIN-2004-07739-C02-01. From 2004 to 2007. Main researcher Mateo Valero. Ministry of Science and Technology of Spain Wireless Communications. MCYT FEDER 2003-2004 UNPC-R008. From 2003 to 2005. Main researcher Cristina Barrado. Local Area Networks. MCYT FEDER 2003-04 UNPC-R005. From 2003 to 2005. Main researcher Cristina Barrado. A0 Building Networks. MCYT FEDER 2003-04 UNPC-R004. From 2003 to 2005. Main researcher Cristina Barrado. Castelldefels Campus Networks. MCYT FEDER 2003-04 UNPC-R003. From 2003 to 2005. Main researcher Cristina Barrado. High Performance Computing III: Architectures, Compilers, Operating Systems, Tools And Applications. From 2001 to 2004. High Performance Computing II. From 1998 to 2001. Main researcher Mateo Valero. High Performance Computing. From 1995 to 1998. Main researcher Mateo Valero. Architectures and Compilers for Supercomputers. From 1992 to 1995. Main researcher Mateo Valero. Architectures, Programming Tools and Operating Systems for Multiprocessors. From 1989 to 1992. Main researcher Jesús Labarta. European Union Framework Programme ASRA-HPC. ESPRIT 28159. From 1998 to 2001. Main local researcher Jesús Labarta. MHAOTEU. LTR 24942. From 1997 to 2000. Main researcher Antonio González. COMANDOS II. ESPRIT. From 1989 to 1992. Main local researcher Jesús Labarta. Local Goverment: Diputación de Barcelona WiFi for Public Libraries. From 2005 to 2007. Main researcher Cristina Barrado. Research Publications Research Papers on Unmanned Aerial Systems Conference: 46th AIAA Aerospace Science Meeting and Exhibit Tittle: Service Abstraction Layer for UAV Flexible Application Development Authors: P. Royo, J. López, E. Pastor and C. Barrado Date and Place: Jan 2008 (to be published). Reno, Nevada, USA. Conference: ACM/IFIP/USEUNIX 8th International Middleware Conference Tittle: A Middleware Architecture for Unmanned Aircraft Avionics Authors: J. López, P. Royo, E. Pastor, C. Barrado and E. Santamaria Date and Place: Nov 2007. NewPort, California, USA. Conference: IEEE/AIAA 26th Digital Avionics Systems Conference Tittle: Increasing UAV Capabilities through Autopilot and Flight Plan Abstraction (Best Student Paper Award) Authors: E. Santamaria, P. Royo, J. López, C. Barrado, E. Pastor and X. Prats Date and Place: Oct 2007. Dallas, Texas, USA. Conference: International UAS Conference Tittle: Project SKY-EYE: Appliying UAVs to Forest Fire Fighter Support and Monitoring Authors: E. Pastor, P. Royo, J. López, C. Barrado, E. Santamaria and X. Prats Date and Place: Jun 2007. Paris, France. Research Papers on High Performance Computing Conference: 6th EuroPar Conference, Lecture Notes on Computer Sciences, Springer-Verlag Tittle: Sparse Matrix Structure for Dynamics Parallelisation Efficiency Authors: M. Ast, C. Barrado, J.M.Cela, R. Fisher, J. Labarta, O. Laborda, H. Manz and U. Schulz Date and Place: Ago 2000. Munich, Germany. Conference: 5th EuroPar Conference, Lecture Notes on Computer Sciences, Springer-Verlag Tittle: Influence of Variable Time Operations in Static Instruction Scheduling Authors: P. Borensztejn, C. Barrado, J. Labarta Date and Place: Sep 1999. Toulouse, France. Conference: 3th EuroPar Conference, Lecture Notes on Computer Sciences, Springer-Verlag Tittle: Hamiltonian Recurrence for ILP Authors: C. Barrado, J. Labarta Date and Place: Sep 1997. Passau, Germany. Conference: Supercomputing Research Exhibit \"Polaris at Work\" ACM/IEEE Computer Society Press Tittle: Ictíneo: A Tool For Research and ILP Authors: E. Ayguadé, C. Barrado, A. González, J. Labarta, D. López, S. Moreno, D. Padua, F. Reig, M. Valero Date and Place: Nov 1996. Pittsburg, USA. Conference: Parallel Architectures and Compiling Techniques., PACT, IFIP-WG10.3 Tittle: Automatic Generation of Loop Scheduling for VLIW Authors: C. Barrado, J. Labarta, E. Ayguadé, M. Valero Date and Place: Jun 1995. Limasol, Cyprus. Conference: 5th Workshop on Compilers for Parallel Computing Tittle: Generating a Periodic Pattern for VLIW Authors: C. Barrado, J. Labarta, E. Ayguadé, M. Valero Date and Place: Jun 1995. Málaga, Spain. Conference: VI Jornadas de Paralelismo Tittle: Ictíneo, una herramienta para la investigación en paralelismo a nivel de instrucción Authors: E. Ayguadé, C. Barrado, J. Labarta, J. Llosa, D. López, S. Moreno, D. Padua, E. Riera, M. Valero Date and Place: Jul 1995. Barcelona, Spain. Conference: 6th IASTED International Conference of the ISMM Parallel and Distributed Computing, HAMZA ACTA PRESS Tittle: An efficient Scheduling of Doacross Authors: C. Barrado, J. Labarta, E. Ayguadé Date and Place: Oct 1994. Washington DC, USA. Conference: 6th IASTED International Conference of the ISMM Parallel and Distributed Computing, HAMZA ACTA PRESS Tittle: Measures of Parallelism Authors: P. Borensztejn, J. Labarta, C. Barrado Date and Place: Oct 1994. Washington DC, USA. Conference: 6th International PARLE (Parallel Architectures and Languages Europe) Lecture Notes on Computer Sciences, Springer-Verlag Tittle: Implementation of GTS Authors: C. Barrado, P. Borensztejn, J. Labarta Date and Place: Jul 1994. Athens, Greece. Conference: IEEE Proceedings of the Parallel and Distributed Processing, Euromicro Workshop Tittle: Measures of Parallelism at Compile Time Authors: P. Borensztejn, J. Labarta, C. Barrado Date and Place: Jan 1993. GranCanaria, Spain. Other Research Papers Conference: JoDoDAC'07 Tittle: Sistemas Operativos en Castelldefels Authors: C. Barrado, D. Royo, R. Hidalgo Date and Place: Feb 2007. Barcelona, Spain. Conference: EUNIS 12th International Conference of European Information Systems Tittle: Global IT Strategy Plan for Universities in Spain Authors: A. Fernéndez, C. Barrado and S. Fernández Date and Place: Jun 2006. Tartu, Estonia. Conference: JoDoDAC'02 Tittle: Experiencia de corrección entre compañeros en la EPSC Authors: C. Barrado Date and Place: Feb 2002. Barcelona, Spain. Conference: 3as Jornadas Multimedia Educativo ICE-UB Tittle: Experiencias de elaboración de material docente para el aprendizaje independiente de Sistemas Operativos Authors: A. Ramírez, M. Gil, C. Barrado, N. Navarro, E. Morancho, R. Badía, L. Navarro Date and Place: Jun 2001. Barcelona, Spain. Conference: JoDoDAC'99 Tittle: Usemos las encuestas a los alumnos para mejorar nuestra docencia Authors: C. Barrado, I. Gallego, M. Valero-Garcia Date and Place: Feb 1999. Barcelona, Spain. Committees Participation Organization of Workshops Jornadas CRUE-TIC Organised by Spanish University Rectors Conference 2004 Jornadas Docentes del DAC Organised by Department of Computer Architecture 2002 and 2003 Awards Committees Participation Innovation Award of the Internet Global Conference Organised by Barcelona Digital Foundation For Internet Projects May 2005 Davyd Luque Award Organised by UPCnet SL For Innovative ideas on ICT applications Abril 2005 Technical Conference Reviewer CIAWI papers revisor Organised by IADIS Iberoamerica WWW/Internet For Internet Papers 2006 and 2007 IPDPS papers revisor Organised by International Parallel and Distributed Processing Symposium For Parallelism Papers 2002 MICRO papers revisor Organised by IEEE 35th Micro Conference For Microprocessors and Computer Architecture papers 2002 Administrative Possitions Vicerector-Assistant of the Technical University of Catalonia fot the ICT, 2002-2006 Vicepresident and managing Director of UPCnet SL ICT Enterprise, 2003-2006 Assitant director of the Computer Architecture Department for Teaching Courses, 2000-2001 Other Information Silver Academic Medal by Technical University of Catalonia, 2006",
  "content_length": 9022,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:01"
}