{
  "name": "Cristian-Alexandru Staicu",
  "homepage": "https://www.staicu.org",
  "status": "success",
  "content": "Cristian-Alexandru Staicu CRISTIAN-ALEXANDRU STAICU About Me Publications Work With Me Latest News WWW Paper January 2025 Our paper on differential measurements of websites in dveloping and developed countries will appear at TheWebConf 2025. Congrats Masud! NDSS Paper September 2024 Our paper on analyzing the security risks of the Deno runtime will appear at NDSS 2025. Congrats Abdullah! ASE Paper August 2024 Our work studying the security implications of gradual typing will appear at ASE 2024. Congrats Dominic! CCS Paper September 2023 Our paper on analyzing the risks incurred by JavaScript bundles will appear at CCS 2023. Congrats Jerry! USENIX Paper #3 January 2023 Our paper on testing language-based JavaScript sandboxes will appear at USENIX Security 2023. Congrats Abdullah! ICSE Paper December 2022 Our paper describing SecBench.js, an executable security benchmark for Node.js, will appear at ICSE 2023. Congrats Masud and Adithya! USENIX Paper #2 November 2022 Our paper on the dangers of native extensions in scripting languages will appear at USENIX Security 2023. USENIX Paper #1 July 2022 Our paper studying the relation between prototype pollution and RCE will appear at USENIX Security 2023. CCS 2021 Paper September 2021 Our paper on preventing dynamic library compromise in Node.js packages will appear at CCS 2021. Welcome Abdullah and Masud February 2021 Abdullah Alhamdan and Masudul Hasan Masud Bhuiyan joined my research group as PhD students. Welcome! Hi there, Welcome to my research page. I am Cristian, a tenure-track faculty at CISPA – Helmholtz Center for Information Security in Saarbrücken, Germany. I completed my PhD in the Software Lab group at TU Darmstadt, Germany under the supervision of Michael Pradel. Prior to that, I obtained my Master's from EIT Digital, a European double degree Master's program. Concretely, I studied one year at the University of Twente, Netherlands and one year at University of Trento, Italy. I obtained my Bachelor's degree in Computer Engineering from Politehnica University of Timișoara, Romania. You can check my complete CV here. My core research interest is in system security, at the intersection of software/web security, software engineering and programming languages. One of the central goals of my research group is to directly contribute to the open-source ecosystem: either by building tools that can be used by practitioners or by uncovering security vulnerabilities in real systems/projects. Below are the most important themes of my research: Server-side JavaScript security: in USESEC2019 we analyze in detail the threats in the npm ecosystem, in NDSS2018 we study injection vulnerabilities in the ecosystem and propose a way to defend against them, in USESEC2018 we show that vulnerabilities in npm libraries affect real websites, and in ICSE2020 we propose automatically extracting taint specifications for npm packages. Client-side (web) security: in USESEC2019 we show how authenticated cross-origin image requests enable targeted tracking, and in TheWebConf2019 we study the prevalence of minified and obfuscated JavaScript code on the web and discuss. Lightweight program analysis for vulnerability detection: in PLAS@CCS 2019 we study the impact of considering implicit flows in information flow analysis for vulnerability detection, in NDSS2018 we use intra-procedural data flow analysis for detecting injection vulnerabilities in npm packages, in ICSE2020 we employ taint analysis for specification extraction, and in CSUR2017 we survey the main challenges for JavaScript dynamic program analysis. Novel software engineering use cases for existing unit tests: in ASE 2017 we propose using constants in existing unit tests for boosting the performance of automatic test generation, and in ICSE2020 we advocate using existing unit tests for extracting taint specifications. Applied machine learning: in TheWebConf2019 we use unsupervised machine learning for automatic source code classification, and in ASE 2017 we use more lightweight, statistical techniques for augmenting state-of-the-art automatic test generation. Below are some worth-mentioning vulnerabilities I found during my research: vm2 issue 285, CVE-2021-21413 - sandbox breakout vulnerabilities. HackerOne report 329957 - a privacy vulnerability in Twitter that allows targeted user-tracking through cross-origin image requests. CVE-2017-16042 - a command injection vulnerability in growl, an npm package. CVE-2017-16119 - a ReDoS vulnerability in fresh, an npm package that ships with the express framework. CVE-2017-15010 - a ReDoS vulnerability in tough-cookie, a popular npm package. Several vulnerabilities in npm packages, identified during an internship at Semmle, now GitHub UK. node-sqlite issue 1450 - hard crash of the Node.js process.",
  "content_length": 4809,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:30"
}