{
  "name": "Cristian Cadar",
  "homepage": "https://www.doc.ic.ac.uk/~cristic",
  "status": "success",
  "content": "Cristian Cadar: Home Page Cristian Cadar Professor Department of Computing Imperial College London ERC Consolidator Grant Awardee EPSRC Early-Career Fellow (2014-2019) @c_cadar c.cadar@imperial.ac.uk ccadar.blogspot.co.uk Software Reliability Group Publications Talks Teaching Service Software Contact I am a Professor in the Department of Computing at Imperial College London, where I lead the Software Reliability Group. My research interests span the areas of software engineering, computer systems and software security, with a focus on building practical techniques for improving the reliability and security of software systems. I have received the Humboldt Research Award in 2024, IEEE New Directions Award (jointly with Prof Abhik Roychoudhury) in 2022, BCS Roger Needham Award in 2019, a SIGOPS Hall of Fame award in 2018, an ERC Consolidator Grant in 2018, the HVC Award in 2017, the ACM Computer and Communications Security (CCS) Test of Time Award in 2016, a BCS Fellowship in 2016, the Jochen Liedtke Young Researcher Award in 2015 and an EPSRC Early-Career Fellowship in 2013. Our research has received Distinguished Paper Award at ISSTA 2023, Best Artifact Award at FormaliSE 2023, Best Experience Paper Award at ASE 2017, Best Paper Award at ICST 2016, Best Artifact Award at ISSTA 2014, Distinguished Artifact Award at ESEC/FSE 2013, and the Jay Lepreau Best Paper Award at OSDI 2008. Previously, I received a Ph.D. in Computer Science from Stanford University, an M.Eng. in Computer Science from MIT, and a B.S. in Computer Science and one in Mathematics also from MIT. I am always looking for bright and motivated PhD students interested in developing novel techniques and tools for improving software reliability, and we regularly have postoc openings too. I am particularly interested in students having a strong background in systems programming and compilers, and experience with building and working with large software systems. Please send me email if you are interested in doing a PhD in my group, and attach a CV to your email. If your background matches our research interests, I will try to send a reply soon. We advertise specific funding opportunities here. Selected Publications The full list of papers published since 2010 is available on the Software Reliability Group website. Computing Summaries of String Loops in C for Better Testing and Refactoring Timotej Kapus, Oren Ish-Shalom, Shachar Itzhaky, Noam Rinetzky, Cristian Cadar ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI 2019) Phoenix, AZ, USA, June 2019 Mvedsua: Higher Availability Dynamic Software Updates via Multi-Version Execution Luís Pina, Anastasios Andronidis, Michael Hicks, Cristian Cadar International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2019) Providence, RI, USA, April 2019 Chopped Symbolic Execution David Trabish, Andrea Mattavelli, Noam Rinetzky, Cristian Cadar International Conference on Software Engineering (ICSE 2018) Gothenburg, Sweden, May 2018 Shadow of a Doubt: Testing for Divergences Between Software Versions Hristina Palikareva, Tomasz Kuchta, Cristian Cadar International Conference on Software Engineering (ICSE 2016) Austin, TX, USA, May 2016 An extended version of this paper appeared in TOSEM 2018. Targeted Program Transformations for Symbolic Execution Cristian Cadar European Software Engineering Conference / Symposium on the Foundations of Software Engineering New Ideas Track (ESEC/FSE NI 2015) Bergamo, Italy, September 2015 Varan the Unbelievable: An Efficient N-version Execution Framework Petr Hosek, Cristian Cadar International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS'15) Istanbul, Turkey, March 2015 Covrig: A Framework for the Analysis of Code, Test, and Coverage Evolution in Real Software Paul Dan Marinescu, Petr Hosek, Cristian Cadar International Symposium on Software Testing and Analysis (ISSTA 2014) San Jose, CA, USA, July 2014 Docovery: Toward Generic Automatic Document Recovery Tomasz Kuchta, Cristian Cadar, Miguel Castro, Manuel Costa International Conference on Automated Software Engineering (ASE 2014) Västerås, Sweden, September 2014 KATCH: High-Coverage Testing of Software Patches Paul Dan Marinescu, Cristian Cadar European Software Engineering Conference / Symposium on the Foundations of Software Engineering (ESEC/FSE) Saint Petersburg, Russia, July 2013 Awarded a Distinguished Artifact Award Symbolic Execution for Software Testing: Three Decades Later Cristian Cadar, Koushik Sen Communications of the ACM (CACM) Volume 56, Issue 2, 2013 Safe Software Updates via Multi-version Execution Petr Hosek, Cristian Cadar International Conference on Software Engineering (ICSE 2013) San Francisco, CA, May 2013 Multi-Version Software Updates Cristian Cadar, Petr Hosek Workshop on Hot Topics in Software Upgrades (HotSWUp 2012) Zurich, Switzerland, June 2012 make test-zesti: A Symbolic Execution Solution for Improving Regression Testing Paul Dan Marinescu, Cristian Cadar International Conference on Software Engineering (ICSE 2012) Zurich, Switzerland, June 2012 Symbolic Execution for Software Testing in Practice – Preliminary Assessment Cristian Cadar, Patrice Godefroid, Sarfraz Khurshid, Corina Pasareanu, Koushik Sen, Nikolai Tillmann, Willem Visser International Conference on Software Engineering, Impact Project (ICSE Impact 2011) Honolulu, Hawaii, USA, May 2011 Symbolic Crosschecking of Floating-Point and SIMD Code Peter Collingbourne, Cristian Cadar, Paul H. J. Kelly European Conference on Computer Systems (EuroSys 2011) Salzburg, Austria, April 2011 Multiplicity Computing: A Vision of Software Engineering for Next-Generation Computing Platform Applications Cristian Cadar, Peter Pietzuch, Alexander Wolf FSE/SDP Workshop on the Future of Software Engineering Research (FoSER 2010) Santa Fe, NM, November 2010 KLEE: Unassisted and Automatic Generation of High-Coverage Tests for Complex Systems Programs Cristian Cadar, Daniel Dunbar, Dawson Engler USENIX Symposium on Operating Systems Design and Implementation (OSDI 2008) San Diego, CA, December 2008 Awarded the Jay Lepreau Best Paper Award EXE: Automatically Generating Inputs of Death Cristian Cadar, Vijay Ganesh, Peter Pawlowski, David Dill, Dawson Engler ACM Transactions on Information and System Security (TISSEC) Volume 12, No. 2, December 2008 This is an extended version of our CCS 2006 paper Preventing memory error exploits with WIT Periklis Akritidis, Cristian Cadar, Costin Raiciu, Manuel Costa, Miguel Castro IEEE Symposium on Security and Privacy (Oakland Security 2008) Berkeley/Oakland, California, May 2008 Data Randomization Cristian Cadar, Periklis Akritidis, Manuel Costa, Jean-Phillipe Martin, Miguel Castro Microsoft Research TR-120-2008 RWset: Attacking Path Explosion in Constraint-Based Test Generation Peter Boonstoppel, Cristian Cadar, Dawson Engler ETAPS Conference on Tools and Algorithms for the Construction and Analysis of Systems (TACAS 2008) Budapest, Hungary, March-April 2008 Automatically Generating Malicious Disks using Symbolic Execution Junfeng Yang, Can Sar, Paul Twohey, Cristian Cadar, Dawson Engler IEEE Symposium on Security and Privacy (Oakland Security 2006) Berkeley/Oakland, California, May 2006 Execution Generated Test Cases: How to Make Systems Code Crash Itself Cristian Cadar, Dawson Engler International SPIN Workshop on Model Checking of Software (invited paper) San Francisco, CA, August 2005 A longer version of this paper appeared as Stanford Technical Report CSTR-2005-04 Exploring the Acceptability Envelope Martin Rinard, Cristian Cadar, Huu Hai Nguyen Conference on Object-Oriented Programming Systems, Languages, and Applications Companion (OOPSLA 2005 Companion) San Diego, CA, October 2005 Enhancing Server Availability and Security Through Failure-Oblivious Computing Martin Rinard, Cristian Cadar, Daniel Dumitran, Daniel Roy, Tudor Leu, William Beebee Jr. USENIX Symposium on Operating Systems Design and Implementation (OSDI 2004) San Francisco, CA, December 2004 Selected Talks Recent talks are available on the Software Reliability Group website. Some older talks are included below: KLEE: Effective Testing of Systems Programs Available in PPSX and PDF format Versions of this talk were presented at: Stanford Security Workshop 2009, Stanford, CA, USA, April 16, 2009 USENIX Symposium on Operating Systems Design and Implementation (OSDI 2008), San Diego, CA, USA, December 9, 2008 Workshop on State-space Exploration for Automated Testing (SSEAT 2008), Seattle, WA, USA, July 24, 2008 RWset: Attacking Path Explosion in Constraint-Based Test Generation Available in PPSX and PDF format ETAPS Conference on Tools and Algorithms for the Construction and Analysis of Systems (TACAS 2008) Budapest, Hungary, April 2, 2008 EXE: Automatically Generating Inputs of Death Available in PPSX and PDF format ACM Conference on Computer and Communications Security (CCS 2006) Alexandria, Virginia, USA, November 2, 2006 A Dynamic Technique for Eliminating Buffer Overflow Vulnerabilities (and Other Memory Errors) Available in PPSX and PDF format Annual Computer Security Applications Conference (ACSAC 2004) Tucson, AZ, December 8, 2004 Teaching Software Reliability (4th year/MSc): Since 2015-16 Past Teaching Operating Systems (2nd year): Spring 09-10, Spring 10-11, Spring 11-12, Spring 12-13, Spring 13-14, Spring 14-15, Spring 15-16 Software Engineering Practice (MSc): Spring 09-10, Spring 10-11, Spring 11-12, Spring 12-13 MSc Group Project Coordinator: Spring 10-11, Spring 11-12 Networks and Communications (2nd year): Autumn 10-11, Autumn 11-12 Service Please consider submitting papers to the following conferences and workshops: 2025: 2024: 2023: 2022: 2021: 2020: 2019: 2018: 2017: 2016: 2015: 2014: 2013: 2012 2011 2010 Software KLEE is now open source! Please go to the new KLEE website for more details Other software is available throug",
  "content_length": 10273,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:28"
}