{
  "name": "Cristian Riveros",
  "homepage": "https://criveros.sitios.ing.uc.cl",
  "status": "success",
  "content": "Cristian Riveros - Website CRISTIAN RIVEROS Website \"In their capacity as a tool, computers will be but a ripple on the surface of our culture. In their capacity as intellectual challenge, they are without precedent in the cultural history of mankind.\" E. W. Dijkstra, Turing Award Lecture, 1972 Department of Computer Science Vicuna Mackenna 4860 Edificio San Agustin, 4to piso Macul, Santiago, 7820436 +56 2 23547407 cristian.riveros@uc.cl Conference papers 2021 When is Approximate Counting for Conjunctive Queries Tractable? [ pdf ] With Marcelo Arenas, Rajesh Jayaram, and Luis Alberto Croquevielle. To appear in STOC. [More infoLess info] Conference: 53rd Annual ACM Symposium on Theory of Computing (STOC) - Rome, Italy. Abstract: Conjunctive queries are one of the most common class of queries used in database systems, and the best studied in the literature. A seminal result of Grohe, Schwentick, and Segoufin (STOC 2001) demonstrates that for every class G of graphs, the evaluation of all conjunctive queries whose underlying graph is in G is tractable if, and only if, G has bounded treewidth. In this work, we extend this characterization to the counting problem for conjunctive queries. Specifically, for every class C of conjunctive queries with bounded treewidth, we introduce the first fully polynomial-time randomized approximation scheme (FPRAS) for counting answers to a query in C, and the first polynomial-time algorithm for sampling answers uniformly from a query in C. As a corollary, it follows that for every class G of graphs, the counting problem for conjunctive queries whose underlying graph is in G admits an FPRAS if, and only if, G has bounded treewidth (unless BPP != P)}. In fact, our FPRAS is more general, and also applies to conjunctive queries with bounded hypertree width, as well as unions of such queries. The key ingredient in our proof is the resolution of a fundamental counting problem from automata theory. Specifically, we demonstrate the first FPRAS and polynomial time sampler for the set of trees of size n accepted by a tree automaton, which improves the prior quasi-polynomial time randomized approximation scheme (QPRAS) and sampling algorithm of Gore, Jerrum, Kannan, Sweedyk, and Mahaney '97. We demonstrate how this algorithm can be used to obtain an FPRAS for many hitherto open problems, such as counting solutions to constraint satisfaction problems (CSP) with bounded hypertree-width, counting the number of error threads in programs with nested call subroutines, and counting valid assignments to structured DNNF circuits. Expressive power of linear algebra query languages [ pdf ] With Floris Geerts, Thomas Muñoz, and Domagoj Vrgoč. To appear in PODS. [More infoLess info] Conference: 40th ACM SIGMOD-SIGACT-SIGAI Symposium on Principles of Database Systems (PODS) - Xi'an, Shaanxi, China. Abstract: Linear algebra algorithms often require some sort of iteration or recursion as is illustrated by standard algorithms for Gaussian elimination, matrix inversion, and transitive closure. A key characteristic shared by these algorithms is that they allow looping for a number of steps that is bounded by the matrix dimension. In this paper we extend the matrix query language MATLANG with this type of recursion, and show that this suffices to express classical linear algebra algorithms. We study the expressive power of this language and show that it naturally corresponds to arithmetic circuit families, which are often said to capture linear algebra. Furthermore, we analyze several sub-fragments of our language, and show that their expressive power is closely tied to logical formalisms on semiringannotated relations. Ranked enumeration of MSO logic on words [ pdf ] With Pierre Bourhis, Alejandro Grez, and Louis Jachiet. To appear in ICDT. [More infoLess info] Conference: 24nd International Conference on Database Theory (ICDT) - Nicosia, Cyprus. Abstract: In the last years, enumeration algorithms with bounded delay have attracted a lot of attention for several data management tasks. Given a query and the data, the task is to preprocess the data and then enumerate all the answers to the query one by one and without repetitions. This enumeration scheme is typically useful when the solutions are treated on the fly or when we want to stop the enumeration once the pertinent solutions have been found. However, with the current schemes, there is no restriction on the order how the solutions are given and this order usually depends on the techniques used and not on the relevance for the user. In this paper we study the enumeration of monadic second order logic (MSO) over words when the solutions are ranked. We present a framework based on MSO cost functions that allows to express MSO formulae on words with a cost associated with each solution. We then demonstrate the generality of our framework which subsumes, for instance, document spanners and regular complex event processing queries and adds ranking to them. The main technical result of the paper is an algorithm for enumerating all the solutions of formulae in increasing order of cost efficiently, namely, with a linear preprocessing phase and logarithmic delay between solutions. The novelty of this algorithm is based on using functional data structures, in particular, by extending functional Brodal queues to suit with the ranked enumeration of MSO on words. 2020 A Family of Centrality Measures for Graph Data Based on Subgraphs [ pdf ] With Jorge Salas. In ICDT. [More infoLess info] Conference: 23nd International Conference on Database Theory (ICDT) - Copenhagen, Denmark. Abstract: We present the theoretical foundations of a new approach in centrality measures for graph data. The main principle of our approach is very simple: the more relevant subgraphs around a vertex, the more central it is in the network. We formalize the notion of \"relevant subgraphs\" by choosing a family of subgraphs that, give a graph G and a vertex v in G, it assigns a subset of connected subgraphs of G that contains v. Any of such families defines a measure of centrality by counting the number of subgraphs assigned to the vertex, i.e., a vertex will be more important for the network if it belongs to more subgraphs in the family. We show many examples of this approach and, in particular, we propose the all-subgraphs centrality, a centrality measure that takes every subgraph into account. We study fundamental properties over families of subgraphs that guarantee desirable properties over the corresponding centrality measure. Interestingly, all-subgraphs centrality satisfies all these properties, showing its robustness as a notion for centrality. Finally, we study the computational complexity of counting certain families of subgraphs and show a polynomial time algorithm to compute the all-subgraphs centrality for graphs with bounded tree width. On the Expressiveness of Languages for Complex Event Recognition [ pdf ] With Alejandro Grez, Martin Ugarte, and Stijn Vansummeren. In ICDT. [More infoLess info] Conference: 23nd International Conference on Database Theory (ICDT) - Copenhagen, Denmark. Abstract: Complex Event Recognition (CER for short) has recently gained attention as a mechanism for detecting patterns in streams of continuously arriving event data. Numerous CER systems and languages have been proposed in the literature, commonly based on combining operations from regular expressions (sequencing, iteration, and disjunction) and relational algebra (e.g., joins and filters). While variables in these languages can only bind single elements, they also provide capabilities for filtering sets of events that occur inside iterative patterns; for example requiring sequences of numbers to be increasing. Unfortunately, these type of filters usually present ad-hoc syntax and under-defined semantics, precisely because variables cannot bind sets of events. As a result, CER languages that provide filtering of sequences commonly lack rigorous semantics and their expressive power is not understood. In this paper we embark on two tasks: First, to define a denotational semantics for CER that naturally allows to bind and filter sets of events; and second, to compare the expressive power of this semantics with that of CER languages that only allow for binding single events. Concretely, we introduce Set-based Complex Event Logic (S-CEL for short), a variation of the CER language introduced by Grez et al. in which all variables bind to sets of matched events. We then compare S-CEL with Event-based CEL (E-CEL), the language proposed by Grez et al. where variables bind single events. We show that they are equivalent in expressive power when restricted to unary predicates but, surprisingly, incomparable in general. Nevertheless, we show that if we restrict to sets of binary predicates, then S-CEL is strictly more expressive than E-CEL. To get a better understanding of the expressive power, computational capabilities, and limitations of S-CEL, we also investigate the relationship between S-CEL and Complex Event Automata (CEA), a natural computational model for CER languages. We define a property on CEA called the *-property and show that, under unary predicates, S-CEL captures precisely the subclass of CEA that satisfy this property. Finally, we identify the operations that SCEL is lacking to characterize CEA and introduce a natural extension of the language that captures the complete class of CEA under unary predicates. Towards Streaming Evaluation of Queries with Correlation in Complex Event Processing [ pdf ] With Alejandro Grez. In ICDT. [More infoLess info] Conference: 23nd International Conference on Database Theory (ICDT) - Copenhagen, Denmark. Abstract: Complex event processing (CEP) has gained a lot of attention for evaluating complex patterns over high-throughput data streams. Recently, new algorithms for the evaluation of CEP patterns have emerged with strong guarantees of efficiency, i.e. constant up",
  "content_length": 59502,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:36"
}