{
  "name": "Csilla Farkas",
  "homepage": "https://cse.sc.edu/~farkas",
  "status": "success",
  "content": "Csilla Farkas · CV · Sample Publications · Research · Teaching Csilla Farkas Address: Department of Computer Science and Engineering University of South Carolina Address:          Storey Innovation Center 550 Assembly Street, RM 2253 Columbia, SC 29201 Email:              farkas(at)cec.sc.edu Phone:            (803)576-5762 Fax:                  (803)777-3767 Microsketch Csilla Farkas is a Professor in the Department of Computer Science and Engineering and Director of the Center for Information Assurance Engineering at the University of South Carolina.  Dr. Farkas research interests include information security, data inference problem, financial and legal analysis of cyber crime, and security and privacy on the Semantic Web. She is a recipient of the National Science Foundation Career award.  The topic of her award is Semantic Web: Interoperation vs. Security  A New Paradigm of Confidentiality Threats.  Dr. Farkas actively participates in international scientific communities as program committee member and reviewer. Csilla Farkas received her PhD from George Mason University, Fairfax.  In her dissertation she studied the inference and aggregation problems in multilevel secure relational databases.  She received a MS in computer science from George Mason University and BS degrees in computer science and geology from SZAMALK, Hungary and Eotvos Lorand University, Hungary, respectively. Information assurance and security · Center for Information Assurance Engineering · IA Education o    Information Assurance Specialization  undergraduate and graduate students · Departmental Application form for IA Specialization  Contact Ms. Sri Satti, satti@cse.sc.edu ,  for additional information (Swearingen Bldg. 3A01) o    Graduate Certificate Program in Information Assurance and Security · USC graduate admission requirements · Coursework o NEW!  Program modification has been approved to issue degrees in Fall 2016 under the following conditions: 1. Name change: Graduate Certificate in Cyber Security Studies (CS2) 2. Coursework requirement: The 12 hours must include the two core courses: CSCE 522 - Information Security Principles and CSCE 715 - Network Systems Security. At least 6 hours of additional courses must be selected with the approval of the director of graduate studies. · Departmental Application form for Graduate Certificate Program in Information Assurance and Security  Contact Ms. Crystal Jones for additional information (Swearingen Bldg. 3A01)",
  "content_length": 2490,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:01"
}