{
  "name": "Cuiyun Gao 0001",
  "homepage": "https://cuiyungao.github.io",
  "status": "success",
  "content": "[ Cuiyun Gao @ HIT-SZ ] Cuiyun Gao Full Professor (校青年拔尖教授) PhD Supervisor (博导) School of Computer Science and Technology Harbin Institute of Technolgy, Shenzhen Email: Expertise: Software repository mining & Natural language understanding » EXPAND ALL SECTIONS COLLAPSE ALL SECTIONS Introduction Cuiyun Gao is a Full Professor of School of Computer Science and Technology at the Harbin Institute of Technolgy, Shenzhen. She used to be a Research Fellow at Nanyang Technology University (NTU), working with Prof. Yang Liu, and before that, a Postdoctoral Fellow in CUHK (The Chinese University of Hong Kong), working with Prof. Michael R. Lyu. She also received her PhD degree at CUHK, and graduated in end of 2018. During April~July of 2018, She was a visiting student in University College London (UCL), supervised by Prof. Mark Harman and Prof. Federica Sarro. Before coming to CUHK, She was one bachelor student of the Department of Communication Engineering of Shanghai University (SHU) in 2012~2014, under the supervision of Prof. Wanggen WAN. And before starting her engineering career, she joined Chien Wei-zang College (钱伟长学院) in 2010, an Honors College of SHU, and graduated from the College in 2012. Her primary research interests include AI + Software Engineering, particularly Large Language models; Source code understanding and analysis; User review analysis; Vulnerability detection; Mobile advertising analysis. 课题组招收研究生和博士生、博士后，欢迎对我的研究方向感兴趣的同学加入课题组，也非常欢迎对科研感兴趣且学有余力的本科生与我联系。 News News Tweets by @dmslcy Publications Publications Google Scholar DBLP 2025: FSE \"Smaller but Better: Self-Paced Knowledge Distillation for Lightweight yet Effective LCMs.\", Yujia Chen, Yang Ye, Zhongqi Li, Yuchi Ma, Cuiyun Gao*. The ACM International Conference on the Foundations of Software Engineering (FSE), to appear. FSE \"Beyond PEFT: Layer-Wise Optimization for More Effective and Efficient Large Code Model Tuning\", Chaozheng Wang, Jia Feng, Shuzheng Gao, Cuiyun Gao*, Zongjie Li, Ting Peng, Hailiang Huang, Yuetang Deng, Michael R. Lyu. The ACM International Conference on the Foundations of Software Engineering (FSE), to appear. FSE-Industry \"RAG or Fine-tuning? A Comparative Study on LCMs-based Code Completion in Industry\", Chaozheng Wang, Zezhou Yang, Shuzheng Gao, Cuiyun Gao*, Ting Peng, Hailiang Huang, Yuetang Deng, Michael R. Lyu. The ACM International Conference on the Foundations of Software Engineering (FSE), industry track, to appear. FSE-Industry \"AEGIS: An Agent-based Framework for Bug Reproduction from Issue Descriptions\", Xinchen Wang, Pengfei Gao, Xiangxin Meng, Chao Peng, Ruida Hu, Yun Lin, Cuiyun Gao*. The ACM International Conference on the Foundations of Software Engineering (FSE), industry track, to appear. FSE-Industry \"Towards Mitigating API Hallucination in Code Generated by LLMs with Hierarchical Dependency Aware\", Yujia Chen, Mingyu Chen, Cuiyun Gao*, Zhihan Jiang, Zhongqi Li, Yuchi Ma. The ACM International Conference on the Foundations of Software Engineering (FSE), industry track, to appear. ISSTA \"MLLM-Based UI2Code Automation Guided by UI Layout Information\", Fan Wu, Cuiyun Gao*, Shuqing Li, Xin-Cheng Wen, Qing Liao. ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA), to appear. ISSTA \"Extended Reality Cybersickness Assessment via User Review Analysis\", Shuqing Li, Qisheng Zheng, Cuiyun Gao*, Jia Feng, Michael R. Lyu. ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA), to appear. TSE \"Understanding the Robustness of Transformer-Based Code Intelligence via Code Transformation: Challenges and Opportunities\", Yaoxian Li, Shiyi Qi, Cuiyun Gao*, Yun Peng, David Lo, Zenglin Xu, Michael R Lyu. IEEE Transactions on Software Engineering (TSE), to appear. TOSEM \"An Empirical Study of Retrieval-Augmented Code Generation: Challenges and Opportunities\", Zezhou Yang, Sirong Chen, Cuiyun Gao*, Zhenhao Li, Xing Hu, Kui Liu, Xin Xia. ACM Transactions on Software Engineering and Methodology (TOSEM), to appear. TOSEM \"The Current Challenges of Software Engineering in the Era of Large Language Models\", Cuiyun Gao, Xing Hu, Shan Gao, Xin Xia, Zhi Jin. ACM Transactions on Software Engineering and Methodology (TOSEM), to appear. ICSE \"Repository-Level Graph Representation Learning for Enhanced Security Patch Detection\", Xin-Cheng Wen, Zirui Lin, Cuiyun Gao*, Hongyu Zhang, Yong Wang, Qing Liao. The 47th International Conference on Software Engineering (ICSE), to appear. ICSE \"Search-based LLMs for Code Optimization\", Shuzheng Gao, Cuiyun Gao*, Wenchao Gu, Michael Lyu. The 47th International Conference on Software Engineering (ICSE), to appear. ISSTA \"Can LLMs Replace Human Evaluators? An Empirical Study of LLM-as-a-Judge in Software Engineering\", Ruiqi Wang, Jiyu Guo, Cuiyun Gao, Guodong Fan, Chun Yong Chong, and Xin Xia. ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA), to appear. AAAI \"Distilling Structured Rationale from Large Language Models to Small Language Models for Abstractive Summarization\", Linyong Wang, Lianwei Wu, Shaoqi Song, Yaxiong Wang, Cuiyun Gao, Wang Kang. 39th Annual AAAI Conference on Artificial Intelligence (AAAI), to appear. 2024: FSE \"Less Cybersickness, Please: Demystifying and Detecting Stereoscopic Visual Inconsistencies in Virtual Reality Apps\", Shuqing Li, Cuiyun Gao*, Jianping Zhang, Yujia Zhang, Yepang Liu, Jiazhen Gu, Yun Peng, Michael R Lyu. Proceedings of the ACM on Software Engineering (FSE), to appear. CAAI \"Improving long‐tail classification via decoupling and regularisation\", Shuzheng Gao, Chaozheng Wang, Cuiyun Gao*, Wenjian Luo, Peiyi Han, Qing Liao, Guandong Xu. CAAI Transactions on Intelligence Technology (CAAI), to appear. ASE \"ComplexCodeEval: A Benchmark for Evaluating Large Code Models on More Complex Code\", Jia Feng, Jiachen Liu, Cuiyun Gao*, Chun Yong Chong, Chaozheng Wang, Shan Gao, Xin Xia. The 39th IEEE/ACM International Conference on Automated Software Engineering (ASE), to appear. ASE \"A Systematic Evaluation of Large Code Models in API Suggestion: When, Which, and How\", Chaozheng Wang, Shuzheng Gao, Cuiyun Gao*, Wenxuan Wang, Chun Yong Chong, Shan Gao, Michael R Lyu. The 39th IEEE/ACM International Conference on Automated Software Engineering (ASE), to appear. ISSTA \"Bridge and Hint: Extending Pre-trained Language Models for Long-Range Code\", Yujia Chen, Cuiyun Gao*, Zezhou Yang, Hongyu Zhang, Qing Liao. The ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2024), to appear. ISSTA \"SCALE: Constructing Symbolic Comment Trees for Software Vulnerability Detection\", Xin-Cheng Wen, Cuiyun Gao*, Shuzheng Gao, Yang Xiao, Michael R. Lyu. The ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2024). TSE \"Meta-Path Based Attentional Graph Learning Model for Vulnerability Detection\", Xin-Cheng Wen, Cuiyun Gao*, Jiaxin Ye, Yichen Li, Zhihong Tian, Yan Jia, Xuan Wang. Transactions on Software Engineering. TSE \"LIVABLE: Exploring Long-Tailed Classification of Software Vulnerability Types\", Xin-Cheng Wen, Cuiyun Gao*, Feng Luo, Haoyu Wang, Ge Li, Qing Liao. Transactions on Software Engineering. TOSEM \"Zero-shot Domain Adaptation for Code Search with Pre-trained Models\", Guodong Fan, Shizhan Chen, Cuiyun Gao*, Jianmao Xiao, Tao Zhang, Zhiyong Feng. ACM Transactions on Software Engineering and Methodology (TOSEM). ICSE-Challenge \"ReposVul: A Repository-Level High-Quality Vulnerability Dataset\", Xinchen Wang, Ruida Hu, Cuiyun Gao*, Xin-Cheng Wen, Yujia Chen, Qing Liao. The 46th International Conference on Software Engineering (ICSE 2024), Industry Challenge Track. Best Paper Award of the Track ICSE \"On Extracting Specialized Code Abilities from Large Language Models: A Feasibility Study\", Li Zongjie, Chaozheng Wang, Pingchuan Ma, Chaowei Liu, Shuai Wang, Daoyuan Wu, Cuiyun Gao, Yang Liu. The 46th International Conference on Software Engineering (ICSE 2024), to appear. ICSE \"Less is More? An Empirical Study on Configuration Issues in Python PyPI Ecosystem\", Yun Peng, Ruida Hu, Ruoke Wang, Cuiyun Gao*, Shuqing Li, Michael Lyu. The 46th International Conference on Software Engineering (ICSE 2024), to appear. ICSE \"Learning in the Wild: Towards Leveraging Unlabeled Data for Effectively Tuning Pre-trained Code Models\", Shuzheng Gao, Wenxin Mao, Cuiyun Gao*, Li Li, Xing Hu, Xin Xia, Michael Lyu. The 46th International Conference on Software Engineering (ICSE 2024), to appear. ICSE \"Code Search is All You Need? Improving Code Suggestions with Code Search\", Junkai Chen, Xing Hu, Zhenhao Li, Cuiyun Gao, Xin Xia, David Lo. The 46th International Conference on Software Engineering (ICSE 2024), to appear.Distinguished Paper Award ICSE \"Domain Knowledge Matters: Improving Prompts with Fix Templates for Repairing Python Type Errors\", Yun Peng, Shuzheng Gao, Cuiyun Gao*, Yintong Huo, Michael R. Lyu. The 46th International Conference on Software Engineering (ICSE 2024), to appear. 2023: TSE \"Prompt Tuning in Code Intelligence: An Experimental Evaluation\", Chaozheng Wang, Yuanhang Yang, Cuiyun Gao*, Yun Peng, Hongyu Zhang, Michael R. Lyu. Transactions on Software Engineering, to appear. FSE \"How Practitioners Expect Code Completion?\"Chaozheng Wang, Junhao Hu, Cuiyun Gao*, Yu Jin, Tao Xie, Hailiang Huang, Zhenyu Lei, Yuetang Deng. The ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2023). FSE-Industry \"A Unified Framework for Mini-game Testing: Experience on WeChat\", Chaozheng Wang, Haochuan Lu, Cuiyun Gao*, Li Zongjie, Ting Xiong, Yuetang Deng. The ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2023), Industry Track. CCS \"Protecting Intellectual Property of Large Language Model-Based Code Generation APIs via Watermarks\", Zongjie Li, Chaozheng Wang, Shuai Wang, Cuiyun Gao. The ACM Conference on Computer and Communications Security (CCS 2023), to ap",
  "content_length": 24573,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:41"
}