{
  "name": "Cuneyt Gurcan Akcora",
  "homepage": "https://cakcora.github.io",
  "status": "success",
  "content": "Homepage Cüneyt Gürcan Akçora Associate Professor FData Lab, University of Central Florida Biography Cuneyt Gurcan Akcora is an Associate Professor of Finance and Computer Science at the University of Central Florida. He is an adjunct professor of Computer Science and Statistics at the University of Manitoba, Canada. He received his Ph.D. from Università degli studi dell’Insubria, Italy, and his M.S. from State University of New York at Buffalo, USA, as a Fulbright Scholar. He has worked and collaborated with Yahoo! Research Barcelona, Qatar Computing Research Institute and Huawei Research, Turkey. His primary research interests are Data Science on Complex Networks and Graph Mining, with applications in online social networks and Blockchain networks. CV | Research Statement I am not leaving a spiritual legacy of dogmas, unchangeable petrified directives. My spiritual legacy is science and reason. Mustafa Kemal Atatürk, 1933. Interests Explainable Artificial Intelligence Data Science on Complex Networks Large Scale Graph Analysis Nonparametric Statistics Education PhD in Computer Science, 2014 Università degli studi dell'Insubria, Italy MEng in Computer Science, 2010 State University of New York at Buffalo, USA BSc in Electrical&Electronics Enginering, 2008 Karadeniz Technical University, Turkey Ardahan Lisesi, Ardahan, Turkey from Samandoken köyü, Göle, Ardahan News (November 2024) Our paper 'Chainlet Orbits: Topological Address Embedding for Blockchain' has been accepted at KDD 2024 (January 2024) Our paper 'GraphPulse: Topological Representations for Temporal Graph Property Prediction' has been accepted at ICLR 2024 (January 2024) Our paper 'Data Depth and Core-based Trend Detection on Blockchain Transaction Networks' has been accepted at Frontiers in Blockchain (December 2023) Our paper 'EMP: Effective Multidimensional Persistence for Graph Representation Learning' has been accepted at The Second Learning on Graphs Conference (LoG) (September 2022) Our paper 'Reduction Algorithms for Persistence Diagrams of Networks: CoralTDA and PrunIT' has been accepted at NeurIPS 2022 (September 2022) Our paper 'Chartalist: Labeled Graph Datasets for UTXO and Account-based Blockchains' has been accepted at NeurIPS 2022 (June 2021) Our paper 'Alphacore: Data Depth based Core Decomposition' has been accepted at KDD 2021 (June 2021) Our paper 'Topological anomaly detection in dynamic multilayer blockchain networks' has been accepted at ECML PKDD 2021 (June 2021) I gave a blockchain tutorial at the NSF DMS meeting. (January 2021) I will give an invited talk at the New York University Center for Data Science, on E-crime detection on Blockchains. (December 2020) I am organizing a Blockchain networks session at the 2021 Joint Sunbelt and NetSci Conference. (December 2020) With Xuemiao Hao from UM Management, we received a Faculty of Science interdisciplinary research grant to research blockchains in the insurance industry. (October 2020) Invited talk: Topological Data Analysis for Ransomware Detection on the Bitcoin Blockchain, The Smart Cybersecurity Network (Serene-Risc) Annual Workshop, online, Canada (October 2020) Invited talk: Topological Data Analysis on Networks – Applications and Scalability issues, University of Montana, Department of Mathematical Science, USA. (September 2020) Invited talk: Topological Data Analysis on Networks – Applications and Scalability issues, Virginia Commonwealth University, Department of Biostatistics, USA . (August 2020) Invited talk: Data Science on Blockchains, Joint Statistical Meetings, online. (April 2020) I was awarded the NSERC discovery grant from the Canadian government. The grant has an additional supplement for a startup fund. (May 2020) I will give a guest lecture on Ransomware detection in cryptocurrencies at the UW Tacoma (CSL 550 - Network and Internet Security class) (April 2020) BitcoinHeist: Topological Data Analysis for Ransomware Detection on the Bitcoin Blockchain has been accepted at the 29th International Joint Conference on Artificial Intelligence (IJCAI 2020). Selected Publications Forecasting Bitcoin Price with Graph Chainlets Over the last couple of years, Bitcoin cryptocurrency and the Blockchain technology that forms the basis of Bitcoin have witnessed a flood of attention. In contrast to fiat currencies used worldwide, the Bitcoin distributed ledger is publicly available by design. This facilitates observing all financial interactions on the network, and analyzing how the network evolves in time. We introduce a novel concept of chainlets, or Bitcoin subgraphs, which allows us to evaluate the local topological structure of the Bitcoin graph over time. Furthermore, we assess the role of chainlets on Bitcoin price formation and dynamics. We investigate the predictive Granger causality of chainlets and identify certain types of chainlets that exhibit the highest predictive influence on Bitcoin price and investment risk. Cuneyt Gurcan Akcora, Asim K. Dey, Yulia Gel, Murat Kantarcioglu In PaKDD, 2018 Preprint PDF Code Dataset Project Slides Blockchain: A Graph Primer Bitcoin and its underlying technology Blockchain have become popular in recent years. Designed to facilitate a secure distributed platform without central authorities, Blockchain is heralded as a paradigm that will be as powerful as Big Data, Cloud Computing and Machine learning. Blockchain incorporates novel ideas from various fields such as public key encryption and distributed systems. As such, a reader often comes across resources that explain the Blockchain technology from a certain perspective only, leaving the reader with more questions than before. We will offer a holistic view on Blockchain. Starting with a brief history, we will give the building blocks of Blockchain, and explain their interactions. As graph mining has become a major part its analysis, we will elaborate on graph theoretical aspects of the Blockchain technology. We also devote a section to the future of Blockchain and explain how extensions like Smart Contracts and De-centralized Autonomous Organizations will function. Without assuming any reader expertise, our aim is to provide a concise but complete description of the Blockchain technology. Cuneyt Gurcan Akcora, Yulia Gel, Murat Kantarcioglu Tutorial on Arxiv.org, 2017 Preprint PDF Project Recent Publications Cuneyt Gurcan Akcora, Asim K. Dey, Yulia Gel, Murat Kantarcioglu. Forecasting Bitcoin Price with Graph Chainlets. In PaKDD, 2018. Preprint PDF Code Dataset Project Slides Cuneyt Gurcan Akcora, Yulia Gel, Murat Kantarcioglu. Blockchain: A Graph Primer. Tutorial on Arxiv.org, 2017. Preprint PDF Project Recent & Upcoming Talks Understanding Cryptocurrency Price Formation from Time Series of Local Blockchain Graph Features Jul 30, 2018 1:00 PM Joint Statistical Meetings Project Blockchain Analytics - A Data Science Perspective Mar 13, 2018 1:00 PM Souther Methodist University, Colloqium Series in the Statistics Department Project Recent Posts Aug 19, 2018 5 min read Book Review: Blockchain Revolution: How the Technology Behind Bitcoin and Other Cryptocurrencies Is Changing the World by Don and Alex Tapscott Blockchain Revolution provides a good overview on where the technology can be used. CONTINUE READING Jul 9, 2018 5 min read Book Review: \"the Truth Machine: the Blockchain and the Future of Everything\" by Casey and Vigna. Truth Machine positions Blockchain as the building block of a trust based world. CONTINUE READING Projects * All Deep Learning Blockchain Other Blockchain Data Analytics Tools to anayze data created through Blockchains. Deep Learning Node and subgraph embeddings for deep learning. The Upinion Project The first crowd-sourced sensing and public opinion mining framework on Twitter. Teaching Fall 2020 I am teaching the Blockchain Data Analytics course at the University of Texas at Dallas. My office hours are Wednesday 11:00-12:00 online. Course material will be posted to UMLearn. Tags Bitcoin Blockchain Data Mining Deep Learning Demo Ethereum Graph Mining Topological Data Analysis Twitter blockchain books Contact cuneyt.akcora@ucf.edu cuneytgurcan 65 Chancellors Circle, Winnipeg, MB, Canada Monday 9:00 to 17:00 or email for appointment × Cite Copy Download",
  "content_length": 8264,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:41"
}