{
  "name": "Cunjin Luo",
  "homepage": "https://www.essex.ac.uk/people/luocu65405/cunjin-luo",
  "status": "success",
  "content": "Cunjin Luo | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Cunjin Luo People Dr Cunjin Luo Lecturer School of Computer Science and Electronic Engineering (CSEE) Email cunjin.luo@essex.ac.uk Location 3A.523, Colchester Campus Academic support hours 16:00-17:00pm Friday, CSEE 4B.524 (in person); 18:00-19:00pm Monday, Zoom meeting (ID: 8409820103) (online) Profile Research Teaching and supervision Publications Contact Profile Research Teaching and supervision Publications Contact Profile Biography Dr. Cunjin Luo is currently a Lecturer in the School of Computer Science and Electronic Engineering at the University of Essex. He obtained a joint PhD in Computer Science from the Harbin Institute of Technology (HIT) and the University of Manchester (UoM). He is a member of IEEE, a Fellow of the Higher Education Academy, and serves as an Academic Editor for PLOS Digital Health, PLOS ONE, BMC Medical Informatics and Decision Making, and Frontiers in Physiology. Dr. Luo’s research spans two closely related domains: cardiac modelling and biomedical simulation, and security in healthcare and medical information systems. In cardiac modelling, his work focuses on computational analyses of arrhythmogenic conditions, particularly various forms of short QT syndrome associated with ion channel mutations such as KCNJ2 and KCNQ1. He has conducted simulation-based studies on the effects of anti-arrhythmic drugs (including quinidine, disopyramide, E-4031, and amiodarone) on ventricular electrophysiology and re-entrant excitation dynamics. His contributions also include research on mechanisms underlying T-wave alternans, atrial remodelling, and other cardiac abnormalities. In the field of healthcare informatics and system security, Dr. Luo has investigated human factors and incident-response processes within healthcare information environments. His work covers employee perceptions of human error in security practices, proactive and agile incident-response frameworks (e.g., IS-CHEC), as well as defence strategies for intelligent medical diagnosis systems. Additionally, he has explored the application of AI-driven ethical hacking techniques in the protection of health information infrastructures. Overall, Dr. Luo’s research integrates biomedical engineering with healthcare IT security, bridging physiological system modelling and the protection of modern medical technologies. His work is distinguished by its emphasis on practical, simulation-driven insights and real-world solutions to emerging challenges in healthcare and clinical informatics. Qualifications PhD, Computer Science Harbin Institute of Technology, Joint PhD, Biophysics University of Manchester, Appointments University of Essex Lecturer, School of Computer Science and Electronic Engineering (30/3/2020 - present) Research and professional activities Research interests Medical Informatics Open to supervise Biomedical Signal Processing Open to supervise AI for Healthcare Open to supervise Cyber Security for Healthcare Open to supervise Digital Health Open to supervise Computing in Cardiology Open to supervise Biomedical Engineering Open to supervise Teaching and supervision Current teaching responsibilities Team Project Challenge (CE101) Software Engineering (CE202) Previous supervision Guangming Huang Thesis title: A Study on Deep Learning and Explainable & Interpretable Ai: From General Domain to Healthcare Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 12/9/2025 Publications Journal articles (21) Huang, G., Long, Y. and Luo, C., (2025). Improving multi-hop question answering with prompting explicit and implicit knowledge aligned human reading comprehension. International Journal of Machine Learning and Cybernetics. 16 (10), 8103-8118 You, T., Luo, C., Zhang, K. and Zhang, H., (2025). Short QT Syndrome and Drug Treatment: A systematic Literature Review and PRISMA Analysis. International Journal of Drug Discovery and Pharmacology. 4 (2), 100009-100009 He, Y., Xin, T. and Luo, C., (2025). Enhancing Cybersecurity Investment with FAIR-ROSI: A Responsible Cybersecurity Approach to Digital Society. Information Systems Frontiers You, T., Xie, Y., Luo, C., Zhang, K. and Zhang, H., (2023). Mechanistic insights into spontaneous transition from cellular alternans to ventricular fibrillation. Physiological Reports. 11 (5), e15619- He, Y., Efpraxia, DZ., Yevseyeva, I. and Luo, C., (2023). AI-based Ethical Hacking for Health Information Systems (HIS): a simulation study. Journal of Medical Internet Research. 25, e41748-e41748 He, Y., Zamani, E., Lloyd, S. and Luo, C., (2022). Agile incident response (AIR): Improving the incident response process in healthcare. International Journal of Information Management. 62, 102435-102435 He, Y., Maglaras, L., Aliyu, A. and Luo, C., (2022). Healthcare Security Incident Response Strategy - A Proactive Incident Response (IR) Procedure. Security and Communication Networks. 2022, 1-10 Yuan, M., Gong, M., He, J., Xie, B., Zhang, Z., Meng, L., Tse, G., Zhao, Y., Bao, Q., Zhang, Y., Yuan, M., Liu, X., Luo, C., Wang, F., Li, G. and Liu, T., (2022). IP3R1/GRP75/VDAC1 complex mediates endoplasmic reticulum stress-mitochondrial oxidative stress in diabetic atrial remodeling.. Redox Biology. 52, 102289-102289 He, Y., Aliyu, A., Evans, M. and Luo, C., (2021). Healthcare Cyber Security Challenges and Solutions Under the Climate of COVID19: A Scoping Review. Journal of Medical Internet Research. 23 (4), e21747-e21747 You, T., Luo, C., Zhang, K. and Zhang, H., (2021). Electrophysiological mechanisms underlying T-wave alternans and their role in arrhythmogenesis. Frontiers in Physiology. 12, 614946- He, Y., Camacho, RS., Soygazi, H. and Luo, C., (2021). Attacking and Defence Pathways for Intelligent Medical Diagnosis System (IMDS). International Journal of Medical Informatics. 148, 104415-104415 He, Y., Aliyu, A., Evans, M. and Luo, C., (2021). Correction: Health Care Cybersecurity Challenges and Solutions Under the Climate of COVID-19: Scoping Review. Journal of Medical Internet Research. 23 (4), e29877-e29877 He, J., Gong, M., Wang, Z., Liu, D., Xie, B., Luo, C., Li, G., Tse, G. and Liu, T., (2021). Cardiac abnormalities after induction of endoplasmic reticulum stress are associated with mitochondrial dysfunction and connexin43 expression.. Clinical and Experimental Pharmacology and Physiology. 48 (10), 1371-1381 Evans, M., He, Y., Luo, C., Yevseyeva, I., Janicke, H., Zamani, E. and Maglaras, LA., (2019). Real-Time Information Security Incident Management: A Case Study Using the IS-CHEC Technique. IEEE Access. 7, 142147-142175 Evans, M., He, Y., Luo, C., Yevseyeva, I., Janicke, H. and Maglaras, LA., (2019). Employee Perspective on Information Security Related Human Error in Healthcare: Proactive Use of IS-CHEC in Questionnaire Form. IEEE Access. 7, 102087-102101 Liu, T., He, J., Gong, M., Luo, C., Zhao, Y., Li, G. and Tse, G., (2019). P5438Cardiac abnormalities after induction of endoplasmic reticulum stress are associated with mitochondrial dysfunction and connexin43 expression. European Heart Journal. 40 (Supplement_1) Luo, C., Wang, K. and Zhang, H., (2017). Modelling the effects of chloroquine onKCNJ2-linked short QT syndrome. Oncotarget. 8 (63), 106511-106526 Luo, C., Wang, K. and Zhang, H., (2017). Modelling the effects of quinidine, disopyramide, and E-4031 on short QT syndrome variant 3 in the human ventricles. Physiological Measurement. 38 (10), 1859-1873 Luo, C., Wang, K. and Zhang, H., (2017). Effects of amiodarone on short QT syndrome variant 3 in human ventricles: a simulation study.. BioMedical Engineering OnLine. 16 (1), 69- Luo, C., Wang, K. and Zhang, H., (2017). In silico assessment of the effects of quinidine, disopyramide and E-4031 on short QT syndrome variant 1 in the human ventricles.. PLoS One. 12 (6), e0179515-e0179515 Yuan, Y., Bai, X., Luo, C., Wang, K. and Zhang, H., (2015). The virtual heart as a platform for screening drug cardiotoxicity. British Journal of Pharmacology. 172 (23), 5531-5547 Show all Conferences (21) Luo, C., G. Whittaker, D., He, Y., Liu, T., Li, Y., Wang, K., Zhao, N. and Zhang, H., Effects of Taurine-Magnesium Coordination Compound on Type 2 Short QT Syndrome: A Simulation Study Huang, G., Long, Y., Luo, C. and Li, Y., LIDA: Lexical-based Imbalanced Data Augmentation for Content Moderation Huang, G., Long, Y., Luo, C., Shen, J. and Sun, X., (2024). Prompting Explicit and Implicit Knowledge for Multi-hop Question Answering Based on Human Reading Process Xin, T., He, Y., Zamani, ED. and Luo, C., (2024). Poster: Cyber Security Economics Model (CYSEM) Meng, F., Qi, M. and Luo, C., (2024). Research Progress of Review Topic Mining Methods: From Word Frequency Statistics to Deep Learning He, Y., Luo, C., Zheng, J., Wang, K. and Zhang\", H., (2022). AI Based Directory Discovery Attack and Prevention of the Medical Systems Zhao, S., Luo, C., He, Y. and Li\", L., (2022). Simulation of Acquired LQT Syndrome Using Human Virtual Ventric",
  "content_length": 13435,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:42"
}