{
  "name": "Cunxi Yu",
  "homepage": "https://ycunxi.github.io/cunxiyu",
  "status": "success",
  "content": "Cunxi Yu @ University of Maryland Assistant ProfessorUniversity of Maryland, College Park Email:cunxiyu(at)umd(dot)edu About Cunxi is an Assistant Professor in the ECE Department (A. James Clark School of Engineering), and an affiliated Assistant Professor in the CS Department, at the University of Maryland, College Park. His research interests focus on novel algorithms, systems, and hardware designs for computing and security. Before joining University of Maryland, Cunxi was Assistant Professor with University of Utah, and held PostDoc at Cornell University (with Prof. Zhiru Zhang) and EPFL in 2017-2018 (with Prof. Giovanni De Micheli). Cunxi was a research intern at IBM T.J Watson Research Center in 2015 and 2016. He received Ph.D. degree from UMass Amherst in 2017 under Prof. Maciej Ciesielski. His work received the Best Paper Award at ASPLOS (2025), Best Paper Award at DAC (2023), Best Paper Finalists at DAC (2025), several Best Paper Nominations, NVIDIA Academic Research Award (2025), First Place of DAC Hack@DAC (2017), American Physical Society DLS poster award (2022), and NSF CAREER Award (2021). CV I am very fortunate to work with a group of talented researchers and students! I am actively seeking students who show strong interests in EDA and formal methods research. I am deeply grateful to my wife and our two beloved cats, Bagel and Oreo, for their unwavering support and companionship. Recent talks The Rise and Fall of Machine Learning for EDA and Combinatorial Optimization and Verification (U Delaware, Peking U, Google X, NVIDIA, Synopsys, UWisconsin Madison, GaTech, TAMU, Google DeepMind, University of Minnesota, UCLA) A Computer Engineering Journey to Optical Neural Networks: Infrastructure, Algorithms, and Co-design (Rutgers Efficient AI Seminar, Stevens Institute of Technology, NCSU, OPTSys Seminar Series) News 10/2025 Invited Talk at UCLA CS. 09/2025 e-boost received Best Paper Nomination at ICCAD'25. 09/2025 Repository-scale Code Self-Evolution SATLUTION on Arxiv. 09/2025 Colloquium at University of Minnesota 08/2025 Invited Talk at Google DeepMind 07/2025 Three papers accepted at MLCAD 2025. 07/2025 Three papers accepted at ICCAD 2025. 06/2025 Yu Received NVIDIA Academic Research Award. 05/2025 REVEAL accepted at IWLS 2025. 05/2025 BoolE has received Best Paper Finalists (5/1862) at DAC 2025! GitHub 05/2025 One paper accepted at Nature Communications. 05/2025 One paper accepted at ICML'25. 05/2025 HEC accepted at USENIX ATC'25. 04/2025 SmoothE received Best Paper Award at ASPLOS'25! GitHub 03/2025 Invited Seminar at TAMU. 03/2025 Receive Northrop Grumman Seed Grant. 02/2025 Invited Seminar at Georgia Institute of Technology. 02/2025 Two papers accepted at DAC'25. 01/2025 Received a DARPA award for intelligent combinatorial optimization. 12/2024 Our collaborative work with Prof. Weilu Gao accepted at Advanced Photonics Research. 12/2024 Invited Seminar at University of Wisconsin–Madison. 11/2024 One paper appeared at VLSI-SoC'25 on formal verification of modular arithmetic. 10/2024 Team UMD placed 3rd in the first LLM for Hardware Design Contest@ICCAD, led by Junior student Carsten. Congrats! 10/2024 SmoothE to appear at ASPLOS'25! 08/2024 Welcome Zhan Song, Chen Chen, Qihao Hu to the group! 06/2024 Yu gave Talks at NVIDIA Research and Google DeepMind. 06/2024 MapTune is accepted at ICCAD'24 GitHub 05/2024 Differentiable combinatorial scheduler is accepted at ICML'24. GitHub 04/2024 Daniel (NSF REU) will begin his PhD study at MIT EECS in Fall'24! 04/2024 Received $900K NSF Grant for advanced hardware synthesis w Prof. Zhiru Zhang (Cornell). (past news) Opoen-source Tools Formal Verification & Synthesis via E-Graphs eBoost (ICCAD'25, Best Paper Nomination). [Github] BoolE (DAC'25, Best Paper Nomination) BoolE: Exact Symbolic Reasoning via Boolean Equality Saturation. [Github] SmoothE (ASPLOS'25, Best Paper Award) (Differentiable E-Graph Extraction) [GitHub] E-morphic (DAC'25) (Scalable Equality Saturation for Structural Exploration in Logic Synthesis) [GitHub] ML-based Synthesis & Design Automation Systems MapTune (ICCAD'24) Boosting ASIC Mapping with STD Library Tuning - [Github]/li> Gamora (DAC'23, Best Paper Award) (Graph learning for Boolean reasoning) [Github] FlowTune (ICCAD'20, TCAD'22) (w end-to-end FPGA/ASIC support) [Github] FlowGen (DAC'18)[Github] (replaced by FlowTune) Photonic & Optical Neural Network Design LightRidge (ICCAD'24, ASPLOS'24, Nature Comm'25) (An End-to-end Agile Design Framework for Diffractive Optical Neural Networks) [LightRidge] Formal Verification System Algebraic Combinational Equivalence Checking (ACEC) [Thesis Version] [New Version] [ACEC@ABC] Logic Decryption using Incremental SAT [Website] [Github] Formal Verification of GF(2^n) Arithmetic (ASP-DAC'17, Best Paper Nomination) [Website] [Github] People PhD Students: Jiaqi Yin (ECE, Sp'21 - ), Mingju Liu (ECE, Fall'22 - ), Curie Kim (CS, Sp'24), Zhan Song (ECE, Fall'24), Qihao Hu (ECE, Fall'25 -), Yu-Tung Liu (Fall'25 - ) Undergrad: Carsten Portner (NSF REU; S'24 - ) Alumnus: Dr. Yingjie Li(Utah/UMD, 20-25) -> Simon Fraser University Qihao Hu -> PhD Program, UMD Dr. Walter Lau Neto (Utah, 19-22) -> Synopsys Dr. Yingheng Tang (visiting student) -> Lawrence Livermore National Laboratory Tara Zamani (Utah, 19-21) -> Duke Daniel Robinson (Utah, 22-24; NSF REU) -> PhD Program, MIT EECS Professional Service Organizing Committee: ASAP'19, ICCD'(21-23), VLSI-SoC'20, General Chair@IWLS'23, MLCAD'23-25 TPC Member: IWLS*7, ICCAD*7, DAC*6, DATE*5, ASP-DAC*4, ICCD*2 Session chair: DAC*5, ICCAD*2 Journal review Science Advances Nature Communications Nature Machine Intelligence Nature Scientific Report Nature Light: Science & Applications Nanophotonics ACM Transactions on Design Automation of Electronic Systems IEEE Design & Test of Computers IEEE Transactions on Very Large Scale Integration Systems IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems IEEE Transactions on Computers IEEE Transactions on Information Forensics and Security IEEE Journal on Emerging and Selected Topics in Circuits and Systems IEEE Transactions on Emerging Topics in Computing IEEE Computer Architecture Letters ACM Transactions on Reconfigurable Technology and Systems Sponsors",
  "content_length": 6281,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:42"
}