{
  "name": "Curtis R. Menyuk",
  "homepage": "http://www.csee.umbc.edu/people/faculty/curtis-r-menyuk",
  "status": "success",
  "content": "Curtis R. Menyuk – Department of Computer Science and Electrical Engineering – UMBC Skip to main content Department of Computer Science and Electrical Engineering Menu Apply Search Search Context This Site All of UMBC Location CSEE Main Office: ITE 325 1000 Hilltop Circle Baltimore, MD 21250 Contact Phone: 410-455-3500Contact Us Department of Computer Science and Electrical Engineering on FacebookDepartment of Computer Science and Electrical Engineering on TwitterDepartment of Computer Science and Electrical Engineering on YouTubeDepartment of Computer Science and Electrical Engineering on LinkedIn Position Professor of Computer Science and Electrical Engineering Office 201 A Technology Research Center (TRC) Contact Information University of Maryland, Baltimore County 1000 Hilltop Circle Baltimore, MD 21250 phone: (410) 455-3501 email: menyuk@umbc.edu website: http://www.photonics.umbc.edu/ Education Ph.D., Physics, University of California, Los Angeles, 1981 M.S., Physics, MIT, 1976 B.S., Physics, MIT, 1976 Research Areas Dr. Menyuk’s research focuses on time and frequency measurement and transfer, nonlinear optics, optical fibers, lasers, optical resonators and micro resonators, scientific computing, nonlinear dynamics and solitons. To learn more about Dr. Menyuk’s research pursuits, read his research profile. Publications Google Scholar Location CSEE Main Office: ITE 325 1000 Hilltop Circle Baltimore, MD 21250 Contact Phone: 410-455-3500Contact Us Department of Computer Science and Electrical Engineering on FacebookDepartment of Computer Science and Electrical Engineering on TwitterDepartment of Computer Science and Electrical Engineering on YouTubeDepartment of Computer Science and Electrical Engineering on LinkedIn © UMBC: A University System of Maryland Member Institution Accreditation Equal Opportunity Privacy Policy Title IX Web Accessibility Consumer Information Subscribe to UMBC Weekly Top Stories First Name Last Name Email I am interested in: I am interested in: Undergraduate I am interested in: Graduate I am interested in: Professional Masters",
  "content_length": 2091,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:44"
}