{
  "name": "Cynthia C. S. Liem",
  "homepage": "https://www.tudelft.nl/ewi/over-de-faculteit/afdelingen/intelligent-systems/multimedia-computing/people/cynthia-liem",
  "status": "success",
  "content": "Personal page of Cynthia Liem, Computer Science TU Delft Zoeken Sluit zoek Cynthia Liem I want to stimulate the broadening of horizons, in myself and in others. In this, I want to pay special attention to keep ‘that which we do not trivially see and know already’ within reach. I am an Associate Professor at the Multimedia Computing Group. In 2007 and 2009, I obtained my BSc and MSc degree in Media and Knowledge Engineering (Computer Science) at the TU Delft, after which I continued pursuing a PhD at the same institution (defended in 2015). Besides, I obtained the BMus (2009) and MMus (2011) degree in classical piano performance at the Royal Conservatoire in The Hague. I like working on information filtering challenges in large multimodal archives. My current research interests fall under two categories, which both are strongly motivated by my combined background in computer science & engineering and music: The algorithmic surfacing of information that users would not discover by themselves. Our present-day search engines and recommender systems strongly focus on replicating earlier evidenced consumption success. But what if a user would want to develop a new interest? And what about those many items that got digitized, but hardly ever get found, simply because too few people know of their existence? As a musician, I frequently have been experimenting with this, and I believe the solution lies in proper presentation, contextualization, and comparative differentiation with respect to known standards. As a computer scientist, I am working on scaling and generalizing these thoughts, in the music domain and beyond. Validation and validity in data science: are we measuring and predicting what we intend to? In the current era of big data, we can acquire and analyze more data than ever, but this data is unstructured and messy, and measurement procedures may not have been optimal. Even more strongly, in many human-focused use cases, we may not be able to fully articulate what and where to measure, even though we have a good sense on what is an intended or unintended outcome. In music, we frequently encounter such challenges of measurement. Music information can digitally be described in many ways using many modalities, but the success of a song is typically determined by implicit human responses. As a computer scientist, I am interested in developing validation techniques that give us more confidence in our measurement procedures, also when they occur ‘in the wild’, outside of fully controlled lab settings. In this, I also explicitly am inspired by notions of psychometric validity in the social sciences domain. My current projects encompass the H2020 European research project TROMPA on crowd-powered enrichment of public-domain music resources, an NWO-KIEM research project on assessment of well-being in musicians, an NWO-Veni research project on perspective-broadening in recommender systems, and the ERASMUS+ ‘Big Data in Psychological Assessment’ education innovation project. I am grateful to work with major partners such as the National Library of The Netherlands and CDR/Muziekweb, which both have strong commitment towards public information provision and accessibility. I also am grateful to have been supported and acknowledged in many ways throughout my career, e.g. through the Google Anita Borg Scholarship 2008 and Google European Doctoral Fellowship 2010, and as one of the top-5 nominees for the New Scientist Wetenschapstalent Prijs. Finally, I have been lucky enough to have managed sustaining my musical career in parallel to my academic activities. I still am active as a performing pianist, most notably in the Magma Duo with violin player Emmy Storms, which won 1st prize at the international competition ‘A Feast of Duos’ in Sion, Switzerland, August 2014, and was laureate of the 2014-2015 Dutch Classical Talent Tour & Award career development program, leading to a national concert tour. P. Altmeyer, G.J.A. Angela, A.J. Buszydlik, K.T. Dobiczek, A. van Deursen, C.C.S. Liem (2023), Endogenous Macrodynamics in Algorithic Recourse [VIDEO]. A.J. Bartlett, C.C.S. Liem, A. Panichella (2023), On the Strengths of Pure Evolutionary Algorithms in Generating Adversarial Examples, In The 16th International Workshop on Search-Based and Fuzz Testing, IEEE / ACM. Deel deze pagina: Facebook Linkedin Twitter Email WhatsApp Deel deze pagina Faculty of Electrical Engineering, Mathematics and Computer Science Intelligent Systems Van Mourik Broekmanweg 6 2628 XE Delft The Netherlands",
  "content_length": 4541,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:43"
}