{
  "name": "Cynthia Matuszek",
  "homepage": "http://www.csee.umbc.edu/~cmat",
  "status": "success",
  "content": "Cynthia Matuszek Cynthia Matuszek Bio Publications Prospective Students Contact & Links Research My work focuses on the problem of grounded language acquisition: extracting semantically meaningful representations of human language by mapping those representations to the noisy, unpredictable physical world in which robots operate. I combine robotics, natural language processing, and machine learning to build systems that non-specialists can instruct, control, and interact with intuitively and naturally. My group in the Interactive Robotics and Language lab studies how robots can use this kind of language learning to learn to follow instructions or learn about the world. This not only makes robots more useful, but also demonstrates the power of combining robotics with natural language processing. About Me I joined the Computer Science and Electrical Engineering department at UMBC in autumn of 2014, where I founded the Interactive Robotics and Language lab. I obtained my Ph.D. at the University of Washington in Seattle, where was co-advised by Dieter Fox and Luke Zettlemoyer. Teaching I primarily teach courses on artificial intelligence, robotics, human-robot interaction, and ethics in computing. Interested EE, ECE and ME students (and others, when appropriate) are welcome to contact me to see if a course is appropriate. All classes do require solid programming skills. Potential Students If you are curious about working with us, check out the IRAL lab web page to get some background on the kind of work we do and then take a look at my prospective students page. I would encourage you to take a look at some of the papers and be ready to talk about what you find interesting about our area specifically, as well as research in general. TL;DR: For more about my research, see the Interactive Robotics and Language Lab page. If you're interested in working with me, see my prospective students page. cmat@umbc.edu →",
  "content_length": 1935,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:47"
}