{
  "name": "Cyriac Aiswarya",
  "homepage": "http://www.cmi.ac.in/~aiswarya",
  "status": "success",
  "content": "Aiswarya / Aiswarya Cyriac Home Research Teaching C. Aiswarya Associate Professor Theoretical Computer Science Group Chennai Mathematical Institute Member, ReLaX (an international research lab of CNRS, France) Research Interests: I am interested in automata theory, and its applications in the verification of infinite state systems. I am also interested in formal mathematical models of concurrent and infinite state systems. Upcoming Events PODS 2026: I serve on the PC. FSTTCS 2025: I serve on the PC (co-chair). ICALP 2025: I serve on the PC. Past Events CAALM 2025: I was an invited speaker. FOSSACS 2025: I served on the PC. ICLA 2025: I served on the PC (co-chair). more WAGS 2024: I was an invited speaker. FSTTCS 2024: I served on the PC. SURC 2024: I was an invited speaker. DLT 2024: Our paper on Deciding Conjugacy of a Rational Relation is accepted. Joint work with Amaldev Manuel, and Saina Sunny. ICALP 2024: Our paper on Edit Distance of Finite State Transducers is accepted. Joint work with Amaldev Manuel, and Saina Sunny. Highlights 2024: I served on the PC. PODS 2024: Our paper on the Verification of Communicating Datalog Programs is accepted. Joint work with Diego Calvanese, Francesco Di Cosmo, and Marco Montali. STACS 2024: I presented our work on the Satisfiability of String Constraints. Joint work with Soumodev Mal and Prakash Saivasan. FSTTCS 2023: I served on the PC. CONCUR 2023: I served on the PC. ACTS 2023: I was a co-organizer. Proudly celebrating the career of Paul Gastin. ICLA 2023: I served on the PC. RP 2022: I served on the PC. Highlights 2022: I served on the PC. CONCUR 2022: I served on the PC. FoSSaCS 2022: I served on the PC. CONCUR 2021: I served on the PC. STACS 2021: I served on the PC. WATA 2020/2021: I presented our work on Weighted Tiling Systems for Graphs: Evaluation Complexity. Joint work with Paul Gastin FSTTCS 2020: I presented our work on Weighted Tiling Systems for Graphs: Evaluation Complexity. Joint work with Paul Gastin Reachability Problems 2020: I served on the PC. Higlights of Logic, Games and Automata 2020: I served on the PC. FORMATS 2020: I served on the PC. NETYS 2020: I was an invited speaker. GALA 2019: I was an organizer, along with Benedikt Bollig and S. Akshay. FSTTCS 2019: I served on the PC. NETYS 2019: I served on the PC. LICS 2019: I served on the PC. PODS 2019: I presented our work on database driven systems with order constraints. Joint work with P.A. Abdulla, M. F. Atig, and M. Montali. Formal Methods Update Meeting 2019: I gave a talk. CAALM 2019: I was an invited speaker. Office: 603 Address: Chennai Mathematical Institute H1, SIPCOT IT Park Siruseri Chennai 603103 email:a i s w a r y a AT cmi DOT ac DOT in office phone+91 44 7196 1072",
  "content_length": 2743,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:48"
}