{
  "name": "Cédric Pradalier",
  "homepage": "https://research.gatech.edu/people/cedric-pradalier",
  "status": "success",
  "content": "Cédric Pradalier | Research Skip to main navigation Skip to main content cedric.pradalier@georgiatech-metz.fr The DREAM Lab Prof. Pradalier is Associate Professor at GeorgiaTech Lorraine, the French campus of the Georgia Institute of Technology (a.k.a. GeorgiaTech) since September 2012. He defended his “Habilitation à Diriger des Recherches” (Authority to Supervise Research) in 2015 on the topic of “Autonomous Mobile Systems for Long-Term Operations in Spatio-Temporal Environments” at the National Polytechnic Institute of Toulouse (INPT). His objective is to extend the activity of the CNRS IRL2958 GT-CNRS towards robotics, leveraging on one side the strong robotic research inside CNRS and on the other side the collaboration potential with the Robotics and Intelligent Machines (RIM) laboratory at GTL. At the IRL, he is now the coordinator of the H2020 BugWright2 project, has been involved in H2020 project Flourish and PF7 project Noptilus, as well as in projects on environmental monitoring. From November 2007 until December 2012, Dr. Pradalier has been deputy director in the Autonomous Systems Lab at ETH Zürich. In this role, he was the technical coordinator of the V-Charge project (IP, 2010-2014) and also involved in the development of innovative robotic platforms such as autonomous boats for environment monitoring or prototype space rovers funded by the European Space Agency. He is a founding member of the ETH start-up Skybotix, within which he was responsible for software development and integration. From 2004 to 2007, Dr. Pradalier was a research scientist at CSIRO Australia. He was then involved in the development of software for autonomous large industrial robots and an autonomous underwater vehicle for the monitoring of the Great Barrier Reef, Australia. He received his Ph.D. in 2004 from the National Polytechnic Institute of Grenoble (INPG) on the topic of autonomous navigation of a small urban mobility system and he is Ingénieur from the National Engineering School for Computer Science and Applied Math in Grenoble (ENSIMAG). Professor; Georgia Tech Lorraine Phone +33(0) 3 8720.3925 Office Georgia Tech Lorraine | Unite Mixte Internationale 2958 | 2 Rue Marconi | 57070 Metz, France Research Focus Areas Autonomy IRI And Role Robotics > Core Faculty Robotics University, College, and School/Department Georgia Institute of Technology > College of Computing > School of Interactive Computing Georgia Tech Lorraine Cédric Pradalier Show Regular Profile This website uses cookies. For more information, review our Privacy & Legal Notice Questions? Please email privacy@gatech.edu. More Info Accept",
  "content_length": 2638,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:50"
}