{
  "name": "César Torres 0001",
  "homepage": "http://cearto.com",
  "status": "success",
  "content": "Cesar Torres: ZENFORTECH Home Publications Teaching Art & Design Cesar Torres, Ph.D. Assistant Professor, Computer Science & Engineering Faculty Affiliate, Art & Art History Director, The Hybrid Atelier The University of Texas at Arlington Dr. Cesar Torres is the director of The Hybrid Atelier and an Assistant Professor of Computer Science & Engineering at The University of Texas at Arlington. As a design researcher, he synthesizes new media and craft theory into the software and hardware design of creative, tangible user interfaces. He has received multiple best paper awards at top-tier venues within HCI and is the recipient of the NSF CRII Grant, NSF REU Site Grant, and MSR Accelerate Foundational Research Grant, and the UT System STARS Award. He serves on the program committees for ACM Designing Interactive Systems (DIS), Creativity and Cognition (C&C), and Human Factors in Computing Systems (CHI). He holds degrees in Computer Science (Ph.D. '19 - UC Berkeley, B.S. '13 - Stanford), in Art Practice (B.A. '13 - Stanford), and in New Media (D.E. '19 - UC Berkeley). To learn more about my current research works and interests, visit my lab website at The Hybrid Atelier. C.V. Research View All Projects Visit Lab Webpage Lab • The Hybrid Atelier (ERB 281/282) At UTA, I direct the Hybrid Atelier (ERB 281/282) a research makerspace investigating the smart creative environment. The atelier is a site of creative inquiry for mixed-reality user interfaces, human-motion capture and analysis, and exploratory engineering of interactive clay, glass, and printmaking practices. Teaching CURRENT COURSES Course No./Syllabus Semester Time Location CSE 1320 Intermediate Programming (3 units) Spring 2024 12:30PM - 1:50PM TuTh NH229 Programming concepts beyond basic control and data structures. Emphasis is given to data structures, including linked lists and trees, as well as modular design consistent with software engineering principles. CSE 1320 is a continuation of the concepts presented in CSE 1310. CSE 3392 Special Topics in CS: Intro to Human-Computer Interaction (3 units) Spring 2024 2:00PM - 3:20PM TuTh NH229 Tech Elective: CS & SE Introduction to the interdisciplinary field of Human-Computer Interaction. Studio-based course that bridges cognitive science, ethnography, and anthropology to provide a profound understanding of user experience, while concurrently fostering frontend development skills in software, hardware, and wireless communication for the crafting of state-of-the-art user interfaces. Emphasizing a human-centered design ethos, the course encourages the design of interfaces that are not only functional but also meaningful and critically reflective. PREVIOUS COURSES Course No./Syllabus Semester CSE 3392 Special Topics in CS: Intro to Human-Computer Interaction UT Arlington Spring 2021 CSE 4391/5392/6392 Advanced Topics in CS: Design Tools UT Arlington Fall 2020 CSE 3392 Special Topics in CS: Intro to Human-Computer Interaction UT Arlington Spring 2020 CSE 5392/6392 Advanced Topics in CS: Design Tools UT Arlington Fall 2019 CS 160 Intro to UI Design and Development UC Berkeley Fall 2019 CONTACT INFO Office Hours (Spring 2024) Tuesdays/Thursday 3:30-4:30PM, ERB 559 Email cearto@uta.edu Google Scholar Profile Tweets ORCID TRAVEL Presenting with Justin Ginsberg at UrbanGlass in NYC Nov 2023 Heading to the International Symposium on Academic Makerspaces Oct 2023 Virtual Talk at the DUBSeminar Oct 24-27, 2019 Berkeley, CA Oct 24-27, 2019 NSF, Washington D.C. Nov 2019 NEWS Received the MSR Accelerate Foundational Models Grant Dec 2023 Joining the DIS 2024 as an SC Oct 2023 Joining the DIS 2023 as an SC Oct 2023 Joining the PETRA 2021 Committee Oct 2020 First Meeting of the TxHCI Seminar Sept 25 2020 Joining the C&C Pictorials AC Committee Mar 2020 Siloseam accepted to DIS2020 2020 Joining the DIS2020 AC Committee Aug 1 2019 First day at UTA! Aug 1 2019",
  "content_length": 3915,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:56"
}