{
  "name": "D. Caleb Rucker",
  "homepage": "https://mabe.utk.edu/people/d-caleb-rucker",
  "status": "success",
  "content": "Mechanical and Aerospace Engineering - Department of Mechanical and Aerospace Engineering Department of Mechanical & Aerospace Engineering Our mechanical and aerospace engineering programs combine core knowledge with hands-on experience to prepare students to innovate and lead in designing advanced aerospace systems and solving complex mechanical challenges. The department offers both graduate and undergraduate degrees in mechanical and aerospace engineering. Graduates are ready to make an immediate impact in industry, research, and beyond. Future Students Department of Biomedical Engineering Biomedical engineering is now its own department, offering a focused curriculum to better support our growing student community and meet the evolving needs of the industry. Learn about the new department Explore our Programs Our department offers comprehensive mechanical and aerospace engineering programs that combine strong theoretical foundations with practical applications, preparing students at all levels to excel in diverse industries such as automotive, aerospace, energy, and manufacturing. Academic Degree Programs We offer a variety of degree programs designed to prepare students for their future in mechanical and aerospace engineering, including BS, MS, and PhD programs, as well as a five-year BS/MS program for qualified students. Learn more about our programs Undergrad Studies Our undergraduate programs build a strong foundation in engineering principles while providing opportunities for design, interdisciplinary research, and real-world problem-solving. The curriculum prepares students for future careers in industries from manufacturing to space exploration. Undergrad Studies Grad Studies Our graduate programs in mechanical and aerospace engineering prepares future research and industry leaders through advanced study, collaborative research with expert faculty, and access to world-class facilities and partners like Oak Ridge National Laboratory and the UT Space Institute. Grad Studies cutting-edge Research Our faculty leads collaborative research across areas such as robotics, fluid dynamics, hypersonics, and energy systems. Working alongside industry and government partners, our students and faculty use cutting-edge facilities to address complex engineering problems. Together, their efforts advance the frontiers of mechanical and aerospace engineering. Explore our research Helpful Links Get to know us Looking to learn more about our department and financial aid opportunities? Use the links below to learn more about us. Financial Aid What Is ME? What Is AE?",
  "content_length": 2601,
  "method": "requests",
  "crawl_time": "2025-12-01 12:55:57"
}