{
  "name": "D. Scott McCrickard",
  "homepage": "http://people.cs.vt.edu/~mccricks",
  "status": "success",
  "content": "Scott McCrickard D. SCOTT MCCRICKARD Associate Professor Department of Computer Science 1118 VTKW II (or McBryde 133EFH) Virginia Tech Blacksburg VA 24061-0902 Email: mccricks@cs.vt.edu URL: http://people.cs.vt.edu/~mccricks/ Blog: http://mccricks.wordpress.com/ Office hours: Fridays 3:30pm-5pm at the Creativity and Innovation Center (C+I) room 104 (during Hack and Yak) or by appointment Research Interests: Technology on the Trail Human-Computer Interaction Design Methods in HCI User and Task Modeling Notification Systems Ethics and Technology Interfaces for Mobile and Ubiquitous Computing Devices My research vision is to lead the emergence of the notification systems research field to a position marked by cohesive community effort, scientific method, and focus on relevant, real-world problems--providing improved system interfaces and engineering processes. Notification systems are intended to draw your attention away from a primary task, so designing such systems requires understanding the costs and benefits to interruption, reaction, and comprehension. I work on both the process and application side in advancing this emerging domain. My process side work focuses on ways to capture, share, and reuse interface design knowledge. My applications, generally developed for mobile devices (tablets, smartwatches, handhelds, and mobile phones), focus on fields in which appropriate notifications have great potential value--health and wellness, assistive technologies, hiking and biking, work-order systems, and educational situations. I lead Virginia Tech's Technology on the Trail initiative, seeking to investigate ways that technology is used in hiking, biking, walking, and other outdoor travel-related settings. We balance the benefits of inserting technology into hiking and outdoor settings with the impacts on individuals and their relationships with others. Much of our work has examined existing technologies and how they have impacted our experiences and relationships in the outdoors. We also seek partnerships with scientists and outdoor enthusiasts who are interested in ways that technology can help them; current partnerships are investigating poison ivy emergence and spread, water quality monitoring, campsite sustainability, and birding. A good start to understanding this area is through the HCI Outdoors book that I co-edited with Michael Jones from BYU and Virginia Tech grad student Tim Stelter--an edited volume with contributions from scientists and researchers around the world. Potential collaborators are encouraged to send me email or, if you are local, come by during my office hours which I hold as part of our weekly Hack and Yak gathering (as long as there's not a global pandemic, sabbatical, or other emergency going on). I'm always interested in working on research projects with motivated students at all levels: undergrad, Masters, Ph.D. I co-founded and serve on the committe for the VTURCS undergraduate research program to encourage undergrads to become involved in research, and, for undergraduate students wanting to work with me, I sponsor several projects through the program. I also teach Senior Capstone classes and grad special topics classes on a rotating set of themes. Visit my research group page for more details about the research directions of my students and me. You can also visit my Google Scholar page for a view of high-impact papers and collaborators. Teaching Interests: I teach classes that explore the role of humans in designing and using technology. My classes tend to be highly interactive, with a mix of teaching styles that seeks to engage people of varying skills, interests, and abilities. I greatly enjoy developing in-class activities that ask students to apply the skills they are learning to problems that are relevant to the region, state, country, and world. Most recently I have been developing activities around the theme \"Technology on the Trail\", that looks at ways that technology can help inform and engage users on extended journeys without interfering negatively in their experience. I am happy to share teaching materials for courses listed below. I also seek out interesting and engaging teaching experiences, and I am open to offers to teach elsewhere! I spent a semester in Egypt (Alexandria and Cairo) teaching classes on human-computer interaction, interface design, and information visualization. I also taught during two abbreviated summer programs at the University of Colorado, Boulder. And I led a multi-university undergraduate course partnering with Historically Black Colleges and Universities focused on research methods for undergrads. Fall 2025 Teaching Schedule: CS 4784 HCI Capstone: Nature HCI CS 3724 Intro to HCI Classes taught: These classes are ordered based (roughly) on the frequency with which I teach them. The lead number describes the intended course audience; i.e., 1000-level courses tend to have no prerequisites and are for targeted for freshmen, 2000-3000 may have a few prereqs and are targeted for sophomores and juniors, 4000 tend to have multiple prereqs and are targeted for junior and seniors, 5000 are for seniors and first-year grad students, 6000 are for advanced grad students who have had relevant 5000-level classes. GRAD 5134 Human Centered Design (Spring 2021, Spring 2023, Spring 2025) CS 3724 Introduction to Human Computer Interaction (Spring 2025, Fall 2024, Spring 2024, Fall 2023, Summer 2023, Summer 2022, Summer 2021, Spring 2020, Fall 2020, Fall 2018, Spring 2018, Spring 2017, Spring 2014, Summer 2013, Fall 2013, Spring 2013, Fall 2007, Spring 2006 (2 sections), Spring 2005 (2 sections), Fall 2003, Fall 2002, Fall 2001) CS 3604 Ethics and Professionalism in Computing (Fall 2024, Fall 2022, Spring 2020, Summer 2018, Fall 2015, Spring 2015, Fall 2012, Fall 2010, Spring 2010, Fall 2003) CS/ISE 5714 Usability Engineering (Spring 2025, Spring 2023, Spring 2021, Spring 2019, Fall 2015, Spring 2011, Spring 2010, Fall 2011, Spring 2009, Fall 2006, Fall 2005, Spring 2003, Spring 2002) CS 5724 Models and Theories of HCI (Fall 2024, Fall 2022, Fall 2020, Fall 2017, Fall 2015, Fall 2014, Fall 2013, Fall 2012, Fall 2010, Fall 2008, Fall 2007, Fall 2004) CS 3714 Mobile Software Design (also taught as CS 4984/CSCI 4830/CSCI 7000 Mobile Interfaces) (Spring 2013, Summer 2012, Summer 2011, Spring 2011) CS 2604 Data Structures and File Processing (Spring 2001, Fall 2001) CS 5764 Information Visualization (Fall 2006) CS 6724 HCI Special Topics: HCI Outdoors (Fall 2020, Fall 2019) CS 4784 HCI Capstone: HCI Outdoors (Fall 2020, Fall 2019) CS 4644 Creative Computing Capstone (Fall 2016) CS 4784/6724 Technology on the Trail (Spring 2017, Spring 2018) CS 6724 Artifacts in Design (Fall 2009) CS 6724 Design and Software Reuse in HCI (Spring 2004, Spring 2003) CS 6724 Communicating Information Using Peripheral Displays (Fall 2000) Service and Outreach Interests: I am Co-Director of Virginia Tech's Human-Centered Design (HCD) program, a degree-granting program that offers both a Ph.D. and a Graduate Certificate. The Ph.D. degree is housed in the Virginia Tech Graduate School and is one of Virginia Tech's interdisciplinary Ph.D.s, which seek to encourage and enable Ph.D.s with significant overlap across disciplinary boundaries. Together with Dr. Ico Bukvic, we direct the program, which includes handling admissions, matching students to advisors, procuring funds, holding research and social events, and leading outreach events within and outside of Virginia Tech. We accomplish these tasks with the help and advice of the HCD Executive Committee, a group of faculty and administrators selected from the arts, engineering, computing, sciences, and architecture. Please visit the HCD web site for more information, and email me with questions, comments, and to volunteer to help with your time or money! The focus of my outreach efforts is on inclusion of a diverse set of perspectives into the fields of human-computer interaction and computer science. Much of my outreach work has centered on inclusion of women, minorities, people with disabilities, and people in other underrepresented groups. My philosophy is that there are a great many excellent people who do not feel welcome or comfortable in computing and technology-related fields, and it is worthwhile and productive for the discipline and the individuals that we together instantiate progress toward inclusion. I'm active on several fronts for the NCWIT organization, and I'm honored to have received the NCWIT Research Mentoring Award in 2012 for my work with women and minority undergraduate students in research-related activities. I was part of our departmental team that received the NCWIT Extension Services Transformation Award in 2016 in recognition of our commitment to and proven results in recruiting and retaining women into undergraduate computing programs. I was the founding chair of the CS@VT Diversity Committee and continue to organize a lot of outreach activities, and I am the faculty adviser to our Computer Science Community Service (CS Squared) organization that coordinates volunteers in schools and community centers in our region. Prior diversity activities include serving as director for the Center for HCI's summer REU Site program, with a number of minority and women's colleges acting as partners. I served as co-PI of A4RC, an NSF Broadening Participation in Computing (BPC) Alliance led by North Carolina A&T State University that helped establish an alliance between minority universities and research universities for collaborative education and research. I've also worked with the NSF Advance program on online dissemination of materials related to the participation of women in science and engineering in graduate education through VT Advance. I'm also actively working to promote research within the CHI community. In 2022, I served as Workshops Co-Chair for the ACM GROUP Conference. In 2017 and 2018, I chaired a pair of Technology o",
  "content_length": 11146,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:02"
}