{
  "name": "D. T. Huynh",
  "homepage": "http://www.utdallas.edu/~huynh",
  "status": "success",
  "content": "D. T. Huynh E-mail: huynh@utdallas.edu   Office: (972) 883-2169 Professor Huynh received the M.S. and Ph.D. degrees in Computer Science from the University of Saarland (Germany) in 1977 and 1978, respectively, where he remained as a postdoctoral research associate until 1982. From 1982 to 1983 he was a Visiting Assistant Professor at the University of Chicago. He then spent three years as an Assistant Professor of Computer Science at Iowa State University before joining the Computer Science faculty at the University of Texas at Dallas as an Associate Professor in 1986. Dr. Huynh was promoted to Full Professor in 1991.  From 1997 through 2009 he served as Head of the Computer Science Department, which grew significantly during his tenure and has been one of the top five computer science degree producers in the nation in the last several years. Professor Huynh is currently an Associate Dean in the Erik Jonsson School of Engineering and Computer Science. He has been a member of the Advisory Board of the Journal of Automata, Languages and Combinatorics since 1996. Research Interests Wireless Ad Hoc and Sensor Networks, Combinatorial Algorithms, Computational Complexity Theory, Automata and Formal Languages, Program Analysis Representative Publications: 1. Minimum Edge Interference in Wireless Sensor Networks, (with Trac Nguyen, Nhat Lam, and Jason Bolla) Proc. of 5th International Conference on Wireless Algorithms, Systems, and Applications, Lecture Notes in Computer Science 6221, 2010. 2. Minimum Total Node Interference in Wireless Sensor Networks, (with Nhat Lam and Trac Nguyen) Proc. of 2nd International ICST Conference on Ad Hoc Networks, Victoria, Canada, 2010. 3. Minimum Data Aggregation Schedule in Wireless Sensor Networks, (with Min An, Nhat Lam, and Trac Nguyen) Proc.  of 2nd ISCA International Conference on Sensor Networks and Applications, 2010. 4. Energy-Efficient Connected D-Hop Dominating Sets in Wireless Sensor Networks, (with Trac Nguyen) Proc. of 5th IEEE International Workshop on Sensor Networks and Systems for Pervasive Computing, 2009. 5. Minimum Power Minimum D-Hop Dominating Sets in Wireless Sensor Networks, (with Trac Nguyen) Proc. of 3rd International Conference on Wireless Algorithms, Systems, and Applications, Lecture Notes in Computer Science 5258, 2008 6.       Extending Wireless Sensor Network Lifetime Using Disjoint Connected Dominating Sets, (with Trac Nguyen & Jason Bolla) Proc. of 4th SIGACT-SIGOPS International Workshop on Found. of Mobile Computing, 2007. 7.       Adapting Connected D-Hop Dominating Sets to Topology Changes in Wireless Ad Hoc networks, (with Jason Bolla), Proc. 25th IEEE Intern. Performance, Computing and Communication Conference, 2006 8.       PatZip: Pattern-Preserved Spatial Data Compression, (with Yu Qian and Kang Zhang), Proc. 9th Pacific-Asia Conference on Knowledge Discovery and Data Mining, LNAI, Springer Verlag, 2005 9.       Software Architecture Analysis: A Dynamic Slicing Approach, (with T. Kim, Y.T. Song & L. Chung), Intern. Journal of Computer & Information Science, Vol. 1, No 2, pp.91-103, 2000. 10.   Max-Min D-Hop Cluster Formation in Wireless Ad Hoc Networks, (with A. Amis, R. Prakash, T. Vuong) Proc. of IEEE INFOCOM 2000. 11.   Deciding Branching Bisimilarity of Normed Context-Free Processes Is in Sigma(2)\", (with D. Caucal and L. Tian), Information and Computation 118, pp. 306-315, 1995. 12.   \"Deciding Bisimilarity of Normed Context-Free Processes is in Sigma(2)\", (with Lu Tian), Theoretical Computer Science 123, pp. 183-197, 1994. 13.   \"On the Rearrangeability of Switching Networks Composed of Digital Symmetrical Matrices\", (with Hai Nguyen), Proc. 5th Intern. Conf. on Computing and Information, 1993. 14.   \"The Complexity of Deciding Code and Monoid Properties for Regular Sets\", International Journal of Algebra and Computation, Vol. 2, pp. 39-55, 1992. 15.   \"On Some Equivalence Relations for Probabilistic Processes\", (with Lu Tian), Fundamenta Informaticae 17, pp. 211-234, 1992. 16.   \"Non-Uniform Complexity and the Randomness of Certain Complete Languages\", Theoretical Computer Science, Vol. 96, pp. 305-324, 1992. 17.   \"The Parallel Complexity of Finite State Automata Problems\", (with Sang Cho), Information and Computation, Vol. 97, pp. 1-22, 1992. 18.   \"A Note on Separating Deterministic-Time-Complexity Classes, and on Almost-Everywhere Complex Sets\", (with J. Geske and J. Seiferas), Information and Computation, Vol. 92, pp. 97-104, 1991. 19.   \"Finite Automaton Aperiodicity is PSPACE-Complete\", (with Sang Cho), Theoretical Computer Science, Vol. 88, pp. 99-116, 1991. 20.   \"Effective Entropies and Data Compression\", Information and Computation, Vol. 90, pp. 67-85, 1991. 21.   A Complexity Hierarchy between L and NL, (with Sang Cho), Information Processing Letters, Vol. 29, 1988 22.   Some Complexity Bounds for Problems Concerning Finite and 2-Dimensional Vector Addition Systems with States, (with R. Howell, L. Rosier and H.-C. Yen), Theoretical Computer Science, 1986. 23.   Some Observations about the Randomness of Hard Problems, SIAM J. on Computing, Vol. 15, 1986 24.   A Super-Exponential Lower Bound for Grobner Bases and Church-Rosser Commutative Thue Systems, Information and Computation, Vol. 68, 1986.",
  "content_length": 5309,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:05"
}