{
  "name": "D. Turgay Altilar",
  "homepage": "http://web.itu.edu.tr/altilar",
  "status": "success",
  "content": "DTA-Main Main Lectures Undergraduate ISE101-Introduction to Information Systems ISE102-Programming I BIL105E-Intro. to Scientific and Engineering Computing BLG331-Gerçek Zaman Sistemleri BLG341E-Advanced Data Structures BLG439-Bilgisayar Projeleri I BLG449-Paralel ve Dağıtılmış Sistemlerde Proramlama BLG449E-Intro. to Parallel and Distributed Programming BLG450E-Real Time Systems Software Graduate BBL510E-Real Time System Design BBL605E-Pervasive Computing BLG507E-Distributed Operating Systems BLG549E-Graph Theory and Algorithms BLG604E-Advanced Topics in Computer Science BLG616E-Grid Computing Publications Research FuturIst RealIst ParDIst TARBIL Graduate Students Extracurricular my prehistoric page Faculty of Computer and Informatics Engineering Brief Biography D. Turgay Altilar received his Ph.D. degree in 2002 from Queen Mary, University of London. He was involved with several EU projects related to parallel multimedia processing during his Ph.D. research. He has been assigned as an Assistant Professor in 2003 at the Computer Engineering Department of Istanbul Technical University. He received his tenure in 2013 and assigned as Associate Professor. He received his full professorship in Computer Engineering in 2022. Prof. Altilar's research interests are related to wireless sensor networks, cognitive radio, real-time systems, pervasive computing, parallel, distributed, grid/cloud computing and agricultural informatics. The current research interests are routing protocol design in cognitive radio networks, data dissemination on multimedia sensor networks, MAC and routing protocol design for multichannel sensor networks, resource management Grid Computing and naturally tolerant parallel algorithm design, heterogeneous network based GPGPU computing, high performance computing for agriculture. He has served as technical program committee chair, technical program committee member, session and symposium organizer, and workshop chair in several conferences. Prof. Altilar is a member of IEEE. Prof. Altilar was the International Relations and R&D Coordinator for TARBIL (AGRIMONIS): ITU Agricultural and Environmental Applied Research Centre. Contact information New Building: Computer and Informatics Engineering Faculty Room: BBF 325 Telephone: +90 212 277 72 15 (Secretary) Fax: +90 212 277 xx xx E-mail altilar@itu.edu.tr",
  "content_length": 2361,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:05"
}