{
  "name": "Da Cao",
  "homepage": "https://sites.google.com/view/caoda",
  "status": "success",
  "content": "Da Cao@Hunan UniversitySearch this siteEmbedded FilesSkip to main contentSkip to navigationDa CaoAssociate ProfessorCollege of Computer Science and Electronic EngineeringHunan UniversityLushan Road (S), Yuelu District, Changsha, Hunan Province, China, 410082.Email: caoda0721@gmail.comBiographyI am currently an associate professor in the College of Computer Science and Electronic Engineering, Hunan University. Before this job, I achieved my master and Ph.D in the School of Information Science and Engineering, Xiamen University in 2013 and 2017, respectively. During the period from Sep. 2015 to Aug. 2016, I worked as an intern in National University of Singapore under of the supervision of Professor Tat-Seng Chua.Research InterestsMultimedia AnalysisInformation RetrievalComputer VisionNatural Language Processing Selected PublicationsSTRONG: Spatio-Temporal Reinforcement Learning for Cross-Modal Video Moment LocalizationDa Cao, Yawen Zeng, Meng Liu, Xiangnan He, Meng Wang, Zheng QinThe 27th ACM International Conference on Multimedia, 2020 (CCF A)Adversarial Video Moment Retrieval by Jointly Modeling Ranking and LocalizationDa Cao, Yawen Zeng, Xiaochi Wei, Liqiang Nie, Richang Hong, Zheng QinThe 27th ACM International Conference on Multimedia, 2020 (CCF A)Hashtag Our Stories: Hashtag Recommendation for Micro-Videos via Harnessing Multiple ModalitiesDa Cao, Lianhai Miao, Huigui Rong, Zheng Qin, Liqiang NieKnowledge-Based Systems, 2020 (CCF C, SCI 2#)Video-Based Cross-Modal Recipe RetrievalDa Cao, Zhiwang Yu, Hanling Zhang, Jiansheng Fang, Liqiang Nie, Qi TianThe 27th ACM International Conference on Multimedia, 2019 (CCF A)Video-Based Recipe RetrievalDa Cao, Ning Han, Xiaochi Wei, Xiangnan HeInformation Sciences, 2019 (CCF B, SCI 2#)Cross-Modal Recipe Retrieval via Parallel- and Cross-Attention Networks LearningDa Cao, Jingjing Chu, Ningbo Zhu, Liqiang NieKnowledge-Based Systems, 2019 (CCF C, SCI 2#)Social-Enhanced Attentive Group RecommendationDa Cao, Xiangnan He, Lianhai Miao, Guangyi Xiao, Hao Chen, Jiao XuIEEE Transactions on Knowledge and Data Engineering, 2019 (CCF A, SCI 2#)Attentive Group RecommendationDa Cao, Xiangnan He, Lianhai Miao, Yahui An, Chao Yang, Richang HongThe 41st International ACM SIGIR Conference, 2018 (CCF A)Embedding Factorization Models for Jointly Recommending Items and User Generated ListsDa Cao, Liqiang Nie, Xiangnan He, Xiaochi Wei, Shunzhi Zhu, Tat-Seng ChuaThe 40th International ACM SIGIR Conference, 2017 (CCF A)Cross-Platform App Recommendation by Jointly Modeling Ratings and TextsDa Cao, Xiangnan He, Liqiang Nie, Xiaochi Wei, Xia Hu, Shunxiang Wu, Tat-Seng ChuaACM Transactions on Information Systems, 2017 (CCF A, SCI 3#)Version-sensitive mobile App recommendationDa Cao, Liqiang Nie, Xiangnan He, Xiaochi Wei, Jialie Shen, Shunxiang Wu, Tat-Seng ChuaInformation Sciences, 2016 (CCF B, SCI 2#) Reseach PartersTat-Seng Chua. Professor in National University of Singapore. [Homepage]Liqiang Nie. Professor in Shandong University. [Homepage]Xiangnan He. Research fellow in National University of Singapore. [Homepage]Xia Hu. Assistant Professor in Texas A&M University. [Homepage]Jialie Shen. Assistant Professor in Newcastle University. [Homepage]Richang Hong. Professor in Hefei University of Technology. [Homepage]Meng Wang. Professor in Hefei University of Technology. [Homepage]Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 3404,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:01"
}