{
  "name": "Da Deng 0001",
  "homepage": "https://www.covic.otago.ac.nz/~jdeng",
  "status": "success",
  "content": "Jeremiah Deng, University of Otago Jeremiah D. Deng Associate Professor School of Computing University of Otago Po Box 56, Dunedin, New Zealand Tel: 64-3-479 8090, Fax: 64-3-479 8311 E-mail - jeremiah dot deng at otago dot ac dot nz Office: OBS 3.34, Commerce Bld., Cnr Union St. & Clyde St. Teaching for 2022 S2: INFO411 - Machine Learning and Data Mining FY: INFO501/580 Data Science Project I am coordinating these programmes: MBusDataSc, MAppSci in Telecommunications. Research I lead the PRML Lab. Selected recent publications: Machine learning & computational intelligence Machine Learning and biomedical applications Y. Pang, H. Zhang, J. D. Deng, L. Peng and F. Teng, \"Collaborative Learning With Heterogeneous Local Models: A Rule-Based Knowledge Fusion Approach,\" in IEEE Transactions on Knowledge and Data Engineering, doi: 10.1109/TKDE.2023.3341808, 2023. Y Yue, D De Ridder, P Manning, M Hall, D Adhia, J Deng. Discovering Functional Connectivity-Based Neural Signatures of Obesity via Dual-Layer Incremental Wrapper-Based Feature Selection, accepted by ICONIP'24. FN Fernando, JD Deng. Adaptive Population-Based Incremental Learning for Feature Selection in Leukemia Gene Expression Data, accepted by ICONIP'24. Y Yue, JD Deng, D De Ridder, P Manning. Variational Autoencoder Learns Better Feature Representations for EEG-based Obesity Classification, accepted by ICPR'2024. (arXiv) Y Yue, J Deng, T Chakrapoti, D De Ridder, P Manning. Unsupervised Hybrid Deep Feature Encoder for Robust Feature Learning from Resting-State EEG Data, IEEE EMBC'24, accepted. A Tetereva, J Li, J D Deng, A Stringaris, N Pat. Capturing Brain-Cognition Relationship: Integrating Task-Based fMRI Across Tasks Markedly Boosts Prediction and Reliability and Reveals the Role of Frontoparietal Areas. NeuroImage, 2022. bioRXiv J Hou, X Ding, JD Deng, S Cranefield. Deep adversarial transition learning using cross-grafted generative stacks. Neural Networks 149: 172-183 (2022) arXiv J Hou, JD Deng, S Cranefield, X Ding. Cross-domain latent modulation for variational transfer learning, Proc. WACV'2021. arXiv J Hou, JD Deng, S Cranefield, X Ding. Variational Transfer Learning using Cross-Domain Latent Modulation, arXiv, 2022. Image segmentation J Hou, X Ding, JD Deng. Semi-Supervised Semantic Segmentation of Vessel Images using Leaking Perturbations. WACV 2022: 1769-1778. X Gu, JD Deng, A multi-feature bipartite graph ensemble for image segmentation, accepted by Pattern Recognition Letters, 2019 (doi) X. Gu, J. D. Deng, M. K. Purvis, Improving superpixel-based image segmentation by incorporating color covariance matrix Manifolds, Proc. ICIP'14 Paris. (Top 10% Paper) Video surveillance and anomaly detection H. Lin, J. D. Deng, D. Alberts, F. Wilhelm, Helmet use detection of tracked motorcycles using cnn-based multi-task learning, IEEE Access, 2020 (doi) H. Lin, J. D. Deng, B. J. Woodford, A. Shahi: Online weighted clustering for real-time abnormal event detection in video surveillance. ACM Multimedia 2016: 536-540. (doi) H. Lin, J. D. Deng, B. J. Woodford, Anomaly detection in crowd scenes via online adaptive one-class support vector machines, Proc. ICIP'15 Quebec. Stochastic optimization and computational intelligence F-F Wei; W-N Chen; Q. Yang; J. Deng; X-N Luo; H. Jin; J. Zhang: Classifier-assisted level-based learning swarm optimizer for expensive optimization. IEEE Transactions on Evolutionary Computation, 25(2):219-233, IEEExplore Q. Liu; W-N Chen; J. D. Deng; T. Gu; H. Zhang; Z. Yu; J. Zhang. Benchmarking stochastic algorithms for global optimization problems by visualizing confidence intervals, IEEE Transactions on Cybernetics, 2017, 47(9):2924 - 2937. (doi) Q. Yang; W. N. Chen; J. D. Deng; Y. Li; J. Zhang, A level-based learning swarm optimizer for large scale optimization, IEEE Transactions on Evolutionary Computation, 22:578-594, 2017. (doi) Q. Yang; W-N Chen; T. Gu; H. Zhang; J. D. Deng; Y. Li; J. Zhang. Segment-based predominant learning swarm optimizer for large-scale optimization, IEEE Transactions on Cybernetics, 2017, 47(9):2896 - 2910. (doi) Other recent papers Kids Online Aotearoa: An objective protocol to study the nature and extent of children’s online world, JMIR Protocols, preprint, 7/2022. J. D. Deng, Online outlier detection of energy data streams using incremental and kernel PCA algorithms, Proc. 2016 IEEE ICDM Workshops, December 12, Barcelona, pp.390-397. (doi) A. Shahi, J. D. Deng, B. Woodford, A streaning ensemble with multi-class imbalance learning for activity recognition, Proc. IEEE Inter. Joint Conf. on Neural Networks (IJCNN) 2017: 3983-3990. (doi) S H-S Lee, J. D. Deng, L. Peng, M. K. Purvis, M. Purvis: Top-k merit weighting PBIL for optimal coalition structure generation of smart grids. ICONIP (4) 2017: 171-181 (doi) A. Shahi, J. D. Deng, B. J. Woodford: Online hidden conditional random fields to recognize activity-driven behavior using adaptive resilient gradient learning. ICONIP (1) 2017: 515-525 M. Shah, J. D. Deng, B. J. Woodford: A Self-adaptive CodeBook (SACB) model for real-time background subtraction. Image Vision Comput. 38: 52-64 (2015) J. D. Deng, C. Simmermacher and S. Cranefield. A study on feature analysis for musical instrument classification. IEEE Trans. System, Man and Cybernetics - Part B, vol. 38, no. 2, pp.429-438, 2008. [preprint] D. Deng, Content-based image collection summarization and comparison using self-organizing maps. Pattern Recognition, 40:2, pp.718-727, 2007. [doi] Performance modeling and mobile computing J. D. Deng, Performance Modelling of Synchronized Predictive Sensing for Clustered Wireless Sensor Networks, APCC'19, Ho Chi Minh City, 2019. S. Zareei, A. Sedigh, J. D. Deng, M. Purvis, Buffer management using integrated queueing models for mobile energy harvesting sensors, PIMRC'17, 2017. X-F Liu; Z-H Zhan; J. D. Deng; Y. Li; T. Gu; J. Zhang. An energy efficient ant colony system for virtual machine placement in cloud computing, IEEE Transactions on Evolutionary Computation, 2016, online. (doi) Y. Xu, J. D. Deng, M. Nowostawski, M. K. Purvis, Optimized routing for video streaming in multi-hop wireless networks using analytical capacity estimation, ournal of Computer and System Sciences, 81(1): 145-157, 2015. Edited books Proceedings of the Australasian Joint Conference on Artificial Intelligence - Workshops (AIW'19), J. D. Deng and A. Rahman Eds., ACM, 2019. Proceedings of the 2nd Workshop on Machine Learning for Sensory Data Analysis (MLSDA'14), A. Rahman, J. D. Deng and J. Li Eds., ACM, 2014 (in conjunction with PRICAI'14). Proceedings of the 1st Workshop on Machine Learning for Sensory Data Analysis (MLSDA'13), J. D. Deng and H. Zhang Eds., ACM, 2013 (in conjunction with AI'13). Proceedings of the 27th Conf. on Image and Vision Computing New Zealand (IVCNZ'12), edited by B. McCane, S. Mills and J. D. Deng, ACM, 2012. Other stuff I blog on maths/computing in Julia, and on 神學. My daughter Modi (默笛) is a pianist and a published writer. Last modified: 3/9/2024",
  "content_length": 7026,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:02"
}