{
  "name": "Daehyun Kim 0005",
  "homepage": "https://dhkim16.github.io",
  "status": "success",
  "content": "Dae Hyun Kim Yonsei University Department of Computer Science and Engineering Human-Data Interaction Lab (HDIL) HCI | HAI | Data Visualization Contact Information Email: 50 Yonsei-ro, Seodaemun-gu Engineering Hall 4, Room D718 Seoul, Republic of Korea, 03722 Office Hours: Mon 4-6pm Teaching >> Show all Recent & Upcoming Travel >> Show all Current Students & Mentees MS: Interns: Alumni / Previous Mentees KAIST (during PostDoc): Stanford (during PhD): I am an assistant professor at Yonsei University and one of the faculty members leading the Human-Data Interaction Lab (HDIL). My research interest is in the intersection of Human-Computer Interaction (HCI), Human-AI Interaction (HAI), and Data Visualization. Specifically, I am interested in understanding human-human (e.g., author-reader) and human-AI communication and collaboration around data and/or in other non-verbal contexts (e.g., metaverse, AI application planning), and building systems to support the process. Before joining Yonsei University, I was a postdoctoral researcher at KAIST, working with Prof. Juho Kim. I completed my PhD in Computer Science at Stanford, with the mentorship of my advisor Prof. Maneesh Agrawala. My PhD work focuses on understanding the interactions between text and visualizations (dissertation). I did my undergrad in Computer Science at California Institute of Technology. My CV is available here. Note for potential applicants: The lab is currently welcoming students at all levels of study (undergraduate interns, MS, PhD, MS/PhD). If you are interested, please email me the following: (1) your CV, (2) your (unofficial) transcript, (3) a 1-2 page statement of purpose/research statement (written in English), (4) most noteworthy past experience, and (5) any other supporting material. Since I may ask for opinions from the students in the lab, who may become your future collaborators, please indicate if any of the material should not be shared with other students. If your profile seems like a good fit, I will reach out to you typically within a week. If you are hoping to join a graduate program (MS, PhD, MS/PhD), please consider doing an internship prior to your application so that we can see if we have a mutual fit. News & Announcements My Work Domain Data Visualization Metaverse Productivity & Collaboration Problem Space AI Support Systems Human-AI Interaction Authoring Support Audience Support Understanding Communication Natural Language Interaction Conference & Journal Papers Workshops, Extended Abstracts & Work in Progress Archived Manuscripts & Working Papers Last updated Mar 12, 2025",
  "content_length": 2607,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:05"
}