{
  "name": "Daehyung Park",
  "homepage": "http://www.daehyungpark.com",
  "status": "success",
  "content": "daehyungpark.comSearch this siteEmbedded FilesSkip to main contentSkip to navigationDaehyung Park (박대형)Daehyung Park is an associate professor in the School of Computing at KAIST and leading the Robust Intelligence and Robotics (RIRO) Lab. His research interests include learning- and planning-based robotic manipulation algorithms.Park has experience in a broad range of robotics in both academic and industrial areas. He received a B.S. at Osaka University (advisor: Dr. Tatsuo Arai). He received an M.S. at the University of Southern California, where he researched movement primitives (advisor: Dr. Stefan Schaal). After earning his master’s degree, he worked as a robotics researcher at the Mechatronics R&D Center of Samsung Electronics Inc. He received a Ph.D. at Georgia Institute of Technology, where he researched a multimodal execution monitor for assistive robots (advisor: Dr. Charles C. Kemp). He also worked as a postdoctoral associate in Computer Science and Artificial Intelligence Laboratory at Massachusetts Institute of Technology, working with Dr. Nicholas Roy in Robust Robotics Group.Research Interests  -  Manipulation, Reinforcement Learning, Natural Language ProcessingNewsInvited talk at the Information Intelligence Seminar, SNU, 2025.Invited talk at the University Seminar Series (GRITS), George Washington Univ, 2025.Invited talk at the International Robot Learning Symposium, 2025. (organized by SNU)I serve as the demo session chair for CoRL 2025.I serve as a committee member for K-Humanoid Alliance.I organize a workshop on Designing Interactive Humanoids:  Learning Tasks through Interaction  with Humans at Humanoids, 2024.Keynote speech at International Elite Summer Schoo in Robotics & Entrepreneurship, 2024.I serve as the program chair (PC) for RiTA 2024.Invited talk at RSS 2023 Workshop on Articulate Robots [link]Selected for IEEE ICRA Outstanding Planning paper award, 2023.I organize a workshop on Experiment-oriented Locomotion and Manipulation Research at RSS, 2023I organize a special session on Human-Agent/Robot Interaction in Healthcare and Medicine at RO-MAN, 2023My students received the RiTA Best Student Paper award, 2022.Received the Outstanding Young Researcher Award (우수신진연구자상) from ICROS, 2022. Received the  Excellence Paper Award (우수논문상) from KRoC, 2022. Selected for IEEE ICRA Outstanding Navigation paper finalist, 2022.Received the Google Research Scholar award, 2022.Our field robot paper is published from Field Robotics, 2022.MediaInterview with 기계-정보 연구정보센터, 로봇 신문, 2021Our manipulation systems are exposed on \"ROBOTICS: Teaming for Future Soldier Combat\", U.S. Army CCDC ARL, 2019\"Generation Robot\", Mouser, March, 2018IEEE spectrum's Video Friday, Sept. 4, 2017\"Robot Winter School\", irobotnews, Dec. 20, 2015Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2852,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:06"
}