{
  "name": "Daeyoung Kim 0001",
  "homepage": "http://www.resl.kaist.ac.kr",
  "status": "success",
  "content": "AI² LabSearch this siteEmbedded FilesSkip to main contentSkip to navigationWelcome to AI²Automatic Identification and Artificial Intelligence Laboratory(also Auto-ID labs)AI(IoT, Automatic Identification) Together with AI(Artificial Intelligence)2026 봄학기 학생 모집Internet of Things (Real-time & Embedded Systems, On-Device AI), Computer Vision, Generative AI, VLM 과 함께하늘을 날고, 로봇과 대화하며, 인간을 증강시킬 열정 있는 학생을 찾습니다.지도교수: 김대영 교수 (KAIST 전산학부) • 교수연구실: N1, 902 • 이메일: kimd (at) kaist.ac.kr • 전화번호: 3551최첨단 AI 기술과 IoT 융합 분야에 도전하고 싶은 석사 및 박사 과정 학생들의 많은 지원을 기다립니다.Our research topicsMachine LearningInternet of ThingsNewsWelcome to Ailee 2025 Smart & Connected Car!Ailee 2025 ushers in a new era of smart and connected cars by combining innovative technologies with outstanding engineering. Our vision is to make cities smarter and safer.City sensing and analysis technology will play a major role in understanding the city's situation in real time and taking optimal measures by collecting and analyzing various data generated in the city. This includes the development of Edge AI Accelerator for city sensing and city anomaly detection service. Mobile interactive media technologies facilitate interactions between smart & connected cars and citizens.With the power of technology, we will strive to make cities smarter based on connected car projects. We hope that our smart & connected cars will shine with the hopes and expectations of future cities.About usSince our establishment in February 2002, our Lab has been actively engaged in the study of real-time and embedded systems, Internet of Things (IoT), and Artificial Intelligence (AI). Originally known as the real-time and embedded systems Lab (RESL), we gained recognition in 2005 when we were selected as the 7th member of Auto-ID Labs (autoidlabs.org), a global organization focused on Ubiquitous Sensor Networks (USN). In 2007, we also became a National Research Lab (NRL) of Korea. In 2017, reflecting our evolving research scope, we rebranded our lab as the Data Engineering and Analytics Lab (DEAL). We have expanded our research interests to include a broader range of topics such as IoT, Machine Learning, Data Engineering, and Blockchain.At AI², we strive to stay at the forefront of technological advancements and contribute to the development of cutting-edge solutions in these areas. Our dedicated team of researchers and experts collaborates closely with industry partners and academic institutions to drive innovation and address real-world challenges. Through our research and development efforts, we aim to unlock the potential of emerging technologies, drive digital transformation, and shape the future of data-driven decision-making. We look forward to continuing our journey of exploration, discovery, and impactful contributions to the ever-evolving landscape of real-time systems, IoT, AI, and data analytics.Lab videosSupporters and CollaboratorsReport abuseReport abuse",
  "content_length": 2941,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:07"
}