{
  "name": "Dagang Li 0001",
  "homepage": "https://fie.must.edu.mo/id-1444/person/view/id-1876.html",
  "status": "success",
  "content": "創新工程學院 - 學院團隊 - 教研團隊 李大剛 副教授 所在部門： 計算機科學與工程學院 聯繫電話： 8897 3025 辦公室： A207 電子信箱： dgli@must.edu.mo Academic QualificationPh.D. in Katholieke Universiteit Leuven, BelgiumM.S. in Katholieke Universiteit Leuven, BelgiumM.E. in Nanjing University of Posts and TelecommunicationsB.E. in Huazhong University of Science and Technology Teaching AreaComputer NetworksData MiningNatural Language Processing Research AreaReinforcement LearningLarge Language ModelsGraph and Time-Series ProcessingAutonomous DrivingComputer and Communication Networks Working ExperienceSep 2020 – present, Asst Professor / Assoc Professor, SCSE-FIE, MUSTNov 2010 – Jul 2020 Lecturer / Asst Professor, SECE, PKU Shenzhen Graduate SchoolApr 2010 – Oct 2010 Post-Doc Researcher, KULeuven, BelgiumOct 2001 – Jul 2003, Research Assistant, Imec, Belgium Academic Publication (recent, selected)   Y. Zou, Z. Xu, T. Wang, G. Xiong, Z. Lin, D. Li*, Generative AI-Driven Dynamic Information Prioritization for Enhanced Autonomous Driving, IEEE Transactions on Intelligent Transportation Systems, Accepted for publication   X. Cai, D. Li, Y. Zou, Z. Liu*, A. A. Heidari, H. Chen*, Enhanced wind speed forecasting using an IAO-MNN-TCN hybrid model with optimized decomposition and prediction strategies, Energy, Accepted for publication   Z. Huang, W. Dai, Y. Zou, D. Li*, J. Cai, T.R. Gadekallu, W. Wang, Cooperative Traffic Scheduling in Transportation Network: a Knowledge Transfer Method, IEEE Transactions on Intelligent Transportation Systems, Accepted for publication   X. Cai, D. Li*, J. Zhang, Z. Wu, MA-EMD: Aligned empirical decomposition for multivariate time-series forecasting, Expert Systems with Applications, Vol. 267, 126080, Apr 2025   S. Ding, X. Wang, M. Xiong, Z. Zhang, Q. Chen, J. Zhang*, X. Wang, Z. Zhang, D. Li, S. Xu, W. Ding, Dynamic Feature and Context Enhancement Network for Faster Detection of Small Objects, Expert Systems with Applications, Vol. 265, 125732, Mar 2025   P. Wang, D. Li, X. Hu, Y. Wang, Y. Zhang, CLIPMulti: Explore the performance of multimodal enhanced CLIP for zero-shot text classification, Computer Speech & Language, Vol. 90, 101748, Mar 2025   W. Yang, Y. Bu, D. Li*, W. Xu, MCSGCalib: Multi-Constraint-based Extrinsic Calibration of Solid-State LiDAR and GNSS/INS for Autonomous Vehicles, IEEE Transactions on Intelligent Transportation Systems, Vol.25, No.11, pp.18791-18804, Nov 2024   Z. Lin, Z. Huang, S. Yang, C. Wu, S. Fang, Z. Liu, M. Yang, Z. Xie, D. Li*, Y. Zou*, Survey on Task-Centric Robot Battery Management: A Neural Network Framework, Journal of Power Sources, Vol. 610, 234674, Aug 2024.   Z. Guo, Y. Xu*, D. Li, Y. Wang, K-C Chow, R. Liu, Q. Yang, Martian Dust Devil Detection Based on Improved Faster R-CNN, IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, Vol.17, pp. 7725-7737, Feb 2024   X. Cai, D. Li*, M-EDEM: A MNN-based Empirical Decomposition Ensemble Method for Improved Time Series Forecasting, Knowledge-Based Systems, Vol. 283, 111157, Jan 2024.   Z. Lin, D. Li*, Y. Zou, Energy efficiency of lithium-ion batteries: Influential factors and long-term degradation, Journal of Energy Storage, Vol.74, Part B, 109386, Dec 2023.   Y. Zou, Z. Lin, D. Li, Z. Liu, Advancements in Artificial Neural Networks for Health Management of Energy Storage Lithium-Ion Batteries: A Comprehensive Review, Journal of Energy Storage, Vol. 73, Part C, 109069, Dec 2023.   Z. Huang, D. Li*, J. Cai, H. Lu, Collective Reinforcement Learning based Resource Allocation for Digital Twin Service in 6G Networks, Journal of Network and Computer Applications, 217C(2023) 103697, Aug 2023.   Z. Huang, W. Zhong, D. Li*, H. Lu, Delay constrained SFC Orchestration for edge intelligence-enabled IIoTs: A DRL approach, Journal of Network and Systems Management, 31, 53 (2023), June 2023.   Y. Shen, Y. Zhang, K. Yuan, D. Li, H. Zheng, A Knowledge-Enhanced Multi-View Framework for Drug-Target Interaction Prediction. IEEE Transaction on Big Data. Vol. 8, No.5, pp. 1387-1398, Oct 2022   Y. Shen, H. Li, D. Li*, J. Zheng, W. Wang, ANGraph: Attribute-Interactive Neighborhood-Aggregative Graph Representation Learning, Neural Computing & Applications, June 2022. Books  Granted Patents   China Pattent: A system and method for online separation and restoration of electronic documents (ZL201210154777.4).   China Pattent: A safety management system and method for electronic documents centralized storage and external usage (ZL201210257292.8).   China Pattent: A storage and access method for file information of separation storage system (ZL201410437750.5).   China Pattent: An file update method for networked information separation storage (ZL201410817775.8).   China Pattent: A information separation based safe data transmission system and method (ZL201510192667.0).   China Pattent: A method for networked separation storage system and file separation storage (ZL201510623068.X).   China Pattent: A file system partition conseal system and method that supports separation storage management (ZL201510624898.4).   China Pattent: A safe and reliable method for distributed cloud storage (ZL201510753361.8).   China Pattent: A method and system to imporve TCP respond speed in data centers (ZL201610225780.9).   China Pattent: A method for remote zero-copy transmission (ZL201611003952.4).   China Pattent: A method, system and medium for safe data distribution and repair in a multi-cloud storage environment (ZL201711164901.4).   China Pattent: A blockchain-based method and system for safe file sharing in cloud storage (ZL201810018768.X). Professional Certification and AwardsShenzhen Oversea High-level Talent \"Peacock Plan\", 2015. Student Awards   Third Prize, The 2022 Shenzhen Dream Catcher Cup University Students Innovation and Entrepreneurship Contest, 2022.   Bronze Prize, The 8th China International College Students' 'Internet+' Innovation and Entrepreneurship Competition, 2023.   First Prize, The 7th \"Maker Guangdong\" Next-Generation Information Technology Innovation and Entrepreneurship Contest Maker Track, 2023.   Second runner-up, 2023 Macao Youth Innovation and Entrepreneurship Competition Grand Final, 2023.   Third Prize, 2024 the 2nd “Silk Road” Intelligent Measurement Ecosystem Development Contest, 2024 Professional Society MembershipMember, Institute of Electrical and Electronics Engineers (IEEE).Member, Assiciation for Computing Machinery (ACM).Member, China Computer Federation (CCF). TOP",
  "content_length": 6501,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:12"
}