{
  "name": "Dahua Lin",
  "homepage": "http://dahualin.org",
  "status": "success",
  "content": "Dahua - Home Dahua Lin PhD. Associate Professor Department of Information Engineering The Chinese University of Hong Kong Curriculum Vitae I am an Associate Professor at the department of Information Engineering, the Chinese University of Hong Kong, and the Director of CUHK-SenseTime Joint Laboratory. I received the B.Eng. degree from the University of Science and Technology of China (USTC) in 2004, the M. Phil. degree from the Chinese University of Hong Kong (CUHK) in 2006, and the Ph.D. degree from Massachusetts Institute of Technology (MIT) in 2012. Prior to joining CUHK, I served as a Research Assistant Professor at Toyota Technological Institute at Chicago, from 2012 to 2014. My research interest covers computer vision and machine learning. In recent years, I primarily focused on deep learning and its applications on high-level visual understanding, cross-domain modeling, and big data analytics. I have published over 120 papers on top conferences and journals, e.g. CVPR, ICCV, ECCV, ICML, NeurIPS, and T-PAMI. My work on a new construction of Bayesian nonparametric models has won the best student paper award in NIPS, the most prestigious conference on machine learning, in year 2010. I also received the outstanding reviewer awards in ICCV 2009 and ICCV 2011. I supervised or co-supervised CUHK teams in international competitions and won multiple awards in ImageNet 2016, ActivityNet 2016 & 2017, COCO 2018 & 2019. I serve on the editorial board of the International Journel of Computer Vision (IJCV). I also serve as an area chair for multiple conferences, including ECCV 2018, ACM Multimedia 2018, BMVC 2018, CVPR 2019, BMVC 2019, AAAI 2020, and CVPR 2021. Besides research, I am also actively working on extending AI education to high schools. Particularly, I served as the Executive Editor and led the editing team of \"Fundamentals of Artificial Intelligence\", the first AI textbook for high school education. Research Interests Deep learning technologies in large-scale applications High level visual understanding in connection with linguistic analysis Efficient modeling and analytics of videos and movies The use of deep networks in general probabilistic inference Educations 2012 Ph.D. in Computer Science Massachusetts Institute of Technology (MIT) 2006 M.Phil. in Information Engineering The Chinese University of Hong Kong (CUHK) 2004 B.Eng. in Information Science and Electronic Engineering University of Science and Technology of China (USTC) Positions 2020 Associate Professor in Information Engineering The Chinese University of Hong Kong (CUHK) 2014 Assistant Professor in Information Engineering The Chinese University of Hong Kong (CUHK) 2012 Research Assistant Professor in Computer Science Toyota Technological Institute at Chicago (TTIC) Selected Honors & Awards 2019 COCO 2019 Supervised the CUHK team in COCO 2019, who won No.1 in the detection track (without using external data). 2018 COCO 2018 Supervised the CUHK team in COCO 2018, who won No.1 in the detection track. 2017 ActivityNet 2017 Supervised the CUHK team in ActivityNet 2017, who won No.2 in three tracks, untrimmed video classification, trimmed classification on Kinetics, and temporal action localization. 2017 ActivityNet 2016 Supervised the CUHK team in ActivityNet 2016, who won No.1 in the track of untrimmed video classification. Later in the same year, the Structured Segmental Network (SSN) gets No.1 in the track of temporal action localization. 2016 ImageNet 2016 Co-supervised the CUHK teams in ImageNet 2016, who won No.1 in two tracks, DET and VID, and No.3 in image classification. Particularly, I supervised the development of PolyNet, which achieves the best single-network performance. It remains the best-performing network until June 2017. 2010 NIPS 2010 Best Student Paper I proposed a new construction of Dirichlet processes, which fundamentally differs from previous constructions and makes it easy to build a sequence of dependent DPs. This work won the best student paper award at NIPS 2010, the most prestigious conference on machine learning. 2006 Best Master Thesis I graduated as an M.Phil. student of CUHK in year 2006. My master thesis on face recognition won the best master thesis award of the faculty of Engineering, CUHK.",
  "content_length": 4268,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:14"
}