{
  "name": "Daibo Liu",
  "homepage": "https://sites.google.com/site/dbliuuestc",
  "status": "success",
  "content": "Daibo Liu@ HNUSearch this siteEmbedded FilesSkip to main contentSkip to navigationDaibo Liu PhD, Associate Professor PhD and master supervisorSchool of Computer Science and Electronic Engineering &  Hunan Proovince Key Lab of Trusted Systems and Networking Hunan UniversityEmail: dbliu@hnu.edu.cn, dbliu.sky@gmail.comI am looking for self-motivated students at all levels (including PostDoc., Ph.D., M.S., and Undergrad) to work with me. If you are interested in our research, please feel free to contact me (dbliu at hnu.edu.cn).* Recruiting Ph.D. students and Master’s students for the Class of 2026.NewsTPC member for IEEE DySPAN 2026[2025/11], Our paper on LLM Agents for Traffic Accident Handling has been selected to be presented at ACM MobiCom 2025.[2025/10],  Our paper on User Authentication with Out-Ear Microphones in COTS Earphones was accepted to  IEEE Transactions on Mobile Computing.[2025/08],  One paper on LLM-Based Agents for Efficient Traffic Accident Handling was accepted to  ACM Transactions on Internet of Things.Invitation to serve as PC member for IEEE ICPADS 2025. [2025/07], Our paper \"Amulet: Integrating Sensitive Information Access with Identity Authentication on Mobile Devices\" was accepted to ACM IMWUT/UbiComp 2025[2025/04], One paper on Black-box Keystroke Inference Attacks to Mobile Devices was accepted to ACM IMWUT/UbiComp 2025[2024/12],  One paper was accepted to IEEE ICASSP 2025.TPC member for IEEE DySPAN 2025 [2024/10],  One paper \"Measurement Study of DNS Query Protocols in Mobile Networks\" was accepted to IEEE MSN 2024.[2024/09],  One paper on POS Terminal Passwords Eavesdropping with WiFi Beamforming Feedback was accepted to  IEEE Transactions on Mobile Computing.TPC member for IFIP NPC 2024[2024/08],  Our paper \"EM-Rhythm\" on Heterogeneous IoT Devices Authentication was accepted to ACM Transactions on Sensor Networks.[2024/08], our paper \"GPSBuster\" on Hidden GPS Tracker Detection was accepted to  ACM CCS 2024.[2024/07], one paper on EMR-based Drone Detection was conditioally accepted to  IEEE Transactions on Intelligent Transportation Systems.Invitation to serve as TPC member for IEEE ICPADS 2024. [2024/06], one paper on Video Streaming QoE Optimization was accepted to  IEEE Transactions on Mobile Computing.[2024/05],  Our paper on Energy Consumption Optimization for Mobile Video Streaminng was accepted to ACM Transactions on Sensor Networks.Invitation to serve as TPC member for IEEE MSN 2024. [2024/05],our paper \"DEyeAuth\" on User Authentication with Eyelid Patterns  was accepted to  IEEE Internet of Things Journal. [2024/05],  Our paper named \"WiShield: Privacy against Wi-Fi Human Tracking\" was accepted to IEEE Journal on Selected Areas in Communications (IEEE JSAC).[2024/04], Our work ESauron, published at USENIX Security 2024, was reported by Hunan University News (Link1 Link2 )[2024/02], our work on measurement of  Android App Crashes was accepted to  ACM Transactions on Sensor Networks. [2024/02], one paper on Passive Vibration-based Two-factor Authetication for smart locks was accepted to  IEEE Transactions on Mobile Computing.[2024/01], our work ESauron on Hidden Spy Cameras Detection was accepted to USENIX Security 2024, Congratulate to Qibo and all co-authors. More....Research InterestsLow power communication systems and edge computing, Mobile sensing, Artificial intelligence of things (AIOT) ... with applications to motion tracking, wearables, IoT, localization, drones, data analytics, acoustics, video streaming ...BiographyDaibo Liu is currently a Yuelu Associate Professor at the College of Computer Science and Electronic Engineering in Hunan University. Prior to joining Hunan University, he was a Research Associate with the Department of Electrical & Computer Engineering at the UW-Madison. He received his PhD from the Department of Computer Science and Engineering at the University of Electronic Science and Technology of China (UESTC) in July 2018. He was also a Visiting Research Fellow at the Department of Software in Tsinghua University from 2014 to 2016. He joined in Hunan University as a faculty member in Mar., 2019. He leads the Sensing & Networking Systems (SenetSys) research group. His current research interests include IoT systems and networks, edge computing, wireless and mobile computing.Selected publications   (* denotes corresponding author) (Full list)    Journal Articles [ACM TOSN] D.B Liu*, Z.C. Cao, , H.B. Jiang, S.W. Zhou, Z. Xiao, F.Z. Zeng, Concurrent Low Power Listening: A New Design Paradigm for Duty-Cycling Communication,  ACM Transactions on Sensor Networks,  [IEEE TMC] H. Cao, D.B. Liu*, H. Jiang, C. Cai, J. Lui, and J. Luo, HandKey: Knocking-triggered Robust Vibration Signature for Keyless Unlocking. IEEE Transactions on Mobile Computing.  [IEEE TMC] H. Cao, D.B. Liu*, et al, MagSign: Harnessing Dynamic Magnetism for User Authentication on IoT Devices. IEEE Transactions on Mobile Computing.  [ACM TMC] D.B. Liu, H. Lu, X.M. Qi, H.G. Rong, H.W. Chen, H.B. Jiang, Decoding Air Friction Rhythms: Enabling User Identification with Out-Ear Microphones in COTS Earphones., IEEE Transactions on Mobile Computing.[IEEE/ACM TON] Z.C. Cao, J.L. Wang,  D.B. Liu,  Q. Ma, X. Miao, X.F. Mao. Chase++: Fountain-Enabled Fast Flooding in Asynchronous Duty Cycle Networks, IEEE/ACM Transactions on Networking, 29(1): 410-422 (2021).  [PDF] [BibTex]  [ACM TOSN] D.B. Liu, Z.C. Cao, M.S. Hou, H.G. Rong, H.B. Jiang, Pushing the Limits of Transmission Concurrency for Low Power Wireless Networks, ACM Transactions on Sensor Networks, 16(4): 40:1-40:29 (2020).     [PDF] [BibTex] [ACM TOSN] D.B. Liu, Z.C. Cao, Y. He, X.Y. Ji, M.S. Hou, Exploiting Concurrency for Opportunistic Forwarding in Duty-cycled IoT Networks,  ACM Transactions on Sensor Networks, 15(3): 31:1-31:33 (2019).     [PDF] [BibTex]  [IEEE/ACM TON] Z.C. Cao, D.B. Liu*, J.L. Wang, X.L. Zheng, Chase: Taming Concurrent Broadcast for Flooding in Asynchronous Duty Cycle Networks,  IEEE/ACM Transactions on Networking, 25(5): 2872-2885 (2017).    [PDF] [BibTex] [IEEE/ACM TON] D.B. Liu, Z.C. Cao, Y. Zhang, M.S. Hou. Achieving Accurate and Real-Time Link Estimation in Low Power Wireless Sensor Networks,  IEEE/ACM Transactions on Networking, 16(3): 787-800 (2017).   [PDF] [BibTex] [IEEE/ACM TON] D.B. Liu, M.S. Hou, Z.C. Cao, J.L. Wang, Y. He, Y.H. Liu. Duplicate Detectable Opportunistic Forwarding in Duty-Cycled Wireless Sensor Networks, IEEE/ACM Transactions on Networking, 24(2): 662-673 (2016).      [PDF] [BibTex] More...    Conference Papers[ACM IMWUT/UbiComp'25] Daibo Liu, Y.P. Feng, B.X. Liu, T.Y. Zhang, H.W. Chen, M.J. Cai. Amulet: Integrating Sensitive Information Access with Identity Authentication on Mobile Devices. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol (ACM IMWUT/UbiComp). 9(3): 112:1-112:29 (2025).   [ACM IMWUT/UbiComp'25] Y.P. Feng, Daibo Liu*, W.Q. Jin, L.Y. Gong. KeyPrint:Practical Black-box Keystroke Inference Attacks to Mobile Devices. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol (ACM IMWUT/UbiComp). 9(2): 39:1-39:31 (2025).    [USENIX Security'24] Q.B. Zhang, Daibo Liu*, X.Y. Zhanng, Z.C. Cao, F.Z. Zeng, H.B. Jiang, W.Q. Jin. Eye of Sauron: Long-Range Hidden Spy Camera Detection and Positioning with Inbuilt Memory EM Radiation. Proceedings of The 33rd USENIX Security Symposium (USENIX Security), Philadelphia, PA, USA, August 2024.  [ACM CCS'24] Y. Li, W.Q. Jin, Z.Y. Ning, Daibo Liu, Z.X. Yan, Z. Qin, Y. Liu, H.D. Zhu , M. Li. GPSBuster: Busting out Hidden GPS Trackers via MSoC Electromagnetic Radiations. Proceedings of ACM Conference on Computer and Communications Security  (ACM CCS), 2024. [INFOCOM'24] S. Chen, H. Jiang, J. Hu, Z. Xiao, and Daibo Liu*. Silent Thief: Password Eavesdropping Leveraging Wi-Fi Beamforming Feedback from POS Terminal. In Proceedings of Annual IEEE Conference on Computer Communications (INFOCOM), Vancouver, Canada, 20--23 May 2024.[NDSS'24] H.L. Chen,W.Q. Jin，Y.P. Hu, Z.Y. Ning, K.L. Li, Z. Qin, M.X. Duan, Y. Xie, Daibo Liu, M. Li. Eavesdropping on Black-box Mobile Devices via Audio Amplifier's EMR, Proceedings of The Network and Distributed System Security Symposium (NDSS), San Diego, CA, February, 2024[ACM IMWUT/Ubicomp'22] W.G. Su, Daibo Liu*, T.Y. Zhang, H.B. Jiang, Towards Device Independent Eavesdropping on Telephone Conversations with Built-in Accelerometer, Accepted to ACM  IMWUT/Ubicomp 2022.  [ACM IMWUT/Ubicomp'21] J.Y. Hu, H.B. Jiang, Daibo Liu*, J. Xiong, DriverSonar: Fine-Grained Dangerous Driving Detection Using Active Sonar, Accepted to ACM  IMWUT/Ubicomp 2021.      [PDF] [BibTex] [Slides][ACM IMWUT/Ubicomp'20] H.B. Jiang, H.C. Cao, Daibo Liu*, J. Xiong, Z.C. Cao, SmileAuth: Using Dental Edge Biometrics for User Authentication on Smartphones, ACM  IMWUT/Ubicomp 2020.   [PDF] [BibTex] [Slides]   CACM NewsMore...Professional ActivitiesJournal Reviewer IEEE Transactions on Mobile Computing (TMC)IEEE/ACM Transactions on Networking (TON)ACM Transactions on Sensor Network (TOSN)IEEE Transactions on Vehicular Technology (TVT)IEEE Transactions on Industrial Informatics (TII)Ad Hoc Sensor & Wireless NetworksIEEE Internet of Things Journal (IOT-J) ACM Transactions on Cyber-Physical Systems (TCPS)ACM Computing SurveysEURASIP Journal on Wireless Communications and NetworkingInternational Journal of Distributed Sensor Networks (IJDSN)Future Generation Computer SystemsPublicity ChairEAI ICECI 2020Technical Programme Committee CloudNet 2014ACCSE 2017, 2018IEEE DySpan 2019, 2024IEEE ICDCS 2021, 2022, 2023ACM CHI 2021ACM IMWUT 2022ICPADS 2022, 2023MSN 2023GrantsPI, Research on Key Technologies for Detecting Covert Devices in Physical Spaces for User Privacy Security, NSFC Grant No. 62572183.PI, Key Technology Research on Interaction-Driven Finger Vibrations for Cross-Devices User Authentication, NSFC Grant No. 62372166.PI, Towards the Research on Key Technologies of Concurrent Media Access without Scheduling in Low Power Wireless Networks, NSFC Grant No. 61902122",
  "content_length": 10818,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:13"
}