{
  "name": "Dakuo Wang",
  "homepage": "https://dakuowang.com",
  "status": "success",
  "content": "Dakuo WangSearchDakuo WangAssociate ProfessorNortheastern UniversityAbout MeDakuo Wang is an Associate Professor at Northeastern University, jointly appointed at Khoury College of Computer Sciences and the College of Arts, Media and Design. He leads the Northeastern University Human-Centered AI Lab (NEU HAI), and is also the Founding Director of the AI Application Graduate Program. Dakuo is also a Visiting Scholar at Stanford University. His research lies at the intersection of human-computer interaction (HCI) and artificial intelligence (AI), with a focus on the exploration, development, and evaluation of human-centered AI (HCAI) systems. The overarching goal is to democratize AI for every person and every organization, so that they can access their own AI and collaborate with these real-world AI systems (human-AI collaboration).Before joining Northeastern, Dakuo was a Senior Staff Member at IBM Research, Principal Investigator at MIT-IBM Watson AI Lab, and a Visiting Scholar at Stanford Institute for Human-Centered Artificial Intelligence. He got his Ph.D. from the University of California Irvine (advisor: Judith Olson and Gary Olson). He has worked as a designer, researcher, and engineer in the U.S., China, and France. He serves in organizing committees, program committees, and editorial boards for a variety of venues, and ACM has recognized him as an ACM Distinguished Speaker.I am falling behind in updating my own publications; Google Scholar does a better job than I do.InterestsHuman Computer InteractionHuman-AI CollaborationNatural Language ProcessingHealth InformaticsData ScienceComputer-Supported Cooperative WorkEducationPhD in Information and Computer SciencesUniversity of California IrvineMS in Electrical and Computer EngineeringUniversity of California IrvineMS in Information SystemÉcole centrale d’électronique, ParisBS in Computer ScienceBeijing University of TechnologyPublicationsChao Yin, Shiyang Fu, Bingsheng Yao, Tuan H. Pham, Wei Cao, Dakuo Wang, Ping Zhang (2025). SepsisCalc: Integrating Clinical Calculators into Early Sepsis Prediction via Dynamic Temporal Graph Connection. Proceedings of the ACM Conference.CiteAmama Mahmood, Jingyi Wang, Bingsheng Yao, Dakuo Wang, Chien-Ming Huang (2025). User Interaction Patterns and Breakdowns in Conversing with LLM-Powered Voice Assistants. International Journal of Human-Computer Studies.PDF CiteZhiping Zhang, Chenxinran Chen, Bingsheng Yao, Dakuo Wang, Tianshi Li (2025). Secret Use of Large Language Model (LLM). Proceedings of the ACM on Computer-Supported Cooperative Work and Social Computing (CSCW).PDF CiteZiqi Yang, Xuhai Xu, Bingsheng Yao, Ethan Rogers, Shao Zhang, Stephen Intille, Nawar Shara, Guodong (Gordon) Gao, Dakuo Wang (2024). Talk2Care: An LLM-based Voice Assistant for Communication between Healthcare Providers and Older Adults. In Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies.PDF CiteZhiping Zhang, Ding Wang, Dakuo Wang (2024). Toward Feature Engineering with Human and AI's Knowledge: Understanding Data Workers' Perceptions in Human & AI-Assisted Feature Engineering Design. Proceedings of the ACM/IEEE International Conference on Human-Robot Interaction (HRI).CiteSee all publications Cite ×Copy Download",
  "content_length": 3269,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:17"
}