{
  "name": "Dalal Alrajeh",
  "homepage": "https://www.doc.ic.ac.uk/~da04",
  "status": "success",
  "content": "Dalal Alrajeh Contact dalal.alrajeh@ic.ac.uk Department of Computing, Imperial College London, 180 Queen's Gate, London SW7 2AZ. Dalal Alrajeh About Research Publications Teaching Service CV I am a Reader (associate professor) at the Department of Computing, Imperial College London, and currently serve as the department's Director of Postgraguate Research. My research is in the general area of formal methods for designing provably correct software systems, with particular focus on the generation, analysis and implementation of formal specifications for safe AI-enabled systems. Application domains include AI-enabled systems for tackling cyber-enabled crime. You can read about some of my work on crime linkage here. Please see my research page for further details, or my publications. My cv (pdf). I am currently looking for motivated and strong PhD students with an interest and background in formal methods, software engineering and artificial intelligence. Several scholarships are available for prospective PhD students including Safe and Trusted AI CDT scholarships. Please see my teaching page for more information. I welcome enquiries from those wishing to apply for a PhD under my supervision. I also regularly have research posts available. Please keep an eye on vacancies here , or get in touch by email. News I'm the ICSE 2025 Workshop co-chair. Looking forward to an exciting line-up of workshops. I'm on the programme committee of ICSE 2025, OOPSLA 2025, RE@Next! 2025, FSE 2025. Research paper accepted at ICSE 2025: “Unavoidable Boundary Conditions: A Control Perspective on Goal Conflicts ”. Learn about how AI can aid law enforcement fight crime on BBC one's frontline fight back. (A clip from the show can be found here.) Read about our new initiative Emergent Things at Imperial-X.",
  "content_length": 1807,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:16"
}