{
  "name": "Dalia Malki",
  "homepage": "https://cs.ucsb.edu/people/faculty/dahlia-malkhi",
  "status": "success",
  "content": "Dahlia Malkhi | UCSB Computer Science Dahlia Malkhi Professor dahliamalkhi@ucsb.edu 5165 Harold Frank Hall Personal homepage Education Ph.D. The Hebrew University of Jerusalem External Publications Google Scholar Awards IEEE TCDP Outstanding Technical Achievement Award, 2021. Vice-chair, ACM Charles P. \"Chuck\" Thacker Breakthrough in Computing Award, 2020-present. Advisory board member of Cryptoeconomic Systems, 2019-present. Co-chair of the Simons Institute Advisory Board, 2019-2022. ACM fellow, 2011. Associate editor of the Distributed Computing Journal, 2002-2018. Associate editor of IEEE Transactions on Dependable and Secure Computing (TDSC), 2014-2016. IBM Faculty award recipient, 2003 and 2004. German-Israeli Foundation (G.I.F.) Young Scientist career award, 2002. Program chair for Usenix ATC 2019, LADIS 2012, Locality 2007, PODC 2006, Locality 2005, and DISC 2002. Research Areas Operating Systems and Distributed Systems Security and Cryptography Bio Dahlia Malkhi is a Professor in the Department of Computer Science of UCSB since 2024. She heads the Foundations of Financial Technology lab. Her research over two decades spans broad aspects of reliability and security of distributed systems, recently with focus on blockchains and advances in financial technology. Her work resulted in over 200 publications as well as a strong impact on computing technology. Malkhi is sought-after industrial consultant, currently advising various projects, including Space Computer, Lyquor Labs, Nubit|Bitcoin Thunderbolt, Espresso Systems, and Chainlink Labs. Formerly, she served as Distinguished Scientist of Chainlink Labs (2022-2025). From 2019 to 2022, she was the CTO at the Diem Association, and Lead Researcher at Novi Financial. In 2014, she co-founded VMware Research and became a Principal Researcher at VMware until 2019. Prior to that, Malkhi was a partner principal researcher at Microsoft Research, 2004-2014; an Associate Professor of the Hebrew University of Jerusalem, and a senior researcher at AT&T Labs. Research I enjoy working on questions that emerge from the engineering of real systems. I spent the past two decades working on bringing scientific innovation into fruition in several leading industrial settings. Below is a sampler of technologies I participated in creating. My personal homepage provides more detailed stories. Co-inventor of HotStuff, the golden standard for blockchain design, driving the Diem blockchain core engine, the Espresso Systems HotShot Sequencer, the Aptos blockchain core engine, and many other blockchains . Co-inventor of Flexible Paxos, the technology behind Log Device. Creator of CorfuDB, a database-less database driving VMware’s NSX-T distributed control plane. Co-lead of the FairPlay project, the pioneering materialization of secure multi-party computation.",
  "content_length": 2834,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:17"
}