{
  "name": "Daljit Singh J. Dhillon",
  "homepage": "https://djsingh.people.clemson.edu",
  "status": "success",
  "content": "Clemson University Personal Web Space for Dr. Daljit Singh Dhillon Dr. Daljit Singh Dhillon Assistant Professor, Visual Computing School of Computing 303 McAdams Hall Email-id: djsingh AT clemson DOT edu Google Scholar Homepage ResearchGate Homepage Research Interests Computer graphics, realistic appearances, bio-physical modeling and simulation, surface geometries, fabrication Students interested in undertaking research work in these areas are welcome to contact Dr. Dhillon Short Bio Dr. Daljit Singh Dhillon in an assistant professor with the division for Visual Computing at Clemson University, since Jan 2019. Previously, he was a research associate at Realistic Graphics and Imaging Group, Imperial College London (ICL), UK from 2017 - 2018. His primary research interest lies in modeling material appearances and surface geometric phenomena. He has a keen interest in inter-disciplinary research involving visual computing, especially in material fabrication. His association with ICL began as a visiting researcher (2016 - 2017) on a Swiss National Science Foundation (SNSF) fellowship for a post-doc position. He obtained his PhD in Computer Science from University of Bern, Switzerland (2011-2015). His PhD thesis ‘On Modeling and Simulating Reptile Skin Coloration’ was an inter-disciplinary research work in collaboration with biologists and physicists at University of Geneva, Switzerland. Dr. Dhillon obtained his M.Sc. (Engg.) degree with a research thesis on structured-light 3D scanning systems, from Indian Institute of Science (2007-2010) and a bachelor degree in computer engineering from University of Mumbai (1995-1999). Apart from an academic research background in computer graphics and vision, he has eight years of industrial experience in software development (1999-2007), including research in video encoders and speaker verification using Hidden Markov Models. Teaching Fall 2021, 2020, 2019: DPA8090 Rendering and Shading Spring 2021: CPSC8050 Advanced Graphics Spring 2020: CPSC4050/6050 Computer Graphics Fall 2019: CPSC8810/CPSC9500 Selected Topics/Seminar: Surface Geometry Processing News Apr 2022: Will serve as a Juror for SIGGRAPH Posters '22 Apr 2022: Will serve on the PCs for EGSR'22 and ISVC'22 Aug 2021: Will serve on PC for ISVC'21 and CVMP'21 Aug 2020: We got NSF-Small project funding ($477K) for collaborative research on Developing and Validating a Physically Accurate Light-Scattering Model for the Rendering of Bird and Other Dinosaur Feathers. Team so-far: Prof. Patterson (PI), Dr. Smith (co-PI), me (co-PI) and Jessica Baron (Fullbright Scholar and CU PhD Candidate) NSF link Publications Peer-reviewed Journals Practical Measurement and Reconstruction of Spectral Skin Reflectance Gitlina, Y., Guarnera, G. C., Dhillon, D. S., Hansen, J., Lattas, A., Pai, D., and Ghosh, A. (2020), in Computer Graphics Forum (Vol. 39, No. 4, pp. 75-89), orally presented at EGSR 2020, London (online due to COVID) DOI: https://doi.org/10.1111/cgf.14055 We present two practical methods for measurement of spectral skin reflectance suited for live subjects, and drive a spectral BSSRDF model with appropriate complexity to match skin appearance in photographs, including human faces. Our primary measurement method employs illuminating a subject with two complementary uniform spectral illumination conditions using a multispectral LED sphere to estimate spatially varying parameters of chromophore concentrations including melanin and hemoglobin concentration, melanin blend‐type fraction, and epidermal hemoglobin fraction. We demonstrate that our proposed complementary measurements enable higher‐quality estimate of chromophores than those obtained using standard broadband illumination, while being suitable for integration with multiview facial capture using regular color cameras. Besides novel optimal measurements under controlled illumination, we also demonstrate how to adapt practical skin patch measurements using a hand‐held dermatological skin measurement device, a Miravex Antera 3D camera, for skin appearance reconstruction and rendering. Furthermore, we introduce a novel approach for parameter estimation given the measurements using neural networks which is significantly faster than a lookup table search and avoids parameter quantization. We demonstrate high quality matches of skin appearance with photographs for a variety of skin types with our proposed practical measurement procedures, including photorealistic spectral reproduction and renderings of facial appearance. Acquiring Spatially-varying Appearance of Printed Holographic Surfaces Toisoul, A.* , Dhillon, D.S.J.*, and Ghosh, A. (2018), in ACM Trans. on Graphics (Proc. SIGGRAPH ASIA) 37, 6, Article 272, 16 pages. DOI: https://doi.org/10.1145/3272127.3275077, * joint first authors We present two novel and complimentary approaches to measure diffraction effects in commonly found planar spatially varying holographic surfaces. Such surfaces are increasingly found in various decorative materials such as gift bags, holographic papers, clothing and security holograms, and produce impressive visual effects that have not been previously acquired for realistic rendering. Such holographic surfaces are usually manufactured with one dimensional diffraction gratings that are varying in periodicity and orientation over an entire sample in order to produce a wide range of diffraction effects such as gradients and kinematic (rotational) effects. Our proposed methods estimate these two parameters and allow an accurate reproduction of these effects in real-time. The first method simply uses a point light source to recover both the grating periodicity and orientation in the case of regular and stochastic textures. Under the assumption that the sample is made of the same repeated diffractive tile, good results can be obtained using just one to five photographs on a wide range of samples. The second method is based on polarization imaging and enables an independent high resolution measurement of the grating orientation and relative periodicity at each surface point. The method requires a minimum of four photographs for accurate results, does not assume repetition of an exemplar tile, and can even reveal minor fabrication defects. We present point light source renderings with both approaches that qualitatively match photographs, as well as real-time renderings under complex environmental illumination. Bifurcation Analysis of Reaction Diffusion Systems on Arbitrary Surfaces Dhillon, D.S., Milinkovitch, M.C., and Zwicker, M. (2017), in Bulletin of Mathematical Biology, 79: 788–827 DOI: https://dx.doi.org/10.1007/s11538-017-0255-8 In this paper, we present computational techniques to investigate the effect of surface geometry on biological pattern formation. In particular, we study twocomponent, nonlinear reaction–diffusion (RD) systems on arbitrary surfaces. We build on standard techniques for linear and nonlinear analysis of RD systems and extend them to operate on large-scale meshes for arbitrary surfaces. In particular, we use spectral techniques for a linear stability analysis to characterise and directly compose patterns emerging from homogeneities. We develop an implementation using surface finite element methods and a numerical eigenanalysis of the Laplace–Beltrami operator on surface meshes. In addition, we describe a technique to explore solutions of the nonlinear RD equations using numerical continuation. Here, we present a multiresolution approach that allows us to trace solution branches of the nonlinear equations efficiently even for large-scale meshes. Finally, we demonstrate the working of our framework for two RD systems with applications in biological pattern formation: a Brusselator model that has been used to model pattern development on growing plant tips, and a chemotactic model for the formation of skin pigmentation patterns. While these models have been used previously on simple geometries, our framework allows us to study the impact of arbitrary geometries on emerging patterns. Interactive Diffraction from Biological Nanostructures Dhillon, D.S., Teyssier, J., Single, M., Gaponenko, I., Milinkovitch, M.C., and Zwicker, M. (2014), in Computer Graphics Forum (Vol. 33, No. 8, pp. 177-188), orally presented at Eurographics 2015, Zurich DOI: http://dx.doi.org/10.1111/cgf.12425 We describe a technique for interactive rendering of diffraction effects produced by biological nanostructures, such as snake skin surface gratings. Our approach uses imagery from atomic force microscopy that accurately captures the geometry of the nanostructures responsible for structural colouration, that is, colouration due to wave interference, in a variety of animals. We develop a rendering technique that constructs bidirectional reflection distribution functions (BRDFs) directly from the measured data and leverages pre-computation to achieve interactive performance. We demonstrate results of our approach using various shapes of the surface grating nanostructures. Finally, we evaluate the accuracy of our pre-computation-based technique and compare to a reference BRDF construction technique. Geometric and Radiometric Estimation in a Structured-light 3D Scanner Dhillon, D.S., and Govindu, V.M. (2015), in Machine Vision and Applications, 26(2-3), 339-352 DOI: http://dx.doi.org/10.1007/s00138-015-0667-0 The key problems in a structured-light 3D scanner using a projector and camera are its geometric and radiometric calibration. A projector can be effectively represented using the familiar pin-hole model for cameras. However, since we cannot directly observe the projector plane, it cannot be calibrated like a camera. The first contribution of our paper is to develop a geometric calibration and 3D estimation method that utilises the projective geometric relationships available in a projector–camera pair, i.e., homography induced by a plane and invariance of cross-ratios. The low-dimensional parametric f",
  "content_length": 13699,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:19"
}