{
  "name": "Dalton Meitei Thounaojam",
  "homepage": "http://cs.nits.ac.in/dalton",
  "status": "success",
  "content": "About the Department EST. 1977 About Us The undergraduate program in Computer Science and Engineering started with the admission of its first batch of B.E. students in the year 1987. It was then under the Department of Electrical Engineering from which it along with the undergraduate program in Electronics and Communication Engineering got separated under the Department of Electronics and Communication Engineering in the year 2000. From the year 2000 till 2008 the department was under the Department of Electronics and Communication Engineering. In the year 2008 the Department of Computer Science and Engineering became an independent department. The department offers B. Tech., M. Tech. and Ph. D. programmes. With sound Vision and Mission, this department provides a platform for nurturing Engineers and researchers to lead the country in particular and the entire World in general. The department is well-equipped with ultra-modern facilities for research. To name a few the department has Blade Server (IBM 7 blades), Thermal Cameras, Workstations, latest configured Desktop PCs, etc. Furthermore, the department has procured dozens of software, namely, IBM Rational Rose, QUALNET, Red-hat linux, Windows, Matlab, etc. The faculties and the students of the department work in tandem to create a unique identity in the country. 429 Journals 29 Projects 28 Patents 469 Conference 0 JRFs 0 UG Students 0 PG Students 0 PhD Students Our Vision To develop high quality human and knowledge resources in the areas of Computer Science and Engineering in order to cater to local, national, global economic and social demands. The mission of the department is To train and transform young minds into responsible thinking engineers, technologists and scientists. To motivate them to attain professional excellence To inspire them to engage themselves for the betterment of the society with the use and applications of the latest tools and technology. Our Mission Important Notice Faculty Advisors for the Academic Session 2025-2026 Click here to know the details about the Minor Degree Course offered by Department of Computer Science and Engineering Academics & Program Undergraduate The B.Tech Programme consists of 8 semesters and is a professional engineering degree affiliated with and awarded after completion of 4-years of extensive/vast engineering study and research. Computer science and engineering students will learn about basic engineering techniques, as other engineering students, during first year course, which includes Engineering Mathematics, Physics , Chemistry, Electrical Engineering, Electronics Engineering , Engineering Mechanics , Mechanical Activities( Welding, Fitting , Carpentry ,etc.) , Engineering drawing and Basic Programming. From second year they are exposed to core computer science subjects like Data Structures, Applied Graph Theory , Computer Organization and Architecture , Computer Graphics , Microprocessors and Peripherals , Operating Systems , Software Engineering , Compiler Design are few to mention. This programme is one of the most popular and demanded course , not only in India but in the world. B.Tech. in Computer Science and Engineering Minor Degree in Computer Science and Engineering DOCTOR OF PHILOSOPHY The Ph.D. programme is a post-graduate programme focussed on original research, that can lead to publications in premier conferences or journals. It is the highest level of degree that a student can achieve. Students are required to do some courses in the first few semesters (course work required can vary based on student background), but soon move on completely to research. Many Ph.D scholars teaches B.tech students also and many labs are run by them. After completing the programme the scholar is capable of understanding significant particulars of computer system. Ph.D. in Computer Science and Engineering Postgraduate The department is offering three Postgraduate Programmes M.Tech in Computer Science and Engineering M.Tech in Artificial Intelligence M.Tech in Data Science and Engineering The M.Tech programme in Computer Science and Engineering/Artificial Intelligence/Data Science and Engineering provide advanced knowledge in various areas of computer science. The programme is designed such that a student can complete it based on advanced coursework alone. However, the students are given the option to concentrate on a problem by substituting some of the courses with equivalent project work. The standard M. Tech. is a two year programme, where the first two semesters are spent doing courses. A one-year project commences in end of the 2nd semester . The project typically has a strong research component. M.Tech in Computer Science and Engineering Faculty Advisors UG 1st Year Dr. Shyamoshree Pal Dr. Parikshit Saikia Dr. Anupam Biswas UG 2nd Year Dr. Malaya Dutta Borah Mr. Umakanta Majhi Dr. Ripon Patgiri UG 3rd Year Dr. Debbrota Paul choudhury Dr. Aparajita Dutta Dr. Pantha Kanti Nath UG 4th Year Dr. Chukhu Chukha Dr. Laiphrakpam Dolendro Singh Dr. Ramanujam E PG 1st Year Dr. Suganya Devi PG 2nd Year Dr. Badal Soni Sponsored Projects View All Secure and Intelligent Platform to Combat Fraudulent Payment Mechanisms and Prank Applications in Financial Transactions Sponsored by Treatment of Class Imbalance Problem at Data Level Sponsored by NPIU (World Bank) Analysis of Brain Waves and development of intelligent model for Silent Speech Recognition. Sponsored by MeitY, Govt. of India Faculty Members Find More Professor Dr. Pinki Roy Associate Professor Dr. Samir Kumar Borgohain Associate Professor Dr. Saroj Kr. Biswas Associate Professor Dr. Ujwala Baruah Associate Professor Dr. Suganya Devi K Associate Professor Dr. Partha Pakray Associate Professor Dr. Arup Bhattacharjee Assistant Professor, Grade-I Mr. Prabhakar Sharma Neog Assistant Professor, Grade-II Mr. Biswanath Dey Assistant Professor Dr. Pantha Kanti Nath Assistant Professor Dr. Dalton Meitei Thounaojam Assistant Professor (on lien) Dr. Badal Soni Assistant Professor Dr. Ripon Patgiri Assistant Professor Mr. Umakanta Majhi Assistant Professor Dr. Shyamosree Pal Assistant Professor, Grade-I Dr. Laiphrakpam Dolendro Singh Assistant Professor, Grade-I Dr. Malaya Dutta Borah Assistant Professor, Grade-I Dr. Anish Kumar Saha Assistant Professor, Grade-I Dr. Thoudam Doren Singh Assistant Professor, Grade-I (on lien) Dr. Anupam Biswas Assistant Professor Grade-I Dr. Naresh Babu Muppalaneni Assistant Professor (on lien) Dr. Parikshit Saikia Assistant Professor, Grade-II Dr. Ramanujam E Assistant Professor – Grade II Dr. Chukhu Chunka Assistant Professor, Grade-II Dr. Debbrota Paul Chowdhury Assistant Professor, Grade-II Dr. Aparajita Dutta Assistant Professor, Grade-II Head of the Department The department offers B. Tech., M. Tech. and Ph. D. programmes. With sound Vision and Mission, this department provides a platform for nurturing Engineers and researchers to lead the country in particular and the entire World in general. The department is well-equipped with ultra-modern facilities for research. To name a few the department has Blade Server (IBM 7 blades), Thermal Cameras, Workstations, latest configured Desktop PCs, etc. Furthermore, the department has procured dozens of software, namely, IBM Rational Rose, QUALNET, Red-hat linux, Windows, Matlab, etc. The faculties and the students of the department work in tandem to create a unique identity in the country. Dr. Samir Kumar Borgohain HoD, Department of Computer Science & Engineering Email: hod@cse.nits.ac.in News and Updates View All 01/08/2025 ICICSA-2025: 3rd International Conference on Intelligent Computing Systems and Applications Organized by Department of Computer Science & Engineering National Institute of Technology, Silchar September 5-6, 2025",
  "content_length": 7794,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:19"
}