{
  "name": "Damien Stehlé",
  "homepage": "http://perso.ens-lyon.fr/damien.stehle",
  "status": "success",
  "content": "Damien Stehle's Homepage Damien Stehlé Professor, École Normale Supérieure de Lyon Member of the Institut Universitaire de France Member of the AriC team, within the LIP laboratory [CNRS, ENSL, INRIA, UCBL, U. Lyon] Crypto in AriC Teaching Students Talks Contact My main interests are in cryptography, computational number theory and computer algebra. My research focuses on the computational aspects of Euclidean lattices and their applications in cryptography. One of the attractive properties of lattice problems is their conjectured quantum intractability: this makes lattice-based cryptography a viable option for post-quantum cryptography (which should not be confused with the less mature field of quantum cryptography -- see the strong warnings from the NSCS and the ANSSI concerning the use of quantum key distribution). See here for a gentle introduction to post-quantum cryptography with a lattice focus, and here for the main post-quantum crypto standardization effort. UPCOMING EVENT(S): Eurocrypt, Lyon, France. Ecole CIMPA - Aspects mathématiques de la cryptographie post-quantique, Rabat, Marocco. RECENT PROGRAM COMMITTEES: ASIACRYPT'22 17 16 15 13, PQCRYPTO'22 21 20 19 18 17 16 14 13 11 10, CRYPTO'19, EUROCRYPT'18 17, SCN'18 16, ANTS'16, PKC'16 15, I'm also a member of the editorial boards of Journal of Cryptology and Designs, Codes and Cryptography. Publications On module unique-SVP and NTRU, with Joël Felderhoff and Alice Pellet--Mary. ASIACRYPT 2022. On rejection sampling in Lyubashevsky's signature scheme, with Julien Devevey, Omar Fawzi and Alain Passelègue. ASIACRYPT 2022. Practical, round-optimal lattice-based blind signatures, with Shweta Agrawal, Elena Kirshanova and Anshu Yadav. CCS 2022. Round-optimal lattice-based threshold signatures, revisited, with Shweta Agrawal and Anshu Yadav. ICALP 2022. On the hardness of the NTRU problem, with Alice Pellet--Mary. ASIACRYPT 2021. Best paper award. Non-applicability of the Gaborit&Aguilar-Melchor patent to Kyber and Saber, with Vadim Lyubashevsky. See also a related discussion on the pqc-forum. The article was referred to in Le Monde and La Recherche. An Anonymous Trace-and-Revoke Broadcast Encryption Scheme, with Olivier Blazy, Sayantan Mukherjee, Huyen Nguyen, Duong Hieu Phan. ACISP 2021. On the Integer Polynomial Learning with Errors Problem, with Julien Devevey, Amin Sakzad, Ron Steinfeld. PKC 2021. Faster Enumeration-based Lattice Reduction: Root Hermite Factor k^(1/(2k)) in Time k^(k/8 + o(k)), with Martin R. Albrecht, Shi Bai, Pierre-Alain Fouque, Paul Kirchner and Weiqiang Wen. CRYPTO 2020. Measure-rewind-measure: tighter quantum random oracle model proofs for one-way to hiding lemma and CCA security, with Veronika Kuchta, Amin Sakzad, Ron Steinfeld and Shifeng Sun. EUROCRYPT 2020. MPSign: A signature from small-secret middle-product learning with errors, with Shi Bai, Dipayan Das, Ryo Hiromasa, Miruna Rosca, Amin Sakzad, Ron Steinfeld and Zhenfei Zhang. PKC 2020. ModFalcon: compact signatures based on module NTRU lattices, with Chitchanok Chuengsatiansup, Thomas Prest, Alexandre Wallet and Keita Xagawa. AsiaCCS 2020. On the smoothing parameter and last minimum of random orthogonal lattices, with Elena Kirshanova, Huyen Nguyen and Alexandre Wallet. In Designs, Codes and Crypto, 2020. An LLL Algorithm for Module Lattices, with Changmin Lee, Alice Pellet-Mary and Alexandre Wallet. ASIACRYPT 2019. Towards practical GGM-based PRF from (Module-)Learning-with-Rounding, with Chitchanok Chuengsatiansup. SAC 2019. Approx-SVP in Ideal Lattices with Pre-processing, with Alice Pellet-Mary and Guillaume Hanrot. EUROCRYPT 2019. Adaptively Secure Distributed PRFs from LWE, with Benoît Libert and Radu Titiu. TCC 2018. Measuring, simulating and exploiting the head concavity phenomenon in BKZ, with Shi Bai and Weiqiang Wen. ASIACRYPT 2018. Computing an LLL-reduced basis of the orthogonal lattice, with Jingwei Chen and Gilles Villard. ISSAC 2018. On the Ring-LWE and Polynomial-LWE problems, with Miruna Rosca and Alexandre Wallet. EUROCRYPT 2018. Learning With Errors and Extrapolated Dihedral Cosets, with Zvika Brakerski, Elena Kirshanova and Weiqiang Wen. PKC 2018. CRYSTALS -- Dilithium: Digital Signatures from Module Lattices, with Léo Ducas, Tancrède Lepoint, Vadim Lyubashevsky, Peter Schwabe and Gregor Seiler. CHES 2018. CRYSTALS -- Kyber: a CCA-secure module-lattice-based KEM, with Joppe Bos, Léo Ducas, Eike Kiltz, Tancrède Lepoint, Vadim Lyubashevsky, John M. Schanck and Peter Schwabe. Euro S&P 2018. Efficient Public Trace and Revoke from Standard Assumptions, with Shweta Agrawal, Sanjay Bhattacherjee, Duong Hieu Phan and Shota Yamada. CCS 2017. Middle-Product Learning With Errors, with Miruna Roșca, Amin Sakzad and Ron Steinfeld. CRYPTO 2017. All-But-Many Lossy Trapdoor Functions and Selective Opening Chosen-Ciphertext Security from LWE, with Benoît Libert, Amin Sakzad and Ron Steinfeld. CRYPTO 2017. Tuple lattice sieving, with Shi Bai and Thijs Laarhoven. ANTS'16. LMS Journal of Computations and Mathematics, 2016. Improved Reduction from the Bounded Distance Decoding Problem to the Unique Shortest Vector Problem in Lattices, with Shi Bai and Weiqiang Wen. ICALP 2016. Faster LLL-type reduction of lattice bases, with Arnold Neumaier. ISSAC 2016. Fully Secure Functional Encryption for Inner Products from Standard Assumptions, with Shweta Agrawal and Benoît Libert. CRYPTO 2016. Sanitization of FHE Ciphertexts, with Léo Ducas. EUROCRYPT 2016. Improved security proofs in lattice-based cryptography: using the Rényi divergence rather than the statistical distance, with Shi Bai, Adeline Langlois, Tancrède Lepoint and Ron Steinfeld. ASIACRYPT'15. © Springer-Verlag, 2015. (Best paper award) Journal of Cryptology, 2018, with Amin Sakzad as an additional co-author. Fully Homomorphic Encryption over the Integers Revisited, with Jung Hee Cheon. In the proceedings of EUROCRYPT'15. © Springer-Verlag, 2015. Cryptanalysis of the Multilinear Map over the Integers, with Jung Hee Cheon, Kyoohyung Han, Changmin Lee and Hansol Ryu. In the proceedings of EUROCRYPT'15. © Springer-Verlag, 2015. (Best paper award) Hardness of k-LWE and Applications in Traitor Tracing, with San Ling, Duong Hieu Phan and Ron Steinfeld. In proceedings of CRYPTO'14. © Springer-Verlag, 2014. Algorithmica, 2017. LLL reducing with the most significant bits, with Saruchi, Ivan Morel and Gilles Villard. In proceedings of ISSAC'14. © ACM, 2014. Chiffrement avancé à partir du problème Learning With Errors (in French), avec Fabien Laguillaumie, et Adeline Langlois. Chapitre de l'ouvrage \"Informatique Mathématique, une photographie en 2014\", Presses Universitaires de Perpignan. GGHLite: More Efficient Multilinear Maps from Ideal Lattices, with Adeline Langlois and Ron Steinfeld. In the proceedings of EUROCRYPT'14. © Springer-Verlag, 2014. Lattice-Based Group Signatures with Logarithmic Signature Size, with Fabien Laguillaumie, Adeline Langlois and Benoît Libert. In the proceedings of ASIACRYPT'13. © Springer-Verlag, 2013. A New View on HJLS and PSLQ: Sums and Projections of Lattices, with Jingwei Chen and Gilles Villard. In the proceedings of ISSAC'13. © ACM, 2013. Classical Hardness of Learning with Errors, with Zvika Brakerski, Adeline Langlois, Chris Peikert, and Oded Regev. In the proceedings of STOC'13. Improved Zero-knowledge Proofs of Knowledge for the ISIS Problem, and Applications, with San Ling, Khoa Nguyen and Huaxiong Wang. In the proceedings of PKC'13. © Springer-Verlag, 2013. Semantically Secure Lattice Codes for the Gaussian Wiretap Channel, with Cong Ling, Laura Luzzi and Jean-Claude Belfiore. In IEEE Transactions on Information Theory, 2014. Making NTRUEncrypt and NTRUSign as secure as worst-case problems over ideal lattices, with Ron Steinfeld. Full version of the Eurocrypt'11 article. Submitted. Worst-case to average-case reductions for module lattices, with Adeline Langlois. In Designs, Codes and Cryptography, 2014. Decoding by Embedding: Correct Decoding Radius and DMT Optimality, with Laura Luzzi and Cong Ling. In IEEE Transactions on Information Theory, 2013. Analyzing Blockwise Lattice Algorithms using Dynamical Systems, with Guillaume Hanrot and Xavier Pujol. In the proceedings of CRYPTO 2011. © Springer-Verlag, 2011. Algorithms for the Shortest and Closest Lattice Vector Problems, with Guillaume Hanrot and Xavier Pujol. Invited contribution for IWCC'11. © Springer-Verlag, 2011. Making NTRUEnc as secure as worst-case problems over ideal lattices, with Ron Steinfeld. In the proceedings of Eurocrypt 2011. © Springer-Verlag, 2011. An LLL-reduction algorithm with quasi-linear time complexity, with Andrew Novocin and Gilles Villard. In the proceedings of STOC 2011. Rigorous Perturbation Bounds of Some Matrix Factorizations, with Xiao-Wen Chang. In SIAM Journal on Matrix Analysis and Applications (SIMAX), 2010. Faster Fully Homomorphic Encryption, with Ron Steinfeld. In the proceedings of Asiacrypt 2010. © Springer-Verlag, 2010. Accelerating Lattice Reduction with FPGAs, with Jérémie Detrey, Guillaume Hanrot and Xavier Pujol. In the proceedings of LatinCrypt'10. © Springer-Verlag, 2010. A Complete Worst-Case Analysis of Kannan's Shortest Lattice Vector Algorithm, with Guillaume Hanrot. Short Bases of Lattices over Number Fields, with Claus Fieker. In the proceedings of ANTS-IX. © Springer-Verlag, 2010. On the Extremality of an 80-Dimensional Lattice, with Mark Watkins. In the proceedings of ANTS-IX. © Springer-Verlag, 2010. Decoding by Sampling: A Randomized Lattice Algorithm for Bounded Distance Decoding, with Shuiyin Liu and Cong Ling. In IEEE Transactions on Information Theory, 2011. Solving the Shortest Lattice Vector Problem in Time 2^2.465n, with Xavier Pujol. IACR eprint 2009/605. Perturbation Analysis of the QR factor R in the Context of LLL Lattice Basis Reduction, with Xiao-Wen Chang and Gilles Villard. In Mathematics of Computation, 2012. Efficient Public-Key Encryption Based on Ideal Lat",
  "content_length": 14567,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:24"
}