{
  "name": "Damien Muselet",
  "homepage": "http://perso.univ-st-etienne.fr/muda8804",
  "status": "success",
  "content": "Damien Muselet Damien Muselet Introduction           Publications Assistant Professor Hubert Curien Lab UMR CNRS 5516 University of Jean Monnet Saint-Etienne - FRANCE Tel: +33 (0)4 77 91 57 55 E-mail: damien dot muselet at univ-st-etienne dot fr Introduction I am currently Assistant Professor at the University of Saint-Etienne where I am teaching diverse Computer Vision topics (3D reconstruction, Tracking and motion analysis, Color processing), Deep Learning and Machine Learning, and Color Science. I'm mainly teaching in the engineer school Telecom Saint-Etienne. I'm also the academic coordinator of the European Master (EMJM) (IMLEX), that addresses all the issues surrounding IMage and Lighting for EXtended reality. I am a member of the computer vision team of (Hubert Curien Laboratory) (UMR CNRS 5516). The aim of my research is to automatically extract physical, semantic and robust information from colour images. My current research interests are color constancy and invariance, 3D motion analysis, light reflection models, explainable and frugal AI... Publications (see also Google scholar) Sensor distance learning for cross-camera color constancy R. Ahmed, D. Muselet, P. Colantoni and A. Trémeau IEEE International Conference on Image Processing (ICIP), 2025 PDF SV-GaSRelight: Single-View Gaussian Splatting for 3D Human Relighting S. Jamil, D. Muselet, A. Trémeau and P. Colantoni In International Conference on Advanced Concepts for Intelligent Vision Systems (ACIVS), 2025 PDF Targeted Test Time Adaptation of Memory Networks for Video Object Segmentation I. Dubuisson, D. Muselet, C. Ducottet, J. Lang International Conference on Computer Vision Theory and Applications (Visapp), 2025 PDF Delving into the Explainability of Prototype-Based CNN for Biological Cell Analysis M Blanchard, O Delézay, C Ducottet, D Muselet IEEE International Conference on Image Processing (ICIP), 2909-2915, 2024 PDF Instance-Based CycleGAN for Object Segmentation with Few Annotations DN Díaz Estrada, O Robert, M Kresovic, C Torres, D Muselet, A Tremeau International Workshop on Computational Color Imaging (CCIW), 181-192, 2024 PDF ChromaPose: Robustness of 2D Pose Estimation Under Different Color Illuminations JO Ojeleye, PS Bisht, P Colantoni, D Muselet, A Tremeau International Workshop on Computational Color Imaging (CCIW), 193-206, 2024 PDF Introducing shape priors in Siamese networks for image classification Hiba Alqasir, Damien Muselet, Christophe Ducottet Neurocomputing, Volume 568, Issue C, 2024 PDF, Code MultiView Markerless MoCap-MultiView Performance Capture, 3D Pose Motion Reconstruction and Comparison Pratik Singh Bisht, Philippe Colantoni, Damien Muselet, Alain Trémeau IEEE International Conference on Signal-Image Technology & Internet-Based Systems (SITIS), 2023 PDF Fast context adaptation for video object segmentation I. Dubuisson, D. Muselet, C. Ducottet, J. Lang International Conference on Computer Analysis of Images and Patterns (CAIP), 273-283, 2023. PDF Improved Bilinear Pooling With Pseudo Square-Rooted Matrix S. Xu, D. Muselet, A. Tremeau, L. Jiao IEEE Signal Processing Letters 30, 423-427, 2023. PDF Sparse coding and normalization for deep Fisher score representation S. Xu, D. Muselet, A. Tremeau In Computer Vision and Image Understanding (CVIU) 220, 103436, 2022. PDF Predicting the colors of reference surfaces for color constancy I. Dubuisson, D. Muselet, Y. Basso-Bert, A. Tremeau, R. Laganière In IEEE International Conference on Image Processing (ICIP), 2022. PDF Multi-View Learning for Material Classification B.U. Sumon, D. Muselet, S. Xu, A. Trémeau In Journal of Imaging 8 (7), 186, MDPI, 2022. PDF Our new material image dataset:UJM-TIV Dataset Deep Fisher Score Representation via Sparse Coding S. Xu, D. Muselet, A. Tremeau In International Conference on Computer Analysis of Images and Patterns, 412-421, Best Paper, 2021. PDF Confidence-based local feature selection for material classification S. Xu, D. Muselet, A. Tremeau, R. Laganière In 35th International Conference on Image and Vision Computing New Zealand (IVCNZ), 2020. PDF Mask-guided image classification with siamese networks H. Alqasir, D. Muselet and C. Ducottet In International Conference on Computer Vision Theory and Applications (VISAPP), 2020. PDF Region proposal oriented approach for domain adaptive object detection H. Alqasir, D. Muselet and C. Ducottet In International Conference on Advanced Concepts for Intelligent Vision Systems (ACIVS), 2020. PDF Impact of background context for material recognition S. Xu, D. Muselet, A. Tremeau In Color Imaging Conference, 2019. Deep learning for material recognition: most recent advances and open challenges S. Xu, D. Muselet, A. Tremeau In International Conference on Big Data, Machine Learning and Applications (BIGDML), 2019. Interréflexions lumineuses dans une v-cavité lambertienne D. Saint-Pierre, R. Deeb, D. Muselet, L. Simonot and M. Hébert In Lionel Simonot and Pierre Boulenguez, editors, Quand la matière diffuse la lumière, pages 335360. Presses des Mines, Paris, 2019. Deep Spectral Reflectance and Illuminant Estimation from Self-Interreflections R. Deeb, J. Van de Weijer, D. Muselet, M. Hebert, A. Tremeau Journal of the Optical Society of America A, Vol. 36, Issue 1, pp. 105-114, 2019. PDF Spectral reflectance estimation from one RGB image using self-interreflections in a concave object R. Deeb, D. Muselet, M. Hebert, A. Tremeau Applied Optics, Vol. 57, Issue 17, pp. 4918-4929, 2018. PDF Interreflections in Computer Vision: A Survey and an Introduction to Spectral Infinite-Bounce Model R. Deeb, D. Muselet, M. Hebert, A. Tremeau Journal of Mathematical Imaging and Vision, June 2018, Volume 60, Issue 5, pp 661680. PDF 3D color charts for camera spectral sensitivity estimation R. Deeb, D. Muselet, M. Hebert, A. Tremeau, and J. van de Weijer British Machine Vision Conference, 2017 (BMVC'17). PDF Residual Conv-Deconv Grid Network for Semantic Segmentation Damien Fourure, Rémi Emonet, Elisa Fromont, Damien Muselet, Alain Trémeau, Christian Wolf British Machine Vision Conference, 2017 (BMVC'17). PDF Multi-task, Multi-domain Learning: application to semantic segmentation and pose regression Damien Fourure, Rémi Emonet, Elisa Fromont, Damien Muselet, Natalia Neverova, Alain Trémeau and Christian Wolf Neurocomputing, Elsevier, 2017. PDF Mutual Illumination and Color Constancy Pichayada Katemake, Rada Deeb, Damien Muselet, Mathieu Hebert and Alain Trémeau 13th congress of International color association (AIC 2017), October 2017, Jeju, Korea. PDF Color-based and rotation invariant self-similarities Xiaohu Song, Damien Muselet and Alain Tremeau International Conference on Computer Vision Theory and Applications (Visapp 2017), Feb. 2017, Porto, Portugal. PDF Towards an electronic orientation table: using features extracted from the image to register Digital Elevation Model Léo Nicolle, Julien Bonneton, Hubert Konik, Damien Muselet and Laure Tougne International Conference on Computer Vision Theory and Applications (Visapp 2017), Feb. 2017, Porto, Portugal. PDF 3D reconstruction of indoor scenes using a single RGB-D image Panagiotis-Alexandros Bokaris, Damien Muselet and Alain Trémeau International Conference on Computer Vision Theory and Applications (Visapp 2017), Feb. 2017, Porto, Portugal. PDF Mixed Pooling Neural Networks for Color Constancy Damien Fourure, Rémi Emonet, Elisa Fromont, Damien Muselet, Alain Trémeau and Christian Wolf IEEE International Conference on Image Processing, Sep 2016, Phoenix, United States. ICIP 2016. PDF Semantic Segmentation via Multi-task, Multi-domain Learning Damien Fourure, Rémi Emonet, Elisa Fromont, Damien Muselet, Alain Trémeau and Christian Wolf Joint IAPR International Workshops on Structural and Syntactic Pattern Recognition (SSPR 2016) and Statistical Techniques in Pattern Recognition (SPR 2016), Nov 2016, Merida, Mexico. Supervised Spectral Subspace Clustering for Visual Dictionary Creation in the Context of Image Classification I. Ziko, E. Fromont, D. Muselet, M. Sebban ACPR 2015: 3rd IAPR Asian Conference on Pattern Recognition, Kuala Lumpur, Malaysia (2015). Learning to rank based on subsequences R. Basura Fernando, Efstratios Gavves, Damien Muselet and Tinne Tuytelaars IEEE International Conference on Computer Vision ICCV 2015, Santiago, Chile. PDF Landmarks-based Kernelized Subspace Alignment for Unsupervised Domain Adaptation R. Aljundi, R. Emonet, D. Muselet, M. Sebban IEEE Conference on Computer Vision and Pattern Recognition (CVPR'2015), Boston, United States (2015). PDF Spatial histograms of soft pairwise similar patches to improve the bag-of-visual-words model Rahat Khan, Cecile Barat, Damien Muselet, Christophe Ducottet Computer Vision and Image Understanding (CVIU), Volume 132, March 2015, Pages 102112. Modeling Perceptual Color Differences by Local Metric Learning Michael Perrot, Amaury Habrad, Damien Muselet, Marc Sebban Proc. ECCV 2014 PDF Color Features for dating historical color images Basura Fernando, Damien Muselet, Rahat Khan and Tinne Tuytelaars Proc. ICIP 2014. Towards multispectral data acquisition with hand-held devices Rahat Khan, Joost van de Weijer, Dimosthenis Karatzas and Damien Muselet. Proc. Int. Conf. on Image Processing(ICIP), Melbourne, Australia, 2013. PDF Affine Transforms Between Image Space And Color Space For Invariant Local Descriptors X. Song, D. Muselet and A.Trémeau. Pattern Recognition. Volume 46, Issue 8, August 2013, Pages 23762389. Texture Classification across Illumination Color Variations Rahat Khan, Damien Muselet and Alain Trémeau International Journal of Computer Theory and Engineering vol. 5, no. 1, pp. 65-70, 2013. Discriminative Color Descriptors Rahat Khan, Joost van de Weijer, Fahad Khan, Damien Muselet, Christophe Ducottet and Cecile Barat Proc. of CVPR, Portland, Oregon, USA, 2013. PDF Webpage+Code Scene Reconstruction of Indoor Scenes from Single RGB-D Image Natalia Neverova, Damien Muselet, Alain Trémeau ",
  "content_length": 19122,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:24"
}