{
  "name": "Damiano Spina",
  "homepage": "https://www.rmit.edu.au/contact/staff-contacts/academic-staff/s/spina-dr-damiano",
  "status": "success",
  "content": "Damiano Spina - RMIT University Damiano Spina SKIP TO CONTENT Search field Search Search RMIT Australia RMIT Europe RMIT Global RMIT Vietnam RMIT UP RMIT Online Students Alumni Staff Library RMIT Online Courses Courses by study area Undergraduate courses Postgraduate courses Vocational studies Pre-university studies Online courses and degrees Entry pathways Single courses Short courses and microcredentials Courses for international students Contact Study@RMIT Study with us How to apply Fees Scholarships School leaver information Student services Student experience Key dates Frequently asked questions Parents Career advisers Contact Study@RMIT Life at RMIT Study experience Student life Support for students Global opportunities Industry connections Contact Study@RMIT About News Events Maps Careers Contact us Our strategy Governance & management Schools & colleges Respect for Australian Indigenous cultures Our locations and facilities Our heritage Regenerative Futures Research Our research Partnerships Impact Contact Centres and collaborations Research degrees Find researchers Partner Recruit students and graduates Workforce development Collaborate with RMIT Research partnerships Facilities, equipment and services Contact Industry Engagement Giving to RMIT International Study in Australia Apply to RMIT as an international student Courses for international students Contact Study@RMIT Fees and scholarships for international students International student services Key dates and intake information for international students Frequently asked questions Damiano Spina Dr. Damiano Spina Senior Lecturer See full profile Details College: School of Computing Technologies Department: School of Computing Technologies Campus: City Campus Australia damiano.spina@rmit.edu.au ORCID: 0000-0001-9913-433X Open to Industry Projects Media enquiries Collaborative projects Masters Research or PhD student supervision About Dr. Spina is a Senior Lecturer at the School of Computing Technologies (Interaction, Technology, and Information discipline) at RMIT University. His research areas are Information Retrieval and Text Analytics. In particular, his research focuses on Interactive Information Retrieval (IIR), including user–system interactions in voice-enabled intelligent assistants, and evaluation of information access systems, including effectiveness measures of search engines and fairness–aware evaluation. Dr. Spina is the recipient of an ARC Discovering Early-Career Research Award (DECRA, 2020-2023) and the 2021 RMIT Award for Research Impact (Technology). Dr. Spina is also member of the RMIT-ADM+S team that won the 1st place at the international SIGIR 2025 LiveRAG Challenge. Dr. Spina also teaches Capoeira (Afro-Brazilian martial art) and plays music (Samba with the band Wombatuque). Current Research Projects Lead Investigator of the project Walert (customised AI chatbot using Retrieval-Augmented Generation): http://www.damianospina.com/projects/walert Lead Investigator of the ADM+S project Measuring and Quantifying Bias and Engagement Associate Investigator in ADM+S Phase 2 projects: The Australian Search Experience 2.0 Critical Capabilities for Inclusive AI GenAISim: Simulation in the Loop for Multi-Stakeholder Interactions with Generative Agents Key Activities • Senior Lecturer at RMIT University, School of Computing Technologies. • Associate Investigator at the ARC Centre of Excellence for Automated Decision-Making and Society. • RMIT Research Lead at the Australian Internet Observatory (AIO). • Evaluation and Masurement Capability Co-Lead for the RMIT STEM Leading Research Centre for Human-AI Information Environments (CHAI). • Member of the International Panel on the Information Environment (IPIE). • Distinguished Speaker at the Association for Computing Machinery (ACM): https://speakers.acm.org/speakers/spina_21582 • Associate Editor for the ACM Transactions on Information Systems (TOIS) journal. • Program Committee member for several conferences including SIGIR, WWW, NAACL, CIKM, ECIR, EMNLP, and CHIIR, among others. • Reviewer for renowned journals including Elsevier IP&M, ACM TOIS, EPJ Data Science, ACM TIST, and JASIST, among others. • Responsible Practice Facilitator for the School of Computing Technologies Industry Experience Dr. Spina has collaborated in research with colleagues in different industry organisations, such as Microsoft, Google, ABC, SEEK, ACCIONA, Realthing, Inference Solutions, Abbrevi8, and Llorente&Cuenca. Dr. Spina is the co-author of a patent on a system and method for automating the training of enterprise customer response systems using a range of dynamic or generic data sets. Expand for full bio Collapse bio Media Research fields 461003 Human information interaction and retrieval 460508 Information retrieval and web search 470102 Communication technology and digital media studies 5204 Cognitive and computational psychology UN sustainable development goals 10 Reduced Inequalities 9 Industry, Innovation and Infrastructure Non-academic positions Data scientist Signal AI London, United Kingdom 2014 – 2015 Supervisor projects Understanding the Impact of Social Conformity on Online News Consumption and Misinformation Spread Among Generation X and Generation Z 24 Mar 2025 Understanding the Influence of Search Interfaces and User Diversity on User Search Behaviour and Query Formulation 13 Nov 2024 Research proposal for \"PhD Scholarship in Automated Decision-Making and Information Retrieval\" 26 Jun 2024 Generative AI as tool to expedite the creation and dissemination of verified news content to marginalised communities. 28 Feb 2024 Predictors of judgement updating in response to political information of uncertain veracity 5 Feb 2024 Measuring Information Behaviors and Cognitive Bias Using Wearables 5 Jul 2022 Global Fairness or Local Fairness 18 Jan 2022 Understanding and Reasoning with Numerical Information in the Era of Large Language Models 17 May 2021 Fairness-Aware Question Answering for Intelligent Assistants 15 Oct 2020 Evaluating Dynamic Search Systems for Interactive Complex Tasks 12 Dec 2019 Spoken Conversational Search: Audio-only Interactive Information Retrieval 22 Jun 2016 Teaching interests Supervisor Interests: Information Retrieval, Natural Language Processing, Text Mining, Voice and Conversational Search, Responsible AI Research interests Human Information Interaction and Retrieval, Information Retrieval and Web Search, Library and Information Studies, Information Systems, Artificial Intelligence and Image Processing, Communication and Media Studies Initiatives and links http://www.damianospina.com/ https://www.researchgate.net/profile/Damiano-Spina https://scholar.google.com/citations?hl=en&user=sLzYrNYAAAAJ https://twitter.com/damiano10 Acknowledgement of Country RMIT University acknowledges the people of the Woi wurrung and Boon wurrung language groups of the eastern Kulin Nation on whose unceded lands we conduct the business of the University. RMIT University respectfully acknowledges their Ancestors and Elders, past and present. RMIT also acknowledges the Traditional Custodians and their Ancestors of the lands and waters across Australia where we conduct our business - Artwork 'Sentient' by Hollie Johnson, Gunaikurnai and Monero Ngarigo. More information News Events Library Maps Careers Contacts Study with Us Levels of study Online courses and degrees Single courses Applying to RMIT International students Parents Careers advisers Life at RMIT Study experience Student life Support for students Global opportunities Industry connections Research Our research Centres and collaborations Partnerships Research degrees Find researchers Research contacts Partner Workforce development Staff development and training Research partnerships Facilities and equipment services Giving About Our strategy Governance and management Values Sustainability Schools and colleges Our locations and facilities Copyright © 2025 RMIT University | Terms | Privacy | Accessibility | Website feedback | Complaints | ABN 49 781 030 034 | CRICOS provider number: 00122A | TEQSA provider number: PRV12145 | RTO Code: 3046 | Open Universities Australia | RMIT Training Pty Ltd, trading as RMIT University Pathways (RMIT UP), CRICOS Provider Code: 01912G",
  "content_length": 8289,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:21"
}