{
  "name": "Damir Cavar",
  "homepage": "http://damir.cavar.me",
  "status": "success",
  "content": "Contact | Damir Cavar’s Homepage Contact Associate Professor, Indiana University at Bloomington (IU) ORCID: https://orcid.org/0000-0002-1262-5927 Directing the Natural Language Processing Lab and organizing the Quantum AI and NLP Study group. phone: +1 (812) 856-5094 (or via Signal, Teams, Zoom) email: dcavar at the domain where we all are, here at IU (iu.edu) (GNUPG key) communication: Signal, Element, LinkedIn, Call sign KD9POS code: GitHub publications: ACL Anthology, NLP-Lab, local: publications and talks office hours: During the semester Thursdays 1:00-2:00 PM in my Ballantine Hall 511 My research is inspired by Steve Jobs’ vision from 1985. We are getting there. Address: Indiana University, Ballantine Hall, Room 511, 1020 E. Kirkwood Ave., Bloomington, IN 47405, USA. Adjunct/Member: Indiana University Hutton Honors College’s inaugural Faculty House Fellow 2025/2026 (MAUNA KEA: Hutton House Program) Luddy Artificial Intelligence Center Core Faculty, Indiana University at Bloomington IU Quantum Science and Engineering Center Data Science Faculty in the Luddy School of Informatics, Computing, and Engineering Center for Applied Cybersecurity Research (CACR) Fellow at Indiana University Russian and East-European Institute (REEI), Hamilton Lugar School of Global and International Studies, Indiana University Member of the Cognitive Science Program at Indiana University Adjunct in the Department of Slavic and East European Languages and Cultures Member: Senior Lifetime Member of the Association for Computing Machinery (ACM) • Special Interest Group for Artificial Intelligence (SIGAI) • Special Interest Group on Management of Data (SIGMOD) Association for Computational Linguistics (ACL) • Special Interest Group on Slavic Natural Language Processing (SIGSLAV) Institute of Electrical and Electronics Engineers (IEEE) (Senior Member) • IEEE Computer Society member • IEEE Systems Council member • IEEE Quantum Technical Community (QTC) member The Association for Logic, Language and Information (FoLLI) Certificates Biomedical Researcher Certificate (07-Jul-2022-06-Jul-2027), certificate record ID: 49987962, CITI Program, Requirements set by Indiana University/IU Health 2022-2025 HIPAA Privacy & Security Training, Indiana University 2025-2026 Research Security Certificate, Indiana University 2021 (Class of) National Security Innovations Network (NSIN) Defense Innovation Accelerator (DIA) program certificate Google Project Management Certificate (TBA) PMP Certification from PMI (TBA) Events Me and Danny Valdez are giving a talk at the IU Indianapolis Artificial Intelligence & Informatics Consortium (AI2) Events on the 22nd of October 2025, “Toward dynamic surveillance of drug communication on social media: From descriptive insights to predictive modeling with AI architectures,” on analyzing social media data using AI Agentive Models, Knowledge Graphs, Large Language Models, Ontologies, and how to expand existing resources from the National Institute on Drug Abuse (NIDA) Drugs dictionary with new street terminology and insights generated from drug abuse posts on social media. Topics: AI, NLP, Reasoning in Medical Research Applications I was organizing the Quantum AI and NLP Conference 2025 at Indiana University in August 2025. Activities I launched the environment for Natural Language Qu Kit (NLQK), a Quantum NLP (QNLP) library - GitHub repo, PyPi project, website together with the Quantum Study Group team. The weekly NLP-Lab meetings continue during Summer 2025: Details about meeting times and location can be found on the website. (This is not an open course, student, study, or reading group, this is just my lab meeting!) The weekly Quantum AI and NLP Study Group meetings continue during Summer 2025: Details about meeting times and location can be found on the website. (see IU news article about that) QED-C Discussion and Panel on the Future of Quantum and AI (March 12th, 2025) (LinkedIn post) with Cierra Choucair, Alain Chancé, Damir Cavar, Bob Coecke, Taha Selim (the recording is available on the QED-C YouTube channel) Upcoming Quantum Artificial Intelligence & Optimization 2025 workshop at the 17th International Conference on Agents and Artificial Intelligence (ICAART). Quantum Artificial Intelligence and Natural Language Processing Conference 2025 at Indiana University in August 2025. Most Recent Projects: Quantum AI and NLP (see IU news article about that) Complex Linguistic Constructions and Large Language Models: Ellipsis, Long Distance Dependencies, Discontinuities The Hoosier Ellipsis Corpus (THEC) (GitHub repo) TIE-ML - Temporal Information and Event Annotation (GitHub repo) Knowledge Graphs from unstructured data and common sense reasoning Recent Publications: Davis, A.S., B. Dickson, D. Cavar, D. Valdez, F.M. Tyers (2025) Advancing Adverse Drug Event Detection in Social Media Through Knowledge Graph and GraphRAG LLM Architectures. 2025 AAHB Annual Scientific Meeting, San Diego, CA. (Poster) Damir Cavar, Koushik Reddy Parukola, Chi Zhang (2025) Word and Text Similarity Using Classical Word Embeddings in Quantum NLP Systems. Satellite Workshop: Quantum Machine Learning in Signal Processing and Artificial Intelligence at the 2025 IEEE International Conference on Acoustics, Speech, and Signal Processing. Hyderabad, India. Muhammad S. Abdo, Yash Hatekar and Damir Cavar (2025) AMWAL: Named Entity Recognition for Arabic Financial News. In proceedings of the FinNLP-FNP-LLMFinLegal 2025 workshop at COLING 2025. (download from ACL Anthology) Chi Zhang, Akriti Kumari, Damir Cavar (2024) Entangled Meanings: Classification and Ambiguity Resolution in Near–Term QNLP. Paper and Poster presented at the IEEE Quantum Week 2024, Montreal, Canada, September 2024. (paper, poster) Damir Cavar and Chi Zhang (2024) Semantic Similarities using Classical Embeddings in Quantum NLP. Paper and Poster presented at the IEEE Quantum Week 2024, Montreal, Canada, September 2024. (paper, poster) Damir Cavar, Ludovic V. Mompelat, Muhammad S. Abdo (2024) The Typology of Ellipsis: A Corpus for Linguistic Analysis and Machine Learning Applications. Paper to be presented at the ACL Special Interest Group on Typology (SIGTYP) 2024, colocated with the 18th Conference of the European Chapter of the Association for Computational Linguistics, St Julian’s, Malta. (full paper) Günther Jikeli, Damir Cavar, Weejeong Jeong, Daniel Miehling, Pauravi Wagh, Denizhan Pak (2024) Auf dem Weg zu einer KI-Definition von Antisemitism. In: M. Hübscher and S. von Mehring (eds.) Antisemitismus in den Sozialen Medien. Verlag Barbara Budrich: Opladen, Berlin, Toronto, pp. 269-292. Recent Presentations: Cavar, D., Koushik Reddy Parukola, Shane Sparks (2025) Old Wine in New Bottles: Using Classical Word Embeddings in Quantum NLP Systems. Paper to be presented at the Midwest Speech and Language Days 2025, University of Notre Dame, April 2025. A. Karkala Pai, D. Cavar (2025) A Voice-based Detection of Parkinson’s Disease: Feature Selection and Classification Results. Paper to be presented at the Midwest Speech and Language Days 2025, University of Notre Dame, April 2025. Wang, R., R. Shrivastava, T. Sun, S. Lakshmi Anusha Chebolu, M. Kodandapani Naidu, T. Jayaprakash, J. Decatur, D. Cavar (2025) Improving LLM Reasoning Through Ontology-driven Knowledge Graphs: A Comparative Study of Generating Ontologies for Medical RAGs. Poster to be presented at the Midwest Speech and Language Days 2025, University of Notre Dame, April 2025. Chi Zhang, Akriti Kumari, Damir Cavar (2024) Entangled Meanings: Classification and Ambiguity Resolution in Near–Term QNLP. Paper and Poster presented at the IEEE Quantum Week 2024, Montreal, Canada, September 2024. (paper, poster) Damir Cavar and Chi Zhang (2024) Semantic Similarities using Classical Embeddings in Quantum NLP. Paper and Poster presented at the IEEE Quantum Week 2024, Montreal, Canada, September 2024. (paper, poster) Quantum-Natural Language Processing (NLP) and Machine Learning (ML) (2024) Presentation at the CQT - Center for Quantum Technologies, NSF Industry/University Cooperative Research Center (IUCRC) Year 2, Phase I, Spring 2024 Industry Advisory Board Meeting, April 3-4, 2024, University of Notre Dame, South Bend, IN. Quantum Natural Language Processing and Machine Learning (2024) NLP-Lab poster. Luddy-Crane Summit on March 29, 2024 at Indiana University Bloomington. Damir Cavar. (2024) The Great NLP and AI Swindle: Why State-of-the-art AI Technologies Still Fail(?). Language Processing Brown Bag, Indiana University, February 5th, 2024. (slides) Event Sequencing Annotation with TIE-ML at the The Eighteenth Joint ACL - ISO Workshop on Interoperable Semantic Annotation (ISA-18 2022), at LREC 2022 in Marseille, France. Computational Semantics and Reasoning using Knowledge Graphs and Multi-modal Information Sources for Knowledge Extraction, presented at the Computational Linguistics Seminar at the University of North Carolina at Chapel Hill, October 6th, 2021. Links NLP-Lab - research lab: see public calendar for location and meeting times (contact me, if you would like to join the lab) Quantum AI and NLP Study Group - Computing and Algorithms (GitHub Project Q). Code, data, and projects: GitHub repos, GitLab repos, Bitbucket repos, Kaggle, and former GORILLA was taken down by The LINGUIST List. Teaching: Fall 2025 LING-L 645 Advanced Natural Language Processing / CSCI-B 659 Topics in Artificial Intelligence LING-L 715 Seminar on Knowledge Graphs, Large Language Models, and Graph-based Reasoning using Agentive AI Models / CSCI-B 659 Topics in Artificial Intelligence Spring 2025 LING-L 675 Advanced Machine Learning Techniques / CSCI-B 659 Topics in Artificial Intelligence Fall 2024 LING-L 665 Applying Machine Learning Techniques in Computational Linguistics / CSCI-B 659 Topics in Artificial Intelligence LING-L 645 Advanced Natural Language Processing / CSCI-B 659 Topics in Artificial Intelligence Summer 2024 Generative AI and Symboli",
  "content_length": 10456,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:24"
}