{
  "name": "Damon L. Woodard",
  "homepage": "https://www.ece.ufl.edu/user/1469",
  "status": "success",
  "content": "Home : ECE FLORIDA Harley partners with three other universities to accelerate innovation in AI-augmented health systems UF Engineering teams take top honors at Mission Autonomy Hackathon Turning up the light: harnessing the potential of silicon carbide in optomechanical devices ECE Is Hiring!The Department of Electrical & Computer Engineering (ECE) at the University of Florida invites applications for multiple full-time, nine-month tenure-track faculty positions at the rank of Assistant, Associate, and Full Professor. The positions have an anticipated start date of August 2026. Apply Now Faculty Search Committee Meetings – Tuesdays at Noon | MALA 5000A John Vincent Atanasoff (BSEE ’25)Extraordinary AlumnusMany of Atanasoff’s innovations live on in today’s computers.More Research AreasResearch at ECE Florida falls along four major divisions as well as a number of institutes, centers, and labs. Computer EngineeringComputer Engineering Computer Engineering (CpE) is a discipline that embodies the science and technology of design, construction, implementation, and maintenance of software and hardware components of computer systems and computer-controlled equipment.Area Chair: Tuba Yavuz Learn More ElectrophysicsElectrophysics This division spans a wide area of research involving electromagnetic fields and their application. Includes optical fiber, photonics devices, and lightning. Research also focuses on the behavior, fabrication, and design of devices. Area Chair: Navid Asadi Learn More ElectronicsElectronics This division covers a broad range of topics from the manufacturing of integrated circuits to their applications in real world systems. Area Chair: Hamed Dalir Learn More Signals & SystemsSignals & Systems Studies in this field are related to the transmission, creation, manipulation, and understanding of signals and systems.Area Chair: Joel Harley Learn More Institutes/Centers/LabsInstitutes/Centers/Labs From AI & machine learning to the Internet of Things, from nano devices to hardware and systems security, research by ECE faculty, staff, and students is carried out in these laboratories, centers, and programs. Learn More Learn More About the 2025 ECE Hall of Fame Inductees What advice do the 2025 inductees into the ECE Hall of Fame have? Watch the video to find out. ECE By the Numbers $34.8MResearch ExpendituresFY 2024–25 9Institutes/CentersLed or Co-Led by ECE Faculty 24Endowed ProfessorsOut of 54 Search Submit",
  "content_length": 2460,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:29"
}