{
  "name": "Damon Wischik",
  "homepage": "https://www.cl.cam.ac.uk/~djw1005",
  "status": "success",
  "content": "Damon Wischik Computer Lab Damon Wischik Damon Wischik I am a University Lecturer in the University of Cambridge's Computer Laboratory. I am a data scientist—a mathematical modeler, a programmer, and a data artist. About me… Research How should we do science, when machines can learn much more accurate models of the world than humans can? I work in machine learning, and I approach it as a probabilist and a statistician. My research is on theoretical modelling questions — how we can train neural networks to distinguish causes from symptoms? how can we extract meaningful measures of uncertainty? These are questions that have been studied by statisticians for nearly a century, and machine learning can benefit from concepts that statisticians have developed, but it also needs new approaches because of its near-infinite expressive power. At the practical end, I work on applications in areas such as medicine, climate science, transport, and communications. And I am irrestistably drawn to data visualization. Read more… Teaching IB Data Science RSP OU28 Quantitative methods for small data AI4ER unit on Data visualization IA Scientific Computing IA Algorithms 1 & 2 Modelling and Machine Learning summer course, 2023 III/ACS Probabilistic Machine Learning (LE49) OU24 Visualizing data with R graduate skills course II Data Science Principles and Practice contributor III/ACS Advanced topics in machine learning (R250) — Autoencoders Network Performance for MScDCNDS at UCL, 2006–2011 R for Programmers for graduate students at UCL, 2010–2011 Large Deviations and Queues for Part III Mathematics at Cambridge, 2001–2005 PhD students: Dr James Cruise and Dr Christopher Plunkte. Email— damon.wischik⦿cl.cam.ac.uk Phone— +44 1223 334417 Post— Computer Laboratory, 15 JJ Thomson Avenue, Cambridge CB3 0FD, UK",
  "content_length": 1812,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:26"
}