{
  "name": "Dan McQuillan",
  "homepage": "https://www.gold.ac.uk/computing/staff/d-mcquillan",
  "status": "success",
  "content": "Dr Dan McQuillan | Goldsmiths, University of London Main menu Staff & students In this section Staff details Position Lecturer in Creative & Social Computing Department Computing Email d.mcquillan (@gold.ac.uk) Senior Lecturer in Critical AI, author of 'Resisting AI' (Bristol University Press) After a Ph.D in Experimental Particle Physics, Dan worked with people learning disabilities & mental health issues, created websites with asylum seekers, ran social innovation camps in Georgia, Armenia & Kyrgyzstan, led a citizen science project in Kosova, and worked in digital roles in both Amnesty International and the NHS. He is now a Lecturer in Creative and Social Computing, and recently authored 'Resisting AI - An Anti-fascist Approach to Artificial Intelligence'. Teaching and supervision Critical Social Media Practices (PG) Ethical Computing (UG) Social Media, Crowdsourcing & Citizen Sensing (UG) Critical AI Featured publications 2024: AI will create a thousand Post Office scandals Computer Weekly 2023: Evidence to the House of Lords Inquiry into Large Language Models 2023: Predicted benefits, proven harms - How AI’s algorithmic violence emerged from our own social matrix The Sociological Review Publications and research outputs BookResisting AI: An Anti-fascist Approach to Artificial Intelligence McQuillan, Daniel . 2022. Resisting AI: An Anti-fascist Approach to Artificial Intelligence. Bristol: Bristol University Press. ISBN 9781529213492 Book SectionAI and the counter-university McQuillan, Daniel . 2026. AI and the counter-university. In: Laurent Dubreuil and Daniel McQuillan, eds. Mechanema. New York: Cornell University Press. AI Infrastructures, Total Mobilisation and Decomputing McQuillan, Daniel ORCID logo . 2026. AI Infrastructures, Total Mobilisation and Decomputing. In: Anne Mollen; Fieke Jansen; Sigrid Kannengießer and Julia Velkova, eds. AI Infrastructures and Sustainability: Expanding perspectives on automation, communication and media. London: Palgrave Macmillan. ISBN 9783032097477 New Digital Technologies, Law, and a Non-Fascist Life? On Global Governance, Digital Networks, and the Molecular Unconscious McQuillan, Daniel ; Arvidsson, Matilda; and Gandorfer, Daniela. 2024. New Digital Technologies, Law, and a Non-Fascist Life? On Global Governance, Digital Networks, and the Molecular Unconscious. In: Fleur Johns; Gavin Sullivan and Dimitri Van Den Meerssche, eds. Global Governance by Data: Infrastructures of Algorithmic Rule. Cambridge: Cambridge University Press. Show more information Post-Humanism, Mutual Aid McQuillan, Daniel ORCID logo . 2021. Post-Humanism, Mutual Aid. In: Pieter Verdegem, ed. AI for Everyone? Critical Perspectives. London: University of Westminster Press, pp. 67-84. ISBN 9781914386169 Deep Bureaucracy and Autonomist AI McQuillan, Daniel . 2020. Deep Bureaucracy and Autonomist AI. In: Maria Hlavajova and Sven Lütticken, eds. Deserting from the Culture Wars. Cambridge, MA: MIT Press. ISBN 9780262539432 Artificial Intelligence McQuillan, Daniel ORCID logo . 2020. Artificial Intelligence. In: Martin Parker, ed. Life After COVID-19: The Other Side of Crisis. Bristol University Press. ISBN 9781529215397 Non-fascist AI McQuillan, Daniel ORCID logo . 2019. Non-fascist AI. In: Maria Hlavajova and Wietske Maas, eds. Propositions for Non-Fascist Living: Tentative and Urgent. Cambridge, Massachusetts: MIT Press. ISBN 9780262537896 ArticleAI’s backwards vision [invited letter] McQuillan, Daniel . 2025. AI’s backwards vision [invited letter]. Prospect magazine, ISSN 1359-5024 Resisting the Techno-Fascist Takeover: Are We Ready for Decomputing? McQuillan, Daniel . 2025. Resisting the Techno-Fascist Takeover: Are We Ready for Decomputing? Berliner Gazette, Environmental peacebuilding and AI: the case for decomputing McQuillan, Daniel . 2025. Environmental peacebuilding and AI: the case for decomputing. Environment and Security, ISSN 2753-8796 Show more information A Psychogeography of AI McQuillan, Daniel ORCID logo . 2025. A Psychogeography of AI. Making & Breaking, 4, Is an Anti-Fascist Approach to Artificial Intelligence Possible? McQuillan, Daniel ORCID logo ; and Hendrix, Justin. 2025. Is an Anti-Fascist Approach to Artificial Intelligence Possible? Tech Policy Press, Labour's AI Action Plan - a gift to the far right McQuillan, Daniel ORCID logo . 2025. Labour's AI Action Plan - a gift to the far right. Computer Weekly, ISSN 0010-4787 Betting on AI will take Scotland backwards not forwards McQuillan, Daniel . 2024. Betting on AI will take Scotland backwards not forwards. Bella Caledonia, ISSN 2634-1107 A Just Transition Means Resisting AI McQuillan, Daniel . 2024. A Just Transition Means Resisting AI. The Scottish Left Review, 141, We Are at an Extreme Point Where We Have to Go All in on What We Really Believe Education Should Be About McQuillan, Daniel ORCID logo ; Jarke, Juliane; and Pargman, Teresa Cerratto. 2024. We Are at an Extreme Point Where We Have to Go All in on What We Really Believe Education Should Be About. Postdigital Science and Education, 6(1), pp. 360-364. ISSN 2524-485X AI will create a thousand Post Office scandals McQuillan, Daniel . 2024. AI will create a thousand Post Office scandals. Computer Weekly, ISSN 0010-4787 Predicted benefits, proven harms: How AI’s algorithmic violence emerged from our own social matrix McQuillan, Daniel . 2023. Predicted benefits, proven harms: How AI’s algorithmic violence emerged from our own social matrix. The Sociological Review Magazine, ISSN 2754-1371 Civilian science: the potential of participatory environmental monitoring in areas affected by armed conflicts Weir, Doug; McQuillan, Daniel ; and Francis, Robert A.. 2019. Civilian science: the potential of participatory environmental monitoring in areas affected by armed conflicts. Environmental Monitoring and Assessment, 191(618), ISSN 0167-6369 Data Science as Machinic Neoplatonism McQuillan, Daniel . 2018. Data Science as Machinic Neoplatonism. Philosophy & Technology, 31(2), pp. 253-272. ISSN 2210-5433 People's Councils for Ethical Machine Learning McQuillan, Daniel . 2018. People's Councils for Ethical Machine Learning. Social Media + Society, 4(2), Counter Mapping the Smart City McQuillan, Daniel . 2017. Counter Mapping the Smart City. Livingmaps Review(2), The Anthropocene, Resilience and Post-Colonial Computation McQuillan, Daniel . 2017. The Anthropocene, Resilience and Post-Colonial Computation. Resilience: International Policies, Practices and Discourses, 5(2), pp. 92-109. ISSN 2169-3293 Algorithmic paranoia and the convivial alternative McQuillan, Daniel . 2016. Algorithmic paranoia and the convivial alternative. Big Data & Society, 3(2), ISSN 20539517 Algorithmic States of Exception McQuillan, Daniel . 2015. Algorithmic States of Exception. European Journal of Cultural Studies, 18(4/5), pp. 564-576. ISSN 1367-5494 The Countercultural Potential of Citizen Science McQuillan, Daniel . 2014. The Countercultural Potential of Citizen Science. M/C Journal, 17(6), The ps13 Pitch Spelling Algorithm Meredith, David . 2006. The ps13 Pitch Spelling Algorithm. Journal of New Music Research, 35(2), pp. 121-159. ISSN 0929-8215 Conference or Workshop ItemDan Mcquillan on Decomputing McQuillan, Daniel . 2025. 'Dan Mcquillan on Decomputing'. In: LOCOS Seminar. Glasgow, United Kingdom 16 October 2025. Responsible AI Means Decomputing McQuillan, Daniel ORCID logo . 2025. 'Responsible AI Means Decomputing'. In: BRAID x IDI Hybrid Seminar. London, United Kingdom. AudioAI and the Digital: Resisting AI - Dan McQuillan in conversation with Andrés Saenz de Sicilia McQuillan, Daniel ; and Saenz de Sicilia, Andrés . 2025. AI and the Digital: Resisting AI - Dan McQuillan in conversation with Andrés Saenz de Sicilia. Bursting Bubbles with Dan McQuillan McQuillan, Daniel . 2025. Bursting Bubbles with Dan McQuillan. In the Meanwhile Ep 12: Dan McQuillan on resisting our AI overlords McQuillan, Daniel ORCID logo . 2025. In the Meanwhile Ep 12: Dan McQuillan on resisting our AI overlords. Show more information Decomputing For a Better Future McQuillan, Daniel . 2025. Decomputing For a Better Future. Trashfuture podcast: Dark Satanic Data Mills feat. Dan McQuillan McQuillan, Daniel . 2023. Trashfuture podcast: Dark Satanic Data Mills feat. Dan McQuillan. Machine Learning Street Talk #109 - Dr. DAN MCQUILLAN - Resisting AI McQuillan, Daniel . 2023. Machine Learning Street Talk #109 - Dr. DAN MCQUILLAN - Resisting AI. Tech Won't Save Us - Episode #158: Why We Must Resist AI McQuillan, Daniel . 2023. Tech Won't Save Us - Episode #158: Why We Must Resist AI. The Anti-Fascist Approach to AI McQuillan, Daniel . 2022. The Anti-Fascist Approach to AI. ThisMachineKills Episode 186. Refusing the Everyday Fascism of Artificial Intelligence (ft. Dan McQuillan) McQuillan, Daniel . 2022. ThisMachineKills Episode 186. Refusing the Everyday Fascism of Artificial Intelligence (ft. Dan McQuillan). BroadcastOvernight Ep. 77 → The Necropolitics of AI McQuillan, Daniel ORCID logo ; and Di Salvo, Philip. 2025. Overnight Ep. 77 → The Necropolitics of AI. Professional ActivityOpening Statement to the Oireachtas Joint Committee on AI McQuillan, Daniel ORCID logo . 2025. Opening Statement to the Oireachtas Joint Committee on AI. ReportPublic policymaking: from AI to decomputing McQuillan, Daniel ORCID logo . 2024. Public policymaking: from AI to decomputing. Other. Joseph Rowntree Foundation, York. Submission of Evidence to the House of Lords Communications and Digital Committee Inquiry into Large language models McQuillan, Daniel . 2023. Submission of Evidence to the House of Lords Communications and Digital Committee Inquiry into Large language models. Other. UK Parliament, London. Research projects ESRC Centre for Sociodigital Futures Co-lead for AI Articles related to Dr Dan McQuillan Computing researchers partners on responsible AI demonstrator projects 16 Jul 2025 Students showcase art generated in collaboration with AI a",
  "content_length": 10154,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:35"
}