{
  "name": "Dan Williams 0001",
  "homepage": "https://people.cs.vt.edu/djwillia",
  "status": "success",
  "content": "Dan Williams Dan Williams Assistant Professor Department of Computer Science Virginia Tech djwillia@vt.edu 4207 Gilbert Place Bio I'm currently an Assistant Professor in the Department of Computer Science at Virginia Tech, which I joined in August 2021. Prior to joining VT, I spent 10 years as a Research Staff Member at the IBM T.J. Watson Research Center in Yorktown Heights, NY with whom I still collaborate and hold an affiliation with. I also taught operating systems as an Adjunct Assistant Professor at Vassar College in 2020. I received my PhD from Cornell University under the guidance of Hakim Weatherspoon. My research investigates the systems abstractions for running programs securely and isolated from one another even in shared environments. I am the original author of the Solo5 unikernel execution environment, and a co-creator of unikernel-inspired Nabla containers. Trends I am currently interested in: eBPF and safe user code, including Rust, in the kernel new mechanisms for process sandboxing and isolation lightweight computing abstractions in the cloud (e.g., serverless) confidential computing: enclaves (Intel SGX, TDX, AMD SEV, etc.) My lab is currently at capacity, so I am not actively looking for new students. However, if you are exceptional and interested in working with me as a graduate student, please follow the instructions here and be sure to specify my name on your application! Alert: It has been brought to my attention that scammers have been pretending to be me, emailing students and offering positions. If you receive an email claiming to be from me that is not from the vt.edu domain (e.g., from a gmail address) please delete it! News The Rex work on safe Rust kernel extensions will be presented at USENIX ATC ’25 and Open Source Summit 2025 I was honored to receive a Dean's Award for Outstanding Assistant Professor! congrats to Jinghao Jia for successfully defending his PhD thesis “Making Safe OS Kernel Extensions Expressive, Efficient, and Easy to Program” congrats to Chine Dimobi for successfully defending her MS thesis “Preventing Unintended Data Access: Information Flow Control in eBPF” congrats to Siddharth Chintamaneni for successfully defending his MS thesis “Unsafe nesting in BPF programs” we had two papers accepted to the SIGCOMM eBPF workshop in Sydney! well done Jinghao Jia for passing his PhD prelim! congrats to Raj Sahu for successfully defending his MS thesis “BPF runtime management” congrats to Roop Somaraju for successfully defending his MS thesis “Overflowing the Kernel Stack using Unsafe eBPF Composition” our paper SEVeriFast: Minimizing the root of trust for fast startup of SEV microVMs has been accepted to ASPLOS 2024! I gave an invited talk entitled “The Future of Safe Kernel Extensions” at Bytedance! we have 3 talks on eBPF in the upcoming Linux Plumbers Conference in November! we have 3 papers accepted to the SIGCOMM eBPF workshop in September! our paper Kernel extension verification is untenable has been accepted to HotOS 2023 congrats to the amazing undergrad Ben Holmes, who will start his PhD at MIT next year! honored to receive an NSF CAREER Award to improve the Linux kernel through extensions! our paper Securing Container-based Clouds with Syscall-aware Scheduling has been accepted to ASIACCS 2023 our paper Protect the System Call, Protect (most of) the World with BASTION has been accepted to ASPLOS 2023 our work on eBPF use for seccomp appeared at the Linux Plumbers Conference (on the eBPF and Networking track)! pleased to announce our paper SecQuant: Quantifying Container System Call Exposure has been accepted to ESORICS 2022 invited to serve as co-PC chair of USENIX ATC ’23 with the amazing Julia Lawall pleased to announce our paper KASLR in the age of MicroVMs has been accepted to Eurosys 2022 pleased to announce our paper Verified Programs Can Party: Optimizing Kernel Extensions via Post-Verification In-Kernel Merging has been accepted to Eurosys 2022 I am one of three faculty teaching Computer Systems (CS 3214) this semester Austin Kuo passed his PhD candidacy exam at UIUC! Congrats Austin! invited to serve on the PC of USENIX ATC 2022 invited to serve on the PC of ICDCS 2022 invited to serve as co-PC chair of VEE 2022 with the amazing Yubin Xia Professional Service PC co-chair: USENIX ATC 2023, ACM VEE 2022 NSF panel member: SATC 2022, CISE (CNS/CSR) 2024 Publication chair: SOSP 2025 Finance chair: SOSP 2024 PC member: USENIX ATC 2017, 2019, 2022, 2024 PC member: ACM EUROSYS 2024, 2025 PC member: ACM ASPLOS 2024, 2025 PC member: ACM HotOS 2025 PC member: ACM SIGCOMM eBPF 2024, 2025 PC member: ACM KISV workshop 2024 PC member: ACM SYSTOR 2024 PC member: IEEE ICDCS 2022 PC member: USENIX HotCloud 2020 PC member: ACM VEE 2018, 2019 PC member: IEEE IC2E 2013, 2014, 2016 PC member: IEEE WoC 2018 PC member: IEEE/ACM ESSCA 2018 PC member: ACM CAN 2016, 2017 Reviewer: ACM Transactions on Computer Systems 2020 Reviewer: IEEE Transactions on Cloud Computing 2019, 2021 Reviewer: IEEE Internet Computing 2019 Reviewer: Elsevier JPDC 2013 VTCS graduate admissions committee: 2023, 2024 Teaching Fall 2025 Computer Systems (CS 3214) (VT) Spring 2025 Computer Systems (CS 3214) (VT) Fall 2024 Operating Systems (CS 5204) (VT) Spring 2024 Advanced Topics in Operating Systems Through the Lens of Extensibility (CS 6204) (VT) Fall 2023 Computer Systems (CS 3214) (VT) Spring 2023 Computer Systems (CS 3214) (VT) Fall 2022 Operating Systems (CS 5204) (VT) Spring 2022 Computer Systems (CS 3214) (VT) Spring 2020 Operating Systems (CMPU 334) (Vassar) Students Milo Craun (PhD) Tanuj Rao (PhD) Zhengjie Ji (PhD) Egor Lukiyanov (PhD) Donia Mohammed Ghazy Amer (PhD) Quanzhi Fu (PhD) Eric Schneider (PhD) Kavya Shekar (MS) Rahul Tiwari (MS) Graduated Students Jinghao Jia (PhD, UIUC 2025) Chinecherem Dimobi (MS 2025) Siddharth Chintamaneni (MS 2024) Raj Sahu (MS 2024) Roop Somaraju (MS 2024) Funding NSF CAREER Award $602,686.00 4-VA Collaborative Research Award $30,000.00 Commonwealth Cyber Initiative Southwest Virginia Node (w/ Wenjie Xiong) $60,000.00 (50% share) Publications Towards Safe Agentic AI Performance Engineering In Proceedings of the 4th Workshop on Practical Adoption Challenges of ML for Systems (PACMI ’25), Seoul, Republic of Korea, October 2025 Dan Williams, Milo Craun, Michael V. Le, Julian Stephen, Salman Ahmed, and Hani Jamjoom Pairwise BPF Programs Should Be Optimized Together In Proceedings of ACM SIGCOMM Workshop on eBPF and Kernel Extensions (eBPF ’25), Coimbra, Portugal, September 2025 Milo Craun and Dan Williams SchedBPF - Scheduling BPF programs In Proceedings of ACM SIGCOMM Workshop on eBPF and Kernel Extensions (eBPF ’25), Coimbra, Portugal, September 2025 Kavya Shekar and Dan Williams BPFflow - Preventing information leaks from eBPF In Proceedings of ACM SIGCOMM Workshop on eBPF and Kernel Extensions (eBPF ’25), Coimbra, Portugal, September 2025 Chinecherem Dimobi, Rahul Tiwari, Zhengjie Ji, and Dan Williams Rex: Closing the language-verifier gap with safe and usable kernel extensions In Proceedings of USENIX ATC, Boston MA, July 2025 Jinghao Jia, Ruowen Qin, Milo Craun, Egor Lukiyanov, Ayush Bansal, Minh Phan, Michael V. Le, Hubertus Franke, Hani Jamjoom, Tianyin Xu, and Dan Williams Extending Applications Safely and Efficiently In Proceedings of USENIX OSDI, Boston MA, July 2025 Yusheng Zheng, Tong Yu, Yiwei Yang, Yanpeng Hu, Xiaozheng Lai, Dan Williams, Andrew Quinn Rex: Safe and Usable Kernel Extensions in Rust In The Linux Foundation Open Source Summit North America, Denver Colorado, June 2025 Jinghao Jia, Tianyin Xu, and Dan Williams Eliminating eBPF Tracing Overhead on Untraced Processes In Proceedings of ACM SIGCOMM Workshop on eBPF and Kernel Extensions (eBPF ’24), Sydney, Australia, August 2024 Milo Craun, Khizar Hussain, Uddhav Gautam, Zhengjie Ji, Tanuj Rao, and Dan Williams Unsafe Kernel Extension Composition via BPF Program Nesting In Proceedings of ACM SIGCOMM Workshop on eBPF and Kernel Extensions (eBPF ’24), Sydney, Australia, August 2024 Siddharth Chintamaneni, Sai Roop Somaraju, and Dan Williams SeaK: Rethinking the Design of a Secure Allocator for OS Kernel In USENIX Security, Philadelphia, PA, August 2024 Zicheng Wang, Yicheng Guang, Yueqi Chen, Zhenpeng Lin, Michael Le, Dang K Le, Dan Williams, Xinyu Xing, Zhongshu Gu, and Hani Jamjoom Fast (Trapless) Kernel Probes Everywhere In Proceedings of USENIX ATC, Santa Clara, CA, July 2024 Jinghao Jia, Michael V. Le, Salman Ahmed, Dan Williams, Hani Jamjoom, and Tianyin Xu SEVeriFast: Minimizing the root of trust for fast startup of SEV microVMs In ACM ASPLOS, San Diego, CA, April 2024 Benjamin Holmes, Jason Waterman, and Dan Williams Broadly Enabling KLEE to Effortlessly Find Unrecoverable Errors in Rust In ACM ICSE-SEIP, Lisbon, Portugal, April 2024 Ying Zhang, Peng Li, Yu Ding, Wang Lingxiang, Dan Williams, and Na Meng When BPF programs need to die : exploring the design space for early BPF termination In Linux Plumbers Conference, Richmond, VA, November 2023 Raj Sahu and Dan Williams Overflowing the kernel stack with BPF In Linux Plumbers Conference, Richmond, VA, November 2023 Siddharth Chintamaneni, Sai Roop Somaraju, and Dan Williams Advancing Kernel Control Flow Integrity with eBPF In Linux Plumbers Conference, Richmond, VA, November 2023 Jinghao Jia, Michael Le, Salman Ahmed, Dan Williams, and Hani Jamjoom Enabling eBPF on Embedded Systems Through Decoupled Verification In Proceedings of ACM SIGCOMM Workshop on eBPF and Kernel Extensions (eBPF ’23), New York, New York, September 2023 Milo Craun, Adam Oswald, and Dan Williams Enabling BPF Runtime policies for better BPF management In Proceedings of ACM SIGCOMM Workshop on eBPF and Kernel Extensions (eBPF ’23), New York, New York, September 2023 Raj Sahu and Dan Williams Practical and Flexible Kernel CFI Enforcement using eBPF In Proceedings of ACM SIGCOMM Workshop on eBPF and Kernel Extensions (eBPF ’23), New York, New York, September 2023 Ji",
  "content_length": 16400,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:40"
}