{
  "name": "Dan I. Moldovan",
  "homepage": "http://cs.utdallas.edu/people/faculty/moldovan-dan",
  "status": "success",
  "content": "Dan Moldovan - UT Dallas Profiles Warning: This site requires a JavaScript-enabled browser in order to function properly. If you have disabled JavaScript, please enable it for this site. Skip to main content Dan Moldovan Professor - Computer Science 972-883-4838 ECS3410 Faculty Homepage Tags: Computer Science Please type your desired tags, e.g. nonlinearwaves, High-dimensional count data modeling, Robotics, Psychotherapy, Health, probability, 20th century Anglophone Literature, Analysis on Riemann surfaces, Nonlinear wave equations, African American Diaspora, and etc. Press the 'enter' key or type a comma (,) after each new tag. Tags: Computer Science Cancel Update Tags Professional Preparation Ph.D. - Electrical Engineering and Computer Science Columbia University - 1978 M.S. - Electrical Engineering and Computer Science Columbia University - 1974 Diploma Engineer - Electrical Engineering Polytechnic Institute of Bucharest - 1969 Research Areas Current Research Direct the InterVoice Research Center in the Human Language Technology Research Institute at UTD.Co-direct the development of a state-of-the-art Question Answering system that achieved the best performance at TREC-8 (1999), TREC-9 (2000), TREC-11 (2002), TREC-12 (2003) and TREC-13 (2004) QA competitionsDevelop a Knowledge Acquisition from Text (KAT) system that discovers concepts and relations for the purpose of extending WordNet interactively with domain-specific knowledge.Develop Word Sense Disambiguation (WSD) methods for open text.Develop a new technology for Semantic Indexing and Retrieval of texts that uses word semantics for the purpose of increasing the conciseness and the relevance of the information retrieved.Develop a tool for transforming WordNet into a knowledge base by disambiguating the glosses and transforming them in logical and semantic forms.Develop a Distributed Question Answering system using a Distributed Java Virtual Machine environment. Study the scalability of some Applied Natural Language Processing algorithms on parallel and distributed computers. Previous Research Worked on Parallel Processing applied to Natural Language Processing including inferences, acquisition of linguistic patterns, and parsers.Studied marker-propagation as a new computational paradigm for Artificial Intelligence problems.Parallel processing of Rule Based Systems.Design of systolic arrays and other array processors.Mapping computational algorithms into parallel architectures.Microprocessor-based real-time systems. Publications D. Moldovan, C. Clark, S. Harabagiu and D. Hodges, COGEX: A Semantically and Contextually Enriched Logic Prover for Question Answering, Journal of Applied Logic, Vol. 5(1), March 2007, 49-69 2007 - Publication Marta Tatu, Brandon Iles, Dan Moldovan, Automatic Answer Validation Using COGEX Evaluation of Multilingual and Multi-modal Information Retrieval In book series Lecture Notes in Computer Science, ed. C. Peters et al Springer Berlin / Heidelberg Publisher Vol. 4730 (2007) 494-501 2007 - Publication Mitchell Bowden, Marian Olteanu, Pasin Suriyentrakorn, Thomas d'Silva, Dan Moldovan, Multilingual Question Answering through Intermediate Translation: LCC's PowerAnswer at QA@CLEF 2007 Evaluation of Multilingual and Multi-modal Information Retrieval In book series Lecture Notes in Computer Science, ed. C. Peters et al Springer Berlin / Heidelberg Publisher Vol. 4730 (2007) 310-317 2007 - Publication Some Advanced Features of LCCs PowerAnswer in Advances in Open Domain Question Answering, Springer, 2006, 3-34. 2006 - Publication R. Girju, A. Badulescu, and D. Moldovan, Automatic Discovery for Part-Whole Relations, Computational Linguistics, Vol. 32(1) March 2006, 83-135 2006 - Publication D. Moldovan and R. Girju, Learning the Semantics of Noun Compounds, Computing Meaning, Vol. 4, Kluwer, Harry Bunt, editor, 2006 2006 - Publication R. Girju, D. Moldovan, M. Tatu, D. Antohe On the Semantics of Noun Compounds, Journal of Computer Speech and Language-Special Issue on Multiword Expressions, Aline Villavicencio, Francis Bond, Diana McCarthy, editors, vol 19, no. 4, October 2005, 479-496. 2005 - Publication O. Fortu and D. Moldovan, Identification of Textual Contexts, CONTEXT, LNAI 3554, ed by A. Dey et al. Berlin Heidelberg Springer-Verlag, pp. 169-182, 2005 2005 - Publication Appointments Professor The University of Texas at Dallas [2001–Present] Chairman Southern Methodist University [1994–1998] Professor Southern Methodist University [1993–2001] Director Southern Methodist University [1993–2001] Parallel and Distributed Computer Systems Laboratory Director University of Southern California [1986–1994] Parallel Knowledge Processing Laboratory Associate Professor University of Southern California [1985–1993] Assistant Professor University of Southern California [1981–1986] Assistant Professor Colorado State University [1979–1981] Additional Information Major Projects Extended WordNet Computational Lexical Semantics Ontologies and Semantic Technologies Knowledge Acquisition from Text Distributed Natural Language Processing",
  "content_length": 5091,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:34"
}