{
  "name": "Dan Goldwasser",
  "homepage": "https://www.cs.purdue.edu/homes/dgoldwas",
  "status": "success",
  "content": "Goldwasser Lab - Home Toggle navigation NLP @ Purdue University Home Publications Dan Goldwasser I am an associate professor at the department of computer science at Purdue university. I am broadly interested in connecting natural language with real world scenarios, and using them to guide natural language understanding. Before starting at Purdue I was a postdoctoral researcher at the University of Maryland in College Park. I completed my Ph.D. studies at the University of Illinois at Urbana-Champaign in the department of Computer Science. Selected Publications Modeling Content and Context with Deep Relational Learning Maria Leonor Pacheco, Dan Goldwasser. Transactions of the Association for Computational Linguistics (TACL), 2020. Multi-Relational Script Learning for Discourse Relations I-Ta Lee, Dan Goldwasser. Association for Computational Linguistics (ACL), 2019. Encoding Social Information with Graph Convolutional Networks for Political Perspective Detection in News Media Chang Li, Dan Goldwasser. Association for Computational Linguistics (ACL), 2019. Classification of Moral Foundations in Microblog Political Discourse. Kristen Johnson, Dan Goldwasser. Association of Computational Linguistics (ACL), 2018. Leveraging Behavioral and Social Information for Weakly Supervised Collective Classification of Political Discourse on Twitter Kristen Johnson, Di Jin, Dan Goldwasser. Association for Computational Linguistics (ACL), 2017. Understanding Satirical Articles Using Common-Sense Dan Goldwasser, Xiao Zhang. Transactions of the Association for Computational Linguistics (TACL), 2016. Recent Activities Area Chair for ACL 2021 Area Chair for NAACL 2021 Senior Program Committee member for AAAI 2021 Area Chair for ACL 2020, Grounded Language Senior Program Committee member for AAAI 2020 Area Chair for EMNLP 2019, Sentiment Analysis and Argument Mining Area Chair for *SEM 2019 Area Chair for NAACL 2019, Social Media Invited talk at Dawn or Doom 2019 … see all activities News 18 March 2021 Congratulations to Tunazzina Islam for her ICWSM paper! Her work, Analysis of Twitter Users Lifestyle Choices using Joint Embedding Model, analyzes Twitter users' lifestyle choices and their motivation using a joint social-linguistic embedding model. 15 March 2021 Congratulations to I-Ta Lee and Maria Pacheco for their NAACL paper! Their work, Modeling Human Mental States with an Entity-based Narrative Graph, uses narrative-contextualized event embedding to analyze characters' mental states and their transitions. 1 January 2021 NSF CAREER proposal recommended for funding! My proposal, titled Understanding Opinions by Reasoning over Socially Grounded Language was recommended for funding. 18 December 2020 Congratulations to Manuel Widmoser and Maria Pacheco for their EACL paper! Their paper Randomized Deep Structured Prediction for Discourse-Level Processing explores deep structured prediction using randomized inference, applied to several arugmentation mining tasks. 25 November 2020 I-Ta defends his PhD! Congratulations to I-Ta Lee! He will join Facebook as a research scientist! 15 October 2020 Congratulations to Maria Pacheco for her TACL paper! Her work intoduces DRaiL, a declarative Neuro-Symbolic framework for deep relational learning. Take a look at her work here 18 September 2020 Congratulations to Shamik Roy for his EMNLP paper! His work studies nuanced political framing on news media, obtained with minimal human supervision. Take a look at his work here 18 September 2020 Congratulations to I-Ta Lee and Maria Pacheco for their EMNLP findings paper! Their work suggests a model for Narrative-contextualized event embedding. Take a look at their work here 3 April 2020 Congratulations to Maryam Davoodi for her ACL paper! Her work analyzes legislative texts according to agreement patterns across different demographic groups. Take a look at her work here ... see all News Contact: Purdue University Department of Computer Science Office: Lawson Building 2142A. West Lafayette, IN. 47907. dgoldwas AT purdue DOT edu",
  "content_length": 4063,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:30"
}