{
  "name": "Dan Feldman",
  "homepage": "http://people.csail.mit.edu/dannyf",
  "status": "success",
  "content": "Dan Feldman Top About Me Research Group Current research Machine learning of Big Data, Internet of Things, Swarm robotics, and 3D-cameras. I am especially excited about reducing the gap between theoretical and practical algorithms, using my experience in the industry and academy. Main technique Core-sets: Semantic compression of data sets into small sets that provably approximate the original data for a given problem. Using merge-reduce (e.g. Spark) the small sets can then be used for solving hard machine learning problems in parallel (on the cloud/network), real-time and on Big streaming data. Introduction to Core-sets Publications Introduction to Coresets Videos from the Machine Learning Summer School 2014 at CMU Lecture 1: Lectures 2 and 3: Lecture 4: Lecture 5: Publications and Slides Fast and Accurate Least-Mean-Squares Solvers [slides] with Alaa Maalouf and Ibrahim Jubran. [oral presentation] [Short Interview] Proc. 33rd Conference on Neural Information Processing Systems (NIPS) 2019 (Oral + Outstanding Paper Honorable Mention) Introduction to Coresets: Accurate Coresets with Ibrahim Jubran and Alaa Maalouf (under review) Tight Sensitivity Bounds For Smaller Coresets with Alaa Maalouf and Adiel Statman Provable Filter Pruning for Efficient Neural Networks Lucas Liebenwein, Cenk Baykal, Harry Lang, Daniela Rus. Data-Independent Neural Pruning via Coresets with Ben Mussay, Margarita Osadchy, Vladimir Braverman, Samson Zhou. Secure Data Retrieval on the Cloud: Homomorphic Encryption meets Coresets with Adi Akavia, Hayim Shaul Transactions on Cryptographic Hardware and Embedded Systems, Accepted for Publication Position Estimation of Multiple Robots: Provable, Practical Approximation Algorithm With Ariel Hutterer, Danial, Jeryes. IEEE Robotics and Automation Letters (RA-L), Accepted for Publication Measuring Privacy in the Always-On Era With Eldar Haber Cardozo Arts & Entertainment Law Journal, Accepted for Publication Real-Time EEG Classification via Coresets for BCI Applications with Eitan Netzer, Alex Frid. Minimizing Sum of Non-Convex but Piecewise log-Lipschitz Functions using Coresets with Ibrahim Jubran. [Video], [Presentation] Secure Search via Sketching for Homomorphic Encryption with Adi Akavia, Hayim Shaul 25th ACM Conference on Computer and Communications Security 2018. Coresets For Monotonic Functions with Applications to Deep Learning with Elad Tolochinsky, Submitted. Quadcopter Tracks Quadcopter via Real Time Shape Fitting with Dror Epstein. [Video] IEEE Robotics and Automation Letters (RA-L) 2017 Secure Search on the Cloud via Coresets and Sketches with Adi Akavia, Hayim Shaul Training Mixture Models at Scale via Coresets (Fuller version) with Mario Lucic, Matthew Faulkner, Andreas Krause Journal of Machine Learning (JMLR) 2017 Coresets for Vector Summarization with Applications to Network Graphs with Sedat Ozer, and Daniela Rus International Conference on Machine Learning (ICML) 2017 Coresets for Differentially Private K-Means Clustering and Applications to Privacy in Mobile Sensor Networks with Ruihao Zhu, Chongyuan Xiang and Daniela Rus ACM/IEEE Conf. on Information Processing in Sensor Networks (IPSN) 2017, to appear New Frameworks for Offline and Streaming Coreset Constructions with Vladimir Braverman, Harry Lang Dimensionality Reduction of Massive Sparse Datasets Using Coresets with Mikhali Volkov, Daniela Rus, (supplementary material) Proc. 29th Conference on Neural Information Processing Systems (NIPS) 2016 k-Means for Streaming and Distributed Big Sparse Data with Artem Barger Proceedings of the 2016 SIAM International Conference on Data Mining (SDM) 2016 Low-cost and Faster Tracking Systems Using Core-sets for Pose-Estimation with Soliman Nasser and Ibrahim Jubran [Video] iDiary: From GPS Signals to a Text-Searchable Diary with Andrew Sugaya, Cynthia Sung, and Daniela Rus ACM Transactions on Sensor Networks, Volume I, Issue 4 2015 Coresets for Visual Summarization with Applications to Loop Closure with G. Rossman, Dan Feldman, Mikhail V. Volkov and D. Rus IEEE International Conference on Robotics and Automation (ICRA) 2015 Fleye on the Car: Big data Meets the Internet of Things with Soliman Nasser, Andrew Barry, Marek Doniec, Guy Peled, Guy Rosman, Daniela Rus, and Mikhail Volkov. ACM/IEEE Conf. on Information Processing in Sensor Networks (IPSN) 2015 More Constraints, Smaller Coresets: Constrained Matrix Approximation of Sparse Big Data with Tamir Tassa 21st ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD) 2015 Coresets for k-segmentation of streaming data with G. Rosman, M. Volkov, J.W. Fisher III, and D. Rus Proc. 27th Conference on Neural Information Processing Systems (NIPS) 2014 Smallest enclosing ball for probabilistic data with Alexander Munteanu, and Christian Sohler The 30th Annual Symposium on Computational Geometry (SoCG) 2014 Visual Precis Generation using Coresets with Rohan Paul, Daniela Rus and Paul Newman. IEEE International Conference on Robotics and Automation (ICRA) 2014 Big Data for Robots: Online HMM Coresets for Sensor Streams with Cathy Wu, Brian Julian, Cynthia Sung, and Daniela Rus IEEE International Conference on Robotics and Automation (ICRA) 2013 K-Robots Clustering of Moving Sensors Using Coresets , [Slides] with Stephanie Gil and Daniela Rus IEEE International Conference on Robotics and Automation (ICRA) 2013 iDiary: From GPS Signals to a Text-Searchable iDiary with Andrew Sugaya, Cynthia Sung, and Daniela Rus The 11th ACM Conference on Embedded Networked Sensor System (SenSys) 2013 Learning Big (Image) Data via Coresets for Dictionaries with Micha Feigin, and Nir Sochen The International Biomedical and Astronomical Signal Processing (BASP) Frontiers workshop, 2013, selected to The Journal of Mathematical Imaging and Vision (JMIV) The Single Pixel GIS: Learning Big Data Signals from Tiny Coresets with Cynthia Sung and Daniela Rus Proc. 20th ACM International Conference on Advances in Geographic Information Systems (SIGSPATIAL GIS) 2012 Turning Big Data into Tiny Data: Constant-size Coresets for k-means, PCA and Projective Clustering with Melanie Schmidt and Christian Sohler Proc. 24th Annu. ACM Symp. on Discrete Algorithms (SODA) 2013, and in the 4th Workshop on Massive Data Algorithms (MASSIVE) 2012 Trajectory Clustering for Motion Prediction with Cynthia Sung and Daniela Rus IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) 2012 Communication Coverage for Independently Moving Robots with Stephanie Gil and Daniela Rus IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) 2012 An Effective Coreset Compression Algorithm for Large Scale Sensor Networks, with Andrew Sugaya and Daniela Rus Proc. 11th ACM/IEEE Conf. on Information Processing in Sensor Networks (IPSN) 2012 Data Reduction for Weighted and Outlier-resistant Clustering, [Slides] with Leonard J. Schulman. Proc. 23th Annu. ACM Symp. on Discrete Algorithms (SODA) 2012 Scalable Training of Mixture Models via Coresets [Slides] with Andreas Krause and Matthew Faulkner. Proc. 25th Conference on Neural Information Processing Systems (NIPS) 2011 A Unified Framework for Approximating and Clustering Data with Michael Langberg Proc. 43st Annu. ACM Symposium on Theory of Computing (STOC) 2011 [Fuller Version] From High Definition Image to Low Space Optimization with Micha Feigin and Nir Sochen Scale Space and Variational Methods in Computer Vision (SSVM) 2011 Coresets and Sketches for High Dimensional Subspace Approximation Problems with Morteza Monemizadeh, Christian Sohler and David Woodruf, Proc. 21th Annu. ACM Symp. on Discrete Algorithms (SODA) 2010 Private Coresets, [Slides] with Amos Fiat, Haim Kaplan and Kobbi Nissim Proc. 41st Annu. ACM Symposium on Theory of Computing (STOC) 2009 A PTAS for k-Means Clustering Based on Weak Coresets with Morteza Monemizadeh and Christian Sohler Proc. 23th Annu. ACM Symposium on Computational Geometry (SoCG) 2007 Bi-criteria Linear-time Approximations for Generalized k-Mean/Median/Center with Amos Fiat, Danny Segev and Micha Sharir Proc. 23th Annu. ACM Symposium on Computational Geometry (SoCG) 2007 Coresets for Weighted Facilities and Their Applications [Slides] with Amos Fiat and Micha Sharir Proc. 47th Annu. IEEE Symposium on Foundations of Computer Science (FOCS) 2006 Resume Dan Feldman is a faculty member and the head of the new Robotics & Big Data Labs in the University of Haifa, after returning from a 3 years post-doc at the robotics lab of MIT. During his PhD in the University of Tel-Aviv he developed data reduction techniques known as core-sets, based on computational geometry. Since his post-docs at Caltech and MIT, Dan's coresets are applied for main problems in Machine Learning, Big Data, computer vision, EEG and robotics. His group in Haifa continues to design and implement core-sets with provable guarantees for such real-time systems. Group Media Interview, in \"Hasufim\", University of Haifa, 2015 Article of Computer Vision News, Sept 2016",
  "content_length": 9031,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:31"
}