{
  "name": "Dan R. Ghica",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/ghica-dan.aspx",
  "status": "success",
  "content": "Professor Dan Ghica - School of Computer Science - University of Birmingham Professor Dan Ghica School of Computer ScienceChair Contact details Telephone+44 (0) 121 414 8819Emaild.r.ghica@cs.bham.ac.uk View my research portal AddressSchool of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Dan Ghica is a Professor of Semantics of Programming Languages in the School of Computer Science at the University of Birmingham. He is also a member of Theory of Computation research group. Prof. Ghica is researching theoretical aspects of programming languages such as type systems and semantics, particularly using string diagrams. He is currently holding an EPSRC Grant for the study of \"Nominal string diagrams\". The main practical problem he works on is transparently compiling conventional programming languages on unconventional architectures (\"seamless computing\"). He is a lead in a new startup using these advanced technologies in the context of cloud computing, Acygn. Prof. Ghica is also the director of the Programming Language Laboratory in the Huawei Research Centre, Edinburgh. Please follow the link for more information about Dan's work: Professor Dan Ghica - personal webpage Recent publications Article Ghica, D, Muroya, K & Waugh Ambridge, T 2025, 'A robust graph-based approach to observational equivalence', Logical Methods in Computer Science, vol. 21, no. 2, 8, pp. 8:1–8:95. https://doi.org/10.46298/lmcs-21(2:8)2025 Alvarez-Picallo, M, Freund, T, Ghica, DR & Lindley, S 2024, 'Effect Handlers for C via Coroutines', Proceedings of the ACM on Programming Languages, vol. 8, no. OOPSLA2, 358, pp. 2462-2489. https://doi.org/10.1145/3689798 Wilson, P, Ghica, D & Zanasi, F 2024, 'String diagrams for Strictification and Coherence', Logical Methods in Computer Science, vol. 20, no. 4, pp. 8:1-8:24. https://doi.org/10.46298/lmcs-20(4:8)2024 Ghica, D, Lindley, S, Bravo, MM & Piróg, M 2022, 'High-level effect handlers in C++', Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, pp. 1639-1667. https://doi.org/10.1145/3563445 Cheung, S, Ghica, D & Muroya, K 2021, 'Transparent synchronous dataflow', The Art, Science, and Engineering of Programming, vol. 5, no. 3, 12. https://doi.org/10.22152/programming-journal.org/2021/5/12 Ghica, DR & Alyahya, K 2019, 'Latent semantic analysis of game models using LSTMs', Journal of Logical and Algebraic Methods in Programming, vol. 106, pp. 39-54. https://doi.org/10.1016/j.jlamp.2019.04.003 Muroya, K & Ghica, DR 2019, 'The dynamic geometry of interaction machine: a token-guided graph rewriter', Logical Methods in Computer Science, vol. 15, no. 4, 4340. https://doi.org/10.23638/LMCS-15(4:7)2019 Chapter Ghica, DR 2023, The Far Side of the Cube: An Elementary Introduction to Game Semantics. in A Palmigiano & M Sadrzadeh (eds), Samson Abramsky on Logic and Structure in Computer Science and Beyond. 1 edn, Outstanding Contributions to Logic, vol. 25, Springer, pp. 219-250. https://doi.org/10.1007/978-3-031-24117-8_6 Conference article Ghica, DR 2021, 'Operational semantics with hierarchical abstract syntax graphs', Electronic Proceedings in Theoretical Computer Science, EPTCS, vol. 334, pp. 1-10. https://doi.org/10.4204/eptcs.334.1 Conference contribution Alvarez-Picallo, M, Ghica, D, Sprunger, D & Zanasi, F 2023, Functorial String Diagrams for Reverse-Mode Automatic Differentiation. in B Klin & E Pimentel (eds), 31st EACSL Annual Conference on Computer Science Logic (CSL 2023)., 6, Leibniz International Proceedings in Informatics, LIPIcs, vol. 252, Schloss Dagstuhl, 31st EACSL Annual Conference on Computer Science Logic, Warsaw, Poland, 13/02/23. https://doi.org/10.4230/LIPIcs.CSL.2023.6 Ghica, DR & Kaye, G 2023, Rewriting Modulo Traced Comonoid Structure. in M Gaboardi & F van Raamsdonk (eds), 8th International Conference on Formal Structures for Computation and Deduction (FSCD 2023)., 14, Leibniz International Proceedings in Informatics, LIPIcs, vol. 260, Schloss Dagstuhl, 8th International Conference on Formal Structures for Computation and Deduction , Rome, Italy, 3/07/23. https://doi.org/10.4230/LIPIcs.FSCD.2023.14 Wilson, P, Ghica, D & Zanasi, F 2023, String Diagrams for Non-Strict Monoidal Categories. in B Klin & E Pimentel (eds), 31st EACSL Annual Conference on Computer Science Logic (CSL 2023)., 37, Leibniz International Proceedings in Informatics, LIPIcs, vol. 252, Schloss Dagstuhl, 31st EACSL Annual Conference on Computer Science Logic, Warsaw, Poland, 13/02/23. https://doi.org/10.4230/LIPIcs.CSL.2023.37 Alvarez-Picallo, M, Ghica, D, Sprunger, D & Zanasi, F 2022, Rewriting for Monoidal Closed Categories. in AP Felty (ed.), 7th International Conference on Formal Structures for Computation and Deduction (FSCD 2022)., 29, Leibniz international proceedings in informatics, vol. 228, Schloss Dagstuhl, 7th International Conference on Formal Structures for Computation and Deduction, FSCD 2022, Haifa, Israel, 2/08/22. https://doi.org/10.4230/LIPIcs.FSCD.2022.29 Ghica, DR & Ambridge, TW 2021, Global optimisation with constructive reals. in 2021 36th Annual ACM/IEEE Symposium on Logic in Computer Science (LICS)., 9470549, Proceedings - Symposium on Logic in Computer Science, Institute of Electrical and Electronics Engineers (IEEE), 36th Annual ACM/IEEE Symposium on Logic in Computer Science, LICS 2021, Virtual, Online, 29/06/21. https://doi.org/10.1109/LICS52264.2021.9470549 Cheung, S, Darvariu, V, Ghica, DR, Muroya, K & Rowe, RNS 2018, A functional perspective on machine learning via programmable induction and abduction. in JP Gallagher & M Sulzmann (eds), Functional and Logic Programming: 14th International Symposium, FLOPS 2018, Nagoya, Japan, May 9–11, 2018, Proceedings. Lecture Notes in Computer Science, vol. 10818, Springer, pp. 84-89, 14th International Symposium on Functional and Logic Programming, (FLOPS 2018), Nagoya, Japan, 9/05/18. https://doi.org/10.1007/978-3-319-90686-7_6 View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 6113,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:37"
}