{
  "name": "Dan Schien",
  "homepage": "https://research-information.bris.ac.uk/en/persons/daniel-schien",
  "status": "success",
  "content": "Daniel Schien - University of Bristol View Scopus Profile Dr Daniel Schien PhD(Bristol) Associate Professor in Sustainable ICT, School of Computer ScienceSystems CentreCabot Institute for the Environment https://orcid.org/0000-0002-5290-7443 EmailDaniel.Schienbristol.acuk BS8 1UB Personal profile Research interestsMost of my research aims at improving our understanding of the environmental impact from information and communication technologies (ICT) and the reduction of such impact. My most significant research contributions, so far, have been in the area of the quantifying the direct impact of ICT. I have a deep understanding of the principles that affect energy consumption in Internet-based services. Based on this, my research has pioneered new methods and tools to assess the carbon footprint of digital media which have been applied by major international media companies. I am currently leading the technical development of the DIMPACT tool (http://www.dimpact.org). A growing area of my research focusses on the complex system of interactions between use of ICT services, use of infrastructure and design of ICT services, and in response I apply multidisciplinary methods from software engineering, human computer interaction and environmental science. I also develop infrastructure for sensing of urban environments, in and outside buildings, focussing mainly on energy consumption and air quality. In my teaching, a positive student learning experience is a top priority for me. I draw from my professional experience to create an authentic learning environment that is motivating and effective in preparing our students for their future careers. In our software engineering unit (https://bristol.ac.uk/software-engineering) students build prototypes for a wide set of “clients”, including local not-for-profit organisations from Bristol, all the way to international corporations; and is inviting new project proposals. Research Groups and ThemesCabot Institute City Futures ResearchCabot Institute Low Carbon Energy ResearchBristol Interaction Group Fingerprint Dive into the research topics where Daniel Schien is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Energy Engineering Engineering 100% Energy Consumption Computer Science 65% Video Streaming Engineering 52% Energy Utilization Earth and Planetary Sciences 42% Greenhouse Gas Engineering 41% Illustrates Engineering 41% Environmental Impact Engineering 40% Life Cycle Assessment Engineering 39% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 16 Conference Contribution (Conference Proceeding) 15 Article (Academic Journal) 2 Conference Paper 2 Preprint 4 More 1 Commissioned report 1 Conference Abstract 1 Conference Poster 1 Comment/debate (Academic Journal) Research output per year Research output per year Rethinking Allocation in High-Baseload Systems: A Demand-Proportional Network Electricity Intensity MetricSchien, D., Shabajee, P. J. S. & Preist, C. W., 5 Dec 2022.Research output: Contribution to conference › Conference Paper › peer-review Open AccessFile Energy Consumption 100% Electricity Network 100% Metrics 100% Baseload 100% Environmental Impact 100% 353 Downloads (Pure) Avoiding Overconfidence in Predictions of Residential Energy Demand through Identification of the Persistence Forecast EffectAkyol, H. B., Preist, C. W. & Schien, D., 15 Aug 2022, (E-pub ahead of print) In: IEEE Transactions on Smart Grid. p. 1 1 p.Research output: Contribution to journal › Article (Academic Journal) › peer-review Open AccessFile Historical Data 100% Electricity Consumption 100% Statistical Regularity 100% Energy Demand 100% Demand-Side Management 100% 8 Citations (Scopus) 178 Downloads (Pure) Using behavioural data to assess the environmental impact of electricity consumption of alternate television service distribution platformsSchien, D., Shabajee, P. J. S., Chandaria, J., Williams, D. & Preist, C. W., 1 Nov 2021, In: Environmental Impact Assessment Review. 91, 13 p., 106661.Research output: Contribution to journal › Article (Academic Journal) › peer-review Open AccessFile Environmental Impact 100% Networking Equipment 100% Behavioral Data 100% Electricity Consumption 100% Greenhouse Gas Emission 100% 19 Citations (Scopus) 168 Downloads (Pure) View all 39 research outputs Projects 2 Active 5 Finished Projects per year CQuanDRI: Quantifying the Carbon Emissions of Digital Research InfrastructureSchien, D. (Principal Investigator)1/09/22 → 31/01/23Project: Research CANDISE: Change-Oriented Assessments for Net-Zero Digital ServicesSchien, D. (Principal Investigator), Bird, C. M. (Researcher) & Shabajee, P. J. S. (Researcher)1/02/24 → 31/01/27Project: Research Software Service 100% Digital Service 100% Information Technology 100% Product System 50% Design Provision 50% CenSoF: ESRC Centre for Sociodigital FuturesHalford, S. (Principal Investigator), Southerton, D. (Co-Investigator), Manchester, H. (Co-Investigator), Evans, D. M. (Co-Investigator), Watson, D. L. (Co-Investigator), Anderson, B. (Co-Investigator), Cater, K. F. (Co-Investigator), Carver, N. (Co-Investigator), Clarke, P. H. (Co-Investigator), Dermott, E. (Co-Investigator), Facer, K. (Co-Investigator), Hauert, S. (Co-Investigator), Liu, W. (Co-Investigator), Liveley, G. (Co-Investigator), McQuillan, D. (Co-Investigator), O'Kane, A. A. (Co-Investigator), Owen, R. (Co-Investigator), Parker, M. (Co-Investigator), Preist, C. W. (Co-Investigator), Schien, D. (Co-Investigator), Sriprakash, A. (Co-Investigator), Milivojevic, S. (Co-Investigator), Hussain, R. (Co-Investigator), Gutierrez Lopez, M. (Researcher), Cheilan, L. (Researcher), Thomas, L. M. (Researcher), Van Isacker, T. (Researcher), Valladares Celis, C. (Researcher), Atkins, E. (Student), Knight, E. W. (Student), Pykett, J. (Co-Investigator), Pitts, H. (Co-Investigator), Williamson, B. (Co-Investigator), Lagedamont, M. (Co-Investigator), Dowse, M. (Researcher), Brand, J. F. (Student), James, R. (Student), Okafo, D. (Student), Horsley, N. (Researcher), Jansen, A. H. (Administrator), Stevenson, T. P. (Other ), Hill, J. M. (Manager), Abu-Aisheh, R. (Researcher), Bo, H. (Researcher), Hemming, R. (Researcher), Huang, L. (Researcher) & Ward, K. J. (Other )1/05/22 → 30/04/27Project: Research, Parent Sociology 100% Justice 100% Social Practice 100% Temporal 100% Climate Change 83% View all 7 projects Datasets Supplementary Data to \"Designing with Digital Waste in Mind: A Typological Analysis to support Sustainable Interaction Design of Digital Services\"Preist, C. (Creator), Widdicks, K. (Creator), Hazas, M. (Creator), Remy, C. (Creator), Rivera, M. B. (Creator), Rigby, J. M. (Creator), Shabajee, P. (Creator) & Schien, D. (Creator), Zenodo, 2023DOI: 10.5281/zenodo.8385852, https://zenodo.org/record/8385852Dataset",
  "content_length": 7202,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:37"
}