{
  "name": "Dan Olteanu",
  "homepage": "http://www.cs.ox.ac.uk/dan.olteanu",
  "status": "success",
  "content": "Dan Olteanu | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleVisiting ProfessorsDan OlteanuDan Olteanu Dan Olteanu Visiting ProfessorE: dan.olteanu@cs.ox.ac.ukThemes:Data, Knowledge and ActionCompleted Projects:MayBMSSPROUTFOXPrOQAWHiPerDNOFDBDBOntoENFRameVADAED3RealPDBsQUINTONInterestsI spend my time understanding hard computational challenges on data processing and designing simple and scalable solutions towards these challenges. I contributed so far to both theoretical foundations and systems aspects of data processing. My theoretical research frequently includes the development of novel data processing algorithms and of data processing languages along with the analysis of their complexities. My systems research is on building data systems in academia and industry based on well-understood theory. Here is a list of my current research projects: Factorised databases: FDB (data compression; query processing with low complexity); F (distributed & parallel machine learning over databases); F-IVM (incremental maintenance of machine learning models and database queries) Probabilistic databases: SPROUT (probabilistic query processing, lifted inference); MayBMS (probabilistic data models, probabilistic query languages); ENFrame (probabilistic programming); Pigora (probabilistic data integration) Datalog engines: With folks@LogicBlox on their database engine, their meta-engine, and a probabilistic extension of Datalog; with Oxford colleagues on RDFox. Past projects to which I contributed as student/co-investigator/principal investigator: DIQOPT: Distributed Query Optimisation G-Store: A Storage Manager for Graph Data SKAR-DB: Managing Square-Kilometer-Array Data SPEX: Streamed and Progressive Evaluation of XPath Agora: Living with XML and Relational Data Research support: Google; EPSRC (QUINTON; DBOnto, Industrial PhD CASE, RealPDBs, VADA); ERC Consolidator Grant (FADAMS); Infor; Ordnance Survey; Amazon Cloud; Cornell; EPSRC (PROQAW, ADEPT); EU FP7 (FOX, HiperDNO); Fondation Wiener Anspach; LogicBlox; Microsoft Azure; Oxford (Astor Travel Fund, Lockey Fund). Resources: Publications Services Talks Teaching Team Biography Since 05/20 Professor of Computer Science, Head of Data Systems and Theory Group, Department of Informatics, University of Zurich Since 09/17 Computer Scientist, RelationalAI (consulting part-time) 07/16 - 05/20 Professor of Computer Science, University of Oxford 08/13 - 08/17 Computer Scientist, LogicBlox (consulting part-time) 08/13 - 07/14 Visiting Associate Professor at University of California, Berkeley (On sabbatical leave from Oxford) 02/12 Received Oxford equivalent of North-American tenure 09/07 - 07/16 Associate Professor (previously University Lecturer) with the Department of Computer Science at the University of Oxford, UK (formerly known as Computing Laboratory) Additional roles at Oxford: Fellow and Director of IT, St Cross College 04/07 - 07/07 Temporary Professor (Lehrbeauftragter), Ruprecht Karl University in Heidelberg, Germany 04/05 - 08/07 Postdoctoral Researcher, Saarland University Information Systems Group (Prof. C. Koch) in Saarbruecken, Germany 09/06 - 12/06 Visiting Scientist, Cornell Database Group in Ithaca, NY state, USA 10/00 - 04/05 Research and Teaching Assistant (wissenschaftlicher Mitarbeiter), PhD student in the Programming and Modelling Languages Group (Prof. F. Bry), Institute for Informatics of Ludwig Maximilian University of Munich, Germany 03/00 - 09/00 Intern Student, Caravel research group of INRIA Rocquencourt, France 08/95 - 08/00 Student in Computer Science (Dipl. Ing.), Polytechnic University of Bucharest, Romania ActivitiesAlgorithms At LargeDatabases Past Students Robert FinkAntonia KormpaMaximilian SchleichBas van SchaikJakub ZavodnyHaozhe ZhangDjordje Zivanovic Past Researchers Ahmet KaraFabian PeternekAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 4124,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:35"
}