{
  "name": "Dan Simovici",
  "homepage": "http://www.cs.umb.edu/~dsim",
  "status": "success",
  "content": "Dan Simovici Dr. Dan A. Simovici Professor of Computer Science University of Massachusetts Boston Department of Computer Science Education Ph.D., July 1974, University of Bucharest, Romania M.S. in Mathematics, June 1970, University of Iasi, Romania M.S. in E.E., June 1965, Polytechnical Institute of Iasi, Romania Professional Affiliations Senior Member of IEEE Vice Chair of the Technical Committee for Multiple-Valued Logic of the Computer Society Association for Computing Machinery AAAI Academic Career 1985 - present: Professor of Computer Science, UMB 2010 - present: Honorary Professor of Computer Science, University of Iasi, Romania January 2006: Visiting Professor of Computer Science, University of Science and Technology, Lille, France 1998: Visiting Professor of Computer Science, Tohoku University, Sendai, Japan 1984 - present: Director of the Computer Science Graduate Program, UMB 1982 - 1985: Associate Professor of Computer Science, UMB 1981 - 1982: Associate Professor of Computer Science, University of Miami, Florida Research Interests Information-Theoretical and Linear Methods in Data Mining Semantic Models in Databases Algebraic Aspects of Multiple-Valued Logic Other Activities Vice-Chair the Program Committees for ISPA'07 for Databases and Data Mining Member of Program Committees for major datamining conferences: KDD, PKDD, DAWAK, EGC. General Chairman of the 32nd International Symposium for Multiple-Valued Logic, Boston, Massachusetts, 15-18 May 2002. Managing Editor of Journal for Multiple-Valued Logic and Soft Computing Editor of International Journal for Parallel, Emergent, and Distributed Systems Editor of International Journal for Software and Information Technologies General Co-Chairman of the 26th International Symposium for Multiple-Valued Logic, Santiago de Compostela, Spain, May 1996. General Chairman of the 24th International Symposium for Multiple-Valued Logic, Boston, Massachusetts, May 1994. Chairman of the Technical Committee of the Computer Society/IEEE (elected at the 19th annual meeting, May 1988, Spain). General Chairman of the 17th International Symposium for Multiple-Valued Logic, Boston, Massachusetts. Reviewer for the Computer Science Accreditation Board of IEEE/ACM. Ph.D. Students Dana Cristofor (graduated 2002) Laurentiu Cristofor (graduated 2002) Szymon Jaroszewicz (graduated 2003) Richard Butterworth (graduated 2006) Selim Mimaroglu (graduated 2008) Saaid Baraty (graduated 2013) Dan Pletea (graduated 2013) Rosanne Vetro (graduated 2015) Paul Fomenky (graduated 2018) Roman Sizov (graduated 2019) Kaixun Hua (graduated 2019) Cristina Maier (graduated 2021) Joshua Yee (graduated 2024) Books Teoria si Practica Bazelor de Date (in Romanian) with Mihaela Breaban and Henri Luchian, Polirom, Bucharest, Romania, 2025 Logical Foundations of Computer Science (with Peter Fejer), two volumes at World Scientific, Singapore, 2024 Introduction to The Theory of Formal Languages, World Scientific, Singapore 2025 Clustering - Theoretical and Practical Aspects World Scientific, 2021 Mathematical Analysis for Machine Learning and Data Mining , World Scientific, 2018 Linear Algebra Tools for Data Mining , World Scientific, 2012 Mathematical Tools for Data Mining , Springer-Verlag 2008 by Dan A. Simovici and C. Djeraba (second edition 2015) Theory of Formal Languages with Applications by Dan Simovici and Richard Tenney, World Scientific, 1999 Relational Database Systems by Dan Simovici and Richard Tenney, Academic Press, 1995 Mathematical Foundations of Computer Science. vol. I: Sets, Relations, Induction in Computer Science (with Peter Fejer), Springer Verlag, New York, 1990 Introduction aux Structures Algébriques, (2 vols.), ERPI, Montreal, Canada, 1992 Formal Languages and Compiling Techniques, Editura Didactica si Pedagogica, Bucharest, Romania, 1978 Recent Publications Exploring Compression as a Proxy for Mineability in LLM-Generated Text (with Cyrus Saadat and Cristina Mayer) accepted at SYNASC 2025. Semantic-Aware Association Rule Mining at Scale: Ontology-Free Generalization with LLMs (with Cyrus Saadat and Cristina Mayer), submitted, August 2025. Dual Criteria Determination of the Number of Clusters in Data (Kaixun Hua), Proceedings of SYNASC 2018, Timisoara, 201-207, Computer Society. Ultrametricity of Dissimilarity Spaces and Its Significance for Data Mining (with R. Vetro and K. Hua), EGC 2015, Luxembourg, Revue des Nouvelles Technologies de l'Information, RNTI E. 28, 89-100 (pdf file) Several Remarks on Dissimilarities and Ultrametrics, Scientific Annals of Computer Science, \"Al. I. Cuza\" University of Iasi, Romania, vol. XXV, 1, 2015, pp. 155-170 (pdf file) Representative Training Sets for Classification and the Variablity of Empirical Distributions (with Saaid Baraty), Extraction et Gestion des Connaisances, February 2014, EGC'2014, Revue des Nouvelles Technologies, E. 26, pp. 299-304 (pdf file) Evaluating Data Minability Through Compression -- An Experimental Study (with Saaid Baraty and Dan Pletea), International Journal on Advances in Software, vol. 6, no.3-4, 2013, pp 237--245 (pdf file) On Submodular and Supermodular Functions on Lattices and Related Stuctures, to appear in the Proceedings of the 44th International Symposium for Multiple-Valued Logic, Bremen, Germany, May 17-19, 2014 (pdf file) Data Mining of Medical Data: Opportunities and Challeges in Mining Association Rules, IALS, Cecilienhof, Potsdam, August 2012 (pdf file) Evaluating Data Minability through Compression - An Experimental Study (with D. Pletea and S. Baraty) - Proceedings of Data Analytics 2012, Barcelona, Spain, September 2012, pp. 97-102 (pdf file) Polarities, Axiallities, and Marketability, DaWaK 2012, Vienna, September 2012 (with P. Fomenky and W. Kurz), LNCS 7448, Springer-Verlag, pp.243-252 (pdf file) Information-Theoretical Mining of Determining Sets for Partially Defined Functions, to appear at the Journal for Multiple-Valued Logic and Soft Computing (with Dan Pletea and Rosanne Vetro) (pdf file) Evaluating Bayesian Networks by Sampling with Simplified Assumptions EGC 2012, Bordeaux, Revue des Nouvelles Technologies de l'Information, RNTI, E.23, pp. 11-16 (with Saaid Baraty) Several Remarks on the Metric Space of Genetic Codes, International Journal of Data Mining and Bioinformatics, vol. 6, 2012, pp. 17-26 (with D. Weisman) (pdf file) Entropic-Genetic Clustering, Revue des Nouvelles Technologies d'Information, Extraction et Gestion des Connaissances, 2011, Brest, France, pp. 71--76 (with M. Breaban and H. Luchian) (pdf file) Approximative distance computation by random hashing (with S. Mimaroglu and M. Yagci), Journal of Supercomputing, appeared in \"On line first\" (to appear in print this Fall, (pdf file) Entropy quad-trees for high complexity region detection (with R. Vetro and W. Ding), IJSSCI, vol. 3, pp. 16-33, 2011. The Impact of Triangular Inequality Violations on Medoid-Based Clustering, Proceedings of ISMIS 2011, (with S. Baraty and C. Zara) Warsaw, Poland, June 2011, Lecture Notes in Artificial Intelligence, LNAI 6804, pp. 280--289, (pdf file) Entropies on Bounded Lattices, Proceedings of the 41st International Symposium for Multiple-Valued Logic, Tuusula, Finland, May 2011, pp. 307--312 (pdf file) Singular value decomposition is a valid predictor of stroke importance in reading Chinese, (with Wang, H.C., Angele, B., Schotter, E., Yang, J., Pomplun, M. and Rayner, K.) Poster at the 16th European Conference on Eye Movements (ECEM2011), Marseille, France. August, 2011. Bernoulli Trials Based Feature Selection for Crater Detections, (with Liu, W. Ding, J. P. Cohen, T. Stepinski) the 19th ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems, Chicago, IL, November, 2011 Mining Determining Sets for Partially Defined Functions (with D. Pletea and R. Vetro), Advances in Data Mining, Lecture Notes in Artificial Intelligence LNAI 5633, Springer-Verlag (pdf file) Scalable pattern mining with Bayesian networks, Data Mining and Knowledge Discovery, (Springer-Verlag), vol. 18, 2009, pp.56-100 (with S. Jaroszewicz and T. Scheffer) (pdf file) Mining Approximative Descriptions of Sets Using Rough Sets (with Selim Mimaroglu), Proceedings of the 39th International Symposium for Multiple-Valued Logic, Okinawa, Japan, May 2009 (pdf file) Binary Sequences and Association Graphs for Fast Detection of Sequential Patterns (with S. Mimaroglu), EGC 2009, Strassbourg, January 2009 (pdf file) Edge Evaluation in Bayesian Network Structures (with Saaid Baraty), Proceedings of the 8th Australian Data Mining Conference (AusDM 2009), Australian Computer Society and ACM, pp. 193-201 (pdf file) Structural Classification of XML Documents Using Multisets (with S. Iyer), International Journal on Artificial Intelligence Tools, vol. 17, no.5, pp.1003-1022 (pdf file) Approximate Computation of Object Distances by Locally-Sensitive Hashing (with S. Mimaroglu), to appear in Proceedings of DBMIN'08, Las Vegas, August 2008 (pdf file) Metric-Entropy Pairs on Lattices, Journal of Universal Computer Science (Springer-Verlag), vol. 13, no.11, 2007,pp. 1767-1778 (pdf file) Betweenness, Metrics and Entropies in Lattices, Proceedings of ISMVL 2008, Dallas, TX, May 2008; the posted version is a pre-print that will appear in the Journal for Multiple-Valued Logic and Soft Computing (pdf file) Detecting Eye Fixations by Projection Clustering (with T. Urruty, S. Lew, N. Ihadaddene) ACM Transactions on Multimedia Computing, Communications and Applications, vol. 3, no.4, December 2007, (pdf file) Metric Methods in Data Mining, a chapter in Data Mining Patterns - New Methods and Applications, P. Poncelet. M. Teisseire, F. Masseglia (eds.), Information Science Reference, Hershey, 2007, pp. 1-31. Structure Inference of Bayesian Networks from Data: A New Approach Based on Generalized Conditional Entropy (with Saaid Baraty), Proceedings of ECG 2008, Sophia Antipolis, France, Revue des Nouvelles Technologies et de l'In",
  "content_length": 22239,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:40"
}