{
  "name": "Dan Alistarh",
  "homepage": "https://ist.ac.at/research/research-groups/alistarh-group",
  "status": "success",
  "content": "ISTA | Alistarh Group HomeResearchAlistarh Group EDUCATION Graduate School Postdocs Internship and Scholarship Program VISTA Science Experiences Alistarh Group Deep Algorithms and Systems Lab (DASLab) Artificial Intelligence has made massive progress over the past decade, with breakthroughs across several applications and tasks. Yet, the sustainability of this pace of progress is in question: the computation required to train and deploy state-of-the-art AI models has been rising exponentially, potentially hindering innovation, and leading to inequalities in terms of expertise and economic benefits. The Alistarh group works to remove these barriers to the democratization of AI, by creating training and inference algorithms that are significantly more efficient than conventional ones. For this, we develop new algorithms for learning over compressed (e.g., sparse or quantized) representations, as well as efficient systems implementations that can leverage compression gains in practice. Group Leader Dan Alistarh Professor +43 2243 9000 2079 Dan.Alistarh@ist.ac.at Administrative Support Christine Francois Assistant to Professors +43 2243 9000 1098 christine.francois-rennhofer@ist.ac.at Team Saleh Ashkboos External student Jiale Chen PhD Student Jiale.Chen@ist.ac.at Vage Egiazarian Postdoc Vage.Egiazarian@ist.ac.at Alexander Fedorov PhD Student alexander.fedorov@ist.ac.at Eugenia Iofinova PhD Student Eugenia.Iofinova@ist.ac.at Eldar Kurtic Research Technician Machine Learning +43 2243 9000 2081 Eldar.Kurtic@ist.ac.at Ionut-Vlad Modoranu PhD Student Ionut-Vlad.Modoranu@ist.ac.at Mahdi Nikdan PhD Student Mahdi.Nikdan@ist.ac.at Andrei Panferov PhD Student Andrei.Panferov@ist.ac.at Sergei Pankratov PhD Student Sergei.Pankratov@ist.ac.at Erik Schultheis Predoctoral Visiting Scientist Erik.Schultheis@ist.ac.at Soroush Tabesh PhD Student soroush.tabesh@ist.ac.at Alexandra Volkova PhD Student Alexandra.Volkova@ist.ac.at Current Projects Efficient Training and Inference for Massive AI Models | Large-scale distributed machine learning | Adaptive concurrent data structures | Fundamental limits of distributed computation Publications Kurtic E, Marques A, Pandit S, Kurtz M, Alistarh D-A. 2025. “Give me BF16 or give me death”? Accuracy-performance trade-offs in LLM quantization. Proceedings of the 63rd Annual Meeting of the Association for Computational Linguistics. ACL: Meeting of the Association for Computational Linguistics, 26872–26886. View Martynov P, Buzdalov M, Pankratov S, Aksenov V, Schmid S. 2025. In the search of optimal tree networks: Hardness and heuristics. Proceedings of the 2025 Genetic and Evolutionary Computation Conference. GECCO: Genetic and evolutionary computation conference, 249–257. View Alistarh D-A, Rybicki J, Voitovych S. 2025. Near-optimal leader election in population protocols on graphs. Distributed Computing. View Talaei S, Ansaripour M, Nadiradze G, Alistarh D-A. 2025. Hybrid decentralized optimization: Leveraging both first- and zeroth-order optimizers for faster convergence. Proceedings of the39th AAAI Conference on Artificial Intelligence. 39(19), 20778–20786. View Jin T, Humayun AI, Evci U, Subramanian S, Yazdanbakhsh A, Alistarh D-A, Dziugaite GK. 2025. The journey matters: Average parameter count over pre-training unifies sparse and dense scaling laws. 13th International Conference on Learning Representations. ICLR: International Conference on Learning Representations, 85165–85181. View View All Publications ReX-Link: Dan Alistarh Career Since 2022 Professor, Institute of Science and Technology Austria (ISTA)2017 – 2022 Assistant Professor, Institute of Science and Technology Austria (ISTA)2016 – 2017 “Ambizione Fellow”, Computer Science Department, ETH Zurich, Switzerland 2014 – 2016 Researcher, Microsoft Research, Cambridge, UK2014 – 2016 Morgan Fellow, Downing College, University of Cambridge, UK2012 – 2013 Postdoc, Massachusetts Institute of Technology, Cambridge, USA2012 PhD, EPFL, Lausanne, Switzerland Selected Distinctions 2023 ERC Proof of Concept Grant2018 ERC Starting Grant2015 Awarded Swiss National Foundation “Ambizione” Fellowship2014 Elected Morgan Fellow at Downing College, University of Cambridge2012 Postdoctoral Fellowship of the Swiss National Foundation2011 Best Paper Award at the International Conference on Distributed Computing and Networking Additional Information Dan Alistarh’s website Back to Top We use cookies on our website. By clicking “Technically Necessary Cookies” no other cookies than cookies that are technically necessary to enable various functionalities of the website (e.g. provide access to the website, display of cookie banner) are enabled. However, you may go to \"Cookie Settings\" to provide a controlled consent.Read more...Cookie SettingsAccept AllTechnically Necessary CookiesManage cookies Close Privacy Overview This website uses cookies. Below you can provide individual consent regarding the use of cookies. Cookies under the category \"necessary\" are always enabled since they are technically necessary to access the website. You can find more information on the use of cookies in the data protection statement of ISTA Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website. CookieDurationDescriptioncookielawinfo-checkbox-analytics1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-necessary1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".CookieLawInfoConsent1 yearThis cookie only appears if you makes changes to the categories (e.g disable the category “Analytics”).pll_language1 yearThe ISTA website is a multilingual website, WordPress requires a default language to be selected and set by a cookie in order to display the website, which is recorded by the pll_language cookie by Polylang. Furthermore this cookie is also used to remember the language selected by the user when returning to the website.viewed_cookie_policy1 yearThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. CookieDurationDescription_pk_id*13 monthsMatomo tracking cookie stores a unique user id._pk_ses*13 monthsMatomo tracking cookie stores a unique session id. SAVE & ACCEPT Powered by",
  "content_length": 6796,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:28"
}