{
  "name": "Dan Witzner Hansen",
  "homepage": "https://pure.itu.dk/portal/en/persons/dan-witzner-hansen(5ad9c220-e37f-443a-8a31-fc4abf365db5).html",
  "status": "success",
  "content": "Dan Witzner Hansen - IT-University of Copenhagen Dan Witzner Hansen offentligt CV Dan Witzner Hansen Professor, Data ScienceHead of Research Group, Machine LearningHead of Programme, BSc in Software Development https://orcid.org/0000-0002-6780-4471 Emailwitzneritudk 20022025 Research activity per year Personal profile CurriculumDan Witzner Hansen investigates to which extend information from images of eyes can be obtained through computationally tractable techniques and how this information can be used in future applications. His focus is  on robust methods for extracting information from the eyes. He investigate how this information can be employed as a part of the next generation of contactless and continuous biometric identification modalities and how it can be used for the general public everyday and out-of-laboratory use. His research covers aspects from computer vision, machine learning, HCI, neuroscience and psychology. Among other things the has contributed to the research in eye-based biometric markers and development of novel and low-cost gaze trackers. These eye trackers have together with novel gaze-based interaction techniques been used for interaction for physically disabled persons with great success. KeywordsImage analysisMachine learningEye trackingGaze interactionSports analysisEye informationPrivacy and security within Eye information Fingerprint Dive into the research topics where Dan Witzner Hansen is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Eye Tracker Keyphrases 100% Eye Tracking Keyphrases 96% Gaze Estimation Keyphrases 83% Gaze Tracking Keyphrases 80% Head-mounted Eye Tracker Keyphrases 66% Head Movement Keyphrases 63% Eye Movements Keyphrases 57% Parallax Error Keyphrases 45% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2003 2008 2009 2010 2011 2013 2014 2017 2025 27 Article in proceedings 13 Book chapter 8 Journal article 6 Patent 9 More 4 Paper 2 Conference abstract for conference 1 Report chapter 1 Review 1 Working paper Research output per year Research output per year Radioactive Eye Information: Guarding Eye-Image Datasets through Radioactive Watermarking for Unauthorized-Use DetectionKovacs, D.-L., Hansen, D. W. & Madsen, I. J. W., 25 May 2025, Proceedings of the 2025 Symposium on Eye Tracking Research and Applications. Association for Computing Machinery, p. 1-6 6 p. 122Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Watermarking 100% Unauthorized Use 100% Watermarked Data 66% Appearance-based Gaze Estimation 20% Experiment Testing 20% The fundamentals of eye tracking part 3: How to choose an eye tracker: The fundamentals of eye tracking part 3: How to choose an eye trackerHansen, D. W., 22 Jan 2025, In: Behavior Research Methods. 57, 67Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access The fundamentals of eye tracking part 4: Tools for conducting an eye tracking studyNiehorster, D. C., Nyström, M., Hessels, R. S., Andersson, R., Benjamins, J. S., Hansen, D. W. & Hooge, I., 6 Jan 2025, In: Behavior Research Methods. 57, 46, 38 p., 46.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Eye Tracking 100% Eye-tracking Study 100% Tracking (Position) 100% Computer 100% Eye Tracker 50% A stroke of genius: Predicting the next move in badmintonIbh, M., Graßhof, S. & Hansen, D. W., Jun 2024, Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR) Workshops. p. 3376-3385 Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Latent Representation 100% Badminton 100% Large Language Model 100% forecasting accuracy 100% Rally 66% Study protocol for the EYEdentify project: An examination of gaze behaviour in autistic adults using a virtual reality-based paradigm: Study protocol for the EYEdentify project: An examination of gaze behaviour in autistic adults using a virtual reality-based paradigmHansen, D. W., C. E. Jeppesen, A., Andresen, J., Parvaiz, R., Clemmensen, L., Møllegaard Jepsen, J. R. & Glenthøj, L. B., Dec 2024, In: MEdRxiv. medRxiv, 22 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access View all 63 research outputs Projects Projects per year 2002 2002 2006 2010 2011 2012 2015 2020 2021 2022 2023 2034 5 Active 8 Finished Projects per year VISCOM: Udvikling af instrumenter til måling af visuelle symptomer ved hjernerystelseHansen, D. W. (PI), Eskildsen, A. M. (CoI) & Kovacs, D.-L. (CoI)The Danish Ministry of Justice01/09/2022 → 30/11/2023Project: Research Eye Tracking 100% Formlets 50% IlearnRW: Integrated Intelligent Learning Environment for Reading and WritingYannakakis, G. (PI), Togelius, J. (PI), Hansen, D. W. (PI) & Canossa, A. (PI)European Commission17/01/2012 → 17/05/2012Project: Research Eyes4ICU: Eyes for Information, Communication, and UnderstandingHansen, D. W. (PI) & Kovacs, D.-L. (CoI)European Commission01/09/2022 → 31/08/2026Project: Research Information Understanding 100% Information Communication 100% Computational Modeling 100% Eye Tracking 75% Technical System 50% Gaze interaction for people with ALSHansen, J. P. (PI) & Hansen, D. W. (CoI)Danish Council for Technology and Innovation24/03/2010 → 01/12/2010Project: Research Gaze Interaction 100% Medical Treatment 100% Cognitive Function 100% Japanese Language 100% Library and Information Science 100% HAND: Identifying Universal Communal Hand Gestures for Virtual and Hybrid Meeting InteractionMunzlinger, E. (PI), Narcizo, F. B. (PI) & Hansen, D. W. (CoI)Innovation Fund Denmark01/10/2023 → 30/09/2026Project: Research Virtual Meetings 100% Meeting Interaction 100% Hybrid Meetings 100% Hand Gesture 100% Kommunikation 100% View all 13 projects Press/Media Nye virtual reality-briller giver etiske udfordringerHansen, D. W.27/11/20231 Media contributionPress/Media: Press / Media Forskning baner vejen for sportsmedaljerHansen, D. W.14/12/20221 Media contributionPress/Media: Press / Media SJÆLENS SPEJL: Afslørende blikkeHansen, D. W.18/02/20221 Media contributionPress/Media: Press / Media Ny ITU-professor forsker i øjets informationerHansen, D. W.16/12/20211 Media contributionPress/Media: Press / Media Bornholmsk professor vil sikre øjets informationerHansen, D. W.15/11/20211 Media contributionPress/Media: Press / Media View all 13 press/media Prizes Best Poster Extended Abstract AwardNarcizo, E. (Recipient), Batista Narcizo, F. (Recipient), Hansen, D. W. (Recipient) & Vucurevich, T. (Recipient), 4 Jul 2024Prize: Prizes, scholarships, distinctions Posters 100% Extended Abstracts 100% United States of America 100% Gesture 100% Gesture Interaction 50% Eye Based Head gesturesHansen, D. W. (Recipient), Mardanbegi, D. (Recipient) & Pederson, T. (Recipient), 2012Prize: Prizes, scholarships, distinctions Activities Activities per year 2023 2023 2023 1 Membership in review committee Activities per year Hiring committee for recruitment of associate professor in Data Science and Machine Learning (Event)Sestoft, P. (Chair), Kulyk, O. (Member) & Hansen, D. W. (Member)5 Jul 2023 → 1 Dec 2023Activity: Membership types › Membership in review committee",
  "content_length": 7827,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:41"
}