{
  "name": "Dan Xu 0002",
  "homepage": "https://www.danxurgb.net",
  "status": "success",
  "content": "Dan Xu - Homepage Dan Xu's Research Page! Home People Publications Research Activities Positions ​ Dan Xu Assistant Professor Department of Computer Science and Engineering Hong Kong University of Sciences and Technology (HKUST) Address: Clear Water Bay, Kowloon, Hong Kong (MAP) Office: Room 3509 (Lift 25-26), Academic Building Homepage: https://www.danxurgb.net or http://www.cse.ust.hk/~danxu Email:  danxu at cse.ust.hk or danxuhk at gmail.com New Events Multiple PhD/MPhil/Postdoc/RA positions available in our lab. Please drop me an email with your CV if you are interested. May 18, 2025: We are organizing ACM MM 2026 in New Jersey, USA. Please let us know if you are interested in contributing tutorials! Nov. 08, 2025: We have two papers (with one Oral) accepted at AAAI 2026. Congrats to my students! Oct. 03, 2025: Check the project page of our HyRF (Hybrid Radiance Fields, appearing at NeurIPS 2025) for highly memory-efficient novel view synthesis. Aug. 24, 2025: Our Switch-NeRF++ for large-scale 3D scene modeling is accepted by TPAMI as a regular paper. Aug. 16, 2025: I am invited to serve as an Area Chair (AC) for CVPR 2026 and ICLR 2026. Jul. 26, 2025: Our CoDAv2 for open-world 3D detection is accepted by TPAMI as a regular paper. Jun 28, 2025: We have four papers (with one highlight) accepted at ICCV 2025. Congrats to my PhD students! May 16, 2025: One paper on VLM/LLM optimization is accepted at ACL 2025 main conference. Congrats to my PhD students! May 01, 2025: We have two papers accepted at ICML 2025. Congrats to my PhD students! Apr. 05, 2025: Two of our accepted papers are selected as Highlights by CVPR 2025. See you at Music City Center in Nashville! Feb. 27, 2025: We have five papers accepted at CVPR 2025. Congrats to my PhD students! We will release the project details soon! Feb. 18, 2025: I am invited to serve as an Area Chair (AC) for NeurIPS 2025 and ACM MM 2025. Jan. 23, 2025: Our collaboration with Apple Research on egocentric video understanding by multi-modal LLMs is accepted at ICLR 2025. Jan. 09, 2025: Congrats to Hanrong and Lewei on their successful defenses. They will join NVIDIA Research in California and Noah's Ark Lab in HK as Research Scientists. Nov. 07, 2024: I am invited to serve as an Area Chair (AC) for ICLR 2025 and ICML 2025. Nov. 01, 2024: Our proposal for Editable 4D Scene Modeling for Video Production has been funded by Innovation and Technology Fund (ITF). Oct. 28, 2024: Invited talk at Embodied AI: Exploring Trends, Challenges, and Opportunities (EMAI) Workshop in Abu Dhabi, UAE. Jul. 02, 2024: We have four papers accepted at ECCV 2024. Congrats to my PhD students! Ci vediamo a Milano! May. 12, 2024: Our MCTformer is accepted at TPAMI as a regular paper. May. 07, 2024: I am invited to serve as an Area Chair (AC) for NeurIPS 2024. It will be held in Vancouver this year. Apr. 25, 2024: Our 4D talking head project is awarded 2024 Tencent Rhino-Bird Focused Research Program (14.3% acceptance rate). Apr. 20, 2024: Our work on joint 2D and 3D scene perception is accepted at TPAMI as a regular paper. Feb. 27, 2024: We have eight papers (two as highlights) accepted at CVPR 2024. Congrats to my students! Details come soon! Dec. 06, 2023: We will be organizing the 34th SIGMM Conference ACM MM 2026 in New Jersey. I will serve as the Tutorial Chair. Nov. 27, 2023: One paper for talking head video generation is accepted at TPAMI. Congrats to my PhD student! The project code is available here. Oct. 29, 2023: I am invited to serve as an Area Chair (AC) at ECCV 2024. Sep. 22, 2023: Our work on open-world 3D object detection is accepted at NeurIPS 2023. Congrats to my PhD student! Project details will be released soon! Jul. 14, 2023: Three papers are accepted at ICCV 2023. Congrats to my PhDs! Project details and papers will be released soon! Jun. 20, 2023: I am invited to serve as an Area Chair (AC) for CVPR 2024. It will be held in Seattle this year. Jun. 05, 2023: I am invited to serve as a Senior Program Committee (SPC) member at AAAI 2024. May. 22, 2023: Our DaGAN project for talking head video generation has received 700+ stars on Github. Apr. 17, 2023: I am invited to serve as an Area Chair (AC) at ACM MM 2023, which will be held in Ottawa, Canada! Mar. 01, 2023: Two papers (one for open vocabulary object detection, and one for language-guided dense object localization) are accepted at CVPR 2023. Congrats to my students! Jan. 21, 2023: Three papers (large-scale scene NeRF, multi-task scene understanding, and cross-domain generation) are accepted at ICLR 2023. Congrats to my students! Jan. 20, 2023: I am invited to serve as an Associate Editor (AE) for Computer Vision and Image Processing (CVIU) Journal. Dec. 19, 2022: One paper is accepted at TPAMI as a regular paper. Nov. 19, 2022: One paper is accepted at AAAI 2023. Contrats to my students! Sep. 15, 2022: One paper on open world object detection is accepted at NeurIPS 2022. Sep. 14, 2022: I am invited to serve as an Area Chair (AC) for CVPR 2023. The review process will be on OpenReview this year. Aug. 20, 2022: I am invited to serve as an Associate Editor (AE) for ICRA 2023. The deadline for submission is Sep. 16, 2022. Jul. 12, 2022: I am invited to serve as a Senior Programme Committee (SPC) for AAAI 2023. The deadline for submission is Aug. 12, 2022. Jul. 03, 2022: Three papers are accepted at ECCV 2022. Congrats to my students! See you in Tel-Aviv! Mar. 27, 2022: One work on incremental semantic segmentation is accepted at TPAMI as a regular paper. Mar. 02, 2022: Three papers are accepted at CVPR 2022. Congrats to my fresh PhD students! Codes and papers will be made publicly available soon! Jan. 27, 2022: I am invited to serve as an Area Chair (AC) for ACM Multimedia (ACM MM 2022). The review process of this year MM will be fully conducted on OpenReview. Jan. 20, 2022: I am invited to serve as an Area Chair (AC) for Asian Conference on Computer Vision (ACCV 2022). Sep. 16, 2021: I will chair the session of Deep Learning for Visual Perception at IROS 2021. Welcome to IROS 2021 online conference! Jul. 27, 2021: I am invited to serve as a Senior Programme Committee (SPC) for AAAI 2022. The deadline for submission is Sep. 08, 2021. Jul. 22, 2021: Two papers including one ORAL (3% acceptance rate) have been accepted by ICCV 2021. The papers and the code will be released soon. Jul. 03, 2021: One paper on weakly-supervised video action localization has been accepted by ACM MM 2021. Jun. 30, 2021: One paper on deep visual SLAM has been accepted by IROS 2021. Mar. 01, 2021: Two works have been accepted by CVPR 2021. Feb. 25, 2021: I have been invited to serve as Area Chair (AC) for ACM MM 2021. Nov. 25, 2020: Our work \"Probabilistic Graph Attention Networks for Pixel-Wise Dense Prediction\" has been accepted by TPAMI 2021 as a regular paper. Sep. 09, 2020: I am appointed to serve as an Associate Editor (AE) for Springer Journal of the Visual Computer, International Journal of Computer Graphics. Jun. 15, 2020: Two papers (1 Oral and 1 Poster) are accepted by CVPR 2020. The papers will come out soon. May. 25, 2020: I am invited to serve as an Area Chair (AC) for ACM MM 2020. May. 10, 2020: I am invited to serve as an Area Chair (AC) for WACV 2021. Mar. 10, 2020: I am invited to serve as Programme Committee member of NeurIPS 2020. Feb. 07, 2020: I am invited to serve as an Area Chair (AC) for ICPR 2020. Aug. 18, 2019: Our \"Dynamic Graph Message Passing Networks\" has been Arxived! It outperforms Non-Local Model with much lower FLOPs! Aug. 10, 2019: Our work of using cycled networks for unsupervised binocular depth estimation has been accepted by TPAMI as a regular paper. Jul. 22, 2019: We have two papers accepted by ICCV 2019. The papers will come out soon. Jul. 3, 2019: Our work ''Geometry-Aware Video Object Detection for Static Cameras'' has been accepted at BMVC 2019 as an ORAL. Jul. 3, 2019: Our \"Cycle in Cycle Generative Adversarial Networks for Keypoint-Guided Image Generation\" is acepted at ACM MM 2019 as an ORAL. Mar. 3, 2019: Our work on Semantic Guided Cross-View Traslation is accepted at CVPR 2019 as an oral. The project page and GitHub code are available now. Aug. 1, 2018: The training and testing code for Structured Attention Guided Convolutional Neural Fields for Monocular Depth Estimation is available. Jun. 18, 2018: The code for Group Consistent Similarity Learning via Deep CRFs for Person Re-Identification is available. Jun. 1, 2018: One paper is accepted at ACM MM 2018 as an oral. Mar. 11, 2018: One paper is accepted at TPAMI 2018 as a regular paper. Feb. 02, 2018: Four papers including one oral and one spotlight are accepted at CVPR 2018. Sep. 04, 2017: One paper is accepted at NIPS 2017 which will be held in Long Beach, USA. Jul. 10, 2017: We published the code for continuous CRFs as sequential neural network associated with our CVPR 2017 spotlight paper on GitHub. Mar. 10, 2017: The code for learned Top-K Global Pooling published at CVPR 2017 is available on GitHub. Feb.27th, 2017: One spotlight and two posters are accepted at CVPR 2017. Dec. 6th, 2016: Our paper received the Best Scientific Paper Award at ICPR 2016. Research Highlights About Me Greetings! My name is Dan Xu. I am currently an Assistant Professor in the Department of Computer Science and Engineering at HKUST. I was a Postdoctoral Research Fellow in the Visual Geometry Group (VGG) in the Department of Engineering Science at the University of Oxford, under the supervision of Prof. Andrea Vedaldi and Prof. Andrew Zisserman. I received my Ph.D. in Computer Science from the University of Trento in 2018, under the supervision of Prof. Nicu Sebe in Multimedia and Human Understanding Group (MHUG). I was a student research assistant in MMLab and the Department of Electronic Engineering at The Chinese University of Hong Kong under the supervision of Prof. Xiaogang Wang. My research interests mainly lie in computer vision, multimedia, and deep learning. Speci",
  "content_length": 12341,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:39"
}