{
  "name": "Danai Koutra",
  "homepage": "http://web.eecs.umich.edu/~dkoutra",
  "status": "success",
  "content": "Danai Koutra - Associate Professor Bio CV Service Teaching Videos Lab Danai Koutra pronounced: dah-NYE Associate Professor Amazon Scholar Computer Science & Engineering Computational Medicine and Bioinformatics (affiliated) University of Michigan, Ann Arbor 3753 Bob and Betty Beyster bldg E-mail: dkoutra@umich.edu Work: (+1) 734-764-4237 From social and collaboration networks to brain activity and web search, much of today's data is naturally structured and often best represented as a graph. I develop machine learning and data mining methods that leverage this structure to detect patterns, summarize information, and improve predictions. My research explores questions such as: How should structure be encoded to be most useful for learning? When does it complement other modalities like language or vision and how can we combine them effectively? What happens when models fail to capture or exploit the underlying structure? And how can we learn robustly from messy, noisy, or incomplete structured data? I apply these ideas across domains including recommendation systems, neuroscience, biomedical applications, knowledge graph reasoning, and multimodal learning with large language and vision models, aiming to build AI systems that are fast, interpretable, and resilient to the complexities of real-world data. For publications, please check DBLP, Google Scholar, and preprints on Arxiv. For recent projects, visit the GEMS Lab webpage and our github repository! We typically include links to project code and benchmarks in the corresponding papers. Research Interests: AI, graph mining, graph machine learning, data mining, graph neural networks, network representation learning, network neuroscience, summarization, network similarity, network alignment, mining time-evolving and streaming data, graph anomaly and event detection Advising: The GEMS Lab is recruiting motivated and hard-working students interested in graph learning and mining, and multimodal learning. If you are interested in joining the group as a PhD student and you are not already at the University of Michigan, please apply to CSE (deadline in December). If you are an undergrad or grad student at UM, and you are interested in any of our recent work, send an email with your interests and CV to gemslab-opportunities@umich.edu. Responses may be slow (please do not take it personally!), depending on availability of positions. Selected Awards [top] Presidential Early Career Award for Scientists and Engineers (PECASE), 2025 IBM Early Career Data Mining Research Award, 2024 IEEE ICDM Tao Li Research Award, 2023 IEEE ICDM Test-of-Time Award, 2022 ACM SIGKDD Rising Star Award, 2020 Best Student DM Paper Award, ECML-PKDD, 2020 NSF CAREER Award, 2019 Best Student Paper Award, IEEE ICDM, 2019 ARO Young Investigator Award, 2018 ACM SIGKDD Dissertation Award, 2016 SCS Doctoral Dissertation Award, Honorable Mention, CMU, 2015 Best Paper Runner-up Award, EDBT/ICDT, 2018 Best Paper Nominee, SDM, 2014 Best Student Paper Runner-up Award, PAKDD, 2014 Key Service [top] Program Co-Chair, Survey Track, IJCAI 2025 Program Co-Chair, ACM SIGKDD 2024 Program Co-Chair, ECML/PKDD 2023 Track Co-Chair, The Web Conference 2022 Co-Chair, Deep Learning Day, KDD 2022 Associate Director, Michigan Institute for Data Science (MIDAS), 2021-2023 Secretary, SIAM Activity Group on Data Science (SIAG/DS), 2021 Associate Editor, ACM Transactions on Knowledge Discovery from Data (TKDD), since 2017 Teaching [top] EECS 476 - Data Mining: Winter 2025, Winter 2020, Fall 2018, Fall 2017 EECS 576 - Advanced Data Mining: Fall 2025, Fall 2024, Fall 2019 EECS 598 - Advanced Data Mining / Mining Large-Scale Graph Data: Winter 2019, Winter 2018, Fall 2016, Fall 2015 EECS 484 - Database Management Systems: Winter 2017, Winter 2016 Bio [top] Danai Koutra is an Associate Professor in Computer Science and Engineering at the University of Michigan, where she leads the Graph Exploration and Mining at Scale (GEMS) Lab. She is also an Amazon Scholar. Her research focuses on principled, practical, and scalable methods for large-scale real networks, and her interests include graph learning, graph neural networks, graph summarization, knowledge graph mining, graph learning, similarity and alignment, and anomaly detection. She has won a Presidential Early Career Award for Scientists and Engineers (PECASE), an NSF CAREER award, an ARO Young Investigator award, the 2024 IBM Early Career Data Mining Research Award, the 2023 Tao Li Award, the 2020 SIGKDD Rising Star Award, research faculty awards from Google, Amazon, Facebook and Adobe, a Precision Health Investigator award, the 2016 ACM SIGKDD Dissertation award, and an honorable mention for the SCS Doctoral Dissertation Award (CMU). She holds a patent on bipartite graph alignment, and has multiple papers in top data mining conferences, including 9 award-winning papers and the 2022 IEEE ICDM Test-of-Time Award. She is Program co-Chair for ACM KDD 2024 and an Associate Editor of ACM TKDD. She was a Program co-Chair for ECML/PKDD 2023, a track co-chair for The Web Conference 2022, a co-chair of the Deep Learning Day at KDD 2022, the Secretary of the new SIAG on Data Science in 2021, and has also routinely served in the organizing committees of all the major data mining conferences. She has worked at IBM, Microsoft Research, and Technicolor Research. She earned her Ph.D. and M.S. in Computer Science from CMU, and her diploma in Electrical and Computer Engineering at the National Technical University of Athens. Video Overviews [top] Fun videos summarizing some of our KDD papers: Knowledge Graph Summarization (ICDM 2019) GroupINN: Interpretable Brain Data Classification (KDD 2019) Latent Network Summarization (KDD 2019) Smart Roles in Email Networks (KDD 2019) PNP: Movie Design via Paths (KDD 2017) Career Transitions in Computing (KDD BigScholar) Affiliations: Funding Sources: Past: Copyright © Danai Koutra Last Modified on 08/06/2015.",
  "content_length": 5972,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:46"
}