{
  "name": "Dana Randall",
  "homepage": "http://people.math.gatech.edu/~randall",
  "status": "success",
  "content": "Dana Randall's Home Page Dana Randall Associate Dean for Access and Advancement, College of Computing Regents' Professor, School of Computer Science Adjunct Professor, School of Mathematics Georgia Institute of Technology Ph.D., University of California, Berkeley, Computer Science, A.B., Harvard University, Mathematics. Contact info Publications Recent Activities Lecture Notes Talks Short C.V. Stupid things I do Research interests:; Randomized algorithms Markov chain Monte Carlo Computational problems from statistical physics Combinatorics Distributed algorithms and collective computation Major roles and activities: PI on ARO Multidisciplinary University Research Initiative (MURI) on Formal Foundations of Emergent Computation, 2019--2024. Co-founder and co-executive director: Institute for Data Engineering and Science (IDEaS), 2016--19. Director, Algorithms and Randomness Center, 2014--16. ADVANCE Professor of Computing, 2011--2021. Co-Chair of the Organizing Committee, SIAM Conference on Discrete Mathematics, July 2016. Chair of the Progam Committee, ACM/SIAM Symposium on Discrete Algorithms, January 2011. PhD students: Russell Martin, Ph.D. 2001, University of Liverpool. Nayantara Bhatnagar, Ph.D. 2007, University of Delaware. Sam Greenberg, Ph.D. 2008, Department of Defense. Amanda Pascoe Streib, Ph.D. 2012, Center for Computing Sciences. Sarah Miracle, Ph.D. 2015, University of St. Thomas. Prateek Bhakta., Ph.D. 2016, University of Richmond. Sarah Cannon, Ph.D. 2018, Claremont McKenna College. Matthew Fahrbach, Ph.D. 2019, Google Research. Bahnisikha Dutta, Ph.D. 2021, Roca Robotics. Zhanzhan Zhao, Ph.D. 2023, Shenzhen University. Shunhao Oh, Ph.D. 2025. In the news: NSF Math Insts Highlights: First rigorous validation of rattling. June 2025. ACM-W: Interview for ACM-W News. June 2025. Phys.org: New theory identifies how physics principle of 'rattling' relates to self-organization. October 2024. Georgia Tech News: Rattling physics with new math. October 2024. I Programmer: There's a new swarming robot on the block, May 2021. Georgia Tech News: Simple Robots Smart Algorithms, April 2021. Design News: Individually, these robots are dumb. But when they work together? Awesome!, May 2021. Georgia Tech News: Researchers awarded 6.25 million to study collective emergent behavior, April 2019 Arizona State University News: MURI award brings ASU to the forefront of emergent computation, April 2019. Georgia Tech Alumni Magazine : Stronger together (on ADVANCE) , October 2018. Scientific American: ''Smarticle'' Robot Swarms Turn Random Behavior into Collective Intelligence\">, February 2018. Quanta Magazine: Smart Swarms Seek New Ways to Cooperate, Feb 2018. The Technique: In the classroom with Dana Randall, June 2017. GT Research Horizons: Data Driven: How Traditional Research is Being Rebooted, September 2016. Godel's Lost Letter (Dick Lipton's blog): A creeping model of computation, September 2016. Verge Magazine: 2009 Arnold Ross Lecture at the Augusta Science Center., October 2009. Useful links: Theory group at Georgia Tech Algorithms, Combinatorics and Optimization Algorithms and Randomness Center Contact information: 2140 Klaus Advanced Computing Building College of Computing Georgia Institute of Technology Atlanta, GA 30332-0765 (404)-894-3156 (cs. dept. phone) (404)-894-6300 (fax) randall at cc dot gatech dot edu",
  "content_length": 3374,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:48"
}