{
  "name": "Danaë Metaxa-Kakavouli",
  "homepage": "https://metaxa.net",
  "status": "success",
  "content": "Danaé Metaxa Danaé Metaxa Ελληνικά: Δαναός Μεταξάς Raj & Neera Singh Assistant Professor Computer & Information Science University of Pennsylvania News 06/2025 - I'm extremely happy to announce that I was awarded an NSF CAREER award! 01/2025 - Name spelling change: ë -> é 11/2024 - Dr. Sorelle Friedler and I are looking for a postdoctoral scholar for an 18-mo postdoc on civil rights AI audits. (Call closed; welcome Emma!) 06/2024 - I will be one of the General Chairs for FAccT 2025, in Athens, Greece. 04/2024 - All four (!) of PennHCI's NSF GRFP applicants were funded this year! Huge congratulations to our PhD students Princess, Ro, Hita, and post-bac RA (incoming Harvard PhD student) Lena. Bio Danaé Metaxa is Raj and Neera Singh Term Assistant Professor at the University of Pennsylvania in the Computer and Information Science department, with a secondary appointment in the Annenberg School for Communication. Dr. Metaxa is co-founder (along with Andrew Head) of the Penn HCI group, and executive committee member of Penn’s Center for Media, Technology, and Democracy. In their research, Dr. Metaxa studies bias and representation in algorithmic systems and content, focusing on high-stakes social settings like politics, employment, and advertising, and on marginalized groups. Prior to joining Penn, Dr. Metaxa received a Ph.D. in Computer Science at Stanford University, working in the Stanford HCI Group and the Center on Philanthropy and Civil Society’s Program on Democracy and the Internet. PhD Students and Postdocs Emma Lurie, Postdoctoral scholar Alejandra Regla-Vargas, Postdoctoral scholar Ro Encarnación, PhD student Stephanie Wang, PhD student Princess Sampson, PhD student Mialy Rasetarinera, PhD student (co-advised with Konrad Kording) Other Students I also work closely with a number of other students, including: Luis Morales-Navarro, Penn Graduate School of Education PhD student Daniel J. Noh, Penn Graduate School of Education PhD student Lena Armstrong, Penn ‘23 and Harvard CS PhD student Kowe Kadoma, Cornell Tech Information Science PhD student Penn and Prospective Student FAQs If you’re a student (at Penn or elsewhere) with a question related to my teaching or research, please make sure to read my FAQ before sending an email. Teaching Fa 2025 - CIS700: Algorithmic Justice (website TBA) Fa 2024 - CIS412/512: Human-Computer Interaction Sp 2024 - CIS700: Algorithmic Justice Fa 2023 - CIS412/512: Human-Computer Interaction Sp 2023 - CIS700: Algorithmic Justice Fa 2022 - CIS399: Human-Computer Interaction Sp 2021 - CS347: Human-Computer Interaction Research (co-taught with Parastoo Abtahi)",
  "content_length": 2635,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:46"
}