{
  "name": "Dana Habeeb",
  "homepage": "http://danahabeeb.com",
  "status": "success",
  "content": "Dana Habeeb - Environmental Planning and Urban Climatology Working to mitigate the impacts of climate change on vulnerable populations, empowering communities to improve their air quality, and identifying and planning for environmental challenges brought on by climate change. These are forces of change that my research impacts. I investigate climate responsive design techniques at both the city and the neighborhood scales to help cities become more resilient in the face of climate change. My research examines the relationship between urban agriculture, urban form, and urban heat by investigating ways to integrate urban agriculture into the fabric of American cities. I aim to investigate design techniques that make ecological processes visible to urban residents through the use of distributed infrastructure and multipurpose green infrastructure. I further explore the intersection of environmental sensing and community empowerment and look forward to using everyday pervasive technologies to help individuals turn their local environmental data into knowledge. \"I fundamentally believe that it is essential for everyone to have access to local environmental information and be provided with an understanding of how their environment impacts their health.\" To that end, my work focuses on generating new types of environmental data and making those data comprehensible and available to the public with the goal of catalyzing action to improve the environmental health and wellness of citizens. From data to knowledge to action, my aim is to demonstrate that providing access to environmental information can empower communities to collectively engage with and improve their environmental health and wellness I am an Assistant Professor at Indiana University's School of Informatics, Computing, and Engineering. My research explores strategies that make cities more sustainable and resilient in the face of climate change and other environmental challenges. With my design background, I bring a spatial perspective to analyzing environmental data and develop creative solutions to environmental challenges. My strength as a researcher is in the ability to work across multiple disciplines, from climate science to public health to design to public policy, in order to develop and evaluate innovative solutions to complex environmental problems facing our cities and communities. I have conducted CDC, NSF, EPA, and non-profit supported research in climate change, public health, and urban food systems. My current research focuses on making environmental data visible, accessible, and understandable to local communities with the goal of empowering residents to take ownership of their environment, their community, and their environmental health. Class Schedule Smart Cities T/TH 11:30-12:50 Office Hours Wednesdays 3:00-4:30 Contact Information Informatics East 261919 E 10th StBloomington, IN 47408dhabeeb@indiana.edu Recent News NPR on Beat the Heat Dr. Habeeb talks with NPR about her Beat the Heat program and ways communities can protect their residents during extreme heat events. 2021 UHI Mapping Campaign Webinar Dr. Habeeb joins heat relief coordinators from Richmond and Clarksville Indiana to talk about their results from NOAA's heat mapping campaign and how this data will be integrated into their Beat the Heat project. Beat the Heat Program Beat the Heat Program 2 Beat the Heat Program 3 Beat the Heat Program 4 Beat the Heat Program 5 Partnering with OCRA and IU's ERI, Dr. Habeeb is the PI on a new grant supporting Indiana communities through the Beat the Heat program. Extreme Heat in the Midwest. Dr. Habeeb talks with Courier & Press about extreme heat in the Midwest and what citeis can do mitigate the urban heat island effect. Cites Need to Prepare for Extreme Heat. Dr. Habeeb talks with News and Tribune about increasing heat waves and the importance for communities to plan for extreme heat. NPR on Beat the Heat Program Dr. Habeeb talks with NPR about the Beat the Heat program and working with local communities to design heat response plans. Extreme Heat & Vulnerable Populations Dr. Habeeb talks to the IndyStar about extreme heat in Indianapolis and how to protect those who are most vulnerable to extreme heat. The Indiana Green City Mapper Dr. Habeeb talks to the Herald Times about the importance of connecting Hoosier communities with green infrasturcutre and climate data. Climate Change and Resilience in Indiana and Beyond Indiana Press announces the new book Climate Change and Resilience in Indiana and Beyond where Dr. Habeeb is a co-author for two chapters . Extreme Heat in Cities Dr. Habeeb talks to the IndyStar about the dangers of extreme heat and how cities elevate heat exposures. IU's Racial Justice Grant Dr. Habeeb is a Co-PI on a newly awarded racial justice grant investigating the equitable distribution of tree canopy across Indiana. GT Scholar Dr. Habeeb is recognized as a Grant Thorton-IDEA Scholar for Luddy. Heat Waves and COVID-19 Dr.Habeeb is featured in a Bloomberg Law article on summer heat waves and those most at-risk of COVID-19. Sustainability Course Development Fellowship. Dr.Habeeb is awarded IU's catalyst award for excellence in teaching by the IU Office of Sustainability for her Environmental Policy, Health, and Design course. Social Justice and Equity in the Engineering of Smart and Connected Cities. Dr.Habeeb is an invited panelist and presenter the NSF Smart & Connected Workshop for the NSF-funded SCC-RCN project entitled, MOHERE: Mobility, Health, and Resilience: Building Capacities and Expanding Impact. NSF CISE Research Initiation Initiative (CRII) Dr.Habeeb is awarded the NSF CRII grant for her work on using environmental sensing to understand local heat exposure and response. SICE junior faculty earn NSF awards Dr.Habeeb is awarded the NSF CRII grant for her work on using environmental sensing to understand local heat exposure and response. Heat wave research highlighted in latest National Climate Assessment Dr. Habeeb's research on Heat Wave Trends was used as a climate change indicator for the 4th National Climate Assessment Report released by the US Federal Government on November 23, 2018. Big Talk! w/ Michael Glab- Dana Habeeb Michael Glab speaks with Indiana University Dr. Dana Habeeb about her research on urban heat islands on this week’s edition of Big Talk! . Sea Level Rise Report Dr. Habeeb's Georgia Tech Studio report is included in Georgetown's Climate Center's Adaptation Clearinghouse, an online database to help communities prepare for climate change.",
  "content_length": 6589,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:42"
}