{
  "name": "Dana Dachman-Soled",
  "homepage": "https://ece.umd.edu/~danadach",
  "status": "success",
  "content": "Dana (Glasner) Dachman-Soled Dana (Glasner) Dachman-Soled Associate Professor Department of Electrical and Computer Engineering and UMIACS Department of Computer Science (affiliate) Institute for Systems Research (ISR) (affiliate) University of Maryland Iribe 5238 Iribe Center for Computer Science and Engineering 8125 Paint Branch Dr. College Park, MD 20742 Phone: (301) 405-9927 Email: danadach at umd dot edu Research | Research Highlights | Students | Publications | Teaching | Professional Activities About Me I am an associate professor in the Department of Electrical and Computer Engineering at the University of Maryland, College Park and a core faculty member of the Maryland Cybersecurity Center. I am supported in part by NSF, including an NSF CAREER award, and a Ralph E. Powe Junior Faculty Enhancement award. I am, or have been, supported in part by NIST, Cisco, Intel, JP Morgan, and Amazon. I am also the recipient of a Summer 2016 Research and Scholarship (RASA) award. Prior to joining University of Maryland, I spent two years as a postdoc at Microsoft Research New England. Before that, I completed my PhD at Columbia University under the supervision of Prof. Tal Malkin. Here is my CV (March 2025). Here is my Google Scholar page. Research Interests My research interests are in cryptography, complexity theory and security. I have broad interests in cryptography including post-quantum cryptography, non-malleable codes and extractors, secure multiparty computation, and black-box complexity. I am also interested in privacy preserving machine learning, complexity-theoretic cryptography, and side-channel attacks. Research Areas of Focus and Recent Highlights Post-Quantum Cryptography. Post-quantum cryptography refers to classical cryptographic protocols that are secure even against a quantum adversary. Cryptography based on lattice assumptions, such as learning with errors (LWE), is one of the most promising avenues for obtaining post-quantum cryptography. In two recent works LWE with Side Information: Attacks and Concrete Security Estimation. D. Dachman-Soled, L. Ducas, H. Gong, M. Rossi. CRYPTO 2020. eprint version Revisiting Security Estimation for LWE with Hints from a Geometric Perspective. D. Dachman-Soled, H. Gong, T. Hanson, H. Kippen. CRYPTO 2023. ePrint version we developed publicly available toolkits (Leaky LWE GitHub, Geometric LWE GitHub) that provide estimates for the concrete security of lattice-based cryptosystems when side information is incorporated. Specifically, the toolkit provides scripts to automatically analyze the performance of so-called \"lattice reduction algorithms\" when side-information is available. The side information handled by the toolkit includes various types of side-channel information, as well as structural information that is present in some cryptosystems that are candidates in NIST's ongoing post-quantum standardization effort. Thus, the toolkit allows one to determine the quantitative impact of the side information on the concrete hardness of the cryptosystem. The difference between the two toolkits is that the first toolkit assumes leakage on the LWE secret/error can always be well-approximated by a multivariate Gaussian distribution and uses this assumption to exactly compute the conditional probability distribution on the LWE secret/error as information is leaked. The second toolkit instead views leakage from a geometric perspective. Specifically, the original confidence region for the LWE secret/error is well-approximated by an ellipsoid. Subsequently, leakage (e.g. from decryption failures) provides the information that the LWE secret/error lies on one side of a hyperplane (i.e. is contained in a halfspace). This means that we know that the LWE secret/error lies in the intersection of the ellipsoid and the halfspace. We must always maintain the invariant that the LWE secret/error is known to lie inside an ellipsoid. However, the intersection of the ellipsoid and halfspace may no longer be an ellipsoid. Therefore we approximate the intersection of the ellipsoid and halfspace by circumscribing it with an ellipsoid of reduced volume (as shown in the picture). This process can be repeated iteratively. We can also deal with intersections of ellipsoids with other convex bodies, which can capture other types of leaked information. We applied and extended the techniques from the two toolkits in these works: Revisiting the Security of Approximate FHE with Noise-Flooding Countermeasures. F. Bergamaschi, A. Costache, D. Dachman-Soled, H. Kippen, L. LaBuff, R. Tang. PKC 2025, to appear. ePrint version When Frodo Flips: End-to-End Key Recovery on FrodoKEM via Rowhammer. M. Fahr Jr., H. Kippen, A. Kwong, T. Dang, J. Lichtinger, D. Dachman-Soled, D. Genkin, A. Nelson, R. Perlner, A. Yerukhimovich, D. Apon. CCS 2022, RWC 2023. ePrint version CCS 2022 Best paper honorable mention The first paper above applies our techniques to the fully homomorphic encryption (FHE) setting. In this setting, the added challenge is that due to extremely high matrix dimension (up to 200K x 200K), the estimation algorithms given in the Toolkit become infeasible, and new estimation techniques had to be developed. The second paper above combines techniques from the toolkit with a side-channel attack known as \"Rowhammer\" to provide an end-to-end key recovery attack on FrodoKEM, a Round 3 NIST PQC candidate. Research supported in part by NSF grants #CNS-1453045 (CAREER), and #CNS-2154705, by financial assistance awards 70NANB15H328 and 70NANB19H126 from the U.S. Department of Commerce, National Institute of Standards and Technology, and by Intel through the Intel Labs Crypto Frontiers Research Center. Privacy-Preserving Machine Learning. When training a machine learning model using fully homomorphic encryption (FHE) or multiparty computation (MPC), continuous real functions are often replaced with a polynomial approximation to allow for compatibility with the underlying FHE or MPC ring structure. In our work Bounding the Excess Risk for Linear Models Trained on Marginal-Preserving, Differentially-Private, Synthetic Data. Y. Zhou, M. Liang, I. Brugere, D. Dachman-Soled, D. Dervovic, A. Polychroniadou, M. Wu. ICML 2024, to appear. arXiv version we employed the theory of polynomial approximation of continuous functions for a different purpose. Specifically, we considered machine learning models of the form φ(<w,x>), where φ is an activation function, w are the model weights, and x is the datapoint. For example, in a logistic regression model, φ is the Sigmoid function and can be well-approximated by a degree-3 polynomial, as shown in the picture. The loss function itself for logistic regression can also be expressed in the form Σ ψ(<w,xi>) for some other continuous function ψ. We consider synthetic data that is differentially private and marginal-preserving. The fact that the synthetic data is differentially private means that it can be safely stored and computed on without violating the privacy of individuals who contributed to the dataset. The fact that the synthetic data is marginal-preserving means that the distribution over all small subsets of attributes is (approximately) preserved. Generation of such synthetic data is well-studied in the differential privacy literature. In our work we ask what happens when one tries to train a machine learning model on such synthetic data. Specifically, we investigated the excess loss when training on such synthetic data versus when training on the real dataset. Using fundamental theorems on approximation of continuous functions via low-degree polynomials (such as Bernstein polynomials), we were able to theoretically upper bound this excess loss. The key observation is that marginal-preserving synthetic data will achieve exactly the same loss as the real data with respect to the polynomial approximation.Thus, the main task becomes bounding the excess loss when training the real (resp. synthetic) data using the Bernstein approximation versus the true loss function. We were also able to prove matching lower bounds by showing that lower bounds for non-adaptive learning algorithms in the statistical query (SQ) model can be applied to our setting. In ongoing work we are investigating convergence and other guarantees when training using polynomial approximations. Such guarantees have previously have been heuristic/experimental only. This analysis will provide provable guarantees on convergence and excess loss when training machine learning models in the FHE and MPC settings. Research supported in part by JPMorgan Chase Faculty Research Awards 2021 and 2024, and by a joint NSF and Amazon grant #IIS-2147276. Complexity-Theoretic Cryptography. Derandomization techniques have been used in complexity theory to prove results such as BPP = P, under appropriate hardness assumption. Nisan and Wigderson first showed such a result by constructing a pseudorandom generator (PRG) that has a short seed, is computable in polynomial time and is hard to distinguish from random for bounded polynomial time adversaries, under the assumption that the complexity class E contains problems that are hard for exponential size circuits. Their key technique for constructing such a PRG was constructing a combinatorial design (a slightly different combinatorial design is shown in the picture). This design consists of a large (typically super polynomial number of subsets), where each subset contains elements from a polynomial (or logarithmic) size universe, the size of each subset is polynomial (or logarithmic), and yet every pair of subsets has an intersection of size at most constant (or logarithmic). In a sequence of works, we used derandomization techniques and combinatorial designs in particular to obtain a broad range of results across different areas of cryptography. Some examples include: Uniform Black-Box Separations via Non-Malleable Extractors. M. Ball, D. Dachman-Soled. CRYPTO 2025, to appear. ",
  "content_length": 25683,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:46"
}