{
  "name": "Dang Tuan Nhon",
  "homepage": "http://www.myweb.ttu.edu/tnhondan",
  "status": "success",
  "content": "Tommy Dang: Homepage Tommy Dang Associate Professor Department of Computer Science Texas Tech University Phone: 806-319-3156 Email: tommy.dang [at] ttu.edu Activities Projects Teaching Publications Home ABOUT I am an associate professor and director of the interactive Data Visualization Lab (iDVL) at Texas Tech University. RESEARCH INTERESTs Developing methods and tools for visual analytics - an integrated approach combining visualization, human factors and data analysis to derive insight from massive, dynamic, and ambiguous data. EDUCATION 2010-2014: Phd in Computer Science, University of Illinois at Chicago. My PhD advisor was Prof. Leland Wilkinson 2008-2009: M.Sc. in Computer Science, University of Illinois at Chicago 2006-2008: M.Sc. in Computer Engineering, Politecnico di Milano, Italy 2001-2006: B.Sc. in Computer Science, University of Technology, Vietnam WORK EXPERIENCE 2024-Present: Associate Professor at Texas Tech University, Lubbock, Texas 2016-2024: Assistant Professor at Texas Tech University, Lubbock, Texas 2014-2016: Postdoctoral researcher at Electronic Visualization Laboratory, Chicago 2017-2018: Consultant in computational visualization for Wave Computing, Santa Clara, CA 2015-2016: Consultant in network visualization for Objectivity Inc., San Jose, CA 2014-2015: Consultant in data visualization for Skytree Inc. - The Machine Learning Company 2008-2014: Research assistant in the Computer Science Department at University of Illinois at Chicago SELECTED JOURNAL PUBLICATIONS 2016: [J5] Tuan Dang, Nick Pendar, and Angus Forbes. TimeArcs: Visualizing Fluctuations in Dynamic Networks. Computer Graphics Forum 35(3), EuroVis 2016. DOI 2014: [J4] Tuan Dang and Leland Wilkinson. Transforming Scagnostics to Reveal Hidden Features. IEEE Transactions on Visualization and Computer Graphics 20(12), VAST 2014. DOI 2012: [J3] Tuan Dang, Anushka Anand, and Leland Wilkinson. TimeSeer: Scagnostics for High-Dimensional Time Series. IEEE Transactions on Visualization and Computer Graphics 19(3), TVCG 2012. DOI 2010: [J1] Tuan Dang, Leland Wilkinson, and Anushka Anand. Stacking Graphic Elements to Avoid Over-Plotting. IEEE Transactions on Visualization AndComputer Graphics 16(6), InfoVis 2010. DOI INVITED TALKS 2021,2022,2023,2024: Introduction to Computer Science. WCOE 2022 Summer Camp. Faculty talk 2022: Data visualization and applications. Data Science Summer Workshop. Sam Houston State University , TX 2021: Multivariate time series Analysis. Distinguished Computer Science Colloquium. New Mexico Tech, NM 2020: Visual Analytics for high-dimensional and time-series. Spring 2020 NSF CAC Industry Advisory Board. Keynote Speech (Online) 2020: Multidimensional Time Series Visualization. TTU Computer Science departmental seminars. Lubbock, TX 2020: Introduction to Computer Science. WCOE 2020 Summer Camp. Faculty talk (Online) 2019: Visual analytics and Virtual Reality. The Cognition & Cognitive Neuroscience area of Experimental Psychology. Lubbock, TX 2018: VR and AR in Unity. Lab Innovations with Technology. Webinar with Cal State faculty 2018: Data-center Automation, Analytics, and Control with Redfish. Dell EMC booth. Kay Bailey Convention Center Dallas, TX Giving a talk at Dell EMC booth 2018: Visualizing, Monitoring, and Automating Data Centers. Fall 2018 NSF CAC Industry Advisory Board Meeting. Denton, TX 2017: Visualizing Biological Pathways. Bio-IT World Conference & Expo. Cambridge Healthtech Institute in Boston, MA 2016: Data visualization and visual analytics. TTU Computer Science departmental seminars. Lubbock, TX 2015: Feature-based Visual Analysis. Chicago Chapter ACM. Chicago, IL 2014: Visualizing relationships in massive and dynamic data. Skytree tech talk. San Jose, CA 2013: Interactive Visual Analysis of Images. Doctoral Colloquium, IEEE VisWeek. Atlanta, GA ACTIVITIES 2024: Reviewer for one tenure and promotion dossier externally. 2023: Reviewer for DOE PAMS, U.S. DOE Phase IIB SBIR Proposal. 2022: Finance Chair of BDCAT2022, 9th IEEE/ACM International Conference on Big Data Computing, Applications and Technologies 2022: Program Committee of EnVirVis 2022, ISVC 2022. 2021: Reviewer for DOE, The Office of Advanced Scientific Computing Research (ASCR) within the Department of Energy Office of Science. 2021: Program Committee of ACM PEARC21, EnVirVis 2021, ISVC 2021. 2020-2021: Topic editor for MDPI Sensor journal. 2020: Reviewer for NSF the CCRI Program. 2020: IPC of IMMM 2020, EnVirVis 2020 , ISVC 2020, VDS 2020, and ACM Conference on Recommender Systems 2019: Program Committee of the 13th ACM Conference on Recommender Systems, The IEEE International Workshop on Deep Analysis of Data-Driven Applications, and The 2019 International Workshop on Big Social Media Data Management and Analysis 2018: Program Committee of the 12th ACM Conference on Recommender Systems and Big Data Engineering and BigEACPS'18 2017-2018: Undergraduate Program Committee, Course Equivalent Evaluator, and Admission Committee 2016-2017: Graduate Program Committee (Department Service) 2015-2016: Website chair of the Symposium on Biological Data Visualization (BioVis 2015 and BioVis 2016) Reviewer for: 2024 Total 2 reviews ISVC 2024 International Symposium on Visual Computing 1 paper Journal Computer Graphics Forum 1 paper 2023 Total 7 reviews ISVC 2023 International Symposium on Visual Computing 1 paper VIS 2023 IEEE Information Visualization 1 paper EnvirVis 2023 Visualization in Environmental Sciences 2023 workshop 3 papers IJHC International Journal of Human-Computer Interaction 1 paper TVCG 2023 IEEE Transactions on Visualization and Computer Graphics 1 paper 2022 Total 3 reviews ISVC 2022 Symposium on Visual Computing 1 paper TVCG 2022 IEEE Transactions on Visualization and Computer Graphics 1 paper EnvirVis 2022 Visualization in Environmental Sciences 2022 workshop 1 paper (as review coordinator) 2021 Total 17 reviews IoT 2021 IEEE Internet of Things Journal 1 paper TVCG 2021 IEEE Transactions on Visualization and Computer Graphics 1 paper VISxAI 2021 Visualization for AI Explainability 3 papers ISVC 2021 Symposium on Visual Computing 2 papers VIS 2021 IEEE Information Visualization 1 short + 1 full papers EnvirVis 2021 Visualization in Environmental Sciences 2021 workshop 1 paper Journal Supercomputing International Journal of High-Performance Computer 2 papers ACM PEARC21 Practice & Experience in Advanced Research Computing Conference 5 tutorials 2020 Total 20 reviews MDPI Sensor Sensors (ISSN 1424-8220; CODEN: SENSC9) 1 paper ACM CHI 2021 Human Factors in Computing Systems - Papers Track 1 paper VISxAI at IEEE VIS Visualization for AI Explainability 2 papers PLOS ONE journal Public Library of Science 1 paper IMMM 2020 Advances in Information Mining and Management 1 paper RecSys 2020 14th ACM Conference on Recommender Systems 5 papers ISMAR 2020 IEEE International Symposium on Mixed and Augmented Reality 1 paper VIS 2020 IEEE Information Visualization 3 papers VARE 2020 VR/AR in Education 1 paper IEEE Access Twitter of COVID-19 pandemic 2 papers ACM IMX 2020 Interactive Media Experiences Conference 1 paper Computers Graphics Computers & Graphics and Visual Computing 1 paper 2019 Total 24 reviews PLOS ONE journal Public Library of Science 1 paper CHI 20 The ACM CHI Conference on Human Factors in Computing Systems 2 papers BigEACPS'19 Big Data Engineering and Analytics in Cyber-Physical Systems 2 papers VAST 2019 IEEE Visual Analytics Science and Technology 4 challenges RecSys 2019 ACM Conference on Recommender Systems 3 papers InfoVis 2019 IEEE Information Visualization 1 paper DADA IEEE Workshop on Deep Analysis of Data-Driven Applications 3 papers INTERACT The 17th IFIP TC.13 International Conference on HCI 1 paper EuroVis EG/VGTC Conference on Visualization 1 paper GI 19 Graphics Interface 2019 2 papers IEEE VR 2019 IEEE Conference on Virtual Reality and 3D UI 4 papers 2018 Total 24 reviews BigEACPS'18 Big Data Engineering and Analytics in Cyber-Physical Systems 2 short + 2 full papers VizSec 2018 IEEE Symposium on Visualization for Cyber Security 1 paper VAST 2018 IEEE Visual Analytics Science and Technology 2 challenges SciVis 2018 The IEEE Scientific Visualization 2 short papers RecSys 2018 ACM Conference on Recommender Systems 6 papers The 10th NordiCHI Nordic forum for HCI research 1 paper EuroRVVV 2018 Verification and Validation in Visualization 1 paper EGPGV 2018 Parallel Graphics and Visualization 1 paper CogSci 2018 Cognitive Science Society 1 paper EuroVis 2018 EG/VGTC Conference on Visualization 3 papers PLOS ONE journal Public Library of Science 2 papers 2017 Total 26 reviews PacificVis 2018 IEEE Pacific Visualization Symposium 4 papers+ 3 visualization notes SciVis 2017 IEEE Scientific Visualization 2 papers VAST 2017 IEEE Visual Analytics Science and Technology 2 papers InfoVis 2017 IEEE Information Visualization 2 papers Geospatial Open Geospatial Data, Software and Standards 2 papers EuroRV3 2017 EuroVis Workshop on Verification and Visualization 2 papers EuroVis 2017 EG/VGTC Conference on Visualization 4 papers + 2 STARs + 3 short 2016 Total 19 reviews PacificVis 2017 IEEE Pacific Visualization Symposium 6 papers+ 3 visualization notes SciVis 2016 IEEE Scientific Visualization 1 paper VAST 2016 IEEE Visual Analytics Science and Technology 4 papers InfoVis 2016 IEEE Information Visualization 4 papers VIP 2016 Workshop on Visualization in Practice 1 paper 2015 Total 9 reviews EuroVis 2016 EG/VGTC Conference on Visualization 5 papers PacificVis 2016 IEEE Pacific Visualization Symposium 3 papers InfoVis 2015 IEEE Information Visualization 1 paper Committee member for: Date Title Student Program Role 2024 Visual Analytics for Complex Multivariate Data: Techniques for Soil Science, Temporal Networks, and Interactive 3D Visualization Jake Gonzalez PhD defense Committee Chair Error component models for traffic crash severity analysis Rohan Shrestha PhD defense Dean Representative Security of Voice-Interactive D",
  "content_length": 14091,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:51"
}