{
  "name": "Daniel P. Lopresti",
  "homepage": "http://www.cse.lehigh.edu/~lopresti",
  "status": "success",
  "content": "Daniel P. Lopresti: Homepage COLLEGE HOME | LEHIGH HOME | SEARCH  Home  Research  Courses  Publications  Patents  Talks  Professional  Leadership  Conferences  People  Student Resources  Other Activities  Vita (PDF) Daniel P. Lopresti Professor, Computer Science and Engineering, Lehigh University Editor-in-Chief, International Journal of Document Analysis and Recognition (IJDAR) Area Editor, Computer Vision and Image Understanding (CVIU) General Chair, 28th International Conference on Pattern Recognition (ICPR 2026) Program Chair, 20th International Conference on Document Analysis and Recognition (ICDAR 2026) Lehigh University 113 Research Drive Bethlehem, PA  18015  USA Phone: (610) 758-5782 Email*: Office: Mountaintop Building C 337 Daniel Lopresti received his bachelor's degree from Dartmouth in 1982 and his Ph.D. in computer science from Princeton in 1987. After completing his doctorate, he joined the Department of Computer Science at Brown and taught courses ranging from VLSI design to computational aspects of molecular biology and conducted research in parallel computing and VLSI CAD. He went on to help found the Matsushita Information Technology Laboratory in Princeton, and later also served on the research staff at Bell Labs where his work turned to document analysis, handwriting recognition, and biometric security. In 2003, Dr. Lopresti joined the Department of Computer Science and Engineering at Lehigh where his research examines fundamental algorithmic and systems-related questions in pattern recognition, bioinformatics, and security. On July 1, 2009, he became Chair of the CSE Department and occupied the position for 10 years through several reappointments ending on June 30, 2019. Beginning on July 1, 2014, he served as Interim Dean of the P. C. Rossin College of Engineering and Applied Science for a year. On July 1, 2015, he was named Director of the Data X strategic initiative, a role he held until June 2020. Dr. Lopresti is a past Chair of the Computing Research Associations Computing Community Consortium (CCC). He also served as President of the International Association for Pattern Recognition (IAPR). He is an Editor-in-Chief of the International Journal of Document Analysis and Recognition (IJDAR), and as an Area Editor for Computer Vision and Image Understanding (CVIU). He has co-authored over 175 peer-reviewed publications, and is a named co-inventor on 24 U.S. patents. Over his career, Dr. Lopresti has mentored more than 70 undergraduate and graduate students and postdocs, and personally facilitated professional networking connections for hundreds more. Recent News of Note CRA Computing Community Consortium Council From 2015 through 2025, I served on the Computing Community Consortium Council of the Computing Research Association. I assumed the role of Vice Chair of CCC beginning in July 2020, and the Chair of CCC beginning in July 2022. By virtue of serving as CCC Chair, I was also a member of the CRA Board of Directors. Effective July 2024, I transitioned to the role of Chair Emeritus, a position which I held through June 2025. Over the past several years, I assisted in co-authoring a large number of CCC whitepapers and RFI responses working with many computing research leaders from around the country, including: \"Computing Research Challenges in Next Generation Wireless Networking,\" E. Bertino (Purdue University), D. Bliss (Arizona State University), D. Lopresti (Lehigh University), L. Peterson (Princeton University), and H. Schulzrinne (Columbia University), October 2020. \"A Research Ecosystem for Secure Computing,\" N. Bliss (Arizona State University), L. A. Gordon (University of Maryland), D. Lopresti (Lehigh University), F. Schneider (Cornell University), and S. Venkatasubramanian (University of Utah), November 2020. \"Pandemic Informatics: Preparation, Robustness and Resilience,\" E. Bradley (University of Colorado Boulder), W. Gropp (University of Illinois at UrbanaChampaign), D. Lopresti (Lehigh University), M. Marathe (University of Virginia), and M. Moses (University of New Mexico), November 2020.  Also addenda:  \"Pandemic Informatics: Vaccine Distribution, Logistics, and Prioritization,\" March 2021; \"Pandemic Informatics:  Variants of Concern (VOC),\" April 2021. \"Artificial Intelligence and Cooperation,\" E. Bertino (Purdue University), F. Doshi-Velez (Harvard University), M. Gini (University of Minnesota), D. Lopresti (Lehigh University), and D. Parkes (Harvard University), November 2020. \"Next Wave Artificial Intelligence: Robust, Explainable, Adaptable, Ethical, and Accountable,\" O. C. Jenkins (University of Michigan), D. Lopresti (Lehigh University), and M. Mitchell (Portland State University and Santa Fe Institute), November 2020. \"A National Research Agenda for Intelligent Infrastructure:  2021 Update,\" D. Lopresti (Lehigh University) and S. Shekhar (University of Minnesota), December 2020. \"A National Discovery Cloud:  Preparing the US for Global Competitiveness in the New Era of 21st Century Digital Transformation\" (CCC Whitepaper), I. Foster (Argonne National Laboratory and University of Chicago), D. Lopresti (Lehigh University), W. Gropp (University of Illinois Urbana-Champaign), M. Hill (Microsoft and University of Wisconsin, Madison), and K. Schuman (Oak Ridge National Laboratory), April 2021. \"Response to RFI on Public and Private Sector Uses of Biometric Technologies\" (CCC RFI Response), D. Danks (University of California San Diego), M. Gini (University of Minnesota), O. C. Jenkins (University of Michigan), D. Lopresti (Lehigh University), M. Mitchell (Santa Fe Institute), and K. Siek (Indiana University, Bloomington), January 2022. \"Response to RFI to the Update of the National Artificial Intelligence Research and Development Strategic Plan\" (CCC RFI Response), D. Danks (University of California San Diego), M. Gini (University of Minnesota), O. C. Jenkins (University of Michigan), S. Koenig (University of Southern California), D. Lopresti (Lehigh University), M. Mitchell (Santa Fe Institute), K. Siek (Indiana University, Bloomington), U. Topcu (University of Texas at Austin), H. Yanco (University of Massachusetts, Lowell), and M. Hunter (Computing Community Consortium), March 2022. \"Response to RFI on AI Accountability Policy\" (CCC RFI Response), N. Bliss (Arizona State University), D. Danks (University of California San Diego), M. Gini (University of Minnesota), J. Gorman (Arizona State University), W. Gropp (University of Illinois Urbana-Champaign), M. Hunter (Computing Community Consortium), O. C. Jenkins (University of Michigan), D. Jensen (University of Massachusetts Amherst), D. Lopresti (Lehigh University), B. Selman  (Cornell University), U. Topcu (University of Texas at Austin), T. Toscos (Parkview Health), and P. Wisniewski (Vanderbilt University), June 2023. \"Response to RFI on National Priorities for Artificial Intelligence\" (CCC RFI Response), J. Biddle (Georgia Institute of Technology), E. Bradley (University of Colorado Boulder), D. Danks (University of California San Diego), M. Gini (University of Minnesota), A.K. Goel (Georgia Institute of Technology), A. Guha (Northeastern University), M. Hunter (Computing Community Consortium), D. Jensen (University of Massachusetts Amherst), S. Koenig (University of Southern California), C. Krintz (University of California-Santa Barbara), D. Lopresti (Lehigh University), A. McGovern (University of Oklahoma), D. Molzahn (Georgia Institute of Technology), R. Rajaraman (Northeastern University), A. Singh (Carnegie Mellon University), M. Turk (Toyota Technological Institute at Chicago), and H. Yanco (University of Massachusetts Lowell), July 2023. \"Response to PCAST Working Group on Generative AI Invites Public Input\" (CCC RFI Response), Maria Gini (University of Minnesota), Madeline Hunter (Computing Community Consortium), Sven Koenig (University of Southern California), Daniel Lopresti (Lehigh University), Rajmohan Rajaraman (Northeastern University), Ufuk Topcu (The University of Texas at Austin), Matthew Turk (Toyota Technological Institute at Chicago), and Holly Yanco (University of Massachusetts, Lowell), July 2023. \"Response to RFI on Developing a Roadmap for the Directorate for Technology, Innovation, and Partnerships at the National Science Foundation\" (CCC and GAC RFI Response), Alex Aiken (Stanford University), Nadya Bliss (Arizona State University), Elizabeth Bradley (University of Colorado, Boulder), Kevin Butler (University of Florida), Tracy Camp (Computing Research Association), David Danks (University of California, San Diego), Catherine Gill (Computing Community Consortium), William Gropp (University of Illinois, Urbana-Champaign), Peter Harsha (Computing Research Association), Chandra Krintz (University of California, Santa Barbara), Brian LaMacchia (Farcaster Consulting Group, LLC), Daniel Lopresti (Lehigh University), Brian Mosley (Computing Research Association), Ann Schwartz (Computing Community Consortium), Katie Siek (Indiana University), Michela Taufer (University of Tennessee, Knoxville), Ufuk Topcu (University of Texas, Austin), Pamela Wisniewski (Vanderbilt University), and Holly Yanco (University of Massachusetts, Lowell), July 2023. \"Response to White House National Cyber Director Requests Feedback on Open-source Software Security\" (CCC RFI Response), Kevin Butler (University of Florida), David Danks (University of California, San Diego), Daniel Lopresti (Lehigh University), and Madeline Hunter (Computing Community Consortium), October 2023. \"Response to the Office of Management and Budget's Request for Comments on Advancing Governance, Innovation, and Risk Management for Agency Use of Artificial Intelligence Draft Memorandum\" (CCC RFI Response), David Danks (University of California, San Diego), Haley Griffin (Computing Community Consortium), David Jensen (University of Massachusetts Amherst), Chandra Krintz (University of California Santa Barbara), Daniel Lopresti (Leh",
  "content_length": 33757,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:28"
}