{
  "name": "Daniel Stamate",
  "homepage": "https://www.gold.ac.uk/computing/staff/d-stamate",
  "status": "success",
  "content": "Dr Daniel Stamate | Goldsmiths, University of London Main menu Staff & students In this section Daniel’s research interests concern problems and applications involving soft computing and data science. Staff details Position Senior Lecturer in Data Science Department Computing Email d.stamate (@gold.ac.uk) Website http://www.doc.gold.ac.uk/~mas01ds/homepage/ I am a Machine Learning scientist, Data Science team leader, Director of Data Science MSc Programme, and industry AI – Machine Learning expert speaker and consultant. I established and lead the Data Science & Soft Computing Lab which has collaborations with various research groups at King’s College London, University of Manchester, Imperial College London, Maastricht University, and National Research Tomsk State University, and with companies in the City of London such as Santander Bank, Mizuho Investment Bank, etc. At Goldsmiths, I initiated, designed and run the MSc in Data Science - which inspired and was mostly replicated into similar online programme to come at University of London. I have a background in Computer Science and Mathematics, holding an MSc degree in Computer Science & Mathematics from University of Iasi - Faculty of Mathematics, and a PhD in Computer Science from University of Paris-Sud - LRI Computer Science Laboratory. Publications and research outputs Book SectionImperfect Information Representation through Extended Logic Programs in Bilattices Stamate, Daniel . 2008. Imperfect Information Representation through Extended Logic Programs in Bilattices. In: Bernadette Bouchon-Meunier; Christophe Marsala; Maria Rifqi and Ronald R Yager, eds. UNCERTAINTY AND INTELLIGENT INFORMATION SYSTEMS. London: World Scientific, pp. 419-432. ISBN 978-981-279-234-1 ArticleBalancing accuracy and Interpretability: An R package assessing complex relationships beyond the Cox model and applications to clinical prediction Shamsutdinova, Diana; Stamate, Daniel ; and Stahl, Daniel. 2025. Balancing accuracy and Interpretability: An R package assessing complex relationships beyond the Cox model and applications to clinical prediction. International Journal of Medical Informatics, 194, 105700. ISSN 1386-5056 Identifying individuals at high risk for dementia in primary care: Development and validation of the DemRisk risk prediction model using routinely collected patient data Reeves, David; Morgan, Catharine; Stamate, Daniel ; Ford, Elizabeth; Ashcroft, Darren M.; Kontopantelis, Evangelos; Van Marwijk, Harm; and McMillan, Brian. 2024. Identifying individuals at high risk for dementia in primary care: Development and validation of the DemRisk risk prediction model using routinely collected patient data. PLoS ONE, 19(10), e0310712. ISSN 1932-6203 A metabolite-based machine learning approach to diagnose Alzheimer’s-type dementia in blood: Results from the European Medical Information Framework for Alzheimer's Disease biomarker discovery cohort Stamate, Daniel ; Kim, Min; Proitsi, Petroula; Westwood, Sarah; Baird, Alison; Nevado-Holgado, Alejo; Hye, Abdul; Bos, Isabelle; Vos, Stephanie; Vandenberghe, Rik; +35 more...Teunissen, Charlotte E; Kate, Mara Ten; Scheltens, Philip; Gabel, Silvy; Meersmans, Karen; Blin, Olivier; Richardson, Jill; Roeck, Ellen De; Engelborghs, Sebastiaan; Sleegeres, Kristel; Bordet, Régis; Rami, Lorena; Kettunen, Petronella; Tsolaki, Magd; Verhey, Frans; Alcolea, Daniel; Lléo, Alberto; Peyratout, Gwendoline; Tainta, Mikel; Johannsen, Peter; Freund-Levi, Yvonne; Frölich, Lutz; Dobricic, Valerija; Frisoni, Giovanni B; Molinuevo, José L; Wallin, Anders; Popp, Julius; Martinez-Lage, Pablo; Bertram, Lars; Blennow, Kaj; Zetterberg, Henrik; Streffer, Johannes; Visser, Pieter J; Lovestone, Simon; and Legido-Quigley, Cristina. 2019. A metabolite-based machine learning approach to diagnose Alzheimer’s-type dementia in blood: Results from the European Medical Information Framework for Alzheimer's Disease biomarker discovery cohort. Alzheimer’s & Dementia: Translational Research & Clinical Interventions, 5, pp. 933-938. Show more information A Regime-Switching Recurrent Neural Network Model Applied to Wind Time Series Nikolaev, Nikolay ; Smirnov, Evgueni; Stamate, Daniel ; and Zimmer, Robert . 2019. A Regime-Switching Recurrent Neural Network Model Applied to Wind Time Series. Applied Soft Computing, 80, pp. 723-734. ISSN 1568-4946 Identifying psychosis spectrum disorder from experience sampling data using machine learning approaches Stamate, Daniel ; Katrinecz, Andrea; Stahl, Daniel; Verhagen, Simone J.W.; Delespaul, Philippe A.E.G.; van Os, Jim; and Guloksuz, Sinan. 2019. Identifying psychosis spectrum disorder from experience sampling data using machine learning approaches. Schizophrenia Research, 209, pp. 156-163. ISSN 0920-9964 Utilising symptom dimensions with diagnostic categories improves prediction of time to first remission in first-episode psychosis Ajnakina, Olesya; Lally, John; Di Forti, Marta; Stilo, Simona; Kolliakou, Anna; Gardner-Sood, Poonam; Dazzan, Paola; Pariante, Carmine; Marques, Tiago Reiss; Mondelli, Valeria; +6 more...MacCabe, James; Gaughran, Fiona; David, Anthony S; Stamate, Daniel ; Murray, Robin; and Fisher, Helen L.. 2018. Utilising symptom dimensions with diagnostic categories improves prediction of time to first remission in first-episode psychosis. Schizophrenia Research, 193, pp. 391-398. ISSN 0920-9964 Improving time-efficiency in blocking expanding ring search for mobile ad hoc networks Pu, Ida ; Stamate, Daniel ; and Shen, Yuji. 2014. Improving time-efficiency in blocking expanding ring search for mobile ad hoc networks. Journal of Discrete Algorithms, 24, pp. 59-67. ISSN 1570-8667 Hypothesis-based semantics of logic programs in multivalued logics Stamate, Daniel ; Loyer, Y.; and Spyratos, N.. 2004. Hypothesis-based semantics of logic programs in multivalued logics. ACM Transactions on Computational Logic, 5(3), pp. 508-527. ISSN 15293785 Parametrized semantics of logic programs: a unifying framework Stamate, Daniel ; Loyer, Y.; and Spyratos, N.. 2003. Parametrized semantics of logic programs: a unifying framework. Theoretical Computer Science, 308(1-3), pp. 429-447. ISSN 03043975 Conference or Workshop ItemClassifying Cognitive States of Alzheimer’s Disease with Machine Learning Using Digital Biomarkers from the Bio-Hermes Study Cohort Houstoun, Eoin; Stamate, Daniel ; Musto, Henry ; Reeves, David; Morgan, Catharine; Hutanu, Roxana; Mavromati, Kalliopi; Cadar, Dorina; and Stahl, Daniel. 2025. 'Classifying Cognitive States of Alzheimer’s Disease with Machine Learning Using Digital Biomarkers from the Bio-Hermes Study Cohort'. In: Artificial Intelligence Applications and Innovations (AIAI 2025). Limassol, Cyprus 26 - 29 June 2025. Proteomics, Neuropsychological and Demographics Multimodal Machine Learning Approach to Alzheimer’s Disease Prediction on the Bio-Hermes Study Cohort Musto, Henry ; Stamate, Daniel ; Reeves, David; Morgan, Catharine; Hutanu, Roxana; Mavromati, Kalliopi; Cadar, Dorina; and Stahl, Daniel. 2025. 'Proteomics, Neuropsychological and Demographics Multimodal Machine Learning Approach to Alzheimer’s Disease Prediction on the Bio-Hermes Study Cohort'. In: Artificial Intelligence Applications and Innovations (AIAI 2025). Limassol, Cyprus 26 - 29 June 2025. Predicting Deterioration in Mild Cognitive Impairment with Survival Transformers, Extreme Gradient Boosting and Cox Proportional Hazard Modelling Musto, Henry ; Stamate, Daniel ; Logofatu, Doina; and Stahl, Daniel. 2024. 'Predicting Deterioration in Mild Cognitive Impairment with Survival Transformers, Extreme Gradient Boosting and Cox Proportional Hazard Modelling'. In: Artificial Neural Networks and Machine Learning – ICANN 2024. Lugano, Switzerland 17 - 20 September 2024. Show more information Ensembles of Bidirectional LSTM and GRU Neural Nets for Predicting Mother-Infant Synchrony in Videos Stamate, Daniel ; Davuloori, Pradyumna; Logofatu, Doina; Mercure, Evelyne ; Addyman, Caspar; and Tomlinson, Mark. 2024. 'Ensembles of Bidirectional LSTM and GRU Neural Nets for Predicting Mother-Infant Synchrony in Videos'. In: Engineering Applications of Neural Networks: 25th International Conference on Engineering Applications of Neural Networks (EANN 2024). Corfu, Greece 27 - 30 June 2024. On a Survival Gradient Boosting, Neural Network and Cox PH Based Approach to Predicting Dementia Diagnosis Risk on ADNI Musto, Henry ; Stamate, Daniel ; Logofatu, Doina; and Ouarbya, Lahcen . 2024. 'On a Survival Gradient Boosting, Neural Network and Cox PH Based Approach to Predicting Dementia Diagnosis Risk on ADNI'. In: 2023 IEEE International Conference on Bioinformatics and Biomedicine (BIBM). Istanbul, Turkey 5 - 8 December 2023. Predicting High vs Low Mother-Baby Synchrony with GRU-Based Ensemble Models Stamate, Daniel ; Haran, Riya ; Rutkowska, Karolina; Davuloori, Pradyumna; Mercure, Evelyne ; Addyman, Caspar; and Tomlinson, Mark. 2023. 'Predicting High vs Low Mother-Baby Synchrony with GRU-Based Ensemble Models'. In: Artificial Neural Networks and Machine Learning – ICANN 2023. Heraklion, Crete, Greece 26-29 September 2023. Predicting Alzheimer’s Disease Diagnosis Risk Over Time with Survival Machine Learning on the ADNI Cohort Musto, Henry ; Stamate, Daniel ; Pu, Ida ; and Stahl, Daniel. 2023. 'Predicting Alzheimer’s Disease Diagnosis Risk Over Time with Survival Machine Learning on the ADNI Cohort'. In: Computational Collective Intelligence. ICCCI 2023.. Budapest, Hungary 27–29 September 2023. Predicting Colour Reflectance with Gradient Boosting and Deep Learning Akanuma, Asei ; Stamate, Daniel ; and Bishop, Mark (J. M.) . 2023. 'Predicting Colour Reflectance with Gradient Boosting and Deep Learning'. In: Artificial Intelligence Applications and Innovations. Leon, Spain 14 - 17 June 2023. A Neural Network Approach to Estimating Color Reflectance with Product Independent Models Akanuma, Asei ; and Stamate, Daniel . 2022. 'A Neural Network Approach to Estimating ",
  "content_length": 22675,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:40"
}