{
  "name": "Daniel Leithinger",
  "homepage": "http://www.leithinger.com",
  "status": "success",
  "content": "Daniel Leithinger Running on Cargo Publications Awards & Press About Daniel Leithinger Prev Next ✕ Index Wizard of Props (2024) — Yuzhen Zhang*, Ruixiang Han*, Ran Zhou*, Peter Gyory, Clement Zheng, Patrick C. Shih, Ellen Yi-Luen Do, Malte F Jung, Wendy Ju, Daniel Leithinger. 2024. Wizard of... Together Apart (2020-2024) — Casey Lee Hunt, Kaiwen Sun, Zahra Dhuliawala, Fumi Tsukiyama, Iva Matkovic, Zachary Schwemler, Anastasia Wolf, Zihao Zhang, Allison Druin, Amanda Huynh, Daniel... TactorBots (2023) — Ran Zhou, Zachary Schwemler, Akshay Baweja, Harpreet Sareen, Casey Lee Hunt, and Daniel Leithinger. 2023. TactorBots: A Haptic Design Toolkit for... EmotiTactor (2022) — Ran Zhou, Harpreet Sareen, Yufei Zhang, and Daniel Leithinger. 2022. EmotiTactor: Exploring How Designers Approach Emotional Robotic Touch. In... Electriflow (2021) — Augmenting Books With Tangible Animation Using Soft Electrohydraulic Actuators. Purnendu, Sasha Novack, Eric Acome, Mirela Alistar, Christoph Keplinger, Mark... HapticBots (2021) — Distributed Encountered-type Haptics for VR with Multiple Shape-changing Mobile Robots. Ryo Suzuki, Eyal Ofek, Mike Sinclair, Daniel Leithinger, and Mar... Pufferbot (2020) — An aerial robot with a custom 3D-printed expandable scissor structure. H. Hedayati, R. Suzuki, D. Leithinger and D. Szafir, \"PufferBot: Actuated Expandable... RealitySketch (2020) — Embedding Responsive Graphics and Visualizations in AR through Dynamic Sketching. Ryo Suzuki, Rubaiat Habib Kazi, Li-yi Wei, Stephen DiVerdi, Wilmot Li, and... RoomShift (2020) — Room-scale Dynamic Haptics for VR with Furniture-moving Swarm Robots. Ryo Suzuki, Hooman Hedayati, Clement Zheng, James L. Bohn, Daniel Szafir, Ellen Yi-Luen... LiftTiles (2020) — Constructive Building Blocks for Prototyping Room-scale Shape-changing Interfaces. Ryo Suzuki, Ryosuke Nakayama, Dan Liu, Yasuaki Kakehi, Mark D. Gross, and... ShapeBots (2019) — A swarm of self-transformable robots that can both individually and collectively change their configuration to display information, actuate objects, act as tangible... ATLAS Institute THING Lab (2018 - 2023) — From 2018 - 2023, I was a tenure track assistant professor at the ATLAS Institute and Department of Computer Science at the University of Colorado Boulder. Together... Lumii (2015 - 2017) — Lumii (now Fathom) is a startup I founded in 2015 with my colleagues Matt Hirsch and Tom Baran to develop the next generation of high-resolution, glasses-free 3D... inFORM at Cooper Hewitt (2014) — A custom built version of inFORM is on Exhibit at the Cooper Hewitt, Smithsonian Design Museum in New York from from December 2014 to May 2015, as part of the... TRANSFORM (2014) — Embodiment of \"Radical Atoms\" at Milano Design Week. Hiroshi Ishii, Daniel Leithinger, Sean Follmer, Amit Zoran, Philipp Schoessler, and Jared Counts. 2015.... inFORM (2013) — Dynamic Physical Affordances and Constraints through Shape and Object Actuation. Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi... Sublimate (2013) — Recent research in 3D user interfaces pushes towards immersive graphics and actuated shape displays. Our work explores the hybrid of these directions, and we... Jamming User Interfaces (2012) — Malleable and organic user interfaces have the potential to enable radically new forms of interactions and expressiveness through flexible, free-form and... Relief (2009) — Relief is an actuated tabletop display, which is able to render and animate three-dimensional shapes with a malleable surface. It allows users to experience and... G-Stalt (2009) — The g-stalt project is an exploration how to navigate large information spaces naturally, quickly, and seamlessly between graphical and physical space. The goal is... Proverbial Wallets (2008) — We have trouble controlling our consumer impulses, and there's a gap between our decision and the consequences. When we pull a product off the shelf, do we know... Pentable (2007) — Digital tabletops are often utilized to create natural interfaces for human computer interaction. Previous research has introduced intuitive metaphors for specific... Shared Design Space (2006) — Collaborative Augmented Reality setups are becoming increasingly popular. Instead of using head mounted displays (HMDs), we have developed the Shared Design Space,... Coeno (2005) — Coeno is a toolkit that provides an novel approach for using computers in office environments. The basic concept behind this project is to facilitate collaboration...",
  "content_length": 4521,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:20"
}