{
  "name": "Daniela Marghitu",
  "homepage": "http://www.eng.auburn.edu/~daniela",
  "status": "success",
  "content": "Dr. Daniela Marghitu Contact Dr. Daniela Marghitu 3118 Shelby Center Auburn, AL 36849 Office hours: Wednesday 10:00-12:00 pm 334.844.6386 334.844.6329 marghda@auburn.edu eng.auburn.edu/~marghda Home Dr. Daniela Marghitu received her B.S. in Automation and Computing from Polytechnic University of Bucharest, and her Ph.D. degree in Automation and Computing from University of Craiova. She is a faculty member in the Computer Science and Software Engineering Department at Auburn University, where she has worked since 1996. Her teaching experience includes a variety of Information Technology and Computing courses (e.g., Assistive and Accessible Computing, Object-Oriented Programming for Engineers and Scientists, Introduction to Computing for Engineers and Scientists, Network Programming with HTML and Java, Web Development and Design Foundations with HTML 5.0, CSS3.0 and JavaScript, Personal Computer Applications, Spreadsheet-Based Applications with Visual BASIC, Web Application Development with XML amd JSP). Her research areas include STEM K12 Inclusive Computing Research and Outreach; Web Applications Design and Development; Education and Assistive Technology; Software Engineering; Web and Software Engineering Usability and Accessibility. Dr. Marghitu has received 8 (eight) awards for research and education projects from National Science Foundation (e.g.Co-PI of NSF RET Site: Project-Based Learning for Rural Alabama STEM Middle School Teachers in Machine Learning and Robotics; Co-PI of NSF INCLUDES Alliance: The Alliance of Students with Disabilities for Inclusion, Networking, and Transition Opportunities in STEM (TAPDINTO-STEM); Co-PI of NSF EEC \"RFE Design and Development: Framing Engineering as Community Activism for Values-Driven Engineering\"; Co-PI of NSF CISE \"EAGER: An Accessible Coding Curriculum for Engaging Underserved Students with Special Needs in Afterschool Programs\"; co-PI of NSF INCLUDES: South East Alliance for Persons with Disabilities in STEM, Co-PI of NSF CE 21 Collaborative Research: Planning Grant: Computer Science for All (CS4ALL)), and Co-PI for NIFA \"Reimagining Controlled Environment Agriculture in a Low Carbon World\". Dr. Marghitu was also PI of two grants from ACM Special Interest Group on Computer Science Education, seven grants from Center for Woman in Information Technology, four grants from AccessComputing Alliance, and one grant each from Daniel F. Breeden Endowment for Faculty Enhancement,Computer Science Collaboration Project, Microsoft Fuse Research, Altova Co., and Pearson Education Publishing Co. Dr. Marghitu has mentored over 50 hundreds k12, computing undergraduate, graduate students including representatives of underserved/underrepresented communities, women, and people with disabilities. Dr. Marghitu has participated in numerous administrative activities at Auburn University. Among these activities are the following: Auburn University Board of Trustee Faculty Representative; Auburn University representative for National Center for Women in Information Technology, AccessComputing, Access10K, and AccessEngineering Alliances; Auburn University Persons with Disabilities Committee chair; Founder and Director Auburn University Laboratory for Education and Assistive Technology; faculty representative Auburn University Core Curriculum Oversight committee and Multicultural Diversity Commission. Dr. Marghitu also served as World Usability Day Web Site Committee Chair; Alabama STEM Education board chair, Panel member for the National Science Foundation; member of the congressionally mandated Committee on Equal Opportunities in Science and Engineering; member of the Committee on the Future of NSF EPSCoR; and member of the Computer Science for All (CSforAll) Accessibility Board, College Board's Advanced Placement Program (AP) Computer Science A Development Committee (DC), Governor Kay Ivey's Computer Science Advisory Council, Co-chair SIGCSE Virtual 2026 Conference. Dr. Marghitu published 7 (seven) Information Technology books at Pearson Publishing Co., two chapter books at IGI Global Scientific Publishing, articles at Journal: IEEE Access, International Journal On Advances in Software, International Journal On Advances in Internet Technology, Journal of Women and Minorities in Science and Engineering, National Science Teaching Association Journals, Journal of Computer Science Education,International Journal on Advances in Internet Technology Transactions of the SDPS: Journal of Integrated Design and Process Science, User Experience Magazine, Journal of Computing Sciences in Colleges, International Journal for Virtual Reality, Journal of SMET Education and Research. Dr. Marghitu has published peer reviewed papers and gave presentations at numerous international conferences(e.g. ACM Special Interest Group on Computer Science Education Technical Symposium, Pacific Rim International Conference on Disability, International Technology and Persons with Disabilities Conference, International Conference on Software Engineering Advances, EDUCAUSE, Association for Advancement of Computing in Education, International Society for Technology in Education, Society for Design and Process Science, American Society for Engineering Education, Human Computer Interaction International Conference, and International Academy, Research, and Industry Association) in USA, Canada, England, France, Germany, Spain, Italy, Portugal,and Romania. Her work was also presented by co-authors at conferences in Brazil, Taiwan and S. Korea. Among Dr. Marghitu's honors and awards are the following: 2011 AccessComputing Capacity Building Award, the 2012 Auburn University Access award, the 2012 Society for Design and Process Science Outstanding Achievement Award, the 2013 Microsoft Fuse Research award, the 2015 DO-IT Trailblazer award, the 2017 International Academy, Research, and Industry Association Fellowship, the 2017 Society for Design and Process Science Fellowship, and the 2019 Samuel Ginn College of Engineering 100+ Women Strong Leadership in Diversity Faculty Award.",
  "content_length": 6071,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:48"
}