{
  "name": "Daniela Rus",
  "homepage": "https://www.csail.mit.edu/user/876",
  "status": "success",
  "content": "Daniela Rus | MIT CSAIL Skip to main content PI Core/Dual Daniela Rus Director Email rus@csail.mit.edu Daniela Rus is the Andrew (1956) and Erna Viterbi Professor of Electrical Engineering and Computer Science and Director of the Computer Science and Artificial Intelligence Laboratory (CSAIL) at MIT. Rus’s research interests are in robotics, mobile computing, and data science. Rus is a Class of 2002 MacArthur Fellow, a fellow of ACM, AAAI and IEEE, and a member of the National Academy of Engineering, and the American Academy for Arts and Science. She earned her PhD in Computer Science from Cornell University. Related Links Website The World at MIT TED Talk Mitre Liquid Last updated Mar 19 '25 Research Areas AI & ML Robotics Security & Cryptography Systems & Networking Impact Areas Big Data Cybersecurity Health Care Manufacturing Transportation Related Links Website The World at MIT TED Talk Mitre Liquid Publications Daniela Rus and Michael Tolley \"Design, Fabrication, and Control of Soft Robots\" Nature 521, pp 467-475, May 2015. View publication Javier Alonso-Mora, Samitha Samaranayake, Alexander Wallar, Emilio Frazzoli, Daniela Rus \"On-demand high-capacity ride-sharing via dynamic trip-vehicle assignment\" in Proceedings of the National Academy of Science, vol. 114, no. 3, pp 462—467, January 2017. View publication Dan Feldman, Chongyuan Xiang, and Daniela Rus \"Coresets for Differentially Private k-Means Clustering and Applications to Privacy in Mobile Sensor Networks\" 2016 ACM Conference on Embedded Sensor Networks (Sensys), April 2017 View publication See Full List Projects Project Helping robots learn using demonstrations Distributed Robotics Laboratory Help robots learn faster by providing demonstrations when they need help Joseph DelPreto Leads Joseph DelPreto Research Areas Algorithms & Theory Human-Computer Interaction Robotics Impact Areas Manufacturing Joseph DelPreto Project Controlling drones and other robots with gestures Distributed Robotics Laboratory Interact with robots and other devices by gesturing, using wearable muscle and motion sensors Joseph DelPreto Leads Joseph DelPreto Research Areas AI & ML Human-Computer Interaction Robotics Joseph DelPreto Project Using Muscle Signals to Lift Objects with Robots Distributed Robotics Laboratory Robot assistants that can help you lift objects by mirroring motions and following nonverbal commands Joseph DelPreto Leads Joseph DelPreto Research Areas Human-Computer Interaction Robotics Joseph DelPreto Project Route and Motion Planning for Mobility-on-Demand with Rules of the Road Distributed Robotics Laboratory Ensuring correct behavior of autonomous vehicles with respect to rules of the road Sertac Karaman Daniela Rus Leads Sertac Karaman Daniela Rus Research Areas Robotics Impact Areas Transportation Sertac Karaman Daniela Rus Project Distributed Robot Garden Distributed Robotics Laboratory The robot garden provides an aesthetically pleasing educational platform that can visualize computer science concepts and encourage young students to pursue programming and robotics. Joseph DelPreto Daniela Rus Leads Joseph DelPreto Daniela Rus Research Areas Algorithms & Theory Human-Computer Interaction Programming Languages & Software Engineering Robotics Impact Areas Education Entertainment Joseph DelPreto Daniela Rus Project Robot Compiler Distributed Robotics Laboratory The Robot Compiler allows non-engineering users to rapidly fabricate customized robots, facilitating the proliferation of robots in everyday life. It thereby marks an important step towards the realization of personal robots that have captured imaginations for decades. Joseph DelPreto Daniela Rus Leads Joseph DelPreto Daniela Rus Research Areas Algorithms & Theory Human-Computer Interaction Robotics Impact Areas Education Internet of Things Joseph DelPreto Daniela Rus Project Coresets for Machine Learning Algorithms Distributed Robotics Laboratory Our goal is to design novel data compression techniques to accelerate popular machine learning algorithms in Big Data and streaming settings. Daniela Rus Leads Daniela Rus Research Areas Algorithms & Theory AI & ML Impact Areas Big Data Daniela Rus Project Socially-Compliant Behavior for Autonomous Driving Distributed Robotics Laboratory Bringing human-like decision making to autonomous driving. Leads Sertac Karaman Javier Alonso-Mora Daniela Rus Research Areas Robotics Impact Areas Transportation Project M-Blocks Modular Robotics Distributed Robotics Laboratory Creating modular robotic systems which can reconfigure themselves in order to create new robots. Daniela Rus Leads Daniela Rus Research Areas Robotics Daniela Rus Project Practical Secure Computation Distributed Robotics Laboratory Our goal is to bridge theory and practice to create infrastructure that allow computation and multi-party computation without compromising privacy. Daniela Rus Danny Feldman Leads Daniela Rus Danny Feldman Research Areas Algorithms & Theory Security & Cryptography Systems & Networking Daniela Rus Danny Feldman Project Self-Driving Vehicles Distributed Robotics Laboratory We want to help to make driving more comfortable, environmentally friendly and above all safer! Guy Rosman Mikhail Volkov +3 Leads Russ Tedrake John Leonard Daniela Rus Sertac Karaman Research Areas Programming Languages & Software Engineering Robotics Impact Areas Transportation Guy Rosman Mikhail Volkov +3 Project Planning in Congestion for Autonomous Vehicles Distributed Robotics Laboratory Our goal is to develop an autonomous vehicle control strategy that adapts on-line to varying levels of congestion in the environment. Sertac Karaman Daniela Rus Leads Sertac Karaman Daniela Rus Research Areas Robotics Impact Areas Transportation Sertac Karaman Daniela Rus Project Robust Learning for Autonomous Vehicles Distributed Robotics Laboratory Our goal is to create a theoretical framework and effective machine learning algorithms for robust, reliable control of autonomous vehicles. Key threads include developing metrics of confidence; and designing deep learning algorithms for parallel autonomy. Daniela Rus Alexander Amini Leads Daniela Rus Alexander Amini Research Areas AI & ML Robotics Impact Areas Transportation Daniela Rus Alexander Amini Project Brain-Controlled Robots Distributed Robotics Laboratory This project aims to let people correct robot mistakes with nothing more than their brain signals - to allow robots to adapt to humans rather than the other way around Frank H. Guenther Daniela Rus Joseph DelPreto Leads Daniela Rus Joseph DelPreto Research Areas Human-Computer Interaction Robotics Frank H. Guenther Daniela Rus Joseph DelPreto Project Better Models for Ride-Sharing Distributed Robotics Laboratory Traffic is not just a nuisance for drivers: It’s also a public health hazard and bad news for the economy. Leads Research Areas Algorithms & Theory AI & ML Systems & Networking Impact Areas Big Data Energy Transportation Project Drones that Drive Distributed Robotics Laboratory Multi-robot path planning for robot swarms that can both fly and drive Leads Research Areas Algorithms & Theory AI & ML Robotics Impact Areas Energy Transportation Project SoFi - The Soft Robotic Fish Distributed Robotics Laboratory Exploration of underwater life with an acoustically controlled soft robotic fish Joseph DelPreto Leads Joseph DelPreto Research Areas AI & ML Human-Computer Interaction Robotics Impact Areas Entertainment Transportation Joseph DelPreto Project Soft Contact Modeling Robot Locomotion Group We are juggling a puck sliding on a table, using only a pretensioned rubber band. Daniela Rus Russ Tedrake Leads Daniela Rus Russ Tedrake Research Areas Robotics Daniela Rus Russ Tedrake Project Wearable Blind Navigation Distributed Robotics Laboratory We enable independent navigation for visually impaired users through a wearable feedback system using time-of-light sensors or depth cameras. Leads Research Areas Graphics & Vision Human-Computer Interaction Robotics Impact Areas Health Care Transportation Project Social Network Extraction from GPS Datasets with Coresets Distributed Robotics Laboratory We extract the underlying hidden relations from the given location-based datasets (e.g. GPS data) and we estimate (approximate) the hidden a social network in the data by using a particular data reduction algorithm (i.e., by using coresets). Daniela Rus Leads Daniela Rus Research Areas Algorithms & Theory Security & Cryptography Daniela Rus Project Task-Driven Co-Optimization Of Articulated Robots Distributed Robotics Laboratory A robot's physical form and its motion are innately coupled - in order to change its physical design, one must often change the way it moves, and vice versa. Can computers automatically and simultaneously design robot structure and motion? Leads Research Areas Graphics & Vision Robotics Project Safety Standards for Autonomous Vehicles Distributed Robotics Laboratory In this project, we aim to develop a framework that can ensure and certify the safety of an autonomous vehicle. By leveraging research from the area of formal verification, this framework aims to assess the safety, i.e., free of collisions, of a broad class of autonomous car controllers/planners for a given traffic model. Daniela Rus Leads Daniela Rus Research Areas Algorithms & Theory Robotics Impact Areas Transportation Daniela Rus 19 More Groups Community of Research Embodied Intelligence Community of Research Our goal is to understand the nature of intelligent behavior in the physical world, through the study of human intelligence and the design and implementation of intelligent robots. +17 Nicholas Roy Leads Nicholas Roy Research Areas Robotics Lead Nicholas Roy +17 Nicholas Roy Research Group Distributed Robotics Laboratory We aim to develop the science of autonomy toward a future with robots and AI systems integrated into everyday life, supporting people with cognitive and physical tasks. +8 Daniela Rus Leads Daniela ",
  "content_length": 18531,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:47"
}