{
  "name": "Daniela Raicu",
  "homepage": "http://facweb.cs.depaul.edu/Dstan",
  "status": "success",
  "content": "Home - Daniela Stan Raicu Daniela Stan Raicu Associate Provost for Research, Professor Jarvis College of Computing and Digital Media, DePaul University, Chicago, IL Daniela Stan Raicu is the Associate Provost for Research and a Professor in the Jarvis College of Computing and Digital Media at DePaul University, Chicago. She is the co-director of the Medical Informatics and the Intelligent Multimedia Processing Laboratories. Daniela is the founding Director of the Center for Data Science at DePaul. Her research interests include medical imaging, multimedia retrieval, pattern recognition and data mining. Daniela's projects have been funded by the National Science Foundation (NSF), Argonne National Laboratory, Department of Education, and McArthur Foundation. She is the recipient of the DePaul Excellence in Teaching Award 2008, the DePaul Spirit of Inquiry Award in 2010, and the IBM Faculty Innovation Award in 2010. She also serves on the National Council of the Upsilon Pi Epsilon (UPE) honor society in Computer and Information Sciences since 2008. Daniela holds a Ph.D. in Computer Science from Oakland University, Michigan, a M.A. in Computer Science from Wayne State University, Michigan, and a B.S. in Mathematics from University of Bucharest, Romania. Publications * Veeramreddy N. K. R., Mishra A., Maglani N., Shaik S., McCabe K., Furst JD., Raicu DS., Tchoua R., Sourati J., \"Leveraging hidden patterns in open-ended health worker notes to improve prediction\". 21st IEEE International Conference on eScience , Chicago, Ilinois, September 15–18, 2025 Wang Y., Patel C., Tchoua R., Furst JD., Raicu DS., \"Harnessing Generative AI for Lung Nodule Spiculation Characterization\". Journal of Imaging Informatics in Medicine , 2025 Piane J., Ramaraj T., Furst JD., Raicu DS. \"Video Label Refinement for Temporal Localization\". IEEE International Conference on Multimedia & Expo (ICME), Nantes, France, June 30-July 4, 2025 See More Grants * Principal Investigator: VS-EDGE: Visual-Semantic Explanations for Diagnostic GuidancE, National Institute of Health, 2025-2028 Principal Investigator: Smart and Connected Communities Program: SCHOLAR: Smart, Connected, and Healthy Outcomes from Leveraging Assets and Research, National Science Foundation, 2024-2027 Co-Principal Investigator: ASPirin in Reducing Events in the Elderly (ASPREE) -eXtension, National Institutes of Health (sub-award), 2022 Co-Principal Investigator: Collaborative Research: HDR DSC: The Metropolitan Chicago Data Science Corps (MCDC): Learning from Data to Support Communities, National Science Foundation, 2021 Principal Investigator: REU Site - Medical Informatics eXperiences (MedIX), National Science Foundation, 2020 Leadership Activities * UPE President, 2021-2023 Organizing Committee Co-chair, The NSF CISE REU PIs meeting, 2023, Austin, Texas & 2021, Chicago, Illinois (virtual) Program Committee Co-Chair, IEEE International Conference on Machine Learning and its Applications (ICMLA), 2021 (virtual) Organizing Committee Co-Chair, The NSF CISE REU New PIs meeting, 2022 (virtual) * These are the most recent publications, grants, and leadership activities. Additional Activities Participated in the Annual UPE Executive Council meetings, 2008-2022 Reviewed UPE and ACM scholarship applications Invited Talk: Computer Science and Addiction Science: Bringing Fields Together to Solve Important Problems”, National Institute on Drug Abuse (NIDA) and the National Science Foundation (NSF) virtual meeting, December 1st and 6th, 2021 (2 panel presentations). Research Administration: Ibata-Arens K., Gulansingam N., Raicu DS. \"Doing More (Support) with Less (Budget) for our Faculty Development and Scholarship Success: Data-based Analytics and Faculty (Concept Clusters)”, The 63th National Council for University Research Administrators (NCURA) Annual Meeting, Washington DC, August 30 2022 [Abstract and Interactive Session Presentation]. News & Events January 27, 2023 DePaul and Rosalind Franklin award interdisciplinary research grants DePaul University and Rosalind Franklin University of Science and Medicine are funding three faculty research projects that bring together artificial intelligence, biomedical discovery and health care. The competitive grants kickstart research among interdisciplinary teams, which include biologists, computer scientists, a geographer and a physicist. Read More October 26, 2020 Data scientists fill in gaps on race, ethnicity in COVID-19 testing Thousands of people are being tested for COVID-19 each day, but collecting complete demographic information, including race and ethnicity, has proven difficult. Data science researchers at DePaul University have stepped up in Chicago to help public health officials fill in this missing information. Read More February 10, 2020 DePaul Celebrates Academic Creativity at Inaugural Innovation Day What are the underlying causes of gun violence? What's it like to work in a game studio? How do you best teach an online course? With support from the Academic Growth and Innovation Fund, these are a few of the questions DePaul faculty are addressing. DePaul’s inaugural Innovation Day, held Jan. 24, showcased faculty initiatives and offered participants guidance on how to pursue their own ideas. Read More Last modified: August 8, 2024",
  "content_length": 5321,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:48"
}