{
  "name": "Daniel M. Berry",
  "homepage": "https://cs.uwaterloo.ca/~dberry",
  "status": "success",
  "content": "Daniel M. Berry's Home Page Daniel M. Berry's Home Page Daniel M. Berry For a higher resolution, much larger version, of the same For a larger older picture For an even larger older picture For a huge picture For the previous main picture For the previous, previous main picture For the previous, previous, previous main picture Daniel M. Berry's Current Affiliation University of Waterloo Cheriton School of Computer Science Contents of This Page Research in Software Engineering, Requirements Engineering, and Electronic Publishing Handbook of ambiguities in requirements specifications and legal contracts Education and brief biography Full resume, on-line copies Research and Publications Summary Bibliography, including reprints and on-line copies Lectures that I am willing to come and give Teaching, courses that I have taught and that I am teaching Reaching and finding me at work and at home Hobbies Thanksgiving turkey, why we eat turkey on Thanksgiving NOW INVALID: Where to get GOOD, genuine New York bagels in Kitchener-Waterloo Biblical commentary I have written My contribution to The Annals of Improbable Research's Universal History Translation Project My advice on how to avoid jet lag My advice on how to finish your Ph.D. Me in Full Academic Regalia at a PhD Defense in Europe Caricatures that have been drawn of me About my hearing and why I do not speak Hebrew Directions to Haifa and the Technion For old time's sake, my old .plan file Research in Software Engineering, Requirements Engineering, and Electronic Publishing I conduct and supervise research in Software Engineering including the following topics: Inevitable Pain of Software Development Requirements Engineering Understanding Roles in Requirements Engineering Importance of Ignorance and the Role of an Ignoramus in Requirements Engineering House Building as a Metaphor for Software Engineering Emotions, Values, and Beliefs in Requirements Engineering The Customer's Role in Requirements Engineering Empirical Observations of Requirements Engineering Natural Language in Requirements Engineering Abstraction Identification Ambiguity in Natural Language Requirements Specifications The Dangerous ``All'' in Natural Language Requirements Specifications User's Manuals as Requirements Specifications Multimedia Hypermedia Requirements Identification Protyping to Requirements Requirements Engineering of Software for the Handicapped Electronic Publishing Multi-Lingual Text Processing Dynamic Fonts for Typesetting Calligraphy, especially for Arabic, Hebrew, Persian, and Urdu WYSIWYG-Batch Pic and the Evaluation of its User-Interface ASCII Server for Windowed Applications Bi-Directional VIM for Arabic, Hebrew, Persian, and Urdu Look at explanations, research and thesis topics, and goals. As part of this research, I participate in one international organization: International Federation for Information Processing (IFIP) Working Group (WG) 2.9, Requirements Engineering My research is done as part of more than one laboratory at Waterloo: Computer Systems Group Software Engineering Laboratory To see URLs of research related Web sites: I am on the editorial boards of: Requirements Engineering Journal published by Springer-Verlag Empirical Software Engineering Journal published by Springer-Verlag Science of Computer Programming published by Springer-Verlag I used to maintain the website of the RE (International Requirements Engineering Conference) series. The current instantiation of this series: 27th IEEE International Requirements Engineering Conference, 23 -- 27 September 2019, Jeju Island, South Korea Handbook of Ambiguities in Requirements Specifications and Legal Contracts Two computer scientists (Erik Kamsties and I) and one lawyer--computer scientist (Mickey Krieger) have written ``From Contract Drafting to Software Specification: Linguistic Sources of Ambiguity, A Handbook''. This handbook is intended to be a living document. We invite comments, additional examples, etc. from readers. If you wish to provide translations of the examples into equally ambiguous sentences in other languages, please contact me (just to make sure that someone else is not already doing it!). As we get these translations, we shall add them to the original document or make them available as separate documents or both! Education and Brief Biography Ph.D., Computer Science, Brown University, 1974 B.S., Mathematics, Rensselaer Polytechnic Institute, 1969 A Brief Biography Full resume Full Resume in PDF form Research and Publications Summary Research Interests and Representative Publications Bibliography Published Papers (Hard-Copy Reprints Available for Some and On-Line Copies Available for Some) Erik Kamsties and I have written a chapter titled ``Ambiguity in Requirements Specification'' in a book, edited by Julio Leite and Jorge Doorn, titled Perspectives on Software Requirements, published by Kluwer, with table of contents . Lectures I give a number of socko lectures that are guaranteed to enliven an audience and to knock everyone's socks off. If you want me to give one of these and are willing to pay my travel expenses and a modest honorarium, send e-mail to me to make arrangements. See the abstracts of possible lectures to help choose one. The three most popular these days are ``The Inevitable Pain of Software Development: Why There Is No Silver Bullet'', ``Formal Methods, the Very Idea, Some Thoughts'', and ``Requirements Engineering Lessons from House Building''. These are based on papers that I have written, which you can find by searching for the words ``The Inevitable Pain of Software Development'', ``Formal Methods, the Very Idea, Some Thoughts on Why They Work When They Work'', ``Creep'', and ``Adventures'' (there are several versions of the first two) in the bibliography. One of my sets of slides have been made public, with my permission, by WeberDev.com. You might want to look at them. Better yet, you might want me to come to deliver these slides in person; they are so much better in person. It has been said that I am very energetic during my lectures, that I move around a lot during my ``dance'' routine. At CMU's SEI, they were videotaping whole courses as I taught them. I was told that following my dancing around wore out several video camera servo mechanisms and that following my dancing with the camera was good training for televising hockey games with their fast moving pucks. You might wish to see three ``still'' photos of me giving a lecture at PUC in Rio de Janeiro, taken on 1 August 2003 by Leonardo Cunha. In the first, my hand and mouth are a blur, in the second, my arm is a blur, and in the third, I am in a rare quiescent state. Teaching Technion: MATAM--Introduction to System Programming (Winter 1996) Software Engineering Methods (Spring 1997) Seminar: Electronic Publishing (Spring 1997) Seminar: Requirements Engineering (Winter 1997) Seminar: Full Year SE Lab: Requirements Engineering of WD-PIC (Winter 1997) Waterloo: Software Abstraction and Specification (CS246) (Spring 2000) ( Permanent Course Web Page) Software Requirements and Specification (ECE451/CS445/CS645) Software Requirements and Specification (SE463) Social Implications of Computing (CS492/CS692) Advanced Topics in Requirements Engineering (CS846) Advanced Topics in Electronic Publishing (CS846) Reaching Me Work Address Cheriton School of Computer Science University of Waterloo, 200 University Ave. West Waterloo, Ontario N2L 3G1 Canada None: I do not hear well enough to hear on the phone; so faxing or e-mailing me is better) fax: +1-519-888-4305 (or if that does not work, then try +1-519-746-5422) e-mail address My office is where? My office is 3329 Davis Centre. This room is in the Computer Systems Group suite, which is on the third floor, just above the Cheriton School of Computer Science's main office on the second floor. Home Address 11-522 Beechwood Drive Waterloo, Ontario N2T 2G9 Canada Directions to my house assuming that you are already in Waterloo telefax: 1-519-885-7222 I do not hear well enought to hear on the phone. Therefore, even if I am at home, I do not answer the phone unless I am expecting your call at the time of the call. Regardless of what the answering machine says, do not leave a recorded message for me . Instead, send me a fax over the same line or send me e-mail Hobbies My hobbies are skiing, skating, swimming, Star Trek, cooking, and reading Mad Magazine, Annals of Improbable Research, and about Cosmology. Thanksgiving Turkey A scholarly paper on why North American folk eat turkey on Thanksgiving Day (PDF/Acrobat form) A scholarly lecture on why North American folk eat turkey on Thanksgiving Day (PDF/Acrobat form) An alternative explanation of the origins of the U.S. Thanksgiving. Enjoy! A well-researched article about the many names of the turkey and why, in any place, it tended to be named as a bird from another place. It covers many of the same names that my article does. It does reveal something of which I was not aware, that the bird originated in Mexico. Wow, and not one place has named the bird ``Mexican Bird''. Also, in this article, the bird is eaten for Christmas. Enjoy! NO LONGER VALID: Where to Get GOOD, Genuine New York Bagels in Kitchener-Waterloo I am sad to report that the store mentioned below went out of business at the end of April 2015, after 35 years in business. A letter to the local newspaper in October 2000 about the Best Bagel in Kitchener-Waterloo, Rise and Shine Bagels at 52 Bridgeport East, Waterloo, which is open Fridays and Saturdays 7:30am--2:00pm A LiVEJOURNAL discussion on bagels in Kitchener-Waterloo. An article by Jennifer Ormston in the 26 December 2007 issue of Waterloo Chronicle Business section on Rise and Shine Bagel. I agree with Brian's assessment that the bagels available in supermarkets and other stores are no replacement for his New York style bagels. Biblical Commentary I have written and published some biblical commentary, titled ``Un",
  "content_length": 17214,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:24"
}