{
  "name": "Daniel L. Chester",
  "homepage": "https://www.eecis.udel.edu/~chester",
  "status": "success",
  "content": "Daniel Chester's Home Page Daniel Chester's Home Page Retired Associate Professor Department of Computer and Informational Sciences University of Delaware Newark, Delaware 19716 Phone (302) 831 - 1955 Email chester at udel.edu Research Interests The focus of my research is knowledge representation. Much of the work in artificial intelligence involves encoding a problem in some representation, solving the problem and presenting the solution in some representation. The representations for input, output and intermediate calculations are interpreted by humans, however, and that interpretation is their sole source of meaning. Unfortunately, the interpretation is done informally; it seldom has the formal semantics behind it that the interpretation of logical or mathematical formulas has. My goal is to develop knowledge representations, especially for the intermediate calculations, that derive their meaning in a more rigorous way than is usually done, and that depend less on human interpretation to have meaning. Lately, I have been focusing on two projects. 1. Build a general game player that would be suitable for competition in the general game player contest that is held every year. This is a program that is given a description of a new game written in the language GDL (Game Description Language), spends a small amount of time analyzing that description, and then plays against other general game player programs. It is thus an AI program that is capable of playing many games, not just one game such as Chess or Go. I just graduated a PhD student in the area of game theory; now it is time to put what we learned into practice. 2. I have been working for years on processing images (GIF files) of bar charts and line graphs so as to produce a text representation (xml file) of the contents of those images. Other members of the research team (students working with other faculty here) take those text representations and generate English descriptions of the message that the bar charts and line graphs convey. We need to do the processing of such images better. One problem in particular is OCR (optical character recognition). There are words, phrases and sometimes even sentences in these images, but commercial OCR programs cannot handle them properly because the size of the characters is so small. Small letters may be only five or six pixels high, and if the image is a JPEG file, there is a lot of noise in the form of ghosting caused by the lossy compression that JPEG uses. We need a better OCR system that can handle low resolution images of text. Curriculum Vitae(PDF) Experience and Honors Selected Publications Current Courses Photos from Second China Trip Photos from Mayan Ruins Tour My Secret Obsession! Delaware Astronomical Society Past Preliminary Exam Questions last updated April 22, 2025",
  "content_length": 2827,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:20"
}