{
  "name": "Daniel Cremers",
  "homepage": "http://vision.in.tum.de/members/cremers",
  "status": "success",
  "content": "Computer Vision Group - Prof. Dr. Daniel Cremers Direkt zum Inhalt springen Login Computer Vision GroupTUM School of Computation, Information and TechnologyTechnical University of Munich Technical University of Munich Menu Links Informatik IX Computer Vision Group Boltzmannstrasse 3 85748 Garching info@vision.in.tum.de Follow us on: YouTube X / Twitter Facebook News 26.02.2025 We have twelve papers accepted to CVPR 2025. Check our publication page for more details. 24.10.2024 LSD SLAM received the ECCV 2024 Koenderink Award for standing the Test of Time. 03.07.2024 We have seven papers accepted to ECCV 2024. Check our publication page for more details. 09.06.2024GCPR / VMV 2024 GCPR / VMV 2024 We are organizing GCPR / VMV 2024 this fall. 04.03.2024 We have twelve papers accepted to CVPR 2024. Check our publication page for more details. More Navigation Home Application Form TUM AI Lecture Series Members Prof. Dr. Daniel Cremers Collaborators CV Publications Research Talks Dr. Nikita Araslanov Dr. Arielle Helmick Dr. Almut Sophia Koepke Dr. Haoang Li Dr. Hector Andrade Loarca News Input Template Publications Dr. Riccardo Marin Dr. Roman Pflugfelder Dr. Alexandra Stang Dr. Xi Wang Dr. Yan Xia News Input Template Publications Wagnersa Quirin Lohr Ido Akov Mohammed Brahimi Qing Cheng Jason Chui Weirong Chen Cecilia Curreli Dr. Thomas Dages Oussema Dhaouadi Publications Viktoria Ehm Jonathan Eichhorn Marvin Eisenberger Maolin Gao Mariia Gladkova Linus Härenstam-Nielsen Florian Hofherr Regine Hartwig Christian Koke Qadeer Khan Dávid Komorowicz Mateo de Mayo Johannes Meier Dominik Muhle Shenhan Qian Karnik Ram Christoph Reich Lu Sang Abhishek Saroha Dominik Schnaus Yuesong Shen Daniil Sinitsyn Sergei Solonets Christian Tomani Ellia Wamese Mark Weber Simon Weber Felix Wimbauer Xuqin Wang Tarun Yenamandra Publications Zhenzhang Ye Ganlin Zhang Research Areas Visual SLAM Photometry-Based Reconstruction Geometry Processing FIRe🔥: Fast Inverse Rendering using Directional and Signed Distance Functions Deep Learning Multiagent Biomedicine Publications Teaching Winter Semester 2025/26 Master Seminar - Recent Advances in 4D Computer Vision (5 ECTS) Internal Computer Vision III: Detection, Segmentation and Tracking (IN2375) Seminar: Selected Topics in Deep Learning -- Equivariance & Dynamics (5 ECTS) Papers Seminar: Advanced topics in Graph Learning (5 ECTS) Potential Topics Seminar: Neural Network Design Patterns in Computer Vision (5 ECTS) Practical Course: 3D Shape Analysis and Virtual Humans Applications (10ECTS) Master Seminar - 3D Vision Foundation Models Master Seminar - Modern Methods for 3D Representation and Reconstruction Seminar: Unsupervised Learning in Computer Vision (5 ECTS) Practical Course: Vision-based Navigation IN2106 (6h SWS / 10 ECTS) Materials / Links Summer Semester 2025 Master Seminar - Recent Advances in 4D Computer Vision (5 ECTS) Internal 2nd Practical Course: Applied Foundation Models (10 ECTS) Seminar: Selected Topics in Deep Learning -- Equivariance & Dynamics (5 ECTS) Practical Course: Deep Learning for Spatial AI (10 ECTS) Seminar: Advanced topics in Graph Learning (5 ECTS) Potential Topics Seminar: Modern Methods for 3D Reconstruction and Representation Multiple View Geometry (3D Computer Vision) (IN2228) Seminar: Neural Network Design Patterns in Computer Vision (5 ECTS) Practical Course: 3D Shape Analysis and Virtual Humans Applications (10ECTS) Practical Course: Vision-based Navigation IN2106 (6h SWS / 10 ECTS) Materials / Links Winter Semester 2024/25 Computer Vision III: Detection, Segmentation and Tracking (IN2375) Introduction to Deep Learning (IN2346) Introduction to Deep Learning (IN2346) Master Seminar - Beyond Deep Learning (5 ECTS) Master Seminar - Recent Advances in 4D Computer Vision (5 ECTS) Internal Master Seminar - Visual-based 3D/4D Reconstruction (5 ECTS) Master Seminar: 3D Shape Matching and Application in Computer Vision (5 ECTS) Practical Course: Creation of Deep Learning Methods (10 ECTS) Practical Course: Expert-Level Deep Learning (10 ECTS) Seminar: Advanced topics in Graph Learning (5 ECTS) Potential Topics Seminar: Deep Learning for the Natural Sciences (5 ECTS) List of potential papers Seminar: Foundation Models for Computer Vision (5 ECTS) Materials for Foundational Models in 2D and 3D Computer Vision Seminar: The Evolution of Motion Estimation and Real-time 3D Reconstruction Material Page: The Evolution of Motion Estimation and Real-time 3D Reconstruction Seminar: Transfer Learning and Continual Learning in Computer Vision (5 ECTS) Summer Semester 2024 Computer Vision II: Multiple View Geometry (IN2228) Master Seminar - HuMANS: 3D Human Motion Analysis (5 ECTS) Internal Master Seminar: 3D Shape Matching and Application in Computer Vision (5 ECTS) Practical Course: Applied Foundation Models in Computer Vision (10 ECTS) Practical Course: Creation of Deep Learning Methods (10 ECTS) Practical Course: Expert-Level Deep Learning (10 ECTS) Practical Course: Geometric Scene Understanding (10 ECTS) Practical Course: Vision-based Navigation IN2106 (6h SWS / 10 ECTS) teaching:ss2024:visnav_ss2024:material Seminar: Advanced topics in Graph Learning (5 ECTS) Seminar: Advanced topics in Graph Learning (5 ECTS) Seminar: Deep Learning for the Natural Sciences (5 ECTS) List of potential papers Summaries Seminar: Neural Network Design Patterns in Computer Vision (5 ECTS) Winter Semester 2023/24 Computer Vision III: Detection, Segmentation and Tracking Master Seminar: 3D Shape Matching and Application in Computer Vision (5 ECTS) Practical Course: Creation of Deep Learning Methods (10 ECTS) Practical Course: Expert-Level Deep Learning (10 ECTS) Seminar: Advanced topics in Graph Learning (5 ECTS) Potential Topics Seminar: Foundational Models for 2D and 3D Computer Vision (5 ECTS) Materials for Foundational Models in 2D and 3D Computer Vision Seminar: Neural Network Design Patterns in Computer Vision (5 ECTS) Seminar: The Evolution of Motion Estimation and Real-time 3D Reconstruction teaching:ws2023:seminar_realtime3d:material Summer Semester 2023 Computer Vision II: Multiple View Geometry (IN2228) Practical Course: Creation of Deep Learning Methods (10 ECTS) Practical Course: Geometric Scene Understanding (10 ECTS) GSU-SS23: Download Practical Course: Hands-on Deep Learning for Computer Vision and Biomedicine (10 ECTS) Practical Course: Learning For Self-Driving Cars and Intelligent Systems (10 ECTS) Practical Course: Shape Reconstruction and Matching in Computer Vision (10 ECTS) Practical Course: Vision-based Navigation IN2106 (6h SWS / 10 ECTS) Materials / Links Seminar Course: Advanced topics in Graph Learning (5 ECTS) Potential Topics Seminar: Beyond Deep Learning: Selected Topics on Novel Challenges (5 ECTS) Seminar: Recent Advances in 3D Computer Vision Material for Archive Online Courses Computer Vision I: Variational Methods Machine Learning for Robotics and Computer Vision Computer Vision II: Multiple View Geometry Visual Navigation for Flying Robots Awards Datasets & Software Datasets Software Workshops & Tutorials Prof. Dr. Daniel Cremers Professor of Informatics and MathematicsChair of Computer Vision & Artificial IntelligenceTechnical University of MunichSchool of Computation, Information and TechnologyInformatics 9Boltzmannstrasse 385748 GarchingGermanyTel: +49-89-289-17755Fax: +49-89-289-17757Office: 02.09.054Mail: cremers@tum.de Research Interests Computer vision, machine learning & deep networks, mathematical image analysis (segmentation, motion estimation, multiview reconstruction, visual SLAM), shape analysis, autonomous systems & self-driving cars, variational methods and partial differential equations, convex and combinatorial optimization & statistical inference. Brief Bio Daniel Cremers received Bachelor degrees in Mathematics (1994) and Physics (1994), and a Master's degree in Theoretical Physics (1997) from the University of Heidelberg. In 2002 he obtained a PhD in Computer Science from the University of Mannheim, Germany. Subsequently he spent two years as a postdoctoral researcher at the University of California at Los Angeles (UCLA) and one year as a permanent researcher at Siemens Corporate Research in Princeton, NJ. From 2005 until 2009 he was associate professor at the University of Bonn, Germany. Since 2009 he holds the Chair of Computer Vision and Artificial Intelligence at the Technical University of Munich. His publications received several awards, including the 'Best Paper of the Year 2003' (Int. Pattern Recognition Society), the 'Olympus Award 2004' (now called 'German Pattern Recognition Award'), the '2005 UCLA Chancellor's Award for Postdoctoral Research' and the 'ECCV 2024 Koenderink Test of Time Award'. For pioneering research he received a Starting Grant (2009), two Proof of Concept Grants (2014 & 2018), a Consolidator Grant (2015) and an Advanced Grant (2020) by the European Research Council. Professor Cremers has served as associate editor for several journals including the International Journal of Computer Vision, the IEEE Transactions on Pattern Analysis and Machine Intelligence and the SIAM Journal of Imaging Sciences. He has served as area chair (associate editor) for ICCV, ECCV, CVPR, ACCV, IROS, etc, and as program chair for ACCV 2014. In 2018 he organized the largest ever European Conference on Computer Vision in Munich with 3300 delegates. He is member of the Bavarian Academy of Sciences and Humanities. He served as honorary member of the Dagstuhl Scientific Directorate. In December 2010 he was listed among \"Germany's top 40 researchers below 40\" (Capital). On March 1st 2016, Prof. Cremers received the Gottfried Wilhelm Leibniz Award, the biggest award in German academia. The year 2022/23 he spent on sabbatical at Oxford University hosted by the Deparment of Engineering and as a visiting fellow of Exeter College. According to Google Scholar, Prof. Cremers has an h-index of 128 and his papers have been cited 83919 times. According t",
  "content_length": 12161,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:04"
}