{
  "name": "Daniel Gruss",
  "homepage": "https://gruss.cc",
  "status": "success",
  "content": "Daniel Gruss Daniel Gruss I'm a university professor in the Secure Systems group at the Graz University of Technology, Institute of Applied Information Processing and Communications. In my research I explore software-based microarchitectural attacks and operating system features. I teach undergraduate courses such as Operating Systems (see Hall of Fame), System-Level Programming, Information Security, and Introduction to Scientific Working, and, together with my PhD students, graduate courses such as Side Channel Security, Secure Software Development, Cloud Operating Systems. PhD Students and Graduates Michael Schwarz. November 2019. Now Tenured Faculty member at CISPA. Moritz Lipp. August 2021. Now at Amazon AWS. Claudio Canella. November 2022. Now at Amazon AWS. Martin Schwarzl. February 2023. Now at Cloudflare. Andreas Kogler. August 2024. Now at Apple. Jonas Juffinger. July 2025. Currently PostDoc/Independent. Lukas Giner. July 2025. Currently PostDoc. Current PhD students: Stefan Gast, Fabian Rauscher, Roland Czerny, Hannes Weissteiner, Sudheendra Raghav Neela, Carina Fiedler, Simone Franza You can find a collection of Photos of our Group and Activities here. Publications 2025 August Verifying DRAM Addressing in Software Martin Heckel, Florian Adamsky, Jonas Juffinger, Fabian Rauscher, Daniel Gruss. ESORICS, Toulouse, France, September 22-26, 2025. [Conference] Epistemology of Rowhammer Attacks: Threats to Rowhammer Research Validity Martin Heckel, Hannes Weissteiner, Florian Adamsky, Daniel Gruss. ESORICS, Toulouse, France, September 22-26, 2025. [Conference] Zero-Click SnailLoad: From Minimal to No User Interaction Stefan Gast, Nora Puntigam, Simone Franza, Sudheendra Raghav Neela, Daniel Gruss, Johanna Ullrich. ESORICS, Toulouse, France, September 22-26, 2025. [Conference] Systematic Analysis of Kernel Security Performance and Energy Costs Fabian Rauscher, Benedict Herzog, Timo Hönig, Daniel Gruss. AsiaCCS, Ha Noi, Vietnam, August 25-29, 2025. [Conference] Fast and Efficient Secure L1 Caches for SMT Lukas Giner, Roland Czerny, Simon Lammer, Aaron Giner, Paul Gollob, Jonas Juffinger, Daniel Gruss. ARES, Ghent, Belgium, August 11-14, 2025. [Conference] TEEcorrelate: An Information-Preserving Defense against Performance-Counter Attacks on TEEs Hannes Weissteiner, Fabian Rauscher, Robin Leander Schröder, Jonas Juffinger, Stefan Gast, Jan Wichelmann, Thomas Eisenbarth, Daniel Gruss. 34th USENIX Security Symposium, Seattle, WA, USA, August 13-15, 2025. [Conference] TDXploit: Novel Techniques for Single-Stepping and Cache Attacks on Intel TDX Fabian Rauscher, Luca Wilke, Hannes Weissteiner, Thomas Eisenbarth, Daniel Gruss. 34th USENIX Security Symposium, Seattle, WA, USA, August 13-15, 2025. [Conference] When Good Kernel Defenses Go Bad: Reliable and Stable Kernel Exploits via Defense-Amplified TLB Side-Channel Leaks Lukas Maar, Lukas Giner, Daniel Gruss, Stefan Mangard. 34th USENIX Security Symposium, Seattle, WA, USA, August 13-15, 2025. [Conference] July The HMB Timing Side Channel: Exploiting the SSD's Host Memory Buffer Jonas Juffinger, Hannes Weissteiner, Thomas Steinbauer, Daniel Gruss. DIMVA, Graz, Austria, July 9-11, 2025. [Conference] Cohere+Reload: Re-enabling High-Resolution Cache Attacks on AMD SEV-SNP Lukas Giner, Sudheendra Raghav Neela, Daniel Gruss. DIMVA, Graz, Austria, July 9-11, 2025. [Conference] Real-World Study of the Security of Educational Test Systems Stefan Gast, Sebastian Daniel Felix, Alexander Steinmaurer, Jonas Juffinger, Daniel Gruss. Workshop on Operating Systems and Virtualization Security (OSVS), Venice, Italy, July 4, 2025. [Conference] June Not So Secure TSC Jonas Juffinger, Sudheendra Raghav Neela, Daniel Gruss. ACNS'25, Munich, Germany, June 23-26, 2025. [Conference] February CounterSEVeillance: Performance-Counter Attacks on AMD SEV-SNP Stefan Gast, Hannes Weissteiner, Robin Leander Schröder, Daniel Gruss. NDSS'25, San Diego, CA, USA, February 23-28, 2025 (AR: 16.5%). [Conference] A Systematic Evaluation of Novel and Existing Cache Side Channels Fabian Rauscher, Carina Fiedler, Andreas Kogler, Daniel Gruss. NDSS'25, San Diego, CA, USA, February 23-28, 2025 (AR: 16.5%). [Conference] Secret Spilling Drive: Leaking User Behavior through SSD Contention Jonas Juffinger, Fabian Rauscher, Giuseppe La Manna, Daniel Gruss. NDSS'25, San Diego, CA, USA, February 23-28, 2025 (AR: 16.5%). [Conference] KernelSnitch: Side-Channel Attacks on Kernel Data Structures Lukas Maar, Jonas Juffinger, Thomas Steinbauer, Daniel Gruss, Stefan Mangard. NDSS'25, San Diego, CA, USA, February 23-28, 2025 (AR: 16.5%). [Conference] 2024 October Cross-Core Interrupt Detection: Exploiting User and Virtualized IPIs Fabian Rauscher, Daniel Gruss. CCS'24, Salt Lake City, UT, USA, October 14-18, 2024 (AR: 16.7%). [Conference] August SnailLoad: Exploiting Remote Network Latency Measurements without JavaScript Stefan Gast, Roland Czerny, Jonas Juffinger, Fabian Rauscher, Simone Franza, Daniel Gruss. 33rd USENIX Security Symposium, Philadelphia, PA, USA, August 14-16, 2024. [Conference] [Website] July Presshammer: Rowhammer and Rowpress without Physical Address Information Jonas Juffinger, Sudheendra Raghav Neela, Martin Heckel, Lukas Schwarz, Florian Adamsky, and Daniel Gruss. DIMVA'24, Lausanne, Switzerland, July 17-19, 2024 (AR: 23.9%). [Conference] Generic and Automated Drive-by GPU Cache Attacks from the Browser Lukas Giner, Roland Czerny, Christoph Gruber, Fabian Rauscher, Andreas Kogler, Daniel De Almeida Braga, Daniel Gruss. AsiaCCS'24, Singapore, July 1-5, 2024 (AR: 22.1%). [Conference] [Demo Website] April SUIT: Secure Undervolting with Instruction Traps Jonas Juffinger, Stepan Kalinin, Daniel Gruss, Frank Mueller. ASPLOS'24, San Diego, CA, USA, April 27 - May 1, 2024 (AR: 18.4%). [Conference] March JavaSQUIP: Remote Scheduler Contention Attacks Stefan Gast, Jonas Juffinger, Lukas Maar, Christoph Royer, Andreas Kogler, Daniel Gruss. FC'24, Willemstad, Curaçao, March 4-8, 2024 (AR: 21.1%). [Conference] February IdleLeak: Exploiting Idle State Side Effects for Information Leakage Fabian Rauscher, Andreas Kogler, Jonas Juffinger, Daniel Gruss. NDSS'24, San Diego, CA, USA, February 26 - March 1, 2024 (AR: 20.6%). [Conference] 2023 December DOPE: DOmain Protection Enforcement with PKS Lukas Maar, Martin Schwarzl, Fabian Rauscher, Daniel Gruss, Stefan Mangard. Annual Computer Security Applications Conference (ACSAC), Austin, TX, USA, December 4-8, 2023 (AR: 23.3%). [Conference] August Collide+Power: Leaking Inaccessible Data with Software-based Power Side Channels Andreas Kogler, Jonas Juffinger, Lukas Giner, Lukas Gerlach, Martin Schwarzl, Michael Schwarz, Daniel Gruss, Stefan Mangard. 32nd USENIX Security Symposium, Anaheim, CA, USA, August 9-11, 2023 (AR: 29.0%). [Conference] Side-Channel Attacks on Optane Persistent Memory Sihang Liu, Suraaj Kanniwadi, Martin Schwarzl, Andreas Kogler, Daniel Gruss, Samira Khan. 32nd USENIX Security Symposium, Anaheim, CA, USA, August 9-11, 2023 (AR: 29.0%). [Conference] June PT-Guard: Integrity-Protected Page Tables to Defend Against Breakthrough Rowhammer Attacks Anish Saxena, Gururaj Saileshwar, Jonas Juffinger, Andreas Kogler, Daniel Gruss, Moinuddin Qureshi. DSN, Porto, Portugal, June 27-30, 2023 (AR: 19.6%). [Conference] Layered Binary Templating Martin Schwarzl, Erik Kraft, Daniel Gruss. ACNS, Kyoto, Japan, June 19-22, 2023 (AR: 20.2%). [Conference] May Practical Timing Side-Channel Attacks on Memory Compression Martin Schwarzl, Pietro Borrello, Gururaj Saileshwar, Hanna Müller, Michael Schwarz, Daniel Gruss. S&P'23, San Francisco, CA, USA, May 22-26, 2023 (AR: 17.0%). [Conference] Scatter and Split Securely: Defeating Cache Contention and Occupancy Attacks Lukas Giner, Stefan Steinegger, Antoon Purnal, Maria Eichlseder, Thomas Unterluggauer, Stefan Mangard, Daniel Gruss. S&P'23, San Francisco, CA, USA, May 22-26, 2023 (AR: 17.0%). [Conference] CSI:Rowhammer - Cryptographic Security and Integrity against Rowhammer Jonas Juffinger, Lukas Lamster, Andreas Kogler, Maria Eichlseder, Moritz Lipp, Daniel Gruss. S&P'23, San Francisco, CA, USA, May 22-26, 2023 (AR: 17.0%). [Conference] SQUIP: Exploiting the Scheduler Queue Contention Side Channel Stefan Gast, Jonas Juffinger, Martin Schwarzl, Gururaj Saileshwar, Andreas Kogler, Simone Franza, Markus Köstl, Daniel Gruss. S&P'23, San Francisco, CA, USA, May 22-26, 2023 (AR: 17.0%). [Conference] February Programmable System Call Security with eBPF Jinghao Jia, YiFei Zhu, Dan Williams, Andrea Arcangeli, Claudio Canella, Hubertus Franke, Tobin Feldman-Fitzthum, Dimitrios Skarlatos, Daniel Gruss, Tianyin Xu. arXiv, 2302.10366. [arXiv] 2022 September Robust and Scalable Process Isolation against Spectre in the Cloud Martin Schwarzl, Pietro Borrello, Andreas Kogler, Kenton Varda, Thomas Schuster, Michael Schwarz, Daniel Gruss. ESORICS, Copenhagen, Denmark, September 26-30, 2022 (AR: 18.5%). [Conference] August Half-Double: Hammering From the Next Row Over Andreas Kogler, Jonas Juffinger, Salman Qazi, Yoongu Kim, Moritz Lipp, Nicolas Boichat, Eric Shiu, Mattias Nissler, Daniel Gruss. 31st USENIX Security Symposium, Boston, MA, USA, August 10-12, 2022 (AR: 18.1%). [Conference] ÆPIC Leak: Architecturally Leaking Uninitialized Data from the Microarchitecture Pietro Borrello, Andreas Kogler, Martin Schwarzl, Moritz Lipp, Daniel Gruss, Michael Schwarz. 31st USENIX Security Symposium, Boston, MA, USA, August 10-12, 2022 (AR: 18.1%). [Conference] Minefield: A Software-only Protection for SGX Enclaves against DVFS Attacks Andreas Kogler, Daniel Gruss, Michael Schwarz. 31st USENIX Security Symposium, Boston, MA, USA, August 10-12, 2022 (AR: 18.1%). [Conference] AMD Prefetch Attacks through Power and Time Moritz Lipp, Daniel Gruss, Michael Schwarz. 31st USENIX Security Symposium, Boston, MA, USA, August 10-12, 2022 (AR: 18.1%). [Conference] Rapid Prototyping for Microarchitectural Attacks Catherine Easdon, Michael Schwarz, Martin Schwarzl,",
  "content_length": 29357,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:09"
}