{
  "name": "Daniele Antonioli",
  "homepage": "https://francozappa.github.io",
  "status": "success",
  "content": "Daniele Antonioli Search Daniele Antonioli Assistant Professor EURECOM Software & System Security (S3) Biography Ciao, I am Daniele, an Assistant Professor (Class 1) at EURECOM with the software and system security (S3) group. I am doing research and teaching in applied system security and privacy with an emphasis on wireless communication, such as Bluetooth and Wi-Fi, embedded systems, such as cars and fitness trackers, mobile systems such as smartphones, and cyber-physical systems such as industrial control systems. In 2025, I got the French HDR (Habilitation à diriger des Recherches) from the École polytechnique presenting a thesis and talk titled “Security and Privacy for Connected Devices”. In 2020, spent one year and a half as a Postdoc with Mathias Payer’s HexHive group at École Polytechnique Fédérale de Lausanne (EPFL). During my postdoc, among others, I’ve participated in the design, implementation and evaluation of DP3T/GAEN, a privacy-preserving contact-tracing technology now used by Android and iOS for proximity tracing. I hold a PhD in Computer Science from the Singapore University of Technology and Design (SUTD). My PhD thesis is titled “Design, Implementation, and Evaluation of Secure Cyber-Physical and Wireless Systems”. During my PhD I spent six months at the Computer Science Department of the University of Oxford as a visiting researcher advised by Kasper Rasmussen, and ten months as a visiting researcher at the Helmholtz Center for Information Security (CISPA) advised by Nils Ole Tippenhauer. I hold a BS and MS in Electronics and Telecommunications Engineering from the University of Bologna (UniBO). I spent three months at the University of Massachusetts (UMass Amherst) as a research assistant to prepare my master thesis titled Design and Testing of Random Number Generators (RNG) advised by Wayne Burleson and Riccardo Rovatti. Interests Mobile and Wireless Systems Cyber-Physical Systems Industrial Control System Automotive Systems IoT Protocols Applied Cryptography SoCurity Education French HDR, 2025 École polytechnique (EP) PhD in Computer Science, 2019 Singapore University of Technology and Design (SUTD) MS in Electronics and Telecommunications Engineering, 2013 University of Bologna (UniBO) BS in Electronics and Telecommunications Engineering, 2010 University of Bologna (UniBO) Projects * All CPS Protocol Bluetooth Dec 17, 2024 AttackDefense Framework (ADF) The ADF is a threat modeling framework for IoT devices and life cycles Jan 26, 2023 ENCOPIA Enabling connected privacy assurance Jan 26, 2023 Open-source ReSilient Hardware and software for Internet of thiNgs (ORSHIN) Building contrained devices pivoting on open-source hardware and software Mar 5, 2022 Bluetooth BLUR Attacks (BLURtooth) Standard-compliant attacks on Bluetooth’s Cross-Transport Key Derivation (CTKD) Aug 7, 2020 DP3T/GAEN for COVID-19 Decentralized and privacy-preserving tracing techologies May 18, 2020 Bluetooth BIAS Attacks Standard-compliant Bluetooth Impersonation AttackS (BIAS) Aug 20, 2019 Bluetooth KNOB Attacks Standard-compliant attacks to the Key Negotiation Of Bluetooth (KNOB) Feb 2, 2019 Reversing and Attacking Google Nearby Reverse-engineering and attacking Google Nearby Connections API for Android Nov 7, 2017 MiniCPS Framework A framework for Cyber-Physical Systems real-time simulation, built on top of Mininet Publications S. Boussaha, V. Fresno-Gomez, T. Barber, D. Antonioli (2025). EmuOCPP: Effective and Scalable OCPP Security and Privacy Testing. USENIX VehicleSec. PDF Cite Code Project Project Video D. Donadel, G. Crestanello, G. Morandini, D. Antonioli, M. Conti, M. Merro (2025). SimProcess: High Fidelity Simulation of Noisy ICS Physical Processes. ACM CPSS. PDF Cite Project BPA 🏆 V. Zubkov, T. Sacchetti, D. Antonioli, M. Strohmeier (2025). Bluetooth Security Testing with BlueToolkit: a Large-Scale Automotive Case Study . USENIX WOOT. PDF Cite Code Project Project Video DEF CON 32 S. Boussaha, V. Fresno-Gomez, T. Barber, D. Antonioli (2025). CheckOCPP: Automatic OCPP Packet Dissection and Compliance Check. IEEE ACSW. PDF Cite Code Project Slides M. Casagrande, D. Antonioli (2025). CTRAPS: CTAP Impersonation and API Confusion on FIDO2. IEEE Euro S&P. PDF Cite Code Project Project Poster Slides Demos CVE-2024-35311 YSA-2024-02 DEF CON 33 Off By One M. Casagrande, R. Cestaro, E. Losiouk, M. Conti, D. Antonioli (2024). E-Trojans: Ransomware, Tracking, DoS, and Data Leaks on Battery-powered Embedded Systems. Preprint. Preprint Cite Project Project BHUS'25 Dark Reading T. Sacchetti, M. Bognar, J. De Meulemeester, B. Gierlichs, F. Piessens, V. Bezsmertnyi, MC. Molteni, S. Cristalli, A. Gringiani, O. Thomas, D. Antonioli (2024). AttackDefense Framework (ADF): Enhancing IoT Devices and Lifecycles Threat Modeling. ACM TECS. PDF Cite Code Project Tutorial S. Boussaha, L. Hock, M. Bermejo, R. Cuevas Rumin, A. Cuevas Rumin, D. Klein, M. Johns, L. Compagna, D. Antonioli, T. Barber (2024). FP-tracer: Fine-grained Browser Fingerprinting Detection via Taint-tracking and Multi-level Entropy-based Thresholds. PETS. PDF Cite Code Project Slides Video D. Antonioli (2023). BLUFFS: Bluetooth Forward and Future Secrecy Attacks and Defenses. ACM CCS. PDF Cite Code Project Slides 37c3 37c3 Slides THCON'24 CVE-2023-24023 M. Casagrande, R. Cestaro, E. Losiouk, M. Conti, D. Antonioli (2023). E-Spoofer: Attacking and Defending Xiaomi Electric Scooter Ecosystem. ACM WiSec. PDF Cite Code Project Poster Slides Video Demos THCON'24 M. Casagrande, E. Losiouk, M. Conti, M. Payer, D. Antonioli (2022). BreakMi: Reversing, Exploiting and Fixing Xiaomi Fitness Tracking Ecosystem. IACR CHES. PDF Cite Code Project Poster Slides Video Demos HWIO'23 D. Antonioli, M. Payer (2022). On the Insecurity of Vehicles Against Protocol-Level Bluetooth Threats. IEEE WOOT. PDF Cite Code Project Project Slides Video CVE-2019-9506 CVE-2020-10135 See all publications Talks CTRAPS: CTAP Client Impersonation and API Confusion on FIDO2 Talk on CTRAPS attacks on FIDO2 as part of ETHZ ZISC seminars. Jun 20, 2025 00:00 Zurich FP-tracer: Fine-grained Browser Fingerprinting Detection via Taint-tracking and Multi-level Entropy-based Thresholds Talk on FP-tracer and browser fingerprinting at Privasky'25. Mar 18, 2025 00:00 Correncon en Vercors (Grenoble) On the Insecurity of Vehicles Against Protocol-Level Bluetooth Threats Talk on Automotive Bluetooth Security at AMUSEC'25. Cars are some of the most security-critical consumer devices. On the one hand, owners expect rich infotainment features, including audio, hands-free calls, contact management, or navigation through their connected mobile phone. On the other hand, the infotainment unit exposes exploitable wireless attack surfaces. This talk focuses on protocol-level Bluetooth threats on vehicles, a critical but unexplored wireless attack surface. These threats are crucial because they are portable across vehicles, and they can achieve impactful goals, such as accessing sensitive data or even taking remote control of the vehicle. Their evaluation is novel as prior work focused on other wireless attack surfaces, notably Bluetooth implementation bugs. Among relevant protocol-level threats, we pick the KNOB and BIAS attacks because they provide the most effective strategy to impersonate arbitrary Bluetooth devices and are not yet evaluated against vehicles. Mar 14, 2025 00:00 Marseille A Quest to Secure Standard and Proprietary Wireless Systems In this talk we will explore recent research on real world wireless security protocols. We will cover standard protocols such as Bluetooth pairing and session establishment and proprietary ones such as IoT application layer protocols used to secure traffic between companion mobile applications and electric scooters and fitness trackers. Jul 22, 2024 00:00 University of Verona (UniVR) Information and Entertainment for Automotive Researchers Keynote given at ACSW'24 (EuroS&P Workshop) covering Automotive Bluetooth Security and E-Spoofer. Jul 8, 2024 00:00 Vienna A Quest to Secure Proprietary and Standard Wireless Protocols Keynote given at RESSI'24 covering, among others, BLUFFS, E-Spoofer, and BreakMi. May 17, 2024 00:00 Eppe-Sauvage A Quest to Secure Standard and Proprietary Wireless Protocols Talk covering, among others, BLUFFS, E-Spoofer, and BreakMi. May 14, 2024 00:00 Virtual See all events Posts CTRAPS interview on Off By One Security Marco and I talked about CTRAPS with Stephen Sims from Off By One Security about CTRAPS: CTAP Impersonation and API Confusion on FIDO2. Thank you Stephen and Randall for inviting us and keep up with the awesome content in your YouTube channel! Sep 22, 2025 1 min read CTRAPS at Euro S&P'25 and DEF CON 33 This week we presented at IEEE Euro S&P'25 CTRAPS: CTAP Impersonation and API Confusion on FIDO2, a paper about the security and privacy of FIDO2, a widespread standard used for single-factor and multi-factor authentication. We focus on the Client to Authenticator Protocol (CTAP), an application layer protocol spoken by a FIDO2 authenticator (e.g., a YubiKey) and a client (e.g., a smartphone or a laptop). We uncover seven CTAP design issues in the FIDO2 standard, including the lack of Client to Authenticator authentication, and eleven related new attacks we call CTRAPS. Jul 4, 2025 2 min read NDSS'26 Artifact Evaluation Comitee Self-Nomination Mathy Vanhoef and I are co-chairing NDSS'26 Artifact Evaluation (AE). We are looking for motivated PhD and Postdocs to self-nominate themselves for the NDSS'26 Artifact Evaluation Committee (AEC). Joining it would offer them practical experience and may ease developing artifact submissions for their papers. Jun 13, 2025 1 min read KNOB Attack and Crypto 101 by Alfred Menezes Alfred Menezes has published a fantastic online course on real-world cryptography called Crypto 101: Real-World Deployments. It is an honor to be featured in the Bluetooth Security Lecture (Lecture 4) which talks about the KNOB attack. ",
  "content_length": 12816,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:49"
}