{
  "name": "Daniela Nicklas",
  "homepage": "https://www.uni-bamberg.de/mobi/team/daniela-nicklas",
  "status": "success",
  "content": "Daniela Nicklas - Lehrstuhl für Informatik, insbesondere Mobile Softwaresysteme/Mobilität Prof. Dr. Daniela NicklasLehrstuhl-InhaberinAkademische AufgabenStudiengangsbeauftragte B.Sc. InformatikSprecherin der Bamberg Graduate School for Smart City ScienceBotschafterin der Gesellschaft für InformatikGewähltes Mitglied im Fachkollegium Informatik der DFGForschungsthemenDatenmanagement für sensor-basierte AnwendungenMobile SoftwaresystemeDatenstrommanagement und EreignisverarbeitungAnwendungsdomänen: Smart City, Smart AgricultureKurzbiographieDaniela Nicklas übernahm am 1.4.2014 den neu eingerichteten TAO-Lehrstuhl für Informatik, insbesondere mobile Softwaresysteme/Mobilität an der Universität Bamberg. Sie promovierte 2005 an der Universität Stuttgart im Sonderforschungsbereich \"Nexus - Umgebungsmodelle für mobile kontextbezogene Systeme\". Nach einer PostDoc-Phase dort übernahm sie 2008 die Juniorprofessur für Datenbank- und Internettechnologien an der Universität Oldenburg, wo sie am An-Institut OFFIS auch angewandt in den Domänen Automotive und Maritime Informatiksysteme forschte.  Kern ihrer Forschung ist das Datenmanagement für oft mobile, sensor-basierte Systeme, die sie in Bamberg auch direkt vor Ort im Living Lab Bamberg, einem Erprobungsraum für Smart City-Anwendungen untersucht und entwickelt. Gemeinsam mit Prof. Dr. Marc Redepenning und Prof. Dr. Astrid Schütz leitet sie das Smart City Research Lab der Universität Bamberg und ist die Sprecherin der im November 2024 gegründeten Bamberger Graduiertenschule für Smart City Science. Sie ist gewähltes Mitglied des Fachkollegiums 409 \"Informatik\" der Deutschen Forschungsgemeinschaft.Im März und April 2024 besuchte sie auf Einladung von Prof. Hirozumi Yamaguchi das Mobile Computing Lab an der University of Osaka.VeröffentlichungenBei ...DBLP Computer science BibliographyGoogle Scholar Further information can be found on the English version of this page Kontakt Prof. Dr. Daniela Nicklas An der Weberei 5 Raum: WE5/05.041 96047 Bamberg/ DeutschlandTelefon: +49 (0)951/863-3670E-Mail:daniela.nicklas(at)uni-bamberg.deRaum: WE5/05.041Sprechstunde: Dienstag, 16:00 - 18:00 Uhr (bitte formlos per E-Mail anmelden)",
  "content_length": 2191,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:48"
}