{
  "name": "Daniel Wichs",
  "homepage": "http://www.ccs.neu.edu/home/wichs",
  "status": "success",
  "content": "Daniel Wichs Daniel Wichs Professor Khoury College of Computer Sciences. Northeastern University wichs@ccs.neu.edu Senior Scientist NTT Research About Me [CV] I am a professor at the Khoury College of Computer Science at Northeastern University. I am part of the cryptography and privacy group, which is part of theory and security. My main research area is cryptography. Some of the topics I work on are: Computing on encrypted data and program obfuscation. Lattice-based cryptography Information-theoretic cryptography Foundations of cryptography See a short video on my work. I am also broadly interested in computer security, algorithms, complexity theory, coding theory and information theory. Prior to joining Northeastern, I was a Josef Raviv Memorial Postdoctoral Fellow at IBM Research T.J. Watson (2011-2013). I got my PhD in Computer Science at New York University (NYU) in 2011. I was very fortunate to have Yevgeniy Dodis as my advisor. I got my Bachelor's degree in Mathematics and Master's degree in Computer Science at Stanford University in 2005. Thanks: To Quanta magazine and WIRED for covering my group's work. To the STOC 2023 PC for the best paper award. To J.P. Morgan for the 2022 faculty research award. To the Alfred P. Sloan Foundation for the 2018 Sloan Research Fellowship. To the NSF for the 2018 CAREER Award. Research Group Current Alumni Manu Kondapaneni (PhD student) LaKyah Tyner (PhD student, co-advised with abhi shelat) Ethan Mook (PhD student) Cody Freitag (Khoury Distinguished Postdoc) Jad Silbak (Khoury Distinguished Postdoc) Wei-Kai Lin (Postdoc → Professor at Univerdity of Virginia) Chethan Kamath (Postdoc → Postdoc at Tel Aviv → Professor at IIT Bombay) Omer Paneth (Postdoc → Professor at Tel Aviv University) Siyao Guo (Postdoc → Professor at NYU Shanghai) Mor Weiss (Postdoc → Postdoc at IDC Herzliya → Professor at Bar Ilan) Ron Rothblum (Postdoc → Professor at Technion) Alessandra Scafuro (Postdoc → Professor at North Carolina State) Willy Quach (PhD student → Postdoc at Weizmann Institute) Ariel Hamlin (PhD student → Research Scientist and MIT Lincoln Labs →Teaching Professor at Northeastern) Giorgos Zirdelis (PhD student → Postdocs at U Maryland) Zahra Jafargholi (PhD student → Postdoc at Aarhus University) Teaching Spring 2025 CS 7810: Foundations of Cryptography Fall 2024 CS3800 Theory of Computation Spring 2024 CS 7870 Seminar in TCS: Computing on Encrypted Data Fall 2023 CS3800 Theory of Computation Spring 2022 CS 4805/7805 Computational Complextity Fall 2021 CS 7810: Foundations of Cryptography Spring 2021 CS 4805/7805 - Advanced/Graduate Theory of Computation Fall 2020 CS 7880 Special Topics in Cryptography Spring 2020 CS 4770/6750 Cryptgoraphy Spring 2018 CS 7805 - PhD Theory of Computation Fall 2017 CS 7810: Foundations of Cryptography Spring 2017 CS 7805 - PhD Theory of Computation Fall 2016 CS 3800 - Theory of Computation Fall 2015 CS 7880: Graduate Cryptography (Topics in Theory) Spring 2015 CS 3800 - Theory of Computation Fall 2014 CS 3800 - Theory of Computation Spring 2014 CS 6750 - Cryptography and Communications Security Fall 2013 CS 3800 - Theory of Computation Service Co-organizer of the Charles River Crypto Day. Co-organizer of the Simons Summer Program in Cryptography, 2025. Steering Committee of ITC Area Chair: CRYPTO 2025, EUROCRYPT 2024 Program Chair: ITC 2020 General Chair: STOC 2016 Program Committees: CRYPTO 25, STOC 2025, TCC 2024, EUROCRYPT 2024, FOCS 2023, CRYPTO 2022, ITCS 2022, EUROCRYPT 2021, TCC 2020, SCN 2020, FOCS 2019, CRYPTO 2018, TCC 2017, EUROCRYPT 2017, FOCS 2016, TCC 2015, ASIACRYPT 2014, ITCS 2014, PKC 2014, CRYPTO 2013, ICITS 2012, TCC 2012, SCN 2012, ICITS 2011 Publications [DBLP], [Scholar], [IACR] Preprints Cryptographic Aspects of DNA Screening C. Baum, H. Cui, I. Damgaard, K. Esvelt, M. Gao, D. Gretton, O. Paneth, R. Rivest, V. Vaikuntanathan, D. Wichs, A. Yao, Y. Yu [pdf] Publications 2025 Binary Codes for Computationally Bounded Errors Under Standard Crypto Assumptions G. Lu, J. Silbak, D. Wichs FOCS 2025 Succinct Non-interactive Arguments of Proximity L. Chen, Z. Jin, D. Wichs STOC 2025 Unambiguous SNARGs for P from LWE with Applications to PPAD Hardness L. Chen, C. Freitag, Z. Jin, D. Wichs STOC 2025 Black Box Crypto is Useless for Doubly Efficient PIR W. Lin, E. Mook, D. Wichs EUROCRYPT 2025 Unique NIZKs and Steganography Detection W. Quach, L. Tyner, D. Wichs EUROCRYPT 2025 Binary Codes for Error Detection and Correction in a Computationally Bounded World J. Silbak, D. Wichs   [pdf] EUROCRYPT 2025 Detecting and Correcting Computationally Bounded Errors: A Simple Construction Under Minimal Assumptions J. Silbak and D. Wichs   [pdf] ITCS 2025 2024 Adaptively Secure Attribute-Based Encryption from Witness Encryption B. Waters and D. Wichs   [pdf] TCC 2024 Interval Key-Encapsulation Mechanism A. Bienstock, Y. Dodis, P. Paul Rösler and D. Wichs   [pdf] ASIACRYPT 2024 How to Simulate Random Oracles with Auxiliary Input Y. Dodis, A. Jain, R. Lin, J. Luo and D. Wichs   [pdf] FOCS 2024 PIR with Client-Side Preprocessing: Information-Theoretic Constructions and Lower Bounds Y. Ihsai, E. Shi and D. Wichs   [pdf] CRYPTO 2024 Doubly Efficient Cryptography: Commitments, Arguments and RAM MPC WK Lin, E. Mook and D. Wichs   [pdf] CRYPTO 2024 Laconic Function Evaluation and ABE for RAMs from (Ring-)LWE F. Dong, Z. Hao, E. Mook, H. Wee, and D. Wichs   [pdf] CRYPTO 2024 Laconic Function Evaluation, Functional Encryption and Obfuscation for RAMs with Sublinear Computation F. Dong, Z. Hao, E. Mook, and D. Wichs   [pdf] EUROCRYPT 2024 2023 Multi-Instance Randomness Extraction and Security against Bounded-Storage Mass Surveillance J. Guan, D. Wichs, and M. Zhandry   [pdf] TCC 2023 Lower Bounds on Anonymous Whistleblowing L. Tyner, W. Quach, and D. Wichs   [pdf] TCC 2023 Security with Functional Re-Encryption from CPA Y. Dodis and S. Halevi and D. Wichs   [pdf] TCC 2023 Universal Amplification of KDM Security: From 1-Key Circular to Multi-Key KDM B. Waters and D. Wichs   [pdf] CRYPTO 2023 The Pseudorandom Oracle Model and Ideal Obfuscation A. Jain, H. Lin, J. Luo, D. Wichs   [pdf] CRYPTO 2023 Doubly Efficient Private Information Retrieval and Fully Homomorphic RAM Computation from Ring LWE WK Lin, E. Mook and D. Wichs   [pdf] STOC 2023 best paper award Boosting Batch Arguments and RAM Delegation Y. Tauman Kalai, A. Lombardi, V. Vaikuntanathan, D. Wichs   [pdf] STOC 2023 Speak Much, Remember Little: Cryptography in the Bounded Storage Model, Revisited Y. Dodis, W. Quach and D. Wichs [pdf] EUROCRYPT 2023 A Map of Witness Maps: New Definitions and Connections S. Chakraborty, M. Prabhakaran, and D. Wichs [pdf] PKC 2023 2022 Post-Quantum Insecurity from LWE A. Lombardi, E. Mook, W. Quach and D. Wichs [pdf] TCC 2022 Witness Encryption and Null-IO from Evasive LWE V. Vaikuntanathan, H. Wee and D. Wichs [pdf] ASIACRYPT 2022 Nearly Optimal Property Preserving Hashing J. Holmgren, M. Liu, L. Tyner and D. Wichs [pdf] CRYPTO 2022 Refuting the Dream XOR Lemma via Ideal Obfuscation and Resettable MPC S. Badrinarayanan, Y. Ishai, D. Khurana, A. Sahai, and D. Wichs [pdf] ITC 2022 Incompressible Cryptography J. Guan, D. Wichs and M. Zhandry [pdf] EUROCRYPT 2022 Authentication in the Bounded Storage Model Y. Dodis, W. Quach and D. Wichs [pdf] EUROCRYPT 2022 Small-Box Cryptography Y. Dodis, H. Karthikeyan, D. Wichs [pdf] ITCS 2022 2021 Updatable Public Key Encryption in the Standard Model Y. Dodis, H. Karthikeyan, D. Wichs [pdf] TCC 2021 Succinct LWE Sampling, Random Polynomials, and Obfuscation L. Devadas, and W. Quach, V. Vaikuntanathan, H. Wee, and D. Wichs [pdf] TCC 2021 Limits on the Adaptive Security of Yao's Garbling C. Kamath, K. Klein, K. Pietrzak and D. Wichs [pdf] CRYPTO 2021 Targeted Lossy Functions and Applications W. Quach, B. Waters and D. Wichs [pdf] CRYPTO 2021 Candidate Obfuscation via Oblivious LWE Sampling H. Wee and D. Wichs [pdf] EUROCRYPT 2021 2020 Optimal Broadcast Encryption from LWE and Pairings in the Standard Model S. Agrawal, D. Wichs, and S. Yamada,  [pdf] TCC 2020 Leakage-Resilient Key Exchange and Two-Seed Extractors X. Li, F. Ma, W. Quach, and D. Wichs  [pdf] CRYPTO 2020 Incompressible Encodings T. Moran and D. Wichs  [pdf] CRYPTO 2020 Extracting Randomness from Extractor-Dependent Sources Y. Dodis, V. Vaikuntanathan, and D. Wichs  [pdf] EUROCRYPT 2020 Statistical ZAPR Arguments from Bilinear Maps A. Lombardi, V. Vaikuntanathan and D. Wichs  [pdf] EUROCRYPT 2020 Two-Round Oblivious Transfer from CDH or LPN N. Döttling, S. Garg, M. Hajiabadi, D. Masny and D. Wichs  [pdf] EUROCRYPT 2020 Witness Maps and Applications S. Chakraborty, M. Prabhakaran, and D. Wichs,  [pdf] PKC 2020 2019 Broadcast and Trace with N^epsilon Ciphertext Size from Standard Assumptions R. Goyal, W. Quach, B. Waters and D. Wichs  [pdf] CRYPTO 2019 Non-Malleable Codes for Decision Trees M. Ball, S. Guo and D. Wichs  [pdf] CRYPTO 2019 Fully Homomorphic Encryption for RAMs A. Hamlin, J. Holmgren, M. Weiss and D. Wichs  [pdf] CRYPTO 2019 New Constructions of Reusable Designated-Verifier NIZKs A. Lombardi, W. Quach, R. Rothblum, D. Wichs and D. Wu  [pdf] CRYPTO 2019 Adaptively Secure MPC with Sublinear Communication Complexity R. Cohen, a. shelat and D. Wichs  [pdf] CRYPTO 2019 Fiat-Shamir: From Practice to Theory R. Canetti, Y. Chen, J. Holmgren, A. Lombardi, G. Rothblum, R. Rothblum, and D. Wichs STOC 2019 (Merge of [CCHLRR] and [CLW]) Private Anonymous Data Access A. Hamlin, R. Ostrovsky, M. Weiss and D. Wichs [pdf] EUROCRYPT 2019 Worst-Case Hardness for LPN and Cryptographic Hashing via Code Smoothing Z. Brakerski, V. Lyubashevsky, V. Vaikuntanathan and D. Wichs  [pdf] EUROCRYPT 2019 Reusable Designated-Verifier NIZKs for all NP from CDH W. Quach, R. Rothblum, and D. Wichs [pdf] EUROCRYPT 2019 2018 Traitor-Tracing from LWE Made Simple and Attribute-Based Y.Chen, V. Vaikuntanathan, B. Waters, H. Wee, and D. Wichs, [pdf] TCC 2018 Watermarking PRFs under Standard Assumptions: Pu",
  "content_length": 19531,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:41"
}