{
  "name": "Daniel B. Larremore",
  "homepage": "http://danlarremore.com",
  "status": "success",
  "content": "Daniel B. Larremore Daniel B. Larremore Asst. Professor, Univ. Colorado Boulder BioFrontiers Institute & Dept. of Computer Science (gratuitous collaboration graph - hover or click) News 2019 Nov 15 - Postdoc Opportunity! What happens when you apply ecological or social frameworks to understand the dynamics of scientific research? I don't know yet! That's why I'm looking for a postdoc with Aaron Clauset! Open to PhDs in quant social science, ecology, math, physics, etc. Nov 15! Apply here by November 15. Email me if you have questions. 2019 Dec 15-20 - I'll be at the Complex Networks Winter Workshop in Quebec City. 2019 November 8 - I'll be at the Colorado School of Mines to give the Department of Applied Mathematics and Statistics Colloquium. 2019 Oct 24-26 - NIMBIOS network null models working group. 2019 Oct 1 - Presented a Lab Workshop: Giving a Talk 2019 Aug 12 - New software paper with Hunter Wapman in The Journal of Open Source Software: webweb: a tool for creating, displaying, and sharing interactive network visualizations on the web. [JOSS][github] About My Work My research focuses on developing methods of networks, dynamical systems, and statistical inference, to solve problems in social and biological systems. I try to keep a tight loop between data and theory, and learn a lot from confronting models and algorithms with real problems. I obtained my PhD in Applied Mathematics from the University of Colorado Boulder in 2012, advised by Juan G. Restrepo, after which I spent three years as a postdoctoral fellow at the Harvard T.H. Chan School of Public Health studying the genetic epidemiology of malaria in the Center for Communicable Disease Dynamics. I then joined the Santa Fe Institute as an Omidyar Fellow until 2017, when I joined the faculty at the University of Colorado Boulder in the Department of Computer Science and the BioFrontiers Institute. Malaria's antigenic variation and evolution - The var genes of the malaria parasite P. falciparum evolve according to complicated and unknown rules, with selective pressures at multiple scales both within hosts and between hosts. I create and use mathematical tools to understand the structural and evolutionary constraints on var gene evolution, and their relationships with parasite virulence, population structure, and epidemiology. Networks and theory - The processes that generate complex networks leave hints about themselves in the patterns of edges, and the relationships between those patterns and vertex metadata. I work on mathematical descriptions of graph ensembles, inference of community structures, vertex ordering or ranking, and using metadata to better understand network formation. The scientific ecosystem - The scientific method of hypothesis, experiment, and conclusion poorly describes modern scientific discovery and productivity. Instead, science is done by people who play various social roles in the ecosystem of science. I investigate faculty hiring, productivity patterns, scientific careers, and the dynamics of discovery through large-scale data collection and modeling. Research Group PhD Students Tzu-Chi Yen studies Computer Science and is interested in statistical models to understand data in the wild, as well as related algorithmic issues. He is also curious about American society and food, and wants to do more hiking and rock climbing in Colorado. He received a B.S. in Biology from National Taiwan University. Hunter Wapman studies Computer Science and is interested in (among other things) models of human behavior and structure in art. He spends his time outside the lab writing fiction, rock climbing, running distance, and reading. He received a B.S. in Computer Science from Tufts University. Erik Johnson studies Applied Math and is interested in using statistical models to answer questions in biology, medicine, and public policy. Outside the lab, he enjoys trail running, road biking, music, and being cool. He received a B.A. in Math and Physics from Northwestern University and an M.S. in Applied Math from CU Boulder. Undergrad Students Apara Venkateswaran studies Applied Math and Computer Science. His research interests lie at the intersection of math and computation?mathematical modeling, stochastic processes, and machine learning. He is currently working to automatically discover structure in documents to facilitate the study of the scientific ecosystem. Suyog Soti studies Computer Science and Applied Math. He is interested in everything that has the potential to enhance human lives; it's mainly machine learning and other AI techniques currently. He plays soccer and climbs when he is not trying to debug his latest project. Katie Younglove studies Computer Science. She is primarily interested data science and machine learning, and is currently working on collecting and parsing data to study faculty hiring and retention. In her free time, Katie enjoys crafting convoluted puns and listening to npr. Papers Under Review or In Prep 2019 \"Network models for malaria: antigens, dynamics, and evolution over space and time\" Lauren M. Childs, Daniel B. Larremore. Accepted. 2018 \"Plasmodium falciparum population genetic complexity influences expression dynamics and immune recognition among highly related genotypic clusters\" Amy K. Bei, Daniel B. Larremore, Kazutoyo Miura, Ababacar Diouf , Nicholas Baro, Rachel F. Daniels, Allison Griggs, Eli L. Moss, Daniel E. Neafsey, Awa B. Deme, Mohammed Sy, Stephen Schaffner, Ambroise D. Ahouidi, Daouda Ndiaye , Tandakha Dieye, Souleymane Mboup, Caroline O. Buckee, Sarah K. Volkman, Carole A. Long, and Dyann F. Wirth. Under review. * denotes equal contribution. Peer-reviewed publications 2019 \"Dynamics of Beneficial Epidemics\" Andrew Berdahl, Christa Brelsford, Caterina De Bacco, Marion Dumas, Vanessa Ferdinand, Joshua A. Grochow, Laurent H?bert-Dufresne, Yoav Kallus, Christopher P. Kempes, Artemy Kolchinsky, Daniel B. Larremore, Eric Libby, Eleanor A. Power, Caitlin A. Stern, Brendan Tracey. In Press. [arXiv]. 2019 \"webweb: a tool for creating, displaying, and sharing interactive network visualizations on the web\" K. Hunter Wapman, Daniel B. Larremore. Journal of Open Source Software, 4(40), 1458. [JOSS][github] 2019 \"Productivity, prominence, and the effects of academic environment\" Samuel F. Way, Allison C. Morgan, Daniel B. Larremore*, Aaron Clauset*. Proceedings of National Academy of Sciences, USA.116 (18). [PDF][PNAS]. 2019 \"Statistical Inference for Network Models\" [code and data] 2019 \"Bayes-optimal estimation of overlap between populations of fixed size\" Daniel B. Larremore. PLoS Computational Biology 15(3): e1006898. [PDF][PLOS Computational Biology][code][web tool]. 2018 \"Robust information capacity requires strong and balanced excitatory and inhibitory synapses\" Vidit Agrawal, Andrew B. Cowley, Woodrow L. Shew, Daniel B. Larremore, Juan G. Restrepo, and Qusay Alfaori. Chaos 28 103115. [Chaos][arXiv]. 2018 \"Statistical Inference for Network Models\" [code and data] 2018 \"A physical model for efficient ranking in networks\" Caterina De Bacco*, Daniel B. Larremore*, and Cristopher Moore. Science Advances, 4(7) eaar8260. [Science Advances][arXiv][code]. 2018 \"Configuring random graph models with fixed degree sequences\" Bailey K. Fosdick*, Daniel B. Larremore*, Joel Nishimura*, and Johan Ugander*. SIAM Review 60 (2) 315-355. [PDF][SIAM Review][arXiv][code and slides]. 2017 \"The misleading narrative of the canonical faculty productivity trajectory\" Samuel F. Way, Allison C. Morgan, Aaron Clauset*, and Daniel B. Larremore*. Proceedings of the National Academy of Sciences, USA 114 (44) E9216-E9223. [PNAS][PDF][arXiv] 2017 \"The ground truth about metadata and community detection in networks\" Leto Peel*, Daniel B. Larremore*, and Aaron Clauset. Science Advances 3(5) e1602548. [PDF][Science Advances][Supplement][code and data]. 2017 \"Community detection, link prediction, and layer interdependence in multilayer networks\" Caterina De Bacco, Eleanor A. Power, Daniel B. Larremore, and Cristopher Moore. Physical Review E 95 042317. [PDF][Phys Rev E][arXiv]. 2016 \"Gender, Productivity, and Prestige in Computer Science Faculty Hiring Networks\" Samuel F. Way, Daniel B. Larremore, and Aaron Clauset. Proc. 2016 World Wide Web Conference (WWW), 1169-1179. [PDF][Proc WWW 2016] 2015 \"Ape parasite origins of human malaria virulence genes\" Daniel B. Larremore, Sesh A. Sundararaman, Weimin Liu, William R. Proto, Aaron Clauset, Dorothy E. Loy, Sheri Speede, Lindsey J. Plenderleith, Paul M. Sharp, Beatrice H. Hahn, Julian C. Rayner*, and Caroline O. Buckee*. Nature Communications 6, 8368. [PDF][Nature Comms] 2015 \"Systematic inequality and hierarchy in faculty hiring networks\" Aaron Clauset, Samuel Arbesman, and Daniel B. Larremore, Science Advances. 1, e1400005. [PDF][Science Advances][code and data][interactive data visualization] 2015 \"Immune characterization of P. falciparum parasites with a shared genetic signature in a region of decreasing transmission\" Amy K. Bei, Ababacar Diouf, Kazutoyo Miura, Daniel B. Larremore, Ulf Ribacke, Gregory Tullo, Eli L. Moss, Daniel E. Neafsey, Rachel F. Daniels, Amir E. Zeituni, Iguosadolo Nosamiefan, Sarah K. Volkman, Ambroise D. Ahouidi, Daouda Ndiaye, Tandakha Dieye, Souleymane Mboup, Caroline O. Buckee, Carole Long, and Dyann F. Wirth, Infection and Immunity 83(1), 276. [PDF][Infection and Immunity] 2014 \"Efficiently inferring community structure in bipartite networks\" Daniel B. Larremore, Aaron Clauset, and Abigail Z. Jacobs, Physical Review E 90(1), 012805. [PDF][Phys Rev E][code and data] 2014 \"Inhibition Causes Ceaseless Dynamics in Networks of Excitable Nodes\" Daniel B. Larremore, Woodrow L. Shew, Edward Ott, Francesco Sorrentino, and Juan G. Restrepo, Physical Review Letters 112, 138103. [PDF] [Phys Rev Letters] 2013 \"A network approach to analyzing highly recombinant malaria parasite genes\" Daniel B. Larremore, Aaron Clauset, and Caroline O. Buckee. PLoS Computational Biology 9(10",
  "content_length": 17937,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:55"
}