{
  "name": "Daniel Goehring",
  "homepage": "https://www.mi.fu-berlin.de/inf/groups/ag-ki/members/Professoren/Daniel_G__hring1.html",
  "status": "success",
  "content": "Prof. Dr. Daniel Göhring • Dahlem Center for Machine Learning and Robotics • Fachbereich Mathematik und Informatik Springe direkt zu Inhalt Fachbereich Mathematik und Informatik/Informatik/Dahlem Center for Machine Learning and Robotics PfadnavigationStartseiteInformatikArbeitsgruppenDahlem Center for Machine Learning and RoboticsMembersProfessorenProf. Dr. Daniel GöhringProf. Dr. Daniel Göhring KontaktLehreForschungPublikationenBildquelle: PrivatDahlem Center for Machine Learning and RoboticsInstitut für InformatikFachbereich Mathematik und InformatikProfessorAdresseArnimallee 7Raum 01914195 BerlinTelefon+49 30 838 75128Fax+49 30 838 465301E-Maildaniel.goehring@fu-berlin.deHomepageHomepage Daniel GöhringSprechstundeSprechstunde: n.V. Office hours: by arrangementSommersemester 2024 VL/Ü Bildverarbeitung Seminar/Proseminar Künstliche Intelligenz - autonome Fahrzeuge Forschungsseminar Autonome Fahrzeuge Wintersemester 2023/2024 VL/Ü Advanced Robotics Seminar/Proseminar Künstliche Intelligenz - autonome Fahrzeuge Forschungsseminar Autonome Fahrzeuge Sommersemester 2023 VL/Ü Robotik Forschungsseminar Autonome Fahrzeuge Wintersemester 2022/2023 VL/Ü Robotik Seminar Künstliche Intelligenz - Autonome Fahrzeuge Forschungsseminar Autonome Fahrzeuge Sommersemester 2022 VL/Ü Bildverarbeitung Seminar Künstliche Intelligenz - Autonome Fahrzeuge Forschungsseminar Autonome Fahrzeuge Wintersemester 2021/2022 VL/Ü Robotik Seminar Künstliche Intelligenz - Autonome Fahrzeuge Forschungsseminar Autonome Fahrzeuge Sommersemester 2021 VL/Ü Objektorientierte Programmierung Seminar Künstliche Intelligenz - Autonome Fahrzeuge Forschungsseminar Autonome Fahrzeuge Wintersemester 2020/2021 (Forschungsfrei / Sabbatical) Forschungsseminar Autonome Fahrzeuge Sommersemester 2020 VL/Ü Bildverarbeitung VL/Ü Robotics Seminar Künstlche Intelligenz - Autonome Fahrzeuge Forschungsseminar Autonome Fahrzeuge Wintersemester 2019/2020 VL/Ü Robotics Forschungsseminar Autonome Fahrzeuge Sommersemester 2019 VL/Ü Robotics Softwareprojekt: Intelligente Systeme und Robotik Seminar Künstliche Intelligenz - Autonome Fahrzeuge Forschungsseminar: Autonome Fahrzeuge Wintersemester 2018/2019 VL/Ü Robotics Forschungsseminar Autonome Fahrzeuge Seminar Künstliche Intelligenz - Autonome Fahrzeuge Sommersemester 2018 VL/Ü Bildverarbeitung Seminar Künstliche Intelligenz - Autonome Fahrzeuge Wintersemester 2017/2018 VL/Ü: Robotics Sommersemester 2017 Seminar Künstliche Intelligenz - Autonome Fahrzeuge Wintersemester 2016/2017 Robotics Seminar Künstiche Intelligenz - Autonome Fahrzeuge Sommersemester 2016 Bildverarbeitung Softwareprojekt Intelligente Systeme und Robotik Seminar Künstliche Intelligenz - Autonome Fahrzeuge Wintersemester 2015/2016 Robotics Seminar Künstliche Intelligenz - Autonome Fahrzeuge Wintersemester 2014/1015 Robotics Seminar Künstliche Intelligenz Softwareprojekt Intelligente Systeme und Robotik Leiter und Gründer des Autonomous Cars-Labs Siehe auch KIS'M Shuttles & Co. CRTX AutoNOMOS, (abgelaufen) Senioren am Steuer (abgelaufen) SAFARI (abgelaufen) Zu den PublikationenFür eine optimale Darstellung dieser Seite aktivieren Sie bitte JavaScript. DatesZur Anzeige dieser Inhalte wird JavaScript benötigt.Übersicht NewsZur Anzeige dieser Inhalte wird JavaScript benötigt.Übersicht",
  "content_length": 3293,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:08"
}