{
  "name": "Daniel Rueckert",
  "homepage": "http://wp.doc.ic.ac.uk/dr",
  "status": "success",
  "content": "Daniel Rueckert | Department of Computing Daniel Rueckert Biography Daniel Rueckert is Professor of Visual Information Processing in the Department of Computing at Imperial College London. Since 2020, he is also Alexander von Humboldt Professor for AI in Medicine and Healthcare at the Technical University of Munich. From 2016 to 2020 he served as Head of the Department of Computing at Imperial College. He gained a MSc from Technical University Berlin in 1993, a PhD from Imperial College in 1997, followed by a post-doc at King’s College London. In 1999 he joined Imperial College as a Lecturer, becoming Senior Lecturer in 2003 and full Professor in 2005. At Imperial, he has founded the Biomedical Image Analysis group consisting of four academics, 15 post-docs and 20 PhD students. He has published more than 500 journal and conference articles as well as graduated over 50 PhD students. He is also co-founder of IXICO, an Imperial College spin-out company. As part of his research activities, he has published over 500 journal and conference articles with over 100,000 citations, graduated over 60 PhD students and supervised and mentored over 40 post-docs. Currently, he is a senior member of the editorial board of Medical Image Analysis, and has served as an associate editor of IEEE Transactions on Medical Imaging, IEEE Transactions on Pattern and Machine Intelligence and Image and Vision Computing and as a referee for several international journals and conferences in the area of Artificial Intelligence, Computer Vision and Medical Imaging. In 2014, he has been elected as a Fellow of the MICCAI society and in 2015 he was elected as a Fellow of the Royal Academy of Engineering and as fellow of the IEEE. More recently has been elected as Fellow of the Academy of Medical Sciences (2019), as Fellow of the American Institute for Medical and Biological Engineering (2021) and Fellow of the German National Academy of Sciences Leopoldina (2023). He is the recipient of the Gottfried Wilhelm Leibniz Prize (2025), which is the most important German research prize endowed with €2.5M by the German Research Foundation (DFG). Please note, we cannot host external students for internships or visits. If you are interested in a PhD please follow the application instructions here. Contact Professor Daniel Rueckert, PhD Room 568, Huxley Building Department of Computing Imperial College London 180 Queen’s Gate London SW7 2AZ, UK Tel: +44 20 75948333 E-Mail: d.rueckert@imperial.ac.uk Print Email to a Friend Email to a Friend Page URL: http://wp.doc.ic.ac.uk/dr/ Your Information: Your Name Your Email Friend’s Information: Friend’s Name Friend’s Email Close Login Main campus address: Imperial College London, South Kensington Campus, London SW7 2AZ, tel: +44 (0)20 7589 5111 Campus maps and information About this site This site uses cookies © Copyright 2016 – Imperial College London",
  "content_length": 2898,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:33"
}