{
  "name": "Daniel Keren",
  "homepage": "https://cs.haifa.ac.il/~dkeren",
  "status": "success",
  "content": "Daniel Keren's Home Page Daniel Keren (Danny Keren) NOTE NEW E-mail: dkeren (AT SIGN HERE) ds.haifa.ac.il Pictures! Pictures! Me Long, long ago (\"tiyul shnati\") Long, long ago (in the 'hood, Beit-Ramet) Recent Publications ICDE 2021 : \"A Distance-Based Scheme for Reducing Bandwidth in Distributed Geometric Monitoring\", Yuval Alfassi, Moshe Gabel, Gal Yehdua, Daniel Keren. Sensors 2022 : \"The non-Tightness of a Convex Relaxation to Rotation Recovery\", Yuval Alfassi, Daniel Keren, Bruce Reznick. Entropy 2022 : \"Communication Efficient Algorithms for Bounding and Approximating the Empirical Entropy in Distributed Systems\", Amit Shahar, Yuval Alfassi, Daniel Keren. Sensors 2023 : \"A Fast and Reliable Solution to PnP, Using Polynomial Homogeneity and a Theorem of Hilbert\", Daniel Keren, Margarita Osadchy, Amit Shahar. arXiv 2023: \"Geometric Covering Using Random Fields\", \tFelipe Goncalves, Daniel Keren, Amit Shahar, Gal Yehuda. ICRA 2024 : \"Efficient Polynomial Sum-Of-Squares Programming for Planar Robotic Arms\", Daniel Keren, Amit Shahar, Roi Poranne. arXiv 2024 : \"A practical, fast method for solving sum-of-squares problems for very large polynomials\", Daniel Keren, Margarita Osadchy, Roi Poranne. TCS, to appear: \"Geometric Covering Using Random Fields\", \tAmit Shahar, Daniel Keren, Felipe Goncalves, Gal Yehuda. Address: Department of Computer Science Haifa University Haifa 31905 Israel Office:   (972) 4-824-9730, Fax:     (972) 4-824-9331 NOTE NEW E-mail:  dkeren (AT SIGN HERE) ds.haifa.ac.il Main areas of interest Analyzing and monitoring large data streams, especially in a distributed setting. Data classification, learning over big data, Bayesian analysis, and regularization. Anything related to applications of polynomials in computer science. All Publications And a little physics (in which I have a passionate but amateurish interest) My slides on quantum mechanics (pdf, 276 pages), comments welcome. A paper on applying path integral methods for probabilistic analysis of pattern matching. A paper in \"Journal of Physics A\" on the uncertainty in regularized solutions. A paper on approximating the harmonic oscillator path integral.",
  "content_length": 2165,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:18"
}