{
  "name": "Daniele Pannone",
  "homepage": "https://sites.google.com/uniroma1.it/danielepannone",
  "status": "success",
  "content": "Daniele PannoneSearch this siteEmbedded FilesSkip to main contentSkip to navigationDaniele PannoneDepartment of Computer Science, Sapienza Università di RomaVia Salaria 113, 00198, RomePersonal Office & Lab: Room 319, Third FloorTel.: +39 06 4991 8438 E-mail: daniele.pannone [at] uniroma1.itDaniele Pannone received both an M.Sc (2015). and Ph.D. (2018) in Computer Science from the Sapienza University of Rome, and he has been a member of the Computer Vision Laboratory (VisionLab) at the Department of Computer Science from 2015 to 2024.  As of 2020, he holds the position of Assistant Professor at the same department, and in 2024, he has Co-Founded the Prometheus Lab. His research interests include machine and deep learning, event recognition, object detection, person re-identification, signal analysis and processing, bioinformatics, human-computer interaction, and robotics. Daniele is also a member of several professional organizations, including IAPR, CVPL, IEEE, ACM, AIxIA, and EurAI.To see my list of publications, visit the following webpage: Google ScholarFor the list of taught courses, see the Sapienza Teacher Page: Teacher PageResearchMy research interests concern the design of Computer Vision, Machine and Deep Learning algorithms for the following areas:Dronistics, e.g., automatic mosaic of areas of interest (mosaicking), identification of changes (change detection), identification and classification of elements present in the scene (object detection and classification);EEG Signal Analysis;Wi-Fi Sensing;Analysis of medical images;Augmented and Virtual Reality;Re-Identification of subjects;Automatic lie detection;Rehabilitation with serious games;Machine and Deep Learning in DNA Sequencing.Report abusePage detailsPage updated Report abuse",
  "content_length": 1772,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:52"
}