{
  "name": "Daniel Bodemer",
  "homepage": "https://www.uni-due.de/psychologische-forschungsmethoden/bodemer.php",
  "status": "success",
  "content": "Leitung des Fachgebiets Leitung des Fachgebiets Prof. Dr. Daniel Bodemer Email Raum Telefon Fax bodemer@uni-due.de LE 634 +49 203 / 379 1993 +49 203 379 / 4769 Sprechstunde nach Vereinbarung Postanschrift Fachgebiet Psychologische Forschungsmethoden – Technology, Learning, Collaboration Abteilung für Human-centered Computing and Cognitive Science Fakultät für Informatik Universität Duisburg-Essen, Campus Duisburg Lotharstraße 65 D-47057 Duisburg Aktuelle Funktionen an der Universität Duisburg-Essen Leitung des Fachgebiets Psychologische Forschungsmethoden – Technology, Learning, Collaboration Leitung der Studiengänge Angewandte Kognitions- und Medienwissenschaft (B.Sc. und M.Sc.) bzw. Menschzentrierte Informatik und Psychologie (B.Sc. und M.Sc.) Mitglied im Fakultätsrat Informatik Mitglied der Abteilungskonferenz Human-centered Computing and Cognitive Science (HCCS) Mitglied im Promotionsausschuss der Fakultät für Informatik Mitglied der Ethikkommission der Fakultät Prof. Dr. Daniel Bodemer ist Inhaber des Lehrstuhls Psychologische Forschungsmethoden – Medienbasierte Wissenskonstruktion (Technology, Learning, Collaboration). Seine Forschungsinteressen umfassen und verknüpfen die Analyse und Unterstützung kollaborativer Lernprozesse (z.B. kognitive Group Awareness Tools), Multimediales Lernen (z.B. multiple und interaktive Repräsentationen) und Selbstreguliertes Lernen (z.B. soziale Metakognition). Er ist Mitantragsteller des aktuellen DFG-Graduiertenkollegs “User-Centred Social Media” und hat weitere Drittmittelförderung von unterschiedlichen Organisationen erhalten. Darüber hinaus war er an unterschiedlichen interdisziplinären Forschungsprogrammen beteiligt, wie z.B. an den NSF und DFG-finanzierten American-German Research Exchange Programs “in the Field of Technology-Supported Education”. Bevor er Anfang 2012 die Professur in Duisburg angetreten hat, war er Wissenschaftlicher Assistent an der Universität Tübingen und assoziierter Mitarbeiter des Leibniz-Institut für Wissensmedien. 2004 wurde er an der Universität Freiburg zum Dr. phil. promoviert, nachdem er als Kollegiat im ersten virtuellen DFG-Graduiertenkolleg „Wissenserwerb und Wissensaustausch mit neuen Medien (VGK)“ mitgewirkt hat. Ausgewählte Projekte und Publikationen.",
  "content_length": 2269,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:55"
}