{
  "name": "Daniel Moyer",
  "homepage": "https://dcmoyer.github.io",
  "status": "success",
  "content": "DCM About Me I am an Assistant Professor of Computer Science at Vanderbilt University. Please reach out if you want to collaborate! I previously was a Post-Doc at MIT CSAIL working with Polina Golland, and prior to that a CS grad student at USC under Greg Ver Steeg and Paul Thompson. My research is focused on machine learning and its applications to medical imaging. News 2022-5-03: Moving to Vanderbilt! 2021-11-03: Congrats to Peiqi and Razvan on their NeurIPS workshop papers; arxiv links to follow. 2021-05-15: MICCAI Early Accept of our Equivariant tracking paper! 2021-05-12: Thanks to Julia Gong for inviting me to talk to her seminar at Stanford. 2021-03-01: I'll be talking at the Dipy workshop (virtually) this year. 2021-03-01: Congrats to Malte, Borjan, and the Fetal team at BCH/HMS/MIT, our automated prescription abstract was accepted at ISMRM 2020-10-01: Our paper on the Worst Scanner Syndrome in Harmonization will be in MedNeurIPS workshop. Selected Publications and Preprints See the full list here: [link] Equivariant Filters for Efficient Tracking in 3D Imaging D Moyer, EA Turk, PE Grant, WM Wells, P Golland MICCAI 2021 (upcoming) Paper (arXiv) Early accept Scanner Invariant Representations for Diffusion MRI Harmonization D Moyer, G Ver Steeg, CMW Tax, PM Thompson Magn Reson in Med., 2020; 00: 1– 16. Paper (arXiv) Invariant Representations without Adversarial Training D Moyer, S Gao, R Brekelmans, G Ver Steeg, A Galstyan Neural Information Processing Systems (NIPS) 2018 Paper (arXiv) | Code (GitHub) Formerly titled \"Evading the Adversary in Invariant Representations\" A Continuous Model of Cortical Connectivity D Moyer, B Gutman, N Jahanshad, J Faskowitz, PM Thompson Medical Image Computing and Computer Assisted Intervention (MICCAI), 2016. Paper PDF (arXiv) | Code (GitHub) | Talk (YouTube) Oral Presentation | Travel Grant | Young Scientist Award (Top 5 student papers) Other Links and Attribution Random collections (unsorted). Helpful Links for humans talking to computers. This website design was copied lock-stock-and-barrel from Sam Way.",
  "content_length": 2081,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:24"
}