{
  "name": "Daniel Kalmanovich",
  "homepage": "https://danielkalmanovich.wixsite.com/website",
  "status": "success",
  "content": "Homepage | Daniel Kalmanovich top of page This website was built on Wix. Create yours today.Get StartedI am a lecturer in the Department of Computer Science at Ariel University.​Before joining the faculty at Ariel University I was a Coleman-Soref postdoctoral fellow at Bar-Ilan University hosted by Ron Adin and Yuval Roichman.​I completed a PhD in mathematics at the Hebrew University of Jerusalem in 2020 advised by Eran Nevo.​Previously, I earned a BSc in mathematics and computer science and completed a MSc in mathematics at the Ben-Gurion University of the Negev advised by Mikhail Klin.​Here is my CV.​Below you can find a brief description of my research interests, a list of my publications and a brief description of my teaching experience and other related activities.Research InterestsMy research interests broadly lie in combinatorics, geometry and topology, theoretical computer science, and applied mathematics. More concretely, I am interested in various aspects and applications of graphs, polytopes and more general cell complexes, and I am working on projects in algebraic combinatorics and face numbers of polytopes association schemes and algebraic graph theory discrete geometry, computational geometry and applications to meshing computational topology and applications to data analysis (TDA) and machine learning ​ The LEB project.PublicationsSubmitted / In preperationOn an infinite family of generalized PBIBDsAbstract: We consider a generalization of the notion of partially balanced incomplete block designs (PBIBDs), by relaxing the requirement that the underlying association scheme be commutative. An infinite family of such generalizations is constructed, one for each prime power q congruent to 1 modulo 4.​arXiv:2110.01847in preperationJournal PublicationsOn flag-no-square 4-manifolds (with Eran Nevo and Gangotryi Sorcar)Abstract:arXiv:2310.13495 Discrete & Computational Geometry (2025)On the realization space of the cube (with Karim Adiprasito and Eran Nevo)Abstract:arXiv:1912.09554 Journal of the European Mathematical Society 26 (2024), no. 1, pp. 261–273On the cone of f-vectors of cubical polytopes​ (with Ron M. Adin and Eran Nevo)Abstract: What is the minimal closed cone containing all f-vectors of cubical d-polytopes? We construct cubical polytopes showing that this cone, expressed in the cubical g-vector coordinates, contains the nonnegative g-orthant, thus verifying one direction of the Cubical Generalized Lower Bound Conjecture of Babson, Billera and Chan. Our polytopes also show that a natural cubical analogue of the simplicial Generalized Lower Bound Theorem does not hold. ​ arXiv:1801.00163 Proceedings of the American Mathematical Society 147 (2019), pp. 1851–1866On D. G. Higman's note on regular 3-graphsAbstract: We introduce the notion of a t-graph and prove that regular 3-graphs are equivalent to cyclic antipodal 3-fold covers of a complete graph. This generalizes the equivalence of regular two-graphs and Taylor graphs. As a consequence, an equivalence between cyclic antipodal distance regular graphs of diameter 3 and certain rank 6 commutative association schemes is proved. New examples of regular 3-graphs are presented.​Ars Mathematica Contemporanea 6 (2013) 99--115Conference ProceedingsOn the realization space of the cube (with Karim Adiprasito and Eran Nevo)FPSAC 2020 online - The 32nd International Conference on Formal Power Series and Algebraic Combinatorics - talkSeminaire Lotharingien de Combinatoire 84B (2020), Art. 80On the cone of f-vectors of cubical polytopes​ (with Ron M. Adin and Eran Nevo)FPSAC 2018 - The 30th International Conference on Formal Power Series and Algebraic Combinatorics - talkSeminaire Lotharingien de Combinatoire 80B (2018), Art. 85TeachingSpring 2023: I was a lecturer for Linear Algebra II for CS at Ariel University. I also gave an undergraduate seminar on Topics in Computational Geometry and Topology. Fall 2022: I was a lecturer for Logic and Set Theory for CS at Ariel University.Spring 2021: I was the lecturer of probability and its applications at the Hebrew University of Jerusalem.​​2015-2020: I was a TA for various Maths and CS courses at the Hebrew University of Jerusalem: Discrete Mathematics, Linear Algebra I, Linear Algebra II, Calculus, Probability and an advanced undergraduate course in Combinatorics.​​2009-2014: I was a TA for various Maths and CS courses at the Ben-Gurion University of the Negev: Algebra I, Algebra II, Linear Algebra for Engineers, Logic and Set Theory, and an advanced undergraduate course in Combinatorics.Other professional activities2009-2010: I had developed courses and was an instructor at Kidumatica: Mathematical Excellence for the Youth, a project held by Prof. Miri Amit at the Ben-Gurion University of the Negev. I developed and taught courses in graph theory, group theory and topology to youth aged 10-16​​2016-2018: In the framework of activities of the Israeli Ministry of Education, I mentored two high school students in two research projects in mathematics, one in combinatorics and the other in low-dimensional topology. One of the projects was awarded the commendation prize in the Young Scientists & Developers in Israel competition.ContactThank you for visiting!Please get in touch to find out more about me and my work.NameEmailPhoneAddressSubjectMessageSubmitThanks for submitting!bottom of page",
  "content_length": 5384,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:16"
}