{
  "name": "Daniel Reidenbach",
  "homepage": "https://www.lboro.ac.uk/departments/compsci/staff/academic-teaching/daniel-reidenbach",
  "status": "success",
  "content": "Daniel Reidenbach | Computer Science | Loughborough University Dr Daniel Reidenbach Visiting Fellow in Computer Science Research groups and centres Theoretical Computer Science Send email Biography Research External activities Daniel studied Computer Science with minors in Mathematics at the University of Kaiserslautern/Germany. After his graduation in 2003 he continued his studies for a PhD degree under the supervision of Rolf Wiehagen, which he completed in 2006. Daniel joined the Department of Computer Science at Loughborough University as a Lecturer in 2007 and was promoted to Senior Lecturer in 2012. He served as Head of Department from 2018 - 2022.  Daniel now works at Keele University. Daniel’s research addresses problems in Theoretical Computer Science and Discrete Mathematics. He is particularly interested in combinatorial and algorithmic problems for patterns in sequences of symbols, and he has published numerous articles on this topic in leading journals. His work solved some longstanding open problems in Algorithmic Learning Theory and Formal Language Theory and was awarded several international academic prizes. Research areas Formal language theory (in particular: pattern languages) Combinatorics on words Algorithmic learning theory Member of the Steering Committee of the WORDS conference series Member of the Editorial Board of Discrete Mathematics & Theoretical Computer Science Conference Co-Chair of BCTCS 2014, WORDS 2019 and CIAA 2020 Current/upcoming conference PC memberships: WORDS 2021 CIAA 2021 CIAA 2022 Previous conference PC memberships for: AITC, CIAA, COLT, LATA, NCMA, SOFSEM, STACS, WORDS Journal referee for Fundamenta Informaticae, Information and Computation, Information Processing Letters, International Journal of Foundations of Computer Science, Journal of Computer and System Sciences, Kybernetika, Machine Learning, RAIRO - Theoretical Informatics and Applications, The Computer Journal, Theoretical Computer Science",
  "content_length": 1977,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:30"
}