{
  "name": "Daniel Stefankovic",
  "homepage": "https://www.cs.rochester.edu/~stefanko",
  "status": "success",
  "content": "Daniel Stefankovic - University of Rochester arXiv DBLP Teaching CSC 284/484 - Advanced Algorithms - Fall 2025 Mo,We 4:50pm-6:05pm Dewey 2110D, see class page. CSC 282/482 - Algorithms - Fall 2025 Tu,Th 11:05pm-12:20pm Wegmans 1400, see class page. Previous courses Algorithms - CSC 282 - Fall 2024 Computational Geometry - CSC 279 - Fall 2024 Algorithms - CSC 282 - Fall 2023 Counting/Sampling Algorithms - CSC 487 - Fall 2023 Algorithms - CSC 282 - Fall 2022 Advanced Algorithms - CSC 484 - Fall 2022 Algorithms - CSC 282 - Fall 2021 Advanced Algorithms - CSC 484 - Fall 2021 Counting/Sampling Algorithms - CSC 487 - Fall 2020 Algorithms - CSC 282 - Fall 2020 Advanced Algorithms - CSC 484 - Spring 2020 Algorithms - CSC 282 - Fall 2019 Advanced Algorithms - CSC 484 - Spring 2019 Algorithms - CSC 282 - Fall 2018 Advanced Algorithms - CSC 484 - Spring 2018 Algorithms - CSC 282 - Fall 2017 Advanced Algorithms - CSC 484 - Spring 2017 Algorithms - CSC 282 - Fall 2016 Advanced Algorithms - CSC 484 - Spring 2016 Algorithms - CSC 282 - Fall 2015 Advanced Algorithms - CSC 484 - Spring 2015 Algorithms - CSC 282 - Fall 2014 Advanced Algorithms - CSC 484 - Spring 2013 Algorithms - CSC 282 - Fall 2012 Advanced Algorithms - CSC 484 - Spring 2012 Algorithms - CSC 282 - Fall 2011 Advanced Algorithms - CSC 484 - Spring 2011 Algorithms - CSC 282 - Fall 2010 Mathematical Foundations of AI - CSC 246/446 - Spring 2010 Algorithms - CSC 282 - Fall 2009 Mathematical Foundations of AI - CSC 246/446 - Spring 2009 Algorithms - CSC 282 - Fall 2008 Advanced Algorithms - CSC 484 - Spring 2008 Algorithms - CSC 282 - Fall 2007 Advanced Algorithms - CSC 484 - Spring 2007 Algorithms - CSC 282 - Fall 2006 Markov Chains (graduate seminar) - CSC 574 - Spring 2006 Journal publications [J47] Andreas Galanis, Leslie Ann Goldberg, Daniel Štefankovič. Implementations and the independent set polynomial below the Shearer threshold. Theoretical Computer Science 939: 194–215, 2023. Conference version: [C39] [J46] Marcus Schaefer, Daniel Štefankovič. The Degenerate Crossing Number and Higher-Genus Embeddings. Journal of Graph Algorithms and Applications 26(1): 35–58, 2022. Conference version: [C36] [J45] Antonio Blanca, Zongchen Chen, Daniel Štefankovič, Eric Vigoda. Hardness of Identity Testing for Restricted Boltzmann Machines and Potts models. Journal of Machine Learning Research 22: 152:1–152:56, 2021. Conference version: [C49] [J44] Ivona Bezáková, Andreas Galanis, Leslie Ann Goldberg, Daniel Štefankovič. The Complexity of Approximating the Matching Polynomial in the Complex Plane. ACM Transactions on Computation Theory 13(2): 13:1–37, 2021. Conference version: [C46] [J43] Ivona Bezáková, Andreas Galanis, Leslie Ann Goldberg, Daniel Štefankovič. Inapproximability of the Independent Set Polynomial in the Complex Plane. SIAM Journal on Computing 49(5):395–448, 2020. Conference version: [C42] [J42] Antonio Blanca, Andreas Galanis, Leslie Ann Goldberg, Daniel Štefankovič, Eric Vigoda, Kuan Yang. Sampling in Uniqueness from the Potts and Random-Cluster Models on Random Regular Graphs. SIAM Journal on Discrete Mathematics 34(1):742–793, 2020. Conference version: [C44] [J41] Ivona Bezáková, Antonio Blanca, Zongchen Chen, Daniel Štefankovič, Eric Vigoda. Lower bounds for testing graphical models: colorings and antiferromagnetic Ising models. Andreas Galanis, Daniel Štefankovič, Eric Vigoda. Swendsen-Wang Algorithm on the Mean-Field Potts Model. Journal of Machine Learning Research, 21: 25:1–25:62, 2020. Conference version: [C47] [J40] Antonio Blanca, Zongchen Chen, Daniel Štefankovič, Eric Vigoda. Structure Learning of H-colorings. ACM Transactions on Algorithms, 16(3):36:1–36:28, 2020. Conference version: [C45] [J39] Andreas Galanis, Daniel Štefankovič, Eric Vigoda. Swendsen-Wang Algorithm on the Mean-Field Potts Model. Random Structures and Algorithms (RSA) 54(1): 82–147, 2019. Conference version: [C35] [J38] Ivona Bezáková, Andreas Galanis, Leslie Ann Goldberg, Heng Guo, Daniel Štefankovič. Approximation via Correlation Decay When Strong Spatial Mixing Fails. SIAM Journal on Computing (SICOMP) 48(2): 279–349, 2019. Conference version: [C37]. [J37] Charilaos Efthymiou, Thomas P. Hayes, Daniel Štefankovič, Eric Vigoda, Yitong Yin. Convergence of MCMC and Loopy BP in the Tree Uniqueness Region for the Hard-Core Model. SIAM Journal on Computing (SICOMP) 48(2): 581–643, 2019. Conference version: [C38] [J36] Marcus Schaefer, Daniel Štefankovič. The Complexity of Tensor Rank. Theory of Computing Systems (TCS) 62(5):1161–1174, 2018. No conference version. [J35] Marcus Schaefer, Daniel Štefankovič. Fixed Points, Nash Equilibria, and the Existential Theory of the Reals. Theory of Computing Systems (TCS) 60(2):172–193, 2017. No conference version. [J34] Andreas Galanis, Daniel Štefankovič, Eric Vigoda. Inapproximability of the Partition Function for the Antiferromagnetic Ising and Hard-Core Models. Combinatorics, Probability & Computing (CPC) 25(4): 500–559, 2016. No conference version. [J33] Jin-Yi Cai, Andreas Galanis, Leslie Ann Goldberg, Heng Guo, Mark Jerrum, Daniel Štefankovič, Eric Vigoda. #BIS-hardness for 2-Spin Systems on Bipartite Bounded Degree Graphs in the Tree Non-Uniqueness Region. Journal of Computer and System Sciences (JCSS) 82(5): 690–711, 2016. Conference version: [C33] [J32] Andreas Galanis, Daniel Štefankovič, Eric Vigoda, Linji Yang. Ferromagnetic Potts Model: Refined #BIS-hardness and Related Results. SIAM Journal on Computing (SICOMP) 45(6): 2004–2065, 2016. Conference version: [C32] [J31] Andreas Galanis, Daniel Štefankovič, Eric Vigoda. Inapproximability for Antiferromagnetic Spin Systems in the Tree Nonuniqueness Region. Journal of the Association for Computing Machinery (JACM) 62(6):50, 2015. (Electronic appendix.) Conference version: [C31] [J30] Ricardo Restrepo, Daniel Štefankovič, Juan Carlos Vera, Eric Vigoda, Linji Yang. Phase Transition for Glauber Dynamics for Independent Sets on Regular Trees. SIAM Journal on Discrete Mathematics (SIDMA) 28(2): 835–861, 2014. Conference version: [C25] [J29] Andreas Galanis, Qi Ge, Daniel Štefankovič, Eric Vigoda, Linji Yang. Improved Inapproximability Results for Counting Independent Sets in the Hard-Core Model. Random Structures and Algorithms (RSA) 45(1): 78–110, 2014. Conference version: [C26] [J28] Radoslav Fulek, Michael J. Pelsmajer, Marcus Schaefer, Daniel Štefankovič. Adjacent Crossings Do Matter. Journal of Graph Algorithms and Applications (JGAA) 16(3): 759–782, 2012. Conference version: [C29] [J27] Daniel Štefankovič, Santosh Vempala, Eric Vigoda. A Deterministic Polynomial-Time Approximation Scheme for Counting Knapsack Solutions. SIAM Journal on Computing (SICOMP) 41(2): 356–366, 2012. Conference version: [C28] [J26] Qi Ge, Daniel Štefankovič. A Graph Polynomial for Independent Sets of Bipartite Graphs. Combinatorics, Probability & Computing (CPC) 21(5): 695–714, 2012. Conference version: [C24] [J25] Qi Ge and Daniel Štefankovič. The Complexity of Counting Eulerian Tours in 4-Regular Graphs. Algorithmica, 63(3): 588–601, 2012. Conference version: [C23] [J24] Daniel Štefankovič, Eric Vigoda. Fast Convergence of MCMC Algorithms for Phylogenetic Reconstruction with Homogeneous Data on Closely Related Species. SIAM Journal on Discrete Mathematics (SIDMA) 25(3): 1194–1211, 2011. No conference version. [J23] Ivona Bezáková, Alistair Sinclair, Daniel Štefankovič, and Eric Vigoda. Negative Examples for Sequential Importance Sampling of Binary Contingency Tables. Algorithmica 64(4): 606–620, 2012. Conference version: [C12] [J22] Michael J. Pelsmajer, Marcus Schaefer, Daniel Štefankovič. Crossing Numbers of Graphs with Rotation Systems. Algorithmica 60(3): 679–702, 2011. Conference version: [C16] [J21] Marcus Schaefer, Eric Sedgwick, and Daniel Štefankovič. Spiraling and Folding: The Word View. Algorithmica 60(3): 609–626, 2011. Conference version: [C13] [J20] Michael Pelsmajer, Marcus Schaefer, Daniel Štefankovič. Removing Independently Even Crossings. SIAM Journal on Discrete Mathematics (SIDMA) 24(2):379–393, 2010. Conference version: [C22] [J19] Daniel Štefankovič, Santosh Vempala, Eric Vigoda. Adaptive Simulated Annealing: A Near-Optimal Connection between Sampling and Counting. Journal of the Association for Computing Machinery (JACM) 56(3), 2009, (DOI 10.1145/1516512.1516520). Conference version: [C18] [J18] Michael Pelsmajer, Marcus Schaefer, Daniel Štefankovič. Removing Even Crossings on Surfaces. European Journal of Combinatorics (EJC), 30:1704–1717, 2009. Conference version: [C14] [J17] Ivona Bezáková, Daniel Štefankovič, Vijay Vazirani, Eric Vigoda. Accelerating Simulated Annealing for the Permanent and Combinatorial Counting Problems. SIAM Journal on Computing (SICOMP) 37(5):1429–1454, 2008. Conference version: [C11] [J16] Michael Pelsmajer, Marcus Schaefer, Daniel Štefankovič. Odd Crossing Number and Crossing Number are Not the Same. Discrete and Computational Geometry (DCG) 39(1-3):442–454, 2008. Conference version: [C10] [J15] Michael Pelsmajer, Marcus Schaefer, Daniel Štefankovič. Removing Even Crossings. Journal of Combinatorial Theory B (JCTB) 97(4):489–500, 2007. Conference version: [C9] [J14] Manu Chhabra, Robert Jacobs, Daniel Štefankovič. Behavioral Shaping for Geometric Concepts. Journal of Machine Learning Research (JMLR) 8:1835–1865, 2007. [J13] Peter Hui, Michael J. Pelsmajer, Marcus Schaefer, Daniel Štefankovič. Train Tracks and Confluent Drawings. Algorithmica 47(4):465-479, 2007. Conference version: [C8] [J12] Daniel Štefankovič, Eric Vigoda. Phylogeny of Mixture Models: Robustness of Maximum Likelihood and Non-Identifiable Distributions. Journal of Computational Biology 14(2):156–189, 2007. No conference version. [J11] Daniel Štefankovič, Eric Vigoda. Pitfalls of Heterogeneous Processes for Phylogenetic Reconstruction. Systematic Biology 56(1):113–124, 2007. No conference version. [J10] Bruno Codenotti, Daniel Štefankovič. On the Computational Complexity of Nash Equili",
  "content_length": 25650,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:39"
}