{
  "name": "Daniel N. Rockmore",
  "homepage": "http://www.cs.dartmouth.edu/~rockmore",
  "status": "success",
  "content": "Dan Rockmore Dan Rockmore, Professor Laurie Snell 80th Birthday Celebration! Dan and collaborator Digger (7/15/94--8/28/04) on another research adventure. Affiliations: Professor, Department of Mathematics, Dartmouth College Director, Neukom Institute for Computational Science, Dartmouth College William H. Kemeny Neukom Professor of Computational Science, Dartmouth College Professor of Computer Science, Dartmouth College Member, External Faculty, The Santa Fe Institute Research Interests: Complex Systems, Network Analysis, Machine Learning, Cultural Evolution, Group Theoretic Transforms Publications: Stalking the Riemann Hypothesis , (Pantheon) by Dan Rockmore - A non-technical account of the history of the Riemann Hypothesis, a 150 year-old unsolved math problem, whose solution gets to the heart of out understanding of the way in the which the prime numbers are distributed among the integers. Stalking the Riemann Hypothesis has been selected for inclusion in the Scientific American Book Club Some Related Press: Interview with David Lemberg on \"Science and Society\" on World Talk Radio, 9/21/05 Interview with Mark Lynch on WICN, 8/21/05 \"His Days are Numbered,\" Boston Globe, July 18, 2005 \"Count Him In,\" Washington Post, May 23, 2005 New Scientist Wall Street Journal The Telegraph (Calcutta, India) Interview on NHPR's \"Front Porch\" Interview on VPR's \"Switchboard,\" May 19, 2005 Some other books: Music and Computers: A theoretical and historical approach , by Phil Burk (SoftSynth.com) Larry Polansky (Dartmouth College) Mary Roberts (Princeton University) Dan Rockmore (Dartmouth College) douglas repetto (Columbia University) -- This is a web-based, interactive book that gives a hands-on approach to understanding some of the ways in which computers and math are used in music. Modern Signal Processing Edited by Daniel N. Rockmore, Dennis M. Healy, Jr Some projects: ·  Fast Fourier Transforms for Groups ·  The Math Life , a documentary film, co-produced with Wendy Conquest and Bob Drake ·  Stalking the Riemann Hypothesis to appear, March 2005 (Vintage Press) ·  Some work on digital techniques for art authentication Lecture Series: ·  The First Mind/Brain Symposium at Dartmouth College ·  The Chance Lectures 2000 ·  The Chance Lectures at Dartmouth (RealPlayer videos of past lectures) Some expository articles: ·  A New York Times Essay I wrote on mathematics in the arts. ·  A piece from The Dallas Morning News on Jackson Pollock and mathematics. ·  A few essays that I have written for the Chronicle of Higher Education: ·  An essay on the Abel Prize written for the Chronicle of Higher Education ·  A review of Peter Parnell's ``QED\" ·  A review of ``A Beautiful Mind\" ·  A review of David Auburn's play ``Proof\" ·  A humor piece on the fragrance \"Pi\" ·  An opinion piece on shared databases (with Mike Gazzaniga) ·  A few art/math essays for the catalog of an math-inspired art exhibit: Rothko ; Pollock ; Close Radio: I’ve been a commentator for Vermont Public Radio . Here is a link to the audio. CV: Here is pdf of my cv Just Havin' Fun... Professors Dan and Digger Rockmore discuss a finepoint of Digger's Grand Unified Theory of Walks,Snacks and Sleep (GUTWSS). Contact: rockmore at cs-dot-dartmouth-dot-edu phone: 603-646-3260 Back to Faculty List",
  "content_length": 3292,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:26"
}