{
  "name": "Dani Yogatama",
  "homepage": "https://dyogatama.github.io",
  "status": "success",
  "content": "Dani Yogatama I am a cofounder and CEO of Reka and an associate professor in the Department of Computer Science at the University of Southern California. I was a senior staff research scientist at DeepMind (2016-2022). Prior to DeepMind, I was at Baidu Silicon Valley AI Lab (2015-2016). I received my PhD from Carnegie Mellon University (2010-2015) where I was advised by Noah Smith as a member of Noah's ARK. I was a Monbukagakusho (文部科学省) fellow at the University of Tokyo (2008-2010) in Tanaka-Ishii's Lab. I grew up in Indonesia and went to Institut Teknologi Bandung. Contact: dani@reka.ai, yogatama@usc.edu. Google Scholar, Twitter. USC students Ting-Rui Chiang, PhD student, University of Southern California. Ollie Liu, PhD student, University of Southern California. Joshua Robinson, PhD student, University of Southern California. Isabelle Lee, PhD student, University of Southern California. Velocity Yu, PhD student, University of Southern California. DeepMind interns and student collaborators Yixuan Su, PhD student, University of Cambridge (Spring 2022-Summer 2022, student collaborator). Paul Pu Liang, PhD student, Carnegie Mellon University (Summer 2021, intern). Paul Michel, PhD student, Carnegie Mellon University (Spring 2021, intern). Qi Liu, PhD student, University of Oxford (Spring 2021, intern). Devendra Sachan, PhD student, MILA/McGill University (Spring 2021-Summer 2022, student collaborator). Hao Peng, PhD student, University of Washington (Fall 2020, intern). Mikel Artetxe, PhD student, University of the Basque Country (Summer 2019, intern). Jean Maillard, PhD student, University of Cambridge (Summer 2017, student collaborator). Yishu Miao, PhD student, University of Oxford (Summer 2017, intern). Service: Action editor: TACL (2020-2024). Tutorial chair: ACML 2021. Journal track chair: ACML 2023. Virtual infrastructure chair: EMNLP 2021. Area chair: NeurIPS (2020-2022), ICML (2020-2023), ACL (2020-2021), EMNLP (2020), ICLR (2020-2023). Style files were provided by Manaal Faruqui (thanks Manaal!), are licensed under a Creative Commons Attribution 3.0 Unported License. Save",
  "content_length": 2118,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:49"
}