{
  "name": "Daniel Amyot",
  "homepage": "http://www.site.uottawa.ca/~damyot",
  "status": "success",
  "content": "Daniel Amyot Daniel Amyot Professor Research Interests Software Engineering Scenario- and Goal-oriented Requirements Engineering User Requirements Notation (URN) Business Process Mining and Modelling Healthcare Informatics Legal and Regulatory Compliance Smart Contracts Publications Students and Research Projects Potential Capstone/Co-Op/Masters Projects Tools Teaching SEG 3501 - Ingénierie des exigences (F2024) Previous courses Office Hours In person or on MS Teams, Thursdays, 9:30-10:30 On MS Teams, upon apointment Please email me for urgent meetings or questions. Publication indexes: [Google Scholar] [DBLP] [ACM DL] [IEEE Xplore] [ResearchGate] [Semantic Scholar] [Mendeley] [Research.com] [SciProfiles] [Scopus] [ORCID] Web presence: [LinkedIn] [GitHub] Symboleo overview paper Parvizimosaed, A., Sharifi, S., Amyot, D., Logrippo, L., Roveri, M., Rasti, A., Roudak, A., Mylopoulos, J. (2022) Specification and Analysis of Legal Contracts with Symboleo. Software and Systems Modeling (SoSyM), 21, 2395-2427, Springer. DOI: 10.1007/s10270-022-01053-6 Overview of URN and its impact Amyot, D., Akhigbe, O., Baslyman, M., Ghanavati, S., Ghasemi, M., Hassine, J., Lessard, L., Mussbacher, G., Shen, K., Yu, E. (2022) Combining Goal modelling with Business Process modelling  Two Decades of Experience with the User Requirements Notation Standard. Enterprise Modelling and Information Systems Architectures (EMISAJ), Vol. 17. DOI: 10.18417/emisa.17.2 Overview of the REWBAH community Levy, M., Liu, L., Amyot, D., Yu, E., Alshammari, M., Baslyman, M., Bjarnason, E., Bull, C., Duarte, C.H.C., Groen, E.C., Jantunen, S., Kopczynska, S., Lessard, L., Richardson, I., Weber, J., Wei, Z. (2021) Requirements Engineering for Well-Being, Aging, and Health (REWBAH): An Overview for Practitioners. IEEE Software, 38(3), 7-12, May-June. DOI: 10.1109/MS.2021.3058492 I joined EECS in February 2002, after a few years as Senior Researcher at (Mitel Networks). From 2002 to 2013, I was Associate Rapporteur on Formal languages and telecommunication software at the International Telecommunication Union (ITU-T), where I led the development of the User Requirements Notation (URN) standard. I also lead the development of the jUCMNav tool for URN modeling and analysis. My research interests span many domains, from requirements/software engineering to modelling (goals and business processes), regulatory compliance, healthcare informatics, and smart contracts. I hold a Ph.D. and a M.Sc. from the University of Ottawa (2001 and 1994), as well as a B.Sc. from Laval University (1992), all in Computer Science. I am a member of OIQ (professional engineer) and Senior Member of IEEE. I am on the Editorial Boards of the following journals: Requirements Engineering (REJ), Springer Software and Systems Modeling (SoSyM), Springer I am member of the Steering Committee of the IEEE International Requirements Engineering Conference, and former Chair of the SDL Forum Society. I am also affiliated with the following research organizations: Contract Specification and Monitoring Lab LIFE Research Institute IBM/Telfer Centre for Business Analytics and Performance Institut du savoir Montfort (ISM) Telfer Health Transformation Exchange (THTex) I am involved in the following conferences, so please submit papers and participate! 5th International Conference on Process Mining (ICPM 2023) (programme committee), Rome, Italy, 23-27 October 2023. 15th System Analysis and Modelling (SAM) Conference (program committee), Västerås, Sweden, 2-3 October 2023. ACM/IEEE 26th Int. Conf. on Model Driven Engineering Languages and Systems (MODELS 2023) (Program committee, Practice Track), ästerås, Sweden, 1-6 October 2023. Past conferences... Daniel Amyot School of Electrical Engineering and Computer Science University of Ottawa 800 King Edward St., Ottawa, Ontario, Canada, K1N 6N5 Phone: +1 613-562-5800 ext. 6947 Office: SITE Hall, Room 5-021 Email: damyot@uottawa.ca",
  "content_length": 3953,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:54"
}