{
  "name": "Daniel W. Goldberg",
  "homepage": "https://artsci.tamu.edu/geography/contact/profiles/daniel-goldberg.html",
  "status": "success",
  "content": "Daniel Goldberg | Texas A&M University College of Arts and Sciences Skip To Main Content Skip To Profile Details Skip To Educational Background Skip To Research Interests Skip To Research Areas Associate Professor Director of Undergraduate Programs Director, TAMU GeoInnovation Service Center Phone: (979) 213-0504 Email: daniel.goldberg@tamu.edu Office: CSA 305D Biography Professional Links Texas A&M GeoServices Texas A&M GeoInnovation Service Center Texas A&M AggieMap Texas A&M GIS Day Research Interests GIS, Geocoding GeoComputation CyberGIS 3D GIS ADA GIS Routing Spatial Databases Spatial Uncertainty Spatio-Temporal GIS Environmental Exposure Assessment HealthGIS Educational Background Ph.D. Computer Science University of Southern California, 2010 M.Sc. Computer Science, University of Southern California, 2003 B.Sc. Computer Science, Rutgers University, 2002 Awards & Honors Texas A&M University - Division of Finance and Operations Team Award, TAMU ADA GIS Routing, 2018 Texas A&M University - Center for Teaching Excellence, Montague Scholar Award, 2015 Texas A&M University - Partners in Learning Award of Excellence, 2015 National Center for Supercomputing Applications - CyberGIS Fellow, 2014 Selected Publications Selected Publications (* = publication with student; ** = publication with REU student) Refereed Journal Articles Bowlick F*, Goldberg DW, Bednarz S. Valuable Components of CyberGIS: Expert Viewpoints through Q-Method Interviews. Transactions in GIS 22(5): 1105-1129 (2018). Gearhart S**, Perez-Patron M, Hammond TA, Goldberg DW, Klein AG, Horney JA. The Impact of Natural Disasters on Domestic Violence: An Analysis of Reports of Simple Assault in Florida (1999-2007). Violence and Gender 5(2): 87-92 (2018). Li X*, Goldberg DW. A Real-Time Mobile Crowdsensing System for Road Surface Assessment. Computers, Environment and Urban Systems 69: 51-62 (2018). Smitherman S**, Stone KW, Goldberg DW, Hammond TA, Horney JA. Assessing the prevalence of risk factors for Neglected Tropical Diseases in Brazos County, Texas. PLOS Currents: Outbreaks (2017). Jacquez GM, Essex A, Curtis AJ, Kohler B, Sherman R, el Emam K,  Shi C, Kaufmann A, Beale L, Cusick T, Goldberg DW, Goovaerts P. Geospatial cryptography: Accelerating human subjects research in cancer control and surveillance. Cancer Epidemiology, Biomarkers & Prevention (2017). McDonald Y*, Schwind M*, Goldberg DW, Lampley A*, Wheeler C. An analysis of the process and results of manual geocode correction. Geospatial Health 12: 84-89 (2017). Smitherman S**, Goldberg DW, Hammond TA, Horney JA. Developing a Survey to Assess the Prevalence of Risk Factors for Neglected Tropical Diseases in Texas Using the CASPER Method. Health Security 15(3) (2017). Bowlick F*, Goldberg DW, Bednarz S. Computer Science and Programming Courses in Geography Departments in the United States. Professional Geographer 69(1): 138-150 (2017). McDonald YJ*, Goldberg DW, Scarinci I, Castle PE, Cuzick J, Robertson M, Wheeler CM. Health service accessibility and risk in cervical cancer prevention: Comparing rural versus non-rural residence in New Mexico. Journal of Community Health (2016). Modala NR*; Ale S, Goldberg DW, Olivares M*, Munster CL, Rajan N, Feagin RA. Climate change projections for the Texas High Plains and Rolling Plains. Journal of Theoretical and Applied Climatology: 1-18 (2016) Bowlick F*, Bednarz S, Goldberg DW. Student Learning in an Introductory GIS Course: Using a Project-Based Approach. Transactions in GIS 20(2): 182-202 (2016) Quiring S, Ford TW*, Wang JK*, Khong A*, Harris E*, Lindgren T*, Goldberg DW, Li Z*. North American Soil Moisture Database: Development and Applications. Bulletin of the American Meteorological Society 97: 1441–1459 (2016). Klaus CA, Carrasco LE, Goldberg DW, Henry KA, Sherman RL. Use of Attribute Association Error Probability Estimates to Evaluate Quality of Medical Record Geocodes. International Journal of Health Geographics: 14(1) (2015) Hong A, Kellstedt D, Goldberg DW, Wang S, Ory MG. A pilot study to test the efficacy of a mobile-enabled web application (iCanFit) to promote physical activity among older cancer survivors. Journal of Medical Internet Research Cancer: 1(1) (2015) Bowlick F*, Andermatt K*, Besmar C*, Erbe J*, Lopez R*, White J*, Goldberg DW, Carroll KM. Defining the Palouse: Using Overlap Analysis to Delineate an Informal Region. Association of Pacific Coast Geographers Yearbook 77: 1-12 (2015). Hong Y, Goldberg DW, Vollmer Dahlke D, Ory MG, Cargill JS*, Coughlin R*, Hernandez E*, Kellstedt DK, Peres SC. Testing Usability and Acceptability of a Web Application to Promote Physical Activity (iCanFit) Among Older Adults. Journal of Medical Internet Research Human Factors: 1(1) (2014). Goldberg DW, Klein A, Olivares M*, Li Z*. GIS Map Data & Services in the Big, Cloud Era: Opportunities, Challenges & Changes. Journal of Map & Geography Libraries: 10(1) (2014). Goldberg DW, Ballard M*, Boyd JH, Mullan H, Garfield C, Rosman D, Ferrante AM, Semmens JB. An evaluation framework for comparing geocoding systems. International Journal of Health Geographics 12(50) (2013). Henry KA, Sherman R*, Farber S, Cockburn MG, Goldberg DW, Stroup AM. The joint effects of census tract poverty and geographic access on late-stage breast cancer diagnosis in 10 US States. Health & Place 21: 110-121 (2013). Ghosh JKC*, Wilhelm M, Su J, Goldberg DW, Cockburn MG, Jerrett M, Ritz B. Assessing the influence of traffic-related air pollution on term LBW based on land use regression models and air toxics measures. American Journal of Epidemiology (2012). Goldberg DW, Cockburn MG. The Effect of Administrative Boundaries and Geocoding Error on Cancer Rates in California. Spatial and Spatio-Temporal Epidemiology 3(1): 39-54 (2012). Henry KA, Boscoe FP, Johnson CJ, Goldberg DW, Sherman R*, Cockburn MG. Breast Cancer Stage at Diagnosis: Is Travel Time Important? Journal of Community Health 36(6): 933-942 (2011). Goldberg DW. Improving Geocoding Match Rates with Spatially-Varying Block Metrics. Transactions in GIS 15(6): 827–848 (2011). Boscoe FP, Johnson CJ, Henry KA, Goldberg DW, Shahabi K*, Elkin EB, Ballas LK, Cockburn MG. Geographic Proximity to Treatment for Early Stage Breast Cancer and Likelihood of Mastectomy. The Breast 20(4): 324-328 (2011). Cockburn MG, Mills P, Zhang X*, Goldberg DW, Ritz B. Prostate cancer and ambient pesticide exposure in agriculturally intensive areas in California. American Journal of Epidemiology 173(11):1280-1288 (2011). Goldberg DW, Cockburn MG.  Improving Geocode Accuracy with Candidate Selection Criteria. Transaction in GIS 14(S1): 129-146 (2010). Goldberg DW, Wilson JP, Knoblock CA. Extracting geographic Features from the internet to automatically build detailed regional gazetteers. International Journal of Geographic Information Science 23(1): 93-128 (2009). Goldberg DW, Wilson JP, Knoblock CA, Ritz B, Cockburn MG. An effective and efficient approach for manually improving geocoded data. International Journal of Health Geographics 7(60) (2008). Goldberg DW, Wilson JP, Knoblock CA. From Text to Geographic Coordinates: The Current State of Geocoding. URISA Journal 19(1): 33-46 (2007). Books Goldberg DW. A Geocoding Best Practices Guide. Springfield, IL, North American Association of Central Cancer Registries (2008). Book Chapters Goldberg DW. Geocoding. In Richardson D, Kobayashi AL, Castree N, Liu W, Goodchild MF, Marston R (eds.), The International Encyclopedia of Geography: People, the Earth, Environment, and Technology. Hoboken, NJ, Wiley-Blackwell (Submitted). Goldberg DW. Geocoding for Location-Based Services. In Karimi, H (ed.), Advances in Location-Based Computing and Services. Second Edition. New York, NY. Taylor & Francis. 75-106 (2013). Goldberg DW, Jacquez GM, Mullan N. Geocoding In Health Science Research. In Boscoe, FP (ed.), Geographic Health Data: Fundamental Techniques for Analysis. Wallingford, UK, CABI International Press: 51-71(2013). Goldberg DW, Cockburn MG, Naito AT*. Spatial Overlays for Exposure Estimation. In Boscoe, FP (ed.), Geographic Health Data: Fundamental Techniques for Analysis. Wallingford, United Kingdom, CABI International Press: 87 – 104 (2013). Goldberg DW. Privacy and Security of Geospatial Information. In Warf B, Jankowski P, Solomon BD, Welford M (eds.), Encyclopedia of Geography. Thousand Oaks, CA, Sage Publications (2010). Goldberg DW, Wilson JP, Knoblock CA. Exploring the Use of Gazetteers and Geocoders for the Analysis and Interpretation of a Dynamically Changing World. In Hornsby KS, Yuan M (eds.), Understanding Dynamics of Geographic Domains. Boca Raton, FL, CRC Press: 51-76 (2008).",
  "content_length": 8666,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:39"
}