{
  "name": "Daniel Votipka",
  "homepage": "https://www.eecs.tufts.edu/~dvotipka",
  "status": "success",
  "content": "Daniel Votipka Search Daniel Votipka Lin Family Assistant Professor, Tufts Security and Privacy Lab (TSP) Tufts University I’m an assistant professor in the Computer Science Department at Tufts University. My research focuses on computer security, with an emphasis on the human factors affecting security professionals. I’m interested in understanding the processes and mental models of professionals who are required to perform security tasks daily such as secure development, vulnerability discovery, network defense, and operational security to provide research-based recommendations for education, policy, and automation changes to best leverage human intelligence against challenging computer security problems. I am also the co-director of the Tufts Security and Privacy Lab (TSP; pronounced “teaspoon lab”). Note: I have limited openings for talented, motivated students If you are interested, please apply to the Tufts’ Computer Science Department here. Also, drop me an email telling me: (1) that you applied and (2) what interests you about human factors in security and privacy research. Students I am pleased to work with some excellent graduate students, including: Ron Thompson (CS PhD) Carson Powers (CS PhD) Hamza Khalid (CS PhD) Tomi Idowu (CS PhD) Sarah Radway (Harvard) I also work with some great research assistants, including CJ Burton, Alejandra Sabater, Harrison Sweet, Luke Boshar, Cordelia Ludden, Perucy Mussiba, Matthew Soto, Suvi Lama, Shahada Manzer, Alexandra Cox, Samuel Sekyere, and Lisa Dang. I am the proud academic parent of: James Mattei (PhD. CS) now at ElastiFlow. Students I have also supervised or worked closely with in the past: Kathy Quintanilla (Now at JPMC), Mariam Bah (ugrad at UCSD), Amira Chhaiouine (ugrad at RIT), Samantha Katcher, Ben Altschuler (now at Speakology AI), Pavel Nabutovsky (now at Quoin), Nickolas Gravel (now at Raytheon), Madeline McLaughlin (now at MIT Lincoln Labs), Sam Cohen (Colby College ugrad), Christopher Pellegrini (now at Northeastern), Matthew Ung (now at CMU), Jasper Geer (now at UBC), Ellis Hale (UMBC ugrad), Esam Nesru (UMBC ugrad), Yaejie Kwon (Swathmore ugrad), Yijun Liu (Elon University ugrad), Gustavo Curioso (now at Redline Trading Solutions), Santana Koring’ura, Kamran Mirza, Leigh Tanji, Arie Itzhacki, Yuan Han, Liana Wang (now at Apple), Seth Rabin (UMD CS ugrad, now at Wayfair), Desiree Abrokwa (UMD CS ugrad), Mary Nicole Dugay Punzalan (UMD CS ugrad, now at Lockheed Martin) and Eric Zhang (UMD CS ugrad). Affiliations Tufts Security and Privacy Lab (TSP) Tufts Cybersecurity Center for the Public Good (CyPuG) Tufts Institute for Research on Learning and Instruction (IRLI) Previously Maryland Security, Privacy, and People Lab (SP2) Maryland Cybersecurity Center (MC2) Human-Computer Interaction Lab (HCIL) Carnegie Mellon University’s Cylab Education PhD in Computer Science, 2020 University of Maryland MS in Information, Technology, and Management, 2012 Carnegie Mellon University BSc in Computer Science, 2010 Illinois Institute of Technology Interests Security and Privacy Professionals Secure Development Human-Computer Interaction Recent Publications A Qualitative Analysis of Fuzzing Tool Usability and Challenges Yunze Zhao, Wentao Guo, Harrison Goldestin, Daniel Votipka, Kelsey Fulton, Michelle Mazurek Poster Navigating the Patchwork: Investigating the Availability and Consistency of Public Security Advisories Ronald Thompson, Luke Boshar, Eugene Vasserman, Daniel Votipka 'I’m trying to learn…and I’m shooting myself in the foot': Beginners’ Struggles When Solving Binary Exploitation Exercises James A. Mattei, Christopher Pellegrini, Matthew Soto, Marina Sanusi Bohuk, Daniel Votipka PDF 'Threat modeling is very formal, it’s very technical, and also very hard to do correctly': Investigating Threat Modeling Practices in Open-Source Software Projects Harjot Kaur*, Carson Powers*, Ronald E. Thompson, Sascha Fahl, Daniel Votipka PDF An Investigation of Interaction and Information Needs for Protocol Reverse Engineering Automation Samantha Katcher*, James A. Mattei*, Jared Chandler, Daniel Votipka PDF See all publications Contact dvotipka@cs.tufts.edu Halligan Hall, Tufts University, Medford, MA, 02155, USA Cite × Copy Download",
  "content_length": 4253,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:40"
}