{
  "name": "Daniel David Campbell Prince",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/daniel-prince",
  "status": "success",
  "content": "Daniel Prince - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Professor Daniel Prince Professor of Cyber Security Profile Daniel Prince is a Professor of Cyber Security at Lancaster University and is the co-director for Security Lancaster; the University’s interdisciplinary research institute exploring the solutions to the next generation of security and citizen protection challenges. Daniel’s research focuses on developing rigorous methods for Cyber Risk Management and Cyber Threat Intelligence for complex socio-technical systems. This include developing and applying qualitative and quantitative approaches to identify, understand and respond to the complexities of digitally enabled, persistent threat actors. Daniel is an interdisciplinary practitioner having worked collaboratively with colleagues in other fields, including International Relations, which has developed a stream of work to develop approaches to understand the broader implications of technology and security on international and national defence policy. Daniel also has a significant engagement portfolio to develop rational discourse around the complexities and opportunities associated with cyber security through proactive with businesses, the public and through government & policy engagement. Show more… Thesis Title Dynamic Service Deployment Through Consensus Negotiation in Programmable Ad Hoc Networks Thesis Outline There has recently been considerable interest in the provision of mechanisms for establishing communication between ad hoc groups of devices. The types of device forming these groups range from simple sensor devices to more complex hand held and portable computing devices. This thesis targets this new area and specifically addresses the need for dynamic, “on the fly” configuration of these systems. A particular complexity in forming impromptu networks or groups is that devices must have compatible software services in order to interoperate. Any inconsistency in this set of services may prevent the network from forming thus inhibiting any collaborative task. The work presented in this thesis provides a novel approach for the discovery, distribution and configuration of the services necessary to achieve an operational ad hoc network. This thesis contains a discussion of the state of the art technologies and concepts in both Ad Hoc and Programmable Networking. Based on these discussions, an informed design for an ad hoc collaboration network architecture is given followed by an analysis of an implementation of the proposed design. The design and implementation presented herein adopts a programmable networking approach and an innovative distributed consensus resolution algorithm to manage network formation. Finally, evaluation of the architecture and the accompanying prototype implementation shows that it is applicable to the considered problem domain. Supervised By Dr Andrew Scott Research Overview My current cyber security research interests in several key areas; Cyber Risk Management in Complex Socio-Technical Systems and Cyber Physical Systems, with the latter primarily serving as a key problem domain for the former. The primary driver is to explore cyber security risk management concepts that move away from asset centric approaches to include threat agent and effect based frameworks. In addition, the applied domain of this work has moved to focus more on the financial services sector, with the addition of developing an understanding of the nature of cyber risks that lead to systemic issues. Show less Publications Projects Activities PhD Students Research Groups DCQ: Cyber Security of Digital Medical Devices: Establishing UK Capability for a New Design and Development Route 01/07/2025 → 31/12/2027 Research SL: Cyber Threat Intelligence (Lewis Newsham) 01/10/2021 → 31/12/2025 Research SL: Health IoT Privacy and Security Transferred to Engineering Requirements (HIPSTER) 01/08/2021 → 30/06/2023 Research Invest or Defend 21/12/2020 → 25/04/2021 Other SL: How to use unconventional defence methods used in conventional organisations 10/02/2020 → 31/03/2020 Research KTP in Threat Intelligence Analytical Software 12/08/2019 → 11/08/2021 Research SL: KTP: Xyone Ltd 12/08/2019 → 04/03/2021 Research Cyber Risk as Systemic Risk in Financial Services 01/01/2018 → 01/01/2025 Research Research Investment Equipment Grant 09/03/2015 → 31/03/2015 Research Maritime Cyber Security 01/06/2014 → … Other Future of International Law and Cyber Warfare (Funded by SECURITY FUTURES) 17/07/2013 → 19/07/2013 Research SL: STREAM 2: CyberFocus - Cyber Impact for the North West 01/01/1900 → … Research Lancaster University Satellite Event of the First Sea Lord 'Sea Power' Annual Conference 2024 Participation in conference -Mixed Audience Workshop: New Adventures in Agile Development Public Lecture/ Debate/Seminar New Adventures in Health Tech Product Development Public Lecture/ Debate/Seminar Public HIPSTER Workshop in Central Manchester Public Lecture/ Debate/Seminar Commercialising Cybersecurity in HealthTech Public Lecture/ Debate/Seminar Presentations to PETRAS PI Group Invited talk HIPSTER Blog: Research as It Happens Other Future of Retail Panel Session Public Lecture/ Debate/Seminar Cyber Security Skills: Tapping into the UK Talent Pool Invited talk Export Opportunities for Cyber Security Companies Public Lecture/ Debate/Seminar The Future of Maritime Cyber Security Participation in workshop, seminar, course Prospect Business Engagement Cyber Security Round-Table: Shaping the Cyber Warrior for 2020 Public Lecture/ Debate/Seminar Cyber Sense - Understanding the Domain Invited talk Future of Cyber Criminals and Measuring Their Activity Participation in workshop, seminar, course Routledge (Publisher) Editorial activity 1st International Symposium for ICS & SCADA Cyber Security Participation in conference -Mixed Audience Security and Protection Science Conference Participation in conference -Mixed Audience Competitive Edge via Security Public Lecture/ Debate/Seminar Mobilizing Emergency/Disaster Response Workshop Participation in workshop, seminar, course Cyber Security Summer Camp Business Course/Training Cyber Security Conference 2012 Participation in conference -Mixed Audience ITEC 2012 Participation in conference -Mixed Audience Future of Digital Troublemakers Participation in workshop, seminar, course UK Security Threats - UKFast Cyber Security Round Table Public Lecture/ Debate/Seminar Cyber Security Conference 2011 Participation in conference -Mixed Audience Summer of Security 2009 Participation in workshop, seminar, course Pierre Ciholas PhD student i-DID , SCC (Security), Security Lancaster, Security Lancaster (Networks), Security Lancaster (Systems Security) enable JavaScript to view email address Xavier Hickman PhD student Security Lancaster, Security Lancaster (Systems Security) enable JavaScript to view email address Ryan Hyland PhD student, Associate Lecturer enable JavaScript to view email address Lewis Newsham PhD student, Associate Lecturer Security Lancaster enable JavaScript to view email address Cyber Security Research Centre (Security Group) Cyber Threat Lab i-DID SCC (Security) Security Lancaster Back to listing Contact Details Department: Computing and Communications Office: B64, B - Floor, InfoLab21 TelTelephone: +44 (0)1524 522368 enable JavaScript to view email address Back to listing",
  "content_length": 7650,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:01"
}