{
  "name": "Daniel Casini",
  "homepage": "https://retis.sssup.it/~d.casini",
  "status": "success",
  "content": "Daniel Casini - Home page Home| Publications| Teaching| Theses Home page Welcome! I'm a Tenure-Track Assistant Professor at Scuola Superiore Sant'Anna - Pisa (Italy), where I'm part of the Real-Time Systems Laboratory (ReTiS Lab) and the Department of Excellence in Robotics and Artificial Intelligence. In July 2020 I received (with honors) the PhD in Emerging Digital Technologies (curriculum Embedded Systems) at Scuola Superiore Sant'Anna, where I worked at the ReTiS Lab under the supervision of Prof. Giorgio Buttazzo and Prof. Alessandro Biondi. In 2019 I visited the Max Planck Institute for Software Systems - Kaiserslautern (Germany), where I worked with Björn Brandenburg. In July 2016 I graduated cum laude in the Master of Science in Embedded Computing Systems, jointly offered by University of Pisa and Scuola Superiore Sant'Anna. In September 2013 I achieved the Bachelor's Degree in Computer Science Engineering at the University of Pisa with the score of 110/110. Upcoming or recent events 28th Euromicro Conference Series on Digital System Design (DSD 2025) , Salerno, Italy. September 10 â 12, 2025. I will serve as Technical Program Chair. 31st IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS 2025), Brief Presentations Track, Irvine, California, USA. May 6 â 9, 2025. I will serve as Technical Program Chair. 16th ACM/IEEE International Conference on Cyber-Physical Systems (ICCPS 2025) , Irvine, California, USA. May 6â9, 2025. I will serve as Publicity Chair. 37th Euromicro Conference on Real-Time Systems (ECRTS 2025) , Brussels, Belgium. July 8 â 11, 2025. I will serve as Real-Time Pitches Chair. 28th IEEE International Symposium on Real-Time Distributed Computing (ISORC 2025) , Toulouse, France. May 26 â 28, 2025. I will serve as Technical Program Chair. 14th International Symposium on Industrial Embedded Systems (SIES 2024) , Chengdu, China. October 23 - 25, 2024. I will serve as Technical Program Chair, together with Zhishan Guo and Deng Qingxu. Professional Service (Conferences) Technical Program Chair of DSD 2025, 28th Euromicro Conference Series on Digital System Design (DSD) 2025. Technical Program Chair of RTAS-BP 2025, the 31st IEEE Real-Time and Embedded Technology and Applications Symposium, Brief Presentation Track. Real-Time Pitches Chair of ECRTS 2025, the 2025 37th Euromicro Conference on Real-Time Systems. Technical Program Chair of ISORC 2025, the 2025 28th International Symposium on Real-Time Distributed Computing. Publicity Chair of ICCPS 2025, the 2025 16th ACM/IEEE International Conference on Cyber-Physical Systems. Technical Program Chair of SIES 2024, the 2024 14th International Symposium on Industrial Embedded Systems. 2022 -- Present. Steering Committee Chair and organizer of the workshop on Real-time And intelliGent Edge computing workshop (RAGE) Track Chair at DSD 2024, \"Track HSTIEC: Hardware, Software, and Tools for the IoT-to-Edge-to-Cloud Continuum\". Track Chair at DSD 2023, \"Track HSTIEC: Hardware, Software, and Tools for the IoT-to-Edge-to-Cloud Continuum\". Technical Program Chair and Organizer of the RAGE 2022 , the 1st workshop on Real-time And intelliGent Edge computing workshop, in conjunction with DAC 2022. Member of the Technical Program Committee of: Conferences:RTSS: 2025, 2023, 2022, 2021; RTAS: 2024, 2023, 2022; ECRTS: 2025, 2023, 2022, 2021; EMSOFT: 2025, 2024, 2023; RTCSA: 2025, 2024; RTNS: 2025, 2024; DSD: 2024, 2023, 2022; EOSS: 2024; ISORC: 2024, 2023, 2022, 2021, 2020; ETFA: 2025, 2024; SAC: 2025, 2024; MOST: 2025, 2024, 2023 Workshops and Other Events: RTSS (Brief Presentations): 2023; RTSS (Artifact Evaluation): 2024, 2023, 2022; RTAS (Brief Presentations): 2023, 2022, 2020, 2019; RTAS (Artifact Evaluation): 2019; ECRTS (Artifact Evaluation): 2024, 2020, 2019; RTSOPS: 2024; OSPERT: 2025, 2024, 2023; NG-RES: 2024; WMC: 2023, 2022; JRWRTC: 2023, 2021, 2020, 2018; SSH-SoC: 2023; AxC: 2023 Professional Service (Journals) (Jan 2024 - current) Associate Editor and Member of the Editorial Board of the international journal Springer Journal of Supercomputing. (Feb 2022 - current) Associate Editor and Member of the Editorial Board of the international journal Elsevier Microprocessors and Microsystems. (2022 - 2023) Guest Editor for the Special Issue on \"Real-Time Computing in the IoT-to-Edge-to-Cloud Continuum\" of \"ACM Transactions on Embedded Computing Systems (TECS)\". (2022 - 2023) Guest Editor for the Special Issue on \"Predictable Machine Learning\" of \"Springer Real-Time Systems\". Published as part of Volume 59, 2023. Reviewer for international journals: IEEE Transactions on Computers, Springer Real-Time Systems Journal, ACM Transactions on Embedded Computing Systems (TECS), ACM Transactions on Cyber-Physical Systems (TCPS), IEEE Transaction on Emerging Topics in Computing, Journal of Systems and Software, Journal of Systems Architecture, IEEE Embedded Systems Letters, Springer Journal Of Supercomputing, and others. Research Interests My research is focused on Real-Time Embedded and Distributed Systems. In particular I'm working on: Real-time schedulability analysis Predictability in middleware frameworks (ROS 2, DDS, and more) Real-time operating systems and hypervisors Synchronization protocols Component-based Software Design Predictability in AI-based Applications Contacts Daniel Casini, Via G. Moruzzi 1, 56124 Pisa (PI), Italy Scuola Superiore Sant'Anna (TeCiP Institute, ReTiS Laboratory) Tel. +39 050 88 2078 daniel.casini@santannapisa.it -",
  "content_length": 5525,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:58"
}