{
  "name": "Daniel Strüber 0001",
  "homepage": "https://www.danielstrueber.de",
  "status": "success",
  "content": "Daniel Strüber, Software Engineering Researcher Daniel Strüber NEWS CV TEAM SERVICE GRANTS+HONORS­ PAPERS TEACHING Curriculum vitae Contact information I am an associate professor in software engineering in the joint Interaction Design and Software Engineering Division of Chalmers University of Technology and the University of Gothenburg, Sweden. I am also affiliated with the Department of Software Science at Radboud University Nijmegen, Netherlands. With my research, I aim to support software developers during the construction and analysis of complex software systems. Much of my work is in model-driven engineering. I develop model-based languages, tools, and techniques to assure software quality, to manage variability, to establish privacy and security, to support collaborative development, and to explore search spaces. I investigate AI engineering, with a focus on establishing software engineering methods, principles and techniques for machine-learning-enabled software systems. I conduct empirical, formal, and engineering research to understand the challenges faced by developers, develop improved solutions and study their usability and performance benefits. Application domains of my work include robotics, web-based systems, and IDEs. NEWS June 2025. Two papers accepted in SEAA: on trade-off management in MLOps and design patterns for ML-enabled systems. April 2025. Papers accepted in JOT on LLM-assisted reverse engineering of class diagrams, and at LLM4SE on LLM-assisted grammar-instance co-evolution. March 2025. Paper accepted in SoSyM on an empirical study on manual abstraction. February 2025. Paper accepted in JSS on an SLR of architectural tactics for machine-learning-enabled systems. January 2025. Paper accepted in SoSyM on edge deployment of ML models using MDE concepts. November 2024. I received a distinguished reviewer award for my work in the program committee of GPCE 2024. November 2024. Paper accepted in EMSE on an software reconfiguration in robotic systems. November 2024. Paper accepted at SAC on quality trade-offs in machine-learning-enabled systems. September 2024. I'm co-editing a JSS special issue on Trends in Systems and Software Product Line Engineering - consider submitting! Submissions due in January 2025. June 2024. Paper accepted at SEAA on an investigation of DSL development projects on GitHub. CV since 2024 Chalmers | University of Gothenburg. Associate Professor 2021-2024 Chalmers | University of Gothenburg. Senior Lecturer since 2020 Radboud University Nijmegen. Assistant Professor 2018-2020 Chalmers | University of Gothenburg. Post-doc 08-11/2019 King's College London. Research visit 2016-2018 University of Koblenz and Landau. Post-doc 2011-2016 Philipps University Marburg. Doctoral researcher. Graduated summa cum laude - with highest honors. 2005-2011 Philipps University Marburg. Diplom (M.Sc. equivalent). Graduated with distinction. A full CV is available. TEAM Current PhD students Vladislav Indykov (as main supervisor, since 2023) Lars van Arragon (co-supervised with Jan Tretmans, since 2021) Former PhD students Qusai Ramadan (co-supervised with Jan Jürjens; thesis). \t\tNow associate professor, University of Southern Denmark Shayan Ahmadian (co-supervised with Jan Jürjens; thesis). \t\tNow post-doc, Koblenz University Dennis Priefer (co-supervised with Gabriele Taentzer and Peter Kneisel; thesis). \t\tNow professor, THM Mittelhessen Samuel Idowu (co-supervised with Thorsten Berger, thesis). \t\tNow at Zenseact Ricardo Caldas (co-supervised with Thorsten Berger and Patrizio Pelliccione, thesis). \t\tNow postdoc, Gran Sasso Science Institute Weixing Zhang (as main supervisor, thesis). \t\tNow post-doc, Karlsruhe Institute of Technology Former post-poc Diego Damasceno (as post-doc supervisor). Now at ASML SERVICE Organizing 2026   VARIABILITY (Co-Chair Project Showcase Tack) 2024   SPLC (Program Co-Chair) 2022   ICGT (Program Co-Chair) 2019   MiSE (Co-Organizer) 2018   MODELS (Publication Co-Chair) 2017   STAF (Web Chair) Committees 2025   ICSE (PC), ICGT (PC), SPLC (PC), SEAA (PC), MDE Intelligence (PC), DeMeSSA (PC) 2024   SEAA (PC), GPCE (PC), MDE Intelligence (PC) 2023   ASE (PC), FASE (PC), SPLC (PC), GPCE (PC), SEAA (PC), MDE Intelligence (PC), DeMeSSA (PC) 2022   ASE (PC), MODELS (PC), FASE (PC), SPLC (PC), GPCE (PC), SEAA (PC), MODELS Workshops (PC), VM4MT (PC), MDE Intelligence (PC), DeMeSSA (PC) 2021   MODELS (PC), FASE (PC), SPLC (PC), GPCE (PC), SLE (PC), SEAA (PC), MDE Intelligence (PC), VM4MT (PC) 2020   MODELS (PC), SPLC (PC), QUATIC (PC), SEAA (PC), SE Workshops (PC), MDE Intelligence (PC), AMMoRe (PC) 2019   SPLC (PC), ICMT (PC), ICGT (PC), SEAA (PC), BX (PC), FlexMDE (PC), MDE Intelligence (PC), 2018 SEAA (PC), Modellierung tutorials (PC), SICHERHEIT (PC), MOMA3N (PC), FlexMDE (PC), AMMoRe (PC) 2017   MODELS (AEC), SLE (AEC), FlexMDE (PC), BigMDE (PC), GaM (PC), BX (PC), CoCoS (PC), GTSN (PC) 2016   SLE (AEC), FlexMDE (PC), BigMDE (PC) Journal reviewer Transactions on Software Engineering TSE Transactions on Software Engineering and Methodology TOSEM Transactions on Automation Science and Engineering T-ASE Journal of Software and Systems Modeling SoSyM Journal of Systems and Software\tJSS Empirical Software Engineering ESE Science of Computer Programming SCP Formal Aspects of Computing FAOC IEEE Software IEEE SW Information and Software Technology IST Journal of Object Technology JOT PeerJ Computer Science PeerJ Robotics Robotics GRANTS AND HONORS Grants 2022-2024   VR Open Call Grant: SEMLA: Software Engineering for Machine Learning - Integrated Approach (following an evaluation to take on the project after the passing of the former PI, Ivica Crnkovic) 2019   DFG Individual Fellowship: EUphORia: End-User oriented Optimization-Technology Recommender System (funding for a 24-month postdoc stipend) Honors 2025   Best Reviewer Award, Software and Systems Modeling (SoSyM) 2024   Distinguished Reviewer Award, ACM Int. Conf. on Generative Programming: Concepts & Experiences (GPCE) 2023   Distinguished Reviewer Award, ACM International Conference on Systems and Software Product Lines (SPLC) 2020   EASST Best Paper Award, International Conference on Graph Transformations (ICGT) 2020   Transformation Tool Contest Award: Most Comprehensible Solution 2020   Best Reviewer Award, ACM International Conference on Systems and Software Product Lines (SPLC) 2019   SEKE Best Paper Award: 3rd Place, Int. Conference on Software Engineering and Knowledge Engineering (SEKE) 2018   EASST Award Nominee, International Conference on Fundamental Approaches to Software Engineering (FASE) 2017   EATCS Best Paper Award, International Conference on Graph Transformations (ICGT) 2017   Transformation Tool Contest Awards: Most Understandable Solution, Most Complete Solution 2016   EAPLS Best Paper Award, International Conference on Model Transformations (ICMT) 2016   EASST Best Paper Award, International Conference on Graph Transformations (ICGT) 2016   SoSyM Best Paper Award, Journal of Software and Systems Modeling (SoSyM) 2016   EASST Award Nominee, International Conference on Fundamental Approaches to Software Engineering (FASE) 2016   Transformation Tool Contest Award: Best Quality Solution PAPERS generated by Group by Year Author Type Keyword Downloads Expand/Collapse All Download BibTeX RSS Feed Excellent! Next you can create a new website with this list, or embed it in an existing web page by copying & pasting any of the following snippets. JavaScript (easiest) <script src=\"https://bibbase.org/show?bib=danielstrueber.de%2Fpubs.bib&theme=side&commas=true&fullnames=1&jsonp=1\"></script> PHP <?php $contents = file_get_contents(\"https://bibbase.org/show?bib=danielstrueber.de%2Fpubs.bib&theme=side&commas=true&fullnames=1\"); print_r($contents); ?> iFrame (not recommended) <iframe src=\"https://bibbase.org/show?bib=danielstrueber.de%2Fpubs.bib&theme=side&commas=true&fullnames=1\"></iframe> For more details see the documention. This is a preview! To use this list on your own web site or create a new web site from it, create a free account. The file will be added and you will be able to edit it in the File Manager. We will show you instructions once you've created your account. To the site owner: Action required! Mendeley is changing its API. In order to keep using Mendeley with BibBase past April 14th, you need to: renew the authorization for BibBase on Mendeley, and update the BibBase URL in your page the same way you did when you initially set up this page. Fix it now 2025 (10) Software Reconfiguration in Robotics. Sven Peldszus, Davide Brugali, Daniel Strüber, Patrizio Pelliccione, & Thorsten Berger. EMSE'25: Empirical Software Engineering, 30(3): 94:1–51. 2025. paper link bibtex 4 downloads @article{peldszus2025software, title={Software Reconfiguration in Robotics}, author={Peldszus, Sven and Brugali, Davide and Str{\\\"u}ber, Daniel and Pelliccione, Patrizio and Berger, Thorsten}, journal={EMSE'25: Empirical Software Engineering}, volume={30}, number={3}, pages={94:1--51}, year={2025}, url_Paper = {https://link.springer.com/content/pdf/10.1007/s10664-024-10596-9.pdf}, keywords = {Robotics, Software Product Lines} } Architectural Tactics to Achieve Quality Attributes of Machine-Learning-Enabled Systems: A Systematic Literature Review. Vladislav Indykov, Daniel Strüber, & Rebekka Wohlrab. JSS'25: Journal of Systems and Software, 223: 112373:1–20. 2025. paper link bibtex 7 downloads @article{indykov2025architectural, title={Architectural Tactics to Achieve Quality Attributes of Machine-Learning-Enabled Systems: A Systematic Literature Review}, author={Indykov, Vladislav and Str{\\\"u}ber, Daniel and Wohlrab, Rebekka}, year={2025}, publisher={Elsevier}, journal={JSS'25: Journal of Systems and Software}, volume = {223}, pages = {112373:1--20}, year = {2025}, issn = {0164-1212}, url_Paper = {https://www.sciencedirect.com/science/article/pii/S016412122500041X/pdfft?md5=313bdacb9aaebb15621c6bd710e9cd0d&pid=1-s2.0-S016",
  "content_length": 101627,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:39"
}