{
  "name": "Daniel Francis Schmidt",
  "homepage": "https://research.monash.edu/en/persons/daniel-schmidt",
  "status": "success",
  "content": "Daniel Schmidt - Monash University View Scopus Profile Daniel Schmidt Assoc Professor Associate Professor, Department of Data Science & AI https://orcid.org/0000-0002-1788-2375 EmailDaniel.Schmidtmonashedu Accepting PhD StudentsPhD projects<a href=\"https://supervisorconnect.it.monash.edu/\" onclick=\"target='_blank';\">https://supervisorconnect.it.monash.edu/</a> 20022025 Research activity per year Personal profile BiographyDaniel Schmidt is a Senior Lecturer in Data Science at the Faculty of Information Technology, Monash University, Melbourne, Australia. Since completing his PhD in information theoretic inference of linear time series models he has spent 10 years working primarily in the area of Bayesian inference, with specific interest in applications to epidemiological problems, particular the area of statistical genomics. His specific research interests include: Bayesian inference of high dimensional regression models, particularly linear and generalized linear models. He has, along with Dr. Enes Makalic, written a highly efficient toolbox supporting state-of-the-art Bayesian shrinkage priors for high dimensional regression models (available here);Information theoretic statistics, particularly the application of information theory to statistical inference through the Minimum Message/Description Length principles;Statistical genomics, risk prediction and variant discovery, particularly in the areas of cancer genomics. He is interested in using mammography and machine learning techniques to improve risk prediction and the stratification of women by their future risk of breast cancer, with the aim of assisting the creation of personalised screening programmes. Recent pre-prints: Adaptive Bayesian Shrinkage Estimation Using Log-Scale Shrinkage Priors, which describes a new class of shrinkage prior distributions for regression coefficients that can adapt to the sparsity characteristics of the underlying regression coefficients. It also provides simple bounds on behaviour of most existing Bayesian shrinkage priors.A Minimum Message Length Criterion for Robust Linear Regression, which develops a simple, finite sample criterion for model selection in linear models with heavy tailed error distributions using the Minimum Message Length principle. Interestingly, the penalty term can be shown to be related to the signal-to-noise ratio of the fitted model. External Links: His personal github page is https://github.com/dfschmidt80.The BayesReg package for efficient, high dimensional Bayesian penalized regression can be downloaded from here.His google scholar page is here. Monash teaching commitmentDaniel Schmidt has developed, and acted as Chief Examiner and Lecturer, for the following units at the Faculty of Information Technology: FIT2086 Modelling for Data AnalysisFIT3154 Advanced Data Analysis Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Doctor of Philosophy, Monash UniversityAward Date: 16 Oct 2008Computer Science, Bachelor of Digital Systems (Honours), Monash UniversityAward Date: 15 Mar 2003 External positionsSenior Research Fellow (Adjunct), University of Melbourne1 Mar 2018 → … Research area keywordsBayesian InferenceInformation TheoryMinimum Message LengthMinimum Description LengthStatistical and Data AnalysisShrinkage EstimationStatistical genomicsCancer genomicsMammography Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2017 2017 2018 2019 2020 2021 2022 2023 2024 2027 2 Active 7 Finished Projects per year Efficient and effective methods: Efficient and effective methods for classifying massive time series dataWebb, G. (Primary Chief Investigator (PCI)), Schmidt, D. (Chief Investigator (CI)) & Keogh, E. (Partner Investigator (PI))11/03/24 → 10/03/27Project: Research Quantum Information Technology: Quantum Information Technology: Industry Readiness & ApplicationsSteinfeld, R. (Primary Chief Investigator (PCI)), simmons, M. (Chief Investigator (CI)), Usman, M. (Chief Investigator (CI)), Phung, D. (Chief Investigator (CI)), Tack, G. (Chief Investigator (CI)), Pas, E. (Chief Investigator (CI)), Sakzad, A. (Associate Investigator (AI)), Cui, S. (Associate Investigator (AI)), Aleti, A. (Associate Investigator (AI)), Garcia De La Banda Garcia, M. (Associate Investigator (AI)), Nakashima, P. (Associate Investigator (AI)), Schmidt, D. (Associate Investigator (AI)), Esgin, M. (Associate Investigator (AI)) & Fay, J. (Associate Investigator (AI))1/01/23 → 31/12/27Project: Research SETAR-Tree: Global model-based forecasting with Trees and Threshold Autoregressive ModelsSchmidt, D. (Primary Chief Investigator (PCI)), Koo, B. (Chief Investigator (CI)) & Hyndman, R. (Chief Investigator (CI))21/10/22 → 31/12/23Project: Research Rethinking the Data-driven Discovery of Rare PhenomenaBoley, M. (Primary Chief Investigator (PCI)), Buntine, W. (Partner Investigator (PI)), Schmidt, D. (Chief Investigator (CI)), Kuhlmann, L. (Chief Investigator (CI)) & Scheffler, M. (Partner Investigator (PI))29/07/21 → 28/11/24Project: Research Tokopedia : TokoNOW Forecasting Project and Review-based Recommendation Systems development-Tokopedia Bergmeir, C. (Primary Chief Investigator (PCI)), Schmidt, D. (Chief Investigator (CI)), Saputra, R. (Chief Investigator (CI)), Wilson, C. (Chief Investigator (CI)), Taniar, D. (Chief Investigator (CI)) & Lee, V. (Chief Investigator (CI))27/07/21 → 19/09/22Project: Research View all 9 projects Research output Research output per year 2002 2013 2016 2018 2020 2021 2023 2025 81 Article 35 Conference Paper 2 Letter 1 Meeting Abstract 1 More 1 Comment / Debate Research output per year Research output per year Highly Scalable Time Series Classification for Very Large DatasetsDempster, A., Tan, C. W., Miller, L., Foumani, N. M., Schmidt, D. F. & Webb, G. I., 2025, Advanced Analytics and Learning on Temporal Data - 9th ECML PKDD Workshop, AALTD 2024 Vilnius, Lithuania, September 9–13, 2024 Revised Selected Papers. Lemaire, V., Ifrim, G., Bagnall, A., Guyet, T., Malinowski, S., Schäfer, P. & Tavenard, R. (eds.). Cham Switzerland: Springer, p. 80-95 16 p. (Lecture Notes in Computer Science; vol. 15433).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Time series adversarial attacks: an investigation of smooth perturbations and defense approachesPialla, G., Ismail Fawaz, H., Devanne, M., Weber, J., Idoumghar, L., Muller, P. A., Bergmeir, C., Schmidt, D. F., Webb, G. I. & Forestier, G., Jan 2025, In: International Journal of Data Science and Analytics. 19, p. 129–139 11 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 4 Citations (Scopus) Breast and bowel cancers diagnosed in people ‘too young to have cancer’: A blueprint for research using family and twin studiesHopper, J. L., Li, S., MacInnis, R. J., Dowty, J. G., Nguyen, T. L., Bui, M., Dite, G. S., Esser, V. F. C., Ye, Z., Makalic, E., Schmidt, D. F., Goudey, B., Alpen, K., Kapuscinski, M., Win, A. K., Dugué, P. A., Milne, R. L., Jayasekara, H., Brooks, J. D. & Malta, S. & 11 others, Calais-Ferreira, L., Campbell, A. C., Young, J. T., Nguyen-Dumont, T., Sung, J., Giles, G. G., Buchanan, D., Winship, I., Terry, M. B., Southey, M. C. & Jenkins, M. A., Dec 2024, In: Genetic Epidemiology. 48, 8, p. 433-447 15 p.Research output: Contribution to journal › Article › Research › peer-review Open Access 2 Citations (Scopus) Computing marginal and conditional divergences between decomposable models with applications in quantum computing and earth observationLee, L. K., Webb, G. I., Schmidt, D. F. & Piatkowski, N., 22 Aug 2024, In: Knowledge and Information Systems. 66, p. 7527–7556 30 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile Forecasting events in multidimensional electroencephalographic brain data: Application to epileptic seizure prediction.Liu, Y., Soto-Breceda, A., Cook, M. J., Karoly, P., Grayden, D. B., Kuhlmann, L., Freestone, D. R. & Schmidt, D., 2024, FUSION 2024 - 27th International Conference on Information Fusion. Marcenaro, L. & Rago, C. (eds.). Piscataway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, 8 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 2 Citations (Scopus) View all 120 research outputs",
  "content_length": 8943,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:05"
}