{
  "name": "Daniel P. Huttenlocher",
  "homepage": "https://web.mit.edu/hutt/www",
  "status": "success",
  "content": "Dan Huttenlocher Dan Huttenlocher Dean, MIT Schwarzman College of Computing (link) Henry Ellis Warren (1894) Professor, Computer Science and AI & Decision-Making Dept. of Electrical Engineering and Computer Science Office: 45-301 Mailing Address: MIT, 77 Mass. Ave., Cambridge, MA 02139 Email: last name at mit.edu Assistant: Eric Fletcher Brief Bio. Daniel Huttenlocher is the inaugural dean of the MIT Schwarzman College of Computing. Previously he helped found Cornell Tech, the digital technology oriented graduate school created by Cornell University in New York City, and served as its first Dean and Vice Provost. His research and teaching have been recognized by a number of awards including ACM Fellow and CASE Professor of the Year. Huttenlocher's main research interests are in computer vision, social media, and understanding AI. He has a mix of academic and industry background, having been a Computer Science faculty member at Cornell, researcher and manager at the Xerox Palo Alto Research Center (PARC), and CTO of a fintech startup. He served as a member and as the chair of the board of the John D. and Catherine T. MacArthur Foundation, and currently serves as a member of the boards of Corning Inc. and Amazon.com. He received his bachelor's degree from the University of Michigan, and master's and doctorate from MIT. Research and Scholarship My research often bridges between academic subfields and between academia and industry. During the past decade I've primarily served in organizational leadership roles, leaving more limited time for research. In the past several years I've been concerned with how to develop a better understanding of the broader implications of AI, and have co-authored the 2021 book The Age of AI: And Our Human Future, which aims to engage people in more in-depth conversation about how AI is changing the nature of what it means to be human. I wrote an earlier article with the same co-authors in The Atlantic. Some interviews that Eric Schmidt and I have done about the book include the Hidden Forces podcast and a CHM Live conversation with Computer History Museum CEO Dan'l Lewin. Over the years I've developed a number of algorithmically-oriented computer vision techniques. The super-pixel segmentation method and Hausdorff distance methods that I helped create remain widely used, even in this era of deep learning. Hausdorff based image compression software that we created at Xerox nearly 25 years ago is also still used in document scanners. I worked on early studies of the first online social networks such as group formation on LiveJournal, and have continued to work on social network analysis. I helped lead a team at Cornell that developed one of the first self-driving cars as part of the DARPA Urban Challenge. Our vehicle was involved in the first fully autonomous two-car collision during the race (with the vehicle from MIT). Presentations Campus Lecture on the Age of AI October 4, 2024, EPFL Discussion on AI, together with Walter Isaacson and Eric Schmidt at June 26, 2023, Aspen Ideas Festival Accessibility",
  "content_length": 3082,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:25"
}