{
  "name": "Daniel Rivero",
  "homepage": "https://pdi.udc.es/en/File/Pdi/Y58VG",
  "status": "success",
  "content": "Daniel Rivero Cebrián File. Department Computer Science and Information Technologies Knowledgment area Computational Science and Artificial Intelligence Research Research group Redes de Neuronas Artificiales y Sistemas Adaptativos - Imagen Médica y Diagnóstico Radiológico Research lines Procesado de señales e imágenes mediante técnicas de Aprendizaje Máquina Keywords Redes de Neuronas Artificiales, Aprendizaje Máquina, Computación Evolutiva Teaching merits evaluation 3 five years period(s) Research merits evaluation 3 six years period(s) Contacto UDC directory Orcid id0000-0001-8245-3094 Scopus6603716776 One of the data sources for my teaching/research is the Alpha Vantage Stock API (https://www.alphavantage.co/). The data repository is among the global financial data sources in the machine learning and quantitative finance domains (https://medium.com/@patrick.collins_58673/stock-api-landscape-5c6e054ee631 ). Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Advanced Models of Machine Learning I Degree in Artificial Intelligence Optional 0 34.5 Fundamentals of Machine Learning Degree in Artificial Intelligence Compulsory 0 55 Machine Learning Degree in Computer Engineering Optional 0 63 Machine Learning I Degree in Data Science and Engineering Compulsory 0 35 Master´s Dissertation Master's Degree in Artificial Intelligence Compulsory 0 6.5 Master's Dissertation Master's in Computer Engineering Compulsory 0 5 Subject and involved studies Type Distance hours Total hours Advanced Models of Machine Learning I Degree in Artificial Intelligence Optional 0 31.5 Fundamentals of Machine Learning Degree in Artificial Intelligence Compulsory 0 33 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 19 Machine Learning Degree in Computer Engineering Optional 0 84 Machine Learning I Degree in Data Science and Engineering Compulsory 0 42 Subject and involved studies Type Distance hours Total hours Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 8 Fundamentals of Machine Learning Degree in Artificial Intelligence Compulsory 0 30 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 34 Machine Learning Degree in Computer Engineering Optional 0 42 Machine Learning I Degree in Data Science and Engineering Compulsory 0 42 Machine Learning I Master's Degree in Artificial Intelligence Compulsory 0 10.5 Subject and involved studies Type Distance hours Total hours Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 4 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 29 Machine Learning Degree in Computer Engineering Optional 0 91 Machine Learning I Degree in Data Science and Engineering Compulsory 0 17 Machine Learning I Master's Degree in Artificial Intelligence Compulsory 0 21 Master's Dissertation Master's in Computer Engineering Compulsory 0 5 Subject and involved studies Type Distance hours Total hours Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 4 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Master's in Computer Engineering Compulsory 0 37.5 Machine Learning Degree in Computer Engineering Optional 0 16.5 Machine Learning I Degree in Data Science and Engineering Compulsory 0 17 Master's Dissertation Master's in Computer Engineering Compulsory 0 5 Subject and involved studies Type Distance hours Total hours Computer Graphics and Visualization Degree in Computer Engineering Optional 0 21 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 4 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 98 Machine Learning Degree in Computer Engineering Optional 0 58.5 Machine Learning I Degree in Data Science and Engineering Compulsory 0 17 Tutoring 2025/2026 Defined tutoring by teacher for 2025/2026 academic course. Faculty of Computer Science Quarter Day Site 1st quarter Monday 10:30 a 12:00 Despacho 4.12 2nd quarter Thursday 10:00 a 11:30 Despacho 4.12 EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2024/2025 2022/2023 2021/2022 2020/2021 2019/2020 2018/2019 2017/2018 2016/2017 2015/2016 2014/2015 Analysis of Deep Learning models in Orthopoxvirus classification on reduced datasets using resampling techniques Conversion from text to speech for the Galician language Data Capture and Synchronization Framework for Brain-Computer Interface Dataset Creation Gesture recognition interaction system Development of a mobile application that allows the analysis of the tennis serve technique Development of a library for federated learning under a peer-to-peer architecture Development of a server application for a portable near-infrared spectrometry laboratory WorldGenerator: System for procedural generation of large 3D natural environments based on combinations of noise maps and Poisson samplings Curae: for a safe aging System for advising on preventive lock-downs in the Vigo estuary due to lipophilic biotoxins Development of a portable laboratory for near infrared spectroscopy Automatic system for the estimation of the weight of solid waste Dynamic sky simulation system with realistic position of the celestial bodies in Unity3D A library development to support the research and comparison of population-based search techniques. Urbunity: a generator system of 3D urban environments Cyclical terrain simulation system oriented to virtual environments development in Unity 3D FISIC: a library for 3d environment generation from music Development of a bioinformatics platform for the storage and retrieval of data from massive genome sequencing in the field of marine biology and its application in processing and analysis of the data. Development of an animation correction system for bipedal characters in 3D environments Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Patents, records and utility models Papers in research journals Complete books Book chapters PhD theses directed Conference papers 2022 2019 2016 2015 2014 ... 2013 2012 2011 2010 2009 2007 Funding entity Consellería de Educación Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 01/01/2022 to 20/11/2025 Funding entity CONSELLERÍA DO MAR - XUNTA DE GALICIA Main researches Javier Cremades Ugarte / Juan Rabuñal Dopico Type Proyecto UE Dates From 01/01/2022 to 31/12/2025 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 01/01/2019 to 20/11/2021 Funding entity Fondo Europeo de Desarrollo Regional (FEDER) Main researches Juan Ramón Rabuñal Dopico Type Contrato Dates From 20/01/2016 to 31/12/2018 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Manuel F. González Penedo Type Proyecto Programas Autonomicos Dates From 01/01/2016 to 30/11/2019 Funding entity CONSIGA PROJECTS S.L Main researches Alejandro Pazos Sierra Type Contrato Dates From 30/12/2015 to 30/06/2016 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 17/10/2014 to 17/10/2017 Funding entity Centro para el Desarrollo Tecnológico e Industrial (CDTI) Main researches Juan Ramón Rabuñal Dopico Type Contrato Dates From 14/03/2013 to 31/12/2015 Funding entity Ministerio de Economía y Competitividad (MINECO) Main researches Alejandro Pazos Sierra Type Proyecto Programas Nacionales Dates From 01/09/2013 to 01/09/2016 Funding entity SIVSA, Soluciones Informáticas, S.A. Main researches Alejandro Pazos Sierra Type Contrato Dates From 23/04/2013 to 31/12/2014 Funding entity ALDABA SERVICIOS PROFESIONALES, S.L. Main researches Marcos Gestal Pose Type Contrato Dates From 23/03/2013 to 31/12/2014 Funding entity AYCO Internet SL Main researches Daniel Rivero Cebrián Type Contrato Dates From 03/04/2013 to 31/12/2014 Funding entity COREMAIN S.L.U. Main researches Jul¡an Dorado de la Calle Type Contrato Dates From 03/04/2013 to 31/12/2014 Funding entity Ministerio de Economía y Competitividad (MINECO) Main researches Alejandro Pazos Sierra Type Proyecto Programas Nacionales Dates From 01/01/2013 to 31/12/2015 Funding entity Xunta de Galicia Main researches Ricardo Cao Abad Type Proyecto Programas Autonomicos Dates From 01/01/2012 to 31/12/2013 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 19/08/2011 to 18/08/2014 Funding entity CAMI, Incorporated Main researches Alejandro Pazos Sierra Type Contrato Dates From 24/11/2011 to 24/12/2012 Funding entity ALDABA Servicios Profesionales, S.L. Main researches Alejandro Pazos Sierra Type Contrato Dates From 09/12/2011 to 28/02/2015 Funding entity Sanatorio Quirúrgico Modelo, S.L. Main researches Alejandro Pazos Sierra Type Contrato Dates From 13/12/2011 to 28/02/2015 Funding entity Ministerio de Economía y Competitividad Main researches Ana Belén Porto Pazos Type Proyecto Programas Nacionales Dates From 01/01/2010 to 30/06/2013 Funding entity A-CERO Inmobiliaria Joaquín Torres Arquitectos S.L. Main researches Julián Dorado De La Calle Type Contrato Dates From 31/07/2009 to 31/12/2010 Funding entity Ministerio de Educación y Ciencia Main researches Jerónimo Puertas Agudo Type Proyecto Programas Nacionales Dates From 01/10/2007 to 30/09/2010 Type Proyecto Otros Programas Dates From 31/08/2007 to 15/11/2010 Funding entity Consell",
  "content_length": 32597,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:35"
}