{
  "name": "Daniel Sánchez 0003",
  "homepage": "http://people.csail.mit.edu/sanchez",
  "status": "success",
  "content": "Daniel Sanchez, MIT Daniel Sanchez Professor, MIT EECS Contact Information Address: MIT CSAIL, 32 Vassar St, 32-G838, Cambridge, MA 02139 E-mail: CAPTCHA I am a Professor at MIT's Electrical Engineering and Computer Science Department and a member of the Computer Science and Artificial Intelligence Laboratory. I work in computer architecture and computer systems. My current research focuses on large-scale multicores with hundreds to thousands of cores, scalable and efficient memory hierarchies, architectures with quality-of-service guarantees, and scalable runtimes and schedulers. Before joining MIT in September 2012, I earned a Ph.D. in Electrical Engineering from Stanford University, where I worked with Professor Christos Kozyrakis. I have also received an M.S. in Electrical Engineering from Stanford (2009) and a B.S. in Telecommunications Engineering from the Technical University of Madrid, UPM (2007). You can access my Curriculum Vitae here. Teaching Fall 2024: 6.5900 Computer System Architecture Spring 2024: 6.191 Computation Structures Fall 2023: 6.5900 Computer System Architecture Spring 2023: 6.191 Computation Structures Fall 2022: 6.191 Computation Structures Spring 2022: 6.004 Computation Structures Fall 2021: 6.823 Computer System Architecture Spring 2021: 6.823 Computer System Architecture Fall 2020: 6.004 Computation Structures Spring 2020: 6.823 Computer System Architecture Fall 2019: 6.004 Computation Structures Spring 2019: 6.823 Computer System Architecture Fall 2018: 6.004 Computation Structures Spring 2018: 6.S084 Computation Structures (special) Fall 2017: 6.004 Computation Structures Spring 2017: 6.823 Computer System Architecture Spring 2016: 6.823 Computer System Architecture Fall 2015: 6.004 Computation Structures Spring 2015: 6.823 Computer System Architecture Fall 2014: 6.004 Computation Structures Spring 2014: 6.823 Computer System Architecture Fall 2013: 6.004 Computation Structures Spring 2013: 6.888 Parallel and Heterogeneous Computer Architecture Fall 2012: 6.004 Computation Structures (recitations) Students Axel Feldmann (Ph.D.) Hyun Ryong (Ryan) Lee (Ph.D.) Fares Elsabbagh (Ph.D., co-advised with Joel Emer) Shabnam Sheikhha (Ph.D.) Xingran (Maggie) Du (S.M./Ph.D., co-advised with Joel Emer) Aleksandar Krastev (S.M./Ph.D.) Courtney Golden (S.M./Ph.D., co-advised with Joel Emer) Viansa Schmulbach (S.M./Ph.D., co-advised with Christina Delimitrou) Alumni Nathan Beckmann (Ph.D. 2015, Post-Doc 2015-2016) Harshad Kasture (Ph.D. 2017) Suvinay Subramanian (Ph.D. 2018) Po-An Tsai (Ph.D. 2019) Mark Jeffrey (Ph.D. 2019) Guowei Zhang (Ph.D. 2020) Maleen Abeydeera (Ph.D. 2021) Quan M. Nguyen (Ph.D. 2022, Post-Doc 2022-2023) Victor Ying (Ph.D. 2023) Nikola Samardzic (Ph.D. 2024) Yifan Yang (Ph.D. 2024) Nosayba El-Sayed (Post-Doc 2018) Cong Yan (S.M. 2015) Anurag Mukkara (S.M. 2016) Webb Horn (M.Eng. 2015) Virginia Chiu (M.Eng. 2016) Yee Ling Gan (M.Eng. 2018) Domenic Nutile (M.Eng. 2020) Robert Durfee (M.Eng. 2022) Aleksandar Krastev (M.Eng. 2023) Nithya Attaluri (M.Eng. 2023) Alan Y. Zhu (M.Eng. 2024) Publications Azul: An Accelerator for Sparse Iterative Solvers Leveraging Distributed On-Chip Memory, Axel Feldmann, Courtney Golden, Yifan Yang, Joel S. Emer, Daniel Sanchez, in Proceedings of the 57th annual IEEE/ACM international symposium on Microarchitecture (MICRO-57), October 2024 (to appear) Terminus: A Programmable Accelerator for Read and Update Operations on Sparse Data Structures, Hyun Ryong Lee, Daniel Sanchez, in Proceedings of the 57th annual IEEE/ACM international symposium on Microarchitecture (MICRO-57), October 2024 (to appear) Accelerating Zero-Knowledge Proofs Through Hardware-Algorithm Co-Design, Nikola Samardzic, Simon Langowski, Srinivas Devadas, Daniel Sanchez, in Proceedings of the 57th annual IEEE/ACM international symposium on Microarchitecture (MICRO-57), October 2024 (to appear) Trapezoid: A Versatile Accelerator for Dense and Sparse Matrix Multiplications, Yifan Yang, Joel S. Emer, Daniel Sanchez, in Proceedings of the 51st International Symposium in Computer Architecture (ISCA-51), June 2024 A Tensor Compiler with Automatic Data Packing for Simple and Efficient Fully Homomorphic Encryption, Aleksandar Krastev, Nikola Samardzic, Simon Langowski, Srinivas Devadas, Daniel Sanchez, in Proceedings of the ACM on Programming Languages, Volume 8 (PLDI), June 2024 BitPacker: Enabling High Arithmetic Efficiency in Fully Homomorphic Encryption Accelerators, Nikola Samardzic, Daniel Sanchez, in Proceedings of the 29th international conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS-29), April 2024 Accelerating RTL Simulation with Hardware-Software Co-Design, Fares Elsabbagh, Shabnam Sheikhha, Victor A. Ying, Quan M. Nguyen, Joel S. Emer, Daniel Sanchez, in Proceedings of the 56th annual IEEE/ACM international symposium on Microarchitecture (MICRO-56), October 2023 [paper] [bibtex] Spatula: A Hardware Accelerator for Sparse Matrix Factorization, Axel Feldmann, Daniel Sanchez, in Proceedings of the 56th annual IEEE/ACM international symposium on Microarchitecture (MICRO-56), October 2023 [paper] [bibtex] Phloem: Automatic Acceleration of Irregular Applications with Fine-Grain Pipeline Parallelism, Quan M. Nguyen, Daniel Sanchez, in Proceedings of the 29th international symposium on High Performance Computer Architecture (HPCA-29), February 2023 [paper] [bibtex] ISOSceles: Accelerating Sparse CNNs through Inter-Layer Pipelining, Yifan Yang, Joel Emer, Daniel Sanchez, in Proceedings of the 29th international symposium on High Performance Computer Architecture (HPCA-29), February 2023 [paper] [bibtex] Designing Hardware for Cryptography and Cryptography for Hardware, Srinivas Devadas, Simon Langowski, Nikola Samardzic, Sacha Servan-Schreiber, Daniel Sanchez, Invited article to the ACM Conference on Computer and Communications Security (CCS) [paper] [bibtex] Datamime: Generating Representative Benchmarks by Automatically Synthesizing Datasets, Hyun Ryong Lee, Daniel Sanchez, in Proceedings of the 55th annual IEEE/ACM international symposium on Microarchitecture (MICRO-55), October 2022 [paper] [code] [bibtex] CraterLake: A Hardware Accelerator for Efficient Unbounded Computation on Encrypted Data, Nikola Samardzic, Axel Feldmann, Aleksandar Krastev, Nathan Manohar, Nicholas Genise, Srinivas Devadas, Karim Eldefrawy, Christopher Peikert, Daniel Sanchez, in Proceedings of the 49th International Symposium in Computer Architecture (ISCA-49), June 2022 [paper] [bibtex] An Architecture to Accelerate Computation on Encrypted Data, Axel Feldmann, Nikola Samardzic, Aleksandar Krastev, Srinivas Devadas, Ronald Dreslinski, Christopher Peikert, Daniel Sanchez, in IEEE Micro's Top Picks from the Computer Architecture Conferences, May/June 2022 [paper] [bibtex] Fifer: Practical Acceleration of Irregular Applications on Reconfigurable Architectures, Quan M. Nguyen, Daniel Sanchez, in Proceedings of the 54th annual IEEE/ACM international symposium on Microarchitecture (MICRO-54), October 2021 [paper] [talk] [bibtex] F1: A Fast and Programmable Accelerator for Fully Homomorphic Encryption, Axel Feldmann, Nikola Samardzic, Aleksandar Krastev, Srinivas Devadas, Ronald Dreslinski, Christopher Peikert, Daniel Sanchez, in Proceedings of the 54th annual IEEE/ACM international symposium on Microarchitecture (MICRO-54), October 2021 (selected for IEEE Microâs Top Picks special issue of \"most significant papers in computer architecture based on novelty and long-term impact\" from 2021) [paper] [talk] [bibtex] F1: A Fast and Programmable Accelerator for Fully Homomorphic Encryption (Extended Version), Axel Feldmann, Nikola Samardzic, Aleksandar Krastev, Srinivas Devadas, Ronald Dreslinski, Karim Eldefrawy, Nicholas Genise, Christopher Peikert, Daniel Sanchez, arXiv:2109.05371 [paper] [bibtex] SpZip: Architectural Support for Effective Data Compression In Irregular Applications, Yifan Yang, Joel S. Emer, Daniel Sanchez, in Proceedings of the 48th International Symposium in Computer Architecture (ISCA-48), June 2021 [paper] [talk] [bibtex] Taming the Zoo: A Unified Graph Compiler Framework for Novel Architectures, Ajay Brahmakshatriya, Emily Furst, Victor Ying, Claire Hsu, Changwan Hong, Max Ruttenberg, Yunming Zhang, Tommy Jung, Dustin Richmond, Michael Taylor, Julian Shun, Mark Oskin, Daniel Sanchez, Saman Amarasinghe, in Proceedings of the 48th International Symposium in Computer Architecture (ISCA-48), June 2021 [paper] [talk] [bibtex] Leaking Secrets Through Compressed Caches, Po-An Tsai, Andres Sanchez, Christopher W. Fletcher, Daniel Sanchez, in IEEE Micro's Top Picks from the Computer Architecture Conferences, May/June 2021 [paper] [bibtex] Gamma: Leveraging Gustavson's Algorithm to Accelerate Sparse Matrix Multiplication, Guowei Zhang, Nithya Attaluri, Joel S. Emer, Daniel Sanchez, in Proceedings of the 26th international conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS-26), April 2021 [paper] [bibtex] Pipette: Improving Core Utilization on Irregular Applications through Intra-Core Pipeline Parallelism, Quan M. Nguyen, Daniel Sanchez, in Proceedings of the 53rd annual IEEE/ACM international symposium on Microarchitecture (MICRO-53), October 2020 [paper] [talk] [bibtex] Thereâs plenty of room at the Top: What will drive computer performance after Mooreâs law?, Charles E. Leiserson, Neil C. Thompson, Joel S. Emer, Bradley C. Kuszmaul, Butler W. Lampson, Daniel Sanchez, Tao B. Schardl, in Science, 368(1079), June 2020 [paper] [bibtex] T4: Compiling Sequential Code for Effective Speculative Parallelization in Hardware, Victor A. Ying, Mark C. Jeffrey, Daniel Sanchez, in Proceedings of the 47th International Symposium in Computer Architecture (ISCA-47), June 2020 [paper] [talk] [bibtex] Chronos: Efficient Speculative Parallelism for Accelerators, Maleen Abeydeera, Daniel Sanchez, in Proceedings of the 25th internati",
  "content_length": 23604,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:40"
}