{
  "name": "Daniel Ritchie",
  "homepage": "https://dritchie.github.io",
  "status": "success",
  "content": "Daniel Ritchie Daniel Ritchie Affiliations Brown University Computer Science Department Brown Visual Computing Contact Information CIT, Room 445 115 Waterman Street Providence, RI 02912 Office hours: Book a slot Info for prospective students Teaching Fall 2025 CSCI 1230: Introduction to Computer Graphics Spring 2025 CSCI 2240: Advanced Computer Graphics Fall 2024 CSCI 1230: Introduction to Computer Graphics Spring 2024 CSCI 2240: Advanced Computer Graphics Talks & Videos Deep Learning for 3D Geometry SGP 2024 Summer School (with Zoë Marschner) Learning to Represent Shapes with Programs SGP 2022 Summer School Neurosymbolic Generative Models for Structured 3D Content 3D Geometry and Vision (3DGV) Seminar We Need a Deeper Network Brown CSCI 1470/2470 Fall 2020 end-of-semester song Probabilistic Programming for Computer Graphics PROBPROG 2018 Resources Graphics PhD Mentoring Slack workspace An online discussion community for those who mentor graphics PhD students. Send me email if you'd like to join. Deep Learning for 3D Geometry My slides for the course that Zoë Marschner and I taught at SGP '24 The SIGGRAPH Logo Gallery An interactive gallery of paper figures featuring the SIGGRAPH name and/or logo Optimeet A tool for coordinated scheduling of multiple meetings REU Site: AI for Computational Creativity Website for our NSF REU Site exploreCSR: Socially-Reponsible AI for Computational Creativity Website for our undergrad research experience program (in partnership with Google Research) Learning to Generate 3D Shapes and Scenes Website for our CVPR 2021 Workshop Learning 3D Generative Models Website for our CVPR 2020 Workshop Learning Generative Models of 3D Structures Slides from our Eurographics 2019 Tutorial Three-phase Paper Writing An algorithm for writing technical papers About I am an Associate Professor of Computer Science at Brown University, where I co-lead the Brown Visual Computing group. My research sits at the intersection of computer graphics, artificial intelligence, and machine learning—especially how AI and ML tools can make the process of creating graphics content easier, more accessible, and more enjoyable. I'm particularly interested in technologies for creating, manipulating, and analyzing 3D shapes and scenes, and these days I'm excited about neurosymbolic methods for doing so (combining the best aspects of procedural models and deep neural networks). My research is funded by gifts from Adobe, Autodesk, Roblox, Pixar, and NVIDIA, as well as grants from DARPA and the National Science Foundation, including an NSF CAREER Award. I received my PhD from Stanford University, where I worked with Pat Hanrahan in the Graphics Lab and with Noah Goodman in the Computation and Cognition Lab. I received my undergraduate degree from the University of California, Berkeley. My Erdős number is 4 (Daniel Ritchie → Niloy Mitra → Leonidas Guibas → Boris Aronov → Paul Erdős). My Bacon number is 3, though only if you count all film credits, not just cast appearances (Daniel Ritchie → John Lasseter → Tom Hanks → Kevin Bacon). This (debatably) makes my Erdős-Bacon number 7. News November 2025 Applications are open for our NSF summer REU site, Artificial Intelligence for Computational Creativity! The application deadline is February 3. October 2025 Applications are now open for the Spring 2026 edition of our exploreCSR program, Socially-Responsible Artificial Intelligence! September 2025 Four papers accepted to SIGGRAPH Asia 2025! June 2025 New paper on zero-shot single-view 3D scene modeling (led by awesome collaborators at SFU) accepted to ICCV 2025! March 2025 Aditya and Rao had papers accepted to CVPR 2025! Archive Publications GenHSI: Controllable Generation of Human-Scene Interaction Videos Zekun Li, Rui Zhou, Rahul Sajnani, Xiaoyan Cong, Daniel Ritchie, and Srinath Sridhar WACV 2026 project page | arxiv | code Procedural Scene Programs for Open-Universe Scene Generation: LLM-Free Error Correction via Program Search Maxim Gumin, Do Heon Han, Seung Jean Yoo, Aditya Ganeshan, R. Kenny Jones, Kailiang Fu, Rio Aguina-Kang, Stewart Morris, and Daniel Ritchie SIGGRAPH Asia 2025 arxiv PartComposer: Learning and Composing Part-Level Concepts from Single-Image Examples Junyu Liu, R. Kenny Jones, and Daniel Ritchie SIGGRAPH Asia 2025 project page | arxiv | code MiGumi: Making Tightly Coupled Integral Joints Millable Aditya Ganeshan, Kurt Fleischer, Wenzel Jakob, Ariel Shamir, Daniel Ritchie, Takeo Igarashi, and Maria Larsson SIGGRAPH Asia 2025 project page | paper | code | dataset PoissonNet: A Local-Global Approach for Learning on Surfaces Arman Maesumi, Tanish Makadia, Thibault Groueix, Vladimir Kim, Daniel Ritchie, and Noam Aigerman SIGGRAPH Asia 2025 project page | paper | code Diorama: Unleashing Zero-shot Single-view 3D Scene Modeling Qirui Wu, Denys Iliash, Daniel Ritchie, Manolis Savva, and Angel X. Chang ICCV 2025 project page | arXiv Highlight GigaHands: A Massive Annotated Dataset of Bimanual Hand Activities Rao Fu, Dingxi Zhang, Alex Jiang, Wanjia Fu, Austin Funk, Daniel Ritchie, and Srinath Sridhar CVPR 2025 project page | arXiv Highlight Pattern Analogies: Learning to Perform Programmatic Image Edits by Analogy Aditya Ganeshan, Thibault Groueix, Paul Guerrero, Radomír Měch, Matthew Fisher, and Daniel Ritchie CVPR 2025 project page | arXiv Learning to Edit Visual Programs with Self-Supervision R. Kenny Jones, Renhao Zhang, Aditya Ganeshan, and Daniel Ritchie NeurIPS 2024 project page | arXiv | code ParSEL: Parameterized Shape Editing with Language Aditya Ganeshan, Ryan Y. Huang, Xianghao Xu, R. Kenny Jones, and Daniel Ritchie SIGGRAPH Asia 2024 project page | arXiv CLIPtortionist: Zero-shot Text-driven Deformation for Manufactured 3D Shapes Xianghao Xu, Srinath Sridhar, and Daniel Ritchie arXiv preprint arXiv R3DS: Reality-linked 3D Scenes for Panoramic Scene Understanding Qirui Wu, Sonia Raychaudhuri, Daniel Ritchie, Manolis Savva, and Angel X. Chang EECV 2024 project page | arXiv One Noise to Rule Them All: Learning a Unified Model of Spatially-Varying Noise Patterns Arman Maesumi, Dylan Hu, Krishi Saripalli, Vladimir Kim, Matthew Fisher, Sören Pirk, and Daniel Ritchie SIGGRAPH 2024 project page | arXiv | paper Learning to Infer Generative Template Programs for Visual Concepts R. Kenny Jones, Siddhartha Chaudhuri, and Daniel Ritchie ICML 2024 project page | arXiv PossibleImpossibles: Exploratory Procedural Design of Impossible Structures Yuanbo Li, Tianyi Ma, Zaineb Aljumayaat, and Daniel Ritchie Eurographics 2024 paper | code CharacterMixer: Rig-Aware Interpolation of 3D Characters Xiao Zhan, Rao Fu, and Daniel Ritchie Eurographics 2024 project page | arXiv | paper Generalizing Single-View 3D Shape Retrieval to Occlusions and Unseen Objects Qirui Wu, Daniel Ritchie, Manolis Savva, and Angel X. Chang 3DV 2024 project page | arXiv Open-Universe Indoor Scene Generation using LLM Program Synthesis and Uncurated Object Databases Rio Aguina-Kang, Maxim Gumin, Do Heon Han, Stewart Morris, Seung Jean Yoo, Aditya Ganeshan, R. Kenny Jones, Qiuhong Anna Wei, Kailiang Fu, and Daniel Ritchie arXiv preprint arXiv Editing Motion Graphics Videos via Motion Vectorization & Transformation Sharon Zhang, Jiaju Ma, Daniel Ritchie, Jiajun Wu, and Maneesh Agrawala SIGGRAPH Asia 2023 project page | arXiv Explorable Mesh Deformation Subspaces from Unstructured 3D Generative Models Arman Maesumi, Paul Guerrero, Vladimir Kim, Matthew Fisher, Siddhartha Chaudhuri, Noam Aigerman, and Daniel Ritchie SIGGRAPH Asia 2023 project page | paper | arXiv Improving Unsupervised Visual Program Inference with Code Rewriting Families Aditya Ganeshan, R. Kenny Jones, and Daniel Ritchie ICCV 2023 project page | paper | arXiv Oral Presentation ShapeCoder: Discovering Abstractions for Visual Programs from Unstructured Primitives R. Kenny Jones, Paul Guerrero, Niloy Mitra, and Daniel Ritchie SIGGRAPH 2023 project page | arXiv Unsupervised 3D Shape Reconstruction by Part Retrieval and Assembly Xianghao Xu, Paul Guerrero, Matthew Fisher, Siddhartha Chaudhuri, and Daniel Ritchie CVPR 2023 arXiv CLIP-Sculptor: Zero-Shot Generation of High-Fidelity and Diverse Shapes from Natural Language Aditya Sanghi, Rao Fu, Vivian Liu, Karl D. D. Willis, Hooman Shayani, Amir Hosein Khasahmadi, Srinath Sridhar, and Daniel Ritchie CVPR 2023 project page | arXiv Neurosymbolic Models for Computer Graphics Daniel Ritchie, Paul Guerrero, R. Kenny Jones, Niloy Mitra, Adriana Schulz, Karl D. D. Willis, and Jiajun Wu Eurographics 2023 STAR arXiv | paper ShapeCrafter: A Recursive Text-Conditioned 3D Shape Generation Model Rao Fu, Xiao Zhan, Yiwen Chen, Daniel Ritchie, and Srinath Sridhar NeurIPS 2022 arXiv | project page SHRED: 3D Shape Region Decomposition with Learned Local Operations R. Kenny Jones, Aalia Habib, and Daniel Ritchie SIGGRAPH Asia 2022 arXiv | project page The Shape Part Slot Machine: Contact-based Reasoning for Generating 3D Shapes from Parts Kai Wang, Paul Guerrero, Vladimir Kim, Siddhartha Chaudhuri, Minhyuk Sung, and Daniel Ritchie ECCV 2022 arXiv Unsupervised Kinematic Motion Detection for Part-segmented 3D Shape Collections Xianghao Xu, Yifan Ruan, Srinath Sridhar, and Daniel Ritchie SIGGRAPH 2022 paper | arXiv | code PLAD: Learning to Infer Shape Programs with Pseudo-Labels and Approximate Distributions R. Kenny Jones, Homer Walke, and Daniel Ritchie CVPR 2022 project page | arXiv The Neurally-Guided Shape Parser: Grammar-based Labeling of 3D Shape Regions with Approximate Inference R. Kenny Jones, Aalia Habib, Rana Hanocka, and Daniel Ritchie CVPR 2022 project page | arXiv Learning to Infer Kinematic Hierarchies for Novel Object Instances Hameed Abdul-Rashid, Miles Freeman, Ben Abbatematteo, George Konidaris, and Daniel Ritchie ICRA 2022 arXiv Learning Body-Aware 3D Shape Generative Models Bryce Blinn, Alexander Ding, R. Kenny Jones, Manolis Savva, Srinath Sridhar, and Daniel Ritchie arXiv preprint arXiv ShapeMOD: Macro Operation Discovery for 3D Shape P",
  "content_length": 15753,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:30"
}