{
  "name": "Daniel Jackson 0001",
  "homepage": "http://people.csail.mit.edu/dnj",
  "status": "success",
  "content": "Daniel Jackson Daniel Jackson Associate Director, CSAIL Professor, Computer Science MacVicar Teaching Fellow Massachusetts Institute of Technology Contact info | Finding my office Accessibility at MIT My design book is out in paperback! Lots of resources about the book and concept design at the book's website, where you can sign up for my newsletter, visit the forum, study tutorials, read my blog and more. Quick Links Design book: book website, buy from independent bookstore, buy from Amazon Alloy book: MIT Press catalog entry, resources, buy from independent bookstore, buy from Amazon Alloy: website, intro and video (CACM, 2020), Scientific American Software Design Group: website, publications, projects, people, my talks Photography: photo site, resilience book, admins, immigrants, neighbors, machines, MIT Research. Current and recent projects include: concept design, a new approach to structuring software; Kodless, a tool for generating entire apps with LLMs (with Abutalib Namazov); Riffle, a local-first architecture for reactive applications, and Wildcard, a browser extension for malleable software (with Geoffrey Litt); Bluefish, a grammar for discrete diagrams (with Joshua Pollock). I coined the term lightweight formal methods and designed Alloy with my students, which continues to grow in popularity and was extended with Electrum's temporal logic operators in the latest version (see new online book by the Electrum team). Some recentish cool things: exploiting Spectre/Meltdown, memory models, peer-to-peer, storm surge protection, radiotherapy. University Activities. I am an associate director of CSAIL, and faculty director of MISTI-MEET, and was president of MIT Hillel (2012-2016). I am a member of the editorial board of the MIT Press, and the advisory board of MEET. I ran Dinner@6 for several years with Irwin Pless, chaired a task force on learning environments for MITx, and was previously the chair of graduate students in computer science. I was honored to receive the 2017 Arthur C. Smith Award and the 2018 MLK Leadership Award. With Sanjay Sarma and colleagues, I am an author of a proposal for a new kind of university. Talks. Recent keynotes and distinguished lectures: SDCon 24, ICEIS 24, ER 23, CMU S3D (Dec 2022), SEKE 22, NASA Formal Methods 22, Princeton (Mar 2020), SPLASH 18, ABZ 18, ICSE 17, FSE 16, UIUC (2016), UMass Amherst (2016), SATURN 16 (great sketchnote by MJ Broadbent), ISSTA 15. Summer schools: EROSS 20, SSFT 19. More talks with slides & videos here. Professional. I chaired a National Academies study on software dependability and certification, and was a member of another study investigating unintended acceleration. I have consulted for many companies; I worked with Protom International on the design of a new proton therapy machine, with MIT Professional Education and Accenture Solutions on security education for software architects, with Toyota on autonomous cars, and with NASA on air-traffic control. I am a member of IFIP Working Group 2.3 (Programming Methodology). I received the 2016 ACM SIGSOFT Impact Award with Mandana Vaziri (for the first paper on verifying code with SAT), and the 2017 ACM SIGSOFT Outstanding Research Award. I am an ACM Fellow. Teaching. Why competition is toxic and other postcards (signup here). An advanced (and live) intro to JavaScript. A podcast series made a while back for Accenture. Fa23, Fa22: 6.1040: Software Design Studio Fa21, Fa20, Fa19, Fa18, Fa16, Fa15, Fa14, Fa13, Sp13, Fa12, Sp12, Fa11: 6.170: Software Studio Sp14: 6.813: User Interface Design and Implementation Sp10, Fa09, Fa08, Sp08, Fa07: 6.005: Elements of Software Construction; Paper about 6.005's design Sp06: 6.826: Principles of Computer Systems Sp05: 6.894: Lightweight Formal Methods Sp01, Sp03, Sp09: 6.033: Computer Systems Engineering Fa01, Fa02, Fa04, Fa05, Fa06: 6.170: Lab in Software Engineering; Lecture Notes Sp02: 6.898: Advanced Topics in Software Design Fa97, Fa99: 6.001: Structure and Interpretation of Computer Programs Photography. Site here. My project Portraits of Resilience, a series of images and stories about depression and related challenges, has its own website and was published as a book by MIT Press. I made a book of portraits of the administrative assistants of CSAIL, which was printed by Edition One but can also be bought from Blurb. Recent portfolios include images of the Stata Center, the building I work in, and Dark Machines, a series of images of laboratory machines commissioned (and now acquired) by the MIT Museum. Blog here. Series of immigrant professors here and neighbors in lockdown here (featured in the Boston Globe). Personal. My father Michael Jackson is a software engineering researcher whose ideas have influenced my work greatly. My mother is a cookery writer and novelist. My brother David is the founder of Seeking Alpha; Tim is an entrepreneur and writer; and Adam is a classicist turned business strategist. My wife Claudia received her rabbinical ordination from Yeshivat Maharat. I started Todah VeZimrah with Joshua Jacobson.",
  "content_length": 5075,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:17"
}