{
  "name": "Daniele Mazzei",
  "homepage": "http://www.centropiaggio.unipi.it/~mazzei",
  "status": "success",
  "content": "Daniele Mazzei | Centro di Ricerca Enrico Piaggio Daniele Mazzei You are hereHome Primary tabsView(active tab) Publications Daniele MazzeiMy name is Daniele, I am a postdoc researcher at Interdepartmental Research Center “E.Piaggio”, University of Pisa. I am the coordinator of the FACETeam headed by Prof. Danilo De rossi. My actual research is focused on the development of a social robot control system to be used as platform for humna robot empathic interaction studies. the system has been also tested in his preliminary version as tool for social and emotional therpay of autistic childrens. Presently, I am also involved in a European project focused on developing of embedded wearable and unobtrusive systems to monitoring physiological parameter and infers people affective state through multivariate signal processing. I am the coordinator of a long standing collaboration between the Interdepartmental Research Center “E.Piaggio” and the Computer Science Department, both of University of Pisa, oriented to the development of a social robot control platform. I am also a consultant in System integration, embedded hardware and micro controller based system. In October 2006 I received the Master Degree in Biomedical Engineering at the University of Pisa and in May 2010 I graduated PhD in Automatic Robotic and Bioengineering at University of Pisa. My PhD research has been focused on developing bioreactor system for tissue engineering and high-throughput screenings. I also also attended the 8th ESA Student Parabolic Flight Campaign held in Bordeaux in July 2005 and the results of this work were published on “Verification of Fitts law in microgravity and hypergravity environments”. I am coinventor of 7 patents. During summer 2011 I have been invited as visitor researcher at Carnegie Mellon University CYLAB from prof. Yang Cai. I am collaborating with David Hanson of Hanson Robotics (Plano, TX, USA) for the development of cross cultural platform for robotic based autism therapy and i am leading the collaboration between Hanson Robotics and the Research Center “E.Piaggio”. Visit my personal webpage for more information www.danielemazzei.it Latest News & Press Robotics Jam Session 2025 Uno studio dell’Università di Pisa fornisce per la prima volta una caratterizzazione ampia del funzionamento dell’asse cuore-cervello. Cuore e cervello: una connessione più profonda di quanto immaginiamo Ricercatori Uni Pisa risolvono il mistero della connessione cuore-cervello Il mistero della connessione cuore-cervello Macchine Intelligenti: Robotica e AI a Pontedera e dintorni! Lavori green, Manolo Garabini: “Sui monti e in laguna ci mando il robot” Antonio Bicchi ospite del podcast \"Le Grandi Famiglie Italiane\" Ricostruire il colon danneggiato con la biostampa 4D Giornata delle donne nelle stem: la neuroscienziata Sonia Cerchio Tag CloudAutomation Bioengineering Biofabrication Human Machine Robotics Visual Servoing",
  "content_length": 2939,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:52"
}