{
  "name": "Daniel A. Reed",
  "homepage": "https://www.hpcdan.org",
  "status": "success",
  "content": "Reed's Ruminations - Reed's Ruminations: The Past, Present, and Future Reed’s Ruminations Most Recent Posts A Canticle for ReasonNovember 16, 2025N.B. This is an old article, written a decade ago, but shared only informally with a few. In today’s uncertain world, it seems appropriate to share it more widely. The news spread through the community as most things do – a whisper here, a brief allusion there. Everyone seemed to know, but nobody dared talk… Read more: A Canticle for Reason RENCI and the Digital Antique ShopOctober 27, 2025In 2004, I moved to North Carolina to found the Renaissance Computing Institute (RENCI). My goal was to bring a new approach to computationally mediated problem solving, one rooted in multidisciplinary teams and focused on important and vexing societal problems – health, environment, society, and economics. In a phrase, to be a catalyst for innovation.… Read more: RENCI and the Digital Antique Shop A 21st Century Student Experience, Looking BackOctober 15, 2025N.B. Back in 1999, when I was a computer science professor and department head at the University of Illinois at Urbana-Champaign (UIUC), I considered all that I knew about technology and research trends in computing, wireless communications, networking, modeling and simulation, and I asked myself, “What could life be like for my typical student in… Read more: A 21st Century Student Experience, Looking Back Courtside at the Digital RevolutionOctober 7, 2025During the past fifty years, I have been privileged to see the digital revolution courtside, as well as play the game myself.  It’s a journey from physical media – punched cards, paper tape, and typewritten documents – to digital media, high-speed computing (megaflops, gigaflops, teraflops, and petaflops), high-speed broadband, powerful consumer devices, and globe-spanning AI… Read more: Courtside at the Digital Revolution HPCDan Ports Reed’s RuminationsSeptember 26, 2025 N.B. As I began this piece, I realized I was also deep in thought about being a witness and participant in the larger digital revolution. This post covers the mechanics and the pain of the blog migration. My next post will cover the memories of the digital revolution and my […] Categories Select Category Arkansas Stories  (16) Artificial Intelligence  (1) Books, Reading, and Writing  (8) Cloud Computing  (48) Current Affairs  (134) Data Centers  (22) Education  (71) Education Policy  (22) Extreme Computing  (52) Film  (2) Food and Drink  (7) Games  (2) Global Competitivensss  (68) High-Performance Computing  (79) Information Technology  (105) Innovation  (146) Innovation Strategy  (5) Internet Governance  (2) Microsoft  (31) Multicore Architecture  (23) Music  (1) News and Events  (48) Personal  (71) Popular culture  (72) Random Musings  (59) Science  (47) Science Policy  (101) Software  (36) Sports  (1) Technology  (104) Technology Policy  (57) Television  (9) Travel  (4) Web/Tech  (28) Weblogs  (3) Older Posts Archives Select Year 2025  (9) 2024  (2) 2023  (7) 2022  (13) 2021  (4) 2020  (3) 2019  (10) 2018  (8) 2017  (15) 2016  (11) 2015  (9) 2014  (10) 2013  (8) 2012  (18) 2011  (32) 2010  (30) 2009  (44) 2008  (32) 2007  (34) Read All Posts I would rather have questions that can’t be answered than answers that can’t be questioned. — Richard Feynman Writing is perhaps the greatest of human inventions, binding together people who never knew each other, citizens of distant epochs. Books break the shackles of time. A book is proof that humans are capable of working magic. — Carl Sagan I am often asked, ‘What made you become a scientist?’ But I can’t stand far enough away from myself to give a really satisfactory answer, for I cannot distinctly remember a time when I did not think that a scientist was the most exciting possible thing to be.” — Peter Medawar Loading Comments... Write a Comment... Email (Required) Name (Required) Website",
  "content_length": 3909,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:54"
}