{
  "name": "Daniel Xiapu Luo",
  "homepage": "https://www4.comp.polyu.edu.hk/~csxluo",
  "status": "success",
  "content": "Daniel Xiapu Luo's homepage Dr. Daniel Xiapu Luo (羅夏樸) Professor Department of Computing, The Hong Kong Polytechnic University csxluo[at]comp.polyu.edu.hk, (852)2766-7264 Daniel received his B.S. in Communication Engineering and M.S. in Communications and Information Systems from Wuhan University. He obtained his Ph.D. degree in Computer Science from the Hong Kong Polytechnic University, under the supervision of Prof. Rocky K.C. Chang. After that, Daniel spent two years at the Georgia Institute of Technology as a post-doctoral research fellow advised by Prof. Wenke Lee. His current research interests include Mobile/IoT/System Security and Privacy, Blockchain/Smart Contract, Software Engineering, Network Security and Privacy, and Internet Measurement. He currently serves as an associate editor for IEEE/ACM Transactions on Networking (ToN), IEEE Transactions on Dependable and Secure Computing (TDSC), and ACM Transactions on Privacy and Security (TOPS). Looking for highly motivated Postdoctoral fellow and PhD/MPhil students in the areas of Mobile/IoT/System Security, Blockchain/Smart Contract, Software Engineering, Network Security and Privacy, Internet Measurement, and Performance Evaluation. Please contact me if you have interests. Teaching: 1. Discrete Structures (COMP202) 2. Computer Networking (COMP2322) 3. Computer Communications Networks (COMP312) 4. Social and Collaborative Computing (COMP3121) 5. Mobile Security: Principles and Practice (COMP4332) 6. Principles and Practice of Internet Security (COMP4334) 7. Emerging Topics In Fintech (COMP4531) 8. Capstone Project I (COMP4911) 9. E-Commerce Fundamentals and Development (COMP5122) 10. Internet Computing and Applications (COMP5322) 11. Distributed Computing (COMP5325) 12. Web Service and Project Development (COMP5332) 13. Internet Security: Principles and Practice (COMP5353) 14. Cyber and Internet Security(COMP5355) 15. Blockchain and Smart Contract Security (COMP5566) 16. Cryptography and Blockchain(COMP6521) Current Research: 1. Android Security, Vulnerability, and Privacy (1) Dynamic Analysis: •NCScope: Hardware-Assisted Analyzer for Native Code in Android Apps. (Paper, Source Code) •Malton: An On-Device Non-Invasive Mobile Malware Analysis Tool for ART.(Paper) •NDroid: A Dynamic Taint Analysis Engine for Android Applications using Native Codes.(Paper, Source Code) (2) Unpacking Hardened Apps Running in DVM or ART: •Happer: A Hardware-Assisted Unpacker.(Paper, Source Code). •Parema: An Unpacking Framework for Demystifying VM-based Android Packers.(Paper, Source Code). •PackerGrind: An Adaptive Unpacker.(Paper). •DexHunter: An In-VM Unpacker.(Paper, Source Code) (3) Privacy Policy Analysis: •PPChecker: A System for Identifying Incomplete/Incorrect/Inconsistent Privacy Policy for Android Applications.(Paper) •AutoPPG: A System for Automatically Generating Privacy Policy Template for Android Applications.(Paper) •An Empirical Evaluation of GDPR Compliance Violations in Android mHealth Apps.(Paper) (4) User Review Analysis: •Where2Change: Change Request Localization for App Reviews.(Paper) •ReviewSolver: A System for Locating Function Errors in Mobile Apps with User Reviews.(Paper) •PADetective: A System for Characterizing Promotional Attacks in Mobile App Stores.(Paper) (5) Potentially Harmful Apps (PHAs) Analysis: •HRAT: Structural Attack against Graph Based Android Malware Detection.(Paper, Source Code) •DiehardDetector: Detecting Diehard Android Apps. (Paper, Source Code) •FalDroid: A Quick Android Malware Familial Classifier.(Paper, Source Code) •ResDroid: A Scalable Resource-driven System for Detecting Repackaged Android Applications.(Paper) •Robust Android Malware Detection Against Adversarial Example Attacks.(Paper) •Demystifying Illegal Mobile Gambling Apps.(Paper) •A Systematical Study on Application Performance Management Libraries for Apps.(Paper) (6) Vulnerability Discovery: •Uncovering the Unprotected Components of Android Against Overlay Attack. (Paper, Source Code) •IAceFinder: Detecting Cross-Context Inconsistent AccessControl Enforcement in Android. (Paper, Source Code) •ATVHunter: Reliable Version Detection of Third-Party Libraries for Vulnerability Identification in Android Apps.(Paper) •All Your App Links are Belong to Us: Understanding the Threats of Instant Apps based Attacks. (Paper) •Resource Race Attacks on Android. (Paper) •VulHunter: A Graph-based Static-Analysis System for Discovering Vulnerable Android Applications.(Paper) •Some old vulnerability reports. (7) Protection: •XDebloat: Towards Automated Feature-Oriented App Debloating. (Paper, Source Code) •PSGen: A tool for Analyzing Permission Specification of Android NDK. (Paper, Source Code) •Poise: Programmable In-Network Security for Context-aware BYOD Policies. (Paper, Source Code) •UIObfuscator: A Tool for Obfuscating the UI of Android Apps. (Paper, Source Code) •RootGuard: A System for Protecting Rooted Android Smartphones.(Paper, Demo) (8) App Traffic: •FOAP: Fine-Grained Open-World Android App Fingerprinting. (Paper) •PACKETPRINT: Packet-Level Open-World App Fingerprinting on Wireless Traffic. (Paper) 2. Blockchain (1) Smart Contracts Analysis: ⛓ Ethereum Virtual Machine and its Variants •EVScope: Identifying Evasion Strategies against Front-Running Bots.(Paper, Source Code) •Mau: GPU-based Fuzzer for Smart Contracts.(Paper) •Unraveling the State-of-the-Art Smart Contract Fuzzers.(Paper, Source Code) •Uncovering NFT Domain-Specific Defects on Smart Contract Bytecode.(Paper) •Understanding Security Issues in the DAO Governance Process.(Paper) •SigRec: A System for Recovering Function Signatures (ABIs) in Smart Contracts.(Paper) •CRYPTO-SCOUT: Automatically and Accurately Identifying Token Transfers with Applications in Detecting Malicious and Vulnerable Token Contracts.(Paper) •TokenScope: A System for Detecting Inconsistent Behaviors of Cryptocurrency Tokens.(Paper) •TokenAware: A System for Recognizing Bookkeeping in Token Smart Contracts.(Paper, Source Code) •DeepInfer: A Deep-Learning Based Approach for Inferencing Data Structures in Smart Contract Bytecode.(Paper) •Demystifying DeFi MEV Activities in Flashbots Bundle.(Paper) •Gasper: A System for Detecting Gas-Inefficient Patterns in Smart Contracts.(Paper) •GasReducer: A System for Correcting Gas-Inefficient Patterns in Smart Contracts.(Paper) •GasChecker: Scalable Analysis for Discovering Gas-Inefficient Smart Contracts.(Paper) •A Large-Scale Empirical Study on Control Flow Identification of Smart Contracts.(Paper) •Defining and Detecting Smart Contract Defects on Ethereum.(Paper1, Paper2, Source Code) •A Large-Scale Empirical Study of Inline Assembly in Ethereum Smart Contracts.(Paper) •SADPonzi: A System for Detecting Ponzi Schemes in Ethereum Smart Contracts.(Paper, Source Code) •Park: Accelerating Smart Contract Vulnerability Detection via Parallel-fork Symbolic Execution.(Paper, Source Code) ⛓ Other Popular Runtimes (e.g., WebAssembly Runtime, Circom, Move, Algorand Virtual Machine, Script) •ConsCS: Effective and Efficient Verification of Circom Circuits.(Paper, Source Code) •WasmHint: Recasting Type Hints from WebAssembly Contracts.(Paper, Source Code) •MoveScan: A System for Discovering Vulnerabilities in the Bytecode of Move Smart Contracts.(Paper) •Panda: A System for Revealing Vulnerabilities in the Bytecode of Algorand Smart Contracts.(Paper) •WASAI: A Fuzzer for Uncovering Vulnerabilities in WASM Smart Contracts on EOSIO.(Paper, Source Code) •EOSAFE: A System for Detecting Vulnerabilities in WASM Smart Contracts on EOSIO.(Paper) •BSHUNTER: Detecting and Tracing Defects of Bitcoin Scripts.(Paper) (2) Transactions Analysis: •Demystifying DeFi MEV Activities in Flashbots Bundle.(Paper) •Understanding Ethereum via Graph Analysis.(Paper, Data & Source Code) •DataEther: Data Exploration Framework For Ethereum.(Paper) •Understanding (Mis)Behavior on the EOSIO Blockchain.(Paper) •Demystifying Bitcoin Mixing Services.(Paper) •Tracking Counterfeit Cryptocurrency.(Paper) •Detecting and Characterizing Scam Tokens on Uniswap Decentralized Exchange.(Paper) (3) Security and Performance Assessment: •FreeVer: Detecting Completeness and Soundness Vulnerabilities Related to Free Inputs in Polygon zkEVM.(Paper) •DoubleUp Roll: Double-spending Vulnerabilities in Arbitrum and Optimism.(Paper) •Denial of Sequencing Attacks in Ethereum Layer 2 Rollups.(Paper) •Auspex: Unveiling Inconsistency Bugs of Transaction Fee Mechanism in Blockchain.(Paper) •LWDIFF: An LLM-Assisted Differential Testing Framework for WebAssembly Runtimes.(Paper, Source Code) •fAmulet: Finding Finalization Failure Bugs in Polygon zkRollup.(Paper) •DoSVER&DoSDET: Towards Automatic Discovery of Denial of Service Weaknesses in Blockchain Resource Models.(Paper) •ThreadNeck: Double-spending in Arbitrum by Rolling It Back.(Paper) •NURGLE: Exacerbating Resource Consumption in Blockchain State Storage via MPT Manipulation.(Paper) •Abusing the Ethereum Smart Contract Verification Services for Fun and Profit.(Paper) •WADIFF: A Differential Testing Framework for WebAssembly Runtimes.(Paper) •SODA: A Generic Online Detection Framework for Smart Contracts.(Paper) •Defend Against Under-Priced DoS Attacks for Ethereum.(Paper) •Denial of Ethereum RPC Service Attack.(Paper) •EthHoney: A Honeypot for Understanding the Cryptocurrency Stealing Attack on Ethereum.(Paper) •A Detailed and Real-time Performance Monitoring Framework for Blockchain Systems.(Paper) 3. IoT/Vehicle Security •LLMIF: LLM-assisted Fuzzer for IoT devices. (Paper) •Revisiting Automotive Attack Surfaces: a Practitioners' Perspective. (Paper) •DP-Reverser: A System for Automatically Reverse Engineering Vehicle Diagnostic Protocols.(Paper) •SAID: State-aware Defense Against Injection Attacks on In-vehicle Network.(Paper) •EXAMINER: Automatically Locating Inconsistent Instructions between Real Devices and CPU Emulators for ARM.(Paper, Source Code) •ECMO: Peripheral Transplantation to Rehost Embedded Linux K",
  "content_length": 89419,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:39"
}