{
  "name": "Daniele Loiacono",
  "homepage": "http://home.deib.polimi.it/loiacono",
  "status": "success",
  "content": "Daniele Loiacono's Home Page Daniele Loiacono Associate Professor DEIB, Building 20, First Floor, Office 036 Phone: +39 02 2399 3615 Email: daniele_DOT_loiacono_AT_polimi_DOT_it Short Bio & CV I was born in Lecco, Italy, in 1980. I graduated cum laude in 2004 in Computer Engineering, and I received a Ph.D. in Computer Engineering in 2008 from Politecnico di Milano. I am currently an Associate Professor at the Department of Electronics, Information and Bioengineering at Politecnico di Milano. I am a member of the Artificial Intelligence and Robotics Laboratory (AIRLAB), and I teach the Data Mining and Machine Learning courses in the Master’s programs in Mathematical Engineering and Computer Engineering at Politecnico di Milano. I have published more than 100 scientific papers in international conferences and journals in the fields of Artificial Intelligence, Machine Learning, and Data Mining. I have served on the organizing committee of several international conferences, including GECCO, CIG, and CoG. My research interests include the application of Data Mining, Machine Learning, and Deep Learning techniques in the medical field, the use of evolutionary algorithms and generative AI for creative content generation, and the application of Artificial Intelligence in the construction domain to support and automate decision-making and design processes. Download my complete curriculm vitae here Research Interests You can find a complete list of my publications on my Google Scholar profile. Generative AI and Machine Learning for Game Design My research explores how AI can enhance creativity and interactivity in game design. I am particularly interested in leveraging evolutionary computation for procedural content generation, such as racetrack and level design, and using GANs for aesthetic enhancements. I also investigate how intelligent agents—developed through neuroevolution, reinforcement learning, and imitation learning—can create more dynamic and adaptive gameplay experiences. Recently, I have become intrigued by the role of large language models (LLMs) as co-creators, aiming to empower game designers through AI-assisted ideation and narrative development. Deep Learning applied to Radiotherapy I am focused on developing deep learning methods that improve precision, efficiency, and privacy in radiotherapy workflows. My interests include automated segmentation for complex treatment targets and organs-at-risk (OARs), synthetic CT generation from MRI data, and dose distribution prediction. I am also investigating federated learning techniques to facilitate collaborative model development across institutions while preserving patient data privacy, thereby enabling safer and more effective treatments. AI in Construction My research in construction technology centers on the use of AI for early-stage design optimization. I explore how multi-objective genetic algorithms can support architects and engineers in generating diverse, sustainable, and cost-effective structural solutions. This line of inquiry aims to facilitate more data-informed decision-making processes during the conceptual design phase, balancing economic and environmental priorities. Virtual and Mixed Reality I investigate the potential of virtual and mixed reality to transform education, particularly in STEM disciplines. My research focuses on designing immersive learning environments that help users grasp complex spatial and procedural concepts. I conduct empirical evaluations of different VR and MR technologies to understand their pedagogical effectiveness, user engagement, and usability, with the goal of enhancing the educational value of immersive media. Teaching and Thesis Proposals I am currently teaching the following courses at Politecnico di Milano: Data Mining Machine Learning Machine Learning and Artificial Intelligence (MEDTEC program) Interpretability and Explainability in Machine Learning (PhD program) You can find my teaching materials and all the information about the courses I teach on WeBeep.",
  "content_length": 4036,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:52"
}