{
  "name": "Daniel A. Spielman",
  "homepage": "http://www.cs.yale.edu/homes/spielman",
  "status": "success",
  "content": "Daniel A. Spielman Daniel A. Spielman I am a Sterling Professor of Computer Science and a Professor Statistics and Data Science and of Mathematics at Yale University. I am the inagural James A. Attwood Director of the Institute for the Foundations of Data Science (FDS) and a member of TILOS, the NSF Institute for Learning-Enabled Optimization at Scale. I was a co-Director of the Yale Institute for Network Science (YINS), a Simons Investigator and a MacArthur Fellow. I am a member of the ACM, AMS, IEEE, SIAM, the National Academy of Sciences, American Academy of Arts and Sciences, and the CT Academy of Science and Engineering. My papers, sorted by Year or sorted by Subject . A draft of my book, Spectral and Algebraic Graph Theory My CV, a short bio, and photographs of me. Descriptions of my research Slides from and videos of my talks My courses Software by my group My students Professional activities (a few things I've organized) Laplacian linear equations, sparsification local graph clustering, low-stretch spanning trees, and so on. Internships and opportunities to work with me. Contact information Descriptions of my research The following are some articles and citations that describe important parts of my research. The Computer Scientist Who Parlays Failures Into Breakthroughs, by Mordechai Rorvig, in June 2022 issue of Quanta Magazine. Infinite complexity, by Richard Panek, from May/June 2022 issue of Yale Alumni Magazine. 'Outsiders' Crack 50-Year-Old Math Problem, an article by Erica Klerreich from Quanta Magazine about the solution of the Kadison-Singer Problem. Network Solutions, an article by Erica Klarreich for the Simons Foundation about work in which my community is involved. Gil Kalai's laudation for my Nevanlinnna Prize. An article about by research by Michel Goemans and Jonathan Kelner. An article for SIAM News by Dana Mackenzie about my research on the Kadison-Singer Problem. The citation for the 2008 Godel Prize. The citation for the 2015 Godel Prize. The article \"Smoothed Move\" by Barry Cipra in What's Happening in the Mathematical Sciences, Volume 6, an article about Smoothed Analysis. The article \"The Kadison-Singer Problem: A Fine Balance\" by Dana Mackenzie in What's Happening in the Mathematical Sciences, Volume 10. Slides from and videos of some talks Spectral Graph Theory and its Applications, a tutorial I gave at FOCS 2007. My talk from ICM 2010: slides, video, paper, opening ceremony. The Blyth Memorial Lectures at Toronto on Laplacian Matrices of Graphs: Applications (9/28/11), Computations (9/29/11), and Approximations (9/30/11). Spectral and Electrical Graph Theory (given at the Caesarea Rothschild Institute, Haifa, May 17, 2011. Spectral Sparsification of Graphs (as given at the Weizmann Institute on May 15, 2011). A video of me giving a related talk at MSR NE FOCS 2010 EPFL Sparsification Talk, from the June 2012 Algorithmic Frontiers Workshop. The Erdos Lectures at Hebrew University (2014). 1. Kadison-Singer, 2. Sparsification of Graphs and Matrices, 3. Ramanujan Graphs of Every Degree. Slides from my Hamilton Day Lecture, in Powerpoint (recommended) or PDF. Slides from the 2016 Josiah Willard Gibbs Lecture at the Joint Mathematics Meeting, in Powerpoint (recommended) or PDF. Slides from my plenary talk at ICML 2016 in Powerpoint (recommended) or PDF. Slides from my plenary talk at ISIT 2016 in Powerpoint (recommended) or PDF. The video from my AMS/MAA invited address at the 2019 Joint Mathematics Meetings. The video of my 1W-MINDS talk on Balancing Covariates in Randomized Experiments. The video of my lecture \"Discrepancy Theory and Randomized Controlled Trials\" given at the Harvard Math-Science Literature Lecture Series. My talk on balancing covariates from Foundations of Computational Mathematics, 2020, rescheduled for 2021. (the first hour is my talk) Lightning talk at HLF 2023 on Computer Experiments for Computer Science and Mathematics (at 26:45) My Courses Computation and Optimization (Spring 2020). Spectral Graph Theory (Spring 2025), (Fall 2019), (Fall 2018), (Fall 2015), (Fall 2012), (Fall 2009). CPSC 366: Intensive Algorithms (Spring 2022), (Spring 2018). CPSC 365: Design and Analysis of Algorithms (Spring 2017) AMTH/CPSC/STAT 262: Computational Tools for Data Science (Fall 2016) AMTH/CPSC 462/562: Graphs and Networks (Fall 2013), (Fall 2010), (Fall 2007), (Fall 2006). Spectral Graph Theory and its Applications (Fall 2004) Error-Correcting Codes Laboratory (MIT) Eigenvalues of Graphs with Applications (MIT) The Behavior of Algorithms (MIT) Advanced Complexity Theory (MIT) Applied Extremal Combinatorics (MIT) Software by my group Discrepancy Minimizer An app to partition rows of spreadsheets into groups of low discrepancy. By Deyuan Li. Laplacians.jl a Julia package for solving problems related to Laplacian matrices and for generating interesting problem instances. It contains good code for solving Laplacian linear equations, computing low-stretch spanning trees, and generating interesting graphs (the Chimera generator). GSWDesign An implementation of the Gram-Schmidt Walk Design described in the paper IJuliaTimeMachine An extention of IJulia (for Jupyter notebooks) that allows one to retrieve variables from old cells and to run cells in threads. Balancing covariates in randomized experiments using the Gram-Schmidt walk YINSlex The code used in the experiments from the paper Algorithms for Lipschitz Learning on Graphs Isotonic An interior point method for isotonic regression. Based on the paper Fast, Provable Algorithms for Isotonic Regression in all l_p-norms. Laplacians.jl contains a variant of this code. My students Adam Klivans (Ph.D. 2002), Louay Bazzi (Ph.D. 2003) Mohammad Mahdian (Ph.D. 2004), Arvind Sankar (Ph.D. 2004) Jon Kelner (Ph.D. 2006), Amit Desphande (Ph.D. 2007) Samuel Daitch, (Ph.D. 2010), Nikhil Srivastava (Ph.D. 2010) Huan Wang (Ph.D. 2013) Anup Rao (Ph.D. 2015). Rasmus Kyng (Ph.D. 2017). Chris Harshaw (Ph.D. 2021) Yitan Wang Marco Pirazzini Xifan Yu Current and former postdocs Bodo Manthey Sushant Sachdeva John Peebles Peng Zhang Tim Kunisky Professional activities (a few things I've organized) MSRI Hot Topic Workshop: Kadison-Singer, Interlacing Polynomials, and Beyond Simons Institute Workshop: Fast Algorithms via Spectral Methods Program Chair of FOCS 2009 Internships and opportunities to work with me. Except in extremely unusual situations, I do not take interns who are not Yale students. Photographs of me Photographs of me may be found at my MacArthur Foundation page, here, here, and here. Contact information Mailling Address: Kline Tower, Room 1303 Institute for Foundations of Data Science Yale University PO Box 208328 New Haven, CT 06520-8328 Courrier: 266 Whitney Ave Kline Tower Room 1303 New Haven, CT 06511 phone: (203) 436-1264 Email: daniel.spielman@yale.edu",
  "content_length": 6858,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:53"
}