{
  "name": "Daniel F. Keefe",
  "homepage": "http://www-users.cs.umn.edu/~keefe",
  "status": "success",
  "content": "Professor Daniel Keefe, University of Minnesota top of pageDaniel F. Keefe, University of Minnesota, Twin Cities, USAInteractive Visualization Lab @UMN:  ivlab.umn.eduDan Keefe is a Professor in the Department of Computer Science & Engineering and Distinguished University Teaching Professor at the University of Minnesota.  He holds a Ph.D. in Computer Science from Brown University (2007) and a Bachelors of Science in Computer Engineering summa cum laude from Tufts University (1999).  He is also an artist and designer with training at the Rhode Island School of Design and School of the Museum of Fine Arts at Tufts University.  His research group at the University of Minnesota is known as the Interactive Visualization Lab (IV/LAB).  E-mail:  dfk 'at' umn.edu ​ Office: 6-211 Keller Hall, 200 Union St. SE, Minneapolis, MN 55455Research themes and technologiesDan's current research focuses on ethical, just, and creative human-data interaction in computer-mediated extended realities (AR/MR/VR).   He is committed to research that addresses high-stakes societal needs, including human-in-the-loop data-driven medical decision making, Indigenous cultural revitalization, climate discourse, natural resource management, and  computer-mediated creative work.  His technologies and media include interactive 3D computer graphics; digital 3D drawing; multimodal sensing; spatial and non-traditional computer displays; digital fabrication with an emphasis on sustainable materials (e.g., clay 3D printing); site-specific installations; and traditional work with wood, metal, printing, paint, and inks.Research and creative practiceDan has published more than 80 computing research papers with his students and collaborators; several have won best paper or similar honors at top ACM and IEEE venues, most recently at IEEE VIS 2024.  He has also exhibited about 12 juried or invited artworks in local and international venues, including a commission from the City of Minneapolis to the MINN_LAB Design Collective (architects, landscape architects, and computer scientists) of which he is a member.  He holds 3 patents.  He received the National Science Foundation CAREER award in 2010, and his name appears on the University of Minnesota's Scholars Walk honoring the intellectual accomplishments of award-wining faculty.  His research program is supported primarily through grants from the National Science Foundation, and he has also received support from the National Institutes of Health, National Academies Keck Futures Initiative, Mayo Clinic, US Department of Agriculture Forest Service, cities of Minneapolis and Saint Paul, and corporate partners in the medical and computer industries.Transdisciplinarity and positionalityDan is a true transdisciplinary scholar and prolific collaborator across disciplines and within the local community.  It is difficult to separate his computing research from his art and design practice, his social and climate activism, and even his passion for sailing and woodworking. He is a white man of European descent taught by brave women and people of color.  He partners with Indigenous scholars and Indigenous communities and strives to live as a good relative with the Dakota lands, skies, water, and people of the present-day Twin Cities, where he lives and works.  He recognizes that he and the University of Minnesota continue to benefit from forced removal and ethnic cleansing of Indigenous peoples, land expropriation, wealth transfer and accumulation, and Indigenous erasure. These shape his support for and engagement with current and future students as well as his research and creative practice.Teaching and advisingDan's teaching has been recognized with the most prestigious awards offered by both the University of Minnesota Alumni Association and the College of Science and Engineering.  He has taught more than 10 different courses across all levels of the curriculum, including required courses like CSci-3081W: Program Design and Development, electives like CSci-4611: Interactive Computer Graphics and Games, honors seminars like HSEM-2520H: Visualization and Virtual Reality for Social Justice, graduate courses on a variety of Visualization, Computer Graphics, and Spatial Computing topics, and studios like CSci-8980: 3D Drawing in Extended Reality. So far, he has graduated eight Computer Science Ph.D. students and one Cognitive Science Ph.D. student; they have gone on to become professors (Gonzaga, Macalester, Carleton, UMN, Kunsan National University in Korea); a mindfulness instructor; a Walt Disney Imagineer; and researchers and designers at companies ranging from startups to large corporations (e.g., Google, 3M, Abbott).  He has mentored more than 50 undergraduate students in their first research experiences and advised more than 20 undergraduate and masters theses. He also serves regularly as an outside reader or committee member for PhD, MFA, and MS students at the UMN and around the world.ServiceDan has served in a variety of reviewer, editorial, and organizational roles within the international research community; highlights include co-chairing the IEEE VR Conference in 2014 (Minneapolis, MN) and 2015 (Arles, France) and co-chairing and founding the IEEE VIS Art Show in 2011 (Providence, RI) and 2012 (Seattle, WA).  He received the IEEE Service Award in 2015. He also has a track record of leadership on diversity, equity, and inclusion initiatives.  He is the faculty founder and was chair (2020-2022) of the UMN Computer Science & Engineering Department Inclusiveness, Diversity, Equity, and Advocacy committee (CS-IDEA) and has served  in the Faculty and Staff action Group for the college-wide Diversity, Equity, & Inclusion Alliance.  He created and led an inclusive design-thinking process to draft his department's first Broadening Participation in Computing Plan, which is now a public plan verified by the NSF-supported community of practice at bpcnet.org. After helping admit the most diverse Ph.D. student cohort in his department's history, he committed to retaining these students by working with colleague, Lana Yarosh, to co-redesign with student input and then co-teach the year-long CSci-8001/2: Intro to Computer Science Research course sequence, adding modules on ethics, responsible and just computing, creating a mentoring map, finding your research community, understanding funding, interacting with advisors and colleagues, and building an inclusive cohort.MembershipsDan is a senior member of the IEEE, member of the ACM, member of the UMN Academy of Distinguished Teachers, member of the UMN graduate faculty in both Computer Science & Engineering and Cognitive Science, and fellow at the UMN Institute on the Environment.LifeDan grew up in North Carolina and played baseball and basketball in high school and then baseball and rugby in college in New England.  In graduate school, he and four other grad students formed a latin rock band and performed at the Brown Graduate School's Orientation event and the Computer Science Department's holiday party (in addition to a few bars).  In Minnesota, he observes two seasons:  1. Sailing season – he loves sailing and races on White Bear Lake in the summer, and 2. Woodworking season – in winter, you can find him in his garage carving a spoon or building furniture.Visit Dan's research lab webpage at ivlab.cs.umn.edu. bottom of page",
  "content_length": 7398,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:05"
}