{
  "name": "Daniel Rakita",
  "homepage": "https://cpsc.yale.edu/people/daniel-rakita",
  "status": "success",
  "content": "Daniel Rakita | Professor | Yale Engineering Skip to Content Daniel Rakita Assistant Professor of Computer Science Email Room / Office:AKW 503 Office Address:51 Prospect Street New Haven, CT 06511 Mailing Address:P.O. Box 208285 New Haven, CT 06520 About Daniel Rakita Degrees Ph.D., University of Wisconsin-Madison M.S., University of Wisconsin-Madison Perspectives My research involves formulating motion planning and motion optimization algorithms that generate feasible and effective robot manipulator motions in real-time. And, using these motion algorithms as core components, I develop and evaluate robot shared-control interfaces that are intuitive and easy to use, even for novice users. The goal of my work is to enable people to intuitively control or work alongside robot manipulation platforms to perform critical tasks deemed unsuitable, undesirable, understaffed, or unsafe for people, such as full-time homecare, home assistance, telenursing, robot surgery, disaster relief, large-scale manufacturing, nuclear materials handling, and space robotics. I use interdisciplinary techniques across robotics and computer science, including motion planning, motion optimization, shared autonomy, human-robot interaction, and machine learning to formulate and validate generalizable, end-to-end solutions within these problem spaces. Selected Awards & Honors 2022 UW-Madison Outstanding Graduate-Student Research Award 2021-2022 Cisco Graduate Student Fellowship Recipient 2019-2021 Microsoft PhD Fellowship Recipient Best Paper Award at ACM/IEEE Conference on Human-Robot Interaction (HRI) 2018 Best Paper Award Nominations at ACM/IEEE Conference on Human-Robot Interaction (HRI) 2020 and IEEE Symposium on Robot and Human Interactive Communication 2017 Selected Publications Proxima: An Approach for Time or Accuracy Budgeted Collision Proximity Queries. D. Rakita, B. Mutlu, M. Gleicher. Proceedings of Robotics: Science and Systems (RSS), 2022. CollisionIK: A per-instant pose optimization method for generating robot motions with environment collision avoidance. D. Rakita, B. Mutlu, M. Gleicher. Proceedings of the 2021 International Conference on Robotics and Automation (ICRA), 2021. Strobe: An acceleration Meta-algorithm for Optimizing Robot Paths using Concurrent Interleaved Sub-Epoch Pods. D. Rakita, B. Mutlu, M. Gleicher. Proceedings of the 2021 International Conference on Robotics and Automation (ICRA), 2021. Single-query path planning using sample-efficient probability informed trees. D. Rakita, B. Mutlu, M. Gleicher. IEEE Robotics and Automation Letters (RA-L), in the Proceedings of the 2021 International Conference on Robotics and Automation (ICRA), 2021. Shared control-based bimanual robot manipulation. D. Rakita, B. Mutlu, M. Gleicher, L.M. Hiatt. Science Robotics, 2019. Remote telemanipulation with adapting viewpoints in visually complex environments. D. Rakita, B. Mutlu, M. Gleicher. Proceedings of Robotics: Science and Systems (RSS), 2019. Stampede: A discrete-optimization method for solving pathwise-inverse kinematics. D. Rakita, B. Mutlu, M. Gleicher. Proceedings of the 2019 International Conference on Robotics and Automation (ICRA), 2019. RelaxedIK: Real-time Synthesis of Accurate and Feasible Robot Arm Motion. D. Rakita, B. Mutlu, M. Gleicher. Proceedings of Robotics: Science and Systems (RSS), 2018. An autonomous dynamic camera method for effective remote teleoperation. D. Rakita, B. Mutlu, Michael Gleicher. Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction (HRI), 2018. A motion retargeting method for effective mimicry-based teleoperation of robot arms. D. Rakita, B. Mutlu, Michael Gleicher. Proceedings of the 2017 ACM/IEEE International Conference on Human-Robot Interaction (HRI), 2017. Related Content A faster and more graceful robot, with the help of calculus Danny Rakita: Preparing robots for the real world",
  "content_length": 3911,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:31"
}