{
  "name": "Danish Pruthi",
  "homepage": "https://danishpruthi.com",
  "status": "success",
  "content": "Danish Pruthi | Danish Pruthi Danish Danish Pruthi Assistant Professor Computational and Data Sciences (CDS) Indian Institute of Science (IISc), Bangalore Office: CDS 401 (see directions) Google Scholar | Twitter Email (Please read this before emailing) Hey! I am Danish Pruthi, I am an assistant professor at the Indian Institute of Science (IISc), Bangalore. At IISc, I guide an NLP group, and am currently interested in: Detecting AI-generated content, and broadly, curbing unhealthy reliance on AI, Measuring and improving geo-cultural representation in AI, Evaluating large language models, with an emphasis to enable responsible use. I received my PhD from CMU, where I was co-advised by Zachary C. Lipton and Graham Neubig. My doctoral research focused on addressing issues concerning the interpretability of deep learning models. I completed my bachelors degree in computer science from BITS Pilani, Pilani in 2015. I've also spent time doing research at Google AI, Microsoft Research, Facebook AI Research, and Amazon AI. I am a recipient of the Schmidt Sciences AI2050 Early Career Fellowship, Siebel Scholarship and the CMU Presidential Fellowship. Until recently, my legal name was only Danish—an “edge case” for many deployed NLP systems, leading to airport quagmires and, in equal parts, funny anecdotes. I enjoy traveling and have lived (3+ months) in New York City, Bangalore, Pittsburgh, Mountain View, Pilani and Hisar. News & Activities [New] Our work on uncovering plagiarism in AI-generated research received the outstanding paper award at ACL 2025. Speaking at a Pre-ACL workshop in Copenhagen in July 2025. Delivering a talk at VLMs4All workshop at CVPR 2025 in Nashville. Upcoming ACL 2025 (main) papers: determining plagiarism in AI-generated research; auditing moderation policies at Twitch; and evaluating fairness in Indian contexts. Our work on watermarking content is now accepted to ICML. Dec 2024: Delivered a talk at IIT Madras and IIT Jodhpur. Nov 2024: Delivered a keynote talk at WiNLP workshop at EMNLP 2024. Honored to receive the AI2050 Early Career Fellowship. Jan 28-Feb 2: Excited to attend the Dagstuhl Seminar on Peer Review. Dec 21, 2023: Delivered a tutorial on Watermarking LLMs at IndoML 2023. Dec 6, 2023: Participated in a Fireside chat at Capital One's ML conference. Nov 25, 2023: Excited to be on a panel for Flipkart's Billion AI India event. Oct 28, 2023: Organizing a workshop on Generative AI. Oct 9-10, 2023: Attending the BiNDI Summit. Sept 1, 2023: Talk at Google Research, India. Aug 31, 2023: Speaking at Samsung at their annual networking meeting. Aug 29, 2023: Talk at Microsoft Research (MSR), Bangalore. June 14, 2023: Talk at Adobe, India. May 1, 2023: Joined the Indian Institute of Science in Bangalore. April 20, 2023: Speaking at the Stanford NLP Seminar. April 18, 2023: Talk at USC. April 17, 2023: Talk at UC Irvine. Dec 16, 2021: Successfully defended my PhD thesis. Follow up work on a crowdsourced study to evaluate explanations is accepted at AAAI. Our framework to evaluate explanations is accepted for publication at TACL. Dec 2020: Serving as a panelist for a discussion on higher education at IIT Jodhpur. Sept 2020: Talking about our work at Twitter, Inc. July 2020: A panelist on session for undergraduate student researchers at ACL 2020. May 2020: Excited to intern with Dr. William Cohen this summer at Google AI in Pittsburgh. Work on learning to deceive with attention based explanations is accepted to ACL 2020. Jan 2020: Speaking about our work at IIT Delhi and BITS Pilani. Work on adversarial spelling mistakes and their defenses is accepted at ACL 2019. Summer 2019: Interning at Facebook AI Research w/ Dr. Brenden Lake and Dr. Marco Baroni Oct 2018: Received athe PwC CMU Presidential Fellowship. Thank you, PwC! Feb 2018: Our work on Semi-Supervised QA is accepted at NAACL 2018 Jan 2018: Speaking about our work at IISc Bangalore Dec 2017: Conducting a training camp at BITS Goa to assist students for job search. Nov 2017: Our work on interpretable neural embeddings is accepted at AAAI Sep 2017: Awarded the Siebel Scholarship. Thanks Siebel Foundation! Aug 2017: Won the best poster, and best presentation (honourable mention) award at LTI Student Research Symposium (SRS) Spring 2017: TA'ed for Introduction to Machine Learning (PhD) 10-701. Aug 2016: Joined CMU for my graduate studies June 30, 2016: Completed an exciting year at MALL Lab May 19, 2016: Presented our work at ICWSM in Cologne! Feb 27, 2016: Our work on 'How to pose questions?' got accepted as a full paper for ICWSM'16",
  "content_length": 4588,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:55"
}