{
  "name": "Daniel G. Aliaga",
  "homepage": "https://www.cs.purdue.edu/homes/aliaga",
  "status": "success",
  "content": "Daniel G. Aliaga Webpage [Research] [Teaching] [Publications] [Grants] [Students] Curriculum Vitae Daniel G. Aliaga Associate Professor of Computer Science, Purdue University Education: Daniel Aliaga holds BS in Computer Science, honors thesis (with Andy van Dam) and magna cum laude, from Brown University. Subsequently, obtained a MS (with Henry Fuchs) and a PhD degree (with Anselmo Lastra, Fred Brooks, and Dinesh Manocha) in Computer Science from UNC Chapel Hill. Worked at Nokia/Lucent/AT&T Bell Labs (with Ingrid Carlbom) and at Princeton University as a researcher (with Tom Funkhouser). He joined Purdue in 2003, co-founding the Computer Graphics and Visualization Laboratory (CGVLAB). Dr. Aliaga has held visiting professor positions at ETH Zurich Information Architecture and also ETH Computer Science, INRIA Sophia-Antipolis, and KAUST in Saudi Arabia. After finishing high school (Colegio Santa Maria), Daniel immigrated from Lima, Peru and is the first in his family and relatives to hold a PhD. Products: Dr. Aliaga's first computer graphics publication was in 1991 and he now has over 170 refereed publications covering multiple disciplines, holds membership in 90+ program committees, has on-going international multi-disciplinary collaborations (i.e., with computer science, urban planning, architecture, meteorology, atmospheric/earth sciences, engineering, archaeology, forestry, and more), and has given over 50 invited talks (in the US, Brasil, Colombia, Ecuador, France, Japan, Korea, Peru, Qatar, Sweden, and Switzerland; TEDx). Further, Dr. Aliaga has been technical advisor on multiple startups (Synthicity, UrbanSim, Authentise). Funding: Prof. Aliaga has obtained 29 external peer-reviewed grants totaling over $42M (and is PI on 22 of them). Funding sources include NSF, IARPA, USDA, Internet2, MTC, Google, Microsoft, and Adobe. Service and Awards: Daniel is Associate Editor for IEEE TVCG and for Visual Computing Journal (previously for Computer Graphics Forum and Graphical Models) and PC member for SIGGRAPH, CVPR, ICCV, Eurographics, AAAI, I3D, IEEE Vis. He has received a Fulbright Scholar Award, a Discovery Park Faculty Research Fellowship, and his PhD advisees have received a total of 11 Purdue fellowships/grants. He is a member of ACM SIGGRAPH and ACM SIGGRAPH Pioneers, and has multiple times been Chair of Faculty Diversity for College of Science at Purdue. Contact: Lawson Computer Science Building, Rm 3177 305 N. University St, West Lafayette, IN 47907-2107 Phone: 765-494-6010 (main office) FAX: 765-494-0739 Email: aliaga at cs dot purdue dot edu Teaching CS535 (Spring 2026) Urban Visual Computing Dr. Aliaga pursues visual computing for modeling and improving the complex urban ecosystem. His work develops semi-automatic and automatic algorithms for controllable content creation and edition of large and complex geometric models for use in urban digital twins, simulation, visualization, entertainment, education, and cultural heritage. His methodologies generally convert incomplete and unstructured data into organized and easily editable procedural representations. While a significant benefit of procedural modeling is its detail amplification, it is very difficult to develop a compact, expressive, and editable set of procedural rules. His research group has innovated various forms of generative modeling, urban artificial intelligence, and optimization to infer procedural rules and parameter, graphs and layouts, 3D models, images, sketches, point clouds, roads, facades, buildings, cities, and vegetation. In addition, he has developed multiple novel image processing, 3D reconstruction methods, 3D spatial augmented reality, camera calibration, and computational display solutions. Further, Dr. Aliaga leads and participates in numerous computational urban projects in city gray and green planning, atmospheric/geological sciences, civil engineering, architecture, and transportation engineering to capture, simulate, and modify models of current and future urban environments. Selected Publications Building Instance Segmentation for Dense Urban Settlements.A. Firoze, R. Yeh, D. Aliaga, AAAI Conference on Artificial Intelligence, 2026 Where are the City Trees: Monitoring Urban Trees across the U.S. using Generative AI.A. Firoze, A. Uppala, R. Yeh, B. Benes, L. Darling, B. Hardiman, S. Fei, D. Aliaga, Communications of the ACM (CACM), 2026 MMIG-Bench: Towards Comprehensive and Explainable Evaluation of Multi-Modal Image Generation Models.H. Hua, Z. Zeng, Y. Song2, Y. Tang, L. He, D. Aliaga, W. Xiong, J. Luo, Neural Information Processing Systems (NeurIPS), 2025 Self-Supervised Large Scale Point Cloud Completion for Archaeological Site Restoration. A. Li, J. Zimmer-Dauphinee, R. Kalyanam, I. Lindsay, P VanValkenburgh, S. Wernker, D. Aliaga, IEEE Computer Vision and Pattern Recognition (CVPR), 2025 Kubrick: Multimodal Agent Collaborations for Synthetic Video Generation. L. He, Y. Song, H. Huang, P. Liu, Y. Tang, D. Aliaga, X. Zhou, IEEE Computer Vision and Pattern Recognition (CVPR), Workshop: AI for Content Creation, 2025 Refine-by-Align: Reference-Guided Artifacts Refinement Through Semantic Alignment. Y. Song, L. He, Z. Zhang, S. Kim, H. Zhang, W. Xiong, Z. Lin, B. Price, S. Cohen, J. Zhang, D. Aliaga, International Conference on Learning Representations (ICLR), 2025 COHO: Context-Sensitive City-Scale Hierarchical Urban Layout Generation. L. He, D. Aliaga, European Conference on Computer Vision (ECCV), 2024 EpipolarGAN: Omnidirectional Image Synthesis with Explicit Camera Control. C. May, D. Aliaga, European Conference on Computer Vision (ECCV), 2024 IMPRINT: Generative Object Compositing by Learning Identity-Preserving Representation. Y. Song, Z. Zhang, Z. Lin, S. Cohen, B. Price, J. Zhang, S. Kim, H. Zhang, D. Aliaga, IEEE Computer Vision and Pattern Recognition (CVPR), 2024 Digitizing Cities for urban weather: representing realistic cities for weather and climate simulations using computer graphics and artificial intelligence . D. Aliaga, D. Niyogi, Computational Urban Science, 2024 GLObal Building heights for Urban Studies (UT-GLOBUS) for city- and street-scale urban simulations: Development and first applications. H. Kamath, M. Singh, N. Malviya, A. Martilli, L. He, D. Aliaga, C. He, F. Chen, L. Magruder, Z.L. Yang, D. Niyogi, Nature Scientific Data, 2024 GlobalMapper: Arbitrary-Shaped Urban Layout Generation. L. He, D. Aliaga, IEEE Int'l Conference on Computer Vision (ICCV), 2023 Tree Instance Segmentation with Temporal Contour Graph. A. Firoze, C. Wingren, R. Yeh, B. Benes, D. Aliaga, IEEE Computer Vision and Pattern Recognition (CVPR), 2023 ObjectStitch: Generative Object Compositing. Y. Song, Z. Zhang, Z. Lin, S. Cohen, B. Price, J. Zhang, D. Aliaga, IEEE Computer Vision and Pattern Recognition (CVPR), 2023 Deep Learning based Urban Morphology for City-scale Environmental Modeling. P. Patel, R. Kalyanam, L. He, D. Aliaga, D. Niyogi. Proceedings of the National Academy of Sciences (PNAS) Nexus, 2023 Generative Building Feature Estimation from Satellite Images. L. He, J. Shan, D. Aliaga, IEEE Transactions on Geoscience and Remote Sensing (TGRS), 2023 CubeGAN: Omnidirectional Image Synthesis Using Generative Adversarial Networks. C. May, D. Aliaga, Computer Graphics Forum (CGF), Eurographics, 2023 Modeling Large-Scale Heatwave by Incorporating Enhanced Urban Representation. P. Patel, S. Jamshidi, R. Nadimpalli, D. Aliaga, G. Mills, F. Chen, M. Demuzere, D. Niyogi. Journal of Geophysical Research: Atmospheres, 2022 Procedural Roof Generation From a Single Satellite Image. X. Zhang, D. Aliaga. Computer Graphics Forum (CGF), Eurographics, 2022 Impact of green roofs on heavy rainfall in tropical, coastal urban area. P. Patel, S. Karmakar, S. Ghosh, D. Aliaga, D. Niyogi. Environmental Research Letters (ERL), 2021. Automatic Deep Inference of Procedural Cities from Global-Scale Spatial Data. X. Zhang, A. Shehata, B. Benes, D. Aliaga. ACM Transactions on Spatial Algorithms and Systems, 2021 Synthesis and Completion of Facades from Satellite Imagery. X. Zhang, C. May, D. Aliaga. European Conference on Computer Vision (ECCV), 2020 Design and Deployment of Photo2Building: A Cloud-based Procedural Modeling Tool as a Service. M. Bhatt, R. Kalyanam, G. Nishida, L. He, C. May, D. Niyogi, D. Aliaga, Practice and Experience in Advanced Research Computing (PEARC), 2020 Pathway using WUDAPT's Digital Synthetic City tool towards generating urban canopy parameters for multi-scale urban atmospheric modeling. J. Ching, D. Aliaga, G. Mills, V. Masson, L. See, M. Neophytou, A. Middel, A. Baklanov, C. Ren, E. Ng, J. Fung, M. Wong, Y. Huang, A. Martilli, O. Brousse, I. Stewart, X. Zhang, A. Shehata, D. Niyogi, Urban Climate, 2019 Urban Walkability Design using Virtual Population Simulation. T. Mathew, P. Knob, S. Musse, D. Aliaga, Computer Graphics Forum (CGF), 2019 Procedural Modeling of a Building from a Single Image. G. Nishida, A. Bousseau, D. Aliaga, Computer Graphics Forum (CGF), Eurographics, 2018 Procedural Generation of Flood-Sensitive Urban Layouts. A. Mustafa, X. Zhang, G. Nishida, M. Bruwier, B. Dewals, J. Teller, D. Aliaga, Environment and Planning B: Urban Analytics and City Science, 2018 Fast Weather Simulation for Inverse Procedural Design of 3D Urban Models. I. Garcia-Dorado, D. Aliaga, P. Bhalachandran, P. Schmid, D. Niyogi, ACM Transactions on Graphics (TOG), 2017 Interactive Sketching of Urban Procedural Models, G. Nishida, I. Garcia-Dorado, D. Aliaga, B. Benes, A. Bousseau. ACM Transactions on Graphics (TOG), 2016 Coupled Segmentation and Similarity Detection for Architectural Models. I. Demir, D. Aliaga, B. Benes. ACM Transactions on Graphics (TOG), 2015 Procedural Editing of Building Point Clouds. I. Demir, D. Aliaga, B. Benes, IEEE Int'l Conference on Computer Vision (ICCV), 2015 A Total Variation Approach for Customizing Imagery to Improve Visual Acuity. C. Montalto, I. Garcia-Dorado, D. Aliaga, M. Oliveira, F. Men",
  "content_length": 18526,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:06"
}