{
  "name": "Daniel John Rough",
  "homepage": "https://discovery.dundee.ac.uk/en/persons/daniel-rough",
  "status": "success",
  "content": "Daniel Rough - Discovery - the University of Dundee Research Portal View Scopus Profile Rough, Daniel Dr Lecturer (Teaching and Research), Computing https://orcid.org/0000-0003-1545-5377 20142024 Research activity per year Personal profile Research interestsI have four main research interests which tie into projects old and new:End-User Development – allowing software end-users to tailor and reprogram their applications without necessarily having any 'real programming' experienceBlocks-based programming – a branch of end-user development that allows programming through manipulating graphical blocks rather than coding. Applications such as Scratch, MIT App Inventor, and Blockly are good examples.Conversational User Interfaces - My work in the HCI lab at University College Dublin has grown my interest in CUIs and how people perceive and use speech as an input and output modality. User-Centred Design -  This ties all my interests together through aiming to develop tools and applications that are meaningful to end-users! BiographyI've recently joined the UX'd group (https://www.ux-d.co.uk/) here at the University of Dundee as a Lecturer. Before that I was a postdoctoral researcher at University College Dublin for a year and at Abertay University for a year too. I finished my PhD in Human-Computer Interaction in 2018 at the University of St Andrews, supervised by Prof. Aaron Quigley, where I also did my undergraduate degree in Computer Science. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Fingerprint Dive into the research topics where Daniel Rough is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 1 Similar Profiles User Interface Computer Science 100% End-user Development Keyphrases 94% User Development Computer Science 94% Experience Sampling Keyphrases 86% Conversational User Interface Keyphrases 81% Intelligent Assistant Keyphrases 72% Personal Assistant Computer Science 72% Gestational Diabetes Mellitus Keyphrases 54% View full fingerprint Research output Research output per year 2014 2020 2021 2022 2023 2024 20 Conference contribution 7 Article 1 Review article Research output per year Research output per year EduCUI: The First International Workshop for Conversational User Interfaces in EducationEdwards, J., De Araujo, A., Desai, S., De Wit, J., Candello, H., Rough, D. J., Clark, L., Roberts, A. S. & Cowan, B. R., 8 Jul 2024, Proceedings of the 6th Conference on ACM Conversational User Interfaces, CUI 2024. Association for Computing Machinery, 4 p. 63. (Proceedings of the 6th Conference on ACM Conversational User Interfaces, CUI 2024).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution International Workshop 100% First International 100% Conversational User Interface 100% User Interface 100% Popular 33% Engaging Woman with Gestational Diabetes Mellitus in the Design of Self-Management AppsSafee, L., Rough, D., George, P. & Mudenha, R., 1 Jul 2024, Proceedings of the 2024 ACM Designing Interactive Systems Conference, DIS 2024. Vallgarda, A., Jonsson, L., Fritsch, J., Alaoui, S. F. & Le Dantec, C. A. (eds.). Association for Computing Machinery, p. 3117-3128 12 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Group Discussion 100% Idea Generation 100% Technology Solution 100% Design Phase 100% Pregnant Woman 100% 1 Citation (Scopus) 102 Downloads (Pure) Audience design and egocentrism in reference production during human-computer dialoguePeña, P. R. (Lead / Corresponding author), Doyle, P., Edwards, J., Garaialde, D., Rough, D., Bleakley, A., Clark, L., Henriquez, A. T., Branigan, H., Gessinger, I. & Cowan, B. R., Aug 2023, In: International Journal of Human Computer Studies. 176, 14 p., 103058.Research output: Contribution to journal › Article › peer-review Open AccessFile Audience Design 100% Human-computer Communication 100% Reference Production 100% Egocentrism 100% Language Production 100% 11 Citations (Scopus) 196 Downloads (Pure) Baseline Perceptions of Women With Gestational Diabetes Mellitus and Health Care Professionals About Digital Gestational Diabetes Mellitus Self-Management Health Care Technologies: Interview Study Among Patients and Health Care ProfessionalsSafiee, L., Rough, D. (Lead / Corresponding author), George, P. & Mudenha, R., 19 Dec 2023, In: JMIR Human Factors. 10, 1, 16 p., e51691.Research output: Contribution to journal › Article › peer-review Open AccessFile Healthcare Professionals 100% Healthcare Management 100% Health Technology 100% Self-management 100% Patient Care 100% 8 Citations (Scopus) 150 Downloads (Pure) Commonshare: a new approach to social reputation for online collaborative communitiesRough, D. (Lead / Corresponding author), De Paoli, S. & Wilson, A., Feb 2023, In: Social Science Computer Review. 41, 1, p. 4-26 23 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Collaborative Community 100% Online Collaboration 100% Social Reputation 100% Reputation System 100% Community Member 50% 8 Citations (Scopus) 150 Downloads (Pure) View all 28 research outputs Activities Activities per year 2022 2022 2023 2024 2024 18 Publication peer-review 4 Participation in conference 2 Schools engagement 1 Examination 3 More 1 Other membership 1 Funding - grants and income which support research related activities 1 Keynote Activities per year 6th Conference on ACM Conversational User Interfaces, CUI 2024 (Event)Rough, D. (Peer reviewer)Mar 2024Activity: Publication peer-review and editorial work types › Publication peer-review Recruitment and Promotion of the Unversity of Dundee in IndiaRough, D. (Presenter)Sept 2024Activity: Other activity types › Schools engagement International Journal of Human-Computer Interaction (Journal)Rough, D. (Peer reviewer)Jan 2024Activity: Publication peer-review and editorial work types › Publication peer-review Proceedings of the 13th Nordic Conference on Human-Computer Interaction (Event)Rough, D. (Peer reviewer)May 2024Activity: Publication peer-review and editorial work types › Publication peer-review 2024 ACM Designing Interactive Systems Conference (Event)Rough, D. (Peer reviewer)Mar 2024Activity: Publication peer-review and editorial work types › Publication peer-review View all 28 activity",
  "content_length": 6568,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:16"
}