{
  "name": "Daniel Lee Ashbrook",
  "homepage": "http://danielashbrook.com",
  "status": "success",
  "content": "Daniel Ashbrook: Home Daniel Ashbrook Associate Professor HCC Section Department of Computer Science University of Copenhagen Copenhagen, Denmark Contact dan@di.ku.dk @anjirokhan Calendar Please note: like most professors, I’m overwhelmed by email. Please read this page before attempting to contact me. Office University of Copenhagen Department of Computer Science Sigurdsgade 41, Office 0.08 2200 Copenhagen N Denmark About me I am an Associate Professor in the Human-Centered Computing section of the Department of Computer Science at the University of Copenhagen in Copenhagen, Denmark. I graduated in 2009 with my Ph.D. in Computer Science from the School of Interactive Computing at Georgia Tech. Subsequently, I worked for Nokia Research and Samsung Research before returning to academia in 2014. From 2014–2018 I was an Assistant Professor in the Department of Information Sciences and Technologies and the Department of Computer Science of the Golisano College of Computing and Information Sciences at the Rochester Institute of Technology (RIT) in Rochester, New York, USA. You can download my CV here. Research My research is in the area of human-computer interaction, where I concentrate on new interaction techniques, devices, and applications. Historically I have concentrated on wearable and mobile computing, with the goal of allowing people to be less focused on their technology and more engaged with the world, while still reaping the creativity and productivity benefits of their devices. My current research continues this thread while adding a second focus on helping non-experts more easily understand and use personal fabrication technology such as 3D printers, laser cutters, and CNC routers. My research has been supported by HP, Nokia, and the United States National Science Foundation. RIT Here is some information about what I did while I was at the Rochester Institute of Technology from 2014–2018. FETLab At RIT, I founded and directed the Future Everyday Technology Research Lab (FETLab); more about the work my students and I did together can be found at fetlab.io. Here is a photo of the FETLab members at the end of the 2016 academic year: Teaching I taught two classes at RIT: HCIN-720 in Fall semesters, and HCIN-722 in Spring semesters. HCIN-720: Prototyping Wearable and Internet of Things Devices Software is no longer the only domain that practitioners of Human-Computer Interaction (HCI) find themselves involved in. There is a âhardware renaissanceâ underway in Silicon Valley, and as a result the computing industry is in need of user experience designers, interaction designers, and HCI specialists who understand how to work with people and hardware as well as with software. The goal of this course is to teach students how to rapidly prototype and evaluate systems that combine hardware and software. Fall 2017 course page Fall 2016 course page Fall 2015 course page HCIN-722: HCI with Mobile, Wearable, and Ubiquitous Devices Modern computing devices include more than just mobile phones, with wearable and ubiquitous (for example, Internet of Things) devices rapidly emerging as additional platforms. These new devices offer unique interaction capabilities and challenges. Students will learn to think about and design effective interactions for mobile, wearable, and ubiquitous computing devices. Students will also gain a background in research in these areas. The main goal of the course is to enable students to work with HCI for these types of devices. HCIN-722 is a seminar-style course with projects: students read research papers and discuss them in class; teach a class themselves on a technical or theoretical topic; and engage in a semester-long group project around a new wearable or mobile device. Spring 2018 course page Spring 2017 course page Spring 2016 course page Spring 2015 (no public site) Publications You can see statistics on my Google Scholar profile page. Prospective Students I am often looking for undergraduate and graduate students interested in improving human interaction with personal fabrication. Are you a student interested in working with me? If so, please read this first. Potential Projects Once you’ve read the above, you can look at this page of potential project ideas that I would like to have students work on. Travel I travel frequently. When I’m traveling, I may be more difficult than usual to reach via email. Please see my calendar for hints.",
  "content_length": 4447,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:19"
}