{
  "name": "Daniel Aloise",
  "homepage": "https://professeurs.polymtl.ca/daniel.aloise",
  "status": "success",
  "content": "Prof. Daniel Aloise Daniel Aloise About Me Research Publications Teaching Gallery Contact & Meet Me Daniel Aloise Département de génie informatique et génie logiciel Polytechnique Montréal Bio I am a full professor at the Computer and Software Engineering Department at Polytechnique Montréal since 2016. I did my Ph.D. advised by Pierre Hansen on exact methods for the minimum sum-of-squares problem (aka k-means clustering). I have also been a professor at the Universidade Federal do Rio Grande do Norte, Brazil, since 2009. My research interests include data mining, machine learning, optimization, mathematical programming and how these disciplines interact to tackle problems in our Big Data era. I have published in leading operations research and data mining journals including Machine Learning, Data Mining and Knowledge Discovery, European Journal of Operational Research, Mathematical Programming and Journal of Global Optimization. Academic Positions Present 2016 Full Professor Polytechnique Montréal, Canada Present 2009 Assistant Professor Universidade Federal do Rio Grande do Norte, Brazil Education & Training Ph.D. 2009 Ph.D. in Applied Mathematics Polytechnique de Montréal, Canada M.Sc. 2005 M.Sc. in Computer Science Pontifical Catholic University of Rio de Janeiro, Brazil B.Eng. 2005 B.Eng. in Computer Engineering Universidade Federal do Rio Grande do Norte, Brazil Affiliations Since 2016 Canada Excellence Research Chair in Data Science For Real-Time Decision-Making The Canada Excellence Research Chair in Data Science for Real-Time Decision-Making aims at developing new tools and methodologies that will allow enormous volumes of data from multiple sources to be processed and analyzed in real time — in order to obtain usable knowledge and to automate decision-making. By combining processes for analyzing highly targeted data and real-time decision-making, their mathematical model-based tools will help organizations improve performance, by creating highly customized outputs and taking into account the environments, needs and individual behaviors of their clients or users. The applications that result will foster new business models that are based on accurate depictions of user behaviors and expectations, combined with competitors’ responses. The many sectors that could benefit include transportation management, energy, health care and manufacturing, as well as supply chain management and logistics. Since 2005 Group For Research In Decision Analysis GERAD is a multi university research center founded in 1979. It involves some seventy experts from a mix of disciplines: quantitative methods for management, operations researchers, computer scientists, mathematicians and mathematical engineers, from HEC Montréal, Polytechnique Montréal, McGill University and Université du Québec à Montréal.",
  "content_length": 2853,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:53"
}