{
  "name": "Daniel Mueller 0001",
  "homepage": "https://informatics.tuwien.ac.at/people/daniel-mueller-gritschneder",
  "status": "success",
  "content": "Daniel Müller-Gritschneder — TU Wien Informatics People Overview Professors Scientific Staff Administrative Staff Student Staff External Lecturers By Responsibilities By Committee By Name Related Guest Professors Honoraries Alumni (LinkedIn) #5qw Daniel Müller-Gritschneder Univ.Prof. Dr.-Ing. Dipl.-Ing. Research Focus Computer Engineering: 100% Research Areas Computer Engineering, Embedded Systems, Embedded System Design, Computer Architecture, RISC-V, computer security, Edge AI About I am full professor of Computer Architecture at the Institute of Computer Engineering, TU Wien Informatics, Austria, since 2024. Previously, I was a research group leader at the Chair of Electronic Design Automation and acting professor for Real-time Systems at TU Munich, Germany. I received my Dipl.-Ing., Dr.-Ing. and Habilitation degree from TUM in 2003, 2009 and 2019 respectively.I like working in collaborative research projects in close cooperation with industry partners and in the past cooperated with companies such as Infineon, Bosch, SPARX Systems, BMW and Mercedes.I often serve in committees for EDA conferences such as DAC, ICCAD, DATE, SAMOS and CODES/ISSS. I am also active in the RISC-V community and co-initiator and steering committee member of the RISC-V Summit Europe. I am senior member of IEEE.My main research interests are in Electronic System Level Design, RISC-V domain-specific architectures, tinyML/embedded ML compiler toolchains as well as functional safety and HW security. Roles Head of Research Unit Embedded Computing Systems, E191-02 Full Professor Embedded Computing Systems, E191-02 Curriculum Commission for Computer Engineering Principal Member Contact daniel.mueller-gritschneder@tuwien.ac.at Treitlstrasse 3, Room DE0218 vCard from TISS ti.tuwien.ac.at/ecs/people/daniel-mueller-gritschneder/ orcid.org/0000-0003-0903-631X informatics.tuwien.ac.at/people/daniel-mueller-gritschneder tiss.tuwien.ac.at/person/396715 Courses 2025W Advanced Computer Architecture / 191.019 / VU Bachelor Thesis for Computer Science and Business Informatics / 182.698 / PR Computer Engineering Practical / 191.005 / PR Computer Engineering Project / 191.006 / PR Doctorand's seminar / 182.070 / SE Project in Computer Science 1 / 191.008 / PR Project in Computer Science 2 / 191.009 / PR Scientific Project Computer Engineering / 191.007 / PR Scientific Research and Writing / 193.052 / SE Seminar Computer Engineering / 182.757 / SE Projects ML DevOps Methods for a Green and Safe EdgeAI Lifecycle 2025 – 2028 / Austrian Research Promotion Agency (FFG) Generating and Deploying Lightweight, Secure and Zero-overhead Software for Multipurpose IoT Devices 2025 – 2026 / XCoorp GmbH TÜV-trustworthy electronics 2025 – 2026 / TÜV Austria Holding AG Publications Vicuna2.0: RISC-V Embedded Vector Unit with Half-Precision Floating-Point Support for TinyML / Jones, J. P., Van Kempen, P., & Mueller-Gritschneder, D. (2025). Vicuna2.0: RISC-V Embedded Vector Unit with Half-Precision Floating-Point Support for TinyML. In 2025 Austrochip Workshop on Microelectronics (Austrochip) (pp. 69–72). IEEE. https://doi.org/10.1109/Austrochip67945.2025.11183718 SuperFast: Fast Supernet Training Using Initial Knowledge / Thoma, M., Aghajanzadeh, E., Balamuthu Sampath, S., Mori, P., Fasfous, N., Frickenstein, A., Vemparala, M.-R., Mueller-Gritschneder, D., & Schlichtmann, U. (2025). SuperFast: Fast Supernet Training Using Initial Knowledge. In 2025 62nd ACM/IEEE Design Automation Conference (DAC) (pp. 1–7). IEEE. https://doi.org/10.1109/DAC63849.2025.11132779 Sim-to-Real: Tiny Deep Learning Agents on Resource-Constrained Embedded Microcontrollers / Klotz, S., Kulkarni, S., Joglekar, N., Bucksch, T., Goswami, D., & Mueller-Gritschneder, D. (2025). Sim-to-Real: Tiny Deep Learning Agents on Resource-Constrained Embedded Microcontrollers. In 2025 IEEE Conference on Control Technology and Applications (CCTA) (pp. 806–811). IEEE. https://doi.org/10.1109/CCTA53793.2025.11151414 Combining TinyML & Model-based Architecture Methods for Predictive Maintenance in Highly Regulated Environments / Müller-Gritschneder, D., & Lieber, P. (2025, August 16). Combining TinyML & Model-based Architecture Methods for Predictive Maintenance in Highly Regulated Environments [Presentation]. AI Solution Days 2025, Nürnberg, Germany. http://hdl.handle.net/20.500.12708/219807 Towards an Automated Toolchain and Fusion-based Instruction Identification for RISC-V Custom Extensions / Müller-Gritschneder, D. (2025, June 25). Towards an Automated Toolchain and Fusion-based Instruction Identification for RISC-V Custom Extensions [Conference Presentation]. 2nd Austrian RISC-V Meetup, Graz, Austria. Low Overhead Fault Tolerance for tinyML and Security Applications / Müller-Gritschneder, D. (2025, May 30). Low Overhead Fault Tolerance for tinyML and Security Applications [Presentation]. 3rd Workshop on Intelligent Methods for Test and Reliability, Tallinn, Estonia. http://hdl.handle.net/20.500.12708/219806 Rapid Fault Injection Simulation by Hash-Based Differential Fault Effect Equivalence Checks / Geier, J., Kontopoulos, L., Müller-Gritschneder, D., & Schlichtmann, U. (2025). Rapid Fault Injection Simulation by Hash-Based Differential Fault Effect Equivalence Checks. In 2025 Design, Automation & Test in Europe Conference (DATE). 2025 Design, Automation & Test in Europe Conference (DATE), Lyon, France. IEEE. https://doi.org/10.23919/DATE64628.2025.10993266 EGIC: Enhanced Low-Bit-Rate Generative Image Compression Guided by Semantic Segmentation / Körber, N., Kromer, E., Siebert, A., Hauke, S., Mueller-Gritschneder, D., & Schuller, B. (2025). EGIC: Enhanced Low-Bit-Rate Generative Image Compression Guided by Semantic Segmentation. In A. Leonardis, E. Ricci, & S. Roth (Eds.), Computer Vision – ECCV 2024 : 18th European Conference, Milan, Italy, September 29 – October 4, 2024, Proceedings, Part XXXV (pp. 202–220). Springer. https://doi.org/10.1007/978-3-031-72761-0_12 Flexible Generation of Fast and Accurate Software Performance Simulators From Compact Processor Descriptions / Foik, C., Kunzelmann, R., Mueller-Gritschneder, D., & Schlichtmann, U. (2024). Flexible Generation of Fast and Accurate Software Performance Simulators From Compact Processor Descriptions. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, 43(11), 4130–4141. https://doi.org/10.1109/TCAD.2024.3445255 Seal5: Semi-Automated LLVM Support for RISC-V ISA Extensions Including Autovectorization / van Kempen, P., Salmen, M., Müller-Gritschneder, D., & Schlichtmann, U. (2024). Seal5: Semi-Automated LLVM Support for RISC-V ISA Extensions Including Autovectorization. In Proceedings 2024 27th Euromicro Conference on Digital System Design (DSD 2024) (pp. 335–342). https://doi.org/10.1109/DSD64264.2024.00052 Rapid Prototyping Methods for custom-tailored, safe and secure RISC-V processors / Müller-Gritschneder, D. (2024, September 11). Rapid Prototyping Methods for custom-tailored, safe and secure RISC-V processors [Conference Presentation]. TRISTAN Technical Conference 2024, Graz, Austria. http://hdl.handle.net/20.500.12708/206261 Open Source Simulators for Pre-Silicon Validation of Safety-critical RISC-V System-on-chip / Mueller-Gritschneder, D., & Geier, J. (2024, September). Open Source Simulators for Pre-Silicon Validation of Safety-critical RISC-V System-on-chip [Conference Presentation]. Open Source Summit 2024, Wien, Austria. http://hdl.handle.net/20.500.12708/206489 MuDSE: GA-ILP-based Framework for Automated Deployment of Multiple DNNs on Heterogeneous Mixed-Criticality Systems / Hoffman, A., Fnayou, A., Smirnov, F., Müller-Gritschneder, D., & Schlichtmann, U. (2024). MuDSE: GA-ILP-based Framework for Automated Deployment of Multiple DNNs on Heterogeneous Mixed-Criticality Systems. In 2024 IEEE International Conference on Omni-layer Intelligent Systems (COINS). IEEE COINS 2024: IEEE International Conference on Omni-layer Intelligent systems, London, United Kingdom of Great Britain and Northern Ireland (the). IEEE. https://doi.org/10.1109/COINS61597.2024.10622135 Awards Best Paper Award: Moritz Thoma, Tobias Preintner, Emad Aghajanzadeh, Shambhavi Balamuthu Sampath, Pierpaolo Mori, Nael Fasfous, Manoj-Rohit Vemparala, Alexander Frickenstein, Daniel Mueller-Gritschneder, Ulf Schlichtmann; Uncertainty Aware Training to Improve Uncertainty Active Learning for Semantic Segmentation Proceedings of the Computer Vision and Pattern Recognition Conference (CVPR) Workshops, 2025 2025 / SAIAD Workshop, CVPR25 / USA / Website Best Student Paper Award: Pierpaolo Mori, Lukas Frickenstein, Shambhavi Balamuthu Sampath, Moritz Thoma, Nael Fasfous, Manoj Rohit Vemparala, Alexander Frickenstein, Christian Unger, Walter Stechele, Daniel Mueller-Gritschneder, Claudio Passerone \"Wino Vidi Vici: Conquering Numerical Instability of 8-Bit Winograd Convolution for Accurate Inference Acceleration on Edge\" 2024 / IEEE/CVF Winter Conference on Applications of Computer Vision 2024 / USA Best Paper Award: Samira Ahmadi, Rafael Stahl, Philipp van Kempen, Daniel Mueller-Gritschneder and Ulf Schlichtmann. \"Towards Rapid Exploration of Heterogeneous TinyML Systems using Virtual Platforms and TVM’s UMA.\" 2023 / Workshop on Compilers, Deployment, and Tooling for Edge AI. / Germany Habilitationspreis 2019 / Bund der Freunde der technischen Universität München / Germany / Website Best Paper Award for Paper: Saman Payvar, Mir Khan, Rafael Stahl, Daniel Mueller-Gritschneder, Jani Boutellier \"Neural Network-based Vehicle Image Classification for IoT Devices\" 2019 / IEEE International Workshop on Signal Processing Systems, SiPS 2019 / China Senior Member 2019 / IEEE / USA And more… Soon, this page will include additional information such as reference projects, activities as journal reviewer and editor, memberships in councils and committees, and other research activities. Until then, please visit Daniel Müller-Gritschneder’s research profile in TISS .",
  "content_length": 9989,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:25"
}