{
  "name": "Dani Lischinski",
  "homepage": "http://www.cs.huji.ac.il/~danix",
  "status": "success",
  "content": "Dani Lischinski - Home Page Dani Lischinski https://scholar.google.com/citations?user=8Z6Z8YQAAAAJ&hl=en The Rachel and Selim Benin School of Computer Science and Engineering The Hebrew University of Jerusalem Edmond J. Safra Campus, Givat Ram, Jerusalem 91904, Israel E-mail: danix at mail.huji.ac.il URL: https://www.cs.huji.ac.il/~danix/ Phone: +972-2-549-4549 Fax: +972-2-549-4549 Office: C425, Rothberg Family Building, Edmond J. Safra Campus (Givat Ram) Personal Information I am a full Professor at the School of Computer Science and Engineering at the Hebrew University of Jerusalem, Israel. I received my PhD from the Department of Computer Science and the Program of Computer Graphics at Cornell University in 1994, and I was a post-doctoral research associate at the Department of Computer Science and Engineering at the University of Washington until 1996. In 2002/3, I spent a sabbatical year at Pixar Animation Studios. In 2012 I received the Eurographics Outstanding Technical Contributions Award. In 2017, I served as the Technical Papers Chair for SIGGRAPH Asia 2017. For more information, see my full cv. Research My areas of interest span a wide variety of topics in the fields of computer graphics, image and video processing, and computer vision. In the past, I have worked on algorithms for photorealistic image synthesis, simulation of global illumination, interactive visualization of complex virtual scenes, computer-generated illustration, facial animation, image-based modeling and rendering, medical visualization, and physically-based animation. Most of my recent work falls in the area of Computational Photography. More specifically, I am intersted in various tasks related to editing of images and video (filtering, detail manipulation, shadow removal, matting, tonal adjustment), and in particular tone mapping of HDR images. Another ongoing area of interest is texture synthesis. Currently, I am particularly interested in deep neural networks and their applications in vision, graphics, and computational photography. Students: I am only able to supervise a limited number of motivated MSc and PhD students. Please take a look at my recent projects (below) before inquiring. Ideally, you should have taken machine learning, and image processing or computer graphics (or better yet, both). You will definitely need to become familiar with deep learning, so I recommend taking one of our deep learning courses as well. Links to selected recent publications and project pages: Stable Flow: Vital Layers for Training-Free Image Editing. Omri Avrahami, Or Patashnik, Ohad Fried, Egor Nemchinov, Kfir Aberman, Dani Lischinski, Daniel Cohen-Or. In Proc. CVPR 2025, June 2025. [PDF][YouTube Video] Creative Blends of Visual Concepts. Zhida Sun, Zhenyao Zhang, Yue Zhang, Min Lu, Dani Lischinski, Daniel Cohen-Or, Hui Huang. In CHI 2025. [PDF] Click2Mask: Local Editing with Dynamic Mask Generation. Omer Regev, Omri Avrahami, Dani Lischinski. In Proc. AAAI 2025, March 2025. [PDF][YouTube Video] DiffUHaul: A Training-Free Method for Object Dragging in Images. Omri Avrahami, Rinon Gal, Gal Chechik, Ohad Fried, Dani Lischinski, Arash Vahdat, Weili Nie. In Proc. SIGGRAPH Asia 2024, December 2024. [PDF][YouTube Video] Mismatch Quest: Visual and Textual Feedback for Image-Text Misalignment. Brian Gordon, Yonatan Bitton, Yonatan Shafir, Roopal Garg, Xi Chen, Dani Lischinski, Daniel Cohen-Or, Idan Szpektor. Proc. ECCV 2024. [PDF][GitHub] The Chosen One: Consistent Characters in Text-to-Image Diffusion Models. Omri Avrahami, Amir Hertz, Yael Vinker, Moab Arar, Shlomi Fruchter, Ohad Fried, Daniel Cohen-Or, Dani Lischinski. In Proc. SIGGRAPH 2024, July 2024. [PDF][Code (unofficial)] Generating Non-Stationary Textures using Self-Rectification. Yang Zhou, Rongjun Xiao, Dani Lischinski, Daniel Cohen-Or, Hui Huang; Proc. CVPR 2024, pp. 7767-7776 [PDF] Noise-Free Score Distillation. Oren Katzir, Or Patashnik, Daniel Cohen-Or, Dani Lischinski. To appear in ICLR 2024. [PDF][Code][Project Page] Chatting Makes Perfect: Chat-Based Image Retrieval. Matan Levy, Rami Ben-Ari, Nir Darshan, Dani Lischinski. Proc. NeurIPS 2023. [PDF][GitHub][Project Page] Break-a-Scene: Extracting Multiple Concepts from a Single Image. Omri Avrahami, Kfir Aberman, Ohad Fried, Daniel Cohen-Or, Dani Lischinski. Proc. SIGGRAPH Asia 2023. [PDF][GitHub][Project Page] Blended-NeRF: Zero-Shot Object Generation and Blending in Existing Neural Radiance Fields. Ori Gordon, Omri Avrahami, Dani Lischinski. Proc. ICCV 2023 AI3DCC. [PDF][GitHub][Project Page] EmoSet: A Large-scale Visual Emotion Dataset with Rich Attributes. Jingyuan Yang, Qirui Huang, Tingting Ding, Dani Lischinski, Danny Cohen-Or, Hui Huang. Proc. ICCV 2023. [PDF][Project Page] What's in a Decade? Transforming Faces Through Time. Eric Ming Chen, Jin Sun, Apoorv Khandelwal, Dani Lischinski, Noah Snavely, Hadar Averbuch-Elor. Computer Graphics Forum 42(2), 281-291 (Proc. Eurographics 2023). [PDF][Code][Project Page] Blended Latent Diffusion. Omri Avrahami, Ohad Fried, Dani Lischinski. ACM Transactions on Graphics 42(4) (Proc. SIGGRAPH 2023), August 2023. [PDF][GitHub][Project Page] SpaText: Spatio-Textual Representation for Controllable Image Generation. Omri Avrahami, Thomas Hayes, Oran Gafni, Sonal Gupta, Yaniv Taigman, Devi Parikh, Dani Lischinski, Ohad Fried, Xi Yin. Proc. CVPR 2023. [PDF][Project Page] Data Roaming and Early Fusion for Composed Image Retrieval. Matan Levy, Rami Ben-Ari, Nir Darshan, Dani Lischinski. Proc. AAAI 2024. [PDF][Project Page] Shape-Pose Disentanglement using SE(3)-equivariant Vector Neurons. Oren Katzir, Dani Lischinski, Daniel Cohen-Or. Proc. ECCV 2022 (oral). [PDF][GitHub] Classification-Regression for Chart Comprehension. Matan Levy, Rami Ben-Ari, Dani Lischinski. Proc. ECCV 2022. [PDF][GitHub][Project Page] GAN Cocktail: mixing GANs without dataset access. Omri Avrahami, Dani Lischinski, Ohad Fried. Proc. ECCV 2022. [PDF][GitHub][Project Page] Blended Diffusion for Text-driven Editing of Natural Images. Omri Avrahami, Dani Lischinski, Ohad Fried. Proc. CVPR 2022. [PDF][GitHub][Project Page] StyleAlign: Analysis and Applications of Aligned StyleGAN Models. Zongze Wu, Yotam Nitzan, Eli Shechtman, Dani Lischinski. Proc. ICLR 2022 (oral). [PDF][GitHub] StyleCLIP: Text-Driven Manipulation of StyleGAN Imagery. Or Patashnik, Zongze Wu, Eli Shechtman, Daniel Cohen-Or, Dani Lischinski. Proc. ICCV 2021 (oral). [PDF][GitHub][video] StyleSpace Analysis: Disentangled Controls for StyleGAN Image Generation. Zongze Wu, Dani Lischinski, Eli Shechtman. Proc. CVPR 2021 (oral). [PDF][GitHub][video] Fine-grained Foreground Retrieval via Teacher-Student Learning. Zongze Wu, Dani Lischinski, Eli Shechtman. Proc. WACV 2021. [PDF][video] Differentiable refraction-tracing for mesh reconstruction of transparent objects. Jiahui Lyu, Bojian Wu, Dani Lischinski, Daniel Cohen-Or, Hui Huang. ACM Transactions on Graphics 39(6) (Proc. SIGGRAPH Asia 2020), Dec. 2020. [PDF][Project page] Cross-Domain Cascaded Deep Feature Translation. Oren Katzir, Dani Lischinski, Daniel Cohen-Or. Proc. ECCV 2020 (oral). [PDF] MotioNet: 3D Human Motion Reconstruction from Video with Skeleton Consistency. Mingyi Shi, Kfir Aberman, Andreas Aristidou, Taku Komura, Dani Lischinski, Daniel Cohen-Or, Baoquan Chen. ACM Transactions on Graphics, 2020. [Webpage,Video,GitHub] Skeleton-Aware Networks for Deep Motion Retargeting. Kfir Aberman, Peizhuo Li, Dani Lischinski, Olga Sorkine-Hornung, Daniel Cohen-Or, Baoquan Chen. ACM Transactions on Graphics 39(4) (Proc. SIGGRAPH 2020), July 2020. [Webpage,Video,GitHub] Unpaired Motion Style Transfer from Video to Animation. Kfir Aberman, Yijia Weng, Dani Lischinski, Daniel Cohen-Or, Baoquan Chen. ACM Transactions on Graphics 39(4) (Proc. SIGGRAPH 2020), July 2020. [Webpage,Video,GitHub] Unsupervised K-modal Styled Content Generation. Omry Sendik, Dani Lischinski, Daniel Cohen-Or. ACM Transactions on Graphics 39(4) (Proc. SIGGRAPH 2020), July 2020. [PDF] Learning Character-Agnostic Motion for Motion Retargeting in 2D. Kfir Aberman, Rundi Wu, Dani Lischinski, Baoquan Chen, Daniel Cohen-Or. ACM Transactions on Graphics 38(4) (Proc. SIGGRAPH 2019), July 2019. [Project Page] SAGNet: Structure-aware Generative Network for 3D Shape Modeling. Zhijie Wu, Xiang Wang, Di Lin, Dani Lischinski, Daniel Cohen-Or, Hui Huang. ACM Transactions on Graphics 38(4) (Proc. SIGGRAPH 2019), July 2019. [Project Page] ZigZagNet: Fusing Top-Down and Bottom-Up Context for Object Segmentation. Di Lin, Dingguo Shen, Siting Shen, Yuanfeng Ji, Dani Lischinski, Daniel Cohen-Or, Hui Huang. Proc. CVPR 2019, June 2019. [Project Page] Deep Video-Based Performance Cloning. Kfir Aberman, Mingyi Shi, Jing Liao, Dani Lischinski, Baoquan Chen, Daniel Cohen-Or. Computer Graphics Forum 38(2) (Proc. Eurographics 2019), [Project Page] What's in a Face? Metric Learning for Face Characterization. Omry Sendik, Dani Lischinski, Daniel Cohen-Or. Computer Graphics Forum 38(2) (Proc. Eurographics 2019), [Project Page] Multi-Scale Context Intertwining for Semantic Segmentation. Di Lin, Yuanfeng Ji, Dani Lischinski, Daniel Cohen-Or, Hui Huang. Proc. ECCV 2018, September 2018. [Project Page] Neural Best-Buddies: Sparse Cross-Domain Correspondence. Kfir Aberman, Jing Liao, Mingyi Shi, Dani Lischinski, Baoquan Chen, Daniel Cohen-Or. ACM Transactions on Graphics 37(4) (Proc. SIGGRAPH 2018), August 2018. [Github Project Page] Creating and Chaining Camera Moves for Quadrotor Videography. Ke Xie, Hao Yang, Shengqiu Huang, Dani Lischinski, Marc Christie, Kai Xu, Minglun Gong, Daniel Cohen-Or, Hui Huang. ACM Transactions on Graphics 37(4) (Proc. SIGGRAPH 2018), August 2018. [Project Page] Non-stationary Texture Synthesis by Adversarial Expansion. Yang Zhou, Zhen Zhu, Dani Lischinski, Daniel Cohen-Or, Hui Huang. ACM Transactions on Graphics 37(4) (Proc. SIGGRAPH 2018), August 2018. [Project Page][Supplementary][code] Appearance Modeling via Proxy-to-Image Alignment. Hui Hu",
  "content_length": 19540,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:51"
}