{
  "name": "Daniel Saakes",
  "homepage": "http://people.utwente.nl/d.p.saakes",
  "status": "success",
  "content": "Dr.ir. D.P. Saakes | People Pages: Find employees & contact details | University of Twente Skip to content ET-DPM-IxDHorst Complex W258d.p.saakes@utwente.nl+31534892006Business card Daniel loves making things and things that make things. Trained as a design engineer, he has over 20 years of experience making highly interactive prototypes. Daniel is technology agnostic and builds things from low- to high-tech, from paper to co-bots and XR. Daniel is an associate professor at the University of Twente's Engineering Technology faculty. Before that, he was an associate professor at KAIST, the Republic of Korea, and an assistant professor at the Delft University of Technology. Other work experience includes a visiting position at MIT Media Lab (Cambridge, USA), Japan Science and Technology Agency (Tokyo, Japan), and Umeå Institute of Design in Sweden.He serves as the scientific director of 4TU Design United and is a steering committee member of the ACM Tangible Embedded and Embodied Interaction (TEI) conference.OrganisationsFaculty of Engineering Technology (ET)Design, Production and Management (ET-DPM)Interaction Design (ET-DPM-IxD)Courses academic year 2025/2026Courses in the current academic year are added at the moment they are finalised in the Osiris system. Therefore it is possible that the list is not yet complete for the whole academic year.202000224 - Bachelor Thesis Project202400380 - Design sprintsCourses academic year 2024/2025202000224 - Bachelor Thesis Project202200181 - S1: Introduction to Design202400380 - Design sprints+31534892006 (work)d.p.saakes@utwente.nlBusiness card (vCard)AddressUniversity of TwenteHorst Complex (building no. 20), room W258De Horst 27522 LW EnschedeNetherlandsNavigate to locationUniversity of TwenteHorst Complex W258P.O. Box 2177500 AE EnschedeNetherlandsOrganisationsFaculty of Engineering Technology (ET)Design, Production and Management (ET-DPM)Interaction Design (ET-DPM-IxD)Scan the QR code orDownload vCard",
  "content_length": 1977,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:35"
}