{
  "name": "Daniel A. Keim",
  "homepage": "https://www.vis.uni-konstanz.de/en/members/keim",
  "status": "success",
  "content": "AG Keim - Datenanalyse und Visualisierung Chairholder and since October 2022 in Directorate of the Center for HUMAN | DATA | SOCIETY.Research AreasDatabasesData MiningInformation VisualizationVisual AnalyticsNewsVisual Analytics of MovementCHDS (Centre for Human Data Society)The Centre for Human Data Society (CHDS) at the University of Konstanz will establish new ways how humans and society and data science (processes/workflows) interact with each other.New book of G. Andrienko, N. Andrienko, P. Bak, D. Keim and S. Wrobel. The book website has more details and you can order printed copy!Mastering the Information Age - Solving Problems with Visual AnalyticsThe VisMaster book edited by Daniel Keim, Jörn Kohlhammer, Geoffrey Ellis and Florian Mansmann is now available in print form at Eurographics but you can also download the full book [25 MB, PDF].Interactive Data VisualizationVisualization is the process of representing data, information, and knowledge in a visual form. This book covers the full spectrum of the field, including mathematical and analytic aspects, ranging from its foundations to human visual perception; from coded algorithms for different types of data, information and tasks to the design and evaluation of new visualization techniques. Read more here.The 2011 Visualization Technical Achievement AwardThe 2011 Visualization Technical Achievement Award goes to Daniel Keim, University of Konstanz, in recognition of his seminal technical work in high-dimensional data analysis and visualization of large data bases. His work has stimulated research in the new field of Visual Analytics. The IEEE VGTC is pleased to award Dr. Daniel Keim the 2011 Visualization Technical Achievement Award. Read more here.Publications Contact Prof. Dr. Daniel A. Keim University of Konstanz Data Analysis and Visualization Building ZT, Room 1110 Box 78 Universität Konstanz Universitätsstraße 10 78457 Konstanz Germany Tel.: +49 (0) 7531 88-3161 Fax: +49 (0) 7531 88-3268 Appointments on request by e-mail. Send email Suche ausblenden Universität Konstanz Suche Suchbegriffe Suchen Suchergebisse Vorschläge KIM KIM Serviceverbund Kimografie Kim-Claude Meyer",
  "content_length": 2173,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:54"
}