{
  "name": "Daniel Harabor",
  "homepage": "https://research.monash.edu/en/persons/daniel-harabor",
  "status": "success",
  "content": "Daniel Harabor - Monash University View Scopus Profile Daniel Harabor Assoc Professor Associate Professor, Department of Data Science & AI https://orcid.org/0000-0001-6828-7712 EmailDaniel.Harabormonashedu 20082025 Research activity per year Personal profile BiographyDaniel Harabor is a DECRA Research Fellow in the Faculty of Information Technology, Monash University. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Doctor of Philosophy, Australian National University (ANU)Award Date: 13 Dec 2014Computer Science, Bachelor of Science (Honours), Australian National University (ANU)Award Date: 12 Dec 2007 Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2016 2016 2019 2020 2021 2023 2025 2 Active 3 Finished Projects per year 2023 MAPF Competition: 2023 MAPF CompetitionHarabor, D. (Chief Investigator (CI)), Koenig, S. (Chief Investigator (CI)), Yu, J. (Chief Investigator (CI)), Bekris, K. (Chief Investigator (CI)) & Wu, C. (Chief Investigator (CI))3/01/23 → …Project: Research Personalised Public TransportHarabor, D. (Primary Chief Investigator (PCI)), Moser, I. (Chief Investigator (CI)) & Ronald, N. (Chief Investigator (CI))24/06/19 → 31/12/25Project: Research Anytime Constraint-based Multi-agent PathfindingHarabor, D. (Primary Chief Investigator (PCI))29/03/21 → 28/03/24Project: Research Improved Constraint Reasoning for Robust Multi-agent Path PlanningStuckey, P. (Primary Chief Investigator (PCI)), Harabor, D. (Chief Investigator (CI)), Le Bodic, P. (Chief Investigator (CI)), Gange, G. (Chief Investigator (CI)) & Koenig, S. (Partner Investigator (PI))1/01/20 → 31/12/24Project: Research The Future of Urban Routing and NavigationHarabor, D. (Primary Chief Investigator (PCI))ARC - Australian Research Council27/06/16 → 31/12/19Project: Research Research output Research output per year 2008 2019 2021 2022 2025 81 Conference Paper 13 Article 1 Other contribution Research output per year Research output per year Concurrent Planning and Execution in Lifelong Multi-Agent Path Finding with Delay ProbabilitiesZhang, Y., Chen, Z., Harabor, D., Le Bodic, P. & Stuckey, P. J., 2025, Proceedings of the AAAI Conference on Artificial Intelligence. Walsh, T., Shah, J. & Kolter, Z. (eds.). Washington DC USA: Association for the Advancement of Artificial Intelligence (AAAI), p. 23387-23394 8 p. (Proceedings of the AAAI Conference on Artificial Intelligence; vol. 39, no. 22).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access Constraint-Based In-Station Train DispatchingSchutt, A., Cardellini, M., Dekker, J. J., Harabor, D., Maratea, M. & Vallati, M., 2025, 31st International Conference on Principles and Practice of Constraint Programming. de la Banda, M. G. (ed.). Saarbrücken/Wadern, Germany: Schloss Dagstuhl, 24 p. 33. (Leibniz International Proceedings in Informatics, LIPIcs; vol. 340).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile Online Guidance Graph Optimization for Lifelong Multi-Agent Path FindingZang, H., Zhang, Y., Jiang, H., Chen, Z., Harabor, D., Stuckey, P. J. & Li, J., 2025, Proceedings of the AAAI Conference on Artificial Intelligence. Walsh, T., Shah, J. & Kolter, Z. (eds.). Washington DC USA: Association for the Advancement of Artificial Intelligence (AAAI), p. 14726-14735 10 p. (Proceedings of the AAAI Conference on Artificial Intelligence; vol. 39, no. 14).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access 4 Citations (Scopus) Optimal Multi-Agent Pickup and Delivery Using Branch-and-Cut-and-Price AlgorithmsLam, E., Stuckey, P. J. & Harabor, D., 10 Dec 2025, In: Transportation Science. 59, 1, p. 104-124 21 p.Research output: Contribution to journal › Article › Research › peer-review 1 Citation (Scopus) Sub-Microsecond Grid Path Planning, at What Cost?Carlson, M., Harabor, D. D. & Stuckey, P. J., 2025, 18th International Symposium on Combinatorial Search, SoCS 2025. Likhachev, M., Rudová, H. & Scala, E. (eds.). Washington DC USA: Association for the Advancement of Artificial Intelligence (AAAI), p. 38-46 9 p. (The International Symposium on Combinatorial Search; vol. 18).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review View all 95 research outputs",
  "content_length": 4990,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:10"
}