{
  "name": "Daniel Gottesman",
  "homepage": "https://www.cs.umd.edu/users/dgottesm",
  "status": "success",
  "content": "Daniel Gottesman Daniel Gottesman Joint Center for Quantum Information and Computer Science (QuICS) 3251 Atlantic Building University of Maryland College Park, MD 20742 USA dgottesm@umd.edu I am the Brin Family Endowed Professor in Theoretical Computer Science at the University of Maryland. I am in the Computer Science department and a member of UMIACS and a QuICS Fellow. I am also a Co-director of QuICS. I got my Ph.D. at Caltech in 1997, and did postdocs at Los Alamos National Lab and Microsoft Research, after which I served in the UC Berkeley CS department as a Long-Term CMI Prize Fellow with the Clay Mathematics Institute. I then spent 19 years as a faculty member at Perimeter Institute in Waterloo, Ontario before moving to Maryland. Most of my work is in the field of quantum computation and quantum information. I have worked in a number of subfields, particularly quantum error correction, fault-tolerant quantum computation, quantum complexity, and quantum cryptography. I am best known for developing the stabilizer code formalism for creating and describing a large class of quantum codes, and for work on performing quantum gates using quantum teleportation. I was named to the MIT Technology Review's TR100: Top Young Innovators for 2003 and I am an APS Fellow. Research Draft textbook on quantum error correction and fault tolerance: Surviving as a Quantum Computer in a Classical World. If you find you wish to cite the book, please refer to it as the 2024 draft (as there will likely be future drafts distributed). Papers bibliographic info only, in reverse chronological order by category, with capsule summaries Google Scholar profile Some recent work: Adaptive syndrome extraction (arXiv:2502.14835 [quant-ph]). Symmetrization algorithm (arXiv:2411.04019 [quant-ph]) Showing intermediate complexity classes are classically hard (arXiv:2411.02369 [quant-ph]) LDPC codes in 2D (PRX Quantum 2025, arXiv:2404.17676 [quant-ph]) Dynamical codes (arXiv:2403.04163 [quant-ph]) Encoding Majorana codes (PRA 2024, arXiv:2402.07829 [quant-ph]) Precision of approximate codes (Nature Physics 2024, arXiv:2310.04710 [quant-ph]) Masking error syndromes (Quantum 2024, arXiv:2306.17122 [quant-ph]) Spacetime codes (Solvay conference, arXiv:2210.15844 [quant-ph]) Some past work: Fault tolerance overhead (QIC 2014, arXiv:1310.2984 [quant-ph]) Interferometric telescopes and quantum repeaters (PRL 2012, arXiv:1107.2939 [quant-ph]) Complexity of translationally-invariant spin systems (FOCS 2009, ToC 2013, arXiv:0905.2419 [quant-ph]) Threshold for fault-tolerant quantum computation (QIC 2006, quant-ph/0504218) Authentication of quantum messages (FOCS 2002, quant-ph/0205128) Digitizing continuous quantum variables (PRA 2001, quant-ph/0008040) Quantum secret sharing (PRL 1999, quant-ph/9901025) Teleporting quantum gates (Nature 1999, quant-ph/9908010) Stabilizer codes (Caltech Ph.D. thesis, quant-ph/9705052) Information loss in black hole evaporation Some talks: Dynamical codes (PDF, Mar. 2025) General principles of fault tolerance (PDF, Dec. 2011) Colloquium on spin glasses and computational complexity (Oct. 2010), recording available at PIRSA:10100053. Complexity of one-dimensional spin chains (PPT, Oct. 2007) Long (4+ hours) tutorial on quantum error correction and fault tolerance (PPT, Aug. 2007) PI public lecture on quantum cryptography (April 2007), recording available at PIRSA:07040020. Overview of work on fault-tolerance (PPT, Dec. 2006) Quantum public key cryptography (PPT, Dec. 2005) Properties needed for fault-tolerant quantum computation (PPT, Nov. 2005) List of resources to learn about quantum error correction. My CV. Map of these pages. Physics Today article on quantum cryptography (Nov. 2000 issue) Teaching Introduction to Quantum Information Processing (CMSC 657, UMD). This is a graduate-level semester course introducing the ideas of quantum information. Fall 2021 Fall 2024 Introduction to Cryptography (CMSC 456, UMD). This is an undergraduate course on classical cryptography. Fall 2022 Fall 2023 Quantum Complexity (CMSC 858L, UMD). This is a graduate course giving an overview of quantum complexity. Spring 2023 Quantum Error Correction and Fault Tolerance (CMSC 858G, UMD). This is the UMD version of my course on quantum error correction. Spring 2024 Quantum Error Correction and Fault Tolerance. This is a semester graduate class for IQC taught either at PI or UW. The times it was at PI, the lectures were recorded. The course web pages contain problem sets and sometimes solution sets: Winter 2004 (UW, also has lecture notes) Winter 2007 (PI, recorded lectures) Winter 2012 (UW, with Debbie Leung) Winter 2014 (with Robert Koenig, web page no longer available) Spring 2016 (UW) Winter 2018 (PI, recorded lectures, with Beni Yoshida) Winter 2020 (UW) PSI Quantum Information Review. This is an introduction to quantum information for Master's students at Perimeter. Each class consists of 14-15 one-hour recorded lectures: Winter 2010 Winter 2011 Winter 2012 Winter 2015 Winter 2018 Winter 2019 Hobbies and Interests I am married to Lucy Zhang. We have one son. Reading science fiction and fantasy Role-playing games Earthrise The Return Here is a fairy tale I wrote one morning while I was in graduate school: Snow White and the Seven Quarks. It should not be taken to be representative of my own graduate experience. Read my quantum error correction sonnet. I was tapped to give an after-dinner speech at the QIP 2002 conference, and spoke about the penetration of quantum computation into popular culture. Last Updated: Mar. 31, 2025",
  "content_length": 5599,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:08"
}