{
  "name": "Daniel B. Neill",
  "homepage": "https://cs.nyu.edu/~neill",
  "status": "success",
  "content": "Daniel B. Neill Daniel B. Neill, Ph.D. Professor of Computer Science, Public Service, and Urban Analytics Director, Machine Learning for Good Laboratory New York University Courant Institute of Mathematical Sciences, Department of Computer Science Robert F. Wagner Graduate School of Public Service Center for Urban Science and Progress, Tandon School of Engineering E-mail: firstname.lastname @ nyu.edu Click here to learn more about our Machine Learning for Good Laboratory! My bio: Daniel B. Neill, Ph.D., is Professor of Computer Science, Public Service, and Urban Analytics at New York University (NYU), jointly tenured at NYU's Courant Institute Department of Computer Science, Robert F. Wagner Graduate School of Public Service, and the Center for Urban Science and Progress (part of NYU's Tandon School of Engineering). He is also Affiliated Faculty at NYU's Center for Data Science and the NYU Tandon Department of Computer Science and Engineering. At NYU, he directs the Machine Learning for Good (ML4G) Laboratory and recently finished a 3-year term as co-director of the university's Urban Initiative. Dr. Neill was previously a tenured faculty member at Carnegie Mellon University’s Heinz College, where he was the Dean’s Career Development Professor, Associate Professor of Information Systems, and Director of the Event and Pattern Detection Laboratory. Dr. Neill's research focuses on developing novel machine learning methods for social good, with applications ranging from medicine and public health to urban analytics and fairness in criminal justice. He works closely with organizations including health departments, hospitals, and city leaders to create and deploy data-driven tools and systems to improve the quality of public health, safety, and security, for example, through the early detection of disease outbreaks. He has been the Associate Editor of six journals (IEEE Intelligent Systems, Decision Sciences, Security Informatics, ACM Transactions on Management Information Systems, INFORMS Journal on Data Science, and ACM Journal on Computing and Sustainable Societies). He was the recipient of an NSF CAREER award and an NSF Graduate Research Fellowship, and was named one of the \"top ten artificial intelligence researchers to watch\" by IEEE Intelligent Systems. He received his M.Phil. from Cambridge University and his M.S. and Ph.D. in Computer Science from Carnegie Mellon University. Research: My research is focused on novel statistical and computational methods for discovery of emerging events and other relevant patterns in complex and massive datasets, applied to real-world policy problems for the social good. Application areas include disease surveillance (e.g., using electronically available public health data such as hospital visits and medication sales to automatically identify and characterize emerging outbreaks), health care (e.g., detecting anomalous patterns of care which significantly impact patient outcomes), and urban analytics (e.g., helping city governments to predict and proactively respond to emerging patterns of citizen needs). Selected publications by topic Publications (chronological) Presentations (chronological) My CV My Google Scholar page CMU homepage (old) Which projects am I most excited about these days? So glad you asked! In no particular order: Pre-syndromic surveillance is a new way of thinking about public health and disease surveillance, using unstructured data to detect novel bio-threats and other emerging patterns of interest to public health. (project page) Algorithmic fairness, particularly, how we can audit black-box algorithms to identify and correct systematic biases in risk prediction. (project page) Causal inference, primarily focused on two areas: (1) discovering heterogeneous treatment effects in both randomized experiments and observational data, e.g., identifying patterns of care that impact patient health outcomes, and analyzing the impacts of exposure to poor housing conditions on health; and (2) automating the detection of natural experiments. (publications) Opioid abuse and overdose surveillance, using data from prescription drug monitoring programs, law enforcement, and county medical examiners. (publications) Continuing to extend our fast subset scan methodology for pattern detection, e.g., to massive graphs, multidimensional data, and irregularly-shaped spatial clusters. (publications) Modeling and detecting patterns in complex urban data, using scalable Gaussian processes, deep learning, and other spatial machine learning methods. (publications) Latest News: The Machine Learning for Good Laboratory is focused on development of novel machine learning methods for addressing critical urban problems and improving public health, safety, and security. Please click here to learn more about ML4G. I am honored and delighted to serve on the steering committee of ACM COMPASS (Computing and Sustainable Societies) for 2025-2028. Our paper, \"Be Intentional About Fairness!: Fairness, Size, and Multiplicity in the Rashomon Set\", was awarded Best Paper Honorable Mention at EAAMO 2025. Our paper, Estimating Reporting Bias in 311 Complaint Data, was featured on NPR's The Academic Minute. Our paper, Housing-Sensitive Health Conditions Can Predict Poor-Quality Housing, is now out (open access) in the February 2024 issue of Health Affairs. Thanks to Health Affairs for highlighting our work in their Feb. 6 special issue briefing and Feb. 26 Health Affairs Insider Journal Club. Thanks also to David Brand (Gothamist), Steve Scott (WCBS 880 Newsradio), and Robert Polner (NYU) for their wonderful press coverage! Our paper on pre-syndromic disease surveillance is now out (open-access) in Science Advances! Thanks to Kimberly Adams (Marketplace Tech), Ruth Reader (Politico), Shania Kennedy (HealthITAnalytics), and Robert Polner (NYU) for their wonderful press coverage. For more details, please see our pre-syndromic surveillance project page here. Our project on \"End-to-End Fairness for Algorithm-in-the-Loop Decision Making in the Public Sector\" (NSF IIS-2040898, Neill, PI) was awarded $1M funding from the National Science Foundation Program on Fairness in Artificial Intelligence in Collaboration with Amazon. Our goals are to develop methods and tools that assist public sector organizations with fair and equitable policy interventions in areas including housing, criminal justice, and health. Thanks to Unite.AI for their press coverage, and to NSF and Amazon for their support! For more details, please see our end-to-end fairness project page here. Thanks to COSMOS Magazine for their very nice coverage of our recent publication on rape reporting delays. I am very excited to serve as \"AI for Social Impact\" area chair for the 3rd ACM Conference on Computing and Sustainable Societies (ACM COMPASS 2020). Please consider submitting your ML/AI for Good work to this great conference! Our project on \"Bias and Discrimination in City Predictive Analytics\" (NSF IIS-1926470, Kontokosta and Neill, PIs) was awarded funding from the National Science Foundation. Our goals are to improve urban analytics based on 311 citizen complaints by developing new methods to identify systematic biases in the propensity to complain, to understand the impact of reporting bias on predictive models for allocation of city services, and to enable city agencies to account for and correct these biases. I am serving as co-director of NYU's Urban Initiative for the 2019-2020 through 2021-2022 academic years. I am serving as an area chair for the NeurIPS 2019 Workshop on AI for Social Good. Please see the workshop's web page for more details. Congratulations to CMU doctoral student, Mallory Nobles! Our abstract, Multidimensional Semantic Scan for Pre-Syndromic Disease Surveillance, was the winner of the 2019 International Society for Disease Surveillance Outstanding Student or Post-Degree Abstract Award. Our pre-syndromic surveillance project was selected as the runner-up in the Department of Homeland Security's Hidden Signals Challenge, a nationwide system design competition which focuses on detecting emerging bio-threats in real time. Here is the link to the winner announcement. Our rodent prevention work was featured in an article on CityLab. According to the article, \"The city of Chicago is still running Neill's predictive analytics approach and has touted that it's 20 percent more effective than the traditional method of baiting rats after they've been discovered.\" Our paper on Semantic Scan: Detecting Subtle, Spatially Localized Events in Text Streams was named the winner of the Yelp Dataset Challenge. Our approach for identifying emerging topics can be used both for public health (detecting \"novel\" outbreaks with rare or previously unseen symptom patterns) as well as identifying emerging regional business trends. Thanks to both Yelp and CMU for their very nice press coverage of this work! Our comprehensive review article, \"Youth violence: what we know and what we need to know\", was featured in a press release by the American Psychological Association. The article was published in the January 2016 issue of the APA's flagship journal, American Psychologist, and is available here. I gratefully acknowledge funding support from the National Science Foundation, grants IIS-1926470, IIS-0916345, IIS-0911032, and IIS-0953330, the NSF Program on Fairness in Artificial Intelligence in Collaboration with Amazon, grant IIS-2040898, a UPMC Healthcare Technology Innovation Grant, funding from the John D. and Catherine T. MacArthur Foundation and Richard King Mellon Foundation, and a gift from the Disruptive Health Technology Institute. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the National Science Foundation, UPMC, DHTI, Amazon, Richard King Mellon Foundation, or MacArthur Foundation. Last updated: 10/11/2025",
  "content_length": 9979,
  "method": "requests",
  "crawl_time": "2025-12-01 12:56:55"
}