{
  "name": "Daniel Deutch",
  "homepage": "https://www.cs.tau.ac.il/~danielde",
  "status": "success",
  "content": "Daniel Deutch - Homepage Daniel Deutch - Homepage Home Bio Research Teaching Prof. Daniel Deutch Full Professor, Blavatnik School of Computer Science Faculty of Exact Sciences Tel Aviv University Contact Details Office: Tel Aviv University, Blavatnik School of Computer Science, Schreiber Building, Room 113 Tel. : 972-(0)3-6406698 Email: danielde AT post.tau.ac.il Publications See DBLP Research Positions Positions and scholarships are available for outstanding and motivated MSc and PhD students who are interested in applied or theoretical research in Web data management. Research Interests My reasearch focuses on Data Management. The high-level goals of my research are to understand, organize and analyze Data. My methodology of doing so is typically based, in part, on foundations in classic data managemant (databases), logic and probability and process analysis. Short Bio Daniel Deutch is a Full Professor in the Computer Science Department of Tel Aviv University. Daniel has received his Ph.D. degree in Computer Science from Tel Aviv University. He was a postdoctoral fellow at the University of Pennsylvania and INRIA France. His research focuses on advanced database applications and web data management, studying both theoretical and practical aspects of issues such as data provenance, analysis of web applications and data, and dealing with data uncertainty. Daniel's research has been disseminated by papers in the top conferences and journals on data and web data management (VLDB, SIGMOD/PODS, VLDBJ, TODS, etc.) He has won a number of research awards including the VLDB best paper award, the Krill Prize (awarded by the Wolf Foundation) and the Yahoo! Early Career Award. His research was awarded multiple competitive grants including the European Research Council (ERC) Personal Research Grant and grants by the Israeli Science Foundation (ISF, twice), the US-Israel Binational Science Foundation (BSF), the Broadcom Foundation, the Israeli Ministry of Science (MOST), the Blavatnik Interdisciplinary Cyber Research Institute (ICRC), Intuit and Intel. The Website of Daniel Deutch danielde AT post.tau.ac.il",
  "content_length": 2131,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:03"
}