{
  "name": "Daniel Seita",
  "homepage": "https://www.cs.cmu.edu/~dseita",
  "status": "success",
  "content": "Daniel Seita -- University of Southern California Daniel Seita I'm an Assistant Professor of Computer Science at the University of Southern California. I'm interested in robotics, computer vision, and machine learning, with a focus on robotic manipulation of visually and geometrically complex objects. These days, I'm interested in exploring and understanding (i) multimodal observation and action representations, (ii) foundation models, (iii) whole-body control, (iv) human-robot interaction. Ultimately, I hope that this research can help open the doors for robotic manipulation in unstructured environments. If you are a student interested in working with me, please check the Sensing, Learning, and Understanding for Robotic Manipulation website to get involved. Formal Bio Contact Github G. Scholar C. Vitae Communication Tips To International Students Daniel Seita is an Assistant Professor in the Computer Science department at the University of Southern California and the director of the Sensing, Learning, and Understanding for Robotic Manipulation (SLURM) Lab. His research interests are in computer vision, machine learning, and foundation models for robot manipulation, focusing on improving performance in visually and geometrically challenging settings. Daniel was a postdoc at Carnegie Mellon University's Robotics Institute and holds a PhD in computer science from the University of California, Berkeley. Daniel has been honored with the AAAI 2026 New Faculty Highlights program. He presents his work at premier robotics conferences such as ICRA, IROS, RSS, and CoRL. seita@usc.edu takeshidanny@gmail.com If you are contacting me to inquire about research opportunities, please check my lab website for more information. You do not need to email me to ask if I am taking on PhD students. I am much more likely to respond to emails tailored to me, in contrast to mass emails (please don't send them). USC has an aggressive spam filter which may cause me to miss some non-USC emails, so it's OK if you want to also cc the Gmail there but should (usually) not be necessary. There is no need to address me as \"Dear Sir,\" \"Esteemed Professor,\" \"Respected Professor,\" or other excessively formal phrases that might be used in mass emails (and which I get in my inbox). You can just write \"Prof. Seita,\" \"Professor Seita,\" or just \"Daniel.\" For in-person conversations, I believe my last name is pronounced like \"say-ta\" with two syllables. I do my best to learn about other cultures, countries, and governments, by reading and consulting a wide variety of references. With respect to any group's political leadership, there are a range of policy issues to which I might agree or disagree. I am careful to not conflate a country's political leadership and the opinions of a citizen of that country. I fully support people from all across the world coming to our country's schools and institutions, which is necessary to build the world's best team. I think the highly international nature of Robotics and AI is one of its best qualities, and I hope it remains like this. I am not afraid to critique the U.S. government if they put up roadblocks to this. Students who come from abroad can expect to have me as an ally. If you need a letter of recommendation for your permanent residency, send me an email. I am usually able to help with this. Highlights Research Talks Teaching Service Other Jan 22, 2026 I'm honored to be invited to the AAAI 2026 New Faculty Highlights program! If you are attending AAAI 2026, come say \"hi\" in Singapore. Sep 27, 2025 We are presenting four papers at CoRL 2025 in Seoul, South Korea. I'm excited about the progress we have made in benchmarking VLMs, data augmentation, robots and granular media, and robot learning from a single image. Aug 28, 2025 I am teaching CSCI 545 again, the Introduction to Robotics class. I am working with two fantastic TAs (Ya-Chuan Hsu and Zeyu Shangguan). As with the previous edition, I will post my lectures online so others can follow. May 05, 2025 Two papers accepted at ISER 2025 (in Santa Fe, USA). I'm excited to share our progress in building a multimodal hand and benchmarking VLMs for human-robot interaction. Dec 10, 2024 We will be presenting two papers at ISRR 2024 (in Long Beach, USA). Come meet us to discuss more about GPT-Fabric and SopeDex, led by some excellent undergraduate and master's students. Nov 01, 2024 We are presenting two papers accepted at CoRL 2024 (in Munich, Germany). These are about data-efficient bimanual manipulation and manipulating granular media. Aug 01, 2024 I'm teaching CSCI 699 in the fall. This is the second edition of this research seminar course, and we have a brand new set of impactful papers that we will cover this time around. Jan 01, 2024 I'm teaching CSCI 545 in the spring. This is an Introduction to Robotics course, and covers fundamental topics. I'm working with a great team of TAs: Hejia Zhang and Shihan Zhao. Aug 16, 2023 Moved to USC to begin my faculty career! I'm excited to teach CSCI 699 in the fall, a research seminar on robot manipulation. Please check the publications on the lab website. Please see my CV for a full list of talks. 2026AAAI New Faculty Highlights 2025Fudan University (virtual, screenshot) Arizona State University (photo) Gwangju Institute of Science and Technology (virtual, screenshot) National Taiwan University (slides, video) (recommended talk) Harvey Mudd College (photo) RSS 2025, Lab Tour (photo) RSS 2025 Workshop on R3: Reasoning for Robust Robot Manipulation in the Open World (website) Stanford Vision and Learning Lab (photo) 2024Osaka University (photo) Kyoto University (photo) University of California, Irvine, AI/ML Seminar 2022Cornell University, Robotics Seminar (video) 2021University of Toronto, AI in Robotics Seminar (video) Sp2029To be decided Fa2028To be decided Sp2028To be decided Fa2027No teaching Sp2027To be decided Fa2026 CSCI 645: Robot Manipulation Sp2026No Teaching Fa2025CSCI 545: Introduction to Robotics Sp2025No Teaching Fa2024CSCI 699: Robotic Manipulation Sp2024CSCI 545: Introduction to Robotics Fa2023CSCI 699: Deep Learning for Robotic Manipulation 2026Associate Editor, ICRA \"Shadow\" Treasurer, RSS 2025Area Chair, CoRL Associate Editor, IROS and RA-L Local Arrangements Chair, RSS 2024Area Chair, CoRL Co-Organizer, IROS Workshop on deformable object manipulation Associate Editor, IROS and RA-L Registration Co-Chair, RSS Co-Organizer, ICRA Workshop on 3D visual representations for manipulation Co-Organizer, ICRA Workshop on agile robots 2023Inclusion Co-Chair, CoRL Associate Editor, IROS Co-Organizer, RSS Pioneers Co-Organizer, ICRA Workshop on deformable object manipulation 2022Inclusion Co-Chair, CoRL Associate Editor, IROS Co-Organizer, ICRA Workshop on deformable object manipulation 2019+Berkeley and CMU AI Mentorship Programs 2017+Primary maintainer, Berkeley AI Research Blog 2023My Faculty Application Experience Website code courtesy of Andy Zeng.",
  "content_length": 6980,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:35"
}