{
  "name": "Daniel L. Pimentel-Alarcón",
  "homepage": "https://danielpimentel.github.io/index.html",
  "status": "success",
  "content": "SOL Lab Daniel Pimentel-Alarcón presents at the BMI Seminar. Huanran Li accepts an internship offer from Meta. Daniel Pimentel-Alarcón kicks off the WID Seminar Series — on Halloween. Ben Kizaric presents his poster at MMLS. Keynote address from Daniel Pimentel-Alarcón at MCPR. Akhilesh Soni and Jeff Linderoth trying to solve Subspace Clustering with Integer Programming. Keynote address from Daniel Pimentel-Alarcón at ENOAN. Huanran Li receives the ECE Gerald Holdridge Teaching Assistant Award. Daniel Pimentel-Alarcón and Claudia Solís-Lemus advertise El Zoominario at the WI Science Festival. Akhilesh Soni finds the key for Subspace Clustering with Integer Programming. Daniel Pimentel-Alarcón talks about waffle cones at Celebrating Latinx Voices in STEAM. Huanran Li presents his poster at MMLS. Daniel Pimentel-Alarcón presents at Sci-prov — where science meets improv comedy. Huanran Li presents progress at AmFam - Data Science Institute. SOL and Solís-Lemust Labs at MMLS and Carnitas Uruapan, Chicago. Daniel Pimentel-Alarcón explains his research to K12 students at Osborne High School. Previous Next About Modern data can be seen as a giant web of interconnected variables — like a social network of numbers. By learning the hidden patterns in data (aka structure), we can understand how the system behind it really works. This knowledge is the driving force behind AI, self-driving cars, disease cures, climate models, Spotify playlists, and countless other discoveries. The challenge is that data is often messy — noisy, incomplete, biased, scarce — so classical methods like PCA are not enough. We create the next generation of methods that can uncover patterns hidden in messy data. Lab News AUGUST 18, 2025 Congrats to Huanran Li for his new internship at Stripe. JUNE 25, 2025 Keynote address at MCPR by Daniel Pimentel-Alarcón. JUNE 23, 2025 Keynote address at ENOAN by Daniel Pimentel-Alarcón. MAY 19, 2025 Congrats to Huanran Li for his new internship at META. APRIL 11, 2025 Congrats to Sidd Baskar and Karan Rupashree for their accepted paper at ISIT. APRIL 11, 2025 Congrats to Huanran Li for his accepted paper at ISIT. APRIL 4,2025 Congrats to Michael Fromandi for winning the CMBI award. MARCH 2025 Congrats to Xiaoxu Rong for her accepted paper at PAS.",
  "content_length": 2285,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:18"
}