{
  "name": "Daniel D. Suthers",
  "homepage": "http://www2.hawaii.edu/~suthers",
  "status": "success",
  "content": "Daniel D. Suthers Daniel D. Suthers (Prof Dan) Professor, Department of Information and Computer Sciences Program Chair, Communication and Information Sciences PhD Program University of Hawai'i at Manoa 1680 East West Road, POST 309B Honolulu, HI 96822 (808) 956-3890 voice (808) 956-3548 fax suthers at hawaii dot edu http://www2.hawaii.edu/~suthers/ (this page) Office Hours Spring 2024 \"Drop In\" office hours Mondays 1:30-2:30 or other times by appointment All office hours are in my \"Personal Meeting Room\" in Zoom. Students have been provided with the Zoom ID (has waiting room, no password): others should email me. Research and Service General Areas: Cognitive, social and computational perspectives on designing and evaluating software for learning, collaboration, and community. Analytic methods for studying use of such technology. Laboratory for Interactive Learning Technologies (website currently inactive) Research Interests and Brief Vita Publications Long Vita (pdf, as of November 2018) Program Chair (previously and current), Communication and Information Sciences Ph.D. Program Former Graduate Program chair (twice), Department of Information and Computer Sciences Teaching (See Catalog for course descriptions) CIS 720 PhD Seminar, Fall 2022 to present; many instances in the late 2000's ICS 311 Analysis of Algorithms , Fall 2020, Fall 2017, Spring 2016, Spring 2015, Spring 2014, Fall 2013, Fall 2012, Fall 2011 and earlier ICS 422 Network Science Methodology, Fall 2024, Fall 2023, Spring 2022, Spring 2021, Spring 2017, and previously as ICS 491. ICS 622 Network Science, Fall 2024, Fall 2023, Spring 2022, Spring 2021, Fall 2019, Spring 2018, Fall 2016, Spring 2015, and previously as ICS 691. ICS 667 HCI Design Methods, Fall 2021, Fall 2010, and earlier. ICS 668 Social Informatics, Spring 2024, Spring 2019, Fall 2017, Spring 2016, Fall 2014, Fall 2012, Spring 2011 ... ICS 690 ICS Seminar, Fall 2022, Fall 2021, Fall 2020, Spring and Fall 2019, many instances in the 2000's Course and Faculty Evaluations",
  "content_length": 2033,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:01"
}