{
  "name": "Danilo Ardagna",
  "homepage": "http://home.deib.polimi.it/ardagna",
  "status": "success",
  "content": "Prof. Danilo Ardagna Prof. Danilo Ardagna English Skip to content HomeWork with me Bio Projects Publications Research Tools Teaching Algorithms and Parallel Computing 2021-22 PhD Thesis Thesis Patents & Standards Books Contacts Open Positions Danilo Ardagna’s home page Posted on 24/07/2013 by ASICT Hosting Personal Information Associate ProfessorPolitecnico di Milano Dipartimento di Elettronica, Informazione e BioingegneriaVia Golgi 42 20133 Milano, ItalyRoom: 315Tel: +39 02 2399 3514 Fax: +39 02 2399 3574 danilo.ardagna<at>polimi<dot>it Curriculum Vitae Research Interest My research work focuses on the design, prototype, and evaluation of resource management algorithms for large scale distributed systems supporting artificial intelligence, big data, and web applications. In particular, my work aims at the design of optimization algorithms for the maximization of Quality of Service and for the resource management of fog/edge/cloud infrastructures and HPC systems. Recently, I’m focusing on AI applications (I’ve recently coordinated the AI-SPRINT project), reinforcement learning, and I also work on performance analysis  and optimization of large-scale systems and software (see also the MODAClouds, DICE,  EUBRA-BIGSEA, and ATMOSPHERE projects). I also developed energy efficiency solutions for the management of virtualized infrastructures (GAME-IT project). During my Ph.D. studies, I investigated the problem of cost-oriented design and capacity planning of distributed IT architectures. Awards (last 10 years) R. Sala, B. Guindani, D. Ardagna, A. Guglielmi. d-MALIBOO: a Bayesian Optimization framework for dealing with Discrete Variables. MASCOTS 2024 (32nd IEEE International Symposium on the Modeling, Analysis, and Simulation of Computer and Telecommunication Systems). 1-8. Krakow, Poland. Best paper award. Included in the World’s Top 2% Scientist ranking (according to “Updated science-wide author databases of standardized citation indicators”), October 2023, November 2022. Google Education, May 2022. TETRAMAX Best project, October 2021. Best project among the 3rd call for Value Chain Technology Transfer Projects of H2020 TETRAMAX. ANDREAS selected for its exceptional contribution and innovation in power and cost management of deep learning training workloads. Top CompSci University Azure Adoption grant,  October 2016, September 2017, July 2018. D. Ardagna, S. Bernardi, E. Gianniti, S. Karimian Aliabadi, D. Perez-Palacin, J. I. Requeno. Modeling Performance of Hadoop Applications: A Journey from Queueing Networks to Stochastic Well Formed Nets.  ICA3PP 2016 Proceedings (16th International Conference on Algorithms and Architectures for Parallel Processing). 599-613. Granada, Spain. Best paper award. Events Fast Continuum 2025 General Co-Chair, Helsinki, Finland. Second International Workshop on Fast Continuum. Previous Events (last 10 years) SIGMETRICS  2023 Tutorial Co-Chair, Orlando,  Florida, USA. International Conference on Measurement and Modeling of Computer Systems. Fast Continuum 2023 General Co-Chair, Coimbra, Portugal. First International Workshop on Fast Continuum. SCADL 2022 General Co-Chair, Lyon, France. 4th International Workshop on Scalable Deep Learning over Parallel And Distributed Infrastructures. IFIP WG 7.3 Performance 2021 General Chair, Milan, Italy. The 39th International Symposium on Computer Performance, Modeling, Measurements and Evaluation. SCADL 2021 PC Co-Chair, Portland, Oregon, USA. 3rd International Workshop on Scalable Deep Learning over Parallel And Distributed Infrastructures. IFIP WG 7.3 Performance 2020 General Chair, Milan, Italy. The 38th International Symposium on Computer Performance, Modeling, Measurements and Evaluation. SCADL 2020 Co-Chair, New Orleans, Louisiana, USA. 2nd International Workshop on Scalable Deep Learning over Parallel And Distributed Infrastructures. QUDOS 2020 Co-Chair, L’Aquila, Italy. 6th International Workshop On Quality-Aware DevOps. QUDOS 2019 Co-Chair, Berlin, Germany. 5th International Workshop On Quality-Aware DevOps. QUDOS 2018 Co-Chair, Berlin, Germany. 4th International Workshop On Quality-Aware DevOps. QUDOS 2017 Co-Chair, L’Aquila, Italy. 3rd International Workshop On Quality-Aware DevOps. QUDOS 2016 Co-Chair, Saarbrücken, Germany. 2nd International Workshop On Quality-Aware DevOps. Services IEEE Transactions on Cloud Computing Associate Editor. 2018- 2022 IEEE Sustainable Computing Technical Community General Chair. May 2014 – July 2015 Secretary/Treasurer. 2013 – 2014 Information Officer. 2011 – 2103 Relevant Publications R. Sala, H. Sedghani, M. Passacantando, G. Verticale, D. Ardagna. AI Applications Resource Allocation in Computing Continuum: a Stackelberg Game Approach. IEEE Transactions on Cloud Computing. 13(1), 166-183. 2025. H. Sedghani, F. Filippini, D. Ardagna. SPACE4AI-D: A Design-time Tool for AI applications Resource Selection in Computing Continua. IEEE Transactions on Services Computing. 17(6), 4324-4339. 2024. B. Guindani, D. Ardagna, A. Guglielmi, R. Rocco, G. Palermo. Integrating Bayesian Optimization and Machine Learning for the Optimal Configuration of Cloud Systems. IEEE Transactions on Cloud Computing. 12(1): 277-294. 2024. F. Filippini, J. Anselmi, D. Ardagna, B. Gaujal. A Stochastic Approach for Scheduling AI Training Jobs in GPU-based Systems. IEEE Transactions on Cloud Computing. To Appear. DOI: 0.1109/TCC.2023.3336540. F. Filippini, M. Lattuada, M. Ciavotta, A. Jahani, D. Ardagna, E. Amaldi. A Path Relinking Method for the Joint Online Scheduling and Capacity Allocation of DL Training Workloads in GPU as a Service Systems. 16(3). 1630-1646. 2023. S. Karimian-Aliabadi,  M. M. Aseman-Manzar, R. Entezari-Maleki, D. Ardagna, B. Egger, A. Movaghar. Fixed-point Iteration Approach to Spark Scalable Performance Modeling and Evaluation. IEEE Transactions on Cloud Computing. 11(1). 897-910. 2023. M. Ciavotta, G. P. Gibilisco, D. Ardagna, E. Di Nitto, M. Lattuada, M. A. Almeida da Silva. Architectural Design of Cloud Applications: a Performance-aware Cost Minimization Approach. IEEE Transactions on Cloud Computing. 10(3), 1571-1591. 2022. M. Lattuada, E. Barbierato, E. Gianniti, D. Ardagna. Optimal Resource Allocation of Cloud-Based Spark Applications. IEEE Transactions on Cloud Computing. 10(2), 1301-1316. 2022. E. Gianniti, M. Ciavotta, D. Ardagna. Optimizing Quality-Aware Big Data Applications in the Cloud. IEEE Transactions on Cloud Computing. 9(2), 737-752. 2021. D. Ardagna, M. Ciavotta, R. Lancellotti, M. Guerriero. A Hierarchical Receding Horizon Algorithm for QoS-driven control of Multi-IaaS Applications. IEEE Transactions on Cloud Computing. 9(2), 418 – 434. 2021. E. Ataie, R. Entezari-Maleki, L. Rashidi, K. S. Trivedi, D. Ardagna, A. Movaghar. Hierarchical Stochastic Models for Performance, Availability, and Power Consumption Analysis of IaaS Clouds. IEEE Transactions on Cloud Computing. 7(4), 1039-1056. 2019. J. Anselmi, D. Ardagna, J. C.S. Lui, A. Wierman, Y. Xu, Z. Yang. The Economics of the Cloud. ACM Transactions on Modeling and Performance Evaluation of Computing Systems. 2(4), 1-23. 2017. D. Ardagna, M. Ciavotta, M. Passacantando. Generalized Nash Equilibria for the Service Provisioning Problem in Multi-Cloud Systems. IEEE Transactions on Services Computing. 10(3), 381-395. 2017. D. Ardagna, B. Pernici.  Adaptive Service Composition in Flexible Processes.  IEEE Transactions on Software Engineering. 33(6), 369-384, 2007. Posted in Uncategorized | Leave a comment Search for: Current Projects Previous Projects December 2025 M T W T F S S 1234567 891011121314 15161718192021 22232425262728 293031 Prof. Danilo Ardagna Proudly powered by WordPress.",
  "content_length": 7689,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:57"
}