{
  "name": "Daniel Oliveira 0001",
  "homepage": "http://www2.ic.uff.br/~danielcmo",
  "status": "success",
  "content": "Daniel de Oliveira's Homepage Home About Me Research Interests Publications Collaborations SciCumulus Awards and Honors Bio Courses Daniel de Oliveira Assistant Professor (Prof. Adjunto I) Fluminense Federal University Computer Science Department Rua Passo da Pátria 156 - Bloco E - sala 501 São Domingos 24210240 - Niteroi, RJ - Brasil danielcmo [at] ic [dot] uff [dot] br About me Daniel de Oliveira is a professor at the Computer Science Department, Fluminense Federal University (UFF). He holds a Ph.D. (2012) and MS (2008) in Systems Engineering and Computer COPPE/UFRJ, in the database, and Bachelor (2004) in Computer Science from IM/UFRJ. He is a member of the SBC, ACM and IEEE. He has experience in the area of Computer Science, with an emphasis on databases. DBLP • Currículo Lattes • Google Scholar • BDBComp Research Interests My research interests are mainly in the area of scientific data management: scientific workflows, cloud computing , parallelism , provenance and data mining Collaborations Here is a list of people with whom I have mainly collaborated: Marta Mattoso, D.Sc., Federal University of Rio de Janeiro Alvaro Coutinho, D.Sc., Federal University of Rio de Janeiro Vanessa Braganholo, D.Sc., Fluminense Federal University Leonardo Murta, D.Sc., Fluminense Federal University Kary Ocana, D.Sc., Federal University of Rio de Janeiro Eduardo Ogasawara, D.Sc., CEFET/RJ Aline Paes, D.Sc., Fluminense Federal University Fernanda Baião, D.Sc., Federal University of The State of Rio de Janeiro Jonas Dias, M.Sc., Federal University of Rio de Janeiro Juliana Freire, Ph.D., NYU/Poly Fernando Chirigati, Ph.D. Student, NYU/Poly SciCumulus Cloud Workflow Engine SciCumulus is a cloud workflow engine designed to execute workflows in parallel in cloud environments. A major goal of SciCumulus is to take a workflow specification and provide for data parallelism automatically with runtime query provenance support. Data is fragmented from a set of parameter sweep combinations or input dataset. Parallel processing is obtained in a MapReduce (Hadoop) style, however, SciCumulus engine is supported by a workflow algebra, which allows for optimization and dynamic scheduling. Some additional libraries are necessary to execute SciCumulus such as the JDBC drivers to connect with PostgreSQL database and MPJ libraries. SciCumulus workflow engine was designed and developed at the COPPE Institute from Federal University of Rio de Janeiro in the NACAD Lab under the supervision of Professor Marta Mattoso. It is currently supported by a team with members from Fluminense Federal University, Federal University of Rio de Janeiro and CEFET/RJ For more information or to download SciCumulus please visit SciCumulus repository on SourceForge. Awards and Honors Best Paper Award: 2nd International Workshop on Cloud Computing and Scientific Applications (CCSA) In conjunction with The 12th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing - Dell Inc., in 2012. Honarable Mention - Work of Pedro Cruz Caminha (as advisor): TOP10\tpresentation among more than 624 presentations in the XXXIV Jornada Giulio Massarani de Iniciação Científica (XXXIV Conference on Young Research Assistant), at Federal University of Rio de Janeiro, Brazil, in 2012.",
  "content_length": 3275,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:27"
}