{
  "name": "Daniel Gildea",
  "homepage": "https://www.cs.rochester.edu/u/gildea",
  "status": "success",
  "content": "Daniel Gildea Daniel Gildea Professor, Computer Science, University of Rochester. Member, Center for Language Sciences and Institute for Data Science. 3019 Wegmans Hall office hours: Tu/Th 2-3pm I'm interested in statistical approaches to natural language processing, in particular for the tasks of machine translation and language understanding. CV [pdf] Teaching Spring 2025: 246/446 Machine Learning Spring 2025: 410 Optimization Seminar previous courses Research See my group and publications. Here are some recent papers: Rewarding Semantic Similarity under Optimized Alignments for AMR-to-Text Generation, Lisa Jin and Daniel Gildea. In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (ACL-22), pp. 710–715, 2022. [bib] Hierarchical Context Tagging for Utterance Rewriting, Lisa Jin, Linfeng Song, Lifeng Jin, Dong Yu, and Daniel Gildea. In Proceedings of the AAAI Conference on Artificial Intelligence (AAAI-22), pp. 10849–10857, 2022. [bib] Derivation of a natural language processing algorithm to identify febrile infants, Jeffrey P. Yaeger, Jiahao Lu, Jeremiah Jones, Ashkan Ertefaie, Kevin Fiscella, and Daniel Gildea. Journal of Hospital Medicine, 17(1):11–18, 2022. [bib] Sequence-to-sequence AMR Parsing with Ancestor Information, Chen Yu and Daniel Gildea. In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (ACL-22), pp. 571–577, 2022. [bib] Outside Computation with Superior Functions, Parker Riley and Daniel Gildea. In Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics, pp. 2936–2940, 2021. [bib] AWLCO: All-Window Length Co-Occurrence, Joshua Sobel, Noah Bertram, Chen Ding, Fatemeh Nargesian, and Daniel Gildea. In Combinatorial Pattern Matching, pp. 24:1–24:21, 2021. [bib] Tensors over Semirings for Latent-Variable Weighted Logic Programs, Esma Balkır, Shay B. Cohen, and Daniel Gildea. In International Conference on Parsing Technologies (IWPT), pp. 73–90, 2020. [bib] Efficient Outside Computation, Daniel Gildea. Computational Linguistics, 46(4):745–762, 2020. [bib] Generalized Shortest-Paths Encoders for AMR-to-Text Generation, Lisa Jin and Daniel Gildea. In Proceedings of the 28th International Conference on Computational Linguistics (COLING-2020), pp. 2004–2013, Barcelona, Spain, 2020. [bib] Evidence Integration for Multi-hop Reading Comprehension with Graph Neural Networks, Linfeng Song, Zhiguo Wang, Mo Yu, Yue Zhang, Radu Florian, and Daniel Gildea. IEEE Transactions on Knowledge and Data Engineering, pp. 631–639, 2020. [bib] gildea @ cs rochester edu January 21, 2025",
  "content_length": 2654,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:07"
}