{
  "name": "Daniel Schnurr",
  "homepage": "https://www.uni-regensburg.de/informatik-data-science/maschinelles-lernen-insb-uncertainty-quantification/startseite/index.html",
  "status": "success",
  "content": "Lehrstuhl für Maschinelles Lernen, insbes. Uncertainty Quantification - Fakultät für Informatik und Data Science - Universität Regensburg Direkt zum Inhalt Lehre Veranstaltungen und Inhalte Forschung Schwerpunkte und Publikationen Team Lehrstuhlinhaber und Mitarbeiter Kontakt Anschrift und Anfahrt Der Lehrstuhl widmet sich der Analyse von Daten als zentrale Ressource für Anwendungen des maschinellen Lernens sowie als entscheidender Wettbewerbsfaktor und Innovationstreiber in digitalen Märkten. Im Fokus der Forschung stehen die ökonomischen Auswirkungen KI-basierter Systeme, die strategischen Implikationen datengetriebener Geschäftsmodelle, die Interaktion zwischen Mensch und KI, die Erklärbarkeit und Akzeptanz maschineller Lernverfahren, empirische Datenschutzfragen sowie die technische und ökonomische Regulierung künstlicher Intelligenz. Die Messung von Unsicherheit und deren Auswirkungen auf maschinelle Lernverfahren sind in diesen Forschungsfeldern von zentraler Bedeutung. Aktuelles Seminar- Bachelor- und Masterarbeiten im Sommersemester 2026 Aktuelles | 31.12.2025 CERRE Paper: The AI Act and Technological Neutrality Aktuelles | 25.11.2025 Besuch und Forschungsaufenthalt an der University of Cambridge (DD4SC) Aktuelles | 10.11.2025 alle News Stelle als studentische Hilfskraft Aktuell suchen wir studentische Hilfskräfte, die uns in Forschung und Lehre unterstützen.Wenn Sie an der Universität Regensburg studieren und Interesse an der Mitarbeit bei uns am Lehrstuhl haben, melden Sie sich per E-Mail direkt bei Andreas Schauer (öffnet Ihr E-Mail-Programm). Lehrstuhl für Maschinelles Lernen, insbes. Uncertainty Quantification Prof. Dr. Daniel Schnurr E-Mail Adresse: sekretariat.schnurr​(at)​ur.de (öffnet Ihr E-Mail-Programm) Tel: +49 941 943 68508 (startet einen Telefonanruf, wenn Ihr Gerät dies zulässt) Standort: Bajuwarenstr. 4, BA.510 - BA.515 Wichtige Informationen: Sekretariat Laura MirbethSprechzeiten: Montag - Freitag, 9 bis 15 Uhr Weitere Infos von Lehrstuhl für Maschinelles Lernen, insbes. Uncertainty Quantification nach oben Cookie-HinweisDamit unsere Website technisch funktioniert, verwenden wir dafür erforderliche Cookies. Außerdem ermöglichen optionale Cookies eine bestmögliche Nutzung der Seite. Mit einem Häkchen geben Sie Ihr Einverständnis. Sie können jederzeit widerrufen. Mehr Infos dazu in unserer Datenschutzerklärung.ErforderlichErforderliche Cookies akzeptierenExterne Inhalte: Externe Inhalte / Cookies akzeptierenAuswahl bestätigenAlle annehmen",
  "content_length": 2506,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:37"
}