{
  "name": "Daniel Macêdo Batista",
  "homepage": "http://www.ime.usp.br/~batista",
  "status": "success",
  "content": "Professor Daniel Macêdo Batista | Batista, D. M. Daniel M. Batista Associate ProfessorInstitute of Mathematics, Statistics and Computer ScienceDepartment of Computer ScienceUniversity of São Paulo - BrazilResearch Area: Computer Networks Homepage Publications & Awards Projects Courses & Events Research Students Professor Daniel Macêdo Batista PhD in Computer Science | Associate Professor at USP Executive Coordinator of Information Technology at USP batista@ime.usp.br | Google Scholar Since 2011 Daniel Macêdo Batista is Professor at the University of São Paulo (USP), the major institution of higher learning and research in Brazil (Currently, USP is responsible for more than 20% of all scientific production in Brazil). He received his Computer Science (2003) degree from Federal University of Bahia, Brazil, MSc in Computer Science (2006) and PhD in Computer Science (2010) degrees from State University of Campinas (Unicamp), Brazil. At Unicamp, he was advised by Professor Nelson Fonseca. Prof. Daniel received the title of \"Livre Docente\", equivalent to Associate Professor, in Computer Networks from the University of São Paulo in 2017. Since 2024 he is the Executive Coordinator of Information Technology at USP. Currently, his main research interests are: IoT Security, B5G, and Data Analytics applied to Computer Networks. Prof. Daniel has published 110+ refereed papers. His masters' dissertation awarded second place at the XIV Latin American Contest of Master Thesis (2007), organized by the Latin American Center for Computer Studies. Papers derivated from his PhD received the IEEE Latincom 2011 Best Paper Award and an Honorable Mention at the XXIX Brazilian Symposium on Computer Networks and Distributed Systems (2011). Prof. Daniel advised 18 undergrad students, 10 MSc students, and 5 PhD students. His students received several awards, including the IEEE ISCC 2018 Best Student Paper Award and second place at the ACM SAC 2014 Student Research Competition. In 2020 he was the USP Representative on the World Cities World Class University (WC2) Network in the CyberSecurity theme. In 2022 and 2023 he was the secretary of the Internet Technical Committee (ITC), a joint committee of the IEEE Communications Society (ComSoc) and the Internet Society (ISOC) that stimulates interdisciplinary technical exchange, application of state of the art communications and related technologies to the Internet infrastructure and services. Since 2024 he is the vice-chair of the ITC. In addition to research on Computer Networks, Prof. Daniel is also dedicated to monitoring the undergraduate degree in Computer Science at USP. From 2018 to 2022 he was the coordinator of the undergraduate course and actively participated in the curriculum reform between 2011 and 2015. Besides his academic career, Prof. Daniel Batista graduated from the Federal Center for Technological Education of Bahia, Brazil in Electronics (1997). In the last year of the Electronics course, he was an intern at IBM. After graduate he worked as a network administrator at IBM and Banco do Nordeste. Prof. Daniel is also an amateur triathlete focused on the Olympic distance. Prof. Daniel's Curriculum Vitae is available on the Lattes Platform. Results from projects coordinated by him can be checked here. Publications & Awards Journal Papers SOUZA, C. H. M. ; PASCOAL, T. ; P. NETO, E. ; SOUSA, G. B. ; L. FILHO, F. S. ; BATISTA, D. M. ; SILVA, F. S. D. . SDN-based Solutions for Malware Analysis and Detection: State-of-the-Art, Open Issues and Research Challenges. Journal of Information Security and Applications, v. 93, p. 104145, 2025. NASAJPOUR, MOHAMMAD; POURIYEH, SEYEDAMIN; PARIZI, REZA M.; HAN, MENG; MOSAIYEBZADEH, FATEMEH; LIU, LIYUAN; XIE, YIXIN; BATISTA, DANIEL MACÊDO . Federated Learning in Smart Healthcare: A Survey of Applications, Challenges, and Future Directions. Electronics, v. 14, p. 1750, 2025. MOSAIYEBZADEH, FATEMEH ; POURIYEH, SEYEDAMIN ; HAN, MENG ; LIU, LIYUAN ; XIE, YIXIN ; ZHAO, LIANG ; BATISTA, DANIEL MACÊDO . Privacy-Preserving Federated Learning-Based Intrusion Detection System for IoHT Devices. Electronics (Special Issue \"Navigating the Digital Age: Security, Ethics and Trust in Emerging Technologies\"), v. 14, p. 67, 2025. NASAJPOUR, MOHAMMAD ; POURIYEH, SEYEDAMIN ; PARIZI, REZA M. ; HAN, MENG ; MOSAIYEBZADEH, FATEMEH ; XIE, YIXIN ; LIU, LIYUAN ; BATISTA, DANIEL MACÊDO . Advances in Application of Federated Machine Learning for Oncology and Cancer Diagnosis. INFORMATION, v. 16, p. 487, 2025. OLIVEIRA, G. W. ; NOGUEIRA, M. ; SANTOS, A. L. ; BATISTA, D. M. . Intelligent VNF Placement to Mitigate DDoS Attacks on Industrial IoT. IEEE Transactions on Network and Service Management, v. 20, number 2, p. 1319-1331, 2023. MOSAIYEBZADEH, F. ; POURIYEH, S. ; PARIZI, R. M. ; SHENG, Q. Z. ; HAN, M. ; ZHAO, L. ; SANNINO, G. ; RANIERI, C. M. ; UEYAMA, J. ; BATISTA, D. M. . Privacy-Enhancing Technologies in Federated Learning for the Internet of Healthcare Things: A Survey. Electronics (Special Issue \"IoT for Healthcare and Wellbeing: Trends, Challenges, and Applications\"), v. 12, p. 2703, 2023. RODRIGUEZ, L. G. A. ; BATISTA, D. M. . Resource-intensive Fuzzing for MQTT Brokers: State of the Art, Performance Evaluation, and Open Issues. IEEE Networking Letters, v. 5, p. 100-104, 2023. CUNHA, B. C.; BATISTA, D. M. . Avaliação da Integração do Protocolo MQTT em uma Plataforma de Cidades Inteligentes. Revista Eletrônica de Iniciação Científica em Computação, v. 20, number 2, 2022. TININI, R. I.; BATISTA, D. M.; FIGUEIREDO, G. B.; TORNATORE, M.; MUKHERJEE, B. . Energy-Efficient vBBU Migration and Wavelength Reassignment in Cloud-Fog RAN. IEEE Transactions on Green Communications and Networking., v. 5, issue 1, 2021. TININI, R. I. ; SANTOS, M. R. P. ; FIGUEIREDO, G. B. ; BATISTA, D. M. . 5GPy: A SimPy-based Simulator for Performance Evaluations in 5G Hybrid Cloud-Fog RAN Architectures. SIMULATION MODELLING PRACTICE AND THEORY, v. 101, p. 102030, 2020. TININI, R. I. ; BATISTA, D. M. ; FIGUEIREDO, GUSTAVO BITTENCOURT ; TORNATORE, M. ; MUKHERJEE, B. . Low-Latency and Energy-Efficient BBU Placement and VPON Formation in Virtualized Cloud-Fog RAN. Journal of Optical Communications and Networking, v. 11, p. B37-B48, 2019. MOTA, RAFAEL PERAZZO BARBOSA ; BATISTA, DANIEL MACEDO . An RFID Best Effort Mechanism for in Motion Tracking Applications. International Journal of Wireless Networks and Broadband Technologies, v. 7, p. 39-52, 2018. MONTERO QUISPE, KEVIN ; SOUSA LIMA, WESLLEN ; MACÊDO BATISTA, DANIEL ; SOUTO, EDUARDO . MBOSS: A Symbolic Representation of Human Activity Recognition Using Mobile Sensors. SENSORS, v. 18, p. 4354, 2018. GUIMARAES, F. P. ; RODRIGUES, G. N. ; ALI, R. ; BATISTA, D. M. . Planning Runtime Adaptation through Pragmatic Goal Model. DATA & KNOWLEDGE ENGINEERING, v. 109, p. 25-40, 2017. BATISTA, D. M.; OLGUIN, G. S. ; SOUZA, J. J. ; PINA, J. C. ; CAMPOS, P. P. V. ; GNANN, W. A. M. . Processo Coletivo de reformulação curricular do BCC-IME-USP. Revista de Graduação USP, v. 2, p. 127-136, 2017. RODRIGUEZ, E. ; ALKMIM, G. P. ; FONSECA, N. L. S. ; BATISTA, D. M. . Energy-Aware Mapping and Live Migration of Virtual Networks. IEEE Systems Journal, v. 11, p. 637-648, 2017. BOUTABA, R. ; HUTCHISON, D. ; JAIN, R. ; RAMJEE, R. ; ROTHENBERG, C. E. ; BLAIR, G. ; KON, F. ; BATISTA, D. M. . Perspectives on software-defined networks: interviews with five leading scientists from the networking community. Journal of Internet Services and Applications, v. 6, p. 22, 2015. GUIMARAES, FELIPE PONTES ; CÉLESTIN, PEDRO ; BATISTA, DANIEL MACEDO ; RODRIGUES, GENAÍNA NUNES ; DE MELO, ALBA CRISTINA MAGALHAES ALVES . A Framework for Adaptive Fault-Tolerant Execution of Workflows in the Grid: Empirical and Theoretical Analysis. Journal of Grid Computing, v. 12, p. 127-151, 2014. ALKMIM, G. P. ; BATISTA, D. M. ; FONSECA, N. L. S. . Mapping Virtual Networks onto Substrate Networks. Journal of Internet Services and Applications, v. 4, p. 1-15, 2013. RODRIGUEZ, E. ; ALKMIM, G. P. ; BATISTA, D. M. ; FONSECA, N. L. S. . Trade-off Between Bandwidth and Energy Consumption Minimization in Virtual Network Mapping. IEEE Latin America Transactions, v. 11, p. 983-988, 2013. LIMA CURI, RAFAEL ; MACEDO BATISTA, DANIEL ; LUIS SALDANHA DA FONSECA, NELSON . Robust Hybrid Mechanisms for Scheduling of Grid Tasks. IEEE Latin America Transactions, v. 10, p. 1940-1946, 2012. BATISTA, D. M.; FONSECA, N. L. S. . Robust Scheduler for Grid Networks under Uncertainties of Both Application Demands and Resource Availability. Computer Networks (1999), v. 55, p. 3-19, 2011. BATISTA, D. M.; FONSECA, N. L. S. . Scheduling Grid Tasks in Face of Uncertain Communication Demands. IEEE eTransactions on Network and Service Management, v. 8, p. 92-103, 2011. CHAVES A., Cesar G. ; BATISTA, D. M. ; FONSECA, N. L. S. . Scheduling Grid Applications with Software Requirements. IEEE Latin America Transactions, v. 9, p. 578-585, 2011. Sakr, Sherif ; Liu, Anna ; BATISTA, D. M. ; Alomari, Mohammad . A Survey of Large Scale Data Management Approaches in Cloud Environments. IEEE Communications Surveys and Tutorials, v. 13, p. 311-336, 2011. BATISTA, D. M.; CHAVES, L. J. ; FONSECA, N. L. S. ; ZIVIANI, A. . Performance analysis of available bandwidth estimation tools for grid networks. Journal of Supercomputing, v. 53, p. 103-121, 2010. BATISTA, D. M.; FONSECA, N. L. S. . A Survey of Self-adaptive Grids. IEEE Communications Magazine (Print), v. 48, p. 94-100, 2010. BATISTA, D. M.; FONSECA, N. L. S. ; MIYAZAWA, F. K. ; GRANELLI, F . Self-adjustment of resource allocation for grid applications. Computer Networks, v. 52, p. 1762-1781, 2008. FIGUEIREDO, G. B. ; BATISTA, D. M. ; FIGUEIREDO, M. E. B. . Estudo de QoS IP sobre redes ATM. NewsGeneration (Online), v. 5, p. 1-5, 2001. Awards 2025 - Best Paper Award: IEEE LATINCOM 2025. Paper 'An Efficient Multi-stage Pipeline for IIoT Threat Detection' 2025 - Honorable Mention (Undergrad student): Ivan G",
  "content_length": 23017,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:25"
}