{
  "name": "Daniel J. Hsu",
  "homepage": "http://www.cs.columbia.edu/~djhsu",
  "status": "success",
  "content": "Daniel J. Hsu - Department of Computer Science and Data Science Institute, Columbia University I work on algorithmic statistics and machine learning. My research is part of broader efforts in Foundations of Data Science, Machine Learning, and Theory of Computation at Columbia. If you are a (current or prospective) student interested in coming to Columbia and/or working with me on research, or if you are generally interested in getting started in machine learning and/or research, please check this page of frequent answers to questions. My papers can be found by following this link. (See also arXiv, dblp, Google Scholar.) Slides from recent Science Research Fellows Seminar talk People I’m lucky to be able to work with several outstanding students and postdocs. Students Alejandro Buendia (B.S., 2019; → Microsoft/MIT/Columbia → Stanford) Arushi Gupta (B.S., 2016; M.S., 2018; → Princeton) Berkan Ottlik (B.S., 2024; → Hawaii Farming → Univ. of Pennsylvania) Clayton Sanford (Ph.D., 2024; → Google Research) Eden Shaveet (Bridge-to-Ph.D. program, 2024; → Cornell Tech) Edward Ri (B.S., 2024; → Princeton) Geelon So (M.S., 2019; → UC San Diego) Giannis Karamanolakis (Ph.D., 2022; → Amazon Alexa AI) Jagdeep Bhatia (High school diploma, 2020; → MIT) Ji Xu (Ph.D., 2020; → Two Sigma) Jingwen Liu (Ph.D. in progress) Kevin Shi (Ph.D., 2020; → Facebook) Kiran Vodrahalli (Ph.D., 2022; → Google Brain) Mingyue Xu (M.S., 2022; → Purdue) Navid Ardeshir (Ph.D., 2025; → Citadel) Noah Bergam (Ph.D. in progress) Rishabh Dudeja (Ph.D., 2021; → Harvard → Univ. of Wisconsin) Samuel Deng (M.S., 2021; Ph.D. in progress) Postdocs Christopher Tosh (→ Memorial Sloan-Kettering Cancer Center) Daniel G. Alabi (→ Univ. of Illinois Urbana-Champaign) Debmalya Mandal (→ MPI-SWS → Univ. of Warwick) I’ve also worked with other fantastic students on their thesis research, including: Avner May, Cun Mu, Gan Yuan, José Manuel Zorrilla Matilla, Karl Stratos, Mathias Lécuyer, Tom Effland. Service Associate editor / action editor ACM Transactions on Algorithms (2017–) Journal of Machine Learning Research (2022–) SIAM Journal on Mathematics of Data Science (2021–) Conference program chair International Conference on Algorithmic Learning Theory (2024; co-chair with Claire Vernade) Conference on Learning Theory (2019; co-chair with Alina Beygelzimer) International Conference on Machine Learning (2025; co-chair with Maryam Fazel, Simon Lacoste-Julien, and Virginia Smith) Conference program committee member AAAI Conference on Artificial Intelligence (2014) International Conference on Artificial Intelligence and Statistics (2010, 2011, 2016 AC, 2017 AC, 2019 AC) International Conference on Algorithmic Learning Theory (2017, 2018, 2019, 2021, 2022 AC, 2023 AC) Conference on Learning Theory (2011, 2013, 2015, 2016, 2017, 2018, 2020 AC, 2021 AC, 2022 AC, 2023 AC, 2024 AC) IEEE Symposium on Foundations of Computer Science (2021) International Conference on Machine Learning (2010, 2011, 2012 AC, 2013 AC, 2015 AC, 2016 AC, 2017 AC) Conference on Neural Information Processing Systems (2008, 2011, 2012 AC, 2013 AC, 2014, 2015, 2017 AC, 2019 SAC, 2020, 2021 SAC, 2023 SAC) Conference on Uncertainty in Artificial Intelligence (2010) Program / workshop / seminar organization Columbia Foundations of Data Science Center Tutorials (May 2, 2025) Columbia Foundations of Data Science Center Workshop (April 29, 2025) Simons Institute Program on Modern Paradigms in Generalization (Fall 2024) Columbia Foundations of Data Science Center Workshop (April 26, 2024) Columbia Statistical Machine Learning Symposium (April 7–8, 2023) FOCS Workshop on Machine Learning (February 7–8, 2022) Columbia Year of Statistical Machine Learning (Fall 2019–Spring 2020) Columbia DSI/TRIPODS Deep Learning Workshop (March 15, 2019) Columbia Foundations of Data Science Seminar (Fall 2015) ICML Workshop on Method of Moments and Spectral Learning (June 25, 2014) DIMACS Workshop on Systems and Analytics of Big Data (March 17–18, 2014) NeurIPS Workshop on Spectral Learning (December 10, 2013) ICML Workshop on Spectral Learning (June 21, 2013) Teaching Courses at Columbia Computational Linear Algebra Machine Learning Machine Learning Theory Theoretical Foundations of LLMs Topics in Learning Theory Unsupervised Learning (previously “Advanced Machine Learning”) Tutorials Columbia TRIPODS Bootcamp Lectures 2018 Machine Learning Summer School 2018 Simons Institute Foundations of Machine Learning Boot Camp AAAI 2014 Tensor decompositions for learning latent variable models ICML 2013 Tensor decomposition methods for latent variable model estimation Thanks I am grateful for support provided by the National Science Foundation, the Office of Naval Research, the National Aeronautics and Space Administration, the Alfred P. Sloan Foundation, the Columbia Center of Artificial Intelligence Technology, the Columbia Data Science Institute, Bloomberg, Google, Google.org, JP Morgan, NVIDIA, Two Sigma, and Yahoo. Google.org Scientific Progress Award Columbia Center of Artificial Intelligence Technology NSF MFAI: Emergence of features in modern machine learning ONR: Multi-group machine learning—theory and algorithms NSF IIS: Towards Causal Fair Decision-making TRIPODS: From Foundations to Practice of Data Science and Back [website] NSF IIS: Adaptive Information Extraction from Social Media [website] NSF DMREF: Deblurring our View of Atomic Arrangements in Complex Materials Sloan Research Fellowship Columbia DSI Data Science Interdisciplinary ROADS Grant Bloomberg Data Science Research Grant Google Faculty Research Award JP Morgan Faculty Award Two Sigma Research Gift Yahoo Faculty and Research Engagement Program Award",
  "content_length": 5772,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:13"
}