{
  "name": "Danny Kowerko",
  "homepage": "https://www.tu-chemnitz.de/informatik/mc/professor.php",
  "status": "success",
  "content": "Leiter der Arbeitsgruppe | Die Arbeitsgruppe | Media Computing | Fakultät für Informatik | TU Chemnitz Leiter der Arbeitsgruppe | Die Arbeitsgruppe | Media Computing | Fakultät für Informatik | TU Chemnitz Leiter der Arbeitsgruppe Media Computing Seit 04/2025 ist Media Computing eine Arbeitsgruppe innerhalb der Professur Medieninformatik von Prof. Dr. Maximilian Eibl. Prof. Dr. Danny Kowerko Telefon: +49 371 531-35660 E-Mail: danny.kowerko@… Adresse: Straße der Nationen 62, 09111 Chemnitz Raum: A10.274 (alt: 1/274) Profile: Researchgate Zotero - Talks and Publications Orcid - Research ID Github Matlab File Exchange Web of Science - Review Activities Linkedin Geschichte von Media Computing Jun.-Prof. Dr. Danny Kowerko, Leiter der Juniorprofessur \"Media Computing\" 04/2019 - 03/2025 Prof. Dr. Marc Ritter, Leitender Juniorprofessor der Juniorprofessur \"Media Computing\" von 07/2014 - 08/2016 Die Stiftungsjuniorprofessur wurde im Juli 2014 besetzt. Weitere Informationen unter: localize-it Während des Zeitraums vom 01.09.2016 bis 31.03.2019 leitete Dr. Danny Kowerko als Interims-Projektleiter die Juniorprofessur Media Computing. TUCaktuell Bessere medizinische Versorgung von diabetischen Augenerkrankungen durch KI TU Chemnitz beteiligt sich an von Bundesministerium für Bildung und Forschung mit über elf Millionen Euro geförderten Forschungsprojekt zum Aufbau einer Forschungsdaten-Infrastruktur für zuverlässigere und KI-basierte Verlaufsmodellierungen bei Diabetes-bedingten Augenkrankheiten … Motivation ist alles Der diesjährige Tag des wissenschaftlichen Nachwuchses am 5. November 2020 stand stark unter dem Einfluss der Pandemie-Situation und widmete sich drängenden Fragen rund um die Promotion und die akademische Karriere - Im Fokus: das Thema \"Motivation\" … Gestaltung der Kooperation in den Bereichen Industrie 4.0 und Mitarbeiterentwicklung für die Smarte Produktion TU Chemnitz und BMW Group Werk Leipzig führten im zweiten Quartal 2024 einen ersten \"Transdisziplinären Forschungsworkshop\" zur Abstimmung der weiteren Zusammenarbeit durch … Spannende Vorweihnachtszeit mit Chemie, Mathe, Physik und Informatik Mit allen Sinnen genießen: TU Chemnitz lädt am 3., 17., 18. und 19. Dezember 2025 zu insgesamt fünf Weihnachtsvorlesungen ein … Mehr Artikel anzeigen Alle Artikel anzeigen Veranstaltungen & Tipps Naturwissenschaften 01.12.2025 01 Dez Von Unordnung zur Topologie: Innovationen im Verständnis komplexer Spinsysteme Dieser Workshop wird im Rahmen des SPARC-GIANT-Projekts „Effekte starker … TU Chemnitz 03.12.2025 03 Dez TUCweihnachtsmarkt Stimmen Sie sich mit uns bei einem weihnachtlichen Programm für Groß und Klein auf die Advents- und … TU Chemnitz 10.12.2025 10 Dez Kinderweihnachtsfeier Am 10.12.2025 erwartet alle Kids der Technischen Universität Chemnitz und des Studentenwerks … Naturwissenschaften 10.12.2025 10 Dez TUC erklärt Nobelpreise Im Rahmen dieser Veranstaltung werden die diesjährigen Nobelpreise in Physik und Chemie für die … Mathematik 17.12.2025 17 Dez Weihnachtsvorlesung Mathematik \"Weihnachtliche Strömungen : wenn Mathematik ins … Wie lassen sich beispielsweise winterliche Luftströmungen in der … Naturwissenschaften 18.12.2025 18 Dez Weihnachtsvorlesung der Physik: \"Alles fließt - πάντα ῥεῖ -\" Weihnachtsvorlesung, in der physikalische Sachverhalte mit Hilfe vieler … Veranstaltungskalender Veranstaltungskalender Mehr Artikel anzeigen Alle Artikel anzeigen Soziale Medien 🏆 Die TU Chemnitz ehrte am 27. November herausragende Leistungen ihrer Mitglieder: 28 Preise in den Kategorien Studium, Lehre, Forschung, Transfer und Engagement, die jeweils mit… 💡 Beim 12. Tag des wissenschaftlichen Nachwuchses an der #TUChemnitz kamen zahlreiche Nachwuchsforschende, Promovierende, Promovierte und Interessierte zusammen, um spannende… ♟️ Erfolgreich auf ganzer Linie: Das Team der Fakultät für Mathematik der #TUChemnitz hat beim Firmenschachturnier 2025 erneut den 🥇 1. Platz belegt! Beim von der axilaris GmbH… 🕯️ Die TU Chemnitz setzt am 9. November 2025 einen „Lichtpunkt“ gegen das Vergessen und beteiligt sich an der stadtweiten Gedenkaktion an die Opfer der Reichspogromnacht. Im… Verbinde dich mit uns: Vorschaltseite",
  "content_length": 4186,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:57"
}