{
  "name": "Danny Yuxing Huang",
  "homepage": "https://engineering.nyu.edu/faculty/danny-yuxing-huang",
  "status": "success",
  "content": "Danny Yuxing Huang | NYU Tandon School of Engineering Skip to Main Content Search NYU Tandon Fulltext search Looking for News or Events? Danny Yuxing Huang , Ph.D. Assistant Professor NYU Center for Cybersecurity (CCS) Electrical and Computer Engineering Computer Science and Engineering Center for Urban Science + Progress Center for Advanced Technology in Telecommunications (CATT) Connect Email dhuang [at] nyu.edu Websites Lab Website RouterSense Website IoT Inspector Website IoT Inspector (GitHub) Danny Y. Huang is broadly interested in the following research areas: health, AI/ML, privacy: see RouterSense (passive patient monitoring with just network traffic) helping victims of tech-enabled abuse: e.g., improving large language models and building tools to detect hidden devices (such as IoT Inspector) Before joining NYU, he was a postdoctoral fellow at Princeton University. He obtained a Ph.D. in Computer Science from University of California, San Diego, where he wrote a dissertation on using cryptocurrencies to study cyber-criminal activities. He graduated from Williams College (Massachusetts) with a BA in Computer Science. Visit website Mentee Guidelines Research Interests health, AI, machine learning, data, security, privacy Research News View More NYU Tandon researchers adapt cybersecurity tool to monitor health through smartphone traffic Borrowing a cybersecurity technique originally designed to catch malware, researchers at NYU Tandon School of Engineering have developed a new tool for monitoring human health without invasive wearables or unreliable self-reporting. The method, dubbed RouterSense, passively analyzes encrypted network traffic on a person's smartphone or other digital device, tracking their digital behaviors to potentially shed light on conditions ranging from mental health struggles in young adults to early signs of Alzheimer's disease. \"Traffic patterns serve as proxies for digital biomarkers,\" explained Danny Huang, the project’s senior researcher. \"Screen time indicates sleep patterns, texting frequency reflects social interaction, and app usage reveals productivity rhythms, for example.\" Huang is an NYU Tandon assistant professor with appointments in the Electrical and Computer Engineering Department (ECE) and in the Computer Science and Engineering Department. He is also on the faculties of the NYU Center for Cybersecurity, the Center for Urban Science + Progress and the Center for Advanced Technology in Telecommunications. Because the system only captures metadata — information about digital activity such as which apps are contacted rather than the activity itself — it never sees any actual content, keeping the person's messages, videos, and other online activity private. The approach works across a diverse set of devices: phones, tablets, PCs, whether they run on Apple, Android, or Windows systems. The analysis RouterSense employs has long been used in cybersecurity to spot malware by detecting unusual communication patterns, such as a device suddenly sending data to an unknown server or making suspicious connection requests. RouterSense flips this, tracking an individual's normal smartphone patterns instead of flagging threats. \"For the past fifteen years, I've been using network traffic analysis to understand how cybercriminals behave,\" said Huang. \"My prior work has demonstrated that network traffic analysis could reveal behavioral patterns at scale while protecting privacy, lessons we're now applying to healthcare.\" The research, recently released as a preprint in the Journal of Medical Internet Research, promises notable benefits over current standard health monitoring. Self reports are often riddled with recall bias. Intrusive sensors and smartphone apps can drain batteries and make people acutely aware they're being monitored. RouterSense, by contrast, is low-cost, unobtrusive, and scalable to large populations. In a proof-of-concept study, 38 NYU students installed a VPN app on their smartphones for two weeks, which routed all their internet traffic through a research server in an NYU lab for analysis. Of the 29 participants who contributed valid data, 27 remained active for more than five days, contributing an average of over 300 hours of monitored network traffic. The system successfully captured daily activity rhythms and lifestyle patterns, including gaming habits and late-night food delivery use, demonstrating the feasibility of passive monitoring. Participants reported the system was easy to use with many noting they forgot they were being monitored. \"Our approach allows us to increase the bandwidth of patient monitoring for months to years,\" said lead author Rameen Mahmood, an NYU Tandon ECE Ph.D. candidate. \"Network traffic analysis lets us do passive monitoring 24-7 over an extended period of time, which hasn't really been done before.\" This visualization showcases data from two participants in the researchers' 14-day pilot study with 27 NYU students. Each ring represents a full day of passively monitored internet activity from their mobile phones. The dots illustrate 10-minute intervals of internet usage, with red indicating high activity and blue indicating low activity. Notice the clear difference in patterns: Participant A demonstrates a consistent daily routine, including a regular sleep schedule (the prominent blue region at night), while Participant B's activity is more varied. Click to view larger image. The NYU Tandon study's success in demonstrating feasibility and acceptability has paved the way for clinical applications. The researchers are now recruiting individuals with pre-Alzheimer's conditions for a 30-day monitoring study comparing their network traffic patterns with healthy controls, the crucial next step in determining whether RouterSense can detect early signs of cognitive decline. Other areas the researchers plan to explore include digital behaviors related to mindless eating and brain development in younger populations. In addition to Huang, Mahmood and Kaye, the paper’s authors are Donghan Hu and Annabelle David (NYU Tandon), Zachary Beattie (Oregon Health & Science University), Nabil Alshurafa (Northwestern University), Lou Haux (Max Planck Institute for Human Development), Josiah Hester (Georgia Institute of Technology), Andrew Kiselica (University of Georgia), Shinan Liu (University of Hong Kong), and Chenxi Qiu and Chao-Yi Wu (Harvard Medical School). Read the article October 9, 2025 NYU Tandon researchers develop simple, low-cost method to detect GPS trackers hidden in vehicles, empowering cyberstalking victims A team of researchers at NYU Tandon School of Engineering has developed a novel method to detect hidden GPS tracking devices in vehicles, offering new hope to victims of technology-enabled domestic abuse. Overseen by NYU Tandon assistant professor Danny Y. Huang, the research addresses a growing problem: abusers secretly placing GPS trackers in their partners' or ex-partners' vehicles to monitor their movements. Traditionally, detecting these devices has been difficult and expensive, leaving many victims vulnerable to continued surveillance. \"The tech industry has created many tools that can be repurposed for cyberstalking, but has invested far less in technologies that protect privacy,\" said Huang. “We believe this innovation has the potential to significantly empower victims of domestic abuse by providing them with a readily accessible way to regain their privacy and safety.\" Huang holds appointments in both the Electrical & Computer Engineering and Computer Science & Engineering departments. He is also a member of NYU Center for Cybersecurity, NYU Tandon's Center for Urban Science + Progress, and Center for Advanced Technology in Telecommunications. \"GPS tracking in domestic abuse situations is unfortunately common,\" said Moshe (Mo) Satt, a Ph.D. candidate working under Huang who is the lead author on the research paper that he will present at USENIX VehicleSec '25, a major cybersecurity conference, in August 2025. Satt is the Chief Information Security Officer (CISO) at the NYC Department of Sanitation and teaches several cybersecurity courses at the graduate and undergraduate levels as an NYU Tandon adjunct faculty member. \"We wanted to develop a tool to combat it that is inexpensive and potentially very user-friendly.\" The team's innovative approach relies on tinySA, a $150 palm-sized spectrum analyzer typically used by amateur radio enthusiasts for testing antennas and debugging wireless equipment. Using this commercially-available device, the researchers developed a specialized algorithm that distinguishes weak tracker signals amid cellular transmission noise by monitoring LTE IoT uplink frequency bands. This approach — the first to reliably detect concealed 4G LTE IoT cellular GPS vehicle trackers using affordable equipment — isolates signals sent from concealed devices to nearby cell towers, solving technical challenges in determining which frequencies to scan, interpreting results, and filtering false positives. For victims, the setup can potentially be used as a mobile detection system while driving. If the user observes regular signal peaks on the tinySA during or after a drive, they can likely identify the presence of a cellular GPS tracker without requiring technical expertise. The setup could detect hidden GPS tracker signals within a range of up to three feet, according to the study. The research addresses a significant public safety concern affecting approximately 13.5 million stalking victims annually in the United States, 80 percent experiencing technological stalking. In some cases, this surveillance has led to violent attacks. The researchers are developing several pathways to real-world implementation, including smartphone integration, automated \"black box\" detection systems that could notify the user if a tracker is detected, partnerships with abuse support organizations, and a mobile detection service mo",
  "content_length": 20170,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:59"
}