{
  "name": "Danny Chen",
  "homepage": "http://www3.nd.edu/~dchen",
  "status": "success",
  "content": "Notre Dame Computer Science and Engineering Danny Ziyi Chen Department of Computer Science and Engineering University of Notre Dame Notre Dame, IN 46556, USA Phone: (574) 631-8804 FAX: (574) 631-9260 dchen@nd.edu http://www3.nd.edu/~dchen/ Professor (Ph. D., Purdue University, West Lafayette, 1992) Dr. Danny Ziyi Chen received the B.S. degrees in Computer Science and in Mathematics from the University of San Francisco, California, in 1985, and the M.S. and Ph.D. degrees in Computer Science from Purdue University, West Lafayette, Indiana, in 1988 and 1992, respectively. He has been on the faculty of the Department of Computer Science and Engineering at the University of Notre Dame, Indiana since 1992, and is currently a Professor of Computer Science and Engineering and a Concurrent Professor in the Department of Applied and Computational Mathematics and Statistics. Dr. Chen's main research interests are in the areas of algorithm design, analysis, and implementation, computational geometry, computational biomedicine, biomedical imaging, machine learning, data mining, parallel and distributed computing, and VLSI design. Dr. Chen has developed numerous efficient algorithms for solving geometric, graph-theoretical, combinatorial, and application problems, and has published in total over 330 journal papers, conference papers, and book chapters in these areas. He also holds 5 US patents for technology development in computer science and engineering and biomedical applications. Dr. Chen has given many invited talks on his research work at conferences, research institutes, and computer science departments in the US, Canada, Europe, and Asia. He served on program committees of a number of international conferences. He was invited to conduct research at the Leonardo Fibonacci Institute, Trento, Italy in the summer of 1992, the Max-Planck-Institut fur Informatik in Saarbrucken, Germany in the summer of 1994, and the Center for Applied Science and Engineering and Institute of Information Science, Academia Sinica, Nankang, Taiwan in the summer of 1996. He was a Visiting Professor at the Hong Kong University of Science and Technology (HKUST), Hong Kong in 2003, a Visiting Professor at Tsinghua University, Beijing, China in 2012, and Visiting Professor at Zhejiang University, Hangzhou, China in 2012. He served on review panels of research proposals for the Numeric, Symbolic, and Geometric Computation (NSG) Program and the Theory of Computing (TOC) Program in the Division of Computing and Communication Foundations (CCF), the National Science Foundation (NSF). Dr. Chen received the Faculty Early Career Development (CAREER) Award of the US National Science Foundation in 1996. He received the Kaneb Teaching Award of the Department of Computer Science and Engineering at the University of Notre Dame in 2004, the James A. Burns, C.S.C. Award for Graduate Education of the University of Notre Dame in 2009, and the Outstanding Faculty Teaching Award of the Department of Computer Science and Engineering at the University of Notre Dame in 2012. His work on \"Arc-Modulated Radiation Therapy\" has been selected as a Laureate in the 2011 Computerworld Honors Program. Dr. Chen is a fellow of the Institute of Electrical and Electronics Engineers (IEEE) and a distinguished scientist of the Association for Computing Machinery (ACM). Research Projects: Computational Geometry Algorithms for Medical Problems in Radiation Therapy and Medical Imaging, and AF: Small: Algorithmic Problems in Applied Computational Geometry, supported in part by National Science Foundation (NSF) National Institute of Biomedical Imaging and Bioengineering, NIH CURRICULUM VITAE CSE Home Page",
  "content_length": 3695,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:58"
}