{
  "name": "Danqi Chen 0001",
  "homepage": "https://www.cs.princeton.edu/~danqic",
  "status": "success",
  "content": "Danqi Chen's Homepage Danqi Chen How to pronounce? My first name can be pronounced as \"dan-/'chE/\" and here is a standard Chinese pronunciation: Associate Professor of Computer Science Princeton NLP Group Princeton Language and Intelligence Email: danqic@cs.princeton.edu Office: Computer Science 412 Papers / Lab / Teaching & Service / Awards / Etc I am an associate professor of Computer Science at Princeton University and I co-lead the Princeton NLP Group. I am also an associate director of Princeton Language and Intelligence (PLI). Previously, I was a visiting scientist at Facebook AI Research (FAIR) in Seattle, working with Luke Zettlemoyer. I received my Ph.D. in Computer Science from Stanford University in 2018, where I was advised by Christopher Manning and worked in the Stanford NLP Group. Before that, I was an undergraduate student in the Special Pilot CS Class supervised by Andrew Yao at Tsinghua University. My research explores the full life cycle of language models—how we build, align, and understand them—with a focus on developing methods that democratize their creation and deployment. I am currently on sabbatical leave from Princeton University, working as a member of technical staff at Thinking Machines Lab. Education / Experience 2012-2018: Ph.D. in Computer Science, Stanford University 2008-2012: B.Eng in Computer Science, Tsinghua University 2010 Fall: Exchange student at Hong Kong University of Science and Technology 2019/2-2019/8: Visiting scientist at Facebook AI Research, Seattle 2019/2-2019/8: Visiting researcher at University of Washington, Seattle 2016/10-2016/12: Research intern at Facebook AI Research, NYC 2014/7-2014/9: Research intern at Microsoft Research, Redmond 2011/2-2012/5: Research intern at Microsoft Research Asia, Beijing Last update: October 2025",
  "content_length": 1813,
  "method": "requests",
  "crawl_time": "2025-12-01 12:57:59"
}