{
  "name": "Danula Hettiachchi",
  "homepage": "https://www.danulahettiachchi.com",
  "status": "success",
  "content": "Danula Hettiachchi Building 14 124 La Trobe Street Melbourne, Victoria 3000 I am a Lecturer (i.e., Assistant Professor) at the School of Computing Technologies, RMIT University and a researcher interested in Crowdsourcing, Social Computing, Responsible AI and Human-Computer Interaction. I am an Associate Investigator at the ARC Centre of Excellence for Automated Decision-Making and Society (ADM+S), a cross-disciplinary, national research centre in Australia, where I previously worked as a Research Fellow. I completed my PhD on data quality in crowdsourcing at the School of Computing and Information Systems, The University of Melbourne, where I was part of the Human-Computer Interaction (HCI) group. During my PhD, I worked as an Applied Scientist Intern at Amazon (AWS), a Causal Academic at the School of Computing and Information Systems, and the Manager of User Experience Lab, where I supported a wide range of HCI research projects. I have previously worked as a Full-Stack Software Engineer, primarily focused on data engineering and analytics. Find my up-to-date CV here. Watch a 3-minute summary of my latest research here. Sep 04, 2025 Serving as Tack Chair for Responsible Web at The Web Conference 2026 with Bhaskar Mitra. Submit your full papers by 7th October 2025. Jun 13, 2025 Thrilled to receive funding from 2025 Google Research Scholar Program for “Addressing Misunderstanding of AI Explanations Through Follow-up Interactions and Multi-modal Explainers” with Kacper Sokol. Feb 12, 2025 Attended The 4th Strategic Workshop on Information Retrieval in Lorne (SWIRL), which brings together top researchers in the field of Information Retrieval to discuss the latest research trends and challenges. Dec 01, 2024 Great to be at OzCHI 2024 in Brisbane, co-organising the Unmaking AI: Engaging Critically and Creatively with Generative AI Workshop. Sep 04, 2024 Check our new Conversation news article on e-scooter ban in Melbourne, written based on research led by Hiruni Kegalle.",
  "content_length": 2002,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:00"
}