{
  "name": "Daoce Wang",
  "homepage": "https://www.daocewang.com",
  "status": "success",
  "content": "Daoce Wang 王道策 | homepage Daoce Wang 王道策 Assistant Professor Department of Computer Science University of Nebraska Omaha Email: daocewang@unomaha.edu Download CV Biography Dr. Daoce Wang is an Assistant Professor in the Department of Computer Science at the University of Nebraska Omaha. He received his B.S., M.S., and Ph.D. degrees in Computer Science/Engineering from the University of Electronic Science and Technology of China (UESTC, 2018), the University of Florida (UFL, 2020), and Indiana University Bloomington (IUB, 2025, advised by Dr. Dingwen Tao and Dr. Fengguang Song). Dr. Daoce Wang was a summer research intern at Los Alamos National Laboratory in 2021, 2022, 2023, and 2024. His research interests include high-performance computing (HPC), scientific data management and analytics, scientific data compression and visualization, and high-performance machine learning. Over the past five years, he has published over ten papers in top-tier venues in computer systems and AI, including SC, PPoPP, TPDS, HPDC, ICS, EuroSys, and NeurIPS. Research High-performance Computing Scientific Data Analytics & Management Data Reduction & Lossy Compression Scientific Visualization High-performance Machine Learning Education Ph.D. in Computer Engineering Indiana University, Bloomington, IN (2022 - 2025) Advisors: Dr. Fengguang Song and Dr. Dingwen Tao Ph.D. Candidate in Computer Science Washington State University, Pullman, WA (2020 - 2022) Advisor: Dr. Dingwen Tao M.S. in Computer Science University of Florida, Gainesville, FL (2020) B.S. in Computer Science and Engineering University of Electronic Science and Technology of China, Chengdu, China (2018) Selected Publications SC ‘25 Daoce Wang, Pascal Grosset, Jesus Pulido, Jiannan Tian, Tushar M. Athawale, Jinda Jia, Baixi Sun, Boyuan Zhang, Sian Jin, Kai Zhao, James Ahrens, and Fengguang Song. STZ: A High Quality and High Speed Streaming Lossy Compression Framework for Scientific Data. The International Conference for High Performance Computing, Networking, Storage, and Analysis, St. Louis, MO, USA, November 16–21, 2025. SC ‘24 Daoce Wang, Pascal Grosset, Jesus Pulido, Tushar M. Athawale, Jiannan Tian, Kai Zhao, Zarija Lukic, Axel Huebl, Zhe Wang, James Ahrens, and Dingwen Tao. A High-Quality Workflow for Multi-Resolution Scientific Data Reduction and Visualization. The International Conference for High Performance Computing, Networking, Storage, and Analysis, Atlanta, GA, USA, November 17–22, 2024. TPDS ‘24 Daoce Wang, Jesus Pulido, Pascal Grosset, Jiannan Tian, Sian Jin, Kai Zhao, James Ahrens, and Dingwen Tao. TAC+: Optimizing Error-Bounded Lossy Compression for 3D AMR Simulation. IEEE Transactions on Parallel and Distributed Systems, impact factor: 5.3 SC ‘23 Daoce Wang, Jesus Pulido, Pascal Grosset, Jiannan Tian, Sian Jin, Houjun Tang, Jean Sexton, Sheng Di, Zarija Luki, Kai Zhao, Bo Fang, Franck Cappello, James Ahrens, and Dingwen Tao. AMRIC: A Novel In Situ Lossy Compression Framework for Efficient I/O in Adaptive Mesh Refinement Applications. The International Conference for High Performance Computing, Networking, Storage, and Analysis, Denver, Colorado, USA, November 12–17, 2023. HPDC ‘22 Daoce Wang, Jesus Pulido, Pascal Grosset, Sian Jin, Jiannan Tian, James Ahrens, and Dingwen Tao. TAC: Optimizing Error-Bounded Lossy Compression for Three Dimensional Adaptive Mesh Refinement Simulations. ACM International Symposium on High-Performance Parallel and Distributed Computing, Minneapolis, Minnesota, USA, June 27–July 1, 2022. CLUSTER ‘21 Bo Fang*, Daoce Wang*, Sian Jin, Quincey Koziol, Zhao Zhang, Qiang Guan, Suren Byna, Sriram Krishnamoorthy, and Dingwen Tao. (* equal contribution) Characterizing Impacts of Storage Faults on HPC Applications: A Methodology and Insights. The 2021 IEEE International Conference on Cluster Computing, Portland, OR, USA, September 7-10, 2021. NeurIPS ‘25 Jinda Jia, Cong Xie, Fanjiang Ye, Hao Feng, Hanlin Lu, Daoce Wang, and Haibin Lin. DUO: No Compromise to Accuracy Degradation. The Thirty-Ninth Annual Conference on Neural Information Processing Systems ICS ‘25 Wenqi Jia, Zhewen Hu, Youyuan Liu, Boyuan Zhang, Jinzhen Wang, Jinyang Liu, Wei Niu, Stavros Kalafatis, Junzhou Huang, Sian Jin, Daoce Wang+, Jiannan Tian+, and Miao Yin+. (+ co-advice) NeurLZ: An Online Neural Learning-based Method to Enhance Scientific Lossy Compression. ACM International Conference on Supercomputing 2025, Salt Lake City, UT, USA, June 8–11, 2025. CSUR ‘25 Sheng Di et al. A Survey on Error-Bounded Lossy Compression for Scientific Datasets. ACM Computing Surveys, impact factor: 23.8 PPoPP ‘25 Baixi Sun, Weijin Liu, J. Gregory Pauloski, Jiannan Tian, Jinda Jia, Daoce Wang, Mingkai Zheng, Sheng Di, Sian Jin, Zhao Zhang, Xiaodong Yu, Guangming Tan, and Dingwen Tao. COMPSO: Optimizing Gradient Compression for Distributed Training with Second-Order Optimizers. 30th ACM SIGPLAN Annual Symposium on Principles and Practice of Parallel Programming, Las Vegas, NV, USA, March 1-5, 2025. NeurIPS ‘24 Jinda Jia, Cong Xie, Hanlin Lu, Daoce Wang, Hao Feng, Chengming Zhang, Baixi Sun, Haibin Lin, Zhi Zhang, Xin Liu, and Dingwen Tao. SDP4Bit: Toward 4-bit Communication Quantization in Sharded Data Parallelism for LLM Training. The Thirty-Eighth Annual Conference on Neural Information Processing Systems, Vancouver, Canada, December 9–12, 2024. EUROSYS ‘24 Sian Jin, Sheng Di, Frédéric Vivien, Daoce Wang, Yves Robert, Dingwen Tao, and Franck Cappello. Concealing Compression-Accelerated I/O for HPC Applications through In Situ Task Scheduling. Proceedings of the Nineteenth European Conference on Computer Systems, Athens, Greece, April 22–25, 2024. Workshop & Posters Doctoral Showcase Daoce Wang, Dingwen Tao. Designing Efficient Data Reduction Approaches for Multi-resolution Simulations on HPC Systems. SC ’24 Doctoral Showcase. DRBSD-10 Yanni Etchi, Daoce Wang, Pascal Grosset, Terece Turton, James Ahrens, and David Rogers. An Exploration of How Volume Rendering is Impacted by Lossy Data Reduction. The 10th International Workshop on Data Analysis and Reduction for Big Scientific Data (in conjunction with SC 24), Atlanta, GA, USA, Nov 18, 2024. Best Paper Runner-up DRBSD-10 Qing Zheng, Brian Atkinson, Daoce Wang, Jason Lee, John Patchett, Dominic Manno, and Gary Grider. Accelerating Viz Pipelines Using Near-Data Computing: An Early Experience. The 10th International Workshop on Data Analysis and Reduction for Big Scientific Data (in conjunction with SC 24), Atlanta, GA, USA, Nov 18, 2024. DRBSD-9 Daoce Wang, Jesus Pulido, Pascal Grosset, Jiannan Tian, James Ahrens, and Dingwen Tao. Analyzing Impact of Data Reduction Techniques on Visualization for AMR Applications Using AMReX Framework. The 9th International Workshop on Data Analysis and Reduction for Big Scientific Data (in conjunction with SC 23), Denver, CO, USA, Nov 12, 2023. SC ‘21 Poster Daoce Wang, Jesus Pulido, Pascal Grosset, Sian Jin, Jiannan Tian, James Ahrens, and Dingwen Tao. In-Situ Data Reduction for AMR-Based Cosmology Simulations. ACM Student Research Competition: Graduate Posters at SC 21. Experience Research Intern, Los Alamos National Laboratory 2024 May – 2024 August Research Intern, Los Alamos National Laboratory 2023 May – 2023 August Research Intern, Los Alamos National Laboratory 2022 June – 2022 August Research Intern, Los Alamos National Laboratory 2021 June – 2021 August Reviewer/Sub-reviewer SC (2024, 2022) HPDC (2024, 2023) ICS (2023, 2022) IPDPS (2024, 2023) AAAI (2022) CLUSTER (2025, 2021) Euro-Par (2023) ICPP (2023) CCGRID (2023, 2022) HiPC (2023) BigData (2021) TVCG, TPDS, TC, TBD, TCC, FGCS",
  "content_length": 7641,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:01"
}