{
  "name": "Daphna Weinshall",
  "homepage": "http://www.cs.huji.ac.il/~daphna",
  "status": "success",
  "content": "Home Page of Daphna Weinshall. Daphna Weinshall Professor School of Computer Science and Engineering Hebrew University of Jerusalem Jerusalem 91904 Israel daphna at cs huji ac il + 972-2-549-4542 Traveling (slideshows): Selected publications Recent Publications Learning and Object Recongition Computer Vision Cognitive Neuroscience Population Genetics Data EVAT: database of Emotionally evocative Video clips and their associated Affective Tagging FIF: database of super Fine grained Israeli Flowers Students Itai David (2025-). M.Sc. Tal Getz (2025-). M.Sc. Liam Mohr (2024-). M.Sc. Maor Nimri (2024-). M.Sc. Eli Corn (2024-). M.Sc. Tomer Yaacoby (2024-). M.Sc. Danit Yanowsky (2024-). M.Sc. Netta Shafir (2024-). Active Learning with a Noisy Annotator. M.Sc. Rom Maltser (2023-2024). Augmentation Curriculum Learning. M.Sc. Shahar Ariel (2023-2024). Tiny Memory Experience Replay in Class Incremental Learning. M.Sc. Elias Wakileh (2023-2024). Geometrical Active Sampling. M.Sc. Inbal Mishal (2022-2023). Active Learning for All Learners. M.Sc. Uri Stern (2022-2023). Observing and Correcting Overfit in Deep Neural Networks. M.Sc. Noam Fluss (2022-2023). Semi-Supervised Learning in the Few-Shot Zero-Shot Scenario. M.Sc. Guy Hacohen (2018-2023). Learning How Neural Networks Learn. Ph.D. Ofer Yehuda (2023). Active Learning Through a Covering Lens. M.Sc. Avihu Dekel (2022). Low Budget Active Learning: Theory and Algorithms. M.Sc. Daniel Schwartz (2022). The Dynamic of Consensus in Deep Networks and the Identification of Noisy Labels. M.Sc. Eran Zecharia (2022). Curriculum Learning on Fully Supervised and Semi-Supervised Classification Using Self-Supervised Representation Learning. M.Sc. Lotan Levy (2021). Computational Divergent Thinking Using Visual Data. M.Sc. Itamar Winter (2020). Multiclass non-Adversarial Image Synthesis with Application to Classification from Very Small Sample. M.Sc. Roee Cates (2020). Self-Supervision Can Benefit Fully-Supervised Classification Tasks. M.Sc. Boaz Lerner (2020). Boosting the Performance of Semi-Supervised Learning with Unsupervised Clustering. M.Sc. Guy Shiran (2020). Multi-Modal Deep Clustering: Unsupervised Partitioning of Images. M.Sc. Idan Azuri (2020). Learning from Small Data Through Sampling an Implicit Conditional Generative Latent Optimization Model. M.Sc. Gregory Pasternak (2020). Non-Uniform Batch Sampling for Relaxed Curriculum-based Learning. M.Sc. Matan Ben-Yosef (2018). Multi-Modal Generative Adversarial Networks. M.Sc. Haim Dubossarsky (2018). Semantic change at large: A computational approach for semantic change research. Ph.D. Ravid Cohen (2018). Mixture of Convolutional Neural Networks for Image Classification. M.Sc. Gad Cohen (2018). Hidden Layers in Perceptual Learning. M.Sc. Talia Tron (2017). Automated Facial Expressions Analysis in Schizophrenia: a Continuous Dynamic Approach. Ph.D. Yehezkel Resheff (2017). A Machine Learning Approach to Analysis of Biologger Data in Movement Ecology. Ph.D. Amit Mandelbaum (2017). Distance-based Confidence Score for Neural Network Classifiers. M.Sc. Tamar Elazari (2017). Face Verfication and Face Image Synthesis under Illumination Changes using Neural Networks. M.Sc. Daniel Hadar (2016). Implicit Media Tagging and Affect Prediction from video of spontaneous facial expressions, recorded with depth camera. M.Sc. Nomi Vinokurov (2016). Novelty Detection in MultiClass Scenarios with Incomplete Set of Class Labels. M.Sc. Lior Bar (2015). Multiclass Classification: Margins Revisited, Novelty Detection via Trees, and Visual Object Recognition with Sparse Features Derived from a Convolution Neural Net. M.Sc. Uri Shalit (2014). Scalable Streaming Learning of Dyadic Relationships. Ph.D. Alon Cohen (2014). Surrogate Loss Minimization. M.Sc. Alon Zweig (2013). Hierarchical Modeling and Applications to Recognition Tasks. Ph.D. Roi Kliper (2013). Learning Distance Functions to Gain Insights into Functional Representations of Complex Objects in the Brain. Ph.D. Gal Levi (2013). Latent Dirichlet Allocation with Soft Assignment of Descriptors to Words. M.Sc. Dmitri Hanukaev (2013). LDA Topic Model with Soft Assignment of Descriptors to Words. M.Sc. Avishai Hendel (2012). Identifying Surprising Events in Videos Using Bayesian Topic Models. M.Sc. Avram Golbert (2012). Object Detection from Multiple Overlapping Views Using Semantic and Geometric Context in 3D. M.Sc. Amir Rosenfeld (2011). Extracting Foreground Masks towards Object Recognition. M.Sc. Dagan Eshar (2009). Generative Implementation of Hierarchical Novelty Detector. M.Sc. Tomer Hertz (2007). Learning Distance Functions with Applications in Image Retrieval, Clustering, Classification and Immunoinformatics. Ph.D. Lior Zamir (2007). Feature Selection in Distance Learning from Small Sample. M.Sc. Aharon Bar-Hillel (2006). Learning from Weak Representations using Distance Functions and Generative Models. Ph.D. Anna Sorkin (2006). Virtual Reality for Diagnostic Assessment of Schizophrenia Deficits. Ph.D. Doron Feldman (2006). Analyzing the Spatio-Temporal Domain: from View Synthesis to Motion Segmentation. Ph.D. Vered Tsedaka (2005). Data Modeling with Gaussian Mixture Based Clustering: A Unifying View for Discriminative and Generative Clustering. M.Sc. Inna Weiner (2005). Analyzing Auditory Neurons by Learning Distance Functions. M.Sc. Adam Spiro (2005). Bayesian Clustering of non-stationary Data. M.Sc. Noam Shental (2004). From Unsupervised to Semi-Supervised Learning: Algorithms and Applications. Ph.D. Yoram Gdalyahu (1999). Stochastic Clustering and its Applications to Computer Vision. Ph.D. Gilad Halevy (1997). Motion of disturbances: detection and tracking of multi-body non rigid motion. M.Sc. Recorded lectures: June 2010: Category Learning from Equivalence Constraints mp4 Oct 2011: Identifying Surprising Events in Videos mp4 Feb 2019: On the Power of Curriculum Learning in Training Deep Networks: mp4, online link Biography: Brief Biography Curriculum Vita Teaching: visual Visual Object Recognition 2009 [67777] Introduction to Computer Science 2009/10 [67101] A few demos: Test yourself: depth ordering Schizophrenia profile: incoherencies detection Image-based rendering: X-slits movies Image-based rendering: bi-centric movies Gesture recognition: pointing target detection Curve matching: demo Tracking: multi-body motion Tracking: storms Code (usually matlab): Figure-ground segregation, see paper. DistBoost - a boosting-based distance learning algorithm, see paper. Constrained EM algorithm: full package (with BNT) and minimal code, see paper. RCA Mahalanobis distance learning, see paper. Typical-cut clustering algorithm (in C), see paper. Relational model learning, see paper. Spike sorting - Clustering of non-stationary data, see paper. Research Interests: Computer and human vision Machine and perceptual learning My best results - Yael and Tom: Back to CS HUJI Home Page",
  "content_length": 6919,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:05"
}