{
  "name": "Daqing He",
  "homepage": "http://www.pitt.edu/~dah44",
  "status": "success",
  "content": "Daqing He I am a full professor and department chair of the Department of Informatics and Networked Systems (DINS) and the Intelligent Systems Program (ISP), School of Computing and Information (SCI) , the University of Pittsburgh. I am the director of a research lab called Information Retrieval, Integration and Synthesis. I currently serve as the associate editor of “Aslib Journal of Information Management”, and on the editorial board of SCI/SSCI indexed journals “Information Processing and Management”. News Welcome to attend the 87th Annual Meeting of the Association for Information Science and Technology, October 25-29, 2024 Call for Paper: Information Processing and Management, Special Issue on Intelligent Technologies for Smart Healthcare across the Lifespan. Deadline Jan 31, 2022 Social Information Access: Systems and Technologies, Peter Brusilovksy, Daqing He. Springer, 2018 JCDL 2018, June 3-5, 2018 For Worth, Texas iConference 2017 Call for Workshops ECIR 2017 Call for Tutorials Awards ACM SIGIR CHIIR 2023 Best Short Paper Award (2023). ACM SIGIR CHIIR 2019 Best Poster Award (2019). iConference 2017 Best Poster Award (2017). ACM SIGIR CHIIR 2017 Best Student Paper Award (2017). iConference 2013 Best Paper Award Honorable Mention (2013) Research Interests information retrieval and information access natural language processing and text mining adaptive web systems and user modeling research data management Research Goals and Methodology The goal of my research aims to advance people’s capabilities of accessing online information with the support of various cutting-edge intelligent and social information technologies. This goal fits nicely to the current data and information exploration environment, where there is too much data for people to process and consume, therefore, people need information technologies to assist them. At the same time, I believe that the role that intelligent technologies can play is not to replace humans but rather to assist and augment humans in the access process. The relationship between humans and the technologies is a synergistic one where humans and machines work together to resolve the needs of the humans. Therefore, I am interested in making technology as enabler rather replacer, and it is people who initiate the needs of access, provide meaningful context, and utmost measures of success or failure of the technologies. My research interests also root in the fact that I am in an information science school, where interdisciplinary and collaborative research is natural and has the greatest impact. I have built research teams and projects that involve faculty and students from different disciplines and various universities/institutions, but my goal of the research is always consistent. Research Themes My research can be summarized into two major themes. The first one is called intelligent information processing, which combines artificial intelligence, natural language processing, machine learning with human information access. Within this theme, I mainly worked on two research topics: intelligent information retrieval and its applications to personalization and social information access, and multilingual information access and its applications to interactive multilingual environment. The second research theme is scholar data management, which combines information science and management. On this theme, my research work has been mainly on scholarly collaboration and research data management on modern knowledge and information infrastructure. Major Research Projects “Transferable, Controllable, Applicable Keyphrase Generation” Funded by Amazon Research Award, Duration: 2020-2021 PI. Award Amount: $80,000 + $20,000 AWS Credits. This project proposes to develop novel keyphrase prediction models that are transferable to different domains without the need of large amounts of domain-specific data and controllable for generating phrases of various genres. more here “Development and Implementation of a Health e-Librarian with Personalized Recommender (HELPeR)” Funded by NIH NLM, Duration: 2019-2023 MPI. Award Amount: $1,480,406. The overall goal of this proposal is to build and implement a \"Health E-Librarian with Personalized Recommendations (HELPeR)\" - a personalized information access system with a hybrid recommender engine that adapts to different aspects of the patient. “IRIS: Intelligent Recommender for Instructors and Students -- Completing Personalized Assessment Loop,” Funded by Provost’s Personalized Education Grant, University of Pittsburgh, Duration: 2019-2020 PI. Award Amount: $14,995. This project will build a personalized education system, called IRIS, to recommend learning materials to be specific to the assessment outcomes and at the appropriate knowledge level for the student. “IRIS: Intelligent Recommender for Instructors and Students -- Completing Personalized Assessment Loop,” Funded by Provost’s Personalized Education Grant, University of Pittsburgh, Duration: 2019-2020 PI. Award Amount: $14,995. This project will build a personalized education system, called IRIS, to recommend learning materials to be specific to the assessment outcomes and at the appropriate knowledge level for the student. “CARE: Clinical Abbreviation Resolution Engine” Funded by Pittsburgh Health Data Alliance Project and UPMC, Duration: 2018-2020 PI. Award Amount: $222,351. Our Clinical Abbreviation Resolution Engine (CARE) project utilizes the latest deep learning models and trains them on large-scale collections of clinical reports to improve abbreviation resolution. The project also develops a clustering-based annotation strategy and interface to quickly generate annotated data for model development. Open Corpus Personalized Learning Funded by NSF, Duration: 2015-2018 This project merges research on text analysis, human learning, and personalization to enable open corpus personalized learning. Teen Health Information Behavior and Social Q&A Funded by OCLC/ALISE, Duration: 2015 This project investigates teens' assessments of the Accuracy, Credibility, and Reliability of health information in Yahoo! Answers about eating disorders. The aim is to contribute to the greater understanding of youth information behavior, health information literacy, and the role of Social Q&A in the provision of health information to young people. Tapping into Public Academic Information on the Social Web: Towards a Novel Academic Recommendation Framework Funded by NSF, Duration: 2010-2012 This project aims to explore the utility of new and rapidly expanding public academic information resources on the social Web. The goal is to develop a quality assessment and an association discovery framework for online academic information, and ultimately to establish a novel framework for supporting researchers in accessing, organizing, utilizing, and exchanging all types of academic information. User-centric, Adaptive and Collaborative Information Filtering Funded by NSF, Duration: 2007-2012, Partner: CMU CLAIR group Working with our CMU partner, the objective of this project is to develop new technologies for Adaptive Filtering (AF) -- the problem of learning and adapting to a user's information needs \"on-the-fly\". We propose a new framework called \"Enriched Vector Space Model\" (EVSM) that allows a rich representation of user's interests in terms of queries, entities (person names, locations, dates), topical categories (politics, crime, economics), implicit and explicit feedback received from the user. Such user profiles can be used to perform more intelligent and personalized information filtering for each user. Adaptive, Robust, and Distilled Information Access Funded by DARPA GALE Program, Duration: 2005-2007. We propose to develop and demonstrate an integrated set of techniques for building an adaptive, robust and distilled information access module for information distillation, which is able to handle electronic newswire, transcriptions from broadcast news, telephone conversations, and talk shows, and web documents from newsgroups and weblogs, no matter whether they are originally in English or in Chinese, Arabic or surprise languages. Digital Library for Learning Digital Library Funded by University of Pittsburgh, Provost's Innovation in Teaching Award. Duration: 2005-2006. This project designed and developed an interactive, integrated and active learning environment using digital library technologies, with the goals to improve the quality of the student's learning experience and increase the effectiveness of that experience. More in my CV I view teaching as a communication of knowledge and ideas between the teacher and students. A successful teaching session needs careful thinking, imaginative designing, clear presentation, and frequent evaluation and updating. Graduate Courses INFSCI2140 Information Storage and Retrieval (Continously taught it since 2008. Latest Fall 2021)[Syllabus. PDF] INFSCI2440 Artificial Intelligence (Continously taught it since 2019. Latest Fall 2020)[Syllabus. PDF] LIS2002 Retrieving Information (Fall 2005, Fall 2006, Spring 2007, Spring 2008) [Syllabus. PDF] LIS2600 Introduction to Information Technology (Spring 2007, Fall 2007, Fall 2008, Fall 2009, Fall 2010, Fall 2011, Fall 2012, Fall 2013) [Syllabus. PDF] LIS2658 Advanced Topics for Information Storage and Retrieval (Spring 2010, Spring 2011) [Syllabus. PDF] LIS2670 Digital Libraries (Spring 2005, Fall 2005, Spring 2006, Fall 2006, Fall 2007, Fall 2008, Fall 2009, Fall 2010, Fall 2011, Fall 2012, Fall 2013)[Syllabus. PDF] LIS2672 Technologies and Services for Digital Data (Fall 2015, Fall 2016)[Syllabus. PDF] LIS2680 Database Design and Applications (Spring 2005, Spring 2006, Spring 2016)[Syllabus. PDF] LIS3600 Doctoral Seminar: Web Information System (Spring 2008, Spring 2009, Fall 2010) [Syllabus. PDF] I have published more than 200 articles in internationally-recognized journals and conferences in these areas, which include informatio",
  "content_length": 10869,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:16"
}