{
  "name": "Darius Burschka",
  "homepage": "http://www6.in.tum.de/burschka",
  "status": "success",
  "content": "TUM School of Computation, Information and Technology - TUM School of Computation, Information and Technology Carousel pausieren Carousel starten Blick über den Forschungscampus GarchingFoto: Astrid Eckert / TUMFoyer des Neubaus Electrical EngineeringFoto: Andreas Heddergott / TUMTUM Campus München: Department Computer EngineeringFoto: Andreas Heddergott / TUMGebäude für die Fachbereiche Mathematik und InformatikFoto: Andreas Heddergott / TUM Vorheriger Slide Nächster Slide Slide 1 von 4 TUM School of Computation, Information and Technology Vernetzte Forschung und zukunftsorientierte Studienprofile: Die TUM School of Computation, Information and Technology (CIT) der Technischen Universität München (TUM) vereint die Disziplinen Mathematik, Informatik sowie Elektrotechnik und Informationstechnik. Wir forschen und lehren ein breites Spektrum von der Theorie bis zur Anwendung. Gemäß unserem Leitbild konzentrieren wir uns fachübergreifend auf die großen Herausforderungen unserer Zeit wie die Digitalisierung. Gleichzeitig sind wir fachlich in unseren Basisdisziplinen verankert. Foto: Astrid Eckert / TUM Wer wir sind Foto: Astrid Eckert / TUM Bei uns studieren Foto: Astrid Eckert / TUM Woran wir forschen Was treibt dich an? - TUM School of Computation, Information and Technology Durch Klicken erklären Sie sich mit der Datenschutzerklärung von Google und unserer Datenschutzerklärung einverstanden. Mehr Informationen Einmalig aktivieren Dauerhaft aktivieren Video: Juri & Aki Films / TUM Neuigkeiten aus der TUM School of Computation, Information and Technology Forschung | 22.11.2025 Einheitliche Bewertungsgrundlage für Leichtbau-Methoden geschaffen Forschende der TUM haben ein Referenzsystem entwickelt, das erstmals den direkten Vergleich verschiedenster Leichtbau-Methoden ermöglicht. Industrie und Forschung können so Bauteile leichter und zugleich stabiler entwickeln – ein wichtiger Schritt für Medizintechnik, Automobil- und Luftfahrtbranche. [weiterlesen] Auszeichnungen | 20.11.2025 IEEE CASS Vitold Belevitch Circuits and Systems Award 2025 für Josef A. Nossek Josef A. Nossek, Emeritus of Excellence der Technischen Universität München (TUM), wurde mit dem renommierten IEEE CASS Vitold Belevitch Circuits and Systems Award 2025 ausgezeichnet. [weiterlesen] School, Auszeichnungen | 13.11.2025 Professor Michael Backes ist neuer „TUM Distinguished Affiliated Professor“ Win-win für beide Seiten: Im Rahmen einer Feier an der TUM School of Computation, Information and Technology nahm TUM Präsident Professor Thomas F. Hofmann die Ehrung des Gründungsdirektors und CEO des CISPA Helmholtz-Zentrums für Informationssicherheit vor. [weiterlesen] Forschung, Auszeichnungen | 30.10.2025 Amr Alanwar in Emmy Noether-Programm aufgenommen Die Deutsche Forschungsgemeinschaft (DFG) nimmt Amr Alanwar, Professor für Cyber-Physical Systems, in das renommierte Emmy Noether-Programm auf. Mit seiner Forschung zu logischen Zonotopen ermöglicht er effizientere Berechnungen in vielen Anwendungsfällen, etwa digitalen Schaltungen. [weiterlesen] New@CIT | 29.10.2025 Willkommen, Professor Benjamin Nuß Digitalradare und Radarnetzwerke gehören zu Benjamin Nuß’ Forschungsschwerpunkten. Wofür er sich neben seiner Arbeit begeistert, erzählt uns der neu berufene Professor für Mikrowellensensoren und Sensorsysteme an der Technischen Universität München (TUM) in unserer Reihe „New@CIT“. [weiterlesen] Veranstaltungen der TUM School of Computation, Information and Technology 29 Nov 2025 Studium 1.000+ Projektwoche an der TUM - jetzt bewerben! 04 Dez 2025 School Dies Academicus 2025 10 Dez 2025 Wissenschaft für jedermann \"Wissenschaft für jedermann\" mit Professor Stefan Weltge Zur News- und Event-Übersicht To top",
  "content_length": 3727,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:20"
}