{
  "name": "Dario Allegra",
  "homepage": "https://web.dmi.unict.it/docenti/dario.allegra",
  "status": "success",
  "content": "Dario ALLEGRA | Dipartimento di Matematica e Informatica Vai al contenuto principaleVai al menu di navigazione Vai ai contenuti correlati Dario ALLEGRA Professore associato di Informatica [INFO-01/A] Contatti Ufficio: 368Email: dario.allegra@unict.itTelefono: 095 7383043Sito web: www.researchgate.net/profile/Dario_Allegra Orario di ricevimento Venerdì dalle 12:00 alle 14:00 Per il ricevimento online il docente va contatto su MS Teams nella fascia oraria indicata. Sede del ricevimento: 368 ENGLISH VERSIONSTUDIUMAREA RISERVATA BIOGRAFIACURRICULUMPUBBLICAZIONIINSEGNAMENTIATTIVITÀ DI RICERCAAVVISITESI Dario Allegra consegue la Laurea Triennale in Informatica nel 2012 and la laurea Magistrale in Informatica nel 2014 all'Università di Catania. Ottiene il dottorato di Ricerca in Matematica e Informatica nel 2018 presso l'Università di Catania conducendo le sue attività di ricerca anche presso l'Università di Berna nel 2017. Da maggio 2022 ad aprile 2025 è ricercatore a tempo determinato di tipo B al Dipartimento di Matematica e Informatica dell'Università di Catania. Da maggio 2025 ad oggi è professore associato nello stesso dipartimento. È autore di oltre 50 articoli scientifici presentati presso riviste e conferenze internazionali. È stato guest editor per diverse Special Issue su riviste di carattere internazionale e chair di numerosi workshop internazionali. I suoi interessi di ricerca riguardano l'Image Processing, Il Machine Learning e la Computer Vision applicati soprattutto all'analisi di immagini/video di alimenti e alla valorizzazione del patrimonio culturale. È membro della IEEE Signal Processing Society e dell'associazione Eurographics. È stato coinvolto in numerosi progetti finanziati da istituzioni nazionali e internazionali oltre che da aziende multinazionali come ST Microelectronics, intervenendo sia come partecipante che come coordinatore. I suoi articoli affrontano problemi che richiedano l'utilizzo di algoritmi basati sull'imaging per poter essere risolti. Tra questi: compressione delle immagini e video, ottimizzazione del colore, estrazione di fingerprint da documenti, riconoscimento e classificazione di immagini di cibo, stima dei valori nutrizionali da contenuti multimediali, rilevamento e rimozione di artefatti da immagini o video e altro. È docente nei corsi di Laurea Triennale e Magistrale di Informatica dell'Università di Catania dal 2018. I suoi insegnamenti riguardano l'elaborazione delle immagini, audio e dei video partendo dalla rappresentazione digitale di tali media. Scarica il fileUltimo aggiornamento: 23/06/2025 VISUALIZZA LE PUBBLICAZIONI N.B. l'elevato numero di pubblicazioni può incidere sul tempo di caricamento della pagina VISUALIZZA GLI INSEGNAMENTI DALL'A.A. 2022/2023 AD OGGI Anno accademico 2021/2022 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 1° annoMULTIMEDIA E LABORATORIO DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 2° annoINTERAZIONE E MULTIMEDIA E LABORATORIO M - Z Anno accademico 2020/2021 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 1° annoMULTIMEDIA E LABORATORIO DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 2° annoINTERAZIONE E MULTIMEDIA E LABORATORIO M - Z Anno accademico 2019/2020 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 1° annoMULTIMEDIA E LABORATORIO DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 2° annoINTERAZIONE E MULTIMEDIA E LABORATORIO M - Z Anno accademico 2018/2019 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 1° annoMULTIMEDIA E LABORATORIO DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 2° annoINTERAZIONE E MULTIMEDIA A - L DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 2° annoMULTIMEDIA E LABORATORIO VISUALIZZA GLI INSEGNAMENTI PRECEDENTI I suoi interessi di ricerca riguardano l'Image Processing, Il Machine Learning e la Computer Vision applicati soprattuto all'analisi di immagini/video di alimenti e alla valorizzazione del patrimonio culturale. I suoi articoli affrontano problemi che richiedano l'utlizzo di algoritmi basati sull'imaging per poter essere risolti. Tra questi: compressione delle immagini con l'uso del re-indexing, ottimizzazione del colore, estrazione di fingerprint da documenti, riconoscimento e classificazione di immagini di cibo, stima dei valori nutrizionali da contenuti multimediali, rilevamento e rimozione di artefatti da immagini o video e altro. ARCHIVIO Guida alle tesi di laurea Proposte per tesi di laurea triennale o magistrale. Sperimentali e progettuali. Perceptive Image Compression for Interactive 3D Environments Perceptive compression is a novel approach to image encoding where the latent representation of a picture is given by a features vector which describes the high-level components of the image. The decoding process consists of feeding such vectors to a generative model. As a consequence, the decoded image will not be an accurate reconstruction of the original one but will represent the same concepts and foreground objects. The purpose of this thesis is to explore the use of such techniques to compress textures and pictures used in virtual 3D environments, such as video game scenarios and interactive scenes. More specifically, procedural scene generation is a hopeful use case for perceptive compression as the inner variability which may be a drawback in classical image compression pipelines can be exploited to enhance the generative process. Performance analysis of Implicit Image Compression on common user applications Implicit Image Compression is a novel image encoding paradigm where a picture is interpreted as a function from coordinates to pixels, then overfitting a neural network to such function and compressing its parameters. The decoding is done by inferring the neural network for each pixel at the desired resolution. This approach has various advantages, such as replacing complex hand-crafted compression pipelines with generic machine learning algorithms and decoupling the image representation from its original resolution. However, codecs based on this method are still experimental and exhibit substantial encoding times, with the advantage of a straightforward and easily parallelisable decoding process. The purpose of this thesis is to implement existing decoders in everyday user applications on desktop and mobile devices and compare their computational load on common user interfaces such as web pages with traditional codecs and autoencoder-based methods. AI-Generated media compression AI-generated images, videos and more media have depopulated to the mass of internet users during the last years due to the release of new generative models and commercial services making use of generative AI. These data have peculiarities which are reflected in both their visual appearance and frequency spectrum. The mass spread of this kind of content makes it necessary to develop specialized compression methods that exploit their characteristics to improve compression ratios. In this thesis novel pipelines for encoding and decoding AI-generated context will be developed, analyzing the efficiency of existing codecs in such tasks and their current limitations and proposing novel techniques that better fit the specific requirements for this innovative category of data. JPEG AI compression/recompression artifacts of Synthetic Images to counter Deepfake Detection The proliferation of generative models (e.g., GANs, Diffusion Models) has led to the creation of highly realistic synthetic images, raising concerns about misinformation and digital forensics. To address this, researchers have developed detectors trained to distinguish between real and synthetic images, often relying on subtle artifacts left by generative processes. Neural Image Codecs (NICs), such as the recente JPEG AI standard, are increasingly used for image compression due to their superior rate-distortion performance. However, NICs introduce their own artifacts, which may overlap with those of generative models. This overlap could potentially confuse detectors, leading to false negatives or positives. How does neural image compression affect the performance of synthetic image detectors? Specifically, if synthetic images are compressed using NICs, do detectors still recognize them as synthetic, or do NIC artifacts obscure or mimic generative artifacts, leading to misclassification? The purpose of this thesis is to develop counter-detection methods based on recompression using LIC, and to explore possible counter-measures to distinguish NIC-compressed pristine images from synthetic ones. Decentralized overfitted video codec The efficiency of video-on-demand (VoD) systems is strictly linked to the compression ratio achievable, especially for most popular content. In these kind of architectures, the encoding is usually performed by the distributor, centralizing the computational efforts. However, as the resolution of videos increases and the complexity of modern codecs tends to grow with each new release, it is desirable to decentralize the computational burden instead of relying on powerful servers to encode the videos.Doing so with traditional hand-crafted encoding pipelines is difficult, as their steps are often fixed and not easy to scale. Instead, overfitted codec such as INR-based ones are inherently progressive, with each iteration bringing potential improvements to the rate-distortion ratio and being potentiaylli independent from the other ones. The purpose of this thesis is to define a decentralized and distributed video encoding system where each node is rewarded for their encoding efforts on videos, published by distribution services. This approach is similar to the one Proof-of-Work systems ran by cryptocurrencies, but in this case the work needed is not artif",
  "content_length": 10712,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:06"
}