{
  "name": "Daria Siekhaus",
  "homepage": "https://ist.ac.at/research/research-groups/siekhaus-group",
  "status": "success",
  "content": "ISTA | Siekhaus Group HomeResearchSiekhaus Group EDUCATION Graduate School Postdocs Internship and Scholarship Program VISTA Science Experiences Life Sciences Invasive Migration The ability of cells to migrate is crucial for their function in the immune system, the formation of the body, and the spread of cancer. The Siekhaus group investigates how cells move within the complex environment of an organism, using the genetic power of the fruit fly to interrogate this process and identify ways in which it is regulated.Vertebrate immune and cancer cells need to squeeze between closely connected cells to disseminate in the body. Daria Siekhaus and her group study how cells penetrate such tissue barriers, using the developmental movement of macrophages in the fruit fly Drosophila melanogaster as a model. The Siekhaus group uses a combination of imaging, genetics, cell biology, biophysics and modeling to identify the strategies that underlie tissue invasion. The group has found that a cytokine conserved in vertebrates facilitates tissue entry by reducing tension in surrounding tissues. The group has defined a novel program acting in disseminating and invading macrophages that alters glycosylation to aid invasion; this program displays molecular conservation in metastatic cancer cells. They have also defined a conserved pioneer invader program acting in macrophages that activates transcription and translation of an mRNA subset to increase tissue entry. Administrative Support Alexandra Mally Assistant to Professors +43 2243 9000 1105 Alexandra.Mally@ist.ac.at On this site: Team Current Projects The role of cell division in regulating invasive migration | A novel transporter and its effect on glycosylation, immune function and metastasis | A conserved pioneer cell program that governs invasion through changes affecting metabolism Publications Akhmanova M, Emtenani S, Krueger D, György A, Pereira Guarda M, Vlasov M, Vlasov F, Akopian A, Ratheesh A, De Renzis S, Siekhaus DE. 2022. Cell division in tissues enables macrophage infiltration. Science. 376(6591), 394–396. View Emtenani S, Martin ET, György A, Bicher J, Genger J-W, Köcher T, Akhmanova M, Pereira Guarda M, Roblek M, Bergthaler A, Hurd TR, Rangan P, Siekhaus DE. 2022. Macrophage mitochondrial bioenergetics and tissue invasion are boosted by an Atossa-Porthos axis in Drosophila. The Embo Journal. 41, e109049. View Roblek M, Bicher J, van Gogh M, György A, Seeböck R, Szulc B, Damme M, Olczak M, Borsig L, Siekhaus DE. 2022. The solute carrier MFSD1 decreases β1 integrin’s activation status and thus tumor metastasis. Frontiers in Oncology. 12, 777634. View Belyaeva V, Wachner S, György A, Emtenani S, Gridchyn I, Akhmanova M, Linder M, Roblek M, Sibilia M, Siekhaus DE. 2022. Fos regulates macrophage infiltration against surrounding tissue resistance by a cortical actin-based mechanism in Drosophila. PLoS Biology. 20(1), e3001494. View Valosková K, Bicher J, Roblek M, Emtenani S, György A, Misova M, Ratheesh A, Dos Reis Rodrigues P, Shkarina K, Larsen ISB, Vakhrushev SY, Clausen H, Siekhaus DE. 2019. A conserved major facilitator superfamily member orchestrates a subset of O-glycosylation to aid macrophage tissue invasion. eLife. 8, e41801. View View All Publications ReX-Link: Daria Siekhaus Career since 2012 Assistant Professor, Institute of Science and Technology Austria (ISTA)2003 – 2011 Research Scientist, Skirball Institute, New York University Medical Center, USA1999 – 2003 Postdoctoral Fellow, University of California, Berkeley, USA1998 PhD, Stanford University, USA Selected Distinctions 2019 Chosen for “Excellence in Peer Review” by Developmental Cell editors 2018, 2019 F1000 Prime, 2022 Faculty Opinions highlighted papers 2016 FWF Grant2012 Marie Curie Career Integration Grant2003 – 2005 NIH Fellowship Additional Information Download CV Back to Top We use cookies on our website. By clicking “Technically Necessary Cookies” no other cookies than cookies that are technically necessary to enable various functionalities of the website (e.g. provide access to the website, display of cookie banner) are enabled. However, you may go to \"Cookie Settings\" to provide a controlled consent.Read more...Cookie SettingsAccept AllTechnically Necessary CookiesManage cookies Close Privacy Overview This website uses cookies. Below you can provide individual consent regarding the use of cookies. Cookies under the category \"necessary\" are always enabled since they are technically necessary to access the website. You can find more information on the use of cookies in the data protection statement of ISTA Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website. CookieDurationDescriptioncookielawinfo-checkbox-analytics1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-necessary1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".CookieLawInfoConsent1 yearThis cookie only appears if you makes changes to the categories (e.g disable the category “Analytics”).pll_language1 yearThe ISTA website is a multilingual website, WordPress requires a default language to be selected and set by a cookie in order to display the website, which is recorded by the pll_language cookie by Polylang. Furthermore this cookie is also used to remember the language selected by the user when returning to the website.viewed_cookie_policy1 yearThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. CookieDurationDescription_pk_id*13 monthsMatomo tracking cookie stores a unique user id._pk_ses*13 monthsMatomo tracking cookie stores a unique session id. SAVE & ACCEPT Powered by",
  "content_length": 6244,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:07"
}