{
  "name": "Dario Landa-Silva",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/dario.landasilva",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Dario Landa-SilvaProfessor of Computational Optimisation, Director of Teaching and Learning, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsTeaching and LearningResearchPublications Contact workRoom C70 School of Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKdario.landasilva@nottingham.ac.ukhttp://www.cs.nott.ac.uk/~pszjds BiographyDario is a professor of Computational Optimisation in the School of Computer Science at the University of Nottingham and member of the Computational Optimisation and Learning (COL) Lab. He is also a fellow of Advance Higher Education. He is member of the editorial boards for the Memetic Computing Journal (Springer) and the Neural Computing and Applications Journal (Springer). He is also member of the EPSRC peer review college and has served in the scientific committees for various international conferences and workshops, organized various special sessions and tracks in international conferences and workshops, and reviewed for various scientific journals and books. He has delivered several keynote talks at scientific events on the topics of multi-objective optimization in scheduling problems, heuristic optimization for logistic operations, adaptive and cooperative heuristic techniques and others. He has taught various courses on topics within the areas of computer science, operations research and artificial intelligence. He worked as an engineer in the manufacturing and energy industry before embarking in an academic career. He obtained a BEng from ITV (Mexico), an MSc from ITCH (Mexico), a PhD from UoN (UK) and a PHCHE from UoN (UK).Expertise SummaryScientific research at the interface between computer science, operations research and artificial intelligence for the application of modelling, search and optimization techniques (e.g. meta-heuristics, hyper-heuristics, evolutionary algorithms, mathematical programming, multi-objective and multi-criteria methods) to tackle constrained combinatorial problems (e.g. vehicle routing, transport planning, personnel scheduling, timetabling, task assignment, room assignment, office space allocation, space planning and similar problems) in order to underpin the development of intelligent decision support systems across a range of real-world applications. Member of the Computational Optimisation and Learning (COL) Lab (http://www.asap.cs.nott.ac.uk). He has delivered several keynote talks at scientific events on the topics of multi-objective optimization in scheduling problems, heuristic optimization for logistic operations, adaptive and cooperative heuristic techniques and others. I have also taught various courses on topics within the areas of computer science, operations research and artificial intelligence.Teaching SummaryI have around 30 years experience teaching in higher education. After some years in Industry, I worked as a Lecturer and Senior Lecturer for several Institutions in Mexico. While studying for my PhD,… read moreResearch SummaryMy research interests are in the interface between computer science, operations research and artificial intelligence for the application of modeling, search and optimization techniques to underpin… read moreSelected Publications CARGAN, TIMOTHY and LANDA-SILVA, DARIO, 2024. Local-global Methods for Generalised Solar Irradiance Forecasting Applied Intelligence. 54, 2225-2247MAAJI, SALIM and LANDA-SILVA, DARIO, 2023. UAV Path Planning for Area Coverage and Energy Consumption in Oil and Gas Exploration Environment. In: Computational Logistics: 14th International Conference on Computational Logistics (ICCL 2023) 14239. Springer. 467-481JIANG, XIAOPING, BAI, RUIBIN, WALLACE, STEIN W., KENDALL, GRAHAM and LANDA SILVA, DARIO, 2021. Soft clustering-based scenario bundling for a progressive hedging heuristic in stochastic service network design Computers & Operations Research. 128(105182), ALGETHAMI, HANEEN, MARTINEZ-GAVARA, ANNA and LANDA-SILVA, DARIO, 2019. Adaptive Multiple Crossover Genetic Algorithm to Solve Workforce Scheduling and Routing Problem Journal of Heuristics. 25(4-5), 753-792 View all publications I have around 30 years experience teaching in higher education. After some years in Industry, I worked as a Lecturer and Senior Lecturer for several Institutions in Mexico. While studying for my PhD, I worked as a Lecturer in Computing for the Broxtowe College (now Castle College Nottingham). After completing a post-doctoral project, I became a Lecturer in Computer Science at the University of Nottingham and then an Associate Professor in Computer Science. In the past, I also contributed as part-time tutor in Computing in the Centre for Continuing Education at The University of Nottingham. I have also been an Adjunct Professor at Korea University over the past few years and invited lecturer at Masaryk University. Courses I have delivered in Higher Education include: Simulation and Optimization for Decision Support, Linear and Discrete Optimization, Quality Assurance and Testing, Operations Research and Modelling, Heuristic Search Methods, Operations Research and Optimization, Algorithms Design and Operations Research, Large Scale Systems Design, Computability, Commercial and Industrial Systems Design, Discrete Mathematics, Algorithms Design, Theory of Computational Languages, Data Structures, C/C++ Programming, Artificial Intelligence, Computer Graphics, Compilers Construction, Intelligent Systems, Systems Programming and Delphi Programming. Courses I have delivered in Continuing Education include: Security in Personal Computing, PC Fundamentals, Information Age, Digital Media, Making Digital Sound, Making MIDI Sound, IT Project and Diploma in Office Applications. Current ResearchMy research interests are in the interface between computer science, operations research and artificial intelligence for the application of modeling, search and optimization techniques to underpin the development of intelligent decision support systems across a range of real-world applications, particularly in logistic and operational scenarios. More recently, I am conducting research on the interplay between optimization and other methodologies such as machine learning, computer simulation, data science and human computation. I have over 95 scientific publications in refereed journals, edited books, and proceedings of international conferences and workshops. I have been an investigator on several research and knowledge transfer projects with various academic and industrial collaborators. Areas of application of these projects include: office space utilization in buildings, workforce scheduling in health-care and retail sectors, freight transport routing and planning, telematics-based vehicle prognostics, collaborative logistics in freight transport, prescriptive analytics and business intelligence for retail/hospitality/energy sectors. In particular, I have led 5 Knowledge Transfer Partnership (KTP) projects. These KTP projects have involved the application of modelling, search, optimization, data science and machine learning techniques for the development of decision support systems for a variety of problems in industry. I have been a principal investigator on research and knowledge transfer grants with a total value of over £1.2M with funding from EPSRC, Innovate UK and industry among others. CARGAN, TIMOTHY and LANDA-SILVA, DARIO, 2024. Local-global Methods for Generalised Solar Irradiance Forecasting Applied Intelligence. 54, 2225-2247MAAJI, SALIM and LANDA-SILVA, DARIO, 2023. UAV Path Planning for Area Coverage and Energy Consumption in Oil and Gas Exploration Environment. In: Computational Logistics: 14th International Conference on Computational Logistics (ICCL 2023) 14239. Springer. 467-481LE, LAM LE, NERI, FERRANTE, LANDA-SILVA, DARIO and TRIGUERO, ISAAC, 2022. Accelerated Pattern Search with Variable Solution Size for Simultaneous Instance Selection and Generation In: 2022 Genetic and Evolutionary Computation Conference Companion (GECCO 2022). 256-259VAZQUEZ, EDGAR and LANDA-SILVA, DARIO, 2021. Towards Blockchain-based Ride-sharing Systems In: 10th International Conference on Operations Research and Enterprise Systems (ICORES 2021). 446-452LE, HOANG LAM, LANDA-SILVA, DARIO, GALAR, MIKEL, GARCIA, SALVADOR and TRIGUERO, ISAAC, 2021. EUSC: A clustering-based surrogate model to accelerate evolutionary undersampling in imbalanced classification Applied Soft Computing. 101(107033), JIANG, XIAOPING, BAI, RUIBIN, WALLACE, STEIN W., KENDALL, GRAHAM and LANDA SILVA, DARIO, 2021. Soft clustering-based scenario bundling for a progressive hedging heuristic in stochastic service network design Computers & Operations Research. 128(105182), LE, HOANG LAM, LANDA-SILVA, DARIO, GALAR, MIKEL, GARCIA, SALVADOR and TRIGUERO, ISAAC, 2020. A Hybrid Surrogate Model for Evolutionary Undersampling in Imbalanced Classification In: 2020 IEEE Congress on Evolutionary Computation (CEC 2020). ALGETHAMI, HANEEN, MARTINEZ-GAVARA, ANNA and LANDA-SILVA, DARIO, 2019. Adaptive Multiple Crossover Genetic Algorithm to Solve Workforce Scheduling and Routing Problem Journal of Heuristics. 25(4-5), 753-792PINHEIRO, RODRIGO LANKAITES, LANDA-SILVA, DARIO, LAESANKLANG, WASAKORN and CONSTANTINO, ADEMIR APARECIDO, 2019. An Efficient Application of Goal Programming to Tackle Multiobjective Problems With Recurring Fitness Landscapes. In: Operations Research and Enterprise Systems 966. Springer. 134-152NING XUE, DARIO LANDA-SILVA, GRAZZIELA P. FIGUEREDO and ISAAC TRIGUERO, 2019. A Simulation-Based Optimisation Approach for I",
  "content_length": 34861,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:15"
}