{
  "name": "Dario Catalano",
  "homepage": "https://catalano.dmi.unict.it",
  "status": "success",
  "content": "Dario Catalano :::: MENU :::: Homepage I am a full professor at University of Catania. Before joining the University of Catania as a faculty, I used to be a full time researcher at the French CNRS. In particular, I was part of the Crypto Team, at the Laboratoire d’Informatique de l’Ecole Normale Supérieure, in Paris for five years (1 as a postdoc and 4 as a CNRS researcher). I did both my graduate and my undergraduate studies at the University of Catania. During my Ph.D.  I spent more than two years in New York City, where I was affiliated with the Computer Science Department of Columbia University and with the Security Group of the IBM T.J. Watson Research Center. My advisor was Rosario Gennaro from IBM. Research Over the last 25 years, my research activity has been concerned with cryptography and, in particular, to reducing the gap between theory and practice in cryptography. My research agenda mostly concentrates on foundational issues inspired by practical needs and on questions related to the realizations of secure and efficient cryptographic constructions addressing such needs. Such topics include, for example, password based cryptography, electronic voting and, in particular, cryptographic primitives with special properties (e.g. homomorphic signatures and MACs, searchable encryption). In the early stages of my career I was also interested in the theory of machine learning. Program Committes IACR Crypto 2015, 2016, 2019, 2024 (Area chair). IACR Eurocrypt 2007, 2012, 2014, 2016, 2024, 2025. IACR TCC 2010 IACR PKC 2010, 2012, 2016, 2018, 2019, 2023. SCN 2006, 2008, 2012, 2018 (PC Chair), 2020, 2022, 2024 ACM CCS 2023. CT-RSA 2008 ACNS 2008, 2009, 2011, 2015 Africacrypt 2009, 2011, 2014, 2016, 2018. Secrypt 2016, 2017, 2018. Editorial Boards IEEE Transactions on Dependable and Secure Computing (2016-2020) Department of Mathematics and Computer Science University of Catania Crypto @ DMI Search for:",
  "content_length": 1934,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:11"
}