{
  "name": "Dario Paccagnan",
  "homepage": "https://www.doc.ic.ac.uk/~dp414",
  "status": "success",
  "content": "Dario's webpage Dario Paccagnan Senior Lecturer (US Associate Professor) Computational Optimization Group Department of Computing Imperial College London Email contact protected by JavaScript I am a Senior Lecturer (US Associate Professor) and a member of the Computational Optimization Group in the Department of Computing, Imperial College London. Previously, I was a Postdoctoral Fellow at the Center for Control, Dynamical System, and Computations, UCSB hosted by Prof. Francesco Bullo and Prof. Jason Marden. I received a PhD in optimization and control from ETH Zurich under the guidance of Prof. John Lygeros. I was awarded a B.Sc. and two M.Sc. degrees from the University of Padova, and the Technical University of Denmark under the TIME double degree program. Research: I am interested in the modeling, analysis, and control of multi-agent systems. I am also interested in safe control and learning theory. My research leverages both theoretical models and real-world applications. Applications: future mobility and electricity markets. Keywords: game theory, controls, learning, optimization. Selected Publications NeurIPS '23 spotlight [Paper], [Flash talk], [Code] Operations Research '23 [Paper], [Flash talk], [Full talk], [Slides] Annual Reviews in Control '22 [Paper], [Code] IEEE TAC '20/'22 [Paper part I], [Part part II] News 2025 May: Thrilled that our AISTATS ’25 paper was recognized with the best student paper award! [photo] 2025 May: In our AISTATS ’25 oral, we show that subset-of-data methods to train Gaussian Processes are self-certified, i.e., they come with tight out-of-sample guarantees 2025 Apr: It has been fantastic to present Pick-to-Learn to some of the most exciting research groups in the west coast! A thousand thanks to Marco Pavone (Stanford), Shankar Sastry (UC Berkeley), Adam Wierman (Caltech), Boris Ivanovic (NVIDIA), Francesco Bullo and Jason Marden (UCSB), Jorge Poveda (UCSD), Lars Lindemann (USC) 2025 Apr: Kai presented WardropNet at ICLR ’25: surprisingly simple combinatorial layers are good at predicting traffic patterns 2025 Mar: Exciting to be collaborating with Gioele Zardini (MIT) thanks to the MIT-IMPERIAL Seed Fund 2024 December: In our WINE '24 paper, Miriam studies the power and limitations of fair interventions in weighted congestion games. 2024 Feb: It seems I have been lagging behind with the updates in the last year. Here are some recent highlights: excited about our NeurIPS '23 spotlight paper on compression, Aamal's ICML '23 work on tradeoffs in learning in games, our Operations Research '23 paper on taxes and social optima in congestion games, and being promoted to Senior Lecturer in Sept 2023! 2023 Sept: In our recent NeurIPS spotlight paper, Marco Campi, Simone Garatti and I show how any black-box learning algorithm can be turned into a compression scheme, thus allowing to jointly learn models with state-of-the-art performance and obtain tight generalization bounds. 2022 Feb: Congratulations to Keyang for his work \"Competition and Inefficiency in Urban Last-Mile Delivery\" to appear at AAMAS'22 2022 Feb: In congestion games, minimizing the Price of Anarchy has undesirable consequences on the Price of Stability, see Rahul's work - 2021 Nov: Starting from November, Aris and I are organising \"Frontiers in Economics and Computation - UK\" a monthly seminar series on Economics and Computation, Game Theory, Optimisation in a broad sense 2021 Sep: At CDC'21, we are organizing the workshop \"Control for Autonomous Cities\". Excited about the speakers lineup! 2021 May: In recent work to appear at EC'21, we determined tight hardness of approximation for congestion games and matching polynomial time algorithms 2021 Mar: Our work on optimal taxes in congestion games will appear on ACM Trans. on Economics and Computation 2021 Feb: Congratulations to Rahul for his work accepted at AAMAS'21 2021 Feb: The second part of our work on computing and optimizing the efficiency in distributed systems has been published to IEEE TAC 2021 Jan: Stochasticity and surveillance: how should a robot surveil a region and be unpredictable? Read more about it on Xiaoming's new paper on IEEE TCNS 2021 Jan: Max and I have been awarded the Imperial-TUM Collaboration Fund to warm-start our collaboration 2021 Jan: Our work on Inertial Nash equilibria has been published on IEEE TAC - 2020 Dec: I have been invited to speak at the Dynamics in Social and Economic Networks Workshop, CDC 2020 2020 Dec: I am serving as Program Committee member at IJCAI 2021 (30th International Joint Conference on Artificial Intelligence), AAMAS 2021 (20th International Conference on Autonomous Agents and Multiagent Systems), SAGT 2020 (13th Symposium on Algorithmic Game Theory) 2020 Aug: How can a team of individuals learn to share a task optimally? A simple \"assign and appraise\" approach might suffice, see our preprint 2020 June: I have been selected as one of the four finalists for the EECI Best PhD Award for 2019 2020 Mar: We developed resalloc-poa – a package to compute optimal tolls in atomic congestion games – [Github repo] - 2019 Dec: Surprisingly, computing optimal tolls in atomic congestion games is a tractable linear program, see our new preprint 2019 Dec: The first part of our work on computing and optimizing the efficiency in distributed systems has been accepted to IEEE TAC 2019 Nov: I am honored to receive the ETH medal in recognition for an outstanding PhD dissertation – [Picture] 2019 Nov: We posted our work on \"Optimal mechanisms for distributed resource-allocation\" co-authored with R. Chandan and J. Marden 2019 July: The paper \"The scenario approach meets uncertain variational inequalities and game theory\" co-authored with M. Campi was accepted to IEEE CDC 2019 2019 July: Our manuscript on Generalized Smoothness - a novel technique to bound the Price of Anarchy - was accepted to IEEE CDC 2019 2019 June: The paper \"Computing optimal taxes in atomic congestion games\" co-authored with R. Chandan, B. Ferguson, J. Marden was accepted to NetEcon 2019 2019 Mar: Our newly posted work aims at bridging the gap between uncertain game theory, the scenario approach, and uncertain variational inequalities 2019 Feb: I joined UC Santa Barbara as Postdoctoral Fellow advised by Prof. Francesco Bullo 2019 Jan: The Swiss National Science Foundation awarded me the Early Postdoc Mobility Fellowship 2018 Dec: I successfully defended my PhD at ETH Zurich, advised by Prof. John Lygeros – [Slides], [Dissertation] Top",
  "content_length": 6517,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:15"
}