{
  "name": "Dario Fiore 0001",
  "homepage": "http://www.dariofiore.it",
  "status": "success",
  "content": "Dario Fiore | IMDEA Software Institute About・ Publications・ Teaching・ Contacts About me I am an Associate Research Professor at the IMDEA Software Institute in Madrid, Spain. I joined IMDEA Software in 2013 after holding postdoctoral positions at Max Planck Institute for Software Systems (Germany), New York University (USA), and École Normale Supérieure (France). I received a Ph.D. in Computer Science from University of Catania (Italy) in March 2010, supervised by Dario Catalano. During my Ph.D. I was also a visiting student at New York University with Yevgeniy Dodis, and IBM Research T.J. Watson with Rosario Gennaro. See my CV for more details. Research interests My research interests are on theoretical and practical aspects of Cryptography and its applications to Security & Privacy. My research especially focuses on advancing the efficiency of cryptographic protocols. Some of the topics I work on include: secure delegation of data and computation, computation on encrypted data, commitment schemes, (zero-knowledge) proof systems, homomorphic authentication, and foundations of cryptography. The full list of my publications (also on Google Scholar, DBLP). Research group Hamza Abusalah (Postdoc, May’22–present) Daniele Cozzo (Postdoc, Oct’22–present; supported by a Juan de la Cierva grant) Gennaro Avitabile (Postdoc, Dec’22–present; supported by a Juan de la Cierva grant) Mahak Pancholi (Postdoc, Jul’24–present; supported by a Villum Foundation grant) David Balbás (PhD student, Oct’21-present, supported by an FPU grant) Gaspard Anthoine (PhD student, Sep’22-present) Douglas Li (PhD student, Dec’24-present) Damien Robissout (Research programmer, Jan’22-present) Hossein Hafezi (Visiting PhD student, Feb’25-present) Georgios Raikos (Research intern, Oct’24-present) Gonzalo Martínez de Sola (Research intern (UCM), Feb’25-present) I am always looking for talented, highly motivated students and postdocs interested in Cryptography. If you are interested to work with me, especially on exciting topics such as zero-knowledge proofs, zkSNARKs, computation on encrypted data, please do not hesitate to get in touch with me. Alumni: PhD students: Luca Nizzardo (Sep’14-May’18 → Research Scientist @ Protocol Labs); Elena Pagnin (2015-Sep’18 → Assist Prof @ Chalmers); Anca Nitulescu (2015-2019 → Research Scientist @ Protocol Labs); Anaïs Querol (Oct’18-Sep’22 → O(1) Labs); Dimitris Kolonelos (Feb’19-Feb’24) Postdocs: Peter Chvojka (Oct’21-Sep’22); Lydia Garms (Apr’21-Apr’22 → Keyless); Ida Tucker (Oct’20-Jan’22 → Zondax); Antonio Faonio (Jan’17-Jun’20 → Assist Prof @ EURECOM); Matteo Campanelli (Feb’18-Jul’20 → Research Scientist @ Protocol Labs); Miguel Ambrona (Jan-May’19 → Research Scientist @ Nomadic Labs) Visitors: ; Gennaro Avitabile (From U. of Salerno, Jan–Nov’22); Hamidreza Khoshakhlagh (From Aarhus U., Oct’21–Jan’22); Elijah Grubb (From UMD, Sep-Dec’19). Projects / Funding ERC Consolidator Grant PICOCRYPT (2021-2026; PI) NEC Laboratories Europe (2025; PI) Maria de Maeztu unit of excellence (2025-2029; participant) ESPADA (2023-2027; Participant) Program Committees and Editorial Boards General Co-Chair: Eurocrypt 2025, Madrid. Current/Upcoming PCs: Eurocrypt 2026, ACM CCS 2026. Editorial boards: International Journal of Applied Cryptography Recent: SCN 2024, Eurocrypt 2024, ACM CCS 2023 (Chair of the Applied Cryptography track), Eurocrypt 2023. Recent/upcoming talks Zero-Knowledge Proofs for Verifiable Computation on Encrypted data @ Foundations and Applications of Zero-Knowledge Proofs, Edinburgh, UK, September 6, 2024. Zero-Knowledge Proofs for Secure and Private Machine Learning @ Foundations and Applications of Zero-Knowledge Proofs, Edinburgh, UK, September 6, 2024. Witness Encryption for Succinct Functional Commitmsnts @ PKC 2024, Sydney, Australia, April 15, 2024. Succinct and Functional Vector Commitments @ IMACC 2023, December 13, 2023. Simulation Extractable zkSNARKs @ Privacy Scaling Learn & Share, virtual, November 8, 2023. Vector Commitments @ De Cifris Trends, virtual, October 16, 2023. Security Notions of NIZKs: from Soundness to Simulation Extractability @ Crypto Lounge Experience, Barcelona, July 29, 2023. Efficient Zero-Knowledge Proofs on Signed Data with Applications to Verifiable Computation on Data Streams @ ACM CCS 2022, November 10, 2022. Efficient and Universally Composable Single Secret Leader Election from Pairings @ ConsensusDay22 (co-located with ACM CCS’22), November 7, 2022. Vector Commitments: From Theory to Practice, and Back Again @ RECSI 2022, October 2022. On the impossibility of algebraic vector commitments in pairing-free groups @ Aarhus University, June 2022. A journey in vector commitments @ Vector Commitment Research Day, March 2022. Succinct Zero-Knowledge Batch Proofs for Set Accumulators @ Nomadic Labs research seminars, February 2022. A journey in vector commitments. Keynote @ IWSEC 2021, September 2021. Cryptography for Privacy and Integrity of Computation on Untrusted Machines @ “Summer seminars on cybersecurity”, Department of Computer, Control and Management Engineering of Sapienza University of Rome, June 2021. A summary of past research activities",
  "content_length": 5296,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:15"
}