{
  "name": "Darren Gergle",
  "homepage": "http://dgergle.soc.northwestern.edu",
  "status": "success",
  "content": "Darren Gergle, Northwestern University Northwestern University Darren Gergle Latest News I am honored to be named as the John G. Searle Professor at Northwestern University starting Fall 2020.Our paper, \"It doesn't win you friends\": Understanding Accessibility in Collaborative Writing for People with Vision Impairments (with Maitraye Das and A.M. Piper) received a Best Paper, Honorable Mention Award at CSCW 2019!Our paper, \"Addressing Age-Related Bias in Sentiment Analysis\" (with Mark Díaz, I. Johnson, A. Lazar and A.M. Piper) received a Best Paper Award at CHI 2018! I am the Bao Family Professor of Human-Computer Interaction in the Department of Communication Studies and the Department of Computer Science (by courtesy) at Northwestern University, where I direct the CollabLab: The Laboratory for Collaborative Technology. I am also a co-founder and co-director of Northwestern's Center for Human-Computer Interaction + Design (HCI+D).My research is broadly in the fields of Human-Computer Interaction (HCI) and Computer-Supported Cooperative Work (CSCW) and Social Computing. I have an interest in developing a theoretical understanding of the role that visual information plays in supporting communication and group interactions. A key component of my work is the application of social and cognitive psychology theory to the design, development, deployment and evaluation of computing technologies.I also hold a number of other positions at Northwestern University: Formerly, I served as the Director of Graduate Studies, Technology and Social Behavior PhD program (~2010-2020)Co-chair and founding faculty of the Faculty Research Council of the Segal Design InstituteFaculty Associate of the Northwestern University Cognitive Science ProgramFellow of the Communications Residential College (CRC)",
  "content_length": 1808,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:21"
}