{
  "name": "Darío Ernesto Correal Torres",
  "homepage": "https://profesores.virtual.uniandes.edu.co/dcorreal/es/inicio",
  "status": "success",
  "content": "Darío Ernesto Correal Torres Darío Ernesto Correal Torres Profesor Asociado Grupo:: Research Group: TICSw-Tecnologías de Información y Construcción de Software Contacto: Oficina: Office: ML 769 Correo: Email: Extensión: Extension: 3891 Formación Investigación Publicaciones Cursos Dictados Proyectos Brief CV Ph.D. en Ingeniería, Universidad de los Andes, Colombia Magíster en Ingeniería de Sistemas y Computación, Universidad de los Andes, Colombia Ingeniero de Sistemas y Computación, Universidad de los Andes, Colombia Intereses y líneas de Investigación: Desarrollo de software basado en modelos Modelado de dominios específicos Arquitecturas orientadas a servicios Grupo:: Research Group: TICSw-Tecnologías de Información y Construcción de Software Filtrar Tipo de publicación: Todos los tipos Software Patente y Solicitud de Patente Otro Propuesta a Colciencias (o entidades afines) Evento Propuesta internacional de investigación Artículo Libro Capítulo de libro Capítulo en Memoria Caso de Estudio Otra Producción Bibliográfica Columna de Opinión Tesis A partir de: 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023 2024 2025 Filtrar Limpiar Desarrollo de soluciones blockchain: evaluación comparativa entre Noir y Circom en la implementación de pruebas de conocimiento cero. Tesis 2025 .(2025). Desarrollo de soluciones blockchain: evaluación comparativa entre Noir y Circom en la implementación de pruebas de conocimiento cero..Trabajo Dirigido por: Correal D - 2025 Privacidad, identidad y eficiencia: mejorando pagos transfronterizos con Hyperledger Besu y tecnologías blockchain Tesis 2025 .(2025). Privacidad, identidad y eficiencia: mejorando pagos transfronterizos con Hyperledger Besu y tecnologías blockchain.Trabajo Dirigido por: Correal D - 2025 A Comprehensive View on TD Prevention Practices and Reasons for not Preventing It Artículo 2024 Correal D, Perez B, Castellanos C. (2024) A Comprehensive View on TD Prevention Practices and Reasons for not Preventing It. ACM Transactions on Computer-Human Interaction (ISSN 1073-0516) 1 (1), pp. 1-10. - 2024 An innovative cost taxonomy: identifying and classifying costs of technology solutions Artículo 2024 Correal D, Peña Y, Oscar Gonzalez-Rojas. (2024) An innovative cost taxonomy: identifying and classifying costs of technology solutions. International Journal Of Business Information Systems (ISSN 1746-0980) 45 (3), pp. 397-428. - 2024 Arquitectura y desarrollo de soluciones Blockchain Tesis 2024 .(2024). Arquitectura y desarrollo de soluciones Blockchain.Trabajo Dirigido por: Correal D - 2024 Desarrollo de soluciones blockchain: Plataforma de perfiles financieros para el servicio de Open Banking, a través de pruebas de conocimiento cero Tesis 2024 .(2024). Desarrollo de soluciones blockchain: Plataforma de perfiles financieros para el servicio de Open Banking, a través de pruebas de conocimiento cero.Trabajo Dirigido por: Correal D - 2024 Design for a scalable self-custody and recollection model for digital assets Tesis 2024 .(2024). Design for a scalable self-custody and recollection model for digital assets.Trabajo Dirigido por: Correal D, Montes F - 2024 Evaluating the transition from HPA to KEDA in an Event-Driven Architecture Deployed in Kubernetes Tesis 2024 .(2024). Evaluating the transition from HPA to KEDA in an Event-Driven Architecture Deployed in Kubernetes.Trabajo Dirigido por: Correal D - 2024 Generative AI for software architecture Tesis 2024 .(2024). Generative AI for software architecture.Trabajo Dirigido por: Correal D - 2024 Identidad auto soberana con tecnologías Blockchain en el mundo bancario: ¿Es viable? Tesis 2024 .(2024). Identidad auto soberana con tecnologías Blockchain en el mundo bancario: ¿Es viable?.Trabajo Dirigido por: Correal D - 2024 Inteligencia Artificial Generativa para Arquitectura de Software Tesis 2024 .(2024). Inteligencia Artificial Generativa para Arquitectura de Software.Trabajo Dirigido por: Correal D - 2024 Pagos transfronterizos bancarios por medio de redes privadas de blockchain Tesis 2024 .(2024). Pagos transfronterizos bancarios por medio de redes privadas de blockchain.Trabajo Dirigido por: Correal D - 2024 Proyecto AsiLo: Asistente de Sistemas Logísticos Tesis 2024 .(2024). Proyecto AsiLo: Asistente de Sistemas Logísticos.Trabajo Dirigido por: Correal D - 2024 Gestión documental en Blockchain Tesis 2023 .(2023). Gestión documental en Blockchain.Trabajo Dirigido por: Correal D - 2023 Implementación e integración de un servicio de identificación mediante el uso de una identidad digital descentralizada. Tesis 2023 .(2023). Implementación e integración de un servicio de identificación mediante el uso de una identidad digital descentralizada..Trabajo Dirigido por: Correal D - 2023 Securing a National Driver and Vehicle Registration System with Blockchain Capítulo en Memoria 2023 Correal D, Florez L. (2023) Securing a National Driver and Vehicle Registration System with Blockchain. ICSA 2023 IEEE 20th International Conference on Software Architecture Companion (ICSA-C) (ISBN 2768-4288 ) Italia. - 2023 Software practitioners’ point of view on technical debt payment Artículo 2023 Correal D. (2023) Software practitioners’ point of view on technical debt payment. Journal of Systems and Software (ISSN 0164-1212) 196 (-), pp. ---. - 2023 Análisis del funcionamiento y las transacciones ocurridas entre diciembre de 2019 y octubre de 2022, en los principales contratos inteligentes de Ethereum-Tornado-Cash, relacionado con el lavado de más de 7 billones de dólares. Tesis 2022 .(2022). Análisis del funcionamiento y las transacciones ocurridas entre diciembre de 2019 y octubre de 2022, en los principales contratos inteligentes de Ethereum-Tornado-Cash, relacionado con el lavado de más de 7 billones de dólares..Trabajo Dirigido por: Correal D - 2022 Archiflow: a diagramming tool for deploying model-based architectures Tesis 2022 .(2022). Archiflow: a diagramming tool for deploying model-based architectures.Trabajo Dirigido por: Correal D - 2022 Asset tokenization in real estate through the means of token standards available on the ethereum blockchain Tesis 2022 .(2022). Asset tokenization in real estate through the means of token standards available on the ethereum blockchain.Trabajo Dirigido por: Correal D - 2022 2015 2015-10 ARQUITECTURA DE SOLUCION COMUNICACION EFECTIVA PROCESOS DE DESARROLLO AGILES PROYECTO FINAL 2015-19 ARQUITECTURA SW ÁGIL 2015-20 ESTRUCTURAS DE DATOS ARQUITECTURA Y DISEÑO DE SW LAB. ARQUITEC. Y DISEÑO DE SW PROYECTO FINAL ARQUITECTURA DE SOLUCION ARQUITECTURA SW ÁGIL LAB. ESTRUCTURAS DATOS 2016 2016-10 ARQUITECTURA SW ÁGIL PROYECTO FINAL ARQUITECTURA DE SOLUCION ARQUITECTURAS NUEVA GENERACIÓN ESTRUCTURAS DE DATOS 2016-18 POWER PEOPLE 2016-19 ARQUITECTURAS NUEVA GENERACIÓN 2016-20 ESTRUCTURAS DE DATOS PROYECTO FINAL ARQUITECTURA SW ÁGIL ARQUITECTURA DE SOLUCION LAB. ESTRUCTURAS DATOS 2017 2017-10 ARQUITECTURA SW ÁGIL ESTRUCTURAS DE DATOS ARQUITECTURAS NUEVA GENERACIÓN LAB. ESTRUCTURAS DATOS PROYECTO FINAL 2017-18 INTELLIGENT SYS. ARCHITECTURE 2017-20 ESTRUCTURAS DE DATOS PROYECTO FINAL ARQUITECTURA SW ÁGIL ARQUITECTURA DE SOLUCION LAB. ESTRUCTURAS DATOS 2018 2018-10 LAB. ESTRUCTURAS DATOS ESTRUCTURAS DE DATOS PROYECTO FINAL ARQUITECTURA SW ÁGIL ARQUITECTURAS NUEVA GENERACIÓN 2018-20 ARQUITECTURA Y DISEÑO DE SW ARQUITECTURA DE SOLUCION PROYECTO FINAL ARQUITECTURA SW ÁGIL INTR PENSAMIENTO COMPUTACIONAL 2019 2019-10 INTR PENSAMIENTO COMPUTACIONAL ARQUITECTURA DE SOFTWARE ARQUITECTURA SW ÁGIL PROYECTO FINAL ARQUITECTURA DE SOLUCION ARQUITECTURA Y DISEÑO DE SW 2019-18 MILESTONE DRIVEN AGILE EXEC. 2019-20 ARQUITECTURA DE SOLUCION ARQUITECTURA DE SOFTWARE PROYECTO FINAL ARQUITECTURA Y DISEÑO DE SW ARQUITECTURA SW ÁGIL 2020 2020-10 ARQUITECTURA DE SOLUCIÓN PROYECTO FINAL ARQUITECTURA SW ÁGIL ARQUITECTURA DE SOFTWARE ESTRUC. DE DATOS Y ALGORITMOS 2020-15 PRINC.DISEÑO ARQU.SOFTWARE 2020-18 ARQUITECTURAS PARA BIG DATA 2020-20 ESTRUC. DE DATOS Y ALGORITMOS ARQUITECTURAS NUEVA GENERACIÓN PROYECTO FINAL 2021 2021-10 ARQUITECTURAS NUEVA GENERACIÓN PROYECTO FINAL ESTRUC. DE DATOS Y ALGORITMOS NIVELATORIO MODELAJE SOFTWARE ARQUITECTURA DE SOFTWARE 2021-11 PRINC.DISEÑO ARQU.SOFTWARE 2021-14 ARQUITECTURAS ÁGILES DE SW. 2021-20 NIVELATORIO MODELAJE SOFTWARE PROYECTO FINAL ARQUITECTURA DE SOLUCIÓN ESTRUC. DE DATOS Y ALGORITMOS 2022 2022-10 PRINC.DISEÑO ARQU.SOFTWARE PROYECTO FINAL PROYECTO DE GRADO ESTRUC. DE DATOS Y ALGORITMOS ARQUITECTURA Y DISEÑO DE SW ARQUITECTURA DE SOLUCIÓN 2022-11 PRINC.DISEÑO ARQU.SOFTWARE 2022-14 PROYECTO INTEGRADOR I ARQUITECTURAS ÁGILES DE SW. PRINC.DISEÑO ARQU.SOFTWARE 2022-15 PROYECTO INTEGRADOR I PROYECTO INTEGRADOR II 2022-20 ARQUITECTURA Y DISEÑO DE SW PROYECTO DE GRADO ARQUITECTURA DE SOFTWARE ARQUITECTURAS NUEVA GENERACIÓN PROYECTO FINAL 2023 2023-10 PROYECTO DE GRADO ARQUITECTURA Y DISEÑO DE SW ARQUITECTURA DE SOFTWARE PROYECTO FINAL ARQUITECTURA DE SOLUCIÓN 2023-11 PROYECTO INTEGRADOR I PRINC.DISEÑO ARQU.SOFTWARE ARQUITECTURAS ÁGILES DE SW. PROYECTO INTEGRADOR II 2023-12 PROYECTO INTEGRADOR II PROYECTO INTEGRADOR I 2023-14 ARQUITECTURAS ÁGILES DE SW. PROYECTO INTEGRADOR II PRINC.DISEÑO ARQU.SOFTWARE PROYECTO INTEGRADOR I 2023-15 PROYECTO INTEGRADOR II 2023-18 DEUDA TÉCNICA EN ARQ SOFTWARE 2023-20 ARQUITECTURAS NUEVA GENERACIÓN PROYECTO FINAL ARQUITECTURA DE SOLUCIÓN (BC) ARQUITECTURA DE SOFTWARE ARQUITECTURA Y DISEÑO DE SW PROYECTO DE GRADO 2024 2024-10 ARQUITECTURA DE SOLUCIÓN PROYECTO DE GRADO ARQUITECTURAS ÁGILES DE SW. ARQUITECTURA Y DISEÑO DE SW ARQUITECTURA DE SOFTWARE (BC) ARQUITECTURA DE SOFTWARE PROYECTO FINAL PRINC.DISEÑO ARQU.SOFTWARE 2024-11 PROYECTO INTEGRADOR I PRINC.DISEÑO ARQU.SOFTWARE ARQUITECTURAS ÁGILES DE SW. 2024-12 PROYECTO INTEGRADOR II 2024-14 ARQUITECTURAS ÁGILES ",
  "content_length": 14461,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:27"
}