{
  "name": "Dave Levin",
  "homepage": "http://www.cs.umd.edu/~dml",
  "status": "success",
  "content": "Dave Levin - University of Maryland Measuring and Improving Internet Security Associate Professor Computer Science Co-Chair, CS Undergraduate Honors Program Originally, the Internet was a collaborative effort among researchers, but has since evolved into a marketplace comprising millions of commercial entities and billions of users who often have conflicting goals. My work builds off of the belief that we can secure the Internet by understanding and accounting for these competing interests. I empirically measure security on the Internet to understand how security breaks down, and I apply economics and cryptography to design and build new systems with provable and usable security. I study the web's PKI, censorship avoidance, DNS root servers, and more. I have been fortunate to work with many wonderful collaborators. See my CV for more information. I'm looking for students I am an Associate Professor at the University of Maryland. I am looking for ambitious, motivated PhD and undergraduate students to work with. If you're interested in systems and network security, then: About working with me Announcing Breakerspace I am the founder of Breakerspace, a lab for group undergraduate research in computer and network security. CS enrollment is skyrocketing: Breakerspace's goal is to scale research so more students can try it. We are actively looking for participants. Learn More Join CS Honors I am the Chair of the UMD CS Departmental Honors. This program helps students get involved in research, get more engaged with the department, and overall Do Good. If you are a UMD CS student with a good GPA and are looking for a challenge, apply! Learn More News 10/13/2025 Our work detecting satellites broadcasting sensitive information in the clear has been covered by Wired. Read the full article here. 11/21/2022 I was featured in a Packet Pushers podcast in which we discussed how I got into academia, why I actually kind of like applying for grants, and why I did not pursue my original love: tuba! 11/09/2022 Our paper on \"Hammurabi: A Framework for Pluggable, Logic-based X.509 Certificate Validation Policies\" received a Best Paper Honorable Mention from ACM CCS 2022! Congrats to my coauthors, including the five Breakerspace undergraduate researchers! 08/10/2022 Rising junior Frederick Sell presented our paper \"GET /out: Automated Discovery of Application-Layer Censorship Evasion Strategies\" at USENIX Security 2022. See the talk video here. 05/24/2022 Have you ever noticed the VPN ads in YouTube? Omer Akgul presented our paper \"Investigating Influencer VPN Ads on YouTube\" at IEEE Security & Privacy that shows how technically unsound they can be. See the talk video here. Research My research measures and improves real-world security. I envision an Internet where users have greater control and understanding of what happens to their data. Recently, I've been studying the web's certificate ecosystem, cloud computing, and censorship-avoidance. Projects Papers Teaching Fall 2023, I'm teaching: CMSC 614: Graduate Security CMSC 396H: Undergrad Honors Seminar I also helped design and run the Build it, break it, fix it secure programming competition that gives students firsthand experience with building secure code. All My Classes Service I'm on the committees for IEEE S&P 2023 (Oakland) and PAM 2020. Submit your work! I was the General Chair for ACM Internet Measurement Conference (IMC) 2021\", the ACM Symposium on SDN Research (SOSR) 2017, and HotNets 2013. I regularly serve on program committees and NSF panels, and have also visited Congress to discuss increasing nationwide funding for scientific research. All Service Contact @DistributedDave dml@cs.umd.edu 5222 Iribe Center 301-405-8515 (I rarely check vmail) Map",
  "content_length": 3755,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:26"
}