{
  "name": "Dave Jing Tian",
  "homepage": "https://davejingtian.org",
  "status": "success",
  "content": "davejingtian.org | Still got dreams; still got hopes… davejingtian.org Still got dreams; still got hopes… Skip to content Blog About Publications Students Teaching Python Quotes Sponsors HWS ← Older posts Borland Turbo C++ 3.0 on MacOS Posted on April 9, 2023 by daveti The recent post from Hackaday on Borland Turbo C/C++ [1] managed to trigger my nostalgia, when I needed to pass some national programming testing in C as an undergrad in China over 20 years ago, and it was Borland Turbo C 1.0. Anyway, this post is about running Borland Turbo C++ 3.0 on my MacOS. Nothing complicated albeit some caveats. 1. Get DOSBox This is a no-brainer. Go get it at [2]. 2. Get Borland Turbo C++ 3.0 I decided to go with Turbo C++ 3.0 because of the syntax highlight, especially the green color:) Fetch your beloved TC at [3]. I used the 3.5” version. 3. Install and Run TC After unzip the TC3, there should be five disk image files (Disk01-05.img). These are floppy disk image files. One caveat here is that we need to extract the original installation files from these five images. Belive or not, MacOS gave me some hard time on this, since I’ve never figured out how its mount works (compared to the Linux one). Nevertheless, “Disk Utility” came to save, which can easily mount these floppy disk images under /Volumes. Create a local directory, e.g., “/Users/daveti/install”, and extract all the files from these five images into the install directory. Create a target directory, e.g., “/Users/daveti/dos/tc”, where TC will be installed. Start Dosbox: mount c /Users/daveti/dos mount a /Users/daveti/install Then change to A: and run “INSTALL.EXE” to install TC under “C:\\TC” by default. 4. Run TC Since I have configured my DOSBox yet, I need to mount C: before I could run TC. Once mounted, change to C:\\TC\\BIN, and run “TC.EXE”. References: [1] https://hackaday.com/2023/04/08/revisiting-borland-turbo-c-and-c/ [2] https://www.dosbox.com/ [3] https://winworldpc.com/product/turbo-c/3x Posted in OS, Programming | Tagged Borlan, DiskUtil, DOSBOX, MacOS, TC, TurboC | 1 Comment SafeThings 2023 Posted on December 29, 2022 by daveti SafeThings 2023 IEEE/ACM Workshop on the Internet of Safe Things Co-located with CPS-IoT Week 2023 » San Antonio, Texas USA, May 9, 2023 The Internet of Things has become increasingly popular and innovative. With the rise of connected devices, we have an opportunity to significantly improve the safety of legacy systems. For instance, insights from data across systems can be exploited to reduce accidents, improve air quality and support disaster events. IoT-based cyber-physical systems (CPS) also bring new risks that arise due to the unexpected interaction between systems and the larger number of attack vectors on these systems. These safety risks can arise in the context of use of medical devices, smart home appliance control, autonomous vehicle and intelligent transportation designs, or conflicts in policy execution at a societal scale.The Workshop on the Internet of Safe Things seeks to bring together researchers to create solutions for the development of safe cyber-physical systems. As safety is inherently linked with the security and privacy of a system, we also seek contributions in these areas that address safety concerns. We seek to develop a community that systematically dissects the vulnerabilities and risks exposed by these emerging CPSs, and creates tools, algorithms, frameworks, and systems that help in the development of safe systems.We seek contributions across domains – autonomous vehicles, smart homes, medical devices, smart grid, intelligent transportation; and across disciplines – systems, control, human-computer interaction, privacy, security, reliability, machine learning, and verification. Important Dates Paper Submission DeadlineJanuary 28th February 4th, 2023 (AoE, UTC-12)Acceptance NotificationFebruary 21th February 28th, 2023Camera-ready Submission DeadlineMarch 5th March 12th, 2023 (AoE, UTC-12)WorkshopMay 26th, 2023 Call for Papers As the traditionally segregated systems are brought online for next-generation connected applications, we have an opportunity to significantly improve the safety of legacy systems. For instance, insights from data across systems can be exploited to reduce accidents, improve air quality and support disaster events. Cyber-physical systems (CPS) also bring new risks that arise due to the unexpected interaction between systems and the environment. These safety risks arise because of information that distracts users while driving, software errors in medical devices, corner cases in data-driven control, compromised sensors in drones or conflicts in societal policies. Accordingly, the Workshop on the Internet of Safe Things (or SafeThings, for brevity) seeks to bring researchers and practitioners that are actively exploring system design, modeling, verification, authentication approaches to provide safety guarantees in the Internet of Things (IoT). The workshop welcomes contributions that integrate hardware and software systems provided by disparate vendors, particularly those that have humans in the loop. As safety is inherently linked with security and privacy, we also seek contributions in these areas that address safety concerns. With the SafeThings workshop, we seek to develop a community that systematically dissects the vulnerabilities and risks exposed by these emerging CPSes, and create tools, algorithms, frameworks, and systems that help in the development of safe systems.The scope of SafeThings includes safety topics as it relates to an individual’s health (physical, mental), society (air pollution, toxicity, disaster events), or the environment (species preservation, global warming, oil spills). The workshop considers safety from a human perspective, and thus, does not include topics such as thread safety or memory safety in its scope.Topics of interest include, but are not limited to, the following categories: Verification of safety in IoT/CPS platforms Authentication in IoT/CPS settings Adversarial machine learning and testing of IoT/CPS systems Secure perception, localization, and planning in autonomous systems (e.g., autonomous vehicles and drones) Sensors/analog and network protocol security in IoT/CPS systems Compliance with legal, health, and environmental policies Conflict resolution between IoT applications Secure connectivity and updates in IoT/CPS Secure integration of hardware and software systems Privacy challenges in IoT/CPS settings Privacy preserving data sharing and analysis Resiliency against attacks and faults Safety in human-in-the-loop systems Support for IoT/CPS development – debugging tools, emulators, testbeds Usable security and privacy for IoT/CPS platforms Smart homes, smart buildings and smart city security and privacy issues In addition, application domains of interest include, but are not limited to autonomous vehicles and transportation infrastructure; medical CPS and public health; smart buildings, smart grid and smart cities.The PC will select a best paper award for work that distinguishes itself in moving the security and privacy of IoT/CPS forward through novel attacks or defenses. Call for Demos In addition to presentation of accepted papers, SafeThings will include a demo session that is designed to allow researchers to share demonstrations of their systems that include CPS/IoT security and safety as a major design goal. Demos of attacks are also welcome. Submission Instructions Submitted papers must be in English, unpublished, and must not be currently under review for any other publication. Manuscripts should be no more than 6 pages, including all figures, tables, and references in ACM two-column conference proceedings style (https://www.acm.org/publications/proceedings-template/), using US Letter (8.5-inch x 11-inch) paper size. Demos must be at most 1 single-spaced, double column 8.5” x 11” page, and have “Demo:” in their titles. All figures must fit within these limits. Papers that do not meet the size and formatting requirements will not be reviewed. All papers must be in Adobe Portable Document Format (PDF) and submitted through the web submission form via the submission link below. The review process is double-blind.Full Papers: 6 pages including all figures, tables, and references.Demos: 1 page (with “Demo:” in the title).Submission Page » ACM’s Publications Policies By submitting your article to an ACM Publication, you are hereby acknowledging that you and your co-authors are subject to all ACM Publications Policies, including ACM’s new Publications Policy on Research Involving Human Participants and Subjects. Alleged violations of this policy or any ACM Publications Policy will be investigated by ACM and may result in a full retraction of your paper, in addition to other potential penalties, as per ACM Publications Policy.Please ensure that you and your co-authors obtain an ORCID ID, so you can complete the publishing process for your accepted paper. ACM has been involved in ORCID from the start and we have recently made a commitment to collect ORCID IDs from all of our published authors. The collection process has started and will roll out as a requirement throughout 2022. We are committed to improve author discoverability, ensure proper attribution and contribute to ongoing community efforts around name normalization; your ORCID ID will help in these efforts. Organization General Chairs Yuan Tian (University of Califonia, Los Angeles, USA) Dave (Jing) Tian (Purdue University, USA) Program Committee Chairs Saman Zonouz (Georgia Institute of Technology, USA) Z. Berkay Celik (Purdue University, USA) Web Chair Faysal Hossain Shezan (University of Virginia, USA) Publicity Chair Habiba Farrukh (Purdue University, USA) Posted in Conference | Tagged CPS, IoT, SafeThings | Leave a comment IEEE Workshop on the Internet of Safe Things Posted on December 22, 2021 by daveti Dear Colleagues, Apologies if this reached you through m",
  "content_length": 70846,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:23"
}