{
  "name": "Dave Zachariah",
  "homepage": "https://www.uu.se/kontakt-och-organisation/personal?query=N13-1398",
  "status": "success",
  "content": "Dave Zachariah - Uppsala universitet Dave Zachariah Universitetslektor vid Institutionen för informationsteknologi; Systemteknik E-post: dave.zachariah@it.uu.seBesöksadress: Hus 10, Regementsvägen 10Postadress: Box 337751 05 UPPSALA Ladda ned kontaktuppgifter för Dave Zachariah vid Institutionen för informationsteknologi; Systemteknik Akademiska meriter: DocentCV: Ladda ned CV Kort presentation Associate professor at the division of Systems and Control and coordinator of the Machine Learning Arena. Research interests include: statistical machine learning & signal processing; decision theory & causal inference; localization & sensor fusion.Data-Driven Decisions and Control GroupPaper preprints available on arXivReproducible research accessible on github Publikationer Senaste publikationer Error Reduction in Leukemia Machine Learning Classification With Conformal Prediction Lysenkova, Mariya; Zachariah, Dave; Krali, Olga; Nordlund, Jessica Ingår i JCO Clinical Cancer Informatics, 2025 DOI för Error Reduction in Leukemia Machine Learning Classification With Conformal Prediction Ladda ner fulltext (pdf) av Error Reduction in Leukemia Machine Learning Classification With Conformal Prediction Safe Output Feedback Improvement with Baselines Zhang, Ruoqi; Mattsson, Per; Zachariah, Dave Ingår i 2024 IEEE 63rd Conference on Decision and Control (CDC), s. 1899-1904, 2024 DOI för Safe Output Feedback Improvement with Baselines Ladda ner fulltext (pdf) av Safe Output Feedback Improvement with Baselines Externally Valid Policy Evaluation from Randomized Trials Using Additional Observational Data Ek, Sofia; Zachariah, Dave 2024 Machine Learning Based Prediction of Imminent ICP Insults During Neurocritical Care of Traumatic Brain Injury Galos, Peter; Hult, Ludvig; Zachariah, Dave; Lewén, Anders et al. Ingår i Neurocritical Care, s. 387-397, 2024 DOI för Machine Learning Based Prediction of Imminent ICP Insults During Neurocritical Care of Traumatic Brain Injury Ladda ner fulltext (pdf) av Machine Learning Based Prediction of Imminent ICP Insults During Neurocritical Care of Traumatic Brain Injury Adaptive Robust Learning using Latent Bernoulli Variables Karakulev, Aleksandr; Zachariah, Dave; Singh, Prashant Ingår i Proceedings of the 41st International Conference on Machine Learning, s. 23105-23122, 2024 Ladda ner fulltext (pdf) av Adaptive Robust Learning using Latent Bernoulli Variables Alla publikationer Artiklar i tidskrift Error Reduction in Leukemia Machine Learning Classification With Conformal Prediction Lysenkova, Mariya; Zachariah, Dave; Krali, Olga; Nordlund, Jessica Ingår i JCO Clinical Cancer Informatics, 2025 DOI för Error Reduction in Leukemia Machine Learning Classification With Conformal Prediction Ladda ner fulltext (pdf) av Error Reduction in Leukemia Machine Learning Classification With Conformal Prediction Machine Learning Based Prediction of Imminent ICP Insults During Neurocritical Care of Traumatic Brain Injury Galos, Peter; Hult, Ludvig; Zachariah, Dave; Lewén, Anders et al. Ingår i Neurocritical Care, s. 387-397, 2024 DOI för Machine Learning Based Prediction of Imminent ICP Insults During Neurocritical Care of Traumatic Brain Injury Ladda ner fulltext (pdf) av Machine Learning Based Prediction of Imminent ICP Insults During Neurocritical Care of Traumatic Brain Injury Off-Policy Evaluation with Out-of-Sample Guarantees Ek, Sofia; Zachariah, Dave; Johansson, Fredrik D.; Stoica, Peter Ingår i Transactions on Machine Learning Research, 2023 Online Learning for Prediction via Covariance Fitting: Computation, Performance and Robustness Osama, Muhammad; Zachariah, Dave; Stoica, Peter; Schön, Thomas B. Ingår i Transactions on Machine Learning Research, 2023 Diagnostic Tool for Out-of-Sample Model Evaluation Hult, Ludvig; Zachariah, Dave; Stoica, Peter Ingår i Transactions on Machine Learning Research, 2023 Ladda ner fulltext (pdf) av Diagnostic Tool for Out-of-Sample Model Evaluation Min-Max Probe Placement and Extended Relaxation Estimation Method for Processing Blade Tip Timing Signals Wang, Zengkun; Stoica, Peter; Zachariah, Dave; Babu, Prabhu et al. Ingår i IEEE Transactions on Instrumentation and Measurement, 2023 DOI för Min-Max Probe Placement and Extended Relaxation Estimation Method for Processing Blade Tip Timing Signals Analysis of the Minimum-Norm Least-Squares Estimator and Its Double-Descent Behavior [Lecture Notes] Mattsson, Per; Zachariah, Dave; Stoica, Peter Ingår i IEEE signal processing magazine (Print), s. 39-75, 2023 DOI för Analysis of the Minimum-Norm Least-Squares Estimator and Its Double-Descent Behavior [Lecture Notes] Regularized Linear Regression via Covariance Fitting Mattsson, Per; Zachariah, Dave; Stoica, Peter Ingår i IEEE Transactions on Signal Processing, s. 1175-1183, 2023 DOI för Regularized Linear Regression via Covariance Fitting A shift from the problematic of \"transformation\" Cockshott, Paul; Zachariah, Dave Ingår i WORLD REVIEW OF POLITICAL ECONOMY, s. 463-471, 2022 DOI för A shift from the problematic of \"transformation\" Ladda ner fulltext (pdf) av A shift from the problematic of \"transformation\" Robust localization in wireless networks from corrupted signals Osama, Muhammad; Zachariah, Dave; Dwivedi, Satyam; Stoica, Petre Ingår i EURASIP Journal on Advances in Signal Processing, 2021 DOI för Robust localization in wireless networks from corrupted signals Ladda ner fulltext (pdf) av Robust localization in wireless networks from corrupted signals Scalable Belief Updating for Urban Air Quality Modeling and Prediction Liu, Xiuming; Ngai, Edith; Zachariah, Dave Ingår i ACM/IMS Transactions on Data Science, s. 1-19, 2021 DOI för Scalable Belief Updating for Urban Air Quality Modeling and Prediction Ladda ner fulltext (pdf) av Scalable Belief Updating for Urban Air Quality Modeling and Prediction Robust Risk Minimization for Statistical Learning From Corrupted Data Osama, Muhammad; Zachariah, Dave; Stoica, Petre Ingår i IEEE Open Journal of Signal Processing, s. 287-294, 2020 DOI för Robust Risk Minimization for Statistical Learning From Corrupted Data Ladda ner fulltext (pdf) av Robust Risk Minimization for Statistical Learning From Corrupted Data Robust Prediction When Features are Missing Liu, Xiuming; Zachariah, Dave; Stoica, Petre Ingår i IEEE Signal Processing Letters, s. 720-724, 2020 DOI för Robust Prediction When Features are Missing Classical labor values: properties of economic reproduction Zachariah, David; Cockshott, Paul Ingår i World Review of Political Economy, s. 388-414, 2020 DOI för Classical labor values: properties of economic reproduction Data Consistency Approach to Model Validation Lindholm, Andreas; Zachariah, Dave; Stoica, Peter; Schön, Thomas B. Ingår i IEEE Access, s. 59788-59796, 2019 DOI för Data Consistency Approach to Model Validation Ladda ner fulltext (pdf) av Data Consistency Approach to Model Validation Effect Inference From Two-Group Data With Sampling Bias Zachariah, Dave; Stoica, Petre Ingår i IEEE Signal Processing Letters, s. 1103-1106, 2019 DOI för Effect Inference From Two-Group Data With Sampling Bias Learning sparse graphs for prediction of multivariate data processes Venkitaraman, Arun; Zachariah, Dave Ingår i IEEE Signal Processing Letters, s. 495-499, 2019 DOI för Learning sparse graphs for prediction of multivariate data processes Identification of cascade water tanks using a PWARX model Mattsson, Per; Zachariah, Dave; Stoica, Peter Ingår i Mechanical systems and signal processing, s. 40-48, 2018 DOI för Identification of cascade water tanks using a PWARX model Recursive nonlinear-system identification using latent variables Mattsson, Per; Zachariah, Dave; Stoica, Peter Ingår i Automatica, s. 343-351, 2018 DOI för Recursive nonlinear-system identification using latent variables Comparison of two hyperparameter-free sparse signal processing methods for direction-of-arrival tracking in the HF97 ocean acoustic experiment Das, Anup; Zachariah, Dave; Stoica, Peter Ingår i IEEE Journal of Oceanic Engineering, s. 725-734, 2018 DOI för Comparison of two hyperparameter-free sparse signal processing methods for direction-of-arrival tracking in the HF97 ocean acoustic experiment Comments on “Enhanced PUMA for Direction-of-Arrival Estimation and Its Performance Analysis” Zachariah, Dave; Stoica, Petre; Jansson, Magnus Ingår i IEEE Transactions on Signal Processing, s. 6113-6114, 2017 DOI för Comments on “Enhanced PUMA for Direction-of-Arrival Estimation and Its Performance Analysis” Scalable and Passive Wireless Network Clock Synchronization in LOS Environments Zachariah, Dave; Dwivedi, Satyam; Handel, Peter; Stoica, Peter Ingår i IEEE Transactions on Wireless Communications, s. 3536-3546, 2017 DOI för Scalable and Passive Wireless Network Clock Synchronization in LOS Environments Recursive identification method for piecewise ARX models: A sparse estimation approach Mattsson, Per; Zachariah, Dave; Stoica, Peter Ingår i IEEE Transactions on Signal Processing, s. 5082-5093, 2016 DOI för Recursive identification method for piecewise ARX models: A sparse estimation approach A multicomponent T2 relaxometry algorithm for myelin water imaging of the brain Björk, Marcus; Zachariah, Dave; Kullberg, Joel; Stoica, Peter Ingår i Magnetic Resonance in Medicine, s. 390-402, 2016 DOI för A multicomponent T2 relaxometry algorithm for myelin water imaging of the brain Cramér–Rao bound analog of Bayes' rule Zachariah, Dave; Stoica, Peter Ingår i IEEE signal processing magazine (Print), s. 164-168, 2015 DOI för Cramér–Rao bound analog of Bayes' rule Online hyperparameter-free sparse estimation method Zachariah, Dave; Stoica, Peter Ingår i IEEE Transactions on Signal Processing, s. 3348-3359, 2015 DOI för Online hyperparameter-free sparse estimation method Joint ranging and clock parameter estimation by wireless round trip time measurements Dwivedi, Satyam; De Angelis, Alessio; Zachariah, Dave; Händel, Peter Ingår i IEEE Journal on Selected Areas in Com",
  "content_length": 19320,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:26"
}