{
  "name": "David A. Wagner 0001",
  "homepage": "http://www.cs.berkeley.edu/~daw",
  "status": "success",
  "content": "David Wagner David Wagner Professor Carl J. Penther Chair in Engineering Computer Science Division University of California, Berkeley Research interests. Computer security. I am currently working on security for AI (particularly security for large language models), AI for security, and other topics in computer security. I have previously worked on software security, electronic voting, wireless security, sensor network security, and applied cryptography. Projects. My group page is here. I'm part of Berkeley's security research group, a member of the ACTION Institute, and co-director of the KACST-UCB Joint Center on Cybersecurity. I was previously co-PI or PI for SCRUB, the Intel Science and Technology Center for Secure Computing, and the DHOSA project, and I was a member of the TRUST, ACCURATE, Science of Security, and ISAAC projects. Publications. My technical papers and publications are all available online. Teaching. I'm currently teaching CS 161 (Computer Security). See my past teaching. I will be teaching CS 261 in Spring 2026. See that web page for enrollment details. Students. I'm lucky to have the chance to work with a group of outstanding graduate students, postdocs, and other researchers: Sizhe Chen, Yiwei Hou, Zhanhao Hu, Dennis Jacob, Muxi Lyu, Julien Piet, Rebecca Saul, and Yu-Lin Tsai. See also the students I've graduated. Contacting me. See my contact information for my address and other details. For Berkeley students, my office hours are Tuesdays 11:30-12:30 in 733 Soda Hall. If you're contacting me to express interest in Ph.D. studies in my group: all admissions decisions are made by the department admissions committee. If you are interested in joining my group, I encourage you to apply to the department's Ph.D. program. I regretfully don't have capacity to meet with potential applicants in advance. There is no need to contact me to express interest. If you're contacting me to inquire about an internship, remote advising, or research collaboration: for undergraduates, I only have opportunities for Berkeley students. I don't have any opportunities for undergraduates at other schools, and I don't have any opportunities for high school students at this time. Software. Our group releases code for many of our recent papers on Github. Also available: PrimeVul, a high-quality dataset of vulnerabilities in code; DiverseVul, a large dataset of vulnerabilities in code; SLIP, a multi-modal model for images and text; OpenCount, a tool to help with auditing of elections conducted using optical-scan paper ballots; AuditBear, a web application for analyzing audit logs from ES&S iVotronic voting machines; Joe-E, a Java-based programming language for secure programming; html-sanitizer-testbed, a suite of tests to probe the security of a HTML sanitizer; and CQual++, a tool for type inference analysis of C and C++ code. David Wagner, daw@cs.berkeley.edu, http://www.cs.berkeley.edu/~daw/.",
  "content_length": 2937,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:33"
}