{
  "name": "David F. Manlove",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/davidmanlove",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Professor David Manlove Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffProfessor David ManloveMr Ethan KellyZhen Tian Professor David Manlove Professor of Algorithms and Complexity (Computing Science) telephone: 01413302794 email: David.Manlove@glasgow.ac.uk Room S151, School of Computing Science, Sir Alywn Williams Building, University of Glasgow, Glasgow, G12 8QQ Import to contacts https://orcid.org/0000-0001-6754-7308 Biography I am Professor of Algorithms and Complexity at the School of Computing Science, University of Glasgow. I joined the academic staff as a lecturer in October 2000, moving to senior lecturer in August 2009 and then to professor in August 2018.  I held a Royal Society of Edinburgh / Scottish Government Personal Research Fellowship from October 2003 to September 2006. Prior to starting as a lecturer, I was a research assistant, working on an EPSRC research project with Dr Rob Irving. I obtained a PhD in Computing Science from the University of Glasgow in 1998, working under the supervision of Dr Irving. Previously, I obtained a BA in Mathematics and Computation from the University of Oxford in 1995 (MA in 2000). I am a Fellow of the Higher Education Academy and served as Chair of COST Action CA15210 (ENCKEP: European Network for Collaboration on Kidney Exchange Programmes). Within the School, I am leader of the Formal Analysis, Theory and Algorithms research section. Research interests My research interests lie mainly in the field of Algorithms and Complexity.  That means that I am interested in the design and analysis of efficient algorithms, and proving results about the extent to which a problem can be solved optimally or approximately using an efficient algorithm. I am most interested in designing algorithms for matching problems, which involve allocating agents to commodities (e.g., junior doctors to hospitals, students to projects or kidney patients to donors) in the presence of “ordinal preferences” (e.g., a junior doctor might have first, second and third-choice hospitals, etc.) or “cardinal utilities” (e.g., real-valued weights that model the benefit of a kidney patient being assigned to a particular donor).  The aim of a matching algorithm is to find an allocation that is optimal according to these ordinal preferences or cardinal utilities. More specifically, my research interests include: Matching problems with and without preferences Algorithms for applications of matching problems: kidney exchange allocation of junior doctors to hospitals school placement student-project allocation Algorithmic graph theory Colouring, independence and domination in graphs Complexity and approximability of optimisation problems Integer programming models Research groupsFormal Analysis, Theory & Algorithms Publications List by: Type | Date Jump to: 2026 | 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 | 2012 | 2011 | 2010 | 2009 | 2008 | 2007 | 2006 | 2005 | 2004 | 2003 | 2002 | 2001 | 2000 | 1999Number of items: 114.2026 Ayegba, Peace, Olaosebikan, Sofiat ORCID: https://orcid.org/0000-0002-8003-7887 and Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308 (2026) Structural aspects of the Student Project Allocation problem. Discrete Applied Mathematics, 379, pp. 748-767. (doi: 10.1016/j.dam.2025.10.034) 2025 Ashlagi, Itai, Cseh, Ágnes, Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308, Ockenfels, Axel and Pettersson, William ORCID: https://orcid.org/0000-0003-0040-2088 (2025) Designing a kidney exchange program in Germany: simulations and recommendations. Central European Journal of Operations Research, 33(4), pp. 1529-1555. (doi: 10.1007/s10100-024-00933-0) (PMID:41036231) (PMCID:PMC12479653) Delorme, Maxence, Liu, Wendy and Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308 (2025) Mathematical models and exact algorithms for kidney exchange problems with immunosuppressants. INFORMS Journal on Computing, (Accepted for Publication) Klimentova, X. et al. (2025) International kidney paired donation programs: evolution and practices of four large collaborations. Transplantation, (Accepted for Publication) Barkel, Mathijs, Colley, Rachael ORCID: https://orcid.org/0000-0003-1164-4234, Delorme, Maxence, Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308 and Pettersson, William ORCID: https://orcid.org/0000-0003-0040-2088 (2025) Operational research approaches and mathematical models for kidney exchange: a literature survey and empirical evaluation. European Journal of Operational Research, (doi: 10.1016/j.ejor.2025.08.059) (In Press) Mendoza Granada, Fabricio Augusto and Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308 (2025) Total b-chromatic Colouring of Graphs. In: XIII Latin American Algorithms, Graphs, and Optimization Symposium – LAGOS 2025, Buenos Aires, Argentina, 10–14 November 2025, (Accepted for Publication) Colley, Rachael ORCID: https://orcid.org/0000-0003-1164-4234, Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308, Paulusma, Daniel and Zhang, Mengxiao (2025) Complexity and Manipulation of International Kidney Exchange Programmes with Country-Specific Parameters. In: Twenty-Sixth ACM Conference on Economics and Computation (EC'25), Stanford, CA, USA, 07-10 Jul 2025, pp. 976-995. ISBN 9798400719431 (doi: 10.1145/3736252.3742657) Glitzner, Frederik ORCID: https://orcid.org/0009-0002-2815-6368 and Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308 (2025) Unsolvability and Beyond in Many-To-Many Non-Bipartite Stable Matching. In: 18th International Symposium on Algorithmic Game Theory (SAGT), Bath, UK, 2-5 Sept 2025, (Accepted for Publication) Rodriguez, José and Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308 (2025) Course Allocation with Credits via Stable Matching. In: The International Symposium on Algorithmic Game Theory (SAGT) 2025, Bath, UK, 2-5 September 2025, (Accepted for Publication) Perham, Nick, Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308 and Clayton, Deborah (2025) An exploration of project allocation procedures in UK psychology departments. Psychology Teaching Review, 31(1), pp. 6-19. (doi: 10.53841/bpsptr.2025.31.1.6) Glitzner, Frederik ORCID: https://orcid.org/0009-0002-2815-6368 and Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308 (2025) MATWA: A Web Toolkit for Matching under Preferences. In: 39th Annual AAAI Conference on Artificial Intelligence (AAAI’25), Philadelphia, Pennsylvania, USA, 25 February – 4 March 2025, ISBN 9781577358978 (doi: 10.1609/aaai.v39i28.35352) 2024 McKay, Michael ORCID: https://orcid.org/0000-0003-1496-7434, Cseh, Agnes and Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308 (2024) Envy-freeness in 3D hedonic games. Autonomous Agents and Multi-Agent Systems, 38(2), 37. (doi: 10.1007/s10458-024-09657-6) Glitzner, Frederik ORCID: https://orcid.org/0009-0002-2815-6368 and Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308 (2024) Structural and Algorithmic Results for Stable Cycles and Partitions in the Roommates Problem. In: 17th International Symposium on Algorithmic Game Theory (SAGT), Amsterdam, The Netherlands, 03-06 Sep 2024, pp. 3-20. ISBN 9783031710339 (doi: 10.1007/978-3-031-71033-9_1) McKay, Michael ORCID: https://orcid.org/0000-0003-1496-7434 and Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308 (2024) Packing Krs in bounded degree graphs. Discrete Applied Mathematics, 352, pp. 20-32. (doi: 10.1016/j.dam.2024.03.010) Delorme, Maxence, García, Sergio, Gondzio, Jacek, Kalcsics, Jörg, Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308 and Pettersson, William ORCID: https://orcid.org/0000-0003-0040-2088 (2024) New algorithms for hierarchical optimization in kidney exchange programs. Operations Research, 72(4), pp. 1654-1673. (doi: 10.1287/opre.2022.2374) Csáji, Gergely, Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308, McBride, Iain and Trimble, James (2024) Couples Can Be Tractable: New Algorithms and Hardness Results for the Hospitals/Residents Problem with Couples. In: IJCAI 2024, the 33rd International Joint Conference on Artificial Intelligence, Jeju, South Korea, 3-9 August 2024, pp. 2731-2739. ISBN 9781956792041 (doi: 10.24963/ijcai.2024/302) 2023 Kraiczy, Sonja, Cseh, Ágnes and Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308 (2023) On weakly and strongly popular rankings. Discrete Applied Mathematics, 340, pp. 134-152. (doi: 10.1016/j.dam.2023.06.041) Chen, Jiehua and Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308 (2023) Algorithmics of matching markets. In: Echenique, Federico, Immorlica, Nicole and Vazirani, Vijay V. (eds.) Online and Matching-Based Market Design. Cambridge University Press: Cambridge, pp. 283-302. ISBN 9781108831994 (doi: 10.1017/9781108937535.013) Delorme, Maxence, Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308 and Smeets, Tom (2023) Half-cycle: a new formulation for modelling kidney exchange problems. Operations Research Letters, 51(3), pp. 234-241. (doi: 10.1016/j.orl.2023.02.009) 2022 Olaosebikan, Sofiat ORCID: https://orcid.org/0000-0002-8003-7887 and Manlove, David ORCID: https://orcid.org/0000-0001-6754-7308 (2022) Super-stability in th",
  "content_length": 77323,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:00"
}