{
  "name": "David Zhang 0001",
  "homepage": "https://sds.cuhk.edu.cn/en/teacher/315",
  "status": "success",
  "content": "ZHANG, David | School of Data Science SEARCH SDSÂ Portal Search SEARCH CUHK-Shenzhen ç®ä½ä¸­æ About SDS Overview Academic Area Deanâs Message Publications Brochure SchoolÂ Newsletter Annual Report FAQ Contact Us Programmes Introduction Undergraduate Data Science and Big Data Technology Statistics Computer Science and Engineering Financial Engineering 2+2 Double Major Programme Interdisciplinary Data Analytics +Â X Double Major Programme Aerospace Science and Earth InformaticsÂ + X Double Major Programme Columbia University 3+2 Initiative (Columbia Class) Taught Postgraduate M.Sc in Data Science M.Sc in Financial Engineering(Full-time/Part-time) M.Sc in Artificial Intelligence and Robotics M.Sc in Computer Science M.Sc in Statistics M.Sc in Bioinformatics Research Postgraduate M.Phil.-Ph.D. Programme in Data Science M.Phil.-Ph.D. Programme in Computer Science Faculty Faculty Emeritus Faculty Affiliated Appointments Researchers/Visitors Students UG Academic Advisory System Ph.D. Students Student Interviews News & Announcements News Announcements School Events Academic Conferences DDTOR 2025 CSAMSE 2023 RMTA 2023 ICASSP 2022 Mostly OM 2019 Academic Activities SDS Colloquium Series Other Events Research Jobs Faculty Positions Postdoctoral Fellowships Career Graduate Placements International Programmes About SDS Overview Academic Area Deanâs Message Publications Brochure SchoolÂ Newsletter Annual Report FAQ Contact Us Programmes Introduction Undergraduate Data Science and Big Data Technology Statistics Computer Science and Engineering Financial Engineering 2+2 Double Major Programme Interdisciplinary Data Analytics +Â X Double Major Programme Aerospace Science and Earth InformaticsÂ + X Double Major Programme Columbia University 3+2 Initiative (Columbia Class) Taught Postgraduate M.Sc in Data Science M.Sc in Financial Engineering(Full-time/Part-time) M.Sc in Artificial Intelligence and Robotics M.Sc in Computer Science M.Sc in Statistics M.Sc in Bioinformatics Research Postgraduate M.Phil.-Ph.D. Programme in Data Science M.Phil.-Ph.D. Programme in Computer Science Faculty Faculty Emeritus Faculty Affiliated Appointments Researchers/Visitors Students UG Academic Advisory System Ph.D. Students Student Interviews News & Announcements News Announcements School Events Academic Conferences DDTOR 2025 CSAMSE 2023 RMTA 2023 ICASSP 2022 Mostly OM 2019 Academic Activities SDS Colloquium Series Other Events Research Jobs Faculty Positions Postdoctoral Fellowships Career Graduate Placements International Programmes SDSÂ Portal CUHK-Shenzhen ç®ä½ä¸­æ ZHANG, David X.Q. Deng Presidential Chair Professor Education Background Ph.D (Harbin Institute of Technology) Ph.D (University of Waterloo) MS (Harbin Institute of Technology) B.Sc. (Peking University) Academic Area Artificial Intelligence, Computer Science, Machine Learning and Artificial Intelligence, Computer Vision and Computer Graphics Research Field Pattern Recognition, Image Processing and Biometrics Personal Website http://www4.comp.polyu.edu.hk/~csdzhang/ Email davidzhang@cuhk.edu.cn Office Room 513, Daoyuan Building Biography Professor Zhang is X.Q. Deng Presidential Chair Professor of School of Data Science in the Chinese University of Hong Kong (Shenzhen), Director of Center for Computer Vision in Shenzhen Institute of Artificial Intelligence and Robotics for Society, Director of CUHK(SZ)-Linklogis Joint Laboratory of CV & AI. David Zhang graduated in Computer Science from Peking University. He received his MSc in 1982 and his PhD in 1985 in both Computer Science from the Harbin Institute of Technology (HIT), respectively. From 1986 to 1988 he was a Postdoctoral Fellow at Tsinghua University and then an Associate Professor at the Academia Sinica, Beijing. In 1994 he received his second PhD in Electrical and Computer Engineering from the University of Waterloo, Ontario, Canada. He has been a Chair Professor at the Hong Kong Polytechnic University where he is the Founding Director of Biometrics Research Centre (UGC/CRC) supported by the Hong Kong SAR Government since 2005. Currently he is Presidential Chair Professor in Chinese University of Hong Kong (Shenzhen). He also serves as Visiting Chair Professor in Tsinghua University and HIT, and Adjunct Professor in Shanghai Jiao Tong University, Peking University, National University of Defense Technology and the University of Waterloo. He is both Founder and Editor-in-Chief, International Journal of Image & Graphics (IJIG) (http://www.worldscinet.com/ijig/ijig.shtml) and Springer International Series on Biometrics (KISB) (http://www.springer.com/series/6191); Organizer, the first International Conference on Biometrics Authentication (ICBA); and Associate Editor of more than ten international journals including IEEE Transactions and so on. Over past 40 years, he has been working on pattern recognition, image processing and biometrics, where many research results have been awarded and some created directions, including palmprint recognition, computerized TCM and facial beauty analysis, are famous in the world. So far, he has published over 20 monographs, 500 international journal papers and 60 patents from USA/Japan/China. From 2014 to 2021, he has been continuously listed as a Highly Cited Researchers in Engineering by Clarivate Analytics (formerly known as Thomson Reuters) (http://highlycited.com). He is ranked 74 (ranked 7 in China) with D-Index 130 at Top 1,000 Scientists for international Computer Science and Electronics in 2024 (http://www.guide2research.com/scientists). Professor Zhang is also an Distinguished Speaker of the IEEE Computer Society, and an IEEE Life Fellow and an IAPR Fellow. Professor Zhang is selected as a Fellow of both the Royal Society of Canada and the Canadian Academy of Engineering. Address: 3 - 6 Floor, Dao Yuan Building, 2001 Longxiang Road, Longgang District, ShenzhenE-mail: sds@cuhk.edu.cnWechat Account: cuhksz-sdssds.cuhk.edu.cnCopyright Â© CUHK-Shenzhen School of Data Science",
  "content_length": 6020,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:16"
}