{
  "name": "David T. Cliff",
  "homepage": "https://www.cs.bris.ac.uk/~dc",
  "status": "success",
  "content": "Professor Dave Cliff | LSCITS Project Director Home page | Publications | Professor Dave Cliff Department of Computer Science University of Bristol The Merchant Venturers Building, Room 3.30 Woodland Road Bristol BS8 1UB, UK Phone: +44 (0) 79 77 55 22 50 Fax: +44 (0) 117 9545208 Email: dc@cs.bris.ac.uk Vacancies: Please note, I have no funds available to provide short-term summer internships to prospective interns from outside the UK. Background Prior to joining the University of Bristol in 2007, I'd held faculty posts at the University of Sussex School of Cognitive and Computing Sciences, at the MIT Artificial Intelligence Laboratory, and at the University of Southampton School of Electronics and Computer Science. I'd also spent roughly half my career working as a researcher in industry: initially for Hewlett-Packard Labs, where I ended up as a Department Scientist; and latterly for Deutsche Bank London, where I was a Director/Trader in their Foreign Exchange Complex Risk Group. From October 2005 to March 2013 I was Director of the UK Research and Training Initiative in the Science and Engineering of Large-Scale Complex IT Systems (LSCITS). This was funded by more than GBP10M of UK public funds (from EPSRC), with significant support from partners in industry and the UK public sector. Further details of the LSCITS Initiative are available at www.lscits.org. Most of my personal research work in the ten years before I got involved in LSCITS was centered on adaptive automated trading systems for various types of markets, and on automated design of market mechanisms. I started doing this in 1995, for market-based control of ultra-large-scale data-centres. In 2001 a team at IBM showed my \"ZIP\" trading software beating human traders, which got the attention of various companies in the global financial markets. I've worked as a consultant with several investment banks and hedge funds. From 2010-2012 I was one of the eight-person Lead Expert Group for the UK Government Office for Science (GO-Science) \"Foresight\" project investigating the future of computer trading in the financial markets. The outputs from that project are available from the GO-Science archive here: https://www.gov.uk/government/collections/future-of-computer-trading From 2012-2014 I served as a lead expert witness in a major intellectual property case heard in the Chancery Division of the High Court of London. In consequence, I am significantly more acquainted with case law like Faccenda Chicken Ltd -v.- Fowler 1986 than your average computer scientist. Research Interests Ultra-Large-Scale Complex Software-Intensive Socio-Technical Systems in general, and Large Scale Complex IT Systems (LSCITS) in particular. Complex Adaptive Systems. Before I got involved in LSCITS, I spent roughly 17 years doing research in complex adaptive systems of one type or another. I worked on modelling neuronal processing of visual information in airborne insects (hoverflies, actually); on using artificial evolution to generate designs for sensory-motor morphology and neuronal controllers for autonomous mobile robots (so-called \"evolutionary robotics\"); on competitive co-evolutionary dynamics in predator-prey \"arms races\"; on autonomous adaptive algorithmic trading strategies for double-acution markets; on automated crowd-responsive dance-music disk-jockeys and real-time music-production systems; and on automated design of market mechanisms. Futurology and horizon-scanning: I've done a fair amount of consulting work on this, primarily for the UK Government's Foresight unit in the Office of Science and Technology; also some work for the Department of Children Schools and Families (DCSF) via the Beyond Current Horizons programme that DCSF commissioned from Futurelab. Some outputs from those activities are listed under \"Publications\", below. Throughout my career I've done a fair amount of \"public engagement\" activities. In 1993 I was chosen to give the Isambard Kingdom Brunel Award Lecture at the annual summer meeting of the British Association for the Advancement of Science (now known as the British Science Association). After that, I was a \"Schools' Science Lecturer\" several times at the Royal Institution of Great Britain. I've been an invited speaker at the Cheltenham Science Festival three times, and I've done an awful lot of media interviews, both print and broadcast. Currently I am the only Computer Scientist employed by GSCE Science Live to talk to large (typically 800-1600) audiences of GCSE-level students about just how much fun science (and engineering) can be. I've done similar work for Maths Inspiration too. Trying to get schoolkids switched on to science and engineering is something that I really enjoy doing. Publications, and citation indices You can find me on Google Scholar here: https://scholar.google.co.uk/citations?user=DmIm-UMAAAAJ&hl=en Current/Recent PhD and EngD Students Tom Cassey (co-supervised with James Marshall). Marco De Luca. Mo Haghighi. Michael Meadows. Chris Musselle (co-supervised with Ayalvadi Ganesh). Owen Rogers. Ilango Sriram. Charlotte Szostek. Duncan Tait. Public Engagement annd Media Appearances In 2013 I had the pleasure of being asked to help write and present a one-hour TV documentary for the BBC called The Joy of Logic, it was first broadcast in December 2013. It was produced by Cat Gale for Wingspan Productions Ltd. Wingspan's online shop sell DVDs of the programme at very reasonmable rates. It was subsequently nominated for the 2014 Best Science and Technology Documentary Award at the Banff World Media Awards 2014 and was shortlisted for the Best Science Documentary Award and Best Newcomer Award, at the 2014 Grierson Awards. For many years I have been a regular speaker at GCSE Science Live: events where audiences of around 1,000 schoolchildren listen to brief lectures from scientists in various fields. Teaching COMSM2006: Algorithmic and Economic Aspects of the Internet (lecturer) COMSM0010: Cloud Computing (lecturer) COMSM0011: Individual Project: Research Proposal (lecturer)",
  "content_length": 6070,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:08"
}