{
  "name": "David Schlangen",
  "homepage": "https://www.ling.uni-potsdam.de/~das",
  "status": "success",
  "content": "my_webpage David Schlangen’s Webpage Welcome. Since 2019, I am full professor of the “Foundations of Computational Linguistics” at the University of Potsdam in Germany. Before that, from 2010 on, I was half-full professor of “Applied Computational Linguistics”, at Bielefeld University, also in Germany. There, I was heavily involved in the Excellence Cluster “Cognitive Interaction Technology”, serving on its scientific board for several years. Before that, I was a Junior Independent Research Group Leader at the University of Potsdam, in Germany. Before that, I briefly was a postdoctoral researcher at the University of Edinburgh, not in Germany. I received my PhD from the University of Edinburgh in Scotland. There I was advised by Alex Lascarides. Before that, I studied Computational Linguistics, Philosophy, and Computer Science, at the University of Bonn, in Germany, with a stint at the University of Edinburgh. Before that and overlapping with that, I played guitar in several bands in Bonn and programmed electronic music. But that was before soundcloud and YouTube existed, thankfully, so you wonât find evidence of that. This is a picture of my face: David’s Face My research interests can be found on the webpage of the colabPotsdam, which I lead. My teaching activities can be found there as well, and also a list of our publications. If you don’t want to click through to there, here are some keywords: Semantics; Dialogue; Multimodal Interaction; Meaning in Situated Interaction; Natural Language Understanding as an Interactive Process; Natural Human/Computer Interaction. A relatively recent CV can be found here (when I get round to uploading it). Speaking and service activities. TBA. I will say no to most requests, but if I have to do so, I will try to recommend other people who might be able to help you. Possible projects for BSC theses, IMs, MSc theses. TBA “Was ist Computerlinguistik?”: An interview with me on CL and Dialogue Systems, with interesting questions (in German).",
  "content_length": 2009,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:05"
}