{
  "name": "David L. Dowe",
  "homepage": "https://research.monash.edu/en/persons/david-dowe",
  "status": "success",
  "content": "David Dowe - Monash University David Dowe public CV View Scopus Profile David Dowe Assoc Professor Associate Professor, Department of Data Science & AI https://orcid.org/0000-0002-0583-5918 EmailDavid.Dowemonashedu Accepting PhD StudentsPhD projects<a href=\"https://supervisorconnect.it.monash.edu/\" onclick=\"target='_blank';\">https://supervisorconnect.it.monash.edu/</a> 1989 …2025 Research activity per year Personal profile BiographyDavid works in the Faculty of Information Technology at Monash University as an Associate Professor.Monash teaching commitmentAssociate Professor David Dowe has experience as the Chief Examiner for the following units in the Faculty of IT: FIT4009 Advanced topics in intelligent systems FIT5158 Customer relationship management and data mining David has experience as the Lecturer for the following units in the Faculty of IT: FIT1004 Data management FIT2017 Computer models for business decision making FIT3036 Computer science project FIT3063 Human-computer interaction FIT4009 Advanced topics in intelligent systems FIT5047 Intelligent systems FIT5097 Business intelligence modelling FIT5158 Customer relationship management and data mining Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationMathematics, Doctor of Philosophy, Monash UniversityAward Date: 6 Dec 1991Econometrics, Master of Science (Econometrics), London School of Economics and Political ScienceAward Date: 30 Sept 1987Mathematics, Bachelor of Science (Honours), University of MelbourneAward Date: 4 Dec 1982 Research area keywordsHuman and Artificial IntelligenceMinimum Message Length Inference Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2003 2003 2007 2011 2019 10 Finished Projects per year New Statistical Techniques for Galactic ArchaeologyLattanzio, J. (Primary Chief Investigator (PCI)), Dowe, D. (Chief Investigator (CI)) & Aleti, A. (Chief Investigator (CI))ARC - Australian Research Council, Monash University1/01/16 → 31/08/19Project: Research New statistical approaches for analysing foodwebs and species distributionsStone, L. (Primary Chief Investigator (PCI)), Dowe, D. (Chief Investigator (CI)), Gordon, A. (Chief Investigator (CI)), Wang, Y. (Chief Investigator (CI)), Solow, A. (Partner Investigator (PI)) & Dorazio, R. (Partner Investigator (PI))ARC - Australian Research Council12/05/15 → 31/12/17Project: Research Collaborative Family Work in Youth Justice: A model for reducing recidivism in young offendersTrotter, C. (Primary Chief Investigator (PCI)) & Dowe, D. (Chief Investigator (CI))ARC - Australian Research Council, Juvenile Justice NSW1/07/11 → 15/12/14Project: Research Rating and ranking sports players and teams using Minimum Message LengthDowe, D. (Primary Chief Investigator (PCI)), Barnett, T. (Partner Investigator (PI)) & Khanna, A. (Partner Investigator (PI))ARC - Australian Research Council, Cadability Pty Ltd31/03/11 → 31/12/17Project: Research Improved determination of predictors of emergency patient outcome via Minimum Message Length statistical machine learningDowe, D. (Primary Chief Investigator (PCI))Monash University2/05/08 → 2/05/10Project: Research View all 10 projects Research output Research output per year 1989 1997 1998 1999 2002 2003 2005 2007 2008 2011 2012 2013 2015 2016 2017 2025 73 Conference Paper 37 Article 8 Abstract 5 Other 13 More 4 Chapter (Book) 3 Commissioned Report 3 Poster 2 Book 1 Letter Research output per year Research output per year Transformer-based Deep Learning Model for Joint Routing and Scheduling with Varying Electric Vehicle NumbersYap, J. K., Baskaran, V. M., Tan, W. S., Ding, Z. Y., Wang, H. & Dowe, D. L., 2025, 2025 IEEE Industry Applications Society Annual Meeting, IAS 2025. Chen, C.-I. (ed.). Piscataway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, 8 p. (Conference Record - IAS Annual Meeting (IEEE Industry Applications Society)).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review A Deep Probabilistic Spatiotemporal Framework for Dynamic Graph Representation Learning with Application to Brain Disorder IdentificationYap, S.-Y., Loo, J. Y., Ting, C.-M., Noman, F., Phan, R. C. W., Razi, A. & Dowe, D. L., 2024, Proceedings of the 33rd International Joint Conference on Artificial Intelligence, IJCAI 2024. Larson, K. (ed.). Marina del Rey CA USA: Association for the Advancement of Artificial Intelligence (AAAI), p. 5353-5361 9 p. (IJCAI International Joint Conference on Artificial Intelligence).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access 1 Citation (Scopus) Predicting Pseudomonas aeruginosa drug resistance using artificial intelligence and clinical MALDI-TOF mass spectraNguyen, H. A., Peleg, A. Y., Song, J., Antony, B., Webb, G. I., Wisniewski, J. A., Blakeway, L. V., Badoordeen, G. Z., Theegala, R., Zisis, H., Dowe, D. L. & Macesic, N., Sept 2024, In: mSystems. 9, 9, 18 p.Research output: Contribution to journal › Article › Research › peer-review Open Access 16 Citations (Scopus) Accounting method selection using neural networks and multi-criteria decision makingDuan, Y., Yeh, C.-H. & Dowe, D. L., 2021, Proceedings of the 54th Annual Hawaii International Conference on System Sciences. Bui, T. X. (ed.). New York NY USA: IEEE, Institute of Electrical and Electronics Engineers, p. 1550-1559 10 p. (Proceedings of the Annual Hawaii International Conference on System Sciences; vol. 2020-January).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile Improving machine learning prediction of peatlands fire occurrence for unbalanced data using SMOTE approachRosadi, D., Arisanty, D., Andriyani, W., Peiris, S., Agustina, D., L. Dowe, D. & Fang, Z., 2021, 2021 International Conference on Data Science, Artificial Intelligence, and Business Analytics (DATABIA), Proceedings. Jaya, I. (ed.). Piscataway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, p. 160-163 4 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review View all 136 research outputs Press/Media Footy tipping for fence sittersDowe, D.23/03/161 Media contributionPress/Media: Article/Feature",
  "content_length": 6863,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:24"
}