{
  "name": "David R. Kaeli",
  "homepage": "http://www.ece.neu.edu/faculty/kaeli.html",
  "status": "success",
  "content": "David R. Kaeli, Professor David R. Kaeli COE Distinguished Professor Dept. of Electrical and Computer Engineering Northeastern University 333 Dana Research Center Boston, MA Phone: (617) 373-5413 Fax: (617) 373-8970 kaeli@ece.neu.edu Dr. Kaeli received his Ph.D. in Electrical Engineering from Rutgers University in 1992. He received his M.S. in Computer Engineering from Syracuse University in 1985 and a B.S. in Electrical Engineering from Rutgers University in 1981. He has been on the faculty of the Department of Electrical and Computer Engineering since 1993. He has a courtesy appointment in the College of Computer and Information Science at Northeastern, and a honorary professorship from City University of London, UK. For the 2001-2002 academic year he spent a year as a Visiting Professor at the Departament of d'Arquitectura de Computadors at the Universitat Politecnica de Catalunya. In 2017 he spent two months as a Visiting Professor at the Technical University of Munich in Germany, the Ghent University in Belgium, and the University of Edinburgh, Scotland. Prior to joining Northeastern, Dr. Kaeli spent 12 years working at IBM and IBM Research. Research: Dr. Kaeli is the Director of the Northeastern University Computer Architecture Research Laboratory (NUCAR). He serves as a Project Leader in the NIEHS The Puerto Rico Testsite for Exploring Contamination Threats (PROTECT) Center. He is a member of the Northeastern University Institute for Experiential AI (EAI). He is a member of the NSF Industry-University Collaborative Research Center CHEST. He served as a Research Thrust Leader for the NSF Center for Subsurface Sensing and Imaging Systems (CenSSIS). His research looks at the performance and design of high-performance computer systems and software. Current research topics include: computer architecture, graphics processing units, fast and efficient AI, microarchitectural security, side-channel analysis, reliability, virtualization, workload characterization, memory hierarchy design, benchmarking and software testing. Prof. Kaeli is a Fellow of the IEEE and the ACM. He presently serves as the Editor-in-Chief of ACM Transactions on Computer Architecture and Code Optimization. He serves an elected member of the IEEE Technical Committee on Computer Architecture. He also serves as an Associate Editor for Elsevier journal titled Future Generation Computer Systems. Administration: Dr. Kaeli served as Associate Dean of Undergraduate Programs in the College of Engineering from 2010-2013. He has served in a number of leadership roles at university, college and department levels. Teaching: In addition to his research activities, he teaches courses in Computer Architecture, High Performance Computing and Embedded Design. Here is a recent CV. Personal: In addition to his love for teaching and research, Prof. Kaeli also enjoys trout fishing and hiking. He is a strong supporter of Barca.",
  "content_length": 2928,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:03"
}