{
  "name": "David Gesbert",
  "homepage": "http://www.eurecom.fr/cm/gesbert",
  "status": "success",
  "content": "Prof. David Gesbert | Eurecom COMMUNICATION SYSTEMS Website EURECOM Login Eurecom COMMUNICATION SYSTEMS Website Home Welcome People Projects Publications Seminars Foundations & Algorithms Networked Systems Home › Prof. David Gesbert Prof. David Gesbert David Gesbert is Professor and Director of EURECOM, Sophia Antipolis, France. He previously headed the Communications Systems Department of EURECOM. Within his area of research, he welcomes collaboration with brilliant students and passionate researchers in the fields of communication theory, signal processing for (wireless) networks, information theory, optimization and connected robotics. He has previously been named in the Thomson-Reuters List of Highly Cited Researchers in Computer Science. He is a Fellow of IEEE. He is a Board member for the OpenAirInterface (OAI) Software Alliance.  He also held  an Advanced ERC grant on the topic of Smart Device Communications. Since 2020, he holds a 3IA Chair funded on the topic of AI for future IoT Networks. Research group ERC Advanced Grant \"Perfume\" Bio Awards and service Publications and patents Joining our group (new AI Chair and  6G Chair positions at postdoc & PhD level!) Latest news in our group! Keynote at the 2025 International Conference on Communication Technology, Shenyang, October 17, 2025. 6G what is it and where do we stand? Please find here a quick backgrounder on 6G and some personal views Keynote at the 2024 International Convergence on ICT Convergence, Keju Island, South Korea, October 16-18, 2024. Invited for keynote at The 49th IEEE Conference on Local Computer Networks (LCN) October 8-10, 2024, Caen, Normandy, France Invited for Keynote at the 2024 IEEE MeditCom conference, Madrid, Spain Keynote at the 2023 IEEE Globecom Workshop on Aerial Communications Networks, Roma. Keynote at the 2021 Brazilian Telecom and Signal Processing Symposium I am happy to deliver a keynote speech on \"Team playing under uncertainties\". D.Gesbert named a Fellow of the Asia Pacific Artificial Intelligence Association Proud to be named a Fellow of the AAIA, May 2021. Details on this association can be found there. EURECOM Communication Systems Dept. as well as my research group are looking for talents (Faculty/Postdoc/PhD) The positions are intended in the 6G wireless area with an emphasis on AI-aided wireless, wireless-aided AI, connected robotics, RF sensing, and Green communications and learning. Click here for details. Panel on 6G Research at VTC 2021 In April 2021, I was happy to give my views on 6G wireless research on a panel dedicated to that topic at the 2021 IEEE Vehicular Technology Conference. Keynote at the 2020 International Workshop on Mathematical issues in Information Sciences (MIISc), Shenzhen, China I am happy to deliver a keynote speech at the 2020 MIIS conferece. I talked about learning for coordination under asymmetric informations. Keynote at the French Academy of Sciences Workshop In 2019, I delivered a keynote speech at the 2019 a workshop held by the Academie des Sciences, on \"Connected Robotics for 6G\". The talk, given in French (sorry to non French speakers!) is now finally available here on youtube. Prof. Gesbert's Webinar at the One World SP seminar series on Aug 24, 2020 David Gesbert's webinar, which can be see on youtube here focussed on the potential of machine learning methods to solve challenging decentralized coordination/team decision problems under arbitrary network information uncertainties . Prof. Gesbert selected for new Chair appointment by Interdisciplinary Institute on Artificial Intelligence David Gesbert's research proposal titled \"Internet of Learning Thing: A machine learning approach to future IoT networks” by selected by France's Interdisciplinary Institue on Artificial Intelligence (3IA) to receive Chair funding. The funds are awarded by 3IA, a government backed research cluster dedicated to artificial intelligence and  located in Sophia-Antipolis. 2019 Winner of \"Fundamental research project of the year\" awarded by the French SCS (Secured Communications) Research and Industry Cluster, December 2019. Best Paper Award at the 2019 International Conference on Communications! Our paper with P. Mursia, I. Atzeni, and M. Kobayashi \"D2D-aided Multi-antenna Multicasting\" receives the Wireless Communication Symposium's Best Paper Award at the 2019 IEEE International Conference on Communications, Shanghai, China. Keynote at the 12th IFIP Wireless and Mobile Networking Conference (WMNC), Paris I am happy to deliver a keynote speech at the 2019 IFIP WMNC conference. The Topic will be annonced later. Keynote at IEEE ICC 2019 Workshop on \"Integrating UAVs in 5G and Beyond\" , Shanghai, China I am honored to deliver a keynote speech at the 2019 IEEE ICC Workshop on UAVs in 5G and Beyond, on the topic of of \"Theory and Practice of Learning for Flying Radio Access Networks\". Launching 6G Chair at EURECOM with Huawei I am extremely proud to announce the launch of EURECOM's Huawei-funded Chair on \"Advanced Wireless Systems Towards 6G Networks\", effective early 2019. I and recently recruited Prof. Marios Kountouris will be leading the Chair, to be hosted in Algorithms and Foundations' research group of the Communication Systems Department at EURECOM.  Please apply for PhD and Postdoc positions. Signature ceremony for 5G \"patent factory\" with Qualcomm On March 26th, 2019, I was happy to represent EURECOM at the signature ceremony for a major research agreement between EURECOM's Communications Systems Dept and Qualcomm, San Diego. Institut Mines Telecom (IMT) and France Brevet are also partners in the project, helping to manage the IPR portfolio. The contract was annonced here. The project will mark EURECOM's Communication Systems Dept's first step into the 3GPP battlefield for future 5G releases, under the leadership of Prof. Raymond Knopp's team. Please apply for PhD and Postdoc positions. Conference Keynote at IEEE PIMRC 2018 I recently gave a keynote speech at the 2018 IEEE Personal Infoor Mobile Radio Conference (PIMRC)  in Bologna, on the topic of machine learning for flying radio access networks. WINDMILL EU H2020 ITN project proposal on  Machine Learning in Wireless Communications accepted! Our group at EURECOM co-proposed the new ITN Marie Curie project WINDMILL (coordinated by Aalborg Univ) on ?integrating wireless communication engineering and MachineLearning. WINDMILL just got accepted! Major industrial partners include Bosch, Ericsson, Nokia Bell Labs. This is the second running ITN H2020 project in our department, along with SPOTLIGHT. WINDMILL is currently accepting PhD position candidates - check out the group page! Upcoming IEEE JSAC special issue proposal on \"Machine Learning in Wireless Communications\" Our IEEE JSAC special issue proposal, together with Paul de Kerret, Deniz Gunduz, Mihaela van der Schaar and Nikos Sidiropoulos, on \"Machine Learning in Wireless Communications\" has been accepted! - Call For Papers is found here. (deadline for submission Dec. 15 2019 - attention we have a no extension policy). Special Issue of IEEE Wireless Communications on \"Integrating UAVs in 5G  and Beyond Systems\" We are now accepting submissions to the Special Issue of IEEE Wireless Communications on \"Integrating UAVs in 5G  and Beyond Systems\" submit your paper at: https://www.comsoc.org/wirelessmag/cfp/integrating-uavs-5g-and-beyond David Gesbert gives his thoughts on machine learning for communication systems in an interview at ITU Geneva David responds to an interview following his talk at the newly established focus group on machine learning for communication systems, at the ITU in Geneva, Switzerland, Jan 25h 2018. Click here for the video. PERFUME team unveils first demo of autonomous flying cellular relays While we should stay humble, we believe this is the world’s first demo of a self positioned flying relay device, offering LTE connectivity on-the-go to a mobile ground user. See PERFUME project section for more details. The video is visible here! Conference Keynote at EW2018, Catania, Italy I am giving a keynote speech at the 2018 European Wireless Conference in Sicily. Welcome to the 1st TUM-EURECOM Workshop on Communications and Security! The group of Prof. Kramer (Dr. Rana Ali  Amjad), Prof Utshick (Dr Michael Joham), and my group (Dr Paul de Kerret) are jointly organizing this workshop December 14-15 2017 in the context of our joint French-German Academy project SeCIF (Secure Connected Industry of the Future). See details here. Organizing a workshop at ICC18 on  \"Promises and Challenges of Machine Learning for Communications\" Our ICC2018 Workshop on machine learning for communications systems was accepted! Paul de Kerret, Deniz Gunduz (Imperial College) and myself are welcoming high level technical contributions. See the final Call for Papers here. Papers are due January 3rd! Conference Keynote at ICT 2018, Saint Malo, France I am giving a keynote speech at the 2018 International Conference  on Telecommunications. Conference Keynote at WCSP 2017, Nanjing China I am giving a keynote speech at the 2017 International Conference on Wireless Communications and Signal Processing, Nanjing, China, October 2017. The talk is on machine learning for drone-enabled flying Radio Access networks. Conference Keynote at ISWCS 2017, Bologna, Italy I am giving a keynote speech at the International Symposium on Wireless Communications Systems, in Bologna, Italy, August 2017. The talk is on future Fly Radio Access Networks, using drones. Our paper about flying radio access networks and drones received the Best Paper Award at EW2017! Our joint paper with collaborators from Czech Technical University entitled: \"Performance of Mobile Networks with UAVs: Can Flying Base Stations Substitute Ultra-Dense Small Cells?\" received the Best Paper Award at the 2017 European Wireless (EW) Conference, in Dresden Germany. Organizing a special session on \"Machine Learning for Communications\" at the ISWCS Confe",
  "content_length": 15163,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:06"
}