{
  "name": "David Hung-Chang Du",
  "homepage": "http://www-users.cs.umn.edu/~du",
  "status": "success",
  "content": "Home page of David Hung-Chang Du Home Grants Awarded Publications Students Awards and Honors Professional activites David Hung-Chang Du Professor Qwest Chair Professor Department of Computer Science and Engineering University of Minnesota, Twin Cities C.V. Short Bio Dr. Du is currently the Qwest Chair Professor of Computer Science and Engineering at University of Minnesota, Minneapolis. He was the Center Director of the NSF multi-university (joint with Texas A&M and Temple University) I/UCRC Center of Research in Intelligent Storage (CRIS) from 2009-2021. In additional to NSF, CRIS was sponsored by 18 companies in the past with 3.35M industrial membership funding to University of Minnesota. These companies include Xyratex (2010-2014), Seagate (2010-2019), Los Alamos National Lab (2010-2012), Symantec (2010-2012), Veritas (2016-2019), NEC-Lab (2012-2015), NetApp (2012-2017), Dell/Compellent (2013-2018), HPE (2013-2019), Hitachi Global Storage Systems (2013-2014), LSI (2012-2014), SGI (2013-2016), FedCentric (2013-2015), SK-Telecom (2014-2016), Cray Research (2014-2016), IBM (2015-2017), Intel (2015-2018), Huawei (2016-2018), and Salesforce (2016-2018). The other faculty involved in CRIS include David Lilja, Jon Weissman, Abhishek Chandra, and Mohamed Mokbel. Before NSF I/UCRC Center, he organized an Intelligent Storage Consortium at Digital Technology Center with industrial funding from StorageTek, Veritas, LSI Logic, LANL, Sun Micro, ETRI/Korea, and ITRI/Taiwan from 2002-2009. He was a Program Director (IPA) at National Science Foundation CISE/CNS Division from March 2006 to August 2008. At NSF, he was responsible for NeTS (Networking Research cluster) NOSS (Networks of Sensor Systems) Program and worked with two other colleagues, Karl Levitt and Ralph Wachter, on Cyber Trust (Internet Security) Program. In 2008 he was also assigned to CSR (Computer System Research) Cluster for handling research in computer systems. Dr. Du receives a B.S degree in Mathematics from National Tsing-Hua University (Taiwan) in 1974 and an M.S. and Ph.D. degrees from University of Washington (Seattle) in 1980 and 1981 respectively. He joined University of Minnesota as a faculty since 1981. Dr. Du also has been a visiting professor in Germany, Korea, Singapore, Hong Kong and Taiwan. Research Expertise Dr. Du’s current research focuses on intelligent storage systems, sensor/vehicular networks, and cyber physical systems. He has had research in high-speed networking, database design, multimedia computing and CAD for VLSI circuits. In his early career time, he worked on parallel processing and database design especially on hashing and partial match retrieval [319-334]. In 1980s and 1990s, he worked on Computer-Aided Design for VLSI circuits [283-318]. He has worked on computer networking and its related applications including multimedia computing from late 1980s to now [125-282]. His recent research on networking focuses on sensor and vehicular networks. Starting from 2000, due to the data amount increases dramatically each year, his research group focuses on new memory and storage technologies for handling extremely large volume of available data and how to preserve data over decades [1-124]. Currently his research focuses on hyper-converging infrastructure since our Internet today becomes the largest existing computer system in which data are collected and stored all the time, networks connecting all devices and computers become soft-defined and programmable networks and emerging non-volatile memory may become the future main memory in all computers/devices. Therefore, we no longer can separate research into architecture, computer systems, computer networking and storage. All aspects of these need to be integrated and considered together to construct the future Internet infrastructure. Some initial research results on hyper-converging including how to scale up the performance of distributed Key-Value stores with in-switch coordination [38], and how to use SDN for transaction processing in distributed Key-Value stores [39]. By now, he has authored and co-authored 343 technical papers including 151 referred journal publications in these research areas. He has graduated 67 Ph.D. (58 as single adviser and 9 jointly supervised) and 109 M.S. students in the last 40 years. His research in intelligent storage systems focuses on new and emerging storage technologies/architectures, that can handle semantic data and adaptive to long-term data preservation, and efficient power management for data centers. His research in sensor/vehicular networks and cyber physical systems focuses on vehicle-to-vehicle communications, future intelligent transportation systems, next generation air-transportation systems and security and privacy issues for cyber physical systems. His research in CAD includes physical layout, timing verification and delay fault testing for high-speed and very large-scale circuits. His research in high-speed networking includes heterogeneous high-performance computing over high-speed networks, quality of service, parallel data archive for high-performance computing, and optical networks. Professional Activities and Awards Dr. Du is an IEEE Fellow (since 1998) and a Fellow of the Minnesota Supercomputer Institute. He is currently a member of Advisory Committee to Institute of Information Science and Research Center for Information Technology Innovation, Academic Sinica in Taiwan and a member of International Advisory Board to Korean Journal of Computer Science and Engineering. He was an Editor of IEEE Transactions on Computers from 1993 to 1998. He was the US WEST Chair Professor at the University of Minnesota from 1994 to 2000. He has served on the Editorial Boards of several international journals including IEEE Transactions on Vehicle Technology. He has also served as Conference Chair and Program Committee Chair for several conferences in multimedia, networking security and database areas. Most recently, he is the General Chair for IEEE Security and Privacy Symposium (Oakland, California) 2009, Program Committee Co-Chair for International Conference on Parallel Processing 2009, and Workshop Co-Chair and the General Chair for IEEE International Conference on Distributed Computing Systems 2010 and 2011 respectively. General, Co-Chair of ACM International Conference on Underwater Networks and Systems 2013 and General Chair of International Conference on Parallel Processing (ICPP) 2014. He also served as the Chair of Steering Committee for ICPP from 2012-2017 and General Co-Chair of IEEE Conference on Computer Communication Security (CNS) 2015. Industrial Experiences Dr. Du has served as a consultant to a number of companies in the past, including: Honeywell, NCR, Unisys, 3M and IXMICRO. In 1996, he spent 6 months in the Computer Communications Lab (CCL) of the Industrial Technology Research Institute (ITRI) in Taiwan. His major function at CCL/ITRI was to plan several long term (5-year) R&D projects funded by the Ministry of Economic Affairs. He has served as a member of Technical Advisory Committee for CCL/ITRI from 1995 to 2010. In 1998, he joined IXMICRO as the Vice President of Research and Development for one year. He led a team of 30+ engineers to develop products such as ATM network interface cards, ATM switches, Fast Ethernet switches, wireless mice, ADSL modems, and streaming video servers. He has co-founded a startup company called Streaming21and also helped to establish another startup company called Baynacre with his former students. Baynacre was later acquired by Apache Design Solutions. He has served as Chairman and CEO for Streaming21 in 2000 and 2001. During this period, he helped to raise $18M funds from VCs for Streaming21 and managed 60+ employees. Streaming21 was focused on developing streaming video products for carrier and entertainment markets. Baynacre was focused on static timing analysis software tools for nano-technology. Contact Email: du at umn.edu Phone: (612) 625-2560 Address: 4-192 Keller Hall, 200 Union Street SE, Minneapolis, MN 55455 Office: Keller 4-225B & 421 Walter",
  "content_length": 8134,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:10"
}