{
  "name": "David Bamman",
  "homepage": "http://people.ischool.berkeley.edu/~dbamman",
  "status": "success",
  "content": "David Bamman David Bamman Associate Professor School of Information University of California, Berkeley Affiliated appointments: EECS, Linguistics, Computational Precision Health Faculty, Berkeley AI Research Lab (BAIR); Senior Fellow, Berkeley Institute for Data Science (BIDS) bluesky: @dbamman.bsky.social email: dbamman at berkeley.edu Fall 2025 office hours: Wed. 10am-noon (312 SH). CV David Bamman is an associate professor in the School of Information at UC Berkeley, where he works in the areas of natural language processing and cultural analytics, applying NLP and AI to empirical questions in the humanities and social sciences. His research focuses on improving the performance of computational methods for underserved domains like literature (including LitBank and BookNLP) and developing new empirical approaches for the study of literature, film and culture. Before Berkeley, he received his PhD in the School of Computer Science at Carnegie Mellon University and was a senior researcher at the Perseus Project of Tufts University. Bamman's work is supported by the National Endowment for the Humanities, National Science Foundation, Mellon Foundation, and an NSF CAREER award. I lead an amazing research group: Svenja Guhr, postdoctoral fellow Kent Chang, PhD student Nikita Mehandru, PhD student (co-advised with Steve Weber) Naitian Zhou, PhD student Dan Hickey, PhD student Apolline Tardy (co-advised with Kimiko Ryokai), PhD student Mackenzie Cramer, MIMS student I'm open to advising new PhD students applying to the School of Information (application deadline: Dec 3, 2025). For more information, see here. Alumni Lucy Li, PhD 2025 → Asst. Prof., Dept. of Computer Science, University of Wisconsin (2026) Sandeep Soni, Postdoc → Asst. Prof., Quantitative Theory and Methods, Emory University Jon Gillick, PhD 2022 → Postdoc, Creative Computing Institute, University of the Arts London Matt Sims, Postdoc → Sudowrite Publications David Bamman, Sabrina Baur, Mackenzie Hanh Cramer, Anna Ho and Tom McEnaney (2025), \"Measuring the Stories in Contemporary Songs\" [pdf]. Naitian Zhou, David Bamman and Isaac L. Bleaman (2025), \"Culture is Not Trivia: Sociocultural Theory for Cultural NLP,\" ACL [preprint]. Li Lucy, Camilla Griffiths, S. Levine, Jennifer L. Eberhardt, Dorottya Demszky and David Bamman (2025), \"Tell, Don’t Show: Leveraging Language Models’ Abstractive Retellings to Model Literary Themes,\" Findings of ACL [preprint]. Li Lucy, Camilla Griffiths, Claire Ying, JJ Kim-Ebio, Sabrina Baur, Sarah Levine, Jennifer L. Eberhardt, David Bamman and Dorottya Demszky (2025), \"Racial and Ethnic Representation in Literature Taught in US High Schools,\" Journal of Cultural Analytics 10.1 [pdf]. Minju Choi, Li Lucy, Patricia Bromley and David Bamman (2025), \"Othering through War: Depiction of Asians/Asian Americans in U.S. History Textbooks from California and Texas,\" Educational Researcher [pdf]. David Bamman, Rachael Samberg, Richard Jean So and Naitian Zhou (2024), \"Measuring Diversity in Hollywood through the Large-Scale Computational Analysis of Film,\" PNAS [article]. Naitian Zhou and David Bamman (2024), \"Once More, With Feeling: Measuring Emotion of Acting Performances in Contemporary American Film,\" CHR 2024 [pdf]. Kent K. Chang, Anna Ho, David Bamman (2024), \"Subversive Characters and Stereotyping Readers: Characterizing Queer Relationalities with Dialogue-Based Relation Extraction,\" CHR 2024 [pdf]. David Bamman, Kent K. Chang, Li Lucy and Naitian Zhou (2024), \"On Classification with Large Language Models in Cultural Analytics,\" CHR 2024 [pdf]. Matthew Wilkens, Elizabeth F. Evans, Sandeep Soni, David Bamman and Andrew Piper (2024), \"Small Worlds: Measuring the Mobility of Characters in English-Language Fiction,\" Journal of Computational Literary Studies [preprint]. Li Lucy, Suchin Gururangan, Luca Soldaini, Emma Strubell, David Bamman, Lauren Klein and Jesse Dodge (2024), \"AboutMe: Using Self-Descriptions in Webpages to Document the Effects of English Pretraining Data Filters,\" ACL [pdf]. Naitian Zhou, David Jurgens and David Bamman (2024), \"Social Meme-ing: Measuring Linguistic Variation in Memes,\" NAACL [pdf]. Kent K. Chang, Mackenzie Cramer, Sandeep Soni, and David Bamman (2023), \"Speak, Memory: An Archaeology of Books Known to ChatGPT/GPT-4,\" EMNLP [pdf]. Sandeep Soni, Amanpreet Sihra, Elizabeth F. Evans, Matthew Wilkens and David Bamman (2023), \"Grounding Characters and Places in Narrative Text,\" ACL [pdf]. Kent K. Chang, Danica Chen and David Bamman (2023), \"Dramatic Conversation Disentanglement,\" Findings of ACL [pdf]. Li Lucy, Jesse Dodge, David Bamman and Katherine A. Keith (2023), \"Words as Gatekeepers: Measuring Discipline-specific Terms and Meanings in Scholarly Publications,\" Findings of ACL [pdf]. Li Lucy, Divya Tadimeti and David Bamman (2022), \"Discovering Differences in the Representation of People Using Contextualized Semantic Axes,\" EMNLP 2022 [pdf]. Sandeep Soni, David Bamman and Jacob Eisenstein (2022), \"Predicting Long-Term Citations from Short-Term Linguistic Influence,\" Findings of EMNLP 2022 [pdf]. Andrew Piper, Richard Jean So and David Bamman (2021), \"Narrative Theory for Computational Narrative Understanding,\" EMNLP 2021 [pdf]. Jon Gillick, Joshua Yang, Carmine-Emanuele Cella and David Bamman (2021), \"Drumroll Please: Modeling Multi-Scale Rhythmic Gestures with Flexible Grids,\" Transactions of the International Society for Music Information Retrieval (TISMIR) [pdf]. Jon Gillick, Wesley Deng, Kimiko Ryokai and David Bamman (2021), \"Robust Laughter Detection in Noisy Environments,\" Interspeech [pdf]. Li Lucy and David Bamman (2021), \"Gender and Representation Bias in GPT-3 Generated Stories,\" NAACL 2021 Workshop on Narrative Understanding [pdf]. Jon Gillick and David Bamman (2021), \"What to Play and How to Play it: Guiding Generative Music Models with Multiple Demonstrations,\" New Interfaces for Musical Expression (NIME) [pdf]. Li Lucy and David Bamman (2021), \"Characterizing English Variation across Social Media Communities with BERT,\" Transactions of the ACL [pdf]. Matthew Sims and David Bamman (2020), \"Measuring Information Propagation in Literary Social Networks,\" EMNLP 2020 [pdf]. Matthew Jörke, Jon Gillick, Matthew Sims and David Bamman (2020), \"Attending to Long-Distance Document Context for Sequence Labeling,\" Findings of EMNLP 2020 [pdf]. David Bamman (2020), \"Born-Literary Natural Language Processing,\" Debates in Digital Humanities, [preprint]. David Bamman and Patrick J. Burns (2020), \"Latin BERT: A Contextual Language Model for Classical Philology,\" [preprint]. David Bamman, Olivia Lewke and Anya Mansoor (2020), \"An Annotated Dataset of Coreference in English Literature,\" LREC 2020 [pdf]. Matthew Sims, Jong Ho Park and David Bamman (2019), \"Literary Event Detection,\" ACL 2019 [pdf]. Jon Gillick, Adam Roberts, Jesse Engel, Douglas Eck and David Bamman (2019), \"Learning to Groove with Inverse Sequence Transformations,\" ICML 2019 [pdf]. Jon Gillick, Carmine-Emanuele Cella and David Bamman, \"Estimating Unobserved Audio Features for Target-Based Orchestration,\" ISMIR 2019 [pdf]. Jon Gillick and David Bamman (2019), \"Breaking Speech Recognizers to Imagine Lyrics,\" NeurIPS Workshop on Machine Learning for Creativity and Design [pdf]. David Bamman, Sejal Popat and Sheng Shen (2019), \"An Annotated Dataset of Literary Entities,\" NAACL 2019 [pdf]. Jon Gillick and David Bamman (2018), \"Please Clap: Modeling Applause in Campaign Speeches,\" NAACL 2018 [pdf]. Jon Gillick and David Bamman (2018), \"Telling Stories with Soundtracks: An Empirical Analysis of Music in Film,\" NAACL 2018 Storytelling Workshop [pdf]. Ted Underwood, David Bamman, and Sabrina Lee (2018), \"The Transformation of Gender in English-Language Fiction,\" Cultural Analytics [pdf]. Kimiko Ryokai, Elena Durán López, Noura Howell, Jon Gillick, and David Bamman (2018), \"Capturing, Representing, and Interacting with Laughter,\" CHI 2018 [pdf]. Lara McConnaughey, Jennifer Dai and David Bamman (2017), \"The Labeled Segmentation of Printed Books,\" EMNLP 2017 [pdf]. Yi Wu, David Bamman and Stuart Russell (2017), \"Adversarial Training for Relation Extraction,\" EMNLP 2017 [pdf]. David Bamman, Michelle Carney, Jon Gillick, Cody Hennesy, and Vijitha Sridhar (2017), \"Estimating the Date of First Publication in a Large-Scale Digital Library,\" JCDL 2017 [pdf] David Bamman (2017), \"Natural Language Processing for the Long Tail,\" Digital Humanities 2017 [pdf] Smitha Milli and David Bamman (2016), \"Beyond Canonical Texts: A Computational Analysis of Fanfiction,\" EMNLP 2016 [pdf] David Bamman (2016), \"Interpretability in Human-Centered Data Science,\" CSCW Workshop on Human-Centered Data Science [pdf] David Bamman and Noah Smith, \"Open Extraction of Fine-Grained Political Statements,\" EMNLP 2015. [pdf] David Bamman and Noah Smith, \"Contextualized Sarcasm Detection on Twitter,\" ICWSM 2015. [pdf] [bib] David Bamman and Noah Smith, \"Unsupervised Discovery of Biographical Structure in Text,\" Transactions of the ACL (October 2014). [pdf] [synopsis] [bib] David Bamman, Jacob Eisenstein and Tyler Schnoebelen, \"Gender Identity and Lexical Variation in Social Media,\" Journal of Sociolinguistics 18.2 (2014). [article] [preprint] [bib] David Bamman, Ted Underwood and Noah Smith, \"A Bayesian Mixed Effects Model of Literary Character,\" ACL 2014. [pdf] [synopsis] [bib] David Bamman, Chris Dyer and Noah Smith, \"Distributed Representations of Geographically Situated Language,\" ACL 2014. [pdf] [synopsis] [bib] David Bamman, Brendan O'Connor and Noah Smith, \"Learning Latent Personas of Film Characters,\" ACL 2013. [pdf] [data] [code] [bib] David Bamman, Adam Anderson, and Noah Smith, \"Inferring Social Rank in an Old Assyrian Trade Network,\" Digital Humanities (2013) [ArXiv] Schneider, Nathan, Brendan O'Connor, Naomi Saphra, David Bamman, Manaal Faruqui, Jason Baldridge, Noah A. Smith, and Chris Dyer, \"A Framework for (Under)specifying Dependency Syntax without Overloading Annotato",
  "content_length": 13656,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:41"
}