{
  "name": "David Welch",
  "homepage": "https://www.cs.auckland.ac.nz/~davidw",
  "status": "success",
  "content": "David Welch David Welch Department of Computer Science Computational evolution group Room 365 Building 303S Ph + 64 9 923 8930 david.welch@auckland.ac.nz My University profile My Google scholar profile On Twitter About me I am a Senior Lecturer in the Department of Computer Science at the University of Auckland and a principal investigator in the Computational Evolution Group. My research interests include developing and fitting phylogenetic models to epidemiology (so-called \"phylodynamics\"), Bayesian computational methods including MCMC and ABC, epidemics on networks, stochastic simulation and inference for coalescent-based population genetics. I currently teach courses in computational biology and inference, and bioinformatics. Feel free to contact me about research projects offered at Honours, Masters and PhD level. News Jul 2015: Talk on estimating neighbourhood size at MMEE 2015 in Paris (slides) and sampled ancestors at SMBE 2015 in Vienna (slides). Dec 2014: Promoted to Senior Lecturer (see Auckland academic payscale here) Jan 2014: Co-organised the 18th Annual New Zealand Phylogenomics meeting on the lovely Waiheke Island Oct 2013: PI on new Marsden grant, \"A unified framework for phylodynamic inference of infectious diseases\" with Alexei Drummond and Tanja Stadler Jul 2013: PI on new FRDF grant, \"Bayesian phylodynamics for infectious diseases\" with Alexei Drummond and Tim Vaughan Academic bio Senior Lecturer, Department of Computer Science, University of Auckland, 2015- Lecturer, Department of Computer Science, University of Auckland, 2011-2014 Postdoctoral Researcher, Centre for Disease Dynamics and Department of Statistics, Penn State University, USA, 2008-2011 Postdoctoral Researcher, Imperial College London, UK, working with David Balding and Mark Beaumont, 2006-2008 Ph.D, Applied Mathematics, University of Auckland, supervised by Geoff Nicholls, Allen Rodrigo and Wiremu Solomon, 2006 B.A. (Maori) and B.Sc. Hons. (Maths), University of Otago. Teaching Computational Science (CompSci 369), 2012-2015 Comparative Bioinformatics (BioInf 702), 2012-2015 Genome Bioinformatics and Systems Biology (BioInf 703), 2012-2015 Discrete Structures in Mathematics and Computer Science (CompSci 225), 2013 Algorithms and Data Structures (CompSci 220), 2012 Elementary Statistics (Stat 200), Penn State, 2011 Publications Also see listings at Google scholar Bayesian total evidence dating reveals the recent crown radiation of penguins Alexandra Gavryushkina, Tracy A Heath, Daniel T Ksepka, Tanja Stadler, David Welch, Alexei J Drummond arXiv preprint arXiv:1506.04797, 2015 Abstract The total evidence approach to divergence-time dating uses molecular and morphological data of extant and fossil species to infer phylogenetic relationships, species divergence times, and macroevolutionary parameters in a single coherent framework. Current model-based implementations of this approach lack an appropriate model for the tree describing the diversification and fossilisation process which can result in erroneous conclusions. We address this shortcoming by providing a total evidence method implemented in a Bayesian framework. This approach uses a mechanistic tree prior to describe the underlying diversification process that generated the tree of extant and fossil taxa. Previous attempts to apply the total-evidence approach have used tree priors that do not account for the possibility that fossil samples may be direct ancestors of other samples. The fossilised birth-death process explicitly models the diversification, fossilisation, and sampling processes and naturally allows for sampled ancestors. This model was recently applied to estimate divergence times based on molecular data and fossil occurrence dates. We incorporate the fossilised birth-death model and a model of morphological trait evolution into a Bayesian total-evidence approach to dating species phylogenies. We apply this method to extant and fossil penguins and show that the modern penguins radiated much more recently than has been previously estimated, with the basal divergence in the crown clade occurring at~12.5 Ma and most splits leading to extant species occurring in the last 2 million years. Our results demonstrate that including stem-fossil diversity can greatly improve the estimates of the divergence times of crown taxa. The method is available in BEAST2 (v2.3) software www.beast2.org with packages SA (v1.1.3) and morph-models (v1.0.1) installed. BibTeX @article{gavryushkina2014, author = {{Gavryushkina}, A. and {Heath}, T.~A. and {Ksepka}, D.~T. and {Stadler}, T. and {Welch}, D. and {Drummond}, A.~J.}, title = \"{Bayesian total evidence dating reveals the recent crown radiation of penguins}\", journal = {ArXiv e-prints}, archivePrefix = \"arXiv\", eprint = {1506.04797}, primaryClass = \"q-bio.PE\", keywords = {Quantitative Biology - Populations and Evolution}, year = 2015, month = jun, adsurl = {http://adsabs.harvard.edu/abs/2015arXiv150604797G} } PDF Bayesian Inference of Sampled Ancestor Trees for Epidemiology and Fossil Calibration Alexandra Gavryushkina, David Welch, Tanja Stadler and Alexei J. Drummond PLoS Computational Biology 10(12): e1003919, 2014 Abstract Phylogenetic analyses which include fossils or molecular sequences that are sampled through time require models that allow one sample to be a direct ancestor of another sample. As previously available phylogenetic inference tools assume that all samples are tips, they do not allow for this possibility. We have developed and implemented a Bayesian Markov Chain Monte Carlo (MCMC) algorithm to infer what we call sampled ancestor trees, that is, trees in which sampled individuals can be direct ancestors of other sampled individuals. We use a family of birth-death models where individuals may remain in the tree process after sampling, in particular we extend the birth-death skyline model [Stadler et al., 2013] to sampled ancestor trees. This method allows the detection of sampled ancestors as well as estimation of the probability that an individual will be removed from the process when it is sampled. We show that even if sampled ancestors are not of specific interest in an analysis, failing to account for them leads to significant bias in parameter estimates. We also show that sampled ancestor birth-death models where every sample comes from a different time point are non-identifiable and thus require one parameter to be known in order to infer other parameters. We apply our phylogenetic inference accounting for sampled ancestors to epidemiological data, where the possibility of sampled ancestors enables us to identify individuals that infected other individuals after being sampled and to infer fundamental epidemiological parameters. We also apply the method to infer divergence times and diversification rates when fossils are included along with extant species samples, so that fossilisation events are modelled as a part of the tree branching process. Such modelling has many advantages as argued in the literature. The sampler is available as an open-source BEAST2 package (https://github.com/CompEvol/sampled-ance​stors) BibTeX @article{gavryushkina2014, author = {Gavryushkina, Alexandra AND Welch, David AND Stadler, Tanja AND Drummond, Alexei J.}, journal = {PLoS Comput Biol}, publisher = {Public Library of Science}, title = {Bayesian Inference of Sampled Ancestor Trees for Epidemiology and Fossil Calibration}, year = {2014}, month = {12}, volume = {10}, url = {http://dx.doi.org/10.1371%2Fjournal.pcbi.1003919}, pages = {e1003919}, number = {12}, doi = {10.1371/journal.pcbi.1003919} } PDF Modelling competition and dispersal in a statistical phylogeographic framework Louis Ranjard, David Welch, Marie Paturel and Stéphane Guindon Systematic Biology, 63(5): 743-752, 2014 Abstract Competition between organisms influences the processes governing the colonization of new habitats. As a consequence, species or populations arriving first at a suitable location may prevent secondary colonization. While adaptation to environmental variables (e.g., temperature, altitude, etc.) is essential, the presence or absence of certain species at a particular location often depends on whether or not competing species co-occur. For example, competition is thought to play an important role in structuring mammalian communities assembly. It can also explain spatial patterns of low genetic diversity following rapid colonization events or the “progression rule” displayed by phylogenies of species found on archipelagos. Despite the potential of competition to maintain populations in isolation, past quantitative analyses have largely ignored it because of the difficulty in designing adequate methods for assessing its impact. We present here a new model that integrates competition and dispersal into a Bayesian phylogeographic framework. Extensive simulations and analysis of real data show that our approach clearly outperforms the traditional Mantel test for detecting correlation between genetic and geographic distances. But most importantly, we demonstrate that competition can be detected with high sensitivity and specificity from the phylogenetic analysis of genetic variation in space. BibTeX @article{ranjard2014, author = {Ranjard, Louis and Welch, David and Paturel, Marie and Guindon, Stéphane}, title = {Modelling competition and dispersal in a statistical phylogeographic framework}, volume = {63}, number = {5}, pages = {743-752}, year = {2014}, doi = {10.1093/sysbio/syu040}, URL = {http://sysbio.oxfordjournals.org/content/63/5/743.abstract}, eprint = {http://sysbio.oxfordjournals.org/content/63/5/743.full.pdf+html}, journal = {Systematic Biology} } PDF Efficient Bayesian inference under the structured coalescent Tim Vaughan, Denise Kühnert, Alex Popinga, David Welch, Alexei J Drummond Bionformatics, 30(16): 2272-2279, 2014 Abstract Motivation: Population structure significantly affects evolutionary dynamics. Such structure may be due to spat",
  "content_length": 27721,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:14"
}