{
  "name": "David Koslicki",
  "homepage": "https://koslickilab.github.io/Koslicki-lab-PSU",
  "status": "success",
  "content": "Koslicki Lab - Home The Koslicki Lab at Pennsylvania State University The Koslicki lab focuses on computational biology. We are interested in developing efficient, mathematically sound approaches to extract insight from omics data. This puts our research squarely at the intersection of biology, mathematics, and computer science. We are particularly interested in the entire arc of developing computational biology methods: rigorous mathematical justification of a method, implementing the method into a tool usable by the community, applying the tool to pressing scientific problems, and finally using the results to inform further development of computational techniques. Recent News About Our Lab February 2, 2024 EveryCure has partnered with the Koslicki Lab and received a $48.3M grant from ARPA-H to find new uses for FDA-approved drugs. More info at: https://everycure.org/every-cure-to-receive-48-3m-from-arpa-h-to-develop-ai-driven-platform-to-revolutionize-future-of-drug-development-and-repurposing/ June 25, 2024 Congratulations to Shaopeng for successfully defending his PhD thesis! ... see all News Part of our team Research Direction Algorithm Development or Mathematical Theory Computational data-driven research focuses on developing and applying computational methods across various types of omics datasets. Such research is performed in a new type of laboratory, often called a dry lab. Our team designs, develops and applies novel and robust data-driven, computational approaches that will accelerate the diffusion of genomics and biomedical data into translational research and education. Reasoning Over Large Knowledge Graphs We believe in data analysis transparency, effective sharing, reproducibility, software usability, and archival stability to foster a sustainable data science ecosystem in biomedical research. Metagenomics Research We are a team of enthusiastic researchers aimed to combine open omics data with robust bioinformatics methods to enable novel biological discoveries. We are committed to ensuring an inclusive and supportive environment. We also believe in empowering the members of our team with necessary bioinformatics training and support, allowing them to make important contributions to the fields of biomedical research. >",
  "content_length": 2274,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:21"
}