{
  "name": "David A. Forsyth",
  "homepage": "http://luthuli.cs.uiuc.edu/~daf",
  "status": "success",
  "content": "D.A. Forsyth's Home Page David Forsyth's Home Page O No! It's the baby-eating Bishop of Bath and Wells! My recent books Probability and Statistics for Computer Science Probability and Statistics for Computer Science CV2E: Computer Vision, second edition Some family photos How to contact me Publications Teaching Areas of Interest Supported Projects Slides from Recent Talks Vision at UIUC Group Members Administration Miscellaneous Some Diving Photographs Research 8 year old publication list: I'll revise this A list of my papers, books, etc. Tutorial material:  I have given several tutorials on various topics at various places. Current courses CS 543 - Computer Vision (Fall 2025 version) Some web pages from recent past courses CS 544 - Optimization in Computer Vision (Spring 2024 version) CS 543/ECE 549 - Computer Vision (Fall 2023 version) CS 588 - Autonomous Vehicle System Engineering (MAAV) (Spring 2023 version) MLSS 3 talks on computer vision for autonomous vehicles CS 588 - Autonomous Vehicle System Engineering (MAAV) (Fall 2022 version) Slides for ICVSS Talk on Intrinsic Images Notes and bibliography for ICVSS Talk on Intrinsic Images CS 588 - Autonomous Vehicle System Engineering (MAAV) (Fall 2021 version) CS 598 - AI meets computer graphics (Spring 21 version) CS 598 - MAAV (Fall 2020 version) CS 498 - Applied Machine Learning (Spring 2020 version) CS 598 - MAAV (Fall 2019 version) CS 544 - Optimization in Vision and AI, fall 2019 Version CS 498 - Applied Machine Learning (Spring 2018 version) CS 498 - Applied Machine Learning (Fall 2018 version) CS 544 - Optimization in Vision and AI, fall 2017 Version CS 498 - Applied Machine Learning (Spring 2017 version) CS 598 - MAAV (Spring 2017 version) CS 498 - Applied Machine Learning (Spring 2016 version) CS 498 - Probability and Statistics for Undergraduate Computer Scientists (Fall 2015 version) CS 498 - Probability and Statistics for Undergraduate Computer Scientists (Spring 2015 version) CS 498 - Probability and Statistics for Undergraduate Computer Scientists, Fall 2014 version CS 544 - Optimization in Vision and AI CS 199, XX 199 - Big Data Computer Vision Tutorial 2012 Signals AI CS 498 Signals AI CS-418 Computer Graphics CS-598 Applications of Computer Vision in Human Motion Understanding CS543 Computer Vision 2009 CS 598 Optimization in computer vision and machine learning Reading group CS419 Production Computer Graphics CS598 Readings in Computer Vision, Machine Learning, Artificial Intelligence and NLP Projects by Picture Understanding Human Activity Finding and Tracking People Animating People Labelling Activities Words and Pictures Object Recognition Depiction and iconography Modifiers and object categories Shading and Reconstruction Rendering Reconstructing cloth Reconstruction from shading Current NSF Funded Research Current NSF-funded work on human activity Current NSF-funded work on understanding the meaning of pictures Current NSF-funded work on interpreting rooms Current DHS funded Research Current ONR funded Research Slides from recent talks 2012 Attributes, bias\tand hashing (at ECCV attributes workshop; gzipped tarfile of keynote) What are they doing with their hands (at ECCV activity workshop; gzipped tarfile of keynote) 2011 More words and bigger pictures (I have given this talk at\tvarious locations, including RSS 2011 and at a Johns Hopkins workshop on language) Size isn't important (I gave this talk at a CVPR workshop in 2011) Looking at people (again) (I have given versions of this talk at various locations) Big datasets - promise, or, Big data, schmig data (I gave this talk at the NSF Frontiers of Vision workshop in 2011) Cat herding for fun and profit, or, what every computer vision person should know (I gave this talk at the NSF Frontiers of Vision workshop in 2011) 2010 Mine is still bigger than yours (I gave this talk at a CVPR workshop in 2010) Looking at people (again) (I have given versions of this talk at various locations) Attributes in Object Recognition (I gave this talk at the INRIA summer school in 2010) Activity Recognition (I gave this talk at the INRIA summer school in 2010) 2009 Sentences and pictures: not just “more words” and pictures (I gave this talk at a CVPR workshop in 2009) Mine is bigger than yours: big datasets in computer vision (I gave this talk at a CVPR workshop in 2009) What should we mean when we say \"scene\" (I gave this talk at a CVPR workshop in 2009, and at the SUNS workshop in 2009) Activity, Appearance, Aspect and Attributes (I gave this talk at the international workshop on video in 2009) A set of four talks on words and pictures, which I gave at the ICVSS in 2009 The problem Basic methods Variants More Structure 2008 Looking at People, (I have given versions of this talk as a plenary at ICDSC-2008, at Google, at INRIA, at IBM and at TTI Chicago) Shading and Recognition or the first Mrs Rochester (I gave this talk at the Lake Como workshop on object recognition) Currently, UIUC has a really rich community of professors in computer vision. Saurabh Gupta Derek Hoiem Lana Lazebnik Alex Schwing Shenlong Wang Yuxiong Wang PhD Students, Post-docs, Visiting scholars Current Sometime Ian Endres Aditya Deshpande Brett Jones Kevin Karsch Zicheng Liao Jason Rock Amin Sadeghi Kevin Shih Raj Sodhi Daphne Tsatsoulis Yang Wang Okan Arikan (currently Asst Prof, U.T. Austin; Animate-me) Kobus Barnard (currently Assoc Prof, U.Ariz.) Tamara Berg (currently Asst Prof, SUNY SB) Stephen Chenney (left for UW Madison) Frank Cho Pinar Duygulu (currently Asst Prof, Bilkent U) Jaety Edwards Ali Farhadi (currently Post-doc, CMU) John Haddon Varsha Hedau (currently Nokia research) Sergey Ioffe (Google) Leslie Ikemoto (Animate-me) Nazli Ikizler (curently Post-doc, Boston U) Erik Learned-Miller (currently Asst Prof, UMAmherst) Nicolas Loeff Deva Ramanan (currently Asst Prof, UC Irvine) Alex Sorokin (currently at Crowdflower) Duan Tran Gang Wang (currently Asst Prof, Nanyang Technological University) Ryan White (Euclid media) Du Tran Administrative work Porn committee: I served on an NRC committee on web pornography; here is the report. Letters and Science major: I used to chair the Computer Science L+S Steering committee at UC Berkeley. Most people encounter this committee through dealings with the L+S advisor, Barbara Hightower UC Berkeley admissions policy: I served on the UCB AEPE (Admissions, Enrollments and Primary Education) committee for a period of six years, 1995-2001 (a lively period in the life of this committee, due to changes in California law). The committee put together a comprehensive assessment policy that is now widely regarded as a model policy (described in a report ; more stuff is at the current committee page ). An excellent tea merchant My son is regularly followed by curious fish Photographs by Robert Robert being watched while taking pix A sequence of my photographs, with a (silly, not-real, joke) story what I did on Sun 1 May Other Older Books In English In Chinese In Japanese In Russian Translation opportunity",
  "content_length": 7052,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:31"
}