{
  "name": "David Hutchison 0001",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/david-hutchison",
  "status": "success",
  "content": "David Hutchison - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Professor David Hutchison Professor Emeritus Research Overview I lead the Lancaster research on resilience for communications and networked systems; this is a relatively new area that I started with James Sterbenz in 2008. We have developed a framework for resilience management that can cope with challenges including natural disasters and cyberattacks such as DDoS, and applied it to systems such as clouds and utility networks. This ongoing work is crucial for the protection of critical infrastructures and the services running on them. I am Vice-Chair of RECODIS, the EU COST Action on resilient communications, and lead researcher for resilience in the new Network 2030 ITU standards initiative. Publications Projects PhD Students Research Groups Selected Publications Show all 330 publications Resilience and survivability in communication networks: Strategies, principles, and survey of disciplinesSterbenz, J.P.G., Hutchison, D., Çetinkaya, E.K., Jabbar, A., Rohrer, J.P., Schöller, M., Smith, P. 1/06/2010 In: Computer Networks. 54, 8, p. 1245-1265. 21 p.Journal article All Publications Show only selected publications SL: Understanding and Developing Effective Communications in Security 18/07/2022 → 17/01/2024 Research SL: Managing Cyber Security Supply Chain Risk In Critical National Infrastructure 01/01/2022 → 30/06/2025 Research TAS-S: Trustworthy Autonomous Systems Node in Security 01/11/2020 → 31/10/2024 Research Enable Ancillary Services bY Renewable Energy Sources 01/03/2018 → 31/12/2021 Research Enable Ancillary Services by Renewable Energy Sources (EASY-RES) 01/03/2018 → 31/12/2021 Research NG-CDI : Next Generation Converged Digital infrastructure 01/11/2017 → 31/10/2023 Research INITIATE : UK Interconnected Test Beds to support a research and innovation internet evironment 01/02/2017 → 31/01/2021 Research Resilient communication services protecting end-user applications from disaster-based failures 01/03/2016 → 29/02/2020 Research Cyber Security of the Internet of Things 29/02/2016 → … Research Cyber Security of the Internet of things 28/02/2016 → 31/08/2019 Research A Situation Aware Information Infrastructure 02/11/2015 → 04/09/2017 Research Research Investment Equipment Grant 09/03/2015 → 31/03/2015 Research MUMBA: Multi-faceted Metrics for ICS Business Risk Analysis 01/10/2014 → 31/12/2017 Research Towards Ultimate Convergence of all Networks (TOUCAN) 11/08/2014 → 31/12/2020 Research Secure Cloud Computing for Critical Infrastructure 01/01/2013 → 31/12/2015 Research FP7: OFELIA open flow in Europe: Linking infrastructure & applications 01/09/2012 → 30/09/2013 Research FP7: STEER; Social Telemedia Environment for Experimental research 01/09/2012 → 30/11/2014 Research IU-ATC Phase 2: Inidia-UK Advanced Technology Centre in Next Generation Networks Systems and Services 01/05/2012 → 30/04/2015 Research Understanding and managing energy use in future networks 01/03/2011 → 30/11/2013 Research FIRM 01/01/2010 → 30/06/2013 Research IU-ATC of excellence in next generation networks systems and services 01/07/2009 → 30/04/2012 Research FP7:INTERSECTION 01/01/2008 → 31/12/2009 Research Towards robust attack detection in wireless mesh networks 01/11/2007 → 31/03/2008 Research FP6: Content 01/07/2006 → 31/07/2012 Research RECODIS 01/01/1900 → … Research Nicholas Hart PhD student SCC (Networking) enable JavaScript to view email address Alexander Jung PhD student SCC (Networking) enable JavaScript to view email address Cyber Security Research Centre (Networking) SCC (Networking) Security Lancaster (Networks) Back to listing Contact Details Department: Computing and Communications TelTelephone: +44 (0)1524 510331 enable JavaScript to view email address Back to listing",
  "content_length": 4046,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:10"
}