{
  "name": "David May",
  "homepage": "https://www.cs.bris.ac.uk/~dave",
  "status": "success",
  "content": "Home page of Professor David May Home page of Professor David May Welcome to my WWW-home. You can contact me via the Royal Mail: Professor David May FREng FRS Department of Computer Science University of Bristol Merchant Venturers Building Woodland Road BRISTOL BS8 1UB United Kingdom By using the phone: +44 117 9545134 (Phone) Or with e-mail, dave@cs.bris.ac.uk There is a wiki page here: David May Research Computer Architecture Publications New Architecture Over the last few months, I have been experimenting with some ideas to align architecture with modern programming languages and new application areas such as Robotics and IoT. This was prompted by discussions with students and colleagues. An important part of this work has been the design of a fast hardware memory allocation system, integrated into the processor. It is described briefly here: The SURE Architecture A more extensive explanation is: The SURE Architecture - long version I have also started to explore how to use these ideas in larger systems, SURE - big memory, and how to use them in conjunction with processes and input-output SURE - contexts Simple Computers Simple 8-bit processor Simple processor Compiler source Compiler assembler X and ARM Thumb Thumb Instructions and Kernels Simple Language and Compiler Description Simple Compiler source Simple Compiler assembler Experimental Notes Bootstrapping Compiling Memory Hierarchy Communication and Kernel Concurrency and Parallelism Heap and Garbage Collector Presentations Why Wear a Computer The Web in 2010 Architectures for Ubiqitous Computing Zero power computing The Skills Gap Design in Bristol Design in Bristol - short version The Return of Innovation The Return of Innovation - short version Architecture and Design Commodity High Performance Computing Communicating Process Architecture for Multicores Pasquale Pistorio Oration Software Defined Silicon Communicating Processors Multicore Architecture XMOS Architecture XMOS Architecture & XS1 Chips Why are Multicores a Challenge? Brains for Robots Heterogeneous Multicores? Why? Universal Processors Bristol, Inmos and the Transputer The transputer in tokyo, 1984 The transputer implementation of occam, Tokyo 1984 Origins of Computer Science Pre 1950 Sources Computer History Transputers Occam Interests Running Motorbikes",
  "content_length": 2319,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:36"
}