{
  "name": "David Maier 0001",
  "homepage": "https://web.cecs.pdx.edu/~maier",
  "status": "success",
  "content": "David Maier at Portland State University Dr. David Maier maier at pdx dot edu (503) 725 2406 Dept. of Computer Science Portland State University PO Box 751 Portland, OR  97207-0751 1900 SW 4th Avenue, Suite 115-09 Portland, OR 97201 Current Travel Schedule: Out of town, 31 July  5 August Out of town, 2225 August Out of country, 317 December 2025 Maseeh Professor Emeritus of Emerging Technologies Department of Computer Science Maseeh College of Engineering & Computer Science Portland State University Joint appointments: Visiting Professor, Medical Informatics & Clinical Epidemiology, School of Medicine, OHSU Recent Courses: CS 486/586 Introduction to Database Management Systems Fall 2018 CS 410/510 Cloud and Cluster Data Management Fall 2021 CS 669 Scholarship Skills Winter 2022 Contribute to the Richard Kieburtz Memorial Graduate Fellowship. Research: I was a General Chair for the 2020 SIGMOD/PODS Conference, in (virtual) Portland, Oregon. I am part of the Data and Information Management Laboratory (Datalab) at PSU. The Database Reading Group has been meeting more or less weekly for about 35 years, first at OGI and now at PSU. We have suspended meetings during the COVID-19 pandemic. (The group has been on hiatus during the pandemic, but might resume in winter of 2023, perhaps on a semi-weekly basis.) Research areas I work in include: I have started collaborating with a new professor at PDX, Primal Pappachan  in the area of database privacy. I am investigating various topics with Banafsheh Rekabdar at the juncture of ML and database systems, such as data productivity and detection of colluding actors. Computational Photography. I am working with Atul Ingle and others in the Computational Imaging Lab on the EDPHi Project (Equi-Depth Photon Histograms, pronounced edify). We are looking at bandwidth- and energy-efficient distance imaging with single-photon cameras. Our approach uses equi-depth histograms and race logic. Our paper on the topic got the Best Paper award at ICCP 23. I collaborate with Arash Termehchys IDEA Lab group at Oregon State. We recently had a paper presented at VLDB 2023: Effective Entity Augmentation by Querying External Data Sources. Data Streams. My work with data streams began with the NiagaraST project, which was conducted jointly with University of Wisconsin (Niagara page at UW). That work has been continued in the latte project looking at streamed and archived data, in collaboration with the Intelligent Transportation Systems Laboratory at PSU. A second aspect of this work is Mutant Query Plans, an alternative to conventional distributed query processing. I have also participated in research in data streams at Microsoft Research, in connection with StreamInsight. Superimposed Information Management. Superimposed information (SI) is information placed over existing base sources in order annotate, link, reorganize, classify or otherwise enhance those sources. There have been a number of projects over the years developing or using SI, all in collaboration with Lois Delcambre. Most recently we have been looking at its use in the context of digital libraries, as part of the Ensemble project, which we call Canonical Structures. Past projects include are Sidewalk (joint with Virginia Tech and Villanova, Overcast and SPARCE (Superimposed Pluggable Architecture for Contexts and Excerpts). Scientific Information Management. I participate on the Cyber-Infrastructure team the Science and Technology Center for Coastal Margin Observation & Prediction (CMOP) at OHSU.  Data Near Here is the main project Im pursuing with CMOP. I have been involved with the SciDB array database project since its inception, and am currently involved in a joint research project with Brown, MIT, Wisconsin and Washington. My main activity there is AGRIOS (A Generalized R Interface Over SciDB). SciDB is also a key component of the Intel Science and Technology Center for Big Data in which I participate.  Together with researchers at Washington and Michigan, I am contributing to the SciFlex project, which seeks to provide Database as a Service for the long-tail of science. The main conduit for deployment of SciFlex results is SQLShare. Another area of work in scientific data management focused on forest canopy research, in collaboration with Judy Cushing at The Evergreen State College. Declarative Programming: I participate in the resurgence of Datalog, mainly through collaborating on temporal and spatial extensions for distributed systems with Joe Hellersteins BOOM group. Portland State was a participant in the Intel Science and Technology Center for Big Data · The Three Cs of Big Data Applications · Toward a Common Programming Model for Big Data · ISTCBig Data Slides for tutorial on Dataspaces (with Alon Halevy) from VLDB 2008 · Day 1 · Day 2 Ph.D., Electrical Engineering and Computer Science, Princeton University, 1978 My Vita Publication List: My list of publications from Michael Ley's DBLP bibliography server at University of Trier, Germany. Last I checked, I have 405 co-authors. Citation list at Google Scholar. Co-author graph at Microsoft Research (requires Silverlight). My Advice to Mid-Career Researchers: Deciding What Not to Do. Check out: Datalog: Concepts, History and Outlook, David Maier, Tunkay Tekle, Michael Kifer, David S. Warren The best paper I never published. Online scanned version of The Theory of Relational Databases. Winning CIDR Jeopardy (January 2007), Jim Gray, scorekeeper. [Photo courtesy of Hamid Pirahesh] Fun Stuff Last updated 30 June 2025",
  "content_length": 5567,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:35"
}