{
  "name": "David A. Smith",
  "homepage": "http://www.ccs.neu.edu/home/dasmith",
  "status": "success",
  "content": "David A. Smith David A. Smith Associate Professor, Khoury College of Computer Sciences, Northeastern University 440 Huntington Avenue West Village H, Room 356 Boston, MA 02115 Phone: (617) 373-8526 dasmithATSIGNccs.neu.edu Office hours: by appointment With colleagues in CS, Social Sciences, and Humanities, I am a founding member of the NULab for Texts, Maps, and Networks, Northeastern's research center for the digital humanities and computational social sciences. My research focus is on natural language processing and computational linguistics, with applications to machine translation, information retrieval, the social sciences, and humanities. Recent news: The Mellon Foundation has funded the University of Illinois, Washington University in St. Louis, and Northeastern University to study the spread of news about racial terror and anti-Black violence. The Mellon Foundation funded Northeastern to craft a research agenda for historical and multilingual OCR in the humanities. Read our final report, with recommendations for computer science and humanities researchers, libraries, and funders. This led to follow-up work on Arabic-script OCR funded by the Mellon and NEH. The Institute for Museum and Library Sciences and funding agencies in five other countries have granted $1.2M to our new Oceanic Exchanges project to track news and ideas across countries and languages. Our NEH-funded Viral Texts project on viral networks in 19th-century newspapers was featured in Wired. Our work analyzing text reuse in bills in the US Congress was featured in the Economist. Until August 2012, I was a Research Assistant Professor in the Department of Computer Science at the University of Massachusetts, Amherst. Formerly: Natural Language Processing at Johns Hopkins University; and Head Programmer, Perseus Project, Tufts University See also my curriculum vitae in PDF. Graduate Students Ryan Muther, Shijia Liu, Si Wu, and Caroline Craig. Alumni Liwen Hou (postdoc, Harvard) Rui Dong (Amazon) Ansel MacLaughlin (Amazon) Shaobin Xu (Google) Kriste Krstovski (Data Science Institute and Business School, Columbia University) Jason Naradowsky (postdoc, UCL & Cambridge) Teaching Spring 2021, Spring and Fall 2020: Natural Language Processing (CS6120) Fall 2019–2023, Spring 2021: Information Retrieval (CS6200/IS4200) Fall 2017: Special Topics in AI: Text Modeing for the Humanities and Social Sciences (CS7180): Tu 11:45–1:25, Th 2:50–4:30 Spring 2016–2017: Natural Language Processing (CS6120) Fall 2012-2015: Information Retrieval (CS6200) Spring 2013-2015: Natural Language Processing (CS6120) Spring 2012: Search Engines (CS 446) Fall 2011: Residential Academic Program First-Year Seminar (CS 191a) Fall 2009: Introduction to Natural Language Processing (CS 585) Spring 2009: James Allan, R. Manmatha, and I led a seminar on Mining Text and Images in Digital Libraries Using Grid Computing. August 2006: Charles Schafer and I presented a tutorial, Overview of Statistical Machine Translation [pdf], at the Association for Machine Translation in the Americas. Fall 2005: Noah Smith and I designed and taught a course on Empirical Research Methods in Computer Science. Book Ryan Cordell, David A. Smith, Abby Mullen, and Jonathan D. Fitzgerald. Going the Rounds: Virality in Nineteenth-Century Newspapers. University of Minnesota Press, forthcoming 2022, print and open-access e-book and online. Refereed Conference & Journal Publications Jacob Murel and David A. Smith. Retrieving and analyzing translations of American newspaper comics with visual evidence. In Workshop on coMics ANalysis, Processing and Understanding (MANPU), 2024. Danlu Chen, Jacob Murel, Taimoor Shahid, Xiang Zhang, Jonathan Parkes Allen, Taylor Berg-Kirkpatrick, , and David A. Smith. MONSTERMASH: Multidirectional, overlapping, nested, spiral text extraction for recognition models of Arabic-script handwriting. In International Workshop on Computational Paleography, 2024. [ PDF ] Jaydeep Borkar and David A. Smith. Mind the gap: Analyzing lacunae with transformer-based transcription. In International Workshop on Computational Paleography, 2024. Jacob Murel and David A. Smith. Active learning with relevance feedback for handwriting detection in historical print. In Proceedings of the International Conference on Document Analysis and Recognition (ICDAR), 2024. Liwen Hou and David A. Smith. Detecting syntactic change with pre-trained transformer models. In Findings of EMNLP, 2023. [ PDF ] David A. Smith, Jacob Murel, Jonathan Parkes Allen, and Matthew Thomas Miller. Automatic collation for diversifying corpora: Commonly copied texts as distant supervision for handwritten text recognition. In Computational Humanities Research Conference (CHR), 2023. [ PDF ] Ryan Muther, Mathew Barber, and David A. Smith. Querying the past: Automatic source attribution with language models. In Computational Humanities Research Conference (CHR), 2023. [ PDF ] Caroline Craig, Kartik Goyal, Gregory R. Crane, Farnoosh Shamsian, and David A. Smith. Testing the limits of neural sentence alignment models on classical Greek and Latin texts and translations. In Computational Humanities Research Conference (CHR), 2023. [ PDF ] Ryan Muther and David A. Smith. Citations as queries: Source attribution using language models as rerankers. In SIGIR Workshop on Retrieval-Enhanced Machine Learning (REML), 2023. [ PDF ] Si Wu and David A. Smith. Composition and deformance: Measuring imageability with a text-to-image model. In Proceedings of the Workshop on Narrative Understanding, 2023. [ PDF ] Giulia Taurino and David A. Smith. Machine learning as an archival science: Narratives behind artificial intelligence, cultural data, and archival remediation. In NeurIPS Workshop on AI Cultures, 2022. [ PDF ] Ryan Muther, David A. Smith, and Sarah Bowen Savant. From networks to named entities and back again: Exploring classical Arabic isnad networks. Journal of Historical Network Research, 2022. [ PDF ] Ansel MacLaughlin, Shaobin Xu, and David A. Smith. Recovering lexically and semantically reused texts. In Proceedings of the Joint Conference on Lexical and Computational Semantics (*SEM), 2021. [ PDF ] Alejandro Toselli, Si Wu, and David A. Smith. Digital editions as distant supervision for layout analysis of printed books. In Proceedings of the International Conference on Document Analysis and Recognition (ICDAR), 2021. [ PDF ] Helen O'Neill, Anne Welsh, David A. Smith, Glenn Roe, and Melissa Terras. Text mining Mill: Computationally detecting influence in the writings of John Stuart Mill from library records. Digital Scholarship in the Humanities, 2021. Rui Dong and David A. Smith. Structural encoding and pre-training matter: Adapting BERT for table-based fact verification. In Proceedings of the Conference of the European Chapter of the Association for Computational Linguistics (EACL), 2021. [ PDF ] Ansel MacLaughlin and David A. Smith. Content-based models of quotation. In Proceedings of the Conference of the European Chapter of the Association for Computational Linguistics (EACL), 2021. [ PDF ] Liwen Hou and David A. Smith. Drivers of English syntactic change in the Canadian Parliament. In Proceedings of the Society for Computation in Linguistics (SCiL), 2021. [ PDF ] Liwen Hou and David A. Smith. Emerging English transitives over the last two centuries. In Proceedings of the Society for Computation in Linguistics (SCiL), 2021. [ PDF ] Ansel MacLaughlin, John Wihbey, Aleszu Bajak, and David A. Smith. Source attribution: Recovering the press releases behind science health news. In Proceedings of the International AAAI Conference on Web and Social Media (ICWSM), 2020. [ PDF ] Maha Alkhairy, Afshan Jafri, and David A. Smith. Finite state machine pattern-root Arabic morphological generator, analyzer and diacritizer. In Proceedings of the Language Resources and Evaluation Conference (LREC), 2020. Shijia Liu and David A. Smith. Detecting de minimis code-switching in historical German books. In Proceedings of the International Conference on Computational Linguistics (COLING), 2020. [ PDF ] Rui Dong, David A. Smith, Shiran Dudy, and Steven Bedrick. Noisy neural language modeling for typing prediction in BCI communication. In Proceedings of the Workshop on Speech and Language Processing for Assistive Technologies (SLPAT), pages 44–51, 2019. [ PDF ] Rui Dong and David A. Smith. Multi-input attention for unsupervised OCR correction. In Proceedings of the Association for Computational Linguistics, 2018. [ PDF ] Ansel MacLaughlin, John Wihbey, and David A. Smith. Predicting news coverage of scientific articles. In Proceedings of the International AAAI Conference on Web and Social Media (ICWSM), 2018. [ PDF ] Shiran Dudy, Steven Bedrick, Shaobin Xu, and David A. Smith. A multi-context character prediction model for a brain-computer interface. In Proceedings of the Workshop on Subword and Character Level Models in NLP (SCLeM), 2018. [ PDF ] Shaobin Xu and David A. Smith. Contrastive training for models of information cascades. In Proceedings of the AAAI Conference on Artificial Intelligence, 2018. [ PDF ] Liwen Hou and David A. Smith. Modeling the decline in English passivization. In Proceedings of the Society for Computation in Linguistics (SCiL), 2018. [ PDF ] Shaobin Xu and David A. Smith. Retrieving and combining repeated passages to improve OCR. In Proceedings of the ACM+IEEE-CS Joint Conference on Digital Libraries (JCDL), 2017. Kriste Krstovski and David A. Smith. Online multilingual topic models with multi-level hyperpriors. In Proceedings of the Conference on Human Language Technology of the North American Chapter of the Association for Computational Linguistics (HLT-NAACL), 2016. [ PDF ] Kriste Krstovski and David A. Smith. Bootstrapping translation detection and sentence extraction from comparable corpora. In Proceedings of the Conference on Human Language Technology of the North American Chapter of the Association for Computational Linguistics (H",
  "content_length": 28209,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:31"
}