{
  "name": "Davide Bresolin",
  "homepage": "https://www.math.unipd.it/~bresolin",
  "status": "success",
  "content": "Davide Bresolin homepage Davide Bresolin Dipartimento di Matematica Università di Padova Via Trieste, 63 35121 Padova, ITALY Write Me! \"Considerate la vostra semenza: fatti non foste a viver come bruti, ma per seguir virtute e canoscenza\" Dante Alighieri Divina commedia Inferno, canto XXVI Research interests and activities I'm Assistant Professor in Computer Science at the Department of Mathematics of the University of Padova. My research interests are in the areas of Cyber-Physical Systems, hybrid automata, finite automata, temporal representation and reasoning, spatial and temporal logics. My Curriculum Vitae (PDF) [English] [Italiano] Publications (Not so) Recent Talks Research groups OVERLAY research group on Formal Methods for AI Ariadne: A C++ library for formal verification of cyber-physical systems My (scientific) genealogy \"We are like dwarfs sitting on the shoulders of giants. Our glance can thus take in more things and reach farther than theirs. It is not because our sight is sharper nor our height greater than theirs; it is that we are carried and elevated by the high stature of the giants.\" Bernard of Chartres My Complete Mathematics Genealogy Tree, made with Geneagrapher with data from the Mathematics Genealogy Project Badges Teaching4Learning@Unipd New Faculty The holder of this Badge has attended the training program on teaching innovation designed for academic staff starting a career at the University of Padova. bestr.it Teaching (in Italian, for students) Ricevimento studenti: Lunedì 16:30 - 18:30, oppure su appuntamento. Stanza 320, III piano, scala C di Torre Archimede. A.A. 2018/2019: Automi e Linguaggi Formali Algoritmi Avanzati Altre Conoscenze Utili e Tirocini Personal Pages A view of Beauty... My pictures on Flickr! My photograpic Blog (in Italian) This page was last updated on April 9, 2019",
  "content_length": 1849,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:19"
}