{
  "name": "David J. Porfirio",
  "homepage": "https://dporfirio.github.io",
  "status": "success",
  "content": "David Porfirio, Ph.D. About Me My research intersects robotics, human-computer interaction, and artificial intelligence. I develop and evaluate innovative user interfaces that enable seamless human-robot task communication, ultimately empowering non-experts to create personalized robotic applications. I am now an Assistant Professor in the Computer Science Department at George Mason University. I am looking for Ph.D. students! You can find my CV here. News 8.25 Joined GMU as an Assistant Professor! 8.25 My co-author Vincent Hsiao will present our work on Bootstrapping Human-Like Planning via LLMs at RO-MAN 2025. 8.25 🏆 Won the NRC/ASEE Postdoctoral Research Publications Award for Goal-Oriented End-User Programming of Robots. 3.25 🏆 Won best HRI short contribution for An Interaction Specification Language for Human-Robot Interaction. 3.25 Invited talk at the HRI 2025 workshop on The Road to Reliable Robots: Interpretable, Accessible, and Reproducible HRI Research. 12.24 Guest lecture for CMSC 722 at the University of Maryland, College Park. 11.24 2nd AAAI Fall Symposium on Unifying Representations for Robot Application Development. 8.24 Completed my postdoc and began a full position at the U.S. Naval Research Laboratory. 4.24 Invited talk at Johns Hopkins University LCSR seminar. 3.24 Full paper talk at HRI 2024: Goal-Oriented End-User Development of Robots. Projects Human-Like LLM Planning RO-MAN 2025 paper Evaluates the ability of four different LLMs to produce human-like plans. Uncertainty Expression AAMAS 2025 paper Three different interfaces for eliciting probability distributions from users. POLARIS HRI 2024 paper Robot end-user programming with assistance from AI planning. INTERACTION SPECIFICATION LANGUAGE UR-RAD 2023 symposium website RO-MAN 2023 paper AAAI Spring Symposium 2023 paper Standardizing robot application development via a common, intermediate representation. TABULA HRI 2023 paper, video, code Facilitating on-the-fly robot application development through a combination of sketching and spoken language. CROWDSOURCING TASK TRACES HRI 2023 LBR paper, video, code+data+study Collecting examples of step-by-step tasks through an easy-to-use crowdsourcing interface. FIGARO CHI 2021 paper, video, code A tabletop programming-by-demonstration interface for HRI. Play out what you want the robot to do with figurines, and Figaro will assemble an executable program. TRANSFORMING ROBOT PROGRAMS CHI 2020 paper, video, code Auto-adapting robot programs based on user interaction. The robot stores interaction traces for each user and incrementally learns repairs. SYNTHÉ UIST 2019 paper, video, code Grab a partner and bodystorm a human-robot social interaction. Synthé records and assembles a fully executable program to run on a robot. ROVER 🏆 UIST 2018 (Best Paper) paper, video, code A classic human-robot interaction visual programming environment with a twist—RoVer verifies your program against a set of social norms. This page is modified version of minimal-jekyll (MIT licence). Link icons are from Super Tiny Icons (MIT license).",
  "content_length": 3083,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:15"
}