{
  "name": "David Garlan",
  "homepage": "https://www.cs.cmu.edu/~garlan",
  "status": "success",
  "content": "David Garlan David Garlan Associate Dean for Masters Programs in the School of Computer Science Professor of Computer Science Institute for Software Research School of Computer Science Carnegie Mellon University For mailing purposes: ISR - TCS Hall 430 4665 Forbes Avenue Pittsburgh, PA 15213 office:  TCS Hall  420 phone: 412.268.5056 fax:  412.268.3455 email:  garlan - at - cs.cmu.edu Administrative Assistant: Linda Campbell <lv2c  at  cs.cmu.edu> Home ¦ Projects ¦ Publications ¦ Academics ¦ External Activities David Garlan is a Professor in the School of Computer Science at Carnegie Mellon University. His research interests include: software architecture self-adaptive systems formal methods cyber-physical systems Dr. Garlan is a member of the Institute for Software Research and Computer Science Department in the School of Computer Science. David Garlan is a Professor of Computer Science in the School of Computer Science at Carnegie Mellon University.  He received his Ph.D. from Carnegie Mellon in 1987 and worked as a software architect in industry between 1987 and 1990.  His research interests include software architecture, self-adaptive systems, formal methods, and cyber-physical systems.  He is recognized as one of the founders of the field of software architecture, and, in particular, formal representation and analysis of architectural designs. He is a co-author of two books on software architecture: \"Software Architecture: Perspectives on an Emerging Discipline\", and \"Documenting Software Architecture: Views and Beyond.\" In 2005 he received a Stevens Award Citation for fundamental contributions to the development and understanding of software architecture as a discipline in software engineering. In 2011 he received the Outstanding Research award from ACM SIGSOFT for significant and lasting software engineering research contributions through the development and promotion of software architecture.  In 2016 he received the Allen Newell Award for Research Excellence. In 2017 he received the IEEE TCSE Distinguished Education Award and also the Nancy Mead Award for Excellence in Software Engineering Education He is a Fellow of the IEEE and ACM. Curriculum Vitae Google Scholar ORCID",
  "content_length": 2226,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:04"
}