{
  "name": "David B. Skillicorn",
  "homepage": "http://www.cs.queensu.ca/~skill",
  "status": "success",
  "content": "Skillicorn Faculty Profile Prof. David Skillicorn I work in the School of Computing Queen's University Kingston. Ontario Canada. I am also an Adjunct Professor in the Mathematics and Computer Science Department of the Royal Military College. Adversarial Analytics Our motto: \"Finding the traces of bad people and bad things in large datasets\" Adversarial analytics applied to terrorism, cybersecurity, crime, fraud, money laudering, terrorist financing, human trafficking, and a growing list of other areas, focusing on linguistic and relational data (text and graphs). Also human behaviour modelling and its overlap with social robotics. My blog on adversarial analytics Tips on Adversarial Analytics RIP Ralph Stanton, 1923-2010, my Ph.D. supervisor, details here. Some deep thoughts. \"Next year the number of [US] federally mandated categories of illness and injury for which hospitals may claim reimbursement will rise from 18,000 to 140,000. There are nine codes relating to injuries caused by parrots, and three relating to burns from flaming water-skis\" Economist, Feb 18th 2012. We haven't the money, so we've got to think -- Ernest Rutherford. Latent structure is master of visible structure -- Heraclitus c500 B.C, evidently the father of data analytics. The Feynman Problem Solving Algorithm: 1) Write down the problem. 2) Think very hard. 3) Write down the solution. (In my experience, in North America Step 2 tends to be skipped. In Australia, curiously, it's often Step 3.) Highlights My book Cyberspace, Data Analytics, and Policing is now available. It is aimed at both law enforcement and researchers interested in adversarial data analytics. My book Cybersecurity for Everyone is now available,. It is a non-technical introduction to cybersecurity designed to be accessible to anyone. My book \"Social Networks with Rich Edge Semantics\", with Quan Zheng, is available. My book, Understanding High-Dimensional Spaces has been published by Springer. (Print, Online) I was awarded the 2009 IEEE Intelligent Transportation Systems Society and IEEE Systems, Man and Cybernetics Society Technical Committee on Homeland Security Technical Achievement Award for outstanding and sustained technical contributions to the field of Intelligence and Security Informatics. My book: Knowledge Discovery for Counterterrorism and Law Enforcement is available from Taylor and Francis and Amazon Research My research is focused on adversarial knowledge discovery, building inductive models from data in settings where the interests of modellers and those being modelled are not aligned. This includes counterterrorism, law enforcement,and fraud; but also increasingly areas such as customer relationship modelling. I work with some TLAs and even some FLAs. Although the datasets I work with tend to be intricate rather than large, some of what I do could be called \"Big Data analytics\". Publications Online publications: Papers. Papers up to 2005 Papers (pre 2000) on BSP design and performance, Parallel programming models, Hypermedia and applications, and Parallelism and structured text Research Activities I am on the Steering Committee of the IEEE International Conference on Intelligence and Security Informatics, 2007-- . I am on the Steering Committee of the SIAM International Conference on Data Mining, 2007-- . I am on the Program Committees of all of the usual data mining conferences and workshops, and also those related to security informatics. I am an Associate Editor or on the Editorial Board of IEEE Intelligent Systems, IEEE Transactions on Computational Social Systems, Computational Intelligence, Journal of Universal Computer Science, Computational and Mathematical Organizational Theory, and Springer Security Informatics. Graduate Supervision I supervise theses in topics in adversarial knowledge discovery, focusing on textual data and graph/relational data. I work with colleagues in Politics (radicalization, borders, political speech), Business (financial fraud), and Psychology (deception) so there are possibilities in interdisciplinary research in these directions as well. My funding levels do not allow me to supervise international students unless they have funding from their own countries; this applies to summer students, graduate students, and postdocs. I am happy to consider students applying via CALDO or the Saudi Bureau. My current graduate students: Ben Lee Henry van Herk Sachin Velloor Sivasubramanian Hunter Orr Tindur Sigurdarson Isra Arjumandi Mosab AlFaqeeh Thomas Wan Some of my recent graduate students: Richard Branch Benjemin Simons Hunter Orr David Nam Lukasz Lapczyk Hannah Leblanc Nasser AlSadhan Paul Allison (Winner: Distinguished Thesis Award) Reena Shaw Muthalaly Quan Zheng Nasser Alsadhan Carolyn Lamb Scott Grant Pradeep Kondi Chandrasekaran Reg Sawilla Mike Bourassa Mohammad Hussain Geoff Morton Jim Provost Amin Fani Marvasti Tracy Jenkin Hanady Abdulsalam Samar Abou-Gouda Smita Gupta James Dutrisac Ayron Little Research Resources Mind mapping, a nice way to organise material when you don't already know how it fits together. It's useful for preparing drafts of theses and papers. Talking about your research. Teaching and Learning In 2022 I am teaching: CISC251 (Fall) Introduction to Analytics (for the certificate) This course is about half students taking it as an elective, and half taking it as the first course of the data analytics certificate. About a third of the students are from the sciences, about a third from engineering, and a third from commerce. CISC447/CISC866 Cybersecurity A course from the security focus for undergrads, and a core course in the NSERC CREATE cybersecurity program for grads. A grad course in cybersecurity, data analytics and policing, in the Fall term (an option in the NSERC CREATE cybersecurity program and an application token). I also supervise students in CISC499. Here is some material on effective learning: Effective Learning Techniques Playing with Internal Space Study Hacks I am interested in hypermedia-based education. Other Things My Academic Genealogy Here are some of the interesting pathways via doctoral supervisors (there's more than one because some people had two supervisors; for example, Brauer was supervised by both Schur and Schmidt, and Dirichlet was supervised jointly by Poisson and Fourier, who were both students of Lagrange): Skillicorn - Stanton - Brauer - Schur - Frobenius - Weierstrass - Guderman - Gauss Skillicorn - Stanton - Brauer - Schmidt - Hilbert - Lindemann - Klein - Lipschitz - Dirichlet - Poisson/Fourier - Lagrange - Euler - Bernoulli Erdos number 3: Skillicorn - Seberry - Szekeres - Erdos Up to School of Computing Up to Queen's University David Skillicorn School of Computing Queen's University Kingston Ontario Canada K7L 3N6 Time zone: GMT -5 Phone: +1 613 533 6065 Fax: +1 613 533 6513 skill cs queensu ca (you know the punctuation) Other phones (text/SMS preferred): Australia (when I'm there): 0450 147 251 (+61 450 147 251) Worldwide: +372 54 370 940 (expensive for both of us) x",
  "content_length": 7047,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:39"
}