{
  "name": "David F. Gleich",
  "homepage": "https://www.cs.purdue.edu/homes/dgleich",
  "status": "success",
  "content": "David Gleich David Gleich David F. Gleich Professor and University Faculty Scholar Computer Science Mathematics (Courtesy) Purdue University My research is on high performance and large scale computations with a focus on enabling previously infeasible analysis of data from biology, social networks, and scientific simulations. I find stating and studying these problems as large scale matrix computations productive. I received an NSF CAREER award to discover how to scale matrix methods to the enormous sizes of modern data with only modest computational resources. Prior to joining Purdue, I was the John von Neumann post-doctoral fellow at Sandia National Labs. News highlights from the last 5-ish years. 2025-10-20 Thanks to Aydin for helping to organize the Workshop on Network Algorithms, Analysis, and Learning for Science, which will be a lot of fun! 2023-12-01 We have a paper published in Nature Machine Intelligence on topological analysis of neural networks, read about it in IEEE Spectrum or Purdue News Recent Interests Higher-order methods for analyzing data Algorithmic Anti-differentiation Network diffusions including PageRank, heat kernels Spectral graph theory High performance computers Large scale data computations Community detection and clustering Matrix-based network computations About a decade ago, I wrote an article for ACM's XRDS magazine on some of the issues that arise in my research. It's a nice overview of issues I'm looking at and problems I'm studying. David F. Gleich, Expanders, tropical semi-rings, and nuclear norms: oh my! XRDS: Crossroads, The ACM Magazine for Students - Scientific Computing, Spring 2013, Volume 19, Issue 3, Pages 32-36, http://dx.doi.org/10.1145/2425676.2425688 Email dgleich--at--purdue.edu Everyone gets a lot of email, myself included. If I haven't replied in a week, please do resend it. (But wait a week!) If it's urgent, give me a call! Or contact me on Bluesky-@dgleich or Mastadon-@dgleich. Classes Fall 2025 CS515 - Matrix Computations Prior classes Spring 2025 CS520 - Computational Methods in Optimization Fall 2024 CS515 - Matrix Computations Fall 2023 CS515 - Matrix Computations Spring 2023, CS520 - Computational Methods in Optimization Fall 2022 CS515 - Matrix Computations Fall 2021, CS515 - Matrix Computations The online, virtual edition! Spring 2021 CS514 - Numerical analysis The online, virtual edition! Fall 2020, CS515 - Matrix Computations The online, virtual edition! Spring 2020, CS520 - Computational Methods in Optimization Fall 2019, CS515 - Matrix Computations Spring 2019, CS520 - Computational Methods in Optimization Fall 2018, CS515 - Matrix Computations Fall 2017, CS515 - Matrix Computations Spring 2017, CS520 - Computational Methods in Optimization Fall 2016, CS314 - Numerical Methods Spring 2016, CS 514 - Numerical analysis Fall 2015, CS515 - Matrix Computations Fall 2015, CS 515 - Matrix Computations Spring 2014, CS314 - Numerical Methods Spring 2014, CS520 - Computational Methods in Optimization Spring 2013, CS520 - Computational Methods in Optimization Fall 2012, CS515 - Matrix Computations Spring 2012, Computational Methods in Optimization Fall 2011, Network and Matrix Computations Recent student co-authors Here's a list of students I've worked with recently where we have a paper or submission together, so the list includes more than students I directly advise. Please ask to be included if you don't see yourself listed! Charles Colley Yufan Huang Liu Meng Disha Shur Omar Eldaghar Past student co-authors (Probably many links are out of date! Check Internet Archive.) Austin Benson Nicole Eikmeier Yangyang Hou Biaobin Jiang Kyle Kloster Shahin Mohammadi Huda Nassar Bryan Rainey Ayan Sinha Varun Vasudevan Nate Veldt Joyce Whang Tao Wu Yao Zhu David Gleich Contact CV Publications Videos of presentations Blog Codes Matlab BGL Older stuff Colophon Social sites David Gleich @ YouTube David Gleich @ github David Gleich @ Mastodon Older social sites Old Blog @ Wordpress David Gleich @ Twitter Old Presentations @ SlideShare Copyright © David F. Gleich 2011-2017 This site was created with Poole static site generator",
  "content_length": 4141,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:59"
}