{
  "name": "David K.Y. Chiu",
  "homepage": "http://www.cis.uoguelph.ca/~dchiu",
  "status": "success",
  "content": "Pattern Learning Research Group - Home Home Research & Students Publications Contact Me Professor of Computing and Information Science Professor of Biophysics Interdepartmental Group David K. Y. Chiu received the M.Sc. degree in Computing and Information Science from Queen's University and the Ph.D. degree in Systems Design Engineering  from  University of Waterloo in Canada. Currently he is a full professor in the Department of Computing and Information Science and a Graduate Faculty in the Biophysics Interdepartmental Group in the University of Guelph, Ontario, Canada. Before joining the University of Guelph, he has done consulting work with  NCR Canada Ltd.  and VIRTEC Vision, Intelligence, Robotics Technology Canada Ltd. on unconstrained character recognition. He was associated with the PAMI Laboratory and an adjunct professor in Systems Design Engineering in the University of Waterloo. He was a recipient of the Science and Technology Agency (STA) Fellowship of Japan and a visiting researcher to  Electrotechnical Laboratory (currently National Institute of Advanced Industrial Science and Technology) in 1992. He was  awarded the United Nation Development Program (UNDP) Fund to give lectures in Beijing and Guangzhou in 1992. He was a visiting professor to University of Montreal in 1995, Hong Kong University of Science and Technology in 1999, University of Sao Paulo in 2001 and Hong Kong Polytechnic University in 2002. He is currently involved in the Editorial Board of Open Information Systems Journal, Canadian Journal of Pure and Applied Sciences. He was a member of the National Network of Excellence, Advanced Foods and Materials Network of Canada. He has involved in the program committees of many international conferences, including AI'2003, FLAIRS Uncertain Reasoning Track, 2002, 2003, International Conference on Computing & Information, International Conference on Computer Vision, Pattern Recognition and Image Processing (CVPRIP'2002), International Conference on Computational Biology and Genome Informatics (CBGI'2000, CBGI'2001, CBGI'2003), global technical committee of Third International DCDCIS Conference of Engineering Applications and Computer Algorithms (DCDIS'2003). He was one of the keynote speakers of InBio Brazilian Conference on Artificial Intelligence and Bioinformatics in 2001. In addition, he has served as reviewer to international journals of Pattern Recognition, Pattern Recognition Letters, International Journal of Fuzzy Systems, Asia-Pacific Engineering Journal, Computer Applications to the Biosciences (currently the Bioinformatics Journal), IEEE Transactions on Knowledge and Data Engineering, IEEE Transactions on Systems, Man and Cybernetics, Journal of Information Science and International Conference on Neural Information Processing. Recently, he participates in the reviewing of a special issue on bioinformatics in Information Sciences Journal and a guest co-editor to Biomolecular Engineering.. His research interests are in the general area of pattern analysis (including neural networks), knowledge discovery and their applications to image analysis, spatial and image databases, medical diagnosis and bioinformatics. One of his papers on inferring the secondary and tertiary structure of small RNAs [Chiu and Kolodziejczak 1991] was selected in Current Opinion in Structural Biology, (1992, 2:338-344) as \"outstanding interest and an important advance\". Currently the work has been extended to inferring tertiary structures and functionality of proteins. Another paper, [Chan, Wong and Chiu, 1989], was selected by the editors of IEEE Expert as one of four most relevant papers in the 5th International Conference on Artificial Intelligence Applications, 1989 [IEEE Expert, Summer, 1989, pg.78]. In addition to structure prediction, his published works in bioinformatics also include multiple sequence alignment, systems biology, transgenic animal analysis, genome comparisons and taxonomy analysis.",
  "content_length": 3979,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:28"
}