{
  "name": "David Hogg 0001",
  "homepage": "https://eps.leeds.ac.uk/computing/staff/84/professor-david-hogg",
  "status": "success",
  "content": "Professor David Hogg | School of Computer Science | University of Leeds Skip to main content University links Search Destination Faculty of Engineering and Physical Sciences site All leeds.ac.uk sites School of Computer Science Search Faculty of Engineering and Physical Sciences School of Computer Science People Profile Professor David Hogg Position: Professor of Artificial Intelligence Areas of expertise: computer vision; machine learning Email: D.C.Hogg@leeds.ac.uk Location: 2.21B Bragg Building Website: dblp computer science bibliography | Googlescholar | Researchgate | ORCID Profile David Hogg is Professor of Artificial Intelligence at the University of Leeds. He is internationally recognized for his work on computer vision, particularly in the areas of video analysis and activity recognition. He works extensively across disciplinary boundaries, applying AI in engineering design, biology, medicine and environmental sciences. He has been a visiting professor at the MIT Media Lab, Pro-Vice-Chancellor for Research and Innovation at the University of Leeds (2011-2016), Chair of the ICT Strategic Advisory Team at the Engineering and Physical Sciences Research Council (EPSRC) in the UK, Chair of an international review panel for Robotics and Artificial Intelligence commissioned by EPSRC (2017), a Turing Fellow, and Co-Director of the National Pathology Imaging Co-operative. Until 2018, he was Chair of the Academic Advisory Group of the Worldwide Universities Network (WUN), helping to promote collaborative research between over 20 prominent research-intensive universities from around the globe. He is Director of the UKRI Centre for Doctoral Training in AI for Medical Diagnosis and Care. David is a Fellow of the European Association for Artificial Intelligence (EurAI), a Distinguished Fellow of the British Machine Vision Association, and a Fellow of the International Association for Pattern Recognition. Responsibilities Director of UKRI Centre for Doctoral Training in AI for Medical Diagnosis and Care Research interests David pioneered the use of three-dimensional geometric models for tracking flexible structures (e.g. the human body) in natural scenes, and contributed to establishing statistical approaches to learning of shape and motion as one of the pre-eminent paradigms in the field. Current research is on representation and learning of activities from video, specifically models of interaction, and applications of machine learning in science and engineering. Part of this work is exploring the integration of vision within a broader cognitive framework that includes audition, language, action, and reasoning. Selected recent publications and project pages Talking Head from Speech Audio using a Pre-trained Image Generator Deep learning of Parkinson's movement from video, without human-defined measures Mapping the extent of giant Antarctic icebergs with deep learning 3D shape reconstruction of semi-transparent worms Self-supervised 3d human pose estimation from a single image Mapping Antarctic crevasses and their evolution with deep learning applied to satellite radar imagery Online perceptual learning and natural language acquisition for autonomous robots Advancing spatial reasoning in large language models: An in-depth evaluation and enhancement using the stepgame benchmark Understanding the robustness of skeleton-based action recognition under adversarial attack Unsupervised human activity analysis for intelligent mobile robots Selected recent projects Nowcasting with Artificial Intelligence for African Rainfall: NAIAR (2024-2027) Advanced Crystal Shape Descriptors for Precision Particulate Design, Characterisation and Processing (Shape4PPD) (2021-2024) Forecasting volcanic activity using deep learning (DEEPVOLC) (2020-2026) Towards intelligent engineering design systems (2019-2022) Knowledge Transfer Partnership with Vet-AI (2020-2022) Current PhD students Caitlin Howarth Claire Bartholomew Mikael Down Fangjun Li Eilish O’Grady Chen Jiang Arpita Saggar Project pages for some earlier research A short talk on AI in the Public Sector Qualifications BSc Applied Mathematics, Warwick, 1975 MSc Computer Science, Western Ontario, 1976 DPhil, Sussex, 1984 Professional memberships British Machine Vision Association (BMVA) The Society for the Study of Artificial Intelligence and the Simulation of Behaviour (AISB) International Association of Pattern Recognition (IAPR) Research groups and institutes Artificial Intelligence Current postgraduate researchers Sam Llanwarne Abrar Mohammed Jose Sosa Jiangbei Yue Arpita Saggar Aradhya Khandeparker <h4>Postgraduate research opportunities</h4> <p>We welcome enquiries from motivated and qualified applicants from all around the world who are interested in PhD study. Our <a href=\"https://phd.leeds.ac.uk\">research opportunities</a> allow you to search for projects and scholarships.</p> Research outputs Loading... My five most recent selected research outputs My other selected research outputs Journal articles Conference papers Presentation (conference/workshop etc) Books Chapters Conference abstracts Preprints Reports Internet publications Performances Compositions Exhibitions Posters Artefacts Designs Patents Scholarly editions Software / code Thesis / dissertations Others Datasets Media Working papers Back to top",
  "content_length": 5339,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:09"
}