{
  "name": "Davide Taibi 0001",
  "homepage": "https://www.tuni.fi/en/davide-taibi",
  "status": "success",
  "content": "Davide Taibi | Tampere universitiesDavide TaibiVisitor, ResearchFaculty of Information Technology and Communication Sciences | Computing SciencesTampere Universitydavide.taibi [at] tuni.fi (davide[dot]taibi[at]tuni[dot]fi)Websiteshttp://www.taibi.itAbout meI am Associate Professor (tenure-track) in the TASE (Tampere Software Engineering group) of the Tampere University where I am leading the Cloud and WEb Engineering Group (CLoWeE) . My research is mainly focused on Empirical Software Engineering applied to cloud-native systems. I am working on the identification and reduction of Technical debt, especially in the case of migration from monolithic to cloud-native applications. I am investigating processes, and techniques for developing Cloud Native applications, identifying cloud-native specific patterns and anti-patterns. Moreover, I am supporting local companies to keep their software maintenance under control, by applying continuous quality monitoring techniques and by supporting them in spotting DevOps antipatterns. I am a member of the International Software Engineering Network (ISERN) from 2018. Before moving to Finland, I have been Assistant Professor at the Free University of Bozen · Bolzano (2015-2017), post-doctoral research fellow at the Technical University of Kaiserslautern and Fraunhofer Institute for Experimental Software Engineering - IESE (2013-2014) and research fellow at the University of Insubria (2007-2011), where I also received my Ph.D. in Computer Science and graduated cum laude. More information can be found on my personal website http://www.taibi.it or on the CloWEe p ortal http://research.tuni.fi/clowee/ Research topicsCloud and Web Engineering Migration to cloud-native technologies Serverless Microservice Micro-Frontends Software Quality and Technical Debt Software Metrics",
  "content_length": 1830,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:24"
}