{
  "name": "Davide Scaramuzza 0001",
  "homepage": "http://rpg.ifi.uzh.ch",
  "status": "success",
  "content": "Robotics and Perception Group Department of Informatics News People Research Publications Software/Datasets Open Positions Student Projects Teaching Media Coverage Awards Gallery Contact Robotics and Perception Group Welcome to the website of the Robotics and Perception Group led by Prof. Davide Scaramuzza. Our lab was founded in February 2012 and is part of the Department of Informatics, at the University of Zurich, and the Department of Neuroinformatics, which is a joint institute of both the University of Zurich and ETH Zurich. Our mission is to research the fundamental challenges of robotics and computer vision that will benefit all of humanity. Our key interest is to develop autonomous machines that can navigate all by themselves using only onboard cameras and computation, without relying on external infrastructure, such as GPS or position tracking systems, nor off-board computing. Our interests encompass predonimantly micro drones because they are more challenging and offer more research opportunities than ground robots. News November 17, 2025 New Visiting Student We welcome Haiqing Hao as a new visiting student! October 30, 2025 Prof. D. Scaramuzza Keynote at Swiss Robotics Day 2025, November 13 at 11:15hrs From Drone Racing to Space: Pushing the Limits of Vision-Based AI. In this keynote, Prof. Davide Scaramuzza shares the research behind the famous Nature paper and the first AI-driven drone to beat a human world champion. Drawing on years at the crossroads of robotics, computer vision, and machine learning, he outlines what fast, vision-based autonomy means for drone racing, disaster response, and even planetary exploration. Info October 30, 2025 The Reality Gap in Robotics: Challenges, Solutions, and Best Practices Bridging the reality gap between simulation and the real world is a central challenge in robotics, limiting the transfer of learned behaviors to physical systems. Our recent Annual Review of Control, Robotics, and Autonomous Systems paper provides a comprehensive overview of the problem by analyzing its causes in dynamics, perception, actuation, and system design, and reviewing recent advances that aim to close the gap. Methods such as system identification, domain randomization, and real-to-sim co-training have enabled robust sim-to-real transfer in locomotion, manipulation, and agile flight. The work also introduces evaluation metrics and open research directions toward scalable, high-fidelity simulation and reliable real-world deployment. For more details, check out our paper in collaboration with NVIDIA. October 27, 2025 Nikola Zubić selected as NeurIPS 2025 Top Reviewer Congratulations to Nikola Zubić for being selected as a Top Reviewer for NeurIPS 2025! This recognition comes with a complimentary registration to the conference in acknowledgment of his outstanding contributions to the NeurIPS review process. October 2, 2025 What Matters in RL-Based Methods for Object-Goal Navigation? An Empirical Study and A Unified Framework In this work, we conduct a large-scale empirical study of modular RL-based ObjectNav systems, decomposing them into three key components: perception, policy, and test-time enhancement. Through extensive controlled experiments, we isolate the contribution of each and uncover clear trends: perception quality and test-time strategies are decisive drivers of performance, whereas policy improvements with current methods yield only marginal gains. Building on these insights, we propose practical design guidelines and demonstrate an enhanced modular system that surpasses State-of-the-Art (SotA) methods by 6.6% on SPL and by a 2.7% success rate. For more details, check out our collboration work with CVG and RSL at ETH and Princeton University. September 29, 2025 Prof. Davide Scaramuzza Keynote at AI+X Summit, October 2 at 18:00hrs Can an autonomous drone outperform the worlds best human pilot? In this keynote, Prof. Davide Scaramuzza shares the groundbreaking research that made global headlines and led to a landmark Nature publication: the first AI-powered drone to defeat a human world champion. Drawing from years of work at the intersection of robotics, computer vision, and machine learning, he offers insights into the future of fast, vision-based autonomy from drone racing to disaster response and planetary exploration. Info September 22, 2025 Sight Over Site: Perception-Aware Reinforcement Learning for Efficient Robotic Inspection In this work, we revisit the robotic inspection problem from a perception-aware perspective. We propose an end-to-end reinforcement learning framework that explicitly incorporates target visibility as the primary objective, enabling the robot to find the shortest trajectory that guarantees visual contact with the target without relying on a map. Through extensive experiments, we show that our method outperforms existing classical and learningbased navigation approaches, yielding more efficient inspection trajectories in both simulated and real-world settings. For more details, check out our collboration work with CVG and RSL at ETH. September 5, 2025 PA-MPPI: Perception-Aware Model Predictive Path Integral Control for Quadrotor Navigation in Unknown Environments Quadrotor navigation in unknown environments is challenging due to non-convex free space, quadrotor-specific dynamics, and the need to explore unseen regions. Model Predictive Path Integral (MPPI) methods address the first two challenges by leveraging sampling-based optimization, but they struggle in unknown environments. We propose Perception-Aware MPPI (PA-MPPI), which adapts trajectories online using perception costs to encourage exploration when the goal is occluded. This expands the mapped traversable space, increasing the likelihood of finding alternative paths. Hardware experiments show that PA-MPPI, running at 50 Hz, outperforms baseline MPPI by up to 100% in challenging settings and serves as a robust policy for navigation foundation models. For more details, check out our paper. September 1, 2025 New PhD Student and Postdoc We welcome Victoria Catalan Pastor as a new PhD student and Yunfan Ren as a new Postdoc! August 31, 2025 HDVIO2.0: Wind and Disturbance Estimation with Hybrid Dynamics VIO (T-RO 2025) We present HDVIO2.0, an hybrid-dynamics Visual-Inertial Odometry (VIO) system that models full 6-DoF, translational and rotational, vehicle dynamics and tightly incorporates them into VIO. HDVIO2.0 proposes a hybrid dynamics quadrotor model that combines a point-mass vehicle model with a learning-based component, with access to control commands and IMU history, to capture complex aerodynamic effects. HDVIO2.0 leverages the divergence between the actual motion and the predicted motion from the hybrid dynamics model to estimate external forces as well as the robot state. Our system surpasses the performance of state-of-the-art methods in experiments using public and new drone dynamics datasets, as well as real-world flights in winds up to 25 km/h. For more details, check out paper, code and paper! August 28, 2025 Learning on the Fly: Rapid Policy Adaptation via Differentiable Simulation We propose a novel online adaptive learning framework that unifies residual dynamics learning with realtime policy adaptation inside a differentiable simulation. Starting from a simple dynamics model, our framework refines the model continuously with real-world data to capture unmodeled effects and disturbances such as payload changes and wind. All components of our system are designed for rapid adaptation, enabling the policy to adjust to unseen disturbances within 5 seconds of training. We validate the approach on agile quadrotor control under various disturbances in both simulation and the real world. Our framework reduces hovering error by up to 81% compared to L1-MPC and 55% compared to DATT, while also demonstrating robustness in vision-based control without explicit state estimation. For more details, checkout our paper. August 26, 2025 Learning Real-World Acrobatic Flight from Human Preferences Preference-based reinforcement learning (PbRL) enables agents to learn control policies without requiring manually designed reward functions, making it well-suited for tasks where objectives are difficult to formalize or inherently subjective. Acrobatic flight poses a particularly challenging problem due to its complex dynamics, rapid movements, and the importance of precise execution. In this work, we explore the use of PbRL for agile drone control, focusing on the execution of dynamic maneuvers such as powerloops. Building on Preference-based Proximal Policy Optimization (Preference PPO), we propose Reward Ensemble under Confidence (REC), an extension to the reward learning objective that improves preference modeling and learning stability. We train policies in simulation and successfully transfer them to real-world drones, demonstrating multiple acrobatic maneuvers where human preferences emphasize stylistic qualities of motion. For more details, check out our paper. July 23, 2025 Low-Latency Event-Based Velocimetry for Quadrotor Control in a Narrow Pipe Autonomous quadrotor flight in confined spaces such as pipes and tunnels presents significant challenges due to unsteady, self-induced aerodynamic disturbances. In this work, we present the first closed-loop control system for quadrotors for hovering in narrow pipes that leverages real-time flow field measurements. We develop a low-latency, event-based smoke velocimetry method that estimates local airflow at high temporal resolution and use this to improve the control performance. For more details and flow visualizations, check out our latest paper and video. June 25, 2025 LiDAR Registration with Visual Foundation Models (RSS 2025 Paper) In this work, we present a robust LiDAR registration method using DINOv2 features extracted from surround-view images as point descriptors. Unlike traditional handcrafted or learned descriptors, this approa",
  "content_length": 96378,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:23"
}