{
  "name": "David Klappholz",
  "homepage": "http://web.stevens.edu/facultyprofile/?id=826",
  "status": "success",
  "content": "Aaron Klappholz | Stevens Institute of TechnologySkip to ContentAaron KlappholzAssociate ProfessorCharles V. Schaefer, Jr. School of Engineering and ScienceDepartment of Computer ScienceGateway Center N423(201) 216-5509(201) 216-8249[email protected]WebsiteEducationPhD (1974) University of Pennsylvania (Computer and Information Science) BS (1966) MIT (Mathematics & Linguistics) Research-Computer Science education- Diversification of the CS undergraduate populationInstitutional ServiceCSCC MemberCS Curriculum Committee MemberCS Curriculum Committee MemberCS Curriculum Committee MemberCS Curriculum Committee MemberCS Curriculum Committee MemberUndergraduate advising MemberCS Dept. minor advisor (only advisor) ChairPreparation for ABET Visit MemberCSNYC 2015 to 2021 Stevens representative MemberProfessional ServiceIEEE Member Steering Committee Conference on Software Engineering Education and TrainingIEEE Member of program committee Conference on Software Engineering Education and TrainingMember of Steering Committee: Conference on Software Engineering and Training member of steering committeeReview of applications for scholarships to minorities and underrepresented groups reviewerMember of Program Committee: Conference on Software Engineering Education and Training member of program committeeCS NYC Fair committee Stevens representative to CS NYC FairCSEE&T steering committee memberCSEE&T Program Committee Member of Program CommitteeInnovation and EntrepreneurshipA number of projects that I supervise in CS Senior Design are entrepreneurial projects.Professional SocietiesACM SIGCSE – Association for Computing Machinery, Special Interest Group on CS Education MemberSelected PublicationsConference ProceedingKlappholz, A.. Teaching High Level Abstraction Using Directed Active Learning — Conference Tutorial p98 David Klappholz, Stevens Institute of Technology. no. The Journal of Computing Sciences in Colleges Papers of the 31st Annual CCSC South Central Conference (pp. 98-99). CoursesCS423CS424CS561CS574",
  "content_length": 2031,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:24"
}