{
  "name": "David D. Jensen",
  "homepage": "https://people.cs.umass.edu/~jensen",
  "status": "success",
  "content": "David Jensen – Professor University of Massachusetts Amherst Search Google Appliance Enter the terms you wish to search for. Links to common UMass Amherst services and features College of Information and Computer Sciences Go.UMass Email SPIRE Moodle Blackboard Learn UDrive People Finder I am a faculty member in the College of Information and Computer Sciences at the University of Massachusetts Amherst.  I direct the Knowledge Discovery Laboratory, which I founded in 2000.  From 2018 to 2022, I served a term as Director of the Computational Social Science Institute, an interdisciplinary effort at UMass to study social phenomena using computational tools and concepts.  From 1991 to 1995, I served as an analyst with the Office of Technology Assessment, an agency of the United States Congress.  I received my doctoral degree from Washington University in St. Louis in 1992. My research focuses on machine learning and causal modeling. I am particularly interested in analyzing large social, technological, and computational systems, with the goals of furthering prediction, explanation, security, and policy decisions.  My research is supported by many organizations, including the National Science Foundation, the Defense Advanced Research Projects Agency, and industrial collaborators. I regularly serve on program committees for several conferences, including the Conference on Neural Information Processing Systems, the International Conference on Machine Learning, the Conference on Uncertainty in Artificial Intelligence, and the ACM SIGKDD Conference on Knowledge Discovery and Data Mining.  I currently serve as an action editor for the Journal of Machine Learning Research. I have also served on the Board of Directors of the ACM Special Interest Group on Knowledge Discovery and Data Mining (2005-2013), the Defense Science Study Group (2006-2007), and DARPA’s Information Science and Technology Group (2007-2012). I currently serve on the Computing Community Consortium (CCC) Council, the research visioning arm of the Computing Research Association.  I received outstanding teaching awards from the UMass College of Natural Sciences in 2011 and from the College of Information and Computer Sciences in 2022.  In 2017, one of my papers received the IEEE INFOCOM Test of Time Paper Award. Recent News I participated in the first Community Chat sponsored by the Computing Community Consortium to discuss our recent white paper on “Envisioning Possibles Futures for AI Research” released in July. The Computing Community Consortium released a white paper that I coauthored with a fantastic set of colleagues on Envisioning Possible Futures for AI Research.",
  "content_length": 2671,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:50"
}