{
  "name": "David C. Parkes",
  "homepage": "http://www.eecs.harvard.edu/~parkes",
  "status": "success",
  "content": "David C. Parkes | David C. Parkes Skip to main content arrow_circle_down David C. Parkes David C. ParkesJohn A. Paulson Dean George F. Colony Professor of Computer ScienceResearch InterestsMulti-agent AI, Bounded rationality, Machine learning and decisions, Multi-agent reinforcement learning, Intelligence architectures, Fair machine learning, Game theory, Algorithmic economics, Auction design, Market design, Mechanism design, Preference elicitation. Office hours Fall 2025:  Thursdays, 4.45-5.30p. aking - at - seas.harvard.edu for a meeting time Teaching Applied Math 121 / Engineering Sciences 121CS 136: Economics and ComputationCS 181: Machine Learning CS 285: Multi-Agent SystemsCS290: PhD Grad Cohort Research Seminar At Harvard Economics and Computer Science Research GroupDigital, Data, and Design Institute at HBSHarvard Data Science InitiativeHarvard Business Analytics Program Contact Information Science and Engineering Complex150 Western Ave, 5.303Boston, MA 02134(617) 384-8130parkes@eecs.harvard.eduFaculty CoordinatorAnn Marie Kingaking@seas.harvard.edu Dean's Executive AssistantMichael Aubemaube@g.harvard.edu Recent News NeurIPS Paper appears as a Spotlight, 2025 November 23, 2025 PNAS paper on Deep mechanism design June 01, 2025 Masters of Data Science recognized May 01, 2025 Science paper on AI to help with democratic deliberation October 01, 2024 GemNet paper selected as the Exemplary AI Track Paper in ACM EC’24 July 01, 2024 Ph.D. Students Jeff Jiang Daniel Moroz Gary Qiurui Ma Gili Rusak Mark York Kehang Zhu Recent Publications Download 6 citations download BibTeX EndNote X3 XML EndNote 7 XML Endnote tagged Marc PubMedId RIS Working Paper Lewis Hammond, Alan Chan, Jesse Clifton, Jason Hoelscher-Obermaier, Akbir Khan, Euan McLean, Chandler Smith, Wolfram Barfuss, Jakob Foerster, Tomáš Gavenčiak, The Han, Edward Hughes, Vojtěch Kovařík, Jan Kulveit, Joel Leibo, Caspar Oesterheld, Christian de Witt, Nisarg Shah, Michael Wellman, Paolo Bova, Theodor Cimpeanu, Carson Ezell, Quentin Feuillade-Montixi, Matija Franklin, Esben Kran, Igor Krawczuk, Max Lamparth, Niklas Lauffer, Alexander Meinke, Sumeet Motwani, Anka Reuel, Vincent Conitzer, Michael Dennis, Iason Gabriel, Adam Gleave, Gillian Hadfield, Nika Haghtalab, Atoosa Kasirzadeh, Sébastien Krier, Kate Larson, Joel Lehman, David Parkes, Georgios Piliouras, and Iyad Rahwan. 2025. “Multi-Agent Risks from Advanced AI”. https://arxiv.org/abs/2502.14143. Lewis Hammond, Alan Chan, Jesse Clifton, Jason Hoelscher-Obermaier, Akbir Khan, Euan McLean, Chandler Smith, Wolfram Barfuss, Jakob Foerster, Tomáš Gavenčiak, The Han, Edward Hughes, Vojtěch Kovařík, Jan Kulveit, Joel Leibo, Caspar Oesterheld, Christian de Witt, Nisarg Shah, Michael Wellman, Paolo Bova, Theodor Cimpeanu, Carson Ezell, Quentin Feuillade-Montixi, Matija Franklin, Esben Kran, Igor Krawczuk, Max Lamparth, Niklas Lauffer, Alexander Meinke, Sumeet Motwani, Anka Reuel, Vincent Conitzer, Michael Dennis, Iason Gabriel, Adam Gleave, Gillian Hadfield, Nika Haghtalab, Atoosa Kasirzadeh, Sébastien Krier, Kate Larson, Joel Lehman, David Parkes, Georgios Piliouras, and Iyad Rahwan. 2025. “Multi-Agent Risks from Advanced AI”. https://arxiv.org/abs/2502.14143. description Publisher's Version description Publisher's Version David Huang, Francisco Marmolejo-Cossío, Edwin Lock, and David Parkes. 2025. “https://arxiv.org/abs/2501.14625\">Accelerated Preference Elicitation With LLM-Based Proxies”. doi:CoRR abs/2501.14625. David Huang, Francisco Marmolejo-Cossío, Edwin Lock, and David Parkes. 2025. “https://arxiv.org/abs/2501.14625\">Accelerated Preference Elicitation With LLM-Based Proxies”. doi:CoRR abs/2501.14625. description Publisher's Version description Publisher's Version Ermis Soumalias, Yanchen Jiang, Kehang Zhu, Michael Curry, Sven Seuken, and David Parkes. 2025. “https://arxiv.org/abs/2502.10308\">LLM-Powered Preference Elicitation in Combinatorial Assignment”. doi:CoRR abs/2502.10308. Ermis Soumalias, Yanchen Jiang, Kehang Zhu, Michael Curry, Sven Seuken, and David Parkes. 2025. “https://arxiv.org/abs/2502.10308\">LLM-Powered Preference Elicitation in Combinatorial Assignment”. doi:CoRR abs/2502.10308. description Publisher's Version description Publisher's Version Barton E. Lee, Daniel J. Moroz, and David C. Parkes. “An Analysis of Blockchain Governance via Political Economics”. 2021. Barton E. Lee, Daniel J. Moroz, and David C. Parkes. “An Analysis of Blockchain Governance via Political Economics”. 2021. Daniel J. Moroz, Daniel J. Aronoff, Neha Narula, and David C. Parkes. “Double-Spend Counterattacks: Threat of Retaliation in Proof-of-Work Systems”. CoRR Abs 2002.10736. Daniel J. Moroz, Daniel J. Aronoff, Neha Narula, and David C. Parkes. “Double-Spend Counterattacks: Threat of Retaliation in Proof-of-Work Systems”. CoRR Abs 2002.10736. 2025 Andrea Tacchetti, Raphael Koster, Jan Balaguer, Liu Leqi, Mîruna Pislar, Matthew Botvinick, Karl Tuyls, David Parkes, and Christopher Summerfield. 2025. “Deep Mechanism Design: Learning Social and Economic Policies for Human Benefit.”. Proceedings of the National Academy of Sciences of the United States of America, 122, 25, Pp. e2319949121. doi:10.1073/pnas.2319949121. Andrea Tacchetti, Raphael Koster, Jan Balaguer, Liu Leqi, Mîruna Pislar, Matthew Botvinick, Karl Tuyls, David Parkes, and Christopher Summerfield. 2025. “Deep Mechanism Design: Learning Social and Economic Policies for Human Benefit.”. Proceedings of the National Academy of Sciences of the United States of America, 122, 25, Pp. e2319949121. doi:10.1073/pnas.2319949121. add_circle_outline do_not_disturb_on Abstract Human society is coordinated by mechanisms that control how prices are agreed, taxes are set, and electoral votes are tallied. The design of robust and effective mechanisms for human benefit is a core problem in the social, economic, and political sciences. Here, we discuss the recent application of modern tools from AI research, including deep neural networks trained with reinforcement learning (RL), to create more desirable mechanisms for people. We review the application of machine learning to design effective auctions, learn optimal tax policies, and discover redistribution policies that win the popular vote among human users. We discuss the challenge of accurately modeling human preferences and the problem of aligning a mechanism to the wishes of a potentially diverse group. We highlight the importance of ensuring that research into \"deep mechanism design\" is conducted safely and ethically. More arrow_circle_right Postdocs Keyon Vafa",
  "content_length": 6580,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:45"
}