{
  "name": "David L. Wehlau",
  "homepage": "https://www.rmc-cmr.ca/en/mathematics-and-computer-science/dr-david-wehlau",
  "status": "success",
  "content": "Dr. David Wehlau Skip to main content Skip to \"About this site\" Dr. David Wehlau Dr. David Wehlau Professor Office: Girouard building, room 308 Telephone: (613) 541-6000 ext 6469 Fax: (613) 541-6584 E-mail: wehlau@rmc.ca Department of Mathematics and Computer Science College Address Royal Military College of CanadaPO Box 17000, Station ForcesKingston, Ontario, CANADAK7K 7B4 Research Interests Algebraic Groups Invariant Theory Representation of Quivers Galois Geometries Graph Theory My scientific interests: Equidimensionality, coregularity, and cofreeness of group representations; The Popov (or Russian) conjecture Constructive Invariant Theory The Dixmier conjecture for irreducible representations of SL(2,C) Invariants of Modular Representations of Finite Groups Caps and Maximal line free subsets of projective spaces Steiner triple systems and colouring problems Cook's Theorem and Non-Deterministic Computers I work with some very smart people. The ones I work with on a daily basis include Aiden Bruen, Eddy Campbell, Lucien Haddad, Ian Hughes and Jim Shank. Short Biography I completed my Bachelor's degree in Mathematics and Computer Science at Western University in 1983. I completed my Master's degree in 1984 at Brandeis University in Boston under the supervision of Dr. P. Monsky. I received my Ph.D. also from Brandeis in 1989 under the supervision of Dr. G. Schwarz on the topic of Invariant Theory of Algebraic Groups. I was an Assistant Professor of Mathematics at the University of Toronto during the period 1988-1992. In 1992 I joined the faculty at RMC and became a full professor in 1998. I have served terms as Associate Dean of Science and Head of the Department of Mathematics and Computer Science at RMC. I have been awarded the John Scott Cowan Prize for Research Excellence (2012) and the Class of 1965 Teaching Excellence Award (2002). I have supervised or co-supervised seven Ph.D. students, seventeen post-doctoral fellows, twenty-two Master's students and a large number of undergraduate students. During the years 1994-2000 I was coach of the RMC Badminton Team. A highlight was finishing the 98-99 season ranked 9th in the country. I live in downtown Kingston in a Victorian house with my wife, our daughter, and two cats. Current Academic Activities I am member of the Canadian Mathematical Society and the American Mathematical Society I was elected to the Board of Directors of the Canadian Mathematical Society in 1999 and held this position until June 2003. Positions: Professor of the Department of Mathematics and Computer Science, Royal Military College of Canada Professor (Cross-Appointment) of the Department of Mathematics and Statistics, Queen's University Home Page at Queen's Selected Publications Books: H.E.A. Campbell and D.L. Wehlau. Modular invariant theory Encyclopaedia of Mathematics series, Vol. 139, Springer-Verlag, 1st Edition., 2011, XIII, 233 p., ISBN: 978-3-642-17403-2 eBook: http://dx.doi.org/10.1007/978-3-642-17404-9 Aiden A. Bruen and David L. Wehlau. Editors Error Correcting Codes, Finite Geometries and Cryptography Contemporary Mathematics, 523 American Mathematical Society 2010, Providence RI, 244 pages, ISBN: 978–0–8218–4956–9. Articles: William Traves and David L. Wehlau. Ten points on a cubic curve (to appear Amer. Math. Monthly) I. Dimitrov, C. Paquette, D. Wehlau and T. Xu. Subregular J-Rings of Coxeter Systems Via Quiver Path Algebras J. Algebra (in press) H.E.A. Campbell, Aloysius Helminck, Hanspeter Kraft and David Wehlau, Editors Symmetry and Spaces. In Honor of Gerry Schwarz. Progress in Mathematics, 278, Birkh ̈auser Boston, Inc., Boston, MA, 2010. xx+207 pp. ISBN: 978-0-8176-4874-9. G. Schwarz and D. Wehlau. Invariants of four subspaces Ann. Inst. Fourier, 48 No. 3 (1998) 667–697. David L. Wehlau. Invariants for the Modular Cyclic Group of Prime Order via Classical Invariant Theory J. European Math. Soc., 15 No. 3, 2013, 775-803 DOI: 10.4171/JEMS/376. arXiv:0912.1107v2 [math.RA]. Jan Draisma, Gregor Kemper and David L. Wehlau. Polarization of Separating Invariants, Canad. J. Math. 60 (2008), No. 3, 556–571. D.L. Wehlau. Constructive invariant theory for tori Ann. Inst. Fourier, 43 No. 4 (1993) 1055–1066. Publications available on  Google Scholar Date modified: 2024-05-31",
  "content_length": 4284,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:26"
}