{
  "name": "David Cabrero Souto",
  "homepage": "https://pdi.udc.es/en/File/Pdi/MG5AF",
  "status": "success",
  "content": "David Cabrero Souto File. Department Computer Science and Information Technologies Knowledgment area Computational Science and Artificial Intelligence Research Research group Models and Applications of Distributed Systems Research lines Accesibilidad en sistemas de información. Sistemas Distribuidos. Verificación y Validación. Desarrollo de software. Paradigmas funcionales. Software libre. Procesamiento del lenguaje natural. Contacto UDC directory Orcid id0000-0002-9432-8343 ResearcherIDM-2237-2014 Scopus36099890000 Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Concurrency and Parallelism Degree in Computer Engineering Compulsory 0 30 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 12 Human Machine Interfaces Degree in Computer Engineering Compulsory 0 80 Master's Dissertation Master's in Computer Engineering Compulsory 0 5 Software Architecture Degree in Computer Engineering Master's in Computer Engineering Optional 0 84 Subject and involved studies Type Distance hours Total hours Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 12 Human Machine Interfaces Degree in Computer Engineering Compulsory 0 150 Software Architecture Degree in Computer Engineering Master's in Computer Engineering Optional 0 78 Subject and involved studies Type Distance hours Total hours Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 13.6666666666667 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 8 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 8 Human Machine Interfaces Degree in Computer Engineering Compulsory 0 137 Software Architecture Degree in Computer Engineering Master's in Computer Engineering Optional 0 63 Subject and involved studies Type Distance hours Total hours Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 4 Human Machine Interfaces Degree in Computer Engineering Compulsory 0 170 Software Architecture Degree in Computer Engineering Master's in Computer Engineering Optional 0 77 Subject and involved studies Type Distance hours Total hours Human Machine Interfaces Degree in Computer Engineering Compulsory 0 174 Software Architecture Degree in Computer Engineering Master's in Computer Engineering Master's in Computer Engineering Optional 0 84 Subject and involved studies Type Distance hours Total hours Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 8 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 8 Human Machine Interfaces Degree in Computer Engineering Compulsory 0 154 Software Architecture Degree in Computer Engineering Master's in Computer Engineering Optional 0 63 EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 2018/2019 2017/2018 2015/2016 Web application to support undergraduate enrollment decision-making at UDC Shared Kanban Board Web Application Web application for the evaluation of the teaching quality of the UDC teaching staff Comparative study of property-based testing tools for Python Fact-cheking web application to fight missinformation Single point of contact management system Tool for prescription management at elderly care centers Training system for puzzle solving Development of a document management application: React frontend and Git backed GraphQL backend Platform to manage regional rowing competitions Web application to manage projects, automate the creation of resources linked to each project and manage the credentials generated in the process Musician social web application Web application structured in rooms so groups of people can meet Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Patents, records and utility models Papers in research journals Complete books Book chapters Conference papers 2022 2016 2014 2013 2012 ... 2011 2010 2009 2005 2004 2003 2002 1999 No date Funding entity Digital Innovation Hub Industrial de Galicia (DIHGIGAL) Main researches Laura Milagros Castro Souto; José Luis Calvo Rolle Type Contrato Dates From 10/08/2022 to 10/06/2023 Funding entity Arce Clima Sistemas y Aplicaciones S.L. Main researches Laura Milagros Castro Souto y Jorge Novo Buján Type Contrato Dates From 01/03/2016 to 01/07/2016 Funding entity Qidel Formación y Servicios SL Main researches David Cabrero Souto Type Contrato Dates From 02/05/2016 to 02/05/2017 Funding entity CINFO CONTENIDOS INFORMATICIVOS PERSONALIZADOS S.L Type Contrato Dates From 01/01/2014 to 15/06/2014 Funding entity Consellería de Educación e Ordenación Universitaria Type Proyecto Programas Autonomicos Dates From 22/10/2014 to 30/10/2017 Funding entity INDRA SOFTWARE LABS S.L.U. Main researches Nieves Rodríguez Brisaboa e Laura M. Castro Souto Type Contrato Dates From 05/04/2013 to 31/12/2014 Funding entity CINFO CONTENIDOS INFORMATICIVOS PERSONALIZADOS S.L Type Contrato Dates From 31/10/2013 to 31/10/2014 Funding entity Casacom Solutions AG Type Contrato Dates From 01/06/2013 to 01/09/2013 Funding entity Casacom Solutions AG Type Contrato Dates From 01/06/2013 to 01/09/2013 Funding entity Xunta de Galicia Main researches Ricardo Cao Abad Type Proyecto Programas Autonomicos Dates From 01/01/2012 to 31/12/2013 Funding entity CINFO CONTENIDOS INFORMATICIVOS PERSONALIZADOS S.L Main researches David Cabrero Souto Type Contrato Dates From 16/04/2012 to 15/04/2014 Funding entity Union Europea Main researches Laura Milagros Castro Souto Type Proyecto UE Dates From 02/10/2012 to 01/11/2015 Funding entity CINFO CONTENIDOS INFORMATICIVOS PERSONALIZADOS S.L Main researches David Cabrero Souto Type Contrato Dates From 10/05/2012 to 11/05/2012 Funding entity CINFO CONTENIDOS INFORMATICIVOS PERSONALIZADOS S.L Type Contrato Dates From 30/11/2011 to 30/11/2012 Funding entity CINFO CONTENIDOS INFORMATICIVOS PERSONALIZADOS S.L Type Contrato Dates From 01/09/2011 to 31/12/2011 Funding entity Casacom Solutions AG Type Contrato Dates From 01/11/2011 to 31/01/2012 Funding entity Casacom Solutions AG Type Contrato Dates From 12/06/2011 to 12/09/2011 Funding entity CINFO CONTENIDOS INFORMATICIVOS PERSONALIZADOS S.L Type Contrato Dates From 01/01/2011 to 31/12/2011 Funding entity advanzis360, SLNE Type Contrato Dates From 10/01/2011 to 01/02/2011 Funding entity Ministerio de Economía y Competitividad (MINECO) Main researches David Cabrero Souto Type Proyecto Programas Nacionales Dates From 01/01/2011 to 31/12/2013 Funding entity Ministerio de Economía y Competitividad (MINECO) Main researches David Cabrero Souto Type Proyecto Otros Programas Dates From 01/07/2011 to 30/06/2013 Funding entity AYUNTAMIENTO DE A CORUÑA Main researches Carlos J. Escudero Cascón Type Contrato Dates From 14/04/2010 to 29/11/2010 Funding entity Ministerio de Industria, Turismo y Comercio Main researches Gulías Fernández, Víctor Manuel Type Proyecto Programas Nacionales Dates From 10/06/2010 to 31/12/2011 Funding entity Union Europea Main researches Laura M. Castro Souto Type Proyecto Internacional Dates From 01/01/2010 to 30/12/2012 Funding entity CONSELLERÍA DE ECONOMÍA E INDUSTRIA Type Proyecto Programas Autonomicos Dates From 04/12/2009 to 31/12/2011 Funding entity ALFA21 OUTSOURCING S.L. Type Contrato Dates From 01/10/2005 to 30/09/2006 Funding entity LAMBDASTREAM SERVICIOS INTERACTIVOS S.L. Type Contrato Dates From 01/10/2005 to 30/09/2006 Funding entity LAMBDASTREAM SERVICIOS INTERACTIVOS S.L. Type Contrato Dates From 01/10/2005 to 30/09/2006 Funding entity ALFA21 OUTSOURCING S.L. Type Contrato Dates From 01/10/2005 to 30/09/2006 Funding entity LAMBDASTREAM SERVICIOS INTERACTIVOS S.L. Type Contrato Dates From 01/10/2005 to 30/09/2006 Funding entity MINISTERIO DE EDUCACIÓN Y CIENCIA Main researches Víctor M. Gulías Fernández Type Proyecto Programas Nacionales Dates From 15/10/2005 to 14/10/2008 Funding entity Xunta de Galicia Main researches Miguel A. Alonso Pardo Type Proyecto Otros Programas Dates From 13/07/2005 to 12/07/2008 Funding entity Plan Nacional de I+D Main researches Miguel Ángel Alonso Pardo Type Proyecto Otros Programas Dates From 13/12/2004 to 13/12/2007 Funding entity Xunta de Galicia Main researches Víctor M. Gulías Fernández Type Proyecto Programas Autonomicos Dates From 15/07/2003 to 15/07/2006 Funding entity ACORDAR COMUNICACIÓN EN INTERNET,S .L. Type Contrato Dates From 30/10/2002 to 30/10/2003 Funding entity COLEGIO OFICIAL DE APAREJADORES Y ARQUITECTOS TÉCNICOS DE A CORUÑA Type Contrato Dates From 01/11/2002 to 01/03/2003 Funding entity Ministerio de Ciencia y Tecnología Main researches Víctor M. Gulías Fernández Type Proyecto Programas Nacionales Dates From 05/11/2002 to 05/11/2005 Funding entity Universidade da Coruña (UDC) Main researches Miguel Ángel Alonso Pardo Type Proyecto Otros Programas Dates From 17/07/2002 to 17/07/2003 Type Proyecto Otros Programas Dates From 06/05/2002 to 06/05/2004 Funding entity Secretaria Xeral de Investigación e Desenvolvemento Tecnolóxico Type Proyecto Otros Programas Dates From 25/08/1999 to 25/08/2002 Type Proyecto Otros Programas 2007 Type Software Registrado Entity Universidade da Coruña (UDC) Authors Víctor Manuel Gulias Fernández, David Cabrero Souto, Ángel Vales Vázquez, Alberto Areces Gayo Application date 05/12/2007 Approval date 05/12/2007 2013 2007 2005 2003 2002 ... 2001 1996 Authors Macías López, Laura M. Castro, David Cabrero Journal LECTURE NOTES IN COMPUTER SCIENCE Vol. 8112 (pages 527 to 535) Authors José Luis Freire Nistal, José Enrique Freire Brañas, A",
  "content_length": 16595,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:48"
}