{
  "name": "David Gregg",
  "homepage": "https://www.scss.tcd.ie/David.Gregg",
  "status": "success",
  "content": "TCD CS David Gregg [Computer Science Department], [Trinity College Dublin] [Personnel] David Gregg Job Title: Professor Qualifications: MSc, Dr. techn., FTCD Research Areas: Software performance optimization, embedded systems Courses: CS2014/5 Systems Programming, CS3014 Concurrent Systems I Location: O'Reilly Institute G41 Phone: (+353 1 896) 3693 e-mail: david.gregg@cs.tcd.ie Postal Address: Prof. David Gregg, School of Computer Science and Statistics, Trinity College Dublin, Dublin 2, Ireland. About Me I'm a professor in Computer Science at Trinity College Dublin. My current research deals with low-resource techniques for deep neural networks, compilers, algorithms, and software optimization for multicore and vector computers. My Research interests Accelerating deep neural networks on embedded systems Program analysis Computer arithmetic Compiler optimization Processor microarchitecture Low energy embedded systems Virtual machines for implementing high-level languages Multi-core parallelism Instruction level parallelism Vector parallelism Domain Specific Languages Field programmable gate arrays (FPGAs) Experimental algorithmics Professional Activities PACT 2020 Programme Committee ISC-HPC 2020 AI/ML track Programme Committee Fastpath 2019 Programme Committee EDLA 2019 Programme Committee ISC-HPC 2019 AI/ML track Programme Committee Steering Committee, Workshop on Compilers for Parallel Computing, 2018- CPC 2018 Workshop, Workshop Chair PACT 2018 Programme Committee PACT 2017 Programme Committee CC 2017 Programme Committee ICOOOLPS 2017 Programme Committee HiPEAC Autumn 2016 Computing Systems Week organizer ACM TACO 2016 Board of Distinguished Reviewers PPPJ 2016 Programme Committee ICOOLPS 2016 Programme Committee ACM TACO 2015 Board of Distinguished Reviewers PPPJ 2015 Programme Committee VEE 2015 Programme Committee CC 2015 Programme Committee ACM TACO 2014 Board of Distinguished Reviewers PPPJ 2014 Programme Committee ACM TACO 2013 Board of Distinguished Reviewers PLDI 2013 External Review Committee Selection committee for SIGPLAN 2011 Outstanding Doctoral Dissertation Award PPPJ 2012 Programme Committee VEE 2012 Programme Committee PLDI 2011 Programme Committee CGO 2011 Programme Committee CC 2011 Programme Committee HiPEAC 2011 Programme Committee PACT 2010 Programme Committee SAC 2010 Emb. Sys. Track Programme Committee PACT 2009 Programme Committee COCV 2009 Programme Committee PLDI 2009 External Review Committee PLDI 2009 Local Arrangements Chair ASPLOS 2009 Programmme Committee WCSA 2008 Programme Committee VEE 2008 General Chair CC 2008 Programmme Committee PPPJ 2007 Programmme Committee PPPJ 2006 Programmme Committee VEE 2005, 2006, 2007 Steering Committee IVME 2004 Programme Committee SCOPES 2004 Programme Committee EI Proof of Concept Funding Panel, Spring 2003-Summer 2004 IVME 2003 General Chair Euroforth 2003 Programme Committee SCOPES 2003 Programme Committee Euroforth 2002 Programme Committee Postdocs Dr Andrew Anderson Dr Syed Asad Alam Graduate Research Students Kaveena Persand (PhD) Zain Uddin (MSc) Previous Research Students With current affiliation where known. Barbara Barabasz, PhD.      (Intel-Movidius) James Garland, PhD.      (IT Carlow) Shixiong Xu, PhD.      (Cadence) Mark Purcell, MSc.      (IBM Research) Aravind Vasudevan, PhD      (Synopsys) Martin Marinov, PhD      (SIG) Andrew Anderson, PhD      (Intel-Movidius) Servesh Muralidharan, PhD (CERN) Robert Crosbie, PhD      (Amazon) Peter Lavin, PhD      (TCD) Jason McCandless, PhD      (Google) R. Scott Manley, PhD.      (Cray) Paul Biggar, PhD.        (Founder of CircleCI) Kevin Williams, PhD.      (The Now Factory) Nicholas Nash, PhD.      (SIG) Yunhe Shi, PhD. Colm McSweeney, MSc.      (Synopsys) Owen Callanan, PhD.      (Dell Cloud Computing R&D Centre) Daniel Clarke, MSc.      (Irdeto) Andrew Beatty, MSc.      (Galway-Mayo IT) Richard Bannister, MSc.   (Amazon) Kevin Casey, PhD.      (NUI Maynooth) Brian Davis, MSc.      (NUI Galway) University Duties Global Director for Computer Science, 2020-. Junior Academic Progressions Committee, 2015-2018. School administrative duties Head, Discipline of Software and Systems, 2018-. SCSS Strategic Planning Group, 2015-2016. Head, Discipline of Software Systems, 2014-2018. MSc in Computer Science Course Review Committee, 2014-2015. Course Director, Structured PhD Programme, 2011-. School Research Studentships Coordinator, 2011-. Computer Science Programme Course Committee, 2011-. Structured PhD Programme Review Committee 2011. PhD exam chair 2008-. Coordinator of Research Methods programme for Postgraduate Research Students (with Prof. Remenyi) 2007. Representative of the junior academic staff on the Executive Commitee of the School of Computer Science and Statistics, 2005-2007. Department of Computer Science PhD Workshop 2003-2006. New PhD students' introductary event 2004-2006. Coordinator of the \"20/20 Vision Group\" on the long-term future of the School of Computer Science and Statistics 2005-2006. Publications An auto-generated list of my publications can be found from here. You can also check out my DBLP page. Software The triNNity Library of optimized routines to implement convolutional neural networks on CPUs. The library includes more than 70 implementations of DNN convolution. The triNNity Optimizer, which selects optimal data layouts and choice of convolution routines for the layers of convolutional neural networks. The triNNity Compiler, a domain-specific program generator that emits efficient code to implement convolutional neural networks using the triNNity Library and the triNNity Optimizer. Useful Links The SquirrelFish JavaScript engine is a very nice example of the use of some of our research on interpreters in practical applications. I am a member of the European Network of Excellence on High Performance and Embedded Architecture and Compilation (HiPEAC). I am a member of Lero - The Irish Software Engineering Research Centre [Personnel] [Computer Science] [Trinity College Dublin] URL: http://www.cs.tcd.ie/David.Gregg/ David.Gregg at cs.tcd.ie",
  "content_length": 6099,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:07"
}