{
  "name": "Davide Mottin",
  "homepage": "https://mott.in",
  "status": "success",
  "content": "Davide Mottin Home Publications Courses Projects Service News I am an Associate Professor at the Department of Computer Science at Aarhus University. My research focuses on graph exploration, which lays on the broad areas of database, data mining, and machine learning. In particular, I enjoy working and understanding graphs with or without labels interactively, understanding phenomena and users in a principled way. My knowledge, my passion, my dedication comes also from the students I am (co-)supervising: Ama Bembua Bainson - Aarhus University - Co-supervision with Panos Karras (2023-2026, expected) Cheng Huang - Aarhus University - Co-supervision with Ira Assent (2023-2026, expected) Maximilian Egger - Aarhus University - Co-supervision with Panos Karras (2022-2026, expected) Kasper Overgaard Mortensen - Aarhus University - Co-supervision with Panos Karras (2023-2026, expected) Konstantinos Skitsas - Aarhus University - Co-supervision with Panos Karras (2022-2025, expected) Atefeh Moradan - Aarhus University - Co-supervision with Ira Assent (2020-2024, expected) Past students: Judith Franziska Hermanns - Aarhus University - Co-supervision with Panos Karras (2019-2022) Anton Tsitsulin - University of Bonn - Mentorship with Emmanuel Müller (2015-2021, now at Google) News! Currently I have no open position, but I am always looking for motivated and hard-working PhD students or Postdocs to join - email me your CV and your interest in the graph analytics area to join the group! If you are interested in internships, please look here. Previosly, I was a Research Associate at the Center for Geoscience (GFZ) in Potsdam and a Postdoctoral Researcher at the Hasso Plattner Institute, in the group of Knowledge Discovery and Data Mining working with Emmanuel Müller. I got a PhD in Computer Science at the dbTrento group in the University of Trento under the supervision of Themis Palpanas and Yannis Velegrakis. During my PhD, I visited Yahoo! Labs, Barcelona and Microsoft Research Asia, Beijing. The increasing interest in social networks, knowledge graphs, protein-interaction, and many other types of networks has raised the question how users can explore such large and complex graph structures easily. In this regard, graph exploration has emerged as a complementary toolbox for graph management, graph mining, or graph visualization in which the user is a first class citizen. Graph exploration combines and expands database, data mining, and machine learning approaches with the user eye on one side and the system perspective on the other. Search engines are continuously employing advanced techniques that aim to capture user intentions and provide results that go beyond the data that simply satisfy the query conditions. Examples include the personalized results, related searches, similarity search, popular and relaxed queries. In this work we introduce a novel query paradigm that considers a user query as an example of the data in which the user is interested. We call these queries Â«exemplar queriesÂ», and claim that they can play an important role in dealing with the information deluge. We provide a formal specification of the semantics of such queries and show that they are fundamentally different from notions like queries by example, approximate and related queries. Graphs elegantly model a plethora of phenomena, from social interactions, to biological and chemical processes. Without any prior information comparing two graphs can only be done through notion of similarity. However, designing the right similarity for a certain task is a convolotued process which requires domain expertise and graph expertise. We propose self-learned similarity measures which scale to large graphs and are automatically harvested from the graph itself. Such measures can outperform traditional measures in different tasks, such as predicting future connections among users, understanding the effect of drugs, and detecting malicious users. AUFF   GAI - Graph Alignment Algorithms for Next Generation Computing Hardware (IPUs) (2023-2026) Danish Fund for Independent Research   KARE - Robust Exploratory search in large knowledge graphs (2022-2025) Eurostars Eureka   AAVanguard - a new artificial intelligence platform for the creation of next-generation AAV capsids (2021-2024) Toga Networks / Huawei   NEBULA - Elastic similarity search in graph-empowered video sequences (2021-2023) View more posts © 2023 Davide Mottin . Powered by Hugo",
  "content_length": 4473,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:21"
}