{
  "name": "David Broman",
  "homepage": "https://www.kth.se/profile/dbro",
  "status": "success",
  "content": "KTH | David Broman Skip to main content David BromanProfessorKungliga Tekniska Högskolanhttps://www.kth.se/profile/dbroDetailsWorks for Division of Software and Computer SystemsTelephone +46 8 790 42 74Unit address Lindstedtsvägen 30E-mail dbro@kth.seResearcherResearcher IDORCID IDGoogle Scholar IDAbout me(See my webpage:http://people.kth.se/~dbro/ for more details)David Broman is a Professor at the Department of Computer Science, KTH Royal Institute of Technology in Sweden. He is the Head of Division for the Division of Software and Computer Systems (SCS) at KTH, and an Associate Director Faculty for Digital Futures. He received his Ph.D. in Computer Science in 2010 from Linköping University, Sweden. Between 2012 and 2014, he was a Visiting Scholar at the University of California, Berkeley, where he also was employed as a part-time researcher until 2016. Between 2023 and 2024, he was a Visiting Professor for a year at the Computer Science Department, Stanford University. His research focuses on the intersection of (i) programming languages and compilers, (ii) real-time and cyber-physical systems, and (iii) probabilistic machine learning. David has received the Best ETAPS paper award on on programming languages and systems (the EAPLS Award, co-authored 2023), a Distinguished Artifact Award at ESOP (co-authored 2022), an outstanding paper award at RTAS (co-authored 2018), a best paper award in the journal Software & Systems Modeling (SoSyM award 2018), the award as teacher of the year, selected by the student union at KTH (2017), the best paper award at IoTDI (co-authored 2017), and awarded the Swedish Foundation for Strategic Research's individual grant for future research leaders (2016). He has worked several years within the software industry, co-founded companies, co-founded the EOOLT workshop series, and is a member of IFIP WG 2.4, EMSOFT Steering Committee, Modelica Association, a senior member of IEEE, and a former board member of Forskning och Framsteg.CoursesCompilers and Execution Environments (FID3006), examinerCompilers and Execution Environments (ID2202), examiner, teacher, course responsibleDegree Project in Computer Engineering, First Cycle (II142X), examinerDegree Project in Computer Science and Engineering, specialising in Communication Systems, Second Cycle (DA246X), examinerDegree Project in Computer Science and Engineering, specialising in Embedded Systems, Second Cycle (DA248X), examinerDegree Project in Computer Science and Engineering, specialising in ICT Innovation, Second Cycle (DA258X), examinerDegree Project in Computer Science and Engineering, specialising in ICT Innovation, Second Cycle (DA256X), examinerDegree Project in Computer Science and Engineering, specializing in Machine Learning, Second Cycle (DA233X), examinerDegree Project in Computer Science and Engineering, specializing in Software Engineering for Distributed Systems, Second Cycle (DA240X), examinerDegree Project in Electrical Engineering, specialising in Embedded Systems, Second Cycle (EA248X), examinerDegree Project in Electrical Engineering, specialising in ICT Innovation, Second Cycle (EA258X), examinerDegree Project in Electrical Engineering, specialising in ICT Innovation, Second Cycle (EA256X), examinerDegree Project in Electrical Engineering, specializing in Communication Systems, Second Cycle (EA246X), examinerDegree Project in Electronics and Computer Engineering, First Cycle (IL142X), examinerDegree Project in Information and Communication Technology, First Cycle (IA150X), examinerDegree Project in Information and Communication Technology, First Cycle (II143X), examinerDegree Project in Information and Communication Technology, Second Cycle (IA250X), examinerInteractive Theorem Proving with Dependent Types (FID3217), examinerTypes, Semantics, and Programming Languages (FIK3620), course responsible, examinerPublicationsPublication listLinksDavid's Webpage",
  "content_length": 3927,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:42"
}