{
  "name": "David Starobinski",
  "homepage": "http://people.bu.edu/staro",
  "status": "success",
  "content": "David Starobinski (Public Home Page) David Starobinski Professor (Ph.D., Technion) Electrical and Computer Engineering Systems Engineering Computer Science Contact Information: 8 Saint Mary's Street, Room 431, Boston, MA 02215 (617) 353-0202 staro@bu.edu GitHub Repository Google Scholar Page I am also affiliated with the following groups and centers: Laboratory of Networking and Information Systems Center for Information and Systems Engineering (CISE) Hariri Institute of Computing Teaching 1. Wireless Networking and Security (EK 131/132) Spring 2009, Spring 2010, Spring 2011, Fall 2011, Spring 2013. An introductory module for Freshman. 2. Introduction to Logic Design(EC 311), Spring 2017. 3. Software Radios (EC 415), Spring 2019, Spring 2020, Spring 2021. 4. Introduction to Computer Networking (EC 441) Spring 2003, Fall 2003-2006, Fall 2008, Fall 2009, Fall 2012, Fall 2015, Fall 2016, Fall 2022, Fall 2024, Fall 2025. 5. Advanced Data Structures and Algorithms (EC 504) Fall 2010. 6. Cybersecurity (EC 521) Fall 2011, Fall 2013. Playlist of video tutorials. 7. Computer Communication Networks (EC 541) Spring 2004, Spring 2005, Spring 2009, Spring 2013, Spring 2014, Spring 2016, Spring 2018, Fall 2018, Fall 2019, Fall 2021, Spring 2023-2025. 8. IoT Security (EC 700) Fall 2017, Fall 2020, Spring 2024. 9. Randomized Network Algorithms (EC 741) Spring 2007, Spring 2010, Spring 2012. 10. Quality of Service Networking (EC 700) Spring 2002. Publications Short Biography Research Group Graduate students: Tasha Adler, Sevval Simsek. Alumni: Johannes Becker, Jonathan Chamberlain, Reuven Cohen, Niloofar Fazlollahi, Stefan Gvozdenovic, Anas Muhammad Imtiaz, Emir Kavurmacioglu, Sinem Kockan, Rajesh Krishnan, Kan Lin, Huseyin Mutlu, Cankut Orakcal, Saikat Ray, Wei Si, Eran Simhon, Angad Singh, Steven So, Aylin Turhan, Tao Wu, Weiyao Xiao, Liangxiao Xin, Avi Yaar. Current and Recent Research Projects Facilitating Novel Modalities for Spectrum Sharing between Earth-Observing Microwave Radiometers and Commercial Users (supported by the National Science Foundation). Improving Cyber Security Operations using Knowledge Graphs (supported by the Red Hat Collaboratory at Boston University). Building Resilience into Blockchains (supported by the National Science Foundation). Facilitating Spectrum Access by Noise Guessing (supported by the National Science Foundation). Toward a Science of Vehicular Epidemiology: Computing, Control, and Security (supported by the National Science Foundation). Automated Threat Modeling for Connected Vehicles (supported by Honda Research Institute Europe and Boston Hariri Institute of Computing). The Interplay of Markets and Security in 5G Shared Spectrum Services (supported by the National Science Foundation). Automotive Cyber Security Research (supported by OnBoard Security) Strategic Management of Advance Reservations in Cloud and Network Services (supported by the National Science Foundation). Strengthening Wi-Fi Network Wide (supported by the National Science Foundation). Unifying Data Synchronization (supported by the National Science Foundation). Synergistic Activities Technical Program Committee member of IEEE DySPAN 2024 Technical Program Committee member of VehicleSec 2023, 2024 Associate Editor of IEEE Open Journal of the Communications Society 2019-2022 Associate Editor of IEEE Transactions on Information Forensics and Security 2017-2019 Associate Editor of IEEE/ACM Transactions on Networking 2009-2014 Technical Program Committee member of ACM MobiHoc 2019, 2020 Technical Program Committee member of IEEE INFOCOM Smart Data Pricing Workshop 2014-2017 Technical Program Committee member of NetEcon 2017 Technical Program Committee Co-Chair of Fourth International Conference on Network Games, Control, and Optimization (NETGCOOP 2016) Technical Program Committee member of IEEE INFOCOM 2002-2003, 2005-2012 Technical Program Committee member of WiOpt 2006-2007, 2011-2014, 2019",
  "content_length": 3954,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:06"
}