{
  "name": "David Black-Schaffer",
  "homepage": "https://katalog.uu.se/profile/?id=N9-1278",
  "status": "success",
  "content": "David Black-Schaffer - Uppsala University David Black-Schaffer Professor at Department of Information Technology; Division of Computer Systems Telephone: +46 18 471 68 30Mobile phone: +46 76 824 20 17E-mail: david.black-schaffer@it.uu.seVisiting address: Hus 10, Regementsvägen 10Postal address: Box 337751 05 UPPSALA Download contact information for David Black-Schaffer at Department of Information Technology; Division of Computer Systems Academic merits: DocentCV: Download CVORCID: 0000-0002-8250-8574 Short presentation My research focuses on approaches for moving data more efficiently in computer systems, using both software and hardware techniques. Our results have been commercialized through a startup and incorporated in industry standards. Prior to joining Uppsala, I contributed to the OpenCL standard while working at Apple, Inc. I have received multiple teaching awards and lead a startup that helped over 80,000 students. As of June 2023 I am the Dean of Research for the Faculty of Science and Technology. Keywords performancecomputer architecturememory systemssimulationruntimesschedulingefficiencyactive teachingcommercialization Biography I received my PhD in Electrical Engineering from Stanford University in 2008. My PhD thesis was on programming for real-time embedded processing on many-core processors in the Concurrent VLSI Architecture Group working with William Dally. After my PhD I worked at Apple on the development of the first OpenCL implementation for heterogeneous parallel processing across CPUs and GPUs, and then as a postdoc researcher in computer architecture in the Dept. of Information Technology at Uppsala University. I was appointed assistant professor in 2010 in the architecture research group at Uppsala looking at parallel programming systems and optimizations as part of the UPMARC research center. I received the docent title in 2014 and a promotion to full professor in 2017. At Uppsala University, I was the Research Responsible Professor for the Computer Architecture and Communications Systems program from 2020-2022, the head of the Division of Computer Systems from 2022, and the department representative to the faculty Advisory Committee for Research since 2021. I have been very active in flipped-classroom teaching. In particular, I lead the ScalableLearning project from 2012-2020, which developed an online system to support at-home and in-class flipped classroom teaching used by over 80,000 students. My active teaching techniques have been recognized by the Uppsala Engineering and Science Student Union Pedagogical Prize (2012), the Uppsala University Pedagogical Prize (2016), and the Uppsala Technical Physics Students' Teaching Award (2019). I have also worked to bring my research results into industry, both through startups and industrial collaboration. Together with my colleague Erik Hagersten, we commercialized our new power-efficient memory system designs, resulting in their being acquired by a major international corporation. I have also worked with my colleague Chang Hyun Park and collaborators at Arm Ltd., in the UK, to get our memory system designs into the specification for future Arm processors. Google Scholar Citations Grants and Awards Knut and Alice Wallenberg Foundation, Wallenberg Academy Fellowship Prolongation (2020-2025)Swedish Research Council (VR) Project Grant (2019-2024)European Research Council ERC Starting Grant (2017-2022)Uppsala University Pedaogical Prize (2016)Swedish Foundation for Strategic Research (SSF), Smart Systems Framework Grant (Co-PI, 2016-2021) Automating System SpEcific Model-Based LEarning (ASSEMBLE)Knut and Alice Wallenberg Foundation, Wallenberg Academy Fellow (2016-2021)Swedish Research Council (VR), Young Researcher Project Grant (2015-2018)Swedish Foundation for Strategic Research (SSF), Future Research Leaders (2013-2018)EU FP7, Addressing Energy in Parallel Technologies (Co-PI 2013-2016)Uppsala University, Pedagogical Development Grant for Flipped Classroom (2013)Swedish Research Council (VR), Framework Grant (Co-PI, 2012-2017)Uppsala Union of Engineering and Science Students, Teaching Award (2012)Stanford University, Centennial Teaching Assistant Award (2004)Stanford University, Hugh Hildreth Skilling Teaching Assistant Award (2003) Teaching Computer Architecture 1 (To view the interactive online course lectures, register at ScalableLearning and join with the enrollment key YRLRX-25436.) Sample: Introduction to Digital Logic Design (88 minutes)Sample: Introduction to Virtual Memory (70 min) Parallel Programming for Efficiency (MSc level) Sample: Power and Energy in Computer Systems (52 min) Introduction to Computer Architecture Research (PhD level) Presentations Predicting Next-Generation Multicore Performance in a Fraction of a Second (Keynote, SICS Multicore Day, 2015)GPUs: The Hype, The Reality, and the Future (Keynote, SICS Multicore Day, 2013) PDF (2011)Flipped Classroom Teaching in an Introductory CS Course (KTH, 2013) PDFResource Sharing in Multicore Processors (Keynote, Ericsson Software Research Day 2011)Introduction to OpenCL PDFOptimizing OpenCL PDFGPU Architectures for Non-Graphics People PDF Publications Recent publications Mark-Scavenge: Waiting for Trash to Take Itself Out Norlinder, Jonas; Osterlund, Erik; Black-Schaffer, David; Wrigstad, Tobias Part of Proceedings of the ACM on Programming Languages, 2024 DOI for Mark-Scavenge: Waiting for Trash to Take Itself Out Download full text (pdf) of Mark-Scavenge: Waiting for Trash to Take Itself Out Mutator-Driven Object Placement using Load Barriers Norlinder, Jonas; Yang, Albert Mingkun; Black-Schaffer, David; Wrigstad, Tobias Part of PROCEEDINGS OF THE 21ST ACM SIGPLAN INTERNATIONAL CONFERENCE ON MANAGED PROGRAMMING LANGUAGES AND RUNTIMES, MPLR 2024, p. 14-27, 2024 DOI for Mutator-Driven Object Placement using Load Barriers Download full text (pdf) of Mutator-Driven Object Placement using Load Barriers Mutator-Driven Object Placement using Load Barriers Norlinder, Jonas; Yang, Albert Mingkun; Black-Schaffer, David; Wrigstad, Tobias Part of MPLR 2024: Proceedings of the 21st ACM SIGPLAN International Conference on Managed Programming Languages and Runtimes, 2024 DOI for Mutator-Driven Object Placement using Load Barriers Protean: Resource-efficient Instruction Prefetching Hassan, Muhammad; Park, Chang Hyun; Black-Schaffer, David Part of The International Symposium on Memory Systems (MEMSYS '23), p. 1-13, 2023 DOI for Protean: Resource-efficient Instruction Prefetching Download full text (pdf) of Protean: Resource-efficient Instruction Prefetching Large-scale Graph Processing on Commodity Systems: Understanding and Mitigating the Impact of Swapping Haddadi, Alireza; Black-Schaffer, David; Park, Chang Hyun Part of The International Symposium on Memory Systems (MEMSYS '23), p. 1-11, 2023 DOI for Large-scale Graph Processing on Commodity Systems: Understanding and Mitigating the Impact of Swapping Download full text (pdf) of Large-scale Graph Processing on Commodity Systems: Understanding and Mitigating the Impact of Swapping All publications Articles in journal Mark-Scavenge: Waiting for Trash to Take Itself Out Norlinder, Jonas; Osterlund, Erik; Black-Schaffer, David; Wrigstad, Tobias Part of Proceedings of the ACM on Programming Languages, 2024 DOI for Mark-Scavenge: Waiting for Trash to Take Itself Out Download full text (pdf) of Mark-Scavenge: Waiting for Trash to Take Itself Out Exploring the Latency Sensitivity of Cache Replacement Policies Nematallah, Ahmed; Park, Chang Hyun; Black-Schaffer, David Part of IEEE Computer Architecture Letters, p. 93-96, 2023 DOI for Exploring the Latency Sensitivity of Cache Replacement Policies Download full text (pdf) of Exploring the Latency Sensitivity of Cache Replacement Policies Dependence-aware Slice Execution to Boost MLP in Slice-out-of-order Cores Kumar, Rakesh; Alipour, Mehdi; Black-Schaffer, David Part of ACM Transactions on Architecture and Code Optimization (TACO), 2022 DOI for Dependence-aware Slice Execution to Boost MLP in Slice-out-of-order Cores A Reusable Characterization of the Memory System Behavior of SPEC2017 and SPEC2006 Hassan, Muhammad; Park, Chang Hyun; Black-Schaffer, David Part of ACM Transactions on Architecture and Code Optimization (TACO), 2021 DOI for A Reusable Characterization of the Memory System Behavior of SPEC2017 and SPEC2006 Early Address Prediction: Efficient Pipeline Prefetch and Reuse Alves, Ricardo; Kaxiras, Stefanos; Black-Schaffer, David Part of ACM Transactions on Architecture and Code Optimization (TACO), 2021 DOI for Early Address Prediction: Efficient Pipeline Prefetch and Reuse Download full text (pdf) of Early Address Prediction: Efficient Pipeline Prefetch and Reuse Maximizing limited resources: A limit-based study and taxonomy of out-of-order commit Alipour, Mehdi; Carlson, Trevor E.; Black-Schaffer, David; Kaxiras, Stefanos Part of Journal of Signal Processing Systems, p. 379-397, 2019 DOI for Maximizing limited resources: A limit-based study and taxonomy of out-of-order commit Download full text (pdf) of Maximizing limited resources: A limit-based study and taxonomy of out-of-order commit Analyzing performance variation of task schedulers with TaskInsight Ceballos, Germán; Grass, Thomas; Hugo, Andra; Black-Schaffer, David Part of Parallel Computing, p. 11-27, 2018 DOI for Analyzing performance variation of task schedulers with TaskInsight Exploring scheduling effects on task performance with TaskInsight Ceballos, Germán; Hugo, Andra; Hagersten, Erik; Black-Schaffer, David Part of Supercomputing frontiers and innovations, p. 91-98, 2017 DOI for Exploring scheduling effects on task performance with TaskInsight Analytical Processor Performance and Power Modeling Using Micro-Architecture Independent Characteristics Van den Steen, Sam; Eyerman, Stijn; De Pestel, Sander; Mechri, Moncef et al. Part of IEEE Transactions on Computers, p. 3537-3551, 2016 DOI for Analytical Processor Performa",
  "content_length": 30809,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:43"
}