{
  "name": "David Poole 0001",
  "homepage": "https://www.cs.ubc.ca/~poole",
  "status": "success",
  "content": "David Poole David Poole Computer Science, UBC Home Research Publications Textbook As of July 2024, I am now retired. I am still doing research, just no administration or undergrad teaching. This means I will say no to reviewing, chairing, evaluation requests, etc. Full text of the third edition of our of AI textbook, Artificial Intelligence: foundations of computational agents, Cambridge University Press, 2023, is available. You can order a copy and instructors can request an examination copy from Cambridge University Press. All our code is implemented in pseudo-literate programming in AIPython. You can view the video of my KR 2020 invited talk. I am Professor Emeritus in the Department of Computer Science, University of British Columbia. I have been a faculty member at UBC since 1988 and a full Professor from 1998-2024. (I was a full Professor in the last millennium; the last millennium was, on average, more than 500 years ago, so it was time to retire.) I was the winner of the Canadian AI Association (CAIAC), 2013 Lifetime Achievement Award. I am a Fellow of the Association for the Advancement of Artificial Intelligence, and a fellow of CAIAC. I am former chair of the Association for Uncertainty in Artificial Intelligence. During the 2014-2015 academic year, I was a Leverhulme Trust visiting professor at the University of Oxford. BlueSky, Linkedin, Mastodon Research My main research interests are artificial intelligence, knowledge representation, reasoning under uncertainty, computational logic, diagnosis, probabilistic argumentation systems, reasoning about actions, decision theoretic planning, intelligent agents, semantic science and preference elicitation. In general, I am interested in the questions: What should an agent do based on its beliefs, abilities and preferences? How can we acquire and efficiently use information to make better decisions? I am currently working mostly on statistical relational AI, relational learning, existential uncertainty, lifted inference, Semantic Science, and applications in spatial decision making, medicine and computational sustainability. I am particularly interested in probability and utility modelling, reasoning and learning over rich hypothesis spaces, with multiple possible objects with the vocabularies mediated by ontologies. long-term research overview, which includes open problems and papers that should be followed up. a list of all of my papers (many are on-line) recent talks AILog2; a simple logical representation and reasoning system with explanation facilities, declarative debugging, ask-the-user, abduction and probabilistic reasoning; formerly CILog. Some older code to play with. For overviews of my research see: \"Agents, Decisions, Beliefs, Preferences, Science and Politics\" for a brief overview, \"Semantic Science: Ontologies, Data and Probabilistic Theories\" for a vision of what we are trying to do with semantic science, and \"The Independent Choice Logic and Beyond\" for an overview of what we know how to do with rich probabilistic logical relational languages, and what challenges remain. See also my listing in the International Directory of Logicians. See also \"How to write a research paper\". Books David Poole and Alan Mackworth, Artificial Intelligence: Foundations of Computational Agents Cambridge University Press, 2010, second edition, 2017, third edition 2023. This is a textbook on the foundations of AI, suitable for senior undergraduate and graduate-level courses. The full text is available online in html, and the hard copy is available from your favourite bookstore. We have Python implementations of most of the algorithms at AIPython.org. Guy Van den Broeck, Kristian Kersting, Sriraam Natarajan, and David Poole Introduction to Lifted Inference, MIT Press, 2021. This is about how to simultaneously exploit the independence structure of graphical models, and the structure induced by exchangeable entities (universal quantification). Exchangeable entities means that the entities about which we have the same information should be treated identically (we can exchange the names). In particular, before we know anything about anyone we should treat everyone the same. This provides structure that we can exploit to make inference faster. There are methods that are always exponentially faster (in the number of undifferentiated entities) than reasoning about the entities separately (in what is called the grounding) without exploiting exchangeability. This is a coherent book written by the originators of the methods. Statistical Relational Artificial Intelligence: Logic, Probability, and Computation, by Luc De Raedt, Kristian Kersting, Sriraam Natarajan, and David Poole, DOI: 10.2200/S00692ED1V01Y201601AIM032 Morgan & Claypool Publishers, March, 2016. This is an overview of (some of) the vast work on integrating probabilities and relational representations. You can view the video of our Statistical Relational AI tutorial at NIPS 2017. David Poole, Alan Mackworth, Randy Goebel, Computational Intelligence: A Logical Approach, Oxford University Press, 1998. This is a textbook introduction to Artificial Intelligence, that presents AI from the perspective of logic (programming). I was coeditor of: M. Fox, D. Poole, editors, Proc. Twenty-Fourth AAAI Conference on Artificial Intelligence (AAAI-10), Atlanta, USA, July 11 - 15, AAAI Press, 2010. I was co-editor of Proceedings of the Tenth Annual Conference on Uncertainty in Artificial Intelligence, Morgan Kaufmann, 1994. Teaching and Administrivia Students supervised. I am teaching both CPSC 522 in September-December 2023 and CPSC 312 in January-April 2024. I am past chair of the Association for Uncertainty in AI. I was an associate editor of the Journal of Artificial Intelligence Research and the journal Artificial Intelligence. Main Conferences: UAI, IJCAI, AAAI, Canadian AI, KR, ICML, NeurIPS. Reading groups: Statistical Relational AI (formerly known as first-order probabilistic inference) and other LCI reading groups. I have lots of Interesting Pointers. Contact Information Email: poole@cs.ubc.ca Fax: +1 (604) 822-5485 URL: http://cs.ubc.ca/~poole/ Address: Department of Computer Science, University of British Columbia, 2366 Main Mall, Vancouver, B.C., Canada V6T 1Z4 Last updated 2024-12-29 - David Poole, poole@cs.ubc.ca",
  "content_length": 6330,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:57"
}