{
  "name": "David van Leeuwen",
  "homepage": "https://www.ru.nl/english/people/leeuwen-d-van",
  "status": "success",
  "content": "Prof. D.A. van Leeuwen (David) | Radboud University Prof. D.A. van Leeuwen (David) Professor - Data Science Chair (extraordinary professor): Machine learning on human-generated data Associated external organization: Novolanguage BV Contact d.vanleeuwen@science.ru.nl To LinkedIn Visiting address Toernooiveld 212 6525 EC NIJMEGEN Internal postal code: 47 Postal address Postbus 9010 6500 GL NIJMEGEN David van Leeuwen is a leading expert on automatic speech, speaker and language recognition. He studies the automatic extraction of information from speech signals, especially what is said, who speaks, and in which language. The main ambition here is to apply techniques that are successful in one of the sub-areas (e.g. speaker recognition) in other sub-areas as well (e.g. speech, language or accent recognition). It is important in this respect that the task, evaluation measures and speech databases are well-defined. International benchmark evaluations constitute an ideal research framework.Prof. Van Leeuwen holds an endowed chair. Since 1994, he has worked as a researcher for TNO Human Factors on various aspects of speech technology. He evaluated automatic speech recognition systems in various languages and was one of the developers of the first speaker-independent, large-vocabulary speech recognition system for the Dutch language. From 2011 he worked at the Netherlands Forensic Institute, and studies Bayesian approaches to the presentation of weight of evidence in forensic cases. Since 2014 he is working for NovoLearning, a company that focuses on new ways of learning. Since 2020 he works at SpraakLab, a company that implements applications of speech technology. Tags: automatic speech recognition, automatic speaker recognition, automatic language recognition Publications Publication lists Radboud Repository Research Information Services (RIS) Ancillary activities Scientist at SpraakLab (01 September 2020) SpraakLab BV Member of the Board of Advisors Whispp (01 May 2020) Whispp",
  "content_length": 2004,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:19"
}