{
  "name": "David R. Gilbert",
  "homepage": "https://www.brunel.ac.uk/people/david-gilbert",
  "status": "success",
  "content": "Professor David Gilbert | Introduction | Brunel University London Skip to Content Home People Professor David Gilbert Professor David GilbertEmeritus Honorary Professor Wilfred Brown Building 210 Email: david.gilbert@brunel.ac.uk Tel: +44 (0)1895 267665 Personal Website Computer Science College of Engineering, Design and Physical Sciences Summary Professor David Gilbert is  Leverhulme Emeritus Fellow, Emeritus Professor of Computing and member of the Computational Biology group in the Department of Computer Science. Previously he was Head of School of Information Systems, Computing and Mathematics, and first Dean of the College of Engineering, Design and Physical Sciences, leading its establishment in 2014-15.  In his previous post he was Professor of Bioinformatics at the University of Glasgow where he set up and was Director of the Bioinformatics Research Centre. He holds a BSc in experimental Pyschology and a Masters in Education from the University of Bristol, and a Masters and PhD in Computing from Imperial College, London where his research was into modelling concurrent systems using computational logic. David was an EPSRC Research Fellow at the European Bioinformatics Institute, and a Leverhulme Research Fellow in the Department of Biochemistry and Molecular Biology, University College London when designed and developed the TOPS protein topology computational system. Qualifications BSc in experimental Pyschology, University of Bristol. Masters in Education, University of Bristol. Masters and PhD in Computing from Imperial College, London where his research was into modelling concurrent systems using computational logic. Responsibility David was co-chair of the conference on Computational Methods in Systems Biology (2011), chair of the Second European Conference in Synthetic Biology (2009), and co-chair of the ISMB-ECCB 2004 international conference on Bioinformatics/Computational.  He has also co-organised several Dagstuhl seminars in Bioinformatics and Formal Methods in Molecular Biology.  David has a depth of experience in the UK research councils and is currently a member of the BBSRC (Biotechnology and Biological Sciences Research Council) Committee of Experts (Strategy), was the Chair of the Biochemical and Cellular Biology committee of the BBSRC, and has been member of the advisory committees to BBSRC on Synthetic Biology and Systems Biology.  He reviews for and advises other UK research agencies including ESPRC, MRC and Wellcome Trust, and regularly reviews national research efforts at a governmental and institutional level in several other countries. Newest selected publications Gilbert, D., Heiner, M., Ghanbar, L. and Chodak, J. (2019) 'Spatial quorum sensing modelling using coloured hybrid Petri nets and simulative model checking'. BMC Bioinformatics, 20 (Suppl 4). pp. 1 - 23. ISSN: 1471-2105 Open Access Link Journal article Self, T., Gilbert, D. and Heiner, M. (2018) 'Derivation of a biomass proxy for dynamic analysis of whole genome metabolic models'.Computational Methods in Systems Biology: CMSB 2018. Brno, Czech Republic. 12 - 14 September. Springer International Publishing. pp. 39 - 58. ISSN: 0302-9743 Open Access Link Conference paper Colombo, R., Damiani, C., Gilbert, D., Heiner, M., Mauri, G. and Pescini, D. (2018) 'Emerging ensembles of kinetic parameters to identify experimentally observed phenotypes'. BMC Bioinformatics, 19 (251). pp. 251. ISSN: 1471-2105 Open Access Link Journal article Gilbert, D., Heiner, M. and Rohr, C. (2018) 'Petri-net-based 2D Design of DNA Walker Circuits'. Natural Computing, 17 (1). pp. 161 - 182. ISSN: 1567-7818 Open Access Link Journal article Lui, F., Heiner, M. and Gilbert, D. (2017) 'Coloured Petri nets for multi-level, multiscale, and multi-dimensional modelling of biological systems'. Briefings in Bioinformatics, 20 (3). pp. 877 - 886. ISSN: 1467-5463 Open Access Link Journal article More publications(135)",
  "content_length": 3938,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:59"
}