{
  "name": "David E. Breen",
  "homepage": "https://www.cs.drexel.edu/~david",
  "status": "success",
  "content": "David E. Breen Home Page David E. Breen Teaching           Research           Publications Bio           CV Professor Department of Computer Science College of Computing and Informatics Drexel University 3141 Chestnut Street Philadelphia, PA 19104 Office : 3675 Market Street, Room 1133 Office # : (215) 895-1626     (Do not leave messages at this number) Dept. # : (215) 895-2669 FAX # : (215) 895-0545 david AT cs.drexel.edu News I was awarded a Fulbright Scholarship to conduct research with the ELAN Team of the INRIA Centre at the University of Grenoble Alpes during the 24-25 school year! More details can be found here. I was also named a Dresden Senior Fellow, which supported my sabbatical visit to TU Dresden (Germany) last Fall! I conducted research at the Institute of Textile Machinery and High Performance Material Technology. More details can be found here. I guest co-edited (along with Jim McCann of CMU) a special issue of the journal Computer Aided Design on Computational Modeling, Design and Fabrication for Textiles. My PhD student Levi Kapplani Maharaj and others have published a paper on generating yarn topology graphs for knitted fabrics. I was part of the Drexel team that was awarded one of the National Institutes for Manufacturing Innovation! Called AFFOA, the institute focuses on advanced fibers and textiles and is led by MIT. Go here for more information. AFFOA and the State of Pennsylvania have established a Fabric Discovery Center at Drexel. Enjoy some \"math humor\"! I am affiliated with the Metadata Research Center and the Center for Biological Discovery from Big Data. I collaborate with three research teams: Dr. Jane Greenberg's Metadata Research Center on automatic image metadata generation research, Dr. Mark Zarella of the Hospital of the University of Pennsylvania and Dr. Fernando Garcia of Tower Health on digital pathology research, Dr. Ken Museth of Nvidia. and Rafael Campos of the University of São Paulo on 3D morphing research. I am the Program Co-Chair for the 2025 10th International Conference on Biomedical Signal and Image Processing. I am currently on the Program Committee of the 2025 Asia Symposium on Image Processing and the 2025 IEEE International Conference on Bioinformatics and Biomedicine. I am on the Editorial Boards of Comuter Aided Design, MDPI Textiles and International Journal of Modeling and Optimization. Teaching Diagram showing how CS certificates map into the CS MS degrees Proposed Web Page Update for CS PhD Requirements CS 430 Computer Graphics - Fall 2025 CS 536 Computer Graphics - Fall 2025 CS 536 Computer Graphics - Spring 2024 CS 432 Interactive Computer Graphics - Winter 2024 CS 430 Computer Graphics - Fall 2023 CS 432 Interactive Computer Graphics - Winter 2023 CS 430 Computer Graphics - Fall 2022 CS 636 Advanced Rendering Techniques (officially Advanced Computer Graphics) - Spring 2022 CS 536 Computer Graphics - Fall 2021 CS 430 Computer Graphics - Fall 2021 CS 432 Interactive Computer Graphics - Winter 2021 CS 536 Computer Graphics - Fall 2020 CS 430 Computer Graphics - Fall 2020 Older Teaching Links Research Interests Geometry is the technical thread that runs through most of my research. This may include geometric computation, geometric modeling, and geometric analysis. Having studied physics as an undergraduate, physics-based modeling also is a frequent theme in my research, which can be seen in my energy-based optimization and simulation work. Since I am fascinated by living systems and how they develop, I have worked extensively with biologists, biophysicists, biomedical engineers and physicians. This interest has led to my research efforts in geometric biomedical computing. This is a research area that lies at the intersection of biology, medicine, engineering and computer science, and one that develops algorithms and software to solve geometry-related computing problems for a variety of biomedical applications. I am intrigued by the dynamic processes that aggregate small-scale, local interactions to produce large-scale, self-organizing macroscopic behavior and structures. I have also returned to my technical roots (cloth modeling) by conducting research on the modeling and design of knitted fabrics. I am currently involved in seven research projects: modeling and design of 4D surfaces, computational technologies for the design of knitted structures, swarm-based prediction techniques, automatic image metadata generation, mesh-based deep learning for object classification and shape matching, shape and image analysis for computer-aided diagnosis of breast tumors, feature-based 3D level set morphing. Here is an overview of my research activities/expertise. Current Research Geometric Biomedical Computing Cloth Modeling and Design Deformable Models and Segmentation Geometric Modeling Completed Research Large Data Visualization Augmented Reality Computer Animation Publications List Selected Ray-Traced Images My book, Cloth Modeling and Animation, (co-edited with Donald House) is available from CRC Press! Education Employment History Current Students Joel Pepper Chen Sun Former Drexel Students Linge Bai Subhadip Banerjee Joanna Beltowska Jonathan Bradshaw Ilya Braude Patrick Bray Daniel Brooks Rafael Campos Laurence Chapman Joshua DiCristo Peter Gagliardi Simon Galperin Prateek Goel Ben Greenfield Sean Grimes Sai Chetan Kumar Gudepu Brian Hagewiesche Rich Hart Dan Hennessey Dan Johnson Kevin Karnani Anthony Knesis Michael Kozak Steven Lawrence Hollis Liu Bruce Mackay Levi Kapllani Maharaj Jeff Marker Eric Markowicz Manolya Eyiyurekli McCormick Andrew McDonald Lingchuan Meng Robert Miller Calvin Morrison Chirag Patel Matt Quaschnick Md. Alimoor Reza Benjamin Roberson Zahra Samani Craig Schroeder Andrew Senin Bahareh Shakibajahromi Mayinuzzaman Shawon Adam Steppe Wenhan Tan Jeshuran Thoppil Shardul Vinchurkar Paras Wadekar Christoffer Westberg Andrew Wilson Shirley Wu Wenyu Xin Yupei Yang Chan Yeoh Jasper Zhang Yaqi Zhang Mark Zuber Conference Information Personal Links Drexel University Land Acknowledgment Statement Last modified on November 15, 2025.",
  "content_length": 6114,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:51"
}