{
  "name": "David Taniar",
  "homepage": "https://research.monash.edu/en/persons/david-taniar",
  "status": "success",
  "content": "David Taniar - Monash University David Taniar public CV View Scopus Profile David Taniar Assoc Professor Associate Professor, Department of Software Systems & CybersecurityVictorian Heart Institute (VHI) https://orcid.org/0000-0002-8862-3960 EmailDavid.Taniarmonashedu 1997 …2025 Research activity per year Personal profile BiographyDavid Taniar is an Associate Professor in the Faculty of Information Technology, Monash University.Monash teaching commitmentAssociate Professor David Taniar has experience as the Chief Examiner for the following units in the Faculty of IT: FIT1004 Data management FIT3003 Business intelligence and data warehousing FIT3107 Advanced programming for database applications FIT4038 Database management and implementation FIT5043 Distributed database FIT5059 Advanced programming for database applications FIT5137 Database analysis and processing David has experience as the Lecturer for the following units in the Faculty of IT: FIT1004 Data management FIT2077 Advanced data management FIT3003 Business intelligence and data warehousing FIT3107 Advanced programming for database applications FIT4038 Database management and implementation FIT5059 Advanced programming for database applications FIT5137 Database analysis and processing Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Doctor of Philosophy, Victoria University (VU)Award Date: 1 Jul 1997Computer Science, Master of Applied Science, Swinburne University of TechnologyAward Date: 1 Jul 1992Computer Science, Graduate Diploma, Swinburne University of TechnologyAward Date: 1 Jul 1990 Research area keywordsComputation Theory and MathematicsDistributed ComputingInformation SystemsMobile Databases Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2001 2001 2006 2009 2014 2016 2018 2020 2021 2023 2026 1 Not started 1 Active 13 Finished Projects per year A digital health intervention to provide individualised feedback on pathology requesting practices of Emergency Department cliniciansCraig, S. (Primary Chief Investigator (PCI)), Taniar, D. (Chief Investigator (CI)), Haryanto, A. (Chief Investigator (CI)), O'Reilly, G. (Chief Investigator (CI)), Callander, E. (Chief Investigator (CI)), Buntine, P. (Chief Investigator (CI)), Egerton-Warburton, D. (Chief Investigator (CI)), Babl, F. E. (Chief Investigator (CI)) & Blecher, G. (Chief Investigator (CI))Department of Health and Aged Care (Australia)28/04/23 → 30/06/26Project: Research Eco-friendly Navigation : Eco-friendly Navigation using Big Spatiotemporal DataBeg, A. (Primary Chief Investigator (PCI)), Cheema, A. (Chief Investigator (CI)), Nadjaran Toosi, A. (Chief Investigator (CI)), Taniar, D. (Chief Investigator (CI)) & Wang, H. (Chief Investigator (CI))Project: Research Tokopedia : TokoNOW Forecasting Project and Review-based Recommendation Systems development-Tokopedia Bergmeir, C. (Primary Chief Investigator (PCI)), Schmidt, D. (Chief Investigator (CI)), Saputra, R. (Chief Investigator (CI)), Wilson, C. (Chief Investigator (CI)), Taniar, D. (Chief Investigator (CI)) & Lee, V. (Chief Investigator (CI))27/07/21 → 19/09/22Project: Research Actionable data for clinicians and external accreditors in support of quality care provision and continuous accreditation.Wybrow, M. (Primary Chief Investigator (PCI)), Taniar, D. (Chief Investigator (CI)), Davis, I. (Chief Investigator (CI)), Kokai, Z. (Partner Investigator (PI)), Luxford, K. (Partner Investigator (PI)) & Board, N. (Partner Investigator (PI))Monash University – Internal Faculty Contribution1/04/21 → 31/03/25Project: Research Online Sales_ESV: Online Sales Research for Energy Safe Victoria: A Pilot StudyLee, V. (Primary Chief Investigator (PCI)) & Taniar, D. (Chief Investigator (CI))Energy Safe Victoria (ESV)1/10/20 → 31/05/22Project: Research View all 15 projects Research output Research output per year 1997 2002 2003 2004 2005 2006 2009 2010 2011 2013 2021 2025 231 Conference Paper 194 Article 28 Chapter (Book) 22 Editorial 37 More 18 Foreword / Postscript 6 Book 5 Edited Book 3 Comment / Debate 2 Other 1 Textbook 1 Abstract 1 Design / Architecture Research output per year Research output per year Bridging the education gap: A comprehensive analysis of travel distance and education quality based spatial accessibility of early childhood education in Metropolitan MelbourneLyu, S., Chen, X., Adhinugraha, K. M. & Taniar, D., Jan 2025, In: Cities. 156, 15 p., 105530.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 3 Citations (Scopus) DNA methylation biomarker analysis from low-survival-rate cancers based on genetic functional approachesTsai, Y.-H., Mitra, P., Taniar, D. & Pai, T.-W., 28 Jan 2025, In: Frontiers in Bioinformatics. 5, 11 p., 1523524.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 1 Citation (Scopus) DrugBlock: An Advanced System to Secure Drug Supply Chain Using Internet of Things and Blockchain-Enabled Consumer ElectronicsNamasudra, S., Das, S., Crespo, R. G., Taniar, D. & Moparthi, N. R., May 2025, In: IEEE Transactions on Consumer Electronics. 71, 2, p. 4497-4507 11 p.Research output: Contribution to journal › Article › Research › peer-review 3 Citations (Scopus) Analysing the impact of comorbid conditions and media coverage on online symptom search data: a novel AI-based approach for COVID-19 trackingLyu, S., Adegboye, O., Adhinugraha, K. M., Emeto, T. I. & Taniar, D., 2 Feb 2024, In: Infectious Diseases. 56, 5, p. 348-358 11 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) An Effective DNA Methylation Biomarker Screening Mechanism for Amyotrophic Lateral Sclerosis (ALS) Based on Comorbidities and Gene Function AnalysisYang, C.-H., Huang, J.-L., Tsai, L.-K., Taniar, D. & Pai, T.-W., 12 Oct 2024, In: Bioengineering. 11, 10, 13 p., 1020.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile View all 512 research outputs Prizes 2021 Good Design Award, Design Research - Gold Winner: Hand Hygiene ManagementArmstrong, M. (Recipient), Flynn, D. (Recipient), Hinds, J. (Recipient), Campbell, D. (Recipient), John, K. (Recipient), Morfuni, R. (Recipient), Kerley, B. (Recipient), Taniar, D. (Recipient) & Yuce, M. (Recipient), 2021Prize: Prize (including medals and awards) Activities Activities per year 2007 2007 2007 1 Editorial responsibility Activities per year International Journal of Business Data Communications and Networking (Journal)Gutierrez, J. (Editor in chief), Biswas, J. (Editor in chief), Chatterjee, S. (Editor in chief), Lorenz, P. (Editor in chief), Saha, D. (Editor in chief), Sridhar, V. (Editor in chief), Taniar, D. (Editor in chief) & Umar, A. (Editor in chief)2007Activity: Publication peer-review and editorial work types › Editorial responsibility",
  "content_length": 7454,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:07"
}