{
  "name": "David J. Fleet",
  "homepage": "http://www.cs.toronto.edu/~fleet",
  "status": "success",
  "content": "David J. Fleet: University of Toronto Home Page David J Fleet Professor Department of Computer Science University of Toronto and Department of Computer and Mathematical Sciences University of Toronto Scarborough Faculty Member and CIFAR AI Chair Vector Institute Faculty Affiliate UofT Robotics Institute Research I work with Google DeepMind in Toronto and the University of Toronto. I joined the University of Toronto in 2004, and the Google Brain Team in Toronto in 2020. Prior to our move to Toronto I worked in the Digital Video Analysis and Perceptual Document Analysis Groups at Xerox PARC (1999-2003), and at Queen's University in Kingston (1990-1998). During 2012-2017 I served as Chair of the Department of Computer and Mathematical Sciences at the University of Toronto Scarborough. I have been a faculty member at the Vector Institute since 2017, serving as Associate Research Director, Industry Innovations until 2020. I served as Associate Editor (2000-2003) and then as Associate Editor-in-Chief (2004-2008) for IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI). I also served as Program Co-Chair of IEEE CVPR (2003), ECCV (2014), and as Area Chair for numerous vision and learning conferences (CVPR, ECCV, ICCV, NIPS, ICML). At present I serve on the Advisory Board for IEEE Transactions on PAMI. I also serve as Scientific Advisor to Structura Biotechnology. My research interests span aspects of computer vision, machine learning, image processing, visual neuroscience, and computational biology. Most of my research in vision and image analysis has focused on mathematical foundations and algorithms for visual motion analysis and stereopsis, tracking, human pose and motion estimation, video classification/captioning, multiview 3D reconstruction, and 3D structure determination for electron cryo-microscopy (cryo-EM). My research in machine learning has focused on deep learning, discrete and continuous latent variable generative models (images, video, human pose and motion), and diffusion models. Further Information Teaching Selected Publications Google Scholar Talks Structura Biotechnology Inc Data and Software Vision Group at UofT Students and Colleagues Biographical Information and CV Images of my brain 2010 Koenderink Prize 2014 TEDxTORONTO talk Contact Information Department of Computer Science University of Toronto Pratt Building, Rm. 391 6 King's College Rd, Toronto, Canada M5S 3H5 Map / Directions to DCS Department of Computer and Mathematical Sciences University of Toronto Scarborough Sam Ibrahim Building, Rm. IA 4020 1050 Military Trail, Toronto, Canada Phone: 416 287 7219 Map / Directions to CMS/UTSC Email: fleet at cs dot toronto dot edu Last updated August 2024",
  "content_length": 2730,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:14"
}