{
  "name": "David J. Feil-Seifer",
  "homepage": "http://nevada-reno.academia.edu/DavidFeilSeifer",
  "status": "success",
  "content": "David Feil-Seifer - University of Nevada, Reno Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless David Feil-SeiferUniversity of Nevada, Reno, Department of Computer Science and Engineering, Faculty MemberaddFollowdoneFollowingFollowers182Following31Co-authors6Public ViewsI am an associate professor in Computer Science at the University of Nevada, Reno. My primary research interest is Socially Assistive Robotics (SAR). My research is motivated by the potential for SAR to address health-care crises that stem from a lack of qualified care professionals for an ever-growing population in need of personalized care.Before I started at UNR, I was a Postdoctoral Associate at Yale University at the Social Robotics Lab under the direction of Prof. Brian Scassellati. In 2011, I was awarded a National Science Foundation Computing Innovation Fellowship to support my work. I received my M.S. in Computer Science in 2007 and my Ph.D. in Computer Science in 2011 from the Viterbi School of Engineering (VSoE) at the University of Southern California. I worked in the Interaction Lab where my advisor was Prof. Maja Matarić. My research focused on socially assistive robotics (SAR), particularly the study of Human-Robot Interaction (HRI) for children with autism spectrum disorders (ASD). I graduated from the University of Rochester in 2003 with a B.S. in Computer Science. While there I was a founding member of the Undergraduate Robot Research Team, winner of the 2002 AAAI Mobile Host Competition. We were advised by Prof. Chris Brown.Supervisors: Brian Scassellati and Maja MatariclessRelated Authors Judith L GreenUniversity of California, Santa Barbara James ElkinsSchool of the Art Institute of Chicago Scott R. StroudThe University of Texas at Austin Maurizio ForteDuke University David SeamonKansas State University Remo CaponiUniversity of Cologne Armando Marques-GuedesUNL - New University of Lisbon Cristina UrdialesUniversidad de Málaga John SuttonMacquarie University Geert J VerhoevenUniversity of ViennaInterestsView All (8) CVUploadsPapers by David Feil-SeiferPerceived Social Intelligence ScalesPsycTESTS Dataset A Distributed Control Framework of Multiple Unmanned Aerial Vehicles for Dynamic Wildfire TrackingarXiv (Cornell University), Mar 19, 2018Wild-land fire fighting is a hazardous job. A key task for firefighters is to observe the \"fire f... more Wild-land fire fighting is a hazardous job. A key task for firefighters is to observe the \"fire front\" to chart the progress of the fire and areas that will likely spread next. Lack of information of the fire front causes many accidents. Using Unmanned Aerial Vehicles (UAVs) to cover wildfire is promising because it can replace humans in hazardous fire tracking and significantly reduce operation costs. In this paper we propose a distributed control framework designed for a team of UAVs that can closely monitor a wildfire in open space, and precisely track its development. The UAV team, designed for flexible deployment, can effectively avoid in-flight collisions and cooperate well with neighbors. They can maintain a certain height level to the ground for safe flight above fire. Experimental results are conducted to demonstrate the capabilities of the UAV team in covering a spreading wildfire.Download Securing a UAV Using Individual Characteristics From an EEG SignalarXiv (Cornell University), Apr 14, 2017Unmanned aerial vehicles (UAVs) have gained much attention in recent years for both commercial an... more Unmanned aerial vehicles (UAVs) have gained much attention in recent years for both commercial and military applications. The progress in this field has gained much popularity and the research has encompassed various fields of scientific domain. Cyber securing a UAV communication has been one of the active research field since the attack on Predator UAV video stream hijacking in 2009. Since UAVs rely heavily on on-board autopilot to function, it is important to develop an autopilot system that is robust to possible cyber attacks. In this work, we present a biometric system to encrypt the UAV communication by generating a key which is derived from Beta component of the EEG signal of a user. We have developed a safety mechanism that would be activated in case the communication of the UAV from the ground control station gets attacked. This system has been validated on a commercial UAV under malicious attack conditions during which we implement a procedure where the UAV return safely to a 'home' position.Download Using Machine Learning Approach for Computational Substructure in Real-Time Hybrid SimulationarXiv (Cornell University), Apr 4, 2020Hybrid simulation (HS) is a widely used structural testing method that combines a computational s... more Hybrid simulation (HS) is a widely used structural testing method that combines a computational substructure with a numerical model for well-understood components and an experimental substructure for other parts of the structure that are physically tested. One challenge for fast HS or real-time HS (RTHS) is associated with the analytical substructures of relatively complex structures, which could have large number of degrees of freedoms (DOFs), for instance. These large DOFs computations could be hard to perform in real-time, even with the all current hardware capacities. In this study, a metamodeling technique is proposed to represent the structural dynamic behavior of the analytical substructure. A preliminary study is conducted where a one-bay one-story concentrically braced frame (CBF) is tested under earthquake loading by using a compact HS setup at the University of Nevada, Reno. The experimental setup allows for using a smallscale brace as the experimental substructure combined with a steel frame at the prototype full-scale for the analytical substructure. Two different machine learning algorithms are evaluated to provide a valid and useful metamodeling solution for analytical substructure. The metamodels are trained with the available data that is obtained from the pure analytical solution of the prototype steel frame. The two algorithms used for developing the metamodels are: (1) linear regression (LR) model, and (2) basic recurrent neural network (RNN). The metamodels are first validated against the pure analytical response of the structure. Next, RTHS experiments are conducted by using metamodels. RTHS test results using both LR and RNN models are evaluated, and the advantages and disadvantages of these models are discussed.Download Towards GPU-Accelerated PRM for Autonomous NavigationAdvances in intelligent systems and computing, 2020Sampling based planning is an important step for longrange navigation for an autonomous vehicle. ... more Sampling based planning is an important step for longrange navigation for an autonomous vehicle. This work proposes a GPU-accelerated sampling based path planning algorithm which can be used as a global planner in autonomous navigation tasks. A modified version of the generation portion for the Probabilistic Road Map (PRM) algorithm is presented which reorders some steps of the algorithm in order to allow for parallelization and thus can benefit highly from utilization of a GPU. The GPU and CPU algorithms were compared using a simulated navigation environment with graph generation tasks of several different sizes. It was found that the GPU-accelerated version of the PRM algorithm had significant speedup over the CPU version (up to 78×). This results providesDownload Birds of a Feather Flock Together: A Study of Status Homophily in HRILecture Notes in Computer Science, 2021 Understanding Agency in Interactions Between ChildrenWith Autism and Socially Assistive RobotsJournal of human-robot interaction, Dec 25, 2017Socially assistive robotics (SAR) has increasingly been shown to have potential as a tool for soc... more Socially assistive robotics (SAR) has increasingly been shown to have potential as a tool for social skills therapy for children with autism, a developmental disorder associated with atypical social development. This work presents the results of a study of robot agency on child-robot interactions involving children with autism. We describe the development of a SAR interaction scenario with both agent-like and object-like robot behaviors and present the results of a pilot study of six children with autism interacting with a humanoid robot with the full controller, as well as three types of control: a non-humanoid \"box\" robot with similar behavior (reduced morphological agency), a humanoid robot with random behavior (reduced behavioral agency), and a robotic toy (reduced morphological and behavioral agency). We find that the children can be divided into two groups depending on their reaction to the robot; for some children, the robot was an engaging object that elicited social behavior by providing novel and appealing sensory experiences (primarily bubbleblowing), while for other children, the robot was an agent and elicited social behavior through agentlike actions such as autonomous movement. We found that the first group had small differences between robot conditions and vocalized most with the bubble-blowing toy, while the second group vocalized most with the humanoid robots and looked less at the humanoid portion of the robot with reduced behavioral agency.Download Exploring the Use of a Drone to Guide Blind RunnersPeople with visual impairments have a hard time getting consistent physical exercise, as they can... more People with visual impairments have a hard time getting consistent physical exercise, as they can not do some exercises, such as run ning outside, without a sighted guide. People with visual impair ments have been shown to have h",
  "content_length": 21380,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:14"
}