{
  "name": "David A. Mix Barrington",
  "homepage": "https://people.cs.umass.edu/~barring",
  "status": "success",
  "content": "David A. Mix Barrington David A. Mix Barrington I am Professor at the Manning College of Information and Computer Sciences at the University of Massachusetts Amherst. My primary research area is computational complexity, particularly boolean circuits, automata, and logic. Here is a list of my major publications -- a few have PDF versions and I plan to make more available as I get around to it. Until the summer of 2022, I was Associate Chair of the Faculty for Academics in the new College of Information and Computing Sciences, having held a similar position in the Computer Science Department and the School of Computer Science since the fall of 2011. For several years before that I was Chief Undergraduate Advisor, and I am still a good source for academic advice in the department, along with individual faculty advisors, the CICS advising staff, Undergraduate Program Director Andrew Lan, and Associate Dean Jack Wileden. Contact Info: 210 Computer Science Building, Box 34610 140 Governors Drive, Amherst MA 01003-4610 413-545-4329 (office) 413-545-1249 (fax) barring at cics dot umass dot edu Private zoom 459 532 6175 Office hours for Fall 2025: Monday 3-4, Thursday 2-3, Friday 12-1 in my office, 210 CS Building Course Web Sites: COMPSCI 250, Fall 2025 -- a core undergraduate course in logic, number theory, induction proofs, search algorithms, regular expressions, finite-state machines, and computability, co-taught with Mordecai Golin. INFO 150, Fall 2025 -- a course in the mathematical foundations of computing, intended for majors in the Informatics program. COMPSCI H250, Fall 2025 -- A 1-credit honors seminar on Hofstadter's G\\\"odel, Escher, Bach, open to honors students who are taking or have taken COMPSCI 250. COMPSCI 501, Spring 2025 -- a course in formal languages, computability, and complexity, for upper-level undeergraduates and master's students. COMPSCI 250, Spring 2025 -- the previous core course in discrete mathematics, co-taught with Mordecai Golin. COMPSCI 596C, Spring 2025 -- a group independent study course where students will read and present material from Computational Complexity: A Modern Approach by Arora and Barak. COMPSCI 250, Fall 2024 -- the most recent version of the course on the mathematical foundations for computer science, also co-taught with Prof. Mordecai Golin. INFO 150, Fall 2024 -- a course in the mathematical foundations of computing, intended for majors in the Informatics program. COMPSCI 250, Spring 2024 -- an earlier version of the course on the mathematical foundations for computer science, also co-taught with Prof. Mordecai Golin. COMPSCI 501, Spring 2024 -- the most recent previous offering of this grad/ugrad course on computability and complexity. COMPSCI H250, Spring 2024 -- I never got round to completing a web site for this one, and currently this points to the Spring 2023 site COMPSCI 250, Fall 2023 -- a prior course in the mathematical foundations for computer science, co-taught with Prof. Ghazaleh Parvini. (Course uses Moodle.) CICS 110, Fall 2023 -- the introductory Python programming course for those interested in continuing in computer science or informatics. I was one of seven instructors, and Prof. Cole Reilly was the course chair. COMPSCI 891M, Fall 2023 -- the college's Theory Seminar, also a one-credit graduate course, for which I am the faculty coordinator this term. COMPSCI 240, Summer 2023 -- the core undergraduate course in aspects of discrete mathematics that involve probability, taught online. COMPSCI 501, Spring 2023 -- yet another offering of this grad/undergrad course on formal languages, computability, and complexity. COMPSCI 250, Spring 2023 -- a prior offering of this undergraduate core course in discrete mathematics, also co-taught with Prof. Parvini. COMPSCI H250, Spring 2023 -- An honors seminar for students taking or who have taken COMPSCI 250, reading Hofstadter's Gödel, Escher, Bach. COMPSCI 501, Spring 2022 -- the same course (modulo COVID-related format changes) as I taught in Spring 2021, more info to come. COMPSCI 250, Spring 2022 -- a previous offering of this core undergraduate course, co-taught with Kyle Doney. (Course uses Moodle.) COMPSCI 250, Fall 2021 -- the course above, which I co-taught with Prof. Ghazaleh Parvini (course uses Moodle). COMPSCI 311, Fall 2021 -- an undergraduate course in the theory of algorithms, which I am co-teaching with Prof. Dan Sheldon (course uses Moodle, course web site still under construction). COMPSCI 741, Fall 2021 -- a graduate course in advanced complexity theory. COMPSCI 501, Spring 2021 -- a course in formal languages, computability, and complexity intended for advanced undergraduates and master's students in computer science and related areas. Asynchronous lectures, synchronous (but remote) discussions and non-lectures. (Course uses Moodle.) COMPSCI 121-05, Spring 2021 -- an in-person section of the introductory Java programming course for computer science majors and others interested in the same level of rigor. This course is under the overall direction of Professors Jaime Davila and Joe Chiu. Recorded lectures, two in-person non-lectures and one lab meeting per week. (Course uses Moodle.) COMPSCI H250, Spring 2021 -- an honors colloquium open to those in COMPSCI 250 this term (which I was not teaching) or who have taken it in the past. We read and discussed Godel, Escher, Bach: An Eternal Golden Braid by Douglas Hofstadter. One synchronous remote meeting per week. (Course uses Moodle.) COMPSCI 575/MATH 513, Fall 2020 -- a course in combinatorics in grad theory intended for advanced undergraduates or masters' students in either computer science or mathematics. (Course uses Moodle.) COMPSCI 121-03, Fall 2020 -- a section of the introductory course in Java programming for computer science majors and others interested in the same level of rigor. This course was also under the overall direction of Professors Jaime Davila and Joe Chiu. (Course used Moodle, no public web site for the section) COMPSCI 250, Spring 2020 -- the undergraduate core course in discrete mathematics (logic, number theory, induction, trees, searching, finite-state machines) which I co-taught with Hia Ghosh. (Course also uses Moodle.) COMPSCI 311, Spring 2020 -- the undergraduate core course in the theory of algorithms, which I co-taught with Marius Minea (Course also uses Moodle.) COMPSCI H250, Spring 2020 -- the honors section for COMPSCI 250, in which we read Hofstadter's Godel, Escher, Bach: An Eternal Golden Braid. COMPSCI 311, Fall 2019 -- the undergraduate core course in the theory of algorithms, which I also co-taught with Marius Minea (Course also used Moodle.) COMPSCI 741, Fall 2019 -- an advanced graduate course in complexity theory COMPSCI 891M, Fall 2019 -- the college's theory seminar, which I led with considerable help from Rik Sengupta. COMPSCI 250, Fall 2018 -- a prior offering of the undergraduate core course in discrete mathematics. I co-taught 250 this semester with Prof. Marius Minea. (Course also used Moodle.) COMPSCI 575/MATH 513, Fall 2018 -- a course in combinatorics and graph theory intended for advanced undergraduates and masters' students in either computer science or mathematics, cross-listed in both areas. (Course also uses Moodle.) COMPSCI 250, Spring 2018 -- a prior offering of this undergraduate course. COMPSCI 696A, Spring 2018 -- a group independent study reading Algebraic Graph Theory by Godsil and Royle (no site, I'm afraid) COMPSCI 250, Fall 2017 -- another previous offering of this undergraduate course INFO 150, Fall 2017 -- a course in discrete mathematics intended for students in the proposed informatics program, formerly known as CMPSCI 190DM. COMPSCI 250, Spring 2017 -- a previous offering of this discrete mathematics course. COMPSCI 501, Spring 2017 -- a course in the theory of computation, intended for advanced undergraduates, M.S. students in computer science, and non-CMPSCI graduate students. (Course also uses Moodle.) COMPSCI 891M, Spring 2017 -- the college's theory seminar, which I coordinated that term. COMPSCI 575/MATH 513, Fall 2016 -- a prior offering of this cross-listed course INFO 150, Fall 2016 -- a prior offering of this discrete mathematics course for students in the proposed informatics program. CMPSCI 250, Spring 2016 -- a prior prior offering of the core undergradruate course in discrete mathematics. CMPSCI 501, Spring 2016 -- a prior offering of this undergrad/grad course in the theory of computation CMPSCI 250, Fall 2015 -- a prior offering of this core undergraduate course in discrete mathematics. CMPSCI 190DM, Fall 2015 -- a course in discrete mathematics intended for students in the proposed informatics program. CMPSCI 250, Spring 2015 -- a prior offering of this undergraduate core course in discrete mathematics CMPSCI 501, Spring 2015 -- a prior offering of this advanced grad/undergrad course in the theory of computation CMPSCI 187, Fall 2014 -- the second programming course for majors, dealing with data structures in Java, which I co-taught with Prof. Mark Corner. CMPSCI 190DM, Fall 2014 -- a course in discrete mathematics intended for students in the proposed informatics program. CMPSCI 891M, Fall 2014 -- the department's theory seminar, which I coordinated this term. CMPSCI 501, Spring 2014 -- a prior offering of this upper-level course in the theory of computation, which was formerly called CMPSCI 401. CMPSCI 250, Spring 2014 -- a prior offering of this core undergraduate course in discrete mathematics. CMPSCI 250, Fall 2013 -- another prior offering of this undergraduate core course in discrete mathematics CMPSCI 190DM, Fall 2013 -- an experimental offering of a new undergraduate course in discrete mathematics and mathematical thinking, intended for students with only high-school mathematics background and being developed for the possible informatics major. CMPSCI 391A, Fall 2013 -- a one-credit honors seminar on Conway's game theory. CMPSCI 250, Spring 20",
  "content_length": 20929,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:29"
}