{
  "name": "David Hyde 0001",
  "homepage": "https://dabh.io",
  "status": "success",
  "content": "Home David Hyde Assistant Professor Department of Computer Science, Vanderbilt University dabh -at- alumni.stanford.edu Brief bio: David Hyde is an Assistant Professor of Computer Science at Vanderbilt University, with a secondary appointment as Assistant Professor of Engineering Management. He was first a Regents Scholar at UCSB, earning a B.S. in Mathematics with highest honors at age 19. Hyde then earned a Ph.D. in Computer Science (with Distinction in Teaching) from Stanford, where he was a DoD NDSEG Fellow and a Gerald J. Lieberman Fellow. He also earned M.S. degrees in computer science and applied math. Most recently, David was a PIC Assistant Adjunct Professor in the Department of Mathematics at UCLA. Hyde's research has been supported by organizations including DARPA, the Department of Energy, and the Army Research Lab. He is a recipient of the NSF CAREER award, the ORAU Ralph E. Powe Junior Faculty Enhancement Award, and was a SIAM Science Policy Fellow from 2022-2024. Hyde has also helped build successful technology companies and invests in startups via Brave Capital. Full CV available upon request. Research keywords: Computational Physics, Computer Graphics, Deep Learning, Cloud Computing, Cyberinfrastructure Research summary: Professor Hyde leads the Simulation, Optimization, and Learning (SOL) laboratory at Vanderbilt University. His group creates new algorithms and numerical methods for problems in and at the intersections of these three fields. A particular emphasis is on developing techniques for simulating physical phenomena that involve solids and fluids. These simulations are useful for engineering and computer graphics, as well as for providing data and constraints for learning-based systems. Hyde and his group also build cloud computing platforms, create scalable heterogeneous implementations of algorithms, and develop practical software, libraries, and datasets relevant to their research focus. The SOL lab ultimately seeks to illuminate the synergies between simulation, learning, and data, and to leverage these connections to solve complex real-world challenges. News/Media (2025-08-22) Thrilled to receive $1.6M in support from the NSF to build new software cyberinfrastructure for physical intelligence with my colleagues. Stay tuned! (2025-05-19) Thanks to Amanda Chin for the recent and timely interview on the risks of deepfakes and recent legislation. (2025-05-06) Excited to have won the Vanderbilt University School of Engineering Rising Star Research Award. A huge thank you to my collaborators, students, and colleagues! (2025-03-28) An amazing time hosting the Critical and Emerging Technology Summit at Vanderbilt University. Social post available to like and share. Thank you to everyone who participated and contributed! (2025-01-21) Happy to see that our PASC24 paper on learning-enhanced Boussinesq flow simulation is the most downloaded paper from the conference. (2025-01-16) Grateful to be interviewed on WKRN with Kenley Hargett about VPNs and online age verification laws. (2025-01-01) Thanks to Kenley Hargett and the WKRN team for the interview on the infamous Y2K bug. (2024-12-19) Honored to have won an NSF CAREER Award to support a new project on building cyberinfrastructure for emerging technologies like AI and quantum. (2024-12-17) Thank you to NVIDIA for awarding a number of GPUs to our lab via the Academic Grant program. (2024-10-11) So many insightful discussions at the SIAM Quantum Intersections Convening. Thank you to the co-organizers and to all the participants! (2024-10-08) Timely interview on recent cybersecurity incidents on The National Desk with Geoff Harris. Thank you for the opportunity! (2024-08-23) Ph.D. student Chang-Yong Song won a Best Poster Award for his poster at SCA 2024. Congratulations! (2024-07-16) Thanks to Geoff Harris and the team at The National Desk for the interview on cybersecurity around Amazon Prime Day. (2024-07-05) Great event on post-quantum cryptography at King's College Cambridge. Thank you to the hosts and organizers! (2024-05-24) Happy to be serving on the steering committee for the SIAM Quantum Intersections Convening happening this October. Please spread the word and apply to attend! (2024-05-15) Press release on our group's latest paper, to be presented at PASC24. (2024-05-01) Part II of our SIAM News series on applied mathematics and quantum computing is now available! Read the full issue here. (2024-04-01) Our SIAM News series on applied mathematics and quantum computing is now live! The full print issue is available here. Thanks to the SIAM Science Policy Fellowship for supporting this effort. (2023-10-20) Excited to begin a new NSF-funded project on extending our cloud computing work and applying it to computational glaciology. (2023-08-15) Nice coverage of our Seeding Success grant's success in helping us unlock NSF funding. Thank you! (2023-06-30) Excited to announce the receipt of the ORAU Ralph E. Powe Junior Faculty Enhancement Award to support a new project on sonoluminescence! (2023-03-20) Looking forward to hosting a minisymposium on deep learning, preconditioning, and linear solvers at ICIAM 2023. See you in Tokyo! (2022-06-28) Thankful for the support of a new Seeding Success grant to develop a novel cloud computing platform. More to come! (2022-01-07) Grateful to have received a SIAM Science Policy Fellowship to help with computational science and applied math advocacy for the next two years. (2021-05-10) My render from our latest paper is featured in (and the thumbnail of!) the SIGGRAPH 2021 Trailer. (2020-05-28) Small writeup of our award-winning CHI paper in the Stanford Engineering magazine. (2019-04-08) The main paper behind my thesis is now available online through JCP. (2018-10-04) Our review paper on deep learning and multiphase flow is one of the most downloaded recent articles in JCP! (2018-07-10) Honored to receive the Gerald J. Lieberman fellowship, one of twelve top graduate students across the entire university in terms of research, teaching, and service. More... Less... Publications PhysMorph-GS: Differentiable Shape Morphing via Joint Optimization of Physics and Rendering Objectives C. Song and D. Hyde PDF Cite Less is More: Data-Efficient Adaptation for Controllable Text-to-Video Generation S. Cheng, N. Kulkarni, D. Hyde, D. Smirnov PDF Cite Efficient Sliced Wasserstein Distance Computation via Adaptive Bayesian Optimization M. Acharya and D. Hyde PDF Cite Remotely Seeing Is Believing: How Trust in Cyber-Physical Systems Evolves Through Virtual Observation Z. Jin, K. Xiao, D. Hyde PDF Cite A New Algorithm for Applying Sequences of Affine Transformations in Quantum Circuits A. Giri, D. Hyde, K. Varga PDF Cite CUBAN: Leveraging Semantic Comparables to Predict Financial Metrics Using Textual Descriptions of Companies S. Bae and D. Hyde 2024 IEEE International Conference on Big Data (BigData), 2024 PDF Cite A Differentiable Material Point Method Framework for Shape Morphing M. Xu, C. Song, D. Levin, D. Hyde IEEE Transactions on Visualization and Computer Graphics, 2025 PDF Cite Automated Synthesis of Quantum Algorithms via Classical Numerical Techniques Y. Huang, B. Grossman-Ponemon, D. Hyde ACM Transactions on Quantum Computing, 2025 PDF Cite Code A Thermomechanical Hybrid Incompressible Material Point Method V. Kala, J. Chen, D. Hyde, A. Stomakhin, J. Teran PDF Cite Compelling ReLU Networks to Exhibit Exponentially Many Linear Regions at Initialization and During Training M. Milkert, D. Hyde, F. Laine Proceedings of the 42nd International Conference on Machine Learning, 2025-07 PDF Cite Code Anvil: An integration of artificial intelligence, sampling techniques, and a combined CAD-CFD tool H. Vardhan, U. Timalsina, M. Sandborn, D. Hyde, P. Volgyesi, J. Sztipanovits Proceedings of the Sixth Workshop on Design Automation for CPS and IoT (DESTION 2024), 2024 PDF Cite Toward Improving Boussinesq Flow Simulations by Learning with Compressible Flow N. Mangnike and D. Hyde PASC '24: Proceedings of the Platform for Advanced Scientific Computing Conference, 2024 PDF Cite Sample-Efficient and Surrogate-Based Design Optimization of Underwater Vehicle Hulls H. Vardhan, D. Hyde, U. Timalsina, P. Volgyesi, J. Sztipanovits Ocean Engineering, 2024-11 PDF Cite Code The Pandemic did not Interrupt LA's Violence Interrupters J. Ren, K. Santoso, D. Hyde, A. Bertozzi, P. Brantingham Journal of Aggression, Conflict and Peace Research, 2022 PDF Cite A Deep Conjugate Direction Method for Iteratively Solving Linear Systems A. Kaneda, O. Akar, J. Chen, V. Kala, D. Hyde, J. Teran Proceedings of the 40th International Conference on Machine Learning, 2023 PDF Cite Code A Robust Grid-Based Meshing Algorithm for Embedding Self-Intersecting Surfaces S. Gagniere, Y. Han, Y. Chen, D. Hyde, A. Marquez-Razon, J. Teran, R. Fedkiw Computer Graphics Forum, 2023 PDF Cite Cross-Technology Innovation Trends and Evidence with Patent and Funding Data D. Hyde and E. Fu World Patent Information, 2022 PDF Cite Note Note(s) Previously published as a conference paper at ISPIM Connects Valencia, 2021. The conference version is available here and may be cited as@inproceedings{crosstechnology,     author={David Hyde and Ernestine Fu},     title={Cross-Technology Innovation Trends and Evidence with Patent and Funding Data},     booktitle = {ISPIM Connects Valencia},     year = {2021},     pages = {},     doi={},     publisher = {LUT University},     address = {Lappeenranta, Finland},     location = {Valencia, Spain}} Close A Momentum-Conserving Implicit Material Point Method for Surface Tension with Contact Angles and Spatial Gradients J. Chen, V. Kala, A. Marquez-Razon, E. Gueidon, D. Hyde, J. Teran ACM TOG (SIGGRAPH 2021 Technical Papers), 2021 PDF Cite Media Extra Emotion Classification and Textual Clustering Techniques for Gang Intervention Data R. Wu, C. Yang, D. Hyde, A. Bertozzi, P. Brantingham Data Science for Smart and Connected Communities Workshop, I",
  "content_length": 14086,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:10"
}