{
  "name": "David Doty",
  "homepage": "http://www.cs.ucdavis.edu/~doty",
  "status": "success",
  "content": "David Doty Homepage David Doty Home Publications Software Students CV Contact Information Professor Department of Computer Science University of California, Davis Office: 2069 Academic Surge Lab: 2306 Academic Surge Interested in working with me to do research? Read here. Research Interests Molecular computing (algorithmic self-assembly, chemical reaction networks, DNA nanotechnology) Theoretical computer science (distributed computing, algorithmic information theory) I am broadly interested in problems at the intersection of physics, chemistry, biology, and computation. By this I do not mean the traditional \"computation in service of natural science\" (e.g., bioinformatics, computational chemistry, or molecular dynamics simulation). Rather, certain molecular systems — such as a test tube of reacting chemicals, a genetic regulatory network, or a growing crystal — can be interpreted as doing computation themselves... natural science in service of computation, if you will. I want to understand the fundamental logical and physical limits to computation by such means. I have worked in algorithmic self-assembly, such as the tile assembly model developed by Erik Winfree, and computation using chemical reactions. DNA nanotechnology, pioneered by Ned Seeman, is a field focused on using artificial DNA strands to assemble nanoscale structures and dynamic systems such as logical circuits. Experimental work in that field informs many of the questions that interest me. Furthermore, there are deep connections between realistic physical models and existing models of computation. For example, chemical reaction networks are related to a model of distributed computing known as population protocols (as well as an older model of concurrent processes known as Petri nets), and the tile assembly model has connections to Wang tiling and cellular automata. Teaching Note that if you are a UC Davis student, although the Canvas course pages below are public, if you are not enrolled in a current offering of the course, you need to log out of Canvas to view the public pages. ECS 120: Theory of Computation (UG), slides, videos, F25, F24, W24, W23, F21, S21, S20, W19, W18, S17, F15 ECS 220: Theory of Computation (G), videos, W25, W24, W23, S21, S20, W19, W17 ECS 232: Theory of Molecular Computation (G), videos, F25, W25, F23, S23, W21, W18, W16 Automaton simulator: This application is used for my ECS 120 course.",
  "content_length": 2422,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:51"
}