{
  "name": "David Saldaña",
  "homepage": "http://davidsaldana.co",
  "status": "success",
  "content": "SwarmsLab – Robotics Laboratory Welcome to the SwarmsLab Recent news – NSF CAREER Award: From nature to complex aerial manipulation PI David Saldaña receives the NSF CAREER Award to advance aerial robotics capable of manipulating flexible objects and adapting to shifting forces in midair. – Lehigh Swarms winning DTR Fall 2024 at Indiana University Generational development leads Team Lehigh Swarms to victory at IU, right where they started to participate in the competition two and a half years ago. – Lehigh CHOICES program with Swarmslab A cool introduction to robotics engineering for middle-school girls, amplified by hands-on experience with real robots! – Defend the Republic Spring 2024 Lehigh Swarms won the MVP of DTR Event 8 among 10 universities During the competition, Swarmslab presented Mochi 3.0 — the swarm-ready miniature blimp that is capable of fully autonomous capturing and scoring collaboratively, and scored the most points in a match. – Defend the Republic Fall 2023 The blimp competition at Lehigh, organized by SwarmsLab! SwarmsLab is honored to have the chance to host DTR this fall, competing against 7 other universities at our homefield, the mountaintop campus of Lehigh University. – Defend the Republic A quidditch-like competition involving blimps The team of Lehigh, featuring David Sladaña, Liz Muñoz, Karen Li, Edward Jeffs, Leonardo Santens, Shuhang Hou, Jiawei Xu, and Diego S. D’Antonio. Our team was able to  qualify prior to all other teams, and won the third place on our second-time appearance! – FIRST WORKSHOP ON ROBOT VERSATILITY 2022 One day of talks, posters, and demos at the Autonomous and Intelligent Robotics Laboratory -AIRLab-, Lehigh University, Bethlehem, PA. During the event, we had five presentations from top researchers in robotics, presenting their perspective and ideas in this area. The agenda can be found here. Click here for the media archive. – Resolve Magazine Spring 2021 Issue The Sicence ot Autonomy: In Building C on Lehigh’s Mountaintop Campus, a new facility has taken shape. With a high ceiling and transparent glass walls, it’s a hive of sorts, enclosed partly as a way to dampen the whir, hum, and drone of robots operating both on the ground and in the air. Welcome to …. Read more Media – Swarmslab members to present published papers and live robot demonstrations at ICRA 2025 in Atlanta Along with alumni, students, and faculties from Lehigh AIRLab. We have two papers The Spinning Blimp: Design and Control of a Novel Minimalist Aerial Vehicle MochiSwarm: A testbed for robotic micro-blimps in realistic environments – Swarmslab welcomes middle-school girls from CHOICES program by Creatives of Lehigh, hosting a hands-on mini competition using our robotic blimps – “Defend the Republic” competition Event 8, Spring 2024 Lehigh highlights – “Defend the Republic” competition, covered by Lehigh Media – Presentation of newly accepted paper in IROS 2023, Detroit SBlimp: Design, Model, and Translational Motion Control for a Swing-Blimp by Jiawei Xu, Diego S. D’Antonio, Dominic J. Ammirato, and David Saldaña – Accepted papers to present in ICRA 2023, London Finding Optimal Modular Robots for Aerial Tasks by Jiawei Xu and David Saldaña – ICRA 2023 Forming and Controlling Hitches in Midair Using Aerial Robots by Diego S. D’Antonio, Subhrajit Bhattacharya, and David Saldaña – Lehigh Engineering: Using robots to help people – Penn Today: GRASP Lab’s high-flying robots. – ModQuad in ACM Communications: Saving lives with aerial drones. – ModQuad in Discovery Channel Canada: Our reseach team presents some experiments in Daily Planet TV Show. Projects © 2021 SwarmsLab. All rights reserved saldana at lehigh.edu113 Research Dr Bethlehem, PA18015TwitterYoutubeGithub",
  "content_length": 3753,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:04"
}