{
  "name": "David J. Pym",
  "homepage": "http://www0.cs.ucl.ac.uk/staff/D.Pym",
  "status": "success",
  "content": "Prof. David J. Pym Prof. David J. Pym UCL and Institute of Philosophy, School of Advanced Study, University of London Basics and Contacts Prof. David J. Pym, PhD (Edin), MA, ScD (Cantab), CMath FIMA, CITP FBCS, FRSA Professor of Information, Logic, and Security at UCL. Honorary Research Fellow and Director (jointly with Corine Besson) of the Centre for Logic, Language, and Information (CeLLI), Institute of Philosophy, School of Advanced Study, University of London. Director of UCL's Centre for Doctoral Training in Cybersecurity. Currently based at: University of London School of Advanced Study Institute of Philosophy Senate House Malet Street London WC1E 7HU David's personal website. David's Institute of Philosophy page david.pym (at) sas.ac.uk UCL address: University College London Department of Computer Science Department of Philosophy (Affiliated Faculty) Gower Street London WC1E 6BT d.pym (at) ucl.ac.uk Brief Bio and Short CV I am a logician, mathematician, and informatician. My research is mainly in logic, where I work in pure logic, including: (i) Proof-theoretic semantics, also known in logic as the theory of meaning, and its inferentialist philosophical context, addressing mathematical, philosophical, and computational aspects of logical concepts such as proof-theoretic validity, base-extension semantics, and information, including approaches from categorical logic (see The PTS-Network for lots of links). (ii) The proof theory and semantics of reductive logic and proof-search — see, for example, Reductive Logic: Proof Theory, Semantics, and Control, by David Pym and Eike Ritter, Oxford Logic Guides. A more recent study in this area is by Alexander Gheorghiu and David Pym, Semantic Foundations of Reductive Reasoning, Topoi, 2025: https://link.springer.com/article/10.1007/s11245-025-10211-6. (iii) The semantics, proof theory, and applications — especially in resource semantics and systems modelling — of bunched logics and modal logics. I also work on developing logic-based methods as a mathematical modelling technology for reasoning about systems, security, and behaviour (see, for example, the EPSRC-funded project IRIS). I am particularly interested in the philosophy and methodology of modelling. I am beginning to develop logic-based approaches to a semantic theory of information (in the philosophical spirit of situation theory) from the inferentialist perspective of proof-theoretic semantics. I was recently privileged to be invited to give the 2024 BCS FACS Peter Landin Semantics Seminar, in which I introduced some ideas about proof-theoretic semantics: report by Brian Monahan and Bill Stoddart. I have also worked in information security, where I work in - the philosophy and methodology of security - security economics and policy, and - systems security modelling, with a focus on individual, organizational, and societal security behaviours. Together with my colleague Prof. Tyler Moore, I am Editor-in-Chief of OUP's Journal of Cybersecurity. While my main research interests lie in the foundations of logic, as described above, my overall perspective unifies these aspects of my work: I am interested in developing foundations, frameworks, theories, and tools for understanding and reasoning about the complex socio-economic-technical systems that define and support our world. My contributions over the years have been mainly in the following areas: dependent type theory and logical frameworks, including proof theory, semantics, and a unification algorithm; reductive logic and proof-search, including proof theory and semantics, for classical intuitionistic, and substructural logics; categorical models of the classical sequent calculus and its theory of cut-reduction; the bunched logic BI and its relatives, including proof theory, semantics, algebraic theory, computational interpretations, including Separation Logic, and security; distributed systems modelling based on resource semantics and process algebra; modal and epistemic bunched logics and layered graph logics, with applications in access control; utility-theoretic concepts in distributed systems modelling and process algebra, with applications in systems security modelling; trust domains; information security economics; the philosophy and methodology of information security; public policy in information security, including information stewardship. I have broad experience of research, teaching, and management in leading universities and in industry. Trust me, I'm a logician. Information David's Institute of Philosophy page Short CV Recent and Selected Publications Current Drafts and Recent Papers Earlier Logic and Systems Modelling Earlier Security and Policy A summary of more recent papers on the completeness of the Logic of Bunched Implications: BI completeness papers Older Publications Logic Other Books PhD Students Current Graduated Research Grants Leverhulme Trust Research Project Grant: An ecumeni- cal approach to proof-theoretic semantics: ECUMENICAL. EU Marie Sklodowska-Curie RISE Project: MOSAIC. EPSRC Programme Grant IRIS EPSRC Research Grant ReLiC Previously funded by the UK's EPSRC, the UK's Technology Strategy Board, the EU, the Royal Society, and the British Council Institute of Philosophy UCL Information Security Teaching UCL and Institute of Philosophy Roles Editorial Roles News Events Film Other",
  "content_length": 5367,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:17"
}