{
  "name": "David Hsu",
  "homepage": "http://www.comp.nus.edu.sg/~dyhsu",
  "status": "success",
  "content": "David Hsu's Home Page Provost's Chair Professor Department of Computer Science Director Smart Systems Institute School of Computing National University of Singapore 13 Computing Drive Singapore 117417 Republic of Singapore Office: Bldg. COM3, Rm. 02-07 Fax: +65 6779-4580 Web: http://adacomp.comp.nus.edu.sg/ To prospective applicants: We are looking for researchers and students to work on exciting research on robot algorithms and systems for planning, learning, and human-robot interaction. We welcome applicants with diverse technical and cultural backgrounds. We are excited to have you join us if you are driven to explore new ideas and are passionate about research. If you are looking for internship opportunities, please submit your application here and indicate your interest in Adaptive Computing Lab. Biography David Hsu is a Provost's Chair Professor in the Department of Computer Science, National University of Singapore (NUS) and the Director of Smart Systems Institute. He received BSc in computer science & mathematics from The University of British Columbia and PhD in computer science from Stanford University. At NUS, he co-founded NUS Advanced Robotics Center in 2013. He founded the NUS AI Laboratory (NUSAIL) in 2019 and served as the founding director. He held visiting positions in MIT Aeronautics & Astronautics Department, CMU Robotics Institute, and Oxford Robotics Institute. He is an IEEE Fellow. His research interests span robotics, AI, and computational structural biology. In recent years, he has been working on robot planning and learning under uncertainty and human-robot collaboration. His work won multiple international awards, including, most recently, Test of Time Award at Robotics: Science & Systems (RSS) in 2021 and JCAI-JAIR Best Paper Prize in 2022. More information on his research is available on the Adaptive Computing Lab (AdaComp) web site. He has chaired or co-chaired several major international robotics conferences, including WAFR 2004 and 2010, RSS 2015, ICRA 2016, and CoRL 2021. He also served on the editorial boards of IEEE Transactions on Robotics, International Journal of Robotics Research, and Journal of Artificial Intelligence Research. Recent Activities Advisory Board Member, Intentional Journal of Robotics Research, 2023 -- present Associate Editor, Intentional Journal of Robotics Research, 2019 --2022 IJCAI-JAIR Best Paper Prize, 2022 Test of Time Award, Robotics: Science & Systems (RSS), 2021 Program Co-Chair, Conference on Robot Learning (CoRL), 2021 Editorial Board Member, Journal of Artificial Intelligence Research, 2011 -- 2021 The mediocre teacher tells. The good teacher explains. The superior teacher demonstrates. The great teacher inspires. ---William Arthur Ward Last modified: Mon Jan 6 22:47:21 +08 2025",
  "content_length": 2796,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:11"
}