{
  "name": "David A. Cohen",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/dave-cohen_1ba463a9-f2cb-4704-a179-ed7038a2fe9c.html",
  "status": "success",
  "content": "David Cohen - Royal Holloway Research Portal View Scopus Profile David Cohen Professor Emeritus Professor (Computer Science), Department of Computer Science Phone+44 1784 443692EmailD.Cohenrhul.acuk TW20 0EX Personal profile Personal profileProf. David Cohen does research on the theory of constraint satisfaction. More generally he is interested in the development and analysis of algorithms for improving the effectiveness of industrialprocesses, for example, access control, frequency assignment, workflow, andvehicle routing. He would welcome applications from prospective PhD students on any aspect of the theory of constraints or valued constraints. In work in any of the following domains: 1) How representation affects efficiency. 2) Which conservative languages are FPT (WSP) 3) Characterising small tractable forbidden patterns 4) Studying the clone lattice and fractional polymorphisms in general 4) Proving the exact complexity of specific CSP languages 5) Considering well know algorithms and how they are affected by particular common changes of representation Please feel free to contact Prof. Cohen to discuss these topics. Funding is always available for good candidates. KeywordsComputer scienceArtificial intelligenceConstraint SatisfactionComputational science foundationsAlgorithmsComplexityFPT Research output 29 Article 26 Paper 7 Working paper 5 Conference contribution 4 More 4 Chapter Research output per year Research output per year A Test for TractabilityJeavons, P. G., Cohen, D. A. & Gyssens, M., 1996, p. 267-281.Research output: Contribution to conference › Paper Derivation of Constraints and Database RelationsCohen, D. A., Gyssens, M. & Jeavons, P. G., 1996, p. 134-148.Research output: Contribution to conference › Paper A unified theory of structural tractability for constraint satisfaction problemsCohen, D., Jeavons, P. & Gyssens, M., Aug 2008, In: Journal of Computer and System Sciences. 74, 5, p. 721-743 23 p.Research output: Contribution to journal › Article › peer-review Symmetry definitions for constraint satisfaction problemsCohen, D., Jeavons, P., Jefferson, C., Petrie, K. & Smith, B., 2006, In: Constraints. 11, p. 115-137 23 p.Research output: Contribution to journal › Article › peer-review An Algebraic Theory of Complexity for Valued Constraints: Establishing a Galois ConnectionCohen, D. A., Creed, P., Jeavons, P. G. & Živný, S., 2011, Mathematical Foundations of Computer Science 2011: 36th International Symposium, MFCS 2011, Warsaw, Poland, August 22-26, 2011: Proceedings. Springer, p. 231-242 (Lecture Notes in Computer Science; vol. 6907).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution View all 71 research outputs Projects 6 Finished Projects per year Analyzing Security-aware Workflows (funded by Leverhulme Trust)Gutin, G. (PI), Crampton, J. (CoI) & Cohen, D. (CoI)1/01/19 → 31/12/21Project: Research Constraint Network Tractability: Beyond Structure and LanguageCohen, D. (PI)Eng & Phys Sci Res Council EPSRC31/05/14 → 30/05/17Project: Research Parameterized Algorithmics for the Analysis and Verification of Constrained Workflow SystemsGutin, G. (PI), Cohen, D. (CoI) & Crampton, J. (CoI)Eng & Phys Sci Res Council EPSRC1/02/13 → 1/05/16Project: Research The complexity of valued constraintsCohen, D. (PI)Eng & Phys Sci Res Council EPSRC1/10/07 → 1/10/10Project: Research Groebner Basis Techniques for Constraint Satisfaction ProblemsCohen, D. (CoI) & Jeavons, P. (PI)30/03/06 → 30/03/09Project: Research View all 6 projects Activities 1 Participation in a conference Activities per year CP2010Cohen, D. (Chair)6 Sept 2010 → 10 Sept 2010Activity: Participating in or organising an event › Participation in a conference Prizes College Team Teaching PrizeMatos, C. (Recipient), Cohen, D. (Recipient) & Kinder, J. (Recipient), 2015Prize: Prize (including medals and awards) CP05 Conference PrizeCohen, D. (Recipient), 1 Oct 2005Prize: Prize (including medals and awards) EPSRC CollegeCohen, D. (Recipient), 2005Prize: Appointment IJCAI 2003 Best Paper AwardCohen, D. (Recipient), 11 Aug 2003Prize: Prize (including medals and awards) Kanellakis prizeCohen, D. (Recipient), 19 Aug 1996Prize: Prize (including medals and awards)",
  "content_length": 4235,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:29"
}