{
  "name": "David Novick",
  "homepage": "http://utep.academia.edu/DavidNovick",
  "status": "success",
  "content": "David Novick - University of Texas at El Paso (UTEP) Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless David NovickUniversity of Texas at El Paso (UTEP), Computer Science, Faculty MemberaddFollowdoneFollowingFollowers112Following43Co-authors21Public ViewsRelated Authors Richard Tabor GreenePUT Julita VassilevaUniversity of Saskatchewan John F DooleyKnox College Jonathan GratchUniversity of Southern California Roshan ChitrakarNepal College of Information Technology Lev ManovichGraduate Center of the City University of New York rudolph bauerWashington Center for Consciousness Studies PALIMOTE JUSTICERIVERS STATE POLYTECHNIC Christopher CrickOklahoma State University Andrej DujellaUniversity of ZagrebInterests UploadsPapers by David NovickRight and Wrong in Educational ComputingSIG bulletin, Oct 1, 1984ABSTRACT 1 An Adapted Microsoft TutorialThe consensus of the documentation literature is that users rarely use help, usually preferring t... more The consensus of the documentation literature is that users rarely use help, usually preferring to muddle through. To increase use of help, tutorials for novice users could be changed from guided presentations toward using the system’s actual help system. To determine whether this approach would increase users’ use of help when they encountered problems with an application, we developed an alternative, help-based tutorial introduction to Microsoft Publisher. We compared the behaviors of users introduced to Publisher with the help-based tutorial with the behaviors of users who learned from a traditional tutorial. A balanced study of 22 novice users of Publisher suggests that using a help-based tutorial leads to significantly greater use of help systems when users encounter problems. However, the data also suggest that the increased use of help may not lead to more effective task performance.Download Building Rapport with Extraverted and Introverted AgentsLecture Notes in Electrical Engineering, 2018Psychology research reports that people tend to seek companionship with those who have a similar ... more Psychology research reports that people tend to seek companionship with those who have a similar level of extraversion, and markers in dialogue show the speaker's extraversion. Work in human-computer interaction seeks to understand creating and maintaining rapport between humans and ECAs. This study examines if humans will report greater rapport when interacting with an agent with an extraversion/introversion profile similar to their own. ECAs representing an extrovert and an introvert were created by manipulating three dialogue features. Using an informal, task-oriented setting, participants interacted with one of the agents in an immersive environment. Results suggest that subjects did not report the greatest rapport when interacting with the agent most similar to their level of extraversion.Download Gaze, turn-taking and proxemics in multiparty versus dyadic conversation across culturesUMI, ProQuest ® Dissertations & Theses. The world&#x27;s most comprehensive collection of dissert... more UMI, ProQuest ® Dissertations & Theses. The world&#x27;s most comprehensive collection of dissertations and theses. Learn more... ProQuest, Gaze, turn-taking and proxemics in multiparty versus dyadic conversation across cultures. ...Download RAPID PROTOTYPING OF SPOKEN LANGUAGE SYSTEMS: THE YEAR 2000 CENSUS PROJECTCole, Ronald A., et al. \"Rapid prototyping of spoken language systems: The year 2000 census project.\" Proceedings of the International Symposium on Spoken Dialogue, 1993In this paper, we describe a rapid-prototyping approach to developing spoken language systems (SL... more In this paper, we describe a rapid-prototyping approach to developing spoken language systems (SLSs). This new design methodology facilitates more usable and quickly implemented SLSs. Moreover, it allows SLS developers to address the delicate balance between designing dialogues that are sufficiently constraining to meet current speech recognition capabilities, yet feel natural and intuitive to the user. This rapid-prototyping methodology was developed in the service of a project to determine the feasibility of using SLSs for the Year 2000 Census in the United States.Download RAPID PROTOTYPING OF SPOKEN LANGUAGE SYSTEMS: THE YEAR 2000 CENSUS PROJECTby Brian Hansen and David NovickIn this paper, we describe a rapid-prototyping approach to developing spoken language systems (SL... more In this paper, we describe a rapid-prototyping approach to developing spoken language systems (SLSs). This new design methodology facilitates more usable and quickly implemented SLSs. Moreover, it allows SLS developers to address the delicate balance between designing dialogues that are sufficiently constraining to meet current speech recognition capabilities, yet feel natural and intuitive to the user. This rapid-prototyping methodology was Towards automatic collection of the US censusby Brian Hansen and David NovickProceedings of ICASSP '94. IEEE International Conference on Acoustics, Speech and Signal Processing, 1994ABSTRACT We describe a study to determine the feasibility of using automatic speech recognition t... more ABSTRACT We describe a study to determine the feasibility of using automatic speech recognition to collect information over the telephone for the Year 2000 Census in the United States. The stages of research are protocol development, speech data collection and transcription, ... Limiting Factors of Automated Telephone Dialoguesby Brian Hansen and David NovickHuman Factors and Voice Interactive Systems, 1999 Rapid prototyping of spoken language systems: The year 2000 census projectby Brian Hansen and David NovickIn this paper, we describe a rapid-prototyping approach to developing spoken language systems (SL... more In this paper, we describe a rapid-prototyping approach to developing spoken language systems (SLSs). This new design methodology facilitates more usable and quickly implemented SLSs. Moreover, it allows SLS developers to address the delicate balance between designing dialogues that are sufficiently constraining to meet current speech recognition capabilities, yet feel natural and intuitive to the user. This rapid-prototyping methodology was Systematic design of spoken promptsby Brian Hansen and David NovickProceedings of the SIGCHI conference on Human factors in computing systems common ground - CHI '96, 1996Designers of system prompts for interactive spokenlanguage systems typically seek 1) to constrain... more Designers of system prompts for interactive spokenlanguage systems typically seek 1) to constrain users so that they say things that the system can understand accurately and 2) to produce \"natural\" interaction that maximizes users' satisfaction. Unfortunately, these goals are often at odds.Download Evaluating the effectiveness of dialogue for an automated spoken questionnaireby Brian Hansen and David NovickWe present and apply an empirical methodology for evaluating the effectiveness of dialogues in sp... more We present and apply an empirical methodology for evaluating the effectiveness of dialogues in spoken language systems. This methodology is suitable in particular for evaluation of dialogue-based systems that collect information from the user, such as an automated spoken questionnaire. Our method for assessing effectiveness involves coding answers from users for responsiveness. For this effort, we developed a behavioral coding scheme tailored to the requirements of automated spoken questionnaires interacting via the telephone. The codes cover t range of behavior from \"Concise\" to \"No re.,aponse.\"Download Coordinating Turn-Taking With Gazeby Brian Hansen and David NovickFourth International Conference on …, 1996This paper explores the role of gaze in coordinating turn-taking in mixed-initiative conversation... more This paper explores the role of gaze in coordinating turn-taking in mixed-initiative conversation and specifically how gaze indicators might be usefully modeled in computational dialogue systems. We analyzed about 20 minutes of videotape of eight dialogues by four pairs of ...Download The Market SceneThis demonstration presents &quot;The Market Scene,&quot; a virtual-reality scene in which the us... more This demonstration presents &quot;The Market Scene,&quot; a virtual-reality scene in which the user interacts with multiple virtual agents and initiates conversations with these agents via proxemics and gaze. The application is implemented in Unity with the VAIF authoring tool for rapid development of social agents. In the Market Scene, the user learns the background of the &quot;Gods of the Neon City&quot; adventure story through interaction in a crowded market rather than by listening to a narrator. The application demonstrates a form of mixed-initiative interaction, in that the user can initiate a conversation by coming near to and gazing at an agent, and an agent can initiate a conversation if a user approaches. Virtual Agent Interaction Framework (VAIF): A Tool for Rapid Development of Social AgentsCreating an embodied virtual agent is often a complex process. It involves 3D modeling and animat... more Creating an embodied virtual agent is often a complex process. It involves 3D modeling and animation skills, advanced programming knowledge, and in some cases artificial intelligence or the integration of complex interaction models. Features like lip-syncing to an audio file, recognizing the users&#39; speech, or having the character move at certain times in certain ways, are inaccessible to researchers that want to build and use these agents for education, research, or industrial uses. VAIF, the Virtual Agent Interaction Framework",
  "content_length": 16999,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:52"
}