{
  "name": "David Fouhey",
  "homepage": "https://cs.nyu.edu/~fouhey",
  "status": "success",
  "content": "David Fouhey David Fouhey Quick info: CV Google Scholar Email: david.fouhey@nyu.edu (Please read about Admissions or RA/TA/GA positions) Physical Locations: You can find me at either: 60 Fifth Avenue, New York, NY 10011 370 Jay Street, Brooklyn, NY 11201 Name Pronunciation FAQ: `foe'-`eee', rhyming with snowy or Joey. The key is to forget how it is spelled. It (but not me) is from County Cork, Ireland. Photos: One picture is hard to identify a person with. Here are some more (but dated). Summary: I am an Institute Associate Professor of Computer Science and Electrical and Computer Engineering. Previously, I was an assistant professor at University of Michigan and a postdoc at UC Berkeley (with Alyosha Efros and Jitendra Malik). I received a Ph.D. in Robotics from CMU (with Abhinav Gupta and Martial Hebert). I work on learning-based computer vision, with a particular focus on systems that reliably estimate physical properties and dynamics from images. This has led to three interrelated interests: Measurements for the Sciences: An immensely promising area for computer vision is providing new sensors and capabilities to other disciplines. Successful work here requires long-term partnership and collaborations. I have worked in solar physics and evolutionary ecology. Solar missions that I've provided expertise to include SDO and MUSE. 3D from Pictures: For the past 15+ years, I've built systems that produce 3D from images, with a focus on how to ideally use multiple images and how to best incorporate our knowledge of the problem. Interaction: Images depict a world of possibility in which one can act. I am interested in developing systems that reliably understand how humans interact with objects, including systems for finding hands and reconstructing them. Students Teaching Publications Misc. Fun Student Collaborators Postdoc: Dr. Jacob Berv, Schmidt AI in Science Postdoc (Co-advised with Brian Weeks) Current PhD student collaborators: Dandan Shan, Sep 2020 — present, previously ECE MS Student with me, Rackham International Student Fellowship winner Sarah Jabbour, Sep 2020 — present, (co-advised with Jenna Wiens) Linyi Jin, May 2021 — present, previously Robotics MS student with me Ruoyu Wang, Sept 2023 — present, previously Undergrad (CS+Physics) with me Denis Akola, July 2024 — present Yidan Gao, Sept 2024 — present (co-advised with Daniele Panozzo) Joseph Tung, Sept 2024 — present Samuel Pérez-Díaz, Starting January 2025 PhD Graduates: Dr. Shengyi Qian, July 2024. Next position: Research Scientist, Meta Fundamental AI Research (FAIR) Dr. Nilesh Kulkarni, August 2024. Co-advised with Justin Johnson. Next position: Research Scientist, Netflix Dr. Richard Higgins, January 2025. Next Position: Softmax Dr. Chris Rockwell, June 2025. Co-advised with Justin Johnson. Next Position: Stealth-mode startup I am also proud of my past student UG/MS collaborators who are off doing great things elsewhere! For a complete list, please see my CV. Teaching NYU: Spring 2025: Computer Vision for Science & Engineering Fall 2024: Selected Topics in Signal Processing: Advanced Topics in Computer Vision Spring 2024: Computer Vision for Science & Engineering University of Michigan: while I no longer teach at UM, I am keeping an archived version of the final form of each course in case they are useful for others. EECS 542 (Advanced Topics in Computer Vision — i.e., let's read papers and discuss where vision is heading) Fall 2021 (53 students), Fall 2020 (50 students) EECS 442 (Computer Vision — i.e., let's learn about computer vision): Winter 2023 (280 students), Winter 2022 (300 students), Winter 2021 (With Justin Johnson) (329 students), Fall 2019 (155 students), Winter 2019 (151 students) EECS 598 (Special Topics: The Ecological Approach to Visual Perception — i.e., let's talk about how embodiment and vision relate): Winter 2020 (31 students) AI4All (a two-week residential program for high schoolers): Summers 2022, 2021, 2020, 2019 Intro to CSE Grad Research (our first year of grad school cohort-building + grad school skills seminar): Fall 2020, 2021, 2022 Selected Publications For a full publication list, please see my Google Scholar Profile. 2025 Rudy Morel, Francesco Pio Ramunno, ... KD Leka, Francois Lanusse, David Fouhey, Shirley Ho Predicting partially observable dynamical systems via diffusion models with a multiscale inference scheme Accepted, NeurIPS David Fouhey and KD Leka Learning to Estimate Photospheric Vector Fields from Line-of-Sight Magnetograms Accepted, ApJ [Arxiv] Brian C. Weeks, Zhizhuo Zhou, Charlotte M. Probst, Jacob S. Berv, Bruce O’Brien, Brett W. Benz, Heather R. Skeen, Mark Ziebell, Louise Bodt, and David F. Fouhey Skeletal trait measurements for thousands of bird species Nature Scientific Data: 884, 2025 [Open Access] Linyi Jin, Richard Tucker, Zhengqi Li, David Fouhey, Noah Snavely*, Aleksander Hołyński* Stereo4D: Learning How Things Move in 3D from Internet Stereo Videos CVPR 2025 [Project Page] Chris Rockwell, Joseph Tung, Tsung-Yi Lin, Ming-Yu Liu, David F. Fouhey, Chen-Hsuan Lin Dynamic Camera Poses and Where to Find Them CVPR 2025 [Project Page] Brian C. Weeks, Christina Harvey, Joseph A. Tobias, Catherine Sheard, Zhizhuo Zhou, David F Fouhey Longer Wing Bones in Warmer Climates Suggest a Role of Thermoregulation in Bird Wing Evolution [Open Access PDF] 2024 Sarah Jabbour, Gregory Kondas, Ela Kazerooni, Michael Sjoding, David Fouhey, Jenna Wiens DEPICT: Diffusion-Enabled Permutation Importance for Image Classification Tasks ECCV 2024 If you're careful about it, you can use diffusion models to let you perform classic permutation importance testing (as in Random Forests), but on image classifiers. Ruoyu Wang, David Fouhey, Richard Higgins, Spiro K. Antiochos, Graham Barnes, J. Todd Hoeksema, K.D. Leka, Yang Liu, Peter W. Schuck, Tamas I. Gombosi SuperSynthIA: Physics-Ready Full-Disk Vector Magnetograms from HMI, Hinode, and Machine Learning To appear in the Astrophysical Journal, 2024 We produce solar magnetograms combining the best features of multiple instruments and producing data products that can be immediately used in downstream systems (e.g., surface flux transport or solar wind forecasting) [Project Page] [Code] [Paper] Chris Rockwell, Nilesh Kulkarni, Linyi Jin, JJ Park, Justin Johnson, David Fouhey FAR: Flexible, Accurate and Robust 6DoF Relative Camera Pose Estimation CVPR 2024 [Project Page] [Code] By combining deep learning with classic geometry in the right way, you can get a method that's super accurate like geometry, but robust like learning-based methods Linyi Jin, Nilesh Kulkarni, David Fouhey 3DFIRES: Few Image 3D REconstruction for Scenes with Hidden Surface CVPR 2024 [Project Page] [Arxiv (PDF)] You can train a model to take one or a few posed images as input and produce scenes, including hidden surfaces Georgios Pavlakos, Dandan Shan, Ilija Radosavovic, Angjoo Kanazawa, David Fouhey, Jitendra Malik Reconstructing Hands in 3D with Transformers CVPR 2024 [Project Page] Scaling models + data up works really well for reconstructing hands in 3D 2023 Sarah Jabbour, David Fouhey, Stephanie Shepard, Thomas S. Valley, Ella A. Kazerooni, Nikola Banovic, Jenna Wiens, Michael W. Sjoding Measuring the Impact of AI in the Diagnosis of Hospitalized Patients A Randomized Clinical Vignette Survey Study JAMA 330(23) Showing explanations doesn't help clinicians recover from being negatively influenced by systematically biased models. Tianyi Cheng*, Dandan Shan*, Ayda Sultan, Richard Higgins, David Fouhey Towards A Richer 2D Understanding of Hands at Scale NeurIPS 2023 [Project Page] [Code] [Data] New dataset, tasks, and model for understanding more complex hand interactions, including bimanual manipulation and tool use Vadim Tschernezki*, Ahmad Darkhalil*, Zhifan Zhu*, David Fouhey Iro Laina Diane Larlus Dima Damen Andrea Vedaldi EPIC Fields Marrying 3D Geometry and Video Understanding NeurIPS Datasets & Benchmarks 2023 [Project Page] Accurate camera poses for EPIC Kitchens leads to a number of exciting new challenges Shengyi Qian, David Fouhey Understanding 3D Object Interaction from a Single Image. ICCV 2023 [Project Page] We use human judgments to get a first pass understanding of potential interaction in 3D from a single image Richard Higgins, David Fouhey MOVES: Moving Objects in Video Enable Segmentation CVPR 2023 [Project Page] Disagreement with a really simple background model provides surprisingly effective pseudolabel cues for performing grouping and hand-object association Nilesh Kulkarni, Linyi Jin, Justin Johnson, David Fouhey Learning to Predict Scene-Level Implicit 3D from Posed RGBD Data CVPR 2023 [Project Page] We can learn to predict implicit function-based 3D from posed RGBD. Linyi Jin, Jianming Zhang, Yannick Hold-Geoffroy, Oliver Wang, Kevin Matzen, Matthew Sticha, David Fouhey Perspective Fields for Single Image Camera Calibration CVPR 2023 (Highlight -- 2.5% accept rate) [Project Page] We develop a effective representation for camera geometry that distributes the parameters throughout the image, resulting in robustness and lots of fun applications David F. Fouhey, Richard E.L. Higgins, Spiro K. Antiochos, Graham Barnes, Marc DeRosa, J. Todd Hoeksema, K.D. Leka, Yang Liu, Peter W. Schuck, Tamas I. Gombosi Large-Scale Spatial Cross-Calibration of Hinode/SOT-SP and SDO/HMI Accepted in The Astrophysics Journal Supplement Series [Arxiv] We fix a more than decade-long issue with pointing and pixel scale in the spectropolarimeter onboard Hinode (which gets cold during eclipse season) 2022 Ahmad Darkhalil*, Dandan Shan*, Bin Zhu*, Jian Ma*, Amlan Kar, Richard E.L. Higgins, Sanja Fidler, David F. Fouhey, Dima Damen. EPIC-KITCHENS VISOR Benchmark: VIdeo Segmentations and Object Relations NeurIPS Datasets and Benchmarks 2022 [Paper and Reviews] [Project Webpage] [Download] [Trailer] A new large-scale dataset of segments of people engaged in interaction with objects, including three new chal",
  "content_length": 26880,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:02"
}