{
  "name": "David Kempe 0001",
  "homepage": "https://www.david-kempe.com",
  "status": "success",
  "content": "David Kempe's Homepage Professor Thomas Lord Department of Computer Science University of Southern California Contact Information Office: GCS 502L Office phone: (213)-740-6438 (but e-mail is usually better) e-mail: Note: Please do not e-mail my USC e-mail address. USC's administration has decided to make USC e-mail practically unusable as professional e-mail, and has also disabled automatic e-mail forwarding. I will check my USC e-mail at best sproadically. Research Interests Algorithms and theoretical computer science, specifically applications to networks, auctions and mechanisms design, online learning and feature selection, randomized algorithms, and information flow through networks. My publications can be found on the publications page. Research currently supported by ARO MURI grant W911NF1810208. Prior support through NSF CAREER grant 0545855, NSF grant CCF-1423618, NSF grant DDDAS-TMRP 0540420, NSF Grant 1619458, a Sloan Fellowship, an ONR Young Investigator Grant, and an Okawa Foundation Fellowship. Conference Organization STOC 2018 (Local Chair, with Ilias Diakonikolas). 2015 Southern California Symposium on Network Economics and Game Theory (NEGT), jointly with Shaddin Dughmi and Hamid Nazerzadeh. Friday, 10/30/2015 until Saturday 10/31/2015. 2015 Southern California Theoretical Computer Science Day, jointly with Shaddin Dughmi. Saturday, 11/14/2015. Mini-Symposium on The Formation and Function of Social Networks at the SIAM Annual Conference 2008. Thursday, July 10, 2008, 10:30am-12:30am. Theory Group We have an active CS Theory Group. Check the group page for regular meeting times, talks, etc. Announcements for meetings and talks are sent via a Google list USC-Theory-Group at http://groups.google.com/group/USC-Theory-Group. That list is used for internal announcements (lunches, ...), discussions, etc. Subscription is by approval only, but every subscriber can post to that list. If you are not a member of the CS Theory Group, but would like to receive announcements about talks of broader interest (external speakers in theory seminar or CS colloquium talks, as well as occasional talks outside USC), you can subscribe to our other Google list: http://groups.google.com/group/USC-Theory. There is only a small number of trusted people who can post to this list, so you won't be spammed.",
  "content_length": 2332,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:22"
}