{
  "name": "David E. Millard",
  "homepage": "https://www.ecs.soton.ac.uk/people/dem",
  "status": "success",
  "content": "Professor David Millard | University of Southampton Skip to main content Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Subjects PhDs and research degrees Create your own research project Find a PhD project Funding your research degree How to apply for a PhD or research degree How to make a PhD enquiry Support while studying your PhD or research degree Exchanges and studying abroad Undergraduate study Undergraduate degree courses Foundation year programmes Undergraduate tuition fees Customise your degree Funding undergraduate studies How to apply Application advice and resources - Tuition fees, funding and scholarships - - Short courses - - Lunchtime evening and weekend courses - - Clearing - - Summer schools - - Get a prospectus Student life Accommodation Choose your halls of residence Your accommodation options Apply for accommodation Our accommodation guarantee Fees and contracts Our cities Southampton Winchester Malaysia Sports and gyms Sports facilities Sports clubs Watersports centres Our campuses Avenue Campus Boldrewood Innovation Campus City Centre Campus Highfield Campus University Hospital Southampton Waterfront Campus Winchester Campus Join our student community What's on Clubs and societies Sports teams SUSU places Representing you SUSU support and advice Support and money Living costs Academic and mental health support Inclusion and respectful behaviour policy Support for disabled students Part-time work Health services Research Our impact Research projects Research areas Research facilities Collaborate with us Institutes, centres and groups Support for researchers Faculties, schools and departments Interdisciplinary research Find people and expertise - Research jobs Business Develop your organisation Access start-up support Invest in our start-ups Become a research partner License our technology Knowledge Transfer Partnerships Hire our facilities Academic consultants Specialist consultancies Research studentships Develop your workforce Continuing professional development Set up a staff secondment Host a placement student Collaborate on a short term student project Advertise graduate jobs and internships Become a supplier - - Find people and expertise Global International students Visiting delegations University of Southampton Delhi International Office Visiting fellowships University of Southampton Malaysia - Partnerships and initiatives Online master's degrees View all staff Professor David Millard Professor Research interests Hypertext Systems Interactive Digital Narratives Mixed Reality Games More research Accepting applications from PhD students. Connect with David Email: dem@soton.ac.uk Tel: +44 23 8059 5567 ORCID On this page About Research Publications Teaching About Research Publications Teaching About Dr. David Millard is Professor of Computer Science at the University of Southampton, Electronics and Computer Science, UK. He has been an active member of the international hypermedia community for over twenty five years, firstly in the area of Open and Adaptive hypermedia and later working with Social Media Analytics, Digital Narratives, and Web Science. David is the Head of the ECS Education Group at Southampton, where he leads a team of 15 Teaching Fellows and Senior Fellows, with a remit to improve teaching and learning across the department. David was previously the Director of Admissions for ECS (from 2012 to 2022), leading the schools admissions strategy and taking responsibility for all undergraduate, postgraduate taught, and post-graduate research admisions activities (such as Open and Visit days). David is also a founding member of the Web and Internet Science research group, was vice-chair of ACM SIGWEB (the ACM Special Interest Group on the Web) from 2015-2019, and is the current Chair of the ACM Hypertext steering committee as well as the SIGWEB Liaison for ACM Web Science. He has been a programme committee member for over 35 conference events, including ACM CHI, Web Science, SocInfo, and IEEE ICALT, as well as ACM Hypertext and ICIDS where he also served as the Programme Chair (in 2019 and 2020 respectively). David also serves on the editorial board of the New Review of Hypermedia, published by Taylor and Francis. David is the co-founder of the Narrative and Hypertext workshop that has been running since 2011, and in 2022 co-edited `The Authoring Problem' published by Springer, containing chapters on Interactive Digital Narrative Authoring theory and tools by leading international researchers. He leads a team of PhD students focused on Interactive Narratives and Mixed Reality Spaces, and has previously graduated 34 postgraduate students working in these areas as well as Web Science and e-learning. Many of these students have studied interdisciplinary topics, and he frequently co-supervises with colleagues from other departments, this has included Law, Social Sciences, English, History, Geography, Politics, Education, Film, Psychology, and the WSA. David's students have gone on to varied careers in academia and industry including major technology firms such as IBM and Google, and academic positions in the UK (Oxford, Winchester, Bournemouth, and East Anglia), Malaysia, Pakistan, and Saudi Arabia. He has been the external PhD examiner for 9 theses, including students at the Universities of KCL, Lisbon, Trinity College, Manchester, and Nottingham. He has twice been nominated for a Vice-Chancellers Award for his PhD supervision, and in 2020 his student Sifia Kitomilli won the best newcomer award for her research published at ACM Hypertext. Research Research groups Member of: Web and Internet Science ECS Education Group Research interests Hypertext Systems Interactive Digital Narratives Mixed Reality Games Current research David has been involved in Hypertext and Web research for over twenty five years, firstly in the area of Open, Adaptive and Contextual hypermedia and later the areas of Social Media Analytics, Linked Data, UX Design, Web Science, and Interactive Digital Narrative. He spent a number of years applying this sort of technology to e-learning, in particular digital literacy, personal-learning systems, and open educational resources (OER). His current research interests are based around hypertext, digital narratives and mixed reality games, in particular locative literature. David has authored more than 230 peer-reviewed articles across the areas of Technology Enhanced Learning, Web Science, and Hypertext and Narrative. This includes research published in prestigious journals such as Springer Multimedia Tools and Applications, Elsevier Computers in Education, IEEE Intelligent Systems, PloS one, ACM Transactions on Information Systems, and ACM Transactions on Learning Technologies. Google Scholar reports more than 4800 citations of his work, with a h-index of 35. David is interested in the overlap between Hypertext, Games, and Interactive Digital Narratives (IDNs) especially the structural models and patterns they use, and how this relates to the interactivity within the narrative, and the challenges of authoring it in the first place. His work has helped to define the area of Sculptural Hypertext (hypertext governed by rules and constraints rather than navigational links), a modelling approach that is highly suitable for conceptualising and designing narrative structures within digital games. He has also worked extensively on locative narratives, interactive digital narrative games that are experienced on location-aware smart devices, and was one of the very first people to work on this area (through his work on located stories and games as Chawton House, from 2002). Recently this has focused on understanding the locative narrative design space, where David has been working towards a design framework for successful locative experiences, and proposed the Balance of Attention as the primary poetic of locative narrative. David is proud to be a double-award winner of the Engelbart Award (2013, 2016) for his work on location-based storytelling and sculptural hypertext – exploring how digital narratives can be interwoven with real-world places. This is best exemplified by StoryPlaces, an interdisciplinary research project working with writers to explore the poetics of location-based narratives through digital storytelling deployments in Southampton, Bournemouth, and Crystal Palace. Research projects Completed projects Story Places: Exploring the Poetics of Location-Based Narratives Researchers: Professor David Millard Professor Will May , Professor Mark Weal , Professor James Jordan Sponsor: Leverhulme Trust Future of Text Researchers: Professor Leslie Carr , Professor David Millard Publications LUTE: a hypertextual mixed reality game engine Jack Brett, Charlie Hargood, David E. Millard, Yoan-Daniel Malinov & Bob Rimington, 2025 DOI: 10.1145/3720553.3746666 Type: conference Beyond authorial burden Joey Jones & David Millard, 2025, ACM Transactions on the Web DOI: 10.1145/3757746 Type: conference Preliminary findings on UK secondary educators' perceptions of XR in health education: benefits, barriers, and content creation Ying Huang, Nic Fair, Keith Godfrey, David Millard, Michael Boniface & Lisa Bagust, 2025 Type: conference Stories from the bottom up: emergent narratives with composable story sifting patterns Qianwen Lyu, David Millard & Nicholas Gibbins, 2025 DOI: 10.1145/3723498.372380 Type: conference Natureculture probes: opening up dialogues in natural heritage(s) landscapes Anna My Bertmark, Mathilde Gouin, Nuno Jardim Nunes, David E. Millard, Pedro Galvão-Ferreira, Vera Fearns, Marta Ferreira & Valentina Nisi, 2025 DOI: 10.1145/3689050.3704430 Type: conference Experie",
  "content_length": 35023,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:57"
}