{
  "name": "David Bull 0001",
  "homepage": "https://david-bull.github.io",
  "status": "success",
  "content": "Prof David Bull Prof David Bull Professor of Signal Processing Director, Bristol Vision Institute Director, MyWorld Head of Visual Information Laboratory Room 5.18, Merchant Venturers Building Woodland Road Bristol BS8 1UB dave.bull@bristol.ac.uk About I hold the Chair in Signal Processing at the University of Bristol and I am Director of the recently launched £46m MyWorld Strength in Places Programme. I am the Director of Bristol Vision Institute which I co-founded in 2008. BVI is a cross-disciplinary organisation, hosting some 160 researchers, dedicated to all aspects of vision science and engineering. I am also Director of the EPSRC Centre for Doctoral Training in Communications and University Lead for Creative Technologies. I am on the board of Bristol Digital Futures Institute and the Executive Board of the Bristol and Bath Creative Industry Cluster . I work in the fields of visual communications and computer vision and have won numerous awards for this work; I have published over 500 papers and patents, several of which have been licensed and exploited commercially. My current activities are focused on the problems of i) optimised video compression for internet streaming, broadcast and surveillance applications and ii) optimised workflows for media production including denoising and enhancement of low-light video. I am fortunate to be widely supported in these areas by international industry, governments and charities with over £50m of research income in the past 10 years. I have also delivered numerous invited/keynote lectures and tutorials and my new book, 'Intelligent Image and Video Compression' is now in print. I have served on several national and international committees including DTI Foresight, MoD DSAC, HEFCE REF committees. I have been an advisor to MoD via the UK MoD (DSTL) ISTAR Concepts and Solutions Panel (2012-16) and to EPSRC via its Strategic Advisory Network (2014-18). In 2001, I co-founded ProVision Communication Technologies, Ltd., Bristol, which launched the world's first in home HDTV wireless video distribution system. I was its Director and Chairman until it was acquired in 2011. I have been involved in the organisation of many international events and conferences. Most recently leading the bid to host IEEE ICIP 2021, Tutorial Chair for IEEE ICASSP 2019, Grand Challenge Chair for IEEE ICME 2020 and General Chair of PCS 2021. I am a chartered engineer, a Fellow of the IET and a Fellow of the IEEE. News & Activities Mar 2022: Strategic collaboration between BVI/VI-Lab, MyWorld and Netflix (Los Gatos) renewed for further 2 years. Nov 2021: New collaboration between MyWorld and Tencent Media Lab announced on optimised coding for UGC. July 2021: PCS 2021 Conference held in Bristol with record attendance. Apr 2021: MyWorld launches. Mar 2021: PCS 2021 Keynotes, Workshops and Panel Sessions announced. Jan 2021: Our paper on \"Video Compression with CNN-based Post Processing\" has been accepted by the IEEE MultiMedia Magazine. Nov 2020: Our paper on \"MFRNet: A New CNN Architecture for Post-Processing and In-loop Filtering\" has been accepted by the IEEE Journal of Selected Topics in Signal Processing Special Issue on Deep Learning for Image/Video Restoration and Compression. Oct 2020: BVI and VI-Lab partners with Cabot Institute winning ERC Fellowship (Biggs) on Imaging Magmatic Architecture using Strain Tomography (MAST) 2021-26 (£1,433). Oct 2020: Bristol and Bath CIC funds VI-Lab to work on Sustainable video compression 2021-22. July 2020: Bull leads EPSRC Impact Acceleration Award with BBC and Global Drone Training to commercialise drone-based virtual production. June 2020: Bull leads successful bid to host the UKRI Strength in Places Programme MyWorld ,a £46m collaboration to grow the Creative Technologies cluster across Bristol and Bath. May 2020: BVI-Lab win Innovate UK funding under 5G Create: 5G-Edge XR (£1.486m) 2020-22, collaborating with BT and Condense Reality. Apr 2020: We have released a large video database, BVI-DVC, for training deep learning based video coding algorithms. It has been identified by MPEG JVET AHG11 (neural network-based video coding) as one of their training datasets. Jan 2020: VI-Lab wins DASA award for research into Learning-Optimal Deep Video Compression, collaborating with Thales UK. [Older news and activities] Dec 2019: VI-Lab announced as host of the 2021 Picture Coding Symposium. PCS 2021 Sept 2019: Bristol Digital Futures Institute (BDFI) launched, A £100 million investment from Research England, 27 research partners, the University of Bristol and philanthropic sources. The programme includes a £29 million Research England funded project to establish new globally unique facilities. June 2019: VI-Lab partners in successful bid to ISCF/AHRC to host the Bristol and Bath Creative R&D Industry Cluster, working on Audience understanding and AI-bsed production workflows. July 2020: VI-Lab renews strategic partnership with Netflix. Research Areas and Projects Deep Video Compression Content Gnostic Optimisation for Adaptive Streaming Understanding video textures - a basis for video compression (BVI-HOMTEX) ViSTRA - deep video compression Post Processing and In-loop Filtering Rate Quality Optimisation - Lagrangian Optimisation Codec comparisons CVE-GAN 5G Edge XR BVI datasets A training database for deep video compression (BVI-DVC) Codec evaluation using synthetic datasets (BVI-SYNTEX) Learning-Optimal Video Compression High Dynamic Range Video Compression Creative Technologies Drone Cinematography Virtual Production Environments for Drone Cinematography Image and video Denoising, Colorisation, Enhancement Mitigating Atmospheric Distortions Low light image enhancement Artificial Intelligence in the Creative Industries: A Review Fast depth estimation for view synthesis Bristol and Bath R+D Creative Industry Cluster MyWorld: UKRI Strength in Places Programme What's on TV? Datasets for image denoising Perceptually optimised video fusion Intelligent frame Interpolation Denoising Imaging Polarimetry Perceptual Video Quality Assessment Objective metrics for perceptual visual quality assessment Optimum presentation duration Assessing High frame rate video (BVI-HFR) Characterizing the spatiotemporal envelope of the human visual system Contrast Sensitivity functions Visual Saliency, attention and locomotion Rate Quality Assessment of standardized codecs BVI datasets [Homtex, BVI-HFR, BVI-HD, BVI-Syntex etc.] Measuring Audience and user experiences Computational Imaging Prediction of Harmful Algal Blooms Deep learning methods for prediction of Volcano deformations Detecting ground deformations in the built environment Urban scene characterization for wireless network planning Defect Detection - Palantir Line Detection as an Inverse Problem Compressive Imaging Perceptual Image Fusion Publication Book and Book Chapters Intelligent Image and Video Compression: Communicating Pictures. [book][software] D. Bull and F. Zhang, 2nd Edition, Oxford: Academic Press, in Press. Measuring video quality. [book] F. Zhang and D. Bull, In: Sergios Theodoridis and Rama Chellappa, editors, Academic Press Library in Signal Processing. Vol 5. , Oxford: Academic Press, 2014, pp 227-249. ISBN: 978-0-12-420149-1. MPEG Standard Contributions Description of SDR video coding technology proposal by University of Bristol (JVET-J0031) D. Bull, F. Zhang and M. Afonso, A submission to the Joint Call for Proposals on Video Compression with Capability beyond HEVC, April 2018 in San Diego. BVI_Texture UHD 120fps test sequences for HEVC and beyond (JCTVC-V0099) M. Papadopoulos, F. Zhang, D. Agrafiotis, D. Bull and J.-R. Ohm, October 2015 in Geneva. Selected recent Papers Video Compression with CNN-based Post Processing. [paper][project] F. Zhang, D. Ma, C. Feng and D. R. Bull, IEEE MultiMedia Magazine, accepted. MFRNet: A New CNN Architecture for Post-Processing and In-loop Filtering. [paper] D. Ma, F. Zhang, and D. R. Bull, IEEE Journal of Selected Topics in Singal Processing, accepted. Detecting Ground Deformation in the Built Environment using Sparse Satellite InSAR data. [paper] N Anantrasirichai, J Biggs, K Kelevitz, Z Sadeghi, T Wright, J Thompson, D. Bull, IEEE Transactions on Geoscience and Remote Sensing, 2020. Characterizing the spatiotemporal envelope of the human visual system through the visibility of temporal aliasing artifacts [paper] A. Mackin and D. R. Bull, Journal of the Optical Society of America A, 2020. HABNet: Machine Learning, Remote Sensing-Based Detection of Harmful Algal Blooms. [paper] PR Hill, A Kumar, M Temimi, DR Bull, IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 2020. BVI-SynTex: A synthetic video texture dataset for video compression and quality assessment. [paper] AV Katsenou, G Dimitrov, D Ma, DR Bull, IEEE Transactions on Multimedia, 2020. Time-Series Prediction Approaches to Forecasting Deformation in Sentinel-1 InSAR Data. [paper] P Hill, J Biggs, V Ponce-Lopez, D Bull, Journal of Geophysical Research: Solid Earth, 2020. A Study of High Frame Rate Video Formats. [paper][project][dataset] A. Mackin, F. Zhang, and D. R. Bull, IEEE T-MM, 2019. Video Compression based on Spatio-Temporal Resolution Adaptation. [paper][project] M. Afonso, F. Zhang and D. R. Bull, IEEE T-CSVT (Letter), 2019. Rate-distortion Optimization Using Adaptive Lagrange Multipliers. [paper][project] F. Zhang and D. R. Bull, IEEE T-CSVT, 2019. The Application of Convolutional Neural Networks to Detect Slow, Sustained Deformation in InSAR Time Series. [paper] N Anantrasirichai, J Biggs, F Albino and D Bull, Geophysical Research Letters, 2019. A multi-metric approach for block-level video quality assessment. [paper] MA Papadopoulos, AV Katsenou, D Agrafiotis and DR Bull, Signal Processing: Image Communication, 2019. A deep learning approach to detecting volcano deformation from satellite imagery using synthetic datasets. [paper] N Anantrasirichai, J Biggs, F Albino and ",
  "content_length": 11656,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:42"
}