{
  "name": "David M. Mount",
  "homepage": "https://www.cs.umd.edu/users/mount",
  "status": "success",
  "content": "David Mount David Mount Professor in the Dept. of Computer Science and Institute for Advanced Computer Studies at the University of Maryland Address: Department of Computer Science 8125 Paint Branch Drive University of Maryland College Park, MD 20742 Office: 4246 Brendan Iribe Center of CS and Engineering Phone: (301) 405-2704 Email: mount@umd.edu Links Home Biography CV Teaching Software Service Scholar DBLP ORCID SemScholar ArXiV About Me If am a Professor in the Dept. of Computer Science and Institute for Advanced Computer Studies (UMIACS) at the University of Maryland. I am a member of the Algorithms and Theory Group at the University of Maryland. I am a Fellow of the ACM and twice received ACM Recognition of Service Awards. For more information, see my biographical sketch. Research I do research in Computational Geometry. My research focus is on the design, analysis, and implementation of data structures and algorithms for geometric problems, particularly problems with applications in areas such as image processing, pattern recognition, information retrieval, and computer graphics. I have written roughly 200 research publications. Almost all of my publications can be found on Google Scholar, DBLP, and/or ArXiV. (Feel free to contact me if you cannot access any of my papers that are behind paywalls.) Teaching This semester (Fall 2024) I am on sabbatical. Here are links to some recent courses I have taught. CMSC 420: Advanced Data Structures, Spring 2023. CMSC 754: Computational Geometry, Fall 2023. CMSC 425: Game Programming, Fall 2018. (Check out these cool videos from the class final projects.) CMSC 451: Design and Analysis of Computer Algorithms, Spring 2025. Independent Study Projects that I have supervised. Data Structures and Algorithms in C++ (2nd Edition): A textbook I wrote with Mike Goodrich and Roberto Tamassia, published by Wiley. Software Projects ANN: A library for approximate nearest neighbor searching. ALTS: An Adaptive Algorithm for the LTS Linear Estimator. KMeans: Efficient algorithms for k-means clustering. ISODATA: Efficient implementation of the ISODATA/ISOCLUS clustering algorithm. Professional Activities Committees and Editorial Boards Computational Geometry Steering Committee. Member - 2016-2018 TheoretiCS. Editorial Board Member - 2021-present Computational Geometry: Theory and Applications (CGTA). Editorial Board Member - 2012-present Internat. J. of Computational Geometry and Applications (IJCGA). Editorial Board Member - 2008-present ACM Trans. on Spatial Algorithms and Systems (ACM TSAS). Senior Associate Editor - 2013-2020 ACM Trans. on Mathematical Software (ACM TOMS). Editorial Board Member - 2006-2018 Pattern Recognition. Editorial Board Member - 1999-2006 Conferences Proximity 2015 (Workshop on Multi-dimensional Proximity Problems) Co-organizer FWCG 2012 (22nd Annual Fall Workshop on Computational Geometry) Workshop chair STOC 2009 ( 41st ACM Symposium on Theory of Computing, 2009) Conference Co-Chair SoCG 2008 (24th Annual Symposium on Computational Geometry, 2008) Conference Chair SPIE EI'06 (Vision Geometry XIV at SPIE's Electronic Imaging, 2006) Program co-chair SoCG 2003 (ACM Symposium on Computational Geometry, 2003) Program co-chair ALENEX'02 (4th Workshop on Algorithm Engineering and Experiments, 2002) Program co-chair Conference Program Committees SOSA 2025 (SIAM Symposium on Simplicity in Algorithms) SoCG 2024 (40th International Symposium on Computational Geometry) WADS 2023 (18th Algorithms and Data Structures Symposium, 2023) FOCS 2022 (63rd Annual Symposium on Foundations of Computer Science, 2022) ESA 2022 (30th European Symposium on Algorithms) Track-B 2022 SODA 2021 (ACM-SIAM Symposium on Discrete Algorithms, 2021) SISAP 2019 (12th International Conference on Similarity Search and Applications) SoCG 2018 (34th International Symposium on Computational Geometry) WALCOM 2017 (11th International Conference and Workshops on Algorithms and Computation) SISAP 2015 (8th International Conference on Similarity Search and Applications) SODA 2014 (ACM-SIAM Symposium on Discrete Algorithms, 2014) WALCOM 2013 (7th International Workshop on Algorithms and Computation, 2013) SIBGRAPI 2011 (Conference on Graphics, Patterns and Images, 2011) SoCG 2011 (27th Annual Symposium on Computational Geometry, 2011) ALENEX'11 (Workshop on Algorithm Engineering and Experiments, 2011) ISAAC 2010 (The 21st International Symposium on Algorithms and Computation, 2010) COCOON'06 (12th Annual International Computing and Combinatorics Conference, 2006) ESA'02 (10th European Symposium on Algorithms, 2002) Web Accessibility",
  "content_length": 4627,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:34"
}