{
  "name": "David Joyner",
  "homepage": "https://www.ic.gatech.edu/people/david-joyner",
  "status": "success",
  "content": "David Joyner | School of Interactive Computing Skip to main navigation Skip to main content David Joyner Associate Dean for Off-Campus and Special Initiatives, Executive Director of Online Education & OMSCS and Senior Research Associate; Adjunct SCI faculty david.joyner@gatech.edu http://www.davidjoyner.net Research Areas: \t\t\t\tComputer science education, online education, educational technology, AI in education Biography David Joyner is Executive Director of Online Education & OMSCS in Georgia Tech's College of Computing. His research focuses on online education and learning at scale, especially as they intersect with for-credit offerings at the graduate and undergraduate levels. His emphasis is on designing learning experiences that leverage the opportunities of online learning to compensate for the loss of synchronous collocated class time. This includes leveraging artificial intelligence for student support and assignment evaluation, facilitating student communities in large online classes, and investigating strategies for maintainable and interactive presentation of online instructional material. As part of his work, Joyner teaches online versions of CS6460: Educational Technology, CS6750: Human-Computer Interaction, CS7637: Knowledge-Based AI, and CS1301: Introduction to Computing. He is also Vice-Chair of the Steering Committee for the ACM Learning @ Scale conference, as well as the General Chair for the 2019 and 2020 conferences. Joyner has received several awards for his work in teaching online, including the 2019 USG Regents' Teaching Excellence Award for Online Teaching, 2018 Georgia Tech Center for Teaching & Learning Curriculum Innovation Award, and the 2016 Georgia Tech College of Computing Lockheed Excellence in Teaching Award. Affiliations School of Computing Instruction School of Interactive Computing Office of the Dean Division of Computing Instruction Online Master of Science Computer Science (OMSCS)",
  "content_length": 1951,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:20"
}