{
  "name": "David Held",
  "homepage": "http://davheld.github.io",
  "status": "success",
  "content": "David Held I am an Associate Professor at Carnegie Mellon University (CMU) in the Robotics Institute. I lead a research group, RPAD: Robots Perceiving And Doing.\u0010 You can check out my lab website: [RPAD Website][Publications][Lab Members] Note about Gifts To maintain fairness, transparency, and academic integrity, I do not accept gifts from students, collaborators, vendors, or other external parties. This includes monetary gifts, gift cards, and other material items. Even well-intentioned gestures can create the appearance of bias or a conflict of interest, particularly in academic and professional settings. If you wish to express appreciation, a written note or email is always appreciated. Formal Bio David Held is an Associate Professor at Carnegie Mellon University in the Robotics Institute and is the director of the RPAD lab: Robots Perceiving And Doing. His research focuses on perceptual robot learning, i.e. developing new methods at the intersection of robot perception and planning for robots to learn to interact with novel, perceptually challenging, and deformable objects. David has applied these ideas to robot manipulation and autonomous driving. Prior to coming to CMU, David was a post-doctoral researcher at U.C. Berkeley, and he completed his Ph.D. in Computer Science at Stanford University. David also has a B.S. and M.S. in Mechanical Engineering at MIT. David is a recipient of the Google Faculty Research Award in 2017 and the NSF CAREER Award in 2021. You can also download my CV (last updated Aug 26, 2025). Research Interests My research lies at the intersection of robotics, machine learning, and computer vision. I am interested in developing new methods for robotic perception and control that can allow robots to operate in the complex environments of our daily lives. I have applied the idea of perceptual robot learning to improve a robot's capabilities in two domains: object manipulation and autonomous driving. In the realm of object manipulation, I am developing methods for robots to learn to manipulate novel objects, perceptually challenging objects (e.g. transparent and specular), and deformable objects (e.g. cloth). Regarding autonomous driving, I am developing methods for self-supervised learning and semi-supervised learning (e.g. learning from unlabeled data). Solving these challenges requires rethinking robot perception and control algorithms to handle these types of tasks. To find out more, check out my lab website: [RPAD Website][Publications][Lab Members] Joining my Group Seeking an internship? If you are an undergrad looking to work in our lab for a summer or during the school year, please email me and also fill out this form. I will not reply to your email, but one of my PhD or Master's students will reach out if there is a good fit for one of their projects. Master's applicants: If you are interested in coming to CMU to join my group as a Master's student, there is no need to email me. Please apply to one of the many Master's programs at CMU (e.g. MSR, MSCS, MSCV, MSML, etc) and then contact me after you are accepted to the program! PhD applicants: If you are interested in coming to CMU to join my group as a Ph.D. student, please EMAIL ME to explain why you are interested in my group in particular! However, please note that I will not reply to your email. In addition to the email, please make sure to apply to CMU's Ph.D. program, either the Robotics Institute Ph.D. program or the Machine Learning Ph.D. program and mention my name in your research statement. After you get accepted, you should contact me to discuss the possibility of working in my group. Teaching Spring 2018:16-831: Statistical Techniques in Robotics Spring 2019: 16-881: Seminar: Deep Reinforcement Learning for Robotics Fall 2019: 16-831: Statistical Techniques in Robotics Spring 2020: 16-881: Seminar: Deep Reinforcement Learning for Robotics Fall 2020: 16-831: Statistical Techniques in Robotics Spring 2021: 16-881: Seminar: Deep Reinforcement Learning for Robotics Fall 2021: 16-831: Statistical Techniques in Robotics Spring 2022: 16-720A: Introduction to Computer Vision Fall 2022: 16-831: Statistical Techniques in Robotics Spring 2023: 16-881: Seminar: Deep Reinforcement Learning for Robotics Fall 2023: 16-820: Advanced Introduction to Computer Vision Spring 2024: No teaching Fall 2024: 16-385: Undergraduate Computer Vision Fall 2025: 16-385: Undergraduate Computer Vision Misc I recently found out a bit about my PhD genealogy, which apparently goes back to Carl Gauss, Gottfried Leibniz, and Copernicus. Newell Simon Hall (NSH), Room 4523",
  "content_length": 4612,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:08"
}