{
  "name": "David V. Mason",
  "homepage": "http://sarg.torontomu.ca/dmason",
  "status": "success",
  "content": "Dave Mason My personal email address Chair of Department email address I'm a Professor in, and currently Chair of, the School of Computer Science at Toronto Metropolitan University. I have supervised numerous undergraduate thesis students, and I'm always interested in more. You can see possible thesis topics here. I am supervising some graduate students. My Curriculum Vitae is here, including committee work. I am a member of the Software Analysis Research Group, where we are looking at: environments and tools to support developing code in the highly-productive, Smalltalk language and environment while deploying in other contexts such as in web browsers and nodeJS (PharoJS), the Java Virtural Machine (PharoJVM) and others (Universal Export) an up-front optimizing Java compiler called OptiJava issues relating to software reliability engineering, particularly Probabilistic Program Execution using Smalltalk, programming languages, particularly pure object-oriented languages like Smalltalk, Self and Ruby and mostly-functional languages like Scheme and Clojure, \"Programming for the rest of us\" - a programming language/environment to make programming - particularly of dynamic or large datasets - accessible to the non-programmers of the world. My other academic interests include teaching and attempting to remove impediments to success in computer science for under-represented members of society (particularly women). I am also interested in literate programming and other aspects of text formatting. Telephone: 416-979-5078 or 416-979-5000x7061 Fax:416-979-5064 Mailing address: Toronto Metropolitan University, School of Computer Science 350 Victoria Street Toronto, Ontario, Canada M5B 2K3 Office location: ENG286, George Vari Centre for Computing and Engineering, 245 Church Street (interactive MAP SE corner, Gould & Church, 1 block north of Dundas, 1 block east of Yonge) Web Connections: Research profile ResearchGate orcid.org/0000-0002-2688-7856 I'm a little embarrassed... I thought I'd be about 80! Last modified: 2020.08.08 10:18:31 Dave Mason",
  "content_length": 2069,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:09"
}