{
  "name": "David Smahel",
  "homepage": "https://www.muni.cz/en/people/3068",
  "status": "success",
  "content": "prof. PhDr. David Šmahel, Ph.D. – Basic information | Masaryk University Go to main content | Go to main menu | Go to search prof. PhDr. David Šmahel, Ph.D. Vice-dean for strategic development, Faculty of Social Studies office: 2.46 Joštova 218/10 602 00 Brno Show on the map phone: +420 549 49 7451 e‑mail: social and academic networks: Basic information CV Supervision Qualifications Publications Projects Teaching Basic information Academic and management positions MU Faculty or unit Faculty of Social Studies Job classification Vice-dean for strategic development Membership in academic and other bodies at MU Board for Studies Media Studies and Journalism (bachelor's studies) Media Studies and Journalism (master's studies) Committee for Strategic Research Projects Masaryk University Dean's Board Faculty of Social Studies Doctoral Board Media and journalism studies Media and journalism studies Psychology Psychology Rector's Working Group on Security Programmes and Research Masaryk University Scientific Board Faculty of Social Studies Senior Management Faculty of Social Studies Department MU Faculty or unit Interdisciplinary Research Team on Internet and Society – Faculty of Social Studies Job classification Professor Office 2.46 – Joštova 218/10, Brno-město, Brno Phone +420 549 49 7451 E-mail MU Faculty or unit Department of Machine Learning and Data Processing – Faculty of Informatics Job classification Professor Office A211 – Botanická 554/68a, Ponava, Brno Phone +420 549 49 7486 MU Faculty or unit Department of Media Studies and Journalism – Faculty of Social Studies Job classification Professor Personal information Personal identification - University ID 3068 Internal information Portál MU IS MU CV Supervision Qualifications Publications Projects Teaching You are running an old browser version. We recommend updating your browser to its latest version. More info Close",
  "content_length": 1900,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:05"
}