{
  "name": "David R. Choffnes",
  "homepage": "http://david.choffnes.com",
  "status": "success",
  "content": "Home: David Choffnes, Ph.D. MENU Home RESEARCH Projects Publications Vision Collaborators Software Support TEACHING Upcoming (CS 7770 Fall 23) Past ABOUT Brief CV Extracurricular News PRESS JOIN Graduate Undergraduate CONTACT I am a Professor in the Khoury College of Computer Sciences at Northeastern University, Executive Director of the Cybersecurity and Privacy Institute, and affiliate faculty at the Center for Law, Innovation and Creativity (CLIC). My research is primarily in the areas of distributed systems and networking, with a focus on privacy, security, and transparency across IoT, mobile, and web modalities. My research approach is to combine science and engineering to understand and improve the performance, reliability, and security of Internet systems. With respect to science, I empirically measure computer systems that interact over the Internet to understand how well they match existing models and assumptions, then investigate the root causes for violations of those models/assumptions—often then leading to the design of new models. In many cases, our observations also suggest the design of systems that exploit previously unknown information about how our Internet-enabled systems work, and as an engineer I build and evaluate such systems in a way that other researchers, users, and policy makers can benefit from the result. To date, the software artifacts of my research have more than one million users, and my research teams have produced reports and datasets that informed additional research, policy debates, regulators, and legislators. News 10/17/25 Congratulations to my recently graduated PhD student Talha Paracha, lead author on the paper \"Hallucinating Certificates: Differential Testing of TLS Certificate Validation Using Generative Language Models\", which was just accepted to appear in ICSE 2026! This was the last part of his dissertation work to be published. Also congrats to our coauthors Kyle Posluns, Kevin Borgolte, and Martina Lindorfer. 5/1/25 My promotion to (Full) Professor was officially approved by the Provost's Office. I want to thank my mentors, students, collaborators, colleagues, family, and friends (not mutually exclusive!) who have helped me reach this milestone. 4/15/25 Excited to report that Dr. Tianrui Hu successfully defended his dissertation (my 7th!), and that Elaine Ly and Ilgar Mammadov will be joining my group as PhD students in Fall 2025! 3/15/25 Two more papers accepted to PETS 2025 (issues 2 and 3): \"Echoes of Privacy: Uncovering the Profiling Practices of Voice Assistants\" (with Tina Khezresmaeilzadeh, Elaine Zhu, Kiersten Grieco, Daniel J. Dubois, and Konstantinos Psounis), and \"Empirically Measuring Data Localization in the EU\" (with Alexander Gamero-Garrido, Kicho Yu, Sumukh Vasisht Shankar, Sachin Kumar Singh, Sindhya Balasubramanian, and Alexander Wilcox)! 8/1/24 Excited that our paper Gig Work at What Cost?: Exploring Privacy Risks of Gig Work Platform Participation in the U.S.\" has been accepted to appear in PETS 2025! Congrats to the lead authors Amogh Pradeep and Johanna Gunawan, and our coauthors Alvaro Feal and Woody Hartzog! 7/31/24 Just learned that our paper, \"IoT Bricks Over v6: Understanding IPv6 Usage in Smart Homes\" has been accepted to appear in IMC 2024! Congrats to the lead author Tianrui Hu and our coauthor Daniel Dubois! 7/24/24 Along with my ProperData collaborators, I've been awarded the Caspar Bowden PET Runner-Up Award for 2024, honoring our Smart Speaker Profiling work. 5/23/24 Along with Cecilia Testart, I co-organized an NSF workshop on Policy-Relevant Internet Measurement. 5/17/24 Thrilled to share a technology/policy collaborative work on improving privacy protections for consumers. \"A Scientific Approach to Tech Accountability\" appeared in the Harvard Journal of Law and Technology (JOLT). 10/24/23 Congrats to Umar and the whole team for winning the Best Paper Award at IMC for our paper, \"Tracking, Profiling, and Ad Targeting in the Alexa Echo Smart Speaker Ecosystem\"! 8/30/23 A bit stunned to report that I'm a coauthor on five papers that appeared at IMC'23! Congrats to all my collaborators, for more details see the publications page. 7/27/23 Our paper on our ethics for data collection and sharing for the National Internet Observatory project was published in Nature CS! 7/17/23 Congrats to Daniel Dubois, Nicole Holliday, and Kaveh Waddell for our first ICWSM paper, titled \"Fair or Fare? Understanding Automated Transcription Error Bias in Social Media and Videoconferencing Platforms\". The paper will appear in ... June 2024. 7/13/23 Congrats to Amogh and Alvaro on being runners up for the Best Student Paper award at PETS '23 for their work on mobile browser privacy and security! 4/10/23 Thrilled to announce that our paper \"Protected or Porous: A Comparative Analysis of Threat Detection Capability of IoT Safeguards\" will appear in IEEE S&P 2023! This is joint work lead by Anna Maria Mandalari, along with Daniel Dubois and Hamed Haddadi. 1/19/23 Yet another long delay between updates. Some highlights from my collaborations: Consumer Reports covered work with Daniel Dubois and Nicole Holliday on bias in automatic transcription systems. Monica (star undergrad at NU) and Johanna's work on dark patterns for IoT devices will appear at CHI'23. Amogh and Alvaro led work on unique privacy violations from mobile web browser apps, to appear at PETS '23. Amogh and Talha were co-first-authors on an analysis of TLS key pinning in mobile apps (IMC'22). Kevin's work on improving Reverse Traceroute scalability was presented at IMC '22. (I was co-chair of the TPC for IMC '22 with Theo Benson) Kentrell's work on dark partterns in voice assistants was presented at EuroUSEC'22. Narmeen's work on security vulnerabilities in the Zigbee wireless protocol was presented at ANCS'22. Amogh's work on anonymous communication during Internet blackouts was presented at PETS'22. Congrats to my coauthors on all these projects! 8/20/21 My team's longitudinal study of TLS usage by IoT devices was accepted for publication at IMC'21! Congrats to my coauthors Talha Paracha, Daniel Dubios, and Narseo Vallina-Rodriguez! 7/30/21 I've been awarded Senior Member status in the Association for Computing Machinery! 7/22/21 My team's work on Personal Virtual Networks and IoT privacy and security were mentioned in the UK Telecom Regulator, Ofcom, Internet Futures report. 7/20/21 I penned an article about how Wehe is enabling crowdsourced detection of net neutrality violations worldwide and adapting to new applications as part of the Arcep 2021 State of the Internet report. 7/6/21 Another batch of updates: As of July 1, I'm the Executive Director of Northeastern's Cybersecurity and Privacy Institute. I've been appointed to serve on the State of Massachusetts Special Commission to Study Equity and Access to Telecommunication Services. We will evaluate issues related to the digital divide in the Commonwealth and make recommendations for change. Johanna Gunawan's work with me, Christo Wilson, and Woody Hartzog on dark patterns across modalities (presented at the FTC Workshop on Dark Patterns) was accepted to CSCW '21. Congrats, Johanna! The Seton Hall Law Review just published \"The COVID-19 Pandemic and the Technology Trust Gap,\" by Johanna Gunawan, Woody Hartzog, Christo Wilson, and me. 6/29/21 Time for another batch update on things that have happened since... a while ago: Our paper titled AnyOpt: Predicting and Optimizing IP Anycast Performance, was accepted for publication at SIGCOMM 2021. This was fantastic work led by Shane (Xiao) Zhang at Duke, along with Tanmoy Sen, Zheyuan Zhang, Tim April, Balakrishnan Chandrasekaran, Bruce M. Maggs, Haiying Shen, Ramesh K. Sitaraman, and Xiaowei Yang. We show how you don't have to compromise on latency performance when building an anycast-based service. Our paper titled Blocking without Breaking: Identification and Mitigation of Non-Essential IoT Traffic was accepted to appear in PETS 2021. Learn how we can block unnecessary IoT traffic to reduce privacy and security issues. Joint work with Anna Maria Mandalari (Imperial College London), Daniel J. Dubois (Northeastern University), Roman Kolcun (Imperial College London), Muhammad Talha Paracha (Northeastern University), Hamed Haddadi (Imperial College London). Our prototype proposal “IoTrimmer: Defending against IoT privacy threats” reached the TOP 10 (among 180 submissions) at the Telekom Challenge by T-Labs. We're planning to make our privacy- and security-enhancing technology into a product for widespread use. Theo Benson and I will be the Program Committee co-Chairs for the 2022 Internet Measurement Conference. I can't wait to see everyone's fascinating submissions! I am part of a team that has been awarded a $10M NSF SaTC Frontier grant for improving privacy via a multimodal, interdisciplinary approach. Learn more about our project at: https://properdata.eng.uci.edu/ 9/9/20 It's been a busy pandemic, and there quite a few updates since last time: I spent my sabbatical as a Security Architect at Akamai Technologies. I learned a great deal and worked with extremely talented and welcoming people. My team's work on smart speakers inadvertently waking up was published and presented at PETS 2020. You learn more about it here. Along with collaborators from the UK, and Germany, my team's work on detecting IoT devices from highly sampled network traffic was accepted to IMC 2020. You can find a preprint here. I'm now an affiliate faculty member at Northeastern's Center for Law, Innovation and Creativity (CLIC). I'm thrilled to join such an esteemed group of collegues and work with them at the intersection of empirical neworking research and consumer protection policy. 2/20/20 Happy to announce that FlowPrint will appear in NDSS 2020! This project focuses on an approach to fingerprinting apps based ono network traffic that works both in semi-supervised and entirely unsuperrvised settings. This is jo",
  "content_length": 13886,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:59"
}