{
  "name": "David S. Rosenblum",
  "homepage": "https://cs.gmu.edu/~dsr/index.html",
  "status": "success",
  "content": "David S. Rosenblum DAVID S. ROSENBLUM Home CV Papers Talks Patents Research Students Conferences PGP Contact David S. Rosenblum David S. Rosenblum is Planning Research Corporation Professor and Chair of the Department of Computer Science at George Mason University. Professor Rosenblum received his PhD in 1988 from Stanford University. From 1988 to 1996 he was a Member of the Technical Staff at AT&T Bell Laboratories (now AT&T Labs Research) in Murray Hill, New Jersey, and from 1996 to 2001 he was on the Faculty of the Department (now School) of Information and Computer Science at the University of California, Irvine. From 2001 to 2003 he was Chief Technology Officer and Principal Architect of PreCache, a startup company developing technology in the area of publish/subscribe networking. From 2004 to 2011 he was Professor of Software Systems in the Department of Computer Science at University College London. From 2011 to 2020 he was a Professor of Computer Science at the National University of Singapore, where he served as Dean of the NUS School of Computing from 2013 to 2016 and Director of the NUS-Singtel Cyber Security Research and Development Laboratory from 2016 to 2020. Professor Rosenblum's research has addressed a wide range of problems spanning the breadth of the software development life cycle, including software specification, architecture, design, verification, testing, analysis and maintenance. His current research focuses on the use of machine learning in the design and testing of mobile, context-aware adaptive systems for ubiquitous computing and the Internet of Things. In 1997 he received a CAREER Award from the US National Science Foundation for his work on distributed component-based software, and from 2004-2009 he held a Wolfson Research Merit Award from the Royal Society. Professor Rosenblum is a Fellow of the ACM and IEEE and has received two test-of-time awards for his research. He was previously Editor-in-Chief of the ACM Transactions on Software Engineering and Methodology (ACM TOSEM) and an Associate Editor for the IEEE Transactions on Software Engineering (IEEE TSE). He has served as Member-at-Large, Vice Chair, Chair and Past Chair of the ACM Special Interest Group on Software Engineering (ACM SIGSOFT), and in 2018 he received the ACM SIGSOFT Distinguished Service Award. More information is available in a current CV. Major Awards ACM SIGSOFT Distinguished Service Award (2018) Inaugural ACM SIGSOFT Impact Paper Award (2008) ICSE Most Influential Paper Award (2002) Fellowships and Affiliations Fellow of the Association for Computing Machinery (ACM) Member of the ACM Special Interest Group on Software Engineering (ACM SIGSOFT) Profile as \"People of ACM\" Fellow of the Institute of Electrical and Electronics Engineers (IEEE) Fellow of the Asia-Pacific Artificial Intelligence Association (AAIA) Current Professional Activities Panel Convenor of the Computer Science/Information Technology Panel, Hong Kong Research Assessment Exercise 2026 (RAE 2026) Member of the Strategic Advisory Board of the Constructor Group Member of the Strategic Advisory Board and Board of Governors of Constructor University Member of the Advisory Council of the Department of Computer Science and Engineering, University of North Texas (UNT CSE) Member of the UK Computing Research Committee (UKCRC) Recent Books Test and Evaluation Challenges in Artificial Intelligence-Enabled Systems for the Department of the Air Force (Air Force Studies Board, National Academies of Sciences, Engineering, and Medicine) 40 Editions of ICSE—The Ruby Anniversary Celebration (ICSE 2018) Recent Papers Understanding User Behavior in Cross-Domain Recommendation: An LLM-Based Approach (IJCNN 2025) Analyzing the Impact of Domain Similarity: A New Perspective in Cross-Domain Recommendation (IJCNN 2024) Vietoris-Rips Complex: A New Direction for Cross-Domain Cold-Start Recommendation (SDM 2024) On the Vertical and Horizontal Integration of Robotics Within Engineering and Computing Education (IUTAM SOGCAS 2023) Mixed-Order Relation-Aware Recurrent Neural Networks for Spatio-Temporal Forecasting (IEEE Transactions on Knowledge and Data Engineering, 2022) Repairing Failure-inducing Inputs with Input ReflectionYan Xiao, Yun Lin, Ivan Beschastnikh, Changsheng Sun, David Rosenblum, Jin Song DongASE \t'22: Proceedings of the 37th IEEE/ACM International Conference on Automated Software Engineering, 2022 Self-Checking Deep Neural Networks for Anomalies and Adversaries in Deployment (IEEE Transactions on Dependable and Secure Computing, 2022) Fine-Grained Urban Flow Inference (IEEE Transactions on Knowledge and Data Engineering, 2022) Predicting Urban Water Quality with Ubiquitous Data—A Data-driven Approach (IEEE Transactions on Big Data, 2022) Last updated 17 November 2025",
  "content_length": 4815,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:02"
}