{
  "name": "David Jones",
  "homepage": "http://www.cs.ucl.ac.uk/staff/D.Jones",
  "status": "success",
  "content": "David T. Jones | Professor of Bioinformatics | UCL Computer Science UCL DEPARTMENT OF COMPUTER SCIENCE Bioinformatics Group Professor David T. Jones FRS Welcome to my home page at University College London. I am an internationally recognized expert in artificial intelligence (AI) applications in biology, with a particular focus on proten structure and function prediction. Over the past three decades, I have made significant contributions to the field, including developing the first “threading” algorithm for protein fold recognition, pioneering fragment-based approaches for de novo protein structure prediction, and advancing the use of deep learning to model covariation in protein sequences. My work has garnered over 60,000 citations, and I have been honored to appear regularly on Clarivate’s Highly Cited Researcher’s List. I am proud to have played a pivotal role as the sole bioinformatics expert during the early development of DeepMind’s AlphaFold, which has revolutionized the field of structural biology. My passion lies in driving innovation at the intersection of computational science and biology, developing foundational methodologies that continue to shape the future of the field. At UCL, I am currently Professor of Bioinformatics and Head of the Bioinformatics Group in the Department of Computer Science. My appointment is held jointly with the UCL Division of Biosciences (Structural and Molecular Biology), although all mail should be addressed to the Computer Science Dept. as shown below. I was elected Fellow of the International Society for Computational Biology in 2022. In 2023 I was elected as a Fellow of the Royal Society. Research interests My main research interests are in protein structure prediction and analysis, simulations of protein folding, Hidden Markov Model methods, transmembrane protein analysis, machine learning applications in bioinformatics, de novo protein design methodology, and genome analysis including the application of intelligent software agents. New areas of research include the use of high throughput computing and very large scale machine learning for bioinformatics applications, analysis and prediction of protein disorder, expression data analysis and the analysis and prediction of protein function and protein-protein interactions using deep learning techniques. Over the years I have authored a number of widely-used bioinformatics tools such as PSIPRED, GenTHREADER, MEMSAT and DISOPRED (see group pages for a full list with download links). From 2016 to 2018 I worked with Google DeepMind on the AlphaFold project and I was also one of the founders of UCL \"spin out\" company Inpharmatica Ltd. The company, which at one point employed over 100 people in Central London, was bought by Galapagos NV in 2007. More on Inpharmatica here and here. Publications I'm pleased to be included in Clarivate's Highly Cited Researchers List list, which identifies the world's leading scientific researchers on the basis of the number of highly cited papers published over the past 10 years. This is a reflection not only of the hard work and scientific excellence of the students, postdocs and collaborators I've been fortunate to work with over this period, but also the high impact that bioinformatics research in general has had over the last 20 years. For more details on my lab's research output see below: Publication list, bibliometric data and preprints TEACHING I coordinate the Bioinformatics module (COMP0082) on the MSc in Computational Statistics and Machine Learning degree programme. I also contribute lectures to the 3rd year UG Bioinformatics module (BIOC0016) in the Dept. of Structural and Molecular Biology. EDITORIAL BOARDS I have served on the editorial boards of the following journals: Proteins: Structure, Function and Bioinformatics, Advances in Bioinformatics, BioData Mining and PLoS ONE. FUNDING We are grateful to the following organisations for financially supporting our research: BBSRC , The Wellcome Trust , Elsevier BV , EPSRC , MRC , The Royal Society , The European Commission , AstraZeneca , GlaxoSmithKline , Pfizer , Sun Microsystems. Links >> Bioinformatics Group Home Page >> PSIPRED Server >> UCL Dept. of Computer Science >> Institute of Structural and Molecular Biology >> UCL Home Page >> Some ancient history Contact Details Prof. David T. Jones Department of Computer ScienceUniversity College London Gower StreetLondon WC1E 6BT United Kingdom. Tel: 020 7679 2235 (+44 20 7679 2235) Lab: 020 7679 2298 (+44 20 7679 2298) E-mail: d.t.jones@ucl.ac.uk Follow Me",
  "content_length": 4578,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:20"
}