{
  "name": "David Churchill",
  "homepage": "http://www.cs.mun.ca/~dchurchill",
  "status": "success",
  "content": "David Churchill, Memorial University David ChurchillOffice:ER-6030 (Earth Science) Associate ProfessorOffice Hours:Tues/Thur: 5:00pm - 6:00pm Department of Computer SciencePhone:(709) 864-6140 Memorial University of NewfoundlandEmail: Artificial Intelligence / Games Research Prospective Graduate Student? I am not recruiting any graduate students at this time. Read here for more details. Who Am I? I'm an Associate Professor of Computer Science at Memorial University (MUN), in St. John's, Newfoundland. I grew up in St. Philip's, Newfoundland, and did my undergrad in Pure Mathematics and Computer Science at MUN. In 2009 I completed my MSc in Computer Science at MUN, doing research into autonomous robotics and computer vision. In 2016 I completed my PhD in Computing Science on Artificial Intelligence for Starcraft at the University of Alberta, and have been actively involved in research in AI and Computer Games ever since. I love video games! I've logged way more hours than I choose to admit in games such as EverQuest, World of WarCraft, StarCraft, Tekken, Quake, Path of Exile, League of Legends, Final Fantasy, and Overwatch. I love teaching on the subject of video games, and have lectured on topics such as video game design and programming, artificial intelligence for video games, eSports, and gaming culture and history. My main research focus is on AI for Real-Time Strategy Games, such as StarCraft, however I am interested in any research related to video games and/or AI (especially heuristic search). StarCraft AI Competitions Since 2011 I have organized and run the AIIDE StarCraft AI Competition. This competition puts state of the art RTS AI research on display in the form of bots which play the full game of StarCraft: BroodWar. In addition to organizing the tournament I am also the author of UAlbertaBot, which has been competing since 2010, and won the competition in 2013.",
  "content_length": 1905,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:49"
}