{
  "name": "Davide Martinenghi",
  "homepage": "http://home.deib.polimi.it/martinen",
  "status": "success",
  "content": "Davide Martinenghi Davide Martinenghi Davide Martinenghi, Ph.D. Dipartimento di Elettronica, Informazione e Bioingegneria Politecnico di Milano Via Ponzio, 34/5, I-20133 Milano, Italy Phone: +39-02-2399-3669 Fax: +39-02-2399-3411 e-mail: davide.martinenghi@polimi.it Research Main interests: top-k queries, web data access, data integrity maintenance, data integration. Activities Editorial Board Member for the Data & Knowledge Engineering Journal. General (Co-)Chair: SEBD 2025. Program Committee (Co-)Chair: DBRank 2011, LID 2008, LAAIC 2006, LAAIC 2005. Steering Committee member: SEBD (since 2023), LID 2011, LID 2009, LID 2008. Senior Program Committee member: CIKM 2025. CIKM 2024. Award Committee member: EDBT 2024. Program Committee member: ICDE 2026, VLDB 2025, ICDE 2021, EDBT 2019, EDBT 2018, SIGMOD 2017, ICDE 2017, SIGMOD 2016, SIGMOD 2015, and more. Program Committee member: SIGMOD 2027, ICDE 2026, VLDB 2025, itaData 2025, itaData 2024, SEBD 2022, itaData 2022, ICDE 2021, SEBD 2021, PIE 2021, PIE 2020, EDBT 2019, SEBD 2019, PIE 2019, EDBT 2018, SEBD 2018, SIGMOD 2017, ICDE 2017, SEBD 2017, SIGMOD 2016, SEBD 2016, COIN 2016, SIGMOD 2015, SEBD 2015, DBRank 2013, NoCoDa 2013, EDBT Demo 2013, DBRank 2012, NoCoDa 2012, ICLP 2011, FQAS 2011, DALI 2011, FQAS 2009, ISMIS 2005, FQAS 2004. [show less] Organizing Committee member: DL 2007. Selected publications D. Magnanimi, A. Colombo, L. Bellomarini, A. Bernasconi, S. Ceri, D. Martinenghi, Enabling Light-Weight Reasoning via Cypher Triggers, ICDE 2025, pp. 4277-4290, 2025. P. Ciaccia, D. Martinenghi, Directional Queries: Making Top-k Queries More Effective in Discovering Relevant Results, SIGMOD 2025, Proc. ACM Manag. Data 2(6), 2024. S. Ceri, A. Bernasconi, A. Gagliardi, D. Martinenghi, L. Bellomarini and D. Magnanimi. PG-Triggers: Triggers for Property Graphs, SIGMOD 2024, pp. 373-385, 2024. D. Magnanimi, L. Bellomarini, S. Ceri, D. Martinenghi, Reactive Company Control in Company Knowledge Graphs, ICDE 2023, pp. 3336–3348. Best paper award - Industry and Applications Track. P. Ciaccia, D. Martinenghi, R. Torlone, Preference Queries over Taxonomic Domains, VLDB 2021, PVLDB 14(10): 1859-1871, 2021. P. Ciaccia, D. Martinenghi, Flexible Skylines: Dominance for Arbitrary Sets of Monotone Functions, ACM TODS, 45(4): 18:1-18:43, 2020. P. Ciaccia, D. Martinenghi, R. Torlone, Foundations of Context-Aware Preference Propagation, Journal of the ACM 67(1): 4:1-4:43, 2020. P. Pinoli, S. Ceri, D. Martinenghi, L. Nanni: Metadata management for scientific databases. Inf. Syst. 81: 1-20, 2019. P. Ciaccia, D. Martinenghi, Reconciling Skyline and Ranking Queries, VLDB 2017, PVLDB 10(11): 1454-1465, 2017. I. Catallo, S. Coniglio, P. Fraternali, D. Martinenghi, A workload-dependent task assignment policy for crowdsourcing, World Wide Web 20(6): 1179-1210, 2017. E. Ciceri, P. Fraternali, D. Martinenghi, M. Tagliasacchi, Crowdsourcing for Top-K Query Processing over Uncertain Data, IEEE TKDE 28(1): 41-53, 2016. D. Martinenghi, R. Torlone, Taxonomy-based Relaxation of Query Answering in Relational Databases, VLDB Journal, 23(5): 747-769, 2014. I. Catallo, E. Ciceri, P. Fraternali, D. Martinenghi, M. Tagliasacchi, Top-k Diversity Queries over Bounded Regions, ACM TODS 38(2), October 2013. P. Fraternali, D. Martinenghi, M. Tagliasacchi, Top-k bounded diversification, SIGMOD 2012, pp. 421-432, 2012. D. Martinenghi, M. Tagliasacchi, Proximity measures for rank join, ACM TODS 37(1), February 2012. D. Martinenghi, M. Tagliasacchi, Cost-Aware Rank Join with Random and Sorted Access, IEEE TKDE 24(12), December 2012, pp. 2143-2155. M. A.Soliman, I. F. Ilyas, D. Martinenghi, M. Tagliasacchi, Ranking with Uncertain Scoring Functions: Semantics and Sensitivity Measures, SIGMOD 2011, pp. 805-816, 2011. H. Decker, D. Martinenghi, Inconsistency-tolerant Integrity Checking, IEEE TKDE 23(2): 218-234, 2011. D. Martinenghi, M. Tagliasacchi, Proximity Rank Join, VLDB 2010, PVLDB 3(1): 352-363, 2010. D. Braga, S. Ceri, F. Daniel, D. Martinenghi, Optimization of Multi-Domain Queries on the Web, VLDB 2008, PVLDB 1(1): 562-573, 2008. A. Calì, D. Martinenghi, Querying Data under Access Limitations, ICDE 2008, pp. 50-59. Seminars Finding the best objects in large datasets, EURECOM, France, June 28, 2024. pdf Flexible Score Aggregation, Free University of Bozen-Bolzano, Italy, November 12, 2018. pdf Skylines and Ranking Queries: a Reconciliation, Università Roma Tre, Rome, Italy, April 28, 2017. pdf Reducing Uncertainty in Top-K Queries,, University of Trento, Italy, November 21, 2013. pdf Humans Fighting Uncertainty in Top-K Scenarios, Università Roma Tre, Rome, Italy, July 9, 2013. pdf Ranking and queries: as good as it gets, University of Lugano, Switzerland, July 5, 2012. pdf Ranking with uncertain scoring functions, Oxford University, UK, May 17, 2011. pdf Query Optimization in the Deep Web, Università Roma Tre, Rome, Italy, June 10, 2010. pdf Teaching Algoritmi e Principi dell'Informatica",
  "content_length": 4984,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:22"
}