{
  "name": "David García 0001",
  "homepage": "https://dgarcia.eu/curriculum-vitae",
  "status": "success",
  "content": "Curriculum Vitae – David Garcia Prof. David Garcia e-mail: david.garcia@uni.kn Professor for Social and Behavioral Data Science at the University of Konstanz Also affiliated with CSH Vienna, TU Graz, and ETH Zurich ResearcherID: A-2113-2014 ORCID: 0000-0002-2820-9151 Scopus: 56817130300 Google Scholar Profile Research Experience Since 2022: Professor for Social and Behavioral Data Science – University of Konstanz Center for Data and Methods, Department of Politics and Public Administration Member of the Extended Directorate of the Centre for HUMAN | DATA | SOCIETY Principal Investigator and Board Member of the Cluster of Excellence Politics of Inequality Principal Investigator of the Centre for the Advanced Study of Collective Behavior 2024, 2025: Visiting professor at the Barcelona Supercomputing Center Since 2017: Associate Faculty at the Complexity Science Hub Vienna Since 2018: External faculty (privatdozent) – ETH Zurich Since 2023: External faculty (privatdozent) – TU Graz 2020 – 2023: Full Professor for Computational Behavioral and Social Sciences Faculty of Computer Science and Biomedical Engineering 2017 – 2022: Group leader – Medical University of Vienna and CSH Vienna Leading a Vienna Research Group funded by the WWTF 2015 – 2017: Senior researcher – ETH Zurich Research on emotions and polarization in participatory media, funded by the Swiss SNF 2012 – 2014: Postdoctoral researcher – ETH Zurich Research on digital traces of emotions, privacy, and resilience in social media 2009 – 2012: Research Assistant – Chair of Systems Design Research funded by the EU FP7 project Cyberemotions 2008 – 2009: Research Assistant – Network Visualization Developer of Cuttlefish a graph visualization project Java 2008: Master Thesis and Research Assistant – Computer Science at ETH Zurich Analysis of higher-order structures of equilibrium networks, supervised by Prof. Peter Widmayer 2006 – 2007: Student Internship, Knowledge Engineering Institute UAM Development of machine learning systems for fraud detection Education December 2022: Approval of habilitation (umhabilitierung) at TU Graz February 2018: Habilitation (Venia Legendi) at ETH Zurich Habilitation thesis: Understanding Emotions and Social Interactions in the Digital Society October 2012: Dr. ETH Zurich, Chair of Systems Design Doctoral thesis: Modeling collective emotions in online communities August 2009: M.S. ETH Zurich, Computer Science, Theory of Computation track Master thesis title: Higher-order Distributions of Complex Networks. June 2007: B.S. Universidad Autonoma de Madrid, Computer Engineering Awards WWTF Vienna Research Groups for Young Investigators 2016 (1.6 Million Euro) Publons Sentinels of Science award for outstanding service, 2016 Research on social resilience listed in MIT Technology Review Best of 2013 1st prize in the 6th and 8th ETH Science Slams and in the Zurich Euraxess Slam ETH Zurich: Tuition scholarship for international students, 2008 Comunidad de Madrid: University access (2003) and Excellence Scholarships (2004 and 2005) Editor Service Since 2025: Editor in Chief, EPJ Data Science, since 2025 2018-2024: Associate Editor of EPJ Data Science, Since 2017: Senior Program Committee member/Associate editor of ICWSM Guest editor of Proceedings of the National Academy of Sciences (2020) and of PLOS One (2018) Selected Review Service Reviewer for interdisciplinary journals including Nature (2021 – 2023), Science (2016), PNAS (2019 – 2023), Nature Communications (2015), Science Advances (2016), Royal Society Interface (2015) Reviewer for computer science journals including Comm. of the ACM (2017), Future Generation Computer Systems (2019), ACM Trans. on the Web (2015), EPJ Data Science (2014 – 2018), Information Sciences (2016), Semantic Web Journal (2016), JMIR (2017 – 2023) Member of the program committee of conferences including The Web Conference / WWW, KDD, SocialCom, HyperText, ICWSM, and Web Science Reviewer for psychology journals including Nature Human Behavior (2018 –), Social Psychological and Personality Science (2019 –), Journal of Experimental Psychology: General (2016) Reviewer for political science journals including Electoral Studies (2019), Political Communication (2016), Policy and Internet (2013-2015) Selected Organization of Scientific Events Program Chair of NetSci conference (2023) and of the International Conference of Computational Social Science (2025) General Chair of the European Symposium Series on Societal Challenges in Computational Social Science 2019: Polarization and Radicalization Founder and organizer of the ICWSM Science Slam (2015-2019) Organizer of the ETH Risk Center Workshop: Mastering the Challenges of our Digital Society, Zurich, Switzerland (2016) Academic and Research Service Since 2022: Member of the GESIS Coordination Group for Digital Behavioral Data 2021-2022: Chair of Curriculum Commission at TU Graz. Masters Programme in Computational Social Systems. Appointed by the Department of Computer Science and Biomedical Engineering More Information Publication List Research Interests Funded Projects Talk List Selected Media Responses",
  "content_length": 5141,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:04"
}