{
  "name": "David Page",
  "homepage": "https://scholars.duke.edu/person/david.page",
  "status": "success",
  "content": "David Page | Scholars@Duke profile Skip to main content David Page Duke Health Distinguished Professor of Biostatistics & Bioinformatics Biostatistics & Bioinformatics, Division of Biostatistics david.page@duke.edu Duke Box 2721, Durham, NC 27710 2424 Erwin Road Suite 1102, 11072 Hock Plaza, Durham, NC 27705 At a Glance Overview David Page works on algorithms for data mining and machine learning, as well as their applications to biomedical data, especially de-identified electronic health records and high-throughput genetic and other molecular data. Of particular interest are machine learning methods for complex multi-relational data (such as electronic health records or molecules as shown) and irregular temporal data, and methods that find causal relationships or produce human-interpretable output (such as the rules for molecular bioactivity shown in green to the side). Current Appointments & Affiliations Duke Health Distinguished Professor of Biostatistics & Bioinformatics · 2025 - Present Biostatistics & Bioinformatics, Division of Biostatistics, Biostatistics & Bioinformatics Professor of Biostatistics & Bioinformatics · 2021 - Present Biostatistics & Bioinformatics, Division of Biostatistics, Biostatistics & Bioinformatics Professor of Computer Science · 2021 - Present Computer Science, Trinity College of Arts & Sciences Chair of Biostatistics & Bioinformatics · 2019 - Present Biostatistics & Bioinformatics, Division of Biostatistics, Biostatistics & Bioinformatics In the News Published May 4, 2023 Duke Awards 44 Distinguished Professorships Published February 21, 2023 ChatGPT Is Here to Stay. What Do We Do With It? View All News Recent Publications MPAC: a computational framework for inferring pathway activities from multi-omic data. Journal Article Bioinformatics · October 2, 2025 MOTIVATION: Fully capturing cellular state requires examining genomic, epigenomic, transcriptomic, proteomic, and other assays for a biological sample and comprehensive computational modeling to reason with the complex and sometimes conflicting measurement ... Full text Link to item Cite Development and implementation of an entity relationship diagram for perinatal data. Journal Article JAMIA Open · October 2025 OBJECTIVE: Severe maternal morbidity and mortality are higher in the United States than in other high-income countries, and unacceptable disparities persist. To facilitate research on these outcomes, we developed a standardized approach for extracting peri ... Full text Link to item Cite Machine Learning Models to Predict Risk of Maternal Morbidity and Mortality From Electronic Medical Record Data: Scoping Review. Journal Article J Med Internet Res · August 14, 2025 BACKGROUND: A majority (>80%) of maternal deaths in the United States are preventable. Using machine learning (ML) models that are generated from electronic medical records (EMRs) may be a promising approach to predict the risk of adverse maternal outcomes ... Full text Link to item Cite View All Publications Recent Grants Advancing a Holistic Understanding of Variability in Lived Experience with Sickle Cell Pain ResearchCo-Principal Investigator · Awarded by National Institutes of Health · 2025 - 2030 Deprescribing Decision-Making using Machine Learning Individualized Treatment Rules to Improve CNS Polypharmacy ResearchCo Investigator · Awarded by National Institutes of Health · 2024 - 2029 Integrated Detection and Classification of Sepsis via Tensor Methods Using EHR ResearchCo Investigator · Awarded by National Heart, Lung, and Blood Institute · 2024 - 2029 View All Grants Education, Training & Certifications University of Illinois · 1993 Ph.D. External Links Small Talks about Big Data: Predicting Health Events from EHRs Using Machine Learning CPCP 2017 Retreat: Improved Methods for Discovering Adverse Drug Events from EHR Data High-Throughput Machine Learning from EHR Data",
  "content_length": 3900,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:57"
}