{
  "name": "Davide Careglio",
  "homepage": "http://people.ccaba.upc.edu/careglio",
  "status": "success",
  "content": "Davide Careglio – @Universitat Politècnica de Catalunya Skip to content Full Professor at UPC – BarcelonaTech Researcher at IDEAI-UPC Davide Careglio received the M.Sc. double degree in telecommunications engineering and electrical engineering from Technical University of Catalonia (UPC) (2000) and Politecnico di Torino (2001), respectively, and his PhD from UPC in 2005. His research interests are focused on algorithms and protocols for computer networks with special interests in interoperability, control and management, planning and routing. He has been involved in several EU and industrial research projects. IFIP Networking 2023, Barcelona, June 12-15, 2023. The International Federation for Information Processing (IFIP) Networking 2023 Conference (NETWORKING 2023) will be held in Barcelona, Spain exclusively in-person. This is the 22nd edition of the series, sponsored by the IFIP Technical Committee on Communication Systems (TC6). High quality papers will be recommended for fast track publications in selected journals. The main objective of Networking 2023 is to bring together academic and industrial experts of the networking community to discuss the most recent advances in networking, to highlight key issues, identify trends, and develop a vision of the future Internet from a design, deployment and operation standpoints. Networking 2023 technical sessions will be structured around the following yet non limitative areas: Network Architectures, Applications and Services Network Modeling, Analysis and Operation Network Security and Privacy Wireless Networking Co-guest editor of the special issue: Novel Algorithms and Protocols for Networks II. Other co-guest editors: Francesco Palmieri and Mirosław Klinkowski A special issue of Applied Sciences (ISSN 2076-3417), current impact Factor: 2.679. This special issue belongs to the section Electrical, electronics and communications engineering. Deadline for manuscript submissions: 31 march 2022. Selected publications Davide Careglio, Fernando Agraz, Dimitri Papadimitriou, “A multicast routing scheme for the Internet: simulation and experimentation in large-scale networks”, Applied Sciences vol. 11(12), no. 8645, Sep. 2021, ISSN: 2076-3417, doi, JCR 2020: 2.679 David Sembroiz, Davide Careglio, Sergio Ricciardi, Ugo Fiore, “Planning and operational energy optimization solutions for smart buildings”, Information Sciences vol. 476, pp. 439-452, Feb. 2019, ISSN: 0020-0255, doi, JCR 2019: 5.910 Sergio Ricciardi, Francesco Palmieri, Aniello Castiglione, Davide Careglio, “Energy efficiency of elastic frequency grids in multilayer IP/MPLS-over-flexgrid networks”, Journal of Network and Computer Applications, vol. 56, pp. 41-47, Octuber 2015, ISSN: 1084-8045, doi, JCR 2014: 2.229. Ioannis Tomkos, Siamak Azodolmolky, Josep Solé-Pareta, Davide Careglio, Eleni Palkopoulou, “A Tutorial on the Flexible Optical Networking Paradigm: State-of-the-Art, Trends, and Research Challenges”, Proceedings of the IEEE, vol. 102, no. 9, Sept. 2014, ISSN: 0018-9219, doi, JCR 2014: 4.934. M. Klinkowski, M. Ruiz, L. Velasco, D. Careglio, V. López, J. Comellas, “Elastic spectrum allocation for time-varying traffic in flexgrid optical networks”, IEEE Journal of Selected Areas in Communications, special issue on Next-generation spectrum-efficient and elastic optical transport networks, vol. 31, no. 1, pp. 26-38, January 2013, ISSN: 0733-8716, doi, JCR 2013: 4.138. Josep Solé-Pareta, Suresh Subramaniam, Davide Careglio, Salvatore Spadaro, “Cross-layer approaches for planning and operation impairment-aware optical networks”, Proceedings of the IEEE, special issue on The Evolution of Optical Networks, vol. 100, no. 5, pp. 1118-1129, May 2012, ISSN: 0018-9219, doi, JCR 2012: 6.911. Research My current research interests focus on IoT and programmable networks, both in terms of hardware and software and ranging from physical to network layers. I am a member of the Intelligent Data Science and Artificial Intelligence Research Center (IDEAI-UPC) at the Department of Computer Architecture (DAC) in the UPC. Current projects: • TRAINER – PID2020-118011GB-C21 [Sep. 2021 – Aug. 2024] • HEDY – 2021-1-HU01-KA220-HED-000029536 [Nov. 2021 – Oct. 2023] Academics Associate Professor at the Department of Computer Architecture Department (DAC) of the Technical University of Catalonia (UPC) assigned to the Barcelona School of Informatics (FIB) and to the Barcelona Technical School of Telecommunications Engineering (ETSETB). Current Courses: • Computer Networks II (XCII) [2011-currently] • Computer Networks Technologies (TXC) [2024-currently] Former: • Introduction to Computers (IO) [2003-2007] • Computer Networks (XC) [2006-2019] • Computer Security (SI) [2019-2024] Teacher at the Image Processing and Multimedia Technology Center (CITM), an educational center attached to the Fundació Politècnica de Catalunya (FPC). Current Courses: • Information and Communication Technologies (ICT) [2024-currently] Former: • IT Network Architecture and Security (ASXI) [2015-2024] • IT Architecture and Configuration (ACI) [2015-2022] • The latest WEB design applications II (AWUGII) [2015-2025] Primary Sidebar Widget Area Contact information Universitat Politècnica de Catalunya Department of Computer Architecture Campus nord, Building D6, Office 103 Jordi Girona 1-3 08034, Barcelona, Catalunya, Spain Phone: +34 93 401 69 85 Fax: +34 93 401 70 55 E-mail: davide.careglio [AT] upc.edu Academic databases Opportunities The CBA research group periodically publish a list of opportunities for Master Thesis projects, PhD positions, and junior researchers. Search for: Search Recent Posts IEEE ICTON 2025 IEEE ICTON 2024 OFC2024 ICTON 2023 ICTON 2023 Categories Opportunities (4) Publications (187) Books and book chapters (10) Conferences (115) Invited talks (14) Journals (60) Research (41) Membership committees (6) Past projects (31) Projects (2) Students (2) Teaching (13) xc (6) xc2 (8) Scroll Up",
  "content_length": 5966,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:23"
}