{
  "name": "David Gamez",
  "homepage": "https://www.davidgamez.eu",
  "status": "success",
  "content": "David Gamez D a v i d g a m e Z home publications cv music art downloads contact davidgamez.eu Welcome! This website covers everything connected with me, David Gamez. I am a senior lecturer at the Department of Computer Science, Middlesex University The current focus of my research is the development of a new universal measure of intelligence. I am one of the world's leading experts on machine/artificial consciousness. The publications section has links to a book and papers that I have published in this area. From 2012-2015 I was supported by a JTF Turing Research Fellowship at the Sackler Centre for Consciousness Science, where I worked on a three year project on the scientific study of natural and artificial minds. Between 2010 and 2012 I worked with Murray Shanahan at the Department of Computing at Imperial College London. As part of the EPSRC project 'Modular Neural Simulation with Reconfigurable Hardware' I integrated the NeMo CUDA accelerated neural simulator with my SpikeStream neural simulator and contributed to the development of the iSpike sensory interface for the iCub robot. From 2009-2010 I worked with Igor Aleksander on a new technique for analyzing neural networks for information integration. In 2008 I passed a PhD on machine consciousness supervised by Professor Owen Holland at the University of Essex, UK. This was carried out as part of the EPSRC-funded CRONOS project to build a conscious robot. My contribution to this project included the development of new techniques for analyzing systems for signs of consciousness and I built a spiking neural simulator that I used to model a neural network that controlled the eye movements of a virtual robot. In my previous job on the IST Safeguard project I worked on agents, anomaly-detection and GOFAI. My most recent book, Human and Machine Consciousness, explains how we can neutralise the traditional philosophical problems with consciousness and develop a science of consciousness that can make accurate predictions about the consciousness of humans, animals and machines. My first book, What We Can Never Know, explores the limits of philosophy and science through studies of perception, time, madness and knowledge. I have also co-edited a collection of essays on the nature of philosophy, What Philosophy Is, and written on the invasion of Iraq, alienation and wisdom. Over the years I have worked on a number of music projects, my most recent being a MIDI Agent System that dynamically creates music through the interaction of software agents. I was a key member of the breakbeat band Burning Rubber Icons and I have dabbled in film soundtracks. I have also been involved in various forms of drawing, computer art, photography, painting, film, performance and craft. Feel free to contact me if you have any questions or comments about the material on this site. NOTE: Some of the features of this site depend on Javascript. In Internet Explorer there may be an option to enable JavaScript at the top of the page. Version 2. Last updated 9th June 2023. ~ d a v i d g a m e z . e u ~",
  "content_length": 3074,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:03"
}