{
  "name": "David Madigan",
  "homepage": "http://www.khoury.northeastern.edu/people/david-madigan",
  "status": "success",
  "content": "David Madigan - Khoury College of Computer Sciences All People David Madigan Professor Research interests Research interests Statistics Pharmacovigilance Text mining Monte Carlo methods Probabilistic graphical models Education Education PhD in Statistics, Trinity College Dublin — Ireland Bachelor’s Degree in Mathematical Sciences, Trinity College Dublin — Ireland Biography Biography David Madigan is a professor at the Khoury College of Computer Sciences at Northeastern University and Special Advisor to the President. He served as Northeastern University’s provost and senior vice president for academic affairs from 2020-2025, during which time he was the university's chief academic officer and led its 10 schools and colleges, research enterprises, and libraries. He also collaborated with the senior vice president for finance in order to set the university’s budget and financial priorities. A native of Ireland, Madigan received both his bachelor’s degree in mathematical sciences and his PhD in statistics from Trinity College Dublin. In his career, he has written over 200 publications in areas such as Bayesian statistics, text mining, Monte Carlo methods, pharmacovigilance, and probabilistic graphical models. He has also advised 18 PhD students. In 2012, Madigan was elected a fellow of the American Association for the Advancement of Science; he has been a leading researcher in the fields of healthcare and Big Data. For three years, he was a member of the FDA's Drug Safety and Risk Management Advisory Committee. Madigan came to Northeastern from Columbia University, where he oversaw five schools, 27 departments, and more than 50 research centers and institutes. He led initiatives to expand lifelong learning programs at the university and to make its faculty and study body more diverse. Notably, he launched a program to ensure that Columbia’s first-generation students would have the support they needed to achieve success. Previously, he also held various leadership roles and positions at Rutgers University and the University of Washington. At the latter, he was a part of the world-renowned Fred Hutchinson Cancer Research Center. Additionally, Madigan has served as vice president of data mining at Soliloquy, Inc., principal technical staff member at AT&T Labs-Research, information technology consultant at KPMG, technology manager at Peregrine Expert Systems Ltd., expert system consultant at SkillSoft, and actuarial associate at Hibernian Life Assurance, Ireland. Madigan has led large-scale global collaborations involving researchers from academic institutions, pharmaceutical companies, and government regulators in the United States and Europe. He’s currently one of the leaders of the Observational Health Data Sciences and Informatics program, which is composed of researchers around the world who harness the power of Big Data to study the safety and efficacy of healthcare practices. He has also previously served as editor-in-chief of Statistical Science, a review journal focused on contemporary statistical thought. Individual Details Tenured/Tenure-Track Faculty Campus Boston Google Scholar See Citations Contact d.madigan@northeastern.edu Related news Khoury College celebrates 2025 commencement with record number of graduates May 8, 2025 NGN: Q&A: ‘We’re here for the long haul’ — Provost David Madigan on the university in turbulent times April 10, 2025 News at Northeastern The Cutting-Edge Technological Innovation of the Future Might Be Humans April 6, 2022 Explore all news",
  "content_length": 3531,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:34"
}