{
  "name": "David Kay",
  "homepage": "http://www.cs.ox.ac.uk/people/david.kay",
  "status": "success",
  "content": "David Kay | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyDavid KayDavid Kay Professor David Kay Associate Professor of Computer ScienceE: dkay@cs.ox.ac.ukT: +44 (0)1865 610814 Room 364, Wolfson Building, Parks Road, Oxford OX1 3QD United Kingdom Themes:Computational Biology and Health InformaticsCompleted Projects:AirPROMSynergy – COPDInterestsI work on the application and analysis of numerical/computational schemes for partial differential equations. Of major interest is the development of reliable, practical and efficient finite element schemes for modelling mathematical models arising from physical and biological phenomena. Current fields of interest include: - Multiphysics interaction within the heart and lungs. - Numerical solvers for cardiac bidomian equations. - Computational multiscale lung models. - Stochastic differential equations for ion channel dynamics. - Numerical models for cell movement. - Numerical analysis and finite element analysis. My Google scholar page is here. D. Phil. Funding available:  If you are interested in postgraduate research within my field of research please contact me. Funding and scholarship opportunities available within the department can be found at this web page. Alternative funding opportunities can be found at the DTC website  www.dtc.ox.ac.uk for details. Past Students: - Muhammad Sagheer jointly supervised with Dr Q. Tang (Sussex, 2005). - Richard Welford (Sussex, 2006). - Alex Tomasi (Sussex, 2008). - David Nordsletten jointly supervised with Prof N. Smith (Oxford, 2009). - Miguel Bernabeu jointly supervised with Dr J. Pitt-Francis and Prof B. Rodriguez (Oxford, 2011). - Matthew McCormick jointly supervised with Prof N. Smith (Oxford, 2012). - Aaron Smith jointly supervised with Prof R. E. Baker and Prof P. K. Maini (Oxford, 2012). - Timothy Squires jointly supervised with Prof J. Chapman and Prof A. Noble (Oxford, 2012). - Ciara Dangerfield jointly supervised with Prof B. Rodriguez and Prof K. Burrage (Oxford, 2012). - Chris Arthurs jointly supervised with Dr M. Bishop (Oxford, 2013). - Jean-Charles Seguis jointly supervised with Prof R. Erban and Prof K. Burrage (Oxford, 2013). - Liya Asner jointly supervised with Prof D. Gavaghan and Prof S. Tavener (Oxford 2014). - Lorenz Berger jointly supervised with Dr Rafel Bordas, Dr K. Burrowes and Prof V. Grau (Oxford, 2015). - Linus Schumacher jointly supervised with Prof R. E. Baker and Prof P. K. Maini  (Oxford, 2015). - Brody Foy jointly supervised with Dr Rafel Bordas (Oxford 2018) - Quentin Parsons jointly supervised with Prof A. Muench (Oxford 2019)BiographyI obtained a first class degree in Mathematics and a PhD in Numerical Analysis from Leicester University in 1992 and 1997, respectively. During 1996-1998 I worked as a postdoctoral researcher at UMIST. This was followed by a Postdoctoral position at Oxford University until 1999. In 1999 I became a University Lecturer in Mathematics at the University of Sussex. In the summer of 2007 I was appointed to my current position of University Lecturer in Computational Biology at Oxford University. Away from academic live I enjoy playing and coaching football. I am currently a coach at Mansfield Road Junior Football Club.Selected PublicationsView AllManage publications Lung computational models and the role of the small airways in asthma Brody H Foy‚ Marcia Soares‚ Rafel Bordas‚ Matthew Richardson‚ Alex Bell‚ Amisha Singapuri‚ Beverley Hargadon‚ Christopher Brightling‚ Kelly Burrowes‚ David Kay and others 2019. Details about Lung computational models and the role of the small airways in asthma | BibTeX data for Lung computational models and the role of the small airways in asthma A Computationally Tractable Scheme for Simulation of the Human Pulmonary System Brody H Foy and David Kay 2019. Details about A Computationally Tractable Scheme for Simulation of the Human Pulmonary System | BibTeX data for A Computationally Tractable Scheme for Simulation of the Human Pulmonary System Functional CT imaging for identification of the spatial determinants of small−airways disease in adults with asthma Alex J Bell‚ Brody H Foy‚ Matthew Richardson‚ Amisha Singapuri‚ Evgeny Mirkes‚ Maarten van den Berge‚ David Kay‚ Chris Brightling‚ Alexander N Gorban‚ Craig J Galbán and others 2019. Details about Functional CT imaging for identification of the spatial determinants of small−airways disease in adults with asthma | BibTeX data for Functional CT imaging for identification of the spatial determinants of small−airways disease in adults with asthma ActivitiesRespiratory Modelling Past Students Liya AsnerLorenz BergerBrody FoyJames MbewuQuentin ParsonsAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 4961,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:21"
}