{
  "name": "David F. Kotz",
  "homepage": "http://www.cs.dartmouth.edu/~dfk",
  "status": "success",
  "content": "David Kotz David Kotz — AAAS Fellow, ACM Fellow, IEEE Fellow Professional Personal About me: My vita (pdf) and short bio; see also LinkedIn My ORCID and research profile on Zotero, SCOPUS, ScholarGPS, and Google Scholar My research, my papers, my patents, my group My teaching My advice about writing and research My consulting, arranged through Harbor Experts Current positions: Royal Society Wolfson Visiting Fellow at Imperial College London for academic year 2025-26 Visiting Professor at University College London for academic year 2025-26 Pat and John Rosenwald Professor(*) in the Department of Computer Science at Dartmouth College Principal Investigator of the SPLICE project Faculty affiliate, Dartmouth Center for Technology and Behavioral Health Faculty affiliate, Dartmouth Institute for Security, Technology, and Society (ISTS) (video) Fellow, Harbor Experts -- please contact them to arrange a consulting opportunity. Education: Ph.D. Duke University, 1991. A.B. Dartmouth College, 1986. Choate Rosemary Hall, 1982. Photography and travel: My SmugMug photo site (RSS feed) My Wordpress travel blog (RSS feed) Action: I've endorsed the Contract for the Web -- will you? Activities: Royal Society Wolfson Visiting Fellow at Imperial College London for academic year 2025-26 Visiting Professor in the Center for Digital Health Interventions at ETH Zürich, 2019-20 Fulbright Scholar to India 2008-09; read about it on this blog page. NE111, NE67, NH48, ADK46er #10431 -- having climbed all 115 mountain peaks in New York and New England over 4000' elevation. I was an early co-author of gnuplot. photo with PDP11/34, at Choate Rosemary Hall in 1982. Professional societies: Phi Beta Kappa AAAS Fellow ACM Fellow IEEE Fellow AAIA Fellow *Pat and John Rosenwald Professor This distinguished chair was established in 1986 by Pat and John Rosenwald '52 T'53 to recognize \"a member of the faculty of the Arts and Science\" and to support \"creativity in research and provide the selected individual with opportunities and resources that could be used to contribute measurably to the advancement of knowledge.\" Contact information, and how to pronounce Kotz: Pronounce \"Kotz\" like \"coats\", not \"cots\". Hear me say it. Thanks! Professor David Kotz Department of Computer Science 15 Thayer Drive Dartmouth College Hanover, NH 03755-4404 USA lastname dartmouth.edu +1 603 646-1439 (voice) vCard containing all of the above Tips for visiting Dartmouth Computer Science.",
  "content_length": 2468,
  "method": "requests",
  "crawl_time": "2025-12-01 12:58:59"
}