{
  "name": "David Martins de Matos",
  "homepage": "https://www.l2f.inesc-id.pt/wiki/index.php/David_Martins_de_Matos",
  "status": "success",
  "content": "David Martins de Matos - HLT@INESC-ID David Martins de Matos From HLT@INESC-ID David Martins de MatosProfessor Associado | IID-IT SA-HLT CA1C-3C6E-C757 0000-0001-8631-2870 WjiG890AAAAJ C-5546-2008 54959008500 +351213100305     233 david.matos@inesc-id.pt www.hlt.inesc-id.pt/~david David Martins de Matos graduated in Electrical and Computer Engineering in 1990 from Instituto Superior Técnico (IST), Lisbon. He received a Masters Degree in Electrical and Computer Engineering in 1995 (from IST), on object-oriented programming in distributed systems. In 2005, he received a Doctor of Engineering Degree in Systems and Computer Science (IST), on automatic natural language generation. He has been teaching since 1993 (on logic and functional programming, object-oriented programming, algorithms and data structures, compiler construction, computer architecture, distributed systems, computer graphics, and natural language processing). He was a researcher at INESC, from 1988 to 2000, in the Distributed Systems, Telematic Services and Systems, and Software Engineering Groups. In 1998 he became a member of the Telematic and Computational Systems Center (IST), until 2001, when he became a member of INESC-ID's newly created Spoken Language Systems Lab (L²F). In the past, he participated in several European and National projects, as well as projects in the private sector (banking and telecommunications industries), both national and international. He is a senior member of the ACM (SIGMM, SIGIR) and of the IEEE (Signal Processing Society, Computer Society, Robotics and Automation Society). He is a member of the Order of Portuguese Engineers.His scientific interests include management of linguistic resources; software architectures for natural language engineering; automatic natural language generation and automatic summarization; natural language interfaces; and processing of written language in general. In addition to the above interests, he also conduct research in computational processing of music and applications of machine learning in the health sector. Total Publications: 162Article (Author)Story Generation from Visual Inputs: Techniques, Related Tasks, and ChallengesDaniel Oliveira, Eugénio Ribeiro, David Martins de Matos, Information, vol. 16, n. 9, DOI 10.3390/info16090812, September 2025Modeling Chronic Pain Experiences from Online Reports Using the Reddit Reports of Chronic Pain DatasetDiogo A.P. Nunes, Joana Ferreira Gomes, Fani Neto, David Martins de Matos, Information, vol. 14, n. 4, pages 1-25, DOI 10.3390/info14040237, April 2023Analysis of chronic pain descriptions for base-pathology prediction: the case of rheumatoid arthritis versus spondylitisDiogo A.P. Nunes, Joana Ferreira Gomes, Carlos Vaz, Daniela Oliveira, Sofia Pimenta, Fani Neto, David Martins de Matos, DOR, December 2022Automatic Recognition of the General-Purpose Communicative Functions defined by the ISO 24617-2 Standard for Dialog Act AnnotationEugénio Ribeiro, Ricardo Ribeiro, David Martins de Matos, Journal of Artificial Intelligence Research (JAIR), vol. 73, pages 397-436, DOI 10.1613/jair.1.13280, January 2022Learning low-dimensional semantics for music and language via multi-subject fMRIFrancisco Afonso Raposo, David Martins de Matos, Ricardo Ribeiro, Neuroinformatics, DOI 10.1007/s12021-021-09560-5, January 2022Assessing Kinetic Meaning via Deep Cross-Modal Retrieval of Music and DanceFrancisco Afonso Raposo, David Martins de Matos, Ricardo Ribeiro, Neural Computing and Applications, vol. 33, n. 21, pages 14481-14493, DOI 10.1007/s00521-021-06090-8, April 2021Semantic frame induction through the detection of communities of verbs and their argumentsEugénio Ribeiro, Andreia Sofia Teixeira, Ricardo Ribeiro, David Martins de Matos, Applied Network Science, vol. 5, DOI 10.1007/s41109-020-00312-z, September 2020Pragmatic Aspects of Discourse Production for the Automatic Identification of Alzheimer's DiseaseAnna Maria Pompili, Alberto Abad, David Martins de Matos, Isabel P. Martins, IEEE Journal of Selected Topics in Signal Processing, pages 1-11, DOI 10.1109/JSTSP.2020.2967879, January 2020Deep Dialog Act Recognition using Multiple Token, Segment, and Context Information RepresentationsEugénio Ribeiro, Ricardo Ribeiro, David Martins de Matos, Journal of Artificial Intelligence Research, vol. 66, pages 861-899, December 2019Reconhecimento de Actos de Diálogo Hierárquicos e Multi-Etiqueta em Dados em EspanholEugénio Ribeiro, Ricardo Ribeiro, David Martins de Matos, Linguamática, vol. 11, n. 1, pages 17-40, DOI 10.21814/lm.11.1.278, July 2019An information-theoretic approach to machine-oriented music summarizationFrancisco Afonso Raposo, David Martins de Matos, Ricardo Ribeiro, Pattern Recognition Letters, DOI 10.1016/j.patrec.2019.03.014, March 2019A Multilingual and Multidomain Study on Dialog Act Recognition Using Character-Level TokenizationEugénio Ribeiro, Ricardo Ribeiro, David Martins de Matos, Information, vol. 10, n. 3, DOI 10.3390/info10030094, March 2019Event-Based Summarization using a Centrality-As-Relevance ModelLuís Marujo, Ricardo Ribeiro, Anatole Gershman, David Martins de Matos, João Paulo da Silva Neto, Jaime Carbonell, Knowledge and Information Systems, vol. 50, n. 3, pages 945-968, DOI 10.1007/s10115-016-0966-4, March 2017Using Generic Summarization to Improve Music Information Retrieval TasksFrancisco Afonso Raposo, Ricardo Ribeiro, David Martins de Matos, IEEE/ACM Transactions on Audio, Speech, and Language Processing, vol. 24, n. 6, pages 1119-1128, DOI 10.1109/TASLP.2016.2541299, May 2016Summarization of Films and Documentaries Based on Subtitles and ScriptsAna Marta Simões Aparício, Paulo César Dias Figueiredo, Francisco Afonso Raposo, David Martins de Matos, Ricardo Ribeiro, Luís Marujo, Pattern Recognition Letters, vol. 73, pages 7-12, DOI 10.1016/j.patrec.2015.12.016, April 2016Evaluating pictogram prediction in a location-aware augmentative and alternative communication systemLuís Filipe Garcia, Luís C. Oliveira, David Martins de Matos, Assistive Technology, vol. 28, n. 2, pages 83-92, DOI 10.1080/10400435.2015.1092181, April 2016Exploring Events and Distributed Representations of Text in Multi-Document SummarizationLuís Marujo, Wang Ling, Ricardo Ribeiro, Anatole Gershman, Jaime Carbonell, David Martins de Matos, João Paulo da Silva Neto, Knowledge-Based Systems, vol. 94, pages 33-42, DOI 10.1016/j.knosys.2015.11.005, February 2016Multicore SIMD ASIP for Next Generation Sequencing and Alignment Biochip PlatformsNuno Neves, Nuno Sebastião, David Martins de Matos, Pedro Tomás, Paulo Flores, Nuno Roma, IEEE Transactions on Very Large Scale Integration Systems, vol. 23, n. 7, pages 1287-1300, DOI 10.1109/TVLSI.2014.2333757, July 2015Measuring the Performance of a Location-Aware Text Prediction SystemLuís Filipe Garcia, Luís C. Oliveira, David Martins de Matos, Transactions on Accessible Computing, vol. 7, n. 1, DOI 10.1145/2739998, June 2015On the Application of Generic Summarization Algorithms to MusicFrancisco Afonso Raposo, Ricardo Ribeiro, David Martins de Matos, IEEE Signal Processing Letters, vol. 22, n. 1, DOI 10.1109/LSP.2014.2347582, January 2015Word and Sentence Prediction: Using the best of the two worlds to assist AAC usersLuis Garcia, Luís C. Oliveira, David Martins de Matos, Technology and Disability, vol. 26, n. 2, pages 79-91, DOI 10.3233/TAD-140406, November 2014Revisiting Centrality-as-Relevance: Support Sets and Similarity as Geometric ProximityRicardo Ribeiro, David Martins de Matos, Journal of Artificial Intelligence Reseach - JAIR (ISSN 1076 - 9757), vol. 42, pages 275-308, DOI 10.1613/jair.3387, November 2011Using Unsupervised Word Sense Disambiguation to Guess Verb Subjects on Untagged CorporaPaula Vaz Lobo, David Martins de Matos, Language Forum, vol. 34, n. 1, pages 95-105, January 2008In Proceedings (Author)Language as a predictor of multiple clinical chronic pain assessmentsDiogo A.P. Nunes, Joana Ferreira Gomes, Fani Neto, Apkar Vania Apkarian, Paulo Branco, David Martins de Matos, ECAI 2025, October 2025Acoustic and Linguistic Biomarkers for Cognitive Impairment Detection from SpeechCatarina Botelho, David Gimeno-Gómez, Francisco Teixeira, John Mendonça, Patrícia Pereira, Diogo A.P. Nunes, Thomas Rolland, Anna Maria Pompili, Rubén Solera Ureña, Maria da Ponte, David Martins de Matos, Carlos-D. Martínez-Hinarejos, Isabel Trancoso, Alberto Abad, Proceedings of Interspeech 2025, International Speech Communication Association (ISCA), doi: 10.21437/Interspeech.2025-91, pages 1418-1422, International Speech Communication Association (ISCA), August 2025Automatic Recognition of the General-Purpose Communicative Functions Defined by the ISO 24617-2 Standard for Dialog Act Annotation (Extended Abstract)Eugénio Ribeiro, Ricardo Ribeiro, David Martins de Matos, International Joint Conference on Artificial Intelligence (IJCAI), pages 6948-6953, Macao, August 2023Chronic Pain Patient Narratives Allow for the Estimation of Current Pain IntensityDiogo A.P. Nunes, Joana Ferreira Gomes, Daniela Oliveira, Sofia Pimenta, Fani Neto, David Martins de Matos, 2023 IEEE 36th International Symposium on Computer-Based Medical Systems (CBMS), Institute of Electrical and Electronics Engineers Inc., pages 716-719, IEEE, United States of America, June 2023Active Learning Improves the Teacher’s Experience: A Case Study in a Language Grounding ScenarioFilipe Vaz Reynaud, Eugénio Ribeiro, David Martins de Matos, IberSPEECH 2022, ISCA, pages 141-145, ISCA, Granada, November 2022Chronic Pain and Language: A Topic Modelling Approach to Personal Pain DescriptionsDiogo A.P. Nunes, Joana Ferreira Gomes, Carlos Vaz, Daniela Santos Oliveira, Sofia Pimenta, Fani Neto, David Martins de Matos, 12th Congress of the European Pain Federation EFIC, Dublin, Ireland, April 2022Mapping the Dialog Act Annotations of the LEGO Corpus into ISO 24617-2 Communicative FunctionsEugénio Ribeiro, Ricardo Ribeiro, David Martins de Matos, Proceedings of the ",
  "content_length": 67916,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:47"
}