{
  "name": "David Mohaisen",
  "homepage": "http://cs.ucf.edu/~mohaisen",
  "status": "success",
  "content": "David Mohaisen I am a Professor of Computer Science at the University of Central Florida, with joint appointments in Computer Engineering and Modeling and Simulation. My research is in the area of security and privacy, with a recent focus on machine learning and artificial intelligence, software and networked systems, Internet of Things and wearables, and blockchains. At UCF, I direct the SEAL research group, where I have been fortunate to mentor several excellent students. I obtained my Ph.D. from the University of Minnesota in 2012. I spent several years before and after my Ph.D. in the research and development industry, including working as a research engineer at ETRI in South Korea and as a (senior) research scientist at Verisign Labs. Current Professional Service TPC Member, 35th USENIX Security Symposium, 2026 TPC Member, 26th Privacy Enhancing Technologies Symposium, 2026 TPC Member, 21st ACM Asia Conference on Computer and Communications Security, 2026 TPC Member, 40th Annual AAAI Conference on Artificial Intelligence, 2026 Track co-Chair, 26th IEEE International Symposium · on Cluster, Cloud, and Internet Computing, 2026 Selected Recent Publications NDSS'26 Evaluating Learning-Based Ethereum Phishing Transaction Detection and Pitfalls [PDF] PoPETs'26 Measuring Computational Universality of Fully Homomorphic Encryption [PDF] NDSS'25 A Comparative Evaluation of Large Language Models in Vulnerability Detection [PDF] ICDCS'25 Attributing ChatGPT-Transformed Synthetic Code [PDF] SEC'24 Enhancing Network Attack Detection with Distributed and Data Collection System [PDF] S&P'23 Three Birds with One Stone: Efficient Partitioning of Interdependent Networks [PDF] NDSS'23 A Robust Counting Sketch for Data Plane Intrusion Detection [PDF] CCS'22 A Scalable and Dynamic ACL System for In-Network Defense [PDF] VR'22 A Keylogging Inference Attack on Air-Tapping Keyboards [PDF] CCS'21 Revisiting Nakamoto Consensus in Asynchronous Networks [PDF] CCS'21 SyncAttack: Double-spending in Bitcoin Without Mining Power [PDF] TDSC'25 Semantics-Preserving Node Injection Attacks Against GNN-Based ACFG Malware Classifiers [PDF] TDSC'25 Attributing ChatGPT-Generated Source Codes [PDF] TDSC'24 Analyzing In-Browser Cryptojacking [PDF] TDSC'22 Deep Learning-Based Fine-Grained Approach for Robust Malware Classification [PDF] TMC'24 Learning Location From Shared Elevation Profiles in Fitness Apps: A Privacy Perspective [PDF] TMC'20 Catch Me If You Can: Rogue Access Point Detection Using Intentional Channel Interference [PDF] TON'24 A Comprehensive Analysis of Bitcoin Safety and Chain Quality [PDF] TON'22 A Large-Scale Behavioral Analysis of the Open DNS Resolvers on the Internet [PDF] TON'22 Exploring Partitioning Attacks on the Bitcoin Network [PDF] Doctoral Advisees P Cuong Dang (2025--) P Mandana Ghadamian (2025--) P Khalid Alquonus (2025--) P Steffen Camarato (2025--) P Mukhtar Hussain (2025--) P Pelumi Ogunwale (2025--) P Niveen Jaffal (2024--)3 P Ahmed Sabbah (2022--)3 P Mo Kharma (2022--)3 P Soohyeon Choi (2025) P Aziz Alghamdi(2025) P Ahod Alguried (2025) P Ilkin Isler (2025)2 P Ali Alkinoon (2025) P Jie Lin (2025) P Mohammed Alqadhi (2024) P Mohammed Alkinoon (2024) P Ayodeji Adeniran (2024) P Hattan Althebeiti (2023) P Ulku Meteriz (2022) P Ahmed Abusnaina (2022) P A. Alabduljabbar (2022) P Muhammad Saad (2021) P Afsah Anwar (2021) P Sultan Alshamrany (2021) P Hisham Alasmary (2020) P Mo Abuhamad (2020)1 P Rhongho Jang (2020)1 P Jinchun Choi (2020)1 P Jeman Park (2020) P Ashar Ahmad (2019) P Jeff Spaulding (2018) 1 UCF-INHA Dual Ph.D. Program; co-advised with DaeHun Nynag. 2 Originally Ulas's student; co-advised with Damla Turgut and Ulas Bagci. 3 External co-advisees. P Former. P Current. Honors and Awards 2025 — Faculty Excellence in Mentoring Doctoral Students, UCF (University-wide recognition). 2024–2027 — ACM Distinguished Speaker, Association for Computing Machinery. 2024 — Best Paper Award, International Workshop on Information Security Engineering (WISE 2024). 2022 — UCF Teaching Incentive Award for Excellence in Teaching. 2022 — UCF Research Incentive Award for Excellence in Research. 2022 — CECS Excellence in Graduate Teaching Award, College of Engineering and Computer Science, UCF. 2022 — Best Paper Award Nominee, IEEE Virtual Reality Conference (IEEE VR 2022). 2021 — Best Extended Abstract Award, IEEE International Conf. on Dependable Sys. and Networks (DSN 2021). 2021 — Best Student Paper Award Nominee, ACM International Conference on Supercomputing (ACM ICS 2021). 2020 — Best Paper Award, IEEE Systems Journal. 2016–2021 — Distinguished Technical Program Committee Member, IEEE IEEE INFOCOM. Openings At this time, I am not seeking new doctoral students to join my research group. However, UCF students interested in pursuing the thesis option for their graduate studies, as well as undergraduates looking for research opportunities, are welcome to contact me. I encourage motivated students who wish to gain research experience to reach out and discuss potential projects. Contact Building: L3Harris Corporation Engineering Center (HEC) Room: 207 Address: 4328 Scorpius St, Orlando, FL 32816 Email: david.mohaisen@ucf.edu",
  "content_length": 5230,
  "method": "requests",
  "crawl_time": "2025-12-01 12:59:48"
}