{
  "name": "Dawei Cheng",
  "homepage": "http://cs1.tongji.edu.cn/~dawei",
  "status": "success",
  "content": "Dawei Cheng Dawei Cheng Associate Professor Tongji University Email: dcheng AT tongji.edu.cn Biography Dawei Cheng (ç¨å¤§ä¼) is currently an associate professor appointed at the School of Computer Science and Technology of Tongji University (åæµå¤§å­¦), Shanghai, China. I serve as dean assistant of Collaborative Innovation Center of Internet Finance Safety, and guest Ph.D. supervisor at the University of Technology Sydney, Australia. I specialize in data mining, machine learning, deep learning and reinforcement learning. Now I mainly focus on graph learning, big data in finance, deep learning in complex graphs, generative artificial intelligence and large-scale graph analysis. Prior to now, I was a postdoctoral associate at Center for Brain-like Computing and Machine Intelligence (BCMI), Shanghai Jiao Tong University (SJTU) , China. Before that, I obtained my Ph.D degree in computer science from Shanghai Jiao Tong University, supervised by Prof. Liqing Zhang and bachelor degree from Nanjing University of Aeronautics and Astronautics. Interests Big Data in Finance Graph Learning, Data Mining Deep Learning and AIGC Deep Reinforcement Learning Academic Services AC/SPC/PC of ICML, ICLR, NeurIPS, KDD, ACL, ICDE, AAAI, IJCAI, etc. AE/Reviewer of TKDE, TPAMI, TNNLS, TKDD, PR, FCS, etc. Distinguished Member of CCF Shanghai News Elected as World's Top 2% Scientists by Standford University and Elsevier. Updated on Sep 28, 2025 My responsible National Science Foundation of China was approved. Graph Data Learning (NSFC Young Scientists Fund, Class B). Updated on Aug 30, 2025. 3 Years. Elected as the Best Reviewer for KDD 2025. Updated on Jun 28, 2025 Deliver a Tutorial about AIGC for Graphs on ICDE 2025. Updated on May 22, 2025 Two papers about LLMs for Multi-Agent Systems were accepted by ACL. Updated on May 16, 2025 Two papers were accepted by IJCAI and two by ICML 2025, respectively. Updated on May 1, 2025 è·ä¸­å½äººå·¥æºè½å­¦ä¼å´æä¿äººå·¥æºè½ç§æè¿æ­¥ä¸ç­å¥ï¼ç¬¬äºå®æäººï¼. Updated on Feb 20, 2025 Two papers (Corresponding) on fraud detection were accepted by TKDE. Updated on Feb 10, 2025 Four papers (three corresponding) were accepted by WWW 2025. Updated on Jan 25, 2025 è·ä¸æµ·å¸ä¼ç§åæéæèµä¼ç§åæéå¥. Updated on Jan 18, 2025 Two papers (Co-corresponding) were accepted by ICLR 2025. Updated on Jan 16, 2025 Two papers (Corresponding) on Graph Generation were accepted by ICDE. Updated on Dec 27, 2024 Three papers (Corresponding) were accepted by NeurlPS and AAAI 2025. Updated on Dec 18, 2024 æ ä»»ä¸­å½è®¡ç®æºå­¦ä¼æ°å­éèåä¼ (CCF Digitial Finance) å¯ç§ä¹¦é¿. Updated on Dec 10, 2024 Two papers (Corresponding) on Interbank were accepted by TNNLS. Updated on Oct 25, 2024 My responsible National Science Foundation of China was approved. Simulation of Risk Contagion with Generative Graph Learning. Updated on Aug 26, 2024. 4 Years. Invited to serve as (Meta) Reviewer for NeurIPS/AAAI/KDD/IJCAI 2025. Updated on Jul 22, 2024 Three papers were accepted by CIKM 2024. Updated on Jul 17, 2024 One paper (Corresponding) was accepted by TKDE 2024. Updated on May 23, 2024 Launch Joint Reseach with Tencent WeChat Pay (å¾®ä¿¡æ¯ä»). Detecting organized fraudsters with diffusion model and graph-augmented learning. Updated on May 8, 2024. Two papers (Co-corresponding) were accepted by ICML 2024. Updated on May 2, 2024 We freshly updated the open-source risk rating project for (Interbank). Updated on Apr 20, 2024 Three papers (Corresponding) were accepted by IJCAI 2024. Updated on Apr 17, 2024 I was invited to serve as (Meta) Reviewer for IJCAI/KDD/ICML 2024. Updated on Jan 5, 2024 Two papers were accepted by AAAI and ICLR 2024, respectively. Updated on Dec 31, 2023 Awarded Shanghai Youth Top Talent Program (ä¸æµ·å¸éå¹´æå°äººæè®¡å). Updated on Sep 12, 2023 One Paper (Corresponding) was accepted by SIGKDD 2023. Updated on May 17, 2023 Two Papers (Corresponding) were accepted by IJCAI 2023. Updated on Apr 25, 2023 We released an open source fraud detection project (Antifraud). Updated on Apr 17, 2023 One Paper (first author) on Group-aware GNN was accepted by TKDE. Updated on Apr 10, 2023 I'm serving as Senior PC (Meta Reviewer) for IJCAI 2023. Updated on Dec 25, 2022 Two Papers (Corresponding) were accepted by AAAI 2023. Updated on Nov 20, 2022 Awarded the ACM Shanghai Rising Star (ACMä¸­å½ä¸æµ·æ°æå¥). Updated on Oct 12, 2022 One Paper (first author) was accepted by TKDE 2022. Updated on Mar 12, 2022 One Paper (Corresponding) was accepted by ICDE 2022. Updated on Mar 6, 2022 Won WAIC Outstanding Paper Award (ä¸çäººå·¥æºè½å¤§ä¼éå¹´ä¼ç§è®ºæå¥). Updated on Feb 20, 2022 One Paper (Corresponding) was accepted by TASLP 2022. Updated on Feb 15, 2022 Lanuch a Joint Research Project with China Financial Futures Exchange Focus on event-based risk regulation via deep graph learning techniques. Updated on Jan 12, 2021. æ ä»»å½å®¶çº§ç½ç»éèå®å ¨åååæ°ä¸­å¿ä¸»ä»»å©çã Updated on Dec, 2021 Two Papers (Corresponding) were accepted by The VLDB Journal 2021. Updated on Aug 28, 2021 My responsible National Science Foundation of China was approved. Risk assessment by deep graph learning (NSFC Young Scientists Fund, Class C). Updated on Aug 18, 2021. 3 Years. One Paper (first author) was accepted by TKDE 2021. Updated on Jun 21, 2021 Launch Joint Reseach with China UnionPay Fraud and money laundering detection by deep graph learning and reinforcement learning. Updated on Feb 18, 2021. One Paper (first & corresponding) was accepted by Pattern Recognition. Updated on Feb 16, 2021 I'm attending IJCAI-PRICAI 2020. Updated on Jan 12, 2021 Give a talk about financial knowledge graph for CMBC I will deliver a training about \"financial knowledge graph and its applications in banking industry\" for CMBC(China Merchants Bank) Updated on Dec 21, 2020. 4 sessions. One Paper (first author) on graph learning was accepted by TKDE. Updated on Sep 3, 2020 One Paper (first author) was accepted by SIGKDD 2020. Updated on May 25, 2020 One Paper (first author) was accepted by TNNLS 2020. Updated on Apr 21, 2020 Three Paper were accepted by AAAI 2020. Updated on Dec 5, 2019 Lanuch a Joint Research Project with Morgan-Stanley Focus on fraud transaction detection, specialized in suspicious transactions detection in the futures market. Updated on Nov 10, 2019. One Paper on Risk Assessment was accepted by è®¡ç®æºå­¦æ¥ 2019. Updated on Oct 10, 2019 One Paper on Graph Learning was accepted by IJCAI 2019. Updated on May 15, 2019 My responsible China Postdoctoral Science Foundation was approved. Updated on Apr 3, 2019 Selected Publications Sheng Xiang, Guibin Zhang, Dawei Cheng*, Ying Zhang, âEnhancing Attribute-Driven Fraud Detection With Risk-Aware Graph Representationâ IEEE Transactions on Knowledge and Data Engineering. 2025. PDF ç¨å¤§ä¼, è´¾ä»å, ææ±å½¤, ä¸å¿å, èæä¿*, âç¥è¯å¢å¼ºçä¸­æéèå¤§æ¨¡åç ç©¶â ãå¤§æ°æ®ã. 2025. PDF Junyi Liu, Dawei Cheng*, Changjun Jiang, âPreferential Selective-Aware Graph Neural Network for Preventing Attacks in Interbank Credit Ratingâ IEEE Transactions on Neural Networks and Learning Systems. 2024. PDF Y Bian, X Ju, J Li, Z Xu, D Cheng*, Q Xu, âMulti-Patch Prediction: Adapting Language Models for Time Series Representation Learningâ ICML. 2024. PDF Dawei Cheng, Yujia Ye, Sheng Xiang, Zhenwei Ma, Ying Zhang, Changjun Jiang, âAnti-money laundering by group-aware deep graph learningâ IEEE Transactions on Knowledge and Data Engineering. 2023. PDF Junyi Liu, Dawei Cheng, Changjun Jiang, âPreventing Attacks in Interbank Credit Rating with Selective-aware Graph Neural Networkâ IJCAI. 2023. PDF Dawei Cheng, Zhibin Niu, Jie Li, Changjun Jiang, âRegulating systemic crises: Stemming the contagion risk in networked-loans through deep graph learningâ IEEE Transactions on Knowledge and Data Engineering. 2022. PDF S. Xiang, D. Cheng*, J. Zhang, Z. Ma, X. Wang, Y. Zhang, âEfficient Learning-based Community-Preserving Graph Generationâ ICDE. 2022. PDF S. Xiang, D. Wen, D. Cheng*, Y. Zhang, et.al, âGeneral graph generators: experiments, analyses, and improvementsâ The VLDB Journal. 2021. PDF Cite P. Zhu, D. Cheng*, F. Yang, et. al, âImproving Chinese Named Entity Recognition by Large-Scale Syntactic Dependency Graphâ IEEE/ACM Transactions on Audio, Speech, and Language Processing. 2022. PDF Cite D. Cheng, X. Wang, Y. Zhang, S. Xiang, âEfficient Top-k Vulnerable Nodes Detection in Uncertain Graphsâ IEEE Transactions on Knowledge and Data Engineering. 2021. PDF Cite D Wen, B Yang, Y Zhang, L Qin, D Cheng*, W Zhang, âSpan-reachability querying in large temporal graphsâ The VLDB Journal. 2021. PDF Cite D. Cheng, Z. Niu, Y. Zhang, âContagious Chain Risk Rating for Networked-guarantee Loansâ ACM SIGKDD. 2020. PDF Cite D. Cheng, F. Yang, S. Xiang, J. Liu, âFinancial Time Series Forecasting with Multi-Modality Graph Neural Networkâ Pattern Recognition. 2021. PDF Cite ç¨å¤§ä¼, çå¿å½¬, åæ°æµ·, å¼ ä¸½æ¸ , âå¤ææ ä¿ç½ç»ä¸­ä¼ æè·¯å¾çé£é©è¯ä¼°â ãä¸­å½ç§å­¦: ä¿¡æ¯ç§å­¦ã. 2021. PDF D. Cheng, X. Wang, Y. Zhang, L. Zhang, âGraph Neural Network for Fraud Detection via Spatial-temporal Attentionâ IEEE Transactions on Knowledge and Data Engineering. 2020. PDF Cite D. Cheng, Z. Niu, L. Zhang, âDelinquent Events Prediction in Temporal Networked-Guarantee Loansâ IEEE Transactions on Neural Networks and Learning Systems. 2020. PDF Cite D. Cheng, S. Xiang, C. Shang, Y. Zhang, F. Yang, L. Zhang, âSpatio-Temporal Attention-Based Neural Network for Credit Card Fraud Detectionâ AAAI. 2020. PDF Cite D. Cheng, F. Yang, X. Wang, Y. Zhang, L. Zhang, âKnowledge Graph-based Event Embedding Framework for Financial Quantitative Investmentsâ ACM SIGIR. 2020. PDF Cite D. Cheng, X. Wang, Y. Zhang, L. Zhang, âRisk Guarantee Prediction in Networked-Loansâ IJCAI. 2",
  "content_length": 12426,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:21"
}