{
  "name": "Dawn C. Walker",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/dawn-walker",
  "status": "success",
  "content": "Dr Dawn Walker | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Dawn Walker School of Computer Science Senior Lecturer School Student Recruitment Lead Member of the Complex Systems Modelling research group Open staff member portrait in a modal window d.c.walker@sheffield.ac.uk +44 114 222 1914 Regent Court (DCS) Full contact details Dr Dawn Walker School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0001-8801-8093 Google Scholar Personal website Profile Dr Dawn Walker is a senior lecturer in the Computational Biology Group in the Department of Computer Science. Her primary research interest is the use of individual-based models to understand the function and structure of biological tissues.She is also interested in multi-scale and multi-paradigm models in biology and medicine, and the use of bioelectric properties of epithelial tissues in early cancer diagnosis. Research interests Agent (individual) based Modelling in predicting emergent properties of biological tissuesMultiscale Modelling in biological and biomedical applicationsElectrical Impedance Spectroscopy (EIS) for the diagnosis of early cancerous changes in epithelial tissues Publications Journal articles Lin Z, Lang Z-Q, Guo L, Walker DC, Matella M, Wang M & Murdoch C (2025) Deep learning-based electrical impedance spectroscopy analysis for malignant and potentially malignant oral disorder detection. Scientific Reports, 15. View this article in WRRO Wertheim KY, Chisholm R, Richmond P & Walker D (2024) Multicellular model of neuroblastoma proposes unconventional therapy based on multiple roles of p53. PLOS Computational Biology, 20(12). View this article in WRRO Borau C, Chisholm R, Richmond P & Walker D (2024) An agent-based model for cell microenvironment simulation using FLAMEGPU2. Computers in Biology and Medicine, 179. View this article in WRRO Matella M, Hunter K, Balasubramanian S & Walker D (2024) The use of virtual tissue constructs that include morphological variability to assess the potential of electrical impedance spectroscopy to differentiate between thyroid and parathyroid tissues during surgery. Sensors, 24(7). View this article in WRRO Matella M, Hunter K, Balasubramanian S & Walker DC (2024) Multiscale model development for electrical properties of thyroid and parathyroid tissues. IEEE Open Journal of Engineering in Medicine and Biology, 5, 661-669. View this article in WRRO Borau C, Wertheim KY, Hervas-Raluy S, Sainz-DeMena D, Walker D, Chisholm R, Richmond P, Varella V, Viceconti M, Montero A , Gregori-Puigjané E et al (2023) A multiscale orchestrated computational framework to reveal emergent phenomena in neuroblastoma. Computer Methods and Programs in Biomedicine, 241. View this article in WRRO Italia M, Wertheim KY, Taschner-Mandl S, Walker D & Dercole F (2023) Mathematical model of clonal evolution proposes a personalised multi-modal therapy for high-risk neuroblastoma. Cancers, 15(7). Mason AS, Varley CL, Foody OM, Li X, Skinner K, Walker D, Larson TR, Wakamatsu D, Baker SC & Southgate J (2022) LPCAT4 knockdown alters barrier integrity and cellular bioenergetics in human urothelium. International Journal of Molecular Sciences, 23(19). Heath JP, Hunter KD, Murdoch C & Walker DC (2022) Computational modelling for electrical impedance spectroscopy-based diagnosis of oral potential malignant disorders (OPMD). Sensors, 22(15). View this article in WRRO Kondylakis H, Ciarrocchi E, Cerda-Alberich L, Chouvarda I, Fromont LA, Garcia-Aznar JM, Kalokyri V, Kosvyra A, Walker D, Yang G & Neri E (2022) Position of the AI for Health Imaging (AI4HI) network on metadata models for imaging biobanks. European Radiology Experimental, 6(1). de Melo Quintela B, Hervas-Raluy S, Garcia-Aznar JM, Walker D, Wertheim KY & Viceconti M (2022) A theoretical analysis of the scale separation in a model to predict solid tumour growth. Journal of Theoretical Biology, 547. View this article in WRRO Martí-Bonmatí L, Alberich-Bayarri Á, Ladenstein R, Blanquer I, Segrelles JD, Cerdá-Alberich L, Gkontra P, Hero B, García-Aznar JM, Keim D , Jentner W et al (2020) PRIMAGE project : predictive in silico multiscale analytics to support childhood cancer personalised evaluation empowered by imaging biomarkers. European Radiology Experimental, 4(1). Ingham-Dempster TA, Rosser R, Corfe BM & Walker DC (2020) From cell to multi-crypt: Agent-based models of the human colon suggests novel processes of field cancerisation. Journal of Computational Science, 41. Viceconti M, Bna S, Tartarini D, Sfakianakis S, Grogan J, Walker D, Gamble S, Testi D & CHIC Project Consortium (2018) VPH-HF: A software framework for the execution of complex subject-specific physiology modelling workflows. Journal of Computational Science, 25, 101-114. View this article in WRRO Ingham Dempster T, Corfe BM & Walker DC (2018) A cellular based model of the colon crypt suggests novel effects forApc phenotype in colorectal carcinogenesis. Journal of Computational Science, 24, 125-131. View this article in WRRO Ingham Dempster T, Walker DC & Corfe BM (2017) An agent-based model of anoikis in the colon crypt displays novel emergent behaviour consistent with biological observations. Royal Society Open Science, 4(4), 160858-160858. View this article in WRRO Eze PU, Walker DC & Achumba IE (2016) Constructive Initialization of a Genetic Algorithm for the Solution of a Highly Constrained Departmental Timetabling Problem. International Journal of Soft Computing and Engineering, 6(4), 18-25. View this article in WRRO Zhang Z, Bedder M, Smith SL, Walker D, Shabir S & Southgate J (2016) Characterization and Classification of Adherent Cells in Monolayer Culture using Automated Tracking and Evolutionary Algorithms. Biosystems, 146, 110-121. View this article in WRRO Appleby PA, Shabir S, Southgate J & Walker D (2015) Sources of variability in cytosolic calcium transients triggered by stimulation of homogeneous uro-epithelial cell monolayers. Interface, 12(105). View this article in WRRO Appleby PA, Shabir S, Southgate J & Walker D (2013) Cell-type-specific modelling of intracellular calcium signalling: a urothelial cell model.. J R Soc Interface, 10(86), 20130487. Shabir S, Cross W, Kirkwood LA, Pearson JF, Appleby PA, Walker D, Eardley I & Southgate J (2013) Functional expression of purinergic P2 receptors and transient receptor potential channels by the human urothelium. American Journal of Physiology Renal Physiology, 305(3), F396-F406. Khodabakhshi G, Walker D, Scutt A, Way L, Cowie RM & Hose DR (2013) Measuring three-dimensional strain distribution in tendon. Journal of Microscopy, 249(3), 195-205. Walker DC & Southgate J (2013) The modulatory effect of cell–cell contact on the tumourigenic potential of pre-malignant epithelial cells: a computational exploration.. J R Soc Interface, 10(78), 20120703. Burkitt M, Walker D, Romano DM & Fazeli A (2012) Constructing Complex 3D Biological Environments from Medical Imaging Using High Performance Computing. IEEE/ACM Transactions on Computational Biology and Bioinformatics (ACM), 9(3), 643-654. Burkitt M, Walker D, Romano DM & Fazeli A (2012) Using computational modeling to investigate sperm navigation and behavior in the female reproductive tract.. Theriogenology, 77(4), 703-716. Burkitt M, Walker D, Romano DM & Fazeli A (2011) Computational modelling of maternal interactions with spermatozoa: Potentials and prospects. Reproduction Fertility and Development, 23(8), 976-989. Halliday I, Atherton M, Care CM, Collins MW, Evans D, Evans PC, Hose DR, Khir AW, König CS, Krams R , Lawford PV et al (2011) Multi-scale interaction of particulate flow and the artery wall. Medical Engineering and Physics, 33(7), 840-848. Caiazzo A, Evans D, Falcone J-L, Hegewald J, Lorenz E, Stahl B, Wang D, Bernsdorf J, Chopard B, Gunn J , Hose R et al (2011) A Complex Automata approach for in-stent restenosis: Two-dimensional multiscale modelling and simulations. Journal of Computational Science. Halliday I, Atherton M, Care CM, Collins MW, Evans D, Evans PC, Hose DR, Khir AW, König CS, Krams R , Lawford PV et al (2011) Multi-scale interaction of particulate flow and the artery wall.. Med Eng Phys, 33(7), 840-848. Georgopoulos NT, Kirkwood LA, Walker DC & Southgate J (2010) Differential regulation of growth-promoting signalling pathways by E-cadherin. PLoS ONE, 5(10). Richmond P, Walker D, Coakley S & Romano D (2010) High performance cellular level agent-based simulation with FLAME for the GPU.. Brief Bioinform, 11(3), 334-347. Walker DC, Georgopoulos NT & Southgate J (2010) Anti-social cells: predicting the influence of E-cadherin loss on the growth of epithelial cell populations.. J Theor Biol, 262(3), 425-440. Fazeli A, Burkitt M, Walker D & Romano DM (2009) The Virtual Oviduct: An Essential Tool for the Application of Computational Biology Approaches to Investigation of Maternal Interaction with Gametes and Embryo.. Biology of Reproduction, 81(Suppl_1), 299-299. Walker DC & Southgate J (2009) The virtual cell--a candidate co-ordinator for 'middle-out' modelling of biological systems.. Brief Bioinform, 10(4), 450-461. Walker DC, Georgopoulos NT & Southgate J (2008) From pathway to population--a multiscale model of juxtacrine EGFR-MAPK signalling.. BMC Syst Biol, 2, 102. Lawford PV, Ventikos Y, Khir AW, Atherton M, Evans D, Hose DR, Care CM, Watton PN, Halliday I, Walker DC , Hollis AP et al (2008) Modelling the interaction of haemodynamics and the artery wall: current status and future prospects.. Biomed Pharmacother, 62(8), 530-535. Evans DJW, Lawford PV, Gunn J, Walker D, Hose DR, Smallwood RH, Chopard B, Krafczyk M, Bernsdorf J & Hoekstra A (2008) The application of multiscale modelling to the process of development and prevention of stenosis in a stented coronary artery.. Philos Trans A Math Phys Eng Sci, 366(1879), 3343-3360. Evans DJ",
  "content_length": 18269,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:25"
}