{
  "name": "Dean Mohamedally",
  "homepage": "http://www0.cs.ucl.ac.uk/staff/D.Mohamedally",
  "status": "success",
  "content": "Prof. Dean Mohamedally - UCL PROF. Dean Mohamedally Software Systems Engineering Group UCL Home ›› Computer Science ›› Software Systems Engineering ›› People ›› Dean Mohamedally Home Teaching Research Corporate Interests HTML5 FTW Prof. Dean Mohamedally Professor in Computer Science specialising in Software Engineering and Industry Projects Co-Chair for the National Framework for Industry Exchange Networks Projects Director for the UCL Industry Exchange Network (UG/CS/SSE) Software Systems Engineering Group Technology Transfer and Apps Strategy for UCL Email: D.Mohamedally (at) ucl.ac.uk Department of Computer Science University College London Gower Street London, WC1E 6BT United Kingdom My module office hours are Tuesday, 1pm by Email appointment Office: Room 3.07, EFB / Remote \"Hello world. Students must publish their work to be seen.\" I am a Professor in Computer Science, specialising in Software Engineering and Industry Projects and a member of the Software Systems Engineering group at the Department of Computer Science, University College London. I am the author of the Industry Exchange Network (IXN) methodology. I have built globally recognised pipelines for industry-led Proof of Concept initiatives in degree-level teaching that raise university engagement with industry requirements on all levels of non-research path Computer Science classes. I am the Co-Chair of the National Framework for IXNs which is a government recognised national programme with partner universities and organisations, to bring industry engagement on to degree level education. I am one of the inventors and Projects Directors of the UCL IXN which implemented and iterated the IXN methodology since I co-founded it with Dr Graham Roberts and Geoff Hughes in 2011. I am also the Chair for the IXN for the NHS Programme working with clinical teams and NHS trusts on early R&D projects. I lead on several software publishing initiatives at UCL, notably software production in collaboration with Microsoft. I support a number of student and academic initiatives within software publication, licencing and open source. For this we work with the UCL Computer Science Strategic Alliances Team, UCL ISD, UCL Business, UCL Legal, UCL Finance and UCL Comms and Marketing. As of 2023, we now have over 900 candidates in the Department of Computer Science, 470 of which are in course modules that involve applied and industry-oriented software engineering, but we cover a lot more. Please refer to our prospectus for students on all of our courses. Our IXN programme is centred around term-time teaching with students based in our labs at UCL, with all sectors of industry clients engaging with the students on Proof of Concepts (PoC). I cover the fields of Software Engineering and Systems Integration development on the IXN, but also align interests with our other UCL CS Projects Coordinators and Module Leads. The IXN programme was reported in the NHS England Topol Review (2019) as a best practice for early R&D and received recognition and support by the UK Govt's Foreign and Commonwealth Office. Our IXN for the NHS programme oversees one of the largest calls for early PoC R&D in healthcare, with software engineering projects collaborations with NHS trusts and groups across the country. I steer the UCL Next-Step Internships team alongside the UCL CS Strategic Alliances Team, to help Computer Science students onto summer internships, paid and charitable (including schools outreach and teaching). I help to coordinate the UCL Computer Science Society, several student special interest groups (Touchless systems, IoT integration, VR/AR/XR, Healthtech and devices, User Centred Design, Accessibility, Drones, Digital Storytelling, Games Development). I am keen to hear from entrepreneurial/think tank students who apply their CS learning to other fields and disciplines, inventive students with ideas for humanitarian needs, and students who engage on teaching others and those who are interested in developing games technologies with accessibility driven by AI, NLP and Computer Vision. I work with UCL Communications and Marketing to highlight student projects and achievements. We also drive a wide portfolio of student hackathons and CS student showcase events. I am a Fellow of the Higher Education Academy and Member of the British Computing Society. I previously (2011-2019) was Projects Director for Apps Engineering for all of UCL's faculties, and together with UCL Legal and UCL Engineering we enable students to participate on intercollegiate and internal research projects as part of their respective courses. This role is now a part of the main UCL IXN programme with teaching and administration team that oversees all incoming project requests. If other faculties want to contact me about CS engaged project requirements they can get in touch with me. A role I keep close attention to is on Technology Transfer (primarily to syllabus and learning domains). Companies and research groups are welcome to contact me with regards to new technology platforms and deployment. I am an executive member of the Institute for Healthcare Engineering, Digital Humanities and a teaching member our Virtual Environments group. I am a founder and project lead on the UCL MotionInput project, developing touchless computing interactions with AI My academic speciality is in Constructionism and Problem based learning within Computer Science education. My area of interest is on software construction best practices in Software Engineering education and the application of Computer Science in general education. I am also interested in AI driven interaction and visualisation, Ethnic diversity access for all in education, enabling open science and open source school-based learning mechanisms for problem based learning and constructionist reinforcement methods. Key links: UCL Computer Science's Industry Exchange Network (IXN) for the NHS (Healthcare) Students Abstracts Book 2023 (covers 5 years of student projects)- * Latest Abstracts Now Available * UCL Computer Science's Industry Exchange Network (IXN) Students Abstracts Book 2020 UCL Computer Science's Industry Exchange Network (IXN) Students Abstracts Book 2019 UCL Computer Science's Industry Exchange Network (IXN) Students Abstracts Book 2018 UCL IXN Project Requests Form for Industry Partners 2019 (*updated*) NHS England Topol Review (2019) UCL Computer Science and Microsoft UK Joint White Paper 2017 UCL Computer Science's Student Showcase Video 2017 Related links MotionInput Games, a spinout of UCL Computer Science https://www.facenav.org - a website for individual users and patients to download our free software Our Intel press release for MotionInput BMJ Article BMJ Abstract with GOSH Wired Article GOSH DRIVE Unit Launch 2021 - MotionInput supported by Intel, Microsoft, IBM and the NHS 2017 - UCL HoloRepository with Microsoft HoloLens team (front page of the Microsoft product) 2012 - Windows 8 Education Launch in the UK with UCL CS and Hartsbrook Primary School, Tottenham London Department of Computer Science - University College London - Gower Street - London - WC1E 6BT - +44 (0)20 7679 7214 - Copyright © 1998-2011 UCL Disclaimer | Accessibility | Privacy | UCL Search | UCL-CS Help",
  "content_length": 7269,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:33"
}