{
  "name": "Dean Pemberton",
  "homepage": "https://ecs.victoria.ac.nz/Main/DeanPemberton",
  "status": "success",
  "content": "Dean Pemberton | Te Kura Mātai Pūkaha, Pūrorohiko / School of Engineering and Computer Science | Te Herenga Waka—Victoria University of Wellington Dean Pemberton Please Note This person can no longer be contacted through the School of Engineering and Computer Science at Victoria University of Wellington Qualifications BSc, MSc Biography Dean has worked on both sides of the fence. He has spent time in his career as both a technical trainer, as well as an operational network engineer. While at Ascend Communications and Lucent Technologies, Dean worked as an Asia-Pacific based network troubleshooter traveling across the region debugging and fixing networks. He was also lucky enough to assist both organisations develop their technical qualification programmes. Dean went on to work for Juniper Networks in the dual role of Senior Network Engineer and Technical Trainer, jointly gaining qualifications across the technical (JNCIP) and teaching fields (JNAT). While at Juniper, Dean not only supported some of the largest carrier networks within the region, but also traveled extensively giving both 5 day introductory workshops as well as one day intensive programmes. Upon returning to New Zealand in the mid 2000's, Dean has worked for both public and private sector organisations in a number of technical and policy roles. Currently he is an independent contractor working with InternetNZ in the position of Technical Policy Analyst. It is through this role that Dean plays an active part in the policy development processes of APNIC and other international organisations. Dean continues to provide knowledge and leadership to the New Zealand Internet community through board and trustee positions with the New Zealand Network Operators Group (NZNOG), the New Zealand IPv6 Task Force, and the Wellington Loop Trust. He is a board member of the Asia Pacific Internet Accociation as well as co-chair of the APRICOT conference Management and Programme committees. Network Security is Dean's other area of expertise. Along with a Masters degree in Computer Science specialising in network attack detection techniques, he holds a board level position with the New Zealand Internet Task Force, a non-profit organisation charged with improving the cyber-security posture of the New Zealand Internet. For the University of Oregon based Network Startup Resource Centre (nsrc.org) Dean teaches and leads workshops as well as providing direct engineering assistance designing and implementing network changes at locations in Asia, the Pacific and Africa. Research Interests My area of interest is in Software Defined Networking (SDN). SDN is defined as: A network in which the control plane is physically separate from the forwarding plane A single control plane controls several forwarding devices “That’s it.” See http://www.opennetsummit.org/pdf/2013/presentations/nick_mckeown.pdf for some more SDN background My role within ECS is to Direct development of SDN teaching curriculum within NWEN Assist in the integration of SDN paradigms into SWEN, ECEN, and ENGR courses Supervise students at Undergraduate and Postgraduate level Engage with industry to ensure that research being performed conforms to best practice Ensure that developed resources are freely available and released as open source components. Lead and develop an internal support structure for SDN related questions from other faculty members. Develop and drive the SDN Centre of Excellence concept. The following areas of SDN research have been identified. SDN within the Enterprise Scalable per-user network policy (forwarding/security) SDN enforced Network Access Control (NAC) QoS and SDN integration within Enterprise network Security SDN mediated IDS Formal proof of correctness for whole-of-network security rules. WAN Migration to SDN/interfacing with legacy networks SDN enabled CDN (ie. CDN has direct access to network topology and application requirements) Network management Beyond SNMP/traps (reliable streaming telemetry) Automated fault detection and mitigation (Eg, of corrupted FIB) Network-level change transactions (network configuration as a database) Controllers Inter-domain SDN control protocols (beyond BGP) Security of network control plane High availability controllers Hardware Forwarding distribution across multiple FPGAs (NetFPGA) Existing papers/projects as examples: http://tiny-tera.stanford.edu/~nickm/papers.html https://www.cs.princeton.edu/~jrex/publications.html http://noise-lab.net/projects/software-defined-networking/sdx/ Print version | Backlinks |",
  "content_length": 4559,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:33"
}