{
  "name": "Debajyoti Mondal",
  "homepage": "https://www.cs.usask.ca/faculty/dmondal/index.html",
  "status": "success",
  "content": "Debajyoti Mondal: Debajyoti Mondal, Associate Professor, University of Saskatchewan, Canada Toggle navigation Home Research Publications Open Problems Teaching VGA LAB Social Media Google Scholar DBLP Contact Main Page Research Debajyoti Mondal, Associate Professor, University of Saskatchewan, Canada ‍Biographic Information Dr. Mondal is an associate professor in the Department of Computer Science at the University of Saskatchewan. Dr. Mondal's research interest includes algorithms, network visualization, computational geometry, and visual analytic systems. He enjoys interdisciplinary research that integrates visual analytics into other disciplines. His research has been supported by a NSERC Discovery grant, a CFI grant, a NSERC Engage with Saskatoon Transit, and two Canada First Research Excellence grants. Dr. Mondal's work has advanced fundamental knowledge on several long-standing theoretical problems in computational geometry and graph drawing, and contributed to the design of efficient graph algorithms. He has developed visualization systems in collaboration with Microsoft Research, Saskatoon Transit, and many interdisciplinary teams in diverse areas such as Software Engineering, Transportation, and Academic Medicine that are being widely used by experts in practice. He has published over 100 peer-reviewed journal and conference papers and some of his work has appeared in esteemed theoretical computer science journals such as Algorithmica, Theoretical Computer Science, SIAM Journal on Discrete Mathematics, and reputed conferences such as SoCG, ICALP, ESA, GD, WG. He has served as a PC Co-chair of CCCG 2020, on the program committee of many international conferences including GD, WG, WALCOM, and CCCG, and as a volunteer at the Academics Without Borders program. In 2023, he was awarded the New Scholar RSAW Award at the University of Saskatchewan. Before joining University of Saskatchewan Dr. Mondal was an NSERC Postdoctoral Fellow in the Cheriton School of Computer Science at the University of Waterloo, ON, Canada, and worked as a research intern at Microsoft Research, Redmond, USA. He received his PhD and MSc degree from the Department of Computer Science, University of Manitoba, Winnipeg, MB, Canada. He received his B.Sc. engineering degree from Bangladesh University of Engineering and Technology (BUET). ‍Research Interest Visualization algorithms, Visual analytics of big data, Graph drawing and network visualization, Computational geometry, Algorithms and complexity. ‍Service Conference Co-organizer: CCCG 2020 Workshop Co-organizer: P2IRC Symposium 2021, P2IRC Symposium 2020, Data Science Bootcamp 2018 Program committee: WALCOM 2024, GD 2023, WALCOM 2023, WG 2022, WALCOM 2022, ICCG 2022, WALCOM 2021, EUROCG 2021, WALCOM 2020, WALCOM 2019, GD 2018, WALCOM 2018, ICCG 2018, CCCG 2018. ‍Grants and Awards CFI Grant (2021-2025) NSERC Discovery Grant (2018-2024) Resesarch Junction Grant (2022) P2IRC Grant (2019-2022) Global Water Future Grant (2018-2021) NSERC Engage Grant (2020) NSERC Postdoctoral Fellowship (2016-2018) Microsoft OSS Intern TUP (2015-2016) Manitoba Graduate Schlorship (2012-2015) University of Manitoba Grad. Fellow. (2012-2016) University of Manitoba GFP (2012-2016) Clarence Bogardus Scholarship (2012-2013) International Student Scholarship (2012-2013) Manitoba Graduate Schlorship (2011-2012) University of Manitoba Grad. Fellow. (2011-2012) Clarence Bogardus Scholarship (2011-2012) University of Manitoba GFP (2010-2012) International Student Scholarship (2010-2011) ‍Prospective Students I am always looking for highly motivated and students with strong mathematics and programming background. Students who are interested in theoretical problems in algorithms are encouraged to contact. If you decide to drop me an email for supervision, then write a brief description of the theoretical problems that interests you. Generated by doxygen 1.9.3",
  "content_length": 3924,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:32"
}