{
  "name": "Debashri Roy",
  "homepage": "https://debashriroy.github.io",
  "status": "success",
  "content": "Debashri (Debbie) Roy Office: ERB 453 500 UTA Blvd. Arlington, TX 76019 debashri.roy@uta.edu I am an Assistant Professor at the Department of Computer Science and Engineering, University of Texas Arlington (UTA) since Fall 2023. I also oversee the Transformative Wireless Systems and Technology (TWiST) lab at UTA. Prior to this, I was a Research Scientist at the Department of Electrical and Computer Engineering, Northeastern University since 2020. During that time, I was associated with Next Generation Networks and Systems (GENESYS) lab, directed by Prof. Kaushik Roy Chowdhury. I received my PhD degree in Computer Science in Spring 2020 from the Department of Computer Science, University of Central Florida. I also received Master of Science (Spring 2018) in Computer Science from the same university [Details in my CV] . [This website is not maintained anymore, latest updates: TWiST Lab] news Apr 17, 2024 Congratulations to Sunday Amatare, Michelle Samson, and Mohammad Hasibur Rahman for winning the 2024 Academic Excellence Award from Computer Science and Engineering Department at UTA Apr 16, 2024 Congratulations to Fuhad Ahmed Foesal and Tin Duc Ngo for winning the first place for ‘Undergraduate Research’ at the UTA Innovation Day! Mar 15, 2024 Two poster papers got accepted from TWiST lab at the IEEE International Symposium on Dynamic Spectrum Access Networks, 2024. Congratulations team! Mar 11, 2024 Congratulations to Mohammad Hasibur Rahman from TWiST Lab for getting the Arlington Conservation Council Endowment for Scholarship and Research award for Spring 2024! Feb 23, 2024 Congratulations to Sunday and Michelle for getting nominated to represent CSE department at the CoE annual banquet Feb 19, 2024 TWiST lab hosted workshop at the OurCS event Feb 10, 2024 TWiST lab co-hosted puzzle solving workshop at Digital Divas event Jan 23, 2024 Students from Northeastern University China visited TWiST Lab Jan 1, 2024 Welcoming multiple members to the TWiST Lab Dec 23, 2023 Congratulations to Mohammad Hasibur Rahman from TWiST Lab for getting accepted to Office of Undergraduate Research’s UROP/UGRAP program for Spring 2024! Dec 15, 2023 Congratulations to Duy Pham Quang and Tin Duc Ngo from TWiST Lab for acquiring the REU support for Spring 2024 from CSE department at UT Arlington! Dec 14, 2023 Congratulations to Michelle Samson from TWiST Lab for acquiring the Innovation Scholarship from Greater Arlington Chamber of Commerce! Dec 12, 2023 Excited to serve at MILCOM 2024 as Unclassified Technical Program Committee Co-chair! Dec 5, 2023 Our joint work with Northeastern University got accepted to be presented in INFOCOM 2023! Sep 1, 2023 Excited to start my professional journey at University of Texas Arlington as Tenure-track Assistant Professor! Sep 15, 2022 NSF Award for Nov 2022 - Nov 2025 Please send emails to: debashri DOT roy AT uta.edu",
  "content_length": 2883,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:33"
}