{
  "name": "Debajyoti Bera",
  "homepage": "https://www.iiitd.edu.in/~dbera",
  "status": "success",
  "content": "Debajyoti Bera (@ IIIT-Delhi, India) Need recommendation letter? Looking for guide & advisor? Looking for UR/BTP/IP/internship? Debajyoti Bera Associate Professor, Computer Science Department IIIT-Delhi, India Ph.D. (2010), Boston University, USA B.Tech. (2002), IIT-Kanpur, India Latest résumé C.V. Contact: iiitd.ac.indbera @ Office phone: 011-26907442 Office address: B508 R&D Block B204 Academic Block IIIT-Delhi Okhla Industrial Estate Phase-3 New Delhi, India - 110020 Residential address: IIIT-Delhi Okhla Industrial Estate Phase-3 New Delhi, India - 110020 Permanent address: Kolkata, West Bengal India - 700074 Previous website Personal blog Technical blog Teaching News Research Work Talks Students Events Personal BraQIIIT Lab Looking for PhD/MTech(thesis) students Looking for students to work on research problems in the following areas. Read this before contacting me. Quantum computing: designing new algorithms, proving lower bounds on communication & complexity of solving problems, comparing classical and quantum computations Complexity theory: investigating problems and complexity classes in P and below, especially circuit classes Network/Graph algorithms: engineering algorithmic techniques for handling large and/or real-life graphs What am I up to recently? Aug 2024: Teaching CSE525:(Graduate Algorithms) Jan 2024: Teaching CSE622:(Introduction to Quantum Computing) Aug 2023: Teaching CSE525:(Graduate Algorithms) Jul 2023: Santanu Majhi, student of MTech(Cryptography and security) from ISI Kolkata, defended his MTech thesis on Analysing Quantum Secret Sharing Schemes using the assistance of Quantum Information Theory Jun 2023: Sanchita Saha defended her MTech(CSE) thesis on Few Quantum Cryptanalysis Techniques Jan 2023: Teaching CSE622:(Introduction to Quantum Computing) Aug 2022: Teaching CSE525:(Graduate Algorithms) Jan 2022: Teaching CSE322:(Theory of Computing) Dec 2021: Tapadeep Chakraborty defended his MTech(CSE) thesis on parallel graph embedding Aug 2021: Teaching CSE525:(Graduate Algorithms) Apr 2021: Siddharth Dawar defended his PhD thesis on Mining high-utility itemsets from a transaction database Jan 2021: Teaching CSE322:(Theory of Computing) Aug 2020: Teaching CSE525:(Graduate Algorithms) Jan 2020: Teaching CSE622:(Introduction to Quantum Computing) and CSE322:Theory of Computing Aug 2019: Guiding Tharrma Shastha (Ph.D.) on quantum algorithms for Boolean functions. Aug 2019: Guiding Sagnik Chatterjee (Ph.D.) on quantum optimization techniques. Aug 2019: Teaching CSE525:(Graduate Algorithms) Jul 2019: Akshita Sawhney defended her MTech(CB) thesis on stage classification of renal cell carcinoma Apr 2019: Anuj Saxena defended his PhD thesis on Enforcing Privacy for Location Based Services Jan 2019: Teaching CSE322:Theory of Computing Aug 2018: Teaching CSE525:(Graduate Algorithms) and CSE621:(Complexity Theory) Jan 2018: Teaching CSE622:(Introduction to Quantum Computing) and CSE322:Theory of Computing Aug 2017: Advising Shanu for MTech thesis on quantum amplitude amplification, Parth for BTP on applications of ear decomposition on path-based graph problems, Gautam for BTP on enumeration of clique and related structures, Ankit for MTech thesis on classification of biological networks and Biswadeep for MTech thesis on biclustering of food data. Aug 2017: Teaching CSE525:(Graduate Algorithms) Jan 2017: Teaching CSE622:(Introduction to Quantum Computing) and CSE322:Theory of Computing Aug 2016: Advising G. Venkatesh for MTech thesis on LSH for data mining problems Aug 2016: Teaching CSE525:(Graduate Algorithms) Jan 2016: Teaching CSE523:(Randomized Algorithms) and CSE322:Theory of Computing Aug 2015: Advising Amitesh Pandey for MTech thesis on universal turing machine simulator Aug 2015: Advising Shubham Srivastava for MTech thesis on utility vs privacy gurantees of differential privacy Aug 2015: Teaching CSE525 (Graduate Algorithms) Jan 2015: Teaching CSE622 (Quantum Computing) Jan 2015: Teaching CSE421/621 (Computational Complexity) Aug 2014: Teaching CSE525 (Graduate Algorithms) May 2014: Advising Siddharth Dawar for PhD thesis on frequent itemset mining May 2014: Advising Khalique Newaz for MTech thesis on network analysis of prion disease Jan 2014: Teaching CSE523 (Probability in Computing) Aug 2013: Teaching CSE525 (Graduate Algorithms) and another 2-credit course CSE526 (P vs NP) Jan 2013: Teaching (jointly with Rajiv Raman) CSE222 (Analysis and Design of Algorithms) Aug 2012: Guiding Monalisa Jena (Ph.D.) on Rank Similarity Metrics Aug 2012: Teaching CSE320/520 (Advanced Algorithms) in Monsoon 2012 Aug 2012: Guiding Akash Vanjani (B.Tech.) on Classroom Scheduling Jan 2012: Teaching CSE523 (Probability in Computing) and CSE524 (Theory of Modern Cryptography, co-instruct with Somitra Sanadhya) Jan 2012: Guiding Pranav Raj (B.Tech.) on Combinatorial Games Dec 2011: Attending ICISS 2011 (Kolkata) Aug 2011: Video lecture at IIT-Delhi as part of MHRD project on Introduction to Quantum Computing Jul 2011: Guiding Anuj Saxena (Ph.D.) on Location-Privacy in Location Based Services Talks Introduction to Quantum Computing For video lecture as part of MHRD project recorded at IIT-Delhi (August 2011) Computational Complexity of the Quantum Circuit model Invited talk at QANSAS 2010 (December 2010) Quantum Sampling and Repeated Trials Invited talk at QANSAS 2015, TCS Innovation Labs (Kolkata) Boolean Functions: 1,2,3 and moreInvited talk at Indoquant 2018, IIT Hyderabad Foundation and Challenges of Quantum ComputingInvited talk at IETE MTS 2019, NSUT Quantum ComputingInvited talk at Symposium on Accerelating Biology, CDAC, Pune, 2020 Quantum Computing SimplifiedATAL FDP on Quantum Computing at Vardhman College, Hyderabad Quantum computing semester at Chennai Mathematical Institute (CMI), Chennai, 2024: Error reduction/amplitude amplification Hamiltonian simulation Quantum Fourier transform & Shor's factoring algorithm (quantum stage) Applications of amplitude amplification Variations and applications of amplitude amplification (Keynote speech) Quantum Computing: How can it save the world? My Research Interests quantum computing, randomized algorithms, computational complexity theory, algorithms design and engineering in computational biology, networking & data-mining DBLP profile Google scholar profile Scopus profile Reports and Publications D. Bera, Tharrmashastha S.A.P.V. Quantum Query-Space Lower Bounds Using Branching Programs (pre-print) D. Bera, Tharrmashastha S.A.P.V. Low-Space Quantum Algorithms for Estimate-Mark-Amplify Tasks published in ICTCS 2024 D. Bera, S. Chatterjee. Efficient Quantum Agnostic Improper Learning of Decision Trees published in AISTATS 2024 (pre-print) D. Bera, S. Chatterjee. Efficient Quantum Agnostic Improper Learning of Decision Trees presented as poster in QIP 2024 D. Bera, Tharrmashastha SAPV. A Generalized Quantum Branching Program published in FSTTCS 2023 (pre-print) S. Chatterjee, R. Bhatia, P.S. Chani, D. Bera. Quantum Boosting using Domain-Partitioning Hypotheses published in Quantum Machine Intelligence (QMI). Earlier versions: D. Bera, S. Chatterjee. Quantum Boosting using Domain-Partitioning Hypotheses presented as poster in QIP 2022 and was presented in QTML 2022 (pre-print) D. Bera, R. Pratap, B. D. Verma. Dimensionality Reduction for Categorical Data published in IEEE Transactions on Knowledge and Data Engineering (TKDE) (pre-print) B. D. Verma, R. Pratap, D. Bera. Efficient Binary Embedding of Categorical Data using BinSketch published in ECML/PKDD 2022 journal track (pre-print) S. Dawar, D. Bera, V. Goyal. SMIM framework to generalize high-utility itemset mining published in ADMA 2021 (pre-print, poster) D. Bera, R. Pratap, B. D. Verma, B. Sen, T. Chakraborty. QUINT: Node embedding using network hashing published by IEEE Transactions on Knowledge and Data Engineering (TKDE) (pre-print) D. Bera, Tharrmashastha S.A.P.V. Space efficient quantum algorithms for mode, min-entropy and k-distinctness (pre-print) D. Bera, Tharrmashastha S.A.P.V. Quantum and Randomised Algorithms for Non-linearity Estimation published in ACM Transactions on Quantum Computing (TQC) (pre-print) S. Chatterjee, D. Bera. Applying the Quantum Alternating Operator Ansatz to the Graph Matching problem published in AQIS 2020 (video, pre-print) B.L.K. Jolly, L. Jain, D. Bera, T. Chakraborty. Unsupervised Anomaly Detection in Journal-Level Citation Networks published in JCDL 2020 D. Bera. Maximal Labeled-Cliques for Structural-Functional Communities published in Complex Networks 2020 (pre-print) A. Sharma, G. Bagler, D. Bera. Supervised learning of protein thermal stability using sequence mining and distribution statistics of network centrality (pre-print) R. Pratap, D. Bera, K. Revanuru. Efficient Sketching Algorithm for Sparse Binary Data published in ICDM 2019 (draft) D. Bera, Tharrmashastha P.V. Error reduction of Quantum Algorithms published in Physical Review A (pre-print) D. Bera, S. Maitra, D. Roy, P. Stǎnicǎ. Testing Nonlinearity: Limitation of the BLR Testing and Further Results (Extended Abstract) published in The Eleventh International Workshop on Coding and Cryptography (WCC2019) D.Bera, S. Maitra, SAPV Tharrmashastha. Efficient Quantum Algorithms related to Autocorrelation Spectrum published in Indocrypt 2019 (pre-print, presentation) A. Saxena, D. Bera, V. Goyal. Modeling Location Obfuscation for Continuous Query published in Journal of Information Security and Applications, vol 44, 130--143 (limited duration direct link), (tech-report) D. Bera, F. Esposito, M. Pendyala. Maximal Labelled-Clique and Click-Biclique Problems for Networked Community Detection published in IEEE GLOBECOM 2018 (slides) D. Bera. Amplitude Amplification for Operator Identification and Randomized Classes (pre-print) in COCOON 2018    (slides) D. Bera. Detection and diagnosis of single faults in quantum circuits in IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), 37(3), 5",
  "content_length": 22768,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:33"
}