{
  "name": "Debadatta Mishra",
  "homepage": "https://www.cse.iitk.ac.in/users/deba",
  "status": "success",
  "content": "Debadatta Mishra Computer Science and Engineering Indian Institute of Technology Kanpur email: deba [at] cse [dot] iitk [dot] ac [dot] in Research I love building stuff at the lowest layer of the software stack. My notion of systems starts with the layers below the applications till the architecture interfaces which includes operating systems, hypervisors, network stacks. Open source system software like the Linux Kernel, KVM/Xen hypervisors and architectural simulators are my research playground. I am also passionate about revisiting the architecture-OS interfaces to address performance and security concerns in an era of ever-evolving technology. More details regarding the group can be found here. Area of Research Software Systems: OS, Virtualization and Cloud Computing, Distributed Computing, System Security Computer Architecture: Co-design of Architecture and system software, GPU Architecture and Runtime Computer Networks: Design of Network Stacks and Protocols I am looking for motivated PhD, MS/MTech students in the above areas. If you are interested, please note the following Students@IITK: If you are interested to work with me (or not sure but want to explore), I encourage you to credit system courses such as Linux kernel programming (CS614), Topics in Operating Systems (CS730), Advanced Computer Architecture (CS622) and Programming for Performance (CS610). Prospective students: You can refer to the department admissions page to find out more about the admission process. You may also drop me an email to know more about working with me before applying. Others: If you are passionate about building systems and want to discuss more, you can walk by my office or send me an email. System research requires committment for a longer duration. Therefore, do not send emails requesting for short (e.g., summer/winter) internships. Teaching I am currently teaching CS330: Operating Systems [CS330] Past Courses Students Ph.D. Shiv (2020) Rohit (2021) Yashika (2022)(co-advised with Mainak) Binong (2023)(Primary Adviser: Swarnendu) MTech/MS Abhinav (MS2022) Jatin (MTech2024) Vinayak (MTech2024) Pranjal (BT-MT2021) (Primary Adviser: Swarnendu) Rajani Akshat(BT-MT2021) Graduated students For further details visit the CDOS Group Page Publications DBLP",
  "content_length": 2276,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:31"
}