{
  "name": "Debaditya Roy",
  "homepage": "https://sites.google.com/view/debadityaroy",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationDebaditya Roy\"Always do your best, whatever you plant now will harvest later\" - Og MandinoEmail - debaditya at cse dot iitkgp dot ac dot inI am an Assistant Professor at the Department of CSE, Indian Institute of Technology Kharagpur.I was a Senior Scientist at the Institute of High-Performance Computing, A*STAR, Singapore working on Action Anticipation, Situated Reasoning and Neurosymbolic AI with Dr. Basura Fernando. Previously, I was a post-doctoral researcher working with Prof. Atsushi Fukuda in the Department of Transportation Engineering  at Nihon University, Japan in the M2Smart project funded by JICA and JST. I received my doctoral degree from the Department of Computer Science and Engineering at the Indian Institute of Technology Hyderabad as a member of the Visual Learning and Intelligence (VIGIL) lab. I was advised by Prof. C. Krishna Mohan and my thesis was titled Representation Learning for Action Recognition. My work on snatch theft detection was featured in The Hindu, a leading daily newspaper in India.News2 papers accepted to WACV 2026. Congrats to all my co-authors.Serving as Undergraduate Forum chair for IndoML 2025 and Tutorial chair for ICVGIP 2025 Selected as Outstanding Reviewer at CVPR 2025Selected as Outstanding Reviewer at WACV 2025New paper accepted in IJCV \"Effectively Leveraging CLIP for Generating Situational Summaries of Images and Videos\". First paper that unifies image and video situational understanding within a single framework. [code]New preprint out \"Learning to Generate Long-term Future Narrations Describing Activities of Daily Living.\" Serving as reviewer for ICCV 2025, ACMMM 2025Serving as reviewer for CVPR 2025Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 1823,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:31"
}