{
  "name": "Debasis Samanta",
  "homepage": "https://cse.iitkgp.ac.in/~dsamanta",
  "status": "success",
  "content": "Dr. Debasis Samanta, IIT Kharagpur DEBASIS SAMANTA Professor Department of Computer Science and Engineering Indian Institute of Technology Kharagpur, India × Please enable JavaScript to display the contents of this page properly! Research & Development Multimodal Interaction A multimodal user interface to Internet has been developed with which a user can access the information from Internet in their mother languages (Hindi, Bengali). The interaction medium (for both input and output) are text, speech and images. The system is useful for English illiterate people, illiterate people and motor-impaired people in India. Read more » SE Virtual Lab With the growth of Information Technology, there is a trend to learn remotely with the help of digital gadgets. Towards this direction, we have developed a virtual lab in Software Engineering. With this system user can perform a number of laboratory experiments and evaluate their skill online. P.S. Users within IIT Kharagpur campus need to add vlabs.iitkgp.ernet.in to the Web browser's proxy bypass list. Visit Lab » Text Entry System The majority of tasks with any digital gadget (e.g., PC, Notepad, and Smartphone) is entering text for command, communication to peers, etc. There are many text entry mechanisms known which are suitable for text entry in English and meant for experienced users only. We have developed a number of text entry systems for entering text in Indic languages and are suitable for people with different capabilities. Read more » Bio-Crypto System Biometric data has been successfully applied to developed robust authentication system. There is a great promise to apply the same in different domains namely secure data storage, data transmission, etc. We have developed a novel technology called Biometric based cryptography and have been successful applied the same to cryptographic key generation, remote authentication, multiparty authentication, etc. Read more » HCI + BCI HCI (Human Computer Interaction) is now in its third generation, where a man interacts with the machine by means of touch and pointing. We are in the process of evolving a hands-free and touch-free interaction as a fourth generation HCI using BCI (Brain Computing Interface). Read more » Expert Healthcare Systems Healthcare informatics is the procedure of receiving, analyzing, and organizing health data and involving medical concepts in intersection with health information technology strategies to help clinicians to nourish better health care. It is an evolving topic with the growth of electronic health records(EHRs). Read more » Contact Dr. Debasis Samanta Department of Computer Science and Engineering Takshashila Building Indian Institute of Technology Kharagpur Kharagpur, India — 721302 d...@gmail.com d...@iitkgp.ac.in d...@ieee.org +91 3222 282334 (Office) +91 3222 282335 (Home) LinkedIn Twitter Facebook Google Scholar DBLP",
  "content_length": 2898,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:43"
}