{
  "name": "Debasis Mitra",
  "homepage": "https://cs.fit.edu/~dmitra",
  "status": "success",
  "content": "Debasis Mitra Debasis Mitra Florida Tech School of Computing, Professor Biosketch Projects DM Lab Publications Courses My Story Currently a Professor at the Florida Institute of Technology Debasis Mitra is a Physicsist and a Computer Scientist. A central theme of Mitra's present research is to squeeze knowledge nuggets from noisy spatio-temporal data, especially in Bio-medical images. One of these efforts is dedicated to improving reconstruction of Nuclear Medical images of heart and brain. A long term vision is to understand the molecular biology of deseases for improving human health. In the past Mitra has made contributions in artificial intelligence studying the qualitative reasoning problems with spatial and temporal constraints. Pseudo Heart.pptx (just in case: PseudoHeart.pdf) CV Courses I learn, along with my students. Fall 2024: Artificial Intelligence Spring 2018: Topological Data Analyses Spring 2017 (Fall 2022): Scientific Computing Past Course: Formal Languages and Automata Theory Past Course: Analysis of Algorithms Past Course: Medical Imaging Past Course: Computational Molecular Biology Past Course: Constraint Reasoning Future Course: Topological Data Analyses Stuff on Curricular Advising to Undergrad students at FIT: Approved Humanities Electives for Spring2015 Approved Science Electives for Spring2015 Restricted Business Electives 2015 (Disclaimer: I received them in 2015. The list is not necessearily accurate/\"official\"/mandatory, it is rather a suggestive one) On a: learning contract Stanford class-central Stanford coursera MIT mitx MIT udacity Primary question my lab asks is given sequence of images acquired at different points in time and perspective, or spatio-temporal data/image, where we have some preliminary model, how much information can we extract from it? Apart from oerall statistical model of noise, we often have extra information about what we are looking for. Can we embed such knowldge in the processing pipeline to go beyond the information content in the data? In essence, this is combined output of data and qualitative knowledge on the target objective. Message for prospective students A talk on Medical imaging Graduate Students Valerie Kobzarenko, Ph.D. Candidate Alumni (Dissertation/Thesis/Capstone) Haoran Chang, Ph.D., Post-doc Univ California, Davis Michael Kolar, M.S., Medtronic, Boston Gengbo Liu, Ph.D., , Genentech Corp., San Francisco Haoran Chang, M.S., currently doing Ph.D. with me at FIT Hui Pan, Ph.D., TenCent, China, previously at Microsoft Corp. Mahmoud Abdalah, Ph.D., Research Associate, Moffitt Cancer Research Center, U of South Florida, Tampa Stephen Johnson, Ph.D., Dean, East Florida State College, Palm Bay, Florida Chen Shi, M.S., Stanley Black & Decker, Atlanta, GA Bo Li, M.S. Kimberley Day, B.S., Google Corp. Daniel Eiland, M.S., previously at Harris Corp. Antall Fernandes, M.S., Visible Measures Corp, Boston Richard Hoch, M.S., previously at General Dynamics Abhishek, Bannerjee, B.Tech.-IIT, Google, India Florent Launay, M.S., Microsoft Corp. Sung Park, M.S., Microsoft Corp. Keith Ledig, M.S., Harris Corp. Gandhali Samanth, M.S., Microsoft Corp. Michael Smith, M.S., (somewhere in New York!) Alan Bundy's Page on how-to-do research Collaborators Grant Gullberg & Group, Department of Radiotracer Development and. Imaging Technology, Lawrence Berkeley National Lab, Berkeley, CA, an old Group image Youngho Seo, Department of Radiology and Biomedical Imaging, UCSF Marcus Hohlmann, Physics and Space Sc. Department, FIT Acknowledgements US National Institute of Health US National Science Foundation US Department of Homeland Security Peter Belhumeur, Columbia U Some university rankings The journey Learning about the laws of nature has always facinated me. So I started my higher education studying physics. I did my first Ph.D. on mathematical physics, working on Lorentz Groups. While pursuing my Ph.D. at IIT I was hired by one of the largest companies, Oil and Natural Gas Commission, in India, my country of origin. I worked as an exploration geophysicist there, on areas like petroleum geology, onshore and offshore field geophysics, and yes, a lot of data processing. I fell in love with the art of programming and became overwhelmed with the idea that the computers could be 'programmed' to think. At this point in my career I decided that I have had enough in oil business and should learn about computers and artificial intelligence more seriously. I joined the University of Louisiana at Lafayette as a Ph.D. student in computer science. 'Time' became once again my area of investigation, as it was during my past graduate study in physics. This time I looked into it from the computational point of view - how to reason with it. After completing my second doctorate I have decided to teach computer science while continuing my journey of delving more and more into 'space' and 'time.' In the end I became fatigued with working on complete abstractions, and wanted to dip my hands into some real data, as I was doing during my early infatuation with computers. Mathematical or scientific computing started attracting me more. With a sabbatical at Lawrence Berkeley National Lab I was introduced to inverse problems over noisy nuclear imaging data. Medical image processing and management became my staple, but once again, on spatio-temporal data or dynamic images. Thanks to a number of extraordinary collaborators and students, our learning curve in this new area is steady. Jorney continues. As the next stage of the above works, we are now involved with radiomics, asking - how to make prognosis from some 3D med-images of patients? Obviously, this is a machine learning task and our hands are dirty with tools like convolutional neural networks. The field is exploding and our heads whirl with recent new exotic works in the field. However, is there a role for topology in all these? Can studying topological invariances of images enhance learning capbility and efficiency? Are our works in spatio-temporal knowledge representation have some value in this direction? So, here I am! But, stay tuned for more, in case you are tracking me :) A disclaimer: I am not the Debasis Mitra, who works on distributed computing, now in Columbia University. Projects INVERSE PROBLEMS Radoimics with Machine Learning We try to detect tumor in 3D medical images and correlate that with prognostic information automatically. Machine learning algorithms, including deep learning ones, are the tools and challenges are many! Medical data are not as easily available as 2D images for computer vision research. That is challenge number one! Where to look for the tumor even when we know it is on breast - how does a program know where the breast is in a whole-body image? Semantic segmentation is challenge number two? Data science is an art now. What type of network structure or parameters are better for what type of image? I am trying to understand this with respect to the images' topological invariants. Nuclear Imaging Our objective in this project is to transform raw camera data from SPECT (Single Photon Emmission Computer Tomography) and PET (Positron Emmission Tomography) scans into three dimensional or four dimensional view within body. We develop novel reconstruction and optization algorithms for dynamic or time-varying data for better diagnostics, and implement them on high-performance computing systems. We collaborate with imaging scientists, physicists, cardiologists, neurologists, from different labs including those in the Lawrence Berkeley National laboratory and the University of California San Francisco. Muon Tomography Muons are leptons (weakly interacting elementary particles) that are highly penetrating because of low charge (same as that of electron) and high momentum (about two hundred times heavier than electron). This makes them ideal probe for detecting materials with higher atomic numbers (Z). Steady flux of muons are produced by cosmic ray at upper atmosphere. This type of natural muons can be used as non-invasive probes for charting magma chambers in volcanos, hidden chambers in pyramids, and for detecting Uranium or other high-atmoic number materials in cargo containers for border protection. Our project is related to the last area. Our group collaborates with a High Energy Physics group at FIT. We work on reconstruction algorithms for muon-tomography. SPATIO-TEMPORAL CONSTRAINT REASONING Detecting inconsistency in temporal information A typical Constraint Reasoner checks for satisfiability in an input set of constraints. For a satisfiable set it may also generate a consistent scenario. However, traditionally, nothing is done with an inconsistent set of information. Any user of such a system would often wish that the system were more helpful in debugging an inconsistet situation. We harness this issue in temporal relations where constraints may be qualitative (e.g.,\"before or overlaps\") or quantitative, and disjunctive in nature. Another question we have started asking recently (with a colleague) is whether a temporal reasoning approach may be helpful in timed-automata based model checking. The latter is a useful tool for verifying a designed system and a significant amount of literature exist on theoretical and practical problems. CAPSTONE PROJECT: PREDICTING BRAIN SEIZURE WITH A MOBILE DEVICE Detecting brain seizure on a mobile phone This multi-disciplinary group of Senior Undergraduate students are trying to design a head mounting system that can detect brain signals, which in turn may be analyzed on a smart phone in order to predict seizure event for a potential patient. I am the advisor to the computing team of this fun project. Here is their web-site: https://jalameen2014.wixsite.com/aspis. PAST PROJECT: COMPUTATIONAL MOLECULAR BIOLOGY Protein Structure Comparison A protein is a chain of amino acids that forms a complex structure in 3D. Each protein typically has the same structure and its function ",
  "content_length": 19938,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:35"
}