{
  "name": "Deborah G. Tatar",
  "homepage": "https://thirdlab.cs.vt.edu/people/deborah-tatar",
  "status": "success",
  "content": "Deborah Tatar | DogFacedDeborahEdited TatarGreensAnniversary BritPic TatarEdited This jQuery slider was created with the free EasyRotator for WordPress plugin from DWUser.com. OK Rotator powered by EasyRotator for WordPress, a free and easy jQuery slider builder from DWUser.com. Please enable JavaScript to view. Which of these pictures LIES about Dr. Tatar and which shows the TRUTH? What TRUTH? Deborah Tatar is pursuing a “research active” retirement, enjoying the title of Emerita Professor of Computer Science and, by courtesy, Psychology at Virginia Tech, where she has been and probably still is also a member of the Center for Human-Computer Interaction, the Program for Women and Gender Studies,  a Fellow of the Institute for Creativity, the Arts and Technology and Fellow of the Institute on Gerontology.  She holds a doctorate in Psychology from Stanford and a bachelor’s in English and American Literature and Language from Harvard.  She spent sixteen years working in industry and industrial research. Establishing accomplishments in Computer Science and related fields include her 1986 LISP textbook and her early CSCW (Computer-Supported Collaborative Work) projects, including her analysis of the Xerox PARC Colab project. Much of her work focuses on the design of multi-user face-to-face systems, especially those designed to fit into and improve classroom interactions.   This interest dovetails with an interest in the design of technologies as background, the notion of zensign (that what is left out can be as important as what is put into a user interface), phenomena of sharing and human-attention. She really cares about how people’s images of themselves are shaped by their interactions with technology. Here is a link to the Third Lab website. As of Sept. 2015, we had an exciting new project in the area of Integrated Computational Thinking!  Truly exciting is the three minute video which explains the ideas in non-academic terms. Here is an interesting thought, from Jim Holt’s “Why Does the World Exist?”, LiveRight Press, 2012, p. 126: “You can’t give a once and for all definition of what an explanation is,” Deutsch said.  “In fact, important explanatory advances often change the meaning of explanation.  My favorite example is the Newtonian-Galilean revolution, which not only brought in new laws of physics, but also altered the very notion of what a physical law is.  Previously, laws had been rules stating what happens.  Kepler’s laws, for instance, were about how the planets traveled around the sun in elliptical orbits.  Newton’s laws were different.  They didn’t talk about planets or ellipses.  Instead, Newton’s laws were rules that any such system would obey.  It’s a different style of explanation, one that hadn’t been thought of before, one that wouldn’t even have been considered an explanation before.  The same kind of explanatory revolution happened a couple of hundred years later with Darwin.  Previously, when people asked, “Why does this animal have the shape it does?” they expected that the answer would cite some property of the shape—that it was efficient, that it was favored by God, and so forth.  After Darwin, the answer wasn’t about properties of the shape, but about how that shape had come into existence by evolution.  Again, it’s a different style of explanation.” Here is a link to the slides for a talk she gave in the CS forum in Fall, 2015 called the The Next Ten Years: Designing For Equity And Inclusion. Here’s a link to a c.v. (no promises about how current).  In fact, very very out-of-date. Here is a link to an old website. Leave a Reply Cancel replyYour email address will not be published. Required fields are marked *Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ 1+1=3 Search for: Recent Posts Designing to Reflect Our Better Nature Designing Interactive Systems 2019 is coming! Deborah Tatar (and ThoughtSwap) Honored with XCaliber award Creative Computing At ICAT C+I Day What I’ve Been Reading ACM Interactions Blog",
  "content_length": 4071,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:38"
}