{
  "name": "Deborah Stacey",
  "homepage": "https://www.uoguelph.ca/computing/people/deborah-stacey",
  "status": "success",
  "content": "Deborah Stacey | School of Computer Science Deborah Stacey Professor EmeritusWebsite links: Google Scholar Research StatementResearch KeywordsSelected Publications Deborah Stacey is the principal investigator of the Guelph Ontology Team (GOT).  This research group investigates the development, use and analysis of knowledge engineering and machine intelligence techniques particularly ontologies.  GOT™s main theoretical research emphasis is on data-driven ontology evaluation and the development of ontologies for simulation parameters. Application areas include animal disease simulation, biomedical data analysis, data collection, digital humanities and food informatics.  Funding of the team involves academic, government and  industrial partners.  Members of the team include PhD and Masters students as well as senior undergraduates. ontologies knowledge engineering machine intelligence artificial neural networks big data analysis smart animal health animal disease spread models Hlomani H, Stacey D. (2015). Data-driven diachronic and categorical evaluation of ontologies - Framework, Measure, and Metrics. Lecture Notes in Computer Science, Springer Link. (CCIS 553): 1-11. Hlomani H, Stacey D. (2014). Data-driven diachronic and categorical evaluation of ontologies - Framework, Measure, and Metrics. Proceedings of KEOD 2014. International Conference on Knowledge Engineering and Ontology Development (KEOD 2014), Rome, Italy, 2014-10-21 (56-66) Henriques, G, Stacey, D. (2014). An Ontology-based Framework for Analysis Recommendation. Proceedings of the IEEE 14th International Conference on BioInformatics and BioEngineering. IEEE 14th International Conference on BioInformatics and BioEngineering, Boca Raton, United States, 2014-11-10 Hlomani, H, Stacey, D. (2014). An Extension to the Data-driven Ontology Evaluation. Proceedings of the IEEE 15th International Conference on Information Reuse and Integration. IEEE 15th International Conference on Information Reuse and Integration, San Francisco, United States, 2014-08-13 Henriques G, Lamanna L, Kotowski D, Hlomani H, Stacey, D, Baker P, Harper S. (2013). An Ontology-driven Approach to Mobile Data Collection Applications for the Healthcare Industry. Network Modeling Analysis in Health Informatics and Bioinformatics (NHIB). (2): 213-223. Share this page Share on Facebook Share on Twitter Share on LinkedIn Print this page",
  "content_length": 2396,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:38"
}