{
  "name": "Debora Nozza",
  "homepage": "https://deboranozza.com",
  "status": "success",
  "content": "Debora NozzaSearchDebora NozzaAssistant ProfessorDebora Nozza (she/her) is an Assistant Professor in the Computing Sciences Department at Bocconi University in Milan, where she co-leads the MilaNLP Lab together with Dirk Hovy. She was awarded a €1.5m ERC Starting Grant project 2023 for research on personalized and subjective approaches to Natural Language Processing. Previously, she was awarded a €120,000 grant from Fondazione Cariplo for her project MONICA. Her research interests mainly focus on Natural Language Processing, specifically on the detection and counter-acting of hate speech and algorithmic bias in multilingual context. She is also deeply interested in understanding how and why people use large language models (LLMs) in their everyday lives.She is an organizer of the Workshop on Online Abuse and Harms (WOAH), the Workshop on Gender Bias in Natural Language Processing (GeBNLP), and the Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis (WASSA) at *ACL conferences, as well as the International Workshop on Protecting Women Online (TSWW) at the Web Conference 2025.She also organized several shared tasks, including the first Homotransphobia Detection in Italian (HODI) at Evalita 2023, the Automatic Misogyny Identification (AMI) at Evalita 2018 and Evalita 2020, the HatEval Task 5 at SemEval 2019 on multilingual hate speech detection against immigrants and women on Twitter, and the TextDetox Shared Task at CLEF 2025 on multilingual text detoxification.InterestsNatural Language ProcessingHate SpeechEthics in NLPComputational Social ScienceEducationPhD in Computer Science, 2018University of Milano BicoccaRecent NewsAll news»[07/11/25] 🏆 Outstanding Senior Area Chair for EMNLP 2025.[04/11/25] 🎤 Participation to workshop “Transatlantic Perspectives on Information, the Internet, and Democracy” (Dublin, Ireland).[03/11/25] 📝 Three papers accepted at EMNLP 2025 (Suzhou, China) on bias, personalization, and social dynamics in LLMs.[28/10/25] 🎤 Invited Talk at FBK (Trento, Italy). “A roadmap for the everyday use of LLMs: emerging risks and research directions.”[18/10/25] 💬 Talk at BergamoScienza (Bergamo, Italy). Public lecture “Parlare con intelligenza artificiale” on AI, language, and society.LatelyRecent BlueSky activityRecent PublicationsQuickly discover relevant content by filtering publications.Detoxify-IT: An Italian Parallel Dataset for Text DetoxificationToxic language online poses growing challenges for content moderation. Detoxification, which rewrites toxic content into neutral form, …Viola De Ruvo, Arianna Muti, Daryna Dementieva, Debora NozzaPDF ProjectBlue-haired, misandriche, rabiata: Tracing the Connotation of ‘Feminist(s)’ Across Time, Languages and DomainsUnderstanding how words shift in meaning is crucial for analyzing societal attitudes.In this study, we investigate the contextual …Arianna Muti, Sara Gemelli, Emanuele Moscato, Emilie Francis, Amanda Cercas Curry, Flor Miriam Plaza-Del-Arco, Debora NozzaPDF Cite ProjectBiased Tales: Cultural and Topic Bias in Generating Children’s Stories?Stories play a pivotal role in human communication, shaping beliefs and morals, particularly in children. As parents increasingly rely …Donya Rooein, Vilém Zouhar, Debora Nozza, Dirk HovyPDF CiteMeasuring Gender Bias in Language Models in Farsi?As Natural Language Processing models become increasingly embedded in everyday life, ensuring that these systems can measure and …Hamidreza Saffari, Mohammadamin Shafiei, Donya Rooein, Debora NozzaPDF CiteCan I Introduce My Boyfriend to My Grandmother? Evaluating Large Language Models Capabilities on Iranian Social Norm ClassificationCreating globally inclusive AI systems demands datasets reflecting diverse social norms. Iran, with its unique cultural blend, offers …Hamidreza Saffari, Mohammadamin Shafiei, Donya Rooein, Francesco Pierri, Debora NozzaPDF CiteSee all publications Cite × Copy Download",
  "content_length": 3951,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:37"
}