{
  "name": "Deborah Richards",
  "homepage": "http://web.science.mq.edu.au/~richards",
  "status": "success",
  "content": "Deborah Richards - Home Page Skip to Content Macquarie University Faculty of Science & Engineering Macquarie Home | Course Handbook | Library | Campus Map | Macquarie contacts search Student Portal | Staff | Online Units | E-Student Academic Profile Research Interests Events of Interest/Program Committees Publications Software/Demos PhD Thesis Me Photo Gallery Deborah Richards - Home Page You are here: Macquarie Home » Faculty of Science » Computing » Deborah Richards' Home Page Deborah Richards - Home Page CV - 2022. I am a Professor with the School of Computing in the Faculty of Science and Engineering at Macquarie University. I am currently the school's Industry and External Relations Director and Program Leader for the Information Systems and Business Analysis Major and previously the Business Information Systems major. My office is located in BD Building, 4 Research Park Drive, Room 369. I am looking for high quality PhD and MRes students interested in research in Intelligent Virtual Agents. Macquarie university offers scholarships for strong applicants. Interviews and Opinion pieces The Metaverse - a force for good Macquarie Lighthouse interview on the Metaverse Girls and Technology Start Here, Go Anywhere ... I did . Interview with 2SER Facebook to Use AI in Content Moderating: Ethical and Appropriate Uses of AI Interview with 2SER Australia's increasing use of technology & decreasing academic performance Article for The Hindustan Times published December 26th, 2019 Does AI have a gender Article for Business World Education published October 6th, 2022 Career Prospects In AI-Future Trends Sydney Science Trails for Schools August 17 2020 The Big Questions of Science Faculti Interview - 2021 Challenging and Supporting Learners through Pedagogical Agents Professors Profess - Macquarie University Gladly Teche We're in this together Maths the great divider Life Matters November 25, 2005. Maths anxiety just doesn't add up The Science Show 10 December, 2005. Awards Highly Commended finalist 2021 Vice-Chancellor's Educational Leader Award. Vice-Chancellor's Citation for Outstanding Contribution to Student Learning 2017 Innovative learning analytics solution that enhance the learning and teaching student experience - Jean-Christophe Froissard, Professor Deborah Richards, Amara Atif and Dr Danny Liu Children's Hospital Network 2017 Quality and Innovation Award Winners A/Prof Patrina Caldwell's team at Children's Hospital Westmead and Prof Deborah Richards' team at Macquarie. This award aims to recognise the innovative and effective use of digital technologies and built environments in ways that are transforming healthcare delivery in NSW. ABC and Academy of Science Media Fellowship. 2005 2003 Outstanding Teachers Award, Macquarie University Academic Profile Research Interests Teaching Interests Events of Interest/Program Committees Publications Software/Demos Science Outreach at the ABC PhD Thesis Me Photo Gallery Academic and Employment Profile My career as an academic began in 1999 following 20 years in industry that has motivated me to focus my research on addressing real-world problems through working in cross-disciplinary/functional teams. I started full-time employment in 1978 as bank clerk. In 1980, my career in ICT began when I joined a computer bureau setting up job decks for clients (before companies had their own computers). Over my industry career, I worked in roles ranging from data control officer, operator, analyst/programmer, manager and consultant working first with mainframes and then minis (IBM S/34/36). I had my own IT business solutions company from 1986-1999. I completed a BBus(Computing and MIS)in 1989 and MAppSc(Info Studies) in 1994 via distance education at Charles Sturt University while I was working full time and raising 3 children. In 1999, I completed a Doctor in Philosophy from the Faculty of Engineering, School of Computer Science and Engineering in the field of Artificial Intelligence. My PhD topic led on from my Master's Degree thesis \"The Adaptation of Traditional Expert Systems to Provide 'What-If' Processing in the Decision Support System Style\". Under the supervision of Prof. Paul Compton, my PhD research considered how knowledge which was captured for such purposes as consultation may be reused to to allow alternative uses such as causal modelling, tutoring, explanation or critiquing. More specifically I looked at how to reuse knowledge bases(KB) built by a knowledge acquisition technique known as Ripple Down Rules (RDR). I looked at the compaction of RDR KB to remove repetition and improve the clarity of the KB for such tasks as explanation and how rough sets (Pawlak 1991) may be used to verify and validate KBS and find dependencies between attributes, values, rules and conclusions. My main offering was the ability to automatically generate a terminological KBS (in the form of an abstraction hierarchy) from the RDR assertional KBS using Formal Concept Analysis (Wille 1982). Starting with assertions and retrospectively generating an ontology avoided the problems associated with capturing and validating models since RDR is a simple, case-based KA technique that allows assertions to be acquired, maintained and validated directly by domain experts. Mostly recently (2010) I completed a Postgraduate Certificate in Higher Education (Leadership and Management). Teaching Interests Capstone Units and Industry Based Projects Software Engineering Requirements Analysis and Systems Design Human Computer Interaction Business Information Systems Major GreenIT Module in ISYS114 Research Interests For latest publications see My MQ Research Publications Intelligent Virtual Agents & Virtual Worlds Applied Technology particularly in Health, Education and Training Human Computer Interaction Knowledge Acquisition and Reuse Knowledge Management Events of interest / Programm Committees You might have seen me at: 2018 Pacific Rim Knowledge Acquisition Workshop (PKAW 2018) in Nanjing, China. August 27-28 Artificial Intelligence in Education, London, UK, June 27-30 AAMAS 2018 in Stockholm, July 10-15 ECIS 2016 in Istanbul AAMAS 2106 in Singapore 21st Americas Conference on Information Systems, Puerto Rico, USA, August 12-15, 2015 Third AAMAS Workshop on Cognitive Agents and Virtual Environments (CAVE) May 4 or 5, 2015, Istanbul, Turkey or International Conference on Autonomous Agents and MultiAgent Systems (AAMAS-2015) May 4-8, 2015, Istanbul Congress Centre, Istanbul, Turkey 2014 Pacific Rim Knowledge Acquisition Workshop 1-2 December 2014, Gold Coast, Australia, Proceedings Volume 8863 2014 Knowledge Management and Acquisition for Smart Systems and Services 13th Pacific Rim Knowledge Acquisition Workshop, eds. Yang Sok Kim, Byeong Ho Kang, Deborah Richards. ISBN: 978-3-319-13331-7 (Print) 978-3-319-13332-4 (Online) Second AAMAS Workshop on Cognitive Agents and Virtual Environments (CAVE) May 6 or 7, 2013, Saint Paul, Minnesota, USA The AAMAS-2012 Workshop on Cognitive Agents for Virtual Environments Proceedings Volume 7764 2013 Cognitive Agents for Virtual Environments First International Workshop, CAVE 2012, Held at AAMAS 2012, Valencia, Spain, June 4, 2012, Revised Selected Papers Editors: Frank Dignum, Cyril Brom, Koen Hindriks, Martin Beer, Deborah Richards. ISBN: 978-3-642-36443-3 (Print) 978-3-642-36444-0 (Online) 2012 Pacific Rim Knowledge Acquisition Workshop 3-7 September,Kuching, Sarawak, Malaysia 2012 Proceedings Volume 7457 2012 Knowledge Management and Acquisition for Intelligent Systems 12th Pacific Rim Knowledge Acquisition Workshop, PKAW 2012, Kuching, Malaysia, September 5-6, 2012. Proceedings Editors: Deborah Richards, Byeong Ho Kang. ISBN: 978-3-642-32540-3 (Print) 978-3-642-32541-0 (Online) 12th Pacific Rim International Conference on Artificial Intelligence (PRICAI), September 3 - 7, 2012, Kuching, Sarawak, Malaysia Cognitive Agents for Virtual Environments Workshop@AAMAS 2012 The 19th European Conference on Information Systems - ICT and Sustainable Service Development in Helsinki 15th Pacific Asia Conference on Information systems (PACIS) in Brisbane 7-11 July 2011 11th International Conference on Intelligent Virtual Agenst (IVA2011) in Reykavik, Iceland, September 17-19 2011 22nd Australasian Conference on Information Systems (ACIS) in Sydney, Australia, 30th November - 2nd December, 2011 Multi-Agent Systems for Education and Interactive Entertainment (MEIE) Workshop to be held at AAMAS'10 in Toronto, Canada. 2010 Pacific Rim Knowledge Acquisition Workshop August 30 - September 3 2010 held with The 11th Pacific Rim International Conference on Artificial Intelligence (PRICAI) December 17-19 in Daegu, Korea Agent Based Systems for Human Learning and Entertainment(ABSHLE) Workshop to be held at AAMAS'09 in Budapest in Hungary. 2008 Pacific Rim Knowledge Acquisition Workshop 15-16 2008 held with PRICAI'08 December 17-19 in Hanoi, Vietnam Knowledge Representation Ontology Workshop (KROW 2008)September 17, 2008 with KR'08 Sydney, Australia, September 16-19, 2008 Australian Ontology Workshop held at AI'0 December 2-5 in Gold Coast, Australia 20th ACS Australian Joint Conference on Artificial Intelligence held December 2-6 in Gold Coast, Australia IE 2007: The Fourth Australasian Conference on Interactive Entertainment held December 3-5 in Melbourne, Australia Australian and New Zealand Academy of Management 21st ANZAM 2007 Conference held December 4-7 in Sydney, Australia The 11th International Conference on CSCW in Design held April 26-28, 2007, Swinburne University of Technology, Melbourne, Australia 2007 International Conference on Autonomous Agents and Multiagent Systems held May 14-18, 2007 at the Hawaii Convention Center in Honolulu, Hawai'i. 11th Australian Workshop on Requirements Engineering held in conjunction with ACIS 2006 in Adelaide in December, Saturday 9th December 6th International Conference on Practical Aspects of Knowledge Management Nov. 30th - Dec. 1st, 2006 The",
  "content_length": 94479,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:42"
}