{
  "name": "Debswapna Bhattacharya",
  "homepage": "https://people.cs.vt.edu/dbhattacharya",
  "status": "success",
  "content": "Debswapna Bhattacharya Debswapna Bhattacharyaদেবস্বপ্ন ভট্টাচার্য (he/him/his) Associate Professor Department of Computer Science Virginia Tech 1160 Torgersen Hall, 620 Drillfield Dr. Blacksburg, VA 24061, USA Office: 3120B Torgersen Hall Phone: +1 (540) 231-2865 Fax: +1 (540) 231-6075 Email: dbhattacharya@vt.edu NEWS 2 Oct. 2025:Honored to present an invited talk at CASP Nucleic Acid Special Interest Group (CASP NA SIG) seminar series. 16 Sep. 2025:Our ProRNA3D-single work was featured in Virginia Tech News and broadly reported by various media outlets including AAAS EurekAlert, Yahoo News, and Microsoft MSN! 16 Sep. 2025:New Cell Systems paper published. Congratulations to Roche and Sumit! 13 Aug. 2025:Welcome to Xingyue Feng who joined us as a Ph.D. student. 31 Jul. 2025:Our EquiPNAS paper was ranked among the most-cited recent articles in Nucleic Acids Research. Congratulations to Roche, Bernie, Hossain, and Sumit! 14 Jul. 2025:Honored to present an invited talk at IISc Bangalore hosted by the Department of Computational and Data Sciences (CDS) at IISc. 11 Jul. 2025:Honored to present an invited talk at ISI Kolkata in a Mini Symposium on Contemporary Advancements in Computational Intelligence, jointly organized by the Centre for AI and ML at ISI Kolkata and IEEE CIS Kolkata Section. 25 Jun. 2025:New Briefings in Bioinformatics paper published. Congratulations to Sriniketh! 24 Jun. 2025:Honored to present an invited keynote talk at the NSF-sponsored AI-Powered Materials Discovery workshop at the University of South Dakota in Vermillion, SD. 3 Jun. 2025:New Bioinformatics paper published. Congratulations to Maryam and thanks to my collaborator Prof. T. M. Murali! 30 Dec. 2024:New CSBJ paper published. Congratulations to Hossain! 11 Nov. 2024:New JCIM paper published. Congratulations to Sumit! 9 Oct. 2024:New JMB paper published. Congratulations to Trevor! 9 Sep. 2024:Congratulations to Ph.D. student Sumit Tarafder for receiving a Pratt Fellowship! 23 Aug. 2024:New ICIBM 2024 paper accepted. Congratulations to Hossain! 22 Aug. 2024:Welcome to Xinyu Wang who joined us as a Ph.D. student. 17 Jul. 2024:We enjoyed a group lunch to honor our newest Ph.D. graduate Rahmatullah Roche and bid him farewell. 15 Jul. 2024:Excited to present our work at the 3DSIG COSI Track of ISMB 2024 in Montreal, Quebec, Canada. 12 Jul. 2024:New Biology Methods & Protocols paper published. Congratulations to Sumit and Roche! 8 Jul. 2024:Congratulations to Rahmatullah Roche for successfully defendeding his Ph.D. dissertation! Roche will move on to be an Assistant Professor at Columbus State University. 4 Jun. 2024:Grateful and excited to have received an NIH equipment supplement grant to acquire a new NVIDIA DGX H100 GPU cluster to accelerate foundational deep learning method development for protein modeling. 22 May 2024:Our proposal was selected to be supported through the NSF-led National AI Research Resource Pilot awards. Thrilled to be a part of this exciting opportunity. [VT News] 23 Apr. 2024:Ph.D. student Rahmatullah Roche accepted a tenure-track Assistant Professor position in the Computer Science department at Columbus State University. Congratulations! 28 Mar. 2024:Congratulations to Ph.D. student Rahmatullah Roche for receiving the 3rd place award in the Flash Talk category at the VT GPSS Graduate Research Symposium. 28 Jan. 2024:New Nucleic Acids Research paper published. Congratulations to Roche, Bernie, Hossain, and Sumit! 8 Dec. 2023:We enjoyed a group lunch to honor our newest Ph.D. graduate Md Hossain Shuvo and bid him farewell. 5 Dec. 2023:Congratulations to Md Hossain Shuvo for successfully defendeding his Ph.D. dissertation! Hossain will move on to be an Assistant Professor at Prairie View A&M University. 10 Nov. 2023:Ph.D. student Md Hossain Shuvo accepted a tenure-track Assistant Professor position in the Computer Science department at Prairie View A&M University. Congratulations! 14 Sep. 2023:Congratulations to Ph.D. student Rahmatullah Roche for receiving a Pratt Fellowship! 2 Sep. 2023:We enjoyed a group hike to the McAfee Knob. 31 Aug. 2023:New PLoS Computational Biology paper published. Congratulations to Roche, Bernie, and Hossain! 10 Aug. 2023:Welcome to Dr. Trevor Norton who joined us as a postdoc. 1 Aug. 2023:We moved into a new lab space at 3120 Torgersen Hall. 31 Jul. 2023:New PNAS paper published. Congratulations to Bernie and Roche! 27 Jul. 2023:Our PPP proposal is selected for a DA 2.0 Phase II award. Thrilled to be a part of this transdisciplinary team. 25 Jul. 2023:Congratulations to Ph.D. student Md Hossain Shuvo for receiving a Pratt Fellowship! 25 Jul. 2023:Congratulations to Ph.D. student Bernard Moussad for receiving a Walts Fellowship! 20 Jun. 2023:New Bioinformatics Advances paper published. Congratulations to Hossain, Mohimenul, and Roche! 8 Jun. 2023:Thankful to have received tenure at Virginia Tech. This bulletin started. SPONSORS ABOUT I am an Associate Professor in the Department of Computer Science at Virginia Tech, based in the Blacksburg campus. My primary research interests are computational biology & bioinformatics (CBB) and applied machine learning (ML) with a particular focus on artificial intelligence (AI) for structural biology. I am also interested in AI-driven biomedical data science for the extraction of knowledge from massive biological datasets. The long-term goal of my research is to deepen our understanding of the fundamental biomolecular sequence-structure-function relationship through the lens of computational \tmodeling. My current research takes a critical step toward this goal by developing, evaluating, and disseminating a new generation of knowledge-guided and integrative machine learning \tmethods and resources for modeling and characterization of biomolecules at scale. Prospective lab members: If you are interested in joining my group at Virginia Tech, please read this. BIO I obtained my PhD in Computer Science from the University of Missouri - Columbia in 2016 under the supervision of Prof. Jianlin Cheng. Before joining Virginia Tech in 2022, I was an Assistant Professor at Auburn University from 2017 to 2021. Selected honors and awards that I am a recipient of include: National Science Foundation National AI Research Resource Award, 2024 National Distinction and Outstanding Contributor, Virginia Tech, 2023 National Science Foundation CAREER Award, 2020 Ginn Faculty Fellowship, Auburn University, 2020 National Institutes of Health Maximizing Investigators' Research Award (MIRA) for ESI, 2020 Outstanding Engineering Faculty Award, Auburn University, 2019 Outstanding CS PhD Student Award, University of Missouri-Columbia, 2014 RESEARCH Active Projects: AI & ML for macromolecular modeling LLMs for biomolecular interactions Physics + ML for fine-tuning and refinement Geometric deep learning on molecular graphs Benchmarking of state of the art GROUP Current Group Members: Xingyue Feng: PhD Student in CS at VT (2025 - Present) Sriniketh Vangaru: Undergraduate Student in CS at VT (2024 - Present) Xinyu Wang: PhD Student in CS at VT (2024 - Present) Sumit Tarafder: PhD Student in CS at VT (2022 - Present) Former Group Members: Trevor Norton: Postdoc at VT (2023 - 2025). Now Senior Data Scientist at RTX Corporation. Rahmatullah Roche: PhD in CS at VT (2018 - 2024). Now Assistant Professor at Columbus State University. Md Hossain Shuvo: PhD in CS at VT (2018 - 2023). Now Assistant Professor at Prairie View A&M University. Sutanu Bhattacharya: PhD in CSSE at AU (2017 - 2021). Now Assistant Professor at Auburn University Montgomery. Rahul Alapati: MS Thesis in CSSE at AU (2017 - 2019). Now Software Engineer at Microsoft. Andrew J. McGehee: BS in CSSE at AU (2018 - 2020). Then Software Engineer at Google. Carmen Stowe: BS in CSSE at AU (2017 - 2018). Then MIT Lincoln Laboratory and MS Student at Georgia Tech. Visitors and Interns: Maryam Haghani: Graduate Student in CS at VT co-advised with Prof. T. M. Murali (2023 - 2025) Erin Wienke: Graduate Student in CS at VT (2024) Nabayan Chaudhury: Graduate Student in CS at VT (2023 - 2024) Bernard Moussad: Graduate Student in CS at VT (2021 - 2024) Sajib Acharjee Dip: Graduate Student in CS at VT (2023) Mohimenul Karim: Graduate Student in CS at VT (2021 - 2023) Fatemeh Sarshartehrani: Graduate Student in CS at VT (2022) Muhammad Gulfam: Graduate Student in CSSE at AU (2020 - 2021) Hudson Chromy: Undergraduate Student in CSSE at AU (2019) Behnam Rasoolian: Graduate Student in CSSE at AU (2017 - 2018) Tian Xia: Graduate Student in CSSE at AU (2017) Donald Holyfield: Undergraduate Student in CSSE at AU (2018) Swati Baskiyar: Undergraduate Student in CSSE at AU (2018) Note to Prospective Students and Postdocs: I am always looking for self-motivated students and postdocs to join my group. Unfortunately, I am not able to respond to all emails. So, depending on your situation, please follow \tone of the follwing routes: You are a prospective PhD student: please apply directly to CS at VT PhD program and list me as a faculty of interest. Afterwards, send me an email with the subject line \"[Prospect] Interested in joining your group (PhD)\" with a CV and a brief description of your interests. Admissions are centralized and decisions are made by committee. You are a student already at VT: send me an email with the subject line \"[Prospect] Interested in joining your group (VT Student)\" with a CV \t\tand a brief description of your interests and background. You are a prospective Postdoc: send me an email with the subject line \"[Prospect] Interested in joining your group (Postdoc)\" with a CV, \t\tlink to your publications, and a brief description of your interests and background. If your email is not formatted as above, my filters won't catch it so I will almost certainly not see it. TEACHING Past, Current, and Upcoming Courses: Fall 2025: CS 5805. Advanced Machine Learning (VT) Fall 2024: CS 4824. Machine Learning (VT) Fall 2024: CS 6824. AI-powered Mo",
  "content_length": 10998,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:39"
}