{
  "name": "Declan O'Sullivan",
  "homepage": "https://www.tcd.ie/research/profiles/?profile=osulldps",
  "status": "success",
  "content": "Declan O'Sullivan'Trinity Research - Trinity College Dublin Professor Declan O'Sullivan Professor In, Computer Science declan.osullivan@tcd.ie +353 1896 3754 people.tcd.ie/osulldps Biography Declan O'Sullivan is a Professor in Computer Science in the School of Computer Science and Statistics, joining Trinity College Dublin in 2001. He is a co-champion of the Trinity Digital Engagement interdisciplinary theme, and a Principal Investigator at the Research Ireland (Taighde Eireann) ADAPT Research Centre (http://www.adaptcentre.ie). He was Head of the Discipline of Artificial Intelligence from 2012-2018. He was Director of Research and Deputy Head of School from 2017 to 2023. Declan was presented with an \"Excellence in Supervision of Research Students\" award from Trinity in 2024. He was also elected as a Fellow of Trinity College Dublin for the quality of his research and contribution to college in 2019. He was awarded a B.A. (Mod) in Computer Science from TCD in 1985, an M.Sc. in Computer Science from TCD in 1988, and a Ph.D. in Computer Science from TCD in 2006. Declan has 13 years of research experience in industry, having worked for IONA Technologies from 1995 to 2001 and from 1988 to 1995 with Broadcom Eireann Research. During this time he achieved a successful track record as lead researcher, and in coordinating international research projects and the transfer of research into products. He is currently primary supervisor for 6 Phd students: Matt Murtagh-White, Claire Mc Namara, Sarah Alzahrani, Ali Bandeh, Mary Sharp, Gaye Stephens. He has supervised 28 Phd students to completion since 2006 as primary supervisor (21) or co-supervisor (7) : Jeffrey Sardina,; Jiantao Wu; Delaram Golpayegani; Albert Navarro; Alex Randles; Sinead Impey; Peru Bhardwaj, Lucy Mc Kenna; Harshvardhan Pandit; Gachpaz Hamed Roghaiyeh; Wessel Reijers; Haytham Assem; Ademar Crotti; Michael Glienecke; Alan Meehan; Brian Walsh; Hendrik Thomas; Seung-Hwa Chung; Paul Stynes; Liam Fallon; Wei Tai; Dominic Jones; Colm Conroy; Bo Fu; Aidan Boran; Song Guo; Ruairdhi Power; Karl Quinn, as well as the following 7 MSc by Research Theses completions : Rolando Hanlon, Sahil Mathur, Tewson Seeoun; Mark Stokell, Rami Shosha, Paul Mara and Austin Kenny. In addition he has supervised 65+ MSc Dissertations to date. Those he has supervised have continued their careers either as postdoctoral researchers in academia (with some now holding their own faculty positions) or by joining in a variety of technology companies and progressing into senior roles. Publications and Further Research Outputs Peer-Reviewed Publications Non-Peer-Reviewed Publications Peer-Reviewed Publications Lucy McKenna, Declan O'Sullivan, Jane Ohlmeyer, Bronagh Ann McShane, Daniel Patterson, Digital Humanities and AI in Women\"s History: The VOICES project (Ireland), Oxford Research Encyclopedia of Gender and Women's History., 2026, p1 - 20 Journal Article, 2026 Jeffrey Sardina, John D. Kelleher, Declan O'Sullivan, A Survey on Graph Structure and Knowledge Graph Embeddings, IEEE 19th International Conference on Semantic Computing, Laguna Hills,California, USA, 3-5 Feb 2025, IEEE Computer Society Press, 2025, pp1 - 10 Conference Paper, 2025 URL DOI Beyza Yaman, Michael Mackey , Peter Cautley, Declan O'Sullivan, Exploring Semantic-Enhanced Property Graphs in Network Operations, 24th International Semantic Web Conference (ISWC), Japan, November 2-6, 4085, CEUR, 2025, pp1 - 4 Conference Paper, 2025 URL Claire McNamara, Lucy Hederman, Declan O'Sullivan, Mind the Gap: LLMs, Competency Questions, and the Non-Technical User in the Humanities Domain, First Workshop on Users and Knowledge Graphs (UKG), SEMANTICS 2025, Vienna, Austria, 3 September 2025, 4064, CEUR-WS, 2025, pp1 - 13 Conference Paper, 2025 URL Diego Rincon-Yanez,Sabrina Senatore, Declan O'Sullivan(ed.), Second International Workshop on Scaling Knowledge Graphs for Industry (SKGi), ESWC2025, Vienna, Austria, 4064, (1), 3rd-5th September, CEUR-WS, 2025, 1-32 p Proceedings of a Conference, 2025 URL Sarah Alzahrani, Declan O'Sullivan, Guiding LLM Generated Mappings with Lifecycle-Based Metadata: An Early Evaluation, The Second Workshop on Knowledge Graphs and Neurosymbolic AI (KG-NeSy), SEMANTICS 2025, Vienna, Austria, 3 September 2025, 4064, CEUR-WS, 2025, pp1 - 7 Conference Paper, 2025 URL Diego Rincon-Yanez,Sabrina Senatore, Declan O'Sullivan, Scaling NeuroSymbolic AI integration for Seismic Event Detection, Proceedings of Second International Workshop on Scaling Knowledge Graphs for Industry (SKGi); ESWC 2025, 22nd European Semantic Web Conference, ESWC 2025, Portoroz, Slovenia, June 1-5 2025, edited by Diego Rincon-Yanez,Sabrina Senatore, Declan O'Sullivan , ESWC, 2025, pp1 - 1 Conference Paper, 2025 URL Sarah Alzahrani, Declan O'Sullivan, MetaSEMAP: Usability Evaluation for Metadata Annotation Across the Mapping Lifecycle, First Workshop on Users and Knowledge Graphs (UKG), SEMANTICS 2025, 4064, CEUR-WS, 2025, pp1 - 12 Conference Paper, 2025 URL Beyza Yaman, Michael Mackey, Peter Cautley, Declan O'Sullivan, Evaluating OpenSPG Engine for Network Operations, SEMANTiCS 2025, Vienna, Austria, 3-5 September 2025, 4064, CEUR-WS, 2025, pp1 - 6 Conference Paper, 2025 URL Orlando Abuanza Ubaque, Diego Rincon-Yanez, Declan O'Sullivan, Injecting Knowledge Graph Embeddings into RAG Architectures: Scalable Fact-Checking for Combating Disinformation with LLMs, Second International Workshop on Scaling Knowledge Graphs for Industry (SKGi 2025), Vienna, Austria, 3rd September 2025, 4064, CEUR-WS, 2025, pp1 - 6 Conference Paper, 2025 URL Matt Murtagh-White, P.J. Wall and Declan O'Sullivan, How Low Can We Go? Quantization Effects on LLM SPARQL Generation (Best Poster Nominee), The Semantic Web \" 22nd European Semantic Web Conference, ESWC 2025, Portoroz, Slovenia,, June 1-5, 2025, ESWC, 2025, pp99 - 102 Poster, 2025 URL Wojciech Palacz, Sabina Licho\"ai, Jacek Musia\", Katarzyna Wawrzycka-Adamczyk, Gra\"yna \"lusarczyk, Barbara Strug, Beyza Yaman, Michelangelo Tesi, Karl Gisslander, Declan O'Sullivan, Augusto Vaglio, Giacomo Emmi, Mark A. Little, Krzysztof Wójcik, Ontology-based integration and querying of heterogeneous rare disease data sources - POLVAS perspective, Computers in Biology and Medicine, 185, 2025, p1 - 14 Journal Article, 2025 DOI TARA - Full Text Gaye Stephens, Declan O'Sullivan, Design of a Technology Ethics Serious Game: Cultivating Ethical Thinking, ITiCSE 2025: 30th ACM Conference on Innovation and Technology in Computer Science Education, ACM, 2025, pp792 Conference Paper, 2025 DOI Erwan Moreau, Orla Hardiman , Mark Heverin, Declan O'Sullivan, Mining impactful discoveries from the biomedical literature, BMC Bioinformatics, (25), 2024, p1 - 20 Journal Article, 2024 DOI Albert Navarro-Gallinad, Jennifer Scott, Enock Havyarimana , Neil Basu, Mark Little, Declan O'Sullivan, Enabling data linkages for rare diseases in a resilient environment with the SERDIF framework, npj Digital Medicine, Spring Nature, 7, 2024, p1 - 9 Journal Article, 2024 DOI Jiantao Wu, Fabrizio Orlandi, Declan O'Sullivan, Soumyabrata Dev, LinkedGeoClimate: An Interoperable Platform for Climate Data Access Within Geographical Context, IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 17, 2024, p10352-10366 Journal Article, 2024 DOI URL Jiantao Wu, Fabrazio Orlandi, Declan O'Sullivan. Soumyabrata Dev, On the Use of Virtual Knowledge Graphs to Improve Environmental Sensor Data Accessibility, IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 17, 2024, p6671-6682 Journal Article, 2024 URL DOI Alex Randles, Lucy McKenna, Lynn Kilgallon, Beyza Yaman, Peter Crooks, Declan O'Sullivan, Evaluating the Knowledge Graph Editor of the Virtual Record Treasury of Ireland, VOILA Workshop - International Semantic Web Conference ISWC, Baltimore, USA, 11-15 November, CEUR, 2024, 1, pp14 Conference Paper, 2024 URL Karl Gisslander, Arthur White, Louis Aslett, Zdenka Hrušková, Peter Lamprecht, Jacek Musia\", Jamsheela Nazeer, James Ng, Declan O'Sullivan, Xavier Puéchal, Matthew Rutherford, Mårten Segelmark, Benjamin Terrier, Vladimir Tesa\", Michelangelo Tesi, Augusto Vaglio, Krzysztof Wójcik, Mark A Little, Aladdin J Mohammad, Data driven subclassification of ANCA associated vasculitis: model-based clustering of the FAIRVASC cohort, The Lancet Rheumatology, 2024, p1 - 19 Journal Article, 2024 DOI TARA - Full Text Jiantao Wu, Fabrizio Orlandi, Declan O'Sullivan, Soumyabrata Dev, Leveraging Knowledge Graphs for Enhancing Climate-Resilient Agricultural Analysis, IEEE 9th International Conference on Computational Intelligence and Applications (ICCIA), Haikou, China, 09-11 August 2024, IEEE, 2024, pp241-245 Conference Paper, 2024 DOI Alex Randles, Declan O'Sullivan, Phased Evaluation of Ontologies with Domain and Ontology Experts, 15th Workshop on Ontology Design and Patterns (WOP 2024), International Semantic Web Conference (ISWC), Baltimore, USA, 12th November 2024, CEUR, 2024, pp1 - 12 Conference Paper, 2024 URL Auto-generation of Blockchain-Based Distributed Applications Using Ontologies in, editor(s)El Madhoun, N., Dionysiou, I., Bertin, E. , Blockchain and Smart-Contract Technologies for Innovative Applications, Springer, Cham, 2024, pp217-258 , [Muhammad Uzair Qureshi, Damien Graux, Fabrizio Orlandi, Declan O'Sullivan] Book Chapter, 2024 DOI Matt Murtagh-White, PJ Wall, Declan O'Sullivan, Evaluating InterDev: A FAIR Platform for International Development Data, VOILA Workshop, International Semantic Web Conference ISWC, Baltimore, USA, 11 - 15 November, CEUR, 2024, pp1 - 12 Conference Paper, 2024 URL Alex Randles, Lucy McKenna, Lynn Kilgallon, Beyza Yaman, Peter Crooks, Declan O'Sullivan, Facilitating Search of the Virtual Record Treasury of Ireland Knowledge Graph using ChatGPT, Demo Paper: SEMANTICS - 20th International Conference on Semantic Systems, Amsterdam, The Netherlands, 17 - 19 Sept, 2024, pp1 - 5 Conference Paper, 2",
  "content_length": 120668,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:43"
}