{
  "name": "Deepak Ganesan",
  "homepage": "https://people.cs.umass.edu/~dganesan",
  "status": "success",
  "content": "Deepak Ganesan Deepak Ganesan Professor School of Computer Science, UMass Amherst Address: A343 Lederle Graduate Research Center (LGRC), Amherst, MA, 01003 Email: dganesan AT cs DOT umass DOT edu Ph: (413) 545 2450 Admin: Karren Sacco Main Publications Teaching Deepak Ganesan is a Professor in the Department of Computer Science at UMASS Amherst. He is the Director of the Massachusetts AI and Technology Center for Connected Care in Aging and Alzheimer's Disease (MassAITC), a multidisciplinary initiative spanning UMass Amherst, Brigham and Womens Hospital, Massachusetts General Hospital, Brandeis University and Northeastern University and also directs the Center for Personalized Health Monitoring (CPHM) at UMass Amherst. He received his Ph.D. in Computer Science from UCLA in 2004 and his bachelors in Computer Science from IIT, Madras in 1998. He is an ACM Fellow. Research My current research focuses on ultra-low power wireless communication, novel platforms and algorithms for mobile and wearable health sensing, learning and inference on multi-modal sensor data, and micro-powered sensors. My current projects include sensing via smart textiles, smart eyeglasses, backscatter communication, and mobile health. I co-lead the MOSAIC Research Group. Recent Publications Click here for a complete list. Analyzing adult-child interactions during play, ACM IMWUT 2024. Context-aware micro-classifiers for IoT inference, ACM MobiSys 2024. Multi-stakehoder perspectives on child mental health screening tools, ACM CHI 2024. Early Exit Offload for Inference with Duty-cycled Radios, ACM Mobicom 2023. Textile Sensor Arrays for Fine-gained Interaction Detection, ACM MobiSys 2022. ACM SIGMOBILE and ACM Research Highlight. PhyMask: Sleep Sensing with an All-textile Eye Mask, ACM Health 2022. EarlyScreen for Psychopathology Assessment in Preschool Children, ACM IMWUT 2022 MIXIQ: A new Ultra-low power Wireless Receiver, ACM Mobicom 2021. COCOON: Conductive Substrates for Wireless Communication, ACM SenSys 2021. OpiTrack: Clinical Opioid Use Tracker, ACM IMWUT 2021. LTE-based Pervasive Sensing, ACM Sensys 2021. Low-latency Speculative Inference, ACM MobiSys 2021. ACM SIGMOBILE Research Highlight. CLIO: Enabling automatic compilation of deep learning pipelines across IoT and Cloud, ACM Mobicom 2020. Redefining passive in backscattering with commodity devices, ACM Mobicom 2020. Multimodal Smart Eyewear for Longitudinal Eye Movement Tracking, MATTER 2020. Phyjama: Fiber-enhanced pyjamas for physiological sensing, ACM Ubicomp 2019. Sensing facial expressions from a wearable eyeglass, ACM Ubicomp 2019. Sensing Craving, Euphoria and Drug Seeking Behavior using Wearables, ACM Ubicomp 2019. Polymorphic Radios: Active-Passive radios for Ultra-low Power Communication, SIGCOMM 2018. Sensing joint movements with fabric, SenSys 2018. Backscatter Communication for On-body Sensors, SIGCOMM 2016 Braidio: Energy offload with active-passive radios, SIGCOMM 2016 Domain Adaptation Methods for Cocaine Detection using Wearables., Ubicomp 2016 Pupil Tracking via a Low-power Computational Eyeglass, Mobicom 2015. Laissez-Faire: Fully asymmetric backscatter communication, SIGCOMM 2015. EkhoNet: High Speed Ultra Low-power Backscatter, Mobicom 2014. Best Paper Award Runner-up. iShadow: AWearable, Real-Time Mobile Gaze Tracker. MobiSys 2014. RisQ: Recognizing Smoking Gestures with Inertial Sensors on a Wristband. MobiSys 2014. Enabling Bit-by-Bit Backscatter Communication. NSDI 2014 Students Current: Zhenyu Lei, Xingda Chen, Jin Huang, Mohammad Mehdi Rastikerdar, Ankur Aditya, Abhay Anand. Alumni: Manasa Kalanadhabhatta (Meta Reality Labs), Yuda Feng (Samsung Research), Ali Kiaghadi (Health Scientist, Apple), Soha Rostaminia (Health ML, Apple), Tianxing Li (Assistant Professor, MSU), Shiwei Fang (Augusta), Annamalai Natarajan (Philips Research), Addison Mayberry (Microsoft), Pengyu Zhang (Uber), Abhinav Parate (Co-founder Lumme Health), Jeremy Gummeson (Asst Prof, UMass Amherst), Tingxin Yan (Meta), Ming Li (Two Sigma Investments), Devesh Agrawal (Meta), Purushottam Kulkarni (Professor at IIT Bombay), Gaurav Mathur (Engineering Director, Meta), Moaj Musthag (Director of Engineering, Turo), Pan Hu (Uber) Major Professional activities Program Chair: ACM Mobicom 2024, ACM MobiSys 2017, HotWireless 2014, IEEE SECON 2013, ACM SenSys 2010",
  "content_length": 4355,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:41"
}