{
  "name": "Deepak Khemani",
  "homepage": "https://plaksha.edu.in/faculty-details/dr-deepak-khemani",
  "status": "success",
  "content": "Dr. Deepak Khemani | Professor, Plaksha Careers at Plaksha Intranet Contact Us Public Self Disclosure Careers at Plaksha Intranet Contact Us Public Self Disclosure APPLY NOW BTech program MS in AI program About Us Vision & Mission Founders & Donors University Leadership Partnerships & Associations Academic Advisory Board Administration Statutory Bodies and Governance Newsletters Academics Academic Office (OAA) Harish and Bina Shah School of AI & Computer Science Academic Programs Undergraduate BTech in Computer Science & Artificial Intelligence BTech in Robotics & Autonomous Systems BTech in Biological Systems Engineering BTech in Data Science. Economics & Business Grand Challenge Scholars Program Graduate MS in AI PhD Program Tech Leaders Fellowship Summer Program Young Technology Scholars Young Data Scientists Teaching Labs & Centers Center for Thinking, Language and Communication Academic Calendar Admissions BTech Program Regular Admissions Transfer Admissions Young Technology Scholars Young Data Scientists PhD Program Scholarships & Financial Aid Merit Scholarship Need Based Financial Aid Awards SP Dutt Award Faculty Full Time Faculty Adjunct & Visiting Faculty Faculty Recruitment Research Research Institutes Binny Bansal Institute for Inventing the Future Research Centers Center for Clean Energy Center for Water Security Center for Thinking, Language and Communication Research Labs ARK Foundation Robotics Lab Plaksha Research Fellowship Life at Plaksha Gallery Well Being Campus & Spaces Axis Bank FutureTech Building DS Brar Center Student Careers Career Outcomes Placements Brochure Corporate Partnerships & Careers Office of Global Engagements Center for Entrepreneurship About Us Vision & Mission Founders & Donors University Leadership Partnerships & Associations Academic Advisory Board Administration Statutory Bodies and Governance Newsletters Academics Academic Office (OAA) Harish and Bina Shah School of AI & Computer Science Academic Programs Undergraduate BTech in Computer Science & Artificial Intelligence BTech in Robotics & Autonomous Systems BTech in Biological Systems Engineering BTech in Data Science. Economics & Business Grand Challenge Scholars Program Graduate MS in AI PhD Program Tech Leaders Fellowship Summer Program Young Technology Scholars Young Data Scientists Teaching Labs & Centers Center for Thinking, Language and Communication Academic Calendar Admissions BTech Program Regular Admissions Transfer Admissions Young Technology Scholars Young Data Scientists PhD Program Scholarships & Financial Aid Merit Scholarship Need Based Financial Aid Awards SP Dutt Award Faculty Full Time Faculty Adjunct & Visiting Faculty Faculty Recruitment Research Research Institutes Binny Bansal Institute for Inventing the Future Research Centers Center for Clean Energy Center for Water Security Center for Thinking, Language and Communication Research Labs ARK Foundation Robotics Lab Plaksha Research Fellowship Life at Plaksha Gallery Well Being Campus & Spaces Axis Bank FutureTech Building DS Brar Center Student Careers Career Outcomes Placements Brochure Corporate Partnerships & Careers Office of Global Engagements Center for Entrepreneurship Careers at Plaksha Intranet Contact Us Public Self Disclosure APPLY NOW BTech program MS in AI program Deepak Khemani Deepak Khemani Professor, Plaksha University PhD, IIT Bombay Area of Expertise: Artificial Intelligence Select About Research Publications About Deepak Khemani Dr. Deepak Khemani has been working in artificial intelligence, with a focus on symbolic reasoning. He started working in AI during his doctoral studies where he explored the application of memory-based planning in the game of contract bridge. Contract bridge is a game yet unconquered by AI, unlike other games like Chess, Go, Backgammon, and Scrabble where machines rule supreme. His current goals are to combine knowledge representation, heuristic search, and constraints processing to build problem solvers. These methods can be applied to create articulate tutoring systems that can help students with math and physics problems, amongst other things. Dr. Khemani teaches courses at the heart of AI, and has popular courses on Search Methods, Knowledge Representation, and Constraint Satisfaction on the NPTEL/Swayam platform. Research Dr. Khemani's research has been on approaches in which an autonomous agent can represent the world around it, draw upon experience to solve problems, and can imagine the future to search for solutions. He has conducted several projects for government and industry, as well as collaborative projects funded by BMBF Germany and UKIERI. Publications Dr. Khemani's 2013 book A First Course in Artificial Intelligence (available here) has wide ranging coverage of the subject. His second more focused book Search Methods in Artificial Intelligence (available here) was published recently. He has also had interest in popular science and was a member in the small team that started the children’s science magazine Jantar Mantar in the early nineties, published by Tamil Nadu Science Forum. During that period he also wrote a small book Signs of the Zodiac, explaining astronomy to young children. A scanned copy can be found here. Research Interests Search methods for problem solving Knowledge representation Memory-based reasoning Constraint satisfaction problems Game playing Epistemic logic Past Associations IIT Madras, November 1988 – July 2023 Visiting Scientist, Technical University Munich, 1995 (DAAD), 1996, 1999, two months each Visiting Scientist, Tata Research Centre, Pune, 1997 – 1998 Visiting Faculty (Dean Students, Chair SCEE) IIT Mandi, 2011 Visiting Faculty (Dean Faculty, Member Inst. Standing Committee), IIT Mandi, 2016 – 2018 Adjunct Faculty, IIT Dharwad, 2019 – 2020 Education BTech in Mechanical Engineering, IIT Bombay MTech in Computer Science & Engineering, IIT Bombay PhD in Computer Science & Engineering, IIT Bombay Facebook Twitter Instagram LinkedIn YouTube",
  "content_length": 6007,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:42"
}