{
  "name": "Deepak B. Phatak",
  "homepage": "https://www.cse.iitb.ac.in/~dbp",
  "status": "success",
  "content": "Deepak B Phatak Deepak B. Phatak Home Dr Deepak B Phatak Born on 2nd April 1948, Professor Phatak obtained his Bachelor’s degree in Electrical Engineering from SGSITS Indore in 1969, and his M Tech and Ph D from IIT Bombay. He has been serving with IIT Bombay since 1971. He headed the CSE department from 1991 to 1994, He was the first Dean of Resources of the Institute from 1995 to 1998. He was the founding head of the Kanwal Rekhi School of IT from 1998 to 2002. He briefly served as head of SJ Mehta School of management, from 2004 to 2005. He was Subrao M Nilekani Chair Professor, in the department of Computer Science and Engineering from 2000 to 2013. He currently serves as professor in the department of CSE. His research interests are Data Bases and Information Systems, Software Engineering, System Performance Evaluation, IT enabled Education, and IT strategy planning. His primary research inclinations are in Technology application and deployment. He has guided 7 PhD and over 170 MTech students, and has authored over 50 publications. In the Kanwal Rekhi School of IT at IIT Bombay, which he set up in 1998 (now merged with the Department of CSE), he created a focus on applied research. He started an IT incubator to foster innovation through start-up companies. It has now flourished as IIT Bombay’s Society for Innovation and Entrepreneurship (SINE), and is considered the best incubator in India. He also started the country’s first interactive distance learning program using VSATs. This initiative has now blossomed into the Centre for Distance Engineering Education (CDEEP). Using the experience gained in that initiative, he recently completed a national mission project to train 1,000 teachers at one time, in several core engineering subjects using ICT, through a series of ISTE workshops. By June 2012, his efforts had succeeded in training over 20,000 teachers from across 1,200 engineering colleges in the country. Encouraged by the excellent feedback from participating teachers, the National Mission has entrusted him with the responsibility of training 1,50,000 teachers in the next 3 years, through mega-workshops training 10,000 teachers at a time. He set up the Affordable Solutions Lab (ASL) at IIT Bombay in 2000, which attempts to develop low cost technology solutions. He is regarded as the pioneer of smart card usage in financial transactions in India. Through ASL, he popularized use of thin clients in India. He developed low cost Clicker devices for use in Indian class rooms, and open source multi-media tools for e-learning. In March 2012, he was given the responsibility of executing the prestigious Aakash project of the National Mission. 1,00,000 low cost tablet computers are to be deployed for engineering education under this project, through 300 Aakash project Centres. Under his leadership, IIT Bombay has succeeded in negotiating an upgraded Aakash-2 version at a price of Rs 2263 per tablet. 14,000 tablets have already been distributed to 250 engineering colleges in the country, and over 12,000 teachers of these colleges have been trained in the educational use of these tablets. It is expected that over 25,000 students in these colleges will start using Aakash tablets in their class rooms, and for their project work, starting with the academic year 2013. Aakash-2 tablet computers are now recognized as the lowest cost educational tablets globally. Dr. Phatak has had a long association with Computer Society of India, spanning over three decades. He has been involved with CSI COMAD conferences, for many years. He played an important role in getting the international conference on Very Large Data Bases (VLDB) to India, and was the General Conference Co-chair for the same in 1996. VLDB 96 was a resounding success, and helped in generating a strong focus in India on Database research. He was elected Fellow of the Computer Society of India (CSI) in 1999, and fellow of the Institution of Electronic and Telecommunication Engineers (IETE) in 2000. He currently serves as the Chairman of the national board of IT education and research of All India Council of Technical Education (AICTE). He has been an Open Source evangelist in India, and has pioneered several initiatives to popularize Free and Open Source Software usage. He believes that India should soon migrate from the status of a net taker from Open Source, to become a net giver to the Open Source community. In 1983-84, He spent one year in his Alma Mater SGSITS, to set up the department of Computer Science in the college, and initiated the BE program in Computers. He spent subsequent summer in the University at Indore (DAVV), to set up the Computer Center, and to initiate the MCA program. In 2003, he took a year-long sabbatical leave to tour across the country. He visited over 60 colleges, interacting with students and teachers. He discovered the enormous talent that exists in each of such smaller places. Realizing that such students and teachers are eager to seek some useful guidance and mentoring, he started the 'Ekalavya project' in IIT, which attempts to provide web based support in educational projects, and fosters growth of collaborating communities across educational institutions. He has been a consultant and adviser to many organizations on various issues related to Information Technology. In the financial sector, he has been an I.T. adviser to State Bank of India, Reserve Bank of India, Unit Trust of India, IDBI, Life Insurance Corporation of India, New India Assurance, UIIC, SEBI, NSDL, ECGC, etc. He works on several committees advising Central and State Government departments, on issues related to IT projects. He has worked on the governing boards of NIBM, IDRBT, UTIISL, ISIL, etc. He recently served on the board of Bank of Baroda, and currently serves on the boards of HDFC Asset Management Company, IBPS, and National Insurance Academy. He is currently on the IT and HR committees of the Board of Bank of Baroda. He is also a permanent invitee to the payment system Board of RBI. He was conferred Life time achievement awards by Skoch foundation in 2003, by Data Quest in 2008, and by Dewang Mehta Business School awards in 2010. He was listed among fifty most influential Indians, by Business week in 2009. He received the 'Excellence in Teaching' award of IIT Bombay in 2009; and the IIT Bombay Industrial Impact award in 2010. On 26th January 2013, He was conferred the Padma Shri award by the Government of India, for his services in Science and Technology. Dr. Phatak believes that teaching can't be just a profession, but has to be one's 'Dharma'. His dream is to see a resurgent India catching up with the world, using Information Technology as the springboard. Updated on 30-01-2013",
  "content_length": 6766,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:40"
}