{
  "name": "Deepak Mishra 0001",
  "homepage": "https://sites.google.com/iitj.ac.in/dmishra",
  "status": "success",
  "content": "Deepak MishraSearch this siteEmbedded FilesSkip to main contentSkip to navigationAssistant ProfessorComputer Science and EngineeringIIT JodhpurMy journey began in 2010 with Healthcare R&D team in Siemens Information Systems Ltd. I was fortunate to work with some of the best mentors on challenging problems. It setup platform for an in-depth and rigorous research and motivated me to join IIT Delhi for higher studies. I explored different domains while remaining active in my doctoral research. I am continuing my journey as Assistant Professor at the Department of Computer Science and Engineering, IIT Jodhpur.I am interested in fundamental and applied research problems related to deep learning, medical image analysis, and responsible AI. I have funded PhD and RA positions available in my group. Students with strong research aptitude are encouraged to contact with updated resumes. My research group, Medical AI Systems (MAISys) at IIT Jodhpur, is constantly working towards the development and deployment of AI-driven medical technologies. For more details, please visit MAISys website.EducationPhD in Computer Technology (Electrical Engineering), IIT Delhi, 2019M. Tech in Computer Technology, 2013, IIT DelhiB. Tech in Electronics and Communication Engineering, Indian Institute of Information Technology Jabalpur, 2010Professional Activities Area Chair: MICCAI 2025.Reviewer/PC Member: MICCAI, AAAI, CVPR, ECCV, ICPR.Organizing Committee Member: Sun Pharma Science Foundation National Symposium on Artificial Intelligence in Healthcare 2024.News [Nov 2025] Our work \"Federated Model Synchronization for Diagnostic Redefinition through a Novel Selective Parameter Unlearning\" is accepted in WACV 2026.[Sep 2025] Our work \"Guide2Heart: Proximity Guidance for Standard Echocardiographic View\" is recognized with the Best Poster Runner-Up Award at the ASMUS Workshop at MICCAI 2025.[Aug 2025] Our work \"Beyond Accurate Distillation: Calibrated Knowledge Distillation for Reliable Predictions\" is accepted at IEEE Transactions on Artificial Intelligence.[Jul 2025] Our work \"AR2FL: Anomaly-Resistant Robust Framework for Federated Learning\" is accepted at IEEE Transactions on Artificial Intelligence.[Jul 2025] Our work \"Scale-Aware Adaptive Feature Quantization for Robust Medical Image Representation Learning\" is accepted at ECAI-2025. [Jun 2025] Our work \"Self-supervised Contextual Representations of Chest X-ray Images\" is accepted in IEEE Signal Processing Letters.[Jun 2025] Indian patent granted for \"Adaptive Frame Resolution Based Image System for Always-On Imaging Applications\".[May 2025] Our work \"Fine-Grained Rib Fracture Diagnosis with Hyperbolic Embeddings\" is accepted (early accept) in MICCAI 2025.[May 2025] Invited as a Distinguished Speaker in FDP on \"AI in Medical Imaging and Diagnostics: Current Trends and Challenges\" at NIT Jaipur.[Apr 2025] Our work \"FLAME\" is accepted in IEEE Transactions on Emerging Topics in Computational Intelligence.[Apr 2025] Indian patent granted for \"Automated Personalized Assistance and Monitoring System for People with Special Needs\".[Jan 2025] Our work \"ViT Coupled Efficient CMOS Image Sensor with Sparse Acquisition and Patch Selection\" is accepted in ISCAS 2025.[Nov 2024] Speaking at Sun Pharma Science Foundation National Symposium on “Artificial Intelligence in Healthcare”.Report abuseReport abuse",
  "content_length": 3372,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:42"
}