{
  "name": "Deepti Raghavan",
  "homepage": "https://deeptir.me",
  "status": "success",
  "content": "Deepti Raghavan Deepti Raghavan Assistant Professor of Computer Science, Brown University deeptir [at] brown [dot] edu Github Resume I am an Assistant Professor in the Department of Computer Science at Brown University. My research interests focus on operating systems, networking, and machine learning systems. I focus on developing new networked systems abstractions that enable new opportunities for performance, particularly by modifying APIs that affect when, how, and where data is moved. Previously, I received my PhD in computer science from Stanford. I was lucky to be advised by Matei Zaharia and Phil Levis. I also closely collaborated with Irene Zhang. I was supported by a National Science Foundation Graduate Research Fellowship (2019) and a Stanford School of Engineering Fellowship (2018-2019). Even earlier, I received both my Bachelor's (2017) and my M.Eng (2018) degrees at MIT, where I researched in the Networks and Mobile Systems group in CSAIL, under Hari Balakrishnan. I am actively recruiting PhD students to join my lab. If you are interested, apply to the Brown CS PhD program and mention my name. If you are a current Brown masters or undergraduate student interested in independent research in systems, email me! Teaching I will co-teach CSCI 0300: Fundamentals of Computer Systems with Malte Schwarzkopf in Spring 2026. Fall 2025, Fall 2024: CSCI 2690: Cloud and Datacenter Operating Systems Spring 2025: CSCI 1390: Systems for Machine Learning Selected Publications ALTO: An Efficient Network Orchestrator for Compound AI Systems. Keshav Santhanam*, Deepti Raghavan*, Muhammad Shahir Rahman, Thejas Venkatesh, Neha Kunjal, Pratiksha Thaker, Philip Levis, Matei Zaharia. EuroMLSys 2024, Athens, Greece. Paper Cornflakes: Zero-Copy Serialization for Microsecond-Scale Networking. Deepti Raghavan, Shreya Ravi, Gina Yuan, Pratiksha Thaker, Sanjari Srivastava, Micah Murray, Pedro Henrique Penna, Amy Ousterhout, Philip Levis, Matei Zaharia, Irene Zhang. SOSP 2023, Koblenz, Germany. Awarded Distinguished Artifact. Paper Slides Code Reproducibility Instructions Clamor: Extending Functional Cluster Computing Frameworks with Fine-Grained Remote Memory Access. Pratiksha Thaker, Hudson Ayers, Deepti Raghavan, Ning Niu, Philip Levis, Matei Zaharia. SoCC 2021, Hybrid. Paper Breakfast of Champions: Towards Zero-Copy Serialization with NIC Scatter-Gather. Deepti Raghavan, Philip Levis, Matei Zaharia, Irene Zhang. HotOS 2021, Virtual. Paper POSH: A Data-Aware Shell. Deepti Raghavan, Sadjad Fouladi, Philip Levis, Matei Zaharia. Usenix ATC 2020, Boston, USA. Paper Code Model Assertions for Monitoring and Improving ML Models. Daniel Kang*, Deepti Raghavan*, Peter Bailis, Matei Zaharia. MLSys 2020, Austin, Texas. Paper Model Assertions for Debugging Machine Learning. Daniel Kang*, Deepti Raghavan*, Peter Bailis, Matei Zaharia. NeurIPS MLSys Workshop 2018, Montreal, Canada. ICLR DebugML Workshop 2019, New Orleans, Louisiana. Paper Restructuring Endpoint Congestion Control. Akshay Narayan, Frank Cangialosi, Deepti Raghavan, Prateesh Goyal, Srinivas Narayana, Radhika Mittal, Mohammad Alizadeh, Hari Balakrishnan. ACM SIGCOMM 2018, Budapest, Hungary. Paper Project Code Pantheon: the training ground for Internet congestion-control research. Francis Y. Yan, Jestin Ma, Greg Hill, Deepti Raghavan, Riad S. Wahby, Philip Levis, Keith Winstein. Usenix ATC 2018, Boston, USA. Awarded Best Paper. Paper Project Code Reviewing & Service EuroSys 2026 PC OSDI 2025 PC SOSP Doctoral Workshop (SysDW) 2024 PC Last updated: May, 2025 | Designed with ☺ by dr | Favicon made by Smashicons from www.flaticon.com licensed by CC 3.0 BY",
  "content_length": 3651,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:47"
}