{
  "name": "Deepak Rajendraprasad",
  "homepage": "https://www.iitpkd.ac.in/people/deepak",
  "status": "success",
  "content": "deepak | IIT Palakkad Englishहिन्दी A- A A+ 0491 209 2013 (Office) | info@iitpkd.ac.in INDIAN INSTITUTE OF TECHNOLOGY PALAKKAD Kanjikode | Palakkad | Kerala - 678623 0491 209 2001 (Office) | info@iitpkd.ac.in Dr. Deepak RajendraprasadAssociate ProfessorComputer Science And EngineeringResearch Area: Combinatorics, Research Area: Graph TheoryView Website Biosketch 2016 to date. Assistant/Associate Professor Computer Science and Engineering, IIT Palakkad 2013-2016. Post-doc in Computer Science University of Haifa, Israel Advisers: Martin Charles Golumbic, Ilan Newman, Yuri Rabinovich 2009-2013. PhD in Computer Science Indian Institute of Science, Bangalore Adviser: L. Sunil Chandran Thesis: Rainbow Colouring and some Dimensional Problems in Graph Theory [Download] 2005-2009. Lecturer in Electronics and Communication Engineering GEC Bartonhill and NIT Calicut 2004-2005. Engineer, Video group Ittiam Systems (P) Ltd., Bangalore 2002-2004. M.E. in Signal Processing Indian Institute of Science, Bangalore Project adviser: K. V. S. Hari 1998-2002. B.Tech. in Electronics & Communication College of Engineering Trivandrum 1996-1998. Pre-degree (Group I: Mathematics, Physics, Chemistry) Government Arts College, Thiruvananthapuram 1990-1996. High School Christ Nagar High School, Thiruvananthapuram 1984-1990. Primary School Chinmaya Vidyalaya, Shastamangalam, Thiruvananthapuram Research My research experience so far has been primarily in combinatorics and algorithms arising from combinatorial observations. I have worked mostly in the areas of graph representations, graph colouring, partial orders, permutations, simplicial complexes and property testing. Teaching Winter 2022 CS6003 Probabilistic Method CS5014 Foundations of Data Science & Machine Learning (MCaM Core) Monsoon 2021 CS3050 Theory of Computation (S5 Core) CS5017 Topics in Discrete Mathematics (MCaM Core) Winter 2021 CS2020 Discrete Mathematics (S4 Core, with Dr. Krithika Ramaswamy) CS5014 Foundations of Data Science & Machine Learning (MCaM Core) Monsoon 2020 CS3050 Theory of Computation (S5 Core) CS5017 Theory of Computation (MCaM Core for MSc. Math graduates) Winter 2020 CS4503 Combinatorics  (Elective) Monsoon 2019 CS3050 Theory of Computation (S5 Core) Winter 2019 CS2020. Discrete Mathematics (S4 Core) CS1020. Introduction to Programming (S2 Core, One Lab Batch) Monsoon 2018 CS2010 Logic for Computing (S3 Core) CS4503 Combinatorics  (Elective) Winter 2018 CS6001. Topics in Graph Theory (For research students) CS2200. Languages, Machines and Computation (S4 Core) CS1020. Introduction to Programming (S2 Core, Theory Part) Monsoon 2017 CS2100. Discrete Mathematics for Computer Science  (S3 Core) CS2110. Computational Programming Lab (S3 Core) Winter 2017 CS2200. Languages, Machines and Computation (S4 Core) Monsoon 2016 CS2100. Discrete Mathematics for Computer Science  (S3 Core) CS1100. Computational Engineering (S1 Core, Lab Component) Research Group Ms. Durga R. S. (BS/MS Final Year Student at IISER Tirupati) Dr. Jishnu Sen (Postdoc, 2024-) Ms. Navaneetha E. P. (PhD Student, 2024-) Mr. Pawan Kumar (PhD Student, 2022-) Mr. Lijo M. Jose (PhD Student, 2020-) Dr. Jasine Babu (Colleague) Dr. Krithika Ramaswamy (Colleague) Dr. Srimanta Bhattacharya (Colleague) Former Students and Postdocs Dr. Deepu Benson (PhD 2017-23), Assistant Professor, CVV Institute of Science & Technology. Dr. Sreejith K. P. (PhD 2017-23), Postdoc, IIT Madras Dr. P. Francis (Postdoc 2019-22), Assistant Professor, VIT Andhra Pradesh Publications B0-VPG Representation of AT-free Outerplanar Graphs Sparsh Jain, Sreejith K Pallathumadam, Deepak RajendraprasadProceedings of CALDAM 2022. Lecture Notes in Computer Science, Springer, Cham. 13179 103-114 (2022) Characterization of B0-VPG Cocomparability Graphs and a 2D Visualization of their Posets Sreejith K Pallathumadam, Deepak RajendraprasadOrder (2022) An improvement to Chvátal and Thomassen’s upper bound for oriented diameter Jasine Babu, Deepu Benson, Deepak Rajendraprasad, Sai Nishanth VakaDiscrete Applied Mathematics 304 432-440 (2021) Hamiltonian and pseudo-Hamiltonian cycles and fillings in simplicial complexes Rogers Mathew, Ilan Newman, Yuri Rabinovich, Deepak RajendraprasadJournal of Combinatorial Theory, Series B 150 119-143 (2021) Characterization and a 2D Visualization of B0-VPG Cocomparability Graphs Sreejith K. Pallathumadam, Deepak RajendraprasadProceedings of GD 2020. Lecture Notes in Computer Science, Springer, Cham. 12590 191–204 (2021) Oriented diameter of star graphs K.S. Ajish Kumar, Deepak Rajendraprasad, K.S. SudeepDiscrete Applied Mathematics In Press (2021) On Coupon Coloring of Cartesian Product of Some Graphs P. Francis, Deepak RajendraprasadProceedings of CALDAM 2021. Lecture Notes in Computer Science, Springer, Cham. 12601 309–316 (2021) On graphs whose eternal vertex cover number and vertex cover number coincide Jasine Babu, L. Sunil Chandran, Mathew C. Francis, Veena Prabhakaran, Deepak Rajendraprasad, J. Nandini WarrierDiscrete Applied Mathematics In Press (2021) New bounds on the Ramsey number r(I_m, L_n) Ferdinand Ihringer, Deepak Rajendraprasad, Thilo WeinertDiscrete Mathematics 344 (3) 112268 (2021) Dimension of CPT posets Atrayee Majumder, Rogers Mathew, Deepak RajendraprasadOrder (2020) Oriented Diameter of Star Graphs K. S. Ajish Kumar, Deepak Rajendraprasad, K. S. SudeepProceedings of CALDAM 2020 307-317 (2020) An Improvement to Chvátal and Thomassen's Upper Bound for Oriented DiameterJasine Babu, Deepu Benson, Deepak Rajendraprasad, Sai Nishant VakaProceedings of CSR 2020, Springer Lecture Notes in Computer Science (2020) On Graphs with Minimal Eternal Vertex Cover Number Jasine Babu, L. Sunil Chandran, Mathew C. Francis, Veena Prabhakaran, Deepak Rajendraprasad, J. Nandini WarrierSpringer Lecture Notes in Computer Science, Proceedings of CALDAM 2019 263-273 (2019) Testing for forbidden order patterns in an array Ilan Newman, Yuri Rabinovich, Deepak Rajendraprasad, and Christian SohlerRandom Structures & Algorithms Early View (Online first) (2019) Edge-intersection graphs of boundary-generated paths in a grid Martin Charles Golumbic, Gila Morgenstern, and Deepak RajendraprasadDiscrete Applied Mathematics (2018) 2018DAM-EdgeIntersectionGraphs.pdf (405.38 KB) Separation dimension and sparsity Noga Alon, Manu Basavaraju, L. Sunil Chandran, Rogers Mathew, and Deepak RajendraprasadJournal of Graph Theory (2018) 2018JGT-SeparationDimensionAndSparsity.pdf (458.04 KB) Testing for forbidden order patterns in an array Ilan Newman, Yuri Rabinovich, Deepak Rajendraprasad, and Christian Sohler28th ACM-SIAM Symposium on Discrete Algorithms (SODA 2017) (2017) 2017SODA-PropertyTesting.pdf (396.59 KB) The induced separation dimension of a graph J\\'er\\'emie Dusart, Martin Charles Golumbic, Rogers Mathew, Deepak Rajendraprasad, and Emile ZiedanAlgorithmica 80 (10) 2834-2848 (2017) 2017Algorithmica-InducedSeparationDimension.pdf (151.32 KB) Track number of line graphsDeepak RajendraprasadJournal of Combinatorics (2017) 2017JoC-TrackNumberOfLineGraphs.pdf (213.45 KB) Address Indian Institute of Technology Palakkad Kanjikode | Palakkad Kerala | Pin: 678623 +91 491 209 2001 (Office) | +91 491 2092035 (Academic Section) netadmin@iitpkd.ac.in Copyright ©2023 Indian Institute of Technology Palakkad. All Rights Reserved.",
  "content_length": 7336,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:49"
}