{
  "name": "Dejan Kostic",
  "homepage": "https://www.kth.se/profile/dejanko",
  "status": "success",
  "content": "KTH | Dejan Kostic Skip to main content Dejan KosticProfessorKungliga Tekniska Högskolanhttps://www.kth.se/profile/dejankoDetailsWorks for Division of Software and Computer SystemsTelephone +46 8 790 42 65Unit address Lindstedtsvägen 30E-mail dmk@kth.seResearcherResearcher IDORCID IDGoogle Scholar IDAbout mePersonal home page: https://dejankosticgithub.github.io/index.html Dejan Kostic is a Professor of Internetworking at the KTH Royal Institute of Technology, where he is head of the Networked Systems Laboratory. He is also associated with the Connected Intelligence unit of RISE Research Institutes of Sweden. He is a also a member of the Wallenberg AI, Autonomous Systems and Software Program (WASP) faculty. His research interests include Distributed Systems, Computer Networks, Operating Systems, and Mobile Computing. Dejan Kostic obtained his Ph.D. in Computer Science at the Duke University. He spent the last two years of his studies and a brief stay as a postdoctoral scholar at the University of California, San Diego. He received his Master of Science degree in Computer Science from the University of Texas at Dallas, and his Bachelor of Science degree in Computer Engineering and Information Technology from the University of Belgrade (ETF), Serbia. From 2006 until 2012 he worked as a tenure-track Assistant Professor at the School of Computer and Communications Sciences at EPFL (Ecole Polytechnique Federale de Lausanne), Switzerland. In 2010, he received a European Research Council (ERC) Starting Investigator Award. From 2012 until June 2014, he worked at the IMDEA Networks Institute (Madrid, Spain) as a Research Associate Professor with tenure. He is a Professor of Internetworking at KTH since April 2014. In 2018, he received a European Research Council (ERC) Consolidator Award. In 2024, he was named a Wallenberg Scholar. CoursesAdvanced Topics in Networked Systems (FID3012), examiner, teacherCommunication System Design (IK2200), examiner, teacher, course responsibleDegree Project in Computer Engineering, First Cycle (II142X), examinerDegree Project in Computer Science and Engineering, specialising in Communication Systems, Second Cycle (DA246X), examinerDegree Project in Computer Science and Engineering, specialising in ICT Innovation, Second Cycle (DA258X), examinerDegree Project in Computer Science and Engineering, specialising in ICT Innovation, Second Cycle (DA256X), examinerDegree Project in Computer Science and Engineering, specializing in Software Engineering for Distributed Systems, Second Cycle (DA240X), examinerDegree Project in Electrical Engineering, specialising in ICT Innovation, Second Cycle (EA258X), examinerDegree Project in Electrical Engineering, specialising in ICT Innovation, Second Cycle (EA256X), examinerDegree Project in Electrical Engineering, specializing in Communication Systems, Second Cycle (EA246X), examinerDegree Project in Electronics and Computer Engineering, First Cycle (IL142X), examinerDegree Project in Information and Communication Technology, First Cycle (IA150X), examinerDegree Project in Information and Communication Technology, First Cycle (II143X), examinerDegree Project in Information and Communication Technology, Second Cycle (IA250X), examinerNetworked Systems for Machine Learning (FIK3221), teacher, course responsible, examinerSoftware Defined Networking (SDN) and Network Functions Virtualization (NFV) (FIK3619), examinerSoftware Defined Networking (SDN) and Network Functions Virtualization (NFV) (IK2220), examinerPublicationsPublication listLinksPersonal home page",
  "content_length": 3576,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:54"
}