{
  "name": "Dekai Wu",
  "homepage": "http://www.cs.ust.hk/~dekai",
  "status": "success",
  "content": "De Kai HLTC News Seminars About People Scholarships Publications Exits De Kai Professor of Computer Science and Engineering, HKUSTDistinguished Research Scholar, ICSI, BerkeleyIndependent Director, The Future Society Department of Computer Science and Engineering The Hong Kong University of Science & Technology HKUST, Clear Water Bay, Kowloon, Hong Kong tel +852 2358-6989 · fax +852 2358-1477 · room 3556 (lifts 25-30) lab +852 2358-8831 · room 2602 (lifts 27-30) dekai@cs.ust.hk · http://www.cs.ust.hk/~dekai COMING JUNE 3, 2025 from MIT Press / Penguin Random House Preorder at Amazon | Barnes & Noble | Target | Walmart | Hudson | Powell's | Books-A-Million | Bookshop Kirkus Reviews calls Raising AI a “deeply human dive into the AIs that are transforming our world” Raising AI tops The Next Big Idea Club’s must-read books Foreword Reviews says \"Raising AI is a compelling treatise grounded in studies of ethics and technology that charts a path toward greater understanding between biological and artificial intelligences.” I received my PhD in Computer Science from the University of California at Berkeley, and was a postdoctoral fellow at the University of Toronto (Ontario, Canada) prior to joining HKUST in its founding year in 1992. Other degrees include an Executive MBA from Kellogg (Northwestern University) and HKUST in 2002, and a BS in Computer Engineering from the University of California at San Diego (Revelle College departmental award, cum laude, Phi Beta Kappa) in 1984. I have been a visiting researcher at Columbia University in 1995-96, Bell Laboratories in 1995, and the Technische Universität München (Munich, Germany) during 1986-87. In December 2011, I was selected by the Association for Computational Linguistics as one of only 17 scientists worldwide to be awarded the honor of founding ACL Fellow, with a citation for \"significant contributions to machine translation and the development of inversion transduction grammar\" which pioneered the integration of syntactic and semantic models into statistical machine translation paradigms. I have served as Associate Editor of Computer Speech and Language, AI Journal, and ACM Transactions on Speech and Language Processing, and on the Editorial Boards of Computational Linguistics, Machine Translation, and Journal of Natural Language Engineering. I also served as Chair of IWSLT 2019, Area Co-Chair for ICLR 2020, ACL 2019, EMNLP 2016, NAACL HLT 2016, IJCAI 2015, ACL 2013, and IJCNLP 2013, Chair of IWSLT 2012, Co-Chair for EMNLP-2004, and the Organizing Committee of ACL-2000 and WVLC-5 (SIGDAT 1997), as well as the Executive Committee of the Association for Computational Linguistics (ACL). In 2007 I initiated the ongoing annual SSST workshop series on Syntax, Semantics, and Structure in Statistical Translation. South China Morning Post has a nice overview of my accomplishments, activities, and approaches. In 2015 Debrett's named me as one of the 100 most influential figures of Hong Kong, in the area of science. In 2019, Google named me as one of eight inaugural members of its AI Ethics council, ATEAC (Advanced Technology External Advisory Council). Research interests Artificial intelligence; human language and music technology; computational linguistics; natural language processing; machine translation; machine learning; neural networks; data science; cognitive models of human language and communication; multilingual computing; language modeling; speech recognition; language acquisition; dialog systems; information retrieval; knowledge management; evolution of language and music; computational musicology; computer music. For machine learning of the relationships between musical languages, we received the ICMC Best Presentation Award from the International Computer Music Association in 2015. For machine learning of the relationships between written and spoken languages, milestone successes pioneered by my statistical machine translation (SMT) research group include: the first unstructured SMT models on very different languages 1993— Chinese/English alignment 1994— Chinese/English statistical machine translation 1994— Chinese/English phrase/collocation translation learning the first syntactic and tree-structured SMT models 1995— inversion transduction grammar (ITG; any synchronous context-free grammar that is binary, ternary, or inverting) 1995— bracketing ITG (BTG or BITG) 1995— stochastic ITG parameter estimation (EM training) 1996— phrasal SMT (segmental ITG) 1997— projection of monolingual constraints (bilingual constraint transfer; coercion) 1998— SMT with lingustic ITG transduction rules 2005— comparable corpora mining BITG 2009— linear inversion transduction grammar (LITG) 2009— linear transduction grammar (LTG) 2011— preterminalized linear inversion transduction grammar (PLITG) 2012— rule chunking for unsupervised transduction grammar grammar induction 2013— rule segmentation for unsupervised transduction grammar grammar induction the first semantic SMT models 2005— word sense disambiguation for SMT (WSD for SMT) 2007— phrase sense disambiguation for SMT (PSD) 2007— semantic role labeling for SMT training (SRL for SMT) 2009— semantic role labeling for SMT decoding (SRL for SMT) 2013— training SMT against purely semantic frame based objective criteria (MEANT) the first semantic MT evaluation models 2010— human semantic MT evaluation with SRL-for-MTE (HMEANT) 2012— automatic semantic MT evaluation with SRL-for-MTE (MEANT) 2014— cross-lingual automatic semantic MT evaluation without human references (XMEANT) some of this is surveyed in my 2010 chapters \"Alignment\" in CRC Press' Handbook of Natural Language Processing \"Lexical Semantics for Statistical Machine Translation\" in DARPA's Handbook of Natural Language Processing and Machine Translation Our active research projects are internationally funded by the US DARPA BOLT, GALE, and LORELEI programs, the European Union EU-BRIDGE project, and the Hong Kong RGC. Human Language Technology Center (HLTC) Activities Collective Responsibility and Accountability in an AI Era - 10th Organization Artifacts and Practices Workshop (OAP 2020). Jun 2020, Berkeley. [Co-Chair] Eighth International Conference on Learning Representations (ICLR 2020). Apr 2020, Addis Ababa, Ethiopia. [Area Chair] 16th International Workshop on Spoken Language Translation (IWSLT 2019). Nov 2019, Hong Kong. [Workshop Chair] 56th Annual Meeting of the Association for Computational Linguistics (ACL 2018). Jul 2018, Melbourne, Australia. [Area Chair] 27th International Conference on Computational Linguistics (COLING 2018). Aug 2018, Santa Fe, New Mexico. [Area Chair] ACL 2018, 56th Annual Meeting of the Association for Computational Linguistics. Jul 2016, Melbourne, Australia. [Area Chair] IJCAI-16, 25th International Joint Conference on Artificial Intelligence. Jul 2016, New York. [Senior Program Committee] NAACL HLT 2016, 15th Annual Conference of the North American Chapter of the Association for Computational Linguistics. Jun 2016, San Diego, California. [Area Chair] IJCAI-15, 24th International Joint Conference on Artificial Intelligence. Jul 2015, Buenos Aires, Argentina. [Area Chair] SSST-9, Ninth Workshop on Syntax, Semantics and Structure in Statistical Translation (NAACL HLT 2015 Workshop), Jun 2015, Denver, Colorado SSST-8, Eighth Workshop on Syntax, Semantics and Structure in Statistical Translation (EMNLP 2014 Workshop), Oct 2014, Doha, Qatar 51st Annual Meeting of the Association for Computational Linguistics. Aug 2013, Sofia, Bulgaria. [Area Chair] 6th International Joint Conference on Natural Language Processing. Oct 2013, Nagoya, Japan. [Area Chair] SSST-7, Seventh Workshop on Syntax, Semantics and Structure in Statistical Translation (NAACL-HLT 2013 Workshop), Jun 2013, Atlanta, Georgia IWSLT 2012, International Workshop on Spoken Language Translation, 6-7 Dec 2012, Hong Kong SSST-6, Sixth Workshop on Syntax, Semantics and Structure in Statistical Translation (ACL 2012 Workshop), Jul 2012, Jeju, South Korea SSST-5, Fifth Workshop on Syntax, Semantics and Structure in Statistical Translation (ACL HLT 2011 Workshop), 23 Jun 2011, Portland, Oregon SSST-4, Fourth Workshop on Syntax and Structure in Statistical Translation (COLING 2010 Workshop), 28 Aug 2010, Beijing SSST-3, Third Workshop on Syntax and Structure in Statistical Translation (NAACL HLT 2009 Workshop), 5 Jun 2009, Boulder, Colorado SSST-2, Second Workshop on Syntax and Structure in Statistical Translation (ACL-08: HLT Workshop), 20 Jun 2008, Columbus, Ohio SSST-1, Syntax and Structure in Statistical Translation (NAACL-HLT 2007 Workshop), 26 Apr 2007, Rochester, New York CLSP Workshop 2005, Translation by Parsing, Jul-Aug 2005, Johns Hopkins University, Center for Language and Speech Processing EMNLP-2004, 2004 Conference on Empirical Methods in Natural Language Processing (at ACL-04), 25-26 Jul 2004, Barcelona, Spain ACL-2000, 38th Annual Meeting of the Association for Computational Linguistics, 1-8 Oct 2000, Hong Kong WVLC-5, Fifth Workshop on Very Large Corpora, 18/20 Aug 1997, Tsinghua/HKUST Teaching COMP5221 (Natural Language Processing), Spring 2025 COMP1944 (Artificial Intelligence Ethics), Spring 2025 COMP5221 (Natural Language Processing), Spring 2024 COMP1944 (Artificial Intelligence Ethics), Spring 2024 COMP4221 (Introduction to Natural Language Processing), Spring 2023 COMP1944 (Artificial Intelligence Ethics), Fall 2022 COMP1944 (Artificial Intelligence Ethics), Spring 2022 COMP1944 (Artificial Intelligence Ethics), Fall 2021 COMP4901M (Artificial Intelligence Ethics), Spring 2021 COMP4221 (Introduction to Natural Language Processing), Spring 2020 COMP4901M (Artificial Intelligence Ethics), Spring 2020 COMP4221 (Introduction to Natural Language Processing), Spring 2019 COMP3211 (Fundamentals of Artificial Intelligence), Spring 2019 COMP5221 (Natural Language Processing), Spring 2018 COMP4221 (Introduction to",
  "content_length": 194741,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:50"
}