{
  "name": "Delaram Jarchi",
  "homepage": "https://www.essex.ac.uk/people/jarch68309/delaram-jarchi",
  "status": "success",
  "content": "Delaram Jarchi | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Delaram Jarchi People Dr Delaram Jarchi Lecturer School of Computer Science and Electronic Engineering (CSEE) Email delaram.jarchi@essex.ac.uk Location 5B.534, Colchester Campus Academic support hours Thursday at 4pm, Office location: 1N1.3.2 Profile Teaching and supervision Publications Grants and funding Contact Profile Teaching and supervision Publications Grants and funding Contact Profile Biography Dr Delaram Jarchi is a Lecturer in AI and machine learning at CSEE. She received her PhD degree in Biomedical Engineering from University of Surrey in 2011. Following completion of the PhD study, she joined the Body Sensor Network group, at the Hamlyn Centre for Robotic Surgery, Imperial College London. Her research was on wearable sensors for gait analysis applications. Before starting an academic position, she was part of the Computational Health Informatics Lab at University of Oxford and a research member of Wolfson College Oxford. Her research on accelerometry based analysis of respiratory rate has been filed as a patent application with Oxford University Innovation Ltd and licensed. Her recent research is focused on designing new algorithms and validation of commercial wearable sensors for robust estimation of physiological parameters such as heart rate, respiratory rate and blood oxygen saturation level in very unobtrusive ways. The objective of her research is to develop the next generation of smart wearables suitable for use in clinical settings. Her research is published in various IEEE journals. She is a senior member of IEEE and was an associate member of the Bio Imaging and Signal Processing (BISP) technical committee, IEEE Signal Processing Society. She is an active reviewer for various conferences and journals such as ICASSP, IEEE-JBHI (one of the 2014 best reviewers) and Sensors. She is the second author of the Body Sensor Networks & Algorithm Design book; an imprint of John Wiley & Sons Ltd published in 2020. She is a panel member of Royal Society International Exchanges committee, Editorial board member of Scientific Reports journal, Nature (guest editor for remote health monitoring), Associate editor of IEEE Transactions on neural systems and rehabilitation engineering (TNSRE) and chair of member benefit subcommittee of membership development committee, IEEE Signal Processing Society and Associate editor for EMBC2022 and EMBC2023. If you are interested to join the group for a PhD degree, please contact Dr Delaram Jarchi delaram.jarchi@essex.ac.uk, Qualifications PhD University of Surrey, Appointments University of Essex Lecturer, Computer Science and Electronics, University of Essex (1/5/2019 - present) Other academic Lecturer, Computing, University of Kent (1/8/2018 - 30/4/2019) Postdoctoral Researcher, Engineering Science, University of Oxford (16/10/2016 - 31/7/2018) Senior Research Associate, Electrical and Electronic Engineering, University of Bristol (11/7/2016 - 14/10/2016) Research Associate, Electrical and Electronic Engineering, University of Manchester (29/6/2015 - 28/6/2016) Research Associate, Imperial College London (7/9/2011 - 26/6/2015) Teaching and supervision Current teaching responsibilities Introduction to Programming (CE151) Machine Learning (CE802) Current supervision Thanh Dat Ngo Thesis title: Novel Low-Cost and Artificial Intelligence Driven Audio Signal Processing for Respiratory Monitoring and Rehabilitation Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Konstantinos Vasios Thesis title: Bridging the Simulation to Reality Gap in Robotics Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 21/2/2025 Publications Publications (2) Ngo, D., Pham, L., Phan, H., Tran, M., Jarchi, D. and Kolozali, S., (2023). An Inception-Residual-Based Architecture with Multi-Objective Loss for Detecting Respiratory Anomalies Ngo, D., Pham, L., Phan, H., Tran, M. and Jarchi, D., (2023). A Deep Learning Architecture with Spatio-Temporal Focusing for Detecting Respiratory Anomalies Journal articles (27) Sanei, S., Lee, TKM., Boukhennoufa, I., Jarchi, D., Zhai, X. and McDonald-Maier, K., (2025). Evaluating the Effect of Surrogate Data Generation on Healthcare Data Assessment. Big Data and Cognitive Computing. 9 (2), 22-22 Rostamian, A., O’Hara, J. and Jarchi, D., (2025). Deep Learning-based VVIX Forecasting with Time Series Image Encoding and Hybrid ResNet-LSTM Model. Computational Economics Singh, S., Anisi, MH., Jindal, A. and Jarchi, D., (2024). Smart Multimodal In-Bed Pose Estimation Framework Incorporating Generative Adversarial Neural Network. IEEE Journal of Biomedical and Health Informatics. 28 (6), 3379-3388 Boukhennoufa, I., Jarchi, D., Zhai, X., Utti, V., Sanei, S., Lee, TKM., Jackson, J. and McDonald-Maier, KD., (2023). A novel model to generate heterogeneous and realistic time-series data for post-stroke rehabilitation assessment. IEEE Transactions on Neural Systems and Rehabilitation Engineering. 31, 2676-2687 Andreu-Perez, J., Perez-Espinosa, H., Timonet, E., Kiani, M., Giron-Perez, MI., Benitez-Trinidad, AB., Jarchi, D., Rosales, A., Gkatzoulis, N., Reyes-Galaviz, OF., Torres, A., Alberto Reyes-Garcia, C., Ali, Z. and Rivas, F., (2022). A Generic Deep Learning Based Cough Analysis System from Clinically Validated Samples for Point-of-Need Covid-19 Test and Severity Levels. IEEE Transactions on Services Computing. 15 (3), 1220-1232 Procházka, A., Charvátová, H., Vyšata, O., Jarchi, D. and Sanei, S., (2021). Discrimination of cycling patterns using accelerometric data and deep learning techniques. Neural Computing and Applications. 33 (13), 7603-7613 Jalali-najafabadi, F., Gadepalli, C., Jarchi, D. and Cheetham, BMG., (2021). Acoustic analysis and digital signal processing for the assessment of voice quality. Biomedical Signal Processing and Control. 70, 103018-103018 Jarchi, D., Kaler, J. and Sanei, S., (2021). Lameness Detection in Cows Using Hierarchical Deep Learning and Synchrosqueezed Wavelet Transform. IEEE Sensors Journal. 21 (7), 9349-9358 Jarchi, D., Andreu-Perez, J., Kiani, M., Vysata, O., Kuchynka, J., Prochazka, A. and Sanei, S., (2020). Recognition of Patient Groups with Sleep Related Disorders using Bio-signal Processing and Deep Learning. Sensors. 20 (9), 2594-2594 Jarchi, D., Charlton, P., Pimentel, M., Casson, A., Tarassenko, L. and Clifton, DA., (2019). Estimation of respiratory rate from motion contaminated photoplethysmography signals incorporating accelerometry. Healthcare Technology Letters. 6 (1), 19-26 Lee, R., Jarchi, D., Perera, R., Jones, A., Cassimjee, I., Handa, A., Clifton, DA., Bellamkonda, K., Woodgate, F., Killough, N., Maistry, N., Chandrashekar, A., Darby, CR., Halliday, A., Hands, LJ., Lintott, P., Magee, TR., Northeast, A., Perkins, J. and Sideso, E., (2018). Applied Machine Learning for the Prediction of Growth of Abdominal Aortic Aneurysm in Humans. EJVES Short Reports. 39, 24-28 Jarchi, D., Pope, J., Lee, TKM., Tamjidi, L., Mirzaei, A. and Sanei, S., (2018). A Review on Accelerometry-Based Gait Analysis and Emerging Clinical Applications. IEEE Reviews in Biomedical Engineering. 11, 177-194 Jarchi, D., Salvi, D., Tarassenko, L. and Clifton, D., (2018). Validation of Instantaneous Respiratory Rate Using Reflectance PPG from Different Body Positions. Sensors. 18 (11), 3705-3705 Jarchi, D., Rodgers, SJ., Tarassenko, L. and Clifton, DA., (2018). Accelerometry-Based Estimation of Respiratory Rate for Post-Intensive Care Patient Monitoring. IEEE Sensors Journal. 18 (12), 4981-4989 Jarchi, D. and Casson, AJ., (2017). Towards Photoplethysmography-Based Estimation of Instantaneous Heart Rate During Physical Activity. IEEE Transactions on Biomedical Engineering. 64 (9), 2042-2053 Monajemi, S., Jarchi, D., Ong, S-H. and Sanei, S., (2017). Cooperative Particle Filtering for Tracking ERP Subcomponents from Multichannel EEG. Entropy. 19 (5), 199-199 Crewther, BT., Shetty, K., Jarchi, D., Selvadurai, S., Cook, CJ., Leff, DR., Darzi, A. and Yang, G-Z., (2016). Skill acquisition and stress adaptations following laparoscopic surgery training and detraining in novice surgeons. Surgical Endoscopy. 30 (7), 2961-2968 Jarchi, D., Lo, B., Wong, C., Ieong, E., Nathwani, D. and Yang, G-Z., (2016). Gait Analysis From a Single Ear-Worn Sensor: Reliability and Clinical Evaluation for Orthopaedic Patients. IEEE Transactions on Neural Systems and Rehabilitation Engineering. 24 (8), 882-892 Casson, AJ., Vazquez Galvez, A. and Jarchi, D., (2016). Gyroscope vs. accelerometer measurements of motion from wrist PPG during physical exercise. ICT Express. 2 (4), 175-179 Jarchi, D. and Casson, A., (2016). Description of a Database Containing Wrist PPG Signals Recorded during Physical Exercise with Both Accelerometer and Gyroscope Measures of Motion. Data. 2 (1), 1-1 Kwasnicki, RM., Hettiaratchy, S., Jarchi, D., Nightingale, C., Wordsworth, M., Simmons, J., Yang, G-Z. and Darzi, A., (2",
  "content_length": 20279,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:50"
}