{
  "name": "Delphine Christin",
  "homepage": "https://www.uni-goettingen.de/de/prof.+dr.-ing.+delphine+reinhardt/581924.html",
  "status": "success",
  "content": "Prof. Dr.-Ing. Delphine Reinhardt - Georg-August-Universität Göttingen ✖ Suchbegriff Mit Google™ suchen Interne Suche nutzen (eingeschränkte Ergebnisqualität) Start Team Forschung Projekte Publikationen Lehre Stellen & Thesen Veranstaltungen Kontakt Menü Menü Suchbegriff Suchbegriff Mit Google™ suchen Interne Suche nutzen (eingeschränkte Ergebnisqualität). Suche starten Mit der Nutzung der Google™ Suche stimmen Sie den Datenschutzbestimmungen von Google™ zu Auf der Suche nach Personen, Veranstaltungen oder Räumen ? Zum eCampus Schließen Prof. Dr.-Ing. Delphine Reinhardt BiographieProf. Dr.-Ing. Delphine Reinhardt ist W3-Professorin und leitet seit 2018 die Forschungsgruppe „Computersicherheit und Privatheit“ an der Georg-August-Universität in Göttingen. Sie war Dekanatsmitglied der Fakultät für Mathematik und Informatik und geschäftsführende Direktorin des Instituts für Informatik zwischen 2023 und 2025. Im Winter Semester 2023/2024 war sie Gastprofessorin an der School of Computer Science and Engineering der University of New South Wales in Sydney, Australien, sowie an der School of Computing and Information Systems an der Singapore Management University, Singapore. Seit 2021 ist sie IEEE Senior Member. In 2019 wurde sie zu einer der 10 weltweiten \"Rising Stars in Networking and Communications\" durch N2Women ernannt und wurde mit dem Johann-Philipp-Reis-Preis für herausragende innovative Veröffentlichungen zum Schutz unserer Privatsphäre beim Umgang mit digitalen Medien ausgezeichnet. Von 2014 bis 2017 war sie Junior-Professorin für praxisnahe Informatik und IT-Sicherheit an der Rheinischen Friedrich-Wilhelms-Universität in Bonn und leitete die Gruppen „Privatheit und Sicherheit in Ubiquitous Computing“ an der Universität sowie bei Fraunhofer FKIE in Wachtberg. Sie absolvierte ihre Promotion mit Auszeichnung an der Technischen Universität Darmstadt in 2013. Ihre Dissertation über den nutzerkontrollierten Datenschutz bei mobilen Datenerfassungssystemen wurde von der GI/ITG-Fachgruppe Kommunikation und Verteilte Systeme (KuVS), der Informationstechnischen Gesellschaft im VDE (ITG), und der Vereinigung von Freunden der Technischen Universität zu Darmstadt für herausragende akademische Leistungen ausgezeichnet. Bevor sie zur Informatik für Ihre Promotion wechselte erwarb sie einen doppelten Abschluss in Elektrotechnik an der TU Darmstadt und der Ecole Nationale Supérieure de l'Electronique et ses Applications in Frankreich in 2009. Kontakt Goldschmidtstr. 7 (Raum 1.114) 37077 Göttingen, Deutschland Tel. +49 551 39-26045 Fax +49 551 39-18172000 Email Sprechzeiten nach Terminvereinbarung über Email",
  "content_length": 2640,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:52"
}