{
  "name": "Demetris Trihinas",
  "homepage": "https://www.unic.ac.cy/trihinas-demetris",
  "status": "success",
  "content": "Dr Demetris Trihinas - University of Nicosia Skip to content APPLY Dr Demetris Trihinas Dr Demetris Trihinas Assistant Professor School of Sciences and Engineering, Department of Computer Science 22841792 [email protected] Central Building, 1st Floor, B114 Brief CV Research Profile https://orcid.org/0000-0002-9540-7342 Google Scholar Dr Demetris Trihinas is currently a Faculty Member at the University of Nicosia. Previously, he was a Postdoctoral Fellow and member of the Visiting Teaching Staff at the Computer Science Department, University of Cyprus. His research interests include Distributed and Internet Computing with particular focus in Big Data Analytics for Cloud and Edge Computing. His PhD dissertation targeted developing low-cost probabilistic and adaptive learning models for approximate monitoring in order to improve energy-efficiency and reduce both the volume and velocity of data generated and consumed by IoT services offered through the cloud. For the research conducted during his doctoral studies, he was selected by the Heidelberg Laureate Forum as one of the 100 young promising researchers in Computer Science for 2015. He additionally holds a Computer Science MSc from the University of Cyprus and a Dipl-Ing in Electrical and Computer Engineering from the National Technical University of Athens (NTUA). Dr Trihinas has extensive experience in European research and innovation projects where he has participated as a Work Package Leader and Senior Researcher in multiple projects (e.g., Unicorn H2020, PaaSport FP7, CELAR FP7) funded under the European Commission FP7 and H2020 schemes. Additionally, he is the developer of the JCatascopia cloud monitoring system, the AdaM framework for IoT devices and also an active member of the Cloud Application Management Framework (CAMF) which is an official Eclipse Foundation project. His work is published in IEEE/ACM journals and conferences such as Trans. Services Computing (TSC), Trans. Cloud Computing (TCC), ICDCS, INFOCOM, BigData, CCGrid, and ICSOC. UNIC NICOSIA46 Makedonitissas Avenue, CY-2417P.O. Box 24005, CY-1700Nicosia, CyprusPhone.: +357 22 841500Email: [email protected] UNIC ATHENSNo. 17, 29th StreetElliniko 167 77Athens, GreecePhone:  +30 210 6748293Email: [email protected] USEFUL LINKSAll Academic ProgrammesUNIC Brand CentreUNIC in the NewsVerify a CertificateCareers at UNIC CONNECT WITH UNICSubscribe to NewslettersCopyright © University of Nicosia. All Rights Reserved | Privacy Policy | Terms & Conditions Page load link Live chat is available. Activate it by agreeing to the use of marketing cookies here. Please refresh the page after activation. × Go to Top",
  "content_length": 2664,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:59"
}