{
  "name": "Dengji Zhao",
  "homepage": "http://dengji-zhao.net",
  "status": "success",
  "content": "Dengji Zhao/èµµç»å Dengji Zhao (èµµç»å) Associate Professor (Tenured)ï¼åå¯¼ï¼ç ç©¶å School of Information Science and Technology ShanghaiTech University Shanghai, China Email: zhaodj at shanghaitech dot edu dot cn The ShanghaiTech Multi-Agent systems Research Team (SMART) Short Bio (full resume, ä¸­æç): Born in China, B.Sc. from Macau (2006), Double M.Sc. from Germany & Spain (2009), Double PhD from Australia & France (2012), Postdoc working with Makoto Yokoo (Kyushu, Japan) (2013 - 2014) and Research Fellow working with Nick Jennings (Imperial, UK) (2014 - 2017), Assistant Professor (2017/01 - 2023/01), then Associate Professor (2023/02 - ) at ShanghaiTech (Shanghai, China) and lead The ShanghaiTech Multi-Agent systems Research Team (SMART). Zhao was elected as a member of the IFAAMAS Board of Directors (the chair of the sponsorship committee) in 2022, the first representative from a Chinese institution since IFAAMAS was founded in 2002. He is an Associate Editor of JAAMAS. He is a senior member of IEEE and the China Computer Federation (CCF). He was program/track co-chair of DAI 2021, Workshop Track of PRICAI 2021, Competitions Track of IJCAI 2022, Demo and Competitons Track of AAMAS 2023, and Survey Track of IJCAI 2024. He is a local co-chair of WINE 2023. He was invited to give an Early Career Spotlight talk at IJCAI-ECAI 2022. He received the Best Paper awards from AAMAS 2024, PRIMA 2022, DAI 2022 and AI 2010. News: [Active] I am currently hiring Post-docs/Reserach Assistants working on Algorithmic Game Theory at ShanghaiTech University. Please contact me directly if you are interested in. [2025-01-16] My course of \"Algorithms and Date Structures\" received the First Class Course from Shanghai Municipal Education Commission. [2024-12-03] I am going to give a senior member presentation with a Blue Sky Ideas paper titled \"Incentives for Early Arrival\" at AAAI 2025 Senior Member Presentation Track (the talk, the paper). [2024-05-09] Our paper \"Incentives for Early Arrival in Cooperative Games\" has received the only Best Paper Award among over 1000 submissions at AAMAS 2024 (the reviews, the talk slides). [2024-02-01] I'm glad to join the editorial board of the Journal of Autonomous Agents and Multi-Agent Systems. [2023-08-22] I received the Distinguished SPC Award from IJCAI 2023. [2023-08-21] I'm evaluated as an IEEE Senior member. [2023-06-07] The Call for Papers of WINE 2023 is out, the submission deadline is 7 July 2023. [2023-02-03] I'm tenured to Associate Professor. [2023-01-29] My course of \"Introduction to Algorithmic Game Theory\" received the First Class Course from Shanghai Municipal Education Commission. [2023-01-12] I received the Outstanding Teaching Award from SIST, ShanghaiTech in 2022. [2023-01-04] Five papers (4 full and 1 abstract) were accepted at AAMAS 2023. [2022-12-16] Our paper \"Maximal Information Propagation with Limited Resources\" recevied the the Best Paper Honorable Mention at DAI 2022. [2022-11-18] Our paper âTask Allocation on Networks with Execution Uncertaintyâ received the Best Paper Award at PRIMA 2022. [2022-04-26] I was invited to give an Early Career Spotlight talk at IJCAI-ECAI 2022 (the talk: 15mins or 1.5mins, the paper). [2022-04-22] I was elected as a member of IFAAMAS Board of Directors, the first representative from a Chinese institution since IFAAMAS was founded in 2002. [2021-12-19] Our paper \"Incentives to Invite Others to Form Larger Coalitions\" has been accepted at AAMAS-2022, which was the very first work considering invitation incentives in coalitional games. [2021-11-19] Our paper \"Diffusion Auction Design\" is online at The Journal of Artificial Intelligence (AIJ), summarizing our first set of solutions for auction design on networks. [2021-09-29] I have given a tutorial \"New Trends in Mechanism Design for Considering Participants' Interactions\" at AAAI 2022 (The talk recording is here). [2021-01-25] Our paper \"Mechanism Design Powered by Social Interactions\" (the talk) has been accepted at AAMAS'2021 Blue Sky Ideas Track, which is for the first time an author from China alone published articles in this track. [2021-01-08] I have been awarded the Outstanding Research Service Award from SIST, ShanghaiTech in 2020. News in Chinese: [2025-01-27] ä¿¡æ¯å­¦é¢èµµç»åè¯¾é¢ç»åè¡¨å¨çº¿åä½åå¼ç­æ¹åææ°ç ç©¶ææ [2024-06-07] ç¥è´ºï¼ä¿¡æ¯å­¦é¢èµµç»åç»æ©è·AAMAS 2024å¯ä¸æä½³è®ºæå¥ [2023-02-07] åè®¯ï¼ä¸ç§å¤§4é¨è¯¾ç¨å ¥éä¸æµ·é«ç­å­¦æ ¡ä¸æµæ¬ç§è¯¾ç¨ [2023-01-28] ä¿¡æ¯å­¦é¢èµµç»åè¯¾é¢ç»å¨å¤æºè½ä½ç³»ç»é¢ååå¾å¤é¡¹éè¦ææ [2022-11-09] åæ¥! ä¸æµ·å¸ä¼ç§æå­¦ææå¥+5 [2022-03-02] å¢å äºæ°éè·¯ï¼äº¤éåèæ´æ¥å µï¼ââä»åå¼è®ºè§è§å¦ä½çï¼ [2022-02-13] å¨æ«LABè¡ | SMARTå®éªå®¤åä½ ååºäºèå¹´éç¦éè¯·~ [2021-08-11] ä¿¡æ¯å­¦é¢èµµç»åè¯¾é¢ç»å¨ç¬¬å ­å±ä¸çåå¼è®ºå­¦ä¼å¤§ä¼åäº«éè¦ææ [2021-08-02] æ¯ä¸çè¯´|å¼ é¯ï¼å¡æµæ³ªæ­ç§ï¼å¿ æ¬¢åæ¶å² [2021-03-01] ä¿¡æ¯å­¦é¢èµµç»åè¯¾é¢ç»å¨åºäºç¤¾äº¤ç½ç»çæ°å­ç»æµæºå¶ç ç©¶ä¸­åå¾éå¤§çªç ´ [2020-01-22] ä¿¡æ¯å­¦é¢èµµç»åè¯¾é¢ç»å¤ç¯è®ºæè¢«å½é äººå·¥æºè½é¢åé¡¶çº§ä¼è®®AAMASãECAIå½ç¨ [2019-12-08] ä¸æµ·ç§æå¤§å­¦-æº¢è¾¾éå¢èåå®éªå®¤æ­ç Research: Most of Zhaoâs research is on algorithmic game theory and multi-agent systems, especially mechanism design and its applications on social networks. He pioneered and promoted a new trend of mechanism design on social networks since 2016, namely how to incentivize the existing participants of a game to invite new participants via their social connections. For this research challenge, Zhaoâs group have made several seminal contributions in auctions, coalitional games and matching with over 30 high-quality papers. He has also contributed a blue sky paper at AAMAS 2021 to set up the related research agenda and offered four tutorials at AAAI 2022, AAMAS 2019 and IJCAI 2017/2018. His team also pioneered the study of \"Incentives for Early Arrival in Cooperative Games\" since 2023, which is a new property proposed for online cooperative games (including cost sharing). The first result on this (Incentives for Early Arrival in Cooperative Games) has received the only Best Paper Award at AAMAS 2024. He was invited to give an Early Career Spotlight talk at IJCAI-ECAI 2022. He received the Best Paper awards from AAMAS 2024, PRIMA 2022, DAI 2022 and AI 2010. Tutorials: Dengji Zhao: New Trends in Mechanism Design for Considering Participants' Interactions (The talk recording is here). AAAI-2022, Vancouver, BC, Canada. Dengji Zhao: Mechanism Design Powered by Social Interactions. IJCAI-2019, Macau. Umberto Grandi and Dengji Zhao: Social Choice and Mechanism Design on Social Networks. AAMAS-2019, Montreal. Dengji Zhao: Diffusion Mechanism Design in Social Networks. PRICAI-2018, Nanjing. Dengji Zhao: Diffusion Mechanism Design in Social Networks. IJCAI-ECAI-2018, Stockholm. Teaching: Introduction to Algorithmic Game Theory, Postgraduate Course. Algorithms and Data Structures, Undergraduate Course. Academic Services: Program (Co-)Chair IJCAI 2024 Survey Track Co-Chair WINE 2023 Local Co-Chair ECAI 2023 Area Chair AAMAS 2023 Demonstration/Competition Co-Chair PRICAI 2022 Sponsorship Chair IJCAI 2022 Competitions & Challenges Co-Chair DAI 2021 Program Co-Chair PRICAI 2021 Workshop Chair IJCAI-PRICAI 2020 Workshop on Applied Mechanism Design (WAMD) IJCAI-PRICAI 2020 Workshop on AI for Connected Mobility (AICoMo) IJCAI-15 Workshop on Innovative Applications of Game Theory and Market Design Program Committee AAAI: 2024(SPC), 2023(SPC), 2022(SPC), 2021, 2020, 2019, 2017, 2016; AAMAS: 2024, 2023, 2022, 2021(SPC), 2019, 2018, 2017, 2015, 2014, 2013; IJCAI: 2024(SPC), 2023(SPC), 2022, 2021(SPC), 2019, 2018, 2017, 2016, 2015, 2013; ECAI: 2024, 2023(AC), 2020(SPC); EC: 2024, 2023; WINE: 2023(SPC), 2022; PRIMA: 2022, 2018(SPC); PRICAI: 2022, 2018; AMEC-TADA: 2017, 2016, 2015, 2014, 2013; IAT/WI: 2018, 2017, 2015; AJCAI: 2022, 2015 Publications (my DBLP for the full list): *some reviews and presentation slides are included* Yaoxin Ge, Yao Zhang, Dengji Zhao, Zhihao Gavin Tang, Hu Fu, Pinyan Lu: Incentives for Early Arrival in Cooperative Games (Reviews, Slides) AAMAS 2024. (The Best Paper Award) Dengji Zhao: Mechanism Design Powered by Social Interactions: A Call to Arms (Early Career Spotlight Track). IJCAI-ECAI 2022. Yao Zhang, Dengji Zhao: Incentives to Invite Others to Form Larger Coalitions (Reviews). AAMAS 2022. Xiuzhen Zhang, Yao Zhang, Dengji Zhao: Task Allocation on Networks with Execution Uncertainty (Slides) PRIMA 2022. (The Best Paper Award) Bin Li, Dong Hao, Dengji Zhao: Diffusion Auction Design. Artificial Intelligence, Nov 2021. Dengji Zhao: Mechanism Design Powered by Social Interactions (Reviews, Talk, Slides). AAMAS 2021 Blue Sky Ideas Track. Yao Zhang, Dengji Zhao: Revenue Maximization in Diffusion Auctions. GAMES 2020/21. Xiuzhen Zhang, Yao Zhang, Dengji Zhao: Incentive Compatible Mechanism for Influential Agent Selection (Reviews). SAGT 2021. Tianyi Zhang, Dengji Zhao, Wen Zhang, Xuming He: Fixed-Price Diffusion Mechanism Design. PRICAI 2021. Xinyuan Lian, Dengji Zhao: A Network-based Rating Mechanism Against False-Name Attack. The 2021 Australasian Joint Conference on Artificial Intelligence. Bin Li, Dong Hao, Dengji Zhao: Incentive-Compatible Diffusion Auctions. IJCAI 2020. Yao Zhang, Xiuzhen Zhang, Dengji Zhao: Sybil-proof Answer Querying Mechanism (Reviews). IJCAI 2020. Dengji Zhao, Yiqing Huang, Liat Cohen, Tal Grinshpoun: Coalitional Games with Stochastic Characteristic Functions Defined by Private Types. AAMAS 2020 (Extended Abstract). Wen Zhang, Yao Zhang, Dengji Zhao: Crowdsourcing Data Acquisition via Social Networks. AAMAS 2020. Wen Zhang, Dengji Zhao, Hanyu Chen: Redistribution Mechanism Design on Networks. AAMAS 2020. Wen Zhang, Dengji Zhao, Yao Zhang: Incentivize Diffus",
  "content_length": 15103,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:56"
}