{
  "name": "Denis Zampuniéris",
  "homepage": "http://wwwen.uni.lu/fstc/organigramme/membres2/denis_zampunieris",
  "status": "success",
  "content": "Home - University of Luxembourg University 28 November 2025 “We have managed to establish a strong, research-intensive university in a short time” The external Research Evaluation 2024/2025 of the University concluded with a panel of independent experts affirming that Uni.lu fared remarkably well in its research performance. Vice-rector for Research Prof. Simone Niclou on the main take-aways. Read more Life on Campus 25 november 2025 Orange Week @Uni.lu: join the film screening “Breathing underwater” In honour of Orange Week, the University’s Gender equality office organises a screening of Eric Lamhène’s movie “Breathing underwater” (Hors d’haleine), a character-driven drama set in the world of a women’s shelter. Read more Awards & Rankings 20 November 2025 Uni.lu ranked for the first time in Interdisciplinary Science Rankings The University of Luxembourg has been ranked for the first time in the Times Higher Education Interdisciplinary Science Rankings, scoring 147th out of 911 universities from 94 countries or territories and 26th in Europe. Read more Research 17 November 2025 Combating human trafficking in the digital era The grim landscape of criminal offences against human rights has rapidly evolved with digital technologies facilitating surveillance, exploitation or trafficking. Dr Salomé Lannier, specialising in criminology and law, reviews challenges around workers’ exploitation and her research to support authorities and NGO’s to prevent and repress it. Read more Studying at our University Studying at the University of Luxembourg is a uniquely enriching experience. The programmes impart cutting-edge knowledge in a highly international, multilingual and distinctly interdisciplinary environment. Small classes ensure direct interaction between students and teaching staff. The application period for the 2025-2026 academic year is now closed. Updated details about our study programmes and the application process for the 2026–2027 academic year will be published soon. Admissions Find your study programme Bachelor’s and master’s programmes Take a look at our range of degrees Doctoral schools Find out more about our doctoral programmes Specialised studies diplomas Our training offers for future medical specialists Continuing education Find out about vocational training & lifelong learning opportunities Latest news Access to information in the digital age: the Luxembourg case study Research 25 November 2025 Learn more “Space lawyer is the perfect icebreaker” Outreach 24 November 2025 Law, Space Learn more European Public Schools: flexible language offer bears its first fruits Press Releases 19 November 2025 Education & Social Work Learn more Neurology and physics Uni.lu professors selected in Highly Cited Researchers 2025 Awards & Rankings 14 November 2025 Life Sciences & Medicine, Physics & Materials Science Learn more Potential collaborations to focus on digital space infrastructures, space robotics, and space law Research 12 November 2025 Computer Science & ICT, Engineering, Law, Space Learn more From researcher to CEO: How one founder learned to stop coding and run a company Research 10 November 2025 Autonomous Systems, Computer Science & ICT Learn more All news Events Discover our research Research at the University Shaping a digital, healthy and sustainable future The University of Luxembourg is a world-class research university. It strives for excellence in both fundamental and applied research, and in education. It drives innovation for society, has a high proportion of graduate students, and combines research, teaching and societal impact. Key areas Open positions 2025 is the International Year of Quantum Science and Technology Discover our quantum initiatives Stay connected and subscribe to our newsletter All fields are mandatory Choose among our mailing list(s) Mailing list 0 items selected University of Luxembourg – News and events Enter your email address Example: contact@uni.lu Please provide a valid email address. Example: jean.dupont@gmail.com I agree to the use of my email address in the context of subscribing to the University of Luxembourg’s newsletters. I am aware that I can unsubscribe or update my profile by clicking the unsubscribe or update profile link in the email communication. More information about data processing. Subscribe now To the top",
  "content_length": 4348,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:08"
}