{
  "name": "Denis Parra",
  "homepage": "https://dparra.sitios.ing.uc.cl",
  "status": "success",
  "content": "Denis Parra at PUC Chile Hi! I am Denis, Associate Professor at the Department of Computer Science, in the School of Engineering at PUC Chile. I am also affiliated to three centers of research excellence in Chile: i-Health, CENIA, and IMFD. I am principal researcher at the Millenium Institute for Intelligent Healthcare Engineering (iHealth), as well as associate researcher at the National Center for Artificial Intelligence (CENIA). I am also adjunct researcher at the Millennium Institute for Research on Fundamentals of Data (IMFD). I hold a professional title of Civil Engineer in Informatics, class of 2004 from UACh, Valdivia, Chile; and a Ph.D. in Information Science from University of Pittsburgh, USA, where I was supervised by Professor Peter Brusilovsky. I earned a Fulbright scholarship to pursue my PhD studies between 2008-2013. My research interests are Recommender Systems, Intelligent User Interfaces, Applications of Machine Learning (Medical Imaging, Creative AI) and Information Visualization and I am currently leading the Human-centered AI and Visualization (HAIVis) research group as well as co-leading the CreativAI Lab with professor Rodrigo Cádiz. I am also Faculty member of the PUC IA Lab. If you are interested on these topics and want to work under my supervision as Master or PhD student, send me an e-mail to denis.parra[at]uc[dot]cl. Selected Projects Automatic Radiology Report Generation from Chest X-rays Pino et al, MICCAI 2021, Clinically Correct Report Generation from Chest X-Rays Using Templates Messina et al, MedNeurips 2022, Two-stage Conditional Chest X-ray Radiology Report Generation CNN-TRG [conf] CRG [conf] A Survey on Deep Learning for Automatic Generation of Radiological Reports (*for a pre-print of this article, check this ArXiv link) Slides: Evaluation of radiological report generation [pdf] Slides: Visual, language and mutimodal models for radiological report generation [pdf] Intelligent User Interfaces for Recommendation Systems TalkExplorer [conf][journal][demo] SetFusion [conf][journal][video] [slides] Moodplay [conf] [video] A Survey on Interactive Recommender Systems *for pre-prints of these articles, check my publications page News August 2024 Attending ACL 2024 conference in Bangkok, Thailand. We are presenting one Findings paper \"Extracting and Encoding: Leveraging Large Language Models and Medical Knowledge to Enhance Radiological Text Representation\" [link] and two papers in the BioNLP workshop about radiological report generation led by Oscar Loch and Diego Campanini. July 2024 Attending the ICML 2024 conference in Vienna, Austria. We are presenting the article \"On the Unexpected Effectiveness of Reinforcement Learning for Sequential Recommendation\"[paper][ppt], with first author MSc student Alvaro Labarca and in collaboration with colleague Rodrigo Toro. March 2024 I am one of the three Program Chairs at the [ACM IUI conference (along Dorota Glowaka and Ofra Amir), which takes place in Greenville, SC, USA this year. April 2023-September 2023 On sabbatical leave, I'm spending these 6 months at KU Leuven in Belgium researching on XAI and text report generation from medical images. November 2022 I am attending Neurips conference, where Pablo Messina, the PhD student I co-supervise at PUC Chile with my colleague Alvaro Soto, will present his article on conditional report generation from medical images at the MedNeurips Workshop. September 2022 Invited talk as keynote speaker at IntRS workshop co-located at RecSys 2022. ...older news Latest Publications Messina, P., Vidal, R., Parra, D., Soto, Á., & Araujo, V. (2024). Extracting and Encoding: Leveraging Large Language Models and Medical Knowledge to Enhance Radiological Text Representation. In Findings of the Association for Computational Linguistics ACL 2024 (pp. 3955-3986) [link]. Labarca-Silva, Á., Parra, D., & Icarte, R. T. (2024) On the Unexpected Effectiveness of Reinforcement Learning for Sequential Recommendation. In Forty-first International Conference on Machine Learning ICML 2024 [link]. Garretón, M., Morini, F., Celhay, P., Dörk, M., & Parra, D. (2023). Attitudinal effects of data visualizations and illustrations in data stories. IEEE Transactions on Visualization and Computer Graphics [link]. ...more publications Students PhD Pablo Messina (co-advised with Prof. Alvaro Soto): Grounded VQA and Radiology Report Generation Ivania Donoso (co-advised with Prof. Katrien Verbert, KU Leuven): HCAI for explainable medical AI Oscar Loch: Long-tail image diagnosis MSc Jorge Facuse: SSL to improve classification of Prostate Cancer MRIs Gregory Schuit: generative models of chest X-rays Alfredo Mahns: RL for music generation Francisco Madariaga: VL models for radiology report generation Pedro Palma (co-advised with Prof. Rodrigo Toro): RL Recommender Systems Alumni Manuela Garretón, PhD (now Prof. at School of Design, UC Chile) Andrés Carvallo, PhD (now at CENIA) José Miguel Herrera, PhD (now at Pangeanic) Manuel Cartagena, MSc Pablo Pino, MSc (now at iHealth) Daniela Flores, MSc Isidora Palma, MSc Tamara Covacevich, MSc Antonio Ossa, MSc (co-advised with Prof. Hans Lobel) Pablo Messina, MSc (now PhD student UC Chile) Ivania Donoso, Eng. MSc (now PhD student UC Chile - KU Leuven) Lukas Svicarovic, MSc Vicente Domínguez, MSc María Fernanda Sepúlveda, MSc Jorge Schellman, MSc Maribel Alvarado, MPGI MSc (now at Bibliotecas UC) Teaching Graduate Second Semester 2024: IIC3633 Recommender Systems First Semester 2024: IIC3633 Recommender Systems 2023: No teaching, on sabbatical leave. Second Semester 2018: Recommender Systems Second Semester 2017: Recommender Systems Second Semester 2016: Recommender Systems Second Semester 2015: Recommender Systems First Semester 2015: Data Mining (MPGI Master Program ) Second Semester 2014: Recommender Systems (CS Master Program). The page for this class is here First Semester 2014: Data Mining (MPGI Master Program ) Undergraduate First Semester 2024: Introduction to Programming. Second Semester 2018: Information Visualization. First Semester 2018: Introduction to the Major in Computer Science. Second Semester 2017: Information Visualization. First Semester 2017: Introduction to the Major in Computer Science. First & Second Semester 2016: Introduction to the Major in Computer Science. First & Second Semester 2015: Introduction to the Major in Computer Science. First & Second Semester 2014: Introduction to the Major in Computer Science. Academic Service Workshop Organization ESIDA 2018 (co-located at IUI 2018) LSRS 2017 (co-located at RecSys 2017) International Workshop on Social Personalization and Search (co-located at SIGIR 2015) International Workshop on Social Personalization (co-located at HT 2014) Journal Reviews International Journal of Human-Computer Studies ACM TiiS (distinguished reviewer) Interacting with Computers, Oxford University Press Computer Communications, Elsevier Social Network Analysis and Mining, Springer Knowledge-Based Systems, Elsevier Conference Reviews 2024: IUI, RecSys 2018: WWW, RecSys, UMAP, IUI 2017: WWW, RecSys, IUI WWW 2016 (Web Science Track) ACM Conference in Intelligent User Interfaces (IUI) 2016 ACM RecSys 2015 (Posters and Demos) CIKM 2015 I-KNOW 2015 RDSM 2015 Workshop, collocated at WWW 2015 MSM 2015 Workshop, collocated at WWW 2015 VISLA 2015 Workshop, collocated at LAK 2015 Web Science Track at WWW 2015 ACM CHI 2015 I-KNOW 2014 Web Science Track at WWW 2014 SocialCom 2014 ACM Hypertext 2014 LiUD 2014 Workshop, collocated at UMAP 2014 MSM 2014 Workshop, collocated at WWW 2014 I-KNOW 2013 Springer Volume on RecSys for TEL, 2013 EDM 2012 CARS 2012 Workshop (co-located with Recsys 2012) RecSys, 2010 Web Intelligence Conference, 2011 Web Intelligence Conference, 2009",
  "content_length": 7775,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:09"
}