{
  "name": "Denis Deratani Mauá",
  "homepage": "http://www.ime.usp.br/~ddm",
  "status": "success",
  "content": "Denis Maua Webpage Denis D. Mauá(he/him)Associate Professor IME-USP About Me I am an Associate Professor of the Department of Computer Science at the Institute of Mathematics and Statistics of the University of São Paulo. My research mostly focuses on the computational aspects of probabilistic and logical reasoning. My group is currently building a neuro-symbolic reasoner supported by such techniques. I am an Area Editor of the International Journal of Approximate Reasoning, an Associate Editor of the Artificial Intelligence Journal, and Senior Associate Editor of the new ACM Transactions on Probabilistic Machine Learning Journal. I serve regularly in the Program Committee of top AI conferences (AAAI, IJCAI, UAI, etc). Interests Artificial Intelligence Tractable Probabilistic Modeling Probabilistic Programming Planning Under Uncertainty Imprecise Probability Education PhD Informatics University of Lugano MEng in Mechatronics University of São Paulo Electrical Engineering University of São Paulo Recent Publications André Barbosa, Igor Cataneo Silveira, Denis D. Mauá (2025). An Empirical Analysis of Large Language Models for Automated Cross-Prompt Essay Trait Scoring in Brazilian Portuguese. Journal of the Brazilian Computer Society. URL Project Cite DOI Fabio G. Cozman, Radu Marinescu, Junkyu Lee, Alexander Gray, Denis D. Mauá (2025). Dealing with cycles in graph-based probabilistic models: the case of Logical Credal Networks. Proceedings of the Fourteenth International Symposium on Imprecise Probabilities: Theories and Applications. URL Cite Igor Cataneo Silveira, André Barbosa, Daniel Silva Lopes Da Costa, Denis D. Mauá (2025). Investigating Universal Adversarial Attacks Against Transformers-Based Automatic Essay Scoring Systems. Intelligent Systems. Cite DOI Fabio G. Cozman, Sarajane M. Peres, Marcelo Finger, Renata Wassermann, Anna H. Reali Costa, Edson S. Gomi, Artur J. L. Correia, Anarosa A. F. Brandão, Karina v. Delgado, Denis D. Mauá, Thiago A. S. Pardo, Fátima L. S. N. Marques (2024). A Big Challenge: Tools to Guarantee Robust and Controlled Behavior of Large Language Models. IV Seminário dos Grandes Desafios da Computação no Brasil: Trabalhos Apresentados. URL Cite DOI Renato Lui Geh, Jonas Gonçalves, Igor C. Silveira, Denis D. Mauá, Fabio G. Cozman (2024). dPASP: A Probabilistic Logic Programming Environment For Neurosymbolic Learning and Reasoning. Proceedings of the 21st International Conference on Principles of Knowledge Representation and Reasoning. URL Project Cite DOI See all publications Recent & Upcoming Talks Logic Programming Neuro Probabilistic Logic Programming Short-course about probabilistic logic programming given at EBL2025 Denis D. Mauá • May 9, 2025 Summer School Credal Networks: Specification, Algorithms, Complexity A gentle introduction to credal networks, with a focus on the very basics (credal sets, independence, elicitation), and on algorithms for marginal inference Fabio G. Cozman • Dec 8, 2020",
  "content_length": 2981,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:59"
}