{
  "name": "Denis Derkach",
  "homepage": "https://www.hse.ru/en/org/persons/148813333",
  "status": "success",
  "content": "Staff - Denis Derkach – HSE University В старых версиях браузеров сайт может отображаться некорректно. Для оптимальной работы с сайтом рекомендуем воспользоваться современным браузером.AAAABCABCABCАААААRegular version of the siteCampus in MoscowNizhny NovgorodSaint PetersburgPermRUENFor visually-impairedFor visually-impairedUser profile (HSE staff only)SearchSearchAdvanced searchMenuHSE UniversityHSE UniversityAbout HSEFaculty and StaffDenis DerkachRUENUser profile (HSE staff only)SearchAdvanced search  HomeTeachingResearch and PublicationsEmployment historyIn HSE news Language ProficiencyEnglishFrenchChineseContactsPhone:27266Address: 11 Pokrovsky Bulvar, Pokrovka Complex, room S917TimetableSPIN-RSCI: 7267-3528ORCID: 0000-0001-5871-0628ResearcherID: AAY-5330-2020Scopus AuthorID: 32667516700Google ScholarSupervisorsI. ArzhantsevE. SokolovPrintable versionwith publicationswith newsPrintHave you spotted a typo?Highlight it, click Ctrl+Enter and send us a message. Thank you for your help!To be used only for spelling or punctuation mistakes.Denis DerkachLecturer: Centre for Training Top AI ProfessionalsLaboratory Head: Faculty of Computer Science / AI and Digital Science Institute / Laboratory of Methods for Big Data AnalysisAssociate Professor: Faculty of Computer Science / Big Data and Information Retrieval SchoolMember of the HSE Academic CouncilDenis Derkach has been at HSE University since 2015.  HomeTeachingResearch and PublicationsEmployment historyIn HSE newsEducation and Degrees2010PhDUniversity of Paris XI2007Master's in PhysicsSt Petersburg State University2004Bachelor'sSt Petersburg State UniversityContinuing education / Professional retraining / Internships / Study abroad experience2015 University of London, lead college: London School of Economics, diploma for graduates, management. Professional Interestsphysics of elementary particlesSupervisor of the following Doctoral thesesfor a Candidate of Sciences degree1A. Ryzhikov Deep generative models for anomaly detection, 20242A. Ibrahim Using Reinforcement learning for the optimal beam control3S. Ali Efficient parameterizations for training and finetuning GANs in the domain of image and audioCourses (2025/2026)Applied Statistics for Machine Learning (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 3, 4 module)EngDeep Learning (Mago-Lego; Faculty of Computer Science; 3, 4 module)RusDeep Learning (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 1 year, 3, 4 module)RusPast CoursesCourses (2024/2025)Deep Learning (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 1 year, 3, 4 module)RusDeep Learning (Mago-Lego; 3, 4 module)RusGenerative Models in Machine Learning (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 4 year, 3 module)EngCourses (2023/2024)Generative Models in Machine Learning (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science, field of study Applied Mathematics and Information Science; 4 year, 3 module)RusGenerative Models in Machine Learning (advanced course) (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 3, 4 module)RusGenerative Models, Part 2 (Mago-Lego; 4 module)RusGenerative Models, Part 2 (Master’s programme; Faculty of Computer Science field of study Applied Mathematics and Informatics; 1 year, 4 module)RusResearch Seminar \"Data Analysis in the Natural Sciences\" (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 4 year, 1-3 module)EngCourses (2022/2023)Chapters in Applied Statistics (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 3, 4 module)RusGenerative Models in Machine Learning (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 4 year, 3 module)RusGenerative Models in Machine Learning (Mago-Lego; 3 module)RusGenerative Models in Machine Learning (Master’s programme; School of Computer Science, Physics and Technology field of study Applied Mathematics and Informatics; 1 year, 3 module)RusGenerative Models in Machine Learning (Master’s programme; School of Computer Science, Physics and Technology field of study Applied Mathematics and Informatics, field of study Applied Mathematics and Informatics; 2 year, 3 module)RusResearch Seminar \"Data Analysis in the Natural Sciences\" (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 4 year, 1-3 module)EngCourses (2021/2022)Chapters in Applied Statistics (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 3, 4 module)RusGenerative Models in Machine Learning (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 4 year, 3 module)RusGenerative Models in Machine Learning (Master’s programme; School of Computer Science, Physics and Technology field of study Applied Mathematics and Informatics; 1 year, 3 module)RusGenerative Models in Machine Learning (Master’s programme; School of Computer Science, Physics and Technology field of study Applied Mathematics and Informatics, field of study Applied Mathematics and Informatics; 2 year, 3 module)RusCourses (2020/2021)Chapters in Applied Statistics (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 3 year, 3, 4 module)RusGenerative Models in Machine Learning (Bachelor’s programme; Faculty of Computer Science field of study Applied Mathematics and Information Science; 4 year, 3 module)RusIntroduction to Data Analysis (Bachelor’s programme; Faculty of World Economy and International Affairs field of study Economics; 1 year, 4 module)RusTimetable for todayFull timetableGrantsRSCF, Presidential program for group lead by young researchers. Project 17-72-20127. New Physics Search in LHCb using Deep Learning Techniques. RSCF, Presidential program for group lead by young researchers. Extension Program. Project 17-72-20127. New Physics Search in LHCb using Deep Learning Techniques. ResponsibilitiesAcademic Secretary to the Dissertation Council in Computer Science. Member of Faculty council Member of Faculty Research committee Employment history 2022 - н.в. Head of the Laboratory of methods for big data analysis (Lambda), HSE University. 2017 – н. в. Assistant Professor, Higher School of Economics. 2015 – 2022 Senior Researcher, Higher School of Economics. 2015 – 2017 Researcher, Yandex Data Factory/Yandex Research. 2013 – 2015 Marie Curie Fellow under FP7-IEF program, University of Oxford, UK. 2011 – 2012 CERN Associate 2011  – 2013 INFN international fellow based at INFN Sezione di Bologna, Bologna, Italy. 2007 – 2010 PhD Student, Laboratoire de l‘Accélérateur Linéaire, Université Paris-Sud XI, Orsay, France.\" 2007 Visiting Scientist, Deutsches Elektronen-Synchrotron, Zeuthen, Germany. 2006 – 2007 Engineer, Laboratory for Ultra-High Energies, St.Petersburg State University, V. A. Fock Institute for Physics, St.Petersburg, Russia 2004 – 2007 High School Teacher, Emperor Alexander II gymnasium, St. Petersburg, Russia. 15Sep2025Global AI Trends Discussed at International Foresight Workshop at HSE UniversityAt an international foresight workshop on artificial intelligence held at HSE University, Russian and foreign scholars discussed the trends and challenges arising from the rapid development of AI. 6May2025HSE Scientists Win Prestigious International Prize in Fundamental PhysicsThe 2025 Breakthrough Prize in Fundamental Physics has been awarded to the international collaborations of experiments at the Large Hadron Collider (LHC) at CERN, including the LHCb collaboration, in which researchers from HSE University have participated. 3Mar2025Megascience, AI, and Supercomputers: HSE Expands Cooperation with JINRExperts in computer technology from HSE University and the Joint Institute for Nuclear Research (JINR) discussed collaboration and joint projects at a meeting held at the Meshcheryakov Laboratory of Information Technologies (MLIT). HSE University was represented by Lev Shchur, Head of the Laboratory for Computational Physics at the HSE Tikhonov Moscow Institute of Electronics and Mathematics (HSE MIEM), as well as Denis Derkach and Fedor Ratnikov from the Laboratory of Methods for Big Data Analysis at the HSE Faculty of Computer Science. 16Sep2024HSE University and Yandex to Host International AI Olympiad for StudentsThe HSE Faculty of Computer Science and Yandex Education are launching their first joint AI competition, Artificial Intelligence and Data Analysis Olympiad (AIDAO), for students from around the world. Participants will tackle challenging tasks in science and industry and interact with experts from HSE and Yandex. The winners will receive cash prizes. 17Aug2023At Sarov Technopark, Researchers from HSE Faculty of Computer Science Discussed AI for Data Analysis in PhysicsThe Laboratory of Methods for Data Analysis of the HSE Faculty of Computer Science, in collaboration with the All-Russian Research Institute of Experimental Physics (RFNC-VNIIEF, Sarov) and the National Centre for Physics and Mathematics, recently held the Second All-Russian School-Seminar on High Energy Physics and Accelerator Technology. 14Dec2022Second Congress of Young Scientists: Students Are Ready to Implement Breakthrough ProjectsThe 2nd Congress of Young Scientists was held at the Sirius Park of Science and Art in Sochi. HSE University representatives took an active part in it, working at various venues where a wide range of topics were discussed—from university development to machine learning an",
  "content_length": 16771,
  "method": "requests",
  "crawl_time": "2025-12-01 13:00:58"
}