{
  "name": "Deniz Yüret",
  "homepage": "http://www.denizyuret.com",
  "status": "success",
  "content": "Deniz Yuret's Homepage Deniz Yuret's Homepage AI.KU BibTeX Courses CV Downloads GitHub Publications Projects Scholar Students I am a professor of Computer Engineering at Koç University in Istanbul and the founding director of the KUIS AI Center. Previously I was at the MIT AI Lab for 12 years and later co-founded Inquira, Inc. My research is in natural language processing and machine learning. For prospective students here are some research topics, papers, classes, blog posts and past students. Koç Üniversitesi Bilgisayar Mühendisliği Bölümü'nde öğretim üyesiyim ve KUIS AI Merkezi'nin kurucu müdürüyüm. Bundan önce 12 yıl MIT Yapay Zeka Laboratuarı'nda çalıştım ve Inquira, Inc. şirketini kurdum. Araştırma konularım doğal dil işleme ve yapay öğrenmedir. İlgilenen öğrenciler için araştırma konuları, makaleler, verdiğim dersler, Türkçe yazılarım, ve mezunlarımız. January 07, 2025 Dördüncü yapay zeka devrimi KUIS AI, Bizim İçin Bilim, Yapay Zekadan Öyküler Full post... Labels: Türkçe, Videos 0 comments October 18, 2024 1. Ulusal Yapay Zeka Buluşması, Kapadokya Tüm videolar Üretken Yapay Zekâ ve Dil Modelleri Full post... Labels: Türkçe, Videos 0 comments September 20, 2024 Keynote, XVIII. Swiss-Turkish Economic Forum From Swiss Days, İstanbul 2024 Full post... Labels: Videos 0 comments August 08, 2024 Emre Can Açıkgöz, M.S. 2024 Current position: PhD Student at University of Illinois Urbana-Champaign, Illinois (Homepage) MS Thesis: Grounding Language in Motor Space: Exploring Robot Action Learning and Control from Proprioception. August 2024. (PDF, Presentation) Thesis Abstract: Language development, particularly in its early stages, is deeply correlated with sensory-motor experiences. For instance, babies develop progressively via unsupervised exploration and incremental learning, such as labeling the action of ”walking” by first discovering to move their legs via trial and error. Drawing inspiration from this developmental process, our study explores robot action learning by trying to map linguistic meaning onto non-linguistic experiences in autonomous agents, specif- ically for a 7-DoF robot arm. While current grounded language learning (GLL) in robotics emphasizes visual grounding, our focus is on grounding language in a robot’s internal motor space. We investigate this through two key aspects: Robot Action Classification and Language-Guided Robot Control, both within a ’Blind Robot’ scenario by relying solely on proprioceptive information without any visual input in pixel space. In Robot Action Classification, we enable robots to understand and categorize their actions using internal sensory data by leveraging Self-Supervised Learning (SSL) through pretraining an Action Decoder for better state representation. Our SSL-based approach significantly surpasses other baselines, particularly in scenarios with limited data. Conversely, Language-Guided Robot Control poses a greater challenge by requiring robots to follow natural language instructions, interpret linguistic commands, generate a sequence of actions, and continuously interact with the environment. To achieve that, we utilize another Action Decoder pretrained on sensory state data and then fine-tune it alongside a Large Language Model (LLM) for better linguistic reasoning abilities. This integration enables the robot arm to execute language-guided manipulation tasks in real time. We validated our approach using the popular CALVIN Benchmark, where our methodology based on SSL significantly outperformed traditional architectures, particularly in low-data scenarios on action classification. Moreover, in the instruction following tasks, our Action Decoder-based framework achieved on-par results with large Vision-Language Models (VLMs) in the CALVIN table-top environment. Our results underscore the importance of robust state representations and the potential of the robot’s internal motor space for learning embodied tasks. Full post... Labels: Students 0 comments April 09, 2024 IPN röportajı: Yapay Zeka Devrimi: Gelecekte Nasıl Ayakta Kalırız Yapay zekanın geçmişi, bugünü ve geleceği Gençlerin yapay zeka alanında hangi meslekleri seçebilecekleri | Gençlere meslek seçiminde tavsiyeler Yapay zeka alanında başarılı olmak için gereken beceriler | Akıllı yazılımların farklı sektörlerdeki etkileri Tuğba Ağaoğlu'nun sunduğu program: https://youtu.be/p5xWWrS8XLA?si=cKBFh4T8AZqwHHLY. Full post... Labels: Türkçe, Videos 0 comments Older Posts Home Subscribe to: Comments (Atom) Deniz Yuret Koç University İstanbul Turkey+90-212-338-1724dyuret@ku.edu.tr Labels Books (28) Language (61) Links (16) MachineLearning (64) Math (13) Notes (17) Türkçe (68) Videos (29) Popular Posts Keynote, XVIII. Swiss-Turkish Economic Forum Alec Radford's animations for optimization algorithms Turkish Language Resources Emacs Turkish mode Introducing Knet8: beginning deep learning with 100 lines of Julia Machine learning in 10 pictures Ergun's English-Turkish machine translation notes Singular Value Decomposition Notes Some starting points for deep learning and RNNs Turkish Data Depository (TDD) My Blog List Slashdot Linux Kernel 6.18 Officially Released 25 minutes ago Less Wrong November Retrospective 41 minutes ago Shtetl-Optimized Mihai Pătrașcu Best Paper Award: Guest post from Seth Pettie 6 hours ago Astral Codex Ten Hidden Open Thread 409.5 2 days ago Sean Carroll Thanksgiving 3 days ago Math3ma What is a Good Quantum Encoding? Part 1 2 months ago Machine Thoughts Sparks of Stupidity 2 years ago Ask a Mathematician Q: How is matter created? Can we create new matter and would that be useful? 4 years ago Cognitive Medium Why does F = ma? 6 years ago Andrej Karpathy blog A Recipe for Training Neural Networks 6 years ago Show 5 Show All Archive ▼ 2025 (1) ▼ Jan 2025 (1) Dördüncü yapay zeka devrimi ► 2024 (4) ► Oct 2024 (1) ► Sep 2024 (1) ► Aug 2024 (1) ► Apr 2024 (1) ► 2023 (6) ► Oct 2023 (1) ► Sep 2023 (2) ► Aug 2023 (2) ► Jul 2023 (1) ► 2022 (17) ► Sep 2022 (3) ► Aug 2022 (4) ► Jun 2022 (2) ► May 2022 (2) ► Apr 2022 (2) ► Mar 2022 (2) ► Feb 2022 (1) ► Jan 2022 (1) ► 2021 (5) ► Oct 2021 (1) ► Jun 2021 (1) ► Apr 2021 (1) ► Feb 2021 (2) ► 2020 (8) ► Dec 2020 (5) ► Jun 2020 (1) ► May 2020 (1) ► Feb 2020 (1) ► 2019 (12) ► Nov 2019 (1) ► Sep 2019 (2) ► Aug 2019 (1) ► Jul 2019 (2) ► Jun 2019 (4) ► Apr 2019 (1) ► Jan 2019 (1) ► 2018 (25) ► Dec 2018 (3) ► Nov 2018 (2) ► Oct 2018 (2) ► Sep 2018 (1) ► Aug 2018 (1) ► Jul 2018 (3) ► Jun 2018 (2) ► May 2018 (9) ► Apr 2018 (2) ► 2017 (12) ► Dec 2017 (1) ► Sep 2017 (3) ► Aug 2017 (2) ► Jul 2017 (1) ► May 2017 (2) ► Apr 2017 (2) ► Feb 2017 (1) ► 2016 (13) ► Dec 2016 (4) ► Nov 2016 (2) ► Sep 2016 (1) ► Aug 2016 (2) ► Jun 2016 (2) ► Mar 2016 (1) ► Feb 2016 (1) ► 2015 (14) ► Dec 2015 (1) ► Nov 2015 (1) ► Jul 2015 (1) ► Jun 2015 (1) ► May 2015 (3) ► Apr 2015 (2) ► Mar 2015 (2) ► Feb 2015 (1) ► Jan 2015 (2) ► 2014 (21) ► Nov 2014 (1) ► Sep 2014 (1) ► Aug 2014 (2) ► Jun 2014 (3) ► May 2014 (3) ► Apr 2014 (3) ► Mar 2014 (1) ► Feb 2014 (2) ► Jan 2014 (5) ► 2013 (10) ► Dec 2013 (1) ► Nov 2013 (2) ► Sep 2013 (1) ► Jun 2013 (1) ► May 2013 (2) ► Feb 2013 (2) ► Jan 2013 (1) ► 2012 (12) ► Nov 2012 (1) ► Oct 2012 (2) ► Aug 2012 (1) ► Jul 2012 (3) ► Jun 2012 (2) ► Apr 2012 (2) ► Mar 2012 (1) ► 2011 (11) ► Oct 2011 (1) ► Aug 2011 (1) ► Jul 2011 (2) ► Jun 2011 (1) ► May 2011 (2) ► Apr 2011 (1) ► Mar 2011 (2) ► Jan 2011 (1) ► 2010 (20) ► Dec 2010 (1) ► Nov 2010 (4) ► Oct 2010 (2) ► Sep 2010 (2) ► Aug 2010 (1) ► Jul 2010 (2) ► Apr 2010 (1) ► Feb 2010 (7) ► 2009 (15) ► Dec 2009 (1) ► Nov 2009 (1) ► Aug 2009 (3) ► Jul 2009 (1) ► Apr 2009 (2) ► Mar 2009 (3) ► Feb 2009 (3) ► Jan 2009 (1) ► 2008 (6) ► Dec 2008 (1) ► Oct 2008 (1) ► Sep 2008 (1) ► Aug 2008 (2) ► Apr 2008 (1) ► 2007 (34) ► Dec 2007 (2) ► Nov 2007 (1) ► Oct 2007 (5) ► Sep 2007 (2) ► Jul 2007 (1) ► Jun 2007 (7) ► May 2007 (2) ► Apr 2007 (1) ► Mar 2007 (2) ► Feb 2007 (8) ► Jan 2007 (3) ► 2006 (58) ► Dec 2006 (9) ► Nov 2006 (6) ► Oct 2006 (16) ► Sep 2006 (10) ► Jul 2006 (2) ► Jun 2006 (7) ► May 2006 (7) ► Apr 2006 (1) ► 2005 (19) ► Oct 2005 (4) ► Sep 2005 (2) ► Aug 2005 (2) ► Jun 2005 (7) ► May 2005 (2) ► Apr 2005 (2) ► 2004 (3) ► Oct 2004 (1) ► Jul 2004 (1) ► Apr 2004 (1) ► 2002 (2) ► Jun 2002 (1) ► Mar 2002 (1) ► 1998 (1) ► May 1998 (1) ► 1994 (1) ► May 1994 (1)",
  "content_length": 8307,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:10"
}