{
  "name": "Dennis K. Peters",
  "homepage": "https://www.mun.ca/engineering/about/people/denniskpeters.php",
  "status": "success",
  "content": "Dennis K. Peters | Faculty of Engineering and Applied Science | Memorial University of Newfoundland Home AboutOur PeopleDennis K. Peters Dennis K. Peters B.Eng. (Memorial), M.Eng., PhD (McMaster), FEC, SMIEEE, P. Eng. Interim Associate Vice-president (Academic) Contact Information Ph: 709-864-8246Em: dpeters[at]mun.caOffice: AA-3047 Expertise Computer System Verification and Validation High-Performance Computing Parallel Processing Architecture and Applications Simulation Software Design and Specification Research Interests Software design, high-performance computing, marine simulation. Personal Profile Dr. Dennis Peters is the interim associate vice-president (academic) at Memorial University. He has been a professor in the Department of Electrical and Computer Engineering since 1998. His research involves techniques for design and verification of software and computer systems, with a particular focus on high-performance computing, real-time applications and parallel or distributed processing. Dr. Peters is an active volunteer in the professional engineering community in Canada. He is a past chair of the Board of Directors of the Professional Engineers and Geoscientists of Newfoundland and Labrador (PEGNL), the Canadian Engineering Qualifications Board (CEQB) and the IEEE Newfoundland and Labrador Section. His teaching activity is primarily in the area of software, ranging from introductory programming courses to advanced topics such as real-time operating systems and concurrent programming. When he can get away from his work, he enjoys spending time with his wife and two children. As weather and schedule permit he enjoys sailing his C&C 30 Sea Plus Plus around the beautiful bays of Newfoundland. Honours/Awards/Accreditation Electrical and Computer Engineering Department Heads Association (ECEDHA) CHECE Canadian Leadership and Service Award, 2019 Professional Engineers and Geoscientists Newfoundland and Labrador's (PEGNL) Award for Service, 2018 Professional Engineers and Geoscientists Newfoundland and Labrador's (PEGNL) Teaching Award 2011 IEEE J. J. Archambault Eastern Canada Merit Award 2010 Fellow of Engineers Canada Research Highlights Current research projects: Digital Oilfield Education Safety @ Sea (Brian Veitch principal investigator) Fillmore Software Other Contacts Message from the Interim DeanVision and MissionStrategic PlanSafetyHistoryAwards and HonoursNewsEngineering ExchangeEmployment OpportunitiesDates and DeadlinesMemorial Centre for EntrepreneurshipFinanceEngineering Computing ServicesMediaContact Us50th Anniversary CelebrationsCelebrating Women in Engineering",
  "content_length": 2626,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:12"
}