{
  "name": "Dennis Hofheinz",
  "homepage": "https://people.inf.ethz.ch/dhofheinz",
  "status": "success",
  "content": "Dennis Hofheinz Dennis Hofheinz ETH Zürich Department of Computer Science Foundations of Cryptography Group Universitätsstrasse 6 CH-8092 Zürich Email: last_name at inf dot ethz dot ch Research statement Motivation. Cryptography is a crucial tool for securing information systems. Cryptographic building blocks ensure the secrecy and integrity of information, and help to protect the privacy of users. Still, most actually deployed cryptographic schemes are not known to have any rigorously proven security guarantees. This has led to a number of far-reaching security issues in widely deployed software systems. Goal. My goal is to provide practical cryptographic building blocks that come with rigorously proven security guarantees. These building blocks should be efficient enough for the use in large-scale modern information systems, and their security should be defined and formally analyzed in a mathematically rigorous manner. Technical interests. I am interested in the foundations of theoretical cryptography, and in general ways to derive constructions and security guarantees in a modular fashion. On the one hand, I am particularly interested in the design and analysis of cryptographic schemes in the public-key setting. This covers common tools like public-key encryption and digital signatures, specifically in realistic modern scenarios (such as settings with a huge number of users). On the other hand, I am fascinated by the possibilities of new cryptographic building blocks such as indistinguishability obfuscation. Publications Statistics: DBLP, Google Scholar. 2023 Masayuki Abe, Dennis Hofheinz, Ryo Nishimaki, Miyako Ohkubo, Jiaxin Pan: Compact Structure-Preserving Signatures with Almost Tight Security. J. Cryptol. 36(4):37. pdf Dennis Hofheinz, Julia Kastner, Karen Klein: The Power of Undirected Rewindings for Adaptive Security. Proc. CRYPTO (2) 2023, Lecture Notes in Computer Science 14082, pp. 725-758, Springer 2023. pdf Suvradip Chakraborty, Dennis Hofheinz, Ueli Maurer, Guilherme Rito: Deniable Authentication When Signing Keys Leak. Proc. EUROCRYPT (3) 2023, Lecture Notes in Computer Science 14006, pp. 69-100, Springer 2023. pdf Antonio Faonio, Dennis Hofheinz, Luigi Russo: Almost Tightly-Secure Re-randomizable and Replayable CCA-Secure Public Key Encryption. Proc. Public Key Cryptography (2) 2023, Lecture Notes in Computer Science 13941, pp. 275-305, Springer 2023. pdf 2022 Nicholas Brandt, Dennis Hofheinz, Julia Kastner, Akin Ünal: The Price of Verifiability: Lower Bounds for Verifiable Random Functions. Proc. TCC (2) 2022, Lecture Notes in Computer Science 13748, pp. 747-776, Springer 2022. pdf Dennis Hofheinz, Eike Kiltz: Scalable Cryptography. Algorithms for Big Data, Lecture Notes in Computer Science 13201, pp. 169-178, Springer 2022. pdf 2021 Christiane Kuhn, Dennis Hofheinz, Andy Rupp, Thorsten Strufe: Onion Routing with Replies. Proc. ASIACRYPT (2) 2021, Lecture Notes in Computer Science 13091, pp. 573-604, Springer 2021. pdf Julia Hesse, Dennis Hofheinz, Lisa Kohl, Roman Langrehr: Towards Tight Adaptive Security of Non-interactive Key Exchange. Proc. TCC (3) 2021, Lecture Notes in Computer Science 13044, pp. 286-316, Springer 2021. pdf Nico Döttling, Dominik Hartmann, Dennis Hofheinz, Eike Kiltz, Sven Schäge, Bogdan Ursu: On the Impossibility of Purely Algebraic Signatures. Proc. TCC (3) 2021, Lecture Notes in Computer Science 13044, pp. 317-349, Springer 2021. pdf 2020 Maximiliane Frölich, Dennis Hofheinz, Michael A. R. Meier: Reading mixtures of uniform sequence-defined macromolecules to increase data storage capacity. Communications Chemistry 3(184):1-10, Springer Nature 2020. pdf Thomas Agrikola, Dennis Hofheinz, Julia Kastner: On Instantiating the Algebraic Group Model from Falsifiable Assumptions. Proc. EUROCRYPT (2) 2020, Lecture Notes in Computer Science 12106, pp. 96-126, Springer 2020. pdf Thomas Agrikola, Geoffroy Couteau, Dennis Hofheinz: The Usefulness of Sparsifiable Inputs: How to Avoid Subexponential iO. Proc. Public Key Cryptography (1) 2020, Lecture Notes in Computer Science 12110, pp. 187-219, Springer 2020. pdf Martin R. Albrecht, Pooya Farshim, Shuai Han, Dennis Hofheinz, Enrique Larraia, Kenneth G. Paterson: Multilinear Maps from Obfuscation. J. Cryptol. 33(3):1080-1113. pdf 2019 Dennis Hofheinz, Bogdan Ursu: Dual-Mode NIZKs from Obfuscation. Proc. ASIACRYPT (1) 2019, Lecture Notes in Computer Science 11921, pp. 311-341, Springer 2019. pdf Geoffroy Couteau, Dennis Hofheinz: Designated-Verifier Pseudorandom Generators, and Their Applications. Proc. EUROCRYPT (2) 2019, Lecture Notes in Computer Science 11477, pp. 562-592, Springer 2019. pdf Dennis Hofheinz, Ngoc Khanh Nguyen: On Tightly Secure Primitives in the Multi-instance Setting. Proc. Public Key Cryptography (1) 2019, Lecture Notes in Computer Science 11442, pp. 581-611, Springer 2019. pdf Dennis Hofheinz, Akshay Kamath, Venkata Koppula, Brent Waters: Adaptively Secure Constrained Pseudorandom Functions. Proc. Financial Cryptography 2019, Lecture Notes in Computer Science 11598, pp. 357-376, Springer 2019. pdf 2018 Dennis Hofheinz, Jörn Müller-Quade, Dominique Unruh: On the (Im-)Possibility of Extending Coin Toss. J. Cryptol. 31(4):1120-1163. pdf Dennis Hofheinz, Dingding Jia, Jiaxin Pan: Identity-Based Encryption Tightly Secure Under Chosen-Ciphertext Attacks. Proc. ASIACRYPT (2) 2018, Lecture Notes in Computer Science 11273, pp. 190-220, Springer 2018. pdf Julia Hesse, Dennis Hofheinz, Lisa Kohl: On Tightly Secure Non-Interactive Key Exchange. Proc. CRYPTO (2) 2018, Lecture Notes in Computer Science 10992, pp. 65-94, Springer 2018. pdf Andreas Boukis, Kevin Reiter, Maximiliane Frölich, Dennis Hofheinz, Michael A. R. Meier: Multicomponent reactions provide key molecules for secret communication. Nature Communications 9(1439), Springer Nature 2018. pdf Romain Gay, Dennis Hofheinz, Lisa Kohl, Jiaxin Pan: More Efficient (Almost) Tightly Secure Structure-Preserving Signatures. Proc. EUROCRYPT (2) 2018, Lecture Notes in Computer Science 10821, pp. 230-258, Springer 2018. pdf Pooya Farshim, Julia Hesse, Dennis Hofheinz, Enrique Larraia: Graded Encoding Schemes from Obfuscation. Proc. Public Key Cryptography (2) 2018, Lecture Notes in Computer Science 10770, pp. 371-400, Springer 2018. pdf Thomas Agrikola, Dennis Hofheinz: Interactively Secure Groups from Obfuscation. Proc. Public Key Cryptography (2) 2018, Lecture Notes in Computer Science 10770, pp. 341-370, Springer 2018. pdf 2017 Dennis Hofheinz, Kathrin Hövelmanns, Eike Kiltz: A Modular Analysis of the Fujisaki-Okamoto Transformation. Proc. TCC (1) 2017, Lecture Notes in Computer Science 10677, pp. 341-371, Springer 2017. pdf Masayuki Abe, Dennis Hofheinz, Ryo Nishimaki, Miyako Ohkubo, Jiaxin Pan: Compact Structure-Preserving Signatures with Almost Tight Security. Proc. CRYPTO (2) 2017, Lecture Notes in Computer Science 10402, pp. 548-580, Springer 2017. pdf Romain Gay, Dennis Hofheinz, Lisa Kohl: Kurosawa-Desmedt Meets Tight Security. Proc. CRYPTO (3) 2017, Lecture Notes in Computer Science 10403, pp. 133-160, Springer 2017. pdf Dennis Hofheinz: Adaptive Partitioning. Proc. EUROCRYPT (3) 2017, Lecture Notes in Computer Science 10212, pp. 489-518. pdf 2016 Dennis Hofheinz, Tibor Jager, Dakshita Khurana, Amit Sahai, Brent Waters, Mark Zhandry: How to Generate and Use Universal Samplers. Proc. ASIACRYPT (2) 2016, Lecture Notes in Computer Science 10032, pp. 715-744. pdf Dennis Hofheinz, Vanishree Rao, Daniel Wichs: Standard Security Does Not Imply Indistinguishability Under Selective Opening. Proc. TCC (B2) 2016, Lecture Notes in Computer Science 9986, pp. 121-145. pdf Dennis Hofheinz, Tibor Jager, Andy Rupp: Public-Key Encryption with Simulation-Based Selective-Opening Security and Compact Ciphertexts. Proc. TCC (B2) 2016, Lecture Notes in Computer Science 9986, pp. 146-168. pdf Romain Gay, Dennis Hofheinz, Eike Kiltz, Hoeteck Wee: Tightly CCA-Secure Encryption Without Pairings. Proc. EUROCRYPT (1) 2016, Lecture Notes in Computer Science 9665, pp. 1-27, Springer 2016. Awarded best paper. pdf Dennis Hofheinz, Tibor Jager: Verifiable Random Functions from Standard Assumptions. Proc. TCC (A1) 2016, Lecture Notes in Computer Science 9562, pp. 336-362, Springer 2016. pdf Dennis Hofheinz: Algebraic Partitioning: Fully Compact and (almost) Tightly Secure Cryptography. Proc. TCC (A1) 2016, Lecture Notes in Computer Science 9562, pp. 251-281, Springer 2016. pdf Julia Hesse, Dennis Hofheinz, Andy Rupp: Reconfigurable Cryptography: A Flexible Approach to Long-Term Security. Proc. TCC (A1) 2016, Lecture Notes in Computer Science 9562, pp. 416-445, Springer 2016. pdf Martin R. Albrecht, Pooya Farshim, Dennis Hofheinz, Enrique Larraia, Kenneth G. Paterson: Multilinear Maps from Obfuscation. Proc. TCC (A1) 2016, Lecture Notes in Computer Science 9562, pp. 446-473, Springer 2016. pdf Dennis Hofheinz, Tibor Jager: Tightly secure signatures and public-key encryption. Des. Codes Cryptogr. 80(1):29-61. pdf 2015 Dennis Hofheinz, Christian Matt, Ueli Maurer: Idealizing Identity-Based Encryption. Proc. ASIACRYPT (1) 2015, Lecture Notes in Computer Science 9452, pp. 495-520, Springer 2015. pdf Dennis Hofheinz, Victor Shoup: GNUC: A New Universal Composability Framework. J. Cryptol. 28(3):423-508. pdf Florian Böhl, Dennis Hofheinz, Tibor Jager, Jessica Koch, Christoph Striecks: Confined Guessing: New Signatures From Standard Assumptions. J. Cryptol. 28(1):176-208. pdf Mihir Bellare, Dennis Hofheinz, Eike Kiltz: Subtleties in the Definition of IND-CCA: When and How Should Challenge Decryption Be Disallowed? J. Cryptol. 28(1):29-48. pdf Dennis Hofheinz, Jessica Koch, Christoph Striecks: Identity-Based Encryption with (Almost) Tight Security in the Multi-instance, Multi-ciphertext Setting. Proc. Public Key Cryptography 2015, Lecture Notes in Computer Science 9020, pp. 799-822, Springer 2015. pdf Christoph Bader, Dennis Hofheinz, Tibor Jager, Eike Kiltz, Yong Li: Tightly-Secure Authenticated Key Exchan",
  "content_length": 20789,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:11"
}