{
  "name": "Denys Poshyvanyk",
  "homepage": "http://www.cs.wm.edu/~denys",
  "status": "success",
  "content": "Denys Poshyvanyk's Webpage Denys Poshyvanyk, Ph.D. Home | Students | Publications | Research | Service | Software | Teaching | CV | Links Chancellor Professor of Computer Science Graduate Director, IEEE Fellow ACM Distinguished Member Computer Science Department William & Mary McGlothlin-Street Hall 105 Williamsburg, VA 23185 Phone (office): (757) 221-3476 Fax: (757) 221-1717 Denys Poshyvanyk is a Chancellor Professor and a Graduate Director in the Computer Science Department at William & Mary (see W&M by numbers) where he leads SEMERU research group. He received his Ph.D. from Wayne State University, where he was advised by Dr. Andrian Marcus. His current research is in the area of software engineering; software analytics; evolution and maintenance; program comprehension; deep learning for software engineering (DL4SE) and SE for deep learning (SE4DL); mobile app development, testing, and security; reverse engineering; repository mining; and traceability. His papers received several Best Paper Awards at ICPC'06, ICPC'07, SCAM'10, ICSM'13, ICPC'18 ERA, CODAPSY'19, Distinguished Paper Awards at ICSM'10, S&P'24, and ACM SIGSOFT Distinguished Paper Awards at ASE'13, ICSE'15, ESEC/FSE'15, ICPC'16, ASE'17, ESEC/FSE'19, ICSE'20, FSE'24. He also received the Most Influential Paper Awards at ICSME'16, ICPC'17, ICPC'20, ICSME'21, SCAM'24 and MSR'25. He is a recipient of the NSF CAREER award (2013). He is an IEEE Fellow and an ACM distinguished member. He currently serves as a Senior Associate Editor at the ACM Transactions on Software Engineering and Methodology (TOSEM). He also serves on the editorial boards of Empirical Software Engineering Journal (EMSE, Springer), Journal of Software: Evolution and Process (JSEP, Wiley) and Science of Computer Programming (SCP, Elsevier). He served on the editorial board of IEEE Transactions on Software Engineering (TSE) from 2017-2021. He serves on the steering committee of the ACM International Conference on the Foundations of Software Engineering (FSE), IEEE/ACM International Conference on Automated Software Engineering (ASE) and ACM International Conference on AIWare (AIware). He served on the steering committee of the ACM/IEEE International Conference on Mobile Software Engineering and Systems (MobileSoft), IEEE International Conference on Software Maintenance and Evolution (ICSME) and IEEE International Conference on Program Comprehension (ICPC). He also serves/served as a Program Co-Chair for FSE’25, General Co-Chair for MOBILESoft'24, NIER track chair for ASE’24, an area co-chair for AI/SE for ICSE'23, PC Co-chair for ASE'21, MobileSoft’19, ICSME'16, ICPC'13, WCRE'12, and WCRE'11. He is also on the CRA-E board of directors. Please refer to the following software page for the list of current projects, tools and source code. News: - Area Chair for AI for SE at ICSE'27 - Our ASE'16 paper on \"Deep Learning Code Fragments for Code Clone Detection\" receives a Most Influential Paper Award at ASE'25 - Kevin Moran receives an NSF CAREER Award - Our MSR'15 paper on \"Toward Deep Learning Software Repositories\" received Most Influential Paper Award at MSR'25 - Our SCAM'14 paper on \"On Automatically Generating Commit Messages via Summarization of Source Code Changes\" received Most Influential Paper Award at SCAM'24 - Our FSE'24 paper receieved ACM SIGSOFT Distinguished Paper Award - Our S&P'24 paper received Distinguished Paper Award (one of the nine distinguished papers out of 1,463 submissions) - Elevated to an IEEE Fellow and an ACM Distinguished Member - Kevin Moran receives 2024 ACM SIGSOFT Early Career Researcher Award - Guest Editor-in-Chief of the AI-SE Continuous Special Section at the ACM Transactions on Software Engineering and Methodology (TOSEM) - PC Co-chair for the ACM SIGSOFT Symposium on the Foundations of Software Engineering (FSE’25) - New Ideas and Emerging Results (NIER) Track Chair for 39th IEEE/ACM International Conference on Automated Software Engineering (ASE’24) - We gratefully acknowledge NSF for supporting our new research project on Understandability and Interpretability for Neural Language Models of Source Code - General Co-Chair for MOBILESoft'24 - New Faculty Symposium Co-Chair at ASE'23 - Trevor Stalnaker (co-advised with Oscar Chaparro) successfully defends his M.S. thesis on \"A Comprehensive Study of Bills of Materials for Software Systems\" - Nathan Cooper succesfully defended his Ph.D. dissertation on \"Intelligent Software Tooling for Improving Software Development\" and joined Stability.AI as the Lead Research Scientist for the Code.AI Team - Scott Marsden successfully defended his M.S. thesis on \"A Reevaluation of Why Crypto-detectors Fail: A Systematic Revaluation of Cryptographic Misuse Detection Techniques\" - Kevin receives the MobileSoft Rising Star Award for 2023! - Alejandro selected as a CRA-E Graduate Fellow - Guest Editor for the Open Continuous Special Section on AI and SE at TOSEM - We gratefully acknowledge NSF for supporting our new research project on Enabling Interactive and Comprehensive Open Source Software License Compliance - Appointed as an ACM Distinguished Speaker - Presented a keynote talk at NLBSE workshop on \"Deep Learning and Software Engineering: Past, Present and Future\" [watch here] - Maddy succesfully defends her honors thesis on \"Translating Video Recordings of Mobile App UI Gestures into Replayable Scenarios for Native and Hybrid Apps\" - Our paper on \"Systematic Literature Review on the Use of Deep Learning in Software Engineering Research\" has been accepted at TOSEM - We gratefully acknowledge NSF for supporting our new research project on Understanding and Testing Smart Homes! - Our paper on “Why Crypto-detectors Fail: A Systematic Evaluation of Cryptographic Misuse Detection Techniques” was accepted at Oakland’22! - Our ICSME'11 paper from ten years ago receives the Most Influential Paper Award at ICSME'21! Thanks ICSME community for this recognition! - We gratefully acknowledge NSF for supporting our two new projects on bug reporting and traceability - Cody Watson has successfully defended his dissertation on \"Deep Learning in Software Engineering\" and joins Washington and Lee University (W&L) as an Assistant Professor of Computer Science - Our ICSE'20 paper received the ACM SIGSOFT Distinguished Paper Award! - The report from the 2019 NSF Workshop on Deep Learning and Software Engineering is avaiable here and also Arxiv! We are looking forward to your comments and contributions! - Kevin will be joining George Mason University as an Assistant Professor in Fall 2020! - Our ICPC'10 paper from ten years ago receives the Most Influential Paper Award at ICPC'20! - Serving as a Program Co-Chair for the 36th IEEE/ACM International Conference on Automated Software Engineering (ASE'21) - Our FSE'19 paper receives the ACM SIGSOFT Distinguished Paper Award! - Michele Tufano has successfully defended his dissertation on \"Learning Code Transformations via Neural Machine Translation\" and will be joining Microsoft - Our paper “An Empirical Study on Learning Bug-Fixing Patches in the Wild via Neural Machine Translation” has been accepted to TOSEM - Our paper on “Automatically Assessing Code Understandability” has been accepted to TSE - Our paper “A Study of Data Store-based Home Automation” received the Best Paper Award at CODAPSY'19! - Our paper \"On Learning Meaningful Code Changes via Neural Machine Translation\" has been accepted to ICSE'19! - Serving as a Program Committee Co-Chair for 6th IEEE/ACM International Conference on Mobile Software Engineering and Systems (MobileSoft’19). Submit your work to MobileSoft'19! - Received Distinguished Reviewer Award at 33rd IEEE/ACM International Conference on Automated Software Engineering (ASE’18) - We gratefully acknowledge NSF for supporting our new project on \"Natural GUI-Based Testing of Mobile Apps via Mining Software Repositories\", [abstract] - We gratefully acknowledge NSF for supporting our new project (with Adwait Nadkarni) on \"Enabling Systematic Evaluation of the Soundness of Android Security Analysis Techniques\", [abstract] - Our paper on “Discovering Flaws in Security-Focused Static Analysis Tools for Android using Systematic Mutation” has been accepted to USENIX'18! - Chris Vendome will be joining the Department of Computer Science and Software Engineering at Miami University as a Tenure-track Assistant Professor in Fall 2018 - We released AutoenCODE, which is a Deep Learning infrastructure that allows to encode source code fragments into vector representations, which can be used to learn similarities [link] - Invited to give keynote talks at MobileSoft'18 and ICPC'18! - ICSE'18 accepts TWO papers on licensing bugs and detecting GUI design violations in Android apps! - Joined Editorial Board of IEEE Transactions on Software Engineering (TSE)! - W&M published a featured article about my group's work - Our ASE'17 paper on \"Automatically Assessing Code Understandability: How Far Are We?\" receives ACM SIGSOFT Distinguished Paper Award! - Our paper on \"Enabling Mutation Testing for Android Apps\"was presented at FSE'17! - Our paper on “Continuous, Evolutionary and Large-Scale: A New Perspective for Automated Mobile App Testing” was presentedat ICSME'17 - Our ICPC'07 paper from ten years ago receives the Most Influential Paper Award at ICPC'17! - Selected as a Distinguished Referee for ACM Transactions on Software Engineering and Methodology (for 2015 and 2016 years) - OC member for SANER'18 Reproducibility and Negative Results Track and and MobileSoft'18 Tool Demo Track - PC member for FSE'19, ASE'18, MSR'18, ICPC'18, SANER'18 and ICSE'18 - Our ICSM'06 paper from ten years ago receives the Most Influential Paper Award at ICSME'16! - Our ICPC'16 paper receives ACM SIGSOFT Distinguished Paper Award! - Recently accepted papers at TSE, JSS, ASE'18, ICSME'18, ICSE'18, TOSEM, USENIX'18 - Mario successfully defended his dissertation! Mario will be joining Universidad de los Andes, Colo",
  "content_length": 10056,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:14"
}