{
  "name": "Dequan Wang",
  "homepage": "https://dequan.wang",
  "status": "success",
  "content": "Dequan Wang - Assistant Professor at Shanghai Jiao Tong University </> => [] <> () :: == ++ ; Hello! 🤗 I'm Dequan Wang Assistant Professor at Shanghai Jiao Tong University About I am Dequan Wang (王德泉), an assistant professor at Shanghai Jiao Tong University and a full-time mentor at Shanghai Innovation Institute. My research lies at the intersection of Agentic AI and Life Sciences, developing generative AI that treats living cells as programmable machines. I am particularly interested in leveraging large-scale models and multi-agent systems to decode complex biological processes more efficiently and effectively. I completed my Ph.D. at University of California, Berkeley, advised by Prof. Trevor Darrell, and earned my B.S. from Fudan University. AI for Science LLM Agents Multimodal LLMs Positions Assistant ProfessorShanghai Jiao Tong University2023 - PresentFull-time MentorShanghai Innovation Institute2025 - PresentResearch ScientistShanghai Artificial Intelligence Laboratory2023 - 2024 Education Ph.D. in Computer ScienceUniversity of California, Berkeley2016 - 2022B.S. in Computer ScienceFudan University2012 - 2016 News 量子位Nature 等顶刊最新封面考验模型科学推理能力Aug. 25, 2025量子位LLM-as-a-judge 大模型给自己当裁判并不靠谱Aug. 17, 2025上海交通大学计算机学院“学森挑战计划暑期挑战营”圆满收官Aug. 9, 2025上海创智学院走进大模型：暑期微课程AI训练营圆满收官July 25, 2025 Teaching 设计和理解深度神经网络Designing and Understanding Deep Neural Networks人工智能算法实践Hands-On Artificial Intelligence走近大模型Introduction to Large Language Models人工智能编程实战Coding with AI: from Zero to Hero Papers PersonaEval: Are LLM Evaluators Human Enough to Judge Role-Play?Lingfeng Zhou, Jialing Zhang, Jin Gao, Mohan Jiang, Dequan WangCOLM 2025MAC: A Live Benchmark for Multimodal Large Language Models in Scientific UnderstandingMohan Jiang*, Jin Gao*, Jiahao Zhan, Dequan WangCOLM 2025AI4Protein: Transforming the Future of Protein DesignDequan Wang*, Zheling Tan*, Jin Gao*, Shaoting Zhang, Jiaqi Shen, Yuming LuSCIENCE CHINA Life Sciences (2025)Dissecting Dissonance: Benchmarking Large Multimodal Models Against Self-Contradictory InstructionsJin Gao, Lei Gan, Yuankai Li, Yixin Ye, Dequan WangECCV 2024Lost in Translation: Latent Concept Misalignment in Text-to-Image Diffusion ModelsJuntu Zhao, Junyu Deng*, Yixin Ye*, Chongxuan Li, Zhijie Deng#, Dequan Wang#ECCV 2024MedFMC: A Real-world Dataset and Benchmark for Foundation Model Adaptation in Medical Image ClassificationDequan Wang*, Xiaosong Wang*, Lilong Wang, Mengzhang Li, Qian Da, Xiaoqiang Liu, Xiangyu Gao, Jun Shen, Junjun He, Tian Shen, Qi Duan, Jie Zhao, Kang Li, Yu Qiao#, Shaoting Zhang#Scientific Data (2023)Text-guided Foundation Model Adaptation for Pathological Image ClassificationYunkun Zhang, Jin Gao, Mu Zhou, Xiaosong Wang, Yu Qiao, Shaoting Zhang, Dequan WangMICCAI 2023Back to the Source: Diffusion-Driven Adaptation to Test-Time CorruptionJin Gao*, Jialing Zhang*, Xihui Liu, Trevor Darrell, Evan Shelhamer#, Dequan Wang#CVPR 2023",
  "content_length": 3157,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:13"
}