{
  "name": "Derek R. Magee",
  "homepage": "https://eps.leeds.ac.uk/computing/staff/172/derek-magee",
  "status": "success",
  "content": "Derek Magee | School of Computer Science | University of Leeds Skip to main content University links Search Destination Faculty of Engineering and Physical Sciences site All leeds.ac.uk sites School of Computer Science Search Faculty of Engineering and Physical Sciences School of Computer Science People Profile Derek Magee Position: Associate Professor Areas of expertise: Digital Pathology; Image Analysis; Medical Image Analysis; Deep Learning; AI; Video Analysis; Machine Learning Email: D.R.Magee@leeds.ac.uk Phone: +44(0)113 343 6819 Location: 2.21f Bragg Building Research interests I have been working on machine learning and AI as applied to image analysis since 1995. I have a particular interest in Digital Pathology image analysis (https://www.virtualpathology.leeds.ac.uk), woring in the area since 2003, and founding spin out HeteroGenius Limited in 2014. I have also worked on other medical applications of AI including X-ray dose optimisation, Radiotherapy planning, Ultrasound guided procedure training simmulation, and Quality Assurance applications. I also have an interest in video analysis with applications in Livestock monitoring, Vetenary science (Gait and Skin disease), and Traffic and scene monitoring. Qualifications BSc (First Class), Durham, 1995 PhD, Leeds, 2001 Research groups and institutes Computing in Biology, Medicine and Health Artificial Intelligence <h4>Postgraduate research opportunities</h4> <p>We welcome enquiries from motivated and qualified applicants from all around the world who are interested in PhD study. Our <a href=\"https://phd.leeds.ac.uk\">research opportunities</a> allow you to search for projects and scholarships.</p> Research outputs Loading... My five most recent selected research outputs My other selected research outputs Journal articles Conference papers Presentation (conference/workshop etc) Books Chapters Conference abstracts Preprints Reports Internet publications Performances Compositions Exhibitions Posters Artefacts Designs Patents Scholarly editions Software / code Thesis / dissertations Others Datasets Media Working papers Back to top",
  "content_length": 2117,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:19"
}