{
  "name": "Derek Groen",
  "homepage": "https://www.brunel.ac.uk/people/derek-groen",
  "status": "success",
  "content": "Dr Derek Groen | Introduction | Brunel University London Skip to Content Home People Dr Derek Groen Dr Derek GroenReader in Computer Science Wilfred Brown Building 210 Email: derek.groen@brunel.ac.uk Tel: +44 (0)1895 268297 Computer Science College of Engineering, Design and Physical Sciences Summary I am a Lecturer in Simulation and Modelling at Brunel University. I'm also an Emeritus Fellow for the EPSRC-funded 2020 Science Network, a Fellow of the Software Sustainability Institute, and a Visiting Lecturer at the Centre for Computational Science at University College London. I completed an MSc in Grid Computing at the University of Amsterdam (UvA) in 2006, and a PhD in Computational Astrophysics both at the UvA and Leiden University in November 2010. After my PhD I worked as a post-doctoral researcher on EU projects about distributed multiscale computing (MAPPER) and high-performance computing towards the Exascale (CRESTA). I received a 1-year position as a Fellow of 2020 Science in January 2015, and funded myself for two months through an EPSRC eCSE to work on new approaches for domain decomposition. I joined Brunel University in September 2015 to become a Lecturer and I currently collaborate in the EU ComPat project about multiscale computing towards the Exascale.I have published >20 peer-reviewed journal papers in venues such as IEEE Computer, IEEE CiSE, Journal of Computational Science, Phil. Trans. R. Soc. A., Physics Review E., the Astrophysical Journal and eLife. In addition, I was second author of the first ever feature article in Advanced Materials, which was on multiscale modelling of clay-polymer nanocomposites and received news coverage from the Daily Telegraph and the BBC. I currently run Science Hackathons to efficiently establish new interdisciplinary collaborations. Newest selected publications Xue, Y., Schincariol, T., Chadefaux, T. and Groen, D. (2025) 'Using machine learning to forecast conflict events for use in forced migration models'. Scientific Reports, 15 (1). pp. 1 - 14. ISSN: 2045-2322 Open Access Link Journal article Kardoš, J., Edeling, W., Suleimenova, D., Groen, D. and Schenk, O. (2025) 'Sensitivity analysis of high-dimensional models with correlated inputs'. Journal of Computational Science, 0 (in press, pre-proof). pp. 1 - 18. ISSN: 1877-7503 Open Access Link Journal article Neykova, R. and Groen, D. (2025) 'Model input verification of large scale simulations'. Journal of Simulation, 19 (5). pp. 596 - 615. ISSN: 1747-7778 Open Access Link Journal article Ghorbani, M., Suleimenova, D., Jahani, A., Saha, A., Xue, Y., Mintram, K., Anagnostou, A., Tas, A., Low, W., Taylor, SJE. and Groen, D. et al. (2024) 'Flee 3: Flexible agent-based simulation for forced migration'. Journal of Computational Science, 81. pp. 1 - 14. ISSN: 1877-7503 Open Access Link Journal article Boesjes, F., Jahani, A., Ooink, B. and Groen, D. (2024) 'Analysing the effect of a dynamic physical environment network on the travel dynamics of forcibly displaced persons in Mali'. International Journal of Network Dynamics and Intelligence, 3 (1). pp. 1 - 9.Open Access Link Journal article More publications(38)",
  "content_length": 3161,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:18"
}