{
  "name": "Derek Aguiar",
  "homepage": "http://derekaguiar.com",
  "status": "success",
  "content": "Personal web of Derek Cole Aguiar I am an assistant professor in the Computer Science and Engineering Department at the University of Connecticut. I graduated from the University of Rhode Island with B.S. degrees in Computer Engineering and Computer Science, received my Ph.D. in Computer Science from Brown University, advised by Professor Sorin Istrail, and completed my postdoctoral work at Princeton University with Professor Barbara Engelhardt. My research aims to develop probabilistic machine learning models, combinatorial algorithms, and scalable inference methods to better understand high-dimensional data, particularly genomics and genetics data applied to complex disease. I am looking for motivated PhD students interested in foundational research at the intersection of statistics, probabilistic machine learning, and algorithms and applying this work to application areas including genomics, transcriptomics, population genetics, and immunology. Recent press article about the lab. Derek Aguiar Assistant Professor of CSE University of Connecticut Computer Science & Engineering Dept. Storrs, CT 06269 Facebook Github E-mail Highlights HapCompass HapCompass is a state-of-the-art haplotype assembler presented at ISMB 2013 and published in Bioinformatics and the Journal of Computational Biology. It is extremely accurate and efficient and the only haplotype assembly algorithm capable of polyploid haplotype assembly. BIISQ BIISQ is a Bayesian nonparametric model for isoform discovery and individual specific quantification from short-read RNA-seq data. BIISQ does not require isoform reference sequences but instead estimates an isoform catalog shared across samples. CSE5825 Bayesian ML In Bayesian Machine Learning, we cover the three fundamental components of Bayesian Machine Learning: probabilistic modeling, inference algorithms, and model checking. Explore Engineering Explore Engineering is a one-week STEM summer camp for high schoolers where they are introduced to engineering. Students who choose the CSE track are introduced to Programming, Data Science, Machine Learning and Artificial Intelligence.",
  "content_length": 2131,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:16"
}