{
  "name": "Derek A. Paley",
  "homepage": "https://cdcl.umd.edu",
  "status": "success",
  "content": "Welcome to the website of the Collective Dynamics and Control Laboratory Contact — Director — Media — Research — Publications — Lab Members Contact Info Dr. Derek A. Paley Principal Investigator, AI and Autonomy for Multi-Agent Systems (ArtIAMAS) Principal Investigator, RoboScout DTC: Emergency Response for Automated Intelligent Assessment of Mass Casuality Incidents Director, Collective Dynamics and Control Laboratory Willis H. Young Jr. Professor of Aerospace Engineering Education Department of Aerospace Engineering and Institute for Systems Research, University of Maryland Office: 3150 Martin Hall, 4298 Campus Dr., College Park, MD 20742 (301) 405-5757 | (301) 314-0213 (fax) dpaley@umd.edu | http://cdcl.umd.edu Director Bio Derek A. Paley is the Willis H. Young Jr. Professor of Aerospace Engineering Education in the Department of Aerospace Engineering and the Institute for Systems Research at the University of Maryland. He is the founding director of the UMD Collective Dynamics and Control Laboratory. He served as Director of the Maryland Robotics Center (2019–2025) and the UMD Autonomous Micro Air Vehicle Team (2014–2024). Paley leads the UMD RoboScout Team in the DARPA Triage Challenge. Paley is an Affiliate Professor in the Departments of Computer Science and Electrical and Computer Engineering, an Affiliate Research Scientist in the Applied Research Laboratory for Intelligence and Security, and a member of the Alfred Gessow Rotorcraft Center, the Maryland Robotics Center, the Maryland Transportation Institute, and the MATRIX Lab. Paley received the B.S. degree in Applied Physics from Yale University in 1997 and the Ph.D. degree in Mechanical and Aerospace Engineering from Princeton University in 2007 (dissertation). He received the the National Science Foundation CAREER award in 2010, the Presidential Early Career Award for Scientists and Engineers in 2012, the University of Maryland E. Robert Kent Teaching Award for Junior Faculty in 2014, and the AIAA National Capital Section Engineer of the Year in 2015. Paley was a Fellow in the 2013–2014 Office of Naval Research Sabbatical Fellowship Program, a Fellow in the 2019–2020 UMD ADVANCE Leadership Fellows Program, a 2020-2021 UMD Distinguished Scholar-Teacher, and a 2023 UMD Exemplary Researcher. He has been selected as a UMD University Honors Faculty Fellow for 2023-2025 and received the 2025 Senior Faculty Outstanding Research Award from the A. James Clark School of Engineering at the University of Maryland. Paley has authored more than 190 peer-reviewed publications including the textbook Engineering Dynamics: A Comprehensive Introduction (Princeton University Press, 2011); he edited the volume Bioinspired Sensing, Actuation, and Control in Underwater Soft Robotic Systems (Springer, 2020). He teaches introductory dynamics, advanced dynamics, aircraft flight dynamics and control, collective behavior, and nonlinear control. Paley’s research interests are in the area of dynamics and control, including AI and autonomy for national security and public safety. His research is based on support by the Air Force Office of Scientific Research, the Army Research Office, the Army Research Laboratory, the Defense Advanced Research Projects Agency, the National Science Foundation, and the Office of Naval Research. Paley is Associate Fellow of the American Institute of Aeronautics and Astronautics and Senior Member of the Institute of Electrical and Electronics Engineers. He has served as an Associate Editor for AIAA Journal of Guidance, Control, and Dynamics, IEEE Transactions on Control of Network Systems, and IEEE Control Systems. Curriculum vitae; Google scholar profile; ResearcherID ORCID Scopus LinkedIn Read interview with Paley from IEEE Control Systems, April 2020. Research Topics Dynamics, estimation, and control: Distributed control of autonomous robotic systems Mobile sensor networks: Adaptive sampling of spatiotemporal processes Biocomplexity and bioinspiration: Quantitative modeling of animal groups and behavior Social Media See CDCL news, photos, and videos on the CDCL Facebook page and the CDCL YouTube channelShare the CDCL website on social media: Videos (To see a list of all of the videos, click the playlist icon at the top right of the video player below.) Current Projects Arrays of Lagrangian Floats for Areal Coverage (ONR 2024–2026, with Z. Szuts and T. Curtin The long-term goal of this research is to enable a group of buoyancy-controlled and sensor-equipped floats to efficiently and automatically sample a large ocean volume using intermittent surfacing and intelligent control. The specific research objective is to maximize the persistent coverage performance of multiple floats in a mesoscale ocean volume that includes strong transient ocean currents over days and weeks. Improving Campus Safety with 5G Drones for First Responders (RNO Holdings 2025–2026, with the UMD UAS Research and Operations Center) The long-term goal of this project is to locate and track threats on college campuses using a smart swarm of small quadrotor drones with advanced cellular networking capabilities. The specific research objective is to apply tools from rotorcraft design, telecommunications, robotics, and AI to solve the problem of detecting, localizing, and tracking suspected perpetrators of potential mass shootings in campus and urban environments. University of Maryland Vertical Lift Research Center of Excellence (Army, Navy & NASA 2023–2026, with the A. Gessow Rotorcraft Research Center) This research program seeks to advance fundamental understanding, predictive, and design optimization capabilities in a number of areas of science and engineering of great significance to the rotorcraft field. The objective of the CDCL task, “UAS System Identification and Control for Safe Proximity Flight,” is to design, build, test, and demonstrate fully autonomous UAS 3D mapping solutions that can reliably and successfully operate in challenging indoor, constrained environments. RoboScout DTC: Emergency Response for Automated Intelligent Assessment of Mass Casualty Incidents (DARPA 2023–2025, with Dinesh Manocha, Sarah Murthi, and Josh Gaus) RoboScout DTC (DARPA Triage Challenge, Primary Triage Systems Competition, Track A) aims to demonstrate a standoff sensing capability using COTS sensors placed on uncrewed air and ground mobile robotic platforms with AI-based casualty assessment algorithms that provide automated, real-time labeling of mass-casualty injuries in the field. The overall goal is to focus on assessing from a distance using non-contact, standoff signature acquisitions for the leading causes of preventable trauma death. The specific research objective is to apply tools from AI and perception, medical trauma and sensors, and robotics and autonomy to develop physiological signatures of severe injuries, data-driven models to detect them, and mobile platforms to collect the sensor data. Increasing Sustainability, Accessibility, and Equity in Urban Mobility with A Self-driving E-Scooter (UMD 2023–2026 Grand Challenge Individual Award) The long-term goal of this Grand Challenge project is to increase sustainability, accessibility, and equity in urban mobility through electric- powered scooters by enabling them to autonomously move where they are needed the most. The specific research objective is to create self-driving e-scooters using tools from robotics, engineering, and computer science to solve the problem of creating a low-emissions, convenient, and inexpensive transportation modality for dense urban settings. The research provides training opportunities for students interested in autonomous robotics and self-driving vehicles. Hydrodynamics, Sensing & Control in Schooling Fish: From Biology to Efficient Multi-Vehicle Systems (ONR 2022–2026, with E. Kanso, M. McHenry, and Rajat Mittal) The long-term goal of this research activity is to investigate close-proximity swimming in fish-inspired underwater vehicles using a principled approach to modeling and control that results in a physical demonstration of multiple free-swimming prototypes whose interactions yield hydrodynamic benefits. The specific research objective is to apply tools from fluid dynamics, continuum mechanics, and automatic control theory to solve the problem of optimally regulating the swimming behavior of a flexible robotic fish using distributed sensing of the body deformation, adjacent fluid structures, and the relative position/orientation, velocity, and shape of nearby propulsive bodies. AI and Autonomy for Multi-Agent Systems (ArtIAMAS) (ARL 2021–2026, with A. Gangopadhyay, J. Herrmann, D. Manocha, and N. Roy) The long-term goal of this cooperative agreement is to enable dual-use capabilities and technologies in uncrewed assets and smart devices that work intelligently in cooperation with each other and human actors across multiple domains. The specific research objectives include science-focused and science-led application of tools from engineering, computer science, operations research, cybersecurity, and robotics to solve the problem of endowing embodied mobile platforms and equipment with the requisite intelligence and autonomy to support high-tempo movement and maneuver, secure logistics, and enable situational awareness in complex environments while reducing human workload and risk. Campus Facilities Robotics and Autonomy Laboratory (Maryland Robotics Center) facility supports mobile robotics research, robotics prototyping, and manufacturing Brin Family Aerial Robotics Lab (Maryland Robotics Center) facility designed for testing flying and ground robotic platforms Neutral Buoyancy Research Facility (Space Systems Laboratory) 367,000 gallon water tank Fearless Flight Facility (Department of Aerospace Engineering) 100’ x 300’ x 50’ outdoor netted arena Publications Books 2.   D. A. Paley and N. Wereley, editors. Bioinspired Sensing, Actuation, and Control in Underwater Soft Robotic Systems. Sp",
  "content_length": 24781,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:17"
}