{
  "name": "Derick Wood",
  "homepage": "https://www.cse.ust.hk/derickwood",
  "status": "success",
  "content": "In Memory of Professor Derick Wood In Memory of Professor Derick Wood With deep grief and great sadness, we are writing to share with you the sad news about the passing of our Professor Emeritus, Professor Derick Wood, on October 4, 2010, at the Sunnyside Home in Ontario, Canada. Derick joined the Department of Computer Science, HKUST as Professor on January 2, 1995 and have been our faculty for over 10 years until his retirement on June 30, 2006. During the period September 2001 to June 2002, Derick was appointed as Acting Head of the Department. He was conferred the title Chair Professor in January 2006, and has been our Professor Emeritus since his retirement. During his career at HKUST, Derick contributed not only in the areas of teaching and research; he also served in many committees at the department, school and university level. He was highly respected not only by his colleagues in the department, but also by many others in the university who had a chance to know him or work with him. To his students, Derick has always been a most dedicated and caring teacher. His death is a profound loss to his family, friends, colleagues and students. The funeral service for Derick will take place in the morning of October 16, 2010 at a funeral home in Ontario, his home town where he spent the last years of his life with his beloved family. Visitations for friends will be held in the evening of October 15 in the same funeral home. Details can be found at the following link: http://www.lifenews.ca/waterloorecord/profile/147713 Derick is dearly missed by all the people who have the luck of getting to know him in person. Although he has left this earth, his warmness, generosity, and great sense of humour will never be forgotten. CIAA(WIA) - The Beginnings Dr. Derick Wood Graduate Scholarship (this Scholarship was set at University of Waterloo)",
  "content_length": 1865,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:20"
}