{
  "name": "Deshendran Moodley",
  "homepage": "https://people.cs.uct.ac.za/~deshen",
  "status": "success",
  "content": "Deshen Moodley Skip to content DSI/NRF-UCT SARChI Chair in Artificial Intelligence SystemsAssociate Professor of Computer Science at the University of Cape TownDirector: Artificial Intelligence Research UnitCo-Director: Centre for Artificial Intelligence Research Currently hiring a postdoc: AI Systems for Neuroscience in Africa.Email: deshen@cs.uct.ac.za Orcid Researchgate Linkedin I hold the SARChI Research Chair in Artificial Intelligence Systems at the University of Cape Town in South Africa and lead the Adaptive and Cognitive Systems Lab in the Department of Computer Science.Together with my students we explore new mechanisms for continuous learning, interactive decision making, and scientific knowledge discovery in AI systems.  Our focus is on discovering and understanding complex physical and social processes by monitoring multiple heterogeneous sensor data streams. This aligns closely with the notion of an AI scientist, where the system works collaboratively with members of a research team to discover new patterns and theories from continuously observing the world.We explore and leverage both machine learning and knowledge based AI techniques to discover new ways to leverage AI  for sustainable development in South Africa. I have worked on applications in health, energy, biodiversity and earth observation and have undertaken research visits to several interdisciplinary research groups, including the Clinical Decision-Making Group, CSAIL, Massachusetts Institute of Technology, the Machine Vision Unit, University of Edinburgh, and the Institute for Geoinformatics, University of Muenster. More recently, I spent the 2023/2024 academic year as a Research Fellow at the Paris Institute for Advanced Study where I worked on a joint research project on human-centred AI systems in collaboration with the Sorbonne Centre for Artificial Intelligence at Sorbonne University. I still maintain an affiliation with the Paris IAS as an Editorial Fellow. Scroll to Top",
  "content_length": 1987,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:27"
}