{
  "name": "Desheng Zhang",
  "homepage": "https://www.cs.rutgers.edu/~dz220",
  "status": "success",
  "content": "Desheng Zhang, Rutgers University Desheng Zhang Associate Professor Computer Science, Rutgers Office: CoRE Building 307 Phone: (848) 445-8307 desheng AT cs.rutgers.edu Visiting Professor Media Lab, MIT desheng AT mit.edu Home Research Group Grants Publication Impacts Awards Services Teaching Data Curriculum Vitae RA Positions Available There are several graduate RA positions available in my group starting 2025 Fall. If you are interested in Embodied AI, LLM, Data Science, Cyber-Physical Systems, or Internet of Things, please send me your CV (for existing RU students) or mention my name in the cover letter of your application (for prospective students). Sabbatical at MIT Starting September 2020, I have been taking my sabbatical at MIT Media Lab working with Prof. Alex 'Sandy' Pentland and his group for the Connection Science program. Please contact me at desheng at mit.edu for the MIT related project. Short Biography Desheng is an Associate Professor of Computer Science at Rutgers University and a Visiting Professor at MIT. Previously, Desheng was offered the Senseable City Consortium Postdoctoral Fellowship from MIT, and awarded his Ph.D in Computer Science from University of Minnesota. Desheng is interested in bridging Embedded AI, Cyber Physical Systems, Cyber Human Systems, Data Science, Machine Learning, and LLMs, in Extreme-Scale Data-Intensive Urban Infrastructure from an Interdisciplinary perspective with extensive applications from transportation, to communication, and sharing economy. He is focused on the life cycle of data-driven systems, from mobile sensing, to cross-domain data fusion and prediction, decision making, visual data analytics, system optimization and deployment. He strategically positions his research on Real-Time Interactions of Cross-Domain Urban Platforms and their human users, i.e., on-demand delivery (e.g., UberEat, Doordash, Instacart) transportation (e.g., taxis, buses, trucks, subways, bikes, personal & electric vehicles), telecommunication (e.g., cellphones), payment (e.g., smartcards), social networks (e.g., check-in and app logs). He has been investigating platforms across 8 cities on 3 continents with 100 thousand app users, 500 thousand vehicles, 10 million phones, 16 million smartcards, and 100 million residents involved. His technical contributions have led to more than 100 papers in premium CS venues, e.g., IMWUT/UbiComp, MobiCom, SIGCOMM, KDD, AAAI, IJCAI, SenSys, NSDI, ICDE, SIGSPATIAL, IPSN, ICCPS, BigData, RTSS, ICDCS. Desheng has been honored with 8 best paper/thesis/poster awards. During his free time, Desheng likes to travel. Here is a road map about cities he has been visited so far in US. During his free time, Desheng also likes to read non-fiction books. Here is a List of Six Recommended Books for 2020. Research Group At Rutgers Computer Science, Desheng is leading a research group called ARSENAL (shorted for AlgoRithms, SystEms, Networking, datA Lab) with 10 Ph.D. working on different subareas of CPS, Data Science, Ubiquitous and Mobile Sensing, HCI, Applied Machine Learning. News and Events 01.25: 1 Paper in WWW'25. 12.24: 1 Paper in AAAI'25. 12.24: My Ph.D Student Shuxin Zhong joined HKUST (GZ)! 11.24: 2 Papers in KDD'25. 11.24: 1 Paper in CSCW'25. 10.24: 1 Paper in EMNLP'24. 08.24: 1 Paper in SIGSPATIAL'24. 07.24: 8 Papers in CIKM'24. 06.24: 1 Paper in VLDB'24. 05.24: 2 Papers in ACM UBICOMP'24. 05.24: 2 Papers in KDD'24. 02.24: 1 Paper in WWW'24. 09.23: 1 Paper in VLDB'24. 08.23: 7 Papers in ACM CIKM'23. 05.23: 3 Papers in ACM SIGKDD'23. 04.23: 1 Paper in IJCAI'23. 02.23: 3 Papers in IEEE ICDE'23. 11.22: 3 Papers in ACM UBICOMP'22. 09.22: 2 Papers in ACM SIGSPATIAL'22. 08.22: 1 Paper in ACM CIKM'22. 07.22: My Visiting Ph.D Student Yi Ding joined MIT as a PostDoc in 2022 Fall! 07.22: My Ph.D Student Guang Wang joined Florida State University as an Assistant Professor of CS in 2022 Fall! 06.22: The Board of Trustees Research Award for Scholarly Excellence. 05.22: 1 Paper in ICDCS'22. 05.22: 1 Paper in ICDE'22. 05.22: 1 Paper in SIGKDD'22. 03.22: Serving on SenSys TPC. 09.21: RTSS Outstanding Paper Award. 07.21: NSF CAREER Award. 07.21: My Ph.D Student Guang Wang will join MIT as a PostDoc in 2021 Fall! 06.21: My Ph.D Student Yu Yang joined Lehigh University as an Assistant Professor of CS in 2021 Fall! 06.21: Invited Talk at CPS PI Meeting. 05.21: ACM ICCPS'21 Best Paper Award. 05.21: 2 Papers in SIGKDD'21. 04.21: ICCPS'21 Best Paper Nomination. 04.21: 1 Paper in SIGCOMM'21. 03.21: Serving as ICPADS TPC Co Chair. 02.21: Serving on SenSys TPC. 01.21: Publication Chair for UbiComp'21. 01.21: 1 Paper in ICCPS'21. 12.20: Associate Editor for ACM TOSN. 11.20: Our Smart City Project Featured in Rutgers Today. 10.20: 5 Papers accepted by UbiComp'21. 09.20: Starting my Sabbatical at MIT. 09.20: 1 Paper accepted by ICDE' 21. 07.20: NSF SCC Track1 Award (Lead PI). 07.20: NSF SCC Track2 Award (Co-PI). 07.20: 1 Paper accepted by NSDI' 21. 07.20: NSF CDS&E Award (Lead PI). 06.20: Google COVID-19 Grant (Lead PI) 06.20: 1 Paper accepted by MobiCom'20. 07.20: 1 Paper accepted by IROS'20. 04.20: Keynote at a WWW'20 workshop. 04.20: 5 Papers accepted by UbiComp'20. 02.20: Serving on SenSys TPC. 01.20: 1 Paper accepted by WWW'20. 12.20: Associate Editor for ACM IMWUT. 07.19: NSF CPS Award (Lead PI). 07.19: 5 Paper accepted by UbiComp'19. 04.19: NSF S&AS Award (Lead PI). 04.19: 1 Paper accepted by ICDCS'19. 01.19: 1 Paper accepted by WWW'19. 10.18: 2 Papers accepted by MobiCom'19. 09.18: 1 Paper accepted by RTSS'18. 09.18: 1 Paper accepted by SenSys'18. 09.18: 4 Papers accepted by UbiComp'18. 04.18: Rutgers Research Council Grant. 12.17: 1 Paper accepted by ICCPS'18. 11.17: Desheng gave a talk at Columbia U. 09.17: 1 Paper accepted by UbiComp'17. 04.17: Rutgers Global Grant. 08.16: Desheng joined the Computer Science Department at Rutgers. 02.16: Desheng gave a talk at CMU. 06.15: Desheng gave a talk at IBM. 05.15: Desheng gave a talk at MIT. 04.15: Desheng gave a talk at Microsoft. Funded Research Projects The research topics in Desheng's group cross the spectrum of Human Cyber-Physical Systems (HCPS) and Data Science from sensing, to prediction, to decision-making for various system properties and applications: Cross-Domain Human CPS with use cases in human mobility prediction and intervention Equity of Sociotechnical HCPS with use cases in city service conflict management Adaptability of Self-evolving HCPS with use cases in autonomous vehicles Privacy of Mobile HCPS with use cases in transportation, communication, and online platforms Interoperability of Heterogeneous HCPS with use cases in electric vehicles Safety of Mobile HCPS with use cases in micromobility platforms Recent Papers Wenjun Lyu, Shuxin Zhong, Guang Yang, Haotian Wang, Yi Ding, Shuai Wang, Yunhuai Liu, Tian He, and Desheng Zhang. InCo: Exploring Inter-Trip Cooperation for Efficient Last-mile Delivery. In ACM WWW'25. Guang Wang, Vivek Singh, and Desheng Zhang. A Mixed-Methods Study of Wait Time Perception and Discrepancy in Technology-Mediated Mobility Systems. In ACM CSCW'25. Shuxin Zhong, Kimberly Liu, Wenjun Lyu, Haotian Wang, Guang Wang, Yunhuai Liu, Tian He, Yu Yang, and Desheng Zhang. AdaService: Adaptive Multi-faceted Service Capabilities Co-Estimation for Nationwide Terminal Stations in Logistics. In AAAI'25. Qinchen Yang, Zhiqing Hong, Dongjiang Cao, Haotian Wang, Zejun Xie, Tian He, Yunhuai Liu, Yu Yang, and Desheng Zhang. AddrLLM: Address Rewriting via Large Language Model on Nationwide Logistics Data. In ACM KDD'25. Zejun Xie, Wenjun Lyu, Yiwei Song, Haotian Wang, Guang Yang, Yunhuai Liu, Tian He, Desheng Zhang, and Guang Wang. Scalable Area Difficulty Assessment with Knowledge-enhanced AI for Nationwide Logistics Systems. In ACM KDD'25. Hengyi Wang, Zhiqing Hong*, Shiwei Tan, Desheng Zhang, and Hao Wang. Variational Language Concepts for Interpreting Pretrained Language Models. In EMNLP'24. Jinquan Hang, Zhiqing Hong, Xinyue Feng, Guang Wang, Dongjiang Cao, Jiayang Qiao, Haotian Wang, and Desheng Zhang. Complex-Path: Effective and Efficient Node Ranking with Paths in Billion-Scale Heterogeneous Graphs. In VLDB'24. Sijing Duan, Feng Lyu, Xin Zhu, Yi Ding, Haotian Wang, Desheng Zhang, Xue Liu, Y.Zhang, and Ju Ren. VeLP: Vehicle Loading Plan Learning from Human Behavior in Nationwide Logistics System. In VLDB'24. Desheng Zhang. Mobile Cyber Physical Systems for Smart Cities. In ACM WWW'20 Workshop. Invited Keynote Yi Ding, Yu Yang, W.Jiang, Y.Liu, Tian He, Desheng Zhang. Nationwide Deployment and Operation of a Virtual Arrival Detection System in the Wild. In ACM SIGCOMM'21. [Paper] Yi Ding, Ling Liu, Yu Yang, Yunhuai Liu, Desheng Zhang and Tian He. From Conception to Retirement: a Lifetime Story of a 3-Year-Old Operational Wireless Beacon System in the Wild. In USENIX NSDI'21. [Paper] Yu Yang, Ding Yi, D.Yuan, Guang Wang, Xiaoyang Xie, Yunhuai Liu, Tian He and Desheng Zhang. TransLoc: Transparent Indoor Localization with Uncertain Human Participation for Instant Delivery. In ACM MobiCom'20. [Paper] Yu Yang, Xiaoyang Xie, Zhihan Fang, Fan Zhang, Yang Wang, and Desheng Zhang. VeMo: Enabling Transparent Vehicular Mobility Modeling at Individual Levels with Full Penetration. In ACM MobiCom'19. Guang Wang, Xiuyuan Chen, Fan Zhang, Yang Wang, and Desheng Zhang. Experience: Understanding Long-Term Evolving Patterns of Shared Electric Vehicle Fleets. In ACM MobiCom'19. Zhihan Fang*, Yu Yang*, Shuai Wang, B Fu, Z, Song, Fan Zhang, and Desheng Zhang. MAC: Measuring the Impacts of Anomalies on Travel Time of Multiple Transportation Systems. In ACM UbiComp'19. Shuai Wang, Tian He, Desheng Zhang, Y.Liu, Sang H. Son. Towards Efficient Sharing: A Usage Balancing Mechanism for Bike Sharing Systems. In WWW'19. Xiaoyang Xie, Zhihan Fang, Yu Yang, Yunhuai Liu, and Desheng Zhang. coSense: Collaborative Urban-Scale Vehicle Sensing based on Heterogeneous Fleets. In ACM UbiComp'19. Zhou Qin, Zhihan Fang, Yunhuai Liu, C",
  "content_length": 10313,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:23"
}