{
  "name": "Desh Ranjan",
  "homepage": "http://odu.edu/directory/people/d/dranjan",
  "status": "success",
  "content": "Desh Ranjan | Old Dominion University Skip to main content Desh Ranjan Professor Computer Science Desh Ranjan 757-683-7711 dranjan@odu.edu 3325 ENGR & COMP SCI BLDG NORFOLK, 23529 Education & Credentials Ph.D. in Computer Science, Cornell University, (1992) M.S. in Computer Science, Cornell University, (1990) Other in Computer Science, Indian Institute of Technology Kanpur, (1987) Research Contracts, Grants and Sponsored Research Ranjan, D. \"BPC-A: Computing Alliance for Hispanic-Serving Institutions\" $2,000,000. Federal. - Ranjan, D. \"An Innovative GPU-Optimized Multiscale Code for High-Fidelity Simulation of Collective Eects in Electron Beams\" $473,315. 2015 - 2018 Ranjan, D. \"ABI Innovation: Advanced Informatics and Eective Algorithms for Improved CryoEM Protein Structure Prediction and Density Analysis\" $589,703. 2014 - 2017 Ranjan, D. \"Advanced Phylogenomics of the Human and Animal Pathogen Mycobac- terium Marinum\" $100,000. 2014 - 2016 Ranjan, D. \"High-Performance Particle Collider Simulations on Parallel Computing Platforms\" $40,000. Old Dominion University. 2014 - 2016 Ranjan, D. \"Migration of Larc Codes To Next-Generation Hpc Architectures: GPU\" $23,660. Other. December 1, 2015 - November 30, 2016 Ranjan, D. \"Algorithms and Software Development for QCD computations on Xeon-Phi Architecture. 2014 - Ranjan, D. \"Doctoral Student support for computational physics\" $65,000. 2012 - Ranjan, D. \"AE: Computing Alliance for Hispanic-Serving Insitutions\" $2,000,000. Federal. 2009 - 2012 Ranjan, D. \"Collaborative Research: Learning Discrete Mathematics and Computer Science via Primary Historical Sources\" $500,000. Federal. 2008 - 2011 Ranjan, D. \"IGERT: Computational Molecular Biology Group\" $2,963,687. Federal. 2005 - 2010 Ranjan, D. \"Designing an effective real-time methodology to evaluate circadian rhythm in cultured breast cell lines\" $50,000. State. 2009 - 2009 Ranjan, D. \"CREST: Center for Research Excellence in Bioinformatics and Computational Biology\" $4,500,000. Federal. 2004 - 2009 Ranjan, D. \"Frameworks for the Development of Efficient and Scalable Knowledge-based Systems\" $1,500,000. Federal. 2003 - 2009 Ranjan, D. \"Bioinformatics Analysis for understanding Nitrogen Assimilation in Plants\" $50,000. State. 2007 - 2008 Ranjan, D. \"Graduate Assistants in Areas of National Need\" $495,840. Federal. 2003 - 2008 Ranjan, D. \"SBIR Phase II: Cheminformatics Teaching Tools for Cheminformatics Virtual Classroom\" $105,000. Federal. 2006 - 2007 Ranjan, D. \"CRI: Computing Support for the Next Generation Application-driven Delarative Programming Systems\" $102,879. Federal. 2005 - 2007 Ranjan, D. \"Improving Protein Secondary Structure Prediction using 3-dimensional Spatial Constraints of the Protein\" $122,000. Federal. 2005 - 2007 Ranjan, D. \"Phylogenetic predictions of the capabilities of novel biothreat agents\" $135,000. Federal. 2005 - 2007 Ranjan, D. \"Collaborative Research: The Impact of Rapid Anthropogenic Land Cover Change in the Chaco and Interior Atlantic Forest in Paraguay on Hantavirus Ecology\" $186,000. Federal. 2004 - 2007 Ranjan, D. \"Teaching Discrete Mathematics via Original Historical Sources\" $74,432. Federal. 2003 - 2006 Ranjan, D. \"Cellular and Molecular Interactions among Genes in Cerebellar Development over Time and Space\" $22,000. Federal. June 2006 - August 2006 Ranjan, D. \"Small angle x-ray scattering studies of lipi/cholesterol bilayers, aerogel biosensors, and nanocomposite thermites\" $26,000. Federal. June 2006 - August 2006 Expertise Research Interests Dr. Ranjan is primarily interested in the development of efficient algorithms and bioinformatics tools for solving biologically important problems. The scholar's more general research and teaching interests are in efficient data structure and algorithm design and analysis, computational complexity theory, parallel computation, discrete mathematics, and optimization and approximation Select Publications Articles Biswas, A., Ranjan, D., Zubair, M., Zeil, S., Al Nasr, K. and He, J. (2017). An effective computational method incorporating multiple secondary structure predictions in topology determination for cryo-EM images. IEEE/ACM transactions on computational biology and bioinformatics 14 (3) , pp. 578–586. Terzic, B., Majeti, R., Stefani, M., Godunov, A., Morozov, V., Arumugam, K., Lin, F., Satogata, T., Zubair, M., Cotnoir, C. and Ranjan, D. (2017). Long-Term Simulations of Beam-Beam Dynamics on GPUs. Warner, J. E., Zubair, M. and Ranjan, D. (2017). Near Real-Time Probabilistic Damage Diagnosis Using Surrogate Modeling and High Performance Computing. Biswas, A., Ranjan, D., Zubair, M. and He, J. (2015). A dynamic programming algorithm for finding the optimal placement of a secondary structure topology in Cryo-EM data. Journal of Computational Biology 22 (9) , pp. 837–843. Biswas, A., Gauthier, D., Ranjan, D. and Zubair, M. (2015). ISQuest: finding insertion sequences in prokaryotic sequence fragment data. Bioinformatics 31 (21) , pp. 3406–3412. Terzic, B., Hofler, A. S., Reeves, C. J., Khan, S. A., Krafft, G., Benesch, J., Freyberger, A. and Ranjan, D. (2014). Simultaneous optimization of the cavity heat load and trip rates in linacs using a genetic algorithm. Physical Review Special Topics-Accelerators and Beams 17 (10) , pp. 101003. Ranjan, D., He, J., Chen, L., Al Nasr, K. and Zubair, M. (2014). Solving the Secondary Structure Matching Problem in CryoEM De Novo Modeling using a Constrained K-shortest Path Graph Algorithm. IEEE/ACM Transactions on Computational Biology and Bioinformatics (1) , pp. 1. Dasari, N. Shailaja., Ranjan, D. and Zubair, M. (2013). High-performance implementation of planted motif problem on multicore and GPU. Concurrency and Computation: Practice and Experience 25 (10) , pp. 1340–1355. Barnett, J., Bezhanishvili, G., Leung, H., Lodder, J., Pengelley, D., Pivkina, I., Ranjan, D. and Zack, M. (2013). Primary historical sources in the classroom: Discrete mathematics and computer science. AMC 10 , pp. 12. Biswas, A., Si, D., Al Nasr, K., Ranjan, D., Zubair, M. and He, J. (2012). Improved efficiency in cryo-EM secondary structure topology determination from inaccurate data. Journal of bioinformatics and computational biology 10 (03) , pp. 1242006. Ranjan, D., Savage, J. and Zubair, M. (2012). Upper and lower I/O bounds for pebbling r-pyramids. Journal of Discrete Algorithms 14 , pp. 2–12. Ranjan, D. and Zubair, M. (2012). Vertex isoperimetric parameter of a computation graph. International Journal of Foundations of Computer Science 23 (04) , pp. 941–964. Barnett, J., Lodder, J., Pengelley, D., Pivkina, I. and Ranjan, D. (2011). Designing student projects for teaching and learning discrete mathematics and computer science via primary historical sources. Recent Developments in Introducing a Historical Dimension in Mathematics Education , pp. 189–201. Al Nasr, K., Ranjan, D., Zubair, M. and He, J. (2011). Ranking valid topologies of the secondary structure elements using a constraint graph. Journal of bioinformatics and computational biology 9 (03) , pp. 415–430. Ranjan, D. (2009). Counting Triangulations of a Convex Polygon. Resources for Teaching Discrete Mathematics: Classroom Projects, History Modules, and Articles (74) , pp. 209. Ranjan, D. (2009). Resources for Teaching Discrete Mathematics: Counting Triangulations of a Convex Polygon. Ranjan, D. (2008). Euclid’s Algorithm for the Greatest Common Divisor, www. cs. nmsu. edu/historical-projects/Projects/EuclidGCD. pdf. Citeseer. Barnett, J., Bezhanishvili, G., Leung, H., Lodder, J., Pengelley, D., Pivkina, I. and Ranjan, D. (2007). Collaborative Research: Learning Discrete Mathematics and Computer Science via Primary Historical Sources. Dubhashi, D., Jonasson, J. and Ranjan, D. (2007). Positive Influence and Negative Dependence. Combinatorics, Probability, and Computing 16 (1) , pp. 29-47. Dal Palu, A., Pontelli, E. and Ranjan, D. (2006). Sequential and Parallel Algorithms for the NCA Problem on Pure Pointer Machines. Theoretical Computer Science 352 (1-3) , pp. 108-135. Pontelli, E. and Ranjan, D. (2005). A Simple Optimal Solution for the Temporal Precedence Problem on Pure Pointer Machines. Theory of Computing Systems 38 (1) , pp. 115-130. Harary, F. and Ranjan, D. (2005). Identity Orientation of Complete Bipartite Graphs. Discrete Mathematics 290 (2/3) , pp. 173-182. Ranjan, D., Tang, D. and Malik, S. (2004). A Comparative Study of 2QBF Algorithms.. SAT 4 , pp. 323–328. Pontelli, E., Ranjan, D., Gupta, G. and Milligan, B. (2003). Design and implementation of a domain specific language for phylogenetic inference. Journal of bioinformatics and computational biology 1 (02) , pp. 201–230. Ranjan, D. and Pontelli, E. (2003). The level-ancestor problem on pure pointer machines. Information processing letters 85 (5) , pp. 275–283. Dal Palú, A., Pontelli, E. and Ranjan, D. (2002). An optimal algorithm for finding NCA on pure pointer machines. Algorithm Theory—SWAT 2002 , pp. 428–438. Pontelli, E., Ranjan, D. and Dal Palú, A. (2002). An optimal data structure to handle dynamic environments in non-deterministic computations. Computer Languages, Systems & Structures 28 (2) , pp. 181–201. Pontelli, E. and Ranjan, D. (2002). Ancestor problems on pure pointer machines. Lecture notes in computer science , pp. 263–277. Futamura, N., Aluru, S., Ranjan, D. and Hariharan, B. (2002). Efficient parallel algorithms for solvent accessible surface area of proteins. IEEE Transactions on Parallel and Distributed Systems 13 (6) , pp. 544–555. Iglesias, J. Raymundo., Gupta, G., Pontelli, E., Ranjan, D. and Milligan, B. (2001). Interoperability between bioinformatics tools: A logic programming approach. Lecture notes in computer science 1990 , pp. 153–168. Ranjan, D., Pontelli, E. and Gupta, G. (2000). Data structures for order-sensitive predicates in parallel nondeterministic systems. Acta Informatica 37 (1) , pp. 21–43. Ranjan, D., Pontelli, E., Gupta, G. and Longpré, L. (2000). The temporal ",
  "content_length": 29610,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:23"
}