{
  "name": "Despina Michael",
  "homepage": "https://www.cut.ac.cy/faculties/aac/mga/staff/elected-staff/despina.michael/?languageId=1",
  "status": "success",
  "content": "CYPRUS UNIVERSITY OF TECHNOLOGY ΕΛ EN 20 Years CUT myUni Library Faculties Faculty of Fine and Applied Arts Department of Multimedia and Graphic Arts Staff Elected Despina Michael - Grigoriou Faculties Faculty of Fine and Applied Arts Department of Multimedia and Graphic Arts Staff Elected Despina Michael - Grigoriou Despina Michael - Grigoriou Vice Chair, Associate Professor Department of Multimedia and Graphic Arts despina.michael@cut.ac.cy 25002183 https://ktisis.cut.ac.cy/cris/rp/rp03883 Despina Michael-Grigoriou is an Associate Professor at the Department of Multimedia and Graphic Arts of the Cyprus University of Technology and the founding director of the GET Lab - Microsoft Computer Games and Emerging Technologies Research Lab (getlab.org), which was established in 2012 with seed funding by Microsoft. She is also a Principal Investigator of the H2020-TEAMING-RISE project, with a budget of ~50M euros, which led to the establishment of the CYENS Centre of Excellence. Within the Centre she leads the Visual Sciences research pillar and the `Virtual Reality for Well-Being’ research group. She received her PhD in Computer Graphics [...]from the Computer Science Department of the University of Cyprus (2010) and she worked as a post-doctoral visitor at the EVENT Lab of the University of Barcelona (2011) specializing on experiments around Virtual Reality systems. She joined the Cyprus University of Technology in 2012 and served as a Lecturer (2012-2015) and as an Assistant Professor (2016-2020). Prior to that she held the position of a Lecturer at the University of Nicosia (2009-2011). Despina has received several awards and distinctions, including the Anita Borg scholarship awarded by Google (2008), best papers awards (VSMM 2014 & VS-GAMES 2014), a certification of top downloaded journal paper (CAVW 2018-2019) and a best poster audience choice award (ICAT-EGVE 2020). Her research interests are on Virtual Reality with current focus on Well-Being. She is an active member of the scientific community of Virtual Reality serving from several posts. She was the general chair of the international conference ICAT-EGVE 2018, she is a member of the ICAT steering committee (since 2018), the Eurographics Virtual Environments (EGVE) working group (since 2019) and of other professional bodies. She serves as a regular reviewer of leading international journals and conferences (e.g. VIRE journal, IEEE VR conference) and she has been involved in, participated or/and coordinated, more than fifteen EU and locally funded research projects and grants. Links: Personal website: http://getlab.org/despina/ Research Lab: http://getlab.org Despina Michael - Grigoriou Τεχνολογικό Πανεπιστήμιο Κύπρου Vice Chair, Associate Professor Despina Michael-Grigoriou is an Associate Professor at the Department of Multimedia and Graphic Arts of the Cyprus University of Technology and the founding director of the GET Lab - Microsoft Computer Games and Emerging Technologies Research Lab (getlab.org), which was established in 2012 with seed funding by Microsoft. She is also a Principal Investigator of the H2020-TEAMING-RISE project, with a budget of ~50M euros, which led to the establishment of the CYENS Centre of Excellence. Within the Centre she leads the Visual Sciences research pillar and the `Virtual Reality for Well-Being’ research group. She received her PhD in Computer Graphics from the Computer Science Department of the University of Cyprus (2010) and she worked as a post-doctoral visitor at the EVENT Lab of the University of Barcelona (2011) specializing on experiments around Virtual Reality systems. She joined the Cyprus University of Technology in 2012 and served as a Lecturer (2012-2015) and as an Assistant Professor (2016-2020). Prior to that she held the position of a Lecturer at the University of Nicosia (2009-2011). Despina has received several awards and distinctions, including the Anita Borg scholarship awarded by Google (2008), best papers awards (VSMM 2014 & VS-GAMES 2014), a certification of top downloaded journal paper (CAVW 2018-2019) and a best poster audience choice award (ICAT-EGVE 2020). Her research interests are on Virtual Reality with current focus on Well-Being. She is an active member of the scientific community of Virtual Reality serving from several posts. She was the general chair of the international conference ICAT-EGVE 2018, she is a member of the ICAT steering committee (since 2018), the Eurographics Virtual Environments (EGVE) working group (since 2019) and of other professional bodies. She serves as a regular reviewer of leading international journals and conferences (e.g. VIRE journal, IEEE VR conference) and she has been involved in, participated or/and coordinated, more than fifteen EU and locally funded research projects and grants. Links: Personal website:   http://getlab.org/despina/ Research Lab: http://getlab.org Κύπρος despina.michael@cut.ac.cy 25002183 STAFF SEARCH Academic Staff Administrative Staff Maps University Map Sitemap Virtual Tour Quick Links Student Login eLearning (Moodle) CUT Mail (students and staff on Office365) Password Reset Multi Factor Authentication (MFA) Απομακρυσμένη Πρόσβαση (VPN) cut-radio Intent Europe Direct green@cut Learning Development Network Personal Data Protection Policy Intranet Useful Videos Contact Details ΤΕΧΝΟΛΟΓΙΚΟ ΠΑΝΕΠΙΣΤΗΜΙΟ ΚΥΠΡΟΥ 30 Arch. Kyprianos Str. 3036 Limassol 2500 2500 2500 2750 administration@cut.ac.cy Copyright © 2025 CYPRUS UNIVERSITY OF TECHNOLOGY Contact About this website Cookie Policy Digital Logo Files Contact About this website Cookie Policy Digital Logo Files Copyright © 2025 CYPRUS UNIVERSITY OF TECHNOLOGY × Βοηθήστε μας να γίνουμε καλύτεροι! Ποιος ο σκοπός της επίσκεψης σας στο διαδικτυακό μας χώρο;  Ενδιαφέρον για προγράμματα σπουδών Ενδιαφέρον για ερευνητικά προγράμματα Ενδιαφέρον για εκδηλώσεις/ανακοινώσεις Ενδιαφέρον για θέσεις εργασίας Γενικό ενδιαφέρον για το Πανεπιστήμιο Ποια η ιδιότητα σας;  Υποψήφιος φοιτητής Υφιστάμενος φοιτητής Πανεπιστημιακό μέλος ΤΠΚ Πιθανός εξωτερικός συνεργάτης Επισκέπτης γενικού ενδιαφέροντος Ποιο το επίπεδο μόρφωσης σας;  Απόφοιτος Λυκείου Απόφοιτος Πανεπιστημίου/Κολλεγίου Μεταπτυχιακό Διδακτορικό Ποια η εργασιακή σας κατάσταση;  Μαθητής Φοιτητής Άνεργος Δημόσιος Υπάλληλος Ιδιωτικός Υπάλληλος Ποια η ηλικία σας;  15-18 19-25 26-30 30- Ευχαριστούμε για τα σχόλια σας! Ref. 1764565282259 SUBMIT Our website uses cookies Our website uses cookies to ensure its proper functionality, as described here. Agree Required cookies Analytics cookies Disagree Required cookies Analytics cookies Boηθήστε μας να γίνουμε καλύτεροι!",
  "content_length": 6644,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:22"
}