{
  "name": "Detlef Plump",
  "homepage": "https://www-users.cs.york.ac.uk/~det",
  "status": "success",
  "content": "q Home page of Detlef Plump Detlef Plump I am an Associate Professor in the Department of Computer Science at the University of York, where I am a member of the Automated Software Engineering research group. Current Research Students Robert Söldner: A Verification Assistant for Graph Programs PhD student since 2020 (part-time) Former Research Students Ziad Ismaili Alaoui: Speeding up Graph Programs MSc by Research thesis, 2025 Federico Vastarini: Random Graph Generation in Hyperedge Replacement Languages PhD thesis, 2024 Brian Courtehoute: Time and Space Complexity of Rule-Based Graph Programs PhD thesis, 2023 Gia Wulandari: Verifying Graph Programs with Monadic Second-Order Logic PhD thesis, 2021 Tim Atkinson: Evolving Graphs by Graph Programming PhD thesis, 2019 (co-supervised with Susan Stepney) Ivaylo Hristakiev: Confluence Analysis for a Graph Programming Language PhD thesis, 2017 Chris Bak: GP 2: Efficient Implementation of a Graph Programming Language PhD thesis, 2015 Chris Poskitt: Verification of Graph Programs PhD thesis, 2013 Mike Dodds: Graph Transformation and Pointer Structures PhD thesis, 2008 Sandra Steinert: The Graph Programming Language GP PhD thesis, 2007 Events TERMGRAPH 2026 - 14th International Workshop on Computing with Terms and Graphs (Part of FLoC 2026). Lisbon, Portugal, July 18-19 (tentative), 2026 ICGT 2026 - 19th International Conference on Graph Transformation. Rennes, France, June 29 - July 3, 2026 STAF 2026 - Federation of Conferences on Software Technologies: Applications and Foundations. Rennes, France, June 29 - July 3, 2026 ICGT 2025 - 18th International Conference on Graph Transformation. Koblenz, Germany, June 11-12, 2025 GCM 2025 - 16th International Workshop on Graph Computation Models. Koblenz, Germany, June 10, 2025 STAF 2025 - Federation of Conferences on Software Technologies: Applications and Foundations. Koblenz, Germany, June 10-13, 2025 ICGT 2024 - 17th International Conference on Graph Transformation. Twente, The Netherlands, July 10-11, 2024 GCM 2024 - 15th International Workshop on Graph Computation Models. Twente, The Netherlands, July 9, 2024 STAF 2024 - Federation of Conferences on Software Technologies: Applications and Foundations. Twente, The Netherlands, July 8-11, 2024 TERMGRAPH 2024 - 13th International Workshop on Computing with Terms and Graphs (Part of ETAPS 2024). Luxembourg City, Luxembourg, April 7, 2024 ICGT 2023 - 16th International Conference on Graph Transformation. Leicester, UK, July 19-20, 2023 GCM 2023 - 14th International Workshop on Graph Computation Models. Leicester, UK, July 18, 2023 STAF 2023 - Federation of Conferences on Software Technologies: Applications and Foundations. Leicester, UK, July 18-21, 2023 TERMGRAPH 2022 - 12th International Workshop on Computing with Terms and Graphs (Part of FLoC 2022). Haifa, Israel, August 1, 2022 ICGT 2022 - 15th International Conference on Graph Transformation. Nantes, France, July 7-8, 2022 GCM 2022 - 13th International Workshop on Graph Computation Models. Nantes, France, July 6, 2022 STAF 2022 - Federation of Conferences on Software Technologies: Applications and Foundations. Nantes, France, July 4-8, 2022 Publications Talks Dagstuhl Seminars and Summer Schools Teaching Further Activities Research Projects for PhD Students Former Programming Languages and Systems Research Group Contact Dr. Detlef Plump Department of Computer Science University of York Deramore Lane York YO10 5GH United Kingdom E-mail: detlef.plump at york.ac.uk Office: CSE/035",
  "content_length": 3530,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:24"
}