{
  "name": "Devan Ray Donaldson",
  "homepage": "https://devanraydonaldson.com",
  "status": "success",
  "content": "Devan Ray Donaldson, Ph.D. Devan Ray Donaldson, Ph.D. Devan Ray Donaldson, Ph.D.BIOGRAPHY INVITED TALKS & MEDIA PUBLICATIONS CV BIOGRAPHY INVITED TALKS & MEDIA PUBLICATIONS CV Throughout my 20+ year career at three leading iSchools (Indiana University, University of Michigan, UNC), I’ve championed diversity and student success while serving in progressive leadership roles—from graduate student board positions to faculty governance to program administration. As a proven student advocate, I have increased BIPOC enrollment in the MLS program by nearly 50% while contributing to over $14M in collaborative research initiatives and securing $500K+ in competitive federal funding and internal awards as PI/Co-PI. My fundraising experience spans two decades and reaches historic heights, delivering early board service results to recently securing $32K+ in corporate sponsorships as iConference 2025 Co-Chair—a 433% increase and the highest in the conference’s 20-year history. As Director of Indiana University Bloomington’s top-ranked Master of Library Science Program (No. 9, U.S. News & World Report) and Associate Professor in the Luddy School of Informatics, Computing, and Engineering, I drive strategic initiatives and build high-impact cross-institutional partnerships that expand access, advance equity, and strengthen academic excellence in library and information science. My scholarship focuses on digital curation, cultural heritage, research data management, and digital archives. I authored 25+ peer-reviewed publications in leading journals, including Scientific Data (Nature family). I presented my research 40+ times at world-renowned institutions in 15 countries and 21 states. By invitation, I delivered the 2021 keynote address at the United Nations Headquarters Dag Hammarskjöld Library. Recognized for leadership since my earliest years — from high school honors to university awards and international keynote invitations — I bring a lifelong trajectory of advancing institutions, mentoring emerging leaders, and shaping the future of library and information science. For example, in 2021-22, I was selected to participate in the Luddy Leadership Training Program, a dean-initiated program designed to prepare faculty members for administrative leadership positions. The comprehensive program covered organizational structure, financial management, hiring and tenure processes, diversity and inclusion leadership, and conflict resolution. Internationally, I serve as co-founder and co-chair of the Research Data Alliance (RDA) Early Career and Engagement Interest Group (ECEIG) and co-chair of the Repository Platforms for Research Data Interest Group (RPRDIG). The RDA is a global organization with over 20,000 members from 148 countries, dedicated to building the social and technical infrastructure to enable open sharing and reuse of research data. As a leader within this influential international community, I shape global conversations on data management practices, mentor emerging data professionals worldwide, and facilitate cross-continental collaborations that advance open science initiatives. Nationally, I serve on the NIH/NLM Special Emphasis Panel (2025-Present). I was appointed to the Biomedical Informatics, Library and Data Science (BILDS) Review Committee for the National Library of Medicine (2018-2021). For the ILS department, I have served as Chair of the ILS Curriculum Committee, the MLS Curriculum Review Task Force, and the Faculty Search Committee. For the Luddy School, I served on the Strategic Visioning Planning Committee and the Task Force on Diversity and Inclusion. I am currently serving a second three-year term on the Faculty Policy Committee. I am also a faculty co-advisor to the IU ColorStack chapter. ColorStack is a national organization dedicated to increasing the number of Black and Latinx computer science graduates pursuing careers in technology. As co-advisor to IU’s chapter, founded in 2023, I support students through professional development programming, industry connections, and community building initiatives designed to address the significant underrepresentation of Black and Latinx professionals in technology fields. I am a Bill Gates Millennium Scholar (2002-2015), a Horace H. Rackham Merit Fellow (2008-2015), an Edward Alexander Bouchet Graduate Honor Society Member since 2012, and a Research Data Alliance (RDA) US Data Share Fellow (2015-2016). I am a recipient of the Luddy Faculty Recognition Award (2024), the Indiana University Trustees Teaching Award (2017-2018), and the Champion of Inclusion Award (2016). I hold a Ph.D. in Information from the University of Michigan, a M.S. in Library Science from the University of North Carolina at Chapel Hill and a B.A. in History from the College of William and Mary in Virginia. In 2005, I studied abroad at Oxford University, Hertford College. I am deeply engaged in my community through church participation and creative pursuits. I enjoy attending performing arts events, sporting events, and spending time with family and friends. At Luddy School of Informatics, Computing, and Engineering (2025) Standing with iSchools Chair Dr. Gillian Oliver at iConference 2025 Standing with Beverly Jenkins, award-winning author and pioneer of African American historical romance, during Black History Month program hosted by the IU Neal-Marshall Black Culture Center Library (2025) Standing with Dr. Adam Jansen, State Archivist of Hawaii (2019) Standing with Sandra Day O’Connor, the first woman to serve on the Supreme Court of the United States, at a Friends of the Library Board fundraising event for Earl Gregg Swem Library at the College of William and Mary (2006) Devan Ray Donaldson, Ph.D. © All Rights Reserved.",
  "content_length": 5753,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:26"
}