{
  "name": "Devashish Gosain",
  "homepage": "https://www.devashishgosain.com",
  "status": "success",
  "content": "Home Devashish Gosain Assistant Professor, CSE, IIT BombayI am an associated researcher at Max Planck Institute of Informatics.I completed my PhD (in Network Security) from IIIT Delhi in 2020. Then, for two years, I worked as a postdoctoral researcher at the INET research group, Max Planck Institute of Informatics, Germany with Anja Feldmann. I completed my second postdoc  at the COSIC research group, KU Leuven, Belgium with Claudia Diaz.  For a stint, I worked as an assistant professor at BITS Pilani Goa. I am seeking motivated people to join my group as PhD, master's or undergraduate research students. Interested folks must see prospective students web page before applying. Thanks!Email IDs:   dgosain [at] cse.iitb.ac.in                     dgosain [at] mpi-inf.mpg.de PUBLICATIONS Latest Organizing Committee Member of IMPACT (co-located with NDSS 2025)Joined as assistant prof. at IIT BombayVice PC Chair PoPETS 2024Delivered a talk at IETF MAPRG session[Talk Abstract, Video Link]Paper accepted at PAM 2024Two papers accepted at IMC 2023Paper accepted at Usenix Security 2023Paper accepted at ICCCN 2023Paper accepted at PAM 2023Paper accepted at INFOCOM 2023Paper accepted at NDSS 2023Paper accepted at CCS 2022August 1st 2022: Joined KU Leuven as postdoctoral researcherReviewer ShadowTPC IMC 2022Reviewer ESORICS 2022Demo Paper accepted at ICNP 2021Paper accepted at WPES 2021 (colocated with CCS)Paper accepted at LCN 2021Paper accepted at AsiaCCS 2021Paper accepted at PETS 2021Paper accepted at LCN 2020Poster accepted at HotPets 2020Link to the posterNovember 1st 2020: Joined Max Planck Institite of Informatics as postdoctoral researcher12 August 2020: Successfully defended my PhD thesis. Committee: Prof. Amir Houmansadr, Dr. Amogh Dhamdhere‬ and Prof. Vinay J. RibeiroLink to my PhD thesisReviewer for IEEE AccessFebruary 2020: Submitted my PhD thesisWinter Sem 2019: Visiting scholar at Brigham Young University (BYU), USA in ISRL labAugust 2019: Successfully defended my PhD comprehensive exam Committee: Prof. Vinayak Naik, Prof. Pushpendra Singh (Internal examiners) and Prof. Angelos Keromytis (External examiner) List of Publications Out in the Open: On the Implementation of Mobile App Filtering in Indiaaccepted for publication in proceedings of Passive and Active Measurements (PAM) Devashish Gosain, Kartikey Singh, Rishi Sharma, Jithin S, Sambuddho, 2024 [link]Thou Shalt Not Reject: Analyzing Accept-Or-Pay Cookie Banners on the Webaccepted for publication in proceedings of Internet Measurement Conference (IMC).Authors: Ali Rasaii, Devashish Gosain and Oliver Gasser, 2023 [link]PTPerf: On the performance evaluation of Tor Pluggable Transportsaccepted for publication in proceedings of Internet Measurement Conference (IMC).Authors: Zeya Umayya, Dhruv Malik, Devashish Gosain, Piyush Kumar Sharma, 2023 [link]A Multi-perspective Study of User Perception and Expectation of Deniabilityaccepted for publication in proceedings of Usenix SecurityAuthors: Tarun Kumar Yadav, Devashish Gosain, Kent Seamons, 2023 [link]Predictable Internet Clients and In-Switch Deep Packet Inspectionaccepted for publication in proceedings of 32nd International Conference on Computer Communications and Networks (ICCCN)Authors: Sahil Gupta, Devashish Gosain, M Kwon, HB Acharya, 2023 [link]Exploring the Cookieverse: A Multi-Perspective Analysis of Web Cookies accepted for publication in proceedings of Passive and Active Measurements (PAM)  Authors: Ali Rasaii, Shivani Singh, Devashish Gosain, Oliver Gasser, 2023 [link]On the Anonymity of Peer-To-Peer Network Anonymity Schemes Used by Cryptocurrenciesaccepted for publication in proceedings of Network and Distributed Security Symposium (NDSS)Authors: Piyush Kumar Sharma, Devashish Gosain, Claudia Diaz, 2023 [link]DeeP4R: Deep Packet Inspection in P4 using Packet Recirculationaccepted for the publication in proceedings of International Conference on Computer Communications (INFOCOM)Authors: Sahil Gupta, Devashish Gosain, M Kwon, HB Acharya, 2023 [link]Automatic Detection of Fake Key Attacks in Secure Messagingaccepted for the publication in Proceedings of Conference on Computer and Communications Security (CCS)Authors: Tarun Kumar Yadav, Devashish Gosain, Amir Herzberg, Daniel Zappala, Kent Seamons, 2022 [link]MiXiM: Mixnet design decisions and empirical evaluationaccepted for the publication in Proceedings on Workshop on Privacy in the Electronic Society (WPES)Authors: Iness Ben Guirat, Devashish Gosain, Claudia Diaz, 2021 [link]Simple Deep Packet Inspection with P4accepted as a demo paper for the publication in Proceedings on International Conference on Network Protocols (ICNP)Authors: Sahil Gupta, Devashish Gosain, G Grigoryan, M Kwon, HB Acharya, 2021 [link]Telemetron: Measuring Network Capacity Between Off-Path Remote Hosts accepted for the publication in Proceedings on Local Computer Networks (LCN) Authors: Devashish Gosain, A. Jaiswal, HB Acharya, S. Chakravarty, 2021 [link]Camoufler: Accessing The Censored Web By Utilizing InstantMessaging Channelsaccepted for the publication in Proceedings on AsiaCCSAuthors: Piyush Kumar Sharma, Devashish Gosain, S. Chakravarty, 2021 [link]Too Close for Comfort: Morasses of (Anti-) Censorship in the Era of CDNsaccepted for the publication in Proceedings on Privacy Enhancing Technologies (PoPETS)Authors: Devashish Gosain, Mayank Mohindra, Sambuddho Chakravarty, 2021 [link]Maginot Lines and Tourniquets : On the Defendability of National Cyberspaceaccepted for the publication in Proceedings on Local Computer Networks Symposium (LCN).Authors: Devashish Gosain, Madhur Rawat, Piyush Kumar Sharma, H.B Acharya, 2020 [link]SiegeBreaker: An SDN Based Practical Decoy Routing System, accepted for the publication in Proceedings on Privacy Enhancing Technologies (PoPETS). Authors: Piyush Kumar Sharma, Devashish Gosain, Himanshu Sagar, Chaitanya Kumar, Aneesh Dogra, Vinayak Naik, H.B. Acharya, Sambuddho Chakravarty, 2020 [link] CAMP: cluster aided multi-path routing protocol for wireless sensor networks, accepted for the publication in Wireless Networks, Springer. Authors: Mohit Sajwan, Devashish Gosain, Ajay. K. Sharma, 2019 [link]Where The Light Gets In: Analyzing Web Censorship Mechanisms in Indiaaccepted for the publication in proceedings of Internet Measurement Conference (IMC).Authors: Tarun Kumar Yadav*, Akshat Sinha*, Devashish Gosain*, Piyush Sharma, Sambuddho Chakravarty, 2018. (*All authors have equal contributions.) [link]Hybrid energy-efficient multi-path routing for wireless sensor networks, accepted for the publication in Journal of Computers and Electrical Engineering, Elsevier. Authors: Mohit Sajwan, Devashish Gosain, Ajay. K. Sharma, 2018 [link]The Devil’s in The Details: Placing Decoy Routers in the Internetaccepted for the publication in proceedings of Annual Computer Security Applications Conference (ACSAC).  Authors: Devashish Gosain, Anshika Aggarwal, H. B. Acharya and Sambuddho Chakravarty, 2017 [link]Mending Wall: On the Implementation of Censorship in India (Best Student Paper Award) accepted for the publication in proceedings of EAI International Conference on Security and Privacy in Communication Networks (SECURECOMM). Authors: Devashish Gosain, Anshika Aggarwal, Sahil Shekhawat, H. B. Acharya and Sambuddho Chakravarty, 2017 [link]Few Throats to Choke: On the Current Structure of the Internetaccepted for the publication in proceedings of Local Computer Networks (LCN).Authors: H. B. Acharya*, Sambuddho Chakravarty* and Devashish Gosain*, 2017 (*All authors have equal contributions.) DSERR: Delay Sensitive Energy Efficient Reliable Routing Algorithm for wireless sensor networks, accepted for the publication in Wireless Personal Communication (WPC), Springer. Authors: Devashish Gosain, Itu Snigdh, Mohit Sajwan, 2017 [link]Analysis of scalability for routing protocols in wireless sensor networks, International Journal for Light and Electron Optics (Optik), Elsevier. Authors: Devashish Gosain, Itu Snigdh, 2016 [link]Optimal sink placement in backbone assisted wireless sensor networks, Egyptian Informatics Journal (EIJ), Elsevier. Authors: Itu Snigdh, Devashish Gosain, Nisha Gupta, 2016 [link]Energy Analysis for Trajectory based Sink Mobility in WSN, Procedia Computer Science, Elsevier. Authors: Itu Snigdh, Devashish Gosain, 2015 [link]Performance Comparison of Routing Protocols in Bipartite Wireless Sensor NetworkInternational Journal of Electrical and Computer Engineering (IJECE),Authors: Devashish Gosain, Itu Snigdh, 2015 [link] ‌Best AI Website Creator",
  "content_length": 8576,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:28"
}