{
  "name": "Devesh Tiwari",
  "homepage": "https://coe.northeastern.edu/people/tiwari-devesh",
  "status": "success",
  "content": "Devesh Tiwari - Northeastern University College of Engineering Download Devesh Tiwari Associate Vice Provost for Research Computing, Office of the Provost Associate Professor, Electrical and Computer Engineering Affiliated Faculty, Khoury College of Computer Sciences Contact d.tiwari@northeastern.edu 308 Dana 360 Huntington Ave Boston, MA 02115 Office 617.373.8999 Related Links Goodwill Computing Lab Research Focus High performance computing (HPC), Quantum Computing, and Sustainable Computing. Biography Research Publications Related News Toggle Accordion Biography About Professor Devesh Tiwari is the Associate Vice Provost for Research Computing at Northeastern University, where he provides university-level leadership and strategic vision for research computing across the global university system of Northeastern University. He is also the director of the Goodwill Computing Lab, where his research group is focused on making large-scale classical and quantum computing systems faster, cheaper, and environmentally more sustainable. Before joining academia, he worked as a research staff scientist at the Department of Energy (DOE) Oak Ridge National Laboratory. Devesh’s research group is recognized for pioneering research and translational contributions in the areas of HPC, quantum computing, and environmentally sustainable computing — often first-of-its kind experimental demonstration, production deployment, and large-scale open-source community datasets. His research has been recognized with multiple awards including NSF CAREER Award on quantum computing, IEEE/IFIP Dependability Rising Star Award, IEEE TCSC MCR Excellence in Research Award, Facebook/Meta Faculty Research Award, Northeastern COE Faculty Fellow Award, US DOE ORNL’s Lab-wide Outstanding Research Accomplishment Award Nomination, US DOE ORNL’s NCCS Division Director Appreciation Award, etc. His research group has produced four (14) award-winning or finalist papers at conferences such at SC, HPDC, IPDPS, DSN, DATE, HPEC, etc., with over 50 publications in all venues listed on csrankings.org. His group has a unique record of having more than two papers at the same conference edition at many conferences over the last ten years, including SC’24 (x4), SC’23 (x4), ASPLOS’24 (x3), HPDC’23 (x2), SC’22 (x2), ASPLOS’22 (x2), SC’21 (x2) FAST’20 (x3), SC’20 (x3), DSN’18 (x3), SC’17 (x2), SC’16 (x2), SC’15 (x4). For his teaching and mentoring efforts, he was awarded the Northeastern COE Martin Essigmann Outstanding Teaching Award, and Professor of the Year by the Northeastern University IEEE student chapter and has consistently received near-perfect teaching evaluation scores. His student advisees have received numerous prestigious awards including ACM-IEEE CS George Michael Memorial HPC Award (x2), ACM SIGHPC/Intel Computational & Data Science Fellowships Award, MLSys Rising Star Award (x2), University-wide and College-wide Outstanding Graduate Student Award in Research (x3), and Cadence Research Award.  His recent PhD students graduates are tenure-track faculty members at top CS departments in the country (e.g., Rice University, and University of Utah). He is the steering committee co-chair of ACM HPDC, and was elected to be on the SC (Supercomputing) steering committee (one of the largest annual CS conferences attended by over 10,000 researchers) – two of the topmost conferences in the HPC research area. He was recognized with the IEEE TPDS Editorial Excellence Award (twice) for his exceptional contributions to the TPDS journal as an editor. He was selected to be the Technical Program Committee Co-Chair for ACM HPDC and the overall technical Program Committee Co-Chair for IEEE IPDPS. In these roles, he has introduced several novel changes to the peer-review process which have persisted across years. Honors & Awards Recent Selected Awards and Recognitions IEEE TCSC MCR Research Excellence in Scalable Computing, 2024. Northeastern COE Martin W. Essigmann Outstanding Teaching Award, 2024. Editorial Excellence Award. IEEE Transactions of Parallel & Distributed Systems (TPDS) journal, 2024. Northeastern College of Engineering Faculty Fellow, 2023. National Science Foundation (NSF) CAREER Award, 2022. Facebook/Meta Research Award, 2022. Editorial Excellence Award. IEEE Transactions of Parallel & Distributed Systems (TPDS) journal, 2022. Program Chair Award, ACM HPDC Conference, 2022. Rising Star in Dependability Award, IEEE TC on Dependable Computing and Fault Tolerance, 2021. Professor of the Year Award, IEEE HKN Northeastern University Student Chapter, 2019. IEEE/IFIP DSN Conference Hall of Fame List, 2018. Best Paper Distinctions and Awards (over a dozen best paper distinctions) [SC’24] Best Student Paper Finalist (first of the four accepted papers), 37th IEEE/ACM SC Conference, 2024. [SC’24] Best Student Paper Finalist (second of the four accepted papers), 37th IEEE/ACM SC Conference, 2024. [SC’23] Best Paper Finalist, 36th IEEE/ACM SC Conference, 2023. [HPDC’23] Best Paper Award, Karsten Schwan Best Paper Award at The 32nd HPDC Conference, 2023. [DATE’22] Best Paper Award Finalist, IEEE DATE Conference, 2022. [HPEC’22] Outstanding Paper Award, 26th IEEE HPEC Conference, 2022. [HPEC’21] Outstanding Student Paper Award, 25th IEEE HPEC Conference, 2021. [SC’20] Best Paper Finalist, 33th IEEE/ACM SC Conference, 2020. [SC’20] Best Student Paper Finalist, 33th IEEE/ACM SC Conference, 2020. [ICCAD’20] Best Paper Finalist, 39th IEEE/ACM ICCAD Conference, 2020. [SC’16] Best Student Paper Finalist, 29th IEEE/ACM SC Conference, 2016. [DSN’14] Best Paper Finalist, 44th IEEE/IFIP DSN Conference, 2014. [SC’14] Best Paper Finalist, 27th IEEE/ACM SC Conference, 2014. [IPDPS’12] Best Paper Award Nominee, 26th IEEE IPDPS Conference, 2012. Leadership Positions Technical Community Leadership Steering Committee Co-Chair, ACM Symposium on High-Performance Parallel and Distributed Computing (HPDC). Steering Committee Member, ACM/IEEE Int’l Conference for High Performance Computing, Networking, Storage, and Analysis (SC ). Steering Committee Member, IEEE International Symposium on Workload Characterization (IISWC). Selected Journal Editorship Associate Editor, IEEE Transactions on Parallel and Distributed Systems (TPDS), 2020-present. Associate Editor, ACM Transactions on Architecture and Code Optimization (TACO), 2023-2024. Associate Editor, Journal of Parallel and Distributed Computing (JPDC), 2019-2024. Associate Editor, ACM Transactions on Storage (TOS), 2019-2024. Selected Conference Program Committee (PC) Chairship HIPC’24 PC Co-Chair, 31st IEEE International Conference on High Performance Computing, Data, and Analytics (HiPC), 2024. IPDPS’23 PC Co-Chair, 37th IEEE Int’l Parallel and Distributed Processing Symposium (IPDPS), 2023. HPDC’22 PC Co-Chair, 31st ACM Symposium on High-Performance Parallel and Distributed Computing (HPDC), 2022. IISWC’20 PC Co-Chair, 16th IEEE International Symposium on Workload Characterization (IISWC), 2020. Toggle Accordion Research Research Overview High performance computing (HPC), Quantum Computing, and Sustainable Computing. Selected Research Projects End‐to‐end Object‐focused Software‐defined Data Management for Science Principal Investigator, Department of Energy HARMONIA: New Methods for Colocating Multiple QoS-Sensitive Jobs – Principal Investigator, National Science Foundation REYAZ: Reliability-Aware Job Scheduling for HPC Systems – Principal Investigator, National Science Foundation FLECHA: Accurate and Efficient Fault Injection Methodologies for Large-Scale Parallel Programs – Principal Investigator, Department of Energy/Lawrence Livermore National Security, LLC MEWA: New Methods for Performance Benchmarking and Evaluation of Emerging Data-Intensive Workloads on Heterogeneous Computing Accelerators – Principal Investigator, Air Force Research Lab/MIT Lincoln Laboratory North East Storage Exchange – Principal Investigator, National Science Foundation/ Boston University Research Centers and Institutes Institute for Experiential AI Department Research Areas Computer Systems and Software Toggle Accordion Publications Selected Publications Quantum Computing [SC 2024 (a)] LexiQL: Quantum Natural Language Processing on NISQ-era Machines Sustainable Computing [SC 2024 (b)] ECO-LIFE: High-Performance and Carbon-Aware Serverless Workloads Scheduling via Multi-generation Hardware Toggle Accordion Related News Faculty Nov 25, 2025 ECE Research on Energy-Efficient Serverless Computing Recognized at SC25 ECE Associate Professor Devesh Tiwari’s research group received the Best Paper Finalist honor at The International Conference for High Performance Computing, Networking, Storage, and Analysis (SC25), the premier international conference for High Performance Computing (HPC). The paper, “GreenMix: Energy-Efficient Serverless Computing via Randomized Sketching on Asymmetric Multi-Cores,” presents a novel technique to significantly improve energy efficiency in modern serverless computing systems. Faculty Nov 12, 2025 Tiwari Nominated for 2025 HPCWire Readers’ Choice Award ECE Associate Professor Devesh Tiwari was nominated for the 2025 HPCWire Readers’ Choice Award in the category of Outstanding Leadership in HPC. Faculty Nov 10, 2025 Tiwari Receives 2025 HPE Faculty Excellence Award ECE Associate Professor Devesh Tiwari received the 2025 HPE Faculty Excellence Award for his innovative research. PhD Oct 01, 2025 Computer Engineering PhD Student Wins ACM/IEEE CS George Michael Memorial HPC Fellowship Ana Veroneze Solórzano, PhD’28, computer engineering, won the prestigious 2025 ACM/IEEE CS George Michael Memorial HPC Fellowship for broadening the societal impact of HPC using privacy-preserving and incentive-driven mechanisms. Faculty Sep 23, 2025 2025 Stanford University Annual Assessment of Author Citations The following COE professors are among the top scientists worldwide selected by Stanford University representing the top 2% of the most-cited scientists",
  "content_length": 12218,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:31"
}