{
  "name": "Devin J. Balkcom",
  "homepage": "http://www.cs.dartmouth.edu/~devin",
  "status": "success",
  "content": "Balkcom @ Dartmouth devin.balkcom@dartmouth.edu ECSC 109 I'm a professor in the Dartmouth Computer Science department, currently serving as department chair. I co-direct the Reality and Robotics Lab. Research I'm interested in efficient robot designs and motion. Research highlights include exact time-optimal motion for mobile robots, robot origami, knot-tying, laundry folding, and construction of interlocking structures. See the project pages for more detail: Tying: simple devices that tie knots Folding: robot origami and laundry folding Assembly: building robust structures from smaller components Geodesics: efficient motion and planning for robots Human motion: technology for teaching humans how to move Here are a few videos from our youtube channel: Publications 2024 Energy-optimal trajectories for skid-steer rovers Meysam Effati, Krzysztof Skonieczny, Devin J. Balkcom. Int. J. Robotics Res., 43(2):171–202, 2024. downloadable versionpublisher's versionBibTeX @article{Effati2024, author = \"Effati, Meysam and Skonieczny, Krzysztof and Balkcom, Devin J.\", title = \"Energy-optimal trajectories for skid-steer rovers\", journal = \"Int. J. Robotics Res.\", volume = \"43\", number = \"2\", pages = \"171–202\", year = \"2024\", url = \"https://doi.org/10.1177/02783649231216499\", doi = \"10.1177/02783649231216499\" } 2023 Buoyancy enabled autonomous underwater construction with cement blocks Samuel Lensgraf, Devin J. Balkcom, Alberto Quattrini Li. IEEE International Conference on Robotics and Automation, 2023. downloadable versionpublisher's versionBibTeX @inproceedings{Lensgraf2023, author = \"Lensgraf, Samuel and Balkcom, Devin J. and Li, Alberto Quattrini\", title = \"Buoyancy enabled autonomous underwater construction with cement blocks\", booktitle = \"{IEEE} International Conference on Robotics and Automation\", pages = \"5207–5213\", publisher = \"{IEEE}\", year = \"2023\", url = \"https://doi.org/10.1109/ICRA48891.2023.10160589\", doi = \"10.1109/ICRA48891.2023.10160589\" } LearnThatDance: Augmenting TikTok Dance Challenge Videos with an Interactive Practice Support System Powered by Automatically Generated Lesson Plans Julien Blanchet, Megan E. Hillis, Yeongji Lee, Qijia Shao, Xia Zhou, David J. M. Kraemer, Devin J. Balkcom. Adjunct Proceedings of the 36th Annual ACM Symposium on User Interface Software and Technology, UIST, 2023. downloadable versionpublisher's versionBibTeX @inproceedings{Blanchet2023a, author = \"Blanchet, Julien and Hillis, Megan E. and Lee, Yeongji and Shao, Qijia and Zhou, Xia and Kraemer, David J. M. and Balkcom, Devin J.\", title = \"LearnThatDance: Augmenting TikTok Dance Challenge Videos with an Interactive Practice Support System Powered by Automatically Generated Lesson Plans\", booktitle = \"Adjunct Proceedings of the 36th Annual {ACM} Symposium on User Interface Software and Technology, {UIST}\", pages = \"84:1–84:4\", publisher = \"{ACM}\", year = \"2023\", url = \"https://doi.org/10.1145/3586182.3615801\", doi = \"10.1145/3586182.3615801\" } StarBlocks: Soft Actuated Self-Connecting Blocks for Building Deformable Lattice Structures Luyang Zhao, Yijia Wu, Wenzhong Yan, Weishu Zhan, Xiaonan Huang, Joran W. Booth, Ankur Mehta, Kostas E. Bekris, Rebecca Kramer-Bottiglio, Devin J. Balkcom. IEEE Robotics Autom. Lett., 8(8):4521–4528, 2023. downloadable versionpublisher's versionBibTeX @article{Zhao2023, author = \"Zhao, Luyang and Wu, Yijia and Yan, Wenzhong and Zhan, Weishu and Huang, Xiaonan and Booth, Joran W. and Mehta, Ankur and Bekris, Kostas E. and Kramer{-}Bottiglio, Rebecca and Balkcom, Devin J.\", title = \"StarBlocks: Soft Actuated Self-Connecting Blocks for Building Deformable Lattice Structures\", journal = \"{IEEE} Robotics Autom. Lett.\", volume = \"8\", number = \"8\", pages = \"4521–4528\", year = \"2023\", url = \"https://doi.org/10.1109/LRA.2023.3284361\", doi = \"10.1109/LRA.2023.3284361\" } Automatic Generation and Teaching of Dance Lessons from Video Julien Blanchet, Megan E. Hillis, Yeongji Lee, Qijia Shao, Xia Zhou, David J. M. Kraemer, Devin J. Balkcom. Proceedings of the 24th International Workshop on Mobile Computing Systems and Applications, HotMobile 2023, 2023. downloadable versionpublisher's versionBibTeX @inproceedings{Blanchet2023, author = \"Blanchet, Julien and Hillis, Megan E. and Lee, Yeongji and Shao, Qijia and Zhou, Xia and Kraemer, David J. M. and Balkcom, Devin J.\", title = \"Automatic Generation and Teaching of Dance Lessons from Video\", booktitle = \"Proceedings of the 24th International Workshop on Mobile Computing Systems and Applications, HotMobile 2023\", pages = \"145\", publisher = \"{ACM}\", year = \"2023\", url = \"https://doi.org/10.1145/3572864.3581592\", doi = \"10.1145/3572864.3581592\" } 2022 Overlapping semantic representations of sign and speech in novice sign language learners Megan E Hillis annd Brianna Aubrey, Julien Blanchet, Qijia Shao, Xia Zhou, Devin Balkcom, David JM Kraemer. Proceedings of the Annual Meeting of the Cognitive Science Society, 2022. BibTeX @inproceedings{Hillis2022, author = \"annd Brianna Aubrey, Megan E Hillis and Blanchet, Julien and Shao, Qijia and Zhou, Xia and Balkcom, Devin and Kraemer, David JM\", title = \"Overlapping semantic representations of sign and speech in novice sign language learners\", booktitle = \"Proceedings of the Annual Meeting of the Cognitive Science Society\", year = \"2022\", pages = \"3346 – 3353\" } Extended abstract: Towards the autonomous underwater construction of cement block structures with free-floating robots Samuel Lensgraf, Amy Sniffen, Alberto Quattrini Li, Devin Balkcom. ICRA 2022 Construction Robotics Workshop, 2022. BibTeX @inproceedings{Lensgraf2022, author = \"Lensgraf, Samuel and Sniffen, Amy and Li, Alberto Quattrini and Balkcom, Devin\", title = \"Extended abstract: Towards the autonomous underwater construction of cement block structures with free-floating robots\", year = \"2022\", booktitle = \"ICRA 2022 Construction Robotics Workshop\" } Soft Lattice Modules That Behave Independently and Collectively Luyang Zhao, Yijia Wu, Julien Blanchet, Maxine Perroni-Scharf, Xiaonan Huang, Joran W. Booth, Rebecca Kramer-Bottiglio, Devin J. Balkcom. IEEE Robotics Autom. Lett., 7(3):5942–5949, 2022. downloadable versionpublisher's versionBibTeX @article{Zhao2022, author = \"Zhao, Luyang and Wu, Yijia and Blanchet, Julien and Perroni{-}Scharf, Maxine and Huang, Xiaonan and Booth, Joran W. and Kramer{-}Bottiglio, Rebecca and Balkcom, Devin J.\", title = \"Soft Lattice Modules That Behave Independently and Collectively\", journal = \"{IEEE} Robotics Autom. Lett.\", volume = \"7\", number = \"3\", pages = \"5942–5949\", year = \"2022\", url = \"https://doi.org/10.1109/LRA.2022.3160611\", doi = \"10.1109/LRA.2022.3160611\", timestamp = \"Mon, 08 Aug 2022 21:23:17 +0200\" } An Equivalent Time-Optimal Problem to find Energy-Optimal Paths for Skid-Steer Rovers Meysam Effati, Krzysztof Skonieczny, Tim Freiman, Devin J. Balkcom. IEEE/RSJ International Conference on Intelligent Robots and Systems, IROS, 2022, 2022. downloadable versionpublisher's versionBibTeX @inproceedings{Effati2022, author = \"Effati, Meysam and Skonieczny, Krzysztof and Freiman, Tim and Balkcom, Devin J.\", title = \"An Equivalent Time-Optimal Problem to find Energy-Optimal Paths for Skid-Steer Rovers\", booktitle = \"{IEEE/RSJ} International Conference on Intelligent Robots and Systems, {IROS}, 2022\", pages = \"13341–13346\", publisher = \"{IEEE}\", year = \"2022\", url = \"https://doi.org/10.1109/IROS47612.2022.9982069\", doi = \"10.1109/IROS47612.2022.9982069\", timestamp = \"Tue, 03 Jan 2023 14:18:59 +0100\" } 2021 Interlocking Block Assembly With Robots Yinan Zhang, Yotto Koga, Devin J. Balkcom. IEEE Trans Autom. Sci. Eng., 18(3):902–916, 2021. downloadable versionpublisher's versionBibTeX @article{Zhang2021, author = \"Zhang, Yinan and Koga, Yotto and Balkcom, Devin J.\", title = \"Interlocking Block Assembly With Robots\", journal = \"{IEEE} Trans Autom. Sci. Eng.\", volume = \"18\", number = \"3\", pages = \"902–916\", year = \"2021\", url = \"https://doi.org/10.1109/TASE.2021.3069742\", doi = \"10.1109/TASE.2021.3069742\", timestamp = \"Tue, 13 Jul 2021 13:26:51 +0200\" } Droplet: Towards Autonomous Underwater Assembly of Modular Structures Samuel E. Lensgraf, Amy Sniffen, Zachary Zitzewitz, Evan Honnold, Jennifer Jain, Weifu Wang, Alberto Quattrini Li, Devin J. Balkcom. Robotics: Science and Systems XVII, Virtual Event, July 12-16, 2021, 2021. downloadable versionpublisher's versionBibTeX @inproceedings{Lensgraf2021, author = \"Lensgraf, Samuel E. and Sniffen, Amy and Zitzewitz, Zachary and Honnold, Evan and Jain, Jennifer and Wang, Weifu and Li, Alberto Quattrini and Balkcom, Devin J.\", title = \"Droplet: Towards Autonomous Underwater Assembly of Modular Structures\", booktitle = \"Robotics: Science and Systems XVII, Virtual Event, July 12-16, 2021\", year = \"2021\", url = \"https://doi.org/10.15607/RSS.2021.XVII.054\", doi = \"10.15607/RSS.2021.XVII.054\" } Falling Into Place: Drop Assembly of Interlocking Puzzles Amy Sniffen, Zezhou Sun, Samuel E. Lensgraf, Emily Whiting, Alberto Quattrini Li, Devin Balkcom. Robotics: Science and Systems XVII, Virtual Event, July 12-16, 2021, 2021. downloadable versionpublisher's versionBibTeX @inproceedings{Sniffen2021, author = \"Sniffen, Amy and Sun, Zezhou and Lensgraf, Samuel E. and Whiting, Emily and Li, Alberto Quattrini and Balkcom, Devin\", title = \"Falling Into Place: Drop Assembly of Interlocking Puzzles\", booktitle = \"Robotics: Science and Systems XVII, Virtual Event, July 12-16, 2021\", year = \"2021\", url = \"https://doi.org/10.15607/RSS.2021.XVII.055\", doi = \"10.15607/RSS.2021.XVII.055\" } Soft Lattice Modules that Behave Independently and Collectively Luyang Zhao, Yijia Wu, Julien Blanchet, Maxine Perroni-Scharf, Xiaonan Huang, Joran W. Booth, Rebecca Kramer-Bottiglio, Devin J. Balkcom. Robotics and Automation Letters, 2021. downloadable versionBibTeX @article{Zhao2021, author = \"Zhao, Luyang and Wu, Yijia and Blanchet, Julien and Perroni{-}Scharf, Maxine and Huang, Xiaonan and Booth, Joran W. and Kramer{-}",
  "content_length": 45987,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:33"
}