{
  "name": "Devis Tuia",
  "homepage": "https://people.epfl.ch/devis.tuia",
  "status": "success",
  "content": "EPFL - Devis Tuia Données administratives Devis Tuia devis.tuia@epfl.ch +41 21 693 00 11 vCard Professeur associé, Laboratoire de science computationnelle pour l'environnement et l'observation de la Terre EPFL Valais WallisEPFL ENAC IIE ECEORoute des Ronquos 861951 Sion +41 21 693 00 11 Office: ALP 2 014 EPFL › ENAC › IIE › ECEO Site web: https://www.epfl.ch/labs/eceo/ Professeur associé, SSIE - Enseignement EPFL ENAC SSIE-GEGR B0 421 (Bâtiment GR)Station 21015 Lausanne +41 21 693 00 11 Office: GR B0 421 EPFL › ENAC › ENAC-SSIE › SSIE-ENS Professeur associé, EDCE - Enseignement +41 21 693 00 11 EPFL › VPA › VPA-AVP-DLE › AVP-DLE-EDOC › EDCE-ENS Membre de la commission du programme doctoral, Programme doctoral Génie civil et environnement +41 21 693 00 11 EPFL › VPA › VPA-AVP-DLE › AVP-DLE-EDOC › EDCE-GE Site web: https://go.epfl.ch/phd-edce Co-directeur, SSIE - Gestion +41 21 693 00 11 EPFL › ENAC › ENAC-SSIE › SSIE-GE Site web: https://ssie.epfl.ch/ Expertise Remote Sensing Image processing Image classification Biophysical parameters retrieval Pattern recognition Prix et distinctions Publications Enseignement et PhD Prix et distinctions Recognition of outstanding services in the International Society for Photogrammetry and Remote Sensing (ISPRS) 2022 IEEE 2024 Publications représentatives Perspectives in machine learning for wildlife conservation D. Tuia, B. Kellenberger, S. Beery, B. Costelloe, S. Zuffi, B. Risse, A. Mathis, M. W. Mathis et al. Published in Nature Communications in Deep learning for the Earth Sciences: A comprehensive approach to remote sensing, climate science and geosciences. G. Camps-Valls, D. Tuia, X. X. Zhu, M. Reichstein Published in Wiley in Towards a collective agenda on AI for earth science data analysis D. Tuia, R. Roscher, J. D. Wegner, N. Jacobs, X. X. Zhu, G. Camps-Valls Published in IEEE Geoscience and Remote Sensing Magazine in Detecting mammals in UAV images: Best practices to address a substantially imbalanced dataset with deep learning B, Kellenberger, D., Marcos, D., Tuia Published in Remote Sensing of Environment in RSVQA: visual question answering for remote sensing data S. Lobry, D., Marcos, J., Murray, D., Tuia Published in IEEE Transactions on Geoscience and Remote Sensing in Enseignement et PhD Current Phd Nina Marion Aurélia Van Tiel, Gianfranco Basile, Robin Zbinden, Giacomo Günter May, Valentin Alexandre Guy Gabeff, Chang Xu, Manon Béchaz, Hugo Laurent Pascal Porta, Li Mi, Jan Pisl, Valérie Zermatten, Filip Dorm Past Phd As Director Thiên-Anh Nguyen, Christel Tartini-Chappuis, Jonathan Sauder Past Phd As Codirector Timothée Produit, Matthew Josef Parkan Courses Eléments de géomatique ENV-140 Bases de la géomatique pour les ingénieur·e·s civil et en environnement. Présentation des méthodes d'acquisition, de gestion et de représentation des géodonnées. Apprentissage pratique avec des méthodes topométriques et d'imagerie du territoire. Frontiers of Deep Learning for Engineers CIVIL-611 Image processing for Earth observation ENV-540 Ce cours introduit les méthodes de traitement d'image satellitaire et aériennes. Nous allons réviser les différents systèmes existants et ensuite nous présenterons des approches de traitement d'images basées sur l'apprentissage machine et l'apprentissage profond. Sensing and spatial modeling for earth observation ENV-408 Les étudiants se familiariseront avec les processus de cartographie à partir d'images (orthophoto et MNT), ainsi qu'avec les méthodes pour monitorer de la surface terrestre par télédétection. Apprentissage automatique et géostatistique seront abordés pour modéliser la variabilité des processus. Back to top",
  "content_length": 3660,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:29"
}