{
  "name": "Dewei Yi",
  "homepage": "https://www.abdn.ac.uk/people/dewei.yi",
  "status": "success",
  "content": "Dr Dewei Yi | The University of Aberdeen Dr Dewei Yi Dr Dewei YiB.Sc.(Eng), M.Sc., Ph.D., FHEASenior Lecturer Accepting PhDs About Email Addressdewei.yi@abdn.ac.ukSchool/DepartmentSchool of Natural and Computing Sciences ORCiDResearchGateGoogle ScholarLinkedinPure Biography Prospective PhD students and academic visitors interested in Computer Vision, AI-enabled Healthcare, Hybrid Intelligent Systems and Robotics, Applied Machine Learning, Intelligent Vehicles, Medical Image Processing, Personalised Systems (e.g., healthcare and wellbeing), Vision-based Semantic Understanding, Remote Sensing, Precision agriculture, etc. are encouraged to contact me by email with your full CV. You will receive both high-level and in-depth technical guidance for high-quality research including prestigious journal publications. Dr Dewei Yi is now Senior Lecturer (associate professor), School of NCS, at University of Aberdeen (UoA), U.K. He received a PhD degree in the Department of Aeronautical and Automotive Engineering, Loughborough University, U.K. in 2018. He was awarded School Research Student Development Fund in 2017; From Jul/2019 to Jan/2020, Dr Yi worked as a research fellow of Warwick Manufacturing Group at University of Warwick. He has published about 40+ high-quality research papers including IEEE Transactions (10+), Transportation Research Part C: Emerging Technology(TRC), Computer Networks. He has also established a stable collaboration with several universities and institutes such as University of Warwick, Loughborough University, Aberystwyth University, NIAB-EMR, CABI, and AVL Powertrain Ltd. He also served as a Track co-chair for IEEE 96th Vehicular Technology Conference (VTC2022) and a guest editor of Electronics Journal. In addition, he also serves research community actively as a reviewer for several international journals, such as IEEE-TIE, IEEE-TVT, IEEE-TITS, TRC, and Accident Analysis and Prevention, and top conferences, such as IJCAI, ITS, and ICUAS. He is an Outstanding Reviewer for TRC; Research experiences 2023/08 - now: Senior Lecturer (Associate Professor), Department of Computing Science, University of Aberdeen, U.K. 2020/04 - 2023/07: Lecturer (Assistant Professor), Department of Computing Science, University of Aberdeen, U.K. Qualifications Fellow of HEA 2023 - AdvanceHE Internal Memberships Director of MSc AI ProgrammeDirector of MSc Robotics and AI Programme (in CS) Latest Publications SwinMas: Shifted Windows and Mask Unit Attention with Auxiliary Supervision for Medical Image Segmentation 2026 - PublishedLawal, M., Yi, D. Biomedical Signal Processing and Control, vol. 113, no. A, 108858Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1016/j.bspc.2025.108858[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/dbeab86d-092c-4229-8bda-2827bb43e6a6/downloadNear-infrared vascular image segmentation using multi-stage enhancement and TAU-Net 2025 - PublishedTian, Z., Liu, H., Ji, Q., Wang, S., Li, Q., Yi, D., Liu, X. Infrared physics & technology, vol. 148, 105875Contributions to Journals: Articles[ONLINE] https://www.sciencedirect.com/science/article/pii/S1350449525001689[ONLINE] DOI: https://doi.org/10.1016/j.infrared.2025.105875[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/8dc79eaa-0cae-4325-8111-f2cf74c50490/download[ONLINE] View publication in ScopusAn End-to-End System for Culturally-Attuned Driving Feedback using a Dual-Component NLG Engine 2025 - Accepted/In pressThompson, I. P., Yi, D., Reiter, E. Chapters in Books, Reports and Conference Proceedings: Conference ProceedingsCan Image Quality Assessment Help Medical Image Segmentation? 2025 - Accepted/In pressLawal, M., Sharma, P., Murchie, P., Yi, D. Chapters in Books, Reports and Conference Proceedings: Conference ProceedingsMobile Phone Sensor-based Nigerian Driving Dataset to Detect Alcohol-influenced Behaviours 2025 - Accepted/In pressThompson, I. P., Yi, D., Reiter, E. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/60e373a7-17ba-43a9-8063-80e438c79f1e/download View My Publications Research Research Overview AI-enabled Healthcare Embedded AI in Healthcare Hybrid Intelligent Systems and Robotics Applied Machine Learning Generalised AI Intelligent Vehicles Personalised Advanced Driver Assistance Systems (ADAS) Vision-based Semantic Understanding Remote Sensing Precision Agriculture Research Areas Accepting PhDs I am currently accepting PhDs in Computing Science. Please get in touch if you would like to discuss your research ideas further. Email Me Computing Science Supervising Accepting PhDsView Research Area Supervision My current supervision areas are: Computing Science. I have many PhD students working on AI, Computer Vision, and Machine Learning based projects, including brain-inspired machine learning, medical image processing, fairness in machine learning, explainable AI, personalised federated learning, knowledge graph, and natural language generation for driving safety. My graduated PhDs: Dr Debinal Bakyavathi Rajan Dr Sami Hamid Al Sulaimani Dr Adinath Abhimanyu Ghadage Funding and Grants PI (Aberdeen), Smartawl 5.0, Fisheries Innovation & Sustainability (FIS), £408K, April 2023 – September 2024. Co-PI (CS), Achieving Self-directed Integrated Cancer Aftercare (ASICA) In Melanoma: Developing And Enhancing The Intervention Using Evidence From The Pilot Study And Emergent Technologies, Cancer Research UK (CRUK), £794K(FEC). Co-PI (CS), The Personalised healthy ageing: AI-based approach to predicting changes in self-perception and the relationship to cognitive decline, UKRI BBSRC, £103K . PI (Aberdeen), Smartawl 4.0, Fisheries Innovation & Sustainability (FIS), £157K, October 2021 – March 2022. PI, Individual Facial Biological Age Estimate for Healthy Ageing (SF10206-57), Internal Funding to Pump-Prime Interdisciplinary Research and Impact, University of Aberdeen, 6,322.18 GBP, June 2021 - July 2021. Co-PI (CS), ASICA USA Pilot, CONVERGE award, $10,000, May 2023 – March 2024. Co-PI (CS), A pilot study to assess international potential for ASICA, Knowledge Exchange and Commercialisation (KEC) Award , £8,000. Teaching Teaching Responsibilities CS5060: Foundation of Artificial Intelligence CS5062: Machine Learning CS502K: Symbolic AI CS5917: Project in Artificial Intelligence CS5097: Introduction to Programming (Sep) CS5097, CS5098: Database Systems and Big Data CS551T: Project in Artificial Intelligence CS551M: MEng Project CS551N: Introduction to Programming (Jan) CS4594: Single Honours Erasmus Computing Project CS4525, CS4529: Single Honours Computing Project CS3028: Principles of Software Engineering CS3528: Software Engineering and Professional Practice Publications Page 1 of 6 Results 1 to 10 of 52 SwinMas: Shifted Windows and Mask Unit Attention with Auxiliary Supervision for Medical Image Segmentation 2026 - PublishedLawal, M., Yi, D. Biomedical Signal Processing and Control, vol. 113, no. A, 108858Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1016/j.bspc.2025.108858[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/dbeab86d-092c-4229-8bda-2827bb43e6a6/downloadNear-infrared vascular image segmentation using multi-stage enhancement and TAU-Net 2025 - PublishedTian, Z., Liu, H., Ji, Q., Wang, S., Li, Q., Yi, D., Liu, X. Infrared physics & technology, vol. 148, 105875Contributions to Journals: Articles[ONLINE] https://www.sciencedirect.com/science/article/pii/S1350449525001689[ONLINE] DOI: https://doi.org/10.1016/j.infrared.2025.105875[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/8dc79eaa-0cae-4325-8111-f2cf74c50490/download[ONLINE] View publication in ScopusAn End-to-End System for Culturally-Attuned Driving Feedback using a Dual-Component NLG Engine 2025 - Accepted/In pressThompson, I. P., Yi, D., Reiter, E. Chapters in Books, Reports and Conference Proceedings: Conference ProceedingsCan Image Quality Assessment Help Medical Image Segmentation? 2025 - Accepted/In pressLawal, M., Sharma, P., Murchie, P., Yi, D. Chapters in Books, Reports and Conference Proceedings: Conference ProceedingsMobile Phone Sensor-based Nigerian Driving Dataset to Detect Alcohol-influenced Behaviours 2025 - Accepted/In pressThompson, I. P., Yi, D., Reiter, E. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/60e373a7-17ba-43a9-8063-80e438c79f1e/downloadFish Detection and Size Estimation Using Curved Ellipse Modeling and Voting-Based Matching 2025 - Accepted/In pressMoorhead, C., Hua, Y., Yi, D., Li, Y., Fernandes, P. G. Chapters in Books, Reports and Conference Proceedings: Conference ProceedingsLabel-free Medical Image Quality Evaluation by Semantics-aware Contrastive Learning in IoMT 2025 - PublishedYi, D., Hua, Y., Murchie, P., Sharma, P. IEEE journal of biomedical and health informatics, vol. 29, no. 4, pp. 2335-2344Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1109/JBHI.2023.3340201[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/44bef647-55d9-4576-9330-5f25b452ed91/download[ONLINE] View publication in ScopusEnhanced Multi-Branch Learning for Long-Tailed Image Recognition 2025 - PublishedWang, J., Guo, Z., Yi, D., Hua, Y., Meng, Q. Multimedia Systems, vol. 31, 16Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1007/s00530-024-01542-2Control and Applications of Intelligent Unmanned Aerial Vehicles 2025 - PublishedYan, Y., Yi, D., Lu, H., Gao, L. Electronics (Switzerland), vol. 14, no. 2, 375Contributions to Journals: Editorials[ONLINE] DOI: https://doi.org/10.3390/electronics14020375[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/49465658-3b6f-411a-92cb-7181d1554dc8/download[ONLINE] View publication in ScopusPersonalised Multi-Task Federated Learning for Diabetic Retinopathy Medical Image Classification 2024 - Accepted/In pressLi, Y., Sharma, P., Leontidis, G., Yi, D. Contributions to Journals: Conference Articles[OPEN ACCESS] ",
  "content_length": 10372,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:33"
}