{
  "name": "Dexter Kozen",
  "homepage": "http://www.cs.cornell.edu/~kozen",
  "status": "success",
  "content": "Dexter Kozen's Home Page Skip to main content Search CS Search Cornell Contact Publications Courses Students Family & Fun Dexter Kozen's Home Page 2016 2004 1985 1970 Contact Publications Courses Students Family & Fun Dexter Kozen Joseph Newton Pew, Jr. Professor Emeritus PhD, Cornell University, 1977 Research interests: Logics and semantics of programming languages, algorithms and complexity, especially complexity of decision problems in logic and algebra, probabilistic computation. Contact Email Turn on JavaScript for email address Surface Mail Computer Science Department 436 Gates Hall Cornell University Ithaca, New York 14853-7501, USA Phone (607) 255-9209 work (607) 592-2437 cell (607) 255-9143 fax (is this even still a thing?) Office Hours Fall 2025 By appointment. For appointments, please contact Dexter. Publications Software ECC Project KAT Interactive Theorem Prover A \"lite\" version of the KAT Interactive Theorem Prover (OCaml) The CoCaml Project natural deduction interactive theorem prover for 1st order logic (OCaml) Other CV Cornell tech reports Errata: D. C. Kozen, Theory of Computation, Springer, 2006 Recent (and not so recent) Courses CS 100 S99 Introduction to Computing CS 410 F99 Data Structures CS 2111 F08 Programming Practicum CS 3110 S11 Data Structures and Functional Programming CS 2110 F11 Object-Oriented Programming and Data Structures CS 2800 F13 Discrete Structures CS 6820 F15 Design and Analysis of Algorithms CS 6810 S17 Theory of Computing CS 2112 F18 Object-Oriented Programming and Data Structures (Honors) CS 6860 S19 Logics of Programs CS 4820 F20 Introduction to Analysis of Algorithms CS 6110 S21 Advanced Programming Languages CS 6861 S24 Introduction to Kleene Algebra CS 4810 S25 Introduction to Theory of Computing Rhodes Hall Recent PhD Students Kamal Aboul-Hosn Jeff Hartline Alexa Sharp James Worthington Nikos Karampatziakis Jean-Baptiste Jeannin Konstantinos Mamouras Xiang Long Michael Roberts Pedro Amorim Shawn Ong Keri D'Angelo Family & Fun Frances Kozen Alexander Kozen Geoffrey Kozen Timothy Kozen Cornell Rugby Japan, January 2005 Germany, Denmark & Estonia, Summer 2006 CS2110 Games (Sudoku, Rubik's Cube) A slide show from my 60th birthday party Festschrift from my 60th birthday party [1] [2] [3] [4] [5] Some posters from recent musical performances Arts Quad ©2021 Cornell University",
  "content_length": 2360,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:34"
}