{
  "name": "Deyi Xiong",
  "homepage": "https://dyxiong.github.io",
  "status": "success",
  "content": "Deyi Xiong (熊德意) - Home Deyi Xiong (熊德意) Home Team Publications Activities Books Positions 中文 Professor TJUNLP Lab College of Intelligence and Computing, Tianjin University Building 55, Peiyang Park Campus, No.135 Yaguan Road, Haihe Education Park, Tianjin, 300350, China Email: dyxiong@tju.edu.cn Biography Deyi Xiong is a Professor of Computer Science at Tianjin University (TJU), Director of both the Natural Language Processing Laboratory at the College of Intelligence and Computing, TJU and the International Joint Research Center of Language Intelligence and Technology at TJU. Prior to joining TJU, he was a professor at Soochow University (2013-2018) and a research scientist at the Institute for Infocomm Research, Singapore (2007-2013). His research focuses on natural language processing, specifically machine translation, dialogue, natural language generation and question answering. He has published over 200 papers in prestigious journals and conferences, including Computational Linguistics, IEEE TPAMI, IEEE TASLP, Artificial Intelligence, AAAI, IJCAI ACL, and EMNLP. He is the first author of the book Linguistically Motivated Statistical Machine Translation: Models and Algorithms published by Springer and the Chinese book Neural Machine Translation: Foundations, Principles, Practices and Frontiers. He was the program co-chair of IALP 2021 and CWMT 2017. He has also served as an area chair of conferences including ACL, EMNLP, NAACL and COLING. He was the founder and co-organizer of multiple ACL/EMNLP/NAACL-affiliated workshops such as S2MT 2015, SedMT 2016 and DiscoMT 2019. He is an action editor of both TACL and ARR, associate editor of ACM TALLIP and session editor of Data in Brief. He was a council member of the Chinese and Oriental Languages Information Processing Society (COLIPS), Singapore and Honorary Treasurer of the Asian Federation of Natural Language Processing (AFNLP). He has been a council member of the Chinese Information Processing Society of China (CIPSC) since 2016. Last updated: Nov 30, 2024",
  "content_length": 2044,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:32"
}