{
  "name": "Dhananjay Phatak",
  "homepage": "http://www.csee.umbc.edu/~phatak",
  "status": "success",
  "content": "Dhananjay S. Phatak Dhananjay   S.   Phatak Professor Computer Science and Electrical Engineering Department University of Maryland, Baltimore County (UMBC) 1000 Hilltop Circle, Baltimore, MD 21250 Office: 327 Information Technology and Engineering (ITE) Building Phone: (410) 455-3624 Fax: (410) 455-3969 Email: phatak@umbc.edu Research Current Research Interests and Activities are in (in other words, My \"Eigenvalues\" currently span) the following areas Cyber Security a wide range of topics in security at-large including Computer/Network/System security, information assurance, security of hardware and designing hardware architectures for enhancing security, software security, malware, Virtualization and its impact on security and Digital Rights Management(DRM), Trust, security of Distributed Systems (DDoS attacks, defenses ....) On-going and recent-past Projects (a small sampling. also see the \"Publications\" and \"Patents\" links below) \"SMartER\" Power Grid The Spread Identity (SI) Paradigm for the Internet and Beyond Oblivious Data Processing for security in Cloud Computing. Virtualization (DRM, s/w licensing, security attributes of and mechanisms for virtual machines ....) Computer Arithmetic Algorithms, Architectures, and their VLSI Implementations Number Theory, Cryptology, efficient realization of cryptographic primitives I'd like to think that I am intellectually curious. I therefore investigate any problem that interests me... (another way of saying that I have an opinion on any/all subjects? ... just joking ...) If you are curious to find out what my own unique [un?|i]nformed-opinions/perspectives on vital issues such as \"sustainable-energy/global-warming ...\" etc., are; then please look at the following links: SMARTGREENS   2014 paper and the accompanying SMARTGREENS 2014   viewgraphs Past Research areas Mobile and High Performance Computing and Networks Neural Networks: Theory, Applications and Implementations Funding Grants Publications Software/Tools Teaching (parts are always under construction, like a perpetual motion machine !) Courses Graduate Advisees (Under Construction) (not so new) Computer Engineering Graduate Program (MS/PhD) web site Publications Patents Professional Activities Honors and Awards Misc:    My Erdös number is 2 For more information on what the Erdös number is all about, go to the Erdös number project website The last I checked; there is still no free lunch; please consider contributing to Wikipedia by clicking the button -----> Top Quotes    (David Letterman style) $$$ (is) >> GOD But; it depends on what the meaning of   \"is\" is. (arguably the most hil(l)ar[i|y]-ous and memorable quote of the decade of the 1990s...) But concatenting \"is\" to \"is\" (or fooling around, wasting time in the \"is\"es) leads to the deadly lethal evil we now know as \"ISIS\" Quiz : What is the second oldest profession? Folk Theorem : Earnings are inversely proportional to knowledge hint: use the folk-adages/identities (time = money) and (knowledge = power) and substitute (aka \"plug-into\") the real physical identity (power = work/time) Claim : Creator of life was extremely angry during the process of creation. Proof : The entire code book of life is full of a \"4 letter\" alphabet; { \"A\", \"C\", \"T\", \"G\" } Note the warning implicit in the selection of the letters : ACTG = \"ACT of the Gods\" Graduate school = wider perspective that includes Advisers along with Budweisers. ... deliberately left blank, you can fill-in whatever you want You know that I know what you know (Richard Feynman-esque...). This quote is useful after the first exam. I explain to the students that the exam is really not needed; just based on their interaction and behavior in class, I can figure out who knows what. CSEE Home Page Last update: November, 2016",
  "content_length": 3793,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:38"
}