{
  "name": "Dhiman Saha",
  "homepage": "http://dhimans.in",
  "status": "success",
  "content": "Dhiman Saha Hello Universe! Learn · Teach · Research I’m Dhiman Saha. I love computer science and crypto. I mostly work in symmetric crypto particularly cryptanlaysis. Recently I am focusing on : Automated Cryptanalysis Classical and Quantum Symmetric-Key Cryptanalysis Lightweight Cryptography Lattice Based Cryptography My research group calls itself the de.ci.phe.red LAB. news Nov 29, 2025 My research group is organizing the National Workshop on Cryptology 2025 from 7-9 December and a first of its kind Crypto Winter School 2025 from 9-12 December. Details are available at NWC and CWS respectively. Jun 18, 2025 Our paper titled Cryptanalysis of NLFSR-Based Lightweight Ciphers TinyJAMBU, KATAN, and KTANTAN has been accepted/published in IEEE Transactions on Information Theory. This is a joint work with Amit Jana (ISI Kolkata) and Mostafizar Rahman (University of Hyogo). Read more Jun 1, 2025 Our paper titled ToFA: Towards Fault Analysis of GIFT and GIFT-like Ciphers Leveraging Truncated Impossible Differentials has been accepted/published in TCHES 2025. This is a joint work with Anup Kumar Kundu (ISI Kolkata), Shibam Ghosh (University of Haifa/Inria), and Aikata Aikata (TU Graz). Read more Sep 13, 2024 Our paper titled Simple vs. vectorial: exploiting structural symmetry to beat the ZeroSum distinguisher has been accepted/published in Designs, Codes and Cryptography. This is a joint work with Sahiba Suryawanshi (IIT Bhilai), Shibam Ghosh (University of Haifa), and Prathamesh Ram (IIT Bhilai). Read more Aug 25, 2024 Our paper on Multiple-Tweak Differential Attack Against SCARF got accepted at ASIACRYPT 2024. This is a joint work with Christina (Université Paris Cité), Shahram (Ruhr University Bochum) and Yosuke (NTT Social Informatics Laboratories). Web selected publications ACNS TIDAL: Practical Collisions on State-Reduced Keccak Variants Suryawanshi, Sahiba, Saha, Dhiman, and Jaiswal, Shashwat In Applied Cryptography and Network Security - 21st International Conference, ACNS 2023, Kyoto, Japan, June 19-22, 2023, Proceedings 2023 Bibtex @inproceedings{Surya23, author = {Suryawanshi, Sahiba and Saha, Dhiman and Jaiswal, Shashwat}, title = {TIDAL: Practical Collisions on State-Reduced Keccak Variants}, booktitle = {Applied Cryptography and Network Security - 21st International Conference, {ACNS} 2023, Kyoto, Japan, June 19-22, 2023, Proceedings}, publisher = {Springer}, year = {2023}, selected = {true}, abbr = {ACNS} } JCEN Sycon: A New Milestone in Designing ASCON-like Permutations Mandal, Kalikinkar, Saha, Dhiman, Sarkar, Sumanta, and Todo, Yosuke Journal of Cryptographic Engineering 2021 Bibtex URL @article{Mandal2021, author = {Mandal, Kalikinkar and Saha, Dhiman and Sarkar, Sumanta and Todo, Yosuke}, title = {Sycon: {A} New Milestone in Designing ASCON-like Permutations}, journal = {Journal of Cryptographic Engineering}, volume = {2190-8516}, year = {2021}, url = {https://doi.org/10.1007/s13389-021-00272-9}, selected = {true}, abbr = {JCEN} } ToSC Boomeyong: Embedding Yoyo within Boomerang and its Applications to Key Recovery Attacks on AES and Pholkos Rahman, Mostafizar, Saha, Dhiman, and Paul, Goutam IACR Trans. Symmetric Cryptol. 2021 Bibtex @article{DBLP:journals/tosc/RahmanS021, author = {Rahman, Mostafizar and Saha, Dhiman and Paul, Goutam}, title = {Boomeyong: Embedding Yoyo within Boomerang and its Applications to Key Recovery Attacks on {AES} and Pholkos}, journal = {{IACR} Trans. Symmetric Cryptol.}, volume = {2021}, number = {3}, pages = {137--169}, year = {2021}, selected = {true}, abbr = {ToSC} } ePrint A Diagonal Fault Attack on the Advanced Encryption Standard Saha, Dhiman, Mukhopadhyay, Debdeep, and Chowdhury, Dipanwita Roy IACR Cryptol. ePrint Arch. 2009 Bibtex URL @article{DBLP:journals/iacr/SahaMC09, author = {Saha, Dhiman and Mukhopadhyay, Debdeep and Chowdhury, Dipanwita Roy}, title = {A Diagonal Fault Attack on the Advanced Encryption Standard}, journal = {{IACR} Cryptol. ePrint Arch.}, volume = {2009}, pages = {581}, year = {2009}, url = {http://eprint.iacr.org/2009/581}, timestamp = {Mon, 11 May 2020 01:00:00 +0200}, biburl = {https://dblp.org/rec/journals/iacr/SahaMC09.bib}, bibsource = {dblp computer science bibliography, https://dblp.org}, abbr = {ePrint}, selected = {true} } You can reach me at crypto@dhimans.in",
  "content_length": 4327,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:39"
}