{
  "name": "Dhiraj Sinha",
  "homepage": "https://plaksha.edu.in/faculty-details/dr-dhiraj-sinha",
  "status": "success",
  "content": "Dr. Dhiraj Sinha | Assistant Professor, Plaksha Careers at Plaksha Intranet Contact Us Public Self Disclosure Careers at Plaksha Intranet Contact Us Public Self Disclosure APPLY NOW BTech program MS in AI program About Us Vision & Mission Founders & Donors University Leadership Partnerships & Associations Academic Advisory Board Administration Statutory Bodies and Governance Newsletters Academics Academic Office (OAA) Harish and Bina Shah School of AI & Computer Science Academic Programs Undergraduate BTech in Computer Science & Artificial Intelligence BTech in Robotics & Autonomous Systems BTech in Biological Systems Engineering BTech in Data Science. Economics & Business Grand Challenge Scholars Program Graduate MS in AI PhD Program Tech Leaders Fellowship Summer Program Young Technology Scholars Young Data Scientists Teaching Labs & Centers Center for Thinking, Language and Communication Academic Calendar Admissions BTech Program Regular Admissions Transfer Admissions Young Technology Scholars Young Data Scientists PhD Program Scholarships & Financial Aid Merit Scholarship Need Based Financial Aid Awards SP Dutt Award Faculty Full Time Faculty Adjunct & Visiting Faculty Faculty Recruitment Research Research Institutes Binny Bansal Institute for Inventing the Future Research Centers Center for Clean Energy Center for Water Security Center for Thinking, Language and Communication Research Labs ARK Foundation Robotics Lab Plaksha Research Fellowship Life at Plaksha Gallery Well Being Campus & Spaces Axis Bank FutureTech Building DS Brar Center Student Careers Career Outcomes Placements Brochure Corporate Partnerships & Careers Office of Global Engagements Center for Entrepreneurship About Us Vision & Mission Founders & Donors University Leadership Partnerships & Associations Academic Advisory Board Administration Statutory Bodies and Governance Newsletters Academics Academic Office (OAA) Harish and Bina Shah School of AI & Computer Science Academic Programs Undergraduate BTech in Computer Science & Artificial Intelligence BTech in Robotics & Autonomous Systems BTech in Biological Systems Engineering BTech in Data Science. Economics & Business Grand Challenge Scholars Program Graduate MS in AI PhD Program Tech Leaders Fellowship Summer Program Young Technology Scholars Young Data Scientists Teaching Labs & Centers Center for Thinking, Language and Communication Academic Calendar Admissions BTech Program Regular Admissions Transfer Admissions Young Technology Scholars Young Data Scientists PhD Program Scholarships & Financial Aid Merit Scholarship Need Based Financial Aid Awards SP Dutt Award Faculty Full Time Faculty Adjunct & Visiting Faculty Faculty Recruitment Research Research Institutes Binny Bansal Institute for Inventing the Future Research Centers Center for Clean Energy Center for Water Security Center for Thinking, Language and Communication Research Labs ARK Foundation Robotics Lab Plaksha Research Fellowship Life at Plaksha Gallery Well Being Campus & Spaces Axis Bank FutureTech Building DS Brar Center Student Careers Career Outcomes Placements Brochure Corporate Partnerships & Careers Office of Global Engagements Center for Entrepreneurship Careers at Plaksha Intranet Contact Us Public Self Disclosure APPLY NOW BTech program MS in AI program Dhiraj Sinha Dhiraj Sinha Assistant Professor, Plaksha University PhD, University of Cambridge Area of Expertise: MEMS Sensors Technology Select About Research Publications About Dhiraj Sinha Dr. Dhiraj Sinha is an Assistant Professor at Plaksha University.  He studied electrical engineering at the Institute of Engineering and Technology, University of Lucknow, India and Telecommunications at ENST de Bretagne, Brest, France. He later earned a PhD in Electrical Engineering from University of Cambridge, UK. During the latter part of his stay at Cambridge and as the CTO of Smantenna Ltd, a thin film based antenna startup, he worked on research and commercialization of thin film based antennas. This was followed by a brief stint at Oscion, a technology consulting firm, following which he joined the Singapore University of Technology and Design, Singapore as a Research Fellow. Research Dr. Sinha's research interests are converged towards radiating structures with low degrees of freedom. He has explored ultra-small antenna design and sensing, besides investigating thermodynamics and electromagnetic field effects in microscopic systems with low dimensions. Publications Journal Papers:1. Dhiraj Sinha, Roland Bouffanais “Entropy Changes in Crystalline Material Under Phase Transition and SymmetryBreaking,” Physica A: Statistical Mechanics and its Applications 588, 126525, 2022 [Impact factor 3.778].2. Dhiraj Sinha, “Acoustic Magnetic Resonance Spectroscopy of Hydrogen Nuclei in Fluid,” Physica A: StatisticalMechanics and its Applications, 569, 125716 (2021) [Impact factor 3.778].3. Dhiraj Sinha, “Generation of Acoustic-Brownian Noise in Nuclear Magnetic Resonance Under Non-EquilibriumThermal Fluctuations” Scientific Reports, 10, 1-12 (2020) [Impact factor 4.996].4. Dhiraj Sinha, “Phase Space Trajectories Generated Under Coupling Between a Dynamic System and a ThermalReservoir” Journal of Physics Communications, 3, 125003 (2019) (Citescore 2.6).5. Dhiraj Sinha, “Loss of Invisibility in Metamaterials under Thermal Fluctuation Induced Radiation,” Annalen derPhysik, 531, 4, 1970019 (2019) (Impact factor 3.012) [Featured on the cover page of Journal].6. Dhiraj Sinha, Gehan Amaratunga, “The Noether Current in Maxwell’s Equations and Radiation under SymmetryBreaking,” Philosophical Transactions of the Royal Society A, 376, 20170452 (2018) (Invited paper Celebrating125 years of Oliver Heaviside’s ‘Electromagnetic Theory’: Physical Sciences Papers and Historical Perspectives)[Impact Factor: 4.019].7. Dhiraj Sinha, Omkar, “Falling Object Detection in Railway Track through Rayleigh Wave Sensing Using LaserVibrometer,” IEEE Transactions on Vehicular Technology, 67, 9158 (2018) [Impact Factor: 6.239].8. Dhiraj Sinha, “Spectral Symmetry Breaking of Electro-Acoustic Noise in Ferroelectric Materials,” Journal ofApplied Physics, 124, 4, 044103 (2018) [Impact Factor: 2.877].9. Dhiraj Sinha, Roland Bouffanais, and Shao Ying Huang, “Nonequilibrium Dielectric Noise in Solids in thePresence of Modulation of Electrical Permittivity and Spectral Symmetry Breaking Under Feedback,” New Journalof Physics, 19, 11, 113050 (2017) [Impact Factor: 3.874].10. Dhiraj Sinha, “Wireless Actuation of Piezoelectric Coupled Micromembrane Using Radio Frequency MagneticField for Biomedical Applications,” Journal of Applied Physics, 121, 134501 (2017) [Impact Factor: 2.877][Featured on the cover page of Journal].11. Dhiraj Sinha, Shao Ying Huang, “Selective polarization of Dielectric Materials Under Electromagnetic Scatteringat radio Frequency,” Journal of Applied Physics, 120, 074101 (2016) [Impact Factor: 2.877].12. Dhiraj Sinha, Farhan Feroz, “Obstacle Detection on Railway Tracks Using Vibration Sensors and Signal FilteringUsing Bayesian Analysis,” IEEE Sensors Journal, 16, 642, (2016) [Impact Factor: 4.325].13. Dhiraj Sinha, Gehan Amaratunga, “Electromagnetic Radiation Under Explicit Symmetry Breaking,” PhysicalReview Letters, 114, 147701 (2015) [Impact Factor: 9.185][Covered by more than 100 news portals includingIEEE Spectrum and Nikkei Electronics, the biggest media house for electronics in Japan].14. Dhiraj Sinha, Gehan Amaratunga, “Reply to Comments on Electromagnetic Radiation Under Explicit SymmetryBreaking,” Physical Review Letters, 114, 147701 (2015).15. Dhiraj Sinha, “Entropy Changes in a Thermodynamic System Under Potential Gradients,” Physica A: StatisticalMechanics and its Applications, 416, 676 (2014) [Impact Factor: 3.778].16. Dhiraj Sinha, Simone Pisana and Andrew J. Flewitt, “Radio Frequency Magnetic Field Detection UsingPiezoelectric Coupled Microcantilevers,” Smart Materials & Structures, 20, 025016 (2011) [Impact Factor: 4.131].(The first author is also the corresponding author in all the papers)4/6Conference:1. Dhiraj Sinha, ST Surendran “Signal Enhancement Under Explicit Field Perturbation in Magnetic ResonanceSpectroscopy,” Proc. Intl. Soc. Mag. Reson. Med 26, 4021 (2018).2. Dhiraj Sinha, Shao Ying Huang, “Miniaturized MRI System for Diagnosis of Samples of Low Physical Dimensionsusing Piezoelectric Receiver and Transmitter,” International Society for Magnetic Resonance in Medicine, AnnualMeeting (2016).3. Dhiraj Sinha, Shao Ying Huang, “Antenna Miniaturisation using Piezoelectric Material Based Thin Film Antennafor Body-centric Wireless Communication,” IEEE International Symposium on Radio-Frequency IntegrationTechnology, Taipei (2016).4. Dhiraj Sinha, “Electromagnetic Field Oscillations in Nucleic Acid Strand,” Frontiers in Optics/Laser Science,OSA (2007).Book:○ Dhiraj Sinha, Gehan Amaratunga, “Explicit Symmetry Breaking in Electrodynamic Systems and ElectromagneticRadiation,” Morgan Claypool, Institute of Physics UK Publishing, 2016. Research Interests Microelectromechanical systems (micromachines, sensors and actuators) Ultra-small antenna design for cellular technologies Thermodynamics and electromagnetic field effects in microscopic systems with low dimensions Past Associations Postdoctoral Research Associate, Massachusetts Institute of Technology Research Fellow, Singapore University of Technology and Design CTO of Smantenna Ltd Education PhD in Electrical Engineering, University of Cambridge, UK Facebook Twitter Instagram LinkedIn YouTube",
  "content_length": 9552,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:39"
}