{
  "name": "Dhrubajyoti Goswami",
  "homepage": "http://www.cs.concordia.ca/~goswami",
  "status": "success",
  "content": "Dhrubajyoti Goswami - Home page. Dr. Dhrubajyoti Goswami, P.Eng. Associate Professor Graduate Program Director (Course work and Diploma) Department of Computer Science and Software Engineering Concordia University, Montreal, Quebec Canada H3G 1M8 Phone: (514) 848-2424 Ext. 7882 Email: goswami(at)cs(dot)concordia(dot)ca Education: BSc Hons (Delhi), BE (Indian Institute of Science, Bangalore), MSc (McGill), PhD (Waterloo). Professional membership: Senior Member IEEE. Research Interests: Scalable parallel & distributed systems Parallel algorithms Teaching: COMP 228 : System Hardware COMP 346 : Operating Systems COMP 6281 : Parallel Programming COMP 5461 : Operating Systems COMP 444 : System Software Design COMP 428 : Parallel programming COMP 335: Theoretical Computer Science COMP 352 : Data Structures and Algorithms SOEN 423 : Distributed Systems SOEN 229 : System Software Coordination: COMP 346 : Operating Systems COMP 352: Data Structures and Algorithms COMP 5461: Operating Systems Publications: T. Ramburn and D. Goswami, “Improving Fault Tolerance in Blockchain Sharding using One-to-Many Block-to-Shard Mapping”. Accepted to the 2023 IEEE 35th International Symposium on Computer Architecture and High Performance Computing (SBAC-PAD 2023), Porto Alegre, Brazil, 17-20 October, 2023. T. Ramburn and D. Goswami, “SecurShard: A Model for Hierarchical Fault Detection in Blockchain Sharding”. Accepted to the IEEE International Conference on Blockchain and Cryptocurrency (IEEE ICBC'23), Dubai, UAE, May 1-5, 2023. T. Ramburn and D. Goswami, “FlexiShard: a Flexible Sharding Scheme for Blockchain based on a Hybrid Fault Model”. Accepted to the 21st IEEE International Symposium on Parallel and Distributed Computing (ISPDC 2022), July 11-13, 2022, Basel, Switzerland. (IEEE) S. Manoochehri, P. Cristofaro, and D. Goswami, “A Customizable Lightweight STM for Irregular Algorithms on GPU”. Accepted to the 27th International Workshop on High-Level Parallel Programming Models and Supportive Environments (HIPS 2022) held in conjunction with IPDPS 2022, May-June 2022. (IEEE) A. G. Krishnan and D. Goswami, “Multi-Stage Memory Efficient Strassen’s Matrix Multiplication on GPU”. Accepted to the 28th IEEE International Conference on High Performance Computing, Data, and Analytics (HiPC 2021), Bangalore, India, December 2021. (IEEE) Y. Zhang and D. Goswami, “Efficient Asynchronous GCN Training on a GPU Cluster”. Accepted to the 27th IEEE International Conference on Parallel and Distributed Systems (ICPADS 2021), Beijing, China, December 2021. (IEEE) S. Kantesariya and D. Goswami, “OptiShard: An Optimized and Secured Hierarchical Blockchain Architecture”. Accepted to Future Technologies Conference 2020 (FTC 2020), Vancouver, Canada, November 2020. (Springer) S. Kantesariya and D. Goswami, “Determining Optimal Shard Size in a Hierarchical Blockchain Architecture”. In the proceedings of the IEEE International Conference on Blockchain and Cryptocurrency (IEEE ICBC 2020), University of Toronto, May 2020. B. Goodarzi, F. Khorasani, V. Sarkar, and D. Goswami, “High Performance Multilevel Graph Partitioning on GPU”. In the proceedings of the 2019 International Conference on High Performance Computing & Simulation (HPCS 2019), Dublin, Ireland, July 2019. (IEEE press) S. Manoochehri, B. Goodarzi, and D. Goswami, “An Efficient Transaction-based GPU Implementation of Minimum Spanning Forest Algorithm”. In the proceedings of the 2017 International Conference on High Performance Computing & Simulation (HPCS 2017), Genoa, Italy, July 2017. (IEEE press) E. Cameron and D. Goswami, “Parallelizing Soft-Synths with Soft Real-Time Requirements”. In the proceedings of the 25th Euromicro International Conference on Parallel, Distributed and Network-based Processing (PDP 2017), St. Petersburg, Russia, March 2017. (IEEE press) U. Kabir and D. Goswami, “An ABFT Scheme Based on Communication Characteristics”. In the proceedings of the IEEE Cluster 2016, September 2016, Taipei, Taiwan. B. Goodarzi, M. Burtscher, and D. Goswami, “Parallel Graph Partitioning on a CPU-GPU Architecture”. In the proceedings of the IPDPS workshops, Chicago, USA, 2016. U. Kabir and D. Goswami, \"Identifying Patterns towards Algorithm Based Fault Tolerance\". In the proceedings of the13th International Conference on High performance Computing & Simulation (HPCS 2015), Amsterdam, the Netherlands. July 2015. (IEEE press) W. Zhang, D. Goswami, and B. Goodarzi, \"On the Dynamic Scheduling of Task Farm Patterns on a Heterogeneous CPU-GPGPU Environment\". In the proceedings of the 7th International C* Conference on Computer Science & Software Engineering, Montreal, Canada, pp. 55-61. August 2014. (ACM press) N. Balakrishnan, J. Gopinatha, D. Goswami. L. Shanker, \"Parallel computing strategies in the analysis of the inhibiting effect of price limits on futures prices\". Concurrency and Computation: Practice and Experience (Wiley), Volume 26, Issue 9, pp. 1666-1678, June 2014. W. AlBahnassi, D. Goswami, and S. P. Mudur, \"Arbiter Work Stealing for Parallelizing Games on Heterogeneous Computing Environments\". In the proceedings of the 21st High Performance Computing Symposium (HPC'13), April 7 - 10, 2013, San Diego, CA, USA. (ACM press) Z. Wei and D. Goswami, \"A Synchronization-Induced Checkpoint Protocol for Group-Synchronous Parallel Programs\". In the proceedings of the 13th International Conference on Parallel and Distributed Computing, Applications and Technologies (PDCAT 2012), Beijing, China, December 14-16, 2012. (IEEE press). W. AlBahnassi, S. P. Mudur, and D. Goswami, \"A Design Pattern for Parallel Programming of Games\". Accepted to AHPCN-2012 in conjunction with The 14th IEEE International Conference on High Performance Computing and Communications (HPCC-2012), 25-27 June, 2012, Liverpool, UK. Appeared in the proceedings, pp. 1007-1014 (IEEE CS press). N. Balakrishnan, G. Jakadeesan, D. Goswami, and L. Shanker, \"Analysis of the ex ante effect of price limits on futures prices\". Accepted for presentation at the Eastern Finance Association (EFA) Annual Meetings, Miami, Florida, USA, April 14-17, 2010. (Joint work with JMSB) G. Jakadeesan and D. Goswami, \"A Classification-Based Approach to Fault-Tolerance Support in Parallel Programs\". Accepted to the Tenth International Conference on Parallel and Distributed Computing, Applications and Technologies, Hiroshima, Japan, December 8-11, 2009. Appeared in the proceedings (IEEE CS Press). A. Beaudoin, D. Goswami and S. P. Mudur, \"Two-phase Load Distribution for Rendering Large 3D Models on a Graphics Cluster\". Accepted to IEEE Cluster 2009, New Orleans, USA, August 31-Sept 4, 2009. Appeared in the proceedings. M. M. Akon, D. Goswami, H. F. Li, X. Shen, A. Singh, \"A Novel Software-Built Parallel Machines and their Interconnections\". Appeared in Journal of Interconnection Networks, Vol. 9, issue 1/2, pp. 1-29, 2008. H. F. Li, Eslam AL Maghayreh and Dhrubajyoti Goswami, \"Detecting Atomicity Errors in Message Passing Programs\". Accepted to the Eighth International Conference on Parallel and Distributed Computing, Applications and Technologies, Adelaide, Austarlia, December 2007. Appeared in the proceedings, pp.193-200 (IEEE CS Press). H. F. Li, Eslam AL Maghayreh and Dhrubajyoti Goswami, \"Using Atoms to Simplify Distributed Programs Checking\". Accepted to the 3rd IEEE International Symposium on Dependable, Autonomic and Secure Computing (DASC'07), Columbia, MD, USA, September, 2007. Appeared in the proceedings, pp.75-83 (IEEE CS press). Zunce Wei, Hon F. Li and Dhrubajyoti Goswami, \"A Locality-Driven Atomic Group Checkpoint Protocol\". Accepted to Seventh International Conference on Parallel and Distributed Computing, Applications and Technologies, Taipei, Taiwan, December 2006. Appeared in the proceedings, pp. 558-564 (IEEE CS press). H. F. Li, Zunce Wei and D. Goswami, \"Quasi-atomic recovery for distributed agents\". Appeared in Parallel Computing (Elsevier). Vol. 32, No. 10, pp. 733-758, November 2006. Zunce Wei, Hon F. Li and Dhrubajyoti Goswami, \"Cloning-Based Checkpoint for Localized Recovery\". In the 2005 International Symposium on Parallel Architectures, Algorithms and Networks (I-SPAN 2005), December 7-9, 2005, Las Vegas, Nevada, USA, pp. 174-181 (IEEE CS press). M. M. Akon, D. Goswami, A. Singh and H. F. Li, \"Extensible Parallel Architectural Skeletons\". In the 12th IEEE International Conference on High Performance Computing (IEEE HiPC), Goa, India, December 18-21, 2005. Appeared in Lecture Notes in Computer Science (LNCS), Springer-Verlag, Vol. 3769. R. Rajagopalan, D. Goswami and S. P. Mudur, \"Distributed Point Rendering\". In the 12th IEEE International Conference on High Performance Computing (IEEE HiPC), Goa, India, December 18-21, 2005. Appeared in Lecture Notes in Computer Science (LNCS), Springer-Verlag, Vol. 3769. M. M. Akon, X. Shen, A. Singh, D. Goswami and H. F. Li, \"Developing High-Performance Parallel Applications Using EPAS\". In the Third International Symposium on Parallel and Distributed Processing and Applications (ISPA 2005), Nanjing, China, 2-5 Nov. 2005. Appeared in the Lecture Notes in Computer Science (LNCS), Springer-Verlag, Vol. 3758, pp. 431-441. M. M. Akon, D. Goswami and H. F. Li, \"A Model for Designing and Implementing Parallel Applications using Extensible Architectural Skeletons\". In the Eighth International Conference on Parallel Computing Technologies (PaCT-2005), Krasnoyarsk, Russia, September 2005. Appeared in Lecture Notes in Computer Science (LNCS), Springer-Verlag, Vol. 3606, pp. 367-380. R. Rajagopalan, D. Goswami and S. P. Mudur, \"Functionality Distribution for Parallel Rendering\". Accepted to the 19th IEEE International Parallel & Distributed Processing Symposium (IPDPS 2005), April 4-8, 2005, Denver, Colorado. Appeared in the proceedings. M. M. Akon, D. Goswami and H. F. Li, \"SuperPAS: A Parallel Architectural Skeleton Model Supporing Extensibility and Skeleton Composition\". Accepted to the Second Internatio",
  "content_length": 17314,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:43"
}