{
  "name": "Di Lin 0002",
  "homepage": "https://dilincv.github.io",
  "status": "success",
  "content": "IDV Lab Home Publication People Project Teaching IDV Lab Innovative Dimension Vision Lab, Tianjin University. Neural Information Processing Systems, 2025 Open-Vocabulary Part Segmentation via Progressive and Boundary-Aware Strategy ACM Transactions on Graphics (Proceedings of SIGGRAPH Asia), 2025 HRC-Net: Learning Visual Hypothesis, Representative, and Collaboration for Multi-Domain Image Inpainting IEEE Transactions on Industrial Informatics, 2025 Causal Counterfactual Faithfulness Generation for Open-Set Fault Diagnosis of Complex Industrial Processes IEEE International Conference on Computer Vision, 2025 NoiseController: Towards Consistent Multi-view Video Generation via Noise Decomposition and Collaboration Conference on Computer Vision and Pattern Recognition, 2025 Generative Hard Example Augmentation for Semantic Point Cloud Segmentation News Recruitment We are recruiting the self-motivated master, Ph.D. students, and postdoctoral researchers to work on interesting machine vision topics. If your feel interested, please send an email to Prof. Lin. See our works PBAPS is accepted at NeurIPS 2025. 19-Sep-2025 HRCNet is accepted at Siggraph Asia 2025. 11-Aug-2025 CCFG is accepted at TII 2025. 05-Aug-2025 NoiseController is accepted at ICCV 2025. 26-Jun-2025 GHEA is accepted at CVPR 2025. 27-Feb-2025 About Prof. Di Lin Di Lin Associate Professor Doctoral Advisor Building No.55, College of Intelligence and Computing, Tianjin University Ande.lin1988[at]gmail.com Google Scholar Di Lin is a tenured associate professor with the College of Intelligence and Computing, Tianjin University. He received a Ph.D. degree from the Computer Science and Engineering Department at the Chinese University of Hong Kong and a B.Eng. degree in software engineering at Sun Yat-Sen University, China. His research interests include computer vision and machine learning. He has been recognized as one of the Stanford/Elsevier World's Top 2% Scientists from 2022 to now. About IDV Lab People in IDV lab are excited about studying various vision tasks along innovative dimensions. Recently, we conduct research on:",
  "content_length": 2116,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:40"
}