{
  "name": "Di Liu 0002",
  "homepage": "https://www.ntnu.edu/employees/di.liu",
  "status": "success",
  "content": "Di Liu - NTNU Di Liu Download press photo Download press photo Foto: Close Di Liu Associate Professor Department of Computer Science Faculty of Information Technology and Electrical Engineering di.liu@ntnu.no +4773412014 419 IT-bygget Gløshaugen, Trondheim ResearchGate Google Scholar About CV Di Liu is an Associate Professor at Department of Computer Science, Norwegian University of Science and Technology (NTNU), Norway. In prior to that, he was a research fellow at Nanyang Technological University, Singapore and a faculty member at Yunnan University, China. He received his PhD degree from Leiden University, The Netherlands, and both his MEng and BEng degrees from Northwestern Polytechnical University, China. His research interests are edge intelligence and efficient AI. If you are interested in these areas and looking to work on an exciting master's project in this area, there may be several engaging opportunities available. Research His general research interests are edge intelligence, embedded systems, real-time scheduling. Efficient deep learning algorithms for edge systems Adaptive deep learning models for edge systems Hardware-aware deep learning model optimizations Computing Unit Publications 2025 Guan, Zhi-Qian; Liu, Jing; He, Zhenli; Miao, Shengfa; Liu, Di. (2025) Input-Aware Slowdown Backdoor Attack on Dynamic Neural Networks. Journal of Circuits, Systems and Computers Academic article Duan, Biqing; Wang, Qing; Liu, Di; Zhou, Wei; He, Zhenli; Miao, Shengfa. (2025) LODAP: On-device incremental learning via lightweight operations and data pruning. Journal of systems architecture Academic article Gong, Qianying; Duan, Biqing; Miao, Shengfa; He, Zhenli; Liu, Di. (2025) Software-Hardware Exploration of Early-Exit Neural Networks on Edge Accelerators. IEEE Embedded Systems Letters (ESL) Academic article 2024 Ahmed, Sadaqa,; Liu, Di. (2024) NTNU Open: Compressing CNN models for resource-constrained systems by channel and layer pruning. NTNU Norges teknisk-naturvitenskapelige universitet NTNU Norges teknisk-naturvitenskapelige universitet Masters thesis Luo, Xiangzhong; Liu, Di; Kong, Hao; Huai, Shuo; Xiong, Guochu; Liu, Weichen. (2024) Domino-Pro-Max: Toward Efficient Network Simplification and Reparameterization for Embedded Hardware Systems. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems Academic article Yu, Mingfang; Sun, Ying; Ma, Ruichen; Mu, Hailing; Liu, Di; Li, Zheng. (2024) YNU Flower: A market-oriented benchmark dataset for flower classification. Scientia Horticulturae Academic article Luo, Xiangzhong; Liu, Di; Kong, Hao; Huai, Shuo; Chen, Hui; Xiong, Guochu. (2024) Efficient Deep Learning Infrastructures for Embedded Computing Systems: A Comprehensive Survey and Future Envision. ACM Transactions on Embedded Computing Systems Academic article 2023 Huai, Shuo; Kong, Hao; Luo, Xiangzhong; Liu, Di; Subramaniam, Ravi; Makaya, Christian. (2023) On Hardware-Aware Design and Optimization of Edge Intelligence. IEEE design & test Academic article Li, Shiqing; Liu, Di; Liu, Weichen LiuDi. (2023) Efficient FPGA-Based Sparse Matrix-Vector Multiplication With Data Reuse-Aware Compression. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems Academic article He, Zhenli; Xu, Yanan; Liu, Di; Zhou, Wei; Li, Keqin. (2023) Energy-efficient computation offloading strategy with task priority in cloud assisted multi-access edge computing. Future Generation Computer Systems Academic article Ma, Ye-Da; Zhao, Zhi-Chao; Liu, Di; He, Zhenli; Zhou, Wei. (2023) OCAP: On-device Class-Aware Pruning for personalized edge DNN models. Journal of systems architecture Academic article Kong, Hao; Liu, Di; Huai, Shuo; Luo, Xiangzhong; Subramaniam, Ravi; Makaya, Christian. (2023) EdgeCompress: Coupling Multidimensional Model Compression and Dynamic Inference for EdgeAI. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems Academic article Zhang, Zhi-Yuan; Ren, Hao; He, Zhenli; Zhou, Wei; Liu, Di. (2023) Improving robustness of convolutional neural networks using element-wise activation scaling. Future Generation Computer Systems Academic article 2022 Huai, Shuo; Liu, Di; Kong, Hao; Liu, Weichen; Subramaniam, Ravi; Makaya, Christian. (2022) Latency-constrained DNN architecture learning for edge systems using zerorized batch normalization. Future Generation Computer Systems Academic article Journal publications Guan, Zhi-Qian; Liu, Jing; He, Zhenli; Miao, Shengfa; Liu, Di. (2025) Input-Aware Slowdown Backdoor Attack on Dynamic Neural Networks. Journal of Circuits, Systems and Computers Academic article Duan, Biqing; Wang, Qing; Liu, Di; Zhou, Wei; He, Zhenli; Miao, Shengfa. (2025) LODAP: On-device incremental learning via lightweight operations and data pruning. Journal of systems architecture Academic article Gong, Qianying; Duan, Biqing; Miao, Shengfa; He, Zhenli; Liu, Di. (2025) Software-Hardware Exploration of Early-Exit Neural Networks on Edge Accelerators. IEEE Embedded Systems Letters (ESL) Academic article Luo, Xiangzhong; Liu, Di; Kong, Hao; Huai, Shuo; Xiong, Guochu; Liu, Weichen. (2024) Domino-Pro-Max: Toward Efficient Network Simplification and Reparameterization for Embedded Hardware Systems. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems Academic article Yu, Mingfang; Sun, Ying; Ma, Ruichen; Mu, Hailing; Liu, Di; Li, Zheng. (2024) YNU Flower: A market-oriented benchmark dataset for flower classification. Scientia Horticulturae Academic article Luo, Xiangzhong; Liu, Di; Kong, Hao; Huai, Shuo; Chen, Hui; Xiong, Guochu. (2024) Efficient Deep Learning Infrastructures for Embedded Computing Systems: A Comprehensive Survey and Future Envision. ACM Transactions on Embedded Computing Systems Academic article Huai, Shuo; Kong, Hao; Luo, Xiangzhong; Liu, Di; Subramaniam, Ravi; Makaya, Christian. (2023) On Hardware-Aware Design and Optimization of Edge Intelligence. IEEE design & test Academic article Li, Shiqing; Liu, Di; Liu, Weichen LiuDi. (2023) Efficient FPGA-Based Sparse Matrix-Vector Multiplication With Data Reuse-Aware Compression. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems Academic article He, Zhenli; Xu, Yanan; Liu, Di; Zhou, Wei; Li, Keqin. (2023) Energy-efficient computation offloading strategy with task priority in cloud assisted multi-access edge computing. Future Generation Computer Systems Academic article Ma, Ye-Da; Zhao, Zhi-Chao; Liu, Di; He, Zhenli; Zhou, Wei. (2023) OCAP: On-device Class-Aware Pruning for personalized edge DNN models. Journal of systems architecture Academic article Kong, Hao; Liu, Di; Huai, Shuo; Luo, Xiangzhong; Subramaniam, Ravi; Makaya, Christian. (2023) EdgeCompress: Coupling Multidimensional Model Compression and Dynamic Inference for EdgeAI. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems Academic article Zhang, Zhi-Yuan; Ren, Hao; He, Zhenli; Zhou, Wei; Liu, Di. (2023) Improving robustness of convolutional neural networks using element-wise activation scaling. Future Generation Computer Systems Academic article Huai, Shuo; Liu, Di; Kong, Hao; Liu, Weichen; Subramaniam, Ravi; Makaya, Christian. (2022) Latency-constrained DNN architecture learning for edge systems using zerorized batch normalization. Future Generation Computer Systems Academic article Report Ahmed, Sadaqa,; Liu, Di. (2024) NTNU Open: Compressing CNN models for resource-constrained systems by channel and layer pruning. NTNU Norges teknisk-naturvitenskapelige universitet NTNU Norges teknisk-naturvitenskapelige universitet Masters thesis Teaching Courses TDT4186 - Operating Systems",
  "content_length": 7683,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:43"
}