{
  "name": "Di Wang 0017",
  "homepage": "https://stonebuddha.github.io",
  "status": "success",
  "content": "Di Wang Search Di Wang Assistant Professor Peking University Biography I am an Assistant Professor at Peking University’s School of Computer Science, a member of the Programming Languages Lab, and a research advisor of the Turing Program. My main interest is in programming languages in general, and formal verification, program analysis, and probabilistic programming in particular. My mission is to develop universal and easy-to-use abstractions and paradigms for programming safe and efficient software, and programming-language-level integrations to automatically analyze, optimize, and synthesize programs. Currently, I am working on resource-safe system programming, programmable Bayesian inference, quantitative program analysis, and proof-oriented programming languages. Before joining Peking University, I received my Ph.D. from Carnegie Mellon University under the supervision of Prof. Jan Hoffmann. Here is my Curriculum Vitae. News I am always looking for motivated students. Please take a look at this link if you are interested! [Aug 2025] A position paper on Composable Effect Handling for Programming LLM-integrated Scripts has been accepted to LMPL 2025. [Dec 2024] Our paper on Automatic Linear Resource Bound Analysis for Rust via Prophecy Potentials (with Qihao Lian) has been accepted to OOPSLA 2025. Cheers! [Jun 2024] Our papers on Programmable MCMC with Soundly Composed Guide Programs (with Long Pham, Feras Saad, and Jan Hoffmann) and Semantics Lifting for Syntactic Sugar (with Zhichao Guan, Yiyuan Cao, Tailai Yu, Ziheng Wang, and Zhenjiang Hu) has been conditionally accepted to OOPSLA 2024. [Jun 2024] Our paper on Formalizing, Mechanizing, and Verifying Class-based Refinement Types (with Ke Sun, Sheng Chen, Meng Wang, and Dan Hao) has been accepted to ECOOP 2024. [Jan 2024] Our article on Decomposition-Based Synthesis for Applying D&C-Like Algorithmic Paradigms has been accepted to TOPLAS. Older news can be found at this link. Teaching Spring 2025 Compiler Principles Honor Track (with Prof. Lu Zhang and Prof. Xianhua Liu) Design Principles of Programming Languages (with Prof. Haiyan Zhao) Fall 2024: Compiler Principles (with Prof. Lu Zhang and Prof. Xianhua Liu) Spring 2024 Compiler Principles (with Prof. Lu Zhang and Prof. Xianhua Liu) Design Principles of Programming Languages (with Prof. Haiyan Zhao) Fall 2023: Compiler Principles (with Prof. Lu Zhang and Prof. Xianhua Liu) Spring 2023: Design Principles of Programming Languages (with Prof. Haiyan Zhao) Service Program/Review Committee: 2026: OOPSLA 2026. POPL 2026. 2025: ECOOP 2025. ICALP 2025. TyDe 2025. 2024: OOPSLA 2024. PLDI 2024. 2023: ASE 2023. Students Houjin Chen Zimu Chen Changze Huang Qihao Lian Siyuan Zhu Jiayi Zhuang Recent Publications Di Wang (2025). Composable Effect Handling for Programming LLM-Integrated Scripts. In LMPL. TR Cite DOI Junyang Zhang, Xiangcan Xu, Yonghao Zou, Zhe Tang, Xinyi Wan, Kang Hu, Siyuan Wang, Wenbo Xu, Di Wang, Hao Chen, Lin Huang, Shoumeng Yan, Yuval Tamir, Yingwei Luo, Xiaolin Wang, Huashan Yu, Zhenlin Wang, Hongliang Tian, Diyu Zhou (2025). CortenMM: Efficient Memory Management with Strong Correctness Guarantees. In SOSP. Cite DOI Qihao Lian, Di Wang (2025). Automatic Linear Resource Bound Analysis for Rust via Prophecy Potentials. In OOPSLA. TR Cite Code DOI Artifact Long Pham, Di Wang, Feras A. Saad, Jan Hoffmann (2024). Programmable MCMC with Soundly Composed Guide Programs. In OOPSLA. Cite DOI Artifact Zhichao Guan, Yiyuan Cao, Tailai Yu, Ziheng Wang, Di Wang, Zhenjiang Hu (2024). Semantics Lifting for Syntactic Sugar. In OOPSLA. Cite Code DOI Artifact Ke Sun, Di Wang, Sheng Chen, Meng Wang, Dan Hao (2024). Formalizing, Mechanizing, and Verifying Class-based Refinement Types. In ECOOP. Cite DOI Artifact Di Wang, Thomas Reps (2024). Newtonian Program Analysis of Probabilistic Programs. In OOPSLA. TR Cite Code DOI Ruyi Ji, Yuwei Zhao, Yingfei Xiong, Di Wang, Lu Zhang, Zhenjiang Hu (2024). Decomposition-Based Synthesis for Applying Divide-and-Conquer-Like Algorithmic Paradigms. In TOPLAS. TR Cite DOI Hongjun Wu, Di Wang (2023). Worst-Case Analysis is Maximum-A-Posteriori Estimation. TR Ankush Das, Di Wang, Jan Hoffmann (2023). Probabilistic Resource-Aware Session Types. In POPL. Preprint TR Cite Code DOI See all publications Recent Talks Program Resource Analysis and Verification (In Chinese) Nov 30, 2024 3:10 PM — 3:35 PM Slides Programmable MCMC with Soundly Composed Guide Programs (In Chinese) Nov 15, 2024 9:20 AM — 9:40 AM Slides A Paradigm that Unifies Programming and Verification (In Chinese) Sep 3, 2024 2:40 PM — 3:20 PM Slides A Proof-Oriented Programming Language (In Chinese) Aug 9, 2024 4:30 PM — 5:00 PM Slides Newtonian Program Analysis of Probabilistic Programs Jul 2, 2024 11:30 AM — 12:30 PM Slides See all talks Recent Posts Bayesian Synthesis in OCaml This post aims at reproducing some results from Saad et al.’s paper on Bayesian synthesis1 in OCaml, an industrial strength functional programming language. A complete notebook for the code in this post can be found here. Di Wang Nov 30, 2022 7 min read A Casual Introduction to Bayesian Probabilistic Programming (In Chinese) 人们近年来在人工智能领域取得的进展，除了层出不穷的新算法，也 Di Wang Oct 30, 2022 4 min read A Casual Introduction to Algebraic Program Analysis (In Chinese) 本文参考了 Zachary Kincaid 和 Thomas Reps 在 CAV 2021 上的关于代数程序分析（Algebr Di Wang Oct 2, 2022 5 min read A Casual Introduction to Static Resource Analysis (In Chinese) 简单地说，程序的资源分析（Resource Analysis） Di Wang Sep 10, 2022 5 min read Easy Syntax Highlighting for LaTeX Tool link: Emacs Syntax Highlighting for LaTeX (ESH). The tool does not really require understanding Emacs: one just needs a working installation! The tool seems well tested on GNU/Linux; however, I am mainly using macOS, so I find out an easy workflow that works for me. Di Wang Jul 12, 2022 2 min read See all posts Contact wangdi95@pku.edu.cn Yanyuan Mansion 520, 151 Zhongguancun N Ave, Haidian District, Beijing 100084 Cite × Copy Download",
  "content_length": 6014,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:41"
}