{
  "name": "Di Wang 0015",
  "homepage": "https://shao3wangdi.github.io",
  "status": "success",
  "content": "Di Wang's Homepage Di Wang Email: di.wang@kaust.edu.sa Website: [PRADA Lab][Google Scholar] CV: CV (last updated in January, 2022) Address: Al Khawarizmi Building 1, Room 4243 Division of CEMSE King Abdullah University of Science and Technology Thuwal, Saudi Arabia, 23955-6900 We are Hiring! I am always looking for visiting scholars, Postdocs, PhD students, (remote) interns, and visiting students. If you are interested in working with me, please check our website and send me your CV and transcripts before applying. In the email, please mention the topics you want to work with our lab. Biography I am currently an Assistant Professor of Computer Science and an affiliated faculty of Statistics in the Division of Computer, Electrical and Mathematical Sciences and Engineering (CEMSE) at the King Abdullah University of Science and Technology (KAUST), start from Spring 2021. I am also the PI of Provable Responsible AI and Data Analytics (PRADA) Lab, and a member of Center of Excellence on Generative AI. Before that, I got my Ph.D degree in Computer Science at the State University of New York (SUNY) at Buffalo in 2020 under supervision of Dr. Jinhui Xu. Before my Ph.D study I took my Master degree in Mathematics at University of Western Ontario in 2015, and I received my Bachelor degree in Mathematics and Applied Mathematics at Shandong University in 2014. Research Areas Broadly speaking, I am interested in trustworthy machine learning, large models. Specifically, I am focusing on making Machine Learning and Generative AI have controllable and editable memorization (such as data, concept, and knowledge). Based on different projects, I am also working on AI for Science. Please see my Publications and Research for details. Data: differential privacy, machine unlearning, privacy-preserving machine learning Concept: explainability, fairness, concept editing Knowledge: knowledge editing News Opening Positions : I am always looking for visiting scholars, Postdocs, PhD students, (remote) interns, and visiting students. If you are interested in working with me, please send me your CV and transcripts before applying. Also check our website for details! News (November 2025) : One paper has been accepted at AAAI! News (October 2025) : One paper has been accepted at BIBM! News (September 2025) : Five papers have been accepted at NeurIPS! News (September 2025) : One paper has been accepted at Transactions on Machine Learning Research (TMLR)! News (August 2025) : Two papers have been accepted at Empirical Methods in Natural Language Processing (EMNLP 2025)! News (August 2025) : One paper has been accepted at Network and Distributed System Security Symposium (NDSS 2026)! News (July 2025) : One paper has been accepted at Transactions of the Association for Computational Linguistics (TACL)! News (July 2025) : Two papers have been accepted at the Conference on Language Modeling (CoLM 2025)! News (June 2025) : One paper has been accepted at the International Conference on Computer Vision (ICCV 2025)! News (June 2025) : One paper has been accepted at the IEEE/ACM International Conference on Software Engineering (ICSE 2026)! News (June 2025) : One paper has been accepted at The USENIX Security Symposium (USENIX Security 2025)! News (May 2025) : Two papers have been accepted at European Conference on Machine Learning (ECML 2025)! News (May 2025) : Four papers have been accepted at Annual Meeting of the Association for Computational Linguistics (ACL 2025)! News (May 2025) : One paper has been accepted at IEEE Transactions on Information Theory! News (May 2025) : One paper has been accepted at The Conference on Uncertainty in Artificial Intelligence (UAI 2025)! News (May 2025) : One paper has been accepted at IEEE Transactions on Information Forensics and Security! News (May 2025) : Two papers have been accepted at ICML 2025! News (April 2025) : One paper has been accepted at IJCAI 2025! News (April 2025) : One paper has been accepted at TKDE and TMLR! News (January 2025) : One paper has been accepted at WWW 2025, NAACL 2025, and TKDE! Awards Honorable Mention Paper Award, USENIX Security Symposium 2025 Best Paper Award, AAAI 2025 workshop on Connecting Low-Rank Representations in AI Best Paper Award, Asian Conference on Machine Learning 2022 Invited to The ACM Transactions on Database Systems special issue on Best of PODS 2022 CSE Best Doctoral Dissertation Award in 2020, SUNY at Buffalo SEAS Dean's Graduate Achievement Award in 2019, SUNY at Buffalo Best CSE Graduate Research Award in 2018, SUNY at Buffalo Top",
  "content_length": 4565,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:41"
}