{
  "name": "Di Yuan",
  "homepage": "https://katalog.uu.se/empinfo/?id=N15-9",
  "status": "success",
  "content": "Di Yuan - Uppsala universitet Di Yuan Professor i optimeringslära vid Institutionen för informationsteknologi; Datalogi Telefon: 018-471 44 15E-post: di.yuan@it.uu.seBesöksadress: Hus 10, Regementsvägen 10Postadress: Box 337751 05 UPPSALA Ladda ned kontaktuppgifter för Di Yuan vid Institutionen för informationsteknologi; Datalogi Akademiska meriter: Docent Kort presentation Min forskning består av tillämpad optimering in kommunikationssystem. Mina nuvarande forskningsprojekt handlar huvudsakligen om nätverksoptimering av 4G och 5G mobila system, kapacitetsoptimering av trådlösa nät, och optimal design av optiska nät. Jag arbetar även med optimal schemaläggning med tillämpningar inom transport. Jag är medlem i optimeringsgruppen och jag är kontaktperson for forskningsarena tillämpad optimering. Nyckelord network optimisationmathematical optimisationcommunication systems Publikationer Senaste publikationer Dynamic flexible flow shop scheduling via cross-attention networks and multi-agent reinforcement learning Zheng, Jinlong; Zhao, Yixin; Li, Yinya; Li, Jianfeng et al. Ingår i Journal of manufacturing systems, s. 395-411, 2025 DOI för Dynamic flexible flow shop scheduling via cross-attention networks and multi-agent reinforcement learning Online Learning for Intelligent Thermal Management of Interference-Coupled and Passively Cooled Base Stations Yu, Zhanwei; Zhao, Yi; Chu, Xiaoli; Yuan, Di Ingår i IEEE Transactions on Machine Learning in Communications and Networking, s. 64-79, 2025 DOI för Online Learning for Intelligent Thermal Management of Interference-Coupled and Passively Cooled Base Stations Ladda ner fulltext (pdf) av Online Learning for Intelligent Thermal Management of Interference-Coupled and Passively Cooled Base Stations Mobility-aware decentralized federated learning with joint optimization of local iteration and leader selection for vehicular networks Chen, Dongyu; Deng, Tao; Jia, Juncheng; Feng, Siwei et al. Ingår i Computer Networks, 2025 DOI för Mobility-aware decentralized federated learning with joint optimization of local iteration and leader selection for vehicular networks Learn to Stay Cool: Online Load Management for Passively Cooled Base Stations Yu, Zhanwei; Zhao, Yi; You, Lei; Yuan, Di Ingår i 2024 IEEE Wireless Communications and Networking Conference, WCNC 2024, s. 1-6, 2024 DOI för Learn to Stay Cool: Online Load Management for Passively Cooled Base Stations Multi-cell content caching: Optimization for cost and information freshness Yu, Zhanwei; Deng, Tao; Zhao, Yi; Yuan, Di Ingår i Computer Networks, 2024 DOI för Multi-cell content caching: Optimization for cost and information freshness Ladda ner fulltext (pdf) av Multi-cell content caching: Optimization for cost and information freshness Alla publikationer Artiklar i tidskrift Dynamic flexible flow shop scheduling via cross-attention networks and multi-agent reinforcement learning Zheng, Jinlong; Zhao, Yixin; Li, Yinya; Li, Jianfeng et al. Ingår i Journal of manufacturing systems, s. 395-411, 2025 DOI för Dynamic flexible flow shop scheduling via cross-attention networks and multi-agent reinforcement learning Online Learning for Intelligent Thermal Management of Interference-Coupled and Passively Cooled Base Stations Yu, Zhanwei; Zhao, Yi; Chu, Xiaoli; Yuan, Di Ingår i IEEE Transactions on Machine Learning in Communications and Networking, s. 64-79, 2025 DOI för Online Learning for Intelligent Thermal Management of Interference-Coupled and Passively Cooled Base Stations Ladda ner fulltext (pdf) av Online Learning for Intelligent Thermal Management of Interference-Coupled and Passively Cooled Base Stations Mobility-aware decentralized federated learning with joint optimization of local iteration and leader selection for vehicular networks Chen, Dongyu; Deng, Tao; Jia, Juncheng; Feng, Siwei et al. Ingår i Computer Networks, 2025 DOI för Mobility-aware decentralized federated learning with joint optimization of local iteration and leader selection for vehicular networks Multi-cell content caching: Optimization for cost and information freshness Yu, Zhanwei; Deng, Tao; Zhao, Yi; Yuan, Di Ingår i Computer Networks, 2024 DOI för Multi-cell content caching: Optimization for cost and information freshness Ladda ner fulltext (pdf) av Multi-cell content caching: Optimization for cost and information freshness Optimizing Resource Allocation and Request Routing for AI-Generated Content (AIGC) Services in Mobile Edge Networks With Cell Coupling Deng, Tao; Chen, Dongyu; Jia, Juncheng; Dong, Mianxiong et al. Ingår i IEEE Transactions on Vehicular Technology, s. 17911-17916, 2024 DOI för Optimizing Resource Allocation and Request Routing for AI-Generated Content (AIGC) Services in Mobile Edge Networks With Cell Coupling Caching With Personalized and Incumbent-Aware Recommendation: Modeling and Optimization Zhao, Yi; Yu, Zhanwei; Yuan, Di Ingår i IEEE Transactions on Mobile Computing, s. 9595-9613, 2024 DOI för Caching With Personalized and Incumbent-Aware Recommendation: Modeling and Optimization Task offloading optimization in mobile edge computing under uncertain processing cycles and intermittent communications Deng, Tao; Yu, Zhanwei; Yuan, Di Ingår i Computer Networks, 2024 DOI för Task offloading optimization in mobile edge computing under uncertain processing cycles and intermittent communications Optimal Content Caching and Recommendation With Age of Information Ahani, Ghafour; Yuan, Di Ingår i IEEE Transactions on Mobile Computing, s. 689-704, 2024 DOI för Optimal Content Caching and Recommendation With Age of Information Maximizing Value Yield in Wood Industry through Flexible Sawing and Product Grading Based on Wane and Log Shape Forghani, Kamran; Carlsson, Mats; Flener, Pierre; Fredriksson, Magnus et al. Ingår i Computers and Electronics in Agriculture, 2024 DOI för Maximizing Value Yield in Wood Industry through Flexible Sawing and Product Grading Based on Wane and Log Shape On optimization formulations for radio resource allocation subject to common transmission rate Zhao, Yi; Yuan, Di Ingår i Computers & Operations Research, 2024 DOI för On optimization formulations for radio resource allocation subject to common transmission rate Ladda ner fulltext (pdf) av On optimization formulations for radio resource allocation subject to common transmission rate Less Carbon Footprint in Edge Computing by Joint Task Offloading and Energy Sharing Yu, Zhanwei; Zhao, Yi; Deng, Tao; You, Lei et al. Ingår i IEEE Networking Letters, s. 245-249, 2023 DOI för Less Carbon Footprint in Edge Computing by Joint Task Offloading and Energy Sharing Ladda ner fulltext (pdf) av Less Carbon Footprint in Edge Computing by Joint Task Offloading and Energy Sharing Proteome deconvolution of liver biopsies reveals hepatic cell composition as an important marker of fibrosis Handin, Niklas; Yuan, Di; Olander, Magnus; Wegler, Christine et al. Ingår i Computational and Structural Biotechnology Journal, s. 4361-4369, 2023 DOI för Proteome deconvolution of liver biopsies reveals hepatic cell composition as an important marker of fibrosis Ladda ner fulltext (pdf) av Proteome deconvolution of liver biopsies reveals hepatic cell composition as an important marker of fibrosis Scheduling for Multi-Cell Caching: Hit Maximization Subject to Age of Information Deng, Tao; Yu, Zhanwei; Yuan, Di Ingår i IEEE Transactions on Vehicular Technology, s. 12441-12446, 2023 DOI för Scheduling for Multi-Cell Caching: Hit Maximization Subject to Age of Information Resource Optimization With Interference Coupling in Multi-RIS-Assisted Multi-Cell Systems Yu, Zhanwei; Yuan, Di Ingår i IEEE OPEN JOURNAL OF VEHICULAR TECHNOLOGY, s. 98-110, 2022 DOI för Resource Optimization With Interference Coupling in Multi-RIS-Assisted Multi-Cell Systems Ladda ner fulltext (pdf) av Resource Optimization With Interference Coupling in Multi-RIS-Assisted Multi-Cell Systems QoS Aware Robot Trajectory Optimization With IRS-Assisted Millimeter-Wave Communications Tatino, Cristian; Pappas, Nikolaos; Yuan, Di Ingår i IEEE Open Journal of the Communications Society, s. 1323-1336, 2022 DOI för QoS Aware Robot Trajectory Optimization With IRS-Assisted Millimeter-Wave Communications Ladda ner fulltext (pdf) av QoS Aware Robot Trajectory Optimization With IRS-Assisted Millimeter-Wave Communications Energy-Efficient Joint Task Assignment and Power Control in Energy-Harvesting D2D Offloading Communications Hamdi, Monia; Ben Hamed, Aws; Yuan, Di; Zaied, Mourad Ingår i IEEE Internet of Things Journal, s. 6018-6031, 2022 DOI för Energy-Efficient Joint Task Assignment and Power Control in Energy-Harvesting D2D Offloading Communications Optimal Scheduling of Age-centric Caching: Tractability and Computation Ahani, Ghafour; Yuan, Di; Sun, Sumei Ingår i IEEE Transactions on Mobile Computing, s. 2939-2954, 2022 DOI för Optimal Scheduling of Age-centric Caching: Tractability and Computation A Note on Decoding Order in User Grouping and Power Optimization for Multi-Cell NOMA With Load Coupling You, Lei; Yuan, Di Ingår i IEEE Transactions on Wireless Communications, s. 495-505, 2021 DOI för A Note on Decoding Order in User Grouping and Power Optimization for Multi-Cell NOMA With Load Coupling Delivering more to cell edge via joint multi-cell non-orthogonal multiple access and traffic offloading Zhao, Yi; Yuan, Di; You, Lei Ingår i IET Networks, s. 265-277, 2021 DOI för Delivering more to cell edge via joint multi-cell non-orthogonal multiple access and traffic offloading Ladda ner fulltext (pdf) av Delivering more to cell edge via joint multi-cell non-orthogonal multiple access and traffic offloading Age-Optimal UAV Scheduling for Data Collection With Battery Recharging Ahani, Ghafour; Yuan, Di; Zhao, Yixin Ingår i IEEE Communications Letters, s. 1254-1258, 2021 DOI för Age-Optimal UAV Scheduling for Data Collection With Battery Recharging Optimal scheduling of content caching subject to deadline Ahani, Ghafour; Yuan, Di Ingår i IEEE",
  "content_length": 19646,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:44"
}