{
  "name": "Di Yao 0001",
  "homepage": "http://yaodi.info",
  "status": "success",
  "content": "Di Yao @ ICT,CAS×Di Yao(å§è¿ª)Associate Professor @ ICT, CASNo.6 Kexueyuan South Road, Beijing, China, 100190yaodi AT ict DOT ac DOT cn[Bio]    [Google Scholar]    [Github]BackgroundAboutAboutI am currently an associate professor in Institute of Computing Technology, Chinese Academy of Sciences(ICT, CAS). Before joining ICT, I obtained my Ph.D. degree in University of Chinese Academy of Sciences supervised by Prof. Jingping Bi. The thesis is avaliable HERE. Previously I conducted one year visiting at DMAL, Nanyang Technological University under the supervision of Prof. Gao Cong. My research interest lies in time series analysis, anomaly detection and causal discovery . I am looking for highly-motivated students to work with me. If interested, please drop me a message by email. NewsNews[2025. 02] We have released a benchmark to assess the abality of LLM for spatio-temporal analysis. The work is accepted by WWW 2025 Resource Track! [2024. 12] One paper about flight trajectory representation has been accepted by AAAI 2025! [2024. 10] My research proposal about causal mixture marketing model has been approved by Alibaba AIR Program. [2024. 09] Our work about anomlay detction for dynamic graph with LLM has been accepted by ICDM 2024! [2024. 08] I am delighted to receive funding from the NSFC for the topic 'Trajectory Intention Prediction'! [2024. 07] I am very pleased to collaborate once again with DiDi Chuxing on the project focused on trip risk estimation. [2024. 02]Two papers about trajectory data mining have been accepted in ICDE 2024! [2023. 12]One paper about causal discovery for marketing mix modeling has been accepted in WSDM 2024! [2023. 05]Our tutorial proposal about causal discovery from temproal data has been accepted in SIGKDD 2023!Publications Publications(* indicates the Corresponding Author) 2025 STBench: Assessing the Ability of Large Language Models in Spatio-Temporal Analysis   Wenbin Li, Di Yao*, Ruibo Zhao, Wenjie Chen, Zijie Xu, Chengxue Luo, Chang Gong, Quanliang Jing, Haining Tan, Jingping Bi The Web Conference (Resource Track) 2025 Effective and Efficient Representation Learning for Flight Trajectories   Shuo Liu, Wenbin Li, Di Yao*, Jingping Bi AAAI 2025 Exploring Progress in Multivariate Time Series Forecasting   Zezhi Shao, Fei Wang, Yongjun Xu, Wei Wei, Chengqing Yu, Zhao Zhang, Di Yao, Tao Sun, Guangyin Jin, Xin Cao, Gao Cong, Christian S Jensen, Xueqi Cheng IEEE Transactions on Knowledge and Data Engineering (TKDE) 2025 2024 AnomalyLLM: Few-shot Anomaly Edge Detection for Dynamic Graphs using Large Language Models   Shuo Liu, Di Yao*, Lanting Fang, Zhetao Li, Wenbin Li, Kaiyu Feng, XiaoWen Ji, Jingping Bi. IEEE International Conference on Data Mining (ICDM) 2024 PORCA: Root Cause Analysis with Partially Observed Data   Chang Gong, Di Yao*, Jin Wang, Wenbin Li, Lanting Fang, Yongtao Xie, Kaiyu Feng, Peng Han, Jingping Bi. ArXiv 2024 Trajectory Completion via Context-Guided Neural Filtering and Encoding    Di Yao, Fangda Guo, Zhenyu Wen, Yu Guo, Peng Cheng, Yangyuan He, Jingping Bi International Conference on Database Systems for Advanced Applications(DASFAA) 2024 Deep Dirichlet Process Mixture Model for Non-parametric Trajectory Clustering Di Yao, Jin Wang, Wenjie Chen, Fangda Guo, Peng Han, Jingping Bi. IEEE International Conference on Data Engineering (ICDE) 2024 CausalTAD: Causal Implicit Generative Model for Debiased Online Trajectory Anomaly Detection    Wenbin Li, Di Yao*, Chang Gong, Xiaokai Chu, Quanliang Jing,Jingping Bi. IEEE International Conference on Data Engineering (ICDE) 2024 CausalMMM: Learning Causal Structure for Marketing Mix Modeling    Chang Gong, Di Yao*, Lei Zhang, Sheng Chen, Wenbin Li, Yueyang Su, Jingping Bi. The 17th ACM International Conference on Web Search and Data Mining(WSDM) 2024 2023 Causal Discovery from Temporal Data (Tutorial)   Chang Gong, Di Yao*, Chuzhe Zhang, Wenbin Li, Jingping Bi 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD) 2023 TripSafe: Retrieving Safety-related Abnormal Trips in Real-time with Trajectory Data Yueyang Su, Di Yao*, Xiaolei Zhou, Yuxuan Zhang, Yunxia Fan, Lu Bai, Jingping Bi 46th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR) 2023 Short Paper Causal Discovery from Temporal Data: An Overview and New Perspectives   Chang Gong, Di Yao*, Chuzhe Zhang, Wenbin Li, Jingping Bi ArXiv 2023 AI-enhanced Spatial-Temporal Data Mining Technology: New Chance for Next-generation Urban Computing   Fei Wang, Di Yao, Yong Li, Tao Sun, Zhao Zhang The Innovation 20232022 Spatial-Temporal Fusion Graph Framework for Trajectory Similarity Computation   Silin Zhou, Peng Han, Di Yao, Lisi Chen, Xiangliang Zhang World Wide Web Journal 2022 Can Adversarial Training benefit Trajectory Representation? An Investigation on Robustness for Trajectory Similarity Computation   Quanliang Jing, Shuo Liu, Xinxin Fan, Jingwei Li, Di Yao, Baoli Wang and Jingping Bi 31st ACM International Conference on Information and Knowledge Management (CIKM) 2022 TrajGAT: A Graph-based Long-term Dependency Modeling Approach for Trajectory Similarity Computation    Di Yao, Haonan Hu, Lun Du, Gao Cong, Shi Han and Jingping Bi 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD) 2022 CausalMTA: Eliminating the User Confounding Bias for Causal Multi-touch Attribution    Di Yao, Chang Gong, Lei Zhang, Sheng Chen and Jingping Bi 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD) 2022 Few-shot Learning for Trajectory-based Mobile Game Cheating Detection   Yueyang Su, Di Yao*, Xiaokai Chu, Wenbin Li, Jingping Bi, Shiwei Zhao, Runze Wu, Shize Zhang, Jianrong Tao and Hao Deng 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD) 2022 HTGN-BTW: Heterogeneous Temporal Graph Network with Bi-Time-Window Training Strategy for Temporal Link Prediction   Chongjian Yue, Lun Du, Qiang Fu, Wendong Bi, Hengyu Liu, Yu Gu, Di Yao 2nd prize of WSDM 2022 Challenge - Temporal Link Prediction FingFormer: Contrastive Graph-based Finger Operation Transformer for Unsupervised Mobile Game Bot Detection   Wenbin Li, Xiaokai Chu, Yueyang Su, Di Yao*, Shiwei Zhao, Runze Wu, Shize Zhang, Jianrong Tao, Hao Deng and Jingping Bi The Web Conf (WWW) 2022 Contrastive Disentangled Graph Convolutional Network for Weakly-supervised Classification   Xiaokai Chu, Jiashu Zhao, Xinxin Fan, Di Yao, Zhihua Zhu, Lixin Zou, Dawei Yin, Jingping Bi DASFAA 20222021 TrajCross: Trajecotry Cross-Modal Retrieval with Contrastive Learning   Quanliang Jing, Di Yao*, Chang Gong, Xinxin Fan, Baoli Wang, Haining Tan, Jingping Bi IEEE Bigdata 2021 Interactive Anomaly Detection in Dynamic Communication Networks   Xuying Meng, Yequan Wang, Suhang Wang, Di Yao, Yujun Zhang. IEEE/ACM Transactions on Networking (TON) 2021 Semi-Supervised Anomaly Detection in Dynamic Communication Networks   Xuying Meng, Suhang Wang, Zhimin Liang, Di Yao, Jihua Zhou, Yujun Zhang. Information Sciences 2021 A Graph-based Approach for Trajectory Similarity Computation in Spatial Networks   Peng Han, Jin Wang, Di Yao, Shuo Shang , Xiangliang Zhang. 27th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD) 2021 Meta-learning Enhanced Neural ODE for Citywide Next POI Recommendation   Haining Tan, Di Yao*, Tao Huang , Baoli Wang, Quanliang Jing, Jingping Bi. IEEE International Conference on Mobile Data Management (MDM) 2021 (Best Paper Runner-Up Award)2020 A Linear Time Approach to Computing Time Series Similarity based on Deep Metric Learning   Di Yao, Gao Cong, Chao Zhang, Xuying Meng, Rongchang Duan and Jingping Bi. IEEE Transactions on Knowledge and Data Engineering (TKDE) 20202019 Computing Trajectory Similarity in Linear Time: A Generic Seed-Guided Neural Metric Learning Approach   Di Yao, Gao Cong, Chao Zhang and Jingping Bi. 35th IEEE International Conference on Data Engineering (ICDE) 2019 Cross-Network Embedding for Multi-Network Alignment   Xiaokai Chu, Xinxin Fan, Di Yao, Zhihua Zhu. Jianhui Huang and Jingping Bi The Web Conference (WWW) 2019 Noise-Aware Network Embedding for Multiplex Network   Xiaokai Chu, Xinxin Fan, Di Yao, Chenlin Zhang, Jianhui Huang and Jingping Bi IEEE International Joint Conference on Neural Networks(IJCNN) 2019 2018 Semantic Understanding of Spatio-Temporal Data: Technologies and Applications   Di Yao, Chao Zhang, Jingping Bi Journal of Software 2018 Sub-trajectory- and Trajectory-Neighbor-based Outlier Detection over Trajectory Streams   Zhihua Zhu, Di Yao*, Jianhui Huang, Hanqiang Li, Jingping Bi The 22nd Pacific-Asia Conference on Knowledge Discovery and Data Mining(PAKDD) 20182017 SERM: A Recurrent Model for Next Location Prediction in Semantic Trajectories   Di Yao, Chao Zhang, Jianhui Huang and Jingping Bi ACM on Conference on Information and Knowledge Management(CIKM) 2017 Short Paper Learning Deep Representation for Trajectory Clustering   Di Yao, Chao Zhang, Zhihua Zhu, Jianhui Huang, Jingping Bi Expert Systems 2017 Trajectory Clustering via Deep Representation Learning   Di Yao, Chao Zhang, Jianhui Huang, Jingping Bi IEEE International Joint Conference on Neural Networks (IJCNN) 20172015 A Word Distributed Representation based Framework for Large-scale Short Text Classification   Di Yao, Jingping Bi, Jianhui Huang, et al IEEE International Joint Conference on Neural Networks (IJCNN) 2015ServicesServicesReviewerIEEE Transactions on Knowledge and Data Engineering (TKDE)IEEE/ACM Transactions on Networking (TON)IEEE Transactions on Mobile Computing (TMC)IEEE Transactions on Services Computing (TSC)IEEE Transactions on Big Data (TBD)ACM Transactions on Knowledge Discovery from Data (TKDD)ACM Transactions on Intelligent Systems and Technology(TIST)International Journal of Geographical Information Science (IJGIS)PC Member2020: ECML-PKDD 2022: AAAI, SIGKDD, CIKM2023: SIGKDD, CIKM2024: SIGKDD, CIKM, AAAI, IJCAI2025: SIGKDD, CIKM, AAAIEducationEducationPh.D. Student, Institute of Computi",
  "content_length": 10642,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:43"
}