{
  "name": "Diane Horton",
  "homepage": "http://www.cs.toronto.edu/~dianeh",
  "status": "success",
  "content": "Diane Horton's Home Page Diane Horton Professor, Teaching Stream Diane Horton is a Professor, Teaching Stream, in the Department of Computer Science at the University of Toronto and a member of the CS Education Research Group. She co-leads the Embedded Ethics Education Initiative, a joint initiative between the Departments of Computer Science and Philosophy, and the Schwartz Reisman Institute for Technology and Society. Her research is in the area of computer science education, and she is currently engaged in a longitudinal study examining the impact of embedded ethics education. Her leadership contributions include serving as Associate Chair, Undergraduate, in the Department of Computer Science, as Acting Director of the University of Toronto Centre for Teaching Support and Innovation, and as co-chair of the President's Teaching Academy at the University of Toronto. Diane was the winner of the 2006 Joan E. Foley Quality of Student Experience Award. In 2015, she received the University of Toronto's highest honour for teaching, the President's Teaching Award. She was awarded the Ontario Confederation of University Faculty Associations (OCUFA) Teaching Award in 2016. The Embedded Ethics Education Initiative team received the University of Toronto Northrop Frye Award in 2024, and in 2025 was recognized by the Canadian Society for Teaching and Learning in Higher Education with the D2L Innovation Award in Teaching and Learning. Diane is also a recipient of the Computer Science Canada | Informatique Canada Excellence in Teaching Award. Contact Information Room 4236 Bahen Centre for Information Technology Department of Computer Science, University of Toronto 40 St. George Street Toronto, ON M5S 2E4 dianeh AT cs DOT utoronto DOT ca 2025-26 Teaching csc343, Introduction to Databases csc1500, Fundamentals of Teaching Computer Science in Higher Education Current Projects Co-lead, with Professors Sheila McIlraith, David Liu, and Steven Coyne, the Embedded Ethics Education Initiative (E3I). We design and deliver modules on ethics which are integrated into courses across the curriculum, and are conducting a longitudinal study to assess the impact of our modules. Co-host, with Professor Mario Badr, of the In the Loop podcast. Our podcast is designed for CS undergrads at the University of Toronto, but is largely relevant to CS students anywhere. Season 2 is out now. Available on all the major podcast platforms. Selected Publications D. Horton, D. Liu, S. A. McIlraith, S. Coyne, and N. Wang. 2024. Do Embedded Ethics Modules Have Impact Beyond the Classroom? Proceedings of the 55th ACM Technical Symposium on Computer Science Education (SIGCSE 2024), pages 533-539. Maryam Majedi, Emma McClure, Benjamin Wald, Diane Horton, and Sheila A. McIlraith. 2024. Embedded Ethics: Pandemic Contact Tracing and Ethical Trade-offs. In EngageCSEdu. May 2024. 4 pages. → EngageCSEdu page with full module materials. Maryam Majedi, Emma McClure, Benjamin Wald, Diane Horton, and Sheila A. McIlraith. 2024. Embedded Ethics: Pandemic Exposure Notification Systems and Giving Ethical Justifications. In EngageCSEdu. May 2024. 4 pages. → EngageCSEdu page with full module materials. D. Horton, D. Liu, S. A. McIlraith, and N. Wang. 2023 Is More Better When Embedding Ethics in CS Courses? Proceedings of the 54th ACM Technical Symposium on Computer Science Education (SIGCSE 2023). D. Horton, S. A. McIlraith, N. Wang, M. Majedi, E. McClure, and B. Wald. 2022. Embedding Ethics in Computer Science Courses: Does it Work? Proceedings of the 53rd ACM Technical Symposium on Computer Science Education (SIGCSE 2022). N. Parlante, J. Zelenski, B. Dicken, B. Stephenson, J.L. Popyack, W.M. Mongan, K. Binghan, D. Horton, D. Liu, A. Obourn Nifty Assignments, Proceedings of the 50th ACM SIGCSE Technical Symposium on Computer Science Education, SIGCSE '19. → Our Nifty Assignment was Blocky, a game that uses recursion and trees. B. Stephenson, M. Craig, D. Zingaro, D. Horton, D. Heap and E. Huynh. Exam Wrappers: Not a Silver Bullet. Proceedings of the 48th ACM Technical Symposium on Computing Science Education, SIGCSE '17. J. Campbell, D. Horton, and M. Craig. Factors for Success in Online CS1. In Proceedings of the 21st ACM Annual Conference on Innovation and Technology in Computer Science Education, ITiCSE '16, pages 320-325. Runner-up for Best Paper. D. Horton, J. Campbell, and M. Craig. 2016. Online CS1: Who Enrols, Why, and How Do They Do?. In Proceedings of the 47th ACM Technical Symposium on Computing Science Education, SIGCSE '16., pages 323-328. M. Craig, D. Horton, D. Zingaro, and D, Heap. 2016. Introducing and Evaluating Exam Wrappers in CS2\". In Proceedings of the 47th ACM Technical Symposium on Computing Science Education, SIGCSE '16., pages 285-290. D. Horton and M. Craig. Drop, Fail, Pass, Continue: Persistence in CS1 and Beyond in Traditional and Inverted Delivery. Proceedings of the 46th ACM Technical Symposium on Computer Science Education, SIGCSE '15, ACM, New York, NY, USA. J. Campbell, D. Horton, M. Craig, and P. Gries. Evaluating an Inverted CS1\". In Proceedings of the 45th ACM Technical Symposium on Computer Science Education, SIGCSE '14, pages 307-312, New York, NY, USA, 2014. ACM. D. Horton, M. Craig, J. Campbell, P. Gries, and D. Zingaro. Comparing Outcomes in Inverted and Traditional CS1. In Proceedings of the 19th Annual Conference on Innovation and Technology in Computer Science Education, ITiCSE '14, New York, NY, USA, 2014. ACM. D. Horton and M. Craig. Who drops CS1?. In Proceedings of the 45th ACM Technical Symposium on Computer Science Education, (SIGCSE '14), pages 712-713, New York, NY, USA, 2014. ACM. Poster Presentation. D. Horton and J. Campbell. Impact of Reward Structures in an Inverted Course. In Proceedings of the 2014 Conference on Innovation on Technology in Computer Science Education (ITICSE '14), pp. 341-341, New York, NY, USA, 2014. ACM. Poster presentation.",
  "content_length": 5949,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:47"
}