{
  "name": "Diana Bental",
  "homepage": "https://researchportal.hw.ac.uk/en/persons/diana-bental",
  "status": "success",
  "content": "Diana Bental - Heriot-Watt Research Portal View Scopus Profile Diana Bental Dr Assistant Professor, School of Mathematical & Computer SciencesAssistant Professor, School of Mathematical & Computer Sciences, Computer Science Emaild.s.bentalhw.acuk EH14 4ASUnited Kingdom 19992020 Research activity per year Personal profile Research interestsMy research interests include: Artificial intelligence, user modelling and adaptive hypermedia and natural language interfacesCognitive models of design, problem solving, information seeking and learning, so that systems which support these activities can be tailored to the needs of different individuals. individuals.Key Research Words/PhrasesUser modeling Artificial intelligence Serendipity Problem solving Adaptive interfaces Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): KeywordsQA76 Computer softwareQA75 Electronic computers. Computer science Fingerprint Dive into the research topics where Diana Bental is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 2 Similar Profiles information INIS 100% environment INIS 66% patients INIS 66% natural language INIS 66% data INIS 58% learning INIS 51% cancer INIS 44% space INIS 44% View full fingerprint Research output Research output per year 1999 1999 2001 2002 2013 2020 6 Article 5 Paper 4 Conference contribution 2 Chapter (peer-reviewed) 2 More 1 Conference article 1 Literature review Research output per year Research output per year Generating corrupted data sources for the evaluation of matching systemsMcNeill, F., Bental, D., Gray, A. J. G., Jedrzejczyk, S. & Alsadeeqi, A., 16 Jan 2020, In: CEUR Workshop Proceedings. 2536, p. 41-45 5 p.Research output: Contribution to journal › Conference article › peer-review Open AccessFile data 100% variations 100% evaluation 100% Data Source 100% ontology matching 100% 1 Citation (Scopus) 98 Downloads (Pure) Communication in emergency management through data integration and trust: An introduction to the CEM-DIT systemMcNeill, F., Bental, D., Missier, P., Steyn, J., Kumar, T. & Bryans, J., 2019, Proceedings of the 16th International Conference on Information Systems for Crisis Response and Management. ISCRAM, p. 376-387 12 p. (Proceedings of the International ISCRAM Conference).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile data 100% management 100% emergencies 100% Data Integration 100% Data Provenance 25% 2 Citations (Scopus) 104 Downloads (Pure) Tailoring privacy-aware trustworthy cooperating smart spaces for university environmentsLiampotis, N., Papadopoulou, E., Kalatzis, N., Roussaki, I., Kosmides, P., Sykas, E., Bental, D. & Taylor, N. K., 2016, Handbook of Research on Next Generation Mobile Communication Systems. IGI Global, p. 410-439 30 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter (peer-reviewed) › peer-review Pervasive Computing 100% Information User 100% Evaluation Result 100% Privacy Concern 100% Sensitive User Data 100% Smartening up the Student Learning Experience with Ubiquitous MediaBental, D. S., Papadopoulou, E., Taylor, N. K., Williams, M. H., Blackmun, F. R., Ibrahim, I. S., Lim, M. Y., Mimtsoudis, I., Whyte, S. W. & Jennings, E., Oct 2015, In: ACM Transactions on Multimedia Computing, Communications and Applications. 12, 1s, p. 1-23 23 p., 23.Research output: Contribution to journal › Article › peer-review Open AccessFile environment 100% learning 100% space 100% Learning Experiences 100% Case Study 100% 5 Citations (Scopus) 217 Downloads (Pure) How public organisational structures influence software development processesBindrees, M. A., Pooley, R. J., Ibrahim, I. S. & Bental, D. S., 2014, In: Journal of Universal Computer Science. 10, 12, p. 2593-2607 15 p.Research output: Contribution to journal › Article › peer-review Software Development 100% computer codes 100% Software Application 66% project management 37% Software Development Lifecycle 33% 1 Citation (Scopus) View all 19 research outputs Activities Activities per year 2024 2024 2024 1 Participation in workshop, seminar, course Activities per year Woman in Data Science 2024Saman, G. (Organiser), Vallejo, M. (Organiser), Shoukry, H. (Organiser) & Bental, D. (Organiser)27 Mar 2024Activity: Participating in or organising an event › Participation in workshop, seminar, course",
  "content_length": 4603,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:46"
}