{
  "name": "Diana Keen",
  "homepage": "http://people.cs.uchicago.edu/~dmfranklin",
  "status": "success",
  "content": "Prof. Diana Franklin Prof. Diana Franklin Home Classes Papers Research Advising News [Mar 2025] 4 SIGCSE papers and 1 tutorial at SIGCSE [Jan 2025] QIS K-12 Key Concepts for Computer Science released - read and give feedback! [Jan 2025] Collapsing Qubits card game released! [Jan 2025] TheoryABCs NSF grant begins! [Oct 2024] Quander NSF grant funded! ... More News ... Bio Diana Franklin is an Associate Professor in Computer Science at the University of Chicago. When she received her Ph.D. at UC Davis, 2002, her research focus was computer architecture, especially new technologies. She has done research in intelligent memories, memristors, and quantum computers. In 2008, she began her transition to computer science education research. She now leads the CANON (Computing for ANyONe) Lab, specializing in both 3rd-8th grade computer science interventions and quantum computing education for novices of any age with a particular focus towards moving towards more equitable learning experiences. She is currently the co-lead of the Q-12 Partnership, a new initiative by the Office of Science and Technology Programs, the National Science Foundation, industry, and professional organizations to bootstrap K-12 quantum information science education. Currently Teaching Winter 2024: CMSC 22880 ... More Classes ... Research I am interested in how students learn computer science concepts, especially at the elementary school level. In particular, I explore how to create curriculum and development environments that can reach a broad spectrum of learners, including underrepresented ethnic and gender minorities and students struggling academically. My research is housed in the CANON (Computing for ANyONe) Research Lab. I am current leading three projects, spanning learners from pre-K through college. I am not currently recruiting graduate students. active projects Scratch Encore explores how to create intermediate Scratch curriculum when equity is a level-1 design constraint, equal to learning outcomes. Our goal is to provide teachers with the tools to quickly customize Scratch projects for their classrooms using Conjuror If you are interested in being in our study, check it out! Building on our work creating quantum computing learning resources ( zines, activities, and a 2-week HS module), we are exploring age-appropriate learning goals for middle-school learners and how to convey them through game play. We have created an online game suite, Quander, that integrates quantum computing concepts into game mechanics in various ways. This is paired with Collapsing Qubits, our new card game. We are using these resources to create learning trajectories of basic QIS concepts such as superposition, measurement, and reversibility. TheoryABCs is a new project with two goals. First, how can we better scaffold the multi-step process of designing algorithms for each paradigm? Second, to what degree can we increase engagement, belonging, and learning by creating personalized algorithms word problems that set the same technical problem into settings chosen by the learner? artifacts produced Quander online game suite that integrates quantum computing concepts into various games. Collapsing Qubits - a card game with QIS-specific cards and game mechanics. Scratch Act 1 - Introductory Scratch programming. Four modules consisting of 10 hours of instruction. Uses same pedagogical approach as Scratch Encore, with content from SFUSD's Green Workbook, itself a reorganization and revision of Harvard's Creative Computing Curriculum. Scratch Encore - Intermediate Scratch programming. Modules 1-13 now released, and there are now three strands that teachers can choose from for modules 1-6. CT Reading List for preK-2nd grade. Robot Turtles boards to make the Robot Turtles preK-1st grade board game more amenable to classroom use. Action Fractions - Integrated fractions + CT activities for 3rd and 4th grade. older projects Learning Trajectories for Everyday Computing is a multi-institution (UChicago, UF, UIC) research effort exploring integration of computational thinking and mathematics in elementary school. After creating learning trajectories for Sequence, Repetition, Conditionals, and Decomposition, and Debugging. We collaboratively designed Action Fractions, a sequence of integrated Fractions + CT activities for 3rd and 4th grades. Comprehending Code focuses on learning strategies that students, especially students with disabilities, English language learners, and those struggling academically for any other reason. We have developed TIPP&SEE, a learning strategy that teaches students how to learn by example within Scratch projects. In addition, we have developed resources for Robot Turtles to make it more accessible to students in a classroom setting and to connect it more closely to Scratch programming. Finally, we have developed a Scratch Charades games that has students act out Scratch scripts before encountering the complicated programming interface. DEPICT Investigating how students learn elementary CT concepts through visual block-based languages (like Scratch) in upper-elementary school. This project resulted in 15 publications, a two-year curriculum, and a development environment that was more configurable than Scratch. The lessons learned in this program have now been applied to all of my current projects, and many of the projects live on in modified forms in the Scratch Encore curriculum. Animal Tlatoque Investigating how to broaden participation in computing through a multi-disciplinary summer camp. Over three summers, ran camp for middle school students that combined meso-american culture, endangered species, art, storytelling, and computer science. Associate Professor Dept. of Computer Science The University of Chicago Contact Info Crerar Library Bldg, Room 325 Computer Science Department University of Chicago 5730 S. Ellis Chicago, IL 60637 Email: dmfranklin@uchicago.edu Curriculum Vitae CV Research Statement © 2012 – 2015 ravichugh.net | stylesheet based on Resolved",
  "content_length": 6042,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:46"
}