{
  "name": "Diane J. Litman",
  "homepage": "https://www.cs.pitt.edu/~litman",
  "status": "success",
  "content": "Diane J. Litman's Home Page Diane J. Litman Home Publications Teaching Lab Research My research is in the area of artificial intelligence, and includes contributions in the areas of artificial intelligence and education, computational linguistics, spoken language, and user modeling. My work has included both fundamental research and applied research resulting in technology transfer and patents. My most recent research has primarily focused on Natural Language Technology for Educational Applications. Currently funded projects include: (TeachTalk) Using ChatGPT to Analyze Classroom Discussions (CourseMIRROR) Developing and Optimizing Reflection-Informed STEM Learning and Instruction by Integrating Learning Technologies with Natural Language Processing (Discussion Tracker) Development of Human Language Technologies to Improve the Teaching of Collaborative Argumentation in High School English Classrooms (eRevise) Development of Natural Language Processing Techniques to Improve Students' Revision of Evidence Use in Argument Writing (Emma) Studying Collaborative Dialogue with a Teachable Robot in a Mathematics Domain (FAI) Using AI to Increase Fairness by Improving Access to Justice (Automed Essay Scoring) Building Socially Responsible Machine Writing Tutors Brief Biography I am the School of Computing and Information's Associate Dean for Mentoring Development, Professor of Computer Science (CS), a Senior Scientist with the Learning Research and Development Center (LRDC), and Faculty of the Intelligent Systems Program (ISP), all at the University of Pittsburgh. CS and ISP are part of Pitt's School of Computing and Information (SCI). I moved here from the Garden State (aka New Jersey), where from 1985-2001 I was a member of the Artificial Intelligence Principles Research Department, AT&T Labs - Research (formerly Bell Laboratories); From 1990-1992, I was also an Assistant Professor of Computer Science at Columbia University. I received my Ph.D. and M.S. in Computer Science from the University of Rochester, and my A.B. in Mathematics and Computer Science from the College of William and Mary in Virginia. Here are my informal and more formal versions of my academic geneology. News August 2025: New NSF grant on learning technologies May 2025: NAAI Distinguished AI Scholar Award April 2025: Member, National Academy of Artificial Intelligence April 2025: Webinar, NSF-funded HBCU Teaching and Research Community. April 2025: Panelist, Pitt Business Impact Conference on Artificial Intelligence 2025: Driving Positive Impact Through Human-Centric and Responsible Use of AI March 2025: Panelist, Mentoring Doctoral Students: Advice from Provost's Award for Excellence in Doctoral Mentoring Winners March 2025: Speaker, iRAISE: Innovation and Responsibility in AI-Supported Education, AAAI October 2024: Top 2% Scientist July 2024: Fellow, Asia-Pacific Artificial Intelligence Association July 2024: NSF NAIRR Demonstration Project awarded July 2024: Best Paper Award Nomination at Educational Dating Mining (EDM) for Analyzing Large Language Models for Classroom Discussion Assessment March 2024: Pitt Cyber Accelerator Grant on \"Building Socially Responsible Machine Writing Tutors\" January 2024: Panelist, Generative AI and Teaching: Uses in Evaluation of Learning December 2023: Joined Duolingo's English Test Technical Advisory Board December 2023: Panelist, Celebration of the 10th Anniversary of the Argument Mining Workshop Series September 2023: Appointed as first Associate Dean for Mentoring and Development in the School of Computing and Information August 2023: New NSF grant on learning technologies Archived News Editorial Associate Editor, International Journal of Artificial Intelligence in Education Editorial Board, Journal of Artificial Intelligence Research Editorial Board, Argument and Computation PhD Students Yuya Asano, Intelligent Systems Mohamed Salem Elaraby, Computer Science Zhexiong Liu, Computer Science Nhat Tran, Computer Science Yang Zhong, Computer Science Data and Code Request/Download Associate Dean for Mentoring and Development School of Computing and Information University of Pittsburgh Pittsburgh, PA 15260 Professor Department of Computer Science 5105 Sennott Square 210 South Bouquet Street (phone) 412-624-8838 Senior Scientist Learning Research and Development Center Murdoch Building3420 Forbes Ave Office 420 (phone) 412-624-1261 Faculty Intelligent Systems Program dlitman at pitt dot edu © Diane Litman. All rights reserved. Design by TEMPLATED.",
  "content_length": 4524,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:51"
}