{
  "name": "Dian Zhang",
  "homepage": "http://nhpcc.szu.edu.cn/zhangdian",
  "status": "success",
  "content": "﻿ Dian Zhang Dian Zhang(张滇) Associate Professor College of Computer Science and Software Engineering Shenzhen University Email:zhangd@szu.edu.cn; Tel:(0755) 2695 8861 Addr:Yuehaimen Square Lab 202, Nanhai Ave 3688, Shenzhen University 中文/Chinese Biography Biography Prof. Zhang is an Associate Professor at the College of Computer Science and Software Engineering, Shenzhen University. She is also an adjunct associate professor at Department of Computing and Decision Sciences, Lingnan University, Hong Kong. She received her PhD in Department of Computer Science and Engineering, Hong Kong University of Science and Technology in 2010 under the supervision of Prof. Lionel M. Ni. Her research interests span over big data analytics, mobile computing, Internet of Things. Her research works have been published in many international well-known journals and conferences, including IEEE transaction on Mobile Computing (TMC), IEEE Transactions on Parallel and Distributed Systems (TPDS), IEEE Internet of Things Journal, IEEE INFOCOM, IEEE ICDCS, IEEE PERCOM, IEEE Big Data. Her work has been widely cited by prestigious institutes such as Stanford University, McGill University, Tsinghua University. She is the PI of many research projects including the National Natural Science Foundation of China, Shenzhen Peacock projects. She is the recipient of 2018 Ministry of Education of China 2nd Class Academic Research Outstanding Award in Nature Science (中国教育部自然科学二等奖), 2013 IBM Faculty Award, 2015 Shenzhen Peacock Talent Award and 2019 China Pacific Insurance Research Achievement Award. Research Interests Internet of Things, Wireless Sensor Networks, Networking and Distributed Systems, Networking and Distributed Systems, Pervasive Computing, RFID systems. I am currently looking for outstanding post-doctoral and graduate students, who are interested in my research area! Please contact me by email! News Mobicom Workshop 2022 Teaching Experience Courses Taught at Shenzhen University Machine Learning (PhD) Paper Writing (PhD) Operating System Introduction to the Internet of Things Basics of Computer Technology Wireless Sensor Networks Linux System Programming The Principle and Practice of database Systems (Bilingual Teaching) Fundamentals of IBM Mainframe system Programming of IBM Mainframe system C++ Programming Data Structure Programming Teaching Assistant at HKUST 01/2009-05/2009 Data Structures and Algorithms (COMP171) 01/2007-05/2007 Object Oriented Programming (COMP151) Awards 2019.01 Second Class Award, Ministry of Education of China Academic Research Outstanding Award in Nature Science, Project Title: Research on Transceiver-free Wireless Sensing Technologies 2019.09 Research Award, China Pacific Insurance 2017.04 深圳市南山区领航人才C类 2017.12 Second Class Award, High quality research paper award of shenzhen university 2016.10 Excellent prize advisor, to instruct the student obtain the 1st prize in National IOT Competition for College Students, 2016 2016.10 Excellent prize advisor, to instruct the student obtain the 2nd Prize in National IOT Competition for College Students, 2016 2015.06 Oversea High-Caliber Personnel(Level C) of Shenzhen Recruitment Program of Global Experts \"Peacock Plan\" 2014.12 The 2nd class excellent paper award of Shenzhen University 2013.10 Excellent prize advisor, to instruct the student obtain the 3rd class prize in IBM National Mainframe Technology Contest, 2013 2013.10 IBM Faculty Award 2006.09-2010.07 Full postgraduate studentship award at the Hong Kong University of Science and Technology Achievements Grants “Research of the Next Generation Wireless Localization and Behavior Recognition based on Cross-Technology”, the National Natural Science Foundation of China (Grant No.:61872247), 2019-2022, PI. “Research and Implementation on Next Generation Security Monitoring System of Device-free Technology”, Research Fund by Shenzhen (Grant No.:827-000175), 2015-2018, PI. “Research on RF-based technologies to track transceiver-free objects”, the National Natural Science Foundation of China (Grant No.:61202377), 2013-2015, PI. “Transceiver-free objects tracking in heterogeneous wireless networks”, Guangdong Natural Science Foundation (Grant No.: S2012040006682), 2012-2014, PI. “Intruder detection and localization in wireless networks”, the Shenzhen Science and Technology Foundation (Grant No.: JCYJ20120613173453717), 2012-2014, PI. “Research on coverage model to localize intruder objects”, Research Fund by Shenzhen University (Grant No.: 201210), 2012-2013, PI. Patents “Using multi-channels and SVM to track multiple transceiver-free objects in wireless networks”,(Patent No.: ZL 2009 1 0192132.8, published date: 2012.12.19) Publication Publication Link：http://dblp.uni-trier.de/pers/hd/z/Zhang:Dian Selected Conference ( * is the corresponding author). Zhihan Fang, Guang Yang, Dian Zhang, Xiaoyang Xie, Guang Wang, Yu Yang, Fan Zhang, Desheng Zhang,MoCha: Large-Scale Driving Pattern Characterization for Usage-based Insurance,ACM SIGKDD Conference on Knowledge Discovery \\& Data Mining (ACM SIGKDD),2849–2857,2021.08 Bing He, Xiaolin Chen, Dian Zhang, Siyuan Liu, Dawei Han, Lionel M. Ni,PBE: Driver Behavior Assessment Beyond Trajectory Profiling,European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases (ECML PKDD),2019：507-523,2019.01 Wenzhan Zhu, Weiling Zheng and Dian Zhang*, \"Beyond RSS: A PRR aided RSS System to Localize Transceiver-free Target in Sparse Wireless Networks\", in Proceedings of IEEE Global Communications Conference (IEEE GLOBECOM), December, 2018, Abu Dhabi, UAE. Bing He, Dian Zhang*, Siyuan Liu, Hao Liu, Dawei Han, and Lionel M. Ni, \"Profiling Driver Behavior for Personalized Insurance Pricing and Maximal Profit\", in Proceedings of IEEE International Conference on BIG DATA (IEEE BIG DATA), December, 2018, Seattle, USA. (Acceptance Ratio: 13%, 98/518) Bing He, Xiaolin Chen, Dian Zhang*, Siyuan Liu, Dawei Han, and Lionel M. Ni, \"PBE: Driver Behavior Assessment Beyond Trajectory Profiling\", in Proceedings of European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases (ECML PKDD), September, 2018, Dublin, Ireland. Dian Zhang, Xiaofeng Wu and Chen Wang, \"Fine-grained and Real-time Gesture Recognition by Using IMU Sensors\", in Proceedings of IEEE International Conference on Parallel and Distributed Systems (IEEE ICPADS), pp. 747-754, December, 2017, Shenzhen, China. Weiling Zheng and Dian Zhang*, \"HandButton: Gesture Recognition of Transceiver-free Object by Using Wireless Network\", in Proceedings of IEEE International Conference on Communications (IEEE ICC), June 8-12, 2015, London, UK. Dian Zhang, Xiaoyan Jiang and Lionel M. Ni, \"Double Free: Measurement-free Localization for Transceiver-free Object\", in Proceedings of The 43th International Conference on Parallel Processing (IEEE ICPP), pages 529-538, September 9-12, 2014, Minneapolis, USA. Rui Mao, Sheng Liu, Honglong Xu, Dian Zhang* and Daniel P. Miranker, \"On Data Partitioning in Tree Structure Metric-Space Indexes\", in Proceedings of The 19th International Conference on Database Systems for Advanced Applications (DASFAA), pages 141-155, April 21-24, 2014, Bali, Indonesia. Dian Zhang, Yunhuai Liu, Xiaonan Guo and Lionel M. Ni, \"On Distinguishing the Multiple Radio Paths in RSS-based Ranging\", in Proceedings of the 31th Annual IEEE International Conference on Computer Communications (IEEE INFOCOM), Orlando, Florida, USA, 2012. ((Google Citation:38, Acceptance Ratio: 18%, 278/1547) Xiaonan Guo, Dian Zhang* and Lionel M. Ni, \"Localizing Multiple Objects in an RF-based Dynamic Environment\", in Proceedings of the 32th International Conference on Distributed Computing Systems (IEEE ICDCS), Macau, China, 2012. (Acceptance Ratio: 13%, 71/515) Dian Zhang, Yunhuai Liu and Lionel M. Ni, \"RASS: A Real-time Accurate and Scalable System for Tracking Transceiver-free Objects\", in Proceedings of the 9th Annual IEEE International Conference on Pervasive Computing and Communications (IEEE PerCom), Seattle, USA, 2011. (Google Citation:133, Acceptance Ratio: 17%, 26/156) Dian Zhang, Yunhuai Liu and Lionel M. Ni, \"Link-centric Probabilistic Coverage Model for Transceiver-free Object Detection in Wireless Networks\", in Proceedings of the 30th International Conference on Distributed Computing Systems (IEEE ICDCS), Genoa, Italy, 2010. (Google Citation:20, Acceptance Ratio: 14%, 84/585) Dian Zhang, Yanyan Yang, Dachao Cheng, Siyuan Liu and Lionel M. Ni, \"COCKTAIL: An RF-based Hybrid Approach for Indoor Localization\", in Proceedings of International Communications Conference (IEEE ICC), Cape Town, South Africa, 2010. (Google Citation:41) Dian Zhang, and Lionel M. Ni, \"Dynamic Clustering for Tracking Multiple Transceiver-free Objects\", in Proceedings of the 7th Annual IEEE International Conference on Pervasive Computing and Communications (IEEE PerCom), Galveston, Texas, USA, 2009. (Google Citation:110, Acceptance Ratio: 13%, 26/199) Selected journal papers ( * is the corresponding author). Dian Zhang, Zexiong Liao, Wen Xie, Xiaofeng Wu, Haoran Xie, Jiang Xiao, Landu Jiang,Fine-grained and Real-time Gesture Recognition by Using IMU Sensors,IEEE Transactions on Mobile Computing (IEEE TMC),2021:1-13 Dian Zhang, Wen Xie, Zexiong Liao, Wenzhan Zhu, Landu Jiang, Yongpan Zou,Beyond RSS: A PRR and SNR Aided Localization System for Transceiver-free Target in Sparse Wireless Networks,IEEE Transactions on Mobile Computing (IEEE TMC),2021:1-16 Haizhou Guo, Dian Zhang, Siyuan Liu, Lei Wang, Ye Ding,Bitcoin price forecasting: A perspective of underlying blockchain transactions,Decision Support Systems (DSS),151:1-14,2021.12 Yongpan Zou, Dan Wang, Shicong Hong, Rukhsana Ruby, Dian Zhang, Kaishun Wu, “A Low-Cost Smart Glove System for Real-time Fitness Coaching”, in IEEE Internet of Things Journal (IoTJ), March, 2020. (",
  "content_length": 13631,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:43"
}