{
  "name": "Didem Unat Erten",
  "homepage": "https://parcorelab.ku.edu.tr",
  "status": "success",
  "content": "Koç University - Type the word you want to search for and press ENTER. A-Z Content, Page Guide ABC-ÇDEFJKLMNO-ÖPRS-ŞTW ABC-ÇDEFJKLMNO-ÖPRS-ŞTW Didem Unat named ACM SIGHPC Emerging Woman Leader in Technical Computing. Dr. Unat is the winner of 2021 ACM SIGHPC Emerging Woman Leader in Technical Computing award. Dr. Didem Unat is awarded with an ERC starting grant of 1.5M EUR. Very first ERC grant in Computer Science from Türkiye! Dr. Unat received the outstanding faculty in engineering award. Dr. Didem Unat received a new EuroHPC grant, with a total budget of 2.6M Euros. Project consortium includes Koç University, INESC-ID, Simula Research Lab, Sabancı University, LMU Munih, and GraphCore. Open Positions ** CURRENTLY ACCEPTING FOR SPRING and FALL** We have several active research projects, in collaboration with industry, international institutions, and supercomputing centers world-wide.  Research projects include but not limited to Scalable Deep Learning, Systems and AI Beyond Moore Parallel Programming Large-scale Sparse/Graph Computation If interested (postdoc, Ph.D. and M.Sc), please visit the position details. Check out our introductory video! News Assoc. Prof. Didem Unat received “the Inno4Scale grant” in collaboration with Simula Research Laboratory Dr. Aditya Sasongko’s PhD thesis featured in HiPEAC magazine Lab members gather for the 1st ParCoreLab Workshop Assoc. Prof. Didem Unat received “2021 Scientist of the Year – Young Scientist Awards” by Bilim Kahramanları Derneği Assoc. Prof. Didem Unat received the ACM SIGHPC Emerging Woman Leader in Technical Computing Award at SC22 Assoc. Prof. Didem Unat received “the Inno4Scale grant” in collaboration with Simula Research Laboratory Assoc. Prof. Didem Unat received “2021 Scientist of the Year – Young Scientist Awards” by Bilim Kahramanları Derneği for her outstanding contributions to science and its dissemination across the country! Go to news Dr. Aditya Sasongko’s PhD thesis featured in HiPEAC magazine ParCoreLab's postdoctoral researcher Dr. Aditya Sasongko's PhD thesis has been featured in the latest issue of HiPEAC magazine. This is a huge accomplishment and a proud moment for our lab! The HiPEAC magazine is a leading publication in the field of computer architecture and systems, making this feature a significant achievement for Aditya. Go to news Lab members gather for the 1st ParCoreLab Workshop The 1st ParCoreLab Workshop took place on January 6th, 2023 bringing together all of the lab members ranging from post-doctoral researchers to undergraduate students. The workshop featured presentations and discussions on a wide range of topics related to HPC, such as simulation, modeling, data analysis, and optimization techniques. Go to news Assoc. Prof. Didem Unat received “2021 Scientist of the Year – Young Scientist Awards” by Bilim Kahramanları Derneği Assoc. Prof. Didem Unat received “2021 Scientist of the Year – Young Scientist Awards” by Bilim Kahramanları Derneği for her outstanding contributions to science and its dissemination across the country! Go to news Assoc. Prof. Didem Unat received the ACM SIGHPC Emerging Woman Leader in Technical Computing Award at SC22 ACM SIGHPC Emerging Woman Leader in Technical Computing Award, given to mid-career women scientists in the technical and high performance computing communities, at the SuperComputing Conference on November 17, 2022. The ACM SIGHPC award is the recognition of Unat’s innovative work in the field of designing programming abstractions and tools for Go to news Cookie Policy Cookies are used to personalize content and ads, to provide social media features and to analyze our traffic. You can accept all cookies by selecting \"Allow all\" or you can edit the settings by selecting \"Customize your cookie settings\". When you visit a website, information is stored in your browser, mostly in the form of cookies. This information may be about you, your preferences or your device, and is often used to make the site work as you expect it to. The information does not usually identify you directly, it is meant to provide you with a more personalized web experience. You can choose not to allow some cookies. Click on the different category headings to learn more and change our default settings. Click here to view our cookie policy. Allow all Decline all Customize your cookie settings Necessary Cookies These cookies are necessary for the website to function and cannot be turned off in our systems. These cookies are necessary for the website to function and cannot be turned off in our systems. These cookies are necessary for the website to function and cannot be turned off in our systems. These cookies are necessary for the operation of the website and can not close our systems. These cookies are necessary for the operation of the website and can not close our systems. Statistical Cookies These cookies are used to provide insight into how we can improve our service to all our users and to understand how you interact with our website as an anonymous user. Targeting Cookies These cookies are used to create your profile and provide ads relevant to your interests. It is also used to limit the number of times you see an ad, as well as help measure the effectiveness of the ad campaign. Save my preferences and proceed to site Cookie Policy Cookies are used to personalize content and ads, to provide social media features and to analyze our traffic. You can accept all cookies with the \"Allow All\" option or you can edit the settings with the \"Customize Settings\" option. Customize Settings Allow All",
  "content_length": 5588,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:54"
}