{
  "name": "Didier Stricker",
  "homepage": "https://av.dfki.de/members/stricker",
  "status": "success",
  "content": "Didier Stricker Home Members Prof. Dr. Didier Stricker Prof. Dr. Didier Stricker E-Mail: didier.stricker@dfki.de Position: Scientific Director Phone: +49 631 20575-3500 About: Head of department Augmented Vision Scientific Director Didier Stricker is Professor in computer science at the University of Kaiserslautern and Scientific Director at the German Research Center for Artificial Intelligence (DFKI GmbH) in Kaiserslautern, where he leads the research department „Augmented Vision”. Between 2011-2016 he acted as honorary CEO of the International Network, GraphicsMedia.net, which includes prestigious organizations in the area of computer vision and graphics, i.e. Hasso-Plattner-Institute, Fraunhofer HHI, VicomTech, GraphiTech, CCG and Mivtech. Didier Stricker studied in France (INPG, Grenoble) and Germany (Technical University Karlsruhe). From 1993 to 1996, he worked at the Institute for Robotics and at the Research Center for Information Processing and Pattern Recognition (FIM-FGAN). In 1997 he joined the Fraunhofer Institute for Computer Graphics (Fraunhofer IGD) and started first works in Augmented Reality. In this context, he focused on visual tracking and visualization with see-through stereo HMD. He co-initiated the project ARVIKA (1999-2002) and contributed to the visionary project ARCHEOGUIDE (1999-2002). In 2002, he got his PhD from the University Darmstadt, Germany. From 2002 to June 2008, Didier Stricker led the department “Virtual and Augmented Reality” at the Fraunhofer Institute for Computer Graphics (Fraunhofer IGD) in Darmstadt, Germany. In this context he initiated and participated to many national and international projects in the area of virtual and augmented reality (e.g. EU: MATRIS, ULTRA, SKILLS, ARCHEOGUIDE; National: ARTESAS, ARVIKA). In 2008 he has been appointed full professor at the University of Kaiserslautern. He founded the department “Augmented Vision” at the university and DFKI (the Germany Research Center for Artificial Intelligence). The group rapidly grew and comprises now around 30 researchers working in the area of cognitive interfaces, computer vision, on-body sensor network, video and sensor analytics, augmented reality and HCI. He defined large academic and industrial projects – an overview of the research projects is under: http://av.dfki.de/research/projects. Current industrial collaborations include companies, such as Sony, Google, or John Deere, as well as many Small/Medium Enterprises. A list of his recent publications can be found on the official DFKI website (Prof. Dr. Didier Stricker publications). Didier Stricker received the Innovation Prize of the German Society of Computer Science in 2006. He organized as general chair the first “IEEE&ACM International Symposium on Mixed and Augmented Reality” (ISMAR) 2002 in Darmstadt, Germany, and was member of the steering committee from 2000 to 2007. He got several award for best papers or demonstrations at different conferences. He registered several patents on tracking and augmented reality. Didier Stricker serves as reviewer for different European or National research organizations. He is reviewers of different journals and conferences in the area of VR/AR and Computer Vision. His research interests are cognitive interfaces, user monitoring and on-body-sensor-networks, computer vision, video/image analytics, and human computer interaction. 419 Publications by Prof. Dr. Didier Stricker: Exploring Large Language Models for Automated Gait Analysis Rebecca Keilhauer, Michael Lorenz, Carlo Dindorf, Stefan Ernst, Chen-Yu Wang, Paul Messer, Didier Stricker In: Proceedings of 2nd International Conference of AIxHMC 2025. International Conference on Artificial Intelligence for Medicine, Health, and Care (AIxMHC-2025), October 13-15, Taichung, Taiwan, Province of China, IEEE Xplore, 2025. Details Scene flow based deep network for hand reconstruction using depth images Adnan Anwer, Jameel Malik, Khawar Khurshid, Ahmed Elhayek, Ramy Battrawy, Didier Stricker, Syed Sarib Naveed, Muhammad Usman Safder In: Scientific Reports (Sci Rep), Vol. 15(1), No. Article Number: 32726, Pages 1-24, Springer Nature, Nature Publishing Group, 9/2025. Details | Link 1 MinJointTracker: Real-time inertial kinematic chain tracking with joint position estimation and minimal state size Michael Lorenz, Bertram Taetz, Gabriele Bleser-Taetz, Didier Stricker In: SPA 2025 - Signal Processing - Algorithms, Architectures, Arrangements, and Applications - Conference Proceedings. Signal Processing - Algorithms, Architectures, Arrangements, and Applications (SPA-2025), 28th, September 17-19, Poznan, Poland, IEEE Explore, 2025. Details A Review of Computer Vision for Industrial-Grade Waste Classification Pelle Thielmann, Yu Zhou, Bruno Mirbach, Didier Stricker, Jason Raphael Rambach In: IEEE Access (IEEE), Vol. 13, Pages 151934-151953, IEEE, 2025. Details | Link 1 CaRaCTO-3D: From Camera-Radar Calibration to Scene Reconstruction Mahdi Chamseddine, Jason Raphael Rambach, Didier Stricker In: SN Computer Science (SNCS), Vol. 6, No. 7, Pages 822-842, Springer, 2025. Details | Link 1 CLoRA: Parameter-Efficient Continual Learning with Low-Rank Adaptation Shishir Muralidhara, Didier Stricker, René Schuster In: Proceedings of Machine Learning Research (PMLR). Conference on Lifelong Learning Agents (CoLLAs-2025), August 11-14, Philadelphia, PA, USA, PMLR, 2025. Details | Link 1 JENGA: Object selection and pose estimation for robotic grasping from a stack Sai Srinivas Jeevanandam, Sandeep Prudhvi Krishna Inuganti, Shreedhar Govil, Didier Stricker, Jason Raphael Rambach In: 2025 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS 2025). IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS-2025), October 19-25, Hangzhou, China, IEEE Robotics and Automation Society, 10/2025. Details | Link 1 OptSplat: Recurrent Optimization for Generalizable Reconstruction and Novel View Renderings Vemburaj Yadav, Alain Pagani, Didier Stricker In: Proc. of. British Machine Vision Conference (BMVC-2025), BMVA, 2025. Details Optimization strategies for neural network deployment on FPGA: An energy-efficient real-time face detection use case Mhd Rashed Al Koutayni, Gerd Reis, Didier Stricker In: Internet of Things, Vol. 33, Pages 1-16, Elsevier, 9/2025. Details | Link 1 A Controller for Adaptive Neuromorphic Sensing using Active Efficient Coding Aheli Saha, Didier Stricker, René Schuster In: Proceedings of the International Workshop on Reliable and Sustainable Neuromorphic Hardware. International Workshop on Reliable and Sustainable Neuromorphic Hardware, May 28-30, York, United Kingdom, 2025. Details | Link 1 ParticleSAM: Small Particle Segmentation for Material Quality Monitoring in Recycling Processes Yu Zhou, Pelle Thielmann, Ayush Chamoli, Bruno Mirbach, Didier Stricker, Jason Raphael Rambach In: Proceedings of the 33rd European Signal Processing Conference (EUSIPCO 2025). European Signal Processing Conference (EUSIPCO-2025), 33rd European Signal Processing Conference, September 8-12, Palermo, Italy, IEEE, 2025. Details | Link 1 A Multi-Camera Vision-Based Approach for Fine-Grained Assembly Quality Control Shashank Mishra, Ali Nazeri, Achim Wagner, Martin Ruskow, Didier Stricker, Jason Raphael Rambach In: IEEE (Hrsg.). 33rd. European Signal Processing Conference (EUSIPCO-2025), 33rd European Signal Processing Conference, located at EUSIPCO 2025, September 8-12, Palermo, Italy, IEEE, 10/2025. Details | Link 1 EventEgo3D++: 3D Human Motion Capture from A Head-Mounted Event Camera Christen Millerdurai, Hiroyasu Akada, Jian Wang, Diogo Luvizon, Alain Pagani, Didier Stricker, Christian Theobalt, Vladislav Golyanik Details MISTI: Multi-Style Transfer for Multivariate Time Series Henri Hoyez, Bruno Mirbach, Cedric Schockaert, Jason Raphael Rambach, Didier Stricker In: IEEE (Hrsg.). 33rd. European Signal Processing Conference (EUSIPCO-2025), September 8-12, Palermo, Italy, IEEE, 2025. Details | Link 1 Classroom-Inspired Multi-Mentor Distillation with Adaptive Learning Strategies Shalini Sarode, Muhammad Saif Ullah Khan, Tahira Shehzadi, Didier Stricker, Muhammad Zeshan Afzal In: Intelligent Systems and Applications. Intelligent Systems Conference (IntelliSys-2025), 11th Intelligent Systems Conference 2025, Amsterdam, Netherlands, Springer Nature Switzerland, 8/2025. Details | Link 1 Towards Unconstrained 2D Pose Estimation of the Human Spine Muhammad Saif Ullah Khan, Stephan Krauß, Didier Stricker In: Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR) Workshops. International Workshop on Computer Vision in Sports (CVsports-2025), 11th International Workshop, located at CVPR 2025, June 11-15, Nashville, TN, USA, IEEE/CVF, 6/2025. Details | Link 1 ToF-360 – A Panoramic Time-of-flight RGB-D Dataset for Single Capture Indoor Semantic 3D Reconstruction Hideaki Kanayama, Mahdi Chamseddine, Suresh Guttikonda, So Okumura, Soichiro Yokota, Didier Stricker, Jason Raphael Rambach In: IEEE/CVF (Hrsg.). 21st. CVPR Workshop on Perception Beyond the Visible Spectrum (PBVS-2025), June 11-15, Nashville, Tennessee, USA, IEEE, 2025. Details | Link 1 | Link 2 HandMvNet: Real-Time 3D Hand Pose Estimation Using Multi-View Cross-Attention Fusion Muhammad Asad Ali, Nadia Robertini, Didier Stricker In: Proceedings of the 20th International Joint Conference on Computer Vision, Imaging and Computer Graphics Theory and Applications. International Conference on Computer Vision Theory and Applications (VISAPP-2025), February 26-28, Porto, Portugal, Vol. 2, ISBN 978-989-758-728-3, SCITEPRESS, Portugal, 2/2025. Details SituationalLLM: Proactive Language Models with Scene Awareness for Dynamic, Contextual Task Guidance [version 1; peer review: awaiting peer review] Muhammad Saif Ullah Khan, Muhammad Zeshan Afzal, Didier Stricker In: Open Research Europe, Vol. 5, No. 61, Pages 1-14, Open Research Europe, 3/2025. Details MARVEL-40M+: Multi-Level Visual Elab",
  "content_length": 136859,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:55"
}