{
  "name": "Diego Elias Costa",
  "homepage": "https://diegoeliascosta.github.io",
  "status": "success",
  "content": "Diego Elias Costa Diego Elias Costa Assistant Professor at Concordia University. Follow Twitter GitHub Google Scholar ResearchGate Hi, I am Diego and this was my academic space. Please visit my group’s lab website REALISELab as this website will no longer be updated. I am an Assistant Professor in the Computer Science and Software Engineering (CSSE) department of Concordia University If you are interested in joining my research group, please check the prospective students page. Before, I worked as an Assistant Professor with the Computer Science department at UQAM in Montréal, Canada. I was a postdoctoral researcher at Concordia University, Canada, working with Prof. Emad Shihab. I received my PhD from Heidelberg University, Germany in the Parallel and Distributed Systems Group of Prof. Andrzejak. I am interested in Software Engineering Research. In a few words, I want to reduce the burden on software developers by tackling aspects related to software maintenance and software performance. I like to leverage historical project data (e.g., GitHub) through Data Mining methods and apply Machine Learning and Statistical Analysis techniques to understand the problems developers face and provide insights/solutions to alleviate the issues. For details about my research, please check my publication list. Research Interests Software Engineering Performance Engineering Software Ecosystems Mining Software Repositories Software Development Bots News May 2024: I am thrilled to announce that FRQNT has funded my research program “Harnessing Software Ecosystems to Support Library Maintainers”, as part of the Support for New Academics program. April 2024: Rachna received the Best Student Presentation Award at MSR for her presentation on the work “The role of library versions in Developer-ChatGPT conversations”. Congratulations Rachna! January 2024: Our paper “The role of library versions in Developer-ChatGPT conversations” was accepted at the MSR 2024 Mining Challenge track! January 2024: Our paper “Predicting the Impact of Crashes Across Release Channels” was accepted in the Industry Track of MSR 2024! December 2023: I will be part of the program committee of ICSE 2025. October 2023: Our paper “SE4AI: A Training Program Considering Technical, Social, and Professional Aspects of AI-based Software Systems” was accepted at the IEEE Software journal. August 2023: Our paper “Understanding the Helpfulness of Stale Bot for Pull-based Development”” was accepted in the TOSEM journal! July 2023: New chapter of my academic career! I am thrilled to announce that I will be joining the CSSE department at Concordia University as a tenure-track assistant professor! July 2023: Our paper “Where to Go Now? Finding Alternatives for Declining Packages in the npm Ecosystem” was accepted at ASE 2023! Jun 2023: Our paper “An Empirical Study on Bugs Inside PyTorch: A Replication Study” was accepted at ICSME 2023! Pre-print coming soon. May 2023: Our paper “Empirical analysis of security-related code reviews in npm packages” was accepted in the JSS journal! Pre-print coming soon. May 2023: Our paper “Dependency Update Strategies and Package Characteristics” was accepted in the TOSEM journal! Apr 2023: I am thrilled to announce that I receive a NSERC Discovery grant to work on Dependency Management problems! Hiring of students will start soon! Mar 2023: Our paper “Empirical analysis of security vulnerabilities in Python packages” was published in the EMSE journal! Dec 2022: Our paper “Diversity Awareness in Software Engineering Participant Research” was accepted at ICSE SEIS track! Dec 2022: Our paper “Empirical Analysis of Security Vulnerabilities in Python Packages” was acceped in the EMSE journal! Pre-print coming soon Nov 2022: Our paper “Can Ensembling Pre-processing Algorithms Lead to Better Machine Learning Fairness?” was accepted in the IEEE Computing journal! Oct 2022: Our paper “On the Discoverability of npm Vulnerabilities in Node.js Projects” was accepted in the TOSEM journal! Aug 2022: Our paper “Achievement Unlocked: A Case Study on Gamifying DevOps Practices in Industry” was accepted in the ESEC/FSE indutry track! Aug 2022: New chapter of my academic career! I will join the Computer Science Department of Université du Québec à Montréal (UQAM) as a tenure-track assistant professor! July 2022: Our paper “Not All Dependencies are Equal: An Empirical Study on Production Dependencies in NPM” was accepted in the ASE conference! July 2022: I will be the co-chair of the Data Challenge Track of ICPE 2023! Stay tuned for more info. Jun 2022: Our paper “Open Source Software: An Approach to Controlling Usage and Risk in Application Ecosystems” was accepted in the SPLC conference! Apr 2022: Our paper “On Wasted Contributions: Understanding the Dynamics of Contributor-Abandoned Pull Requests” was accepted in the TOSEM journal! Mar 2022: Our paper “A case study on the stability of performance tests for serverless applications” was accepted in the JSS journal! Mar 2022: We will present 3 TSE papers at ICSE 2022 as a journal first presentation. Check our their pre-print here: “Breaking Type Safety in Go” “Dependency Smells in JavaScript Projects” “Comparison of Chatbot NLU Platforms”. Feb 2022: Our paper “Toward The Personalization of Biceps Fatigue Detection Model For Gym Activity” was accepted in the Sensors journal! Jan 2022: I will be part of the Program Committees of MSR 2022, ICSME 2022, and SCAM 2022! Oct 2021: Our paper “Towards Using Package Centrality Trend to Identify Packages in Decline” has been accepted in IEEE Transactions of Engineering Management! Oct 2021: Our paper “Human Activity Recognition: A Comparative Study to Assess the Contribution Level of Accelerometer, ECG, and PPG Signals” has been accepted in the Sensors journal! Sep 2021: Honored to have received the award for Distinguished Reviewer at ICSME 2021! Aug 2021: Our paper “Dependency Smells in JavaScript Projects” was accepted at IEEE TSE! July 2021: Our paper “How do developers use the Java Stream API?” was accepted at ICCSA’21! May 2021: Our paper “A Comparison of Natural Language Understanding Platforms for Chatbots in Software Engineering” was accepted at IEEE TSE! Mar 2021: I will be part of the Program Committee at SCAM 2021. Mar 2021: I will be part of the Program Committee at SBES 2021. Feb 2021: Our paper “On the Use of Dependabot Security Pull Requests” was accepted at MSR’21! Feb 2021: Our paper “How Effective is Continuous Integration in Indicating Single-Statement Bugs?” was accepted at the MSR’21 - Mining Challenge track! Feb 2021: Our paper “Breaking Type-Safety in Go: An Empirical Study on the Usage of the unsafe Package” was accepted at IEEE TSE! Feb 2021: Our paper “On the Impacts and Implications of Biceps Muscle Fatigue in Human Activity Recognition” was accepted in the Sensors Journal! Jan 2021: I will be part of the program committee of ICSME 2021. Jan 2021: Our paper “Empirical Analysis of Security Vulnerabilities in Python Packages” got accepted at SANER 2021! Dec 2020: I will be part of the program committee of MSR 2021, both in the Techinal Track and the Registered Reports track. Nov 2020: I will be part of the program committee of BotSE 2021. Enter your search term...",
  "content_length": 7264,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:54"
}