{
  "name": "Diego Gómez-Zará",
  "homepage": "https://cse.nd.edu/faculty/diego-gomez-zara",
  "status": "success",
  "content": "Diego Gómez-Zará - Computer Science and Engineering Assistant Professor, Computer Science and Engineering Contact Email dgomezara@nd.edu Phone 574-631-0409 Office 353 Fitzpatrick Hall Areas of Interest Diego Gómez-Zará is an Assistant Professor of Computer Science and Engineering at the University of Notre Dame, where he directs the RINGZ Lab (Research in Networks and Groups). His long-term goal is to design technologies that foster inclusive, effective, and innovative teamwork across science, education, and organizations. His research bridges computational social science, human-computer interaction, and network science, with a focus on how computational systems can help people organize, collaborate, and innovate together. At Notre Dame, he teaches courses in Human-Computer Interaction and Data Science, engaging students in the design, analysis, and evaluation of interactive systems. Before joining Notre Dame, he was a postdoctoral fellow at Northwestern University’s Kellogg School of Management. He received his Ph.D. in Technology and Social Behavior, a joint program in Computer Science and Communication, also at Northwestern University. His recent publications span topics such as mixed reality, human–AI collaboration, and collaborative systems design. This research has received Best Paper Awards at leading venues in human–computer interaction, including ACM CHI, CSCW, and ICA. His work has been supported by the Alfred P. Sloan Foundation, DARPA, the National Science Foundation, Microsoft Research, IBM, Amazon Research, and Slack Inc. Websites Google Scholar Human-Computer Interaction Research Group Education Ph.D., M.S., Technology and Social Behavior, Northwestern University, 2021 M.S., Computer Science, Pontificia Universidad Católica de Chile, 2012 B.S., Industrial Engineering, Pontificia Universidad Católica de Chile, 2010 News ND Engineering welcomes 21 new faculty in 2021 Departments Aerospace and Mechanical Engineering Chemical and Biomolecular Engineering Civil and Environmental Engineering and Earth Sciences Computer Science and Engineering Electrical Engineering Faculty/Staff Resources",
  "content_length": 2134,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:01"
}