{
  "name": "Diego Perez Liebana",
  "homepage": "http://www.diego-perez.net",
  "status": "success",
  "content": "Diego Perez Liebana Diego Perez Liebana Home Research Publications Service More Biography Born in Madrid (Spain) in 1983 and living in London (United Kingdom). I am a Senior Lecturer in Computer Games and Artificial Intelligence at Queen Mary University of London (UK). I hold a Ph.D in Computer Science from the University of Essex (2015) and a Master degree in Computer Science from University Carlos III (Madrid, Spain; 2007). My research is centred in the application of Artificial Intelligence to games, Tree Search and Evolutionary Computation. I am especially interested on the application of Statsitical Forward Planning methods (such as Monte Carlo Tree Search and Rolling Horizon Evolutionary Algorithms) to modern games, and also on General Video Game Playing, which involves the creation of content and agents that play any real-time game that is given to it. I am author of more than 90 papers in the field of Game AI, published in the main conferences of the field of Computational Intelligence in Games and Evolutionary Computation, and I was once general chair of IEEE CoG 2020. I have publications in highly respected journals such as IEEE TCIAIG (the top journal on the Game AI field) and IEEE TEC (which counts with one of highest impact factors in Computer Science). I have also organised international competitions for the Game AI research community, such as the Physical Travelling Salesman Competition, and the General Video Game AI Competition, held in IEEE (WCCI, CIG) and ACM (GECCO) International Conferences. I also experience in the videogames industry as a game programmer (Revistronic; Madrid, Spain), with titles published for both PC and consoles. I worked as a software engineer (Game Brains; Dublin, Ireland), where I was in charge of developing AI tools that can be applied to the latest industry videogames. As a lecturer I teach modules related to game development and the application of Artificial Intelligence to Games. You can send me an email to diego.perez [at] qmul [dot] ac [dot] uk",
  "content_length": 2027,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:00"
}