{
  "name": "Diego Mollá",
  "homepage": "https://researchers.mq.edu.au/en/persons/diego-molla-aliod",
  "status": "success",
  "content": "Diego Molla-Aliod - Macquarie University View Scopus Profile Diego Molla-Aliod Dr Senior Lecturer, School of ComputingData Horizons Research CentreFrontier AI Research Centre https://orcid.org/0000-0003-4973-0963 Phone+61 2 9850 9531Emaildiego.molla-aliodmq.eduau h-index 506 Citations 11 h-index Calculated based on number of publications stored in Pure and citations from Scopus 1994 …2025 Research activity per year Personal profile BiographyMost Significant Research Contributions My research contribution is centered on the application of theoretical linguistics to specific real-world problems, in particular to automated text-based question answering and summarisation. Since 2009 I have focused on medical text processing. I joined the University of Zurich and became the principal researcher in the ExtrAns and WebExtrAns projects (from 1996 to 2001). Both projects were based on the development of answer extraction systems. Answer extraction systems locate those sentences in the source text that contain the answer posed by the user. The outcome of the project was a working system that handles questions about 500 Linux/Unix documentation documents (\"manpages\"). I was the principal designer of the overall system and the integration of all modules. I was also the principal contributor to the design of the logical forms and the question-answering method that used the logical forms. The success of ExtrAns and WebExtrAns is evident from the fact that the system is cited as a pioneering question-answering system, an example of a question answering system of technical domains, and an example of the use of logical forms for question answering. In Macquarie University I established the AnswerFinder project. AnswerFinder is a question answering system that combines the use of logical information (inspired from ExtrAns and WebExtrAns), state-of-the-art approaches in question answering, and innovative graph-based machine learning methods to find the exact answer to the user question. AnswerFinder has participated in the question answering track of the Text REtrieval conference (TREC), the main international forum for the evaluation of question-answering systems, between 2003 and 2006. AnswerFinder is in fact the only Australian-based question answering system that has participated in the question answering track of TREC. Since 2009 I have led various projects related to the development and application of text-processing technologies that help the medical doctor find and appraise clinical evidence found in the vast resources of medical publications. I have gathered a summarisation corpus sourced from the Journal of Family Practice, and used the corpus to develop and evaluate techniques for text summarisation, clustering, keyword extraction, and appraisal of the medical evidence. More recently, I have been working on the use of Large Language Models and Agentic design to develop task-oriented conversational agents. I have also been working on the analysis of social media posts for mental health.BiographyCV: http://comp.mq.edu.au/~diego/cv.html Fingerprint Dive into the research topics where Diego Molla-Aliod is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Answer Extraction Computer Science 100% question answering system Computer Science 99% Extractive Summarization Computer Science 76% Learning System Computer Science 76% Machine Learning Computer Science 72% Participating System Computer Science 61% Large Language Model Computer Science 51% Information Retrieval Computer Science 50% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2009 2009 2010 2012 2013 2017 2017 1 Active 6 Finished Projects per year Exploration of Deep Learning Techniques for Text MiningMolla-Aliod, D. (Primary Chief Investigator)1/07/17 → …Project: Research Application of Bayesian inference techniques to natural language processing of medical textMolla-Aliod, D. (Primary Chief Investigator)25/08/13 → 20/12/13Project: Research A GPU-based Cluster for ComputingDras, M. (Primary Chief Investigator), Johnson, M. (Chief Investigator), Mans, B. (Chief Investigator), Molla-Aliod, D. (Chief Investigator) & Honnibal, M. (Chief Investigator)1/01/13 → 31/12/13Project: Research Optimization Techniques for Human Language TechnologyMolla-Aliod, D. (Primary Chief Investigator), Johnson, M. (Chief Investigator), Ekbal, A. (Partner Investigator), Saha, S. (Partner Investigator) & Bhattacharyya, P. (Partner Investigator)6/08/12 → 30/04/13Project: Research Generation and Evaluation of Clinical Evidence-based Summaries on DemandMolla-Aliod, D. (Primary Chief Investigator)1/07/10 → 30/06/12Project: Research View all 7 projects Research Outputs Research output per year 1994 2000 2003 2005 2006 2007 2010 2012 2013 2014 2016 2017 2022 2025 82 Conference proceeding contribution 22 Conference paper 17 Article 3 Chapter 2 More 1 Foreword/postscript/introduction 1 Editorial Research output per year Research output per year Investigating answer validation using noise identification and classification in goal-oriented dialoguesMirabi, S., Ofoghi, B., Yearwood, J., Molla-Aliod, D. & Mak-Hau, V., 2025, Proceedings of the 17th International Conference on Agents and Artificial Intelligence - Volume 2: ICAART. Rocha, A. P., Steels, L. & van den Herik, H. J. (eds.). Porto, Portugal: SciTePress, p. 658-669 12 p. (International Conference on Agents and Artificial Intelligence).Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Open Access Large Language Model 100% Problem Statement 16% multi agent 16% Linear Programming Problem 16% System Effectiveness 16% Exploring instructive prompts for large language models in the extraction of evidence for supporting assigned suicidal risk levelsChen, J., Nguyen, V., Dai, X., Mollá, D., Paris, C. & Karimi, S., 2024, Proceedings of the 9th Workshop on Computational Linguistics and Clinical Psychology (CLPsych 2024). Yates, A., Desmet, B., Prud'hommeaux, E., Zirikly, A., Bedrick, S., MacAvaney, S., Bar, K., Ireland, M., Ophir, Y. & Ophir, Y. (eds.). Stroudsburg, USA: Association for Computational Linguistics (ACL), p. 197-202 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Open AccessFile Large Language Model 100% Mental Health 100% Social Media Discourse Analysis 66% Mental Disorder 33% Open Source 33% 4 Citations (Scopus) 29 Downloads (Pure) Overview of the 2024 ALTA shared task: detect automatic AI-generated sentences for human-AI hybrid articlesMollá, D., Xu, Q., Zeng, Z. & Li, Z., 2024, Proceedings of the 22nd Annual Workshop of the Australasian Language Technology Association. Canberra: Australasian Language Technology Association, p. 197-202 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Open AccessFile Artificial Intelligence 100% Participating System 50% 2 Citations (Scopus) 24 Downloads (Pure) Synthetic dialogue dataset generation using LLM agentsAbdullin, Y., Molla-Aliod, D., Ofoghi, B., Yearwood, J. & Li, Q., 2024, Proceedings of the Third Workshop on Natural Language Generation, Evaluation, and Metrics (GEM). Stroudsburg: Association for Computational Linguistics (ACL), p. 181-191 11 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Open AccessFile Conversational Agent 100% Large Language Model 100% Evaluation Metric 50% Problem Description 50% Generative Pre-Trained Transformer 4 50% 1 Downloads (Pure) Using large language models to evaluate biomedical query-focused summarisationHijazi, H., Mollá, D., Nguyen, V. & Karimi, S., 2024, Proceedings of the 23rd Workshop on Biomedical Natural Language Processing. Stroudsburg: Association for Computational Linguistics, p. 236-242 7 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Open Access Large Language Model 100% Evaluation Metric 20% question answering system 20% Low Correlation 20% View all 126 research outputs Prizes Winner - Faculty of Science and Engineering Award for Inter-School Collaboration - 2023Nayak, A. (Recipient), Mahmood, A. (Recipient), Beheshti, A. (Recipient), McIver, A. (Recipient), Bilgin, A. (Recipient), Liquet-Weiland, B. (Recipient), Svensson, C. (Recipient), Ramakrishnan, C. (Recipient), Smith, C. (Recipient), Molla-Aliod, D. (Recipient), Vatsalan, D. (Recipient), Xue, E. (Recipient), Gupta, G. (Recipient), Sofronov, G. (Recipient), Baker, G. (Recipient), Liu, G. (Recipient), Asghar, H. (Recipient), Doosti, H. (Recipient), Zhu, H. (Recipient), Jiang, I. (Recipient), Zheng, J. (Recipient), Lin, H. (Recipient), Wu, J. (Recipient), Ma, J. (Recipient), Binkowski, K. (Recipient), Dras, M. (Recipient), Manuguerra, M. (Recipient), Orgun, M. (Recipient), Lay, M. (Recipient), Zou, N. (Recipient), Kordzakhia, N. (Recipient), Busch, P. (Recipient), Graham, P. (Recipient), Schwitter, R. (Recipient), Chen, S. (Recipient), Smith, S. (Recipient), Cassidy, S. (Recipient), Prvan, T. (Recipient), Fung, T. (Recipient), Li, Y. (Recipient), Wang, Y. (Recipient), Zhang, Y. (Recipient) & Zhou, Y. (Recipient), 2023Prize: Other distinction School Collaboration 100%",
  "content_length": 9722,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:59"
}