{
  "name": "Diego F. Aranha",
  "homepage": "https://dfaranha.github.io",
  "status": "success",
  "content": "Diego F. Aranha Search Diego F. Aranha Associate Professor Aarhus University I am an Associate Professor in the Department of Computer Science at Aarhus University, Denmark, where I conduct research in cryptographic engineering and security of real-world systems. I also lead the Cybersecurity Work Package at DIGIT and contribute to COBRA as Principal Investigator. I have received two Google Latin America Research Awards for privacy, and the MIT TechReview’s Innovators Under 35 Brazil Award for my work in electronic voting. Research Interests Efficient secure cryptography in software Elliptic Curve Cryptography (ECC) and Pairing-Based Cryptography (PBC) Postquantum Cryptography (PQC) Security in Wireless Sensor Networks (WSNs) and the Internet of Things (IoT) Side-Channel Analysis (SCA) and countermeasures Cryptography based on physical assumptions (PUFs) Privacy-preserving computing Computational anonymity Electronic voting Systems security Professional experience Aarhus University, 2020-Present Associate Professor Aarhus University, 2018-2020 Assistant Professor University of Campinas, 2014-2018 Assistant Professor University of Brasilia, 2011-2014 Assistant Professor CertiVox/MIRACL, 2010-2011 Consultant and contractor Education Ph.D. in Computer Science, 2007-2011 Institute of Computing, University of Campinas Visiting Ph.D. student, 2010-2011 Combinatorics & Optimization, University of Waterloo M.Sc. in Computer Science, 2005-2007 Institute of Computing, University of Campinas B.Sc. in Computer Science, 2000-2005 Department of Computer Science, University of Brasilia Recent Publications See all publications ABE Cubed: Advanced Benchmarking Extensions for ABE Squared Sven Argo, Marloes Venema, Doreen Riepel, Tim Güneysu, Diego F. Aranha IACR Transactions on Cryptographic Hardware and Embedded Systems (TCHES) 2025 DOI PDF BibTeX Homomorphic WiSARDs: Efficient Weightless Neural Network Training over Encrypted Data Leonardo Neumann, Antonio Guimarães, Diego F. Aranha, Edson Borin ACNS (3) 2025 DOI PDF BibTeX Key recovery on static Kyber based on transient execution attacks Luccas Ruben J. Constantin-Sukul, Rasmus Ø. Gammelgaard, Alexander N. Henriksen, Diego F. Aranha Proceeding of the 1st Microarchitecture Security Conference (uASC ‘25) 2025 DOI PDF BibTeX Optimized One-Dimensional SQIsign Verification on Intel and Cortex-M4 Marius A. Aardal, Gora Adj, Arwa Alblooshi, Diego F. Aranha, Isaac Andrés Canales Martinez, Jorge Chávez-Saab, Décio Luiz Gazzoni Filho, Krijn Reijnders, Francisco Rodríguez-Henríquez IACR Transactions on Cryptographic Hardware and Embedded Systems (TCHES) 2025 PDF BibTeX Project SQIsign Secure and efficient transciphering for FHE-based MPC Diego F. Aranha, Antonio Guimarães, Clément Hoffmann, Pierrick Méaux IACR Transactions on Cryptographic Hardware and Embedded Systems (TCHES) 2025 DOI PDF BibTeX Invited and Contributed Talks See all talks There's a lot of scary software out there Oct 30, 2025 Halloween edition: DevUps Horror Stories Diego F. Aranha Project MobiSec A decade probing the Brazilian voting machine Feb 14, 2024 CRC Seminar Series Diego F. Aranha Slides Video Project eVotingBR Posts See all posts Oct 29, 2025 [en_US] We need to talk about article 263 The Danish cybersecurity law needs to change to not penalize legitimate security research. Jun 20, 2018 [pt_BR] Registro físico do voto eletrônico? Voto impresso pode tornar eleições mais seguras e transparentes Projects * All Active Secure Computation Infrastructures MPC and strong authentication protocols for secure retail Publications External link Residue Number Systems for Cryptography Faster secure cryptographic software Publications External link SQIsign 2.0 submission to NIST Fast and compact isogeny-based signatures Publications External link Mobile Security Security analysis of MitID and other mobile apps Publications Verifiable Cryptographic Software High-assurance cryptography Publications External link Electronic Voting in Brazil Analyzing the security of electronic voting in Brazil Publications External link Verifiable Electronic Voting Improving electronic voting systems that can be verified Publications Blockchain Academy Network Training materials and use cases for secure blockchain applications Publications External link Crypto for IoT Efficient and Secure Cryptography for IoT Publications Encryption Policy Strong/end-to-end encryption policy debate Publications Private ML Machine learning over encrypted data using homomorphic encryption Publications External link PUFs for SoCs Physical Unclonable Functions for SoC Devices Publications SecExec Secure execution of cryptographic algorithms Publications External link YouInspect Crowdsourced verification of election results Publications External link RELIC is an Efficient LIbrary for Cryptography A meta-toolkit to build fast crypto libraries Publications External link Supervision Currently (co-)supervised PhD students: Marius Aardal (with Bas Spitters) Adam Blatchley Hansen (co- with Jesper Buus Nielsen) Past PhD students: Antonio Guimarães Jr. (co- with Edson Borin), now a postdoc at IMDEA Benjamin Salling Hvaas (with Bas Spitters), graduated 2023, now Security Architect at Alexandra Institute Pedro Geraldo Morelli Rodrigues Alves, graduated 2023, now Senior GPU Engineer at Zama Akira Takahashi (co- with Claudio Orlandi), graduated 2022, now Research Scientist at JP Morgan Jheyne Nayara Ortiz (co- with Ricardo Dahab), graduated 2022, now Embedded Software Cryptographer at STMicroelectronics Amanda Cristina Davi Resende, graduated 2021, now faculty at UEMS Narcise Bang Mbiang (co- with Emmanuel Fouotsa), graduated 2020 Caio Hoffman (co- with Guido Araujo and Mario Côrtes), graduated 2017, now Hardware Design Engineer at Intrinsic ID Eduardo Moraes de Morais, (co- with Ricardo Dahab), graduated 2015, now Cryptographic Engineer at Lurk Lab Past MSc. students: 49 students at the Department of Computer Science 3 students at the Department of Mathematics 10 students at University of Brasília and University of Campinas Past Postdocs: Karina Mochetti, now faculty at UBC Service Distinguished PC member of EUROCRYPT 2024 Co-Editor in Chief of TCHES 2023 Editorial Board Member of TCHES (2017-2019, 2021-2022), JUCS Steering Committee Member of LATINCRYPT, CHES Founder (with Jeroen van de Graaf) of Workshop on Election Technology (WTE) Reviewer for FAPESP, CONACYT/ANID, MOST and ERC funding agencies Program co-Chair of CHES 2023 (with Marcel Medwed) ASCRYPTO 2023 and INCA 2023 (with Sofia Celi) WTE 2017, 2015, 2014 (co-founded with Jeroen van de Graaf) LATINCRYPT 2014 (with Alfred Menezes) SBSEG 2014 (with Marinho P. Barcellos) Program Committee Member of CHES 2026, 2025, 2022, 2021, 2019, 2018, 2017 EUROCRYPT 2026, 2025, 2024 CRYPTO 2025 LATINCRYPT 2025, 2023, 2019, 2017, 2015 E-Vote-ID 2025 NordSec 2025, 2024 USENIX Security 2024 FDTC 2024 CFAIL 2024, 2020 COSADE 2024, 2022, 2021, ACNS 2024, 2017 SPACE 2023, 2021, 2017 FC 2021, 2020, 2019, 2018, 2017 SAC 2021, 2020, 2019, 2018, WCC 2021 WAIFI 2020, 2018 CARDIS 2020 CIFS 2020 PKC 2019, 2018 INDOCRYPT 2019, 2018, 2016 CCNC 2019, 2018, 2017 IEEE Wireless Africa 2019 SBSEG 2018, 2017, 2016, 2015, 2013, 2012 KANGACRYPT 2018 LightSec 2018 ISC 2016 ICFCNA 2014 PAIRING 2013 Cite × Copy Download",
  "content_length": 7310,
  "method": "requests",
  "crawl_time": "2025-12-01 13:01:55"
}