{
  "name": "Dietrich Albert",
  "homepage": "http://cognitive-science.at/team/dietrich-albert",
  "status": "success",
  "content": "Dietrich Albert – Cognitive Science Section Albert, Dietrich, em. Univ.-Prof. Dr.rer.nat. Head of Cognitive Science Section Department of Psychology University of Graz E-Mail: dietrich.albert[at]uni-graz.at Mobile: +43(0)664 73663043 Skype: dietrich_albert Adress: Department of Pychology, c/o Dietrich Albert, University of Graz, Universitätsplatz 2/D, 8010 Graz, Austria Web: UniGraz online, ORCID, ResearchGate Prof. Dr. Dietrich Albert graduated from the University of Göttingen (Germany) in Psychology and received his Dr.rer.nat. and postdoctoral degree (Habilitation in Psychologie) from the University of Marburg/Lahn (Germany). He was Professor of Experimental Psychology at the University of Heidelberg (Germany). Currently he is head of the Cognitive Science Section and Professor emeritus of Psychology at the University of Graz (Austria). During the academic year 2001/2002, he has been visiting professor at Hiroshima University, Faculty of Education (Japan). His research topics cover several areas in experimental and applied psychology. His expertise in European and national R&D projects is documented by several grants. The research focus within these projects has been on Education, e-Learning, Human-Computer Interaction, Knowledge Engineering, Cognitive Psychology, Knowledge Management, and Evaluation. He is chairperson of the European Japan Experts Association e.V. (EJEA) and Associate Editor for Frontiers in Artificial Intelligence: AI for Human Learning and Behavior Change. To see a list of projects Dietrich Albert has been involved in please click here. List of scientific publications: Alphabetical List (work in progress) Chronological List Categorised KFU Graz TU Graz (2009ff.) News Policy Workshop on Raw Material Recovery in Brussels – 13 November 2025 ITHACA Final Event – Beyond the Algorithm: From Research to Action for Democratic Renewal Paper presented: “Inclusive AI-Enhanced Civic Engagement: Empowering Marginalized Voices through Inclusion by Design” Team Research Agenda Projects PublicationsAlphabetical List Chronological List Software AboutContact & Location Imprint",
  "content_length": 2118,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:10"
}