{
  "name": "Dieter Hogrefe",
  "homepage": "https://www.uni-goettingen.de/de/133497.html",
  "status": "success",
  "content": "Dieter Hogrefe - Georg-August-Universität Göttingen ✖ Suchbegriff Mit Google™ suchen Interne Suche nutzen (eingeschränkte Ergebnisqualität) Home Forschung Publikationen Kontakt Menü Menü Suchbegriff Suchbegriff Mit Google™ suchen Interne Suche nutzen (eingeschränkte Ergebnisqualität). Suche starten Mit der Nutzung der Google™ Suche stimmen Sie den Datenschutzbestimmungen von Google™ zu Auf der Suche nach Personen, Veranstaltungen oder Räumen ? Zum eCampus Schließen Dieter Hogrefe Prof. Dr. Dieter Hogrefe Goldschmidtstr. 737077 GöttingenTel. +49 551 39 172001Fax. +49 551 39 18172000hogrefe@informatik.uni-goettingen.de FORSCHUNGSSCHWERPUNKT Development of new communication protocols, in particular for the support of signalling services, that enhance security, quality and configurability of internet connections in general and in the mobile context in particular.Methodology for development of new protocols, in particular or specification, implementation and testing.Economic and legal issues arising from new and enhanced communication services over the internet, in particular in the mobile context CURRICULUM VITAE Dieter Hogrefe is full professor (C4) for Telematics at the University of Göttingen since 2002. He graduated at Philips Exeter Academy, USA, in 1976 and studied Computer Science and Mathematics at the University of Hannover, Germany, where he graduated with PhD in 1985. From 1983 to 1986 he was with the SIEMENS research center in Munich and worked in the area of analysis of telecommunication systems. He was responsible for the protocol simulation and analysis of the CCS No. 7. From 2003-2023 he was director of the Institute of Computer Science. From 1996 until 2010 Prof. Hogrefe was chairman of the Technical Committee Methods for Testing and Specification at the European Telecommunication Standards Institute, ETSI. From 2011 until 2013 he was dean of the faculty of mathematics and computer science. His research activities are directed towards Computer Networks and Communication Software Engineering. He published numerous papers and two books on Internet technology, security of wireless sensor networks, analysis, simulation and testing of formally specified communication systems. Prof. Hogrefe held full professor positions at the Universities of Bern, Lübeck, and Göttingen and visiting positions at University of Dortmund, Technical University Budapest, UC Berkeley and Hamilton University. Prof. Hogrefe has been retired since 2024 VERÖFFENTLICHUNGEN LbSP: Load-balanced Secure and Private Autonomous Electric Vehicle Charging Framework with Online Price Optimization Y Yuan, P Memarmoshrefi, T Baker, D Hogrefe - IEEE Internet of Things Journal, 2022 An AI-based Transmission Power-control Certificate Omission in Vehicular Ad-Hoc Networks Emmanuel Charleson Dapaah, Parisa Memarmoshrefi, Dieter Hogrefe. 13th EAI International Conference on Ad Hoc Networks (EAI ADHOCNETS 2021), December 2021, Online Conference. FedRD: Privacy-preserving adaptive Federated learning framework for intelligent hazardous Road Damage detection and warning. Yuan, Yachao, Yali Yuan, Thar Baker, Lutz Maria Kolbe, and Dieter Hogrefe. Future Generation Computer Systems, 2021. A Transmission Power-control Certificate Omission Scheme in VANETs. Emmanuel Charleson Dapaah, Parisa Memarmoshrefi, Dieter Hogrefe. 12th EAI International Conference on Ad Hoc Networks (EAI ADHOCNETS 2020), November 2020, Online Conference. CL-CPPA: Certificate-Less Conditional Privacy-Preserving Authentication Protocol for the Internet of Vehicles. Jiliang Li, Yusheng Ji, Kim-Kwang Raymond Choo, and Dieter Hogrefe. IEEE Internet of Things Journal, 2019. AEP-PPA: An Anonymous, Efficient and Provably-Secure Privacy-Preserving Authentication Protocol for Mobile Services in Smart Cities. Jiliang Li, WeiGuo Zhang, Kim‐Kwang Raymond Choo, Vivek Dabra, Saru Kumari, and Dieter Hogrefe. Journal of Network and Computer Applications, 2019. A Security Aware Fuzzy Enhanced Ant Colony Optimization Routing in Mobile Ad hoc Networks. Hang Zhang, Arne Bochem, Xu Sun, and Dieter Hogrefe. In The 14th International Conference on Wireless and Mobile Computing, Networking and Communications (WiMob 2018), Limassol, Cyprus. IEEE, October 2018. A Security Aware Fuzzy Enhanced Reliable Ant Colony Optimization Routing in Vehicular Ad hoc Networks. Hang Zhang, Arne Bochem, Xu Sun, and Dieter Hogrefe. In The 29th IEEE Intelligent Vehicles Symposium (IV'18), Changshu, China, pages 1071--1078. IEEE, 2018. EPA-CPPA: An Efficient, Provably-Secure and Anonymous Conditional Privacy-Preserving Authentication Scheme for Vehicular Ad Hoc Networks. Jiliang Li, Kim‐Kwang Raymond Choo, WeiGuo Zhang, Saru Kumari, Joel Rodrigues, Muhammad Khurram Khan, and Dieter Hogrefe. Vehicular Communications, 2018. Unchained Identities: Putting a Price on Sybil Nodes in Mobile Ad hoc Networks. Arne Bochem, Benjamin Leiding, and Dieter Hogrefe. In Security and Privacy in Communication Networks (SecureComm 2018), Singapore, Singapore, August 2018. Hardware based Two-Factor User Authentication for the Internet of Things. Mehdi Akbari Gurabi, Omar Alfandi, Arne Bochem, and Dieter Hogrefe. In 14th International Wireless Communications and Mobile Computing Conference (IWCMC 2018), Limassol, Cyprus, June 2018. Employing Fuzzy Logic to Provide Security Awareness in ACO Routing for MANETs. Hang Zhang, Arne Bochem, Xu Sun, and Dieter Hogrefe. In IEEE Wireless Communications and Networking Conference (WCNC 2018), Barcelona, Spain, April 2018. Poster. Security Analysis and Improvement of A Mutual Authentication and /Key Agreement Solution for Wireless Sensor Networks Using Chaotic Maps. Jiliang Li, WeiGuo Zhang, Saru Kumari, Kim‐Kwang Raymond Choo, and Dieter Hogrefe. Transactions on Emerging Telecommunications Technologies, 2018. Multi-Device Fusion for Enhanced Contextual Awareness of Localization in Indoor Environments. Yali Yuan, Christian Melching, Yachao Yuan, and Dieter Hogrefe. IEEE Access, 2018. Two Layers Multi-class Detection method for network Intrusion Detection System. Yali Yuan, Liuwei Huo, and Dieter Hogrefe. In Computers and Communications (ISCC), 2017 IEEE Symposium on, pages 767--772. IEEE, 2017. A Survey of Ant Colony Optimization based Routing Protocols for Mobile Ad hoc Networks. Hang Zhang, Xi Wang, Parisa Memarmoshrefi, and Dieter Hogrefe. IEEE Access, 5:24139--24161, 2017. Poster Abstract: Streamlined Anomaly Detection in Web Requests Using Recurrent Neural Networks. Arne Bochem, Hang Zhang, and Dieter Hogrefe. In IEEE International Conference on Computer Communications (INFOCOM 2017), Atlanta, USA, May 2017. A Survey of Location Aware Ant Colony Optimization Routing Protocols in MANETs. Hang Zhang, Xi Wang, and Dieter Hogrefe. In 10th International Conference on Bio-inspired Information and Communications Technologies (BICT17), NYC, USA, March 2017. A Security Aware Fuzzy Embedded ACO Based Routing Protocol (SAFACO) in VANETs. Hang Zhang, Xi Wang, and Dieter Hogrefe. In Kuinam Kim and Nikolai Joukov, editors, Information Science and Applications 2017, pages 274--281, Singapore, 2017. Springer Singapore. Minimizing intra-flow interference in multi-channel mesh networks: An optimization approach. Somayeh Taheri, Roman Seibel, and Dieter Hogrefe. In 35th IEEE International Performance Computing and Communications Conferencei (IPCCC 2016), Las Vegas, USA, December 2016. Poster: Self-managed and Blockchain-based Vehicular Ad-hoc Networks. Benjamin Leiding, Parisa Memarmoshrefi, and Dieter Hogrefe. In Adjunct Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing, Germany, DE, September 2016. A Novel Semi-Supervised Adaboost Technique for Network Anomaly Detection. Yali Yuan, Georgios Kaklamanos, and Dieter Hogrefe. In 19th ACM International Conference on Modeling, Analysis and Simulation of Wireless and Mobile Systems (MSWiM), Malta, Malta, November 2016. Tri-MCL: Synergistic Localization for Mobile Ad-hoc and Wireless Sensor Networks. Arne Bochem, Yali Yuan, and Dieter Hogrefe. In 41st IEEE Conference on Local Computer Networks (LCN), Dubai, UAE, November 2016. A Privacy-Preserving and Power-Efficient Bicycle Tracking Scheme for Theft Mitigation. Arne Bochem, Kevin Freeman, Martin Schwarzmaier, Omar Alfandi, and Dieter Hogrefe. In IEEE Second International Smart Cities Conference (ISC2 2016), Trento, Italy, September 2016. Demo: Dead Reckoning for Monte Carlo Localization in Low Seed Density Scenarios. Arne Bochem, Andreas Zdziarstek, Salke Hartung, and Dieter Hogrefe. In 2016 ACM International Conference on Embedded Wireless Systems and Networks (EWSN) - Demo Session, Graz, Austria, February 2016. Applied Sensor-Assisted Monte Carlo Localization for Mobile Wireless Sensor Networks. Salke Hartung, Arne Bochem, Andreas Zdziarstek, and Dieter Hogrefe. In 2016 ACM International Conference on Embedded Wireless Systems and Networks (EWSN), Graz, Austria, February 2016. Monte Carlo Localization for Path-Based Mobility in Mobile Wireless Sensor Networks. Salke Hartung, Ansgar Kellner, Konrad Rieck, and Dieter Hogrefe. In 2016 IEEE Wireless Communications and Networking Conference (WCNC), Doha, Qatar, April 2016. Autonomous Ant-based Public Key Authentication Mechanism for Mobile Ad-hoc Networks. Parisa Memarmoshrefi, Roman Seibel, and Dieter Hogrefe. Mobile Networks and Applications, Volume 21, Issue 1, 2016. Received signal strength indication for movement detection. Omar Alfandi, Arne Bochem, Kirill Bulert, Dieter Hogrefe, and Alwin Maier. In Eighth International Conference on Mobile Computing and Ubiquitous Networking, IEEE Computer Society, Hakodate City, Hokkaido, Japan, January 2015. Knowledge-assisted Location-adaptive Technique for Indoor-Outdoor Detection in E-Learning. Sviatoslav Edelev, Sunaina N. Prasad, Hemanth Karnal, and Dieter Hogrefe. In 2015 IEEE International Conference on Pervasive Computing and Communications Workshops (PERCOM Workshops), St. Louis, USA, M",
  "content_length": 47311,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:02"
}