{
  "name": "Dieter van Melkebeek",
  "homepage": "http://pages.cs.wisc.edu/~dieter",
  "status": "success",
  "content": "Home Page of Dieter van Melkebeek My UW | UW Search Computer Science Home Page Theory Group Home Page Biography Contact Information Courses ICPC Publications Research Overview Service Activities Students Dieter van Melkebeek Professor Research Interests: Theory of Computing, Computational Complexity. Biography Dieter van Melkebeek is a Professor of Computer Sciences. He completed his Ph.D. in 1999 at the University of Chicago, and was a postdoc at DIMACS and the Institute for Advanced Study (Princeton) before joining the faculty at the University of Wisconsin-Madison. He has held visiting appointments at CWI (Amsterdam), ENS (Paris), the Fields Institute (Toronto), Humboldt University (Berlin), MSRI (Berkeley), the Simons Institute (Berkeley), UPC (Barcelona), and the Weizmann Institute of Science (Rehovot). Professor Van Melkebeek's research interests lie in computational complexity theory and the theory of computing. He has developed lower bounds for the resources needed to solve NP-complete problems, and studies the power of randomness in computation. He earned the 1999 ACM Doctoral Dissertation Award and an NSF CAREER award for his research. Professor Van Melkebeek teaches algorithms and computational complexity theory at the undergraduate and graduate level. He also coaches the UW-Madison teams participating in the (ACM) International Collegiate Programming Contest and holds the North American record of advancing a team to the world finals 21 years in a row. Professor Van Melkebeek created the Computational Complexity Foundation, for which he received the ACM-SIGACT Distinguished Service Award. He chaired the program and steering committees of the Conference on Computational Complexity, and the ACM Doctoral Dissertation Award committee. He serves or has served on the editorials boards of the Leibniz International Proceedings in Informatics (LIPIcs), SIAM Journal on Computing, Computational Complexity, ACM Transactions on Computation Theory, and the Electronic Colloquium on Computational Complexity. Computer Sciences | UW Home Feedback or content questions: send email to \"dieter\" at the cs.wisc.edu server Technical or accessibility issues: lab@cs.wisc.edu Copyright © 2001-2025 The Board of Regents of the University of Wisconsin System.",
  "content_length": 2279,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:07"
}