{
  "name": "Dietmar Jannach",
  "homepage": "https://www.aau.at/team/jannach-dietmar",
  "status": "success",
  "content": "Visitenkarte Jannach Dietmar – Universität Klagenfurt Student CockpitePaymentTermin- & LV-ManagementCampus-SystemForschungsdokumentationCampus SucheBeschäftigten-PortalOrganisationshandbuchBetriebsmitteilungen, Interne & Persönliche Mitteilungen LinksBibliothek Webmail Stellenausschreibungen Mitteilungsblätter Schwarzes Brett Personensuche Campus Plan IT Services (ZID) Center for University Learning and Teaching Familienservice USI ÖH Klagenfurt Informationen fürSchüler:innen Studieninteressierte Studierende International Weiterbildung Wissenschaftler:innen Mitarbeiter:innen Lehrende Menschen mit Behinderungen Alumni & Karriere Partner:innen & Förder:innen Medien UNIVERSITÄT Univ.-Prof. Dipl.-Ing. Dr. Dietmar JannachFunktion:Mitglied des Arbeitskreises für GleichbehandlungsfragenE-Mail: Dietmar [dot] Jannach [at] aau [dot] atTelefon: +43 463 2700 3720Raum: S.1.59 Hauptgebäude, Südtrakt Ost, Ebene 1 (Institut für Artificial Intelligence und Cybersecurity)Sprechstunde: Nach Vereinbarung per MailWebseite: https://www.aau.at/en/ainf/research-groups/infsys/team/dietmar-jannach/Zugehörigkeit: Institut für Artificial Intelligence und CybersecurityCampus-Portal Visitenkarte | Lehrveranstaltungen | Forschung Forschungsschwerpunkte / ÖSTAT-SachgebieteArtificial IntelligenceArtificial IntelligenceInformationssystemeRecommender SystemsSoftware EngineeringSoftwareentwicklung QuicklinksBibliothek Webmail Stellenausschreibungen Mitteilungsblatt Schwarzes Brett Personensuche Campus Plan IT Services (ZID) Familienservice USI ÖH Klagenfurt Index A-Z Plattformen Campus-­System Student Cockpit Beschäftigten-­Portal Moodle Facebook Bluesky LinkedIn Youtube Instagram TikTok Informationen fürSchüler:innen Studieninteressierte Studierende International Weiterbildung Wissenschaftler:innen Mitarbeiter:innen Lehrende Menschen mit Behinderungen Alumni & Karriere Partner:innen & Förder:innen Medien Adresse Universität Klagenfurt Universitätsstraße 65-67 9020 Klagenfurt am Wörthersee Austria +43 463 2700 uni [at] aau [dot] at www.aau.at Campus Plan Anreise Ihre Privatsphäre ist uns wichtig! Unser Webauftritt verwendet Cookies, um die grundlegende Funktionalität unseres Webauftritts zu gewährleisten sowie unsere Webseiten für Sie optimal zu gestalten und fortlaufend zu verbessern. Dazu ist es erforderlich, Informationen an die jeweiligen Dienstanbieter weiterzugeben. Durch Betätigen des Buttons „Alle Cookies akzeptieren“ stimmen Sie der Verwendung zu. Sie können Ihre bevorzugten Einstellungen jederzeit nachträglich unter „Einstellungen verwalten“ anpassen. Weitere Informationen zu den verwendeten Cookies erhalten Sie in unserer Datenschutzerklärung. Einstellungen verwaltenAlle Cookies akzeptieren Cookies und Privatsphäre-Einstellungen Wie wir Cookies verwendenWir setzen auf unserer Website Cookies ein, um unsere Webseiten für Sie optimal zu gestalten und fortlaufend zu verbessern. Klicken Sie auf die verschiedenen Kategorienüberschriften, um mehr zu erfahren und die Standardeinstellungen zu ändern. Beachten Sie bitte, dass die Ablehnung einiger Cookies Auswirkungen auf die Funktionsweise unserer Website haben kann. Möglicherweise werden Webseiten nicht richtig dargestellt und funktionieren nicht einwandfrei. Hinweis auf Verarbeitung Ihrer auf dieser Webseite erhobenen Daten in Staaten ohne angemessenes Datenschutzniveau: Mit Klick auf 'Alle Cookies akzeptieren' willigen Sie gemäß Art. 49 Abs. 1 lit. a DSGVO in die Übermittlung Ihrer personenbezogenen Daten an Anbieter in Drittländern (z. B. USA) ein. Diese Anbieter (z. B. Google, Facebook, LinkedIn, Twitter, YouTube) unterliegen möglicherweise keinem der EU gleichwertigen Datenschutzniveau. Die Übermittlung erfolgt nur mit Ihrer ausdrücklichen Einwilligung. Unbedingt erforderliche Cookies & Cookie HinweisUnbedingt erforderliche Cookies Diese Cookies sind zum Funktionieren der Website erforderlich. Essenzielle Cookies ermöglichen grundlegende Funktionen und sind für das einwandfreie Funktionieren der Website erforderlich. Sie können Ihren Browser so einstellen, dass diese Cookies blockiert oder Sie über diese Cookies benachrichtigt werden. Einige Bereiche der Website funktionieren dann aber möglicherweis nicht wie erwartet. Diese Cookies speichern keine personenbezogenen Daten. Aktivieren / deaktivieren der unbedingt erforderlichen Cookies. Wenn der Regler links steht und grün gefärbt ist, sind unbedingt erforderliche Cookies aktiviert. Wenn der Regler rechts steht und grau gefärbt ist, sind unbedingt erforderliche Cookies deaktiviert. Ausblenden des Cookies-Hinweises Schieben Sie den Regler nach links, damit der Cookie-Hinweis dauerhaft ausgeblendet wird und alle Cookies, denen nicht zugestimmt wurde, abgelehnt werden. Zwei Cookies werden benötigt, damit diese Einstellung gespeichert wird. Andernfalls wird dieser Hinweis bei jedem Seitenladen wieder eingeblendet. Google Tag ManagerWir nutzen Tracking- und Analysetools um eine fortlaufende Optimierung und bedarfsgerechte Gestaltung unserer Webseite sicherzustellen. Mit Hilfe von Tracking-Maßnahmen ist es uns auch möglich, die Nutzung unserer Website durch Besucher statistisch zu erfassen und unser Onlineangebot mit Hilfe der dadurch gewonnenen Erkenntnisse für Sie weiterzuentwickeln. Um zu verhindern, dass Informationen zu Ihrer Nutzung unserer Website durch Google und Facebook erfasst und übertragen werden, deaktivieren Sie das Tracking hier: Wenn der Regler links steht und grün gefärbt ist, ist der Dienst aktiviert. Wenn der Regler rechts steht und grau gefärbt ist, ist der Dienst deaktiviert. Andere externe DiensteWir verwenden verschiedene externe Dienste wie z. B. Google Webfonts, Google Maps oder Youtube-Videos. Da diese Dienste personenbezogene Daten sammeln können, haben Sie die Möglichkeit diese zu blockieren. Bitte denken Sie daran, dass eine Blockierung dieser Dienste die Funktionalität und das Erscheinungsbild unserer Website beeinträchtigen kann. Die Änderungen werden wirksam, sobald Sie die Seite neu laden. Google Webfont Settings: Wenn der Regler links steht und grün gefärbt ist, ist der Dienst aktiviert. Wenn der Regler rechts steht und grau gefärbt ist, ist der Dienst deaktiviert. Google Maps Settings: Wenn der Regler links steht und grün gefärbt ist, ist der Dienst aktiviert. Wenn der Regler rechts steht und grau gefärbt ist, ist der Dienst deaktiviert. Google reCaptcha Settings: Wenn der Regler links steht und grün gefärbt ist, ist der Dienst aktiviert. Wenn der Regler rechts steht und grau gefärbt ist, ist der Dienst deaktiviert. Vimeo and Youtube video embeds: Wenn der Regler links steht und grün gefärbt ist, ist der Dienst aktiviert. Wenn der Regler rechts steht und grau gefärbt ist, ist der Dienst deaktiviert. DatenschutzerklärungWeitere Informationen zu den verwendeten Cookies auf unserem Webauftritt finden Sie in den Datenschutzerklärungen der Universität Klagenfurt. Auswahl akzeptieren und speichern Abbrechen Nachrichtenleiste öffnen Nachrichtenleiste öffnen Nachrichtenleiste öffnen Nach oben scrollen",
  "content_length": 7028,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:11"
}