{
  "name": "Dik Lun Lee",
  "homepage": "https://www.cse.ust.hk/~dlee",
  "status": "success",
  "content": "Dik Lun LEE (PhD, Toronto, 1985) Dik Lun LEE 李迪麟 (PhD, Toronto, 1985) Professor Emeritus I was Professor of the Department of Computer Science and Engineering, HKUST, before retiring in 2022. Before joining HKUST, I was an Associate Professor of Computer and Information Science at the Ohio State University (Columbus, Ohio, USA). In 1992, I spent my sabbatical leave as a Distinguished Visiting Scholar at the Online Computer Library Center (OCLC, Dublin, Ohio, USA) and as a consultant to Information Dimensions Incorporated (IDI, Dublin, Ohio, USA), which was acquired by Opentext. Please explore further my background and other duties. Administrative duties at HKUST I served as member of the Senate from 1999 to 2002. During this period, I chaired the Senateâs Committee on Postgraduate Studies in 2001-2002, which oversees the entire postgraduate school in the university and the Senateâs Committee on Computing Policy in 1999-2001. HKUST has three levels of committees for the substantiation (tenure) and promotion of faculty members. I had served as a member of the University Committee, Schoolâs Committee (Engineering), and the Departmentâs Committees at various times. At the Department level, I served as Director of Undergraduate Studies Committee from 1994-1996, and Director of the Postgraduate Studies Committee from 1997-1999, and chaired the Academic Substantiation and Promotion, Salary Merit Review, Faculty Search and Appointment, and Teaching Faculty Appointment Committees at various times. These services had broadened and enriched my academic career, and I thank the administration to entrust such important duties to me. Early Career at Ohio State University I started my academic career at the Department of Computer and Information Science, Ohio State University, where I met many kind people, colleagues and students, who had helped to nurture and enrich my teaching, research and professional experience. Because of an urge to return home, I left OSU to join HKUST after tenure and promotion to Associate Professor. Professional Services I had served as a member of the research panel of Research Grant Council (RGC) of HKSAR from 2001-2003 and an External Examiner of the Information Systems Programme at Baptist University in 1996-1998. I served as a guest editor for several special issues on database-related topics, and as program committee member and chair for several international conferences. As an ACM Lecturer from 1991 to 1993, I had given seminars on document access methods at universities and ACM Chapters. From 1995 to 1998, I served as an Executive Committee Member, Vice Chairman and Chairman of ACM Hong Kong Chapter. Research Interests My research interest includes search engines, recommendation systems, social networks, financial forecasting, business intelligence, and mobile data management. I co-offer an online course on Search Engines for Web and Enterprise Data. Other interests Web search must deal with a large amount of information, prepared in different formats and written by different people for differnt readers and purposes. Chinese search engine and content management poses further challenges to us. Business Intelligence with web content analysis Recent publications dlee@cse.ust.hk Computer Science Department The Hong Kong University of Science and Technology Clear Water Bay, Kowloon HONG KONG",
  "content_length": 3374,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:09"
}