{
  "name": "Dima Damen",
  "homepage": "https://dimadamen.github.io",
  "status": "success",
  "content": "Dima Damen, Professor of Computer Vision, University of Bristol Dima Damen Professor of Computer Vision, School of Computer Science, Lead of Machine Learning and Computer Vision Group, University of Bristol EPSRC Early Career Fellow (2020-2025) Senior Research Scientist, Google DeepMind Follow @dimadamen Follow @dimadamen.bsky.social on Bluesky News Nov 2025. Our paper PointSt3R is accepted at WACV. Oct 2025: Two ICCV 2025 Keynotes (DataCV and Ego360 workshops) are available in talks section Sep 2025: My PAISS 2025 tutorial on Video Understanding Out of the frame is available in talks section July 2025: Congratulations to Adriano Fragomeni who passed his viva - thanks to external examiner Pascal Mettes (UoA) for time and effort. Jan 2025: I will be giving keynotes at SCIA 2025 (June), ICVSS 2025 (July) and GCPR 2025 (Sep) Dec 2024: Our paper \"It's Just Another Day: Unique Video Captioning by Discriminative Prompting\" was selected as Best Paper at ACCV 2024 in Hanoi, Vietnam Nov 2024: Selected as Fellow @ELLIS for Europe Nov 2024: Journal extended version of our ICASSP 2023 paper \"EPIC-SOUNDS\" is now available on ArXiv Oct 2024: Our Survey paper \"An Outlook into the Future of Egocentric Vision\" appeared in Vol 132 at IJCV in its final format Sep 2024: Our ECCV 2024 paper AMEGO is now on ArXiv. Check Website for paper, code and benchmark Sep 2024: Online Open Access of our PAMI 2024 paper is now Online May 2024: Online Open Access of our IJCV 2024 paper is now Online Mar 2024: Two PhD positions opened in my group. Apply by 30 April 2024. Feb 2024: 1st EgoVis (Joint) Workshop will be held @CVPR2024 - see call for nominations for distinguished papers in Egocentric Vision Jan 2024: Applications for Summer of Research have now closed. Results are expected 20 Feb. Nov 2023: Applications for Summer of Research @Bristol 2024 are now open [DL 19 Jan 2024] Oct 2023: Our BMVC'23 paper \"Learning Temporal Sentence Grounding From Narrated EgoVideos\" now available on ArXiv Sep 2023: EPIC Fields paper accepted at NeurIPS 2023 Aug 2023: Survey paper \"An Outlook into the Future of Egocentric Vision\" open for comments on OpenReview until 15 Sep. All major corrections/suggestions will be acknowledged in revised version. Aug 2023: Our paper \"Learning Temporal Sentence Grounding From Narrated EgoVideos\" was accepted ab BMVC 2023. Preprint coming soon July 2023: Our paper \"What can a cook in Italy teach a Mechanic in India?\" was accepted at ICCV 2023. Dataset and Code are public June 2023: I'll be giving a keynote at WACV 2024 next Jan. June 2023: Winners of the 2023 EPIC-KITCHENS challenges announced [Closed for applications]May 2023: Open PhD position on Long-Term Video Understanding in collaboration with Adobe - for a start anytime between Sep 2023 and Feb 2024. Apply here asap, open until filled or end of June. Mar 2023: Postdoc Opportunity (26 months) open in my group - Details and Application Process - DL 23 Apri 2023 Feb 2023: Two papers accepted at CVPR 2023 Feb 2023: Two papers accepted at ICASSP 2023: Play-It-Back and EPIC-SOUNDS Feb 2023: On a research visit to UC Berkeley Jan 2023: EPIC-SOUNDS dataset publicly available Oct 2022: Our paper ConTra accepted as an oral at ACCV 2022 Sep 2022: VISOR and EgoClip papers accepted at NeurIPS 2022 Sep 2022: Up to 3 open PhD positions for 2022/2023 in my group [applications closed] Aug 2022: Rleased VISOR Benchmark: Video Segmentations and Object Relations. Watch the Trailer June 2022: ran the Joint 10th EPIC Workshop and 1st Ego4D workshop alongside CVPR 2022 in New Orleans Mar 2022: Two papers accepted at CVPR 2022. Feb 2022: Ego4D Dataset is now publicly available Jan 2022: Dec 2021: New ArXiv Paper: UnweaveNet: Unweaving Activity Stories Nov 2021: Our BMVC 2021 paper \"With a little help from my temporal context\" is now Available on ArXiv Oct 2021: Ego4D Project and ArXiv paper now out. Reveal session during EPIC@CCV2021 Sep 2021: Our paper Rescaling Egocentric Vision accepted at IJCV Aug 2021: Welcoming Alexandros Stergiou and Bin Zhu as postdocs to the group July 2021: Technical report for 2021 EPIC-KITCHENS challengs is online June 2021: Our paper Slow-Fast Auditory Streams won outstanding paper at ICASSP 2021 (3 out of 1700 papers awarded) June 2021: EPSRC Program Grant Visual AI has a live website now June 2021: Pleased to be outstanding reviewer for CVPR 2021 May 2021: During CVPR 2021, I'll be delivering keynotes during 2nd comprehensive tutorial on Video understanding, 8th workshop on FGVC and 2nd HVU workshop, in addition to co-organising 8th EPIC@CVPR2021 Mar 2021: CVPR 2021 paper \"On Semantic Similarity in Video Retrieval\" now on ArXiv Mar 2021: CVPR 2021 paper \"Temporal-Relational CrossTransformers for Few-Shot Action Recognition\" now on ArXiv Feb 2021: Will be delivering keynotes at two CVPR2021 workshops: Fine-grained visual categorisation (FGVC8) and Holistic Video Understanding (HVU) Jan 2021: Slides for my talk at HAU@ICPR 2021 workshop can be found here Nov 2020: Two papers presented at ACCV 2020: Play Fair: Frame Attributions in Video Models (Project) and Meta-Learning with Context-Agnostic Initialisations (Project) Nov 2020: Excited to start active work as Program Chair for ICCV 2021 in Montreal Sep 2020: Glad to join the ELLIS (European Laboratory for Learning and Intelligent Systems) Society as a member Sep 2020: Will be giving a keynote at the Deep Video Understanding workshop alongside ICMI 2020 Sep 2020: Will be giving a keynote at the HCMA workshop alongside ACM MM on 12 Oct Aug 2020: Final program for our EPIC@ECCV Workshop is now available online 1 July 2020: EPIC-KTICHESN-100 Dataset Now Released - Download, webinar June 2020: ArXiv Manuscript \"Rescaling Egocentric Vision\" is now online June 2020: Will be happy to deliver keynotes in August at ECCV workshops: Women in Computer Vision and Compositional and Multimodal Video Perception Challenge Jun 2020: Proud to be an Outstanding Reviewer for CVPR 2020. Jun 2020: My talk on \"Learning from Narrated Videos of Everyday Tasks\" at the CVPR2020 workshop on Instructional Videos is now available online Jun 2020: Deadline for the 7th EPIC@ECCV2020 Workshop is 10th of July - published proceedings included Apr 2020: EPSRC Program Grant Visual AI approved for funding. Mar 2020: I join the editorial board of IJCV as an associate editor. Mar 2020: Our paper \"Action Modifers: Learning from Adverbs in Instructional Videos\", accepted at CVPR 2020 is now on ArXiv - watch the video that explains the method here Mar 2020: Our paper \"Multi-Modal Domain Adaptation for Fine-Grained Action Recognition\", accepted for Oral at CVPR 2020 is now on Arxiv - see project details Feb 2020: Two papers accepted in CVPR 2020 - available in Arxiv already (see publications) Dec 2019: Jade-2 HPC Cluster has been accepted for funding Dec 2019: My talk at NCVPRIPG2019 in Hubli India is available here Dec 2019: I start EPSRC Early Career Fellowship UMPIRE this Jan. 5-Years Funding to expand my research activities in object interaction understanding. Nov 2019: I join the editorial board of IEEE TPAMI as associate editor Nov 2019: Congrats to Davide Moltisanti and Michael Wray for passing their PhD vivas Oct 2019: My talk from the Extreme Vision ICCV workshop is available here Oct 2019: Videos of all talks in our BMVA symposium are on available on YouTube Oct 2019: Videos of my 4-hour tutorial at North African Summer School in Machine Learning are now on YouTube: Part1, Part2 Sep 2019: Our paper \"Retro-Actions: Learning 'Close' by Time-Reversing 'Open' Videos\" (ICCVW) is now on Arxiv - Details Aug 2019: We release pretrained models and technical report for action recognition on EPIC-Kitchens July 2019: Our paper \"Learning Visual Actions Using Multiple Verb-Only Labels\" accepted for presentation at BMVC2019 is available on Arxiv July 2019: Two papers accepted at ICCV 2019, \"EPIC-Fusion: Audio-Visual Temporal Binding for Egocentric Action Recognition\" with Evangelos Kazakos (Bristol), Arsha Nagrani and Andrew Zisserman (Oxford), and \"Fine-Grained Action Retrieval through Multiple Parts-of-Speech Embeddings\" with Mike Wray (Bristol), Gabriela Csurka and Diane Larlus (Naver Labs) July 2019: I'll be giving keynotes at the ICCV2019 workshop YouTube8M, ICCV2019 workshop ACVR, and at the BMVC2019 workshop EgoApp July 2019: CFP BMVA symposium on Video Understanding in London - 25 Sep June 2018: Slides from my tutorial at North African Summer School in Machine Learning (NASSMA) are now online Apr 2019: Camera ready version and details of our paper Dual-Domain LSTM for Cross-Dataset Action Recognition - CVPR 2019 now online Apr 2019: Camera ready version and details of our paper The Pros and Cons: Rank-aware Temporal Attention for Skill Determination in Long Videos - CVPR 2019 now online Apr 2019: Fifth EPIC workshop accepted - EPIC@ICCV2019 will be held in Seoul this Oct/Nov Apr 2019: Will be giving a keynote at the 7th Workshop on Assistive Computer Vision and Robotics alongside ICCV in Seoul this October. Apr 2019: Camera ready version and details of our paper Action Recognition from Single Timestamp Supervision in Untrimmed Videos - CVPR 2019 now online and on Arxiv Mar 2019: Looking forward to returning as a speaker for the 2019 BMVA summer school in Lincoln this June Mar 2019: Slides for my keynote at VISAPP now online Mar 2019: Invited as one of the speakers at the First North African summer school in Machine Learning NASSMA Feb 2019: Three papers accepted at CVPR 2019 (coming soon on Arxiv) Feb 2019: Keynote at VISAPP 2019 in Prague Dec 2018: EPIC@CVPR2019 Workshop to take place in Long Beach Oct 2018: Scheduled talk at MPI Tubingen - details Sep 2018: EPIC-KITCHENS presented as Oral at ECCV 2018 - camera ready available Arxiv, Webpage Sep 2018: Leaderboards for the EPIC-KITCHENS challenges on CodaLab are now open Sep 2018: Two papers presented at BMVC 2018. Action Completion (Dataset) and CaloriNet Aug 2018: EPIC-SKILLS dataset, for our CVPR2018 ",
  "content_length": 35569,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:14"
}