{
  "name": "Dimitrios Varoutas",
  "homepage": "http://cgi.di.uoa.gr/~arkas",
  "status": "success",
  "content": "Dimitris A. Varoutas Dimitris Varoutas Associate Professor, Department of Informatics and Telecommunications School of Sciences National and Kapodistrian University of Athens Head of the MINT  Management and Economics of Innovation in Telecom Industries Group Director, Cultural Technologies Laboratory, cultech.di.uoa.gr Contact details E-mail: D.Varoutas di . uoa . gr    (Or use the arkas di . uoa . gr ) Tel: +30 - 210-727-5318, Fax: +30 - 210-727-5214 Address (Postal and Courier): Department of Informatics and Telecommunications, National and Kapodistrian University of Athens, Panepistimiopolis, Ilisia, Athens,  GR-15784 GREECE. Visiting Address: Room B-18, Department of Informatics and Telecommunications, Panepistimiopolis (University Campus), Athens. Areas of Interest: Telecommunications Technoeconomics, Telecommunications Systems Engineering, Optical Communications and Networking, Wireless Communications and Networking, Telecommunications Engineering Economics, Industrial Organisation and Regulatory Economics, Demand and Price Forecasting. Brief Biography (or its Greek version) List of Publications Running Research Projects: VIOLIN  Visible Light Communications Visible Light Communications in Communications, Marketing, Transport, Logistics, Cultural and Tourist Industries, (2018  today) CARAT  History in Cities. (2018  today) CostumART  Preservation of Theatrical Costumes. (2018-today) RoGH  Routes in Greek History: (2018-today) TOKEN  LRIC+ Technoeconomic Modelling for NGA copper and fiber wholesale pricing  (2017- today) MeTRA II  LRIC+ Bottom-Up models for Mobile Termination Rates (2017- today). For a complete list and analytical description of current and past projects, click here. Teaching: Undergraduate courses (information in Greek only) Electromagnetics - Optics (F'12, S'14, S'15) Electromagnetics - Optics (F'2005, F'06, F'07, F'08, F'09, F'10, F'11) with Thomas Sphicopoulos Telecommunications Networks (S'06, S'07, S'08, S'09, S'10, S'11, S'12, F'13, F'14, F'15) Fields and Waves-Antennas (S'12, F'13, F'14, F'15) Postgraduate courses (information in Greek only) Telecommunications Technoeconomics (F'04, F'05, F'06, F'07, F'08, F'09, F'10, F'11, F'12, F'13, F'14, F15) with Dimitris Katsianis Antennas (S'04, S'05, S'06, S'07, S'08, S'09, S'10, S'11, S'12, S'13, S'14, S'15, S'16) with Aris Chipouras Telecommunications Policy (S'04, S'05, S'06, S'07, S'08, S'09, S'10, S'11) Investments under uncertainty (S'12, S'13, S'14, S'15) (S'09, S'10, S'11) with Manolis Athanasiou Telecommunications Networks (F'15) with D. Syvridis Last year thesis Click here for a list of proposed topics for last year thesis (Only in Greek - Στα Ελληνικά ) Group members: (for more information you can visit the Group website) Senior members - Postdoc Dimitris Katsianis, PhD Aris Chipouras, PhD Markos Tselekounis, Assistant Professor, UNIPI Michalis Kyriakidis, PhD Kosmas Tsilipanos, PhD PhD students George Charalampopoulos, MSc. (with OTE) Nikos Kanellos, MSc. (with Hellenic Air Force) Vangelis Logothetis, MSc. Elias Aravantinos, MSc. Eleni Laitsou, MSc. Ioannis Karadimas, MSc. Alexandros Psyrris, MSc. Nikos Ioannou, MSc. Konstantin Petre, MSc. Former group members Antonis Kargas, PhD Alex Vavoulas, PhD (Tutor at University of Central Greece) Nikos Vaiopoulos, PhD (Tutor at University of Central Greece) George Kakaletris, MSc. Ioannis Neokosmidis, PhD Theodore Rokkas, PhD Dimitris Maniadakis, PhD Thomas Kamalakis, Assistant Professor, HUA Christos Michalakelis, HUA Ntina Deligiorgi, PhD Vagia Kyriakidou, PhD Betty Lakka, PhD Giouli Dede, MSc. HUA Charisios (Charis) Christodoulos, MSc. Others: My family: my wife and my children. Arkas, the most famous Greek comics artist and humorist (see also his webpage) Tripolis, Arcadia, Peloponnese (my birthplace) Didymoteicho, near Turkish borders (and the related song) Rebetiko music performed by Markos Vamvakaris (from ZDF documentary). See my favorite list of rebetiko songs © Copyright 2000-2016 Dimitris Varoutas. Last updated Jan 2016.",
  "content_length": 4039,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:28"
}