{
  "name": "Dimity Miller",
  "homepage": "https://research.qut.edu.au/qcr/people/dimity-miller",
  "status": "success",
  "content": "Dimity Miller - QUT Centre for Robotics Skip to content Dr Dimity Miller Home Our People Dr Dimity Miller Please enable JavaScript Find Dimity Miller onDimity Miller's publications are available on: Recent tweetsFollow @@DimityMiller Lecturer (Reliable robotic vision, Deep learning, Computer vision, and Robotics, SLAM) Dimity is a Chief Investigator with the QUT Centre for Robotics, and a Lecturer with the QUT School of Electrical Engineering and Robotics. Her research expertise is in reliable robotic vision – operating at the intersection of deep learning, computer vision, and robotics. In particular, she is passionate about understanding when and why computer vision models may fail in robotic applications, and developing techniques to mitigate this. Her research interests span across topics including uncertainty estimation, object detection, continuous learning, deep learning introspection, metrics for assessing model performance, and spatiotemporal learning. Prior to joining the QUT Centre for Robotics, Dimity was a postdoctoral research fellow jointly across the CSIRO Machine Learning and Artificial Intelligence Future Science Platform,  the CSIRO Robotics and Autonomous Systems Group, and the QUT Trusted Networks Lab. She obtained her PhD in 2021 from QUT, where she worked within the ARC Centre of Excellence for Robotic Vision (ACRV). Her thesis developed methods for extracting uncertainty from object detection models used for robotic perception. In particular, she focused primarily on developing object detectors that express high uncertainty in open-set conditions, where they encounter novel object classes. Dimity’s commitment to excellence in research has been recognised by an Executive Dean’s Commendation for Outstanding Doctoral Thesis Award in 2022, as well as a Vice-Chancellor’s Performance award in 2017. In addition to this, she was awarded first place in the ‘Probabilistic Object Detection Challenge’ hosted at the European Conference on Computer Vision (ECCV) in 2020. Projects (Chief investigator)Australian Robotic Inspection and Asset Management HubConversational agents that can see ProjectsReliability in Deep Machine Learning and Uncertainty for Object Detection NewsDr Fernando Vanegas Alvarez awarded Advanced Queensland Industry Research Fellowship Grant!Posted: September 19, 2024QCR CI Aaron McFadyen Wins 2024 Australian Museum Eureka Prize!Posted: September 8, 2024From PhD to Lecturer: Dr Jasmin Martin's JourneyPosted: August 18, 2024Recent TweetsFollow @QUTRobotics",
  "content_length": 2528,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:36"
}