{
  "name": "Dimitrios Papadopoulos 0001",
  "homepage": "https://www.cse.ust.hk/~dipapado",
  "status": "success",
  "content": "Dimitris Papadopoulos - HKUST Dimitris Papadopoulos Teaching Research Personal e-mail dipapado at cse dot ust dot hk contact address CSE Department HKUST Clearwater Bay Hong Kong resume Personal I am an Associate Professor at the Computer Science and Engineering Department of the Hong Kong University of Science and Technology. I received my PhD in Computer Science from Boston University and I was a Post-Doctoral Researcher at the Insitute for Advanced Computer Science of the University of Maryland. Previously, I received my Diploma in Applied Mathematics from the National Technical University of Athens. My research focus is the development of novel cryptographic protocols for a variety of application scenarios and problems related to cloud data privacy, collaborative maching learning, and blockchain settings. I regularly work on cryptographic schemes such as searchable encryption, verifiable computation, zero-knowledge arguments, etc., aiming for provably secure solutions and optimized implemented systems. **Currently looking to hire PhD students for Fall 2025! Areas of focus are zero-knowledge proofs, oblivious primitives on TEEs, and searchable encryption, but can consider any other area of cryptography. Interested candidates send me an e-mail with your latest CV and a short paragraph on your topics of interest** Selected News Our paper introducing a novel cryptographic primitive called Verifiable Time-Lock Puzzles has been accepted to IEEE S&P 2025! This is work with my PhD student Jiajun Xin. Our paper Obliviator has been accepted to USENIX Security 2025!, where we introduce new oblivious operators for evaluating SQL queries on TEEs. This is joint work with my student Xian Wang and collaborators from UCSC. Our paper introducing Sparrow, a space-efficient zkSNARK with applications to proofs of decision tree training has been accepted to CCS 2024!. This is joint work with my PhD student Christodoulos Pappas. Our work on Zero-knowledge proofs for deep neural networks via efficient sumcheck-based IVC was accepted to CCS 2024!. This is joint work with my PhD student Christodoulos Pappas, and Kasra Abbaszadeh and Jonathan Katz from U Maryland. Two papers accepted at USENIX Security 2024! The first is Notus, the only scheme for Dynamic Proofs of Liabilities with constant proof size (led by my PhD student Jiajun Xin). The other is the first implemented system that achieves Forward/Backward privacy for local searchable encryption executed on disk storage (joint work with collaborators from UC Santa Cruz and my Post-doc Javad Ghareh Chamani). Our paper on Scalable and Distrubuted Oblivious Sorting and Shuffling will appear at IEEE S&P 2024! Joint work with Nicholas Ngai, my Post-Doc Javad Ghareh Chamani, and Ioannis Demertzis from UCSC Our work on Oblivious Graph Queries using TEEs will appear at VLDB 2024! Joint work with my Post-Doc Javad Ghareh Chamani, Ioannis Demertzis from UCSC, and collaborators from Yale and Sharif. template design:3Formed.co.uk",
  "content_length": 3001,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:24"
}