{
  "name": "Dimitris S. Kolovos",
  "homepage": "https://www-users.cs.york.ac.uk/~dkolovos",
  "status": "success",
  "content": "Dimitris Kolovos Skip to content Professor Dimitris Kolovos¶ I am a Professor of Software Engineering in the Automated Software Engineering Group of the Department of Computer Science at the University of York, where I research and teach model-driven software engineering. I am also an Adjunct Professor at McMaster University (Canada). Research Interests¶ My main area of research interest is model-driven software engineering. I have co-authored many peer-reviewed papers in the field, I sit on the program committees of leading international ACM/IEEE conferences in the area (ACM/IEEE MODELS and ACM SIGPLAN SLE), and I am an editor of Springer's Software and Systems Modeling (SoSyM) journal. I am also an Eclipse Foundation committer, leading the development of the open-source Epsilon model-driven software engineering platform, which is used in companies such as Rolls-Royce, Bosch and IBM. Beyond model-driven software engineering, I have active research interests in GenAI for software engineering, in low-code software engineering and in topics related to data analytics, such as polyglot data persistence, and distributed and polyglot stream processing. Looking for a PhD? I am recruiting PhD candidates in the fields above. If you have strong object-oriented design and development skills and you would like to join a world-class research group in Britain's best place to live (a distance learning option is also available), please read on. Industry Collaboration¶ My team works closely with industry and, among others, we have been involved in a Â£30M collaborative project with technology leaders in the UK aerospace industry such as Rolls-Royce, Altran and Leonardo, in Knowledge Transfer Partnerships with Rolls-Royce and Leonardo, in a Marie Curie Training network on low-code software engineering with collaborators such as BT and Amazon, and in an EPSRC-funded network with companies such as Smith and Nephew, Capgemini and Tata Consultancy Services. Contact¶ Questions about Epsilon? Should you need to contact me about Epsilon (questions, bugs etc.), please consider sending a message to the Epsilon forum instead. (why?) My email address is dimitris.kolovos@york.ac.uk. My office is CSE/015 on the ground floor of the Computer Science building, my internal phone number is 5167 (+441904325167), and my (shared) fax number is +441904432767. Should you need to contact me in writing, my postal address is below. Professor Dimitris Kolovos Department of Computer Science The University of York Deramore Lane, York, YO10 5GH, United Kingdom Publicity¶ For any publicity-related needs, please feel free to use the bio below, and this photo. Bio Dimitris Kolovos is a Professor of Software Engineering in the Department of Computer Science at the University of York, where he researches and teaches automated and model-driven software engineering. He is also an Eclipse Foundation committer, leading the development of the open-source Epsilon model-driven software engineering platform, and an editor of the Software and Systems Modelling journal. He has co-authored more than 200 peer-reviewed papers and his research has been supported by the European Commission, UK's Engineering and Physical Sciences Research Council (EPSRC), Innovate UK and by companies such as Rolls-Royce and IBM. Last update: September 17, 2025",
  "content_length": 3336,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:33"
}