{
  "name": "Dimitrios Plexousakis",
  "homepage": "https://www.csd.uoc.gr/index.jsp?custom=dimitris_pleksousakis",
  "status": "success",
  "content": "Δημήτρης Πλεξουσάκης | Τμήμα Επιστήμης Υπολογιστών - Πανεπιστήμιο Κρήτης Επικοινωνία Ανακοινώσεις | Νέα Τρίπτυχο του Τμήματος GR EN webmailelearneduportal Αρχική Σελίδα Άνθρωποι Ακαδημαϊκό Προσωπικό Δημήτρης Πλεξουσάκης Δημήτρης Πλεξουσάκης A+ A- Καθηγητής Επιστήμης Υπολογιστών, Πανεπιστήμιο Κρήτης Τμήμα Πληροφορικής, Πανεπιστήμιο Κρήτης Τ.Θ. 2208 71409 Ηράκλειο Κρήτη, Ελλάδα Συνεργαζόμενο Μέλος ΔΕΠ Ινστιτούτο Πληροφορικής (ΙΠ) Ίδρυμα Τεχνολογίας και Έρευνας (ΙΤΕ) Ν. Πλαστήρα 100, Βασιλικά Βουτών Τ.Θ. 1385 Τ.Κ. 70013 Ηράκλειο, Κρήτη Phone: +30 2810 391637 Fax: +30 2810 391638 E-mail: dpATics.forth.gr Ο Δημήτρης Πλεξουσάκης είναι Kαθηγητής του Τμήματος Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης και συνεργαζόμενος ερευνητής στο Εργαστήριο Πληροφοριακών Συστημάτων (ΕΠΣ) του Ινστιτούτου Πληροφορικής , ΙΤΕ. Διδασκαλία  Μαθημάτων Ακαδημαϊκού έτους 2011-12 Χειμερινό εξάμηνο 2011: -HY360: Αρχεία και Βάσεις Δεδομένων (http://www.csd.uoc.gr/~hy360) -HY460: Συστήματα Διαχείρισης Βάσεων Δεδομένων (http://www.csd.uoc.gr/~hy460) Εαρινό εξάμηνο 2012: -HY180: Λογική (http://www.csd.uoc.gr/~hy180) -HY565: Συστήματα Διαχείρισης Διεργασιών (http://www.csd.uoc.gr/~hy565) Ερευνητικά Ενδιαφέροντα Τα ερευνητικά του ενδιαφέροντα εντοπίζονται στην περιοχή των Συστημάτων Βάσεων Δεδομένων και Γνώσεων καθώς και στις εφαρμογές και επεκτάσεις αυτών: Αναπαράσταση Γνώσης και Συλλογιστική (Knowledge Representation and Reasoning) Εννοιολογική Μοντελοποίηση (Conceptual Modeling) Συστηματα Διαχείρισης Βάσεων Γνώσεων (Knowledge Base Management Systems) Αναπαράσταση και Διαχείριση Γνώσης στο Σημασιολογικό Διαδίκτυο και σε Περιβάλλοντα Διάχυτης Νοημοσύνης (Knowledge Representation and Management on the Semantic Web and in Ambient Intelligence Environments) Πληροφοριακά Συστήματα στο Διαδίκτυο (Web-based Information Systems) Διαχείριση Δεδομένων σε Διομότιμα Συστήματα (Peer-to-peer Data Management) Ψηφιακές Βιβλιοθήκες (Digital Libraries) Ηλεκτρονικές Υπηρεσίες (ανακάλυψη και σύνθεση υπηρεσιών) (Discovery and Composition of E-Services) Αρχιτεκτονικές Προσανατολισμένες σε Υπηρεσίες (Service-Oriented Architectures) Μοντελοποίηση και Ανάλυση Επιχειρησιακών Διεργασιών (Business Process Modeling and Analysis) Χρονικές, Ενεργές και Παραγωγικές Βάσεις Δεδομένων (Temporal, Active and Deductive Databases) Εφαρμογές Πληροφοριακών Συστημάτων στη Βιοπληροφορική (Applications of Information Systems in Bioinformatics) Συμμετοχή σε Χρηματοδοτούμενα Ερευνητικά και Αναπτυξιακά Προγράμματα plugIT - Business and IT Alignment using a Model-based Plug-in Framework, ICT-FP7-231430, (Scientific Coordinator) InterLink - International Cooperation Activities in Future and Emerging ICTs, Coordination Action, FET Programme, IST-FP6-034051, (Member of the Scientific Coordination Committee) PPK -Broadband Service and Business Transformation , Regional Pole of Innovation of Crete, General Secretariat of Research and Technology, Greek Ministry of Development (Scientific Coordinator) ACGT - Advancing Clinico-Genomic Trials on Cancer: Open Grid Services for Improving Medical Knowledge Discovery, Integrated Project, IST-FP6-026996 (Scientific Coordinator on behalf of the Information Systems Laboratory) KPLab - Developing Knowledge Practices Laboratory, Integrated Project, IST-FP6-27490 Research Excellence ΙΙ Emerging Areas of Excellence in Information and Communication Technologies, General Secretariat of Research and Technology, Greek Ministry of Development PrognoChip - Developing and Establishing DNA Microarray Technology in Greece: Identification and Validation of Classification and Prognosis Molecular Markers for Breast Cancer, General Secretariat of Research and Technology, Greek Ministry of Development (Scientific Coordinator on behalf of the Information Systems Laboratory) PLANET - European Network of Excellence in AI Planning, IST-FP5, (Scientific Coordinator on behalf of the Institute of Computer Science) Beyond-the-Horizon - Anticipating Future and Emerging Information Society Technologies, FET Programme, IST-FP6-006622 (Scientific Coordinator) CYCLADES - An Open Collaborative Archive Environment, IST-2000-25456, (Scientific Coordinator on behalf of the Institute of Computer Science) SeLeNe - Self e-Learning Networks, IST-2001-3904 QuestionHow - Quality Engineering Solutions via Tools, Information and Outreach for the New Highly- enriched Offerings from W3C: Evolving the Web in Europe, IST- 2000-28767 MESMUSES - Metaphors for Science Museums, IST-2000-26074 C-Web - A Generic Platform Supporting Community Webs, IST-1999-13479 ARION - An Advanced Lightweight Architecture for Accessing Scientific Collections, IST-2000-25289 DELOS - Network of Excellence in Digital Libraries, IST OntoWeb - Network of Excellence on Ontology-based Information Exchange for Knowledge Management and Electronic Commerce, IST-2000-29243 ECTourism - An Electronic Commerce System for the Provision of Tourism Services over Internet, General Secretariat of Research and Technology, Greek Ministry of Development (Scientific Coordinator) Research Excellence-Ι - Emerging Areas of Excellence in Information and Communication Technologies, General Secretariat of Research and Technology, Greek Ministry of Development Σύντομο βιογραφικό Ο Δημήτρης Πλεξουσάκης είναι Καθηγητής στο Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης, Πρόεδρος του Τμήματος από το Σεπτέμβριο του 2006 μέχρι τον Αύγουστο του 2010 και Ερευνητής στο Ινστιτούτο Πληροφορικής του Ιδρύματος Τεχνολογίας και Έρευνας. Από το Δεκέμβριο του 2009 είναι Διευθυντής του Εργαστηρίου Επεξεργασίας Δεδομένων του Πανεπιστημίου Κρήτης. Έλαβε το Πτυχίο στην Επιστήμη Υπολογιστών από το Τμήμα Επιστήμης Υπολογιστών το 1988 και M.Sc και Ph.D. στην Επιστήμη Υπολογιστών από το Department of Computer Science, University of Toronto, τα έτη 1990 και 1996 αντίστοιχα. Ήταν Επισκέπτης Καθηγητής στο Department of Computing and Information Science, Kansas State University (1995-1997), και Επίκουρος Καθηγητής στο Department of Computer Science and Engineering, University of South Florida (1997-1998). Διετέλεσε επίσης Επισκέπτης Καθηγητής στο Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης (1999-2000) και τα Πανεπιστήμια της Βιέννης, CNAM και Orsay. Τα ερευνητικά του ενδιαφέροντα επικεντρώνονται στην περιοχή των Συστημάτων Βάσεων Δεδομένων και Γνώσεων. Πιο συγκεκριμένα η έρευνά του αφορά Σχεδίαση Βάσεων Γνώσεων, Αναπαράσταση Γνώσης, Τυπικά Συστήματα Λογισμού, Χρονικές και Χωρικές Βάσεις Δεδομένων, Κατανεμημένες Βάσεις Δεδομένων, Βάσεις Δεδομένων στο Διαδίκτυο, Πληροφοριακά Συστήματα και Εφαρμογές Τεχνητής Νοημοσύνης σε Συστήματα Βάσεων Γνώσεων. Έχει περισσότερες από 140 δημοσιεύσεις σε διεθνή συνέδρια και περιοδικά της Επιστήμης Υπολογιστών και μετέχει σε διεθνείς επιτροπές κρίσης συνεδρίων και περιοδικών. Είναι μέλος της Ελληνικής Εταιρίας Τεχνητής Νοημοσύνης, καθώς και της ACM του IEEE και του ΑΑΑΙ. Είναι επιστημονικά υπεύθυνος του έργου FP7 PlugIt, του Προγράμματος Πρακτικής Άσκησης του Τμήματος Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης και του Προγράμματος Συνεργασίας ΕΕ-Καναδά του Τμήματος Επιστήμης Υπολογιστών. Διετέλεσε επιστημονικά υπεύθυνος των προγραμμάτων ICT-FET “Beyond the Horizon”, ICT FET “Interlink”, ΕΠΕΤ ΙΙ – «Σύστημα Ηλεκτρονικού Εμπορίου για την Παροχή Τουριστικών Υπηρεσιών μέσω Internet», IST CYCLADES (An Open Collaborrative Archive Environment), PLANET (European Network of Excellence in AI Planning). Είναι μέλος της Επιστημονικής Επιστροπής Συντονισμού του έργου ICT-FET Interlink. Επίσης, συμμετέχει ή έχει συμμετάσχει ως ερευνητής στα προγράμματα IST Cweb (A Generic Platform Supporting Community Webs), IST Mesmuses (Metaphors for Science Museums), OntoWeb (Ontology-based Information Exchange for Knowledge Management and Electronic Commerce), SeLeNe (Self e-Learning Networks), KP-Lab (Knowledge Practices Laboratory), S-Cube (Network of Excellence on Service-Oriented Computing), ACGT (Advanced Clinico-Genomic Trials on Cancer), REWERSE (Network of Excellence on Rules and Reasoning on the Web) και άλλα. Κατάλογος Δημοσιεύσεων Copyright © 2025, Τμήμα Επιστήμης Υπολογιστών - Συντελεστές - Σχόλια για Ιστότοπο",
  "content_length": 8129,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:25"
}