{
  "name": "Dimitrios Apostolou",
  "homepage": "https://www.unipi.gr/unipi/en/dapost.html",
  "status": "success",
  "content": "Αποστόλου Δημήτριος - Πανεπιστήμιο Πειραιώς Αρχική Τμήμα Πληροφορικής Αποστόλου Δημήτριος Αποστόλου Δημήτριος Αποστόλου Δημήτριος 13 Φεβρουαρίου 2024 2024-10-18 15:44 Αποστόλου Δημήτριος Καθηγητής, Τμήμα Πληροφορικής Επικοινωνία +30 210 4142476 dapost@unipi.gr 303/ΓΛ126 Γνωστικό Αντικείμενο Συστήματα Υποστήριξης Συλλογικών Αποφάσεων Πληροφορίες Ο Δημήτρης Αποστόλου είναι Αναπληρωτής Καθηγητής του Τμήματος Πληροφορικής του Πανεπιστημίου Πειραιώς και μέλος του Εργαστηρίου Συστημάτων Υποστήριξης Αποφάσεων. Είναι Διδάκτωρ του τμήματος Ηλεκτρολόγων Μηχανικών και Μηχανικών Η/Υ του ΕΜΠ, και κάτοχος MSc στην Information Technology από το University College London και MS σε Chemical Engineering & Environmental Science από το New Jersey Institute of Technology. Τα ερευνητικά του ενδιαφέροντα εστιάζονται σε Ευφυή Συστήματα Υποστήριξης Αποφάσεων, Συστήματα Υποστήριξης Ομάδων και Συστήματα Διαχείρισης Επιχειρησιακών Διαδικασιών και Γνώσης. Έχει συμμετάσχει σε μεγάλο αριθμό ερευνητικών έργων πληροφορικής επιδοτούμενων από την Ευρωπαϊκή Επιτροπή και Εθνικούς φορείς, με ρόλο υπεύθυνου έργου σε τρία από αυτά. Έχει διατελέσει σύμβουλος πληροφορικής και έχει συμμετάσχει σε έργα σχεδιασμού και ανάπτυξης πληροφοριακών συστημάτων για το δημόσιο τομέα και ιδιωτικούς φορείς. Έχει περισσότερες από 40 δημοσιεύσεις σε περιοδικά όπως Information Systems, IEEE Intelligent Systems, IEEE Computational Intelligence, International Journal of Information Management και πάνω από 90 δημοσιεύσεις σε πρακτικά συνεδρίων καθώς και ένα βιβλίο από τον εκδοτικό οίκο Springer-Verlag. Συμμετέχει σε επιτροπές συνεδρίων όπως το Business Information Management και είναι κριτής σε περιοδικά όπως το Decision Support Systems, Management Decision, Knowledge Management Research & Practice. Διδασκαλία Έρευνα Συγγράμματα Ώρες Γραφείου – Χειμερινό εξάμηνο: Παρασκευή 10:00 – 14:00. – Εαρινό εξάμηνο: Τρίτη 10:00 – 12:00 και Τετάρτη 10:00 – 12:00. Αποστόλου Δημήτριος 13 Φεβρουαρίου 2024 2024-10-18 15:44 Καλώς ήρθατε στην επίσημη ιστοσελίδα του Πανεπιστημίου Πειραιώς Ακολουθήστε μας στα Social Media: Νέα Επικαιρότητα Ανακοινώσεις Εκδηλώσεις Φοιτητικά Θέματα Προστασία Δεδομένων Προσωπικού Χαρακτήρα Χρήσιμοι Σύνδεσμοι Διαύγεια Εθνικό Σύστημα Ηλεκτρονικών Δημοσίων Συμβάσεων - ΕΣΗΔΗΣ Εθνική Πύλη Ερμής Σύνδεσμος για Παλιά Ιστοσελίδα Στοιχεία Επικοινωνίας 210 4142000 e-mail: info@unipi.gr Διεύθυνση: Μ. Καραολή & Α. Δημητρίου 80, 18534 Πειραιάς Χάρτης Συγχρηματοδοτούμενα Έργα © 2023 Πανεπιστήμιο Πειραιώς. Με την επιφύλαξη παντός νομίμου δικαιώματος. Διαχείριση Συγκατάθεσης Cookies Για να παρέχουμε την καλύτερη εμπειρία, χρησιμοποιούμε τεχνολογίες όπως cookies για την αποθήκευση ή/και την πρόσβαση σε πληροφορίες συσκευών. Η συγκατάθεση για τις εν λόγω τεχνολογίες θα μας επιτρέψει να επεξεργαστούμε δεδομένα προσωπικού χαρακτήρα, όπως συμπεριφορά περιήγησης ή μοναδικά αναγνωριστικά σε αυτόν τον ιστότοπο. Η μη συγκατάθεση ή η ανάκληση της συγκατάθεσης, μπορεί να επηρεάσει αρνητικά ορισμένες λειτουργίες και δυνατότητες. Λειτουργικά Λειτουργικά Πάντα ενεργό Η τεχνική αποθήκευση ή πρόσβαση είναι απολύτως απαραίτητη για τον νόμιμο σκοπό της δυνατότητας χρήσης συγκεκριμένης υπηρεσίας που ζητείται ρητά από τον συνδρομητή ή τον χρήστη ή με αποκλειστικό σκοπό τη μετάδοση επικοινωνίας μέσω δικτύου ηλεκτρονικών επικοινωνιών. Προτιμήσεις Προτιμήσεις Η τεχνική αποθήκευση ή πρόσβαση είναι απαραίτητη για τον νόμιμο σκοπό της αποθήκευσης προτιμήσεων που δεν ζητούνται από τον συνδρομητή ή τον χρήστη. Στατιστικά Στατιστικά Η τεχνική αποθήκευση ή πρόσβαση που χρησιμοποιείται αποκλειστικά για στατιστικούς σκοπούς. Η τεχνική αποθήκευση ή πρόσβαση που χρησιμοποιείται αποκλειστικά για ανώνυμους στατιστικούς σκοπούς. Χωρίς κλήτευση, η εθελοντική συμμόρφωση εκ μέρους του Παρόχου Υπηρεσιών Διαδικτύου ή πρόσθετες καταγραφές από τρίτο μέρος, οι πληροφορίες που αποθηκεύονται ή ανακτώνται για το σκοπό αυτό από μόνες τους δεν μπορούν συνήθως να χρησιμοποιηθούν για την αναγνώρισή σας. Εμπορικής Προώθησης Εμπορικής Προώθησης Η τεχνική αποθήκευση ή πρόσβαση απαιτείται για τη δημιουργία προφίλ χρηστών, για την αποστολή διαφημίσεων ή για την καταγραφή του χρήστη σε έναν ιστότοπο ή σε διάφορους ιστότοπους για παρόμοιους σκοπούς εμπορικής προώθησης. Διαχείριση επιλογών Διαχείριση υπηρεσιών Manage {vendor_count} vendors Διαβάστε περισσότερα για αυτούς τους σκοπούς Αποδοχή Δεν αποδέχομαι Προβολή προτιμήσεων Αποθήκευση προτιμήσεων Προβολή προτιμήσεων {title} {title} {title} Διαχείριση συγκατάθεσης Search for: Search Πανεπιστήμιο Χαιρετισμός Πρύτανη Ιστορία του Πανεπιστημίου Περιήγηση Εσωτερικός Κανονισμός Πανεπιστημίου Πειραιώς Κώδικας Δεοντολογίας και Καλής Πρακτικής Επιτροπή Ισότητας των Φύλων και Καταπολέμησης των Διακρίσεων (ΕΙΦΚΔ) Ιδρυματικός Κατάλογος Μαθημάτων Προστασία Δεδομένων Προσωπικού Χαρακτήρα Πολιτική Ποιότητας Στρατηγική Πανεπιστημίου Μονάδα Στρατηγικού Σχεδιασμού Σχέδιο Αειφόρου Ανάπτυξης Πανεπιστημίου Πειραιώς Events Διοίκηση ΠΡΥΤΑΝΙΚΗ ΑΡΧΗ Χαιρετισμός Πρύτανη Γραφείο Πρυτάνεως X ΣΥΜΒΟΥΛΙΟ ΔΙΟΙΚΗΣΗΣ Αρμοδιότητες Συμβουλίου Διοίκησης X ΣΥΓΚΛΗΤΟΣ Αρμοδιότητες Συγκλήτου X Εκτελεστική Διευθύντρια Γραφείο Νομικού Συμβουλίου ΜΟΔΙΠ Σύνθεση ΜΟΔΙΠ ΟΜΕΑ Διασφάλιση Ποιότητας Πληροφοριακό Σύστημα Διαχείρισης Δεδομένων Ποιότητας Πιστοποίηση Έργο ΕΣΠΑ Δεδομένα Ποιότητας Χρήσιμο Υλικό Κανονισμοί Ιδρύματος Νομοθεσία Χρήσιμοι Σύνδεσμοι Ανακοινώσεις X ΟΡΓΑΝΟΓΡΑΜΜΑ ΔΙΟΙΚΗΤΙΚΕΣ ΥΠΗΡΕΣΙΕΣ Διευθύνσεις Πανεπιστημίου Γραμματείες Τμημάτων Σχολών Πανεπιστημίου Τμήμα Διεθνών και Δημοσίων Σχέσεων Γραφείο Επικοινωνίας Γραφείο Τύπου Τμήμα Δημοσιευμάτων και Εκδόσεων Βιβλιοθήκη Ιατρείο X Σχολές ΟΙΚΟΝΟΜΙΚΩΝ, ΕΠΙΧΕΙΡΗΜΑΤΙΚΩΝ ΚΑΙ ΔΙΕΘΝΩΝ ΣΠΟΥΔΩΝ Τμήμα Οικονομικής Επιστήμης Τμήμα Οργάνωσης & Διοίκησης Επιχειρήσεων Τμήμα Διεθνών & Ευρωπαϊκών Σπουδών Τμήμα Τουριστικών Σπουδών X ΝΑΥΤΙΛΙΑΣ ΚΑΙ ΒΙΟΜΗΧΑΝΙΑΣ Τμήμα Ναυτιλιακών Σπουδών Tμήμα Βιομηχανικής Διοίκησης & Tεχνολογίας X ΧΡΗΜΑΤΟΟΙΚΟΝΟΜΙΚΗΣ ΚΑΙ ΣΤΑΤΙΣΤΙΚΗΣ Τμήμα Χρηματοοικονομικής και Τραπεζικής Διοικητικής Τμήμα Στατιστικής και Ασφαλιστικής Επιστήμης X ΤΕΧΝΟΛΟΓΙΩΝ ΠΛΗΡΟΦΟΡΙΚΗΣ ΚΑΙ ΕΠΙΚΟΙΝΩΝΙΩΝ Τμήμα Πληροφορικής Τμήμα Ψηφιακών Συστημάτων X Έρευνα Ειδικός Λογαριασμός Κονδυλίων Έρευνας (ΕΛΚΕ – ΚΕΠΠ) Εργαστήρια Διδακτορικές Σπουδές Μεταδιδακτορική Έρευνα Επιτροπή Ηθικής και Δεοντολογίας της Έρευνας Υπηρεσίες-Παροχές ΠΑΡΟΧΕΣ ΠΡΟΣ ΦΟΙΤΗΤΕΣ Φοιτητική Μέριμνα Συνήγορος του Φοιτητή Βιβλιοθήκη Προγράμματα Μεταπτυχιακών Σπουδών (ΠΜΣ) Διεθνή Προγράμματα Ευρωπαϊκά Προγράμματα Γραφείο Διασύνδεσης Μονάδα Προσβασιμότητας Ιατρείο Βραβεία – Υποτροφίες X ΗΛΕΚΤΡΟΝΙΚΕΣ ΥΠΗΡΕΣΙΕΣ Γενικές Πληροφορίες URegister MyPassword Ηλεκτρονική Γραμματεία Ηλεκτρονική εξ Αποστάσεως Εκπαίδευση Υπηρεσία Υποστήριξης Χρηστών – Helpdesk Παροχή Ηλεκτρονικού Ταχυδρομείου Λογισμικό για Εκπαιδευτική Χρήση Wi-Fi και Eduroam Σύνδεση στο VPN Υπηρεσίες Τηλεδιάσκεψης Πιστοποιητικά Ταυτότητας Χρήστη και Διακομιστή Υπηρεσίες ΕΔΥΤΕ X ΦΟΙΤΗΤΙΚΗ ΚΑΙ ΚΟΙΝΩΝΙΚΗ ΖΩΗ Πολιτιστικές Ομάδες Εθελοντική Ομάδα Αθλητικές Ομάδες Φοιτητικοί Σύλλογοι Φοιτητικές Παρατάξεις Άλλες Δραστηριότητες Έρευνα Ακαδημαϊκής Πορείας X ΑΠΟΦΟΙΤΟΙ ΠΑΝΕΠΙΣΤΗΜΙΟΥ Επιστημονική Ένωση Αποφοίτων Έρευνα Αποφοίτων X Επικοινωνία",
  "content_length": 7093,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:22"
}