{
  "name": "Dimitrios Letsios",
  "homepage": "https://www.kcl.ac.uk/people/dimitrios-letsios",
  "status": "success",
  "content": "Dimitrios Letsios | King's College London Skip to main contentDr Dimitrios Letsios Senior Lecturer in Data ScienceResearch interestsComputer scienceContact detailsdimitrios.letsios@kcl.ac.ukBiographyDimitrios Letsios is a Senior Lecturer in the Department of Informatics, at King's College London. Dimitrios undertook his BSc and MSc at the Athens University of Economics and Business, before completing his PhD in Computer Science at the Université d'Evry Val d'Essonne. Prior to joining King's, he has been affiliated as a research associate with academic institutions including Imperial College London, University Côte d'Azur, the Technical University of Munich and the Pierre and Marie Curie University. The foundations of his research are in algorithms and computational optimization, especially at their intersection with data science and artificial intelligence. Motivating applications include energy management in computer systems, fleet management in transportations, and optimization of manufacturing processes. Research Interests Data Science, Algorithms, Computational Optimization Scheduling and Graph Problems Energy-Efficient Computing, Efficient Big Data Processing Explainable Artificial Intelligence Optimization Problems for Process Engineering Further Information Personal website PublicationsResearchResearchUrban Data ScienceSupporting interdisciplinary research and innovation in and for LondonSustainability HubThe Sustainability Hub consolidates the research related to sustainabilityAlgorithms and Data AnalysisThe group develops algorithmic solutions and concrete implementations for various applications.PublicationsResearchResearchUrban Data ScienceSupporting interdisciplinary research and innovation in and for LondonSustainability HubThe Sustainability Hub consolidates the research related to sustainabilityAlgorithms and Data AnalysisThe group develops algorithmic solutions and concrete implementations for various applications.N5.12Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGOffice hours:Thursday: 09:30-11:30Based inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering Sciences",
  "content_length": 2144,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:23"
}