{
  "name": "Dimitrios I. Diochnos",
  "homepage": "https://www.diochnos.com",
  "status": "success",
  "content": "Dimitris Diochnos : home Dimitris Diochnos Δημήτρης Διώχνος Home / News Research Publications Students Theses Technical Reports Other Teaching CS 3823 CS 4713 CS 5713 Software Algebra Biology Machine Learning Optimization Academic Games Tips / How-To's Customizing LaTeX Programming Terminal Contact / CV Links OU Related UVA Related UEDIN Related UIC Related NKUA Related Computer Science diochnos/home I am an Assistant Professor at the School of Computer Science\tat the University of Oklahoma. I am primarily interested in designing and analyzing machine learning algorithms with rigorous guarantees. In particular, I have done work on the statistical and computational efficiency of supervised learning algorithms providing complexity or empirical bounds, or computational hardness results, within the context of adversarial supervised learning (different noise models, poisoning attacks, adversarial examples), randomized and local-search heuristic methods (evolvability), multiple-instance learning, and imbalanced data. During the last couple of years my students and I are investigating semi-supervised learning, learning with streaming data, regularization methods, and related topics. At the moment, the site is best viewed with Firefox / Iceweasel, Safari, Opera, and Chrome. You are using Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36. Recent Work My most recent paper is A Review of Pseudo-Labeling for Computer Vision. This is joint work with my PhD student Jay Rothenberger and our collaborators from the University of Edinburgh Patrick Kage\t\tand Pavlos Andreadis. The paper has been accepted for publication at the Journal of Artificial Intelligence Research (JAIR). Please note that this is currently a pre-print and we intend to make some small changes so that we can align better with the final remarks of the reviewers as well as to include one repository that we identified after the submission to the journal. Another recent paper is Dimensionally Reduced Open-World Clustering: DROWCULA. This is joint work with a collaborating undergraduate student, Erencem Özbey. Erencem was a visiting undergraduate student at OU during the fall of 2024 and worked in this topic. The paper has been accepted and will appear at the Australasian Joint Conference on Artificial Intelligence (AJCAI), 2025. A little bit further back (in July) this year, the following paper was accepted: Meta Co-Training: Two Views are Better than One. This is joint work with my PhD student Jay Rothenberger. The paper has been accepted and will appear at the European Conference on Artificial Intelligence (ECAI), 2025. The paper is also available on arXiv. 🥇 Meta Co-Training is a semi-supervised learning method that achieves State-of-the-Art performance on ImageNet-10% and does very well on ImageNet-1% too. Last year I had the following papers: AI2ES: The NSF AI Institute for Research on Trustworthy AI for Weather, Climate, and Coastal Oceanography, The paper describes the work done within AI2ES and is written jointly with the following people: Amy McGovern, Imme Ebert-Uphoff, Elizabeth A. Barnes, Ann Bostrom, Mariana G. Cains, Phillip Davis, Julie L. Demuth, Andrew H. Fagg, Philippe Tissot, John K. Williams. It appeared in the AI Magazine, Volume 45, Issue 1, 2024. ISAIM-2022: international symposium on artificial intelligence and mathematics, This was written jointly with Martin Charles Golumbic and Frederick Hoffman with whom we organized the International Symposium on Artificial Intelligence and Mathematics (ISAIM) 2022. This is a foreword written due to the organization of ISAIM 2022. The foreword appeared in the Annals of Mathematics and Artificial Intelligence (AMAI), Volume 92, pages 1–4, (2024). News September 2025: In the midst of all the funding cuts, the TREE-CARE proposal that Dr. Katerina Kyprioti was leading and I was a co-PI has been approved for funding. Here is a relevant news announcement from OU: link to news. This will be an exciting new direction in the research that we do and we are all looking forward to the next steps! August 2025: The ISAIM 2026 website is up and running! I am also excited to share that I will be co-chairing this event with Jörg Rothe. August 2023: The ISAIM 2024 website is up and running! March 2022: Our work was mentioned in the news of the College of Engineering: https://ouccoe100.blogspot.com/2022/03/ou-school-of-computer-science.html?spref=tw. There were also announcements on LinkedIn and Facebook. I also mentioned this on my twitter account. October 2021: The website for the 16th International Symposium on Artificial Intelligence and Mathematics (ISAIM) 2022 is up and running! August 2020: The proposal that I was participating and was led by Amy McGovern, has been accepted for funding by the National Science Foundation (NSF); see here for more details on the NSF AI Institute for Research on Trustworthy AI in Weather, Climate, and Coastal Oceanography (AI2ES). Please also visit the website that we maintain for the institute that has news and related information. There are certainly exciting times ahead of us! Finally, do not forget to follow the official Twitter account @ai2enviro for receiving the latest information that is related to the institute as soon as this information becomes available. Page Updated: Friday, 24th October, 2025 @ 03:41pm",
  "content_length": 5359,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:22"
}