{
  "name": "Dimitris Pezaros",
  "homepage": "http://www.dcs.gla.ac.uk/~dp",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Professor Dimitrios Pezaros Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffProfessor Dimitrios PezarosMr Ethan KellyZhen Tian Professor Dimitrios Pezaros Professor of Computer Networks and RAEng Research Chair (Computing Science) telephone: 01413306051 email: Dimitrios.Pezaros@glasgow.ac.uk Room S162, Computing Science, Sir Alwyn Williams Bldg, Glasgow G12 8RZ Import to contacts https://orcid.org/0000-0003-0939-378X Biography I am (full) Professor of Computer Networks in the School of Computing Science at the University of Glasgow, where I hold the Royal Academy of Engineering Research Chair in Digital Resilience for Critical National Infrastructure and I lead the Cybersecurity research theme. I am founding director of the Networked Systems Research Laboratory (netlab) since 2015 and director of Glasgow's Cyberdefence lab since 2020, and I have been the head of the Glasgow Systems Section (GLASS) between 2019-2023. I currently serve on the Engineering and Physical Sciences Research Council (EPSRC) Digital Security and Resilience (DS&R) Strategic Advisory Team (SAT). I was visiting professor at the University of Athens, Department of Informatics and Telecommunications during 2018-19. I have published widely and am leading research in computer communications, network and service management, and digital resilience of future and heterogeneous networked infrastructures, exploring technologies such as network programmability and function virtualisation and how they can be applied to resource-constrained and industrial (IT/OT) environments. I have received significant funding for my research from EPSRC, the European Comission (EC), the Defence Science and Technology Laboratory (Dstl), the Royal Academy of Engineering (RAEng), the London Mathematical Society (LMS), the US Federal Aviation Administration (FAA), and industry (incl. BT, EDF, NXP, etc.). Prior to joining Glasgow as a lecturer (assistant professor) in 2009, I have held postdoctoral and senior research associate positions at Lancaster University, where I worked on a number of EPSRC and EU-funded projects in the areas of network measurement and management, traffic engineering, autonomic communications, and network resilience. I hold BSc (Hons.) and PhD degrees in Computer Science from Lancaster University, and have been a doctoral fellow of Agilent Technologies Inc. between 2000 and 2004. I am a chartered engineer, a fellow of the BCS and the IET, a fellow of the HEA, and a senior member of the IEEE and the ACM. I serve as Associate Editor on the editorial boards of IEEE Transactions on Network and Service Management (TNSM) and IEEE Transactions on Mobile Computing (TMC). Research interests Research overview: networking; digital resilience Laboratory websites: netlab: https://www.gla.ac.uk/research/az/netlab/ Glasgow Cyberdefence lab: https://www.gla.ac.uk/research/az/cyber-defence-lab/ Research Interests: Network and service management Cybersecurity and Digital Resilience Industrial Control Systems cybersecurity Network Function Virtualisation (NFV) Software-Defined Networking (SDN) Cloud and Edge computing and networking Data Centre networking Closed-loop, adaptive resource provisioning Network traffic analysis and modelling Data-driven anomaly detection Network routing Quality of Service (QoS) Research groupsNetlab (Networked Systems Research Laboratory)Glasgow Cyber Defence LabGlasgow Systems Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 | 2012 | 2011 | 2010 | 2009 | 2008 | 2007 | 2006 | 2005 | 2004 | 2003 | 2002 | 2001Number of items: 159.2025 Yang, Jinming, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2025) A game-theoretic task offloading framework for blockchain-enabled UAV–satellite MEC systems. IEEE Networking Letters, (doi: 10.1109/LNET.2025.3615273) (Early Online Publication) Yang, Jinming, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2025) Task offloading and resource allocation in Mobile Edge Computing assisted vehicular networks across multiple regions. IEEE Transactions on Vehicular Technology, (doi: 10.1109/TVT.2025.3611347) (Early Online Publication) Shi, Jiabo, Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X and Elkhatib, Yehia ORCID: https://orcid.org/0000-0003-4639-436X (2025) xMem: A CPU-Based Approach for Accurate Estimation of GPU Memory in Deep Learning Training Workloads. In: 26th ACM/IFIP International Middleware Conference, Nashville, TN, USA, 15-19 December 2025, (Accepted for Publication) Fraser, Douglas, Miller, Alice ORCID: https://orcid.org/0000-0002-0941-1717, Cook, Marco ORCID: https://orcid.org/0000-0002-5232-2381 and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2025) Online Model Checking for Anomaly Detection in Industrial Control Systems. In: 20th International Conference on Integrated Formal Methods (iFM 2025), Paris, France, 17-18 November 2025, (Accepted for Publication) Chyzy, Jan, Cook, Marco M. ORCID: https://orcid.org/0000-0002-5232-2381 and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2025) On the Cost of Asset Discovery Techniques for Industrial Control Systems. In: 8th IEEE Conference on Industrial Cyber-Physical Systems (ICPS), Emden, Germany, 12-15 May 2025, ISBN 9798331542993 (doi: 10.1109/ICPS65515.2025.11087898) Williamson, Chris, Simpson, Kyle A. ORCID: https://orcid.org/0000-0001-8068-9909, Paul, Douglas J. ORCID: https://orcid.org/0000-0001-7402-8530 and Pezaros, Dimitrios P. ORCID: https://orcid.org/0000-0003-0939-378X (2025) Quantum well based physical unclonable functions for IoT device attestation. IEEE Access, (doi: 10.1109/ACCESS.2025.3583881) (Early Online Publication) Holik, Filip ORCID: https://orcid.org/0000-0001-6595-0419, Cook, Marco M. ORCID: https://orcid.org/0000-0002-5232-2381, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2025) Network-Wide Service Deployment Using Centrally Orchestrated, eBPF-Based Programmable Dataplanes. In: 2025 EuCNC & 6G Summit, Poznan, Poland, 03-06 Jun 2025, pp. 351-356. ISBN 9798350391817 (doi: 10.1109/EuCNC/6GSummit63408.2025.11036869) Holik, Filip ORCID: https://orcid.org/0000-0001-6595-0419, Mcilwraith, Kyle, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios P. ORCID: https://orcid.org/0000-0003-0939-378X (2025) In-Network GOOSE Encryption with eBPF-based Programmable Network Architecture. In: IEEE SmartGridComm 2025, Toronto, Canada, 29 Sep - 02 Oct 2025, (Accepted for Publication) Mahboob, Tahira, Holik, Filip ORCID: https://orcid.org/0000-0001-6595-0419, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2025) Adaptive Learning Feature Quantization for In-network FDI Detection in IEC 61850 Digital Substations. In: IEEE SmartGridComm 2025, Toronto, ON, Canada, 29 September - 2 October 2025, (Accepted for Publication) Holik, Filip ORCID: https://orcid.org/0000-0001-6595-0419, Cook, Marco M. ORCID: https://orcid.org/0000-0002-5232-2381, Deol, Bikram Singh ORCID: https://orcid.org/0009-0004-5675-7499, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios P. ORCID: https://orcid.org/0000-0003-0939-378X (2025) Dashboard Orchestration of eBPF-based Programmable OT Networks. In: IEEE International Conference on Computer Communications (INFOCOM 2025), London, UK, 19-22 May 2025, ISBN 9798331543709 (doi: 10.1109/INFOCOMWKSHPS65812.2025.11152767) Holik, Filip ORCID: https://orcid.org/0000-0001-6595-0419, Cook, Marco M. ORCID: https://orcid.org/0000-0002-5232-2381 and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2025) Resilient Network Architecture with eBPF-based Programmability and Centralised Orchestration. In: IEEE International Conference on Computer Communications (INFOCOM 2025), London, UK, 19-22 May 2025, ISBN 9798331543709 (doi: 10.1109/INFOCOMWKSHPS65812.2025.11152786) Durci, Adrian, Shah, Awais Aziz ORCID: https://orcid.org/0000-0002-1656-739X and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2025) AI in Space: Evaluating ML Algorithms for Onboard Decision-Making in Nanosatellites. In: 2nd Workshop on AI-Driven Integration of Terrestrial and Non-Terrestrial Networks (AITNTN 2025), London, UK, 19 May 2025, ISBN 9798331543709 (doi: 10.1109/INFOCOMWKSHPS65812.2025.11152837) Cook, Marco M. ORCID: https://orcid.org/0000-0002-5232-2381 and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2025) Artefact Provenance Graphs for Anomaly Inference in Industrial Control Systems. In: 40th International Conference on ICT Systems Security and Privacy Protection – IFIP SEC 2025, Maribor, Slovenia, 21-23 May 2025, pp. 136-150. ISBN 9783031928826 (doi: 10.1007/978-3-031-92882-6_10) Holik, Filip ORCID: https://orcid.org/0000-0001-6595-0419, Jouet, Simon and Pezaros, Dimitrios ORCID: https://orcid.org/0000-0003-0939-378X (2025) An eBPF-Bas",
  "content_length": 129759,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:34"
}