{
  "name": "Dimitri Ognibene",
  "homepage": "https://www.essex.ac.uk/people/ognib28704/dimitri-ognibene",
  "status": "success",
  "content": "Dimitri Ognibene | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Dimitri Ognibene People Dr Dimitri Ognibene External Examiner (Research) External Examiners - School of Computer Science and Electronic Engineering (CSEE) Honorary Lecturer School of Computer Science and Electronic Engineering (CSEE) Email dimitri.ognibene@essex.ac.uk Location Colchester Campus Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Dr Dimitri Ognibene obtained his PhD in Robotics from the University of Genoa in 2009. Before joining the University of Essex, he has been performing experimental studies and developing formal methods for active social perception at UPF, Barcelona, as a Marie Sk?odowska-Curie COFUND Fellow; developing algorithms for active vision in industrial robotic tasks as a Research Associate (RA) at Centre for Robotics Research, Kings College London; devising Bayesian methods and robotic models for attention in social and dynamic environments as a RA at the Personal Robotics Laboratory in Imperial College London; studying interaction between active vision and autonomous learning in neuro-robotic models as a RA at Institute of Cognitive Science and Technologies of the Italian Research Council (ISTC CNR). He also collaborated with Wellcome Trust Centre for Neuroimaging (UCL) to address the exploration issue in the currently dominant neurocomputational modelling paradigm. Dr Ognibene has also been Visiting Researcher at Bounded Resource Reasoning Laboratory in UMass and at University of Reykjavik (Iceland) exploring the symmetries between active sensor control and active computation or metareasoning. Dr Ognibene presented his work in several international conferences on artificial intelligence, adaptation, and development and published on international peer-reviewed journals. Dr Ognibene was invited to speak at the International Symposium for Attention in Cognitive Systems (2013 and 2014) as well as in other various neuroscience, robotics and machine-learning international venues. Dr Ognibene is Associate Editor of Paladyn, Journal of Behavioral Robotics, and has been part of the Program Committee of several conferences and symposiums. Check myGoogle scholar page For other activities check myhomepage (under update) Research and professional activities Research interests Artificial Intelligence (Ognibene & Demiris 2013, Nivel et al 2014) Cognitive Neuroscience (Ognibene et al 2017, Friston et al 2015, Pezzulo & Ognibene 2013) Proactive Social Robotics (Ognibene & Mirante, 2018; Ognibene & Demiris 2013, Ognibene et al 2013, Petit et al 2013) My research interests entail the principles underlying adaptive social behaviour in complex conditions with particular attention to anticipative skills and exploration in unknonwn environemnts. My research covers both biological and artificial agents as well as physical (visual and multimodal) and virtual environments as social media and virtual reality. I use machine learning methods, both (deep) neural and probabilistic models, to create agents as well as to study and predict their behaviours. Relevant Papers: Where do you believe you are going, human? Toward active intention recognition in unknown environments for joint robot-human search and rescue missions, D Ognibene, L Mirante,Human Aiding Robotics - ROS2018 Workshop Towards event-based MCTS for autonomous cars NC Volpi, Y Wu, D Ognibene STARE: Spatio-Temporal Attention RElocation for Multiple Structured Activities Detection. K Lee, D Ognibene, H Chang, TK Kim, Y Demiris Contextual action recognition and target localization with an active allocation of attention on a humanoid robot D Ognibene, E Chinellato, M Sarabia, Y Demiri Towards active event recognition D Ognibene, Y Demiris The 23rd International Joint Conference of Artificial Intelligence (IJCAI13) Key words: robotics Social Media Governance and Behavior Modelling (under preparation) Probabilistic and Neural Machine Learning Methods (Ognibene Baldassarre 2015, Ognibene and Demiris 2013, Ognibene et al 2013) Active Vision and Perception (Ognibene & Demiris 2013, Ognibene Baldassarre 2015, Ognibene et al 2010, Ferro, M. 2010, Ognibene et al 2008) Adaptive Model Based Control (Catenacci Volpi, Wu Ognibene, in press, Nivel et al 2014) Behaviour Modelling and Prediction (Ognibene & Demiris 2013, Ferro, M. 2010) Active Intention Recognition and Activity Monitoring (Ognibene & Demiris 2013, Lee et al 2015) Conferences and presentations Active Vision for Human Robot Collaboration Invited presentation, Cognitive Aspects of Interaction in Virtual and Augmented Reality Systems (CAIVARS), International Symposium on Mixed and Augmented Reality, Munich, Germany, 16/10/2018 Where do you believe you are going , human ? Toward active intention recognition in unknown environments for joint robot-human search and rescue missions Human Aiding Robotics IROS Workshop, IROS, Washington D.C., United States, 5/10/2018 Adaptive Vision for Human Robot Collaboration Invited presentation, 10th Computer Science and Electronic Engineering Conference, 10th Computer Science and Electronic Engineering Conference, Colchester, United Kingdom, 19/9/2018 Adaptive Vision for Human Robot Collaboration Songkhla, Thailand, 5/7/2018 A data collection architecture for monitoring second order followers of political leaders Invited presentation, SIDEWAYS 4th edition of the International Workshop on Social Media World Sensors, ESWC, Crete, Greece, 4/6/2018 Adaptive Vision for Human Robot Collaboration Invited presentation, MAchine LEarning talk series, MAchine LEarning talk series, Catania, Italy, 4/4/2018 Active Vision and Human Robot Collaboration Tutorial ICIAP 2017 2017 Teaching and supervision Previous supervision Penelope Amelia Roberts Thesis title: Context Aware Proactive Robotic Companions for Home Care and Communities Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 27/6/2024 Carmelo Calafiore Thesis title: Active Action Recognition in Humans and Robots Degree subject: Psychology Degree type: Doctor of Philosophy Awarded date: 2/4/2024 Francesca Bianco Thesis title: Theory of Mind Across Biological and Artificial Embodiment: Theory, Experiments and Computational Models Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 6/7/2022 Publications Publications (9) Koyuturk, C., Yavari, M., Theophilou, E., Bursic, S., Donabauer, G., Telari, A., Testa, A., Boiano, R., Gabbiadini, A., Hernandez-Leo, D., Ruskov, M. and Ognibene, D., (2023). Developing Effective Educational Chatbots with ChatGPT prompts: Insights from Preliminary Tests in a Case Study on Social Media Literacy (with appendix) Theophilou, E., Koyuturk, C., Yavari, M., Bursic, S., Donabauer, G., Telari, A., Testa, A., Boiano, R., Hernandez-Leo, D., Ruskov, M., Taibi, D., Gabbiadini, A. and Ognibene, D., (2023). Learning to Prompt in the Classroom to Understand AI Limits: A pilot study Chimisso, R., Buršić, S., Marocco, P., Vizzari, G. and Ognibene, D., (2023). Exploration and Comparison of Deep Learning Architectures to Predict Brain Response to Realistic Pictures Bianco, F. and Ognibene, D., (2022). Robot Learning Theory of Mind through Self-Observation: Exploiting the Intentions-Beliefs Synergy Bianco, F. and Ognibene, D., (2019). Functional advantages of an adaptive Theory of Mind for robotics: a review of current architectures Bianco, F. and Ognibene, D., (2019). Transferring Adaptive Theory of Mind to social robots: insights from developmental psychology to robotics Grassa, RL., Gallo, I., Calefati, A. and Ognibene, D., (2019). A Classification Methodology based on Subspace Graphs Learning Grassa, RL., Gallo, I., Calefati, A. and Ognibene, D., (2019). Binary Classification using Pairs of Minimum Spanning Trees or N-ary Trees Ognibene, D., Mirante, L. and Marchegiani, L., (2019). Proactive Intention Recognition for Joint Human-Robot Search and Rescue Missions through Monte-Carlo Planning in POMDP Environments Show all Journal articles (16) Alessandro, G., Dimitri, O., Cristina, B. and Anna, M., (2025). The emotional impact of generative AI: negative emotions and perception of threat. Behaviour & Information Technology. 44 (4), 676-693 Theophilou, E., Koyuturk, C., Yavari, M., Bursic, S., Donabauer, G., Telari, A., Testa, A., Boiano, R., Hernández-Leo, D., Ruskov, M., Taibi, D., Gabbiadini, A. and Ognibene, D., (2024). Shifting adolescent perceptions of Artificial Intelligence: a pilot study and open challenges. Sistemi Intelligenti. 36 (3), 597-615 Ognibene, D., Donabauer, G., Theophilou, E., Buršić, S., Lomonaco, F., Wilkens, R., Hernández-Leo, D. and Kruschwitz, U., (2023). Moving Beyond Benchmarks and Competitions: Towards Addressing Social Media Challenges in an Educational Context. Datenbank-Spektrum. 23 (1), 27-39 Taniguchi, T., Murata, S., Suzuki, M., Ognibene, D., Lanillos, P.",
  "content_length": 20940,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:18"
}