{
  "name": "Dimitris Papadias",
  "homepage": "https://www.cse.ust.hk/faculty/dimitris",
  "status": "success",
  "content": "Dimitris Papadias Dimitris Papadias (PhD, NTU Athens) Room 3555 Department of Computer Science and Engineering Hong Kong University of Science and Technology Clearwater Bay, Hong Kong dimitris@cs.ust.hk Publications General Information I am a Professor at the Department of Computer Science and Engineering, Hong Kong University of Science and Technology (HKUST). Before joining HKUST in 1997, I worked and studied at the German National Research Center for Information Technology (GMD), the  National Center for Geographic Information and Analysis (NCGIA, Maine), the University of California at San Diego, the Technical University of Vienna, the National Technical University of Athens, Queen's University (Canada), and University of Patras (Greece). In 2019, I visited Hamad Bin Khalifa University, Qatar and Athena Research Center, Greece, as part of my sabbatical leave.  In 2007, I was a Visiting Professor at the National University of Singapore. In the summer of 1997, I was a Visiting Researcher at INRIA, Sophia Antipolis in France. Research Spatial, spatio-temporal databases and everything that looks interesting (mostly database related). In 2013, I received a Research Excellence Award from HKUST. I have also been awarded the Cor-Baayen Award from the European Research Consortium for Informatics and Mathematics (ERCIM). My DBLP list of publications.  Soft copies of my papers. Citations by Google Scholar. Supervision Instructions to my PhD students (old but relevant). Current Ph.D Students: Moin Moti, Kai Wang. Graduated Ph.D Students: Nikos Mamoulis Hon. Prof. at Hong Kong University, Prof. at Univ. of Ioannina, Greece. Panos Kalnis Prof. at KAUST, Saudi Arabia. Yufei Tao Prof. at Chinese University of Hong Kong. Jun Zhang first post Asst. Prof. at Nanyang Technological University, Singapore. Chief Architect & Principle Engineer, Tencent Cloud, China. Kyriakos Mouratidis Prof. at Singapore Management University. Alexander Markowetz first post Asst. Prof. at University of Bonn, Germany. Yin (David) Yang Assoc. Prof. at Hamad Bin Khalifa University, Qatar. Stavros Papadopoulos first post Senior Research Scientist, Intel/MIT Big Data Lab. Founder of TileDB. George Kellaris first post CRCS Postdoctoral Fellow, Harvard University. Co-founder of Lerna. Nikos Armenatzoglou Software Engineer, Amazon Web Services, USA. Panos Parchas Software Engineer, Amazon Web Services, Germany. Lefteris Ntaflos Head Of Training at ITCS Group, Hong Kong. Professional Activities Program Committee Memberships. Editorial Advisory Board of Information Systems, since Sept 03. Associate Editor of the Very Large Data Bases (VLDB) Journal, Sept 05  Aug 11. Associate Editor of IEEE Transactions on Knowledge and Data Engineering (TKDE), Sept 05  Dec 09. Area Editor of Encyclopedia of Database Systems, since Sept 07. Area Chair of ICDE 26,  ICDE 25, ICDE 24, Honorary Chair of SSTD 19, Program Chair of HDMS 17, Chair of Best Paper Committee VLDB 14, Program Chair of SIGMOD 13, Program Vice-Chair of ICDE 08, Program Co-Chair of SSTD 07, Publicity and Publications Chair of VLDB 02, General Co-Chair of SSD 99. Member of the Hong Kong RGC Engineering Panel, Sept 03  Sept 05. Teaching COMP 2711 Discrete Mathematical Tools for Computer Science, HKUST, Fall 2025, Fall 2024, Fall 2020. COMP 3711 Design and Analysis of Algorithms, HKUST, Spring 2025, Fall 2023, Fall 2022, Spring 2022, Fall 2020. COMP 5311 Database Architecture and Implementation, HKUST, Spring 2024, Spring 2023, Spring 2021. My bike tours",
  "content_length": 3523,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:30"
}