{
  "name": "Dimitris S. Papailiopoulos",
  "homepage": "http://papail.io",
  "status": "success",
  "content": "Dimitris Papailiopoulos Dimitris About Publications Research Group Teaching Contact Dimitris Papailiopoulos Jay & Cynthia Ihlenfeld Associate Professor University of Wisconsin-Madison Electrical and Computer Engineering I am currently on leave at Microsoft Research. I am the Jay & Cynthia Ihlenfeld Associate Professor of Electrical and Computer Engineering (and CS by courtesy) at the University of Wisconsin-Madison, a faculty fellow at the Grainger Institute, and a faculty affiliate with the Optimization group at the Wisconsin Institute for Discovery. My research lies in the intersection of machine learning, coding theory, and optimization. I am particularly interested in the theory and practice of large-scale machine learning systems and the challenges that arise once we aim to build solutions that come with robustness and scalability guarantees. I am particuarly interested in these topics in the context of large language models and transformer architectures. Before coming to Madison, I spent two wonderful years as a postdoc at UC Berkeley, where I was a member of the AMPLab and BLISS, and had the pleasure to collaborate with Ben Recht and Kannan Ramchandran. I received my Ph.D. in 2014 from UT Austin, where I was fortunate to be advised by Alex Dimakis. Before UT, I spent 3.5 years as a grad student at USC. Before all that, I received my M.Sc. (2009) and ECE Diploma (2007) from the Technical University of Crete (TUC), located in the beautiful city of Chania. In 2018, I co-founded the conference on Machine Learning & Systems (MLSys), a new conference that targets research at the intersection of systems and machine learning. In 2018 and 2020, I was the program co-chair for MLSys. In 2019, I also co-chaired the 3rd Midwest Machine Learning Symposium (MMLS). gScholar bio, resume twitter Publications Most updated list available at Google Scholar A selected list of recent papers that I'm particularly fond of: Teaching Arithmetic to Small Transformers N Lee, K Sreenivasan, JD Lee, K Lee, D Papailiopoulos ICLR 2024 [arxiv] Looped Transformers are Better at Learning Learning Algorithms L Yang, K Lee, RD Nowak, D Papailiopoulos ICLR 2024 [arxiv] Looped Transformers as Programmable Computers Angeliki Giannou, Shashank Rajput, Jy-yong Sohn, Kangwook Lee, Jason D Lee, Dimitris Papailiopoulos ICML 2023 [arxiv] Transformers as Algorithms: Generalization and Stability in In-context Learning Yingcong Li, M Emrullah Ildiz, Dimitris Papailiopoulos, Samet Oymak ICML 2023 [arxiv] LIFT: Language-Interfaced Fine-Tuning for Non-Language Machine Learning Tasks Tuan Dinh, Yuchen Zeng, Ruisu Zhang, Ziqian Lin, Shashank Rajput, Michael Gira, Jy-yong Sohn, Dimitris Papailiopoulos, Kangwook Lee NeurIPS 2022 [arxiv] Research Group I am very fortunate to work with and learn from the following amazing colleagues Members Liu Yang CS Ph.D (2020-), co-advised with Rob Nowak and Kangwook Lee Nayoung Lee ECE Ph.D (2020-), co-advised with Kangwook Lee Angeliki Giannou CS Ph.D (2021-) Vasilis Papageorgiou CS Ph.D (2022-) Zacharias Sifakis ECE Ph.D (2023-) Zheyang Xiong CS MS (2023-) Jack Cai ECE MS (2023-) Alumni Saurabh Agarwal CS Ph.D (2019-2024), co-advised with Shivaram Venkataraman Postdoc, UT-Austin Kartik Sreenivasan CS Ph.D (2020-2024) Research Scientist, Mosaic AI/Databricks Shashank Rajput CS Ph.D. (2018-2023) Research Scientist, Mosaic AI/Databricks Matthew Grinde ECE M.Sc. (2020-2023) Jy-yong Sohn Postdoc (2020-2022) Assistant Professor, Yonsei University, Statistics Hongyi Wang CS Ph.D (2016-2021) Assistant Professor, Rutgers, CS Zachary Charles ECE Postdoc (2017-2019) Research Scientist, Google Alliot Nagle ECE M.Sc. (2019-2022) ECE Ph.D., UT Austin Shengchao Liu CS M.Sc. (2016-2019) CS Ph.D., UMontreal Pradyot Prakash ECE M.Sc. (2018) ML Engineer, Facebook Heather Jia undegraduate researcher (2018) Tiancheng Yu Visiting undegraduate researcher (2016) EECS Ph.D., MIT Maximilian Lam Undegraduate researcher (2014-2016) CS Ph.D, Harvard Teaching ECE330: Signals and Systems Fall 2017, Fall 2018 ECE331: Introduction to Probability and Statistics Fall 2019, Fall 2020, Fall 2021, Fall 2022 CS/ECE/ME 532: Matrix Methods for Machine Learning Spring 2023 ECE611: Introduction to Doctoral Research in Electrical and Computer Engineering Spring 2021 ECE826: Theoretical Foundations of Large-scale Machine Learning Spring 2022 ECE901/CS838: Large-scale Machine Learning and Optimization Fall 2016, Spring 2018 ECE901: Recent Theoretical Advances in Machine Learning Systems Spring 2020 Contact Address 1550 Engineering Dr, M1002 Engineering Center Building, University of Wisconsin-Madison Madison, WI 53706 Email dimitris@papail.io About Publications Research Group Teaching Contact Dimitris Papailiopoulos",
  "content_length": 4748,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:32"
}