{
  "name": "Dimitrios Skarlatos 0002",
  "homepage": "https://www.cs.cmu.edu/~dskarlat",
  "status": "success",
  "content": "Dimitrios Skarlatos I'm an Assistant Professor in the Computer Science Department at Carnegie Mellon University where I lead the CAOS group. Before, I spent a year at Meta Research. My research bridges computer architecture and operating systems with a focus on performance, security, and efficiency for AI datacenters. Life's too short for slow and insecure computers My research has been recognized with several awards, including the IEEE CS TCCA Young Computer Architect Award, the NSF CAREER award, an Intel Outstanding Researcher Award, a Linux Foundation Faculty Award, the Intel Rising Star Faculty Award, several industry awards from Amazon, AMD, Oracle, and Meta, an ISCA Best Paper award, two ASPLOS best paper awards, four IEEE MICRO Top Picks, and a CACM Research Highlight. Several of our works have been released as open-source, upstreamed into Linux and Android, and deployed in production across millions of servers. I earned a PhD in Computer Science at the University of Illinois at Urbana-Champaign in 2020 where I was fortunate to work with Prof. Josep Torrellas in the i-acoma group. My PhD thesis, Rethinking Computer Architecture and Operating Systems Abstractions for Good & Evil, received the David J. Kuck Outstanding Ph.D. Thesis Award, and the ACM SIGARCH & IEEE CS TCCA Outstanding Dissertation Award, for \"contributions to redesigning the abstractions and interfaces that connect hardware and operating systems\". My alma mater is the Technical University of Crete in Greece, where I studied Electronic and Computer Engineering. During my years in Crete I had the chance to work with Prof. Dionisios Pnevmatikatos, Prof. Apostolos Dollas, Prof. Ioannis Papaefstathiou and Prof. Polyvios Pratikakis. 2025 [SOSP] LithOS: An Operating System for Efficient Machine Learning on GPUs Patrick H. Coppock, Brian Zhang, Eliot H. Solomon, Vasilis Kypriotis, Leon Yang, Bikash Sharma, Dan Schatzberg, Todd C. Mowry, Dimitrios Skarlatos. Proceedings of the 31st Symposium on Operating Systems Principles, Seoul, Republic of Korea, October 2025. [MICRO] Learning to Walk: Architecting Learned Virtual Memory Translation Kaiyang Zhao, Yuang Chen, Xenia Xu, Dan Schatzberg, Nastaran Hajinaza, Rupin Vakharwala, Andy Anderson, Dimitrios Skarlatos. Proceedings of the 58th Intl. Symposium on Microarchitecture, Seoul, Korea, October 2025. [CACM] TMO: Transparent Memory Offloading in Datacenters. Johannes Weiner, Niket Agarwal, Dan Schatzberg, Leon Yang, Hao Wang, Blaise Sanouillet, Bikash Sharma, Tejun Heo, Mayank Jain, Chunqiang Tang, Dimitrios Skarlatos. Communications of the ACM (CACM) Research Highlight, August 2025. Technical Perspective article by Parthasarathy Ranganathan, VP/Technical Fellow at Google [OSDI] EMT: An OS Framework for New Memory Translation Architectures Siyuan Chai, Jiyuan Zhang, Jongyul Kim, Alan Wang, Fan Chung, Jovan Stojkovic, Weiwei Jia, Dimitrios Skarlatos, Josep Torrellas, and Tianyin Xu. Proceedings of the 19th USENIX Symposium on Operating Systems Design and Implementation, Boston, MA, USA, July 2025. [ASPLOS] Cinnamon: A Framework for Scale-out Encrypted AI Siddharth Jayashankar, Edward Chen, Tom Tang, Wenting Zheng, Dimitrios Skarlatos. Proceedings of the 30th Intl. Conference on Architectural Support for Programming Languages and Operating Systems, Rotterdam, The Netherlands, March 2025. Open-Source release ACM Artifact Available, Functional, and Results Reproduced! 2024 [ISCA] Perspective: A Principled Framework for Pliable and Secure Speculation in Operating Systems. Tae Hoon Kim, David Rudo, Kaiyang Zhao, Zirui Neil Zhao, Dimitrios Skarlatos. Proceedings of the 51st Intl. Symposium on Computer Architecture, Buenos Aires, Argentina, June 2024. [MICRO Top Picks] The Pursuit of Physical Memory Contiguity in Datacenters. Kaiyang Zhao, Kaiwen Xue, Ziqi Wang, Dan Schatzberg, Leon Yang, Antonis Manousis, Johannes Weiner, Rik van Riel, Bikash Sharma, Chunqiang Tang, Dimitrios Skarlatos. IEEE MICRO Magazine, Top Picks Special Issue, May-June 2024. 2023 [MICRO] Memento: Architectural Support for Ephemeral Memory Management in Serverless Environments. Ziqi Wang, Kaiyang Zhao, Pei Li, Andrew Jacob, Michael Kozuch, Todd Mowry, Dimitrios Skarlatos. Proceedings of the 56th Intl. Symposium on Microarchitecture, Toronto, Canada, October 2023. [SOSP] Siloz: Leveraging DRAM Isolation Domains to Prevent Inter-VM Rowhammer. Kevin Loughlin, Jonah Rosenblum, Stefan Saroiu, Alec Wolman, Dimitrios Skarlatos, Baris Kasikci. Proceedings of the 29th Symposium on Operating System Principles, Germany, October 2023. [SOSP] XFaaS: Hyperscale and Low Cost Serverless Functions at Meta. Alireza Sahraei, Soteris Demetriou, Amirali Sobhgol, Haoran Zhang, Abhigna Nagaraja, Neeraj Pathak, Girish Joshi, Carla Souza, Bo Huang, Wyatt Cook, Andrii Golovei, Pradeep Venkat, Andrew McFague, Dimitrios Skarlatos, Vipul Patel, Ravinder Thind, Ernesto Gonzalez, Yun Jin, and Chunqiang Tang. Proceedings of the 29th Symposium on Operating System Principles, Germany, October 2023. [OSDI] ServiceRouter: Hyperscale and Minimal Cost Service Mesh at Meta. Harshit Saokar, Soteris Demetriou, Nick Magerko, Max Kontorovich, Josh Kirstein, Margot Leibold, Dimitrios Skarlatos, Hitesh Khandelwal, Chunqiang Tang. Proceedings of the 17th USENIX Symposium on Operating Systems Design and Implementation, Boston, USA, July 2023. [ISCA] Contiguitas: The Pursuit of Physical Memory Contiguity in Datacenters. Kaiyang Zhao, Kaiwen Xue, Ziqi Wang, Dan Schatzberg, Leon Yang, Antonis Manousis, Johannes Weiner, Rik van Riel, Bikash Sharma, Chunqiang Tang, Dimitrios Skarlatos. Proceedings of the 50th Intl. Symposium on Computer Architecture, Orlando, USA, June 2023. Selected for the ISCA 2023 Best Paper Award! Selected in IEEE Micro's Top Picks special issue of \"most significant papers in computer architecture based on novelty and long-term impact\" for 2023! Initial patches of Contiguitas have been upstreamed in the Linux Kernel! [MICRO Top Picks] IOCost: Block IO Control for Containers in Datacenters. Tejun Heo, Dan Schatzberg, Andrew Newell, Song Liu, Saravanan Dhakshinamurthy, Iyswarya Narayanan, Josef Bacik, Chris Mason, Chunqiang Tang, Dimitrios Skarlatos. IEEE MICRO Magazine, Top Picks Special Issue, May-June 2023. [HPCA] Memory-Efficient Hashed Page Tables. Jovan Stojkovic, Namrata Mantri, Dimitrios Skarlatos, Tianyin Xu, Josep Torrellas. Proceedings of the 29th Intl. Symposium on High-Performance Computer Architecture, Montreal, CA, February 2023. 2022 [ASPLOS] TMO: Transparent Memory Offloading in Datacenters. Johannes Weiner, Niket Agarwal, Dan Schatzberg, Leon Yang, Hao Wang, Blaise Sanouillet, Bikash Sharma, Tejun Heo, Mayank Jain, Chunqiang Tang, Dimitrios Skarlatos. Proceedings of the 27th Intl. Conference on Architectural Support for Programming Languages and Operating Systems, Lausanne, Switzerland, February 2022. Selected for the ASPLOS 2022 Best Paper Award! Selected as a Communications of the ACM Research Highlight (CACM RH) 2024! Highlighted as a Best Hardware Engineering Paper Article at Phoronix Article at Meta [ASPLOS] IOCost: Block IO Control for Containers in Datacenters. Tejun Heo, Dan Schatzberg, Andrew Newell, Song Liu, Saravanan Dhakshinamurthy, Iyswarya Narayanan, Josef Bacik, Chris Mason, Chunqiang Tang, Dimitrios Skarlatos. Proceedings of the 27th Intl. Conference on Architectural Support for Programming Languages and Operating Systems, Lausanne, Switzerland, February 2022. Selected in IEEE Micro's Top Picks special issue of \"most significant papers in computer architecture based on novelty and long-term impact\" for 2022! [ASPLOS] Parallel Virtualized Memory Translation with Nested Elastic Cuckoo Page Tables. Jovan Stojkovic, Dimitrios Skarlatos, Apostolos Kokolis, Tianyin Xu, Josep Torrellas. Proceedings of the 27th Intl. Conference on Architectural Support for Programming Languages and Operating Systems, Lausanne, Switzerland, February 2022. 2021 [SOSP] RAS: Continuously Optimized Region-wide Datacenter Resource Allocation. Andrew Newell, Dimitrios Skarlatos, Jingyuan Fan, Pavan Kumar, Maxim Khutornenko, Mayank Pundir, Yirui Zhang, Mingjun Zhang, Yuanlai Liu, Linh Le, Brendon Daugherty, Apurva Samudra, Prashasti Baid, James Kneeland, Igor Kabiljo, Dmitry Shchukin, Andre Rodrigues, Scott Michelson, Ben Christensen, Kaushik Veeraraghavan, Chunqiang Tang. Proceedings of the 28th Symposium on Operating System Principles, Virtual, October 2021. [ISCA] NVOverlay: Enabling Efficient and Scalable High-Frequency Snapshotting to NVM. Ziqi Wang, Michael A. Kozuch, Todd C. Mowry, Vivek Seshadri, Gennady Pekhimenko, Chulhwan Choo, Dimitrios Skarlatos. Proceedings of the 48th Intl. Symposium on Computer Architecture, Virtual, June 2021. [ASPLOS] Jamais Vu: Thwarting Microarchitectural Replay Attacks. Dimitrios Skarlatos, Zirui Neil Zhao, Riccardo Paccagnella, Christopher W. Fletcher, Josep Torrellas. Proceedings of the 25th Intl. Conference on Architectural Support for Programming Languages and Operating Systems, Virtual, March 2021. Open-Source release ACM Artifact Available, Functional, and Results Reproduced! [MICRO Top Picks] BabelFish: Fusing Address Translations for Containers. Dimitrios Skarlatos, Umur Darbaz, Bhargava Gopireddy, Nam Sung Kim, Josep Torrellas. IEEE MICRO Magazine, Top Picks Special Issue, May-June 2021. 2020 [MICRO] Draco: Architectural and Operating System Support for System Call Security. Dimitrios Skarlatos, Qingrong Chen, Jianyan Chen, Tianyin Xu, Josep Torrellas. Proceedings of the 53rd Intl. Symposium on Microarchitecture, Athens, Greece, October 2020. Draco has been upstreamed in the Linux Kernel! Draco has been adopted by Android! RFC, Linux Source Code, Article at Phoronix [ISCA] BabelFish: Fusing Address Translations for Containers. Dimitrios Skarlatos, Umur Darbaz, Bhargava Gopireddy, Nam Sung Kim, Josep Torrellas. Proceedings of the 47th Intl. Symposium on Computer Architecture, Valencia, Spain, June 2020. Selected in IEEE M",
  "content_length": 15711,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:26"
}