{
  "name": "Dinesh Jayaraman",
  "homepage": "https://www.seas.upenn.edu/~dineshj",
  "status": "success",
  "content": "Dinesh Jayaraman Assistant Professor University of Pennsylvania I am an assistant professor at UPenn’s GRASP lab, with a primary appointment in CIS, and a secondary appointment in ESE. I lead the Perception, Action, and Learning (PennPAL) Research Group, where we work on problems at the intersection of robotics, machine learning, and computer vision. Research Statement: My research statement, last updated Aug 2025, explains our research vision. Teaching: In Fall 2025, I am teaching CIS 4190 / 5190 Applied Machine Learning. Here are the past courses I have taught. For prospective masters and undergraduate students If you're an undergraduate or MS student interested in collaborating with our PennPAL research group, please complete this form. We monitor responses regularly, and will reach out to you if there's an opening. Women and underrepresented minorities are especially encouraged to apply. For prospective PhD students Formal admissions are processed through the university's various programs. You may send me email too, but please note that I might not be able to respond. Emailing me I receive a lot of email and find it difficult to respond to them all. I will try to get to your email sooner if you are enrolled at Penn and either: (1) a student in a class I am instructing (most communication would be appropriate on the Ed forum, unless you specifically want to avoid TA eyes; if you're sure you need to email me, start subject with \"[<course number> student]\", e.g. \"[CIS 4190 student]\"), or (2) assigned to me as an advisee (start email subject with \"[Student Advisee]\"). Bio: Here is a bio page that can be used for talks. Download CV Recent Publications Kaustubh Sridhar, Souradeep Dutta, Dinesh Jayaraman, Insup Lee (2025). RICL: Adding In-Context Adaptability to Pre-Trained Vision-Language-Action Models. CORL. Cite Edward S. Hu, Jie Wang, Xingfang Yuan, Fiona Luo, Muyao Li, Gaspard Lambrechts, Oleh Rybkin, Dinesh Jayaraman (2025). Real-World Reinforcement Learning of Interactive Perception Behaviors. NeurIPS. Cite George Jiayuan Gao, Tianyu Li, Junyao Shi, Yihan Li, Zizhe Zhang, Nadia Figueroa, Dinesh Jayaraman (2025). VLMgineer: Vision-Language Models as Robotic Toolsmiths. arXiv preprint arXiv:2507.12644. Cite Long Le, Ryan Lucas, Chen Wang, Chuhao Chen, Dinesh Jayaraman, Eric Eaton, Lingjie Liu (2025). Pixie: Fast and Generalizable Supervised Learning of 3D Physics from Pixels. arXiv preprint arXiv:2508.17437. Cite arXiv Pratik Kunapuli, Jake Welde, Dinesh Jayaraman, Vijay Kumar (2025). Leveling the Playing Field: Carefully Comparing Classical and Learned Controllers for Quadrotor Trajectory Tracking. RSS. Cite See all publications",
  "content_length": 2679,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:38"
}