{
  "name": "Dingqi Yang",
  "homepage": "https://www.fst.um.edu.mo/personal/yangdingqi",
  "status": "success",
  "content": "yangdingqi – Faculty of Science and Technology Dingqi YANG Associate Professor,Department of Computer and Information Science/State Key Laboratory of Internet of Things for Smart City,University of Macau, Macau SAR, ChinaTel: (00853) 8822 9971Email: dingqiyang [THAT SYMBOL] um.edu.mo News Open Ph.D. and R.A. Positions are available on the topics of spatiotemporal data mining and knowledge graphs. 2025.07 One paper on continuous-time information cascade modeling has been accepted by TKDE 2025. [PDF] [CODE] 2025.05 One paper on manipulatable generative modeling of human trajectory has been accepted by KDD 2025. [PDF] [CODE] 2025.05 One paper on multimodal hyper-relational KG has been accepted by ACL 2025. [PDF] [CODE] 2025.04 One paper on location prediction over human trajectories has been accepted by TMC. [PDF] [CODE] 2024.12 One paper on generative modeling of human trajectory and its systematic benchmarking protocol has been accepted by KDD 2025. [PDF] [CODE] 2024.12 One paper on cascade modeling for information popularity prediction has been accepted by AAAI 2025. [PDF] [CODE] 2024.10 One paper on on-campus crowd mobility digital twins has been accepted by IMWUT. [PDF] [VIDEO] 2024.07 One paper on schema-aware link prediction over hyper-relational knowledge graphs has been accepted by ACL 2024. [PDF] [CODE] 2024.02 One paper on link prediction on noisy knowledge graphs has been accepted by WWW 2024. [PDF] [CODE] 2023.08 One paper on hyper-relational schema modeling has been accepted by ACM MM 2023. [PDF] [CODE] Biography I’m currently an Associate Professor at the Department of Computer and Information Science with the State Key Laboratory of Internet of Things for Smart City at the University of Macau. Prior to that, I was a senior researcher in the eXascale Infolab at the University of Fribourg, Switzerland from 2015 to 2020. I received my Ph.D. (with highest honors) in Computer Science from Institut Mines-Télécom/Télécom SudParis and Université Pierre et Marie Curie, Paris 6 (now Sorbonne University)in Jan. 2015, under the supervision of Prof. Daqing Zhang. In June 2015, My Ph.D. thesis won the CNRS Samovar Doctorate Award (“Prix Doctorant CNRS Samovar/Télécom SudParis”) and Institut Mines-Télécom Press Mention. I’m also a recipient of the “2014 Chinese Government Award for Outstanding Self-financed (non-government sponsored) Students Abroad”. Research Interests I’m broadly interested in designing novel data mining and machine learning techniques to efficiently discover knowledge and get insights from Big Data, and also in building practical systems to tackle real-world problems. My research interests lie primarily on Ubiquitous Big Data Analytics, Social Network Analysis, Predictive Modelling, Data Sketching, and Data Privacy. Selected Recent Publications Xin Jing, Yichen Jing, Yuhuan Lu, Bangchao Deng, Sikun Yang, Dingqi Yang*, On Your Mark, Get Set, Predict! Modeling Continuous-Time Dynamics of Cascades for Information Popularity Prediction, IEEE Transactions on Knowledge and Data Engineering (TKDE), 2025. [PDF] [CODE]Bangchao Deng, Ling Ding, Lianhua Ji, Chunhua Chen, Xin Jing, Bingqing Qu, Dingqi Yang*, Marionette: Fine-Grained Conditional Generative Modeling of Spatiotemporal Human Trajectory Data Beyond Imitation, In Proc. of ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD’25), Aug. 2025, Toronto, Canada. [PDF] [CODE]Bangchao Deng, Xin Jing, Tianyue Yang, Bingqing Qu, Dingqi Yang*, Philippe Cudre-Mauroux, Revisiting Synthetic Human Trajectories: Imitative Generation and Benchmarks Beyond Datasaurus, In Proc.  of ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD’25), Aug. 2025, Toronto, Canada. [PDF] [CODE]Yuhuan Lu, Weijian Yu, Xin Jing, Dingqi Yang*, HyperFM: Fact-Centric Multimodal Fusion for Link Prediction over Hyper-Relational Knowledge Graphs. In Proc. of the Association of Computational Linguistics (ACL’25), Aug. 2025, Vienna, Austria. [PDF] [CODE]Bangchao Deng, Bingqing Qu, Pengyang Wang, Dingqi Yang*, Benjamin Fankhauser, and Philippe Cudre-Mauroux, REPLAY: Modeling Time-Varying Temporal Regularities of Human Mobility for Location Prediction over Sparse Trajectories, IEEE Transactions on Mobile Computing (TMC), 2025. [PDF] [CODE]Xin Jing, Yichen Jing, Yuhuan Lu, Bangchao Deng, Xueqin Chen, Dingqi Yang*, CasFT: Future Trend Modeling for Information Popularity Prediction with Dynamic Cues-Driven Diffusion Models. In Proc.  of the AAAI Conference on Artificial Intelligence (AAAI’25) Feb 2025, Philadelphia, USA. [PDF] [CODE]Chunhua Chen, Yuxin Yang, Hao Yuan, Longbiao Chen, Leye Wang, Bingqing Qu, Dingqi Yang*, Animating the Crowd Mirage: A WiFi-Positioning-Based Crowd Mobility Digital Twin for Smart Campuses. In Proc. of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT), December 2024. [PDF] [VIDEO]Yuhuan Lu, Weijian Yu, Xin Jing, Dingqi Yang*, HyperCL: A Contrastive Learning Framework for Hyper-Relational Knowledge Graph Embedding with Hierarchical Ontology. In Findings of the Association of Computational Linguistics (ACL’24), Aug. 2024, Bangkok. [PDF] [CODE]Weijian Yu, Jie Yang, Dingqi Yang*, Robust Link Prediction over Noisy Hyper-Relational Knowledge Graphs via Active Learning, In Proc. of ACM Web Conference (WWW’24), May. 2024, Singapore. [PDF] [CODE]Yuhuan Lu, Bangchao Deng, Weijian Yu, Dingqi Yang*, HELIOS: Hyper-Relational Schema Modeling from Knowledge Graphs, In Proc. of ACM International Conference on Multimedia (MM’23), Oct. 2023, Ottawa. [PDF] [CODE]Bangchao Deng, Dingqi Yang*, Bingqing Qu, Benjamin Fankhauser, Philippe Cudre-Mauroux, Robust Location Prediction over Sparse Spatiotemporal Trajectory Data: Flashback to the Right Moment! ACM Transactions on Intelligent Systems and Technology (TIST), 2023. [PDF] [CODE]Alessia Antelmi, Gennaro Cordasco, Mirko Polato, Vittorio Scarano, Carmine Spagnuolo, Dingqi Yang, A Survey on Hypergraph Representation Learning, ACM Computing Surveys (CSUR), 2023. [PDF]Full publication list … Team Dingqi Yang (PI) Xin Jing (Ph.D. Student 2022-) Sirui Lai (Ph.D. Student 2023-) Bangchao Deng (Ph.D. Student 2024-) Weijian Yu (Ph.D. Student 2024-) Hao Yuan (Ph.D. Student 2024-) Chunhua Chen (Ph.D. Student 2025-) Ling Ding (Ph.D. Student 2025-) Tianyue Yang (M.S. Student 2023-) Lianhua Ji (M.S. Student 2024-) Zeyu Shi (M.S. Student 2024-) Kaiyuan Xiao (M.S. Student 2024-) Xiangrun Meng (M.S. Student 2024-) Alumni: Yuhuan Lu (Ph.D. 2025), Terence Un (M.S. 2025 🏆), Yichen Jing (M.S. 2025 🏆), Yuxin Yang (M.S. 2024), Yanwei Hua (M.S. 2024), Hao Yuan (M.S. 2024), Weijian Yu (M.S. 2024 🏆), Chunhua Chen (M.S. 2024), Shiyao Zhao (RA 2023), Baoyan Han (RA 2023), Bangchao Deng (M.S. 2023), Shiyu Zhang (M.S. 2023), Hang Yin (M.S. 2023), Shukui Liu (M.S. 2023), Paolo Rosso (Ph.D. 2021), Terence Heaney (M.S. 2016), Christos Sotiriou (M.S. 2014)🏆 Best MSc Student Awards by Faculty of Science and Technology, University of Macau Dataset Visualization [Foursquare Dataset Available Here] Demos NationTelescope: Monitoring and Visualizing Large-Scale Collective Behavior in LBSNs. [Demo] [PDF] [Dataset]CrimeTelescope: Crime Hotspot Prediction based on Urban and Social Media Data Fusion. [Demo] [PDF]CrowdTelescope: Wi-Fi-Positioning-Based Multi-Grained Spatiotemporal Crowd Flow Prediction for Smart Campus. [Demo] [PDF]",
  "content_length": 7352,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:41"
}