{
  "name": "Dinghao Wu",
  "homepage": "https://faculty.ist.psu.edu/wu",
  "status": "success",
  "content": "Dinghao Wu's Home Page Dinghao Wu Dewey Walker Professor College of Information Sciences and Technology The Pennsylvania State University Mailing address: E355 Westgate Building University Park, PA 16802 Office: E355 Westgate Building Phone: (814) 867-3612 Fax: (814) 865-6426 Email: Bio | CV | Publications | Grants | Software Releases | Teaching | Lab | Team | Media | News Open Positions: I am looking for two undergraduate research assistants, with GUI design and programming experience. Research Highlights: The Uroboros work has been adopted by 2 teams among the 7 finalists in the DARPA Cyber Grand Challenge (CGC) competition! Education: Ph.D., Computer Science (advised by Andrew W. Appel), Princeton University, 2005. M.E., Computer Software and Theory (advised by Jian Lu), Nanjing University, 1999. B.E., Chemical Engineering, Nanjing University of Chemical Technology, 1996. Teaching: SRA 221: Information Security, Spring 2025: CANVAS Research Interests: Cybersecurity, Artificial Intelligence, Formal Methods, Programming Languages, and Software Engineering. Professional Activities: Program Committees: AAAI (2024, 2025), CIKM 2022, ICSOFT 2022, ICSE 2021, MLBA 2020, Cybersecurity journal guest editor for a special series on Binary Analysis, ACM CCS (2019, 2018, 2017), SPRO 2019, HotSoS 2018, SecureComm (2020, 2019, 2018, 2017), FEAST (2020, 2019, 2018, 2017 (PC Co-chair)), QRS (2022, 2021, 2020, 2019, 2018, 2017, 2016, 2015), ICSE 2016 (SEIP Track), ENASE (2022, 2021, 2015). Current Projects CAREER: Advanced Trace-oriented Binary Code Analysis Binary Code Reverse Engineering and Retrofitting Principled Side Channel Vulnerability Detection and Mitigation Towards Secure Lean Software Machine Learning for Cybersecurity Previous Projects Programming in Eliza Cruiser: Concurrent Buffer Overflow Monitoring Using Lock-free Data Structures SPLAD: Obfuscation Resilient Software Plagiarism Detection BIM Data Hub: Software Interoperability for Building Information Modeling Foundational Proof-Carrying Code for security of untrusted code. KISS: Debugging concurrent programs with sequential analysis. EspC: Program analysis on large-scale production code for concurrency defect detection. Formal Methods for software specification and verification. Hobbies: The Game of Go, Chinese Chess, Calligraphy.",
  "content_length": 2323,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:41"
}