{
  "name": "Ding Li 0001",
  "homepage": "https://marapapman.github.io",
  "status": "success",
  "content": "About Me - Ding Li @ PKU Dr. Ding LiAssistant Professor Follow Beijing, ChinaPeking UniversityEmailGoogle ScholarORCID I am an Assistant Professor at the School of Computer Science at Peking University. My research interests are in system security and program analysis. I am developing a next-generation AI-based system that integrates machine learning with program and system analysis to detect and resolve security, performance, and runtime issues in enterprise environments. I was ranked second among the most influential early-career software engineering researchers between 2010 and 2017 by the Journal of Systems and Software.ResearchI am leading the following projects. You can also find my full publication list at DBLP and Google Scholar:WASEM: A general symbolic execution engine for WASM bytecode. Please check our papers for details:[ISSTA’23(Distinguished Paper)][CCS’23][OOPSLA’25]SysArmor: An AI enhanced provenance-based intrusion detection system. This is an end-to-end AI system that directly detects APT attacks, recovers the complex attack campaign logics, and generates human-readable attack reports from raw logs fully automatically without relying on any manually crafted rules! This has also been integrated to Huawei OpenEuler Community Please check our papers for details:[SEC’23] [TDCS’23][NDSS’24][HPCA’25][TDCS’25][RTSS’25][NDSS’26]We have also extended our provenance analysis algorithm, [NodLink], to broader areas like adversarial query detection for AI systems[S&P’25] and promotion abuse fraud detection[S&P’26]AwardsFirst Prize of Scientific and Technological Progress Award by the Chinese Institute of Electronics, 2025PKU Outstanding Junior Faculty Award, 2024ISSTA Impact Paper Award, 2023ISSTA Distinguished Paper Award, 2023Tecent Excellent Innovation Award, 2021NEC Excellent Invention Award, 2018NEC Business Contribution Award, 2017ServicesACM TheWebConf Conference (WWW), 2026, Senior PCACM Conference on Computer and Communications Security (CCS), 2026, PCACM TheWebConf Conference (WWW), 2025, PCACM Conference on Computer and Communications Security (CCS), 2025, PCIEEE/ACM International Conference on Automated Software Engineering (ASE), 2024, PCACM TheWebConf Conference (WWW), 2024, PCThe 38th IEEE/ACM International Conference on Automated Software Engineering (ASE), 2023, PCThe ACM Conference on Computer and Communications Security (CCS), 2023, PCThe ACM Conference on Computer and Communications Security (CCS), 2022, PCThe ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA), 2022, PC",
  "content_length": 2566,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:38"
}