{
  "name": "Dingwen Tao",
  "homepage": "https://people.ucas.edu.cn/~tdw",
  "status": "success",
  "content": "陶鼎文-中国科学院大学-UCAS [中文] [English] 研究领域 招生信息 教育背景 工作经历 教授课程 专利与奖励 代表论文 指导学生 基本信息 陶鼎文  男  研究员 博导 中国科学院计算技术研究所曾任美国印第安纳大学信息与计算机学院终身副教授，入选国家级人才项目、美国NSF CAREER、海外优青，获得IEEE高性能计算杰出新人奖、CCF高性能计算青年科技人才、R&D100创新奖、Meta研究奖、Amazon研究奖、ACM ICS最佳论文亚军、IEEE Cluster最佳论文、IEEE Transactions on Big Data年度最佳论文奖等奖项。目前担任CCF A类期刊IEEE TPDS副主编、国际期刊Elsevier Parallel Computing分区主编，是ACM和IEEE的高级会员。电子邮件：taodingwen@ict.ac.cn通信地址：北京市海淀区北清路156号邮政编码：100190 研究领域 高性能计算，并行算法和软件，分布式机器学习系统，科学数据管理和存储。 招生信息 陶鼎文研究员带领的高性能数据处理系统课题组每年招收1至2名博士生及若干硕士生。课题组近期的研究集中在科学数据缩减、科学计算并行算法与软件、高性能计算系统软件、大模型训练及推理优化、大模型容错等多个领域。课题组目前还需要助理研究员、博士后、工程师，背景不限，对HPC和AI系统研究有兴趣的青年都可以联系我们。同时，也欢迎优秀学子关注计算所的保研夏令营及招生信息，报名我们的课题组。 招生专业 081201-计算机系统结构081203-计算机应用技术 招生方向 高性能计算，并行算法和软件分布式机器学习系统科学数据管理和存储 教育背景 2013-09--2018-06   美国加利福利亚大学河滨分校   博士研究生2009-09--2013-07   中国科学技术大学   本科生 工作经历 工作简历 2024-05~现在, 中国科学院计算技术研究所, 研究员2024-04~2024-04,美国印第安纳大学, 终身副教授2022-08~2024-04,美国印第安纳大学, 副教授2020-08~2022-08,美国华盛顿州立大学, 助理教授2018-08~2020-08,美国阿拉巴马大学, 助理教授2018-01~2018-06,美国布鲁克海文国家实验室, 研究助理2016-06~2017-12,美国阿贡国家实验室, 研究助理2015-06~2015-08,美国西北太平洋国家实验室, 博士实习生 社会兼职 2024-01-01-今,《IEEE Transactions on Parallel and Distributed Systems》期刊, 副主编2024-01-01-今,《Parallel Computing》期刊, 副主编 教授课程 国科大 学期课程名称课程属性角色（首席、主讲、助教）授课对象2024—2025学年(秋)第一学期数值分析及其应用专业课首席教授研究生2025—2026学年(秋)第一学期数值分析及其应用专业课首席教授研究生2025—2026学年(春)第二学期计算机组成原理专业课主讲教授本科生 专利与奖励 奖励信息 （1） ACM ICS最佳论文亚军, , 其他, 2025（2） CCF高性能计算“青年科技人才”奖, , 国家级, 2024（3） 美国美国国家科学基金委杰出青年教授奖（NSF CAREER Award）, , 国家级, 2023（4） IEEE Transactions on Big Data年度最佳论文, , 其他, 2023（5） Meta研究奖, , 其他, 2022（6） R&D 100研发奖, , 其他, 2021（7） IEEE计算机协会高性能计算委员会杰出新人奖, , 其他, 2020（8） IEEE Cluster最佳论文奖, , 其他, 2018 代表论文 会议论文 [PPoPP'26] Xingchen Liu, Haoran Kong, Shengkai Lyu, Zheng Wei, Man Liu, Xingjian Tian, Liyang Zhao, Zhuohan Chen, Fakang Wang, Zizhong Chen, Zhan Wang, Guangming Tan, Dingwen Tao. \"COCCL: A Collective Communication Library Supporting Easy Integration and Configuration of Customized Compression for Scalable LLM Training.\" The 31st ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, Sydney, Australia, January 31–Feburary 4, 2026.（CCF A类）[PPoPP'26] Yida Gu, Fakang Wang, Zhenhang Sun, Qianyu Zhang, Hairui Zhao, Xingchen Liu, Yang Tian, Wenjing Huang, Zedong Liu, Yifan Chen, Jinwu Yang, Yueyuan Zhou, Qian Zhao, Haoxu Li, Tao Wang, Feng Yu, Zhan Wang, Guangming Tan, Dingwen Tao. \"CCL-D: A High-Precision Diagnostic System for Slow and Hang Anomalies in Large-Scale Model Training.\" The 31st ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, Sydney, Australia, January 31–Feburary 4, 2026.（CCF A类）[PPoPP'26] Bing Lu, Zedong Liu, Hairui Zhao, Dejun Luo, Wenjing Huang, Yida Gu, Jinyang Liu, Guangming Tan, Dingwen Tao. \"PRISM: An Efficient GPU-Based Lossy Compression Framework for Progressive Data Retrieval with Multi-Level Interpolation.\" The 31st ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, Sydney, Australia, January 31–Feburary 4, 2026.（CCF A类）[AAAI'26] Donglei Wu, Zhihong Tian, Xiao Cai, Jinda Jia, Jinglei Tan, Guangming Tan, Dingwen Tao, Wen Xia. \"RCMoE: a Communication-Efficient Random Compression Framework for Resource-Constrained Mixture-of-Experts Training.\" The Fortieth AAAI Conference on Artificial Intelligence, Singapore, Janurary 20-27, 2026.（Oral ?/23680，CCF A类）[NeurIPS'25] Zedong Liu, Shenggan Cheng, Guangming Tan, Yang You, Dingwen Tao. \"ElasticMM: Efficient Multimodal LLMs Serving with Elastic Multimodal Parallelism.\" Advances in Neural Information Processing Systems 38 (2026).（Oral 77/21575=0.357%，CCF A类）[SC'25] Wenjing Huang, Jinwu Yang, Shengquan Yin, Haoxu Li, Yida Gu, Zedong Liu, Jing Xing, Zheng Wei, Shuyuan Fu, Hao Hu, Guangming Tan, Dingwen Tao. \"MANS: Efficient and Portable ANS Encoding for Multi-Byte Integer Data on CPUs and GPUs.\" SC25: The International Conference for High Performance Computing, Networking, Storage and Analysis, St. Louis, MO, USA, November 16–21, 2025.（CCF A类）[SC'25] Franck Cappello, Robert Underwood, Yuri Alexeev, Alison Baker, Ebru Bozdağ, Martin Burtscher, Kyle Chard, Sheng Di, Kyle Gerard Felker, Paul Chrsitopher O'Grady, Hanqi Guo, Yafan Huang, Peng Jiang, Sian Jin, Petter Johansson, Shaomeng Li, Xin Liang, Erik Lindahl, Peter Lindstrom, Zarija Lukić, Magnus Lundborg, Danylo Lykov, Masaru Nagaso, Kento Sato, Amarjit Singh, Seung Woo Son, Shihui Song, William Tang,  Dingwen Tao, Jiannan Tian, Kazutomo Yoshii, Kai Zhao. \"What to Support When You’re Compressing: The State of Practice, Gaps, and Opportunities for Scientific Data Compression.\" SC25: The International Conference for High Performance Computing, Networking, Storage and Analysis, St. Louis, MO, USA, November 16–21, 2025.（CCF A类）[HPDC'25] Zheng Wei, Jing Xing, Yida Gu, Wenjing Huang, Dong Dai, Guangming Tan, Dingwen Tao. \"TSUE: A Two-Stage Data Update Method for an Erasure Coded Cluster File System.\"  The 34th ACM International Symposium on High-Performance Parallel and Distributed Computing, Notre Dame, IN, USA, July 20-23, 2025. DOI: 10.1145/3731545.3731577.（CSRankings类）[ICS'25] Yan Wang, Qinghua Guo, Haoran Kong, Kai Sheng, Hao Chen, Zhen Xie, Weile Jia, Dingwen Tao, Xin He. \"Cherry: Breaking the GPU Memory Wall for Large-Scale GNN Training via Micro-Batching.\"  The 39th ACM International Conference on Supercomputing, Salt Lake City, UT, USA, June 8–11, 2025. DOI: 10.1145/3721145.3730429.（CSRankings类）[ICS'25] Boyuan Zhang, Bo Fang, Fanjiang Ye, Luanzheng Guo, Tallent Nathan, Dingwen Tao. \"BMQSim: Overcoming Memory Constraints in Quantum Circuit Simulation with a High-Fidelity Compression Framework.\"  The 39th ACM International Conference on Supercomputing, Salt Lake City, UT, USA, June 8–11, 2025. DOI: 10.1145/3721145.3725747.（最佳论文亚军，CSRankings类）[DAC'25] Chenxi Li, Yihang Feng, Fuxing Deng, Dingwen Tao, Weifeng Liu, Zhou Jin. \"MemSens: Significantly Reducing Memory Overhead in Adjoint Sensitivity Analysis Using Novel Error-Bounded Lossy Compression.\" The 62nd Annual Design Automation Conference, San Francisco, CA, USA, June 22–25, 2025.（CCF A类）[DAC'25] Donglei Wu, Weihao Yang, Xiangyu Zou, Jinda Jia, Dingwen Tao, Wen Xia, Zhihong Tian. \"BirdMoE: Reducing Communication Costs for Mixture-of-Experts Training Using Load-Aware Bi-random Quantization.\" The 62nd Annual Design Automation Conference, San Francisco, CA, USA, June 22–25, 2025.（CCF A类）[ICDE'25] Hao Hu, Qiyang Zheng, Xiangyu Zou, Lisha Qin, Chengwei Zhang, Wanchuan Zhang, Zhaoheng Jiang, Dingwen Tao, Hongpeng Wang, Wen Xia. \"A Cost-Effective and Decompression-Transparent Compressor for OLTP-Oriented Databases.\" The 41st IEEE International Conference on Data Engineering, Hong Kong SAR, May 19–23, 2025. DOI: 10.1109/ICDE65448.2025.00037.（CCF A类）[VLDB'25] Longtao Zhang, Ruoyu Li, Congrong Ren, Sheng Di, Jinyang Liu, Jiajun Huang, Robert Underwood, Pascal Grosset, Dingwen Tao, Xin Liang, Hanqi Guo, Franck Cappello, Kai Zhao. \"LCP: Enhancing Scientific Data Management with Lossy Compression for Particles.\" Proceedings of the ACM on Management of Data, Berlin, Germany, June 22-27, 2025. DOI: 10.1145/3709700.（CCF A类）[PPoPP'25] Baixi Sun, Weijin Liu, J. Gregory Pauloski, Jiannan Tian, Jinda Jia, Daoce Wang, Mingkai Zheng, Sheng Di, Sian Jin, Zhao Zhang, Xiaodong Yu, Guangming Tan, Dingwen Tao. \"COMPSO: Optimizing Gradient Compression for Distributed Training with Second-Order Optimizers.\" The 30th ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming, Las Vegas, Nevada, March 1–March 5, 2025. DOI: 10.1145/3710848.3710852.（CCF A类）[NeurIPS'24] Jinda Jia, Cong Xie, Hanlin Lu, Daoce Wang, Hao Feng, Chengming Zhang, Baixi Sun, Haibin Lin, Zhi Zhang, Xin Liu, Dingwen Tao. \"SDP4Bit: Toward 4-bit Communication Quantization in Sharded Data Parallelism for LLM Training.\" Advances in Neural Information Processing Systems 37 (2025). DOI: 10.5555/3737916.3738195.（CCF A类）[SC'24] Hao Feng, Boyuan Zhang, Fanjiang Ye, Min Si, Ching-Hsiang Chu, Jiannan Tian, Chunxing Yin, Zhaoxia (Summer) Deng, Yuchen Hao, Pavan Balaji, Tong Geng, Dingwen Tao. \"Accelerating Communication in Deep Learning Recommendation Model Training with Dual-Level Adaptive Lossy Compression.\" SC24: The International Conference for High Performance Computing, Networking, Storage and Analysis, Atlanta, GA, USA, November 17–22, 2024. DOI: 10.1109/SC41406.2024.00095.（CCF A类）[SC'24] Daoce Wang, Pascal Grosset, Jesus Pulido, Tushar M. Athawale, Jiannan Tian, Kai Zhao, Zarija Lukic, Axel Huebl, Zhe Wang, James Ahrens, Dingwen Tao. \"A High-Quality Workflow for Multi-Resolution Scientific Data Reduction and Visualization.\" SC24: The International Conference for High Performance Computing, Networking, Storage and Analysis, Atlanta, GA, USA, November 17–22, 2024. DOI: 10.1109/SC41406.2024.00091.（CCF A类）[SC'24] Jinyang Liu, Jiannan Tian, Shixun Wu, Sheng Di, Boyuan Zhang, Robert Underwood, Yafan Huang, Jiajun Huang, Kai Zhao, Guanpeng Li, Dingwen Tao, Zizhong Chen, and Franck Cappello. \"CUSZ-i: High-Ratio Scientific Lossy Compression on GPUs with Optimized Multi-Level Interpolation.\" SC24: The International Conference for High Performance Computing, Networking, Storage and Analysis, Atlanta, GA, USA, November 17–22, 2024. DOI: 10.1109/SC41406.2024.00019.（CCF A类）[ATC'24] Zhen Xie, Murali Emani, Xiaodong Yu, Dingwen Tao, Xin He, Pengfei Su, Keren Zhou, Venkatram Vishwanath. \"Centimani: Enabling Fast AI Accelerator Selection for DNN Training with a Novel Performance Predictor.\" 2024 USENIX Annual Technical Conference, Santa Clara, CA, USA, July 10-12, 2024. DOI: 10.5555/3691992.3692065.（CCF A类）[VLDB'24] Xinyu Chen, Jiannan Tian, Ian Beaver, Cynthia Freeman, Yan Yan, Jianguo Wang, Dingwen Tao. \"FCBench: Cross-Domain Benchmarking of Lossless Compression for Floating-Point Data.\" The 50th International Conference on Very Large Data Bases, Guangzhou, China, August 25-29, 2024. DOI: 10.14778/3648160.3648180.（CCF A类）[DAC'24] Chenxi Li, Boyuan Zhang, Yonggiang Duan, Yang Li, Zuochang Ye, Weifeng Liu, Dingwen Tao, Zhou Jin. \"MASC: A Memory-",
  "content_length": 26673,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:40"
}