{
  "name": "Dinh Q. Phung",
  "homepage": "https://research.monash.edu/en/persons/dinh-phung",
  "status": "success",
  "content": "Dinh Phung - Monash University View Scopus Profile Dinh Phung Professor Professor, Department of Data Science & AI https://orcid.org/0000-0002-9977-8247 EmailDinh.Phungmonashedu 20022026 Research activity per year Personal profile BiographyProfessor Dinh Phung is Head of of the Machine Learning Group and the former Head of the Department of Data Science and AI at Monash University. His research interest includes machine learning, deep learning, generative AI, robust and trustworthy AI, optimal transport, Bayesian and graphical models. He has published 250+ papers in these areas and application domains such as natural language processing (NLP), computer vision, digital health, cybersecurity and autism. Prospective PhD students, Postdocs and Tutors: Thank you for your interest and for reaching out to me. While I'm keen on receiving strong applications and your EoI, due to the large volume of such emails, please accept my apology in advance if you do not receive a response from me individually as I might only be able to respond to short-listed or selected EoI. Please see this link for further information regarding PhD scholarship and admission at Monash. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Doctor of Philosophy, Curtin UniversityAward Date: 17 Jun 2005Computer Science, Bachelor of Science (Honours), Curtin UniversityAward Date: 3 Sept 2001 Research area keywordsMachine Learningartificial intelligencedeep learningrepresentation learningBayesian statisticsgraphical modelsgenerative AIoptimal transportrobust and adversarial machine learningNLP and computer visiondigital healthcybersecuritymedical AIautism Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2018 2018 2019 2021 2023 2029 6 Active 16 Finished Projects per year Can Machines Unlearn? : Can Machines Unlearn? Toward Next-Generation Safe Artificial IntelligencePhung, D. (Primary Chief Investigator (PCI)), Tafazzoli Harandi, M. (Chief Investigator (CI)), Le, T. (Chief Investigator (CI)), Zhang, J. (Chief Investigator (CI)) & Cai, J. (Chief Investigator (CI))ARC - Australian Research Council30/05/25 → 29/05/29Project: Research TMLGenAI: Trustworthy Generative AI: Towards Safe and Aligned Foundation ModelsPhung, D. (Primary Chief Investigator (PCI)), Vu, T. (Chief Investigator (CI)), Qu, L. (Chief Investigator (CI)), Le, T. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)), Webb, G. (Chief Investigator (CI)), Nicholson, A. (Chief Investigator (CI)), Ke, Q. (Chief Investigator (CI)), Cai, J. (Chief Investigator (CI)) & Bui, T. (Chief Investigator (CI))11/06/24 → 10/07/26Project: Research Robust Machine Learning: Data Efficient and Geometric Optimal Transport for Robust Machine LearningLe, T. (Primary Chief Investigator (PCI)), Phung, D. (Chief Investigator (CI)), Pham, T. D. (Chief Investigator (CI)), Tran, T. (Chief Investigator (CI)) & Bui, H. (Chief Investigator (CI))30/09/23 → 29/09/26Project: Research Project 44 - Generative architectural design engine Cruz Gambardella, C. (Primary Chief Investigator (PCI)), Phung, D. (Chief Investigator (CI)), McCormack, J. (Chief Investigator (CI)), Cai, J. (Chief Investigator (CI)), Murray, S. (Chief Investigator (CI)), Weiss, K.-H. (Chief Investigator (CI)), Patterson, D. (Chief Investigator (CI)), Huang, S. (Chief Investigator (CI)) & Gribble, A. (Chief Investigator (CI))1/07/23 → 30/06/26Project: Research Exploiting Geometries of Learning for Fast, Adaptive and Robust AIPhung, D. (Primary Chief Investigator (PCI)), Tafazzoli Harandi, M. (Chief Investigator (CI)), Hartley, R. I. (Chief Investigator (CI)), Le, T. (Chief Investigator (CI)) & Koniusz, P. (Partner Investigator (PI))ARC - Australian Research Council8/05/23 → 7/05/27Project: Research View all 22 projects Research output Research output per year 2002 2014 2015 2016 2017 2026 221 Conference Paper 85 Article 6 Paper 3 Foreword / Postscript 4 More 2 Editorial 1 Chapter (Book) 1 Review Article Research output per year Research output per year Hierarchical Prompt-Enhanced Image Generation Using Hyperbolic SpaceChen, S., Pan, Z., Cai, J., Fang, P., Harandi, M. & Phung, D., 2026, Neural Information Processing - 31st International Conference, ICONIP 2024 Auckland, New Zealand, December 2–6, 2024 Proceedings, Part XI. Mahmud, M., Doborjeh, M., Wong, K., Leung, A. C. S., Doborjeh, Z. & Tanveer, M. (eds.). Singapore Singapore: Springer, p. 121-136 16 p. (Communications in Computer and Information Science; vol. 2292).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 1 Citation (Scopus) Active Continual Learning: On Balancing Knowledge Retention and LearnabilityVu, T.-T., Khadivi, S., Ghorbanali, M., Phung, D. & Haffari, G., 2025, AI 2024, AI 2024: Advances in Artificial Intelligence, 37th Australasian Joint Conference on Artificial Intelligence, AI 2024 Melbourne, VIC, Australia, November 25–29, 2024 Proceedings, Part II. Gong, M., Song, Y., Koh, Y. S., Xiang, W. & Wang, D. (eds.). Singapore Singapore: Springer, p. 137-150 14 p. (Lecture Notes in Computer Science; vol. 15443).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research Fantastic Targets for Concept Erasure in Diffusion Models and Where to Find ThemBui, A. T., Vu, T., Vuong, L., Le, T., Montague, P., Abraham, T., Kim, J. & Phung, D., 2025, The International Conference on Learning Representations 2025. LeCun, Y. (ed.). Portland OR USA: OpenReview, 43 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile HVQ-VAE: Variational auto-encoder with hyperbolic vector quantizationChen, S., Fang, P., Harandi, M., Le, T., Cai, J. & Phung, D., Jul 2025, In: Computer Vision and Image Understanding. 258, 10 p., 104392.Research output: Contribution to journal › Article › Research › peer-review LLM Reading Tea Leaves: Automatically Evaluating Topic Models with Large Language ModelsYang, X., Zhao, H., Phung, D., Buntine, W. & Du, L., 17 Apr 2025, In: Transactions of the Association for Computational Linguistics. 13, p. 357-375 19 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) View all 319 research outputs Activities Activities per year 2023 2023 2023 1 Membership of an advisory panel/policy group/ board Activities per year Victorian Parliamentary Library (External organisation)Batstone, J. (Member) & Phung, D. (Contributor)19 Oct 2023Activity: Industry, Government and Philanthropy Engagement and Partnerships › Membership of an advisory panel/policy group/ board",
  "content_length": 7225,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:41"
}