{
  "name": "Dino Sejdinovic",
  "homepage": "https://researchers.adelaide.edu.au/profile/dino.sejdinovic",
  "status": "success",
  "content": "Professor Dino Sejdinovic | Researcher Profiles Skip to main content × Search Researcher Profiles Return to search Login Professor Dino Sejdinovic Professor School of Computer and Mathematical Sciences Faculty of Sciences, Engineering and Technology Eligible to supervise Masters and PhD - email supervisor to discuss availability. Dino Sejdinovic is a Professor at the School of Computer and Mathematical Sciences, University of Adelaide. He was previously a Lecturer and an Associate Professor at the Department of Statistics, University of Oxford (2014-2022). He held postdoctoral positions at the Gatsby Computational Neuroscience Unit, University College London (2011-2014) and at the Institute for Statistical Science, University of Bristol (2009-2011). He received a PhD in Electrical and Electronic Engineering from the University of Bristol (2009) and a Diplom in Mathematics and Theoretical Computer Science from the University of Sarajevo (2006). My Research Career Publications Supervision Contact My research spans a variety of topics at the interface between statistical methodology and machine learning, including: Large-scale nonparametric and kernel methods, Robust and trustworthy machine learning, Multiresolution data and data fusion, Measures of dependence and multivariate interaction. Expand All Appointments Date Position Institution name 2022 - ongoing Professor University of Adelaide 2016 - 2022 Associate Professor University of Oxford 2014 - 2016 Lecturer University of Oxford 2011 - 2014 Postdoctoral Fellow University College London 2009 - 2011 Brunel Postdoctoral Fellow University of Bristol Education Date Institution name Country Title 2009 University of Bristol United Kingdom PhD 2006 University of Sarajevo Bosnia and Herzegovina Dipl.Math.-Inf. Research Interests Machine learning Statistical data science Computational statistics Artificial Intelligence Expand All Journals Year Citation 2025 Dan, S., Ling, Z., Chen, Y., Tegegne, J., Jaeger, V. K., Karch, A., . . . Bhatt, S. (2025). Addressing survey fatigue bias in longitudinal social contact studies to improve pandemic preparedness. Scientific Reports, 15(1), 17935. DOI 2025 Matabuena, M., Vidal, J. C., Padilla, O. H. M., & Sejdinovic, D. (2025). Kernel biclustering algorithm in Hilbert spaces. Advances in Data Analysis and Classification, 42 pages. DOI 2024 Bouabid, S., Watson-Parris, D., Stefanović, S., Nenes, A., & Sejdinovic, D. (2024). Aerosol optical depth disaggregation: toward global aerosol vertical profiles. Environmental Data Science, 3, e16-1-e16-33. DOI 2024 Severin, B., Lennon, D. T., Camenzind, L. C., Vigneau, F., Fedele, F., Jirovec, D., . . . Ares, N. (2024). Cross-architecture tuning of silicon and SiGe-based quantum devices using machine learning. Scientific Reports, 14(1), 17281. DOI Scopus3 Europe PMC2 2024 Lenhardt, J., Quaas, J., & Sejdinovic, D. (2024). Marine cloud base height retrieval from MODIS cloud properties using machine learning. ATMOSPHERIC MEASUREMENT TECHNIQUES, 17(18), 5655-5677. DOI 2024 Hu, R., Sejdinovic, D., & Evans, R. J. (2024). A Kernel Test for Causal Association via Noise Contrastive Backdoor Adjustment. Journal of Machine Learning Research, 25, 160-1-160-56. 2024 Craig, D. L., Moon, H., Fedele, F., Lennon, D. T., Van Straaten, B., Vigneau, F., . . . Ares, N. (2024). Bridging the Reality Gap in Quantum Devices with Physics-Aware Machine Learning. Physical Review X, 14(1). DOI Scopus5 2024 Bouabid, S., Sejdinovic, D., & Watson-Parris, D. (2024). FaIRGP: A Bayesian Energy Balance Model for Surface Temperatures Emulation. JOURNAL OF ADVANCES IN MODELING EARTH SYSTEMS, 16(6), 53 pages. DOI Scopus6 WoS6 2023 Perez-Suay, A., Gordaliza, P., Loubes, J. -M., Sejdinovic, D., & Camps-Valls, G. (2023). Fair Kernel Regression through Cross-Covariance Operators. Transactions on Machine Learning Research, 2023. Scopus2 2023 Hu, R., & Sejdinovic, D. (2023). Towards Deep Interpretable Features. Journal of Computational Mathematics and Data Science, 6, 100067. DOI Scopus2 2023 Chau, S. L., Cucuringu, M., & Sejdinovic, D. (2023). Spectral Ranking with Covariates. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 13717 LNAI, 70-86. DOI Scopus4 WoS3 2023 Li, Z., Su, W. J., & Sejdinovic, D. (2023). Benign Overfitting and Noisy Features. Journal of the American Statistical Association, 118(544), 2876-2888. DOI Scopus6 WoS6 2023 Schuff, J., Lennon, D. T., Geyer, S., Craig, D. L., Fedele, F., Vigneau, F., . . . Ares, N. (2023). Identifying Pauli spin blockade using deep learning. Quantum, 7, 1077. DOI Scopus2 WoS2 2022 Wild, V. D., Hu, R., & Sejdinovic, D. (2022). Generalized Variational Inference in Function Spaces: Gaussian Measures meet Bayesian Deep Learning. Advances in Neural Information Processing Systems, 35. Scopus13 2022 Hu, R., Chau, S. L., Sejdinovic, D., & Glaunès, J. A. (2022). Giga-scale Kernel Matrix-Vector Multiplication on GPU. Advances in Neural Information Processing Systems, 35. Scopus1 2022 Schrab, A., Jitkrittum, W., Szabo, Z., Sejdinovic, D., & Gretton, A. (2022). Discussion of 'Multi-scale Fisher's independence test for multivariate dependence'. BIOMETRIKA, 109(3), 597-603. DOI Scopus1 2022 Hu, R., Chau, S. L., Huertas, J. F., & Sejdinovic, D. (2022). Explaining Preferences with Shapley Values. Advances in Neural Information Processing Systems, 35. Scopus9 2022 Chau, S. L., Hu, R., Gonzalez, J., & Sejdinovic, D. (2022). RKHS-SHAP: Shapley Values for Kernel Methods. Advances in Neural Information Processing Systems, 35. Scopus19 2022 Bouabid, S., Watson-Parris, D., Stefanović, S., Nenes, A., & Sejdinovic, D. (2022). AODisaggregation: toward global aerosol vertical profiles. 2022 Li, Z., Pérez-Suay, A., Camps-Valls, G., & Sejdinovic, D. (2022). Kernel dependence regularizers and Gaussian processes with applications to algorithmic fairness. Pattern Recognition, 132, 108922. DOI Scopus5 WoS2 2022 Zhang, Q., Wild, V., Filippi, S., Flaxman, S., & Sejdinovic, D. (2022). Bayesian Kernel Two-Sample Testing. Journal of Computational and Graphical Statistics, 31(4), 1164-1176. DOI Scopus3 WoS12 2022 Hu, R., Nicholls, G. K., & Sejdinovic, D. (2022). Large scale tensor regression using kernels and variational inference. Machine Learning, 111(7), 2663-2713. DOI Scopus2 WoS1 2022 Cortés-Andrés, J., Camps-Valls, G., Sippel, S., Székely, E., Sejdinovic, D., Diaz, E., . . . Reichstein, M. (2022). Physics-aware nonparametric regression models for Earth data analysis. Environmental Research Letters, 17(5), 054034. DOI Scopus12 WoS11 2022 Fawkes, J., Evans, R. J., & Sejdinovic, D. (2022). Selection, Ignorability and Challenges with Causal Fairness. Proceedings of Machine Learning Research, 177, 275-289. Scopus6 2022 Chau, S. L., Gonzalez, J., & Sejdinovic, D. (2022). Learning Inconsistent Preferences with Gaussian Processes. INTERNATIONAL CONFERENCE ON ARTIFICIAL INTELLIGENCE AND STATISTICS, VOL 151, 151, 16 pages. Scopus5 WoS1 2022 Martinez-Taboada, D., & Sejdinovic, D. (2022). Sequential Decision Making on Unmatched Data using Bayesian Kernel Embeddings. 2022 Martinez-Taboada, D., & Sejdinovic, D. (2022). Bayesian Counterfactual Mean Embeddings and Off-Policy Evaluation. 2022 Matabuena, M., Vidal, J. C., Padilla, O. H. M., & Sejdinovic, D. (2022). Kernel Biclustering algorithm in Hilbert Spaces. 2021 Zhu, H., Howes, A., Eer, O. V., Rischard, M., Li, Y., Sejdinovic, D., & Flaxman, S. (2021). Aggregated Gaussian Processes with Multiresolution Earth Observation Covariates. 2021 Craig, D. L., Moon, H., Fedele, F., Lennon, D. T., Straaten, B. V., Vigneau, F., . . . Ares, N. (2021). Bridging the reality gap in quantum devices with physics-aware machine learning. 2021 Severin, B., Lennon, D. T., Camenzind, L. C., Vigneau, F., Fedele, F., Jirovec, D., . . . Ares, N. (2021). Cross-architecture Tuning of Silicon and SiGe-based Quantum Devices Using Machine Learning. 2021 Wild, V., Kanagawa, M., & Sejdinovic, D. (2021). Connections and Equivalences between the Nyström Method and Sparse Variational Gaussian Processes. 2021 Rindt, D., Sejdinovic, D., & Steinsaltz, D. (2021). Consistency of permutation tests of independence using distance covariance, HSIC and dHSIC. Stat, 10(1), 10 pages. DOI Scopus6 WoS6 2021 Bradley, V. C., Kuriwaki, S., Isakov, M., Sejdinovic, D., Meng, X. L., & Flaxman, S. (2021). Unrepresentative big surveys significantly overestimated US vaccine uptake. Nature, 600(7890), 695-700. DOI Scopus175 WoS161 Europe PMC113 2021 Fernández, T., Gretton, A., Rindt, D., & Sejdinovic, D. (2021). A Kernel Log-Rank Test of Independence for Right-Censored Data. Journal of the American Statistical Association, 118(542), 1-12. DOI Scopus4 WoS4 2021 Nguyen, V., Orbell, S. B., Lennon, D. T., Moon, H., Vigneau, F., Camenzind, L. C., . . . Ares, N. (2021). Deep reinforcement learning for efficient measurement of quantum devices. npj Quantum Information, 7(1), 9 pages. DOI Scopus30 WoS31 2021 Li, Z., Ton, J. F., Oglic, D., & Sejdinovic, D. (2021). Towards a unified analysis of random fourier features. Journal of Machine Learning Research, 22(1), 4887-4937. Scopus46 WoS32 2021 Pu, X., Chau, S. L., Dong, X., & Sejdinovic, D. (2021). Kernel-Based Graph Learning from Smooth Signals: A Functional Viewpoint. IEEE Transactions on Signal and Information Processing over Networks, 7, 192-207. DOI Scopus20 WoS18 2021 Blair, G. S., Bassett, R., Bastin, L., Beevers, L., Borrajo, M. I., Brown, M., . . . Watkins, J. (2021). The Role of Digital Technologies in Responding to the Grand Challenges of the Natural Environment: The Windermere Accord. Patterns, 2(1), 100156. DOI Scopus6 WoS7 2021 Rindt, D., Sejdinovic, D., & Steinsaltz, D. (2021). A kernel- And optimal transport- based test of independence between covariates and right-censored lifetimes. International Journal of Biostatistics, 17(2), 331-348. DOI Scopus3 WoS3 Europe PMC1 2020 Van Esbroeck, N. M., Lennon, D. T.,",
  "content_length": 35952,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:42"
}