{
  "name": "Dinusha Vatsalan",
  "homepage": "https://researchers.mq.edu.au/en/persons/dinusha-vatsalan",
  "status": "success",
  "content": "Dinusha Vatsalan - Macquarie University View Scopus Profile Dinusha Vatsalan Dr Honorary Senior Lecturer, School of ComputingFuture Communications Research Centre https://orcid.org/0000-0001-6713-7667 Phone+61 2 9850 9541Emaildinusha.vatsalanmq.eduau h-index 1130 Citations 16 h-index Calculated based on number of publications stored in Pure and citations from Scopus 20142025 Research activity per year Personal profile BiographyDr Dinusha Vatsalan joined the School of Computing at Macquarie University in May 2022 as a Senior Lecturer in Cyber Security. Dinusha received her PhD in Computer Science from Australian NationalUniversity and BSc (Hons) from University of Colombo, Sri Lanka. She wasa Research Scientist at Data61, CSIRO.Her research interests include privacy-preserving technologies forrecord linkage, data mining, machine learning, data sharing, and dataanalytics, privacy attacks and defences, and privacy riskquantification. Dinusha has authored over 60 scientific articles inthese research topics, and received several awards and grants, includingthe Australian government’s prestigious Endeavour Postgraduate Research Award, Ruby Payne-Scott Award (CSIRO), Women in Science Career Award (CSIRO), Data61 Research Plus PhD Scholarships, Australia-Germany Joint Research Cooperation Scheme, and National best e-Content Award (Sri Lanka).Research interestsPrivacy-preserving record linkagePrivacy-preserving data sharing and analyticsPrivacy-preserving machine learningPrivacy attacks and defenses Privacy risk quantification Education/Academic qualificationComputer Science, PhD, PhD in Computer Science, Australian National University27 Jan 2011 → 23 Oct 2014Award Date: 16 Dec 2014Information and Communication Technology, BSc (Hons), BSc (Hons) in Information and Communication Technology, University of Colombo School of Computing10 May 2005 → 30 Jun 2009Award Date: 15 Sept 2009 Fingerprint Dive into the research topics where Dinusha Vatsalan is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Privacy Preserving Computer Science 100% Record Linkage Computer Science 95% Bloom Filter Computer Science 24% Sensitive Informations Computer Science 13% Big Data Computer Science 9% Differential Privacy Computer Science 9% Cyber Physical Systems Computer Science 9% Adversarial Machine Learning Computer Science 8% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research Outputs Research output per year 2014 2015 2016 2018 2020 2021 2023 2025 20 Conference proceeding contribution 18 Article 4 Chapter 1 Review article 1 More 1 Other contribution Research output per year Research output per year On adversarial training with incorrect labelsZhao, B. Z. H., Lu, J., Zhou, X., Vatsalan, D., Ikram, M. & Kaafar, M. A., 2025, Web Information Systems Engineering – WISE 2024: 25th International Conference, Doha, Qatar, December 2–5, 2024, proceedings, part IV. Barhamgi, M., Wang, H. & Wang, X. (eds.). Singapore: Springer, Springer Nature, p. 116-132 17 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Adversarial Machine Learning 100% Learning System 100% Data Augmentation 100% Resistance Training 100% Machine Learning 100% Privacy-preserving deep learning based record linkageRanbaduge, T., Vatsalan, D. & Ding, M., Nov 2024, In: IEEE Transactions on Knowledge and Data Engineering. 36, 11, p. 6839-6850 12 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Privacy Preserving 100% Deep Learning Method 100% Record Linkage 100% Deep Learning Model 66% Privacy Protection 66% 4 Citations (Scopus) 46 Downloads (Pure) Privacy preserving release of mobile sensor dataMasood, R., Cheng, W. Y., Vatsalan, D., Mishra, D., Asghar, H. J. & Kaafar, D., 2024, ARES '24: proceedings of the 19th International Conference on Availability, Reliability and Security. New York: Association for Computing Machinery, 13 p. 5Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Privacy Preserving 100% Mobile Sensor 100% Proposed Mechanism 100% Mean Absolute Error 100% Service Provider 50% Trusted data sharing for mineral exploration and mining tenementsDing, M., Vatsalan, D., Gonzalez-Alvarez, I., M'rabet, S., Tyler, P. & Klump, J., Dec 2024, In: Journal of Geochemical Exploration. 267, p. 1-13 13 p., 107580.Research output: Contribution to journal › Article › peer-review Open AccessFile Data Sharing 100% Data Confidentiality 100% Obfuscation 66% Informed Decision 33% Confidential Information 33% 2 Citations (Scopus) 36 Downloads (Pure) Discussion submission to the 2023-2030 Australian Cyber Security StrategyMacquarie University Cyber Security Hub, Kaafar, D., Selvadurai, N., Abedin, B., Vatsalan, D., Asghar, H., Ikram, M., Zhao, B. & Chen, M., 2023, 13 p.Research output: Other contribution View all 44 research outputs Prizes Co-investigator for the project Advancing data integration: Privacy and semantics for record linkageVatsalan, D. (Recipient), 2015Prize Early Career Researcher Travel AwardVatsalan, D. (Recipient), 2016Prize Endeavour Postgraduate Research AwardVatsalan, D. (Recipient), 2011Prize Investigator - Google Summer of CodeVatsalan, D. (Recipient), 2016Prize Medical Data 100% Manthan Award South AsiaVatsalan, D. (Recipient), 2009Prize: Honorary award View all 11 prizes",
  "content_length": 5787,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:42"
}