{
  "name": "Diogo Barradas",
  "homepage": "https://cs.uwaterloo.ca/~dbarrada",
  "status": "success",
  "content": "Home | Diogo Barradas Diogo Barradas Assistant Professor Contacts: Office: DC 2631 Cheriton School of Computer Science University of Waterloo 200 University Avenue West Waterloo, ON Canada, N2L 3G1 E-mail: diogo (dot) barradas (at) uwaterloo (dot) ca Profiles: Google Scholar, GitHub, DBLP, ORCID, LinkedIn Bio As of 2022, I am an Assistant Professor at the Cheriton School of Computer Science at the University of Waterloo, and a member of the CrySP group. In March 2024, I became the Interim Associate Director of the Waterloo Cybersecurity and Privacy Institute (CPI), and am officially serving as Associate Director for the Institute since January 2025. My track record counts with over 30 peer-reviewed publications, several of which included in top venues for computer and communications security (IEEE S&P, ACM CCS, USENIX Security, NDSS), as well as other venues such as PETS, the world's premier forum dedicated to computer privacy. I am honored to have received a 2025 FOCI Rising Star Award for my continued work in the field of internet freedom. Previously, I completed my PhD on Information Systems and Computer Engineering at Instituto Superior Técnico (IST) - Universidade de Lisboa, under the kind supervision of Prof. Luís Rodrigues and Prof. Nuno Santos. During this time, I conducted my research at the Distributed Systems Group at INESC-ID Lisboa but also had the chance to undertake a research internship at Carnegie Mellon University under the supervision of Prof. Nicolas Christin. In late 2021, I was fortunate enough to become a post-doc at Rice University under the supervision of Prof. Ang Chen. My Curriculum Vitae can be found in this link. Research interests: My research is focused in network security and privacy, with particular emphasis on statistical traffic analysis and Internet censorship circumvention. I take additional interest in digital forensics. Selected Publications Check this page for the full list, including pre-prints. [NDSS 2026] Huma: Censorship Circumvention via Web Protocol Tunneling with Deferred Traffic Replacement. Sina Kamali, Diogo Barradas. (To appear) [ARES 2025] On the Feasibility of Fingerprinting Collaborative Robot Network Traffic. Cheng Tang, Diogo Barradas, Urs Hengartner, Yue Hu. Best Research Paper Award [PoPETs 2025] SoK: The Spectre of Surveillance and Censorship in Future Internet Architectures. Michael Wrana, Diogo Barradas, N. Asokan. [IEEE S&P 2025] Anix: Anonymous Blackout-Resistant Microblogging with Message Endorsing. Sina Kamali, Diogo Barradas. [USENIX Security 2024] SpotProxy: Rediscovering the Cloud for Censorship Circumvention. Patrick Kon, Sina Kamali, Jinyu Pei, Diogo Barradas, Ang Chen, Micah Sherr, Moti Yung. [NDSS 2024] Flow Correlation Attacks on Tor Onion Service Sessions with Sliding Subset Sum. Daniela Lopes, Jin-Dong Dong, Daniel Castro, Pedro Medeiros, Diogo Barradas, Bernardo Portela, João Vinagre, Bernardo Ferreira, Nicolas Christin, Nuno Santos. Supervision Current Students: Alim Dhanani - MMath @ U. Waterloo Gurjot Singh - MMath @ U. Waterloo Hesam Sarkhosh - MMath @ U. Waterloo Ross Evans - CS PhD @ U. Waterloo Michael Wrana (co-advisor: N. Asokan) - CS PhD @ U. Waterloo Current Post-doc: Uzma Maroof (co-advisor: N. Asokan) @ U. Waterloo Past Students: Sina Kamali - MMath @ U. Waterloo (Aug. 2025) Shreya Arun Naik - MMath @ U. Waterloo (Jul. 2024) Adrian Cruzat La Rosa - MMath @ U. Waterloo (Jan. 2024) Prabhjot Singh - MMath @ U. Waterloo (Jan. 2024) Norhan Abbas (co-advisor: Mei Nagappan) - MMath @ U. Waterloo (Sep. 2023) Afonso Carvalho (co-advisor: Nuno Santos) - MSc. @ U. Lisbon (Nov. 2022) Francisco Silva (co-advisor: Nuno Santos) - MSc. @ U. Lisbon (Nov. 2022) José Brás (co-advisor: Nuno Santos) - MSc. @ U. Lisbon (Nov. 2022) Teaching CS459/698 - Privacy, Cryptography, Network and Data Security (Spring ‘24, Winter ‘25, Spring ‘25) CS798 - Digital Forensics and Incident Response (Winter ‘24, Winter ‘25) CS458/658 - Computer Security and Privacy (Spring ‘22, Spring ‘23) CS858 - Internet Censorship and Surveillance (Winter ‘22, Winter ‘23) Service Program committee: TheWebConf 2026, FOCI 2026, PETS 2026 (vice-chair), SBSeg 2025, FOCI 2025, IEEE S&P 2025, PETS 2025 (vice-chair), CCS 2024, FOCI 2024, TheWebConf 2024, CCS 2023, PETS 2023, RAID 2023, NSS 2023, MetaCom 2023, FOCI 2023, IEEE DSC 2022, PETS 2022, ICICS 2022, SECRYPT 2022, PETS 2021, ICICS 2021, SECRYPT 2021 Program co-chair: FFSPIN @ SIGCOMM 2022, CPI GradConf 2025 Shadow program committee: IEEE S&P 2021 Funding Thanks(!) to: OTF, NCC, NSERC-RGPIN, DnD IDEaS",
  "content_length": 4570,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:43"
}