{
  "name": "Diogo R. Ferreira",
  "homepage": "http://web.tecnico.ulisboa.pt/diogo.ferreira",
  "status": "success",
  "content": "Diogo R. Ferreira | Instituto Superior Técnico (ULisboa) Diogo R. Ferreira Associate Professor of Information Systems at IST, University of Lisbon Researcher at IPFN (Institute for Plasmas and Nuclear Fusion) Google Scholar ORCID GitHub Kaggle LinkedIn Twitter Medium Contacts Address: Instituto Superior Técnico Campus do Taguspark Avenida Prof. Dr. Cavaco Silva 2744-016 Porto Salvo Portugal Phone: +351 21 423 35 52 Office: 2-N1.19 (ext.5152) E-mail: Teaching 2023-2024 | Data Administration in Information Systems (IST, MEIC/MECD/METI) 2023-2024 | Data Analysis and Integration (IST, MEIC/MECD) 2022-2023 | Data Administration in Information Systems (IST, MEIC/MECD/METI) 2022-2023 | Data Analysis and Integration (IST, MEIC/MECD) 2021-2022 | Data Administration in Information Systems (IST, MEIC/MECD/METI) 2021-2022 | Data Analysis and Integration (IST, MEIC/MECD) 2020-2021 | Information Systems and Databases (IST, LEGI) 2020-2021 | Data Analysis and Integration (IST, MEIC/MECD) 2018-2019 | Data Administration in Information Systems (IST, MEIC/MERC) 2018-2019 | Data Analysis and Integration (IST, MEIC) 2017-2018 | Data Administration in Information Systems (IST, MEIC/MERC) 2017-2018 | Data Analysis and Integration (IST, MEIC) 2016-2017 | Data Analysis and Integration (IST, MEIC) 2016-2017 | Information Systems and Databases (IST, MEEC/MEBiom) 2016-2017 | Process Management Systems (IST, DEIC) 2015-2016 | Data Analysis and Integration (IST, MEIC) 2015-2016 | Information Systems and Databases (IST, MEEC/MEBiom) 2015-2016 | Process Management Systems (IST, DEIC) 2014-2015 | Information Systems and Databases (IST, LEGI) 2014-2015 | Enterprise Systems Integration (IST, MEIC-T) 2014-2015 | Process Management Systems (IST, DEIC) 2014-2015 | Information Systems and Databases (IST, MEEC/MEBiom) 2014-2015 | Information Management and Processing (IST, MEIC) 2013-2014 | Information Systems and Databases (IST, LEGI) 2013-2014 | Enterprise Systems Integration (IST, MEIC-T) 2013-2014 | Process Management Systems (IST, DEIC) 2013-2014 | Information Systems and Databases (IST, MEEC/MEBiom) 2013-2014 | Databases (IST, LEIC-T/LERC) 2011-2012 | Enterprise Systems Integration (IST, MEIC-T/MERC) 2011-2012 | Process Management Systems (IST, DEIC) 2011-2012 | Databases (IST, LEIC-T/LERC) 2011-2012 | Workshop Masters IS 2011 (workshop for beginning MSc students) 2010-2011 | Enterprise Systems Integration (IST, MEIC-T/MERC) 2010-2011 | Databases (IST, LEIC-A) 2010-2011 | Workshop Masters IS 2010 (workshop for beginning MSc students) 2009-2010 | Enterprise Systems Integration (IST, MEIC-T/MERC) 2009-2010 | Process Management Systems (IST, DEIC) 2009-2010 | Databases (IST, LEIC-A) 2009-2010 | Workshop Masters IS 2009 (workshop for beginning MSc students) 2008-2009 | Process Management Systems (IST, DEIC) 2008-2009 | Enterprise Systems Integration (IST, MEIC-T/MERC) 2008-2009 | Databases / Information Systems and Databases (IST, LEIC-A/MEEC/MEBiom) 2008-2009 | Workshop Masters IS 2008 (workshop for beginning MSc students) 2007-2008 | Enterprise Systems Integration (IST, MEIC-T/MERC) 2007-2008 | Business Intelligence (IST, POSI) 2007-2008 | Information Systems Integration (IST, POSI) 2007-2008 | Information Systems and Databases (IST, MEEC/MEBiom) 2007-2008 | Databases (IST, LEIC-A) 2006-2007 | Enterprise Systems Integration (IST, LEIC-T) 2006-2007 | Databases (IST, LEIC-A/LEEC/LCI) 2005-2006 | Algorithms and Data Structures (IST, LEIC-T/LERCI) 2005-2006 | Information Systems Analysis I (FEUP, LCI) 2005-2006 | Fundamentals of Programming (FEUP, LEIC) 2005-2006 | Information Systems Integration (FEUP, ProDEI) 2005-2006 | Programming (FEUP, LEEC) 2004-2005 | Algorithms and Data Structures (FEUP, LEEC) 2004-2005 | Information Systems Analysis II (FEUP, LCI) 2004-2005 | Programming II (FEUP, LEIC) 2004-2005 | Information Systems Analysis I (FEUP, LCI) 2004-2005 | Programming (FEUP, LEEC) 2004-2005 | Management Information Systems (FEUP, LEIC/LEEC/MEEC) 2003-2004 | Algorithms and Data Structures (FEUP, LEEC) 2003-2004 | Electromagnetics (FEUP, LEIC) 2003-2004 | Programming II (FEUP, LEIC) 2003-2004 | Information Systems Analysis I (FEUP, LCI) 2003-2004 | Programming (FEUP, LEEC) 2003-2004 | Management Information Systems (FEUP, LEIC) Research areas Data Science, Applied Machine Learning, Deep Learning Information Systems, Workflow Management, Process Mining Nuclear Fusion, Plasma Diagnostics, Plasma Physics Publications 2025 Using deep learning to design high aspect ratio fusion devices [BibTeX] Pedro Curvo, Diogo R. Ferreira, Rogério Jorge Journal of Plasma Physics, vol. 91, no. 1, 2025 Development of high-current baseline scenario for high deuterium-tritium fusion performance at JET [BibTeX] L. Garzotti, D. Frigione, P. Lomas, F. Rimini, D. Van Eester, S. Aleiferis, E. Alessi, F. Auriemma, I. S. Carvalho, P. Carvalho, A. Chomiczewska, E. De La Luna, D. R. Ferreira, A. Field, M. Fontana, L. Frassinetti, S. Gabriellini, Z. Ghani, E. Giovannozzi, C. Giroud, W. Gromelski, I. Ivanova-Stanik, V. Kiptily, K. Kirov, M. Lennholm, C. Lowry, C. F. Maggi, J. Mailloux, S. Menmuir, R. B. Morales, S. Nowak, V. Parail, A. Patel, A. Pau, C. Perez von Thun, L. Piron, G. Pucella, C. Reux, O. Sauter, E. R. Solano, C. Sozzi, Z. Stancar, C. Stuart, H. Sun, G. Telesca, D. Tskhakaya, M. Valovic, N. Wendler, V. K. Zotta, and JET Contributors Plasma Physics and Controlled Fusion, vol. 67, no. 7, 2025 Searching for the Poetic Imagery of Cesário Verde [BibTeX] Isabel F. Sargento, Diogo R. Ferreira The Materiality of Modernisms, European Modernism Studies, vol. 12, pp. 295-321, Ledizioni, 2025 2024 Learning the dynamics of a one-dimensional plasma model with graph neural networks [BibTeX] Diogo D. Carvalho, Diogo R. Ferreira, Luis O. Silva Machine Learning: Science and Technology, vol. 5, no. 2, 2004 High temporal resolution of pedestal dynamics via machine learning on density diagnostics [BibTeX] Diogo R. Ferreira, Andreas Gillgren, Andrei Ludvig-Osipov, Pär Strand, and JET Contributors Plasma Physics and Controlled Fusion, vol. 66, no. 2, 2024 Machine Learning for Chemistry Reduction in N2-H2 Low-Temperature Plasmas [BibTeX] Diogo R. Ferreira, Alexandre Lança, Luís Lemos Alves Machine Learning for Chemistry and Chemical Engineering (ML4CCE), ECML 2024 Workshop, 2004 2023 Learning the Dynamics of a 1D Plasma Electrostatic Sheet Model with Graph Neural Networks Diogo D. Carvalho, Diogo R. Ferreira, Luis O. Silva 65th Annual Meeting of the APS Division of Plasma Physics (APS-DPP 2023), Denver, Colorado, USA, October 30-November 3, 2023 Improving the time resolution of Thomson scattering via machine learning on reflectometry data [Slides] [BibTeX] Diogo R. Ferreira, Andreas Gillgren, Andrei Ludvig-Osipov, Pär Strand, and JET Contributors 5th European Conference on Plasma Diagnostics (ECPD 2023), Rethymno, Greece, April 23-27, 2023 Studying pedestal dynamics using high-temporal-resolution density profiles predicted via machine learning [Poster] [BibTeX] Andreas Gillgren, Diogo R. Ferreira, Andrei Ludvig-Osipov, Pär Strand, and JET Contributors 49th European Conference on Plasma Physics (EPS 2023), Bordeaux, France, July 3-7, 2023 Graph Neural Networks for Kinetic Simulations of a 1D Plasma Sheet Model [Poster] [BibTeX] Diogo D. Carvalho, Diogo R. Ferreira, Luís O. Silva 49th European Conference on Plasma Physics (EPS 2023), Bordeaux, France, July 3-7, 2023 Radiation control in deuterium, tritium and deuterium-tritium JET baseline plasmas - part I [BibTeX] L. Piron, D. Van Eester, D. Frigione, L. Garzotti, P.J. Lomas, M. Lennholm, F. Rimini, F. Auriemma, M. Baruzzo, P.J. Carvalho, D.R. Ferreira, A.R. Field, K. Kirov, Z. Stancar, C.I. Stuart, D. Valcarcel, and JET Contributors Fusion Engineering and Design, vol. 193, August 2023 Radiation control in deuterium, tritium and deuterium-tritium JET baseline plasmas - part II [BibTeX] L. Piron, D. Van Eester, D. Frigione, L. Garzotti, P.J. Lomas, M. Lennholm, F. Rimini, F. Auriemma, M. Baruzzo, P.J. Carvalho, D.R. Ferreira, A.R. Field, K. Kirov, Z. Stancar, C.I. Stuart, D. Valcarcel, and JET Contributors Fusion Engineering and Design, vol. 192, July 2023 A Conversation with ChatGPT about Ezra Pound [Slides] Diogo R. Ferreira Modernism Remodelled: A Transdisciplinary Conference, Cambridge University, February 2023 2022 Automated Search for the Poetic Imagery of Cesário Verde [Slides] Diogo R. Ferreira, Isabel Sargento Third International CEMS Conference: The Materiality of Modernisms (CEMS 2022), Lisbon, December 2022 Explainable Deep Learning for the Analysis of MHD Spectrograms in Nuclear Fusion [BibTeX] Diogo R. Ferreira, Tiago A. Martins, Paulo Rodrigues Machine Learning: Science and Technology, vol. 3, no. 1, March 2022 Investigating the physics of disruptions with real-time tomography at JET [BibTeX] [Cover story] Diogo R. Ferreira, Pedro J. Carvalho, Ivo S. Carvalho, Chris I. Stuart, Peter J. Lomas Plasma Science and Technology, vol. 24, no. 3, March 2022 2021 Using HPC infrastructures for deep learning applications in fusion research [BibTeX] Diogo R. Ferreira, and JET Contributors Plasma Physics and Controlled Fusion, vol. 63, no. 8, 2021 Predicting locked-mode disruptions with explainable deep learning on MHD spectrograms [Slides] Diogo R. Ferreira, Tiago A. Martins, Paulo Rodrigues, and JET Contributors 4th IAEA Technical Meeting on Fusion Data Processing, Validation and Analysis, December 2021 Monitoring the plasma radiation profile with real-time bolometer tomography at JET [BibTeX] Diogo R. Ferreira, Pedro J. Carvalho, Ivo S. Carvalho, Chris Stuart, Peter J. Lomas, and JET Contributors Fusion Engineering and Design, vol. 164, March 2021 A brief comment on the numerical results in 'Electrostatic potential of a uniformly charged triangle in barycentric coordinates' [BibTeX] Diogo R. Ferreira European Journal of Physics, vol. 42, no. 6, November 2021 Onset of tearing modes in plasma termination on JET: the role of temperature ",
  "content_length": 38895,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:44"
}