{
  "name": "Diomidis D. Spinellis",
  "homepage": "https://www.dmst.aueb.gr/dds",
  "status": "success",
  "content": "Diomidis Spinellis home page Diomidis Spinellis Diomidis Spinellis Diomidis Spinellis home page Search English ÎÎ»Î»Î·Î½Î¹ÎºÎ¬ English ÎÎ»Î»Î·Î½Î¹ÎºÎ¬ Search ÎÎ½Î±Î¶Î®ÏÎ·ÏÎ· Close ÎÎ»ÎµÎ¯ÏÎ¹Î¼Î¿ Diomidis Spinellis, Professor of Software Engineering in the Department of Management Science and Technology of the Athens University of Economics and Business, Professor of Software Analytics in the Department of Software Technology of the Delft University of Technology, and director of the Business Analytics Laboratory (BALab), welcomes you to his home page. This site contains about 14,000 pages linked by more than 98,000 hyperlinks; enjoy! Teaching and research mentoring Lecture notes (mostly in Greek) Lecture notes in English (small subset of the above) Research topics for students Advice for writing LaTeX documents Reading list for PhD students More material for budding researchers (in Greek) My personal book and paper library Software and data Open source software My GitHub page and its atom feed Popular: ai-cli-lib AI help for all CLI programs, Alexandria3k fast processing of open bibliographic data, CScout C refactoring browser, dgsh directed graph Unix shell, Unix history on GitHub, ckjm Chidamber and Kemerer Java metrics, git-issue Git-based issue tracker. Contributions to open source software projects Open Science data sets Biographical info Curriculum vitae (PDF) Conference programme committee member Funded research projects PhD students and their achievements On LinkedIn Member of ... Contact Contact information Office hours Frequently asked questions Frequently asked questions on academic matters (in Greek) Information for Athens visitors Web site mirror at AUEB Personal web site mirror Publications Complete list Selected Bibliometric data In BibTeX format Preprints on arXiv On Google Scholar On ACM Portal On ORCiD On ReseacherID On Scopus On Microsoft Academic On dblp On IEEE Xplore On Web of Science / publons Social web My blog and its RSS feed Follow @CoolSWEng.bsky.social Professional and technology-related topics (in English) Follow @DSpinellis.bsky.social Greece-related topics (in Greek) Follow @CoolSWEng@mastodon.acm.org Professional and technology-related topics (in English) Follow @DSpinellis@mstdn.social Greece-related topics (in Greek) Follow @DSpinellis Greece-related topics (in Greek) Facebook profile YouTube channel GitHub repositories On Stack Overflow On LinkedIn Mathematics genealogy Erdos number MOOC course \"Unix Tools: Data, Software and Production Engineering\" Grow from being a Unix novice to Unix wizard status, with the award-winning, free edX open online course (MOOC) Unix Tools: Data, Software and Production Engineering. Process big data, analyze software code, run DevOps tasks and excel in your everyday job through the amazing power of the Unix shell and command-line tools. The course has been enrolled by more than 7000 learners from about 100 countries. Enroll here. The Tools of the Trade IEEE Software column series explores the interplay between software development and the tools we apply to the problem. All 52 installments are available here as blog pre-prints. The new and ongoing Adventures in Code IEEE Software column series aims is to share advice as well as classic and cutting-edge knowledge through personal experiences in code crafting. All installments are available here as open access articles. Diomidis Spinellis. The Elements of Computing Style: 200+ Tips for Busy Knowledge Workers. Leanpub (e-book), CreateSpace (print), 2014. Diomidis Spinellis. Effective Debugging: 66 Specific Ways to Debug Software and Systems. Addison-Wesley 2016. Diomidis Spinellis. Code Reading: The Open Source Perspective. Addison Wesley, 2003. Software Development Productivity Award Diomidis Spinellis. Code Quality: The Open Source Perspective. Addison Wesley, 2006. Software Development Productivity Award This page is licensed under a Creative Commons Attribution-NonCommercial 4.0 International License. Î ÏÎµÎ»Î¯Î´Î± Î±Ï ÏÎ® ÏÎ¿ÏÎ·Î³ÎµÎ¯ÏÎ±Î¹ Î¼Îµ Î¬Î´ÎµÎ¹Î± Â«Creative Commons Î±Î½Î±ÏÎ¿ÏÎ¬ Î´Î·Î¼Î¹Î¿Ï ÏÎ³Î¿Ï-Î¼Î· ÎµÎ¼ÏÎ¿ÏÎ¹ÎºÎ® ÏÏÎ®ÏÎ· 4.0 Î´Î¹ÎµÎ¸Î½Î®ÏÂ».",
  "content_length": 4169,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:46"
}