{
  "name": "Dipankar Das 0001",
  "homepage": "https://www.dasdipankar.com",
  "status": "success",
  "content": "mod Dr. Dipankar Das Dr. Dipankar Das Assistant Professor, Department of Computer Science and Engineering, Jadavpur University, Kolkata, India dipankar.dipnil2005.gmail.com www.dasdipankar.com About Me Some information about myself. Assistant Professor - Stage III, Computer Science and Engineering Department, Jadavpur University, Kolkata, India Young Faculty Research Fellow, Visvesvaraya PhD Scheme for Electronics & IT, Media Lab Asia, Ministry of Electronics and Information Technology, India Dr. Dipankar Das Assistant Professor - Stage III My areas of interest are \"Natural Language Processing\", \"Speech Processing\", \"Claim Detection and Verification\", \"Large and Small Language Models\", \"Social Networks\", \"Sentiment / Emotion Analysis\", \"Information Extraction\", \"Ontology Engineering\", \"Psycho linguistics\", \"Machine Learning\", \"Code-Mixing\", \"Dialougue Management\", etc. 200+ No. of Publications 15+ Year Experiences 5 Awards Won 4 Projects Done My Experience The only source of knowledge is experience. Visiting Faculty CSE Department, NIT Mizoram, 2014-2015 Erasmus+ Departamento de Sistemas Informáticos y Computación (DSIIC), Universitat Politècnica de València (UPV), Spain 2019 S. P. Jain Institute of Global Management, Mumbai, 2016-2017 CSE Department, GCETTS, 2008-2009 Assistant Professor CSE Department, Jadavpur University, 2014- till date CSE Department, NIT Meghalaya, 2012-2014 Research Fellow India-Japan Cooperative Programme-Project (DST-JST), Multidisciplinary research field on “Sentiment Analysis where AI meets Psychology” 2010-2012, CSE Department, Jadavpur University, Kolkata, India-700032 Visiting Research Scholar Precision and Intelligence (P & I) Laboratory,Advanced Information Processing Division:Okumura Group, Tokyo Institute of Technology (TIT), Tokyo, 2011 Research Engineer DIT, MCIT, Government of India sponsored project titled “Development of the Cross-Lingual Information Access (CLIA) System” 2009-2010, CSE Department, Jadavpur University, Kolkata, India-700032 Research Projects Sevak – An Intelligent Indian Language Chatbot, IMPRINT-II, DST-SERB DETECT BEHAVIORAL MALADJUSTMENTS OF STUDENTS THROUGH SENTIMENT ANALYSIS FROM SOCIAL MEDIA, RUSA 2.0 Preparing annotated corpus of three lesser known languages of West Bengal, RUSA 2.0 My Achievement A dream becomes a goal when action is taken toward its achievement. Organizing \"Shared Task in Sentiment Analysis for Indian Languages (Code Mixed)\" in conjunction with ICON, 2017, Jadavpur University, Kolkata, India. Organizing \"NLP Tool Contest\" in conjunction with ICON 2017, India. Organized Workshop \"SAAIP 2016\" in conjunction with IJCAI, USA. Workshop on Language Technologies for Indian Social Media Texts @ ICON 2014, December, Goa, India Ph.D. Thesis (Abstract): \"Analysis and Tracking of Emotions in English and Bengali Texts: A Computational Approach . Programme Committee member of ICON, ESSEM 2013 , MIKE , MABSDA @ WWW 2013, SAAIP @ IJCNLP, SAAIP @ COLING, SENTIRE @ IEEE ICDM, WISMEA @ SBIA, WISDOM @ KDD, SAAL @ IEA-AIE. Organizing Workshop TBTCIA 2013 Workshop on Techniques on Basic Tool Creation and Its Applications \" in conjuction with 10th International Conference on Natural Language Processing (ICON-2013) , CDAC Noida, India, 18-20 December, 2013. Organizing Workshop AdSent 2013 \"Internet Advertising Using Sentiment Analysis\" in conjunction with IEEE International Conference on Data Mining (ICDM 2013), Dallas, Texas. Organized TechFest \"COGNITIA\" , NITM, Shillong, India. Organized Workshop SAAIP \"Sentiment Analysis where AI meets Psychology\" in conjunction with 24th International Conference on Computational Linguistics (COLING 2012), IITB, Mumbai, India. Organized Workshop SAAIP \"Sentiment Analysis where AI meets Psychology\" in conjunction with 5th International Joint Conference on Natural Language Processing (IJCNLP 2011), Chiang Mai, Thailand. Master Thesis Studies on Emotion Analysis at Word and Sentence Level published by LAP LAMBERT Academic Publishing GmbH & Co., KG Heinrich-Bocking-Str. 6-8, 66121, Saarbrucken, Germany, Number: 36889, ISBN: 978-3-8473-0880-5 Research Team Have Faith. Trust in the Lord and he shall Guide you. Dr. Braja Gopal Patra Topic: Music Mood Classifications - A Multimodal Computational Approach Dr. Patra received his Ph. D. in Computer Science and Engineering from Jadavpur University as Visveswaraya Fellow in 2017 under the guidance of Prof. Sivaji Bandyopadhyay and Dr. Dipankar Das. Currently, he is working as a Postdoctoral Fellow at The University of Texas Health Science Center at Houston (UTHealth). His research interests are Music Mood Classifications, Sentiment Analysis and so on under Natural Language Processing. Dr. Anupam Mondal Topic: Studies on Computational Approaches of Information Extraction from Clinical Texts Dr. Mondal received his B. Engg. in Information Technology from Jadavpur University (India) in 2007 and his M. Tech. in Computer Science and Engineering from the Kalyani University in 2010. He is currently working as an Assistant Professor in Institute of Engineering and Management (IEM) Kolkata, India from August 2017. Currently, he completed Ph.D(Engg.) under the supervision of Prof. Sivaji Bandyopadhyay (JU, India), Dr. Erik Cambria (NTU, Singapore) and Dr. Dipankar Das (JU, India) from Jadavpur University, India. His research interests are Medical Data Analysis, Sentiment Analysis and Recommendation System in Natural Language Processing. Dr. Sainik Kumar Mahata Topic: Studies on Revisiting MT with Special Research Aids-Classification, Clause, Sentiment and Code-Mixing.Dr. Mahata, Associate Professor of CSE Dept. of IEM Kolkata completed Ph.D (Engg.) as a Visveswaraya Ph.D Fellow at Jadavpur University under the guidance of Prof. Sivaji Bandyopadhyay and Dr. Dipankar Das since 2017. His topic is \"Studies on Revisiting Aids - Classification, Clause, Code-Mixing, Neural Nets and Sentiment\". He has strong proficiency in Python, Natural Language Processing and Machine Translation. He was previously associated with Institute of Engineering and Management, JIS College of Engineering and Narula Institute of Technology in the capacity of Assistant Professor. He has done his B.E and M.Tech, in Computer Science and Engineering, from Nagpur University (2005-2009) and West Bengal University of Technology (2009-2011) respectively. Dr. Subhabrata Dutta Topic: Engagement to Persuasion: A Computational Study on Online Social Discourse. Dr. Dutta received his Ph.D (Engg.) and M.Tech. in Computer Science and Engineering from Jadavpur University. His research interests are Discourse Processing, Machine Learning, and Deep Learning under Natural Language Processing. Dr. Riyanka Manna Topic: Question Answering System on Cooking Recipe.She is now in Amrita University as an Assistant Professor and received her B.Tech in computer Science & Engineering from WBUT and completed M.Tech in CSE from Lovely Professional University, Punjab. Currently, she completed Ph.D. from Jadavpur University under the guidance of Dr. Dipankar Das and Prof. Alexander Gelbukh, CIC-IPN, Mexico. Her research interests are Question Answering, Informatiion Retrival, Natural Language Processing, and Deep Learning. Chhanda Roy Chhanda Roy was an Electrical Engineer from Jadavpur University with PG Diploma in Computer Science from the same institute. She is an experienced software industry practitioner specialized in Airlines domain, having worked on a host of technologies and platforms. She started her Ph.D. with Jadavpur University in 2017 after 30 years of industry exposure. Her doctoral research is in the area of sentiment analysis of student communities to help mining their behavioral pattern. This includes application of NLP, Text and Social Media Analytics. Her doctoral thesis work was started jointly supervised by Dr. Dipankar Das and Dr. Chitrita Chaudhuri. Dr. Monalisa Dey Topic: Studies on Developments of Resources and Methods for Extractive and Abstractive SummarizationMonlisa Dey, Associate Professor of CSE Dept. of IEM Kolkata, received her B. Tech. in Computer Science of Engineering from JIS College of Engineering (WBUT,(India) in 2010 and her M. Tech. in Computer Science and Engineering from the National Institute of Technology (Durgapur) in 2012. She is currently working as an Assistant Professor in Institute of Engineering and Management (IEM) Kolkata, India from August 2016. She also worked as an Assistant Professor in JIS College of Engineering, India. Currently, she is doing Ph.D. (2017 - ) under the supervision of Dr. Dipankar Das (JU, India) from Jadavpur University, India. Her research interests are Sentiment Analysis, Summarization, Information Extraction and Information Retrieval in Natural Language Processing. Sandip Sarkar Topic: Computational Approaches for Developing Question Answering System for Learning Subjects of Basic ScienceSandip is jointly supervised with Dr. Partha Pakray, NIT Silchar and Prof. David Pinto, BUAP Mexico, received his B.Tech in Computer Science and Engineering from Jalpaiguri Govt. Engineering College in 2011 and completed his M.E in Computer Science and Engineering from Jadavpur University in 2014. Now he is pursuing his Ph.D. in Computer Science and Engineering from the same University. In the same time he is also working as an Assistant Professor in Computer Science and Application department in Hijli College from 2016. His current research interests include Question Answering, Information Retrieval and Deep Learning. Apurba Paul Apurba Paul received his M.E. in Computer Science & Engineering from Bengal Engineering and Science University, Shibpur, Howrah, West Bengal. Currently, he is pursuing his Ph.D. under the guidance of Dr. Dipankar Das from Jadavpur University, Kolkata. His research area mainly revolves around Development and Visualization of Ontology from Texts in Natural Language Processing(NLP). Apart from NLP, his interest lies in the area of Text Mining, Data M",
  "content_length": 64010,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:47"
}