{
  "name": "Diptarka Chakraborty",
  "homepage": "https://sites.google.com/view/diptarka",
  "status": "success",
  "content": "Diptarka ChakrabortySearch this siteEmbedded FilesSkip to main contentSkip to navigationAssistant ProfessorSchool of Computing,National University of SingaporeEmail: <firstname> at comp dot nus dot edu dot sg Research InterestsPublicationsOpen PositionsContact AddressTeachingStudents and PostdocsSelected TalksResearch InterestsTheoretical computer science; more specifically, algorithms on large data sets, sublinear algorithms, approximation algorithms, graph algorithms, and data structures.Brief Bio: I did my PhD from Indian Institute of Technology, Kanpur under the supervision of Prof. Manindra Agrawal and Prof. Satyadev Nandakumar. After that I spent two years at Charles University, Prague, Czech Republic as a post-doctoral fellow hosted by Prof. Michal Koucky, and then almost a year at Weizmann Institute of Science, Israel as a post-doctoral fellow hosted by Prof. Robert Krauthgamer.PublicationsGeneralizing Fair Clustering to Multiple Groups: Algorithms and Applications with Kushagra Chatterjee, Debarati Das, and Tien Long NguyenAAAI 2026 (selected for oral presentation)Towards Fair Representation: Clustering and Consensus with Kushagra Chatterjee, Debarati Das, Tien Long Nguyen, and Romina NobahariCOLT 2025Improved Rank Aggregation under Fairness Constraint with Yan Hong Yao Alvin, Himika Das, and Sanjana DeyIJCAI 2025Equivalence Testing: The Power of Bounded Adaptivitywith Sourav Chakraborty, Gunjan Kumar, and Kuldeep S. MeelAISTATS 2024Tight Lower Bound on Equivalence Testing in Conditional Sampling Modelwith Sourav Chakraborty and Gunjan KumarSODA 2024Approximate Maximum Rank Aggregation: Beyond the Worst-Casewith Yan Hong Yao AlvinFSTTCS 2023Matrix Completion: Approximating the Minimum Diameterwith Sanjana DeyISAAC 2023Support Size Estimation: The Power of Conditioningwith Gunjan Kumar and Kuldeep S. MeelMFCS 2023Approximate Model Counting: Is SAT Oracle More Powerful than NP Oracle?with Sourav Chakraborty, Gunjan Kumar, and Kuldeep S. MeelICALP 2023 (Track B)Clustering Permutations: New Techniques with Streaming Applicationswith Debarati Das and Robert KrauthgamerITCS 2023Fair Rank Aggregationwith Syamantak Das, Arindam Khan, and Aditya SubramanianNeurIPS 2022Pairwise Reachability Oracles and Preservers under Failureswith Kushagra Chatterjee and Keerti ChoudharyICALP 2022 (Track A)Approximating the Center Ranking under Ulamwith Kshitij Gajjar and Agastya Vibhuti JhaFSTTCS 2021 Approximate Trace Reconstruction via Median String (in Average-Case)with Debarati Das and Robert KrauthgamerFSTTCS 2021Approximating the Median under the Ulam Metricwith Debarati Das and Robert KrauthgamerSODA 2021Hardness of Approximation of (Multi-)LCS over Small Alphabetwith Amey Bhangale and Rajendra KumarAPPROX 2020New Extremal bounds for Reachability and Strong-Connectivity Preservers under failureswith Keerti ChoudharyICALP 2020 (Track A)Also to appear in ACM Transactions on Algorithms (TALG) (2025)Approximate Online Pattern Matching in Sub-linear Timewith Debarati Das and Michal KouckyFSTTCS 2019 Approximating Edit Distance Within Constant Factor in Truly Sub-Quadratic Time with Debarati Das, Elazar Goldenberg, Michal Koucky, and Michael Saks FOCS 2018 (co-winner of best paper award)Also appeared in Journal of the ACM (JACM) 67(6), 36:1--36:22 (2020) (invited)Space-Optimal Quasi-Gray Codes with Logarithmic Read Complexitywith Debarati Das, Michal Koucky, and Nitin Saurabh ESA 2018 (Track A)Tight Cell Probe Bounds for Succinct Boolean Matrix-Vector Multiplicationwith Lior Kamma and Kasper Green Larsen STOC 2018Sparse Weight Tolerant Subgraph for Single Source Shortest Path with Debarati Das SWAT 2018On Resource-bounded versions of the van Lambalgen theoremwith Satyadev Nandakumar and Himanshu Shukla TAMC 2017Streaming Algorithms for Embedding and Computing Edit Distance in the Low Distance Regimewith Elazar Goldenberg and Michal Koucky STOC 2016 and HALG 2016Dimension, Pseudorandomness and Extraction of Pseudorandomnesswith Manindra Agrawal, Debarati Das, and Satyadev Nandakumar FSTTCS 2015Also appeared in Computability - The Journal of the Association Computability in Europe 6(3): 277-305 (2017)An O(nε) Space and Polynomial Time Algorithm for Reachability in Directed Layered Planar Graphs with Raghunath Tewari ISAAC 2015 Also appeared in ACM Transactions on Computation Theory (TOCT) 9(4), 19:1--19:11 (2018) Simultaneous Time-Space Upper Bounds for Red-Blue Path Problem in Planar DAGswith Raghunath Tewari WALCOM 2015An extended version can be found hereNew Time-Space Upperbounds for Directed Reachability in High-genus and H-minor-free Graphswith A. Pavan, Raghunath Tewari, N. V. Vinodchandran, and Lin Forrest Yang FSTTCS 2014Other Technical Reports:Bi-Criteria Metric Distortionwith Kiarash Banihashem, Shayan Chashm Jahan, Iman Gholami, MohammadTaghi Hajiaghayi, Mohammad Mahdavi and Max SpringerOn Approximability of Propositional Model Countingwith Lawqueen Kanesh and Kuldeep S. MeelStreaming Algorithms For Computing Edit Distance Without Exploiting Suffix Trees with Elazar Goldenberg and Michal KouckyDerandomization & Time-Space Trade-off in Efficient ComputationPhD Thesis (2016)Information Complexity for Multiparty CommunicationOpen PositionsMultiple Ph.D. Openings: Currently, I am looking for highly motivated Ph.D. students. If you are interested, please write to me to schedule a meeting and discuss. Note candidates need to get admission to the School of Computing. For detailed information regarding the admission procedure, see here. International students can also apply for the SINGA award. Internship Opportunity: I am happy to invite graduate students for short-term internship positions. If you are interested, please email me along with your cv.Contact AddressCOM3-02-55,School of Computing,National University of Singapore,11 Research Link, Singapore 119391.Email: <firstname> at comp dot nus dot edu dot sg TeachingOptimization Algorithms (CS4234) Fall '25 NUSData Structures and Algorithms (CS2040S) Spring '25 NUSAlgorithms at Scale (CS5234) Fall '22, '23, '24 NUSAdvanced Algorithms  (CS6234) Fall '20, '21 NUSDesign and Analysis of Algorithms (CS3230) Spring '20, '21, '23, '24 NUSData Structure Lower Bounds Spring '18 Charles University, PragueBoolean Function Complexity Fall '16 Charles University, PragueStudents and PostdocsKushagra Chatterjee (Ph.D., Aug 2021 - present)Yan Hong Yao Alvin (Ph.D., Jan 2021 - present)Kanchana Ruwanpathirana (Research Fellow, July 2024 - Dec 2025)Nidhi Purohit (Research Fellow, June 2024 - June 2025)Sanjana Dey (Research Fellow,  Oct 2022 - Nov 2024)Kshitij Gajjar (Research Fellow, Apr 2021 - Apr 2022)Gunjan Kumar (Research Fellow, jointly with Kuldeep S. Meel,  Feb 2021 - Aug 2024)Lawqueen Kanesh (Research Fellow, jointly with Kuldeep S. Meel,  Jan-Dec 2021)Selected TalksFair Rank AggregationIIIT Delhi, IIT Delhi, IIT Kanpur, August 2025IIT Bombay, July 2025STCS Seminar, TIFR, May 2025Workshop on Voting, Matching, and Preference Aggregation, Singapore, December 2024Consistent ClusteringDIMACS Workshop on Efficient Algorithms for High Dimensional Metrics: New Tools, USA, May 2024Tight Bound on Equivalence Testing in Conditional Sampling ModelUMD College Park, USA, May 2024UC San Diego, USA, December 2023Matrix Completion: Approximating the Minimum DiameterEPAC Workshop: Algorithms and Complexity, Czechia, May 2023Clustering Permutations: Offline to StreamingUC Santa Barbara, USA, December 2023UC Riverside, USA, December 2023ISI Kolkata, India, December 2022Support Size Estimation: The Power of ConditioningComplexity Theory with a Human Face, June 2022Aggregating a Data Set: Rankings to StringsCFCS TCS Day, Peking University, China, June 2022Recent Trends in Algorithms 2022, March 2022Approximate Trace Reconstruction via Median String (in Average-Case)Conference talk at FSTTCS 2021, December 2021Hardness of Approximation of (Multi-)LCS over Small AlphabetWorkshop on Sensitivity, Query Complexity, Communication Complexity and Fourier Analysis of Boolean Function at ISI Kolkata, India, February 2020Edit Distance: Constant-factor approximation, Embedding and StreamingAalto University, Finland, March 2019NUS, Singapore, March 2019Royal Holloway, University of London, UK, March 2019  Truly Sub-quadratic Time Constant Factor Approximation of Edit DistanceInvited Highlight Talk at CPM 2019, Italy, June 2019Bar-Ilan University, Israel, May 2019University of Warwick, UK, February 2019University of Bristol, UK, February 2019Tight Cell Probe Bound for Succinct Boolean Matrix-Vector MultiplicationInteractive Complexity workshop at Simons Institute, Berkeley, USA, October 2018Summer School on Algorithms and Lower Bounds, Satellite workshop of ICALP 2018, July 2018Sparse Weight Tolerant Subgraph for Single Source Shortest PathConference talk at SWAT 2018, June 2018Optimal Quasi-Gray Codes: Efficient Generation using Simplicity of Even PermutationsDartmouth College, USA, February 2018 (over Skype)KTH, Sweden, February 2018IIT Kanpur, January 2018Streaming Algorithms for Embedding and Computing Edit Distance in the Low Distance RegimeConference talk at STOC 2016, June 2016IIT Delhi, January 2016Theory Days 2015, IIT Kanpur, November 2015Dimension, Pseudorandomness and Extraction of PseudorandomnessConference talk at FSTTCS 2015, December 2015An O(nε) Space and Polynomial Time Algorithm for Reachability in Directed Layered Planar GraphsCharles University in Prague, March 2016Conference talk at ISAAC 2015, December 2015Theory lunch, The Chinese University of Hong Kong, January 2015Simultaneous Time-Space Upper Bounds for Red-Blue Path Problem in Planar DAGsConference talk at WALCOM 2015, February 2015Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 9763,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:47"
}