{
  "name": "Dirk Nuyens",
  "homepage": "https://people.cs.kuleuven.be/~dirk.nuyens",
  "status": "success",
  "content": "My Homepage (Dirk Nuyens) Dirk Nuyens' Homepage @ cs.kuleuven.be My Homepage Welcome on Dirk Nuyens's Personal Computer Science Department Homepage. Topics on this Site are: Research, About Me and Other Things. Research I work in the field of high-dimensional (this ranges from 2 or 3, really, up to millions, really!) quasi-Monte Carlo integration. More specifically I work on the construction of rank-1 lattice rules. You can find some of my work in the list below. The more recent work is listed on top, so for a good understanding you may want to read bottom up. MagicPointShop and QMC4PDE generators on bitbucket The source code of the Python2/3, Matlab/Octave and C++ point generators is now available as a git repository on bitbucket: qmc-generators. QMC4PDE Accompanying software by the paper with Frances Kuo on using quasi-Monte Carlo methods for parametrized PDE problems: Software: The Magic Point Shop and fast CBC constructions The magic point shop: a collection of QMC point generators and generating vectors. Fast component-by-component constructions: a collection of software routines for fast CBC constructions of generating vectors (superseding the old webpages). Lattice rules for nonperiodic smooth integrands http://arxiv.org/abs/1211.3799 With Josef Dick and Friedrich Pillichshammer we study tent-transformed lattice rules and symmetrized lattice rules. We have shown that these can achieve higher order of convergence for nonperiodic functions without the need for randomization. The main space of study is a half-period cosine space which for smoothness one equals the standard unanchored Sobolev space. That is \\(K^{\\mathrm{sob}}_{1,\\gamma} = K^{\\cos}_{1,\\gamma \\pi^{-2}}\\) for \\begin{align*} % \\end{align*} The manuscript contains some numerical tests for which the C++11 source code can be downloaded from KU Leuven gitlab and contains: main.cpp: main driver routine; symq_powers.hpp: implementation of lattice sequence (plain vanilla, tent-transformed and symmetrized) with powers of 2 evaluation points. Conditional sampling and LT constructions http://arxiv.org/abs/1111.4808: the general setup applied to the standard Black-Scholes world. http://arxiv.org/abs/1207.6566: application to the more advanced Heston model. We studied the application of QMC+LT to barrier options using conditional sampling. Higher order polynomial lattice rules With Jan Baldeaux, Josef Dick, Gunther Leobacher, and Friedrich Pillichshammer. We obtain a fast CBC construction algorithm for higher order polynomial lattice rules. In this paper we find explicit expressions for the Walsh kernels in base 2 of smoothness 2 and 3. Random walks in the plane, an old question by Pearson Together with Jon Borwein, Armin Straub and James Wan we looked at the expected distance (and other moments) of a random walk in the plane. This was a question asked by Pearson in 1906 and unresolved for small number of steps. For a high number of steps this results in a normal distribution. PDEs with random coefficients With Ivan Graham, Frances Kuo, Rob Scheichl and Ian Sloan we looked at flow through a random porous media where the permeability is given by a rather rough random field. In this case it is impossible to apply KL or polynomial chaos expansions; and we generate the random field discretely in the FEM nodes. The paper considers problem instances with more than a million stochastic variables and gets convergence rates getting near to 1/N. Graphs of double character sums As a graphical experiment I am plotting a visual interpretation of a certain double character sum layed out on a circle. This then clearly shows symmetry and gives rise to other visual deducible properties. PhD thesis I defended my PhD thesis on April 20th 2007. Matlab codes for fast construction Some Matlab codes for the fast construction of good lattice rules and good lattice sequences can be found on my code page. They also work with Octave. The December 2005 Cover of AMS Notices» more info and images on separate page The December issue of Notices of the AMS contains an image of the component-by-component matrix on the cover by me as well as a one page explanation of these matrices as accompaniment to an article by Ian Sloan and Frances Kuo. The image below is not the cover art, but the beautiful situation for n=90. Using Embedded Lattice Rules as Finite Sequences In joint work with Frances Y. Kuo and Roland Cools we construct embedded lattice rules which can be used as a finite low-discrepancy sequence. You can download a preprint of “Constructing embedded lattice rules for multivariate integration”. Published in SIAM Journal on Scientific Computing. Fast CBC Construction for Different Kernels and Polynomial Lattice Rules» more info and Matlab code on separate page The techniques on which the fast construction algorithm relies are independent of the kernel of the reproducing kernel Hilbert space, and thus the algorithm can also be applied to more exotic kernels. More over, the fast construction algorithm can directly be applied for polynomial lattice rules. We also supply a Matlab implementation of the fast algorithm for prime n. You can download a preprint of “Fast Component-by-Component Construction, A Reprise for Different Kernels” which appeared in the MC2QMC2004 proceedings. Fast CBC Construction for (Non-)Prime Lattice Rules The fast construction algorithm has been extended to work for any number of points. The construction cost for general n remains O(sn log(n)) for n points in s dimensions. You can download a preprint of “Fast Component-by-Component Construction of Rank-1 Lattice Rules With a Non-Prime Number of Points” which appeared in the Dagstuhl 2004 issue of Journal of Complexity. Fast CBC Construction for Lattice Rules with a Prime Number of Points The component-by-component (CBC) construction algorithm is a nice way to construct lattice rules which are extensible in the dimension. However the straight forward construction cost of this algorithm is O(s2n2), which is intractable for n and s large. We show a fast construction algorithm with time complexity O(sn log(n)) and memory complexity O(n). “Fast Algorithms for Component-By-Component Construction of Rank-1 Lattice Rules in Shift-Invariant Reproducing Kernel Hilbert Spaces” (AMS link) which appeared in Mathematics of Computation. There is also an extended version on this server as a TW-report with extra tables. About Me My Research Interests Quasi-Monte Carlo (qMC) in general. Lattice rules. Component-by-component construction of lattice rules. The concepts of information based complexity (IBC). Quantum algorithms and complexity. Financial mathematics. And a little bit off topic: computer languages and optimization (of code and human effort). Contact Info My address: Dirk Nuyens, Department of Computer Science, KU Leuven, Celestijnenlaan 200A, B-3001 Leuven. My email address in a harder to read font, as an image, and hopefully not easy machine decipherable: Other Things I have two daughters: Liene was born in Leuven in 2006 and Gemma was born in Kogarah (Sydney, Australia) in 2009. © Copyright Dirk Nuyens. XHTML and CSS compliant (please mail any irregularities). Disclaimer: I've learned to speak for myself, please learn to live with the mistakes.",
  "content_length": 7273,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:53"
}