{
  "name": "Dirk Englund",
  "homepage": "http://www.rle.mit.edu/qp",
  "status": "success",
  "content": "Quantum Photonics Laboratory | RLE at MIT Quantum Photonics & AI Group Prof. Dirk Englund • Dr. Ryan Hamerly • Dr. Matthew Trusheim Home Team Publications Theses and Presentations News Outreach Links Contact Positions Quantum Optics - Precision Measurement - Nanophotonics Silicon photonics for optical quantum technologies Modern silicon photonics opens new possibilities for high-performance quantum information processing, such as quantum simulation and high-speed quantum cryptography. Solid state quantum memories Solid state quantum memories based on electronic and nuclear spins are now becoming competitive for quantum repeater networks and distributed quantum computing. Opto-electronic devices and systems based on 2D materials 2D materials, such as graphene, provide new capabilities in communications, sensing, imaging, nonlinear optics, and quantum information devices. Quantum-enhanced sensing Quantum sensors enable precision measurements of time, fields, and forces for applications in the physical and life sciences. Research Overview The world of quantum mechanics holds enormous potential to address unsolved problems in communications, computation, precision measurements, and machine learning/AI. The QP-Group pursues experimental and theoretical research towards machine learning hardware and critical quantum technologies (computing, networking, sensing) by precision control of photons and atomic systems, combining techniques from atomic physics, optoelectronics, and modern semiconductor devices. The QP-Group at MIT is led by Professor Dirk Englund together with research scientists Dr Ryan Hamerly, Dr Matt Trusheim, Dr Franco Wong, and Dr. Avinash Kumar. Key words: quantum physics, EE, CS; full-stack system design and theory; machine learning accelerators; nanofabrication; integrated circuit foundries; photonic circuit foundries; entrepreneurship. See here for some available positions : https://qp.mit.edu/research-positions/ Opportunities for outstanding theorists and experimentalists: Quantum Network Engineers Spin-Photon Quantum Networks Photonics for Quantum and Machine Learning Large-Scale Photonics for Cold-Atom Quantum Computing QPL-NTT Summer Intern — Optical AI Quantum Optics with 2D Materials 2D Quantum Device internships Positions at PhD, postdoc, & scientist levels.",
  "content_length": 2318,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:51"
}