{
  "name": "Dirk Arnold",
  "homepage": "https://www.cs.dal.ca/~dirk",
  "status": "success",
  "content": "Dirk Arnold Dirk V. Arnold Faculty of Computer Science Dalhousie University Halifax, Nova Scotia Canada B3H 4R2 Phone : 902.494.2691 Email : dirk@dal.ca Curriculum Vitae Research My research is in evolutionary computation. My current work focuses on constraint handling and on the use of surrogate modelling techniques. I also have research interests in neighbouring areas of optimization and machine learning. A complete listing of publications can be found below or on my Google scholar page. Teaching In 2025/26 I teach the following courses: CSCI 1300: Calculus in Computer Science (Fall term) CSCI 2360: Probability and Statistics for Computer Science (Winter term) CSCI 3162: Digital Media (Winter term) Course matrials and further information are available on Brightspace. Publications Book D. V. Arnold Noisy Optimization with Evolution Strategies Kluwer Academic Publishers, 2002. Journal Papers Y. Hong and D. V. Arnold An evolutionary algorithm for expensive mixed-integer black-box optimization with explicit constraints ACM Transactions on Evolutionary Learning and Optimization, 5(1), 7:1-7:16, 2025. P.\tSpettel, Z. Ba,\tand D. V. Arnold Active sets for explicitly constrained evolutionary optimization Evolutionary Computation, 30(4):531-553, 2022. X. Gao, S. Brooks, and D. V. Arnold A feature-based quality metric for tone mapped images ACM Transactions on Applied Perception, 14(4), 26:1-26:11, 2017. M. Hellwig and D. V. Arnold Comparison of constraint handling mechanisms for the (1,λ)-ES on a simple constrained problem Evolutionary Computation, 24(1):1-23, 2016. X. Gao, S. Brooks, and D. V. Arnold Automated parameter tuning for tone mapping using visual saliency Computers & Graphics, 52:171-180, 2015. D. V. Arnold On the behaviour of the (1,λ)-ES for conically constrained linear problems Evolutionary Computation, 22(3):503-523, 2014. D. V. Arnold Resampling versus repair in evolution strategies applied to a constrained linear problem Evolutionary Computation, 21(3):389-411, 2013. G. LeBlanc, A. Shouldice, D. V. Arnold, and S. Brooks Multi-band Fourier synthesis of ocean waves Journal of Graphics Tools, 16(2):57-70, 2012. D. V. Arnold and H.-G. Beyer On the behaviour of evolution strategies optimising cigar functions Evolutionary Computation, 18(4):661-682, 2010. T. Burrell, D. Arnold, and S. Brooks Advected river textures Computer Animation and Virtual Worlds, 20(2-3):163-173, 2009. D. V. Arnold and H.-G. Beyer Evolution strategies with cumulative step length adaptation on the noisy parabolic ridge Natural Computing, 7(4):555-587, 2008. D. V. Arnold and A. MacLeod Step length adaptation on ridge functions Evolutionary Computation, 16(2):151-184, 2008. D. V. Arnold and R. Salomon Evolutionary gradient search revisited IEEE Transactions on Evolutionary Computation, 11(4):480-495, 2007. D. V. Arnold and H.-G. Beyer Optimum tracking with evolution strategies Evolutionary Computation, 14(3):291-308, 2006. D. V. Arnold Weighted multirecombination evolution strategies Theoretical Computer Science, 361(1):18-37, 2006. D. V. Arnold and H.-G. Beyer A general noise model and its effects on evolution strategy performance IEEE Transactions on Evolutionary Computation, 10(4):380-391, 2006. D. V. Arnold and H.-G. Beyer Expected sample moments of concomitants of selected order statistics Statistics and Computing, 15(3):241-250, 2005. H.-G. Beyer, D. V. Arnold, and S. Meyer-Nieberg A new approach for predicting the final outcome of evolution strategy optimization under noise Genetic Programming and Evolvable Machines, 6(1):7-24, 2005. D. V. Arnold and H.-G. Beyer Performance analysis of evolutionary optimization with cumulative step length adaptation IEEE Transactions on Automatic Control, 49(4):617-622, 2004. D. V. Arnold and H.-G. Beyer On the benefits of populations for noisy optimization Evolutionary Computation, 11(2):111-127, 2003. D. V. Arnold and H.-G. Beyer A comparison of evolution strategies with other direct search methods in the presence of noise Computational Optimization and Applications, 24(1):135-159, 2003. H.-G. Beyer and D. V. Arnold Qualms regarding the optimality of cumulative path length control in CSA/CMA-evolution strategies Evolutionary Computation, 11(1):19-28, 2003. D. V. Arnold and H.-G. Beyer Performance analysis of evolution strategies with multi-recombination in high-dimensional RN-search spaces disturbed by noise Theoretical Computer Science, 289(1):629-647, 2002. D. V. Arnold and H.-G. Beyer Local performance of the (1+1)-ES in a noisy environment IEEE Transactions on Evolutionary Computation, 6(1):30-41, 2002. R. F. Hadley, A. Rotaru-Varga, D. V. Arnold, and V. C. Cardei Syntactic systematicity arising from semantic predictions in a Hebbian-competitive network Connection Science, 13(1):73-94, 2001. D. V. Arnold Information-theoretic analysis of phase transitions Complex Systems, 10(2):143-155, 1996. Book Chapters N. Hansen, D. V. Arnold, and A. Auger Evolution strategies in J. Kacprzyk and W. Pedrycz (eds.), Handbook of Computational Intelligence, Springer, 2015. J. Porter and D. V. Arnold Analyzing the behaviour of multi-recombinative evolution strategies applied to a conically constrained problem in R. Datta and K. Deb (eds.), Evolutionary Constrained Optimization, Springer, 2015. R. Salomon and D. V. Arnold The evolutionary-gradient-search procedure in theory and practice in R. Chiong (ed.), Nature-Inspired Algorithms for Optimisation. Springer, 2009. D. V. Arnold Evolution strategies in noisy environments — A survey of existing work in L. Kallel et al. (eds.), Theoretical Aspects of Evolutionary Computing. Springer, 2001. H.-G. Beyer and D. V. Arnold Theory of evolution strategies — A tutorial in L. Kallel et al. (eds.), Theoretical Aspects of Evolutionary Computing. Springer, 2001. Refereed Conference and Workshop Papers H. Huang and D. V. Arnold Surrogate model assisted evolutionary algorithms: Performance bound and incremental Gaussian process model updates Foundations of Genetic Algorithms 18. Leiden, 2025. J. Porter and D. V. Arnold Direct augmented Lagrangian evolution strategies Genetic and Evolutionary Computation Conference. Melbourne, 2024. Y. Hong and D. V. Arnold Evolutionary mixed-integer optimization with explicit constraints Genetic and Evolutionary Computation Conference. Lisbon, 2023. A. Abbasnejad and D. V. Arnold Adaptive function value warping for surrogate model assisted evolutionary optimization Parallel Problem Solving from Nature — PPSN XVII. Dortmund, 2022. L. Toal and D. V. Arnold Simple surrogate model assisted optimization with covarianve matrix adaptation Parallel Problem Solving from Nature — PPSN XVI. Leiden, 2020. J. Yang and D. V. Arnold corrected version A surrogate model assisted (1+1)-ES with increased exploitation of the model Genetic and Evolutionary Computation Conference. Prague, 2019. A. Kayhani and D. V. Arnold Design of a surrogate model assisted (1+1)-ES Parallel Problem Solving from Nature — PPSN XV. Coimbra, 2018. X. Gao, J. Porter, S. Brooks, and D. V. Arnold Evolutionary optimization of tone mapped image quality index Evolution Artificielle. Paris, 2017. D. V. Arnold Reconsidering constraint release for active-set evolution strategies Genetic and Evolutionary Computation Conference. Berlin, 2017. D. V. Arnold An active-set evolution strategy for optimization with known constraints Parallel Problem Solving from Nature — PPSN XIV. Edinburgh, 2016. A. Lu and D. V. Arnold An evolutionary algorithm for depth image based camera pose estimation in indoor environments IEEE Congress on Evolutionary Computation. Vancouver, 2016. X. Gao, S. Brooks, and D. V. Arnold Automatic blended tone mapping through evolutionary optimization IEEE Congress on Evolutionary Computation. Vancouver, 2016. D. V. Arnold and J. Porter Best Paper Award, Continuous Optimization Track Towards an augmented Lagrangian constraint handling approach for the (1+1)-ES Genetic and Evolutionary Computation Conference. Madrid, 2015. X. Gao, S. Brooks, and D. V. Arnold Saliency-based parameter tuning for tone mapping 11th European Conference on Visual Media Production. London, 2014. D. V. Arnold On the use of evolution strategies for optimization on spherical manifolds Parallel Problem Solving from Nature — PPSN XIII. Ljubljana, 2014. S. Nourashrafeddin, E. Milios, and D. V. Arnold Best Student Paper Award An ensemble approach for text document clustering using Wikipedia concepts ACM Symposium on Document Engineering. Fort Collins, 2014. K. Fraser, D. V. Arnold, and G. Dellaire Projected Barzilai-Borwein method with infeasible iterates for nonnegative least-squares image deblurring Computer and Robot Vision. Montreal, 2014 S. Nourashrafeddin, E. Milios and D. V. Arnold Interactive text document clustering using feature labeling ACM Symposium on Document Engineering. Florence, 2013. X. Gao, S. Brooks, and D. V. Arnold Virtual photograph based saliency analysis of high dynamic range images International Symposium on Computational Aesthetics in Graphics, Visualization, and Imaging. Anaheim, 2013. D. V. Arnold Best Paper Award, ES/EP Track On the behaviour of the (1,λ)-ES for a conically constrained problem Genetic and Evolutionary Computation Conference. Amsterdam, 2013. S. Nourashrafeddin, E. Milios and D. V. Arnold An evolutionary algorithm for feature selective double clustering of text documents IEEE Congress on Evolutionary Computation. Cancun, 2013. J. Porter and D. V. Arnold An evolutionary spline fitting algorithm for identifying filamentous cyanobacteria ACM Symposium on Applied Computing. Coimbra, 2013. D. V. Arnold Best Paper Award On the behaviour of the (1,λ)-σSA-ES for a constrained linear problem Parallel Problem Solving from Nature — PPSN XII. Taormina, 2012. D. V. Arnold and N. Hansen A (1+1)-CMA-ES for constrained optimisation Genetic and Evolutionary Computation Conference. Philadelphia, 2012. D. V. Arnold Analysis of a repair mechanism for the (1,λ)-ES applied to a simple co",
  "content_length": 14552,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:50"
}