{
  "name": "Dirk Jancke",
  "homepage": "https://www.ini.rub.de/the_institute/people/dirk-jancke",
  "status": "success",
  "content": "Prof. Dr. Dirk Jancke | People | Institut für Neuroinformatik RUB INI People Prof. Dr. Dirk Jancke dirk.jancke@ini.rub.de (+49) 234-32-27845 Prof. Dr. Dirk Jancke Theory of Cognitive Systems Visual Neuroscience -- Optical Imaging dirk.jancke@ini.rub.de (+49) 234-32-27845 http://jancke-lab.de/ About Me Publications Teaching Supervised Theses ORCID ID Affiliations @ Ruhr-University Vice Speaker Collaborative Research Center (CRC) 874 Vice Speaker - Research Dept. of Neuroscience (RDN) Ruhr University Bochum PhD Committee & Study Commission - International Graduate School of Neuroscience (IGSN) International Graduate School of Biosciences, Faculty of Biology and Biotechnology Directorate - Institute of Neural Computation (INI) Research of my group focuses on processing dynamics within the brain. Specifically, we investigate its capacities for plastic reorganization (remodeling, learning) and the underlying state transitions. Us­ing Optical Imaging techniques we show how parameters given in the outer world are represented and processed across large neuronal populations. By additional employment of sophisticated data analysis and modeling we aim at deciphering the brain‘s computational strategies that generate behavior. Optical imaging is unique in its capability of capturing the activity of millions of neurons at once (for a review see \"VSDI: a new era in functional imaging of cortical dynamics\" and our contribution therein). In combination with Optogenetics (i.e., light stimulation of specific target neurons and neuronal subnetworks) our approach provides an ideal access to both theoretical and experimental questions dealing with highly dynamic activity patterns ob­served across the brain. Bookchapter Contributions Selected Publications view all publications 2024 Gain control of sensory input across polysynaptic circuitries in mouse visual cortex by a single G protein-coupled receptor type (5-HT2A)Barzan, R., Bozkurt, B., Nejad, M. M., Süß, S. T., Surdin, T., Böke, H., et al.Nature Communications, 15(1) Bibtex APA @article{BarzanBozkurtNejadEtAl2024, author\t\t=\t{Barzan, Ruxandra and Bozkurt, Beyza and Nejad, Mohammadreza M. and Süß, Sandra T. and Surdin, Tatjana and Böke, Hanna and Spoida, Katharina and Azimi, Zohre and Grömmke, Michelle and Eickelbeck, Dennis and Mark, Melanie D. and Rohr, Lennard and Siveke, Ida and Cheng, Sen and Herlitze, Stefan and Jancke, Dirk}, title\t\t=\t{Gain control of sensory input across polysynaptic circuitries in mouse visual cortex by a single G protein-coupled receptor type (5-HT2A)}, journal\t\t=\t{Nature Communications}, volume\t\t=\t{15}, number\t\t=\t{1}, month\t\t=\t{September}, year\t\t=\t{2024}, doi\t\t=\t{10.1038/s41467-024-51861-1}, } Barzan, R., Bozkurt, B., Nejad, M. M., Süß, S. T., Surdin, T., Böke, H., et al. (2024). Gain control of sensory input across polysynaptic circuitries in mouse visual cortex by a single G protein-coupled receptor type (5-HT2A). Nature Communications, 15(1). http://doi.org/10.1038/s41467-024-51861-1 2023 Induction of excitatory brain state governs plastic functional changes in visual cortical topologyEysel, U. T., & Jancke, D.Brain Structure and Function Bibtex APA @article{EyselJancke2023, author\t\t=\t{Eysel, Ulf T. and Jancke, Dirk}, title\t\t=\t{Induction of excitatory brain state governs plastic functional changes in visual cortical topology}, journal\t\t=\t{Brain Structure and Function}, month\t\t=\t{December}, year\t\t=\t{2023}, doi\t\t=\t{10.1007/s00429-023-02730-y}, } Eysel, U. T., & Jancke, D.. (2023). Induction of excitatory brain state governs plastic functional changes in visual cortical topology. Brain Structure and Function. http://doi.org/10.1007/s00429-023-02730-y 2022 Bridging the gap between single receptor type activity and whole-brain dynamicsJancke, D., Herlitze, S., Kringelbach, M. L., & Deco, G.The FEBS Journal, 289(8), 2067–2084 Bibtex APA @article{JanckeHerlitzeKringelbachEtAl2022, author\t\t=\t{Jancke, Dirk and Herlitze, Stefan and Kringelbach, Morten L. and Deco, Gustavo}, title\t\t=\t{Bridging the gap between single receptor type activity and whole-brain dynamics}, journal\t\t=\t{The FEBS Journal}, volume\t\t=\t{289}, number\t\t=\t{8}, pages\t\t=\t{2067–2084}, month\t\t=\t{April}, year\t\t=\t{2022}, doi\t\t=\t{10.1111/febs.15855}, } Jancke, D., Herlitze, S., Kringelbach, M. L., & Deco, G. (2022). Bridging the gap between single receptor type activity and whole-brain dynamics. The FEBS Journal, 289(8), 2067–2084. http://doi.org/10.1111/febs.15855 2021 Darks and Lights, the `Yin–Yang′ of Vision Depends on LuminanceJancke, D.Trends in Neurosciences, 44(5), 339–341 Bibtex APA @article{Jancke2021, author\t\t=\t{Jancke, Dirk}, title\t\t=\t{Darks and Lights, the `Yin–Yang′ of Vision Depends on Luminance}, journal\t\t=\t{Trends in Neurosciences}, volume\t\t=\t{44}, number\t\t=\t{5}, pages\t\t=\t{339–341}, month\t\t=\t{May}, year\t\t=\t{2021}, doi\t\t=\t{10.1016/j.tins.2021.02.007}, } Jancke, D. (2021). Darks and Lights, the `Yin–Yang′ of Vision Depends on Luminance. Trends in Neurosciences, 44(5), 339–341. http://doi.org/10.1016/j.tins.2021.02.007 2020 Perception of the difference between past and present stimulus: A rare orientation illusion may indicate incidental access to prediction error-like signalsStaadt, R., Philipp, S. T., Cremers, J. L., Kornmeier, J., & Jancke, D.PLOS ONE, 15(5), e0232349 Bibtex APA @article{StaadtPhilippCremersEtAl2020, author\t\t=\t{Staadt, Robert and Philipp, Sebastian T. and Cremers, Joschka L. and Kornmeier, Jürgen and Jancke, Dirk}, title\t\t=\t{Perception of the difference between past and present stimulus: A rare orientation illusion may indicate incidental access to prediction error-like signals}, journal\t\t=\t{PLOS ONE}, volume\t\t=\t{15}, number\t\t=\t{5}, pages\t\t=\t{e0232349}, month\t\t=\t{May}, year\t\t=\t{2020}, doi\t\t=\t{10.1371/journal.pone.0232349}, } Staadt, R., Philipp, S. T., Cremers, J. L., Kornmeier, J., & Jancke, D.. (2020). Perception of the difference between past and present stimulus: A rare orientation illusion may indicate incidental access to prediction error-like signals. PLOS ONE, 15(5), e0232349. http://doi.org/10.1371/journal.pone.0232349 Separable gain control of ongoing and evoked activity in the visual cortex by serotonergic inputAzimi, Z., Barzan, R., Spoida, K., Surdin, T., Wollenweber, P., Mark, M. D., et al.eLife, 9 Bibtex APA Downloads Elife, 9:e53552 @article{AzimiBarzanSpoidaEtAl2020, author\t\t=\t{Azimi, Zohre and Barzan, Ruxandra and Spoida, Katharina and Surdin, Tatjana and Wollenweber, Patric and Mark, Melanie D and Herlitze, Stefan and Jancke, Dirk}, title\t\t=\t{Separable gain control of ongoing and evoked activity in the visual cortex by serotonergic input}, journal\t\t=\t{eLife}, volume\t\t=\t{9}, month\t\t=\t{April}, year\t\t=\t{2020}, doi\t\t=\t{10.7554/elife.53552}, } Azimi, Z., Barzan, R., Spoida, K., Surdin, T., Wollenweber, P., Mark, M. D., et al. (2020). Separable gain control of ongoing and evoked activity in the visual cortex by serotonergic input. eLife, 9. http://doi.org/10.7554/elife.53552 2019 CaMello-XR enables visualization and optogenetic control of Gq/11 signals and receptor trafficking in GPCR-specific domainsEickelbeck, D., Karapinar, R., Jack, A., Suess, S. T., Barzan, R., Azimi, Z., et al.Communications Biology, 2(1) Bibtex APA @article{EickelbeckKarapinarJackEtAl2019, author\t\t=\t{Eickelbeck, Dennis and Karapinar, Raziye and Jack, Alexander and Suess, Sandra T. and Barzan, Ruxandra and Azimi, Zohre and Surdin, Tatjana and Grömmke, Michelle and Mark, Melanie D. and Gerwert, Klaus and Jancke, Dirk and Wahle, Petra and Spoida, Katharina and Herlitze, Stefan}, title\t\t=\t{CaMello-XR enables visualization and optogenetic control of Gq/11 signals and receptor trafficking in GPCR-specific domains}, journal\t\t=\t{Communications Biology}, volume\t\t=\t{2}, number\t\t=\t{1}, month\t\t=\t{February}, year\t\t=\t{2019}, doi\t\t=\t{10.1038/s42003-019-0292-y}, } Eickelbeck, D., Karapinar, R., Jack, A., Suess, S. T., Barzan, R., Azimi, Z., et al. (2019). CaMello-XR enables visualization and optogenetic control of Gq/11 signals and receptor trafficking in GPCR-specific domains. Communications Biology, 2(1). http://doi.org/10.1038/s42003-019-0292-y 2018 TMS-induced neuronal plasticity enables targeted remodeling of visual cortical mapsKozyrev, V., Staadt, R., Eysel, U. T., & Jancke, D.Proceedings of the National Academy of Sciences, 115(25), 6476–6481 Bibtex APA Downloads link @article{KozyrevStaadtEyselEtAl2018, author\t\t=\t{Kozyrev, Vladislav and Staadt, Robert and Eysel, Ulf T. and Jancke, Dirk}, title\t\t=\t{TMS-induced neuronal plasticity enables targeted remodeling of visual cortical maps}, journal\t\t=\t{Proceedings of the National Academy of Sciences}, volume\t\t=\t{115}, number\t\t=\t{25}, pages\t\t=\t{6476–6481}, month\t\t=\t{June}, year\t\t=\t{2018}, doi\t\t=\t{10.1073/pnas.1802798115}, } Kozyrev, V., Staadt, R., Eysel, U. T., & Jancke, D.. (2018). TMS-induced neuronal plasticity enables targeted remodeling of visual cortical maps. Proceedings of the National Academy of Sciences, 115(25), 6476–6481. http://doi.org/10.1073/pnas.1802798115 2017 Catching the voltage gradient—asymmetric boost of cortical spread generates motion signals across visual cortex: a brief review with special thanks to Amiram GrinvaldJancke, D.Neurophoton., 4(3), 031206 Bibtex APA @article{Jancke2017, author\t\t=\t{Jancke, Dirk}, title\t\t=\t{Catching the voltage gradient—asymmetric boost of cortical spread generates motion signals across visual cortex: a brief review with special thanks to Amiram Grinvald}, journal\t\t=\t{Neurophoton.}, volume\t\t=\t{4}, number\t\t=\t{3}, pages\t\t=\t{031206}, year\t\t=\t{2017}, doi\t\t=\t{10.1117/1.NPh.4.3.031206}, } Jancke, D. (2017). Catching the voltage gradient—asymmetric boost of cortical spread generates motion signals across visual cortex: a brief review with special thanks to Amiram Grinvald. Neurophoton., 4(3), 031206. http://doi.org/10.1117/1.NPh.4.3.031206 2016 Temporal Asymmetry in Dark–Bright Processing Initiates Propagating Activity across Primary Visual CortexRekauzke, S., Nortmann, N., Staadt, R., Hock, H. S., ",
  "content_length": 64574,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:53"
}