{
  "name": "Dirk Fahland",
  "homepage": "https://www.win.tue.nl/~dfahland",
  "status": "success",
  "content": "dirk fahland > about me dirk fahland > about me publications presentations teaching tools Dr. Dirk Fahland TU Eindhoven P.O. Box 513 5600 MB Eindhoven the Netherlands d.fahland@tue.nl skype: dfahland twitter: dfahland office: MF 7.066 phone: +31 40 2474804 I am an Assistant Professor in the Analytics for Information Systems group at the Technische Universiteit Eindhoven. My research interests are in describing and analyzing complex and distributed systems in particular through their event data using process mining and data engineering. Starting from a strong background in construction and analysis of distributed systems with formal models, I have over the years embraced event data as a central source for system analysis. I am researching techniques for large-scale event data pre-processing and querying as well as discovering, synthesizing, and transforming models from event data and existing models. One of my central themes is to analyze data and systems that are too large or complex to be understood as monolithic end-to-end processes executed in isolation, but rather require to be described and analyzed as a complex network of behavior from several different angles together. My teaching expertise is in behavioral modeling and analysis of (distributed) systems, and in hands-on project-oriented Data Science and system design courses. soon I will be teaching the courses Data Challenge 3, Advanced Process Mining, and the Seminar Analytics for Information Systems in Fall 2018. recently Our journal paper on Dynamic skipping and blocking, dead path elimination for cyclic workflows, and a local semantics for inclusive gateways has been accepted at Information Systems, June 2018. My chapter on Artifact-Centric Process Mining in the Encyclopedia of Big Data Technologies has been accepted, May 2018. Our journal paper on The Imprecisions of Precision Measures in Process Mining has been accepted at Information Processing Letters, February 2018. I received an award for excellent teaching in the course Business Process Management Systems (2IMI10), December 2017 Our journal paper on Linking data and process perspectives for conformance analysis has been accepted at Computers & Security, October 2017. Our conference paper on Semi-supervised Log Pattern Detection and Exploration Using Event Concurrence and Contextual Information as been accepted at CoopIS'2017, July 2017 I gave keynotes on Process Mining: Past, Present, and Open Challenges at the 6th International Conference on Analysis of Images, Social networks and Texts (AIST 2017), see the slides, in Moscow, July 2017 Software in Information Systems Research: Methods and Obstacles at the 8th International Workshop on Enterprise Modeling and Information Systems Architectures (EMISA 2017), see the slides, in Essen, May 2017 My PhD students successfully defended: dr. Elham Ramzeani defended her PhD thesis on Understanding Non-Compliance on 16th January 2017 dr. Sander J.J. Leemans defended his PhD thesis on Robust Process Mining with Guarantees on 9th May 2017 Our workshop paper on A Conceptual Framework for Understanding Event Data Quality for Behavior Analysis as been accepted at ZEUS 2017 and received the best presentation award, February 2017. I was nominated as member of the Program Committees of the 39th International Conference on Application and Theory of Petri Nets and Concurrency (PetriNets 2018) the 16th International Conference on Business Process Management (BPM 2018) as senior PC member the 19th International Working Conference on Business Process Modeling, Development, and Support (BPMDS 2018) the 3rd International Workshop on Process Querying PQ 2018 the 4th International Workshop on Algorithms and Theories for the Analysis of Event Data (ATAED 2018) We presented a tool demo on Interactively Exploring Logs and Mining Models with Clustering, Filtering, and Relabeling at the BPM 2016 conference, August 2016. Watch the Demo video online. I presented a poster on Process Mining for ERP Systems - the Artifact-Centric Approach at the European Data Forum 2016, 29th-30th June 2016 in Eindhoven Our journal paper on Scalable Process Discovery and Conformance Checking has been accepted at Software & Systems Modeling, May 2016 Our conference papers on Label Refinement for Handling Duplicated Tasks in Process Discovery and on Dynamic Skipping and Blocking and Dead Path Elimination for Cyclic Workflows have been accepted at the BPM 2016 conference, May 2016. Our journal paper on Evaluating Data-Centric Process Approaches: Does the Human Factor Factor in? has been accepted at Software & Systems Modeling, February 2016 I was nominated as co-chair of the Tutorials and Panels of the 15th International Conference on Business Process Management (BPM'17) I was nominated as member of the Program Committees of the 38th International Conference on Application and Theory of Petri Nets and Concurrency (PetriNets 2017) the 15th International Conference on Business Process Management (BPM 2017) the \"BPM and Enterprise Architecture\" track at SAC 2017 the 18th International Working Conference on Business Process Modeling, Development, and Support (BPMDS 2017) the 2nd International Workshop on Process Querying PQ 2017 the 3rd International Workshop on Algorithms and Theories for the Analysis of Event Data (ATAED 2017) I have been co-organizer of the Best Process Mining Dissertation Award 2015 which I was honored to hand over to Jorge Munoz-Gama at the meeting of the IEEE TaskForce on Process Mining in Innsbruck, September 2015 I gave an invited lecture at the SOAMED Fall School on Processes and Data on Artifact-Centric Modeling of data-driven systems, October 2015 Our journal paper on Discovering Interacting Artifacts from ERP Systems has been accepted at IEEE Transactions on Services Computing, September 2015. less recent... in the past Before, I graduated in fall 2010 in the AIS group and in the Theory of Programming group at the Humboldt-Universität zu Berlin within the B.E.S.T programme, supported by the METRIK graduate school. I then worked as a Post-Doc at TU Eindhoven on the EU funded ACSI project and spent several research stays at the group of David Harel at the Weizmann Institute of Science, Israel, and the BPT group of Mathias Weske at the HPI Potsdam, Germany. Earlier, I spent a year at the School of Computing at the National University of Singapore.",
  "content_length": 6401,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:53"
}