{
  "name": "Dirk Sudholt",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/dirk-sudholt",
  "status": "success",
  "content": "Dr Dirk Sudholt | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Dirk Sudholt PhD School of Computer Science Visiting Professor Open staff member portrait in a modal window d.sudholt@sheffield.ac.uk Full contact details Dr Dirk Sudholt School of Computer Science Orcid ID:0000-0001-6020-1646 Google Scholar Personal website Profile Until September 2020 I was a Senior Lecturer at the University of Sheffield in the Department of Computer Science, heading the newly established Algorithms research group.  Before coming to Sheffield, I obtained my Diploma and my Ph.D. from the Technische Universität Dortmund under the supervision of Prof. Ingo Wegener. I have held postdoc positions at the International Computer Science Institute (ICSI) in Berkeley, California, in the group of Prof. Richard M. Karp as well as the University of Birmingham, working with Prof. Xin Yao in the SEBASE project. Research interests I am interested in randomised algorithms, algorithmic analysis, and combinatorial optimisation. My main expertise is the analysis of bio-inspired search heuristics such as evolutionary algorithms, ant colony optimisation, particle swarm optimisation as well as hybrid and parallel variants thereof. I am interested in rigorous analyses of their optimisation time: the expected time until a search heuristic finds a satisfactory solution for an interesting problem.Such studies give insight into the working principles of bio-inspired search heuristics. They tell us how effective these metaheuristics are in comparison to problem-specific algorithms and how design choices such as the choice of operators and parameters affect performance. This helps practitioners to make informed design choices and contributes to a rigorous theoretical foundation of metaheuristics. Publications Journal articles Nguyen PTH & Sudholt D (2020) Memetic algorithms outperform evolutionary algorithms in multimodal optimisation. Artificial Intelligence, 287. View this article in WRRO Sudholt D (2020) Analysing the robustness of evolutionary algorithms to noise : refined runtime bounds and an example where noise is beneficial. Algorithmica. View this article in WRRO Lehre PK & Sudholt D (2019) Parallel black-box complexity with tail bounds. IEEE Transactions on Evolutionary Computation. View this article in WRRO Oliveto PS, Sudholt D & Zarges C (2019) On the benefits and risks of using fitness sharing for multimodal optimisation. Theoretical Computer Science, 773, 53-70. View this article in WRRO Covantes Osuna E & Sudholt D (2019) Runtime Analysis of Crowding Mechanisms for Multimodal Optimisation. IEEE Transactions on Evolutionary Computation. View this article in WRRO Sudholt D & Witt C (2019) On the Choice of the Update Strength in Estimation-of-Distribution Algorithms and Ant Colony Optimization. Algorithmica, 81(4), 1450-1489. View this article in WRRO Nallaperuma S, Oliveto PS, Perez Heredia J & Sudholt D (2019) On the Analysis of Trajectory-Based Search Algorithms: When is it Beneficial to Reject Improvements?. Algorithmica, 81(2), 858-885. View this article in WRRO Doerr C & Sudholt D (2019) Preface to the Special Issue on Theory of Genetic and Evolutionary Computation. Algorithmica, 81(2), 589-592. Covantes Osuna E, Gao W, Neumann F & Sudholt D (2018) Design and Analysis of Diversity-Based Parent Selection Schemes for Speeding Up Evolutionary Multi-objective Optimisation. Theoretical Computer Science. View this article in WRRO Covantes Osuna E & Sudholt D (2018) On the Runtime Analysis of the Clearing Diversity-Preserving Mechanism. Evolutionary Computation. View this article in WRRO Kötzing T & Sudholt D (2017) Preface to the Special Issue on Theory of Genetic and Evolutionary Computation. Algorithmica, 1-4. Oliveto PS, Paixão T, Pérez Heredia J, Sudholt D & Trubenová B (2017) How to Escape Local Optima in Black Box Optimisation: When Non-elitism Outperforms Elitism. Algorithmica. View this article in WRRO Dang D-C, Friedrich T, Kötzing T, Krejca M, Lehre PK, Oliveto PS, Sudholt D & Sutton AM (2017) Escaping Local Optima Using Crossover with Emergent Diversity. IEEE Transactions on Evolutionary Computation, 22(3), 484-497. View this article in WRRO Paixao T, Perez Heredia J, Sudholt D & Trubenova B (2017) Towards a Runtime Comparison of Natural and Artificial Evolution. Algorithmica, 78(2), 681-713. View this article in WRRO Corus D, He J, Jansen T, Oliveto PS, Sudholt D & Zarges C (2017) On Easiest Functions for Mutation Operators in Bio-Inspired Optimisation. Algorithmica, 78(2), 714-740. View this article in WRRO Sudholt D (2017) How Crossover Speeds up Building Block Assembly in Genetic Algorithms. Evolutionary Computation, 25(2), 237-274. View this article in WRRO Perez Heredia J, Trubenova B, Sudholt D & Paixao T (2017) Selection limits to adaptive walks on correlated landscapes. Genetics, 205(2), 803-825. View this article in WRRO Moraglio A & Sudholt D (2017) Principled Design and Runtime Analysis of Abstract Convex Evolutionary Search. Evolutionary Computation, 25(2), 205-236. View this article in WRRO Nallaperuma S, Neumann F & Sudholt D (2016) Expected Fitness Gains of Randomized Search Heuristics for the Traveling Salesperson Problem. Evolutionary Computation, 25(4), 673-705. View this article in WRRO Mambrini A & Sudholt D (2015) Design and Analysis of Schemes for Adapting Migration Intervals in Parallel Evolutionary Algorithms. Evolutionary Computation, 23(4), 559-582. View this article in WRRO Kempka J, McMinn P & Sudholt D (2015) Design and analysis of different alternating variable searches for search-based software testing. Theoretical Computer Science, 605, 1-20. View this article in WRRO Paixão T, Badkobeh G, Barton N, Çörüş D, Dang D-C, Friedrich T, Lehre PK, Sudholt D, Sutton AM & Trubenová B (2015) Toward a unifying framework for evolutionary processes. Journal of Theoretical Biology, 383, 28-43. View this article in WRRO Lässig J & Sudholt D (2014) General Upper Bounds on the Runtime of Parallel Evolutionary Algorithms. Evolutionary Computation, 22(3), 405-437. View this article in WRRO Minku LL, Sudholt D & Yao X (2014) Improved evolutionary algorithm design for the project scheduling problem based on runtime analysis. IEEE Transactions on Software Engineering, 40(1), 83-102. Doerr B, Jansen T, Sudholt D, Winzen C & Zarges C (2013) Mutation rate matters even when optimizing monotonic functions. Evolutionary Computation, 21(1), 1-27. Rowe JE & Sudholt D (2013) The choice of the offspring population size in the (1, λ) evolutionary algorithm. Theoretical Computer Science. Doerr B, Sudholt D & Witt C (2013) When do evolutionary algorithms optimize separable functions in parallel?. FOGA 2013 - Proceedings of the 12th ACM Workshop on Foundations of Genetic Algorithms, 51-63. Lässig J & Sudholt D (2013) Design and analysis of migration in parallel evolutionary algorithms. Soft Computing, 17(7), 1121-1144. Sudholt D & Thyssen C (2012) Running time analysis of ant colony optimization for shortest path problems. Journal of Discrete Algorithms, 10(1), 165-180. Sudholt D & Thyssen C (2011) A Simple Ant Colony Optimizer for Stochastic Shortest Path Problems. Algorithmica (New York), 1-30. Sudholt D (2011) A New Method for Lower Bounds on the Running Time of Evolutionary Algorithms. CoRR, abs/1109.1504. Doerr B, Neumann F, Sudholt D & Witt C (2011) Runtime analysis of the 1-ANT ant colony optimizer. Theoretical Computer Science, 412(17), 1629-1644. Sudholt D (2011) Hybridizing evolutionary algorithms with variable-depth search to overcome local optima. Algorithmica (New York), 59(3), 343-368. Sudholt D & Thyssen C (2011) Running time analysis of Ant Colony Optimization for shortest path problems. Journal of Discrete Algorithms. Sudholt D & Witt C (2010) Runtime analysis of a binary particle swarm optimizer. THEORETICAL COMPUTER SCIENCE, 411(21), 2084-2100. Jansen T & Sudholt D (2010) Analysis of an Asymmetric Mutation Operator. EVOLUTIONARY COMPUTATION, 18(1), 1-26. Sauerwald T & Sudholt D (2010) A self-stabilizing algorithm for cut problems in synchronous networks. Theoretical Computer Science, 411(14-15), 1599-1612. Neumann F, Sudholt D & Witt C (2009) Analysis of different MMAS ACO algorithms on unimodal functions and plateaus. Swarm Intelligence, 3(1), 35-68. Sudholt D (2009) The impact of parametrization in memetic evolutionary algorithms. Theoretical Computer Science, 410(26), 2511-2528. Friedrich T, Oliveto PS, Sudholt D & Witt C (2009) Analysis of diversity-preserving mechanisms for global exploration.. Evol Comput, 17(4), 455-476. Book chapters Sudholt D (2020) The Benefits of Population Diversity in Evolutionary Algorithms: A Survey of Rigorous Runtime Analyses, Natural Computing Series (pp. 359-404). Springer International Publishing Sudholt D (2015) Parallel Evolutionary Algorithms In Kacprzyk J & Pedrycz W (Ed.), Springer Handbook of Computational Intelligence (pp. 929-959). Berlin: Springer. Sudholt D (2012) Parametrization and balancing local and global search (pp. 55-72). Sudholt D (2011) Memetic Evolutionary Algorithms In Auger A & Doerr B (Ed.), Theory of Randomized Search Heuristics (pp. 141-169). World Scientific Publishing Company Neumann F, Sudholt D & Witt C (2009) Computational complexity of ant colony optimization and its hybridization with local search (pp. 91-120). Conference proceedings Hall GT, Oliveto PS & Sudholt D (2020) Analysis of the performance of algorithm configurators for search heuristics with global mutation operators. Proceedings of the 2020 Genetic and Evolutionary Computation Conference Oliveto PS, Sudholt D & Witt C (2020) A tight lower bound on the expected runtime of standard steady state genetic algorithms. Proceedings of the 2020 Genetic and Evolutionary Computation Conference View this article in WRRO Foster M, Hughes M, O'Brien G, Oliveto PS, Pyle J, Sudholt D ",
  "content_length": 26880,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:57"
}