{
  "name": "Dirk Beyer 0001",
  "homepage": "https://www.sosy-lab.org/people/beyer",
  "status": "success",
  "content": "Prof. Dr. Dirk Beyer, LMU Munich Prof. Dr. Dirk Beyer Full Professor, Head of Research Chair (Lehrstuhlinhaber) Software and Computational Systems Lab Department of Computer Science Ludwig-Maximilians-Universität München (LMU Munich) Oettingenstraße 67 80538 Munich (Germany) OfficeRoom 062, Oettingenstr. 67 Office hoursWed 10-11 (by appointment) Phone+49 89 2180 9151 E-Mailfirstname.lastname@lmu.de ORCID 0000-0003-4832-7662 GPG-Key Please send me encrypted mails! My GPG key: 0xFA7541D4 Fingerprint: D01F 72A6 EF21 E258 BEF5 2D02 96A2 AE57 FA75 41D4 Personals Publications, DBLP, Google Scholar, ORCID, Semantic Scholar, Dimensions, ACM Biographical sketch Curriculum vitae You can also follow me on Facebook and Twitter/X. NEW State of the Art in Software Verification and Witness Validation: SV-COMP 2024 (TACAS 2024) Bridging Hardware and Software Analysis with Btor2C: A Word-Level-Circuit-to-C Translator (TACAS 2023) Competition on Software Verification and Witness Validation: SV-COMP 2023 (TACAS 2023) Software Testing: 5th Comparative Evaluation: Test-Comp 2023 (FASE 2023) Decomposing Software Verification into Off-the-Shelf Components: An Application to CEGAR (ICSE 2022) Research I am one of the PIs of the Research Training Group ConVeY (DFG-Graduiertenkolleg). My research focuses on models, algorithms, and tools for the construction and analysis of reliable software systems, in particular: Interfaces for component-based design (download Chic) Software model checking and static analysis (download CPAchecker, BLAST, CSIsat) Structure analysis and comprehension of large systems (download CrocoPat or CCVisu) Formal verification of real-time systems (download Rabbit) Service 6th Intl. Competition on Software Testing (Test-Comp '23) 13th Intl. TACAS Competition on Software Verification (SV-COMP '23) ETAPS 2022 General Co-Chair PC Chair: VMCAI 2020 (Jan 19-21, 2020, New Orleans, USA) 4th Intl. Workshop on CPAchecker (CPA '19) PC Chair: TACAS 2018 CAV 2015 Workshops ... more organization and program committees Teaching Courses offered: current term, next term ... more People Team Information for prospective students Technical hints for writing a paper Software that I use Software BenchExec: Reliable Benchmarking and Resource Measurement BLAST: Model Checking of Software CCVisu: Visual Clustering and Software-Structure Assessment CheckDep: Tracking Software Dependencies Chic: Checking Interface Compatibility CPAchecker: Configurable Software Verification CrocoPat: Relational Programming (for Software-Structure Analysis) CSIsat: Interpolation for LA+EUF DepDigger: Detecting Complex Low-Level Dependencies JavaSMT: A Unified Interface for SMT Solvers in Java Rabbit: Verification of Real-Time Systems ... more",
  "content_length": 2744,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:50"
}