{
  "name": "Dirk Koch",
  "homepage": "https://www.research.manchester.ac.uk/portal/dirk.koch.html",
  "status": "success",
  "content": "Dirk Koch - Research Explorer The University of Manchester Dirk Koch Dr Senior Lecturer, Advanced Processor Technology https://orcid.org/0000-0002-2568-4432 Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research Beacons, Institutes and PlatformsDigital FuturesInstitute for Data Science and AI Fingerprint Dive into the research topics where Dirk Koch is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Reconfiguration Computer Science 100% Field Programmable Gate Arrays Engineering 46% OpenCL Computer Science 35% High Level Synthesis Computer Science 30% Physical Implementation Computer Science 24% SIMD Computer Science 23% Computer Aided Design Computer Science 23% Stream Processing Computer Science 20% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 40 Conference contribution 6 Article 5 Paper 3 Chapter 8 More 2 Book 2 Other 1 Anthology 1 Scholarly edition 1 Abstract 1 Letter Research output per year Research output per year Analysis of Process Variation Within Clock Regions of AMD-Xilinx UltraScale+ DevicesBabaei, B. & Koch, D., 12 Mar 2024, Applied Reconfigurable Computing. Architectures, Tools, and Applications: 20th International Symposium, ARC 2024, Aveiro, Portugal, March 20–22, 2024, Proceedings. Skliarova, I., Jiménez, P. B., Véstias, M. & Diniz, P. C. (eds.). Cham: Springer Cham, p. 193-209 17 p. (Lecture Notes in Computer Science; vol. 14553).Research output: Chapter in Book/Conference proceeding › Chapter › peer-review Process Variation 100% Interconnects 33% Experimental Finding 33% Feature Size 33% Semiconductor Device 33% byteman: A Bitstream Manipulation Framework.Manev, K., Powell, J., Mätas, K. & Koch, D., 2022.Research output: Contribution to conference › Paper › peer-review Reconfiguration 100% Application Specific Integrated Circuit 33% Parsing 33% Resource Pooling 33% Assemblers 33% FPL Demo: Runtime Stream Processing with Resource-Elastic Pipelines on FPGAsMätas, K., Manev, K., Powell, J. & Koch, D., 2022, (Accepted/In press).Research output: Contribution to conference › Other › peer-review FPL Demo: FPGA Bitstream Virus Scanning.Powell, J., Mätas, K., Manev, K. & Koch, D., 2022, (Accepted/In press).Research output: Contribution to conference › Other › peer-review How to shrink my FPGAs: Optimizing Tile Interfaces and the Configuration Logic in FABulous FPGA FabricsChung, K. L., Dao, N., Yu, J. & Koch, D., 13 Feb 2022, FPGA 2022 : Proceedings of the 2022 ACM/SIGDA International Symposium on Field-Programmable Gate Arrays. New York: Association for Computing Machinery, p. 13-23 11 p. (FPGA 2022 - Proceedings of the 2022 ACM/SIGDA International Symposium on Field-Programmable Gate Arrays).Research output: Chapter in Book/Conference proceeding › Chapter › peer-review Open Access Power Consumption 100% Physical Design 100% Configuration Bit 100% Storage Configuration 100% Memory Configuration 100% View all 62 research outputs Projects 1 Finished 1 Active Projects per year Centre for Digital Trust and SocietyBarrett, E. (PI), Allmendinger, R. (Researcher), Elliot, M. (Researcher), Lord, N. (Researcher), Cordeiro, L. (Researcher), Gibson, R. (Researcher), Papamarkou, T. (Researcher), Dresner, D. (Researcher), Aldridge, J. (Researcher), Duncan, P. (Researcher), Banach, R. (Researcher), Brown, G. (Researcher), Dennis, L. (Researcher), Fisher, M. (Researcher), Korovin, K. (Researcher), Kotselidis, C.-E. (Researcher), Luján, M. (Researcher), Mustafa, M. (Researcher), Olivier, P. (Researcher), Reger, G. (Researcher), Zhang, N. (Researcher), Hodgkinson, G. (Researcher), Gulati, S. (Researcher), Ainsworth, J. (Researcher), Chen, Y.-W. (Researcher), Green, B. (Researcher), Healey, M. (Researcher), Uyarra, E. (Researcher), Zachariadis, M. (Researcher), Little, C. (Researcher), Mackey, E. (Researcher), Nenadic, G. (Researcher), Keane, J. (Researcher), Shlomo, N. (Researcher), Graff, N. (Researcher), Jarwar, M. A. (Researcher), Shariati Samani, S. (Researcher), Smith, D. (Researcher), Kambites, M. (Researcher), Thorpe, M. (Researcher), Rowley, P. (Researcher), Flynn, S. (Researcher), Turner, P. (Researcher), Wainwright, V. (Researcher), Czerwinsky, A. (PGR student), Nini, A. (Researcher), Broad, R. (Researcher), Shute, J. (Researcher), Deakin, J. (Researcher), Taboada, P. (PGR student), Knight, P. (Researcher), Hutchings, S. (Researcher), Whyte, J. (Researcher), Tolz-Zilitinkevic, V. (Researcher), Pilkington, H. (Researcher), Guharoy, S. (Researcher), Nicolo, A. (Researcher), Reggiani, C. (Researcher), Garcia Oliva, J. (Researcher), Van Someren, A. (Researcher), Bon, E. (Researcher), Cantijoch Cunill, M. (Researcher), Koch, D. (Researcher) & Chen, Y.-W. (Researcher)11/05/21 → …Project: Other Social Statistics 100% Computer Science 100% Interdisciplinary Research 100% Social Research 100% Business School 100% EPSRC Programme Grant - Functional Oxide Reconfigurable TechnologiesKoch, D. (PI) & Dudek, P. (CoI)1/01/18 → 30/06/23Project: Research Program 100% Science and Technology 100% Oxide 100% Grant 100% University 100%",
  "content_length": 5679,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:53"
}