{
  "name": "Dirk Henri Nowotka",
  "homepage": "https://www.zs.informatik.uni-kiel.de/en/team/nowotka",
  "status": "success",
  "content": "Zuverlässige Systeme Die Arbeitsgruppe Zuverlässige Systeme beschäftigt sich mit formalen Methoden zur Fehlerentdeckung und -vermeidung in Hard- und Softwaresystemen.Insbesondere liegen unsere Forschungsschwerpunkte auf den Gebieten der formalen Spezifikation und Verifikation von Systemen, der Modellprüfung, der Erfüllbarkeitsprobleme diverser Logiken und der Untersuchung kombinatorischer Probleme auf sequenziellen Strukturen. Prof. Dr. Dirk Nowotkadirk.nowotka@informatik.uni-kiel.de+49 431 880-4199Christian-Albrechts-Platz 424118 KielRaum: 1308 (CAP 4) Untersuchung und Entwicklung von Techniken für autonomes Fahren in spezifischen Anwendungsszenarien wie Flughäfen (AirPortMover) und ländlichen Gebieten (NAF-BUS). Der Fokus liegt auf der Anpassung und Optimierung autonomer Fahrkonzepte an unterschiedliche infrastrukturelle und verkehrstechnische Bedingungen. Erforschung von Entwicklungsprozessen, Methoden und Werkzeugen für sicherheitskritische Multicore-Systeme, insbesondere in den Bereichen Automotive, Bahn- und Luftfahrttechnik (ARAMiS II). Ziel ist es, die Verlässlichkeit und Sicherheit dieser Systeme durch verbesserte Software-Architekturen und Parallelisierungsansätze zu gewährleisten. Entwicklung und Implementierung hochparalleler Verfahren zur Simulation und statischen Analyse eingebetteter Systeme mit mehreren Rechenkernen (HPSV). Diese Verfahren zielen darauf ab, die Zuverlässigkeit und Effizienz bei der Verifikation komplexer, nebenläufiger Anwendungen, insbesondere in der Automobilindustrie, zu steigern. Forschung an grundlegenden Problemen der Wortkombinatorik und deren algorithmischen Anwendungen, wie z. B. in der Datenkompression und Kryptographie (DFG-Projekte). Dabei liegt ein besonderer Schwerpunkt auf der Untersuchung von Wortmorphismen und der Entwicklung von Algorithmen zur Verarbeitung sequenzieller Daten. Einbindung statischer Code-Analysen in die Entwicklung sicherheitskritischer, eingebetteter Systeme mit Multicore-Architekturen (ASSUME). Ziel ist es, durch die Integration dieser Analysen in den Entwicklungsprozess, die Sicherheit und Verlässlichkeit von Systemen in der Mobilitätsbranche zu erhöhen. Aktuelle Forschung der ArbeitsgruppeCAPTN (FördeAreal, Förde5G, Flex, XFerry, DesignLab)KI-AnwendungszentrumDatencampusKI2ELCHAIDFG - Boundaries of Computability in Problems on Words Abgeschlossene Forschungsprojekte AirportMoverAODNAF-BusHPSVASSUMEARAMiS 1 und 2DFG - Kombinatorische Aspekte von Wörtern und deren AnwendungenDFG - Heisenberg ProfessurStipendium der Finnischen Akademie Themen für Abschlussarbeiten oder Projekte in der Arbeitsgruppe Zuverlässige Systeme findet ihr auf der entsprechenden Unterseite. Bitte geben Sie einen Suchbegriff ein Suche: Gefunden auf Seite Pressemitteilungen & News Veranstaltungen Weitere Treffer ALLE ERGEBNISSE AUFRUFEN Keine Ergebnisse Nicht fündig geworden? Hier geht es zur Personen- und Einrichtungssuche über univIS Datenschutzerklärung Notwendige Cookies Statistiken Wir verwenden Cookies, um Funktionen unserer Webseiten zur Verfügung zu stellen und Zugriffsstatistiken zu erstellen. Mehr zu unserem Datenschutz Alle akzeptieren Nur essentielle Cookies akzeptieren Speichern und schließen Datenschutz",
  "content_length": 3214,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:53"
}