{
  "name": "Dittaya Wanvarie",
  "homepage": "http://pioneer.netserv.chula.ac.th/~wdittaya",
  "status": "success",
  "content": "Dittaya Wanvarie Dittaya Wanvarie My research interests are mainly in natural language processing and information retrieval. However, I'm also active in designing solution architectures on a public cloud. Contact Office Room 1309/22 Mahavajirunhis Bld. Department of Mathematics and Computer Science, Faculty of Science, Chulalongkorn university, Thailand. 10300. Email Dittaya dot W at chula dot ac dot th CV CV Courses Present 2301357/2302794 Architecting on the cloud Archives 2301494 Special Topics in Computer Science II. (Deep learning) 2301371 Operating Systems. 2017 2301552 Principles of Data Structures and Algorithms 2016 2301170 Computer and Programming. (Python programming) 2016 2301491 Special Topics in Computer Science. (Machine learning) 2014-2015 2301274 Computer Systems. 2013,2015-2016 2301379 Theory of Computation. 2012-2015 2301170 Computer and Programming. (C programming) Badges Recent publications Journal papers Phanthakan Kiatphaisansophon, Dittaya Wanvarie, Nagul Cooharojananone. Efficient Text Bounding Box Identification Using Mask R-CNN: Case of Thai Documents. IEEE Access. (2024) Volume 12, 1 April 2024, pp. 49306 - 49328. Pantira Chinsuwan, Wilawan W.Wilodjananunt, Dittaya Wanvarie, Nithipun Suksumek, Kullasate Sakpichaisakul, Thitiwan Simasathien, Charcrin Nabangchang, Piradee Suwanpakdee. Feasibility of mobile phone application \"Epilepsy care\" for self-management of children and adolescents with epilepsy in Phramongkutklao hospital: A randomized controlled trial. Epilepsy & Behavior. (2024) Volume 151, 109598. Yiping Jin, Akshay Bhatia, Dittaya Wanvarie, Phu T. V. Le. Towards improving coherence and diversity of slogan generation. Natural Language Engineering. (2023) Volume 29, Issue 2, March 2023, pp. 254 - 286. [Local archive] Yiping Jin, Dittaya Wanvarie, Phu T. V. Le. Learning from Noisy Out-of-Domain Corpus Using Dataless Classification. Natural Language Engineering. (2022) Volume 28, Issue1, January 2022, pp. 39 - 69. [Local archive and accompanying dataset] Pimarn Kantithammakorn, Proadpran Punyabukkana, Ploy N. Pratanwanich, Solaphat Hemrungrojn, Chaipat Chunharas, Dittaya Wanvarie. Using Automatic Speech Recognition to Assess Thai Speech Language Fluency in the Montreal Cognitive Assessment (MoCA). Sensors. (2022) Volume 22, Issue 4, pp. 1583. Suppat Metarugcheep, Proadpran Punyabukkana, Dittaya Wanvarie, Solaphat Hemrungrojn, Chaipat Chunharas, Ploy N. Pratanwanich. Selecting the Most Important Features for Predicting Mild Cognitive Impairment from Thai Verbal Fluency Assessments. Sensors. (2022) Volume 22, Issue 15, pp. 5813. Conference papers Gun Wirojburapa, Dittaya Wanvarie. Dementia Detection Using Transfer Learning from Recorded Speech. KST (2025). Naphatta Chinaksorn, Dittaya Wanvarie. LLM-RAG for Financial Question Answering: A Case Study from SET50. ICAIIC (2025). Pravee Kruachottikul, Pinnaree Tea-makorn, Nagul Cooharojananone, Atiwong Suchato, Lunchakorn Wuttisittikulkij, Dittaya Wanvarie, Natawut Nupairoj, Kittikul Kovitanggoon, Napat Cheetanom, Gridsada Phanomchoeng. Designing ChulaVerse: A Virtual World for Sustainable Community Engagement. ITHET (2024). Tse Lin Liu, Dittaya Wanvarie. Enhancing Financial Market Predictions in Taiwan: A Hybrid Approach of Traditional Analysis and Machine Learning Techniques. TIMES-iCON (2024). Wiput Thirapanish, Pittipol Kantavat, Dittaya Wanvarie, Ekapol Chuangsuwanich, Proadpran Punyabukkana. Evaluating Machine Learning-Based Feature Selection Methods for Diagnosing Parkinson's Disease under the SVM Framework. ICAIBD (2024) pp. 409 - 415. Sirawit Tantiphuwanart, Nuengwong Tuaycharoen, Dittaya Wanvarie, Naruemon Pratanwanich, Atiwong Suchato. Performance Improvement on a Learning Assessment Web Application Using AWS DynamoDB as a Cache Database. JCSSE (2023). Supagid Gidvarowart, Atiwong Suchato, Dittaya Wanvarie, Naruemon Pratanwanich, Nuengwong Tuaycharoen. Automated API Testing with Karate Framework: A Case Study of an Online Assessment Web Application. JCSSE (2023). Tatchanon Srisamudh, Atiwong Suchato, Dittaya Wanvarie, Naruemon Pratanwanich, Nuengwong Tuaycharoen. Automatic User Interface Testing for Web Application with Cypress Framework: A Case Study of an Online Assessment Web Application. NCCIT (2023). Watcha Sasawattakul, Atiwong Suchato, Dittaya Wanvarie, Naruemon Pratanwanich, Nuengwong Tuaycharoen. Design and Development of the Back-End System for an Online Learning Assessment Platform. ANSCSE (2023). Subtawee Hanyut, Nuengwong Tuaycharoen, Naruemon Pratanwanich, Dittaya Wanvarie, Atiwong Suchato. Cost-Sensitive Cloud Architecture for an Online Assessment Web Application. ANSCSE (2023). All publication list List Others LaTeX stuffs ฑิตยา หวานวารี. เอกสารอบรมการใช้ LaTeX 17 กันยายน 2565 <Overleaf> แบบฝึกหัด ฑิตยา หวานวารี. เอกสารแนะนำการใช้ LaTeX กับภาษาไทย <source> <Overleaf> ฑิตยา หวานวารี. ตัวอย่างการสร้างสไลด์ภาษาไทยด้วย LaTeX Beamer แบบออนไลน์โดยใช้ Overleaf ฑิตยา หวานวารี. เอกสารการอบรมการใช้ LaTeX สำหรับจัดทำเอกสารทางวิชาการ. ภาควิชาคณิตศาสตร์และวิทยาการคอมพิวเตอร์ คณะวิทยาศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย. 9 สิงหาคม 2559. <source> <Overleaf> บุญฤทธิ์ อินทิยศ. การใช้ Beamer บน LaTeX สำหรับเรียงพิมพ์สไลด์นำเสนอ. ภาควิชาคณิตศาสตร์และวิทยาการคอมพิวเตอร์ คณะวิทยาศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย. 9 สิงหาคม 2559.",
  "content_length": 6131,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:55"
}