{
  "name": "Djedjiga Mouheb",
  "homepage": "https://www.ift.ulaval.ca/departement-et-professeurs/professeurs-et-personnel/professeurs-reguliers/fiche/djedjiga-mouheb",
  "status": "success",
  "content": "Informatique et génie logiciel - Faculté des sciences et de génie - Université Laval Aller au contenu principal Informatique et génie logiciel Le savoir en technologies et en sciences de l'information à votre portée Internet et applications Web, systèmes d'information organisationnels, multimédias et jeux vidéo, systèmes intelligents, affaires électroniques, sécurité informatique; autant de domaines de pointe qui promettent des défis captivants. De plus, participez à des compétitions enlevantes grâce au récent laboratoire en sécurité informatique! Du côté de la recherche, nos professeures et professeurs chapeautent de nombreuses étudiantes et étudiants aux cycles supérieurs qui travaillent sur des projets de recherche captivants, en plus de poursuivre la recherche de multiples domaines d’avenir, comme l’intelligence artificielle ou la robotique. Département d'informatique et de génie logiciel Pavillon Adrien-Pouliot, local 3907 1065, avenue de la Médecine Université Laval, Québec (Québec), Canada G1V 0A6 418 656-7979 (sans frais: 1-888-569-7979) info@ift.ulaval.ca Notre équation humaine Babillard Aller plus loin Actualités en informatique et génie logiciel Nadia Tawbi ing., directrice du Département Découvrir les professeures et professeurs Découvrez la direction et le personnel Emplois disponibles Découvrez les postes ouverts de professeures et professeurs ou déposez une candidature spontanée. Album photos Découvrez le Département d'informatique et de génie logiciel en images! Stagiaires postdoctoraux Consultez les offres disponibles et les conditions d'admission de nos stages postdoctoraux. Prix Pierre-Ardouin Découvrez nos équipes lauréates et nos équipes finalistes sur cette page. Liens utiles Intranet PIXEL : Retrouvez la liste des plans de cours, les horaires d'examens, les disponibilités des enseignantes et enseignants et plus encore. CARÉ : Centre d'appui à la réussite étudiante CRTI : Centre de relève en technologies de l'information Séminaires du Département d'informatique et de génie logiciel Comités de programmes du Département d'informatique et de génie logiciel Pour de l'aide à l'admission et au cheminement académique, visitez la page de la gestion des études. Liste de l'offre des cours par session Automne 2025 Hiver 2025 et Hiver 2026 Été 2025  et Été 2026 Liste des clubs étudiants Club de développement de jeux vidéo de l'UL Club de sécurité informatique Club Éco-numérique Club d'intelligence artificielle Véhicule autonome de l'Université Laval (VAUL) Liste des associations étudiantes 1er cycle 2e et 3e cycles ASETIN : Association des étudiantes et étudiants en informatique de l'Université Laval AGIL : Association des graduées et gradués en informatique de l'Université Laval ASETIIG : Association des étudiantes et étudiants intégrés en informatique et gestion de l'Université Laval AEGSEG : Association des diplômées et diplômés en sciences et génie de l'Université Laval AEGLO : Association des étudiantes et étudiants en génie logiciel de l'Université Laval AELIÉS : Association des étudiantes et des étudiants de Laval inscrits aux études supérieures AESGUL : Association des étudiantes et étudiants en sciences et génie de l'Université Laval CADEUL : Conféfération des associations étudiantes et étudiants de l'Université Laval Présentation du Département La réalisation de votre projet d'études à l'Université Laval commence ici. 1 Trouvez votre programme 2 Préparez votre dossier 3 Déposez votre demande 4 Faites le suivi de votre demande Questions Philanthropie 125 000 $ en bourses d’études pour les Premiers Peuples grâce à la Banque CIBC Études La période d’appréciation de l’enseignement est lancée! Prix et distinction Une présentation technique d'une étudiante se démarque à la 37e rencontre annuelle de la CMPNOQ Communauté facultaire Une image d'une équipe en génie chimique finaliste au concours Science Exposed 2025 Voir toutes les nouvelles Proposer une nouvelle",
  "content_length": 3945,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:01"
}