{
  "name": "Djellel Eddine Difallah",
  "homepage": "https://dedcode.github.io",
  "status": "success",
  "content": "Djellel Difallah Djellel Difallah Assistant Professor of Computer Science NYU Abu Dhabi News Research Publications Awards Teaching CV Blog Bio Djellel Difallah received his Ph.D. from the University of Fribourg (Switzerland). His research addresses the challenge of developing effective methods to reason over large, incomplete, and heterogeneous knowledge bases, aiming to enhance knowledge completeness and discovery for informed decision making. He focuses on knowledge graph completion, graph reasoning, and multimodal data integration employing diverse machine learning and human computation techniques. He was a Research Scientist at the Wikimedia Foundation and a Data Science Fellow at NYU CDS. Previously, Djellel was a Fulbright Fellow, Microsoft Research Intern, and Google Summer of Code participant. He is currently an Assistant Professor at NYU Abu Dhabi. News Latest news I am deeply honored to receive the NYU Abu Dhabi Palm Teaching Award for 2025. Latest news Paper accepted at KDD'25! \"WikiRAG: Revisiting wikidata KGC datasets with community updates and retrieval-augmented generation\" Paper accepted at SDM'24! \"XGExplainer: Robust evaluation-based explanation for graph neural networks\" Research Interests My research addresses the challenge of developing effective methods to reason over large, incomplete, and heterogeneous knowledge bases, aiming to enhance knowledge completeness and discovery to support informed decision-making. In an era of information overload, extracting reliable insights from noisy and fragmented knowledge sources is increasingly difficult. Navigating complex knowledge ecosystems requires the development of new methods to identify information gaps, integrate diverse data sources and modalities, and interpret the reasoning of AI models when applied to these knowledge bases. My approach emphasizes creating interpretable systems that adapt to evolving domain knowledge and integrate seamlessly into human-centric workflows. Specifically, my research focuses on the following technical challenges: Knowledge Graph Completion: Develop scalable, automated methods to identify and fill gaps in large knowledge bases, integrating textual content with structured, graph-based data representations to enhance data completeness. Graph Reasoning: Design systems that provide explicit reasoning paths derived from knowledge graphs to answer natural language queries, ensuring the answers are interpretable and grounded in the data. Multimodal Data Integration: Develop models and frameworks capable of effectively combining multiple modalities of data: graph, textual, relational, visual, and temporal, to improve various tasks such as knowledge completeness and question answering. More details can be found on my research statement for more information: Research Statement Other noteworthy projects OLTP-Bench OLTPBenchmark is a multi-threaded load generator. The framework is designed to be able to produce variable rate, variable mixture load against any JDBC-enabled relational database. The framework also provides data collection features, e.g., per-transaction-type latency and throughput logs. Awards NYU Abu Dhabi Palm Teaching Award, 2025 Best Computer Science PhD Thesis Award, University of Fribourg 2015 Fulbright Scholarship, 2009-2011 Talks Knowledge Discovery and Exploration with LLMs and Graph ML, AIE 2025 (NYU Abu Dhabi), Invited Talk. Machine-in-the-loop: A New Paradigm of Crowdsourcing for Wikipedia Editing, WSDM 2023 Crowd Science Workshop (Singapore), Invited Talk. Teaching Data Structures (CS-UH 1050) - Spring 2025 Special Topics in Computer Science: Big Data Systems (CS-UH 3260) - Fall 2024 Data Structures (CS-UH 1050) - Fall 2023 Special Topics in Computer Science: Big Data Systems (CS-UH 3260) - Spring 2023 Discrete Mathematics (CS-UH 1002) - Fall 2022 Discrete Mathematics (CS-UH 1002-001) - Fall 2021 Data Structures (CS-UH 1050) - Spring 2021 Data Mining (NYU Stern School of Business) - Spring 2019 - Adjunct Big Data Infrastructures (University of Fribourg) - Fall 2016 - Lecturer Data Science Seminar (University of Fribourg) - Fall 2015 - Lecturer Social computing (University of Fribourg) - 2011/2014 - Teaching Assistant My teaching statement is available here Professional Activities Senior Program Committee ICDM (Area Chair): 2023, 2024 CIKM (Research Track SPC): 2025, 2024, 2023 CIKM (Applied Research Track SPC): 2022, 2021, 2020 HCOMP (SPC): 2024 AAAI: 2023, 2024 Program Committee IEEE International Conference on Data Mining (ICDM): 2025, 2022, 2021, 2020, 2019, 2018 ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD): 2025, 2024, 2023, 2022, 2021, 2020, 2019, 2018, 2017 ACM International Conference on Information and Knowledge Management (CIKM): 2025, 2024, 2023, 2022, 2021, 2020, 2018, 2017 ACM Conference on Research and Development in Information Retrieval (SIGIR): 2025, 2024, 2023, 2022, 2021, 2020 ACM International Conference on Web Search and Data Mining (WSDM): 2025, 2024, 2023, 2022, 2021 The Web Conference (WWW): 2023, 2022, 2021, 2020, 2019, 2018, 2017 AAAI Conference on Artificial Intelligence (AAAI): 2022, 2021, 2020 IEEE International Conference on Data Engineering (ICDE): 2025, 2026 ACM International Conference on Management of Data (SIGMOD): 2025 Proceedings of the VLDB Endowment (PVLDB): 2026 AAAI Conference on Human Computation and Crowdsourcing (HCOMP): 2024, 2022, 2021, 2020, 2019 International Semantic Web Conference (ISWC): 2022, 2021, 2020, 2019 SIAM International Conference on Data Mining (SDM): 2022 Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD): 2025 The International AAAI Conference on Web and Social Media (ICWSM): 2018 The International Conference on Web Engineering (ICWE): 2016 International Conference on Social Informatics (SocInfo): 2022, 2020, 2019 Wiki Workshop: 2023, 2022, 2021 Wiki NLP Workshop: 2025 Conference Session Chair Session Chair: ICDM 2024, ISWC 2022, SIGIR 2021, KDD 2021 Editorial Board, Associate Editor Knowledge and Information Systems (KAIS) (Since Dec 2024) Journal Reviewer Distinguished Reviewers Board, ACM Transactions on the Web (Since Oct 2022)",
  "content_length": 6165,
  "method": "requests",
  "crawl_time": "2025-12-01 13:02:59"
}