{
  "name": "Dmitry Ilvovsky",
  "homepage": "https://www.hse.ru/staff/dilvovsky",
  "status": "success",
  "content": "Сотрудники - Ильвовский Дмитрий Алексеевич – Национальный исследовательский университет «Высшая школа экономики» В старых версиях браузеров сайт может отображаться некорректно. Для оптимальной работы с сайтом рекомендуем воспользоваться современным браузером.AAAАБBАБBАБBАААААОбычная версия сайтаКампус в МосквеСанкт-ПетербургНижний НовгородПермьВышка ОнлайнRUENВерсия для слабовидящихВерсия для слабовидящихЛичный кабинет сотрудника ВШЭПоискПоискРасширенный поискМенюВысшая школа экономикиНациональный исследовательский университет «Высшая школа экономики»О ВышкеПреподаватели и сотрудникиИльвовский Дмитрий АлексеевичRUENЛичный кабинет сотрудника ВШЭНайтиРасширенный поиск по сайту  Домашняя страницаПреподаваниеПубликации и исследованияОпыт работы В новостях Владение языкамианглийскийКонтактыТелефон:+7 (495) 772-95-90 27319 +7 (916) 569-70-22Адрес: АУК \"Покровский бульвар\", Покровский б-р, д. 11, каб. S902Время консультаций: 18:00 - 21:00РасписаниеSPIN РИНЦ: 3208-3161ORCID: 0000-0002-5484-372XResearcherID: D-9852-2014Scopus AuthorID: 55967196200Google ScholarРуководительКузнецов С. О.Версия для печатис публикациямис новостямиРаспечататьНашли опечатку?Выделите её, нажмите Ctrl+Enter и отправьте нам уведомление. Спасибо за участие!Сервис предназначен только для отправки сообщений об орфографических и пунктуационных ошибках.Ильвовский Дмитрий АлексеевичДоцент: Факультет компьютерных наук / Департамент анализа данных и искусственного интеллектаНаучный сотрудник: Факультет компьютерных наук / Международная лаборатория интеллектуальных систем и структурного анализа Начал работать в НИУ ВШЭ в 2011 году.Научно-педагогический стаж: 10 лет.  Домашняя страницаПреподаваниеПубликации и исследованияОпыт работы В новостяхOбразование и учёные степени2017Кандидат наук2010Специалитет: Московский авиационный институт, специальность «Прикладная математика и информатика», квалификация «Математик. Системный программист»Дополнительное образование / Повышение квалификации / СтажировкиКурс Applied Analytics using SAS Enterprise Miner. 2015 год. Курс Программирование на языке SAS. Часть 2. Методы обработки данных. 2015 год. Профессиональные интересыкомпьютерная лингвистикаанализ формальных понятийДостижения и поощрения Благодарность НИУ ВШЭ (январь 2024)Благодарность проректора НИУ ВШЭ (август 2021)Благодарность Факультета компьютерных наук НИУ ВШЭ (август 2017)Персональная надбавка ректора (2016–2017)Надбавка за академическую работу (2020–2021)Надбавка за публикацию в журнале из Списка А (и приравненном к нему научном издании) (2025–2026, 2024–2025, 2023–2024)Надбавка за публикацию в международном рецензируемом научном издании (2022–2023, 2021–2022, 2017–2019)Научный руководитель диссертационных исследованийна соискание учёной степени кандидата наук1Чернявский А. С. Модели и методы автоматического обнаружения, верификации и анализа недостоверной, искаженной и манипулятивной информации в текстовых данных, 20252Чернявский А. С. Применение глубоких нейросетевых моделей, учитывающих структурную лингвистическую информацию, в прикладных задачах анализа текстовых данных, 20253Чернявский А. С. Применение глубоких нейросетевых моделей, учитывающих структурную лингвистическую информацию, в прикладных задачах анализа текстовых данных (aспирантура: 4-й год обучения)Учебные курсы (2025/2026 уч. год)Автоматическая обработка текста (Бакалавриат; где читается: Факультет компьютерных наук направление: 01.03.02 Прикладная математика и информатика; 4-й курс, 1, 2 модуль)русMentor's Seminar (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02 Прикладная математика и информатика; 1-й курс, 1-4 модуль)АнгАрхив учебных курсовУчебные курсы (2024/2025 уч. год)Автоматическая обработка текста (Бакалавриат; где читается: Факультет компьютерных наук направление: 01.03.02 Прикладная математика и информатика; 4-й курс, 1, 2 модуль)русMentor's Seminar (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02 Прикладная математика и информатика; 1-й курс, 1-4 модуль)АнгУчебные курсы (2023/2024 уч. год)Автоматическая обработка текста (Бакалавриат; где читается: Факультет компьютерных наук направление: 01.03.02. Прикладная математика и информатика; 4-й курс, 1, 2 модуль)русMentor's Seminar (Магистратура; где читается: Факультет компьютерных наук направление: 01.04.02. Прикладная математика и информатика; 1-й курс, 1-4 модуль)Анг“Искренние коммуникации”, искусственный интеллект и креативные практики (Маго-лего; 3, 4 модуль)русУчебные курсы (2022/2023 уч. год)Автоматическая обработка текста (Бакалавриат; где читается: Факультет компьютерных наук направление: 01.03.02. Прикладная математика и информатика; 4-й курс, 1, 2 модуль)русУчебные курсы (2021/2022 уч. год)Автоматическая обработка текста (Бакалавриат; где читается: Факультет компьютерных наук направление: 01.03.02. Прикладная математика и информатика; 4-й курс, 1, 2 модуль)русSAS Technologies for Data Mining (Бакалавриат; где читается: Факультет экономических наук направление: 38.03.01. Экономика; 3-й курс, 3, 4 модуль)АнгSAS Technologies for Data Mining (Бакалавриат; где читается: Факультет компьютерных наук направление: 01.03.02. Прикладная математика и информатика, направление: 01.03.02. Прикладная математика и информатика, направление: 09.03.04. Программная инженерия; 3-й курс, 3, 4 модуль)АнгУчебные курсы (2020/2021 уч. год)Автоматическая обработка текста (Бакалавриат; где читается: Факультет компьютерных наук направление: 01.03.02. Прикладная математика и информатика; 4-й курс, 1, 2 модуль)русАнализ данных на платформе SAS (Факультатив; 1, 2 модуль)русРасписание занятий на сегодняРасписание занятий по физической культуре в спортивных секцияхПолное расписаниеКонференции2023ДИЗАЙН МЕЖДИСЦИПЛИНАРНЫХ ИССЛЕДОВАНИЙ В КОНТЕКСТЕ СБЛИЖЕНИЯ МОДЕЛЕЙ ЕСТЕСТВЕННО-НАУЧНОГО И ГУМАНИТАРНО- СОЦИАЛЬНОГО ЗНАНИЯ (Москва). Доклад: Искусственный интеллект как утилита базовой новостной грамотности2016Компьютерная лингвистика и интеллектуальные технологии (Диалог 22) (Москва). Доклад: Style and Genre Classification by Means of Deep Textual ParsingПятнадцатая национальная конференция по искусственному интеллекту с международным участием (КИИ-2016) (Смоленск). Доклад: Discovering disinformation: discourse-level approach20157th International Joint Conference on Natural Language Processing, ACL 2015 (Beijing). Доклад: Rhetoric Map of an Answer to Compound Queries.Recent Advances in Natural Language Processing, RANLP 2015 (Hissar). Доклад: Text Classification into Abstract Classes Based on Discourse StructureДиссертация на соискание учёной степени кандидата наук2017Ильвовский Д. А. Методы и алгоритмы обработки текстовых данных на основе графовых дискурсивных моделей2015Ильвовский Д. А. Модели, алгоритмы и программные комплексы обработки текстовых данных на основе решеток замкнутых описаний«Автоматизированная генерация и управление страницами Портала Госуслуг ХМАО-Югры на основе ИС «Реестр услуг»» Ильвовский Д.А. Тезисы VII Всероссийской конференции студентов, аспирантов и молодых учёных, Москва: Вузовская книга, 2010. [доклад конференции]ГрантыГрант Правительства Москвы с 2008 по 2010 г.Опыт работы2012 - н.в. -  Научно-учебная лаборатория интеллектуальных систем и структурного анализа  (Младший научный сотрудник) 2007 - н.в. - Эксперт отделения «Корпоративные Интернет-решения» компании ФОРС Центр разработки 22апр.2025ИИ в образовании: как преодолеть соблазн готовых решенийИскусственный интеллект уже стал обыденностью для молодежи: как показал опрос, около 87% студентов ведущих вузов используют ИИ в процессе обучения. Большая часть из них отметила, что он помогает им экономить время, при этом они проверяют сделанную ИИ работу. Результаты исследования были представлены на конференции по анализу данных и технологиям ИИ Data Fusion. В ее работе приняли участие научный руководитель НИУ ВШЭ Ярослав Кузьминов и другие эксперты Вышки. 23окт.2024От смеха до арестов: ИИ в мире шуток, манипуляций и неэтичного выбораИскусственный интеллект стремительно меняет мир, но на пути к будущему он все чаще сталкивается с нашими слабостями — от неудачных шуток и создания новостных фейков до вопиющих ошибок в правосудии. Как ошибается искусственный интеллект, почему не умеет шутить и можно ли его заставить быть более этичным по отношению к человеку, обсудили преподаватели факультета компьютерных наук с гостями в рамках первого барного лектория «ИИ всемогущий: изнанка сферы», запущенного ФКН НИУ ВШЭ с московским баром «Ровесник». 11окт.2024ФКН рассказал об особенностях использования ИИ на барном лектории в «Ровеснике»3 октября в баре «Ровесник» прошла первая встреча барного лектория факультета компьютерных наук. 27апр.2024На ФКН прошел митап по большим языковым моделям13 апреля факультет компьютерных наук НИУ ВШЭ и Сбер провели Митап по большим языковым моделям с участием представителей компаний-партнеров факультета. 1март2024AI Assists with Fact-Checking: HSE Scientists Streamline Information VerificationSpecialists at the HSE AI Research Centre have developed an AI-powered fact-checking assistant. This software solution will improve the quality of working with information, reduce the risks of errors and biases, and save both time and resources. A notable advantage of the program lies in its capability to process a wide variety of statement types. 20февр.2024ИИ поможет делать фактчекинг: ученые ВШЭ упростили процесс верификации информацииВ Центре ИИ НИУ ВШЭ разработали ассистента по проверке фактов. Программа позволит повысить качество работы с информацией, уменьшить риски ошибок и предубеждений, а также экономить время и ресурсы. Важным преимуществом программы является ее способность работать с различными типами утверждений. 24нояб.2023«Сегодня сделать большую языковую модель — это гигантский труд»С 22 по 24 ноября проходит международная онлайн-конференция в сфере технологий искусственного интеллекта AI Journey 2023. В ее работе приняли участие эксперты НИУ ВШЭ. В фокусе обсуждения — языковые модели и методы, которые пр",
  "content_length": 17042,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:04"
}