{
  "name": "Dmitriy Traytel",
  "homepage": "https://researchprofiles.ku.dk/en/persons/dmitriy-traytel",
  "status": "success",
  "content": "Dmitriy Traytel - University of Copenhagen Research Portal Dmitriy Traytel Associate Professor - Promotion Programme, Department of Computer Science, Software, Data, People & Society https://orcid.org/0000-0001-7982-2768 Phone+4524959831Emailtrayteldi.kudkWebsitehttps://traytel.bitbucket.io Sigurdsgade 412200 København N. Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 45 Article in proceedings 14 Journal article 1 Doctoral thesis Research output per year Research output per year Barendregt Convenes with Knaster and Tarski: Strong Rule Induction for Syntax with BindingsVan Brügge, J., McKinna, J., Popescu, A. & Traytel, D., 2025, In: Proceedings of the ACM on Programming Languages. 9, 32 p., 57.Research output: Contribution to journal › Journal article › Research › peer-review Open AccessFile 3 Citations (Scopus) 5 Downloads (Pure) Nondeterministic Asynchronous Dataflow in Isabelle/HOLSilva, R. C. G., Fernet, L. & Traytel, D., 2025, 16th International Conference on Interactive Theorem Proving, ITP 2025. Forster, Y. & Keller, C. (eds.). Schloss Dagstuhl - Leibniz-Zentrum für Informatik, 20 p. 30. (Leibniz International Proceedings in Informatics, LIPIcs, Vol. 352).Research output: Chapter in Book/Report/Conference proceeding › Article in proceedings › Research › peer-review Open AccessFile 1 Downloads (Pure) TimelyMon: A Streaming Parallel First-Order MonitorReese, L., Silva, R. C. G. & Traytel, D., 2025, Runtime Verification - 24th International Conference, RV 2024, Proceedings. Ábrahám, E. & Abbas, H. (eds.). Springer, p. 150-160 11 p. (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), Vol. 15191 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Article in proceedings › Research › peer-review File 20 Downloads (Pure) WHYMON: A Runtime Monitoring Tool with Explanations as VerdictsLima, L., Huerta y Munive, J. J. & Traytel, D., 2025, Automated Technology for Verification and Analysis - 22nd International Symposium, ATVA 2024, Proceedings. Akshay, S., Niemetz, A. & Sankaranarayanan, S. (eds.). Springer, p. 76-90 15 p. (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), Vol. 15055 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Article in proceedings › Research › peer-review Open AccessFile 15 Downloads (Pure) Explainable Online Monitoring of Metric First-Order Temporal LogicLima, L., Huerta y Munive, J. J. & Traytel, D., 2024, Tools and Algorithms for the Construction and Analysis of Systems - 30th International Conference, TACAS 2024, Held as Part of the European Joint Conferences on Theory and Practice of Software, ETAPS 2024, Proceedings. Finkbeiner, B. & Kovács, L. (eds.). Springer, p. 288-307 20 p. (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), Vol. 14570 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Article in proceedings › Research › peer-review Open AccessFile 3 Citations (Scopus) 24 Downloads (Pure) Proactive Real-Time First-Order EnforcementHublet, F., Lima, L., Basin, D., Krstić, S. & Traytel, D., 2024, Computer Aided Verification - 36th International Conference, CAV 2024, Proceedings. Gurfinkel, A. & Ganesh, V. (eds.). Springer, p. 156-181 (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), Vol. 14682 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Article in proceedings › Research › peer-review Open AccessFile 2 Citations (Scopus) 2 Downloads (Pure) Admissible Types-to-PERs Relativization in Higher-Order LogicPopescu, A. & Traytel, D., 2023, In: Proceedings of the ACM on Programming Languages. 7, POPL, 32 p., 42.Research output: Contribution to journal › Journal article › Research › peer-review Open AccessFile 4 Citations (Scopus) 41 Downloads (Pure) Correct and Efficient Policy Monitoring, a RetrospectiveBasin, D., Krstić, S., Schneider, J. & Traytel, D., 2023, Automated Technology for Verification and Analysis - 21st International Symposium, ATVA 2023, Proceedings. André, É. & Sun, J. (eds.). Springer, p. 3-30 (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), Vol. 14215 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Article in proceedings › Research › peer-review File 2 Citations (Scopus) 24 Downloads (Pure) View all 60 research outputs",
  "content_length": 4991,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:02"
}