{
  "name": "Dmitry Ponomarev 0001",
  "homepage": "http://www.cs.binghamton.edu/~dima",
  "status": "success",
  "content": "Dmitry Ponomarev Dmitry Ponomarev ProfessorAssociate Chair for Administration and Undergraduate Programs School of Computing Binghamton University Binghamton, NY 13902-6000 Office: Q-9, Engineering Building Phone: (607) 777-4023 E-mail: dponomar at binghamton dot edu PUBLICATIONS STUDENTS ARCHITECTURE FOR SECURITY LAB Dmitry Ponomarev is a Professor and Associate Chair for Administration and Undergraduate Programs in the School of Computing at Binghamton University. His research interests are in the areas of computer architecture, cybersecurity and high-performance computing. He received SUNY Chancellor's Award for Excellence in Scholarship and Creative Activities. Four of his PhD students have been recepients of Binghamton Graduate Student Award for Excellence in Research. He currently serves as an Associate Editor of ACM Transactions on Architecture and Code Optmization (ACM TACO), the Editor of ACM SIGARCH \"Computer Architecture Today\" blog, and is a co-PI of Binghamton's NSF Scholarship for Service program. News January 2025: BranchScope was selected as a Top Pick in Hardware and Embedded Security January 2025: Paper on secure caches for compartmentalized systems was accepted to USENIX Security 2025! Congratulations Kerem, Huaxin and Williams!! September 2023: Paper on secure cache hierarchies for TEEs accepted to NDSS'24! Congratulations Kerem, Williams, Abe and Jack!! March 2022: Our new NSF SFS program is about to start. More information, including details on how to apply, is here. March 2022: Composable cachelets paper accepted to USENIX Security 2022! Congratulations, Daniel and Kerem! Selected Recent Publications Google Scholar DBLP Secure Caches for Compartmentalized Software (USENIX Security'25) TEE-SHirtT: Scalable Leakage-Free Cache Hierarchies for TEEs (NDSS'24) Composable Cachelets: Protecting Enclaves from Cache Side-Channel Attacks (USENIX Security'22) Track Conventions, not Attack Signatures: Fortifying X86 ABI and System Call Interfaces to Mitigate Code Reuse Attacks (SEED'21) GVT-Guided Demand-Driven Scheduling in Parallel Discrete Event Simulation (ICPP'21) High-Performance PDES on Manycore Clusters (SIGSIM-PADS'21) Load-Aware Dynamic Time Synchronization in Parallel Discrete Event Simulation (SIGSIM-PADS'21) Port or Shim: Stress-Testing Application Performance on Intel SGX (IISWC'20) Demand-Driven PDES: Exploiting Locality in Simulation Models (SIGSIM-PADS'20) LATCH: A Locality-Aware Taint CHecker (MICRO'19) SMT-COP: Defeating Side-Channel Attacks on Execution Units in SMT Processors (PACT'19, Best paper nominee) Controlled Asynchronous GVT: Accelerating Parallel Discrete Event Simulation on Manycore Clusters (ICPP'19) How the Spectre and Meltdown Hacks Really Worked (IEEE Spectrum, 2019) SafeSpec: Banishing the Spectre of a Meltdown with Leakage-Free Speculation (DAC'19) BranchScope: A New Side-Channel Attack on Directional Branch Predictor (ASPLOS'18). Selected as a Top Pick in Hardware and Embedded Security, 2024. CVE-2018-9056 RHMD: Evasion-Resilient Hardware Malware Detectors (MICRO'17) RIC: Relaxed Inclusion Caches for Mitigating LLC Side-Channel Attacks (DAC'17) Covert Channels through Random Number Generator: Mechanisms, Capacity Estimation and Mitigations (CCS'16) Jump over ASLR: Attacking Branch Predictors to Bypass ASLR (MICRO'16, selected for Top Picks in Hardware and Embedded Security Workshop at ICCAD'18) Flexible Hardware-Managed Isolated Execution: Architecture, Software Support and Applications (TDSC'16, extended version of MICRO'14) A Hign-Resolution Side-Channel Attack on Last-Level Cache (DAC'16, \tBest paper nominee) Understanding and Mitigating Covert Channels through Branch Predictors (TACO'16) Hardware-based Malware Detection Using Low-Level Architectural Features (TC'16, extended version of HPCA'15) ACM SIGARCH Computer Architecture Today Blog Posts A Primer on Security Threats for Computer Architects Highlights of 2020 Security Conferences for Computer Architects Highlights of 2020 Security Conferences for Computer Architects, Part II Architecture and Hardware Security Research - Early 2021 Architecture and Hardware Security Research - Late 2021 Architecture and Hardware Security Research at USENIX Security Symposium 2022 Awards and Nominations Binghamton University's Watson School Recognition Award for Outstanding Faculty Service, 2020 Best paper nomination, International Conference on Parallel Architectures and Compilation Techniques (PACT), 2019 MICRO'16 paper selected for presentation at Top Picks in Hardware and Embedded Security Woskshop (at ICCAD'2018). Binghamton University's Watson School Recognition Award for Distinguished Educator, 2017 SUNY Chancellor's Award for Excellence in Scholarship and Creative Activities, 2016 Best paper nomination, Design Automation Conference (DAC), 2016 Distinguished Dissertation Award, Binghamton University, 2003 Graduate Student Award for Excellence in Research, Binghamton University, 2003 Graduate Student Award for Excellence in Teaching, Binghamton University, 2003 Research Interests Computer Architecture Architecture and Hardware Support for Security High-Performance Computing Current Courses (Fall 2024): CS-320     Computer Systems III: Advanced Computer Architecture Professional Service Associate Editor, ACM TACO (starting Fall 2021) Editor, ACM SIGARCH \"Computer Architecture Today\" Blog. Recent PC Service: ISCA'25, HPCA'25, ISCA'24, CCS'24, MICRO'24, ASPLOS'24, MICRO'23, ISCA'23, IEEE Micro TopPicks'23, HPCA'23, MICRO'22, SEED'22, ASPLOS'22, Top Picks in Hardware Security'22, MICRO'21, HASP'21, SEED'21, HOST'21, ICPP'21, HPCA'21, ASPLOS'21, MICRO'20, HASP'20, IEEE MICRO Top Picks'20, HOST'20, ICPP'20, HASP'19, ISCA'19, HPCA'19, MICRO'18 Recent ERC Service: ASPLOS'23, ISCA'22, ISCA'21, HPCA'20, HPCA'18",
  "content_length": 5804,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:05"
}