{
  "name": "Dmitri Loguinov",
  "homepage": "http://irl.cs.tamu.edu/people/dmitri",
  "status": "success",
  "content": "Dmitri Loguinov DEPARTMENT OF COMPUTER SCIENCE AND ENGINEERING | DWIGHT LOOK COLLEGE OF ENGINEERING | TEXAS A&M UNIVERSITY HOME ABOUT COURSES PEOPLE PROJECTS PUBLICATIONS CONTACT Dmitri Loguinov Professor Department of Computer Science and Engineering Texas A&M University College Station, TX 77843 dmitri@cs.tamu.edu, 979-845-0512 Education 10/2002 Ph.D. City University of New York (Computer Science) 6/1995 B.S. (with honors) Moscow State University (Computer Science) Research Interests Stochastic analysis of networks, graph algorithms, big-data computing, Internet measurement, peer-to-peer networks, congestion control, web crawling, topology modeling, and related topics Resume PDF PhD Thesis \"Adaptive Scalable Internet Streaming\" (PDF 286pp, single-spaced 187pp) Journal Publications Y. Cui, D. Xiao, D.B.H. Cline, and D. Loguinov, \"Improving I/O Complexity of Triangle Enumeration,\" IEEE Transactions on Knowledge and Data Engineering, vol. 34, no. 4, April 2022. PDF Z. Shamsi, D.B.H. Cline, and D. Loguinov, \"Faulds: A Non-Parametric Iterative Classifier for Internet-Wide OS Fingerprinting,\" IEEE/ACM Transactions on Networking, vol. 29, no. 5, October 2021. PDF X. Wang, D. Xiao, X. Li, D. Cline, and D. Loguinov, \"Consistent Sampling of Churn Under Periodic Non-Stationary Arrivals in Distributed Systems,\" ACM Transactions on Modeling and Performance Evaluation of Computing Systems, vol. 4, no. 4, December 2019. PDF Y. Cui, D. Xiao, and D. Loguinov, \"On Efficient External-Memory Triangle Listing,\" IEEE Transactions on Knowledge and Data Engineering, vol. 31, no. 8, August 2019. PDF Y. Cui, C. Sparkman, H.-T. Lee, and D. Loguinov, \"Unsupervised Domain Ranking in Large-Scale Web Crawls,\" ACM Transactions on the Web, vol. 12, no. 4, November 2018. PDF Z. Shamsi and D. Loguinov, \"Unsupervised Clustering Under Temporal Feature Volatility in Network Stack Fingerprinting,\" IEEE/ACM Transactions on Networking, vol. 25, no. 4, August 2017. PDF X. Li, D.B.H. Cline, and D. Loguinov, \"Temporal Update Dynamics under Blind Sampling,\" IEEE/ACM Transactions on Networking, vol. 25, no. 1, February 2017. PDF X. Li, D.B.H. Cline, and D. Loguinov, \"On Sample-Path Staleness in Lazy Data Replication,\" IEEE/ACM Transactions on Networking, vol. 24, no. 5, October 2016. PDF Z. Shamsi, A. Nandwani, D. Leonard, and D. Loguinov, \"Hershel: Single-Packet OS Fingerprinting,\" IEEE/ACM Transactions on Networking, vol. 24, no. 4, August 2016. PDF 2015 Z. Yao, D.B.H. Cline, and D. Loguinov, \"Unstructured P2P Link Lifetimes Redux,\" IEEE/ACM Transactions on Networking, vol. 23, no. 3, June 2015. PDF Z. Yao, D.B.H. Cline, X. Wang, and D. Loguinov, \"Unifying Models of Churn and Resilience for Unstructured P2P Graphs,\" IEEE Transactions on Parallel and Distributed Systems, vol. 25, no. 9, September 2014. PDF D. Leonard and D. Loguinov, \"Demystifying Internet-Wide Service Discovery,\" IEEE/ACM Transactions on Networking, vol. 21, no. 6, December 2013. PDF X. Wang, X. Li, and D. Loguinov, \"Modeling Residual-Geometric Flow Sampling,\" IEEE/ACM Transactions on Networking, vol. 21, no. 4, August 2013. PDF Z. Yao and D. Loguinov, \"Analysis of Link Lifetimes and Neighbor Selection in Switching DHTs,\" IEEE Transactions on Parallel and Distributed Systems, vol. 22, no. 11, November 2011. PDF Z. Yao and D. Loguinov, \"Understanding Disconnection and Stabilization of Chord,\" IEEE Transactions on Parallel and Distributed Systems, vol. 22, no. 4, April 2011. PDF 2010 Y. Zhang and D. Loguinov, \"ABS: Adaptive Buffer Sizing for Heterogeneous Networks,\" Elsevier Computer Networks, vol. 54, no. 14, October 2010. PDF Y. Zhang, Y. Xiong, S. Liu, and D. Loguinov, \"Queuing Dynamics and Single-Link Stability of Delay-Based Window Congestion Control,\" Elsevier Computer Networks, vol. 54, no. 10, July 2010. PDF X. Wang and D. Loguinov, \"Understanding and Modeling the Internet Topology: Economics and Evolution Perspective,\" IEEE/ACM Transactions on Networking, vol. 18, no. 1, February 2010. PDF M. Dai, Y. Zhang, and D. Loguinov, \"A Unified Traffic Model for MPEG-4 and H.264 Video Traces,\" IEEE Transactions on Multimedia, vol. 11, no. 5, August 2009. PDF H.-T. Lee, D. Leonard, X. Wang, and D. Loguinov, \"IRLbot: Scaling to 6 Billion Pages and Beyond,\" ACM Transactions on the Web, vol. 3, no. 3, June 2009. PDF X. Wang, Z. Yao, and D. Loguinov, \"Residual-Based Estimation of Peer and Link Lifetimes in P2P Networks,\" IEEE/ACM Transactions on Networking, vol. 17, no. 3, June 2009. PDF Y. Zhang, S. Jain, and D. Loguinov, \"Towards Experimental Evaluation of Explicit Congestion Control,\" Elsevier Computer Networks, vol. 53, no. 7, May 2009. PDF Y. Zhang and D. Loguinov, \"On Delay-Independent Diagonal Stability of Max-Min Congestion Control,\" IEEE Transactions on Automatic Control, vol. 54, no. 5, May 2009. PDF Z. Yao, X. Wang, D. Leonard, and D. Loguinov, \"Node Isolation Model and Age-Based Neighbor Selection in Unstructured P2P Networks,\" IEEE/ACM Transactions on Networking, vol. 17, no. 1, February 2009. PDF D. Leonard, Z. Yao, X. Wang, and D. Loguinov, \"On Static and Dynamic Partitioning Behavior of Large-Scale P2P Networks,\" IEEE/ACM Transactions on Networking, vol. 16, no. 6, December 2008. PDF Y. Zhang and D. Loguinov, \"Local and Global Stability of Delayed Congestion Control Systems,\" IEEE Transactions on Automatic Control, vol. 53, no. 10, November 2008. PDF Y. Zhang, D. Leonard, and D. Loguinov, \"JetMax: Scalable Max-Min Congestion Control for High-Speed Heterogeneous Networks,\" Elsevier Computer Networks, vol. 52, no. 6, April 2008. PDF X. Liu, K. Ravindran, and D. Loguinov, \"A Stochastic Foundation of Available Bandwidth Estimation: Multi-Hop Analysis,\" IEEE/ACM Transactions on Networking, vol. 16, no. 1, February 2008. PDF X. Liu, K. Ravindran, and D. Loguinov, \"A Queuing-Theoretic Foundation of Available Bandwidth Estimation: Single-Hop Analysis,\" IEEE/ACM Transactions on Networking, vol. 15, no. 4, August 2007. PDF Y. Zhang, S.-R. Kang, and D. Loguinov, \"Delayed Stability and Performance of Distributed Congestion Control,\" IEEE/ACM Transactions on Networking, vol. 15, no. 4, August 2007. PDF X. Wang and D. Loguinov, \"Load-Balancing Performance of Consistent Hashing: Asymptotic Analysis of Random Node Join,\" IEEE/ACM Transactions on Networking, vol. 15, no. 4, August 2007. PDF D. Leonard, Z. Yao, V. Rai, and D. Loguinov, \"On Lifetime-Based Node Failure and Stochastic Resilience of Decentralized Peer-to-Peer Networks,\" IEEE/ACM Transactions on Networking, vol. 15, no. 3, June 2007. PDF S.-R. Kang and D. Loguinov, \"Modeling Best-Effort and FEC Streaming of Scalable Video in Lossy Network Channels,\" IEEE/ACM Transactions on Networking, vol. 15, no. 1, February 2007. PDF M. Dai, D. Loguinov, and H. Radha, \"Rate-Distortion Analysis and Quality Control in Scalable Internet Streaming,\" IEEE Transactions on Multimedia, vol. 8, no. 6, December 2006. PDF X. Liu, K. Ravindran, and D. Loguinov, \"Towards a Generalized Stochastic Model of End-to-End Packet-Pair Sampling,\" IEEE JSAC Special Issue on Sampling the Internet, vol. 24, no. 12, December 2006. PDF 2005 D. Loguinov, J. Casas, and X. Wang, \"Graph-Theoretic Analysis of Structured Peer-to-Peer Systems: Routing Distances and Fault Resilience,\" IEEE/ACM Transactions on Networking, vol. 13, no. 5, October 2005. PDF M. Dai, C. Peng, A. Chan, and D. Loguinov, \"Bayesian Wavelet Shrinkage with Edge Detection for SAR Image Despeckling,\" IEEE Transactions on Geoscience and Remote Sensing, vol. 42, no. 8, August 2004. PDF S.A. Khayam, S.S. Karande, H. Radha, and D. Loguinov, \"Performance Analysis and Modeling of Errors and Losses over 802.11b LANs for High-Bitrate Real-Time Multimedia,\" Signal Processing: Image Communication, vol. 18, no. 7, August 2003. PDF D. Loguinov and H. Radha, \"End-to-End Rate-Based Congestion Control: Convergence Properties and Scalability Analysis,\" IEEE/ACM Transactions on Networking, vol. 11, no. 4, August 2003. PDF D. Loguinov and H. Radha, \"Retransmission Schemes for Streaming Internet Multimedia: Evaluation Model and Performance Analysis,\" ACM CCR, vol. 32, no. 2, April 2002. PDF D. Loguinov and H. Radha, \"Large-Scale Experimental Study of Internet Performance Using Video Traffic,\" ACM CCR, vol. 32, no. 1, January 2002. PDF Conference Publications G. Stella and D. Loguinov, \"QORA: Zero-Shot Transfer via Interpretable Object-Relational Model Learning,\" ICML, July 2024. PDF, PPT G. Stella and D. Loguinov, \"On High-Latency Bowtie Data Streaming,\" IEEE BigData, December 2022. PDF, PPT A. Arman and D. Loguinov, \"Origami: A High-Performance Mergesort Framework,\" VLDB, September 2022. PDF, PPT 2020 C. Hanel, A. Arman, D. Xiao, J. Keech, and D. Loguinov, \"Vortex: Extreme-Performance Memory Abstractions for Data-Intensive Streaming Applications,\" ACM ASPLOS, March 2020. PDF, PPT D. Xiao, X. Li, D.B.H. Cline, and D. Loguinov, \"Estimation of DNS Source and Cache Dynamics under Interval-Censored Age Sampling,\" IEEE INFOCOM, April 2018. PDF, PPT Y. Cui, D. Xiao, D.B.H. Cline, and D. Loguinov, \"Improving I/O Complexity of Triangle Enumeration,\" IEEE ICDM, November 2017. PDF, PPT Z. Shamsi, D.B.H. Cline, and D. Loguinov, \"Faulds: A Non-Parametric Iterative Classifier for Internet-Wide OS Fingerprinting,\" ACM CCS, October 2017. PDF, PPT D. Xiao, Y. Cui, D.B.H. Cline, and D. Loguinov, \"On Asymptotic Cost of Triangle Listing in Random Graphs,\" ACM PODS, May 2017. PDF, PPT Y. Cui, D. Xiao, and D. Loguinov, \"On Efficient External-Memory Triangle Listing,\" IEEE ICDM, December 2016. PDF, PPT Z. Shamsi and D. Loguinov, \"Unsupervised Clustering Under Temporal Feature Volatility in Network Stack Fingerprinting,\" ACM SIGMETRICS, June 2016. PDF, PPT 2015 X. Li, D.B.H. Cline, and D. Loguinov, \"Temporal Update Dynamics under Blind Sampling,\" IEEE INFOCOM, April 2015. PDF, PPT X. Li, D.B.H. Cline, and D. Loguinov, \"On Sample-Path Staleness in Lazy Data Replication,\" IEEE INFOCOM, April 2015. PDF, PPT S.T. Ahmed, C. Sparkman, H.-T. Lee, and D. Log",
  "content_length": 22459,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:02"
}