{
  "name": "Dmitry V. Chistikov",
  "homepage": "https://warwick.ac.uk/fac/sci/dcs/people/dmitry_chistikov",
  "status": "success",
  "content": "Dmitry Chistikov Skip to main content Skip to navigation Associate Professor Theory and Foundations Theme, Department of Computer Science Centre for Discrete Mathematics and its Applications (DIMAP) Office hours in term 1: Fridays 9:30–11:30 in CS2.20. Research Research interests: theoretical computer science and verification. Publications: here. Expository paper: An introduction to the theory of linear integer arithmetic (2024). Best paper award at ICALP’24: Integer linear-exponential programming in NP by quantifier elimination. Postdoc: Sarah Selkirk PhD students: Neha Rino (co-supervised with Carsten Maple) Andrei Codreanu (co-supervised with Ranko Lazić) Graduated: Henry Sinclair-Banks (PhD 2024; co-supervised with Marcin Jurdziński, now at Warsaw) David Purser (PhD 2020; co-supervised with Andrzej Murawski and Graham Cormode, now at Liverpool) Some recent invited talks: CAALM’25, FSTTCS’24, World Logic Day @ Oxford ‘24, MPI-SWS ‘23, WORReLL’23, IMDEA Software Institute ‘22, Logic and Semantics Seminar @ Cambridge ‘22, YaccConstructor Formal Languages Seminar @ St Petersburg ‘21, LaBRI @ Bordeaux ‘21, Kolmogorov seminar @ Moscow ‘21, YR-OWLS’20, Highlights’19, ACTS’17, INFINITY’16. Funding: My research has been supported in part by Teaching CS259 Formal Languages (term 2 in 2024/25) CS130 Mathematics for Computer Scientists I (term 1 in 2020/21, 2021/22, and 2022/23). CS260 Algorithms (term 1 in 2017/18, 2018/19, and 2019/20). Demystifying problem solving (mentoring talk; slides here). Logic Mentoring Workshop 2022 (LMW’22), co-located with the 30th EACSL Annual Conference on Computer Science Logic (CSL’22), online, hosted at Göttingen, Germany, 14 February 2022. Ultimately periodic sets, semi-linear sets, and Presburger arithmetic (slides and video here). 14th Summer School on Modelling and Verification of Parallel Processes (MOVEP’20), online, based at Grenoble, France, 22–26 June 2020. Linear Arithmetic: Geometry, Algorithms, and Logic (course page). 30th European Summer School in Logic, Language and Information (ESSLLI’18), Sofia, Bulgaria, 6–10 August 2018. Co-taught with Christoph Haase. Model counting for logical theories (course page). 28th European Summer School in Logic, Language and Information (ESSLLI’16), Bolzano, Italy, 15–19 August 2016. Co-taught with Rayna Dimitrova and sponsored by EACSL. Professional service Secretary of the European Association for Theoretical Computer Science (EATCS). 2022—present. Steering committee member: International Colloquium on Automata, Languages and Programming (ICALP), 2024—present. Guest editor of Logical Methods for Computer Science (special issue for LICS’21). Joint with Benoit Larose and Leonid Libkin. Program committee member: ICALP’25, NeurIPS’25, MFCS’25, RP’25, ECAI’24, LICS’23, ECAI’23, Highlights’22, YR-CONCUR’22, FSTTCS’21, LICS’21, STACS’21, FoSSaCS’21, ECAI’20, SYNASC’15 (theory track) Event organisation: Automated Reasoning in Arithmetic: Logic, Algorithms, Software. A Dagstuhl seminar. 18–23 October 2026. Co-organised with Erika Abraham, Christoph Haase, Matthias Köppe, Alessio Mansutti. Automata in the Wild '25, a workshop on automata theory. University of Warwick. 1–2 April 2025. Co-organised with Marcin Jurdziński and Sarah Selkirk. Trends in Arithmetic Theories '24. An ICALP/LICS 2024 workshop. Tallinn, Estonia, 6 July 2024. Co-organised with Christoph Haase and Alessio Mansutti. Computation in Mathematics and Mathematics in Computation. A MIR@W (Mathematical Interdisciplinary Research at Warwick) Day. 11 March 2024. Co-organised with Mark Pollicott and Julia Slipantschuk. Trends in Arithmetic Theories '22. An ICALP 2022 workshop. Paris, France, 4 July 2022. Co-organised with Christoph Haase, Alessio Mansutti, Jonathan Tanner. British Society for the History of Mathematics Christmas meeting 2021. Hosted at Warwick; moved online. 11 December 2021. Co-organised with Steve Russ and Polina Vytnova. Automata in the Wild (WILD 2021), a workshop (collaborative incubator) on automata and cyber-physical systems. Online. 21–23 April 2021. Co-organised with Rayna Dimitrova. Autobóz’19, an international research camp on logic, automata, and games. Firbush, Scotland, 12–19 July 2019. Co-organised with Michaël Cadilhac and Patrick Totzke. 19th International Workshop on Verification of Infinite-State Systems (INFINITY’17). Co-located with LICS 2017, the 32nd ACM/IEEE Symposium on Logic in Computer Science. 19 June 2017, Reykjavik, Iceland. Co-organised with Christoph Haase. Administration at Warwick: Exam secretary, 2024—present. Course (co-)director (Computer Science), 2021—23. Deputy director for undergraduate studies, 2018—21. ICPC (programming competitions) lead, 2018—22. Office: room 220, Computer Science Email: d dot chistikov at warwick dot ac dot uk Postal address: Computer Science University of Warwick COVENTRY CV4 7AL UNITED KINGDOM Tel: +44 24 765 73792 Let us know you agree to cookies We use cookies to give you the best online experience. Please let us know if you agree to functional, advertising and performance cookies. You can update your cookie preferences at any time. Cookie policy Essential cookies Functional cookies Advertising cookies Performance cookies Accept all Remember my preference More information",
  "content_length": 5277,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:04"
}