{
  "name": "Dmitri Perkins",
  "homepage": "https://redirect.cs.umbc.edu/~dmitrip1",
  "status": "success",
  "content": "Dmitri Perkins UMBC: An Honors University College of Engineering and Information Technology Department of Computer Science and Electrical Engineering Dmitri Perkins Home Teaching Research Publications CV About Me I am an accomplished and multifaceted leader in the field of computer science and engineering with over 25 years of broad experiences spanning higher education, industry, and government, as a university professor, an associate dean, a research fellow with the U.S. Naval Research Laboratory, an industry technical staff member, a two-term Program Director with the National Science Foundation, and aa a small business and technology consultant. Currently, I am a Professor of Computer Science and Electrical Engineering at University of Maryland, Baltimore County (UMBC), where my research work and teaching span the area of wireless and mobile networking, including dynamic spectrum management, cognitive radio networks, sensor networks, wireless LANs, and formal design of experiments and performance evaluation. I received the NSF CAREER Award in 2005 for my research on modeling, analysis, and protocol design for large-scale multi-hop wireless networks. I am a Senior Member of the IEEE. From August 2021 - December 2024, I served as a Senior Program Director in the National Science Foundation Directorate for Technology, Innovation, and Partnerships (NSF TIP), where I was one of the lead architects for the NSF Regional Innovation Engines Program (NSF Engines). The NSF Engines Program was authorized by the CHIPS and Science Act and, with a potential investment of nearly $1.6 billion over the next decade, represents one of the single largest broad investments in place-based research and technology development in the nation's history. The NSF Engines Program is unique in its purpose, scale, and scope and is explicitly designed to catalyze and foster regional innovation ecosystems across the U.S., spurring economic growth in regions that have not fully participated in the technology boom of the past few decades. In addition to my service with NSF TIP, I also served a 4-year term (2015-2019) as the Lead Program Director for the Industry-University Cooperative Research Centers program in the NSF Directorate for Computer and Information Science and Engineering (CISE). Prior to joining UMBC in 2019, I was the Hardy Edmiston Endowed Professor of Computer Science at the University of Louisiana at Lafayette (UL Lafayette). I earned my M.S. and Ph.D. degrees in computer science and engineering from Michigan State University in 1997 and 2002, respectively, and my B.S. degree in computer science from Tuskegee University in 1995. Contact Me Dmitri Perkins, Professor Computer Science and Electrical Engineering University of Maryland, Baltimore County 350 Information Technology and Engineering (ITE) Building Tel: 410-455-3019 Email: dmitrip1 [at] umbc [dot] edu LinkedIn Latest News Open Positions : Multiple RA positions in spectrum research and innovation, wireless-enable smart systems - including IoT/CPS, and cybersecurity for wireless systems, are now available. Interested students should contact me via email. Recent Activities and Awards 2024 NSF Director's Award for Superior Accomplishment - For outstanding execution of the inaugural NSF Engines Program and portfolio of awards. Senior Program Director, NSF Regional Innovation Engines Program -- NSF Directorate for Technology, Innovation and Partnerships (2021-2024) Associate Editor, IEEE Transactions on Mobile Computing NSF Program Director, Computer and Information Science and Engineering (CISE) (2015-2019) ONR Research Fellow, U.S. Naval Research Lab (2013, 2014) - Cognitive Radio Networks and Dynamic Spectrum Managment © 2021 Dmitri Perkins",
  "content_length": 3747,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:01"
}