{
  "name": "Dmitry Zelenchuk",
  "homepage": "https://pure.qub.ac.uk/en/persons/dmitry-zelenchuk",
  "status": "success",
  "content": "Dmitry Zelenchuk - Queen's University Belfast View Scopus Profile Dmitry Zelenchuk Dr Senior Lecturer, School of Electronics, Electrical Engineering and Computer ScienceHigh Frequency Electronic CircuitsInstitute of Electronics, Communications & Information Technology https://orcid.org/0000-0003-2866-6296 Phone+44 (0)28 9097 1761Emaild.zelenchukqub.acuk Room 01.027 - Queens Titanic Quarter (QTQ)United Kingdom Accepting PhD StudentsPhD projects- Reconfigurable Intelligent Surfaces- 6G physical layer technologies- mm-wave antennas and systems- Wideband millimetre wave imaging antenna- Automotive radar sensor antenna system 20012025 Research activity per year Personal profile Research InterestsElectromagnetic field theory, material characterization, millimeter-wave circuits, antennas, and advanced packaging, propagation in complex environments, and various physical phenomena of plasmonic and nanostructuresAchievementsAuthored and co-authored more than 100 journal and conference papers, book chapters. Had been a session chair at scientific conferences. Dr Zelenchuk received the medal of the Ministry of Education of the Russian Federation “For the Best Scientific Student Paper” in 2001. Fingerprint Dive into the research topics where Dmitry Zelenchuk is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Frequencies Physics 100% Selective Surface Engineering 97% Antenna Engineering 70% Arrays Physics 60% Design Engineering 50% Performance Physics 45% Substrates Engineering 45% Circular Polarization Engineering 43% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2019 2019 2022 2023 2024 2024 1 Finished 4 Active Projects per year R1004ECS: Future Communications Hub in All-Spectrum Connectivity v2 (HASC Hub)Cotton, S. (PI), Abbasi, M. A. B. (CoI), Matthaiou, M. (CoI), Ngo, H.-Q. (CoI), Yurduseven, O. (CoI) & Zelenchuk, D. (CoI)25/06/2024 → …Project: Research R3514ECS: REASON (Research on Enabling Architectures and Solutions for Open Networks)Cotton, S. (PI), Abbasi, M. A. B. (CoI), Matthaiou, M. (CoI), Ngo, H.-Q. (CoI), Yurduseven, O. (CoI) & Zelenchuk, D. (CoI)22/05/2023 → …Project: Research R1862ECS: Supporting Architectural and technological Network evolutions through an intelligent, secureD and twinning enaBled Open eXperimentation facilityZelenchuk, D. (PI) & Abbasi, M. A. B. (CoI)02/02/2023 → …Project: Research Area Coverage 100% Sleep Mode 100% Feedback Loop 100% Natural Resources 100% Security Function 100% R3473ECS: Smart Radio Environments with Reconfigurable Intelligent Surfaces – Communications Through Blockage in Millimeter-wave systems (REFLECT-MMWAVE)Zelenchuk, D. (PI) & Abbasi, M. A. B. (CoI)17/11/2022 → …Project: Research Antenna 100% Metamaterial 100% Wireless Communication 100% Permittivity 66% Optics 33% R1092ECI: Advanced metasurface-based antennas for millimetre waveZelenchuk, D. (PI)19/08/2019 → 18/08/2021Project: Research Volume 100% Reaction Temperature 100% Material 100% Ceramics 100% Temperature 100% Research output Research output per year 2001 2002 2005 2007 2008 2012 2013 2019 2020 2021 2023 2024 2025 2025 54 Paper 45 Article 41 Conference contribution 3 Chapter (peer-reviewed) 2 More 1 Chapter 1 Poster Research output per year Research output per year Equivalent circuit model for linear to circular polarisation converters based on bandpass freestanding FSS screensClendinning, S., Cahill, R., Zelenchuk, D. & Fusco, V., 12 Nov 2018. 6 p.Research output: Contribution to conference › Paper › peer-review Model 100% Frequencies 100% Circular Polarization 100% Selective Surface 100% Equivalent Circuit Model 100% Compressive Sensing Multiplicative Antenna ArrayAbbasi, M. A. B., Fusco, V. & Zelenchuk, D., 01 Nov 2018, In: IEEE Transactions on Antennas and Propagation. 66 , 11 , p. 5918-5925 8 p., 8432506.Research output: Contribution to journal › Article › peer-review Open AccessFile Antenna Arrays 100% Compressive Sensing 100% Detection 100% Arrays 100% Applications 50% 11 Citations (Scopus) 852 Downloads (Pure) Propagation Characteristics of Groove Gap Waveguide Below and Above CutoffBerenguer, A., Fusco, V., Zelenchuk, D. E., Sanchez-Escuderos, D., Baqueo-Escudero, M. & Boria-Esbert, V. E., 01 Jan 2016, In: IEEE Transactions on Microwave Theory and Techniques. 64, 1, p. 27-36 10 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Propagation Characteristic 100% Gaps 100% Waveguide 100% Model 25% Models 12% 84 Citations (Scopus) 1327 Downloads (Pure) Equivalent Circuit Model of Twisted Split Ring Frequency Selective SurfacesZelenchuk, D. & Fusco, V., Apr 2016, Proceedings of 10th European Conference on Antennas & Propagation (EUCAP 2016). Institute of Electrical and Electronics Engineers Inc., 5 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Selective Surface 100% Equivalent Circuit Model 100% Models 66% Surfaces 66% Simulation 33% 3 Citations (Scopus) 857 Downloads (Pure) Design Method for Circularly Polarized Frequency Selective SurfacesZelenchuk, D. & Fusco, V., Apr 2016, Proceedings of 10th European Conference on Antennas & Propagation (EUCAP 2016). Institute of Electrical and Electronics Engineers Inc., 5 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Models 100% Design Method 100% Selective Surface 100% Model 100% Frequencies 100% 1 Citation (Scopus) 563 Downloads (Pure) View all 145 research outputs Datasets Dataset for \"Metamaterial-Based LTCC Compressed Luneburg Lens Antenna at 60 GHz for Wireless Communications\"Zelenchuk, D. (Creator), Kirillov, V. (Contributor), Munina, I. (Contributor), Gallée, F. (Creator) & Karnfelt, C. (Contributor), Queen's University Belfast, 06 Jun 2023DOI: 10.17034/cc243307-22f8-4a1d-885a-2c1db7e71cabDataset File Calibrated Polarisation Tilt Angle Recovery for Wireless CommunicationsZelenchuk, D. (Creator), Queen's University Belfast, 2016DOI: 10.17034/5d3c0642-f861-45b2-aedc-8721f855a622Dataset File Prizes Best Scientific Student Paper for \"Conductor Loss in Superconducting Slot Line\"Zelenchuk, D. (Recipient), 2001Prize: Prize (including medals and awards) Activities Activities per year 2002 2018 2019 2022 2022 10 Publication peer-review 3 Hosting an academic visitor 3 Invited talk 1 Participation in conference 6 More 1 Participation in workshop, seminar, course 1 PhD external examination 1 Membership of external research organisation 1 Membership of national or international committees and working groups 1 Invited or keynote talk at national or international conference 1 Visiting an external academic institution Activities per year Beam Steerable Antennas Reconfigured Using Liquid MetalZelenchuk, D. (Examiner)16 Nov 2022Activity: Examination types › PhD external examination Liudmyla MospanZelenchuk, D. (Host)Aug 2022 → Aug 2024Activity: Hosting a visitor types › Hosting an academic visitor Antenna Development for Satcomms in 2030Zelenchuk, D. (Advisor)Mar 2022Activity: Talk or presentation types › Invited talk Northern Ireland Space Leadership Council (External organisation)Zelenchuk, D. (Advisor)01 Jan 2022 → …Activity: Membership types › Membership of national or international committees and working groups Antenna Designs for Space & Mobile towards 2030 Zelenchuk, D. (Advisor)20 Apr 2021Activity: Talk or presentation types › Invited or keynote talk at national or international conference View all 23 activities Press/Media Keysight Hotspot - Millimeter-wave Measurement Insights -Practical Examples of Millimetre-Wave Measurements in Academic ResearchZelenchuk, D.25/04/2018 → 27/04/20182 items of Media coveragePress/Media: Public Engagement Activities Keysight Hotspot - Millimeter-wave Measurement Insights -Practical Examples of Millimetre-Wave Measurements in Academic ResearchZelenchuk, D.27/04/20181 Media contributionPress/Media: Public Engagement Activities Liquid crystal based electronically reconfigurable antenna for 5G networksZelenchuk, D.17/04/20181 Media contributionPress/Media: Public Engagement Activities",
  "content_length": 8504,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:06"
}