{
  "name": "Doga Demirel",
  "homepage": "http://dogademirel.com",
  "status": "success",
  "content": "Doga Demirel Doga Demirel, Ph.D. I earned my Ph.D. in Computer Science from the University of Arkansas at Little Rock (UALR), where I completed my thesis on design and development of virtual interactive simulations for surgical training. I received an M.Sc. in Computer Science from the University of Central Arkansas (UCA) and a B.Sc. in Computer Science from UALR. During my time at UCA and UALR, I had the pleasure of working in the Virtual Reality, Simulation, Imaging and Modeling (ViRaSIM) Lab at UCA. I am an Associate Professor in the School of Computer Science and an affiliated faculty in the Data Science and Analytics Institute at the University of Oklahoma. Also, I am the founder and director of the Virtual Reality, Interactive Simulation, and Biomedical (VRISB) Lab at OU. Before joining OU, I was an Asscoiate Professor and the Assistant Chair in the Department of Computer Science at Florida Polytechnic University. Doga Demirel's faculty profile at University of Oklahoma News [November 2025] VRISB Lab member Doruk Ayhan successfully defended his MSc thesis in Computer Science, titled “Toward An Immersive Virtual Endoscopic Sleeve Gastroplasty Simulator” Congratulations, Doruk! He will continue his research in the VRISB Lab as a PhD student in Computer Science at OU. [November 2025] VRISB Lab member Dervishan Sezer successfully defended his MSc thesis in Data Science and Analytics, titled “Integrating Physics-Informed Simulation and Objective Assessment for Robotic Surgery Training” Congratulations, Dervishan! He will continue his research in the VRISB Lab as a PhD student in Data Science and Analytics at OU. [November 2025] Dr. Demirel started serving as the Associate Director of the School of Computer Science at the University of Oklahoma. [November 2025] Dr. Demirel started serving as a member of the Surgeons and Engineers Committee of the American College of Surgeons Divison of Education. [ACS Website] [October 2025] VRISB Lab member Jacob Barker succesfully passed his PhD Oral Examination. Congratualtions, Jacob! [October 2025] We held the 1st International Workshop on XR Medical Applications (XR-MED’25) at IEEE ISMAR 2025 in Daejeon, South Korea. [Workshop Website] [IEEE Workshop Website] [September 2025] Our paper \"Time and Expertise in Open Structural Rhinoplasty: A Task-Based Analysis using Hierarchical Task Analysis and Machine Learning\" was published in the Journal of Craniofacial Surgery [Link] [Publication] [August 2025] Our paper \"Graph Neural Networks for Realistic Bleeding Prediction in Surgical Simulators\" was published in the Journal of Imaging Informatics in Medicine [Link] [Publication] [November 2025] Dr. Demirel started serving as the Graduate Liaison of the School of Computer Science at the University of Oklahoma. [July 2025] Our paper \"Design and Development of a Real-Time Virtual Bariatric Endoscopic Simulator with Haptic Feedback\" was published in ACM Transactions on Sensor Networks [Link] [Publication] [June 2025] Our (Doga Demirel, Jin Ryong Kim, and Ganesh Sankaranarayanan) proposal to organize the 1st International Workshop on XR Medical Applications (XR-MED’25) was accepted by IEEE ISMAR 2025. [Workshop Website] [March 2025] Panelist at American College of Surgeons' Surgeons and Engineers: A Dialogue on Surgical Simulation panel 'How to Build Better Surgical Simulators' [Website] [Program Book] [March 2025] IEEE VR (Training XR) - Presented \"Crack-Free Multi-Resolution Dynamic Volume Refinement for Physics-Based Bone Drilling and Shaving in Arthroscopic Procedures\" [Link] [Publication] Education Here is an overview of my educational background. University of Arkansas at Little Rock Ph.D. in Integrated Computing, Computer Science January 2016 - December 2018 University of Central Arkansas M.Sc. in Applied Computing August 2013 - December 2015 University of Arkansas at Little Rock B.Sc. in Computer Science and Minor in Mathematics August 2009 - May 2013 Employment Here is an overview of my employment history. University of Oklahoma, School of Computer Science Associate Professor (August 2024 - Present) Associate Director (November 2025 - Present) Graduate Liaison (August 2025 - Present) Director, Virtual Reality, Interactive Simulation, and Biomedical (VRISB) Lab Florida Polytechnic University, Department of Computer Science Associate Professor (August 2023 - August 2024) Assistant Chair (July 2021 - August 2024) Director, Virtual Reality, Interactive Simulation, and Biomedical (VRISB) Lab Assistant Professor (August 2019 - August 2023) Teaching Courses Taught University of Oklahoma Undergraduate Courses Taught: CS 3323 - Principles of Programming Languages Graduate Courses Taught: CS 5970 - Virtual Reality ..... Florida Polytechnic University Undergraduate Courses Taught: COP 2271 - Introduction to Computation and Programming EGN 1007 - Career Design for STEM Disciplines CAP 4730 - Computer Graphics CEN 4065 - Software Design and Architecture CAP 4073 - Software Requirements Engineering CEN 4072 - Software Verification and Quality Assurance COP 4934 - Senior Design 1 COP 4935 - Senior Design 2 Graduate Courses Taught: CAP 5701 - Advanced Graphics COP 5035 - Advanced Software Engineering University of Arkansas at Little Rock Undergraduate Courses Taught: CPSC 2382 - Computer Systems and Assembly Language Research Current Grant Work NIH (R01) - Physically Realistic Virtual Surgery (VORTeX) VORTeX aims to develop a simulation system that enables Operating Room personnel to engage in collaborative training, leveraging virtual reality head-mounted displays. This novel approach to training aims to enhance non-technical skills through computer-generated simulation scenarios, thereby serving as a substitute for traditional physical training methods. Collaborators Rensselaer Polytechnic Institute FAMU-FSU College of Engineering Beth Israel Deaconess Medical Center Videos Donning and Doffing Simulator Donning and Doffing Simulator using Reinforcement Learning Rapid Sequence Intubation Simulator Intensive Care Unit Simulator ..... NIH (R01) - Development and Validation of a Virtual Colorectal Surgical Trainer (VCoST) The objective of VCoST is to create a highly realistic and immersive simulation of five open Colorectal Objective Structured Assessment of Technical Skills tasks in a virtual environment, including handsewn anastomosis, straight colo-anal anastomosis, linear stapler anastomosis, ileal pouch-anal anastomosis, and rectal prolapse. All the simulators use a haptic interface and virtual reality to interact with the surgical simulations. Collaborators Rensselaer Polytechnic Institute University of Texas Southwestern Medical School Videos Rectal Prolapse Simulator End to end Handsewn Anastomosis Simulator Straight Colo-anal Anastomosis Simulator Ileal Pouch-anal Anastomosis Simulator Linear Stapler Anastomosis Simulator ..... ..... NIH (R01) - Development and Validation of a Virtual Bariatric Endoscopic (ViBE) Simulator The ViBE project aims to create a highly realistic simulation within an immersive 3D environment to facilitate Endoscopic Sleeve Gastroplasty (ESG) training. The simulator aims to utilize a custom haptic hardware interface and a virtual reality headset that will allow the clinician to interact with the virtual patient anatomy in a seamless manner. Collaborators FAMU-FSU College of Engineering Indiana University School of Medicine Videos ViBE Simulator ..... NIH (R01) - Enhancing robotic head and neck surgical skills using stimulated simulation (VTORS) In Virtual Transoral Robotic Surgical (VTORS), we aim to design, develop, and validate the Virtual Transoral Robotic Surgical simulator. Within the simulator, the trainees will practice skills such as tissue manipulation, retraction, or dissection using electrocautery. Collaborators FAMU-FSU College of Engineering Beth Israel Deaconess Medical Center ..... NIH (R01) - Development and Validation of a Virtual Laparoscopic Hiatal Hernia Simulator (VLaHHS) For VLaHHS, we are working on developing a laparoscopic hiatal hernia simulator. This simulator will use haptic devices to interface with the simulator. Collaborators University of Texas Southwestern Medical School VRISB LAB Virtual Reality, Interactive Simulation, and Biomedical (VRISB) Lab. Current Members Doga Demirel, Ph.D. - Director (2019 - present) Dr. Demirel's research centers on the design, development, and utilization of medical and interactive simulations featuring authentic performance metrics to enhance training. These metrics provide objective, quantitative feedback that applies to real-world settings such as operating rooms, while utilizing artificial intelligence (AI) and machine learning (ML) to quantitate the user performance. Along with AI and ML, Dr. Demirel utilizes computer graphics, game development (including AR/VR/MR), Software Engineering, and Human-Computer Interaction (including Haptics) to enhance the field of medical simulation and interactive experiences. Doga Demirel's faculty profile at University of Oklahoma ..... Jacob R. Barker, M.Sc. - Ph.D. Student in Computer Science (2024 - present), Lab Member (2020 - present) Jacob Barker is a computer scientist with a passion for game design and simulation. He has a strong background in VR development that has allowed me to create immersive training programs that leverage the unique strengths the virtual world offers. Outside of his professional pursuits he found himself drawn to the recent developments in AI technologies. He has built his own system that’s capable of running large language models for personal use. Dervishan Sezer, B.Sc. - M.Sc. Student in Data Science and Analytics (2023 - present) Dervişhan Sezer holds a bachelor’s degree in Computer Education and Instructional Technology from Boğaziçi University, where he specialized in developing educational applications using Unity. He is currently pursuing a master’s degree in Data Science and Analytics at the Univer",
  "content_length": 35410,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:05"
}