{
  "name": "Domenico Cotroneo",
  "homepage": "http://wpage.unina.it/cotroneo",
  "status": "success",
  "content": "Home Page of Domenico Cotroneo DOMENICO COTRONEO Full Professor at the Department of Electrical Engineering and Information Technology (DIETI, www.dieti.unina.it) University of Naples Federico II, Naples, Italy (www.unina.it) The University Federico II is the third university in Italy for size and for number of students, after Roma Sapienza and Milan. It is the largest and leading university in the south of Italy, established in 1224 by the German emperor of the Holy Roman Empire Frederick II as the first non-clerical university in Europe. cotroneo@unina.it Publications My research interests are on the fields of software reliability and security, field failure data analysis, and software fault injection, with more 200 publications in international, high-profile journals and conferences, including: ACM Computing Surveys, IEEE Transactions on Software Engineering, Empirical Software Engineering IEEE Transactions on Dependable and Secure Computing, IEEE Transactions on Reliability, the Annual IEEE/IFIP Intl. Conference on Dependable Systems and Networks (DSN), the IEEE Intl. Symposium on Software Reliability Engineering (ISSRE), the European Dependable Computing Conference (EDCC), the IEEE Intl. Symposium on Reliable Distributed Systems (SRDS), the IEEE/ACM Intl. Conference on Software Engineering (ICSE), the ACM Intl. Symposium on Software Testing and Analysis (ISSTA), and the IEEE/ACM Intl. Conf. on Automated Software Engineering (ASE). A complete list of my publications can be found on Google Scholar link Research From July 2023 he is the chair of IEEE Technical Community on Dependable Computing and Fault Tolerance, he is IEEE senior member, and elected member of IFIP WG 10.4 on Dependable Computing and Fault Tolerance. He was/is member of scientific program of about 100 international conferences on the security/dependability research fields. He is also member of the steering committee of DSN (IEEE/IFIP Intl. Conference on Dependable Systems and Networks), ISSRE (Int. Symposium on Software Reliability Engineering), and ITASEC (Italian Conference on Cybersecurity). He achieved one of the “most influential paper of ISSRE conferences (1990-2019) award, 4 best paper awards, and 2 best presentation awards. He supervised more than 13 PhD students. He has been General chair of 6 international conferences, and PC co-chair of 10 international conferences, including ISSRE, DSN, ICPS. He has been the PI of European project CRITICAL-STEP (CRITICAL Software Technology for an Evolutionary Partnership), call FP7-PEOPLE-2008-IAPP He has been the responsible for his research unit of the following European project: Certification of Critical Systems (CECRIS), FP7-PEOPLE-2012-IAPP. A DEcision Support Tool for Reconstruction and recovery and for the IntEroperability of international Relief units in case Of complex crises situations, including CBRN contamination risks” (DESTRIERO), SEC-2012.4.3.1. P7-Support Action “OSMOSIS: Overcoming Security Market Obstacles for SMEs Involvement in the technological Supply chain”. “Secure European Common Information Space for the Interoperability of First Responders and Police Authorities” (SECTOR), call FP7-SEC-2013-1. Since December 2014, Domenico Cotroneo is a member of the Steering Committee of the “International Symposium on Software Reliability Engineering” (ISSRE). Since July 2021, Domenico Cotroneo is a member of the Steering Committee of the “Annual IEEE/IFIP International Conference on Dependable Systems and Networks” (DSN). Students Current students Simona De Vivo Cristina Improta Francesco Crescenzo Grasso Roberta De Luca Giuseppe De Rosa Former students Marcello Cinque (PhD 2006) Catello Di Martino(PhD 2010) Roberto Natella (PhD 2011) Domenico Di Leo (PhD 2013) Anna Lanzaro (PhD 2014) Francesco Fucci(PhD 2014) Luigi De Simone (phD 2017) Antonio Ken Iannillo (PhD 2017) Stefano Rosiello (PhD 2018) Pietro Liguori (Ph.D 2022) Vittorio Orbinato (PhD, 2024) Teaching Master Degree in Computer Engineering Impianti di Elaborazione (System analysis: from performance to reliability and security analysis) Software Security Bachelor Degree in Computer Engineering Operating Systems Computer Architecture Link to the teaching activities at the University on Naples Federico II CONTACTS Email: cotroneo@unina.it Office:+39 0817683824",
  "content_length": 4342,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:08"
}