{
  "name": "Dominic Duggan",
  "homepage": "https://www.stevens.edu/profile/dduggan",
  "status": "success",
  "content": "Dominic Duggan | Stevens Institute of TechnologySkip to ContentDominic DugganAssociate ProfessorCharles V. Schaefer, Jr. School of Engineering and ScienceDepartment of Computer ScienceGateway Center S321(201) 216-8042(201) 216-8249[email protected]WebsiteResearchMy research interests are in tools, including semantics, for ensuring that software is \"safe\" and \"secure.\" I have worked on module systems for programming-in-the-large, software adaptation for safe dynamic library updates, various extensions of object-oriented languages to enable reuse, type inference, and language-based security. My work in security leverages techniques in programming languages and software checking to establish end-to-end security properties for applications. Institutional ServiceBenefits Advisory Committee MemberBoard of Trustees Facilities Committee MemberComputer Science Curriculum Committee ChairFaculty Senate MemberGraduate Curriculum Committee MemberSenate IT Committee ChairUndergraduate Advisor MemberBenefits Advisory Committee MemberComputer Science Curriculum Committee ChairCoop Program Redesign Committee MemberCore Curriculum Committee MemberFaculty Senate MemberGraduate Curriculum Committee MemberSenate IT Committee ChairUndergraduate Advisor MemberSES Promotion and Tenure Committee MemberCoop Program Redesign Committee MemberBenefits Advisory Committee MemberComputer Science Curriculum Committee ChairFaculty Senate MemberSenate IT Committee ChairSES Promotion and Tenure Committee MemberUndergraduate Advisor MemberABET Coordinator ChairABET Coordinator ChairAcademic Planning and Resources Committee (APAR) ChairSES Promotions and Tenure Committee MemberAcademic Planning and Resources Committee (APAR) ChairBudget Advisory Committee MemberComputer Science Curriculum Committee ChairFaculty Senate MemberStrategic Plan Implementation Working Group MemberUndergraduate Advisor MemberProfessional ServiceIEEE Computer Security Foundations Symposium Steering Committee Member IEEE Computer Security Foundations Symposium Steering Committee Member IEEE Computer Security Foundations Symposium (CSF 2019) Organizing Committee General Chair IEEE Computer Security Foundations Symposium Steering Committee MemberProfessional SocietiesACM – Association for Computing Machinery MemberACM – Assocation for Computing Machinery MemberIEEE Computer Society MemberGrants, Contracts and FundsDistributed Access Control for Accountable Systems. With J. Vitek (co-PI). National Science Foundation, Sept 2003 to August 2008.Workflows and Relationships for End-to-End Data Security in Collaborative Applications. National Science Foundation, Sept 2013 to August 2019.",
  "content_length": 2662,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:12"
}