{
  "name": "Dominik Ludewig Michels",
  "homepage": "https://www.kaust.edu.sa/en/study/faculty/dominik-michels",
  "status": "success",
  "content": "Dominik L. Michels - Associate Professor, Computer Science - King Abdullah University of Science and Technology Top Home Study Faculty Dominik L. Michels Associate Professor, Computer Science Computer, Electrical and Mathematical Science and Engineering Division dominik.michels@kaust.edu.sa Research Group Website Our primary objective is the investigation and development of efficient algorithms for the accurate simulation of natural phenomena, processes, and technical procedures to solve relevant problems in scientific and visual computing. Program Affiliations Computer Science Applied Mathematics and Computational Science Biography Before founding the Computational Sciences Group (CSG) at KAUST, Professor Michels joined the Computer Science Department at Stanford University, U.S., after completing his postdoctoral studies at Caltech, U.S., and his B.Sc. ('11), M.Sc. ('13), and Ph.D. ('14) at the University of Bonn, Germany.Since joining KAUST in 2016, he has established his group at the uppermost level of his scientific community. Since its formation, the CSG has developed numerous novel computational methods based on solid theoretical foundations.The scientific community has recognized Professor Michels’ outstanding research within and beyond KAUST. In 2019, he was awarded a €1.25 million Artificial Intelligence Grant from the German State of North Rhine-Westphalia, Germany. Together with fellow KAUST Professors Mark Tester and Peter Wonka, he received a $1.05 million KAUST Competitive Research Grant in 2021. Moreover, in 2017, he was acknowledged by Procter & Gamble with their inaugural Faculty Award for his research contributions to the consumer goods industry.Professor Michels is actively engaged in the Association for Computing Machinery (ACM) SIGGRAPH community; he served on the technical paper committees of SIGGRAPH 2022 and 2023, and SIGGRAPH Asia 2020 and 2021.Michels is a member of the Association for Computing Machinery, the Institute of Electrical and Electronics Engineers, the London Mathematical Society and the AGYA project at the Berlin-Brandenburg Academy of Sciences and Humanities. He is a founding member of the German AI Award top-class jury.As an alumnus of the German Academic Scholarship Foundation, Michels leads its KAUST partnership program. He was recently inaugurated into the Göttingen Academy of Sciences and Humanities and has been listed among the German business magazine Capital's \"Top 40 below 40.\" Research Interests As the head of KAUST's CSG, Michels’ research activities focus on fundamental and applied aspects of computational mathematics and physics to overcome practical problems in scientific and visual computing.At present, the group addresses a broad range of topics related to algorithmics, artificial intelligence, machine learning, computer graphics, physics-based modeling, differential equations, mathematical modeling and numerical analysis. algorithmics machine learning numerical simulations scientific computing visual computing Education Profile Postdoc, Computing and Mathematical Sciences, California Institute of Technology, 2014Ph.D., Mathematics and Natural Sciences, University of Bonn, 2014M.Sc., Computer Science, University of Bonn, 2013B.Sc., Computer Science and Physics, University of Bonn, 2011 Awards and Recognitions ACM SIGSAM Award, 2024AFCEA Academic Award, 2024Distinguished Dissertation, University of Bonn (German Informatics Society Colloquium), 2024Elected Member of AGYA, Berlin-Brandenburg Academy of Sciences and Humanities, 2024KAUST Competitive Research Grant, 2024NRW Artificial Intelligence Grant, 2024Procter & Gamble Faculty Award, 2024Scholar, Bonn University Foundation, 2024Scholar, German National Merit Foundation, 2024Scholar / Participant, Heidelberg Laureate Forum, 2024Scholar, Johannes Kepler Foundation, 2024Scholar, Max Planck Society for the Advancement of Science, 2024Scholar, State of North Rhine-Westphalia, 2024 Show more Publications Huang, L. and Michels, D.L., 2020: Surface-Only Ferrofluids, ACM Transactions on Graphics (SIGGRAPH Asia 2020), Vol. 39, No. 6, Article 174.Hädrich, T., Makowski, M., Pałubicki, W., Banuti, D.T., Pirk, S., and Michels, D.L., 2020: Stormscapes: Simulating Cloud Dynamics in the Now, ACM Transactions on Graphics (SIGGRAPH Asia 2020), Vol. 39, No. 6, Article 175.Huang, L., Hädrich, T., and Michels, D.L., 2019: On the Accurate Large-scale Simulation of Ferrofluids, ACM Transactions on Graphics (SIGGRAPH 2019), Vol. 38, No. 4, Article 93.Michels, D.L., Luan, V.T., and Tokman, M., 2017: A Stiffly Accurate Integrator for Elastodynamic Problems, ACM Transactions on Graphics (SIGGRAPH 2017), Vol. 36, No. 4, Article 116.Michels, D.L., Sobottka, G.A., and Weber, A.G, 2014: Exponential Integrators for Stiff Elastodynamic Problems, ACM Transactions on Graphics, Vol. 33, No. 1, Article 7. Show more Research Areas Computer Science Multimedia - Scopus - KAUST Academic Portal - ORCID",
  "content_length": 4959,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:15"
}