{
  "name": "Dominik D. Freydenberger",
  "homepage": "https://www.lboro.ac.uk/departments/compsci/staff/academic-teaching/dominik-freydenberger",
  "status": "success",
  "content": "Dominik Freydenberger | Computer Science | Loughborough University Dr Dominik Freydenberger Senior Lecturer Director of Studies Research groups and centres Theoretical Computer Science Publications +44 (0) 1509 223 188 Send email Office: N.3.07 (Haslegrave Building) Personal website Biography Research External activities Responsibilities PhD Students Dominik graduated from University of Kaiserslautern in 2006 with a degree in Computer Science. After a year of PhD school at Rovira i Virgili University in Tarragona, he moved to Goethe University in Frankfurt am Main, where he obtained his doctorate in Computer Science in 2011. He stayed as a postdoc at Goethe University until 2015, when he moved to Bayreuth University with a fellowship from Deutsche Forschungsgemeinschaft (DFG). He joined Loughborough University as a Lecturer in 2017. Dominik’s research focusses on the algorithmic and combinatorial properties of models with repetition operators, and on how these results can be applied to domain specific languages. Examples of these applications include the back-reference operator of most modern regex implementations, XML schema inference, graph databases, and IBM’s AQL (a query language for information extraction). Research areas Database Theory and Finite Model Theory Combinatorics on Words Formal Language Theory Learning Theory Programme committee member of ICDT, CIAA, NCMA Reviewer for several journals: ACM Transactions on Database Systems, Acta Informatica, Information and Computation, International Journal of Foundations of Computer Science, Journal of the ACM, Journal of Computer and System Sciences, Logical Methods in Computer Science, RAIRO - Theoretical Informatics and Applications, Theoretical Computer Science, and Theory of Computing Systems Member of the Council of the Subgroup on Automata and Formal Languages (“Leitung der Fachgruppe Automaten und Formale Sprachen”) of the Special Interest Group Theoretical Computer Science (“Fachbereich Grundlagen der Informatik”) of GI (Gesellschaft für Informatik) - from 2015 to 2018 Member of the Theoretical Computer Science (TCS) research theme International Exchange Coordinator (Computer Science), since August 2020 Dr. Samuel Thompson (2022)",
  "content_length": 2230,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:11"
}