{
  "name": "Dominik Henrich",
  "homepage": "https://www.ai3.uni-bayreuth.de/de/team/dominik-henrich",
  "status": "success",
  "content": "Dominik Henrich Druckansicht der Internetadresse: Team > Prof. Dr. Dominik Henrich zurück zur Übersicht zurück zur Übersicht Prof. Dr. Dominik Henrich Person Publikationen Kontakt Fakultät für Mathematik, Physik und InformatikLehrstuhl für Angewandte Informatik III Occupation Head of the RESY Research Lab Curriculum Vitae (english) Prof. Dr. Dominik HENRICH achieved his Diploma in Computer Science in 1991 from the University of Karlsruhe, Germany. From 1992 to 1994, he was supported by a scholarship granted by the German Research Foundation (DFG) and finished his Doctorate. From 1996 to 1999, Prof. Henrich built up the research group for \"Parallel Processing and Robotics\" at the Institute for Process Control (IPR) and was lecturer at the Faculty of Computer Science at the University of Karlsruhe. In 1998, he received a STA fellowship at the Electrotechnical Laboratory of the Ministry of International Trade and Industry (MITI) in Japan. From 1999 to 2003, he was professor of the research group \"Embedded Systems and Robotics (RESY)\" at the Department of Computer Science at the University of Kaiserslautern. Since August 2003 he holds the Chair of Applied Computer Science III (Robotics and Embedded Systems) at the University of Bayreuth. The research interests of Prof. Henrich are collision detection, motion planning, room surveillance, self-adapting robots, sensor-based manipulation, intuitive robot programming, human/robot cooperation, and robot-assisted surgery. Curriculum Vitae (deutsch) Prof. Dr. Dominik HENRICH absolvierte 1991 das Informatik-Diplom an der Universität Karlsruhe. Im Rahmen eines Stipendiums von 1992 bis 1994 im Graduiertenkolleg \"Beherrschbarkeit komplexer Systeme\" der Deutschen Forschungs-Gemeinschaft legte er seine Promotion ab. Von 1996 bis 1999 baute Prof. Henrich die Forschungsgruppe für \"Parallelverarbeitung und Robotik\" am Institut für Prozessrechentechnik, Automation und Robotik (IPR) auf und war Lehrbeauftragter an der Fakultät für Informatik der Universität Karlsruhe. In 1998 erhielt er ein STA Fellowship am Electrotechnical Laboratory des Ministry of International Trade and Industry (MITI), Japan. Von 1999 bis 2003 leitete er als Professor die Forschungsgruppe \"Eingebettete Systeme und Robotik (RESY)\" im Fachbereich Informatik der Universität Kaiserslautern. Seit August 2003 hat er den Lehrstuhl für Angewandte Informatik III (Robotik und Eingebettete Systeme) an der Universität Bayreuth inne. Die Forschungsinteressen von Prof. Henrich umfassen Kollisionserkennung, Bewegungsplanung, Raumüberwachung, Selbstadaptive Roboter, Sensorgestützte Handhabung, Intuitive Roboterprogrammierung, Mensch/Roboter-Kooperation und Robotergestützte Chirurgie. Projects Overview Fakultät für Mathematik, Physik und InformatikLehrstuhl für Angewandte Informatik III Publikationen 2025Johannes Hartwig, Philipp Lienhardt, Dominik Henrich: Estimation of Payload Inertial Parameters from Human Demonstrations by Hand Guiding.. - s.l., 2025. - doi:10.48550/arXiv.2507.15604 Jonathan Hümmer, Dominik Riedelbauch, Dominik Henrich: Evaluating User Behavior Consistency : Comparing Studies in Virtual, Crowdsourced and Real-World Human–Robot Cooperation Scenarios. In: International Journal of Semantic Computing, (2025). - S. 1-21.doi:10.1142/S1793351X25450059 Sascha Sucker, Dominik Henrich: Global Grounding in Flexible Robot Tasks With Object Number Variety. In: IEEE Robotics and Automation Letters, 10 (2025). - S. 5879-5886.doi:10.1109/LRA.2025.3560864 Johannes Hartwig, Pascal Ruppert, Dominik Henrich: Input and Editing of Force Profiles of In-Contact Robot Motions via a Touch Graphical User Interface. In: International Journal of Semantic Computing, 19 (2025). - S. 29-53.doi:10.1142/s1793351x25410028 Sascha Sucker, Dominik Henrich: A layered Pipeline for Natural Language Robot Programming with Control Structures. In: Steffen Ihlenfeldt, Thorsten Schüppstuhl, Kirsten Tracht (Hrsg.): Annals of Scientific Society for Assembly, Handling and Industrial Robotics 2023. - Cham : Springer, 2025. Johannes Hartwig, Marcello Kögler, Dominik Henrich: Neural Network-Based In-Contact Task Segmentation of Demonstrated Robot Motions via Hand Guiding. - (Paper), Veranstaltung: 1st German Robotics Conference, 13.-15. March 2025, Nuremberg. Johannes Hartwig, Sabine Fischer, Dominik Henrich: Visualization of Forces and Torques for Robot-Programming of In-Contact Tasks. In: Steffen Ihlenfeldt, Thorsten Schüppstuhl, Kirsten Tracht (Hrsg.): Annals of Scientific Society for Assembly, Handling and Industrial Robotics 2023. - Cham : Springer, 2025. - S. 171-182.doi:10.1007/978-3-031-74010-7_15 2024Fabian Mikula, Sascha Sucker, Dominik Henrich: Gesture-based Robot Programming Enabling Non-Sequential Control Flow.. - Rostock, 2024. - Johannes Hartwig, Fabian Vießmann, Dominik Henrich: Optimizing Force Signals from Human Demonstrations of In-Contact Motions.. - s.l., 2024. - doi:10.48550/arXiv.2507.15608 Sascha Sucker, Michael Neubauer, Dominik Henrich: Robot Tasks with Fuzzy Time Requirements from Natural Language Instructions. In: Eighth IEEE International Conference on Robotic Computing. - Tokyo : 2024. - S. 56-64.doi:10.1109/IRC63610.2024.00015 Fabian Vießmann, Lukas Wagner, Georg Puchas, Stefan Schafföner, Dominik Henrich: Simulating Material Deposit for Fiber Sprayed Composites using Beta Paint Distribution.. - Rostock, 2024. - Jonathan Hümmer, Dominik Riedelbauch, Dominik Henrich: Comparing the Consistency of User Studies Conducted in Simulations and Laboratory Settings. In: Eighth IEEE International Conference on Robotic Computing. - Tokyo : 2024. - S. 154-161.doi:10.1109/IRC63610.2024.00034 Myriel Fichtner, Sascha Sucker, Dominik Riedelbauch, Stefan Jablonski, Dominik Henrich: Enriching Process Models with Relevant Process Details for Flexible Human-Robot Teaming. In: Collaborative Computing: Networking, Applications and Worksharing : 19th EAI International Conference, CollaborateCom 2023 Corfu Island, Greece, October 4–6, 2023 Proceedings. Part III. - Cham : Springer, 2024. - S. 249-269.doi:10.1007/978-3-031-54531-3_14 Nico Höllerich, Dominik Henrich: Fluency in Dynamic Human-Robot Teaming with Intention Prediction, 2024 2023Dominik Riedelbauch, Nico Höllerich, Dominik Henrich: Benchmarking Teamwork of Humans and Cobots : An Overview of Metrics, Strategies, and Tasks. In: IEEE Access, 11 (2023). - S. 43648-43674.doi:10.1109/ACCESS.2023.3271602 Dorian Rohner, Johannes Hartwig, Dominik Henrich: Detection and Handling of Dynamic Scenes during an Active Vision Process for Object Recognition using a Boundary Representation. In: Thorsten Schüppstuhl, Kirsten Tracht, Jürgen Fleischer (Hrsg.): Annals of Scientific Society for Assembly, Handling and Industrial Robotics 2022. - Cham : Springer, 2023. - S. 279-289.doi:10.1007/978-3-031-10071-0_23 Edgar Schmidt, Pascal Ruppert, Dominik Henrich: DOE Laser-assisted Turntable Calibration and Workpiece Registration. In: Thorsten Schüppstuhl, Kirsten Tracht, Jürgen Fleischer (Hrsg.): Annals of Scientific Society for Assembly, Handling and Industrial Robotics 2022. - Cham : Springer, 2023. - S. 253-264.doi:10.1007/978-3-031-10071-0_21 Rainer Müller, Jörg Franke, Dominik Henrich, Bernd Kuhlenkötter, Annika Raatz, Alexander Verl: Handbuch Mensch-Roboter-Kollaboration. 2., aktualisierte Auflage. - München : Hanser, 2023. - 504 S. Johannes Hartwig, Pascal Ruppert, Dominik Henrich: Input and Editing of Force Profiles of In-Contact Robot Motions via a Touch Graphical User Interface. In: Seventh IEEE International Conference on Robotic Computing. - Laguna Hills, CA : 2023. - S. 182-189.doi:10.1109/IRC59093.2023.00038 Michael Gradmann, Michael Spangenberg, Sascha Sucker, Nico Höllerich, Dominik Henrich: Modalitäten zur Interaktion. In: Rainer Müller, Jörg Franke, Dominik Henrich, Bernd Kuhlenkötter, Annika Raatz, Alexander Verl (Hrsg.): Handbuch Mensch-Roboter-Kollaboration. 2., aktualisierte Auflage. - München : Hanser, 2023. - S. 175-186. Eric M. Orendt, Michael Riedl, Dominik Henrich, Johannes Hartwig, Lukas Sauer, Edgar Schmidt: Programmierung von Robotern. In: Rainer Müller, Jörg Franke, Dominik Henrich, Bernd Kuhlenkötter, Annika Raatz, Alexander Verl (Hrsg.): Handbuch Mensch-Roboter-Kollaboration. 2., aktualisierte Auflage. - München : Hanser, 2023. - S. 186-209. 2022Josua Bloeß, Dominik Henrich: Incremental Online Reconstruction of Locally Quadric Surfaces. In: Proceedings of the 17th International Joint Conference on Computer Vision, Imaging and Computer Graphics Theory and Applications (VISIGRAPP 2022). Volume 1. GRAPP. - Setúbal : SciTePress, 2022. - S. 155-162.doi:10.5220/0010795100003124 Edgar Schmidt, Dominik Henrich: Intuitive Optimization of Kinesthetic Programmed Trajectories for Fiber Spraying. In: Andreas Müller, Mathias Brandstötter (Hrsg.): Advances in Service and Industrial Robotics : RAAD 2022. - Cham : Springer, 2022. - S. 80-88.doi:10.1007/978-3-031-04870-8_10 Edgar Schmidt, Dominik Henrich: Playback Robot Programming Framework for Fiber Spraying Processes. In: Thorsten Schüppstuhl, Kirsten Tracht, Annika Raatz (Hrsg.): Annals of Scientific Society for Assembly, Handling and Industrial Robotics 2021. - Cham : Springer, 2022. - S. 351-362.doi:10.1007/978-3-030-74032-0_29 Michael Riedl, Dominik Henrich: Playback Robot Programming with Loop Increments. In: Thorsten Schüppstuhl, Kirsten Tracht, Annika Raatz (Hrsg.): Annals of Scientific Society for Assembly, Handling and Industrial Robotics 2021. - Cham : Springer, 2022. - S. 375-386.doi:10.1007/978-3-030-74032-0_31 David Singer, Dorian Rohner, Dominik Henrich: Robot-Based Creation of Complete 3D Workpiece Models. In: Thorsten Schüppstuhl, Kirsten Tracht, Annika Raatz (Hrsg.): Annals of Scientific Society for Assembly, Handling and Industrial Robotics 2021. - Cham : Springer, 2022. - S. 289-299.doi:10.1007/978-3-030-74032-0_24 Lukas Sauer, Dominik Henrich: Structure Synthesis for Extended Robot State Automata. In: Andreas Müller, Mathias Bran",
  "content_length": 63535,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:13"
}