{
  "name": "Don Fallis",
  "homepage": "https://www.khoury.northeastern.edu/people/don-fallis",
  "status": "success",
  "content": "Don Fallis - Khoury College of Computer Sciences All People Don Fallis (he/him/his) Professor, Jointly Appointed with College of Social Sciences and Humanities Research interests Research interests Epistemology Philosophy of information Philosophy of mathematics Education Education PhD in Philosophy, University of California, Irvine MA in Philosophy, University of California, Irvine BA in Philosophy, University of California, Irvine BA in Psychology, University of California, Irvine Biography Biography Don Fallis is a professor in the Khoury College of Computer Sciences and the College of Social Sciences and Humanities at Northeastern University, based in Boston. Fallis’ main focus is adversarial epistemology, where he examines how individuals obtain knowledge in a deceptive world while understanding different types of lies and disinformation. He regularly teaches courses on decision-making, information economics, information ethics, information quality, and knowledge in the digital world. Before joining Northeastern University, Fallis was a professor in the School of Information at the University of Arizona. He has also held visiting fellowships at the University of St. Andrews and the University of Utah. His articles on lying and deception have appeared in the Journal of Philosophy, Philosophical Studies, and the Australasian Journal of Philosophy. He has also been featured on Philosophy TV, where he discussed the standard analysis of lying and the intention to deceive. He is on the organizing committee of the Information Ethics Roundtable and is an associate editor for Episteme: A Journal of Individual and Social Epistemology. Recent publications Recent publications Published: July 22, 2021 The Epistemic Threat of Deepfakes Citation: Fallis, D. (2020). The Epistemic Threat of Deepfakes. Philosophy & Technology. https://doi.org/10.1007/s13347-020-00419-2 Published: July 22, 2021 Fake News is Counterfeit News Citation: Fallis, D. & Mathiesen, K. (2019) Fake News is Counterfeit News. Inquiry. doi:10.1080/0020174X.2019.1688179 Published: July 22, 2021 Accuracy, Conditionalization, and Probabilism Citation: Lewis, P. J., & Fallis, D. (2021). Accuracy, conditionalization, and probabilism. Synthese, 198(5), 4017-4033. https://doi.org/10.1007/s11229-019-02298-3 Individual Details Tenured/Tenure-Track Faculty Campus Boston Website https://philpeople.org/profiles/don-fallis Google Scholar See Citations Area of Interest Human-Centered Computing Contact d.fallis@northeastern.edu Related news News at Northeastern NGN: How one philosopher is thinking about the problem of deepfakes, AI and the ‘arms race’ to rein in deception online. February 12, 2024 News at Northeastern Why are we obsessed with stories about liars, grifters and cheats? October 4, 2022 iai News Seeing is not Believing July 22, 2021 Explore all news",
  "content_length": 2855,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:17"
}