{
  "name": "Don Cleland",
  "homepage": "http://www.massey.ac.nz/massey/expertise/profile.cfm?stref=535300",
  "status": "success",
  "content": "Professor Don Cleland - Professor - Massey University Skip to Content BackMassey expertise searchMassey expertise searchMassey expertise searchDoctoral student profilesSearch for output by keyword/authorExpertise search Show search form Expertise search People search (Filtering) Expertise search College All Colleges College of Creative Arts College of Health College of Humanities and Social Sciences College of Sciences DVC Maori Governance and Assurance Massey Business School Massey University Foundation Office of the Provost Strategy Planning and Analytics Students and Global Engagement University Services Department All Departments Academic Business Development Ag and Hort Enterprises Ako Aotearoa Centre for Public Health Research CoCA - Partnerships and Projects CoCA - Professional Administration CoCA - Technical Services CoCA -Teaching and Learning CoCA Maori and Pacific Arts - Te Ranga Tai Kura CoH - Professional Administration CoHSS - Academic Programme CoHSS - Business Manager CoHSS - Professional Administration CoHSS - Teaching and Learning CoS - Professional Administration College Office - Albany College Office - Wellington College of Creative Arts College of Health College of Humanities and Social Sciences College of Sciences DVC Maori DVC Maori - Business Services DVC Maori - Oteha Enterprise Estates Management Finance FoodPilot Funding and Forecast Global Engagement Global Partnership Graduate Research School and Ethics Health Safety and Wellbeing IT Group Information Technology Services Institute of Education Institutional Research Library MBS - Professional Administration MBS - Research MU Foundation Manawatu Microscopy and Imaging Centre Maori Student Success Marketing Student Recruitment and Alumni Massey Business School Massey Business School - Deputy PVC's Office Massey Genome Service Massey University Press Mediation Service NZ Food Safety Science Research Centre New Zealand Institute for Advanced Study Nutrition Lab Office of the DVC Students and Global Engagement Pacific Student Success People and Culture Planning and Performance Provost - Business Services Provost Advisory Research Centre for Maori Health and Development Research Operations Riddet Institute SFAT - Technical Services Manager (MAN) SHORE Centre School of Accountancy Economics and Finance School of Agriculture and Environment School of Art School of Aviation School of Built Environment School of Design School of Food Technology and Natural Sciences School of Health Sciences School of Humanities Media and Creative Comm School of Management and Marketing School of Mathematical and Computational Sciences School of Music and Screen Arts School of Nursing School of People Environment and Planning School of Psychology School of Social Work School of Sport Exercise and Nutrition School of Veterinary Science Student Experience Student Registry Students and Global Engagement - Business Services Te Mata o Te Tau Te Putahi-a-Toi Te Tumu Whakatipu The Centre for Education Transformation University Services - Business Services Whariki Research Centre Keywords Name Search Add criteria Position / Job Title College Department Reset Expertise search - Show advanced search Thematic All 21st Century Citizenship Design – for Commerce, Community and Culture Future Food Systems Health and Well-being Resource Development and Management Keywords Name Academic expert All staff General staff Reset Contact details +6469517127 Professor Don Cleland BTech(Hons), PhD Professor Doctoral Mentor Supervisor School of Food Technology and Natural Sciences Professor Cleland undertakes fundamental & applied research relevant to industrial refrigeration, food processing, energy efficiency, sustainability & heat pump technologies. A common outcome has been simple, yet accurate, methods to optimise the design & operation of food refrigeration & processing systems. Improved environmental performance, particularly energy efficiency, has also been sought. A long term focus has been prediction of food freezing & chilling rates while significant developments have arisen from recent thermal conductivity prediction research leading to definitive texts for practitioners. An important new direction has been moisture transport & RH prediction in refrigerated facilities. Sustainability has become another emergent area while related energy efficiency & food processing research have continued. Most of this research has been funded externally; often by industry. Technology transfer has been achieved through a combination of publications, CPD courses, software development, conference organisation, standards development, demonstration projects, research-based advice to business & consultancy. Professor Cleland is Professor of Process Engineering in the School of Engineering & Advanced Technology. His research interests include industrial refrigeration, energy efficiency and food processing. He is an Honorary Member of the International Institute of Refrigeration and the Australian Institute of Refrigeration, Air-Conditioning and Heating, and a Fellow of the American Society of Heating, Refrigerating & Air-Conditioning Engineers, Engineers NZ, the Institute of Refrigerating, Heating and Air-Conditioning Engineers of NZ and the NZ Institute of Food Science and Technology. He is a Board member of the MacDiarmid Institute and the NZ Robotics Charitable Trust.More about me...View less... Professional Contact details Ph: +64-6-3505240 (DDI) or +64-6-3569099 extn 84127Location: RB2.94, RiddetCampus: Manawatu Qualifications Bachelor of Technology (Honours) - Massey University (1981) Doctor of Philosophy - Massey University (1985) Research Expertise Research Interests Professor Cleland undertakes fundamental & applied research relevant to industrial refrigeration, food processing, energy efficiency, sustainability & heat pump technologies. A common outcome has been simple, yet accurate, methods to optimise the design & operation of food refrigeration & processing systems. Improved environmental performance, particularly energy efficiency, has also been sought. A long term focus has been prediction of food freezing & chilling rates while significant developments have arisen from recent thermal conductivity prediction research leading to definitive texts for practitioners. An important new direction has been moisture transport & RH prediction in refrigerated facilities. Sustainability has become another emergent area while related energy efficiency & food processing research have continued. Most of this research has been funded externally; often by industry. Technology transfer has been achieved through a combination of publications, CPD courses, software development, conference organisation, standards development, demonstration projects, research-based advice to business & consultancy. Thematics Resource Development and Management, Design – for Commerce, Community and Culture, Future Food Systems Area of Expertise Field of research codes Chemical Engineering (090400): Engineering (090000): Food Engineering (090802): Food Sciences (090800): Technology (100000) Keywords Industrial refrigeration. Heat pumping. Energy efficiency. Food processing. Sustainability. Research ProjectsCompleted Projects Project Title: CALL - NSC - Individual engagement agreement - Science for Technological Innovation National Science Challenge Date Range: 2015 - 2024 Funding Body: Callaghan Innovation Project Team: Prof Don Cleland - Project Leader Project Title: Fibreboard Packaging MAUX1302 Date Range: 2013 - 2020 Funding Body: Ministry of Business, Innovation and Employment Project Team: Prof John Bronlund - Project Leader Prof Andrew East - Project Leader Jamal Olatunji - Team Member (Doctoral Student) Dr Karl Dahm - Team Member Dr Richard Love - Team Member Dr Maria J. Ferrua - Team Member Prof Don Cleland - Team Member Nicolas Tapia Zapata - Team Member (Doctoral Student) Research Outputs Journal Request Academic Output Hoang, DK., Walmsley, TG., Cleland, DJ., Chen, Q., & Carson, JK. (2025). Thermo-economic investigation and multi objective optimization of cascade high temperature heat pump using low global warming refrigerants. Applied Thermal Engineering. 279[Journal article]Authored by: Chen, Q., Cleland, D.Read article at Massey Research Online: Read Online: Read Abstract: Wang, J., Carson, JK., North, MF., & Cleland, DJ. (2025). Corrigendum to “A new approach to modelling the effective thermal conductivity of heterogeneous materials” [International Journal of Heat and Mass Transfer 49 (2006) 3075–3083, (S0017931006001293), (10.1016/j.ijheatmasstransfer.2006.02.007)]. International Journal of Heat and Mass Transfer. 236[Journal article]Authored by: Cleland, D.Read Online: Read Abstract: Walmsley, TG., Lincoln, BJ., Padullés, R., & Cleland, DJ. (2024). Advancing Industrial Process Electrification and Heat Pump Integration with New Exergy Pinch Analysis Targeting Techniques. Energies. 17(12)[Journal article]Authored by: Cleland, D.Read article at Massey Research Online: Read Online: Read Abstract: 6 Kong, L., Walmsley, TG., Hoang, DK., Schlosser, F., Chen, Q., Carson, JK., . . . Cleland, DJ. (2024). Transcritical-transcritical cascade CO2 heat pump cycles for high-temperature heating: A numerical evaluation. Applied Thermal Engineering. 238[Journal article]Authored by: Chen, Q., Cleland, D.Read Online: Read Abstract: 22 Klinac, E., Carson, JK., Hoang, D., Chen, Q., Cleland, DJ., & Walmsley, TG. (2023). Multi-Level Process Integration of Heat Pumps in Meat Processing. Energies. 16(8)[Journal article]Authored by: Chen, Q., Cleland, D.Read article at Massey Research Online: Read Online: Read Abstract: 4 view more... Taylor, JJ., Carson, JK., Hoang, DK., Walmsley, TG., Chen, Q., & Cleland, DJ. (2022). Use of Refrigerant Blends to Improve Thermal Efficiency of Heat Pump Cycles. Chemical Engineering Transactions. 94, 1189-1194[Journal article]Authored by: Chen, Q., Cleland, D.Read Online: Read Abstract: 3 Adamson,",
  "content_length": 77125,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:17"
}