{
  "name": "Don Samitha Elvitigala",
  "homepage": "https://research.monash.edu/en/persons/don-samitha-samitha-elvitigala",
  "status": "success",
  "content": "Don Samitha Elvitigala - Monash University X View Scopus Profile Don Samitha Elvitigala Dr Senior Lecturer, Department of Human Centred Computing https://orcid.org/0000-0002-8013-5989 EmailDon.Elvitigalamonashedu Accepting PhD StudentsPhD projectsI am available to Supervise students in the areas of: - Human-Computer Interaction - Human Augmentations - Wearable Computing - Ubiquitous Computing - Haptics 20162025 Research activity per year Personal profile BiographyDon Samitha Elvitigala is a Lecturer in the Exertion Games Lab at MonashHis research investigates novel human augmentations that can enhance human capabilities by implicitly understanding humans' physical and mental behaviours. In particular, he explores how we can utilise everyday clothes and clothing accessories to develop augmented human interfaces.  He has published his work in premier peer-reviewed HCI conferences and journals, such as CHI, UIST, MobileHCI, UbiComp, and ToCHI. Some of his publications have received honourable mention award and best paper award.Before joining Monash Don Samitha was a postdoctoral fellow in the School of Computer Science and Engineering at UNSW, Sydney where he co-created HCI BoDi Lab. At UNSW he investigated how a network of human augmentations can serve a community by context and environmental sensing.He completed his Ph.D. in human-computer interaction (Uncovering the Potential of the Foot for Novel I/O Interfaces) at the Auckland Bioengineering Institute (ABI) of the University of Auckland, New Zealand in July 2021.  The concept of his Ph.D. dissertation was runner-up for the best presentation at the doctoral colloquium of UbiComp 2018. Also, his thesis won the best thesis award in ABI for 2021, was selected to the Graduate School dean's list, and was nominated for the ACM dissertation award. Research interestsHuman-Computer InteractionHuman AugmentationsWearable ComputingUbiquitous ComputingHuman-Centered Computing Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationHuman Computer Interaction, PhD, Uncovering the Potential of the Foot for Novel I/O Interfaces, University of Auckland1 Mar 2018 → 1 Mar 2021Award Date: 28 Sept 2022 External positionsVisiting Lecturer - School of Computer Science and Engineering, University of New South Wales (UNSW)31 May 0001 Research area keywordsHuman Computer InteractionWearable ComputingHuman AugmentationsHapticsUbiquitous Computing Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2016 2024 2025 2025 43 Conference Paper 4 Article Research output per year Research output per year Towards using involuntary body gestures for measuring the user engagement in VR gamingElvitigala, D. S., Somarathna, R., Yan, Y., Mohammadi, G. & Quigley, A., 2022, Adjunct Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology. Adar, E. & Setlur, V. (eds.). New York NY USA: Association for Computing Machinery (ACM), 3 p. 5Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 3 Citations (Scopus) Troi: Towards understanding users perspectives to mobile automatic emotion recognition system in their natural settingDissanayake, V., Tang, V., Elvitigala, D. S., Wen, E., Wu, M. & Nanayakkara, S., 20 Sept 2022, In: Proceedings of the ACM on Human-Computer Interaction. 6, MHCI, 22 p., 203.Research output: Contribution to journal › Article › Research › peer-review 8 Citations (Scopus) TickleFoot: design, development and evaluation of a novel foot-tickling mechanism that can evoke laughterElvitigala, D. S., Boldu, R., Nanayakkara, S. & Matthies, D. J. C., Jun 2022, In: ACM Transactions on Computer-Human Interaction. 29, 3, 23 p., 20.Research output: Contribution to journal › Article › Research › peer-review 13 Citations (Scopus) StressShoe: a DIY toolkit for just-in-time personalised stress interventions for office workers performing sedentary tasksElvitigala, D. S., Scholl, P. M., Suriyaarachchi, H., DIssanayake, V. & Nanayakkara, S., 2021, Proceedings of MobileHCI 2021 - The ACM International Conference on Mobile Human-Computer Interaction. Cauchard, J. & Serrano, M. (eds.). New York NY USA: Association for Computing Machinery (ACM), 14 p. 38Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 20 Citations (Scopus) GymSoles++: combining Google glass with smart insoles to improve body posture when performing squatsElvitigala, D. S., Matthies, D. J. C., Weerasinghe, C. & Nanayakkara, S., 2021, 14th ACM International Conference on PErvasive Technologies Related to Assistive Environments, PETRA 2021. Makedon, F. (ed.). New York NY USA: Association for Computing Machinery (ACM), p. 48-54 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 10 Citations (Scopus) View all 47 research outputs Prizes Best PhD Thesis Prize 2021 - Auckland Bioengineering InstituteSamitha Elvitigala, D. (Recipient), Apr 2022Prize: Prize (including medals and awards) Doctoral Colloquium Best Presentation Award Runner-Up at UbiComp 2018Samitha Elvitigala, D. (Recipient), 2018Prize: Prize (including medals and awards) Doctor of Philosphy Examination – Dean’s ListSamitha Elvitigala, D. (Recipient), Aug 2021Prize: Prize (including medals and awards) GymSoles++ – Best Student Paper Award at PETRA 2021Samitha Elvitigala, D. (Recipient), 2021Prize: Prize (including medals and awards) Nominated for ACM Doctoral Thesis Award 2021Samitha Elvitigala, D. (Recipient), 2021Prize: Prize (including medals and awards) View all 9 prizes Activities Activities per year 2014 2020 2022 2023 2023 8 Contribution to conference 3 Performance/exhibition 1 Public event Activities per year Augmented Humans International Conference 2023Elvitigala, D. S. (Member of programme committee)12 Mar 2023 → 14 Mar 2023Activity: Participating in or organising an event types › Contribution to conference The ACM International Conference on Mobile Human-Computer Interaction 2023Elvitigala, D. S. (Member of programme committee)23 Sept 2023 → 26 Sept 2023Activity: Participating in or organising an event types › Contribution to conference IEEE International Symposium on Mixed and Augmented Reality 2023Elvitigala, D. S. (Organiser)16 Oct 2023 → 20 Oct 2023Activity: Participating in or organising an event types › Contribution to conference International Conference on Human Factors in Computing Systems 2023Elvitigala, D. S. (Member of programme committee)23 Apr 2023 → 28 Apr 2023Activity: Participating in or organising an event types › Contribution to conference Augmented Humans International Conference 2022Elvitigala, D. S. (Member of programme committee)13 Mar 2022 → 15 Mar 2022Activity: Participating in or organising an event types › Contribution to conference View all 12 activities Press/Media Watch a foot-tickling machine discover the most ticklish spot on feetElvitigala, D. S.25/03/221 item of Media coveragePress/Media: Article/Feature New technology to take temperature of the feet of diabeticsElvitigala, D. S.2/08/211 Media contributionPress/Media: Article/Feature Touch me Gently Recreates Natural Touch Sensation Using Shape-Memory Alloy MatrixElvitigala, D. S.26/05/201 Media contributionPress/Media: Article/Feature GymSoles Help You Improve Your Squats and Deadlifts by Monitoring and Correcting Your FormElvitigala, D. S.22/05/191 Media contributionPress/Media: Article/Feature This Doormat Can Tell Who You Are for Multi-Factor AuthenticationElvitigala, D. S.22/05/191 Media contributionPress/Media: Article/Feature View all 7 press/media",
  "content_length": 8200,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:17"
}