{
  "name": "Donald F. Towsley",
  "homepage": "https://www.cics.umass.edu/about/directory/donald-towsley",
  "status": "success",
  "content": "Donald Towsley : Manning College of Information & Computer Sciences : UMass Amherst Skip to main content The University of Massachusetts Amherst Image Donald Towsley Director of the Quantum Information Systems Institute Distinguished Professor (on leave Spring 2026) Contact towsley [at] cs [dot] umass [dot] edu (413) 545-0207 Location Room W208 Computer Science Building 140 Governors Dr Amherst, MA 01003 United States Research Areas Networking and Distributed Systems Security and Privacy Quantum Information Systems About Donald Towsley's research spans a wide range of activities, from quantum and classical networking and secure communications to distributed learning and inference. He pioneered the area of network tomography and the use of fluid models for the analysis and control of large networks. More recently, he pioneered the theoretical study of covert communications and is one of the leading researchers in the area of quantum networking. He is one of the highly cited computer scientists with over 250 articles in leading journals.Towsley joined the faculty at the University of Massachusetts in the Department of Electrical and Computer Engineering in 1976, and moved to the Manning College of Information and Computer Sciences in 1986. He was named University Distinguished Professor of Computer Science in 1998. Towsley was a visiting Sscientist at the IBM T.J. Watson Research Center (1982-83, 2003, 2010), INRIA (1996, 2004, 2011, 2017), AT&T Labs – Research (1996-97), Cambridge Microsoft Research Lab (2004), and a visiting professor at the Laboratoire MASI, Paris (1989-90).Towsley has been an editor in chief of the IEEE/ACM Transactions on Networking, and a cofounding editor in chief of ACM Transactions on Modeling and Performance Evaluation of Computing Systems. He has also served on numerous editorial boards and as program chair of numerous conferences. He is a five-time recipient of the Best Paper Award of the ACM Sigmetrics Conference and has received four Test of Time Awards for his work.  Towsley is the recipient of one of the IEEE's most prestigious honors, the 2007 IEEE Koji Kobayashi Computers and Communications Award. He has also received Achievement Awards from ACM SIGCOMM and ACM SIGMETRICS. He is a Fellow of the IEEE and of the ACM. He also received a UMass Amherst Distinguished Faculty Lecturer award in 2002, a UMass Amherst College of Natural Sciences and Mathematics Faculty Research Award in 2003, a  Samuel F. Conti Faculty Fellowship Award in 2008, and a UMass Award for Outstanding Accomplishments in Research and Creative Activity, 2008.  He was also elected to the Brazilian Academy of Sciences as a corresponding member. Links Website Primary research Lab Advanced Classical and Quantum Information Research Lab Research affiliations Center for Data Science Cybersecurity Institute Education PhD, computer science, University of Texas, 1975 BA, physics, University of Texas, 1971 Donald Towsley in the News Image Awards CICS Researchers Recognized in Research.com's 2024 Lists of Top Scientists Three Manning College of Information and Computer Sciences (CICS) faculty members have been named among the nation’s top 80 Best Computer Science Scientists Read more Research UMass Amherst Researchers Join $26 Million Quantum Computing Effort to Build Internet of the Future An interdisciplinary team at UMass, under the leadership of Don Towsley, is helping to lead the charge on quantum computing. Read more Global footer ©2025 University of Massachusetts Amherst Site policies Privacy Non-discrimination notice Accessibility Terms of use",
  "content_length": 3603,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:21"
}