{
  "name": "Donald E. Porter",
  "homepage": "http://www.cs.unc.edu/~porter",
  "status": "success",
  "content": "Donald E. Porter Donald E. Porter a.k.a. Don Porter Professor of Computer Science at The University of North Carolina at Chapel Hill. Office: 344 Fred Brooks Computer Science Building Email: porter [at] cs {dot} unc (dot) edu Phone/Fax: (919) 590-6044 Department of Computer Science University of North Carolina at Chapel Hill Campus Box 3175, Brooks Computer Science Building Chapel Hill, NC 27599-3175 Ph.D. in Computer Science, The University of Texas at Austin, 2010. M.S. in Computer Science, The University of Texas at Austin, 2007. B.A. in Computer Science and Mathematics, Hendrix College, 2003. My research develops better abstractions for managing concurrency and security, primarily in the operating system, and extends these abstractions to other portions of the technology stack as appropriate. I am the ringleader of the Operating systems, Security, Concurrency, and Architecture Research (OSCAR) Lab. I was honored to receive an NSF CAREER award in 2012. I am also an Amazon Scholar Selected Publications (complete publications) A Probabilistic Model and Metrics for Estimating Perceived Accessibility of Desktop Applications in Keystroke-Based Non-Visual Interactions [PDF] CHI '23 Md Touhidul Islam, Donald E. Porter, and Syed Masum Billah, Mosaic Pages: Big TLB Reach with Small Pages [PDF] ASPLOS '23 [Distinguished Paper Award] Krishnan Gosakan, Jaehyun Han, William Kuszmaul, Ibrahim Nael Mubarek, Nirjhar Mukherjee, Karthik Sriram, Guido Tagliavini, Evan West, Michael A. Bender, Abhishek Bhattacharjee, Alex Conway, Martin Farach-Colton Jayneel Gandhi, Rob Johnson, Sudarsun Kannan, and Donald E. Porter BetrFS: A Compleat File System for Commodity SSDs [PDF] EuroSys '22 Yizheng Jiao, Simon Bertron, Sagar Patel, Luke Zeller, Rory Bennett, Nirjhar Mukherjee, Michael A. Bender, Michael Condict, Alex Conway, Martin Farach-Colton Xiongzi Ge, William Jannen, Rob Johnson, Donald E. Porter, and Jun Yuan, Civet: An Efficient Java Partitioning Framework for Hardware Enclaves [PDF] USENIX Security '20 Chia-Che Tsai, Jeongsok Son Bhushan Jain, John McAvey, Raluca Ada Popa and Donald E. Porter How to Copy Files [PDF] FAST '20 Yang Zhan, Alex Conway, Yizheng Jiao, Nirjhar Mukherjee, Ian Groombridge, Michael A. Bender, Martin Farach-Colton William Jannen, Rob Johnson, Donald E. Porter, and Jun Yuan, Apps Can Quickly Destroy Your Mobile's Flash: Why They Don't, and How to Keep It That Way [PDF] MobiSys '19 Tao Zhang, Aviad Zuck, Donald E. Porter, and Dan Tsafrir Supporting I/O and IPC via Fine-Grained OS Isolation for Mixed-Criticality Real-Time Tasks [PDF] RTNS '18 [Best Paper Award] Namhoon Kim, Stephen Tang, Nathan Otterness, James H. Anderson, F. Donelson Smith, and Donald E. Porter SteeringWheel: A Locality-Preserving Magnification Interface for Low Vision Web Browsing [PDF] CHI '18 Syed Masum Billah, Vikas Ashok, Donald E. Porter, and I.V. Ramakrishnan The Full Path to Full-Path Indexing [PDF] FAST '18 [Best Paper Nominee] Yang Zhan, Alex Conway, Yizheng Jiao, Eric Knorr, Michael A. Bender, Martin Farach-Colton William Jannen, Rob Johnson, Donald E. Porter, and Jun Yuan, Stash in a Flash [PDF] FAST '18 Aviad Zuck, Yue Li Jehoshua Bruck, Donald E. Porter, and Dan Tsafrir UIWear: Easily Adapting User Interfaces for Wearable Devices [PDF] MobiCom '17 [Video] Jian Xu, Qingqing Cao, Aditya Prakash, Aruna Balasubramanian, and Donald E. Porter Graphene-SGX: A Practical Library OS for Unmodified Applications on SGX [PDF] ATC '17 Chia-Che Tsai, Donald E. Porter, and Mona Vij Ubiquitous Accessibility for Users with Visual Impairments: Are We There Yet? [PDF] CHI '17 Syed Masum Billah, Vikas Ashok, Donald E. Porter, and I.V. Ramakrishnan File Systems Fated for Senescence? Nonsense, Says Science! [PDF] FAST '17 Alex Conway, Ainesh Bakshi, Yizheng Jiao, Yang Zhan, Michael A. Bender, William Jannen, Rob Johnson, Bradley C. Kuszmaul, Donald E. Porter, Jun Yuan, and Martin Farach-Colton A Study of Modern Linux API Usage and Compatibility: What to Support When You're Supporting [PDF] EuroSys '16 [Best Paper Award] Chia-Che Tsai, Bhushan Jain, Nafees Ahmed Abdul, and Donald E. Porter Sinter: Low-Bandwidth Remote Access for the Visually-Impaired [PDF] EuroSys '16 Syed Masum Billah, Donald E. Porter, and I.V. Ramakrishnan Optimizing Every Operation in a Write-Optimized File System [PDF] FAST '16 [Best Paper Award] Jun Yuan, Yang Zhan, William Jannen, Prashant Pandey, Amogh Akshintala, Kanchan Chandnani, Pooja Deo, Zardosht Kasheff, Leif Walsh, Michael Bender, Martin Farach-Colton Rob Johnson, Bradley C. Kuszmaul, and Donald E. Porter How to Get More Value From Your File System Directory Cache [PDF] SOSP '15 [Single-column (ereader-friendly)] Chia-Che Tsai, Yang Zhan, Jayashree Reddy, Yizheng Jiao, Tao Zhang, and Donald E. Porter BetrFS: A Right-Optimized Write-Optimized File System [PDF] FAST '15 [Runner-up Best Paper] William Jannen, Jun Yuan, Yang Zhan, Amogh Akshintala, John Esmet, Yizheng Jiao, Ankur Mittal, Prashant Pandey, Phaneendra Reddy, Leif Walsh, Michael Bender, Martin Farach-Colton Rob Johnson, Bradley C. Kuszmaul, and Donald E. Porter SoK: Introspections on Trust and the Semantic Gap [PDF] Oakland '14 Bhushan Jain, Mirza Basim Baig, Dongli Zhang, Donald E. Porter, and Radu Sion Cooperation and Security Isolation of Library OSes for Multi-Process Applications [PDF] EuroSys '14 Chia-Che Tsai, Kumar Saurabh Arora, Nehal Bandi, Bhushan Jain, William Jannen, Jitin John, Harry A. Kalodner, Vrushali Kulkarni, Daniela Oliveira, and Donald E. Porter Practical Techniques to Obviate Setuid-to-Root Binaries [PDF] EuroSys '14 Bhushan Jain, Chia-Che Tsai, Jitin John, and Donald E. Porter Improving Server Applications with System Transactions [PDF] EuroSys '12 Sangman Kim, Michael Z. Lee, Alan M. Dunn, Owen S. Hofmann, Xuan Wang, Emmett Witchel, and Donald E. Porter TxBox: Building Secure, Efficient Sandboxes with System Transactions [PDF] Oakland '11 Suman Jana, Donald E. Porter, and Vitaly Shmatikov Rethinking the Library OS from the Top Down [PDF] ASPLOS '11 [Influential Paper Award] Donald E. Porter, Silas Boyd-Wickizer, Jon Howell, Reuben Olinsky, and Galen Hunt Operating System Transactions [PDF] Donald E. Porter, Ph.D. Dissertation, The University of Texas at Austin, December 2010. Winner, Bert Kay Dissertation Award from the UT Department of Computer Science. Understanding Transactional Memory Performance [PDF] ISPASS '10 Donald E. Porter and Emmett Witchel Operating System Transactions [PDF] SOSP '09 Donald E. Porter, Owen S. Hofmann, Christopher J Rossbach, Alexander Benn, and Emmett Witchel Teaching COMP 411 Computer Organization Spring 2018 COMP 530 Operating Systems (undergrad) Fall 2024, Fall 2023, Fall 2022, Fall 2020, Fall 2018, Fall 2016 COMP 630 Operating System Implementation Spring 2024, Spring 2022, Spring 2020 COMP 730 Operating Systems (grad) Spring 2025, Spring 2023, Spring 2021 COMP 790 Topics: Virtualization Spring 2017 COMP 915 Technical Communication in Computer Science Spring 2024, Spring 2023 Details on older courses. JOS 64. As part of my Graduate OS course, we have ported JOS to the amd64 architecture. The code and exercises are available on the course page, and solutions are available to instructors upon request. HOSS (aka JOS VMM). As part of a new topics course on virtualization, we have extended JOS to work as a hypervisor for paravirtual JOS instances. The code and exercises are available here. Projects Gramine (formerly Graphene) - A rich Linux library OS, including support for multi-process applications. Received 2024 ACSAC Cybersecurity Artifact Impact Award BetrFS - A write-optimized, general purpose Linux file system. Protego - Practical techniques to obviate setuid-to-root binaries on Linux. TxOS - Adding transactions to the system call API. Laminar - Practical, fine-grained decentralized information flow control (DIFC) support in both the JVM and Linux kernel. Syncchar - Analyzing and tuning the performance of transactional memory workloads. MetaTM/TxLinux - Using hardware transactional memory in the OS kernel. Program Committees EuroSys EuroSyS, HotOS (Co-Chair) ASPLOS HotOS FAST (Co-Chair) FAST, OSDI,SOSP FAST, VEE, ATC, OSDI ATC, SOSP SYSTOR (Co-Chair), ASPLOS (ERC), SFMA, OSDI SOSP, HotOS, USENIX ATC, WWW, SYSTOR, ICDCS, MSST, HotStorage, MaRS VEE (Co-Chair), EuroSys, SYSTOR, MSST EuroSys, FAST (and Poster/WiP session), IC2E, VEE, SFMA, IEEE CLOUD, SOSP Poster Session IC2E, VEE, SFMA, EuroSys Poster Session, APSys, OSDI Poster Session IC2E, IPDPS, SOSP Poster Session SYSTOR Other Funding Software Google Scholar Profile Erdős Number (3) My Academic Genealogy During Fall 2017, I was a Visiting Assistant Professor at the Distributed Systems Group at Instituto Superior Técnico. I served as an Associate Editor for ACM Transactions on Computer Systems (TOCS) from 2019-2022.",
  "content_length": 8849,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:22"
}