{
  "name": "Donald Sannella",
  "homepage": "http://homepages.inf.ed.ac.uk/dts",
  "status": "success",
  "content": "> Don Sannella Don Sannella Emeritus Professor of Computer Science Laboratory for Foundations of Computer Science School of Informatics University of Edinburgh Edinburgh EH8 9AB Scotland Contact dtsinf.ed.ac.uk, +44 131 650 5184, uk.linkedin.com/in/donsannella/ Research My publications (DLBP, Google Scholar) and my Latex bib file. Most of these papers are in my public ftp directory. Security via proof-carrying code and other forms of machine-checkable digital evidence: Mobility and Security group (projects: MRG, MOBIUS, ReQueST, RESA, App Guarden) Algebraic specification: book; Extended ML; foundations of formal software development; CoFI and CASL; Edinburgh work on CoFI/CASL Some other past and present research grants I did some work on the navigation system of the Dervish landmine-detonating robot. A 1999 CNN broadcast about the Dervish is here. Books Order from Springer or Amazon (zbMATH review) (More ...) Order from Springer or Amazon (reviews) (More ...) Teaching 1st-year undergraduate course on Functional Programming 2010/2011 3rd-year undergraduate course on Computability and Intractability 2010/2011 3rd-year undergraduate course on Functional Programming and Specification 2002/2003 postgraduate course on Theory and Practice of Algebraic Specification My Ph.D. students, present and past, and some past M.Sc. and undergraduate students. Editorial In 2001-2024 I was Editor-in-Chief of the journal Theoretical Computer Science, responsible for part B: Logic, Semantics and Theory of Programming [web submission, instructions for guest editors of TCS special issues]. Other work-related stuff I was founding chairman of the ETAPS steering committee - see here for some memories - and was general chair of ETAPS 2005 in Edinburgh, 2-10 April 2005. Me, plus miscellaneous Sannellabration!, Uppsala, 23 April 2017, and a Festschrift A short CV and a short video. I am a Fellow of the Royal Society of Edinburgh. I am founder and CEO of Contemplate Ltd Family: Kara, 10 and Caelan, 7 in January 2004. Kara, 7, Caelan, 4, and both together in May 2001. Kara, 5 and Caelan, nearly 2, on holiday in Tunisia in October 1998. Kara likes doing manga-style drawings, like these on the Milner lecture posters: 2006 (On the impossibility of obfuscation), 2007 (Finite model theory), 2017 (Telling molecules what to do), 2018 (Swift logic for big data and knowledge graphs), this one on model checking and the database group's 2009 Christmas card. Kara does other kinds of drawings and paintings too: poster from her November 2014 exhibition. I used to be a member of Penicuik Archers I'm trying to learn to play mandolin with the help of Andy Miller. Sometimes I play traditional music in the Wednesday evening slow session at Leslie's Bar. I love to ski. For the benefit of search engines Don Sannella. Last modified: Tue Aug 19 10:27:20 BST 2014",
  "content_length": 2859,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:25"
}