{
  "name": "Donald Engel",
  "homepage": "https://www.csee.umbc.edu/people/faculty/don-engel",
  "status": "success",
  "content": "Don Engel – Department of Computer Science and Electrical Engineering Don Engel Position Assistant Professor of Computer Science and Electrical Engineering Office 220 Information Technology and Engineering (ITE) Building Contact Info University of Maryland, Baltimore County 1000 Hilltop Circle Baltimore, MD 21250 email: *protected email* Education 2009-2010 — Postdoctoral Fellow and Medical Physics Resident — Johns Hopkins University 2007-2008 — APS Senior Science Policy Fellow — Washington, DC 2006-2007 — AAAS/APS Congressional Fellow — Office of Rush Holt (NJ-12) 2006 — Postdoctoral Fellow — University of Pennsylvania 2001-2006 — Physics Ph.D. — University of Pennsylvania 2000-2001 — Computer Science Sc.M. — Brown University 1998-2000 — Math-Physics Sc.B. — Brown University 1996-1998 — Math, Physics, Computer Science, and Astronomy major — UMCP Research Areas: As an Assistant Professor of Computer Science and Electrical Engineering, Dr. Engel‘s primary interests are in developing new approaches (especially computer vision, natural language processing, and visualization/VR) which will enable discoveries in the natural sciences, in math, and for engineering applications. Dr. Engel also serves as UMBC’s Associate Vice President for Research Development and holds affiliate appointments in the Department of Physics and the Imaging Research Center. As AVPR, Don leads UMBC’s Office of Research Development, including oversight of most of UMBC’s internal investments in research, external research partnerships, and research infrastructure. Before coming to UMBC, Don served as a Science and Technology Policy Fellow with the U.S. Congress (through an AAAS/APS Fellowship), as the American Physical Society’s Senior Science Policy Fellow, and as a consultant to several federal agencies (as a Senior Consultant in Deloitte Consulting’s federal practice). Dr. Engel holds a Ph.D. in Physics from the University of Pennsylvania, a Computer Science master’s and a Math-Physics bachelor (both from Brown), and conducted additional training as a postdoc at UPenn and as a clinical resident and postdoctoral research fellow in radiation oncology medical physics at Johns Hopkins University. For more information visit https://research.umbc.edu/engel/ This site uses functional cookies and external scripts to improve your experience. Settings and Information Accept Privacy settings Privacy Settings and Information This site uses functional cookies and external scripts to improve your experience. Which cookies and scripts are used and how they impact your visit is specified on the left. Your choices will not impact your visit. Details NOTE: Third-party Google scripts on this website may have access to cross-site third-party cookies under the google.com domain. We, the CSEE Department, do not access, read, or write these third-party cookies, and as a result, we do not control their presence on your browser. You may block them by using a third-party cookie blocker in your browser. If you click Accept below to accept the general cookie consent, then a “wpgdprc-consent” cookie will be stored on your browser, to record your general consent. If you click Accept below to accept the general cookie consent, and also have Google Analytics cookies enabled (on the sidebar to the left), the CSEE Department website will store and access Google Analytics cookies on your browser. We use the data from these cookies to collect information on website usage statistics and improve user experience. If you do not wish to allow Google Analytics cookies on your browser, then either do not click Accept on the bottom bar, or disable Google Analytics on the left. If you log in to this website, then several Wordpress cookies and session variables will be stored on your browser. Accessing the login screen constitutes your consent to have Wordpress cookies and session variables stored on your computer. External Scripts The CSEE Department website makes use of several external scripts to improve user experience. These include, but are not necessarily limited to: Google Calendar, Google Analytics, and ReCAPTCHA. If you choose to use this website, then you agree to allow these scripts to be loaded and executed. External Links Our service may contain links to other sites. If you click on a third-party link, you will be directed to that site. Note that these external sites are not operated by us. Therefore, we strongly advise you to review the Privacy Policy of these websites. We have no control over, and assume no responsibility for the content, privacy policies, or practices of any third-party sites or services. NOTE: These settings will only apply to the browser and device you are currently using. Google Analytics Enables Google Analytics. Enable? Powered by Cookie Information Save my settings",
  "content_length": 4819,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:23"
}