{
  "name": "Donald Greenberg",
  "homepage": "http://aap.cornell.edu/people/donald-greenberg",
  "status": "success",
  "content": "Donald Greenberg | Cornell AAP Search Cornell AAP Search Keyword Search Options Search AAP Cornell University Donald Greenberg Donald Greenberg Jacob Gould Schurman Professor of Computer Graphics Curriculum Vitae (CV) Emeritus and Retired Faculty Department Architecture Contact (607) 255-7444 dpg5@cornell.edu Donald Greenberg, PCG Director Donald Greenberg, the former Jacob Gould Schurman Professor of Computer Graphics, researched and taught in the field of computer graphics from 1966 to 2025. During the last 15 years, he was primarily concerned with research advancing the state-of-the-art in computer graphics and with utilizing these techniques as they may be applied to a variety of disciplines. His specialties include real-time, realistic image generation, color science, and computer-aided architectural design. He taught the computer graphics courses in Computer Science, computer-aided design for the Department of Architecture, computer animation for the Department of Art, and technology strategy in the Business School. He received his B.C.E. from Cornell in 1958 and his Ph.D. in 1968. Greenberg also studied at Columbia University. Related Links True Big Red: Professor Don Greenberg '55 (video) Cornell University Program of Computer Graphics Related News At 88, Greenberg Still on Cutting Edge with New Course Donald Greenberg's \"Cornell Box\" Inspires Mike Shinoda and Collaborator Esteban Diacono Who Is Don Greenberg, and Why Is He Pixelated? Donald Greenberg: 2020 View Conference VIEW Conference Goes Virtual and Attendance is Free Classes (Selected) ARCH 7701/7702 Architectural Science LaboratoryProjects, exercises, and research in the architectural sciences. ARCH 7903/7904 Thesis or Research in Architectural ScienceIndependent study. ARCH 3702/Art 1700/CIS 1620/CS 1620/ENGRI 1620 Visual Imaging in the Electronic AgeInterdisciplinary survey course designed to introduce students in the creative arts, science, and engineering to the concepts of 2D and 3D digital pictorial representation and display. It is a concept course that concentrates on \"why\" rather than \"how.\" Topics include perspective representations, display technology, how television works, bandwidth concepts, digital photography, computer graphics modeling and rendering, color perception, 3D data acquisition, volumetric imaging, and historical precedents, primarily from the art world. NBA 6120 Disruptive Technologies Awards, Grants, and Fellowships (Selected) American Association for the Advancement of Science, Fellow, 2002. ACSA Creative Research Award in Architecture, 1997. National Academy of Engineering, Member, 1991. National Computer Graphics Association Academic Award, 1989. ACM SIGGRAPH Steven A. Coons Award, Outstanding Creative Contributions to Computer Graphics, 1987. Publications (Selected) Greenberg, Don, Kenneth Torrance, Peter Shirley, James Arvo, James A. Ferwerda, Sumanta N. Pattanaik, Eric P.F. Lafortune, Bruce Walter, Sing-Choong Foo, and W. Benjamin Trumbore. \"A Framework for Realistic Image Synthesis\", Computer Graphics Proceedings. \"Computers and Architecture,\" Scientific American 264, no. 2, 199: 104–109. \"Computer Graphics in Architecture,\" Scientific American 230, no. 5, 1974: 98–106. Selected Work Scientific America, 1974. × Architecture Art Planning Real Estate Design Tech About At a Glance Who We Are+— Our Story Mission Leadership DEI + Belonging+— Goals College Organizations Office of Diversity + Inclusion AAP Resources and Services University Resources Our Locations+— Ithaca AAP NYC Cornell in Rome AAP Capital Projects Connect+— Contact Us Visit Us Directories+— Faculty Directory Staff Directory Open Positions Admissions Graduate admissions+— Architecture Art City and Regional Planning Real Estate Design Tech Tuition and Funding Application Deadlines Funding Opportunities Undergraduate admissions+— Architecture Art Urban and Regional Studies Tuition and Financial Aid Application Deadlines Internal Transfer Apply Now Academics Architecture+— Graduate programs Undergraduate program Art+— M.F.A. in Creative Visual Arts M.F.A. in Image Text Undergraduate program City and Regional Planning+— Graduate programs Undergraduate program Real Estate Design Tech+— M.S. in Design Technology AAP Summer Programs AAP NYC Cornell in Rome Student Work Request Program Info Research Cornell Mui Ho Center for Cities Labs Faculty Work Einhorn Engaged Initiative Alumni Affairs Campaign Get Involved Advisory Council Alumni News and Events Alumni Resources Alumni Archive Make a Gift News In the Media Stories Faculty Work Announcements See All News Events Admissions Exhibitions Functions Lectures Symposia Workshops Beyond AAP See All Events Resources Featured+— For Faculty For Students Facilities and Spaces+— Fine Arts Library Studio Spaces Fabrication Shops Making and Production Galleries and Exhibitions Offices and Services+— Office of Student Services Computer Support and Services Finance and HR Support Center Office of Communications",
  "content_length": 4994,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:21"
}