{
  "name": "Donald M. Chiarulli",
  "homepage": "https://people.cs.pitt.edu/~don",
  "status": "success",
  "content": "Donald M. Chiarulli - Computer Science - University of Pittsburgh Donald M. Chiarulli Professor of Computer Science and Computer Engineering at the    University of Pittsburgh. Department of Computer Science Room 5429, Sennott Square Building University of Pittsburgh Pittsburgh, PA 15260 USA Email: don \"at\" cs.pitt.edu Phone: 412-624-8839 Dept: 412-624-8830 Fax: 412-624-5249 Donald M. Chiarulli is a Professor of Computer Science and Computer Engineering at the University of Pittsburgh. He received his Ph.D. in Computer Science in 1986 from Louisiana State University, the first Ph.D. in Computer Science conferred by LSU. He received a M.S. in Computer Science from Virginia Polytechnic Institute in 1979, and a B.S. in Physics from LSU in 1976. Dr. Chiarulli's research can generally be categorized as Experimental Computer Architecture. His career has focused on modeling and testing new designs that exploit emerging technologies for the design of computer systems and embedded computing devices. He has worked extensively in optical computing and photonics, MEMs, micro-fluidics, and 3D integration in systems with applications in Computer Science, Engineering and Biology. A distinguishing thread in all of this work is an emphasis on the development of experimental prototypes and/or cycle accurate models as the basis for investigation. Dr. Chiarulli and his students have designed, fabricated and tested dozens of experimental integrated circuits in conventional CMOS technology and exotic technologies such as GaAs, Silicon on Sapphire, 3D stacked Silicon on Insulator and 3D CMOS/memory stacked architectures.. For much of his career Dr. Chiarulli has enjoyed a close collaboration with colleague Professor Steven Levitan, also at the University of Pittsburgh. Much of the research described below was conducted jointly with Professor Levita nover the course of 27 years of working together read more.. Recent Publications Yan Fang, Donald M. Chiarulli, Steven P. Levitan, \"Associative Processing Using Coupled Oscillators\", (Poster, Paper No. 61.34), 50th IEEE/ACM Design Automation Conference (DAC-13), (Paper No. 150-VL763), Austin, TX, June 2-6, 2013. Steven Levitan, Donald M. Chiarulli, Yan Fang,  Alternative Architectures for Boolean Logic, in book:  Emerging Nanoelectronic Devices; An Chen, Victor Zhirnov, George Bourianoff , Ed.  (Publisher: John Wiley & Sons, Ltd) Joseph Jezak, Charles Berdanier, Steven Levitan, Donald Chiarulli; Accelerated DSP Functions on the CBE for the X-Midas Toolkit; Proceedings: 2012 International Waveform Diversity & Design Conference; Kauai, Hawaii; January 2012. Joseph Jezak, Guy Gadola, Charles Berdanier, Steven Levitan, Donald Chiarulli; Configurable Clutter Models for Radar Simulations; Proceedings: 2012 International Waveform Diversity & Design Conference; Kauai, Hawaii; January 2012. Jeff Brinkhus, Joseph Jezak, Charles Berdanier, Steven Levitan, Donald Chiarulli; Hybrid Clutter Canceler with Feedback Guided Predicative Filtering on a Heterogeneous Parallel Processing System (poster); Proceedings: 2012 International Waveform Diversity & Design Conference; Kauai, Hawaii; January 2012. Samuel J. Dickerson, Steven P. Levitan and Donald M. Chiarulli; Nondestructive Optical Assay Method for Nanoscale Biological Particles in Solution; Proceedings: IEEE  Photonics Society Winter Topical Meetings; Keystone, Colorado, January 2011. Kelli Ireland, Joseph Jezak, Steven Levitan, Donald Chiarulli, Scalable Arbitration of Partitioned Bus Interconnection Networks in 3D-IC Systems,2nd International Workshop on Network on Chip Architectures (NoCArc'09), Paper No. 20, Session IV, pp. 77-82, New York, NY, December 12, 2009. Samuel J. Dickerson, Steven P. Levitan, Donald Chiarulli, 3D Integrated Circuits for Lab-on-Chip Applications, The IEEE International Conference on 3D System Integration (3D IC), pp. 1-8, San Francisco, CA, September 28-30, 2009. Kelli Ireland, Donald Chiarulli, Steven Levitan, A Routerless System Level Interconnection Network for 3D Integrated Systems, The IEEE International Conference on 3D System Integration (3D IC), pp. 1-6, San Francisco, CA, September 28-30, 2009. Joseph A. Jezak, Donald M. Chiarulli, Steven P. Levitan, Charles Berdanier, Accelerated Signal Processing in XMidas Using the Cell Broadband Engine, 11th LCI International Conference on High-Performance Clustered Computing, (poster), Pittsburgh, Pennsylvania, March 8-11, 2010. Best Student Poster. Steven P. Levitan, Donald M. Chiarulli, Timothy P. Kurzweg, Jose A. Martinez, Samuel J. Dickerson, Michael M. Bails, David K. Reed, Jason M. Boles, CAD Tools for Multi-Domain Systems on Chips, (in) Model-Based Design of Embedded Systems, G. Nicolescu and P. Mosterman, Eds. Chapter 20, Taylor & Francis Group, Boca Raton, Florida (in press for 2009). Steven P. Levitan, Donald M. Chiarulli, Massively Parallel Processing: It's Deja vu all over again, (Invited) Proceedings of the 46th IEEE/ACM Design Automation Conference (DAC-09), San Francisco, CA, July 26-31, 2009. Teaching- Course Web Pages CoE 1502 Advanced Digital Design CoE 1567 Programming on a Mobile Robot Platform",
  "content_length": 5144,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:24"
}