{
  "name": "Donald R. Sheehy",
  "homepage": "http://donsheehy.net",
  "status": "success",
  "content": "Don Sheehy Don Sheehy Associate Professor of Computer Science, North Carolina State University don.r.sheehy@gmail.com Home Teaching Research Team Software Outreach Service Talks FAQ CV I am an Associate Professor of Computer Science at the North Carolina State University. My research is in geometric algorithms. I am most interested in the intersection of geometric algorithms and topological data analysis. Watch the video of my talk on Sensors and Samples: A Homological Approach at the Institute for Advanced Study Workshop on Topology. Here is a talk I gave on Mesh Generation and Topological Data Analysis. Research Manuscripts A Theory of Sub-Barcodes Oliver A. Chubet, Kirk Gardner, and Donald R. Sheehy Manuscript 2022 PDF arXiv From the work of Bauer and Lesnick, it is known that there is no functor from the category of pointwise finite-dimensional persistence modules to the category of barcodes and overlap matchings. In this work, we introduce sub-barcodes and show that there is a functor from the category of factorizations of persistence module homomorphisms to a poset of barcodes ordered by the sub-barcode relation. Sub-barcodes and factorizations provide a looser alternative to bottleneck matchings and interleavings that can give strong guarantees in a number of settings that arise naturally in topological data analysis. The main use of sub-barcodes is to make strong claims about an unknown barcode in the absence of an interleaving. For example, given only upper and lower bounds $g\\ge f\\ge\\ell$ of an unknown real-valued function $f$, a sub-barcode associated with $f$ can be constructed from $\\ell$ and $g$ alone. We propose a theory of sub-barcodes and observe that the subobjects in the category of functors from intervals to matchings naturally correspond to sub-barcodes. @misc{https://doi.org/10.48550/arxiv.2206.10504, author = {Oliver A. Chubet and Kirk P. Gardner and Donald R. Sheehy}, title = {A Theory of Sub-Barcodes}, doi = {10.48550/ARXIV.2206.10504}, url = {https://arxiv.org/abs/2206.10504}, publisher = {arXiv}, year = {2022}, } Published The Sum of Squares in Polycubes Donald R. Sheehy SOCG: Symposium on Computational Geometry (Multimedia Session), 65:1-65:6 2023 PDF We give several ways to derive and express classic summation problems in terms of polycubes. We visualize them with 3D printed models. The video is here: http://go.ncsu.edu/sum_of_squares. @inproceedings{sheehy23sum, Author = {Donald R. Sheehy}, Booktitle = {Proceedings of the 39th International Symposium on Computational Geometry (SoCG 2023)}, Title = {The Sum of Squares in Polycubes}, PAges = {65:1--65:6}, Year = {2023}} Greedy Permutations and Finite Voronoi Diagrams Oliver A. Chubet, Paul Macnichol, Parth Parikh, Donald R. Sheehy, and Siddharth S. Sheth SOCG: Symposium on Computational Geometry (Multimedia Session), 64:1-64:5 2023 PDF We illustrate the computation of a greedy permutation using finite Voronoi diagrams. We describe the neighbor graph, which is a sparse graph data structure that facilitates efficient point location to insert a new Voronoi cell. This data structure is not dependent on a Euclidean metric space. The greedy permutation is computed in $O(n \\log \\Delta)$ time for low-dimensional data using this method. @inproceedings{chubet23greedy, Author = {Oliver A. Chubet and Paul Macnichol and Parth Parikh and Donald R. Sheehy and Siddharth S. Sheth}, Booktitle = {Proceedings of the 39th International Symposium on Computational Geometry (SoCG 2023)}, Title = {Greedy Permutations and Finite Voronoi Diagrams}, PAges = {64:1--64:5}, Year = {2023}} Proximity Search in the Greedy Tree Oliver A. Chubet, Parth Parikh, Donald R. Sheehy, and Siddharth S. Sheth SOSA: SIAM Symposium on Simplicity in Algorithms. 2023 PDF Over the last 50 years, there have been many data structures proposed to perform proximity search problems on metric data. Perhaps the simplest of these is the ball tree, which was independently discovered multiple times over the years. However, there is a lack of strong theoretical guarantees for standard ball trees, often leading to more complicated structures when guarantees are required. In this paper, we present the greedy tree, a simple ball tree construction for which we can prove strong theoretical guarantees for proximity search queries, matching the state of the art under reasonable assumptions. To our knowledge, this is the first ball tree construction providing such guarantees. Like a standard ball tree, it is a binary tree with the points stored in the leaves. Only a point, a radius, and an integer are stored for each node. The asymptotic running times of search algorithms in the greedy tree match those of more complicated structures regularly used in practice. @inproceedings{chubet23proximity, title = {Proximity Search in the Greedy Tree}, author = {Oliver Chubet and Parth Parikh and Donald R. Sheehy and Siddharth Sheth}, booktitle = {Proceedings of the SIAM Symposium on Simplicity in Algorithms (SOSA 2023)}, year = {2023}} Nearly-Doubling Spaces of Persistence Diagrams Donald R. Sheehy, and Siddharth S. Sheth SOCG: The International Symposium on Computational Geometry, 60:1-60:15 2022 PDF The space of persistence diagrams under bottleneck distance is known to have infinite doubling dimension. Because many metric search algorithms and data structures have bounds that depend on the dimension of the search space, the high-dimensionality makes it difficult to analyze and compare asymptotic running times of metric search algorithms on this space. We introduce the notion of nearly-doubling metrics, those that are Gromov-Hausdorff close to metric spaces of bounded doubling dimension and prove that bounded $k$-point persistence diagrams are nearly-doubling. This allows us to prove that in some ways, persistence diagrams can be expected to behave like a doubling metric space. We prove our results in great generality, studying a large class of quotient metrics (of which the persistence plane is just one example). We also prove bounds on the dimension of the $k$-point bottleneck space over such metrics. The notion of being nearly-doubling in this Gromov-Hausdorff sense is likely of more general interest. Some algorithms that have a dependence on the dimension can be analyzed in terms of the dimension of the nearby metric rather than that of the metric itself. We give a specific example of this phenomenon by analyzing an algorithm to compute metric nets, a useful operation on persistence diagrams. @inproceedings{sheehy22nearly, title = {Nearly-Doubling Spaces of Persistence Diagrams}, author = {Donald R. Sheehy and Siddharth Sheth}, booktitle = {38th International Symposium on Computational Geometry (SoCG 2022)}, pages = {60:1--60:15}, doi =\t\t{10.4230/LIPIcs.SoCG.2022.60}, year = {2022}} A Sparse Delaunay Filtration Donald R. Sheehy SOCG: The International Symposium on Computational Geometry, 58:1-58:16 2021 PDF arXiv We show how a filtration of Delaunay complexes can be used to approximate the persistence diagram of the distance to a point set in $\\mathbb{R}^d$. Whereas the full Delaunay complex can be used to compute this persistence diagram exactly, it may have size $O(n^{\\lceil d/2 \\rceil})$. In contrast, our construction uses only $O(n)$ simplices. The central idea is to connect Delaunay complexes on progressively denser subsamples by considering the flips in an incremental construction as simplices in $d+1$ dimensions. This approach leads to a very simple and straightforward proof of correctness in geometric terms, because the final filtration is dual to a $(d+1)$-dimensional Voronoi construction similar to the standard Delaunay filtration complex. We also, show how this complex can be efficiently constructed. @inproceedings{sheehy21sparse, title = {A Sparse Delaunay Filtration}, author = {Donald R. Sheehy}, booktitle = {37th International Symposium on Computational Geometry (SoCG 2021)}, pages = {58:1--58:16}, year = {2021}} Sketching Persistence Diagrams Donald R. Sheehy, and Siddharth S. Sheth SOCG: The International Symposium on Computational Geometry, 57:1-57:15 2021 PDF arXiv Given a persistence diagram with $n$ points, we give an algorithm that produces a sequence of $n$ persistence diagrams converging in bottleneck distance to the input diagram, the $i$th of which has $i$ distinct (weighted) points and is a 2-approximation to the closest persistence diagram with that many distinct points. For each approximation, we precompute the optimal matching between the $i$th and the $(i+1)$st. Perhaps surprisingly, the entire sequence of diagrams as well as the sequence of matchings can be represented in $O(n)$ space. The main approach is to use a variation of the greedy permutation of the persistence diagram to give good Hausdorff approximations and assign weights to these subsets. We give a new algorithm to efficiently compute this permutation, despite the high implicit dimension of points in a persistence diagram due to the effect of the diagonal. The sketches are also structured to permit fast (linear time) approximations to the Hausdorff distance between diagrams -- a lower bound on the bottleneck distance. For approximating the bottleneck distance, sketches can also be used to compute a linear-size neighborhood graph directly, obviating the need for geometric data structures used in state-of-the-art methods for bottleneck computation. @inproceedings{sheehy21sketching, title={Sketching Persistence Diagrams}, author={Donald R. Sheehy and Siddharth Sheth}, booktitle = {37th International Symposium on Computational Geometry (SoCG 2021)}, pages = {57:1--57:15}, year={2021}} An Efficient Algorithm for Topological Characterisation of Worm-Like and Branched Micelle Structures from Simulations Breanndan O Conchuir, Kirk Gardner, Kirk E. Jordan, David J. Bray, Richard L. Anderson, Michael A. Johnston, William C. Swope, Alex Harrison, Donald R. Sheehy, and Thomas J. Peters J. Chem. Theory Comput. 2020, 16, 7, 45",
  "content_length": 61498,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:23"
}