{
  "name": "Donal O'Mahony",
  "homepage": "https://www.scss.tcd.ie/Donal.OMahony",
  "status": "success",
  "content": "Home Page for Dr. Donal O'Mahony Dr. Donal E. O'Mahony BA BAI PhD FTCD Professor in Computer Science Postal Address Computer Science Department Trinity College Dublin 2 Ireland E-Mail: Donal.OMahony (at) cs.tcd.ie T: +353 1 896 8445 Donal O'Mahony is Professor in Computer Science at Trinity College Dublin. Research Over the years, Prof. O'Mahony has been active in cryptography, network protocols, security applications, mobility, ad-hoc networking and the software engineering of networked systems. His recent topics of interest include: The Cloud Computing model, network protocols and architectures to support this. Management of Energy Flows in the face of  renewably generated  and unpredictable supply and demand; This includes an interest in Auction Algorithms, Game Theory, Internet-of-things, the Nanogrid abstraction & DC Residential Networks. Digital Currencies including Blockchain based systems derived from Bitcoin ( According to this infographic, he is 7th in a list of people who might have created Bitcoin.) In the period 2004-2009, he was founder director of the Centre for Telecommunications Value-Chain Research (CTVR). This centre created an unprecedented collaboration among teams from eight separate Irish third level institutions allowing them to work in an effective 100-man team effort to deliver top-quality research across a range of topics in telecommunications. The initiative acted as the catalyst for the establishment of Bell Labs Ireland -a jewel in the crown for Irish research in ICT. Among the many achievements of CTVR under O'Mahony's leadership were the creation of multiple spin-out companies, the successful commercial licencing of research results and the publication of over 400 high-quality papers in international journals and conferences.  The center continues today as CONNECT. Since 2016, his main interest has been in Blockchain Technologies and Cryptocurrencies and this has led to the formation of the Blockchain Futures Group (BFG) whose recent activities are shown here. Publications He is also author of more than 100 papers published in International journals and conferences.  A partial list of these can be found HERE Donal O'Mahony is author of two books (both best-sellers in their categories), the first Local Area Networks & their Applications was published by Prentice-Hall in 1988,it was also translated into Japanese and published by Kaibundo Publishing corporation. A second book entitled \"Electronic Payment Systems\" was published by Artech House in May 1997, went to 2nd edition in 2001 Teaching He lectures on CSU44081 Entrepreneurship & High-Tech Venture Creation and CSU44000 Internet Applications - both courses targeted at advanced unergraduate or postgraduate level. He was the founding course director (2016-2019) for the MSc in Computer Science Programme. This course now graduates approximately 150 students each year in Data Science, AI, Augmented Reality and Networking. As part of his interest in computer network & security, he has recently acted as external examiner for University College Dublin's MSc in Forensic Computing & Cybercrime Investigations Entrepreneurship O'Mahony has founded or been involved in a number of internet startup companies over the years including: Letterpost.com, Ezitrust.Com , Metakall.com and Xcelerit.Com. Career to Date Donal O'Mahony graduated with first class honours in Engineering from Trinity College Dublin in 1982. His first job was with SORD Computer Corporation in Japan and Dublin. Sord was a Japanese startup company with aspirations to displace Apple as the then leader in micro-computers. O'Mahony served as their operating system specialist, working with CP/M, CP/M-86, the UCSD P-System, Sord's proprietary operating system and the emerging MS-DOS. A brief exposure to the new IBM PC in late 1982 caused him to go to work with IBM Ireland helping to launch the original IBM PC. He was recruited by Trinity College as a lecturer in Computer Science in 1984 where he later completed a PhD in the area of software reusability. Around 1990, he set up the Networks & Telecommunications Research Group which did pioneering work in the esablishment of the global X.500 directory service (initially implemented over an academic X.25 network infrastructure called IXI) and in using the system in a wide variety of applications including a pre-web form of electronic commerce. In 1988, when Local Area Networks were beginning to appear on the mass-market, he published a textbook with Prentice-Hall publishers entitled Local Area Networks and their Applications which became a best-seller in this emerging field and was subsequently published in Japanese, Polish as well as in a low-cost edition for the Indian market. His research group has been very active in the development of novel security protocols, in particular in Electronc Payment and in 1997, he and two of his research students published Electronic Payment Systems with Artech House. This book became the leading text in this area, went to 2nd edition, and was awarded a 'best seller in class\" award by Amazon.Com in 2000. In 1998/99, O'Mahony was awarded a Fulbright scholarship to spend a sabbatical year at Stanford, California. In addition to his research work at Stanford he became involved with the very active technology entrepreneurship programme. He started a web company called LetterPost.Com in late 1998. A business plan was developed in conjunction with a colleague and entered into Stanford Entrepreneur's E-Challenge where it was repeatedly subjected to the scrutiny of judges from the Sand Hill road venture capital community and reached the final of the competition [24Mb Newsclip from Channel 4 News, NY Times Article]. O'Mahony continued as CEO of letterpost.com until it was acquired by the Escher Group in 2000. In the early 2000s, he founded a national X.509 certification authority called Ezitrust.com O'Mahony is a senior member of the IEEE and was made a fellow of Trinity College in May 2000. Of Historical Interest From 1996-1999 he delivered regular seminars to European audiences on Electronic Payment Systems In the early days of Voice-over-IP (around 1997/1998), he also ran courses on the emerging Internet Telephony area. The slides are (available here) give an interesting snapshot of the VoIP situation in 1998 and may one day be of historical interest. These were organized by Technology Appraisals of London, England. Patent & Expert Witness Work O'Mahony has acted as expert witness in litigation involving his expertise in both electronic payment and in cellular and internet networking. for Cooley Godward LLP where the client was a major internet auction house for Kirkland & Ellis LLP where the client was a major internet bookseller For Wolf Greenfield where the client was a mobile device company For Cravath, Swaine & Moore LLP where the client was a gaming/metaverse company Last Updated: March, 2021 Donal.OMahony (at) cs.tcd.ie",
  "content_length": 6960,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:20"
}