{
  "name": "Donald Yeung",
  "homepage": "https://ece.umd.edu/~yeung",
  "status": "success",
  "content": "Donald Yeung Donald Yeung Professor Associate Chair for Undergraduate Education Department of Electrical and Computer Engineering Affiliate Professor Department of Computer Science 1427 A. V. Williams College Park, MD 20742 (301) 405-3649 yeung@umd.edu Research Projects: Monolithic 3D Integration of Accelerators and Main Memory Systems. Programmable and Energy Efficient Extreme-Scale Processors. Multicore reuse distance analysis is part of this project. Click here for details. Approximate or Soft Computing. Vortex: Optimizing Code and Memory using Spare Execution Resources. Teaching: ENEE 150--Intermediate Programming Concepts for Engineers (F25) ENEE 446--Digital Computer Design (S24) ENEE 646--Computer Architecture (F24) Service: ISCA 2025 Program Committee (\"Light\" PC Member) HPCA 2024 Program Committee (\"Light\" PC Member) Students: Yinuo Wang Curriculum Vitae: click here Selected Publications: (click here for full list) MORSE: Memory Overwrite Time Guided Soft Writes to Improve ReRAM Energy and Endurance. Devesh Singh and Donald Yeung. In Proceedings of the 33rd International Conference on Parallel Architectures and Compilation Techniques (PACT-XXXIII). Long Beach, CA. October 2024. Monolithically Integrating Non-Volatile Main Memory Over the Last-Level Cache. Candace Walden, Devesh Singh, Meenatchi Jagasivamani, Shang Li, Luyi Kang, Mehdi Asnaashari, Sylvain Dubois, Bruce Jacob, and Donald Yeung. ACM Transactions on Architecture and Code Optimization. Vol. 18, No. 4, Article 48. July 2021. Nested MIMD-SIMD Parallelization for Heterogeneous Microprocessors. Daniel Gerzhoy, Xiaowu Sun, Michael Zuzak, and Donald Yeung. ACM Transactions on Architecture and Code Optimization. Vol. 16, No. 4, Article 48. December 2019. Analyzing the Monolithic Integration of a ReRAM-based Main Memory into a CPU's Die. Meenatchi Jagasivamani, Candace Walden, Devesh Singh, Luyi Kang, Shang Li, Mehdi Asnaashari, Sylvain Dubois, Bruce Jacob, and Donald Yeung. IEEE Micro (Special Issue on Monolithic 3D Architectures). Vol. 39, Issue 6. November/December 2019. Studying the Impact of Multicore Processor Scaling on Directory Techniques via Reuse Distance Analysis. Minshu Zhao and Donald Yeung. In Proceedings of the 21st International Symposium on High Performance Computer Architecture (HPCA-XXI). San Francisco Bay Area, CA. February 2015. Unlocking the True Potential of 3D CPUs with Micro-Fluidic Cooling. Caleb Serafy, Ankur Srivastava, and Donald Yeung. In Proceedings of the International Symposium on Low Power Electronics and Design (ISLPED'14). La Jolla, CA. August 2014. Studying Multicore Processor Scaling via Reuse Distance Analysis. Meng-Ju Wu, Minshu Zhao, and Donald Yeung. In Proceedings of the 40th International Symposium on Computer Architecture (ISCA-XL). Tel-Aviv, Israel. June 2013. Last updated: September 2025 by Donald Yeung (yeung@umd.edu)",
  "content_length": 2880,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:27"
}