{
  "name": "Dong Wang 0002",
  "homepage": "https://www.wangdong.org",
  "status": "success",
  "content": "Dr. Dong Wang School of Information Sciences University of Illinois Urbana-Champaign Dong Wang Ph.D. Professor School of Information Sciences Siebel School of Computing and Data Science (Affiliated) Illinois Informatics University of Illinois Urbana-Champaign Tel: +1-217-244-6412 Email: dwang24 at illinois dot edu The SSI Lab has multiple openings for Ph.D. students in Information Science, Computer Science, and Informatics at UIUC. If you are interested in working with us after reading our research profile and recent publications, please feel free to contact Prof. Wang. Home Social Sensing & Intelligence Lab Publications Teaching & Services Google Scholar Biography I am a full professor in the School of Information Sciences and the Siebel School of Computing and Data Science (affiliated) at the University of Illinois Urbana-Champaign (UIUC). I received my Ph.D. degree in Computer Science at UIUC. I am also affiliated with the Illinois Informatics, the National Center for Supercomputing Applications (NCSA), the Information Trust Institute, the Carl R. Woese Institute for Genomic Biology (IGB), and the Center for Social and Behavioral Science (CSBS) at UIUC. Research Interests Social Sensing, Intelligence, and Computing Human-Centered AI, Responsible AI, Personalized AI AI for Social Good, AI for Science Cyber-Physical Systems, Edge Computing, Smart Cities Honors and Awards Best Paper Honorable Mention: 2025 ACM CHI conference on Human Factors in Computing Systems (CHI 2025) Fall 2022, 2023, Spring 2023, 2024, List of Teachers Ranked as Excellent by Their Students at UIUC Senior Member, Institute of Electrical and Electronics Engineers (IEEE) Best Paper Award (Research Track): 2022 ACM/IEEE International Conference on Advances in Social Networks Analysis and Mining (ASONAM) Best Paper Honorable Mention: 8th IEEE International Conference on Smart Computing (SMARTCOMP) NSF CAREER Award Google Faculty Research Award ARO Young Investigator Program Award (YIP) NSF CISE Research Initiation Initiative (CRII) Award Wing Kai Cheng Fellowship: University of Illinois at Urbana Champaign Best Paper Award: 16th IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS)",
  "content_length": 2206,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:31"
}