{
  "name": "Dong Wen 0001",
  "homepage": "https://www.cse.unsw.edu.au/~dwen",
  "status": "success",
  "content": "DWDr. DONG WENSchool of Computer Science and EngineeringUniversity of New South WalesSydney NSW 2052, Australiadong.wen@unsw.edu.auAbout Me I am currently a Senior Lecturer and an ARC DECRA fellow in the Data and Knowledge Research Group, the School of Computer Science and Engineering, the University of New South Wales (UNSW), Australia. I received my Ph.D. degree from the University of Technology Sydney (UTS) and my Bachelor degree from the Nankai University.We are recruiting self-motivated MPhil and PhD students. Send me an email with your CV and transcript if you would like to pursue a research degree (PhD and MPhil) in the area of Big Data analytics and Database. PhD scholarship with tuition fee waiver will be provided to outstanding applicants.Research InterestsBig Data ProcessingDistributed Algorithms; I/O Efficient Algorithms; GPU Acceleration; Database SystemsGraph MiningGraph Neural Networks; Scalable Graph Processing; AI4DB & DB4AISelected Conference PapersK. Chen, D. Wen, H. Wang, Z. Yang, W. Zhang, and X. LinCovering K-Cliques in Billion-Scale GraphsInternational World Wide Web Conference, 2025 (WWW'25)W. Chen, W. Li, M. Gao, D. Wen, M. Cai, and W. WangLocally Balancing Signed GraphsInternational Conference on Knowledge Discovery and Data Mining, 2025 (KDD'25)D. Ouyang, D. Wen, J. Yang, W. Li, and X. LinWeight-Constrained Simple Path Enumeration in Weighted GraphInternational Conference on Knowledge Discovery and Data Mining, 2025 (KDD'25)W. Li, D. Wen, L. Qin, and Y. ZhangAn Overview of Path Queries on GraphsInternational Conference on Data Engineering, 2025 (ICDE'25)Z. Chen, K. Chen, D. Wen, Z. Yang, W. Li, and Y. ZhangAccelerating Shortest Path Counting on Road NetworksInternational Conference on Data Engineering, 2025 (ICDE'25)G. Zhao, D. Wen, X. Wang, K. Wang, and X. LinPreserving K-Connectivity in Dynamic GraphsInternational Conference on Data Engineering, 2025 (ICDE'25)Y. Wang, D. Ouyang, Z. Wang, D. Wen, and X. LinEfficient Route and Area Matching Query in Dynamic Road NetworksInternational Conference on Data Engineering, 2025 (ICDE'25)H. He, Z. Yang, D. Wen, W. Zhang, M. Yu, W. Yang, and W. ZhangA Survey on Efficient Graph Reachability QueriesPacific-Asia Conference on Knowledge Discovery and Data Mining, 2025 (PAKDD'25)W. Zhang, Z. Yang, D. Wen, W. Li, W. Zhang, and X. LinAccelerating Core Decomposition in Billion-Scale HypergraphsInternational Conference on Management of Data, 2025 (SIGMOD'25)L. Xu, D. Wen, L. Qin, R. Li, Y. Zhang, Y. Lu, and X. LinMinimum Spanning Tree Maintenance in Dynamic GraphsInternational Conference on Management of Data, 2025 (SIGMOD'25)L. Xu, D. Wen, L. Qin, R. Li, Y. Zhang, and X. LinConstant-time Connectivity Querying in Dynamic GraphsInternational Conference on Management of Data, 2025 (SIGMOD'25)W. Huang, H. Wang, D. Wen, X. Chen, W. Zhang, and Y. ZhangGQ*: Towards Generalizable Deep Q-Learning for Steiner Tree in GraphsInternational Conference on Data Mining, 2024 (ICDM'24)Y. Wu, R. Sun, X. Wang, D. Wen, Y. Zhang, L. Qin, and X. LinEfficient Maximal Frequent Group Enumeration in Temporal Bipartite GraphsProceedings of the VLDB Endowment, 2024 (VLDB'24)Q. Luo, W. Zhang, Z. Yang, D. Wen, X. Wang, D. Yu, and X. LinHierarchical Structure Construction on HypergraphsInternational Conference on Information and Knowledge Management, 2024 (CIKM'24)M. Yang, W. Li, W. Wang, D. Wen, and L. QinQuerying Numeric-Constrained Shortest Distances on Road NetworksInternational Conference on Data Engineering, 2024 (ICDE'24)K. Chen, D. Wen, W. Li, Z. Yang, and W. ZhangOn Compressing Historical Cliques in Temporal GraphsInternational Conference on Database Systems for Advanced Applications, 2024 (DASFAA'24)J. Song, D. Wen, L. Xu, L. Qin, W. Zhang, and X. LinOn Querying Historical Connectivity in Temporal GraphsInternational Conference on Management of Data, 2024 (SIGMOD'24)J. Hou, Z. Zhao, Z. Wang, G. Jin, D. Wen, and X. DuAeonG: An Efficient Built-in Temporal Support in Graph DatabasesProceedings of the VLDB Endowment, 2024 (VLDB'24)K. Chen, D. Wen, W. Zhang, Y. Zhang, X. Wang, and X. LinQuerying Structural Diversity in Streaming GraphsProceedings of the VLDB Endowment, 2024 (VLDB'24)W. Li, M. Cai, M. Gao, D. Wen, L. Qin, and W. WangExpanding Reverse Nearest NeighborsProceedings of the VLDB Endowment, 2024 (VLDB'24)H. Yan, Z. Yang, T. Zhang, D. Wen, and Q. LuoApproximating Temporal Katz Centrality with Monte Carlo MethodsInternational Workshop on Knowledge Graph Management and Applications, 2024 (KGMA'24)Y. Ding, H. Lin, Z. Yang, D. Wen, X. Wang, and W. ZhangAn Experimental Comparison of RDF Systems on CloudAustralasian Database Conference , 2024 (ADC'24)W. Zhang, Z. Yang, D. Wen, and X. WangEfficient Distributed Core Graph DecompositionInternational Conference on Data Mining Workshops, 2023 (CHDM'23)H. Yin, K. Wang, W. Zhang, D. Wen, X. Wang, and Y. ZhangDiscovering Densest Subgraph over Heterogeneous Information NetworksAustralasian Database Conference, 2023 (ADC'23) Best Paper Runner-up Y. Huang, D. Wen, L. Lai, Z. Qian, Y. Zhang, and L. QinEfficient and Effective Path Compression in Large GraphsInternational Conference on Data Engineering, 2023 (ICDE'23)X. Wang, D. Wen, W. Zhang, Y. Zhang, and L. QinDistributed Near-Maximum Independent Set Maintenance over Large-scale Dynamic GraphsInternational Conference on Management of Data, 2023 (ICDE'23)Y. Qiu, D. Wen, L. Qin, W. Li, R. Li, and Y. ZhangEfficient Shortest Path Counting on Large Road NetworksProceedings of the VLDB Endowment, 2022 (VLDB'22)Y. Yu, D. Wen, Y. Zhang, L. Qin, W. Zhang, and X. LinGPU-accelerated Proximity Graph Approximate Nearest Neighbor Search and ConstructionInternational Conference on Management of Data, 2022 (ICDE'22)W. Li, M. Gao, D. Wen, H. Zhou, C. Ke, and L. QinManipulating Structural Graph ClusteringInternational Conference on Management of Data, 2022 (ICDE'22)J. Zhang, W. Li, L. Qin, Y. Zhang, D. Wen, L. Cui, and X. LinReachability Labeling for Distributed GraphsInternational Conference on Management of Data, 2022 (ICDE'22)X. Wang, D. Wen, L. Qin, L. Chang, and W. ZhangScaleG: A Distributed Disk-based System for Vertex-centric Graph ProcessingInternational Conference on Data Engineering, 2022 (ICDE'22)M. Yu, D. Wen, L. Qin, Y. Zhang, W. Zhang, and X. LinOn Querying Historical K-CoresProceedings of the VLDB Endowment, 2021 (VLDB'21)Y. Yu, D. Wen, Y. Zhang, X. Wang, and X. LinEfficient Matrix Factorization on Heterogeneous CPU-GPU SystemsInternational Conference on Data Engineering, 2021 (ICDE'21)D. Ouyang, D. Wen, L. Qin, L. Chang, Y. Zhang, and X. LinProgressive Top-K Nearest Neighbor Search in Large Road NetworksInternational Conference on Management of Data, 2020 (SIGMOD'20)D. Wen, Y. Huang, Y. Zhang, L. Qin, W. Zhang, and X. LinEfficiently Answering Span-Reachability Queries in Large Temporal GraphsInternational Conference on Data Engineering, 2020 (ICDE'20)B. Yang, D. Wen, L. Qin, Y. Zhang, X. Wang, and X. LinFully Dynamic Depth-First Search in Directed GraphsProceedings of the VLDB Endowment, 2020 (VLDB'20)D. Wen, L. Qin, Y. Zhang, L. Chang, and L. ChenEnumerating k-Vertex Connected Components in Large GraphsInternational Conference on Data Engineering, 2019 (ICDE'19)B. Yang, D. Wen, L. Qin, Y. Zhang, L. Chang, and R. LiIndex-based Optimal Algorithm for Computing K-Cores in Large Uncertain GraphsInternational Conference on Data Engineering, 2019 (ICDE'19) One of the Best Papers W. Liu, D. Wen, H. Wang, F. Zhang, and X. WangSkyline Nearest Neighbor Search on Multi-Layer GraphsInternational Conference on Data Engineering Workshops, 2019 (LSGDA'19)D. Wen, L. Qin, Y. Zhang, L. Chang, and X. LinEfficient Structural Graph Clustering: An Index-Based ApproachProceedings of the VLDB Endowment, 2018 (VLDB'18)L. Yue, D. Wen, L. Cui, L. Qin, and Y. ZhengK-Connected Cores Computation in Large Dual NetworksInternational Conference on Database Systems for Advanced Applications, 2018 (DASFAA'18)D. Wen, L. Qin, Y. Zhang, X. Lin, and J. YuI/O Efficient Core Graph Decomposition at Web ScaleInternational Conference on Data Engineering, 2016 (ICDE'16) Best Paper Award Selected Journal PapersY. Yu, D. Wen, M. Yu, L. Qin, Y. Zhang, W. Zhang, and X. LinQuerying Historical K-Cores in Large Temporal GraphsVLDB Journal, 2025 (VLDBJ'25)L. Xu, R. Li, D. Wen, Q. Dai, and G. WangEfficient Antagonistic k-plex Enumeration in Signed GraphsTransactions on Big Data, 2025 (TBD'25)D. Ouyang, D. Wen, L. Qin, Y. Zhang, L. Chang, and X. LinWhen Hierarchy Meets 2-Hop-Labeling: Efficient Shortest Distance and Path Queries on Road NetworksVLDB Journal, 2023 (VLDBJ'23)Y. Qiu, D. Wen, R. Li, L. Qin, M. Yu, and X. LinComputing Significant Cliques in Large Labeled NetworksIEEE Transactions on Big Data, 2022 (TBD'22)D. Wen, B. Yang, Y. Zhang, L. Qin, D. Cheng, and W. ZhangSpan-Reachability Querying in Large Temporal GraphsVLDB Journal, 2021 (VLDBJ'21)S. Xiang, D. Wen, D. Cheng, Y. Zhang, L. Qin, Z. Qian, and X. LinGeneral Graph Generators: Experiments, Analyses, and ImprovementsVLDB Journal, 2021 (VLDBJ'21)X. Wang, D. Wen, L. Qin, L. Chang, Y. Zhang, and W. ZhangScaleG: A Distributed Disk-based System for Vertex-centric Graph ProcessingIEEE Transactions on Knowledge and Data Engineering, 2021 (TKDE'21)H. Wang, D. Lian, W. Liu, D. Wen, C. Chen, and X. WangPowerful graph of graphs neural network for structured entity analysisWorld Wide Web Journal, 2021 (WWW'21)D. Wen, B. Yang, L. Qin, Y. Zhang, L. Chang, and R. LiComputing K-Cores in Large Uncertain Graphs: An Index-based Optimal ApproachIEEE Transactions on Knowledge and Data Engineering, 2020 (TKDE'20) Invited Paper D. Wen, L. Qin, Y. Zhang, L. Chang, and X. LinEfficient Structural Graph Clustering: An Index-Based ApproachVLDB Journal, 2019 (VLDBJ'19)D. Wen, L. Qin, Y. Zhang, X. Lin, and J. YuI/O Efficient Core Graph Decomposition: Application to Degeneracy OrderingIEEE Transactions on Knowledge and Data Engineering, 2018 (TKDE'18) Invited Paper L. Cui, L. Yue, D. Wen, and L. QinK-Connect",
  "content_length": 10734,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:32"
}