{
  "name": "DongSheng Luo",
  "homepage": "https://users.cs.fiu.edu/~dluo",
  "status": "success",
  "content": "Dongsheng Luo Short Bio I am an assistant professor at Florida International University. I obtained my doctoral degree at the College of Information Science and Technology, Pennsylvania State University, supervised by Prof. Xiang Zhang in 2022 and my B.Eng degree in computer science and technology from Beihang University in 2017. Research Interests Trustworthy AI : Explainable AI, Robust AI, Physical-Aware AI Data/Label Efficient AI: Self-Supervised Learning, Fast Domain Adaptation, Model Compression/ Automatic Feature Selection Multi-Source, Multi-Modality Machine Learning: Federated Learning,Multi-Domain Analysis Data Mining : Time Series, Graph Neural Network, Spatiotemporal Data Analysis For more details, visit our lab website FIU Trustworthy AI Lab Ph.D. Students Xu Zheng (Spring 2023-): ICLR 2025,ICML 2024b, ICLR 2024a, ICLR 2024b, EuroS&PW 2023 Zhuomin Chen (Fall 2023-): ICLR 2025, NeurIPS 24, ICML 2024a, ICML 2024b, ICLR 2024b Selected Publications Google Scholar Recent Workshop/Preprints GitTemporalAI: Leveraging Temporal Knowledge Graphs and LLMs for Multi-Agent Repository Intelligence Dongsheng Luo, Raju Rangaswami, Amir Rahmati, Erez Zadok The First MARW: Multi-Agent AI in the Real World Workshop at AAAI 2025 Explanation-Preserving Augmentation for Semi-Supervised Graph Representation Learning Zhuomin Chen, Jingchao Ni, Hojat Allah Salehi, Xu Zheng, Esteban Schafir, Farhad Shirani, Dongsheng Luo PAC Learnability under Explanation-Preserving Graph Perturbations Xu Zheng, Farhad Shirani, T. Wang, S. Gao, W. Dong, W. Cheng and Dongsheng Luo Spectral GNN via Two-dimensional (2-D) Graph Convolution Guoming Li, J. Yang, S. Liang and Dongsheng Luo Conference/Journal Papers F-Fidelity: A Robust Framework for Faithfulness Evaluation of Explainable AI Xu Zheng, Farhad Shirani, Zhuomin Chen, Chaohao Lin, Wei Cheng, Wenbo Guo, Dongsheng Luo The International Conference on Learning Representations (ICLR), 2025 Elevating Spectral GNNs through Enhanced Band-pass Filter Approximation Guoming Li, J. Yang, S. Liang and Dongsheng Luo The Web Conference (WWW), 2025 Generating In-Distribution Proxy Graphs for Explaining Graph Neural Networks Zhuomin Chen, J. Zhang, J. Ni, X. Li, Y. Bian, M. Islam, A. Mondal, H. Wei and Dongsheng Luo The International Conference on Machine Learning (ICML), 2024 Also Present at WWW Workshop: TrustLOG, 2024 [html][code] TimeX++: Learning Time-Series Explanations with Information Bottleneck Zichuan Liu, T. Wang, J. Shi, Xu Zheng, Zhuomin Chen, L. Song, W. Dong, J. Obeysekera, Farhad Shirani and Dongsheng Luo The International Conference on Machine Learning (ICML), 2024 [html][code] Parametric Augmentation for Time Series Contrastive Learning Xu Zheng, T. Wang, W. Cheng, A. Ma, H. Chen, M. Sha, and Dongsheng Luo The International Conference on Learning Representations (ICLR), 2024 Also Present at IJCAI Workshop: AI4TS, 2023 (Best Paper Award) [html][code] Towards Robust Fidelity for Evaluating Explainability of Graph Neural Networks Xu Zheng, Farhad Shirani, T. Wang, W. Cheng, Zhuomin Chen, H. Chen, H. Wei, Dongsheng Luo The International Conference on Learning Representations (ICLR), 2024 Also Present at WWW Workshop: TrustLOG, 2024 (Best Paper Award Runner-Up) [html][code][Short Version] Factorized Explainer for Graph Neural Networks Rundong Huang, Farhad Shirani, Dongsheng Luo The AAAI Conference on Artificial Intelligence (AAAI), 2024. [html][poster] Towards Inductive and Efficient Explanations for Graph Neural Networks Dongsheng Luo, T. Zhao, W. Cheng, D. Xu, F. Han, W. Yu, X. Liu, H. Chen, Xiang Zhang IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2024. [html] Time Series Contrastive Learning with Information-Aware Augmentations Dongsheng Luo, W. Cheng, Y. Wang, D. Xu, J. Ni, W. Yu, X. Zhang, Y. Liu, Y. Chen, H. Chen, Xiang Zhang Proceedings of the AAAI International Conference on Artificial Intelligence (AAAI), 2023 [html] Random Walk on Multiple Networks Dongsheng Luo, Yuchen Bian, Yaowei Yan, Xiong Yu, Jun Huan, Xiao Liu, Xiang Zhang IEEE Transactions on Knowledge and Data Engineering (TKDE), 2023. [html] [code] A Collective Approach to Scholar Name Disambiguation Dongsheng Luo, Shuai Ma, Yaowei Yan, Chunming Hu, Xiang Zhang, and Jinpeng Huai IEEE Transactions on Knowledge and Data Engineering (TKDE), 2022 Extend Abstract at IEEE International Conference on Data Engineering (ICDE), 2021. [html] [code] Learning to Drop: Robust Graph Neural Network via Topological Denoising Dongsheng Luo, Wei Cheng, Wenchao Yu, Bo Zong, Jingchao Ni, Haifeng Chen, Xiang Zhang Proceedings of 14th ACM International Conference on Web Search and Data Mining (WSDM), 2021. [html] [code] Parameterized Explainer for Graph Neural Network Dongsheng Luo, Wei Cheng, Dongkuan Xu, Wenchao Yu, Bo Zong, Haifeng Chen, Xiang Zhang Proceedings of 34th Conference on Neural Information Processing Systems (NeurIPS), 2020 [html] [code] Local Community Detection in Multiple Networks Dongsheng Luo, Yuchen Bian, Yaowei Yan, Xiao Liu, Jun Huan, Xiang Zhang Proceedings of 26th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (SIGKDD), 2020. [html][code] Deep Multi-Graph Clustering via Attentive Cross-Graph Association Dongsheng Luo, Jingchao Ni, Suhang Wang, Yuchen Bian, Xiong Yu, Xiang Zhang Proceedings of the ACM International Conference on Web Search and Data Mining (WSDM), 2020. [html][code] Teaching CAP 6778 Advanced Topics in Data Mining (Fall 2022, Spring 23, Fall 2023, Spring 24, Fall 2024, Spring 2025) CAP 5768 Introduction to Data Science (Spring 2025) Professional Services Senior Program Committee Member: AAAI 23, 24, 25 IJCAI 25 PAKDD 25 Program Committee Member/Reviewer: 2025: ICML, ICLR, WWW, AISTATS, WACV, AI4TS@AAAI, NAACL Demo 2024: ICML, ICLR, NeurIPS, WWW, WSDM, IJCAI, ICDM, SDM, LOG, ICASSP, ARR Rolling, WACV, MILETS@KDD 2023: ICML, NeurIPS, SIGKDD, WSDM, IJCAI, ICDM, LOG, AI4TS@IJCAI 2022: NeurIPS, SIGKDD, ICDM, SDM 2021: SIGKDD, AAAI 2020: SIGKDD Journal Reviewer: IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) IEEE Transactions on Neural Networks and Learning Systems (TNNLS) IEEE Transactions on Knowledge and Data Engineering (TKDE) ACM Transactions on Knowledge Discovery from Data (TKDD) IEEE Transactions on Information Forensics and Security IEEE Transactions on Big Data (TBD) Data Mining and Knowledge Discovery (DAMI) The VLDB Journal Knowledge and Information Systems (KAIS) Neurocomputing Honors and Awards Best Paper Award Runner-Up, TrustLOG@WWW, 2024 Best Paper Award, AI4TS@IJCAI, 2023 College of IST Ph.D. Award for Research Excellence, Penn State University, 2021 Best Paper Award Finalist, ICDM, 2018 Outstanding Undergraduate Student Award of Beijing City, 2017 CSC Outstanding Undergraduate Exchange Program Award, 2016 WSDM Cup 2016 – Entity Ranking Challenge the 2nd place in the final ranking, 2016 China National Undergraduate Scholarship: 2014, 2015",
  "content_length": 6952,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:33"
}