{
  "name": "Dongdong She",
  "homepage": "https://home.cse.ust.hk/~dongdong",
  "status": "success",
  "content": "Dongdong She Room 3006 Cheng Yu Tung Building Drop me an email if you are interested in working with me! I received my Ph.D. at the Department of Computer Science, Columbia University working with Suman Jana and Baishakhi Ray. Before coming to Columbia, I worked with Zhiyun Qian on Android Security at the University of California, Riverside. I earned my bachelorâs degree at Huazhong University of Science and Technology. I am broadly interested in the intersection of security and machine learning. Particularly, I focus on applying data-driven approaches (e.g., large language models, machine learning, optimization) to solve security problems. Current research projects include: LLM Security: investigate the security of LLM, LLM/agent-powered systems, interaction of LLM components. LLM for Traditional Security: leverage LLM to solve traditional security problems such as program analysis, vulnerability discovery. I am fortunate to work with these talented students: Yuchong Xie (2024-Fall PhD, BS,MS@SJTU, ex-core member of SJTU 0ops CTF team) co-adviced with Prof. Shuai Wang Shuangjie Yao (2024-Fall PhD , BS@SJTU, Zhiyuan College) Qiao Zhang (2024-Fall MPhil, BS@ZJU, Chu Kochen Honors College) Zesen Liu (2025-Fall PhD, BS@Xidian U) Haoyang Liu (2025-Fall PhD, BS@HUST) Kaikai Zhang (2025-Fall PhD, BS@SJTU) Zhixiang Zhang (2026-Fall PhD, BS@Fudan U) Publications 2025 arxiv CompressionAttack: Exploiting Prompt Compression as a New Attack Surface in LLM-Powered Agents. Zesen Liu,Â Zhixiang Zhang,Â yuchong Xie,Â andÂ Dongdong She Arxiv preprint PDF arxiv On the Security of Tool-Invocation Prompts for LLM-Based Agentic Systems: An Empirical Risk Assessment. Yuchong Xie,Â Mingyu Luo,Â Zesen Liu,Â Zhixiang Zhang,Â Kaikai Zhang,Â Yu Liu,Â Zongjie Li,Â Ping Chen,Â Shuai Wang,Â andÂ Dongdong She Arxiv preprint PDF Code ISSTA ZTaint-Havoc: From Havoc Mode to Zero-Execution Fuzzing-Driven Taint Inference. Yuchong Xie,Â Wenhui Zhang,Â andÂ Dongdong She ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2025) PDF Code ISSTA RouthSearch: Inferring PID Parameter Specification for Flight Control Program by Coordinate Search. Siao Wang,Â Zhen Dong,Â Hui Li,Â Liwei Shen,Â Xin Peng,Â andÂ Dongdong She ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2025) Distinguished Paper Award PDF Code IEEE S&P Empc: Effective Path Prioritization for Symbolic Execution with Path Cover. Shuangjie Yao,Â andÂ Dongdong She IEEE Symposium on Security and Privacy (S&P 2025) Distinguished Paper Award PDF Code 2024 CCS FOX: Coverage-guided Fuzzing as Online Stochastic Control Dongdong She*,Â Adam Storek*,Â Yuchong Xie,Â Seoyoung Kweon,Â Prashast Srivastava,Â andÂ Suman Jana ACM SIGSAC Conference on Computer and Communications Security (CCS 2024) Second Place in SBFT 2024 Fuzzing Competition PDF Code 2023 IEEE S&P Precise Detection of Kernel Data Races with Probabilistic Lockset Analysis. Gabriel Ryan,Â Abhishek Shah,Â Dongdong She,Â andÂ Suman Jana IEEE Symposium on Security and Privacy (S&P 2023) PDF 2022 IEEE S&P Effective Seed Scheduling for Fuzzing with Graph Centrality Analysis. Dongdong She,Â Abhishek Shah,Â andÂ Suman Jana IEEE Symposium on Security and Privacy (S&P 2022) PDF Code CCS MC2: Rigorous and Efficient Directed Greybox Fuzzing. Abhishek Shah,Â Dongdong She,Â Samanway Sadhu,Â Krish Singal,Â Peter Coffman,Â andÂ Suman Jana ACM SIGSAC Conference on Computer and Communications Security (CCS 2022) Best Paper Award Runner-Up PDF Code FSE NeuDep: Neural Binary Memory Dependence Analysis Kexin Pei,Â Dongdong She,Â Michael Wang,Â Scott Geng,Â Zhou Xuan,Â Yaniv David,Â Junfeng Yang,Â Suman Jana,Â andÂ Baishakhi Ray ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (FSE 2022) PDF Code 2021 Security Fine Grained Dataflow Tracking with Proximal Gradients Gabriel Ryan,Â Abhishek Shah,Â Dongdong She,Â Koustubha Bhat,Â andÂ Suman Jana USENIX Conference on Security Symposium (Security 2021) PDF 2020 Security On Training Robust PDF Malware Classifiers Yizheng Chen,Â Shiqi Wang,Â Dongdong She,Â andÂ Suman Jana USENIX Conference on Security Symposium (Security 2020) PDF Code FSE MTFuzz: Fuzzing with a Multi-Task Neural Network Dongdong She,Â Rahul Krishna,Â Lu Yan,Â Suman Jana,Â andÂ Baishakhi Ray ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (FSE 2020) PDF Code IEEE S&P Neutaint: Efficient Dynamic Taint Analysis with Neural Networks Dongdong She,Â Yizheng Chen,Â Abhishek Shah,Â Baishakhi Ray,Â andÂ Suman Jana IEEE Symposium on Security and Privacy (S&P 2020) PDF 2019 IEEE S&P NEUZZ: Efficient Fuzzing with Neural Program Smoothing Dongdong She,Â Kexin Pei,Â Dave Epstein,Â Junfeng Yang,Â Baishakhi Ray,Â andÂ Suman Jana IEEE Symposium on Security and Privacy (S&P 2019) Finalist in 2019 NYU CSAW Applied Research Competition PDF Code 2016 CCS Android ION Hazard: The Curse of Customizable Memory Management System Hang Zhang,Â Dongdong She,Â andÂ Zhiyun Qian ACM SIGSAC Conference on Computer and Communications Security (CCS 2016) PDF 2015 CCS Android Root and Its Providers: A Double-Edged Sword Hang Zhang,Â Dongdong She,Â andÂ Zhiyun Qian ACM SIGSAC Conference on Computer and Communications Security (CCS 2015) PDF",
  "content_length": 5328,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:32"
}