{
  "name": "Dongfang Liu",
  "homepage": "https://dongfang-liu.github.io",
  "status": "success",
  "content": "Dongfang Liu's website Dongfang Liu Rochester Institute of Technology dongfang.liu AT rit.edu Home About Me Research Publications Dr. Dongfang Liu Assistant professor @ RIT Ph.D from Purdue University (2021) dongfang.liu AT rit.edu Home About Me Research Interests Research Projects Services Publications About Me I am an Assistant Professor in the Department of Computer Engineering and an affiliated faculty member with Computer Science department. My research interests primarily revolve around general-purpose AI. Over the past few years, I have had the pleasure of working alongside a cohort of exceptionally bright and talented students who have accompanied me on this academic journey. Sometimes, they listen to me. I have a charming feline companion 🐈 that graces my life, Mr. Tiger, who brings a lot of joy to the family. Research Interests My research endeavors have been dedicated to the development of general intelligence for X tailored to address interdisciplinary challenges (e.g., autonomous driving, cancer diagnosis, and sustainable energy). Through these multidisciplinary investigations, I strive to contribute to the advancement of knowledge and the resolution of pressing issues across diverse disciplines (e.g., transportation, health care, and inertial confinement fusion). These endeavors have garnered support from National Science Foundation (NSF) and indurstial partners. By harnessing the power of AI, I aim to unravel complexities, devise innovative strategies, and ultimately make substantial contributions to the betterment of society. I am continuously looking for doctoral students to work with my research projects. If you want to develop awesome AI tools to address real-world problems, I think we need to talk 😄. Research Projects Project 1: Vision-Anchored Automation of Bird-Sized UAVs in Unknown Cluttered Indoor Environments The research project aims to develop full automation for bird-sized UAVs using only an RGB-D camera, and seeks to answer fundamental questions for UAV automation, including constructing visual perception and developing visual navigation. Services Area Chair: The Conference on Computer Vision and Pattern Recognition (CVPR), 2023- Senior PC: The International Joint Conference on Artificial Intelligence (IJCAI), 2023- Senior PC: The Association for the Advancement of Artificial Intelligence (AAAI), 2023- Associate editor: IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), 2023- Associate editor: Neurocomputing, 2024- Associate editor: ACM Journal on Autonomous Transportation (JATS), 2023- Publications 2025 Probabilistic Token Alignment for Large Language Model Fusion Runjia Zeng, James Chenhao Liang, Cheng Han, Zhiwen Cao, Jiahao Liu, Xiaojun Quan, Yingjie Victor Chen, Lifu Huang, Tong Geng, Qifan Wang, Dongfang Liu* NeurIPS 2025 Robust Ego-Exo Correspondence with Long-Term Memory Yijun Hu, Bing Fan, Xin Gu, Haiqing Ren, Dongfang Liu, Heng Fan, Libo Zhang NeurIPS 2025 All You Need is One: Capsule Prompt Tuning with a Single Vector Yiyang Liu, James Chenhao Liang, Heng Fan, Wenhao Yang, Yiming Cui, Xiaotian Han, Lifu Huang, Dongfang Liu, Qifan Wang, Cheng Han NeurIPS 2025 MEPT: Mixture of Expert Prompt Tuning as a Manifold Mapper Runjia Zeng, Guangyan Sun, Qifan Wang, Tong Geng, Sohail Dianat, Xiaotian Han, Raghuveer Rao, Xueling Zhang, Cheng Han, Lifu Huang, Dongfang Liu* EMNLP 2025 Exploring the Adversarial Vulnerabilities of Vision-Language-Action Models in Robotics Taowen Wang, Cheng Han, James Chenhao Liang, Wenhao Yang, Dongfang Liu*, Luna Xinyu Zhang, Qifan Wang, Jiebo Luo, Ruixiang Tang ICCV 2025 Visual Agents as Fast and Slow Thinkers Guangyan Sun, Mingyu Jin, Zhenting Wang, Cheng-Long Wang, Siqi Ma, Qifan Wang, Tong Geng, Ying Nian Wu, Yongfeng Zhang, Dongfang Liu* ICLR 2025 Re-Imagining Multimodal Instruction Tuning: A Representation View Yiyang Liu, James Chenhao Liang, Ruixiang Tang, Yugyung Lee, MAJID RABBANI, Sohail Dianat, Raghuveer Rao, Lifu Huang, Dongfang Liu, Qifan Wang, Cheng Han ICLR 2025 DS-LLM: Leveraging Dynamical Systems to Enhance Both Training and Inference of Large Language Models Ruibing Song, Chuan Liu, Chunshu Wu, Ang Li, Dongfang Liu, Ying Nian Wu, Tong Geng ICLR 2025 Diff-PIC: Revolutionizing Particle-In-Cell Nuclear Fusion Simulation with Diffusion Models Chuan Liu, Chunshu Wu, shihui cao, Mingkai Chen, James Chenhao Liang, Ang Li, Michael Huang, Chuang Ren, Ying Nian Wu, Dongfang Liu, Tong Geng ICLR 2025 2024 Visual Fourier Prompt Tuning Runjia Zeng, Cheng Han, Qifan Wang, Chunshu Wu, Tong Geng, Lifu Huang, Ying Nian Wu, Dongfang Liu* NeurIPS 2024 Optical Flow as Spatial-Temporal Attention Learners Yawen Lu, Cheng Han, Qifan Wang, Heng Fan, Zhaodan Kong, Dongfang Liu*, Yingjie Chen TPAMI 2024 Diffusion-Inspired Truncated Sampler for Text-Video Retrieval Jiamian Wang, Pichao Wang, Dongfang Liu, Qiang Guan, Sohail Dianat, Majid Rabbani, Raghuveer Rao, Zhiqiang Tao. NeurIPS 2024 MPT: Multimodal Prompt Tuning for Zero-shot Instruction Learning Taowen Wang, Yiyang Liu, James Chenhao Liang, junhan zhao, Yiming Cui, Yuning Mao, Shaoliang Nie, Jiahao Liu, Fuli Feng, Zenglin Xu, Cheng Han, Lifu Huang, Qifan Wang, Dongfang Liu* EMNLP 2024 EAVE: Efficient Product Attribute Value Extraction via Lightweight Sparse-layer Interaction Li Yang, Qifan Wang, Jianfeng Chi, Jiahao Liu, Jingang Wang, Fuli Feng, Zenglin Xu, Yi Fang, Lifu Huang, Dongfang Liu* EMNLP 2024 Towards Automatic Oracle Prediction for AR testing: Assessing Virtual Object Placement Quality under Real-world Scenes Xiaoyi Yang, Yuxing Wang, Tahmid Rafi, Dongfang Liu, Xiaoyin Wang, Xueling Zhang ISSTA 2024 UAV First-Person Viewers Are Radiance Field Learners Liqi Yan, Qifan Wang, Junhan Zhao, Qiang Guan, Zheng Tang, Jianhui Zhang, Dongfang Liu* ECCV 2024 AMD: Automatic Multi-step Distillation of Large-scale Vision Models Cheng Han, Qifan Wang, Sohail Dianat, Majid Rabbani, Raghuveer Rao, Yi Fang, Qiang Guan, Lifu Huang, Dongfang Liu* ECCV 2024 Efficient Multimodal Semantic Segmentation via Dual-Prompt Learning Shaohua Dong, Yunhe Feng, Qing Yang, Yan Huang, Dongfang Liu, Heng Fan IROS 2024 Self-supervised Adversarial Training of Monocular Depth Estimation against Physical-World Attacks Zhiyuan Cheng, Cheng Han, James Liang, Qifan Wang, Xiangyu Zhang, Dongfang Liu* TPAMI 2024 Prototypical Transformer As Unified Motion Learners Cheng Han, Yawen Lu, Guohao Sun, James Chenhao Liang, Zhiwen Cao, Qifan Wang, Qiang Guan, Sohail Dianat, Raghuveer Rao, Tong Geng, Zhiqiang Tao, Dongfang Liu* ICML 2024 BadPart: Unified Black-box Adversarial Patch Attacks against Pixel-wise Regression Tasks Zhiyuan Cheng, Zhaoyi Liu, Tengda Guo, Shiwei Feng, Dongfang Liu, Mingjie Tang, Xiangyu Zhang ICML 2024 SmartFuse: Reconfigurable Smart Switches to Accelerate Fused Collectives in HPC Applications Pouya Haghi, Cheng Tan, Anqi Guo, Chunshu Wu, Dongfang Liu, Ang Li, Anthony Skjellum, Tong Geng, Martin Herbordt ICS 2024 Text Is MASS: Modeling as Stochastic Embedding for Text-Video Retrieval Jiamian Wang, Guohao Sun, Pichao Wang, Dongfang Liu, Sohail Dianat, Majid Rabbani, Raghuveer Rao, Zhiqiang Tao CVPR 2024 ProMotion: Prototypes As Motion Learners Yawen Lu, Dongfang Liu*, Qifan Wang, Cheng Han, Yiming Cui, Zhiwen Cao, Xueling Zhang, Yingjie Victor Chen, Heng Fan CVPR 2024 Image Translation as Diffusion Visual Programmers Cheng Han, James Chenhao Liang, Qifan Wang, MAJID RABBANI, Sohail Dianat, Raghuveer Rao, YingNian Wu, Dongfang Liu* ICLR 2024 Facing the Elephant in the Room: Visual Prompt Tuning or Full finetuning? Cheng Han, Qifan Wang, Yiming Cui, Wenguan Wang, Lifu Huang, Siyuan Qi, Dongfang Liu* ICLR 2024 Fusion is Not Enough: Single Modal Attack on Fusion Models for 3D Object Detection Zhiyuan Cheng, Hongjun Choi, Shiwei Feng, James Chenhao Liang, Guanhong Tao, Dongfang Liu, Michael Zuzak, Xiangyu Zhang ICLR 2024 2023 Reformulating Graph Kernels for Self-supervised Space-Time Correspondence Learning Zheyun Qin, Xiankai Lu, Dongfang Liu, Xiushan Nie, Yilong Yin, Jianbing Shen, Alexander C. Loui. TIP 2023 APrompt: Attention Prompt Tuning for Efficient Adaptation of Pre-trained Language Models Qifan Wang, Yuning Mao, Jingang Wang, Hanchao Yu, Shaoliang Nie, Sinong Wang, Fuli Feng, Lifu Huang, Xiaojun Quan, Zenglin Xu, Dongfang Liu*. EMNLP 2023 ClusterFomer: Clustering As A Universal Visual Learner James Liang, Yiming Cui, Qifan Wang, Tong Geng, Wenguan Wang, Dongfang Liu*. NeurIPS 2023 E^2VPT: An Effective and Efficient Approach for Visual Prompt Tuning Cheng Han, Qifan Wang, Yiming Cui, Zhiwen Cao, Wenguan Wang, Siyuan Qi, Dongfang Liu*. ICCV 2023 Tripartite Feature Enhanced Pyramid Network for Dense Prediction Dongfang Liu*, James Liang, Tony Geng, Alexander Loui, Tianfei Zhou. TIP 2023 CLUSTSEG: Clustering for Universal Segmentation James Liang, Tianfei Zhou, Dongfang Liu*, Wenguan Wang. ICML 2023 MixPAVE: Mix-Prompt Tuning for Few-shot Product Attribute Value Extraction Li Yang, Qifan Wang, Jingang Wang, Xiaojun Quan, Fuli Feng, Yu Chen, Madian Khabsa, Sinong Wang, Zenglin Xu, Dongfang Liu*. ACL 2023 MUSTIE: Multimodal Structural Transformer for Web Information Extraction Qifan Wang, Jingang Wang, Xiaojun Quan, Fuli Feng, Zenglin Xu, Shaoliang Nie, Sinong Wang, Madian Khabsa, Hamed Firooz, Dongfang Liu*. ACL 2023 Prompt Learns Prompt: Exploring Knowledge-Aware Generative Prompt Collaboration For Video Captioning Liqi Yan, Cheng Han, Zenglin Xu, Dongfang Liu*, Qifan Wang. IJCAI 2023 TransFlow: Transformer as Flow Learner Yawen Lu, Qifan Wang, Siqi Ma, Tong Geng, Yingjie Victor Chen, Huaijin Chen, Dongfang Liu*. CVPR 2023 Visual Recognition with Deep Nearest Centroids Wenguan Wang, Cheng Han, Tianfei Zhou, Dongfang Liu*. ICLR 2023 Adversarial Training of Self-supervised Monocular Depth Estimation against Physical-World Attacks Zhiyuan Cheng, James Liang, Guanhong Tao, Dongfang Liu*, Xiangyu Zhang*. ICLR 2023 2022 Learning to Generate Question by Asking Question: A Primal-Dual Approach with Uncommon Wo",
  "content_length": 12368,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:33"
}