{
  "name": "Dong Hao",
  "homepage": "https://sites.google.com/view/hao-dong",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationDong HAO  (郝 東)School of Computer Science and EngineeringUniversity of Electronic Science and Technology of ChinaChengdu 611731, ChinaE-mail: haodongpost(at)gmail.com; haodong(at)uestc.edu.cn[Google Scholar] [DBLP] [ORCID] [UESTC]ABOUT MEI'm an associate professor in the University of Electronic Science and Technology of China (UESTC). I obtained my Ph.D. in Informatics in Kyushu University, Japan under the supervision of Professor Makoto Yokoo. My research interests lies in the intersection of Artificial Intelligence and Economics, especially about (1) understanding how people or intelligent agents think and behave when they interact with others, and (2) how they learn about others' behavior and how their behavior adapts when they are in dynamic, uncertain or networked environments. The research tasks are mainly about the modeling, reasoning, optimization and algorithm design for these issues. Curriculum Vitae RESEARCH INTERESTSGame Theory;  Mechanism Design; Market Design;  Incentives;  Social and Economic Networks;  Learning and Decision MakingTEACHINGI has been given “The Outstanding Graduate Student Teaching Award” in UESTC.  I teach the following classes:Discrete Mathematics: for undergraduates. (64 class hours, 2014-2025)Algorithmic Game Theory: for master/doctoral students. (20 class hours, 2016-2025) Applied Machine Learning for Beginners：for undergraduates in Yingcai Honors College. (16 class hours, 2020-2025) ACADEMIC SERVICESReviewer for Journals: Artificial Intelligence Journal; Journal of Artificial Intelligence Research; Journal of Autonomous Agents and Multi-Agent Systems; ACM Transactions on Economics and Computation; Games; IEEE Transactions on Systems, Man and Cybernetics: Systems; IEEE Transactions on Vehicular Technology; IEEE Transactions on Cognitive Communications and Networking;  IEEE Transactions on Cognitive and Developmental Systems, European Journal of Operational Research, etc.PC/Senior PC Members: AAAI'2019, AAAI'2020, AAAI'2021, AAAI'2022, AAAI'2023(SPC), AAAI'2024(SPC), AAAI'2025(SPC), AAAI'2026(SPC)IJCAI'2021(SPC), IJCAI'2022(SPC), IJCAI'2023, IJCAI'2024, IJCAI'2025ECAI'2022, ECAI'2023(SPC)AAMAS'2021, AAMAS'2022, AAMAS'2023, AAMAS'2024, AAMAS'2025WINE'2024CURRENT RESEARCH TOPICSAuction in Social Networks: Auction is the common paradigm for resource allocation which is a fundamental problem in human society. Classic auction research indicates that the two primary objectives, the seller's revenue and the allocation efficiency, are generally conflicting in auction design. Our research expand the domain of the classic auction to a social graph and formally identify a new class of auction mechanisms on graphs. All mechanisms in this class are incentive-compatible and also promote all buyers to diffuse the auction information to others, whereby both the seller's revenue and the allocation efficiency are significantly improved comparing with the Vickrey auction. It is found that the recently proposed information diffusion mechanism is an extreme case with the lowest revenue in this new class. Our work could potentially inspire a new perspective for the efficient and optimal auction design and could be applied into the prevalent online social and economic networks. Control in Repeated Games: Maintaining mutual cooperation among multiple individuals is important for both human society and artificial intelligence and economic system. This is because in many real-world scenarios, there exists tension between different agents’ interests.  Although mutual cooperation leads to higher social welfare, agents usually have incentives to free ride, which finally results in a loss-loss situation. We develop a new theory for maintaining mutual cooperation in multiplayer games. We find that in repeated multiplayer games, it is even possible for a single normal player to delicately design a control strategy, via which she can unilaterally manipulate the utility of every other player. Under a better setting of the control strategy, every opponent can maximize his utility only via full cooperation. With such a nice property, a control strategy player can sustain mutual cooperation among all players. Since mutual cooperation is individually optimal for every single opponent, a control strategy essentially rules out other sub-optimal equilibria. We formally identify the necessary and sufficient conditions of these control strategies and clarify the underlying relation between them and well-known classic strategies including Tit-for-Tat, Win-Stay Loss-Shift and so on.SELECTED PUBLICATIONS(BOOK) Chinese translation of Tim Roughgarden's book “Twenty Lectures on Algorithmic Game Theory”. HZ BOOKS. 2020. With Fan Liu and Bin Li. [Book link]Strategyproofness and Monotone Allocation of Auction in Social Networks. Yuhang Guo, Dong Hao, Bin Li, Mingyu Xiao, Bakh Khoussainov. IJCAI 2025. Explainable Graph Neural Networks via Structural Externalities. L Wu, D Hao, Z Fan. IJCAI 2025. Alleviating Subgraph-Induced Oversmoothing in Link Prediction via Coarse Graining. Xudong Zhu, Dong Hao, Liming Pan, Ziqin Gao. Neurocomputing. 2025.  Handwritten Signature Verification via Multimodal Consistency Learning. Z Shi, F Li, D Hao, Q Sun. IEEE Transactions on Information Forensics and Security. 2025.DropEdge not Foolproof: Effective Augmentation Method for Signed Graph Neural Networks. Z Zhang, L Li, S Wan, S Wang, Z Wang, Z Lu, D Hao, W Li. NeurIPS 2025.Core-Competitiveness in Partially Observable Networked Market. With Bin Li. The Web Conference (WWW-2024). Diffusion Auction Design with Transaction Costs. With Bin Li and Dengji Zhao: Autonomous Agents and Multi-Agent Systems 38.1 (2024): 2. [Paper link]Networked Combinatorial Auction for Crowdsourcing and Crowdsensing. With Yuhang Guo, Mingyu Xiao and Bin Li: IEEE Internet of Things Journal. 2023. Corresponding author. [Paper link]Social Sourcing: Incorporating Social Networks Into Crowdsourcing Contest Design. With Qi Shi. IEEE/ACM Transactions on Networking. ISSN: 1063-6692. Corresponding author. [Paper link]Cooperation, Retaliation and Forgiveness in Revision Games. With Qi Shi, Jinyan Su and Bo An. arXiv:2112.02271. Corresponding author. [Paper link]Diffusion Auction Design. Artificial Intelligence, 103631. 2021. With Bin Li, Dengji Zhao and Hui Gao. Corresponding author. [Paper link]Incentive Scoring Mechanism Design in Battle Royale Games. 5th International Conference on Algorithms, Computing and Systems. with Qi Shi and Shuai Mao. [Paper link]Emerging Methods of Auction Design in Social Networks. In the Proceedings of the 30th International Joint Conference on Artificial Intelligence (IJCAI-2021). with Yuhang Guo. Corresponding author. [Paper link]Incentive Mechanism Design for ROI-constrained Auto-bidding. arXiv preprint arXiv:2012.02652. with Bin Li, Xiao Yang, Daren Sun, Zhi Ji, Zhen Jiang and Cong Han. [Paper link]Incentive-Compatible Diffusion Auctions. Proceeding of the 29th International Joint Conference on Artificial Intelligence (IJCAI-2020). with Bin Li and Dengji Zhao. Corresponding author. [Paper link]Diffusion and Auction on Graphs. In the Proceedings of the 28th International Joint Conference on Artificial Intelligence (IJCAI-2019). with Bin Li, Dengji Zhao and Makoto Yokoo. Corresponding author. [Paper link]Cooperation Enforcement and Collusion Resistance in Repeated Public Goods Games. In the Proceedings of the 33rd AAAI Conference on Artificial Intelligence (AAAI-2019) . with Kai Li. Corresponding author. [Paper link]Customer Sharing in Economic Networks with Costs. In the Proceedings of the 27th International Joint Conference on Artificial Intelligence (IJCAI-2018). with Bin Li, Dengji Zhao and Tao Zhou. Corresponding author. [Paper link]Payoff Control in the Iterated Prisoner’s Dilemma. In the Proceedings of the 27th International Joint Conference on Artificial Intelligence (IJCAI-2018). with Kai Li and Tao Zhou.  Corresponding author. [Paper link]Selling Multiple Items via Social Networks. In the Proceedings of the 17th International Conference on Autonomous Agents and Multiagent Systems. (AAMAS-2018).  with Dengji Zhao, Bin Li, Junping Xu and Nick Jennings. [Paper link] Link prediction via Linear Optimization. Physica A: Statistical Mechanics and its Applications. 2018. with Pech Ratha, Yan-Li Lee, Ye Yuan, and Tao Zhou. [Paper link]Enhancing Subspace Clustering Based on Dynamic Prediction. Frontiers of Computer Science. 2018. with Pech Ratha, Hong Cheng and Tao Zhou. [Paper link]Mechanism Design in Social Networks. In the Proceedings of the Thirty-First AAAI Conference on Artificial Intelligence (AAAI-2017). with Bin Li, Dengji Zhao and Tao Zhou. Corresponding author. [Paper link]Local Similarity and Community Paradigm: The Robust Methods toward Link Prediction. In the Proceedings of the IEEE 2nd International Conference on Big Data Analysis. 2017. with Pech Ratha.  [Paper link]Link Prediction via Matrix Completion. EPL (Europhysics Letters). 2017. with Pech Ratha, Liming Pan, Hong Cheng and Tao Zhou. Corresponding author. [Paper link]Predicting Drug-Target Interactions via Sparse Learning. arXiv preprint arXiv:1706.01876. 2017. with Pech Ratha, Maryna Po and Tao Zhou. [Paper link]Extortion under Uncertainty: Zero-Determinant Strategies in Noisy Repeated Games. with Z. Rong and T. Zhou:  Physical Review E. 2015. Corresponding author. [Paper link]Zero-Determinant Strategies in Iterated Public Goods Games. Scientific Reports. 2015. with Liming Pan, Zhihai Rong and Tao Zhou. [Paper link]Zero-Determinant Strategy: An Underway Revolution in Game Theory. Chinese Physics B. 2014. with Zhihai Rong and Tao Zhou. [Paper link](DOMESTIC CONFERENCE) Single Agent Optimal Pricing under Market Uncertainty by Using POMDP. International Joint Agent Workshop and Symposium. 2012.  with Atsushi Iwasaki, Makoto Yokoo, YongJoon Joe, Michihiro Kandori and Ichiro Obara. [Paper link]A Repeated Game",
  "content_length": 11587,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:28"
}