{
  "name": "Donghyun Kim 0006",
  "homepage": "https://utl.korea.ac.kr",
  "status": "success",
  "content": "Universal Transfer Learning Lab - Home Toggle navigation Universal Transfer Learning (UTL) Lab @ Korea University Home News Team Publications Opening Welcome to the Universal Transfer Learning Lab We are Universal Transfer Learning (UTL) lab at Korea University with Prof. Donghyun Kim. Our research pursuits are situated under the expansive umbrella of transfer learning, with a particular emphasis on investigating the transferability, generalization, and adaptability of robust artificial intelligence (AI) models across a wide array of AI domains and disciplines. Research Area Our overarching objective is to pioneer the creation of highly effective transfer learning algorithms that can seamlessly transcend the boundaries of disparate domains and modalities found within a multitude of fields. These algorithms will be specifically tailored to cater to a wide spectrum of real-world applications, thus driving innovation and advancements in various industries and sectors. Our main research interests include but not limited to the following: Domain Transfer (Domain Adaptation/Generalization) Task Transfer Pre-training for Transfer Learning Foundation Model Adaptation Efficient Adaptation Multimodal Representation Learning Transferable Representation Learning Un/self-supervised Learning Learning From Synthetic Data Learning Compositionality Etc… We are looking for passionate new MS, MS/PhD, PhD students or Postdocs to join the team (more info) ! News Nov. 2025Sojung An and Dong-Hee Kim have been awarded the AI SeoulTech Graduate School Scholarship. Aug. 2025Jungmyung Wi wins 2nd place in the 2025 Samsung Collegiate Programming Challenge (2/1445). Congratulations! Aug. 2025A paper has been accepted to Scientific Reports. (JCR IF Top 25%) Jul. 2025A paper has been accepted to International Journal of Computer Vision (IJCV). (JCR IF Top 10%) Jul. 2025Four papers have been accepted to ICCV 2025 Workshop. Jun. 2025Three papers have been accepted to ICCV 2025. Feb. 2025A paper has been accepted to Engineering Applications of Artificial Intelligence. (JCR IF Top 10%) Feb. 2025A paper has been accepted to CVPR 2025. Jan. 2025A paper has been accepted to ICLR 2025. ... see all News Contact: d_kim at korea.ac.kr Tel:+82-02-3290-4687 Address: Room 405, Woojung Hall of Informatics 145 Anam-ro, Seongbuk-gu, Seoul Republic of Korea",
  "content_length": 2350,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:34"
}