{
  "name": "Dong-Yoon Lee",
  "homepage": "https://www3.cs.stonybrook.edu/~dongyoon",
  "status": "success",
  "content": "Dongyoon Lee Dongyoon Lee Associate Professor Department of Computer Science Stony Brook University E-mail: dongyoon [AT] cs [DOT] stonybrook [DOT] edu Office: New Computer Science Bldg, Room 339 Phone: (631) 632-1522 Google scholar dblp orcid | Â Â  Bio & News Â Â  | Â Â  Publications Â Â  | Â Â  Research Â Â  | Â Â  Students Â Â  | Â Â  Teaching Â Â  | Â Â  Services Â Â  | Bio I am an associate professor in the Department of Computer Science at Stony Brook University. I received the Ph.D.Â (2013) and M.S. (2009) in Computer Science and Engineering at the University of Michigan, Ann Arbor under the guidance of Prof.Â Satish Narayanasamy; and B.S. (2004) in Electrical and Computer Engineering at Seoul National University in South Korea. Before joining Stony Brook University, I worked as an assistant professor at Virginia Tech (2014-2019) and as an academic visitor in the next generation middleware platforms department at IBM T. J. Watson Research Center (Fall 2013). I also interned in the operating systems group at Microsoft Research - Redmond (Summer 2012); and in the systems analysis and verification department at NEC Laboratories America (Summer 2011). My co-authored papers won two ACM distinguished paper awards at ASE 2019 and ESEC/FSE 2018, the best student paper finalist at SC 2016, and the ACM best paper award at ASPLOS 2011. I also received ICTAS Junior Faculty Award 2017, Google Research Award 2015, ProQuest Distinguished Dissertation Award 2013, and VMWare Graduate Fellowship 2012. Research Areas: Compilers, Operating SYstems, and SecuritY (COSY Lab) I have a passion for designing systems and tools aimed at assisting programmers in building reliable, secure and efficeint systems. I love working on solutions that cut across the entire software-hardware computing stack, including compilers, computer architecture, operating systems, and security. News I am actively looking for motivated PhD, MS, undergraduate students to work on systems and security research projects. Please refer to my Research page for sample projects. Sep.Â 2024: A paper on a homomorphic encryption compiler is accepted by USENIX Security 2024. Aug.Â 2024: An NSF SaTC Core Small project on a homomorphic encryption compiler was funded. July 2024: A paper on a homomorphic encryption compiler is accepted by ASPLOS 2024. May 2024: A research project on ARM TrustZone trusted OS security with the Agency for Defense Development (ADD), South Korea, was funded. May 2024: A paper on an energy harvesting system is accepted by OSDI 2024. Mar.Â 2023: A paper on heap buffer overflow detection is accepted by OSDI 2023. Mar.Â 2023: I will serve as the publication co-chair for ASPLOS 2024. Mar.Â 2023: A paper on Linux device driver fuzzing is accepted by S&P (Oakland) 2023. Mar.Â 2023: A paper on an energy harvesting system is accepted by ISCA 2023. Jan.Â 2023: A paper on a homomorphic encryption compiler is accepted by USENIX Security 2023. More News Nov.Â 2022: A paper on regular exression denial of service is accepted by S&P (Oakland) 2023. Oct.Â 2022: I will serve as the TPC chair for LCTES 2023 (co-located with PLDIâ23, part of FCRCâ23). Aug.Â 2022: A collabrative NSF CSR/CNS Large project on sustainable data center was funded. June 2022: A collabrative NSF SaTC Small project on regular expressions was funded. May 2022: A collabrative NSF CCF/SHF Small project on energy harvesting systems was funded. March 2022: A paper accepted by OSDI 2022. Congratulations to Xinwei! November 2021: A paper accepted by CGO 2022. Congratulations to Yongwoo and others! November 2021: A journal accepted by ACM TIOT. Congratulations to Yifu and others! August 2021: A paper accepted by SOSP 2021. Congratulations to Xinwei, Wook-Hee, and Ajay! July 2021: A paper accepted by MICRO 2021. Congratulations to Jianping, Jongouk, Xinwei, and Ajay! Aug.Â 2020: A paper accepted by S&P (Oakland) 2021. Congratulations to Jamie! July 2020: Jamie will join in the ECE dept. at Purdue Univeristy as an assistant professor in Fall 2020. Congratulations! May 2020: Jamie awarded the Second Place at the ACM Student Research Competition Grand Finals. Congratulations! March 2020: A paper accepted by IEEE TPDS. Congratulations to Ali and others! Oct.Â 2019: Our ASEâ19 paper on regulare expression programming has been selected to receive the ACM SIGSOFT Distinguished Paper Award. Congratulations to Mischa and Jamie! Aug.Â 2019: Jamie recieved the first prize at the Student Research Competition at ESEC/FSE 2019. Congratulations! Aug.Â 2019: Two papers accepted by ASE 2019. Congratulations to Jamie, Mischa, Daniel, and Ayaan! July 2019: I moved to Stony Brook University. May 2019: A paper accepted by FSE 2019. Congratulations to Jamie! May 2019: A paper accepted by USENIX Security 2019. Congratulations to Tong! Apr.Â 2019: A paper accepted by USENIX ATC 2019. Congratulations to Xinwei, Talha, and Jamie! Nov.Â 2018: A paper accepted by ASPLOS 2019. Congratulations to Tong! Oct.Â 2018: Our ESEC/FSEâ18 paper on ReDoS has been selected to receive the ESEC/FSE 2018 Distinguished Paper Award. Congratulations to Jamie and Christy again! Aug.Â 2018: A paper accepted by SCâ18. Congratulations to Ali A. July 2018: A paper accepted by MICRO 2018. Congratulations to Sam, Hongyu, and Tong! June 2018: I offered a K-12 outreach program âProgramming Paper Planesâ as a part of VT C-Tech^2 (6/26~29). June 2018: A paper accepted by FSE 2018. Congratulations to Jamie and Christy! June 2018: A NSF CSR Small proposal (PI) on repurposing Memory Protection Extensions (MPX) was funded. May 2018: I will serve as the General Vice-Chair for HPC 2019 (a part of SCS Spring Simulation Multi-Conference). May 2018: A paper accepted by USENIX Security 2018. Congratulations to Jamie and Eric! We also wrote a guide on nodejs.org, made fs.readFile safe, and added documentation on potential DoS vectors. Nov.Â 2017: A paper accepted by CGO 2018. Congratulations to Xinwei! Sep.Â 2017: An ICTAS JFA proposal on fog computing was funded. May 2017: An Agency of Defense Development (S. Korea) proposal (PI) on compiler-enhanced security was funded. Mar./June 2017: Our Node.fz paper (EuroSysâ17) was featured in VT News and The Morning Paper. Mar.Â 2017: A workshop paper accepted by EuroSec 2017. Congratulations to Jamie! Jan.Â 2017: A paper accepted by EuroSys 2017. Congratulations to Jamie! Nov.Â 2016: A paper accepted by ASPLOS 2017. Congratulations to Tong! June 2016: A paper accepted by MICRO 2016. Congratulations to Qingrui! June 2016: A paper accepted by SC 2016 as Best Student Paper Finalist. Congratulations to Qingrui! Nov.Â 2015: A paper accepted by ASPLOS 2016. Congratulations to Tong! Oct.Â 2015: A Google Research Award (PI) on data race detection was funded. July 2015: A NSF CCF Small proposal (coPI) on soft-error tolerance was funded. Mar.Â 2015: A paper accepted by LCTES 2015. Congratulations to Qingrui! Â Â Last updated on Nov 07, 2024.",
  "content_length": 6969,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:33"
}