{
  "name": "Dongjie Wang",
  "homepage": "https://wangdongjie100.github.io",
  "status": "success",
  "content": "Dongjie Wang Dongjie Wang is an assistant professor in the Department of Electrical Engineering and Computer Science at the University of Kansas. His research interests lie in data-centric AI, causal graph learning, spatial-temporal data mining, user profiling, and graph mining. He has published over 70 papers in top-tier conferences and journals, including NeurIPS, KDD, AAAI, WWW, TKDE, and KAIS. His work has received multiple recognitions, including three Best Paper Runner-up Awards at SIGSPATIAL and ICDM, and a Spotlight Paper at NeurIPS 2023. His recent research on automated urban planning has been featured by Synced AI and UCF Today, highlighting the broader societal impact of his work. He actively serves the research community as a program committee member or reviewer for NeurIPS, ICML, KDD, CVPR, AAAI, TPAMI, TKDD, and Nature Cities. For Perspective Students [TA/RA positions available] We are seeking highly motivated Ph.D. students to join our team. If you’re interested in data mining and its applications, please contact me at wangdongjie100@gmail.com. Include your CV, transcripts, TOEFL & GRE scores, and other relevant materials. Use the subject format “Prospective_Student_PhD_Your Name_…”. The University of Kansas (KU), the state’s flagship university, is a member of the Association of American Universities (AAU) and recognized as a Research I (R1) institution by the Carnegie Classification. For more details on the Computer Science Ph.D. program application process, visit the website. Announcement We will host the third AI for Data Editing at KDD 2025 📊. If you are interested in this topic, we welcome you to submit your paper 📝. For more details, please visit this link. News 2025/11/23 Congratulations! One paper has been accepted by KDD 2026. 2025/11/12 Congratulations! My CIKM paper was selected as a Best Paper Candidate. 2025/11/08 Congratulations! Two paper has been accepted by AAAI 2026. 2025/11/05 Congratulations! One paper has been accepted by IEEE TBD. 2025/10/23 Congratulations! One paper has been accepted by IEEE Bigdata. Selected Publications [See More] 2026 KDD’26 Heterogeneous Multi-Agent Reinforcement Learning with Attention for Cooperative and Scalable Feature Transformation Tao Zhe, Huazhen Fang, Kunpeng Liu, Qian Lou, Tamzidul Hoque, and Dongjie Wang In Proceedings of the 32nd ACM SIGKDD Conference on Knowledge Discovery and Data Mining, 2026 Bib @inproceedings{tao2026, title = {Heterogeneous Multi-Agent Reinforcement Learning with Attention for Cooperative and Scalable Feature Transformation}, author = {Zhe, Tao and Fang, Huazhen and Liu, Kunpeng and Lou, Qian and Hoque, Tamzidul and Wang, Dongjie}, booktitle = {Proceedings of the 32nd ACM SIGKDD Conference on Knowledge Discovery and Data Mining}, pages = {}, location = {Jeju, Korea}, series = {KDD '26}, year = {2026} } 2025 KDD’25 Continuous optimization for feature selection with permutation-invariant embedding and policy-guided search Rui Liu, Rui Xie, Zijun Yao, Yanjie Fu, and Dongjie Wang In Proceedings of the 31st ACM SIGKDD Conference on Knowledge Discovery and Data Mining, 2025 Bib @inproceedings{liu2025continuous, title = {Continuous optimization for feature selection with permutation-invariant embedding and policy-guided search}, author = {Liu, Rui and Xie, Rui and Yao, Zijun and Fu, Yanjie and Wang, Dongjie}, booktitle = {Proceedings of the 31st ACM SIGKDD Conference on Knowledge Discovery and Data Mining}, pages = {1857--1866}, location = {Toronto, Canada}, series = {KDD '25}, year = {2025} } 2023 NeurIPS’23 Reinforcement-enhanced autoregressive feature transformation: Gradient-steered search in continuous space for postfix expressions Dongjie Wang, Meng Xiao, Min Wu, Yuanchun Zhou, and Yanjie Fu Advances in Neural Information Processing Systems, 2023 Bib @article{wang2024reinforcement, title = {Reinforcement-enhanced autoregressive feature transformation: Gradient-steered search in continuous space for postfix expressions}, author = {Wang, Dongjie and Xiao, Meng and Wu, Min and Zhou, Yuanchun and Fu, Yanjie}, journal = {Advances in Neural Information Processing Systems}, volume = {36}, year = {2023}, } KDD’23 Interdependent Causal Networks for Root Cause Localization Dongjie Wang, Zhengzhang Chen, Jingchao Ni, Liang Tong, Zheng Wang, Yanjie Fu, and Haifeng Chen In Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining, 2023 Abs Bib HTML The goal of root cause analysis is to identify the underlying causes of system problems by discovering and analyzing the causal structure from system monitoring data. It is indispensable for maintaining the stability and robustness of large-scale complex systems. Existing methods mainly focus on the construction of a single effective isolated causal network, whereas many real-world systems are complex and exhibit interdependent structures (i.e., multiple networks of a system are interconnected by cross-network links). In interdependent networks, the malfunctioning effects of problematic system entities can propagate to other networks or different levels of system entities. Consequently, ignoring the interdependency results in suboptimal root cause analysis outcomes.In this paper, we propose REASON, a novel framework that enables the automatic discovery of both intra-level (i.e., within-network) and inter-level (i.e., across-network) causal relationships for root cause localization. REASON consists of Topological Causal Discovery (TCD) and Individual Causal Discovery (ICD). The TCD component aims to model the fault propagation in order to trace back to the root causes. To achieve this, we propose novel hierarchical graph neural networks to construct interdependent causal networks by modeling both intra-level and inter-level non-linear causal relations. Based on the learned interdependent causal networks, we then leverage random walk with restarts to model the network propagation of a system fault. The ICD component focuses on capturing abrupt change patterns of a single system entity. This component examines the temporal patterns of each entity’s metric data (i.e., time series), and estimates its likelihood of being a root cause based on the Extreme Value theory. Combining the topological and individual causal scores, the top K system entities are identified as root causes. Extensive experiments on three real-world datasets validate the effectiveness of the proposed framework. @inproceedings{10.1145/3580305.3599849, author = {Wang, Dongjie and Chen, Zhengzhang and Ni, Jingchao and Tong, Liang and Wang, Zheng and Fu, Yanjie and Chen, Haifeng}, title = {Interdependent Causal Networks for Root Cause Localization}, year = {2023}, isbn = {9798400701030}, publisher = {Association for Computing Machinery}, address = {New York, NY, USA}, doi = {10.1145/3580305.3599849}, booktitle = {Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining}, pages = {5051–5060}, numpages = {10}, keywords = {interdependent networks, network propagation, graph neural networks, causal structure learning, root cause analysis}, location = {Long Beach, CA, USA}, series = {KDD '23}, } KDD’23 Incremental Causal Graph Learning for Online Root Cause Analysis Dongjie Wang, Zhengzhang Chen, Yanjie Fu, Yanchi Liu, and Haifeng Chen In Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining, 2023 Abs Bib HTML The task of root cause analysis (RCA) is to identify the root causes of system faults/failures by analyzing system monitoring data. Efficient RCA can greatly accelerate system failure recovery and mitigate system damages or financial losses. However, previous research has mostly focused on developing offline RCA algorithms, which often require manually initiating the RCA process, a significant amount of time and data to train a robust model, and then being retrained from scratch for a new system fault.In this paper, we propose CORAL, a novel online RCA framework that can automatically trigger the RCA process and incrementally update the RCA model. CORAL consists of Trigger Point Detection, Incremental Disentangled Causal Graph Learning, and Network Propagation-based Root Cause Localization. The Trigger Point Detection component aims to detect system state transitions automatically and in near-real-time. To achieve this, we develop an online trigger point detection approach based on multivariate singular spectrum analysis and cumulative sum statistics. To efficiently update the RCA model, we propose an incremental disentangled causal graph learning approach to decouple the state-invariant and state-dependent information. After that, CORAL applies a random walk with restarts to the updated causal graph to accurately identify root causes. The online RCA process terminates when the causal graph and the generated root cause list converge. Extensive experiments on three real-world datasets demonstrate the effectiveness and superiority of the proposed framework. @inproceedings{10.1145/3580305.3599392, author = {Wang, Dongjie and Chen, Zhengzhang and Fu, Yanjie and Liu, Yanchi and Chen, Haifeng}, title = {Incremental Causal Graph Learning for Online Root Cause Analysis}, year = {2023}, isbn = {9798400701030}, publisher = {Association for Computing Machinery}, address = {New York, NY, USA}, doi = {10.1145/3580305.3599392}, booktitle = {Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining}, pages = {2269–2278}, numpages = {10}, keywords = {causal structure learning, incremental learning, trigger point detection, disentangled graph learning, root cause analysis}, location = {Long Beach, CA, USA}, series = {KDD '23}, } AAAI’23 Human-instructed Deep Hierarchical Generative Learning for Automated Urban Planning Dongjie Wang, Lingfei Wu, Denghui Zhang, Jingbo Zhou, Leilei Sun, and Yanjie Fu In Proceedings of the AAAI Conference on Artificial Intelligence, 2023 Bib HTML @inproceedings{wang2023human, title = {Human-instructe",
  "content_length": 12267,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:34"
}