{
  "name": "Dongwei Ren",
  "homepage": "https://csdwren.github.io",
  "status": "success",
  "content": "REN Dongwei About I am currently a Tenured Associate Professor (PhD supervisor) at the College of Intelligence and Computing, Tianjin University. I received the Bachelor degree and the Master degree from Harbin Institute of Technology in 2011 and 2013. I received joint PhD degrees from Harbin Institute of Technology and The Hong Kong Polytechnic University supervised by Prof. Wangmeng Zuo and Prof. David Zhang in 2017. My\tresearch\tinterests include computer vision and deep learning. Address No. 55 Building, 135 Yaguan Road, Tianjin, 300350, China. Email rendw@tju.edu.cn Welcome applications for PhD and Master positions. If you are a self-motivated student, feel free to send me your CV. Selected Publications (Google Scholar) Preprints W. Shang, D. Ren*, W. Zhang, Q. Wang, P. Zhu, W. Zuo, \"SelfDRSC++: Self-Supervised Learning for Dual Reversed Rolling Shutter Correction\", arXiv:2408.11411, 2024. pdf and code Publications W. Jiao, B. Li, W. Shang, P. Wang, D. Ren*, \"Efficient RAW Image Deblurring with Adaptive Frequency Modulation\", in Neural Information Processing Systems (NeurIPS), 2025. pdf and code Z. Lin, X. Ming, Q. Wang, D. Ren*, W. Zuo, Q. Hu, \"RoomEditor: High-Fidelity Furniture Synthesis with Parameter-Sharing U-Net\", in Neural Information Processing Systems (NeurIPS), 2025. pdf and code W. Shang, D. Ren*, W. Zhang, P. Zhu, Q. Hu, W. Zuo, \"Motion-Aware Adaptive Pixel Pruning for Efficient Local Motion Deblurring\", in ACM International Conference on Multimedia (ACM MM), 2025. pdf and code D. Ren, X. Shu, Y. Li, X. Wu, J. Li, W. Zuo, \"Reblurring-Guided Single Image Defocus Deblurring: A Learning Framework with Misaligned Training Pairs\", International Journal of Computer Vision, 2025. pdf and code T. Zhu, D. Ren*, Q. Wang, X. Wu, W. Zuo, \"Generative Inbetweening through Frame-wise Conditions-Driven Video Generation\", in IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2025. pdf and code T. Zhu, W. Shang, D. Ren*, \"Thin-Plate Spline-based Interpolation for Animation Line Inbetweening\", in AAAI Conference on Artificial Intelligence (AAAI), 2025. pdf and code W. Shang, D. Ren*, W. Zhang, Y. Fang, W. Zuo, K. Ma, \"Arbitrary-Scale Video Super-Resolution with Structural and Textural Priors\", in European Conference on Computer Vision (ECCV), 2024. pdf and code J. Lin, Z. Zhang, Y. Wei, D. Ren*, D. Jiang, Q. Tian, W. Zuo, \"Improving Image Restoration through Removing Degradations in Textual Representations\", in IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024. pdf and code W. Shang, D. Ren*, C. Feng, X. Wang, L. Lei, W. Zuo, \"Self-supervised Learning to Bring Dual Reversed Rolling Shutter Images Alive\", in IEEE International Conference on Computer Vision (ICCV), 2023. pdf and code W. Shang, D. Ren*, Y. Yang, H. Zhang, K. Ma, W. Zuo, \"Joint Video Multi-Frame Interpolation and Deblurring under Unknown Exposure Time\", in IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2023. pdf and code Y. Li, D. Ren*, X. Shu, W. Zuo, \"Learning Single Image Defocus Deblurring with Misaligned Training Pairs\", in AAAI Conference on Artificial Intelligence (AAAI), 2023. pdf and code X. Cui, C. Wang, D. Ren*, Y. Chen, P. Zhu, \"Semi-supervised Image Deraining Using Knowledge Distillation\", IEEE Transactions on Circuits and Systems for Video Technology, 2022. pdf and code Y. Cao, Z. Wan, D. Ren*, Z. Yan, W. Zuo, \"Incorporating Semi-Supervised and Positive-Unlabeled Learning for Boosting Full Reference Image Quality Assessment\", in IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2022. pdf and code Z. Yan, P. Li, B. Wang, D. Ren*, W. Zuo, \"Towards Learning Multi-domain Crowd Counting\", IEEE Transactions on Circuits and Systems for Video Technology, 2021. pdf and code W. Shang, D. Ren*, D. Zou, J. Ren, P. Luo, W. Zuo, \"Bringing Events into Video Deblurring with Non-consecutively Blurry Frames\", in IEEE International Conference on Computer Vision (ICCV), 2021. pdf, supp and code Z. Zheng, P. Wang, D. Ren*, W. Liu, R. Ye, Q. Hu, W. Zuo, \"Enhancing Geometric Factors in Model Learning and Inference for Object Detection and Instance Segmentation\", IEEE Transactions on Cybernetics, 2021. pdf and code D. Ren, W. Shang, P. Zhu, Q. Hu*, D. Meng, W. Zuo, \"Single Image Deraining Using Bilateral Recurrent Network\", IEEE Transactions on Image Processing, 2020. pdf and code D. Ren, K. Zhang, Q. Wang, Q. Hu*, W. Zuo, \"Neural Blind Deconvolution Using Deep Priors\", in IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2020. pdf, supp and code Z. Zheng, P. Wang, W. Liu, J. Li, R. Ye, D. Ren*, \"Distance-IoU Loss: Faster and Better Learning for Bounding Box Regression\", in AAAI Conference on Artificial Intelligence (AAAI), 2020. pdf and code D. Ren, W. Zuo*, D. Zhang, L. Zhang, M. H. Yang, \"Simultaneous Fidelity and Regularization Learning for Image Restoration\", IEEE Transactions on Pattern Analysis and Machine Intelligence, 2019. pdf, supp and code D. Ren, W. Zuo, Q. Hu*, P. Zhu, D. Meng, \"Progressive Image Deraining Networks: A Better and Simpler Baseline\", in IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2019. pdf, supp and code D. Ren, W. Zuo*, D. Zhang, J. Xu, L. Zhang, \"Partial Deconvolution with Inaccurate Blur Kernel\", IEEE Transactions on Image Processing, 2018. pdf W. Zuo, D. Ren, D. Zhang, S. Gu, L. Zhang, \"Learning Iteration-wise Generalized Shrinkage-Thresholding Operators for Blind Deconvolution\", IEEE Transactions on Image Processing, 2016. pdf and code D. Ren, H. Zhang, D. Zhang, W. Zuo*, \"Fast Total-Variation Based Image Restoration Based on Derivative Alternated Direction Optimization Methods\", Neurocomputing, 2015. pdf and code W. Zuo, D. Ren, S. Gu, L. Lin, L. Zhang, \"Discriminative Learning of Iteration-wise Priors for Blind Deconvolution\", in IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2015. D. Ren, W. Zuo*, X. Zhao, Z. Lin, D. Zhang, \"Fast Gradient Vector Flow Computation Based on Augmented Lagrangian Method\", Pattern Recognition Letters, 2013. pdf and code",
  "content_length": 6080,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:36"
}