{
  "name": "Dongsheng Wang 0003",
  "homepage": "https://wds2014.github.io/index.shtml.html",
  "status": "success",
  "content": "Dongsheng Wang's Homepage About me I currently serve as an Assistant Professor with the VCC group at the College of Computer Science and Software Engineering, Shenzhen University. I earned my Ph.D at Xidian University in 2024, and obtained my B.Sc from the same university in 2018. My Ph.D advisor was Prof. Chen Bo. My long-term research goal focuses on developing reliable AI systems to understand our complex and uncertain world. Probabilistic machine learning & Bayesian analysis: Variational inference, hierarchical models, and matrix factorization. Generative models: Diffusion-based models, auto-regressive models. Multimodal representation learning: Vision-language models, multimodal large language models. We are interested in designing state-of-the-art algorithms and applying these techniques to various applications, including computer vision, natural language processing, and domain alignment. We hope the methods developed within our group promote the development of AGI and improve the richness of our lives. Research Highlights Looking for highly motivated undergraduate and Master students who are interested in machine learning and related areas. Please send me your CV if you are interested. Please refer to Publications for our recent research. Outstanding students can be introduced to top colleges for Ph.D. studies. Junior PhD/master/undergraduate students: if you are interested in discussing life, career aspirations, or exploring research ideas in the fieleds of AGI and machine learning, feel free to concact me to arrage a conversation. I am committed to setting aside 2 hours each week specifically for these interactions. [07/2025] One paper is accepted by ICCV 2025 (Dynamic Multimodal Prototype Learning for CLIP). Congratulations to Xinyu! [05/2025] One paper is accepted by IJCAI 2025 (Consistency Alignment for the Compositional Zero-Shot task). Congratulations to Miaoge! [07/2024] We are presenting one paper at ECCV 2024 (Instruction Tuning-free Visual Token Complement for MLLMs), and one paper at UAI 2024 (Patch-Prompt Aligned Bayesian Prompt Tuning for Vision-Language Models). Congratulations to my coauthors! [07/2024] Hello, SZU. I accept the offer from Shenzhen University and join the VCC group at College of Computer Science and Software Engineering as an Assistant Professor. The next level of my academic journey is about to begin. I regularly serve as a reviewer for top-tier conferences and journals, including NeurIPS, ICML, ICLR, CVPR, ICCV, ECCV, TPAMI, IJCV, TKDE, and TNNLS.",
  "content_length": 2532,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:35"
}