{
  "name": "Dongbing Gu",
  "homepage": "https://www.essex.ac.uk/people/gudon81301/dongbing-gu",
  "status": "success",
  "content": "Dongbing Gu | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Dongbing Gu People Professor Dongbing Gu Professor School of Computer Science and Electronic Engineering (CSEE) Email dgu@essex.ac.uk Location 1NW.3.22, Colchester Campus Academic support hours Tuesday 10:00-11:00 and Thursday 11:00-12:00 (Autumn Term), Monday 15:00-16:00 and Thursday 13:00-14:00 (Spring Term) Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Member of the Robotics Group Dongbing Gu is a professor in the School of Computer Science and Electronic Engineering. His main research interests include robotics, autonomous systems, machine learning, multi-robot systems, cooperative control, SLAM, UAVs, and process automation. He has significant research experience in developing advanced robotic technologies and his research has been funded by UK Research Councils (EPSRC), InnovateUK, Royal Society, European Commission, British Council as well as industrial companies. He has published more than 200 scientific papers in refereed books, journals and conference proceedings in his research area. He has served as general chair, programme chair, and member on scientific and organizing committees of numerous international conferences. He is a member of the editorial board of Cognitive Computation, International Journal of Modelling, Identification and Control, Frontiers in Robotics and AI: Multi-robot systems. He was the chair of Chinese Automation and Computing Society in the UK (2016-2017). He was an executive member of IET Robotics and Mechatronics Network (2012-2015). Qualifications PhD University of Essex, (2004) MSc Beijing Institute of Technology, (1988) BSc Beijing Institute of Technology, (1985) Appointments University of Essex Professor, University of Essex (1/10/2012 - present) Research and professional activities Research interests Machine Learning Open to supervise Cooperative Control Open to supervise Unmanned Aerial Vehicles Open to supervise Robotics Open to supervise SLAM Open to supervise Autonomous Systems Open to supervise Navigation, Control and Guidance Open to supervise Current research Robotics, Autonomous systems, Machine Learning, SLAM, Cooperative Control, UAVs Conferences and presentations From SLAM to 3D perception Keynote presentation, Keynote at the 26th International Conference on Automation and Computing (ICAC2021), 2-4 Sep. 2021, 3/9/2021 Teaching and supervision Current teaching responsibilities Robotics (CE215) Programming Embedded Systems (CE865) Current supervision John Bosco Uroko Degree subject: Computer Science Degree type: Doctor of Philosophy Jiacheng Zhu Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Oluwasegun Oyekeye Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Hongtao Zhang Thesis title: Deep Multi-Task Learning for Farm Animal Monitoring From Images Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 30/5/2025 Han Yang Thesis title: Robust and Efficient Federated Learning Algorithms Against Adaptive Model Poisoning Attacks Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 1/5/2024 Leo Stuart Geer Thesis title: Navigation and Control for an Autonomous Robotic Fruit Harvesting System Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 21/8/2023 Tao Chen Thesis title: Object Pose Estimation and Tracking with Deep Learning for Robot Manipulation Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 11/5/2023 Tuo Feng Thesis title: Deep Learning for Depth, Ego-Motion, Optical Flow Estimation, and Semantic Segmentation. Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 6/12/2021 Yaser N Ibrahem Alothman Thesis title: Optimal Control of Multiple Quadrotors for Transporting a Cable Suspended Payload Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 18/1/2019 Ruihao Li Thesis title: Visual Simultaneous Localization and Mapping From Geometry to Deep Learning Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 12/4/2018 Jianjun Gui Thesis title: Direct Visual and Inertial Odometry for Monocular Mobile Platforms Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 20/3/2018 Wesam Mohammed Jasim Thesis title: Improving Leader-Follower Formation Control Performance for Quadrotors Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 7/10/2016 Luhutyit Peter Damuut Thesis title: A Cluster-Based Sensor Selection Scheme for Event Detection in Wireless Sensor Networks Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 12/12/2014 Carlos Adolfo Pina-Garcia Thesis title: Sampling Online Social Networks Through Random Walks. Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 24/11/2014 Bowen Lu Thesis title: Environmental Field Bayesian Estimation Using Mobile Wsns Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 25/3/2014 Publications Journal articles (113) Wang, Y., Liu, X., Gu, D., Wang, J. and Fu, X., (2025). Depth-Consistent Monocular Visual Trajectory Estimation for AUVs. IEEE Internet of Things Journal. 12 (10), 14909-14920 Zhu, M., Yuan, J., Kong, E., Liangliang, Z., Xiao, L. and Gu, D., (2025). NOP-GAN: Generative Adversarial Networks with Noise Optimization and Pyramid Coordinate Attention for Robust Image Denoising. International Journal of Intelligent Systems. 2025 (1) Chen, H., Wang, B., Gu, D. and Ye, W., (2025). A novel adaptive keyframe selection method with multi-source joint constraints for visual SLAM. Intelligent Service Robotics. 18 (3), 513-527 Zhu, M., Xu, Z., Zhang, Q., Lu, Y., Gu, D. and Xu, SS., (2025). GCSTormer: Gated Swin Transformer with Channel weights for Image Denoising. Expert Systems with Applications. 284, 12724-12724 Zhu, M., Gong, Y., Gu, D. and Tian, C., (2025). Improving 3D Object Detection in Neural Radiance Fields With Channel Attention. CAAI Transactions on Intelligence Technology. 10 (5), 1446-1458 Yang, H., Gu, D. and He, J., (2024). A Robust and Efficient Federated Learning Algorithm Against Adaptive Model Poisoning Attacks. IEEE Internet of Things Journal. 11 (9), 16289-16302 Feng, T. and Gu, D., (2024). RSTNet: Recurrent Spatial-Temporal Networks for Estimating Depth and Ego-Motion. IEEE Transactions on Emerging Topics in Computational Intelligence. 8 (3), 2375-2385 Chen, H., Wang, H., Ye, W. and Gu, D., (2024). Robust and Convergent Distributed Cooperative Localization with Labelled Bernoulli Random Finite Set. IEEE Sensors Journal. 24 (9), 15409-15420 Chen, H., Wang, H., Liu, Z., Gu, D. and Ye, W., (2024). HP3D-V2V: High-Precision 3D Object Detection Vehicle-to-Vehicle Cooperative Perception Algorithm. Sensors. 24 (7), 2170-2170 Hongtao, Z. and Gu, D., (2024). Deep Multi-task Learning for Animal Chest Circumference Estimation from Monocular Images. Cognitive Computation. 16 (3), 1092-1102 Chen, H., Wang, H., Liu, Z., Gu, D. and Ye, W., (2024). Correction: Chen et al. HP3D-V2V: High-Precision 3D Object Detection Vehicle-to-Vehicle Cooperative Perception Algorithm. Sensors 2024, 24, 2170. Sensors. 24 (11), 3320-3320 Wang, D., Yongxiang, D., Lian, J. and Gu, D., (2023). Adaptive End-effector Pose Control for Tomato Harvesting Robots. Journal of Field Robotics. 40 (3), 535-551 Yang, H., Gu, D. and He, J., (2023). DeMAC: Towards detecting model poisoning attacks in federated learning system. Internet of Things. 23, 100875-100875 Bai, X., Li, J., Zhang, C., Hu, H. and Gu, D., (2023). Distracted driving behavior recognition based on improved MobileNetV2. Journal of Electronic Imaging. 32 (05) Guo, H. and Gu, D., (2023). Closely arranged inshore ship detection using a bi-directional attention feature pyramid network. International Journal of Remote Sensing. 44 (22), 7106-7125 Bai, X., Tan, J., Hu, H., Zhang, C. and Gu, D., (2023). SGCRNN: A ChebNet-GRU fusion model for eeg emotion recognition. Journal of Intelligent and Fuzzy Systems. 45 (6), 10545-10561 Wang, Y., Gu, D., Ma, X., Wang, J. and Wang, H., (2023). Robust Real-Time AUV Self-Localization Based on Stereo Vision-Inertia. IEEE Transactions on Vehicular Technology. 72 (6), 7160-7170 Wang, F., Li, F., Mohan, V., Dudley, R., Gu, D. and Bryant, R., (2022). An unsupervised automatic measurement of wheat spike dimensions in dense 3D point clouds for field application. Biosystems Engineering. 223, 103-114 Chen, T. and Gu, D., (2022). CSA6D: Channel-Spatial Attention Networks for 6D Object Pose Estimation. Cognitive Computation. 14 (2), 702-713 Wang, Y., Ma, X., Wang, J., Hou, S., Dai, J., Gu, D. and Wang, H., (2022). Robust AUV Vi",
  "content_length": 48907,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:35"
}