{
  "name": "Dong Shao",
  "homepage": "https://software.nju.edu.cn/dongshao/index.html",
  "status": "success",
  "content": "软件学院 邵栋 软件学院 电话： 邮箱：dongshao AT nju.edu.cn 地址： 办公地址： 邮编： 邵栋  Dong SHAO 现任南京大学软件学院副教授，软件学院副院长，智能软件与工程学院执行院长。主要从事软件工程教学研究工作，研究方向为敏捷软件开发、软件研发效能、软件过程、DevOps、大语言模型驱动软件工程（LLM4SE)等，在国际主流学术会议期刊发表数十篇学术论文。南京大学软件学院软件研发效能实验室研究团队、“南京大学-星环科技星云数据技术联合研究中心”，国家级教学团队“软件工程主干课程教学团队”成员。中国计算机学会软件工程专业委员会成员。一次获得中华人民共和国教育部颁发的“国家级教学成果一等奖（排名3）”，三次获得“国家级教学成果奖二等奖”，两次获得江苏省教学成果特等奖，两次获得 “南京大学我最喜爱的老师”称号。       Dong Shao is an Associate Professor at the Software Institute, Nanjing University, and also the Vice Dean of the Software Institute. He is also the Executive Dean of the School of Intelligent Software and Engineering, Nanjing University.       His main research work focuses on software engineering, with research interests in agile software development, software development efficiency, software processes, and DevOps. He has published dozens of academic papers in international  academic conferences and journals. He is a member of the Software Development Efficiency Laboratory at the Software Institute, Nanjing University, the \"Nanjing University-Xinghuan Technology Xingyun Data Technology Joint Research Center,\" and the national-level teaching team \"Software Engineering Core Course Teaching Team.\" He is also a member of the Software Engineering Professional Committee of the China Computer Society.       He has been awarded the \"National Teaching Achievement First Prize (Rank 3)\" by the Ministry of Education of the People's Republic of China once, and the \"National Teaching Achievement Second Prize\" three times. Selected Publications：•Guoping Rong, Hao Wang, Shenghui Gu, Yangchen Xu, Jialin Sun, Dong Shao, He Zhang. Locating Anomaly Clues for Atypical Anomalous Services: An Industrial Exploration. [J]. IEEE Transactions on Deppendable and Secure Computing, 2022. •Zhang H, Huang H, Shao D, et al. Fireteam: a small-team development practice in industry[C]//Proceedings of the 28th ACM Joint Meeting on European Software Engineering Conference and Symposium on the Foundations of Software Engineering. 2020: 1365-1375.•Yang, L., Zhang, H., Shen, H., Huang, X., Zhou, X., Rong, G., & Shao, D. (2020). Quality Assessment in Systematic Literature Reviews: A Software Engineering Perspective. Information and Software Technology, 106397.•荣国平, 张贺, 邵栋*, 王青, “软件组织与管理方法综述“, 软件学报, 30(1):62-79, 2019.软件组织与管理方法综述.•G. Rong, H. Zhang, B. Liu, D. Shao and Q. Shan, “A Replicated Experiment for Evaluating the Effectiveness of Pairing Practice in PSP Education“, Journal of Systems and Software, 136:139-152, 2018.•G. Rong, Z. Jin, H. Zhang, and D. Shao, “DevDocOps: Towards Automated Documentation for DevOps”, in Proceedings of 41st International Conference on Software Engineering: Software Engineering in Practice (ICSE’19-SEIP), Montreal, Canada: IEEE, 2019, pp.243-252.•黄璜, 张贺*, 邵栋, “自动化工具对中国DevOps实践的影响“, 软件学报, 30(10):3056-3070, 2019. •G. Rong, H. Zhang, B. Liu, D. Shao, Q. Shan, “A Replicated Experiment for Evaluating the Effectiveness of Pairing Practice in PSP Training“, Journal of Systems and Software, 136:139-152, 2018. (doi:10.1016/j.jss.2017.08.011)•G. Rong, H. Zhang and D. Shao, “Applying Competitive Bidding Games in Software Process Education”, in Proceedings of 26th Conference on Software Engineering •G. Rong, H. Zhang, M. Xie and D. Shao, “Improving PSP Education by Pairing: An Empirical Study”, in Proceedings of 34th International Conference on Software Engineering (ICSE’12), Zurich, Switzerland: IEEE, 2012, pp.1245-1254. Textbooks：·      DevOps：原理、方法与实践（第二版），机械工业出版社·      软件工程与计算（卷1）·软件开发的编程基础，机械工业出版社 Blogs：· 软件工程和其它计算机科学研究方向的关系· 软件工程教育“守破离”· 计算机科学与技术和软件工程，这两个专业的区别在哪？· 论软件工程专业学生与计算机专业学生的应有可见差别· 软件工程专业硕士教育两点思考· 敏捷创新方法：AiF框架· 互联网模式-软件开发 Courses：·      南京大学新生研讨班–高科技市场探究，全校公选课·      软件工程与计算I，大一第二学期 ·      软件工程与管理，研究生一年级第一学期·      人工智能驱动软件工程（AI4SE）",
  "content_length": 3765,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:29"
}