{
  "name": "DongGyun Han",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/donggyun-han",
  "status": "success",
  "content": "DongGyun Han - Royal Holloway Research Portal DongGyun Han Dr Lecturer in Computer Science (Soft Eng), Department of Computer ScienceCentre for Programming Languages and SystemsCentre for Intelligent Systems https://orcid.org/0000-0002-8599-2197 EmailDongGyun.Hanrhul.acuk TW20 0EX Personal profile Personal profilePersonal Homepage: https://donggyun.com/ Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 5 Conference contribution 5 Article 4 Preprint Research output per year Research output per year Finding Safety Violations of AI-Enabled Control Systems through the Lens of Synthesized Proxy ProgramsShi, J., Yang, Z., He, J., Xu, B., Kim, D., Han, D. & Lo, D., 27 Jan 2025, (E-pub ahead of print) In: ACM Transactions on Software Engineering and Methodology.Research output: Contribution to journal › Article › peer-review Open AccessFile 4 Downloads (Pure) Visualising Developer Interactions in Code ReviewsBee, D. & Han, D., 28 Jul 2025, The ACM International Conference on the Foundations of Software Engineering (FSE 2025). ACM, p. 1070-1073 4 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 38 Downloads (Pure) Bridging Expert Knowledge with Deep Learning Techniques for Just-In-Time Defect PredictionZhou, X., Han, D. & Lo, D., 10 Dec 2024, In: Empirical Software Engineering. 30, 44 p., 37.Research output: Contribution to journal › Article › peer-review Gotcha! This Model Uses My Code! Evaluating Membership Leakage Risks in Code ModelsYang, Z., Zhao, Z., Wang, C., Shi, J., Kim, D., Han, D. & Lo, D., 25 Oct 2024, (E-pub ahead of print) In: IEEE Transactions on Software Engineering. 17 p.Research output: Contribution to journal › Article › peer-review Open AccessFile 20 Downloads (Pure) Out of Sight, Out of Mind: Better Automatic Vulnerability Repair by Broadening Input Ranges and SourcesZhou, X., Kim, K., Xu, B., Han, D. & Lo, D., 20 May 2024, ICSE '24: Proceedings of the IEEE/ACM 46th International Conference on Software Engineering. New York: Association for Computing Machinery (ACM), p. 1-13 13 p. 88Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 84 Downloads (Pure) View all 14 research outputs",
  "content_length": 2569,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:33"
}