{
  "name": "Dongyu Liu",
  "homepage": "https://dongyu.tech",
  "status": "success",
  "content": "Dongyu Liu @ UC Davis \"It’s not that I’m so smart. It’s just that I stay with problems longer.\" — Albert Einstein Dongyu Liu is an Assistant Professor of computer science at the University of California at Davis, where he directs the Visualization and Intelligence Augmentation (VIA) research group. His research lies at the intersection of Machine Learning (ML), Visualization (VIS), and Human-Computer Interaction (HCI). He designs and develops visualization-empowered human-AI teaming systems to augment human intelligence for data-driven decision-making, by innovating at two fundamental building blocks: human-centered AI and human-AI interfaces. The central theme driving his research is the pursuit of “big data, intelligent algorithms, intuitive interfaces” to bridge data gaps, making the data-to-decision process more efficient, effective, and trustworthy in critical domains such as sustainability and healthcare. The ultimate goal is to catalyze solutions to pressing challenges in these areas so as to improve the quality of human life and the environment. Before joining UC Davis, Dongyu was a postdoctoral associate at MIT Schwarzman College of Computing, where he worked with Dr. Kalyan Veeramachaneni in the Data To AI group. He received his Ph.D. in Computer Science and Engineering from the Hong Kong University of Science and Technology under the supervision of Prof. Huamin Qu. He serves on organizing committees, program committees, and editorial boards for various venues. His systems have been released as open-source projects, and have drawn wide attention from open-source communities. Some of his techniques have been adopted for external or internal use by leading companies and nonprofits including Microsoft and Bosch, (satellite communication), (renewable energy), Colorado Department of Human Services, and Children’s Hospital of Zhejiang University School of Medicine. His work is also extensively covered by various media outlets, including MIT News, Dataconomy, ScienceDaily, InfoQ, and Health IT Analytics. Research Interests Data Visualization Visual Analytics Human-Centered AI Human-AI Interaction Agentic AI Major Application Areas Environmental Sustainability Health Informatics Urban Informatics Tweets by @dongyuliu_",
  "content_length": 2273,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:39"
}