{
  "name": "Dong Gong",
  "homepage": "https://donggong1.github.io",
  "status": "success",
  "content": "Dong Gong Dong Gong Home Publications Projects Group Services Dong Gong Senior Lecturer & ARC DECRA Fellow, School of Computer Science and Engineering (CSE), The University of New South Wales (UNSW Sydney) Adjunct Faculty Member, Australian Institute for Machine Learning (AIML), The University of Adelaide [Github] [Google Scholar] [Twitter] [UNSW Homepage] [Short Bio] I am continually seeking highly self-motivated PhD and MPhil with passion and strong background for machine learning and computer vision. Please check the details and drop me an email with your CV and transcripts if you are interested. News (Sep 2025) 2 papers (continual learning w/ model inversion, efficient and scalable motion generation) accepted to appear at NeurIPS 2025. Congrats to Ruilin and Zeyu! (Sep 2025) I am awarded NVIDIA Academic Grant Program award to support our research on dynamic Mixture-of-Expert and continual learning. (Aug 2025) I accept to serve as Area Chair for CVPR 2026 and ICLR 2026. (Jun 2025) 1 paper (on test-time adaptation) is accepted at ICCV; 1 paper has been accepted at IJCAI; I will serve as Area Chair for WACV 2026. (Apr 2025) I will serve as Area Chair for NeurIPS 2025. (Feb 2025) I will serve as Area Chair for ACM MM 2025. (Feb 2025) 3 papers (self-expansion of modularized models for continual learning, test-time alignment for T2I-Gen, and continual test-time adaptation) accepted to appear at CVPR 2025. Congrats to Huiyi, Xin, and co-authors! (Jan 2025) 3 papers (coreset selection for continual learning, continual learning for diffusion model personalization, and DAG learning) accepted to appear at ICLR 2025. Congrats to Ruilin, Saurav, and co-authors! (Dec 2024) I will serve as an Area Chair for ICCV 2025. (Nov 2024) I will serve as an Area Chair for ICML 2025. (Nov 2024) Congratulations to my student Haodong Lu for being awarded Google PhD Fellowship! (Oct  2024) I am awarded as ACM MM 2024 Outstanding Area Chair. (Sep  2024) Our CLAP4CLIP paper (continual learning with probabilistic fine-tuning of CLIP) is accepted to appear at NeurIPS 2024. Congrats to Saurav. (Sep  2024) Will be serving as Area Chair for CVPR 2025. (July 2024) 1 paper (on image generation) accepted to appear at ACM MM 2024. (Jun  2024) 1 paper (on 360°Camera depth est.) accepted to appear at IROS 2024. (Jun  2024) Serving as Area Chair for ACM MM 2024. (May  2024) I am serving as organizing committee member for AJCAI 2024 (call for paper). (Jan  2024) 2 papers (on OOD detection and causal representation learning) accepted to appear at ICLR 2024. Congrats to Haodong and Yuhang. (Sep  2023) 2 papers (both on Continual Learning) accepted to appear at NeurIPS 2023. Congrats to Saurav and Mark. (May  2023) I am serving as the Tutorial Chair for AJCAI 2023. (Feb  2023) 1 paper (about multi-frame depth estimation) accepted to appear at CVPR 2023 (Feb  2023) 1 paper (image deblurring with Transformer) accepted to appear in TIP (Jan  2023) 1 paper accepted to appear at ICLR 2023. Congrats to collaborators. (Sep  2022) I am awarded ARC Discovery Early Career Researcher Award (DECRA) starting in 2023 to study Continual Learning. (Sep  2022) 1 paper (about DAG learning) accepted to appear at NeurIPS 2022 (Mar 2022) 1 paper (Continual Learning with Sparse Neural Networks) accepted to appear at CVPR 2022 (Jan  2022) Check the article summarizing part of our works using ML to help agriculture innovation. (Sep  2021) 1 paper (about HDR imaging) accepted to appear in IJCV. (July 2021) 1 paper (Memory-augmented Neural Relational Inference) accepted to appear at ICCV 2021 (July 2021) I will be a co-lecturer on Introduction to Statistical Machine Learning at UoA this semester, and give guest lectures at Deep Learning Fundamentals. (Dec 2020) 1 paper (unpaired domain-adaptive learning for realistic SR) accepted to appear in TIP (Oct  2020) 1 paper (learning attention model for vehicle retrieval) accepted to appear in TITS (Sep  2020) I am giving lectures at UoA Deep Learning Fundamentals on RNN, Attention, & Memory Networks. (July 2020) 1 paper (memory network for 3D point cloud with long-tail dist.) accepted to appear at ECCV 2020 (Jan  2020) 1 paper (on learning to optimize for image deconv.) accepted to appear in TNNLS (July 2019) 1 paper (MemAE) accepted to appear at ICCV 2019 (July 2019) 1 paper (about Sparse PCA) accepted to appear in TKDE (Jun  2019) 2nd Prize of OZ Minerals Explorer Challenge as part of DeepSightX team (Mar 2019) 1 paper accepted to appear in TKDE (Feb  2019) 4 papers accepted to appear at CVPR 2019 (Nov 2018) 1 paper (on Blind Image Quality Assessment) accepted to appear in TIP (Oct  2018) 1 paper (about MRF based Compressive Sensing) accepted to appear in TIP (Sep  2018) 1 paper (MPTV) accepted to appear in TIP (July 2018) 2 papers accepted to appear at ECCV 2018 (Oct  2017) Participated in ICCV 2017 Doctoral Consortium with a travel award (July 2017) 1 paper accepted to appear at ICCV 2017 1 paper accepted to appear at CVPR 2017 1 new arXiv paper on deep learning for motion estimation and blur removal 1 paper accepted to appear at AAAI 2017 as an oral Research Interests I have broad interests in machine learning and computer vision. My research aims to develop reliable, useful, and efficient AI for open-ended scenarios. My current major research topics are about: continual learning - forgetting mitigation for training LLMs, VLMs, etc foundation model adaptation, customization, and post-training generative models deep learning model design, e.g., - memory augmentation - mixture-of-experts high-level visual perception & low-level vision problems, e.g., - semantic and depth prediction - image restoration and enhancement interdisciplinary problems with of CV, ML, and DL technologies, e.g., - mining and agriculture Contact Office: Level 4, Building K17, UNSW, Sydney 2052, Australia Email : edgong01 at gmail.com, dong.gong at unsw.edu.au Page generated by jemdoc.",
  "content_length": 5947,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:27"
}