{
  "name": "Dong Li 0031",
  "homepage": "https://www.csee.umbc.edu/dong-li",
  "status": "success",
  "content": "Dong Li – Department of Computer Science and Electrical Engineering – UMBC Skip to main content Department of Computer Science and Electrical Engineering Menu Apply Search Search Context This Site All of UMBC Location CSEE Main Office: ITE 325 1000 Hilltop Circle Baltimore, MD 21250 Contact Phone: 410-455-3500Contact Us Department of Computer Science and Electrical Engineering on FacebookDepartment of Computer Science and Electrical Engineering on TwitterDepartment of Computer Science and Electrical Engineering on YouTubeDepartment of Computer Science and Electrical Engineering on LinkedIn Position Assistant Professor Office 355 Information Technology and Engineering (ITE) Building Contact Info University of Maryland, Baltimore County 1000 Hilltop Circle Baltimore, MD 21250 Email: dli@umbc.edu Website: https://leetton.github.io/ Research Areas Wireless Sensing, Mobile Computing, Wearable Sensing, Multi-model Sensing, Smart Health Biography Dong Li is an assistant professor in the Computer Science and Electrical Engineering (CSEE) department at the University of Maryland, Baltimore County. His research interests include Wireless Sensing, Mobile Computing, Wearable Sensing, Multi-model Sensing, and Smart Health. His primary research goal is to develop innovative sensing and computing systems that can help humanity in healthcare equity, wealth distribution, and environmental sustainability by making them more affordable and accessible to the average user worldwide. His work has been published in high-impact venues such as MobiCom, SenSys, IPSN, UbiComp, and HotNets. Dong earned his Ph.D. from the Manning College of Information and Computer Sciences at the University of Massachusetts Amherst. He holds an M.Eng. in Software Engineering from Shanghai Jiao Tong University and a B.S. in Computer Science from the University of Electronic Science and Technology of China. Location CSEE Main Office: ITE 325 1000 Hilltop Circle Baltimore, MD 21250 Contact Phone: 410-455-3500Contact Us Department of Computer Science and Electrical Engineering on FacebookDepartment of Computer Science and Electrical Engineering on TwitterDepartment of Computer Science and Electrical Engineering on YouTubeDepartment of Computer Science and Electrical Engineering on LinkedIn © UMBC: A University System of Maryland Member Institution Accreditation Equal Opportunity Privacy Policy Title IX Web Accessibility Consumer Information Subscribe to UMBC Weekly Top Stories First Name Last Name Email I am interested in: I am interested in: Undergraduate I am interested in: Graduate I am interested in: Professional Masters",
  "content_length": 2623,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:30"
}