{
  "name": "Dong Xie 0001",
  "homepage": "https://sites.psu.edu/dongx",
  "status": "success",
  "content": "Dong Xie | Department of Computer Science and Engineering Dong Xie Assistant Professor Department of Computer Science and Engineering School of Electrical Engineering and Computer Science Penn State University Office Address: W325 Westgate Building University Park, PA 16802 Email: dongx (at) psu (dot) edu Phone: (814) 865-9148 Bio Dong Xie is an assistant professor in the computer science and engineering department at Penn State University. He received his Ph.D in Computer Science from University of Utah in 2020, and received his bachelor's degree from ACM Honored Class of Shanghai Jiao Tong University in 2015. He received SIGMOD best paper award in 2025, the Google Research Scholar Award in 2023, Microsoft Research PhD Fellowship in 2018, and SoCC best paper runner-up in 2019. His research interest lies in building data systems to address the challenges of processing and analyzing real-world large-scale data. His research span in multiple areas including data systems on modern hardware, distributed databases, main-memory databases, stream processing systems, approximate query processing, spatio-temporal data processing, data privacy, and system security. You can find a more complete CV here. Students: Maxwell Norfolk, PhD, since Fall 2022. Vishak Bharadwaj, PhD, since Fall 2025 Douglas Rumbaugh, PhD, Graduated Summer 2025, First Employment: Harrisburg University of Science and Technology. Selected Publications: Low-Latency Transaction Scheduling via Userspace Interrupts: Why Wait or Yield When You Can Preempt? Kaisong Huang, Jiatang Zhou, Zhuoyue Zhao, Dong Xie and Tianzheng Wang. In Proceedings of 44th ACM SIGMOD International Conference on Management of Data (SIGMOD 2025) Awarded Best Paper Towards Systematic Index Dynamization Douglas Rumbaugh, Dong Xie, Zhuoyue Zhao 50th International Conference on Very Large Data Bases (VLDB 2024) Practical Dynamic Extension for Sampling Indexes Douglas Rumbaugh, Dong Xie In Proceedings of 43th ACM SIGMOD International Conference on Management of Data (SIGMOD 2024) AB-tree: Index for Concurrent Random Sampling and Updates Zhuoyue Zhao, Dong Xie, Feifei Li In Proceedings of 48th International Conference on Very Large Data Bases (VLDB 2022) Towards Practical Oblivious Join Zhao Chang, Dong Xie, Sheng Wang, Feifei Li In Proceedings of 41th ACM SIGMOD International Conference on Management of Data (SIGMOD 2022) SSDs Striking Back: The Storage Jungle and Its Implications on Persistent Indexes Kaisong Huang, Darien Imai, Tianzheng Wang, Dong Xie In Proceedings of 2022 Conference on Innovative Data Systems Research (CIDR 2022) Spatial Independent Range Sampling Dong Xie, Jeff M. Phillips, Michael Matheny, Feifei Li In Proceedings of 40th ACM SIGMOD International Conference on Management of Data (SIGMOD 2021) Efficient Oblivious Query Processing for Range and kNN Queries Zhao Chang, Dong Xie, Feifei Li, Jeff M. Phillips, Rajeev Balasubramonian IEEE Transactions on Knowledge and Data Engineering (TKDE), 2021 Scalable Spatial Scan Statistics for Trajectories Michael Matheny, Dong Xie, Jeff M. Phillips ACM Transaction on Knowledge Discovery from Data (TKDD), 2020 Narrowing the Gap Between Serverless and its State with Storage Functions Tian Zhang, Dong Xie, Feifei Li, Ryan Stutsman In Proceedings of 10th ACM Symposium of Cloud Computing (ACM SoCC 2019) Awarded Best Paper Runner-Up FishStore: Faster Ingestion with Subset Hashing [Code] Dong Xie, Badrish Chandramouli, Yinan Li, Donald Kossmann In Proceedings of 38th ACM SIGMOD International Conference on Management of Data (SIGMOD 2019) Solar: Towards a Shared-Everything Database on Distributed Log-Structured Storage Tao Zhu, Zhuoyue Zhao, Feifei Li, Weining Qian, Aoying Zhou, Dong Xie, Ryan Stutsman, Haining Li, Huiqi Hu In Proceedings of 2018 USENIX Annual Technical Conference (USENIX ATC 2018) Distributed Trajectory Similarity Search [Code] Dong Xie, Feifei Li, Jeff M. Phillips In Proceedings of 43rd International Conference on Very Large Data Bases (VLDB 2017) Oblivious RAM: A Dissection and Experimental Evaluation [Code] Zhao Chang, Dong Xie, Feifei Li In Proceedings of 42nd International Conference on Very Large Data Bases (VLDB 2016) Simba: Efficient In-Memory Spatial Analytics [Code] Dong Xie, Feifei Li, Bin Yao, Gefei Li, Liang Zhou, Minyi Guo In Proceedings of 35th ACM SIGMOD International Conference on Management of Data (SIGMOD 2016) Skip to toolbar Log InSearch",
  "content_length": 4432,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:32"
}