{
  "name": "Dong Nguyen",
  "homepage": "https://www.dongnguyen.nl",
  "status": "success",
  "content": "Dong Nguyen Dong Nguyen .home .publications .data .thesis Hi, I am an associate professor at Utrecht University. Previously I was a research fellow at the Alan Turing Institute. I was also affiliated with Edinburgh University. I completed my Ph.D. at the University of Twente. I received a master's degree from the Language Technologies Institute at Carnegie Mellon University and a bachelor's degree in Computer Science from the University of Twente. I have interned at Facebook (fall 2011), Microsoft Research (fall 2013), and Google (summer 2014). In fall 2015 I visited Georgia Tech. I'm a member of the Utrecht Young Academy. I'm heading the NLP and Society Lab @ UU . DataDivers: Diving into Data Diversity for Fair and Robust NLP, a 5-year (2025-2029) funded ERC Starting grant project. Academic service Co-organizer Federated Web Search track at TREC (2013-2014). Program Committees: I regularly serve on the PCs of various conferences, including EMNLP, ACL, EACL, NAACL, SIGIR, ICWSM, ECIR, CIKM etc. Area chair: ACL 2019, EMNLP 2019, NAACL 2021, EMNLP 2021, EMNLP 2022, FAccT 2024 Senior Area chair: EMNLP 2020, EACL 2023, NAACL 2025 Data chair: ICWSM 2021 Miscellaneous Media coverage: New York Times, Time Magazine, New Scientist, Radio 538, Volkskrant, etc. Invited talks (selection): Carnegie Mellon University (2022), VarDial workshop (2022), Indiana University Bloomington (2021), Bocconi University (2021), Workshop on NLP+CSS at EMNLP 2020, Keynote at the Computational Humanities Research workshop (2020), Keynote at COMPTEXT 2020, A video on Youtube of a talk I gave in Feb 2017 summarizing some of my work. Featured in Women in NLP spotlights. Special issue on computational sociolinguistics. Awards/Fellowships/Personal grants: ERC Stg (2024), KNAW Early Career Award (2019), Veni grant (2019), Gerrit van Dijk Award (2018), Overijssel PhD Award (2017), Alan Turing Institute Fellowship (2016), UT in the media award (2013), Fulbright scholarship (2009) and the WO Echo Beta Techniek award (2007). Teaching: Methods in AI Research (AI Msc, intro to ML/NLP, 2019—); Social Computing (AI Msc, 2020); Human-centered machine learning (AI Msc, 2021— ; some slides on fairness are here (1), here (2), here (3) and here (4). I'm also involved in lifelong learning/education for professionals (government professionals, 2019—)",
  "content_length": 2340,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:29"
}