{
  "name": "Dongyan Xu",
  "homepage": "https://www.cs.purdue.edu/homes/dxu",
  "status": "success",
  "content": "Dongyan Xu Dongyan Xu Samuel Conte Professor of Computer ScienceDirector, CERIAS dxu@purdue.edu Address Purdue University Department of Computer Science 305 N. University Street West Lafayette, Indiana, 47907-2107 Office Phone: +1 765-494-7841 FAX: +1 765-494-0739 Postdoc Positions Available: Two Postdoc positions are available in my lab, in the (broadly defined) areas of cyber-physical security and software security. If interested please drop me an email with your CV. Thank you. Welcome to Dongyan Xu's home page. I am a Samuel Conte Professor of Computer Science at Purdue University, where I joined in 2001 as an assistant professor. I received my Ph.D. in Computer Science from the University of Illinois at Urbana-Champaign, under the direction of Professor Klara Nahrstedt. I am a recipient of six Seed for Success Awards from Purdue University, a CAREER Award from NSF, eight Best Paper/Student Paper Awards from RAID'08, SOCC'11, ASE'13, USENIX Security'14, CCS'15, NDSS'16, USENIX Security'17, and WOOT'20. I was a Purdue University Faculty Scholar from 2012 to 2017. I received the College of Science Undergraduate Advising (2008), Graduate Advising (2014), Leadership (2013, 2016), Research (2015), and Team (2015, 2017) Awards. I am the Director of CERIAS, Purdue's cybersecurity research and education center. I served as Head of the Department of Computer Science in Fall 2019. The three components of my professional life: Research: Current interests: computer systems security, malware defense and forensics, cloud computing, and virtualization technologies. Group: Lab FRIENDS (Lab For Research In Emerging Network & Distributed Systems) Affiliation: CERIAS. Sponsors (past and present): AFOSR, AFRL, CERDEC, DARPA, IARPA, NSA, NSF, ONR, Sandia National Labs, Cisco Systems, DOCOMO USA Labs, ETRI, Microsoft Research, Northrop Grumman, Southwest Research Institute, Vencore Labs (ACS), Purdue Research Foundation. Publications Teaching: CS354 - Operating Systems (Spring 2015, with Prof. Fahmy) CS354 - Operating Systems (Fall 2014) CS503 - Operating Systems (Spring 2014) CS354 - Operating Systems (Fall 2013) CS503 - Operating Systems (Spring 2013) CS250 - Computer Architecture (Fall 2012) CS354 - Operating Systems (Spring 2012) CS250 - Computer Architecture (Fall 2011) CS250 - Computer Architecture (Spring 2011) CS503 - Operating Systems (Fall 2010) CS591 - Distributed Systems and Networking Seminar (Fall 2010) CS354 - Operating Systems (Spring 2010) CS591C - Research Seminar for First-Year Graduate Students (Fall 2009) CS397 - Honors Seminar (Fall 2009) CS250 - Computer Architecture (Spring 2009) On sabbatical (Fall 2008) CS354 - Operating Systems (Spring 2008) CS590C - Virtualization Technologies (Fall 2007) CS240 - C Programming (Fall 2007, with Prof. Yau) CS503 - Operating Systems (Spring 2007) CS250 - Computer Architecture (Fall 2006) CS503 - Operating Systems (Spring 2006) CS354 - Operating Systems (Fall 2005) CS590C - Virtual Networked Computing (Spring 2005) CS503 - Operating Systems (Fall 2004) CS503 - Operating Systems (Spring 2004) CS603 - Advanced Topics in Distributed Systems (Fall 2003) CS250 - Computer Architecture (Spring 2003) CS590N - Topics in Peer-to-Peer Networks and Services (Fall 2002) CS502 - Compiling and Programming Systems (Spring 2002) CS590N - QoS-Sensitive Networked Services (Fall 2001) Network Systems Colloquium (Fall 2001) Service: Director, CERIAS, 1/2020 - Present. Head, Department of Computer Science, 9/2019 - 1/2020. Interim Director, CERIAS, 7/2016 - 8/2018. Assistant Director, CERIAS, 2011 - 2013. Associate Editor, ACM Transactions on Autonomous and Adaptive Systems, 2011 - 2015. Associate Editor, Cluster Computing Journal, 2007 - 2015. Panelist, NSF proposal review panels, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2014, 2015, 2020. TPC Member, IEEE Symposium on Security and Privacy (S&P), 2010, 2015. TPC Member, USENIX Security Symposium 2018, 2021. TPC Member, ISOC NDSS 2006, 2012, 2013, 2014, 2015, 2017, 2018, 2019 (co-chair), 2020 (co-chair), 2021. TPC Member, ACM Conf. on Computer and Communications Security (CCS) 2013, 2016, 2017 (co-chair). TPC Member, ACM Symp. on Cloud Computing (SOCC) 2011, 2014. TPC Member, DFRWS 2011, 2012, 2013, 2014, 2015, 2016. TPC Member, ACSAC 2011, 2012, 2013, 2014, 2015, 2016. TPC Member, ACM ASIACCS 2010, 2011, 2016. TPC Member, DIMVA 2011. TPC, USENIX HotCloud 2009, 2010 (co-Chair), 2013, 2014. TPC Member, ACM HPDC 2010, 2011, 2012, 2013, 2014 (co-Chair), 2015, 2016. TPC Member, IEEE/ACM Supercomputing (SC) 2005, 2006, 2007, 2008, 2013. TPC Member, ACM/IEEE ICAC 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012 (co-Chair), 2015. Co-Chair, ACM NOSSDAV 2009, Williamsburg, VA, 2009. TPC Member, RAID 2009, 2012, 2015, 2016. TPC Member, SecureComm 2009, Athens, Greece, 2009, 2015. TPC Member, ACM CCS Workshop on Scalable Trusted Computing, Fairfax, VA, 2006. TPC Member, ACM SIGCOMM Workshop on Large-Scale Attack Defense, Pisa, Italy, 2006. In Memoriam: Saburo Muroga (1925-2009) This page last modified .",
  "content_length": 5057,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:38"
}