{
  "name": "Dongjin Song",
  "homepage": "https://songdj.github.io",
  "status": "success",
  "content": "Dongjin Song Search Dongjin Song Assistant Professor of CSE University of Connecticut Biography I am a tenure-track assistant professor in the School of Computing, University of Connecticut (UConn) since August 2020. Before that, I was a research staff member at NEC Labs America in Princeton, NJ, since July 2016. I received my Ph.D. degree in the Department of Electrical and Computer Engineering from University of California San Diego (UCSD) with the guidance of Prof. David A. Meyer in June 2016. I also work closely with Prof. Dacheng Tao from Nanyang Technological University (NTU). My research focuses on developing foundational AI and machine learning models in the form of continual learning, graph machine learning, domain generalization, LLMs, and foundation models, to perform time series analysis (e.g., representation, similarity search, prediction/forecasting, and anomaly detection), understand complex networks/graphs, and make trustworthy and interpretable decisions for continuously evolving real world applications (e.g., evolving graphs, dynamic systems, physical world, IoT systems, environmental science, healthcare and biomedical data). Three of my papers DARNN, HetGNN, and MSCRED have been ranked as the most influential papers in IJCAI 2017, KDD 2019, and AAAI 2019 by paperdigest.org, respectively. I received the prestigious NSF Career Award in 2024, Frontiers of Science Award (FSA) in 2024, and UConn AAUP Excellence Award for Research and Creativity - Earlier Career in 2025. I also received UCONN Research Excellence Program (REP) Award in 2021. [Survey of Multimodal Time Series Analysis]: Multi-modal Time Series Analysis: A Tutorial and Survey [Paper] [Github] [Survey of Continual Learning on Graphs]: Continual Learning on Graphs: Challenges, Solutions, and Opportunities [Paper] [Github] [Recruiting]: Looking for Ph.D. students in Machine Learning/Graph Representation Learning/Time Series Analysis/LLMs & Foundation Models/Reinforcement Learning to join our group! Please send me an email with your CV and transcript. Recent News April 2025 I am promoted to be an Associated Professor with (Earlier) Tenure at UConn! [Link] April 2025 Xuyang, Zijie, Yushan, and Brendan have received intern offers from NEC Labs America, TikTok, Mayo Clinic, and Microsoft! Congratulations to all! April 2025 I am invited to serve as Area Chair for NeurIPS 2025! March 2025 I am invited to give a guest lecture about Empowering LLMs for Healthcare Time Series Analysis @ UT Austin ! March 2025 I am invited to serve on a NSF Panel! March 2025 I am invited to serve as reviewer for the US-Israel Binational Science Foundation! February 2025 We have successfully organized the AI4TS workshop @ AAAI 2025! [link] February 2025 I give two tutorials Continual Learning on Graphs and LLMs and Foundation Models for Time Series Analysis @ AAAI 2025! February 2025 I am honored to have received the NSF WISER Award for power outage prediction! [Link] January 2025 One paper about continual learning on dynamic systems is accepted to ICLR 2025! Congratulations to Xikun, Yushan and all collaborators! [Link] January 2025 I am invited to serve as an Associate Editor for the journal Neural Networks! January 2025 I am invited to serve as a Social Media Co-Chair for ICDM 2025! More News… Interests Machine Learning, Data Mining, Deep Learning Foundation Models and LLMs Time Series Analysis Graph Representation Learning Continual Learning Federated Learning Reinforcement Learning Education Ph.D. in ECE, 2016 University of California, San Diego (UCSD) MPhil, 2010 The Hong Kong Polytechnic University B.Eng, 2007 University of Science and Technology of China (USTC) Selected Publications * denotes the student/intern I supervised/mentored. Discover full publication list. Chinmaey Shende, Soumyashree Sahoo, Stephen Sam, Parit Patel, Reynaldo Morillo, Xinyu Wang, Shweta Ware, Jinbo Bi, Jayesh Kamath, Alexander Russell, Dongjin Song, Bing Wang October 2023 Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT/UbiComp) Predicting Symptom Improvement During Depression Treatment Using Sleep Sensory Data PDF Cite Xikun Zhang*, Dongjin Song, Dacheng Tao August 2023 IEEE Transactions on Neural Networks and Learning Systems (TNNLS) Ricci Curvature based Graph Sparsification for Continual Graph Representation Learning PDF Cite Yushan Jiang*, Wenchao Yu, Dongjin Song, Lu Wang, Wei Cheng, Haifeng Chen August 2023 Proceedings of the 29th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD) FedSkill Privacy Preserved Interpretable Skill Learning via Imitation PDF Cite Jiangwei Wang, Lili Su, Songyang Han, Dongjin Song, Fei Miao June 2023 ACM Transactions on Cyber-Physical Systems (TCPS) Towards Safe Autonomy in Hybrid Traffic Detecting Unpredictable Abnormal Behaviors of Human Drivers via Information Sharing PDF Cite Yang Jiao, Kai Yang, Tiancheng Wu, Dongjin Song, Chengtao Jian May 2023 Proceedings of International Conference on Learning Representations (ICLR) Asynchronous Distributed Bilevel Optimization PDF Cite Chang Li*, Dongjin Song, Dacheng Tao May 2023 Proceedings of International Conference on Learning Representations (ICLR) HiT-MDP Learning the SMDP option framework on MDPs with Hidden Temporal Variables PDF Cite Xikun Zhang*, Dongjin Song, Dacheng Tao December 2022 Proceedings of 36th Conference on Neural Information Processing Systems (NeurIPS) Datasets and Benchmarks Track CGLB: Benchmark Tasks for Continual Graph Learning PDF Cite Code Yang Jiao, Kai Yang, Dongjin Song December 2022 Proceedings of 36th Conference on Neural Information Processing Systems (NeurIPS) Distributed Distributionally Robust Optimization with Non-Convex Objectives PDF Cite Xikun Zhang*, Dongjin Song, Dacheng Tao December 2022 Proceedings of IEEE International Conference on Data Mining (ICDM) Sparsified Subgraph Memory for Continual Graph Learning PDF Cite Code Xikun Zhang*, Dongjin Song, Dacheng Tao June 2022 IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI) Hierarchical Prototype Networks for Continual Graph Representation Learning PDF Cite Code Yang Jiao, Kai Yang, Dongjin Song, Dacheng Tao February 2022 IEEE Transactions on Network Science and Engineering (TNSE) TimeAutoAD: Autonomous Anomaly Detection with Self-supervised Contrastive Loss for Multivariate Time Series PDF Cite Shao-Hao Lu, Mohamadmahdi Samandari, Caihong Li, Huijie Li, Dongjin Song, Yi Zhang, Ali Tamayol, Xueju Wang January 2022 Sensors and Actuators Reports Multimodal Sensing and Therapeutic Systems for Wound Healing and Management: A Review PDF Cite Jingchao Ni, Zhengzhang Chen, Wei Cheng, Bo Zong, Dongjin Song, Yanchi Liu, Xuchao Zhang, Haifeng Chen November 2021 Proceedings of the 30th ACM International Conference on Information and Knowledge Management (CIKM) Interpreting Convolutional Sequence Model by Learning Local Prototypes with Adaptation Regularization PDF Cite Xinyang Feng*, Dongjin Song, Yuncong Chen, Zhengzheng Chen, Jingchao Ni, Haifeng Chen October 2021 Proceedings of the 29th ACM International Conference on Multimedia (MM) Convolutional Transformer based Dual Discriminator General Adversarial Networks for Video Anomaly Detection PDF Cite Liang Tong, Zhengzhang Chen, Jingchao Ni, Wei Cheng, Dongjin Song, Haifeng Chen, Yevgeniy Vorobeychik June 2021 Proceedings of IEEE Conference on Computer Vision and Pattern Recognition (CVPR) FACESEC: A Fine-grained Robustness Evaluation Framework for Face Recognition Systems PDF Cite Code Dongkuan Xu, Wei Cheng, Jingchao Ni, Dongsheng Luo, Masanao Natsumeda, Dongjin Song, Bo Zong, Haifeng Chen, Xiang Zhang May 2021 Proceedings of SIAM International Conference on Data Mining (SDM) Deep Multi-Instance Contrastive Learning with Dual Attention for Anomaly Precursor Detection PDF Cite Yinjun Wu, Jingchao Ni, Wei Cheng, Bo Zong, Dongjin Song, Zhengzhang Chen, Yanchi Liu, Xuchao Zhang, Haifeng Chen, Susan Davidson February 2021 Proceedings of the 35th AAAI Conference on Advance of Artificial Intelligence (AAAI) Dynamic Gaussian Mixture based Deep Generative Model For Robust Forecasting on Sparse Multivariate Time Series PDF Cite Code Dongkuan Xu, Wei Cheng, Xin Dong, Bo Zong, Wenchao Yu, Jingchao Ni, Dongjin Song, Xuchao Zhang, Haifeng Chen, Xiang Zhang February 2021 Proceedings of the 35th AAAI Conference on Advance of Artificial Intelligence (AAAI) Multi-Task Recurrent Modular Networks PDF Cite Cheng Zheng, Bo Zong, Wei Cheng, Dongjin Song, Jingchao Ni, Wenchao Yu, Haifeng Chen, Wei Wang July 2020 Proceedings of the 37th International Conference on Machine Learning (ICML) Robust Graph Representation Learning via Neural Sparsification PDF Cite Licheng Wang, Bo Zong, Qianqian Ma, Wei Cheng, Jingchao Ni, Wenchao Yu, Yanchi Liu, Dongjin Song, Haifeng Chen, Yun Fu April 2020 Proceedings of International Conference on Learning Representations (ICLR) Inductive and Unsupervised Representation Learning on Graph Structured Objects PDF Cite Xin Dong, Jingchao Ni, Wei Cheng, Zhengzhang Chen, Bo Zong, Dongjin Song, Yanchi Liu, Haifeng Chen, Gerard de Melo February 2020 Proceedings of the 34th AAAI Conference on Advance of Artificial Intelligence (AAAI) Asymmetrical Hierarchical Networks with Attentive Interactions for Interpretable Review-based Recommendation PDF Cite Dixian Zhu*, Dongjin Song, Yuncong Chen, Cristian Lumezanu, Wei Cheng, Bo Zong, Jingchao Ni, Takehiko Mizoguchi, Tianbao Yang, Haifeng Chen February 2020 Proceedings of the 34th AAAI Conference on Advance of Artificial Intelligence (AAAI) Deep Unsupervised Binary Coding Networks for Multivariate Time Series Retrieval PDF Cite Dongkuan Xu, Wei Cheng, Bo Zong, Dongjin Song, Jingchao Ni, Wenchao Yu, Yanchi Liu, Haifeng Chen, Xiang Zhang February 2020 Proceedings of the 34th AAAI Conference on Advance of Artificial Intelligence (AAAI) Tensorized LSTM with Adaptive Shared Memory for Learning Trends in Multivariate Time Series PDF Cite Chux",
  "content_length": 11772,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:34"
}