{
  "name": "Dong-Ming Yan 0001",
  "homepage": "https://sites.google.com/site/yandongming",
  "status": "success",
  "content": "Dong-Ming Yan's HomepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationDong-Ming YanProfessorState Key Laboratory of Multimodal Artificial Intelligence Systems (MAIS)National Laboratory of Pattern Recognition (NLPR)Institute of Automation, Chinese Academy of Sciencesyandongming(at)gmail.comHomepage at UCAS: http://people.ucas.ac.cn/~dmyanEducation & Working Experiences01/2022 - present,    Professor, MAIS, CASIA, China10/2018 - 12/2021,  Professor, NLPR, CASIA, China10/2013 - 09/2018, Associate Prof., NLPR, CASIA, China05/2011 - 09/2013, PostDoc, GMSV, KAUST, Saudi Arabia05/2010 - 04/2011, PostDoc, INRIA Nancy, France10/2009 - 04/2010, Research Assistant, The University of Hong Kong, Hong Kong, China02/2005 - 09/2009, Ph.D. in Computer Science, The University of Hong Kong, Hong Kong, China09/2002 - 01/2005, M.E. in Computer Science, Tsinghua University, Beijing, China09/1998 - 07/2002, B.S. in Computer Science, Tsinghua University, Beijing, ChinaResearch InterestsComputer-Aided DesignComputer GraphicsGeometry ProcessingArtificial IntelligenceProfessional ServicesEditorial BoardComputer Graphics Forum  (CGF), Associate Editor (2023 - 2026)The Visual Computer (TVCJ), Associate Editor (2018 - 2023)Journal of Computer Science and Technology (JCST), Editorial Board of Young Scientists (2018 - )Visual Computing for Industry, Biomedicine and Art (VCIBA), Associate Editor (2018 - 2023) Program ChairGDC2025Program CommitteeSGP 2024Eurographics 2019Pacific Graphics 2014~2018, 2020, 2021SPM 2018~2020 GMP 2017~2020, 2022~2024CGI 2022, 2023GI 2018CVM 2017~2025PRCV 2019~2021CAD/Graphics 2015~2025ACDDE 2018ChinaGraph 2016~2024GDC 2016~2024ChinaCAD&CG 2107~2021ChinaGraphics 2019ChinaVR 2020~2023NCIG 2020Publications [Citations] [DBLP] [ResearchGate]PreprintE^3-Net: Efficient E(3)-Equivariant Normal Estimation NetworkHanxiao Wang, Mingyang Zhao, Weize Quan, Zhen Chen, Dong-Ming Yan, Peter WonkaIEEE Transactions on Visualization and Computer Graphics, 2025, acceptedM2HF: Multi-branch Multi-modal Hybrid Fusion for Text-Video RetrievalShuo Liu, Weize Quan, Ming Zhou, Sihong Chen, Jian Kang, Zhe Zhao, Kimmo Yan, Chen Chen, Dong-Ming YanComputational Visual Media, 2024, accepted2026Point Geometrical Coulomb Force: An explicit and robust embedding for point cloud analysis Haojun Xu, Ling Hu, Qinsong Li, Shengjun Liu, Dong-Ming Yan, Xinru LiuPattern Recognit. 170: 112025 (2026)Facade Parsing via Joint Structural Priors and Phased Deep LearningYi Zhong, Yuning Huang, Weize Quan, Dong-Ming Yan, Jie Jiang, Yingmei Wei Neurocomputing, 663(28), 2026, 1320642025BrepGPT: Autoregressive B-rep Generation with Voronoi Half-PatchPu Li,  Wenhao Zhang,  Weize Quan, Biao Zhang, Peter Wonka, Dong-Ming YanACM Transactions on Graphics (SIGGRAPH Asia 2025)Autoregressive Generation of Static and Growing TreesHanxiao Wang, Biao Zhang, Jonathan Klein, Dominik L. Michels, Dong-Ming Yan, Peter WonkaSIGGRAPH Asia 2025 ConferenceStitch-A-Shape: Bottom-up Learning for B-Rep GenerationPu Li, Wenhao Zhang, Jinglu Chen, Dong-Ming YanSIGGRAPH 2025 ConferenceBoolean Operation for CAD Models Using a Hybrid RepresentationYingyu Yang, Xiaohong Jia, Bolun Wang, Jieyin Yang, Shiqing Xin, Dong-Ming YanACM Transactions on Graphics (SIGGRAPH 2025)DeFillet: Detection and Removal of Fillet Regions in Polygonal CAD ModelsJing-En Jiang, Hanxiao Wang, Mingyang Zhao, Dong-Ming Yan, Shuangmin Chen, Shiqing Xin, Changhe Tu, Wenping WangACM Transactions on Graphics (SIGGRAPH 2025)Mesh2Brep: B-rep Reconstruction via Robust Primitive Fitting and Intersection-aware ConstraintsZeyu Shen, Mingyang Zhao, Dong-Ming Yan, Wencheng WangIEEE Transactions on Visualization and Computer Graphics, 31(10): 6661-6676, 2025FR-CSG: Fast and Reliable Modeling for Constructive Solid Geometry Jiaxi Chen, Zeyu Shen, Mingyang Zhao, Xiaohong Jia, Dong-Ming Yan,  Wencheng WangIEEE Transactions on Visualization and Computer Graphics, 31(9): 5869-5883, 2025ResGEM: Multi-scale Graph Embedding Network for Residual Mesh Denoising Ziqi Zhou, Mengke Yuan, Mingyang Zhao, Jianwei Guo, Dong-Ming YanIEEE Transactions on Visualization and Computer Graphics, 31(4): 2028-2044,  2025Spectral Descriptors for 3D Deformable Shape Matching: A Comparative SurveyShengjun Liu, Haibo Wang, Dong-Ming Yan, Qinsong Li, Feifan Luo, Zi Teng, Xinru Liu IEEE Transactions on Visualization and Computer Graphics, 31(3):1677-1697, 2025Towards Voronoi Diagrams of Surface PatchesPengfei Wang, Jiantao Song, Lei Wang, Shiqing Xin, Dong-Ming Yan, Shuangmin Chen, Changhe Tu, Wenping WangIEEE Transactions on Visualization and Computer Graphics, 31(10): 6810-6823, 2025Occlusion-aware Non-Rigid Point Cloud Registration via Unsupervised Neural Deformation CorrentropyMingyang Zhao, Gaofeng Meng, Dong-Ming YanICLR 2025Revisiting CAD Model Generation by Learning Raster SketchPu Li, Wenhao Zhang, Jianwei Guo, Jinglu Chen, Dong-Ming YanAAAI 2025GoHD: Gaze-oriented and Highly Disentangled Portrait Animation with Rhythmic Poses and Realistic ExpressionsZiqi Zhou, Weize Quan, Hailin Shi, Wei Li, Lili Wang, Dong-Ming YanAAAI 2025PointCFormer: a Relation-based Progressive Feature Extraction Network for Point Cloud CompletionYi Zhong, Weize Quan, Dong-Ming Yan, Jie Jiang, Yingmei WeiAAAI 2025Concept-Edge Fusion: Background Generation for Product Presentation Based on Text-to-Image ModelPengfei Deng, Tianjiao Zhang, Weize Quan, Hanyu Wang, Qinglin Lu, Zhifeng Li, Dong-Ming YanCVM 2025Diffused Poses and Distilled Expressions for Controllable Audio-driven Talking Face GenerationZiqi Zhou, Weize Quan, Zhaojin Lu, Dong-Ming YanICASSP 2025CLIP-Flow: A Universal Discriminator for AI-Generated Images Inspired by Anomaly DetectionZhipeng Yuan, Kai Wang, Weize Quan, Dong-Ming Yan, Tieru WuACM MM Workshop on DFF, 2025 OralDTESR: Remote Sensing Imagery Super-Resolution with Dynamic Reference Textures ExploitationJingliang Guo, Mengke Yuan, Tong Wang, Zhifeng Li, Xiaohong Jia, Dong-Ming YanGeoscience and Remote Sensing Letters, 22:1-5, 2025Efficient Roof Reconstruction From a Single Aerial lmageYu Du,  Mingyang Zhao,  Jian Shi, Lubin Fan, Dong-Ming YanComputers & Graphics, 2025MPIC: Exploring alternative approach to standard convolution in deep neural networksJie Jiang, Yi Zhong, Ruoli Yang, Weize Quan, Dong-Ming YanNeural Networks, 184, 2025, 107082Distinctive learning of latent space feature for occlusion-aware facade parsingYi Zhong, Jie Jiang, Weize Quan, Mingyang Zhao, Dong-Ming YanBuilding and Environment, 2025Characterizing the permeability of gas-liquid dispersions via structural evolution and interfacial mobility Zhixiong Wu, Dong-Ming Yan, Zhen-Yu Yin, Liming HuColloids and Surfaces A: Physicochemical and Engineering Aspects2024Layout-Aware Single-Image Document FlatteningPu Li, Weize Quan, Jianwei Guo, Dong-Ming YanACM Transactions on Graphics, 43(1), No.9:1-17, 2024A Bayesian Approach Toward Robust Multidimensional Ellipsoid-Specific FittingMingyang Zhao, Xiaohong Jia, Lei Ma, Yuke Shi, Jingen Jiang, Qizhai Li, Dong-Ming Yan, Tiejun HuangIEEE Transactions on Pattern Analysis and Machine Intelligence, 2024, 46(12): 10106-10123Correspondence-Free Non-Rigid Point Set Registration Using Unsupervised ClusteringMingyang Zhao, Jingen Jiang, Lei Ma, Shiqing Xin, Gaofeng Meng, Dong-Ming YanCVPR, 2024 (Highlight) [C++/Matlab code]SfmCAD: Unsupervised CAD Reconstruction by Learning Sketch-based Feature Modeling OperationsPu Li, Jianwei Guo, Huibin Li, Bedrich Benes, Dong-Ming YanCVPR, 2024CMG-Net: Robust Normal Estimation for Point Clouds via Chamfer Normal Distance and Multi-scale GeometryYingrui  Wu,  Mingyang Zhao,  Keqiang Li,  Weize Quan, Tianqi Yu, Jianfeng Yang, Xiaohong Jia, Dong-Ming YanAAAI 2024CGFormer: ViT-Based Network for Identifying Computer-Generated Images with Token LabelingWeize Quan, Pengfei Deng, Kai Wang, Dong-Ming YanIEEE Transactions on Information Forensics & Security, 19:235-250, 2024Deep Learning-based Image and Video Inpainting: A Survey Weize Quan, Jiaxi Chen, Yanli Liu, Dong-Ming Yan, Peter WonkaInternational Journal of Computer Vision, 2024Accurate Registration of Cross-Modality Geometry via Consistent ClusteringMingyang Zhao, Xiaoshui Huang, Jingen Jiang, Luntian Mou, Dong-Ming Yan, Lei MaIEEE Transactions on Visualization and Computer Graphics, 2024, 30(7): 4055 - 4067Coherent Chord Computation and Cross Ratio for Accurate Ellipse DetectionMingyang Zhao, Xiaohong Jia, Lei Ma,  Liming Hu,  Dong-Ming YanPattern Recognition, 46: 109983, 2024Improving Ellipse Fitting via Multi-scale Smoothing and Key-point SearchingXiao-Diao Chen, Cheng Qian, Mingyang Zhao, Jun-Hai Yong, Dong-Ming YanPattern Recgonition. 151: 110432, 2024HeightFormer: Single Imagery Height Estimation Transformer with Bilateral Feature Pyramid Fusion Jiangyan Wu, Mengke Yuan, Tong Wang, Xiaohong Jia, Dong-Ming YanGeoscience and Remote Sensing Letters, 21: 6016205, 2024VQ-CAD: Computer-Aided Design Model Generation with Vector Quantized DiffusionHanxiao Wang, Mingyang Zhao, Yiqun Wang, Weize Quan, Dong-Ming Yan Comput. Aided Geom. Des. (Proc. of GMP), 2024Interactive Reverse Engineering of CAD ModelsZhenyu Zhang, Mingyang Zhao, Zeyu Shen, Yuqing Wang, Xiaohong Jia, Dong-Ming Yan Comput. Aided Geom. Des. (Proc. of GMP), 2024Feature-preserving Shrink Wrapping with Adaptive AlphaJiayi Dai, Yiqun Wang, Dong-Ming Yan Comput. Aided Geom. Des. (Proc. of GMP), 2024Neural Parametric Human Hand Modeling with Point Cloud RepresentationJian Yang, Weize Quan, Zhen Shen, Dong-Ming Yan, Huaiyu WuICMR 2024Steady Conformal Support Structures for 3D PrintingDong Wang, Zhen Shen, Qihang Fang, Dong-Ming Yan, Weixing Wang, Qing Wang, Gang XiongCASE 2024: 2243-2248FFCM-MRF: An accurate and generalizable cerebrovascular segmentation pipeline for humans and rhesus monkeys based on TOF-MRAYue Cui,  Haibin Huang, Jialu Liu, Mingyang Zhao, Chengyi Li, Xinyong Han, Na Luo, Jinquan Gao, Dong-Ming Yan, Chen Zhang, Tianzi Jiang, Shan YuComputers in Biology and Medicine, 170: 107996, 2024",
  "content_length": 40097,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:31"
}