{
  "name": "Dongyeop Kang",
  "homepage": "https://dykang.github.io",
  "status": "success",
  "content": "Dongyeop Kang (DK) @ University of Minnesota Dongyeop Kang (DK) Assistant Professor CS&E, University of Minnesota Shepherd 411 dongyeop@umn.edu Minnesota NLP MnRI / MCAL / DSI / TextG / LIL / HCC News (read more) (Oct 2025) Gave a talk about Value of Human Work in the Age of AI at May Brodbeck OutReach Series by UMN Philosophy (Jul 2025) Thanks Thomson Reuters and Naver for generous gift and key research collaboration. (May-July 2025) Gave talks about AI Scientists or AI-powered Scientists? Understanding and Supporting Scientists' Cognitive Workflows at AI2, Seoul National Univ., and Korea Univ. (Apr 2025) Zae Myung Kim won the Doctoral Dissertation Fellowship, focusing on meta-scaffolding of LLMs. (Jan 2025) It's grateful to receive the NSF NAIRR Pilot award (280,000 GPU Hours) to build scientific foundational models for trustworthy scientific discovery. (Dec 2024) James Mooney won the Amazon MLSys Fellowship for 2025-2026, and Karin de Langis won the Doctoral Dissertation Fellowship. (Sep 2024) Two papers (Dynamic Multi-reward Alignment, Diversity Extraction) are accepted at EMNLP Main 2024 (Aug 2024) Thanks Grammarly again for a generous gift and key research collaboration. (Jul 2024) I am co-organizing the first workshop on Pluralistic Alignment workshop at NeurIPS 2024. (Jun 2024) Excited to receive Agent Benchmark Grant from Open Philanthropy for collceting lawyer benchmark dataset (w Daniel Schwarcz, Brett McDonnell) (May 2024) Four papers (Thread-of-Subtlety, CoBBLEr, Self-Video-Alignment, VQA Reasoning) are accepted at ACL 2024 (Mar 2024) Some of our recent work on writing assistant are featured in UMN CS (link) (Dec 2023) Excited to receive a grant from UMN CTSI for the development of AI Assistant for Non-English Speaking Clinical Trial Partipants (/w Jennifer Needle and Gwenyth Fischer) (Dec 2023) Thrid In2Writing workshop (focused on \"Dark Sides: Envisioning, Understanding, and Preventing Harmful Effects of Writing Assistants\") will be held at CHI 2024 in Hawaii. (Oct 2023) We are grateful to OpenAI, Cohere, Google, Amazon, and Oracle for their generous support of our computing needs (Aug 2023) Excited to receive Cisco Research Award on Generative AI (Aug 2023) Excited to receive a genrous gift from Accenture Labs (Jun 2023) Excited to receive the UMN Early Innovation Fund (Apr 2023) Very honored to receive 3M Non-tenured Faculty Award (NTFA) in 2022-2023 . (Nov 2022) Our second In2Writing workshop will be held at CHI 2023 in Hamburg, Germany (Oct 2022) Very excited to receive a generous gift from Grammarly . (Oct 2022) Minnesota NLP seminar is back in Fall 2022! (Jun 2022) Very honored to receive Sony Research Faculty Innovation Award . (May 2022) Received the best paper award on human-in-the-loop interative text revision from In2Writing workshop at ACL 2022 (May 2022) At ACL 2022, our group presents two papers ( iterative text revision and human-in-the-loop interative text revision) and co-organizes Intelligent and Interactive Writing Assistants (In2Writing) workshop (Nov 2021) I am co-organizing \"CtrlGen: Controllable Generative Modeling in Language and Vision\" workshop at NeurIPS 2021. (Apr 2021) I will be joining Minnesota CSE as an assistant professor in 2021 Fall. (Jun 2020) Joined UC Berkeley as a postdoctoral scholar, working with Marti A. Hearst. (May 2020) Passed my Ph.D thesis defense. Check out my thesis! Ph.D. Students Past Members I build human-centric language technologies, focusing on cognitively aligning human and machine thinking, advancing AI as thinking partners. My work bridges language and cognition to develop novel algorithms, benchmarks, and interaction frameworks that support experts in complex, real-world cognitive workflows. I design AI that augments humans: models that learn from how people plan, reason, and create; anticipate cognitive bottlenecks; scaffold difficult tasks; and adapt dynamically to expert strategies. See my research statement (technical, non-technical). My current research focuses on three areas: Cognitive scaffolding: Enhancing LLMs with human cognition data to improve planning, abstraction, and reasoning. Thinking Assistant for Experts: Building interactive systems for collaboration with scientists, lawyers, journalists, and educators, and benchmarking their workflows and thought processes. Societal alignment: Designing inclusive NLP systems that reflect pluralistic perspectives. I am founder and co-director of Minnesota NLP group. For prospective students and postdocs interested in joining Minnesota NLP, read this page. Recent Publication ( By Date | By Topic | Full List | Google Scholar ) Writing & Thinking Alignment Interaction Cognition Writing (AI or/and Human) Writing, Discourse, Planning Alignment Societal Alignment, Diversity Modeling, Personalization Interaction Interactive and Collaborative AI systems Cognition Perception, Interpretability, Styles Others",
  "content_length": 4915,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:37"
}