{
  "name": "Donna M. Rizzo",
  "homepage": "http://www.uvm.edu/~drizzo",
  "status": "success",
  "content": "Donna Rizzo Donna's research focuses on the development of new computational tools to improve the understanding of human-induced changes on natural systems and the way we make decisions about natural resources. In 1995, she co-founded a small Vermont business to help speed the diffusion of research and new technologies into environmental practice. Since joining UVM in fall 2002, she has worked on a number of computational approaches to multi-scale environmental problems, including using artificial neural networks to 1) develop maps of discrete spatially-distributed fields (e.g., log-hydraulic conductivity and soil lithology), 2) predict local disease risk indicators from multi-scale weather, land and crop data, 3) image and analyze the parameter structure of subcutaneous connective tissue in humans, 4) predict the shrink/swell of soils and 4) develop a watershed classification system using hierarchical artificial neural networks for diagnosing watershed impairment at multiple scales. Contact Information Address: 213 Votey Hall, 33 Colchester Ave, Burlington, VT 05405, United States Phone: (802)-656-1495 E-mail: drizzo@uvm.edu Education Doctor of Philosophy (Ph. D.) in Civil & Environmental Engineering University of Vermont M.S - Civil Engineering University of California, Irvine Art and Archeology University of Florence, Italy Civil Engineering (Honors College) University of Connecticut, Storrs Graduate Students Ali Javed Ph.D. in Computer Science (expected graduation 2021) Jeremy Matt Ph.D. in Complex Systems (expected graduation 2022) Kevin Andrew Ph.D. in Computer Science (expected graduation 2021) Lindsay Taylor Ph.D. in Civil and Enviornmental Engineering (expected graduation 2022) Jesse Gourevitch Ph.D. in Natural Resources (expected graduation 2021) Jessica Buckley M.S. in Civil and Environmental Engineering (expected graduation 2022) Ph.D. Students (Graduated) Kristen Underwood, (graduated summer 2018), Ph.D. in Civil and Environmental Engineering, Dissertation: Smart Classifiers and Bayesian Inference for Evaluating River Sensitivity to Natural and Human Disturbances: A Data Science Approach. Co-advised with M. Dewoolkar. Ian Anderson, (graduated winter 2018), Ph.D. in Civil and Environmental Engineering. Dissertation: Improving Detection and Prediction of Bridge Scour Damage and Vulnerability under Extreme Flood Events using Geomorphic and watershed Data. Co-advised with primary advisor M. Dewoolkar. Scott Hamshaw, (graduated fall 2017), 3-year NSF Graduate Research Fellowship recipient, Ph.D. in Civil and Environmental Engineering. Dissertation: Fluvial Processes in Motion: Measuring Bank Erosion and Suspended Sediment Flux using Advanced Geomatic Methods and Machine Learning. John Hanley, (graduated spring 2017), Ph.D. in Civil and Environmental Engineering, Dissertation: Development of a new evolutionary algorithm to mine noisy, epistatic, geospatial survey data associated with Chagas Disease. Justin Guilbert, (graduated fall 2016), Ph.D. in Civil and Environmental Engineering, Dissertation: The Impacts of Climate Change on Precipitation and Hydrology in the Northeastern United States. Co-advised with primary advisor A. Bomblies. Nikolaos Fytilis, (graduated fall 2013), Ph.D. in Civil and Environmental Engineering, Dissertation: Data Classification and Uncertainty Assessment: Development of a New Bayesian Artificial Neural Network with Applications to Stream Health Classification using Multiple Environmental Assessment and Genetic Data. Bree Mathon, (graduated winter 2011), Ph.D. in Civil and Environmental Engineering, Dissertation: Assessing Uncertainty in Modeling Physical Processes Associated with Groundwater and Watershed Problems using Fuzzy Mathematics. Co-advised with G.F. Pinder. Andrea Pearce, (graduated winter 2010), Ph.D. in Civil and Environmental Engineering, Dissertation: Combining Computational and Human Neural Networks: using Modified Self-Organizing Map to Explore Surface and Subsurface Hydrochemical and Biological Datasets. Lance E. Besaw, (graduated fall 2009), Ph.D. in Civil and Environmental Engineering, Dissertation: Advances in Artificial Neural Networks in Surface and Subsurface Hydrological Environmental Engineering Applications. Maeve McBride, (graduated summer 2007), Ph.D. in Civil and Environmental Engineering, Dissertation: Riparian Reforestation and Channel Morphology: Key Driving Mechanisms in Small Streams. Co-advised with W.C. Hession. Paula J. Mouser, (graduated spring 2006), Ph.D. in Civil and Environmental Engineering, Dissertation: Improving Detection and Long-term Monitoring Strategies for Landfill Leachate Contaminated Groundwater with Molecular-Based Microbiological Data using Geostatistics and Artificial Neural Networks. M.S. Students (Graduated) Andrea Elhajj, (graduated winter 2020), M.S. in Civil and Environmental Engineering. Research Project: Monitoring Perioperative Services using 3D Multi-objective Performance Frontiers. Cameron Twombly, (graduated summer 2019), M.S. in Civil & Environmental Engineering. Research Project: Edge of Field Hydrology and Nutrient Fluxes within Northeastern Agroecosystems: Evaluation of Alternative Management Practices and Water Quality Models. Co-advised with primary advisor Joshua Faulkner. Douglas Denu, (graduated winter 2018), M.S. in Computer Science. Research project: Predicting Reach-scale Sediment Regimes to Prioritize Restoration and Conservation. Co-advised with Asim Zia. Viktoria Manukyan, (graduated spring 2018), M.S. in Complex Systems. Research project: Automated Detection of Conversational Pauses from Audio Recordings of Serious Illness Conversations in Natural Hospital Settings. Co-advised with Primary advisor Maggie Eppstein. Baxter Miatke, (graduated fall 2016), M.S. in Civil and Environmental Engineering. Thesis: A Framework for estimating Nutrient and Sediment Load that Leverages the Temporal Variability Embedded in Water Monitoring Data. Matt Brand, (graduated fall 2016), M.S. in Civil and Environmental Engineering. Thesis: A Framework for estimating Nutrient and Sediment Load that Leverages the Temporal Variability Embedded in Water Monitoring Data. Co-advised with Mandar Dewoolkar. Lucas Howard, (graduated spring 2016), M.S. in Civil and Environmental Engineering. Thesis: Leveraging the Information Content of Process-based Models using Differential Evolution and the Extended Kalman Filter. Thomas Bryce, (graduated spring 2016), M.S. in Civil and Environmental Engineering. Research Project: Quantifying streambank erosion through Terrestrial LiDAR and an Unmanned Aircraft System (UAS). Jordan Duffy, (graduated spring 2016), M.S. in Civil and Environmental Engineering. Research Project: Assessing Sediment Activity in Vermont Streams using Geomorphic Data. David Grover, (graduated fall 2014), M.S. in Civil and Environmental Engineering, Thesis: Surface Gas Permeability of Porous Materials: Measurement, Analysis and Applications. Co-advised with M.M. Dewoolkar. Scott Hamshaw, (graduated fall 2013), Ph.D. in Civil and Environmental Engineering, Thesis: Suspended Sediment Prediction using Artificial Neural Networks and Local Hydrometeorological Data. Joseph Krupa, (graduated spring 2013), M.S. in Civil and Environmental Engineering, Thesis: Plug-In Hybrid Vehicle Consumer Survey Analysis. Co-advised with M.J. Eppstein. Alison Pechenick, (graduated spring 2013), M.S. in Civil and Environmental Engineering, Dissertation: A Multi-scale Approach to Assess the Hydrological Connectivity of Road and Stream Networks. Kirk DuBois Jones, (graduated fall 2012), Non-Thesis M.S. in Civil and Environmental Engineering, Report Topic: Determining the Effects of Adsorption Bed Media on Water Quality: Measuring the effects of crushed coral sand, activated carbon, biochar, and steel slag mitigating the impacts of dairy farm runoff on Lake Champlain. Keith Pelletier, (graduated fall 2011) M.S. in School of Natural Resources, Thesis: Use of Remote Sensing to Derive Geomorphic Features Indicative of Stream Stability. Co-advised with Primary Advisor L. Morrissey. Cabot Savidge, (graduated fall 2011) M.S. in School of Engineering, Thesis: Characterization of Porous Building Materials for Agent Transport Prediction using Artificial Neural Networks. Co-advised with Primary Advisor M.M. Dewoolkar. Ryan Butryn, (graduated fall 2010), M.S. in the Rubenstein School of Environment and Natural Resources, Thesis Topic: Summer Stream Temperature as an Indicator of Coldwater Fish Distribution. Co-advised with Primary Advisor D. Parrish. Martin Lee, (graduated spring 2009), M.S. in Civil and Environmental Engineering, Thesis: Pilot-Scale Constructed Wetlands Combined with Phosphorus Removing Slag Filters for Treating Dairy Wastewater. Zhiqiang Li, (graduated spring 2007), M.S. in Civil and Environmental Engineering, Thesis: Applications using the Ordinary and Extended Kalman Filters to Characterize Groundwater Contaminant Sources. Jessica S. Clark, (graduated spring 2006), M.S. in Civil and Environmental Engineering, Thesis: Modeling of Small Streams to Assess Velocity Distribution Influence and Geomorphic Condition on Habitat Indices. Lance E. Besaw, (graduated spring 2006), M.S. in Civil and Environmental Engineering, Thesis: Conditional Simulations using Artificial Neural Networks. Jeffrey J. Doris, (graduated fall 2005), M.S. in Civil and Environmental Engineering, Thesis: Application of Counterpropagation Networks (ANNs) to Problems in Civil Engineering. Charles D. Mark, (graduated fall 2004), M.S. in Civil and Environmental Engineering, Thesis: Predicting Experienced Travel Time for Freeway and Arterial Systems: An Artificial Neural Network Approach. Co-advised with Primary Advisor A. Sadek. Patrick Sullivan, (graduated fall 2000), M.S. in Civil and Environmental Engineering, Thesis: Hierarchical Artificial Neural Networks for Regionalized Co-Kriging. Advised while on an unpaid leave of absence from UVM. Publications (Published or Acce",
  "content_length": 36663,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:47"
}