{
  "name": "Dorian C. Arnold",
  "homepage": "https://cs.emory.edu/~darnold",
  "status": "success",
  "content": "Dorian C. Arnold Home | Research | Publications | Students | Teaching Photo by Kubica & Nguyen Dorian C. Arnold, Ph.D. Associate Professor Department of Math and Computer Science Mathematics and Science Center E418 Emory University dorian.arnold @ emory.edu +1 (404) 727-0560 Research Interests Operating and Distributed Systems ♦ High-Performance Computing ♦ System Software Resilience/Fault-tolerance ♦ HPC Tools Extremely large (aka high-performance) computing systems have become critical instruments in the world's grandest scientific and engineering challenges. Designed, built and managed by computer scientists and engineers, these systems' principal users are experts from other domains. We study the theory and practice of system software that make large, complex computer systems accessible to computer systems non-experts. More specifically, we explore the performance, scalability and reliability issues that abound in large scale computing environments. Career Highlights Ph.D., University of Wisconsin, December 2008. Associate Professor, Emory University, since 2017. Associate Professor, University of New Mexico, 2015-2017. Assistant Professor, University of New Mexico, 2009-2015. ACM Distinguished Speaker ♦ IEEE Senior member ♦ Two R&D 100 Awards (2011 and 1999) ♦ Intel Ph.D. Fellow (2006-2008). Current Professional Activities General Chair, 2017 ACM Richard Tapia Celebration of Diversity in Computing. Chair, Early Career Program, 29th Annual International Conference on High Performance Computing, Networking, Storage and Analysis (SC17) Associate Editor, IEEE Transactions on Parallel and Distributed Systems Co-Chair, Software Track, 46th International Conference on Parallel Processing (ICPP-2017) Founder/Co-Chair, The HPC Pipeline Workshop: Diversifying the HPC Workforce Program Committees: SC17, ISPASS 2017, Resilience 2017 Quick Links Brief Bio CV Opportunities",
  "content_length": 1896,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:45"
}