{
  "name": "Dorit Aharonov",
  "homepage": "http://www.cs.huji.ac.il/~doria",
  "status": "success",
  "content": "Dorit Aharonov Professor, Department of Computer Science and Engineering, Hebrew University, Jerusalem, Israel. Contact Information: E-mail: doria@cs.huji.ac.il Office: Ross Building #72, Givat Ram Office Phone number: 972-2-658-4611 Research: Research Interests: Quantum computational complexity, Quantum algorithms, Quantum cryptographic protocols. The transition from quantum to classical physics. The notion of entanglement, and how it can be better understood via the study of quantum complexity Quantum Hamiltonian complexity and connections to condensed matter physics Connections between quantum computation and various other complexity topics such as Markov chains, lattices, and more. Thesis (Hebrew Univ., 1999) Papers Media Here is a one minute trailer for the movie The Quantum Tamers a documentary movie on quantum information science, 2009 (I am participating for a full 120 seconds I think...) Harnessing Quantum Physics An hour long Canadian TV program about quantum computation filmed in 2009 at the Perimeter Institute, featuring Ignacio Cirac, Daniel Gottesman, Peter Shor, Avi Wigderson, and myself, with Mike Mosca as the host. a Nature article from 2005 in which I appear too. Courses and Seminars Quantum Lunch Seminar Given in the Hebrew University, 2010 Data Structures, Given in the Hebrew University, spring 2010 Data Structures, Given in the Hebrew University, spring 2009 Quantum Computation, Given in the Hebrew University, fall 2008 Quantum Computation, Given in the Hebrew University, fall 2007 Quantum Computation, Given in the Hebrew University, fall 2006 Theory of Computer Science for MSc students Given in the Hebrew University, spring 2005 Quantum Computation, Given in the Hebrew University, fall 2005 Quantum Seminar Given in the Hebrew University, fall 2005 Quantum Computation, Given in the Hebrew University, fall 2004 Theory Reading Seminar Given in the Hebrew University, fall 2004 Data Structures, Given in the Hebrew University, Spring 2003 Quantum Computation, Given in the Hebrew University and in Tel Aviv University, Spring 2001 Markov chains in Theoretical Computer Science, Given in the Hebrew University, Spring 2002 Quantum Lunch Seminar Given in the Hebrew University, Spring 2002 Program and Steering Committees: Quantum Information Processing 2011, Singapore Steering Committee FOCS 2010 program Committee Quantum Information Processing 2010, Zurich Steering Committee Quantum Information Processing 2009, Santa Fe Steering Committee AQIP Kyoto 2007 Program Committee FOCS 2002 Quantum Computation Semester at MSRI, Berkeley, California, 2002, co-organizer Quantum Information Processing 2002, 2003, 2004, program committee Personal Links: I am practicing Kong-Fu since 2004 in The Shambhala Academy for Kong-Fu I wrote this in 2000: Yoga Human rights organizations Art galleries Some Funny stories To see how many people looked at my page after they looked at Nature, I put this counter just for the week starting 6/January/2005. And then it just stayed... Web Counter",
  "content_length": 3028,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:47"
}