{
  "name": "Dorota Glowacka",
  "homepage": "https://researchportal.helsinki.fi/en/persons/dorota-glowacka",
  "status": "success",
  "content": "Dorota Glowacka - University of Helsinki View Scopus Profile Dorota Glowacka Associate professor, Department of Computer ScienceTitle of Docent, Department of Computer ScienceSupervisor for doctoral programme, Doctoral Programme in Computer Science﻿﻿﻿ Phone+358504652956, +358294159605Emaildorota.glowackahelsinkifi PL 68 (Pietari Kalmin katu 5)00014Finland 20102025 Research activity per year Personal profile Fields of Science113 Computer and information sciences Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2010 2013 2014 2015 2017 2019 2021 2022 2024 2025 49 Conference contribution 4 Article 2 Chapter 2 Abstract 7 More 2 Patent 1 Book 1 Paper 1 Poster 1 Conference article 1 Review Article Research output per year Research output per year Disentangling User and Item Sequence Patterns in Sequential Recommendation Data SetsLiu, Y., Medlar, A. J. & Glowacka, D., 7 Sept 2025, RecSys '25: Proceedings of the Nineteenth ACM Conference on Recommender Systems. Association for Computing Machinery, p. 570-574 5 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Open AccessFile Evaluating the Contextual Integrity of False Positives in Algorithmic Travel SurveillanceWernick, A., Medlar, A. J., Söderholm, S. A. E. & Glowacka, D., 23 Jun 2025, FAccT '25: Proceedings of the 2025 ACM Conference on Fairness, Accountability, and Transparency. New York, NY: Association for Computing Machinery, p. 2056-2070 15 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Open AccessFile Paths and Recreation: Inclusive Recommendation of Physical Activities in your NeighbourhoodKotkov, D., Medlar, A. & Glowacka, D., 29 Apr 2025, CHIIR 2025 - Proceedings of the 2025 ACM SIGIR Conference on Human Information Interaction and Retrieval. ASSOCIATION FOR COMPUTING MACHINERY, INC, p. 372-376 5 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Behind the Scenes: Adapting Cinematography and Editing Concepts to Navigation in Virtual RealityMedlar, A., Lehtikari, M. T. & Glowacka, D., 2024, Proceedings Of The 2024 Chi Conference On Human Factors In Computing Sytems (chi 2024). Mueller, F. F., Kyburz, P., Williamson, J. R., Sas, C., Wilson, M. L., Dugas, P. T. & Shklovski, I. (eds.). ASSOC COMPUTING MACHINERY, 12 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Open AccessFile On the Negative Perception of Cross-domain Recommendations and ExplanationsKotkov, D., Medlar, A., Liu, Y. & Glowacka, D., 10 Jul 2024, SIGIR 2024 - Proceedings of the 47th International ACM SIGIR Conference on Research and Development in Information Retrieval. ASSOCIATION FOR COMPUTING MACHINERY, INC, p. 2102-2113 12 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Open AccessFile View all 64 research outputs Projects Projects per year 2023 2023 2024 2 Finished Projects per year Horizon-CL4-2024-HUMAN-01-07Glowacka, D. (Project manager)Uudenmaan liitto01/08/2023 → 14/03/2024Project: Other funder Co-Creation Radar BF 02/2023 - 09/2024Glowacka, D. (Project manager), Rask, M. (Project manager), Holm, T. C. (Participant), Kotkov, D. (Participant), Kropotov, I. (Participant), Medlar, A. (Participant), Shin, B. (Participant) & Tuominen, P. (Participant)Business Finland Oy01/02/2023 → 31/10/2024Project: Business Finland",
  "content_length": 3892,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:50"
}