{
  "name": "Dorothea Blostein",
  "homepage": "http://www.cs.queensu.ca/home/blostein",
  "status": "success",
  "content": "Dorothea Blostein Home Page Dorothea Blostein (née Dorothea Haken) Professor, School of Computing at Queen's University in Kingston, Ontario. Address Dorothea Blostein School of Computing Goodwin Hall 720 Queen's University Kingston, Ontario, Canada K7L 2N8 (613) 533-6537 blostein@queensu.ca Dr. Blostein received computer science degrees from the University of Illinois (B.Sc. in 1978, Ph.D. in 1987) and Carnegie Mellon University (M.Sc. in 1980). Since 1988 she has been a faculty member in the School of Computing at Queen's University. Table of contents Research Biomechanics and Adaptive Tensegrity Graphics Recognition and Document Classification Student Supervision Graduate Theses Supervised Undergraduate Theses and Projects Teaching Biomechanics and Adaptive Tensegrity In a tensegrity structure, isolated components under compression are held in place by components under tension. Tensegrity structures are strong and flexible due to the dynamic interplay of tension and compression forces. Tom Flemons' models of leg, arm, torso, mast demonstrate the ability of relatively simple tensegrity structures to capture complex aspects of force transmission through a human body; for discussion see the websites of Tom Flemons, Graham Scarr, and Steve Levin. My research interests are as follows. Structural homeostasis Adaptive tensegrity structures provide an abstract model of the biological mechanisms that maintain homeostasis of body structure. Simulation of structural homeostasis requires a body model, a model of the demands placed on the body, and a set of homeostatic mechanisms that define how the body changes in response to the demands it experiences; see D. Blostein, Simulation of Abstract Models of Structural Homeostasis, J. Bodywork and Movement Therapies (2016), 20, 373-376. One of my long range goals is to simulate models of injury and healing, such as the one proposed in D. Blostein, Fascial Unwinding Cancels Torsional Forces, Terra Rosa e-Magazine, Dec. 2011. A new form of bioinspired computing: Artificial Fascial Networks Artificial Neural Networks simulate adaptation in the nervous system. Here we propose Artificial Fascial Networks as a new form of bioinspired computing based on simulating adaptation in body structure. Fascia, also called connective tissue, forms a bodywide network that provides structural support, protection, shock absorption and elastic recoil (Fascia Research Society; textbook Fascia: The Tensional Network of The Human Body). Fascial tissues adapt, changing their characteristics in response to experienced loads. This can be simulated as unsupervised learning in a tensegrity structure. The pattern of stiffnesses in a trained Fascial Network forms a distributed memory, analogous to the distributed memory formed by the pattern of connection strengths in a trained Neural Network. Both Neural Networks and Fascial Networks exhibit emergent properties such as global response to local injury. Preliminary investigations of Artificial Fascial Networks are reported in Slava Jdanov's 2014 M.Sc. thesis A Tensegrity Based Structure Optimization Framework. Modular tensegrity construction Modular tensegrity construction methods developed by Tom Flemons are described in Flemons and Blostein, New Approaches to Mechanizing Tensegrity Structures, in Earth and Space 2018: Engineering for Extreme Environments, Eds R. Malla, R. Goldberg, A. Roberts – Proc. 16th Biennial ASCE Aerospace Division International Conference on Engineering, Science, Construction, and Operations in Challenging Environments, April 10-12, 2018, Cleveland, Ohio, pp. 910-922. Sadly, Tom is no longer with us. I created a legacy of his ideas in the Tom Flemons Email Archive. Cytoskeleton simulation We are collaborating with theoretical biologists Richard and Natalie Gordon on cytoskeleton simulation. One goal is to simulate the Gordons' model of embryogensis, summarized in The organelle of differentiation in embryos: the cell state splitter, Theoretical Biology and Medical Modeling 2016. Concussions and fascia A long range goal is to contribute to concussion research, with particular focus on modeling injury and healing of dura mater. A first concussion-related study is reported here. Xingcheng Cai, Dorothea Blostein, Fraser W. Saunders, A Shape-Based Helmet Fitting System for Concussion Protection, Proc. 37th Int'l Conf. IEEE Engineering in Medicine and Biology Society (EMBC 2015), Milan, Italy, pp. 4615-4618, Aug 25-29, 2015. My students have worked on three software platforms -- the NASA Tensegrity Robotics Toolkit, PushMePullMe, and ArtiSynth -- in order to create simulations necessary for this research. Extensions to the NASA Tensegrity Robotics Toolkit (NTRT) The NASA Tensegrity Robotics Toolkit, released in June 2014, is open source software for the modeling, simulation, and control of Tensegrity Robots. This 2013 video explains the advantages of tensegrity for space robots: tensegrity structures are strong, lightweight, compliant, and can be folded flat for transport. Machine learning is used to find actuator control schemes that make the robot move in desired ways, as illustrated by gait 1 and gait 2 discovered for a tensegrity spine. Structure Building and Learning Framework Extensions CISC498 project by Jonah Eisen, Simon Kotwicz, Leif Raptis-Firth, 2015-2016 Customer: Vytas Sunspiral, Intelligent Robotics Group, NASA Ames Research Center. Poster displayed at Creative Computing, March 2016. Jonah, Simon and Leif created a YAML representation for conveniently and compactly defining tensegrity structures in NTRT. They contributed code for combining tensegrity substructures via face-to-face bonding. Finally, they designed and began implementation of a general three-level learning framework for NTRT. (1) Parameter Learning finds a set of parameter values -- such as resting length and stiffness of cables; lengths of struts -- that enable the tensegrity structure to perform well under the given fitness function. (2) Structure Learning finds a way to change the topology of a tensegrity structure -- remove or insert a strut/cable; attach a new substructure -- so that the structure performs well under the given fitness function. (3) Control Learning selects actuator locations and finds a control algorithm that allows this actuated tensegrity structure to perform well under the given fitness function. Distribution of Machine Learning Trials and User Interface Improvements CISC499 project by Perry Bhandal, winter 2015 Poster displayed at Creative Computing, March 2015. Perry contributed the following NTRT extensions as a Queen's student (CISC499 and an NSERC USRA research term) and continuing as an open source contributor after leaving Queen's. (1) Perry separated the core simulation library from developers' individual projects. (2) He added tools for distributing machine learning trials across multiple systems. (3) Perry is working on creating an improved user interface using Panda3D instead of Bullet as the scene engine. (4) He is working on a web version of NTRT using Emscripten. PushMePullMe by Gennaro Senatore These two videos illustrate some of the capabilities of this software: cable nets and finding equilibrium for tensegrity structures. ArtiSynth is a public domain Java toolkit for 3D biomechanical modeling combining multibody and finite element simulation. Creating tensegrity structures in ArtiSynth CISC499 project by Michael Wang, winter 2016 Poster displayed at Creative Computing, March 2016. Tensegrity Model of a Centipede Leg CISC499 project by Niyousha Saeidi, winter 2020 We are collaborating with Emily Standen on creating a tensegrity model of the centipede leg, building on her recent publication Decoding the essential interplay between central and peripheral control in adaptive locomotion of amphibious centipedes. Centipede leg motion likely is done with agonist muscles only; elastic recoil moves the leg back to the starting position. Graphics Recognition and Document Classification I have a long-standing research program in pattern recognition, document analysis, and document classification. The main research goal is to smooth the interface between paper and electronic versions of documents. My students and I have worked on developing computer technology to read, write, and edit diagram notations such as music notation, math notation, maps, schematics, and architectural drawings. The text portions of scanned documents can be analyzed with OCR (Optical Character Recognition), but further processing is required to extract the information contained in diagram notations. My students and I investigate the use of techniques such as graph transformation and tree transformation, in order to construct an interpretation of the 2D arrangement of symbols in a diagram. Other research topics include document classification (applied to biomedical documents and software engineering documents), the use of internet searches to validate document recognition results, and the relationship between diagram generation and diagram recognition. I coauthored the Lime Music Notation Software. Both Macintosh and IBM PC versions are available for free trial use. I was a plenary speaker at the second Conference on Intelligent Computer Mathematics (CICM 2009) and Chair of GREC2001, the Fourth IAPR International Workshop on Graphics Recognition, Kingston, Ontario, in September, 2001. Classification and Mining of Software Engineering Documents Stephen Thomas, Meiyappan Nagappan, Dorothea Blostein and Ahmed E. Hassan \"The Impact of Classifier Configuration and Classifier Combination on Bug Localization,\" IEEE Transactions on Software Engineering, Vol. 39, No. 10, pp. 1427-1443, Oct. 2013. Stephen Thomas, Bram Adams, Ahmed E. Hassan and Dorothea Blostein, \"Studying Software Evolution Using Topic Models,\" Science of Computer Programming, Elsevier, Vol. 80, Part B, pp. 457-479, Feb. 2014. Stephen Thomas, Hadi Hemmati, Ahmed E. Hassan Dorothea Blostein, \"Stati",
  "content_length": 29219,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:51"
}