{
  "name": "Douglas J. Leith",
  "homepage": "https://www.scss.tcd.ie/Doug.Leith",
  "status": "success",
  "content": "Doug Leith Prof Doug Leith School of Computer Science & Statistics Home      People      Research      Publications     Contact Professor Douglas Leith Chair of Computer Systems doug.leith@tcd.ie Tel. +353 (0)1 8961534 School of Computer Science and Statistics Room 102, Lloyd Institute, Trinity College Dublin 2, Ireland News New report: Cookies, Identifiers and Other Data That Google Silently Stores on Android Handsets, Feb 2025. The measurement data and software used is available at https://github.com/doug-leith/cookies-etc-stored-by-google-android. Privacy of Google Android and Apple iPhones: Originally motivated by my investigation of the privacy of Covid contact tracing apps, I have done quite a bit of work documenting the data that Android phones send to Google (specifically, that Google Play Services, which is present on almost all Android phones sends to Google) and the privacy concerns that it raises. I have also looked at the data iPhones transmit to Apple. See Android and Iphone privacy project page for details. Web Browser Privacy: Web Browser Privacy: What Do Browsers Say When They Phone Home? (24th Feb 2020, updated 19th March 2020, now published in IEEE Access). This made a bit of a splash in the media, and on the front page of Hacker News for three weeks. TO DO: repeat this study to see what (if anything) has changed. Covid-19 Contact Tracing Apps: Together with Stephen Farrell I did quite a bit of work on the privacy and efficacy of contact tracing apps. In summary: There are good reasons to doubt whether Bluetooth can be used for accurate proximity detection, see Coronavirus Contact Tracing: Evaluating The Potential Of Using Bluetooth Received Signal Strength For Proximity Detection On Android handsets the European covid contact tracing apps consist of two components: (i) the Google/Apple Exposure Notification service which is part of Google Play Services, (ii) an app which provides the user interface, communicates with health authority servers etc. The app is mostly open source and well behaved from a privacy point of view, while Google Play Services is closed-source, proprietary. Google Play Services raises many privacy concerns, and I've continued to look into its behaviour. Current Research Online Privacy I'm interested in practical technologies for enhancing people's privacy when using online services. I've done quite a bit of work on the privacy of Android and iPhones, and I continue to work on that. Current projects include more effective methods for text privacy, an area which has largely been ignored to date (other than simple redaction of names etc). Older work includes methods for privacy verification e.g in online search, private recommender systems, traffic analysis attacks and defences for encrypted packet streams and mathematical frameworks for privacy e.g. differential privacy. Predictive Analytics & Decision Making Under Uncertainty I'm currently working on methods for online learning in recommender systems. These are akin to reinforcement learning, but with a bigger \"planning\" component. Using Monte Carlo Tree Search we obtained state of the art user cold start performance, and are now using transformer neural networks for user and item cold start. Older work includes the links between decision problems and convex optimisation, privacy-enhanced algorithms, and fully decentralised (no message-passing) algorithms for constraint satisfaction, which we have applied to collision-free scheduling, scrambling code allocation and channel allocation in wireless networks. Also a good deal of work on distributed algorithms for optimal resource allocaton in wireless networks. Past Research See my old research page. Until fairly recently, I worked on WiFi and mixed LTE/WiFi networks, but I don't do much on this now. Similarly, I worked quite a bit on congestion control, multi-path TCP and using FEC within TCP and while I still think these are challenging topics that need more work I'm not actively working on them just now. A long time ago, in the 1990s I worked on nonlinear control theory and on control of wind turbines. That's ancient history now, but one of the things I'm quite proud of is that 20 years later this work is still being regularly cited. Papers Online publications Google Scholar, Orcid and ResearcherId (We're all measured nowadays ...). Useful little tool for parsing citation text. Current Awards Scalable, Privacy-Enhanced Analytics for the Sharing Economy (co-PI with Robert Shorten, Science Foundation Ireland grant € 1.8M, 2018-2025). Past Awards Royal Society Research Fellowship, 1995-2005 An Investigation of the Benefits of Nonlinear Control for Variable Speed Wind Turbines (EPSRC Grant no. GR/L/36659, co-PI with W.E.Leithead, UK£114,000, 1997-2000). MAC - Multi-Agent Control: Probabilistic reasoning, optimal co-ordination, stability analysis and controller design for intelligent hybrid systems. A four year Research Training Network within the European Commission's 5th Framework (EU HPRN-CT-1999-00107, PI on € 200k share of overall € 1.2M grant, 2000-2004). )Off-equilibrium: A new paradigm for divide & conquer identification of nonlinear systems (PI, UK EPSRC grant GR/R15863, £ 310000, 2001-2004) SFI Principal Investigator (co-PI with Robert Shorten, Science Foundation Ireland grant 00/PI.1/C067, € 7.5M, 2001-2007) CEmACS: Complex Embedded Automotive Control Systems (with Robert Shorten as PI, EU STREP Project, €220k, 2004-2007). Resource allocation in WLAN's (PI, Science Foundation Ireland grant 03/IN3/I396, € 1.9M 2004-2008. Lead partner in € 5.9M Investigator cluster with University of Limerick, Dublin Institute of Technology and Intel Ireland.) FutureComm (PRLTI grant with WIT, co-PI with David Malone on € 699K share of € 3.2M overall grant, 2007-2010) Network Mathematics (PRLTI grant € 1.5M share of € 2.2M HI structural grant joint with CTVR at Trinity College Dublin, 2007-2010) Next Generation Communication Networks (co-PI with Robert Shorten, Science Foundation Ireland grant € 4.1M, 2007-2011). Flexible Architecture for Virtualizable future wireless Internet Access (FLAVIA), EU STREP project (co-PI with David Malone, project co-ordinated by University of Rome Tor Vergata, 2010-2013). FAME (SFI-funded Strategic Research Cluster involving TSSG, TCD, UCD, UCC and the Hamilton Institute, co-PI with David Malone, 2009-2014). Telecommunications Graduate Initiative, HEA PRLTI Cycle 5 funding for extending the Network Maths (co-PI, TGI is co-ordinated by Trinity College Dublin, 2011-2015) Green Transport and Communication Networks (co-PI with Robert Shorten, Science Foundation Ireland grant € 3M, 2012-2017). CONNECT Centre for Future Networks (co-Applicant, Science Foundation Ireland centre co-ordinated by TCD, 2015-2021) I-Form Advanced Manufacturing Research Centre (funded investigator, Science Foundation Ireland centre co-ordinated by UCD 2017-2023) Teaching CS7CS4/CSU44061 Machine Learning CS7DS2 Optimisation For Machine Learning Old: STU33009 Statistical Methods for Computer Science And some links for students ... Alun Bundy's Advice for research students Hamming's advice on research. How to write a great paper and give a great talk about it by Simon Peyton-Jones The Scientific Virtues",
  "content_length": 7265,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:56"
}