{
  "name": "Douglas W. Cunningham",
  "homepage": "https://www.b-tu.de/fg-graphische-systeme/team/professor",
  "status": "success",
  "content": "Professor - Lehrstuhl Graphische Systeme - BTU Cottbus-Senftenberg × Zielgruppen Schulen & Lehrkräfte Studieninteressierte Internationale Studieninteressierte Studierende Alumni Beschäftigte Stifter & Förderer Presse Querverweise Stellenangebote Lehrangebote eLearning Bibliothek IT-Services Campuspläne Mensapläne Webmail Douglas W. Cunningham Prof. Dr. Douglas W. Cunningham Verfügungsgebäude 1C, Raum 1.27T: +49 (0) 355 69 3816 F: +49 (0) 355 69 3830 Werdegang1988 - 1992: Bachelor of Science in der Psychologie. University of Washington (Seattle, WA, USA)1992 - 1993: Master of Science in Experimenteller Psychologie. University of Georgia (Athens, GA, USA). Masterarbeit: \"Spatiotemporal stereopsis: The use of Spatiotemporal Boundary Formation edges in binocularity\" 1993 - 1997: Ph.D. in der Kognitionspsychologie. Temple University (Philadelphia, PA, USA). Dissertationschrift: \" The influence of static shape information on Spatiotemporal Boundary Formation\"1997 - 1999: Wissenschaflticher Mitarbeiter.  Logicon Technical Services, Inc. (US Air Force Research Laboratory, OH, USA 1999 - 2006: Wissenschaflticher Mitarbeiter / Projektleiter EU Projekt. Max-Planck-Institut für biologische Kybernetik (Tübingen, Deutschland)2006-2009: Wissenschaflticher Mitarbeiter Universität Tübingen (Tübingen, Deutschland)Ende 2007: Habilitation in der Kognitionswissenschaft. Universität Tübingen (Tübingen, Deutschland). Habilitationschrift: \"Perceptual Graphics\"2009: Wissenschaflticher Mitarbeiter.  Max-Planck-Institut für biologische Kybernetik (Tübingen, Deutschland)2009 - 2011: Gastprofessor an BTU Cottbus - Senftenberg (Cottbus, Deutschland) 2011: Übernahme W3-Lehrstuhl an BTU Cottbus - Senftenberg (Cottbus, Deutschland) Prof. Dr. Douglas W. Cunningham BTU Cottbus-Senftenberg Konrad-Wachsmann-Allee 5 03046 Cottbus Verfügungsgebäude 1C, R. 1.27T  +49 (0) 355 69 3816 F  +49 (0) 355 69 3830douglas.cunningham(at)b-tu.deSprechzeiten Wintersemester 2024/25 Mittwochs 11 - 12 Uhr Fachgebiet Graphische Systeme Logo Hinweis zu Cookies Unsere Webseite verwendet Cookies. Diese haben zwei Funktionen: Zum einen sind sie erforderlich für die grundlegende Funktionalität unserer Website. Zum anderen können wir mit Hilfe der Cookies unsere Inhalte für Sie immer weiter verbessern. Hierzu werden pseudonymisierte Daten von Website-Besuchern gesammelt und ausgewertet. Das Einverständnis in die Verwendung der technisch nicht notwendigen Cookies können Sie jeder Zeit wiederrufen. Weitere Informationen erhalten Sie auf unseren Seiten zum Datenschutz. Einstellungen [TODO] Erforderlich Diese Cookies werden für eine reibungslose Funktion unserer Website benötigt. [TODO] Statistik Für den Zweck der Statistik betreiben wir die Plattform Matomo, auf der mittels pseudonymisierter Daten von Websitenutzern der Nutzerfluss analysiert und beurteilt werden kann. Dies gibt uns die Möglichkeit Websiteinhalte zu optimieren. NameZweckAblaufTypAnbieter _pk_id Wird verwendet, um ein paar Details über den Benutzer wie die eindeutige Besucher-ID zu speichern. 13 Monate HTML Matomo _pk_ref Wird benutzt, um die Informationen der Herkunftswebsite des Benutzers zu speichern. 6 Monate HTML Matomo _pk_ses Kurzzeitiges Cookie, um vorübergehende Daten des Besuchs zu speichern. 30 Minuten HTML Matomo Erforderliche Cookies akzeptieren Alle Cookies akzeptieren Einstellungen speichern ×",
  "content_length": 3370,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:00"
}