{
  "name": "Doug L. James",
  "homepage": "https://profiles.stanford.edu/doug-james",
  "status": "success",
  "content": "Doug James' Profile | Stanford Profiles Doug James LeRa Professor and Professor, by courtesy, of Music Computer Science Print Profile Email Profile View Stanford-only Profile Tab Menu Bio Research & Scholarship Teaching Publications Bio Doug L. James is the LeRa Professor of Computer Science at Stanford University (since June 2015), and a Professor, by courtesy, of Music. He is a member of Stanford's Center for Computer Research in Music and Acoustics (CCRMA) and the Institute for Computational and Mathematical Engineering (ICME). He holds three degrees in applied mathematics, including a Ph.D. in 2001 from the University of British Columbia. In 2002 he joined the School of Computer Science at Carnegie Mellon University as an Assistant Professor, and later became an Associate Professor of Computer Science at Cornell University (2006-2015). His research interests include computer graphics, computer sound, physically based modeling and animation, and reduced-order physics models. Doug is a recipient of a National Science Foundation CAREER award, and a fellow of both the Alfred P. Sloan Foundation and the Guggenheim Foundation. He received the ACM SIGGRAPH 2021 Computer Graphics Achievement Award, a 2012 Technical Achievement Award from The Academy of Motion Picture Arts and Sciences for \"Wavelet Turbulence,\" and the 2013 Katayanagi Emerging Leadership Prize from Carnegie Mellon University and Tokyo University of Technology. He was the Technical Papers Program Chair of ACM SIGGRAPH 2015, and a consulting Senior Research Scientist at Pixar Animation Studios from 2015-2020. Since 2022 he has been a consulting Senior Research Scientist at NVIDIA. Academic Appointments Professor, Computer Science Professor (By courtesy), Music Member, Bio-X Member, Wu Tsai Human Performance Alliance Member, Institute for Computational and Mathematical Engineering (ICME) Administrative Appointments Full Professor, Computer Science, Stanford University (2015 - Present) Affiliated Faculty Member, Center for Computer Research in Music and Acoustics (CCRMA), Stanford University (2015 - Present) Affiliated Faculty Member, Institute for Computational and Mathematical Engineering (ICME), Stanford University (2015 - Present) Consulting Senior Research Scientist, Pixar Animation Studios (2015 - 2020) Associate Professor, Computer Science, Cornell University (2006 - 2015) Assistant Professor, Robotics Institute, and Computer Science Department, Carnegie Mellon University (2002 - 2006) Honors & Awards Computer Graphics Achievement Award, ACM SIGGRAPH (2021) Katayanagi Emerging Leadership Prize, Carnegie Mellon University and Tokyo University of Technology (2013) Technical Achievement Award for Wavelet Turbulence, The Academy of Motion Picture Arts and Sciences (2013) Research Fellow, John Simon Guggenheim Memorial Foundation (2011) College of Engineering Excellence in Teaching (Douglas Whitney `61 Award), Cornell University (2008) Research Fellow, Alfred P. Sloan Foundation (2006) \"Brilliant 10\" young scientist, Popular Science magazine (2005) CAREER Award, National Science Foundation (2004) Boards, Advisory Committees, Professional Organizations Chair, Technical Papers Program, ACM SIGGRAPH (2015 - 2015) Associate Editor, ACM Transactions on Graphics (2005 - 2017) Professional Education PhD, University of British Columbia, Applied Mathematics (2001) MSc, University of British Columbia, Applied Mathematics (1997) BSc, University of Western Ontario, Applied Mathematics (1995) Patents Doug Leonard James, Jui-Hsien Wang. \"United States Patent WO2020243517A1 Systems and methods for acoustic simulation\", Leland Stanford Junior University, Dec 3, 2020 Fernando Ferrari de Goes, Douglas L. James. \"United States Patent US10586401B2 Sculpting brushes based on solutions of elasticity\", Pixar, Mar 10, 2020 Contact Academic djames@cs.stanford.edu University - Faculty Department: Computer Science Position: Professor 389 JANE STANFORD WAY Computing and Data Science (CoDA), Room E352 Stanford University STANFORD, California 94305 (650) 723-0104 (office) Administrative Contact Malwana Adalat madalat@stanford.edu 650-725-4385 (office) Additional Info Mail Code: 9035 Profile: https://profiles.stanford.edu/doug-james ORCID: https://orcid.org/0000-0003-3532-8383 Links My Website Current Research and Scholarly Interests Computer graphics & animation, physics-based sound synthesis, computational physics, haptics, reduced-order modeling Projects Sound Rendering for Physically Based Animation Location US For More Information: http://www.cs.cornell.edu/projects/sound/ 2025-26 Courses Computer Graphics: Animation and SimulationCS 348C (Win) Fundamentals of Computer Graphics: Animation and SimulationCS 248B (Aut) Great Ideas in GraphicsCS 44N (Aut) Physically Based Animation and SoundCS 448Z (Spr) Independent Studies (17) Advanced Reading and ResearchCS 499 (Aut, Win, Spr) Advanced Reading and ResearchCS 499P (Aut, Win, Spr) Curricular Practical TrainingCME 390 (Aut, Win, Spr) Curricular Practical TrainingCS 390A (Aut, Win, Spr) Curricular Practical TrainingCS 390B (Aut, Win, Spr) Curricular Practical TrainingCS 390C (Aut, Win, Spr) Independent ProjectCS 399 (Aut, Win, Spr) Independent ProjectCS 399P (Aut, Win, Spr) Independent WorkCS 199 (Aut, Win, Spr) Independent WorkCS 199P (Aut, Win, Spr) MA/MST Capstone ProjectMUSIC 298 (Aut, Win, Spr) Part-time Curricular Practical TrainingCS 390D (Aut, Win, Spr) Ph.D. ResearchCME 400 (Aut, Win, Spr) Ph.D. Research RotationCME 391 (Aut, Win, Spr) Research in Computer-Generated MusicMUSIC 220D (Aut, Win, Spr) Senior ProjectCS 191 (Aut, Win, Spr) Writing Intensive Senior Research ProjectCS 191W (Aut, Win, Spr) Prior Year Courses 2024-25 Courses Computer Graphics: Animation and SimulationCS 348C (Win) Fundamentals of Computer Graphics: Animation and SimulationCS 248B (Aut) Great Ideas in GraphicsCS 44N (Aut) 2023-24 Courses Computer Graphics: Animation and SimulationCS 348C (Win) Fundamentals of Computer Graphics: Animation and SimulationCS 248B (Aut) Great Ideas in GraphicsCS 44N (Aut) 2022-23 Courses Computer Graphics: Animation and SimulationCS 348C (Win) Fundamentals of Computer Graphics: Animation and SimulationCS 248B (Aut) Great Ideas in GraphicsCS 44N (Aut) Stanford Advisees Master's Program Advisor Ethan Buck, Jimmy Chen, Paprika Chen, Ruiting Chen, Isaac Criddle, Frank D'Agostino, Aayush Gupta, Nate Hill, Aaron Huber, Alex Liu, Andrew Nordhagen, Renee Qin, Luc Rosenzweig, Lanruo Xie, Tae Hoon Yang, Jerry Yuan, Shutong Zhang Doctoral Dissertation Co-Advisor (AC) Bohan Li Doctoral (Program) Zhehao Li, Kangrui Xue, Eris Zhang All Publications Progressive Dynamics plus plus : A Framework for Stable, Continuous, and Consistent Animation Across Resolution and Time ACM TRANSACTIONS ON GRAPHICS Zhang, J., James, D. L., Kaufman, D. M. 2025; 44 (4) View details for DOI 10.1145/3731202 View details for Web of Science ID 001544002600001 Deforming Patient-Specific Models of Vascular Anatomies to Represent Stent Implantation via Extended Position Based Dynamics. Cardiovascular engineering and technology Pham, J., Kong, F., James, D. L., Feinstein, J. A., Marsden, A. L. 2024 Abstract Angioplasty with stent placement is a widely used treatment strategy for patients with stenotic blood vessels. However, it is often challenging to predict the outcomes of this procedure for individual patients. Image-based computational fluid dynamics (CFD) is a powerful technique for making these predictions. To perform CFD analysis of a stented vessel, a virtual model of the vessel must first be created. This model is typically made by manipulating two-dimensional contours of the vessel in its pre-stent state to reflect its post-stent shape. However, improper contour-editing can cause invalid geometric artifacts in the resulting mesh that then distort the subsequent CFD predictions. To address this limitation, we have developed a novel shape-editing method that deforms surface meshes of stenosed vessels to create stented models.Our method uses physics-based simulations via Extended Position Based Dynamics to guide these deformations. We embed an inflating stent inside a vessel and apply collision-generated forces to deform the vessel and expand its cross-section.We demonstrate that this technique is feasible and applicable for a wide range of vascular anatomies, while yielding clinically compatible results. We also illustrate the ability to parametrically vary the stented shape and create models allowing CFD analyses.Our stenting method will help clinicians predict the hemodynamic results of stenting interventions and adapt treatments to achieve target outcomes for patients. It will also enable generation of synthetic data for data-intensive applications, such as machine learning, to support cardiovascular research endeavors. View details for DOI 10.1007/s13239-024-00752-z View details for PubMedID 39354259 View details for PubMedCentralID 1860348 Progressive Dynamics for Cloth and Shell Animation ACM TRANSACTIONS ON GRAPHICS Zhang, J., James, D. L., Kaufman, D. M. 2024; 43 (4) View details for DOI 10.1145/3658214 View details for Web of Science ID 001289270900071 Virtual shape-editing of patient-specific vascular models using Regularized Kelvinlets. IEEE transactions on bio-medical engineering Pham, J., Kong, F., James, D. L., Marsden, A. L. 2024; PP Abstract OBJECTIVE: Cardiovascular diseases, and the interventions performed to treat them, can lead to changes in the shape of patient vasculatures and their hemodynamics. Computational modeling and simulations of patient-specific vascular networks are increasingly used to quantify these hemodynamic changes, but they require modifying the shapes of the models. Existing methods to modify these shapes include editing 2D lumen contours prescribed along vessel centerlines and deforming meshes with geometry-based approaches. However, these methods can require extensive by-hand prescription of the desired shapes and",
  "content_length": 29386,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:51"
}