{
  "name": "Douglas Troeger",
  "homepage": "https://www.ccny.cuny.edu/profiles/douglas-troeger",
  "status": "success",
  "content": "Douglas Troeger | The City College of New York Skip to main content > Home / Faculty and Staff Profiles / Douglas Troeger Douglas Troeger Professor Main Affiliation Computer Science Additional Departments/Affiliated Programs Computer Engineering Building North Academic Center Office 7/116 Phone 212-650-6167 Fax 212-650-6248 Email dtroeger@ccny.cuny.edu Douglas Troeger Profile Visit Website Education A.B. (Philosophy) Brown University Sc.B. (Chemistry) Brown University M.S. (Mathematics) Stevens Institute of Technology Ph.D. (Mathematics) Stevens Institute of Technology Courses Taught CSc 33500 : Programming Language Paradigms Research Interests Computational Group Theory and Symbolic Computation, Functional Programming, Semantics of Programming Languages. Publications Challenge Response Password Security Using Combinatorial Group Theory, to appear in Groups, Complexity and Cryptology (with G. Baumslag, Y. Bryukhov, and B. Fine). Virtual Properties of Cyclically Pinched One-Relator Groups, International Journal of Algebra and Computation, Vol. 19 No. 2, pp 213 - 227, 2009 (with G. Baumslag, B. Fine and C. F. Miller). Virtually Free-by-Cyclic One-Relator Groups I., Aspects of Infinite Groups, Algebra and Discrete Mathematics, Volume 1, World Scientific, B. Fine, G. Rosenberger and D. Spellman, eds., pp.9-25, 2008 (with G. Baumslag). Reflections on the Residual Finiteness of One-Relator Groups, Groups, Geometry and Dynamics, Vol.1 No. 3, pp. 209-219, 2007 (with G. Baumslag and C. F. Miller) Additional Information Professional Experience Prior to joining City College, I had faculty appointments at Stevens Institute of Technology and Syracuse University. Prior to that I worked in industry, as a chemist in the Chemical Physics Division of Allied Chemical Corporation. Current Professional Affiliations Association for Computing Machinery, European Association for Theoretical Computer Science",
  "content_length": 1916,
  "method": "requests",
  "crawl_time": "2025-12-01 13:03:58"
}