{
  "name": "Dragan Gasevic",
  "homepage": "https://research.monash.edu/en/persons/dragan-gasevic",
  "status": "success",
  "content": "Dragan Gasevic - Monash University X    View Scopus Profile Dragan Gasevic Professor Professor, Department of Data Science & AI https://orcid.org/0000-0001-9265-1908 EmailDragan.Gasevicmonashedu Accepting PhD StudentsPhD projectshttps://supervisorconnect.it.monash.edu/ 20032026 Research activity per year Personal profile BiographyDragan Gašević is Distinguished Professor of Learning Analytics in the Faculty of Information Technology and the Director of the Centre for Learning Analytics (CoLAM) at Monash University. His research interests center around data analytic, AI, and design methods that can advance understanding of self-regulated and collaborative learning. Previously, he was a Professor and the Sir Tim O’Shea Chair in Learning Analytics and Informatics (Feb 2015–Feb 2018) in the Moray House School of Education and the School of Informatics and Co-Director of Centre for Research in Digital Education at the University of Edinburgh. He was the Canada Research Chair in Semantic and Learning Technologies and Professor in the School of Computing and Information Systems at Athabasca University (Jan 2007–Jan 2015). He is a founder and served as the President (2015–2017) of the Society for Learning Analytics Research (SoLAR), the world’s leading research and professional organization in learning analytics. He has held several honorary professorships and industry fellowships in Asia, Australia, Europe and North America. He served as a founding program chair of the International Conference on Learning Analytics & Knowledge (LAK) in 2011 and 2012, the general chair in 2016, a founding program co-chair of the Learning Analytics Summer Institute (LASI) in 2013 and 2014, and a founding editor of the Journal of Learning Analytics (2012–2017) and Computers & Education: Artificial Intelligence (2020–present). In 2019–2023, he was recognized as the national field leader in educational technology in The Australian – the only Australian daily newspaper distributed nationally. He led the EU-funded SHEILA project that received the Best Research Project of the Year Award (2019) from the Association for Learning Technology. In 2022, he received the Lifetime Member Award, the highest distinction of the Society for Learning Analytics Research (SoLAR) and named a Distinguished Member of the Association for Computing Machinery (ACM), the world’s largest computing society.Supervision interestsComputational techniques and methods in learning analytics. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Doctor of Philosophy, University of BelgradeAward Date: 3 Feb 2005Computer Science, Master of Science (Computer Science), University of BelgradeAward Date: 17 Dec 2002Computer Science, Diplom Ingenieur in Computer Science, University of BelgradeAward Date: 29 Sept 2000 Research area keywordslearning analyticseducational data miningdata scienceself-regulated learningcollaborative learning Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2018 2021 2022 2027 1 Not started 4 Active 11 Finished Projects per year An Assessment Framework: An Assessment Framework: Assessments for writing with generative artificial intelligenceGasevic, D. (Primary Chief Investigator (PCI)), Swiecki, Z. (Chief Investigator (CI)), Tsai, Y.-S. (Chief Investigator (CI)), Rong, J. (Chief Investigator (CI)), Rakovic, M. (Chief Investigator (CI)), Nagtzaam, G. (Chief Investigator (CI)), Jovanović, J. (Partner Investigator (PI)) & Järvelä, S. (Partner Investigator (PI))1/08/24 → 31/07/27Project: Research HARNESS: Hierarchical Abstractions and Reasoning for Neuro-Symbolic SystemsRezatofighi, H. (Primary Chief Investigator (PCI)), Garcia De La Banda Garcia, M. (Chief Investigator (CI)), Li, Y.-F. (Chief Investigator (CI)), Stuckey, P. (Chief Investigator (CI)), Gasevic, D. (Chief Investigator (CI)), Gutierrez, J. (Chief Investigator (CI)), Qu, L. (Chief Investigator (CI)), Ignatiev , A. (Chief Investigator (CI)), Swiecki, Z. (Chief Investigator (CI)), Vered, M. (Chief Investigator (CI)), Chen, G. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)) & Say, B. (Chief Investigator (CI))20/06/23 → 20/02/27Project: Research Data analytics-based tools and methods to enhance self-regulated learningGasevic, D. (Primary Chief Investigator (PCI)), Dawson, S. (Chief Investigator (CI)), Sheard, J. (Chief Investigator (CI)), Mirriahi, N. (Chief Investigator (CI)), Martinez-Maldonado, R. (Chief Investigator (CI)), Khosravi, H. (Chief Investigator (CI)), Chen, G. (Chief Investigator (CI)) & Winne, P. H. (Partner Investigator (PI))1/08/22 → 31/03/26Project: Research CELLA 2 CERES: CELLA 2 CERES: Connecting the Center for Learning and Living with Artificial Intelligence to CERESJärvelä, S. (Primary Chief Investigator (PCI)), Molenaar, I. (Chief Investigator (CI)), Bannert, M. (Chief Investigator (CI)), Gasevic, D. (Chief Investigator (CI)), Azevedo, R. (Chief Investigator (CI)), Martinez-Maldonado, R. (Associate Investigator (AI)), Tsai, Y.-S. (Associate Investigator (AI)), Swiecki, Z. (Associate Investigator (AI)) & Chen, G. (Associate Investigator (AI))Jacobs Foundation17/12/21 → 31/12/26Project: Research A trustworthy blockchain-based credentialing systemLiu, J. (Primary Chief Investigator (PCI)), Yu, J. (Chief Investigator (CI)) & Gasevic, D. (Chief Investigator (CI))Project: Research View all 16 projects Research output Research output per year 2003 2009 2011 2015 2016 2017 2019 2020 2021 2022 2023 2024 2025 2026 354 Conference Paper 272 Article 31 Chapter (Book) 29 Editorial 47 More 15 Review Article 9 Foreword / Postscript 8 Other Report 4 Book 3 Edited Book 2 Commissioned Report 2 Poster 2 Comment / Debate 1 Paper 1 Working Paper Research output per year Research output per year Towards reliable generative AI-driven scaffolding: Reducing hallucinations and enhancing quality in self-regulated learning supportQian, K., Liu, S., Li, T., Raković, M., Li, X., Guan, R., Molenaar, I., Nawaz, S., Swiecki, Z., Yan, L. & Gašević, D., Jan 2026, In: Computers and Education. 240, 19 p., 105448.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) A Critical Review of Using Learning Analytics for Formative Assessment: Progress, Pitfalls and Path ForwardBanihashem, S. K., Gašević, D. & Noroozi, O., Jun 2025, In: Journal of Computer Assisted Learning. 41, 3, 9 p., e70056.Research output: Contribution to journal › Article › Research › peer-review 4 Citations (Scopus) A learning analytics dashboard to support students' reflection on collaborationEcheverria, V., Nieto, G. F., Zhao, L., Palominos, E., Srivastava, N., Gašević, D., Pammer-Schindler, V. & Martinez-Maldonado, R., Feb 2025, In: Journal of Computer Assisted Learning. 41, 1, 21 p., e13088.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) Aligning and comparing values of ChatGPT and human as learning facilitators: A value-sensitive design approachShen, Y., Tang, L., Le, H., Tan, S., Zhao, Y., Shen, K., Li, X., Juelich, T., Wang, Q., Gašević, D. & Fan, Y., Jul 2025, In: British Journal of Educational Technology. 56, 4, p. 1391-1414 24 p.Research output: Contribution to journal › Article › Research › peer-review 10 Citations (Scopus) Analytics of Learner-Centered Feedback: A Large-Scale Case Study in Higher EducationAldino, A. A., Tsai, Y. S., Gupte, S., Henderson, M., Nath, D., Gašević, D. & Chen, G., Nov 2025, In: Computers and Education. 237, 105360.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile View all 733 research outputs Prizes Best full paper nominationEcheverria, V. (Recipient), Martinez-Maldonado, R. (Recipient), Alfredo, R. (Recipient), Zhao, M. (Recipient), Yan, L. (Recipient), Gasevic, D. (Recipient), Osbrone, A. (Recipient), Dix, S. (Recipient), Wotherspoon, R. (Recipient) & Jaggard, H. (Recipient), Mar 2024Prize: Other distinction Best full research paper award Yan, L. (Recipient), Martinez-Maldonado, R. (Recipient), Zhao, M. (Recipient), Deppeler, J. (Recipient), Corrigan, D. (Recipient) & Gasevic, D. (Recipient), 25 Mar 2022Prize: Prize (including medals and awards) File Best paper awardLi, Z. (Recipient), Liu, J. (Recipient), Yu, J. (Recipient) & Gasevic, D. (Recipient), Sept 2022Prize: Prize (including medals and awards) Best paper awardLi, Z. (Recipient), Liu, J. (Recipient), Yu, J. (Recipient), Gasevic, D. (Recipient) & Yang, W. (Recipient), Dec 2022Prize: Prize (including medals and awards) Best paper awardUzir, N. A. (Recipient), Gasevic, D. (Recipient), Jovanovic, J. (Recipient), Matcha, W. (Recipient), Pardo, A. (Recipient), Lim, L. (Recipient) & Gentili, S. (Recipient), Sept 2019Prize: Prize (including medals and awards) View all 11 prizes Press/Media From AI to virtual reality: how technology is changing online learningGasevic, D.23/02/231 item of Media coveragePress/Media: Expert Comment AI to boost self-regulated learningGasevic, D.5/02/221 item of Media coveragePress/Media: Article/Feature Preparing students for the age of AIGasevic, D.9/12/211 item of Media coveragePress/Media: Article/Feature New centre to harness data in classroom and empower learners for age of AIGasevic, D.6/12/211 item of Media coveragePress/Media: Article/Feature Analyzing the metrics & data in learning with @ammienoot & @dgasevicGasevic, D.1/04/211 Media contributionP",
  "content_length": 10079,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:00"
}