{
  "name": "Dror G. Feitelson",
  "homepage": "http://www.cs.huji.ac.il/~feit",
  "status": "success",
  "content": "Dror Feitelson's Home Page Prof. Dror Feitelson Berthold Badler Chair in Computer Science This page contains: Research interests Biography Contact information Related or interesting sites: Experimental (Parallel) Systems Lab Parallel workloads archive Workshops on parallel job scheduling Workshop on experimental computer science Performance Evaluation Links Bioinformatics open-access journals (and PeerJ Computer Science) My blogs on bugs and data (Hebrew) and pictures Other related pages are: Information for students My publications My students Research Interests I head the Experimental Systems Lab here at Hebrew University, formerly the parallel systems lab, but I don't work on parallel systems any more. My research centers on software engineering and performance evaluation. In both cases the emphasis is on experimental methodology, in an attempt to ground the results in empirical findings rather than unbased assumptions. This is part of a wider interest in experimental computer science in general. Here are some details. Program comprehension I'm interested in why programs are difficult to understand. This includes looking into complexity metrics and how various code attributes may affect perceived complexity. Specific achievements include Studies on variable names, including one that suggests a model of name formation, and another that demonstrated that misleading names are not uncommon and can be worse than meaningless names such as consecutive letters of the alphabet. Development of a gamified platform for experiments on comprehension, and using it to show, inter alia, that loops counting down are slightly harder to comprehend than equivalent loops counting up. Identifying code regularity as an attribute that affects code complexity. This is the first experimental demonstration of how the complexity of certain code depends on its context, implying that metrics such as MCC that just count features are overly simplistic. Software evolution I'm interested in how software evolves, and in lifecycle models that take into account the continued development and the overlap between production and development. The main vehicle for research on evolution is the repository of all past releases of the Linux kernel. This has led to the proposal of the perpetual development model. Other things I've worked on in the past include Workload characterization and modeling I am interested in analyzing and characterizing the actual usage of parallel and other systems, with the long-term goal of placing research on a more solid foundation (i.e. use measurements rather than assumptions as a basis). This sometimes leads to pretty pictures. The modeling part emphasizes generative user-based models, including the use of resampling and feedback effects. As part of this effort I maintain the Parallel Workloads Archive, which contains workload logs from various production installations, workload models proposed in the literature, and a bibliographical listing. I also wrote a book on this subject. Parallel job scheduling This refers to scheduling parallel jobs for execution by an operating system, as opposed to off-line task scheduling. I have worked on gang scheduling and backfilling. I am also the founding co-organizer of a series of workshops on this topic, which are held annually since 1995 in conjunction with other major conferences. Their proceedings are available from Springer-Verlag as part of the LNCS series. Operating systems and scheduling My students have developed interesting ideas regarding scheduling for multimedia and removing ticks from operating systems. See the web pages of Yoav Etsion and Dan Tsafrir. In addition we worked on fair share allocation, mainly in the context of virtualization. Parallel systems I've worked on a couple of experimental parallel system: the Makbilan multiprocessor and the ParPar cluster here at Hebrew University, and also on early versions of the IBM SP in my postdoc. More details in the Parallel Systems Lab. Parallel I/O This is what I did in my postdoc at IBM Research, which culminated with the implementation of the Vesta parallel file system (the basis for IBM's PIOFS) (work with Peter Corbett). I was also involved in the inception of the MPI-IO standard proposal, which was later incorporated into MPI-2. Digital libraries I did some work on digital libraries, and implemented a neat system called BoW for “bibliography on the web”; this is a bibliographical repository on the topic of parallel systems. Optical Computing In the more distant past I wrote an extensive survey on optical computing, and did some work on using optical networks. Biography 1982-1985 BSc in Mathematics, Physics, and Computer Science, at the Hebrew University. 1985-1987 MSc in Computer Science at Hebrew University. Thesis subject: a survey of optical computing. Advisors: Prof. Danny Dolev and Prof. Larry Rudolph. 1987-1991 PhD in Computer Science at Hebrew University. Thesis subject: gang scheduling with distributed hierarchical control. Advisor: Prof. Larry Rudolph. 1992-1995 Postdoc at IBM T.J. Watson Research Center, Yorktown heights, NY. Worked mainly on the Vesta parallel file system, which was the basis for the Parallel I/O File System on the IBM SP2. Host: Prof. Marc Snir. since fall 1995 Lecturer of Computer Science at Hebrew University. May 2002 Promoted to Senior Lecturer with tenure. 2004-2005 Sabattical at Vanderbilt University. Host: Prof. Steve Schach. Nov 2006 Promoted to Associate Professor. Sep 2014 Promoted to Full Professor. Feb 2026 Retired. Contact Information Dror Feitelson The Rachel and Selim Benin School of Computer Science and Engineering Edmond J. Safra Campus The Hebrew University 91904 Jerusalem, ISRAEL e-mail: Phone (+fax): +972-2-549-4555 Office: Rothberg A311 Background: The background color of this page is supposed to be reminiscent of the red granite rocks in the Santa Katarina area in the Sinai peninsula. This is my favorite type of rock. To HUJI CS home page Last modified: 7 Sep 2014 /",
  "content_length": 6021,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:04"
}