{
  "name": "Duc A. Tran",
  "homepage": "http://www.cs.umb.edu/~duc/www",
  "status": "success",
  "content": "Duc (David) Tran | Home Duc (David) Tran HomeResearchTeaching Contact (Fall 2024) Office: McCormack M3-0201-18 Office hours: Tue/Thu 3PM-5:15PM Office tel: (617) 287-6452 duc.tran@umb.edu | LinkedIn Best way to reach me is email. NEWS! Read our new book, \"Handbook on Blockchain.\" (Springer, 2022) An edited book project (700+ pages) I collaborated with Prof. My Thai (U of Florida) and Prof. Bhaskar Krishnamachari (USC). A good read about Blockchain Technology for those who want to set foot in this exciting field. Sample Chapter: Chapter 1 (50 pages) \"Blockchain in a Nutshell.\" About Dr. Duc (David) A. Tran is a tenured Associate Professor in the Department of Computer Science at the University of Massachusetts at Boston, where he is Director of the Network Computing Laboratory. His research interest is network computing, particularly using machine learning and decentralized techniques to optimize networked applications. His current projects are about blockchain, decentralized learning, and edge computing. His research on peer-to-peer and decentralized networks is widely cited. He has received research funding awards from the National Science Foundation, Best Theory Paper Award at IEEE MASS 2014, Best Paper Award at ICCCN 2008, and Best Paper Recognition at DaWak 1999. Dr. Tran has served as a frequent Review Panelist for the National Science Foundation (2008-2011, 2014, 2015, 2018, 2024),  Editor for Elsevier Ad Hoc Networks Journal (2015-date), Editor for Springer Journal on Computational Social Networks (2013-date), Editor for Taylor Francis Journal on Parallel, Emergent, and Distributed Systems (2010-date), Guest-Editor for the Journal on Pervasive Computing and Communications (2009), TPC Symposium Co-Chair for ICNC 2017, TPC Track Chair for VTC Fall 2015, TPC Chair for WiMAN (2014, 2017), CCNet (2010, 2011), GridPeer (2009, 2010, 2011), and IRSN 2009, TPC Vice-Chair for AINA 2007, and Member of Organizing Committee for ACM Multimedia 2014 and IEEE DCOSS 2016. He was on the TPC for 80+ international conferences, and referee and session chair for numerous journals/conferences. He was a keynote speaker at WiMAN 2013 . Dr. Tran is a Senior Member of both the Association for Computing Machinery (ACM) and the Institute of Electrical and Electronics Engineers (IEEE). He obtained a PhD degree in Computer Science from the University of Central Florida (Orlando, Florida) in 2003, where he was honored with the Order of Pegasus, the most prestigious student award at the university. He was also a recipient of the IEEE Outstanding Graduate Student Award (2002). Outside of academia, Dr. Tran is active in blockchain business as a founder, advisor, and investor. Google Scholar | Scopus ID © 2012 David Tran Contact Me",
  "content_length": 2752,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:09"
}