{
  "name": "Dugang Liu",
  "homepage": "https://dgliu.github.io",
  "status": "success",
  "content": "cf Dugang Liu - Shenzhen University Dugang Liu (刘杜钢) Assistant Professor College of Computer Science and Software Engineering Shenzhen University Office: RM929, Zhiteng Building, Yuehai Campus of Shenzhen University Email: dugang.ldg 'at' gmail.com; liudugang 'at' szu.edu.cn Google Scholar, Semantic Scholar, DBLP, GitHub, CV Hello! I am an assistant professor in the College of Computer Science and Software Engineering at Shenzhen University. I got my Ph.D. from the College of Computer Science and Software Engineering at Shenzhen University, advised by Prof. Zhong Ming and Weike Pan. Before that, I obtained my Master's degree in Computer Science from Xiamen University and my Bachelor's degree in Mathematics from Fujian Normal University. I am broadly interested in Recommendation/Marketing, Intelligent Software Services, and LLM/Agent Applications, with a special emphasis on enhancing the responsibility in algorithms to provide fair, trustworthy, effective, efficient and user-centric data value development and application for various practical scenarios. I am open to various kinds of collaborations. If you have any ideas, please contact me. I am looking for multiple self-motivated Masters and PhD students. If you are interested, please contact me. For Prospective Students For prospective Masters and PhD students: I am looking for highly self-motivated Masters and PhD students. If you are interested in working with me, please email me with your CV, transcript, a description of your research interests and experience, and your writting samples (e.g., publications, dissertations, project reports, and so on). For prospective intern students: I am also exicted to help other students with their research, especially if you plan to apply for higher degrees at graduate schools. Full-time interns will be offered a salary accordingly. If you are interested in working with me, please email me with your CV, transcript, a description of your research interests and experience, and your writting samples (e.g., publications, dissertations, project reports, and so on). News 10/2025: One paper about multi-scenario multi-task recommendation is accepted by WSDM 2026, congratulations to my student Chaohua! 09/2025: Invited to be a reviewer for PAKDD 2026. 09/2025: Three papers, on (multimodal) large models and sequential recommendations, are accepted by NeurIPS 2025. 09/2025: Invited to be a reviewer for WWW 2026 and ICLR 2026. 08/2025: Our work received KSEM 2025 Best Paper Award, congratulations to all collaborators! 08/2025: One paper about secure aggregation of distributed learning is accepted by KSEM 2025, congratulations to all collaborators! 08/2025: Invited to be a reviewer for AISTATS 2026. 07/2025: One paper about embedding quantification in recommendation is accepted by CCIR, congratulations to all collaborators! 07/2025: Invited to be a Area Chair and Senior Area Chair for KDD 2026 ADS Track. 07/2025: Invited to be a reviewer for AAAI 2026 and KDD 2026 Datasets and Benchmarks Track 06/2025: Invited to be a reviewer for WSDM 2026. 05/2025: One paper about cross-domain lifelong behavior modeling is accepted by KDD 2025, congratulations to all collaborators! 05/2025: One paper about robust online marketing is accepted by ICML 2025, congratulations to all collaborators! 05/2025: Invited to be a reviewer for ECAI 2025. 04/2025: Two papers about multi-scenario embedding learning and LLM&KG4Rec are accepted by SIGIR 2025, congratulations to all collaborators! 03/2025: Invited to be a reviewer for ACML 2025, BigData 2025 and CIKM 2025. 02/2025: Invited to be a reviewer for RecSys 2025 and NeurlPS 2025. 01/2025: Invited to be a reviewer for SIGIR 2025 and KDD 2025 Research Track. 01/2025: One paper about fund recommendation is accepted to DASFAA 2025, congratulations to all collaborators! 01/2025: Invited to be the Area Chair for KDD 2025 ADS Track. 01/2025: Invited to be a reviewer for SIGIR 2025. 12/2024: I received certification as an Outstanding Reviewer from ECMLPKDD 2024 and KDD 2025 (both tracks). 12/2024: Invited to be a reviewer for ECMLPKDD 2025, IJCAI 2025, UMAP 2025 and ICML 2025. 11/2024: Two papers about automated multi-scenario instance selection and real-time uplift modeling are accepted by KDD 2025, congratulations to all collaborators! 10/2024: One paper about fusion design of click-through rate prediction model is accepted to WSDM 2025, congratulations to all collaborators! 10/2024: I received the RecSys 2024 Outstanding Reviewer Award. 09/2024: One paper about LLM-enhanced recommendations is accepted by EARL@RecSys 2024, congratulations to my student Shenxian! 09/2024: Invited to be a reviewer for AISTATS 2025. 08/2024: One paper about context-aware recommendation is accepted by ACM TORS, congratulations to my students Shenxian and Yuhao! 08/2024: Invited to be a reviewer for WWW 2025 and ICLR 2025. 07/2024: Two papers about multi-task recommendation with hybrid targets and incentive recommendation are accepted to RecSys 2024, congratulations to all collaborators! 07/2024: One paper about lifetime value prediction is accepted to CIKM 2024, congratulations to all collaborators! 07/2024: One paper about efficiency optimization of federated learning is accepted to MM 2024, congratulations to all collaborators! 07/2024: Invited to be a reviewer for KDD 2025. 06/2024: Invited to be a PC member for AAAI 2025, ACML 2024 and WSDM 2025. 05/2024: Invited to be a reviewer for NeurIPS 2024. 03/2024: One paper about automated user behavior selection is accepted by SIGIR 2024, congratulations to my students Shenxian, Yuhao and Chaohua! 03/2024: Invited to be a PC member for CIKM 2024 and ECMLPKDD 2024. 03/2024: One paper about multi-valued treatment uplift modeling is accepted by DASFAA 2024, congratulations to Zexu! 03/2024: One paper about automated bug detection with LLM is accepted to TKDD, congratulations to all collaborators! 02/2024: Invited to be a PC member for RecSys 2024, BigData 2024 and ICML 2024. 02/2024: One paper about generative recommendation is accepted to LREC-COLING 2024, congratulations to all collaborators! 01/2024: Invited to be a PC member for IJCAI 2024, KDD 2024, MM 2024, and ACL 2024. 10/2023: One paper about automated multi-scenario feature selection is accepted by WSDM 2024, congratulations to my student Chaohua! 09/2023: One paper about automated feature interaction selection is accepted by NeurIPS 2023, congratulations to all collaborators! 09/2023: Our work received RecSys 2023 Best Full Paper Runner-up Award, congratulations to all collaborators! 09/2023: Invited to be a PC member for AISTATS 2024, WWW 2024, and SDM 2024. 09/2023: One paper about uplift modeling is accepted by ICDM 2023, congratulations to Zexu! 08/2023: Received funding from the Youth Project of the National Natural Science Foundation of China. 08/2023: One paper about debiasing recommendation is accepted by Artificial Intelligence, congratulations to Zinan! 07/2023: One paper about debiasing recommendation is accepted by MM 2023, congratulations to all collaborators! 06/2023: One paper about context-aware recommendation is accepted by RecSys 2023, congratulations to all collaborators! 06/2023: One paper about multi-scenario recommendation is accepted by ECMLPKDD 2023, congratulations to all collaborators! 05/2023: One paper about uplift modeling is accepted by KDD 2023, congratulations to all collaborators! Students Chaohua Yang, MS/PhD, 09/2022 - Yuhao Wu, PhD, 09/2023 - Chao Jiang, MS, 09/2024 - Shuying Jiang, MS, 09/2024 - Guorui Li, MS, 09/2024 - Ruilin Yuan, MS, 09/2024 - Jun Zhang, MS, 09/2024 - Kailiang Hao, MS, 09/2024 - Xiongda Chen, MS, 09/2025 - Hailong Qi, MS, 09/2025 - Yonglin Wei, MS, 09/2025 - Ding Wang, MS, 09/2025 - Jintao Huang, MS, 09/2025 - Miao Liu, MS, 09/2022 - 06/2025. Now: Guangdong Laboratory of Artificial Intelligence and Digital Economy (SZ) Tingting Song, MS, 09/2022 - 06/2025. Now: Guangdong Laboratory of Artificial Intelligence and Digital Economy (SZ) Shenxian Xian, MS, 09/2022 - 06/2025. Now: Tencent Financial Technology (FiT) Publications (Google Scholar) (Semantic Scholar) [WSDM 2026] Automated information flow selection for multi-scenario multi-task recommendation. The 19th ACM International Conference on Web Search and Data Mining, 2026. Chaohua Yang, Dugang Liu*, Shiwei Li, Yuwen Fu, Xing Tang, Weihong Luo, Xiangyu Zhao, Xiuqiang He, Zhong Ming. [NeurIPS 2025] See&Trek: Training-free spatial prompting for multimodal large language model. The 39th Annual Conference on Neural Information Processing Systems, 2025. Pengteng Li, Pinhao Song, Wuyang Li, Huizai Yao, Weiyu Guo, Yijie Xu, Dugang Liu, Hui Xiong. [NeurIPS 2025] Beyond higher rank: Token-wise input-output projections for efficient low-rank adaptation. The 39th Annual Conference on Neural Information Processing Systems, 2025. Shiwei Li, Xiandi Luo, Haozhao Wang, Xing Tang, Ziqiang Cui, Dugang Liu, Yuhua Li, Xiuqiang He, Ruixuan Li. [NeurIPS 2025] Semantic retrieval augmented contrastive learning for sequential recommendation. The 39th Annual Conference on Neural Information Processing Systems, 2025. Ziqiang Cui, Yunpeng Weng, Xing Tang, Xiaokun Zhang, Shiwei Li, Peiyang Liu, Bowei He, Dugang Liu, Weihong Luo, Xiuqiang He, Chen Ma. [KSEM 2025] Masked aggregation learning for enhancing distributed gradient boosting decision trees. [Best Paper Award] The 18th International Conference on Knowledge Science, Engineering and Management, 2025. Yuting Zha, Chao Lin, Xinyi Huang, Dugang Liu. [CCIR 2025] Application of product quantization based on attention mechanism in efficient embedding model. The 31th China Conference on Information Retrieval, 2025. Shiwei Li, Zhuoqi Hu, Haozhao Wang, Dugang Liu, Xing Tang, Xiuqiang He, Ruixuan Li. [KDD 2025 (February Cycle)] Retrieval augmented cross-domain lifeLong behavior modeling for enhancing click-through rate prediction. [pdf] The 31st ACM SIGKDD Conference on Knowledge Discovery and Data Mining,",
  "content_length": 22735,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:06"
}