{
  "name": "Dulani Apeksha Meedeniya",
  "homepage": "https://uom.lk/staff/Meedeniya.DA.php",
  "status": "success",
  "content": "Skip to main content Subfooter Menu Search Awards for Teaching Excellency - Year 2017 Deshamanya Dr. Roland Silva Award for the Most Outstanding Faculty of Architecture Graduand of the Year 2017 Select your language EnglishSinhala????? Prof.(Ms)Meedeniya D.A. | University of Moratuwa Prof.(Ms) Meedeniya D.A. Faculty of Engineering Department of Computer Science & Engineering Professor Contact information Address Department of Computer Science & Engineering Faculty of Engineering University of Moratuwa Moratuwa 10400 Office dulanim@cse.mrt.ac.lk Extension - Primary Email dulanim@uom.lk Teaching and Administrative Activities Teaching Software Engineering Project -Undergraduate -2015 Software Process Management (50%) -Undergraduate -2015 Software Engineering Project -Undergraduate -2016 Software Engineering Project -Undergraduate -2017 Software Process Management (50%) -Undergraduate -2016 Software Engineering Project -Undergraduate -2014 Software Engineering Project -Undergraduate -2018 Software Engineering Project -Undergraduate -2019 Software Engineering Project -Undergraduate -2020 Quality Engineering (50%) -Undergraduate -2017 Quality Engineering (50%) -Undergraduate -2018 Quality Engineering -Undergraduate -2019 Software Process and Management (50%) -Undergraduate -2018 Software Process and Management (50%) -Undergraduate -2019 Software Process and Management (50%) -Undergraduate -2020 Research Seminar (25%) -Postgraduate -2013 Research Seminar (25%) -Postgraduate -2014 Research Seminar (25%) -Postgraduate -2015 Information Systems Modelling and Design -Postgraduate -2018 Information Systems Modelling and Design -Postgraduate -2019 Administrative Activities Timetable committee member -Timetable committee member, CSE. (2013 - todate) (2013 To date) Editorial Board member -Editorial Board member, UOM (2014 - todate) (2014 To date) Academic coordinator of Semester 5 -Academic coordinator of Semester 5, Department of Computer Science and Engineering, Faculty of Engineering, University of Moratuwa (todate) (2014 To date) Personal student mentor - Faculty of Engineering, University of Moratuwa, (2015 - todate). (2015 To date) Laboratory in-charge - Laboratory in-charge: Advanced Computer Lab, Department of CSE, University of Moratuwa, Sri Lanka (2014-todate). (2014 To date) First year coordinator - First year coordinator, Department of Computer Science and Engineering, Faculty of Engineering, University of Moratuwa, (2007 – 2009). (2007 To 2008) Industrial training coordinator - Industrial training coordinator, Dept. CSE, Faculty of Engineering, University of Moratuwa, (2007 – 2009). (2007 To 2008) Student Induction Program Committee member - Committee member to plan, conduct and supervise the Student Induction Program, Faculty of Engineering, University of Moratuwa, (750 students), (2007-2008). (2007 To 2008) Course Module Writer - Course Module Writer, Bachelor of Information Technology (BIT) External Degree Program, Faculty of Information Technology, University of Moratuwa, (2007). (2007 To date) Team member (OBE) - Team member, Outcome Based Education (OBE) curriculum development, Department of CSE, University of Moratuwa, Sri Lanka (2013-todate). (2013 To date) Member of Editorial Board (FoE) -Member of Editorial Board, Faculty of Engineering, University of Moratuwa, (2007 – 2009). (2007 To 2008) Career Guidance Coordinator (CSE) -Career Guidance Coordinator, Department of Computer Science and Engineering, University of Moratuwa (2019- todate). (2019 To date) M.Sc. Coordinator - M.Sc. in CS Coordinator, Department of Computer Science and Engineering, University of Moratuwa (2019- 2023). (2019 To 2023) Research Activities Research Interests Software Engineering Data science Machine learning applications Deep learning applications Bio-health informatics Technology enhanced learning Computer vision Current projects ï¿½\tSoftware artefact traceability management: SAT-Analyser https://sites.google.com/cse.mrt.ac.lk/sat-analyser ï¿½\tBio-Health Informatics Research: Bio-Health Informatics https://sites.google.com/cse.mrt.ac.lk/biohealth ï¿½\tEnvironment Observatory Using Deep learning and IoT https://sites.google.com/view/eco-sustainable/home ï¿½\tOther https://sites.google.com/site/dameedeniya/home/research Research Supervision Undergraduate (Final year research project) 1.\t(2014) Establishing and Visualizing Traceability Links among Software Artefacts Team Members: T. Gitanjali, K. Kamalabalan, T. Uruththirakodeeswaran, D. B. Wijesinghe 2.\t(2015) Natural Language Processing in Software Artefacts Traceability Tool Team Members: A. Arunthavanathan, S. Sobiga, R. Srishiyamalan, T. Vinojan 3.\t(2016) Software Artefact Traceability Analyzer Extension for DevOps Practice Team Members: S.H. Palihawadana, M.G.T.N. Sanjitha, C. H. Wijeweera, Vijini K. Liyanage 4.\t(2016) Context Aware Recommendations for Data Visualization Team Members: H. P. Maduranga, W. A. D. Kanchana, G. D. L. Madushanka, M. D. M. Udayanga 5.\t (2016) Automated land use classification with heterogeneous data sources Team Members: J.A.A.M. Jayaneththi, M.D.N. Dilini, M. H. Wickramapala, J. H. Madushanka 6.\t(2017) Change detection of frequently changing web pages Team Members: L.B. Meegahapola, P.K.D.R.M. Alwis, V.G. Mallawaarachci, L.B.E.H. Nimalarathna (In collaboration with Dr. S. Jayarathna Sampath Jayarathna, Department of Computer Science, California State Polytechnic University, California) 7.\t(2017) Analysis of conflicts between medications, adverse drug reactions and diseases Team Members: M.Y. Nilan, L.C.J. Gamage, D.D. Sellahewa, A.S.R. Fernando 8.\t(2019) Autism spectrum disorder (ASD) indicative Decision Support System using Psychophysiological Data Team Members: B. Gunavaran (150196B), H.D.I. Haputhanthri (150207M), M.D.S.R. Gunathilaka (150194R) (In collaboration with Dr. S. Jayarathna, Old Dominion University, Virginia, Dr. Mark Jaime, Indiana University-Purdue University, Indiana. Dr. Christopher Harshaw, Department of Psychology, University of New Orleans, Louisiana, USA) 9.\t(2019) Neuroscience Decision Support Systems for identification of ADHD using Psychophysiological Measures Team Members: H.B.G.C Ariyarathne (150041X), H.M.S.U Dayarathna (150097X), K.T.S De Silva (150106D) (In collaboration with Dr. S. Jayarathna and Dr. Anne M.P. Michalek, Old Dominion University, Virginia, USA.) 10.\t(2019) PhyloGenie: A Generic Phylogenetic Inference Framework with GPU Compatibility Team Members: J.A.C.G. Jathunarachchi (150243T), H.M.D. Jeewanthi (150280D), O. G.Samarasinghe (150551K) 11.\t(2020) Constraints based automated license plate recognition R. M. Heshan N. Padmasiri (160451M), A. A. Jithmi Shashirangana (160585C) In collaboration with Dr. Charith Perera, University of Cardiff, UK. To be updated Postgraduate Research M.Phil. (Full time) ï¿½ Completed 1.\t(2017-2019) Traceability Management in a DevOps Environment with Continuous Integration: I. D. Rubasinghe (178020N) M.Sc. (Full time) ï¿½ Completed 2.\t(2017-2019) Context-aware Recommendation for Data Visualization: L. A. D. P. Athukorala (178053R) M.Sc. (Full time) ï¿½ Ongoing 3.\t(2018-2019) A Framework for Gesture-based Mobile User Communication: L. C. J. Gamage 4.\tMs. M. R. Navodini Wijethilake (2020- 2021) Overall Survival Prediction of Glioma Patients with Genomics MSc. (Part-time) - Ongoing 5.\tD.P.Shakyani Jayasiriwardene (2020- 2022) An adaptive framework for an interactive learning toolkit to support primary education in Sri Lanka MPhil Part- time) - Ongoing 6.\tP. H. A. H. K. Yashodhara (2020- 2023) 2020/MPhil/7642z A framework for learning and communication support toolkit for special needs children. MSc. (Part-time) ï¿½ Completed 7.\t(2017 ï¿½ 2019) Automation Framework for E-commerce Solution Based on Competitor Analysis: N. Shanmugananthan (179339H) 8.\t(2016-2019) A Defect Prediction Model for Model Driven Engineering: K.S.D.N.K. De Silva (168214E) 9.\t(2017 ï¿½ 2019) Devops tool as a utility to cloud migration of business intelligence system: N. Ranaweera (179347F) MBA (Part-time) ï¿½ Completed 10.\t(2015-2016) Factors affecting successful adoption of scrum in software companies: K. S. Nishali 11.\t(2017-2018) A study of the relationship between retention strategies and job performance in Sri Lanka software industry: S. D. Rajapakse (169128C) 12.\t(2017-2018) The methods to mitigate employee uncertainty due to project discontinuation in Sri Lankan software industry: V. D. Kaluarachchi (169112X) 13.\t(2018-2019) Career expectations and aspirations of generation Z in Sri Lankan software industry: H.K.C. Nishani (179125A) 14.\t(2017 ï¿½ 2019) Requirement Engineering Challenges Affecting Distributed Scrum Teams: H.A.S. Udayanganee (179134B) 15.\tJ.H.P.C.M Dabare (179103F) (2017-2019) Evaluation of factors affecting the performance of system support engineers in IT industry 16.\tMr. Ramesh. P. H. Vithanage (179135E) (2018-2020) Factors Affecting the Adoption of Scrum Practices: An Analysis of Sri Lankan Software Development Companies 17.\tMs. P. Madhavi. Upeksha (189128K) (2019-2020) Factors Affecting the Implementation of Scrum Risk Management Practices in Sri Lankan Software Industry 18.\tMs. T.M. Sathsarani. Vithanage (189129A) (2019-2020) Analysis of the impact of teleworking on the productivity of software engineers in Sri Lanka MBA (Part-time) ï¿½ Ongoing 19.\t (2019-2020) Effort estimation deviations in DevOps practices in software industry: H. Thennakoon(189126L) 20.\t(2019-2020) Identify challenges of third-party software integration: T. Jayasiri (189109M) 21.\tMs. Dilanjani Hewavitharana (199112B) (2020 ï¿½ 2021) Impact of Work-Life Balance on Career Advancement of Female Employees in IT Offshore Industry in Sri Lanka Key Research Areas Data Science Software Engineering Bio-health informatics Technology enhanced learning Computer Vision Artificial Intelligence Education and Professional Affiliations Education PhD, University of St Andrews ,2013 Software Engineering Bachelors, University of ",
  "content_length": 59470,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:08"
}