{
  "name": "Dulce Domingos",
  "homepage": "https://ciencias.ulisboa.pt/perfil/mddomingos",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo DULCE DOMINGOS Contactos Departamento de Informática Sala/Gabinete 6.3.25 Ext. Principal 26325 Telefone Direto 21750000 Email mddomingos@ciencias.ulisboa.pt Página Pessoal Carreira Docente Universitário Categoria Professor Auxiliar Indicadores ResearcherID Orcid Keywords Information SecurityInternet of ThingsAdaptive Business Processes Currículo Resumido PhD in \"Informática\", Faculdade de Ciências da Universidade de Lisboa, 2005.Master in \"Engenharia Electrotécnica e de Computadores\", Instituto Superior Técnico da Universidade Técnica de Lisboa, 1997.Graduation in Informática\", Faculdade de Ciências da Universidade de Lisboa, 1993. Interesses Científicos Information security- Reliability- Access control models, systems and applicationsInternet of Things- Support for Internet of Things aware business processes Adaptive business processes- Controlled flexibility- Definition and enactment tools to support ad-hoc changes of business processes- Supply chain management Scientific Interests Information security- Reliability- Access control models, systems and applicationsInternet of Things- Support for Internet of Things aware business processes Adaptive business processes- Controlled flexibility- Definition and enactment tools to support ad-hoc changes of business processes- Supply chain management Publicações selecionadas Martinho, R., Domingos, D., & Respício, A. (2016). Evaluating the Reliability of Ambient-Assisted Living Business Processes. 18th International Conference on Enterprise Information Systems. Ana Respício, Dulce Domingos, Reliability of BPMN Business Processes, Procedia Computer Science, Volume 64, 2015, Pages 643-650, ISSN 1877-0509, http://dx.doi.org/10.1016/j.procs.2015.08.578. Domingos, D., Martins, F., Cândido, C., & Martinho, R. (2014). Internet of Things Aware WS-BPEL Business Processes Context Variables and Expected Exceptions. J. UCS, 20(8), 1109-1129. Martinho, R., Varajao, J., & Domingos, D. (2008, September). A two-step approach for modelling flexibility in software processes. In Proceedings of the 2008 23rd IEEE/ACM International Conference on Automated Software Engineering (pp. 427-430). IEEE Computer Society. Domingos, D., Rito-Silva, A., & Veiga, P. (2003). Authorization and access control in adaptive workflows. In Computer Security–ESORICS 2003 (pp. 23-38). Springer Berlin Heidelberg. Ver todas as Publicações",
  "content_length": 2538,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:09"
}