{
  "name": "Duncan J. Watts",
  "homepage": "https://pikprofessors.upenn.edu/meet-the-professors/duncan-watts",
  "status": "success",
  "content": "Duncan Watts | Penn Integrates Knowledge Professorships Skip to main content Go to site search Go to primary navigation Go to resources navigation BIOSKETCH RESEARCH INTERESTS COLLECTED MEDIA BIOSKETCH President Amy Gutmann and Provost Wendell Pritchett are pleased to announce the appointment of Duncan Watts as the University of Pennsylvania’s twenty-third Penn Integrates Knowledge University Professor, effective July 1, 2019. Watts, a pioneer in the use of data to study social networks, will be the Stevens University Professor, with joint faculty appointments in the Department of Computer and Information Science in the School of Engineering and Applied Science, the Annenberg School for Communication, and the Department of Operations, Information and Decisions in the Wharton School, where he will also be the inaugural Rowan Fellow. “The cornerstone of computational social science and network science is the use of technology to model, simulate, and analyze social phenomena. Duncan Watts stands at the epicenter of these fields. He is a research pioneer who has written the book on these now-burgeoning disciplines, which did not even have names when Duncan and his colleagues wrote the seminal papers that brought them into existence,” said Penn President Amy Gutmann. “Duncan will aptly have appointments in Annenberg, Engineering, and Wharton. His cutting-edge scholarship – joining communications, the social sciences and engineering to address important mind-boggling puzzles about human behavior – makes him a true visionary, and we are delighted to welcome him to Penn.” Watts is currently a principal researcher and partner at Microsoft Research and an Andrew D. White Professor-at-Large at Cornell University. His widely influential research brings together sociology, math, physics, statistics, and computer and information science to better understand the interconnected systems that shape our contemporary world. He is a pioneer of both network science – which explores how influence, ideas, and innovation spread across networks – and computational social science, which uses demographic, behavioral, and network data to gain new insights into human behavior. His contributions to these fields have been recognized by such major awards as the Young Scientist Award for Socio- and Econophysics from the German Physical Society, the Lagrange-CRT Foundation Prize in complexity science, and the Everett Rogers Award from the Annenberg School at the University of Southern California. In 2018, he was elected an inaugural fellow of the Network Science Society. He is the author of three groundbreaking books – Everything is Obvious (Once You Know the Answer), Six Degrees: The Science of a Connected Age, and Small Worlds: The Dynamics of Networks Between Order and Randomness – as well as articles in such leading publications as Nature, Science, the American Journal of Sociology, the Columbia Journalism Review, and the Harvard Business Review. Prior to joining Microsoft Research in 2012, he was a professor of Sociology at Columbia University from 2000-2007 and then a principal research scientist at Yahoo! Research, where he directed the Human Social Dynamics group. He earned a PhD in Theoretical and Applied Mechanics from Cornell University and a BSc in Physics from the Australian Defence Force Academy, from which he also received his officer’s commission in the Royal Australian Navy. “Duncan Watts epitomizes the innovative spirit that is the core of Penn’s DNA,” said Provost Pritchett. “His cutting-edge research brings together the insights and methods of multiple disciplines – the emblematic approach of our Penn Integrates Knowledge professors – to create new ways of understanding fundamental societal challenges. Above all, like so many of our world-leading faculty members, he is committed to foundational research that will make a direct impact on the most vital questions of the modern world.” RESEARCH INTERESTS Network science Computational social science Digital Media and Social Networks COLLECTED MEDIA \"Sarah J. Jackson, Duncan Watts awarded 2020 Andrew Carnegie Fellowships,\" Penn Today, May 12, 2020. \"NPR: Duncan Watts on Facebook’s Political Bias,\" Penn Engineering Today, October 6, 2020. Follow us on social media Twitter Education PhD, Theoretical and Applied Mechanics, Cornell University BSc, Physics, University of New South Wales, Australian Defence Force Academy View CV Additional Penn Profiles School of Engineering and Applied Science Wharton School Annenberg School for Communication Contact djwatts@cis.upenn.edu",
  "content_length": 4582,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:10"
}