{
  "name": "Dung D. Le",
  "homepage": "https://andrew-dungle.github.io",
  "status": "success",
  "content": "Andrew-DungLe Le Duy Dung (Andrew) Program Director of the B.Sc. in Data Science, Associate Program Director of the B.Sc. in Computer Science Le Duy Dung is an Assistant Professor at College of Engineering and Computer Science, VinUniversity, where he leads the R2Studio reseach group on AI-empowered Search and Recommendation and IndoorCare research group on AI and Simulation for Smart Indoor Spaces. Previously, he was a senior data scientist in Ads and Personalization team, Grab Holdings Inc. and a research scientist in School of Information Systems, Singapore Management University (SMU). He earned his PhD in Data Science and Engineering from SMU, under the supervision of Associate Professor Hady W. Lauw. More details can be found in his CV (updated Jan 2024) Funded Projects V-IndoorCARE: An advanced AI-enabled environmental simulation and HVAC control system for greener and healthier multi-user indoor facilities in Vietnam(PI, Duration: 2025-2027, VinGroup Innovation Fund, Website). Robust Vietnamese-English Clinical and Educational Medical Translation ( PI, Duration: 2024-2026, VinUni Cross-College Fund). SMART-CEM: Applying Artificial Intelligence (AI) and eye-tracking in designing and managing delightful customer experiences in the hospitality sector (co-PI, Duration: 2023-2025, VinGroup Innovation Fund - VINIF). Smart Indoor Air Quality Control System for Healthier and Greener Buildings (PI, Duration: 2022-2026, VinUni-Illinois Smart Health). Language Processing Adaptations for Multiple Recommendation Tasks (PI, Duration: 2023-2025, VinUni Seed Grant). Multimodal Federated Learning for Multi-objectives Recommendation (PI, Duration: 2022-2024, VinUni Fast Track Grant). Publications Journal Papers: Algorithmic Iterative Reticular Synthesis of Zeolitic Imidazolate Framework Crystals Zichao Rong, Zihao Chen, Felix Luong, Saumil Chheda, H. T. Nhan Luong, Zhiling Zheng, Kevin Greco, Abdullah A. Alghamdi, K. Huyen Bui, Theo Jaffrelot Inizan, Tung Nguyen-Dang, H. Hieu Pham, Dung D. Le, Joachim Sauer, Viet Bac T. Phung, Jennifer T. Chayes, Christian Borgs, Mario Boley, Laurent El Ghaoui, Omar M. Yaghi Nature Synthesis (Paper) Finding Environmental-friendly Chemical Synthesis with AI and High-throughput Robotics Vu Van Hao, Bui Khanh Huyen, Dang Dinh Dang Khoa, Duong Tuan Manh, Dung D. Le, Tung Nguyen-Dang Journal of Science: Advanced Materials and Devices (Paper) Towards Efficient Pareto-optimal Utility-Fairness between Groups in Repeated Rankings Phuong Dinh Mai, Duc-Trong Le, Tuan-Anh Hoang, Dung D. Le Machine Learning Journal, ACML 2024 Special Issue (Paper) A Framework for Controllable Pareto Front Learning with Completed Scalarization Functions and its Applications Tran Anh Tuan, Long P. Hoang, Dung D. Le, Tran Ngoc Thang Neural Networks Journal, Jan 2024 (Paper) Enhancing Few-shot Image Classification with Cosine Transformer Quang-Huy Nguyen, Cuong Q. Nguyen, Dung D. Le, and Hieu H. Pham IEEE Access, 2023 (Paper) Efficient Retrieval of Matrix Factorization-based Top-k Recommendations: A Survey of Recent Approaches Dung D. Le and Hady W. Lauw Journal of Artificial Intelligence Research (JAIR), 2021 (Paper) Conference Papers: JEPA4REC: Learning Effective Language Representations for Sequential Recommendation via Joint Embedding Predictive Architecture Minh-Anh Nguyen, Dung D. Le The 2nd Conference on Language Modeling (COLM 2025). (Paper) Designing Search Space for Unbounded Bayesian Optimization via Transfer Learning Quoc-Anh Hoang Nguyen, The Hung Tran, Sunil Gupta, Dung D. Le The 2025 European Conference on Machine Learning and Principles and Practice on Knowledge Discovery in Databases (ECMLPKDD 2025). (Paper) Provably Improving Generalization of Few-shot models with Synthetic Data Lan-Cuong Nguyen, Quan Nguyen-Tri, Bang Tran Khanh, Dung D. Le, Long Tran-Thanh, Khoat Than The 42th International Conference in Machine Learning (ICML 2025). (Paper) Enhancing News Recommendation with Hierarchical LLM Prompting Dang Hai Kieu, Delvin Ce Zhang, Minh Duc Nguyen, Min Xum Qiang Wu, Dung D. Le WWW '25: Companion Proceedings of the ACM on Web Conference 2025. (Paper) Keyword-driven Retrieval-Augmented Large Language Models for Cold-start User Recommendations Dang Hai Kieu, Minh Duc Nguyen, Thanh-Son Nguyen, Dung D. Le WWW '25: Companion Proceedings of the ACM on Web Conference 2025. (Paper) VisualCoder: Guiding Large Language Models in Code Execution with Fine-grained Multimodal Chain-of-Thought Reasoning Cuong Le Chi, Chau Truong Vinh Hoang, Phan Nhật Huy, Dung D. Le, Tien N Nguyen, Nghi D. Q. Bui The 2025 Annual Conference of the Nations of the Americas Chapter of the ACL (NAACL 2025) (Paper) Improving Pareto Set Learning for Expensive Multi-Objective Optimization via Stein Variational Hypernetworks Minh Duc Nguyen, Phuong Mai Dinh, Quang-Huy Nguyen, Hoang Phi Long, Dung D. Le The 39th Annual AAAI Conference on Artificial Intelligence (AAAI 2025) (Paper) Experience as Source for Anticipation and Planning: Experiential Policy Learning for Target-driven Recommendation Dialogues Huy Quang Dao, Yang Deng, Khanh-Huyen Bui, Dung D. Le, Lizi Liao Findings of EMNLP 2024. (Paper) A Curious Case of Searching for the Correlation between Training Data and Adversarial Robustness of Transformer Textual Models Dang Cao Cuong, Dung D. Le, Thai Le Findings of ACL, 2024. (Paper) Broadening the View: Demonstration-augmented Prompt Learning for Conversational Recommendation Huy Dao, Yang Deng, Dung D. Le, Lizi Liao The 47th ACM SIGIR on Research and Development in Information Retrieval (SIGIR 2024) (Paper) Improving Vietnamese-English Medical Machine Translation Nhu Vo, Dat Quoc Nguyen, Dung D. Le, Massimo Piccardi and Wray Buntine The 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation (LREC-COLING 2024) (Paper) Towards Efficient Communication and Secure Federated Recommendation System via Low-rank Training Ngoc-Hieu Nguyen, Tuan-Anh Nguyen, Tuan Minh Nguyen, Vu Tien Hoang, Dung D. Le, Kok-Seng Wong The 2024 ACM Web Conference (Paper) Reinforced Target-driven Conversational Promotion Huy Quang Dao, Lizi Liao, Dung D. Le, Yuxiang Nie The 2023 Conference on Empirical Methods in Natural Language Processing (EMNLP 2023) (Paper) Towards Data-Agnostic Pruning At Initialization: What Makes a Good Sparse Mask? Hoang Pham, The-Anh Ta, Shiwei Liu, Lichuan Xiang, Dung D. Le. Hongkai Wen, Long Tran-Thanh The 2023 Conference on Neural Processing Systems (NeurIPS 2023) (Paper) A Probabilistic Framework for Pruning Transformers via a Finite Admixture of Keys T. Nguyen, T. Nguyen, Long Bui, Hai Do, Dung D. Le, Hung Tran-The, Duy Khuong Nguyen, N. Ho, S. J. Osher, R. G. Baraniuk The 2023 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP 2023) (Paper) Improving Pareto Front Learning via Multi-Sample Hypernetworks Hoang Phi Long, Dung D. Le, Tran Anh Tuan, Tran Ngoc Thang AAAI Conference on Artificial Intelligence (AAAI-23) (Paper) Improving Transformers with Probabilistic Attention Keys T. Nguyen, T. Nguyen, Dung D. Le, K. Nguyen, A. Tran, R. G. Baraniuk, N. Ho, S. J. Osher The Thirty-ninth International Conference on Machine Learning (ICML 2022), July 2022 (Paper) Collaborative Curating for Discovery and Expansion of Visual Clusters Dung D. Le and Hady W. Lauw The 15th ACM International Conference in Web Search and Data Mining (WSDM-22), Feb 2022 (Paper) Stochastically Robust Personalized Ranking for LSH Recommendation Retrieval Dung D. Le and Hady W. Lauw AAAI Conference on Artificial Intelligence (AAAI-20), Feb 2020 (Paper) Learning Multiple Maps from Conditional Ordinal Triplets Dung D. Le and Hady W. Lauw International Joint Conference on Artificial Intelligence (IJCAI'19), Aug 2019 (Paper) Multiperspective Graph-Theoretic Similarity Measure Dung D. Le and Hady W. Lauw ACM Conference on Information and Knowledge Management (CIKM'18), Oct 2018 (Paper|Code) Indexable Bayesian Personalized Ranking for Efficient Top-k Recommendation Dung D. Le and Hady W. Lauw ACM Conference on Information and Knowledge Management (CIKM'17), Nov 2017 (Paper|Code) Euclidean Co-Embedding of Ordinal Data for Multi-Type Visualization Dung D. Le and Hady W. Lauw SIAM International Conference on Data Mining (SDM'16), May 2016 (Paper) Tutorials: Recent Advances on Scalable Retrieval of Personalized Recommendation Dung D. Le and Hady W. Lauw The Thirty-Third AAAI Conference on Artificial Intelligence (AAAI-19), Jan 2019 (Website| Materials|Videos) PhD Thesis: Preference Learning and Similarity Learning Perspectives on Personalized Recommendation Duy Dung LE, Singapore Management University (Pdf|Blog) Projects Besides conducting intensive research, I also involve in the development of research frameworks/libraries and supervise undergraduate projects. Cerebro - Closed-loop Engine for REcommendations with Blazingly fast Retrieval of Objects Thriftcity - Personalized Recommendation System for ThriftCity - A Price Comparison Website VIS-Concepts - Image Search with Visual Concepts Teaching Experience VinUniversity: COMP4050/COMP5090: Cryptography (Spring 2024) COMP4010/COMP5120: Data Visualization (Spring 2024) BANA4020: Computational Machine Learning for Business Analytics (Spring 2024) MATH4010: Advanced Probability and Statistics (Spring 2022, Spring 2023) CISM2010: Database Concepts and Skills for Big Data (Spring 2022, Fall 2023) CECS1030: Algorithmic and Computational Thinking (Spring 2022) MATH2010: Probability and Statistics (Fall 2021, Fall 2022) COMP2030: Software Construction (Fall 2022, Fall 2023) Graduate Instructor (SMU): COR-IS1702: Computational Thinking (AY2019-2020) Teaching Assistant (SMU): IS103: Computational Thinking (AY2017-2018) IS302: Information Security and Trust (AY2017-2018) Blogs A Quest for Fast Personalized Recommendation Fast and Accurate Personalized Recommendation with Indexing Talks Representation Learning for Efficient Recommendation Retrieval (slides)Hanoi Univers",
  "content_length": 11439,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:10"
}