{
  "name": "Duong Hieu Phan",
  "homepage": "http://www.di.ens.fr/users/phan",
  "status": "success",
  "content": "Duong Hieu Phan's HomePage About Me Since 2020, I have been a professor at Telecom Paris, Institut Polytechnique de Paris, and the Head of the Cybersecurity-Cryptography team. I am also a collaborator with the CASCADE team at ENS. I obtained a Ph.D degree in Computer Science at Ecole Normale Supérieure, under the supervision of David Pointcheval, then spent 15 months as a postdoctoral researcher at University College London and 9 months as a research engineer at France Telecom R&D. From 2007 to 2015, I was an assistant/associate professor at LAGA, University of Paris 8. From 2015 to 2020, I was a professor at XLIM, University of Limoges and director of the Master 2 Maths CRYPTIS. Research Interests My research focuses on cryptography, particularly on ``provable'' security for cryptographic schemes including public-key encryption, digital signature, broadcast encryption, and traitor tracing. Recently, I have worked extensively on functional encryption, decentralized and privacy-preserving cryptosystems, and new paradigms to protect privacy in unconventional scenarios such as anamorphic cryptography. My publications can be found on my research page. Teaching Activities My teaching activities include a range of courses from undergraduate to master's level, covering topics such as algebra, algorithms, advanced cryptography, computability and complexity. Additionally, I manage and coordinate master's programs, focusing on cryptography and mathematics applications, and supervise research initiation projects for students. I have served as a member of the Steering Committee and the Studies Committee for the MPRI - Parisian Master of Research in Computer Science. For more details, please visit my teaching page. Professional Activities I will/was in the (selected) program committees of: IACR EUROCRYPT 2026, SCN 2024 (as Program Chair), IACR EUROCRYPT 2024, IACR ASIACRYPT 2023 (as Area Chair), IACR ASIACRYPT 2022, ACM ASIACCS 2022, IACR ASIACRYPT 2021, ACM ASIACCS 2021, IACR ASIACRYPT 2020, ACISP 2019, IACR ASIACRYPT 2019, Journée Codage & Cryptographie '18, ACISP '18, ISC '17, IACR ASIACRYPT '14, IACR PKC '10, IACR EUROCRYPT '09, ISC '09, Vietcrypt '06. I'm a member of the 2025 Editorial Board of the IACR CIC Journal.. I have been a member of IACR ASIACRYPT's Steering Committee since 2013, of IACR PKC's Steering Committee since 2025 and was a member of IACR BoD 2015-2016, as a General co-Chair for ASIACRYPT '16 in Hanoi, Vietnam. I am very enthusiastic about scientific cooperation between Vietnam and France and am involved in the CNRS IRL France–Vietnam in Mathematics and its Applications as a member of the steering committee. IACR/ACM Events in Vietnam ACM ASIACCS 2025 YCF 2025 IACR Crypto Summer School '22 IACR ASIACRYPT '16 IACR Crypto Winter School '16 If you visit Hanoi, you might find some interesting suggestions from “What to do in Hanoi”.",
  "content_length": 2896,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:12"
}