{
  "name": "Duri Long",
  "homepage": "https://www.durilong.com",
  "status": "success",
  "content": "Duri Long Menu I am an Assistant Professor Communication Studies and Computer Science (by courtesy) at Northwestern University, where I direct the Creative Interfaces Research + Design Studio. My research agenda supports public agency and critical decision-making surrounding AI, investigates how AI is affecting human creativity and creative agency, and explores how to design human-centered AI systems in collaboration with creative practitioners. I synthesize common themes across the design artifacts I create to build theory about how to foster AI literacy and creative agency. My research has contributed to the fields of human-computer interaction, learning sciences, design, collaborative computing, and creativity and computation. I strive to produce outputs that have impact beyond the academy, including museum exhibits that have collectively reached thousands of people and freely available educational resources such as my AI Unplugged textbook.I received my PhD in Human Centered Computing from Georgia Tech with a specialization in Learning Sciences and Technology and a minor in Design Research. I completed my undergraduate studies at UNC Chapel Hill, where I received a BS in Computer Science with a second major in Dramatic Art.In my free time, I love to cook, visit museums, garden, and spend time with my family, friends, and 19 year old puggle. I also love to read—I participate in the Evanston Public Library’s Mission Impossible book club, and I co-host a podcast called Pynchon Pals where we read and discuss the works of postmodern American author Thomas Pynchon. I am not currently accepting PhD students during the 2025-2026 admissions cycle and am not able to respond to email inquiries from prospective PhD students. I encourage prospective students to explore other faculty who advise in Northwestern's Media, Technology, and Society (MTS), Technology and Social Behavior (TSB), and Computer Science PhD programs.",
  "content_length": 1944,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:11"
}