{
  "name": "Dusko Pavlovic",
  "homepage": "http://dusko.org",
  "status": "success",
  "content": "dusko pavlovic thanks for visiting. sorry about the mess. behind the tabs above are most of my papers and some slides. on the right are links to the recordings of some recent talks. the publication details for the papers are in this BibTeX base. my book: Programs as diagrams: From categorical computability to computable categories (There is also a draft on arxiv, without the stories, the workouts, or the final sections.) some recent papers: Language processing in humans and computers – abstract From Gödel’s Incompleteness Theorem to the completeness of bot religions (with Temra Pavlovic) – abstract Tight limits and completions from Dedekind-MacNeille to Lambek-Isbell (with Dominic Hughes) – abstract The nucleus: Mining concepts from adjunctions (with Dominic Hughes) – abstract Privacy protocols (with Jason Castiglione and Peter-Michael Seidel) – abstract Probabilistic annotations for protocol models – abstract Lambek pregroups are Frobenius spiders in preorders – abstract From process-propositions-as-types to categorified real numbers and monoidal computers – abstract Logic of fusion – abstract some old web pages with older stuff which i didn’t transfer: at Kestrel Institute (1999-2009) at Oxford University (2008-2012) Cloudfactory (up to 2006) Talks and posts: January-May 2024: Language processing in humans and computers – A Medium series Who are chatbots (and what are they to you)? Appendix: Four elephants in a room with chatbots Syntax: The Language Form Semantics: The Meaning of Language Language as a universal learning machine April 2023: Program-closed categories (video) at The New York City Category Theory Seminar. May 2022: Why do syntactic processes in our heads and quantum processes in nuclear bombs obey the same laws of cups and caps? (video) at Quantum Natural Language Processing 2022, Oxford UK. November 2021: Geometry of computation and string-diagram programming in a monoidal computer (video) at The New York City Category Theory Seminar.",
  "content_length": 1986,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:15"
}