{
  "name": "E. J. Yannakoudakis",
  "homepage": "http://www.aueb.gr/Users/yannakoudakis/english",
  "status": "success",
  "content": "EMMANUEL J EMMANUEL J. YANNAKOUDAKIS (BRIEF CURRICULLUM VITAE) Athens University of Economics & Business Department of Informatics Patission 76, Athens 10434, Greece Tel. +30.210.8214145, +30.210.8203355, Fax. +30.210.8203356 E-mail: eyan@aueb.gr Emeritus Professor of Computer Science at the Department of Informatics of the Athens University of Economics & Business. Studied Computer Science and obtained his Ph.D. (1979) in Computer Science from the University of Bradford England, where he worked as Tutor of Computer Science (1975-1978), and as Lecturer/ Senior Lecturer/ Professor at both Undergraduate and Postgraduate Levels (1978-1989). In 1989 he was appointed Professor of Computer Science at the Athens University of Economics and Business. He is Fellow of the British Computer Society (FBCS), Chartered Engineer (C.Eng.), Chartered Information Technology Professional (CITP). Has taught several subjects, including database design & management at the Athens University of Economics & Business, and advanced psychometric databases at the Athens University (Postgraduate School of Cognitive Sciences). The subjects taught and his interests are the following: Artificial Intelligence, Expert Systems Artificial Intelligence & Psychocybernetics Man-Machine Interfaces Speech Synthesis & Recognition Systems Psychometric Databases, Design of Psychometric Tests Database Management Systems, Database Design Design of Information Systems Data Structures Software Engineering, Advanced programming techniques Fundamentals of Computer Science Current & Future Generations of ComputersConsultant of the European Union since 1982, Associate Editor/Referee for several international journals including ACM, IEEE-PAMI, IEEE-ASSP, JASIS, Computer Journal, Prentice-Hall Publications, J. Wiley Publications, Butterworth Press, Pergamon Press, etc., External examiner for several Ph.D. candidates throughout Europe and Africa. Has served as adviser to the Greek Minister of Research and Technology (1982-83), adviser to the Greek Minister of Education (1988-1989), adviser to the National Library of Greece (1989-1991), Member of the Committee on Terminology of the Greek Ministry of Development  Research & Technology (1990-1992), Member of the Greek Parliamentarian Committees on: a) cash registers, and b) customhouse computerization (1996-1998), Project Leader for the establishment of a Greek National Guidance Resources Centre within the framework of the E.U. Program PETRA (1993-1995), Member of the Supervisory Committee of the Integrated Information System of the Greek Ministry of Economics and Project Leader (2002-2004). Has served as member of the Committee for National University Entrance Examinations (2006  2011). Has acted as computer consultant and adviser to the following Presidents of the Hellenic Republic: K. Karamanlis, C. Sartzetakis, K. Stephanopoulos. Has collaborated with renown scientists in his fields, including Edsger Dijkstra (Computing), Benoit Mandelbrot (Mathematics), and John Holland (Psychometrics).Some of the posts he has held are the following: Founder member and first President of Bradford University Computer Society, U.K. (1976-1978), Warden of Shearbridge Hall, U.K. (1979-1985), Member of the Court of the University of Bradford, U.K. (1987-1989), Consultant and Expert adviser for the European Union (since 1982), Consultant for the British Home Office - GMD System (1979-1982), Consultant for the Department of Trade and Industry, U.K. (1980-1985), Consultant for WIRA, U.K. (1979-1983), Member of the Inter University Computing Committee, U.K. on Computer Science Curricula (1980-1982), Consultant and Referee for the British Library (1979-1989), Member of the British Standards Institute: Committee OIS/121 on Programming Languages & Database Management Systems (1984-1987) - The Committee had close links with the equivalent ISO (International Standards Organization) Committee ISO/TC/97/SC/5, Elected Member of the Branches Board of the British Computer Society (1983-1986), Examinations Adviser of the British Computer Society, Part II, Method II (1985-1989), Academic Representative of the British Computer Society at Bradford University (1985-1989), Member of the Training Committee, Institute of Management Information Systems, U.K. (1984-1988), President of the West Yorkshire Branch of the British Computer Society (1986-1987), Chairman and Program Coordinator of the 6th, 7th, and 8th British Computer Society Research Colloquium on Information Retrieval (1984-1986), Member of the Committee of the Information Retrieval Specialist Group of the British Computer Society (1982-1987), Associate Editor of the journal Information Technology (1983-1986), Chairman of the West Yorkshire Branch of the Institute of Management Information Systems (1982-1987), Visiting Professor, Department of Computer Science, University of Crete, Greece (1983), Elected Member of the Board of Studies in Natural and Applied Sciences, University of Bradford, U.K. (1984-1989), Elected Secretary of the British Computer Society, West Yorkshire Branch (1984-1986), Instigator, Chairman and Program Coordinator of the 1st, 2nd, and 3rd British Computer Society Computing Challenge (1985-1987), Member of the Liaison (Advisory) Committee of the Department of Information Studies, University of Sheffield (1987-1989), Coordinator of the Interdisciplinary Information Research Unit of Bradford University, U.K. (1986-1989), Joint organizer of the 1st Interdisciplinary Information Technology Conference of Bradford University, U.K. (1988), Member of the Greek Chancellors' Committee on European Affairs (1992-1994), Member of several Conference Program Committees of the ACM Special Interest Group on Information Retrieval since 1993, Chairman of the 2nd Hellenic conference on Computer Education of the Greek Ministry of Education (1995), Member of the Board of the Greek Chapter of the friends (IFBA) of Bibliotheca Alexandrina (UNESCO) (1998-) and a) Secretary (2000-2013), b) Secretary-General (2013-2020), c) Vice-President & Secretary General (2020-), c) Vice-President (2020-), Chairman of the 23rd International ACM Conference on Information Retrieval (2000), Member of the Program Committee of the 6th International Conference on Integrated Information, September 19-22, 2016, Athens, Greece.At the Athens University of Economics and Business he was the instigator ïf the establishment of Postgraduate Studies and Director of the Postgraduate Degree in Informatics (1993) and Postdoctoral Research in Computer Science (1997), and has served as: Chairman of the Computer Centre (1990-1993), Head of the Library (1991-2009), Chairman of Postgraduate Studies (1993-1996), Chairman of the Department of Informatics and member of Senate (1997-2001), Deputy Head of the Department of Informatics and Member of Senate (1991-1993), Member of the Research Committee (1992-1996), Director of the Information & Database Systems Research Group (2004-2007), Vice President of the Research Centre of the University (2006-2010), Member of the Disciplinary Committee (2013-2018), Visiting Professor of the Greek Police Academy (2011-2018), Vice Chairman of the Advisory Committee on Technology of the Greek Ministry of Administrative Reform and e-Government (2013-2015), Member of the Committee for the resolution of disputes (2012-2018) and Chairman of the Committee (2015), In charge of the examination of students with special educational needs (2015-2018), In charge of the examination of students held in state prisons (2016-2018), In charge of the organisation of research seminars for Ph.D. candidates (2016-2018).Has carried out numerous sponsored research studies and has designed major information systems for several organizations throughout Europe, including The European Union, Department of Education - U.K., Department of Trade and Industry - U.K., The British Library, WIRA Research Association - U.K., The Greek Ministry of Development, The Greek National Research Centre Democritus, The Greek Ministry of Finance, etc. The information systems designed cover a wide variety of industrial applications, such as information and library retrieval, psychometric testing, job evaluation, vocational guidance, expert motion-time study, real estate management, hospital databases, statistical analyses, info-metrics, text analyses, etc. Has supervised hundreds of Undergraduate and M.Sc. projects, and 25 Ph.D. projects.Has published 140 papers at International Journals and Conference Proceedings, and 20 Books, some of which are with International publishers, including The Architectural Logic of Database Systems, Springer-Verlag, ISBN 3-540-19513-0, 0-387-19513-0, 1988, Standard Relational and Network Database Languages (with Cheng, C. P.), Springer-Verlag, ISBN 3-540-19537-8, 0-387-19537-8, 1988; 7-5062-0750-8, 1991, Speech Synthesis and Recognition Systems (with Hutton, P. J.), Ellis Horwood - J. Wiley, ISBN 0-470- 20959, 0-7458-0314-8, 1987. He was one of the first programmers to implement psychometric testing back in 1974. A.  Books and Monographs Yannakoudakis E. J., The GMD DATABASE: A hierarchical database model for work-study data, WIRA Research Association, Leeds, 1980. Ayres F. H., Ellis D., Huggill J. A. W. & Yannakoudakis E. J., The Universal Standard Book Code - Its Development and Use as a Method of Bibliographic Record Control, British Library R & D Department, London, June 1983, ISBN 0-901945-56-0 (Review In: Program, Vol. 19, No. 4, pp. 391-394, 1985). Ayres F. H., Ellis D., Huggill J. A. W. & Yannakoudakis E. J., Coding for Union File Creation: A National Database, British Library Bibliographic Services Division, London, April 1984, ISBN 0-7123-1020-7 (Review In: Program, Vol. 19, No. 4, pp. 391-394, 1985). Ayres F. H., Ellis D., Huggill J. A. W., Millson D. R. & Yannakoudakis E. J., DOCMATCH-1: Electronic document delivery - IX - The linkage between bibliographic and full text databases, Commission of the European ",
  "content_length": 44924,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:21"
}