{
  "name": "Eamonn O'Neill",
  "homepage": "http://www.bath.ac.uk/comp-sci/contacts/academics/eamonn_oneill",
  "status": "success",
  "content": "Eamonn O'Neill - the University of Bath's research portal View Scopus Profile Eamonn O'Neill Prof Head of Department, Department of Computer ScienceUKRI CDT in Accountable, Responsible and Transparent AICentre for the Analysis of Motion, Entertainment Research & ApplicationsCentre for Networks and Collective BehaviourCentre for Doctoral Training in Decarbonisation of the Built Environment (dCarb)REal and Virtual Environments Augmentation Labs (REVEAL)Bath Institute for the Augmented HumanHuman-Computer Interaction https://orcid.org/0000-0002-1637-458X Phone+44 (0) 1225 383216EmailE.ONeillbath.acuk 1 WEST 4.57 Personal profile Research interestsMy main research interests are in developing, evaluating and understanding innovative forms of human-technology interaction and technology-mediated human-human interaction. Topics include mixed, augmented and virtual reality, and interaction with intelligent machines and software. My research has the overarching goal of contributing to an applied science of interactive systems. This involves deriving design principles for the development of such systems that are theoretically well-founded, empirically tested and operationalised for people’s use. This research covers the spectrum of technological, cognitive and social challenges and opportunities that these systems offer. Fingerprint Dive into the research topics where Eamonn O'Neill is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Virtual Reality Computer Science 100% Virtual Environments Computer Science 69% Mobile Device Computer Science 55% Augmented Reality Computer Science 54% User Performance Computer Science 52% Interactive Computer Science 50% Exergames Psychology 50% tactile display Computer Science 39% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects 14 Finished Projects per year EMIL: The European Media and Immersion Lab (Former EU Project)Lutteroth, C. (PI), Campbell, N. (CoI), Clarke, C. (CoI), Jicol, C. (CoI), O'Neill, E. (CoI) & Sharma, A. (CoI)Innovate UK, Innovate UK Business Connect1/09/22 → 30/06/25Project: EU Commission Contact Network 100% Physical Infrastructure 100% Embodied Interaction 100% Augmented Reality 100% Creative Industry 100% Centre for the Analysis of Motion, Entertainment Research and Applications (CAMERA) - 2.0Campbell, N. (PI), Cosker, D. (PI), Bilzon, J. (CoI), Campbell, N. (CoI), Cazzola, D. (CoI), Colyer, S. (CoI), Cosker, D. (CoI), Lutteroth, C. (CoI), McGuigan, P. (CoI), O'Neill, E. (CoI), Petrini, K. (CoI), Proulx, M. (CoI) & Yang, Y. (CoI)Engineering and Physical Sciences Research Council1/11/20 → 31/10/25Project: Research council Virtual Reality 100% Deep Learning Method 52% Reaction Force 42% Motion Capture 38% Joints (Structural Components) 34% CAMERA MC2 AwardCosker, D. (PI), Campbell, N. (CoI), Fincham Haines, T. (CoI), Hall, P. (CoI), Li, W. (CoI), Lutteroth, C. (CoI), O'Neill, E. (CoI), Richardt, C. (CoI), Yang, Y. (CoI) & Parsons, M. (Researcher)EU - Horizon 20202/12/19 → 31/03/23Project: EU Commission Generative Adversarial Networks 100% Intrinsic Structure 80% Face Detection 80% Image Synthesis 80% Deep Learning Method 80% UNREST: Unsettling Heritage, Modes of Remembering and Social Cohesion in EuropeO'Neill, E. (PI)EU - Horizon 20201/04/16 → 31/03/19Project: EU Commission Europe 100% Remembering 100% Social Cohesion 100% Cosmopolitan 40% Transnational 20% Centre for the Analysis of Motion, Entertainment Research and Applications (CAMERA)Cosker, D. (PI), Bilzon, J. (CoI), Campbell, N. (CoI), Cazzola, D. (CoI), Colyer, S. (CoI), Fincham Haines, T. (CoI), Hall, P. (CoI), Kim, K. I. (CoI), Lutteroth, C. (CoI), McGuigan, P. (CoI), O'Neill, E. (CoI), Richardt, C. (CoI), Salo, A. (CoI), Seminati, E. (CoI), Tabor, A. (CoI) & Yang, Y. (CoI)Engineering and Physical Sciences Research Council1/09/15 → 28/02/21Project: Research council Virtual Reality 100% Reaction Force 57% Motion Capture 48% Deep Learning Method 42% Spinal Cord Injury 40% View all 14 projects Research output 37 Book chapter 35 Paper 34 Chapter in a published conference proceeding 26 Article 17 More 3 Book 3 Other 2 Other chapter contribution 2 Poster 2 Review article 1 Other report 1 Abstract 1 Meeting abstract 1 Web publication/site 1 Preprint Research output per year Research output per year Estimating Knee Joint Angles During Cycling Using Deep Learning and Wearable SensorsFenney, E., Morgan, K., Carter, J., Sheehy, Z., Jicol, C. & O'Neill, E., 27 Jul 2025. 1 p.Research output: Contribution to conference › Paper › peer-review Open AccessFile Long Short-Term Memory 100% Deep Learning Method 100% Long Short-Term Memory Network 100% Measurement Unit 100% 21 Downloads (Pure) The AI of the Beholder: Experience of Healthcare AI Robots is Shaped by User-Centred Factors, Not Their Visual AppearanceYoon, J., Zajac, P., Pococke, L., Jicol, A., Clarke, C., O'Neill, E., Petrini, K., Lutteroth, C. & Jicol, C., 17 Oct 2025, In: IEEE Transactions on Visualization and Computer Graphics. 31, 11, p. 9910-9920 11 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Robot 100% Visual Appearance 100% Artificial Intelligence 100% Situational Context 25% Medical Consultation 12% Improving inner speech decoding by hybridisation of bimodal EEG and fMRI dataWellington, S., Wilson, H., Liwicki, F. S., Gupta, V., Saini, R., De, K., Abid, N., Rakesh, S., Eriksson, J., Watts, O., Chen, X., Coyle, D., Golbabaee, M., Proulx, M. J., Liwicki, M., O'Neill, E. & Metcalfe, B., 17 Dec 2024, 46th Annual International Conference of the IEEE Engineering in Medicine and Biology Society, EMBC 2024 - Proceedings. U. S. A.: IEEE, 5 p. (Proceedings of the Annual International Conference of the IEEE Engineering in Medicine and Biology Society, EMBS).Research output: Chapter or section in a book/report/conference proceeding › Chapter in a published conference proceeding Data Fusion 100% Classification Task 100% Processing Strategy 100% Decoding Performance 100% Probability Vector 100% 1 Citation (SciVal) Real-time feedback improves imagined 3D primitive object classification from EEGKorik, A., Du Bois, N., Campbell, G., O'Neill, E., Hay, L., Gilbert, S., Grealy, M. & Coyle, D., 31 Dec 2024, In: Brain-Computer Interfaces. 11, 1-2, p. 61-85 25 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Realtime 100% Primitive 100% Electroencephalography 100% Real-Time Feedback 100% Brain-Computer Interface 42% 2 Citations (SciVal) 556 Downloads (Pure) Regulating AI: Applying Insights from Behavioural Economics and Psychology to the Application of Article 5 of the EU AI ActZhong, H., O'Neill, E. & Hoffmann, J., 25 Mar 2024, Proceedings of the AAAI Conference on Artificial Intelligence. 18 ed. Washington DC: AAAI Press, Vol. 38. p. 20001-20009 9 p. (Proceedings of the AAAI Conference on Artificial Intelligence).Research output: Chapter or section in a book/report/conference proceeding › Chapter in a published conference proceeding Open AccessFile Behavioral Economics 100% Behavioral Psychology 100% Artificial Intelligence Act 100% Artificial Intelligence 100% Legislation 16% 3 Citations (SciVal) 335 Downloads (Pure) View all 149 research outputs Datasets Dataset for 'How smart do smart meters need to be?'Mogles, N. (Creator), Walker, I. (Creator), Ramallo-González, A. (Creator), Lee, J. (Creator), Natarajan, S. (Creator), Padget, J. (Creator), Gabe-Thomas, E. (Creator), Hyniewska, S. (Creator), Lovett, T. (Creator), Ren, G. (Creator), O'Neill, E. (Creator), Hourizi, R. (Creator) & Coley, D. (Creator), University of Bath, 1 Oct 2016DOI: 10.15125/BATH-00256Dataset Datasets and Analyses for \"Affect Recognition using Psychophysiological Correlates in High Intensity VR Exergaming\"Barathi, S. C. (Creator), Proulx, M. (Creator), O'Neill, E. (Creator) & Lutteroth, C. (Creator), University of Bath, 15 Jan 2020DOI: 10.15125/BATH-00758Dataset Supplement for \"Me vs. Super(wo)man: Effects of Customization and Identification in a VR Exergame\"Jeffery, Z. (Creator), Koulouris, J. (Creator), Best, J. (Creator), Lutteroth, C. (Creator) & O'Neill, E. (Creator), University of Bath, 15 Jan 2020DOI: 10.15125/BATH-00757Dataset",
  "content_length": 8586,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:21"
}