{
  "name": "Eamonn O. Nuallain",
  "homepage": "https://www.tcd.ie/research/profiles/?profile=ONUALLAE",
  "status": "success",
  "content": "Éamonn Ó Nualláin'Trinity Research - Trinity College Dublin Dr. Éamonn Ó Nualláin Assistant Professor, Computer Science eamonn.onuallain@tcd.ie +353 1896 3691 people.tcd.ie/onuallae Publications and Further Research Outputs Peer-Reviewed Publications Non-Peer-Reviewed Publications Peer-Reviewed Publications Eamonn Kenny and Eamonn O Nuallain, Wireless Indoor Resource Optimisation meeting Prescribed UserCapacity Requirements, IEEE Transactions on Antennas and Propagation, 66, (5), 2018, p2557 - 2568 Journal Article, 2018 TARA - Full Text DOI URL Eamonn Kenny, Eamonn O'Nuallain, Convex Space Building Discretization for Ray-Tracing, IEEE Transactions on Antennas and Propagation, 65, (5), 2017, p2578 - 2591 Journal Article, 2017 DOI TARA - Full Text Gregor Gaertner and Eamonn O Nuallain, Link Quality Prediction for 802.11 MANETs in Urban Microcells, Journal of Computer and Communications, 4, (13), 2016, p61 - 77 Journal Article, 2016 Eamonn ONuallain, Real-Time Propagation Modelling for Cognitive Radio, National Wireless Research Symposium, Arlington, Virginia, 12-13 March, 2015, NSF, University of Idaho Invited Talk, 2015 H. Tewari and E. ONuallain, Netcoin - A Traceable P2P Electronic Cash System, IEEE International Conference on Web Services (ICWS), New York, 27th June 2015, 2015, pp472 - 478 Conference Paper, 2015 DOI URL TARA - Full Text J Delaney, E. Kenny, E O Nuallain, A Parallel Implementation of the Electric Field Integral Equation for an Arbitrary Terrain Profile, IEEE Conference on Electromagnetic Field Computation, Annecy, France, May 25-28, 2014, 2014, pp1 - 1 Conference Paper, 2014 TARA - Full Text Eamonn O Nuallain, Christopher Anderson, Real-Time Radio Environment Mapping for Cognitive Radio, National Wireless Research Collaboration Symposium (NWRCS), Idaho Falls, Idaho, USA, 15-16 May, 2014, pp1 - 5 Conference Paper, 2014 DOI S. Mc Gonigle, Q. Wang, M. Wang, Adam Taylor, E. O Nuallain, Reputation-Based Trust Management for Distributed Spectrum Sensing, Networks and Communications (NetCom2013) Proceedings of the Fifth International Conference on Networks & Communications Series: Lecture Notes in Electrical Engineering, 284, (ISBN 978-3-319-03691), 2014, p255 - 264 Journal Article, 2014 DOI F. Rhinow, P. Veloso, C. Puyelo, S. Barrett, E. O Nuallain, P2P Live Video Streaming in WebRTC, 2014 World Congress on Computer Applications and Information Systems, Hammamet, Tunisia, January 17-19, edited by Nejmeddine Tagoug , 2014, pp1 - 5 Conference Paper, 2014 DOI Eamonn Kenny, Eamonn O'Nuallain, A Convex-Space Discretization of a Building, Designed for Indoor Resource Optimisation using Ray-Tracing Techniques, IEEE Conference on Electromagnetic Field Computation, Annecy, France, 25th-28th May 2014, 2014, pp1 - 1 Conference Paper, 2014 TARA - Full Text Eamonn Kenny, Eamonn O'Nuallain, An Indoor Resource Optimisation using Ray-Tracing Techniques and Signal-To-Interference Object Function to Obtain Best Capacity, IEEE Conference on Electromagnetic Field Computation, Annecy, France, 25th-28th May 2014, 2014, pp1 - 1 Conference Paper, 2014 TARA - Full Text Link Quality Prediction for Mobile Ad-Hoc Networks in, editor(s)Samuel Chang , Foundation of Cognitive Radio Systems, Intech, 2012, pp61 - 94, [Gregor Gaertner and Eamonn O Nuallain] Book Chapter, 2012 Eamonn O Nuallain, 1st International Conference on Wireless Technologies for Humanitarian Relief, Kerala, India, Dec. 2011, 2011, 155-155pp Invited Talk, 2011 URL DOI Eamonn O Nuallain, Propagation Modelling Using Integral Equation Methods to Enable Co-existence and Address Physical Layer Security Issues in Cognitive Radio, International Journal of Communications Networks and System Sciences, 4, (3), 2011, p139 - 146 Journal Article, 2011 Eamonn O'Nuallain, A Proposed Propagation-based Methodology with which to address the Hidden Node Problem and Security/Reliability Issues in Cognitive Radio , WiCOM , Dalian, China, Oct 2008, 2008, pp1 - 5 Conference Paper, 2008 DOI Gregor Gaertner, Eamonn O'Nuallain, Vinny Cahill, Extending Wireless Network Simulators to Support Realistic Simulations of 802.11 MANETs , WiCOM 2008, Dalain, China, 12-14 Oct, 2008, pp1 - 5 Conference Paper, 2008 DOI Eamonn O'Nuallain, Propagation Issues in Cognitive radio, CISDR 2008 Workshop, Maynooth, Ireland, May 12-13, 2008, CTVR Invited Talk, 2008 Gregor Gaertner, Eamonn O Nuallain, , Using The Rice and Nakagami Distributions to Characterize Wideband Small-Scale Fading in Urban Microcells, IEEE Trans. Veh. Tech., 56, (6), 2007, p3621 - 3630 Journal Article, 2007 DOI Eamonn O Nuallain, An Efficient Integral Equation-Based Propagation Model, IEEE Trans. Ant. Prop, 53, 2005, p1836 - 1841 Journal Article, 2005 DOI Eamonn O Nuallain, 'Propagation Over Irregular Dielectric Terrain - An Integral Equation Approach', IEEE Conference on Information and Communication Technologies: From Theory to Applications, Damascus, Syria, 2004, 2004, pp249 - 250 Conference Paper, 2004 DOI Eamonn O Nuallain, An Improved Method to Evaluate the Slow Fading Signal over Electrically Massive Scatterers, IEEE Int. Symp. Ant. Prop., Monterey, CA, USA, 2004, 2004, pp4451 - 4454 Conference Paper, 2004 DOI Gregor Gaertner, Eamonn O Nuallain, Andrew Butterly, Kulpreet Singh, Vinny Cahill, 802.11 Link Quality and its Prediction - An Experimental Study, Lecture Notes in Computer Science, Springer Verlag , 2004, p147 - 163 Journal Article, 2004 DOI Eamonn O Nuallain, The Field Extrapolation Method to Estimate Coverage Over Terrain\",, URSI Int. Symp., Malvern, UK, Dec. 2001, 2001 Meeting Abstract, 2001 Non-Peer-Reviewed Publications Ka Lung Ng, Hiu Ying Pun, Aastha Sharma, Stefan Weber, Eamonn O' Nuallain,, The Impact of Controller Placement in an Open Flow Wide Area Network, Journal of Information Sciences and Computing Technologies, 7, (2), 2018, p683 - 692 Journal Article, 2018 Yueming Zheng, Ying Wang, Mingda Rui, Andrei Palade, Shane Sheehan, Eamonn O' Nuallain, Performance Evaluation of HTTP/2 over TLS+TCP and HTTP/2 over QUIC in a Mobile Network, Journal of Information Sciences and Computing Technologies, 7, (1), 2018, p673 - 682 Journal Article, 2018 Manas Marawaha, Pradeep Jha, Rohan Razdan, Jonathan Dukes, Shane Sheehan, Eamonn O' Nuallain, Performance Evaluation of Bluetooth Low Energy Communication, Journal of Information Sciences and Computing Technologies, 7, (2), 2018, p718 - 725 Journal Article, 2018 Rohit P. Tahiliani, Sagar Sachdeva, Sachin Hadke, Shane Sheehan, Eamonn O' Nuallain, Evaluation of Random Early Detection and Adaptive Random Early Detection in Benchmark Scenarios, Journal of Information Sciences and Computing Technologies, 7, (1), 2018, p667 - 672 Journal Article, 2018 Research Expertise Projects Keywords Projects Title An Accurate Modelling Tool for Wireless Broadband Network design Funding Agency Enterprise Ireland Keywords Broadband Technologies; Communication engineering, technology; Communication Sciences; Communications engineering; High frequency technology, microwaves; Mobile Communications; Modelling, modelling tools, 3D modelling; Networks and telecommunications research; Numerical analysis; Remote sensing; Signal processing; Telecommunication Engineering; Telecommunications; Telecommunications and transport; Wireless systems, Radio technology Trinity Website Feedback",
  "content_length": 7328,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:21"
}