{
  "name": "Earlence Fernandes",
  "homepage": "http://earlence.com",
  "status": "success",
  "content": "HomePage | Earlence Fernandes I'm an Assistant Professor at the University of California, San Diego in the Computer Science and Engineering department. My goal is to enable society to gain the benefits of emerging technologies without the security and privacy risks. I have received two best paper awards (at IEEE S&P and IEEE SecDev), the NSF CAREER award, and research awards from Facebook, Amazon and Google. My work has been featured in Wired, The Verge, Ars Technica, Science Magazine and Nature. It is also on display at the Science Museum in London (One of the experimental artifacts is now part of the Science Museum's permanent collection). I earned my Ph.D. in Computer Science and Engineering at the University of Michigan in 2017 where I was advised by Prof. Atul Prakash. Before coming to UC San Diego, I spent three excellent years at the University of Wisconsin-Madison. Email Me Download CV Google Scholar Selected publications Fun-tuning: Characterizing the Vulnerability of Proprietary LLMs to Optimization-based Prompt Injection Attacks via the Fine-Tuning Interface Andrey Labunets, Nishit Pandya, Ashish Hooda, Xiaohan Fu, Earlence Fernandes 46th IEEE Symposium on Security and Privacy, San Francisco, CA, May 2025. Impact and OutreachWebsite with demos, Ars Technica, Android Authority Imprompter: Tricking LLM Agents into Improper Tool Use Xiaohan Fu, Shuheng Li, Zihan Wang, Yihao Liu, Rajesh K. Gupta, Taylor Berg-Kirkpatrick, Earlence Fernandes arXiv preprint 2410.14923, Oct 2024. Impact and Outreach Website with demos, WIRED, IEEE Spectrum, Simon Willison's Blog, Mistral's Fix Confirmation (see Sep 13, 2024 entry) Stateful Least Privilege Authorization for the Cloud Leo Cao, Luoxi Meng, Deian Stefan, Earlence Fernandes 33rd USENIX Security Symposium, Philadelphia, PA, Aug 2024 MakeShift: Security Analysis of Shimano Di2 Wireless Gear Shifting in Bicycles Maryam Motallebighomi, Earlence Fernandes, Aanjhan Ranganathan. USENIX WOOT Conference on Offensive Technologies (WOOT), Philadelphia, PA, Aug 2024 Impact and Outreach WIRED, Escape Collective, The Verge, Schneier on Security, Gizmodo, GCN, Ars Technica, Jalopnik, Road.cc, Cycling Weekly, Cycling News, IT Brew, Kaspersky, Forbes, Shane Miller - GPLama - On the Difficulty of updating the shifters, HackRF User Reproduced the Attack, KPBS TV Interview Robust Physical-World Attacks on Deep Learning Visual Classification Kevin Eykholt, Ivan Evtimov, Earlence Fernandes, Bo Li, Amir Rahmati, Chaowei Xiao, Atul Prakash,Tadayoshi Kohno, Dawn Song Computer Vision and Pattern Recognition (CVPR 2018), Salt Lake City, UT (supersedes arXiv:1707.08945), June 2018 Acceptance Rate: 29.6% Impact and Outreach IEEE Spectrum, Yahoo News, Wired, Engagdet, Telegraph, Car and Driver, CNET, Digital Trends, SCMagazine, Schneier on Security, Ars Technica, Fortune, Science Magazine, Nature Security Analysis of Emerging Smart Home Applications Distinguished Practical Paper Award Earlence Fernandes, Jaeyeon Jung, Atul Prakash 37th IEEE Symposium on Security and Privacy (S&P 2016), San Jose, May 2016 Acceptance Rate: 13.3% Impact and Outreach WIRED, Schneier on Security, The Verge, Gizmodo, Ars Technica, CNET, Mashable, Detroit Free Press, ... See All The Publications Students Andrey Labunets (current, PhD) Luoxi Meng (current, PhD) Nishit Pandya (current, PhD) Xiaohan Fu (co-advised w/ Rajesh Gupta, PhD) Leo Cao (MS 2024) -> PhD Student at UW Madison Yunang Chen (PhD 2023) -> Google Ashish Hooda (MS 2021) -> PhD student at UW Madison Luna Sayles (MS 2021) Jon Sharp (MS 2020) -> Amazon Tyler Gu (BS 2021) -> PhD student at UIUC Ruizhe Wang (BS 2021) -> PhD student at Univ. of Waterloo Awards Google Research Scholar Award 2024 Amazon Research Award 2022 NSF CAREER 2022 Facebook Research Award 2021 IEEE SecDev Best Research Paper Award 2018 IEEE S&P Distinguished Practical Paper Award 2016 Books Instant Android Systems Development Earlence Fernandes Packt Publishers UK, 2013",
  "content_length": 3967,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:22"
}