{
  "name": "Eckhard Grass",
  "homepage": "https://www.informatik.hu-berlin.de/de/forschung/gebiete/bbk/modul-bbk",
  "status": "success",
  "content": "Modul: Drahtlose Breitbandkommunikationssysteme (Vorlesung & Praktikum) — Drahtlose Breitbandkommunikations-systemeMehr KontrastWeniger Kontrast Direkt zum InhaltDirekt zur SucheDirekt zur Navigation Mathematisch-Naturwissenschaftliche Fakultät Institut für Informatik Drahtlose Breitbandkommunikations-systeme Mathematisch-Naturwissenschaftliche Fakultät Institut für Informatik Drahtlose Breitbandkommunikations-systeme Navigation « Dezember 2025 » month-12 Mo Di Mi Do Fr Sa So 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 1 2 3 4 Termine Promotionsvortrag: Niklas Giesa 01.12.2025 Disputation: Frau Parmida Geranmayeh, M.Sc. 10.12.2025 Disputation: Herr Pascal Sebastian Kunz, M.Sc. 12.12.2025 Promotionsvortrag Fabian Lehmann 18.12.2025 Termine - More… Impressum Für Studieninteressierte Für Studierende Für Promovierende Frauenförderung Für Beschäftigte Mitarbeiter:innen Frauenförderung Berufliche Weiterbildung FAQs E-Mails HUMBOLDT INTERN Humboldt-Universität zu Berlin - Mathematisch-Naturwissenschaftliche Fakultät - Drahtlose Breitbandkommunikations-systeme (Wireless Broadband Communication Systems) Dozenten: Prof. E. Graß (HU/IHP) Das Modul läuft im Wintersemester 2025/26 in Präsenz! Termine für das Wintersemester 2025/26 (vorläufig): Beginn der Lehrveranstaltungen im Wintersemester 2025/26: Erste Vorlesung: Freitag, 17.10.2025, 11-13 Uhr RUD 25, 3.113 (Zoom Conference) Erstes Praktikum: Freitag, 24.10.2025, 13:30 Uhr RUD 25, 3.113 & 3.212 (Einführung in MATLAB/SIMULINK - Zoom Conference) keine Lehrveranstaltungen am 26.12.2025 und 02.01.2026 (akademische Ferien) Inhalte der Veranstaltung Der rapide wachsende Anteil an multimediafähigen Smartphones und neue Applikationen sowie die Verwendung von HD- und 3D-Videoformaten führen zu einem rasanten Anstieg der Übertragungsraten drahtloser Kommunikationssysteme. Ausgehend von den Eigenschaften des drahtlosen Übertragungskanals werden Algorithmen, Architekturen und Implementierungsaspekte für Systeme mit höchsten Datenraten erörtert. Dabei wird insbesondere auf Modulationsverfahren, Kanalkodierung, Kanalentzerrung und Synchronisation in gegenwärtigen und zukünftigen Systemen eingegangen. Aktuelle Technologien wie Beamforming und MIMO Verfahren werden erläutert. Forschungsergebnisse zu neuen Mobilfunkstandards (5G/6G) werden vermittelt. Die Teilnehmer werden an den Entwurf und die Implementierung von drahtlosen Kommunikationssystemen herangeführt. Das in der Vorlesung vermittelte Wissen wird im Praktikum angewendet und an konkreten Beispielen vertieft. Voraussetzungen und Studienpunkte Das Modul ist in erster Linie für Master-Studierende gedacht. Master-Studierende belegen Vorlesung und Praktikum und erhalten bei erfolgreichem Abschluss 5 SP. Bitte nur für Praktikum über AGNES anmelden (Veranstaltungsnummer für PR: 3313052) Zur Organisation des Praktikums ist auch eine Anmeldung über Moodle notwendig - Link wird zum Modulbeginn bekanntgegeben. Der erfolgreiche Abschluss des Praktikums ist Voraussetzung für die Anmeldung zur mündlichen Modul-Abschlussprüfung Vorausgesetzte Kenntnisse: Grundkenntnisse der Signalverarbeitung (z.B. Grundlagen der Signalverarbeitung) Grundkenntnisse zu (drahtlosen) Kommunikationssystemen sind hilfreich Grundkenntnisse der Modellierung und Simulation mit MATLAB, Simulink, Labview oder ähnlichen Werkzeugen sind wünschenswert Schwerpunkte Einführung, Besonderheiten der drahtlosen Übertragung Kanaleigenschaften und Kanalmodelle Modulationsverfahren OFDM als hocheffizientes Verfahren zur drahtlosen Kommunikation Kanalkodierung und Fehlerkorrekturverfahren Synchronisation und Kanalschätzung Implementierungsaspekte & Standards für drahtlose Kommunikationssysteme 5. und 6. Generation Mobilfunk (5G / 6G) - aktuelle Entwicklungen (beyond-5G/6G) Literatur J. Schiller: Mobilkommunikation, Pearson StudiumISBN 3-8273-7060-4auch: Addison-Wesley, ISBN: 978-3-8273-1578-6 Karl Dirk Kammeyer: Nachrichtenübertragung, B.G. Teubner VerlagISBN-10:3-8351-0179-X Nuszkowski: Digitale Signalübertragung im Mobilfunk, Jörg Vogt Verlag 2010ISBN 978-3-938860-26-7 Proakis, Salehi: Grundlagen der Kommunikationstechnik, Pearson StudiumISBN 3-8273-7064-8 H. Schulze, C. Lüders: Theory and Applications of OFDM and CDMA - Wideband Wireless Communications, WILEY, 2005.ISBN: 978-0-470-85069-5 M. Bossert: Kanalcodierung, 2. Aufl., Teubner 1998ISBN 3-519-16143-5 Hanzo: Single- and Multi-carrier Quadrature Amplitude Modulation\", WILEYISBN 0-471-49239-6 Molitor : VHDL, Pearson StudiumISBN 3-8273-7047-7 WWW-Seite zur Technischen Informatikhttps://www.informatik.hu-berlin.de/de/forschung/gebiete/ti/teaching/copy_of_ws S.D. Stearns: Digitale Verarbeitung analoger Signale. München: Oldenbourg-Verlag 1991ISBN 3-486-22027-6 weitere Literatur wird in der 1. Veranstaltung bekanntgegeben. Modulbestandteile: Vorlesungen zu ausgewählten Themen der Breitbandkommunikation Kanalmodellierung Kanalkapazität (Shannon) Freiraumdämpfung, Pfadverlust und Linkbudget (Friis Gleichung) Fehlerkorrekturverfahren OFDM-Übertragung Beamforming und MIMO-Verfahren Existierende und entstehende Standards im Bereich drahtlose Übertragung (WLAN, WPAN, 5G, ...) Praktikum mit konkreten Aufgabenstellungen: Entwurf und Modellierung eines kompletten drahtlosen Übertragungssystems Simulationen in MATLAB oder SIMULINK (bevorzugt) Vertiefung zu den Prinzipien der OFDM-Übertragung Echte Funkübertragung mit Software Defined Radio (SDR) Plattform am Ende des Praktikums und Diskussion der Ergebnisse Themen der Vorlesungen (Abweichungen sind möglich): VL-1 Einführung in die Nachrichtentechnik VL-2 Kanalmodelle und Antennen VL-3 Modulationsverfahren - überblick VL-4 OFDM-Übertragung VL-5 Kanalkodierung und Fehlerkorrekturverfahren VL-6 Synchronisationsverfahren VL-7 Kanalschätzung und -Korrektur VL-8 Kanalkapazität (Shannon-Hartley-Gesetz) VL-9 Pfadverlust (Friis Transmissionsgleichung), Linkbudgetberechnung VL-10 Beamforming- und MIMO-Verfahren VL-11 MAC-Protokolle (IHP) VL-12 Implementierungsaspekte (IHP) VL-13 Lokalisierung mittels Kommunikationssystemen (HU-B) VL-14 Frequenzregulierung & Standardisierung / neue Standards VL-15 5. und 6. Generation Mobilfunk (5G / 6G) - aktuelle Entwicklungen (beyond-5G/6G) Dokumentation Praktikumsaufgaben: (PDF) -> über Moodle ZIP Dateien zur Unterstützung des Praktikums: (ZIP)  -> über Moodle Excel Tabelle zur Berechnung des Link-Budget: (XLSX)  -> über Moodle Zur Seite von Prof. E. Grass. DE EN Mehr KontrastMehr Kontrast Weniger KontrastWeniger Kontrast Humboldt-Universität zu Berlin Institut für Informatik Rudower Chaussee 25 12489 Berlin-Adlershof Die Humboldt-Universität bei Facebook Die Humboldt-Universität bei BlueSky Die Humboldt-Universität bei Instagram Die Humboldt-Universität bei YouTube Die Humboldt-Universität bei LinkedIn Die RSS-Feeds der Humboldt-Universität Seite bearbeiten Barrierefreiheit Datenschutz Impressum",
  "content_length": 6924,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:26"
}