{
  "name": "Ed Keedwell",
  "homepage": "http://emps.exeter.ac.uk/computer-science/staff/eckeedwe",
  "status": "success",
  "content": "University of Exeter | A Top Worldwide University Skip to main content Search all Welcome to the University of Exeter Exeter delivers on global stage at COP30 The University of Exeter played a significant role at COP30 as it aimed to help combat climate change through its world-leading climate science. From the Global Tipping Points Report to the Parliamentarians’ Global Guide to Climate Change and Climate Solutions, our experts presented business leaders and policymakers alike with reliable, insightful analysis, making clear the consequences of inaction. Read more about our role at COP30 Search for a course Undergraduate Postgraduate Taught Postgraduate Research Degree Apprenticeship Online Find out more about studying here University Open Days Request a prospectus Register your interest Research Minister launches Critical Minerals Strategy on visit to University of Exeter, Cornwall Critical minerals and rare earths are essential for the production of a wide array of technologies, including smartphones, electric vehicles, electronics and turbines. Currently, the UK imports 94% of these from overseas. The government has launched its refreshed UK Critical Minerals Strategy during a ministerial visit to the University of Exeter, Cornwall and its world-renowned Camborne School of Mines (CSM) with leading members of CSM contributing to the strategy. Find out more about the visit Find a University of Exeter expert Explore how our research and partnerships tackle pressing global challenges. Find your next collaborator among our experts. Research The Science of Movement: From Track to Treatment. From enhancing athletic potential to transforming rehabilitation, our public health and sport sciences research is supporting long-term health and helping individuals live healthier lives. Find out more Top 200 in the world1 Top 15 in The Times and Sunday Times Good University Guide 2026 and the Complete University Guide 2026 Exeter graduates in the UK’s top 10 for most targeted by leading employers2 We're ranked in the global top 50 for nine of the UN Sustainable Development Goals3 1Joint 155th in the QS World University Rankings 2026 and 170th in the THE World Rankings 2026, 2 The Graduate Market in 2025 report by High Fliers Research, 3Times Higher Education (THE) Impact Rankings 2025: Joint 2nd in the world for Responsible Consumption and Production; joint 17th for Climate Action Research Exeter climbs in prestigious QS World University Rankings. The University of Exeter has placed =155th globally in the latest QS World University Rankings,  a 14-place rise in the prestigious rankings. Find out more News All news Education Exeter’s ‘solid gold’ standard for teaching excellence amongst best in the UK. The University is amongst an elite group of Higher Education institutions to be recognised as consistently providing outstanding teaching, learning and student outcomes to secure the ‘Gold Overall’ standard in the TEF assessment. Find out more \"I love living in Exeter, there are so many gorgeous green spaces and we are so close to the beach, so the summer term is perfect! It’s so easy to travel down to Exmouth or Dawlish on the train and soak up the sun. Not only do I now have practical skills, but I also have so much experience to put on my CV that will help me find jobs in the competitive performing arts industry post-graduation. The careers support at Exeter is amazing, I’ve found out about the next steps I can take to pursue jobs in the industry and feel completely supported as I get ready to graduate.\" Elsie studying BA Drama at our Streatham Campus. \"Exeter feels like a close and small family to me. I’ve met people from diverse backgrounds with unique stories and perspectives, which has helped me to expand my mindset about a lot of things and overall enriched my university experience. This lively environment has made my time here enjoyable and memorable, and I am sure that these are the days I am going to cherish in my life going forward.\" Namit studying MSc financial Analysis and Fund Management at our Streatham Campus. \"I have no doubt that this course is the best step I could take towards my professional development. The extracurricular events such as weekly guest seminars and frequent career services such as fairs create an environment which encourages networking and shows that countless job, placement and PhD opportunities exist.  Conservation is essential all over the world which is why I love the international approach taken by my course, whether it be learning about the work of the academic staff or going on field courses. I have had the chance to spend two weeks travelling across Kenya to learn about the challenges of human-wildlife interactions and conservation initiatives in unique tropical ecosystems.\" Hugo studying MSc Conservation and Biodiversity at our Penryn Campus. \"My course, BSc Marketing and Management, shares a lot of modules in its first year with students doing other Business School courses, which has been great for meeting loads of different people from all walks of life. As part of the ‘With Industrial Experience’ programme, I am looking forward to spending the third year of my course gaining first-hand insight and knowledge of the business sector, which will really help my employability after my degree is completed. \" Dominique studying BSc Marketing and Management at our Streatham Campus. \"I live locally, so choosing Exeter was actually a pretty easy decision for me. It meant I could stay close to home, but also study a really niche course – I’m doing Sport and Exercise Medical Sciences, which only two other unis provide. Plus, the cricket programme here is top tier, which was a massive part of why I chose it too.\" Lucy studying BSc Sports and Exercise Medical sciences at our St Luke's Campus. \"For me, the programme's emphasis on hands-on learning in data approaches and modelling tools stood out. It went beyond theory by incorporating real-world data science problems into modules, resulting in a practical and analytical approach that considerably prepared us for the challenges of our future employment.\" Daniel studying MSc Applied Data Science at our Streatham Campus. Connect with us 中文网 Information for: Current students New students Staff Alumni and supporters Quick links Contact us Email MyExeter Job vacancies Library PS Connect Portal SID Campuses Streatham Campus Find us Contact St Luke's Campus Find us Contact Penryn Campus Find us Contact Truro Campus Find us Contact Footer links Using our site Accessibility Freedom of Information Modern Slavery Act Statement Data Protection Copyright & disclaimer Privacy Site map Cookie settings",
  "content_length": 6679,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:26"
}