{
  "name": "Ed Lazowska",
  "homepage": "http://www.cs.washington.edu/people/faculty/lazowska",
  "status": "success",
  "content": "Ed Lazowska, Professor Emeritus - Paul G. Allen School of Computer Science & Engineering Skip to content Enter search text Current site All the UW Search scope Current site All the UW Ed Lazowska Professor Emeritus Focus Area: Software & Hardware Systems Expertise: Cloud Computing; Computer Networking; Data Science; Operating & Distributed Systems Email: lazowska@cs.washington.edu Office: CSE2 244 Faculty Webpage eScience Institute Biography: Ed Lazowska is the Bill & Melinda Gates Chair Emeritus in the Paul G. Allen School of Computer Science & Engineering at the University of Washington. Lazowska’s research and teaching have concerned the design, implementation, and analysis of computing and communication systems, and, more recently, the techniques and technologies of data- intensive discovery. Lazowska also has been active on public policy issues, ranging from STEM education to Federal strategies for research and innovation. Lazowska is a Member of the National Academy of Engineering (and served as a Councillor from 2018- 24) and a Fellow of the American Academy of Arts & Sciences, the American Association for the Advancement of Science, the Association for Computing Machinery, and the Institute of Electrical and Electronics Engineers. He has served as a board member or technical advisor for a number of high-tech companies, venture firms, and technology-oriented civic organizations, currently including the Allen Institute for Artificial Intelligence (Ai2), Madrona Venture Group, and Pioneer Square Labs. A long-time advocate for increasing participation in the field, he has served on the Executive Advisory Council of the National Center for Women & Information Technology and on the National Academies Committee on Women in Science, Engineering, and Medicine.",
  "content_length": 1789,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:28"
}