{
  "name": "Eddie Kohler",
  "homepage": "http://read.seas.harvard.edu/~kohler",
  "status": "success",
  "content": "Eddie Kohler 2013 â 2011 â 2006 â 2002ish by Paula M. Official Bronze Sponsor of Unicode Character U+22AD NOT TRUE kohler@seas.harvard.edu Iâm currently an awesome Microsoft Professor of Computer Science at Harvard. Previously, I worked for Meraki (now Cisco Meraki), was an ass. professor at UCLA, was Chief Scientist at Mazu Networks, and held a research appointment at ICIR. My research interests include systems, networks, programming languages, and software engineering. I am a gay man and use they/them pronouns (he/him are also fine; an article about pronoun choice). I am not affiliated with the bogus website eddiekohler.com. Publications. Github. Fall 2024 office hours: Monday 4â5pm and Tuesday 10â11am, SEC 4.412, or whenever Iâm in my office and available Classes: CSÂ 2610 Research Topics in Operating Systems (Spring 2025) Spring 2021, Fall 2011 CSÂ 161 Operating Systems (Spring 2024) Spring 2024, Spring 2019, Spring 2018 CS 61 Systems Programming and Machine Organization Fall 2024, Fall 2022, Fall 2021, Fall 2020, Fall 2019, Fall 2018, Fall 2017, Fall 2016, Fall 2014, Fall 2013, Fall 2012 CSÂ 260r Topics and Close Readings in Computer Systems Spring 2022: Large-Scale Distributed and Parallel Computations Spring 2019: Serverless Computing Spring 2017: Verified Systems Spring 2015: Reliable Systems Spring 2014: Cloud Big Data Systems CS 207 Systems Development for Computational Science Spring 2012 lecture notes UCLA classes: CS 111 Operating Systems Principles (Winter 2011) (Evaluation) Fall 2007 (Evaluation), Spring 2007 (Evaluation), Fall 2006 (Evaluation), Spring 2006 (Evaluation), Fall 2005 (Evaluation), Spring 2005 (Evaluation) CS 235 Advanced Operating Systems (Fall 2010) (Evaluation) Winter 2008 (Evaluation), Fall 2006 (Evaluation), Fall 2005 (Evaluation), Fall 2004 [CS 239-1] (Evaluation) CS 239-1 Distributed Systems Infrastructure (Winter 2008) (Evaluation) CS 239-2 Readable Kernel Systems (Winter 2005) (Evaluation) CS 239-3 Readable Software Systems (Spring 2004) (Evaluation) Projects: Anvil, Asbestos, Click, DCCP (Service Code Calculator), Featherstitch, Kudos, Masstree, SNACK, Suelo, Sympathy, Tamer, Tenet, XORP. Old: Eel, Prolac. Software: Gifsicle, HotCRP, Ipsumdump, John Kimble, LCDF Typetools, Masstree, T1utils, Xbraitenberg, Xmahjongg, Portable Xshostakovich++ 98!!, Xwrits, Xzewd. Contact information Harvard Science & Engineering Complex (SEC) Room 4.412 150 Western Ave Boston, MA 02134 +1 617 496-2630 Email: kohler@seas.harvard.edu I regret that I have bad email habits. Nevertheless, I prefer email to the phone for first conversations, thanks. Click questions will generally be forwarded to the Click mailing list (and then answered). If you donât want a question made publicly available, say so explicitly in your message. Notes Left-leaning red-black trees considered harmful LaTeX usage notes “I have learned—but again and again I forget—that abstraction is a bad thing, innumerable and infinitesimal and tiresome; worse than any amount of petty fact. … It is like a useless, fruitless vegetation, spreading and twining and fading and corrupting; even the ego disappears under it …”Glenway Wescott, The Pilgrim Hawk “One’s reasoning is a strange thing; is really not reason, is a mingling of resistances, unperceptiveness, un-coordination and helplessness.”Marianne Moore to Lloyd Frankenberg, December 26, 1943 (Selected Letters) “… I romantically swore a loyal oath in the other garden that until my own death I would eschew ambition for worldly success and avoid the wielders of influence and power, choosing my friends among the innocently uncompetitive. It is not a vow that I have always been able to keep.”Francis Wyndham, The Other Garden “At the beginning of a new notebook I copy a quote from Simone Weil, which captures me completely: ‘Don’t insist on understanding new things, but try with your whole self, with patience, effort and method, to comprehend obvious truths.’ ¶ This quote conducts a polemic with the ceaseless, barbaric pursuit of novelty and disdain for obvious, primary truths. ¶ And so all my notes, all these snail’s traces, are the realization of Simone’s one thought. I won’t and can’t discover anything, I want only with my whole self to reach the heart of obvious truths.”Anna Kamienska, Industrious Amazement: A Notebook (translated by Clare Cavanagh) âOur mass cultureâand a good deal of our high, or serious, culture as wellâis dominated by an emphasis on data and a corresponding lack of interest in theory, by a frank admiration of the factual and an uneasy contempt for imagination, sensibility, and speculation. We are obsessed with technique, hagridden by Facts, in love with information. â¦ [O]ur scholarsâor, more accurately, our research administratorsâerect pyramids of data to cover the corpse of a stillborn ideaâ¦.âDwight Macdonald, âThe Triumph of the Fact,â in Masscult and Midcult: Essays Against the American Grain â[Psychologist Albert] Bregman â¦ gave me some of the best advice Iâve ever received. Trying to decide whether to major in psychology or art history, I had gone to his office to see what he thought. He squinted and lowered his head. âIs this a hard choice for you?â he demanded. Yes! I cried. âOh,â he said, springing back up cheerfully. âIn that case, it doesnât matter. If itâs a hard decision, then thereâs always lots to be said on both sides, so either choice is likely to be good in its way. Hard choices are always unimportant.ââAdam Gopnik, âMusic to your Earsâ → Longer quotes Graduate students William Qian Yihe Huang Alumni/ae Hao Bai (MS) Tom Bergan (MS) Lih Chen (MS) Ryan Cunningham (MS) Andrew de los Reyes (MS) Petros Efstathopoulos (PhD) Christopher Frost (PhD) Ben Greenstein (PhD) Nathaniel Herman (undergrad) Shant Hovsepian (undergrad) Bryan Kate (PhD) Nikitas Liogkas (PhD) Mike Mammarella (PhD) Andrew Matsuoka (undergrad) Robert Nelson (MS) Nithya Ramanathan (PhD) Steve VanDeBogart (PhD) Lei Zhang (MS) Projects and software The Click modular router. Widely used software for building anything that touches network packets. Free; BSD-like license. DCCP (Datagram Congestion Control Protocol). Tenet, an architecture for tiered embedded networks. Sensor network software built around a simple, pluggable tasklet abstraction. XORP, the eXtensible Open Router Platform. HotCRP. Slick and powerful conference management software. Free; BSD-like license. Ipsumdump. Translates tcpdump files, or other packet sources, into a human- and program-readable ASCII format. Free; BSD-like license. Gifsicle. A command-line tool for creating, editing, and getting information about GIF images and animations. Free; GPL-like license. LCDF Typetools. Nine programs for dealing with Type 1, multiple-master, and OpenType fonts. Includes cfftot1, mmafm, mmpfb, otfinfo, otftotfm, t1dotlessj, t1lint, t1reencode, and t1testpage. Free; GPL. T1utils. Six programs for manipulating Adobe Type 1 fonts. Includes t1ascii, t1binary, t1asm, t1disasm, t1mac, and t1unmac. Free; BSD-like license. Xbraitenberg. X-based Braitenberg vehicle simulator, with ârealisticâ pseudophysics and collisions. Free; BSD-like license. Xmahjongg. X-based mah jongg solitaire game. Free; GPL. Portable Xshostakovich++ 98!! Silly X thing. Free; Open Profanity License. Xwrits. X-based wrist break reminder. Free; GPL. Dormant Asbestos, an operating system built around decentralized information flow. Eel, the Explicit Event Library. An event-driven programming library amenable to program analysis, and several analysis tools. Developed by Ryan Cunningham. Prolac. A language for writing readable network protocol implementations. Xzewd. An X11/Motif Zephyr interface, with perks. Free, but MIT-specific. Non Academic Indeterminacy: New Aspect of Form in Instrumental and Electronic Music Hosted by the John Cage Trust As a musical score (a gift box published by C. F. Peters, designed & edited by yours truly!) New York Review Books Classics I Have Known Some Words and Phrases from That Awful Mess on the Via Merulana Things Of Extraordinary Proportions This, Of Course, Is a Generalization His Name Was F*** the Bureaucracy Fire Poker (with âMurder, She Wroteâ) The Anything-Goes Aesthetic Nico Muhly Tweets Through Einstein on the Beach Lady Nijō Is Sad What it felt like to bomb a Berkeley interview in 2000 #teaching John Adams’s Grand Pianola Music: The Libretto Thoughts on a Life in Research From The Indian Jugglers, by William Hazlitt “Diligence Is to Magic as Progress Is to Flight” “You Are Very Pensive—Hammering Out in Darkness What Will Not Bear the Light of Day” Everybody Do the Fu! Academic Papers Enlivened through the Application of Randomly-Placed Royalty-Free Old-Time Cat Imagery âThe Click Modular Router,â Kohler et al., TOCS, August 2000 (2.2 MB). Sample page âTopological Groundwater Hydrodynamics,â Garrison Sposito, Advances in Water Resources 24 (2001) 793-801 (716 KB). Thanks to Prof. Sposito. Yet Another Program To Enliven Academic Papers through the Application of Randomly-Placed Royalty-Free Old-Time Cat Imagery, Version 0.3191987265. Includes 5 pieces of royalty-free old-time cat imagery. (More old-time cat imagery) Related: WILDCAT ON THE LOOSE!!!1!! We Reënact The Best Scene of The Lord of the Rings: The Fellowship of the Ring With Special Education Effects Take One (MP4, 2.8MB; or 4.3MB AVI) Take Two (MP4, 1.2MB; or 2MB AVI) Nupurâs Google Tips Lesser Known Phoenixes Good Uses for Huge Red Blinky Font Anne Corner Higer Than The Moon Gonad, Cat from Hell Anneâs Awesome Threnody Anne Pays Homage to the Unix Shell Theodor Adorno On Writing I Love Mom, where according to the principles of Semantic Free Naming, “Mom” has been replaced with an MD5 hash of her contents Bored, Bored, Bored Linus Torvalds Is Sometimes Unable To Distinguish One Thing From Another Hey, Check out some of the Boolean operators I know!!1! and or not Songs Marc By Marc Jac",
  "content_length": 12679,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:27"
}