{
  "name": "Eddy Zheng Zhang",
  "homepage": "http://www.cs.rutgers.edu/~zz124",
  "status": "success",
  "content": "Zheng (Eddy) Zhang Professor @ CS, Rutgers University I am a Professor at the Department of Computer Science at Rutgers University. Before joining Rutgers at 2012, I got my Ph.D. in computer science, my M.S. in computational operations research from the Collge of Wiliam and Mary, and my B.S. degree in Electronic Engineering from Shanghai Jiaotong University. I develop compilation and programming techniques for emerging architectures. I have worked on enhancing program performance and reliability for different types of architectures including multi-core shared memory processors, GPUs, and quantum computers. My current research interest is on how to enhance the programmability of quantum computing sytems. A tenet of my research is that emerging architectures represent the most powerful computation engine that human beings can build at a given time. However, they can be very challenging to use. Programmers often need to have in-depth hardware understanding to achieve desired outcomes, which can hinder their productivity. Therefore, it is important to lift up the abstractions and unleash the utmost computation power of evolving computing architectures with each stride forward. These are the types of problems I am eager to address. I also have a keen interest working with theoreticians and domain experts. My Erdős number is 2. Recent Activities Paper Our paper on VQE compilation is accepted to ISCA 2024. Check out “Tetris: A compilation Framework for VQE Applications” on arXiv. Services ASPLOS PC’24, PLDI PC’24, MICRO PC’24, ISCA ERC’24, PPoPP PC’24. Teaching I am currently teaching CS314 (Spring 2024) Principles of Programming Languages. Selected Publications ASPLOS Exploiting the Regular Structure of Modern Quantum Architectures for Compiling and Optimizing Programs with Permutable Operators Yuwei Jin, Fei Hua, Yanhao Chen, and 3 more authors In Proceedings of the 28th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, Volume 4, 2023 Abs Bib PDF A critical feature in today’s quantum circuit is that they have permutable two-qubit operators. The flexibility in ordering the permutable two-qubit gates leads to more compiler optimization opportunities. However, it also imposes significant challenges due to the additional degree of freedom. Our Contributions are two-fold. We first propose a general methodology that can find structured solutions for scalable quantum hardware. It breaks down the complex compilation problem into two sub-problems that can be solved at small scale. Second, we show how such a structured method can be adapted to practical cases that handle sparsity of the input problem graphs and the noise variability in real hardware. Our evaluation evaluates our method on IBM and Google architecture coupling graphs for up to 1,024 qubits and demonstrate better result in both depth and gate count - by up to 72% reduction in depth, and 66% reduction in gate count. Our real experiments on IBM Mumbai show that we can find better expected minimal energy than the state-of-the-art baseline. @inproceedings{asplos23qaoa, author = {Jin, Yuwei and Hua, Fei and Chen, Yanhao and Hayes, Ari and Zhang, Chi and Zhang, Eddy Z.}, title = {Exploiting the Regular Structure of Modern Quantum Architectures for Compiling and Optimizing Programs with Permutable Operators}, year = {2023}, isbn = {9798400703942}, publisher = {Association for Computing Machinery}, address = {New York, NY, USA}, url = {https://doi.org/10.1145/3623278.3624751}, doi = {10.1145/3623278.3624751}, booktitle = {Proceedings of the 28th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, Volume 4}, pages = {108–124}, numpages = {17}, keywords = {quantum circuit compilation, QAOA, circuit fidelity}, location = {, Vancouver, BC, Canada, }, series = {ASPLOS '23}, } ASPLOS CaQR: A Compiler-Assisted Approach for Qubit Reuse through Dynamic Circuit Fei Hua, Yuwei Jin, Yanhao Chen, and 6 more authors In Proceedings of the 28th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, Volume 3, 2023 Abs Bib HTML PDF Quantum measurement is important to quantum computing as it extracts out the outcome of the circuit at the end of the computation. Previously, all measurements have to be done at the end of the circuit. Otherwise, it will incur significant errors. But it is not the case now. Recently IBM starts supporting dynamic circuit through hardware (instead of software by simulator). With mid-circuit hardware measurement, we can improve circuit efficacy and fidelity from three aspects: (a) reduced qubit usage, (b) reduced swap insertion, and (c) improved fidelity. We demonstrate this using real-world applications Bernstein Verizani on real hardware and show that circuit resource usage can be improved by 60%, and circuit fidelity can be improved by 15%. We design a compiler-assisted tool that can find and exploit the tradeoff between qubit reuse, fidelity, gate count, and circuit duration. We also developed a method for identifying whether qubit reuse will be beneficial for a given application. We evaluated our method on a representative set of important applications. We can reduce resource usage by up to 80% and improve circuit fidelity by up to 20%. @inproceedings{huaetalasplos23, author = {Hua, Fei and Jin, Yuwei and Chen, Yanhao and Vittal, Suhas and Krsulich, Kevin and Bishop, Lev S. and Lapeyre, John and Javadi-Abhari, Ali and Zhang, Eddy Z.}, title = {CaQR: A Compiler-Assisted Approach for Qubit Reuse through Dynamic Circuit}, year = {2023}, isbn = {9781450399180}, publisher = {Association for Computing Machinery}, address = {New York, NY, USA}, doi = {10.1145/3582016.3582030}, booktitle = {Proceedings of the 28th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, Volume 3}, pages = {59–71}, numpages = {13}, keywords = {qubit reuse, circuit fidelity, qubit usage, mid-circuit measurement}, location = {Vancouver, BC, Canada}, series = {ASPLOS 2023} } ASPLOS Time-Optimal Qubit Mapping Chi Zhang, Ari B. Hayes, Longfei Qiu, and 3 more authors In Proceedings of the 26th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, 2021 Abs Bib HTML PDF Rapid progress in the physical implementation of quantum computers gave birth to multiple recent quantum machines implemented with superconducting technology. In these NISQ machines, each qubit is physically connected to a bounded number of neighbors. This limitation prevents most quantum programs from being directly executed on quantum devices. A compiler is required for converting a quantum program to a hardware-compliant circuit, in particular, making each two-qubit gate executable by mapping the two logical qubits to two physical qubits with a link between them. To solve this problem, existing studies focus on inserting SWAP gates to dynamically remap logical qubits to physical qubits. However, most of the schemes lack the consideration of time-optimality of generated quantum circuits, or are achieving time-optimality with certain constraints. In this work, we propose a theoretically time-optimal SWAP insertion scheme for the qubit mapping problem. Our model can also be extended to practical heuristic algorithms. We present exact analysis results by using our model for quantum programs with recurring execution patterns. We have for the first time discovered an optimal qubit mapping pattern for quantum fourier transformation (QFT) on 2D nearest neighbor architecture. We also present a scalable extension of our theoretical model that can be used to solve qubit mapping for large quantum circuits. @inproceedings{zhangetalasplos21, author = {Zhang, Chi and Hayes, Ari B. and Qiu, Longfei and Jin, Yuwei and Chen, Yanhao and Zhang, Eddy Z.}, title = {Time-Optimal Qubit Mapping}, year = {2021}, isbn = {9781450383172}, publisher = {Association for Computing Machinery}, address = {New York, NY, USA}, doi = {10.1145/3445814.3446706}, booktitle = {Proceedings of the 26th ACM International Conference on Architectural Support for Programming Languages and Operating Systems}, pages = {360–374}, numpages = {15}, keywords = {Qubit Mapping, Quantum Fourier Transformation, Noisy Intermediate Quantum Computers, NISQ, Quantum Computing, QFT}, location = {Virtual, USA}, series = {ASPLOS '21}, } MICRO AutoBraid: A Framework for Enabling Efficient Surface Code Communication in Quantum Computing Fei Hua, Yanhao Chen, Yuwei Jin, and 4 more authors In MICRO-54: 54th Annual IEEE/ACM International Symposium on Microarchitecture, 2021 Abs Bib HTML PDF Quantum computers can solve problems that are intractable using the most powerful classical computer. However, qubits are fickle and error prone. It is necessary to actively correct errors in the execution of a quantum circuit. Quantum error correction (QEC) codes are developed to enable fault-tolerant quantum computing. With QEC, one logical circuit is converted into an encoded circuit. Most studies on quantum circuit compilation focus on NISQ devices which have 10-100 qubits and are not fault-tolerant. In this paper, we focus on the compilation for fault-tolerant quantum hardware. In particular, we focus on optimizing communication parallelism for the surface code based QEC. The execution of surface code circuits involves non-trivial geometric manipulation of a large lattice of entangled physical qubits. A two-qubit gate in surface code is implemented as a virtual “pipe” in space-time called a braiding path. The braiding paths should be carefully routed to avoid congestion. Communication between qubits is considered the major bottleneck as it involves scheduling and searching for simultaneous paths between qubits. We provide a framework for efficiently scheduling braiding paths. We discover that for quantum programs with a local parallelism pattern, our fram",
  "content_length": 18456,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:32"
}