{
  "name": "Edel Sherratt",
  "homepage": "https://www.aber.ac.uk/en/cs/staff-profiles/listing/profile/eds",
  "status": "success",
  "content": "Staff profiles  :\t\tDepartment of Computer Science ,\t\tAberystwyth University Edel Sherratt Emeritus Lecturer Department of Computer Science Contact Details Email: eds@aber.ac.uk Teaching Lecturer CS32420 - Computer Graphics and Games Publications Sherratt, E, Reed, R, Prinz, A, v. Löwis, M, Piefel, M, Gotzhein, R, Eschbach, R, Glässer, U, Wang, Y, Zhao, Y, Zhang, W & Ai, B 2021, Recommendation Z.100 Annex F2 (06/21): Specification and Description Language – Overview of SDL 2010 Annex F2: SDL-2010 formal definition: Static semantics. International Telecommunication Union Telecommunication Standardization Sector. <https://www.itu.int/ITU-T/recommendations/rec.aspx?rec=14702&lang=en>Sherratt, E, Reed, R, Prinz, A, von Löwis of Menar, M, Piefel, M, Gotzhein, R, Eschbach, R, Glässer, U, Wang, Y, Zhao, Y, Zhang, W & Ai, B 2021, Recommendation Z.100 Annex F3 (06/21): Specification and Description Language – Overview of SDL 2010 Annex F3: SDL-2010 formal definition: Dynamic semantics. International Telecommunication Union Telecommunication Standardization Sector. <https://www.itu.int/ITU-T/recommendations/rec.aspx?rec=14703&lang=en>Sherratt, E & Prinz, A 2019, Eventual Consistency Formalized. in P Fonseca i Casas, M-R Sancho & E Sherratt (eds), System Analysis and Modeling. Languages, Methods, and Tools for Industry 4.0 - 11th International Conference, SAM 2019, Proceedings: System Analysis and Modeling. Languages, Methods, and Tools for Industry. vol. 11753, Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), vol. 11753 LNCS, Springer Nature, pp. 249-265. 10.1007/978-3-030-30690-8_15Reed, R, Sherratt, E, Prinz, A, v. Löwis, M, Piefel, M, Gotzhein, R, Eschbach, R, Glässer, U, Wang, Y, Ai, B, Zhao, Y & Zhang, W 2019, Recommendation Z.100 Annex F1 (10/2019): Specification and Description Language – Overview of SDL-2010 Annex F1: SDL-2010 formal definition: General overview. International Telecommunication Union Telecommunication Standardization Sector. <https://www.itu.int/rec/T-REC-Z.100-201910-I!AnnF1/en>Sherratt, E 2017, Intelligent Resilience in the IoT. in T Csöndes, G Kovács & G Réthy (eds), SDL 2017: Model-Driven Engineering for Future Internet: 18th International SDL Forum, Budapest, Hungary, October 9–11, 2017, Proceedings. 1 edn, vol. 10567, Lecture Notes in Computer Science, Springer Nature, pp. 46-60, SDL 2017, Budapest, Hungary, 09 Oct 2017. 10.1007/978-3-319-68015-6_4",
  "content_length": 2495,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:28"
}