{
  "name": "Edgar Simo-Serra",
  "homepage": "https://esslab.jp/~ess/en",
  "status": "success",
  "content": "Edgar Simo-Serra Edgar Simo-Serra Associate Professor Department of Computer Science and Engineering Waseda University, Simo-Serra Lab. Email: ess@waseda.jp Google Scholar Github Research interests: computer graphics, computer vision, machine learning Edgar Simo-Serra is currently an associate professor at Waseda University. He obtained his Industrial Engineering degree from BarcelonaTech in 2011 and his Ph.D. in 2015 from the same university. From 2015 to 2018 he was at Waseda University as a junior researcher (assistant professor), and during 2018 he was a JST Presto Researcher, befor rejoining Waseda. His general research interests are in the intersection of computer vision, computer graphics, and machine learning with applications to large-scale real world problems. News Sep, 2025 I have been awarded the VC Young Researcher Award Dec, 2024 1 paper accepted to appear in Transactions on Games Aug, 2024 1 paper accepted to appear in Pacific Graphics 2024 Jun, 2024 Vectorization paper accepted to SIGGRAPH 2024 Jan, 2024 I have been awarded the 2023 Waseda Research Award Dec, 2023 1 paper accepted to appear in WACV 2024 Sep, 2023 Texture synthesis paper accepted to SIGGRAPH ASIA 2023 Aug, 2023 1 paper accepted to appear in Pacific Graphics 2023 May, 2023 2 papers accepted to appear in CVPR 2023 Aug, 2021 1 paper accepted to appear in Pacific Graphics 2021 Jul, 2021 1 paper accepted to appear in ACM Multimedia 2021 May, 2021 1 paper accepted to appear in Conference on Games 2021 Apr, 2021 Line art vectorization paper accepted to SIGGRAPH 2021 Apr, 2021 3 papers accepted to appear in CVPR Workshops 2021 Apr, 2021 I have become an Associate Professor. Mar, 2021 1 paper accepted to appear in CVPR 2021 Sep, 2020 1 paper accepted to appear in SMC 2020 Aug, 2020 I have been introduced in Mirai Book (Japanese) Jul, 2020 2 papers accepted to appear in MICCAI 2020 Apr, 2020 1 paper accepted to appear in CVPR Workshops 2020 Jan, 2020 Our paper on doing digital painting lighting effects is accepted to Transactions on Graphics (TOG) and will be presented at SIGGRAPH2020! Nov, 2019 I was interviewed in STI Horizon! Sep, 2019 I will be giving a tutorial on \"Deep Learning for Image Transformation\" at ICIP2019 Sep, 2019 1 paper accepted to appear in SIGGRAPH Asia 2019 Aug, 2019 2 papers accepted to appear in ICCV Workshops 2019 Aug, 2019 1 paper accepted to appear in MICCAI Workshops 2019 May, 2019 2 papers accepted to appear in ç»åã®èªè­ã»çè§£ã·ã³ãã¸ã¦ã  (MIRU2019) May, 2019 1 paper accepted to appear in Visual Computing 2019 Apr, 2019 2 papers accepted to appear in CVPR Workshops 2019 Mar, 2019 2 papers accepted to appear in MVA 2019 Feb, 2019 Site renewal and created Laboratory webpage Feb, 2019 I will be giving an invited talk at the JST CREST HCI for Machine Learning Symposium Feb, 2019 I will be giving an invited talk at the CGVI ç¬¬173åç ç©¶çºè¡¨ä¼ Nov, 2018 I have been selected as a ãã¤ã¹ã¹ããããªç ç©¶è by the National Institute of Science and Technology Policy (NISTEP). Sep, 2018 I have joined Waseda University as an Assistant Professor. Aug, 2018 I have recieved the MIRU2018 outstanding reviewer award. Jun, 2018 Da Vinci dataset made public. May, 2018 2 papers accepted to appear in ç»åã®èªè­ã»çè§£ã·ã³ãã¸ã¦ã (MIRU2018) May, 2018 I will be giving invited talks on sketch simplification and inking at the Visual Computing 2018 Apr, 2018 Smart Inker accepted to SIGGRAPH 2018 Apr, 2018 I have become a JST Sakigake Researcher. Mar, 2018 1 paper accepted to appear in CGI 2018 Feb, 2018 Image completion source code released Jan, 2018 I will be giving an invited talk at the The Deep Learning Workshop 2018 Jan, 2018 Mastering Sketching accepted to Transactions on Graphics (TOG) Jan, 2018 I will be giving an invited talk at the 3D Forum Oct, 2017 Best paper award at ICCV-CVF 2017 Sep, 2017 I have been selected for JST PRESTO Sep, 2017 Awarded the BarcelonaTech 2017 Special Doctoral Award Aug, 2017 1 paper accepted to appear in ACPR 2017 Aug, 2017 3 papers accepted to appear in ICCV Computer Vision For Fashion Workshop Jun, 2017 Inpainting work featured in TV TOKYO World Business Satellite (Japanese) May, 2017 1 paper accepted to appear in ç»åã®èªè­ã»çè§£ã·ã³ãã¸ã¦ã  (MIRU2017) May, 2017 I will be giving an invited talk at the Workshop on E-Commerce and Entertainment Computing (ECEC) May, 2017 1 paper accepted to appear in ICIP 2017 May, 2017 2 papers accepted to appear in Visual Computing / ã°ã©ãã£ã¯ã¹ã¨CAD ååã·ã³ãã¸ã¦ã Apr, 2017 Image completion paper accepted to SIGGRAPH 2017 Apr, 2017 I will be giving an tutorial at 42nd Optical Symposium Mar, 2017 I will be giving an tutorial at Computer Graphics International 2017 Feb, 2017 1 paper accepted to appear in CVPR 2017 Feb, 2017 1 paper accepted to appear in MVA 2017 Nov, 2016 I have been selected for JST ACT-I Nov, 2016 Colorization work featured in Fuji TV's Tokudane! (Japanese) Oct, 2016 Image colorization demo made public Oct, 2016 Colorization research awarded the Innovative Technologies2016 CULTURE Award Oct, 2016 I will be giving an invited talk at the 3rd Fall Meeting of Federation of Imaging Societies Oct, 2016 Awarded the 2016 ACIA prize to the best PhD thesis on artificial intelligence Sep, 2016 Colorization work has been selected at Innovative Technologies 2016 Sep, 2016 Sketch simplification demo made public Aug, 2016 Geodesic Finite Mixture Models (GFMM) accepted to International Journal of Computer Vision (IJCV) Aug, 2016 Colorization work featured in TV TOKYO World Business Satellite (Japanese) Jul, 2016 I will be giving an invited talk at the DCAJ Presentation session at SIGGRAPH 2016 Jul, 2016 3 papers accepted to appear in ICPR 2016 Jun, 2016 Fashion in 128 floats source code released Jun, 2016 Colorization model employed in the Yomiuri Shimbun 50 Year Beatles Concert website (Japanese) Jun, 2016 Colorization work featured on the first page of the Nikkei Newspaper (Japanese) Jun, 2016 Colorization work featured in Nippon TV NEWS24 (Japanese) Jun, 2016 Colorization work featured in Fuji Television Minna no News Jun, 2016 I will be giving an invited talk at MIRU2016 May, 2016 Our research has been featured on the Waseda University homepage (Japanese) May, 2016 My fashion research has been featured in the Sensors Magazine (Japanese) May, 2016 I will be giving an invited talk at Visual Computing 2016 Apr, 2016 Colorization source code released Mar, 2016 Sketch simplification paper accepted to SIGGRAPH 2016 Mar, 2016 Colorization paper accepted to SIGGRAPH 2016 Mar, 2016 1 paper accepted to appear in CVPR 2016 Mar, 2016 1 paper accepted to appear in NAACL-HLT 2016 Feb, 2016 Deep descriptor source code released Oct, 2015 Awarded the 2015 ACIA prize to best diffusion of artificial intelligence research Sep, 2015 Fashion144k dataset released Sep, 2015 1 paper accepted to appear in ICCV 2015 Aug, 2015 I have joined Waseda University as a junior researcher Jul, 2015 I have successfully defended my PhD thesis Jun, 2015 Our work on fashionability has been picked up by New Scientist May, 2015 Best paper award at MVA 2015 Mar, 2015 1 paper accepted to appear in CVPR 2015 Feb, 2015 1 paper accepted to appear in MVA 2015 Jan, 2015 1 paper accepted to appear in ICRA 2015 Jan, 2015 I will spend 4 months this spring (2015) at the University of Tokyo under the supervision of Yoshihiko Nakamura Jan, 2015 DaLI descriptor accepted to International Journal of Computer Vision (IJCV) and source code released Dec, 2014 Clothes parsing source code released Sep, 2014 GFMM source code released Sep, 2014 1 paper accepted to appear in ACCV 2014 Jul, 2014 1 paper accepted to appear in BMVC 2014 Jan, 2014 I will spend 4 months this summer (2014) at the University of Toronto under the supervision of Raquel Urtasun Dec, 2013 Kinematic Synthesis project completed with the acceptance of our paper in MAMT Mar, 2013 1 paper accepted to appear in CVPR 2013 Mar, 2013 I will spend 2 months this summer (2013) at the TTIC under the supervision of Raquel Urtasun Mar, 2012 1 paper accepted to appear in CVPR 2012 All News",
  "content_length": 8158,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:35"
}