{
  "name": "Edith Elkind",
  "homepage": "https://www.cs.ox.ac.uk/people/edith.elkind",
  "status": "success",
  "content": "Edith Elkind | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyEdith ElkindEdith Elkind Edith Elkind Professor of Computing ScienceNon-Tutorial Fellow, Balliol CollegeLeaving date: 30th October 2024Themes:Artificial Intelligence and Machine LearningAlgorithms and Complexity TheoryInterestsAlgorithmic game theory, computational social choice.BiographyDr. Elkind joined the Oxford Computer Science Department in 2013. Prior to coming to Oxford she was an Assistant Professor at Nanyang Technological University (Singapore), where her research was supported by the National Research foundation (NRF) Fellowship. Dr. Elkind obtained her PhD from Princeton University in 2005, and was a postdoctoral research fellow at the University of Warwick, University of Liverpool and Hebrew University of Jerusalem, as well as a lecturer (Roberts Fellow) at University of Southampton.Selected PublicationsView AllManage publications Properties of multiwinner voting rules Edith Elkind‚ Piotr Faliszewski‚ Piotr Skowron and Arkadii Slinko In Social Choice and Welfare. 2017. Details about Properties of multiwinner voting rules | BibTeX data for Properties of multiwinner voting rules Justified representation in approval−based committee voting Haris Aziz‚ Markus Brill‚ Vincent Conitzer‚ Edith Elkind‚ Rupert Freeman and Toby Walsh In Social Choice and Welfare. 2017. Details about Justified representation in approval−based committee voting | BibTeX data for Justified representation in approval−based committee voting Arbitration and Stability in Cooperative Games with Overlapping Coalitions Yair Zick‚ Edith Elkind and Evangelos Markakis In J. Artif. Intell. Res. (JAIR). Pages to appear. 2014. Details about Arbitration and Stability in Cooperative Games with Overlapping Coalitions | BibTeX data for Arbitration and Stability in Cooperative Games with Overlapping Coalitions | Download (pdf) of Arbitration and Stability in Cooperative Games with Overlapping Coalitions ActivitiesComputational social choiceProjectsFoundational AI ResearchPast StudentsJiarui GanDongge HanAyumi IgarashiDominik PetersAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 2392,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:31"
}