{
  "name": "Edith C. H. Ngai",
  "homepage": "http://user.it.uu.se/~eding810",
  "status": "success",
  "content": "Edith @ Uppsala Home | CV | Research | Publications | Teaching | Students | UrbanLab Edith C. H. Ngai Associate Professor RM 1254, 2/F, ITC Building 1, Division of Computer Systems, Department of Information Technology, Uppsala University Box 337, SE-751 05 Uppsala, Sweden Tel : +46 (0)70 167 9360 Email : edith.ngai(AT)it.uu.se Short Bio Edith Ngai is currently an Associate Professor (Universitetslektor, Docent in Swedish) in the Department of Information Technology, Uppsala University, Sweden. Her research interests include Internet-of-Things, mobile crowdsensing, network security and privacy, cloud computing and data analytics, especially for sustainable development in smart cities and healthcare. She is a project leader of the national GreenIoT project on energy-efficient IoT for open data and sustainable city development funded by Vinnova in Sweden. I am the coordinator of the Smart City Arena in my department. Previously, she has conducted research in Chinese University of Hong Kong, Imperial College London, Simon Fraser University, UCLA, and Tsinghua University. Edith is a VINNMER Fellow (2009) awarded by the Swedish government agency on research and innovation (Vinnova). She was a guest researcher at Ericsson Research Sweden in 2015-2017. She is a Senior Member of ACM and IEEE. Recent Services Associate Editor of IEEE Access (2017-), IEEE Transactions on Industrial Informatics (2017-), IEEE Internet-of-Things Journal (2018-) Technical Committee of Elsevier Computer Communications TPC NAPE-track co-chair: International Conference on Computing, Networking and Communications (ICNC 2018) TPC co-chair: IEEE International Conference on Smart X (Smart X 2017) TPC co-chair: ICIN Workshop on IoT Infrastructures and Data Analytics for Smart Cities (IIDASC 2017) I am hiring PhD position on machine learning and data analytics for smart cities Post-doc position on machine learning and data analytics for smart cities Media Jan 2019: Invited talk on data privacy in the Internet-of-Things in the The Glassroom Experience at Uppsala University, Sweden. Nov 2017: Invited talk on smart urban development with Uppsala Municipality in the Smart City Conference 2017 in Stockholm. Oct 2016: Invited talk on smart urban development with Uppsala Municipality in the UniverCity conference 2016 at Maladalsradet, Stockholm. Aug 2016: Forskarpodden at Uppsala University on Internet of Things and smart cities (Listen to Avsnitt 15: Edith Ngai). Oct 2015: Article about our GreenIoT project in Uppsala University Magazine Nya Horizon (A smarter city with Internet-of-Things). May 2015: See my interview with the Faculty of Science and Technology, Uppsala University. Feb 2014: About our SADHealth project for monitoring seasonal effects on light exposure, activities and mood.",
  "content_length": 2792,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:36"
}