{
  "name": "Edmond S. L. Ho",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/shulimho",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Shu Lim Ho Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffShu Lim HoMr Ethan KellyZhen Tian Dr Edmond S. L Ho Senior Lecturer in Machine Learning (School of Computing Science) telephone: 0141 330 3829 email: ShuLim.Ho@glasgow.ac.uk pronouns: He/him/his SAWB 402, Sir Alwyn Williams Building, University of Glasgow, Glasgow, Scotland, G12 8RZ Import to contacts https://orcid.org/0000-0001-5862-106X Biography Edmond Shu-lim Ho is currently a Senior Lecturer (Associate Professor) in the School of Computing Science (IDA-Section) at the University of Glasgow, Scotland, UK. Prior to joining the University of Glasgow in 2022, he was an Associate Professor (2016-2022) in the Department of Computer and Information Sciences and Turing Network Development Award Lead (2022) at Northumbria University, Newcastle upon Tyne, UK and a Research Assistant Professor in the Department of Computer Science at Hong Kong Baptist University (2011-2016). He has been an Associate Editor of Computer Graphics Forum (CGF) since 2023. He received the BSc degree in Computer Science from the Hong Kong Baptist University, the MPhil degree from the City University of Hong Kong, and the PhD degree from the University of Edinburgh. Research interests My main research focuses on Machine Learning based approaches for solving problems in Computer Vision and Computer Graphics, with the main focus on analyzing and modelling human data captured from visual sensors. Such research topics provided solutions to a wide range of research problems, including human activity understanding, person re-identification, pose estimation and motion correction, character animation, motion retrieval, emotion analysis from body gestures and facial expressions. Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 | 2012 | 2011 | 2010 | 2009 | 2008 | 2007 | 2005Number of items: 78.2025 Zhu, Guangxun, Fan, Shiyu, Dai, Hang and Ho, Edmond S.L. ORCID: https://orcid.org/0000-0001-5862-106X (2025) Waymo-3DSkelMo: A Multi-Agent 3D Skeletal Motion Dataset for Pedestrian Interaction Modeling in Autonomous Driving. In: 33rd ACM International Conference on Multimedia (MM '25), Dublin, Ireland, 27-31 October 2025, pp. 13184-13190. ISBN 9798400720352 (doi: 10.1145/3746027.3758273) Xu, Wenning, Fan, Shiyu, Henderson, Paul ORCID: https://orcid.org/0000-0002-5198-7445 and Ho, Edmond S. L ORCID: https://orcid.org/0000-0001-5862-106X (2025) Multi-Person Interaction Generation from Two-Person Motion Priors. In: Special Interest Group on Computer Graphics and Interactive Techniques Conference (SIGGRAPH 2025), Vancouver, Canada, 10-14 Aug 2025, p. 113. ISBN 9798400715402 (doi: 10.1145/3721238.3730688) Spittle, A. J. et al. (2025) Towards universal early screening for cerebral palsy: a roadmap for automated General Movements Assessment. EClinicalMedicine, 86, 103379. (doi: 10.1016/j.eclinm.2025.103379) Luo, Zeqi ORCID: https://orcid.org/0009-0002-5078-7908, Gooya, Ali ORCID: https://orcid.org/0000-0001-5135-4800 and Ho, Edmond S.L. ORCID: https://orcid.org/0000-0001-5862-106X (2025) UDF-GMA: uncertainty disentanglement and fusion for general movement assessment. IEEE Journal of Biomedical and Health Informatics, (doi: 10.1109/JBHI.2025.3588658) (Early Online Publication) Zhang, Xi, Meng, Zaiqiao ORCID: https://orcid.org/0000-0001-5374-0318, Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939 and Ho, Edmond S.L. ORCID: https://orcid.org/0000-0001-5862-106X (2025) Libra: Leveraging Temporal Images for Biomedical Radiology Analysis. In: 63rd Annual Meeting of the Association for Computational Linguistics (ACL 2025), Vienna, Austria, 27 July - 1 Aug 2025, (Accepted for Publication) 2024 Vijendran, Mridula, Deng, Jingjing, Chen, Shuang, Ho, Edmond S. L. ORCID: https://orcid.org/0000-0001-5862-106X and Shum, Hubert P. H. (2024) Artificial intelligence for geometry-based feature extraction, analysis and synthesis in artistic images: a survey. Artificial Intelligence Review, 58(2), 64. (doi: 10.1007/s10462-024-11051-3) Zhang, Xi, Meng, Zaiqiao ORCID: https://orcid.org/0000-0001-5374-0318, Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939 and Ho, Edmond S.L. ORCID: https://orcid.org/0000-0001-5862-106X (2024) Gla-AI4BioMed at RRG24: Visual Instruction-tuned Adaptation for Radiology Report Generation. In: 62nd Annual Meeting of the Association for Computational Linguistics (ACL 2024), 23rd BioNLP Workshop, Bangkok, Thailand, 16 August 2024, pp. 624-634. (doi: 10.18653/v1/2024.bionlp-1.54) Crosato, Luca, Tian, Kai, Shum, Hubert P.H., Ho, Edmond S.L., Wang, Yafei and Wei, Chongfeng (2024) Social interaction-aware dynamical models and decision making for autonomous vehicles. Advanced Intelligent Systems, 6(3), 2300575. (doi: 10.1002/aisy.202300575) Crosato, Luca, Wei, Chongfeng, Ho, Edmond S. L. ORCID: https://orcid.org/0000-0001-5862-106X, Shum, Hubert P. H. and Sun, Yuzhu (2024) A Virtual Reality Framework for Human-Driver Interaction Research: Safe and Cost-Effective Data Collection. In: 19th Annual ACM/IEEE International Conference on Human Robot Interaction (HRI 2024), Boulder, Colorado, USA, 11-15 March 2024, pp. 167-174. ISBN 9798400703225 (doi: 10.1145/3610977.3634923) Zhang, Haozheng, Ho, Edmond S.L. ORCID: https://orcid.org/0000-0001-5862-106X, Zhang, Xiatian, Del Din, Silvia and Shum, Hubert P.H. (2024) Pose-based tremor type and level analysis for Parkinson’s disease from video. International Journal of Computer Assisted Radiology and Surgery, (doi: 10.1007/s11548-023-03052-4) (Early Online Publication) Chazhoor, Anthony Ashwin Peter, Ho, Edmond S.L. ORCID: https://orcid.org/0000-0001-5862-106X, Gao, Bin and Woo, Wai Lok (2024) A review and benchmark on state-of-the-art steel defects detection. SN Computer Science, 5(1), 114. (doi: 10.1007/s42979-023-02436-2) Zhu, Manli, Ho, Edmond S.L., Chen, Shuang, Yang, Longzhi and Shum, Hubert P.H. (2024) Geometric features enhanced human-object interaction detection. IEEE Transactions on Instrumentation and Measurement, 73, 5026014. (doi: 10.1109/TIM.2024.3427800) 2023 Chen, Shuang, Atapour-Abarghouei, Amir, Ho, Edmond S.L. ORCID: https://orcid.org/0000-0001-5862-106X and Shum, Hubert P.H. (2023) INCLG: inpainting for non-cleft lip generation with a multi-task image processing network. Software Impacts, 17, 100517. (doi: 10.1016/j.simpa.2023.100517) Men, Qianhui, Ho, Edmond S.L. ORCID: https://orcid.org/0000-0001-5862-106X, Shum, Hubert P.H. and Leung, Howard (2023) Focalized contrastive view-invariant learning for self-supervised skeleton-based action recognition. Neurocomputing, 537, pp. 198-209. (doi: 10.1016/j.neucom.2023.03.070) Sakkos, Dimitrios, Ho, Edmond S.L. ORCID: https://orcid.org/0000-0001-5862-106X, Shum, Hubert P.H. and Elvin, Garry (2023) Image editing-based data augmentation for illumination-insensitive background subtraction. Journal of Enterprise Information Management, 36(3), pp. 818-838. (doi: 10.1108/JEIM-02-2020-0042) Crosato, Luca, Shum, Hubert P.H., Ho, Edmond S.L. ORCID: https://orcid.org/0000-0001-5862-106X and Wei, Chongfeng (2023) Interaction-aware decision-making for automated vehicles using social value orientation. IEEE Transactions on Intelligent Vehicles, 8(2), pp. 1339-1349. (doi: 10.1109/TIV.2022.3189836) Hu, Pengpeng, Ho, Edmond S.L. ORCID: https://orcid.org/0000-0001-5862-106X and Munteanu, Adrian (2023) Alignbodynet: deep learning-based alignment of non-overlapping partial body point clouds from a single depth camera. IEEE Transactions on Instrumentation and Measurement, 72, 2502609. (doi: 10.1109/TIM.2022.3222501) 2022 Goel, Aman, Men, Qianhui and Ho, Edmond S. L. ORCID: https://orcid.org/0000-0001-5862-106X (2022) Interaction mix and match: synthesizing close interaction using conditional hierarchical GAN with multi-hot class embedding. Computer Graphics Forum, 41(8), pp. 327-338. (doi: 10.1111/cgf.14647) Hartley, John, Shum, Hubert P. H., Ho, Edmond S. L. ORCID: https://orcid.org/0000-0001-5862-106X, Wang, He and Ramamoorthy, Subramanian (2022) Formation control for UAVs using a Flux Guided approach. Expert Systems with Applications, 205, 117665. (doi: 10.1016/j.eswa.2022.117665) Ho, Edmond S. L. ORCID: https://orcid.org/0000-0001-5862-106X, McCay, Kevin D., Marcroft, Claire and Embleton, Nicholas D. (2022) PCPP: a MATLAB application for abnormal infant movement detection from video. Software Impacts, 14, 100412. (doi: 10.1016/j.simpa.2022.100412) Zhang, Haozheng, Ho, Edmond S.L. ORCID: https://orcid.org/0000-0001-5862-106X and Shum, Hubert P.H. (2022) CP-AGCN: Pytorch-based attention informed graph convolutional network for identifying infants at risk of cerebral palsy. Software Impacts, 14, 100419. (doi: 10.1016/j.simpa.2022.100419) Zhu, Manli, Men, Qianhui, Ho, Edmond S.L., Leung, Howard and Shum, Hubert P.H. (2022) A two-stream convolutional network for musculoskeletal and neurological disorders prediction. Journal of Medical Systems, 46(11), 76. (doi: 10.1007/s10916-022-01857-5) (PMID:36201114) (PMCID:PMC9537228) Zhang, Haozheng, Ho, Edmond S.L. ORCID: https://orcid.org/0000-0001-5862-106X, Zhang, Xiatian and Shum, Hubert P.H. (2022) Pose-Based Tremor Classification for Park",
  "content_length": 57429,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:34"
}