{
  "name": "Edmond Chow",
  "homepage": "http://www.cc.gatech.edu/~echow",
  "status": "success",
  "content": "Edmond Chow Edmond Chow Professor and Associate Chair School of Computational Science and Engineering College of Computing Georgia Institute of Technology Address: 756 West Peachtree Street NW, Atlanta, GA 30332-4017 Office: CODA S1337 Phone: (404) 894-3086 E-mail: Seeking PhD Students I have openings for PhD students who are interested in high performance computing and have experience with GPU programming. Applications include advanced mathematical software and computational chemistry. Please send me an email with your CV and transcripts. Research Numerical methods, particularly numerical linear algebra, for high-performance computers applied to scientific computing and data science problems, including for PDE models, quantum chemistry, molecular dynamics, Brownian/Stokesian dynamics, inverse problems, data assimilation, uncertainty quantification, Gaussian processes, machine learning. ML-MATLAB is a collection of MATLAB live scripts that illustrate concepts in machine learning. They can be used in the classroom or for self-study. News November 2024: News on our paper being presented at the 2024 Supercomputing Conference. June 2024: We organized the 2024 International Conference on Preconditioning at Georgia Tech. Read the highlights on our students and others here. October 2023: Hua Huang is being recognized with an Honorable Mention for the 2023 ACM-IEEE CS George Michael Memorial HPC Fellowship. May 2022: Luke Erlandson defended his Ph.D. thesis and will start as a postdoc in CASC at LLNL. Congrats! October 2020: Congratulations to Paritosh Ramanan, who defended his Ph.D. thesis on October 8. He is using his expertise in asynchronous distributed computing to create a startup company, Blockalytics. June 2020: Jordi Wolfson-Pou successfully defended his Ph.D. thesis on June 2. He is heading to LBNL for a postdoc. April 2020: Hua Huang has won the 2020 Sigma Xi Best M.S. Thesis Award. Only two awards were given at Georgia Tech. Congratulations Hua! March 2020: General interest article on preconditioning co-authored by Edmond Chow and Kees Vuik, published in SIAM News. October 2019: Xin Xing successfully defended his Ph.D. thesis on October 25. He will start a postdoc at UC Berkeley in July. In the meantime, he will stay with us briefly as a postdoc. October 2019: Jordi Wolfson-Pou has been traveling the world talking about his research on asynchronous iterative methods. Read about his adventures here. April 2019: Double congratulations to Hua Huang who defended his M.S. thesis and won the Marshall D. Williamson Fellowship. Hua is continuing his research as a Ph.D. student. December 2018: Benson Ma defended his M.S. CSE thesis. Congratulations! July 2018: Alex Lohse successfully defended his Ph.D. thesis on July 16. Congratulations, Dr. Lohse! April 2018: Congrats to Ph.D. student Paritosh Ramanan who was selected for a Georgia Tech Sam Nunn Predoctoral Fellowship (article on his research here), and to MS thesis student Benson Ma who won the College of Computing Marshall D. Williamson Fellowship. December 2017: Edmond Chow taught a 3-week intensive course on High Performance Numerical Solvers at National Taiwan University. The video recordings of the lectures can be found here. June 2017: We're using high performance computing and numerical methods to simulate DNA and proteins in biological cells, specifically investigating a process called facilitated diffusion. See one of our simulations above. And read a news article about our research here. February 2017: We're planning to have a large showing of research from our group at the 2017 SIAM CSE Conference in Atlanta. Edmond and Ben are speaking in minisymposium sessions, Alex is speaking in a contributed session, and Paritosh, Jordi, and Xin are presenting posters. Come say hello! November 2016: Edmond Chow organizes the Georgia Tech show at the annual ACM/IEEE SC (Supercomputing) Conference. Here is a photo at our booth just before the Gala opening. Over 40 faculty, research staff, and students participated from across the Colleges of Georgia Tech. September 2016: Edmond Chow is leading a newly funded project on asynchronous iterative methods for extreme scale computers. The $2.4 million project over 3 years includes Georgia Tech, Sandia National Laboratories, Temple University, and University of Tennessee. Here is photo from our kickoff meeting at Georgia Tech. May 2016: Edmond Chow is teaching a short course on High Performance Linear System Solvers at National Taiwan University, National Center for Theoretical Sciences, Mathematics Division. March 2016: Article in scientificcomputing.com on our research in parallel quantum chemistry supported by Intel. Read it here! October 2015: Paper accepted by Proceedings of the National Academy of Sciences: E. Chow and J. Skolnick, Effects of Confinement on Models of Intracellular Macromolecular Dynamics. Click here for a news article on this research. February 2015: We are organizing Georgia Scientific Computing Symposium to be held on February 28 at Georgia Tech. December 2014: Xing Liu successfully defended his Ph.D. thesis. He now has a permanent position at IBM T. J. Watson Research Center. May 2014: In collaboration with Intel, we have run our quantum chemistry code on 8100 nodes of Tianhe-2, the fastest supercomputer in the world! April 2014: Intel has awarded Georgia Tech an Intel Parallel Computing Center. Edmond Chow will lead the center, which will focus on Xeon and Xeon Phi algorithms and implementations for computational chemistry and biochemistry. See the announcement here. Our center website is here. How did I get Here? I joined Georgia Tech in August 2010. Previously, I worked at D. E. Shaw Research in New York (from 2005 to 2010) and at Lawrence Livermore National Laboratory in the Center for Applied Scientific Computing (from 1998 to 2005). I've also taught several courses at Columbia University as an Adjunct Associate Professor in the Department of Applied Physics and Applied Mathematics. I studied at the University of Minnesota (Ph.D., Computer Science, minor in Aerospace Engineering, 1997). My undergraduate studies were at the University of Waterloo in Canada (Hons. B.A.Sc., Systems Design Engineering, 1993). Professional Activities Vice chair, SIAM Activity Group on Computational Science and Engineering, 2025-2026. Co-organizer (with Yuanzhe Xi), 13th International Conference On Preconditioning Techniques For Scientific and Industrial Applications, 2024. Member of the ACM Gordon Bell Prize Committee, 2020-2023 (Chair in 2022). Co-chair (with Suncica Canic), SIAM Annual Meeting, 2022. Associate Editor, ACM Transactions on Mathematical Software, 2012-present. Associate Editor, SIAM Journal on Scientific Computing, 2008-2016. (Three 3-year terms... whew!) Co-chair (with Ali Pinar and Rob Schreiber), SIAM Conference on Parallel Processing for Scientific Computing, Portland, OR, 2014. Organizing Committee, SIAM Conference on Applied Linear Algebra, Paris, France, 2024; SIAM Conference on Computational Science and Engineering, Atlanta, GA, 2017; SIAM Annual Meeting, Chicago, IL, 2014. Algorithms Chair, Technical Papers Committee, ACM/IEEE International Conference for High Performance Computing, Networking, Storage and Analysis (SC12), Salt Lake City, UT, Nov. 10-16, 2012. Vice-Chair, Scientific Committee, 10th International Meeting on High-Performance Computing for Computational Science (VECPAR 2012), Kobe, Japan, July 17-20, 2012. Some conference program committees: SC'18, SC'17 Invited Talks Committee, IPDPS 2016, ICPP'15, IPDPS 2015, PMAA14, VECPAR 2014, ICPADS-2014, IPDPS 2014, SC'13, SC'12, ICPP'12, IPDPS 2011, HiPC 2011, SC'10, IPDPS 2010, HiPC 2010, SC'09 Some Accolades SIAM Fellow (Class of 2021) 2002 U.S. Presidential Early Career Award for Scientists and Engineers (PECASE) 2009 ACM Gordon Bell Prize SC23 Test of Time Award (with D. E. Shaw Research) Best Paper Awards at SC'06, SC'09, IPDPS 2013, and IPDPS 2014 (Applications), Finalist for ACM Gordon Bell Prize at SC'05 Georgia Tech Class of 1934 Course Survey Teaching Effectiveness Award, 2012 Students Abir Haque, Ph.D. student Eric Fowler, Ph.D. student Grant Bruer, Ph.D. student Shikhar Shah, Ph.D. (graduated July 2024) Hua Huang, Ph.D. (graduated July 2024; now at NVIDIA) Luke Erlandson, Ph.D. (graduated May 2022; now at Lawrence Livermore National Laboratory) Paritosh Ramanan, Ph.D. (graduated October 2020; joint with Prof. N. Gebraeel, ISYE; now Assistant Professor at Oklahoma State University) Jordi Wolfson-Pou, Ph.D. (graduated June 2020; now at Lawrence Berkeley National Laboratory) Xin Xing, Ph.D. (graduated Dec. 2019; now at UC Berkeley) Hua Huang, M.S. thesis student (graduated May 2019; now a Ph.D. student) Benson Ma, M.S. thesis student (graduated Dec. 2018; now at Apple) Alex Lohse, Ph.D. (joint with Prof. K. Jacob, MSE; graduated July 2018; now at Owens Corning) Ben Pritchard, post-doc (Feb. 2015 - Mar. 2017; now at Virginia Tech) Xing Liu, Ph.D. (graduated Dec. 2014; now at Intel) Teaching In Fall 2025, I will teach CSE/MATH 6644 Iterative Methods for Systems of Equations. Click here for a list of my courses. Funding I gratefully acknowledge the support of NSF, DOE, DARPA, and Intel Corporation for funding my research.",
  "content_length": 9279,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:37"
}