{
  "name": "Edmund S. Yu",
  "homepage": "http://eng-cs.syr.edu/our-departments/electrical-engineering-and-computer-science/people",
  "status": "success",
  "content": "Directory - ECS – Syracuse University All Staff/Faculty Biomedical and Chemical Engineering Civil and Environmental Engineering Electrical Engineering and Computer Science Mechanical and Aerospace Engineering ECS Leadership All ECS Staff All ECS Full-Time Faculty All ECS Part-Time Faculty Mo Abdallah Assistant Teaching Professor Ethan Arnault Assistant Professor Marjory Baruch Part Time Associate Professor Yue Cao Assistant Teaching Professor C.Y. Roger Chen Professor Biao Chen John E. and Patricia A. Breyer Professor in Electrical Engineering Shiu-Kai Chin Emeritus Professor Gabriel Silva De Oliveira Assistant Teaching Professor Sara Eftekharnejad Associate Professor Ehat Ercanli Associate Teaching Professor Associate Chair of Education and Operations Makan Fardad Associate Professor Interim Electrical Engineering and Computer Science Graduate Program Director Venkata S.S. Gandikota Assistant Professor Natarajan Gautam Professor Operations Research and Systems Analytics Master's Program Director, Dean’s Faculty Fellow for Graduate Student Engagement Nadeem Ghani Assistant Teaching Professor Prasanta K. Ghosh Professor Jennifer W. Graham Associate Teaching Professor M. Cenk Gursoy Professor Moamer (Mo) Hasanovic Assistant Teaching Professor Endadul Hoque Assistant Professor Can Isik Professor Pankaj K. Jha Assistant Professor Alex K. Jones Klaus Schroder Endowed Professor for Engineering, Department Chair EECS Garrett Ethan Katz Associate Professor Bryan S. Kim Assistant Professor Rodrick Kuate Defo Assistant Professor Saman Priyantha Kumarawadu Associate Teaching Professor Computer Science Undergraduate Program Director Andrew C. Lee Assistant Teaching Professor Hong Martel Adjunct Professor/Instructor Joao Paulo Marum Assistant Teaching Professor Jean-Daniel Medjo Assistant Teaching Professor Electrical Engineering and Computer Engineering Undergraduate Program Director Kristopher Micinski Assistant Professor Chilukuri K. Mohan Professor Jae C. Oh David G. Edelstein Professor for Broadening Participation,Senior Associate Dean for Faculty Affairs and Academic Initiatives Susan Older Associate Professor Vir V. Phoha Professor Jeremy Pierce Part-Time Instructor Jason Pollack Assistant Professor Qinru Qiu Distinguished Professor Younes Ra’di Assistant Professor Farzana Rahman Associate Teaching Professor Paulo Shakarian KG Tan Endowed Professor of Artificial Intelligence Sucheta Soundarajan Associate Professor Yuzhe Tang Associate Professor Pramod K. Varshney Distinguished Professor Senem Velipasalar Professor Joseph J. Waclawski Assistant Teaching Professor Li Wang Assistant Teaching Professor Edmund S. Yu Associate Teaching Professor Reza Zafarani Associate Professor Junzhe Zhang Assistant Professor Tianyi Zhang Assistant Professor (Starting January 2026)",
  "content_length": 2805,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:38"
}