{
  "name": "Edoardo Biagioni",
  "homepage": "http://www2.hawaii.edu/~esb",
  "status": "success",
  "content": "Edo Biagioni Edoardo S. Biagioni I am an Associate Professor at the University of Hawaii at Mānoa's Department of Information and Computer Sciences. I can be reached at esb@hawaii.edu. My office telephone number is +1-808-956-3891. I joined UH in August, 1997. My most recent CV is here. Courses: Fall 2025: Introduction to Computer Science II, ICS 211 Fall 2025: Computer Networks, ICS 651 Past Courses Research Interests A new interest since 2024 is proving correctness properties of systems programs, such as file systems. I am interested in networking, particularly decentralized and ad-hoc networking, often with security aspects. I am interested in wireless networking, and in the issues of security, routing, and reliability in wireless networks. Since 2011, these activities have contributed to the Allnet project. Previously (during 2000-2003) these activities contributed to the PODS project (more formally known as ''A Remote Ecological Micro-Sensor Network''). I have a list of links and publications related to this project. I am also always interested in better ways of teaching and better ways of teaching networking. In the past I have also been active in the following areas: protocol implementation strategies, especially building networking protocols out of simple building blocks designing specialized networking protocols, for example to carry TCP over ATM. using advanced languages such as SML (Standard ML) for systems programming using continuations in OS design the interaction of congestion control and protocol performance. Although these are not currently my primary focus, I am still open to working in these areas. Specific projects I have worked on or supervised: I have been very fortunate to be involved in the early stages of the Fedora Core project. Design and Implementation of an Operating System in Standard ML. Networks Laboratory Training Environment, by Blanca Polo. Additional work was done by Xin Chen, Xiangli Xu, and Dan Yi: source code (and a backup) and the applet. ATP -- an ATM Transport Protocol: a description of the implementation and a 1998 interim report. Measuring the Internet. Building Block Protocols. See also these postcript slides of a talk I gave at CMU and Bell Labs. These slides contain germs of the ideas behind both ATP and building blocks. I have also helped supervise a software development project for the Hawaii Civil Defense agency. I have released a simple database package written in SML. One of my students has written a description of IPv6 and how to run it on Linux and Windows. I am looking into systems for distance learning. Also, on August 24th, 1999, I presented a paper on Asynchronous and Distance Communication over Digital Networks at HCI International '99, a conference in Munich, Germany. This paper describes some of my experiences and insight from distance learning. These may be good references for writing and presentations: \"How to Write a Thesis\" (PDF), by Steve Easterbrook \"Issues in making an oral presentation / writing a report\", by Olivier Danvy (who shared my office at CMU in 1993/1994). A Nasa Report by S. Katzoff on clarity in technical reporting. Wes Peterson's thoughts for non-native speakers who are writing English. Philip Johnson's suggestions for people requesting to be considered for positions (also note that I have no available funded position at this time, October 2008). These references may also be useful: Writing technical articles, by H. Schulzrinne Writing reviews for systems conferences, by Timothy Roscoe Background I joined UH as an Assistant Professor in August, 1997. I got tenure and promotion in 2004. I was director of the Advanced Network Computing Laboratory (ANCL) from 1997 to 2005. Before UH, I was a Systems Scientist (and prior to that, a Post-Doctoral Research Associate) at the Department of Computer Science at Carnegie Mellon University in Pittsburgh, Pennsylvania. At CMU I worked with the Fox Project. I joined CMU in 1993. Before CMU, I worked for Fore Systems, writing software for ATM switches. Fore has been acquired by Marconi and no longer exists as a separate entity. Likewise, Marconi has since been purchased by Ericsson. I started at Fore while writing my dissertation on \"Scan Directed Load Balancing\" at the Department of Computer Science at the University of North Carolina at Chapel Hill. My advisors were Gyula Mago and Jan Prins, and I defended my thesis in November, 1991. Other Interests I have another web page for pictures, hobbies and activities. This site is designed to be viewed with any browser. Please let me know if your browser had difficulty viewing this site.",
  "content_length": 4634,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:38"
}