{
  "name": "Edoardo Serra",
  "homepage": "https://sites.google.com/site/serraedoardo",
  "status": "success",
  "content": "Edoardo SerraSearch this siteEmbedded FilesSkip to main contentSkip to navigationEdoardo SerraEmail: edoardoserra@boisestate.eduHere my CVFor consulting info click here.BioI received my Ph.D. degree in Computer Science Engineering from the University of Calabria, Italy, in 2012.I was a Visiting Researcher at the Computer Science Department of the University of California - Los Angeles (Oct 2010 - Jul 2011). After the Ph.D. degree, I was a postdoc at the University of Calabria (2012), and I was a Research Associate at the University of Maryland (Gen 2013 - Aug 2015).From Aug 2015 to July 2021, I was Assistant Professor in the computer science department at Boise State University (BSU).Since July 2021, I have been an Associate Professor in the computer science department at Boise State University (BSU).Since June 2021, I have been a senior Researcher (Joint Appointment) at Pacific Northwest National Laboratory (PNNL).Since January 2023, I have been Co-Director of Computing Ph.D. Program at Boise State UniversityI also had experience as applied AI/ML consultant (click here for more info). My research interests focus on Artificial Intelligence (AI) and Machine Learning (ML).  More specifically my research topics are: Graph Representation Learning, Unsupervised Neural Networks, Generative AI, AI Interpretability and Robustness, and ML/AI applications in Cyber and National SecurityFollow meLinkedIn@serraedoardoAddress:Computer Science Department at Boise State University1910 University Drive Boise,ID 83725-2055 USAProjectsPrecision Ag: Increasing Crop Yields Using Internet of Things (IoT) & Data Science. Role: PI. Source of Support: Idaho Department of Commerce. Capacity Building: Integrating Data Science into Cybersecurity Curriculum. Role: PI. Source of Support: NSF Scholarship for Service (SFS). Information Network Embedding for Scalable and Self Adaptive Analysis of Terrorist Organizations. Role: PI. Source of Support: Department of Defense/ARMY. REU Site: Data-driven Security Role: co-PI Source of Support: National Science Foundation. STEM Education for Cyber-Physical System Data-Driven Security. Role: PI. Source of Support: Idaho Stem Action Center and Idaho National Laboratories. The Cyberdome, a Collaborative Education and Workforce Development Initiative. Role: co-PI. Source of Support: Idaho State Board of Education. Integrated Faculty Workshop on Artificial Intelligence for Cybersecurity. Role: co-PI. Source of support: NSA: NCAE-C. Meta Data Traffic Anomaly Detection via Interpretable Temporal Structural Provenance Graph Representation Learning. Role: PI. Source of support: NSA: NCAE-C. Some Recent PublicationsLayne, J., Ratul, Q., Serra. E., and Jajodia, S, 2024 Analyzing Robustness of Automatic Scientific Claim Verification Tools against Adversarial Rephrasing Attacks,  accepted to ACM TIST.Layne, J., Carpenter, J., Serra, E., & Gullo, F. (2023). Temporal sir-gn: Efficient and effective structural representation learning for temporal graphs. Proceedings of the VLDB Endowment, 16(9), 2075-2089.Shrestha, A., Duran, J., Spezzano, F., & Serra, E. (2023). Joint Credibility Estimation of News, User, and Publisher via Role-relational Graph Convolutional Networks. ACM Transactions on the Web, 18(1), 1-24.Joaristi, M., and Serra E., 2022. Structural Iterative Lexicographic Autoencoded Node Representation. Accepted to Data Mining and Knowledge Discovery, Springer DAMI.Giuseppe Manco, Ettore Ritacco, Antonino Rullo, Domenico Saccà, Edoardo Serra: Machine learning methods for generating high dimensional discrete datasets. WIREs Data Mining Knowl. Discov. 12(2) (2022)Shankar Das, S., Serra, E., Halappanavar, M., Pothen, A. and Al-Shaer, E., 2021. V2W-BERT: A Framework for Effective Hierarchical Multiclass Classification of Software Vulnerabili-ties. 8th IEEE International Conference on Data Science and Advanced Analytics, DSAA 2021, Porto, Portugal, October 6-9, 2021. (Best Application Paper)Joaristi, M., and Serra E., 2021. SIR-GN: A Fast Structural Iterative Representation Learning Approach For Graph Nodes. Accepted to ACM Transactions on Knowledge Discovery from Data.Guzzo, A., Rullo, A., Serra, E., and Joaristi, M., 2021. A Multi-perspective Approach for the Analysis of Complex Business Processes Behavior. Elsevier Expert Systems with Applications,114934.Chen, Haipeng, Mohammad T. Hajiaghayi, Sarit Kraus, Anshul Sawant, Edoardo Serra, V. S. Subrahmanian, and Yanhai Xiong. \"PIE: A Data-Driven Payoff Inference Engine for Strategic Security Applications.\" IEEE Transactions on Computational Social Systems (2020).Edoardo Serra, Anu Shrestha, Francesca Spezzano and Anna Squicciarini. DeepTrust: An Automatic Framework to Detect Trustworthy Users in Opinion-based Systems, CODASPY 2020Mikel Joaristi, Arthur Putnam, Alfredo Cuzzocrea, and Edoardo Serra, RIBS: Risky Blind-Spots for Attack Classification Models, accepted to IEEE BigData PSBD 2019 Farhad Rasapour, Edoardo Serra, Hoda Mehrpouyan, Framework for Detecting ControlCommandInjection Attacks on Industrial Control Systems(ICS), accepted to CANDAR 2019 (The Seventh International Symposium on Computing and Networking)Samer Khamaiseh, Edoardo Serra, Zhiyuan Li and Dianxiang Xu, Detecting Saturation Attacks in SDN via Machine Learning, ICCCS 2019 (Runner up for the Best Paper Award)Domenico Sacca, Rullo, Antonino, Edoardo Serra.  Extending Inverse Frequent Itemsets Mining to Generate Realistic Datasets: Complexity, Accuracy and Emerging Applications\", accepted for publication in Data Mining and Knowledge Discovery Journal, 2019.Rullo, Antonino, Edoardo Serra, and Jorge Lobo. \"Redundancy as a Measure of Fault-Tolerance for the Internet of Things: A Review.\" In Policy-Based Autonomic Data Governance, pp. 202-226. Springer, Cham, 2019.Rullo, Antonino, Edoardo Serra, Elisa Bertino, and Jorge Lobo. \"Optimal Placement of Security Resources for the Internet of Things.\" In The Internet of Things for Smart Urban Ecosystems, pp. 95-124. Springer, Cham, 2019.Joaristi, Mikel, Edoardo Serra, and Francesca Spezzano. \"Inferring Bad Entities Through the Panama Papers Network.\" In 2018 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM), pp. 767-773. IEEE, 2018. (Best Paper Award)Korzh, Oxana, Mikel Joaristi, and Edoardo Serra. \"Convolutional Neural Network Ensemble Fine-Tuning for Extended Transfer Learning.\" In International Conference on Big Data, pp. 110-123. Springer, Cham, 2018.Serra, Edoardo, Haritha Akella, and Alfredo Cuzzocrea. \"A Crowdsourcing Semi-Supervised LSTM Training Approach to Identify Novel Items in Emerging Artificial Intelligent Environments.\" In 2018 17th IEEE International Conference on Machine Learning and Applications (ICMLA), pp. 1479-1485. IEEE, 2018.Serra, Edoardo, Ashish Sharma, Mikel Joaristi, and Oxana Korzh. \"Unknown landscape identification with CNN transfer learning.\" In 2018 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM), pp. 813-820. IEEE, 2018.Publications Google ScholarTeachingCS 534: Machine LearningCS 421 - CS 521: Design of AlgorithmsRelevant Professional ServiceProgram Chair of Multidisciplinary International Symposium on Disinformation in Open Online Media 2022 (MISDOOM 2022)General Chair of 33rd ACM International Conference on Information and Knowledge Management 2024 (CIKM 2024)Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 7447,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:39"
}