{
  "name": "Edouard Bugnion",
  "homepage": "https://people.epfl.ch/edouard.bugnion",
  "status": "success",
  "content": "Edouard Bugnion — People - EPFL Edouard Bugnion Edit profile edouard.bugnion@epfl.ch +41 21 693 79 97 http://dcsl.epfl.ch Google Scholar ID Linkedin ID Vice-president for Innovation and Impact, VPI Vice-presidency - Administration EPFL > VPI > VPI-VP > VPI-VP-GE Full Professor, Data Center Systems Laboratory EPFL IC IINFCOM DCSL INN 237 (Bâtiment INN) Station 14 1015 Lausanne +41 21 693 79 97 +41 21 693 47 07 Office: INN 237 EPFL > IC > IINFCOM > DCSL President, Fondation EPFL Innovation Park ENTREPRISES > EIP > SOCIETES-EIP > FOND-EIP-GE Web site: Web site: https://www.epfl-innovationpark.ch Member, Global Ethics and Partnerships Committee EPFL > VPA > VPA-FAC > GEP Web site: Web site: https://go.epfl.ch/gep vCard Données administratives Fields of expertise Computer Systems, Data center infrastructure and networking, Operating systems, Virtualization Biography Prof. Edouard Bugnion is a Full Professor in the School of Computer Science and Communications at EPFL. His primary focus in both teaching and research lies in the field of datacenter systems.  Before joining EPFL in 2012, he spent 18 years in the US, during which he earned his PhD from Stanford University and co-founded two startups: VMware and Nuova Systems (acquired by Cisco). He served as VMware’s first CTO and was later the VP/CTO of Cisco’s Server, Access, and Virtualization Technology Group.  Prof. Bugnion is an ACM Fellow, a member of the Swiss Academy of Technical Sciences (SATW), and a recipient of the ACM software systems award. Prof Bugnion served as EPFL Vice President for Information Systems between 2017 and 2020 and as a Director of InnoSuisse from 2017 until 2024. As of January 2025, he holds the position of Vice President for Innovation and Impact at EPFL.  He additionally serves as an independent Director on the boards of Logitech and the International Committee of the Red Cross (ICRC). Current Research I am generally interested in all aspects of data center systems. Together with my students, we are currently active in projects focused on :  Datacenter efficiency, with a focus on infrastructure support in network and data planes for OLDI applications.  System security, with a focus on building solutions from Trusted Execution Environments offered in hardware. Teaching Current classes:* Spring:CS-212- Systems Programming Project(with Dr. Chappelier)  S21, S17, S16Previous classes:* Fall:CS-522: Principles of Computer Systems(with Prof. Argyraki, Prof. Candea, and Prof. Koch) (F12, F 13, F14, F15) * Spring:CS-410: Technology Ventures in IC S14,S15,S16 Show more Education Ph.D. Computer Science Stanford University 2012 M.Sc. Computer Science Stanford University 1996 Dipl.-Ing. Informatik ETHZ 1994 Awards 2017 : Elected Fellow of Association for Computing Machinery (ACM) 2009 : ACM Software System Award Publications Infoscience publications EPFL Infoscience (2012 only) The Design and Implementation of a Virtual Firmware MonitorC. Castes; F. Costa; N. S. Kalani; T. Roscoe; N. Foster et al.2025. ACM SIGOPS 31st Symposium on Operating Systems Principles, Seoul, Republic of Korea, 2025-10-13 - 2025-10-16. p. 85 - 100. DOI : 10.1145/3731569.3764826.Detailed recordView at publisherLightweight Hypervisor Verification: Putting the Hardware Burger on a DietC. Castes; F. Costa; N. Foster; T. Bourgeat; E. Bugnion2025. The ACM SIGOPS 20th Workshop on Hot Topics in Operating Systems, Banff, Canada, 2025-05-14 - 2025-05-16. p. 27 - 33. DOI : 10.1145/3713082.3730373.Detailed recordView at publisherShattering the Ephemeral Storage Cost Barrier for Data-Intensive Serverless WorkflowsS. Jesalpura; D. Ustiugov; M. Baczun; B. A. Malper; R. Feyzkhanov et al.2025. Twentieth European Conference on Computer Systems (EuroSys 2025), Rotterdam, Netherlands, 2025-03-30 - 2025-04-03. p. 33 - 41. DOI : 10.1145/3721465.3721866.Detailed recordView at publisherEnhancing the Receiver-Driven Transport Paradigm with Sender Congestion InformationK. Prasopoulos / E. Bugnion; E. M. Kogias (Dir.) Lausanne, EPFL, 2025. DOI : 10.5075/epfl-thesis-10880. Detailed recordView at publisherDuplicate detection against data leakage in a company settingN. Duchesne2024Detailed recordHighly Parallel RTL SimulationS. Emami / E. Bugnion; J. R. Larus (Dir.) Lausanne, EPFL, 2024. DOI : 10.5075/epfl-thesis-9908. Detailed recordView at publisherA RISC-V Extension to Minimize Privileges of Enclave RuntimesN. Kalani; E. Bugnion2023. SysTEX '23 (Colocated with EuroSys'23), Rome, Italy, May 8-12, 2023. DOI : 10.1145/3578359.3593040.Detailed recordView at publisherCreating Trust by Abolishing HierarchiesC. Castes; A. Ghosn; N. S. Kalani; Y. Qian; M. Kogias et al.2023. 19th Workshop on Hot Topics in Operating Systems (HOTOS '23), Providence, RI, USA, June 22 - 24, 2023. p. 231 - 238. DOI : 10.1145/3593856.3595900.Detailed recordView at publisherDeploying Decentralized, Privacy-Preserving Proximity TracingC. Troncoso; D. Bogdanov; E. Bugnion; S. Chatel; C. Cremers et al.Communications Of The Acm. 2022. DOI : 10.1145/3524107.Detailed recordView at publisherA Use Case Oriented Survey of Self-Sovereign IdentityF. Gerber2022Detailed recordAttestable Software Versioning for Stateful Confidential ComputingC. Castes; E. Bugnion2022. 5th Workshop on System Software for Trusted Execution (SysTEX 2022), Lausanne, Switzerland, March 1st, 2022. Detailed recordHidden Filesystem Design and ImprovementE. Anzuoni2022Detailed recordBuilding a path towards responsible use of BiometricsJ. Sukaitis2021Detailed recordWhen to Hedge in Interactive ServicesM. Primorac; K. Argyraki; E. Bugnion2021. 18th USENIX Symposium on Networked Systems Design and Implementation, Virtual Conference, April 12-14, 2021. p. 373 - 388. Detailed recordEnclosure: Language-Based Restriction of Untrusted LibrariesA. Ghosn; M. Kogias; M. Payer; J. Larus; E. Bugnion2021. ASPLOS 21, Virtual Conference, April 19-23, 2021. p. 255 - . DOI : 10.1145/3445814.3446728.Detailed recordView at publisherBenchmarking, Analysis, and Optimization of Serverless Function SnapshotsD. Ustiugov; P. Petrov; M. Kogias; E. Bugnion; B. Grot2021. ASPLOS 21, Virtual Conference, April 19-23, 2021. p. 559 - 572. DOI : 10.1145/3445814.3446714.Detailed recordView at publisherCrowdNotifier: Decentralized Privacy-Preserving Presence TracingW. Lueks; S. Gürses; M. Veale; E. Bugnion; M. Salathé et al.2021. p. 350 - 368. DOI : 10.2478/popets-2021-0074.Detailed recordView at publisherTrust as a Programming PrimitiveA. Ghosn / E. Bugnion; J. R. Larus (Dir.) Lausanne, EPFL, 2021. DOI : 10.5075/epfl-thesis-8165. Detailed recordView at publisherEarly evidence of effectiveness of digital contact tracing for SARS-CoV-2 in SwitzerlandM. Salathe; C. L. Althaus; N. Anderegg; D. Antonioli; T. Ballouz et al.Swiss Medical Weekly. 2020. DOI : 10.4414/smw.20457.Detailed recordView at publisherA research agenda for digital proximity tracing appsV. W. Viktor; B. Sebastian; B. Edouard; P. M. Alan; S. Marcel et al.Swiss Medical Weekly. 2020. DOI : 10.4414/smw.2020.20234.Detailed recordView at publisherSLOG: Your switch is also your load-generatorM. Kogias; M. Weber; E. BugnionNSDI'20: 17th USENIX Symposium on Networked Systems Design and Implementation, Santa Clara, CA, USA, February 25–27, 2020.Detailed recordOperating System and Network Co-Design for Latency-Critical Datacenter ApplicationsE. M. Kogias / E. Bugnion (Dir.) Lausanne, EPFL, 2020. DOI : 10.5075/epfl-thesis-7108. Detailed recordView at publisherExtending R2P2 with Congestion Control and Request-Level SchedulingK. Prasopoulos2020Detailed recordHovercRaft: Achieving Scalability and Fault-tolerance for microsecond-scale Datacenter ServicesM. Kogias; E. Bugnion2020. EuroSys 2020, Heraklion, Crete, Greece, Avril 27-30, 2020. DOI : 10.1145/3342195.3387545.Detailed recordView at publisherTail-tolerance as a Systems Principle not a MetricM. Kogias; E. Bugnion2020. 4th Asia-Pacific Workshop on Networking (APNet), ELECTR NETWORK, 2020-08-03 - 2020-08-04. p. 16 - 22. DOI : 10.1145/3411029.3411032.Detailed recordView at publisherUnderstanding and Mitigating Latency Variability of Latency-Critical ApplicationsM. Primorac / E. Bugnion; A. Argyraki (Dir.) Lausanne, EPFL, 2020. DOI : 10.5075/epfl-thesis-10253. Detailed recordView at publisherMeasuring Network Service Latencies with a Programmable DataplaneM. T. Weber2019Detailed recordA zero-copy key-value store in RustO. Q. Bouvier2019Detailed recordR3P2: a Replicated Request-Response Pair ProtocolA. Albertelli2019Detailed recordScaling Out Bioinformatics in the Data CenterS. D. Whitlock / E. Bugnion (Dir.) Lausanne, EPFL, 2019. DOI : 10.5075/epfl-thesis-9451. Detailed recordView at publisherLancet: A self-correcting Latency Measuring ToolM. Kogias; S. Mallon; E. Bugnion2019. USENIX Annual Technical Conference 2019, Renton, WA, USA, July 10-12, 2019. p. 881 - 895. Detailed recordSecured Routines: Language-based Construction of Trusted Execution EnvironmentsA. Ghosn; J. Larus; E. Bugnion2019. USENIX Annual Technical Conference 2019, Renton, WA, USA, July 10-12, 2019. p. 571 - 585. Detailed recordR2P2: Making RPCs first-class datacenter citizensM. Kogias; G. Prekas; A. Ghosn; J. Fietz; E. Bugnion2019. USENIX Annual Technical Conference 2019, Renton, WA, USA, July 10-12, 2019. p. 863 - 879. Detailed recordPrefetched Address TranslationA. Margaritov; D. Ustiugov; E. Bugnion; B. Grot2019. 52nd Annual IEEE/ACM International Symposium on Microarchitecture (MICRO), Columbus, OH, Oct 12-16, 2019. p. 1023 - 1036. DOI : 10.1145/3352460.3358294.Detailed recordView at publisherTraffic Locality as an Opportunity in the Data CenterJ. Fietz / A. Argyraki; E. Bugnion (Dir.) Lausanne, EPFL, 2019. DOI : 10.5075/epfl-thesis-9604. Detailed recordView at publisherDesign Guidelines for High-Performance SCM HierarchiesD. Ustiugov; A. Daglis; J. Picorel Obando; M. J. Sutherland; E. Bugnion et al.2018. 4th International Symposium on Memory Systems (MEMSYS), Old Town Alexandria, VA, USA, October 1-4, 2018. DOI : 10.1145/3240302.3",
  "content_length": 16777,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:48"
}