{
  "name": "Eduard Eiben",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/eduard-eiben(9ee8fd8f-cbc6-4365-bda4-79850f62e36d).html",
  "status": "success",
  "content": "Eduard Eiben - Royal Holloway Research Portal Eduard Eiben Dr Lecturer in Computer Science, Department of Computer ScienceCentre for Intelligent Systems https://orcid.org/0000-0003-2628-3435 Phone+44 1784 276819EmailEduard.Eibenrhul.acuk TW20 0EX Personal profile Personal profileI am currently a Lecturer in Computer Science at Royal Holloway, University of London.Before joining Royal Holloway, between October 2017 and October 2019, I was a Postdoctoral researcher in the Algorithms group at the Department of Informatics, University of Bergen, Norway, hosted by Daniel Lokshtanov.For more up-to-date list of publications you cal also see my DBLP entry or Google Scholar.Educational background I completed my PhD in Theoretical Computer Science as a member of the Doctoral College Logical Methods in Computer Science and of the Algorithms and Complexity Group at TU Wien under the supervision of Prof. Dr. Stefan Szeider and Dr. Robert Ganian in April 2018. My dissertation thesis titled \"Exploiting new types of structure for fixed-parameter tractability\" can be found here.I did my master and bachelor studies in Computer Science  at Comenius University, Bratislava, Slovakia. Research interestsI am mosty interested in Parameterized Algorithms and Complexity. Especially for problems from Artificial Intelligence and Graph Theory. Education/Academic qualificationComputer Sicence, Dr. Techn., Exploiting new types of structure for fixed-parameter tractability, Algorithms and Complexity Group, TU Wien, Vienna, Austria1 Sept 2014 → 22 Oct 2017Award Date: 9 Apr 2018Computer Science, Postdoctoral Researcher, Pareto-Optimal Parameterized Algorithms, Department of Informatics, University of Bergen23 Oct 2017 → 30 Sept 2019 Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 24 Conference contribution 18 Article 8 Paper 1 Chapter Research output per year Research output per year Determinantal SievingEiben, E., Koana, T. & Wahlström, M., 2 Oct 2025, In: TheoretiCS. 4Research output: Contribution to journal › Article › peer-review Open Access EF1 and EFX OrientationsDeligkas, A., Eiben, E., Goldsmith, T.-L. & Korchemna, V., 11 May 2025, (Accepted/In press) 34th International Joint Conference on Artificial Intelligence: IJCAI 2025.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Polynomial Kernel and Incompressibility for Prison-Free Edge Deletion and CompletionBel Hourari-Durand, S., Eiben, E. & Wahlström, M., 24 Feb 2025, Proceedings of STACS 2025. p. 21:1–21:17 17 p. 21Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 38 Downloads (Pure) Being an influencer is hard: The complexity of influence maximization in temporal graphs with a fixed sourceDeligkas, A., Döring, M., Eiben, E., Goldsmith, T.-L. & Skretas, G., Aug 2024, In: Information and Computation. 299, 19 p., 105171.Research output: Contribution to journal › Article › peer-review Bi-objective Optimization in Role MiningCrampton, J., Eiben, E., Gutin, G., Karapetyan, D. & Majumdar, D., 9 Nov 2024, In: ACM Transactions on Privacy and Security. 28, 1, 22 p., 5.Research output: Contribution to journal › Article › peer-review Open AccessFile 14 Downloads (Pure) View all 51 research outputs Prizes Best paper award at SACMAT 2022Crampton, J. (Recipient), Eiben, E. (Recipient), Gutin, G. (Recipient), Karapetyan, D. (Recipient) & Majumdar, D. (Recipient), 10 Jun 2022Prize: Prize (including medals and awards) Best paper award at the 26th ACM Symposium on Access Control Models and Technologies (SACMAT 2021)Crampton, J. (Recipient), Eiben, E. (Recipient), Gutin, G. (Recipient), Majumdar, D. (Recipient) & Karapetyan, D. (Recipient), 2021Prize: Prize (including medals and awards)",
  "content_length": 4085,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:48"
}