{
  "name": "Eduardo Cunha De Almeida",
  "homepage": "https://www.inf.ufpr.br/eduardo",
  "status": "success",
  "content": "Eduardo Almeida's Home Page Eduardo Cunha de Almeida Professor Titular, DInf, UFPR Contact information: UFPR, Department of Informatics (Dinf) Rua Cel. Francisco H. dos Santos, 100Centro Politecnico - Jardim das AméricasCuritiba-PR, CEP: 81.531-980, BrasilPhone: +55 (41) 3361 3656 Research, Projects and Publications My research interest is in database systems and data management. Current projects, include: DoricStore, a Column-Store for emerging hardware. BigData Rules (BDR), discovering business rules from data profiling. My projects are supported by CNPQ and the C3SL group. Topics for TCC, Master and Ph.D. (Portuguese and English) Teaching (in Portuguese) 2024-2 Os links para as páginas das disciplinas são: CI1057 - Algoritmos e Estruturas de Dados III CI1219 - Sistemas Avançados de BD Acesso às páginas é por autoinscrição. A senha será fornecida em sala de aula. Community Activities and Software Short Bio Selected Publications How and Why False Denial Constraints are Discovered. Albert Martin, Eduardo C. de Almeida, Oscar Romero, and Anna Queralt. PVLDB, 18(10): 2025 (PDF). Fast Constraint-based Error Detection. Eduardo H. Pena, Eduardo C. de Almeida, Felix Naumann. PVLDB, 2022 (PDF) Multidimensional Adaptive and Progressive Indexes. Matheus A. Nerone, Pedro Holanda, Eduardo C. de Almeida, Stefan Manegold. ICDE, 2021 (PDF) Investigating Automatic Parameter Tuning for SQL-on-Hadoop Systems. Edson Ramiro Lucas Filho, EduardoCunha de Almeida, Stefanie Scherzinger, Herodotos Herodotou. Big Data Research, 2021 (DOI, Pre-print) Efficient Detection of Data Dependency Violations. Eduardo H. Pena, Eduardo C. de Almeida, Edson R. L. Filho, Felix Naumann. CIKM, 2020 (PDF) (Best Short-Paper Runner up) A Framework for Analyzing the Impact of Missing Data in Predictive Models. Fabiola Santore, Eduardo C. de Almeida, Eduardo H. Pena, Luiz Eduardo S. de Oliveira, Wagner Bonat. CIKM, 2020 (PDF) Discovery of Approximate (and Exact) Denial Constraints. Eduardo H. Pena, Eduardo C. de Almeida, Felix Naumann. PVLDB, 2019, Vol. 3 Issue 3 (PDF) Database Processing-in-Memory: An Experimental Study. Tiago R. Kepe, Eduardo C. de Almeida, Marco A. Z. Alves. PVLDB, 2019, Vol. 3 Issue 3 (PDF) (Best Paper Award) Don’t Tune Twice: Reusing Tuning Setups for SQL-on-Hadoop Queries. Edson R. L. Filho, Eduardo C. de Almeida,Stefanie Scherzinger. ER, 2019 (PDF) An Elastic Multi-Core Allocation Mechanism for Database Systems. Simone Dominico, Eduardo C. de Almeida, Jorge A. Meira, Marco A. Z. Alves. ICDE 2018 (PDF, slides) ControVol: A Framework for Controlled Schema Evolution in NoSQL Application Development S. Scherzinger, T. Cerqueus, E. Cunha de Almeida. In: ICDE 2015. (PDF) Testing peer-to-peer systems. Eduardo Cunha de Almeida, Gerson Sunyé, Yves Le Traon, Patrick Valduriez. Empir. Softw. Eng. 15(4): 346-379 (2010) (doi) (Best Paper Runner-up) A Framework for Testing Peer-to-Peer Systems. Eduardo Cunha de Almeida, Gerson Sunyé, Yves Le Traon, Patrick Valduriez: IEEE ISSRE 2008: 167-176. (doi) Current Ph.D. Students: Sérgio Marques (work presented at ACM SIGMOD Research Competition'23 winning 3rd place - ACM Sigmod award link) Graduated Ph.D.: Simone Dominico, 2022 (work presented at VLDB PhD Workshop'18) Leandro Batista de Almeida, 2021, co-advised with Anthony Ventresque, UCD-Dublin (work presented at the 53rd IEEE ICC) Eduardo Henrique Pena, 2020, co-advised with Felix Naumann, HPI Potsdam (work presented at VLDB PhD Workshop'18) Edson Ramiro Lucas Filho, 2020 (work presented at ACM SIGMOD Research Competition'17) Tiago Rodrigo Kepe, 2019, co-advised with Marco Zanata (work presented at VLDB PhD Workshop'18) Jorge Augusto Meira, 2014, co-advised with Yves Le Traon, SNT-Luxembourg I acknowledge grants received by my students along their Ph.D. to attend conferences, buy/use equipment and we are grateful. We received generous grants from the VLDB Endowment, ACM, SIGMOD, SIGIR, Amazon AWS, NVIDIA, MEC-Brazil, MINCOM-Brazil, CAPES, CNPQ and SmartEdge. Updated: 28/10/2025",
  "content_length": 4027,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:52"
}