{
  "name": "Eduardo da Veiga Beltrame",
  "homepage": "https://mbzuai.ac.ae/study/faculty/eduardo-beltrame",
  "status": "success",
  "content": "Eduardo Beltrame - MBZUAI MBZUAI About About Leadership and Governance Alumni Mission Faculty Directory Fast Facts Office of the President Office of the Provost Study Study Graduate Admission Process Undergraduate Admission Process Faculty Directory Aspire Ph.D. Fellowship Program Master in Applied Artificial Intelligence (MAAI) Master’s Programs Ph.D. Programs Undergraduate Program Undergraduate Research Internship Program University Catalogue Research Research Computer Vision Research Machine Learning Research Natural Language Processing Projects Research Centers Innovate Innovate Consulting Incubation and Entrepreneurship Center Institute of Digital Public Health Institute of Foundation Models Office of Public Affairs and Alumni Relations Partnerships and Collaborations Training Programs Student Resources Undergraduate Academic Calendar Graduate Academic Calendar Campus Facilities Career Services and Internships Publications Repository Educational Affairs Library Portal Office of the Registrar Campus Map News & Events Commencement Events Media Center The Node | Stories of MBZUAI MBZUAI Nexus | The Global AI Research & Knowledge Network Apply now Home / Faculty directory / Eduardo Beltrame Eduardo Beltrame Assistant Professor of Computational Biology Research Interests Professor Beltrame’s main research interest is on developing methods and tools for working with biological data generated by single cell omics technologies, which are key to advancing precision medicine. He is particularly interested in single cell RNA sequencing, which measures the RNA contents of thousands of individual cells from a biological sample in a single experiment at unprecedented scale and biological resolution. Data is now being generated much faster than researchers can analyze it, and Professor Beltrame seeks to develop new methods and tools that can streamline biological analysis and make it easy to ask biological questions about the data for researchers of all backgrounds. He is also interested in exploring the development of interactive analysis tools that incorporate recent advances in machine learning, such as natural language models, which can make biological analysis easier, faster and broaden access to more researchers. Email Share Prior to joining MBZUAI, Professor Beltrame was bioinformatics lead at ImYoo, a biotechnology startup spun out of Caltech research that executes decentralized immune studies using single cell omics. Before ImYoo, Professor Beltrame was founding scientist at Retro Biosciences, a biotechnology startup developing ageing-related therapeutics. Professor Beltrame holds a Ph.D. in bioengineering from Caltech, where his primary research focus was on the development of experimental and computational methods and tools for single cell RNA sequencing and their application to answering biological questions. He is also a visiting scholar at UC Berkeley School of Education, working on a research partnership with innovative STEM education programs in Brazil. Ph.D. in Bioengineering from the California Institute of Technology, 2021. B.S. in Biological Physics from Brandeis University, 2016. Adam Gayoso, Romain Lopez, Galen Xing et al: “A Python library for probabilistic analysis of single-cell omics data”, Nature biotechnology, 2022. Páll Melsted, A. Sina Booeshaghi, et al: “Modular, efficient and constant-memory single-cell RNA-seq preprocessing”, Nature biotechnology, 2021. Valentine Svensson, Eduardo da Veiga Beltrame, Lior Pachter: “A curated database reveals trends in single-cell transcriptomics”, Database, Volume 2020, 2020. Eduardo da Veiga Beltrame, Valerio Arnaboldi, Paul W Sternberg: “WormBase single-cell tools”, Bioinformatics Advances, 2022. A. Sina Booeshaghi, Eduardo da Veiga Beltrame, Dylan Bannon, Jase Gehring & Lior Pachter: “Principles of open source bioinstrumentation applied to the poseidon syringe pump system”, Scientific Reports, 2019. Eduardo Da Veiga Beltrame, James Tyrwhitt-Drake, Ian Roy, Raed Shalaby, Jakob Suckale & Daniel Pomeranz Krummel: “3D Printing of Biomolecular Models for Research and Pedagogy”, JoVE, 2017. Google Scholar Personal website LinkedIn Related Saturday, October 04, 2025 MBZUAI celebrates faculty excellence at annual recognition reception Awards were presented to seven faculty members for their exceptional achievements in research, mentorship, community, and beyond. research provost faculty community award impact mentorship service Read more Wednesday, June 04, 2025 MBZUAI brings bioinformatics community together for Single Cell Summer Workshop Hosted by the University’s Computational Biology department, the workshop sought to develop practical skills and strengthen the… health computational biology community workshop institute of digital public health single cell omics bioinformatics biology Read more Thursday, January 30, 2025 Research Talks: Bridging neuroscience and AI Caltech’s Surya Narayanan Hari explains how the human brain can be the perfect model for improving memory… memory biology computer science Research talks computational biology Read more Contact faculty affairs Interested in working with our renowned faculty? Fill out the below form and we will get back to you. Please enable JavaScript in your browser to complete this form.Name *Organization *Phone number *Email *Message *Checkboxes *I consent to receive communication from MBZUAISubmitSubmit x We use cookies We use necessary and analytics cookies to operate our website, analyze traffic, and improve your experience. By continuing to use this website, you agree to our use of cookies. Learn more Got it",
  "content_length": 5618,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:01"
}