{
  "name": "Edward Sykes",
  "homepage": "https://www.uoguelph.ca/computing/people/edward-sykes",
  "status": "success",
  "content": "Edward Sykes | School of Computer Science Edward Sykes Assistant ProfessorEmail:  sykes@uoguelph.caOffice:  Reynolds Building, RM: 2209Website links: Personal WebsiteLinkedInORCIDGoogle ScholarResearchGate Find Related People by Keyword ai, AI and Health, Deep Learning, Generative AI, Machine Learning Available positions for grads/undergrads/postdoctoral fellows Seeking academic or industry partnerships in the area(s) of: AI + Health Research Interests Countries around the world are experiencing significant growth in their aging populations. By 2050, the number of people aged 65 or older is projected to more than double globally. The United Nations estimates that 1 in 6 people worldwide will be over 65 by 2050, up from 1 in 11 in 2019. Given these trends, it is crucial to develop innovative solutions to mitigate the impact of aging on healthcare systems.  Dr. Sykes’ research is dedicated to improving the quality of life for Canada's aging population through the innovative development of advanced AI technologies. Alongside his research students and colleagues, over the last decade, Dr. Sykes has contributed to the field of mHealth and AI and Health. Dr. Sykes has co-authored over 70 peer-reviewed scientific articles, including 28 journal papers, 44 conference papers, and 2 book chapters. AI + Chronic Disease Management: Chronic diseases such as heart disease, chronic respiratory conditions, and diabetes are leading causes of morbidity and mortality in Canada, and other countries. Managing these conditions is resource-intensive and challenging. The main goal of this research is to develop AI solutions for heart disease, chronic respiratory conditions and diabetes that can analyze datasets to identify patterns, classify abnormalities, and predict disease progression. Our AI models will enable personalized treatment plans to improve patient outcomes and optimize resources.  Recent publications from our team on this topic include: Derakhshan, F., Mastracci, N., Sykes, E. R. (2024); Mastracci, N., Derakhshan, F., Sykes, E. R. (2023). AI + Aging Population and Elder Care: The rapid growth in aging populations is increasing the demand for elder care services and straining healthcare systems and caregiving resources. To address this, we are developing AI models that can effectively predict and anticipate the healthcare needs of the elderly, facilitating proactive care. Our solutions involve Fall Detection, Imminent Fracture Risk Assessment, and insights and predictions based on smart clothing and wearable devices to monitor seniors' health in real-time. Recent publications from our team on this topic include: El Salti, T., Sykes, E. R., Scrivo, J., Plaza, B., and Mun, V. (2024); Sykes, E. R., Voytenko, V., Hogan, G. (2024); Sykes, E. R., Jain, R., Voytenko, V., Inmez, E., Koya, P., Khan, Z., Weldon, J., Shanker, R., Sauer, D., Siavashi, F., (2024); Tanbeer, S., and Sykes, E. R., (2024). AI + Healthcare Accessibility and Resource Allocation: There are disparities in healthcare access, especially in rural and remote areas of Canada. Efficient resource allocation remains a challenge. The main goal of this research involves creation AI-enhanced telemedicine solutions that enable remote diagnosis and treatment. Our approach includes developing AI-powered diagnostic support tools for assessments (e.g., changes in skin conditions or range of motion), thereby expanding access to quality healthcare for underserved populations.  Recent publications on this theme of research include: Arun, S., Sykes, E. R., Tanbeer, S. (2024); Tanbeer, S. and Sykes, E. R. (2021) and (2024); Mahmoud, E., Sykes, E. R., Erum, B., Schwenger, S., Poulin, J., Cheers, M. (2020). Share this page Share on Facebook Share on Twitter Share on LinkedIn Print this page",
  "content_length": 3788,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:09"
}