{
  "name": "Edward Jay Wang",
  "homepage": "https://www.ejaywang.com",
  "status": "success",
  "content": "ejaywang Edward Jay Wang, PhDResearcher / Educator/ EntrepreneurAssociate Professor UCSD ECE & Design LabCEO & Founder Billion Labs Inc.CTO & Founder Motion Minder Inc. TEDxSJI: What if we can live in a world where we can track our health like the way we do with the weather?Research Talk: The Next Billion Medical Devices (UChicago) Research Talk: Elevating Access to Remote Health Monitoring Fairly (CMU HCII Seminar) I am the Jacobs Faculty Chair in Entrepreneurship at UC San Diego in the Electrical and Computer Engineering department and the Design Lab as a jointly appointed Associate Professor with tenure. I am the PI of the UCSD Digital Health Technologies Lab. I am affiliated with the CSE department, Center for Wireless and Population Health Systems (CWPHS), Center for Wearable Systems (CWS), and serve as a Board of Director for the Center for Mental Health Technology (MHTech). I am also the Founder of two digital health companies born out of technologies developed in my academic laboratory: Billion Labs Inc. (NIH Funded) and Motion Minder Inc. My research focuses on enabling a diversity of remote health monitoring leveraging novel sensing solutions with mobile and wearable devices supported by intelligent user interfaces that are designed to support the nuance of the clinical/health use cases. I am actively creating new solutions in health monitoring with my expertise in mobile and embedded system prototyping, signal processing, machine learning, and a strong command of medical knowledge. I've transformed smartphones into medical devices to screen for anemia, measure blood pressure, and support breastfeeding, developed novel wearable devices that continuously track blood pressure and user context; and explored large scale natural living data of sleep to uncover patterns of sleep phenotypes. The next generation of medical sensing needs to leave the confines of labs and clinics to be truly usable by everyone. This has to start at even the earliest prototypes, something I strive for in all of my work. Towards this goal, I have tested technologies in patient rooms, performed in-the-wild studies where users take our prototypes home, and even partnered with various NGOs to perform true user testing in places like the Peruvian jungle. As a faculty entrepreneur, I actively engage in translation of my research towards commercialization and regulatory clearance. My work has been published in top tier venues such as Nature family journals (npj Digital Medicine, Scientific Reports), ACM (Ubicomp, IMWUT, CHI, UIST, ISWC), and IEEE (Pervasive Computing, EMBC), cumulating 7 paper awards for our contributions to the field of digital health. I have been awarded an NIH Trailblazer, Google Research Faculty Fellow, Don Norman Foundation Design Laureate, and an NSF Graduate Fellow. The work in my group is made possible by generous funding from the National Institute of Health, National Science Foundation, American College of Cardiology, and Google Research. Contact me at: ejaywang {at} ucsd {dot} eduThose looking for my PhD-era job market package: Research | Teaching | CV | Job TalkMost current information: Research | Teaching (see publications organized by theme) Publications 2024 Demographic Bias of Expert-Level Vision-Language Foundation Models in Medical ImagingYuzhe Yang, Yujia Liu, Xin Liu, Avanti Gulhane, Domenico Mastrodicasa, Wei Wu, Edward J Wang, Dushyant Sahani, Shwetak PatelScience Advances Oscillometric Blood Pressure Measurements on Smartphones using Vibrometric Force EstimationColin Barry, Yinan Xuan, Ava Fascetti, Alison Moore, Edward Jay WangScientific Reports Five million nights: temporal dynamics in human sleep phenotypesVarun K. Viswanath, Wendy Hartogenesis, Stephan Dilchert, Leena Pandya, Frederick M. Hecht, Ashley E. Mason, Edward Jay Wang & Benjamin L. Smarr npj Digital Medicine Augmenting Telepostpartum Care With Vision-Based Detection of Breastfeeding-Related Conditions: Algorithm Development and ValidationJessica De Souza, Varun Kumar Viswanath, Jessica Maria Echterhoff, Kristina Chamberlain, Edward Jay WangJMIR AI Using Peer-Customers to Scalably Pair Student Teams with Customers for Hands-on Curriculum Final ProjectsEdward Jay Wangarxiv VibroBP: An Oscillometric Smartphone Blood Pressure AppColin Barry, Tatsuo Kumamoto, Amparo Averbuj, Edward Jay WangUbicomp Demo Development of a One Dollar Blood Pressure MonitorYinan Xuan, Ava J. Fascetti, Colin Barry, Edward Jay WangUbicomp Poster Postable Spirometry: User-Assembled Vortex Whistle SpirometerAva Fascetti, Aatash Pestonjamasp, Colin Barry, Edward Jay WangEMBC 2023 A Calibration Method for Smartphone Camera PhotophlethysmographyYinan Xuan, Colin Barry, Nick Antipa and Edward Jay WangFrontiers in Digital Health Racially Fair Pupillometry Measurements for RGB smartphone cameras using the Far Red SpectrumColin Barry and Edward Jay WangScientific Reports Ultra-low-cost mechanical smartphone attachment for no-calibration blood pressure measurement  Yinan Xuan, Colin Barry, Jessica De Souza, Jessica H Wen, Nick Antipa, Alison A Moore, Edward J Wang Scientific Reports Journal Top 100 Neuromorphic High-Frequency 3D Dancing Pose Estimation in Dynamic EnvironmentZhongyang Zhang, Kaidong Chai, Haowen Yu, Ramzi Majaj, Francesca Walsh, Edward Wang, Upal Mahbub, Hava Siegelmann, Donghyun Kim, Tauhidur RahmanNeurocomputing Detecting Periodic Biases in Wearable-Based Illness Detection ModelsAmit Klein, Varun Kumar Viswanath, Benjamin Smarr, Edward Jay WangICLR 2023 Workshop on Time Series Representation Learning for Health Investigating interactive methods in remote chestfeeding support for lactation consulting professionals in BrazilJessica de Souza, Cinthia Calsinski, Kristina Chamberlain, Franceli Cibrian, Edward Jay WangFrontiers in Digital Health 2022 Detection of COVID-19 using multimodal data from a wearable device: results from the first TemPredict Study  Ashley Mason et al. Scientific Reports Journal Top 100 Smartphone camera oximetry in an induced hypoxemia studyJason S Hoffman, Varun K Viswanath, Caiwei Tian, Xinyi Ding, Matthew J Thompson, Eric C Larson, Shwetak N Patel, Edward J Wangnpj Digital Medicine At-Home Pupillometry using Smartphone Facial Identification Cameras  Colin Barry, Jessica De Souza, Yinan Xuan, Jason Holden, Eric Granholm, Edward Jay WangCHI 22 Best Paper Runner Up Opportunities in designing HCI tools for lactation consulting professionalsJessica De Souza, Kristina Chamberlain, Sidhant Gupta, Yang Gao, Nabil Alshurafa, Edward Jay WangCHI EA ‘20 SIG: Towards More Personal Health SensingJunyi Zhu, Liang He, Jun Nishida, Hamid Ghaednia, Cindy Hsin-Liu Kao, Jon E Froehlich, Edward Jay Wang, Stefanie MuellerCHI ‘20 Special Interest Group (Organizer) 2021 Tenets towards smartphone-based medical tricordersColin Barry, Tauhidur Rahman, Edward J WangMobisys ‘21 DigiBiom Workshop (Organizer) 2020 Multi-Channel Facial Photoplethysmography SensingParker S Ruth, Jerry Cao, Millicent Li, Jacob E Sunshine, Edward J Wang, Shwetak N PatelEMBC '20 2019 Challenges in Realizing Smartphone-Based Health Sensing  Alex Mariakakis, Edward J. Wang, Shwetak Patel, Mayank Goel. IEEE Pervasive Computing Volume: 18, Issue: 2, April-June 1 2019| PDFBest Paper Runner Up 2018 CASPER: Capacitive Serendipitous Power Transfer for Through-Body Charging of Multiple Wearable Devices. Edward J. Wang, Manuja Sharma, Yiran Zhao, and Shwetak N. Patel. ISWC '18 | PDF Seismo: Blood Pressure Monitoring using Built-in Smartphone Accelerometer and Camera.Edward J. Wang, Junyi Zhu, Mohit Jain, Tien-Jui Lee, Elliot Saba, Lama Nachman, and Shwetak Patel.CHI '18 | PDFBest Paper Honorable Mention (Top 5%) 2017 Carpacio: Repurposing Capacitive Sensors to Distinguish Driver and Passenger Touches on In-vehicle ScreensEdward J. Wang, Jake Garrison, Eric Whitmire, Mayank Goel, and Shwetak PatelUIST '17 | PDF Glabella: Continuously Sensing Blood Pressure Behavior using an Unobtrusive Wearable Device. Christian Holz and Edward J. Wang.PACM on Interactive Mobile, Wearable, and Ubiquitous Technologies (IMWUT) 1,3, Article 5 (September 2017) | PDFDistinguished Paper Award Noninvasive Hemoglobin Measurement using Unmodified Smartphone Camera and White FlashEdward J. Wang, William Li, Junyi Zhu, Rajneil Rana and Shwetak N. PatelEMBC 2017 | PDF 2016 HemaApp: Noninvasive Blood Screening of Hemoglobin using Smartphone Cameras.Edward J. Wang, William Li, Doug Hawkins, Terry Gernsheimer, Colette Norby-Slycord, and Shwetak N. Patel.Ubicomp '16 | PDFBest Paper Award (Top 1%) A Smartphone-based System for Assessing Intraocular PressureAlex Mariakakis, Edward J. Wang, Shwetak Patel and Joanne C. WenEMBC 2016 | PDF 2015 MagnifiSense: Inferring Device Interaction using Wrist-worn Passive Magneto-inductive Sensors.Edward J. Wang, Tien-Jui Lee, Alex Mariakakis, Mayank Goel, Sidhant Gupta, and Shwetak N. PatelUbiComp '15 | PDF Skin Drag Displays: Dragging a Physical Tactor across the User's Skin Produces a Stronger Tactile Stimulus than Vibrotactile.Alexandra Ion, Edward J. Wang, and Patrick Baudisch.CHI '15 | PDF 2013 Design Considerations for Leveraging Over-familiar Items for Elderly Health MonitorsEdward Wang, Samantha Ipser, Patrick Little, Noah Duncan, Benjamin Liu, Shinsaku Nakamura. HCII'13 | PDF Research ThemesBootstrapping The Next Billion Medical DevicesToday's medical devices are typically centralized in high-resource places like hospitals and cities, leaving a large portion of the world like low-income regions, rural areas, and chronic at home care scenarios under serviced. The proliferation of smartphones present an interesting opportunity to solve this issue of global access to medical screening and management. Smartphones have a variety of sensors built in to them, and by tapping into these sensors through software augmentations, I've worked on solutions to transform the billions of smartphone into a medical device, with a simple app download. Widely Distributable Hypertension Screening: Vibro",
  "content_length": 23104,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:59"
}