{
  "name": "Edward Hermann Haeusler",
  "homepage": "http://www-di.inf.puc-rio.br/~hermann",
  "status": "success",
  "content": "Edward Hermann Haeusler's Home Page Hermann Professor Associado Departamento de Informática Pontifícia Universidade Catolica do Rio de Janeiro (PUC-Rio) Rio de Janeiro, RJ 22453-900, Brasil Prédio do RDC, Sala 515 Tel: +55 021 3527-1502 Ramal 4345 Fax: +55 021 3527-5645 Email: hermann@inf.puc-rio.br Wovon man nicht sprechen kann, daruber muss man schweigen Wittgenstein I studied in Universidade de Brasília (BS in Math, 1983) and PUC-Rio (MSc in CS, 1986 and DSc in CS, 1990). From 1986 to 1990 I taugh at Universidade Federal Fluminense. Since 1991 I have been teaching at PUC-Rio. Here is a list of my former PhD students . My research interests are Proof Theory, Automated Theorem Proving, Logical Systems, Category Theory (CT), Toposes and Higher-Order Theories and their Models, Semantics, and the application of this knowledge and the techniques emerged from them in Software Development and Validation. Structural and Computational Complexity call my attention too. I have written, together with Paulo Blauth Menezes, a book on Category Theory for Computer Science, aimed to help teaching CT to undergraduated classes. It is (still) only in Portuguese. Some publications accessed from different bibliography lists (of course they overlap !): Almost all Publications since 1988 Publications listed on MathSciNet Google Sholar profile . Complete CV hosted at CNPq (Brazilian Research Council) Teaching Courses at PUC-Rio (in portughese) Tutorials at Meetings I am also the coordinator of the thematic laboratory on Formal Methods and Logical Reasoning (TecMF) at PUC-Rio. There we develop industrially and academically funded projects. Here is a list of former projects coordinated by myself. I spent post-doctoral leavings at Aarhus University (1994) and at Tuebingen University (2003). I take part of the GETFUN project. I mostly take part of the following academic meetings: Workshop on Logical and Semantic Frameworks . In 2012 friends celebrated my 50th birthday. Here it is the Festschrift shedule. I am quite proud of these friends. Brazilian Logic Conference UNILOG.. My tutorial at UNILOG it is here Latin American Symposium in Mathematical Logic COLÓQUIO CONESUL DE FILOSOFIA DAS CIÊNCIAS FORMAIS updated on Jan/2013",
  "content_length": 2234,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:06"
}