{
  "name": "Edward Chien",
  "homepage": "https://cs-people.bu.edu/edchien",
  "status": "success",
  "content": "Ed Chien's Personal Page E-mail: edchien@bu.edu Snail mail: Boston University Department of Computer Science 665 Commonwealth Ave, Rm 836 Boston, MA 02215 Overview I am an Assistant Professor in the Department of Computer Science here at Boston University. Research interests: geometry processing, computational knitting/fabrication, quad/hex meshing, applied optimal transport, harmonic and bounded distortion mappings I obtained my Ph.D. in Mathematics in 2015 from Rutgers University under Prof. Feng Luo, studying low-dimensional topology and geometry. More specifically, my thesis constructed square tilings of surfaces arising from discrete harmonic differential 1-forms. Afterwards, I transitioned to applied work, working as a postdoc with Prof. Ofir Weber at Bar-Ilan University in Israel. While there, I focused on harmonic and bounded distortion methods for mapping, parametrization, and interpolation. For my second postdoc, I returned to the States for three years in the Geometric Data Processing Group at MIT, led by Prof. Justin Solomon. There I began research in hex meshing and applied optimal transport. In recent years, I have added research directions on computational knitting and fabrication, and geometry processing of vector and point cloud data. I have thoroughly enjoyed combining my theoretical training with complex engineering problems. News August 2025: We will be presenting a conference paper, Curl Quantization for Automatic Placement of Knit Singularities and a journal paper Faraday Cage Estimation of Normals for Point Clouds and Ribbon Sketches at SIGGRAPH 2025. The latter has been awarded an Honorable Mention for Best Paper Award. See you in Vancouver! June 2025: I gave an SGP25 Summer School talk on computational knitting, along with Ben Jones (MIT) and Jenny Lin (Utah). March 2025: I will be jointly giving a talk on computational knitting at the New England Symposium on Graphics 2025, along with Ben Jones (MIT). This is a one-day conference held April 26, at MIT in Boston. Oct. 2024: I will serve on the SIGGRAPH 2025 Technical Papers Committee, and attend the March in-person meetings in Vancouver. I look forward to helping bring forth the most exciting works for the graphics community! Last updated: August 8, 2025",
  "content_length": 2268,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:00"
}