{
  "name": "Edward Choi",
  "homepage": "https://mp2893.com",
  "status": "success",
  "content": "Edward's Personal Web Page Welcome to my humble abode! Who am I? Name Edward Yoonjae Choi Eye Color Obvious Current Position Associate Professor at Kim Jaechul Graduate School of AI, KAIST Research Area Machine Learning for Healthcare, Natural Language Processing, Multimodal Learning Also Dilettante Pianist, 90's Gamer, Friends Fan, <cough>Art Lover</cough> Professional Experience Group Members Publications & Code Repos Courses & Lectures Fun Experiments News & Updates NEW! In collaboration with Clinical NLP 2024 Workshop, we are holding a Shared Task for EHRSQL, a Text-to-SQL dataset for medical records. Join the challenge and let's achieve reliable question answering in hospitals! Thanks to the invitation of Sergul Aydore and Krishnaram Kenthapadi, I'm co-organizing an ICLR 2021 Workshop Synthetic Data Generation: Quality, Privacy, Bias. Thanks to Nabila Abraham's kind invitation, I presented my recent work Graph Convolutional Transformer at AISC, May. 22nd, 2020. Thanks to Dr. Alison O'Neil and Dr. Aneta Lisowska from Canon Medical Research Europe, I'm giving an invited talk at AI for Affordable Healthcare Workshop of ICLR 2020, Apr. 26th, 2020. After a wonderful year and half at Google Brain and Google Health Research, I'm joining KAIST Graduate School of AI, starting Feb. 29th, 2020. I'm joining Google Medical Brain, starting Sep. 10th, 2018. I'll be giving a tutorial \"Deep Learning for Computational Healthcare\" at KDD 2018 with Dr. Jimeng Sun and Dr. Cao Xiao. My JAMIA paper was picked up by Scientific American and World Economic Forum. I gave a tutorial Deep Learning Models for Healthcare: Challenges and Solutions at AAAI 2018 with Dr. Jimeng Sun, Dr. Sanjay Purushotham and Dr. Yan Liu. I had an interview with Data Skeptic about my paper Doctor AI. My JAMIA paper was picked up by Nvidia's blog. Last Modified: Sep. 27, 2023",
  "content_length": 1861,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:00"
}