{
  "name": "Edward K. Wong",
  "homepage": "http://engineering.nyu.edu/people/edward-k-wong",
  "status": "success",
  "content": "Edward Wong | NYU Tandon School of Engineering Skip to Main Content Search NYU Tandon Fulltext search Looking for News or Events? Edward Wong Associate Professor Computer Science and Engineering Connect Email ewong [at] nyu.edu Phone 646.997.3523 Edward K. Wong received his B. E. degree from the State University of New York at Stony Brook, his Sc. M. degree from Brown University, and his Ph. D. degree from Purdue University, all in Electrical Engineering. He is currently Associate Professor in the Department of Computer Science and Engineering at the Polytechnic Institute of NYU. His research interests are in the areas of image processing, computer vision, and pattern recognition. He has published extensively and his research had been funded by federal and state government agencies, as well as private industry. He was a technical consultant to several companies in the New York area. He is currently an associate editor for the journal Springer LNCS Transactions on Data Hiding and Multimedia Security. Dr. Wong had also served on the organizing and technical program committees of several major conferences. Research Interests Image Processing Computer Vision Pattern Recognition Computer Graphics Education Purdue University 1986 Ph. D. , Electrical Engineering Brown University 1981 Sc. M., Electrical Engineering State University of New York at Stony Brook 1979 Bachelor of Engineering, Electrical Engineering Purdue University 1986 Doctor of Philosophy, Publications Journal Articles E. K. Wong and M. Chen, “A New Robust Algorithm for Video Text Extraction,” Pattern Recognition, Vol. 36, June 2003, pp. 1397-1406. J. Huang, Y. Wang, E. K. Wong, \"Check image compression using a layered coding method,\" Journal of Electronic Imaging, Special issue on Image/Video Processing and Compression for Visual Communications, July 1998. M. E. Hoffman and E. K. Wong, “A ridge-following algorithm for finding the skeleton of a fuzzy image,\" Information Sciences, Vol. 105, pp. 227-238, March 1998. M. E. Hoffman, L. M. Manevitz and E. K. Wong, \"Fuzzy Independence and Extended Conditional Probability,\" Information Sciences, Vol. 90, April 1996, pp. 137-156. E. H. Liang and E. K. Wong, \"An Efficient Method for Obtaining Morphological Skeletons,\" Pattern Recognition Letters 14 (1993) 689-695. E. H. Liang and E. K. Wong, \"Hierarchical Algorithms for Morphological   Image   Processing,\" Pattern Recognition 26/4, (Apr 1993), pp. 511-529. R. I. Chou, A. Kershenbaum and E. K. Wong, \"Representation and Recognition   of Handprinted Chinese Characters   by   String-Matching,\" Information Sciences, 67, 1-34 (1993). E. K. Wong, \"Model-Matching in Robot Vision by Subgraph Isomorphism,” Pattern Recognition, Vol. 25, no. 3, pp. 287-304, 1992. R. Lin and E. K. Wong, \"Logic Gate Implementation for Gray Scale   Morphology,\"   Pattern Recognition Letters  13 (1992) 481-487. D. S. Mahler, Z. B. Kharoufa, E. K. Wong and L. G. Shaw, “Pavement Distress Analysis Using Image Processing Techniques,” Microcomputers in Civil Engineering, 6, 1991. E. K. Wong, \"1989 IJCNN Neural Network Video Tutorials,\" (Review Article) IEEE Transactions on Ultrasonics, Ferroelectrics and Frequency Control, Vol. 38, No. 2, March 1991. D. Lin and E. K. Wong, \"A Survey on Maximum Entropy Method and   Parameter   Spectral   Estimation,\" Physics Reports, Vol. 193, No. 2, Sept. 1990. E. K. Wong, E. H. Liang, E. K. Lin, D. A. Simmons and L. G.   Koss,   \"A Selective   Mapping Algorithm for Video Analysis   of   Voided Urine Cell   Images,\" Analytical and Quantitative Cytology and Histology, Vol. 11, No. 3, June 1989. Z. Tang, A. Savino, E. K. Wong, L. G. Koss and L. G.   Shaw, \"An Expert   System Designed as a Tutoring Tool in   Cervical Cytology   (TTCC-1   System),\"   Analytical   and   Quantitative Cytology   and Histology, V. 10:6, Dec. 1988. E. K. Wong and K. S. Fu, \"A Hierarchical-Orthogonal-Space Approach to Three-Dimensional Path Planning,\" IEEE Journal of Robotics and Automation, Vol. RA-2, Number 1, pp. 42-53, March 1986. Other Publications Book chapters E. K. Wong and M. Chen, “Algorithms for extracting textual characters in color video,” in Computer Aided Intelligent Recognition Techniques and Applications, (edited by M. Sarfraz), John Wiley & Sons, 2005. M. Chen, N. Memon, and E. K. Wong, “Data hiding in document images,” Multimedia Security: Stenanography and Digital Watermarking Techniques for Protection of Intellectual Property, (edited by C. S. Lu), Idea Group Inc., Hershey, PA., 2004. K. Kanzaki, M. Kabrisky, and E. K. Wong, \"The Use of Fuzzy Silhouette and Internal Hot Spots in Hierarchical Fuzzy FLIR Target Classification,\" Advances in Fuzzy Theory and Technology, Vol. I, (Edited by P. P. Wang), pp. 297-324, 1993. E. K. Wong, \"Syntactic Image Pattern Recognition,\" Digital Image Processing Methods,\" E. R. Dougherty (eds.), Marcel Dekker, Inc., New York, 1994. E.   K.   Wong, \"Three-Dimensional Object Recognition   by Attributed   Graphs,\" Syntactic and Structural Pattern   Recognition-Theory   and Applications, H. Bunke and A. Sanfeliu (eds.), World   Scientific Publ. Co., Singapore, 1990. E. K. Wong and K. S. Fu, \"A Graph-Theoretic Approach to 3-D Object Recognition and Estimation of Position and Orientation,\" Computer-Based Automation, (J. T. Tou, ed.), Plenum Press, New York, 1985, pp. 305-343. Selected Conference Papers E. K. Wong, Y. Wang, and S-Y. Ohn, “Fingerprint Verification Using Direction Images and Local Features,” Proc. of SPIE: Image Processing: Machine Vision Applications II, San Jose, CA., Jan. 2009. M. Jiang, E. K. Wong, and N. Memon, “Robust Document Image Authentication,” Proc. IEEE International Conference on Multimedia and Expo, Jul 2-5, 2007, Beijing, China. M. Jiang, E. K. Wong, N. Memon, and X. Wu, “Steganalysis of Printed/Scanned Document Images,” IEEE International Workshop on Multimedia Signal Processing, Shanghai, China, Oct., 2005. M. Jiang, E. K. Wong, N. Memon, and X. Wu, “Steganalysis of Halftone Images,” in IEEE Int’l Conf on Acoustics, Speech, and Signal Processing, March 18-23, 2005, Philadelphia, PA. M. Jiang, E. Wong, N. Memon, and X. Wu, “A simple technique for estimating message lengths for additive noise steganography,” Proc 8th Int’l Conf. on Control, Automation, Robotics, and Vision, Kunming, China, Dec 6-9, 2004 M. Jiang, N. Memon, E. K. Wong, and X. Wu, “Quantitative steganalysis of binary images,” in Proc. IEEE Int’l Conf. on Image Processing, Singapore, Oct., 2004. M. Jiang, X. Wu, E. K. Wong, and N. Memon, “Steganalysis of boundary-based steganography using autoregressive model of digital boundaries,” Proc. IEEE Int’l Conf. on Multimedia and Expo, Taipei, Taiwan, June 27-30, 2004. M. Chen, E. K. Wong, N. Memon, and S. Adams, “Recent Developments in Document Image Watermarking and Data Hiding,” Proc. SPIE Conf on Multimedia Systems and Applications IV, Denver, CO, Aug. 2001. Q. Mei, E. K. Wong, and N. Memon, “Data hiding in binary text documents” SPIE Proc Security and Watermarking of Multimedia Contents III, San Jose, CA., Jan. 2001 M. E. Hoffman and E. K. Wong, “Content-Based Image Retrieval By Scale-Space Object Boundary Shape Representation,” Proc. of SPIE: Storage and Retrieval For Image and Video Databases VIII, San Jose, CA., Jan. 2000, pp. 86-97. J. Huang, Z. Liu, Y. Wang, Y. Chen, and E. K. Wong, \"Integration of Multimodal Features for Video Classification based on HMM\", Proc. IEEE Third Workshop on Multimedia Signal Processing, Copenhagen, Denmark, Sept 13-15, 1999. Y. Chen and E. K. Wong, \"Augmented Image Histogram for Image and Video Similarity Search\", in Proc. SPIE: Storage and Retrieval for Image and Video Databases VII (Vol. 3656), pp. 523-532, San Jose, CA, Jan, 1999. H. Joung, E. K. Wong, Y. Chen, and S. P. Kim, \"Document Image Compression Using Straight Line Extraction and Block Context Model\", Proc. IEEE International Conference on Image Processing, Chicago, Illinois, Oct., 1998. H. Joung, E. K. Wong and S. P. Kim, \"Block Context Modeling Approach for Binary Image Coding'', IEEE DCC '98 (Data Compression Conference), Snowbird, Utah, March-April, 1998. R. Lin and E. K. Wong, \"Morphological Operations on Images Represented by Quadtrees,\" IEEE International   Conference   on Acoustics,   Speech   &   Signal Processing, May 7 - 10, 1996, Atlanta, Georgia. M. Hoffman, L. M. Manevitz and E. K. Wong, \"Fuzzy Independence and Extended Conditional Probablity,\" Proc  Third Annual Internationl Conf. on Fuzzy Theory and Technology, Nov 13 - 16, 1994, Pinehurst, NC. S. Y. Ohn and E. K. Wong, \"Morphological decomposition of convex polytopes and its applications in discrete image space,\"  First IEEE International Conference on Image Processing, pp. 560-564, Nov 13-16, 1994, Austin, Texas. C. F. Kuo and E. K. Wong, \"A fast filling algorithm using chain code description,\" Proceedings of 1993 Workshop on Computer Applications, Apr 22-24, 1993, Nanpau, Taiwan, pp. 169-184. C. F. Kuo and E. K. Wong \"An efficient stroke-extraction method for Chinese characters,\" Proc International Symposium on Communications, Dec 7-10, 1993, Hsinchu, Taiwan. K. Kanzaki, E. K. Wong and M. Kabrisky, \"The use of fuzzy silhouette and internal hot-spots in hierarchical fuzzy FLIR target classification,\" Proc. First Int'l Conf. on Fuzzy Theory & Technology: Control and Decision, pp. 308-313, Oct. 1992, Durham, NC. K. Kanzaki, E. K. Wong and M. Kabrisky, “Use of morphology and the low Fourier frequencies in hierarchical fuzzy FLIR target segmentation and classification,” Proc. SPIE: Architecture, Hardware, and Forward-Looking Infrared Issues in Automatic Target Recognition, (Vol. 1957), pp. 95-106, Oct.1993. E. H. Liang and E. K. Wong, \"Fast Morphological Algorithms for Industrial   Image Analysis,\" presented in 1991 Convention of the Chinese Institute of Engineers/USA, Sept 1991, Eatontown, New Jersey. E. K. Wong and E. H. Liang, \"A Hierarchical Approach to Morphological   Image Processing,\" Proc. SPSE's 43rd   Annual Conference, Rochester, NY, May ",
  "content_length": 13254,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:05"
}