{
  "name": "Edward Alan Fox",
  "homepage": "https://fox.cs.vt.edu/foxinfo.html",
  "status": "success",
  "content": "Edward A. Fox Information Page Edward A. Fox Information Page For more details please see homepage and full CV (see also 1200x1600 version, Official photo: 1.2M color JPEG, Old Tiny B/W GIF) General Information Home: 203 Craig Dr., Blacksburg, VA 24060; +1-540-552-8667 Email: fox@vt.edu or edfox0714@gmail.com WWW: http://fox.cs.vt.edu/ Zoom room: https://virginiatech.zoom.us/j/5402315113, Personal Meeting ID 540-231-5113 Dept. of Computer Science Title: Emeritus Professor of Computer Scienc Office: 2160G Torgersen Hall Phone: +1-540-231-5113 FAX: +1-540-231-6075 Dept. Address: 3160 Torgersen Hall, Mail Code 0106, Virginia Tech, Blacksburg, VA 24061 Digital Library Research Laboratory (DLRL) Title: Director (retired) Room: Formerly in 2030 Torgersen Hall Address: Virginia Tech, Blacksburg, VA 24061 Short Biographical Sketch See a full CV (relatively current). Dr. Edward A. Fox holds a Ph.D. and M.S. in Computer Science from Cornell University, and a B.S. from M.I.T. He is a Fellow of both ACM and IEEE, cited for leadership in digital libraries and information retrieval. He is an inaugural inductee to the ACM SIGIR Academy, class of 2020, with announcement: \"to honor and recognize individuals who have made significant, cumulative contributions to the development of the field of information retrieval (IR). Inductees to the SIGIR Academy are the principal leaders in IR, whose efforts have shaped the discipline and/or industry through significant research, innovation, and/or service.\" From September 1983 to his retirement 1/1/2025 he was at Virginia Polytechnic Institute and State University (VPI&SU or Virginia Tech), where he served as Professor of Computer Science, and by courtesy, of ECE. He directed the Digital Library Research Laboratory and is Executive Director and Chairman of the Board of the Networked Digital Library of Theses and Dissertations. He was an elected member of the Board of Directors of the Computing Research Association and was Chair (now a member) of the ACM/IEEE-CS Joint Conference on Digital Libraries (JCDL) Steering Committee. He served on the IEEE Thesaurus Editorial Board, and was Chairman of the IEEE-CS Technical Committee on Digital Libraries. He works in the areas of digital libraries, information storage and retrieval, machine learning/AI, computational linguistics (NLP), hypertext/hypermedia/multimedia, computing education, and electronic publishing. In these areas, he has participated in, organized, presented, and/or reviewed for hundreds of conferences and workshops. Over 145 grants have funded his research. He has (co)supervised through completion over 102 doctoral or masters students. Papers, publications, and presentations total over 1318: over 88 tutorials in over 28 countries; 19 books; over 145 journal or magazine articles; over 273 refereed conference/workshop papers; over 428 related keynotes, other papers, book chapters, posters, demonstrations, and reports; and over 364 other presentations. Google Scholar reported his works have been cited 22546 times, with an h-index of 67 and i10-index of 311. For the Association for Computing Machinery he served 2018-2019 as a member of its Publications Board (and as co-chair of its digital libraries committee). He was editor for information retrieval and digital libraries in the ACM Books series. He was founder and co-editor-in-chief for the ACM Journal of Educational Resources in Computing, was a member of the editorial board for ACM Transactions on Information Systems, and was General Chair for JCDL 2001. Earlier, he served 1988-91 as a member of the Publications Board and as editor-in-chief of ACM Press Database Products (responsible for the broad area of electronic publishing including online, CD-ROM, hypertext, interactive multimedia, and developing a digital library). He also served from 1987-95 as vice chair and then chair of the Special Interest Group on Information Retrieval, from 1992-94 as founder and chairman of the Steering Committee for the ACM Multimedia series of conferences, and from 1995-1998 as founder and chairman of the Steering Committee for the ACM Digital Libraries series of conferences. He served as Program Chair for ACM DL'99, ACM DL'96, and ACM SIGIR'95 - and Program Co-chair for JCDL 2018, CIKM 2006, and ICADL 2005. He was lead guest editor for Communications of the ACM special issues July 1989, April 1991, April 1995, April 1998, and May 2001. In the 1980s he was project director for the Virginia Disc series of CD-ROMs as well as for VPI&SU work on interactive digital video. He was editor for the Morgan Kaufmann Publishers book series on Multimedia Information and Systems, for the ACM Book Series section on Information Retrieval and Digital Libraries, and on the board for Information Processing and Management, Journal of Universal Computer Science, PeerJ Computer Science, Multimedia Tools and Applications, and Journal of Educational Multimedia and Hypermedia. He serves on the editorial boards of the International Journal on Digital Libraries and the Journal of Intelligent Information Systems. He is Executive Editor of the Journal of Electronic Theses and Dissertations, J-ETD. From 2018 through November 2021 he served as Chief Technology Officer for Mayfair Group LLC (including its product division ClaimEdge), a startup in the legal and insurance fields, and was PI of a related NSF I-Corps study of automated summarization. Old version of this page Other activities and interests: Reading, photography Healing / Usui and Holy Fire Reiki (Level III practioner and teacher, see local page) / Acupressure (see local page) Married, with 4 sons and 4 grandchildren Back to Home Page Last updated 20250823",
  "content_length": 5704,
  "method": "requests",
  "crawl_time": "2025-12-01 13:04:58"
}