{
  "name": "Edward W. Knightly",
  "homepage": "http://knightly.rice.edu",
  "status": "success",
  "content": "Edward W. Knightly | Sheafor-Lindsay Professor of Electrical and Computer Engineering Skip to content Edward Knightly is the Sheafor–Lindsay Professor of Electrical and Computer Engineering and Computer Science at Rice University. He received his Ph.D. and M.S. from the University of California at Berkeley and his B.S. from Auburn University. He is an ACM Fellow, an IEEE Fellow, and a Sloan Fellow. He received the IEEE INFOCOM Achievement Award, the Dynamic Spectrum Alliance Award for Research on New Opportunities for Dynamic Spectrum Access, the George R. Brown School of Engineering Teaching + Research Excellence Award, and the National Science Foundation CAREER Award. He received the 2025 ACM SIGMOBILE Test of Time paper award and eight best paper awards including ACM MobiCom, ACM MobiHoc, IEEE Communications and Network Security, and IEEE INFOCOM. He has given over thirty plenary keynote presentations at ACM and IEEE conferences. He serves as an editor-at-large for IEEE/ACM Transactions on Networking and serves on the scientific council of IMDEA Networks in Madrid and the scientific advisory board of INESC TEC in Porto. He served as the Rice ECE department chair from 2014 to 2019. Professor Knightly’s research interests include design, prototyping, and in-the-field demonstration of next generation mobile and wireless networks, with a focus on networking, sensing, and security in diverse spectrum spanning from sub-6 GHz to millimeter wave and terahertz. He leads the Rice Networks Group whose projects include deployment, operation, and management of a large-scale urban wireless network in a Houston under-resourced community. This network, Technology For All (TFA) Wireless, has served thousands of users in several square kilometers and employs custom-built programmable and observable access points. See a featured video from the 2016 event announcing President Obama’s Advanced Wireless Research Initiative and a 2023 NSF CISE Distinguished Lecture to learn more about the project. The network was the first to provide residential access in frequencies spanning from unused UHF TV bands to legacy Wi-Fi bands (500 MHz to 5 GHz). His group developed the first multi-user beam-forming WLAN that demonstrates a key performance feature standardized in Wi-Fi since the 802.11ac amendment (Wi-Fi 5) and the first uplink multi-user mmWave WLAN (best paper award, INFOCOM 2021). Google Scholar Link Research Highlights Wikipedia Entry News",
  "content_length": 2462,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:10"
}