{
  "name": "Edward Omiecinski",
  "homepage": "http://www.cc.gatech.edu/~edwardo",
  "status": "success",
  "content": "DB Group at Georgia Tech - Edward R. Omiecinski Edward R. Omiecinski edwardo@cc.gatech.edu Biography Edward Omiecinski received his PhD degree from Northwestern University in 1984. He is currently an Associate Professor at Georgia Tech in the College of Computing. He has published more than 60 papers in international journals and conferences dealing with database systems. His research has been funded by NSF, DARPA and NLM. His currently funded work deals with the discovery of knowledge in cardiac imagebases, which is a collaborative effort between Georgia Tech and Emory University researchers. He is a member of the ACM and IEEE Computer Society. Vita Education Ph.D. 1984 Northwestern University Computer Science M.E. 1974 University of Florida Computer & Info. Eng. B.S. 1973 University of Florida Electrical Engineering Employment and Professional Experience Georgia Institute of Technology Associate Professor College of Computing 1993-present Assistant Professor College of Computing 1986-1993 North Dakota State University Assistant Professor Computer Science Dept. 1983-1986 Current fields of interest Database mining, parallel database systems, distributed databases, physical database design, database performance issues Selected Publications E. Omiecinski, \"Alternative Interest Measures for Mining Associations in Databases,\" IEEE Transactions on Knowledge & Data Engineering, 15, 1, January 2003. C. Ordonez and E. Omiecinski, \"FREM: Fast and Roboust EM Clustering for Large Data Sets,\" 11th ACM International Conference on Information and Knowledge Management, November 2002. W. Yee, S. Navathe, E. Omiecinski and C. Jermaine, \"Efficient Data Allocation Over Multiple Channels at Broadcast Servers,\" IEEE Transactions on Computers, 51, 10, October 2002. W. Yee, S. Navathe, E. Omiecinski and C. Jermaine, \"Bridging the Gap between Response Time and Energy Efficiency in Broadcast Schedule Design,\" the 2002 Extending Database Technology Conference, March 2002. C. Jermaine and E. Omiecinski, \"Lossy Reduction for Very High Dimensional Data,\" the 2002 IEEE Data Engineering Conference, February 2002. C. Ordonez, E. Omiecinski, L. DeBraal, C. Santana, N. Ezquerra, J. Toboada, D. Cooke, E. Krawczynska and E. Garcia, \"Mining Constrained Association Rules to Predict Heart Disease,\" IEEE International Conference on Data Mining, November 2001. C. Ordonez, E. Omiecinski and N. Ezquerra, \"A Fast Algorithm to Cluster High Dimensional Basket Data,\" IEEE International Conference on Data Mining, November 2001. C. Jermaine, A. Data, and E. Omiecinski, \"A Novel Index Supporting High Volume Data Warehouse Insertions,\" in the 25th Very Large Database Conference, September 1999. C. Ordonez, and E. Omiecinski, \"Discovering Association Rules based on Image Content,\" in the IEEE Advances in Digital Libraries Conference, May 1999. D. Cook, C. Ordonez, E. Garcia, E. Omiecinski, E. Krawczynska, R. Folks, C. Santana, L. DeBraal and N. Ezquerra, \"Data Mining of Large Myocardial Perfusion SPECT (MPS) Databases to Improve Diagnostic Decision Making,\" 46th Annual Meeting of the Society of Nuclear Medicine, June 1999. E. Omiecinski and A. Savasere, \"Efficient Mining of Association Rules in Large Dynamic Databases,\" in the 16th British National Conference on Databases, July 1998. A. Savasere, E. Omiecinski, and S. Navathe, \"Mining for Strong Negative Associations in a Large Database of Customer Transaction,\" in the 14th IEEE International Conference on Data Engineering, February 1998. V. Gottemukkala, E. Omiecinski and U. Ramachandran, \"Relaxed Index Consistency for Data-Only Locking in a Client-Server Database,\" in the 12th IEEE International Conference on Data Engineering, February 1996. K. Achyutuni, E. Omiecinski and S. Navathe, \"Two Techniques for On-Line Index Modification in Shared Nothing Parallel Databases,\" in the 1996 ACM SIGMOD International Conference on Management of Data,June 1996. S. Gukal, E. Omiecinski and U. Ramachandran, \"Transient Versioning for Consistency and Concurrency in Client-Server Systems,\" in the 1996 IEEE International Conference on Parallel & Distributed Information Systems, December 1996. A. Savasere, E. Omiecinski, and S. Navathe, \"An Efficient Algorithm for Mining Association Rules in Large Databases,\" in the 21st Very Large Database Conference, September 1995. B.-S. Jeong, and E. Omiecinski, \"Inverted File Partitioning Schemes in Multiple Disk Systems,\" IEEE Transactions on Parallel & Distributed Systems, 6, 2, February 1995. V. Gottemukkala, E. Omiecinski and U. Ramachandran, \"A Scalable Sharing Architecture for a Parallel Database System,\" in the I6th IEEE Symposium on Parallel & Distributed Processing, October 1994. E. Lin, E. Omiecinski and S. Yalamanchili, \"Large Join Optimization on a Hypercube Multiprocessor,\" IEEE Transactions on Knowledge & Data Engineering, 6, 2, April 1994, E. Omiecinski, L.Lee and P. Scheuermann, \"Performance Analysis of a Concurrent File Reorganization Algorithm for Record Clustering,\" IEEE Transactions on Knowledge & Data Engineering, 6, 2, April 1994. Selected Research Grants: 1998 - 2001 High Knowledge Discovery in Distributed Cardiac Imagebases, PIs: N. Ezquerra (Georgia Tech) and Ernest Garcia (Emory University) Co-PIs: Edward Omiecinski and Levien de Braal, National Library of Medicine, $1,421,829 1993 - 1996 A Knowledge-Base Approach to Integrating and Querying Distributed Heterogenous Information Systems, PI: Shamkant Navathe Co-PIs: Edward Omiecinski and Ashok Goel, ARPA $472,815. Cool links etc.",
  "content_length": 5527,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:09"
}