{
  "name": "Edwin Simpson",
  "homepage": "https://research-information.bris.ac.uk/en/persons/edwin-d-simpson",
  "status": "success",
  "content": "Edwin D. Simpson - University of Bristol View Scopus Profile Dr Edwin D. Simpson DPhil, MEng Senior Lecturer, School of Engineering Mathematics and Technology https://orcid.org/0000-0002-6447-1552 Emailedwin.simpsonbristol.acuk BS8 1UB Personal profile Research interestsMy research is in natural language processing (NLP) and interactive machine learning. I focus on how to learn an NLP model by interacting with a user or aggregating unreliable annotations from multiple sources. Current NLP models usually require many training examples to adapt them to a new task or domain. However, if we could instruct a model what to do differently in a new task, users could quickly take control of its behaviour. When we need to collect annotations, the labels often come from multiple annotators, e.g., from crowdsourcing. I am interested in how to combine these labels to estimate a gold standard, especially for ambiguous labelling tasks with high disagreement between annotators. My work employs Bayesian methods in combination with deep learning to handle uncertainty due to small or unreliable datasets.Among various applications of my work, I am particularly interested in disaster response, disaster risk reduction and sustainability, where large amounts of valuable information are often stored in unstructured data sources, such as social media, analysts’ reports or satellite imagery. These are prime use cases for interactive methods, as models must adapt to new locations and situations in limited time. Biography I joined the University of Bristol in early 2020 as a lecturer (assistant professor), working at the join between natural language processing (NLP) and machine learning. Previously, I was a postdoc at the Ubiquitous Knowledge Processing (UKP) lab at TU Darmstadt, Germany, from 2016 to 2020, where I developed experience in NLP. Prior to that I was a Phd student and then postdoc at the Machine Learning Research group at the University of Oxford, working on Bayesian machine learning methods. Before my PhD, I was a research engineer at HP Labs. I have extensive experience collaborating with industry partners, including Man-AHL and Aleph Insights, as well as research organisations such as The Zooniverse.   I am responsible for teaching new courses on Text Analytics (Data Science MSc), Dialogue and Narrative (CDT in interactive AI). I am a member of the Intelligent Systems research group at Bristol. Keywords Natural language processing, NLP, machine learning, Bayesian methods, interactive AI, interactive learning, crowdsourcing, annotation, preference learning. Education/Academic qualificationCombined Decision Making with Multiple Agents, University of OxfordFeb 2010 → 1 Aug 2014Award Date: 1 Aug 2014 External positionsPostdoctoral researcher, TU DarmstadtApr 2016 → Feb 2020Postdoctoral researcher, University of OxfordNov 2013 → Mar 2016PhD Student, University of OxfordFeb 2010 → Oct 2013Research Engineer, Hewlett PackardApr 2006 → Oct 2009 Research Groups and ThemesIntelligent Systems LaboratoryKeywordsnatural language processingNLPmachine learningBayesian methodsinteractive AIinteractive learningcrowdsourcingannotationpreference learning Fingerprint Dive into the research topics where Edwin D. Simpson is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Bayesian Approach Computer Science 100% Preference Learning Computer Science 96% Reinforcement Learning Computer Science 76% Training Data Computer Science 73% Annotation Computer Science 73% Learning System Computer Science 69% Natural Language Processing Computer Science 65% Machine Learning Computer Science 61% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 12 Conference Contribution (Conference Proceeding) 7 Article (Academic Journal) 3 Conference Paper 2 Chapter in a book 2 More 1 Conference Abstract 1 Review article (Academic Journal) Research output per year Research output per year Low Resource Sequence Tagging with Weak LabelsSimpson, E., Pfeiffer, J. & Gurevych, I., 12 Feb 2020. 8 p.Research output: Contribution to conference › Conference Paper › peer-review Open AccessFile Transfer Learning 100% Information Extraction 50% Ensemble Method 50% Annotation 50% Case Study 50% 299 Downloads (Pure) Scalable Bayesian Preference Learning for CrowdsSimpson, E. & Gurevych, I., 6 Feb 2020, In: Machine Learning. 109, 4, p. 689-718 30 p.Research output: Contribution to journal › Article (Academic Journal) › peer-review Open AccessFile Preference Learning 100% Approximation (Algorithm) 50% Natural Language Processing 50% Personal Data 50% Bayesian Approach 50% 23 Citations (Scopus) 148 Downloads (Pure) A Bayesian Approach for Sequence Tagging with CrowdsSimpson, E. & Gurevych, I., 7 Nov 2019, Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP). ACL, p. 1093-1104 12 p. D19-1101Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Open AccessFile Annotation 100% Bayesian Approach 100% Marking 100% State of the Art 50% Active Learning 33% 32 Citations (Scopus) 140 Downloads (Pure) View all 26 research outputs Projects 1 Active 2 Finished Projects per year The Digital Epidemiology of Social Media Behaviour and Mental Wellbeing in the Avon Longitudinal Study of Parents and Children (ALSPAC)Joinson, D. I. (Principal Investigator), Davis , O. S. (Principal Investigator), Simpson, E. D. (Principal Investigator), Haworth , C. M. A. (Principal Investigator) & Cristianini, N. (Principal Investigator)1/09/21 → 20/12/25Project: Research Doctor of Philosophy 100% Psychological Well-Being 100% Cohort Effect 100% Behavior (Neuroscience) 100% Longitudinal Study 100% “Medfluencer: a socio-semantic network analysis method to investigate how medical influencers affect health discourse on social mediaBernardi, R. (Principal Investigator), Simpson, E. D. (Co-Principal Investigator) & Guo, Z. (Researcher)20/11/23 → 31/07/24Project: Research Influencer 100% Discourse 100% Semantic Network 100% Network Analysis 50% Essential Meaning 25% Medical Experts as Social Media Influencers of Networks of Practice in the Fight Against COVID-19Bernardi, R. (Principal Investigator), Simpson, E. D. (Principal Investigator) & Davis , O. S. (Principal Investigator)31/01/22 → 4/07/22Project: Research Social Media Influencers 100% COVID-19 100% Discourse 100% Public Health 100% Impact Of Social Media 50% Datasets SemEval-2021 Task 12: Learning with DisagreementsUma, A. N. (Creator), Fornaciari, T. (Creator), Dumitrache, A. (Creator), Miller, T. (Creator), Chamberlain, J. (Creator), Plank, B. (Creator), Simpson, E. (Creator) & Poesio, M. (Creator), Zenodo, 23 Jul 2021DOI: 10.5281/zenodo.5130737, https://zenodo.org/record/5130737Dataset Prizes Assessing capability of large AI models in text mining of cancer studiesLiu, Y. (Recipient), Xu, Z. (Recipient), Sobczyk-Barad, M. K. (Recipient), Gaunt, T. R. (Recipient) & Simpson, E. D. (Recipient), 19 Sept 2023Prize: Prizes, Medals, Awards and Grants",
  "content_length": 7521,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:12"
}