{
  "name": "Ee-Chien Chang",
  "homepage": "https://www.comp.nus.edu.sg/~changec",
  "status": "success",
  "content": "Chang Ee-Chien's Home Page Chang Ee-Chien Contact Info Link to department's directory Hi, I am an associate professor in the Department of Computer Science, School of Computing, National University of Singapore (NUS). I am a lead-PI in National Cybersecurity R&D Lab (NCL) since 2015. I was a deputy director in Center for Technology, Robotics, Artifical Integlligence and the Law (TRAIL) from 2019 to 2022. I chaired the Joint Academic Committee overseeing Bachelor of Computing in Information Secuirty programme from 2016 till Apr 2023. I obtained my B.Sc (Hons) in Math and MSc from NUS in 1991 and 1993 respectively. I obtained my Ph.d in May 1998 from the Department of Computer Science, New York University. I was a post-doc in DIMACS and NEC Research Institute from July 1999 to July 2000. Research interests Topics in Security. Recently has been working on Machine Learning security, Trusted Execution Environment and applied cyrptography. Earlier works include multimedia and biometric security. Research positions available in our group Our research group has a few research positions (Research Fellows, Research Assistants) available, looking for expertises in Security of AI, and AI for cybersecuity. Contact me for more info. National Cybersecurity R&D Lab invites applications for a number of positions, including software and system engineers. Publications Publications list Google Scholar dplb Professional Activities Modules Taught CS3230, Algorithms, (2002, 2003, 2004, 2005, 2018) CS4241, MultiMedia Information Systems, (2003, 2004, 2005) CS4236, Principle of Computer Security, (2006, 2007, 2008, 2010) CS4236, Cryptography Theory and Practice, (2012, 2014, 2015, 2016, 2017, 2020) CS6230, Topics in Information Security, (2006) CS5231, Cryptographic Techniques and Data Security, (2007, 2009) CS1231, Discrete Structures, (2008) CS5321, Network Security and Management, (2009, 2011, 2013) CS2107, Introduction to Information Security, (2014 - 2024) DTS5735, Cybersecurity, (2018 - 2024) Research supervison Research Fellow (duration and last known position) Ning Jianting, 2017-2019, Professor, Fujian Normal University. Yang Ziqi, 2019-2020, ZJU100 Yong Professor, Zhejiang University. Jan Vykopal, 2018-2019, Associate Professor, Masaryk University. Sajal Sarkar, 2017-2018, Power Grid Corporation of India Limited. Hung Dang, 2019-2021, FPB Blockchain Lab. Aris Cahyadi Risdianto, 2019-2023, Senior Professional Officer, Singapore Institute of Technology. Wu Pengfei, 2020-2023, Research Fellow, Singapore Management University. S.M. Suhail Hussain, 2020-2022, Assistant Professor, King Fahd University of Petroleum and Minerals. Song Xiangfu, 2021-2024, Research Fellow, Nanyang Technological University. Liu Jiayang, 2022-2024, Research Fellow, Nanyang Technological University. Fang Han, 2021-current. Gong Jiajun, 2023-2025, Assistant Researcher, Peng Cheng Laboratory, Shenzhen, China. Liang Siyuan, 2023-2025, Research Fellow, Nanyang Technological University. Ma Haokai, 2025-current. PhD students (year of graduation and first appointment after graduation) Li Qiming, 2006, Research Fellow, Polytechnic University, New York. Sujoy Roy, 2006, Research Fellow, Institute for Infocomm Research, Singapore. Yu Hang, 2007, Research Fellow, Institute for Infocomm Research, Singapore. Ye Shuiming, 2007 (co-supervised with Sun Qibin), Research Fellow, EPFL, Swizterland. Nguyen Vu Thanh, 2008, Research Analyst, AMI-Partners, Singapore. Lu Liming, 2011 (co-supervised with Chan Mun Choon), Software Developer, CE-Infosys Pte Ltd. Xu Jia 2012, Research Fellow, Institute for Infocomm Research, Singapore. Fang Chengfang 2014, Researcher, Huawei International, Singapore. Zhang Chunwang 2015, Research Fellow, Institute for Infocom Research, Singapore. Hung Dang, 2019, Research Fellow, National University of Singapore, Singapore. Zhang Jiyi. 2024, Research Scientist, Paypal, Singapore. Wesley Tann. 2024. Yang Kang. Shen Jiamin. Lee De Zhang. Qiu Yupeng. MSc students (year of graduation and first appointment after graduation) Guan Xin, 2001, continuing graduate studies in SUNY, Stony Brook. Gao Ping, 2004. Shen Ren, 2006, Associate, Risk Advisory Services, KPMG, Singapore Wang Yuyi, 2010, continuing PhD studies in K. U. Leuven, Belgium Post-graduate Internships Yu Jie, Sep 2008 to Aug 2009, from National University of Defense Technology, China Liu Xuejiao, Sep 2009 to Aug 2010, from Huazhong Normal University, China Zhu Yixiao, Sep 2018 to Aug 2019, from Xidian University, China Jiang Qin, Apr 2020 to Mar 2021, from X'ian Jiaotong University, China Liu Yiran, Jan 2021- Dec 2021, from Shandong University, China Ding Hangchou, Jan 2021- Dec 2021, from Shandong University, China He Jinguan, Oct 2023 -, from Beijing Institute of Technology, China Wang Hanyi, Nov 2024-, from Shanghai Jiao Tong University, China Du Mengyao, Feb 2025-, from National University of Defense Technology, China Wang Xuan, Feb 2025-, from National University of Defense Technology, China Yu Zhaofeng, Sep 2025-, from Harbin Institute of Technology, China Undergraduates Final Year Projects, UROP, internships & others",
  "content_length": 5134,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:10"
}