{
  "name": "Eelco Herder",
  "homepage": "https://www.eelcoherder.com",
  "status": "success",
  "content": "Eelco Herder - Eelco ≡Open menu Eelco Research Publications Projects Ph.D Thesis Organization and Outreach Research Blog Organizing Committees Interviews, Talks and Press Press Attention for FireMe! Teaching User Modeling and Personalization Student Projects Other Activities Eelco Herder I work as an associate professor in the Interaction Group at Utrecht University, the Netherlands.  My research focuses on the fine balance between the benefits of personalization and perceived and actual risks associated with privacy matters. Particularly, I investigate how users and current (commercial) recommender systems respond to one another, and which mechanisms help to encourage users to actively choose what they want instead of passively following suggestions. My main research interests include user modeling, personalization, Web usage mining, data analysis and visualization, usability and user evaluation. On my Research Blog you can read about current developments and results, plus some ramblings. Since July 2023, I am Chair of ACM SIGWEB. and I joined the ACM Tech Policy Council on 18 April 2025. I am board member and information officer of User Modeling Inc and between 2007 and 2015, I served as the chair of the German SIG on Adaptive Systems and Interactive Systems ABIS. Further, I served as General Chair for ACM UMAP 2021 and as Program Chair for ACM Hypertext 2021. I was General Chair for the  UMAP 2017 conference in Bratislava, Slovakia and the Hypertext 2016 conference in Halifax, Canada. Hypertext 2016 was collocated with UMAP 2016. I served as Program Chair for the Hypertext 2014 conference, which took place in Santiago de Chile. I served as Local Chair of the Adaptive Hypermedia 2008 conference, Publicity Chair for CHI 2012, UMAP 2010 and UMAP 2011, as Workshop and Tutorial Chair for UMAP 2012 and as Poster and Demo Chair for UMAP 2013. From 2017 until June 2022, I was an assistant professor at the Digital Security Group at Radboud Universiteit Nijmegen, the Netherlands, where I coordinated the Master Program in Information Sciences. Earlier, between 2006 and 2017, I worked as a senior researcher at the L3S Research Center in Hannover, Germany, where I conducted research in the related domains of user modeling, personalization and Web Science. I was involved in the European project EUMSSI and the German BMBF project GlycoRec on daily personalized support for diabetes patients. Previously, I was involved in the European projects LinkedUp, Stellar, Grapple and Sync3, in which I worked as local team leader and work package manager. I was general manager of the Prolean NoE, which finished successfully in 2008. Apart from project coordination, I supervise Ph.D. students and give lectures. Announcements June 2025: I was elected as ACM SGB Member-at-Large April 2025: I accepted the invitation to join the ACM Tech Policy Council June 2023: I have been elected as Chair for ACM SIGWEB. My term will start officially on 1 July 2023. ACM SIGWEB coordinates and supports major conferences including TheWebConf, CIKM, WSDM, Hypertext and UMAP. In addition, SIGWEB provides student support and encourages fair access to its sponsored and co-sponsored conferences. May 2023: I am running as a candidate for the Chair position of ACM SIGWEB. If you are a SIGWEB member, do not forget to vote in the ACM SIGWEB Elections. Voting deadline is 1 June 2023. May 2023: The second edition of the book Personalized Human-Computer Interaction is coming! With fully revised chapters and five new chapters - including a chapter by me and Claus Atzenbeck on Human-Computer Feedback Loops. Expected release date is October 2023. September 2022: I have a vacancy: PhD Position in User-Centred Recommender Systems (08-1.0 FTE). Join us at Utrecht University to design, create and evaluate interfaces and recommendations that encourage users to choose what they really want! Application deadline is 21 October. February 2022: Starting 1 July, I will start a new job as an Associate Professor in the Interaction Group at Utrecht University. May 2021: Call for articles for the research topic \"Improving Human-Machine Feedback Loops in Social Networks\" in the journal Frontiers in Artificial Intelligence - AI for Human Learning and Behavior Change. In this Research Topic, we aim to investigate the mechanisms of social media responding to their users and vice versa. Abstracts are due 8 June 2021, manuscripts 6 October 2021. I am guest editor for this research topic, together with Jürgen Ziegler and Markus Strohmaier. November 2020: ACM UMAP 2021, the 29th Conference on User Modeling, Adaptation and Personalization will take place in Utrecht and online between 21 and 25 June 2021. I am General Chair, together with Judith Masthoff (Utrecht University). Submission deadline is 24 January 2021. More information can be found at https://www.um.org/umap2021/. November 2020: ACM Hypertext 2021, the 32nd ACM Conference on Hypertext and Social Media will take place from 29 August until 1 September 2021 at Trinity College Dublin, Ireland and online. I am Program Chair, Owen Conlan is General Chair. Submission deadline is 15 May 2021. For more information, see http://ht.acm.org/ht2021/. May 2020: Call for Papers: UCAI ‘20: Workshop on User-Centered Artificial Intelligence - held in conjunction with the Mensch und Computer 2020. Magdeburg, Germany, September 6th, 2020. December 2019: Interest in personalization? Not afraid of some scripting and data science? Participate in EvalUMAP 2020: Towards comparative evaluation in user modeling, adaptation and personalization. This challenge will take place at UMAP 2020 (14-17 July, Genova, Italy). You have until 28 February to develop your user model based on the training data provided. September 2019: The book \"Personalized Human Computer Interaction\" has been published. I edited this book with my colleagues Mirjam Augstein and Wolfgang Wörndl and contains chapters from, among others, Dietmar Jannach, Ulrike Lucke, Mark Graus, Bruce Ferwerda, Markus Schedl, Julia Neidhardt and Milos Kravcik. July 2019: I was interviewed for a Dutch news article: Anouk ging naar een abortuskliniek. Een bekende app wist daarvan en verkocht die informatie July 2019: I am elected as Vice Chair for ACM SIGWEB. April 2019: ABIS 2019, the 23rd International Workshop on Personalization and Recommendation on the Web and Beyond will take place on 17 September 2019 in Hof, Germany, colocated with Hypertext 2019. Submission deadline is 5 June. You are encouraged to submit full and short papers, position papers, doctoral consortium papers, and abstracts. I am co-organizer of ABIS 2019. April 2019: I am candidate vice chair for ACM SIGWEB. If you are an ACM member, please cast your vote. LILE 2019, the 8th International Workshop on Learning and Education with Web Data will take place at ACM WebSci 2019, June 30 2019 Boston, MA, USA​. Submission deadline is 12 April. I am member of the organization committee. Together with my colleagues Mirjam Augstein and Wolfgang Woerndl from the German SIG ABIS, we are finishing a book on Personalized Human-Computer Interaction, which will be published by DeGruyter Oldenbourg. The book contains invited, peer-reviewed chapters on state-of-the-art research as well as reflection. Expected publication date is July 2019. UMAP 2019 - the 27th Conference on User Modeling, Adaptation and Personalization will take place in Larnaca, Cyprus, between 9 and 12 June 2019. Submission deadline is 1 February. I am member of the Steering Committee. A new special issue of the NRHM with selected papers from UMAP 2017. Eelco Herder, Maria Bielikova, Federica Cena and Michel Desmerais. Special Issue on User Modeling, Adaptation and Personalization. New Review of Hypermedia and Multimedia 24 (3), 2018. The Master Program Information Sciences at Radboud University has been rated as a Top Program and Best Program in the field in the Keuzegids Master 2018. I am the proud coordinator of this program. On 27 September 2017 I gave an invited talk at the Privacy and Identity Lab in Tilburg, the Netherlands. Who told you that - transparency and control for privacy-aware personalization. Download the slides. Our submission to Hypertext 2017 has been nominated for the Ted Nelson Award. Erick Elejalde, Leo Ferres and Eelco Herder. The Nature of Real and Perceived Bias in Chilean Media. Proc. Hypertext 2017 UMAP 2017 - the 25th Conference on User Modeling, Adaptation and Personalization took place in Bratislava, Slovakia between 9 and 12 July 2017. Tentative submission deadline is 17 February 2017. Together with Maria Bielikova, I was general chair of UMAP 2017. Privacy Engineering, User Modeling, Personalization, Recommendation, Web Usage Mining, Data Analysis and Visualization, Usability, Evaluation Dr. Ir. Eelco HerderAssociate ProfessorHuman-Centered Computing GroupInformation and Computing SciencesUtrecht University Buys BallotgebouwPrincetonplein 53584 CC UtrechtThe Netherlands Email: e.herder@uu.nl Google's AI Overviews make users search worse, not better Does the source of a news article influence a reader's impression? Can you be seduced to buy more ecological supermarket products?",
  "content_length": 9205,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:13"
}