{
  "name": "Eero Hyvönen",
  "homepage": "https://seco.cs.aalto.fi/u/eahyvone",
  "status": "success",
  "content": "Eero Hyvönen - Semantic Computing Research Group (SeCo) » print this page!» Follow us on Twitter» Be our friend on Facebook Semantic Computing Research Group (SeCo) Making computers and the web more intelligent and interoperable! HOMEPAGE MISSION NEWS PROJECTS EVENTS PEOPLE PARTNERS CAREERS TEACHING CONTACT PUBLICATIONS APPLICATIONS ONTOLOGIES LINKED DATA INFRA FOR DH SERVICES TOOLS SOFTWARE DOWNLOAD Wikipedia: Semantic web suomeksi Google this site Latest News FIN-CLARIAH Research InfrastructureA new national research infrastructure initiative FIN-CLARIAH for...8.12.2021 8:12 by eahyvone WarMemoirSampo published on December 3, 2021A new “Sampo” application, “WarMemoirSampo”...8.12.2021 8:04 by eahyvone Five new SeCo papers accepted for the ISWC 2021The 20th International Semantic Web Conference (ISWC 2021), the...2.8.2021 6:53 by eahyvone Latest Publications Annastiina Ahola, Lilli Peura, Rafael Leal, Heikki Rantala and Eero Hyvönen: Using generative AI and LLMs to enrich art collection metadata for searching, browsing, and studying art history in Digital Humanities Eero Hyvönen, Petri Leskinen, Henna Poikkimäki, Heikki Rantala, Jouni Tuominen, Senka Drobac, Ossi Koho, Ilona Pikkanen and Hanna-Leena Paloposki: LetterSampo Finland (1809–1917) Data Service and Portal: Searching, Exploring, and Analyzing Historical Letters and Their Underlying Networks Michael Lewis, Eljas Oksanen, Frida Ehrnsten, Heikki Rantala, Jouni Tuominen and Eero Hyvönen: The Impact of Human Decision-making on the Research Value of Archaeological Data Tomaž Erjavec, Matyáš Kopp, Nikola Ljubešić, Taja Kuzman, Paul Rayson, Petya Osenova, Maciej Ogrodniczuk, Çağrı Çöltekin, Danijel Koržinek, Katja Meden, Jure Skubic, Peter Rupnik, Tommaso Agnoloni, José Aires, Starkaður Barkarson, Roberto Bartolini, Núria Bel, María Calzada Pérez, Roberts Darģis, Sascha Diwersy, Maria Gavriilidou, Ruben van Heusden, Mikel Iruskieta, Neeme Kahusk, Anna Kryvenko, Noémi Ligeti-Nagy, Carmen Magariños, Martin Mölder, Costanza Navarretta, Kiril Simov, Lars Magne Tungland, Jouni Tuominen, John Vidler, Adina Ioana Vladu, Tanja Wissik, Väinö Yrjänäinen and and Darja Fišer: ParlaMint II: Advancing Comparable Parliamentary Corpora Across Europe SeCo on Twitter Tweets by @secoresearch SeCo on Facebook Eero Hyvönen Professor (emer.) Aalto University Department of Computer Science Semantic Computing Research Group (SeCo) Email: eero.hyvonen(at)aalto.fi GSM +358 50 384 1618 Director (emer.) Helsinki Centre for Digital Humanities (HELDIG) University of Helsinki Faculty of Arts Finland Email: eero.hyvonen(at)helsinki.fi Adjunct Professor (Title of Docent) University of Helsinki Department of Computer Science Finland Email: eero.hyvonen(at)cs.helsinki.fi Faculty Affiliate Geneva Graduate Institute Center for Digital Humanities and Multilateralism Switzerland Address Aalto University Department of Computer Science P.O. Box 15500 FI-00076 Aalto Office: Computer Science Building, Konemiehentie 2, Room B346 Curriculum Vitae Eero Hyvönen is professor of computer science (focusing on semantic media technology) at the Aalto University, Department of Computer Science (emer.), director of Helsinki Centre for Digital Humanities (HELDIG) (emer.) at the University of Helsinki, and Faculty Affiliate at the Geneva Graduate Institute, Center for Digital Humanities and Multilateralism, Geneva, Switzerland. He directs the Semantic Computing Research Group (SeCo) specializing on Semantic Web technologies, Artifical Intelligence, and applications. A major recent theme (since 2001) in his research has been development of the national level semantic web infrastructure and its application in different areas. Eero Hyvönen has published over 600 research articles and books and has got over 30 awards and acknowledgements, such as the international Semantic Web Challenge Award (twice) (Japan, Germany), World Summit Award (WSA) by UNESCO (Dubai), LODLAM Open Data Prize (Italy), and State Award for Public Information (Tiedonjulkistamisen valtionpalkinto) and Prime Minister’s Innovation Award in Finland. He has acted in the editorial boards of Semantic Web - Interoperability, Usability, Applicability, Semantic Computing, International Journal of Metadata, Semantics, and Ontologies, and International Journal on Semantic Web and Information Systems, and has co-chaired and acted in the programme committees of tens of major conferences. Short professional biography in Finnish and in in English Short CV Wikipedia page in Finnish Research Areas Semantic web, Linked Data, Artificial Intelligence, and Semantic Computing Digital Humanities Interval computations and constraint satisfaction (formerly) Software business (formerly) Publications Full list of over 600 publications Google Scholar homepage Text books, edited volumes, and speial issues of journals Eero Hyvönen, Mikko Koho, Angel Daza and Gregor Pobežin (eds.): Proceedings of the BD2022 Biographical Data in a Digital World 2022 Conference, co-located with DH 2022, Tokyo, 2022. Institute of Cultural History, ZRC SAZUs, Ljubljana, January, 2024. Matti La Mela, Fredrik Norén and Eero Hyvönen (eds.): Digital Parliamentary Data in Action (DiPaDA 2022): Introduction. Proceedings of the Digital Parliamentary Data in Action (DiPaDA 2022) Workshop, CEUR Workshop Proceedings, Vol. 3133, May, 2022. Marcia Zeng, Chris Sula, Karen Gracy, Eero Hyvönen and Vania Mara Alves Lima (eds.): Special Issue on Digital Humanities. Journal of the Association for Information Science and Technology (JASIST), 2021. Antonis Bikakis, Eero Hyvönen, Stéphane Jean, Béatrice Markhoff and Alessandro Mosca (eds.): Special Issue on Semantic Web for Cultural Heritage. Semantic Web Journal, 2021. Lora Aroyo, Franciska de Jong, Eero Hyvönen, and Sara Tonelli: Web Semantics for Digital Humanities (special issue). Web Semantics: Science, Services and Agents on the World Wide Web, Elsevier, May, 2020. Eero Hyvönen: Semanttinen web -- linkitetyn avoimen tiedon käsikirja (Semantic Web -- Handbook for Linked Open Data). Gaudeamus, 2018. Eero Hyvönen, Eva Blomqvist, Valentina Presutti, Guilin Qi, Uli Sattler, Ying Ding, Chiara Ghidini (Eds.) Knowledge Engineering and Knowledge Management. EKAW 2014 Satellite Events, VISUAL, EKM1, and ARCOE-Logic. Lecture Notes in Artificial Intelligence, Springer-Verlag, 2015. Patrick Lambrix, Eero Hyvönen, Eva Blomqvist, Valentina Presutti, Guilin Qi, Uli Sattler, Ying Ding, Chiara Ghidini (Eds.) Knowledge Engineering and Knowledge Management. EKAW 2014 Satellite Events, VISUAL, EKM1, and ARCOE-Logic. Lecture Notes in Artificial Intelligence, Springer-Verlag, 2015. Krzysztof Janowicz, Stefan Schlobach, Patrick Lambrix, and Eero Hyvönen (Eds.): Knowledge Engineering and Knowledge Management. 19th International Conference, EKAW 2014, Proceedings. Lecture Notes in Artificial Intelligence, Springer-Verlag, 2014. Eero Hyvönen: Publishing and Using Cultural Heritage Linked Data on the Semantic Web. Synthesis Lectures on The Semantic Web. Morgan & Claypool, Palo, Alto, Ca, USA, 2012, 159 pp. Available also via Amazon.com. Dimitrios A. Koutsomitropoulos, Eero Hyvönen, and Theodore S. Papatheodorou (eds): Semantic Web and reasoning for cultural heritage and digital libraries. Semantic Web – Interoperability, Usability, Applicability. Special Issue, Vol 3, No 1, IOS Press, 2012. Lora Aroyo, Grigoris Antoniu, Eero Hyvönen, Annette ten Teije, Heiner Stuckenschmidt, Liliana Cabral, Tania Tudorache (Eds.): The Semantic Web: Research and Applications. 7th Extended Semantic Web Conference, ESWC 2010. Proceedings, Part I. Lecture Notes in Computer Science 6088, Springer-Verlag, 2010. Lora Aroyo, Grigoris Antoniu, Eero Hyvönen, Annette ten Teije, Heiner Stuckenschmidt, Liliana Cabral, Tania Tudorache (Eds.): The Semantic Web: Research and Applications. 7th Extended Semantic Web Conference, ESWC 2010. Proceedings, Part II. Lecture Notes in Computer Science 6089, Springer-Verlag, 2010. Lynda Hardman, Lora Aroyo, Eero Hyvönen (eds.): AI and Cultural Heritage. Special Issue, Intelligent Systems, March/April, IEEE Computer Society, 2009. Lora Aroyo, Paolo Traverso, Fabio Ciravegna, Philipp Cimiano, Tom Heath, Eero Hyvönen, Riichiro Mizoguchi, Eyal Oren, Marta Sabou, Elena Paslaru Bontas Simperl (Eds.): The Semantic Web: Research and Applications, 6th European Semantic Web Conference, ESWC 2009, Proceedings. Lecture Notes in Computer Science 5554 Springer-verlag 2009. Papers online. L. Aroyo, E. Hyvönen, J. van Ossenbruggen (eds): Proceedings of Workshop Cultural Heritage on the Semantic Web. The 6th International Semantic Web Confereence and the 2nd Asian Semantic Web Conference , Busan, Korea, 2007. E. Hyvönen, T. Kauppinen, M. Salminen, P. Ala-Siuru (eds): Proceedings of the 11th Finnish AI Confence, vol 2., Web Intelligence , Finnish AI Society, Finland, 2004. E. Hyvönen and M. Klemettinen (eds.) Towards the Semantic Web and Web Services. Proceedings of the XML Finland 2002 Conference. HIIT Publications 2002-03, Helsinki, 2002. E. Hyvönen (ed.) Semantic Web Kick-Off in Finland. Vision, Technologies, Research, and applications . HIIT Publications 2002-01, Helsinki, 2002, 304pp. E. Hyvönen (ed.) Inhimillinen tietokone -- konemainen ihminen (Human machine or machine-like human). The Helsinki University Press, 2001. E. Hyvönen, J. Seppänen (eds.), Keinoelämä - Artificial Life, Publications of Finnish AI Society, Espoo, Finland, 1995, 274 pp. L. Haaparanta, E. Hyvönen E., J. Seppänen, J. Silvonen (eds.) Älyn ulottuvuudet ja oppihistoria (Dimensions and intellectual history of intelligence), Publications of Finnish AI Society, Espoo, Finland, 1995. E. Hyvönen, I. Karanta, M. Syrjänen (ed.): Tekoälyn ensyklopedia (Encyclopedia of Artificial Intelligence). Gaudeamus, Helsinki, 1993, 356 pp. E. Hyvönen, J. Seppänen, M. Syrjänen (eds.): STeP-92 Tekoälyn uudet suunnat, Vol. 1, Esitelmät (STeP-92, New Directions of Artificial Intelligence, Vol. 1, Papers.). Suomen Tekoälyseura, Helsinki, 1992, 291 ",
  "content_length": 31128,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:18"
}