{
  "name": "Efstathios Hadjiefthymiades",
  "homepage": "http://cgi.di.uoa.gr/~shadj",
  "status": "success",
  "content": "Stathes Hadjiefthymiades (English) Greek page Stathes P. Hadjiefthymiades Stathes Hadjiefthymiades received his B.Sc. (honours) in Computer Science from the Department of Informatics at the University of Athens, Athens, Greece in 1993 and his M.Sc. (honours) in Computer Science (Advanced Information Systems) from the same Department in 1996. In 1999 he received his Ph.D. from the University of Athens (Department of Informatics and Telecommunications). In June 2002 he received a Joint Engineering-Economics M.Sc. degree from the National Technical University of Athens. Since 1992, he was with the Greek consulting firm Advanced Services Group (ASG), working on the design and implementation of telematic applications and services. Since 1995, he has been a member of the Communication Networks Laboratory of the University of Athens. He has participated in numerous projects realised in the context of EU Programs (e.g., ACTS, ORA, TAP, IST, H2020) as well as National Initiatives (e.g., Telematique, RETEX, Mentor). During the period Sept.2001-Jul.2002 he served at the University of Aegean, Dept. of Information and Communication Systems Engineering as a visiting Assistant Professor. He joined the faculty of the Hellenic Open University (Patras, Greece) on 2002 as an Assistant Professor (on Computer Networks). Since the beginning of 2004 he belongs to the Faculty of the Department of Informatics and Telecommunications, University of Athens, where he is presently a Professor (on Large Scale Software Systems). His research interests are in the area of distributed/mobile/pervasive computing and networked multimedia. He is the author of over 200 publications, in international scientific journals, conferences and books, in the above areas. He leads the H2020 project RAWFIE (Road-, Air- and Water-based Future Internet Experimentation, www.rawfie.eu). He also heads the M.Sc. programme \"Management and Economics of Telecommunication Networks and Information Systems\". List of Publications Pervasive Computing Research Group © 2020, Stathes P. Hadjiefthymiades",
  "content_length": 2073,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:14"
}