{
  "name": "Ehsan Elhamifar",
  "homepage": "http://www.ccs.neu.edu/home/eelhami",
  "status": "success",
  "content": "Ehsan Elhamifar Home NOVA Lab People Publications Activities Codes Data Teaching Ehsan Elhamifar, PhD Associate Professor Khoury College of Computer Sciences Electrical and Computer Engineering, College of Engineering (Affiliated) Northeastern University Email: eelhami [at] ccs [dot] neu [dot] edu Office: 310E West Village Hall (WVH) About Me I am an Associate Professor in the Khoury College of Computer Sciences and am affiliated with ECE. I am the director of the Neural Visual AI (NOVA) Lab and the Director of MS in AI at Northeastern. I have broad research interests in computer vision, machine learning and deep learning. The overarching goal of my research is to develop AI that learns from and makes inferences about data analogous to humans. I develop AI that understands and learns from complex human activities and scenes using videos and multi-modal data, learns its tasks from fewer examples and less annotated data, and makes real-time inferences as new data arrive. I also use these AI systems to assist and train people for performing complex procedural and physical tasks by combining AI with AR/VR technologies. I am a recipient of the DARPA Young Faculty Award. Prior to joining Northeastern, I was a postdoctoral scholar in the EECS department at UC Berkeley. I obtained my PhD from the ECE department at the Johns Hopkins University (JHU) and received two Masters degrees, one in EE from Sharif University of Technology in Iran and another in Applied Mathematics and Statistics from JHU. News & Notes Serving as the Area Chair (AC) of CVPR 2026. Three papers are accepted to ICCV 2025. Three papers are accepted to CVPR 2025. Serving as the Area Chair (AC) of CVPR 2025. Our paper on Active Action Segmentation is accepted to ECCV 2024. We have 6 papers accepted to CVPR 2024. Co-organizing the CVPR'24 Workshop on Learning from Procedural Videos and Language. I will be teaching Seminar in AI (CS7170) in the Fall 2024, which will focus on Deep Generative Modeling. Serving as the Associate Editor of the IEEE Transactions PAMI. Dr. Elhamifar's team has received a $3M Award from DARPA to develop intelligent AI-AR task assistants. Read more here. Prospective Students: I look for strong PhD students who are excited about computer vision and machine learning. If you are interested in joining my Lab, please send an email with the subject “PhD Application to Northeastern” and attach your CV. Research Long Video Understanding Studying temporal action segmentation, action progress prediction and error recognition methods in long videos by capturing long-range temporal dependencies. Egocentric Vision Designing efficient methods for understanding procedures, actions and object states in egocentric videos, particularly for streaming videos. Virtual AI Assistants Developing virtual (AR) AI assistants that can help people with various skill levels in their daily tasks. Video Generation Models Building generative AI models that can capture complexities of actions and scenes. Learning with Less Labels Studying zero-shot, few-shot, weakly-supervised and self-supervised learning methods for video and image understanding. Fine-Grained Recognition Developing methods that can distinguish visually similar actions or objects, especially for human-object interaction. Adversarial Attacks Studying vulnerability of deep learning and generative AI models to adversarial attacks and developing effective defense mechanisms. Video Summarization Developing scalable video summarization methods that handle structured dependencies in long and complex videos with minimum/no supervision.",
  "content_length": 3607,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:17"
}