{
  "name": "Ehsan Shareghi",
  "homepage": "https://research.monash.edu/en/persons/ehsan-shareghi-nojehdeh",
  "status": "success",
  "content": "Ehsan Shareghi Nojehdeh - Monash University View Scopus Profile Ehsan Shareghi Nojehdeh Dr Senior Lecturer, Department of Data Science & AI https://orcid.org/0000-0001-9119-8638 EmailEhsan.Shareghimonashedu Accepting PhD Students 20082025 Research activity per year Personal profile BiographyHello! I am an assistant professor in the Department of Data Science and Artificial Intelligence of Monash, and an affiliated lecturer of University of Cambridge. Prior to joining Monash, I was a lecturer at the Department of Electrical and Electronic Engineering of UCL, and before that a postdoc in the Language Technology Lab at University of Cambridge. I lead a team of students working on predictive models for language (text and speech). During my PhD I worked on integrating nonparametric models and compressed data structures for predictive models on large volumes of text. In my PostDoc, I worked on multilingual NLP and Bayesian learning of neural models with their application in low-resource conditions. Since 2019 I have been working on various speech and text models in understanding, translation, and reasoning tasks. While in principle the solutions we investigate are agnostic to the underlying models, we leverage foundational large language models (for text and speech) as much as possible. Hence, in recent years my team has also been investigating various shortcomings of such models.Research interestsProbing and Augmenting LLMs and Language Agents (verification, uncertainty, benchmark)Reasoning (logical reasoning and applications e.g., in Law)Red Teaming Safety of Multimodal LLMs (in particular Audio LLMs, prosodic aspects)Speech and Text Translation (with foundation speech and text models)Self-supervised learning (e.g., applications in text, speech, and graph)Utilising graphs for knowledge intensive tasks (e.g., graph-to-text generation, applications in biomedical domain)Deep generative models (e.g., generation, semi-supervised learning, sparsity and disentanglement)Bayesian learning and inference (e.g., applications in training with small data)Monash teaching commitmentEhsan has experience as both the Chief Examiner and Lecturer for the following units in the Faculty of IT: FIT5217 Natural Language ProcessingFIT5212 Data Analysis for Semi-structured Data University ServiceDeputy Course Director fo Master of AI (2024-Present)Early Career Academic (ECA) Committee (2022-2023)Community serviceSenior Area Chair ACL2025 Area Chair ARR2024-PresentEMNLP2023EACL2023AACL2023 Program Committee Association of Computational Linguistics (ACL)North American Chapter of Association of Computational Linguistics (NAACL)Empirical Methods in Natural Language Processing (EMNLP)Association for the Advancement of Artificial Intelligence (AAAI)The International Joint Conference on Artificial Intelligence (IJCAI) Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): External positionsAffiliated Lecturer, University of Cambridge1 Oct 2020 → 30 Sept 2026 Research area keywordsNatural Language ProcessingLarge Language ModelsDeep Generative Models Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2022 2025 2026 1 Finished 3 Active Projects per year Grid Guru: Grid Guru - Leveraging AI-Driven Grid OptimisationWagner, M. (Primary Chief Investigator (PCI)), Abbasnejad, E. (Chief Investigator (CI)), Mak, T. (Chief Investigator (CI)), Shareghi Nojehdeh, E. (Chief Investigator (CI)), Wang, H. (Chief Investigator (CI)), Cui, H. (Chief Investigator (CI)), Goodwin, S. (Chief Investigator (CI)) & Lipscombe, S. (Project Manager)Monash University – Internal Faculty Contribution, GridGuru Solutions Pty Ltd, Electricity Transmission Ministerial Holding Corporation (trading as Transgrid)16/07/25 → 15/07/26Project: Research Prototyping AI-Assisted Legal Issue Identification to Enhance Access to Justice ServicesBurgess, P. (Primary Chief Investigator (PCI)), Shareghi Nojehdeh, E. (Chief Investigator (CI)) & Lau, J. H. (Chief Investigator (CI))Australian Academy of Law1/06/25 → 28/02/26Project: Research Autonomous verifiable reasoning system powered by LLMsShareghi Nojehdeh, E. (Chief Investigator (CI))1/01/25 → 31/12/25Project: Research Paul Ramsay Foundation: Tracking media and parliamentary narratives around cycles of disadvantage in AustraliaWebb, G. (Primary Chief Investigator (PCI)), Angus, S. (Chief Investigator (CI)), Goodwin, S. (Chief Investigator (CI)), Dwyer, T. (Chief Investigator (CI)), Smith, L. (Chief Investigator (CI)), Bragge, P. (Chief Investigator (CI)), Batstone, J. (Chief Investigator (CI)) & Shareghi Nojehdeh, E. (Chief Investigator (CI))29/09/22 → 30/08/23Project: Research Research output Research output per year 2008 2021 2022 2023 2024 2025 44 Conference Paper 1 Chapter (Book) 1 Foreword / Postscript 1 Article Research output per year Research output per year Aligning with Logic: Measuring, Evaluating and Improving Logical Preference Consistency in Large Language ModelsLiu, Y., Guo, Z., Liang, T., Shareghi, E., Vulić, I. & Collier, N., 2025, Proceedings of the 42nd International Conference on Machine Learning. Singh, A., Fazel, M., Hsu, D., Lacoste-Julien, S., Berkenkamp, F., Maharaj, T., Wagstaff, K. & Zhu, J. (eds.). London UK: Proceedings of Machine Learning Research (PMLR), Vol. 267. p. 38518-38539 22 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile Audio Is the Achilles’ Heel: Red Teaming Audio Large Multimodal ModelsYang, H., Qu, L., Shareghi, E. & Haffari, R., 2025, NAACL 2025, Annual Conference of the Nations of the Americas Chapter of the Association for Computational Linguistics Proceedings of the Conference Volume 1: Long Papers. Chiruzzo, L., Ritter, A. & Wang, L. (eds.). Kerrville TX USA: Association for Computational Linguistics (ACL), p. 9292–9306 15 p. 2025.naacl-long.470Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access Not explainable but verifiable: alternative first steps in overcoming the problems associated with ai’s answers to legal problemsBurgess, P. & Shareghi, E., 20 Mar 2025, (Accepted/In press) Oxford Intersections: AI in Society. Hacker, P. (ed.). Living ed. Oxford UK: Oxford University Press, 20 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter (Book) › Research › peer-review Aligning with Human Judgement: The Role of Pairwise Preference in Large Language Model EvaluatorsLiu, Y., Zhou, H., Guo, Z., Shareghi, E., Vulić, I., Korhonen, A. & Collier, N., 2024, First Conference on Language Modeling COLM 2024. Das, D., Chen, D., Artizi, Y. & Fan, A. (eds.). Portland OR USA: OpenReview, 20 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access Can LLMs Reason in the Wild with Programs?Yang, Y., Xiong, S., Payani, A., Shareghi, E. & Fekri, F., 2024, EMNLP 2024, The 2024 Conference on Empirical Methods in Natural Language Processing, Findings of EMNLP 2024. Al-Onaizan, Y., Bansal, M. & Chen, Y.-N. (eds.). Kerrville TX USA: Association for Computational Linguistics (ACL), p. 9806–9829 24 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access View all 47 research outputs Activities Activities per year 2025 2025 2025 1 Expert/ advisor Activities per year Presenting at Chilli-IQ conference on The Future of Technology & the Legal IndustryBurgess, P. (Speaker) & Shareghi Nojehdeh, E. (Speaker)Mar 2025Activity: External Academic Engagement › Expert/ advisor",
  "content_length": 8128,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:18"
}