{
  "name": "Ehud Reiter",
  "homepage": "https://www.abdn.ac.uk/people/e.reiter",
  "status": "success",
  "content": "Professor Ehud Reiter | The University of Aberdeen Professor Ehud Reiter Professor Ehud ReiterChair in Computing Science About Email Addresse.reiter@abdn.ac.ukTelephone Number+44 (0)1224 273443Office AddressMeston 243Department of Computing ScienceUniversity of AberdeenKing's CollegeAberdeenAB24 3UESchool/DepartmentSchool of Natural and Computing Sciences Biography I have taught computing science and done research in Natural Language Generation at Aberdeen since 1995.  I expect to retire in summer 2026.  For more information about me, please see my personal webpage ehudreiter.com I was Chief Scientist at Arria NLG (a spinout I cofounded in 2010) for many years, but now I just work at Aberdeen Uni. Internal Memberships Research ethics Research Research Overview Current Interests Natural language generation Data-to-text Medical applications Current Research Students Nikolai Babakov (Santiago de Compostela) Jawwad Baig Adarsa Sivaprasad Mengxuan Sun Barkavi Sundararajan Iniakpokeikiye Thompson Yujun Wang Current Postdocs David Howcroft Past Research Students See my blog for a list of past research students I have supervised. CLAN The CLAN (Computational Linguistics at Aberdeen) resesarch group meets at 4PM every Wednesday.  Every week we discuss a research paper, idea, proposal, etc.  CLAN meetings are open to everyone, contact me for more information or to be put on the mailing list. I sometimes tweet CLAN information on @EhudReiter. Feel free to subscribe, most of my tweets are relevant to NLG research. Similarly my blog (ehudreiter.com) is mostly about NLG research. Current Research My current research focuses on (A) evaluation of natural language generation and (B) using AI and NLG to support patients, especially in their homes. Funding and Grants ASICA (Cancer Research UK) (2024-2026): Achieving Self-directed Integrated Cancer Aftercare (ASICA) in melanoma Al-ʿĀmīyah (Colloquial Arabic) and generative AI (Royal Society Edinburgh) (2024-2025)– a snapshot of its emerging text-to-text abilities Teaching Teaching Responsibilities CS2020: Software Programming (in Java) CS4040: Research Methods CS551H: Natural Language Generation Publications Page 1 of 18 Results 1 to 10 of 175 Evolving Stances on Reproducibility: A Longitudinal Study of NLP and ML Researchers' Views and Experience of Reproducibility 2025 - PublishedThomson, C., Reiter, E., Sedoc, J., Belz, A. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] https://aclanthology.org/2025.findings-emnlp.1404/[ONLINE] DOI: https://doi.org/10.18653/v1/2025.findings-emnlp.1404[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/b8a7b851-616d-44f6-94c6-7f0543f23527/downloadInput Matters: Evaluating Input Structure's Impact on LLM Summaries of Sports Play-by-Play 2025 - Accepted/In pressSundararajan, B., Sripada, S., Reiter, E. Contributions to Conferences: PapersThe role of natural language processing in improving cancer care: A scoping review with narrative synthesis 2025 - PublishedSun, M., Reiter, E., Duncan, L., Adam, R. Artificial Intelligence in Medicine, vol. 168, 103227Contributions to Journals: Articles[ONLINE] https://www.sciencedirect.com/science/article/pii/S0933365725001629[ONLINE] DOI: https://doi.org/10.1016/j.artmed.2025.103227[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/4b97a471-e822-4661-abf3-048b4d34f36b/downloadWe Should Evaluate Real-World Impact 2025 - E-pub ahead of printReiter, E. Computational LinguisticsContributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1162/COLI.a.18CausalGraphBench: a Benchmark for Evaluating Language Models capabilities of Causal Graph discovery 2025 - PublishedBabakov, N., Reiter, E., Bugarín, A. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.18653/v1/2025.acl-srw.16[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/9ffd8337-8f19-43e9-b6d9-fc0e76b836de/downloadSPHERE: An Evaluation Card for Human-AI Systems 2025 - PublishedZhao, D., Ma, Q., Zhao, X., Si, C., Yang, C., Louie, R., Reiter, E., Yang, D., Wu, T. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.18653/v1/2025.findings-acl.70[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/f00faf3c-7d58-4275-abc4-3cca4107d2a5/downloadAn End-to-End System for Culturally-Attuned Driving Feedback using a Dual-Component NLG Engine 2025 - Accepted/In pressThompson, I. P., Yi, D., Reiter, E. Chapters in Books, Reports and Conference Proceedings: Conference ProceedingsMobile Phone Sensor-based Nigerian Driving Dataset to Detect Alcohol-influenced Behaviours 2025 - Accepted/In pressThompson, I. P., Yi, D., Reiter, E. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/60e373a7-17ba-43a9-8063-80e438c79f1e/downloadPatient-Centred Explainability in IVF Outcome Prediction 2025 - PublishedSivaprasad, A., Reiter, E., McLernon, D., Tintarev, N., Bhattacharya, S., Oren, N. Working Papers: Working Papers[ONLINE] DOI: https://doi.org/10.48550/arXiv.2506.18760Reusability of Bayesian Networks case studies: a survey 2025 - PublishedBabakov, N., Sivaprasad, A., Reiter, E., Bugarín-Diz, A. Applied Intelligence, vol. 55, no. 4, 417Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1007/s10489-025-06289-5[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/0832fea3-83ac-4e88-87f6-8eeaf614ed0c/download Show 10 | 25 | 50 | 100 results per page Refine Books and Reports Books (2) Chapters in Books, Reports and Conference Proceedings Chapters (14) Chapters (Peer-Reviewed) (2) Conference Proceedings (90) Contributions to Conferences Abstracts (1) Papers (16) Posters (2) Oral Presentations (1) Contributions to Journals Abstracts (1) Articles (39) Conference Articles (2) Editorials (2) Literature Reviews (1) Working Papers Working Papers (1) Preprint Papers (1) Update",
  "content_length": 5928,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:19"
}