{
  "name": "Eike Ritter",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/ritter-eike.aspx",
  "status": "success",
  "content": "Dr Eike Ritter - School of Computer Science - University of Birmingham Dr Eike Ritter School of Computer ScienceSenior Lecturer in Computer Science Contact details Emaile.ritter@cs.bham.ac.uk View my research portal AddressSchool of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Dr Eike Ritter is a Senior Lecturer for the School of Computer Science, at the University of Birmingham. He is also a member of the Security and Privacy group and Theory group. For more information, please see Eike's homepage. My research interests include security, applications of mathematical logic and category theory to computer science, type theory and its applications to functional programming, proof theory and automated theorem proving. Recent publications Article Pym, D, Ritter, E & Robinson, EP 2024, 'Categorical Proof-theoretic Semantics', Studia Logica. https://doi.org/10.1007/s11225-024-10101-9 Khan, I, Anwar, Z, Bordbar, B, Ritter, E & Rehman, H 2018, 'A Protocol for Preventing Insider Attacks in Untrusted Infrastructure-as-a-Service Clouds.', IEEE Transactions on Cloud Computing, vol. 6, no. 4, pp. 942-954. https://doi.org/10.1109/TCC.2016.2560161 Arapinis, M, Mancini, LI, Ritter, E & Ryan, MD 2017, 'Analysis of privacy in mobile telephony systems', International Journal of Information Security, vol. 16, no. 5, pp. 491–523. https://doi.org/10.1007/s10207-016-0338-9 Arapinis, M, Liu, J, Ritter, E & Ryan, M 2017, 'Stateful Applied Pi Calculus: Observational Equivalence and Labelled Bisimilarity', Journal of Logical and Algebraic Methods in Programming, vol. 89, pp. 95-149. https://doi.org/10.1016/j.jlamp.2017.03.001 Pym, D, Ritter, E & Robinson, E 2014, 'A proof-theoretic analysis of the classical propositional matrix method', Journal of Logic and Computation, vol. 24, no. 1, pp. 283-301. https://doi.org/10.1093/logcom/exs045 Yasmin, R, Ritter, E & Wang, G 2014, 'Provable security of a pairing-free one-pass authenticated key establishment protocol for wireless sensor networks', International Journal of Information Security, vol. 13, no. 5, pp. 453-465. https://doi.org/10.1007/s10207-013-0224-7 Arapinis, M, Phillips, J, Ritter, E & Ryan, MD 2014, 'StatVerif: Verification of stateful processes', Journal of Computer Security, vol. 22, no. 5, pp. 743-821. https://doi.org/10.3233/JCS-140501 Yasmin, R, Ritter, E & Wang, G 2012, 'An Authentication Framework for Wireless Sensor Networks Using Identity-Based Signatures: Implementation and Evaluation', IEICE Transactions on Information and Systems, vol. E95D, no. 1, pp. 126-133. https://doi.org/10.1587/transinf.E95.D.126 Conference contribution Bruni, A, Ritter, E & Schürmann, C 2024, Skolemisation of Intuitionistic Linear Logic. in C Benzmüller, MJH Heule & RA Schmidt (eds), Automated Reasoning: 12th International Joint Conference, IJCAR 2024, Nancy, France, July 3–6, 2024, Proceedings, Part II. 1 edn, Lecture Notes in Computer Science, vol. 14740, Springer, pp. 61-77, 12th International Joint Conference on Automated Reasoning, IJCAR 2024, Nancy, France, 1/07/24. https://doi.org/10.1007/978-3-031-63501-4_4 Denzel, M, Ryan, M & Ritter, E 2018, A Malware-Tolerant, Self-Healing Industrial Control System Framework. in S De Capitani di Vimercati & F Martinelli (eds), ICT Systems Security and Privacy Protection: 32nd IFIP TC 11 International Conference, SEC 2017, Rome, Italy, May 29-31, 2017, Proceedings. IFIP Advances in Information and Communication Technology , vol. 502, Springer, pp. 46-60, 32nd International Conference on ICT Systems Security and Privacy Protection (IFIP SEC 2017), Rome, Italy, 29/05/17. https://doi.org/10.1007/978-3-319-58469-0_4 Arapinis, M, Mancini, LI, Ritter, E & Ryan, M 2014, Privacy through Pseudonymity in Mobile Telephony Systems. in 21st Annual Network and Distributed System Security Symposium (NDSS'14). The Internet Society, pp. 1-14, NDSS Symposium 2014, San Diego, California, United States, 23/02/14. https://doi.org/10.14722/ndss.2014.23082 Koleini, M, Ritter, E & Ryan, M 2013, Model checking agent knowledge in dynamic access control policies. in N Piterman & SA Smolka (eds), Tools and Algorithms for the Construction and Analysis of Systems : 19th International Conference, TACAS 2013, Held as Part of the European Joint Conferences on Theory and Practice of Software, ETAPS 2013, Rome, Italy, March 16-24, 2013. Proceedings. Lecture Notes in Computer Science, vol. 7795, Springer, pp. 448-462. https://doi.org/10.1007/978-3-642-36742-7_31 Other chapter contribution Arapinis, M, Liu, J, Ritter, E & Ryan, M 2014, Stateful Applied Pi Calculus. in M Abadi & S Kremer (eds), Principles of Security and Trust : Third International Conference, POST 2014, Held as Part of the European Joint Conferences on Theory and Practice of Software, ETAPS 2014, Grenoble, France, April 5-13, 2014, Proceedings. vol. 8414, Chapter 2, Lecture Notes in Computer Science, vol. 8414, Springer, pp. 22-41. https://doi.org/10.1007/978-3-642-54792-8_2 Paper Arapinis, M, Mancini, L, Ritter, E, Ryan, M, Golde, N, Redon, K & Borgaonkar, R 2012, 'New privacy issues in mobile telephony: fix and verification', Paper presented at 19th ACM Conference on Computer and Communications Security - CCS 2012, Raleigh, NC, United States, 16/10/12 - 18/10/12 pp. 205-216. https://doi.org/10.1145/2382196.2382221 Preprint Pym, D, Ritter, E & Robinson, EP 2023 'Categorical Proof-Theoretic Semantics' arXiv. https://doi.org/10.48550/arXiv.2302.09031 View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 5630,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:22"
}