{
  "name": "Eirini Ntoutsi",
  "homepage": "https://aiml-research.github.io",
  "status": "success",
  "content": "Artificial Intelligence and Machine Learning - Home Toggle navigation Home Team Publications Research Teaching Research seminar Vacancies News Artificial Intelligence & Machine Learning Group The Artificial Intelligence and Machine Learning (AIML) group, led by Prof. Dr. Eirini Ntoutsi, researches and develops AI systems that are technically robust, resilient to biases, data imbalances, distribution shifts, adversarial attacks, and other real-world challenges, and societally responsible, with emphasis on fairness, explainability, and accountability. Three fundamental questions drive our work: How can we build intelligent machines for the real world? Equally important, what kind of intelligence do we aspire to build? And, can AI exhibit creativity? Our ongoing research includes: Continuous learning over evolving data and data streams Responsible AI with a focus on fairness-aware machine learning, explainable AI and (adversarial) robustness Generative AI for enhancing data quality for AI and enabling novel solutions Our applications span diverse domains, including education, agriculture, banking, and engineering. We are part of Research Institute CODE for cybersecurity and smart data and the Department of Computer Science at the Bundeswehr University Munich (UniBwM). Previously, we have been working at the Freie Universität Berlin and Leibniz Universität Hannover/L3S Research Center. News 31.10-1/11/2025 Abheek and Eirini are attending the kick-off meeting of the new project DzDa (Deutsches Zentrum für digitale Aufgaben in der Hochschullehre) in Amberg. 24.10.2025 Our paper “A Deep Latent Factor Graph Clustering with Fairness-Utility Trade-off Perspective” was accepted at IEEE Big Data 2025 (arXiv). Congrats Siamak! 14.10.2025 Eirini gave a talk on The Multifaceted Nature of Bias in AI - Implications for Generalization, Fairness, and Robustness at the AI Fairness Cluster meeting in Brussels. (slides). ... see all News © 2022 AIML Lab. Website layout adapted from The Allan Lab's template. Contact us! Carl-Wery-Str. 18-22, 81739 München, Germany (Maps)",
  "content_length": 2084,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:21"
}