{
  "name": "Ekaterina Kochmar",
  "homepage": "https://mbzuai.ac.ae/study/faculty/ekaterina-kochmar",
  "status": "success",
  "content": "Ekaterina Kochmar - MBZUAI MBZUAI About About Leadership and Governance Alumni Mission Faculty Directory Fast Facts Office of the President Office of the Provost Study Study Graduate Admission Process Undergraduate Admission Process Faculty Directory Aspire Ph.D. Fellowship Program Master in Applied Artificial Intelligence (MAAI) Master’s Programs Ph.D. Programs Undergraduate Program Undergraduate Research Internship Program University Catalogue Research Research Computer Vision Research Machine Learning Research Natural Language Processing Projects Research Centers Innovate Innovate Consulting Incubation and Entrepreneurship Center Institute of Digital Public Health Institute of Foundation Models Office of Public Affairs and Alumni Relations Partnerships and Collaborations Training Programs Student Resources Undergraduate Academic Calendar Graduate Academic Calendar Campus Facilities Career Services and Internships Publications Repository Educational Affairs Library Portal Office of the Registrar Campus Map News & Events Commencement Events Media Center The Node | Stories of MBZUAI MBZUAI Nexus | The Global AI Research & Knowledge Network Apply now Home / Faculty directory / Ekaterina Kochmar Ekaterina Kochmar Assistant Professor of Natural Language Processing Research Interests Professor Kochmar's research has spanned the areas of author profiling, models of computational semantics, readability assessment, language complexity, text simplification, summarization, language testing and assessment, and error detection and correction. She is particularly interested in applications of machine learning and AI techniques to the educational domain, including models of second language learning, and assessment and dialogue-based intelligent tutoring systems. Email Share Prior to joining MBZUAI, Professor Kochmar worked as a Lecturer at the Department of Computer Science of the University of Bath (2021–2023) where she was part of the AI research group. Prior to that, she was a postdoctoral researcher at the ALTA (Automated Language Teaching and Assessment) Institute at University of Cambridge focusing on the development of educational applications for second language learners. She conducts research at the intersection of artificial intelligence, natural language processing, and intelligent tutoring systems. Her research contributed to the building of Read & Improve, a readability tool for non-native readers of English, and to the building of Korbi, a dialogue-based intelligent tutoring system capable of providing learners with high-quality, interactive and personalized education in STEM subjects. Professor Kochmar is a co-founder and the chief scientific officer of https://www.korbit.ai/, focusing on building an AI-powered dialogue-based tutoring system capable of providing learners with high-quality, interactive, and personalized education in STEM subjects. Professor Kochmar is the President of the ACL Special Interest Group on Educational Applications (SIGEDU), and of the International Alliance to Advance Learning in the Digital Era (IAALDE). She is an area chair in NLP Applications for ACL 2023 and an action editor for the ACL Rolling Review; prior to that she served as an area chair for EMNLP 2022 and ACL 2023, and was part of the programme committees of the top-ranked international conferences in the field, including ACL,NAACL,EMNLP, AAAI, COLING, BEA, LREC, *SEM, as well as multiple ACL workshops. Ph.D. in natural language processing from University of Cambridge, England Master’s in advanced computer science from University of Cambridge, England Master’s in computational linguistics from University of Tuebingen, Germany Diploma in mathematical and applied linguistics from St. Petersburg State University, Russia Kochmar has (co-)authored more than 30 internationally peer-reviewed research papers and published a book titled Getting Started with Natural Language Processing in 2022. Ekaterina Kochmar (2022). Getting Started with Natural Language Processing. Manning Publications, ISBN 9781617296765 Devang Kulshreshtha, Muhammad Shayan, Robert Belfer, Siva Reddy, Iulian Vlad Serban, and Ekaterina Kochmar (2022). Few-shot Question Generation for Personalized Feedback in Intelligent Tutoring Systems. In Proceedings of the 11th International Conference on Prestigious Applications of Intelligent Systems (PAIS 2022) Ekaterina Kochmar, Dung Do Vu, Robert Belfer, Varun Gupta, Iulian Vlad Serban, and Joelle Pineau (2021). Automated Generation of Personalized Pedagogical Interventions in Intelligent Tutoring Systems. In International Journal of Artificial Intelligence in Education (IJAIED) Sian Gooding, Ekaterina Kochmar, Seid Muhie Yimam, and Chris Biemann (2021). Word Complexity is in the Eye of the Beholder. In Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics - Human Language Technologies (NAACL-HLT 2021) Matt Grenander, Robert Belfer, Ekaterina Kochmar, Iulian Serban, François St-Hilaire, and Jackie Cheung (2021). Deep Discourse Analysis for Generating Personalized Feedback in Intelligent Tutor Systems. In Proceedings of the 11th Symposium on Educational Advances in Artificial Intelligence (EAAI-21) Personal website Google Scholar Related Monday, May 05, 2025 Tutors of tomorrow? A new benchmark for evaluating LLMs Research led by Kaushal Maurya won an award at NAACL for its efforts to measure the teaching… natural language processing nlp education intelligent tutoring systems NAACL award benchmark evaluation framework Read more Monday, January 20, 2025 MBZUAI welcomes the world to Abu Dhabi as COLING 2025 opens The conference is in the Middle East for the first time, with more than 850 papers and… conference natural language processing research faculty nlp llms COLING COLING 2025 organizing committee Read more Wednesday, November 13, 2024 MBZUAI faculty wins Google award for research to make education equitable, accessible and effective Ekaterina Kochmar and Kaushal Maurya won a Google Academic Research Award for their work to personalize education… natural language processing innovation nlp intelligent tutoring systems llms award Google education Read more Contact faculty affairs Interested in working with our renowned faculty? Fill out the below form and we will get back to you. Please enable JavaScript in your browser to complete this form.Name *Organization *Phone number *Email *Message *Checkboxes *I consent to receive communication from MBZUAISubmitSubmit x We use cookies We use necessary and analytics cookies to operate our website, analyze traffic, and improve your experience. By continuing to use this website, you agree to our use of cookies. Learn more Got it",
  "content_length": 6745,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:05"
}