{
  "name": "El Mahdi Driouch",
  "homepage": "https://professeurs.uqam.ca/professeur/driouch.elmahdi",
  "status": "success",
  "content": "Elmahdi Driouch | Répertoire des professeures et professeurs - UQAM Elmahdi Driouch Professeur Elmahdi Driouch Professeur Unité : Département d'informatique Courriel : driouch.elmahdi@uqam.ca Téléphone : (514) 987-3000 poste 2476 Enseignement Projet de thèse (2025, 2024, 2023, 2022, 2021) Interconnexions et communications (2025) Projet supervisé (2025, 2024, 2020) Téléinformatique (2024, 2023, 2022, 2021, 2020) Les réseaux sans fil et les réseaux mobiles (2024, 2023, 2022, 2021) Systèmes de communications (2024, 2023, 2022, 2021) Réseaux sans fil et applications mobiles (2023, 2022, 2021) Séminaire de maîtrise en informatique I (2023) Projet intégrateur thématique (2022) Directions de thèses et mémoires Mémoires Bagayoko, Ismail. (2024). Optimisation conjointe du déchargement de tâches et d'ordonnancement de transmissions en multidiffusion dans les réseaux MEC. (Mémoire de maîtrise). Université du Québec à Montréal. Gaye, Ababacar. (2024). Allocation des ressources et déchargement des tâches dans les réseaux véhiculaires avec traitement périphérique. (Mémoire de maîtrise). Université du Québec à Montréal. Benboubker, Sophia. (2024). Calcul de la trajectoire des UAV et placement des stations de base dans les réseaux de capteurs. (Mémoire de maîtrise). Université du Québec à Montréal. Mbaye, Cheikh Ibrahima. (2024). Déchargement des tâches dans l'informatique en périphérie mobile assisté par les communications D2D et mmWave. (Mémoire de maîtrise). Université du Québec à Montréal. Benyerbah, Hanaa. (2023). Allocation des ressources et association des utilisateurs dans les réseaux cellulaires denses à ondes millimétriques centrés sur l'utilisateur. (Mémoire de maîtrise). Université du Québec à Montréal. Damoulay, Ihsane. (2023). Ordonnancement des tâches et allocation des ressources dans l'informatique de périphérie. (Mémoire de maîtrise). Université du Québec à Montréal. ...",
  "content_length": 1904,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:06"
}