{
  "name": "Elaheh Homayounvala",
  "homepage": "https://www.gold.ac.uk/computing/people/homayounvala-elaheh",
  "status": "success",
  "content": "People in the School of Computing | Goldsmiths, University of London Main menu Staff & students In this section In this section Academic staff Technical and Professional staff PhD students External Advisory Board Academic staff Technical and Professional staff PhD students External Advisory Board Staff list Rebecca Aston Lecturer R.Aston (@gold.ac.uk) Rebecca is a creative technologist and practicing artist who works with a range of time-based media. Omar B Karakchi Lecturer o.karakchi (@gold.ac.uk) My research interest is in the field of applied mathematics and non linear differential equations. Dr Daniel Berio Computational Arts Lecturer daniel.berio (@gold.ac.uk) Computational methods for generating typography, calligraphy, graffiti and vector graphics Dr Tim Blackwell Senior Lecturer tim.blackwell (@gold.ac.uk) I am interesting in all things swarming and musical. Dr Alexander Brigden Lecturer, Exams and Assessment Officer Alexander.Brigden (@gold.ac.uk) Alex's research focuses on human-computer-interaction, expression with sound, and game design. Dr David R. K. Brownrigg Visiting Research Fellow D.Brownrigg (@gold.ac.uk) David's current work is in novel image processing as part of collaboration with an artist, and in lossy compression. Dr Raju Chinthalapati Reader in Financial Technologies V.Chinthalapati (@gold.ac.uk) Raju’s research focuses on Financial Technologies, Big Data Analysis, Computational Finance, Financial Econometrics and Operations Research. Dr Maggie Cooper Programme Director, International Programmes maggie.cooper (@gold.ac.uk) Prof Tim Crawford Professorial Research Fellow in Computational Musicology t.crawford (@gold.ac.uk) Tim has research interests in computational approaches to musicology and music history from the 16th to 18th centuries. Rahul Raj Debnath Lecturer in Games Art R.Debnath (@gold.ac.uk) Rahul Raj Debnath is a Traditional Fine artist, 3D generalist who gives strong emphasis on storytelling in his works. Nicky Donald Research Technologist nickyd (@gold.ac.uk) Rachel Falconer Lecturer / Goldsmiths Digital Project Manager R.Falconer (@gold.ac.uk) Rachel is a digital art curator, researcher and lecturer in Digital Arts Computing and Creative Computing. Fede Fasce Lecturer and Researcher f.fasce (@gold.ac.uk) Game design, play as a language and game anthropology Llewelyn Fernandes Lecturer llewelyn.fernandes (@gold.ac.uk) Llewelyn uses creative computing projects to promote enthusiasm for computer science. Prof Frederic Fol Leymarie Professor ffl (@gold.ac.uk) Frederic works on creativity and AI systems, including robots which can perform artistic skills similar to humans. Dr Jamie Forth Lecturer j.forth (@gold.ac.uk) Jamie is a musician, artist/coder, and interdisciplinary researcher interested in perception, culture and creativity Andy Freeman Visiting Fellow a.freeman (@gold.ac.uk) Andy is a lecturer specialising in digital journalism, data visualisation and digital interactions. Dr Betty Fyn-Sydney Associate Lecturer B.Fyn-Sydney (@gold.ac.uk) Betty is a mathematician with interests in group theory, representation theory, and coding theory. Dr Max Garagnani Senior Lecturer in Computer Science M.Garagnani (@gold.ac.uk) Max uses computer modelling and simulations to explore how we learn to speak and how the mind works. Professor Jennifer George Professor of Computing j.george (@gold.ac.uk) Jennifer’s research areas include human computer interaction, accessibility and research through design Professor Marco Gillies Professor / Academic Director of TaLIC m.gillies (@gold.ac.uk) Professor of Computing. Co-director SEEVR lab and MA/MSc V&AR Robert Hall Technician and Lecturer r.hall (@gold.ac.uk) I work on Physical Computing, 3D Printing and Laser Cutting, but also AV projects and also Live Streaming Lane Palmer Hughston Professor of Mathematics l.hughston (@gold.ac.uk) Lane is a mathematician who works on quantum informatics and mathematical finance. Nima Jamalian Lecturer in Computer Games N.jamalian (@gold.ac.uk) Nima combines expertise in software engineering and teaching with a strong enthusiasm for technology. Irini Kalaitzidi Lecturer e.kalaitzidi (@gold.ac.uk) Irini is a dance and computational artist exploring critical and caring modes of engaging with the body. Dr Akshi Kumar Senior Lecturer Akshi.Kumar (@gold.ac.uk) Akshi has distinct expertise in Natural Language Processing, AI ethics, cyber-informatics, and AI-driven healthcare Prof William Latham Professor w.latham (@gold.ac.uk) William is a designer of computer games and computer artist with expertise in evolutionary art. Richard Leinfellner Lecturer R.Leinfellner (@gold.ac.uk) Richard started in the games business in 1980 and has programmed & produced many top ten games. Andy Lomas Lecturer in Creative Computing a.lomas (@gold.ac.uk) Andy is an Emmy award-winning computational artist exploring the complex nature of form and the simulation of growth processes. Georgios Mastorakis Lecturer g.mastorakis (@gold.ac.uk) Georgios is interested in computer vision, machine learning and simulation modeling Dr Sean McGrath Lecturer s.mcgrath (@gold.ac.uk) Sean’s research explores the intersection between technology and people, with a particular focus on audio. Dr Dan McQuillan Lecturer in Creative & Social Computing d.mcquillan (@gold.ac.uk) Senior Lecturer in Critical AI, author of 'Resisting AI' (Bristol University Press) Dr Nikolay Nikolaev Lecturer n.nikolaev (@gold.ac.uk) Nikolay’s recent work is devoted to genetic programming of tree-structured polynomials. Dr James Ohene-Djan Senior Lecturer and Assistant Pro Warden j.djan (@gold.ac.uk) James is interested in digital entrepreneurial studies, social video technologies, and location-based digital services Dr Eleonora Oreggia Lecturer in Electronic Music, Computing and Technology e.oreggia (@gold.ac.uk) Electromagnetic sensing systems for expressive interaction in electronic music, performance, and time-based media art Dr Lahcen Ouarbya Lecturer (Deputy Senior Tutor) mas01lo (@gold.ac.uk) Dr Mattia Paganelli Lecturer Computational Arts m.paganelli (@gold.ac.uk) Lecturer and researcher in non-linearity, philosophy, and contemporary art Professor Sylvia Xueni Pan Professor of Virtual Reality x.pan (@gold.ac.uk) Sylvia has extensive experience working in VR researching Virtual Reality technology and social neuroscience. Sumit Paul-Choudhury Visiting Research Fellow S.Paul-Choudhury (@gold.ac.uk) Sumit is a writer and entrepreneur interested in the commercial and recreational applications of creative computing. Dr Ida Pu Lecturer i.pu (@gold.ac.uk) Ida specialises in probabilistic and average case algorithms, data structures and communications and complexity theory. Dr Lance Putnam Research Associate L.Putnam (@gold.ac.uk) Lance is a composer and researcher, interested in generative art, digital sound synthesis and media signal processing. Dave Ranyard Visiting Fellow D.Raynard (@gold.ac.uk) Dr Tony Russell-Rose Reader in Computer Science t.russell-rose (@gold.ac.uk) Tony's research focuses on the intersection of natural language processing, information retrieval and user experience. Professor Larisa Soldatova Reader in Data Science l.soldatova (@gold.ac.uk) Larisa joined Goldsmiths in November 2017 as director of the online Masters in Data Science programme. Dr Daniel Stamate Senior Lecturer in Data Science d.stamate (@gold.ac.uk) Daniel’s research interests concern problems and applications involving soft computing and data science. Dr. Rabail Tahir Lecturer R.Tahir (@gold.ac.uk) Rabail’s research focuses on optimising technology for the betterment of people particularly educational games Prof Atau Tanaka Professor of Media Computing a.tanaka (@gold.ac.uk) Atau researches embodied musical interaction, human computer interaction and gestural computer music performance. Katie Tindle Lecturer Katie.tindle (@gold.ac.uk) Writing and poetry; collaborative practices; machine learning; physical computing; installation and video art Dr Itshak Tkach Visiting post-doctoral researcher I.Tkach (@gold.ac.uk) Itshak is working with Tim Blackwell on a couple of projects in swarm intelligent optimisation. Darpan Triboan Lecturer d.triboan (@gold.ac.uk) Gabriel Vigliensoni Visiting Research Fellow g.vigliensoni (@gold.ac.uk) Professor Jamie A Ward Head of School, Computing j.ward (@gold.ac.uk) Wearable Computing and Social Neuroscience Jessica Wolpert Programme leader for MA/MFA Computational Arts and a Lecturer in physical computing J.Wolpert (@gold.ac.uk) Jesse is an artist using digital technology to design and build interactive experiences. Professor Matthew Yee-King Programme Director, BSc Computer Science online m.yee-king (@gold.ac.uk) Matthew interests are in education technology, automatic sound synthesizer programming and interactive music systems. Bruno Zamborlin Honorary visiting research fellow bruno (@gold.ac.uk) Bruno's research focuses on converting physical objects into interactive surfaces using vibration sensors and AI Alan Zucconi Senior Lecturer a.zucconi (@gold.ac.uk) Alan Zucconi is a passionate lecturer and developer, working in the intersection between Creativity and Education. Basel Barakat Lecturer b.barakat (@gold.ac.uk) Dr. Basel is specialised in Artificial Intelligence, Machine Learning, Internet of Things, and Wireless Communication Dr Joy Eze Lecturer in Computer Science J.Eze (@gold.ac.uk) My research is an interdisciplinary field that leverages mathematical methods, data science, and health technology. Professor Ira Greenberg Visiting Research Fellow I.Greenberg (@gold.ac.uk) Ira's research integrates creative imaging approaches, including analog, code and AI, with a concentrated interest in exploring connections between contemporary digital practices and Western pictorial history. Dr Patrick Hartono Lecturer in Computational Arts patrick.hartono (@gold.ac.uk) Electroacoustic Composer, Audiovisual Artist, Researcher in Interactive Music and Performanc",
  "content_length": 10551,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:30"
}