{
  "name": "Elahe Soltanaghaei",
  "homepage": "https://elahe.web.illinois.edu",
  "status": "success",
  "content": "Elahe Soltanaghai Elahé Soltanaghai I am an Assistant Professor in the Department of Computer Science and Electrical and Computer Engineering at the University of Illinois Urbana-Champaign. Previously, I was a postdoctoral researcher at Carnegie Mellon University in CyLab working with Anthony Rowe. I received my PhD from the University of Virginia in 2019 working with my advisor Kamin Whitehouse. I also received my M.S. in computer engineering from Sharif University of Technology in 2013. My research interests span the areas of wireless sensing and networking with applications in Cyber-Physical Systems, and Internet of Things. I create the next generation of intelligent wireless systems that are faster, lower power, pervasive, and can even sense the physical environment. You can learn more about my Ph.D research here. My recent work seeks to build a foundation for joint communication and sensing in wireless embedded systems of the future by applying signal processing and machine learning techniques to low-level RF signals. I am the director of Wireless, Sensing and Embedded Networked Systems (iSENS) research group and co-director of Illinois Center for Internet of Things. I am always looking for motivated and creative B.S., M.S., and Ph.D. students, as well as Postdocs to join my group. Find more information here! [CV] [LinkedIn] [Google Scholar] News 06-2025: Check out my interview with NPR Academic Minute obout sensing beneath the forest canopy here!. New!! 03-2025: Received Scott-Fisher Teaching Excellence award. New!! 01-2025: Received a research grant support from NASA FireTech Program for our through-canopy feul sensing research. New!! 12-2024: RadarScanner is accepted to ACM MobiCom'25. New!! 12-2024: BSENSE is accepted to ACM SenSys'24. 11-2024: Our group presents two posters at ACM MobiCom'24.[link, link] 11-2024: Serving in S3 panel at MobiCom'24. 06-2024: BiScatter is accepted to ACM SIGCOMM'24. 04-2024: Received research grant support from NSF for our research on Radar-based Perception and Control. 02-2024: Luke's paper on through-canopy sensing is accepted to IEEE IGARSS'24. 01-2024: Received research grant support from insper-Illinois program for our gaze-based VR interaction research. 12-2023: Selected as the Finalist for Junkosha’s Technology Innovator of the Year Award for our Innovations in microwave/mmWave technologies. 10-2023: check out This news article featuring my undergrad course on IoT! 11-2023: Received a research gift from Keysight for our research on forest sustainability. Thanks for supporting our research! 05-2023: Receieved Best Demo Award Runner-up at IPSN (kudos to Daniel and Thomas). 05-2023: Our research on Powerline Bacskcatter featured in GetMobile Magazine. 04-2023: Receieved NCSA Faculty Fellowship for Scientific Visualization of Invisible Wireless Signals. 04-2023: Gave a talk in Saturday Engineering for Everyone on \"Unleashing the invisible world of wireless signals.\" 03-2023: check out this news article featuring my course on Smart Citis, Homes, and Beyond! . 02-2023: My course on \"Smart Cities, Homes, and Behond\" ranked as Excellent by the Students in Fall'22. 01-2023: Our paper on sub-millimeter micro-displacement sensing with passive tags as phase carriers is accepted at IPSN 2023. 01-2023: Our paper on high resolution point clouds from commodity mmWave radars is accepted at ICRA 2023. 10-2022: Received a research gift from Keysight for our research on forest sustainability. Thanks for supporting our research! 08-2022: Received a seed funding from the US Forest Service for our research on wildfire sensing. Thanks for supporting our research! 05-2022: Received a research gift from T-Mobile. Thanks for supporting our research! 03-2022: Received the Google Research Scholar Award! Research Overview My research group is currently focused on the following key areas: Millimeter-wave Radar Sensing and Communication: including mmWave retro-reflectors for automotive, mixed reality, and structural Health monitoring applications ML for Wireless: for adaptive Sensing and Communication Forest IoT: for sensing biomass and soil moisture through canopy Metaverse Technologies: such as Gaze-based Immersive Interactions in Virtual and Augmented Reality, Pose Estimation in Multi-User AR Sessions Learn more about our research in our group website. Some of our completed research includes: WiFi Sensing and Localization by repurposing the pervasive wireless infrastructure for Human Sensing, Human Identification, Indoor Navigation, and finding hidden IoT devices. Backscatter Communication for Battery-free IoT: including WiFi Tags, and Power-line communication. Teaching CS 437: Topics in IoT [Fall'23] [Fall'24] CS 598: Smart Cities, Homes, Phones, and Beyond (Smart-X) [Spring'22] [Fall'22][Spring'24] (Listed in Teachers Ranked as Excellent) ECE 18-648: Advanced Real-Time Embedded Systems [Fall'21] Students PhD Students: Saif Ur Rahman, Mingyue Tang, Luke Jacobs, Anton Dmitriev, Parham Chavoshian Masters Students: Avery Plote, Arnav Shah, Hanbo Guo, Benhao Lu, Ed Wolski Undergraduate Students: Jizheng (Daniel) He, Ansley Tsai, Sam Hurh, Anant Matta, Navid Tajkhoeshid, Alex Shaffer High School Students: Joseph Torrellas If you are interested in joining our research group, please find more information here! Awards 2023, Recipient of NCSA Faculty Fellowship. 2023, Best Demo Award Runner-up at IPSN'23. 2023, Recipient of Teaching Excellence Award. 2022, received Google Early-career Research Award. 2021, named one of 10 Rising Star Women Worldwide in Networking and Communication. 2020, received the ACM SIGMOBILE Doctoral Dissertation Award runner-up. 2019, selected as 2019 Rising Stars in Electrical Engineering and Computer Science (EECS). 2019, awarded N2Women Young Researcher Fellowship to attend MobiCom 2019. 2017, 2nd place winner, in ACM Student Research Competition (SRC) at MobiCom 2017. 2017, scholarship recipient to attend Grace Hopper Celebration (GHC). 2017, received best poster award in MobiSys Women's workshop. 2017, awarded NSF travel grant to attend MobiSys'17. 2017, received UVA Department of Computer Science Graduate Student Awards for Outstanding Service. 2017, 2nd place winner, in Three Minute Thesis (3MT) competition at UVa. 2017, scholarship recipient to attend CRA-W Grad Cohort Workshop. 2016, received best presentation award in BuildSys'16. 2016, awarded student travel grant to attend Sensys/Buildsys’16. 2016, awarded N2-Women Young Researcher Fellowship at MobiCom’16. 2015, scholarship recipient to attend CRA-W Grad Cohort Workshop. 2011, awarded distinguished BSc student award with honorary acceptance for the MSc program. 2011, 2nd place, B.S. in Information Technology Engineering, Amirkabir University of Technology. 2010, 2nd place, among 90 Computer Engineering B.S. students, Amirkabir University of Technology. Service - Program Committee Member in: ACM MobiCom, 2025, 2024, 2023, 2022 ACM MobiSys, 2025, 2024 ACM IPSN, 2024 USENIX NSDI, 2024, 2023 ACM SenSys 2025, 2023 ACM IoTDI, 2023 ACM SIGCOMM, 2022 - Demo Chair at ACM MobiCom, 2024 - Workshop Co-Chair, IEEE SECON’23 - Distinguished Panelist at C-NICE Future of Communications 2022 - Distinguished Panelist at Sensys'22 and PhD Forum'22 (co-located with Sensys) - Distinguished Panelist at Illinois Scholars Undergraduate Research (ISUR) Program 2022 - Distinguished Panelist at Champaign-Urbana chapter of Girls Who Code 2022 - N2Women Co-Chair, MobiCom’21 - Program Committee Member of WWW, 2021 - Birds-of-Feather (BoF) Panel moderator at MobiSys, 2020 - Program Committee Member of IEEE SECON, 2020 - Workshop Co-Chair, ACM S3 Workshop 2019 (co-located with MobiCom’19) - Expert Panelist, the environmental science class at Charlottesville High School, Spring 2018. Misc. Aside from research, I love to do photography, gardening, cooking, and solving jigsaw puzzles!",
  "content_length": 7896,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:28"
}