{
  "name": "Elaheh Sadredini",
  "homepage": "https://www.cs.ucr.edu/~elaheh",
  "status": "success",
  "content": "Elaheh Sadredini Homepage Elaheh Sadredini Assistant Professor Department of Computer Science Department of Electrical and Computer Engineering (Cooperating Faculty) University of California, Riverside elaheh [at] cs.ucr.edu Office: WCH 318 [CV - April 2025] [Google Scholar] I am always looking for highly motivated and hard-working students interested in working at the intersection of computer architecture with machine learning, data mining, and hardware security. Please contact me if you are interested in working with me. I am an Assistant Professor in the Department of Computer Science and Engineering at the University of California, Riverside. I received my Ph.D. in Computer Science from the University of Virginia in 2019, where I was advised by Professor Kevin Skadron. My research broadly focuses on developing secure, high-performance, and energy-efficient data-centric architectures. My work has been published in several top-tier venues, including MICRO, ISCA, ASPLOS, HPCA, USENIX Security, DAC, ICS, and KDD, and has led to multiple patents. I have received several honors and awards, including the NSF CAREER Award, Best Paper Award at ACM Computing Frontiers, Best of CAL Award, and multiple Best Paper nominations (e.g., HPCA 2020, FCCM 2020, and IISWC 2019). I am also a recipient of the Hellman Fellowship at UCR, the John A. Stankovic Graduate Research Award from UVA, and the UVA International Student Graduation Award for Academic Excellence (awarded to one graduating international graduate student across the university). News Aug 2025 Our paper on \"Enabling High-Throughput Cryptography on MCUs via In-SRAM Computing\" is accepted to IEEE Cross-disciplinary Conference on   Memory-Centric Computing! Congratulations to Jingyao! Jun 2025 Congratualtions to Nurlan for receiving Outstanding Teaching Assistant award! Jun 2025 Congratualtions to Jingyao for receiving Laxmi N. Bhuyan Endowed Fellowship! Jun 2025 Gave an invited talk at the Memory-Centric Computing Systems (MCCSys) workshop (in conjunction with ICS'25). March 2025 Our paper on \"GPU-driven Virtual Memory Management\" is accepted to ICS! Congratulations to Nurlan! Jan 2025 Our paper on \"Secure Computing on PIM Architectures\" is accepted to Usenix Security! Congratulations to my students, Sahar and Jingyao! Nov 2024 I will serve as co-general chair for IISWC'25 with Daniel Wong! Oct 2024 Nurlan wins first place at the ACM SRC competition at PACT 2024. Jan 2024 Received the NSF CAREER Award on \"Enabling Memory-Centric Computing from Internet of Things to Cloud\". Thanks, NSF! Jun 2023 Received the NSF FuSe grant with Philip Brisk. Thanks, NSF! Feb 2023 Our paper on \"Low-overhead Number Theoritic Transform with In-SRAM Computing\" is accepted to DAC 2023 . Congrats to my PhD student, Jingyao! July 2022 Our paper on \"Enabling In-SRAM Cryptographic Hash for IoT\" is accepted to ICCAD 2022 . Congratualtions to my PhD student, Jingyao! Jun 2022 Awarded the Hellman Fellowship! May 2022 Our paper on accelerating memory encryption with in-SRAM computing is accepted to ISLPED 2022 . Congratualtions to my PhD student, Jingyao! April 2022 Our patent on accelerating tree mining using non-detereministic state machines is awarded (funded by SRC). March 2022 I will be serving on the TPC for MICRO 2022. Submit your best work! March 2022 BioHD paper is accepted to ISCA 2022 Feb 2022 One paper is accepted to DAC 2022 Sep 2021 We welcome Jingyao Zhang, the first PhD student in the lab! July 2021 Our paper on enabling near-data pattern matching acceleration is accepted to MICRO 2021. July 2021 Received University of California Regents Faculty Fellowship. Feb 2021 I will be serving on the TPC for PACT 2021 and ICCD 2021. Feb 2021 Our paper is accepted to DAC 2021. Nov 2021 Our paper on enabling an in-SRAM reporting architecture for automata processing is accepeted to CAL. July 2021 Started as an assistant professor at UC Riverside! May 2020 Our FCCM paper, Grapefruit, is nominated for the best paper award. Jan 2020 Our HPCA paper, Impala, is nominated for the best paper award. Dec 2019 Our paper received the \"Best of CAL\" award and is invited to be presented in HPCA 2020. Nov 2019 Our paper is accepted to ASPLOS 2020. Nov 2019 Two papers are accepted to HPCA 2020. Oct 2019 Our IISWC paper is nominted for the best paper award. Sep 2019 Received best presentation award at SRC TECHCON. May 2019 Received University of Virginia ISO (International Studies Office) graduation award. May 2019 Started Postdoc at the University of Virginia, Center for Research in Intelligent Storage and Processing in Memory (CRISP) Center. May 2019 Received my PhD from the University of Virginia (dissertation, slides). April 2019 Received John A. Stankovic graduate research award.",
  "content_length": 4773,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:30"
}