{
  "name": "Elda Paja",
  "homepage": "https://pure.itu.dk/portal/en/persons/elda-paja(ce1a5350-f645-4a53-a745-fca8d4f1f030).html",
  "status": "success",
  "content": "Elda Paja - IT-University of Copenhagen Elda Paja Associate Professor, Software EngineeringSoftware EngineeringCenter for Information Security and Trust https://orcid.org/0000-0002-8346-2467 Emailelpaitudk 20192023 Research activity per year Personal profile KeywordsRequirements engineeringSecurity requirementsRegulatory complianceModel-based RE Fingerprint Dive into the research topics where Elda Paja is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 3 Similar Profiles Data Practices Keyphrases 100% Requirement Engineering Computer Science 100% Policy Evolution Keyphrases 83% General Data Protection Regulation Computer Science 83% Requirements Engineering Keyphrases 75% Privacy Policies Computer Science 75% Privacy Policy Keyphrases 66% Business Intelligence Computer Science 66% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2019 2019 2021 2022 2023 5 Journal article 4 Article in proceedings Research output per year Research output per year Towards a Basic Security Framework for SMEs: Results From an Investigation of Cybersecurity Challenges in DenmarkFleron, C. N., Jørgensen, J. K., Kulyk, O. & Paja, E., 4 Sept 2023, 2023 IEEE 31st International Requirements Engineering Conference Workshops (REW). 2023 ed. Los Alamitos, CA, USA: IEEE, p. 230-233 Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Cybersecurity 100% Conducted Interview 100% Security Protection 100% Security Framework 100% Cybersecurity Risk 100% A Study on Security and Privacy Practices in Danish CompaniesDalela, A., Giallorenzo, S., Kulyk, O., Mauro, J. & Paja, E., Apr 2022, Usable Security and Privacy (USEC) Symposium 2022. Internet societyResearch output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Security Privacy 100% Security Measures 100% Security Practices 100% Privacy Practices 100% Security and Privacy 100% Consent verification monitoringRobol, M., D. Breaux, T., Paja, E. & Giorgini, P., 29 Jun 2022, In: ACM Transactions on Software Engineering and Methodology (TOSEM).Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Data Practices 100% General Data Protection Regulation 100% Use Case 100% Data Processing 100% Policy Evolution 66% Philanthropic conference-based requirements engineering in time of pandemic and beyondLevy, M., Hadar, I., Horkoff, J., Hayes, J. H., Paech, B., Dekhtyar, A., Mussbacher, G., Paja, E., Li, T., Lee, S.-W. & Fang, D., 10 Sept 2022, In: Requirements Engineering. p. 1-15 15 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open AccessFile Software Engineering 100% Requirements Engineering 100% Requirement Engineering 100% Software Development 33% Social Good 33% You have been in Close Contact with a Person Infected with COVID-19 and you may have been Infected: Understanding Privacy Concerns, Trust and Adoption in Mobile COVID-19 Tracing Across Four CountriesKulyk, O., Britton-Steele, L., Paja, E., Schmidt, M. D. & Barkhuus, L., 20 Sept 2022, Proceedings of the ACM on Human-Computer Interaction. Nichols, J. (ed.). Issue MHCI ed. New York: Association for Computing Machinery, Vol. 6. p. 1-27 204Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile Privacy Concerns 100% Close Contact 100% COVID-19 100% Privacy Concern 100% Adoption Rate 66% View all 9 research outputs Projects Projects per year 2023 2023 2024 1 Finished Projects per year aDESSO: Towards demonstrating secure software development for small and medium enterprises in a business-to-business modelKulyk, O. (PI), Paja, E. (PI), Asadi, R. (CoI), Oppermann, N. (Admin) & Ibsen, P. (Admin)DigitalLead 15/09/2023 → 31/03/2024Project: Research Interactive Session 100% Social Proof 100% Large Corporations 100% Security Criteria 100% All-solution-processed 100%",
  "content_length": 4475,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:37"
}