{
  "name": "Eleftherios Kokoris-Kogias",
  "homepage": "https://ist.ac.at/en/research/kokoris-group",
  "status": "success",
  "content": "ISTA | Kokoris-Kogias Group HomeResearchKokoris-Kogias Group EDUCATION Graduate School Postdocs Internship and Scholarship Program VISTA Science Experiences Kokoris Group Secure, Private, and Decentralized Systems (SPiDerS) In the last decades, computing enabled society to interconnect transcending the physical limits of its distributed nature. Trust is often sacrificed in the name of efficiency and speed that our era impatiently demands. Speed, however, is the enemy of trust as building trust requires friction and time. Several traditional trust-oriented institutions that ought to prioritize security and privacy over efficiency, such as banks, media, and governments, are called to adapt to this ongoing digital revolution. Our fast and interconnected digital world brings great challenges: our systems are left vulnerable to potential adversaries that can exploit the security weaknesses introduced to cope with the ferocious demand for speed. The SPiDerS group sheds light on the benefits and shortcomings of this latest explosion of interest in the decentralized trust technologies. The group focuses on Byzantine Fault Tolerant systems and algorithms, where various interesting research questions have emerged: How can the current financial ecosystem integrate scalable decentralized systems? How can we scavenge randomness from multiple semi-trustworthy players to run publicly-verifiable lotteries or audit elections? The driving force and inspiration of the group’s research focus stems from both the technical challenges presented in existing systems, as well as the socio-technical barriers faced by conventional institutions. The SPiDerS group aspires to contribute to this rapidly-evolving digital world by designing and building secure scalable decentralized systems with real-world impact. Administrative Support Christine Francois Assistant to Professors +43 2243 9000 1098 christine.francois-rennhofer@ist.ac.at Team Current Projects Performance and Incentives for Decentralized Systems | Cryptographically Secure Distributed Randomness Generation | Theory and Practice of Scalable Blockchains and Interoperability | Decentralized Private Data Management Publications Blackshear S, Chursin A, Danezis G, Kichidis A, Kokoris Kogias E, Li X, Logan M, Menon A, Nowacki T, Sonnino A, Williams B, Zhang L. 2024. Sui Lutris: A blockchain combining broadcast and consensus. Proceedings of the 2024 on ACM SIGSAC Conference on Computer and Communications Security. CCS: Conference on Computer and Communications Security, 2606–2620. View Tsimos G, Kichidis A, Sonnino A, Kokoris Kogias E. 2024. HammerHead: Leader reputation for dynamic scheduling. Proceedings – International Conference on Distributed Computing Systems. ICDCS: International Conference on Distributed Computing Systems, 1377–1387. View Giuliari G, Sonnino A, Frei M, Streun F, Kokoris Kogias E, Perrig A. 2024. An empirical study of consensus protocols’ DoS resilience. Proceedings of the 19th ACM Asia Conference on Computer and Communications Security. ASIACCS: Asia Conference on Computer and Communications Security, 1345–1360. View Stefo C, Xiang Z, Kokoris Kogias E. 2023. Executing and proving over dirty ledgers. 27th International Conference on Financial Cryptography and Data Security. FC: Financial Cryptography and Data Security, LNCS, vol. 13950, 3–20. View Cohen S, Goren G, Kokoris Kogias E, Sonnino A, Spiegelman A. 2023. Proof of availability and retrieval in a modular blockchain architecture. 27th International Conference on Financial Cryptography and Data Security. FC: Financial Cryptography and Data Security, LNCS, vol. 13951, 36–53. View View All Publications ReX-Link: Lefteris Kokoris Kogias Career Since 2021 Assistant Professor, Institute of Science and Technology Austria (ISTA)Since 2020 Research Scientist, Facebook Research/Novi, London, UK2020 – 2020 Research Scientist, Web3 Foundation, Zug, Switzerland2019 – 2020 Postdoc, EPFL, Lausanne, Switzerland2019 – 2019 Visiting Scientist, VMware Research, Palo Alto, CA, USA2018 – 2018 Intern, IBM Research Zurich, Switzerland2015 – 2019 PhD, EPFL, Lausanne, Switzerland2015 MEng, National Technical University of Athens, Greece Selected Distinctions 2018 IBM PhD Fellowship2017 IBM PhD Fellowship2015 EDIC PhD Fellow, EPFL2014 NTUA Thomaidion Award Additional Information Lefteris Kokoris-Kogias’ website Back to Top We use cookies on our website. By clicking “Technically Necessary Cookies” no other cookies than cookies that are technically necessary to enable various functionalities of the website (e.g. provide access to the website, display of cookie banner) are enabled. However, you may go to \"Cookie Settings\" to provide a controlled consent.Read more...Cookie SettingsAccept AllTechnically Necessary CookiesManage cookies Close Privacy Overview This website uses cookies. Below you can provide individual consent regarding the use of cookies. Cookies under the category \"necessary\" are always enabled since they are technically necessary to access the website. You can find more information on the use of cookies in the data protection statement of ISTA Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website. CookieDurationDescriptioncookielawinfo-checkbox-analytics1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-necessary1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".CookieLawInfoConsent1 yearThis cookie only appears if you makes changes to the categories (e.g disable the category “Analytics”).pll_language1 yearThe ISTA website is a multilingual website, WordPress requires a default language to be selected and set by a cookie in order to display the website, which is recorded by the pll_language cookie by Polylang. Furthermore this cookie is also used to remember the language selected by the user when returning to the website.viewed_cookie_policy1 yearThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. CookieDurationDescription_pk_id*13 monthsMatomo tracking cookie stores a unique user id._pk_ses*13 monthsMatomo tracking cookie stores a unique session id. SAVE & ACCEPT Powered by",
  "content_length": 6756,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:37"
}