{
  "name": "Elena Agapie",
  "homepage": "https://eagapie.com",
  "status": "success",
  "content": "Elena Agapie; Assistant Professor at UC Irvine Assistant Professor Department of Informatics Donald Bren School of Information & Computer Sciences University of California, Irvine eagapie@uci.edu Current PhD Students Bruna Oewel Meeshu Agnihotri Mehreen Masood I am an Assistant Professor in Informatics at University of California, Irvine. I research, design and build technologies that empower people to engage in health behaviors through a human centered approach. My work draws on people's lived experiences and expert practices to support the implementation of evidence based behavioral interventions. My research informs understanding on how technology can support healthy behaviors, and can be designed to support new ways of delivering interventions using technology. I am affiliated with the Connected Learning Lab and the Institute for Future Health. My research was generously funded by the National Science Foundation, National Institutes of Health, and UCI Internal grants. I received my PhD in Human Centered Design and Engineering at University of Washington, where I was affiliated with the DUB Group and the UW Alacrity Center. I completed a MS in Computer Science at Harvard University, and a BS in Computer Science at Jacobs University Bremen in Germany. I worked on research teams at Microsoft Research, FXPAL, Intel Labs and NASA Jet Propulsion Lab. I run initiatives to broaden participation in computing and engineering. While at University of Washington, I have grown the Outreach program in the HCDE department. I led undergraduate students in teaching design and engineering workshops with thousands of K-12 students and teachers from across the Seattle area and Washington state. I have been lucky to experience diverse international environments. I lived, studied and taught in Romania, France, Germany, Israel, Peru and the US. Interested in working with me? I am actively recruiting students interested in working at the intersection of HCI, Health, and/or Behavior Change! I welcome students with a variety of backgrounds, including: Informatics, Computer Science, Design, Psychology and Health. If you are a prospective PhD student, please apply to the Informatics PhD program. If you are an UCI undergraduate or Master student and want to do independent research with me, send me your CV or portoflio, transcript, and a description of what aspects of my research interest you. To work with me, I recommend having some experience in qualitative or mixed methods, design and prototyping, or programming. Undergraduate students should first take IN4MATX131 or have equivalent experience.",
  "content_length": 2617,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:36"
}