{
  "name": "Elena Hernández-Pereira",
  "homepage": "https://pdi.udc.es/en/File/Pdi/XC7AF",
  "status": "success",
  "content": "Elena María Hernández Pereira File. Department Computer Science and Information Technologies Knowledgment area Computational Science and Artificial Intelligence Research Research group Laboratorio de Investigación y Desarrollo en Inteligencia Artificial Research lines Artificial Intelligence Decision Support Systems Machine Learning Teaching merits evaluation 4 five years period(s) Research merits evaluation 5 six years period(s) Contacto UDC directory Orcid id0000-0001-8666-4075 ResearcherIDA-7682-2015 Scopus6506783224 Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Advanced Models of Machine Learning II Degree in Artificial Intelligence Optional 0 18 Algorithms Degree in Computer Engineering Compulsory 0 25 Design and Analysis of Algorithms Degree in Data Science and Engineering Compulsory 0 15 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 14.5 Final Year Dissertation. Mention in Information Systems Degree in Computer Engineering Compulsory 0 0.5 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 1 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 3 Malware Analysis Master in Cibersecurity Compulsory 0 21 Privacy and Anonymity Master in Cibersecurity Compulsory 0 15.5 Programming II Degree in Computer Engineering Programa de Simultaneidad del Grado en Ingeniería Informática y Grado en Ciencia e Ingeniería de Datos Core 0 30 Work Placement Master's in Computer Engineering Compulsory 0 0 Subject and involved studies Type Distance hours Total hours Advanced Models of Machine Learning II Degree in Artificial Intelligence Optional 0 18 Algorithms Degree in Computer Engineering Compulsory 0 25 Design and Analysis of Algorithms Degree in Data Science and Engineering Compulsory 0 15 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 6.66 Fundamentals of Programming II Degree in Data Science and Engineering Core 0 15 Malware Analysis Master in Cibersecurity Compulsory 0 21 Privacy and Anonymity Master in Cibersecurity Compulsory 0 15.5 Programming II Degree in Computer Engineering Core 0 15 Subject and involved studies Type Distance hours Total hours Algorithms Degree in Computer Engineering Compulsory 0 25 Design and Analysis of Algorithms Degree in Data Science and Engineering Compulsory 0 15 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 34 Final Year Dissertation. Mention in Information Systems Degree in Computer Engineering Compulsory 0 1 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 8 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 2 Fundamentals of Programming II Degree in Data Science and Engineering Core 0 15 Malware Analysis Master in Cibersecurity Compulsory 0 21 Privacy and Anonymity Master in Cibersecurity Compulsory 0 15.5 Programming II Degree in Computer Engineering Core 0 15 Subject and involved studies Type Distance hours Total hours Algorithms Degree in Computer Engineering Compulsory 0 25 Design and Analysis of Algorithms Degree in Data Science and Engineering Compulsory 0 15 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 8 Fundamentals of Programming II Degree in Data Science and Engineering Core 0 30 Large Scale Machine Learning Degree in Data Science and Engineering Optional 0 4.5 Malware Analysis Master in Cibersecurity Compulsory 0 17 Programming II Degree in Computer Engineering Core 0 15 Subject and involved studies Type Distance hours Total hours Algorithms Degree in Computer Engineering Compulsory 0 33 Design and Analysis of Algorithms Degree in Data Science and Engineering Compulsory 0 15 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 16 Fundamentals of Programming II Degree in Data Science and Engineering Core 0 30 Malware Analysis Master in Cibersecurity Compulsory 0 17 Programming II Degree in Computer Engineering Core 0 15 Subject and involved studies Type Distance hours Total hours Algorithms Degree in Computer Engineering Compulsory 0 25 Cybercrime and Cybersecurity Master in Digital and Artificial Intelligence Law Compulsory 0 2.5 Design and Analysis of Algorithms Degree in Data Science and Engineering Compulsory 0 15 Fundamentals of Programming II Degree in Data Science and Engineering Core 0 30 Intellectual Property, Industrial Property and Competition Law Master in Digital and Artificial Intelligence Law Compulsory 0 1 Malware Analysis Master in Cibersecurity Compulsory 0 17 Programming II Degree in Computer Engineering Core 0 11 Work Placement Degree in Computer Engineering Optional 0 0 Work Placement Degree in Computer Engineering Optional 0 2 Tutoring 2025/2026 Defined tutoring by teacher for 2025/2026 academic course. Faculty of Computer Science Quarter Day Site 1st quarter Tuesday 17:30 a 18:30 correo previo a elena.hernandez@udc.es 1st quarter Wednesday 12:00 a 14:00 correo previo a elena.hernandez@udc.es 1st quarter Thursday 09:30 a 10:30 correo previo a elena.hernandez@udc.es 2nd quarter Monday 12:30 a 13:30 correo previo a elena.hernandez@udc.es 2nd quarter Wednesday 17:00 a 18:30 correo previo a elena.hernandez@udc.es 2nd quarter Thursday 12:00 a 13:30 correo previo a elena.hernandez@udc.es 2nd chance Tuesday 16:00 a 18:00 Teams (correo previo a elena.hernandez@udc.es) 2nd chance Thursday 11:00 a 13:00 Teams (correo previo a elena.hernandez@udc.es) EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 2019/2020 Analysis and recovery of missing values in machine learning: Designing a library for dataset optimization and recovery Agent-Based System for forest fire management. Application of active learning with noisy oracles in a game context Human-in-the-loop optimization system to improve medical image interpretability AI-based algorithm for intrusion detection on a real dataset Curriculum learning in training Deep Networks Deep learning model for segmentation and classification of medical images Community detection in networks Comparing community detection algorithms in graphs Curriculum learning in training Deep Networks Machine learning for malware analysis Missing data imputation in machine learning The detection of sleep activities through the application of deep learning Deep Learning applied to sleep stage classification Transfer learning in sleep stage classification Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Patents, records and utility models Papers in research journals Book chapters PhD theses directed Conference papers 2024 2023 2022 2020 2019 ... 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 2005 2004 2003 2001 Funding entity Fondo Europeo de Desarrollo Regional (FEDER) Type Proyecto UE Dates From 01/01/2024 to 31/12/2026 Funding entity Ministerio de Ciencia, Innovación y Universidades Main researches Berta Guijarro Berdiñas (IP1) / Amparo Alonso Betanzos (IP2) Type Proyecto Programas Nacionales Dates From 01/09/2024 to 31/08/2027 Funding entity Union Europea Main researches Francisco Javier González Varela, Manuel F. González Penedo Type Proyecto UE Dates From 01/09/2023 to 31/12/2025 Funding entity Consellería de Educación Main researches Amparo Alonso Betanzos Type Proyecto Programas Autonomicos Dates From 01/01/2022 to 20/11/2025 Funding entity Red.es Main researches José Luis Calvo Rolle ; Óscar Fontenla Romero Type Proyecto Programas Nacionales Dates From 01/09/2022 to 30/04/2024 Funding entity Xunta de Galicia Main researches Pablo Fariñas Alvariño, Tiago M. Fernández Caramés Type Proyecto Programas Autonomicos Dates From 20/07/2022 to 19/07/2025 Funding entity FUNDACIÓN BBVA Type Proyecto Otros Programas Dates From 24/03/2020 to 24/03/2022 Funding entity Ministerio de Ciencia e Innovación Main researches Eduardo Mosqueira Rey, Elena Hernández Pereira Type Proyecto Programas Nacionales Dates From 01/06/2020 to 31/05/2023 Funding entity FUNDACIÓN BBVA Main researches Óscar Fontenla Romero Type Proyecto Programas Nacionales Dates From 30/04/2020 to 30/10/2022 Funding entity Agencia Gallega de Innovación (GAIN) Main researches Ricardo Cao Abad Type Proyecto Programas Autonomicos Dates From 01/11/2020 to 31/12/2022 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Amparo Alonso Betanzos Type Proyecto Programas Autonomicos Dates From 01/01/2019 to 20/11/2021 Funding entity Centro para el Desarrollo Tecnológico e Industrial (CDTI) Main researches Elena Hernández Pereira Type Contrato Dates From 01/07/2016 to 30/06/2018 Funding entity Ministerio de Economía y Competitividad Main researches Francisco Herrera Triguero Type Proyecto Programas Nacionales Dates From 01/01/2015 to 01/01/2017 Funding entity UNIÓN FENOSA DISTRIBUCIÓN S.A. Main researches Elena María Hernández Pereira Type Contrato Dates From 15/05/2014 to 15/07/2014 Funding entity GAS NATURAL - UNIÓN FENOSA Main researches Elena María Hernández Pereira Type Contrato Dates From 01/01/2014 to 31/12/2014 Funding entity Xunta de Galicia Main researches Juan Touriño Domínguez Type Proyecto Programas Autonomicos Dates From 01/01/2014 to 31/12/2015 Funding entity Ministerio de Economía y Competitividad Main researches Vicente Moret Bonillo Type Proyecto Programas Nacionales Dates From 01/01/2014 to 31/12/2016 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Amparo Alonso Betanzos Type Proyecto Programas Autonomicos Dates From 01/0",
  "content_length": 27183,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:41"
}