{
  "name": "Elena Sherman",
  "homepage": "https://www.boisestate.edu/coen-cs/people/faculty/elena-sherman",
  "status": "success",
  "content": "Elena Sherman, Ph.D. - Computer Science Skip to main content Computer Science People Faculty Elena Sherman, Ph.D. Elena Sherman, Ph.D. Elena Sherman, Ph.D. Associate Professor USB 208B Call: (208) 426-5766 elenasherman@boisestate.edu About Elena Sherman Bio Publications Research Areas of Interest Bio Elena Sherman received her Ph.D. in Computer Science in December 2012 from the University of Nebraska – Lincoln where she also completed her Masters degree in the same field. She has participated in summer internship programs at Google, Inc. and NASA‘s Ames Research Center. Elena actively participates in the software engineering community by organizing several Java program analysis workshops, serving on program committees of software engineering conferences and being a reviewer for software engineering journals. Publications Sherman, E., Dwyer, M.B., and Elbaum, S.G., “Saturation-based testing of concurrent programs”, FSE’09. Sherman, E., Garvin, B.J., and Dwyer, M.B.,” A slice-based Decision Procedure for Type-based Partial Order”, IJCAR’10. Kausler, S., and Sherman, E., “Evaluation of String Constraint Solvers in the Context of Symbolic Execution”, ASE’14. Sherman, E., Garvin, B.J., and Dwyer, M.B., “Deciding Type-Based Partial-Order Constraints for Path-Sensitive Analysis”, TOSEM’15. Sherman, E., and Dwyer, M.B., “Exploiting Domain and Program Structure to Synthesize Efficient and Precise Data Flow Analyses”, ASE’15. Research Elena’s overall research interests focus on developing techniques that help software engineers to determine what the software that they build actually “does” when it is executed. Previously, she has carried out research work in testing of concurrent programs and in developing decision procedures. Currently she investigates techniques that are suitable for integrating the information obtained by various program analyses. Areas of Interest Static and dynamic program analyses Program testing Decision procedures Computer Science computerscience@boisestate.edu (208) 426-5766 City Center Plaza (CCP), RM 364 Back To Top",
  "content_length": 2069,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:37"
}