{
  "name": "Elena Zheleva",
  "homepage": "https://www.cs.uic.edu/~elena",
  "status": "success",
  "content": "Elena Zheleva - University of Illinois at Chicago (UIC) Contact: Office: SEO 1140 Research interests My research spans different aspects of data science, including machine learning, causal inference, graph mining, network science, and privacy. My research goal is to unify these aspects in a single framework that allows us to reason better with data and solve important societal problems. I am especially interested in algorithms for heterogeneous graphs and networks, with focus on the following goals: Identify and resolve barriers to causal inference from relational data for real-world applications Improve machine learning models by addressing inherent biases in (found) data Empower people in their privacy choices through personalized privacy assistants I am motivated by compelling applications, and some of the areas that I study are personalization, social media, social networks, psychology, journalism, and e-commerce. If you are a prospective student interested to work with me, you need to apply to the CS Ph.D. program. If you are already admitted to the program, send me an email with your interests and CV. You may also want to read this article on how to be a successful Ph.D. student. News August 2021: Presenting a tutorial on \"Causal Inference from Network Data\" @ KDD 2021 July 2021: Zohreh Ovaisi is presenting our paper on \"Propensity-independent Bias Recovery in Offline Learning-to-rank Systems\" at SIGIR 2021 June 2021: Excited and humbled to receive NSF CAREER Award to study Relational Causal Inference (news blurb) June 2021: Shishir Adhikari is presenting our paper on \"Understanding the Dynamics between Vaping and Cannabis Legalization Using Twitter Opinions\" at ICWSM 2021 May 2021: Receiving COE Research Award April 2021: Giving an invited talk at Facebook, Computational Social Science group March 2021: Our research lab receives an Adobe Research grant to study heterogeneous treatment effect estimation March 2021: Panelist on \"Developing Bias Free AI Solutions\" at IIT February 2021: Co-organizing the Women's Mentoring Session @ AAAI 2021 August 2020: Our lab has three papers accepted at the KDD Workshop on Mining and Learning with Graphs (MLG) June 2020: Our paper on \"Minimizing Interference and Selection Bias in Network Experiment Design\" receives an Honorable Mention for Best Paper at ICWSM 2020 May 2020: Our lab receives an NSF grant to study stay-at-home attitudes and their impact on the COVID-19 pandemic April 2020: Zohreh Ovaisi presents our paper on \"Correcting for Selection Bias in Learning-to-rank Systems\" at WWW 2020 January 2020: Our research lab receives a grant from Anthem October 2019: Our lab has two papers accepted at DSAA 2019 October 2019: UIC receives a TRIPODS grant from NSF to establish a Foundations of Data Science Institute July 2019: Our research lab receives a grant from DARPA to study learning individualized interventions May 2019: Giving an invited talk at the NetSci Workshop on Machine Learning in Network Science March 2019: Usman Shahid is presenting our paper on \"Counterfactual learning in networks: an empirical study of model dependence\" at AAAI Symposium on Causality January 2019: Looking forward to serving as a mentor at Women's Mentoring Breakfast at AAAI 2019 January 2019: Serving as publicity co-chair for DSAA 2019 January 2019: Chris Tran is presenting our paper on \"Learning Triggers for Heterogeneous Treatment Effects\" at AAAI 2019 November 2018: Giving an invited talk on \"Privacy in personal-data networks\" at the TRIPODS Workshop on Privacy in Graphs October 2018: Co-organizing the 3rd workshop on Translational Data Science hosted by NYU September 2018: Our letter to Nature on \"How to deliver translational data-science benefits to science and society\" has been published August 2018: Excited to receive a four-year NSF grant to study retrospective data management for enabling long-term security and privacy, with Chris Kanich and Blase Ur August 2018: Co-organizing the 2nd Workshop on Data Science, Journalism & Media at KDD 2018 February 2018: Giving an invited talk at the Northwestern University Institute on Complex Systems Seminar Series February 2018: Giving an invited talk at the UIC Social Psychology Seminar Series February 2018: Invited speaker at UIUC's weSTEM Conference October 2017: Invited talk at DePaul University's CDM Research Colloquium August 2017: Giving a keynote at the Mining and Learning with Graphs (MLG) Workshop at KDD 2017 August 2017: Co-organizing the Workshop on Data Science + Journalism at KDD 2017 August 2017: Our paper on \"Optimizing the Effectiveness of Incentivized Social Sharing\" was accepted at ASONAM 2017 June 2017: Co-organizing the workshop on Translational Data Science in Chicago May 2017: Receiving a DCFemTech Award which recognizes \"powerful women programmers, designers, and data scientists\" in Washington, DC April 2017: Invited talk on Data Science in Social Spaces: Personalization vs. Privacy at DIMACS Workshop on Privacy and Security in Big Data April 2017: Serving as publicity co-chair for ICDE 2017 February 2017: Our paper on \"Directed Edge Recommender System\" is accepted at WSDM 2017 November 2016: Presenting in the NIH BD2K Webinar Series on \"Databases & Data Warehouses, Data: Structures, Types, Integrations\" September 2016: Starting 2016-2017 AAAS Scence & Technology Policy Fellowship in Big Data & Analytics at the National Science Foundation Teaching Fall 2023 - CS 520 Causal Inference and Learning Fall 2022 - CS 520 Causal Inference and Learning Spring 2022 - CS 418 Introduction to Data Science Fall 2021 - CS 520 Causal Inference and Learning Spring 2021 - CS 412 Introduction to Machine Learning Fall 2020 - CS 520 Causal Inference and Learning Spring 2020 - CS 418 Introduction to Data Science Fall 2019 - CS 594 Causal Inference and Learning Spring 2019 - CS 418 Introduction to Data Science Fall 2018 - CS 412 Introduction to Machine Learning Spring 2018 - CS 412 Introduction to Machine Learning Fall 2017 - CS 594 Data Science for Networks Publications A. Piras, M. Negro, R. Ahsan, D. Arbour, E.Zheleva. Relational Causal Discovery with Latent Confounders. 41st Conference on Uncertainty in Artificial Intelligence (UAI) 2025. A. Faruk, E. Zheleva. Leveraging heterogeneous spillover in maximizing contextual bandit rewards. 33rd International World Wide Web Conference (WWW/WebConf) 2025. Z. Fatemi, E. Zheleva. Contagion Effect Estimation Using Proximal Embeddings. Conference on Causal Learning and Reasoning (CLeaR) 2025. S. Adhikari, E. Zheleva. Inferring individual direct causal effects under heterogeneous peer influence. Machine Learning Journal (MLJ) 2025. Also presented at DSAA 2024. S. Adhikari, S. Medya, E. Zheleva. Exposure Mapping Function Learning for Peer Effect Estimation. AAAI Workshop on Artificial Intelligence with Causal Techniques (AICT) 2025. A. Faruk, E. Zheleva. Contextual bandits for maximizing stimulated word-of-mouth rewards. AAAI Workshop on Bridging the Gap between AI Planning and Reinforcement Learning (PRL) 2025. R. Chaturvedi, S. Chaturvedi, E. Zheleva. Bridging or Breaking: Impact of Intergroup Interactions on Religious Polarization. 32nd International World Wide Web Conference (WWW/WebConf) 2024. Z. Ovaisi, P. Saadatpanah, S. Sefati, M. Ohanessian, E. Zheleva. Fairness of Interaction in Ranking under Position, Selection, and Trust Bias. ACM Transactions on Recommender Systems (TORS) 2024. Z. Fatemi, J. Pouget-Abadie, E. Zheleva. Cascade-based Randomization for Inferring Causal Effects under Diffusion Interference. International AAAI Conference on Web and Social Media (ICWSM) 2024. A. Wentzel, L. Levine, V. Dhariwal, Z. Fatemi, A.Bhattacharya, B. Di Eugenio, A. Rojecki, E. Zheleva, G.E. Marai, MOTIV: Visual Exploration of Moral Framing in Social Media. Computer Graphics Forum, pp. 1-4, 2024. R. Chauhan, C. Riis, S. Adhikari, S. Derrible, E. Zheleva, C. Choudhury, F. Pereira. Determining causality in travel mode choice. Travel Behaviour and Society. Vol. 36, July 2024. A. Wentzel, L. Levine, V. Dhariwal, Z. Fatemi, A. Bhattacharya, B. Di Eugenio, A. Rojecki, E. Zheleva, G. E. Marai. A Lens to Pandemic Stay at Home Attitudes. IEEE VIS Workshop on Visualization for Pandemic and Emergency Responses (Vis4PandEmRes) 2023. PDF. Z. Fatemi, M. Huynh, E. Zheleva, Z. Syed, X. Di. Mitigating Cold-start Problem using Cold Causal Demand Forecasting Model. NeurIPS Workshop on Temporal Graph Learning (TGL) 2023. PDF. Z. Fatemi, E. Zheleva. Network Experiment Designs for Inferring Causal Effects Under Interference. Frontiers in Big Data, section Data Mining and Management, Vol.6, 2023. PDF. R. Ahsan, D. Arbour, E. Zheleva. Learning Relational Causal Models with Cycles through Relational Acyclification. AAAI Conference on Artificial Intelligence (AAAI) 2023. PDF. Code. Z. Fatemi, A. Bhattacharya, A. Wentzel, V. Dhariwal, L. Levine, A. Rojecki, G.E. Marai, B. Di Eugenio, E. Zheleva. Understanding Stay-at-home Attitudes through Framing Analysis of Tweets. IEEE/ACM Conference on Data Science and Advanced Analytics (DSAA) 2022. PDF. Data. C. Tran, E. Zheleva. Improving Data-driven Heterogeneous Treatment Effect Estimation under Structure Uncertainty. 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD) 2022. PDF. Code. R. Ahsan, Z. Fatemi, D. Arbour, E. Zheleva. Non-parametric Inference of Relational Dependence. 38th Conference on Uncertainty in Artificial Intelligence (UAI) 2022. PDF. Code. C. Tran, E. Zheleva. Heterogeneous Peer Effects in the Linear Threshold Model. AAAI Conference on Artificial Intelligence (AAAI) 2022. PDF. Code. R. Ahsan, D. Arbour, E. Zheleva. Relational Causal Models with Cycles: Representation and Reasoning. Conference on Causal Learning and Reasoning (CLeaR) 2022. PDF. Z. Ovaisi, S. Heinecke, J. Li, Y. Zhang, E. Zheleva, C. Xiong. RGRecSys: A Toolkit for Robustness Evaluation of Recommender Systems. Demo paper. 15th ACM International Conference on Web Search and Data Mining ",
  "content_length": 26432,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:40"
}