{
  "name": "Eleni Vasilaki",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/eleni-vasilaki",
  "status": "success",
  "content": "Professor Eleni Vasilaki | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Professor Eleni Vasilaki DPhil, CEng, MIET School of Computer Science Chair in Bioinspired Machine Learning Head of the Machine Learning research group Member of the Complex Systems Modelling research group Open staff member portrait in a modal window e.vasilaki@sheffield.ac.uk Regent Court (DCS) Full contact details Professor Eleni Vasilaki School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0003-3705-7070 Personal website Profile Eleni graduated with a Bachelor’s degree in Informatics and Telecommunications and a Master’s degree in Microelectronics from the University of Athens, before taking her DPhil (PhD) at Sussex, in Computer Science and Artificial Intelligence.From 2004 to 2006 she worked at the University of Bern and from 2007 to 2009 at the Swiss Federal Institute of Technology Lausanne (EPFL). In 2009 she joined the University of Sheffield as Lecturer, where she is Professor since 2016. Research interests Bioinspired Machine Learning, Neuromorphic Computing, Computational Neuroscience   Eleni and her team take inspiration from biological principles to design novel, machine learning techniques, and in particular reinforcement learning and reservoir computing methods. They also work closely with material scientists and engineers to design hardware that computes in a brain-like manner. Publications Journal articles Manneschi L, Vidamour IT, Stenning KD, Swindells C, Venkat G, Griffin D, Gui L, Sonawala D, Donskikh D, Hariga D , Donati E et al (2025) Noise-aware training of neuromorphic dynamic device networks. Nature Communications, 16(1). View this article in WRRO Stenning KD, Gartside JC, Manneschi L, Cheung CTS, Chen T, Vanstone A, Love J, Holder H, Caravelli F, Kurebayashi H , Everschor-Sitte K et al (2024) Neuromorphic overparameterisation and few-shot learning in multilayer physical neural networks. Nature Communications, 15. View this article in WRRO Manneschi L, Vidamour IT, Stenning KD, Gartside JC, Swindells C, Venkat G, Griffin D, Stepney S, Branford WR, Hayward TJ , Ellis MO et al (2024) Optimising network interactions through device agnostic models.. CoRR, abs/2401.07387. Mehonic A, Frenkel C & Vasilaki E (2023) Editorial: Focus issue on energy-efficient neuromorphic devices, systems and algorithms.. Neuromorph. Comput. Eng., 3, 40201-40201. Mehonic A, Frenkel C & Vasilaki E (2023) Editorial: Focus issue on energy-efficient neuromorphic devices, systems and algorithms. Neuromorphic Computing and Engineering, 3(4). View this article in WRRO Vidamour IT, Swindells C, Venkat G, Manneschi L, Fry PW, Welbourne A, Rowan-Robinson RM, Backes D, Maccherozzi F, Dhesi SS , Vasilaki E et al (2023) Reconfigurable reservoir computing in a magnetic metamaterial. Communications Physics, 6(1). View this article in WRRO Ellis MOA, Welbourne A, Kyle SJ, Fry PW, Allwood DA, Hayward TJ & Vasilaki E (2023) Machine learning using magnetic stochastic synapses.. Neuromorph. Comput. Eng., 3, 21001-21001. Han C, English G, Saal HP, Indiveri G, Gilra A, von der Behrens W & Vasilaki E (2023) Modelling novelty detection in the thalamocortical loop. PLOS Computational Biology, 19(5). View this article in WRRO Manneschi L, Lin AC & Vasilaki E (2023) SpaRCe: Improved Learning of Reservoir Computing Systems Through Sparse Representations.. IEEE Trans. Neural Networks Learn. Syst., 34, 824-838. Allwood DA, Ellis MOA, Griffin D, Hayward TJ, Manneschi L, Musameh MFKH, O'Keefe S, Stepney S, Swindells C, Trefzer MA , Vasilaki E et al (2023) A perspective on physical reservoir computing with nanomagnetic devices. Applied Physics Letters, 122(4). View this article in WRRO Whelan MT, Jimenez-Rodriguez A, Prescott TJ & Vasilaki E (2023) A robotic model of hippocampal reverse replay for reinforcement learning. Bioinspiration & Biomimetics, 18(1). View this article in WRRO Vidamour I, Ellis MOA, Griffin D, Venkat G, Swindells C, Dawidek RWS, Broomhall TJ, Steinke N-J, Cooper J, Maccherozzi F , Dhesi S et al (2022) Quantifying the computational capability of a nanomagnetic reservoir computing platform with emergent magnetisation dynamics. Nanotechnology, 33(48). View this article in WRRO Manneschi L, Gigante G, Vasilaki E & Del Giudice P (2022) Signal neutrality, scalar property, and collapsing boundaries as consequences of a learned multi-timescale strategy. PLoS Computational Biology, 18(8). View this article in WRRO Vouros A, Gehring TV, Jura B, Węsierska MJ, Wójcik DK & Vasilaki E (2022) Strategies discovery in the active allothetic place avoidance task. Scientific Reports, 12. Gaurav A, Song X, Manhas S, Gilra A, Vasilaki E, Roy P & De Souza MM (2022) Reservoir computing for temporal data classification using a dynamic solid electrolyte ZnO thin film transistor. Frontiers in Electronics, 3. Ozdemir A, Scerri M, Barron AB, Philippides A, Mangan M, Vasilaki E & Manneschi L (2022) EchoVPR: Echo state networks for visual place recognition. IEEE Robotics and Automation Letters, 7(2), 4520-4527. View this article in WRRO Abdelrahman NY, Vasilaki E & Lin AC (2021) Compensatory variability in network parameters enhances memory performance in the Drosophila mushroom body. Proceedings of the National Academy of Sciences, 118(49). View this article in WRRO Vanattou-Saïfoudine N, Han C, Krause R, Vasilaki E, von der Behrens W & Indiveri G (2021) A robust model of stimulus-specific adaptation validated on neuromorphic hardware. Scientific Reports, 11(1). Ababei RV, Ellis MOA, Vidamour IT, Devadasan DS, Allwood DA, Vasilaki E & Hayward TJ (2021) Neuromorphic computation with a single magnetic domain wall. Scientific Reports, 11(1). View this article in WRRO Vouros A, Langdell S, Croucher M & Vasilaki E (2021) An empirical comparison between stochastic and deterministic centroid initialisation for K-Means variations. Machine Learning, 110(8), 1975-2003. View this article in WRRO Welbourne A, Levy ALR, Ellis MOA, Chen H, Thompson MJ, Vasilaki E, Allwood DA & Hayward TJ (2021) Voltage-controlled superparamagnetic ensembles for low-power reservoir computing. Applied Physics Letters, 118(20). View this article in WRRO Nizinska K, Szydlowska K, Vouros A, Kiryk A, Stepniak A, Vasilaki E & Lukasiuk K (2021) Behavioral characteristics as potential biomarkers of the development and phenotype of epilepsy in a rat model of temporal lobe epilepsy. Scientific Reports, 11. MaBouDi H, Barron AB, Li S, Honkanen M, Loukola OJ, Peng F, Li W, Marshall JAR, Cope A, Vasilaki E & Solvi C (2021) Non-numerical strategies used by bees to solve numerical cognition tasks. Proceedings of the Royal Society B: Biological Sciences, 288(1945). View this article in WRRO Dawidek RW, Hayward TJ, Vidamour IT, Broomhall TJ, Venkat G, Mamoori MA, Mullen A, Kyle SJ, Fry PW, Steinke N , Cooper JFK et al (2021) Dynamically‐driven emergence in a nanomagnetic system. Advanced Functional Materials, 31(15). View this article in WRRO Vouros A & Vasilaki E (2021) A semi-supervised sparse K-Means algorithm. Pattern Recognition Letters, 142, 65-71. Manneschi L, Ellis MOA, Gigante G, Lin AC, Giudice PD & Vasilaki E (2020) Exploiting Multiple Timescales in Hierarchical Echo State Networks.. Frontiers Appl. Math. Stat., 6, 616658-616658. Manneschi L & Vasilaki E (2020) An alternative to backpropagation through time. Nature Machine Intelligence, 2(3), 155-156. Huzard D, Vouros A, Monari S, Astori S, Vasilaki E & Sandi C (2020) Constitutive differences in glucocorticoid responsiveness are related to divergent spatial information processing abilities. Stress, 23(1), 37-49. View this article in WRRO Mehonic A, Sebastian A, Rajendran B, Simeone O, Vasilaki E & Kenyon AJ (2020) Memristors - From In-Memory Computing, Deep Learning Acceleration, and Spiking Neural Networks to the Future of Neuromorphic and Bio-Inspired Computing.. Adv. Intell. Syst., 2, 2000085-2000085. Chhabria K, Vouros A, Gray C, MacDonald RB, Jiang Z, Wilkinson RN, Plant K, Vasilaki E, Howarth C & Chico TJA (2019) Sodium nitroprusside prevents the detrimental effects of glucose on the neurovascular unit and behaviour in zebrafish. Disease Models and Mechanisms, 12(9). View this article in WRRO Vouros A, Gehring TV, Szydlowska K, Janusz A, Tu Z, Croucher M, Lukasiuk K, Konopka W, Sandi C & Vasilaki E (2018) A generalised framework for detailed classification of swimming paths inside the Morris Water Maze. Scientific Reports, 8. View this article in WRRO Cope AJ, Vasilaki E, Minors D, Sabo C, Marshall JAR & Barron AB (2018) Abstract concept learning in a simple neural network inspired by the insect brain. PLoS Computational Biology, 14(9). View this article in WRRO Gehring TV, Wesierska MJ, Wójcik DK & Vasilaki E (2017) Analysis of behaviour in the Active Allothetic Place Avoidance task based on cluster analysis of the rat movement motifs. Cope AJ, Sabo C, Vasilaki E, Barron AB & Marshall JA (2017) A computational model of the integration of landmarks and motion in the insect central complex.. PLoS One, 12(2). View this article in WRRO Cope AJ, Sabo C, Gurney K, Vasilaki E & Marshall JAR (2016) A Model for an Angular Velocity-Tuned Motion Detector Accounting for Deviations in the Corridor-Centering Response of the Bee. PLoS Comput Biol, 12(5). View this article in WRRO Berdan R, Vasilaki E, Khiat A, Indiveri G, Serb A & Prodromakis P (2016) Emulating short-term synaptic dynamics with memristive devices. Scientific Reports, 6(-), ---. Barron AB, Gurney KN, Meah LFS, Vasilaki E & Marshall JAR (2015) Decision-making and action selection in insects: inspiration from vertebrate-based theories. Frontiers in Behavioral Neuroscience, 9. View this article in WRRO Esposito U, Giugliano M & Vasilaki E (2015) Adaptation of short-term plasticity parameters via error-driven learning may explain the correlation between act",
  "content_length": 29231,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:42"
}