{
  "name": "Elfar Adalsteinsson",
  "homepage": "http://www.rle.mit.edu/adalsteinsson",
  "status": "success",
  "content": "Elfar Adalsteinsson - RLE at MIT Elfar Adalsteinsson Professor of Electrical Engineering, Electrical Engineering and Computer Science (EECS)Professor of Health Sciences and Technology, Harvard-MIT Division of Health Sciences and Technology77 Massachusetts AvenueRoom 36-732Cambridge, MA 02139elfar@mit.edu617.324.3597Administrative AssistantMegumi Masuda-LoosRoom 36-776617.324.3542megumima@mit.edu Professor Elfar Adalsteinsson is a principal investigator in the Research Laboratory of Electronics (RLE) at the Massachusetts Institute of Technology (MIT). Professor Adalsteinsson conducts research on medical imaging with magnetic resonance, focusing on optimal methods for acquisition, reconstruction and processing of in vivo imaging data. His interests include techniques for efficient sampling and spatial encoding of spectroscopic magnetic resonance data, whereby small signals, originating, for example, specifically from neurons in the brain, yield information not observed with conventional structural imaging. Applications of these and related methods include a study of the progression of Alzheimer’s disease and characterization of Multiple Sclerosis. Professor Adalsteinsson received a B.S. in 1989 from the University of Iceland, Reykjavik, and the M.S. and Ph.D. degrees in Electrical Engineering in 1991 and 1995, respectively, from Stanford University. From 1995 until his arrival in RLE, Elfar was with the Lucas Center at Stanford. Keywordsmedical imaging, magnetic resonance imaging, neuro-imaging, data sampling and special encoding, low level signals, neuroscience, chemical shift imaging, Alzheimer's disease, multiple sclerosis Group WebsitesMagnetic Resonance Imaging GroupMadrid-MIT M+Vision Consortium Related News Links01.22.2016Adalsteinsson to be inducted into Medical and Biological Engineering Elite09.28.2015New portable device counts leukocytes through the skin06.03.2015Ultrasound and algorithms to diagnose bacterial meningitis in babies03.19.2015EECS Faculty Promotions for Adalsteinsson, Daniel, and Kong08.01.2013Research points toward better colonoscopy06.05.2012Madrid-MIT Consortium holds international conference in Madrid11.15.2011Madrid-MIT M+Vision Consortium convenes inaugural Boston open house11.01.2011New algorithm could substantially speed up MRI scans04.25.2011M+Vision announces Fellowship finalists Related News Articles01.22.2016Adalsteinsson to be inducted into Medical and Biological Engineering Elite12.01.2014M+Visión Consortium wins Spanish industry association prize02.03.2011MIT and Government of Madrid launch M+Visión Consortium to accelerate biomedical imaging innovation05.07.2008Four Faculty in RLE to be Promoted09.01.2004New MIT Faculty Join RLE",
  "content_length": 2715,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:43"
}