{
  "name": "Eliane Martins",
  "homepage": "http://www.ic.unicamp.br/~eliane",
  "status": "success",
  "content": "Eliane Martins Eliane Martins Docteur, École Nationale Supérieure de l'Áeronautique et de l'Espace e Laboratoire d'Automatique et d'Analyse des Systèmes, França, 1992 E-mail: eliane_at_ic.unicamp.br Address: Institute of Computing (IC) State University of Campinas (UNICAMP) P.O. Box 6176 13081-970 Campinas, SP -- BRAZIL Phones: +55 (19) 788-5872 +55 (19) 788-5847(FAX) Áreas de Interesse/Research Interests: Engenharia de Software / Software Engineering Injeção de Falhas / Fault Injection Testes de Robustez / RobustnessTesting Testes baseados em modelos / Model-based Testing Testes de sistemas embarcados / Embedded Systems Testing Uso de Computação Bio-Inspirada em testes de software / Using Bio-inspired Computing in Software Testing Ensino/Teaching Activities Professor Associado, atuando na graduação, pós-graduação e extensão do IC-Unicamp. / Associate Professor, teaching undergraduate, graduate and continuing education courses at IC-Unicamp. 2. Semestre 2012: MC4*6 Eventos/Upcoming Events 6th Latin-American Symposium on Dependable Computing (LADC'2013) Projetos/Projects Para informações sobre projetos passados, clique aqui / For past projects, click here. Projetos correntes / On-going Projects: RobustWeb - Menon@WS  Metodologias para o Desenvolvimento de Web Services não Vulneráveis Projeto com a Universidade de Coimbra Projetos de Pequisa 2012-2013 Se voce procura projetos de Iniciação Científica / Mestrado / Doutorado nas áreas de: - testes de sistemas automotivos, - uso de algoritmos de bio-informática em teste, - uso de algoritmos baseados em Teoria da Evolução em testes ... ... me procure. Possibilidade de bolsa. Oportunidade de aplicar os conceitos nos testes em sistemas reais, produzidos para montadora sediada no Brasil. Publicações / Publications Ferramentas / Tools JACA Apontadores favoritos/Favorite Links Outras Atividades/Other Activities Canto Coral/Choral Music Last updated on October, 2010.",
  "content_length": 1938,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:45"
}