{
  "name": "Elias Bou-Harb",
  "homepage": "https://www.lsu.edu/eng/cse/people/faculty/bou-harb.php",
  "status": "success",
  "content": "Elias Bou-Harb | Computer Science & Engineering Skip to main content Elias Bou-Harb Associate Professor Contact ebouharb@lsu.eduOffice 3272QPatrick F. Taylor Hall Educational Background Postdoctoral Training in empirical cyber security, Carnegie Mellon University (CMU), USA. Ph.D. in Computer Science, Concordia University, Canada. MASc. in Information Systems Security, Concordia University, Canada. BASc. in Computer Science, Notre Dame University, Lebanon. Visit Website CSC 2362: Intro to Cybersecurity and Defense CSC 4501: Computer Networks Operational cyber security Cyber forensics Critical infrastructure security Empirical Data analytics, Digital investigation Network Security Network Management Manuel, D., Islam, N. T., Khoury, J., Nunez, A., Bou-Harb, E., & Najafirad, P. (2024). Enhancing Reverse Engineering: Investigating and Benchmarking Large Language Models for Vulnerability Analysis in Decompiled Binaries. arXiv preprint arXiv:2411.04981. AlSabeh, A., Friday, K., Kfoury, E., Crichigno, J., & Bou-Harb, E. (2024). On dga detection and classification using p4 programmable switches. Computers & Security, 145, 104007. Torabi, S., Klisura, D., Khoury, J., Bou-Harb, E., Assi, C., & Debbabi, M. (2024). Internet-Wide Analysis, Characterization, and Family Attribution of IoT Malware: A Comprehensive Longitudinal Study. IEEE Transactions on Dependable and Secure Computing. Islam, N. T., Khoury, J., Seong, A., Bou-Harb, E., & Najafirad, P. (2024). Enhancing Source Code Security with LLMs: Demystifying The Challenges and Generating Reliable Repairs. arXiv preprint arXiv:2409.00571. Friday, K., & Bou-Harb, E. (2024, August). Accelerating Ransomware Defenses with Computational Storage Drive-Based API Call Sequence Classification. In Proceedings of the 17th Cyber Security Experimentation and Test Workshop (pp. 8-16). Gharaibeh, T., Seiden, S., Abouelsaoud, M., Bou-Harb, E., & Baggili, I. (2024, July). Don't, Stop, Drop, Pause: Forensics of CONtainer CheckPOINTs (ConPoint). In Proceedings of the 19th International Conference on Availability, Reliability and Security (pp. 1-11). Tieby, N., Khoury, J., & Bou-Harb, E. (2024, June). Characterizing and analyzing leo satellite cyber landscape: A starlink case study. In ICC 2024-IEEE International Conference on Communications (pp. 1352-1357). IEEE. Khoury, J., Nader, C., Pour, M. S., & Bou-Harb, E. (2024). An Internet-Scale Data-Driven Approach for Exploring Cyber Threats Amid Global Conflicts. IEEE Internet of Things Magazine. Friday, K., Bou-Harb, E., Lee, R., Peethambaran, P., & Saxena, M. (2024, June). Empowering Data Centers with Computational Storage Drive-Based Deep Learning Inference Functionality to Combat Ransomware. In 2024 54th Annual IEEE/IFIP International Conference on Dependable Systems and Networks-Supplemental Volume (DSN-S) (pp. 125-132). IEEE. Khoury, J., Nader, C., Pour, M. S., & Bou-Harb, E. (2024, June). Exploring Internet-Scale Data-Driven Intelligence: Empirical Analysis of the Russo-Ukrainian Conflict. In 2024 IEEE International Conference on Communications Workshops (ICC Workshops) (pp. 896-901). IEEE. 2024: UT System-wide Distinguished Research Award, Texas 2023: University-wide Service Award for Center Leadership, UTSA 2021/2022: Sole Recipient of All UTSA’s Faculty Research Award 2020: Named the Recipient of UTSA College of Business Col. Jean Piccione and Lt. Col. Philip Piccione Endowed Faculty Award for Research Excellence 2020: Elevated to IEEE Senior Member 2019: Sole Recipient of the Junior, Faculty-wide, Research Award, FAU 2015-2023: Six Best Conference Research Paper Awards 2016: Natural Sciences and Engineering Research Council of Canada (NSERC) Postdoctoral Fellowship (PDF): Top .5% of all Canadian Computer Science Ph.D. Students 2015: Fonds de recherche du Québec - Fellowship, Ranked 1st in the province of Quebec 2024: Source: National Science Foundation (NSF), Title: Collaborative Research: CISE MSI: RPEP: OAC: Macroscopic and Microscopic Inference and Analysis of Vulnerabilities within EV Charging-Management Systems, PI: Elias Bou-Harb, $369,998. 2024: Source: National Science Foundation (NSF), Title: OAC Core: Enhancing Network Security by Implementing an ML Malware Detection and Classification Scheme in P4 Programmable Data Planes and SmartNICs, Co-PI: Elias Bou-Harb, $599,999. 2023: Source: National Science Foundation (NSF), Title: Collaborative Research: CyberTraining: Implementation: Medium: Cross-Disciplinary Training for Joint Cyber-Physical Systems and IoT Security, PI: Elias Bou-Harb, $383,953. 2023: Source: National Science Foundation (NSF), Title: OAC Core: Data-driven Methods and Techniques For Protecting Research and Critical Cyberinfrastructure By Characterizing and Defending Against Ransomware, PI: Elias Bou-Harb, $481,693. 2023: Source: National Science Foundation (NSF), Title: Collaborative Research: CyberTraining: Implementation: Medium: Cross-Disciplinary Training for Joint Cyber-Physical Systems and IoT Security, PI: Elias Bou-Harb, $399,493. 2021: Source: National Science Foundation (NSF), Title: OAC Core: Data-driven Methods and Techniques For Protecting Research and Critical Cyberinfrastructure By Characterizing and Defending Against Ransomware, PI: Elias Bou-Harb, $500,000. 2019: Source: National Science Foundation (NSF), Title: CRII: OAC: Inferring, Attributing, Mitigating and Analyzing the Malicious Orchestration of Internet-scale Exploited IoT Devices: A Network Telescope Approach, PI: Elias Bou-Harb, $111,831. 2019: Source: National Science Foundation (NSF), Title: OAC Core: Small: Devising Data-driven Methodologies by Employing Large-scale Empirical Data to Fingerprint, Attribute, Remediate and Analyze Internet-scale IoT Maliciousness, PI: Elias Bou-Harb, $496,898. 2018: Source: National Science Foundation (NSF), Title: CRII: OAC: Inferring, Attributing, Mitigating and Analyzing the Malicious Orchestration of Internet-scale Exploited IoT Devices: A Network Telescope Approach, PI: Elias Bou-Harb, $175,000. Top This website uses cookies to ensure site visitors get the best experience on our website. By continuing to use this site, you accept our use of cookies and Privacy Statement. To learn more, please visit LSU Privacy Statement. I agree. Search Search Search POPULAR SEARCHES: MajorsAcademic CalendarIs the Dining Hall Food Good? FootballThings to Do on CampusHow Much is Tuition? × Video Modal ©",
  "content_length": 6423,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:47"
}