{
  "name": "Elias Koutsoupias",
  "homepage": "https://www.cs.ox.ac.uk/people/elias.koutsoupias",
  "status": "success",
  "content": "Elias Koutsoupias | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyElias KoutsoupiasElias Koutsoupias Professor Elias Koutsoupias Professor of Computer ScienceFellow, St Anne's CollegeE: elias@cs.ox.ac.ukT: +44 (0)1865 610738 Room 363, Wolfson Building, Parks Road, Oxford OX1 3QD United Kingdom Themes:Algorithms and Complexity TheoryCompleted Projects:ALGAMEInterestsMy research interests include algorithmic aspects of game theory, economics and networks, online algorithms, decision-making under uncertainty, distributed algorithms, design and analysis of algorithms, computational complexity. My profile in Google Scholar and DBLP.BiographyElias Koutsoupias is a professor of computer science at the University of Oxford. His research interests include algorithmic aspects of game theory, economics and networks, online algorithms, decision-making under uncertainty, design and analysis of algorithms, computational complexity. He received the Gödel Prize of theoretical computer science in 2012 for his work on the price of anarchy, in reference to laying the foundations of algorithmic game theory. He is also the recipient of the ERC Advanced Grant “Algorithms, Games, Mechanisms, and the Price of Anarchy”. He previously held faculty positions at the University of California, Los Angeles (UCLA) and the University of Athens. He studied at the National Technical University of Athens (B.S. in electrical engineering) and the University of California, San Diego (Ph.D. in computer science). http://www.cs.ox.ac.uk/people/elias.koutsoupias/Personal/See alsoPersonal web pageSelected PublicationsView AllManage publications Worst−case equilibria Elias Koutsoupias and Christos H. Papadimitriou In Computer Science Review. Vol. 3. No. 2. Pages 65−69. 2009. Details about Worst−case equilibria | BibTeX data for Worst−case equilibria The k−server problem Elias Koutsoupias In Computer Science Review. Vol. 3. No. 2. Pages 105−118. 2009. Details about The k−server problem | BibTeX data for The k−server problem ActivitiesOnline AlgorithmsFoundational Issues in Computational LearningAlgorithms At LargeAlgorithmic Game Theory and Computational Economics Current Student Matan Gilboa Past Students Matthias GerstgrasserAlexandros HollenderPhilip LazosJoao Sousa PintoAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 2570,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:46"
}