{
  "name": "Eliane Stampfer Wiese",
  "homepage": "https://eliane-s-wiese.owlstown.net",
  "status": "success",
  "content": "Code in Context Prof. Eliane S. Wiese Lab Director Curriculum vitae [email protected] Kahlert School of Computing University of Utah Office: 3264 Merrill Engineering Building (MEB) Prof. Eliane S. Wiese Lab Director Contact Prof. Eliane S. Wiese Lab Director Curriculum vitae [email protected] Kahlert School of Computing University of Utah Office: 3264 Merrill Engineering Building (MEB) The Code in Context Lab We study computer science education. Specifically, how to bring human-centered perspectives into technical contexts, and how to help students consider the human contexts their code will operate in. Our current projects focus on teaching and learning in undergraduate courses. Publications The Shortest Path to Ethics in AI: An Integrated Assignment Where Human Concerns Guide Technical Decisions Noelle Brown, Koriann South, Eliane S. Wiese ICER '22, Proceedings of the 2022 ACM Conference on International Computing Education Research - Volume 1, pp. 344–355 Teaching Ethics in Computing: A Systematic Literature Review of ACM Computer Science Education Publications Noelle Brown, Benjamin Xie, Ella Sarder, Casey Fiesler, Eliane S. Wiese ACM Transactions on Computing Education, vol. 24(1), 2024, pp. 1-36 Students’ Self-Evaluations of Contextual Inquiry Techniques Noelle Brown, Nidhi Patel, Xavier Davis, Eliane S. Wiese EduCHI '23, Proceedings of the 5th Annual Symposium on HCI Education, Association for Computing Machinery, New York, NY, USA, 2023, pp. 96–100 Designing Ethically-Integrated Assignments: It’s Harder Than it Looks Noelle Brown, Koriann South, Suresh Venkatasubramanian, Eliane S. Wiese ICER '23, Proceedings of the 2023 ACM Conference on International Computing Education Research - Volume 1, Association for Computing Machinery, New York, NY, USA, 2023, pp. 177–190 Building “Design Empathy” for People with Disabilities: an Unsolved Challenge in HCI Education Tamanna Motahar, Noelle Brown, Eliane Stampfer Wiese, Jason Wiese EduCHI '23, Proceedings of the 5th Annual Symposium on HCI Education, Association for Computing Machinery, New York, NY, USA, 2023, pp. 68–71 View all Share Text Only Translate Owlstown Tools Translate to Abkhaz Acehnese Acholi Afar Afrikaans Albanian Alur Amharic Arabic Armenian Assamese Avar Awadhi Aymara Azerbaijani Balinese Baluchi Bambara Baoulé Bashkir Basque Batak Karo Batak Simalungun Batak Toba Belarusian Bemba Bengali Betawi Bhojpuri Bikol Bosnian Breton Bulgarian Buryat Cantonese Catalan Cebuano Chamorro Chechen Chichewa Chinese (Simplified) Chinese (Traditional) Chuukese Chuvash Corsican Crimean Tatar (Cyrillic) Crimean Tatar (Latin) Croatian Czech Danish Dari Dhivehi Dinka Dogri Dombe Dutch Dyula Dzongkha English Esperanto Estonian Ewe Faroese Fijian Filipino Finnish Fon French French (Canada) Frisian Friulian Fulani Ga Galician Georgian German Greek Guarani Gujarati Haitian Creole Hakha Chin Hausa Hawaiian Hebrew Hiligaynon Hindi Hmong Hungarian Hunsrik Iban Icelandic Igbo Ilocano Indonesian Inuktut (Latin) Inuktut (Syllabics) Irish Italian Jamaican Patois Japanese Javanese Jingpo Kalaallisut Kannada Kanuri Kapampangan Kazakh Khasi Khmer Kiga Kikongo Kinyarwanda Kituba Kokborok Komi Konkani Korean Krio Kurdish (Kurmanji) Kurdish (Sorani) Kyrgyz Lao Latgalian Latin Latvian Ligurian Limburgish Lingala Lithuanian Lombard Luganda Luo Luxembourgish Macedonian Madurese Maithili Makassar Malagasy Malay Malay (Jawi) Malayalam Maltese Mam Manx Maori Marathi Marshallese Marwadi Mauritian Creole Meadow Mari Meiteilon (Manipuri) Minang Mizo Mongolian Myanmar (Burmese) Nahuatl (Eastern Huasteca) Ndau Ndebele (South) Nepalbhasa (Newari) Nepali NKo Norwegian Nuer Occitan Odia (Oriya) Oromo Ossetian Pangasinan Papiamento Pashto Persian Polish Portuguese (Brazil) Portuguese (Portugal) Punjabi (Gurmukhi) Punjabi (Shahmukhi) Quechua Qʼeqchiʼ Romani Romanian Rundi Russian Sami (North) Samoan Sango Sanskrit Santali (Latin) Santali (Ol Chiki) Scots Gaelic Sepedi Serbian Sesotho Seychellois Creole Shan Shona Sicilian Silesian Sindhi Sinhala Slovak Slovenian Somali Spanish Sundanese Susu Swahili Swati Swedish Tahitian Tajik Tamazight Tamazight (Tifinagh) Tamil Tatar Telugu Tetum Thai Tibetan Tigrinya Tiv Tok Pisin Tongan Tshiluba Tsonga Tswana Tulu Tumbuka Turkish Turkmen Tuvan Twi Udmurt Ukrainian Urdu Uyghur Uzbek Venda Venetian Vietnamese Waray Welsh Wolof Xhosa Yakut Yiddish Yoruba Yucatec Maya Zapotec Zulu Hello",
  "content_length": 4415,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:45"
}