{
  "name": "Elisa Rubegni",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/elisa-rubegni",
  "status": "success",
  "content": "Elisa Rubegni - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Dr Elisa Rubegni Senior Lecturer Research Overview My research lies within the field of Human-Computer Interaction (HCI). I explore the socio-technical issues emerging from the use of interactive technology with the aim of understanding the complex interplay of artefacts, human mind, body, and environment. To meet this complexity, my approach combines psychology theories, social science methods and design practice, concretized in developing digital artefacts. My research is grounded on cultural psychology. and I investigate these issues by recognizing that a successful system can only be developed by fully understanding the fundamental role played by social interactions in the development of cognition, and in the process of \"meaning making\". Indeed, my research relies on an ecological approach valuing participatory design methods, qualitative and ethnographically informed investigations. I have explored these issues in a broad range of application areas and technologies (e.g. embedded and distributed systems in museums, tangible and gesture user interface in public spaces, large pervasive displays for communities and mobile technology for learning). Show more… Research Interests Within the HCI field I am an expert in Children-Computer Interaction (CCI). Specifically, I tackle questions about how to design and assess interactive technology that lead children to better develop narrative thinking, language, communication, personal and cognitive skills (i.e. creativity, social behaviour, and gender identity). My research aims at: 1) Advancing the understanding on the impact of digital technology on children for improving Equality, Diversity, and Inclusion, 2) Identifying new methods to better include stakeholders within the process and uncover the socio-technical implications of their usage in the context, 3) Investigating the design space by developing concepts and prototypes within the context. PhD Supervisions Completed Grace Ataguba, 2019, University of Lincoln, School of Computer Science, minor changes External Roles Norwegian University of Science and Technology, Trondheim, Norway, MSc Exteranl examiner PhD Supervision Interests HCI, Interaction Design and Children, Design thinking, User experience research, technology in education , digital storytelling Show less Publications Projects Activities PhD Students Research Groups XR for Youth Ethics Consortium 01/07/2025 → 31/12/2026 Research Blended education for STEM teaching 01/01/2025 → 01/01/2027 Research DSI: BEST: Blended Education for STEM Teaching 01/12/2024 → 30/11/2026 Research CARE Kids 01/09/2024 → 31/10/2024 Research DSI: EmpowerKids: Cultivating Critical AI Literacy for Gender Equity 01/08/2024 → 30/04/2025 Research Rapid and Economical Prototype dupLICATion for Electronics 02/01/2023 → 31/12/2024 Research European Network For Gender Balance in Informatics 19/10/2020 → 18/10/2024 Research Spring-a-story Lancashire 01/01/2020 → 31/03/2020 Research British Journal of Educational Technology (Journal) Editorial activity ACM Interaction Design and Children (IDC) (Event) Editorial activity Carolina Rutta Hosting a Student (PhD) NTNU, Norway Visiting an external academic institution ACM (Publisher) Publication peer-review International Journal of Child-Computer Interaction (Journal) Editorial activity Best paper award for: Responding to Generative AI Technologies with Research-through-Design: The Ryelands AI Lab as an Exploratory Study Other distinction Gail Collyer-Hoar PhD student, Associate Lecturer enable JavaScript to view email address Molly O'Reilly-Kime MBCS PhD student, Associate Lecturer enable JavaScript to view email address Education (SCC) Lancaster Intelligent, Robotic and Autonomous Systems Centre LIRA - Society and Human Behaviour Morecambe Bay Curriculum SCC (Pervasive Systems) Back to listing Contact Details Department: Computing and Communications TelTelephone: enable JavaScript to view email address Back to listing",
  "content_length": 4279,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:48"
}