{
  "name": "Elisa D. Mekler",
  "homepage": "https://pure.itu.dk/portal/da/persons/elisa-daphne-zahava-mekler",
  "status": "success",
  "content": "Elisa Mekler - IT-Universitetet i København Elisa Mekler Lektor, Play, Culture, and AI https://orcid.org/0000-0003-0076-6703 E-mailelmeitudk 20172024 Publikationer pr. år Personlig profil ForskningsområdeI research motivational and emotional aspects of the User Experience and Games to establish a better understanding of \"good\" Human-Computer-Interaction (HCI). I'm also interested in how we do research and construe knowledge in HCI. I was recently awarded an ERC StG (2022 - 2027) to investigate the use of psychological theories in game design and production practice, and develop methods for how HCI can more productively translate theories from other disciplines into actionable knowledge for research and practice. EmneordAesthetics of Interactionaffect/emotionsComputer GamesDesign TheoryGame designHCI: human-computer interactionRetrogamingTransgressive aestheticVideo gamesTheory translation Fingeraftryk Dyk ned i forskningsemnerne, hvor Elisa Mekler er aktive. Disse emneetiketter kommer fra dennes persons arbejder. Sammen danner de et unikt fingerprint. 5 Lignende profiler Human Computer Interaction Computer Science 100% Video Games Keyphrases 71% Game Research Keyphrases 66% Player Experience Keyphrases 62% Game Elements Keyphrases 57% Determination Theory Computer Science 57% Human-Computer Interaction Computer Science 57% Design Framework Computer Science 57% Se fuldt fingerprint Samarbejde og topforskningsområder i de sidste fem år Seneste eksterne samarbejde på lande-/områdeniveau. Dyk ned i detaljerne ved at klikke på prikkerne eller Vælg et land/område fra listen Dyk ned i detaljerne Vælg et land/område for at vise delte publikationer og projekter Luk Vælg et land/område fra listen Udforsk netværk yderligere Publikation Publikationer pr. år 2017 2023 2024 2024 18 Konferencebidrag i proceedings 8 Tidsskriftartikel 1 Konferenceabstrakt i proceedings Publikationer pr. år Publikationer pr. år A Design Framework for Reflective PlayMiller, J. A., Gandhi, K., Whitby, M., Kosa, M., Cooper, S., Mekler, E. & Iacovides, I., 11 maj 2024, CHI '24: Proceedings of the CHI Conference on Human Factors in Computing Systems. 21 s.Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgangFil Interactive Systems 100% Game Elements 100% Practical Implementation 100% Design Framework 100% Takeaway 100% Beyond Intrinsic Motivation: The Role of Autonomous Motivation in User ExperienceBennett, D. & Mekler, E., 2024, I: ACM Transactions on Computer-Human Interaction. 31, 5, 41 s.Publikation: Artikel i tidsskrift og konference artikel i tidsskrift › Tidsskriftartikel › Forskning › peer review Åben adgang User Experience 100% Determination Theory 100% Autonomous Motivation 100% Human Computer Interaction 50% Fundamental Concept 50% Five CHI PLAY Papers I Like: On Championing Published Work That Has MeritMekler, E., 14 okt. 2024, CHI PLAY Companion '24: Companion Proceedings of the 2024 Annual Symposium on Computer-Human Interaction in Play. s. 279-281 3 s.Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgang Champions 100% HCI Program 50% From Disorientation to Harmony: Autoethnographic Insights into Transformative Videogame ExperiencesVäkevä, J., Mekler, E. & Lindqvist, J., 11 maj 2024, CHI '24: Proceedings of the CHI Conference on Human Factors in Computing Systems. s. 1-20 20 s. 808Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgang Video Games 100% Autoethnography 100% Disorientation 100% Entertainment 20% Player Experience 20% How to write a CHI paper (asking for a friend)Robinson, R., Alvarez, A. & Mekler, E., 11 maj 2024, CHI EA '24: Extended Abstracts of the 2024 CHI Conference on Human Factors in Computing Systems. 8 s.Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgangFil Writing Conventions 100% How to Write 100% genre conventions 100% Academic Writing 100% Artificial Intelligence 100% Se alle 27 publikationer Projekter Projekter pr. år 2022 2022 2024 2027 2 Igangværende Projekter pr. år RAGE: Rethinking Affective Game EpistemologiesMekler, E. (PI) & Robinson, R. (CoI)European Commission01/05/2024 → 30/04/2026Projekter: Projekt › Forskning Human-Computer Interaction 100% Affective Games 66% Epistemology 66% Affective Gaming 66% Interaction Design 66% Theorycraft: Bridging the Games Research-Practice Gap through Theory TranslationMekler, E. (PI), Vornhagen, J. B. (CoI), Piitulainen, R. (CoI), Bennett, D. (CoI), Feng, F. (CoI), Robinson, R. (CoI), Wegmann, D. J. (CoI), Elvig, M. L. (Samarbejdspartner) & Murphy, D. J. (Samarbejdspartner)European Commission01/09/2022 → 31/08/2027Projekter: Projekt › Forskning Human Computer Interaction 100% Game Research 75% Human-computer Interaction 55% Research-practice Gap 50% Theory Translation 50% Priser Honorable Mention CHIMekler, E. D. Z. (Modtager), 2021Pris: Priser, stipendier, udnævnelser Honorable Mention CHIMekler, E. D. Z. (Modtager), 2020Pris: Priser, stipendier, udnævnelser Best Paper CHI PLAYMekler, E. D. Z. (Modtager), 2020Pris: Priser, stipendier, udnævnelser Best Paper CHIMekler, E. D. Z. (Modtager), 2019Pris: Priser, stipendier, udnævnelser Best Paper CHI PLAYMekler, E. D. Z. (Modtager), 2018Pris: Priser, stipendier, udnævnelser Se alle 16 priser",
  "content_length": 5532,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:51"
}