{
  "name": "Elisabeth André",
  "homepage": "https://www.uni-augsburg.de/de/fakultaet/fai/informatik/prof/hcm/team/andre",
  "status": "success",
  "content": "Prof. Dr. Elisabeth André Lehrstuhl für Menschzentrierte Künstliche Intelligenz Universität Fakultäten Fakultät für Angewandte Informatik Institut für Informatik Lehrstühle und Professuren der Informatik Menschzentrierte Künstliche Intelligenz Team Prof. Dr. Elisabeth André Prof. Dr. Elisabeth André Lehrstuhlinhaberin Lehrstuhl für Menschzentrierte Künstliche Intelligenz Telefon: +49 821 598 - 2340 Fax: +49 821 598 - 2349 E-Mail: andre@informatik.uni-augsburginformatik.uni-augsburg.de () Raum: 2035 (N) Adresse: Universitätsstraße 6a, 86159 Augsburg Kontakt (.vcf) Sekretariat: Claudia Dreyer Telefon: +49 821 598-2341 E-Mail: claudia.dreyer@informatik.uni-augsburg.de Hinweise zu Sprechstunden: Bitte vereinbaren Sie einen Termin per E-Mail. Forschungsschwerpunkte Multimodal User Interfaces Multimodal Analysis (physiological data, gaze, speech, gestures) Affective Computing & Social Signal Processing Social Robotics & Embodied Conversational Agents Technology-Enhanced Learning Tangible and Perceptive User Interfaces Current Activities General (Co-)Chair of International Conference on Multimodal Interfaces 2023 (ICMI) Platform Learning Systems (Germany's Platform for Artificial Intelligence), Co-Leader of Working Group (Work/Qualification, Human-Computer-Interaction) Scientific Career 1988 Diploma in Computer Science at Department of Computer Science at Saarland University, Title of Diploma Thesis: Generierung natürlichsprachlicher Äußerungen zur simultanen Beschreibung von zeitveränderlichen Szenen: Das System SOCCER (Generation of natural language utterances for the simultaneous description of time varying scenes: The System SOCCER) 1988-2001 Scientific Researcher at DFKI GmbH (German Research Center for Artificial Intelligence) 1995 Dr. rer. Nat. at Department of Computer Science at Saarland University, Title of Thesis: Ein planbasierter Ansatz zur Generierung multimedialer Präsentationen (A plan-based approach for the generation of multimedia presentations) 1995 Promoted to Senior Researcher 1999 Appointed DFKI Research Fellow 1999 Promoted to Principal Researcher 2000 Call to C4-Professorship from Augsburg University 2001- Full Professor of Computer Science, Chair of Human-Centered Multimedia at Augsburg University 2004-2006 Managing Director of Institute for Computer Science at Augsburg University 2009 Call to W3-Professorship in Mensch-Maschine Interaktion (Human-Machine Interaction) from Otto-Friedrich-Universität Bamberg 2009 Call to W3-Professorship in Mensch-Computer-Interaktion und Kognitive Systeme (Human-Computer Interaction and Cognitive Systems) from University of Stuttgart Awards and Honors 2020 Awarded with the Gottfried Wilhelm Leibniz Prize 2021 of the German Research Foundation 2021 ICMI Sustained Accomplishment Award 2019 Named one of ten most influential figures in the history of AI in Germany by the National Society for Informatics - GI, (von der Gesellschaft für Informatik ausgewählt als einer der \"Zehn prägenden Köpfe der deutschen KI-Geschichte\") 2019 French finance newspaper Les Echos names Prof. André work on the automated synthesis of natural language description for image sequences in the article “ Quand les machines apprennent à écrire” one out of eight milestones in the history of natural language generation 2017 Elected Member of the CHI Academy 2014 Enseignante invitée auprès de l’université Paris Sud (Invited Professorship) 2013 Elected ECCAI Fellow (European Coordinating Committee for Artificial Intelligence) 2010 Elected Member of German Academy of Sciences Leopoldina 2010 Elected Member of Academy of Europe (Academia Europaea) 2010 Elected Member of AcademiaNet 2007 Alcatel-Lucent Fellowship, Internationales Zentrum für Kultur- und Technikforschung der Universität Stuttgart (IZKT), combined with a grant of 25.000 € 1998 RoboCup Scientific Award 1996 Research Fellowship (Stanford Research Institute – SRI) 1995 European IT Prize Winner Awards at Scientific Conferences 2022 for “Flow with the Beat! Human-Centered Design of Virtual Environments for Musical Creativity Support in VR”. Creativity & Cognition 2022: 428-442 2022 for “Jamming in MR: Towards Real-Time Music Collaboration in Mixed Reality”. VR Workshops 2022: 854-855 2022 of all PETRA Workshops for “We've never been eye to eye: A Pupillometry Pipeline for the Detection of Stress and Negative Affect in Remote Working Scenarios”. PETRA 2022: 486-493 2020 Best Technical Paper Award at 2020 DELTA, 1st International Conference on Deep LearningTheory and Applications, July 8 -10 2020, Online Virtual Conference 2020 Nominated for Best Paper Award at AAMAS 2020 (International Conference on Autonomous Agents and Multi-Agent Systems) 9.5. – 13.5.2020, Auckland, NZ 2019 Best Technical Paper Award at 8th International Conference on Affective Computing and Intelligent Interaction, 3.9. - 6.9.2019, Cambridge, UK 2019 Best Technical Paper Award at 2019 PErvasive Technologies Related to Assistive Environments (PETRA) conference 2019 Best Poster Award at 2019 PErvasive Technologies Related to Assistive Environments (PETRA) conference 2019 2nd Poster Award 11th Workshop Congress and 37th Symposium of the German Society for Psychology 2018 IJSA Highest Cited Paper 2018: “Dear Computer, Teach Me Manners: Testing Virtual Employment Interview Training” awarded by the International Journal of Selection and Assessment. 2018 Nominated for two Best Paper Awards at 2018 ACM International Conference on Multimodal Interfaces (ICMI) 2018 Best Student Paper Award at Digital Health 2018 2017 Nominated for Best Late Breaking report at the International Conference on Human-Robot Interaction (HRI) 2015 Best Paper Award at the International Conference on Culture and Computing 2015 2013 Most Participative Demo Award at User Modelling, Adaptation and Personalization (UMAP) 2013 Conference 2013 Best Paper Award at the International Workshop on Intelligent Digital Games for Empowerment and Inclusion (IDGEI) 2013 Honorable Mention of SSI Framework for Best Open Source Software at ACM Multimedia 2012 Best Paper Finalist at International Conference on Social Robotics (ICSR 2012) 2007, 2008 & 2009 Best Paper Finalist at International Conference on Intelligent Virtual Agents 2008 Award for Most Innovative Idea at Second International Conference on Tangible and Embedded Interaction (TEI 2008), Bonn, XENAKIS 2005 Convivio Best Demo Award for People-centred Agent Technologies awarded at AAMAS 2005 2000 Best Paper Award at International Conference on Intelligent User Interfaces (IUI) Functions of Honor DFG Committee on Scientific Instrumentation and Information Technology since 2023 2022 Wahl in die Bayerische Akademie der Wissenschaften (BAdW) 2021 - 2024 Expert Committee AI – Data Science of Bavarian Ministry of Economic Affairs 2020 - 2023 Bavarian Artificial Intelligence Council 2020 - 2023 Bavarian Ethics Council 2021 European Laboratory for Learning and Intelligent Systems ( ELLIS) Fellow 2021 AAIA Fellow (Asia-Pacific Artificial Intelligence Association) 2020 -   present LBI-DHP, Ludwig-Boltzman Institut: Digital Health and Prevention, Advisory Board 2020 - 2021 Kuratorium Eduard-Rhein-Stiftung 2020 - present Academic Advisory Board of EPSRC Centre for Doctoral Training in Enhancing Human Interactions and Collaborations with Data and Intelligence-Driven Systems at Swansea University, UK 2019 - 2022 Member of Dagstuhl Directorate 2019 - 2022 Milner Award Commitee of the Royal Society 2019 - 2023 University Council (Hochschulrat) OTH Regensburg 2019 - Scientific Advisory Board of Bavarian Research Foundation 2019 - Scientific Advisory Board of Exzellenzstiftung Ingolstädter Wissenschaft - Ignaz Köhler 2018 - 2022 International Scientific Advisory Board of the French AI Research Program 2018 - Now Chist-ERA Scientific Advisory Board 2018 - IJCAI-ECAI Advisory Commitee 2017 – present ACM ICMI Steering Committee Member 2017 - 2020 Scientific Advisory Board of Laboratory of Excellence SMART within initiative d’excellence (idex) Sorbonne Universités 2017 2017 - Platform Self-Learning-Systems – Germany´s Platform for Artificial Intelligence, Co-Chair of Working Group \"Future of Work and Human-Computer Interaction\" 2016 - 2020 Scientific Advisory Board of Helsinki Institute for Information Technology 2016 - Member of Sinergia evaluation commision of the Swiss National Science Foundation (SNF) ERC Starting Grants evaluation panel 2017, Panel Chair for Systems and Communication Engineering ERC Starting Grants evaluation panel 2015, Panel Chair for Systems and Communication Engineering ERC Starting Grants evaluation panel 2013, Panel Chair for Systems and Communication Engineering ERC Starting Grants evaluation panel 2011 for Systems and Communication Engineering, ‘shadow’ evaluation panel 2012 Reviewer of the German Exzellence Initiative 2010 and 2011 DFG (German Science Foundation) Fachkollegiatin (Representative) for 409-4 \"Künstliche Intelligenz, Bild- und Sprachverarbeitung\" (Artificial Intelligence, Language and Language Processing) 2008-2012 Member of Steering Committee of ACM IUI (Intelligent User Interfaces) Member of Steering Committee of ACM IVA(Intelligent Virtual Agents) 2017 - Member of Steering Board of ACM ICMI (International Conference on Multimodal Interfaces) Member of Board of Directors European Association for Multi-Agent Systems (2009-2011) Member of FIT Selection Committee, DAAD (Forschung an internationalen Wissenschafts- und Technologiezentren) since 2009 Jury Junior of Institut Universitaire de France (IUF) appointed by the French minister of higher education and research, 2011 Editorials Editor-in-Chief of IEEE Transactions on Affective Computing from 2019 -2022 Since 01/2020 Associate Editor Springer Nature SN Computer Science Member of the Advisory Board of ACM Transactions on Intelligent User Interfaces (TIIS) Associate Editor of ACM Transactions on Internet of Things (TIOT) since 2018 Associate Editor of IEEE Transactions on Affective Computin",
  "content_length": 14589,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:50"
}