{
  "name": "Elisavet Kozyri",
  "homepage": "https://uit.no/ansatte/elisavet.kozyri",
  "status": "success",
  "content": "Kozyri, Elisavet | UiT Elisavet.kozyri – Institutt for informatikk | UiT Gå til hovedinnhold Enheten Ansatte Elisavet Kozyri Førsteamanuensis Institutt for informatikk elisavet.kozyri@uit.no +4777646335 Tromsø Her finner du meg Elisavet Kozyri Om Forskning og undervisning Her finner du meg Stillingsbeskrivelse For mer informasjon, besøk min personlige nettside. Arbeider i Cristin Vitenskapelige artikler og bokkapitler Bøker og antologier Andre Anne Bumiller, Elisavet Kozyri, Håvard Dagenborg : Privacy Preserving Identity Federation: A Literature Study ACM Computing Surveys 01. juli 2025 DOI Elisavet Kozyri, Fred B. Schneider, Stephen Chong : Accountability, Involvement, and Mediation for Information Flow Proceedings - IEEE Computer Security Foundations Symposium (CSF) 16. juni 2025 DOI Mohsin Khan, Elisavet Kozyri, Dag Johansen, Håvard Dagenborg : Survey of Lightweight Hardware-Based Hash Functions for Security in Constrained IoT Devices IEEE Access 17. september 2025 DOI Elisavet Kozyri, Mariel Evelyn Markussen Ellingsen, Ragnhild Abel Grape, Maria Letizia Jaccheri : Better Balance in Informatics: An Honest Discussion with Students 2023 DOI / ARKIV Bjørn Aslak Juliussen, Elisavet Kozyri, Dag Johansen, Jon Petter Rui : The third country problem under the GDPR: Enhancing protection of data transfers with technology International Data Privacy Law (IDPL) 2023 DOI / ARKIV Elisavet Kozyri, Fred B. Schneider : RIF: Reactive information flow labels Journal of Computer Security 05. mars 2020 DOI Elisavet Kozyri, Owen Arden, Andrew C. Myers, Fred B. Schneider : JRIF: Reactive Information Flow Control for Java Lecture Notes in Computer Science (LNCS) 01. januar 2019 DOI Elisavet Kozyri, Fred B. Schneider, Andrew Bedford, Josee Desharnais, Nadia Tawbi : Beyond Labels: Permissiveness for Dynamic Information Flow Enforcement Proceedings - IEEE Computer Security Foundations Symposium (CSF) 01. juni 2019 DOI Andrew Bedford, Stephen Chong, Josée Desharnais, Elisavet Kozyri, Nadia Tawbi : A progress-sensitive flow-sensitive inlined information-flow control monitor (extended version) Computers & Security 01. november 2017 DOI Elisavet Kozyri, Stephen Chong, Andrew Myers : Expressing Information Flow Properties Now Publishers Inc. 2022 Elisabeth Wetzer, Youssef Wally, Artem Galushko, Elisavet Kozyri, Kristoffer Wickstrøm : How to Tackle Bias and Protect Privacy in the Age of AI? 17. september 2025 Elisabeth Wetzer, Elisavet Kozyri, Alvaro Fernandez Quilez, Nages Razavian : Panel Discussion on \"Diversity in AI\" 2024 Elisavet Kozyri, Mariel Evelyn Markussen Ellingsen, Ragnhild Abel Grape, Maria Letizia Jaccheri : Better Balance in Informatics: An Honest Discussion with Students arXiv 2023 Bjørn Aslak Juliussen, Elisavet Kozyri, Jon Petter Rui, Dag Johansen : The Third Country Problem under the GDPR: Technology to the Rescue 2022 Elisavet Kozyri, Mariel Evelyn Markussen Ellingsen, Ragnhild Abel Grape : An honest discussion with the students 2022 Elisavet Kozyri, Tea Mæland Strandmo : Jenter i informatikk 2022 Elisavet Kozyri, Mariel Evelyn Markussen Ellingsen, Ragnhild Abel Grape : BBI discussion day 2022 Elisavet Kozyri : An honest discussion with the students 2022 Elisavet Kozyri : An honest discussion with the students 2022 Elisavet Kozyri, Tea Mæland Strandmo, Muhammad Nauman Ali : BBI PhD event 2022 Elisavet Kozyri : An honest discussion with the students 2022 Elisavet Kozyri : Enhancing the expressiveness of information flow labels: Reclassification and permissiveness ProQuest Dissertations & Theses 30. desember 2018 De 50 siste resultatene fra Cristin vises på siden. Se alle arbeider i Cristin her → Forskningsinteresser Forskningssiden til Elisavet Kozyri Forskning og undervisning Medlem i forskningsgruppe Crime Control and Security Law Cyber Security Group (CSG) Medlem i prosjekt Better Balance in Informatics (BBI) UiT Balance Hub Cyber Security Compliance and Technology Forcasting tipping point in human health Realfagbygget A232 Klikk for større kart",
  "content_length": 4011,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:56"
}