{
  "name": "Elisha Sacks",
  "homepage": "https://www.cs.purdue.edu/people/eps",
  "status": "success",
  "content": "Elisha P. Sacks - Department of Computer Science - Purdue University Skip to content Home People Faculty Elisha P. Sacks Faculty & Lecturers Staff Offices Elisha Sacks Professor Emeritus of Computer Science Dr. Sacks's research area is geometric reasoning in science and engineering. His current projects are robust computational geometry,model acquisition for computer graphics, generalized camera models, and robot path planning. He has also researched mechanical design algorithms using configuration spaces. The research led to practical design software for kinematic analysis, simulation, tolerancing, and parametric design of mechanical systems with higher pair… ↓More Joined department: 1994 Research Areas Graphics, Visualization, and Geometric Modeling Computational Science and Engineering Education BS, Carnegie-Mellon University, Computer Science (1982) SM, Massachusetts Institute of Technology, Computer Science (1985) PhD, Massachusetts Institute of Technology, Computer Science (1988) Dr. Sacks's research area is geometric reasoning in science and engineering. His current projects are robust computational geometry,model acquisition for computer graphics, generalized camera models, and robot path planning. He has also researched mechanical design algorithms using configuration spaces. The research led to practical design software for kinematic analysis, simulation, tolerancing, and parametric design of mechanical systems with higher pairs and changing contact topologies. The software has been used at Ford Motors for transmission design and at Sandia National Laboratory for micro-mechanism design. Selected Publications Elisha Sacks, Victor Milenkovic, and Nabeel Butt, \"Robust free space construction for a polyhedron with planar motion\", Computer-Aided Design, 90c, 2017. Min-Ho Kyung, Elisha Sacks and Victor Milenkovic, \"Robust Polyhedral Minkowski sums with GPU Implementation\" Computer-Aided Design 67-68, 2015 Victor Milenkovic, Elisha Sacks, and Steve Trac, \"Planar Shape Manipulation Using Approximate Geometric Primitives\", International Journal of Computational Geometry and Applications, 23(1), 2013 Contact Info eps@cs.purdue.edu Websites My Homepage",
  "content_length": 2193,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:54"
}