{
  "name": "Elissa Weeden",
  "homepage": "https://www.rit.edu/gccis/elissa-weeden",
  "status": "success",
  "content": "Elissa Weeden | Golisano College of Computing and Information Sciences | RIT RIT Logo with Text Elissa Weeden Associate Professor School of Information Golisano College of Computing and Information Sciences elissa.weeden@rit.edu 585-475-6733 Office Location GOL-2635 Elissa Weeden Associate Professor School of Information Golisano College of Computing and Information Sciences Education BS, MS, Rochester Institute of Technology; Ph.D, Nova Southeastern University elissa.weeden@rit.edu 585-475-6733 Areas of Expertise Accessibility Data Science Select Scholarship Journal PaperWeeden, Elissa. \"A Model of an Accessibility Curriculum in Higher Education.\" Frontiers in Computer Science. (2023): 1-11. Web.Published Conference ProceedingsMason, Sharon, Elissa Weeden, and Dan Bogaard. \"Building a Growth Mindset Toolkit as a Means Toward Developing a Growth Mindset for Faculty Interactions with Students In and Out of the Classroom.\" Proceedings of the SIGITE '22, Sept. 21-24, 2022, Chicago, IL. Ed. Ray Trygstad and Yong Zheng. New York, NY: Association for Computing Machinery, 2022. Web.Mason, Sharon and Elissa Weeden. \"Chronicling the Development of a Growth Mindset Community of Practice for Computing Faculty: Lessons Learned and Looking Forward.\" Proceedings of the IEEE Frontiers in Education 2022, Oct. 8-10 2022, Uppsala, Sweden. Ed. n/a. n/p, n/p: IEEE, 2022. Web.Branch, Christopher C., et al. \"Perceptions of Ethics in Persuasive User Interfaces.\" Proceedings of the 16th International Conference, PERSUASIVE 2021, Virtual, April 12-14, 2021. Ed. Raian Ali, Birgit Lugrin, and Fred Charles. Cham, Switzerland: Springer, Cham, 2021. Web.Peer Reviewed/Juried Poster Presentation or Conference PaperDell, Elizabeth, et al. \"Two Theory Driven Approaches Toward a Single Goal: Retaining Students in STEM.\" Proceedings of the 2022 Conference on Science and Technology Education, Oct. 6-7 2022, Porto, Portugal. Ed. n/a. n/p, Portugal: n.p..Weeden, Elissa and Kathryn Schmitz. \"Using Web Conferencing to Foster Inclusive Course Experiences for Deaf Students.\" Proceedings of the 2016 AHEAD Conference pepnet2 Postsecondary Training Institute, July 11-16, 2016, Indianapolis, Indiana. Ed. unknown. Indianapolis, IN: n.p..Invited Article/PublicationWeeden, Elissa and Kathryn L. Schmitz. \"Web Conferencing Technology: Fostering Inclusive Course Experiences for Students Who are Deaf and Hard of Hearing.\" Volta Voices. (2014). Web.Invited Keynote/PresentationWeeden, Elissa. \"How Accessible Are Open Education Websites?\" International Conference of Education, Research and Innovation (iCERI 2011). International Association for Technology, Education and Development. Melia Castilla Madrid, Madrid, Spain. 14-16 Nov. 2011. Conference Presentation.Weeden, Elissa. \"Supplemental Instruction: Proactive Versus Reactive Implementations.\" International Conference of Education, Research and Innovation (iCERI 2011). International Association for Technology, Education and Development. Madrid, Spain. 14-16 Nov. 2011. Conference Presentation.Weeden, Elissa. \"Video Captioning Solutions for E-Learning Instructors.\" New Learning Technologies 2011. Society for Applied Learning Technology. Caribe Royale Orlando Hotel, Orlando, Florida. 23-25 Feb. 2011. Conference Presentation. Currently Teaching HCIN-610Foundations of Human-Computer Interaction3 CreditsHuman-computer interaction (HCI) is a field of study concerned with the design, evaluation and implementation of interactive computing systems for human use and with the study of major phenomena surrounding them. This course surveys the scope of issues and foundations of the HCI field: cognitive psychology, human factors, interaction styles, user analysis, task analysis, interaction design methods and techniques, and evaluation. This course will focus on the users and their tasks.HCIN-662Research in Accessibility3 CreditsStudents will dive into cutting edge research in the field of computer accessibility and assistive technology; they will read, present, and discuss research literature from major conferences and journals in the field. Students will learn about recent developments and ongoing research efforts in accessibility, and they will learn how to synthesize the results from research publications. Students will learn how to identify high quality research and how to critique this work to identify areas for improvement or future research directions. Students will learn the elements of a high-quality research publication, and they will explore and gain expertise in a particular topic in the field of accessibility in depth.ISTE-230Introduction to Database and Data Modeling3 CreditsA presentation of the fundamental concepts and theories used in organizing and structuring data. Coverage includes the data modeling process, basic relational model, normalization theory, relational algebra, and mapping a data model into a database schema. Structured Query Language is used to illustrate the translation of a data model to physical data organization. Modeling and programming assignments will be required. Note: students should have one course in object-oriented programming.ISTE-266Design For Accessibility3 CreditsThis course will explore the design, evaluation, and use of computing and information technologies to benefit people with disabilities and older adults. Students will learn how to analyze the accessibility of existing software or websites, and they will learn how to design technology that can be effectively, enjoyably, and efficiently used by people with diverse sensory, motor, and cognitive abilities. Students will learn about cutting-edge ways in which science and technology has provided assistance and accessibility for people with disabilities. Students will learn how to investigate the needs of users with disabilities, design technologies according to universal design or accessibility principles, interpret key accessibility regulations and guidelines, and include people with disabilities in the design and evaluation of new technologies. Programming is required.ISTE-464Accessibility Through the Lifespan3 CreditsStudents will explore how accessibility and assistive technologies intersect with aging throughout the lifespan, with a particular focus on the early and later stages of human development, including: educational contexts (for children or young adults) and effective design strategies for promoting accessibility for older adults with diverse capabilities. Students will learn key legal regulations that govern special education and accessibility in educational contexts, including the provision of assistive technologies and the accessibility of instructional technologies. Students will also explore typical changes in ability and impairments that relate to the human aging process, and they will investigate how to design usable and engaging technology for the growing population of older adults. Students will come to understand the concepts and needs of younger and older users firsthand through, e.g., guest speakers or personal interactions.ISTE-562Research in Accessibility3 CreditsStudents will dive into cutting edge research in the field of computer accessibility and assistive technology; they will read, present, and discuss research literature from major conferences and journals in the field. Students will learn about recent developments and ongoing research efforts in accessibility, and they will learn how to synthesize the results from research publications. Students will learn how to identify high quality research and how to critique this work to identify areas for improvement or future research directions. Students will learn the elements of a high-quality research publication, and they will explore and gain expertise in a particular topic in the field of accessibility in depth.MATH-495Undergraduate Research in Mathematical Sciences1 - 3 CreditsThis course is a faculty-directed project that could be considered original in nature. The level of work is appropriate for students in their final two years of undergraduate study. In the News January 10, 2022 NSF-funded study creates scholarships to help computing scholars find success RIT received a nearly $1 million National Science Foundation grant that will provide scholarships for computing students and help researchers explore new ways to improve computing education. Sharon Mason, a professor in RIT’s School of Information, is principal investigator of the project. June 8, 2021 Two School of Information faculty receive Teach Access Curriculum Development awards Elissa Weeden, associate professor, and Michael McQuaid, senior lecturer, each received a Teach Access Curriculum Development Award of $5,000. The awards will be used to develop educational materials and drive curriculum enhancements to introduce key concepts and skills on accessible design and development in university courses. More News Search RIT Close  X This website uses cookies to provide better user experience and functionality. You can control and configure cookies in your web browser. Cookie Statement | How to Disable Cookies OK",
  "content_length": 9113,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:56"
}