{
  "name": "Elizabeth D. Mynatt",
  "homepage": "https://www.khoury.northeastern.edu/people/elizabeth-mynatt",
  "status": "success",
  "content": "Elizabeth Mynatt - Khoury College of Computer Sciences All People Elizabeth Mynatt (she/her) Dean of Khoury College of Computer Sciences Research interests Research interests Health informatics Human computer interaction Ubiquitous computing Education Education PhD in Computer Science, Georgia Institute of Technology MS in Computer Science, Georgia Institute of Technology BS in Computer Science, summa cum laude, North Carolina State University Biography Biography Elizabeth Mynatt is the Dean of Khoury College of Computer Sciences. She joined Northeastern University in January 2022 after a 23-year career at Georgia Institute of Technology (Georgia Tech), where she most recently served as Regents’ and Distinguished Professor in the College of Computing and executive director of the Institute of People and Technology. Mynatt is an internationally recognized expert in the areas of ubiquitous computing and assistive technologies. Her research contributes to ongoing advances in personal health informatics, computer-supported collaborative work, and human-centered computing. In her research Mynatt directed the Everyday Computing Lab at Georgia Tech. There she investigated the design of health and information technologies to support breast cancer patients during their journey using personalized mobile technologies. Mynatt also was one of the leading researchers in the Aware Home Research Initiative, that investigated future home technology designs that enable aging adults to continue to live independently. Mynatt is also senior investigator with Emory’s Cognitive Empowerment Program and co-PI for the NSF AI-CARING Institute, both with the goal of creating longitudinal, interactive AI technologies to empower older adults and their care networks. Mynatt was elected as a member of the American Academy of Arts and Sciences in 2024. She serves as member of the National Academies Computer Science and Telecommunications Board (CSTB) and the NSF Directorate for Computer, Information Science & Engineering Advisory Committee (CISE AC). She has been recognized as a member of the ACM SIGCHI Academy, and a Sloan and Kavli research fellow. Mynatt is the past Chair of the Computing Community Consortium, an NSF-sponsored effort to engage the computing research community in envisioning more audacious research challenges. Mynatt has published more than 100 scientific papers, led grants from the NSF and NIH, and chaired the CHI 2010 conference, the premier international conference in human-computer interaction. In 2015 she became a Fellow of the Association of Computing Machinery (ACM) for contributions to human-centered computing and the development of health information technologies. Mynatt was elected as an American Association for the Advancement of Science (AAAS) Fellow in 2021 for exceptional computing community leadership and for distinguished leadership and contributions to human-centered computing, with a focus on assistive technologies, wellness, and health. Her article, “Charting past, present, and future research in ubiquitous computing,” published in 2000, has been cited over 2000 times. She has also been quoted or featured in major publications including the Washington Post, National Geographic, and The Wall Street Journal. Mynatt earned her Bachelor of Science summa cum laude in computer science from North Carolina State University and her Master of Science and Ph.D. in computer science from Georgia Tech. Prior to joining the Georgia Tech faculty in 1998, Mynatt was a member of the research staff at Xerox PARC. Recent publications Recent publications Published: September 3, 2025 Vital Insight: Assisting Experts’ Context-Driven Sensemaking of Multi-modal Personal Tracking Data Using Visualization and Human-in-the-Loop LLM Citation: Jiachen Li, Xiwen Li, Justin Steinberg, Akshat Choube, Bingsheng Yao, Xuhai Xu, Dakuo Wang, Elizabeth D. Mynatt, Varun Mishra . (2025). Vital Insight: Assisting Experts' Context-Driven Sensemaking of Multi-modal Personal Tracking Data Using Visualization and Human-in-the-Loop LLM Proc. ACM Interact. Mob. Wearable Ubiquitous Technol., 9, 101:1-101:37. https://doi.org/10.1145/3749508 Published: July 4, 2025 Insights from Designing Context-Aware Meal Preparation Assistance for Older Adults with Mild Cognitive Impairment (MCI) and Their Care Partners Citation: Szeyi Chan, Jiachen Li, Siman Ao, Yufei Wang, Ibrahim Bilau, Brian D. Jones, Eunhwa Yang, Elizabeth D. Mynatt, Xiang Zhi Tan. (2025). Insights from Designing Context-Aware Meal Preparation Assistance for Older Adults with Mild Cognitive Impairment (MCI) and Their Care Partners Conference on Designing Interactive Systems, 3263-3279. https://doi.org/10.1145/3715336.3735817 Published: April 25, 2025 Technology Mediated Caregiving For Older Adults Aging in Place Citation: Elizabeth D. Mynatt, Masatomo Kobayashi, Alisha Pradhan, Niharika Mathur, John Vines, Katie Seaborn, Erin Buehler, Jenny Waycott, John Rudnik, Tamara Zubatiy, Agata Rozga. (2025). Technology Mediated Caregiving For Older Adults Aging in Place CHI Extended Abstracts, 802:1-802:7. https://doi.org/10.1145/3706599.3706721 Published: January 12, 2025 A Research Through Design Study on AI Explanations for Collaborative Everyday Tasks for Older Adults Aging in Place Citation: Niharika Mathur, Tamara Zubatiy, Elizabeth D. Mynatt. (2025). A Research Through Design Study on AI Explanations for Collaborative Everyday Tasks for Older Adults Aging in Place GROUP Companion, 48-53. https://doi.org/10.1145/3688828.3699640 Published: October 18, 2024 Vital Insight: Assisting Experts’ Sensemaking Process of Multi-modal Personal Tracking Data Using Visualization and LLM Citation: Jiachen Li, Justin Steinberg, Xiwen Li, Akshat Choube, Bingsheng Yao, Dakuo Wang, Elizabeth D. Mynatt, Varun Mishra . (2024). Vital Insight: Assisting Experts' Sensemaking Process of Multi-modal Personal Tracking Data Using Visualization and LLM CoRR, abs/2410.14879. https://doi.org/10.48550/arXiv.2410.14879 Published: August 14, 2024 Navigating the Paradox: Challenges and Strategies of University Students Managing Mental Health Medication in Real-World Practices Citation: Jiachen Li, Justin Steinberg, Elizabeth D. Mynatt, Varun Mishra . (2024). Navigating the Paradox: Challenges and Strategies of University Students Managing Mental Health Medication in Real-World Practices CoRR, abs/2408.07784. https://doi.org/10.48550/arXiv.2408.07784 Published: July 7, 2024 Categorizing Sources of Information for Explanations in Conversational AI Systems for Older Adults Aging in Place Citation: Niharika Mathur, Tamara Zubatiy, Elizabeth D. Mynatt. (2024). Categorizing Sources of Information for Explanations in Conversational AI Systems for Older Adults Aging in Place CoRR, abs/2406.05111. https://doi.org/10.48550/arXiv.2406.05111 Published: February 23, 2024 AI-CARING: National AI Institute for Collaborative Assistance and Responsive Interaction for Networked Groups Citation: Sonia Chernova, Elizabeth D. Mynatt, Agata Rozga, Reid G. Simmons, Holly A. Yanco. (2024). AI-CARING: National AI Institute for Collaborative Assistance and Responsive Interaction for Networked Groups AI Mag., 45, 124-130. https://doi.org/10.1002/aaai.12162 Published: November 25, 2023 A Distributed Cognition Approach to Understanding Compensatory Calendaring Cognitive Systems of Older Adults with Mild Cognitive Impairment and Their Care Partners Citation: Tamara Zubatiy, Kayci L. Vickers, Jessica L. Saurman, Felicia Goldstein, Amy D. Rodriguez, Niharika Mathur, Elizabeth D. Mynatt. (2023). A Distributed Cognition Approach to Understanding Compensatory Calendaring Cognitive Systems of Older Adults with Mild Cognitive Impairment and Their Care Partners UCAmI (1), 190-201. https://doi.org/10.1007/978-3-031-48306-6_19 Published: November 25, 2023 “Why Did You Say That?”: Understanding Explainability in Conversational AI Systems for Older Adults with Mild Cognitive Impairment (MCI) Citation: Niharika Mathur, Tamara Zubatiy, Agata Rozga, Elizabeth D. Mynatt. (2023). \"Why Did You Say That?\": Understanding Explainability in Conversational AI Systems for Older Adults with Mild Cognitive Impairment (MCI) UCAmI (1), 208-214. https://doi.org/10.1007/978-3-031-48306-6_21 Published: October 9, 2023 “Mango Mango, How to Let The Lettuce Dry Without A Spinner?”: Exploring User Perceptions of Using An LLM-Based Conversational Assistant Toward Cooking Partner Citation: Szeyi Chan, Jiachen Li, Bingsheng Yao, Amama Mahmood, Chien-Ming Huang , Holly Jimison, Elizabeth D. Mynatt, Dakuo Wang. (2023). \"Mango Mango, How to Let The Lettuce Dry Without A Spinner?\": Exploring User Perceptions of Using An LLM-Based Conversational Assistant Toward Cooking Partner CoRR, abs/2310.05853. https://doi.org/10.48550/arXiv.2310.05853 Published: October 4, 2023 “I don’t know how to help with that” – Learning from Limitations of Modern Conversational Agent Systems in Caregiving Networks Citation: Tamara Zubatiy, Niharika Mathur, Larry Heck, Kayci L. Vickers, Agata Rozga, Elizabeth D. Mynatt. (2023). \"I don't know how to help with that\" - Learning from Limitations of Modern Conversational Agent Systems in Caregiving Networks Proc. ACM Hum. Comput. Interact., 7, 1-28. https://doi.org/10.1145/3610170 Published: October 4, 2023 Privacy vs. Awareness: Relieving the Tension between Older Adults and Adult Children When Sharing In-home Activity Data Citation: Jiachen Li, Bingrui Zong, Tingyu Cheng, Yunzhi Li, Elizabeth D. Mynatt, Ashutosh Dhekne. (2023). Privacy vs. Awareness: Relieving the Tension between Older Adults and Adult Children When Sharing In-home Activity Data Proc. ACM Hum. Comput. Interact., 7, 1-30. https://doi.org/10.1145/3610202 Published: September 24, 2023 “Always Nice and Confident, Sometimes wrong”: Developer’s Experiences Engaging Generative AI Chatbots Versus Human-Powered Q&A Platforms Citation: Jiachen Li, Elizabeth D. Mynatt, Varun Mishra , Jonathan Bell. (2023). \"Always Nice and Conf",
  "content_length": 12531,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:57"
}