{
  "name": "Elizabeth Lindley Murnane",
  "homepage": "https://engineering.dartmouth.edu/community/faculty/elizabeth-murnane",
  "status": "success",
  "content": "Elizabeth L. Murnane | Dartmouth Engineering Skip to main content Undergraduate Bachelor's Degrees Bachelor of Arts Bachelor of Engineering Dual-Degree Program Undergraduate Admissions Undergraduate Experience BE Student Resources Engineering Design Financial Aid & Funding Life After Dartmouth Project Spaces & Labs Research & Entrepreneurship Student Life & Housing Study Abroad Quick Links Academic Calendar BE Student Policies & Procedures Career Services Course Descriptions Course Schedules Majors & Modified Majors Minors Programs & Courses Guide Program Areas Biological/Chemical Biomedical Electrical/Computer Energy Materials Science Mechanical/Operations/Systems Graduate Master's Degrees Master of Engineering Master of Engineering Management Master of Science Doctoral Degrees Doctor of Philosophy PhD Innovation Program Online Programs Graduate Admissions Graduate Experience Collaborative Programs Degree Outcomes Engineering Design Financial Aid & Funding Joint Degrees Student Policies & Procedures Student Resources Quick Links Academic Calendar Admissions Events Career Services Course Descriptions Course Schedules Program Areas Programs & Courses Guide Program Areas Biological/Chemical Biomedical Electrical/Computer Energy Materials Science Mechanical/Operations/Systems Research Research by Program Area Biological/Chemical Biomedical Electrical/Computer Energy Materials Science Mechanical/Operations/Systems Quick Links Active Projects Collaborative Programs Laboratories Libraries Research News Undergraduate Research Entrepreneurship Startups listed by Startup Names Faculty Founders Research Programs Patents listed by Patent Titles Faculty Inventors Research Programs Links & Resources Dartmouth NSF I-Corps Program Dartmouth Tech Transfer Entrepreneurship News Magnuson Center for Entrepreneurship Office of Entrepreneurship & Technology Transfer PhD Innovation Program Tuck School of Business Community Community Info Faculty Leadership Offices Academic Calendar Student Groups Alumni Giving Magazine News Events Facebook Instagram Twitter/X LinkedIn YouTube Flickr About About Us Visit Facts History Leadership Diversity and Inclusion Disability Values and Vision Strategic Plan Policies Careers Transcripts Enrollment Verification Search Menu Close Back Home  |  Community  |  Faculty  |  Elizabeth L. Murnane Elizabeth L. Murnane Charles H. Gaut & Charles A. Norberg Assistant Professor of Engineering emurnane@dartmouth.edu LinkedIn Related Links Empower LabPersonal pageGoogle Scholar Overview Professor Murnane specializes in human factors, information science, and human-computer interaction, with a focus on applications in public health, STEM education, and environmental sustainability. The bulk of her research is in the domain of digital health, with an emphasis on developing personal informatics tools that promote patient experience and health equity. At Dartmouth, she founded and directs the Empower Lab, a team of students and research scientists working together to create behavioral intervention technologies that aim to positively shape knowledge, attitudes, and actions through a user-empowerment approach. The lab explores the design of various form factors, information formats, and interaction paradigms (e.g., games, toys, tangibles, musical interfaces, narratives, AR/VR/XR, psychotherapeutic visualization, socially assistive robots, and more) that are sensitive to the needs of traditionally underserved populations. Before joining the Dartmouth faculty, Elizabeth was a postdoctoral scholar in computer science at Stanford University and received her PhD in information science from Cornell University. After completing her undergraduate degree at MIT, Elizabeth also spent 4 years as the lead engineer and head of experimental features of a CSAIL startup that built interactive visualization tools to help software developers make sense of complex codebases. Elizabeth's work continues to emphasize translational approaches that seek opportunities to meaningfully engage with and positively shape industry practices, local communities, and policy-making. Additional research materials, details about current projects, and ways to get involved are available from her website. Research Interests Human-centered design, human-computer interaction, ubiquitous computing, personal informatics, social computing Education SB, Mathematics with Computer Science, MIT 2007 PhD, Information Science, Cornell University 2017 Postdoctoral Scholar, Computer Science, Stanford University 2020 Awards Canvy Award, Darmouth Learning Design and Innovation, 2025 Research Projects Interactive technology for health monitoring and behavioral intervention Interactive technology for health monitoring and behavioral intervention The Empower Lab creates digital therapeutics and intervention technologies, with an emphasis on inclusive design, patient experience, and health equity.We seek students to contribute to the design, development, and evaluation of our interactive tools, which aim to positively shape behaviors and health outcomes through an empowerment approach. Our work employs human-centered methods and explores a variety of form factors and interaction paradigms (e.g., AR/VR/XR, games, toys, tangibles, musical interfaces, narratives, psychotherapeutic visualization, socially assistive robots, and more).We work closely with stakeholder populations on a range of health topics; key areas of focus include mental health, women’s health, physical mobility/pain, aging-in-place, and pediatrics/childhood development. More details about our lab and its active projects, including specific recruiting opportunities, can be found here: empowerlab.dartmouth.edu/projectsGenerally speaking, our collaborative research style integrates interdisciplinary skills from both computing and engineering as well as the social sciences and humanities. Students typically focus on contributing to one or two aspects of a project’s research activities, which include iterative design (UX, prototyping), implementation (software programming, physical fabrication), data analysis (quantitative/statistical or qualitative), stakeholder engagement (conducting interviews, observational or ethnographic work), and running studies (user testing, lab experiments, online or survey studies, or field trials).If interested in getting involved, you can fill out our application form dartgo.org/empowerlab-apply or email the lab director, Prof. Liz Murnane (emurnane@dartmouth.edu) to share your resume, relevant interests and background, and any questions you might have. We look forward to hearing from you! × Courses Loading courses... News Geisel's $12 Million NIH COBRE Grant to Help Train Junior Faculty in Implementation Science Sep 11, 2025 Student Project Highlight: A planet-friendly packable fridge Jul 15, 2025 Wells Willett '24 on Bikes, Mechanics, and Human-Centered Engineering May 08, 2023 Digital Therapeutics Summit Held at Dartmouth Nov 10, 2022 Dartmouth's Design Initiative Funds Five New Interdisciplinary Projects Oct 04, 2022 Winners of 2022 Neukom Institute CompX Faculty Grants Jun 06, 2022 Welcome: New Faculty Mar 15, 2021 New Faculty Bring Wide-Ranging Talent, Knowledge to Dartmouth Feb 23, 2021 Faculty Named to Endowed Chairs Oct 27, 2020 Elizabeth Murnane Joins Dartmouth Engineering Faculty Aug 12, 2020 Ten Dartmouth-Affiliated Papers Accepted by International Computer Conference Jul 09, 2020 In the News XRDS Integrating people-centered and planet-centered design Sep 01, 2021 Research Quick Takes Jun 22, 2023 NSF Engines Semifinalist Professors Liz Murnane, Vikrant Vaze, and Wesley Marrero are lead faculty on a team selected as one of 34 semifinalists for the inaugural NSF Regional Innovation Engines competition—spanning nearly all key technology areas and societal and economic challenges highlighted in the \"CHIPS and Science Act.\" A partnership with UMass Lowell, their proposed engine is titled, \"Advancing Health Equity Through Digital Technologies, Data Infrastructure, and Artificial Intelligence.\" Each Engine could receive up to $160 million over 10 years.",
  "content_length": 8139,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:59"
}