{
  "name": "Elizabeth Scott",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/elizabeth-scott_2b634c08-8249-413d-9654-031aed1f680b.html",
  "status": "success",
  "content": "Elizabeth Scott - Royal Holloway Research Portal Elizabeth Scott Professor Professor in Computer Science, Department of Computer ScienceCentre for Software Language EngineeringCentre for Programming Languages and Systems Phone+44 1784 443427EmailE.Scottrhul.acuk TW20 0EX Personal profile Research interestsElizabeth Scott's Home Page Software Language Engineering Webpage Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research output 39 Article 10 Conference contribution 8 Paper 1 Book 1 More 1 Software Research output per year Research output per year GLL ParsingScott, E. & Johnstone, A., 17 Sept 2010, In: Electronic Notes in Theoretical Computer Science. 253, 7, p. 177-189 13 p.Research output: Contribution to journal › Article › peer-review Open Access Earley Table Traversing ParsersScott, E. & Johnstone, A., Jan 2026, In: Science of Computer Programming. 247, p. 1-43 43 p., 103335.Research output: Contribution to journal › Article › peer-review Open Access 1 Downloads (Pure) Handling Grammar Cycles in the 1997 SML DefinitionScott, E. & Johnstone, A., 17 Jun 2025, Proceedings of the 18th ACM SIGPLAN International Conference on Software Language Engineering (SLE '25), June 12--13, 2025, Koblenz, Germany. ACM, p. 3-15 13 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 43 Downloads (Pure) Analysing the SML97 Definition: LexicalisationScott, E. & Johnstone, A., 21 Mar 2023, Eelco Visser Commemorative Symposium (EVCS 2023). Lammel, R., Mosses, P. D. & Steimann, F. (eds.). Schloss Dagstuhl – Leibniz-Zentrum für Informatik, Vol. 109. p. 23:1-23:12 12 p. 23. (Open Access Series in Informatics).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open Access A Reference GLL Implementation - code repositoryJohnstone, A. (Developer) & Scott, E. (Other), 23 Oct 2023Research output: Non-textual form › Software View all 59 research outputs Projects 1 Finished Projects per year PLanCompS: PLanCompS: Programming Language Components and SpecificationsJohnstone, A. (PI), Scott, E. (CoI), Reddington, J. (CoI) & Walsh, R. (CoI)Eng & Phys Sci Res Council EPSRC1/06/11 → 31/05/15Project: Research Datasets A Reference GLL Implementation - language corpora repositoryJohnstone, A. (Creator) & Scott, E. (Other), Royal Holloway, University of London, 23 Oct 2023https://github.com/AJohnstone2007/referenceLanguageCorporaDataset",
  "content_length": 2650,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:03"
}