{
  "name": "Elizabeth M. Gerber",
  "homepage": "https://egerber.mech.northwestern.edu",
  "status": "success",
  "content": "Liz Gerber, PhD Skip to content Our new Center for Human Computer Interaction and Design received a $5 million gift from Patricia Bao ’13 PhD to advance research that examines the future of technology and its ability to enhance the lives of people around the world. It feels like a true honor to receive this gift and use it for good with my co-directors, Darren Gergle and Bryan Pardo. https://news.northwestern.edu/stories/2022/06/multimillion-dollar-gift-to-advance-study-of-human-computer-interaction/ I’m honored to have been invited to deliver the keynote at the Lorentz Center in the Netherlands on December 6, 2021.  I will be speaking about the past, present, and future of Hackathon research. Specifically, I will be imagining what happens when AI takes over some or all of the tasks of Hackathons. Is this the future we want? If not, what are we going to do about it? Time magazine selected Sproutel’s “Purrble” as an invention for 2021 (along with the COVID-19 vaccine).  Sproutel started at Design for America’s Northwestern campus. “During the pandemic, countless children have been isolated at home and distressed as their lives and routines were abruptly disrupted. For some, Purrble ($49.99) came to the rescue. An interactive plush toy equipped with seven sensors that respond to touch, Purrble’s haptic heartbeat speeds up to 135 b.p.m. when it senses somebody’s playing with it. Kids can then comfort their companion with gentle petting, slowing Purrble’s vibrational heartbeat to a purr—calming themselves as well in the process. Developed using research from the Committee for Children, a nonprofit and global leader on social-emotional learning, the device aims to help children learn to regulate their emotions. Preliminary research shows that Purrble is doing just that: in a study with 20 families, 19 parents reported that the toy helped their kids calm down when they needed to. “I grew up with a chronic illness as a child and would have loved to have this,” says Aaron Horowitz, CEO of Sproutel, which designed the toy. ” —Paulina Cachero https://time.com/collection/best-inventions-2021/6113137/purrble/ PhD student Evey Huang just received Northwestern’s prestigious Advanced Cognitive Science Fellowship. She will be researching the use of algorithms and the potential role of technologies in developing and deploying a mixed-initiative, intelligent coaching system. Texas State University hosted a fabulous conference on the State of Black Design for young designers, especially black designers, on April 9-10, 2021. Design for America was honored to participate in the event. Our work on scaling HCI interventions to appear at the Human Computer Interaction Consortium. We are excited to share the work. Abstract: Creating innovative technologies to improve people’s lives has always been a core aim of HCI researchers and practitioners. In many cases, this impact is realized through innovations that scale to provide many people with the ability to achieve meaningful outcomes. As devices and software have become affordable and ubiquitous, our field has attempted to scale outcomes such as free access to a world-class education, on-demand personalized health interventions, and flexible employment through sharing economies. However, despite our efforts, many of these outcomes have failed to scale deeply and equitably. In this HCIC presentation, we will propose a working definition of scaling for HCI that addresses both the depth of the outcomes promoted by an innovation and the equity of people’s ability to achieve those outcomes. We will then present a set of scaling approaches from computer science and the social sciences and highlight areas that have been understudied thus far. We will conclude with a discussion of unresolved issues with the definition and approaches, and will invite feedback and critique from the HCIC community. Congratulations to PhD student, Gus Umbelino, for his invitation to present his work in progress on mentor career strategies at CHI 2021. Check out his brief video here. I’m excited to be invited to present with my colleagues at the Carnegie Summit on Network Improvement Communities this spring. We will present: Loft Digital Studio From Forgeworks: Technology to Support Improvement in Networked Improvement Communities For networked improvement communities (NICs) to succeed, network members must learn improvement science methods. Loft Digital Studio helps NIC members provide regular high-quality feedback to teams, author and share improvement methods, and select improvement methods. In this session, presenters will share a case study of the Loft network-improvement platform within a NIC for K–12 mathematics. Presenters will discuss how to combine software and strategies to help improvement science teams learn to positively transform education. Check out our lab’s latest paper titled The design risk framework: Understanding metacognition for iteration in Design Studies. Iteration is an important design process that novice designers struggle to follow. However, iteration is difficult to coach because we do not understand the underlying metacognitive knowledge required for effective iteration. We developed the Design Risks Framework, which helps researchers to identify the knowledge underlying three metacognitive processes that control iteration: focusing attention on key areas of the project, identifying project risks, and choosing iterative strategies to mitigate risks. We tested the framework over a 6-week period with 5 novice design teams and found that novices seemed to lack metacognitive knowledge of 49 criteria for identifying project risks. By using this framework to diagnose knowledge gaps and design coaching interventions, educators and managers can improve how novice designers iterate in design projects. DFA joined with IBM Design and the World Design Organization on a design initiative to address the pandemic The COVID-19 Design Challenge is a global initiative to mobilize the world’s design communities to focus on this battle. Spearheaded by the World Design Organization (WDO), IBM Design, and Design for America (DFA), this effort has brought over 225 designers together from 33 countries to address some of the most urgent and important challenges posed by the Coronavirus. Learn more about the COVID19 Design Challenge Recent Posts Multimillion gift to advance the study of human-computer interaction and design Invited to deliver keynote at Lorentz Center in the Netherlands Design for America’s Sproutel product selected as one of Time’s Inventions for 2021 PhD student Evey Huang to receive prestigious Advanced Cognitive Science Research Fellowship State of Black Design Conference on April 9-10 Invited to present our work on scaling HCI interventions to appear at the Human Computer Interaction Consortium Work in progress on online mentor career strategies to appear at CHI 2021 Invited to present at the Carnegie Summit on Network Improvement Communities New paper accepted on the design risks framework Design for America Teams Up with Innovation Leaders to Help Fight Against COVID-19 Archives August 2022 December 2021 November 2021 April 2021 March 2021 December 2020 September 2020 July 2020 May 2020 April 2020 November 2019 September 2019 January 2019 August 2018 December 2017 November 2017 August 2017 May 2017 February 2017 December 2016 September 2016 June 2016 May 2016 April 2016 March 2016 February 2016 January 2016 December 2015 November 2015 August 2015 June 2015 April 2015 March 2015 February 2015 January 2015 December 2014 November 2014 September 2014 August 2014 June 2014 May 2014 April 2014 March 2014 February 2014 January 2014 December 2013 November 2013 October 2013 September 2013 August 2013 June 2013 May 2013 April 2013 March 2013 February 2013 January 2013 December 2012 November 2012 August 2012 Categories Awards Crowdfunding Crowdsourcing Design for America Grants Innovation Press Research Talks Uncategorized Workshops Meta Log in Entries RSS Comments RSS NUSites",
  "content_length": 8044,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:01"
}