{
  "name": "Elizabeth F. Churchill",
  "homepage": "https://mbzuai.ac.ae/study/faculty/elizabeth-churchill",
  "status": "success",
  "content": "Elizabeth Churchill - MBZUAI MBZUAI About About Leadership and Governance Alumni Mission Faculty Directory Fast Facts Office of the President Office of the Provost Study Study Graduate Admission Process Undergraduate Admission Process Faculty Directory Aspire Ph.D. Fellowship Program Master in Applied Artificial Intelligence (MAAI) Master’s Programs Ph.D. Programs Undergraduate Program Undergraduate Research Internship Program University Catalogue Research Research Computer Vision Research Machine Learning Research Natural Language Processing Projects Research Centers Innovate Innovate Consulting Incubation and Entrepreneurship Center Institute of Digital Public Health Institute of Foundation Models Office of Public Affairs and Alumni Relations Partnerships and Collaborations Training Programs Student Resources Undergraduate Academic Calendar Graduate Academic Calendar Campus Facilities Career Services and Internships Publications Repository Educational Affairs Library Portal Office of the Registrar Campus Map News & Events Commencement Events Media Center The Node | Stories of MBZUAI MBZUAI Nexus | The Global AI Research & Knowledge Network Apply now Home / Faculty directory / Elizabeth Churchill Elizabeth Churchill Department Chair and Professor of Human-Computer Interaction Research Interests Professor Churchill is an applied social scientist, interactive technology designer and social communications researcher. She has a background in psychology (neuro, experimental, cognitive and social), AI, and cognitive science. For the past 20+ years, she has drawn on social, computer, engineering and data sciences to create innovative end-user applications and services. For the past few years, she has been most active in the areas of ubiquitous and mobile computing, social media, computer mediated communication, locative media and internet/web sciences. During this time, Professor Churchill designed and evaluated enterprise and consumer-facing information/communication applications and services for desktop, mobile, tablet and large screen devices. Share Prior to joining MBZUAI, Professor Churchill built research teams at Google, eBay, Yahoo, PARC and FujiXerox. Her background is in psychology, artificial intelligence and cognitive science. She draws on social, computer, engineering, and data sciences to create innovative end-user applications and services. Her current focus is on the design of effective designer and developer tooling for a new operating system, Fuchsia. She holds a Ph.D. from the University of Cambridge and honorary doctorates from the University of Sussex and the University of Stockholm. Professor Churchill is a member of the Association for Computer Machinery's (ACM) CHI Academy, is an ACM Fellow, and an ACM Distinguished Speaker. She served as the ACM's Vice President from 2018-2020. In 2016, she received a Citris-Banatao Institute Award Athena Award for Women in Technology for her Executive Leadership. She has been named one of the top women leaders in UX over the last several years. And has received ACM SIGCHI's Lifetime Service Award (2023) and ACM's Lifetime Practice Award (2024). Ph.D. in cognitive science from the University of Cambridge Master of Science in knowledge-based systems from University of Sussex Bachelor of Science in research and experimental psychology from the University of Sussex. SICHI Lifetime Service Award. 2023 Honorary Doctor of Science, University of Stockholm for sustained impact on the field Honorary Doctor of Science (DSc.), University of Sussex, UK for continued contributions to the sciences underlying creative technology development. Citris Benatao Athena Award for Executive Leadership, 2016 ACM Distinguished Scientist and Distinguished Speaker, 2016 Elected member of ACM Computer Human Interaction (CHI) Academy, 2017 US Patent 7,610,563 System and method for controlling the display of non-uniform graphical objects US Patent 7,546,143 Multi-channel quiet calls. US Patent 7,519,573 System and method for clipping, repurposing, and augmenting document content US Patent 7,251,316 Methods and systems for enabling conversations about task-centric physical objects US Patent 7,249,327 System and method for arranging, manipulating and displaying objects in a graphical user interface Patents (more available on Google Patent Search and on patentdocs). Executive Committee Vice President of the Association for Computing Machinery’s (ACM) Special Interest Group on Human Computer Interaction, SigCHI, 2008-present ACM SigCHIVice President of Chapters, including workshop organizations and communications with chapters, 2007-2008 Association of University Teachers, Local Association Committee, Contract Research Staff Representative, 1994-1996 Conference Leadership Technical Program Committee: Personal Digital Archiving 2013 General Chair: ACM Mobile HCI 2012, with Sri Subramanian Steering Committee: Mobile HCI, 2011-present Papers and Notes Co-Chair for Mobile HCI, Stockholm, Aug-Sept 2011 with Albrecht Schmidt Experience Demos Co-Chair: BCS HCI, July, 2011 with Patrick Olivier Panels Co-Chair: WWW 2010 Panels Co-Chair with Prabhakar Raghavan Co-Chair: CSCW 2010 Papers and Notes Co-Chair with Steve Whittaker Co-Chair: ACM CHI 2007 Technical Program, Notes Co-chair with Rob St. Amant Steering Committee: EPIC (Ethnographic Praxis in Organizations), 2005, 2006, 2007, 2008, 2009 Workshops Chair: EPIC (Ethnographic Praxis in Organizations), 2007 Advisory Committee: ACM Conference on Human Computer Interaction (CHI 2006), Best papers Award for CHI 2006 Co-Chair: ACM Conference on Human Computer Interaction (CHI 2006), Student Design Competition, Montreal, 2006 Co-Chair: ACM Conference on Human Computer Interaction (CHI 2006), Mentoring Program Co-Chair: ACM Conference on Human Computer Interaction (CHI 2006), Associate Program Chair Co-Chair: ACM Conference on Human Computer Interaction, Student Design Competition, Portland, April 2005 Industrial Liaison, ACM Conference on Computer Supported Cooperative Work, Chicago, November 2004 Co-Chair: ACM Conference on Human Computer Interaction (CHI), Doctoral Consortium Co-Chair, Vienna, Austria, April 2004 Co-chair: ACM Conference on Computer Supported Cooperative Work, New Orleans, November 2002 Technical Program Co-chair: CVE 2002. Bonn, Germany in October 2002 Co-chair: CHI 2000 Organizational Overview track, The Hague, April 2000 Co-chair: CVE 2000, ACM Conference on Collaborative Virtual Environments, San Francisco, September 2000 Co-chair: CVE’98 Conference on Collaborative Virtual Environments, held at The University of Manchester, UK, June 1998. Co-chair: CVE’96 Conference on Collaborative Virtual Environments, held at The University of Nottingham in September, 1996. Technical Committee Secretary: Interact ‘90, Conference on Human Computer Interaction. Transforming HCI Research Cycles using Generative AI and “Large Whatever Models”(LWMs) P Elagroudy, J Li, K Väänänen, P Lukowicz, H Ishii, WE Mackay, ... Extended Abstracts of the CHI Conference on Human Factors in Computing … 2024 Supporting Workers in Developing Effective Collaboration Skills for Complex Work EJ Huang, K Garg, D Gómez-Zará, J Hui, C Kulkarni, M Massimi, ... Companion Publication of the 2023 Conference on Computer Supported … 2023 Andrew L. Kun, Elizabeth Churchill, Tamara L. Clegg, Jonathan Grudin, Kristina Höök, Daria Loi, Yolanda Rankin, Elizabeth Rosenzweig, Kentaro Toyama, and Susan Dray. 2022. SIGCHI at 40: celebrations and aspirations. interactions 29, 6 (November - December 2022), 24–29. https://doi.org/10.1145/3564036 Andrew L. Kun, Elizabeth Churchill, Tamara L. Clegg, Jonathan Grudin, Kristina Höök, Daria Loi, Yolanda Rankin, Elizabeth Rosenzweig, Kentaro Toyama, and Susan Dray. 2022. SIGCHI at 40: celebrations and aspirations. interactions 29, 6 (November - December 2022), 24–29. https://doi.org/10.1145/3564036 2020 \" They Don't Leave Us Alone Anywhere We Go\" Gender and Digital Abuse in South Asia N Sambasivan, A Batool, N Ahmed, T Matthews, K Thomas, ... proceedings of the 2019 CHI Conference on Human Factors in Computing Systems … 2019 \" Privacy is not for me, it's for those rich women\": Performative Privacy Practices on Mobile Phones by Women in South Asia N Sambasivan, G Checkley, A Batool, N Ahmed, D Nemer, ... Fourteenth Symposium on Usable Privacy and Security (SOUPS 2018), 127-142 2018 King, R., Tan, C. and Churchill, E.F. Designing with Data: Improving the User Experience with A/B Testing. O'Reilly, 2017. Ritter, F. Baxter, G and Churchill, E. Foundations for User Centered Systems Design. Springer, May 2014. Google Scholar LinkedIn Personal website ResearchGate Related Friday, October 31, 2025 MBZUAI to demonstrate AI as a driving force in energy transformation at ADIPEC 2025 The University will discuss and demonstrate some of the AI technologies it is developing to help shape… research innovation energy robots K2 Think ADIPEC infrastructure Read more Thursday, July 24, 2025 Understanding faith in the age of AI MBZUAI hosted a panel discussion in collaboration with the Manara Center for Coexistence and Dialogue focused on… Human–computer interaction panel conversation faith spirituality religion connection discussion Read more Monday, June 16, 2025 Blurring the lines between the physical and digital MBZUAI’s Elizabeth Churchill joined a panel of creatives to discuss the changing relationship between the physical and… Human–computer interaction HCI art panel identity expression digital physical communication Read more Contact faculty affairs Interested in working with our renowned faculty? Fill out the below form and we will get back to you. x We use cookies We use necessary and analytics cookies to operate our website, analyze traffic, and improve your experience. By continuing to use this website, you agree to our use of cookies. Learn more Got it",
  "content_length": 9895,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:02"
}