{
  "name": "Elizabeth Lane Lawley",
  "homepage": "http://lawley.rit.edu",
  "status": "success",
  "content": "Elizabeth Lane Lawley, Ph.D. Elizabeth Lane Lawley, ph.d. professor of interactive games & media Â· rochester institute of technology Â· elizabeth.lawley@rit.edu or ellics@g.rit.edu I'm a professor in the School of Interactive Games & Media at the Rochester Institute of Technology (RIT), and a faculty affiliate at the RIT MAGIC Center. My current research interests include the intersection of games and tourism, and the evaluation and dissemination of creative scholarly work. I teach classes on generative AI, game design, web design, and creative media. Teaching Generative AI for Games & Media IGME-590 • Spring 2025 This seminar explores the transformative impact of generative AI technologies on interactive entertainment and digital media creation. Students will examine how tools like large language models and media generation tools are reshaping media production, game development, storytelling, and player experiences. Through hands-on projects and critical analysis, participants will gain practical experience with current generative AI tools while considering their creative possibilities, technical limitations, and ethical implications in creative industry contexts. Games & Tourism (Study Abroad in Dubrovnik, Croatia) IGME-590 & IGME-580 IGME-590: From âgamifiedâ tours of locations to augmented reality games to board games based on specific locations, games are increasingly being used by the tourism and hospitality industry as tools to attract new visitors to locations, and engage tourists in activities. In this course, students will review research and case studies of games related to tourism. The class will include presentations by experts in tourism and hospitality as well as experienced game designers. Students will work individually and in groups to create and refine ideas for both analog and digital games related to tourism. IGME-580: This course will allow students to work as domain specialists on teams completing one or more large projects over the course of the semester. The projects will be relevant to experiences of the Interactive Games and Media programs, but will require expertise in a variety of sub-domains, including web design and development, social computing, computer game development, multi-user media, human-computer interaction and streaming media. Students will learn to apply concepts of project management and scheduling, production roles and responsibilities, and their domain skill sets to multidisciplinary projects. Students will complete design documents, progress reports and final assessments of themselves and their teammates in addition to completing their assigned responsibilities on the main projects. Spring 2018: GitHub repository Introduction to Interactive Media IGME-110 This class is a \"big picture\" overview of the study of interactive media, ranging from social and legal aspects of media through the underlying technical aspects of various media types. You will learn research, analysis, and communication skills using a variety of media, including text, images, audio, video and presentation software. By the end of the class, students should be able to: Research topics in interactive Media Critically assess the quality of information resources Recognize and apply relevant legal principles in the creation and use of media Create media in a variety of formats, incorporating knowledge of underlying technical concepts Design and implement a website incorporating text and images Effectively communicate ideas through written argument, web-based content, and presentations (Here's what the official course catalog description says: \"This course provides an overview of media in historical, current and future contexts. Incorporating lectures and discussion with hands on work involving written and interactive media assets, students examine the role of written and visual media from theoretical as well as practical perspectives. The course also provides an introduction to interactive media development techniques, including digital media components and delivery environments. Students will be required to write formal analysis and critique papers, and use digital modes of writing including collaborative editing and effective presentation design. \") Fall 2018: Website and GitHub repository Fall 2017: GitHub repository Website Design & Development IGME-230 The title is pretty accurate; students learn about both the design and development of websites. The design aspects don't just focus on aesthetics; we also discuss overall process for site design, ranging from needs assessment to wireframing to iterative testing. Students also learn how to create pages with responsive designs that work well across a variety of platforms. On the development side, we cover advanced HTML and CSS techniques (like Flexbox and Grid), use Git and GitHub for both version control and web publishing, work with Javascript and JS libraries for interactivity, and explore how web servers and web hosting operate. (Here's what the official course catalog description says: \"This course provides an introduction to web development tools and technologies, such as X/HTML, CSS, Javascript and DHTML, AJAX, web platforms and environments, and server-side programming methods.\") Fall 2018: Website and GitHub repository Fall 2017: GitHub repository Game Design & Development I igme-220 Course Catalog: This course examines the core process of game design, from ideation and structured brainstorming in an entertainment technology context through the examination of industry standard processes and techniques for documenting and managing the design process. This course specifically examines techniques for assessing and quantifying the validity of a given design, for managing innovation and creativity in a game development-specific context, and for world and character design. Specific emphasis is placed on both the examination and deconstruction of historical successes and failures, along with presentation of ethical and cultural issues related to the design and development of interactive software and the role of individuals in a team-oriented design methodology. Students in this class are expected to actively participate and engage in the culture of design and critique as it relates to the field. Spring 2018: GitHub reposository Research Curriculum Vita Research Blog Zotero Library My current research interests focus on include the intersection of games and tourism, and the evaluation and dissemination of creative scholarly work. I was named a Fulbright Teaching Scholar in 2014, and spent the spring semester in Dubrovnik, Croatia developing and teaching courses on games and tourism for Croatian and US study abroad students. In the spring of 2018, I ran the first study abroad program on the intersection of the two fields with students from RIT. I am currently working on developing a taxonomy of tourism games. As a games and media scholar with a background in library and information science, I am particularly interested in the publishing challenges facing scholars in interdisciplinary digital media fields—including both games and digital humanities. I am currently working on projects related to overlay journals for highlighting interdisciplinary research published in discipline-specific journals, and the development of a repository system to provide access and authoritative citations to digital media projects. Project Highlights I was the lead PI and producer for two large community-focused games, Just Press Play at RIT, and Picture the Impossible in Rochester, NY. Just Press Play 2011-2013 Just Press Play was an achievement system developed for students in RITâs School of Interactive Games, designed to engage students, faculty, and staff in a playful way with their educational environments and experiences. Decker, A., & Lawley, E. L. (2013). Lifeâs a Game and the Game of Life: How Making a Game out of It Can Change Student Behavior. Proceeding of the 44th ACM Technical Symposium on Computer Science Education, 233â238. https://doi.org/10.1145/2445196.2445269 Lawley, E. L., & Phelps, A. (2013). âYou Know Youâre Going to Fail, Right?â: Learning From Design Flaws in Just Press Play at RIT. Presented at GLS 9.0 Conference, Madison, WI. Martinez, R., Martin, C., Harris, S., Squire, K., Phelps, A., & Lawley, E. (2012). Just Press Play: Design Implications for Gamifying the Undergraduate Experience. Proceedings of GLS 8.0. Madison, WI: ETC Press. Rheingold, H. (2012). Elizabeth Lawley: âJust Press Playâ â Adding a Game Layer to the Undergraduate Experience | DMLcentral. Retrieved from http://dmlcentral.net/blog/howard-rheingold/elizabeth-lawley-%E2%80%9Cjust-press-play%E2%80%9D-%E2%80%94-adding-game-layer-undergraduate Picture the Impossible 2008-2009 Picture the Impossible was a community-based game developed jointly by the Lab for Social Computing at the Rochester Institute of Technology, and the Rochester Democrat and Chronicle. It was intended to encourage more residents of the metropolitan area to explore and learn about Rochester's rich cultural heritage, and to encourage both creativity and charitable giving in the community. The game incorporated a range of activities, including casual web-based games, games that brought players out to events and locations throughout the community, and games that involved the tangible aspects of the Democrat & Chronicle newspaper itself Beckett, L. (2009, September 15). In Rochester, a newspaper dips into gaming to reach new young readers. Retrieved May 9, 2019, from Nieman Lab website: https://www.niemanlab.org/2009/09/in-rochester-a-newspaper-dips-into-gaming-to-reach-new-young-readers/ Beckett, L. (2010, November 30). Making social gaming scale: Lessons from the Democrat and Chronicleâs adoption of alternate reality. Retrieved December 8, 2010, from Nieman Journalism Lab website: http://www.niemanlab.org/2010/11/making-social-gaming-scale-lessons-from-the-democrat-and-chronicles-adaption",
  "content_length": 10265,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:01"
}