{
  "name": "Elizabeth A. Sonenberg",
  "homepage": "http://people.eng.unimelb.edu.au/lizs",
  "status": "success",
  "content": "Liz Sonenberg Liz Sonenberg Contact · Postal address: Professor Liz Sonenberg School of Computing and Information Systems The University of Melbourne Parkville 3010, Australia Note: news about the University can be found at https://about.unimelb.edu.au/newsroom; research stories are highlighted at https://pursuit.unimelb.edu.au/ ; and items of broad interest from the university sector are at http://theconversation.edu.au Roles: I have a full-time Chancellery role as Pro Vice Chancellor (Systems Innovation), held across Chancellery Research and Enterprise and the Chancellery Chief Operating Officer Portfolio. My current research and supervision activities are outlined below. For general enquiries re IT programs, including graduate study, see the School of Computing and Information Systems www.cis.unimelb.edu.au Phone: +61 3 9035 8619 Email: l.sonenberg \"at\" unimelb \"dot\" edu \"dot\" au Physical Location Maps of the Parkville campus of the University of Melbourne are here and a Google Maps link is here My PVC office is room 6.03, Level 6, Raymond Priestley Building (Building 152) My School of Computing and Information Systems home is on Level 3 of the Melbourne Connect building (Building 290) Research interests My research interests include the design of reasoning machinery for systems that exhibit complex collaborative behaviours. For some years my major research efforts have been in the foundations and applications of systems within the BDI (Belief, Desire, Intention) agent paradigm, with a particular focus on teamwork, but I have also studied various elements of non-monotonic reasoning.  I have collaborated on applied problems with industry colleagues and worked with collaborators in Psychology and Education on studies involving human reasoning processes. I am a participant in the Human Computer Interaction Lab and the AI & Autonomy Lab . My particular interests are in: Multi-agent systems - especially collaboration and teamwork Explanation in Artificial Intelligence Human-machine interaction in support of decision making The integrating theme of my research is the conceptualisation and construction of more adaptive, distributed, and intelligent information systems. Much of the work focuses on agent technology, which views a distributed system in terms of interacting autonomous software entities. Using the agent metaphor can allow system developers to adopt a level of abstraction in design that is useful for modelling complex tasks and environments, and in building software systems that are robust in the face of change and unexpected events. An important aspect of the research is the requirement of the human-machine interface and consequent implications for the development of computational mechanisms to support decision-making in complex settings. Current and recent projects include: Explanation in artificial intelligence: a human-centred approach - Funded 2019-2021 Australian Research Council - with Frank Vetere, Tim Miller, Eduardo Velloso, Piers Howe, Paul Dourish (UC Irvine). This project contributes to a broad XAI agenda in the School. Post-doctoral fellow supporting this project was Ronal Singh, now at CSIRO Explanatory AI for Maritime Domain Awareness - Funded 2019-2022 DST Group - with Tim Miller, Ronal Singh, Michelle Blom, Kerry Trentelman (DST Group), Adam Saulwick (DST Group) A Computational Theory of Strategic Deception - Funded 2018-2021 Australian Research Council - with Wally Smith, Michael Kirley, Gustav Kuhn (University of London), Frank Dignum (Umea University, Sweden) Post-doctoral fellow supporting this project was Peta Masters, now at Kings College, London Collaborative Human-Agent Planning - Microsoft Research, 2018. With Ronal Singh, Tim Miller, Frank Vetere. \"Why?\": Causal Explanation in Trusted Autonomous Systems - CERA Next Generation Technologies Fund grant. 2017-2018. With Tim Miller, Piers Howe (Melbourne School of Psychological Sciences), Glennn Moy, Luke Marsh, Darren Williams (DST Group). Post-doctoral fellow supporting this project was Mor Vered, now at Monash University Foundations of human-agent collaboration: situation-relevant information sharing- Funded 2013-2015 Australian Research Council - with Adrian Pearce Tim Miller and Frank Dignum (then at Universiteit Utrecht) Post-doctoral fellows supporting this project were Paolo Felli (now at University of Bologna) and Christian Muise (now at Queens University, Canada) Implicit Transmission of Embodied Culture - Funded 2010-2012 Australian Research Council - with Yoshi Kashima, Simon Laham, Nick Haslam, Frank Dignum (Universiteit Utrecht) Cross-Community Information Systems: Understanding Technology-Practice Fit in Healthcare - Funded 2008-2010 Australian Research Council - with Steve Howard, Rens Scheepers Dynamic personalisation for assisted navigation of information rich, physical environments - the Kubadji project - Funded 2007-2009 Australian Research Council - with Tim Baldwin and Stephen Bird,  Ingrid Zukerman (Monash University), Lawrence Cavedon (RMIT and NICTA) and Carolyn Meehan (Melbourne Museum) Interest based Negotiation: Theory and Practice - Funded 2004-2007 Australian Research Council. Post-doctoral fellow who supported this project was Philippe Pasquier, now at Simon Fraser University, Canada Publications Information variously available from Google Scholar, DBLP (these harvest differently, so have different coverage) Research students Important information for prospective research students is here (read this before making contact re possible supervision): I currently co-supervise the following PhD student(s): Thao Le - primary supervisor Tim Miller, co-supervisor Ronal Singh Useful resources for research students include: a collection of pointers to Advice on Doing a PhD by Robert Dale, Macquarie University a selection of links on Research and Writing in Computer Science, Mark Leone, CMU Videos by Simon Peyton-Jones on `How to write a great research paper,' and `How to give a great research talk' Common Errors In English by Paul Brians, Washington State University My PhD graduates: Prashan Madumal PhD 2021. Explainable Reinforcement Learning Through a Causal Lens. Primary supervisor Tim Miller, co-supervisor Frank Vetere Kathleen Keogh PhD 2020. Improvised coordination in agent organisations. Cosupervised with Wally Smith Ronal Singh PhD 2018. Designing for Multi-Agent Collaboration: A Shared Mental Model Perspective. Cosupervised with Tim Miller Abhi Butchibabu PhD 2016, MIT. Anticipatory Communication Strategies for Human-Robot Team Coordination. Primary Supervisor was Julie Shah (MIT) Beth Cardier, PhD, 2013. Unputdownable: how the agencies of compelling story assembly can be modeled using formalisable methods from Knowledge Representation, and in a fictional tale about seduction.- primary supervisor Kevin Brophy (Faculty of Arts) Jens Pfau PhD 2013. Towards Computational Models of Cultural Dynamics Based on the Grounding Model of Cultural Transmission, primary supervisor Michael Kirley, co-supervisor Yoshi Kashima (Psychological Sciences) Emma Norling PhD, 2012. Modelling Human Behaviour with BDI Agents Karl Grieser, PhD, 2012. Computing Relationships and Relatedness Between Contextually Diverse Entities.- co-supervised with Tim Baldwin Fabian Bohnert, PhD 2010, Monash University. Adaptive User Modelling and Recommendation in Constrained Physical Environments. Primary supervisor was Ingrid Zukerman  (Monash University) Yen Ting Kuo, PhD, 2010. Mining Surprising Patterns - cosupervised with Andrew Lonie and Adrian Pearce Daghan Acay, PhD 2009. Extrospection: Software Agents Reason about the Tools in Their Environment, co-supervised with Gil Tidhar Fernando Koch PhD 2009, Utrecht University. An Agent-Based Model for the Development of Intelligent Mobile Services primary supervisors John-Jules Meyer and Frank Dignum Samin Karim PhD 2009. Acquiring plans within situated resource-bounded agents: a hybrid BDI-based approach (cosupervised with Phillipe Pasquier and Clint Heinze) Raymond So, PhD 2008. Situation awareness in software agents: Theory and practice Budhitama Subagdja, PhD 2007. Intentional learning in bounded-rational agents (cosupervised with Iyad Rahwan) Iyad Rahwan PhD, 2005. On interest-based negotiation Clinton Heinze, PhD 2003. Modelling Intention Recognition for Intelligent Agent Systems (cosupervised by Leon Sterling) Anne Rouse, PhD 2002. IT outsourcing revisited David Kinny, PhD 2001. Fundamentals of Agent Computation Theory: Semantics David Morley, PhD 1999. Semantics of Actions, Agents, and Environments Gil Tidhar, PhD 1999. Organisation Oriented Systems: Theory and Practice Todd Mansell, PhD 1995. (cosupervisor with G Smith, AAII), Planning under Uncertainty Wilson Wen, PhD 1991. Information Theory and Probabilistic Reasoning Past students: Research/masters students Other My current and past research community and related activities include: Keynote presenter, 23rd International Conference on Autonomous Agents and Multi-Agent Systems (AAMAS 2024), ``Humans and Agents: Trajectories and Perspectives,'' selected references here Co-organiser, Agents-Vic Autumn Symposium, May 2024 Panel Judge, 2024 Eureka Prize for Excellence in Research Software Invited presenter, Rebellion and Disobedience in AI (RaD-AI), AAMAS 2023 Workshop, London; reference list here Panel Judge, 2023 Eureka Prize for Excellence in Research Software Presenter, Monash International School in Artificial Intelligence and its Applications in Computer Science (ISAAC) 2022, extract of presentation slides here Keynote presenter, Bristol Interactive AI Summer School (BIAS) 2022, \"Imperfectly rational, rationally imperfect, or perfectly irrational: challenges for human-centred AI.\" References here Speaker, Crossley Festschrift Logic Colloquium, June 2022, (\"Logics and Collaboration\") YouTube recording (44mins) here. References here Panellist, Webinar on Explainable AI, hosted by APRU and Heinrich Böll Stiftung, May 2022, recordin",
  "content_length": 13850,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:57"
}