{
  "name": "Elizabeth Anne Quaglia",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/elizabeth-quaglia",
  "status": "success",
  "content": "Elizabeth Quaglia - Royal Holloway Research Portal Elizabeth Quaglia Dr Reader, Department of Information Security Phone+44 1784 276305EmailElizabeth.Quagliarhul.acuk TW20 0EX Research output 26 Conference contribution 4 Article 3 Paper 1 Book 2 More 1 Chapter 1 Doctoral Thesis Research output per year Research output per year Advanced Cryptographic ProtocolsQuaglia, E. (Editor) & Venturi, D. (Editor), 2025, De Cifris Press.Research output: Book/Report › Book Proceedings of Cryptography and Coding - 19th IMA International Conference, IMACC 2023Quaglia, E., 2024, Cryptography and Coding - 19th IMA International Conference, IMACC 2023..Research output: Chapter in Book/Report/Conference proceeding › Chapter Open Access Reframing Cyber Security for the Next Generation of Digital ActivistsQuaglia, E. A. & Reddington, J., 27 Nov 2024, In: The Journal of The Colloquium for Information Systems Security Education.Research output: Contribution to journal › Article › peer-review Applications of Timed-release Encryption with Implicit AuthenticationLoe, A., Medley, L., O'Connell, C. & Quaglia, E., 13 Jul 2023, Africacrypt 2023. Springer, p. 490-515 26 p. (Lecture Notes in Computer Science ).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 86 Downloads (Pure) CLUE: Certificateless Updatable EncryptionKnapp, J. & Quaglia, E. A., May 2023, ITASEC 2023 - Italian Conference on Cyber Security.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile 146 Downloads (Pure) View all 36 research outputs Projects 4 Active 6 Finished Projects per year EPSRC Training AwardQuaglia, E. (PI)1/10/25 → 31/03/26Project: Other Emmy Noether FellowshipQuaglia, E. (PI)1/08/25 → 31/07/26Project: Research Post-Quantum Secure Cryptographic Delay: Maths and ConstructionsQuaglia, E. (Fellow)London Mathematical Society1/08/25 → 31/07/26Project: Research Fake in the CommunityDwyer, A. (PI), Coles-Kemp, L. (CoI), Quaglia, E. (CoI) & Francati, D. (CoI)Arts & Humanities Research Council AHRC1/07/25 → 1/03/26Project: Research Cybersecurity for ChangemakersQuaglia, E. (PI) & Reddington, J. (CoI)28/09/22 → 31/03/23Project: Research View all 10 projects Activities 3 Workshop, seminar, course or webinar. 1 Participation in a conference 1 Editor of research journal 1 Invited talk 1 More 1 Visiting an external academic institution Activities per year Università di Roma 'La Sapienza'Quaglia, E. (Visiting researcher)2025Activity: Visiting an external organisation › Visiting an external academic institution London Crypto Day 2025Quaglia, E. (Organiser) & Weinert, C. (Organiser)2025Activity: Participating in or organising an event › Workshop, seminar, course or webinar. London Crypto Day 2024Ball, L. (Organiser), Quaglia, E. (Organiser) & Weinert, C. (Organiser)15 Nov 2024Activity: Participating in or organising an event › Workshop, seminar, course or webinar. Cryptography Round Table and Reading GroupWeinert, C. (Speaker) & Quaglia, E. (Speaker)30 Jun 2023Activity: Talk, presentation or media contribution › Invited talk London Crypto Day 2023Quaglia, E. (Organiser) & Weinert, C. (Organiser)9 Jun 2023Activity: Participating in or organising an event › Workshop, seminar, course or webinar. View all 7 activities",
  "content_length": 3312,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:58"
}